{
  "url": "https://ahrefs.com/blog/fr/comment-fonctionnent-moteurs-recherche/",
  "slug": "comment-fonctionnent-moteurs-recherche",
  "title": "Comment marchent les moteurs de recherche ? Guide du débutant - SEO Blog by Ahrefs",
  "description": "Les moteurs de recherche explorent le web grâce à des bots appelés spiders. Ils suivent les liens pour trouver du nouveau contenu et l’ajouter à leur index.",
  "content": "Joshua Hardwick Responsable des contenus @ Ahrefs (ce qui veut dire en gros, que je dois m’assurer que chaque article publié est ÉPIQUE). Les moteurs de recherche explorent (“craw­lent”) le web grâce à des bots appelés spi­ders. Ces crawlers suiv­ent les liens de page en page pour trou­ver du nou­veau con­tenu et l’ajouter à leur index de recherche. Lorsque vous utilisez un moteur de recherche, les résul­tats per­ti­nents sont extraits de l’index et sont classés (“rankés”) à l’aide d’un algorithme.Si cela vous sem­ble com­pliqué, c’est nor­mal : ça l’est. Mais si vous voulez être mieux posi­tion­né dans les résul­tats de recherche pour obtenir plus de traf­ic sur votre site, il faut com­pren­dre les bases : com­ment les moteurs de recherche trou­vent, index­ent et classent le contenu.C’est ce que vous allez appren­dre dans ce guide.Con­tents Guide SEO 1Fonctionnement des moteurs de recherche 2Bases du référencement 3Recherche de mots-clés (EN) 4Contenu SEO (EN) 5SEO sur la page 6Création de liens 7SEO technique Part 1Les bases des moteurs de rechercheAvant de ren­tr­er dans le côté tech­nique, assurons-nous de com­pren­dre ce que sont les moteurs de recherche, pourquoi ils exis­tent et pourquoi est-ce que tout cela a de l’importance.Que sont les moteurs de recherche ?Les moteurs de recherche sont des out­ils qui trou­vent et classent le con­tenu du web qui cor­re­spond à la requête de l’utilisateur du moteur.Chaque moteur de recherche a deux par­ties principales : Search index, l’index de recherche. Une librairie numérique qui con­tient des infor­ma­tions sur les pages web Algorithme(s) de recherche. Un ou plusieurs pro­grammes infor­ma­tiques qui classent les con­tenus selon la requête tapée dans le moteur.Comme moteurs de recherche les plus util­isés, on peut citer Google, Bing et DuckDuckGo.Quel est le but des moteurs de recherche ?Chaque moteur de recherche a pour but de fournir les meilleurs résul­tats, les plus per­ti­nents, à ses util­isa­teurs. C’est comme cela qu’ils gag­nent ou main­ti­en­nent leur part de marché. Du moins en théorie.Comment les moteurs de recherche gagnent-ils de l’argent ?Les moteurs de recherche ont deux types de résultats : Résul­tat organique du search index. On ne peut pas pay­er pour y apparaître. Résul­tats payants des pub­lic­ités. Vous devez pay­er pour y apparaître.Chaque fois que quelqu’un clique sur un résul­tat payé (les fameux pre­miers résul­tats “Annonce” sur Google par exem­ple) la cible du lien paye le moteur de recherche. C’est ce qu’on appelle le PPC, pay-per-click ou coût par clic (CPC) en français.D’où l’importance de la part de marché : plus il y a d’utilisateurs, plus ces pub­lic­ités sont cliquées, plus les revenus augmentent.Pourquoi se soucier de la manière dont fonctionnent les moteurs de recherche ?Com­pren­dre com­ment les moteurs de recherche trou­vent, index­ent et classent le con­tenu va vous aider à mieux posi­tion­ner votre site dans les résul­tats de recherche organique sur des requêtes ou mots-clés per­ti­nents et fréquem­ment utilisés.Si vous vous posi­tion­nez bien sur ces requêtes, vous obtien­drez plus de clics et donc plus de traf­ic organique sur votre contenu.Quel est le moteur de recherche le plus utilisé ?Google. Il représente 92% de parts de marché.Google est le moteur de recherche dont se soucient le plus la plu­part des pro­fes­sion­nels du SEO et des pro­prié­taires de site. Il est en mesure d’envoyer plus de traf­ic que n’importe quel autre. (en anglais) 7 Alter­na­tive Search Engines to Google(en anglais) SEO vs. PPC: Which Should You Use?Part 2Comment les moteurs de recherche construisent leur indexLes moteurs de recherche les plus con­nus comme Google et Bing dis­posent de tril­lions de pages dans leur index de recherche. Avant de par­ler d’algorithmes de rank­ing, voyons un peu plus en détail la méth­ode qu’ils utilisent pour con­stru­ire et entretenir cet index.Voici le proces­sus de base, comme nous le dit Google :Voyons cela étape par étape :URLsCrawl (explo­ration)Traite­ment et renduIndex­a­tionNote. Le proces­sus ci-dessous s’applique spé­ci­fique­ment à Google, mais il y a de grandes chances que ce soit très sim­i­laire pour des moteurs de recherche comme Bing. Il existe d’autres types de moteurs comme Ama­zon, YouTube et Wikipé­dia qui ne mon­trent que les résul­tats issus de leur pro­pre site. Étape 1 : URLsTout com­mence par une liste des URLs con­nues. Google les décou­vre par dif­férents moyens, mais voici les trois plus fréquents :Depuis les backlinks (liens entrants)Google dis­pose déjà d’un index de tril­lions de pages web. Si quelqu’un ajoute dans l’une d’entre elles un lien vers l’une de vos pages, il peut vous trou­ver comme cela.Vous pou­vez voir la liste des back­links de votre site gra­tu­ite­ment en util­isant l’Explo­rateur de Site avec les Out­ils de Web­mas­ter de Ahrefs.Inscrivez-vous gra­tu­ite­ment à un compte d’outils de Web­mas­ter de AhrefsCollez votre domaine dans l’Explo­rateur de siteRen­dez-vous sur le rap­port de back­links, liens entrants.Notre crawler est le deux­ième plus act­if après Google, vous devriez donc trou­ver une liste raisonnable­ment com­plète de vos back­links à cet endroit.Depuis les sitemapsUn sitemap fait la liste de toutes les pages impor­tantes de votre site. Si vous soumet­tez votre sitemap à Google, cela va l’aider à trou­ver votre site plus vite.Depuis une soumission d’URLGoogle per­met aus­si la soumis­sion d’URL indi­vidu­elles via la Google Search Console.Étape 2 : exploration (crawling)L’étape de crawl­ing est lorsque qu’un bot infor­ma­tique appelé spi­der (comme Google­bot) vis­ite et télécharge les pages découvertes.Il faut savoir que Google ne crawle pas tou­jours les pages en suiv­ant l’ordre dans lequel il les découvre.L’ordre dans lequel il classe l’exploration se base sur plusieurs fac­teurs dont :Le PageR­ank de l’URLLa fréquence à laque­lle l’URL changeSi le con­tenu est récent ou ancien.Il faut le savoir, car cela veut dire que les moteurs de recherche vont peut-être crawler et index­er cer­taines de vos pages avant les autres. Si vous avez un gros site inter­net, il fau­dra cer­taine­ment un bon moment aux moteurs de recherche pour l’explorer entièrement.Étape 3 : traitementLe traite­ment est l’étape où Google tente de com­pren­dre et extraire les infor­ma­tions les plus impor­tantes des pages qu’il explore. Per­son­ne en dehors du géant Google ne con­nait tous les détails de ce proces­sus. Mais les par­ties les plus impor­tantes pour bien com­pren­dre la méth­ode sont l’extraction de lien et le stock­age de con­tenu pour indexation.Google a besoin de charg­er les pages en entier pour les traiter, c’est le moment où le moteur de recherche déroule tout le code de la page pour com­pren­dre com­ment il appa­raît pour les utilisateurs.Cela dit, cer­taines phas­es du traite­ment arrivent avant et après ce charge­ment, comme vous pou­vez le voir dans le dia­gramme plus haut. Étape 4 : l’indexationL’indexation est la par­tie du proces­sus où les infor­ma­tions des pages explorées sont ajoutées à l’immense base de don­nées appelée Search Index. C’est glob­ale­ment une libraire numérique de tril­lions de pages web d’où Google va tir­er ses résul­tats de recherche.C’est là un point impor­tant. Lorsque vous tapez une requête dans un moteur de recherche, vous ne cherchez pas réelle­ment tout inter­net. Les résul­tats seront issus de l’index des pages web du moteur de recherche. Si une page n’est pas dans l’index, les util­isa­teurs du moteur de recherche ne pour­ront pas les trou­ver. C’est pour cela que faire index­er vos sites dans les plus grands moteurs de recherche comme Google et Bing est important.Qu’est-ce qu’un backlink ?Com­ment créer une sitemap XML ?PageR­ank : le guide du débutantPart 3Comment les moteurs de recherche classent les pagesLa décou­verte, le crawl et l’indexation du con­tenu ne sont que les pre­mières pièces du puz­zle. Les moteurs de recherche ont besoin d’un moyen de faire cor­re­spon­dre les résul­tats avec ce que tapent les util­isa­teurs. C’est le tra­vail des algorithmes. Chaque moteur de recherche utilise ses pro­pres algo­rithmes pour class­er, “ranker” les pages. Google étant celui le plus large­ment util­isé (à part en Asie et en Russie), c’est celui sur lequel nous allons nous con­cen­tr­er dans ce guide.Google est célèbre pour avoir plus de 200 fac­teurs de classe­ment, ou ranking.Per­son­ne ne les con­naît réelle­ment tous, mais nous en savons assez sur les plus importants.Par­lons-en :Back­links (liens entrants)Per­ti­nenceFraîcheurAutorité sur le sujetVitesse de la pageAdap­té aux mobilesBacklinks (liens entrants)Les back­links sont l’un des fac­teurs de rank­ing les plus impor­tants de Google.Cela a été con­fir­mé par Andrey Lupatt­sev, un Stratège Senior en Qual­ité de Recherche chez Google, lors d’un webi­naire en 2016. Lorsqu’on lui a demandé quels étaient les deux plus impor­tants fac­teurs de rank­ing, sa réponse était sim­ple : le con­tenu et les liens.Tout à fait. Je peux vous dire ce qu’ils (les deux plus impor­tants fac­teurs) sont. C’est le con­tenu. Ce sont les liens qui pointent vers votre site.Les liens ont été d’une impor­tance cap­i­tale pour Google depuis 1997 lorsqu’ils ont mis en place PageR­ank, une for­mule dont le but est de juger de la valeur d’une page web en se bas­ant sur la quan­tité et la qual­ité des liens entrants vers le site.Lorsque nous avons analysé plus d’un mil­liard de pages, nous avons décou­vert une forte cor­réla­tion entre le nom­bre de sites qui pro­posent un lien vers une page et le traf­ic organique que cette dernière obtient de Google.Mais ce n’est pas qu’une ques­tion de quan­tité, tous les back­links ne sont pas égaux. Il est tout à fait pos­si­ble pour une page d’avoir peu de back­links de qual­ité et d’en dépass­er une autre qui dis­pose de beau­coup plus de back­links, mais de plus basse qualité.Il y a six fac­teurs clés pour définir un bon backlink.Regar­dons d’un peu plus près ce que l’on pour­rait con­sid­ér­er comme les deux élé­ments les plus impor­tants : l’autorité et la per­ti­nence.Autorité de lienLes back­link sur des pages ou sites qui sont déjà recon­nus comme d’une cer­taine autorité ou impor­tance ont un plus gros impact sur le ranking.Com­ment définir l’autorité ? Dans le SEO, ce que l’on con­sid­ère comme ayant une forte autorité sont les pages ou sites qui ont le plus de back­links, que l’on peut con­sid­ér­er comme des “votes”.Chez Ahrefs, nous nous basons sur deux fac­teurs pour estimer l’autorité rel­a­tive d’une page ou d’un site : L’autorité de domaine ou Domain Rat­ing (DR) : l’autorité rel­a­tive d’un site sur une échelle de 0 à 100. L’autorité d’URL ou URL Rat­ing (UR) : l’autorité rel­a­tive d’une page sur une échelle de 0 à 100.Vous pou­vez voir l’autorité de n’importe quel site ou page dans l’Explo­rateur de Site de Ahrefs.Pertinence de lienLes liens qui vien­nent de sites et pages per­ti­nents ont générale­ment plus de valeur.Google par­le de l’importance du con­texte dans le classe­ment des pages qu’il con­sid­ère comme utiles dans son expli­ca­tion de la manière dont la recherche fonc­tionne.Si d’autres sites recon­nus sur le sujet ren­voient vers la page, c’est un bon sig­nal que l’information est de bonne qualité.Si vous vous deman­dez pourquoi la per­ti­nence a une impor­tance, com­parez cela à la vraie vie. Vous allez sans doute porter plus de crédit à l’avis de votre ami chef cuisinier lorsque vous cherchez un bon restau­rant qu’à celui de votre ami vétéri­naire. Mais si vous cher­chiez des infor­ma­tions sur la nour­ri­t­ure pour chat, ce serait l’inverse.PertinenceGoogle a plusieurs moyens de déter­min­er la per­ti­nence d’une page.Pour ce qui est du plus sim­ple, il véri­fie que les pages con­ti­en­nent les mêmes mots-clés que la requête de recherche.“Le sig­nal le plus sim­ple indi­quant la présence d’in­for­ma­tions per­ti­nentes dans une page Web est la présence de mots-clés fig­u­rant dans votre requête de recherche.”Mais la per­ti­nence va bien plus loin que la recherche de la présence de mots-clés.Google utilise aus­si des don­nées sur l’interaction de ses util­isa­teurs avec ses résul­tats de recherche. En d’autres mots, est-ce que les util­isa­teurs trou­vent la page utile ?“Au-delà de la sim­ple iden­ti­fi­ca­tion de mots-clés en com­mun, nous util­isons des don­nées d’in­ter­ac­tions glob­ales et anonymes pour éval­uer l’in­térêt des résul­tats de recherche en lien avec les requêtes.”C’est en grande par­tie pour cela que tous les meilleurs résul­tats pour “apple” sont au sujet de la société, pas du fruit (pomme en anglais). En analysant les don­nées d’interactions, il a déter­miné que la majorité des per­son­nes qui tapent ces recherch­es veu­lent en appren­dre plus sur la mar­que que sur le fruit.Mais ces fameuses don­nées d’in­ter­ac­tions ne sont pas les seuls élé­ments sur lesquels Google se base.La société a investi dans beau­coup de tech­nolo­gies dif­férentes pour l’aider à mieux com­pren­dre les liens entre les entités comme les gens, les lieux et les objets. Le Knowl­edge Graph (lit­térale­ment graphique de con­nais­sance) est l’une de ces tech­nolo­gies, qui n’est ni plus ni moins qu’une immense base de don­nées d’entités et des rela­tions qu’elles ont entre elles.Apple (le fruit en anglais) et Apple (la société) sont des entités con­nues du Knowl­edge Graph.Google utilise les liens entre les entités pour mieux com­pren­dre la per­ti­nence d’une page. Un résul­tat qui cor­re­spond à “apple” et par­le aus­si d’oranges et de bananes se réfère claire­ment au fruit. Mais une qui par­le aus­si d’iPhone, iPad et iOS par­le cer­taine­ment de l’entreprise.C’est en par­tie grâce à ce Knowl­edge Graph que Google peut aller plus loin que la sim­ple cor­re­spon­dance des mots-clés.Par­fois vous pou­vez voir des résul­tats de recherche qui ne con­ti­en­nent même pas les mots-clés qui sem­blent impor­tants dans la requête. Par exem­ple, si on regarde cer­tains résul­tats de la pre­mière page pour “apple paper app”, le mot “apple” n’est pas dans le contenu.Google sait que c’est un résul­tat per­ti­nent en grande par­tie car la page men­tionne des entités comme iPhone et iPad qui sont bien évidem­ment très proches d’Apple dans le Knowl­edge Graph.Note. Les don­nées d’in­ter­ac­tions et le Knowl­edge Graph ne sont pas les seules tech­nolo­gies util­isées par Google pour jauger de la per­ti­nence d’une page par rap­port à la requête de recherche. Une bonne par­tie du tra­vail repose aus­si sur d’autres tech­nos pour com­pren­dre le sens et les inten­tions der­rière la requête en elle-même, comme BERT et RankBrain. Par­fois Google réécrit la requête sans le mon­tr­er pour don­ner des résul­tats plus pertinents. FraîcheurLa fraîcheur (à quel point le con­tenu est récent) est aus­si un fac­teur qui va dépen­dre de la requête, elle aura plus d’importance pour cer­taines requêtes que pour d’autres.Pour une requête comme “dernières sor­ties sur ama­zon prime” la fraîcheur est très impor­tante car les util­isa­teurs veu­lent savoir quels sont les derniers films et séries qui ont été ajoutés au cat­a­logue. C’est pour cela que Google va plac­er en pre­mier les pages récem­ment pub­liées ou mis­es à jour.Pour des requêtes comme “meilleur casque audio”, la fraîcheur a aus­si de l’importance, mais un peu moins. La tech­nolo­gie audio va vite donc un résul­tat de 2015 n’aura pas beau­coup d’importance, mais un arti­cle pub­lié il y a 2 ou 3 mois pour­rait tou­jours être utile.Google le sait et pour­ra mon­tr­er des résul­tats qui ont été pub­liés ou mis à jour dans les derniers mois.Et il existe aus­si des requêtes où la fraîcheur du résul­tat n’a qua­si­ment aucune impor­tance, comme pour “com­ment faire un nœud de cra­vate”. Rien n’a changé à ce sujet depuis des décen­nies donc, peu importe si la page a été pub­liée hier ou en 1998. Google le sait bien et n’a aucun prob­lème à bien posi­tion­ner des arti­cles qui ont été écrits il y a des années.Autorité du sujetGoogle veut class­er en pre­mier le con­tenu de sites qui ont une cer­taine autorité sur un sujet. Cela veut dire qu’il va juger qu’un site peut tout à fait être une bonne source pour des requêtes sur un cer­tain sujet, mais pas sur d’autres.Google en par­le dans l’un de ses brevets :Que le sys­tème de recherche con­sid­ère un site comme d’autorité va être dépen­dant de la requête (…) par exem­ple le sys­tème peut con­sid­ér­er un site du cen­tre de con­trôle des mal­adies “cdc.gov” pour être une source d’autorité pour des recherch­es comme “CDC piqûre de mous­tique”, mais ne le trou­vera pas per­ti­nent pour des requêtes comme “recom­man­da­tion de restaurant”.Même si cela n’est que l’un des nom­breux brevets déposés par Google, on voit facile­ment les preuves que “l’autorité de sujet” joue un rôle dans le classe­ment des résul­tats pour beau­coup de requêtes.Voyons les résul­tats pour “sous vide vac­u­um seal­er” (pompe à vide).Nous voyons ici deux petits sites de niche qui par­lent de la cui­sine sous vide qui dépasse le New York Times.Même s’il y a cer­taine­ment d’autres fac­teurs en jeu ici, il sem­ble très prob­a­ble que “l’autorité de sujet” est l’une des raisons du posi­tion­nement de ces sites.C’est sans doute la rai­son pour laque­lle le guide du débu­tant en SEO de Google suggère :Cul­tivez la répu­ta­tion d’expertise et de fia­bil­ité dans un domaine spécifique.Vitesse de la pagePer­son­ne n’aime atten­dre que les pages char­gent, et Google le sait. C’est pour cela que la vitesse d’une page entre en compte dans le classe­ment des résul­tats sur ordi­na­teur depuis 2010 et des recherch­es sur mobile depuis 2018.Beau­coup de gens font une fix­a­tion sur la vitesse des pages, il faut donc pré­cis­er que vos pages n’ont pas besoin de charg­er à la vitesse de l’éclair. Google dit que la vitesse de charge­ment n’est con­sid­érée comme prob­lé­ma­tique que pour celles qui “offrent l’expérience la plus lente à leurs utilisateurs”.En d’autres ter­mes, gag­n­er quelques mil­lisec­on­des sur un site qui est déjà rapi­de a peu de chance d’améliorer votre posi­tion­nement. Il faut juste qu’il soit suff­isam­ment rapi­de pour ne pas avoir un impact négatif sur les utilisateurs.Vous pou­vez véri­fi­er la vitesse de n’importe quelle page web dans le Page­Speed Insights, qui va aus­si vous don­ner des sug­ges­tions pour amélior­er ces scores.Le rap­port de Page­Speed Insight vous mon­tre aus­si les scores de votre page au niveau des Core Web Vitals.Les Core Web Vitals sont basés sur trois indi­ca­teurs qui vont juger de la per­for­mance de charge­ment d’une page, de son inter­ac­tiv­ité et de sa sta­bil­ité visuelle. Google a con­fir­mé que les Core Web Vitals vont com­mencer à avoir un rôle dans le rank­ing à par­tir de juin 2021.Vous pou­vez voir les per­for­mances de toutes les pages de votre site grâce au rap­port Core Web Vitals de la Google Search Console.Si un grand nom­bre de vos URL ont une mau­vaise opti­mi­sa­tion et ont besoin d’être améliorées, par­lez-en à un développeur.Responsive : votre site sur mobile65% des recherch­es Google sont faites sur mobile. C’est pour cela que le respon­sive design d’un site est un fac­teur de classe­ment depuis 2015.Depuis 2019, le respon­sive est aus­si un fac­teur de rank­ing pour les recherch­es sur ordi­na­teur car Google est passé sur une index­a­tion mobile first. Cela veut dire que Google “favorise l’utilisation de la ver­sion mobile du con­tenu pour l’indexation et le rank­ing” quel que soit l’appareil utilisé.En d’autres ter­mes, un site mal opti­misé sur mobile sera pénal­isé dans son rank­ing, même sur ordinateur.Vous pou­vez véri­fi­er si votre site est con­sid­éré comme mobile-friend­ly en util­isant l’outil de Google Mobile-Friend­ly Test, ou bien dans la par­tie Ergonomie mobile de la Google Search Console.10 fac­teurs de rank­ing Google à ne pas ignorerLe Knowl­edge Graph de Google expliqué Les Core Web Vitals expliquéesCom­ment amélior­er la vitesse de votre site Word­Press en 20 MinutesPart 4Comment les moteurs de recherche personnalisent les résultatsLes moteurs de recherche savent que dif­férents résul­tats ne vont pas par­ler de la même manière à dif­férentes per­son­nes. C’est pour cela qu’ils pro­posent des résul­tats sur mesure à chaque utilisateur.Si vous avez déjà ten­té l’expérience de chercher les mêmes requêtes sur plusieurs appareils ou nav­i­ga­teurs, vous aurez déjà vu ces per­son­nal­i­sa­tions. Les résul­tats ne vont sou­vent pas être posi­tion­nés au même endroit en fonc­tion de dif­férents résultats.C’est pour cela que si vous tra­vaillez sur le SEO, il vaut mieux vous servir d’outils dédiés comme le Rank Track­er d’Ahrefs pour suiv­re les posi­tions dans le SERP. Le rank­ing pro­posé dans ces out­ils est nor­male­ment plus proche de la réal­ité car ils con­sul­tent le web d’une manière qui ne donne pas aux moteurs de recherche d’informations leur per­me­t­tant de per­son­nalis­er les résultats.Com­ment les moteurs de recherche per­son­nalisent les résultats ?Google déclare que des “infor­ma­tions comme votre posi­tion, vos his­toriques de recherche et paramètres de recherche (nous) aident à adapter les résul­tats à ce qui est le plus per­ti­nent et vous est le plus utile sur le moment”.Voyons ces trois élé­ments de plus près :1. PositionSi vous cherchez quelque chose comme “restau­rant ital­ien”, vous ver­rez dans les résul­tats de maps que vous aurez des restau­rants locaux.Google fait cela car il y a peu de chance que vous pre­niez un avion pour l’autre bout du monde juste pour déjeuner.Mais Google utilise aus­si votre posi­tion pour per­son­nalis­er les résul­tats en dehors de maps. Si vous descen­dez dans les résul­tats pour “restau­rant ital­ien” même les résul­tats de Tri­pAd­vi­sor sont per­son­nal­isés et l’on voit égale­ment que la plu­part des meilleurs résul­tats sont des sites de restau­rants locaux.Ce sera la même chose pour des requêtes comme “acheter une mai­son”. Google va sor­tir les résul­tats autour de vous plutôt que de par­tir du principe que vous voulez chang­er de pays.Votre posi­tion va avoir un tel impact sur les résul­tats de requêtes locales qu’il n’y a qua­si­ment aucune sim­i­lar­ité si vous cherchez la même chose à deux endroits différents.2. LangueGoogle sait qu’il n’y a pas d’intérêt à pro­pos­er des résul­tats en anglais pour des util­isa­teurs espag­nols. C’est pour cela qu’il posi­tionne la ver­sion anglaise de notre tuto SEO YouTube pour des recherch­es anglo­phones et la ver­sion en espag­nol pour les recherch­es hispanophones.Mais d’une cer­taine manière, Google s’appuie sur les créa­teurs de site inter­net pour faire cela. Si vous avez des pages en plusieurs langues, il ne va pas for­cé­ment s’en ren­dre compte si vous ne le lui “dites” pas.Vous pou­vez le faire avec un attrib­ut HTML appelé hre­flang.L’utilisation de hre­flang est un peu com­pliquée et sort du spec­tre de ce guide, mais pour faire sim­ple c’est un petit bout de code qui indique la rela­tion entre plusieurs ver­sions d’une même page en dif­férentes langues.3. Historique de rechercheL’exemple sans doute le plus fla­grant de la manière dont Google utilise l’historique de recherche pour per­son­nalis­er le résul­tat est lorsqu’il posi­tionne plus haut un résul­tat sur lequel vous avez cliqué la dernière fois que vous avez effec­tué cette recherche.Cela n’arrive pas sys­té­ma­tique­ment, mais reste assez fréquent, surtout si vous cliquez sur le résul­tat ou vis­itez une page plusieurs fois sur une courte période.Pour conclureCom­pren­dre la manière dont fonc­tion­nent les moteurs de recherche et la pre­mière étape pour appren­dre à mieux se posi­tion­ner dans Google et obtenir plus de traf­ic. Si les moteurs de recherche ne peu­vent trou­ver, explor­er et index­er vos pages, vous avez per­du d’entrée de jeu.Si vous voulez appren­dre les bases de l’optimisation de site pour le référence­ment, vous pou­vez lire notre guide sur les bases du SEO.Vous avez des ques­tions ? Faites-le-moi savoir dans les com­men­taires ou sur Twit­ter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Rédigé par Joshua Hardwick Contributeurs Responsable des contenus @ Ahrefs (ce qui veut dire en gros, que je dois m’assurer que chaque article publié est ÉPIQUE). Contributeurs",
  "headers": [
    {
      "level": "H1",
      "text": "Comment marchent les moteurs de recherche ? Guide du débutant"
    },
    {
      "level": "H2",
      "text": "Les bases des moteurs de recherche"
    },
    {
      "level": "H3",
      "text": "Que sont les moteurs de recherche ?"
    },
    {
      "level": "H3",
      "text": "Quel est le but des moteurs de recherche ?"
    },
    {
      "level": "H3",
      "text": "Comment les moteurs de recherche gagnent-ils de l’argent ?"
    },
    {
      "level": "H3",
      "text": "Pourquoi se soucier de la manière dont fonctionnent les moteurs de recherche ?"
    },
    {
      "level": "H3",
      "text": "Quel est le moteur de recherche le plus utilisé ?"
    },
    {
      "level": "H2",
      "text": "Comment les moteurs de recherche construisent leur index"
    },
    {
      "level": "H3",
      "text": "Étape 1 : URLs"
    },
    {
      "level": "H4",
      "text": "Depuis les backlinks (liens entrants)"
    },
    {
      "level": "H4",
      "text": "Depuis les sitemaps"
    },
    {
      "level": "H4",
      "text": "Depuis une soumission d’URL"
    },
    {
      "level": "H3",
      "text": "Étape 2 : exploration (crawling)"
    },
    {
      "level": "H3",
      "text": "Étape 3 : traitement"
    },
    {
      "level": "H3",
      "text": "Étape 4 : l’indexation"
    },
    {
      "level": "H2",
      "text": "Comment les moteurs de recherche classent les pages"
    },
    {
      "level": "H3",
      "text": "Backlinks (liens entrants)"
    },
    {
      "level": "H4",
      "text": "Autorité de lien"
    },
    {
      "level": "H4",
      "text": "Pertinence de lien"
    },
    {
      "level": "H3",
      "text": "Pertinence"
    },
    {
      "level": "H3",
      "text": "Fraîcheur"
    },
    {
      "level": "H3",
      "text": "Autorité du sujet"
    },
    {
      "level": "H3",
      "text": "Vitesse de la page"
    },
    {
      "level": "H3",
      "text": "Responsive : votre site sur mobile"
    },
    {
      "level": "H2",
      "text": "Comment les moteurs de recherche personnalisent les résultats"
    },
    {
      "level": "H3",
      "text": "1. Position"
    },
    {
      "level": "H3",
      "text": "2. Langue"
    },
    {
      "level": "H3",
      "text": "3. Historique de recherche"
    },
    {
      "level": "H2",
      "text": "Pour conclure"
    }
  ],
  "author": "Joshua Hardwick  Patrick Stox  Sam Oh Joshua Hardwick Joshua Hardwick"
}