{
  "url": "https://ahrefs.com/blog/fr/impact-des-liens/",
  "slug": "impact-des-liens",
  "title": "Est-ce que backlinks comptent toujours dans le ranking ? Une étude Ahrefs",
  "description": "Nous avons désavoué les backlink de trois pages pendant un mois pour voir si on perdait du ranking avant de retirer le désaveu pour voir si le positionnement remontait.",
  "content": "Patrick Stox Patrick Stox est conseiller produit, spécialiste SEO technique et ambassadeur à Ahrefs. Il co-organise divers évènements comme le Raleigh SEO Meetup, Raleigh SEO Conference, Beer & SEO Meetup et Findability Conference. Il est aussi modérateur sur /r/TechSEO. Contenus Depuis quelques années, je vois de plus en plus de per­son­nes qui dis­ent que les liens sont morts. Qu’ils n’ont plus d’im­por­tance pour le rank­ing, ils ont per­du leur impor­tance. Les liens sont un fac­teur de rank­ing majeur con­fir­mé, je me suis donc dit qu’il était intéres­sant de tester leur impact.Plutôt que de créer des liens vers des pages, je me suis dit que la manière la plus sim­ple de tester ceci serait de retir­er des liens vers une page et de voir ce qui se pas­sait. Avec l’aide de Joshua Hard­wick, le respon­s­able du con­tenu chez à Ahrefs, nous avons choisi trois arti­cles et désavoué tous les liens vers ces pages pen­dant un mois, reti­rant ain­si la valeur des liens externes. Un mois plus tard, je les ai retirés du fichi­er de désaveu, ce qui aurait dû restau­r­er la valeur de ces liens.Le fichi­er de désaveu a été traité immé­di­ate­ment, mais les liens dans le fichi­er avaient besoin d’être explorés de nou­veau avant de pou­voir voir l’im­pact du désaveu. C’était la même chose une fois le désaveu retiré. Les pages qui envoy­aient du lien devaient être de nou­veau crawlées pour pou­voir con­naître l’impact de la manœu­vre. Je me suis dit qu’un mois pour cha­cune de ces deux péri­odes de temps devrait être néces­saire pour que les liens les plus impor­tants soient explorés et que l’on puisse en voir l’impact.Nous avons désavoué 3 476 liens sur trois arti­cles de blogs. Ceci a été effec­tué le 17 août et retiré qua­tre semaines plus tard le 14 septembre.Alerte spoil­er : Les liens comptent tou­jours. Le traf­ic et le rank­ing des mots-clés ont dimin­ué lorsque j’ai désavoué les liens, et sont remon­tés lorsque j’ai retiré le fichi­er de désaveu.Test du désaveu sur traf­ic organique.L’impact du désaveu de liensRegardez la baisse immé­di­ate de traf­ic lorsque j’ai uploadé le fichi­er de désaveu le 17 août. La chute a con­tin­ué pen­dant un moment à mesure que les pages qui fai­saient des liens vers ces arti­cles étaient explorées. Vous pou­vez égale­ment voir l’effet de remon­tée immé­di­ate lorsque j’ai retiré le fichi­er de désaveu le 14 sep­tem­bre. Je sup­pose que cet impact immé­di­at est lié aux liens de valeur sur des pages qui ont sans doute un fort PageR­ank et sont sou­vent crawlées.Voyons main­tenant cela en détail.Les pages de testLe graphique util­isé ci-dessus utilise le traf­ic moyen organique Ahrefs, qui est une mesure sta­ble de la vis­i­bil­ité de la recherche. Cela fait une approx­i­ma­tion du traf­ic en se bas­ant sur le rank­ing et le CTR estimé pour tous les mots-clés sur laque­lle la page se rank.Je voulais une mesure sta­ble, car je ne voulais pas que les impres­sions ou les clics soient impactés par la saison­nal­ité ou le com­porte­ment des clients. La mesure pour les clics que les impres­sions de la search con­sole auraient cer­taine­ment suivi ces mêmes prob­lé­ma­tiques, mais pas dans tous les cas.Le test s’est fait sur trois pages dif­férentes au total, voyons chaque exemple.Exemple 1.Page: Top YouTube Search­es (2021)Je m’attendais à per­dre un peu de rank­ing pour les recherch­es les plus pop­u­laires et finir par per­dre un peu de traf­ic à cause de la com­péti­tiv­ité du sujet. J’avais rai­son. Cette page a per­du env­i­ron 18% de traf­ic organique le pre­mier mois. Mais je ne m’attendais pas à en per­dre 4% de plus après avoir retiré le fichi­er de désaveu.Nous avons récupéré env­i­ron la moitié de cette perte depuis, mais le traf­ic organique a glob­ale­ment baissé.Essayons de déter­min­er pourquoiVoici quelques-uns des ter­mes qui ont le plus influ­encé nos esti­ma­tions de traf­ic et leurs posi­tion­nements pen­dant les testsPour “youtube search­es” ce sont une page YouTube et une Google Trend qui nous ont poussés vers le bas pen­dant le test. Nous sommes remon­tés n°1 et avons récupéré le traf­ic pour cette requête.Pour “what is the most searched thing on youtube” et “most searched thing on youtube”, un con­cur­rent a récupéré l’extrait mis en avant que nous avions et l’a toujours.Exemple 2.Page: SEO Pric­ing: ~350 Agen­cies, Con­sul­tants, and Free­lancers Reveal How Much SEO CostsJe ne m’attendais pas à un énorme impact sur cette page en reti­rant les back­links tout sim­ple­ment parce que la con­cur­rence était très faible. Mais j’avais tort. Pen­dant que les liens étaient désavoués, la page a per­du 13.3% de son traf­ic. Lorsque j’ai retiré le fichi­er de désaveu, elle a retrou­vé 99% de son traf­ic initial.Voici les ter­mes qui ont le plus influ­encé les esti­ma­tions de traf­ic et le posi­tion­nement pen­dant le test.Exemple 3.Page: Top Bing Search­es (2021)Au vu de la con­cur­rence, je m’attendais à une baisse assez sévère de cette page. Mais étrange­ment, le traf­ic a à peine bais­sé pen­dant la péri­ode de désaveu. Par con­tre, une fois le fichi­er de désaveu retiré, elle a aug­men­té son traf­ic de 44%.C’est cette page qui a faussé les vari­a­tions d’impressions et de clics de l’étude glob­ale. Je pense que c’est prin­ci­pale­ment parce que la plu­part des ter­mes sur lesquels elle rank n’ont pas été réelle­ment impactés.Un seul d’entre eux a réelle­ment eu un impact sur le traf­ic de la page. ConclusionLes liens sont tou­jours impor­tants. Les pages testées sont tou­jours plus bass­es qu’avant cette étude. Cela peut être lié à des change­ments d’algorithme, ou des liens qui n’ont pas encore été crawlés de nou­veau, ou que d’autres sites ont obtenus plus de liens pen­dant qu’elles descendaient. Mais je suis rel­a­tive­ment con­fi­ant dans le fait qu’elles finis­sent par retrou­ver leur traf­ic initial.Je ne vous recom­mande défini­tive­ment pas de désavouer tous les liens vers vos pages. L’outil de désaveu, en général, doit être util­isé avec les plus grandes pré­cau­tions, Google se charge lui-même de déval­uer les mau­vais liens de toute manière.Vous pensez qu’on devrait répéter ce test plusieurs fois pour voir ce qu’il se passe ? Dites-le-moi sur Twit­ter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Rédigé par Patrick Stox Patrick Stox est conseiller produit, spécialiste SEO technique et ambassadeur à Ahrefs. Il co-organise divers évènements comme le Raleigh SEO Meetup, Raleigh SEO Conference, Beer & SEO Meetup et Findability Conference. Il est aussi modérateur sur /r/TechSEO.",
  "headers": [
    {
      "level": "H1",
      "text": "Est-ce que backlinks comptent toujours dans le ranking ? Une étude Ahrefs"
    },
    {
      "level": "H2",
      "text": "Les pages de test"
    },
    {
      "level": "H3",
      "text": "Exemple 1."
    },
    {
      "level": "H3",
      "text": "Exemple 2."
    },
    {
      "level": "H3",
      "text": "Exemple 3."
    },
    {
      "level": "H2",
      "text": "Conclusion"
    }
  ],
  "author": "Patrick Stox"
}