{
  "url": "https://ahrefs.com/blog/de/arten-des-marketings/",
  "slug": "arten-des-marketings",
  "title": "Die 18 wichtigsten Arten des Marketings (mit Beispielen)",
  "description": "Lerne die 18 verschiedenen Marketingarten kennen, mit denen du das Wachstum deines Unternehmens fördern kannst.",
  "content": "Mateusz Makosiewicz Marketingforscher und Ausbilder bei Ahrefs. Mateusz hat über 10 Jahre Erfahrung im Marketing, die er in Agenturen, SaaS- und Hardware-Unternehmen gesammelt hat. Wenn er nicht schreibt, komponiert er Musik oder genießt lange Spaziergänge. Article PerformanceData from AhrefsVerlinkung von Websites 2 Sign up for AhrefsGet SEO metrics of any website or URL.The number of websites linking to this post.This post's estimated monthly organic search traffic. Inhalt In der Geschäftswelt gibt es wirklich viele Arten von Marketing.Um die Sache zu vereinfachen, haben wir hier 18 Marketingarten zusammengestellt, die von Generationen von Marketingfachleuten aus verschiedenen Branchen entwickelt, erprobt und getestet wurden. Wahrscheinlich gibt es für jede dieser Arten irgendwo auf der Welt eine eigene jährliche Konferenz.Du kannst Beispiele für alle 18 Typen in deiner Umgebung finden. Sie werden ständig kopiert und “neu gemischt”, um die Herzen der Kunden zu gewinnen. Irgendwo in dieser Liste könnte sogar der Marketingerfolg des nächsten weltverändernden Unternehmens liegen.Jede von ihnen ist anders, aber die meisten können parallel eingesetzt werden, um einen kugelsicheren Wachstumsmotor zu bilden. In diesem Artikel gehen wir darauf ein:Digital MarketingOffline MarketingInbound MarketingOutbound MarketingContent MarketingSearch Engine MarketingGrowth MarketingB2B MarketingB2C MarketingAffiliate MarketingSocial Media MarketingBrand MarketingDirect MarketingInfluencer MarketingE‑Mail MarketingEmpfehlungsmarketingEvent MarketingGuerrilla Marketing1. Digital MarketingDigitales Marketing ist ein übergreifender Begriff für jede Art von Werbemaßnahme, die das Internet als Kommunikationskanal nutzt. Dementsprechend werden sogar zwei unterschiedliche Marketingtaktiken wie SEO und PPC als digitales Marketing bezeichnet. Dieser Begriff wird oft verwendet, um eine Kategorie von Taktiken vom Offline-Marketing abzugrenzen. Ein BeispielBei Ahrefs nutzen wir verschiedene digitale Marketingtaktiken und Tools, um unser Fachwissen in den Bereichen SEO und Marketing weiterzugeben und unser Produkt zu bewerben. Oft wird ein bestimmtes Thema, wie z.B. eine SEO-Checkliste, in einem Blogbeitrag verwendet, der dann auf anderen Plattformen weiterverwendet und über verschiedene Kanäle beworben wird; all das ist digitales Marketing. Hier ist ein Tweet, der die SEO-Checkliste in einer Infografik zusammenfasst. Looking for a complete SEO checklist for 2021?Here’s one you can follow. pic.twitter.com/65brjXPBcg— Ahrefs (@ahrefs) August 15, 2021Wir haben die Checkliste auch durch Online-Werbung beworben. Dieses Beispiel stammt von Quora Ads:Und hier ist unser Weekly Digest Newsletter, der den ursprünglichen Beitrag bewirbt: Empfehlenswerter Artikel: 7 digitale Marketingstrategien, die auch tatsächlich funktionieren2. Offline MarketingIm Gegensatz zum digitalen Marketing ist Offline-Marketing (oft auch als traditionelles Marketing bezeichnet) ein Sammelbegriff für jede Art von Marketing, die ohne das Internet stattfindet. Wenn eine Anzeige in einem Papiermagazin statt in einem Online-Magazin veröffentlicht wird, ist das Offline-Marketing. Genauso ist es Offline-Marketing, wenn du eine personalisierte Nachricht per Post statt per E‑Mail verschickst. Auch wenn Wörter wie “offline” und “traditionell” den Eindruck erwecken, dass diese Art von Marketing der Vergangenheit angehört, sind Anzeigen in gedruckten Zeitschriften oder zwischen Fernsehsendungen noch nicht verschwunden. Laut Statista hat Fernsehwerbung immer noch die größte Reichweite unter allen Werbeformen.Ein BeispielZwischen 1999 und 2002 warb die Brauerei Anheuser-Busch für ihr Budweiser-Bier mit einem TV-Spot, der zu einem Phänomen der Popkultur wurde. Die “Whassup?”-Kampagne gewann viele Werbepreise, darunter den Grand Prix von Cannes, und half dem Unternehmen, den Absatz von 2,4 Millionen Fässern auf 99,2 Millionen Fässer im Jahr 2020 zu steigern.https://www.youtube.com/watch?v=JJmqCKtJnxM3. Inbound MarketingInbound-Marketing ist eine Marketingstrategie, die darauf abzielt, Kunden mit relevanten und nützlichen Inhalten anzulocken. Um diesen Begriff besser zu verstehen, vergleichen wir ihn mit dem Outbound-Marketing. Während Outbound Marketing versucht, den Kunden mit einer Botschaft zu erreichen, die ihn “unterbricht” (z.B. TV-Werbung, PPC, Plakate), hofft Inbound Marketing darauf, eine Situation zu schaffen, in der ein potenzieller Kunde ein Unternehmen entdeckt, während er nach einer Lösung sucht.Ein Beispiel: Ein Kunde sucht bei Google nach etwas und stößt auf einen relevanten Artikel auf der Website eines Unternehmens. Ein BeispielDie kostenlosen Tools von Ahrefs, wie z.B. der kostenlose Backlink-Checker, sind als eine Form des Inbound Marketings konzipiert. Sie ziehen Kunden von den Suchmaschinenergebnisseiten (SERPs) für Suchanfragen wie “Backlink-Checker” oder “Backlinks analysieren”. Wenn die Suchnachfrage hoch ist, kann diese Art von kostenlosen Tools eine erhebliche Menge an organischem Traffic bringen:Empfehlenswerter Artikel: Was ist Inbound Marketing? Ein Anfänger-Leitfaden4. Outbound MarketingOutbound Marketing ist eine “unterbrechende” Form des Marketings, bei der ein Unternehmen eine Botschaft über ein Produkt durch Kaltakquise, kalte E‑Mails, Postwurfsendungen, die meisten Formen der Werbung usw. an einen potenziellen Kunden weitergibt. Outbound-Marketing versucht, die Zielgruppe unabhängig von ihrem Interesse auf ein Produkt aufmerksam zu machen oder sie zu Handlungen zu bewegen (z. B. Kauf, Abonnement, Besuch eines Geschäfts). Ein BeispielOrte wie der Times Square in New York sind Beispiele dafür, dass Outbound Marketing seinen Höhepunkt erreicht hat, sowohl was den Platz angeht, der für die Vermittlung der Botschaft genutzt wird, als auch das Budget, das für die Verbreitung der Botschaft benötigt wird. Einiges von dem, was du auf dem Bild unten sehen kannst, ist Outbound Marketing durch Plakatwände. 5. Content MarketingContent Marketing ist der Prozess der Erstellung und Verbreitung von Inhalten, um Kunden zu gewinnen und zu binden. Content Marketing wird in der Regel als eine Form des Inbound Marketings praktiziert, bei der der Inhalt eine Lösung für ein Problem bietet, das ein Interessent untersucht. Die Interessenten entdecken die beworbenen Produkte, indem sie sich über ihre Anwendungen informieren. Content Marketing wird oft zur Generierung von Leads eingesetzt, wobei die hochwertigsten Inhalte hinter einem Formular versteckt sind, das persönliche Daten wie Name, Telefonnummer oder E‑Mail abfragt. Später werden diese Informationen dann für andere Marketingmaßnahmen (einschließlich Outbound) verwendet. Ein BeispielEinige beliebte Arten von Content Marketing sind: Blog-ArtikelVideos und Vlogs PodcastsWebinareFallstudieneBooksWhitepaperHier ist ein Beispiel dafür, wie einige davon in einer kohärenten Content-Marketing-Strategie eingesetzt werden können: Empfehlenswerte Artikel: Content Marketing: Ein umfassender Leitfaden für 2022 Wie du eine erfolgreiche Content-Strategie entwickelst 7 inspirierende Content-Marketing-Beispiele (und wie du sie nachmachst)6. Search Engine Marketing (SEM)Suchmaschinenmarketing ist ein Begriff, der verwendet wird, um Werbebotschaften zu beschreiben, die über die SERPs veröffentlicht werden. SEM unterteilt die Nachrichten in zwei Kategorien: bezahlte Ergebnisse und organische Ergebnisse.Organische Ergebnisse sind Seiten, die von einer Suchmaschine wie Google gefunden, gecrawlt und in den SERPs indexiert werden. Die Position in den organischen Ergebnissen kann nicht gekauft, sondern nur durch Content Marketing und SEO beeinflusst werden. Bezahlte Ergebnisse sind eine Form der Pay-per-Click-Werbung. Unternehmen zahlen an Suchmaschinenunternehmen, um an einem Wettbewerb um die beste Anzeigenplatzierung teilzunehmen.Ein BeispielNehmen wir an, du willst in den USA auf der ersten Seite von Google für das Keyword “Marketing Automation” ranken. Du hast zwei Möglichkeiten, das zu erreichen: Die eine ist über bezahlte Ergebnisse und die andere über organische Ergebnisse. Ein bezahltes Ergebnis wird eines davon sein: Und ein organisches Ergebnis wird in etwa so aussehen: Wie du sehen kannst, sehen sie ähnlich aus (und entsprechen den Wünschen von Google). Der Hauptunterschied besteht darin, dass es den Werbetreibenden etwa 50 US-Dollar pro Klick kostet, um zu den großen Playern im Anzeigenbereich zu gehören.Um in den unbezahlten, organischen Bereich aufgenommen zu werden, muss der Werbetreibende relevante Inhalte erstellen, die der Suchintention entsprechen, und eine Menge Backlinks aufbauen.Empfehlenswerter Artikel:SEO vs. SEM: Was ist der Unterschied und warum sollte dich das interessieren? 7. Growth Marketing Growth Marketing ist der Prozess der Umsatzsteigerung eines Unternehmens durch einen experimentellen und integrierten Ansatz für alle Phasen der Kundengewinnung. Growth Marketing ist ein weiterer Begriff, der oft im Gegensatz zum “traditionellen Marketing” verwendet wird. Das liegt daran, dass Growth Marketing, als es Anfang der 2000er Jahre aufkam, schnell von Start-ups übernommen wurde, die einen anderen Ansatz brauchten, der ihnen half: Mit etablierten Unternehmen zu konkurrieren. Die Aufmerksamkeit der Investoren zu gewinnen, indem sie skalierbare Growth-Taktiken beweisen. Die folgende Tabelle erklärt die Unterschiede zwischen Growth Marketing, “traditionellem Marketing” und Growth Hacking. Ein BeispielEs gibt viele erstaunliche und inspirierende moderne Wachstumsgeschichten: Slack, Spotify, Uber und Square. Aber ich möchte dir die Growth-Marketing-Strategie von Notion ans Herz legen, weil sie fast jeden Aspekt des Growth Marketings richtig zu machen scheint. Außerdem wurde es schon dutzende Male analysiert und ist daher ein großartiges Beispiel für Unternehmer und Vermarkter, von dem sie lernen können. Der Erfolg von Notion beruht auf vielen Säulen: einem großartigen Produkt, einer großen und lautstarken Community und dem “Freemium”-Modell.Das Unternehmen betreibt Growth-Marketing, aber es ist kein Black Hat Growth Hacking. Es wächst schnell, aber seine Strategie ist kundenorientiert, gefährdet nicht die Marke und zielt auf Langfristigkeit ab. Viele betonen auch die Rolle der nutzergenerierten Vorlagen für den Erfolg von Notion. Das Unternehmen fördert die Erstellung und den Austausch von nutzbaren Vorlagen für verschiedene Dokumente und Vorgänge.Die Nutzer von Notion erstellen Vorlagen, die andere Nutzer anziehen, ansprechen und an sich binden. Viele dieser neuen Nutzer erstellen und teilen dann ihre eigenen Vorlagen und setzen so den Kreislauf fort.Hier ist eine Grafik von Foundation, die perfekt erklärt, wie diese Taktik den gesamten Marketingtrichter berührt und eine Wachstumsschleife bildet.8. B2B Marketing B2B-Marketing, oder Business-to-Business-Marketing, bezeichnet die Vermarktung von Produkten oder Dienstleistungen durch Unternehmen an andere Unternehmen. Dieser Begriff wird von Marketingfachleuten oft verwendet, um Marketingstrategien und ‑taktiken zu benennen und zu unterscheiden, die in B2B-Beziehungen besonders effektiv sind (z.B. Account Based Marketing), im Gegensatz zu Business-to-Consumer-Beziehungen (B2C).Ein BeispielUnternehmen werben gerne auf LinkedIn. Der Grund: Die Nutzer besuchen die Plattform aus beruflichen Gründen. LinkedIn macht sich das (bewusst) zunutze und bietet eine Reihe von Werbeprodukten an. LinkedIn erzielt mit Abstand ein Drittel aller digitalen B2B-Anzeigeneinnahmen in den USA. Wie du unten sehen kannst, nutzen sogar Giganten wie IBM LinkedIn-Anzeigen, um Kunden zu gewinnen. Diese B2B-Anzeige verweist auf ein Lead-Capturing-Formular, in dem ein kostenloses Guthaben für den IBM Cloud-Service angeboten wird. Empfehlenswerte Artikel:Der Leitfaden für Anfänger im Account Based Marketing (ABM) Was ist B2B Content Marketing? 7 erfolgreiche Beispiele 9. B2C MarketingB2C-Marketing oder Business-to-Consumer-Marketing bezeichnet die Vermarktung von Produkten oder Dienstleistungen durch Unternehmen an Verbraucher. Dieser Begriff wird von Marketingfachleuten oft verwendet, um Marketingstrategien und ‑taktiken zu benennen und zu unterscheiden, die in B2C-Beziehungen besonders effektiv sind (z. B. Influencer Marketing), im Gegensatz zu B2B-Beziehungen. Ein BeispielB2C-Marketing ist überall. Ich muss nicht einmal auf eine Studie verweisen, die beweist, wie sehr wir mit Werbung bombardiert werden. Du musst dich nur umsehen. Alle Dinge, die du besitzt, wurden aufgrund von B2C-Marketing gekauft. Das heißt, entweder hast du irgendeine Form von B2C-Werbung gesehen, die dich zum Kauf überredet hat, oder jemand anderes hat es getan und dir erzählt, wie toll das Produkt ist. Lass mich diese autotherapeutische Übung mit mir selbst beginnen. Eines Tages war ich mit meinen eigenen Angelegenheiten beschäftigt. Plötzlich bekam ich eine E‑Mail von Vans, in der sie mir mitteilten, dass sie einen großen Ausverkauf ihres Outlet-Inventars veranstalteten. OK, Vans. Ich klicke.Die E‑Mail (sie ist auf Polnisch) führte zu dieser Landing Page, auf der ich diese Schuhe sah. Das war genau das, was ich diesen Herbst brauchte. Ein paar Tage später waren die Schuhe dann bei mir zu Hause.Und das ist die kurze Geschichte, wie mich B2C-Marketing dazu gebracht hat, in Sekundenschnelle Schuhe zu kaufen. Ich bin nicht einmal in den Laden gegangen, um sie anzuprobieren. Ich habe etwas ganz anderes gemacht und nicht einmal daran gedacht, Schuhe zu kaufen. Aber das kann nicht jede E‑Mail leisten. Hier geht es um die Macht der Marke — Vans ist eine meiner Lieblingsmarken. Mit E‑Mails wie diesen und Online-Einkaufsmöglichkeiten kann eine Marke aus jeder anderen Aktivität, in die sie investiert hat, Kapital schlagen und dafür sorgen, dass ich sie kenne, mag und ihr vertraue.10. Affiliate MarketingAffiliate Marketing ist eine Art der Werbung, bei der ein Unternehmen einer externen Website eine Provision für den Traffic oder die Verkäufe zahlt, die durch diese Website generiert werden. Du kannst Affiliate-Links vor allem auf Blogs entdecken. Das sind die Links, die Tracking-Parameter wie “tag”, “hop” oder “customid” enthalten.Das bedeutet, dass der Inhaber der Website jedes Mal eine Provision erhält, wenn jemand auf diesen Link klickt oder etwas über diesen Link kauft. Auf diese Weise belohnt das zahlende Unternehmen die Affiliates dafür, dass sie ihren Gewinn beeinflussen. Ein BeispielDieser Kochblog erklärt, wie er die Einnahmen seines Food-Blogs innerhalb von drei Monaten verfünffacht hat, wobei eine der Taktiken das Affiliate-Marketing war. Jemand kaufte bei Amazon Pilzkapseln im Wert von 3.240 $, nachdem er auf einen Link im Blog geklickt hatte. Einfach so bekamen die Eigentümer an diesem Tag 145 Dollar, 24 Stunden nachdem sie einen Artikel über diese Pilzkapseln veröffentlicht hatten.In dieser Geschichte sind alle Gewinner — der Hersteller, der Händler, Amazon, der Blog und die Person, die die Kapseln gekauft hat (nehme ich an).Es gibt noch eine andere Form des Affiliate Marketings, die manchmal als Partnermarketing bezeichnet wird (wobei Partnermarketing mindestens zwei verschiedene Bedeutungen hat).Dabei veranstalten Lösungsanbieter ein Partnerprogramm für andere Unternehmen, um die Nachfrage und Akzeptanz eines Produkts oder einer Dienstleistung zu steigern, indem sie die Marktfähigkeiten der Programmteilnehmer/innen nutzen. So wirbt Microsoft für sein Partnerprogramm: “Das Microsoft Partner Network ist ein Knotenpunkt von Menschen, Ressourcen und Angeboten, die zusammengebracht werden, um dir alles zu geben, was du brauchst, um erfolgreiche Lösungen für deine Kunden zu entwickeln und zu liefern.” Empfehlenswerte Artikel: Affiliate Marketing für Anfänger: In 7 Schritten zum Erfolg Wie man eine erfolgreiche Amazon Affiliate Seite aufbaut (Schritt für Schritt) 11. Social Media MarketingSocial Media Marketing ist die Nutzung von sozialen Medien wie Facebook, Twitter oder LinkedIn, um die Produkte oder Dienstleistungen eines Unternehmens zu vermarkten. Das Ziel von Social Media ist es, ein Publikum aufzubauen und mit ihm in Kontakt zu treten. Das führt zu mehr Markenbekanntheit, Traffic auf der Website und schließlich zu mehr Umsatz. Zum Social Media Marketing gehört eine Mischung aus verschiedenen Taktiken, z. B. das Veröffentlichen von Inhalten, das Beantworten von Kommentaren und das Schalten von Social Media-Werbung. Ein BeisipielDer Twitter-Account von Wendy ist zu einer Art Legende geworden. Hier ist der Grund dafür: Die Geschichte begann mit epischen Twitter-Beleidigungen, die niemanden verschonten. Es begann versehentlich mit einer einfachen Antwort auf einen nicht allzu hellen Kommentar eines Kunden und entwickelte sich schnell zum Höhepunkt dieses Twitter-Handles. Diese Art von “Markenstimme” gab den Nachrichten von Wendy’s ein Gefühl von Authentizität, das die Konkurrenz wie herzlose Konzerne klingen ließ. Als sich immer mehr Augen auf die nächste Aussage von Wendy’s richteten, kam dieser Tweet, auch bekannt als der am dritthäufigsten retweetete Tweet der Geschichte:HELP ME PLEASE. A MAN NEEDS HIS NUGGS pic.twitter.com/4SrfHmEMo3— Carter Wilkerson (@carterjwm) April 6, 2017Dieser Mann hat nicht die 18 Millionen Retweets bekommen (nur 3,1 Millionen). Aber Wendy’s schenkte ihm trotzdem ein Jahr lang kostenlose Chicken Nuggets. Wendy’s hat bewiesen, dass es nicht nur die Aufmerksamkeit der Menschen auf sich ziehen, sondern auch sein Versprechen halten kann (etwas, wofür Fast-Food-Ketten nicht bekannt sind).Es gibt noch mehr beeindruckende Social Media Fallstudien von Wendy’s (siehe GroupNug oder March Madness). Aber während Wendy’s die Grenzen des Unternehmensmarketings ausreizt, vergisst das Unternehmen nicht, dass es in den sozialen Medien auch um Kundenservice geht oder einfach nur darum, von Zeit zu Zeit für sein Unternehmen zu werben. 12. Brand MarketingMarkenmarketing ist ein Begriff, der Aktionen beschreibt, die ein Produkt oder eine Dienstleistung so bewerben, dass die Marke hervorgehoben und ihr Image geprägt wird. Aber was ist eine Marke? Im modernen Marketing ist es ziemlich schwierig, eine erschöpfende und zufriedenstellende Definition zu geben. Schließlich wird Markenmarketing auf so viele Arten praktiziert. Ich möchte dir einige Beispiele für starke Marken geben. Achte darauf, was du mit ihnen assoziierst.AppleMastercardThe AvengersFacebookBMWCoca-ColaUnd was hast du bekommen? Haben diese Namen ein Bild in deinem Kopf oder eine Assoziation mit einer Person ausgelöst? Vielleicht haben sie ein bestimmtes Gefühl oder eine Erinnerung hervorgerufen oder dich sogar durstig gemacht. Das ist es, was Marken im Wesentlichen sind: kognitive und emotionale Auslöser. Es ist also weniger wichtig, was Marken sind. Vielmehr ist es wichtig, was sie tun. Und genau das ist das Ziel des Markenmarketings: die Wirkung von Marken auf die Verbraucherinnen und Verbraucher zu verstärken und sie dazu zu bringen: Das Produkt wiederzuerkennen (und es von anderen zu unterscheiden) - Sonst würdest du dir die Frage stellen: “Ist das der leckere Schokoriegel, den ich letztes Mal gegessen habe?” Assoziiere es mit einer positiven Erfahrung — Du hast das Produkt vielleicht noch nicht probiert. Aber wenn die Vorstellung, das Produkt zu konsumieren, ein positives Gefühl in dir auslöst, dann reicht das schon aus. Rationalisiere die Kosten des Produkts — BMWs sind nicht die bestgebauten Autos der Welt. Und sie sind auch nicht die billigsten. Trotzdem gilt ein BMW als die “ultimative Fahrmaschine”. Die Verbraucher sind nicht die einzigen möglichen Ziele des Markenmarketings. Unternehmen können diese Art von Marketing auch nutzen, um ihren Börsenwert zu steigern oder um Talente für ihr Unternehmen zu gewinnen (Employer Branding).Ein BeispielIch muss ehrlich sein. Ich habe mich auf Anhieb in diese Anzeige verliebt. Sie weckte in mir den Wunsch, LEGOs zu kaufen und “die Welt wieder aufzubauen”.https://www.youtube.com/watch?v=XraFU5BjYjQDie Anzeige zeigt ein wenig von LEGOs Produkt. Aber was noch wichtiger ist: Er hebt die Marke hervor und prägt ihr Image.Ich weiß nicht, ob du mir zustimmst, aber diese Werbung stellt LEGOs als positives, gewaltfreies und kognitiv anregendes Spielzeug für alle dar. Außerdem ist es das Spielzeug für die Baumeister von morgen. Eine Welt, die auf Vielfalt, Respekt und gegenseitiger Hilfe aufbaut; eine Welt ohne Nullsummenspiel. Und es spielt keine Rolle, welches LEGO Set ich kaufe — sie sind alle so. Und durch das Markenmarketing hat es LEGO geschafft, diese Botschaft in 60 Sekunden zu vermitteln. 13. Direct MarketingDirektmarketing ist eine Strategie, bei der das Unternehmen direkt mit dem Zielpublikum kommuniziert, anstatt Massenmedien zu nutzen. Direktmarketing wird in der Regel wegen der geringeren Kosten (im Vergleich zu Massenmedien), der Möglichkeit, die Botschaft zu personalisieren, und der Möglichkeit, dass die Zielgruppe auf die Botschaft reagiert (z. B. durch ein beigefügtes Formular), gewählt. Ein BeispielWir alle sind Adressaten von Direktmarketing. Der Beweis dafür ist der kleine Metallkasten neben dem Briefkasten, den viele von uns haben, um unerwünschte Flyer und Kataloge an einem Ort aufzubewahren. Es ist auch an der Allgegenwart dieser Art von Schildern zu erkennen:Aber lass mich dir ein positives und effektives Beispiel für Direktmarketing geben: Die ersten Kataloge von Ikea. So hat das Geschäft von Ikea überhaupt erst begonnen. Damals war Ikea noch ein bisschen anders. Das Unternehmen verkaufte nicht hauptsächlich Möbel, sondern fast alles.Dies ist ein Beispiel für einen Ikea-Versandkatalog aus dem Jahr 1950: Heutzutage können wir einfach in den Ikea-Laden gehen und etwas abholen. Niemand muss uns noch etwas schicken. Noch besser ist es, wenn wir den Bestand online einsehen und einen Kauf tätigen können, ohne das Haus zu verlassen. Das war auch die Idee hinter den ersten Ikea-Katalogen, die in einer Welt ohne Internet und ohne Fernseher erschienen. Das war eine geniale (wenn auch nicht gerade originelle) Lösung, um viele potenzielle Kunden zu erreichen und die “Reibung” beim Kauf von Produkten zu verringern.Auch für Menschen, die in abgelegenen Gegenden Schwedens leben, bedeuteten die Kataloge Vielfalt und Stil direkt vor ihrer Haustür. 14. Influencer MarketingInfluencer-Marketing ist die Zusammenarbeit mit einflussreichen Menschen, um Marken, Produkte oder Dienstleistungen zu bewerben.Ein Influencer ist in diesem Zusammenhang jeder, der über ein bedeutendes Netzwerk oder eine große Fangemeinde in einem bestimmten Bereich verfügt. Die Einflussmechanismen, die bei dieser Art von Marketing genutzt werden, können viele Formen annehmen: Inspiration, Vertrauen, Glaube und Nachahmung. Influencer-Marketing ist effektiv, weil das Folgen von Beispielen oder Ratschlägen anderer den Menschen hilft, Entscheidungen zu treffen.Da Einfluss ein Phänomen der zwischenmenschlichen Beziehungen ist, funktioniert Influencer-Marketing sowohl im B2B- als auch im B2C-Bereich. Ein BeispielHier ist ein Beispiel für eine Influencer-Marketing-Super-Produktion. Die YouTuberin Meredith Foster war eine der wenigen sorgfältig ausgewählten Influencerinnen und Influencer, die die neue Smartphone-Produktlinie von Motorola bewerben sollten. Hier ist, was Meredith zustande gebracht hat: Merediths Kanal hat 4,8 Millionen Abonnenten. Wenn man das mit der durchschnittlichen Reichweite von Nachrichtensendungen in den USA vergleicht, wird schnell klar, warum Influencer-Marketing eine wirkungsvolle Strategie sein kann. Empfehlenswerter Artikel: Influencer-Marketing im Jahr 2022: Definition, Beispiele und Methoden15. E‑Mail MarketingE‑Mail-Marketing ist jede Art von Marketingbotschaft, die über den Kanal der E‑Mail erfolgt. Das heißt, E‑Mail-Marketing ist nicht nur das Versenden von E‑Mails. Es beinhaltet: Das Erstellen einer E‑Mail-Liste.Das Entwerfen und Versenden von E‑Mails an die Abonnentenliste.Das Monitoring der Ergebnisse. Kuratieren der E‑Mail-Liste.Diese Art des Marketings dient vier Hauptzwecken: Traffic generieren — Du kannst mit deinem Publikum über E‑Mails kommunizieren, mit dem Ziel, sie von der E‑Mail zu einer bestimmten Seite zu führen, z.B. zu deinen neuesten Inhalten. Lead Nurturing — Dazu gehören so genannte Drip-Kampagnen, die methodisch E‑Mail für E‑Mail und Touchpoint für Touchpoint eingesetzt werden und die E‑Mail-Abonnenten zu einer Kaufgelegenheit führen. Dieser Prozess “qualifiziert” Leads auch für verschiedene Arten von Abonnenten, z. B. für potenzielle Geschäftsmöglichkeiten und Markenfans. Onboarding — Darunter versteht man eine Reihe von E‑Mails, die während des “Lebenszyklus” eines Kunden verschickt werden, damit er den Wert des Produkts entdeckt und erfährt und schließlich an das Unternehmen gebunden wird. Eine häufige Anwendung von Onboarding-E-Mails ist die Testphase eines SaaS-Produkts. Umsatz generieren — so wie Vans es mit mir gemacht hat. Marken bieten ihren Kunden oft einen Anreiz, sich für einen Newsletter anzumelden, z. B. 20% Rabatt auf den nächsten Einkauf. Dann werden Sonderangebote an Newsletter-Abonnenten verschickt. Ein BeispielDa ich bereits zwei Beispiele für E‑Mails gezeigt habe und du wahrscheinlich selbst eine Menge E‑Mails bekommst, hier eine Illustration des E‑Mail-Marketing-Workflows.In dieser einfachen E‑Mail-Drip-Kampagne werden den Empfängern automatisch E‑Mails zugeschickt, je nachdem, wie sie reagieren. Reagieren die Empfänger positiv auf die E‑Mails, erhalten sie ausführlicheres Informationsmaterial und sogar eine Produktdemo. Wenn sie die folgenden E‑Mails jedoch nicht öffnen, werden sie auf einen Pfad mit weniger zeitaufwändigem Bildungsmaterial gesetzt und schließlich aus dem Drip-Kampagnen-Workflow herausgenommen. Diese Art von E‑Mail-Marketing-Workflow kann mit einem WYSIWYG-Editor (What You See Is What You Get) in vielen der heutigen E‑Mail-Marketing-Tools ohne Programmierkenntnisse erstellt werden. 16. Empfehlungsmarketing (Word-of-mouth marketing — WOMM)Unter Word-of-Mouth-Marketing versteht man die Beeinflussung und Förderung von natürlichen Diskussionen über ein Produkt, eine Dienstleistung oder ein Unternehmen. Im alltäglichen Gebrauch kann es zwei Arten von Situationen beschreiben: WOMM als natürlicher “Nebeneffekt” der Tätigkeit eines Unternehmens, z. B. wenn die Erwartungen der Verbraucher an ein Produkt oder eine Dienstleistung übertroffen werden. In solchen Fällen beabsichtigt das Unternehmen vielleicht nicht, die Verbreitung von Diskussionen aktiv zu beeinflussen. Die Art und Weise, wie es seine Geschäfte betreibt, schafft jedoch ein so starkes Erlebnis, dass die Kunden es mit Freunden, Familie, Followern in den sozialen Medien usw. teilen wollen. WOMM als Taktik, um die Verbreitung von Diskussionen über das Unternehmen, seine Produkte oder Dienstleistungen absichtlich und aktiv zu beeinflussen. Diese Art von WOMM wird in diesem kurzen Kapitel im Mittelpunkt stehen. Das Wesen von WOMM besteht darin, den Menschen einen Grund zum Reden zu geben. Der Grund, warum diese Strategie funktioniert, ist, dass Menschen oft dem vertrauen, was andere zu sagen haben. Dieses Phänomen wurde sogar schon untersucht: Eine Nielsen-Studie aus dem Jahr 2015 ergab, dass 83 % der Befragten aus 60 Ländern den Empfehlungen von Freunden und Familie vertrauen. Aber wenn eine Empfehlung aus einer online geposteten Meinung stammte, sank die Vertrauensquote auf 63%.Der oben erwähnte “Grund zum Reden” muss nicht unbedingt eine Empfehlung für die Dienstleistungen eines Unternehmens sein. Es kann alles sein, was ein Unternehmen bekannt macht, einen “Buzz” erzeugt und seinen Bekanntheitsgrad steigert. Aus diesem Grund wird WOMM oft auch als “Buzz Marketing” bezeichnet. Word-of-Mouth-Marketing kann viele Formen annehmen. Es kann als Social-Media-Kampagne, als PR-Kampagne oder als Empfehlungskampagne mit Anreizen für die Verbreitung der Unternehmensbotschaft beginnen. Ein BeispielEs ist eine Sache, Mundpropaganda in Form von positiven Bewertungen und unbeeinflussten Beiträgen in den sozialen Medien zu “verdienen”. Es ist eine andere Sache, die ganze Show zu gestalten und zu kontrollieren. In “Buzzmarketing: Get People to Talk About Your Stuff” beschreibt Mark Hughes, wie er es geschafft hat, den Namen einer Stadt in den USA in den Namen einer Startup-E-Commerce-Plattform zu ändern, für die er warb.So wurde eine Stadt namens Halfway in Half.com umbenannt. Für ein Jahr. Das brachte die neue E‑Commerce-Plattform buchstäblich auf die Landkarte.Diese Aktion war so bemerkenswert, dass sie die Aufmerksamkeit von Associated Press, Reuters, USA Today, Good Morning America und anderen auf sich zog. Stell dir also vor, wie viel Publicity das E‑Commerce-Unternehmen durch diese eine Aktion bekommen hat — und das alles rechtzeitig zum Start der Plattform. Im Gegenzug erhielt die Stadt Halfway neue Computer für die Schule, eine neue Website und 110.000 Dollar. Und sechs Monate später wurde Half.com (das E‑Commerce-Unternehmen) für 300 Millionen Dollar an eBay verkauft.17. Event Marketing Eventmarketing ist eine Marketingtaktik, bei der Markenveranstaltungen genutzt werden, um mit dem Zielpublikum zu kommunizieren und Produkte oder Dienstleistungen zu bewerben. Das Ziel des Eventmarketings ist es, ein unvergessliches Erlebnis zu schaffen, indem es die Teilnehmer/innen zu einer direkten Interaktion mit der Marke anregt. Die Interaktion kann verschiedene Formen annehmen: ein Produkt ausprobieren, einer Produktvorführung beiwohnen, ein Konzert besuchen, an einer Markteinführung teilnehmen, Kontakte knüpfen, an einem Seminar oder einer Konferenz teilnehmen usw. Ein BeispielSeit 2003 organisiert Salesforce eine jährliche Veranstaltung namens Dreamforce. Sie bringt “die globale Salesforce-Community zusammen, um zu lernen, Spaß zu haben, die Gemeinschaft zu stärken und sich für wohltätige Zwecke einzusetzen”. Die Veranstaltung ist ein großer, dreitägiger Themenpark rund um Salesforce. Dieses Jahr wurde die Veranstaltung auch online gestreamt.Sie ermöglicht es Salesforce, ein vielseitiges Produkterlebnis zu schaffen: Die Teilnehmer können sich über die Produktankündigungen von Salesforce informieren, fortgeschrittene Anwendungen des CRM entdecken und einige Salesforce-Zertifizierungen erwerben. Aber wie in jedem Freizeitpark muss es verschiedene Arten von Attraktionen geben. Die Veranstaltung wirbt nicht nur für das CRM von Salesforce. Dreamforce ist eine Gelegenheit, Vorträge von Prominenten, Vordenkern und Politikern zu hören. Und nicht zuletzt können sich die Teilnehmer/innen auf einer Party amüsieren.Join superstar Will Smith at Dreamforce 2021. Together, we’ll be:1. Chillin’ out.2. Maxin’.3. Relaxin’, all cool.Watch #DF21 on Salesforce+: https://t.co/pXrOL9oVnB pic.twitter.com/qeZSQjQC8v— Salesforce (@salesforce) September 22, 2021Interessant an diesem Beispiel für Eventmarketing ist auch, dass es für andere Marken offen ist. Sage und schreibe 103 andere Marken helfen Salesforce dabei, diese Veranstaltung durch Sponsoring zu ermöglichen und so ihren Teil zur Markenbekanntheit beizutragen. 18. Guerrilla MarketingGuerilla-Marketing ist eine Werbetaktik, bei der unerwartete und unkonventionelle Interaktionen genutzt werden, um starke Emotionen zu wecken und Mundpropaganda zu betreiben. Merkmale des Guerilla-Marketings:Geringe KostenKreativEinfache und kurze Botschaften Nutzung von öffentlichen Plätzen wie Straßen oder Einkaufszentren als Werbeträger Erzeugt einen starken, einprägsamen EindruckEin BeispielIch glaube, dieses Beispiel erfüllt alle Kriterien für vorbildliches Guerilla-Marketing. Dies ist eines von vielen Beispielen für die Guerilla-Werbekampagne des Films “IT”. Selbst wenn du noch nie von dem tödlichen Clown aus Stephen Kings Roman gehört hast, ist dieses Schild so bizarr, dass du den Film garantiert googeln wirst. Außerdem wette ich, dass du anderen Leuten erzählen würdest, was du an diesem Tag gesehen hast, oder sogar darüber tweeten würdest (ich weiß, dass ich es tun würde).Pretty cool marketing initiative for #ITMovie spotted in Sydney CBD this morning.“We all float down here” pic.twitter.com/vi1KnXSRFj— David Piepers (@davepiepers) September 3, 2017Und wenn du den Film gesehen hast und die Szene mit dem Ballon, der aus dem Gully kommt, erinnerst du dich an diese Guerilla-Werbung, die den Film noch viel realer und gruseliger macht. Was das Budget für diese Kampagne angeht, ist es ziemlich offensichtlich. Es sind die Kosten für ein paar Ballons, Schnur und weiße Farbe. FazitBei all diesen 18 Arten von Marketing muss man sich fragen: Wo ist Occams Rasiermesser, wenn man es braucht? Könntest du nur eine Art von Marketing anwenden und dir keine Sorgen mehr machen? Nun, alle Arten, die wir besprochen haben, wurden aus einem bestimmten Grund entwickelt. Einige werden eingesetzt, um sich von der Konkurrenz abzuheben, andere, um den Lebensgewohnheiten der Kunden gerecht zu werden. Der Punkt ist, dass du diese Arten von Marketing als fertige Lösungen betrachten kannst, um dein Ziel zu erreichen.Wenn du diese bewährten Arten kennst, wird die Arbeit ein wenig leichter. Du musst nur klug auswählen. Hast du Fragen? Schreib mir auf Twitter. Article PerformanceData from AhrefsVerlinkung von Websites 2 Sign up for AhrefsGet SEO metrics of any website or URL.The number of websites linking to this post.This post's estimated monthly organic search traffic.Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Mateusz Makosiewicz Marketingforscher und Ausbilder bei Ahrefs. Mateusz hat über 10 Jahre Erfahrung im Marketing, die er in Agenturen, SaaS- und Hardware-Unternehmen gesammelt hat. Wenn er nicht schreibt, komponiert er Musik oder genießt lange Spaziergänge.",
  "headers": [
    {
      "level": "H1",
      "text": "Die 18 wichtigsten Arten des Marketings (mit Beispielen)"
    },
    {
      "level": "H2",
      "text": "1. Digital Marketing"
    },
    {
      "level": "H3",
      "text": "Ein Beispiel"
    },
    {
      "level": "H2",
      "text": "2. Offline Marketing"
    },
    {
      "level": "H3",
      "text": "Ein Beispiel"
    },
    {
      "level": "H2",
      "text": "3. Inbound Marketing"
    },
    {
      "level": "H3",
      "text": "Ein Beispiel"
    },
    {
      "level": "H2",
      "text": "4. Outbound Marketing"
    },
    {
      "level": "H3",
      "text": "Ein Beispiel"
    },
    {
      "level": "H2",
      "text": "5. Content Marketing"
    },
    {
      "level": "H3",
      "text": "Ein Beispiel"
    },
    {
      "level": "H2",
      "text": "6. Search Engine Marketing (SEM)"
    },
    {
      "level": "H3",
      "text": "Ein Beispiel"
    },
    {
      "level": "H2",
      "text": "7. Growth Marketing"
    },
    {
      "level": "H3",
      "text": "Ein Beispiel"
    },
    {
      "level": "H2",
      "text": "8. B2B Marketing"
    },
    {
      "level": "H3",
      "text": "Ein Beispiel"
    },
    {
      "level": "H2",
      "text": "9. B2C Marketing"
    },
    {
      "level": "H3",
      "text": "Ein Beispiel"
    },
    {
      "level": "H2",
      "text": "10. Affiliate Marketing"
    },
    {
      "level": "H3",
      "text": "Ein Beispiel"
    },
    {
      "level": "H2",
      "text": "11. Social Media Marketing"
    },
    {
      "level": "H3",
      "text": "Ein Beisipiel"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H2",
      "text": "12. Brand Marketing"
    },
    {
      "level": "H3",
      "text": "Ein Beispiel"
    },
    {
      "level": "H2",
      "text": "13. Direct Marketing"
    },
    {
      "level": "H3",
      "text": "Ein Beispiel"
    },
    {
      "level": "H2",
      "text": "14. Influencer Marketing"
    },
    {
      "level": "H3",
      "text": "Ein Beispiel"
    },
    {
      "level": "H2",
      "text": "15. E‑Mail Marketing"
    },
    {
      "level": "H3",
      "text": "Ein Beispiel"
    },
    {
      "level": "H2",
      "text": "16. Empfehlungsmarketing (Word-of-mouth marketing — WOMM)"
    },
    {
      "level": "H3",
      "text": "Ein Beispiel"
    },
    {
      "level": "H2",
      "text": "17. Event Marketing"
    },
    {
      "level": "H3",
      "text": "Ein Beispiel"
    },
    {
      "level": "H2",
      "text": "18. Guerrilla Marketing"
    },
    {
      "level": "H3",
      "text": "Ein Beispiel"
    },
    {
      "level": "H2",
      "text": "Fazit"
    }
  ],
  "author": "Mateusz Makosiewicz"
}