{
  "url": "https://ahrefs.com/blog/de/b2b-content-marketing/",
  "slug": "b2b-content-marketing",
  "title": "Was ist B2B-Content-Marketing? 7 erfolgreiche Beispiele",
  "description": "B2B-Content-Marketing umfasst die Erstellung und Verbreitung von Content, den deine Business-Kunden ansprechend finden.",
  "content": "Si Quan Ong Marketing @ Ahrefs. Ich lese, mache Breakdance und versuche zufäliige Lebensexperimente. Inhalt B2B-Content-Marketing ist eine Teildisziplin des Marketings, welche die Erstellung und Verbreitung von Inhalten (Content) umfasst, die deine Business-Kunden ansprechend finden. Warum ist diese Marketing-Technik so wichtig? Mit Content-Marketing können mehr Traffic generiert, Leads akquiriert und der Unternehmensumsatz erhöht werden.Allerdings gilt: Es gibt nicht den einen richtigen Weg, Content-Marketing zu betreiben. Abhängig von den unternehmenseigenen Zielen, Ressourcen und der Zielgruppe etc. unterscheiden sich die Content-Marketing-Strategie und ‑Umsetzung von Unternehmen zu Unternehmen.In diesem Blogbeitrag stellen wir dir einige inspirierende Best-Practice-Beispiele für gelungenes B2B-Content-Marketing vor, warum sie erfolgreich waren und wie du sie erfolgreich nachmachen kannst.Kostenlose Tools von ShopifyDer Blog von AhrefsDer YouTube Channel von SlidebeanDie Podcast-Strategie von MeetEdgarFirst Round — The ReviewDer Blog von KinstaDer Blog von YouGov1. Kostenlose Tools von ShopifyFacts & FiguresAnzahl der verweisenden Domains: 2.940Geschätzter organischer Traffic: 372.000Anzahl der Keywords, für die die Tools ranken: 46.400Shopify ist eine E‑Commerce-Plattform die Unternehmen dabei unterstützt, selbst Online-Shops zu betreiben. Mit Stand Juni 2019 wurde die Shopify-Plattform von mehr als 800.000 Unternehmen genutzt.Warum sind sie so erfolgreich?Laut ihrem Senior Global Content Marketing Lead, Mark Macdonald, investiert Shopify bereits von Anfang an stark ins Content-Marketing.Wenn du die Website von Shopify besuchst, wirst du schnell feststellen, wie viel Arbeit sie hinein gesteckt haben. Sie haben in fast jede Art von Content Marketing investiert: Blogs, Podcasts, kostenlose Kurse, kostenlose Leitfäden etc.Es gibt eine Menge, was wir uns von der Content-Marketing-Strategie von Shopify abschauen können. Beschäftigen wir uns zuallererst mit einem besonderen Teil ihres Content-Marketings: den kostenlosen Tools.Shopify stellt seinen Kunden und Interessenten über 20 kostenlose Tools zur Verfügung.Hier sind ein paar von ihnen:Was macht ihre Tools so besonders:1. Sie lösen Probleme, die angehende Unternehmer in der Anfangsphase zu bewältigen haben. Zum Beispiel benötigt man einen Firmennamen, bevor man eine Website erstellt. Shopify schafft hier Abhilfe, indem es einen kostenlosen Generator für Firmennamen anbietet.Zweitens erhalten diese Tools Tausende monatliche Suchanfragen bei Google. So wird beispielsweise nach dem Begriff “Business Name Generator” in den USA 87.000 und weltweit 192.000 Mal pro Monat gesucht.In Summe erhalten ihre kostenlosen Tools schätzungsweise 372.000 Besuche pro Monat allein über Google:Geschätzter organischer Traffic — ermittelt mit dem Site Explorer von AhrefsUnd hier ist noch etwas Cooles: Man kann jeden Namen, der im “Business Name Generator” von Shopify vorgeschlagen wird, sofort reservieren lassen:Wie kannst auch du ihre Strategie erfolgreich umsetzen?Folge diesen drei Schritten:Finde Tools, nach denen deine Kundenzielgruppe sucht.Erstelle dein eigenes Tool.Optimiere es, damit es in Google höher rankt.Schritt 1. Finde Tools, nach denen deine Kundenzielgruppe sucht:Nutze den Keywords Explorer von Ahrefs und gib ein oder mehrere allgemeine Keywords ein, die sich auf deine Branche beziehen.Wenn du zum Beispiel eine Immobilien-Website besitzt, könnten diese Keywords beispielsweise Hypothek (mortage), Miete (rent) und Anzahlung sein. Klicke dann auf den Report “Phrase match” und gib Wörter wie Rechner (calculator), Tool, Tools und Check in die Box “Include” (“Einfügen”) ein. Klicke auf “Any word” (“eines der Wörter”) und dann auf “Apply” (“anwenden”).Nun siehst du eine Liste relevanter Tool, nach denen Leute suchen — sortiert nach ihrem monatlichen Suchvolumen.Schritt 2. Erstelle dein eigenes kostenloses ToolBevor du ein kostenloses Tool erstellst, solltest du dir zunächst die Top-Ranking-Ergebnisse für dein Ziel-Keyword ansehen.Stelle dir folgende Fragen:Inwiefern sind sie gut?Wie könnten sie verbessert werden?Diese Fragen werden dir dabei helfen, das bestmögliche Tool zu entwickeln.Schritt 3. Bewerbe das ToolEs gibt einen direkten Zusammenhang zwischen Links und Rankings, was bedeutet, dass du für gewöhnlich Links akquirieren musst, um für dein Ziel-Keyword zu ranken.Dafür gibt es mehrere Methoden, aber der beste Ausgangspunkt für Tools ist eine bestimmte Taktik, die man allgemein auch als Skyscraper-Technik bezeichnet.In diesem Video erfährst du, wie diese Methode funktioniert:https://www.youtube.com/watch?v=wPjPjNK-bDM2. Der Blog von AhrefsFacts & FiguresAnzahl der verweisenden Domains: 13.700Geschätzter organischer Traffic: 391.000Anzahl der Keywords, für die der Blog rankt: 193.400Ahrefs wurde 2010 gegründet und wird von einem kleinen Team betrieben. Ahrefs stellt ein Allzweck-SEO-Toolset bereit, das dir die Möglichkeit bietet, deine Wettbewerber zu analysieren, herauszufinden, wonach deine Kunden suchen, deine Website zu optimieren und vieles mehr.Warum sind wir so erfolgreich?Abgesehen von Mundpropaganda ist Content-Marketing unsere erfolgreichste Methode zur Kundengewinnung. Unser Blog rankt auf Google für über 192.000 Suchbegriffe und erhält fast 400.000 monatliche Besuche.Zudem erweist sich Content-Marketing als wesentlicher Treiber für Neu-Registrierungen:Wie kannst auch du diese Strategie erfolgreich umsetzen?Unsere Content-Strategie ist nicht kompliziert. Wir sehen uns an, wonach unsere Kunden suchen, und verfassen detaillierte Blogbeiträge zu diesen Themen.So gehen wir vor:Keywords mit Such-Traffic — und Business-Potential findenDie richtige Art von Content erstellenDen Content bekannt machenSchritt 1. Keywords mit Such-Traffic- und Business-Potential findenWenn du organischen Traffic erzielen möchtest, musst du auf Themen setzen, nach denen Leute auch suchen.Gib dazu ein paar “Seed”-Keywords in ein Keyword Research Tool wie den Keywords Explorer von Ahrefs ein. Wir könnten zum Beispiel nach Themen wie “SEO”, “Content-Marketing” und “Bloggen” suchen, da dies Themen sind, nach denen unsere Kunden suchen.Wähle dann einen Report aus der Rubrik “Keyword-Ideen” (“Keyword ideas”) aus — zum Beispiel den Report “Questions”.Durchsuche die Liste nach relevanten Themen.Aber das war noch nicht alles. Traffic ist schließlich eher eine Metrik, auf die man sich gerne etwas einbildet — du solltest auch auf Themen setzen, die sich in Umsätze niederschlagen.Zu diesem Zweck weise jedem Topic einen Geschäftswert, business value “score”, zu.Diese Skala verwenden wir bei Ahrefs, um Themen zu bewerten.3: Unser Produkt ist eine unersetzliche Lösung für das Problem;2: Unser Produkt ist zwar nützlich, aber es ist für die Lösung des Problems nicht unbedingt notwendig;1: Unser Produkt kann nur flüchtig erwähnt werden;0: Es gibt absolut keine Möglichkeit, unser Produkt zu erwähnen.Wir setzen meist auf Themen, die entweder einer “2” oder einer “3” entsprechen.Empfohlener Blogbeitrag: How To Do Keyword Research for SEOSchritt 2. Erstelle die richtige Art von ContentWir bei Ahrefs versuchen immer sicherzustellen, dass unser Content diese zwei Ziele verfolgt:Er entspricht dem, wonach der Nutzer auf Google sucht (d.h. der Suchabsicht);Unser Produkt bewirbt.Fangen wir mit dem Ersten an:Search Intent (die Suchabsicht) bezeichnet den Grund für die Anfrage eines Nutzers. Um diesen herauszufinden, überprüfen wir die Top-Ranking-Ergebnisse zu dem gewünschten Thema.Sehen wir uns zum Beispiel die Seite mit den Suchmaschinenergebnissen (Search Engine Results Page — SERPs) für “Bilder-SEO” (“Image-SEO”) an:Wir können sehen, dass Nutzer nach Tipps zur Optimierung von Bildern suchen. Wenn wir auf dieses Thema abzielen würden, wäre das die Art von Content, den wir erstellen sollten. Wenn wir eine Schritt-für-Schritt-Anleitung schreiben oder versuchen würden, unsere Homepage zu ranken, wäre das ein schwerer Kampf, den wir austragen würden.Zweitens sollte der Content unser Produkt bewerben. Da wir die Themen, die einen Geschäftswert erzielen würden, bereits herausgegriffen haben, sollte dies nicht schwierig sein.Hier sollte man allerdings nicht übertreiben. Schließlich geht es hier um das Verfassen eines Blogbeitrages und nicht um einen Werbebrief. Wenn es sich anbietet, kannst du dein Produkt an gewissen Stellen erwähnen, und aufzeigen, wie es zur Lösung des Problems beitragen kann. Erwähne es nicht einfach willkürlich und bedachtlos.Schritt 3. Mache deinen Content bekanntNachdem wir unseren Blogbeitrag veröffentlicht haben, senden wir ihn an unsere Kunden per E‑Mail aus und teilen ihn auf Social Media. Wir geben auch mehrere hundert Dollar aus, um den Beitrag über Ads zu bewerben:Aber das sind nicht die einzigen Dinge, die du tun kannst, um deinen Content zu bewerben. Befolge diese Checkliste zur Bekanntmachung deines Contents, um mehr Aufmerksamkeit auf deine Artikel zu lenken:https://www.youtube.com/watch?v=PoVYweKH4ck3. Der YouTube Channel von SlidebeanFacts & FiguresAnzahl der YouTube-Abonnenten: 124.000Monatliche Videoaufrufe: 500.000 (Source)Das in New York ansässige Unternehmen Slidebean ist eine Pitch-Deck-Design-Plattform für Start-ups und kleine Unternehmen.Warum sind sie so erfolgreich?Ich habe mich an den CEO von Slidebean, Caya, gewandt, um mehr darüber zu erfahren. Nach dem, was er mir erzählt hat, verfolgen sie einen zweifachen Ansatz.Zunächst begannen sie mit einer wiederkehrenden Videoserie, die als Startups 101 bekannt ist. Für diese Serie setzten sie hauptsächlich auf Startup-bezogene Keywords auf YouTube.Sie brauchten ihre Themenliste jedoch nach etwa einem Jahr auf. Das war der Zeitpunkt als sie beschlossen, ihren Marketing Funnel mit TOFU-bezogenen Themen aufzustocken.Da wir eine “YouTube-Formel” gefunden hatten, beschlossen wir, sie auf andere Arten von Content anzuwenden. Unsere Idee war es, gescheiterte Unternehmen auszuforschen und zu untersuchen. Das erste war WeWork, das genau die richtige Kombination zwischen einem Startup-orientierten Unternehmen und einer weit bekannten Marke war. Zu diesem Zeitpunkt hieß die Serie “Startup-Forensik” (“Startup Forensics”).Es gab jedoch hauptsächlich nur Tech-Start-ups zu erkunden. Deshalb haben wir auch Unternehmen mit einbezogen, um uns breiter aufzustellen und die Serie schnell zu “Unternehmens-Forensik” (“Company Forensics”) umbenannten.Caya, CEO SlidebeanSlidebean zielte darauf ab, so viele Ansichten ihres YouTube Channels zu bekommen wie möglich. Die Idee war, dass diese Leute aufgrund des bloßen Mere-Exposure-Effekt in Zukunft an Slidebean denken würden, wenn sie nach einer Pitchdeck-Software suchen.Wie kannst auch du diese Strategie erfolgreich umsetzen?Für ihre “Startup 101-Serie” haben sie auf “Suchen abgezielt, die auf YouTube keine besonders tollen Antworten hatten”.So sollte man vorgehen:Führe eine YouTube-Keyword-Recherche durchErstelle ein optimiertes VideoSchritt 1. Führe eine YouTube-Keyword-Recherche durchFür ihre Keyword-Recherche nutzte Slidebean eine Kombination aus VidIQ und TubeBuddy.Wenn du jedoch auf der Suche nach einer größeren Anzahl an Keyword-Ideen bist, nutze den Keywords Explorer von Ahrefs und stelle die Suchmaschine auf YouTube ein. Gib dann ein paar relevante Keywords ein. Wenn du zum Beispiel BBQ-Geräte verkaufst, würdest du Keywords wie Barbecue, Barbeque, BBQ und Grillen eingeben.Wechsle nun zum Report “Questions“ und notiere dir alle Themen, über die es sich lohnt, ein Video zu erstellen.Schritt 2. Erstelle ein optimiertes VideoNachdem du herausgefunden hast, auf welches Thema du setzen möchtest, besteht der nächste Schritt darin, ein Video zu erstellen, das auf YouTube ranken wird.Dieses Video zeigt dir, wie das funktioniert:https://www.youtube.com/watch?v=NY3y0V9UDwM4. Die Podcast-Strategie von MeetEdgarFacts & FiguresAnzahl der verweisenden Domains: 6.430Geschätzter organischer Traffic: 23.900Anzahl der Keywords, für die sie ranken: 31.200MeetEdgar wurde 2014 von Laura Roeder gegründet und ist ein Social Media-Automatisierungs-Tool.Warum sind sie so erfolgreich?Das Erscheinen in Podcasts hat MeetEdgar geholfen, sich zu einem florierenden Unternehmen zu entwickeln. Vom Zeitpunkt der Gründung bis zum Jahr 2017 erschien Laura in schätzungsweise 100 Podcasts.Laut Jen Carvey, einer früheren Mitarbeiterin von MeetEdgar, hat diese Strategie dabei geholfen, 1,25 Millionen Website-Besucher, 100.000 E‑Mail-Abonnenten und über 329.000 Dollar monatlich wiederkehrende Einnahmen (MRR) zu erzielen.Heute erzielt MeetEdgar 4 Millionen Dollar an jährlich wiederkehrenden Einnahmen (ARR).Wie kannst auch du diese Strategie erfolgreich umsetzen?Ihre Strategie ist ziemlich einfach. Es geht darum, Podcasts zu finden, die auf deine Zielgruppe ausgerichtet sind, und dann darum zu pitchen, in ihnen zu erscheinen.So funktioniert es:Finde relevante PodcastsSchlage dich selbst als Gast vorSchritt 1. Finde relevante PodcastsAm einfachsten ist es, auf Google nach den “besten [Nischen-]Podcasts” zu suchen:Du solltest jedoch bedenken, dass einige Podcasts auf dieser Liste sehr umfangreich sind. Und wenn du erst am Anfang stehst, könnte es sich als schwierig herausstellen, dort vertreten zu werden.Eine alternative Methode wäre es, jemanden aus deiner Branche zu finden, der ähnlich aufgestellt ist wie du und bereits in mehreren Podcasts erschienen ist. Zum Beispiel hat Morgan Housel im Bereich “Personal Finance” in vielen Podcasts Gastauftritte gehabt.Wir fügen seine Website in den Site Explorer von Ahrefs ein, gehen zum Bericht “Backlinks” und geben seinen Namen in das Feld “Include” (“Einfügen”) ein.Hier findest du eine Liste von Podcasts, in denen er vertreten war:Schritt 2. Schlage dich selbst als Gast vorFinde die E‑Mail des Podcast-Hosts heraus und nimm mit dieser Person Kontakt auf, um zu fragen, ob sie dich gerne interviewen würden.Aber pitch nicht einfach blind drauf los. Hör dir zuerst ein paar Folgen des Podcasts an. Das wird dir dabei helfen, eine personalisierte E‑Mail zu schreiben und relevante Themenvorschläge zu machen.Auch interessant: 12 lessons I learned from doing 20+ podcast interviews in 4 months5. First Round — The ReviewFacts & FiguresAnzahl der verweisenden Domains: 8.380Geschätzter organischer Traffic: 16.200Anzahl der Keywords, für die sie ranken: 77.100First Round Capital ist eine Venture-Capital-Firma (VC) für Startkapital-Finanzierungen, die in Unternehmen wie Uber, Warby Parker und Notion investiert hat.Warum sind sie so erfolgreich?Erstens: Sie unterscheiden sich von Anfang an von anderen VC-Blogs.Die meisten VC-Firmen zu dieser Zeit bloggten entweder über Markttrends oder Meinungsbeiträge ihrer Partner. First Round beschloss stattdessen, Geschichten aus der Perspektive der Betreiberseite (d.h. von Startups) anzubieten. Genau das hebt sie von den anderen ab.Zweitens: Sie sind unerbittlich auf ihr Zielpublikum ausgerichtet und fokussiert.Denk mal darüber nach: Markttrends oder Meinungsbeiträge sind zwar interessant, aber sie richten sich nicht an die eigentliche Zielgruppe der VCs: an neue oder potenzielle Gründer.Die Personen, die an diesen Artikeln interessiert sind, sind die VCs selbst. Start-up-Gründer sind an Inhalten interessiert, die ihnen dabei helfen können, echte Probleme zu lösen — Produktentwicklung, HR, Marketing usw.Und hier hat sich First Round besonders hervorgetan.Sie wussten, dass ihr Zielpublikum an wahren Geschichten über die Gründung oder das Führen eines Unternehmens interessiert war. Sie wussten auch, dass sie angesichts ihres bestehenden Portfolios an Start-ups in einer einzigartigen Position waren, um an diese Geschichten heranzukommen, Interviews zu führen und diese Geschichten erzählen.Auf diese Weise hat sich First Round, wie Jimmy Daly es beschreibt, “einen Ruf als einer der besten Herausgeber von Start-up- und Technik-bezogenem Content im Internet erworben”, — sie werden regelmäßig von anderen empfohlen:@firstround review— Ben Tossell (@bentossell) April 18, 2020Wie kannst auch du dieses Konzept erfolgreich umsetzen?Die Ziele einer VC-Firma wie First Round lauten nicht einfach nur: Traffic, Conversion oder Leads. Ihr Ziel ist es, ein Vordenker zu sein und eine Marke aufzubauen.Wenn du das auch erreichen möchtest — so kannst ihre Content-Strategie übernehmen:Finde heraus, welche Probleme deine Zielgruppe zu lösen versuchtFinde Experten und führe mit ihnen ein InterviewMache deinen Content bekanntSchritt 1. Finde heraus, welche Probleme deine Zielgruppe zu lösen versuchtSelbst wenn du versuchst, “Thought Leadership”-Content zu erstellen, musst du zunächst herausfinden, mit welchen Problemen dein Zielpublikum konfrontiert ist. Andernfalls riskierst du, über Themen zu schreiben, die deine Mitbewerber und Berufskollegen anziehen — was andere VC-Firmen taten — und nicht dein ideales Publikum.Zum Beispiel hat Camille Ricketts, die Ex-Herausgeberin des First Round Review, mit der Frage begonnen: “Was ist das, was sich alle Gründer in der Frühphase wünschen?” Ihre Antwort: Mit jemandem einen Kaffee trinken gehen zu können, der das getan hat, was sie vorhaben.Und so entstand The Review — ein Blog im Magazinstil mit “Kaffeetreffen nach Maß”.Bevor du also mit der Planung von Content oder mit Interviews beginnst, vergewissere dich, dass du weißt, mit welchen Problemen dein Zielpublikum konfrontiert ist.Wenn du nicht weiterkommst, dann sprich mit Personen, die deiner Zielgruppe ähnlich sind. Scheue dich nicht davor, mit ihnen persönlich oder via Videochat zu sprechen. Wie der berühmte Unternehmer Steve Blank es ausdrückt: “Es gibt keine Fakten innerhalb des Gebäudes, also begib dich nach draußen”.Schritt 2. Finde Experten und führe mit ihnen ein InterviewDer nächste Schritt besteht darin, Experten zu finden, die du interviewen kannst, und das Ganze als Geschichte verpacken kannst.Um das zu tun, solltest du einfach unseren Leitfaden über Influencer Marketing lesen. Nutze dann dreiteilige Methode für das Interviewen von Personen von Camille Ricketts.Schritt 3. Mache deinen Content bekanntUm ihren Content zu bewerben, verfolgt First Round zwei grundlegende Strategien:Content Syndication (Inhaltssyndizierung)Aufbau ihres eigenen PublikumsErstens: Laut Camille hat First Round Syndication- Partnerschaften mit Publikationen wie Quartz, Inc. und Fast Company. Diese Publikationen können jeden Artikel von First Round neu veröffentlichen, wenn sie diesen für interessant und relevant für ihr Publikum halten.Syndication-Partnerschaft von First Round mit Business Insider.Um zu erfahren, wie du dich mit anderen Publikationen zusammenschließen kannst, folge diesem Leitfaden.Zweitens: Sie konzentrieren sich auch darauf, ihr eigenes Publikum aufzubauen, vor allem über ihre E‑Mail-Liste.Wenn du durch ihre Beiträge blätterst, wirst du Pop-ups wie dieses sehen:Diese Strategie zur Erstellung einer E‑Mail-Liste ermöglicht es ihnen, eine Gruppe von interessierten Lesern aufzubauen, die ihren Content in ihrem eigenen Netzwerk verbreiten und dadurch die Zahl der Aufrufe der Content-Beiträge von First Round erhöhen.Lies diesen Leitfaden, um zu erfahren, wie man eine E‑Mail-Liste erstellt.6. Der Blog von KinstaFacts & FiguresAnzahl der verweisenden Domains: 6.530Geschätzter organischer Traffic: 283.000Anzahl der Keywords, für die der Blog rankt: 316.000Kinsta wurde 2013 gegründet und ist ein WordPress-Hosting-Anbieter.Warum sind sie so erfolgreich?Wie wir bei Ahrefs verfolgen sie eine Keyword-getriebene Content-Strategie. Was ihren Ansatz jedoch einzigartig macht, ist das, was Glen Allsopp “Error Message Marketing” nennt.Wenn du etwas Technisches machst (oder ein technisches Tool verwendest), wirst du im Grunde immer unfreiwillig auf Probleme stoßen. Wenn das passiert, ist es wahrscheinlich, dass du auf Google nach der Lösung suchst.Und hier kommt Kinsta ins Spiel.Kinsta hat dafür speziellen Content erstellt, die auf diese “Error”-Themen abzielen. Dies trägt dazu bei, das Markenbewusstsein ihrer Zielgruppe aufzubauen. Ihre Zielgruppe sind Personen, die solche technischen Probleme regelmäßig beheben müssen — Entwickler, Webmaster, Website-Besitzer usw.Tatsächlich generiert Kinsta mit diesen Themen einen recht hohen Anteil an Search Traffic:Und was passiert, wenn diese Leute nach einem neuen Hosting Provider suchen? Aufgrund der Vertrautheit mit der Marke Kinsta werden sie sich wahrscheinlich für Kinsta entscheiden.Wie kannst auch du diese Strategie erfolgreich umsetzen?Die Idee hinter dieser Strategie ist es, herauszufinden, welche Probleme deine Zielgruppe beschäftigen.Und so funktioniert es:.Finde “Error Message”-ThemenErstelle Content, der Antworten auf diese Fragen liefertSchritt 1. Finde “Error Message”- ThemenWenn es Tools gibt, die von den Personen aus deiner Nische regelmäßig genutzt werden, finde heraus, welche Probleme deine Nutzer damit haben. Erstelle dazu dann geeigneten Content.Nehmen wir zum Beispiel an, du besitzt ein Unternehmen, das sich an Heizkessel-Ingenieure wendet. Gib einige Heizkesselmarken wie “Intergas, Vaillant, Vokera, Worcester Bosch” in Keywords Explorer von Ahrefs ein. Suche dann im Feld “Include” (“Einfügen”) nach Wörtern wie “Störung, Fehler, Code” usw.Du siehst dann Fehler-bezogene Keywords, auf die du setzen kannst:Schritt 2. Erstelle Content, der Antworten auf diese Fragen liefertDie Beantwortung dieser Fragen sollte relativ einfach sein. Gehe einfach Schritt für Schritt durch, was der Leser tun muss, um das Problem zu lösen.Wenn du Hilfe beim Schreiben einer guten Schritt-für-Schritt-Anleitung benötigst, halte dich an diese Vorlage.7. Der Blog von YouGovFacts & FiguresAnzahl der verweisenden Domains: 17.700Geschätzter organischer Traffic: 126.000Anzahl der Keywords, für die der Blog rankt: 350.000YouGov ist ein Marktforschungs- und Datenanalyse-Unternehmen mit Hauptsitz in London. Sie bieten einige Services an, darunter kundenspezifische Daten und Forschung, Erstellung von Zielgruppen-Profilen, Segmentierung und Markentracking.Warum sind sie so erfolgreich?YouGov verdient Geld durch die Bereitstellung kundenspezifischer Daten und Forschung. Deshalb verfolgt die Marketingstrategie von YouGov zwei Hauptziele:Aufbau des Markenbewusstseins von Unternehmen, die ihre Dienstleistungen benötigen könnten;Aufzeigen, dass sie über qualitativ hochwertige Daten verfügen.YouGov erreicht diese Ziele, indem es datenbasierten Content zu brennenden Themen veröffentlicht. Diese Artikel werden dann von vertrauenswürdigen Medienunternehmen wie der New York Times und dem Time Magazine verlinkt, die auf der Suche nach Daten sind, die ihre Schlussfolgerungen untermauern.Backlinks-Bericht für YouGov aus dem Site Explorer von Ahrefs.Einige Artikel von YouGov haben Hunderte von Backlinks:Wie kannst auch du diese Strategie erfolgreich umsetzen?Der Kerngedanke hinter dieser Strategie ist, Daten zu nutzen, um interessante Artikel zu erstellen oder interessante Fragen, die sich in der eigenen Nische auftun, zu beantworten.Und so funktioniert es:Finde eine interessante Frage, die man mithilfe von Daten beantworten kannSammle Daten und veröffentliche die ErgebnisseBewerbe deinen Content bei DrittenSchritt 1. Finde eine interessante Frage, die man mithilfe von Daten beantworten kannDaten allein sind sinnlos. Stattdessen wollen die Leute sehen, was die Zahlen über ein Problem oder eine Frage aussagen, die sie haben.Bevor du überhaupt mit der Datenerhebung beginnst, solltest du eine Frage finden, die du beantworten möchtest. Wenn du bereits in der Branche tätig bist, sollten einige dieser Fragen relativ klar sein. Innerhalb der SEO-Branche wird zum Beispiel oft die folgende Frage aufgeworfen: “Wie lange dauert es, bis man gerankt wird?Hierbei handelt es sich um ein Thema, bei dem wir möglicherweise Daten zur Untersuchung verwenden könnten (was wir auch getan haben).Alternativ kannst du auch nach vorhandenen älteren Studien suchen. Du könntest dann diese Studien replizieren und neue Daten für die Branche bereitstellen.Schritt 2. Sammle Daten und veröffentliche die ErgebnissePräsentiere die Daten nicht einfach auf eine einfältige Art und Weise, sondern bereite sie zu einer Geschichte auf.Achte darauf, den Kontext für die Frage, die du beantwortest, darzulegen. Lass deine Zielgruppe wissen, wie die Daten gesammelt und deine Forschung durchgeführt worden sind.Erstelle anschließend benutzerdefinierte Diagramme, die dabei helfen, die Informationen besser zu verstehen. Hier ist ein Beispiel für ein leicht verständliches Diagramm aus einer unserer Studien:Mach dir keine Sorgen, wenn du keinen Zugang zu Daten hast. Du kannst jederzeit mit anderen Unternehmen zusammenarbeiten, die über Daten verfügen oder eigene Umfragen durchführen.Zum Beispiel hat Andy Crestodina, der eine Content-Marketing-Agentur namens Orbit Media betreibt, eine Umfrage unter 1.001 Bloggern durchgeführt.Schritt 3. Bewerbe deinen Content bei DrittenWenn jemand einen Artikel über ein ähnliches Thema wie das deiner Studie geschrieben hat, ist es wahrscheinlich, dass sich diese Person für deine Studie interessiert.Wenn du diese Personen also ausfindig machen kannst, kannst du mit ihnen Kontakt aufnehmen und deine Studie vorstellen. Vielleicht entscheiden sie sich dazu, zu deiner Studie zu verlinken oder sie in einem ihrer zukünftigen Blogbeiträge zu erwähnen.In unserem Guide zum Thema “Blogger Outreach” zeigen wir dir, wie das funktioniert.Abschließende GedankenWie du an den Beispielen sehen kannst, gibt es auch für Content-Marketing kein Patentrezept. Abhängig von deinen Zielen gibt es eine Vielzahl von Strategien, die du für maximale Wirksamkeit einsetzen kannst.Suchst du nach weiteren Beispielen aus dem Bereich Content-Marketing? Sieh dir diesen Blog-Beitrag an.Habe ich irgendwelche tollen Beispiele für B2B-Content-Marketing vergessen? Lass es mich auf Twitter wissen. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Si Quan Ong Marketing @ Ahrefs. Ich lese, mache Breakdance und versuche zufäliige Lebensexperimente.",
  "headers": [
    {
      "level": "H1",
      "text": "Was ist B2B-Content-Marketing? 7 erfolgreiche Beispiele"
    },
    {
      "level": "H2",
      "text": "1. Kostenlose Tools von Shopify"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H3",
      "text": "Facts & Figures"
    },
    {
      "level": "H3",
      "text": "Warum sind sie so erfolgreich?"
    },
    {
      "level": "H3",
      "text": "Wie kannst auch du ihre Strategie erfolgreich umsetzen?"
    },
    {
      "level": "H4",
      "text": "Schritt 1. Finde Tools, nach denen deine Kundenzielgruppe sucht:"
    },
    {
      "level": "H4",
      "text": "Schritt 2. Erstelle dein eigenes kostenloses Tool"
    },
    {
      "level": "H4",
      "text": "Schritt 3. Bewerbe das Tool"
    },
    {
      "level": "H2",
      "text": "2. Der Blog von Ahrefs"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H3",
      "text": "Facts & Figures"
    },
    {
      "level": "H3",
      "text": "Warum sind wir so erfolgreich?"
    },
    {
      "level": "H3",
      "text": "Wie kannst auch du diese Strategie erfolgreich umsetzen?"
    },
    {
      "level": "H4",
      "text": "Schritt 1. Keywords mit Such-Traffic- und Business-Potential finden"
    },
    {
      "level": "H4",
      "text": "Schritt 2. Erstelle die richtige Art von Content"
    },
    {
      "level": "H4",
      "text": "Schritt 3. Mache deinen Content bekannt"
    },
    {
      "level": "H2",
      "text": "3. Der YouTube Channel von Slidebean"
    },
    {
      "level": "H3",
      "text": "Facts & Figures"
    },
    {
      "level": "H3",
      "text": "Warum sind sie so erfolgreich?"
    },
    {
      "level": "H3",
      "text": "Wie kannst auch du diese Strategie erfolgreich umsetzen?"
    },
    {
      "level": "H4",
      "text": "Schritt 1. Führe eine YouTube-Keyword-Recherche durch"
    },
    {
      "level": "H4",
      "text": "Schritt 2. Erstelle ein optimiertes Video"
    },
    {
      "level": "H2",
      "text": "4. Die Podcast-Strategie von MeetEdgar"
    },
    {
      "level": "H3",
      "text": "Facts & Figures"
    },
    {
      "level": "H3",
      "text": "Warum sind sie so erfolgreich?"
    },
    {
      "level": "H3",
      "text": "Wie kannst auch du diese Strategie erfolgreich umsetzen?"
    },
    {
      "level": "H4",
      "text": "Schritt 1. Finde relevante Podcasts"
    },
    {
      "level": "H4",
      "text": "Schritt 2. Schlage dich selbst als Gast vor"
    },
    {
      "level": "H2",
      "text": "5. First Round — The Review"
    },
    {
      "level": "H3",
      "text": "Facts & Figures"
    },
    {
      "level": "H3",
      "text": "Warum sind sie so erfolgreich?"
    },
    {
      "level": "H3",
      "text": "Wie kannst auch du dieses Konzept erfolgreich umsetzen?"
    },
    {
      "level": "H4",
      "text": "Schritt 1. Finde heraus, welche Probleme deine Zielgruppe zu lösen versucht"
    },
    {
      "level": "H4",
      "text": "Schritt 2. Finde Experten und führe mit ihnen ein Interview"
    },
    {
      "level": "H4",
      "text": "Schritt 3. Mache deinen Content bekannt"
    },
    {
      "level": "H2",
      "text": "6. Der Blog von Kinsta"
    },
    {
      "level": "H3",
      "text": "Facts & Figures"
    },
    {
      "level": "H3",
      "text": "Warum sind sie so erfolgreich?"
    },
    {
      "level": "H3",
      "text": "Wie kannst auch du diese Strategie erfolgreich umsetzen?"
    },
    {
      "level": "H4",
      "text": "Schritt 1. Finde “Error Message”- Themen"
    },
    {
      "level": "H4",
      "text": "Schritt 2. Erstelle Content, der Antworten auf diese Fragen liefert"
    },
    {
      "level": "H2",
      "text": "7. Der Blog von YouGov"
    },
    {
      "level": "H3",
      "text": "Facts & Figures"
    },
    {
      "level": "H3",
      "text": "Warum sind sie so erfolgreich?"
    },
    {
      "level": "H3",
      "text": "Wie kannst auch du diese Strategie erfolgreich umsetzen?"
    },
    {
      "level": "H4",
      "text": "Schritt 1. Finde eine interessante Frage, die man mithilfe von Daten beantworten kann"
    },
    {
      "level": "H4",
      "text": "Schritt 2. Sammle Daten und veröffentliche die Ergebnisse"
    },
    {
      "level": "H4",
      "text": "Schritt 3. Bewerbe deinen Content bei Dritten"
    },
    {
      "level": "H2",
      "text": "Abschließende Gedanken"
    }
  ],
  "author": "Si Quan Ong"
}