{
  "url": "https://ahrefs.com/blog/de/backlinks-finden/",
  "slug": "backlinks-finden",
  "title": "Wie man Backlinks findet (und diese einfach dupliziert)",
  "description": "Willst du wissen wie du Backlinks findest, die wir wirklich beim Ranking helfen? Kopiere einfach die Links deiner Konkurrenz. Anleitung im Artikel.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (oder, in einfachen Worten, ich bin der Typ, der dafür sorgt, dass jeder Blog-Post EPISCH wird). Inhalt Willst du Backlinks finden, die du leicht für deine eigene Website reproduzieren kannst? Solltest du, denn Backlinks sind einer der beiden wichtigsten Google Ranking-Faktoren. Wie können wir das wissen? Google selbst hat es vor einigen Jahren bestätigt.Laut unserer Studie neigen Seiten mit vielen Backlinks dazu, mehr Traffic von Google zu erhalten.Aus unserer Studie mit ~1 Milliarde Seiten.Nebenbei bemerkt. Dies ist eine Korrelationsstudie, wie fast alle SEO-Studien. Wir können die Ursache nicht bestätigen. Aber mit der Aussage, dass Links einer der wichtigsten Faktoren für das Ranking sind, hat Google das so ziemlich für uns getan. Aber wie findet man überhaupt replizierbare, Backlinks die wirklich etwas bringen?Das Geheimnis, wie man Backlinks findet, die einem das Ranking in Google wirklich erleichternFinde heraus, woher deine Konkurrenten ihre Links bekommen, und replizieren diese anschließend.Bist du dir nicht sicher, wer deine Konkurrenten sind? Es sind die Webseiten, die bei Google bereits eine hohe Position für die Suchanfragen einnehmen, für die du auch ranken möchtest. Deine Aufgabe ist es, die Backlinks zu finden (und zu replizieren), die dir dabei helfen, dorthin zu gelangen.Willst du mehr Konkurrenten finden? Verwende den Bericht Konkurrierende Domains im Site Explorer, um Webseiten zu finden, die mit dir in den SERPs konkurrieren.Site Explorer > Gib deine Domain ein > Konkurrierende DomainsDenke daran, dass dies nur mit etablierten Webseiten funktioniert. Wenn deine Webseite neu ist und noch kein Ranking aufweist, wirst du hier vielleicht nur wenige Daten sehen.Für uns wäre eine konkurrierende Website backlinko.com, da sie bei sehr vielen Suchbegriffen, für die wir ranken wollen, bereits eine Platzierung aufweist. Dasselbe gilt für moz.com.Hast du mindestens einen Konkurrenten für deine Website gefunden? Der nächste Schritt besteht darin, herauszufinden, woher deren Backlinks kommen.Wie man Backlinks (jeder beliebigen Webseite) findetGehe zum Ahrefs-Site-Explorer;Füge eine beliebige URL oder Domain ein (z.B. https://competitor/blog/blog-post/ oder https://competitor.com)Wähle die “exakte URL” (für Unterseiten) oder “*.domain/*”. (für Webseiten) Einstellung aus dem Drop-Down-Menü aus.Gehe zum Bericht Backlinks (im linken Menü)Du siehst nun Backlinks, die auf die von dir gewählte Unterseite oder Domain verweisen, sowie eine Menge Daten, wie z.B.:Verweisende Seite (woher der Link kommt);Ankertext (die anklickbaren Wörter, die zur Zielseite verlinken);Traffic (geschätzter Google-Suchtraffic zur verweisenden Seite);Zuerst gesehen (wann wir den Link zum ersten mal entdeckt haben)Diese Daten stammen aus der branchenführenden Backlink-Datenbank von Ahrefs, die 212 BILLIONEN Seiten enthält. Diese wurde durch Crawling im Web erstellt und wird alle 15–30 Minuten aktualisiert. Außerdem durchforsten wir jede Minute 4,1 Millionen Seiten!Wir crawlen so schnell, dass wir sogar die Crawler von Bing, Yahoo und Yandex übertreffen.Das Fazit? Du kannst den Backlinks-Bericht unseres Site Explorers verwenden, um Backlinks zu jeder Unterseite oder Webseite zu überprüfen. Wenn du also die Website eines Mitbewerbers eingibst, siehst du alle seine Backlinks.Inwiefern ist das nützlich? Denn einige der Links deiner Konkurrenten haben diesen zu einem guten Ranking verholfen. Deine Aufgabe ist es nun, diese Links zu finden und sie zu replizieren.Aber diese Berichte umfassen oft Hunderttausende von Backlinks.…… woher weißt du also, welche du nachahmen solltest?Wie du replizierbare Backlink-Möglichkeiten deiner Konkurrenten findestDu solltest Backlinks immer seitenweise recherchieren. Dies ist von entscheidender Bedeutung.Ich wiederhole: Wenn es dein Ziel ist, Backlinks nachzubauen, schaue nicht nur auf die Backlinks, die auf eine konkurrierende Startseite verweisen. Du wirst daraus nicht viel lernen. Beginne immer damit, die Seite zu erforschen von der du dir Backlinks nachbauen möchtest.Nebenbei bemerkt. Wenn dein Ziel darin besteht, Links zu deiner Startseite zu erstellen, ist es in Ordnung, deine Nachforschung von einer konkurrierenden Startseite aus zu starten. Stelle nur sicher, dass du dir auch Unterseiten ansiehst und nicht nur die gesamte Website. Wie wählen Sie eine Seite zur Recherche aus?Es kommt auf deine Umstände und Ziele an.Wenn du Links zu bestehenden Inhalten auf deiner Website erstellen möchtest, beginne damit, ähnliche Inhalte zu finden, die bereits einige Backlinks haben. Wenn wir zum Beispiel Links zu unserer Liste von SEO-Tipps erstellen wollten, würden wir mit der Recherche einer ähnlichen Liste von Tools beginnen, die bereits einige Backlinks wie diese aufweisen.Wenn du neue Inhalte erstellst, mit dem Ziel, Links anzuziehen, beginne damit zu untersuchen, was bei deinen Wettbewerbern funktioniert. Wenn wir dies zum Beispiel für ahrefs.com tun würden, könnten wir damit beginnen herauszufinden, welche Art von Inhalten die meisten Links für backlinko.com oder moz.com erreichen.Schauen wir uns beide Fälle mal im Detail an.Schritt 1. Finde eine relevante Seite mit vielen BacklinksNehmen wir an, wir wollen neue Backlinks für ahrefs.com aufbauen, haben aber noch keine Inhalte.Zunächst müssen wir eine Seite mit viele Backlinks finden. Wir werden uns dann von dieser Seite inspirieren lassen und ähnliche, jedoch besseres Inhalte erstellen. Schließlich werden wir diesen neu geschaffenen Inhalte dazu verwenden, Backlinks der Originalseite zu kopieren.Zu Beginn wollen wir sehen, welche Seiten die meisten Backlinks für einen unserer Konkurrenten, moz.com haben. Dazu verwenden wir den Bericht Best by Links im Site Explorer.Site Explorer > Eingabe einer konkurrierenden Domain > Seiten > Best by Links > HTTP 200-Filter hinzufügenIn diesem speziellen Fall wirst du feststellen, dass einige dieser Seiten nicht relevant für unsere Planung sind. Wir wollen hier keine Produkt- und Dienstleistungsseiten aufnehmen; wir wollen nur Links zu Inhalten des Blogs finden.Dazu können wir den “Präfix”-Modus im Site Explorer verwenden. Dies beschränkt die Daten auf einen Teilbereich einer Website (z.B. moz.com/blog*).Hier ist eine der Seiten, die im Beste nach Links-Bericht für moz.com/blog auftauchten:Diese hat über 2.500 Backlinks von 1.021 verweisenden Domains.Ich bin ziemlich sicher, dass wir etwas Ähnliches (und besseres) schaffen könnten, oder?PRO TIPEs ist nicht immer notwendig, eine bessere Version einer exakten Seite zu erstellen. Du kannst diesen Bericht auch dazu verwenden, um herauszufinden, welche Art von Inhalt wahrscheinlich neue Backlinks anziehen könnte, und dann etwas Ähnliches erstellen.So sind beispielsweise viele der am häufigsten verlinkten Seiten auf backlinko.com Studien.Wenn wir also versuchen würden, Inhalte zu erstellen, die Backlinks für ahrefs.com erhalten, wäre die Erstellung eines Experiments oder einer Fallstudie die beste Vorgehensweise.Aber wir müssen nicht einmal genau diese Themen “kopieren”.Zum Beispiel könnten wir, anstatt diese SEO-Studie für die Sprachsuche (siehe Screenshot oben), die sich auf die Optimierung von Google Home konzentriert, lediglich mithilfe der Skyscraper-Methode zu optimieren, eine ähnliche Studie für die Sprachsuche mit Alexa-Geräten erstellen. Personen, die sich mit SEO-Studien für die Sprachsuche beschäftigen, sind wahrscheinlich offen für eine Verlinkung zu unserer Alexa-Studie, weil diese ebenfalls einen Mehrwert schafft.Alternativ dazu könnten wir einen sehr ausführlichen Leitfaden für Schema-Markups bei der Suchmaschinenoptimierung erstellen. Dies ist etwas, das Brian in seiner SEO-Studie für Sprachsuche erwähnt, aber nicht sehr detailliert erklärt. Ich bin mir sicher, dass Leute, die Brians Leitfaden verlinkt haben, auch bereit wären zu detaillierteren Inhalten zu verweisen.Aber was, wenn wir bereits eine Seite haben, zu der wir Backlinks aufbauen wollen, wie zum Beispiel unseren On-Page-SEO-Leitfaden? Dies würde einen anderen Ansatz erfordern, da wir stattdessen ähnliche Seiten finden müssten, die bereits Backlinks haben.Wir könnten dies tun, indem wir das Thema unserer Seite googeln und dann jede der Top 10 Seiten in den Site Explorer einfügen, um zu sehen, wie viele Backlinks diese haben…… aber das ist etwas umständlich, deshalb ziehe ich es vor, die SERP-Übersicht im Keywords-Explorer zu verwenden, der Backlinks zu allen Top 10 Seiten auf einmal anzeigt. Pro-TippMöchtest du Backlinks für alle Top-100 Ergebnisse erfassen?Ändere deine Google-Sucheinstellungen so, dass die Top 100 Ergebnisse angezeigt werden, scrape sie und füge Sie dann in das Ahrefs-Batch-Analyse-Tool ein. Sortiere diese anschließend nach verweisenden Domains.Mit dem Content Explorer können wir auch relevante Seiten mit jeder Menge Backlinks finden.Der Content Explorer ist wie eine Mini-Suchmaschine, die von einer Datenbank mit fast einer Milliarde Seiten gespeist wird. Wenn du nach etwas suchen, werden alle Seiten angezeigt, die diesen Begriff im Inhalt (oder in deinem Titel-Tag, wenn du diese Option wählst, was ich empfehle) erwähnen.Inwiefern ist dies nützlich? Weil du dann die integrierten Filter des Content Explorers verwenden kannst, um die Ergebnisse sofort nach der Anzahl der Backlinks zu sortieren und zu filtern. Mit anderen Worten: Du kannst die am meisten verlinkten Seiten zu deinem Thema sehen. Und so funktioniert es:Content Explorer > gebe einen Suchbegriff ein > wähle “Im Titel” aus der Dropdown-Liste (optional — in der Regel werden einfach relevantere Ergebnisse angezeigt) > sortiere die Ergebnisse nach den verweisenden Domains.Wie du siehst, haben wir 9.478 Ergebnisse für “on page seo” erhalten, von denen ein Ergebniss von unserem Konkurrenten backlinko.com stammt. Da wir bereits eine ähnliche Seite haben, bleibe ich für den Rest des Artikels bei diesem Beispiel.Wenn du eine Seite gefunden hast, von der du Backlinks replizieren möchtest, füge die URL in den Site Explorer ein und nutze den Bericht Backlinks. Du kannst nun alle Backlinks für diese Seite (und alle anderen relevanten Seiten, die du gefunden hast) nacheinander prüfen.Erschrecke dich nicht, wenn du viele Backlinks in diesem Bericht siehst. Du musst diese nicht alle analysieren. Du musst diese Liste noch filtern, sodass du nur noch die Backlinks analysieren musst, die:du tatsächlich suchst;tatsächlich replizierbar sind.Lass uns damit starten!Schritt 2. Filtern und Sortieren der BacklinksDie Suche nach Backlinks kann nicht vollautomatisch erfolgen. Ein gewisses Maß an manueller Überprüfung ist immer noch erforderlich.Aber was ist, wenn der Backlink-Bericht für die von dir betrachtete Seite so aussieht?Niemand hat die Zeit, so viele Links manuell zu überprüfen, oder? Musst du auch nicht.Die Wahrheit ist, dass viele der Links eine Überprüfung nicht wert sind, z.B. wegen schlechter Qualität, mit nofollow Status oder die von fremdsprachigen Seiten stammen.Entferne diese einfach, indem du die folgenden Filter hinzufügst:Sprache → DeutschLink-Typ → DofollowPlattform → BlogsDer letzte Filter ist ein sehr wichtiger Filter. Er filtert nach Links, die in Blogs erscheinen und bei denen es sich fast immer um inhaltsbezogene redaktionelle Links handelt. Das sind die starken Links, die wir alle wollen.Du solltest die Links auch nach der Traffic (hoch bis niedrig) sortieren und damit Links von Seiten mit viel Traffic priorisieren. Hier ist der Grund:Es wird gemunkelt, dass Google Backlinks von Seiten mit hohem Traffic als wertvoller erachtet. Wenn Google Traffic an die verlinkende Seite sendet, müssen sie diese Seite wohl auch wertvoller sein. Obwohl Google dies nie bestätigt hat, wäre es meiner Meinung nach sinnvoll, dass alle Seiten, die mit diesen “vertrauenswürdigen” Seiten in Verbindung stehen, auch von der Assoziationskraft als qualitativ hochwertig angesehen werden.Es wird zu mehr Referral-Traffic führen. Denke daran, dass der ursprüngliche Punkt der Links nichts mit SEO zu tun hat. Sie bieten eine Möglichkeit für Menschen, im Web zu navigieren. Wenn du auf einen Link klickst, führt er dich zu einem Ziel. Deshalb wird es Link genannt. Je mehr Traffic die verweisende Seite hat, desto größer ist die Chance, dass jemand auf deinen Link klickt und auf deiner Website landet. Dies versteht man unter Referral-Traffic.Es wird zu mehr automatischen Links führen. Ganz gleich, welche Taktik du anwendest, um Backlinks aufzubauen, der Ausgangspunkt ist immer derselbe: Der potenzielle Linkgeber muss sich zunächst bewusst werden, dass dein Inhalt überhaupt existiert. Findet niemand deinen Inhalt, werden auch keine Backlinks entstehen, egal wie großartig er ist. Links auf Seiten mit viel Traffic bringen deine Inhalte vor mehr Menschen, was wiederum zu mehr Links führt.So sollte deine Liste nach deiner Filterung aussehen:Du wirst feststellen, dass es bereits viel weniger Backlinks geworden sind: 795 statt 4.485. Direkt viel überschaubarer!Schritt 3. Replizierbare Links findenIn diesem Stadium solltest du eine gefilterte, hochwertige Liste von Backlinks haben, die du vielleicht kopieren möchtest. Jetzt sollten wir uns darum kümmern, Backlinks zu finden, die auch wirklich replizierbar sind.Hier werden viele sogenannte Marketer schnell faul.Viele exportieren diesen Bericht einfach und verschicken Outreach E‑Mails mit Vorlagen wie:“Hey [Name],Ich habe gerade nach Inhalten zu [Thema] gesucht und deinen Leitfaden gesehen: [URL einfügen] Toller Artikel!Ich habe vor kurzem einen Leitfaden über [Thema] veröffentlicht und dachte, dass du ihn vielleicht gerne lesen möchten. Hier ist der Link: [gib deine URL ein] Was meinst du dazu? Vielleicht wäre es eine gute Ergänzung deines Beitrages?Danke,Schmieriger-Marketer”Bitte tu so etwas nicht! Deine Konversionsrate wird sehr niedrig sein. Du wirst die Leute viel eher verärgern und abschrecken.Ich sage nicht, dass du damit keine Backlinks aufbauen könntest. Wenn du es in einer gewissen Größenordnung tust, wirst du auch Erfolge verzeichnen. Jedoch möchten wir dir solche Taktiken nicht empfehlen da du damit viele Kontakte auf Dauer einfach verbrennst.[/sidenote]Was solltest du stattdessen tun?Arbeite dich durch deine gefilterte Liste und:Schaue dir den Kontext der Links an um zu verstehen, warum er entstanden ist. (Hinweis: Schau dir auch die Spalte “verweisende Seite” sowie “Anker und Backlink an)Finde heraus ob und wie das Hinzufügen oder Austauschen mit deinen Inhalten einen Mehrwert herbeiführen würde.Hast du bemerkt, dass ich das Wort “ob” in diesem zweiten Punkt fettgedruckt habe? Denn es ist nicht immer angebracht, den Autor zu bitten, den bestehenden Link zu auszutauschen oder gar deinen Link auf der Seite hinzuzufügen.Du solltest nur anfragen, wenn es sehr gute Gründe dafür gibt. Deshalb ist es so wichtig, den Kontext der Verlinkung und den Grund dafür zu verstehen.Dies ist manchmal etwas schwieriger, darum sind hier ein paar gute Gründe warum Menschen kontextbezogen verlinken.Empfehlung;Link zur Quelle;Bestehende Beziehung;Bezahlter LinkWenn du herausfinden kannst, welches davon der Grund für die Verlinkung war, dann kannst du oft verstehen, wie du diesen kopieren kannst.Lass uns jeden Punkt mal etwas genauer betrachten:1. EmpfehlungDiese Links empfehlen eine Ressource, aber nicht explizit. Vielmehr sind sie kontextuell innerhalb des natürlichen Flusses des Artikels angelegt. In etwa so:Du kannst diese erkennen, indem du dir den Ankertext sowie den umgebenden Text in der Spalte “Anker und Backlink” ansiehst. Wenn der Link innerhalb eines Satzes besteht, handelt es sich um eine kontextbezogene Empfehlung.Diese werden im Allgemeinen als die besten Links angesehen, die man erhalten kann.Das Problem? Sie zu reproduzieren kann ziemlich schwierig sein.Blogger verlinken normalerweise auf diese Weise, wenn sie ein Fan eines bestimmten Artikels sind. Ein kurzes “Hey, unser Beitrag ist besser, kannst du stattdessen einen Link zu uns setzen?” reicht also leider nicht aus.Du wirst einen wirklich guten Grund brauchen, Autoren dazu zu bewegen, einen Linktausch durchzuführen, wie zum Beispiel:Der Artikel, auf den du derzeit verlinkst, ist defekt (d.h., der Broken-Linkaufbau);Der Artikel, auf den du derzeit verlinkst, ist ziemlich ungenau und/oder veraltet;Der Artikel, auf den du derzeit verlinkst, ist bei weitem nicht so ausführlich wie dein eigener Artikel (d.h. der “Skyscraper”-Taktik).Wenn einer dieser Gründe zutrifft, hast du schon mal gute Karten und kannst den Autor direkt ansprechen.Ansonsten empfehle ich einen weniger subtilen Ansatz:Finde etwas Einzigartiges in deinem Artikel. Schreibst du über etwas, was deine Konkurrent übersehen hat? Hast du eine einzigartige Ansichtsweise? Hast du etwas widerlegt, was im Artikel steht?Benutze dieses Argument zum “weichen” Einstieg. Informieren den Autor der Seite per E‑Mail über deinen Artikel. Frage aber nicht nach einem Link. Schreibe ihm einfach, dass dir sein Artikel aufgefallen ist und ob er vielleicht Interesse daran hätte, deinen zu lesen, weil [hier eine Einzigartigkeit einfügen].Es geht hier nicht darum, ihn zu überzeugen, den Link aufzubauen. Du möchtest ihn lediglich auf deine Inhalte aufmerksam machen und eine Beziehung aufbauen. Menschen verlinken zu Menschen, die sie kennen und mögen, sodass es sich lohnt, Beziehungen zu denjenigen aufzubauen, die regelmäßig auf andere Blogs in deiner Nische verlinken.(Ich zeige dir später im Leitfaden einen Hack für die weitere Vorgehensweise).Auf diese Weise erzählst du vielleicht in Zukunft ganz automatisch einen Link.Und ja, dies dauert vielleicht eine Weile. Aber um ehrlich zu sein, ist dies die beste Methode um hochwertige Links aufzubauen.Weitere InformationenIch habe gerade Ihre Outreach-E-Mail gelöscht, ohne sie zu lesen. Und NEIN, es tut mir nicht leidBlogger-Outreach: Wie man es macht und skaliert, ohne wie ein Idiot zu wirken.2. Links zur QuelleArtikel mit einzigartigen Statistiken, Grafiken, Fakten oder Ideen ziehen Links zur entsprechenden Quelle an:Wenn du dir den Anker und den umgebenden Linktext ansiehst, kannst du sehen, dass der Autor in seinem Artikel einen Abschnitt aus diesem Beitrag zitiert hat und auf die Quelle verlinkt.Aber es sind nicht nur Statistiken, die zu “Quellen”-Links führen. Manchmal ist es ein Link zu einem Bild…… einer Definition…… oder auch nur eine Idee…Hier sind einige Ideen für die Erstellung solcher Links:Neuere Statistik. Hast du eine aktuellere Statistik über die gleichen Themen in deinem Artikel? Dann haben wir einen Gewinner! Niemand will auf veraltete Inhalte verlinken, also melde dich bei dem Autor und weise ihn darauf hin. Vielleicht möchte er ja zu etwas aktuellerem verlinken.Hochwertigere Grafik. Ist die Grafik, die eingebaut wurde, hässlich? Oder von geringer Qualität? Erstelle eine bessere Version.Bessere Definition. Ergibt alles Sinn? Gibt es in deinem Artikel eine bessere Definition, die einen perfekten Ersatz darstellen würde?Aber die Sache ist die: Diese Ideen können funktionieren, aber nur wenn die Umstände stimmen.Am besten ist es, wenn du bei den Quellenlinks einen ganzheitlichen Ansatz verfolgst und nach Trends Ausschau hältst. Wenn du feststellst, dass ein Artikel der Konkurrenz aus einem bestimmten Grund viele Quellverknüpfungen hat (z.B. viele Leute, die eine Grafik aus dem Beitrag einbetten), solltest du deinen Inhalt entsprechend ähnlich anpassen.Wenn ein hoher Prozentsatz der Links das Ergebnis von Bildeinbettungen ist, füge auch ein (besseres) Bild in deinen Beitrag ein.Wenn viele Links durch zitierten Definition entstanden sind, so sollte auch dein Artikel diese Definitionen verfügen.Wenn die meisten Links aufgrund einer Statistik entstanden sind… naja, du weißt worauf ich hinaus will!3. Bestehende BeziehungMenschen vernetzen sich mit anderen, die sie kennen und mögen. Das ist einfach die menschliche Natur.Aber wie erkennt man, ob eine Website eine Beziehung zu einer anderen Website hat, wenn man sich den Backlinks-Bericht ansieht?Gar nicht. Schau dir dazu die Domain deiner Konkurrenten (ja, Domain!) im Site Explorer genau an und überprüfe den Bericht über verweisende Domains. Dieser zeigt dir alle einzigartigen Webseiten, die zu deiner Konkurrenz verweisen an. Entscheidend ist, die Anzahl der Verlinkungen.Site Explorer > konkurrierende Domain eingeben > Verweisende Domain > dofollow-Filter hinzufügen > nach “Links zum Ziel” sortierenDurchsuche den Bericht lediglich nach relevanten, bekannten oder vertrauenswürdig klingenden Domains. Ignoriere alle minderwertige Seiten.Ich habe das für backlinko.com getan und dies erkannt:Nein, du erkennst richtig. Mehr als 2.500 Links von neilpatel.com zu backlinko.com.Man muss kein Genie sein, um herauszufinden, dass Neil ein großer Fan von Brian sein muss. Er respektiert seine Arbeit ganz klar… genug, um 2.500 Backlinks zu erstellen!Wie hilft dir das? Bei diesen Menschen lohnt es sich eine Beziehung aufzubauen, da sie viele Inhalte veröffentlichen und dazu neigen, immer wieder auf bekannte Seiten zu verlinken.Das soll nicht heißen, dass es dein einziger Grund sein sollte. Baue Beziehungen zu Menschen auf, die du magst und bewunderst. Tu es nicht nur für die Links.4. Bezahlte LinksBezahlte Links sind meist nicht günstig. Der Durchschnittspreis liegt bei etwa 361,44 Dollar.Diese können manchmal etwas schwierig zu erkennen sein, aber einige wenige verräterische Anzeichen gibt es dennoch:Keyword Anker-Text; Stammt von einem “Gastbeitrag”;Sehr wenige andere externe Links auf der Seite;Unnatürlich platziertEs versteht sich wahrscheinlich von selbst, dass du nicht versuchen solltest, diese Links zu reproduzieren.Ich wollte dies nur kurz erwähnen, damit du auch davon gehört hast. Im schlimmsten Fall kannst du viel Zeit bei der Suche nach guten Linkquellen damit verschwenden.Wenn du dich an einen Blogger wendest und dieser nach Geld fragt, solltest du diese Seite aus deiner Liste streichen und nicht mehr kontaktieren. Wahrscheinlich hat dein Konkurrent für einen Link von dieser Website bezahlt. An dieser Vorgehensweise solltest du dir kein Beispiel nehmen.5. AndereDecken diese 4. Punkte hier alles ab? Ganz und gar nicht. Du solltest jeden Link immer einzeln beurteilen. Wenn du dir über den Kontext oder den Grund für den Backlink nicht sicher sind, besuche mal den Linkgeber. Drücke STRG/CMD+F und suche anschließend nach dem Ankertext.Dies ist manchmal der einzige Weg, um den wahren Grund für eine Verlinkung zu verstehen.Schaue dir zum Beispiel diesen Link an:Wir wissen, woher und wohin er führt, aber das Wort “here” als Anker-Text sagt nichts darüber aus, warum diese Verlinkung besteht.Aber wenn wir uns die verlinkte Seite ansehen, wird es sofort klar.Der Autor benutzte das “Content-Upgrade” von Brians Beitrag als Beispiel in seinem Artikel.Ist diese Verbindung replizierbar? Nicht für uns. Wenn du jedoch ein sogenanntes “Content Upgrade” in deinem Beitrag hast, kann es sinnvoll sein, sich darum zu bemühen und dies als ein weiteres Beispiel für die Aufnahme in den Artikel anzubieten. (Wahrscheinlich lohnt es sich aber, vorher eine Beziehung aufzubauen.)Kann man ohne Backlinks eine gute Platzierung erreichen?Ja, es ist möglich. Aber selten.Woher können wir das wissen? Weil es eine positive Korrelation zwischen der Anzahl der verweisenden Domains auf einer Seite und der Anzahl der rankenden Keywords gibt (in den Top 100)Nebenbei bemerkt. Um es noch einmal zu wiederholen: Diese Grafik ist das Ergebnis einer umfassenden Studie. Sie stellt aber keinen hundertprozentigen Beweis dar. Google hat erklärt, dass Backlinks einer der beiden wichtigsten Ranking-Faktoren sind, sodass wir mit ziemlicher Sicherheit sagen können, dass dies in diesem Fall der Fall ist. Aber was wäre, wenn es eine Möglichkeit gäbe, Themen zu identifizieren, für die man mit wenigen oder gar keinen Backlinks gute Platzierungen erlangen könnte? Das wäre doch cool, oder?Ab zum Content Explorer (erneut!)Nochmal zur Wiederholung: Der Content Explorer ist eine in ahrefs eingebaute Mini-Suchmaschine. Er umfasst unsere Datenbank mit fast einer Milliarde Seiten. Du kannst es genau so nutzen wie Google. Gebe etwas ein und du wirst alle Seiten aus unserer Datenbank erhalten, welche entsprechende Keywords beinhalten.Aber für diesen Hack müssen wir noch ein paar Filter hinzufügen.Geschätzter monatlicher organische Traffic: > 500;Verweisende Domains: <5Sprache: DeutschDies filtert nach Seiten, die nur wenige verweisende Domains (Backlinks) und mindestens fünfhundert monatliche Besuche von Google haben.Hier sollte es möglich sein ein gutes Ranking mit wenigen Backlinks zu erreichen.Für weitere Content Explorer Hacks solltest du dir das Video von Sam Oh anschauen.https://www.youtube.com/watch?v=NKurQTHDcDcFazitBacklinks sind nicht immer leicht zu reproduzieren, besonders hochwertige sind knifflig.Dies ist eigentlich aber eine gute Sache. Es ist für alle schwierig, nicht nur für dich. Es sind also gleiche Ausgangsbedingungen für alle, wobei in erster Linie die Qualität der Inhalte eine entscheidende Rolle spielt.Allerdings reicht es nicht aus, einfach nur qualitativ hochwertige Inhalte zu erstellen. Die Besucher müssen auch wissen, dass es sie gibt, vor allem diejenigen, die die Macht haben, hochwertige Backlinks zu schaffen. Hier kommt die Reichweite von Bloggern ins Spiel.Suchst du noch weitere Methoden, um die Backlinks der Konkurrenz zu stehlen? Schau dir unsere Liste mit sieben verfolgbaren Möglichkeiten an, um die Backlinks deiner Konkurrenten zu plündern.Übersetzt von Jens Polomski, der auf Jens.Marketing ein stetig wachsendes Verzeichnis an Online Marketing Tools aufbaut. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Joshua Hardwick Head of Content @ Ahrefs (oder, in einfachen Worten, ich bin der Typ, der dafür sorgt, dass jeder Blog-Post EPISCH wird).",
  "headers": [
    {
      "level": "H1",
      "text": "Wie man Backlinks findet (und diese einfach dupliziert)"
    },
    {
      "level": "H2",
      "text": "Das Geheimnis, wie man Backlinks findet, die einem das Ranking in Google wirklich erleichtern"
    },
    {
      "level": "H2",
      "text": "Wie man Backlinks (jeder beliebigen Webseite) findet"
    },
    {
      "level": "H2",
      "text": "Wie du replizierbare Backlink-Möglichkeiten deiner Konkurrenten findest"
    },
    {
      "level": "H3",
      "text": "Schritt 1. Finde eine relevante Seite mit vielen Backlinks"
    },
    {
      "level": "H3",
      "text": "Schritt 2. Filtern und Sortieren der Backlinks"
    },
    {
      "level": "H3",
      "text": "Schritt 3. Replizierbare Links finden"
    },
    {
      "level": "H4",
      "text": "1. Empfehlung"
    },
    {
      "level": "H4",
      "text": "2. Links zur Quelle"
    },
    {
      "level": "H4",
      "text": "3. Bestehende Beziehung"
    },
    {
      "level": "H4",
      "text": "4. Bezahlte Links"
    },
    {
      "level": "H4",
      "text": "5. Andere"
    },
    {
      "level": "H2",
      "text": "Kann man ohne Backlinks eine gute Platzierung erreichen?"
    },
    {
      "level": "H2",
      "text": "Fazit"
    }
  ],
  "author": "Joshua Hardwick"
}