{
  "url": "https://ahrefs.com/blog/de/backlinks-kaufen/",
  "slug": "backlinks-kaufen",
  "title": "Was kostet das Kaufen von Links? Ich habe 630 Blogs angefragt um es herauszufinden",
  "description": "Links zu kaufen, tun viele Menschen, aber sie reden kaum darüber. Wir haben eine Studie entworfen, um herauszufinden, wie viel ein Link zu deiner Webseite 2018 kostet.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (oder, in einfachen Worten, ich bin der Typ, der dafür sorgt, dass jeder Blog-Post EPISCH wird). Inhalt Im Jahr 2016 fanden wir heraus, dass der durchschnittliche Preis eines gekauften Links $352,92 war. Wie haben wir das herausgefunden?David McSweeney, einer unserer Beitragenden, kontaktierte über 250 Webseiten in 5 beliebten Branchen. Er fragte 2 Fragen:Verkaufst du Links?Wenn ja, für wie viel verkaufst du sie?Das waren damals 2016 die Ergebnisse:Wir haben 250 Blogs angeschrieben und gefragt, ob sie Links auf ihren Seiten verkaufen.Doch wir wollten die Zahlen für 2018 aktualisieren.Deshalb habe ich diese Studie letzten Monat mit mehr Webseiten in mehr Branchen erneut durchgeführt.Ich habe ebenfalls ein zweites Experiment durchgeführt, bei dem ich 180 Gastartikel-Pitches versendet habe, um zu sehen, wie viele Leute mich zum Zahlen einer Gebühr auffordern.Nebenbei bemerkt. Ich habe niemals in diesen E‑Mails Geld oder ähnliches erwähnt. Gleich werde ich meine Erkenntnisse aus beiden Studien mitteilen.Doch lass uns zunächst einen kurzen Blick auf die Linkkauf- und Verkaufindustrie werfen.Die Linkkauf- und Verkaufsindustrie: Eine kurze GeschichteSolange Google Linkpopularität benutzt hat um Websites zu ranken, waren Backlinks eine Ware.Und wie bei allen Waren gibt es solche, die sie kaufen und solche, die sie verkaufen wollen.Doch Linkkauf hat viele Schattierungen und Formen.Manche sind 100% Black Hat, andere Grey Hat und wieder andere sind White Hat.Folgendermaßen hat sich das Kaufen von Links über die Jahre entwickelt:Früher Linkkauf: Webverzeichnisse (Mitte der 1990er—2000er)Bezahlte Artikeleinreichungen waren eine der frühesten Formen von Linkkauf.Diese Verzeichnisse haben üblicherweise eine “Prüfgebühr” aufgerufen..Das heute geschlossene Yahoo Directory ist eines der hochwertigsten Beispiele.Sie riefen eine Gebühr von ca. £300 ($402) zur Aufnahme auf, wobei sie auch einige Seiten abgelehnt haben.Lass dich nicht täuschen, denn dieser Link wurde nicht wegen des Traffics gekauft.Er wurde immer gekauft um die Google-Rankings zu verbessern.Der Linkkauf-Boom (Mitte der 2000er, fortlaufend)Bis Mitte der 2000er ist eine ganze Industrie um das Verkaufen von Links gewachsen.Seiten wie Text Link Ads verkauften Links auf “Vermietungs”-basis.Bild von Google PlusDabei handelte es sich meist um seitenweite Sidebar-Links, für die du eine monatliche Gebühr bezahlen musstest. Die Kosten hingen von den Metriken der Seite ab.Und zu dieser Zeit war die Metrik von Relevanz PageRank.Die Preise begannen bei ca. $30/Monat für einen Link von einer PR1/2 Seite. Seiten mit hohen PR riefen Gebühren von $100+ auf.Vergiss nicht, dass es sich dabei um monatliche Kosten handelt. Also würden $100/Monat dich am Ende $1.200 im Jahr kosten.Es gab auch viele Webseiten, die Links im Inhalt verkauften. Du konntest sogar den Linktext, den du wolltest, auswählen.Doch leider hat Google bald Maßnahmen ergriffen, um solche Links zu erkennen und abzuwerten.Google zwingt Linkverkäufer in den Untergrund (Späte 2000er, fortlaufend)Google begann mehr Ressourcen in ihr Webspam-Team zu stecken.Und sie fingen an Abstrafungen an die zu vergeben, die erwischt wurden, Links zu verkaufen über Linkbörsen oder Foren.Diese Abstrafungen bedeuteten normalerweise eine Verminderung des PageRanks, doch in extremen Fällen konnte es auch eine Deindexierung sein.Sie hatten Nutzer auch dazu angehalten, bezahlte Links direkt an Google zu melden.Hat das den Linkkauf gestoppt?Nope. Aber es zwang solche, die Links kaufen und verkaufen zur Diskretion.Das wiederum machte es schwerer für Google alle Seiten zu erwischen, welche die Regeln missachten.Und um es klarzustellen, das Kaufen von Links um die Rankings zu manipulieren, ist definitiv gegen Googles Regeln.Das Kaufen von Links ist das erste Beispiel, welches sie in ihren Qualitätsrichtlinien von einem “Link Scheme” geben:Die folgenden sind Beispiele von Link-Schemes, die das Ranking einer Seite in den Suchergebnissen negativ beeinflussen können:Das Kaufen oder Verkaufen von Links, die PageRank weitergeben. Dies beinhaltet den Tausch von Geld für Links oder Artikel die Links enthalten; den Tausch von Waren oder Dienstleistungen für Links; oder das Versenden eines “kostenlosen” Produkts im Austausch für einen Artikel und das Einfügen eines Links.Also wie ist der aktuelle Status bezüglich dem Kaufen von Links?ANMERKUNG DER REDAKTIONWenn du erwischt wirst Links zu kaufen um Rankings zu verbessern, kann Google deine Seite abstrafen. Wir empfehlen nicht Links zu kaufen, aber wenn du es tust, dann solltest du die Risiken kennen.Joshua HardwickHead of ContentLinkkauf/Verkauf im Jahr 2018 (und darüber hinaus)Hier sind einige Wege wie du Links für SEO-Zwecke im Jahr 2018 kaufen kannst:Bezahlte Gastartikel (z.B. “Gesponserte” Artikel)Eine kurze Google-Suche für “Gastartikel kaufen” offenbart eine große Zahl an Seiten, die anbieten dir Links von Gastartikeln für eine Gebühr zu beschaffen.Alle diese Dienstleistungen fallen in eine dieser drei Kategorien:Seriöse Gastartikel-Veröffentlichungsservices: Sie führen echte Anfragen bei echten Blogs durch und sichern Gastartikelplatzierungen für dich.Getarnte PBNs: Sie verkaufen ihre Dienstleistungen als echte Anfragen, aber tatsächlich benutzen sie PBNs. Du kannst diese Dienstleistungen üblicherweise schon von weitem erkennen, da sie sehr günstig sind (<$100 pro Artikel). Wir empfehlen sie nicht zu benutzen, außer du bist dir im Klaren über die Risiken, die mit PBNs verbunden sind und akzeptierst diese.Zwischenhändler Linkkäufer/Verkäufer: Sie verkaufen Seiten zur Aufnahme für ihre Kunden, erhöhen den Preis und streichen die Differenz ein. Im Wesentlichen sind sie Mittelsmänner (oder Frauen) im Linkkauf/verkaufsprozess.Ich würde sagen #3 ist am Häufigsten.Wir bekommen die ganze Zeit Anfragen von Zwischenhändlern (#3).Hier ist ein Beispiel:Wir hatten sogar mal einen Typ der alle unsere früheren Autoren kontaktiert hatte, um zu versuchen, einen Backlink im Blog einzukaufen bzw. einzuschleichen.Hier hat sich Tim berechtigterweise über ihn lustig gemacht:Ich glaube nicht, dass wir danach nochmal von ihm gehört haben!Aber die Sache ist…Wenn er sich stattdessen einfach die Zeit genommen hätte einen hochwertigen, qualitativen Gastartikel zu verfassen, dann hätten wir ihn vermutlich akzeptiert. Er hätte dann einen kostenfreien Link abgreifen können!Links von Bloggern kaufenDas ist es von dem ich glaube, dass das als der meiste Linkkauf und Verkauf im Jahr 2018 stattfindet.Es geht dabei um private Linkkäufe von Bloggern.Ich habe einige Blogs und ich bekomme solche Anfragen die ganze Zeit.(Ich verkaufe übrigens keine Links!)Es ist jedoch nicht immer ein monetärer Austausch.Manchmal ist es mehr wie eine Bestechung, bei der ein Produkt angeboten wird im Austausch für eine “ehrliche” Bewertung auf der Seite des Bloggers.Es muss nicht erwähnt werden, dass die Bewertung einen natürlich aussehenden Link im Inhalt enthalten wird.Das ist üblicherweise die unausgesprochene Vereinbarung zwischen Blogger und Linkbuilder.Die Sache ist die, dass diese Links (gekauft oder durch Bestechung zustande gekommen) ziemlich schwierig zu entdecken sind.Wie kann man festmachen, ob für einen Link aus dem Inhaltsbereich eines Beitrags bezahlt wurde?Die Antwort ist: Das kann man nicht.Um es rund zu machen, hast du jemals eine E‑Mail verschickt und eine Antwort wie diese erhalten?Ich sehe es mehr und mehr (Hinweis: Lies weiterhin die Studie hierzu!)Viele Blogger sind sich mehr und mehr dem Wert eines Backlinks bewusst und fragen nun offen nach Bezahlung.Was irgendwie nervt.Aber so ist wohl das Geschäft.Also, wie viele private Linkkäufe und Verkäufe gibt es? Und wie hoch ist der durchschnittliche Preis eines Links?Lass es uns herausfinden.Wie viel Prozent der Blogs verkaufen 2018 Links? (Und wie verhält sich das zu 2016?)Für diese Studie habe ich 450 Seiten in 9 umkämpften Branchen (also 50 Seiten in jeder davon) befragt.Hier sind die Branchen:ReisenModeFitnessFinanzenHochzeitenFotografieEssenErziehungMarketingUnd hier ist die E‑Mail, die ich verschickt hatte:Wie du sehen kannst, wurde nicht um den heißen Brei geredet. Ich kam direkt zum Punkt.Ich wollte einen Link auf ihrer Seite kaufen und ich wollte wissen, was es kostet.Nebenbei bemerkt. Wir führten dieselbe Studie bereits 2016 durch, nur mit weniger Seiten in weniger Branchen (250 Seiten in 5 Branchen: Reisen, Mode, Fitness, Finanzen, Hochzeiten). Ich benutzte dieses Jahr exakt dasselbe E‑Mail-Anfrage-Template, wie wir es 2016 benutzt haben. Ich habe unten einen Vergleich der Ergebnisse beider Studien eingefügt.Hier sind die Ergebnisse:Gesamtzahl von Blogs, die Links verkaufenLass uns zunächst einen Blick auf die Gesamtmengen werfen:Verkaufen Links: 54Verkaufen keine Links: 38Keine Antwort: 338Absprünge: 20Folgendermaßen lassen sich diese Zahlen mit 2016 vergleichen:Wie du in der Grafik oben sehen kannst, haben nur 12,6% der Seiten die ich angefragt habe, zugestimmt mir einen Link zu verkaufen, verglichen mit 18,4% im Jahr 2016.Das ist dennoch eine recht hohe Trefferquote.Nebenbei bemerkt. Ich werde keine der Seiten, die Links verkaufen, “outen”. Das war nicht Ziel dieser Studie.Wie du jedoch gleich sehen wirst, sind die Daten durch eine Branche etwas verzerrt.Gesamtzahl der Blogs, die Links verkaufen nach BrancheLass es uns nun pro Branche herunterbrechen.Reisen: 22Fitness: 7Mode: 0Finanzen: 3Hochzeiten: 2Fotografie: 7Essen: 3Erziehung: 7Marketing: 3Hier ist noch einmal wie sich dies mit 2016 vergleichen lässt:Wie du sehen kannst, war die Reisebranche jene, die weit am meisten Links verkauft.Schlagende 44% der Seiten die ich kontaktiert hatte, stimmten zu mir einen Link zu verkaufen.2016 haben wir ebenfalls einen ähnlichen Trend festgestellt.Nebenbei bemerkt. 6 der Seiten haben angegegeben, dass der Link “nofollow” wäre. Das ergibt Sinn, wenn man sich den Wert der Reiseindustrie vor Augen führt.Es legt außerdem Nahe, dass ein großer Prozentsatz der kommerziellen Reiseseiten Links kaufen (Angebot und Nachfrage).Lass uns nun einen Blick auf die tatsächlichen Kosten vom Kaufen von Links werfen.Was kostet es 2018 geradeheraus einen Link zu kaufen?Es gab eine große Varianz bei den Preisen von Linkkäufen.Das günstigste Angebot war $50. Dieser Link stammte von einem Erziehungsblog mit einem Domain Rating (DR) von 46.Der teuerste Link war £2,500 ($3,312) pro Jahr. Dieser kam von einem DR53 Reiseblog.Über alle 54 Seiten hinweg war der Preis eines Linkkaufs durchschnittlich bei $361.44.Für alle für euch die darauf achten, das ist eine Zunahme von 2,4% ($8,51) des Durchschnitts von 2016.Nebenbei bemerkt. Das ist so ziemlich in Übereinstimmung mit der US inflation, die bei ca. 2% durschnittlich liegt, seit wir unsere ursprüngliche Studie veröffentlicht haben. @ahrefs finds the average cost of buying a backlink is $361.44 (study of 450 blogs) Click to tweet Wenn ich also einen Link auf jeder Seite kaufen wollen würde, dann würde es mich insgesamt $19,518 kosten!Hier ist heruntergebrochen, was mir das in Sachen Metriken bringen würde:Das ist eine recht starke Auswahl von Links.Ich schätze, das würde definitiv etwas bewirken.Nebenbei bemerkt. Ich habe nicht ausgeglichen nach Domain Rating verteilt Seiten angefragt, deshalb sollte dies nicht als Indikation, dass Seiten mit DR 50–59 wahrscheinlicher Links verkaufen, herangezogen werden. Ich habe Listen von “Top Blogs” in den Branchen benutzt um Seiten auszuwählen.Doch hier ist eine weitere Frage: Erhöhen sich die durchschnittlichen Kosten eines Links übereinstimmend mit DR?Ja, dem ist so.Also, das sind die Preise wie viel Links kosten wenn du tatsächlich danach fragst einen zu kaufen.Doch was ist wenn du das nicht tust?Wie viele Blogger lassen sich für Gastartikel 2018 bezahlen? (Und wie viel verlangen sie?)Hast du jemals eine Idee für einen Gastartikel gepitcht und eine Antwort wie folgende erhalten?…Ich weiß, dass ich das habe. Es passiert die ganze Zeit.Also habe ich gedacht es wäre interessant, eine weitere Studie durchzuführen, um folgendes herauszufinden:Wie häufig das tatsächlich vorkommt;Wie viel diese Gastartikel tatsächlich kosten.Folgendes habe ich getan:Ich habe 180 Blogs über dieselben 9 Branchen angefragt (20 per Branche) mit folgender E‑Mail:Wie du sehen kannst, habe ich das Thema Bezahlung in keiner Weise in der E‑Mail selbst erwähnt.Nebenbei bemerkt. Ich habe nur bei Blogs gepitcht, die offen Gastartikel akzeptieren (und danach suchen). Das bedeutet, sie hatten eine “Schreibe für uns”-Seite oder etwas ähnliches. Hier sind die Ergebnisse:Gesamtzahl von Blogs, die für Gastartikel bezahlt werden wollenLass uns zunächst die Gesamtstatistiken anschauen:Haben nicht nach Geld gefragt: 22Haben nach Geld gefragt: 24Keine Antwort: 134Über die Hälfte (52%) der Antworten enthielten Fragen nach Geld!Ich weiß nicht wie es dir dabei geht, aber ich empfand die Zahl als überraschend hoch.Doch was ist, wenn man es nach Branche herunterbricht?Gesamtzahl von Blogs, die für Gastartikel bezahlt werden wollen nach BrancheHier sind die Ergebnisse:Finanzblogs sind hier an der Spitze, mit 31% der Blogger (heißt beinahe 1 von 3), die nach Geld im Austausch für einen Gastartikel gefragt haben.Reise‑, Mode- und Fotografie-Blogs waren nicht weit dahinter mit 20% (heißt 1 von 5).Aber es gab einen Ausreißer: Marketingblogs.Keiner von ihnen fragte nach irgendeiner Gebühr im Austausch für einen Gastartikel.Ich denke, das spricht Bände.Marketer sind hier allgemein den anderen etwas voraus.Sie wissen, dass das Verkaufen von Gastartikellinks gegen Googles Qualitätsrichtlinien ist, wie dieser nun berüchtigte Artikel von Matt Cutts aus 2014 hervorhebt.Und sie sind nicht bereit das Risiko für ihre Seiten zu tragen.Wie hoch sind die Kosten einen Gastartikel im Jahr 2018 zu kaufen?Wie gesagt, es gab eine große Varianz bei den Gebühren, die von Bloggern aufgerufen wurden.Das günstigste Angebot war $15, welches von dem Blogger als eine “Uploadgebühr” bezeichnet wurde.Diese Antwort kam von einem Fotografieblog mit einem Domain Rating (DR) von 40.Das teuerste Angebot war $300. Es kam von einem DR57 Hochzeitsblog.Über alle 24 Seiten war der durchschnittliche Preis um einen Gastartikel zu veröffentlichen $77.80.Wenn ich also einen Gastartikel auf jeder Seite veröffentlichen wollen würde, dann würde mich das insgesamt $1,867.20 kosten!Hier ist heruntergebrochen, was das an Metriken bedeuten würde:Das ist keine schlechte Auswahl an Links, besonders wenn man die Kosten berücksichtigt! (jeweils durchschnittlich $77.80)Wenn wir die Kosten von Linkkäufen über Gastartikel mit dem Kaufen von Links über direkte Anfragen vergleichen, dann ist es ungefähr ⅕ (21,5%) der Kosten.Doch bedenke, du wirst Inhalte benötigen um Links mit Gastartikeln erlangen zu können, was die Kosten erhöhen wird… eine Menge.Die Wahrheit über bezahlte Links: Warum du dein Geld wahrscheinlich woanders ausgeben solltestLinks zu Kaufen ist definitiv eine attraktive Aussicht.Du gibst $XXX aus und du bekommst was du möchtest—einen Link.Du musst keine Stunden Arbeit investieren, um aussichtsreiche Linkmöglichkeiten zu recherchieren.Oder “personalisierte” Anfrage-E-Mails zu erstellen.Oder mit dem unvermeidbaren Gefühl der Abweisung umzugehen, wenn die meisten Menschen niemals antworten.Nein. Es ist ein einfacher Werteaustausch—eine Seltenheit in der düsteren Welt des Linkaufbaus.Doch leider gibt es zwei große Gründe warum das Kaufen von Links nicht die beste Idee ist:1. Du kannst Links für effektiv viel, viel weniger kaufen$361,44 ist nicht günstig.Und denke daran, die meisten Webseiten werden nicht mit einem einzelnen Link ranken.Das verbrennt ziemlich schnell Geld.Doch die Sache ist die: Auf eine Art ist jeder Link ein bezahlter Link, selbst solche die von “natürlichen” Anfragen stammen.Weshalb? Weil das Anfragen Zeit benötigt. Und Zeit = Geld.Mit anderen Worten, du könntest einem Blogger $360+ schicken und es damit erledigt haben (heißt einen Link geradeheraus gekauft zu haben). Oder du könntest Zeit und Aufwand investieren, eine Beziehung mit Bloggern aufzubauen und versuchen einen Link “natürlich” zu erhalten..So oder so, es kostet immer noch Geld weil deine Zeit (oder die Zeit der Person, die du beauftragt hast Links aufzubauen) ist nicht umsonst.Lass uns die Daten anschauen…Es kostet durschnittlich $360+ um einen Link geradeheraus zu kaufen.Das ist definitiv eine Option.Aber lass uns sagen, du hast jemanden bezahlt für $50/Stunde um Links für dich via Anfragen aufzubauen.Wenn er nur 1 Link alle 7 Stunden aufbaut (im Durchschnitt), dann würde das immer noch günstiger sein als Links geradeheraus zu kaufen.Selbst der schlechteste Linkbuilder könnte das sicher hinbekommen.2. Bezahlte Links können von sehr schlechter Qualität seinLass uns sagen ein Blogger akzeptiert dir einen Link zu verkaufen.Denkst du, dass du der einzige bist?Oder denkst du, dass er auch Links an andere Linkbuilder verkauft.Die meiste Zeit wird es letzteres sein.Hier ist warum das nicht gut ist:Wenn eine Seite Links nicht nach Verdienst sondern einfach nach harten, monetären Gesichtspunkten setzt, dann wird sie wahrscheinlich darin enden, vielen zusammenhanglosen Müll zu verlinken.Das bringt deinen Link in eine fragwürdige “Linknachbarschaft”.Für Laien ausgedrückt, ist das äquivalent dazu, mit schlechten Einflüssen rumzuhängen (heißt die Menschen, über die deine Mutter immer sagte, du sollst nicht mit ihnen sprechen). Du wirst zur selben fragwürdigen Menge gezählt durch die Kraft der Assoziation.Doch die Frage ist die: Kann Google das algorithmisch erkennen?Niemand weiß das sicher. Aber durch den Fakt, dass Google nun eine Weltmeister schlagende AI-Technologie hat und Roboter die Backflips machen können, würde ich sagen es ist ziemlich wahrscheinlich.Und wenn sie das können, dann würde ich Geld darauf wetten, dass sie ihre Ressourcen dafür nutzen, um jeden zu erkennen und zu bestrafen, der Links kauft. Oder zumindest sie abzuwerten (und sie deshalb wertlos zu machen).SchlussgedankenEs scheint, dass die Linkkauf- und Verkaufindustrie im Jahr 2018 am Leben und bester Gesundheit ist.Ich werde es dir überlassen zu entscheiden, ob $361,44 (oder $77,80…zuzüglich der Inhalte) folgendes ist:das Geld wert;Das Risiko wert erwischt zu werdenWenn du unseren Rat möchtest, dann ist es selten das Geld wert Links zu kaufen.Weshalb? Weil es risikobehafteter und teurer ist, als “natürliche” Links aufzubauen (in den meisten Fällen).Wenn du jedoch vorhast für Links zu bezahlen, dann sieht es so aus, als würde das Kaufen von Gastartikeln dir den meisten Wert für die Kosten liefern.Übersetzt von: Sebastian Simon. Sebastian Simon beschäftigt sich seit 2009 mit SEO, aktuell tut er das bei seven-bytes.de und heine.de. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Joshua Hardwick Head of Content @ Ahrefs (oder, in einfachen Worten, ich bin der Typ, der dafür sorgt, dass jeder Blog-Post EPISCH wird).",
  "headers": [
    {
      "level": "H1",
      "text": "Was kostet das Kaufen von Links? Ich habe 630 Blogs angefragt um es herauszufinden"
    },
    {
      "level": "H2",
      "text": "Die Linkkauf- und Verkaufsindustrie: Eine kurze Geschichte"
    },
    {
      "level": "H3",
      "text": "Früher Linkkauf: Webverzeichnisse (Mitte der 1990er—2000er)"
    },
    {
      "level": "H3",
      "text": "Der Linkkauf-Boom (Mitte der 2000er, fortlaufend)"
    },
    {
      "level": "H3",
      "text": "Google zwingt Linkverkäufer in den Untergrund (Späte 2000er, fortlaufend)"
    },
    {
      "level": "H2",
      "text": "Linkkauf/Verkauf im Jahr 2018 (und darüber hinaus)"
    },
    {
      "level": "H3",
      "text": "Bezahlte Gastartikel (z.B. “Gesponserte” Artikel)"
    },
    {
      "level": "H3",
      "text": "Links von Bloggern kaufen"
    },
    {
      "level": "H2",
      "text": "Wie viel Prozent der Blogs verkaufen 2018 Links? (Und wie verhält sich das zu 2016?)"
    },
    {
      "level": "H3",
      "text": "Gesamtzahl von Blogs, die Links verkaufen"
    },
    {
      "level": "H3",
      "text": "Gesamtzahl der Blogs, die Links verkaufen nach Branche"
    },
    {
      "level": "H2",
      "text": "Was kostet es 2018 geradeheraus einen Link zu kaufen?"
    },
    {
      "level": "H2",
      "text": "Wie viele Blogger lassen sich für Gastartikel 2018 bezahlen? (Und wie viel verlangen sie?)"
    },
    {
      "level": "H3",
      "text": "Gesamtzahl von Blogs, die für Gastartikel bezahlt werden wollen"
    },
    {
      "level": "H3",
      "text": "Gesamtzahl von Blogs, die für Gastartikel bezahlt werden wollen nach Branche"
    },
    {
      "level": "H2",
      "text": "Wie hoch sind die Kosten einen Gastartikel im Jahr 2018 zu kaufen?"
    },
    {
      "level": "H2",
      "text": "Die Wahrheit über bezahlte Links: Warum du dein Geld wahrscheinlich woanders ausgeben solltest"
    },
    {
      "level": "H3",
      "text": "1. Du kannst Links für effektiv viel, viel weniger kaufen"
    },
    {
      "level": "H3",
      "text": "2. Bezahlte Links können von sehr schlechter Qualität sein"
    },
    {
      "level": "H2",
      "text": "Schlussgedanken"
    }
  ],
  "author": "Joshua Hardwick"
}