{
  "url": "https://ahrefs.com/blog/de/beste-marketing-newsletter/",
  "slug": "beste-marketing-newsletter",
  "title": "Die 7 besten Marketing-Newsletter (mit den meisten Stimmen)",
  "description": "Wir haben über 20.000 Marketer gebeten, für ihre Lieblings-Marketing-Newsletter zu stimmen. Hier sind die Newsletter mit den meisten Stimmen.",
  "content": "Si Quan Ong Marketing @ Ahrefs. Ich lese, mache Breakdance und versuche zufäliige Lebensexperimente. Article PerformanceData from AhrefsVerlinkung von Websites 2 Sign up for AhrefsGet SEO metrics of any website or URL.The number of websites linking to this post.This post's estimated monthly organic search traffic. Inhalt Newsletter sind wieder angesagt.Die Medien haben es die “Substack-Revolution” genannt. Journalisten, Risikokapitalgeber, Marketer — es scheint, als würde heutzutage jeder einen Newsletter machen.Doch mit der steigenden Anzahl an Newslettern wächst auch die Auswahl, was es schwieriger macht als jemals zuvor, den Überblick zu behalten und die Newsletter zu finden, die es wert sind, im eigenen Posteingang zu landen.Deshalb haben wir die 13.900 Mitglieder von Ahrefs Insider, unserer Facebook-Gruppe nur für Kunden, gebeten, für ihre Lieblings-Newsletter zu stimmen. Wir haben auch unsere Follower auf LinkedIn und Twitter befragt, sowie einige andere Marketing-Facebook-Gruppen.Das sind die Ergebnisse: Harry’s Marketing ExamplesSEO Notebook#SEOFOMOThe Weekly SEOSearch News You Can Usetl;dr MarketingGrowth Memo1. Harry’s Marketing ExamplesThemen: Marketing, CopywritingInhaber: Harry DryAnmeldung auf: WebsiteErscheinungsweise: zweiwöchentlichIn nur etwas mehr als einem Jahr hat Harry Dry ~50.000 Abonnenten für seinen Marketing-Newsletter gewonnen.Es gab keine besonderen Tricks. Alles, was er tat, war, immer und immer wieder einen Mehrwert zu bieten. Er präsentiert alle Arten von Marketing-Fallstudien, von denen man lernen kann. Große Brands, politische Entscheidungsträger, Football-Manager, Musiker — wenn man von ihnen etwas über Marketing, Copywriting oder Kommunikation lernen kann, stellt er sie vor.Von der Positionierung bis zum Werbetext — er füllt jede E‑Mail mit Tipps, die du sofort anwenden kannst. Und es handelt sich nicht um irgendwelche herkömmlichen E‑Mails. Seine E‑Mails sind schön gestaltet.Harry hat die perfekte Balance zwischen prägnanten Texten, einem ansprechenden Design und wertvollem Content gefunden.2. SEO NotebookThemen: SEO, Affiliate MarketingInhaber: Steve TothAnmeldung auf: WebsiteErscheinungsweise: wöchentlichBist du es leid, ständig dieselben, neu aufbereiteten SEO-Ratschläge zu lesen? Dann ist dieser Newsletter genau der Richtige für dich.Jede Woche verschickt Steve eine E‑Mail mit einer Notiz aus seiner Evernote-Sammlung. Sie ist gefüllt mit einzigartigen SEO-Ideen, die dir wahrscheinlich noch nie irgendwo anders untergekommen sind. Es sind Ideen, die er sich bei seiner Arbeit in den SEO-Baugruben hart erarbeitet hat oder die ihm von Underground-SEOs zugeflüstert wurden, die ihre Namen lieber nicht bekannt geben möchten.3. #SEOFOMOThemen: Suchmaschinen-Neuigkeiten, SEO, Digital Marketing, Marketing-JobsInhaber: Aleyda Solis Anmeldung auf: WebsiteErscheinungsweise: wöchentlichDer Newsletter von Aleyda ist einer der längsten, den ich in meinem Posteingang habe, aber er wird seinem Namen wirklich gerecht. Wenn du schon einmal befürchtet hast, wichtige Neuigkeiten oder Inhalte zu verpassen, dann bist du bei ihr an der richtigen Adresse.Nimm dir einen Kaffee (oder vielleicht zwei), scrolle durch, und du wirst über alles Bescheid wissen, was es in dieser Woche in Bezug auf SEO und Marketing zu wissen gibt. Du erhältst sogar eine Liste von Jobs, auf die du dich bewerben kannst und eine Liste von Marketingexperten, denen du auf Twitter folgen solltest.4. The Weekly SEOThemen: SEOInhaber: Andrew Charlton Anmeldung auf: WebsiteErscheinungsweise: WeeklyBei The Weekly SEO handelt es sich um einen klassischen kuratierten Newsletter. Er ist kurz und enthält Links zu Artikeln (und Produkten), die Andrew interessant fand.Immer wenn seine E‑Mails in meinem Posteingang landen, überfliege ich sie kurz und klicke auf diejenigen, die meine Aufmerksamkeit erlangen.5. Search News You Can UseThemen: SEOInhaber: Marie HaynesAnmeldung auf: WebsiteErscheinungsweise: wöchentlichDer Newsletter von Marie ist ein Favorit von vielen SEOs. Zu Beginn war es für Marie eine Möglichkeit, ihre Abonnenten über aktuelle Geschehnisse aus der Welt der Suche zu informieren und ein paar SEO-Tippszu geben. Inzwischen wurde der Newsletter um weitere Themenkategorien ergänzt, wie beispielsweise Jobs, Tipps und Leseempfehlungen. Außerdem gibt es zwei Preisstufen: eine kostenlose Light-Version und eine kostenpflichtige Version, in der auch die Gedanken von Marie und anderen Experten zu aktuellen Geschehnissen in der SEO-Welt preisgegeben werden.6. tl;dr MarketingThemen: Neuigkeiten aus dem Bereich Digital MarketingInhaber: Saijo GeorgeAnmeldung auf: WebsiteErscheinungsweise: täglichSaijo kuratiert und sendet seinen Abonnenten täglich wichtige Neuigkeiten aus dem Bereich Digital Marketing vom Vortag. Es ist eine großartige Möglichkeit zu sehen, was passiert, ohne zwischen verschiedenen Nachrichtenseiten wechseln zu müssen.Saijo kennzeichnet auch jede einzelne Nachricht auf seiner Website, wo du ganz leicht nach dem filtern kannst, was dich interessiert.7. Growth MemoThemen: SEO, Growth MarketingInhaber: Kevin IndigAnmeldung auf: WebsiteErscheinungsweise: wöchentlichGrowth Memo, ehemals bekannt als Tech Bound, ist ein wöchentlicher Newsletter, der von Kevin Indig, dem Director of SEO bei Shopify, verfasst wird. Der Newsletter begann als ein klassisch kuratierter Newsletter in seinen ersten Ausgaben. Später fügte Kevin seine eigenen Analysen zu verschiedenen Marketing- und Techniktrends hinzu.Er erkannte schnell, dass die Analyse den wertvollsten Teil seines Newsletters ausmachte und der Rest ist, wie man so schön sagt, Geschichte.Wenn du dich für den Newsletter von Growth Memo anmeldest, erhältst du eine E‑Mail, in der ein Teilaspekt des Growth Marketings vertieft wird. Kevin gibt später auch einige Links an, damit du das Thema weiter erkunden kannst, wenn du dich dafür interessierst. Fünf weitere Newsletter für MarketerWenn du nicht gerade Freude daran hast, deinen Posteingang mit Marketing-Newslettern überflutet zu sehen, sind die oben genannten Vorschläge wahrscheinlich ausreichend, um dich auf dem Laufenden zu halten. Doch die Teilnehmer unserer Umfrage haben auch für ein paar andere gestimmt. Die folgenden fünf Newsletter haben einige Stimmen erhalten. Marketing Brew. Marketing Brew ist die Marketing-News-Version von Morning Brew, dem beliebten Business-Newsletter. #SEOForLunch. Auch das ist ein klassischer kuratierter Newsletter. Wie der Name schon sagt, ist #SEOForLunch für SEOs gedacht, um in der Mittagspause interessante Artikel zu überfliegen. OkDork. Hierbei handelt es sich um den persönlichen Newsletter des bekannten Entrepreneurs Noah Kagan. Jede Woche erhältst du Links zu den von ihm erstellten Content sowie einige Empfehlungen für Produkte, Bücher, etc. Growth Tactics by Demand Curve. Der zweiwöchentlich erscheinende Newsletter “Growth Tactics” enthält fortschrittliche Marketing-Tipps von erfolgreichen YCombinator-Gründern und ‑Marketern. Zero to Marketing. Alle zwei Wochen wählt Andrea eine Website aus und gibt seine Ideen preis, wie er sie verbessern und ausbauen würde.FazitDu hast vermutlich bemerkt, dass sich viele SEO-bezogene Newsletter auf unserer Liste befinden. Das liegt wahrscheinlich an der Zielgruppe, die wir befragt haben.Trotzdem musst du natürlich nicht alle diese Newsletter abonnieren. Letztendlich kommt es auf die Ausführung an. Wenn du zu viele Newsletter liest, wirst du dich in einer “Analyse-Paralyse” wiederfinden. Besser ist es, nur die wenigen zu abonnieren, die du am interessantesten findest, um auf dem Laufenden zu bleiben und neue Marketing-Ideen zum Ausprobieren zu erhalten.Zu guter Letzt: Auch wir haben einen Newsletter. Jede Woche verschicken wir Links zu unseren neuen Blogbeiträgen und Videos sowie zu Artikeln, die wir interessant fanden. Du kannst ihn auf der rechten Seite (Desktop) oder weiter untenstehend (Mobile) abonnieren.Habe ich irgendwelche coolen Marketing-Newsletter ausgelassen? Lass es mich auf Twitter wissen. Article PerformanceData from AhrefsVerlinkung von Websites 2 Sign up for AhrefsGet SEO metrics of any website or URL.The number of websites linking to this post.This post's estimated monthly organic search traffic.Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Si Quan Ong Marketing @ Ahrefs. Ich lese, mache Breakdance und versuche zufäliige Lebensexperimente.",
  "headers": [
    {
      "level": "H1",
      "text": "Die 7 besten Marketing-Newsletter (mit den meisten Stimmen)"
    },
    {
      "level": "H2",
      "text": "1. Harry’s Marketing Examples"
    },
    {
      "level": "H2",
      "text": "2. SEO Notebook"
    },
    {
      "level": "H2",
      "text": "3. #SEOFOMO"
    },
    {
      "level": "H2",
      "text": "4. The Weekly SEO"
    },
    {
      "level": "H2",
      "text": "5. Search News You Can Use"
    },
    {
      "level": "H2",
      "text": "6. tl;dr Marketing"
    },
    {
      "level": "H2",
      "text": "7. Growth Memo"
    },
    {
      "level": "H2",
      "text": "Fünf weitere Newsletter für Marketer"
    },
    {
      "level": "H2",
      "text": "Fazit"
    }
  ],
  "author": "Si Quan Ong"
}