{
  "url": "https://ahrefs.com/blog/de/beste-marketing-communities/",
  "slug": "beste-marketing-communities",
  "title": "Die 7 besten Online-Marketing-Communities (kostenlos und kostenpflichtig), denen du 2022 beitreten solltest",
  "description": "Von Women in Tech SEO bis r/marketing, hier sind einige unserer Lieblings-Online-Marketing-Communities, die Wissen und Zusammenhalt vereinen.",
  "content": "Rebecca Liew Content Marketer und Autorin. Süchtig nach Worten, Briefpapier und dem Erkunden neuer Orte zu Fuß. Inhalt Online-Marketing-Communities sind hervorragende Orte, um neue Perspektiven zu gewinnen, am Puls der Zeit zu bleiben, von erfahrenen Marketern und Gründern zu lernen und sich mit Gleichgesinnten auszutauschen.Doch bei der Fülle an Gruppen, die es gibt, kann die Suche nach der richtigen Gruppe schwierig sein, wenn du neu in diesem Bereich bist. Um dir zu helfen, sind wir einigen beliebten Marketing-Communities beigetreten und haben uns unsere Favoriten herausgepickt.Hier sind die Favoriten, in beliebiger Reihenfolge:Demand CurveSwipe FilesWomen in Tech SEO (WTS)r/marketingThe Marketing Meetup (TMM)Dave Gerhardt Marketing Group (DGMG) Superpath1. Demand CurveCommunity-Art: Slack communityFür wen ist sie gedacht? Erfahrene Growth Marketer, Startup-Gründer, BeraterPreis: Kostenlos (Bewirb dich um eine Einladung)Anmelde-Link: https://www.demandcurve.comMitgliederzahl: ~3k (kostenlose Community); >30k (Newsletter + Marketingkurs) Demand Curve ist ein von Y Combinator finanziertes Unternehmen, das Startups mit seinem zweiwöchentlichen Newsletter, seinen Playbooks und Programmen unterstützt. Die kostenlose private Slack-Gruppe besteht hauptsächlich aus erfahrenen Marketern, von denen viele Gründer oder Growth Leader von Tech-Unternehmen wie Microsoft und Zendesk sind. Die Köpfe hinter Demand Curve sind selbst Experten: Der Gründer Julian Shapiro ist ein aktiver Business Angel, über dessen Open-Source-Arbeit in Forbes berichtet wurde, während die Mitgründer Justin Setzer und Neal O’Grady zuvor Growth-Positionen bei Grammarly bzw. der Kundendatenplattform Segment innehatten. Innerhalb der Community gibt es 17 Kanäle, die sich mit Themen wie #analytics-and-data, #b2b, #product-and-marketing und #fb-ig-ads beschäftigen. Der gut organisierte Bereich macht es einfacher, nach Informationen zu suchen oder Hilfe von den richtigen Leuten zu bekommen. Obwohl die Diskussionen ziemlich fachlastig werden können, sind die Antworten oft zeitnah und aufschlussreich. So findest du zum Beispiel Fragen zu Influencer-Marketing-Taktiken unter #ecom-and-influencers und Diskussionen über E‑Mail-Newsletter-Sponsoring unter #growth-strategy.2. Swipe Files Community-Art: Circle, eine Community-PlattformFür wen ist sie gedacht?B2B-Vermarkter und UnternehmerPreis: ab 99 US$/Jahr für den Zugang zur privaten Community (inkl. 7‑tägiger kostenloser Testphase)Anmeld-Link: https://www.swipefiles.com/membershipMitgliederzahl: >500 (bezahlt); >6.3k (kostenloser Newsletter)Gegründet von Corey Haines — einem Marketer und Podcaster, der früher die Growth-Abteilung bei Baremetrics leitete — konzentriert sich Swipe Files vor allem auf Marketing, Wachstum und den Aufbau von Zuhörern, mit dem Ziel, Freundschaften zu schließen, nicht Leads. Einen Vorgeschmack auf das, was dich erwartet, bekommst du mit dem kostenlosen wöchentlichen Newsletter oder mit der 7‑Tage-Testversion, die dir kostenlosen Zugang zur privaten Community verschafft. Die Diskussionen sind in 11 Kanäle aufgeteilt, darunter Allgemein, Lernen, Gewinne, Anfragen, Herausforderungen und Auftritte.Mir gefällt besonders, wie freundlich die Community ist: Haines heißt neue Mitglieder persönlich willkommen und beteiligt sich aktiv an den Diskussionen in allen Kanälen, während die Mitglieder vor allem SaaS-bezogene oder B2B-Marketing-Themen diskutieren. Auch im Kanal “Not Marketing” finden freie Unterhaltungen statt. Abgesehen von der Community solltest du unbedingt die Marketing-Ressourcen auf der Hauptwebsite nutzen, die eine Master-Swipe-Datei mit über 1.000 Ideen für Marketer enthält, von denen du dir Anregungen und Tipps holen kannst. 3. Women in Tech SEO (WTS)Community-Art: Facebook-Gruppe und Slack-CommunityFür wen ist sie gedacht? Frauen im Bereich der technischen SEOPreis: KostenlosAnmelde-Link: Facebook, SlackMitgliederzahl: >2.7k (Facebook); >1.7k (Slack)Online-Communities nur für Frauen sind heutzutage nicht gerade Neuland, aber in der Marketingwelt schon. Areej AbuAliwollte diese Lücke schnell schließen, als sie 2019 Women in Tech SEO (WTS) gründete. Wie der Name schon sagt, will WTS Frauen in der technischen SEO-Branche dazu ermutigen, sich gegenseitig zu helfen, unabhängig von ihrem Karriere-Level. Die offizielle Website bietet ihren Followern eine Reihe von Ressourcen, darunter Blogbeiträge, Podcasts und wöchentliche Interviews mit Frauen aus der Branche. Wer noch mehr Unterstützung braucht, sollte die Facebook-Gruppe oder die Slack-Community besuchen.Letztere umfasst 24 Kanäle, in denen die Mitglieder Antworten auf spezifische Fragen zu Themen wie #content-seo, #analytics, #technical-seo, #schema und #cms finden. Was mir gefällt, ist der Enthusiasmus, mit dem die Community ihr Wissen austauscht und ihre Unterstützung durch Emoji-Reaktionen zeigt. Die Threads, die am meisten Aufmerksamkeit erregen, stammen oft von Gründerin AbuAli, die wöchentlich Ankündigungen und Updates zu den WTSWorkshops postet.Auf Facebook kannst du mit bis zu fünf Beiträgen pro Tag rechnen. Die Diskussionen drehen sich um SEO-Strategien, grundlegende SEO-Taktiken und technische Themen wie hreflang tags oder Google Search Console.Außerdem findest du dort gelegentlich Stellenausschreibungen und Erfolgsgeschichten, und soweit ich weiß, ist die Community sehr hilfsbereit und unterstützt dich. Das ist in unseren Augen ein Pluspunkt. 4. r/marketingCommunity-Art: SubredditFür wen ist es gedacht? Alle, die sich für Marketing und Werbung interessieren Preis: KostenlosAnmelde-Link: https://www.reddit.com/r/marketing/Mitgliederzahl: >365kWenn ich mir eine Community aussuchen könnte, der man unbedingt beitreten sollte, um aktuelle, nützliche und grundlegende Marketing-Tipps zu erhalten, dann wäre es dieses Subreddit. Anders als bei den meisten Gruppen ist ein Reddit-Account die einzige Voraussetzung, um der Community beizutreten. Das macht sie zu einer leichter zugänglichen Plattform, um Ideen mit Fachleuten auszutauschen oder Karriere-Ratschläge einzuholen, wie man als Marketer erfolgreich ist. Mit über 360.000 Mitgliedern — darunter Geschäftsinhaber, Agenturmitarbeiter und angehende oder erfahrene Marketer — gibt es eine Menge zu lernen. Denn die Themen, die diskutiert werden, sind breit gefächert und das Engagement der Community ist hoch. Auch wenn die Inhalte zugegebenermaßen nicht so gut moderiert sind, findest du schnell Antworten auf Fragen zu SEO, Content und Brand Marketing, Medienplanung und UX/UI — um nur einige zu nennen. Außerdem gibt es eine Reihe von Ressourcen, die du dir ansehen solltest und die auf ihrem Content-Board zu finden sind. Und wenn du nach einer ähnlichen Community suchst, die ein bisschen mehr Nischencharakter hat, dann schau dir diese an: r/socialmedia(>179k Mitglieder) r/SEO (>174k Mitglieder) r/digital_marketing (>141k Mitglieder) r/content_marketing(>89k Mitglieder) r/BigSEO (>81k Mitglieder) r/AskMarketing(>35k Mitglieder)5. The Marketing Meetup (TMM)Community-Art: Facebook-GruppeFür wen ist es gedacht? Marketer, Freiberufler und UnternehmerPreis: KostenlosAnmelde-Link: https://www.facebook.com/groups/themarketingmeetup/Mitgliederzahl: >2.7kEine Kantine in Cambridge, England, und ein selbsternannter “nervöser Networker”: Das waren die Zutaten, die 2016 zur Gründung von The Marketing Meetup (TMM) führten, als der Gründer Joe Glover eine lockere Veranstaltung mit einem gemeinsamen Essen organisierte. Was als Marketing-Treff begann, hat sich heute zu einer Community mit fast 25.000 Mitgliedern entwickelt, die wöchentliche Online-Events mit Persönlichkeiten wie Catherine Newman, Chief Marketing Officer bei Manchester United, und Harry Dry, dem Kopf hinter dem Newsletter-Favoriten Marketing Examples, besuchen.Für intimere Diskussionen über alles, was mit Marketing zu tun hat, kannst du die Facebook-Community besuchen: Hier tauschen sich Anfänger und erfahrene Marketer über Tools, Karrierewege und Themen wie Content-Marketing, Markenstrategie, E‑Mail-Marketing und Unternehmensentwicklung aus. Ein Bonus: eine monatliche Jobbörse für Mitglieder, die einstellen oder eingestellt werden möchten:Mir gefällt auch, dass TMM Positivität betont und fördert — etwas, das die Mitglieder respektieren und einhalten, wie ich festgestellt habe. 6. Dave Gerhardt Marketing Group (DGMG)Community-Art: Facebook-GruppeFür wen ist sie gedacht? B2B-VermarkterPreis: 10 US$/Monat; jederzeit kündbar (Sobald die Zahlung erfolgt ist, erhältst du eine Einladung per E‑Mail, um der privaten Gruppe beizutreten)Anmelde-Link: https://dgmg.davegerhardt.com/offers/gQBScr7j/checkoutMitgliederzahl: >2.6kDave Gerhardt ist so etwas wie ein Mikro-Influencer in der Marketing-Branche, und das aus gutem Grund: Seit der Gründung von Drift im Jahr 2015 war er für das Wachstum der Conversational Marketing Plattform verantwortlich, danach leitete er das Marketing des SaaS Tools Privy und kehrte dann als Chief Branding Officer zu Drift zurück.Da liegt es nahe, dass der erfahrene Marketer noch einen Schritt weiter geht und aus seinem Namen eine Marke macht.Die DGMG-Facebook-Gruppe besteht aus einer kleinen, aber hilfsbereiten Community zahlender Abonnenten, von denen viele bei Slack, TikTok, HubSpot und anderen Unternehmen beschäftigt sind. Du kannst dich also auf gute Diskussionen und einen regen Austausch über Text- und Content-Strategie, Branding, soziale Medien, Design (UI/UX) und Empfehlungen für Jobs, Marketingbücher und Software freuen. Von Zeit zu Zeit mischt sich Gerhardt in diese Diskussionen ein oder gibt Marketingtipps: Eine neue Ergänzung der Community, die mir gefällt, sind die Live-Masterclasses, an denen Mitglieder teilnehmen können. 7. SuperpathCommunity-Art: Slack CommunityFür wen ist sie gedacht? Content-Marketer und GründerPreis: Kostenlos (Bewirb dich um eine Einladung)Anmelde-Link: https://airtable.com/shrKXm9xqoKfTq1kqMitgliederzahl: >3kDu weißt, dass du etwas Gutes gefunden hast, wenn eine Marketing-Community Mitglieder aus bekannten Tech-Unternehmen hat, darunter Shopify, Udemy, Intercom und HubSpot. Es ist auch kein Zufall, dass Superpath zweimal in einer Antwort auf den Tweet unseres CMO Tim über Empfehlungen für Marketing-Communities erwähnt wurde.Im Gegensatz zu den meisten Gruppen, die es auf diese Liste geschafft haben, konzentriert sich Superpath auf Content Marketing — ein Thema, in dem der Gründer Jimmy Daly durch seine jahrelange Erfahrung bei B2B-SaaS-Unternehmen seine Expertise verfeinert hat. Ich bin ein großer Fan von Gründern, die sich die Mühe machen, sich regelmäßig in die Community einzubringen, die sie aufgebaut haben. Und genau das tut Daly, indem er wöchentlich über seine Aktivitäten, interessante Diskussionen in der Community und Neuigkeiten bei Superpath berichtet.Die Mitglieder sind ebenfalls hilfsbereit und einladend, und viele von ihnen geben sowohl neuen als auch erfahrenen Marketern detailliertes Feedback. Die Community hat 20 Kanäle. Das mag übertrieben klingen, ist es in diesem Fall aber nicht, wenn man bedenkt, wie fachkundig die Diskussionen in Kanälen wie #seo-talk oder #b2b-content-chat sind. Weitere bemerkenswerte Kanäle sind #writing-feedback, #watercooler und #team-mgmt, in dem es um die Strukturierung von Teams und die Bindung von Talenten geht. FazitDies sind nicht die einzigen Marketing-Communities, die wir lieben. Wir haben noch weitere Favoriten, die wir nicht aufgeführt haben (darunter natürlich auch Ahrefs Insider!), weil wir sie bereits in diesen Beiträgen erwähnt haben: 11 Slack-Gruppen für SEOs und Digital MarketerDie 9 besten Marketing-Gruppen auf Facebook (um deine Fähigkeiten zu verbessern)Die 4 besten Facebook-Gruppen für SEOs (für die am häufigsten gestimmt wurde)Die richtige Community zu finden, braucht Zeit, also ist Geduld der Schlüssel. Tritt so vielen relevanten Gruppen wie möglich bei, sieh dir die Unterhaltungen an und stelle Fragen, um herauszufinden, was du von den diskutierten Themen hältst und wie tiefgründig die Inhalte sind. Vielleicht möchtest du sogar die Gründer über Twitter oder Facebook kontaktieren, um etwas über den Hintergrund der Community zu erfahren. Unvoreingenommenheit ist das A und O: Es gibt immer etwas zu lernen, selbst wenn du dich für einen erfahrenen Marketer hältst. Hast du Fragen? Schreib mir auf Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Rebecca Liew Content Marketer und Autorin. Süchtig nach Worten, Briefpapier und dem Erkunden neuer Orte zu Fuß.",
  "headers": [
    {
      "level": "H1",
      "text": "Die 7 besten Online-Marketing-Communities (kostenlos und kostenpflichtig), denen du 2022 beitreten solltest"
    },
    {
      "level": "H2",
      "text": "1. Demand Curve"
    },
    {
      "level": "H2",
      "text": "2. Swipe Files"
    },
    {
      "level": "H2",
      "text": "3. Women in Tech SEO (WTS)"
    },
    {
      "level": "H2",
      "text": "4. r/marketing"
    },
    {
      "level": "H2",
      "text": "5. The Marketing Meetup (TMM)"
    },
    {
      "level": "H2",
      "text": "6. Dave Gerhardt Marketing Group (DGMG)"
    },
    {
      "level": "H2",
      "text": "7. Superpath"
    },
    {
      "level": "H2",
      "text": "Fazit"
    }
  ],
  "author": "Rebecca Liew"
}