{
  "url": "https://ahrefs.com/blog/de/blog-seo/",
  "slug": "blog-seo",
  "title": "SEO für Blogs: Der komplette Leitfaden",
  "description": "Wir verwenden seit sechs Jahren dieselbe SEO-Strategie für Blogs. Diese hat uns geholfen, den Ahrefs-Blog von null auf über 600.000 monatliche Suchanfragen zu erweitern.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (oder, in einfachen Worten, ich bin der Typ, der dafür sorgt, dass jeder Blog-Post EPISCH wird). Inhalt Seit 2015 konnten wir den Ahrefs-Blog von Null auf über 600.000 monatliche Suchanfragen steigern.Was ist unser Geheimnis? Konsequenz.Wir setzen seit sechs Jahren auf die gleiche SEO-Strategie, und sie funktioniert gut.In diesem Leitfaden erfährst du:Was Blog-SEO istWarum Blog-SEO wichtig istWie man Blogbeiträge SEO-gerecht verfasstWie du deine Blogbeiträge für SEO optimierstWie du das Ranking deiner Blogbeiträge verbessern und erhalten kannstAber lass uns zuerst sicherstellen, dass wir dieselbe Wissensgrundlage haben. Was ist Blog-SEO?SEO für Blogs umfasst das Schreiben und Optimieren von Bloginhalten, um bei Suchmaschinen wie Google zu ranken. Zu den üblichen Aufgaben, die mit der SEO für Blogs verbunden sind, gehören die Keyword-Recherche, Content-Erstellung, On-Page SEO und Linkaufbau.Warum ist Blog-SEO wichtig?Obwohl es viele Möglichkeiten gibt, Traffic auf einen Blog zu erhalten, ist der Traffic über Suchmaschinen der stabilste und beständigste. Wenn du es schaffst, für die Keywords, nach denen die Leute suchen, zu ranken und diese Rankings beizubehalten, werden deine Beiträge beständig gezielten Traffic über Google generieren.Viele andere Traffic-Quellen neigen dazu, zu einem anfänglichen Anstieg des Traffics zu führen, der aber schnell von einem starken Rückgang gefolgt wird.Wie man Blogbeiträge SEO-gerecht verfasstEs ist wichtig zu verstehen, dass du nicht einfach irgendeinen alten Blogpost erstellen und erwarten kannst, dass dein Post tausende von Besuchen von Google anzieht. So funktioniert das nicht. Um die besten Chancen auf ein gutes Ranking zu haben, musst du recherchieren und deine Blogbeiträge für SEO optimieren.So gelingt das in fünf Schritten:Finde ein KeywordÜberprüfe die SuchintentionWähle ein erfolgreiches Format und inhaltlichen BlickwinkelErstelle eine datengestützte GliederungSchreibe den Beitrag1. Finde ein KeywordJeder Blogbeitrag, den du schreibst, sollte für ein Hauptkeyword optimiert sein. Dieses Keyword sollte etwas sein, wonach die Leute tatsächlich Monat für Monat suchen. Schließlich ist es unmöglich, Suchtraffic zu einem Blogpost zu bekommen, der ein Thema behandelt, nach dem niemand sucht.Wie kannst du Keywords finden? Benutze ein Keyword-Recherche-Tool wie den Keywords Explorer von Ahrefs.Gib ein paar allgemeine “Seed-Wörter” oder Phrasen ein, die mit dem Thema deines Blogs zu tun haben, und schau dir dann den Phrase Match Keyword Ideen Bericht an.Wenn du z.B. einen Food-Blog hast, könntest du “Seed”-Keywords verwenden wie:HuhnNudelnRezeptRezepteRippchenSteakDer Keywords Explorer findet über 14 Millionen Keywords, die eine oder mehrere dieser Phrasen enthalten. Allerdings wird es keinen Sinn machen, Blogbeiträge über all diese Phrasen zu schreiben. Du musst die Liste nach Themen durchforsten, die für dich Sinn machen.Zum Beispiel würde es für einen Food-Blogger absolut Sinn machen, einen Beitrag über “Chicken Tikka Masala” zu schreiben, aber nicht über “Chicken Pox”.Wenn dein Blog noch recht neu ist, solltest du den Keyword Difficulty (KD) Filter auf etwas Niedriges einstellen, um dich auf Ideen mit einem geringen Schwierigkeitsgrad zu konzentrieren.Empfohlene Lektüre: Wie man wettbewerbsarme Keywords für die SEO findet2. Überprüfe die SuchintentionBei Google hoch zu ranken, ist das Geheimnis, um beständigen Suchtraffic für deine Blogbeiträge zu erhalten. Doch solange die Leute nicht tatsächlich nach Blogbeiträgen suchen, wenn sie nach deinem Keyword suchen, sind deine Chancen auf ein Ranking gering bis gar nicht vorhanden.Deshalb ist es wichtig zu verstehen, ob die meisten Suchenden nach einem Blogpost oder nach etwas anderem suchen. Dies ist bekannt als das Einschätzen der Suchintention.Um dies zu tun, gib dein Keyword bei Google ein und sieh dir die Suchergebnisse an. Da der ganze Sinn von Google darin besteht, den Suchenden relevante Ergebnisse zu liefern, sind die Suchergebnisse eine gute Möglichkeit, die Suchintention zu identifizieren.Nehmen wir zum Beispiel ein Keyword wie “Nudelmaschine” (pasta maker). Du könntest annehmen, dass es keinen Sinn macht, einen Blogbeitrag darüber zu schreiben, weil die Leute zweifelsohne auf der Suche sind, Nudelmaschinen zu kaufen. Doch wenn du dir die Suchergebnisse ansiehst, sind die meisten davon Blogbeiträge, in denen die besten Nudelmaschinen vorgestellt werden.Empfohlene Lektüre: Anfängerleitfaden zum Thema Suchintention3. Wähle ein erfolgreiches Format und inhaltlichen BlickwinkelAuch wenn Suchende nach Blogposts suchen, kannst du nicht einfach irgendeinen alten Beitrag erstellen und damit als Top-Ergebnis ranken, denn Suchende suchen oft nach etwas Bestimmten. Du musst herausfinden, was das ist, um ein erfolgreiches Format und einen überzeugenden Blickwinkel für deinen Beitrag zu entwickeln.Das richtige Format wählenDie meisten Blogbeiträge werden in einem dieser Formate geschrieben:How-to-LeitfadenSchritt-für-Schritt-TutorialListenartikelMeinungsartikelRezensionVergleichWie kannst du wissen, nach welchem Format die Suchenden suchen? Achte auf das vorherrschende Format in den Suchergebnissen.Zum Beispiel sind die meisten Ergebnisse für “Abendessen-Ideen” (dinner ideas) Listenartikel:Doch die meisten Ergebnisse für “Rippchen auf dem Grill” sind Anleitungen:Ist alles immer so einfach und offensichtlich? Nein, natürlich nicht. Manchmal wird es einen ausgewogenen Mix aus mehreren Content-Formaten in den Ergebnissen geben, wie es bei “Rinderrippen” (beef ribs) der Fall ist.In diesen Fällen hast du ein paar Optionen:Orientiere dich an dem, was die Top-Ranking-Seite machtSuche nach einer Gemeinsamkeit unter den Top 2–3Stelle eine gelungene Vermutung anDen richtigen Blickwinkel wählenEs ist schwieriger, den Blickwinkel zu quantifizieren als das Format, aber er ist das wichtigste Verkaufsargument deines Contents.Woran erkennst du den besten Blickwinkel?Du hast es erraten: Schau dir die SERPs an.Personen, die zum Beispiel nach “Flanksteak” suchen, wollen eindeutig ein Rezept, das eine Marinade enthält. Wenn du ranken willst, lohnt es sich wahrscheinlich, den Leuten zu geben, was sie wollen, anstatt ihnen nur zu sagen, dass sie es mit Salz und Pfeffer würzen und in die Pfanne werfen sollen.Hier sind ein paar gängige Content-Blickwinkel, die in den Suchergebnissen zu finden sind:Persönliche Erfahrung → Die 21 besten Online-Marketing-Tools, die wir bei Ahrefs nutzen“Beste” → Die 6 besten Marketing-PodcastsExpertenmeinung → 33 Experten-gestützte Entrümpelungs-TippsFür Anfänger → 17 Blog-Tipps für AnfängerBestimmtes Ergebnis → 12 schnelle SEO-Tipps zur Steigerung des organischen TrafficsBewährt und erprobt → Die 26 besten kostenlosen Chrome-Erweiterungen für SEOs (bewährt & erprobt)Aktualität → Content Marketing: Ein umfassender Leitfaden für 2021Natürlich gibt es eine Menge SERPs, in denen du keinen bestimmten inhaltlichen Blickwinkel sehen wirst. In diesem Fall solltest du eine Vermutung anstellen.4. Erstelle eine datengestützte GliederungWenn du eine Vorstellung davon hast, was deine Blogbeiträge beinhalten sollen, wird es viel einfacher sein, sie zu schreiben. Auch wenn du eine Gliederung basierend auf deinem Bauchgefühl erstellen kannst, ist es immer besser, einen datengetriebenen Ansatz zu wählen, um zu verstehen, wonach die Nutzer von Suchmaschinen tatsächlich suchen.Lass uns ein paar Möglichkeiten betrachten, wie du das tun kannst.Suche nach gemeinsamen ZwischenüberschriftenZwischenüberschriften sind oft mit Unterthemen verknüpft. Wenn du gemeinsame Unterüberschriften in mehreren top rankenden Beiträgen für dein Keyword siehst, ist das wahrscheinlich etwas, das die Suchenden wissen wollen.Zum Beispiel haben drei der am besten rankenden Seiten für “Flanksteak” die Überschrift “Was ist Flanksteak?”.Es würde sich wahrscheinlich lohnen, einen ähnlichen Abschnitt in jeden Beitrag einzubauen, der auf dieses Keyword abzielt.Wenn du den Prozess des Betrachtens von Zwischenüberschriften beschleunigen willst, kannst du den kostenlosen On-Page-SEO-Bericht in der Ahrefs-SEO-Toolbar nutzen, um alle Zwischenüberschriften in einem Beitrag zu sehen. Suche nach gemeinsamen KeywordsDie meisten Seiten, die auf der ersten Seite von Google für ein Keyword ranken, ranken auch in den Top 10 für hunderte andere Keywords. Einige dieser Keywords beziehen sich auf Unterthemen, die du vielleicht in deinem Blogpost erwähnen möchtest. Wie kannst du diese Keywords finden?Gib einfach ein paar der am besten rankenden Seiten in das Content Gap Tool von Ahrefs ein, stelle den Modus auf URL und lasse das untere Feld leer.Klicke auf “Keywords anzeigen”, um alle Keywords zu sehen, für die eine oder mehrere dieser Seiten ranken.Da es hier oft eine Vielzahl von Keywords und Daten gibt, lohnt es sich, den Filter “Überschneidungen” zu verwenden, um Keywords zu finden, für die zwei oder mehr der Seiten ranken.In diesem Fall stellen viele der Keywords nur verschiedene Möglichkeiten dar, nach unserem Hauptkeyword zu suchen. Doch es gibt einige, die sich auf Unterthemen wie z.B. “Was ist Flanksteak”, “Flanksteak Marinade” und “Wie lange grillt man ein Flanksteak” beziehen.Überprüfe den “Also talk about”-BerichtGib dein Hauptkeyword in den Keywords Explorer von Ahrefs ein und überprüfe dann den “Also talk about”-Bericht, um häufig erwähnte Keywords auf den Top-Ranking-Seiten zu sehen.Wenn wir dies für “Flanksteak” tun, sehen wir Keywords wie:Carne Asadabrauner ZuckerRotweinSojasauceOlivenölDas verrät uns ziemlich genau, wonach die Suchenden wahrscheinlich suchen und gibt uns sogar ein paar Ideen für die Art der Marinade, die sie suchen.5. Schreibe den BeitragJetzt ist es endlich an der Zeit, deine Tastatur zu bedienen und einen ersten Entwurf zu verfassen. Die gute Nachricht: Da du bereits eine datenbasierte Gliederung erstellt hast, musst du dir keine Gedanken mehr über das Einstreuen von Keywords oder ähnliches machen. Schreibe einfach drauf los und fülle die Lücken.Wie du deine Blogbeiträge für SEO optimierstDer Großteil der schwierigen Optimierungsarbeit ist bereits getan, indem du deinen Blogpost auf die Suchintention ausrichtest und einen datengesteuerten Ansatz für den Content selbst wählst. Dennoch lohnt es sich, ein paar weitere Optimierungen vorzunehmen, um deinem Beitrag die besten Chancen auf ein gutes Ranking bei Google zu geben.Hier ist eine kurze SEO-Checkliste, die du für jeden deiner Beiträge befolgen kannst, um das i‑Tüpfelchen zu setzen:Füge dein Keyword in den Titel einHalte deinen Title-Tag kurzVerwende eine Evergreen-URLErstelle eine ansprechende Meta-BeschreibungOptimiere deine BilderFüge ein Inhaltsverzeichnis hinzu Füge ‘verlinkbare Snippets’ hinzuFüge Schema Markup hinzuFüge interne Links hinzuFüge dein Keyword in den Titel einDie meisten Blog-Plattformen wie WordPress betten deinen Seitentitel in eine H1-Überschrift ein, was wahrscheinlich der Grund ist, warum das Einfügen deines Keywords in den Titel zum SEO 101 gehört.Wenn du bereits einen unserer Beiträge gelesen hast, ist dir wahrscheinlich aufgefallen, dass wir das Keyword in den meisten Titeln einbauen.Wird das dein Ranking maßgeblich fördern oder verhindern?Definitiv nicht. Allerdings hilft jede kleine Maßnahme.Sei dir nur bewusst, dass es nicht immer sinnvoll ist, dein Keyword genauso zu verwenden, wie es in deinem Titel steht. Manchmal ist es besser, eine Variation davon zu verwenden, um die Lesbarkeit zu verbessern.Unser Keyword für diesen Beitrag ist zum Beispiel “Wie bekomme ich mehr Youtube-Abonnenten”, aber wir haben nicht genau diese Phrase im Titel verwendet, weil es sich um einen Listenartikel handelt.Halte deinen Title-Tag kurzTitle-Tags sind wichtig, weil sie in den Suchergebnissen auftauchen:Die meisten Blog-Plattformen wie WordPress setzen den Titel deines Beitrags als Title-Tag. Das ist normalerweise in Ordnung, aber wenn dein Titel besonders lang ist, könnte er in den Suchergebnissen abgeschnitten werden.Ist das immer eine schlechte Sache? Nicht wirklich, aber es ist oft ratsam, es im Voraus zu verhindern.Das kannst du tun, indem du eine kürzere Version deines Beitragstitels für den Title-Tag erstellst.Genau das haben wir mit diesem Beitrag gemacht:Nebenbei bemerkt. Wir verwenden Yoast SEO, um das in WordPress zu machen. Du könntest auch Rank Math, The SEO Framework oder ein anderes SEO-Plugin für WordPress verwenden. Wenn du eine andere Plattform wie Squarespace oder Wix verwendest, solltest du die Möglichkeit haben, die Titel-Tags direkt zu ändern. Empfohlene Lektüre: Wie man den perfekten SEO-Title-Tag erstelltVerwende eine Evergreen-URLHast du jemals ein Suchergebnis wie dieses gesehen?Der Titel gibt an, dass der Beitrag im Jahr 2021 veröffentlicht wurde, aber in der URL steht 2017. Was stimmt also?Wenn wir die URL in den Content Explorer von Ahrefs eingeben, erhalten wir unsere Antwort: Der Beitrag wurde ursprünglich 2017 veröffentlicht, aber 2021 aktualisiert.Da der Autor es verabsäumt hat, eine Evergreen-URL zu verwenden, als er den Beitrag ursprünglich veröffentlicht hat, sieht die aktualisierte Version alt aus, weil “2017” in der URL enthalten geblieben ist.Deshalb ist es wichtig, Evergreen-URLs zu verwenden, die nicht veralten. Am einfachsten ist es, den Slug deiner Post-URL auf dein Zielkeyword zu setzen. Das hat auch den zusätzlichen Vorteil, dass du deine URLs kurz und bündig hältst, damit sie in den SERPs nicht so stark gekürzt werden.Empfohlene Lektüre: Wie man SEO-freundliche URLs erstellt (Schritt-für-Schritt)Erstelle eine ansprechende Meta-BeschreibungMeta-Beschreibungen werden oft als beschreibendes Snippet in der SERP angezeigt.Indem du eine überzeugende Meta-Beschreibung erstellst, kannst du mehr Suchende dazu verleiten, in den Suchergebnissen auf deinen Blogbeitrag zu klicken. Das führt zu mehr organischem Traffic.Wie erstellst du eine überzeugende Meta-Beschreibung?Suche nach Gemeinsamkeiten in den Beschreibungs-Snippets der am besten rankenden Beiträge.Zum Beispiel handeln alle Ergebnisse für “Steak Tacos” von den am besten geeigneten Steakstücken für dieses Gericht, wobei Google sogar Begriffe wie “Flanksteak” und “Rindfleisch” hervorhebt. Das sind also Dinge, die du wahrscheinlich auch in deiner Meta-Beschreibung erwähnen solltest.Für “Flanksteak” sind alle Snippets Definitionen — diese solltest du hier also verfassen.Empfohlene Lektüre: Wie man die perfekte Meta-Beschreibung verfasstOptimiere deine BilderDu solltest deine Blogpost-Bilder für eine bessere Auffindbarkeit optimieren und um ihnen zu helfen, in Google Bilder zu ranken — was dir mehr Traffic bescheren kann.Hier siehst du zum Beispiel unseren Blog-Traffic von Google Bilder für die letzten 3 Monate:So optimierst du deine Bilder: Verwende beschreibende Dateinamen. Denke an cute-puppy.jpg, nicht an IMG_95742.jpg. Füge einen beschreibenden Alt-Text hinzu. Beschreibe deine Bilder mit ein paar Worten, um sehbehinderten Nutzern, die Screenreader verwenden, zu helfen. Komprimiere sie. Verwende dafür ein Plugin wie ShortPixel oder EWWW Image Optimizer.Empfohlene Lektüre: Bilder-SEO: 12 umsetzbare TippsFüge ein Inhaltsverzeichnis hinzuEin Inhaltsverzeichnis verlinkt auf wichtige Unterabschnitte deines Beitrags und hilft den Besuchern, die Informationen zu finden, nach denen sie suchen.Hier ist ein Beispiel aus diesem Beitrag:Unseres ist individuell programmiert, aber kostenlose Plugins wie Easy Table of Contents erleichtern das Hinzufügen eines Inhaltsverzeichnisses zu so gut wie jedem Beitrag.Neben den UX-Vorteilen kann ein Inhaltsverzeichnis auch dabei helfen, Sitelinks auf Beiträge in den SERPs zu erzeugen — was dir potenziell helfen kann, noch mehr organische Klicks zu gewinnen.Hier ist ein Beispiel aus unserem Leitfaden zum Thema 301-Weiterleitungen:Dies sind Abschnitte, die in unserem Inhaltsverzeichnis aufgeführt sind:Empfohlene Lektüre: Was sind Sitelinks? Wie du sie beeinflussen kannstFüge ‘verlinkbare Snippets’ hinzuVerlinkbare Snippets (linkable snippets) sind Informationen, die Menschen dazu verleiten, auf deine Blogbeiträge zu verlinken.Es ist wichtig, viele Verlinkungen zu erhalten, denn sie sind ein bekannter Rankingfaktor. Google hat uns das mehrfach bestätigt, und auch wir haben in unserer Studie von über einer Milliarde Seiten einen klaren Zusammenhang zwischen Backlinks und organischem Traffic festgestellt.Aber wie kannst du wissen, was ein “verlinkbares Snippet” für dein Thema ist?Hier ist eine einfache Methode:Gib die am besten rankende Seite für dein Keyword in den Site Explorer von Ahrefs einÖffne den Anchors-BerichtSuche nach gemeinsamen Merkmalen in den AnkernWenn wir dies für einen der Top-Posts für SEO-Techniken tun, sehen wir viele Leute, die aufgrund von Statistiken verlinken.Wir können wahrscheinlich mehr Leute dazu verleiten, auf unseren Beitrag zu diesem Thema zu verlinken, indem wir ähnliche Statistiken einbeziehen.Wenn wir dies für einen der Top-Posts über SEO-Copywriting tun, sehen wir, dass viele Leute aufgrund von zwei einzigartigen Konzepten verlinken:Wenn wir mehr Backlinks zu unserem Beitrag über SEO-Copywriting bekommen möchten, sollten wir wahrscheinlich ein paar unserer eigenen einzigartigen Ideen in den Beitrag einbauen.Füge Schema Markup hinzuSchema Markup ist ein Code, der Suchmaschinen dabei hilft, deinen Inhalt besser zu verstehen und in den Suchergebnissen zu präsentieren.Für Blogbeiträge ist die Hauptanwendung von Schema Markup, Rich Snippets wie dieses zu gewinnen:Rich Snippets können die Anzahl der Klicks erhöhen und zu mehr organischem Traffic für deine Blogbeiträge führen.Woher weißt du also, ob du Schema Markup zu deinem Beitrag hinzufügen solltest?Hier ist ein kurzer Spickzettel:Empfohlene Lektüre: Rich Snippets: Was sind sie und wie bekommst du sie?Füge interne Links hinzuInterne Links sind Links von einer Seite oder einem Beitrag zu einer anderen auf der gleichen Domain. Sie sind wichtig, weil sie die ‘Autorität’ von Seiten erhöhen und Google dabei helfen, zu verstehen, worum es auf einer Seite geht.Aus diesem Grund ist es sinnvoll, relevante interne Links in jeden deiner Blogbeiträge zu integrieren.Du kannst relevante Möglichkeiten mit Google finden. Suche einfach nach: site:deinewebsite.com \"Hauptkeyword für deinen Beitrag\"Wenn es in deinem Blogbeitrag zum Beispiel um Flanksteaks geht, dann würdest du suchen nach:site:deinewebsite.com \"flanksteak\"Dadurch werden die Seiten auf deiner Website angezeigt, die das Ziel-Keyword deines Beitrags enthalten:Dann musst du nur noch diese Wörter und Phrasen in deinem neuen Blogpost verlinken, wo sie relevant sind.Du kannst interne Verlinkungsmöglichkeiten auch kostenlos mit dem Site Audit in den Ahrefs Webmaster Tools finden. Gehe einfach auf den Link Opportunities Report und füge deine Zielseite hinzu: https://www.youtube.com/watch?v=eWJtcPzGQWYEmpfohlene Lektüre: Interne Links für SEO: Ein praktischer LeitfadenWie du das Ranking deiner Blogbeiträge verbessern und erhalten kannstSEO für Blogs ist keine einmalige Aktion. Du kannst nicht einfach einen Beitrag schreiben und optimieren und dann Feierabend machen. Es ist ein fortlaufender Prozess, deine Blogposts in Google hoch zu ranken und diese Rankings über die Zeit zu halten.Sehen wir uns ein paar Taktiken an, die du anwenden kannst, um die Rankings deiner Blogbeiträge zu verbessern und zu erhalten.Aktualisiere deine Beiträge regelmäßigOptimiere für Featured SnippetsErstelle Content HubsBaue mehr Links aufAktualisiere deine Beiträge regelmäßigWenn du den Ahrefs-Blog schon eine Weile verfolgst, wirst du wissen, dass wir unsere Blogbeiträge fast genauso oft aktualisieren und neu veröffentlichen, wie wir neue Beiträge schreiben. In der Tat haben wir laut Content Explorer etwa ¼ unserer Beiträge neu veröffentlicht.Wir machen das aus dem Grund, weil Rankings selten ewig halten. Unsere Beiträge werden mit der Zeit häufig schal und veraltet, was zu einem Rückgang der Rankings und des organischen Traffics führt.Genau das ist mit unserem Beitrag über die häufigsten Suchanfragen bei Google geschehen:Wie haben wir dieses Problem gelöst?Indem wir den Beitrag aktualisiert und neu veröffentlicht haben.Wann wir das getan haben, erkennst du in der Grafik an dem plötzlich deutlichen Traffic-Anstieg:Wir schreiben auch oft Beiträge um und veröffentlichen sie neu, wenn wir die Suchintention falsch eingeschätzt haben.Zum Beispiel haben wir 2016 eine On-Page-SEO-Studie veröffentlicht, die aber nie besonders hoch rankte oder viel organischen Traffic erhielt, weil die Suchenden nicht nach einer Studie suchten. Also haben wir 2018 den Beitrag in einen Leitfaden umgeschrieben und ihn unter der gleichen URL neu veröffentlicht.Dies führte zu einem großen und konstanten Anstieg des organischen Traffics.Empfohlene Lektüre: Wiederveröffentlichung von Content: Wie du alte Blogbeiträge für die SEO aktualisieren kannstOptimiere für Featured SnippetsFeatured Snippets sind kurze Informationen, die bei einigen Suchergebnissen ganz oben erscheinen. Sie werden normalerweise von einer der Seiten in den Top 10 gezogen und zielen darauf ab, eine knappe Antwort auf die Frage des Suchenden zu geben.Indem du deinen Blogpost für das Featured Snippet optimierst, kannst du manchmal deinen Weg zur Top-Position abkürzen.Die einfachste Möglichkeit, um Featured Snippet-Möglichkeiten für deine Beiträge zu finden, ist folgende:Gib deinen Blog in den Ahrefs Site Explorer einÖffne den Organic-Keywords-BerichtFiltere nach Keywords mit Featured Snippets, für die du nicht rankstDann musst du nur noch die nötigen Informationen hinzufügen oder umformatieren, damit sie für das Snippet zu deinem Blogbeitrag geeignet sind.https://www.youtube.com/watch?v=TuTMLbbnlg0Empfohlene Lektüre: Wie du für Googles Featured Snippets optimierstErstelle Content HubsContent Hubs sind miteinander verknüpfte Sammlungen von Blogbeiträgen zu einem bestimmten Thema.Sie bestehen aus diesen drei Teilen: Einem ‘Hub’-Post über ein breites Thema Sub-Posts über Teilbereiche des breiten Themas Interne Links zu und von der Hub-Seite zu Sub-PostsViele SEO-Profis glauben, dass das Erstellen eines Content-Hubs aus Blogbeiträgen die Rankings für alle Beiträge im Hub verbessert. Dafür gibt es einige Gründe, aber die Haupttheorie ist, dass es Google dabei hilft, deine Seite als autoritäre Quelle für Informationen zu einem Thema zu betrachten.Einen Content-Hub kannst du entweder von Grund auf neu erstellen oder aus Blogbeiträgen, die du bereits zu einem ähnlichen Thema verfasst hast.Empfohlene Lektüre: Content-Hubs für SEO: Wie du mehr Traffic und Links bekommstBaue mehr Links aufDa es eine klare Korrelation zwischen Backlinks und Rankings gibt, wirst du wahrscheinlich Schwierigkeiten haben, Beiträge zu übertreffen, die deutlich mehr hochwertige Links haben als du.Wie kannst du wissen, wie viele Links konkurrierende Seiten haben?Schau dir die SERP-Übersicht für dein Ziel-Keyword im Ahrefs Keywords Explorer an:Du kannst dann tiefer in ihre Linkprofile eindringen, um die Qualität ihrer Links zu überprüfen und ein besseres Gefühl für die tatsächliche Ranking-Schwierigkeit zu bekommen.Empfohlene Lektüre: Keyword-Difficulty: Wie du deine Ranking-Chancen bei Google ermittelstFazitBei der SEO für Blogs geht es vor allem um Konsequenz. Du musst konsequent suchmaschinenrelevante Blogbeiträge schreiben, optimieren und aktualisieren. Das braucht Zeit und sie werden nicht über Nacht ranken. Dennoch ist das so ziemlich die einzige Möglichkeit, konsistenten Such-Traffic für deinen Blog zu generieren.Wenn dein Blog neu ist und es dir an “Autorität” fehlt, kann es sich auch lohnen, mit konkurrenzschwachen Keywords zu beginnen, für die man leichter ranken kann.Erfahre in unserem kostenlosen Kurs “Bloggen für Unternehmen” mehr darüber, wie du deinen Blog starten und auf 100.000 monatliche Besucher und darüber hinaus ausbauen kannst. Hast du noch Fragen? Schreib mir auf Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Joshua Hardwick Head of Content @ Ahrefs (oder, in einfachen Worten, ich bin der Typ, der dafür sorgt, dass jeder Blog-Post EPISCH wird).",
  "headers": [
    {
      "level": "H1",
      "text": "SEO für Blogs: Der komplette Leitfaden"
    },
    {
      "level": "H2",
      "text": "Was ist Blog-SEO?"
    },
    {
      "level": "H2",
      "text": "Warum ist Blog-SEO wichtig?"
    },
    {
      "level": "H2",
      "text": "Wie man Blogbeiträge SEO-gerecht verfasst"
    },
    {
      "level": "H3",
      "text": "1. Finde ein Keyword"
    },
    {
      "level": "H3",
      "text": "2. Überprüfe die Suchintention"
    },
    {
      "level": "H3",
      "text": "3. Wähle ein erfolgreiches Format und inhaltlichen Blickwinkel"
    },
    {
      "level": "H4",
      "text": "Das richtige Format wählen"
    },
    {
      "level": "H4",
      "text": "Den richtigen Blickwinkel wählen"
    },
    {
      "level": "H3",
      "text": "4. Erstelle eine datengestützte Gliederung"
    },
    {
      "level": "H4",
      "text": "Suche nach gemeinsamen Zwischenüberschriften"
    },
    {
      "level": "H4",
      "text": "Suche nach gemeinsamen Keywords"
    },
    {
      "level": "H4",
      "text": "Überprüfe den “Also talk about”-Bericht"
    },
    {
      "level": "H3",
      "text": "5. Schreibe den Beitrag"
    },
    {
      "level": "H2",
      "text": "Wie du deine Blogbeiträge für SEO optimierst"
    },
    {
      "level": "H3",
      "text": "Füge dein Keyword in den Titel ein"
    },
    {
      "level": "H3",
      "text": "Halte deinen Title-Tag kurz"
    },
    {
      "level": "H3",
      "text": "Verwende eine Evergreen-URL"
    },
    {
      "level": "H3",
      "text": "Erstelle eine ansprechende Meta-Beschreibung"
    },
    {
      "level": "H3",
      "text": "Optimiere deine Bilder"
    },
    {
      "level": "H3",
      "text": "Füge ein Inhaltsverzeichnis hinzu"
    },
    {
      "level": "H3",
      "text": "Füge ‘verlinkbare Snippets’ hinzu"
    },
    {
      "level": "H3",
      "text": "Füge Schema Markup hinzu"
    },
    {
      "level": "H3",
      "text": "Füge interne Links hinzu"
    },
    {
      "level": "H2",
      "text": "Wie du das Ranking deiner Blogbeiträge verbessern und erhalten kannst"
    },
    {
      "level": "H3",
      "text": "Aktualisiere deine Beiträge regelmäßig"
    },
    {
      "level": "H3",
      "text": "Optimiere für Featured Snippets"
    },
    {
      "level": "H3",
      "text": "Erstelle Content Hubs"
    },
    {
      "level": "H3",
      "text": "Baue mehr Links auf"
    },
    {
      "level": "H2",
      "text": "Fazit"
    }
  ],
  "author": "Joshua Hardwick"
}