{
  "url": "https://ahrefs.com/blog/de/blog-artikel-laenge/",
  "slug": "blog-artikel-laenge",
  "title": "Wie lang sollten Blogartikel sein? Die Wahrheit über Inhaltslänge",
  "description": "Die meisten Blogartikel sollten mindestens 300 Worte umfassen. Bei allem was kürzer ist, solltest du dich fragen, ob du überhaupt etwas wichtiges zu sagen hast.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (oder, in einfachen Worten, ich bin der Typ, der dafür sorgt, dass jeder Blog-Post EPISCH wird). Article PerformanceData from AhrefsVerlinkung von Websites 3 Sign up for AhrefsGet SEO metrics of any website or URL.The number of websites linking to this post.This post's estimated monthly organic search traffic. Inhalt Die meisten Blog-Einträge sollten mindestens 300 Wörter lang sein. Wenn sie kürzer als das sind, solltest du dich wahrscheinlich fragen, ob du überhaupt etwas Wichtiges zu sagen hast.Von dort aus sollte es nicht dein Ziel sein, eine bestimmte Wortanzahl zu erreichen. Dein Ziel sollte es sein, einen gründlichen, ansprechenden und gut recherchierten Beitrag zu schreiben, der so lang ist, wie er sein muss: nicht weniger und nicht mehr.Die Tatsache, dass du dies liest, bedeutet jedoch, dass du wahrscheinlich schon gehört hast, dass Google lange Posts höher bewertet als kurze.In diesem Beitrag werden wir untersuchen, warum dies mit ziemlicher Sicherheit falsch ist und was du stattdessen tun solltest, um deine Blog-Posts für Suchmaschinen zu optimieren.Weshalb denken die Menschen, dass lange Blogartikel besser für SEO sind?Viele Studien zeigen eine Korrelation zwischen der Länge der Inhalte und den Dingen, die wir mit einer guten SEO-Leistung in Verbindung bringen.Die Korrelation beweist jedoch keine Kausalität.Lass uns also ein paar gängige Argumente etwas weiter ausführen.1. Längere Inhalte erhalten mehr BacklinksBacklinks sind einer der wichtigsten Google-Ranking-Faktoren.Wir wissen dies, weil sie die Grundlage des PageRank-Algorithmus bilden. Google spricht hier auch über Backlinks im Zusammenhang mit dem Ranking nützlicher Seiten.Wenn du dir die Beziehung zwischen Wortzahl und Backlinks ansiehst, gibt es tatsächlich eine starke positive Korrelation.In diesem Fall stammen die Daten aus der Analyse einer Stichprobe von rund 900 Millionen Seiten aus dem 3+ Milliarden Seiten umfassenden Content Explorer. Das ist unser Content-Recherche-Tool zur Analyse der besten Inhalte zu einem Thema. Wir sind jedoch nicht die Ersten, die diesen Zusammenhang erkennen. Viele Menschen haben andere Datenquellen analysiert und dabei das Gleiche festgestellt: Längere Inhalte erhalten mehr Backlinks als kürzere Inhalte.Woher könnte diese Korrelation stammen?Beginnen wir mit der naheliegendsten Möglichkeit: Längere Blog-Einträge wirken einfach beeindruckender, und deshalb verlinken mehr Menschen darauf.Obwohl das eine vernünftige Behauptung zu sein scheint, wird sie von unseren Daten nicht wirklich gestützt.Sieh dir die obige Grafik noch einmal an und du wirst sehen, dass sie bei 1.000 Wörtern abschneidet. Bei Beiträgen, die länger sind, fanden wir tatsächlich eine starke negative Korrelation zwischen Wortzahl und Backlinks. Mit anderen Worten, die durchschnittliche Anzahl der Backlinks von einzigartigen Websites (verweisende Domains) beginnt nach 1.000 Wörtern zu sinken.Worum geht es hier also?Unsere Theorie ist, dass die Korrelation zumindest teilweise auf die Balance zwischen Gründlichkeit und Prägnanz zurückzuführen ist.Ich will das mal erklären:Im Allgemeinen tendieren längere Inhalte dazu, mehr “link-würdige” Gesprächspunkte zu enthalten. Aber sie begraben diese wichtigen “need to know”-Punkte auch unter vielen weniger wichtigen “nice to know”-Informationen. Das Ergebnis ist ein Stück Inhalt, das von weniger Menschen durchgelesen wird, was bedeutet, dass weniger Menschen tatsächlich auf die enthaltenen “link-würdigen” Punkte stoßen. Und wenn weniger Leute auf sie stoßen, werden weniger Leute einen Link zu dir setzen.Es ist auch wahr, dass die meisten Leute keinen Link zu einem Blogbeitrag setzen werden, den sie nicht gelesen haben. Und es werden weniger dieser Leute sein, wenn das Lesen deines Beitrags drei Stunden dauert.Wie solltest du damit umgehen?Halte deine Blog-Posts kurz und bündig und achte darauf, dass sie wichtige ‘link-würdige’ Punkte enthalten.Das macht Sinn. Aber woher weißt du, was einen “link-würdigen” Punkt ausmacht?Eine Möglichkeit besteht darin, die URL eines top-rankenden Posts für dein Ziel-Keyword in den Site Explorer von Ahrefs einzufügen. Gehe dann zum Bericht “Backlinks” und schaue dir die Link-Anker und den umgebenden Text nach Trends an.Wenn wir dies beispielsweise für einen der Top-Ranking-Posts für “SEO-Texterstellung” tun, stellen wir fest, dass eine unverhältnismäßig hohe Anzahl von Links auf die Erwähnung der APP-Intro-Methode zurückzuführen ist.Da wir wissen, dass dieser Abschnitt für so viele Links verantwortlich ist, können wir sicherstellen, dass wir etwas Ähnliches einfügen, wenn wir über dasselbe Thema schreiben.Genau das haben wir in unserem SEO-Leitfaden zum Verfassen von Texten getan. Wir wollten den anderen Beitrag nicht kopieren und die APP-Methode erwähnen, also haben wir stattdessen eine andere nützliche Einführungsformel erwähnt.EmpfehlungFokussiere dich nicht auf die Länge. Fokussiere dich auf das so gründliche wie mögliche Hinzufügen von allen linkwürdigen Punkten.2. Längere Inhalte erhalten mehr organischen TrafficUnserer Analyse der Seiten im Content Explorer zufolge gibt es eine mäßig positive Korrelation zwischen der Länge der Inhalte und dem organischen Traffic.Aber noch einmal, es ist nicht schlau hier eine Kausalität zu vermuten.Warum könntest du diese Korrelation sehen?Betrachten wir zunächst die Idee, dass Google auf längere Inhalte ausgerichtet ist. Infolgedessen werden längere Inhalte höher eingestuft und erhalten mehr organischen Traffic.Noch einmal: Unsere Daten untermauern dies nicht wirklich.Wenn du dir die obige Grafik noch einmal ansiehst, wirst du feststellen, dass sie bei 2.000 Wörtern abschneidet. Das liegt daran, dass wir bei Beiträgen, die länger als 2.000 Wörter sind, eine mäßige negative Korrelation zwischen Wortzahl und organischem Traffic festgestellt haben. Mit anderen Worten, ein durchschnittlicher Post mit 10.000 Wörtern erhält weniger Traffic als ein durchschnittlicher Post mit 2.000 Wörtern.Natürlich könnte es sein, dass Google längere Inhalte mit bis zu 2.000 Wörtern bevorzugt, aber wir sehen in diesem Argument nicht viel Sinn. Es macht einfach keinen Sinn, Beiträge dafür zu bestrafen, dass sie “zu lang” sind.John Mueller von Google stimmt dem zu. Im Jahr 2019 erklärte er, dass die Wortzahl kein Ranking-Faktor ist..John Mueller: Die Wortanzahl ist kein Rankingfaktor. Spart euch den Ärger.Werfen wir also einen Blick auf einige weitere überzeugende Gründe, warum diese Korrelation bestehen könnte.Erstens gibt es eine positive Korrelation (bis zu 1.000 Wörter) zwischen Wortzahl und Backlinks. Das wissen wir bereits, und wir wissen, dass Backlinks für das Ranking wichtig sind.Zweitens sind längere Inhalte tendenziell gründlicher und decken natürlich mehr Unterthemen ab. Aus diesem Grund werden bei längeren Inhalten oft mehr Long-Tail-Keywords gerankt.Nimm einfach unsere Liste der Google-Suchoperatoren. Dem Site Explorer von Ahrefs zufolge wird er für etwa 7.200 Suchbegriffe gerankt.Viele dieser Keywords sind nur andere Arten der Suche nach derselben Sache wie “Google-Suchbefehle” und “Google-Suchmodifikatoren”. Aber die Seite rankt auch für verwandte Begriffe wie “google inurl” und “google filetype operator.”Dies geschieht, weil unser Beitrag gründlich ist und diese beiden Operatoren erwähnt.Wenn unser Blogbeitrag weniger gründlich wäre und nicht über diese Dinge sprechen würde, würde er bei diesen Keywords kein Ranking erreichen. Wir sehen, dass dies bei einem konkurrierenden Beitrag über dasselbe Thema geschieht. Er erwähnt nur zwölf Suchoperatoren, so dass er nicht für so viele verwandte Keywords gerankt wird.Wie solltest du damit umgehen?Anstatt unermüdlich zu schreiben, bis es keine Möglichkeit mehr gibt, dass du etwas Wichtiges übersehen hast, fang damit an, zu recherchieren, was wichtig ist. Auf diese Weise kannst du deine Beiträge prägnant halten, indem du das Wichtige einbeziehst und das Unwichtige weglässt.Ein einfacher Weg, dies zu tun, besteht darin, auf den ersten Seiten nach Gemeinsamkeiten zu suchen.So wird zum Beispiel auf den beiden ersten Seiten der “Keto-Diät” darüber gesprochen, was die Keto-Diät ist…… und welches Essen du essen solltest:Die Tatsache, dass mehrere Top-Ranking-Seiten über diese Dinge sprechen, sagt dir, dass es sich wahrscheinlich um wichtige Punkte handelt.Du kannst auch eine Inhaltslückenanalyse durchführen, um die Keywords zu finden, um dann mehrere top-rankende Seiten zu durchsuchen, und dann den Bericht nach Unterthemen und wichtigen Punkten durchleuchten. Dazu fügst du die URLs einiger toprankender Seiten für dein Haupt-Keyword in das Content Gap-Tool von Ahrefs ein und lässt das untere Feld leer.Führe den Bericht aus und suche nach Unterthemen.Hier sehen wir Wörter und Ausdrücke wie “Was ist die Keto-Diät”, “Keto-Mahlzeiten” und “Keto-Frühstück”.Allein diese wenigen Keywords reichen aus, um uns einen groben Umriss für einen Blogbeitrag zu geben.key takeawayKonzentriere dich nicht auf die Länge. Konzentriere dich darauf, alle relevanten Unterthemen so prägnant wie möglich abzudecken.Weshalb Blogartikel so gründlich wie möglich sein solltenGibt es neben den Korrelationsdaten, die zeigen, dass ein durchschnittlicher Blog-Beitrag nach einer bestimmten Länge weniger Backlinks und weniger Traffic erhält, noch einen anderen Grund, warum du dich so kurz wie möglich fassen solltest?Die einfache Antwort ist ja, denn niemand will mehr lesen als er muss.Mit den Worten von Tim Soulo, unserem CMO:Niemand liest gerne. Sie wollen nur die Information. Wenn sie sie in ihr Gehirn herunterladen könnten, würden sie es tun.Tim Soulo, CMOAber gibt es dafür wirklich Beweise, außer den anekdotischen?Auf jeden Fall. Als Medium die Korrelation zwischen der Länge der Beiträge und der durchschnittlichen Lesezeit untersuchte, stellte es fest, dass das Engagement bei Beiträgen mit einer Lesezeit von mehr als sieben Minuten nachlässt.Nach Angaben der University of Chicago lesen die meisten Menschen mit etwa 250 Wörtern pro Minute. Das bedeutet, dass ein 7‑minütiger Blog-Beitrag etwa 1.750 Wörter enthält.Bedeutet das, dass deine Blogeinträge niemals länger oder kürzer sein sollten?Nein, natürlich nicht. Es werden mehr als 1.750 Wörter benötigt, um einige Themen gründlich zu behandeln, bei anderen weniger. Deshalb umfasst unser Leitfaden für YouTube-SEO mehr als 7.000 Wörter, und unsere Liste der Chrome-Erweiterungen für SEOs umfasst nur 1.275 Wörter. Es gibt mehr über YouTube SEO zu berichten.Aber auch wenn es viel zu tun gibt, solltest du dich trotzdem bemühen, unnötige Dinge aus deinen Artikeln zu entfernen.Eines der Werkzeuge, die dabei helfen können, ist Hemingway. Es hilft dir, dein Schreiben zu verbessern, indem es dich über unnötige Wörter und unnötigen Firlefanz aufklärt. Meiner Erfahrung nach ist es mit diesem Werkzeug leicht, die Anzahl der Wörter um mindestens 10 % zu reduzieren. Aber andererseits kann es auch sein, dass mein Schreibstil ungewöhnlich kompliziert ist.Es lohnt sich auch, einen Freund oder Kollegen dazu zu bringen, deinen Blog-Beitrag zu lesen. Und warum? Weil andere Leute in der Regel besser erkennen können, wenn ein Punkt unnötig ist und nur dazu dient, den Beitrag zu verkomplizieren. Das ist etwas, was wir für alle Beiträge tun, die wir veröffentlichen.SchlussgedankenEs ist an der Zeit, die Besessenheit von der Wortzählung zu beenden. Konzentriere dich stattdessen darauf, prägnante, aber gründliche Blog-Einträge zu erstellen, die die Leser einbeziehen und SEO-Best Practices befolgen.Kämpfst du mit dem Engagement-Teil? Wirf einen Blick auf diese SEO-Tipps zum Verfassen von Werbetexten.Hast du Fragen? Ping mich auf Twitter an.Übersetzt von: Sebastian Simon. Sebastian Simon beschäftigt sich seit 2009 mit SEO, aktuell tut er das bei seven-bytes.de und heine.de. Article PerformanceData from AhrefsVerlinkung von Websites 3 Sign up for AhrefsGet SEO metrics of any website or URL.The number of websites linking to this post.This post's estimated monthly organic search traffic.Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Joshua Hardwick Head of Content @ Ahrefs (oder, in einfachen Worten, ich bin der Typ, der dafür sorgt, dass jeder Blog-Post EPISCH wird).",
  "headers": [
    {
      "level": "H1",
      "text": "Wie lang sollten Blogartikel sein? Die Wahrheit über Inhaltslänge"
    },
    {
      "level": "H2",
      "text": "Weshalb denken die Menschen, dass lange Blogartikel besser für SEO sind?"
    },
    {
      "level": "H3",
      "text": "1. Längere Inhalte erhalten mehr Backlinks"
    },
    {
      "level": "H4",
      "text": "Woher könnte diese Korrelation stammen?"
    },
    {
      "level": "H4",
      "text": "Wie solltest du damit umgehen?"
    },
    {
      "level": "H3",
      "text": "2. Längere Inhalte erhalten mehr organischen Traffic"
    },
    {
      "level": "H4",
      "text": "Warum könntest du diese Korrelation sehen?"
    },
    {
      "level": "H4",
      "text": "Wie solltest du damit umgehen?"
    },
    {
      "level": "H2",
      "text": "Weshalb Blogartikel so gründlich wie möglich sein sollten"
    },
    {
      "level": "H2",
      "text": "Schlussgedanken"
    }
  ],
  "author": "Joshua Hardwick"
}