{
  "url": "https://ahrefs.com/blog/de/blog-content-strategie/",
  "slug": "blog-content-strategie",
  "title": "Wie du in 7 Schritten eine erfolgreiche Content-Strategie für deinen Blog entwickelst",
  "description": "Bei einer Blog-Content-Strategie handelt es sich um eine Vision und einen Plan, die du für deinen Blog hast. Sie sollte mit deinen Geschäftszielen und deiner Content-Strategie übereinstimmen.",
  "content": "Katy Mrvova Head of Content bei Slido. Ich bin eine begeisterte Autorin und ein Bücherwurm. Ansonsten lerne ich gerne neue Sprachen und bin besessen von 90er-Jahre-Themen. Article PerformanceData from AhrefsVerlinkung von Websites 2 Sign up for AhrefsGet SEO metrics of any website or URL.The number of websites linking to this post.This post's estimated monthly organic search traffic. Inhalt Ein guter Blog kann unter anderem:Traffic für dein Unternehmen generieren.Den Bekanntheitsgrad deiner Marke und deiner Produkte erhöhen.Neue Kunden gewinnen.Deine Kunden und Interessenten weiterbilden und betreuen.Dir helfen, ein Vordenker in deiner Branche zu werden.Wir sagen “kann”, weil du zuerst eine todsichere Content-Strategie für deinen Blog brauchst, um all diese Ziele zu erreichen.Und genau darum geht es in diesem Beitrag.Das werden wir abdecken:Was ist eine Blog-Content-Strategie?Warum brauchst du eine Blog-Content-Strategie?Wie erstellst du eine Blog-Content-Strategie?Was ist eine Blog-Content-Strategie?Bei einer Content-Strategie für einen Blog handelt es sich um eine Vision und einen Plan, den du für deinen Blog hast. Ähnlich wie eine Unternehmensstrategie gibt eine Blog-Strategie deinem Blog die richtige Richtung vor und führt dich zu dem, was du mit deinen Blog-Inhalten erreichen willst.Deine Blog-Content-Strategie sollte auf deine Unternehmensziele und deine Content-Strategie abgestimmt sein. Deine Geschäftsziele sollten der primäre Beweggrund für deine Inhalte sein. Um eine bessere Vorstellung davon zu bekommen, wo deine Blog-Strategie im großen Ganzen angesiedelt ist, findest du hier ein einfaches Diagramm:Warum brauchst du eine Blog-Content-Strategie?Jeden Tag werden mehr als sieben Millionen Blogbeiträge veröffentlicht. In unserer Studie haben wir festgestellt, dass die Mehrheit (90,63%) aller Webseiten keinen monatlichen organischen Traffic erhält. Überhaupt nicht.Ohne eine klare Strategie kann es passieren, dass du Blog-Inhalte nur um ihrer selbst willen erstellst, ohne dass sie Traffic erzeugen und deinem Unternehmenswachstum nützen.Eine solide Blog-Strategie wird dir helfen, zu den 9,37% zu gehören. Also, lass uns eine erstellen.Wie du eine Blog-Content-Strategie erstellst Hier ist eine Schritt-für-Schritt-Anleitung für den Aufbau einer Blog-Strategie, die dir helfen wird, mehr Traffic für dein Unternehmen zu generieren und neue Kunden zu gewinnen. Definiere dein “Warum”Recherchiere deine KonkurrentenFühre eine gründliche Keyword-Recherche durchErstelle einen ContentplanGestalte das Erscheinungsbild deines BlogsVerfolge deinen Erfolg1. Definiere dein “Warum”Vergiss für einen Moment die Kennzahlen und denke an das große Ganze. Was ist der Zweck deines Blogs? Warum soll dein Blog existieren? Die Antworten auf diese Fragen bilden den Kern deiner Content-Strategie, also versuche, sie in einem Satz zusammenzufassen und dich davon leiten zu lassen.Unser übergeordnetes Ziel bei Slido ist es zum Beispiel, die Nummer 1 Ressource für alle zu werden, die bessere Meetings durchführen wollen.Wenn du Schwierigkeiten hast, den Zweck deines Blogs zu finden, kann dir dieses einfache “Help-to-by”-Framework (inspiriert vom “Get-to-by”-Modell aus der Werbung) helfen. Fülle einfach die Lücken aus.Der Zweck meines Blogs ist es, [Publikum mit einem bestimmten Problem oder JTBD] mit [den Mitteln] zu [dem gewünschten Ergebnis] zu verhelfen.Bei Ahrefs könnte unsere Help-to-by-Strategie wie folgt aussehen:Marketern und Website-Betreibern dabei zu helfen, SEO besser zu beherrschen und mehr Traffic für ihre Websites zu generieren, indem wir ausführliche Tutorials und Anleitungen veröffentlichen.Wenn du einen Blog für deinen Online-Shop für Yoga-Zubehör erstellst, kann der Zweck deines Blogs darin bestehen:Denjenigen, die mit Yoga anfangen, zum Erfolg zu verhelfen, indem du ihnen die besten Praktiken und die besten Tipps für die Ausstattung vermittelst.Es ist wichtig, dass du dein “Warum” gleich zu Beginn festlegst, denn es hilft dir, alle anderen Aspekte deiner Content-Strategie für deinen Blog auf Kurs zu halten.2. Recherchiere deine KonkurrentenWettbewerbsanalyse ist eine unschätzbare Inspirationsquelle für deine Blog-Inhalte. Sie deckt auf, welche Keywords deinen Konkurrenten Traffic bringen, welche Art von Inhalten für sie funktioniert, was sie gut machen und wo sie versagen.Du solltest zwei Arten von Konkurrenten untersuchen:Business-KonkurrentenContent-KonkurrentenBusiness-KonkurrentenKonkurrenten sind die Unternehmen/Marken, die ähnliche (oder dieselben) Produkte oder Dienstleistungen anbieten wie du. Sie sind relativ leicht zu identifizieren, denn du kennst sie wahrscheinlich schon seit den Anfängen deines Unternehmens.Wenn du zum Beispiel Yogamatten verkaufst, dann ist liforme.com dein Konkurrent.Mit dem Site Explorer von Ahrefs kannst du herausfinden, welche Inhalte deiner Konkurrenten bei der organischen Suche am besten abschneiden: Gib ihre Domain oder ihren Blog einÖffne den Bericht Top-SeitenHier siehst du, dass liforme.com viel organischen Traffic für seine Beiträge über sitzende Yogastellungen und Yogastellungen für mehr Flexibilität erhält. Außerdem ranken sie für diese beiden Keywords auf Platz 1 bei Google, wie du in den Spalten “Top Keyword” und “Position” sehen kannst. Dieser Bericht eignet sich hervorragend, um schnell erste Themen und Keywords zu finden, über die es sich zu schreiben lohnt. Wenn du mehr davon brauchst, wiederholst du den Vorgang einfach für weitere Wettbewerber.Content-KonkurrentenContent-Konkurrenten sind Websites, mit denen du in der organischen Suche konkurrierst, die aber nicht unbedingt mit dir im geschäftlichen Sinne konkurrieren. Einer unserer Content-Konkurrenten ist zum Beispiel backlinko.com, weil wir für viele gemeinsame Keywords konkurrieren. Aber sie sind nicht unser geschäftlicher Konkurrent, weil wir beide unterschiedliche Dinge verkaufen. Mit dem Keywords Explorer kannst du ganz einfach Content-Konkurrenten finden:Gib die Keywords ein, die du bei der Analyse der Konkurrenten gefunden hastÖffne den Bericht Traffic Share by DomainsDieser Bericht zeigt dir die Websites mit dem höchsten geschätzten organischen Traffic für die von dir eingegebenen Keywords: Überprüfe diese Websites mit dem Site Explorer, wie du es bei deinen Konkurrenten getan hast, um noch mehr Themenideen zu finden.3. Führe eine gründliche Keyword-Recherche durchJetzt, wo du weißt, worüber deine Konkurrenten schreiben und woher ihr Traffic kommt, ist es Zeit für eine Keyword-Recherche, um herauszufinden, wonach die Leute in deiner Branche suchen.Bestimme zunächst deine Seed Keywords. Seed Keywords sind im Grunde die wichtigsten Themen, über die du in deinem Blog schreiben wirst. Am einfachsten ist es, wenn du dir die wichtigsten Wörter notierst, die dein Unternehmen oder dein Angebot beschreiben.Wenn du zum Beispiel einen Blog für deinen Coffee-Shop betreiben möchtest, könnten sie etwa so aussehen:KaffeeEspressoCappuccinoLatteAeropressKaffeebohnenWenn du diese Keywords in den Keywords Explorer eingibst, den Bericht “Übereinstimmende Begriffe” aufrufst und den Übereinstimmungstyp auf “Fragen” umstellst, siehst du Hunderte oder Tausende von Keyword-Ideen, die als Fragen formuliert sind: Die meisten davon eignen sich für Blogbeiträge, weil es sich um Fragen handelt.Wenn du noch mehr Keyword-Ideen brauchst, lies unseren Leitfaden zur Keyword-Recherche.4. Erstelle einen ContentplanJetzt, wo du eine Menge Ideen für deinen Blog hast, ist es an der Zeit, Prioritäten zu setzen und einen Contentplan zu erstellen. Dazu solltest du die folgenden drei Kriterien berücksichtigen: Traffic-Potenzial — Wie oft wird das Keyword pro Monat bei Google gesucht? Ranking-Schwierigkeit (Ranking Difficulty) — Wie schwer ist es, für dieses Keyword in den organischen Suchergebnissen zu ranken? Geschäftswert - Wie relevant ist dein Produkt im Zusammenhang mit dem Thema?Die besten Themen sind die mit einem hohen Traffic-Potenzial und Geschäftswert und einem geringen Wettbewerb: Wie beurteilst du diese Dinge?Im Keywords Explorer kannst du einen groben Eindruck vom Traffic-Potenzial erlangen, indem du dir das monatliche Suchvolumen des Keywords ansiehst. Wir empfehlen jedoch, mehr auf den geschätzten Traffic der am besten rankenden Seite zu achten, denn die meisten Seiten erhalten Traffic von mehreren Keywords.Zum Beispiel liegt das Suchvolumen für “Kaffee kochen mit der French Press” bei 20.000 pro Monat, aber die am besten rankende Seite erhält rund 60% mehr Traffic:Um die Ranking Difficulty einzuschätzen, ist unsere Keyword Difficulty (KD) Metrik eine gute erste Anlaufstelle. Sie bewertet die relative Ranking Difficulty von Keywords auf einer Skala von 0–100 (höher = schwieriger):Da es jedoch unmöglich ist, die Ranking Difficulty auf eine einzige Zahl zu reduzieren, empfehlen wir dir, ein paar andere Dinge zu überprüfen, bevor du ein Keyword ins Visier nimmst. Mehr dazu erfährst du in unserem Leitfaden zum Finden von wettbewerbsarmen Keywords.Wenn es um den geschäftlichen Wert/das Potenzial geht, empfehlen wir, jedem Thema einen Wert zwischen null und drei zuzuweisen, je nachdem, wie wichtig dein Produkt/deine Dienstleistung für die Lösung des Problems ist.Wenn du also hochwertige Kaffeebohnen online verkaufst, solltest du ein Keyword wie “Eiskaffee zubereiten” auf deinem Radar haben, weil es..: ein hohes Traffic-Potenzial hat — die am besten rankenden Seiten erhalten monatlich ~46.000 Suchanfragen. einen geringen Wettbewerb aufweist - der KD-Score ist relativ niedrig (28), und einige der am besten rankenden Seiten stammen von relativ kleinen Websites. einen hohen Geschäftswert aufweist — deine Kaffeebohnen können Suchenden helfen, eine bessere Tasse Eiskaffee zuzubereiten.Wenn du eine Reihe relevanter Themen gefunden hast, besteht der nächste Schritt darin, deine Themen zu gruppieren und sie in Stapeln zu bearbeiten, auch bekannt als “Clustering”.Bei der Keyword-Recherche könntest du zum Beispiel feststellen, dass viele Menschen nach verschiedenen Arten der Kaffeezubereitung suchen, zum Beispiel:wie man Eiskaffee zubereitetwie man Kaffee kalt aufbrühtwie man Kaffee für die French Press zubereitetwie man Kaffee mit Sahne zubereitetwie man Matcha Latte zubereitetEs könnte also sinnvoll sein, diese Themen in einem “Cluster” zusammenzufassen und sie gleichzeitig anzugehen. Vielleicht kannst du sogar dieselbe Vorlage/Gliederung für alle Themen einer Gruppe verwenden, was die Effizienz deiner Content-Erstellung erheblich steigern wird.Du kannst diese Beiträge auch miteinander verknüpfen, um einen sogenannten Content-Hub zu erstellen, von dem manche glauben, dass er dazu beiträgt, dass die einzelnen Beiträge bei Google besser ranken:5. Gestalte das Erscheinungsbild deines BlogsDenke über deinen Blog auf die gleiche Weise nach wie über deine Marke. Was unterscheidet ihn von anderen ähnlichen Blogs? Was wird die unverwechselbare Sprachstil, die Tonalität und der Stil deines Blogs sein?Erstelle eine Reihe von redaktionellen Richtlinien, die den Stil deines Blogs definieren.Die wichtigsten Aspekte der Richtlinien für deinen Blog sind:Visuelle RichtlinienSprachstil und TonalitätSchreibregelnVisuelle RichtlinienVisuelle Richtlinien dienen dazu, die Qualität und den Stil der Bilder in deinem Blog einheitlich zu gestalten. Das ist wichtig, denn dein Blog ist eine Erweiterung deiner Marke, also solltest du die visuelle Seite nicht unterschätzen. Hier gibt es oft viel zu beachten. Ein guter Ausgangspunkt ist, einen Weg zu finden, um deine Header-Bilder unverwechselbar und wiedererkennbar zu machen.Auf dem Ahrefs-Blog zum Beispiel gibt es für jeden Beitrag eine eigene Illustration mit einem einzigartigen visuellen Stil:Sprachstil & TonalitätRichtlinien zum Sprachstil & zur Tonalität definieren die Persönlichkeit und die Werte deines Blogs. Wenn du deinen Blog zum Beispiel mit Adjektiven beschreiben müsstest, die du normalerweise verwenden würdest, um eine Person zu beschreiben, welche wären das? Einfach und klug? Freundlich und lebhaft? Bescheiden und hilfsbereit? Wenn du bereits eine starke Markenidentität hast, werden sich der Sprachstil und die Tonalität deines Blogs wahrscheinlich daraus ableiten. Vergiss aber nicht, dass dein Blog eine eigenständige Einheit bildet. Lege fest, wie er klingen soll, wofür er stehen soll und welche Emotionen die Artikel hervorrufen sollen. Mache genaue Angaben zum Jargon, zur Formalität/Informalität des Schreibens, zum Grad der Skurrilität, zum Einsatz von Humor usw.SchreibregelnWährend es bei den Richtlinien zum Sprachstil und zur Tonalität eher um die “Seele” deines Blogs geht, definieren die Schreibregeln den “Körper” deines Bloginhalts. Dazu gehören Rechtschreibung (z. B. britisch vs. amerikanisch), Formatierung, Länge der Absätze, Großschreibung, Überschriftenformate usw.Solche Richtlinien helfen dir, die Qualität deiner Blogbeiträge auf einem einheitlichen Niveau zu halten und neue Autoren leichter einzustellen.Profi-TippSchreibe alle deine Blogregeln und Richtlinien in einem Dokument auf. Es dient als Bedienungsanleitung für deinen Blog, die du mit deinen Autoren teilen kannst und auf die du zurückgreifen kannst, wenn du deine Blogstrategie weiterentwickeln musst (ich wünschte, jemand hätte mir das früher gesagt).6. Messe deinen ErfolgEine Content-Strategie für deinen Blog ist schön und gut, aber du brauchst auch Key Performance Indicator (KPI), um zu verfolgen, wie gut deine Strategie im Laufe der Zeit funktioniert. Du kannst sie auch deinen Vorgesetzten zeigen, wenn er sich für die Leistung deines Blogs interessiert. Wenn du mit deinem Blog gerade erst anfängst, ist der Traffic wahrscheinlich der geeignetste KPI, den du mit Google Analytics verfolgen kannst. Es mag einfach klingen, aber in der Anfangsphase musst du einfach nur Inhalte schreiben, sie verbreiten und für Aufmerksamkeit sorgen. Sobald du diese Phase erreicht hast, ist es ratsam, einen robusteren KPI wie deinen organischen Share of Voice zu messen. Dieser sagt dir, wie sichtbar deine Marke in der organischen Suche im Vergleich zur Konkurrenz ist. Mit Rank Tracker bekommst du ein Gefühl für deinen organischen Share of Voice:Füge die Keywords hinzu, für die du ranken willstFüge deine Wettbewerber hinzuÖffne den Bericht Competitors OverviewÜberprüfe deine SichtbarkeitDieser Wert sollte im Vergleich zu deinen Konkurrenten mit der Zeit steigen.FazitDer Aufbau einer erfolgreichen Content-Strategie für deinen Blog erfordert Zeit und Mühe, aber es lohnt sich. Wenn du mit dem Bloggen beginnst, solltest du es langfristig angehen. Du wirst nicht sofort Ergebnisse sehen, aber mit der Hilfe von Ahrefs und diesem Tutorial wirst du einen qualitativ hochwertigen Blog aufbauen können, der dir mehr Besucher und Kunden bescheren wird. PS: Wenn du Leute sagen hörst: “Lesen die Leute noch? …Ist der Blog nicht tot?” Hör nicht auf sie. Solange die Menschen noch in Suchmaschinen nach Informationen suchen, ist das Bloggen nicht tot. Article PerformanceData from AhrefsVerlinkung von Websites 2 Sign up for AhrefsGet SEO metrics of any website or URL.The number of websites linking to this post.This post's estimated monthly organic search traffic.Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human:",
  "headers": [
    {
      "level": "H1",
      "text": "Wie du in 7 Schritten eine erfolgreiche Content-Strategie für deinen Blog entwickelst"
    },
    {
      "level": "H2",
      "text": "Was ist eine Blog-Content-Strategie?"
    },
    {
      "level": "H2",
      "text": "Warum brauchst du eine Blog-Content-Strategie?"
    },
    {
      "level": "H2",
      "text": "Wie du eine Blog-Content-Strategie erstellst"
    },
    {
      "level": "H3",
      "text": "1. Definiere dein “Warum”"
    },
    {
      "level": "H3",
      "text": "2. Recherchiere deine Konkurrenten"
    },
    {
      "level": "H4",
      "text": "Business-Konkurrenten"
    },
    {
      "level": "H4",
      "text": "Content-Konkurrenten"
    },
    {
      "level": "H3",
      "text": "3. Führe eine gründliche Keyword-Recherche durch"
    },
    {
      "level": "H3",
      "text": "4. Erstelle einen Contentplan"
    },
    {
      "level": "H3",
      "text": "5. Gestalte das Erscheinungsbild deines Blogs"
    },
    {
      "level": "H4",
      "text": "Visuelle Richtlinien"
    },
    {
      "level": "H4",
      "text": "Sprachstil & Tonalität"
    },
    {
      "level": "H4",
      "text": "Schreibregeln"
    },
    {
      "level": "H3",
      "text": "6. Messe deinen Erfolg"
    },
    {
      "level": "H2",
      "text": "Fazit"
    }
  ],
  "author": "Katy Mrvova"
}