{
  "url": "https://ahrefs.com/blog/de/content-writing/",
  "slug": "content-writing",
  "title": "Was ist Content Writing? 13 Tipps für die Erstellung großartiger Inhalte",
  "description": "Dank Hunderten von Beiträgen wissen wir, wie man guten Content erstellt. Hier sind 13 bewährte Verfahren, die wir im Laufe der Jahre gelernt haben.",
  "content": "Si Quan Ong Marketing @ Ahrefs. Ich lese, mache Breakdance und versuche zufäliige Lebensexperimente. Inhalt Bei Ahrefs schreiben wir eine Menge Inhalte. Wir haben über 320 Blog-Beiträge und mehr als 200 Videos auf unserem YouTube-Kanal veröffentlicht — die meisten davon sind gescriptet.Natürlich wissen wir ein oder zwei Dinge über die Erstellung großartiger Inhalte, die dein Publikum gerne konsumiert.In diesem Beitrag stellen wir dir 13 bewährte Verfahren vor, die du bei der Erstellung deiner eigenen Inhalte anwenden kannst. Doch zunächst einige Grundlagen:Was ist Content Writing?Warum ist Content Writing wichtig?Best Practices für Content WritingWas ist Content Writing?Beim Schreiben von Inhalten geht es um das Recherchieren, Planen, Schreiben, Bearbeiten und Veröffentlichen von Inhalten für den Online-Bereich. Dabei kann es sich um einen Blogbeitrag, ein Videoskript oder eine Verkaufsseite handeln — alles, was online veröffentlicht wird. Warum ist Content Writing wichtig?Das Verfassen von Inhalten ist wichtig, denn Inhalte können dir dabei helfen, Kunden zu gewinnen und zu binden. Das nennt man Content Marketing, und deshalb liest du hier im Ahrefs-Blog einen Artikel über Content Writing. Indem wir dich über die Bedeutung und die Best Practices für das Verfassen von Inhalten aufklären, hoffen wir, dein Bewusstsein, dein Interesse und deine Nachfrage nach unserem Produkt zu steigern.Best Practices für Content WritingJeder hat seine eigene Meinung darüber, wie man die besten Inhalte schreibt. Die bewährten Verfahren, die ich im Folgenden nenne, sind lediglich diejenigen, die sich im Laufe der Jahre bewährt haben und die uns bei der Erstellung von Inhalten zum Erfolg verholfen haben.1. Verwende eine VorlageDu musst mit dem Schreiben von Inhalten nicht bei Null anfangen. Die meisten lassen sich in einige wenige Typen einteilen — Artikel, Anleitungen, Rezensionen usw. Aus diesem Grund gibt es für sie Vorlagen. Du kannst diese als Grundlage verwenden und deine eigenen Recherchen anstellen.Wir verwenden sogar eine Vorlage für genau diesen Beitrag.Woher weißt du, welche Vorlage du verwenden solltest?Das hängt von deinem Ziel ab. Wenn du jedoch möchtest, dass deine geschriebenen Inhalte die besten Chancen haben, in Google weit oben zu ranken und organisch Kunden anzuziehen, solltest du eine Vorlage wählen, die mit den Suchanfragen übereinstimmt, die Suchende stellen.Wenn du z.B. nach “Content Writing” googelst (was du wahrscheinlich getan hast), wirst du feststellen, dass es eine ganze Reihe von Listeneinträgen gibt.Deshalb haben wir uns für diesen Ansatz entschieden, denn die Ergebnisse auf den vorderen Plätzen sind ein guter Anhaltspunkt dafür, was die Suchenden sehen wollen und was Google daher am ehesten einordnen wird.2. Erstelle eine bewährte GliederungEine Vorlage reicht zwar aus, um den Anfang zu machen, aber du weißt vielleicht nicht genau, worüber du schreiben möchtest.Wir würden zum Beispiel ziemlich schnell eine Schreibblockade bekommen, wenn wir versuchen würden, diesen Beitrag von Anfang bis Ende zu schreiben, ohne uns eine Gliederung zurechtzulegen.So sah es bei diesem Artikel aus:Wie haben wir herausgefunden, welche Punkte wir aufnehmen sollten? Einige der Punkte sind unsere eigenen Ideen, aber wir haben uns auch von den Seiten inspirieren lassen, die in der Rankingliste ganz oben stehen.Genauer gesagt haben wir nach gemeinsamen Themen und Punkten gesucht, um besser zu verstehen, auf welche Art von Fragen die Leute Antworten haben wollten und welche Art von Rat sie suchten.Mit dem kostenlosen On-Page-Report in der SEO-Toolbar von Ahrefs können wir zum Beispiel einige gemeinsame Themen in den Unterüberschriften der Top-Seiten erkennen.In diesem Beitrag wirst du feststellen, dass wir ähnliche Punkte aufgenommen haben.3. Mach deinen Content “teilenswert”Menschen teilen Inhalte aus allen möglichen Gründen. Jonah Berger hebt einige davon in seinem Bestseller “Contagious” hervor. Menschen teilen Dinge, weil sie:sie gut aussehen lassen oder ihre eigene Sichtweise/Erzählung untermauern.eine Art von Emotion, z. B. Wut, Ehrfurcht, Glück usw. fühlen.einen Bezug zu aktuellen Ereignissen haben.einen praktischen Wert oder Nutzen bieten.bereits von vielen anderen geteilt wurden.Richten wir unsere Aufmerksamkeit auf #5.Um dieses Schwungrad in Gang zu setzen, ist es wichtig, dass die ersten Beiträge geteilt werden, und eine Möglichkeit, dies zu erreichen, besteht darin, “Auslöser für das Teilen” in deine Inhalte einzubauen.Du kannst “Share-Trigger” finden, indem du nach gemeinsamen Linkgründen im Backlinkprofil einer ähnlichen Seite suchst — denn Links sind eine Form des Teilens.So geht’s:Öffne den Ahrefs Keywords Explorer.Suche nach einem Thema, über das du schreibst.Sieh dir die SERP-Übersicht an.Suche einen ähnlichen Artikel mit vielen verweisenden Domains.Klicke auf die Zahl in der Spalte Backlinks.Überfliege die Anchor- und Ziel-URL-Spalte hinsichtlich Gemeinsamkeiten.Wenn wir dies zum Beispiel für den Beitrag von Big Commerce über Affiliate-Marketing tun, sehen wir, dass ziemlich viele Leute aufgrund der erwähnten Statistiken verlinken (wahrscheinlich aufgrund von Prinzip 1).Wenn du über dasselbe Thema schreibst, wird die Erwähnung dieser oder ähnlicher Statistiken wahrscheinlich die Verbreitung steigern.4. Gib deinem Beitrag einen einzigartigen BlickwinkelJeden Tag werden mehr als 3,5 Millionen Blogbeiträge veröffentlicht. Wenn du im Wettbewerb bestehen möchtest, musst du dich abheben. Heb dich ab, indem du das von dir gewählte Thema aus einem einzigartigen Blickwinkel behandelst..Hier ist ein Beispiel. Prokrastination ist kein neues Thema. Dennoch ist Tim Urbans Beitrag über Prokrastination einer der beliebtesten auf seiner Website (oder vielleicht sogar im Internet). Und warum? Weil er das Thema aus einem Blickwinkel angegangen ist, den niemand zuvor gesehen hat.Anstelle eines Selbsthilfe-Tirade über die Gefahren der Prokrastination, entschied er sich zu erklären, warum es passiert, mit Hilfe von niedlichen Illustrationen: dem Instant Gratification Monkey, Panic Monster, etc.Es gibt zwar keine todsicheren Methoden, um auf “Blickwinkel” zu kommen, aber hier sind ein paar mentale Modelle, die du in Betracht ziehen könntest: Persönliche Erfahrung — Hast du schon einmal etwas ausprobiert? Erzähle von deinen Erfahrungen und den daraus gezogenen Lehren. Das haben wir mit unserem Beitrag über E‑Mail-Kontaktaufnahme und SEO-Zertifizierungen getan. Autorität - Bist du ein Experte auf deinem Gebiet, der einzigartige Einblicke bieten kann? Dann schrecke nicht davor zurück. Oder, wenn du kein Experte bist, könntest du einen interviewen? Das haben wir mit unserem Beitrag über Google-Strafen getan. Crowdsource - Hole die Meinungen einiger Experten ein, wie wir es in unserem Beitrag zur SEO-Stellenbeschreibung getan haben. Daten - Nenne Beweise und Zahlen für populäre Behauptungen in deiner Nische. Siehe unsere Studien zum gegenseitigen Linkaufbau und zur Länge von Blogposts. Gegenteil - Was passiert, wenn du das Gegenteil von dem tust, was andere tun?5. Baue Glaubwürdigkeit aufErwarte nicht, dass man dir von Anfang an glaubt. Vermittle, warum man dir glauben sollte. Warum ausgerechnet dir?Bist du ein Experte in der Branche? Hast du die nötigen Referenzen, um dies zu beweisen? Können andere für dich bürgen?Hast du Daten oder Beweise, die deine Behauptungen untermauern?Hast du das, was du behauptest, schon einmal gemacht? Hast du es erlebt oder ausprobiert?Wie du sehen kannst, beziehen sich die meisten Fragen auf deinen Standpunkt. Der Blickwinkel, den du für dein Thema wählst, trägt dazu bei, die nötige Glaubwürdigkeit zu schaffen. Aber belass es nicht dabei. Erzähle es deinen Kunden.Scrolle hinauf zur Einleitung dieses Beitrags. Ich habe gesagt, dass wir viel Erfahrung mit dem Erstellen und Veröffentlichen von Inhalten haben — und zwar Hunderte davon.Siehst du, was ich da gemacht habe? 😉6. Zeigen, nicht erzählenRatschläge zu erteilen ist einfach. Aber lasse dein Publikum nicht im Stich. Zeige genau, was du meinst und wie es gemacht werden kann. Gib immer Beispiele für das, worüber du sprichst.Wenn wir zum Beispiel über die Erstellung von SEO-Zielen sprechen, geben wir dir nicht nur den Rahmen vor. Wir geben drei Beispiele für verschiedene Ziele und wie sie in der Praxis aussehen.7. Formuliere eine fesselnde ÜberschriftDie Leute werden nicht auf deinen Beitrag klicken, wenn die Überschrift langweilig und uninspirierend ist.Du musst unwiderstehliche Überschriften entwerfen, die die Aufmerksamkeit der Leute fesseln und sie dazu bringen, mehr erfahren zu wollen.Wie das geht? Verwende unsere dreistufige Formel: Wähle ein Format - Das von dir gewählte Inhaltsformat (Artikel, Leitfaden, Rezension usw.) bestimmt, wie deine Überschrift aussehen wird. Füge einen überzeugenden Blickwinkel hinzu — Wenn du deinen Blickwinkel (aus Punkt 3) gewählt hast, stelle sicher, dass du dem potenziellen Leser davon erzählst. Sei menschlich — Verwende Adjektive oder Redewendungen, als ob du den Artikel deinem besten Freund oder deiner besten Freundin beiläufig beschreiben würdest.Empfohlene Lektüre: Wie man eine unwiderstehliche Überschrift in 3 einfachen Schritten schreibt8. Starte dein Intro mit der PAS-FormelÜberschriften verleiten zum Klicken. Intros überzeugen die Leute zum Lesen.Verwende die Problem-Agitate-Solve (PAS)-Formel (Problem, Verschärfen, Lösen), um ein überzeugendes Intro zu erstellen. Wir verwenden diese Formel ziemlich regelmäßig in unserem Blog.Wie funktioniert das? Beginne damit, das Problem zu beschreiben:Dann verschärfst (agitate) du das Problem, indem du noch tiefer in den Schmerz eindringst:Schließlich zeigst du ihnen den Weg, indem du ihnen eine Lösung anbietest:9. Mache deinen Beitrag mit der KKML-Formel leicht lesbarEs gibt nichts Entmutigenderes als eine Textwand.Wenn dein Artikel so aussieht, vergraulst du die Leute. Gliedere ihn auf.Gut geschriebene Inhalte lassen sich mühelos lesen. Verwende die KKML-Formel, um deine Inhalte so zu gestalten, dass sie leichter zu lesen sind: Kommentieren — Füge Seitenverweise, Blockzitate, Call-out-Boxen und andere Elemente ein. Kurze Sätze und Absätze — Verwende den Hemingway-Editor, um lange, komplexe Sätze zu finden und sie zu kürzen. Multimedia — Verwende Videos, Bilder, GIFs und Tweet-Einbettungen, um deine Punkte zu illustrieren. Lies deinen Inhalt laut vor — Entdecke Bereiche, in denen dein Text nicht flüssig ist.10. Schreibe so, wie du sprichstDas Schreiben von Webinhalten ist freundlich und persönlich. Es ist wie ein Gespräch mit einem Freund. Es ist nicht nötig, große Worte anzubringen oder so zu schreiben, als würdest du im Magazin GEO veröffentlichen.Dein Ziel ist es, zu kommunizieren, und nicht, andere mit deinem umfangreichen Wortschatz zu beeindrucken. Bleibe also locker und schreibe so, wie du sprichst.11. Hole Feedback zu deinem Text einAls Schöpfer bist du zu nah an deinem Werk dran. Du wirst nicht in der Lage sein, deine Fehler zu erkennen. Deshalb kann die Meinung einer zweiten Person von unschätzbarem Wert sein.Bei Ahrefs wird tatsächlich jeder Blogbeitrag und jedes Skript, das wir schreiben, einer solchen Prüfung unterzogen. Wir lesen abwechselnd die Entwürfe der anderen und geben uns gegenseitig Feedback. Wir weisen auf Dinge wie logische Lücken, abgehackte Abläufe, unklare Punkte, schlecht formulierte Sätze und so weiter hin.Wir lassen unsere Leser sogar wissen, dass jeder Artikel nicht das Werk einer einzelnen Person ist. Vielmehr ist er das Werk vieler Menschen, die zusammenarbeiten, um ihn großartig zu machen.Auch wenn du allein arbeitest, kannst du dich von einer anderen Person beraten lassen. Das kann dein Ehepartner, deine Familie oder sogar dein Kollege sein. Schließe dich bei Bedarf Schreibgemeinschaften an.Deren Beiträge werden deine Arbeit viel besser machen.12. Beantworte Fragen, die andere stellenWenn Menschen nach Antworten auf ihre Fragen suchen, weißt du, dass diese Fragen gute Themen sind, über die du schreiben könntest.Der einfachste Weg, diese Fragen zu finden, ist die Verwendung eines kostenlosen Keyword-Recherche-Tools. Und so geht’s:Rufe das kostenlose Keyword-Generator-Tool von Ahrefs auf.Gib ein breites Thema ein, das mit deiner Nische oder Website zusammenhängt (z.B. Kaffee, Tee).Aktiviere die Registerkarte Fragen.Es wird eine Liste von Fragen zu dem von dir eingegebenen Thema angezeigt. Diese Fragen werden in der Reihenfolge des Suchvolumens aufgelistet, d.h. wie oft im Monat durchschnittlich nach deinem Zielkeyword gesucht wird.Je höher das Suchvolumen ist, desto mehr Menschen suchen danach.Schau dir die Liste an und notiere dir alle relevanten Fragen, die du möglicherweise mit einem Blogbeitrag beantworten könntest.Empfohlene Lektüre: Keyword-Recherche: Der Anfängerleitfaden von Ahrefs13. Führe eine Ideen-SammlungWie kommst du immer wieder auf einzigartige Blickwinkel und Ideen für deine Inhalte?Die einfache Antwort ist, dass du als Autor immer recherchieren solltest. Ob Bücher, YouTube-Videos, Artikel oder Podcasts — du solltest Inhalte konsumieren und dein Wissen auf deinem Gebiet erweitern.Anschließend solltest du dein neu erworbenes Wissen in einer Ideen-Sammlung aufbewahren.Was ist ein Ideen-Sammelbuch?Laut Ryan Holiday ist ein Ideen-Sammelbuch Folgendes:… eine zentrale Ressource oder ein Aufbewahrungsort für Ideen, Zitate, Anekdoten, Beobachtungen und Informationen, auf die du in deinem Leben und bei deinen didaktischen Bemühungen stößt. Der Zweck des Buches ist es, diese wertvollen Einfälle aufzuzeichnen und zu organisieren, um sie später in deinem Leben, in deinem Geschäft, beim Schreiben, Sprechen oder was auch immer du tust, zu nutzen. Mit diesem Hilfsmittel an deiner Seite musst du nicht mehr nach Ideen suchen, wenn es Zeit zum Schreiben ist. Ziehe sie einfach aus deinem Ideen-Sammelbuch heraus.Ich persönlich führe mein Ideen-Sammelbuch auf Notion. Hier ein kleiner Einblick, wie es aussieht:Dies ist meine erste Anlaufstelle, bevor ich einen meiner Blogbeiträge verfasse.FazitUm tolle Inhalte zu schreiben, muss man schreiben.Aber wenn du auf eine Inspiration wartest, bevor du etwas zu Papier bringst, wirst du nie etwas veröffentlichen. Stattdessen empfehle ich dir, einen Content-Kalender zu erstellen. Dabei handelt es sich im Grunde um einen Zeitplan, in dem du festlegst, wann du neue Inhalte und welche Inhalte du veröffentlichen möchtest.Die Festlegung von Terminen sorgt dafür, dass du ernsthaft bleibst, verhindert das Aufschieben von Inhalten und verpflichtet dich zur Veröffentlichung.Wie der berühmte Dichter Somerset Maugham einmal sagte:Ich schreibe nur, wenn ich inspiriert werde. Zum Glück werde ich jeden Morgen um Punkt neun Uhr inspiriert. Habe ich wichtige Tipps zum Schreiben von Inhalten ausgelassen? Lass es mich auf Twitter wissen. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Si Quan Ong Marketing @ Ahrefs. Ich lese, mache Breakdance und versuche zufäliige Lebensexperimente.",
  "headers": [
    {
      "level": "H1",
      "text": "Was ist Content Writing? 13 Tipps für die Erstellung großartiger Inhalte"
    },
    {
      "level": "H2",
      "text": "Was ist Content Writing?"
    },
    {
      "level": "H2",
      "text": "Warum ist Content Writing wichtig?"
    },
    {
      "level": "H2",
      "text": "Best Practices für Content Writing"
    },
    {
      "level": "H3",
      "text": "1. Verwende eine Vorlage"
    },
    {
      "level": "H3",
      "text": "2. Erstelle eine bewährte Gliederung"
    },
    {
      "level": "H3",
      "text": "3. Mach deinen Content “teilenswert”"
    },
    {
      "level": "H3",
      "text": "4. Gib deinem Beitrag einen einzigartigen Blickwinkel"
    },
    {
      "level": "H3",
      "text": "5. Baue Glaubwürdigkeit auf"
    },
    {
      "level": "H3",
      "text": "6. Zeigen, nicht erzählen"
    },
    {
      "level": "H3",
      "text": "7. Formuliere eine fesselnde Überschrift"
    },
    {
      "level": "H3",
      "text": "8. Starte dein Intro mit der PAS-Formel"
    },
    {
      "level": "H3",
      "text": "9. Mache deinen Beitrag mit der KKML-Formel leicht lesbar"
    },
    {
      "level": "H3",
      "text": "10. Schreibe so, wie du sprichst"
    },
    {
      "level": "H3",
      "text": "11. Hole Feedback zu deinem Text ein"
    },
    {
      "level": "H3",
      "text": "12. Beantworte Fragen, die andere stellen"
    },
    {
      "level": "H3",
      "text": "13. Führe eine Ideen-Sammlung"
    },
    {
      "level": "H3",
      "text": "Fazit"
    }
  ],
  "author": "Si Quan Ong"
}