{
  "url": "https://ahrefs.com/blog/de/content-marketing/",
  "slug": "content-marketing",
  "title": "Content Marketing: Ein umfassender Leitfaden für 2021",
  "description": "Content Marketing hilft dir, Kunden zu gewinnen, mit ihnen zu interagieren, sie zu konvertieren und an dein Unternehmen zu binden - Kunden, die du sonst vielleicht nicht erreicht hättest. Hier erfährst du, wie du loslegen kannst.",
  "content": "Fio Dossetto Content Marketing Editor. Großer Ahrefs Fan. Leidenschaftlich Leuten dabei zu helfen großartigen Content zu erstellen, der einer Zielgruppe wirklich weiter hilft. Inhalt Content Marketing hilft dir dabei, Kunden zu gewinnen, mit ihnen zu interagieren, sie zu konvertieren und an dein Unternehmen zu binden — Kunden, die du sonst vielleicht nicht erreicht hättest. Zudem war es noch nie so beliebt und gefragt wie heute — wenn du auf diesen Zug noch nicht aufgesprungen bist, sind es deine Mitbewerber vermutlich schon längst.Dieser Leitfaden hilft dir zu verstehen, was Content Marketing ist, und zeigt dir, wie du dessen Vorteile deinen Marketing-Kollegen erklärst und am besten damit loslegst. Wir haben auch die Ideen und Tipps von 15 Content-Marketing-Experten eingefügt, um dir den besten Vorsprung für 2021 und darüber hinaus zu verschaffen.Wir behandeln:Was ist Content Marketing?Warum ist Content Marketing wichtig?3 häufige Einwände gegen Content Marketing30+ Arten von Content Marketing5 Beispiele für effektives Content Marketing15 Content-Marketing-Tipps von Experten, die du dieses Jahr nutzen kannst Was ist Content Marketing?Content Marketing ist der Prozess des Erstellens und Verbreitens von Content, um Kunden zu gewinnen und zu binden, so dass du deinen Umsatz steigern und letztendlich dein Unternehmen ausbauen kannst.Unsere Content-Marketing-Strategie bei Ahrefs ist einfach und effektiv: Wir erstellen ausführliche Blogartikel und YouTube-Videos, die potenziellen und bestehenden Kunden zeigen, wie sie mithilfe unserer Tools Probleme lösen und den Website-Traffic steigern können. Wir setzen in erster Linie auf Suchmaschinenoptimierung (SEO), um qualifizierten Traffic auf unsere Website zu bringen, die derzeit ~400.000 organische Besucher pro Monat verzeichnet:Bloggen und YouTube funktionieren zwar für Ahrefs, aber es gibt noch viele weitere Content-Marketing-Formate, die du je nach Zielgruppe, Ressourcen und Zielen einsetzen kannst (mehr dazu weiter unten).Warum ist Content Marketing wichtig?Content Marketing ist eine Möglichkeit, um Kunden zu gewinnen, mit ihnen zu interagieren, sie zu konvertieren und an dein Unternehmen zu binden. Wir kennen mindestens fünf zwingende Gründe, um in Content Marketing zu investieren: Schaffe Aufmerksamkeit und ziehe potenzielle Kunden an Setze auf Customer Engagement und baue Glaubwürdigkeit aufKonvertiere KundenBaue Kundenloyalität und ‑bindung aufContent Marketing erzielt kumulierende Erträge (und ist auf lange Sicht günstig)Ich werde jeden dieser Punkte anhand eines Beispiels durchgehen, das zeigt, wie Ahrefs Content Marketing betreibt; weitere Beispiele aus verschiedenen Branchen findest du im Abschnitt “Beispiele” weiter unten.1. Content Marketing hilft dir, Aufmerksamkeit zu erzeugen und potenzielle Kunden zu gewinnenWenn Personen ein Problem haben, das sie lösen wollen, oder einen Wunsch, den sie sich erfüllen möchten, werden sie deine Marke und Produkte nicht in Betracht ziehen, wenn sie gar nicht wissen, dass diese existieren. Content Marketing ist eine Möglichkeit, um sicherzustellen, dass sie dich entdecken.Bei Ahrefs helfen wir zum Beispiel den Leuten dabei, mehr Traffic auf ihre Websites zu erzielen. Aber es ist unwahrscheinlich, dass sie bei Google direkt nach “Ahrefs” suchen, weil sie unser Tool wahrscheinlich noch gar nicht kennen; sie beginnen ihre Reise in der Regel, indem sie nach etwas googeln, das sie ihrem Ziel näher bringt, wie beispielsweise “Website Traffic steigern”. Durch Content Marketing können wir bei dieser Suchanfrage aufscheinen und eine erste mentale Verbindung zwischen Ahrefs und dem Problem, das sie lösen wollen, herstellen.2. Content Marketing hilft dir, das Customer Engagement zu erhöhen und Glaubwürdigkeit aufzubauenNur weil jemand von deiner Existenz weiß, bedeutet das noch lange nicht, dass sich diese Person auch für deine Marke oder dein Produkt entscheiden wird. Wenn du aber beim zweiten, dritten und vierten Mal, wenn sie nach Ideen oder Lösungen suchen, mit ansprechendem und vertrauenswürdigem Content aufscheinst, erhöhst du deine Chancen.Um das vorherige Beispiel fortzusetzen: Nehmen wir an, jemand hat sich über SEO informiert und sucht nun nach etwas Speziellerem, z.B. “wie macht man eine Keyword Recherche”. Da wir einen Beitrag zu diesem Thema geschrieben haben und bei Google ganz oben ranken, werden wir gefunden — wieder einmal.Das Gleiche gilt für YouTube. Wir haben ein Video über Keyword-Recherche, so dass Suchende gar nicht anders können, als auf unsere Marke zu stoßen, wenn sie nach diesem Thema suchen. unser 10-Minuten-Tutorial zum Thema Keyword-RechercheWenn diese Person internen Links folgt oder weiter sucht, wird sie wahrscheinlich auf unser Keyword-Generator-Toolstoßen, mit dem man kostenlos Tausende von Keyword-Ideen finden kann, während man einen Vorgeschmack bekommt, was Ahrefs leisten kann (und ja: kostenlose Tools sind auch gute Beispiele für Content-Marketing).3. Content Marketing hilft dir, Kunden zu konvertierenSelbst wenn deine potenziellen Kunden wissen, wer du bist und was du anbietest, haben sie vielleicht noch ein paar Bedenken, bevor sie sich für dich entscheiden. Hier kann Content Marketing den letzten Anstoß geben, damit sich Leute dafür entscheiden, auch tatsächlich Kunden zu werden. Zum Beispiel ist Ahrefs nicht das einzige SEO-Tool auf dem Markt, und unsere potenziellen Kunden möchten vielleicht wissen, wie wir im Vergleich zur Konkurrenz dastehen, bevor sie sich für ein Ahrefs-Abonnement entscheiden. Wir haben Content erstellt, der direkt auf dieses Bedürfnis ausgerichtet ist — und die Leute können ihn finden, indem sie unseren Namen und den eines Mitbewerbers googeln (zum Beispiel “Ahrefs vs. Moz”).Wenn wir alle Fragen und Bedenken überzeugend abgedeckt haben, und basierend auf allem anderen, was sie bereits über uns wissen, sollte der CTA zu unserer 7‑Dollar-Testversion der letzte Anstoß sein, den sie brauchen: 4. Content Marketing hilft dir, Kundenloyalität und ‑bindung aufzubauenDas oberste Ziel von Content Marketing ist es schließlich, den Umsatz zu steigern und ein Unternehmen wachsen zu lassen. Es geht also um mehr als nur darum, einen Verkauf zu realisieren: Es hilft dir auch dabei, deine bestehenden Kunden einzubinden bzw. das Customer Engagement zu erhöhen und deine Kunden zu informieren, was zur Kundenbindung und Markentreue beiträgt.Bei Ahrefs erstellen wir für diesen Schritt nun keinen speziellen Blog-Content. Da wir uns immer darauf konzentrieren, spezifische Probleme zu lösen und unsere Leser weiterzubilden, funktioniert unser Content für potenzielle und bestehende Kunden gleichermaßen. Allerdings haben wir auch einen speziellen Hilfebereich, der sich eher an unsere Kunden richtet, wo wir ihnen dabei helfen, die Daten zu verstehen, die sie in unserem Tool einsehen und wie sie davon profitieren können. Das ist wichtig für die Kundenbindung, denn wenn sie den Mehrwert, den wir bieten, nicht verstehen, ist es unwahrscheinlich, dass sie uns Monat für Monat weiter bezahlen.5. Content Marketing erzielt kumulierende Erträge (und ist auf lange Sicht günstig)Im Gegensatz zu anderen Kanälen und Maßnahmen wie beispielsweise bezahlte Werbung (Paid Advertising), die stillstehen, sobald man aufhört, in sie zu investieren, erzielt Content Marketing eine aufbauende Rendite auf die anfängliche Investition.Um die Dinge etwas zu vereinfachen: Wenn du heute 1000 Euro für Anzeigen ausgibst, um 100 Besucher auf deinen Blog zu bringen, musst du morgen weitere 1000 Euro ausgeben, um das gleiche Ergebnis zu erzielen. Wenn du aber 1000 Euro für die Erstellung eines optimierten Content-Beitrags ausgibst, kann derselbe Beitrag noch Monate und sogar Jahre nach seiner Veröffentlichung Traffic auf deine Website bringen.In unserem Fall rankt dieser Blog für 170.000 organische Keywords und verzeichnet geschätzte 385.000 Besucher pro Monat. Wenn wir versuchen würden, die gleiche Menge an Traffic über bezahlte Anzeigen zu erhalten, würden wir schätzungsweise 992.000 US-Dollar pro Monat ausgeben — das ist nicht annähernd der Betrag, den wir für die Erstellung von Content ausgeben.Empfohlener Artikel: Wie man eine erfolgreiche Content-Marketing-Strategie in 9 Schritten aufbaut3 häufige Einwände gegen Content Marketing und wie du ihnen begegnestInzwischen bist du vielleicht von der Idee des Content Marketings bereits überzeugt — aber das bedeutet nicht, dass deine Marketingleitung und/oder deine Stakeholder das auch sind.In Diskussionen über Content Marketing tauchen häufig einige Einwände auf, die du entkräften musst, um die Zustimmung für deine Projekte zu erhalten:Bezahlte Werbung zieht mehr Besucher und Kunden an — und das schnellerEs dauert zu lange, bis man Ergebnisse sieht Der ROI ist schwierig zu messen 1. Bezahlte Werbung zieht mehr Besucher und Kunden an — und das schnellerBezahlte Werbung (Paid Advertising) ist in der Tat eine schnelle (wenn auch teure) Möglichkeit, Traffic zu generieren: Sobald du dafür bezahlt hast, dass eine Werbeanzeige vor den Augen der Leute platziert wird, und vorausgesetzt, dein Targeting stimmt, wird der Traffic anfangen zu fließen.In den meisten Fällen leiten bezahlte Anzeigen jedoch Besucher auf Seiten, die sich im unteren Ende deines Marketing-Funnels befinden und auf eine sofortige Conversion ausgerichtet sind, wie z. B. Landing- oder Produktseiten. Indem du den Traffic dorthin leitest, kannst du vielleicht einen Verkauf realisieren, aber nur von Personen, die auch tatsächlich zum Kauf bereit sind — alle anderen entgehen dir.Wenn zum Beispiel jemand nach “Wie steigert man den Website-Traffic?” sucht, befindet sich diese Person vermutlich im Lernmodus (und nicht im Kaufmodus). Wir könnten zwar bezahlte Anzeigen für dieses Keyword schalten und die Suchenden auf eine spezielle Landing Page leiten, aber wir würden wahrscheinlich Geld für Besucher verschwenden, bei denen es unwahrscheinlich ist, dass sie zu Kunden konvertieren, weil sie noch nicht zum Kauf bereit sind.Im Gegensatz dazu hilft uns Content Marketing, Kunden über den gesamten Funnel hinweg zu gewinnen, zu binden und zu konvertieren. Ein erfreuliches Nebenprodukt dieses Prozesses ist, dass dadurch die Markenbekanntheit und das Vertrauen aufgebaut werden, sodass unsere bezahlten Anzeigen wahrscheinlich dann effektiver sind, wenn diese Personen auch tatsächlich zum Kauf bereit sind.ein beworbener Facebook-Beitrag für unseren Leitfaden zur WettbewerbsanalyseAnstatt sich in einen Kampf zwischen bezahlten Anzeigen und Content Marketing zu verstricken, ist es klüger, beides zusammen zu nutzen, um sowohl kurz- als auch langfristige Ergebnisse zu maximieren.2. Es dauert zu lange, bis man Ergebnisse siehtWenn du “Ergebnisse” nur als Verkäufe oder Leads definierst, dann ja: Beim Content Marketing kann es länger dauern, bis man Ergebnisse sieht als bei unmittelbareren Kanälen wie Paid Advertising (siehe Einwand 1).Aber nur weil etwas länger dauert als etwas anderes, bedeutet das nicht, dass es sinnlos ist. Es ist beispielsweise schneller, um einen Berg herumzufahren, als einen Tunnel zu bauen. Wenn man den Tunnel aber einmal gebaut hat, kann man in einem Bruchteil der Zeit hindurchfahren — jedes Mal.Beim Content Marketing ist es ähnlich: Es braucht Zeit, um aufgebaut zu werden, aber schließlich wird es zu einer Quelle beständiger Umsätze und Leads. Und wenn du erst einmal ein etabliertes Publikum hast, kann Content Marketing vergleichsweise schneller zu Ergebnissen führen, als wenn du bei Null anfängst.3. Der ROI ist schwierig zu messenDer genaue ROI von Content Marketing kann in der Tat schwer zu messen sein; man müsste ein sehr ausgeklügeltes Attributionsmodell erstellen, um den Einfluss und die Wirkung deines Contents über den gesamten Funnel hinweg zu erfassen, während man gleichzeitig jede Variable isoliert. Es gibt jedoch spezifische Metriken, die du für jede Stufe deines Marketing-Funnels erfassen und für eine Teilberechnung des ROI verwenden kannst:Quelle: CMI.Ebenso ist es nicht schwer, den ROI von SEO-getriebenem Content Marketing abzuschätzen. Du kannst das Traffic-Potenzial und den Wert der Top-Ranking-Ergebnisse heranziehen und berechnen, wie viel es dich kosten wird, einen Artikel zu schreiben, zu verbreiten und zu bewerben, verglichen damit, wie viel qualifizierten Traffic er im Laufe der Zeit generieren kann.Empfohlenes Video: Unser CMO Tim Soulo erklärt den Wert von Content MarketingArten von Content MarketingEs gibt viele verschiedene Formen des Content Marketings:BlogbeiträgePodcastsVideoInfografikenKostenlose ToolsTemplatesE‑BooksChecklisten… die Liste geht noch weiter. Möglicherweise bist du dazu geneigt, von allem ein bisschen zu machen, in der Hoffnung, mehr Personen zu erreichen. Wir empfehlen dir aber, einen strategischeren Ansatz zu wählen: Konzentriere dich auf zwei bis drei Formate, die wahrscheinlich den größten Einfluss auf dein Business haben werden.Bei uns ist der Blog unser langjährigstes Content-Format. Wir wissen, dass unsere Zielgruppe bestehend aus SEOs, Marketern und Bloggern ihre Informationen bei Google sucht. Deshalb stellen wir sicher, dass wir Evergreen-Contenterstellen, der rankt und uns gezielten Traffic zurückbringt. Da es manchmal einfacher ist, etwas in einem Video zu erklären, vor allem, wenn man die Funktionsweise eines Tools demonstrieren will, erstellen wir auch Videos, die wir in unsere geschriebenen Beiträge einbetten und auf YouTube veröffentlichen. Wenn du weißt, dass deine Zielgruppe hauptsächlich Google nutzt, um Probleme zu lösen oder Ideen zu finden, könntest du unseren Blogging-Erfolg wiederholen, indem du mittels SEO Traffic für deinen Content generierst — in 3 Schritten:Finde Themen, die für dein Unternehmen relevant sindErstelle den ContentBewirb deinen Content1. Finde Themen, die für dein Unternehmen relevant sindÜberleg dir, was Personen bei Google eingeben könnten, um dich zu finden: Das ist dein Seed-Keyword. Wenn du zum Beispiel analoge Fotoausrüstung verkaufst, könnte es für den Anfang einfach “35mm Film” sein.Gib dieses Keyword in den Keyword Explorer von Ahrefsein und sieh dir den Questions-Report an, der dir Content-Ideen in Form von Fragen liefert. Notiere alle Fragen, die du in einem Blogbeitrag beantworten kannst. Empfohlener Artikel: Wie man Keyword-Recherchen für SEO durchführt2. Erstelle die richtige Art von ContentSobald du ein Keyword ausgewählt hast, solltest du sicherstellen, dass der von dir erstellte Content den Erwartungen der Suchenden entspricht. Dies wird als Suchintention bezeichnet, die du anhand der Top-Ranking-Ergebnisse ermitteln kannst:In diesem Beispiel wirst du feststellen, dass es sich bei den Ergebnissen um Schritt-für-Schritt-Anleitungen handelt, die sich auf den Bereich “zuhause” beziehen — was uns sagt, dass die meisten Suchenden wahrscheinlich Amateurfotografen und keine Profis sind. Deshalb sollte dein Content auch darauf ausgerichtet sein.Wo es relevant ist, solltest du dein(e) Produkt(e) natürlich im Artikel präsentieren und vorführen. Beispielsweise führen B&H Photo Video in ihrem Artikel über das Entwickeln von Filmen zu Hause Schritt für Schritt durch den Prozess und verlinken dabei auf relevante Produktseiten. Anmerkung der RedaktionBeinahe über unseren gesamten Content hinweg, einschließlich dieses Leitfadens, fügen wir Screenshots aus dem Ahrefs-Dashboard hinzu, damit du sehen kannst, wie du unsere Tools zur Erreichung deiner Ziele einsetzen kannst.Joshua HardwickHead of ContentEmpfohlener Artikel: Was ist suchmaschinenoptimiertes Schreiben?3. Bewirb deinen ContentSobald dein Content bereitsteht, kannst du ihn an deine Zielgruppe aussenden, z. B. an deinen E‑Mail-Verteiler und/oder an Personen, die dir in den sozialen Medien folgen. In unserem Fall können wir auch ein paar hundert Dollar ausgeben, um den Beitrag mittels Facebook- oder Twitter-Anzeigen zu bewerben:Aber das sind nicht die einzigen Möglichkeiten, um deinen Content zu bewerben: Gehe diese Content-Promotion-Checkliste durch, damit mehr Leute deinen Content sehen. 5 Content-Marketing-Beispiele, von denen du lernen kannstBloggen ist eine großartige Möglichkeit, um Content zu erstellen, der deine Zielgruppe anspricht und anzieht, aber auch andere Formate können genauso erfolgreich sein — es hängt alles von deiner Zielgruppe ab und davon, wie sie nach Informationen sucht und diese konsumiert. Hier sind fünf Beispiele für effektives Content Marketing, die nichts mit Bloggen zu tun haben:Die YouTube-Videos von Fix.comDie Facebook-Community von NaturaliciousDer Podcast von 15FiveDas virtuelle Spielzimmer und die Aktivitätsblätter von MattelDie Academy-Kurse von Balsamiq1. Die YouTube-Videos von Fix.comKurzstatistik → 30.000 YouTube-Abonnenten, 16 Millionen VideoaufrufeWas sie tun → Fix.com ist eine E‑Commerce-Website für Geräteteile, die mithilfe von Video-Tutorials auf YouTubepotenzielle und bestehende Kunden schult. Durch die Bereitstellung hilfreicher Schritt-für-Schritt-Videos vermittelt Fix.com Fachwissen, baut Vertrauen auf und macht es den Kunden einfach, das zu finden, was sie benötigen.Warum es funktioniert → Auf vielen Google-SERPs für Suchanfragen zu Tutorials & Co. werden in den ersten Ergebnissen Videos angezeigt. Fix.com maximiert seine Chancen, mehr Sichtbarkeit und Bekanntheit zu erlangen, indem sie auf YouTube präsent sind. Die Videos und Beiträge, die Fix.com erstellt, sind dauerhaft relevant (Evergreen-Content), d.h. sie sorgen über Jahre hinweg für Traffic (was sie wiederum zu einer sehr rentablen Content-Marketing-Strategie macht). Wie du das auch tun kannst → Der Ansatz von Fix.com funktioniert gut, wenn dein Produkt oder deine Dienstleistung ein bestimmtes Problem löst (in diesem Beispiel: defekte Geräte). Führe eine Keyword-Recherche durch, um herauszufinden, wobei deine Zielgruppe Hilfe benötigt, und erstelle Content in dem Format, das ihnen am besten dabei hilft, das zu erreichen, was sie brauchen.2. Die Facebook-Community von NaturaliciousKurzstatistik → 11.000 Facebook-GruppenmitgliederWas sie tun → Naturalicious, ein Unternehmen für natürliche und biologische Haarpflege, betreibt eine private Facebook-Communitynamens “The Nation”, die von Gründerin und CEO Gwen Jimmere betreut wird. Warum es funktioniert → Mit praktischen Anleitungen und Live-Sessions unterstützt und befähigt “The Nation” seine Kunden dabei, das Beste aus den Produkten von Naturalicious herauszuholen. Darüber hinaus erzeugt die Gruppe ein Gemeinschaftsgefühl, da die Mitglieder sich gegenseitig aktiv unterstützen und helfen, indem sie Schönheitstipps, Ratschläge und Ermutigungen untereinander austauschen. Wie du das auch tun kannst → Der Ansatz von Naturalicious eignet sich ideal für Unternehmen, die eine bestimmte demografische Zielgruppe ansprechen (in diesem Beispiel Schwarze Frauen und/oder Frauen mit stark gekraustem Haar). Durch die Schaffung einer Community kannst du eine wechselseitige Konversation mit bestehenden und potenziellen Kunden führen, und dabei erfahren, was ihnen am wichtigsten ist, während du dein Produkt oder deine Dienstleistung mit der Community selbst in Verbindung bringst.3. Der Podcast von 15FiveKurzstatistik → 220 Backlinks, 165 organische Keywords auf die Podcast-LandingpageWas sie tun → 15Five ist eine Plattform für Mitarbeiter-Performance-Management, die Managern dabei hilft, dass ihre Teams zufrieden und motiviert bleiben. In ihrem “Best-Self-Management”-Podcastinterviewen die 15Five-Mitbegründer führende Unternehmens- und HR-Leiter, um Einblicke und Inspirationen für den Aufbau einer exzellenten Unternehmenskultur zu erhalten. Warum es funktioniert → Der Podcast dreht sich ganz um die zu erledigende Aufgabe, die mit der Software gelöst wird: Mitarbeiter und Teams bei der Arbeit zu unterstützen, damit sie ihr Bestes geben können. Durch das Interviewformat werden Expertise und Inspiration ausgegliedert und Markenassoziationen zwischen 15Five und der Aufgabe, bessere, leistungsstärkere Teams zu schaffen, erzeugt.Außerdem rankt die Podcast-Landingpage auf Seite 1 für “Management-Podcast” und ist damit für die Zielgruppe des Unternehmens leicht zu finden:Wie du das auch tun kannst → Der Ansatz von 15Five kann gut funktionieren, wenn deine Zielgruppe Podcasts hört und dein Business mit einem bestimmten Lebensstil, Hobby, Ehrgeiz oder einer zu erledigenden Aufgabe in Verbindung steht. Indem du Experten einlädst, kannst du dich und deine Marke als Kurator von Wissen positionieren und gleichzeitig die Netzwerke deiner Gäste nutzen, um deine Arbeit zu erweitern.4. Das virtuelle Spielzimmer und die Aktivitätsblätter von MattelKurzstatistik → 21.000 Backlinks, 4.800 Facebook-SharesWas sie tun → Im März 2020 reagierte der Spielzeughersteller Mattel (bekannt für seine Marken Barbie, Hot Wheels und Fisher-Price) auf COVID-19, indem er einen virtuellen Spielraummit kostenlosen Spielen und herunterladbaren PDF-Aktivitätsblätter für Kinder und Familien einrichtete.Warum es funktioniert → Mit seiner kostenlosen Unterhaltungsplattform hat Mattel eine enorme Presseberichterstattung und Backlinks erzielt, die zu Referral-Traffic (Empfehlungs-Traffic) führen. Die Aktivitätsblätter stärken die Marke Mattel als Marktführer im Bereich Kinderunterhaltung und helfen, das Leben ihrer Kunden (in diesem Fall Eltern und Kinderbetreuer) einfacher zu gestalten.Wie du das auch tun kannst → Erstelle Content, der es erlaubt, dass Leute einen Teil deines Produktes kostenlos erleben dürfen.Ein ähnliches Beispiel hierfür sind unsere Webmaster Tools: Sie bieten Website-Betreibern kostenlosen (aber begrenzten) Zugang zu zwei unserer beliebtesten Tools: Site Explorer & Site Audit. Es geht nicht darum, alles zu verschenken, sondern darum, zu unterstützen — und das kann in weiterer Folge dafür sorgen, dass diese Marke potenziellen Kunden als erstes in den Sinn kommt, wenn sie in Zukunft einen Kauf tätigen möchten. 5. Die Academy-Kurse von BalsamiqKurzstatistik → 8.000 organische Keywords, 12.000 organische monatliche Besucher, 24.900 US-Dollar monatlicher Traffic-WertWas sie tun → Wireframing Tool Balsamiq hat eine eigene Academyund ein Lernzentrum eingerichtet, um die Kenntnisse potenzieller und bestehender Kunden zu erweitern und zu vertiefen.Warum es funktioniert → Die Balsamiq Wireframing Academy erhöht die Markenbekanntheit durch optimierte Lernressourcen, die in den SERPs bei Suchanfragen wie “Was ist ein Wireframe?” und “Content-First-Ansatz” angezeigt werden. Hierbei handelt es sich um typische Suchanfragen von jemandem, der sich in einer Recherchephase befindet, und Balsamiq erscheint als erste Anlaufstelle für potenzielle Kunden.Wie du das auch tun kannst → Der Ansatz von Balsamiq funktioniert hervorragend, wenn dein Produkt für Profis oder erfahrene Benutzer konzipiert ist. Durch die Bereitstellung kompletter Schulungsprogramme hilfst du Coach-Anfängern, die spezifischen Fähigkeiten zu erlernen, die sie benötigen, um einen Nutzen aus deinem Produkt zu ziehen, während du gleichzeitig Fachwissen in der Branche aufbaust. Wir verfolgen mit den kostenlosen Kursen der Ahrefs Academyeinen ähnlichen Ansatz. Empfohlener Artikel: 7 inspirierende Content-Marketing-Beispiele (und wie man sie nachmacht)15 Content-Marketing-Tipps von Experten, die du dieses Jahr nutzen kannstEs gibt nicht nur eine Art und Weise, Content Marketing zu betreiben. Deshalb dachten wir, es wäre gut, diesen Leitfaden mit einem Querschnitt von Leuten abzuschließen, die die Content-Marketing-Theorie täglich in die Praxis umsetzen.Wir haben Experten aus verschiedenen Branchen gebeten, diese Frage zu beantworten: “Basierend auf Ihren Erfahrungen, was ist die EINE Sache, die Sie Unternehmen und Marketern empfehlen, um herausragendes Content Marketing im kommenden Jahr zu betreiben?” Du wirst feststellen, dass sich einige der Tipps natürlich widersprechen — und das ist das Tolle am Content Marketing: Man kann völlig gegensätzliche Wege gehen und trotzdem Erfolg haben, weil es nur darum geht, was für die eigene Zielgruppe funktioniert.Diese Profis haben ihre Ratschläge mit uns geteilt: Al Chen, Solutions Architect, CodaLauren Hall, Brand Marketing Associate, PrivyTom Cox, Content Marketer, PreplyJoei Chan, Content Director, 360LearningOlivia Blazevic, Content Marketing Manager, CandlefoxAazar Ali Shad, Head of Growth, UserpilotFio Dossetto, die auch den Artikel geschrieben hat, den du gerade liestAlina Benny, Content Lead, NextivaTracey Wallace, Director of Marketing, MarketerHireHiba Amin, Marketing Manager, SoapboxTim Soulo, CMO, AhrefsStephanie Bregman, CMO, Manly BandsFadeke Adegbuyi, Senior Content Marketing Manager, DoistLouis Grenier, Founder, EveryoneHatesMarketersLen Markidan, Chief Marketing Officer, PodiaBetreibe Kundenrecherche und führe Gespräche mit ihnenBevor du mit der Erstellung des Contents beginnst, solltest du eine Benutzerforschung (User Research) mit deinen bestehenden Kunden/Nutzern oder mit potenziellen Kunden durchführen. So erfährst du aus erster Hand, wie dein ideales Kundenprofil (Ideal Customer Profile — ICP) aussieht und welches Problem deine Zielgruppe glaubt, mit deinem Produkt oder deiner Dienstleistung lösen zu können. Wenn du mit der Content-Erstellung beginnst, kannst du die tatsächlichen Wörter und Phrasen verwenden, die dein “idealer Kunde” verwendet hat. Du kannst sie natürlich optimieren, indem du einige Basis-Recherchen im Ahrefs Keyword Explorer durchführst und sicherstellst, dass die Keywords ein gutes Volumen haben, oder herausfindest, ob es andere gibt, die du einbeziehen solltest. Es gibt keine bessere Möglichkeit, als mit deinen Kunden zu sprechen, um herauszufinden, welcher Content sie am meisten ansprechen würde! Al Chen, Solutions Architect CodaVerwerte deinen Content neuSuche immer nach kreativen Möglichkeiten, um den Content, den du bereits hast, für einen neuen Zweck wiederzuverwenden. Denke daran: Die Leute sind faul. Je einfacher du es ihnen also machen kannst, deinen Content zu konsumieren, desto besser. Das bedeutet, dass die Art und Weise, wie du die Dinge verpackst, wichtig ist. Hast du die Möglichkeit, die Informationen aus deinen besten Blogbeiträgen in ein Buch zu verwandeln? Wenn du einen Podcast hast, hast du einen Leitfaden der besten Episoden für neue Zuhörer? Überlasse es nicht deinen Nutzern, deinen Content zu sortieren. Du bist der Experte — du solltest die schwere Arbeit machen.Lauren Hall, Brand Marketing Associate PrivyFokussiere deine Bemühungen auf Personen, die dich brauchen, es aber noch nicht wissenOftmals konzentrieren wir Content Creator uns auf die Erstellung von Content-Beiträgen mit hohem Suchvolumen, und vernachlässigen dabei die Keywords, mit denen Personen unsere Produkte finden.Finde Keywords mithilfe deines PPC-Teams und mittels Brainstorming in Bezug auf alle Bedürfnisse, die dein Produkt direkt löst. Bei Preply bieten wir Privatunterricht mit Online-Tutoren an: Wir haben also Content zum Thema “Online-Englischkurse”, in dem sogar einige unserer Mitbewerber erwähnt werden, da wir natürlich nicht die einzige Sprachlernplattform auf dem Markt sind. Die Nutzer wollen sich aber sicher fühlen, dass sie alle Optionen recherchieren und ihre eigene Wahl treffen, und wir stellen fest, dass diese Transparenz mehr potenzielle Schüler auf unsere geldbringenden Seiten bringt. Folge dem Credo: Work smart rather than hard. Dann wirst du auch die Ergebnisse sehen, an denen sich “herausragender” Content messen lassen sollte: an neuen Kunden und unmittelbaren Auswirkungen auf das Business.Tom Cox, Content Marketer PreplyTeste und wiederhole die Formate, die am besten zur Erreichung deiner Ziele beitragen Die Marketingwelt verändert sich schnell und Content muss sich entsprechend anpassen. Man wächst nicht auf die gleiche Art und Weise, wenn man von 0 auf 1 geht, und nicht, wenn man von einem Scale-up zu einem Einhorn wächst. Content muss sich an die jeweiligen Geschäftsanforderungen anpassen und deine Strategie sollte alle paar Monate überprüft werden.Am Anfang dieses Jahres konzentrierte ich mich auf den Aufbau von Traffic und arbeitete an SEO und Top-of-Funnel-Content. Diese Ziele habe ich erreicht, aber gleichzeitig habe ich ein neues Problem geschaffen: die Conversion. Deshalb stelle ich jetzt einen Vollzeit-Redakteur ein, der an Bottom-of-Funnel-Content arbeitet und unsere Sales-Follow-up-E-Mails optimiert.Ein anderes Beispiel: Wir dachten, wir hätten unsere Wunderwaffe gefunden — Webinare — da sie sich gut zur Lead-Generierung eigneten. Also dachten wir, wenn wir sie verdoppeln würden, würden wir doppelt so viele Ergebnisse erzielen. Das war nicht der Fall. Wir verzeichneten sinkende Erträge.Das ist nur eine sehr lange Art zu sagen: Jedes Mal, wenn du deinen Content-Meilenstein erreichst, schaffst du neue Herausforderungen und du brauchst neuen Content oder neue Strategien, um diese zu lösen.Joei Chan, Content Director 360LearningAppelliere an die Grundwerte deiner Zielgruppe Der Aufbau einer vertrauenswürdigen Marke, die zu den Konsumenten eine Verbindung herstellt, wird im Jahr 2021 wichtiger denn je sein. Markenkontakt allein ist nicht genug — Nutzer wollen mehr als nur eine Lösung für ihr Problem. Sie wollen sich mit Unternehmen beschäftigen, mit denen sie gemeinsame Werte teilen; Marken, die sich ihr Vertrauen erarbeitet haben. Markenaffinität umfasst diese neue Idee, eine Marke aufzubauen, indem man sich auf den Aufbau von “Befürwortern” konzentriert, statt auf ein passives Zielpublikum. Um Markenaffinität aufzubauen, erforschen wir die Idee von langem, “binge-worthy” Content, der die zentralen Werte unseres Nischen-Zielpublikums anspricht und diese bedeutungsvollen Beziehungen aufbaut. Es geht darum, diese “Super-Fans” aufzubauen, die dann zu Befürwortern werden und deine Community für dich ausbauen. Olivia Blazevic, Content Marketing Manager CandlefoxNutze Micro-ContentDerzeit werden wir darauf getrimmt, kurzen, auf den Punkt gebrachten Content zu kreieren. Und beim Content Marketing geht es vor allem darum, Menschen zu inspirieren und ihnen einen Mehrwert zu bieten: Wenn es also unser Ziel ist, Nutzern einen Mehrwert zu bieten, wenn sie ihn brauchen und das so schnell wie möglich, dann müssen wir anfangen, über Micro-Content nachzudenken. Denn weniger kann manchmal mehr sein.Überleg dir, wie dieses Konzept bei Videos Anwendung finden kann: YouTube wird nun zunehmend zu einer Suchmaschine, und mehr Personen sind es gewohnt, dort nach Informationen zu suchen. Ich denke also, dass jeder Blogbeitrag auch in sehr kurze Videos umgewandelt werden sollten.Aazar Ali Shad, Head of Growth UserpilotBeginne nicht direkt mit der TaktikContent-Marketing-Taktiken und ‑Formate mögen variieren, Kanäle entwickeln sich und verschwinden wieder, aber einige Dinge ändern sich nie — und das sind genau die, auf die du dich sehr stark konzentrieren solltest. Befolge diese 3 Schritte:Beginne mit einer Analyse- und Diagnosephase, in der es darum geht, zu verstehen, mit wem du interagierst, welche Probleme du versuchst, für diese Zielgruppe mit deinem Content zu lösen, und definiere die Herausforderung oder Chance, vor der du stehst.Anschließend folgt die Strategiephase, in der du die allgemeine Herangehensweise an deine Zielgruppe festlegst. Lege abschließend konkrete Taktiken fest, die du zur Umsetzung deiner Strategie einsetzen wirst. Das sind die, die im Jahr 2021 vielleicht anders aussehen als 2015, wie beispielsweise “wir sollten uns auf SEO und lange Beiträge konzentrieren” oder “wir sollten Instagram-Stories machen”.Diagnose kommt vor Strategie kommt vor Taktik. Doch allzu oft beginnen wir Content-Marketer direkt mit der Taktik (…weil es Spaß macht) — auf Kosten der beiden vorherigen Schritte — und wir haben vielleicht Glück und erzielen einen vorübergehenden Erfolg, aber das ist kein zuverlässiger, wiederholbarer Ansatz, um mit unserem Content einen nachhaltigen Effekt zu erzielen.Fio Dossetto, who also wrote the article you’re readingOptimiere bereits bestehenden ContentWir brauchen keinen neuen Content. Wenn mächtige Führungskräfte erklären, sie bräuchten mehr Blogs, mehr Landing Pages und eine konstante “Veröffentlichungs-Frequenz”, damit du deine Mitbewerber übertrumpfen kannst, dann lauf davon!Aus zwei Gründen:Du antwortest nicht sofort mit einem Ja oder einem Nein, um diese scheinbar harmlose Bitte zu bestätigen oder abzuschmettern. Die meisten Führungskräfte, die diesen Standpunkt vertreten, sind entweder dem Druck von anderen Führungskräften im Unternehmen ausgesetzt, die den Traffic-Krieg führen wollen, oder sie haben die Bedeutung des Langzeitspiels, das SEO ist, noch nicht herausgefunden.Daten. Du brauchst Daten, die dir aufzeigen, dass dein Content unterdurchschnittlich abschneidet oder sich Chancen in unmittelbarer Nähe befinden. Lege deine Strategie für minderwertigen Content fest, der nur wenige Seitenaufrufe, Backlinks oder geringes Customer-Engagement erzielt. Wenn du dich erst einmal in Ersteres eingefühlt hast und mit Letzterem bewaffnet bist, fällt es leichter, für mehr Optimierung und nicht für neuen Content zu plädieren. Die konsequente Pflege und Optimierung von bestehendem Content ist genauso wichtig wie die Jagd nach glänzenden, neuen Themen.Alina Benny, Content Lead NextivaVerfolge einen ganzheitlichen Ansatz Content-Briefings (auch Content-Briefs oder Text-Briefings genannt, die alle Informationen zusammenfassen, die ein Dritter zur Erstellung von Webinhalten benötigt) eignen sich hervorragend, um Content zu erstellen, der gut rankt, und deinen Textern eine gute Ausgangsbasis zu bieten (niemand mag eine leere Seite). Doch im Jahr 2021 wird deine Zielgruppe sogar noch wichtiger werden — was bedeutet, dass du über Content-Briefings hinaus denken musst. Denke an site-wide SEO, einschließlich einer strategischen Site-Map, Content, der diese Site-Map unterstützt, und klare, nicht-intrusive (unaufdringliche) Möglichkeiten, eine Liste aufzubauen und First-Party-Data zu sammeln.Das Ende der Third-Party-Cookiesnaht, und diejenigen, die jetzt in starke SEO- und Content-Programme und ‑Praktiken (einschließlich Listenaufbau) investieren, werden am besten auf die Herrschaft der First-Party-Data vorbereitet sein. Diese wird im Jahr 2022 voll zum Tragen kommen — denn bis dahin möchte Google Chrome Third-Party-Cookies blockieren. Tracey Wallace, Director of Marketing MarketerHireErstelle Content, der sich auf das Produkt konzentriertFinde eine Möglichkeit, dein Produkt in Actionable-Content zu verwandeln — also Content, den deine Leser leicht in die Praxis umsetzen können. Dieser Content bietet nicht nur die Möglichkeit, eine breite Palette von Long-Tail-Keywords einzubauen, sondern ist auch ein großartiger Conversion-Treiber.Ein Beispiel: Bei Soapbox stellt die umfangreiche Sammlung an Meeting-Agenda-Vorlagen einen großen Mehrwert unseres Produktes dar. Zu unserem Glück sind diejenigen, die aktiv nach Agenda-Vorlagen suchen, auch eher dazu geneigt, in zahlende und nicht zahlende Nutzer zu konvertieren. Also erstellen wir eine Sammlung von Agenda-Vorlagen, die genau auf die Suche ausgerichtet ist, und es uns ermöglichte, für eine Vielzahl an Long-Tail-Keywords zu ranken und gleichzeitig hochwertigen Traffic auf unsere Website zu bringen. Inzwischen haben wir diese Erfahrung auch mit einer anderen Sammlung gemacht.Kurz zusammengefasst lautet mein Rat, die wertvollsten Aspekte deines Produkts oder deiner Dienstleistung zu definieren und dieses Produkt-Erlebnis über Content zu vermitteln.Hiba Amin, Marketing Manager SoapboxTipp für Content-Writer: Agiere wie ein JournalistMein Rat ist: Verhalte dich wie ein Journalist. Denn Journalisten versuchen, Informationen von Personen zu beschaffen, die ein wenig mehr über das Thema wissen als sie selbst, und sie führen oft eigene Experimente durch. Manche würden sich einen Monat lang von McDonald’s-Produkten ernähren, nur um einen Artikel zu schreiben, und andere würden kriminelle Gruppen infiltrieren und in deren Leben eintauchen. So weit musst du nicht gehen. Der springende Punkt ist, dass preisgekrönte Journalisten, die mit ihrer Arbeit Menschen helfen und beeindrucken wollen, nicht einfach in ihrem Keller sitzen und Artikel von anderen Journalisten lesen und die gleichen Ideen nur in andere Worten packen. Sei nicht einfach nur eine Person, die Artikel schreibt: Sei wie ein Journalist, der wirklich tätig werden muss, um die Geschichte zu produzieren, und sie nicht nur auf der Tastatur tippt.Tim Soulo, CMOErzähl deine Story konsequentUnternehmen müssen Geld in Kreativität investieren und einen starken Omnichannel-Fokus hinsichtlich ihres Marketings verfolgen. Manly Bands hat ein ganzes Kreativteam hinter der Marke, das dazu beiträgt, unsere Markengeschichte lückenlos auf jeder Customer Journey zu vermitteln, egal ob die Kunden uns im Fernsehen, auf Facebook, Google oder in einer E‑Mail sehen. Stephanie Bregman, CMO Manly BandsBaue Empathie für deine Zielgruppe aufBeim Schreiben die Suchintention im Hinterkopf zu haben und gleichzeitig dein Produkt oder deine Dienstleistung auf natürliche Art und Weise als Lösung zu positionieren, ist ein Balanceakt. was sie wissen müssen und schließlich die Informationen, die du bereitstellen musst, um ihnen bei der Lösung ihres Problems zu helfen. Nutze Google (oder Advanced SEO Tools wie die von Ahrefs!)um zu sehen, was derzeit für dein gewünschtes Keyword rankt und wie es die Frage der Leser beantwortet. Nutze die Twitter-Suche,um Diskussionen zu finden, die mit deinem Suchbegriff zusammenhängen, und notiere dir die Fragen und Anliegen der Leute sowie die Ressourcen, die sie teilen. Nutze Reddit,um Unterhaltungen zu deinem Thema ausfindig zu machen und um ein Verständnis dafür zu bekommen, was ein potenzieller Suchender wirklich wissen muss.Diese Strategien helfen Content-Marketern dabei, mehr als nur die Oberfläche zu überfliegen, wenn es darum geht, nützlichen Content zu verfassen, der Conversions erzielt.Fadeke Adegbuyi, Senior Content Marketing Manager DoistErstelle Content, der völlig anders istDas Web wird immer überladener. Jeder “erstellt heutzutage Content”. Wie kannst du deinen Content also herausstechen lassen? Mach dir Gedanken über deinen Minimum-Viable-Markt. Nein, hierbei geht es nicht um die Vermarktung an jedermann. Sprich mit deinen besten Kunden; diejenigen, mit denen du am liebsten zusammenarbeitest und die den höchsten Gewinn bringen. Finde die konkreten Sorgen und Herausforderungen deiner Kunden heraus. Diese sollten in deinen Gesprächen angesprochen werden. Gehe sehr spezifisch vor. Es ist viel einfacher, den besten Content der Welt auf eine sehr spezifische Frage hin zu erstellen. Kreiere deine Einzigartigkeit. Finde heraus, welchen Content es bereits gibt. Erstelle eine Liste mit all den Dingen, die bereits abgedeckt werden, aber auch welches Format typischerweise genutzt wird, die Tonalität etc. Das ist dein Status Quo. Verzichte auf alles, was gegen die Überzeugungen und den Zweck deines Unternehmens verstößt, alles, was deine Kunden nicht mögen, alles, was nicht dazu beiträgt, die sehr spezifische Herausforderung zu lösen, die du im Fokus hast. Füge umsichtig alles hinzu, was dem von dir identifizierten Status Quo zuwiderläuft. Füge alles hinzu, was deinem Minimum Viable Market hilft, seine Ziele schneller, einfacher und leichter zu erreichen. Gehe gewisse Risiken ein. Ohne das kannst du deinen Content nicht hervorstechen lassen. Mache das Gegenteil von dem, was die anderen tun. Kein Risiko einzugehen ist die riskanteste Option. Wenn du es nicht tust, wird niemand deinen Content wahrnehmen.Louis Grenier, Founder EveryoneHatesMarketersGehe Risiken einGehe große Risiken ein. So abgedroschen das auch klingt, es gab noch NIE eine bessere Zeit, um etwas Neues auszuprobieren. Während es in gewöhnlicheren Jahren einfach reicht, die führenden Content-Strategiebücher an dein Unternehmen anzupassen, gibt es noch keinen Content-Marketer auf diesem Planeten, der “Ich startete eine erfolgreiche Content-Initiative, als der Markt aus einer Pandemie hervorging” in seinem Lebenslauf anführen kann …Es GIBT kein Strategiebuch, also nutze das als eine Art Erlaubnis, eines von Grund auf zu schreiben. Werde kreativ bei der Frage, wie du deinen Markt informieren, unterstützen und begeistern kannst, während er sich vorsichtig der Rückkehr zur Normalität nähert. Dein Pitch, der vor einem Jahr keine Chance hatte (“es ist zu riskant”) — wo steht er jetzt? Jetzt ist die Zeit dafür.Len Markidan, Chief Marketing Officer PodiaWeiterlernenDu willst auch weiterhin mehr über Content Marketing lernen? Wir decken alle wichtigen Content-Marketing-Themen für dich ab. Hier sind einige unserer Favourites, die du lesen und anschauen solltest, um dich weiterzubilden:Wie du eine erfolgreiche Content-Marketing-Strategie in 9 Schritten aufbaust5 Gründe, warum Content Marketing wichtig ist7 Beispiele für erfolgreiches B2B-Content-Marketing5 erfolgreiche Formen des Content-Marketings für das Wachstum deines Unternehmens Content-Marketing-Strategie, die zu Leads und Umsätzen führt (auf YouTube anschauen) Erfolgreiches Content Marketing mit kleinem Budget (auf YouTube anschauen) Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human:",
  "headers": [
    {
      "level": "H1",
      "text": "Content Marketing: Ein umfassender Leitfaden für 2021"
    },
    {
      "level": "H2",
      "text": "Was ist Content Marketing?"
    },
    {
      "level": "H2",
      "text": "Warum ist Content Marketing wichtig?"
    },
    {
      "level": "H3",
      "text": "1. Content Marketing hilft dir, Aufmerksamkeit zu erzeugen und potenzielle Kunden zu gewinnen"
    },
    {
      "level": "H3",
      "text": "2. Content Marketing hilft dir, das Customer Engagement zu erhöhen und Glaubwürdigkeit aufzubauen"
    },
    {
      "level": "H3",
      "text": "3. Content Marketing hilft dir, Kunden zu konvertieren"
    },
    {
      "level": "H3",
      "text": "4. Content Marketing hilft dir, Kundenloyalität und ‑bindung aufzubauen"
    },
    {
      "level": "H3",
      "text": "5. Content Marketing erzielt kumulierende Erträge (und ist auf lange Sicht günstig)"
    },
    {
      "level": "H2",
      "text": "3 häufige Einwände gegen Content Marketing und wie du ihnen begegnest"
    },
    {
      "level": "H3",
      "text": "1. Bezahlte Werbung zieht mehr Besucher und Kunden an — und das schneller"
    },
    {
      "level": "H3",
      "text": "2. Es dauert zu lange, bis man Ergebnisse sieht"
    },
    {
      "level": "H3",
      "text": "3. Der ROI ist schwierig zu messen"
    },
    {
      "level": "H2",
      "text": "Arten von Content Marketing"
    },
    {
      "level": "H3",
      "text": "1. Finde Themen, die für dein Unternehmen relevant sind"
    },
    {
      "level": "H3",
      "text": "2. Erstelle die richtige Art von Content"
    },
    {
      "level": "H3",
      "text": "3. Bewirb deinen Content"
    },
    {
      "level": "H2",
      "text": "5 Content-Marketing-Beispiele, von denen du lernen kannst"
    },
    {
      "level": "H3",
      "text": "1. Die YouTube-Videos von Fix.com"
    },
    {
      "level": "H3",
      "text": "2. Die Facebook-Community von Naturalicious"
    },
    {
      "level": "H3",
      "text": "3. Der Podcast von 15Five"
    },
    {
      "level": "H3",
      "text": "4. Das virtuelle Spielzimmer und die Aktivitätsblätter von Mattel"
    },
    {
      "level": "H3",
      "text": "5. Die Academy-Kurse von Balsamiq"
    },
    {
      "level": "H2",
      "text": "15 Content-Marketing-Tipps von Experten, die du dieses Jahr nutzen kannst"
    },
    {
      "level": "H3",
      "text": "Betreibe Kundenrecherche und führe Gespräche mit ihnen"
    },
    {
      "level": "H3",
      "text": "Verwerte deinen Content neu"
    },
    {
      "level": "H3",
      "text": "Fokussiere deine Bemühungen auf Personen, die dich brauchen, es aber noch nicht wissen"
    },
    {
      "level": "H3",
      "text": "Teste und wiederhole die Formate, die am besten zur Erreichung deiner Ziele beitragen"
    },
    {
      "level": "H3",
      "text": "Appelliere an die Grundwerte deiner Zielgruppe"
    },
    {
      "level": "H3",
      "text": "Nutze Micro-Content"
    },
    {
      "level": "H3",
      "text": "Beginne nicht direkt mit der Taktik"
    },
    {
      "level": "H3",
      "text": "Optimiere bereits bestehenden Content"
    },
    {
      "level": "H3",
      "text": "Verfolge einen ganzheitlichen Ansatz"
    },
    {
      "level": "H3",
      "text": "Erstelle Content, der sich auf das Produkt konzentriert"
    },
    {
      "level": "H3",
      "text": "Tipp für Content-Writer: Agiere wie ein Journalist"
    },
    {
      "level": "H3",
      "text": "Erzähl deine Story konsequent"
    },
    {
      "level": "H3",
      "text": "Baue Empathie für deine Zielgruppe auf"
    },
    {
      "level": "H3",
      "text": "Erstelle Content, der völlig anders ist"
    },
    {
      "level": "H3",
      "text": "Gehe Risiken ein"
    },
    {
      "level": "H2",
      "text": "Weiterlernen"
    }
  ],
  "author": "Fio Dossetto"
}