{
  "url": "https://ahrefs.com/blog/de/content-erstellung/",
  "slug": "content-erstellung",
  "title": "Content-Erstellung: Der komplette Leitfaden für Anfänger",
  "description": "Bei der Erstellung von Content geht es darum, Themen zu finden, die dein Zielpublikum ansprechen, und dann Inhalte zu diesen Themen zu planen, zu erstellen und zu veröffentlichen.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (oder, in einfachen Worten, ich bin der Typ, der dafür sorgt, dass jeder Blog-Post EPISCH wird). Article PerformanceData from AhrefsVerlinkung von Websites 3 Sign up for AhrefsGet SEO metrics of any website or URL.The number of websites linking to this post.This post's estimated monthly organic search traffic. Inhalt In den letzten drei Jahren haben wir Folgendes veröffentlicht:256 Blogbeiträge181 YouTube-Videos260 E‑Mail-Newsletter 3,000+ Tweets3 KurseNatürlich bin ich bei weitem nicht die einzige Person, die für diesen Output verantwortlich ist. Ich denke aber, man kann mit Sicherheit sagen, dass unser Team ein oder zwei Dinge über die erfolgreiche Erstellung und Skalierung von Inhalten weiß.In diesem Leitfaden erfährst du Schritt für Schritt, wie du das auch für dein Unternehmen umsetzen kannst.Aber zuerst wollen wir sicherstellen, dass wir auf dem gleichen Stand sind…Worum geht es bei der Content-Erstellung?Warum ist die Erstellung von Content wichtig?Wie erstellt man Content?Wie skaliert man die Content-Erstellung?Worum geht es bei der Content-Erstellung?Bei der Content-Erstellung geht es darum, Themen zu finden, die dein Zielpublikum ansprechen, und anschließend Inhalte zu diesen Themen zu planen, zu erstellen und zu veröffentlichen.Warum ist die Erstellung von Content wichtig?Content ist wichtig, weil dieser ein effektives Mittel ist, um Menschen in deinen Marketingtrichter zu ziehen. Falls du mit dem Konzept des Marketingtrichters nicht vertraut bist, es handelt sich dabei um eine visuelle Darstellung des Kundengewinnungs- und Kundenbindungsprozesses. Und so funktioniert der Marketing-Trichter: Die Menschen werden zuerst auf deine Marke aufmerksam. Dann wachsen ihr Interesse und Wunsch, nach dem, was du verkaufst. Schließlich werden sie aktiv und werden zu Kunden. Wenn dein Produkt oder deine Dienstleistung sie beeindruckt, werden sie zu treuen Kunden und vielleicht sogar zu Fürsprechern deiner Marke.Aber die Sache ist die:Nicht jeder, der auf deine Marke aufmerksam wird, will auch dein Produkt haben. Nicht jeder, der dein Produkt begehrt, wird es auch kaufen. Nicht jeder, der einen Kauf in Erwägung zieht, wird auch kaufen, und nicht jeder, der kauft, wird zu einem treuen Verfechter deiner Marke.Deshalb ist der Marketingtrichter trichterförmig; in jeder Phase fallen Menschen aus dem Prozess heraus.Was hat das mit Content zu tun?Content hat nicht nur die Macht, Menschen in deinen Marketingtrichter zu ziehen, sondern auch, die Effizienz deines Trichters zu erhöhen.Unser Leitfaden für die Keyword-Recherche zum Beispiel rankt bei Google weit oben für “Keyword-Recherche” und erhält schätzungsweise 5.600 Suchanfragen pro Monat. Das zieht unser Zielpublikum an und verbessert die Markenbekanntheit:Aber das ist nicht das Einzige, was dieser Leitfaden leistet. Er weckt auch Interesse und den Wunsch nach unserem Produkt, indem er den Lesern zeigt, wie sie ihr Problem mit Ahrefs lösen können.Natürlich werden die meisten Leser nach dem Lesen dieses einen Beitrags nicht gleich in Erwägung ziehen, zu reagieren und unser Produkt kaufen. Deshalb haben wir Hunderte von Blogbeiträgen. Wir wecken das Interesse und den Wunsch nach unserem Produkt, indem wir immer wieder auf unser Produkt und unsere Marke hinweisen.Die Leser, die in die Erwägungsphase unseres Trichters kommen, werden durch Inhalte wie unsere “Ahrefs vs.”-Seite zum Handeln bewegt, indem wir zeigen, wie gut unser Produkt im Vergleich zur Konkurrenz abschneidet.Diejenigen, die zu Kunden werden, können wir mit unseren Blogbeiträgen, Kursen und einem speziellen Hilfebereich an uns binden, indem wir ihnen zeigen, wie sie das Beste aus unserem Produkt herausholen können.Wie erstellt man Content?Der Vorgang der Content-Erstellung ist für jeden Kanal in etwa gleich und wir werden ihn im Folgenden erläutern. Zunächst ist es aber wichtig zu verstehen, dass du die Erstellung von Content nicht ohne eine solide Content-Strategie in Angriff nehmen solltest.Deine Content-Strategie hält dich auf Kurs und stellt sicher, dass du mit jedem Inhalt, den du erstellst, einen klaren Zweck verfolgst.So kannst du deinen Content in drei Schritten erstellen:Finde bewährte ThemenWähle einen Content-Typ und ein FormatPlane, erstelle und veröffentliche1. Finde bewährte ThemenEs macht keinen Sinn, Content nur um seiner selbst willen zu erstellen. Was auch immer du erstellen möchtest, du musst sicherstellen, dass es etwas ist, das deine Zielgruppe anspricht.Wie du das machst, hängt von dem Kanal ab, für den du die Inhalte erstellst.Wenn du Inhalte für deine Website oder YouTube erstellst…… solltest du eine Keyword-Recherche durchführen, um die Themen zu finden, nach denen die Leute suchen.Du kannst auch Inhalte zu anderen Themen veröffentlichen, aber du wirst es schwer haben, Aufmerksamkeit zu erhalten, es sei denn, du hast bereits viele Besucher oder Abonnenten, bist bereit, für Werbung zu bezahlen oder hast einen bewährten Vertriebskanal wie eine große E‑Mail-Liste.Die Art und Weise, wie du Themen recherchierst, ist bei beiden Kanälen in etwa die gleiche:a) Betreibe Brainstorming für ThemenNimm dir einen Notizblock und überlege dir, nach welchen allgemeinen Themen deine Zielgruppe suchen könnte. Wenn du Kaffeemaschinen verkaufst, könntest du Dinge wie “Kaffee”, “Espresso” und “French Press” aufschreiben.b) Verwende ein Keyword-Recherche-Tool, um deine Ideen zu vertiefenGib deine Ideen in ein Keyword-Recherche-Tool wie den Keywords Explorer ein, wähle Google oder YouTube als Suchmaschine und gehe zum Bericht “Passende Begriffe”.Sieh dir die Keywords an und füge alle vielversprechenden Content-Themen zu deiner Keyword-Ideenliste hinzu.Zum Beispiel sind “beste Kaffeemaschine” und “wie man Kaffee mit Sahne zubereitet” vielversprechende Content-Ideen für unseren Online-Kaffeeladen. Das sind Themen, nach denen unsere Zielgruppe wahrscheinlich sucht und die ein hohes Suchvolumen haben, also fügen wir sie unserer Keyword-Liste hinzu.Mach das so lange, bis du 30–50 potenzielle Content-Ideen hast.PROFI-TIPPWenn du nach Content-Ideen für eine neue Website suchst, lohnt es sich oft, nach Keywords mit niedrigen Keyword Difficulty (KD)-Werten zu filtern. In der Regel ist es einfacher, für diese Keywords zu ranken. Setze dazu den KD-Filter auf einen niedrigen Höchstwert, z.B.: 10.c) Überprüfe deine MitbewerberDie Leute neigen dazu, in Keyword-Recherche-Tools die gleichen “Seed”-Keywords zu verwenden, was bedeutet, dass du am Ende oft die gleichen Keyword-Ideen siehst wie alle anderen. Das ist nicht unbedingt etwas Schlechtes, aber es hält dich in der “Box”.Aus diesem Grund solltest du dir auch ansehen, worüber deine Mitbewerber Inhalte erstellen.Wenn du nach Content-Ideen für deine Website suchst, musst du zuerst deine Mitbewerber identifizieren. Das geht am einfachsten, indem du deine Keyword-Liste im Keywords Explorer aufrufst und dann den Bericht Traffic Share by Domains aufrufst, um zu sehen, welche Websites den meisten Traffic durch diese Keywords erhalten.Suche nach Websites, die sich auf dein Thema zu konzentrieren scheinen, klicke dann auf das Caret und gehe zum Bericht Top-Seiten, um zu sehen, welche ihrer Seiten den meisten geschätzten Such-Traffic anziehen.In unserem Fall sehen wir einige gute Content-Ideen mit Such-Traffic-Potenzial, die wir sonst nicht gefunden hätten, wie z.B:Keurig FehlerbehebungNespresso wiederverwendbare PodsWie entkalkt man eine Keurig?Wie schäumt man Milch auf?Nespresso vs. Keurig Wenn du noch mehr Ideen brauchst, kannst du diesen Vorgang für weitere Wettbewerber wiederholen. Gehe einfach zum Bericht “Konkurrierende Domains” im Site Explorer, suche nach relevanten Websites, klicke auf das Caret, um den geschätzten Such-Traffic zu überprüfen, dann gib die Website in den Site Explorer ein und prüfe den Bericht “Top-Seiten”.Wenn du nach Content-Ideen für YouTube suchst, musst du zuerst konkurrierende Kanäle finden. Dazu durchsuchst du YouTube nach einem Thema, das du bereits gefunden hast. Wenn wir zum Beispiel nach “Kaffee in einer Kaffeemaschine zubereiten” suchen, sehen wir ein paar Kanäle zum Thema Kaffee.Als Nächstes kannst du ihre Videos nach Themen durchsuchen, die du vielleicht nicht bedienst.In unserem Fall sehen wir Videos zu folgenden Themen:Moka-KanneAeropressSchlagsahne selber zubereitenBaratza ZugabeJetzt können wir diese Keywords in einem YouTube-Keyword-Recherche-Tool verwenden, um noch mehr Themen zu finden, nach denen Menschen suchen. Wenn du Content für andere Kanäle wie soziale Medien oder E‑Mail erstellst…… ist das etwas anderes. Die Menschen auf diesen Plattformen haben deinen Content bereits abonniert, also musst du nicht unbedingt etwas veröffentlichen, wonach sie suchen. Du musst nur Inhalte veröffentlichen, die für sie interessant sind.Nebenbei bemerkt. Das gilt auch für YouTube, wo du oft Videoaufrufe über die “vorgeschlagenen” Empfehlungen in der Seitenleiste erhältst. Hier sind ein paar Möglichkeiten, das zu tun: Überprüfe dein Analytics. Die meisten E‑Mail-Marketing-Tools zeigen dir, welche E‑Mails am häufigsten geöffnet und angeklickt wurden, und die meisten Social-Media-Plattformen geben dir bekannt, welche Beiträge am besten ankommen. Nutze diese Daten, um dein Publikum besser zu verstehen. Überprüfe das Kundenfeedback. Achte auf häufig gestellte Fragen in den Support-Tickets deiner Kunden. Überprüfe die internen Suchanfragen auf der Website. Schau dir mit Google Analytics an, wonach deine Besucher auf deiner Website suchen. Frage deine Kunden oder führe eine Umfrage mit ihnen durch. Deine Kunden wissen am besten, welche Art von Content sie sehen wollen. Auch wenn du keine Inhalte für einen suchbezogenen Kanal erstellst, kannst du mit Keyword-Recherchen Ideen finden. Denn wenn viele Menschen nach etwas suchen, ist es klar, dass sich viele Menschen dafür interessieren. Solche Themen eignen sich oft auch für nicht suchmaschinenbezogene Kanäle wie soziale Medien und E‑Mail.2. Wähle einen Content-Typ und ein FormatWenn du dich für ein Thema aus deiner Ideenliste entschieden hast, musst du dich im nächsten Schritt für die Art und das Format des Contents entscheiden, den du erstellen möchtest.Content-ArtWenn du Content für YouTube erstellst, steht die Art des Contents bereits fest: Video. Das Gleiche gilt für E‑Mails und soziale Medien: Du wirst eine Art E‑Mail oder einen Beitrag für soziale Medien schreiben.Wenn du aber Inhalte für deine Website erstellst, hast du verschiedene Möglichkeiten, z. B:BlogbeitragProdukt-SeiteLanding PageInteraktives ToolWiki/Hilfs-ArtikelWelcher Content-Typ am besten geeignet ist, hängt vom Thema und dem Zweck deines Contents ab.Wenn wir zum Beispiel ein paar SEO-Tipps weitergeben wollen, wäre ein Blogbeitrag der beste Content-Typ, weil er dazu dient, das Markenbewusstsein zu steigern und potenzielle Kunden zu informieren. Als Landing Page oder interaktives Tool würde er keinen Sinn machen, und es hat auch keinen Sinn, ihn in einem Wiki zu verstecken, das für Kunden gedacht ist.Wenn wir Inhalte darüber erstellen wollen, wie Ahrefs im Vergleich zur Konkurrenz abschneidet, ist eine Landing Page wohl das beste Format. Der Zweck dieser Inhalte ist nicht, die Bekanntheit der Marke zu steigern, sondern das Interesse zu wecken und zum Kauf zu verleiten.Wenn wir Inhalte erstellen wollen, die erklären, wie man eine bestimmte Funktion bei Ahrefs nutzt, würden wir wahrscheinlich einen Wiki-Artikel erstellen, weil der Inhalt dazu dient, Kunden zu binden und die Marke zu stärken.Wenn du den am besten geeigneten Content-Typ nicht sofort vom Keyword ablesen kannst, öffne ein Inkognito-Fenster, suche nach deinem Keyword und suche nach dem dominierenden Content-Typ in der SERP.Wenn wir dies für “SEO-Tipps” tun, können wir anhand der Titel, URLs und Beschreibungen erkennen, dass die Ergebnisse alle Blogbeiträge sind:Wenn wir dies für “Keyword Rank Tracker” tun, sind die Ergebnisse meist Landing Pages mit interaktiven Tools:PROFI-TIPPNutze die Ahrefs SEO Toolbar, um kostenlos eine Suche in dem Land und der Sprache zu simulieren, auf die du abzielst.Content-FormatAuch wenn dein gewählter Kanal die Art der Inhalte, die du erstellen kannst, einschränkt, hast du in der Regel ein paar Optionen, wenn es um das Content-Format geht:AnleitungTutorialListen-ArtikelLeitfadenNews/UpdateBrand Story / MarkengeschichteUmfrageRezensionWenn du Content für soziale Medien oder E‑Mails erstellst, gibt es keine feste Regel für das beste Content-Format. Wähle einfach das Format, das dir für das Thema am geeignetsten erscheint.Wenn du Content für deine Website oder YouTube erstellst, können dir die Suchergebnisse helfen zu verstehen, welches Format am besten funktioniert.Wenn wir zum Beispiel bei Google nach “Gastblogbeiträge” suchen, sehen wir, dass alle Blogbeiträge, die ganz oben auf der Liste stehen, Leitfäden sind:Wenn wir das selbe bei YouTube machen, sind das alles Anleitungen und Listen-Artikel:3. Plane, erstelle und veröffentlicheDer Vorgang für die Erstellung deines Contents ist im Wesentlichen derselbe, unabhängig von dem geplanten Kanal, der Art und dem Format.PlanenErstellenVeröffentlichenSchauen wir uns die einzelnen Teile des Prozesses genauer an:PlanenDie Planung beginnt mit der Erstellung einer Gliederung. Wenn du kurze Beiträge für soziale Medien erstellst, ist das vielleicht nicht unbedingt notwendig. Aber für komplexere Inhalte wie Blogbeiträge und Videos ist es zweifellos die beste Vorgehensweise.So beginnen wir fast alle Beiträge und Videos, die wir veröffentlichen.Hier ist zum Beispiel meine Gliederung für diesen Artikel:Wie habe ich entschieden, was ich aufnehmen will?Da der Zweck dieses Beitrags darin besteht, in der organischen Suche zu ranken, habe ich zunächst relevante Top-Ranking-Seiten für gängige Unterthemen analysiert.Zu diesem Zweck habe ich einige der am besten rankenden Leitfäden in das Content Gap Tool von Ahrefs eingegeben und die Anzahl der Überschneidungen auf das Maximum gesetzt, um die Keywords zu sehen, für die alle diese Seiten gerankt haben. Das ergab ein paar ziemlich offensichtliche Unterthemen, die man einbeziehen sollte:Außerdem habe ich den kostenlosen On-Page-SEO-Bericht der Ahrefs SEO Toolbar genutzt, um die Unterüberschriften in den Top-Beiträgen auf häufige Unterthemen zu prüfen. Dabei stellte ich fest, dass es in den meisten Beiträgen darum ging, warum Inhalte wichtig sind, also fügte ich das in meine Gliederung ein.Ich habe mich aber nicht nur von den Top-Posts inspirieren lassen. Ich habe auch einen Abschnitt über die Skalierung von Inhalten hinzugefügt (siehe unten). Keiner der Top-Posts spricht darüber, aber ich weiß aus Erfahrung, dass viele Content-Ersteller vor diesem Problem stehen. Außerdem dachte ich, dass ich einige wertvolle Erkenntnisse weitergeben könnte, um unseren Beitrag von den anderen zu unterscheiden.Denke daran, dass es wenig Sinn macht, einen Abklatsch der bereits vorhandenen Inhalte zu erstellen. Wenn du willst, dass sich die Menschen an deine Inhalte erinnern, musst du etwas Besonderes tun.ErstellenWenn du deine Gliederung fertiggestellt hast, ist es an der Zeit, dich an die Arbeit zu machen und deine Inhalte zu konkretisieren.Wir haben bereits in mehreren Beiträgen Tipps und Methoden vorgestellt, wie du das am besten schaffst, aber hier sind ein paar Tipps für den Anfang: Schreib einfach. Es ist leicht, zu zögern und stundenlang auf ein leeres Blatt zu starren. Ich habe das schon millionenfach getan. Verhindere das, indem du dich zwingst, einfach zu schreiben ohne auszubessern. Selbst wenn du denkst, dass das, was du schreibst, blöd ist, hör nicht auf. Schreib einfach weiter. Verwende eine bewährte Formel für die Einleitung. Deine Einleitung ist wohl der wichtigste Teil deines Inhalts, aber auch der schwierigste. Verwende eine bewährte Formel wie die PAS-Formel. Verwende die Methode der umgekehrten Pyramide. Die meisten Leute begraben wichtige Informationen unter “gut zu wissen”-Geschwafel. Tu das nicht. Mache es dir zur Aufgabe, das, was man wissen muss, vor dem, was gut zu wissen wäre, zu stellen. Jeder, der deine Inhalte liest, wird es dir danken.Wenn du mehr wissen willst, schau dir die folgenden Ressourcen an:Weitere InformationenSEO Copywriting: 12 einfache Tipps für besseren Content11 Content Writing Tipps für mehr organischen Traffic und LeserWie du ein besserer SEO-Texter wirstWenn du deinen Entwurf fertig hast, empfehle ich dir, einen Kollegen oder Freund um Feedback zu bitten. Wir machen das mit all unseren Inhalten. Ich gebe Sam Feedback zu seinen Video-Drehbüchern, er gibt mir Feedback zu meinen Blogbeiträgen und ich gebe unseren anderen Autoren Feedback.Hier ist ein Beispiel aus diesem Beitrag:Versteh mich nicht falsch, das kann manchmal ein bisschen nervenaufreibend sein, aber es wird mit Sicherheit zu besserem Content führen.VeröffentlichenEndlich — der einfache Teil. Formatiere, bearbeite und lade deinen Content für den von dir gewählten Kanal hoch, und schon kann es losgehen. Allerdings gibt es bei diesem Prozess oft mehr Einzelschritte, als du dir vorstellen kannst. Das bringt mich zu…Wie skaliert man die Content-Erstellung?Alles oben Genannte reicht aus, um deine Content-Erstellung in Gang zu bringen. Aber du kannst nicht alles alleine machen. Wenn du die Content-Erstellung wirklich skalieren willst, wirst du andere Leute einbeziehen und deine Prozesse systematisieren müssen.In diesem Abschnitt stellen wir dir dafür fünf Möglichkeiten vor, die auf unseren Erfahrungen beruhen:Lege für jeden Kanal einen Verantwortlichen festUnterteile den Prozess der Content-Erstellung in kleinere AufgabenErstelle SOPsBeauftrage kompetente TexterVerwende einen Content-KalenderVerwende deinen Content für mehrere Kanäle wiederLege für jeden Kanal einen Verantwortlichen festDie Erstellung und das Management von Content für alle Marketingkanäle ist für eine Person allein eine unmögliche Aufgabe. Du musst diese Aufgaben delegieren.So machen wir es bei Ahrefs. Wir erstellen Content für zwei Hauptkanäle: den Blog und YouTube. Ich bin für den Blog zuständig und Sam für YouTube.Hier sind ein paar wichtige Aufgaben für jeden Kanal-Verantwortlichen: Content planen und koordinieren. Was wird veröffentlicht und wann? Welche Aufgaben müssen erledigt werden, bevor wir mit dem Content online gehen können? Content-Writer beauftragen. Um den Content zu skalieren, müssen wir mehr Texter einstellen. Das können Blogger, Video-Texter oder andere Personen sein. In jedem Fall muss jemand diese Leute suchen und auswählen. (Übrigens: wir sind gerade auf Suche) Erstelle Content- und Stil-Richtlinien. Alle müssen auf dem gleichen Stand sein, wenn du deine Marke skalieren und eine einheitliche Markensprache einhalten möchtest. Content-Richtlinien helfen dabei. (Wir arbeiten noch an unseren.)Natürlich ist es möglich, eine Person für mehrere Kanäle verantwortlich zu machen, aber das ist selten effizient. Wenn du die Leute zu sehr einteilst, werden sie nur eine Menge mittelmäßigen Content für viele Kanäle produzieren, anstatt außergewöhnlichen Content für einen Kanal.Unterteile den Prozess der Content-Erstellung in kleinere AufgabenBei der Content-Erstellung gibt es eine Menge zu beachten. Du kannst nicht einfach einen Blogbeitrag verfassen und ihn dann veröffentlichen. Du brauchst Bilder, Formatierung, Lektorat und wahrscheinlich noch viele andere Dinge.Genauso wie es ineffizient ist, wenn eine Person mehrere Kanäle betreut, ist es auch ineffizient, wenn eine Person all diese Dinge erledigt.Wie kannst du das Problem lösen?Zerlege den Prozess in kleinere Aufgaben und übertrage sie jeweils der Person, die am besten dafür geeignet ist.So sieht unser Prozess zur Content-Erstellung für den Blog aus:Jede Farbe steht für eine andere Person in unserem Team.Erstelle SOPsSOPs (Standard Operating Procedures) sind Dokumente, die erklären, wie bestimmte Aufgaben in deinem Unternehmen erledigt werden. Du solltest sie für möglichst viele der kleinen Aufgaben aus dem vorherigen Schritt erstellen.Hier ist zum Beispiel unsere SOP zur Benennung von Bildern für Blogbeiträge:Es ist nichts Besonderes, aber wenn wir alles auf diese Weise dokumentieren, können wir jeden Teil der Content-Erstellung effektiver delegieren. Außerdem macht es die Einarbeitung neuer Mitarbeiter einfacher, da unsere Sammlung von SOPs quasi als Schulungsbibliothek dient.Wir haben sogar SOPs für unseren Prozess zur Videoerstellung, obwohl Sam diese erstellt, da er für diesen Kanal verantwortlich ist.Beauftrage kompetente TexterAlleine ist es praktisch unmöglich, alle Inhalte selbst zu erstellen, also musst du Texter einstellen, wenn du dein Angebot erweitern willst. Doch genau hier machen viele Menschen einen entscheidenden Fehler, denn sie suchen eher nach Textern statt nach Fachleuten.Es stimmt zwar, dass du gute Texter einstellen musst, aber ohne Wissen und Erfahrung aus erster Hand werden sie wahrscheinlich keine wirklich wertvollen Inhalte erstellen.Deshalb suchen wir nie explizit nach Textern, sondern immer nach “Wissensvermittlern”:Wir sind der Meinung, dass es einfacher ist, jemandem beizubringen, wie man besser schreibt, als ihm beizubringen, wie man SEO betreibt. Außerdem wollen wir, dass unsere Mitarbeiter ihre eigenen Erfahrungen und Einsichten einbringen.Doch nicht jeder macht es so. Viele Unternehmen haben Erfolg, wenn sie ihren Content mit einem Top-Down-Ansatz skalieren. Dabei plant ein Content-Stratege jeden Beitrag, erstellt eine Gliederung und schickt sie an einen Texter, der sie in einen vollwertigen Beitrag verwandelt.Die beste Vorgehensweise ist nicht in Stein gemeißelt, sondern hängt von vielen Faktoren ab, z.B.: von der Komplexität deiner Themen, deiner Markenstimme und der Logistik.Verwende einen Content-KalenderKonsistenz ist das A und O bei der Erstellung von Content. Deshalb ist es wichtig, im Voraus zu planen und den Überblick über alles an einem Ort zu behalten.Hier kommt ein Redaktionskalender ins Spiel.So sieht unser Kalender für den Blog aus:Jeder Mensch ist anders, aber wir planen Inhalte in der Regel 1–2 Monate im Voraus.Dein Content-Kalender sollte auch die wichtigsten Details für jeden Beitrag enthalten. Hier sind ein paar der Dinge, die wir festhalten:StatusBeauftragterLevel des BeauftragtenKeywordDatum der VeröffentlichungWir haben auch einen ähnlichen, aber separaten Content-Kalender für unseren YouTube-Kanal.Empfohlene Lektüre: Wie du einen Content-Kalender erstellst, der für dich geeignet istVerwende deinen Content für mehrere Kanäle wiederContent-Erstellung ist ein zeitaufwändiger Prozess, deshalb ist es sinnvoll, so viel wie möglich aus jedem Beitrag herauszuholen, indem du ihn für andere Kanäle wiederverwendest.Wir haben zum Beispiel unseren Blogbeitrag über Long-Tail-Keywords für YouTube wiederverwendet: https://www.youtube.com/watch?v=a6sqyOh0NjcWir haben auch Tweets zu einigen der wichtigsten Punkte im Beitrag verfasst:Long-tail keywords are terms with low search volumes. They get their name because of where they end up on the search demand curve.Despite what many people think, it has nothing to do with how long a keyword is, how specific it is, or how well it’s likely to convert. pic.twitter.com/ARPPwT6Zed— Ahrefs (@ahrefs) March 23, 2021 Long-tail Keywords sind Keywords mit geringem Suchvolumen. Sie werden so genannt, weil sie auf der Nachfragekurve der Suchanfragen am Ende stehen. Im Gegensatz zu dem, was viele Leute denken, hat es nichts damit zu tun, wie lang ein Keyword ist, wie spezifisch es ist oder wie wahrscheinlich es ist, dass es zu einer Conversion führt.Wenn wir über die Wiederverwendung von Content sprechen, heißt das nicht, dass du denselben Beitrag wortwörtlich auf anderen Kanälen veröffentlichen sollst. Wenn du unseren Beitrag und unser Video zu Longtail-Keywords vergleichst, wirst du feststellen, dass sie bei weitem nicht identisch sind. Das liegt daran, dass das, was in einem Format gut funktioniert, nicht immer auch in einem anderen gut funktioniert, also solltest du den Inhalt immer neu aufbereiten, anstatt ihn erneut zu veröffentlichen.FazitWenn du die Erstellung von hochwertigem Content erfolgreich skalierst, kann sich das sehr positiv auf dein Unternehmen auswirken. Wir sind der lebende Beweis dafür, ebenso wie viele andere Unternehmen, die einen ähnlichen Ansatz für ihren Content gewählt haben, wie Buffer und Wise.Denke aber daran, dass du nicht in die Falle tappst, Content ohne eine solide Content-Strategie zu erstellen. Das ist ein sicherer Weg, um Zeit, Geld und Ressourcen zu verschwenden.Hast du noch Fragen? Schreib mir auf Twitter. Article PerformanceData from AhrefsVerlinkung von Websites 3 Sign up for AhrefsGet SEO metrics of any website or URL.The number of websites linking to this post.This post's estimated monthly organic search traffic.Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Joshua Hardwick Head of Content @ Ahrefs (oder, in einfachen Worten, ich bin der Typ, der dafür sorgt, dass jeder Blog-Post EPISCH wird).",
  "headers": [
    {
      "level": "H1",
      "text": "Content-Erstellung: Der komplette Leitfaden für Anfänger"
    },
    {
      "level": "H2",
      "text": "Worum geht es bei der Content-Erstellung?"
    },
    {
      "level": "H2",
      "text": "Warum ist die Erstellung von Content wichtig?"
    },
    {
      "level": "H2",
      "text": "Wie erstellt man Content?"
    },
    {
      "level": "H3",
      "text": "1. Finde bewährte Themen"
    },
    {
      "level": "H4",
      "text": "Wenn du Inhalte für deine Website oder YouTube erstellst…"
    },
    {
      "level": "H5",
      "text": "a) Betreibe Brainstorming für Themen"
    },
    {
      "level": "H5",
      "text": "b) Verwende ein Keyword-Recherche-Tool, um deine Ideen zu vertiefen"
    },
    {
      "level": "H5",
      "text": "c) Überprüfe deine Mitbewerber"
    },
    {
      "level": "H4",
      "text": "Wenn du Content für andere Kanäle wie soziale Medien oder E‑Mail erstellst…"
    },
    {
      "level": "H3",
      "text": "2. Wähle einen Content-Typ und ein Format"
    },
    {
      "level": "H4",
      "text": "Content-Art"
    },
    {
      "level": "H4",
      "text": "Content-Format"
    },
    {
      "level": "H3",
      "text": "3. Plane, erstelle und veröffentliche"
    },
    {
      "level": "H4",
      "text": "Planen"
    },
    {
      "level": "H4",
      "text": "Erstellen"
    },
    {
      "level": "H4",
      "text": "Veröffentlichen"
    },
    {
      "level": "H2",
      "text": "Wie skaliert man die Content-Erstellung?"
    },
    {
      "level": "H3",
      "text": "Lege für jeden Kanal einen Verantwortlichen fest"
    },
    {
      "level": "H3",
      "text": "Unterteile den Prozess der Content-Erstellung in kleinere Aufgaben"
    },
    {
      "level": "H3",
      "text": "Erstelle SOPs"
    },
    {
      "level": "H3",
      "text": "Beauftrage kompetente Texter"
    },
    {
      "level": "H3",
      "text": "Verwende einen Content-Kalender"
    },
    {
      "level": "H3",
      "text": "Verwende deinen Content für mehrere Kanäle wieder"
    },
    {
      "level": "H2",
      "text": "Fazit"
    }
  ],
  "author": "Joshua Hardwick"
}