{
  "url": "https://ahrefs.com/blog/de/content-audit/",
  "slug": "content-audit",
  "title": "Folge unserem Content-Audit-Prozess für 2024 (Vorlage inklusive)",
  "description": "Wir teilen unseren Content-Audit-Prozess, bei dem wir systematisch leistungsschwache Seiten überprüfen und Wege zu ihrer Verbesserung finden.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (oder, in einfachen Worten, ich bin der Typ, der dafür sorgt, dass jeder Blog-Post EPISCH wird). Inhalt Nicht jeder Blogbeitrag, den du veröffentlichst, ist ein Volltreffer.Selbst wenn du dein ganzes Herzblut in deine Inhalte steckst, werden sie oft nicht gerankt, konvertieren nicht oder bringen nichts für dein Unternehmen. Das ist frustrierend.Aber du musst diese Seiten nicht einem langsamen, schmerzhaften Tod überlassen. Du kannst sie überarbeiten, herausfinden, was falsch gelaufen ist, und Maßnahmen ergreifen, um ihre Leistung zu verbessern. Das ist der Content-Audit-Prozess in Kurzform – und er ist ein wichtiger Bestandteil einer erfolgreichen Content-Strategie.Lass uns durchgehen, wie du eine Inhaltsprüfung mit unserer Content Audit-Vorlage und dem interaktiven Prozess durchführst.InhaltWordPress verwendenUnser SEO-WordPress-Plugin automatisiert und übernimmt viele der folgenden Schritte im Content-Audit-Prozess.Wie man den Inhalt einer Website überprüft (unser Prozess)Jeder Content-Audit-Prozess ist in etwa gleich. Du stellst Fragen, um herauszufinden, was, wenn überhaupt, deine Inhalte bremst, und nimmst dann Verbesserungen in diesen Bereichen vor.Hierfür brauchst du drei Dinge:Eine Liste der zu prüfenden Seiten/URLs der WebsiteEine robuste* Audit-Checkliste für InhalteDie richtigen Tools zum Audit von InhaltenNebenbei bemerkt. *Ich kann nicht betonen, wie wichtig das ist. Die meisten Verfahren zur Content-Überprüfung sind viel zu einfach. Sie ziehen nicht genügend Daten aus dem Content Audit heran, was zu schädlichen Empfehlungen führen kann.Mit einem Ahrefs Webmaster Tools (AWT)-Konto kannst du URLs kostenlos und einfach sammeln. Crawle einfach deine Website mit Site Audit, gehe auf den Reiter „Bulk export“ und exportiere „Interne HTML-URLs, Statuscode 200“.Dann kannst du die URLs (Spalte „URL“) einfach kopieren und in unsere Vorlage für den Content-Audit einfügen:Wenn du jedoch Tausende von Seiten hast, kann es ziemlich zeitaufwändig sein, sie alle einer Inhaltsprüfung zu unterziehen. Ich empfehle, die 80/20-Regel zu befolgen und die obersten 20 % der Seiten mit dem meisten organischen Traffic oder Backlinks zu prüfen. Auf diese Weise erhältst du wahrscheinlich 80 % der Ergebnisse.Du findest die Spalten für Backlinks und geschätzten organischen Traffic auch im Site Audit-Export. Kopiere sie einfach und füge sie in die Vorlage für die Inhaltsprüfung ein und filtere dann nach Seiten, die deine Mindestanforderungen an den organischen Traffic und die Backlinks erfüllen.Möchtest du mit „echten“ Traffic-Zahlen arbeiten?Exportiere die Daten aus der Google Search Console (Leistung > Suchanfragen) und füge sie in die Vorlage für die Inhaltsprüfung ein.Als Nächstes musst du nur noch deine Seiten mit unserem interaktiven Content-Audit-Verfahren überprüfen.So verwendest du es:1. Öffne den Prozess in der Moderatorenansicht. (Du kannst das spezielle Fenster der Präsentationsansicht schließen).2. Beantworte für jede Seite die Ja/Nein-Fragen. Anhand deiner Antworten erfährst du, welche Maßnahme(n) du ergreifen musst. (Wenn du nicht sicher bist, wie du antworten sollst, klicke auf den Link „Wie prüfe ich?“ (engl.: How ro check?), um Anweisungen zu erhalten).3. Protokolliere die empfohlenen Maßnahmen für jede Seite, indem du die Kontrollkästchen in deinem Tabellenblatt für die Inhaltskontrolle ankreuzt. Wenn zum Beispiel empfohlen wird, interne Links hinzuzufügen und mehr Backlinks aufzubauen, kreuze diese Kästchen an.Sobald du fertig bist, kannst du die Änderungen selbst umsetzen oder das fertige Content Audit an ein anderes Mitglied deines Teams oder einen Freelancer weitergeben. Jeder der Aktionspunkte verweist auf eine SOP oder einen Leitfaden, um dir das Leben zu erleichtern.Im Folgenden findest du die Fragen, die unser Content-Audit-Prozess für dich bereithält.Du möchtest deine Inhalte in großen Mengen prüfen?Wenn du WordPress verwendest, automatisiert unser SEO-Plugin viele (aber nicht alle) der folgenden Schritte. Andernfalls musst du alle Daten in eine Tabelle übertragen und mithilfe des Content-Audit-Workflows eine Logik für die Empfehlungen erstellen.Wenn du dich fragst, warum wir diese Vorlage für diesen Content Audit nicht selbst erstellt haben, liegt das daran, dass es praktisch unmöglich ist, sie für alle zu erstellen, da jeder eine etwas andere Konfiguration hat.Außerdem wird es schnell unübersichtlich, wenn man Daten aus verschiedenen Quellen zusammenführt, und kleine Änderungen an Exporten oder Formatierungen führen oft dazu, dass etwas nicht funktioniert.Bekommt die Seite organischen Traffic?Gehe zum Suchergebnisbericht in der Google Search Console und filtere nach der Seite. Du siehst dann, wie viele Klicks sie in den letzten drei Monaten über die organische Suche erhalten hat.Wenn du Search Console nicht eingerichtet hast (Tipp: Das solltest du, es ist kostenlos), kannst du die Seite in den Site Explorer von Ahrefs oder unseren kostenlosen Traffic-Checker eingeben, um eine grobe Schätzung zu erhalten.Bekommt die Seite Traffic von einer anderen Quelle?Diese Frage kann nur deine Statistik beantworten. Wenn du Google Analytics verwendest, gehst du in deinem Google Analytics-Konto zu Berichte > Lebenszyklus > Engagement > Seiten und Bildschirme. Von hier aus kannst du nach einer bestimmten Seite filtern, indem du einen Filter „Seitenpfad und Bildschirmklasse“ hinzufügst und den URL-Slug einfügst.So erfährst du, ob die Seite Besucher aus organischen oder anderen Quellen erhält.Nebenbei bemerkt. Wenn du Google Analytics nicht verwendest, kannst du die Daten auch von anderen Analysetools beziehen. Ist die Seite hauptsächlich für die organische Suche bestimmt?Das ist ganz einfach. Wenn der Hauptzweck der Seite darin besteht, in Suchmaschinen zu ranken, lautet die Antwort auf diese Frage „Ja“. Wenn das nicht der Grund ist, warum du die Seite erstellt hast, lautet die Antwort „Nein“.Ist die Seite für andere Zwecke nützlich?Nicht alle Seiten brauchen Besucher, um ihre Existenz zu rechtfertigen. Hier sind ein paar Beispiele für Webseiten, die du wahrscheinlich behalten solltest, unabhängig davon, ob sie Besucher anziehen:Allgemeine Geschäftsbedingungen (AGB)DatenschutzrichtlinieHaftungsausschlussKategorie- oder TagseitenSqueeze/Landing Pages für bezahlte AnzeigenAlles, was auf andere Weise zur Konversion oder Navigation beiträgt (Social Proof, User Stories, etc.)Diese Liste ist nicht vollständig, aber du bekommst einen ungefähren Überblick.Hat die Seite irgendwelche Backlinks?Gib die URL in den Site Explorer von Ahrefs ein und prüfe, wie viele verweisende Domains (verlinkende Websites) sie hat:Wenn diese Zahl über Null liegt, hat die Seite Backlinks.Nebenbei bemerkt. Du kannst dafür auch unseren kostenlosen Backlink-Checker verwenden.Ist die Seite crawl- und indizierbar?Google kann keine Seiten indexieren, die nicht indexierbar sind, und Seiten, die nicht crawlbar sind, werden selten indexiert. Die einfachste Möglichkeit, beides zu überprüfen, ist das URL-Inspektionstool in der Google Search Console.Hier ist, was du unter dem Reiter „Seitenindexierung“ sehen willst:Crawlen erlaubt? JaIndexierung erlaubt? JaVom Benutzer deklarierte canonical: [gleich wie die URL der Seite oder leer]Wenn du das siehst und die Seite nicht umgeleitet wird (Google sagt dir auch, ob das der Fall ist, siehe oben), dann ist sie indexierbar und crawlbar.Hatte die Seite Zeit, erfolgreich zu sein?Seiten ranken selten über Nacht. Es braucht Zeit. Wenn es weniger als sechs Monate her ist, dass du eine Seite veröffentlicht oder wesentlich aktualisiert hast, kann es sein, dass sie einfach etwas mehr Zeit braucht, um in der organischen Suche erfolgreich zu sein.Ist das Ranking der Seite eine Priorität?Niemand hat unendlich viele Ressourcen, also macht es keinen Sinn, sich Krum zu arbeiten, um Seiten zu ranken, die nicht viel wert sind. Du musst Prioritäten setzen.Es gibt keine genaue Formel dafür, was Priorität haben sollte und was nicht. Das hängt von deinem Unternehmen ab. In der Regel beurteilen wir die Seiten nach ihrem Unternehmenspotenzial und dem Potenzial für den Suchverkehr.Das Unternehmenspotenzial bewertet, wie einfach es sein wird, dein Produkt oder deine Dienstleistung auf einer Seite anzubieten. Hier ist die Skala, die wir verwenden:Das Traffic-Potenzial gibt an, wie viel organischen Suchverkehr die Seite bekommen könnte, wenn sie auf Platz 1 steht. Du findest diese Kennzahl (und viele andere SEO-Kennzahlen) im Keywords Explorer von Ahrefs. Wir berechnen sie, indem wir die Gesamtmenge des organischen Suchverkehrs auf der aktuellen Top-Ranking-Seite schätzen.Könnte die Seite mehr organischen Traffic bekommen?Gib das Hauptkeyword, auf das deine Seite abzielt, in den Keywords Explorer von Ahrefs ein und überprüfe die Metrik Traffic Potential (TP). Dabei handelt es sich um den geschätzten organischen Suchverkehr der Seite, für die sie an erster Stelle steht, was in der Regel ein guter Indikator für das TP des Themas ist.Wenn diese Zahl höher ist als der geschätzte Suchverkehr für deine Seite (in dem gewählten Land), dann kann sie wahrscheinlich mehr Traffic bekommen. Du kannst das überprüfen, indem du die URL deiner Seite in den Site Explorer von Ahrefs eingibst.Sei mit diesen Schätzungen vorsichtigBei manchen Suchbegriffen ist die Seite mit der höchsten Platzierung nicht die beste, um das Traffic-Potenzial zu ermitteln. Das Traffic-Potenzial für „Google Search Console“ liegt zum Beispiel bei 33K. Aber wenn du dir ansiehst, von welcher Seite die Schätzung stammt, ist es die offizielle Seite von Google über die Search Console. Da es unwahrscheinlich ist, dass du diese Seite jemals übertreffen wirst, ist es besser, nach einer ähnlichen Seite in den Suchmaschinenergebnissen zu suchen und daraus das Traffic-Potenzial abzuleiten. In diesem Fall sind die ersten vier Ergebnisse allesamt offizielle Seiten von Google, so dass dieser Leitfaden auf Platz 9 wahrscheinlich eine genauere Einschätzung des Traffic-Potenzials des Themas ist. Wird eine andere Seite auf deiner Website für den/die gleichen Zielbegriff(e) gerankt?Gib deine Website in den Site Explorer von Ahrefs ein, gehe zum Bericht Organische Keywords und filtere dann nach „Nur mehrere URLs“ und dem Keyword, das du suchst. Wenn das Keyword im Bericht auftaucht, ranken mehrere Seiten für dieses Keyword.Ist die Seite einzigartig genug, um auch andere Begriffe anzuvisieren?Es ist nicht immer schlecht, wenn mehrere Seiten für dasselbe Keyword ranken. Wenn jede Seite sehr unterschiedlich ist und für ihre eigenen Unterthemen rankt, kann sie in der Regel gut mit den anderen Seiten koexistieren. Um ein ungefähres Gefühl dafür zu bekommen, wie unterschiedlich die Seiten sind, schau dir ihre Titel an. Du kannst sie sehen, indem du auf das Dropdown-Menü „SERP“ klickst und „Nur Ziel“ einschaltest.In diesem Fall kannst du sehen, dass beide Ranking-Seiten ziemlich ähnlich aussehen. Sie sind Definitionen unserer URL-Rating (UR)-Metrik. Daher lautet die Antwort auf die Frage „st sie einzigartig genug, um andere Begriffe anzusprechen?“ wahrscheinlich „Nein“.Bei den „Short-Tail-Keywords“ sind die Seiten, die ranken, jedoch sehr unterschiedlich. Die eine ist eine Definitionsseite, die andere ist ein Vergleich von Long- und Short-Tail-Keywords.Auf dieser Grundlage lautet die Antwort auf die Frage „Ist sie einzigartig genug, um auf andere Begriffe abzuzielen?“ wahrscheinlich „Ja“.Ist deine Seite besser als die der Konkurrenz?OK. Jetzt kommen wir definitiv zu den schwierigen Fragen, denn hier gibt es natürlich ein gewisses Maß an Subjektivität. Es gibt eine Million Dinge, die den Inhalt deiner Website „besser“ machen könnten, aber ein guter Ausgangspunkt ist, sich diese beiden Fragen zu stellen:Deckt sie das Thema gut ab?Gibt es etwas Einzigartiges an ihr?Um die erste Frage zu beantworten, kannst du die Konkurrenzanalyse von Ahrefs nutzen. Gib einfach deine Seite zusammen mit zwei bis drei Top-Ranking-Seiten ein, die auf dieselbe Suchabsicht abzielen, und klicke auf „Vergleichen“.Gehe von hier aus zum Bericht Inhaltslücke und suche nach Unterthemen, die du unter den Keywords nicht abgedeckt hast.Zum Beispiel fiel mir das Stichwort „Affiliate-Marketing-Beispiele“ auf, als ich dies für unseren Affiliate-Marketing-Leitfaden tat, denn ich weiß, dass wir in unserem Blogbeitrag keine Beispiele genannt haben. Es ist also klar, dass wir das Thema noch besser abdecken könnten.Nebenbei bemerkt.Tools zum Schreiben von Inhalten und On-Page-SEO-Tools können dabei ebenfalls helfen. Denk einfach daran, dass du nach fehlenden Themen suchst. Kümmere dich nicht um Kleinigkeiten wie die Anzahl der Wörter oder die Meta-Beschreibung einer Seite. Bei einem erfolgreichen Content Audit geht es nicht darum, sich auf alle Dinge zu konzentrieren. Es geht darum, sich auf die richtigen Dinge zu konzentrieren.Was die Frage der Einzigartigkeit angeht, so sehe ich nach einem kurzen Überfliegen nicht viel, was unseren Beitrag von der Masse abhebt. Es gibt nur sehr wenige einzigartige Daten oder Standpunkte, also gibt es in dieser Hinsicht definitiv Raum für Verbesserungen.Ist deine Seite gut für On-Page-SEO optimiert?Hier geht es darum, die grundlegenden On-Page-Optimierungen zu überprüfen, z. B. einen aussagekräftigen Title Tag und eine Meta Description, eine SEO-freundliche URL, optimierte Bilder, Schema Markup usw. Um dir das Leben zu erleichtern, kannst du die Checkliste in unserem Leitfaden für On-Page-SEO verwenden. Ist die Seite intern verlinkt, sofern dies relevant ist?Interne Links sind Links von einer Seite deiner Website zu einer anderen. Sie helfen den Seiten beim Ranking, indem sie ihnen PageRank verleihen. Es ist also sinnvoll, dafür zu sorgen, dass deine Seiten alle relevanten internen Links haben, die sie bekommen können.Wenn deine Seite bereits eine ordentliche Menge an organischem Suchverkehr erhält, kannst du das Tool Interne Linkmöglichkeiten in Site Audit verwenden, um nach verpassten Möglichkeiten zu suchen. Setze einfach den Filter „Zielseite“ auf die URL deiner Seite, um nach Erwähnungen von Keywords zu suchen, für die sie auf deiner gesamten Website rangiert.Wenn wir dies zum Beispiel für unsere Liste von Content-Marketing-Beispielen tun, schlägt das Tool eine interne Verlinkung von einer Erwähnung von „inspirierenden Inhalten“ in unserer Liste von Content-Marketing-Zielen vor:Wenn deine Seite nicht viel Traffic bekommt, kannst du mit dem Page Explorer eine manuelle Suche nach relevanten Schlüsselwörtern durchführen. So geht’s:Gehe zu Page ExplorerKlicke auf den Filter „Erweitert“.Füge einen Filter hinzu, wenn „Seitentext“ > „Enthält“ > [relevantes Keyword]Füge einen Filter hinzu, wenn „Interne Links“ > „Nicht enthalten“ > [URL der zu überprüfenden Seite]Wenn einer dieser Berichte Ergebnisse zeigt, gibt es wahrscheinlich Stellen, an denen du relevante interne Links hinzufügen kannst. Die Antwort auf diese Frage lautet also „Nein“.Ist das Linkprofil der Seite stärker als das der Konkurrenz?Backlinks sind einer der wichtigsten Ranking-Faktoren von Google. Wenn du also ein schwächeres Backlink-Profil hast als deine Konkurrenten, könnte das dein Keyword-Ranking beeinträchtigen. Um die relative Stärke deiner Profile zu überprüfen, gibst du die URL deiner Seite in den Site Explorer von Ahrefs ein, klickst auf den Reiter „Backlink-Profil“, dann auf die Option zum Hinzufügen von Konkurrenten und gib ein paar Seiten mit Top-Ranking ein.Du kannst dann die verweisenden Domains (verlinkende Websites) und die URL-Bewertung (UR) jeder Seite vergleichen:In diesem Fall sieht es so aus, als ob unser Linkprofil uns nicht im Weg steht. Unsere Seite hat mehr verweisende Domains und einen höheren UR-Score als unsere Konkurrenten.Gibt es alte gelöschte Seiten, die umgeleitet werden könnten?Wenn du alte, gelöschte Seiten mit Backlinks zu einem ähnlichen Thema hast, lohnt es sich, sie umzuleiten, denn sie können helfen, deine Seite zu stärken.Hier erfährst du, wie du Seiten zum Umleiten findest:Gib deine Domain in den Site Explorer von Ahrefs einGehe zum Bericht Beste nach LinksFilter für Seiten mit dem HTTP-Code „404 nicht gefunden“Filter für Seiten mit mindestens einer verweisenden DomainWenn wir zum Beispiel unseren Blogbeitrag über Domain-Bewertung (DR) überprüfen würden, wäre es sinnvoll, diese alte, gelöschte Seite über Domain-Autorität weiterzuleiten:Ist es die stärkste Seite überhaupt? Nein. Sie hat nur vier verweisende Domains. Aber jedes bisschen hilft, und es ist ein leichter Sieg. Glaubst du, die Seite könnte mehr Konversionen erzielen?Wenn deine Seite ihr Traffic-Potenzial ausgeschöpft hat, solltest du überlegen, ob du sie für dein Unternehmen noch wertvoller machen kannst. Könnte sie zu mehr Konversionen führen, die Konversionen unterstützen oder eine bessere Rolle in der User Journey spielen?Das ist nicht mein Fachgebiet, also gibt es sicher viele Möglichkeiten, die Dinge an dieser Stelle zu verbessern. Aber ich würde damit beginnen, dir diese beiden Fragen zu stellen:Kann ich relevante Calls to Action (CTAs) hinzufügen?Kann ich das Produkt oder die Dienstleistung im Inhalt besser verkaufen?Ich habe zum Beispiel vor kurzem meinen Leitfaden für die Indexierung bei Google neu geschrieben (das Original stammt aus dem Jahr 2019). Der Hauptgrund dafür ist, dass sich unser Produkt seither weiterentwickelt hat und es mehr Möglichkeiten gibt, wie es das Problem lösen kann. Wir haben auch einige unserer kostenlosen Tools mit CTAs versehen, wie z.B. dieses bei unserem kostenlosen Backlink-Checker:Vorlage für den Content-AuditNur für den Fall, dass du es oben verpasst hast, hier sind die Vorlagen, die du brauchst:Content-Audit-TabelleContent-Audit-Prozess (interaktiv)FAQsWas ist ein Content-Audit?Bei einem Content Audit analysierst du die Leistung deiner Website-Inhalte, um Möglichkeiten zur Verbesserung zu finden. Viele Inhaltsprüfungen konzentrieren sich auf die SEO-Leistung, aber bei einer vollständigen Prüfung werden auch die Leistung und der Nutzen der Inhalte für dein Unternehmen berücksichtigt.Warum ist ein Content-Audit wichtig?Ein Content-Audit ist wichtig, um zu verstehen, was du tun musst, um die Leistung deiner Website im Content-Marketing zu verbessern. Sie hilft dir dabei, Seiten zu identifizieren, die nicht gut laufen, warum sie nicht gut laufen und wie du das beheben kannst. Sie ist ein wichtiger Bestandteil jeder Content-Marketing-Strategie.Ist ein Content-Audit nur für Blogbeiträge?Nein. Du kannst auch Landing Pages und andere Arten von Webseiten prüfen. Denke nur daran, dass manche Landing Pages unabhängig von ihrer Leistung benötigt werden (z. B. die „Über Uns”-Seite).Abschließende GedankenContent-Audits sollten regelmäßig durchgeführt werden. Sie zeigen dir, wie du die Leistung deiner Website (auch in Bezug auf SEO) verbessern kannst und helfen dir, deine Unternehmensziele zu erreichen.Denke daran, dass du niemals Inhalte einer Website löschen oder umleiten solltest, wenn du nicht sicher bist, dass dies die beste Vorgehensweise ist. Die erfolgreichsten Content-Audits brauchen Ausgewogenheit. Wenn du dir unsicher bist, beauftragst du einen SEO- oder Content-Marketing-Experten mit der Überprüfung deiner Inhalte.Hast du Fragen? Ping mich auf X (Twitter)an. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Joshua Hardwick Head of Content @ Ahrefs (oder, in einfachen Worten, ich bin der Typ, der dafür sorgt, dass jeder Blog-Post EPISCH wird).",
  "headers": [
    {
      "level": "H1",
      "text": "Folge unserem Content-Audit-Prozess für 2024 (Vorlage inklusive)"
    },
    {
      "level": "H2",
      "text": "Wie man den Inhalt einer Website überprüft (unser Prozess)"
    },
    {
      "level": "H3",
      "text": "Bekommt die Seite organischen Traffic?"
    },
    {
      "level": "H3",
      "text": "Bekommt die Seite Traffic von einer anderen Quelle?"
    },
    {
      "level": "H3",
      "text": "Ist die Seite hauptsächlich für die organische Suche bestimmt?"
    },
    {
      "level": "H3",
      "text": "Ist die Seite für andere Zwecke nützlich?"
    },
    {
      "level": "H3",
      "text": "Hat die Seite irgendwelche Backlinks?"
    },
    {
      "level": "H3",
      "text": "Ist die Seite crawl- und indizierbar?"
    },
    {
      "level": "H3",
      "text": "Hatte die Seite Zeit, erfolgreich zu sein?"
    },
    {
      "level": "H3",
      "text": "Ist das Ranking der Seite eine Priorität?"
    },
    {
      "level": "H3",
      "text": "Könnte die Seite mehr organischen Traffic bekommen?"
    },
    {
      "level": "H3",
      "text": "Wird eine andere Seite auf deiner Website für den/die gleichen Zielbegriff(e) gerankt?"
    },
    {
      "level": "H3",
      "text": "Ist die Seite einzigartig genug, um auch andere Begriffe anzuvisieren?"
    },
    {
      "level": "H3",
      "text": "Ist deine Seite besser als die der Konkurrenz?"
    },
    {
      "level": "H3",
      "text": "Ist deine Seite gut für On-Page-SEO optimiert?"
    },
    {
      "level": "H3",
      "text": "Ist die Seite intern verlinkt, sofern dies relevant ist?"
    },
    {
      "level": "H3",
      "text": "Ist das Linkprofil der Seite stärker als das der Konkurrenz?"
    },
    {
      "level": "H3",
      "text": "Gibt es alte gelöschte Seiten, die umgeleitet werden könnten?"
    },
    {
      "level": "H3",
      "text": "Glaubst du, die Seite könnte mehr Konversionen erzielen?"
    },
    {
      "level": "H2",
      "text": "Vorlage für den Content-Audit"
    },
    {
      "level": "H2",
      "text": "FAQs"
    },
    {
      "level": "H3",
      "text": "Was ist ein Content-Audit?"
    },
    {
      "level": "H3",
      "text": "Warum ist ein Content-Audit wichtig?"
    },
    {
      "level": "H3",
      "text": "Ist ein Content-Audit nur für Blogbeiträge?"
    },
    {
      "level": "H2",
      "text": "Abschließende Gedanken"
    }
  ],
  "author": "Joshua Hardwick"
}