{
  "url": "https://ahrefs.com/blog/de/die-4-ps-des-marketings-umsetzen/",
  "slug": "die-4-ps-des-marketings-umsetzen",
  "title": "Wie du die 4 Ps des Marketings umsetzt",
  "description": "Die 4 Ps des Marketings sind ein Modell, mit dem Unternehmen die wesentlichen Faktoren der Vermarktung eines Produkts oder einer Dienstleistung steuern und optimieren können.",
  "content": "Mateusz Makosiewicz Marketingforscher und Ausbilder bei Ahrefs. Mateusz hat über 10 Jahre Erfahrung im Marketing, die er in Agenturen, SaaS- und Hardware-Unternehmen gesammelt hat. Wenn er nicht schreibt, komponiert er Musik oder genießt lange Spaziergänge. Inhalt Die 4 Ps des Marketings sind ein Modell, das Unternehmen nutzen, um die wesentlichen Faktoren der Vermarktung eines Produkts oder einer Dienstleistung zu steuern und zu optimieren. Die vier Komponenten des Modells sind das Produkt (was du verkaufst), der Preis (für wie viel du es verkaufst), der Place (wo du es verkaufst) und die Werbung (wie du Kunden gewinnst). Jeremy McCarty schlug diese Art von Marketing-Mix ursprünglich 1960 in seinem Buch “Basic Marketing: A Managerial Approach” vor. Seitdem wurde das Modell von vielen Marketingfachleuten übernommen und wird auch heute noch verwendet.In diesem Artikel erfährst du, wie du die 4 Ps zu einer kohärenten Strategie verbinden kannst, um dein Produkt oder deine Dienstleistung in vier Schritten effektiv zu bewerben und zu verkaufen:Verstehe das Produkt, das du anbietest Lege einen Preis festWähle einen Distributionskanal, um deine Produkte zu verkaufenEntwickle eine Kommunikationsstrategie1. Verstehe das Produkt, das du anbietestDie meisten von euch haben wahrscheinlich schon ein Produkt oder eine Dienstleistung im Kopf — oder zumindest eine Idee dafür. Das ist schließlich der erste Schritt im Marketing-Mix. Aber bevor du zum nächsten Schritt übergehst, solltest du dir einen Moment Zeit nehmen, um zu überprüfen, ob du auf dem richtigen Weg bist. Zumindest solltest du in der Lage sein, diese grundlegenden Fragen zu beantworten:Was ist der Zielmarkt? / Wer ist die Zielgruppe?Wie groß ist der Markt?Welche Eigenschaften verlangt und schätzt der Markt?Wie unterscheidet sich dein Produkt von der Konkurrenz?Die Antworten auf diese Fragen zu finden, ist eine Aufgabe für die Marktforschung, über die du hier mehr erfahren kannst. Wenn du im Moment keine Zeit dafür hast (das kann ziemlich zeitaufwändig sein), stelle erste Vermutungen an, damit du einen Anhaltspunkt für deine Arbeit hast. Du kannst sie später immer noch verfeinern.So könnte es für unser Produkt aussehen:2. Lege einen Preis festDer Preis sind die Kosten, die deine Kunden für ein Produkt oder eine Dienstleistung zahlen, und diese müssen sowohl mit dem tatsächlichen als auch mit dem wahrgenommenen Wert deines Angebots zusammenhängen.Hier sind ein paar Fragen, die du dir stellen solltest, wenn du über den Preis entscheidest:Welche Kosten musst du berücksichtigen? (Beschaffungskosten, Personal, Vertrieb, etc.)Reicht der Preis aus, um profitabel zu sein?Wird sich deine Zielgruppe das Produkt leisten können?Wie wird der Preis im Verhältnis zu seinen Vorteilen und zu deinen Mitbewerbern wahrgenommen werden?Das Hauptproblem, das du hier lösen musst, ist, wie du deine Geschäftskosten mit dem, was deine Kunden als Wert wahrnehmen, in Verbindung bringen kannst.Die Antwort für unser Produkt lautete: Daten. Daten sind das, was unsere Kunden brauchen, und gleichzeitig sind Daten das, was auf unserer Seite Kosten verursacht.Also haben wir beschlossen, den Preis von Ahrefs an Datenlimits und die Häufigkeit der Datenaktualisierungen zu koppeln.Dann haben wir beschlossen, die Preise in vier Stufen zu unterteilen (plus einen benutzerdefinierten Enterprise-Plan). Der günstigste Plan ist für grundlegende SEO-Bedürfnisse und kleinere Marketingabteilungen geeignet, während der teuerste Plan die Bedürfnisse von SEO-Agenturen und großen Marketingabteilungen widerspiegelt.Um die Dinge einfacher und für unsere Kunden noch vorteilhafter zu machen, erhält jeder zahlende Kunde alle Funktionen, die Ahrefs zu bieten hat.Was dich vielleicht überrascht, ist, dass wir eine kostenpflichtige Testversion haben. Schließlich ist das ziemlich ungewöhnlich.Ich übergebe das Wort an unseren CMO, um die Gründe dafür zu erklären. Vielleicht ist es auch für dein Unternehmen eine gute Lösung?https://www.youtube.com/watch?v=09avD7Y4xpcLass uns auch die Frage der Erschwinglichkeit ansprechen. Mit anderen Worten: Wie stellst du sicher, dass dein Produkt für deinen Zielmarkt erschwinglich ist?Eine Möglichkeit ist, einfach nachzufragen. Du kannst dein Zielpublikum befragen oder interviewen. Du kannst zum Beispiel das Van Westendorp-Modell verwenden, um den optimalen Preispunkt zu bestimmen. Das Modell basiert auf diesen Fragen:Bei welchem Preis wäre er so niedrig, dass du anfängst, die Qualität des Produkts in Frage zu stellen?Ab welchem Preis denkst du, dass dieses Produkt ein Schnäppchen ist?Ab welchem Preis erscheint dir das Produkt zu teuer?Ab welchem Preis ist das Produkt zu teuer?Du kannst dir auch anhören, was die Leute in den sozialen Medien über ähnliche Produkte sagen. Aber sei damit vorsichtig. Es ist schwer, Leute zu finden, die öffentlich ihre Zufriedenheit mit dem Preis eines Produkts ausdrücken, es sei denn, sie haben ein Schnäppchen gemacht. Es ist wahrscheinlicher, dass du Leute siehst, die sich beschweren.Wenn du jedoch Glück hast, stößt du auf lebhafte Diskussionen über die Preisgestaltung in deiner Produktkategorie.Hier ist ein gutes Beispiel (Achtung, es enthält einige Kraftausdrücke):https://www.youtube.com/watch?v=zvPkAYT6B1QEs ist auch eine gute Idee, ein Benchmarking durchzuführen. Das haben wir getan, als wir den Preis für Ahrefs festgelegt haben. Indem wir die Preise mit denen unseres damals sehr profitablen Konkurrenten Moz verglichen haben, haben wir die Gefahr verringert, gleich zu Beginn einen großen Fehler bei der Preisgestaltung zu machen.3. Wähle einen Distributionskanal, um deine Produkte zu verkaufenBei dem Distributionskanal geht es darum, wo und wie die Kunden dein Produkt oder deine Dienstleistung kaufen. Denke dabei an die Art der Geschäfte, Cloud oder Download, das benötigte Personal und mögliche Gebühren für Zwischenhändler.Die wichtigsten Fragen, die in diesem Teil des Prozesses geklärt werden müssen:Was sind die Einkaufsgewohnheiten deiner potenziellen Kunden?Wo verkauft deine Konkurrenz ihre Produkte?Wo erhalten die Kunden das beste Einkaufserlebnis und den besten Kundendienst?Brauchst du Vertriebsmitarbeiter oder wird es sich um Selbstbedienung handeln?Wie viel Umsatz musst du aufgeben, um das Produkt über einen bestimmten Vertriebskanal anzubieten?Vor kurzem habe ich einen Beitrag über die Erstellung einer Markteinführungsstrategie geschrieben, in dem ich die Vertriebsmodelle und die Wahl des richtigen Modells genauer erklärt habe. Sieh dir das an, wenn du mehr darüber erfahren möchtest.Damit du eine Vorstellung davon bekommst, was dich erwartet, findest du hier eine Tabelle mit einer Zusammenfassung der Vertriebsmodelle:Salesforce ist ein hervorragendes Beispiel für ein Unternehmen, das eine starke Verbindung zwischen Produkt und Distributionskanal erzeugt. Bei der Gründung entschied das Unternehmen, dass sein Produkt anders sein sollte als alles andere auf dem Markt — ein SaaS-CRM, das auf Abonnement-Basis verkauft wird. Diese Entscheidung festigte ihr Vertriebsmodell und machte den Ortsaspekt ihres Marketing-Mixes zu ihrem Marken-Unterscheidungsmerkmal.Diese Entscheidung machte Salesforce nicht nur zu dem Unternehmen, das es heute ist, sondern prägte auch die Branche für alle, die nach ihnen auf den Markt kamen. Heute ist jedes CRM ein SaaS-CRM.Salesforce ging sogar noch weiter, indem es eine starke Verbindung zwischen Produkt und Werbung/Promotion (ein weiteres “P”) herstellte. Sie “übersetzten” ihre Produktarchitektur in eine Werbekampagne mit dem Titel “Das Ende der Software”, die das traditionelle Softwarevertriebsmodell angriff.Die Salesforce-Kampagne “Das Ende der Software” in Aktion. Quelle: Business InsiderDie Erkenntnis daraus ist, dass das richtige Vertriebsmodell stark von der Art des Produkts abhängt. Wann immer du mehr als einen Ort siehst, an dem du dein Produkt verkaufen kannst, wäge die Kosten und Vorteile ab. Vielleicht stößt du auf eine Goldgrube, wie es Salesforce getan hat.4. Entwickle eine KommunikationsstrategiePromotion bezieht sich auf die Methoden, die du einsetzen musst, um deine Botschaft an die Zielgruppe zu bringen. Denk an Werbung, Blogbeiträge, soziale Medien, PR usw.Deine Werbestrategie muss folgende Fragen beantworten:Wen willst du erreichen?Wie erreichen deine Konkurrenten ihre Kunden?Wie sieht der typische Kaufweg deiner potenziellen Kunden aus?Welches Budget und Personal brauchst du?Welche Methoden kannst du anwenden, um den Marketingtrichter zu füllen? Ich möchte dir zeigen, wie wir bei Ahrefs einige dieser Fragen in unserer Werbestrategie beantworten.Der Eckpfeiler unserer Promotion-Strategie ist das Content-Marketing. Es gibt ein paar Gründe, warum wir uns für diese Art von Marketing entschieden haben.Erstens suchen viele Menschen bei Google nach Lösungen für Probleme, die unser Produkt lösen.Zum Beispiel gibt es in den USA schätzungsweise 450 Suchanfragen pro Monat nach “wie man bei Google besser rankt”:Data aus dem Ahrefs Keywords Explorer.Also haben wir einen Blogbeitrag geschrieben, in dem wir erklären, wie man dieses Problem mit Ahrefs lösen kann. Jetzt ranken wir auf Platz 3 für dieses Keyword:Data aus dem Ahrefs Keywords Explorer.Wir haben genau das Gleiche für Hunderte anderer relevanter Themen, nach denen gesucht wird, getan. Das Ergebnis ist, dass unser Blog jetzt jeden Monat Hunderttausende von Besuchern aus der organischen Suche erhält.Zweitens: Da Ahrefs ein SEO-Tool ist, gibt es kein besseres Verkaufsargument, als wenn wir selbst für jedes SEO-Thema ranken.Indem wir zeigen, dass wir unsere Inhalte mit unseren eigenen Tools ranken lassen, schaffen wir eine starke Verbindung zwischen dem Produkt und der Werbung in unserem 4‑Ps-Modell. Diese starke Verbindung ist ein Grund, an den Wert unseres Produkts zu glauben und liefert uns viele Fallbeispiele, über die wir in unserem Blog berichten können.Und schließlich sollten wir unser Vertriebsmodell betrachten. Da unser Produkt eine Selbstbedienung ist und wir es nur über unsere Website verkaufen, brauchen wir einen Mechanismus, um unsere Zielgruppe zu uns zu bringen. Content Marketing ist die Lösung für dieses Problem.Schauen wir uns die drei Kernelemente unserer Content-Marketing-Strategie genauer an.Kostenlose ToolsWir haben derzeit 14 kostenlose Tools, die die Funktionen unserer kostenpflichtigen Kerntools präsentieren. Diese ermöglichen es uns, die Ps zu verbinden und unser Produkt als Werbemittel zu nutzen, um: Die Markenbekanntheit zu erhöhen, indem wir für relevante Suchanfragen ranken, z.B. “kostenloser Backlink-Checker”. Reibungsverluste zu reduzieren, indem wir potenziellen Kunden die Möglichkeit geben, das Produkt vor dem Kauf auszuprobieren.Wenn du wissen möchtest, wie viel Traffic uns unsere kostenlosen Tools bringen, schau dir den Bericht über die Top-Seiten im Site Explorer von Ahrefs für unsere Domain an.Hier ein kleiner Vorgeschmack:BlogUnser Blog generiert auch jede Menge gezielten organischen Traffic für uns:Das liegt daran, dass wir unseren Blog geschäftsorientiert halten. Wir bloggen nicht über Betriebsausflüge, Bürohunde oder darüber, wie man einen Hintergrund aus einem Bild entfernt. Für die ersten beiden Themen gibt es keine Suchanfragen, und die letzteren haben kein “Geschäftspotenzial”.Anhand des “Geschäftspotenzials” beurteilen wir, wie wahrscheinlich es ist, dass unsere Leser durch einen Artikel über ein bestimmtes Thema auf unser Produkt stoßen. Wir beurteilen es auf einer Vier-Punkte-SkalaEin Artikel, in dem erklärt wird, wie man einen Hintergrund aus einem Bild entfernt, könnte uns zwar jede Menge organischen Traffic bringen, aber es macht keinen Sinn, darüber zu schreiben, weil er kein “Geschäftspotenzial” hat.Geschätzter monatlicher organischer Such-Traffic für das am besten rankende Ergebnis für “Wie entferne ich den Hintergrund eines Bildes”. Data aus dem Ahrefs Keywords Explorer.Stattdessen schreiben wir meist über Themen, die auf unserer Skala für das “Geschäftspotenzial” mit zwei oder drei Punkten bewertet werden. Ein Beispiel ist das Thema “SEO-Audit”, für das wir über die Jahre hinweg ziemlich konstant ranken:Unsere historischen Rankings für “SEO-Audit” über den Ahrefs Site Explorer.Wenn du mehr über das Bloggen für Unternehmen erfahren möchtest, bieten wir dir hier einen kostenlosen fünfstündigen Kurs an. YouTubeUnser YouTube-Kanal ist ein weiteres Kernelement unserer Content-Marketing-Strategie.Seit etwa drei Jahren (als Sam zu uns kam) erstellen wir regelmäßig Videos. In dieser Zeit haben wir 181 Videos veröffentlicht — eine Leistung, die ohne eine eigene Person für diesen Marketingkanal nicht möglich gewesen wäre.Die Herangehensweise an unseren YouTube-Kanal ist unserem Blog sehr ähnlich. Wir halten ihn geschäftsorientiert und teilen in jedem Video unser Fachwissen darüber, wie Ahrefs gängige SEO- und Marketingprobleme lösen kann.In diesem Video erfährst du mehr über unsere YouTube-Keyword-Recherche und unsere Strategie zum Ranken:https://www.youtube.com/watch?v=NY3y0V9UDwMWeitere InformationenWie man eine erfolgreiche Content-Strategie entwickelt16 Marketing-Methoden, die im Jahr 2021 funktionieren10 Leadgenerierungs-Methoden, die funktionieren (mit Beispielen)Growth-Hacking-Taktiken, die jedes Startup kennen mussEin Blick hinter die Kulissen unseres Marketings bei Ahrefs SaaS Marketing Vlog.FazitDie 4 Ps des Marketings sind ein bisschen wie die SWOT-Analyse. Beide sind in ihrer Einfachheit sehr elegant, beziehen sich auf die Grundlagen des Geschäfts und können für verschiedene Zwecke verwendet werden.Hier sind nur einige Möglichkeiten, wie du die 4 Ps des Marketings nutzen kannst: Entwickle deine Marketingstrategie. Wenn du das richtige Produkt, den richtigen Preis, den richtigen Distributionskanal und die richtige Kommunikationspolitik gefunden hast, hast du den Grundstein für deine gesamten Marketing-Maßnahmen gelegt. Führe einen Marketing-Workshop durch. Die 4 Ps des Marketings sind etwas, das jeder verstehen kann. Außerdem kann jeder interessante Ideen oder Einsichten zu den Komponenten haben. Revidiere eine Marketingstrategie. Wenn du eine bestehende (vielleicht konkurrierende) Marketingstrategie prüfen oder analysieren musst, helfen dir die 4 Ps, dich auf das Wesentliche zu konzentrieren.Hast du Fragen? Schreib mir auf Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Mateusz Makosiewicz Marketingforscher und Ausbilder bei Ahrefs. Mateusz hat über 10 Jahre Erfahrung im Marketing, die er in Agenturen, SaaS- und Hardware-Unternehmen gesammelt hat. Wenn er nicht schreibt, komponiert er Musik oder genießt lange Spaziergänge.",
  "headers": [
    {
      "level": "H1",
      "text": "Wie du die 4 Ps des Marketings umsetzt"
    },
    {
      "level": "H2",
      "text": "1. Verstehe das Produkt, das du anbietest"
    },
    {
      "level": "H2",
      "text": "2. Lege einen Preis fest"
    },
    {
      "level": "H2",
      "text": "3. Wähle einen Distributionskanal, um deine Produkte zu verkaufen"
    },
    {
      "level": "H2",
      "text": "4. Entwickle eine Kommunikationsstrategie"
    },
    {
      "level": "H3",
      "text": "Kostenlose Tools"
    },
    {
      "level": "H3",
      "text": "Blog"
    },
    {
      "level": "H3",
      "text": "YouTube"
    },
    {
      "level": "H2",
      "text": "Fazit"
    }
  ],
  "author": "Mateusz Makosiewicz"
}