{
  "url": "https://ahrefs.com/blog/de/eine-karriere-im-digitalen-marketing-starten/",
  "slug": "eine-karriere-im-digitalen-marketing-starten",
  "title": "So startest du eine Karriere im digitalen Marketing (7 Schritte)",
  "description": "Zwar musst du nicht zertifiziert sein, aber du musst dir einige Fähigkeiten aneignen, um ein Digital Marketer zu werden. Hier erfährst du, wie du eine Karriere im digitalen Marketing starten kannst.",
  "content": "Si Quan Ong Marketing @ Ahrefs. Ich lese, mache Breakdance und versuche zufäliige Lebensexperimente. Inhalt Du möchtest Teil des digitalen Marketings werden und davon profitieren? Dann ist dieser Leitfaden genau richtig für dich.Ich habe keinen Hochschulabschluss in Marketing — nur einen in Psychologie. Trotzdem habe ich in den letzten fünf Jahren im digitalen Marketing gearbeitet.Das ist das Schöne an dieser Branche. Man muss nicht zertifiziert sein, um als Digital Marketer arbeiten zu können. Es gibt keine Gatekeeper.Dennoch musst du dir sowohl Kenntnisse im digitalen Marketing aneignen als auch Praxiserfahrung sammeln.Hier kommt dieser Leitfaden ins Spiel. Ich zeige dir, wie du dein Wissen erweitern kannst, und führe dich durch die verschiedenen Phasen, die du auf deinem Weg zum professionellen Digital Marketer möglicherweise durchlaufen wirst.Starte deine Karriere im digitalen Marketing in diesen sieben Schritten:Erstelle deine eigene WebsiteWähle einen digitalen Marketingkanal, auf den du dich fokussierstLerne mehr über deinen gewählten digitalen MarketingkanalWende das Gelernte anMache dich mit kostenlosen digitalen Marketing-Tools vertrautBewirb dich für einen Job im MarketingTreibe deine Karriere voran1. Erstelle deine eigene WebsiteAuch wenn du keine Zertifizierungen brauchst, um einen Job im digitalen Marketing zu bekommen, heißt das nicht, dass die Unternehmen dich auf Anhieb für eine Stelle einstellen werden.Du musst zuerst:Deine Fähigkeiten im digitalen Marketing ausbauen;Zeigen, dass du diese Fähigkeiten besitzt.Am besten gelingt das, indem du deine eigene Website erstellst.Indem du deine eigene Website erstellst, schaffst du dir ein Experimentierfeld, in dem du verschiedene Marketingstrategien testen und lernen kannst. Und das alles, ohne dass du dir Sorgen machen musst, die Website eines anderen zu beschädigen.Und nicht nur das: Was sonst kann deine Fähigkeiten besser belegen, als zu zeigen, dass du tatsächlich etwas von Grund auf aufgebaut hast?Als ich zum Beispiel im digitalen Marketing anfing, erstellte ich eine Website über mein Hobby: Breakdance.Wie meine Breakdance-Seite damals aussah.Ich will ehrlich sein — die Website war hässlich. Aber sie gab mir die Möglichkeit, Dinge wie Content Marketing, E‑Mail-Marketing, SEO-Outreach und vieles mehr zu üben. Auch wenn die Website letztendlich nicht erfolgreich war, hat sie mir entscheidend dabei geholfen, eine Menge an praktischer Erfahrung zu sammeln.Es gibt keinen Grund, die Sache zu zerdenken. Das Wichtigste ist, einfach anzufangen und zu üben. Wähle einen Bereich, für den du dich interessierst, und erstelle eine Website mit WordPress. Mache dir keine Gedanken über Dinge wie Logos oder eine Monetarisierungsstrategie.Wenn du nicht sicher bist, wie man eine WordPress-Website einrichtet, führe einfach eine kurze Google-Suche durch. Du wirst jede Menge Tutorials finden.2. Wähle einen digitalen Marketingkanal, auf den du dich fokussierstEs gibt eine Vielzahl von digitalen Marketingkanälen. Das Buch Traction listet 19 davon auf, darunter: Suchmaschinenoptimierung (Search Engine Optimization — SEO)Content MarketingE‑Mail-MarketingSocial Media- und Display-AnzeigenDa du deine Website alleine betreibst, wäre es vom Zeit‑, Arbeits- und Ressourcenaufwand her unmöglich, alle Marketingkanäle zu bedienen. Stattdessen empfehlen wir, sich auf nur einen Bereich des digitalen Marketings zu konzentrieren.Doch welchen Kanal solltest du wählen? Schauen wir uns die Vor- und Nachteile von drei beliebten Kanälen an.Online-WerbungDies beinhaltet den Kauf von Anzeigen auf Plattformen wie Google, Facebook und Instagram. Im Allgemeinen ist diese Strategie großartig, um schnell Traffic auf deine Website zu bekommen.Wenn du jedoch ein kompletter Anfänger bist, kann dieser Kanal etwas gewagt sein. Beim Managen von Online-Anzeigen geht es nicht einfach nur darum, sie zu schalten und den Traffic seinen Lauf zu lassen. Du benötigst immer noch einiges an Wissen und Erfahrung, damit du am Ende nicht dein ganzes Geld verlierst.Wenn du also etwas Budget bereitstellen kannst, um diesen Kanal zu testen und zu lernen, nur zu. Andernfalls ist es vielleicht nicht der richtige für dich.Social-Media-MarketingHier geht es darum, eine Fangemeinde in den sozialen Medien aufzubauen und von diesen Plattformen aus den Traffic antreiben. Du solltest mit ihnen vertraut sein. Und da es kostenlos ist, Content zu posten, ist das Experimentieren einfach.Das könnte ein idealer Kanal für den Anfang sein. Denke jedoch daran, dass Social-Media-Marketing nicht einfach nur bedeutet, alle paar Tage etwas auf Instagram zu posten. Jede Plattform ist wie ein eigenes Land. Um erfolgreich zu sein, musst du die “Kultur” verstehen — wie sie tickt, was die Nutzer sehen wollen, welche Arten von Content gut funktionieren und so weiter. Suchmaschinenoptimierung (SEO)SEO ist die Optimierung von Seiten, um in Suchmaschinen wie Google weit oben zu ranken.Das Tolle daran ist, dass du, sobald du rankst, kostenlosen, passiven und beständigen Traffic über Suchmaschinen erhältst.Konstanter Traffic-Zuwachs durch unseren Blogbeitrag zum Thema “Was sind Backlinks” Der Nachteil ist jedoch, dass es viel länger dauert, bis es funktioniert. Du wirst Geduld brauchen, um Ergebnisse zu sehen. Doch es lohnt sich.Nicht sicher, welchen Kanal du wählen sollst?Beginne mit SEO. Ja, natürlich sind wir voreingenommen. Doch wir empfehlen es trotzdem aus mehreren Gründen:Der Einstieg ist kostenlos. Im Gegensatz zu Online-Anzeigen benötigst du kein Geld, um eine SEO-Kampagne zu starten;Es gibt jede Menge kostenlose SEO-Tools;Es ist einer der wenigen langfristig skalierbaren Kanäle zur Kundengewinnung;Die Fähigkeiten, die du im Bereich SEO erlernst (z.B.: Content Writing, Outreach, Linkaufbau, Content Promotion usw.) sind leicht auf andere Bereiche des digitalen Marketings übertragbar. 3. Lerne mehr über deinen gewählten digitalen MarketingkanalFühre dazu eine Suche nach “[dein gewählter Bereich] Anfänger-Leitfaden” bei Google durch. Suche nach einem Leitfaden, der ausführlich ist, die Themen gut erklärt und kürzlich aktualisiert wurde. Der letzte Teil ist besonders wichtig, da digitales Marketing eine schnelllebige Branche ist.Der Leitfaden dient auch als Ausgangspunkt für die Entdeckung weiterer Unterthemen, über die du mehr lernen kannst.Wenn du dich auf SEO fokussieren möchtest, dann empfehle ich, dir unser Video über SEO für Anfänger anzusehen:https://www.youtube.com/watch?v=DvwS7cV9GmQDas sollte dir ein gutes Verständnis von den Grundlagen der SEO vermitteln. Wenn du von dort aus mehr über SEO erfahren möchtest, empfehle ich dir, diese Informationsquellen durchzugehen:Keyword-Recherche: der Anfänger-Leitfaden von AhrefsOn-Page-SEO: vollständiger Anfänger-Leitfaden Content Marketing: ein umfangreicher Leitfaden für 2021 Der Anfänger-Leitfaden für den Linkaufbau Was ist technische SEO? 11 Best-Practice-Beispiele 4. Wende das Gelernte anWenn du einen Muscle-up machen möchtest, ist es egal, wie viele YouTube-Tutorials du dir ansiehst. Du musst immer noch eine Stange finden und üben.Das Gleiche gilt für das digitale Marketing.Konsumiere nicht nur die Inhalte. Das führt nur zu einer Analyse-Paralyse — zu viel darüber nachdenken und dennoch nichts tun. Glaub mir, das habe ich auch schon erlebt.Wenn du etwas gelernt hast, musst du loslegen und es umsetzen. Das ist der Grund, warum du deine Website erstellt hast.I find I learn much faster by starting to do something and overcoming roadblocks I run into along the way than by carefully studying and preparing— Austen Allred (@Austen) February 7, 2021 Ich finde, dass ich wesentlich schneller lerne, wenn ich anfange, etwas zu tun und Hindernisse auf dem Weg überwinde, als wenn ich sorgfältig lerne und mich vorbereite.Für SEO bedeutet das, sich auf die Grundlagen wie Keyword-Recherche, das Erstellen von Content und das Aufbauen von Links zu konzentrieren. Allein diese drei Dinge können mehr als alles andere zum Erfolg deiner Website beitragen.5. Mache dich mit kostenlosen digitalen Marketing-Tools vertrautDa du gerade erst anfängst, wird es schwierig sein, Geld für Premium-Marketing-Tools auszugeben.Aber keine Sorge — es gibt eine Menge kostenloser Tools. Hier sind einige, mit denen du dich vertraut machen solltest: Google Analytics. Hier siehst du Daten wie die Anzahl der Besucher auf deiner Website, welche Seiten sie aufrufen, wie lange sie darauf bleiben und viele andere aussagekräftige Metriken. In diesem Leitfaden erfährst du, wie du es verwendest. Google Search Console (GSC). Hier siehst du, welche Seiten bei Google indexiert werden, für welche Keywords deine Website rankt und welche Websites auf dich verlinken. In diesem Leitfaden erfährst du, wie du die GSC optimal nutzen kannst. Ahrefs Webmaster Tools (AWT). Hier siehst du die Backlinks und Keyword-Rankings deiner Website und überprüfe deine Website hinsichtlich gängiger SEO-Probleme, die die Performance beeinträchtigen könnten. ConvertKit. Ein E‑Mail-Marketing-Tool. Mit dem kostenlosen Tarif kannst du bis zu 1.000 Abonnenten verwalten. Buffer. Kostenloses Social-Media-Management-Tool. Automatisiert den Prozess der Veröffentlichung von Inhalten.6. Bewirb dich für einen Job im MarketingMit deinen neu erworbenen Fähigkeiten ist es nun an der Zeit, die Jobbörsen zu durchforsten.Wonach du suchen solltest, ist ein Praktikum oder eine Einstiegsposition. Das kann eine Stelle in einer Agentur für digitales Marketing oder eine unternehmensinterne Position sein. Ich habe zum Beispiel als Marketing-Praktikant bei einem Wearable-Tech-Startup angefangen. Später habe ich die Gelegenheit genutzt, um diese Stelle in eine Vollzeitstelle umzuwandeln.Doch selbst für diese Positionen ist die Konkurrenz sehr groß. Also brauchst du eine Möglichkeit, um dich von der Masse abzuheben.Hier sind ein paar Ideen: Briefcase-TechnikNetworkingMache deine Arbeit öffentlichVermarkte dich selbstBriefcase-TechnikDies ist eine Taktik für Bewerbungsgespräche, die von Ramit Sethi, einem New York Times-Bestsellerautor, geprägt wurde. Im Grunde genommen gehst du so vor: Recherchiere das Unternehmen, bei dem du dich bewirbst;Finde deren größte Probleme im digitalen Marketing heraus;Entwickle Lösungen, um diese zu beheben.Lerne mehr über diese Technik hier:https://www.youtube.com/watch?v=68dqa_IPqK8NetworkingSoziologen haben herausgefunden, dass die meisten nicht ausgeschriebenen, hochbezahlten Jobs nicht über die engsten Freunde gefunden werden. Stattdessen werden sie über schwache Bindungen gefunden, d.h. über Zufallsbekanntschaften oder Menschen, die denselben schulischen oder kulturellen Hintergrund haben.Das ist der Grund, warum du immer Networking betreiben solltest.Hier ist eine dreiteilige Strategie, mit der du effektiv netzwerken kannst: Konsumiere den gesamten Content, den die Person produziert hat. Wenn dir ein bestimmter Beitrag gefallen hat oder du daraus etwas lernen konntest, teile ihn in den sozialen Medien und markiere die Person. Du kannst auch eine E‑Mail schicken, um dich zu bedanken oder ein Kompliment zu machen; Gib ihnen eine Plattform, auf der sie für ihre Arbeit werben können. Interviewe sie für einen Artikel, einen Podcast, ein Video, etc. Dies muss nicht für deine eigene Website sein; es kann für eine andere sein. Doch auch hier solltest du nicht entmutigen lassen, selbst wenn du nur eine kleine Website besitzt. Einige Leute wären mehr als glücklich, dir zu helfen. Finde heraus, an welchem Projekt sie gerade arbeiten. Das könnte aus ihren sozialen Netzwerken ersichtlich sein oder du könntest sie fragen. Dann finde heraus, wie du ihnen helfen kannst, ihre Ziele zu erreichen.Du möchtest einen Beweis dafür sehen, dass es funktioniert? Nun, so habe ich tatsächlich meinen Job bei Ahrefs bekommen.Ich begann damit, alle Beiträge des Ahrefs-Blogs zu konsumieren. Dann habe ich sie auf meinem Twitter geteilt.Ich habe diese Artikel auch regelmäßig auf GrowthHackers beworben, ohne dass jemand aus dem Team darum gebeten hat:Später nahm ich Kontakt zu Tim auf und interviewte ihn für einen Gastbeitrag auf LeadFeeder. Dabei erfuhr ich, dass er an der Einführung von Bloggen für Unternehmen arbeitete.Also habe ich ihn unterstützt:Ich nahm am Beta-Kurs teil und brachte mein Feedback ein. Ich habe sogar ein Testimonial geliefert;Ich habe den Kurs überall beworben — in Slack-Communities, Facebook-Gruppen usw.Ich habe Tim mit Leuten vernetzt, die über eine große Reichweite verfügen, damit er den Kurs bewerben kann.Und das Wichtigste: Ich habe alles umsonst gemacht und nichts im Gegenzug verlangt. Und nun, wie man so schön sagt, der Rest ist Geschichte.Mache deine Arbeit öffentlichDa ich schon eine Weile in der Branche tätig bin, habe ich viele Marketer gesehen, die aus dem Nichts auftauchten und anfingen, an Reichweite und Einfluss zu gewinnen. Was sie taten, war einfach — sie begannen, das, was sie lernten, öffentlich zu teilen.Austin Kleon schreibt in Show Your Work: Gehe einmal am Tag, nachdem du deine Tagesaufgaben erledigt hast, zurück zu deinen Arbeitsunterlagen und finde einen kleinen Teil deiner Arbeit, den du teilen kannst.Scheue dich nicht, zu zeigen, woran du arbeitest. Zeige deine Erfolge und Misserfolge auf. Das wird nicht nur Marketer anziehen und dein Netzwerk ausbauen, sondern es wird auch deine persönliche Marke wachsen lassen.Vermarkte dich selbstNina Mufleh wollte bei Airbnb arbeiten. Doch das Bewerben auf Stellenausschreibungen hat bei ihr nicht geklappt. Also erstellte sie einen Lebenslauf, in dem sie ihr Wissen über Airbnb, die Reisebranche und die Möglichkeiten, die ihnen entgehen, darstellte.Sie twitterte diesen Lebenslauf an den CEO und den CMO von Airbnb, erregte deren Aufmerksamkeit und ergatterte ein Vorstellungsgespräch.Der Lebenslauf ging auch viral und erregte die Aufmerksamkeit von Uber und LinkedIn.Wie kannst du unter Beweis stellen, dass du Talent für Marketing hast? Mache es wie Nina — werde kreativ, vermarkte dich gut und errege die Aufmerksamkeit der Unternehmen, für die du arbeiten möchtest.7. Treibe deine Karriere voranNach ein paar Jahren im digitalen Marketing kannst du damit beginnen, verschiedene Optionen in Betracht zu ziehen, mit denen du deine Karriere vorantreiben kannst.Während es den Rahmen dieses Artikels sprengen würde, den gesamten Karriereentwicklungsprozess zu erörtern, werfen wir einen Blick auf einige potenzielle zukünftige Möglichkeiten.Im Unternehmen bleibenFreiberuflich arbeitenDeine eigene Agentur gründenConsultingWeitere Websites erstellenIm Unternehmen bleibenIm Allgemeinen ist dies der typischste Weg. Entgegen dem, was die Leute dir weismachen wollen, ist es keine Schande, ein Angestellter zu sein. Nicht jeder kann aufbrechen und ein erfolgreicher Unternehmer werden.Nun ist es wichtig zu beachten, dass du nicht unbedingt deine eigenen Websites aufgeben solltest. Gute Unternehmen werden dich ermutigen, Zeit in deine Nebenprojekte zu investieren, um dein Können zu verbessern.Das sind in der Regel die Art von Leuten, für die du arbeiten möchtest, weil sie dich herausfordern werden, ein Meister in deiner Arbeit zu werden.Freiberuflich arbeitenEine freiberufliche Tätigkeit ist eine großartige Möglichkeit, mehr Praxiserfahrung zu sammeln und gleichzeitig dein Einkommen zu erhöhen. Wenn du schon ein paar Jahre im Berufsleben stehst, dann ist die Wahrscheinlichkeit groß, dass du bereits einige freiberufliche Aufträge in Aussicht gestellt bekommst.Auch wenn du keine Empfehlungen oder eingehenden Anfragen erhältst, mach dir keine Sorgen. Du kannst dich immer für Jobs auf Seiten wie Upwork, ProBlogger, etc. bewerben.Empfohlener Artikel: Wie man ein SEO-Freelancer wird — Erkenntnisse aus über 10 Jahren BranchenerfahrungDeine eigene Agentur gründenViele Menschen, die gut im digitalen Marketing sind, machen sich irgendwann mit einer eigenen Agentur selbstständig. Das Gute daran, eine eigene Agentur zu gründen, ist:Du kannst für viele Kunden gleichzeitig arbeiten, da du Teams hast, die sich um das Kundenmanagement kümmern.Außerdem kannst du mehr Dienstleistungen anbieten, da dein Team breit gefächert sein wird.Da du alles aus einer Hand anbietest, kannst du dein Ertragspotenzial durch Upselling maximieren.Eine Agentur zu gründen bedeutet jedoch, Personal einzustellen. Dies kann kostspielig sein (Gehälter, Büroräume usw.). Du musst dir auch Fähigkeiten aneignen, die nichts mit digitalem Marketing zu tun haben — Personalbeschaffung, Vertrieb, Buchhaltung, etc.Es ist auch wahrscheinlich, dass du sowohl die Strategie als auch die Ausführung übernehmen musst, bevor sich ein gewisser Erfolg einstellt.ConsultingWenn du:Daran interessiert bist, auf eigene Faust zu arbeiten;aber nicht daran interessiert bist, eine Agentur zu gründen.Dann könnte die selbstständige Beratung ein potenzieller Weg für dich sein.Sam — unser YouTube-Mann — war als Berater für digitales Marketing tätig, bevor er Vollzeit bei Ahrefs angefangen hat. Seiner Erfahrung nach erzielt die Beratung eine bessere Nettomarge als eine Agentur. Auch die Stundensätze reichen typischerweise von Hunderten bis Tausenden von Dollar.Ergebnisse aus unserer SEO-Preisumfrage. Allerdings wirst du in der Anzahl der Kunden, die du übernehmen kannst, eingeschränkt sein. Grund: Unternehmen beauftragen in der Regel Berater, weil diese sich auf einen bestimmten Bereich spezialisiert haben.Während du also vielleicht ein kleines Team einstellst, um die systematisierten Teile deines Geschäfts zu erledigen, beauftragen die Kunden dich letztendlich wegen deiner Expertise. Das schränkt natürlich deine Möglichkeiten ein, viele Kunden zu gewinnen.Weitere Websites erstellenViele Digital Marketer bevorzugen diesen Weg, da er ihnen erlaubt, zu üben und gleichzeitig ein zusätzliches Einkommen nebenbei zu verdienen. Eine beliebte Wahl, vor allem für SEOs, ist es, eine Affiliate-Website zu erstellen.Erfahre mehr über Affiliate-Marketing in diesem Beitrag oder schaue dir dieses Video an:https://www.youtube.com/watch?v=W‑nbsnXtSZIWeitere InformationenWie man eine erfolgreiche Amazon-Affiliate-Website aufbaut (Schritt für Schritt)7 erfolgreiche Amazon-Affiliate-Websites (von denen du lernen kannst)Wie man eine Keyword-Recherche für Affiliate-Seiten durchführtFazitUnabhängig davon, welchen Weg du wählst, um digitales Marketing zu meistern, gibt es zwei Dinge, die du immer tun solltest.Erstens: Lernen. Marketing ist ein sich ständig weiterentwickelndes Feld. Du musst ständig lernen, anwenden, testen und verfeinern. Lies Bücher, höre Podcasts, schaue Videos und folge Vordenkern im Internet.Zweitens: Networking. Networking eröffnet dir nicht nur zukünftige Karrierechancen, es hilft auch, Menschen zu treffen, die neue und andere Ideen haben als du selbst. Das kann deine Perspektive öffnen und dir helfen, dich in deiner Karriere weiterzuentwickeln. Schließlich kann man selbst nie auf alles eine Antwort haben.Lust auf eine Zusammenfassung? Schaue dir dieses Video an:https://www.youtube.com/watch?v=bG-AL2Hd6CcHabe ich irgendetwas ausgelassen, das für den Start einer Karriere im digitalen Marketing wichtig ist? Lass es mich auf Twitter wissen. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Si Quan Ong Marketing @ Ahrefs. Ich lese, mache Breakdance und versuche zufäliige Lebensexperimente.",
  "headers": [
    {
      "level": "H1",
      "text": "So startest du eine Karriere im digitalen Marketing (7 Schritte)"
    },
    {
      "level": "H2",
      "text": "1. Erstelle deine eigene Website"
    },
    {
      "level": "H2",
      "text": "2. Wähle einen digitalen Marketingkanal, auf den du dich fokussierst"
    },
    {
      "level": "H3",
      "text": "Online-Werbung"
    },
    {
      "level": "H3",
      "text": "Social-Media-Marketing"
    },
    {
      "level": "H3",
      "text": "Suchmaschinenoptimierung (SEO)"
    },
    {
      "level": "H2",
      "text": "3. Lerne mehr über deinen gewählten digitalen Marketingkanal"
    },
    {
      "level": "H2",
      "text": "4. Wende das Gelernte an"
    },
    {
      "level": "H2",
      "text": "5. Mache dich mit kostenlosen digitalen Marketing-Tools vertraut"
    },
    {
      "level": "H2",
      "text": "6. Bewirb dich für einen Job im Marketing"
    },
    {
      "level": "H3",
      "text": "Briefcase-Technik"
    },
    {
      "level": "H3",
      "text": "Networking"
    },
    {
      "level": "H3",
      "text": "Mache deine Arbeit öffentlich"
    },
    {
      "level": "H3",
      "text": "Vermarkte dich selbst"
    },
    {
      "level": "H2",
      "text": "7. Treibe deine Karriere voran"
    },
    {
      "level": "H3",
      "text": "Im Unternehmen bleiben"
    },
    {
      "level": "H3",
      "text": "Freiberuflich arbeiten"
    },
    {
      "level": "H3",
      "text": "Deine eigene Agentur gründen"
    },
    {
      "level": "H3",
      "text": "Consulting"
    },
    {
      "level": "H3",
      "text": "Weitere Websites erstellen"
    },
    {
      "level": "H2",
      "text": "Fazit"
    }
  ],
  "author": "Si Quan Ong"
}