{
  "url": "https://ahrefs.com/blog/de/finde-featured-snippets/",
  "slug": "finde-featured-snippets",
  "title": "Wie man für Googles Featured Snippets optimiert",
  "description": "Featured Snippets sind Informationen, die in der Regel oben in den Suchergebnissen von Google erscheinen. In diesem Beitrag erfährst du, wie du Featured Snippets gewinnen kannst.",
  "content": "Michal Pecánek Vermarkter und Content-Autor bei Ahrefs. Süchtig nach SEO, Luftfahrt, Parfums, Sushi und Tacos. Article PerformanceData from AhrefsVerlinkung von Websites 4 Sign up for AhrefsGet SEO metrics of any website or URL.The number of websites linking to this post.This post's estimated monthly organic search traffic. Inhalt Möchtest du in Google an die erste Position springen, ohne Backlinks zu erwerben oder deinen Inhalt wesentlich zu aktualisieren? Featured Snippets können dir dabei helfen.Featured Snippets sind Informationen, die in der Regel oben in den Suchergebnissen von Google erscheinen. Sie liefern Antworten auf die Suchanfrage, indem sie relevante Inhalte von den Seiten mit den höchsten Rankings abrufen.Du fragst dich vielleicht, inwiefern das gut für die Website ist, die das Featured Snippet besitzt. Die Benutzer sehen deinen Inhalt in der SERP und das könnte bedeuten, dass man Klicks verliert, nicht wahr?Nun, ja und nein. Überprüfe dieses Beispiel:Wenn es möglich wäre, diese Frage in wenigen Sätzen gründlich zu beantworten, wären die meisten von uns arbeitslos. Während dir das Snippet also die absoluten Grundlagen vermittelt, musst du immer noch klicken, um mehr zu erfahren.Das ist nur ein Beispiel. Featured Snippets sind eines der herausragendsten SERP-Features — und sie entwickeln sich ständig weiter.In diesem Guide wirst du lernen:Welche Arten von Featured Snippets gibt esWie Featured Snippets die Suche und SEO beeinflussenWie man Featured Snippets die man bereits hält, findet und optimiertWie man für mehr Featured Snippets ranktWie man Featured Snippets überwachtWelche Arten von Featured Snippets gibt es?Es ist wichtig zu wissen, welche Art von Snippet Google für Suchanfragen anzeigt, wo du das Snippet besitzen möchtest. Es gibt ein paar verschiedene Formen:AbschnittNummerierte ListenPunktelistenTabellenVideo1. Abschnitt2. Nummerierte Listen3. Punktelisten4. Tabellen5. Video (üblicherweise von YouTube)Es ist auch wichtig, darauf hinzuweisen, dass es andere “snippetartige” Ergebnisse gibt. über die du Bescheid wissen musst, um jede Verwirrung zu vermeiden:Knowledge PanelKnowledge CardEntity CarouselDiese drei SERP-Features haben eines gemeinsam. Sie ziehen keine Antworten aus nur einem der ranghöchsten Suchergebnisse, da sie auf Entitäten im Knowledge Graph basieren. Sie können zwar einen Link zur Informationsquelle (z.B. Songtexte) enthalten, aber niemals in Form eines anklickbaren Titels, wie wir es bei den Featured Snippets haben.Wie Featured Snippets die Suche und SEO beeinflussenGoogle hat 2014 Featured Snippets eingeführt, und ich würde sagen, dass sie eine der prominentesten SERP-Änderungen des letzten Jahrzehnts sind. Es gibt eine ganze Reihe von Dingen, die sich durch sie sowohl für Nutzer als auch für SEOs geändert haben.Abkürzung für die höchste organische PositionWeniger Klicks—manchmalFeatured Snippets als Branding-MöglichkeitenFeatured Snippets nach der SERP-DeduplizierungDu kannst entscheiden Featured-Snippets zu blockieren (tue das jedoch nicht)Abkürzung zu den organischen Top-ErgebnissenWenn dein Inhalt bei einer Suchanfrage, die ein Featured Snippet zeigt, auf der ersten Seite der Suchergebnisse (SERP) rangiert, kannst du dieses Snippet “gewinnen” und deinen Weg zur Spitzenposition abkürzen. Lass uns das aufschlüsseln.Unsere Studie ergab, dass Featured Snippets von Seiten stammen, die bereits in den Top 10 rangieren. Darüber hinaus befindet sich die überwiegende Mehrheit der Seiten, auf denen Snippets enthalten sind, in den Top 5.Zusammenfassend lässt sich sagen, dass die Wahrscheinlichkeit, ein Featured Snippet zu erhalten, umso größer ist, je höher dein Inhalt eingestuft wird.Auf die erste SERP zu gelangen ist ein leichter zu erreichendes Ziel als die Nummer eins für ein Keyword. Wenn dieses Keyword jedoch ein Featured Snippet auslöst, ist die erste Position etwas leichter zu erreichen.Weniger Klicks… manchmalViele SEOs glauben, dass die Featured Snippets die Klicks auf die Suchergebnisse reduzieren. Denn wenn die Antwort auf die Anfrage in der SERP steht, warum solltest du dann auf ein Ergebnis klicken?Während dies bei einigen Suchanfragen der Fall ist, ist dies sicherlich nicht bei allen der Fall. Es hängt davon ab, ob Google eine aussagekräftige Antwort im Snippet liefern kann.Schaue dir zum Beispiel das für die Suchanfrage angezeigte Snippet an, “wann schließt die Börse”:Die Antwort liegt genau hier. Du brauchst nicht mehr Informationen als das, was das Snippet liefert.Und das ist wahrscheinlich der Grund dafür, dass nur 23% der Suchen nach dieser Anfrage zu Klicks im Suchergebnis führen.Wirf nun einen Blick auf das Snippet für “wie der Aktienmarkt funktioniert”:Obwohl es eine grundlegende Antwort auf die Frage gibt, würden die meisten Suchenden mehr wissen wollen.Das ist wahrscheinlich der Grund dafür, dass 74% der Suchen nach dieser Suchanfrage mit mindestens einem Klick beantwortet werden.Der Clou dabei ist, dass es selten eine gute Idee ist, Keywords mit einer geringen Anzahl von Klicks pro Suche (Clicks Per Search, CPS) anzuvisieren.Achte darauf, wenn du im Keywords Explorer nach Keywords recherchierst.HinweisGoogle scheint Verbesserungen für einige Featured Snippets zu testen. Es sieht aus wie eine Kombination aus Featured Snippets und People Also Ask-Boxen:Das obige Beispiel verwendet externe Quellen für alle vier Tabs. Ich habe auch Snippets gesehen, die zusätzliche Informationen von derselben Seite enthalten, z.B. mit dem “How to”-Markup, das für Rich Snippets verwendet wird.Ich behalte mir mein Urteil vor, bis die Dinge deutlicher und stabiler werden, aber sie können zweifellos die CTR beeinflussen.Featured Snippets sind großartige Branding-MöglichkeitenAbgesehen von den Klicks sind die Featured Snippets das erste, was die Benutzer in den Suchergebnissen sehen. Auf mobilen Geräten, wo sie oft das Einzige sind, was die Benutzer zunächst sehen, sind sie sogar noch deutlicher zu erkennen:Mobile Featured Snippet-Ansicht.Dies ist ein sehr überzeugendes Argument für Featured Snippets.Die Erhöhung deines Anteils an den SERPs ist wohl einer der wichtigsten SEO-KPIs. Das liegt daran, dass der Markenaufbau erwiesenermaßen der wichtigste Motor für langfristiges Wachstum ist.Je mehr deine Marke in den SERPs für relevante Themen sichtbar ist, desto mehr wird man dich als Marktführer assoziieren.Featured Snippets nach der SERP-DeduplizierungUnsere Studie bestätigte, dass der Besitz eines Featured Snippets immer zu mehr Klicks führt. Aber das war im Jahr 2017. Im Januar 2020 führte Google die Deduplizierung von Feature-Snippets ein.In der Vergangenheit wurde die Seite, die das Snippet besaß, auch in den Standard-Suchergebnissen der “blauen Links” in der Suche irgendwo in der ersten SERP aufgeführt. Das ist jetzt nicht mehr der Fall. Sobald deine Seite zum “Featured Snippet” erhoben wird, verlierst du dieses “normale” Suchergebnis.Obwohl die Deduplizierung unweigerlich dazu führte, dass der Traffic auf Seiten in den “Featured Snippets” abnahm, ist sie kein Traffic-Killer. Zumindest besagt das die Studie von Kevin Indig.Obwohl wir beabsichtigen, die Studie bald zu aktualisieren, ist das Mindeste, was ich sofort tun kann, die Auswirkungen der Deduplizierung auf den Ahrefs-Blog zu überprüfen, so wie es Kevin getan hat.Hier ist das, was ich anhand der US-Suchdaten für unseren Blog herausgefunden habe:Desktop trafficMobile trafficClicks-2.41%-3.84%Impressions+2.17%+4.39%CTR-4.48%-7.89%Nicht fantastisch, nicht schrecklich. Es ist ähnlich wie das, was ich bei anderen SEOs gesehen habe.Die stärksten Trafficrückgänge gab es natürlich bei Suchanfragen, bei denen wir vorher auf dem ersten Platz rangierten und das Snippet besaßen.Du kannst dich von Featured Snippets abmelden (aber mache das nicht)Es war nur eine Frage der Zeit, bis jemand ein Experiment machte, indem er sich nach der SERP-Deduplizierung von Featured Snippets abmeldete. Cyrus Shepard führte den Weg an und entdeckte, dass dies zu einem Trafficverlust von 12% führte.Wenn du dich dennoch von den Featured Snippets abmelden möchtest, bietet Google verschiedene Möglichkeiten, dies zu tun. Sei dir nur bewusst, dass einige davon auch verhindern, dass dein Content in herkömmlichen “Blauen Link”-Snippets erscheint. Ich würde davon abraten, diese zu verwenden, da Google dann nur dein hartcodiertes Titel-Tag und deine Meta-Beschreibung verwenden könnte.Der einfachste Weg, deine Seite vom Erscheinen in den “Featured Snippets” auszuschließen, besteht darin, das Meta-Tag “max-snippet robots” einzufügen. Dieser Tag gibt die maximale Anzahl von Zeichen an, die Google in seinen Text-Snippets anzeigen kann.Und da Featured Snippets länger als Beschreibungen in regulären Snippets sind, kannst du das Zeichenlimit auf die übliche maximale Länge der Beschreibungen festlegen. Das sind etwa 155–170 Zeichen.Du müsstest nur dieses Code-Snippet in den <head>-Abschnitt der Seite einfügen, die du aus den Featured Snippets entfernen möchtest:<meta name=\"robots\" content=\"max-snippet:170\" />Beachte, dass diese Methode laut Google keine Garantie für die Entfernung aus Featured Snippets bietet. Nur die restriktiveren Methoden zur Verwendung des Meta-Tags “nosnippet robots” oder des HTML-Attributs “data-nosnippet robots” tun dies.tipWenn du daran denkst, dich abzumelden, lohnt es sich, zuerst zu prüfen, welche Position deine Seite für das Keyword einnehmen würde, ohne das Featured Snippet zu besitzen.Hier ist zum Beispiel ein Featured Snippet, das wir besitzen:Wenn wir “&num=9” an die URL anhängen, vorzugsweise im Inkognito-Modus, können wir sehen, wo wir rangieren würden, wenn wir nicht im Snippet wären:Wenn wir uns in diesem Fall für ein Opt-out entscheiden würden, stünden wir an zweiter oder dritter Stelle (je nachdem, welche Seite das Featured Snippet übernehmen würde).Auf niedrigeren Positionen zu sein und das Opt-out zu wählen, kann deinem Traffic schaden. Du wurdest gewarnt.Wie findest und optimierst du Featured Snippets, die du bereits besitzt?Die Google Search Console zeigt keine Informationen zu den Featured Snippets an. Du musst Tools von Drittanbietern wie den Site Explorer von Ahrefs verwenden, um sie zu durchsuchen.Lass uns bei Site Explorer bleiben. Füge deine Webseite ein, gehe dann zum Bericht Organische Suchbegriffe, um die Suchbegriffe zu sehen, nach denen du gerankt bist, und filtere dann nur nach denjenigen, bei denen Google deine Seite im Featured Snippet anzeigt:Google ist ziemlich schlau, aber manchmal versteht es die Dinge nicht ganz richtig. Ich empfehle, die Suchanfragen selbst zu überprüfen, um sicherzustellen, dass Google den “richtigen” Inhalt zieht.Abgesehen davon werden bei vielen Long-Tail-Keywords Featured Snippets angezeigt. Wie du im obigen Screenshot sehen kannst, rangiert Ahrefs in den USA bei 866 Featured Snippets. Es ist unmöglich, dass wir Hunderte von Suchanfragen manuell überprüfen würden.Wir müssen eine Liste der für uns wichtigsten Featured Snippets erstellen. Und wir werden damit beginnen, die Ergebnisse weiter nach Suchvolumen zu filtern:Dies schränkt die Zahl der Suchanfragen auf nur 35 ein, was 4% der ursprünglichen Anzahl entspricht — und eine viel überschaubarere Zahl, mit der man arbeiten kann.Beachte, dass du, wenn du dies selbst tust, mit dem Filter nach deinem Land und deiner Branche herumspielen solltest. Ich habe zum Beispiel in einer Branche gearbeitet, in der ein monatliches Suchvolumen von mehr als 100 in den USA ein Zeichen für ein fettes Keyword war.Nehmen wir an, du bist auf eines dieser nicht-idealen Featured Snippets wie dieses gestoßen:Wahrscheinlich kann jeder erkennen, dass dieses Snippet nicht richtig ist. Während es Informationen über YouTube und andere Websites im Absatzformat zieht, sieht der nächste Teil nicht so toll aus. Ich meine, was hat es mit der aus dem Zusammenhang gerissenen Erwähnung von Craigslist auf sich?Es stellt sich heraus, dass Google Daten aus der falschen Tabelle gezogen hat, und zwar auch in umgekehrter Reihenfolge.Warum? Ich vermute, dass Google den Kontext dieser Tabelle für die Suchanfrage “meistbesuchte Websites in den USA” für wichtiger erachtet als die Tabelle mit den korrekten Daten:Wir müssen den Artikel für Google verständlicher machen. Die Lösung sieht hier einfach aus: Verschiebe das H2-Tag entweder direkt vor die Tabelle oder mache es zum Teil der Tabellenüberschrift:Jetzt brauche ich nur noch zu warten. Ich werde dafür sorgen, diesen Artikel zu aktualisieren, sobald wir das Snippet behoben haben.Ich beschreibe den Prozess der Erhöhung der Wahrscheinlichkeit des Stehlens und des Haltens von Featured Snippets später im Artikel ausführlicher. Für den Moment war dies ein gutes Beispiel für die Behebung deiner Probleme auf der Seite.Tappe aber nicht in die Falle, dass du denkst, du könntest mit deinen Featured Snippets alles machen.Auch wenn du auf Featured Snippets stoßen könntest, die ein wenig aufpoliert werden müssten, würde ich nicht empfehlen, Dinge zu bearbeiten, es sei denn, Google zieht schlecht formatierte, irreführende oder einfach nur falsche Informationen, wie oben gezeigt.Es ist besser, ein unvollkommenes Feature-Snippet zu besitzen, als zu riskieren, es durch Überarbeitung an einen Konkurrenten zu verlieren.Wie man für mehr Featured Snippets ranktDer Gewinn von mehr Featured Snippets ist eine einfache Möglichkeit, den organischen Traffic auf deiner Website potenziell zu erhöhen. Im Folgenden besprechen wir einige Möglichkeiten, dies zu erreichen.Nutze Inhalte, die du bereits hast und für die du ein Ranking hastHier werden wir uns Seiten ansehen, die für eine bestimmten Termin bereits in den Top 10 rangieren, aber das Snippet nicht besitzen. Es ist möglich, das Snippet zu gewinnen, indem man einfach ein paar Änderungen an deiner Seite vornimmt.Wie findet man diese Möglichkeiten? Das ist ganz einfach.Gehe zum Site Explorer und filtere nach Keywords, die Featured Snippets auslösen, bei denen deine Website auf den Positionen 2–10 rangiert.Du fragst dich vielleicht, warum ich den Filter mit 2–10 Positionen und nicht mit 1–10 verwendet habe. Seitdem die SERP-Deduplizierung stattgefunden hat, wurden Featured Snippets zu einer der Top-10-Positionen und nicht nur ein zusätzliches Feature an der Spitze.Daher werden die überwiegende Mehrheit der Featured Snippets auf der ersten Position gezeigt. Tatsächlich befinden sich nur 2 von unseren 866 Snippets auf Positionen unter 1, so dass es ein einfacher Weg ist, fast alle Featured Snippets zu entfernen, für die du einen Rang einnimmst.Mit anderen Worten: Du bekommst eine Liste von niedrig schwelligen Gelegenheiten, Feature-Snippets von deinen Konkurrenten zu stehlen. Bereiten wir dich auf den Raub vor.Wir müssen Prioritäten setzen. 6.000 Feature-Snippets auf einmal zu stehlen, ist eine unmögliche Mission.Ich habe die Liste auf 72 Schlüsselwörter reduziert, indem ich diejenigen mit höherem Suchvolumen priorisiert habe, bei denen wir auf den Positionen 2–5 rangieren.Jetzt sieht alles viel überschaubarer aus.Der Filter für das Suchvolumen liegt auf der Hand, da es zu diesem Zeitpunkt keinen Sinn macht, auf Long-Tail-Keywords zu zielen. Was die Positionen betrifft und auf unsere Studie zurückverweisend, so steigt die Wahrscheinlichkeit, dass du ein Featured Snippets besitzt, mit deiner organischen Position für diese Suchanfrage.Nochmals, diese Filter werden für dich anders sein. Wenn du jedoch nicht bereits für eine beträchtliche Anzahl von Keywords ein Ranking einnimmst, würde ich vorschlagen, dass du dich darauf konzentrierst, mehr großartige Inhalte zu erstellen und Links aufzubauen.So, wir haben die Liste. Wie sieht der Schlachtplan aus?In unserem Fall würde ich weitere Prioritäten setzen, indem ich manuell nach Keywords mit einem soliden Geschäftswert suche. So ist zum Beispiel die Suchanfrage “beliebteste Websites” für uns weniger wertvoll als “wie bekomme ich Backlinks”, obwohl die erste das fünffache Suchvolumen hat. Menschen, die Links aufbauen wollen, werden mit viel größerer Wahrscheinlichkeit zu unseren Kunden.Wenn man diese Suchanfrage berücksichtigt, sehe ich folgendes:Wir können feststellen, dass Google hier ein Listenformat bevorzugt. Leider ist die einzige geeignete Antwort auf diese Anfrage in der Navigations-Sidebar in unserem Beitrag über “Wie man Backlinks erhält” zu finden. Und das ist eindeutig nur ein UX-Element:Die Seitenleiste bleibt auf deinem Bildschirm, wenn du den Artikel nur auf dem Desktop nach unten scrollst. Das ist ein Problem, wenn man bedenkt, dass wir uns in der Welt der mobilen Indizierung befinden. Hinzu kommt, dass es keinen unterstützenden Kontext gibt, der Google dazu veranlassen würde, sie zu ziehen.Vergleichen wir dies damit, wie der abgerufene Inhalt auf einer Website der Konkurrenz aussieht:Mein Bauchgefühl sagt mir, dass wir nur noch die Navigationsliste in unser Intro kopieren müssen. Etwas, das wir heutzutage sowieso ziemlich viel tun:Listennavigation in der Einleitung unseres SEO-Copywriting-Artikels.Ich glaube nicht nur, dass unsere Liste im Featured Snippet einen größeren Wert hätte, sondern es geht auch darum, worum es in dem Artikel eigentlich geht. Die Liste unseres Konkurrenten enthält interne Links zu ihren anderen Beiträgen, aber der vorgestellte Artikel beschreibt diese Taktiken nicht weiter.Kurz gesagt, du musst sicherstellen, dass dein Content Snippet-würdige Informationen enthält und zwar so, dass Google diese leicht analysieren, verstehen und interpretieren kann.Erstelle neue Inhalte mit Blick auf die Featured SnippetsLass uns von Anfang an eines klarstellen:Du solltest Inhalte nicht einfach so erstellen, dass sie auf ein bestimmtes Featured Snippet abzielen. Du nimmst Keywords ins Visier, weil sie gefragt und für dein Unternehmen relevant sind. Wenn dein Inhalt zufällig den Zuschlag für das Featured Snippet erhält, ist das das Sahnehäubchen auf dem Kuchen.Dennoch macht es immer noch Sinn, bei der Erstellung von Inhalten an Feature-Snippets zu denken.Nehmen wir zum Beispiel an, du hast einen Food-Blog und planst, einen Beitrag darüber zu schreiben, wie man Pizzateig herstellt. Du kannst dieselben Filter aus Site Explorer im Keyword-Explorer verwenden, um potenzielle Möglichkeiten für Feature-Snippets zu finden. Gib einfach das Seed-Keyword “Pizzateig” ein, gehe dann zum Bericht “Rankt auch für” und wende den Filter für Featured Snippets an:Was wir hier sehen, sind Keywords, nach denen auch die ranghöchsten Seiten für “Pizzateig” rangieren, die zufällig auch Auslöser für Featured Snippets sind. Wenn es uns gelingt, einige dieser Unterthemen in unser Pizzateigrezept zu integrieren, können wir sie vielleicht in den Snippets zum Ranken bringen.Das Problem ist, dass es hier Tausende von Keywords gibt. Es wäre nicht sinnvoll, sie alle einzubeziehen. Stattdessen wollen wir nach relevanten filtern, die ein vernünftiges monatliches Suchvolumen aufweisen und bei denen es Anzeichen dafür gibt, dass sie leicht zum Ranken zu bringen sind.Lass uns dazu ein paar Filter hinzufügen:Keyword Difficulty (KD): <=30Mindestsuchvolumen (monatlich): 100Keyword enthält: “pizza”Keyword enthält nicht: “Menü” (Es gibt eine Menge “Pizza Menü” Keywords, die Featured Snippets triggern)Jetzt haben wir 176 relevante und leicht zu ordnende Keywords, die auch Feature-Snippets auslösen. Jetzt müssen wir nur noch die Liste nach Unterthemen absuchen, die wir sinnvollerweise in unseren Artikel aufnehmen sollten.Eines, das mir sofort auffällt, ist “Kannst du Pizzateig einfrieren”. Ich bin ein guter Koch, aber ich käme nie auf die Idee, das in dem Rezept zu erwähnen.Wenn wir uns das aktuelle Featured Snippet für diese Frage ansehen, ist er leider recht gut.In diesem Fall mag es also etwas schwieriger sein, das Snippet zu “gewinnen”, da wir das aktuelle nicht wirklich verbessern können, aber es macht immer noch Sinn, etwas über das Einfrieren von Pizzateig in unseren Artikel aufzunehmen. Auch wenn wir das Featured Snippet nie gewinnen, ist es eine hilfreiche Information für die Leser.Denke bei der Erstellung und Optimierung deines Beitrags einfach an die “Regeln” des “Gewinnens von Featured Snippets”:Deinen Inhalt richtig formatieren und strukturieren (H1-H6, etc.)Versuche, zu komplizierte Sätze zu vermeiden. Prägnante Erklärungen gewinnen.Verwende die Sprache deines Publikums. Letztendlich verwendet Google bei der Sprachsuche Featured Snippets als Antworten.Nutze die Invertierte Pyramidenmethode (wo es Sinn ergibt).So behältst du den Überblick über deine Featured SnippetsDas Erhalten eines Featured Snippets ist gleichbedeutend mit dem ersten Rang für ein Keyword. Es kann sein, dass du bereits Keyword-Ranking-Positionen trackst, also lass mich dir helfen, es auf das Tracken von Featured Snippets zu erweitern.Gehe zum Rank Tracker.Zuallererst solltest du alle Keywords hinzufügen, bei denen du das Featured Snippet bereits besitzt.Um es noch einmal zusammenzufassen, erfahre hier, wie du diese finden kannst: Site Explorer -> Domain eingeben -> Organische Keywords -> SERP Features -> Featured Snippets -> Nur Verlinkung zum Ziel.Exportiere diesen Bericht in CSV, kopiere dann alle Keywords und füge sie im Rank Tracker ein.Rank Tracker -> Wähle das Projekt aus -> Füge Keywords hinzuAls nächstes füge alle Keywords mit Featured Snippets hinzu, die du aktiv verfolgst, d.h. in unserem Beispiel “wie man Backlinks erhält”.Ich empfehle, sie mit so etwas wie “Featured Snippets” zu kennzeichnen (das macht es nur schneller und einfacher, sie in Zukunft zu filtern), bevor du die Liste zu deinem Rank Tracker-Projekt hinzufügst.Klicke unten auf der Seite auf “Keywords hinzufügen” und du kannst sehen, wann du ein Featured Snippet gewinnst oder verlierst — hier ist wie es geht:Rank Tracker -> Projekt auswählen -> Übersicht -> Filter nach Snippets, die du mit dem “Tag”-Filter trackst -> Klicke den “SERP-Features” Tab -> Wähle “Featured Snippet” aus.Wie du an den Keywords, die ich verfolge, sehen kannst, hat die Website 11 von 61 Featured Snippets verloren, während 60 von 644 Featured Snippets aus der SERP verschwunden sind. Dies ist nur ein Vergleich von Woche zu Woche; die SERPs sind heutzutage wirklich unbeständig.Hier sind die wichtigsten Teile, die im Auge behalten werden müssen:die Anzahl der Featured Snippets, die du derzeit besitzt (plus die +/- Änderung im ausgewählten Zeitraum);die Gesamtzahl der Featured Snippets für die von dir verfolgten Keywords (plus die +/- Änderung für den Zeitraum);den prozentualen Anteil aller Keywords mit Featured Snippets, den du derzeit besitzt (z.B. wenn 100 getrackte Keywords Featured Snippets anzeigen und da steht 10%, dann besitzt du zehn Featured Snippets);ein Graph der deinen Fortschritt über die Zeit anzeigt.Um tiefer in die Besonderheiten auf der Keyword-Ebene einzutauchen, scrolle einfach nach unten zur Keyword-Liste und sieh dir die Zeitvergleichsdaten (in diesem Beispiel 7 Tage) an:Wir können in dieser Ansicht zwei neue Featured Snippets sehen, wobei das untere von der fünften Position aus angehoben wurde. Das ist die Abkürzung, von der ich spreche.Um die gewonnenen Fälle zu isolieren, müssen wir zwei weitere Filter anwenden:Position: verbessert (du hast einen höheren Rang als zu Beginn deines gewählten Zeitraums)SERP-Funktionen: Du rankst für das Featured SnippetScrolle auch hier wieder nach unten und sieh dir die Featured Snippet Gewinner der Woche (oder der von dir gewählten Periode) an:Um verlorene Featured Snippets zu sehen, wende einfach umgekehrte Filter an -> Rückgang der Positionen in den Top 10 und zeige nur Featured Snippets, die du nicht besitzt. Leider kannst du die Fälle, in denen du ein Snippet verloren hast, derzeit nicht isolieren, so dass du alle Rückgänge in den Top 10 sehen wirst.Vielleicht möchtest du ohnehin in Betracht ziehen, die Positionsrückgänge unabhängig von Featured Snippets zu überprüfen. Sortiere die Tabelle, wie oben gezeigt, nach dem Trafficaufkommen und achte auf große Trafficabfälle.Jetzt weißt du jedoch alles, was du brauchst, um SERPs mit deinen Featured Snippets zu dominieren. Ich glaube, dass es von nun an mehr grüne als rote Positionen geben wird.Wenn du irgendwelche Kommentare oder Fragen hast, zögere nicht mich auf Twitter zu kontaktieren.Übersetzt von: Sebastian Simon. Sebastian Simon beschäftigt sich seit 2009 mit SEO, aktuell tut er das bei seven-bytes.de und heine.de. Article PerformanceData from AhrefsVerlinkung von Websites 4 Sign up for AhrefsGet SEO metrics of any website or URL.The number of websites linking to this post.This post's estimated monthly organic search traffic.Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Michal Pecánek Vermarkter und Content-Autor bei Ahrefs. Süchtig nach SEO, Luftfahrt, Parfums, Sushi und Tacos.",
  "headers": [
    {
      "level": "H1",
      "text": "Wie man für Googles Featured Snippets optimiert"
    },
    {
      "level": "H2",
      "text": "Welche Arten von Featured Snippets gibt es?"
    },
    {
      "level": "H3",
      "text": "1. Abschnitt"
    },
    {
      "level": "H3",
      "text": "2. Nummerierte Listen"
    },
    {
      "level": "H3",
      "text": "3. Punktelisten"
    },
    {
      "level": "H3",
      "text": "4. Tabellen"
    },
    {
      "level": "H3",
      "text": "5. Video (üblicherweise von YouTube)"
    },
    {
      "level": "H2",
      "text": "Wie Featured Snippets die Suche und SEO beeinflussen"
    },
    {
      "level": "H3",
      "text": "Abkürzung zu den organischen Top-Ergebnissen"
    },
    {
      "level": "H3",
      "text": "Weniger Klicks… manchmal"
    },
    {
      "level": "H3",
      "text": "Featured Snippets sind großartige Branding-Möglichkeiten"
    },
    {
      "level": "H3",
      "text": "Featured Snippets nach der SERP-Deduplizierung"
    },
    {
      "level": "H3",
      "text": "Du kannst dich von Featured Snippets abmelden (aber mache das nicht)"
    },
    {
      "level": "H2",
      "text": "Wie findest und optimierst du Featured Snippets, die du bereits besitzt?"
    },
    {
      "level": "H2",
      "text": "Wie man für mehr Featured Snippets rankt"
    },
    {
      "level": "H3",
      "text": "Nutze Inhalte, die du bereits hast und für die du ein Ranking hast"
    },
    {
      "level": "H3",
      "text": "Erstelle neue Inhalte mit Blick auf die Featured Snippets"
    },
    {
      "level": "H2",
      "text": "So behältst du den Überblick über deine Featured Snippets"
    }
  ],
  "author": "Michal Pecánek"
}