{
  "url": "https://ahrefs.com/blog/de/google-discover/",
  "slug": "google-discover",
  "title": "Google Discover: Wie du rankst und Traffic erzeugst",
  "description": "Google Discover ist ein automatisch generierter, hochgradig personalisierter mobiler Feed, der Informationen und Nachrichten basierend auf deinen Online-Aktivitäten anzeigt.",
  "content": "Michal Pecánek Vermarkter und Content-Autor bei Ahrefs. Süchtig nach SEO, Luftfahrt, Parfums, Sushi und Tacos. Inhalt Google Discover ist ein automatisch generierter und stark personalisierter mobiler Feed, der auf deinen Online-Aktivitäten basiert. Er zeigt Informationen und Nachrichten zu den Themen, die dich interessieren, wie SEO oder Golf.Ein Beispiel für den Google Discover-Feed.Es ist eher ein soziales Netzwerk als eine Suchmaschine, aber deine Suchaktivität und ‑historie ist entscheidend für die Bereitstellung eines relevanten und zeitnahen Feeds.Millionen von Menschen sehen täglich einen personalisierten Google Discover-Feed auf ihren Mobilgeräten, und seit seiner Einführung im Jahr 2018 ist er zu einer soliden Traffic-Quelle für viele Websites geworden. Dies gilt insbesondere für Nachrichten- und Medienunternehmen, von denen viele mittlerweile den Großteil ihres organischen Traffics über Discover erhalten.Sogar unser bescheidener kleiner SEO-Blog bekam in den letzten sechs Monaten fast 150k Klicks davon:Google Discover ist allerdings noch eine große Unbekannte. Und weil dieses Thema die Mitarbeit von Experten erfordert, haben wir ein paar SEO-Experten um ihre Einblicke gebeten:Kevin Indig - VP of SEO & Content bei G2Suganthan Mohanadasan — Co-Founder und technischer SEO-Leiter bei Snippet DigitalDan Taylor — Head of SEO Research & Development bei SALT.agencyJohn Shehata — VP of Audience Development Strategy bei Condé Nast & Founder von NewzDashAber zunächst…Wie Google Discover deinen Feed generiertUm ein guter SEO zu werden, musst du wissen, wie Suchmaschinen funktionieren. Und das müssen wir auch bei Discover verstehen.Laut Google verwenden sie die folgenden Daten, um den Feed zu generieren:Deine Aktivitäten in allen Google-Produkten (z. B. deine Suchaktivitäten, die angesehenen YouTube-Videos und die Interaktion mit Discover-Ergebnissen) Standort-HistorieStandort-EinstellungenThemen, denen du folgstSiehst du jetzt die Ähnlichkeit zu sozialen Netzwerken? Der Feed spiegelt deine Hobbys, aktuellen Interessen und alles andere in der Welt wider, was für dich relevant ist. Er ist so personalisiert, dass er sogar deinen Wissensstand berücksichtigt und wie wichtig das Thema für dich ist.Zum Beispiel ist die Hälfte meines Feeds fast immer über SEO, da das das Thema ist, mit dem ich am meisten interagiere. Wie du sehen kannst, kannst du sogar dem Thema SEO “folgen”:Interessant ist, dass du überprüfen kannst, wie Google die Ergebnisse in deinem Feed kategorisiert. Suganthan verwies mich auf diese von Valentin Pletzer entdeckte Methode. Er fand heraus, dass du auf diese Informationen zugreifen kannst, indem du auf Feedback senden > Systemprotokolle > Kartenkategorie klickst:Dies sind die Kartenkategorien, auf die Valentin gestoßen ist, zusammen mit dem, was er denkt, was sie darstellen könnten:Vielen Dank an Valentin Pletzer für die Bereitstellung dieser Daten und Einblicke oben.Wir können zum Beispiel sehen, dass die Präsenz auf Google News sicherlich bei der Discover-Performance hilft, da es eine eigene “NEWS_HEADLINES”-Kategorie gibt. Wenn dies für dich relevant ist, lies John’s Anleitung zur Optimierung von Google News.Im Allgemeinen gilt: Wenn es eine Nachfrage nach deinen Inhalten gibt und diese die richtigen Signale an Google senden, wirst du Klicks von Menschen entdecken, die sich bereits dafür interessieren. Das ist ein enormer Vorteil im Vergleich zu sozialen Medien, wo Beiträge meist eine “kalte” Zielgruppe erreichen.Wie man Google Discover Traffic steuertZunächst einmal solltest du nicht zu viel Zeit damit verbringen, proaktiv auf Discover-Klicks zu setzen, es sei denn, du bist mit deinen SEO-Bemühungen schon weit fortgeschritten. Die meisten Leute sind besser dran, wenn sie dem normalen organischen Traffic den Vorrang geben. Nachrichtenseiten sind die Ausnahme, aber das weißt du bereits, wenn du für eine arbeitest.Die Optimierung für Google Discover ist ein SEO-Thema, das alle anderen an Unsicherheit übertrifft. Die einzigen verfügbaren Daten sind in deiner Google Search Console. Du kannst deine Konkurrenten nicht analysieren, und so ist der Umfang deiner Recherche ziemlich begrenzt.Es ist schwer vorherzusagen, wie ein bestimmter Inhalt in Discover abschneiden wird. Aus unserer eigenen Erfahrung in der B2B-SaaS-Branche können wir sagen, dass der Traffic nach der Veröffentlichung in den meisten Fällen innerhalb von 3–5 Tagen ansteigt:Einige immergrüne Inhalte schaffen es jedoch, eine konstante Zugkraft zu erhalten:Und manchmal kann es auch eine Kombination aus beiden Mustern sein:Allerdings kann es sein, dass manche Inhalte es nicht einmal in den Feed schaffen, obwohl diese die richtigen Dinge tun. Wie bei fast allem in der SEO kannst du nicht garantieren, dass X Y bewirkt; es geht nur darum, deine Chancen auf ein erwünschtes Ergebnis zu erhöhen.Zum Glück gibt es ein paar offizielle Tipps um die Wahrscheinlichkeit zu erhöhen, dass deine Inhalte in Discover erscheinen, die ich im Folgenden zusammen mit unseren einzigartigen Einblicken abdecken möchte. Aber zuerst solltest du wissen, dass indizierte Inhalte die Inhaltsrichtlinien einhalten müssen, um in Discover erscheinen zu können. Erst dann solltest du dich auf die folgenden Bereiche konzentrieren, um die Wahrscheinlichkeit zu erhöhen, dass deine Inhalte angezeigt werden: Eine mobilfreundliche Website habenVerwende einzigartige, hochwertige BilderRichte deine Inhalte und Metadaten ausVeröffentliche Inhalte zu beliebten Themen Arbeite an deinem E‑A-T Fokus auf EntitätenWerde eine Knowledge-Graph-EntitätErzeuge Interesse mit deiner Content-VerbreitungAktualisiere deinen Inhalt regelmäßigEinbetten deiner YouTube-Videos in ArtikelProbiere Web Stories aus1. Eine mobilfreundliche Website habenDiscover ist ein mobiler Feed, daher ist das mobile Erlebnis auf deiner Website enorm wichtig.Zumindest brauchst du eine responsive, schnell ladende Website mit wenig oder gar keiner Werbung, Pop-ups oder Interstitials. Sei außerdem auf Mai 2021 vorbereitet, wenn Core Web Vitals ein Teil des Ranking-Algorithmus werden, da Cumulative Layout Shift keine Metrik für die Seitengeschwindigkeit ist.Wenn du einen Schritt weiter gehen möchtest, solltest du die Verwendung von AMP in Betracht ziehen. John schätzt, dass mehr als 60 % aller Discover-Artikel auf AMP laufen. Natürlich ist diese Zahl stark von Nachrichten-Websites verzerrt, und die SEO-Meinungen zur Implementierung sind gemischt. Aber der Discover-Trend ist eindeutig:2. Verwende einzigartige, hochwertige BilderDiscover ist ein weiterer Feed, bei dem das Bild die meiste Aufmerksamkeit erhält, daher solltest du für alle visuellen Inhalte auf der Seite großartige, qualitativ hochwertige Bilder verwenden.Google empfiehlt, dass deine großen Bilder mindestens 1200px breit sein sollten und durch den max-image-preview:large robots meta tag oder durch die Verwendung von AMP aktiviert werden sollten. Das sollte deine Standardeinstellung sein, unabhängig von Discover, da es die beste Praxis für Bild-SEO ist. Plugins wie Yoast fügen dies automatisch hinzu.Du kannst auch die Eigenschaft Schema Image verwenden, um Google mehr Daten zur Verfügung zu stellen.3. Richte deine Inhalte und Metadaten ausTitle Tags und Meta Descriptions sollten den Inhalt der Seite zusammenfassen und Nutzer zum Klicken verleiten. Achte nur darauf, dass du hier kein Clickbait oder andere manipulative Taktiken verwendest, da Google in den Discover-Richtlinien explizit davor warnt.Eine interessante Sache, die wir aus Versehen herausgefunden haben, ist, dass Google Discover Open Graph-Meta-Tags berücksichtigt. Wir hatten einen Tippfehler in einem unserer og:title-Tags und er wurde im Discover-Feed angezeigt, obwohl der Titel-Tag korrekt war. Es gab ein fehlendes “L” am Anfang:4. Veröffentliche Inhalte zu beliebten ThemenDiscover neigt dazu, viele zeitnahe Inhalte über aktuelle Ereignisse anzuzeigen, weshalb Nachrichten-Websites den Feed dominieren.Aber es gibt auch viele immergrüne Inhalte. Unser Blog ist der Beweis dafür. Wir schreiben nicht über Trendthemen, aber wir bekommen trotzdem jeden Monat Zehntausende von Klicks von Discover.Discover Klicks auf den Ahrefs-Blog in den letzten drei Monaten.Dies geschieht, weil Discover ein personalisierter Feed ist und Inhalte zeigt, die neu für dich sind, nicht nur neu im Web. Nehmen wir zum Beispiel an, dass du im Begriff bist, in den Aktienmarkt zu investieren, was eine ganze Menge an Recherche erfordert. Wahrscheinlich wirst du in deinem Discover-Feed auf Artikel über Anlagetipps, Börsenmakler-Vergleiche und andere Dinge für Anfänger stoßen, die schon vor Monaten veröffentlicht worden sein könnten.Wie du auf immergrüne Themen zielst? Es beginnt mit der Keyword-Recherche. Gib einfach ein paar breite Themen in ein beliebtes Keyword-Recherche-Tool wie Keywords Explorer ein, und suche dann nach populären Themen.Nebenbei bemerkt. Wenn du neue oder trendige Themen finden möchtest, verwende Tools wie Google Trends oder Exploding Topics.Du solltest nur wissen, dass es selten ausreicht, nur über beliebte Themen zu schreiben. Google sagt, dass du dich auf gutes Copywriting und einzigartige Einblicke konzentrieren sollten, wenn du in Discover auftauchen willst.5. Arbeite an deinem E‑A-TGoogle sagt, dass sie Inhalte von Websites mit vielen Seiten beziehen, die Expertise, Autorität und Vertrauenswürdigkeit demonstrieren.Es gibt mehrere Möglichkeiten, dein E‑A-T zu beurteilen und zu unterstützen. Die Discover-Richtlinien besagen, dass du Folgendes tun solltest:Klare Daten, Bylines, Informationen über Autoren, die Publikation, den Verlag, das dahinter stehende Unternehmen oder Netzwerk sowie Kontaktinformationen, um mehr Vertrauen und Transparenz bei den Besuchern aufzubauen.Darüber hinaus kann es sich lohnen, strukturierte Daten zu verwenden, um die Punkte zu verbinden.Suganthan schlägt auch vor, sich die Affinitätskategorien von Google anzusehen und nach Themen zu suchen, bei denen du eine Autorität werden kannst. Das liegt daran, dass diese Zielgruppen mit “CORE”-Interessen-Kartenkategorien verbunden zu sein scheinen, wie zuvor aus den Protokollen ersichtlich.Der einfachste Weg, diese zu finden, ist der Bericht Affinitätskategorien in Google Analytics.Google Analytics > Zielgruppen > Interessen > AffinitätskategorienBericht der Affinitätskategorien aus dem offiziellen GA-Demokonto.Im Allgemeinen solltest du alles tun, um deine Marke als Branchenführer zu positionieren.6. Fokus auf EntitätenAls ich die Discover-Performance des Ahrefs-Blogs analysierte, gelang es mir, Themen herauszufinden, die besser abschneiden als andere. In der SEO-Welt sind es die Entitäten und ihre Verbindungen, die bestimmte Themen bilden.Bei den Einsichten unserer Mitwirkenden war klar, dass Entitäten hier eine bedeutende Rolle spielen, da jeder sie auf die eine oder andere Weise erwähnte.Es gibt eine Knowledge Graph-Schicht, die erstellt wurde, um abzubilden, wie sich die Interessen und das Fachwissen der Benutzer für jedes Thema im Laufe der Zeit entwickeln. Dies wird als Topic Layer bezeichnet und entsteht durch die Analyse aller Inhalte, die mit einem bestimmten Thema und all seinen Unterthemen verknüpft sind, um letztendlich alle Punkte zu verbinden.Es scheint, dass einige der Punkte zu Discover-Interessen werden können, ohne eine Knowledge Graph-Entität zu sein. Die Abfrage von “meta description” in der Knowledge Graph API liefert zum Beispiel keine Ergebnisse, aber in Discover wird es als Interesse angezeigt, dem du folgen kannst:Du kannst nicht in den Topic Layer eindringen, also müssen wir uns auf die übergeordneten Entitäten konzentrieren. Und das ist mehr als genug.Dein Ziel sollte es sein, Autorität im Rahmen von Entitäten zu haben, die mit deinem Unternehmen verbunden sind. Es gibt mehrere Möglichkeiten, dies zu erreichen, wenn du Inhalte erstellst:Sei konsistent in deiner KategorieDie meisten Websites befassen sich mit etwas Bestimmtem. Das kann Kaffee, Laptops, SEO oder etwas ganz anderes sein. Was auch immer es für dich ist, versuche bei der Erstellung von Inhalten nicht zu weit abzuweichen. Wenn du an einem Tag Inhalte über iPhones und am nächsten Tag über Kochtipps veröffentlichst, sendet das keine positiven Signale an dein Publikum oder Google. Es verwässert nur deine ‘Autorität’ über alle Kategorien hinweg. Die einzige Ausnahme von dieser Regel ist, wenn du für ein großes Medienunternehmen arbeitest, das alles abdeckt. Finden die Entitäten, die für deine Marke funktionierenIch habe versucht, Themen ausfindig zu machen, die am besten funktionieren, indem ich manuell durch unsere Discover-Berichte gegangen bin. Allerdings deckt diese Methode nur die wichtigsten Entitäten ab, und man kann sie nicht in großem Umfang anwenden.Wenn du bereits viele Seiten in Discover hast, hast du wahrscheinlich auch Zugang zu Entwickler-Ressourcen. Wenn das der Fall ist, kannst du tun, was John getan hat: Lasse deine Artikel durch das Natural Language Tool von Google laufen, kombiniere dann die Entitäten auf der Grundlage ihrer Wichtigkeit und analysiere, welche den meisten Discover-Traffic für dich gebracht haben.Dies ist ein Beispiel dafür, wie die Entitätsanalyse aussieht:Du kannst die NLP-API selbst testen. Scrolle einfach nach unten zum Demo-Eingabefenster und füge dort einige deiner Inhalte ein.Verwende Google Images, um zugehörige Objekte und Informationen zu findenDan hat sich eine einfache Methode ausgedacht, um herauszufinden, welche anderen Themen Google mit einem Thema assoziiert. Gehe zu Google Images, suche nach deinem Hauptstichwort und sieh dir dann die verwandten Entity-Tags am oberen Rand an:Alternativ kannst du auch ein Tool wie den Entity Explorer verwenden, das die Daten mit der gleichen Methode zu erhalten scheint.Nutze dies als Inspiration dafür, was du zu deinen aktuellen oder zukünftigen Inhalten hinzufügen kannst. Dan erlebte eine erhöhte Discover-Performance, nachdem er verwandte Entitäten und Informationen in seinen Content integriert hatte. Er wurde auch für mehr Keywords gerankt.7. Werde eine Knowledge-Graph-EntitätPersonen können deiner Marke in Discover nur folgen, wenn sie im Knowledge Graph enthalten ist. Du kannst überprüfen, ob dies der Fall ist, indem du deine Marke googelst. Wenn in den Suchergebnissen ein Knowledge Panel angezeigt wird, befindet sie sich im Knowledge Graph:Knowledge Panel für Gibson Brands, Inc.Interessant ist jedoch, dass selbst wenn jemand deiner Marke folgt, deine Inhalte möglicherweise nicht in seinem Discover-Feed angezeigt werden. Kevin und ich haben das beide getestet. Ich folge MailChimp seit ein paar Monaten auf Discover und ich habe noch keinen ihrer Inhalte in meinem Feed gesehen.Wie hilft also eine Knowledge Graph-Entität dabei, deine Sichtbarkeit in Discover zu verbessern?Die Aufnahme in den Knowledge Graph ist ein Zeichen dafür, dass deine Online-Präsenz für Google stark genug ist, um deine Marke in den richtigen Kontext zu setzen. Mit anderen Worten, es versteht, welche Entitäten und Interessen mit deiner Marke verbunden sind und kann deine Inhalte daher Menschen zeigen, die sich für diese Dinge interessieren. Empfohlene Lektüre: Googles Knowledge Graph erklärt: Wie er die Suchmaschinenoptimierung beeinflusst8. Erzeuge Interesse mit deiner Content-VerbreitungEs macht Sinn, dass Discover Inhalte mit hohem Engagement präsentieren möchte. Wir können bestätigen, dass Beiträge mit mehr Discover-Klicks auch zu einer vergleichsweise hohen CTR in Discover neigen.Was vielleicht noch überraschender ist: Wir alle haben festgestellt, dass es eine hohe Korrelation zwischen dem Engagement in den sozialen Medien und deiner Discover-Performance zu geben scheint.John hat sogar die Zahlen ausgewertet. Er fand heraus, dass der Korrelationskoeffizient zwischen Discover-Performance und Twitter-Engagement in den USA bei satten 0,91 liegt. Das ist eine signifikant hohe Korrelation, aber wie immer ist das nicht gleichbedeutend mit Kausalität. Wenn du mit deinen Inhalten Aufmerksamkeit erregst, profitierst du davon, auch wenn Google sie ignoriert.John fügt außerdem hinzu, dass dieser “Buzz-Faktor” mit der Discover-Performance in bestimmten Ländern zusammenhängen könnte. Während Twitter in den USA eine bedeutende Rolle spielt, könnte es anderswo von anderen Plattformen überschattet werden. Das bedeutet, dass du deine Inhalte auf lokal populären Kanälen verbreiten solltest.Bei Ahrefs können wir sehen, dass dies in der Tat eine große Rolle dabei spielen kann, Klicks zu entdecken. Wir lokalisieren unsere Blog-Inhalte in fünf weitere Sprachen. Diese Artikel sind im Wesentlichen die gleichen wie unsere englischen, die gut performen, dennoch haben wir es nur geschafft, ein paar Discover-Klicks auf einige spanische Beiträge zu bekommen.Der einzige Unterschied? Wir konzentrieren uns noch nicht auf die richtige Verteilung von Inhalten in anderen Sprachen.Wiederum beweist nichts davon eine Kausalität, aber Suganthan brachte auch ein Experiment in Bezug auf das soziale Engagement-Signal zur Sprache. JR Oakes brachte Menschen dazu, sich mit seinem Tweet zu beschäftigen, der einen absichtlich unsinnigen Artikel enthielt, und er schaffte es in den Discover-Feed:Holy crap BAM! Thanks for all the retweets. Findings: Crappy machine-generated content + a bunch of Twitter shares = Google Discover card. https://t.co/sXtoylnX9z pic.twitter.com/pudHXdwcNO— JR Oakes (@jroakes) July 2, 2019 9. Aktualisiere deinen Inhalt regelmäßigNur weil deine Seite jetzt nicht in Discover auftaucht, heißt das nicht, dass sie es das nie wird. Hier ist ein Artikel, den wir zum ersten Mal im Jahr 2017 veröffentlicht haben und der nie einen Klick in Discover erhalten hat, bis wir ihn neu geschrieben und veröffentlicht haben:Natürlich haben wir den Artikel nicht aktualisiert, nur um Discover-Klicks zu bekommen. Wir haben ihn aktualisiert, um zu versuchen, seine Rankings und den organischen Traffic aus “normalen” Suchergebnissen zu verbessern. Die Klicks von Discover waren nur ein netter Bonus.Die Wiederveröffentlichung von Inhalten ist eine unserer bevorzugten Wachstumstaktiken. Laut Content Explorer haben wir in den letzten 12 Monaten 60 Seiten aktualisiert:Du kannst im Content Explorer von Ahrefs überprüfen, wie häufig eine Website ihre Inhalte neu veröffentlicht.All dies ist nicht nur unsere Erfahrung. John und Suganthan bestätigen, dass das häufige Auffrischen immergrüner Inhalte auch bei ihnen gut funktioniert.10. Einbetten deiner YouTube-Videos in ArtikelYouTube-Videos sind recht häufig in Discover-Feeds zu sehen:Wenn du sie in deine Inhalte einbettest, besteht die Chance, dass die Videos in Discover eigenständig angezeigt werden und sogar den Inhalt selbst übertreffen. Und wie Kevin betont, musst du nicht einmal Schema Markup verwenden.Wir haben einige Artikel, die nur ein paar hundert Klicks erhielten, aber ihre eingebetteten Videos erhielten Tausende. Wir behandeln einige unserer Themen sowohl in Video- als auch in schriftlicher Form, daher scheint die Wiederverwendung deiner Inhalte eine gute Taktik zu sein, um den Traffic von Discover zu steigern.Denke nur daran, dass die Klicks auf das Video nicht auf deine Website, sondern auf YouTube gehen.11. Probiere Web Stories ausFrüher als AMP-Stories bekannt, sind dies Googles Variante der Stories, die wir von Instagram und anderen sozialen Netzwerken kennen.Google hat kürzlich angekündigt, dass sie Web Stories im Discover-Feed unterstützen. Wenn diese Art von Inhalt etwas ist, das deine Zeit wert ist, probiere es aus. Zum Zeitpunkt des Schreibens ist es nur für englische Inhalte in den USA verfügbar.Kevin bestätigte, dass er mit diesen Web Stories experimentiert hat, und sie wurden tatsächlich in Discover vorgestellt.SchlussgedankenDu kannst den Google Discover-Traffic unabhängig von deinem Geschäft nutzen. Es wird keine Priorität sein, es sei denn, du hast eine Nachrichten-Website, aber die Optimierungstipps sind wahrscheinlich nichts, was du bei deiner täglichen SEO-Arbeit nicht ohnehin tun würdest.Die Anwendung dieser Tipps wird nicht nur für Discover von Vorteil sein. Das ist ein Nebeneffekt. Sie werden zu einer allgemein besseren SEO, Content-Verteilung und Traffic-Diversifizierung führen.Das Tolle an Google Discover ist, dass es auch dann Klicks bringen kann, wenn die primären Keywords keinen Suchbedarf haben. Das allgemeine Thema sollte immer noch die Interessen der Leute widerspiegeln, aber das ist ein weiteres Argument für die Veröffentlichung von Inhalten, die nicht primär auf die Steigerung des Suchverkehrs ausgerichtet sind.Hast du weitere Discover-Einsichten oder Fragen? Ping mich auf Twitter an.Übersetzt von: Sebastian Simon. Sebastian Simon beschäftigt sich seit 2009 mit SEO, aktuell tut er das bei seven-bytes.de und heine.de. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Michal Pecánek Vermarkter und Content-Autor bei Ahrefs. Süchtig nach SEO, Luftfahrt, Parfums, Sushi und Tacos.",
  "headers": [
    {
      "level": "H1",
      "text": "Google Discover: Wie du rankst und Traffic erzeugst"
    },
    {
      "level": "H2",
      "text": "Wie Google Discover deinen Feed generiert"
    },
    {
      "level": "H2",
      "text": "Wie man Google Discover Traffic steuert"
    },
    {
      "level": "H3",
      "text": "1. Eine mobilfreundliche Website haben"
    },
    {
      "level": "H3",
      "text": "2. Verwende einzigartige, hochwertige Bilder"
    },
    {
      "level": "H3",
      "text": "3. Richte deine Inhalte und Metadaten aus"
    },
    {
      "level": "H3",
      "text": "4. Veröffentliche Inhalte zu beliebten Themen"
    },
    {
      "level": "H3",
      "text": "5. Arbeite an deinem E‑A-T"
    },
    {
      "level": "H3",
      "text": "6. Fokus auf Entitäten"
    },
    {
      "level": "H4",
      "text": "Sei konsistent in deiner Kategorie"
    },
    {
      "level": "H4",
      "text": "Finden die Entitäten, die für deine Marke funktionieren"
    },
    {
      "level": "H4",
      "text": "Verwende Google Images, um zugehörige Objekte und Informationen zu finden"
    },
    {
      "level": "H3",
      "text": "7. Werde eine Knowledge-Graph-Entität"
    },
    {
      "level": "H3",
      "text": "8. Erzeuge Interesse mit deiner Content-Verbreitung"
    },
    {
      "level": "H3",
      "text": "9. Aktualisiere deinen Inhalt regelmäßig"
    },
    {
      "level": "H3",
      "text": "10. Einbetten deiner YouTube-Videos in Artikel"
    },
    {
      "level": "H3",
      "text": "11. Probiere Web Stories aus"
    },
    {
      "level": "H2",
      "text": "Schlussgedanken"
    }
  ],
  "author": "Michal Pecánek"
}