{
  "url": "https://ahrefs.com/blog/de/google-analytics-fur-seo/",
  "slug": "google-analytics-fur-seo",
  "title": "Wie man Google Analytics nutzt, um die SEO Performance zu verbessern",
  "description": "Google Analytics ist mächtig, aber nur, wenn man weiß, wie man es richtig nutzt. Lerne 7 Möglichkeiten kennen, wie du das kostenlose Tool nutzen kannst, um mehr organischen Traffic zu erzielen und deine SEO zu verbessern.",
  "content": "Michal Pecánek Vermarkter und Content-Autor bei Ahrefs. Süchtig nach SEO, Luftfahrt, Parfums, Sushi und Tacos. Inhalt Jeder nutzt Google Analytics, aber kaum jemand weiß, wie man es dazu verwendet, um seine SEO zu verbessern.Das ist nicht überraschend. Google Analytics ist ein leistungsfähiges Tool, aber daraus wertvolle und nützliche Erkenntnisse zu gewinnen, kann sich oft wie das Reißen eines Zahnes anfühlen — besonders für Anfänger.Allerdings ist es gar nicht so schwierig. Du musst nur wissen, welche Daten relevant für dich sind, wie du diese interpretierst und welche Maßnahmen du anschließend ergreifst.In diesem Leitfaden zeigen wir dir sieben Möglichkeiten, wie du Google Analytics dazu nutzen kannst, um deine SEO zu verbessern. Dabei decken wir auch einige häufige Fehler auf, die du vermeiden solltest.Lass uns mit den Basics beginnen.Erste Schritte mit Google AnalyticsWenn du dich zum ersten Mal anmeldest, siehst du das Dashboard “Home”.Hier sehen wir vorerst nur Metriken zum Angeben, aber ohne nützliche Erkenntnisse. Du bist besser dran, wenn du dir einzelne Berichte ansiehst, die du auf der linken Seite des Bildschirms nach Themen gruppiert finden kannst.Berichte geben zwei wesentliche Informationen preis: Dimensionen und Kennzahlen.Dimensionen sind Attribute von Daten. Metriken sind quantitative Datenpunkte, die mit dieser Dimension verbunden sind.Klingt verwirrend? Ist es aber nicht. Es ist ziemlich einfach.Werfen wir einen Blick auf die Daten im Bericht “Landing Pages”:Nebenbei bemerkt. Die Daten in diesem Beitrag stammen größtenteils aus dem offiziellen GA Demo-Konto. Einige Berichte und Daten sind dort jedoch nicht verfügbar, daher habe ich hin und wieder auch echte Business Accounts verwendet.Hier ist die Dimension die Landing Page. Die anderen Spalten zeigen Metriken an, die mit der jeweiligen Landing Page verbunden sind, wie z.B. die Anzahl der Sessions über den von dir ausgewählten Zeitraum.Wenn du es noch genauer haben möchtest, kannst du jedem dieser Berichte eine sekundäre Dimension hinzufügen.Fügen wir hier beispielsweise “Land/Country” als sekundäre Dimension hinzu.Jetzt sehen wir Metriken für jede Landing Page (erste Dimension) aufgeschlüsselt nach Land (sekundäre Dimension). Zum Beispiel sehen wir, dass 8.274 Nutzer aus Großbritannien ihre Session auf der Homepage begonnen haben.Was ist, wenn du nur eine bestimmte Teilmenge der Daten sehen möchtest, z.B. organischen Traffic aus Großbritannien?Das bringt uns zu den Segmenten und Filtern.Segmente sind eine Möglichkeit, Daten nur für eine Untergruppe von Nutzern oder Sessions in den Berichten zu sehen. Du kannst zum Beispiel nach organischem Traffic segmentieren, etwa so:Filter sind ähnlich wie Segmente, aber sie gelten nur für den Bericht, den du ausgewählt hast.Zum Beispiel können wir einen Filter verwenden, um nur Daten aus Großbritannien zu sehen:Das ist so viel detaillierter als der Standardbericht, meinst du nicht auch?Gut. Kommen wir nun zu den spannenderen Dingen.7 praktische Methoden, um mit Google Analytics die SEO zu analysieren und zu verbessernDie Grundlagen zu kennen ist wichtig, aber wie erhältst du aussagekräftige Erkenntnisse und kannst dadurch deine SEO verbessern?Hier sind 7 Möglichkeiten:Low Hanging-Möglichkeiten finden, um den Traffic/Umsatz zu steigernPages mit hoher Conversion Rate finden und deren SEO verbessernLanding Pages verbessern, die zu Conversions beitragenKeyword-Möglichkeiten finden, indem du die interne Site-Suche verfolgstEinbrüche und Spitzen im organischen Traffic automatisch messenAlerts für 404-Pages einstellenAnnotationen verwenden, um Probleme und Änderungen zu lokalisieren1. Low Hanging-Möglichkeiten finden, um den Traffic/Umsatz zu steigernPages ranken nicht für die Ewigkeit. Sieh dir den Rückgang des Traffics unserer Liste der Top-Google-Suchen im Jahr 2018 an:Traffic-Schätzungen im Zeitverlauf über den Ahrefs Site Explorer.Das ist ein Rückgang von 54% in etwas mehr als nur einem Monat.Aber du wirst feststellen, dass der Traffic kurz danach in die Höhe geschnellt ist:Was hat sich also geändert?Antwort: Wir haben den Beitrag aktualisiert und neu veröffentlicht, um ihm wieder zu seinem früheren Glanz zu verhelfen.Die Frage ist: Wie findest du Seiten, die reif für eine Neuveröffentlichung sind?Du kannst zwar den Site Explorer von Ahrefs oder den Performance-Bericht in der Google Search Console verwenden, aber am besten ist es, Google Analytics zu nutzen. Warum? Weil du damit Conversion-Daten erhältst, die du nutzen kannst, um deine SEO-Bemühungen mit Business-Kennzahlen zu verknüpfen.Und so funktioniert es:Gehe zu Acquisition > Search Console > Landing Pages.Wähle einen Zeitraum für den Vergleich. Wir suchen vor allem nach Content, der neu veröffentlicht werden muss, daher lohnt es sich, mindestens sechs Monate zu vergleichen.Sortiere die Tabelle nach Klicks und wähle dann die Landing Page aus, die du untersuchen möchtest, um die Daten der Suchanfrage zu sehen.Suche nach möglichen Ursachen, erkenne Muster und ergreife Maßnahmen, um mehr organischen Traffic zu generieren.Natürlich ist der letzte Teil leichter gesagt als getan. Also, worauf solltest du achten?Überlege dir zunächst, ob die Seite ein Thema behandelt, bei dem Aktualität ein Ranking-Faktor ist. Das war bei unserem Beitrag über die Top-Suchanfragen bei Google (2018) der Fall. Jedoch wollte niemand die Top-Suchanfragen aus dem vergangenen Jahr sehen, also ging der Traffic zurück.Zweitens: Wenn du eine signifikante Veränderung des organischen Traffics auf deiner Homepage wahrnimmst, liegt das normalerweise an einer Fluktuation im Suchvolumen der Navigational Queries. Vielleicht bist du vor sechs Monaten viral gegangen und mehr Personen haben deine Marke gegoogelt, aber dann ist der Traffic natürlich wieder auf den Mittelwert zurückgefallen?Wenn wir uns die Schwankungen im Suchvolumen für “Aviation Gin” ansehen, scheint genau das nach der brillanten TV-Werbung passiert zu sein, die von der miserablen Peloton-Werbung profitierte.Monatlicher Anstieg des Suchvolumens für “aviation gin” im Dezember 2019, dem Zeitpunkt der Ausstrahlung des TV-Spots. Daten via Ahrefs Keywords Explorer.Wenn keiner dieser Punkte der Übeltäter zu sein scheint, muss man tiefer graben. Es könnte eine Vielzahl von Gründen für einen Traffic-Rückgang geben.Hier sind für den Anfang ein paar nützliche weitere Dimensionen:Device-Kategorie: Wenn die Traffic-Veränderung hauptsächlich auf eine Device-Kategorie zurückzuführen ist, solltest du nach gerätespezifischen UX-Problemen, Problemen mit der Seitengeschwindigkeit und Content-Unterschieden zwischen den Geräten suchen. Denk daran, dass Google die Mobile-First-Indizierung verwendet. Wenn deine Website also mobilen Nutzern weniger Informationen anzeigt als Desktop-Nutzern, könnte das ein Problem darstellen.Land/Country: Traffic-Einbrüche aus bestimmten Ländern können Lokalisierungs- oder Indexierungsprobleme bedeuten. Wenn du Content in mehreren Sprachen zur Verfügung stellst, beginne mit der Überprüfung deiner Hreflang Tags.TippVergesse nicht, einen Blick auf das Zeitdiagramm über dem Bericht zu werfen. Es ist besonders wichtig, auf Einbrüche oder Spitzen in der Zeit zu achten, in der Google ein Algorithmus-Update angekündigt hat. Du könntest auch auf Traffic-Spitzen stoßen, die durch das Ranking für irrelevante Keywords verursacht werden. Google ist nicht perfekt.2. Pages mit hoher Conversion Rate finden und deren SEO verbessernDas ultimative Ziel von SEO ist in der Regel, mehr Umsätze über die organische Suche zu erzielen. Eine der einfachsten Möglichkeiten, das zu erreichen, ist die Verbesserung der Rankings für deine wertvollsten Webpages.Und so funktioniert es:Gehe zu Acquisition > Search Console > Landing Pages.Wähle ein wichtiges Ziel aus und sortiere die Tabelle nach Conversion Rate.Gib jede URL in den Site Explorer von Ahrefs ein und prüfe den Bericht “Organische Keywords”.Filtere nach Keywords, bei denen du auf den Positionen 3–10 rankst.Klicke auf die Schaltfläche “SERP” und vergleiche die SEO-Kennzahlen deiner Webpage mit denen der Seiten, die vor dir ranken. In unserem Fall sieht es so aus, dass die Seiten über uns viel mehr verweisende Domains haben.Ergreife Maßnahmen, um deine Webpage dort zu verbessern, wo sie zu kurz kommt. Folge unserem Leitfaden für ein höheres Ranking bei Google, wenn du nicht sicher bist, wo du anfangen sollst.Kein Ahrefs-Nutzer?Nutze die Google Search Console, Google und den Free Backlink Checker von Ahrefs für Ähnliches.Finde Keywords, für die du rankst in der Search Console.Suche nach ihnen auf Google.Überprüfe die Backlinks zu den top-ranking-URLs in unserem kostenlosen Backlink-Checker.Vergleiche diese mit deiner Webpage, um zu sehen, ob und wo diese zu kurz kommt.3. Optimiere Landing Pages, die zu einer höheren Conversion beitragenNutzer kaufen selten auf Websites etwas, die sie noch nie zuvor besucht haben. Auch landen sie dort nicht einfach so. Sie begeben sich auf eine Journey (Reise) und besuchen dabei oft mehrere Seiten auf deiner Website.Nehmen wir zum Beispiel an, für jemanden ist die Keyword-Recherche neu. Diese Person betreibt eine Google-Recherche, um mehr zu erfahren, und stößt dabei auf unseren Keyword-Recherche-Leitfaden (und YouTube-Videos).Sie lesen die Infos. Lernen daraus. Und das war’s fürs erste. Sie widmen sich wieder ihrer Arbeit.Eine Woche später, wenn sie mehr Zeit haben, machen sie dort weiter, wo sie aufgehört haben und suchen nach einigen Keyword-Recherche-Tools. Da sie wissen, dass wir wertvolle Inhalte produzieren, landen sie auf unserer Liste, wo sie sich für eine Testversion anmelden.Standardmäßig schreibt Google Analytics 100% der Conversion der letzten Landing Page zu, die der Nutzer besucht hat (vorausgesetzt, es war ein Non-Direct-Click). Aber die Realität ist, dass es wahrscheinlich zu keiner Conversion gekommen wäre, wenn die Person nicht zuerst unseren Blogbeitrag gelesen hätte. Technisch gesehen hat diese Seite also die Conversion unterstützt.Verstehst du, worauf das hinausläuft?Die Optimierung der SEO für diese Seiten führt wahrscheinlich zu einer Steigerung der Conversion-Rate und des Umsatzes.Aber wie finden wir sie?Gehe zu Conversions > Multi-Channel Funnels > Assisted Conversions (unterstützte Conversions)Wähle eine Conversion aus dem Dropdown-Menü aus. (Standardmäßig sind alle Conversions ausgewählt, was nicht ideal ist.) Lege ein Zeitfenster für die Zuordnung fest. (Das ist im Grunde eine Anzahl von Tagen, die vor der Conversion berücksichtigt werden sollen.)WICHTIGStelle sicher, dass du dieses basierend auf der Länge des Verkaufszyklus deines Unternehmens anpasst.Zum Beispiel sollte man im B2B-Bereich in der Regel das längste Zeitfenster wählen, da die Dauer des Entscheidungsprozesses vor der Conversion länger ist als z.B. beim Online-Kauf von Kleidung. Spiele also mit dem Fenster herum und prüfe, wie es sich auf die Anzahl der unterstützten Conversions im unten stehenden Bericht auswirkt.Klicke auf “Organische Suche” unten im Bericht.Gib die Landing Page URL als sekundäre Dimension an.Voilà. Jetzt siehst du eine Auflistung der organischen Landing Pages, sortiert nach der Anzahl der unterstützten Conversions.Priorisiere diese Webpages und verbessere ihre SEO.4. Keyword-Möglichkeiten finden, indem du die interne Site-Suche verfolgstWenn du einen E‑Commerce-Shop, ein Hilfe-Center, eine Wissensdatenbank oder eine andere große Website hast, dann hast du wahrscheinlich auch eine interne Suchmaschine.Besucher nutzen sie, um bestimmte Marken, Produkte und Artikel auf deiner Website zu finden. Suche nach kabellosen Ladegeräten auf der Website von Apple.Eine der interessanteren Funktionen von GA ist, dass es diese internen Site-Suchen verfolgen kann.Es wird nach Keywords gesucht, die noch keine gute Landing Page haben. Das kann daran liegen, dass es überhaupt keinen relevanten Content gibt, oder daran, dass man für Keywords rankt, die nicht mit der Suchintention übereinstimmen.Das sind die dazugehörigen Schritte:Sieh dir dieses Tutorial an, um das interne Such-Tracking einzurichten.Sobald du die Daten lange genug gesammelt hast (über mehrere Monate), tauche in den Search Terms — Bericht ein, den du unter Behaviour > Site Search findest.Wende einen sinnvollen Filter an, um Long-Tail Keywords und Tippfehler auszuschließen:Sortiere die Tabelle nach dem Prozentsatz der Search Exits (Suchabbrüche) und wende die gewichtete Sortierart an.(Das ist der einfachste Priorisierungsprozess innerhalb von GA. Es zeigt Suchanfragen, nach denen Nutzer gesucht haben, sortiert nach der Wahrscheinlichkeit, dass es kein zufriedenstellendes Suchergebnis gab. Nutzer verließen die Suche, nachdem sie diese durchgeführt hatten, was zur Suchabbruch-Metrik zählte. Wir verwenden die gewichtete Sortierung, um statistisch bedeutendere Suchbegriffe zu priorisieren).Gehe die Begriffe durch und überlege, ob du neuen Content entsprechend der Suchnachfrage erstellen möchtest.Wenn du noch weiter gehen möchtest, gib die Suchanfragen in ein Keyword-Recherche-Tool wie den Keywords Explorer von Ahrefs ein und überprüfe das Suchvolumen.Die Logik hierbei ist, dass, wenn viele Personen nach Infos auf deiner Website suchen, könnte es auch viele Personen geben, die bei Google danach suchen. Du kannst also die GA-Daten nutzen, um neue Ideen für Keywords und Content zu finden.Überprüfe für die genauen Keywords jedoch nicht nur das Suchvolumen. Sieh dir auch die Berichte zu den Keyword-Ideen an, um noch mehr potenzielle Themen zu finden, für die du ranken kannst.5. Einbrüche und Spitzen im organischen Traffic automatisch messenDu kannst deine SEO nicht verbessern, wenn du keine Fehlerüberwachung betreibst. Es ist ineffizient, das manuell zu tun. Deshalb empfiehlt es sich, Alerts für die organische Performance einzurichten.Gehe zu Admin > View column > Custom Alerts > Create a new alert.Richte einen Alert ein, der ausgelöst wird, wenn du einen Anstieg oder Rückgang des organischen Traffics um X% in einem bestimmten Zeitraum verzeichnest. Ein Rückgang von 20% und ein Anstieg von 30% von Woche zu Woche ist ein guter Ausgangspunkt, aber du kannst diese Zahlen je nach der Volatilität deiner Website anpassen.Klicke auf “Alert speichern” — und fertig.Während der Grund für die Überwachung von Traffic-Rückgängen offensichtlich ist, fragen Sie sich vielleicht, warum es Sinn macht, dies mit Traffic-Spitzen zu tun?Während der Grund für die Überwachung von Traffic-Rückgängen offensichtlich ist, wunderst du dich vielleicht, warum es Sinn macht, dies auch mit Traffic-Spitzen zu tun?Zwei Gründe:Wenn die Traffic-Spitze legitim ist, was bedeutet, dass du mehr Traffic von relevanten Keywords erhältst, wirst du das mit anderen Seiten wiederholen wollen.Suchmaschinen sind nicht fehlerfrei. Sie könnten anfangen, deine Seiten für irrelevante Keywords zu ranken, und das ist etwas, das du für das Reporting berücksichtigen musst.TippDu kannst diese Alerts global für alle Ansichten einrichten, auf die du Zugriff hast. Wähle einfach die Ansichten im Dropdown-Menü neben der Hauptansicht aus, in der du sie einstellst.6. Alerts für 404-Pages einrichtenBleiben wir noch ein wenig bei der Überwachung und Automatisierung.Der “404 — Page Not Found”-Fehler ist unvermeidlich und etwas, das du überwachen solltest. Und das kannst du in GA tun.Erstens, stelle sicher, dass alle deine 404-Seiten einen einheitlichen Seitentitel haben, wie “404 — Seite nicht gefunden” oder “Seite nicht gefunden”. Zweitens, leite sie nirgendwohin weiter; die URL sollte die gleiche bleiben.Wenn du diese Anforderungen erfüllst, kannst du einen Alert einrichten:Für die erste Bedingung: Gib deinen Seitentitel für 404-Seiten ein.Für die zweite Bedingung: Beginne niedrig und arbeite dich nach oben. Auf diese Weise erhältst du keine Benachrichtigungen, wenn alles normal ist. Je größer deine Website ist, desto größer sollte die Zahl sein, mit der du beginnst. Denke daran, dass einige 404er aufgrund von Tippfehlern unvermeidlich sind, daher sollte diese Zahl hoch genug sein, um diese auszuschließen.Jetzt hast du alles, was du für ordnungsgemäße 404-Alerts und eine Überwachung benötigst.Ab hier gilt es nur noch herauszufinden, was die Ursache für die 404-Seite war. War es ein Tippfehler? Hast du interne oder externe Links, die auf die URL verweisen?Wie das funktioniert, erfährst du in unserem Leitfaden zur Behebung von Broken Links.7. Annotationen verwenden, um Probleme und Änderungen zu lokalisierenGoogle Analytics-Vermerke sind Notizen, die in jedem Zeitdiagramm des Tools angezeigt werden.Wofür sind sie nützlich? Zum Protokollieren von Änderungen.Vielleicht hast du den Grund für einen kürzlichen Traffic-Einbruch herausgefunden? Oder eine seitenweite technische SEO-Änderung durchgeführt? Oder vielleicht testest du ein neues Titel-Tag-Format?Was auch immer die Änderung ist, die Protokollierung mit Vermerken wird dir dabei helfen, den Überblick zu bewahren.Wähle dazu einen relevanten Zeitrahmen aus, klicke auf das Roll-down und gib deine Notiz ein.Ein weiterer Vorteil von Vermerken ist es, die Auswirkungen von Änderungen besser einschätzen zu können.Wenn du zum Beispiel einen starken Anstieg oder Rückgang des Traffics bemerkst, kannst du auf die Vermerke zurückblicken, um mögliche Auslöser zu erkennen. Du kannst dann Änderungen, die zu positiven Ergebnissen geführt haben, wiederholen und Fehler, die zu negativen Ergebnissen geführt haben, vermeiden.8 häufige Google Analytics-Fehler, die du vermeiden solltestGoogle Analytics ist ein guter Diener, aber ein schlechter Lehrmeister.Fehler bei der Einrichtung, das Heranziehen von falschen Daten oder die Fehlinterpretation der Berichte sind nur einige Beispiele, die zu schlechten Geschäfts- und Marketingentscheidungen führen.In diesem Sinne, hier sind acht Fehler, die du unbedingt vermeiden solltest:Fehler #1: Google Analytics-Tracking falsch einrichtenDie meisten Personen machen Fehler beim Einrichten von Google Analytics. Während einige schwerwiegender sind als andere, können selbst kleine Fehler die Genauigkeit und Nützlichkeit deiner Daten ernsthaft beeinträchtigen.Hier sind ein paar der häufigsten:Fehlender Tracking-Code;Mehrere Tracking-Codes auf einer Webpage;Keine Verweis-Ausschlussliste verwenden;Falsch eingerichtete Interaktionsereignisse;Tracking von Websites, die auf JavaScript-Frameworks mit Standardeinstellungen aufgebaut sind.Wenn du eines dieser Probleme auf deiner Seite vermutest oder dir beim Set-up nicht sicher bist, gibt es viele Artikel im Internet, die dir helfen können. Wenn du es dir leisten kannst, empfehlen wir dir auch, in eine professionelle Beratung, Prüfung oder ein professionelles Set-up zu investieren.Fehler #2. Erkenntnisse aus unbedeutenden Stichproben ableitenVerschwende keine Zeit damit, etwas auf Basis einer statistisch unbedeutenden Stichprobe zu entscheiden. Niemand hat es je geschafft, eine Facebook-Ad-Kampagne mittels einer Analyse von 37 Besuchen zu optimieren.Statistiken und Analytics sind neu für dich?Absolviere einen der vielen kostenlosen Online-Kurse zu “Statistik 101”. Es wird dir ziemlich sicher dabei helfen, bessere Entscheidungen zu treffen.Fehler #3. Zwanghaftes Betrachten von Daten ohne ZielsetzungWir haben es alle schon gemacht. Man prüft einen Bericht und zwei Stunden später befindet man sich tief im Kaninchenbau und schaut sich etwas ganz anderes an.Es ist wichtig zu wissen, warum man etwas tut, was man tut, und wie man daraus verwertbare Erkenntnisse gewinnen kann. Sei nicht besessen davon, dich die ganze Zeit nur auf Daten zu fokussieren.Fehler #4: Tracking um des Trackings willenZu lernen, wie man komplizierte benutzerdefinierte Ereignisse genau verfolgt, fühlt sich definitiv wie ein Gewinn an. Bis man merkt, dass man jetzt Dutzende von Ereignissen verfolgt und nichts mit den Daten anfangen kann. Das war’s dann auch schon.Fehler #5: Nicht wissen, was die Daten darstellen“Diese Landing Page ist Mist, weil die durchschnittliche Verweildauer auf der Seite nur 11 Sekunden beträgt.”Elf Sekunden klingt in der Tat schlecht. Aber niemand, der weiß, wie diese Kennzahl berechnet wird, würde das sagen.Warum eigentlich? Weil die durchschnittliche Verweildauer auf der Seite auf den Zeitstempeln zwischen den GA-Treffern basiert. Das bedeutet, dass jede gebouncte Session als null Sekunden lang berechnet wird. Darüber hinaus berücksichtigt diese Metrik keine Inaktivität, was die Daten angesichts der Anzahl der geöffneten inaktiven Tabs, die wir alle haben, stark verzerrt. Um ganz ehrlich zu sein, ist dies eine ziemlich nutzlose Metrik, dennoch ist sie standardmäßig in vielen Berichten enthalten.Fehler #6: Nicht auf detaillierte Daten achtenEs gibt nur sehr wenige Szenarien, wenn überhaupt, in denen du aus einem Standardbericht verwertbare Erkenntnisse ableiten kannst. Wende immer Filter, Segmente und sekundäre Dimensionen an, um die Grundursachen zu finden.Fehler #7: Übersehen von Google Analytics-StichprobenproblemenWenn du einen längeren Zeitraum betrachtest oder komplexe Daten vergleichst, solltest du sicherstellen, dass sie auf einer 100%igen Stichprobengröße basieren. Wenn dies der Fall ist, siehst du das grüne Schild-Symbol neben dem Berichtsnamen.Bei stichprobenartigen Ergebnissen wird das Symbol gelb.Es ist zwar in Ordnung, mit einer 95%-Stichprobe zu arbeiten, aber versuche gar nicht erst, Schlussfolgerungen aus so kleinen Stichproben zu ziehen:Wähle einen kürzeren Zeitraum oder eine weniger komplexe Abfrage, wenn du auf etwas Ähnliches stößt.Nebenbei bemerkt. Es gibt Workarounds für das Stichproben-Problem, wenn es ein großes Problem für dich darstellt. Fehler #8: Werbeblocker nicht berücksichtigenEs gibt eine Sache, die mich auf Marketing-Konferenzen immer wieder erstaunt — die Anzahl der Hände, die in die Luft gehen, wenn ein Redner fragt, wie viele Leute Ad-Blocker verwenden. (Ja, Vermarkter verstecken sich vor ihrer eigenen Arbeit.)Die Beliebtheit von Werbeblockern kann einen nicht überraschen. Wir werden die ganze Zeit mit oft schrecklicher Werbung bombardiert.Der Punkt ist, dass die große Mehrheit der Werbeblocker Google Analytics blockiert. Hinzu kommt, dass die Browser auch immer mehr Datenschutzrichtlinien durchsetzen. Das führt dazu, dass GA komplett blockiert wird (Brave) oder die Cookie-Ablaufzeit rapide verkürzt wird (Safari), was zu einer noch problematischeren Attribution führt.Egal, was man macht, es wird immer ein signifikanter Teil der Daten fehlen.Genieße die Daten in Google Analytics also immer mit etwas Vorsicht.FazitEine der größten SEO-Herausforderungen ist es, ihren Wert aufzuzeigen und datengetriebene Entscheidungen zu treffen. Es erfordert mehr Aufwand als z.B. bei Suchkampagnen, wo man alles direkt verfolgen und sofort beeinflussen kann.Wenn du also nur eine Sache aus diesem Leitfaden mitnehmen solltest, dann sollte es Folgendes sein: kritisches Denken beim Betrachten von Daten anzuwenden — immer.Wenn du mehr über Google Analytics erfahren möchtest, ohne auf Fehlinformationen zu stoßen, beginne mit diesen Blogs und Ressourcen:Official Analytics Academy coursesOccam’s Razor by Avinash KaushikSimo Ahava’s resourcesAnalytics Ninja blogAnalytics Mania by Julius FedoroviciusKennst du weitere Methoden, Google Analytics zur Verbesserung von SEO einzusetzen? Hast du noch Fragen? Schreib mir auf Twitter! Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Michal Pecánek Vermarkter und Content-Autor bei Ahrefs. Süchtig nach SEO, Luftfahrt, Parfums, Sushi und Tacos.",
  "headers": [
    {
      "level": "H1",
      "text": "Wie man Google Analytics nutzt, um die SEO Performance zu verbessern"
    },
    {
      "level": "H2",
      "text": "Erste Schritte mit Google Analytics"
    },
    {
      "level": "H2",
      "text": "7 praktische Methoden, um mit Google Analytics die SEO zu analysieren und zu verbessern"
    },
    {
      "level": "H3",
      "text": "1. Low Hanging-Möglichkeiten finden, um den Traffic/Umsatz zu steigern"
    },
    {
      "level": "H3",
      "text": "2. Pages mit hoher Conversion Rate finden und deren SEO verbessern"
    },
    {
      "level": "H3",
      "text": "3. Optimiere Landing Pages, die zu einer höheren Conversion beitragen"
    },
    {
      "level": "H3",
      "text": "4. Keyword-Möglichkeiten finden, indem du die interne Site-Suche verfolgst"
    },
    {
      "level": "H3",
      "text": "5. Einbrüche und Spitzen im organischen Traffic automatisch messen"
    },
    {
      "level": "H3",
      "text": "6. Alerts für 404-Pages einrichten"
    },
    {
      "level": "H3",
      "text": "7. Annotationen verwenden, um Probleme und Änderungen zu lokalisieren"
    },
    {
      "level": "H2",
      "text": "8 häufige Google Analytics-Fehler, die du vermeiden solltest"
    },
    {
      "level": "H3",
      "text": "Fehler #1: Google Analytics-Tracking falsch einrichten"
    },
    {
      "level": "H3",
      "text": "Fehler #2. Erkenntnisse aus unbedeutenden Stichproben ableiten"
    },
    {
      "level": "H3",
      "text": "Fehler #3. Zwanghaftes Betrachten von Daten ohne Zielsetzung"
    },
    {
      "level": "H3",
      "text": "Fehler #4: Tracking um des Trackings willen"
    },
    {
      "level": "H3",
      "text": "Fehler #5: Nicht wissen, was die Daten darstellen"
    },
    {
      "level": "H3",
      "text": "Fehler #6: Nicht auf detaillierte Daten achten"
    },
    {
      "level": "H3",
      "text": "Fehler #7: Übersehen von Google Analytics-Stichprobenproblemen"
    },
    {
      "level": "H3",
      "text": "Fehler #8: Werbeblocker nicht berücksichtigen"
    },
    {
      "level": "H2",
      "text": "Fazit"
    }
  ],
  "author": "Michal Pecánek"
}