{
  "url": "https://ahrefs.com/blog/de/growth-marketing/",
  "slug": "growth-marketing",
  "title": "Was ist Growth Marketing? Ein Leitfaden für Anfänger",
  "description": "Was ist Growth Marketing und wie funktioniert es? Ist es das Richtige für dein Unternehmen? In diesem Beitrag erfährst du alles, was du wissen musst.",
  "content": "Si Quan Ong Marketing @ Ahrefs. Ich lese, mache Breakdance und versuche zufäliige Lebensexperimente. Inhalt DropBox hat sein Wachstum bekanntlich durch die Nutzung ihres eigenen Produkts angekurbelt — für jede neue Weiterempfehlung ihres Produkts verschenkte es Speicherplatz.Diese Verknüpfung von Produkt und Marketing war zu dieser Zeit neu. Sean Ellis, damals der erste Marketer von DropBox, nannte es “Growth Hacking”. Ein anderer Marketer, Andrew Chen, setzte dies fort und nannte Growth Hacker die “neuen VPs für Marketing”. In Verbindung mit dem Erfolg von Facebooks eigenem Growth Team begannen viele wachstumsstarke Tech-Unternehmen wie Uber, Airbnb und Pinterest mit dem Aufbau und der Entwicklung einer Disziplin, die als Growth Marketing bekannt ist. In diesem Beitrag erfährst du Folgendes:Was ist Growth MarketingWarum ist Growth Marketing wichtigWie Growth Marketing funktioniertOb Growth Marketing das Richtige für dein Unternehmen istWelche Alternativen es gibt, wenn Growth Marketing nicht das Richtige für dich istWas ist Growth Marketing?Growth Marketing ist ein ganzheitlicher und datengesteuerter Marketing-Ansatz. Die Disziplin konzentriert sich auf den gesamten Marketingtrichter (und nicht nur auf die Spitze des Trichters) und wendet eine wissenschaftliche Methode an — Hypothesen aufstellen, diese Hypothesen testen und sie dann verfeinern oder eliminieren. Ursprünglich bezeichnete Sean den Begriff Growth Hacking als “kreative, kollaborative Ideenfindung und Problemlösung für heikle Herausforderungen”. Spätere Growth Marketer konzentrierten sich jedoch zu sehr auf den “Hacking”-Aspekt und betrachteten ihn als “Allheilmittel” zur Lösung von Marketingproblemen. Der Begriff “Growth Marketing” wurde eingeführt, um die Disziplin neu auszurichten.Warum ist Growth Marketing wichtig?Im traditionellen Marketing gibt es zwei Hauptprobleme:Die Zusammenarbeit zwischen den Teams ist (fast) nicht vorhandenMarketing-Teams haben oft keine Ahnung, was gut funktioniert.Schauen wir uns beide Probleme genauer an.1. Übergreifende Zusammenarbeit zwischen Teams gibt es (fast) nichtUnternehmen strukturieren ihre Teams häufig nach den Ebenen des Marketingtrichters. Generell gesprochen:Das Marketing-Team kümmert sich um den oberen Teil des Trichters — Aufmerksamkeit und Interesse. Das Sales-Team kümmert sich um den Umsatz — die Anbahnung von Interessenten und die Conversion zu Kunden. Das Produkt-Team kümmert sich um die Kundenbindung — Loyalität und Beratung. Dann erhält jedes Team eine Kennzahl, die den Erfolg auf jeder Ebene des Trichters misst. Das Problem ist jedoch, dass die Teams dann für ihre Kennzahlen optimieren … auf Kosten der jeweils anderen. Ein typisches Ziel für Marketer ist zum Beispiel die Anzahl der Leads. Aber diese Leads können von geringer Qualität sein, was sich wiederum auf andere Teams auswirkt (z. B. sind Leads von geringer Qualität schwerer zu konvertieren und zu halten). Das ist nur ein Problem. Ein weiteres Problem ist, dass diese Teams nur selten miteinander kommunizieren und zusammenarbeiten. In solchen Fällen verpassen die Produktteams zum Beispiel die Chance, das Fachwissen des Marketingteams über die Vermarktung neuer Funktionen zu nutzen. Diese Abschottung der Abteilungen ist ein Grund, warum das innovative Empfehlungsprogramm von DropBox in den meisten Unternehmen nicht zustande gekommen wäre. Growth Marketing löst dieses Problem, indem es den Fokus auf den gesamten Trichter legt. 2. Marketing-Teams haben oft keine Ahnung, was funktioniert Traditionelles Marketing ist schwer zu messen. Der berühmte amerikanische Kaufmann John Wanamaker witzelte einmal: “Die Hälfte des Geldes, das ich für Werbung ausgebe, ist verschwendet; das Problem ist, dass ich nicht weiß, welche Hälfte.”Da die Marketer kaum eine Vorstellung davon hatten, was funktioniert, entwickelten sie Kampagnen und Taktiken, die auf ihrem Bauchgefühl und (hoffentlich) auf fundierten Vermutungen beruhten. Daraus entstand der Wunsch nach einer strengen Methodik — einer Methodik, mit der man Ideen für Experimente entwickeln, messen kann, ob sie funktionieren, und die Ressourcen von denjenigen, die nicht funktionieren, zu denjenigen, die funktionieren, umleiten bzw. abziehen kann. Growth Marketing ist diese Methode.Wie funktioniert Growth Marketing?Laut Seans Buch “Hacking Growth” sind die Kernelemente des Growth Marketings folgende:Die Bildung eines funktionsübergreifenden Teams, das Marketing und Produkt zusammenbringt.Der Einsatz von qualitativer Forschung und quantitativer Datenanalyse (um Erkenntnisse über das Kundenverhalten zu gewinnen).Das Entwickeln und Testen von Ideen (und der Einsatz von Kennzahlen, um zu bewerten, ob sie funktionieren).1. Zusammenstellung eines funktionsübergreifenden TeamsDa das Ziel eines Growth Marketing-Teams darin besteht, den gesamten Trichter zu bearbeiten, braucht das Team mehr als nur Leute mit Marketingkenntnissen. Sean schlägt vor, dass das Team aus folgenden Personen bestehen sollte: Growth Lead — wählt den Schwerpunktbereich (einen beliebigen Teil des Trichters), wählt die zu messenden Kennzahlen aus und leitet das Team Produktmanager — verwaltet das Produkt und seine Änderungen Software-Ingenieur — arbeitet am Produkt und führt Experimente durch Marketer — versteht die verschiedenen Marketingkanäle und weiß, wie man Experimente durchführt Datenanalyst — entwirft Experimente, extrahiert Daten und liefert Erkenntnisse Produktdesigner — arbeitet an dem Produkt und entwirft ein besseres Erlebnis2. Qualitative Forschung und quantitative DatenDaten sind der Schlüssel zum Growth Marketing Prozess. Sie sollten leicht zugänglich sein und analysiert werden können. Außerdem sollten sie genau sein.Sean meint:“Es ist wichtig, dass dein Team über Daten zu jedem Teil des Kundenerlebnisses verfügt — und zwar nicht nur darüber, wie oft sie deine Website besuchen und wie lange sie dort bleiben -, damit sie auf einer detaillierten Ebene analysiert werden können, um festzustellen, wie die Menschen dein Produkt tatsächlich nutzen und wie du es geplant hast. Das bedeutet, dass Marketer, Datenwissenschaftler und Ingenieure zusammenarbeiten müssen, um Websites, mobile Apps, Kassensysteme, E‑Mail-Marketing und Kundendatenbanken mit dem richtigen Tracking zu versehen. Sobald das richtige Tracking eingerichtet ist, müssen die verschiedenen Quellen für Nutzerinformationen zusammengeführt werden, damit du ein detailliertes und robustes Bild des Nutzerverhaltens erhältst, das dein Datenteam analysieren kann. Was du schaffen willst, ist das, was oft als Data Lake/Data Warehouse bezeichnet wird: ein einziger Ort, an dem alle Kundendaten gespeichert werden und an dem du wirklich eintauchen und besondere Gruppen von Nutzern aufdecken kannst, die das Produkt anders nutzen als andere Gruppen.”Sean Ellis, Growth Marketer Seanellis.me3. Generieren & Testen von IdeenGrowth Marketing Teams durchlaufen den so genannten Growth-Hacking-Zyklus.So funktioniert der Prozess: Analysieren — Der Wachstumsleiter arbeitet mit dem Datenanalysten zusammen, um Bereiche mit Wachstumschancen aufzudecken. Das kann jeder Teil des Trichters sein, auf den sie sich konzentrieren wollen. Sie können sich zum Beispiel die Ereignisse oder Seiten ansehen, die einen Nutzer dazu bringen, das Produkt abzubrechen oder zu verlassen. Ideen generieren — Die Mitglieder des Growth Marketing-Teams (z. B. Produktmanager, Softwareentwickler usw.) tragen Ideen zur Verbesserung des Schwerpunktbereichs in eine Ideen-Pipeline ein. Priorisieren — Die Ideen werden nach Impact, Confidence und Ease of Execution (ICE) (Auswirkung, Vertrauen und Ausführungsfreundlichkeit) bewertet. Testen — Das Experiment wird durchgeführt und die Ergebnisse werden nach einem bestimmten Zeitraum ausgewertet. Dieser Prozess wiederholt sich dann.Ist Growth Marketing das Richtige für dich?Es besteht kein Zweifel, dass Growth Marketing funktioniert. Schließlich haben viele Unternehmen damit Erfolg gehabt. Facebook, Twitter, DropBox und Airbnb sind bekannte Beispiele. Doch wenn du genau hinsiehst, wirst du feststellen, dass die meisten Unternehmen, die erfolgreiche Growth Marketing Programme entwickelt haben, typischerweise:auf die Kunden ausgerichtet sind eine Menge Geld aufgenommen habenprodukte haben, die sich verbreiten. Das bedeutet: Mehr Nutzer ziehen mehr Nutzer an. Für die meisten kleinen Unternehmen ist Growth Marketing wahrscheinlich unerreichbar. Lars Lofgren, der selbst mehrere Growth-Teams aufgebaut hat, erklärt in diesem Beitrag warum. Hier ist eine kurze Zusammenfassung: Wahrscheinlichkeit ist schwer zu verstehen — Die meisten Menschen verstehen Wahrscheinlichkeit und Statistik nicht und führen am Ende schlechte Tests durch. Schlechte Tests führen zu schlechten Ergebnissen, die wiederum zu einem schlechten Programm führen. Die meisten Unternehmen haben nicht genug Daten — Für genaue Tests sind große Datenmengen erforderlich, aber die meisten Unternehmen werden nie so viele Daten bekommen. Growth-Teams sind zu teuer — Mit dem Geld, das du für den Aufbau eines Growth-Teams ausgibst, könntest du leicht einen Blog aufbauen, der bei Google weit oben rankt und tonnenweise organischen Traffic erzeugt. Growth-Teams haben ein begrenztes Umsatzpotenzial — Es gibt eine Obergrenze für die Conversions, die du erreichen kannst. Lohnt es sich, so viel Geld für die Optimierung dieser Raten auszugeben? Wenn Growth Marketing nicht das Richtige für dein Unternehmen ist, was solltest du stattdessen tun?Die Alternative: Marketing mit einem Growth-MindsetIn seinem Beitrag schreibt Lars:“Ein richtig skalierter Marketingkanal kann dein Geschäft verzehnfachen. Der beste Fall für ein Growth-Team, das deinen Trichter optimiert? 3X. Ich verbringe meine Zeit lieber mit einer 10-fachen Strategie als mit einer 3‑fachen.”Das ist genau das, was wir bei Ahrefs getan haben. Unser wichtigster Kanal zur Kundengewinnung ist das Content Marketing. Wir produzieren regelmäßig Inhalte in unserem Blog und auf unserer YouTube-Seite. In den letzten Jahren haben wir diesen Kanal ausgebaut und weiter in ihn investiert. Obwohl wir hier nichts wirklich Einzigartiges tun, haben wir unserer Content-Marketing-Strategie einen neuen Dreh gegeben. Wie beim Growth Marketing konzentrieren sich unsere Inhalte nämlich auf den gesamten Funnel. Anstatt jede Phase des Marketingtrichters mit separaten Inhalten anzugehen, dient jeder unserer Inhalte dazu,:Neue Kunden zu akquirieren.Interesse an unseren Produkten zu wecken, indem wir den Kunden erklären, was unser Produkt kann.unsere Kunden zu binden, indem wir ihnen zeigen, wie sie unser Produkt besser nutzen können.Hier ist ein Beispiel. Link Building ist ein viel gesuchtes Thema. Es wird monatlich etwa 31.000 Mal bei Google gesucht:Ohne ein Tool zur Recherche von Backlinks, wie wir es anbieten, ist es unmöglich, Linkbuilding gut zu machen. In unserem Linkaufbau-Leitfaden sprechen wir also natürlich über unser Produkt:Dieser eine Inhalt trifft alle Teile des Trichters. Es: Akquiriert neue Leads und Kunden — Indem wir für ein Thema ranken, nach dem viele Menschen bei Google suchen, generieren wir kontinuierlich Traffic. Weckt das Interesse an unserem Produkt - Unsere Inhalte zeigen potenziellen Kunden, wie sie Links aufbauen können und wie sie es mit unserem Produkt tun können. Kunden binden — Unsere Inhalte zeigen auch bestehenden Kunden, wie sie mit unserem Produkt Links aufbauen können. Wie machen wir das? Hier ist eine kurze Erläuterung unserer Strategie.1. Ziele auf Themen mit Such-Traffic-Potenzial abUm bei Google zu ranken, musst du auf Themen abzielen, nach denen Menschen bereits suchen. Diese Themen kannst du mit Tools zur Keyword-Recherche wie dem Keywords Explorer von Ahrefs finden. Wenn du ein relevantes Keyword eingibst, werden dir Tausende von Ideen angezeigt. Schränke die Liste dann mit “Geschäftspotenzial” ein. So kannst du dich auf Themen konzentrieren, die das Wachstum vorantreiben, und nicht auf Eitelkeits-Metriken wie Traffic. 2. Erstelle hochwertige Inhalte, die es verdienen, gerankt zu werdenUm bei Google ganz oben zu ranken, musst du Inhalte erstellen, die es verdient haben, gerankt zu werden. In diesem Video erfährst du, wie das geht.Weitere InformationenContent-Erstellung: Der komplette Leitfaden für AnfängerWas ist SEO-Content? Wie man Content verfasst, der rankt Wie du in 9 Schritten einen Blogbeitrag schreibst (den die Leute tatsächlich lesen wollen)3. Promote deinen ContentWenn du Inhalte veröffentlichst, bedeutet das nicht, dass sie automatisch entdeckt werden. Du musst sie anschieben und den Leuten zeigen, die sich dafür interessieren. Bewirb deine Inhalte, indem du dieser Checkliste folgst.FazitDer Growth-Marketing-Prozess kann schwierig umzusetzen sein. Aber auch wenn du es nicht tust, sind Elemente davon hilfreich. Experimentieren, den gesamten Trichter in Angriff nehmen — das sind alles Ideen, die du auf dein eigenes Unternehmen anwenden kannst. Wenn du wissen willst, wie du Growth Marketing umsetzen kannst, empfehle ich dir diese Ressourcen: Hacking Growth (Buch) Reforge finderGrowthHackersGrowth Marketing Handbook Habe ich etwas Wichtiges rund um Growth Marketing vergessen? Lass es mich auf Twitter wissen. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Si Quan Ong Marketing @ Ahrefs. Ich lese, mache Breakdance und versuche zufäliige Lebensexperimente.",
  "headers": [
    {
      "level": "H1",
      "text": "Was ist Growth Marketing? Ein Leitfaden für Anfänger"
    },
    {
      "level": "H2",
      "text": "Was ist Growth Marketing?"
    },
    {
      "level": "H2",
      "text": "Warum ist Growth Marketing wichtig?"
    },
    {
      "level": "H3",
      "text": "1. Übergreifende Zusammenarbeit zwischen Teams gibt es (fast) nicht"
    },
    {
      "level": "H3",
      "text": "2. Marketing-Teams haben oft keine Ahnung, was funktioniert"
    },
    {
      "level": "H2",
      "text": "Wie funktioniert Growth Marketing?"
    },
    {
      "level": "H3",
      "text": "1. Zusammenstellung eines funktionsübergreifenden Teams"
    },
    {
      "level": "H3",
      "text": "2. Qualitative Forschung und quantitative Daten"
    },
    {
      "level": "H3",
      "text": "3. Generieren & Testen von Ideen"
    },
    {
      "level": "H2",
      "text": "Ist Growth Marketing das Richtige für dich?"
    },
    {
      "level": "H2",
      "text": "Die Alternative: Marketing mit einem Growth-Mindset"
    },
    {
      "level": "H3",
      "text": "1. Ziele auf Themen mit Such-Traffic-Potenzial ab"
    },
    {
      "level": "H3",
      "text": "2. Erstelle hochwertige Inhalte, die es verdienen, gerankt zu werden"
    },
    {
      "level": "H3",
      "text": "3. Promote deinen Content"
    },
    {
      "level": "H2",
      "text": "Fazit"
    }
  ],
  "author": "Si Quan Ong"
}