{
  "url": "https://ahrefs.com/blog/de/influencer-finden/",
  "slug": "influencer-finden",
  "title": "Wie du Influencer in deiner Nische findest (6 einfache Schritte)",
  "description": "Influencer haben bereits das Vertrauen und die Aufmerksamkeit deiner Zielgruppe. Lerne, wie du in 6 einfachen Schritten die richtigen Influencer für dein Business findest und auswählst.",
  "content": "Brett G. Friedman Datengetriebener Kreativkopf, Teeliebhaber, Wort-Nerd und Besitzer von BrettGFriedman.com, der Internetadresse, die ich mein persönliches Zuhause nenne. Article PerformanceData from AhrefsVerlinkung von Websites 3 Sign up for AhrefsGet SEO metrics of any website or URL.The number of websites linking to this post.This post's estimated monthly organic search traffic. Inhalt Du suchst nach Influencern, die dein Produkt bewerben? Dann bist du hier richtig.Dein eigenes Social-Media-Imperium aufzubauen kann Jahre dauern, wohingegen Influencer bereits das Vertrauen und die Aufmerksamkeit deiner Zielgruppe haben.Alles, was du tun musst, ist sie dafür zu bezahlen, dein Produkt oder deine Dienstleistung zur Schau zu stellen.In diesem Beitrag erfährst du, wie du in 6 einfachen Schritten die richtigen Influencer für dein Unternehmen findest und auswählst.Doch bevor wir dazu kommen, fragst du dich vielleicht…Was ist ein Influencer?Influencer verfügen über drei vorteilhafte Eigenschaften:Anerkannte Expertise in einer NischeEin aktives, großes PublikumDie Fähigkeit, mit ihrem Publikum zu interagieren und es zu beeinflussenWenn Ahrefs jemanden dafür bezahlen würde, seine Zielgruppe zu vergrößern, wäre ein SEO-Experte wie Brian Dean eine gute Wahl.Im Jahr 2017 wurde Brian Dean von Entrepreneur als “SEO-Genius” ausgezeichnet.Er hat 113k Twitter-Follower und 407k Youtube-Abonnente. Noch wichtiger ist, dass jeder Beitrag innerhalb von Minuten nach Veröffentlichung Dutzende von Kommentaren, Likes und Shares erhält.Im Jahr 2015 erfand Brian die Skyscraper-Technik, eine einzige SEO-Strategie, nach der 30 Mal am Tag gesucht wird!Doch die Sache ist die: Obwohl Brian eindeutig ein Influencer ist, kannst du ihn nicht dafür bezahlen, seine Follower zu beeinflussen.Leute wie Brian Dean brauchen mehr als Geld, um über dein Produkt zu sprechen. Sie brauchen ein gutes Produkt. Obwohl er also ein großartiger Influencer für Ahrefs ist, ist er kein guter Kandidat für eine Influencer-Marketing-Kampagne.Allerdings gibt es hunderte oder tausende von Influencern in fast jeder Nische…Wie man Influencer findetInfluencer gibt es in allen Formen und Größen, daher kann es eine Herausforderung sein, den richtigen für dein Produkt zu finden. Aber keine Angst! Es ist einfacher als es aussieht. Wenn du dein Produkt kennst und ein Budget einplanen kannst, ist das Ganze von da an einfach und macht auch noch Spaß.Das ist die Vorgehensweise, um Influencer zu finden:Lege dein Budget festSuche nach InfluencernPrüfe, welche Plattformen sie nutzenDurchsuche beliebte Plattformen nach weiteren InfluencernWähle die besten Influencer ausMache deinen PitchSchritt 1. Lege dein Budget festDu hast wahrscheinlich eine Zahl im Kopf, was dieses Experiment kosten wird. Vielleicht sind es 1.000 Euro, vielleicht eine Million. Beides ist in Ordnung, aber verstehe, dass das, was du bereit bist zu zahlen, die Art des Influencers bestimmt, den du finden musst. Influencer gibt es in allen Formen und Größen, von den treffend benannten Mikro-Influencern bis hin zu echten Berühmtheiten. Hier ist die Auswahl, die dir von Ahrefs besten Designern und Mark Schaeffers Marketing Rebellion präsentiert wird.Es ist schwer zu beziffern, wie viel Influencer in den einzelnen Bereichen verlangen, aber es kann gesagt werden, dass es mit steigender Followerzahl teurer wird. Die Preise variieren auch je nach Social-Media-Plattform sowie dem Interaktionsgrad und der Kaufabsicht der Follower (aus der Sicht deines Influencers).Während dich also der Tweet eines Nano-Influencers vielleicht 2 Euro kostet, könnte der Blogpost eines Prominenten für 60 Euro zu haben sein. Wenn du das hier liest, liegt dein Bedarf wahrscheinlich irgendwo in der Mitte.Kenne einfach dein Budget und fange an zu suchen…Schritt 2. Suche nach InfluencernSagen wir, du hast ein paar Millionen Euro zur Verfügung und willst echte Berühmtheiten. Es gibt nur eine Möglichkeit, die ganz Großen zu bekommen, und das ist, sie direkt anzusprechen. Du wirst ein Verzeichnis von Agenten brauchen, um die Personen zu finden, die ihre Leute kennen.Wenn du die Promi-Influencer-Route nimmst, ist es umso wichtiger, dass sie Experten in deiner Nische (oder einer eng verwandten) sind und dass sie sich für ihren Einfluss bezahlen lassen!Kim Kardashian ist eine berühmte Influencerin. Allerdings wäre sie für Ahrefs wahrscheinlich nutzlos. Ihr Publikum ist ziemlich sicher nicht an SEO interessiert.Das heißt, jemand wie Tim Ferriss sollte genau richtig sein. Obwohl er kein SEO-Freak ist, ist er ein anerkannter Experte für digitales Marketing, und das ist ausreichend. Seine Follower sind viele Marketer und Unternehmer, die von Ahrefs profitieren würden.Aber was, wenn du keine Berühmtheiten in deiner Nische kennst oder nur das Budget für Makro/Mikro/Nano-Influencer hast?Öffne eine Tabelle wie diese, um deine Erkenntnisse zu tracken und einen Gang höher zu schalten. Es ist Zeit, sich die Hände schmutzig zu machen.a) Suche nach Personen, die über dein Thema geschrieben habenWenn jemand unermüdlich über Themen aus deiner Branche bloggt, ist es wahrscheinlich, dass er eine Fangemeinde aufgebaut hat.Diese Personen kannst du im Content Explorer finden, einer durchsuchbaren Datenbank mit ~7 Milliarden Seiten.So geht’s:Öffne den Content ExplorerGib ein relevantes Thema einÄndere den Suchmodus von “überall” (“everywhere”) zu “im Titel” (“in title”), um die relevantesten Ergebnisse zu erhaltenKlicke auf “suchen” (“search”)Wechsle zum Autoren-TabHier kannst du die Namen der Personen sehen, die über das von dir gewählte Thema geschrieben haben, wie viele Beiträge von ihnen wir in unserer Datenbank haben und bei einigen wie viele Twitter-Follower sie haben.Wirf einen Blick auf die Autoren, die am meisten über dein Thema sprechen. Unser eigener Autor Joshua Hardwick hat beeindruckende 14 Seiten mit dem Begriff “Linkaufbau” im Titel. Die Chancen stehen gut, dass er ein Experte auf diesem Gebiet ist. Und mit mehr als 6.000 Followern allein auf Twitter, hat er wahrscheinlich ein aktives Publikum.Füge ihn zu deiner Tabelle (Spreadsheet) hinzu und fülle den Rest seiner Follower-Daten aus, von wo du sie finden kannst. Mache dasselbe für alle Autoren, die zu deinem Budget passen könnten und die Kriterien für den “Influencer-Status” erfüllen.b) Suche nach Personen, die über Mitbewerber sprechenPersonen, die über deine Mitbewerber sprechen, werden wahrscheinlich auch über dich sprechen. Und wenn sie es noch nicht getan haben, ist es ein guter Zeitpunkt, sie wissen zu lassen, dass es dich gibt!Im Content Explorer:Ändere das Suchthema auf deinen stärksten Mitbewerber.Wechsle von “im Titel” (“in title”) zu “im Inhalt” (“in content”)Schau dir den Tab “Autoren” für die Analyse anSchau dir auch hier die Liste der Autoren an, notiere dir jeden, der deine Anforderungen zu erfüllen scheint, und gehe dann weiter.c) Suche nach Autoren beliebter Branchen-WebsitesJede Branche hat ihre namhaften Publikationen. Bei diesen Publikationen gibt es Dutzende von Influencern, auch bekannt als Autoren.Wenn du die großen Publikationen in deiner Branche bereits kennst, kannst du Influencer leicht finden, indem du durch ihre Beiträge scrollst und dir die Autorennamen ansiehst.Wenn deine Branche SEO ist, könntest du durch den ahrefs.com/blog scrollen, um Leute wie Patrick Stox und Ilia Markov zu finden.Die meisten Autoren haben eine Biografie-Seite mit Links zu ihren Social-Media-Profilen, so dass du schnell überprüfen kannst, ob sie eine Anhängerschaft haben. Wenn das der Fall ist, notiere sie in deiner Tabelle.Da diese Vorgehensweise jedoch zeitaufwendig ist, kannst du das Ganze mit dem Content Explorer beschleunigen.Starte eine Suche nach site:publication.comWechsle im Dropdown zu “Überall” (“Everywhere”)Klicke auf den Tab “Autoren”Wenn du die großen Publikationen in deiner Branche noch nicht kennst, kannst du sie im Content Explorer finden:Suche nach einem Thema im Content Explorer Wechsle im Dropdown zu “im Titel” (“in title”) Klicke auf den Tab “Websites”Du kannst dann die obigen Schritte für jede dieser Websites wiederholen.Schritt 3. Prüfe, welche Plattformen sie nutzenDer Content Explorer zeigt standardmäßig die Anzahl der Twitter-Follower für viele Autoren an.Bei denen mit einer Anzahl in deinem gewünschten Bereich, klicke auf die Zahl unter “Websites” und gehe zu ihrer persönlichen Seite. Wenn sie irgendeine Art von Online-Präsenz haben, findest du dort ihre Social-Media-Links.Wenn wir das für Andrew Dennis tun, sehen wir ein paar Websites.Wenn man bedenkt, dass er die meisten Inhalte auf pageonepower.com veröffentlicht hat, handelt es sich hierbei ziemlich sicher um seine persönliche Website. Klicken wir also auf die Zahl in der Spalte “Total pages” (“Seiten gesamt”), um die Beiträge zu sehen, die er dort geschrieben hat.Wenn wir auf einen dieser Beiträge klicken und seine Autorenbiografie überprüfen, finden wir Links zu seinen Social-Media-Profilen.Während du diesen Vorgang durchläufst, wirst du herausfinden, auf welchen Plattformen Influencer in deiner Nische am aktivsten sind. Das ist wichtig für den nächsten Schritt, in dem wir unsere Schatzsuche ausweiten werden.Schritt 4. Durchsuche beliebte Plattformen nach weiteren InfluencernDa du nun weißt, welche Plattformen in deiner Nische beliebt sind, hast du eine gute Vorstellung davon, wo sich dein Zielpublikum online versammelt.Da SEO-Influencer auf Twitter am beliebtesten sind, ist es eine berechtigte Annahme, dass sich das SEO-Publikum auf Twitter versammelt. Um also weitere Influencer zu finden, werden wir uns auf Twitter umsehen.Dein Zielpublikum könnte aber ganz woanders sein. Zum Glück haben die meisten Social-Media-Plattformen spezielle Tools von Drittanbietern, um Influencer zu finden.Influencer auf YouTube findenInfluencer auf Twitter findenInfluencer auf Instagram findenInfluencer auf TikTok findenInfluencers auf Pinterest, Facebook, Snapchat und Twitch findenWie du YouTube-Influencer findestWenn du nach Video-Influencern suchst, fügt Influenex bei YouTube-Kanälen und Videos die Anzahl der Abonnenten, durchschnittliche Videoaufrufe, Engagement-Raten, Videodauer und das Datum des letzten Uploads hinzu. Influenex hat auch einen eigenen “Influenex Score”, der dir einen schnellen Überblick über den potentiellen ROI eines Influencers gibt.Melde dich einfach für die kostenlose Testversion an, um alle Funktionen zu nutzen. (Spoiler: Die kostenlose Testversion ist unbegrenzt.) Du kannst auch die Videosuche nutzen, um Personen zu finden, die über deine Themen, dein Unternehmen und deine Mitbewerber sprechen, so wie wir es zuvor mit den Websites gemacht haben.Wenn Brian Dean das Top-Ergebnis ist, weiß man, dass es funktioniert!Wie du Twitter-Influencer findestFollowerwonk ist eine unkomplizierte Suchmaschine für Twitter Accounts. Gib einfach ein Keyword in die Suchleiste ein, um Profile zu finden, die deiner gewünschten Followerzahl, Tweet-Frequenz, Account-Alter und “Social Authority” und dem eigenen Influencer-Clout-Score von Followerwonk, entsprechen.Die kostenlose Version von Followerwonk deckt 5000 Einträge ab, was für die meisten Leute ausreichend sein sollte. Die Upgrades für unbegrenzte Ergebnisse kosten $23-$79/Monat.PROFI-TIPPDu kannst auch den “Who Tweeted”-Bereich im Content Explorer nutzen, um weitere Nischen-Influencer zu finden.Gehe zurück zum Content ExplorerSuche nach einem spezifischen Thema für dein ProduktSortiere nach “Twitter Shares”Klicke auf Details auf der rechten Seite einer relevanten SeiteKlicke auf den Tab “Who Tweeted”Du siehst nun eine Liste von Personen, sortiert nach Beliebtheit, die einen Artikel getwittert haben, der sich auf dein Produkt bezieht. Füge sie zu deinem Spreadsheet hinzu!Wie du Instagram-Influencer findestHeepsy ist eine sehr gut filterbare Instagram-(und YouTube)-Influencer-Suchmaschine. Auch für diese musst du dich anmelden, aber die Spezifität der Ergebnisse ist es mehr als wert. Neben den üblichen Filtern (Engagement, Follower, Standort, Sprache) kannst du auch nach der Verfügbarkeit von Kontaktinformationen, Kostenschätzungen und einer ganzen Reihe von Publikumsattributen wie Alter, Geschlecht, Interesse und sogar Authentizität filtern.Wenn du die kostenlose Testversion nutzt, wirst du feststellen, dass die Ergebnisse auf 2–12 pro Suche begrenzt und die Suchanfragen auf 5–10 pro Tag beschränkt sind. Die Preise reichen von $49/Monat bis $269/Monat.Wie du TikTok-Influencer findestInBeat ist eine der ersten Datenbanken, die sich auf TikToker konzentriert. Sie beinhaltet Standard-Filter (Engagement, Follower, Standort, Sprache) plus ein paar einzigartige Funktionen. InBeat beinhaltet UND/ODER-Operatoren, Text-Matching in Usernamen, Bios oder Posts (ähnlich wie Ahrefs), sowie die Suche nach Keywords, Hashtags, Erwähnungen und Usernamen.Wie Heepsy erfordert auch InBeat ein Upgrade ab einer bestimmten Anzahl von entdeckten Influencern. Die Preise reichen von $35-$400/Monat.Wie du Influencer auf Pinterest, Facebook, Snapchat und Twitch findestWenn dein Publikum nur auf Pinterest, Facebook und/oder Snapchat ist, mach dir keine Sorgen.Es gibt Multiplattform-Suchmaschinen, die sie mit einbeziehen. Sie neigen dazu, Vorauszahlungen, Registrierungen oder Verkaufsgespräche zu verlangen, aber sie erfüllen ihren Zweck.Influence.coInfluence.co aggregiert das Gesamtpublikum von Influencern und bietet praktischerweise einen “Startpreis” für die meisten Ergebnisse.Plattformen: Facebook, Pinterest, Snapchat, Instagram, Youtube, Twitter und Blogs. Preis: 6 Monate für $3600. 12 Monate für $5700.Registrierung erforderlich: JaVerkaufsgespräch erforderlich: NeinScrunchScrunch beinhaltet bei einem Premium-Upgrade die geschätzten Kosten pro Post, die gesamte soziale Reichweite und beliebte Themen oder Tags für jeden Influencer.Plattformen: Facebook, Instagram, Youtube, Twitter, TikTok.Preis: $199-$299/Monat.Registrierung erforderlich: JaVerkaufsgespräch erforderlich: Nein Brand24 Brand24 ist eine Social-Listening-Plattform, die Sentiment-Analysen, E‑Mail-Benachrichtigungen und einen eigenen Influencer-Score bietet.Plattformen: Facebook, Instagram, Youtube, Twitter, Podcasts und Websites (Blog, Forums, News und Web in separaten Filtern.)Preis: Abos zu je $49/Monat, $99/Monat und $199/Monat.Registrierung erforderlich: JaVerkaufsgespräch erforderlich: Nein Hype Auditor Hype Auditor ist eine All-in-One-Software mit der seltenen Funktion, die “Fakehaltigkeit” des Publikums eines Influencers zu bewerten.Plattformen: Instagram, Youtube, TikTok.Preis: $299/Monat.Registrierung erforderlich: JaVerkaufsgespräch erforderlich: Nein Hypr Brands Hypr Brands ist eine weitere Freemium-Influencer-Datenbank mit verfeinerten Publikumsfiltern, wie z.B. dem Haushaltseinkommen.Plattformen: Facebook, Pinterest, Instagram, Youtube, Twitter.Preis: Individuelle Angebote.Registrierung erforderlich: JaVerkaufsgespräch erforderlich: Nein Grin Grin ist G2s leistungsstärkste Influencer-Marketing-SaaS von Winter 2021.Plattformen: Twitch, Facebook, Instagram, Youtube, Twitter, TikTok.Registrierung erforderlich: JaVerkaufsgespräch erforderlich: Ja Open Influence Open Influence ist eine Software und ein Service, der mit den “Fortune 500s” aus allen Branchen zusammenarbeitet.Plattformen: LinkedIn, Twitch, WeChat, Weibo, Facebook, Pinterest, Snapchat, Instagram, Youtube, Twitter, TikTok, Blogger.Registrierung erforderlich: JaVerkaufsgespräch erforderlich: Ja Upfluence ist eine bekannte KI-gesteuerte, ROI-fokussierte Influencer-Datenbank und Outreach-Tool.Plattformen: WordPress, Twitch, Facebook, Pinterest, Instagram, Youtube, Twitter, TikTok.Registrierung erforderlich: JaVerkaufsgespräch erforderlich: Ja Intellifluence Intellifluence ist eine weniger bekannte All-in-One-Lösung mit Influencern von seltenen Plattformen.Plattformen: Reddit, SoundCloud, Podcasts, Amazon Reviews, iOS und Android Reviews, Twitch, LinkedIn, Facebook, Pinterest, Instagram, Youtube, Twitter, TikTok.Registrierung erforderlich: JaVerkaufsgespräch erforderlich: Ja Sideqik Sideqik ist ein Discovery-Tool mit umfangreichen Filtern und einer Influencer-Lookalike-Funktion.Plattformen: Tumblr, Twitch, Facebook, Pinterest, Snapchat, Instagram, Youtube, Twitter, TikTok, Blogs.Registrierung erforderlich: JaVerkaufsgespräch erforderlich: JaWenn irgendwie keine dieser Plattformen das hat, was du brauchst, oder dein Budget zu knapp ist, um sie dir leisten zu können, kannst du immer noch die eingebauten Suchwerkzeuge einer Plattform nutzen.So oder so, sobald du eine solide Liste hast, musst du die richtigen Influencer auswählen, die du ansprechen möchtest.Schritt 5. Wähle die besten Influencer ausInstinktiv fühlst du dich vielleicht von der beliebtesten Person auf deiner Liste angezogen, d.h. von der mit den meisten Followern. Bedenke aber, dass es auf den Return on Investment (ROI) ankommt, nicht auf die Anzahl der Follower.Das heißt, es ist schwierig, die Rentabilität zu berechnen, wenn du nicht genau weißt, wie viel die Investition kosten wird und wie viel du davon haben wirst. Außerdem spielen der Preis deines Produkts, die Marge, der TAM (Total Addressable Market) und jede andere grundlegende Kennzahl eine Rolle dabei, was ein Influencer-Marketing-Experiment wert ist.Für Ahrefs sieht die Formel zur Berechnung des Influencer-ROI in etwa so aus:Geschätzter ROI =(Anzahl der Follower x geschätzte Conversion Rate x LTV) — (Marginalkosten + ‘Influencer-Kosten’ + ‘Kosten für das kostenlose Produkt’)Wir wollen zum Beispiel Tim Ferriss persönlich engagieren. Über alle Plattformen hinweg hat er stolze 31.274.845 Follower. Da das Zielpublikum von Ahrefs vor allem auf Twitter ist, werden wir ihn hypothetisch fragen, ob er einen Twitter-Post über Ahrefs macht. Tim hat 1,7 Millionen Twitter-Follower. Tim ist ein genialer Marketer, aber um vorsichtig zu sein, nehmen wir mal an, dass sein Tweet 0,01% der Follower konvertiert. Das wären 170 neue Nutzer.Jetzt kalkulieren wir den Lifetime Value (LTV) eines Ahrefs-Kunden mit ein. Der Einfachheit halber nehmen wir an, dass dieser 1.000 $ beträgt.Zusammenfassung der Gleichung Pt. 1Anzahl der Follower =1.700.000Geschätzte Conversion Rate = 0,1%LTV = $1.000Nebenbei bemerkt. 1 Technisch gesehen solltest du die Impressions verwenden, nicht die Follower. Du kannst dies tun, indem du die durchschnittliche Engagement-Rate mit der durchschnittlichen Anzahl zusätzlicher Impressionen pro Engagement multiplizierst und das zur Anzahl der Follower addierst. Wir machen das nicht, um das Ganze einfach zu halten.Diese drei Zahlen zusammen bestimmen deine zu erwartenden Einnahmen der Aktion.Erwartete Einnahmen = 1.700.000 x .0001 x $1.000 = $170.000Nun ist es an der Zeit, die Kosten zu subtrahieren.Die Marginalkosten sind alle Kosten, die mit der Herstellung deines Produkts oder deiner Dienstleistung verbunden sind. Für physische Produkte musst du Dinge wie Verpackung und Herstellung mit einbeziehen. Bei digitalen Produkten, Onboarding und Serverkosten.Wenn also jeder neue Kunde 100$ kostet und Tim 170 Kunden gewinnt, sind das 17.000$.Tim erhält einen Monat lang kostenlos die Tools von Ahrefs, damit er sicherstellen kann, dass die Produkte es wert sind, mit seinem Publikum geteilt zu werden. Das sind $99.Sagen wir, Tims “Influencer-Honorar” beträgt 25.000 $.Zusätzlich müsste Ahrefs wahrscheinlich eine Plattform oder ein Verzeichnis für Talent-Agenten nutzen, um mit Mr. Ferriss in Kontakt zu treten. Nehmen wir an, dass dies 12.500$ ausmacht.Zusammenfassung der Gleichung Pt. 2Marginalkosten = $1.700Kosten für das kostenlose Produkt = $99Influencer-Kosten = $25.000Kosten für den Talent-Agenten oder die Plattform = $12.500Gesamtkosten = $17.000 + $99 + $25.000 + $12.500 = $54.599Die endgültige Berechnung sieht also wie folgt aus:Geschätzter ROI = Erwartete Einnahmen — GesamtkostenGeschätzter ROI = $170.000 — $54.599 = $115.401Es ist klar, dass es sich lohnt, für Tim Ferriss zu bezahlen. Beachte, dass dein Ergebnis je nach Produkttyp und Influencer extrem variieren wird. Tim Ferriss ist möglicherweise der GOAT-Influencer.Schritt 6. Mache deinen PitchSobald du einen Influencer gefunden hast, der es wert ist, für ihn zu bezahlen, musst du versuchen, ihn an Bord zu holen. Das kann schwieriger sein, als du vielleicht denkst, und viele Influencer werden dein Angebot ablehnen oder dich abwimmeln.Deshalb ist es unerlässlich, dass du mehrere auf einmal kontaktierst. Nachdem du den ROI aller deiner gelisteten Influencer berechnet hast, wähle einige aus, die du zur gleichen Zeit kontaktierst.Wenn ein paar antworten, vergleiche ihre Angebote. Wenn niemand antwortet, gehe zur nächsten Gruppe über.Aber wir wollen sicherstellen, dass du Antworten bekommst. Sobald deine Liste fertig ist, ist es an der Zeit, die Leute anzusprechen…Die Kontaktaufnahme ist eine Kunst für sich. Glücklicherweise drehen sich die meisten Ratschläge hinsichtlich deiner Zielgruppe um ein “What’s In It For Me?” (WIIFM). Wenn du einen Influencer ansprichst, bietest du Geld und kostenlose Produkte an. Für gewöhnlich mögen sie das. Und wenn du das allgegenwärtige Kriterium #4 abgehakt hast (das Zielobjekt wird mit Geld zu überzeugen sein), dann sollte die Geschäftsabwicklung ziemlich einfach sein.In diesem Sinne hat Ahrefs CMO Tim Soulo bewährte, weltberühmte und stets geltende Ratschläge zum Thema “Kalt-Kontaktaufnahme”.Und einer der besten Autoren von Ahrefs, Si Quan Ong, hat ebenso goldene Ratschläge speziell für das Pitchen bei Influencern.Wie auch Tim und Si Quan gebe ich dir keine Vorlage, sondern einen Rat: Sei authentisch. Recherchiere deinen Ziel-Influencer, stelle eine Beziehung zu dieser Person her und gib ihr einen Grund, dich zu mögen, um mit dir zu arbeiten.Apropos Leute, die dich mögen: Manchmal ist es die beste Strategie, Leute zu finden, die deine Marke bereits kennen und ihnen einen Anstoß zu geben.Das kannst du mit den Ahrefs Alerts machen:Gehe zu Ahrefs Alerts.Klicke auf den Tab “Erwähnungen”Klicke auf “+ Neuer Alert”Gib deinen Markennamen als Suchanfrage einFüge deine Domain zu den “Blockierten Domains” hinzuLege deinen Alert intern fest (täglich oder wöchentlich)Klicke auf “Hinzufügen”Richte einen neuen Alert für deinen Firmennamen ein. Jeden Tag, jede Woche oder jeden Monat erhältst du eine E‑Mail mit jedem Artikel, der auf dein Unternehmen im Web verweist.Die Artikel werden nach Social Shares und Domain Ratings gerankt. Öffne ein paar der Top-Ergebnisse, um zu sehen, wo du erwähnt wurdest. Wenn die Erwähnung positiv ist, füge sie zu deiner Liste hinzu. Wenn sie ungünstig ist, sprich mit dem Autor über seine Erfahrung. So bekommst du wertvolles Feedback und eine Chance, es richtig zu machen.FazitAlles in allem ist das Finden von Influencern mit den richtigen Tools, Wissen und ein wenig Zeit sehr einfach.Wir haben dir gerade die Tools und das Wissen vermittelt, aber wenn dir die Zeit fehlt, gibt es Personen, die das Ganze für dich erledigen.Man nennt sie Agenturen. Sie wirken Wunder.Hier ist eine Liste von 100, die Influencer finden, die zu deinem Produkt passen, dich mit ihnen vernetzen und dein gesamtes Engagement managen.Achte nur darauf, dass du die Agenturkosten in deine ROI-Kalkulation miteinbeziehst!Und wenn du immer noch Fragen hast oder mich mit einem Influencer verwechselst, dann gib dein Bestes und schreib mir auf Twitter Article PerformanceData from AhrefsVerlinkung von Websites 3 Sign up for AhrefsGet SEO metrics of any website or URL.The number of websites linking to this post.This post's estimated monthly organic search traffic.Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human:",
  "headers": [
    {
      "level": "H1",
      "text": "Wie du Influencer in deiner Nische findest (6 einfache Schritte)"
    },
    {
      "level": "H2",
      "text": "Was ist ein Influencer?"
    },
    {
      "level": "H2",
      "text": "Wie man Influencer findet"
    },
    {
      "level": "H3",
      "text": "Schritt 1. Lege dein Budget fest"
    },
    {
      "level": "H3",
      "text": "Schritt 2. Suche nach Influencern"
    },
    {
      "level": "H4",
      "text": "a) Suche nach Personen, die über dein Thema geschrieben haben"
    },
    {
      "level": "H4",
      "text": "b) Suche nach Personen, die über Mitbewerber sprechen"
    },
    {
      "level": "H4",
      "text": "c) Suche nach Autoren beliebter Branchen-Websites"
    },
    {
      "level": "H3",
      "text": "Schritt 3. Prüfe, welche Plattformen sie nutzen"
    },
    {
      "level": "H3",
      "text": "Schritt 4. Durchsuche beliebte Plattformen nach weiteren Influencern"
    },
    {
      "level": "H3",
      "text": "Wie du YouTube-Influencer findest"
    },
    {
      "level": "H3",
      "text": "Wie du Twitter-Influencer findest"
    },
    {
      "level": "H3",
      "text": "Wie du Instagram-Influencer findest"
    },
    {
      "level": "H3",
      "text": "Wie du TikTok-Influencer findest"
    },
    {
      "level": "H3",
      "text": "Wie du Influencer auf Pinterest, Facebook, Snapchat und Twitch findest"
    },
    {
      "level": "H5",
      "text": "Influence.co"
    },
    {
      "level": "H5",
      "text": "Scrunch"
    },
    {
      "level": "H5",
      "text": "Brand24"
    },
    {
      "level": "H5",
      "text": "Hype Auditor"
    },
    {
      "level": "H5",
      "text": "Hypr Brands"
    },
    {
      "level": "H5",
      "text": "Grin"
    },
    {
      "level": "H5",
      "text": "Open Influence"
    },
    {
      "level": "H5",
      "text": "Upfluence"
    },
    {
      "level": "H5",
      "text": "Intellifluence"
    },
    {
      "level": "H5",
      "text": "Sideqik"
    },
    {
      "level": "H3",
      "text": "Schritt 5. Wähle die besten Influencer aus"
    },
    {
      "level": "H4",
      "text": "Zusammenfassung der Gleichung Pt. 1"
    },
    {
      "level": "H4",
      "text": "Zusammenfassung der Gleichung Pt. 2"
    },
    {
      "level": "H3",
      "text": "Schritt 6. Mache deinen Pitch"
    },
    {
      "level": "H2",
      "text": "Fazit"
    }
  ],
  "author": "Brett G. Friedman"
}