{
  "url": "https://ahrefs.com/blog/de/interne-links-fuer-seo/",
  "slug": "interne-links-fuer-seo",
  "title": "Interne Links für SEO: Ein praktischer Leitfaden",
  "description": "Lerne, was interne Links sind, wie du eine interne Linkstruktur aufbaust und wie du sie überprüfst, um Probleme zu erkennen und zu beheben.",
  "content": "Chris Haines Chris ist als SEO Director tätig und verfügt über 10 Jahre Erfahrung im Bereich SEO auf Agenturseite. Wenn er nicht gerade mit SEO beschäftigt ist, spielt er gerne mit alten Synthesizern herum, geht an Sandstränden spazieren oder trinkt eine gute Tasse Tee. Inhalt Interne Links sind für Backlinks das, was Robin für Batman ist — sie sind entscheidend für den SEO-Erfolg, werden aber wenig bis gar nicht gewürdigt.In diesem Leitfaden erkläre ich, was interne Links sind, wie man eine interne Linkstruktur aufbaut und wie man interne Links strategisch in der SEO einsetzt. InhaltWas sind interne Links?Interne Links sind Hyperlinks. Sie führen die Besucher von einer Seite zu einer anderen auf deiner Website. Ihr Hauptzweck ist es, den Besuchern die Navigation auf deiner Website zu erleichtern, aber sie können auch zur Verbesserung der Suchmaschinenoptimierung beitragen.Hier ist eine vereinfachte Darstellung, wie ein interner Link aussieht:Und so sieht ein interner Link im HTML-Code aus:<a href=\"https://beispiel.de/\">Interner Link</a>Interne Links sind „super wichtig“ für SEO (laut Google)Interne Links dienen dem praktischen Zweck, die Besucher deiner Website von A nach B zu bringen, aber sie spielen auch eine wichtige Rolle in deiner internen Verlinkungsstrategie.Auf die Frage in einem „Google SEO office-hours”-Video , ob interne Verlinkung noch wichtig für SEO sei, sagte John Mueller:Ja, absolut… Interne Verlinkung ist super wichtig für SEO. Es ist eines der wichtigsten Dinge, die du auf einer Website tun kannst, um Google und die Besucher zu den Seiten zu führen, die du für wichtig hältst… Was du für wichtig hältst, ist ganz dir überlassen.John Mueller, Senior Search Analyst GoogleWenn interne Links also strategisch in der SEO eingesetzt werden, können sie dazu beitragen, die Leistung der Seiten, auf die du verlinkst, zu steigern.Interne Links tun dies, indem sie den Fluss des PageRank auf deiner Website lenken. Auch wenn die PageRank-Symbolleiste 2016 verschwunden ist, ist der PageRank immer noch ein Signal, das Google verwendet.DYK that after 18 years we’re still using PageRank (and 100s of other signals) in ranking?Wanna know how it works?https://t.co/CfOlxGauGF pic.twitter.com/3YJeNbXLml— Gary 鯨理／경리 Illyes (so official, trust me) (@methode) February 9, 2017 TippDu kannst URL-Rating als Ersatzmetrik verwenden, da es viele Gemeinsamkeiten mit dem Google PageRank hat.Im Allgemeinen gilt: Je mehr interne Links eine Seite hat, desto höher ist ihr PageRank. Aber es geht nicht nur um die Quantität — auch die Qualität der Links spielt eine wichtige Rolle.Interne Links vermitteln nicht nur Autorität, sondern ermöglichen es den Besuchern auch, direkt zu den Inhalten zu springen, die du ihnen zeigen willst.Wenn du zum Beispiel einen E‑Commerce-Shop betreibst, möchtest du vielleicht direkt von deiner Homepage auf deine meistverkauften oder saisonalen Produkte verlinken. Das ist hilfreich für Besucher, die direkt zu den Produkten springen und sie kaufen wollen, und schafft außerdem ein gutes Nutzererlebnis, indem es eine starke interne Verlinkungsstruktur schafft.Du solltest es strategisch angehen und überlegen, was dir am wichtigsten ist und wie du das mit deinen internen Links hervorheben kannst.John Mueller, Senior Search Analyst GoogleGoogle und andere Suchmaschinen nutzen interne Links auch als Wegweiser, um neue Seiten auf deiner Website zu entdecken.Nehmen wir an, du veröffentlichst eine neue Webseite und vergisst, sie von einer anderen Stelle deiner Website zu verlinken. Angenommen, die Seite ist nicht in deiner XML-Sitemap enthalten und hat keine Backlinks, dann wird Google diese Seite nur schwer finden können.Hier ist, was Google dazu sagt:Einige Seiten sind bekannt, weil Google sie schon einmal gecrawlt hat. Andere Seiten werden entdeckt, wenn Google einem Link von einer bekannten Seite zu einer neuen Seite folgt.Interne Links können auch Kontext für Suchmaschinen wie Google liefern. Sie tun dies durch den Ankertext.Mit anderen Worten: Wenn du eine Seite über rote Kleider hast und mehrere interne Links auf diese Seite verweisen, die beschreibende Ankertexte wie „Kleider“, „rote Kleider“ und „rote Maxikleider“ enthalten, helfen diese Google, den Kontext der verlinkten Seite zu verstehen.Arten von internen LinksHier sind die wichtigsten Arten von Links, die du im Internet findest.Navigations-LinksDie meisten Besucher deiner Website finden sich mit Hilfe der Navigation zurecht. Dies sind einige der wichtigsten internen Links auf deiner Website.So sehen sie auf der Ahrefs-Website aus.Kontextbezogene LinksKontextbezogene Links erscheinen im Hauptteil des Inhalts einer Webseite. Sie werden in der Regel verwendet, um Ideen zu vertiefen, auf Ressourcen zu verweisen, Begriffe zu definieren oder die Leser zu anderen relevanten Inhalten zu führen.Hier ist ein Beispiel für einen kontextbezogenen Link zu unserem Keyword-Recherche-Tool:Brotkrumen-LinksInterne Links können auch verwendet werden, um Beziehungen zwischen Seiten anzuzeigen. Eines der besten Beispiele dafür sind Breadcrumbs (Brotkrumen). Breadcrumbs ermöglichen es den Nutzern, ihre Reise zurück zur Homepage zu verfolgen.Sie werden normalerweise am Anfang von internen Seiten wie Produktseiten oder Blogbeiträgen platziert. Google hat außerdem angegeben, dass es sie wie normale Links behandelt (als Teil der PageRank-Berechnung).We likes them. We treat them as normal links in e.g. PageRank computation— Gary 鯨理／경리 Illyes (so official, trust me) (@methode) June 22, 2017 Footer-LinksDiese erscheinen am unteren Ende der Seite. Hier ist ein Beispiel für die Footer-Links im Ahrefs’-Blog.Links in der Fußzeile enthalten in der Regel Links zu deiner Kontaktseite, deiner Datenschutzrichtlinie und anderen wichtigen Seiten auf deiner Website.Links im Footer sind zwar nützlich für zusätzliche Details, aber sie sind nicht die primäre Navigationsmethode auf den meisten Websites.Wie man eine interne Linkstruktur für den SEO-Erfolg aufbautEine solide interne Verlinkungsstruktur hilft deiner Website, im Ranking aufzusteigen, indem sie die Autorität an die richtigen Stellen deiner Website lenkt.So gehst du vor.1. Plane deine interne Verlinkungsstruktur Wenn du eine neue Website startest oder eine alte umstrukturierst, musst du als Erstes deine interne Verlinkungsstruktur planen.Die Pyramidenstruktur ist eine der beliebtesten Strukturen für die interne Verlinkung, da sie auf natürliche Weise eine interne Verlinkungsstruktur von oben nach unten schafft. Hier ist ein Beispiel dafür, wie es aussieht. Die Pfeile zeigen die internen Links von Seite zu Seite.Die Erstellung einer grundlegenden internen Linkstruktur ist der erste Schritt zu einer erfolgreichen internen Verlinkungsstrategie. Dieser Ansatz wurde auch von John empfohlen:Der Top-Down-Ansatz oder die Pyramidenstruktur hilft uns sehr, den Kontext der einzelnen Seiten innerhalb der Website zu verstehen.John Mueller, Senior Search Analyst GoogleNeben der Top-Down-Verknüpfung kannst du auch Breadcrumbs hinzufügen, um die Navigation auf deiner Website zu erleichtern.Brotkrumen-Links ermöglichen es den Besucherinnen und Besuchern zu verstehen, wo sie sich auf der Website befinden und ihren Weg zurück zur Startseite zu finden.2. Verlinke auf interne Seiten, die dir wichtig sindSobald du die Grundlagen deiner internen Verlinkungsstruktur geplant hast, ist es an der Zeit, mit der Verlinkung auf die internen Seiten deiner Website zu beginnen, die du hervorheben möchtest.Für E‑Commerce-Unternehmen könnten das ihre wichtigsten Produkte oder Dienstleistungen sein. Bei Publikationen könnte es sich um die wichtigsten Inhalte zu einem bestimmten Thema handeln.Bei Ahrefs verlinken wir in der Regel von unseren Schlüsselseiten aus intern auf unsere SEO-Tools.Hier ist ein Beispiel von der Ahrefs-Homepage, das zeigt, dass unsere wichtigsten SEO-Tools mit internen Links prominent verlinkt sind.Dieser Ansatz hilft, die Besucher zu den wichtigsten Teilen unserer Website-Architektur zu führen.Du kannst verlinken, was du willst, aber am besten verlinkst du zu den Dingen auf deiner Website, die dir am wichtigsten sind.3. Link zu relevanten Inhalten Wenn du intern auf Inhalte verlinkst, die für deine Seite relevant sind, erhältst du zusätzliche Informationen für die Leser/innen über das Thema, über das du schreibst.Wenn du z.B. über SEO schreibst, stößt der Leser vielleicht auf einen Fachjargon, den er nicht unbedingt versteht — aber der interne Link hilft, den Kontext zu vermitteln.Hier ist ein schnelles Beispiel:Dieser Ansatz ermöglicht es dem Leser, auf den Link zu klicken, um mehr über das Thema zu erfahren.In unserem Blog verlinken wir auch auf relevante Inhalte in einer ” Weiterführende Lektüre”-Box, die wie folgt aussieht:Dies ist eine weitere Methode, mit der du Leser/innen auf relevante Inhalte auf deiner Website hinweisen kannst.Eine weitere Überlegung bei der internen Verlinkung ist der Kontext des Links. Gael Breton glaubt das:Bei Inhalten ist es empfehlenswert, auf eine andere Seite deiner Website zu verlinken, solange es im Kontext Sinn macht.Gael Breton, Co-Founder Authority HackerHier ist ein Beispiel dafür, wie das auf einer E‑Commerce-Website aussehen kann.Neben der kontextuellen Relevanz solltest du auch berücksichtigen, wie stark die Seiten sind, von denen du verlinkst.Angenommen, du hast gerade einen neuen Beitrag geschrieben und möchtest ihn mit leistungsstarken internen Links versehen. Wie machst du das am besten? So mache ich es mit den kostenlosen Ahrefs Webmaster Tools:Gehe zu deinem letzten Site Audit und klicke auf Page ExplorerGib dein Stichwort in die Suchleiste ein (z.B. „Online-Werbung“)Ändere den Filter auf Seitentext (die Seite sollte sich aktualisieren, sobald du darauf geklickt hast)In diesem Beispiel gibt es 21 Ergebnisse. Du kannst die Seiten dann nach organischem Traffic sortieren. Auf diese Weise siehst du die Seiten mit dem meisten Traffic zuerst — wahrscheinlich sind das starke Seiten.Sobald du deine Liste hast, musst du sie nur noch abarbeiten und die internen Links zu deiner neuen Seite auf diesen starken Seiten hinzufügen.Wie du die internen Links deiner Website auf Probleme überprüfstUm in Sachen SEO auf dem Laufenden zu bleiben, musst du deine internen Links regelmäßig überprüfen. Es ist zeitaufwendig und bei größeren Websites fast unmöglich, die internen Links einzeln zu überprüfen. Die beste Lösung ist ein Tool wie Site Audit, mit dem du die Crawls deiner Website täglich, wöchentlich oder monatlich planen kannst.Mit diesem Tool kannst du:fehlerhafte interne Links zu 4XX Seiten korrigieren.Möglichkeiten für neue interne Links identifizieren.Verwaiste Seiten reparieren. Schauen wir uns an, wie wir diese Aufgaben erledigen können.1. Repariere fehlerhafte interne Links, um Autorität zurückzugewinnenWenn du einen Site Audit durchgeführt hast, gehst du zum Bericht „Interne Seiten“ und klickst auf „Probleme“.Im obigen Beispiel können wir sehen, dass es einige Probleme gibt. Klicken wir auf die „4XX-Seite“, um ein Problem genauer zu betrachten.Wir können sehen, dass dieses Problem durch einen Blogbeitrag verursacht wurde, den wir entfernt haben, auf den aber immer noch 37 interne Links verweisen.Wenn die Seite dauerhaft entfernt wurde, musst du auch die internen Links entfernen, die auf diese 404-Seite zeigen.TippWenn auf die 404-Seite wichtige externe Links verweisen, solltest du eine 301-Weiterleitung der Seite in Betracht ziehen. Um dies zu überprüfen, kannst du den Bericht Broken backlinks des Site Explorers von Ahrefs verwenden.Wenn wir die genaue URL eingeben und dann zum Bericht Broken backlinks gehen, können wir sehen, dass diese Seite tatsächlich einige externe Links hat, die auf sie zeigen.Als Ergebnis dieser Prüfung sollten wir in Erwägung ziehen, diese Seite mit einer 301-Weiterleitung auf eine ähnliche Seite umzuleiten.2. Verwaiste Seiten beheben Verwaiste Seiten sind Seiten, die keine internen Links haben.Wenn du wichtige Seiten auf deiner Website hast, die in deinem Site Audit-Bericht als verwaiste Seiten eingestuft werden, dann hast du ein Problem.Die gute Nachricht ist, dass das Problem gelöst werden kann, indem du einfach einen neuen internen Link zu der/den betreffenden verwaisten Seite(n) hinzufügst.Sobald du deine Prüfung durchgeführt hast, kannst du sehen, ob du verwaiste Seiten hast:Klick auf den Bericht Links.Dann wählst du die Registerkarte „Probleme“..Site Audit > Links > Issues-Karte > Orphan page (has no incoming internal links)In dem Beispiel unten sehen wir, dass diese Seite eine verwaiste Seite hat. Aus zwei Gründen sollten keine wichtigen Seiten verwaist sein:Google wird sie nicht finden können (es sei denn, du übermittelst deine Sitemap über die Google Search Console oder sie haben Backlinks von gecrawlten Seiten auf anderen Websites).Es wird kein PageRank über interne Links übertragen, da es keine gibt. Überfliege die Liste und stelle sicher, dass hier keine wichtigen Seiten erscheinen.Wenn du viele Seiten auf deiner Website hast, kannst du die Liste nach dem organischen Traffic sortieren, von hoch nach niedrig.Verwaiste Seiten, die noch organischen Traffic erhalten, würden wahrscheinlich noch mehr Traffic erhalten, wenn sie intern verlinkt würden. 3. Identifiziere Möglichkeiten für neue interne LinksDas Auffinden neuer interner Linkmöglichkeiten ist ebenfalls ein zeitaufwändiger Prozess, wenn du es manuell machst, aber du kannst sie mit Site Audit in großen Mengen identifizieren.Dazu klickst du im Site Audit auf den Bericht Interne Linkmöglichkeiten.Du wirst eine Reihe von Vorschlägen sehen, wie du deine interne Verlinkung mit neuen Links verbessern kannst. Das Beste an diesem Bericht ist meiner Meinung nach, dass er genau vorschlägt, wo der interne Link platziert werden soll.Im obigen Beispiel schlägt Site Audit in dieser Textpassage vor, dass wir einen Link zu unserer Seite über die Facettennavigation hinzufügen sollten.Ich würde empfehlen, die Empfehlungen zu überprüfen und Links zu den wichtigsten Seiten hinzuzufügen, die du hervorheben möchtest.Abschließende GedankenInterne Verlinkung ist technisch nicht schwierig, aber es braucht Zeit und Geduld, um deinen Plan umzusetzen. Außerdem können Änderungen an deiner Website weitere Probleme verursachen, die, wenn sie nicht behoben werden, die Leistung deiner Website in Suchmaschinen wie Google beeinträchtigen können.Meiner Meinung nach ist die einzige nachhaltige Möglichkeit, deine internen Links zu überwachen, die Verwendung eines Tools wie Ahrefs’Site Audit.Hast du Fragen? Schreib mir auf Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Chris Haines Chris ist als SEO Director tätig und verfügt über 10 Jahre Erfahrung im Bereich SEO auf Agenturseite. Wenn er nicht gerade mit SEO beschäftigt ist, spielt er gerne mit alten Synthesizern herum, geht an Sandstränden spazieren oder trinkt eine gute Tasse Tee.",
  "headers": [
    {
      "level": "H1",
      "text": "Interne Links für SEO: Ein praktischer Leitfaden"
    },
    {
      "level": "H2",
      "text": "Was sind interne Links?"
    },
    {
      "level": "H2",
      "text": "Interne Links sind „super wichtig“ für SEO (laut Google)"
    },
    {
      "level": "H2",
      "text": "Arten von internen Links"
    },
    {
      "level": "H3",
      "text": "Navigations-Links"
    },
    {
      "level": "H3",
      "text": "Kontextbezogene Links"
    },
    {
      "level": "H3",
      "text": "Brotkrumen-Links"
    },
    {
      "level": "H3",
      "text": "Footer-Links"
    },
    {
      "level": "H2",
      "text": "Wie man eine interne Linkstruktur für den SEO-Erfolg aufbaut"
    },
    {
      "level": "H3",
      "text": "1. Plane deine interne Verlinkungsstruktur"
    },
    {
      "level": "H3",
      "text": "2. Verlinke auf interne Seiten, die dir wichtig sind"
    },
    {
      "level": "H3",
      "text": "3. Link zu relevanten Inhalten"
    },
    {
      "level": "H2",
      "text": "Wie du die internen Links deiner Website auf Probleme überprüfst"
    },
    {
      "level": "H3",
      "text": "1. Repariere fehlerhafte interne Links, um Autorität zurückzugewinnen"
    },
    {
      "level": "H3",
      "text": "2. Verwaiste Seiten beheben"
    },
    {
      "level": "H3",
      "text": "3. Identifiziere Möglichkeiten für neue interne Links"
    },
    {
      "level": "H2",
      "text": "Abschließende Gedanken"
    }
  ],
  "author": "Chris Haines"
}