{
  "url": "https://ahrefs.com/blog/de/keyword-kannibalisierung/",
  "slug": "keyword-kannibalisierung",
  "title": "Keyword-Kannibalisierung: Was das (wirklich) ist und wie man sie behebt",
  "description": "Von Keyword-Kannibalisierung spricht man, wenn mehrere Seiten einer Website auf die gleichen oder ähnliche Keywords abzielen und miteinander konkurrieren, wodurch die organische Leistung der Website beeinträchtigt wird.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (oder, in einfachen Worten, ich bin der Typ, der dafür sorgt, dass jeder Blog-Post EPISCH wird). Inhalt Viele glauben, dass mehrere Seiten zum selben Thema die Suchmaschinen verwirren und dazu führen, dass die “falsche” Seite gerankt wird.In den Worten von Patrick Stox ist diese ganze Idee “absurd”.Er hat Recht. Mehrere Seiten zum gleichen Thema können zu unerwarteten oder unerwünschten Rankings führen, aber das bedeutet nicht immer, dass etwas falsch ist oder repariert werden muss. Hin und wieder kann es jedoch eine Gelegenheit sein, Inhalte zu konsolidieren, um die Rankings und die organische Leistung zu verbessern.In diesem Leitfaden erfährst du:Was Keyword-Kannibalisierung istWarum Keyword-Kannibalisierung schlecht istWie man Keyword-Kannibalisierungsprobleme entdecktWie man Keyword-Kannibalisierungsprobleme behebtSchlechte Lösungen für Keyword-KannibalisierungWas ist Keyword-Kannibalisierung?Von Keyword-Kannibalisierung spricht man, wenn mehrere Seiten auf einer Website auf dieselben oder ähnliche Keywords abzielen und miteinander konkurrieren und die organische Leistung der Website beeinträchtigen.Nehmen wir zum Beispiel an, wir haben zwei Seiten über technische SEO. Wenn wir insgesamt mehr organischen Traffic bekommen könnten, indem wir die beiden Seiten zu einer zusammenfassen, ist das ein Kannibalisierungsproblem. Die Existenz dieser beiden Seiten frisst unsere organische Leistung auf.Ist Keyword-Kannibalisierung schlecht? Keyword-Kannibalisierung ist schlecht. Aber es ist wichtig, daran zu denken, dass es nur dann ein echtes Kannibalisierungsproblem gibt, wenn mehrere Seiten auf dasselbe Keyword abzielen und die organische Leistung einer Website beeinträchtigen. Da die Seiten in der Regel für viele Keywords ranken, ist das nicht immer der Fall.Nehmen wir zum Beispiel an, wir haben zwei Seiten, die auf dasselbe Keyword abzielen. Eine von ihnen ist auf Platz 1, aber die andere Seite (die wir lieber ranken würden) ist nirgends zu sehen. Du könntest argumentieren, dass es sich hier um Keyword-Kannibalisierung wie aus dem Lehrbuch handelt, weil die eine Seite scheinbar Traffic von der anderen Seite “kannibalisiert”.Aber selbst wenn das für den Traffic von diesem Keyword zutrifft, was ist, wenn diese Seiten für Hunderte von anderen Keywords ranken?Warum sollte man sich in diesem Fall um den Traffic von nur einem Keyword sorgen? Die Realität sieht so aus, dass wir hier kein echtes Kannibalisierungsproblem haben, denn die Existenz dieser beiden Seiten schadet der organischen Gesamtleistung unserer Website wahrscheinlich nicht. Würden wir eine der beiden Seiten zusammenlegen oder löschen, würden wir wahrscheinlich einige unserer Keyword-Rankings verlieren und einen Netto-Rückgang des Traffics verzeichnen.Wie man Keyword-Kannibalisierungsprobleme entdecktDer Trick, um echte Kannibalisierungsprobleme zu finden, besteht darin, nach Seiten zu suchen, die auf dieselben Keywords abzielen und dieselbe oder eine sehr ähnliche Absicht erfüllen. Der Grund dafür ist, dass es unwahrscheinlich ist, dass jede Seite für viele verschiedene Varianten von Long-Tail-Keywords rankt, wenn die Absicht dieselbe ist. Durch die Konsolidierung der Seiten kannst du also in der Regel mehr gewinnen als verlieren.Schauen wir uns ein paar Möglichkeiten an, wie du diese Seiten identifizieren kannst.Option 1. Ein Content-Audit durchführenWenn deine Website nicht riesig ist, sollten Kannibalisierungsprobleme bei einer Inhaltsprüfung relativ leicht zu erkennen sein. Option 2. Historische Rankings betrachtenDas funktioniert am besten, wenn du nach Kannibalisierungsproblemen für ein bestimmtes Keyword suchen willst.So gehst du im Site Explorer von Ahrefs vor:Gib deine Domain einGehe zum Bericht Organische KeywordsFiltere nach dem Keyword, das du untersuchen möchtestKlicke auf das Dropdown-Menü mit dem RankingverlaufWenn wir uns zum Beispiel die historischen Rankings von Moz für “Keyword-Kannibalisierung” ansehen, sehen wir drei Seiten, die in den letzten sechs Monaten gerankt haben — keine davon höher als auf Platz 8:Schauen wir uns zwei dieser URLs genauer an:/blog/identify-and-tackle-keyword-cannibalisation-in-2019/blog/how-to-solve-keyword-cannibalizationDas sagen sie uns über die Seiten: Es sind beides Blog-Beiträge. Sie handeln beide von derselben Sache (d.h. von der Lösung der Keyword-Kannibalisierung).Der erste Beitrag ist veraltet (er hat “2019” in der URL).Es handelt sich also mit ziemlicher Sicherheit um ein Kannibalisierungsproblem. Die Seiten erfüllen die gleiche Absicht und konkurrieren miteinander. Die organische Gesamtleistung von Moz könnte durch die Konsolidierung der Seiten wahrscheinlich verbessert werden.Option 3. Eine Site: Suche durchführenSuche bei Google nach site:deinewebsite.com \"thema\". Du siehst dann alle Seiten auf deiner Website, die mit diesem Thema zu tun haben. Wenn wir dies für site:moz.com \"keyword kannibalisierung\", tun, kannst du sehen, dass die ersten drei Ergebnisse die sind, die wir zuvor im Site Explorer entdeckt haben:TIPPSei vorsichtig mit dieser Taktik, denn Google gibt jedes vage passende Ergebnis zurück. Du kannst zum Beispiel oben sehen, dass es 661 Ergebnisse für unsere Suche gibt. Moz könnte hier durchaus ein Problem mit der Keyword-Kannibalisierung haben, aber nicht alle diese Seiten sind problematisch. Die meisten zielen auf ganz andere Keywords ab.Option 4. Eine Google-Suche durchführen und das Host-Clustering entfernenEine Site: Suche kann dir helfen, potenzielle Kannibalisierungsprobleme zu finden. Das einzige Problem ist, dass die Ergebnisse nicht eindeutig sind, was es schwer macht, zu wissen, wie man das Problem angehen kann. Wenn du dir das vorherige Beispiel ansiehst, wirst du sehen, dass es für Moz wahrscheinlich sinnvoll ist, drei ihrer Seiten zusammenzulegen. Aber wie genau sollen sie zusammengelegt werden? Welche Seiten sollten umgeleitet werden und welche sollten sie beibehalten? Ist das überhaupt eine Verbesserung?Antworten auf diese Fragen findest du oft, wenn du eine normale Google-Suche durchführst und das Host Clustering entfernst — das heißt, Google schließt ähnliche Seiten desselben Hosts aus den Suchergebnissen aus. Wenn wir zum Beispiel in Google nach “Keyword-Kannibalisierung” suchen, sehen wir nur ein Ergebnis von Moz unter den ersten 20:Wenn wir aber &filter=0 an die Google-Such-URL anhängen, wird das Host Clustering aufgehoben und es erscheinen drei Ergebnisse von Moz in den Top 20:Das ist nützlich, weil es jeder URL ein Gefühl für ihren Platz gibt.In diesem Beispiel ist der Beitrag von Moz aus dem Jahr 2019 auf Platz 6 gerankt, während die beiden anderen Beiträge auf den Plätzen 12 und 13 ranken. Wir wissen jetzt also, dass Moz höher als auf Position 6 ranken könnte, wenn wir einige dieser Seiten zusammenfassen und weiterleiten würden. Es ist auch klar, dass Google die Seite auf Position 6 derzeit als das relevanteste Ergebnis für dieses Keyword betrachtet. Daher ist es wahrscheinlich sinnvoll, hauptsächlich mit dieser Seite zu arbeiten und die anderen Seiten dorthin umzuleiten.Option 5. Überprüfen, ob mehrere URLs rankenWenn bei Google mehrere URLs für ein Keyword gerankt sind, kann das ein Zeichen für ein Kannibalisierungsproblem sein.So findest du diese Keywords im Site Explorer:Gib deine Domain einGehe zum Bericht Organische KeywordsSchalte “Nur mehrere URLs” ein Du siehst, dass der Site Explorer bei Moz für den Begriff “Keyword-Kannibalisierung” dasselbe Problem feststellt wie bei der Methode Nr. 2. Sei dir nur bewusst, dass dies nicht immer funktioniert, da Google, wie bereits erwähnt, dazu neigt, mehrere Seiten (auf “regulären” Positionen) desselben Hosts nicht zu ranken. Aber da es im Site Explorer superschnell geht, lohnt sich ein kurzer Check trotzdem.WICHTIGNicht bei allen Keywords, die hier auftauchen, handelt es sich um Kannibalisierungsprobleme. Du solltest immer die SERP und die Ranking-Historie überprüfen, um sicherzustellen, dass du wirklich ein Kannibalisierungsproblem hast.Wie man Keyword-Kannibalisierungsprobleme behebtWenn du sicher bist, dass du ein Kannibalisierungsproblem hast, kannst du die organische Leistung oft verbessern, indem du die Seiten konsolidierst. Das kann bedeuten, dass du eine alte, veraltete Seite auf eine relevantere Seite umleitest, die du bereits hast, oder mehrere Seiten zu einer neuen Seite zusammenfasst.Beide Optionen wirken sich in der Regel positiv aus, weil sie bekannte Rankingsignale wie Backlinks und interne Links auf einer Seite bündeln, anstatt sie auf mehrere Seiten zu verteilen.Das haben wir 2018 für zwei Leitfäden zum Thema Broken Link Building erfolgreich getan.Das haben wir getan:Wir haben einen neuen Leitfaden geschrieben, der das Wissen aus beiden Leitfäden zusammenfasst.Wir haben den neuen Leitfaden unter einer der bestehenden URLs veröffentlicht. Wir löschten den alten Leitfaden und leiteten ihn auf den neuen Leitfaden um.Wann wir das getan haben, kannst du wahrscheinlich an der Grafik unten erkennen, die unsere historischen Rankings für “broken link building” zeigt:Unser historischer geschätzter organischer Traffic auf diesen beiden Seiten zeigt ebenfalls die positive Veränderung (der Pfeil markiert das Konsolidierungsdatum):Bis zur Umleitung im Jahr 2018 hatten beide Seiten ein bisschen Traffic. Nach der Zusammenlegung und Weiterleitung hat nur noch eine Seite Traffic… aber viel mehr als beide Seiten zusammen.TIPPDenke daran, dass es immer eine gute Praxis ist, interne Links nach der Implementierung von Weiterleitungen auszutauschen. Dazu kannst du das Link Explorer Tool im Site Audit von Ahrefs verwenden:Crawle deine Website mit Site AuditRufe das Link Explorer Tool aufKlicke auf Erweiterter FilterKlicke auf +RegelÄndere die neue Regel von “Ist die Quelle intern” in “Ziel-URL”.Gib die alte weitergeleitete URL einDu siehst dann eine Liste der Seiten, die intern auf diese URL verlinken, zusammen mit dem Ankertext des Links und anderen Details.Erfahre mehr: Interne Links für SEO: Ein praktischer LeitfadenIst die Lösung wirklich so einfach?Die meiste Zeit über ja. Aber wie unsere erfahrenen Leserinnen und Leser wissen, kommt es bei der Suchmaschinenoptimierung auf vieles an, deshalb sind die Dinge manchmal etwas komplizierter.Wir haben zum Beispiel zwei sehr ähnliche Leitfäden:Wie du deine Website bei Suchmaschinen anmeldestWie du deine Website bei Google anmeldestBeide Seiten erfüllen sehr ähnliche Ziele, obwohl sie auf leicht unterschiedliche Keywords abzielen. Und wenn wir uns den geschätzten organischen Traffic ansehen, sehen wir, dass der Traffic der einen Seite im Vergleich zur anderen verblasst:Es sieht also nach einem Kannibalisierungsproblem aus, und wir sollten die Seiten wahrscheinlich zusammenlegen. Richtig?Vielleicht. Andererseits könnte unser Leitfaden für die Anmeldung von Websites bei Suchmaschinen in der organischen Suche im Moment nicht besser abschneiden. Er ist auf Platz 1 für sein wichtigstes Keyword…… und scheint sein “Traffic-Potenzial” so ziemlich ausgeschöpft zu haben (er bekommt mehr Traffic als jeder andere ähnliche Ratgeber):Ist das also wirklich ein Problem der Kannibalisierung? Bringt es wirklich etwas, diese Seiten zusammenzulegen? Wahrscheinlich nicht. Und durch die Zusammenlegung der Beiträge würden wir wahrscheinlich den geringen organischen Traffic verlieren, den der andere Leitfaden derzeit erhält. Warum sich also die Mühe machen?Ein weiteres Beispiel für ein differenziertes Szenario ist die Ausrichtung auf dasselbe Keyword auf mehreren Seiten, die unterschiedliche Ziele verfolgen. Das ist in Ordnung, wenn das Keyword eine gemischte Absicht hat, und stellt normalerweise kein echtes Kannibalisierungsproblem dar. Natürlich kann es zu Überschneidungen bei den Keywords kommen oder dazu, dass die Seiten regelmäßig ranken. Aber in der Regel erhält jede Seite Traffic von ihrem eigenen Bereich mit Longtail Keywords.(Das ist auch der Grund, warum es in der Regel keinen Sinn macht, die Kannibalisierung auf Keyword-Ebene zu “beheben”. Du riskierst, Traffic von Longtails zu verlieren.)Was aber, wenn deine Analysen dir sagen, dass eine dieser Seiten wenig oder gar keinen Wert hat? Vielleicht ist die eine ein super ToFu-Blogpost und die andere eine BoFu-Landingpage. In diesem Fall kannst du die Seite löschen und sie auf die Landing Page umleiten, um die “Autorität” zu stärken, solange du dir zu 100% sicher bist, dass der Blogpost keinen Wert für dein Unternehmen hat. Dadurch wirst du wahrscheinlich insgesamt etwas organischen Traffic verlieren. Aber das macht nichts, denn du hast festgestellt, dass dieser Traffic keinen Wert für dein Unternehmen hat.Keyword-Kannibalisierungslösungen, die wir selten (oder nie) empfehlenOft wird versucht, die Kannibalisierung auf Keyword-Ebene mit scheinbar logischen Lösungen zu lösen, die in der Praxis grundlegend fehlerhaft sind. Schauen wir uns diese Lösungen einmal genauer an, damit du weißt, was du nicht tun solltest. Die Seite löschenDas ist selten eine gute Lösung, es sei denn, die Seite hat keinen Wert für dein Unternehmen (wie oben beschrieben) oder sie rankt nur für das “kannibalisierende” Keyword. Beide Szenarien sind ziemlich unwahrscheinlich, daher ist dies eine seltene Maßnahme im Falle einer Kannibalisierung.Die Seite nicht indexierenDie Indexierung führt dazu, dass Suchmaschinen die Seite aus ihrem Index streichen, so dass sie für nichts mehr gerankt wird. Das ist eine furchtbare Methode, um Kannibalisierung zu beheben, und unterstreicht noch einmal, warum es fast immer eine schlechte Idee ist, Kannibalisierung auf Keyword-Ebene anzugehen. Empfohlene Lektüre: Robots Meta Tag & X‑Robots-Tag: Alles, was du wissen musstDie Seite kanonisierenDies ist nur dann eine brauchbare Lösung, wenn es sich um mehrere Seiten handelt, die fast oder ganz identisch sind, auch bekannt als Duplicate Content. Die Kanonisierung ist kein Mittel, um die Kannibalisierung von Keywords zu beheben.Empfohlene Lektüre: Kanonische Tags: Ein einfacher Leitfaden für AnfängerDie Seite de-optimierenIn der Theorie macht das Sinn, aber es ist ein grundlegender Fehler, denn du kannst eine Seite nicht nur für ein Keyword de-optimieren. So funktioniert das nicht. Wenn du zum Beispiel alle internen Links entfernst, die das kannibalisierende Keyword als Anker haben, wird sich das wahrscheinlich auch auf das Ranken der Seite für andere Keywords auswirken. Dasselbe gilt für das Entfernen von Erwähnungen des kannibalisierenden Keywords auf der Seite.FazitKeyword-Kannibalisierung gibt es nicht wirklich — zumindest nicht so, wie die meisten Menschen sie verstehen. Google wird nicht durch mehrere Seiten zu ähnlichen Themen oder Seiten, die auf dieselben Keywords abzielen, “verwirrt”. Es weiß, was auf diesen Seiten steht und rankt sie entsprechend.Heißt das, dass Google immer die Seite rankt, die du ranken willst? Nein, natürlich nicht. Aber das bedeutet nicht, dass die falsche Seite gerankt wird oder dass drastische Maßnahmen erforderlich sind, um das Problem zu “beheben”. Viele gängige “Lösungen” für die Keyword-Kannibalisierung schaden mehr als sie nützen.Hast du Fragen? Bist du anderer Meinung als ich? Schreib mir auf Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Joshua Hardwick Head of Content @ Ahrefs (oder, in einfachen Worten, ich bin der Typ, der dafür sorgt, dass jeder Blog-Post EPISCH wird).",
  "headers": [
    {
      "level": "H1",
      "text": "Keyword-Kannibalisierung: Was das (wirklich) ist und wie man sie behebt"
    },
    {
      "level": "H2",
      "text": "Was ist Keyword-Kannibalisierung?"
    },
    {
      "level": "H2",
      "text": "Ist Keyword-Kannibalisierung schlecht?"
    },
    {
      "level": "H2",
      "text": "Wie man Keyword-Kannibalisierungsprobleme entdeckt"
    },
    {
      "level": "H3",
      "text": "Option 1. Ein Content-Audit durchführen"
    },
    {
      "level": "H3",
      "text": "Option 2. Historische Rankings betrachten"
    },
    {
      "level": "H3",
      "text": "Option 3. Eine Site: Suche durchführen"
    },
    {
      "level": "H3",
      "text": "Option 4. Eine Google-Suche durchführen und das Host-Clustering entfernen"
    },
    {
      "level": "H3",
      "text": "Option 5. Überprüfen, ob mehrere URLs ranken"
    },
    {
      "level": "H2",
      "text": "Wie man Keyword-Kannibalisierungsprobleme behebt"
    },
    {
      "level": "H2",
      "text": "Ist die Lösung wirklich so einfach?"
    },
    {
      "level": "H2",
      "text": "Keyword-Kannibalisierungslösungen, die wir selten (oder nie) empfehlen"
    },
    {
      "level": "H3",
      "text": "Die Seite löschen"
    },
    {
      "level": "H3",
      "text": "Die Seite nicht indexieren"
    },
    {
      "level": "H3",
      "text": "Die Seite kanonisieren"
    },
    {
      "level": "H3",
      "text": "Die Seite de-optimieren"
    },
    {
      "level": "H2",
      "text": "Fazit"
    }
  ],
  "author": "Joshua Hardwick"
}