{
  "url": "https://ahrefs.com/blog/de/keyword-recherche-tipps/",
  "slug": "keyword-recherche-tipps",
  "title": "6 Keyword-Recherche Tipps, um ungenutzte Möglichkeiten zu finden",
  "description": "Die Keyword-Recherche ist ein wichtiger Faktor für den Erfolg einer Website. Mit dem herkömmlichen Vorgehen können eine Vielzahl an guten Keywords aber übersehen werden.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (oder, in einfachen Worten, ich bin der Typ, der dafür sorgt, dass jeder Blog-Post EPISCH wird). Inhalt Die Keyword-Recherche ist ein wichtiger Faktor für den Erfolg einer Website. Mit dem herkömmlichen Vorgehen können eine Vielzahl an guten Keywords aber übersehen werden.Betrachte beispielsweise das folgende Keyword:Es wurde uns nicht angezeigt als wir unserem normalen Prozess der Seed-Keywordsuche im Keywords Explorer folgten und einen Keyword-Ideen-Report auswählten, einige Filter anwendeten und nach Ideen suchten.Dennoch haben wir einen Blog-Beitrag darüber geschrieben und ranken nun auf der Top-Platzierung mit einem geschätzten Such-Traffic von 700+ im Monat.In diesem Guide lernst du, wie wir dieses Keyword gefunden haben und fünf weitere Methoden, wie du innerhalb von wenigen Minuten ungenutzte Chancen recherchieren kannst.Verfolge die beliebtesten Seiten deiner Wettbewerber zurück Führe eine Content Gap-Analyse durchFinde Seiten, die organischen Traffic erhalten und wenige oder keine Backlinks habenFinde Keywords, für die Foren rankenFinde neue Keywords in Google Search Console, die sich bewährt haben Finde lukrative Affiliate-Keywords mit Traffic-Potenzial 1. Verfolge die beliebtesten Seiten deiner Wettbewerber zurückJede/r geht bei der Keyword-Recherche anders vor, weshalb Wettbewerber oft für Keywords ranken, die man selbst gar nicht in Erwägung gezogen hat.Dies ist nicht zwangsläufig ein Problem.Durch die Rückverfolgung der Seiten, welche am besten in der organischen Suche ranken, kannst du dir die Bemühungen deiner Wettbewerber, Keywords und Themen mit Traffic-Potenzial zu finden, zu Nutze machen.Dabei kannst du wie folgt vorgehen:Füge eine Wettbewerber-Seite in den Ahrefs Site Explorer ein und navigiere zum Top Pages-Report. Dieser zeigt, welche ihrer Seiten den meisten organischen Traffic erhalten.Nicht sicher, wer deine organischen Wettbewerber sind?Füge deine eigene Domain in den Site Explorer ein und navigiere zum Competing Domains-Report. Führe den Cursor über die erste thematisch ähnliche Seite, stelle sicher, dass ausreichend organischer Traffic vorhanden ist und füge diese in den Site Explorer ein.Falls deine Seite nicht für viele Keywords rankt, findest du unter Umständen keine guten Vorschläge im Competing Domains-Report. Der Grund hierfür ist, dass der Report auf Keyword-Überschneidungen basiert.Deshalb hier ein anderes Vorgehen, um gute konkurrierende Domains zum analysieren zu finden:Suche bei Google nach Keywords, für die du gerne ranken möchtestFüge eine der Domains, welche am besten rankt in den Ahrefs Site Explorer einÜberprüfe, dass sie nennenswerten Traffic erhältFüge deine Analyse fort.Da wir auch am globalen Traffic-Potenzial interessiert sind, passen wir den Filter an, um Traffic-Schätzungen für alle Länder zu sehen, nicht nur für die USA.Wenn wir nun die URLs und Keywords in der Top Keyword-Spalte betrachten, befinden sich dort einige Themen, die wir bereits abgedeckt haben. Es gibt aber auch einige Themen wie “content writing”, ein Thema, welches mehr als 10.500 organische Besuche im Monat zu backlinko.com sendet, die wir nicht abgedeckt haben.Ähnlich verhält es sich mit “bounce rate.”Aufgrund des Traffic-Potenzials dieser Themen, sollten wir es in Erwägung ziehen über sie im Ahrefs Blog zu schreiben.Wenn du nun alle unausgeschöpften Ideen inklusive Traffic-Potenzial deiner Wettbewerber recherchiert hast, höre an dieser Stelle nicht auf. Überprüfe den Competing Domains-Report nach den Wettbewerbern deiner Wettbewerber und betrachte auch ihre besten Seiten.Wiederhole diesen Vorgang beliebig oft für eine nahezu unendliche Anzahl an Keyword-Ideen.2. Führe eine Content Gap-Analyse durchWenn mehrere deiner Wettbewerber für ein Keyword ranken, könnte dies ein Zeichen sein, dass es auch für dich Sinn macht, das Ranking für dieses Keyword anzustreben.Beispielsweise ranken drei E‑Mail Marketing-Tools —Active Campaign, Campaign Monitor und Get Response— in den Top Fünf für das Keyword “newsletter ideas”…… aber Convert Kit, ein anderes E‑Mail Marketing Tool, rankt hier nicht:Der effizienteste Weg solche Keywords zu finden, ist die Durchführung einer Content Gap-Analyse.Füge dazu deine Domain in den Ahrefs Site Explorer ein, navigiere zum Content Gap-Report und gebe einige konkurrierende Domains im oberen Bereich an. Im Fall von Convert Kit könnten diese activecampaign.com, getresponse.com und campaignmonitor.com sein.Wenn wir diese Suche durchführen, sehen wir, dass Get Response und Campaign Monitor für “email marketing tips” ranken, Convert Kit jedoch nicht.Sollten nur wenige relevante Keywords im Report angezeigt werden, stelle den Intersection-Filter auf “3 targets”. So siehst du nur Keywords, für die alle Wettbewerber ranken.Obwohl der Content Gap-Report das geschätzte monatliche Suchvolumen für jedes Keyword anzeigt, beachte, dass dies nicht immer die beste Möglichkeit ist, um das Such-Traffic-Potenzial eines Themas zu beurteilen. Um eine bessere Einschätzung zu erhalten, klicke auf den “SERP”-Button und überprüfe den geschätzten organischen Traffic zu den Seiten mit Top-Ranking.3. Finde Seiten, die organischen Traffic erhalten und wenige oder keine Backlinks habenLaut unserer Untersuchung von mehr als einer Milliarde Seiten, gibt es eine klare Korrelation zwischen der Anzahl an verweisenden Domains (Backlinks von uniquen Websites) zu einer Seite und ihrem organischen Traffic.Das bedeutet jedoch nicht, dass es unmöglich ist für etwas mit wenig oder keinen Backlinks zu ranken. Du wirst gelegentlich Seiten finden, die nennenswerten organischen Traffic erhalten aber keine hohe Anzahl an Backlinks haben.Zum Beispiel die folgende Seite über Pflanzen, die Moskitos abwehren, erhält monatlich im Durchschnitt circa 5200 organische Besuche obwohl sie nur einen Backlink hat:Wenn du eine Website betreiben würdest, die Pflanzensamen verkauft, könnte es Sinn machen, einen Beitrag über dieses Thema zu schreiben, da es relevant ist und nur wenig Konkurrenz hat. Du könntest damit vermutlich mit wenigen oder keinen Backlinks bei Google ranken.Wie kannst du also solche Seiten ausfindig machen?Navigiere zunächst zu Ahrefs Content Explorer und suche nach einem relevanten Thema. Wenn du eine Fitness-Website betreibst, könnte dies “weight loss” oder “build muscle” sein. Filtere die Ergebnisse dann nach Seiten mit mindestens 500 organischen Besuchen im Monat und wenigen oder keinen verweisenden Domains.Nebenbei bemerkt. Es macht auch Sinn nur nach Seiten zu suchen, die erreichbar und in der Sprache verfasst sind, die für dich relevant ist. Dies wird einige Seiten, die nicht relevant sind, aus den Ergebnissen entfernen.Überfliege die Ergebnisse. Wenn dir ein Thema ins Auge fällt, klicke den “Details”-Button und überprüfe den “Organic Keywords”-Tab nach Suchvolumen, den Keyword Difficulty Scores und Ranking-Positionen der Keywords, die Traffic zu dieser Seite senden.Wenn die Seite mit einem “Fat-Head”-Keyword auf der ersten Position rankt, dann ist ihr Traffic vermutlich ein guter Indikator für das allgemeine Traffic-Potenzial des Themas.Wenn die Seite weiter unten auf der ersten Seite rankt, wie im gezeigten Beispiel für “losing weight while breastfeeding” der Fall, dann füge das Keyword in den Keywords Explorer und überprüfe den Traffic für die Seiten im Top-Ranking in der “SERP Overview”.Im Folgenden sehen wir, dass einige der gut platzierten Seiten sogar mehr Traffic erhalten, aber nur ein paar mehr Backlinks haben.TIPWenn du im Content Explorer Ergebnisse betrachtest, konzentriere dich auf die “Organic Traffic” Grafik.Sollte die Seite in letzter Zeit einen signifikanten Traffic-Anstieg aufweisen und von einem berichtenswerten Thema handeln, ist dies vermutlich auf das Ranking im Top Stories-SERP Feature zurückzuführen.In der Regel handelt es sich dabei nicht um geeignete Themen, da das langfristige Traffic-Potenzial nicht gegeben ist.Halte stattdessen nach Seiten mit einer mehr oder weniger gleichmäßigen organischen Traffic-Grafik, vor allem über einen Zeitraum von sechs Monaten oder mehr, Ausschau.Die Keywords, für die diese Seiten ranken, haben in der Regel ein langfristigeres Traffic-Potenzial.4. Finde Keywords, für die Foren rankenNutzergenerierte Inhalte zu ranken, ist selten Googles erste Wahl, da es sich dabei oft um Inhalte mit geringer Qualität handelt, die schlecht geschrieben sind. Wenn du also Forumsbeiträge im Top Ten Ranking siehst, ist dies in der Regel ein Zeichen für ein wettbewerbsloses Thema.Dieser Thread auf Quora zum Beispiel rankt auf oberster Position für “difference between ddr3 and ddr4” und erhält über 5.400 Besuche im Monat.Laut dem Keywords Explorer hat dieses Keyword einen geringen Keyword Difficulty Score von 11. In den Top Ten befinden sich auch weitere Seiten, die monatlich hunderte Besuche über die Suche erhalten aber nur wenige Backlinks aufweisen können.Keyword Difficulty Score von 11 für “difference between ddr3 and dd4”.Seiten, die für “difference between ddr3 and ddr4” ranken und viel Traffic erhalten trotz einer geringen Anzahl an Backlinks.Um solche Keywords zu finden, installiere die Ahrefs SEO Toolbar und suche in Google nach Foren über ein Thema. Überfliege die Suchergebnisse nach solchen mit Such-Traffic.Füge eines der Foren in den Ahrefs Site Explorer ein und überprüfe den Top Pages-Report.Nebenbei bemerkt. Wenn das Forum Teil einer Subdomain ist, füge statt der Root-Domain die Subdomain in Ahrefs ein (z.B. forums.tomshardware.com und nicht tomshardware.com). Wenn das Forum und alle dazugehörigen Beiträge Teil eines Sub-Folders sind, dann füge statt der Root-Domain den Forums-Path in Ahrefs ein (z.B. pcpartpicker.com/forums/ und nicht pcpartpicker.com).Du wirst vermutlich feststellen, dass die besten Keywords für viele dieser Seiten Marken-Keywords sind. Um dies zu vermeiden, füge eine Liste mit Marken-Begriffen, die du durch ein Komma trennst, zum “Exclude”-Filter hinzu. In diesem Fall, werden es Begriffe wie “pcpartpicker” und “pc part picker” sein. Nutze den “Target”-Filter, um nur Keywords auszuschließen, die diese Begriffe enthalten, nicht URLs.Gehe die Liste nach Seiten durch, die Traffic für Keywords erhalten, für die du ranken könntest.Falls du irgendwelche Trends erkennen kannst, füge ähnliche Begriffe in den Keywords Explorer, navigiere zum Phrase Match-Report und nutze den “Include”-Filter, um ähnliche Keywords zu finden.In der Liste oben sind zum Beispiel einige Keywords wie “[cpu model] vs [cpu model]” aufgeführt. Lass uns deshalb im Keyword Explorer nach einigen Prozessor-Seriennummern suchen und zum Phrase Match-Report navigieren, um “vs” zum “Include”-Filter hinzuzufügen und Vergleichs-Keywords zu finden.5. Finde neue Keywords in Google Search ConsoleFalls du Google Search Console jemals zuvor genutzt hast, weisst du, dass der “Search Results”-Report Keywords zeigt, für die du rankst. Für viele dieser Keywords wirst du bereits Inhalte erstellt oder optimiert haben, aber nicht für alle.Hier ist eine einfache Möglichkeit neue Ideen für Themen zu generieren:Halte nach Keywords mit hohen Impressionen Ausschau, die mit Themen zusammenhängen, für die du deine Inhalte nicht optimiert hast.Eines der Keywords, welches uns zum Beispiel mit vielen Impressions angezeigt wird, ist “amazon affiliate.”Ich kann mich nicht daran erinnern, dass wir über diese Thema geschrieben haben, weshalb ich nach diesem Keyword filtere und den Pages-Tab überprüfe, um zu sehen welcher Beitrag rankt.Es schaut so aus, als ob es unsere Liste der erfolgreichen Amazon Affiliate Websites ist.Wenn wir die Seiten, welche aktuell gut für dieses Keyword ranken, im Keywords Explorer überprüfen, sehen wir, dass keine davon Listen von Affiliate-Seiten sind. Es sind meistens Guides rund um das Thema Geldverdienen als Amazon Affiliate.Da diese Beiträge viel Traffic erhalten und unser Toolset dabei helfen kann, eine profitable Amazon Affiliate Seite zu erstellen, wäre dies ein gutes Thema über das wir schreiben könnten. Dieser Post hätte eine höhere Übereinstimmung mit dem Search Intent, weshalb wir hoffentlich besser für dieses Keyword ranken könnten, um mehr Traffic für unseren Blog zu generieren.Google Search Console für dieses Vorgehen zu verwenden funktioniert gut, hat jedoch einen Nachteil: Du bist auf 1000 Daten-Zeilen limitiert.Falls dies ein Problem für dich darstellt, kannst du stattdessen den Organic Keywords-Report im Ahrefs Site Explorer nutzen. Dieser zeigt alle Top 100-Rankings aus unserer Datenbank von mehr als 490 Millionen Keywords.Wir können zum Beispiel sehen, dass der Ahrefs Blog für über 73.000 Keywords in den USA rankt.Falls dadurch das gegenteilige Problem entsteht und dir nun zu viele Keywords angezeigt werden, kannst du die Suche mit einem Search Volume-Filter einschränken.6. Finde lukrative Affiliate-Keywords mit Traffic-PotenzialEs ist einfach, eine Vielzahl an Affiliate-Keywords mit dem üblichen Vorgehen im Keywords Explorer zu finden. Suche einfach nach einigen Keywords, die relevant für deine Nische sind, überprüfe den Keywords Ideas-Report und füge Wörter wie “best,” “review,” and “top” zum Include-Filter hinzu.Wenn es auf deiner Website zum Beispiel um Küchenequipment geht, könnte dies wie folgt aussehen:Nebenbei bemerkt. Stelle dabei sicher, dass du die Wörter mit Komma trennst und den “Any Word”-Filter wählst.Obwohl diese Methode sehr schnell umgesetzt ist, können so jedoch einige Keywords übersehen werden.Es ist auch einfach, Keywords mit geringem Suchvolumen auszuschließen, selbst wenn das Thema grundsätzlich hohes Traffic-Potenzial hat.Das Keyword “best carbon steel pans” zum Beispiel schaut nicht nach einem guten Keyword aus, da es monatlich nur ein Suchvolumen von 100 aufweist. Aber wenn du die Seiten mit Top-Platzierung betrachtest, siehst du, dass diese deutlich mehr Traffic erhalten.Da es ewig dauern würde, die SERPs für Tausende von Keywords manuell zu überprüfen, hier ein schnelleres Vorgehen, um Affiliate-Themen mit Traffic-Potenzial zu finden:Kopiere eine konkurrierende Affiliate-Seite in den Site ExplorerNavigiere zum Top Pages-ReportFüge eine Liste mit Wörtern wie “best,” “review,” and “top” durch Komma getrennt zum Include-Filter hinzu.Gehe die Ergebnisliste mit Keywords für “best [product type]”-Seiten, die Traffic erhalten, durch.Abschließende GedankenKeyword-Recherche kann auf verschiedene Weisen durchgeführt werden. Während der herkömmliche Prozess in einem Tool nach einem Seed-Keyword zu suchen und nach Ideen Ausschau zu halten, funktioniert, solltest du dich nicht auf diese Methode beschränken.Bist du auf der Suche nach weiteren unausgeschöpften Keyword-Ideen? Lese das hier.Suchst du nach einem bewährten Keyword-Recherche Framework? Bitte schön. Hast du Fragen? Kontaktiere mich auf Twitter.Übersetzt von Heike Radlanski. Heike beschäftigt sich mit allen Aspekten des Online Marketing und Product Managements. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Joshua Hardwick Head of Content @ Ahrefs (oder, in einfachen Worten, ich bin der Typ, der dafür sorgt, dass jeder Blog-Post EPISCH wird).",
  "headers": [
    {
      "level": "H1",
      "text": "6 Keyword-Recherche Tipps, um ungenutzte Möglichkeiten zu finden"
    },
    {
      "level": "H2",
      "text": "1. Verfolge die beliebtesten Seiten deiner Wettbewerber zurück"
    },
    {
      "level": "H2",
      "text": "2. Führe eine Content Gap-Analyse durch"
    },
    {
      "level": "H2",
      "text": "3. Finde Seiten, die organischen Traffic erhalten und wenige oder keine Backlinks haben"
    },
    {
      "level": "H2",
      "text": "4. Finde Keywords, für die Foren ranken"
    },
    {
      "level": "H2",
      "text": "5. Finde neue Keywords in Google Search Console"
    },
    {
      "level": "H2",
      "text": "6. Finde lukrative Affiliate-Keywords mit Traffic-Potenzial"
    },
    {
      "level": "H2",
      "text": "Abschließende Gedanken"
    }
  ],
  "author": "Joshua Hardwick"
}