{
  "url": "https://ahrefs.com/blog/de/keyword-suchvolumen/",
  "slug": "keyword-suchvolumen",
  "title": "Keyword-Suchvolumen: 5 Dinge, die du wissen musst, um SEO-Fehler zu vermeiden",
  "description": "Das Suchvolumen wird in der SEO häufig herangezogen. Wenn man aber zu sehr darauf vertraut, kann zu schlechten Marketingentscheidungen führen.",
  "content": "Tim Soulo Tim ist CMO und Produktberater bei Ahrefs. Vor allem aber ist er der größte Fan und der wahrste Missionar des Unternehmens. Erfahren Sie mehr über Tim Article PerformanceData from AhrefsVerlinkung von Websites 2 Sign up for AhrefsGet SEO metrics of any website or URL.The number of websites linking to this post.This post's estimated monthly organic search traffic. Inhalt Das Suchvolumen ist wahrscheinlich die am häufigsten verwendete Metrik in der SEO. Es hilft uns, die Popularität verschiedener Keywords zu messen und den Such-Traffic vorherzusagen, der durch das Ranken dieser Keywords entstehen kann.Doch allzu oft nehmen unerfahrene SEOs das Keyword-Suchvolumen für bare Münze, was zu schlechten Marketingentscheidungen und der Verschwendung wertvoller Unternehmensressourcen führt.In diesem Beitrag werfen wir einen genaueren Blick auf das Suchvolumen, erklären, was es ist, woher es kommt und wie es dich manchmal in die Irre führen kann.Was ist das Keyword-Suchvolumen?Das Keyword-Suchvolumen ist eine SEO-Kennzahl, die dir sagt, wie oft im Monat durchschnittlich nach einem bestimmten Keyword an einem bestimmten Ort gesucht wird. Meistens bezieht sich das Suchvolumen auf die Anzahl der Suchanfragen bei Google, aber diese Kennzahl kann sich auch auf andere Suchmaschinen beziehen.Ein wichtiger Unterschied ist, dass das Suchvolumen die Anzahl der tatsächlichen Suchanfragen für ein Keyword widerspiegelt und nicht die Anzahl der Personen, die nach dem Keyword suchen.Wenn also ein Keyword ein monatliches Suchvolumen von 100 hat, können diese Suchanfragen von 100 verschiedenen Personen durchgeführt worden sein oder nur von 10 Personen, die jeweils 10 Suchen durchgeführt haben.Diese kleine Klarstellung ist nur die Spitze des Eisbergs von all den Dingen, die bei der Analyse des Suchvolumens eines Keywords oft falsch gemacht werden.Lass uns also fünf weitere Dinge besprechen, die du wissen musst, um diese Kennzahl besser nutzen zu können.1. Suchvolumenzahlen sind jährliche DurchschnittswerteDie meisten SEO Tools geben das Suchvolumen als Jahresdurchschnitt an. Das ist keine große Sache für Suchanfragen, die das ganze Jahr über eine relativ konstante Suchnachfrage haben. Aber bei saisonalen Suchanfragen oder heißen Trends kann das ziemlich irreführend sein.Vergleichen wir die Entwicklung des Suchvolumens der folgenden beiden Keywords: “Content Marketing” und “NFT”.Das Keyword “Content Marketing” hat sich im Laufe des Jahres zwischen 12.000 und 17.000 Suchanfragen pro Monat eingependelt. Der Jahresdurchschnitt von 16.000 Suchanfragen ist also eine vernünftige Vorhersage für das Suchvolumen, das es in den kommenden Monaten erhalten wird.Bei dem Keyword “NFT” sieht es dagegen ganz anders aus. Im Laufe eines Jahres stieg es von praktisch nichts auf satte 2,3 Millionen Suchanfragen im März. Dann fiel es auf 374.000 im Juni und stieg im August auf 952.000.Mit anderen Worten: Es ist schwer vorherzusagen, wie sich das Suchvolumen in den kommenden Monaten entwickeln und wo es sich schließlich einpendeln wird, wenn der Hype um die NFTs nachlässt.Was ich mit diesen beiden Beispielen verdeutlichen möchte, ist, dass das Suchvolumen sehr unbeständig sein kann. Und der 12-Monats-Durchschnitt, den die SEO Tools melden, entspricht nicht unbedingt dem monatlichen Suchvolumen für das Keyword, wenn du dafür rankst. 2. Nicht alle Suchanfragen führen zu KlicksDie Tatsache, dass Menschen nach etwas suchen, bedeutet nicht unbedingt, dass sie auch auf eines der Suchergebnisse klicken werden.Das Ziel von Google ist es, seine Nutzerinnen und Nutzer auf Anhieb zufrieden zu stellen, ohne dass sie “Zeit verschwenden”, indem sie auf eines der Suchergebnisse klicken. Laut einer aktuellen Studie endeten zwei Drittel der Google-Suchen im Jahr 2020 ohne einen Klick.Zwei Drittel der Google-Suchen im Jahr 2020 führten nicht zu einem Klick. Das Keyword “elon musk age” wird zum Beispiel durchschnittlich 37.000 Mal pro Monat gesucht. Aber die Anzahl der Klicks auf die Suchergebnisse beträgt (laut Ahrefs) nur 6.300.Das liegt daran, dass Google eine sofortige Antwort auf diese Frage gibt und die Nutzer davon abhält, auf eines der Suchergebnisse zu klicken:Wenn eine Suchanfrage also ein großes Suchvolumen hat, bedeutet das nicht unbedingt, dass sie dir viel Such-Traffic bringt. Google kann die Antwort einfach direkt in den Suchergebnissen anzeigen.3. Werbetreibende könnten deine Klicks klauenEs gibt noch eine Sache, die dir die wertvollen Klicks wegnehmen kann: Google-Anzeigen.Seit heute zeigt Google bis zu vier bezahlte Suchanzeigen über den organischen Suchergebnissen an. Wenn du die visuelle Geschichte dieser bezahlten Anzeigen verfolgst, wird deutlich, dass Google versucht, diese Anzeigen fast ununterscheidbar von den organischen Suchergebnissen zu machen.Außerdem neigt Google dazu, diese Anzeigen mit Bildern und Sitelinks zu verschönern, um den Platz, den sie einnehmen, zu maximieren und die organischen Suchergebnisse weiter nach unten zu drücken.Mit anderen Worten: Wenn du für ein beliebtes Keyword ganz oben rankst, ist das keine Garantie mehr dafür, dass du auch viele Klicks bekommst.Ranking Top3 in Google in 2021:#AD1-Link-Link-Link-Link#AD2 (+🖼️)- links- button#AD3 (+🖼️)#1 Organic result- links#PeopleAlsoAsk-Q1-Q2-Q3-Q4#KnowledgePanel (for a related term)- 🖼️🖼️- text- link- link- link- link#PeopleAlsoSearchFor🖼️🖼️🖼️ pic.twitter.com/BbAfwwwjVk— Tim Soulo 🇺🇦 (@timsoulo) June 29, 2021 Selbst wenn in den Suchergebnissen für das Keyword, für das du ranken willst, keine Anzeigen erscheinen, ist das keine Garantie dafür, dass in Zukunft keine Anzeigen mehr erscheinen. Wenn du für ein Keyword an der Spitze rankst, verdrängst du die Seiten deiner Konkurrenten nach unten und lässt sie ohne Such-Traffic zurück. 4. Das Suchvolumen ist nicht sehr genauDer Google Keyword Planner gilt als die beste Quelle für Daten zum Keyword-Suchvolumen, da sie direkt von Google selbst stammen. Es ist kein Geheimnis, dass die meisten SEO Tools ihr Keyword-Suchvolumen aus dem GKP beziehen.Aber wie genau sind die Zahlen zum Suchvolumen in GKP?Nun, es gibt eine Datenquelle, die allgemein als “einzige Quelle der Wahrheit” gilt, wenn es um das Suchvolumen geht: Die Google Search Console.Wenn deine Website bei Google für ein bestimmtes Keyword immer ganz oben rankt, ist die Anzahl der “Impressionen”, die deine Seite für dieses Keyword erhält, das tatsächliche Suchvolumen.Das bedeutet, dass wir die Genauigkeit der Suchvolumina in der GKP leicht untersuchen können, wenn wir die Suchvolumina mit den tatsächlichen Impressionen für dieselben Keywords aus der GSC vergleichen.Und genau das haben wir in unserem jüngsten Experiment getan. Es stellte sich heraus, dass die Suchvolumina in GKP in nur 45 % der Fälle “ungefähr richtig” waren. In den übrigen Fällen wichen die GKP-Suchvolumina ziemlich stark von den GSC-Impressionen ab.Mit anderen Worten: Es ist ziemlich weit hergeholt, die Suchvolumina in GKP als “genau” zu bezeichnen. Und wir können GKP nicht einmal dafür kritisieren, denn es ist ein Tool für Werbetreibende, nicht für SEOs. GKP neigt dazu, Suchanfragen mit ähnlicher Bedeutung in einer Gruppe zusammenzufassen, ohne die Möglichkeit, für jede dieser Anfragen ein eigenes Suchvolumen zu sehen. Das ist für Werbetreibende recht praktisch, kann aber für SEOs ein echtes Problem darstellen.Die folgenden sechs Keywords werden zum Beispiel alle zu einer Gruppe zusammengefasst:pc spiele kostenlos herunterladenkostenloser Download von PC-Spielenkostenlose Spiele für den PC herunterladenkostenlose Spiele für den PC herunterladenkostenlose PC-Spiele-DownloadsPC-Spiele kostenlos herunterladenkostenlose spiele zum download für den pcDie meisten SEO Tools imitieren dieses Verhalten, weil sie (angeblich) das Suchvolumen von GKP übernehmen. Sie zeigen also für jede dieser Keyword-Varianten das gleiche Suchvolumen an.Wir bei Ahrefs mischen jedoch einige andere Datenquellen in unsere Schätzungen des Suchvolumens ein (einschließlich einiger Jahre historischer Clickstream-Daten), wodurch wir viele dieser Keyword-Cluster “entgruppieren” und für jedes einzelne Keyword ein eigenes Suchvolumen anzeigen können:Durch diese Entgruppierung sind die Suchvolumen von Ahrefs etwas genauer als die von GKP. Trotzdem sind unsere Suchvolumina immer noch nur Schätzungen und keine exakten Werte, die viele unserer Nutzer gerne sehen würden.5. Höheres Keyword-Suchvolumen ≠ mehr TrafficDas Keyword-Suchvolumen dient in erster Linie dazu, den potenziellen Such-Traffic abzuschätzen, den deine Seite bekommen kann, wenn sie für das Keyword gerankt ist, oder?Schauen wir uns die folgenden zwei Keywords an:Wenn wir ihr globales (d.h. weltweites) Suchvolumen vergleichen, scheint das Keyword “Lokale SEO” 27 Mal beliebter zu sein als das Keyword “Website bei Suchmaschinen anmelden”.Bedeutet das also, dass die Seite, die auf Platz 1 für “Lokale Suchmaschinenoptimierung” rangiert, deutlich mehr Such-Traffic erhält als die Seite, die auf Platz 1 für “Website bei Suchmaschinen anmelden” rangiert? Lass uns das mit dem Site Explorer von Ahrefs überprüfen:Es stellt sich heraus, dass unsere Annahme völlig falsch ist. Die am besten rankende Seite für ein 27-mal weniger beliebtes Keyword scheint doppelt so viel Such-Traffic zu bekommen.Wie kommt das?Nun, das kommt daher, dass Seiten nicht nur für ein einziges Keyword ranken. Wenn du dir die beiden Screenshots oben genau ansiehst, wirst du sehen, dass die am besten rankende Seite für “Lokale SEO” für 311 Keywords in Google rankt (sieh dir die Kachel “Organische Keywords” an), von denen acht auf den ersten 3 Plätzen ranken.Die Seite Nr. 1 für “Website bei Suchmaschinen anmelden” ist in Google für insgesamt 1.400 Keywords gerankt, von denen 201 auf den ersten 3 Plätzen rangieren.Hier sind einige dieser Keywords:Welche Suchanfrage du auch immer im Kopf hast, verschiedene Menschen werden sie anders formulieren. Aber Google ist klug genug, um zu verstehen, dass all diese Menschen im Grunde nach dem Gleichen suchen. Deshalb rankt es die gleiche Seite für alle diese Suchanfragen.Wir haben dieses “Phänomen” damals untersucht und herausgefunden, dass die durchschnittlich am besten rankende Seite auch für etwa tausend ähnliche Keywords rankt.Das bedeutet, dass du dich nicht blind auf das Suchvolumen einzelner Keywords verlassen kannst, wenn du ihr Such-Traffic-Potenzial abschätzen willst. Stattdessen musst du die am besten rankenden Seiten daraufhin untersuchen, wie viel Such-Traffic sie insgesamt von allen Keywords erhalten, für die sie gerankt sind.Wir bei Ahrefs haben uns so sehr in dieses Konzept verliebt, dass wir eine einzigartige Kennzahl namens Traffic-Potenzial entwickelt haben:Für jedes Keyword, das du im Keywords Explorer siehst, ermitteln wir die am besten rankende Seite und sehen nach, wie viel Such-Traffic sie insgesamt von allen Keyword-Varianten erhält, für die sie in Google gerankt ist. Dieser Wert ist das Traffic-Potenzial des Keywords.Das Content-Marketing-Team von Ahrefs macht das schon seit einigen Jahren manuell, und es hat uns bei der Auswahl der richtigen Themen sehr geholfen. Aber jetzt ist diese Metrik endlich in den Keywords Explorer aufgenommen worden, damit jeder sie nutzen kann.FazitDas sind also die fünf wichtigsten Dinge, die SEO-Neulinge oft übersehen, wenn sie sich mit der Keyword-Suchvolumen-Metrik beschäftigen.Mit diesem Wissen wirst du die Suchvolumen-Metrik sicher nicht mehr für bare Münze nehmen, was die Qualität deiner SEO-Entscheidungen erheblich verbessern dürfte.Und eine letzte Sache möchte ich noch erwähnen. Es scheint ein bisschen zu offensichtlich, um es in den Hauptteil dieses Beitrags zu schreiben, aber ohne es wäre er irgendwie unvollständig:Wähle Keywords niemals nur nach ihrem Suchvolumen aus.Bei der Keyword-Recherche geht es um viel mehr als nur darum, die Keywords mit dem größten Suchvolumen zu finden.Hier sind einige weitere Fragen, die du beachten solltest: Würde dieses Keyword meinem Unternehmen einen Nutzen bringen?Würde dieses Keyword zu Verkäufen führen?Wäre ich in der Lage, die am besten rankenden Seiten für dieses Keyword zu schlagen?Was wäre nötig, um für dieses Keyword zu ranken?Behalte diese Fragen immer im Hinterkopf, wenn du dich für ein bestimmtes Keyword entscheidest. Article PerformanceData from AhrefsVerlinkung von Websites 2 Sign up for AhrefsGet SEO metrics of any website or URL.The number of websites linking to this post.This post's estimated monthly organic search traffic.Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Tim Soulo Tim ist CMO und Produktberater bei Ahrefs. Vor allem aber ist er der größte Fan und der wahrste Missionar des Unternehmens. Erfahren Sie mehr über Tim",
  "headers": [
    {
      "level": "H1",
      "text": "Keyword-Suchvolumen: 5 Dinge, die du wissen musst, um SEO-Fehler zu vermeiden"
    },
    {
      "level": "H2",
      "text": "Was ist das Keyword-Suchvolumen?"
    },
    {
      "level": "H2",
      "text": "1. Suchvolumenzahlen sind jährliche Durchschnittswerte"
    },
    {
      "level": "H2",
      "text": "2. Nicht alle Suchanfragen führen zu Klicks"
    },
    {
      "level": "H2",
      "text": "3. Werbetreibende könnten deine Klicks klauen"
    },
    {
      "level": "H2",
      "text": "4. Das Suchvolumen ist nicht sehr genau"
    },
    {
      "level": "H2",
      "text": "5. Höheres Keyword-Suchvolumen ≠ mehr Traffic"
    },
    {
      "level": "H2",
      "text": "Fazit"
    }
  ],
  "author": "Tim Soulo"
}