{
  "url": "https://ahrefs.com/blog/de/kostenlose-online-marketing-kurse/",
  "slug": "kostenlose-online-marketing-kurse",
  "title": "17 kostenlose Online-Kurse für digitales Marketing",
  "description": "Wir haben mehr als 100 kostenlose Kurse für digitales Marketing ausprobiert. Hier sind 17, die uns überzeugt haben.",
  "content": "Rebecca Liew Content Marketer und Autorin. Süchtig nach Worten, Briefpapier und dem Erkunden neuer Orte zu Fuß. Inhalt Wir haben Twitter-Nutzer gebeten, ihre kostenlosen Lieblings-Kurse für digitales Marketing zu empfehlen und über hundert Antworten erhalten.Is there a good FREE digital marketing course that you can recommend?— Tim Soulo 🇺🇦 (@timsoulo) August 17, 2021Die Kurse von Googles Digital Garage, der HubSpot Academy und der Ahrefs Academy erhielten alle ein positives Zeugnis. Doch welche gibt es noch?Um meine Suche einzugrenzen, habe ich auf Folgendes geachtet:Die Lehrenden hinter den KursenBewertungen und RezensionenDas von den Teilnehmern erwartete Erfahrungsniveau (Anfänger, Fortgeschrittene, Experten)Relevanz des Kursmaterials für die heutige MarketinglandschaftDiese kostenlosen Kurse für digitales Marketing kamen in die engere Wahl:How to Use TikTok for Business von Later.comContext is Key: Social Media Strategy in a Noisy Online WorldInstagram for Business: Build an Engaged Community Blogging for Business von AhrefsSEO Training Course von AhrefsDigital Skills: Digital Marketing von AccentureContent Marketing Certification Course von HubSpotIntroduction to Social Media Advertising von BufferDigital & Social von Twitter Flight SchoolGoogle Ads von SkillshopSEO Training Course von HubSpotHow to Use Instagram Stories (IGS) for Business von Later.comMicrosoft Advertising CertificationE‑Mail Marketing Certification von HubSpotPPC University von WordstreamGoogle Primer: Marketing & MeasurementGoogle Digital Garage: Fundamentals of Digital MarketingBonus: LearningSEO1. How to Use TikTok for Business von Later.comLehrender: Taylor Loren Thema: Social Media Marketing Level: Anfänger Zertifizierung: Keine Dauer: 35 min Verfügbar bei: Later.comTaylor Loren, die ehemalige Content Marketing Director bei Later, leitet diesen kurzen Online-Kurs, der vor allem von ihren Erfahrungen auf der beliebten Social-Media-Plattform geprägt ist. Sie hat mehr als 26.000 Follower auf TikTok und verrät dir nützliche Tipps, die du vielleicht noch nicht wusstest, z. B. dass die Verwendung von trendigen Audioclips oder Videobearbeitungseffekten deine Chancen erhöht, auf der For You-Seite zu landen.Einige Hinweise: Die 35-minütige Videolektion ist im Wesentlichen eine Einführung in die Welt von TikTok Business für absolute Neulinge. Da ich die Kurzvideoplattform selbst nutze, habe ich festgestellt, dass sie ohnehin recht intuitiv ist. Dennoch sind Taylors Tipps besonders hilfreich, wenn du den Algorithmus voll ausnutzen willst, um deine Reichweite durch auffällige Inhalte und TikTok-Anzeigen zu erhöhen. 2. Context is Key: Social Media Strategy in a Noisy Online WorldLehrender: Gary Vaynerchuk Thema: Social Media Marketing Level: Anfänger Zertifizierung: Keine Dauer: 1h 31min Verfügbar bei: SkillshareGary Vaynerchuk ist CEO und Mitbegründer der digitalen Social-Media-Agentur Vaynermedia, und seine 2,4 Millionen Follower auf Twitter zeugen von seinem Erfolg. Kein Wunder also, dass über 50.000 Teilnehmer/innen diesen Skillshare-Kurs absolviert haben, von denen 81 % angaben, dass er ihre Erwartungen übertroffen oder erfüllt hat.In 23 Videolektionen geht es in diesem Kurs darum, wie man maßgeschneiderte Strategien für Social-Media-Plattformen wie Twitter, Facebook und Instagram entwickelt und Tipps zum Aufbau einer soliden Markendarstellung gibt. Auch wenn wir denken, dass die Fallstudien zu Pinterest und Tumblr heute nicht mehr besonders relevant sind, ist dieser Kurs dennoch einen Versuch wert. Du lernst einige Taktiken, mit denen Gary große Marken wie General Electric und PepsiCo wachsen ließ. Es gibt auch ein optionales Projekt, bei dem du eine kanalbezogene Social-Media-Strategie für eine Marke deiner Wahl entwickeln sollst, das aber eher der Übung dient, da es nicht benotet wird.Nebenbei bemerkt.Nebenbei bemerkt: Dieser Kurs ist mit einer Skillshare-Testversion kostenlos.3. Instagram for Business: Build an Engaged CommunityLehrender: Tyler McCall Thema: Social Media Marketing Level: Anfänger Zertifizierung: Keine Dauer: 1h 31min Verfügbar bei: SkillshareAls freiberuflicher Instagram-Marketingstratege kennt sich Tyler McCall bestens mit der Plattform aus.In diesem Kurs mit 13 Lektionen lädt er Marketer und Unternehmer dazu ein, die Grundlagen für den Aufbau einer engagierten Community zu überdenken. Obwohl der Kurs in Zusammenarbeit mit Iconosquare entwickelt wurde, musst du das Social Media Analytics Tool nicht nutzen, um den Lektionen zu folgen. Tyler zeigt dir nicht nur, wie du deine Zielgruppe definierst und die richtigen Ziele festlegst, sondern auch, wie du aufmerksamkeitsstarkes Bildmaterial gestaltest, den Erfolg mit Iconosquare misst und Kommentare und Hashtags nutzt, um eine Community aufzubauen. Als Bonus gibt es eine Lektion, wie du Instagram Stories nutzen kannst, um Follower auf deine Website oder deinen Newsletter zu locken, sowie Arbeitsblätter für eine optionale praktische Aufgabe. Über 22.000 Schüler haben den Kurs abgeschlossen. Und von denen, die ihn bewertet haben, gaben 96 % an, dass er ihre Erwartungen übertroffen oder erfüllt hat. Tyler lässt sich nicht lumpen: Er hat fast 50.000 Follower auf Instagram.Nebenbei bemerkt.Nebenbei bemerkt: Dieser Kurs ist mit einer Skillshare-Testversion kostenlos.4. Blogging for Business von AhrefsLehrender: Tim Soulo Thema: Content Marketing Level: Anfänger Zertifizierung: Keine Dauer: 4h 50min Verfügbar bei: Ahrefs AcademyWie haben wir es geschafft, dass der Ahrefs-Blog monatlich hunderttausende von Besuchern hat? Genau das soll dieser Kurs den Zuschauern vermitteln. Er ist Teil der Ahrefs Academy, unserer Online-Schule mit vier detaillierten Kursen, die dir helfen, dich als Content-Marketer mit dem Ahrefs-Toolset zu verbessern. Blogging for Business wird von Tim Soulo, CMO von Ahrefs, geleitet und besteht aus 11 Modulen und 40 Lektionen. Dazu gehören Grundlagenvideos, z. B. über die wichtigsten Kanäle zur Kundengewinnung und Wachstumsstrategien, Tipps zur Ideenfindung sowie Tipps zur Optimierung und Förderung deiner Inhalte für weiteres Wachstum. Außerdem gibt es Bonusvideos, darunter ein ausführliches Gespräch mit Noah Kagan, der der Kopf hinter der Daily-Deal-Plattform Appsumo ist. Das Beste daran: Für diesen kostenlosen Kurs brauchst du dich nicht anzumelden. 5. SEO Training Course von AhrefsLehrender: Sam Oh Thema: Suchmaschinenoptimierung(SEO) Level: Anfänger Zertifizierung: Keine Dauer: 2h Verfügbar bei: Ahrefs AcademyDieser Kurs vermittelt dir ein grundlegendes Verständnis für die Anwendung der SEO-Grundlagen, einschließlich Keyword-Recherche, On-Page-SEO und Linkbuilding-Strategien, die dir helfen, in Suchmaschinen besser zu ranken. Der Kurs ist in vier Module unterteilt, die sich über 14 Lektionen erstrecken, und orientiert sich daran, wie Ahrefs durch SEO Wachstum erzielt hat. Am Ende des Kurses wird ein Blick auf die Bedeutung der technischen SEO und die besten Praktiken geworfen, die du kennen solltest. 6. Digital Skills: Digital Marketing von AccentureCreator: Harry Hurst Mentoren: Saikat Sengupta, Rita Bruni Thema: Digital Marketing Level: Anfänger Zertifizierung: Ja Dauer: ~ 4 Stunden Verfügbar bei: Futurelearn.comBist du neugierig auf die verschiedenen digitalen Marketingstrategien, mit denen du dein Unternehmen oder deine Karriere voranbringen kannst? Dieser Einführungskurs kann dich in die richtige Richtung lenken. Mehr als 200.000 Teilnehmer haben den hoch bewerteten Kurs bereits absolviert und damit den Beweis angetreten, dass es sich lohnt. In etwa zwei Wochen behandelt der Videokurs mit 19 Lektionen die Grundlagen von:Digitales MarketingDisplay- und PPC-WerbungSEOE‑Mail-MarketingIn den abschließenden Lektionen lernst du dann, wie du diese Techniken in deiner Arbeit anwenden kannst. Dieser Grundkurs beinhaltet Tests, um dein Wissen zu überprüfen, sowie ein PDF-Zertifikat (akkreditiert vom CDP Certification Service) nach Abschluss. 7. Content Marketing Certification Course von HubSpotCreators: Justin Champion, Guillaume Delloue, Abigael Donahue, AJ Beltis, Matthew Howells-Barby, Corey Braccialini, Lindsay Thibeault Thema: Content Marketing Level: Anfänger Zertifizierung: Ja Dauer: 6.2h Verfügbar bei: HubSpot AcademyDieser Kurs wurde in Tims Twitter-Thread mehrfach genannt. Um Zugang zum kostenlosen Content-Marketing-Kurs zu erhalten, musst du dir ein HubSpot-Konto einrichten. Aber das ist deine Zeit wert. Ich habe das in wenigen Minuten erledigt, indem ich mein Google-Konto verknüpft und ein paar einfache Fragen beantwortet habe.Der Kurs beginnt mit einer Einführung in die Grundlagen des Content Marketings und Tipps zum Storytelling, gefolgt von 12 Lektionen zur Entwicklung eines Rahmens für die Erstellung von Inhalten und zur Messung der Wirksamkeit deiner Inhalte. Der Kurs wird von verschiedenen Branchenexperten geleitet, von denen die meisten aus dem Marketingteam von HubSpot stammen, und enthält mehrere Quizfragen, um dein Wissen über die behandelten Themen zu testen. Am Ende des Kurses kannst du eine dreistündige Prüfung ablegen, die 60 Multiple-Choice-Fragen umfasst, die du mit 45/60 Punkten bestehen musst. 8. Introduction to Social Media Advertising von BufferLehrender: Brian Peters Thema: Social Media Advertising Level: Anfänger Zertifizierung: Keine Dauer: 53min Verfügbar bei: SkillshareBrian Peters, ehemaliger Digital- und Social-Media-Manager bei Buffer, zeigt Anfängern das Potenzial von bezahlter sozialer Werbung und wie man eine Social-Media-Kampagne von Grund auf erstellt. Der Kurs mit 10 Lektionen behandelt die wichtigsten Begriffe, den Marketing-Trichter, die Festlegung von Zielen und Budgets und die Optimierung von Kampagnen für langfristigen Erfolg.Mehr als 21.500 Schüler/innen haben den Kurs bisher absolviert, und fast 50 % der Bewertungen geben an, dass der Kurs die Erwartungen übertroffen hat — dank Brians einnehmendem Unterricht und den hilfreichen Beispielen.Nebenbei bemerkt.Nebenbei bemerkt: Dieser Kurs ist mit einer Skillshare-Testversion kostenlos.9. Digital & Social von Twitter Flight SchoolLehrender: N/A Thema: Social Media Advertising Level: Fortgeschrittene Zertifizierung: Ja (nur für den Twitter Video Badge Kurs) Dauer: 5.2h Verfügbar bei: Twitter Flight SchoolWolltest du schon immer wissen, wie du Twitter als Werbeplattform nutzen kannst? Dieser Kurs zeigt dir anhand von 13 Modulen, die in leicht verdauliche Artikel unterteilt sind und jeweils mit einem Multiple-Choice-Wissenstest abgeschlossen werden. Da sich dieser Kurs an erfahrene Growth Marketer richtet, reichen die behandelten Themen von einer Einführung in den Twitter Ads Manager bis hin zum Starten und Messen der Erfolgsraten von Kampagnen auf mobilen Apps und Websites.Wir bevorzugen zwar generell Videolektionen, aber wenn du die Informationen in kurzen Artikeln findest, kannst du die behandelten Punkte schneller überprüfen. Um loszulegen, logge dich in deinen Twitter-Account ein, und schon bist du startklar. Wenn dein größeres Ziel darin besteht, ein Abzeichen zu erhalten, das du auf deinen Twitter- und LinkedIn-Profilen anzeigen kannst, solltest du stattdessen den #TwitterFlightSchool Video Badge-Kurs ausprobieren. Er behandelt Videoanzeigen auf der Social Media Plattform. 10. Google Ads von SkillshopLehrender: N/A Thema: Suchmaschinenmarketing (SEM) Level: Anfänger bis Fortgeschrittene Zertifizierung: Ja (Google Ads Zertifikat) Dauer: Abhängig von deinem Engagement Verfügbar bei: SkillshopSkillshop by Google ist eine Art Online-Akademie, die Kurse für einige der wichtigsten Tools von Google anbietet, darunter: Google AdsAnalytics AcademyGoogle Ad Manager Google Marketing PlatformGoogle My BusinessObwohl Google Ads sich selbst als ideal für Anfänger/innen bezeichnet, gehen wir davon aus, dass du zumindest ein paar Grundkenntnisse in SEM brauchst, um den Lektionen folgen zu können. Sie sind ähnlich aufgebaut wie die Kurse der Twitter Flight School, nur mit mehr Tiefe. Beginne mit einer Selbsteinschätzung und hake dann die einzelnen Themen ab, von denen einige optionale Videos enthalten, um dein Wissen zu vertiefen. Wir finden es gut, dass das Lernen im eigenen Tempo abläuft. Aber sei gewarnt: Die schiere Anzahl an Kursen (und Themen) könnte dich überwältigen, also nimm dir Zeit, die Lektionen durchzusehen, bevor du dich auf ein Thema festlegst. 11. SEO Training Course von HubSpotLehrende: Rachel Sheldon Thema: SEO Level: Anfänger bis Fortgeschrittene Zertifizierung: Ja Dauer: 2h 21min Verfügbar bei: HubSpotUnter der Leitung von Rachel Sheldon, einer Inbound-Professorin an der HubSpot Academy, werden in diesem Einführungskurs in SEO alle Grundlagen behandelt, die du erwarten würdest. Dazu gehören Website-Optimierung, On-Page- und technische SEO sowie Keyword-Recherche. Außerdem gibt es Arbeitsblätter und Quizfragen mit drei Fragen, gefolgt von einer dreistündigen Prüfung, in der du dein Wissen testen kannst.Wie bei den anderen HubSpot Academy-Kursen in dieser Liste erhältst du ein Zertifikat, wenn du mindestens 45/60 Punkte erreichst.12. How to Use Instagram Stories (IGS) for Business von Later.comLehrende: Lexie Carbone, Taylor Loren Thema: Social Media Marketing Level: Anfänger Zertifizierung: Keine Dauer: ~60 min Verfügbar bei: Later.comTaylor, der auch in dem oben genannten Kurs über die Nutzung von TikTok für Unternehmen zu sehen ist, leitet diesen einstündigen Kurs zusammen mit Lexie Carbone, Marketing Campaign Manager bei Later. Obwohl dieser Kurs 2019 entwickelt wurde, sind die Inhalte immer noch aktuell, denn die meisten Videos wurden durch eine Reihe von 11 Artikeln ersetzt. In diesen erfährst du, wie du IGS nutzen kannst, um dein Unternehmen auf der Social Media Plattform zu vergrößern. Der Kurs ist in drei Bereiche unterteilt: Design, Wachstum und Strategie, die alle eine entscheidende Rolle dabei spielen, das Interesse der Instagram-Nutzer/innen zu wecken und zu erhalten. Die Lektionen erklären die IGS-Analysen und wie du die einzelnen Metriken nutzen kannst, um deine Stories-Strategie zu verbessern.13. Microsoft Advertising CertificationLehrende: N/A Thema: SEM Level: Fortgeschrittene Zertifizierung: Ja (Microsoft Advertising Certified Professional Abzeichen und Zertifikat zum Ausdrucken) Dauer: Abhängig von deinem Engagement Verfügbar bei: Microsoft.comIn diesem textlastigen Kurs, der einen 230-seitigen Lernleitfaden enthält, wirst du mehr lesen als sehen. Trotzdem lohnt sich die Zeit, wenn du das Abzeichen auf deinen Social Media-Plattformen, einschließlich LinkedIn, verwenden willst. Der kostenlose Download enthält eine Checkliste mit den Themen der Akkreditierung. Darunter:Die Grundlagen von Microsoft Advertising und wie Pay-per-Click-Werbung funktioniertPPC-Gebote, Traffic-Schätzungen und Cost-per-Click-StrategienBudgetierung und AbrechnungLinkedIn-Profil-TargetingUm die Monotonie des reinen Textes zu vermeiden, wird der Lernleitfaden mit Screenshots von Bing-Anzeigen sowie Diagrammen von fiktiven Fallstudien ergänzt.14. E‑Mail Marketing Certification von HubSpotLehrende: Courtney Sembler Thema: E‑Mail Marketing Level: Anfänger bis Fortgeschrittene Zertifzierung: Ja Dauer: 3h 18min Verfügbar bei: Later.comFade, unpersönliche E‑Mails sind überholt und ineffektiv. Warum verlassen sich die Menschen dann immer noch auf sie? Dieser Kurs fordert dich anhand von neun Themen und 28 Videos mit Quizfragen dazu auf, deine Taktiken im E‑Mail-Marketing zu überdenken. Unter der Leitung von Courtney Sembler, Senior Managerin bei HubSpot, lernst du, wie du deine Texte “vermenschlichst”, Beziehungen durch Lead Nurturing aufbaust und diese Erkenntnisse mit dem kostenlosen E‑Mail Marketing Tool des Softwareunternehmens umsetzt. Wie bei allen HubSpot-Kursen hast du drei Stunden Zeit, um am Ende eine Prüfung mit 60 Fragen zu absolvieren und dir ein E‑Mail-Marketing-Zertifikat zu sichern.15. PPC University von WordstreamLehrender: N/A Thema: SEM Level: Anfänger Zertifizierung: Keine Dauer: Abhängig von deinem Engagement Verfügbar bei: WordstreamNeugierig auf das PPC-Modell? Dann lass dich von Wordstream führen. Die PPC University von Wordstream bietet drei geführte Kurse an, die dir das Wissen vermitteln, um Keywords zu recherchieren, an Google AdWords-Auktionen teilzunehmen und deine Google Ads-Kampagnen zu optimieren.Als Anfänger finde ich PPC 101 sehr hilfreich: Es gibt 11 Artikel, in denen die Grundlagen wie Klickraten und Kosten pro Aktion erklärt werden, sowie eine Schritt-für-Schritt-Anleitung zum Einrichten deines Google Ads-Kontos. Wenn du mehr in die Tiefe gehen möchtest, kannst du auch den 32-seitigen PPC 101 Leitfaden nutzen, den du nach der Anmeldung kostenlos herunterladen kannst.16. Google Primer: Marketing & MeasurementLehrender: N/A Thema: Marketing (allgemein) Level: Anfänger bis Fortgeschrittene Zertifizierung: Keine Dauer: N/A Verfügbar bei: YourPrimer.comGoogle Primer ist eine kostenlose App für Unternehmer und Marketingfachleute mit fünfminütigen Lektionen zu den Themen digitales Marketing, Messung, soziale Medien, Analysen und mehr.Es gibt drei Hauptbereiche für deine Auswahl: Business & Operations, Brand & Identity und Marketing & Measurement. Letzterer ist mit 10 übergreifenden Themen sowohl für Anfänger als auch für erfahrene Marketingexperten besonders gut abgerundet und relevant. Zu den interessanten Lektionen gehören Crowdsourcing für Nutzertests, die optimale Nutzung einer Kreativagentur und das Erreichen der richtigen Zielgruppe durch eine App-Kampagne. Nur wenige Kurse bieten Lektionen für unterwegs in einem so leicht verdaulichen Format wie Google Primer, daher können wir es nur empfehlen. 17. Google Digital Garage: Fundamentals of Digital MarketingLehrende: N/A Thema: Marketing (allgemein) Level: Anfänger Zertifizierung: Ja Dauer: 40h Verfügbar bei: Google Digital Garage>Wenn du tief in die Grundlagen des digitalen Marketings eintauchen willst, dann beginne mit diesem Kurs, der vom Interactive Advertising Bureau Europe und der Open University anerkannt ist. Du erhältst eine Einführung in die Digital Garage und lernst in 26 Modulen, wie du deine Online-Geschäftsstrategie aufbaust und ausbaust. Der Kurs befasst sich auch mit SEO und SEM, mobiler Werbung und sogar mit dem Aufbau eines E‑Commerce-Geschäfts.Wenn man bedenkt, wie viel du lernen wirst, ist ein 40-stündiger Kurs wirklich keine große Verpflichtung — vor allem, wenn du dir dein Tempo selbst einteilen kannst, während du von Video-Tutorials und praktischen Übungen angeleitet wirst. Um deine Zertifizierung zu erhalten, die du auf LinkedIn und in deinem Lebenslauf verwenden kannst, musst du die abschließende Prüfung mit 40 Fragen bestehen. Google Digital Garage war auch eine der häufigsten Erwähnungen in unserem Twitter-Thread, wenn wir das hinzufügen dürfen.18. Bonus: LearningSEOLearningSEO ist kein Kurs im eigentlichen Sinne. Vielmehr ist es eine umfangreiche (und regelmäßig aktualisierte) Sammlung von Ressourcen für alle, die ihr SEO-Wissen erweitern wollen. Mir gefällt, wie detailliert und gut organisiert sie ist: Es gibt externe Leitfäden, Kurse und Videos, die nach deinem Erfahrungsstand kategorisiert sind. Es werden SEO-Grundlagen behandelt (Messung und Reporting von SEO) und sogar die technischen Details der Crawl-Budget-Optimierung und der Erstellung von SEO-Verträgen.Du kannst sogar eine (gemeinsam nutzbare) Kopie der SEO-Liste erstellen, die mit Checkboxen in einem farblich gekennzeichneten Arbeitsblatt versehen ist.FazitEinen Kurs zu absolvieren erfordert Engagement (ich muss es wissen!). Wenn du dich also überfordert fühlst, überlege zuerst, was dich begeistert. Wenn es Content Marketing ist, fang dort an. Gehe dann zu den technischeren Bereichen über, in denen du dich verbessern möchtest, z. B. die Entwicklung und Messung von Werbekampagnen. Alle hier vorgestellten Kurse kannst du im Selbststudium absolvieren, also nimm dir die Zeit, die du brauchst, um jedes Thema vollständig zu verstehen. Eine solide Grundlage ist der Schlüssel, um im digitalen Marketing besser zu werden. Hast du noch Fragen? Schreib mir auf Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Rebecca Liew Content Marketer und Autorin. Süchtig nach Worten, Briefpapier und dem Erkunden neuer Orte zu Fuß.",
  "headers": [
    {
      "level": "H1",
      "text": "17 kostenlose Online-Kurse für digitales Marketing"
    },
    {
      "level": "H2",
      "text": "1. How to Use TikTok for Business von Later.com"
    },
    {
      "level": "H2",
      "text": "2. Context is Key: Social Media Strategy in a Noisy Online World"
    },
    {
      "level": "H2",
      "text": "3. Instagram for Business: Build an Engaged Community"
    },
    {
      "level": "H2",
      "text": "4. Blogging for Business von Ahrefs"
    },
    {
      "level": "H2",
      "text": "5. SEO Training Course von Ahrefs"
    },
    {
      "level": "H2",
      "text": "6. Digital Skills: Digital Marketing von Accenture"
    },
    {
      "level": "H2",
      "text": "7. Content Marketing Certification Course von HubSpot"
    },
    {
      "level": "H2",
      "text": "8. Introduction to Social Media Advertising von Buffer"
    },
    {
      "level": "H2",
      "text": "9. Digital & Social von Twitter Flight School"
    },
    {
      "level": "H2",
      "text": "10. Google Ads von Skillshop"
    },
    {
      "level": "H2",
      "text": "11. SEO Training Course von HubSpot"
    },
    {
      "level": "H2",
      "text": "12. How to Use Instagram Stories (IGS) for Business von Later.com"
    },
    {
      "level": "H2",
      "text": "13. Microsoft Advertising Certification"
    },
    {
      "level": "H2",
      "text": "14. E‑Mail Marketing Certification von HubSpot"
    },
    {
      "level": "H2",
      "text": "15. PPC University von Wordstream"
    },
    {
      "level": "H2",
      "text": "16. Google Primer: Marketing & Measurement"
    },
    {
      "level": "H2",
      "text": "17. Google Digital Garage: Fundamentals of Digital Marketing"
    },
    {
      "level": "H2",
      "text": "18. Bonus: LearningSEO"
    },
    {
      "level": "H2",
      "text": "Fazit"
    }
  ],
  "author": "Rebecca Liew"
}