{
  "url": "https://ahrefs.com/blog/de/kostenlose-seo-tools/",
  "slug": "kostenlose-seo-tools",
  "title": "Die 44 besten kostenlosen SEO-Tools (getestet und für gut befunden)",
  "description": "Dies ist eine Liste mit den 44 besten kostenlosen SEO-Tools auf diesem Planeten. Woher wir das wissen? Weil wir sie ausprobiert und getestet haben.",
  "content": "Si Quan Ong Marketing @ Ahrefs. Ich lese, mache Breakdance und versuche zufäliige Lebensexperimente. Inhalt Auf der Suche nach kostenlosen und nützlichen SEO-Tools? Dann kannst du deine Suche nun abschließen. Wir haben in unserer Facebook-Gruppe mehr als 10.000 SEO-Spezialisten und auf Twitter unsere 53.000 Followers nach ihren beliebtesten Tools gefragt.Wir haben dann jedes vorgeschlagene Tool ausprobiert und getestet, um die besten auszuwählen und sie dann zu kategorisieren.Falls du ein überschaubares Budget hast, sollte diese Liste sehr hilfreich für dich sein.Dies sind die Kategorien:Keyword Recherche-ToolsOnpage SEO-ToolsLinkbuilding-ToolsTechnische SEO-ToolsTools zur Überprüfung von RankingsAnalytics-ToolsLokale SEO-ToolsAndere ToolsKeyword Recherche-ToolsDiese Tools helfen dir Themen zu recherchieren, nach denen deine Zielgruppe sucht.1. Answer The PublicAnswer the Public stellt Fragen von Googles Autocomplete Ergebnissen zur Verfügung (und einigen anderen Arten von Suchanfragen). Dies ist sehr hilfreich, um Ideen zu bestimmten Inhalten zu generieren.Nebenbei bemerkt. Answer the Public ist ein Freemium Tool. Zwei Suchen am Tag sind kostenlos. Ähnliche Alternativen: Keyword Sheeter, Keywordtool.io2. Google Keyword PlannerGoogle Keyword Planner ist Googles Keyword Recherche-Tool. Nutze es, um Keyword-Ideen für bis zu zehn Begriffe oder Ideen basierend auf einer Website oder URL zu generieren.Obwohl der Keyword Planner einige Limitationen, wie das Fehlen von absolutem Suchvolumen hat, ist es hilfreich, um Keyword-Ideen zu finden, die du mit traditionellen Keyword Recherche-Tools nicht finden kannst.Nebenbei bemerkt. Falls du für die Bing Suche optimieren möchtest, denke daran, dass dafür ein eigenes Keyword Planner Tool existiert. Empfohlener Beitrag: Wie du Google Keyword Planner nutzt (ein praxisnaher Guide)3. Ahrefs Keyword GeneratorAhrefs Keyword Generator stellt die Top 100 Keyword Ideen für jeden Begriff oder jede Phrase aus unserer Datenbank von mehr als zehn Milliarden Keywords in 170+ Ländern zur Verfügung. Das Tool zeigt das geschätzte monatliche Suchvolumen für jeden Vorschlag und den Keyword Difficulty (KD) Score für die ersten zehn Ideen an.Du kannst auch die Top 50 Fragen zum Thema sehen.Nebenbei bemerkt. Der Keyword Generator kann auch Keyword Ideen für Bing, YouTube, und Amazon finden. 4. Google TrendsGoogle Trends zeigt die Popularität eines Themas über einen Zeitverlauf an. Nutze das Tool, um Themen, die im Trend sind, zu finden und vermeide die Erstellung von Inhalten für Themen mit abnehmendem Interesse.Empfohlener Beitrag: Wie du Google Trends für die Keyword Recherche nutzt: 7 effektive Möglichkeiten5. KeywordditKeyworddit stellt Keywords von Reddit zur Verfügung. Gebe ein Subreddit (z.B. /r/bigSEO) ein und das Tool generiert eine Keyword-Liste mit dem geschätzten monatlichen Suchvolumen.Dies ist hilfreich, um Themen zu finden, die deine Zielgruppe interessiert und die du selbst nicht auf dem Schirm hattest.Hier sind einige Keywords für den r/entrepreneur Subreddit:6. AlsoAsked.comAlsoAsked.com sammelt Daten von Googles People Also Ask (PAA) Boxen. Damit kannst du Unterthemen und Fragen finden, die es sich unter Umständen lohnt in einem Beitrag zu beantworten.Wenn du zum Beispiel einen Beitrag zum Thema “Wie du eine Kaffeemaschine mit Essig reinigst” verfasst, könnte es sinnvoll sein, die folgenden Fragen zu beantworten:Wieviel Essig sollte ich verwenden?Wie oft solltest du Essig durch die Kaffeemaschine laufen lassen?Ist Reinigungsessig besser als normaler Essig?7. Keyword SurferKeyword Surfer ist eine kostenlose Chrome Extension, die das geschätzte globale monatliche Suchvolumen für jede Suche in Google anzeigt. Dir werden auch ähnliche Keywords und verwandte Begriffe in der Sidebar angezeigt.Dies vereinfacht deine Keyword Recherche und Wettbewerbsanalyse, da du die Suchergebnisseite nicht verlassen musst.Onpage SEO-ToolsDiese Tools helfen dir, deine Seiten zu optimieren, damit du besser in den Suchergebnissen rankst.8. Rank MathRank Math ist ein WordPress SEO Plugin, welches für Onpage und technische SEO hilfreich ist.Hier sind einige Punkte, für die das Tool hilfreich sein kann:Hinzufügen von Titles, Meta Descriptions, OG Tags und anderen Meta Tags für Beiträge und SeitenHinzufügen von strukturierten Daten-Markups für die Rich SnippetsUmleitung von URLsAuffinden und Beheben von fehlerhaften Links auf deiner SeiteÄhnliche Alternativen: Yoast SEO, All in One SEO Pack, und The SEO Framework.9. SERPSimSERPSim zeigt dir, wie deine Webseite in Googles Suchergebnissen erscheint. Alles was du hierfür tun musst, ist deinen gewünschten Title, Meta Description und URL angeben.SERPSim zeigt auch an, wenn der Title oder die Meta Description zu lang sind. Du solltest diese Probleme beheben, um die Verkürzung deiner Angaben in den Suchergebnissen zu vermeiden.Ähnliche Alternative: Portents SERP Preview Tool10. Googles Rich Results TestGoogles Rich Results Testing Tool überprüft das strukturierte Markup auf deiner Seite danach, ob es für die Rich Snippets in den Suchergebnissen in Frage kommt.Empfohlener Beitrag: Rich Snippets: Was sind sie und wie kannst du sie nutzen?11. Merkles Schema Markup GeneratorMerkles Schema Markup Generator generiert strukturierte Daten-Markups im JSON-LD Format.Wähle einfach die Art des Schema Markups aus, die du generieren möchtest (z.B. Local Business, FAQ, Product, usw.), fülle das Formular aus und kopiere und füge das generierte Markup in deine Seite ein.Du kannst dann die Tauglichkeit jedes Schema Markups mit Google’s Structured Data Testing Tool überprüfen.Empfohlener Beitrag: Was sind strukturierte Daten? Und warum solltest du diese implementieren?12. Ahrefs SEO ToolbarBei der Ahrefs SEO Toolbar handelt es sich um eine Chrome und Firefox Extension, welche Ahrefs SEO Kennzahlen direkt im Browser anzeigt.Sie generiert auch einen Onpage-SEO Report für die besuchte Seite mit wichtigen Aspekten wie Seiten-Title, Meta Description, Wortanzahl, Headers, Hreflang Tags, Canonicals, OG Tags und mehr.Darüber hinaus ist die folgende Funktionalität vorhanden:Überprüfung zur Vermeidung von fehlerhaften LinksMacht Redirect-Ketten ausfindig (mit allen Redirect-Steps)Markierung von nofollow LinksAnzeige der Ahrefs SEO Kennzahlen in Googles SuchergebnissenUnd viele weitere Funktionen.Empfohlener Beitrag: Ahrefs SEO Toolbar — Was ist neu?Linkbuilding-ToolsDiese Tools helfen dabei, mehr Links für deine Seite zu generieren.13. Ahrefs Backlink CheckerAhrefs Backlink Checker zeigt die besten 100 Backlinks zu jeder Website oder Seite.Es zeigt auch die fünf häufigsten verlinkten Seiten, die gebräuchlichsten Anker-Texte, die Gesamtzahl an Backlinks und verweisenden Domains und unser geschütztes Domain Rating (DR) und URL Rating (UR).Es basiert auf derselben branchenführenden Datenbank wie unser Premium-Tool. Einige Kennzahlen sind:16 Billionen vorhandene Links170 Millionen eindeutige Domains7 Milliarden Seiten, die täglich gecrawlt werden14. Hunter.ioHunter.io findet E‑Mail Adressen, die mit einer Website assoziiert werden. Das Tool ist für bis zu 50 Anfragen im Monat kostenlos.Du kannst das Tool auch verwenden, um die E‑Mail Adresse für eine bestimmte Person zu finden. Gebe dazu lediglich den Domain-Namen und den Namen der Person an.Installiere die Chrome Extension für einfachen Zugriff auf das Tool oder nutze das Google Sheets Add-On.Ähnliche Alternativen: FindThat.Email, Voila NorbertEmpfohlener Beitrag: 8 umsetzbare Möglichkeiten, um jede E‑Mail Adresse zu recherchieren15. Ahrefs Broken Link CheckerAhrefs Broken Link Checker zeigt die Top zehn fehlerhaften eingehenden und externen Links für jede Domain, Subdomain oder URL an. Du kannst das Tool nutzen, um:Fehlerhafte Linkbuilding Möglichkeiten zu identifizierenFehlerhafte externe Links auf deiner Seite ausfindig zu machen, damit du diese beheben und die User Experience verbessern kannstFehlerhafte Seiten deiner Website zu identifizieren, um “Link Autorität” wiederzugewinnenFalls du Chrome Extensions bevorzugst, um fehlerhafte Links spontan zu überprüfen, kannst du hierfür LinkMiner oder Check My Links nutzen.16. ScraperScraper ist eine Chrome Extension, die dir erlaubt Daten von jeder Webseite zu ziehen. Das Tool kann für eine Vielzahl von Zwecken verwendet werden, wie z.B. das Scraping von möglichen Link-Kooperationspartnern von Googles Suchergebnisseiten.Empfohlener Beitrag: 6 praxisnahe Web Scraping Hacks für White Hat Vermarkter17. Help a Reporter (HARO)HARO ist ein kostenloser Service, der Nachrichten-Quellen mit Journalisten, die auf der Suche nach Fachwissen sind, verbindet.Dies funktioniert folgendermaßen: Journalisten haben Fragen. Sie benötigen Experten, um diese zu beantworten. HARO versendet E‑Mails mit diesen Fragen an Abonnenten. Jeder kann auf diese E‑Mails antworten und so unter Umständen eine Quelle für die Publikation werden.Egal ob du gerade eben erst eine Website aufgesetzt hast oder eine etablierte Website besitzt, es ist in jedem Fall eine gute Möglichkeit seriöse Links zu generieren.SourceBottle bietet einen ähnlichen Service an.Lerne in dem folgenden Video mehr darüber, wie du HARO effizient nutzt:https://youtu.be/73lj6m6Xulc?t=42918. StreakStreak ist eine freemium Chrome Extension, die dein Gmail Postfach in eine Kundenbeziehungsmanagement Software (CRM) verwandelt.Mit Streak kannst du unter anderem personalisierte Massen-E-Mails planen und versenden und sehen, wenn jemand deine E‑Mail geöffnet hat. Es ist ein großartiges Tool für Blogger Outreach.Technische SEO-ToolsDiese Tools helfen dabei die technischen Aspekte deiner Website zu verbessern.19. Google Search ConsoleGoogle Search Console (zuvor Google Webmaster Tools) ist ein kostenloser Service, der von Google bereitgestellt wird und dir hilft die Erscheinung deiner Website in Googles Suchergebnissen zu beobachten und zu verbessern.Nutze dieses Tool, um technische Fehler zu finden, Sitemaps einzureichen, Probleme mit strukturierten Daten zu identifizieren und für weitere Funktionen.Bing und Yandex haben ihre eigenen Versionen dieses Tools.Empfohlener Beitrag: Wie du Google Search Console nutzt und SEO verbesserst (ein Einsteiger-Guide)20. Screaming FrogScreaming Frog ist ein Desktop-basierter Website Crawler. Es ist eines der verbreitetsten Tools, um technische und Onpage SEO Probleme zu analysieren und zu überprüfen.Mit der kostenlosen Version kannst du bis zu 500 URLs crawlen.21. CloudflareCloudflare ist ein kostenloses globales CDN. Es kann nicht nur die Ladezeit deiner Seite verbessern, sondern diese auch vor schädlichen Attacken schützen.Empfohlener Beitrag: Was ist ein Content Delivery Network (CDN)? 22. GTMetrixGTMetrix analysiert die Ladezeit deiner Webseiten. Neben einem Performance-Score, werden auch umsetzbare Empfehlungen gegeben, damit Seiten schneller laden.Ähnliche Alternativen: Google PageSpeed Insights, Pingdom, WebPageTest.Empfohlener Beitrag: Wie du die Ladezeit deiner Website von Anfang bis Ende verbesserst (ein Guide für Fortgeschrittene)23. Googles Mobile-Friendly TestGoogles Mobile-Friendly Test überprüft wie einfach ein Besucher deine Seite auf einem Mobilgerät nutzt kann. Es identifiziert auch spezifische Probleme rund um die Nutzerfreundlichkeit auf Mobilgeräten, wie z.B. zu kleine Textgrößen, die Nutzung von nicht kompatiblen Plugins usw.Dank Googles Schritt zur Mobile-First Indexierung, ist eine responsive Website wichtiger denn je.24. SmushSmush ist ein kostenloses WordPress Plugin für die Komprimierung, Optimierung und Größenanpassung von Bildern. Nutze es, um eine schnelle Ladezeit deiner Webseiten zu gewährleisten.Beachte, dass Nutzer mit einem kostenlosen Zugriff nur jeweils 50 Bilder optimieren können. Du musst immer wieder den “Resume”-Button klicken, um die nächsten 50 Bilder zu optimieren.Ähnliche Alternative: Shortpixel (kostenlos für bis zu 200 Bildern im Monat)25. Where Goes?Where Goes? ist ein unkompliziertes Tool, um Redirect-Pfade für jede beliebige URL zu überprüfen.Füge eine URL in das Tool ein und es zeigt die Redirect-Art (z.B. 301, 302 usw.) und die Anzahl an Redirects in der Kette an. Du solltest die Anzahl an unnötigen Redirects so gering wie möglich halten, da es die Ladezeit deiner Website verlängert und zu einer schlechten User Experience führt.Obwohl Google bestätigt hat, dass 3xx Redirects nicht mehr zur Abschwächung des PageRanks führen, können zu viele Redirects zu einer Verschwendung von Crawl-Kapazitäten führen.Falls du nach einer SEO Chrome Extension mit gleicher Funktionalität suchst, kannst du Ahrefs SEO Toolbar nutzen.Empfohlener Beitrag: 301 Redirects für SEO: Alles was du wissen musst26. Robots.txt GeneratorDer Robots.txt Generator generiert eine korrekt formatierte robots.txt Datei in Sekunden.Nutzer mit speziellen Bedürfnissen können die benutzerdefinierte Option nutzen, um individuelle Regeln für verschieden Bots, Sub-Directories usw. zu definieren.Empfohlener Beitrag: Robots.txt und SEO: Alles was du wissen musst27. HEADMasterSEOHeadmasterSEO ist ein einfaches Tool um die Status-Codes für eine Liste an URLs gesammelt zu überprüfen. Die kostenlose Version ermöglicht die Überprüfung von bis zu 500 URLs.Wenn du eine web-basierte Anwendung bevorzugst und nur bis zu 100 URLs überprüfen möchtest, probiere HTTPstatus.io aus.28. Keep-alive Validation SEO ToolNutze dieses Tool, um zu überprüfen ob dauerhafte Verbindungen auf deinen Webseiten aktiviert oder deaktiviert sind.29. Chrome DevToolsDas Chrome DevTool ist Chromes integriertes Webseiten Fehlerbehebungs-Tool. Nutze es, um Probleme mit Ladezeiten zu beheben, Webseiten Rendering zu verbessern und weitere Aspekte zu überprüfen.Wenn es um technisches SEO geht, hat es endlose Funktionen.30. View Rendered SourceView Rendered Source ist eine Chrome Extension die zeigt, wie der Browser das ursprüngliche HTML der Seite in das DOM rendert, inklusive Modifikationen durch JavaScript.Es ist ein großartiges Tool, um Probleme mit JavaScript zu überprüfen und zu lösen.31. Hreflang Tag GeneratorGeneriere Hreflang Tags, um Sprache und geografisches Targeting einer Webseite festzulegen. Gebe dazu die entsprechenden URLs an, wähle dein gewünschtes Land und die Sprache aus und klicke auf “generate”.Empfohlener Beitrag: Hreflang: Der einfache Guide für AnfängerTools zur Überprüfung des RankingsDiese Tools helfen dir Rankings für deinen bevorzugten Standort zu überprüfen.32. Ahrefs SERP CheckerAhrefs SERP Checker zeigt die Top 10 Rankings für jedes Keyword in mehr als 170 Ländern.Für die ersten drei Suchergebnisse siehst du auch wichtige SEO Kennzahlen, wie die Anzahl an verweisenden Domains, die Anzahl an Backlinks, geschätzter Such-Traffic und mehr.33. Local Search Results CheckerBrightLocals Local Search Results Checker zeigt dir Suchergebnisse für jeden Ort — bis hin zum Groß‑, Kleinstadt und Postleitzahlen-Level.Abhängig vom Land kannst du sogar die gewünschte Sprache auswählen.Ähnliche Alternative: Valentin.app.34. Mobile SERP TestDas MobileMoxie SERPerator Tool erlaubt es dir, mobile Rankings für jeden beliebigen Ort zu überprüfen bis hin zur Adresse, Stadt, dem Bundesland oder der Postleitzahl.Du kannst sogar Mobilgerät-Modelle vergleichen, da einige SEO-Spezialisten glauben, dass Google unterschiedliche Ergebnisse für iOS und Android zeigen.Analytics-ToolsDiese Tools helfen Daten auf deiner Website zu messen und zu analysieren.35. Google AnalyticsGoogle Analytics ist wahrscheinlich das bekannteste Analytics-Tool. Es stellt dir eine Fülle an Daten zur Verfügung, welche du nutzen kannst, um jeden Aspekt deines Marketings zu verbessern.Bings Version hiervon ist Bing Webmaster Tools und Yandex hat ein eigenes Tool mit dem Namen Yandex Metrica.Empfohlener Beitrag: Wie du Google Analytics nutzt, um deine SEO Performance zu verbessern36. Keyword HeroKeyword Hero strebt danach die “(not provided)”-Daten innerhalb von Google Analytics mit echten Such-Keywords bereitzustellen.Die kostenlose Mitgliedschaft erlaubt es dir bis zu 10 URLs und 2000 Sessions im Monat zu analysieren.37. Google Data StudioMit Google Data Studio kannst du interaktive Dashboards und Berichte erstellen.Es ist in Googles Tool-Suite integriert, was es einfach macht Daten aus Google Search Console, Google Analytics, usw. zusammenzufassen.38. Ahrefs WordPress SEO PluginAhrefs WordPress SEO Plugin hilft dir Content-Audits durchzuführen und Backlinks im Auge zu behalten.Das Plugin kombiniert Daten aus unserem Backlink-Index und Google Analytics, um dir Empfehlungen zu geben, wie du deine Inhalte verbessern kannst und ist kostenlos.Empfohlener Artikel: Wie du eine Audit für deine Inhalte durchführt und deinen organischen Traffic steigerst [Vorlage inklusive]Lokale SEO-ToolsDiese Tools helfen dir besser in den lokalen Suchergebnissen zu ranken.39. Google My BusinessMit Google My Business kannst du steuern, wie dein Unternehmen in der Google Suche und auf Maps dargestellt wird.Dein GMB Profil zu übernehmen und zu optimieren ist vermutlich der wichtigste Aspekt, wenn es um lokale SEO geht. Eine Studie von Moz aus dem Jahr 2018 zufolge, ist ein GMB eines der wichtigsten lokalen Ranking-Faktoren sowohl für das “Snack Pack” als auch für die organische Suche.40. Whitesparks Google Business Review Link GeneratorWhitesparks Google Business Review Link Generator generiert einen Link, der mit Kunden geteilt werden kann, damit diese dein Unternehmen mit einem Klick bewerten können.Da es für lokale SEO wichtig ist, Bewertungen für dein Google My Business Profil zu erhalten, solltest du in Erwägung ziehen, diesen Link in deinen E‑Mails, auf Social Media und an anderen Stellen zu teilen, um den Bewertungsprozess so einfach wie möglich zu gestalten.41. Whitespark Local Citation FinderWhitesparks Local Citation Finder hilft dabei, NAP (Name, Address, Phone) Gelegenheiten für dein Unternehmen ausfindig zu machen.Laut einer Moz Studie von 2018, sind so genannte Citation-Signale wichtig für lokale Rankings.Andere ToolsDies sind die Tools, die thematisch nicht in die oben genannten Kategorien passen.42. AlgorooAlgoroo ist ein Tool, welches Google Algorithmen analysiert. Es ermöglicht dir Bewegungen in den Google Suchergebnissen nachzuvollziehen, welche ein Indikator für ein Google Algorithmus Update sein können.Ähnliche Alternativen: Ayima Pulse, Rank Risk Index43. Wayback MachineArchive.orgs Wayback Machine zeigt, wie Seiten in der Vergangenheit ausgesehen haben.Dies ist für eine Vielzahl an Aufgaben hilfreich. Wenn du z.B. Broken Linkbuilding betreibst, ist es hilfreich zu sehen, was ursprünglich auf der nicht mehr vorhanden Seite zu sehen war.44. Google AlertsGoogle Alerts ermöglicht es dir bei Erwähnungen deines Namens oder deines Unternehmens benachrichtigt zu werden. Du kannst das Tool auch nutzen, um Erwähnungen von Wettbewerbern zu verfolgen.Empfohlener Artikel: Wie du Google Alerts einrichtest (und nutzt um dein Unternehmen erfolgreicher zu machen) Hast du das Budget um in Premium SEO-Tools zu investieren?Beginne mit Ahrefs. Du kannst unser Angebot 7 Tage lang für $7USD testen.Hier ist ein kurzer Überblick über die wichtigsten Tools von Ahrefs:Site Explorer: Analysiere den organischen Such-Traffic und das Backlink-Profil einer beliebigen Website oder URL.Keywords Explorer: Recherchiere Keywords mit unsere Datenbank von mehr als 10 Milliarden Keywords.Content Explorer: Entdecke die beliebtesten Inhalte für jedes Thema.Rank Tracker: Verfolge Rankings für bis zu 10.000 Keywords für Desktop und Mobile.Site Audit: Überprüfe deine Website auf mehr als 100 SEO Probleme.Alerts: Werde über neue und verlorene Backlinks, Nennungen im Web und Keyword Rankings benachrichtigt.Abschließende GedankenIch hoffe dieser Beitrag hat klar gemacht, dass du mit kostenlosen SEO Tools viel erreichen kannst.Und vergesse Google nicht — das wohl leistungsfähigste kostenlose SEO Tool.Du kannst Google nutzen, um Möglichkeiten für Gastbeiträge zu recherchieren, um bedeutungsverwandte Keywords zu finden und für vieles mehr. Lerne in unserem ausführlichen Guide über Suchbefehle für Google mehr über einige sehr effektive Möglichkeiten Google für SEO zu nutzen.Haben wir irgendwelche hervorragende SEO Tools vergessen? Lass es mich auf Twitter wissen.Übersetzt von Heike Radlanski. Heike beschäftigt sich mit allen Aspekten des Online Marketing und Product Managements. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Si Quan Ong Marketing @ Ahrefs. Ich lese, mache Breakdance und versuche zufäliige Lebensexperimente.",
  "headers": [
    {
      "level": "H1",
      "text": "Die 44 besten kostenlosen SEO-Tools (getestet und für gut befunden)"
    },
    {
      "level": "H2",
      "text": "Keyword Recherche-Tools"
    },
    {
      "level": "H3",
      "text": "1. Answer The Public"
    },
    {
      "level": "H3",
      "text": "2. Google Keyword Planner"
    },
    {
      "level": "H3",
      "text": "3. Ahrefs Keyword Generator"
    },
    {
      "level": "H3",
      "text": "4. Google Trends"
    },
    {
      "level": "H3",
      "text": "5. Keyworddit"
    },
    {
      "level": "H3",
      "text": "6. AlsoAsked.com"
    },
    {
      "level": "H3",
      "text": "7. Keyword Surfer"
    },
    {
      "level": "H2",
      "text": "Onpage SEO-Tools"
    },
    {
      "level": "H3",
      "text": "8. Rank Math"
    },
    {
      "level": "H3",
      "text": "9. SERPSim"
    },
    {
      "level": "H3",
      "text": "10. Googles Rich Results Test"
    },
    {
      "level": "H3",
      "text": "11. Merkles Schema Markup Generator"
    },
    {
      "level": "H3",
      "text": "12. Ahrefs SEO Toolbar"
    },
    {
      "level": "H2",
      "text": "Linkbuilding-Tools"
    },
    {
      "level": "H3",
      "text": "13. Ahrefs Backlink Checker"
    },
    {
      "level": "H3",
      "text": "14. Hunter.io"
    },
    {
      "level": "H3",
      "text": "15. Ahrefs Broken Link Checker"
    },
    {
      "level": "H3",
      "text": "16. Scraper"
    },
    {
      "level": "H3",
      "text": "17. Help a Reporter (HARO)"
    },
    {
      "level": "H3",
      "text": "18. Streak"
    },
    {
      "level": "H2",
      "text": "Technische SEO-Tools"
    },
    {
      "level": "H3",
      "text": "19. Google Search Console"
    },
    {
      "level": "H3",
      "text": "20. Screaming Frog"
    },
    {
      "level": "H3",
      "text": "21. Cloudflare"
    },
    {
      "level": "H3",
      "text": "22. GTMetrix"
    },
    {
      "level": "H3",
      "text": "23. Googles Mobile-Friendly Test"
    },
    {
      "level": "H3",
      "text": "24. Smush"
    },
    {
      "level": "H3",
      "text": "25. Where Goes?"
    },
    {
      "level": "H3",
      "text": "26. Robots.txt Generator"
    },
    {
      "level": "H3",
      "text": "27. HEADMasterSEO"
    },
    {
      "level": "H3",
      "text": "28. Keep-alive Validation SEO Tool"
    },
    {
      "level": "H3",
      "text": "29. Chrome DevTools"
    },
    {
      "level": "H3",
      "text": "30. View Rendered Source"
    },
    {
      "level": "H3",
      "text": "31. Hreflang Tag Generator"
    },
    {
      "level": "H2",
      "text": "Tools zur Überprüfung des Rankings"
    },
    {
      "level": "H3",
      "text": "32. Ahrefs SERP Checker"
    },
    {
      "level": "H3",
      "text": "33. Local Search Results Checker"
    },
    {
      "level": "H3",
      "text": "34. Mobile SERP Test"
    },
    {
      "level": "H2",
      "text": "Analytics-Tools"
    },
    {
      "level": "H3",
      "text": "35. Google Analytics"
    },
    {
      "level": "H3",
      "text": "36. Keyword Hero"
    },
    {
      "level": "H3",
      "text": "37. Google Data Studio"
    },
    {
      "level": "H3",
      "text": "38. Ahrefs WordPress SEO Plugin"
    },
    {
      "level": "H2",
      "text": "Lokale SEO-Tools"
    },
    {
      "level": "H3",
      "text": "39. Google My Business"
    },
    {
      "level": "H3",
      "text": "40. Whitesparks Google Business Review Link Generator"
    },
    {
      "level": "H3",
      "text": "41. Whitespark Local Citation Finder"
    },
    {
      "level": "H2",
      "text": "Andere Tools"
    },
    {
      "level": "H3",
      "text": "42. Algoroo"
    },
    {
      "level": "H3",
      "text": "43. Wayback Machine"
    },
    {
      "level": "H3",
      "text": "44. Google Alerts"
    },
    {
      "level": "H2",
      "text": "Hast du das Budget um in Premium SEO-Tools zu investieren?"
    },
    {
      "level": "H2",
      "text": "Abschließende Gedanken"
    }
  ],
  "author": "Si Quan Ong"
}