{
  "url": "https://ahrefs.com/blog/de/leadgenerierung/",
  "slug": "leadgenerierung",
  "title": "Leadgenerierung: Ein Leitfaden für Anfänger",
  "description": "Bei der Leadgenerierung geht es darum, das Interesse von Personen zu wecken, die dein Produkt oder deine Dienstleistung kaufen möchten, und diese Personen zu binden.",
  "content": "Si Quan Ong Marketing @ Ahrefs. Ich lese, mache Breakdance und versuche zufäliige Lebensexperimente. Inhalt In den letzten sieben Tagen haben wir mehr als 6.000 Nutzer für unser kostenloses Tool, die Ahrefs Webmaster Tools (AWT), gewonnen.Bei diesen Personen handelt es sich um Leads. Einige von ihnen werden ein Abo-Upgrade durchführen und zu zahlenden Kunden werden.In diesem Leitfaden erfährst du, wie du Leads für dein Unternehmen generieren kannst.Aber zuerst ein paar Grundlagen…Was ist ein Lead?Welche Arten von Leads gibt es?Was bedeutet Lead-Generierung?Warum ist Lead-Generierung wichtig?Warum sollte man Leads generieren und sie nicht kaufen?Wie man Leads generiertMethoden zur Lead-GenerierungWas ist ein Lead?Ein Lead ist eine Person, die ihr Interesse an einem Produkt oder einer Dienstleistung eines Unternehmens bekundet hat, indem sie ihre Kontaktdaten (z.B. ihre E‑Mail-Adresse) mit dem Unternehmen geteilt hat.Welche Arten von Leads gibt es?Es wäre ineffizient, wenn dein Vertriebsteam jeden einzelnen Lead kontaktieren würde, denn manche Menschen sind näher an einem Kauf dran als andere. Deshalb unterteilen viele Unternehmen ihre Leads in Unterkategorien. Diese sind von Unternehmen zu Unternehmen unterschiedlich, aber die beiden gängigsten sind marketing-qualifizierte Leads (MQLs) und sales-qualifizierte Leads (SQLs).1. Marketing-qualifizierte Leads (MQLs)Marketing-qualifizierte Leads (MQLs) sind Leads, die mit deinem Marketing interagiert haben, aber noch nicht zum Kauf bereit sind. Sie haben zum Beispiel an deinem Webinar teilgenommen oder ein kostenloses E‑Book heruntergeladen.2. Sales-qualifizierte Leads (SQLs)Sales-qualifizierte Leads (SQLs) sind Leads, die Aktionen durchgeführt haben, die auf ihren Kaufwunsch hinweisen. Sie haben sich zum Beispiel für eine Testphase angemeldet oder ein Angebot angefordert. Die meisten Unternehmen übergeben SQLs an ein Vertriebsteam.Nebenbei bemerkt. Die Definitionen von MQLs und SQLs sind von Unternehmen zu Unternehmen unterschiedlich, wobei einige strengere Kriterien als andere haben. Manche Unternehmen berücksichtigen bei der Kategorisierung von Leads zum Beispiel Dinge wie “Kaufabsicht” und “Kundeneignung”.Was bedeutet Lead-Generierung?Bei der Lead-Generierung geht es darum, das Interesse von Personen zu wecken, die dein Produkt oder deine Dienstleistung kaufen wollen, und um mit ihnen zu interagieren und sie zu halten.Warum ist Lead-Generierung wichtig?Lead-Generierung ist wichtig, weil sie dir die Erlaubnis und die Möglichkeit gibt, potenzielle Kunden direkt zu kontaktieren. Dann kannst du die Beziehung zu ihnen aufbauen und pflegen, bis sie bereit sind, etwas zu kaufen.Warum sollte man Leads generieren und sie nicht kaufen?Die Generierung von Leads ist in der Regel besser als der Kauf von Leads, denn generierte Leads haben ein Interesse an deinem Produkt oder deiner Dienstleistung bekundet und dir erlaubt, sie zu kontaktieren. Das ist bei gekauften Leads nicht der Fall. Sie gehören vielleicht zu einer relevanten Kontaktliste, aber die Nachrichten, die du ihnen schickst, sind unerwünscht, und sie sind wahrscheinlich nicht mit deiner Marke vertraut.Gekaufte Leads mit Anrufen oder E‑Mails zuzuspammen, kann deinem Ruf schaden.Wie man Leads generiertDie Generierung von Leads für dein Unternehmen umfasst drei Schritte. Du brauchst eine Methode, um:Personen auf deine Website oder Webseite zu locken.Sie zu aktivieren, damit sie bereit sind, dir ihre Kontaktdaten mitzuteilen (wir nennen das “Angebot”).Diese Kontaktdaten zu erfassen.Die meisten Unternehmen richten ihre Kampagnen zur Lead-Generierung in umgekehrter Reihenfolge ein, also sehen wir uns diese Schritte genauer an und beginnen mit der Lead-Erfassung.1. Lead-ErfassungDu brauchst eine Möglichkeit, die Kontaktinformationen eines potenziellen Kunden zu erfassen. Das kann ganz einfach sein, indem du ein Formular auf deiner Website einrichtest:Nach welchen Informationen du genau fragst, hängt von den Bedürfnissen deines Unternehmens ab. Übliche Angaben sind Name, E‑Mail und Telefonnummer, aber du kannst nach allem fragen, was du willst. Dinge wie Unternehmensgröße und Budget sind im B2B-Bereich üblich.Je mehr Informationen du abfragst, desto geringer ist die Wahrscheinlichkeit, dass die Leute das Formular ausfüllen. Das ist nicht unbedingt etwas Schlechtes, denn die Leute, die sich mehr Mühe geben, sind in der Regel die besseren Kontakte.2. AngebotEin Besucher deiner Website wird seine Kontaktdaten nicht ohne einen gewissen Anreiz herausgeben. Es gibt verschiedene Möglichkeiten, dies zu tun. Es kommt ganz auf deine Nische an und darauf, wer deine Zielgruppe ist. Außerdem musst du mehrere Angebote testen und herausfinden, was gut ankommt.E‑Commerce-Shops locken ihre Besucher zum Beispiel gerne mit Rabatten an:Blogger verschenken meist kostenlose E‑Books oder Downloads:Und Software-as-a-Service (SaaS)-Unternehmen erstellen oft kostenlose Tools, wie wir es mit den Ahrefs Webmaster Tools (AWT) auch gemacht haben:3. TrafficNiemand wird deine Seite und dein Angebot auf magische Weise entdecken. Du brauchst eine Möglichkeit, sie zu vermarkten.Nehmen wir zum Beispiel an, du verkaufst Fußballschuhe. Du hast eine Landing Page, auf der du ein kostenloses E‑Book darüber anbietest, wie du deine Elfmeter verbessern kannst.Um den Traffic auf diese Seite zu lenken, könntest du:PPC-Anzeigen schalten, z.B. FB/Twitter/Google-Anzeigen.Inhalte erstellen, die bei Google gut ranken und auf diese Seite verlinken.Die Seite in den sozialen Medien bewerben.In Podcasts auftreten und die Seite bewerben.Die Seite in Communities, wie z.B. Quora, bewerben.Dies ist nur eine kleine Auswahl der Möglichkeiten. Die Möglichkeiten sind endlos.Empfohlene Lektüre: 11 bewährte Methoden, um Traffic für deine Website zu generieren Methoden zur Lead-GenerierungHier sind einige gängige Methoden, die du anwenden kannst, um mehr Leads für dein Unternehmen zu generieren. Du wirst feststellen, dass alle Methoden zur Lead-Generierung Variationen dieses dreistufigen Prozesses sind.1. BloggenViele Unternehmen nutzen das Bloggen als primäre Methode zur Lead-Generierung. Es ist die Grundlage für die so genannte Inbound-Lead-Generierung.TrafficDamit deine Beiträge Monat für Monat gut besucht werden, musst du dafür sorgen, dass sie bei Google weit oben ranken. Dazu solltest du Themen wählen, nach denen die Leute aktiv suchen.Du kannst diese Themen mit dem Ahrefs Keywords Explorer finden:Gib einen relevanten Suchbegriff in den Keywords Explorer ein.Öffne den Bericht “Übereinstimmende Begriffe”.Aktiviere das Feld “Fragen”.Suche nach Fragen mit hohem Suchvolumen, nach denen deine Zielgruppe wahrscheinlich suchen wird.Wenn du z.B. Tee online verkaufst, wäre “wie man Ingwertee zubereitet” wahrscheinlich ein gutes Thema für einen Blogbeitrag:Von da an geht es nur noch darum, einen Beitrag zu erstellen, der es verdient, gerankt zu werden. In diesem Video erfährst du, wie das geht:https://www.youtube.com/watch?v=8BdZ0dUu7VQAngebotLocke die Leser mit kostenlos herunterladbaren Zusatzinhalten an, die mit dem Beitrag zusammenhängen. Dies wird als Content-Upgrade bezeichnet. Checklisten, Arbeitsblätter, Vorlagen und kostenlose Kurse sind gut geeignet.Intercom bietet zum Beispiel einen “ultimativen Leitfaden für dialogorientierten Support” in seinem Beitrag über globalen Kundensupport an:Lead-ErfassungZeige ein Formular zur Erfassung von Leads an, wenn der Leser auf das Content-Upgrade klickt. Du kannst dies mit einem Popup oder einem Link zu einer Landing Page umsetzen.Sumo zum Beispiel bietet sein Content-Upgrade über ein Popup an:Du kannst die Methode wählen, die du möchtest. Probiere beide Methoden aus, um zu sehen, welche für dein Unternehmen am besten funktioniert.2. Pay-per-Click (PPC) AdvertisingBei PPC bezahlst du für Klicks auf deine Website.TrafficDu bezahlst eine Plattform wie Google oder Facebook dafür, dass sie deine Anzeigen ihren Nutzern zeigt. Jedes Mal, wenn jemand auf deine Anzeige klickt, zahlst du eine Gebühr. Nutze die Targeting-Optionen, um sicherzustellen, dass die richtigen Leute deine Anzeige sehen.Bei Facebook kannst du zum Beispiel Anzeigen nach Alter, Geschlecht, Standort, Interessen und mehr ausrichten:AngebotVerleite Personen mit einem überzeugenden Angebot zum Klicken auf deine Anzeige. Beliebte Beispiele sind Webinare, kostenlose Tests und kostenlose Downloads.Hier ist ein Beispiel von HubSpot:Lead-ErfassungLeite den bezahlten Traffic auf eine Landing Page, die weitere Details zu deinem Angebot enthält. Füge ein Formular hinzu, um Leads zu erfassen.Hier ist die Landing Page, auf die HubSpot seinen bezahlten Facebook-Traffic schickt:3. Kooperationen mit anderen UnternehmenDein Unternehmen möchte Leads generieren. Andere Unternehmen wollen das auch. Warum nicht zusammenarbeiten?TrafficFinde ein Unternehmen in einer ähnlichen Branche mit einer großen Zielgruppe, das kein direkter Konkurrent ist. Biete ihnen an, etwas Nützliches für ihre Zielgruppe zu erstellen, z.B. ein Webinar, ein E‑Book oder einen Kurs. Du erzielst Traffic für dein Angebot, wenn sie es bei ihrem Publikum bewerben.Wir haben das vor ein paar Jahren mit Buffer gemacht, einem Social-Media-Planungs-Tool.AngebotPasse dein Angebot an die Zielgruppe deines Kooperationspartners an. In unserem Webinar mit Buffer haben wir zum Beispiel darüber gesprochen, wie man mit Inhalten und Social-Media-Marketing mehr Traffic erzielt:https://www.youtube.com/watch?v=xn2XCFqREbULead-ErfassungErstelle eine Co-Branding-Landingpage mit mehr Details zu deinem Angebot und einem Lead-Capture-Formular.Hier ist die Landing Page für unser Webinar mit Buffer:Empfohlene Lektüre: 10 Methoden zur Lead-Generierung, die funktionieren (mit Beispielen) FazitJede Methode zur Lead-Generierung folgt demselben dreistufigen Prozess: Traffic, Angebot, Erfassung. Das Schöne daran ist, dass es einfach ist, Lücken in deinem Lead-Generierungs-Trichter zu erkennen und zu beheben.Wenn deine Landing Page gut konvertiert, aber nicht viel Traffic erhält, solltest du dich darauf konzentrieren, mehr Traffic zu generieren.Wenn deine Landing Page viel Traffic hat, aber nicht konvertiert, erstelle ein besseres Angebot oder experimentiere mit dem Mechanismus zur Lead-Erfassung.Habe ich etwas Wichtiges übersehen? Lass es mich auf Twitter wissen. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Si Quan Ong Marketing @ Ahrefs. Ich lese, mache Breakdance und versuche zufäliige Lebensexperimente.",
  "headers": [
    {
      "level": "H1",
      "text": "Leadgenerierung: Ein Leitfaden für Anfänger"
    },
    {
      "level": "H2",
      "text": "Was ist ein Lead?"
    },
    {
      "level": "H2",
      "text": "Welche Arten von Leads gibt es?"
    },
    {
      "level": "H3",
      "text": "1. Marketing-qualifizierte Leads (MQLs)"
    },
    {
      "level": "H3",
      "text": "2. Sales-qualifizierte Leads (SQLs)"
    },
    {
      "level": "H2",
      "text": "Was bedeutet Lead-Generierung?"
    },
    {
      "level": "H2",
      "text": "Warum ist Lead-Generierung wichtig?"
    },
    {
      "level": "H2",
      "text": "Warum sollte man Leads generieren und sie nicht kaufen?"
    },
    {
      "level": "H2",
      "text": "Wie man Leads generiert"
    },
    {
      "level": "H3",
      "text": "1. Lead-Erfassung"
    },
    {
      "level": "H3",
      "text": "2. Angebot"
    },
    {
      "level": "H3",
      "text": "3. Traffic"
    },
    {
      "level": "H2",
      "text": "Methoden zur Lead-Generierung"
    },
    {
      "level": "H3",
      "text": "1. Bloggen"
    },
    {
      "level": "H4",
      "text": "Traffic"
    },
    {
      "level": "H4",
      "text": "Angebot"
    },
    {
      "level": "H4",
      "text": "Lead-Erfassung"
    },
    {
      "level": "H3",
      "text": "2. Pay-per-Click (PPC) Advertising"
    },
    {
      "level": "H4",
      "text": "Traffic"
    },
    {
      "level": "H4",
      "text": "Angebot"
    },
    {
      "level": "H4",
      "text": "Lead-Erfassung"
    },
    {
      "level": "H3",
      "text": "3. Kooperationen mit anderen Unternehmen"
    },
    {
      "level": "H4",
      "text": "Traffic"
    },
    {
      "level": "H4",
      "text": "Angebot"
    },
    {
      "level": "H4",
      "text": "Lead-Erfassung"
    },
    {
      "level": "H2",
      "text": "Fazit"
    }
  ],
  "author": "Si Quan Ong"
}