{
  "url": "https://ahrefs.com/blog/de/linkbuilding-mit-bildern/",
  "slug": "linkbuilding-mit-bildern",
  "title": "3 einfache Möglichkeiten wie du mit Bildern Linkbuilding betreiben kannst",
  "description": "Bilder sind ein effizientes Mittel für Linkbuilding, da sie einfach eingebunden werden können und ihre visuellen Eigenschaften machen es einfacher, komplexe Themen zu erklären.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (oder, in einfachen Worten, ich bin der Typ, der dafür sorgt, dass jeder Blog-Post EPISCH wird). Inhalt Du kennst sicherlich das Sprichwort “ein Bild ist mehr wert als tausend Worte”, aber wenn es um Linkbuilding geht, kann ein Bild buchstäblich tausend Links wert sein.Nehmen wir zum Beispiel diesen einfachen Comic von xkcd:Laut Ahrefs Site Explorer hat dieses Bild Links von mehr als 7000 verweisenden Domains:Während es schwierig sein könnte, diesen Erfolg zu replizieren, gibt es einfache Möglichkeiten, wie wir mit Hilfe von Bildern Linkbuilding betreiben können. Und in diesem Guide beleuchten wir drei der effektivsten Taktiken.Aber lass uns zunächst einige Grundlagen abdecken.Warum generieren Bilder Links?Welche Arten von Bilder generieren Links?Wie betreibt man Linkbuilding mit Bildern? Warum generieren Bilder Links?Bilder lassen sich einbinden. Und wenn Leute Bilder in ihren Inhalten einbinden, verlinken sie in der Regel zur entsprechenden Quelle.Hier ist zum Beispiel der Comic über Passwortstärke in einen Beitrag von Wired.co.uk eingebunden:Unter dem Bild verweist der Autor auf den Urheber, indem er auf die Bildquelle verlinkt.Welche Arten von Bilder generieren Links?Links mit Hilfe von Bildern zu generieren ist ein strategischer Prozess. Du kannst nicht einfach ein Bild von deiner Katze machen und erwarten, dass es unzählige Links generiert. Du brauchst Bilder, die Leute in ihren eigenen Inhalten einbinden möchten.Hier sind ein paar übliche Bildarten, die dazu neigen, Links zu generieren:InfografikenGrafikenFotosKartenProduktfotosInfografikenLeute lieben Infografiken aus vielerlei Gründen. Dies ist vermutlich der Grund, warum Linkbuilding mit Infografiken schon seit mehr als einem Jahrzehnt betrieben wird. Und obwohl sie heutzutage weniger populär sind als früher, hauptsächlich weil es Leute vor einigen Jahren damit übertrieben haben, können interessante Infografiken mit gutem Design immer noch viele Backlinks generieren.Schau dir zum Beispiel diese von Wine Folly an:Laut Ahrefs Site Explorer hat sie Links von 153 unique Websites (verweisenden Domains).GrafikenSchau dir diese Grafik an:Laut Google wird sie auf 150 Seiten dargestellt.Das ist vermutlich ein Grund, warum der Beitrag, der diese Grafik enthält, unser Beitrag mit den meisten Verlinkungen ist:FotosNein, das Bild von deinem Mittagessen auf Instagram wird nicht den Linkbuilding-Erfolg bringen, den du suchst. Aber wenn du Bilder von Dingen machst, nach denen Leute suchen, können diese eine Vielzahl an Links generieren.Diese Bildersammlung von 100+ Natur-Bildern von Unsplash zum Beispiel hat 349 verweisende Domains:KartenSchau dir diese Karte an:Die Seite, auf der sich die Karte befindet, hat Backlinks von 278 verweisenden Domains, inklusive von BBC, Lonely Planet, Vice, Gizmodo und mehr.ProduktfotosWenn du Bilder von beliebten Produkten für deinen Ecommerce Store machst, kannst du Gift darauf nehmen, dass Leute diese ohne Erlaubnis verwenden werden.FireBox zum Beispiel hat eigene Produktbilder für ein Bierbrauset gemacht, welches sie verkaufen:Allerdings sind sie nicht die einzige Seite, die dieses Produkt verkaufen und andere nutzen ihre Bilder scheinbar ohne Erlaubnis:3 Möglichkeiten Linkbuilding mit Bildern zu betreibenLass uns zum Wesentlichen kommen und ein paar Links generieren.Fordere Links von unsachgemäßen Verweisen einFordere Links von unerlaubter Nutzung einNutze die TRUST-Formel1. Fordere Links von unsachgemäßen Verweisen einWenn du bereits einige der oben genannten Bildarten erstellt hast, kann es sein, dass Leute diese schon eingebunden haben.Hier ist zum Beispiel eine Einbindung unseres Bildes zum Thema Distribution nach Keywordlänge auf einer anderen Seite:Wie du unter dem Bild sehen kannst, verweisen sie zu uns mit einem Link. Allerdings verweist dieser Link auf die Bilddatei selbst und nicht auf den Beitrag von dem es stammt. Dies ist nicht ideal, da Bildlinks eine Sackgasse für PageRank sind und vermutlich auch nicht unserem Ranking in den Google-Ergebnissen helfen.So kannst du diese Arten von Bilder-Links finden und einen richtigen Verweis einfordern:a) Finde unsachgemäße VerweiseFüge deine Website in Ahrefs Site Explorer ein, navigiere zum Backlinks-Report und suche nach .png oder .jpg in den URLs der Backlinks:Filter den Report dann nach “dofollow” Links von uniquen Domains.Für den Ahrefs Blog kannst du sehen, dass 497 Websites direkt zu Bilddateien verlinken.Nun müssen wir den Report nur noch durchgehen und alle Links in einer Tabelle vermerken, die wir einfordern möchten.Stelle sicher, dass du den Sourcecode der Seite überprüfst bevor du die entsprechenden Seitenbetreiber kontaktierst, da immer die Möglichkeit besteht, dass sie zu der Seite verlinken, von der das Bild stammt. In diesem Fall möchtest du sie nicht kontaktieren.b) Kontaktiere die Seitenbetreiber und fordere einen korrekten VerweisFinde die E‑Mail Adresse einer Person, die mit der entsprechenden Seite in Verbindung steht und sende eine kurze E‑Mail in der du um den Austausch des Links bittest:Hey John,Ich habe festgestellt, dass du eine unserer Grafiken in deinen Beitrag über [Thema] eingebunden hast.Wäre es möglich direkt auf den Beitrag zu verlinken, von dem die Grafik stammt, anstatt auf die Bilddatei selbst?Vielen Dank,JoshEs ist so einfach. Der schwierigste Teil ist es die richtigen Kontaktdaten zu finden aber dieses Video zeigt dir, wie du diesen Prozess beschleunigen kannst:https://www.youtube.com/watch?v=JFyrTNU8X_cc) Automatisiere allesWenn du mit dieser Technik Erfolg hast, macht es auch Sinn im Bezug auf zukünftige unsachgemäße Verweise den Überblick zu behalten.Richte dafür einen neuen Backlink-Alarm in Ahrefs Alert ein und verwende die folgenden Einstellungen:Domain or URL: https://yourwebsite.com/wp-content/uploads/Mode: PrefixScore: New backlinksBeachte, dass dies nur funktioniert, wenn du eine WordPress-Seite hast. Falls du ein anderes CMS verwendest, musst du herausfinden wo deine Bilder hochgeladen werden und die entsprechende URL verwenden. Oder wenn du ein CDN nutzt, musst du diese Domain entsprechend überprüfen.Wenn alles richtig eingerichtet ist, wirst du nun E‑Mail Alarme erhalten, wann immer jemand direkt auf ein Bild auf deiner Seite verlinkt.Du kannst dann die Links durchgehen und wenn du einen einfordern möchtest, kannst du eine entsprechende E‑Mail versenden.2. Fordere Links von unerlaubter Nutzung einDie meisten Leute, die deine Bilder verwenden, werden mit einem Link auf dich verweisen, aber es gibt auch Ausnahmen.Hier ist zum Beispiel ein Bild von uns auf einer anderen Seite, aber dem Sourcecode nach zu urteilen, verweist kein Link auf uns:So findest du Seiten, die deine Bilder ohne Verweis nutzen und forderst Links ein:a) Finde Bilder die ohne Erlaubnis genutzt werdenDie einfachste Methode hierfür ist eine umgekehrte Google Bildersuche. Lade einfach dein Bild hoch oder füge die URL ein und Google zeigt dir Seiten an, auf denen das Bild vermutet wird.Alles was du dann noch tun musst, ist die Ergebnisse durchzugehen, um sicherzustellen, dass:Dein Bild wirklich auf der Seite istNicht mit einem Link auf deine Seite verwiesen wirdDu einen Link von der Website möchtestWenn all diese Punkte zutreffen, vermerke die Seite in einer Tabelle.b) Kontaktiere die Betreiber und fordere einen VerweisFinde die richtige E‑Mail Adresse und sende eine einfache E‑Mail wie:Hey John,Ich habe festgestellt, dass du eine unserer Grafiken in deinen Beitrag über [Thema] eingebunden hast.Wäre es möglich mit einem Link auf die Quelle zu verweisen?Vielen Dank,Joshc) Automatisiere die Erkennung unerlaubter BildnutzungDie umgekehrte Google Bildersuche ist komplett kostenlos, aber aufwendig, wenn du viele Bilder überprüfen möchtest. Du musst den Prozess außerdem alle paar Monate wiederholen, wenn du den Überblick über unerlaubte Bildnutzung behalten möchtest.Die Lösung für dieses Problem liegt in der Nutzung eines kostenpflichtigen Tools wie Image Raider.Für eine monatliche Gebühr überwacht diese Tool das Internet im Bezug auf die Einbindung von bis zu 10.000 Bildern. Melde dich einfach an, erstelle eine Liste und füge die Bilder hinzu, die du überwachen möchtest.Du kannst einfach innerhalb von Sekunden alle Bilder deiner Seite zu Image Raider hinzufügen. Crawle deine Seite mit Ahrefs Site Audit, navigiere zum Images-Report, klicke auf “crawled images”, “export image resources” und füge die Liste an Bild-URLs in Image Raider ein.Während dies in der Theorie nach einer guten Idee klingt, willst du aber vermutlich nicht alle diese Bilder überwachen. Es ist vermutlich besser deine beliebtesten Seiten durchzugehen und die URLs deiner Bilder, die du überwachen möchtest, in Image Raider einzufügen:In beiden Fällen wird Image Raider das erneute Auftauchen deiner Bilder automatisch überwachen. Du musst dich nur einmal im Monat einloggen und die neuen “Verstöße” betrachten. Du kannst dies tun, indem du den Report nach “Result found date” filterst.Beachte aber, dass nicht alles, was dir von Image Raider als Verstöße angezeigt werden, auch echte Verstöße sind. Das Tool überprüft nicht, ob eine Seite zu dir verlinkt oder nicht. Du kannst dieses Problem lösen, indem du die URLs als Liste von Image Raider exportierst und eine benutzerdefinierte Suche in Screaming Frog durchführst, um im Bulk nach Links zu deiner Seite zu suchen.Navigiere zu Configuration > Custom > Search, wähle die “Does not contain” Option aus und füge das folgende RegEx ein:<a [^>]*bhrefs*=s*”([^”]*ahrefs.com[^”]*)Beachte, dass du ahrefs.com mit deinerseite.com ersetzen musst.Navigiere nun zum “Custom”-Tab und wähle den “Does not contain”-Filter aus dem Drop-Down Menu. Dir werden dann alle Seiten ohne Link zu deiner Seite angezeigt.Du kannst diese URLs dann zurück in Screaming Frog kopieren und die Ahrefs API nutzen, um Metriken wie Domain Rating, URL Rating usw. zu erhalten.Du musst dann nur noch durch die Ergebnisse gehen und entscheiden, welche Seiten du kontaktieren möchtest.Der beschriebene Prozess klingt nach viel Arbeit, aber wenn du mal den Dreh raus hast, sollte es dich nicht mehr als 15–20 Minuten im Monat kosten. Selbst wenn du nur ein bis zwei Links dadurch erhältst, ist dies nicht schlecht.3. Nutze die TRUST-FormelDu kannst nur eine begrenzte Anzahl an Backlinks von existierenden Bildern generieren. Wenn du dann mehr Backlinks erhalten möchtest, musst du neue Bilder erstellen. Es gibt eine Reihe an Möglichkeiten, wie du dabei vorgehen kannst, aber eine Formel, die erwiesenermaßen funktioniert, ist die TRUST-Formel.So sieht der Prozess kurz zusammengefasst aus:Trending topic (Thema das im Trend liegt)Research and analysis (Recherche und Analyse)Unique (unusual, or unexpected) takeaway (einzigartige (ungewöhnliche oder unerwartete) Schlussfolgerung)Simple visual (einfache Darstellung)Tactical promotion (taktische Promotion)David McSweeney beschreibt hier im Detail, wie diese Taktik umgesetzt wird und wie wir Backlinks von Seiten mit hoher Autorität, wie Yahoo Sports and FHM, generiert haben. Aber lass uns hier die Basics betrachten.a) Finde ein Thema das im Trend liegtWenn Journalisten und Blogger bereits über ein Thema schreiben, ist es einfacher ihnen neue Inhalte zu einem ähnlichen Thema zu pitchen.Google News ist eine der besten Möglichkeiten Themen zu finden, die im Trend liegen. Suche einfach nach dem Thema von dem deine Seite handelt und überfliege die Ergebnisse nach Trendthemen.In Davids Fall stellte er fest, dass viele Seiten von Tiger Woods schrieben, weshalb er dieses Thema auswählte.b) Finde interessante Daten über dein ThemaFinde Daten, analysiere sie und ziehe einzigartige Schlüsse daraus (hier sind einige Ressourcen mit denen du beginnen kannst). David nutzte Daten von Wikipedia, um herauszufinden wieviel Tiger Woods in jedem Staat im Laufe seiner Karriere verdient hat.Seine Idee war, eine Karte mit diesen Daten zu erstellen.c) Verfasse die ÜberschriftAls nächstes benötigst du eine kurze Schlussfolgerung oder Überschrift für deinen Pitch. Wenn du dir damit schwer tust, kannst du dieses Format nutzen:Wir haben {X} herausgefunden.Wusstest du, dass {Y}?David hat Folgendes formuliert:Wir haben herausgefunden, wieviel Tiger Woods in jedem US Staat verdient hat. Wusstest du, dass er genau in der Hälfte aller Staaten Geld verdient hat? d) Erstelle dein BildDu hast grundsätzlich zwei Optionen: Erstelle ein einfaches Bild mit einem Tool wie Visme oder Easel.ly oder erstelle etwas Individuelles.David entschied sich für die zweite Option und erstellte das hier:Er hat es dann mit einer kurzen Zusammenfassung auf seiner Seite gelauncht:e) Promote das BildDer Kern des Prozesses ist die Kontaktaufnahme per E‑Mail mit Journalisten und Bloggern, die bereits über dein Thema berichten. Du kannst diese mit Hilfe von Google News oder Ahrefs Content Explorer ausfindig machen.Suche im Content Explorer nach deinem Thema und filtere nach englischen Seiten, die in den letzten sieben Tagen veröffentlicht wurden.Gehe dann durch die Ergebnisse und identifiziere Seiten, von denen du Links erhalten möchtest, recherchiere Kontaktinformationen und sende einen Pitch.Dies ist der Pitch, den David versendet hat:Erfahre mehr über Davids Ergebnisse in diesem Beitrag und lerne mehr zum Thema Linkbuilding mit Karten in diesem Beitrag.Abschliessende GedankenBilder sind ein effizientes Mittel für Linkbuilding, da sie einfach eingebunden werden können und ihre visuellen Eigenschaften machen es einfacher, komplexe Themen zu erklären. Das ist der Grund, warum Infografiken so gut funktionieren können.Bedenke nur, dass es nicht immer Sinn macht, etwas in einem Bild darzustellen. Du solltest nicht zwanghaft versuchen deine Inhalte in dieses Format umzuwandeln, nur um Links zu generieren. Das wird nicht funktionieren. Viele Infografiken sind genau aus diesem Grund nicht effektiv.Hast du Fragen? Stelle sie mir auf Twitter.Übersetzt von Heike Radlanski. Heike beschäftigt sich mit allen Aspekten des Online Marketing und Product Managements. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Joshua Hardwick Head of Content @ Ahrefs (oder, in einfachen Worten, ich bin der Typ, der dafür sorgt, dass jeder Blog-Post EPISCH wird).",
  "headers": [
    {
      "level": "H1",
      "text": "3 einfache Möglichkeiten wie du mit Bildern Linkbuilding betreiben kannst"
    },
    {
      "level": "H2",
      "text": "Warum generieren Bilder Links?"
    },
    {
      "level": "H2",
      "text": "Welche Arten von Bilder generieren Links?"
    },
    {
      "level": "H3",
      "text": "Infografiken"
    },
    {
      "level": "H3",
      "text": "Grafiken"
    },
    {
      "level": "H3",
      "text": "Fotos"
    },
    {
      "level": "H3",
      "text": "Karten"
    },
    {
      "level": "H3",
      "text": "Produktfotos"
    },
    {
      "level": "H2",
      "text": "3 Möglichkeiten Linkbuilding mit Bildern zu betreiben"
    },
    {
      "level": "H3",
      "text": "1. Fordere Links von unsachgemäßen Verweisen ein"
    },
    {
      "level": "H4",
      "text": "a) Finde unsachgemäße Verweise"
    },
    {
      "level": "H4",
      "text": "b) Kontaktiere die Seitenbetreiber und fordere einen korrekten Verweis"
    },
    {
      "level": "H4",
      "text": "c) Automatisiere alles"
    },
    {
      "level": "H3",
      "text": "2. Fordere Links von unerlaubter Nutzung ein"
    },
    {
      "level": "H4",
      "text": "a) Finde Bilder die ohne Erlaubnis genutzt werden"
    },
    {
      "level": "H4",
      "text": "b) Kontaktiere die Betreiber und fordere einen Verweis"
    },
    {
      "level": "H4",
      "text": "c) Automatisiere die Erkennung unerlaubter Bildnutzung"
    },
    {
      "level": "H3",
      "text": "3. Nutze die TRUST-Formel"
    },
    {
      "level": "H4",
      "text": "a) Finde ein Thema das im Trend liegt"
    },
    {
      "level": "H4",
      "text": "b) Finde interessante Daten über dein Thema"
    },
    {
      "level": "H4",
      "text": "c) Verfasse die Überschrift"
    },
    {
      "level": "H4",
      "text": "d) Erstelle dein Bild"
    },
    {
      "level": "H4",
      "text": "e) Promote das Bild"
    },
    {
      "level": "H2",
      "text": "Abschliessende Gedanken"
    }
  ],
  "author": "Joshua Hardwick"
}