{
  "url": "https://ahrefs.com/blog/de/link-building/",
  "slug": "link-building",
  "title": "Ein Anfängerleitfaden für den Linkaufbau - SEO Blog by Ahrefs %",
  "description": "Alles, was du zum Thema Linkaufbau für SEO wissen musst. Was man darunter versteht, wie es funktioniert, was gute Links ausmacht, wie man sie aufbaut und mehr.",
  "content": "Tim Soulo Tim ist CMO und Produktberater bei Ahrefs. Vor allem aber ist er der größte Fan und der wahrste Missionar des Unternehmens. Erfahren Sie mehr über Tim Links sind die Währung des Webs. Die Websites, die reichlich davon haben, weisen eine hohe Autorität auf und werden mit hohen Rankings bei Google belohnt. Wohingegen Websites, die keine haben, in der Bedeutungslosigkeit versinken.Wenn du gerade erst mit SEO anfängst, kann es eine ziemliche Herausforderung sein, den Linkaufbau zu verstehen.Einige SEOs werden dir raten, großartigen Content zu erstellen und darauf zu warten, dass die Links von selbst kommen. Andere werden darauf bestehen, dass strategisches Link-Prospecting und gezielte Kontaktaufnahmen via E‑Mail das A und O sind, und wieder andere werden dir ein kryptisches Lächeln schenken und nur ein Wort fallen lassen: PBNs.Auf wen solltest du also hören?Wie bei vielen Dingen in der Suchmaschinenoptimierung ist die richtige Antwort: “Es kommt darauf an”. Es gibt nicht den einen richtigen Ansatz für den Linkaufbau und die Wahl deiner Vorgehensweise hängt weitgehend von deiner Branche, deiner Website, deinen Ressourcen und deinen Zielen ab.Habe ich das Ganze gerade noch verwirrender gemacht, als es ohnehin schon war?Mach dir keine Sorgen. Wir haben diesen Leitfaden zum Linkaufbau für absolute Anfänger erstellt und sichergestellt, dass er voll von praktischen Ratschlägen ist, die du sofort umsetzen kannst.Fangen wir also an, oder?Contents SEO-Leitfaden 1Wie Suchmaschinen funktionieren 2SEO Grundlagen 3Keyword-Recherche 4SEO-Content (EN) 5On-Page-SEO 6Linkbuilding 7Technisches SEO Part 1Linkaufbau-GrundlagenDa dies ein Leitfaden für Anfänger ist, ist es nur fair, mit den Grundlagen zu beginnen.Was ist Linkaufbau?Unter Linkaufbau versteht man den Prozess, andere Websites dazu zu bringen, auf Seiten deiner Website zu verlinken, damit diese in den Google-Suchergebnissen höher ranken.Im Grunde kann man die meisten “White Hat”-Linkaufbau-Strategien auf zwei einfache Schritte herunterbrechen:Erstelle etwas Beachtenswertes (und daher eines Links würdig);Zeige es den Leuten, die Websites besitzen (und somit darauf verlinken können).Warum ist der Linkaufbau wichtig?Laut Andrey Lipattsev von Google stellen Links einen der drei wichtigsten Ranking-Faktoren bei Google dar. Wenn du also möchtest, dass die Seiten deiner Website in der Suche weit oben ranken, wirst du mit ziemlicher Sicherheit Links benötigen.Google (und andere Suchmaschinen) sehen Links von anderen Seiten als “Votes” (“Stimmen”) an. Diese Votes helfen ihnen zu erkennen, welche Seite zu einem bestimmten Thema (unter Tausenden von ähnlichen) es verdient, ganz oben in den Suchergebnissen zu stehen.Im Allgemeinen gilt, dass Seiten mit einer höheren Anzahl von Backlinks tendenziell auch höher in den Suchergebnissen ranken. Dies wurde von vielen SEO-Unternehmen im großen Stil untersucht und die Korrelationzwischen der Anzahl der Websites, die auf eine Seite verlinken, und ihrer Ranking-Position bei Google ist immer positiv ausgefallen. Laut unserer Studie erhalten Seiten, auf die mehrere Websites verlinken, tendenziell mehr Search Traffic.Links sind also wichtig, das steht fest.Aber warum ist es so wichtig, sie aufzubauen?Ich meine, Websites neigen naturgemäß dazu, aufeinander zu verlinken, richtig? Du hast erst ein paar Absätze in diesem Leitfaden gelesen und bereits gesehen, dass ich auf zwei verschiedene Seiten verlinkt habe.Nun, in einer idealen Welt würde die qualitativ hochwertigste Seite zu einem Thema immer die meisten Links erhalten und auf Platz 1 bei Google ranken. Während Seiten mit geringerer Qualität nicht so viele Links erhalten und niedriger ranken würden.Doch wir leben nicht in dieser idealen Welt. Und es gibt zwei Hauptgründe, warum die Seiten mit den meisten Links nicht unbedingt die besten sein müssen:1. Der Teufelskreis der SEORate mal, wie ich die beiden Seiten, die ich oben verlinkt habe, ausgewählt habe. Glaubst du, dass ich tausende ähnliche Seiten zu jedem Thema gelesen habe, um die besten auszuwählen? Nein, natürlich nicht! Ich habe eine schnelle Google-Suche zu dem Thema durchgeführt, auf das ich verweisen wollte, habe ein paar der am besten rankenden Seiten geöffnet, um zu überprüfen, ob sie das enthalten, was ich brauche, und habe dann auf die Seite verlinkt, die mir am besten geeignet erschien.So erhielten die beiden am besten rankenden Seiten einen neuen Link, der ihre hohen Rankings in Google weiter absicherte.Wir nennen es den “Teufelskreis der SEO”. Und wir haben tatsächlich eine Studiedurchgeführt, um zu beweisen, dass es so etwas auch wirklich gibt. In dem Moment, in dem sie veröffentlicht wird, hat deine großartige Seite sofort einen enormen Nachteil gegenüber denjenigen, die für dasselbe Thema bei Google ganz oben ranken. Wenn du diesen Teufelskreis durchbrechen möchtest, musst du proaktiv Backlinks für deine Seite akquirieren.2. Deine Mitbewerber bauen wahrscheinlich Links aufNehmen wir an, deine Seite hat auf natürliche Weise viele Links erhalten (ohne Linkaufbau) und rankt für ihr Thema nun auf Platz 1 bei Google.Und nun? Bevor du aufgetaucht bist, war die Seite von jemand anderem auf Platz 1. Und der Besitzer dieser Seite versucht wahrscheinlich, diesen Spitzenplatz zurückzuerobern, indem er einige hochwertige Links zu seiner Seite aufbaut.Dasselbe gilt für den Besitzer der Seite auf Position 3, die vorher auf Position 2 war. Sie sind darüber nicht erfreut und werden wahrscheinlich anfangen, Links aufzubauen, um das zu ändern.Obwohl deine Seite vielleicht zehnmal besser ist als deren Seiten (was der Grund dafür ist, dass sie überhaupt so viele natürliche Links bekommen hat), können deine Mitbewerber dich immer noch im Ranking überholen, wenn sie geschickt genug sind, Links aufzubauen.Du kannst entweder nichts tun und darüber jammern, dass die Welt ungerecht ist oder aktiv werden und dagegen ankämpfen.Links sind nicht die Antwort auf allesNach diesem Einführungskapitel mag es so aussehen, dass alles, was du tun musst, um bei Google auf Platz 1 zu ranken, darin besteht, mehr Backlinks aufzubauen als die Seiten, die aktuell dort ranken.Und obwohl das bis zu einem gewissen Grad stimmt, ist die Sache in Wirklichkeit ein wenig nuancierter.Abgesehen davon, dass nicht alle Links gleich sind (dazu mehr in Kapitel 3), berücksichtigen Suchmaschinen beim Ranking von Seiten viele andere Variablen. Der Mix dieser Variablen kann tatsächlich von der Art der Suchanfrage abhängen, für die du ranken möchtest.Wenn du also viele Links zu deiner Seite aufbaust und sie trotzdem schlecht rankt, gib nicht diesem Leitfaden die Schuld, dich in die Irre geführt zu haben. Überprüfe andere Ranking-Faktoren, die verhindern könnten, dass du gut rankst.Part 2Wie man Links aufbautEs gibt viele Methoden und Strategien, die dir helfen, Links von anderen Websites zu deiner Seite zu bekommen. In diesem Kapitel erfährst du, welche Methoden und Strategien das sind, welche Logik dahinter steckt und wie riskant es sein kann, sie einzusetzen.Konzeptionell gesehen, lassen sich die meisten Linkaufbau-Methoden und ‑Strategien in einen der folgenden fünf Bereiche einordnen: Hinzufügen, Fragen, Kaufen, Verdienen und Bewahren.1. Links hinzufügenWenn du eine Website aufrufen kannst, die dir nicht gehört, und deinen Link dort manuell platzierst, wird das als “hinzufügen” eines Links bezeichnet. Die gängigsten Maßnahmen, die in diese Kategorie fallen, sind: Einträge in Branchenverzeichnisse vornehmen;Profile in sozialen Netzwerken erstellen;Blog-Kommentare erstellen;Beiträge in Foren, Communities und auf Q&A‑Seiten veröffentlichen; Erstellen von Listen für die Stellensuche;etc.Der Aufbau von Links mittels dieser Methoden ist sehr einfach zu bewerkstelligen. Und genau aus diesem Grund haben diese Links in den Augen von Google einen sehr geringen Wert (und können in einigen Fällen sogar als SPAM gekennzeichnet werden).Abgesehen davon verschaffen dir diese Arten von Links kaum einen Wettbewerbsvorteil. Wenn du auf eine Website gehen und deinen Link dort manuell platzieren kannst, hält deine Mitbewerber nichts davon ab, das Gleiche zu tun.Dennoch solltest du diese Kategorie von Linkaufbau-Techniken nicht komplett ignorieren. Jede von ihnen kann tatsächlich recht vorteilhaft für dein Online-Business sein, aus anderen Gründen als der Beschaffung von Links.Lass mich das an ein paar Beispielen erläutern:Einträge in Branchenverzeichnisse vornehmenDu solltest dem Drang widerstehen, deine Website in jedes einzelne Branchenverzeichnis einzutragen, das es gibt, nur um einen weiteren Link zu erhalten. Konzentriere dich stattdessen auf diejenigen, die sehr bekannt sind, viel Traffic haben und daher tatsächlich Besucher auf deine Website bringen könnten.Wenn du zum Beispiel ein Kleinunternehmer bist und von einem lokalen Branchenverzeichnis erfahren hast, in dem andere Unternehmer ihre Leads generieren, solltest du dein Unternehmen unbedingt dort eintragen. Dieser eine Link würde dir wahrscheinlich viel mehr “SEO-Wert” bieten als die Eintragung deiner Website in eine Reihe von generischen Branchenverzeichnissen, die du in einem beliebigen SEO-Forum gefunden hast.Business-Profile in sozialen Netzwerken erstellenEs empfiehlt sich, deine Marke so schnell wie möglich auf allen wichtigen Social-Media-Seiten (Twitter, YouTube, SlideShare, Instagram & Co.) anzumelden. Andernfalls könnten Besetzer sie an sich reißen, sobald sie die Marke auf ihrem Radar haben.Genau aus diesem Grund tritt unser Team auf Instagram unter dem Namen “ahrefscom” statt unter “ahrefs” auf. Jemand anderes hat sich diesen Benutzernamen geschnappt und wir haben es bis jetzt nicht geschafft, ihn zurückzufordern.Unsere Instagram-Profilseite, die einen Link zu unserer Website enthält.Wir haben uns nie die Mühe gemacht, unser Instagram-Profil zu bewerben, und doch erhielt es irgendwie Links von über 70 Websites. Das macht es zu einer ziemlich “starken” Seite, von der man einen Link hat (mehr über den Wert von Links in Kapitel 3):Screenshot aus dem Ahrefs Site Explorer.Blog-Kommentare erstellenDas Hinterlassen eines aussagekräftigen Kommentars bei jemandes Artikel ist eine großartige Möglichkeit, wahrgenommen zu werden und eine Beziehung zu dieser Person aufzubauen (was zu allen möglichen guten Dingenführen kann). Doch Kommentare zu verfassen, mit dem alleinigen Zweck, einen Link zu deiner Website hineinzuzwängen, führt nur dazu, dass Blogbesitzer dich hassen.Außerdem sind Links aus Blog-Kommentaren normalerweise “nofollowed” (d.h. sie zählen nicht als “Votes”). Wenn du also mit dem Gedanken spielst, jemandem einen Kommentar zu hinterlassen, nur um dort deinen Link einzufügen — tu es nicht.Hoffentlich geben dir diese drei Beispiele eine gute Vorstellung davon, wie du deine Links bei anderen Websites “hinzufügen” kannst, ohne zu spammen.Nebenbei bemerkt.Nebenbei bemerkt: Auf der Suche nach weiteren Möglichkeiten, Links bei anderen Websites “hinzuzufügen”, stößt du vielleicht auf Methoden, die “Web 2.0s” und “Bookmarking Sites” erwähnen. Diese Dinge haben vor etwa 15 Jahren funktioniert, aber heute solltest du deine Zeit nicht damit verschwenden.2. Um Verlinkungen fragen Wie der Name schon sagt, wendest du dich bei dieser Methode an den Besitzer der Website, von der du einen Link erhalten möchtest, und lieferst ihm einen zwingenden Grund, um einen Link zu dir zu setzen.Dieser “zwingende Grund” ist absolut essentiell für diese Kategorie von Linkaufbau-Methoden. Die Leute, die du kontaktierst, interessieren sich nicht für dich und deine Website (es sei denn, du bist eine Art Berühmtheit) und haben daher keinerlei Anreiz, dir zu helfen. Bevor du sie also bittest, auf dich zu verlinken, frage dich: “Was springt für SIE dabei heraus?”Hier sind einige der Linkaufbau-Techniken und ‑Strategien, die in diese Kategorie fallen, zusammen mit einem kurz definierten “zwingenden Grund”, auf dem sie basieren: Guest Blogging — erstelle nützlichen Content für ihre Website; Skyscraper-Technik — zeige ihnen eine bessere Quelle als diejenige, auf die sie verlinken; Link Inserts — zeige ihnen eine Quelle mit mehr Informationen zu etwas, das sie kurz erwähnt haben; Ego Bait- erwähne sie oder ihre Arbeit in deinem eigenen Content in einem positiven Licht Testimonials& Fallstudien — gib positives Feedback über ihr Produkt oder ihre Dienstleistung; Linktausch- biete an, zu ihnen zurück zu verlinken, wenn sie damit einverstanden sind, zu dir zu verlinken; Linkaufbau für Ressourcenseiten- zeige ihnen eine gute Quelle, die zu ihrer bestehenden Liste passt; Linkaufbau mit Broken Links — hilf ihnen, einen “toten” Link auf ihrer Seite zu reparieren; Linkaufbau mit Bildern — bitte darum, für die Verwendung deines Bildes Anerkennung zu erhalten; Unverlinkte Erwähnungen- bitte darum, die Erwähnung deiner Marke mit einem Klick zu versehen; Link Moves — bitte darum, Änderungen an einem bestehenden Link vorzunehmen; HARO(& Journalisten-Anfragen) — stelle ein “Expertenzitat” für deren Artikel zur Verfügung; PR- stelle eine reißerische Story zur Verfügung, über die sie berichten können;All diese Strategien scheinen ziemlich aufregend zu sein, oder? Doch sobald du deine erste E‑Mail-Anfrage verschickst, wirst du wahrscheinlich mit der harten Realität konfrontiert werden — dein “zwingender Grund” ist nicht zwingend genug:Dein Gastbeitrag ist nicht gut genug;Deine Quelle ist nicht einzigartig genug;Dein “Skyscraper” ist nicht “hoch” genug;usw.Du siehst, damit diese Linkaufbau-Techniken effektiv sind, musst du eine wirklich außergewöhnliche Seite erstellen, auf die die Leute natürlich verlinken wollen, oder du verfügst über eine große Autorität und Glaubwürdigkeit in deinem Bereich, was helfen könnte, die mangelnde Bekanntheit deiner Seite zu kompensieren.Ein Kommentar zu unserer Linkaufbau-Fallstudie, in dem es heißt, dass es einfacher ist, Leute um Links zu bitten, wenn man eine weltweit anerkannte Marke ist.In Anbetracht dessen, wie schwer es ist, beliebige Leute dazu zu überreden, einen Link zu dir zu setzen, haben viele SEOs nach Möglichkeiten gesucht, den Deal “schmackhaft” zu machen:Biete an, ihren Content auf Twitter & Facebook zu teilen;Biete an, ihren Content in einem E‑Mail-Newsletter zu bewerben;Biete kostenlosen Zugang zu einem Premium-Produkt oder ‑Dienst an;Biete einen Link im Gegenzug an;Biete Geld.Das Anbieten dieser Arten von “Zusatzleistungen” bringt uns jedoch in die Grauzone dessen, was nach den Google-Richtlinien als “Linktauschprogramme” (Link Schemes) gilt:Und da haben wir es. Die legitimen Wege, um Links zu bitten, haben eine eher geringe Erfolgsquote, aber sobald man versucht, den “Deal attraktiver zu gestalten”, betritt man das Minenfeld von Google.An dieser Stelle mag es so aussehen, als würde ich dir davon abraten, die in dieser Kategorie aufgeführten Techniken und Strategien zu verwenden. Das tue ich nicht. Ich versuche nur, die richtige Erwartungshaltung zu wecken, damit du nicht aufgibst, nachdem du deine zehnte Outreach-E-Mail gesendet und keine Antwort erhalten hast. Es ist wirklich ein großer Aufwand, mit diesen Methoden Links zu erhalten und dabei nicht gegen die Richtlinien von Google zu verstoßen.Ich möchte dir einen coolen “Hack” verraten, den ich von Adam Enfroygelernt habe, während ich für diesen Leitfaden recherchiert habe. Bevor er sich mit Pat Flynn in Verbindung setzte, verlinkte Adam auf seine Website von mindestens zehn Gastbeiträgen aus, die Adam für beliebte Blogs schrieb (was er beiläufig in seiner Outreach-E-Mail erwähnte).“Pay it forward” (einen erhaltenen Gefallen in Form einer guten Tat an jemand anderen zurückzuzahlen) ist eine gute Beschreibung dessen, was er hier tat. Adam ist nicht mit der Frage herangetreten: “Würden Sie mich im SPI-Podcast interviewen, wenn ich zehn hochwertige Links für Sie aufbaue?” Er tat es einfach und baute zehn hochwertige Links für Pat auf, unabhängig vom Resultat.Lange Rede, kurzer Sinn: Adam hat ein Interview beim SPI-Podcast bekommen. Und ich bin mir sicher, dass “paying it forward” dabei eine Rolle gespielt hat.3. Links kaufenUm es gleich vorweg zu nehmen: Wir raten davon ab, Links zu kaufen!Im besten Fall verschwendest du viel Geld für schlechte Links, die keinen Einfluss auf dein Ranking haben, im schlimmsten Fall wird deine Website abgestraft.Allerdings würden wir dich benachteiligen, wenn wir die Tatsache verschweigen würden, dass viele Leute in der SEO-Branche Links auf alle möglichen Arten “kaufen” und damit davonkommen.Das heißt, wir werden dir nicht beibringen, wie man auf sichere Art und Weise Links kauft, sondern dich über einige der riskantesten Wege aufklären, dies zu tun.Private Blog-NetzwerkeAuch bekannt als PBNs, handelt es sich dabei um Gruppen von Websites, die mit einem einzigen Ziel erstellt und betrieben werden: um eine Quelle für Links zu sein.Links von PBNs funktionieren in einigen Nischen immer noch gut. In den letzten Jahren haben wir aber gesehen, dass einige der lautstarken PBN-Verfechter allmählich davon abrücken, sie zu nutzen. Es ist so riskant geworden, dass es sich nicht mehr lohnt.Wenn dir also jemand anbietet, Links von einem PBN zu kaufen (oder ein privates PBN für dich aufzubauen), solltest du “Nein” sagen.FiverrEs gibt hunderte von Aufträgen auf Fiverr, die dir “natürliche, redaktionelle, kontextbezogene, hochautorisierte, White Hat”-Links anbieten. Sie geben dir alle möglichen Garantien, dass diese Links legitim sind und deine Website in kürzester Zeit an die Spitze von Google katapultieren werden.Vermeide sie. Selbst wenn dein Freund sie ausprobiert hat und es funktioniert hat. Die besten Linkaufbau-Agenturen verkaufen ihre Dienste nicht auf Fiverr.SPAM von Link-VerkäufernWenn du eine Website besitzt und dort deine Kontaktdaten angegeben hast, wirst du früher oder später E‑Mails mit Angeboten zum Linkkauf erhalten. Wie diese hier:Wenn dir das Wohl deiner Website auch nur ein bisschen am Herzen liegt, kaufe keine Links von diesen Leuten. Markiere diese E‑Mails einfach als “SPAM” und lass es gut sein.Nebenbei bemerkt. Es kann sein, dass du auch E‑Mail-Anfragen von seriösen Linkaufbau-Agenturen bekommst, die nur mit sicheren White-Hat-Strategien Links aufbauen. Ich bin mir aber sicher, dass du in der Lage sein wirst, eine legitime SEO-Agentur von einem “spammy” Link-Verkäufer zu unterscheiden.Alles in allem ist der Linkkauf unter SEOs ziemlich verbreitet, obwohl der Ausmaß weitgehend von der Branche abhängt, in der du tätig bist. Doch selbst wenn deine Mitbewerber für Links bezahlen, musst du nicht unbedingt nachziehen. Du musst nicht gegen die Richtlinien von Google verstoßen, um gut zu ranken und Search Traffic zu erzielen.4. Links verdienenDu “verdienst” Links, wenn andere Leute auf die Seiten auf deiner Website verlinken, ohne dass du sie darum bitten musst. Das passiert natürlich nur, wenn du über etwas wirklich Außergewöhnliches verfügst, das andere Website-Besitzer unbedingt auf ihrer Website erwähnen möchten.Doch Leute können nicht auf Dinge verlinken, von denen sie nicht wissen, dass sie existieren. Also, egal wie toll deine Seite ist, du musst darin investieren, sie zu bewerben. Je mehr Leute deine Seite sehen, desto höher ist die Wahrscheinlichkeit, dass einige von ihnen darauf verlinken werden.Hier sind ein paar Techniken und Strategien, die in diese Kategorie fallen: Linkbait (or verlinkbare Assets); Datenstudien, Infografiken, Stadt-/Landkarten, Umfragen, Auszeichnungen; Podcasts / Interviews / Experten-Roundups; Content Promotion;etc.Links zu verdienen ist wohl die einfachste und effektivste Methode, um sie zu bekommen.Ich ziehe es vor, meine Zeit und mein Geld in die Erstellung wertvoller Seiten zu investieren, die Mundpropaganda generieren und auf natürliche Weise Links erhalten, anstatt an einer Abfolge von Arbeitsabläufen von entmutigenden Link-Prospecting- und E‑Mail-Aktionen zu arbeiten in der Hoffnung, Links zu einer mittelmäßigen Seite aufzubauen.Nimm genau diesen Blog als Beispiel. Drei von fünf unserer am häufigsten verlinkten Artikel (die Homepage ausgenommen) sind Datenforschungsstudien (d.h. Linkbait):Die am häufigsten verlinkten Artikel auf dem Blog von Ahrefs viaSite Explorer.Man könnte meinen, dass es für Ahrefs ein Kinderspiel ist, den natürlichen Linkaufbau mit Linkbait zu befürworten, da wir über Folgendes verfügen:Eine hohe Anzahl an firmeneigenen Daten, die wir für Forschungsstudien nutzen können;Ein Team aus qualifizierten Fachleuten, die uns helfen können, wertvolle Ressourcen zu erstellen;Eine vertrauenswürdige Marke, die unserer gesamten Arbeit automatisch Glaubwürdigkeit verleiht;Ein ziemlich große Zielgruppe, bei der wir für unsere Inhalte bewerben können (und die Mundpropaganda ankurbeln).Obwohl diese Dinge uns enorm helfen, ist keines von ihnen eine Voraussetzung dafür, um Links zu verdienen. Jeder kann bemerkenswerte Inhalte erstellen und Links verdienen, wenn er Leidenschaft für das Thema und ein bisschen Entschlossenheit hat.Im Jahr 2015 habe ich Dutzende von Stunden damit verbracht, 500 Blogger über den “ROI von Guest Blogging” zu befragen. Ich habe diese “Forschung” dann auf meinem persönlichen Blog veröffentlicht und sie generierte Links von über hundert Websites. Das waren doppelt so viele Links wie mein meistverlinkter Artikel zu der Zeit.Diese Anzahl von Links mag für dich nicht beeindruckend klingen, aber für mich war es damals ein großer Erfolg — als alleiniger Blogger ohne eine große Marke, ein großes Publikum oder ein großes Budget.Doch was ist, wenn du Schwierigkeiten hast, Ideen für verlinkbare Assets zu finden, die das Interesse von Leuten in deiner Branche wecken und dir natürliche Links einbringen? Oder was ist, wenn du eine Linkbait-Idee von jemand anderem kopiert hast und sie nicht erfolgreich war?In diesem Fall lohnt es sich, Zeit darauf zu verwenden, dein Branchenwissen auszubauen, um ein besseres Verständnis dafür zu bekommen, was die Leute begeistern könnte. Verschwende deine Zeit nicht mit der Suche nach magischen Linkaufbau-Strategien, um Links zu langweiligem Content aufzubauen. Das wird nicht funktionieren.5. Links bewahren Wie der Name schon sagt, konzentriert sich diese letzte Kategorie von Techniken darauf, alle deine hart verdienten Links zu bewahren. Man könnte meinen, dass es nicht als “Linkaufbau” bezeichnet werden kann, wenn man verlorene Links wieder aufleben lässt. Doch wie man so schön sagt, “Kleinvieh macht auch Mist”.Es gibt nur zwei Möglichkeiten, Links zu bewahren: Link-Reklamation; Reparieren von 404-Seiten, die Links enthalten.Gehen wir beide Möglichkeiten kurz durch.Link-ReklamationLinks halten nicht ewig. Die Seite, die auf dich verlinkt, könnte aktualisiert, de-indexiert oder gelöscht werden. Infolgedessen könnte dein Link von dieser Seite nicht mehr existieren.Ein verlorener Link zu unserem Blogartikel, gefunden über denSite Explorer.Aus diesem Grund solltest du dein Linkprofil im Auge behalten und dich benachrichtigen lassen, wenn einer deiner Links verschwindet. Auf diese Weise kannst du dich an den Websitebetreiber wenden und versuchen, deinen Link wiederherstellen zu lassen.Reparieren von 404-Seiten, die Links enthaltenDie Seiten auf deiner eigenen Website können ebenso verschwinden. Ob absichtlich oder aus Versehen, einige deiner Seiten könnten am Ende gelöscht werden. Da Links, die auf eine 404-Seiteverweisen, keinen SEO-Wert für deine Website besitzen, solltest du das Problem beheben. Um deine 404 Seiten mit Verlinkung zu finden, öffne den “Best by links” Bericht im Site Explorer und wende den “404 not found” Filter an: Sieht so aus, als hätten wir eine Vielzahl von toten Artikeln mit externen Backlinks auf dem Ahrefs-Blog.Alles, was du von hier aus tun musst, ist, die Seiten entweder wiederherzustellen oder sie per 301-Redirect auf die relevantesten Seiten deiner Website umzuleiten.Wichtiger HinweisEs gibt tatsächlich einige Hinweise darauf, dass Google einen gewissen Teil des Wertes eines Links an eine Seite weitergibt, auch nachdem dieser Link nicht mehr existiert. Dieses Phänomen ist als “Link-Echos” oder “Link-Ghosts” bekannt und es hält die Leute im Wesentlichen davon ab, ihre verlorenen Links zu überwachen. Hier ist unser Standpunkt zu diesem Thema. Wenn du einen wichtigen Link verloren hast, der Besucher auf deine Website gebracht hat oder als eine Form von “Social Proof” diente, solltest du unbedingt versuchen, ihn wiederherzustellen. In den meisten anderen Fällen solltest du deine Zeit aber lieber damit verbringen, neue Links zu akquirieren, als die alten zu bewahren.Wie man schnell eine Linkaufbau-Kampagne startetLeitfaden für die Kontaktaufnahme mit Bloggern9 Tipps für die KontaktaufnahmeWas kostet es, Links zu kaufen?Part 3Was macht einen guten Link aus?Du hast also gerade eine Menge verschiedener Möglichkeiten kennengelernt, um Links zu deiner Website aufzubauen. Doch was du bedenken musst, ist, dass Backlinks ein Mittel zum Zweck sind. Du baust sie auf, weil Links als “Votes” fungieren und Google dabei helfen, die wertvollsten Seiten zu identifizieren, die in den Suchergebnissen weit oben ranken.Allerdings sind nicht alle “Votes” gleich.Niemand weiß mit Sicherheit, wie Google den Wert der einzelnen Links genau misst. Es gibt jedoch einige allgemeine Konzepte für die Bewertung von Links, von denen die SEO-Gemeinschaft glaubt, dass sie wahr sind.AutoritätRelevanzAnkertextNofollow vs followPlatzierungZielort1. AutoritätStell dir vor, dass dein Freund gerade einen Blog gestartet hat und in einem seiner letzten Artikel auf deine Website verlinkt. Das ist doch keine große Sache, oder?Was wäre aber, wenn die New York Times einen Artikel veröffentlicht, der auf deine Website verlinkt? Das wäre sicherlich etwas, auf das du stolz sein kannst.Der Punkt ist, dass wir diesen beiden Websites ein unterschiedliches Maß an “Autorität” zuschreiben. Die New York Times ist eine weltbekannte Zeitung, der Millionen von Menschen rund um den Globus vertrauen. Der neue Blog deines Freundes hingegen verzeichnet so gut wie keine Besucher.Wie also misst Google die “Autorität” einer Website (oder einer Webseite), die auf dich verlinkt? Nun, wenn Links als Votes gelten, dann wäre es doch fair, wenn eine Seite, die mehr Votes hat, eine stärkere Stimme an andere Seiten abgeben würde, oder?Und das ist tatsächlich eines der Grundprinzipien hinter dem PageRank-Algorithmus, den die Google-Gründer Larry Page und Sergey Brin bereits 1996 konzipiert haben.Früher gab es auch ein Browser-Plugin, das den PageRank-Score einer beliebigen Webseite auf einer Skala von 0 bis 10 anzeigte. Doch irgendwann um das Jahr 2014 herum stellte Google es ein und ließ die SEO-Community im Unklaren darüber, wie viel “Autorität” sie jeder Webseite zuordnen.Glücklicherweise haben viele SEO-Tool-Anbieter ihre eigenen Link-basierten Autoritätsmetriken entwickelt, die auf einigen der gleichen Prinzipien basieren, die im ursprünglichen PageRank-Algorithmus verwendet wurden.Die Autoritätsmetriken, die wir hier bei Ahrefs haben, sind Domain Rating (DR) und URL Rating (UR). Beide werden auf einer Skala von 0 bis 100 gemessen.UR- und DR-Metriken der Ahrefs-Homepage über denSite Explorer.Das URL-Rating unserer Homepage liegt bei 87, was bedeutet, dass es sich um eine Seite mit hoher Autorität handelt. Das Domain Rating der ahrefs.com-Domain liegt bei 90, was als sehr hoch angesehen wird (nytimes.com hat DR 94).Nebenbei bemerkt. Nebenbei bemerkt: Einige SEO-Profis berücksichtigen auch den Search-Traffic einer Website, um ihre “Autorität” zu messen. Die Logik ist einfach: Wenn Google eine Website ganz oben in den Suchergebnissen rankt und ihr Traffic liefert, dann erachten sie die Website wahrscheinlich als eine, die eine hohe Autorität besitzt.In der Regel bemühen sich SEO-Profis darum, Links von Websites und Seiten mit hoher Autorität zu erhalten, da diese Links mit größerer Wahrscheinlichkeit dazu beitragen, dass ihre eigenen Seiten bei Google besser ranken.Bedeutet das aber, dass du es vermeiden solltest, Links von Websites und Seiten mit niedriger Autorität zu bekommen? Ganz und gar nicht. Diese Links sind in keiner Weise “schlecht”. Sie haben nur weniger “Gewicht” in den Augen von Google und haben daher weniger Einfluss auf deine Rankings.Beim Linkaufbau solltest du die Link-Autoritätsmetriken nutzen, um abzuschätzen, wie viel Aufwand du betreiben solltest, um einen Link von einer bestimmten Website zu bekommen.Wenn dein Freund dich bittet, einen gut recherchierten, 10.000 Wörter langen Artikel für seinen neuen Blog (DR10) zu schreiben, ist der Link, den du am Ende bekommst, den Aufwand nicht wirklich wert. Solltest du aber die Chance bekommen, den gleichen Artikel für die NY Times zu schreiben (DR94), solltest du das unbedingt tun.Eine letzte Sache. Einige Leute sind ein wenig zu sehr von ihren eigenen Link-Autoritätsmetriken besessen. Das geht so weit, dass sie unserem Support-Team Fragen wie diese stellen:Wenn man Links aufbaut, “um UR zu erhöhen”, verfolgt man das falsche Ziel. Man sollte Links mit dem Ziel aufbauen, bei Google besser zu ranken. Besser noch, man sollte Links aufbauen, um Besuchern anderer Websites zu helfen, die eigene Website zu entdecken.2. RelevanzNehmen wir an, du besitzt einen Blog rund um Kaffee und veröffentlichst einen Erfahrungsbericht über deine Lieblingskaffeemühle. Später beschließen zwei deiner Freunde, darauf zu verlinken. Einer von seinem Artikel “Die 10 besten Kaffeerezepte” und der andere von seinem Artikel “10 Tipps zum Geldsparen”.Welche der beiden Seiten würde in den Augen von Google ein stärkeres Vote erhalten (da beide Seiten die gleiche Autorität haben)?Die relevantere Seite!Du würdest lieber einen Kaffeetipp von einem anderen Feinschmecker bekommen, als von einem Finanzexperten, richtig?SEO-Profis glauben, dass Relevanz auch auf der Website-Ebene gilt. Tatsächlich gibt es einige Beweise dafür auf der Seite “Wie die Suche funktioniert” von Google: Wenn andere prominente Websites zu diesem Thema auf die Seite verlinken, ist das ein gutes Zeichen dafür, dass die Informationen von hoher Qualität sind.Das bedeutet, dass du dich bemühen solltest, Links von Websites zu erhalten, die in irgendeiner Weise relevant für deine sind, anstatt jeder einzelnen Link-Gelegenheit nachzugehen, die sich dir bietet.3. AnkertextNur für den Fall, dass du mit dem Begriff noch nicht vertraut bist: “Ankertext” ist ein anklickbarer Textauszug, der dich auf eine andere Seite leitet.In vielen Fällen beschreibt der Ankertext, worum es auf der verlinkten Seite geht. Schau dir einfach den Ankertext meines Links von weiter oben an:Es ist also keine Überraschung, dass Google die Wörter im Ankertext verwendet, um besser zu verstehen, für welche Keywords die verlinkte Seite es verdient, zu ranken. Tatsächlich spricht das ursprüngliche Patent von Google ganz explizit darüber: […] Google setzt eine Reihe von Techniken ein, um die Suchqualität zu verbessern, einschließlich Page Rank, Ankertext und Proximity-Informationen.Wie setzt man den Ankertext also wirksam beim Linkaufbau ein?Nun, gar nicht. Je mehr du versuchst, zu kontrollieren, wie verschiedene Seiten auf dich verlinken und alle “richtigen Wörter” in die Ankertexte deiner Backlinks reinzuzwängen, desto höher ist die Wahrscheinlichkeit, dass Google dich dafür abstrafen wird.Außerdem hast du bei den meisten White-Hat-Linkaufbau-Techniken wenig bis gar keine Kontrolle über den Ankertext, was dich nur davor bewahrt, dir selbst ins Bein zu schießen.4. Nofollow vs. Follow“Nofollow” ist ein Link-Attribut, das Google mitteilt, dass die verlinkende Seite ihr Vote lieber nicht an die Seite geben möchte, auf die sie verweist.Hier siehst du, wie dieses Link-Attribut im HTML-Code aussieht:In der Vergangenheit hat Google die Votes von “nofollow-Links“ ’ nicht gezählt (so hieß es zumindest). Im Jahr 2019 wurde dann auf ein Hinweis-Modell umgestellt, was bedeutet, dass einige “nofollow”-Links nun deine Such-Rankings beeinflussen können.Mit dieser Ankündigung führten sie auch zwei neue Link-Attribute ein: rel=“UGC” — soll auf “nutzergenerierte” Links angewendet werden, z. B. Blog-Kommentare und Forenbeiträge. rel=“sponsored” — soll angewendet werden, wenn der Link Teil einer Werbung, eines Sponsorings oder einer sonstigen Entschädigungsvereinbarung ist.Als allgemeine Regel gilt, dass du “follow”-Links aufbauen solltest (d.h. Links, die keines der oben genannten Attribute haben), weil diese diejenigen sind, die Votes abgeben sollten.Wenn du jedoch eine Möglichkeit siehst, einen “nofollow”-Link von einer relevanten Seite mit hoher Autorität zu bekommen, solltest du das unbedingt tun.Ein gutes Beispiel ist Wikipedia, wo alle ausgehenden Links “nofollow” sind. Einen Link von Wikipedia zu bekommen ist unglaublich schwer, weshalb viele SEOs davon überzeugt sind, dass diese Links in den Augen von Google ziemlich wertvoll sind.5. PlatzierungGoogles Reasonable Surfer Patentbesagt, dass die Wahrscheinlichkeit, dass ein Link angeklickt wird, einen Einfluss darauf haben kann, wie viel Autorität er überträgt. Die Platzierung eines Links auf einer Seite ist eines der wenigen Dinge, die seine CTR beeinflussen können. Nehmen wir an, es gibt eine Webseite, die aus drei Blöcken besteht: Inhalt, Seitenleiste und Fußzeile. In der Regel werden Links im Inhalt mehr Klicks erhalten, da der Inhaltsblock die meiste Aufmerksamkeit der Besucher erhält.Eine weitere Sache, die die CTR eines Links beeinflussen kann, ist, wie weit oben auf der Seite er erscheint. Leser folgen eher Links, die ganz am Anfang des Artikels stehen, als denen, die ganz am Ende des Artikels stehen.Je mehr Links du schließlich auf der Seite hast, desto mehr werden sie miteinander um Klicks wetteifern und somit die Autorität, die auf andere Seiten übertragen wird, schwächen.Genau wie beim Ankertext hast du bei den meisten White-Hat-Linkaufbau-Strategien wenig bis keine Kontrolle über die Platzierung des Links.Wenn du aber einen Gastbeitrag für den Blog eines anderen schreibst, solltest du auf jeden Fall versuchen, die Leser dazu zu verleiten, auf deine Links zu klicken. Nicht nur, um den SEO-Wert dieser Links zu erhöhen, sondern auch, weil du dadurch einiges an Referral Traffic bekommst.6. ZielortWenn du Links zu deiner Website aufbaust, gibt es drei Zielorte, zu denen du sie verweisen kannst:Deine Homepage;Deine verlinkbaren Assets;Die Seiten, die du tatsächlich brauchst, um bei Google gut zu ranken.Und ziemlich oft sind die Seiten, die du brauchst, um gut zu ranken, auch die, für die man am schwersten Links bekommt. Das liegt daran, dass Leute es vorziehen, auf Informationsseiten zu verlinken, wo die Besucher einen kostenlosen Mehrwert geboten bekommen, anstatt auf kommerzielle Seiten, wo die Besucher wahrscheinlich bereit sind, ihr Geld auszugeben.Daher ist eine der häufigsten Fragen in der SEO:“Wie schafft man es, langweilige Seiten zu ranken?”Obwohl es keine einzig richtige Antwort auf diese Frage gibt, sind sich alle einig, dass du die Kraft von internen Verlinkungen nutzen solltest, um deinen “langweiligen Seiten” zu einem besseren Ranking zu verhelfen. Mit anderen Worten: Baue so viele Links wie möglich zu deinen verlinkbaren Assets auf und leite den ganzen “Link-Saft” über interne Links zu den Seiten, die du eigentlich ranken willst.Denke daran, dass Dinge wie Platzierung, Relevanz und Ankertext auch den Wert deiner internen Links beeinflussen.Google PageRank-LeitfadenAnkertext-LeitfadenNofollow vs. Follow LinksWie man die Autorität einer Website erhöhtPart 4Die besten Linkaufbau-TechnikenIn Kapitel zwei hast du eine ganze Reihe verschiedener Linkaufbau-Strategien kennengelernt. Schauen wir uns jetzt ein paar umsetzbare Linkaufbau-Techniken an.Die Links der Mitbewerber aufgreifenVerlinkbare Assets erstellenContent-PromotionGuest Blogging1. Die Links der Mitbewerber aufgreifenDie Recherche von Mitbewerber-Links ist eine der grundlegendsten Aktivitäten zum Aufbau von Links. Stell dir vor, die am besten rankende Seite für deine gewünschte Suchanfrage verfügt über all die richtigen Links, die Google von ihrer Überlegenheit überzeugt haben. Indem du ihre Links analysierst, kannst du herausfinden, welche Maßnahmen du ergreifen musst, um ähnliche Links zu erhalten und diese Seite zu übertreffen.Und an dieser Stelle ist ein SEO-Tool wie Ahrefs unverzichtbar.Gib einfach das Keyword, für das du ranken willst, in den Keywords Explorer ein und scrolle runter zur “SERP Overview” (“SERP-Übersicht”). Dort wird dir angezeigt, wie viele Backlinks (und verlinkende Websites) jede der am besten rankenden Seiten hat. Anzahl der Backlinks und verlinkenden Websites zu jeder Top-Ranking-Seite für “best productivity apps” (“beste Produktivitäts-Apps”).Klicke auf eine dieser Zahlen und du erhältst einen Bericht, der alle Links auflistet:Ab hier ist deine Vorgehensweise zweigeteilt:Versuche, Links von den Seiten zu bekommen, die auf deine Mitbewerber verlinken;Untersuche, wie diese Links akquiriert wurden und nutze die Erkenntnisse, um andere ähnliche Seiten zu finden, von denen du Links erhalten kannst.Lass mich das anhand eines kurzen Beispiels erklären.Eine Suchanfrage, für die wir ranken wollen, ist “SEO”. Derzeit ist das #1 Suchergebnis für diese Suchanfrage Moz’s Beginner’s Guide, der fast 300.000 Backlinks von über 11.000 Websites aufweist:Nachdem ich ihre Liste der Backlinks nach dem Search Traffic der verlinkenden Seite sortiert hatte, fand ich einen Artikel mit dem Titel “How To Learn Digital Marketing Skills (a Beginners Guide)”, der auf sie verlinkt:Basierend auf dem Kontext des Links, der in der Spalte “Anker und Backlink” angezeigt wird, könnte ich den Autor dieses Artikels kontaktieren und ihm anbieten, auf Ahrefs eigenen Anfängerleitfaden für SEO zu verweisen, damit seine Leser mehr Quellen haben, um SEO zu lernen.Was ich als nächstes tun kann, ist, andere Artikel zum Thema “Digitales Marketing lernen” zu finden, denn jetzt weiß ich, dass solche Seiten einen relevanten Platz bieten, um auf unseren Anfängerleitfaden für SEO zu verweisen.Ich öffne also den Content Explorer und suche nach Seiten, die “digitales Marketing lernen” im Titel haben. Das ergibt über 1.700 Seiten, die meinen Kriterien entsprechen: Ich würde dann diese Seiten eine nach der anderen öffnen und nach einer Stelle suchen, an der es sinnvoll sein könnte, dem Autor vorzuschlagen, unseren Anfängerleitfaden für SEO als wertvolle Ressource für sein Publikum zu referenzieren.Das ist im Wesentlichen der Grund, warum du die Backlinks deiner Mitbewerber untersuchen solltest und die Erkenntnisse dazu nutzen solltest, Links zu deinen eigenen Seiten aufzubauen.Eine weitere beliebte Methode bei der Nachkonstruktion der Links deiner Mitbewerber ist es, deren verlinkbare Assets zu untersuchen. Um das zu tun, gib einfach deren Domain-Namen in das Site Explorer-Tool von Ahrefs ein und öffne den Bericht “Best by links”. Dieser zeigt direkt an, welche ihrer Seiten die meisten Links erhalten haben. Die am häufigsten verlinkten Seiten auf dem Ahrefs-Blog via Site Explorer.Wie du auf dem Screenshot oben sehen kannst, sind drei der fünf am häufigsten verlinkten Seiten auf dem Ahrefs-Blog (mit Ausnahme der Homepage) datengetriebene Forschungsstudien. Das gibt dir eine ziemlich gute Vorstellung von der Art des Inhalts, der in unserer Branche Links anzieht.In deiner eigenen Nische könnte eine ganz andere Art von verlinkbarem Asset vorherrschend sein — Infografiken, Online-Tools, Umfragen, Ego-Bait, etc. Deine Aufgabe ist es, herauszufinden, was es ist und dieses Wissen zu nutzen, um verlinkbare Inhalte für deine eigene Website zu erstellen.Ein letzter Tipp, den ich dir in diesem Abschnitt mitgeben möchte, ist, die Homepage-Links deiner Mitbewerber zu untersuchen. Wenn eine Seite auf die Homepage deines Mitbewerbers verlinkt, stehen die Chancen gut, dass du sie davon überzeugen kannst, auch auf dich zu verlinken.Hier ist ein Beispiel für eine Link-Möglichkeit, die ich in weniger als sechzig Sekunden entdeckt habe, indem ich die Homepage-Links von einem unserer Mitbewerber durchsucht habe:Moz hat einen Link von einem Blogbeitrag erhalten, in dem Quellen zum Erlernen von SEO genannt werden. Es wäre ziemlich naheliegend, den Autor dieses Artikels zu kontaktieren und ihn zu bitten, Ahrefs in diese Liste aufzunehmen, wenn man bedenkt, wie viele kostenlose Lernmaterialien zum Thema SEO wir bis heute veröffentlicht haben.Bitte versteh mich hier nicht falsch. Ich behaupte nicht, dass eines dieser Beispiele ein todsicherer Weg ist, um einen Link zu bekommen. Sie sind lediglich sinnvolle Link-Möglichkeiten, die man anstreben sollte.2. Verlinkbare Assets erstellenEs ist möglich, mit genügend Willenskraft und Entschlossenheit Links zu jeder Seite aufzubauen, aber es ist einfacher, wenn du etwas hast, zu dem die Leute tatsächlich verlinken wollen.Wenn man über verlinkbare Assets spricht, neigen die Leute dazu, an sehr spezifische Dinge zu denken wie: Online-Tools und ‑Rechner;Infografiken, GIFografiken & “Map-o-Grafiken;”Auszeichnungen & Rankings;Studien & Untersuchungen;“How to”-Anleitungen & Tutorials;Definitionen & neue Begriffe;Allerdings würde ich argumentieren, dass das Konzept der “verlinkbaren Assets” flexibler gestaltet werden sollte hinsichtlich dessen, was als solche qualifiziert werden kann. Ich bin der Meinung, dass eine einzelne Idee aus deinem Artikel Leute dazu motivieren kann, darauf zu verlinken, genauso wie die bloße Existenz deines Unternehmens oder seiner Produkte.Als Beispiel für Ersteres sind hier zwei Links, die wir zu unserem Leitfaden über Long-Tail-Keywords erhalten haben:Jeder Link verweist auf einen anderen Teil des gleichen Artikels, was beide Teile zu eigenständigen “verlinkbaren Assets” macht:Die Idee, dass Long-Tail-Keywords nicht durch ihre Länge definiert werden, sondern durch ihre Beliebtheit;Eine Statistik, die wir aus unserer internen Studie abgeleitet haben.Und hier sind zwei weitere Beispiele, in denen jemand auf Ahrefs als Unternehmen verweist und ein anderer auf eines unserer Produkte verlinkt:Wir haben um keinen dieser Links in irgendeiner Weise gebeten. Diese Leute haben ihre eigenen redaktionellen Entscheidungen getroffen, auf uns zu verlinken, motiviert durch den Wert, den diese Verweise für ihre Leser haben:Um mehr über ein (etwas verwirrendes) Konzept zu erfahren;Um die Quelle einer interessanten Statistik zu ergründen;Um ein Beispiel für ein produktgesteuertes Unternehmen zu sehen;Um ein nützliches Produkt zu erkunden.Daher solltest du nicht überstürzt Kalkulationen entwickeln, Infografiken gestalten oder Umfragen durchführen, um Backlinks für deine Website zu gewinnen. Nimm dir einen Moment Zeit, um einen Schritt zurückzutreten und zu überprüfen, was du bereits hast und ob du es auf eine Weise “neu verpacken” kannst, die es bemerkenswerter macht: Was zeichnet dein Unternehmen aus? Wird das auf deiner Homepage erwähnt? Sind deine Produkte irgendwie einzigartig? Hast du für jedes Produkt eine eigene Seite, die dessen Einzigartigkeit und Nutzen erklärt? Hast du bahnbrechende Ideen für deine Branche? Werden diese Ideen in deinem Content richtig vermittelt? Wie flüssig ist dein Text insgesamt?Die Chancen stehen gut, dass es viele Möglichkeiten gibt, deine bestehenden Seiten zu verbessern und sie linkwürdiger zu machen, bevor du Zeit und Mühe in die Erstellung von “Linkbait” investierst.Doch was wäre, wenn du die Aufgabe hättest, ein brandneues verlinkbares Asset für eine Website zu erstellen? Wie stellst du sicher, dass das, was du erstellst, erfolgreich sein wird?Nun, wie ich bereits im vorherigen Abschnitt erläutert habe, solltest du damit beginnen, die verlinkbaren Assets deiner Mitbewerber zu analysieren und herauszufinden, was sie erfolgreich gemacht hat. Du solltest auch die bewährten Formate für verlinkbare Assets überprüfen und schauen, ob eines von ihnen gut zu deiner Situation passen würde. Doch die Recherche ist der einfache Teil. Sobald du dich mit einer vielversprechenden Idee zufrieden gibst, kommt es auf die Ausführung an. Das würde allerdings den Rahmen dieser “Anleitung für Einsteiger” sprengen.3. Content-PromotionEgal wie “verlinkbar” deine Seiten sind, die Leute können nicht auf sie verlinken, ohne sie vorher zu entdecken. Mit anderen Worten, selbst die besten verlinkbaren Inhalte müssen beworben werden, um Links anzuziehen.Im Allgemeinen gibt es nur drei Möglichkeiten, um Content zu bewerben:Werbung;Outreach;Communities.WerbungDas klingt ziemlich einfach, oder? Du kannst Geld an Google, Facebook und Twitter zahlen, um Besucher auf deine Seite zu bekommen. Du kannst auch so ziemlich jede Website kontaktieren, auf der sich dein Publikum aufhält, und mit ihnen einen Werbedeal abschließen.Je größer die Anzahl der Personen ist, die du durch die Bewerbung deines Contents erreichst, desto höher ist die Wahrscheinlichkeit, dass jemand auf deine Seite verlinkt.Allerdings gibt es ein Problem. Es ist fast unmöglich, die erhaltenen Links den von dir investierten Werbegeldern zuzuordnen (auch wenn wir es versucht haben).Es ist also nicht so, dass du deinem Chef zehn hochwertige Links zu einer Seite versprechen kannst, wenn er sich bereit erklärt, 1.000 Euro in Facebook-Werbeanzeigen zu investieren.Doch die Seite, zu der du Links erhalten möchtest, hat wahrscheinlich auch einen Geschäftszweck, richtig?Hier sind drei häufige Gründe, warum Unternehmen in die Erstellung von Content investieren:Um Leads zu bekommen und ihr Publikum zu erweitern;Um Kunden zu gewinnen und Umsätze zu generieren;Um die Markenbekanntheit zu erhöhen und die Kundenbindung zu verbessern.Wenn dein Content dir bei einem dieser drei Ziele hilft, dann solltest du keine Probleme haben, ein Werbebudget dafür zu rechtfertigen.Und wenn eine bestimmte Seite sich bei keiner dieser Punkte als hilfreich erweist, dann musst du dich fragen, wie du die Zeit und die Ressourcen gerechtfertigt hast, um sie überhaupt zu erstellen.Mit anderen Worten: Links sollten ein Nebenprodukt der Bewerbung deiner Inhalte sein, nicht das Ziel.OutreachOutreach ist wahrscheinlich die beste Möglichkeit, deine Inhalte an die ” Linkarati” zu bringen — Leute, die Websites besitzen und zu dir verlinken können.Ja, diese Leute können wahrscheinlich auch mit Werbung erreicht werden, aber eine gut formulierte persönliche E‑Mail ist viel effektiver, wenn du deine Chancen erhöhen willst, einen Link von ihnen zu bekommen.Es gibt genügend Artikel, die dir zeigen, wie man richtige Outreach-E-Mails schreibt. Auch ich habe meine Gedanken zu diesem Thema hier auf dem Ahrefs Blog geteilt. Wenn ich aber nur einen einzigen Outreach-Tipp geben könnte, dann wäre es dieser: Anstatt jemanden unverfroren aufzufordern, sich mit dir zu verlinken, versuche, ihn mit deinen Inhalten zu beeindrucken und ihn dazu zu bringen, sich diese anzuschauen.Du solltest ihnen auf elegante Weise eine einzigartige Idee aus deinem Inhalt in den Kopf setzen, damit sie ihn in einem kommenden Artikel erwähnen wollen — so wie ich es hier gemacht habe, als ich versuchte, meine kleine Forschungsstudie zu bewerben:Erstkontakt für einen Link-Outreach.CommunitiesCommunities können großartig sein, um deinen Content bei relevanten Zielgruppen zu bewerben. Egal, in welcher Branche du tätig bist, es gibt wahrscheinlich ein Subreddit, in dem sich Gleichgesinnte treffen, oder vielleicht einige Gruppen auf Facebook, Slack oder Discord. In bestimmten Nischen findest du vielleicht auch eine eigenständige Community-Site.Das Bewerben deines Contents in diesen Communities ist jedoch nicht so einfach, wie es vielleicht scheint. Du kannst nicht einfach einer Community beitreten, deinen Link dort hinterlassen und wieder verschwinden. Du würdest im Handumdrehen verbannt werden.Du musst ein aktives Mitglied dieser Community werden und dir Respekt bei den Mitgliedern verschaffen, bevor du deine Inhalte dort bewerben darfst. Selbst dann solltest du nicht jeden neuen Inhalt, den du erstellst, in dieser Community veröffentlichen, um die Mitglieder nicht zu verärgern und deinen Ruf zu verspielen. Stelle also sicher, dass du dir das nur für deine beste Arbeit vorbehältst.Eine andere Strategie ist es, eine eigene Community aufzubauen, die sich freuen würde, über jeden neuen Inhalt, den du veröffentlichst, benachrichtigt zu werden. Hier bei Ahrefs geben wir den Leuten drei Möglichkeiten, sich mit uns zu verbinden:Uns auf Twitter folgen;Sich für den E‑Mail-Newsletter zu unserem Blog anmelden;Unserer privaten Facebook-Gruppe beitreten..Diese drei “Kanäle” verschaffen unseren neu veröffentlichten Artikeln anfangs eine gewisse Zugkraft. Wir haben allerdings ein paar Jahre gebraucht, um sie aufzubauen.4. Guest BloggingJeder Blogger möchte hochwertigen Content veröffentlichen, der seinem Publikum einen Mehrwert bietet, richtig? Aber das konsequent zu tun, ist eine verdammt große Herausforderung. Das ist einer der Gründe, warum viele Blogbetreiber Gastbeiträge auf ihren Blogs akzeptieren.Guest Blogging ist in der SEO-Welt so populär geworden und wurde in einem so absurden Ausmaß ausgenutzt, dass Matt Cutts, ehemaliger Leiter des Webspam-Teams von Google, im Jahr 2014 bekanntermaßen dessen drohenden Untergang verkündete.“Also Schluss damit: Guest Blogging hat sich erledigt.”Matt Cutts, Former Head of Web Spam, GoogleUnd dennoch, wir schreiben das Jahr 2021 und alle Linkaufbau-Experten, mit denen ich gesprochen habe, halten Guest Blogging immer noch für eine der effektivsten Methoden, um Links aufzubauen.Alles, was du tun musst, um in der Gunst von Google zu bleiben, ist, dir seriöse Blogs auszusuchen und ihnen Inhalte anzubieten, die du auch gerne auf deiner eigenen Website veröffentlichen würdest. Jemandem 10 Euro für einen 500-Wörter-Artikel zu zahlen und ihn bei einem drittklassigen Blog mit null Traffic und Followern zu veröffentlichen, reicht nicht mehr aus.Aber hier ist das Problem: Seriöse Blogs brauchen deine Gastbeiträge nicht. Sie kommen ganz gut alleine zurecht, und genau das macht sie “seriös”.Wie kannst du sie also davon überzeugen, deine Inhalte zu veröffentlichen?Nun, abgesehen davon, dass du tatsächlich etwas Sinnvolles zu sagen hast, gepaart mit etwas Texterfahrung und Geschick, habe ich zwei gute Tipps, die dir helfen sollten.1. Arbeite dich nach oben Es ist unwahrscheinlich, dass die Top-Blogs deiner Branche deinen Pitch ernst nehmen, es sei denn, du kannst eine solide Erfolgsbilanz an veröffentlichten Artikeln auf ähnlichen Blogs vorweisen.Bevor du deinen Artikel also bei dem Blog auf Platz 1 in deiner Nische pitcht, versuche zuerst, dass dieser auf Platz 2 veröffentlicht wird. Und bevor du bei Platz 2 pitcht, versuche, auf Platz 3 veröffentlicht zu werden.Siehst du worauf ich hinaus will? Du musst bei einigen weniger bekannten Blogs in deiner Branche anfangen und dich allmählich nach oben arbeiten.Und wenn du Schwierigkeiten hast, diese weniger bekannten Blogs zu finden, haben wir ein leistungsstarkes Tool, das dir dabei hilft: Content Explorer.Folge einfach drei einfachen Schritten:Suche nach einem Wort oder einer Phrase, die Blogs in deiner Branche wahrscheinlich in ihren Artikeltiteln erwähnen;Setze den Filter “Domain Rating” auf einen Bereich von 30–40;Verwende die Einstellung “Eine Seite pro Domain”, um nur einen Artikel von jedem Blog zu sehen.Wie du auf dem Screenshot oben sehen kannst, liefert die Suche nach dem Wort “Steak” 9.227 Seiten von Websites, die einen DR-Score von 30 bis 40 aufweisen.Jetzt musst du nur noch die Blogs überprüfen, auf denen sie sich befinden, und deine Chancen abschätzen, dort veröffentlicht zu werden. Wenn dir die Blogs zu schwach oder zu stark erscheinen, kannst du den DR-Filter jederzeit anpassen, bis du den idealen Wert an Blog-“Autorität” gefunden hast, bei dem du dich wohl fühlst.Um deine Ergebnisse weiter einzugrenzen, kannst du auch versuchen, den Filter “Website-Traffic” anzuwenden, der dir helfen kann, dich auf Blogs zu konzentrieren, die eine bestimmte Menge an Traffic von Google erhalten (nach Schätzungen von Ahrefs).2. Mache ein unwiderstehliches AngebotWie ich bereits erwähnt habe, möchte jeder Blogger hochwertigen Content veröffentlichen, der für sein Publikum nützlich ist. Je besser also dein Content ist, desto höher sind deine Chancen, dass er veröffentlicht wird.Und doch bekommen die meisten beliebten Blogger jede Woche Dutzende von ähnlichen Angeboten für Gastbeiträge, in denen ihnen “hochwertiger, einzigartiger und wertvoller Content” angeboten wird (der in Wirklichkeit überhaupt nicht gut ist). Wie hebst du dich also von all den anderen ab und erregst die Aufmerksamkeit beliebter Blogger mit deinem Angebot für einen Gastbeitrag?Nun, eine der besten Möglichkeiten, das zu tun, ist, eine “Content-Lücke” zu finden — ein beliebtes Thema, das einem ihrer Mitbewerber viel Search Traffic verschafft, aber auf ihrem eigenen Blog nicht behandelt wird.Hier bei Ahrefs haben wir ein praktisches Tool, das dir hilft, Content-Lücken zwischen Websites zu finden. Es hat einen sehr treffenden Namen: Content Gap.Nehmen wir an, du hast dich entschlossen, Brian Dean einen Gastbeitrag vorzuschlagen. Du könntest dieses Tool nutzen, um herauszufinden, welche Themen dem Ahrefs-Blog viel Search-Traffic einbringen, die Brian noch nicht behandelt hat.Gib die Website von Brian in den Site Explorer ein;Öffne das Content-Gap-Tool;Gib den Blog von Ahrefs als Mitbewerber ein; Drücke “Show keywords” (“Keywords anzeigen”);Suche nach Keywords, die dein Interesse wecken;Klicke auf das V‑förmige Symbol rechts, um den organischen Traffic zu überprüfenUnd da haben wir es. In Sekundenschnelle hast du ein großartiges Thema gefunden, das dem Ahrefs-Blog monatlich 10.000 Besuche verschafft, aber auf dem Backlinko-Blog noch nicht behandelt wurde.Wenn du Brian dieses spezielle Thema pitcht und erklärst, wie sich dein Artikel von anderen abheben würde, werden sich deine Chancen auf eine Veröffentlichung drastisch verbessern, im Vergleich zu einem typischen “Ich kann einen hochwertigen Artikel für dich schreiben”-Gastbeitrags-Pitch.Eine weitere interessante Möglichkeit, sich mit deinem Gastbeitrags-Pitch abzuheben, ist es, ihm anzubieten, einen seiner alten und schlecht abschneidenden Artikel umzuschreiben.What if.. ..instead of reaching out with an offer to write a guest post for someone…..you would find their old and outdated post that dipped in search traffic and offer them to rewrite it?🤔— Tim Soulo (@timsoulo) August 13, 2019 Was wäre, wenn du nicht vorschlagen würdest, einen Gastbeitrag zu schreiben, sondern stattdessen einen alten und nicht mehr aktuellen Beitrag von ihnen finden würdest, der im Search Traffic untergeht, und ihnen anbieten würdest, diesen umzuschreiben?Wie man Backlinks findet, die du replizieren kannstWie du herausfindest, wer auf deine Website verlinkt7 Möglichkeiten, die Backlinks deiner Mitbewerber zu erbeuten6 verlinkbare Asset-Typen9 einfache Linkaufbau-StrategienPart 5Linkaufbau-ToolsObwohl es technisch möglich ist, Links mit ein wenig Grips und einem E‑Mail-Konto aufzubauen, gibt es eine Reihe von Linkaufbau-Tools, die den Prozess der Linkbeschaffung viel einfacher machen. Sehen wir uns vier Arten von Tools an, die dir beim Aufbau von Links helfen können:Backlink-Recherche-Tools; Content-Recherche-Tools; Web-Monitoring-Tools; E‑Mail-Outreach-Tools.1. Backlink-Recherche-ToolsWie du bereits weißt, ist die Untersuchung der Links deiner Mitbewerber extrem hilfreich bei der Entwicklung einer umsetzbaren Linkaufbau-Strategie für deine eigene Website.Der Site Explorer von Ahrefs gilt weithin als das branchenweit beliebtesteBacklink-Recherche-Tool.Gib eine beliebige Website oder URL ein und du erhältst eine umfangreiche Liste aller Backlinks, die auf diese Website verweisen, mit vielen nützlichen Metriken und Filtern, die dir helfen, umsetzbare Linkaufbau-Möglichkeiten zu finden.Einige andere SEO-Tool-Unternehmen, die einen eigenen Link-Index betreiben, sind Moz, Majestic und Semrush.2. Content-Recherche-ToolsContent-Recherche-Tools nehmen dir das Rätselraten bei der Erstellung von teilenswerten, verlinkungswürdigen Inhalten ab. Mit ihnen kannst du inhaltliche Aspekte finden, die viele Links und Shares generiert haben, und diese Erkenntnisse nutzen, um deinen eigenen Content zu erstellen.Der Content Explorer von Ahrefs basiert auf einem riesigen Index von über fünf Milliarden Seiten und hilft dir, bemerkenswerte Inhalte aus jeder Branche zu finden.Suche in den Titeln der Seiten einfach nach einem Thema, über das du schreiben möchtest, und sortiere die Ergebnisse nach verweisenden Domains (verlinkenden Websites). Eine Untersuchung dieser Seiten und ihrer Links sollte dir eine Menge Ideen liefern, wie du deinen eigenen Content besser machen kannst.Ein weiteres Tool mit einer etwas ähnlichen Funktionalität ist Buzzsumo. Allerdings priorisiert es Social Shares gegenüber SEO-Metriken.3. Web-Monitoring-ToolsWeb-Monitoring-Tools benachrichtigen dich über neu veröffentlichte Seiten, die dein Keyword erwähnen, oder über neue Backlinks, die deine Mitbewerber erworben haben. Beide Benachrichtigungen können als eine großartige Quelle für Linkaufbau-Möglichkeiten dienen.Ahrefs Alerts eignet sich sehr gut für beide Arten von Alerts: Backlinks und Keyword-Erwähnungen.Einige andere Web-Monitoring-Tools, die du vielleicht testen möchtest, sind Google Alerts, Mention und Brand24.4. E‑Mail-Outreach-ToolsE‑Mail-Outreach-Tools helfen dir, Linkaufbau-Kampagnen zu verwalten und zu verfolgen. Sie vereinfachen auch die Suche nach potenziellen Kunden, die Erstellung von Vorlagen für die Kontaktaufnahme, das Versenden von Follow-ups und vieles mehr.Es gibt eine Vielzahl von Auswahlmöglichkeiten, aber welches Tool für dich das richtige ist, hängt von deinen Methoden und Prozessen, dem Umfang deiner Aktivitäten und deinem Budget ab.Wir haben unsere Facebook-Community nach ihren Favoriten gefragt und hier sind die Ergebnisse:Ein paar interessante E‑Mail-Outreach-Tools, die von unserer Community nicht erwähnt wurden, sind Neverbounce und Clearout.io.Fassen wir zusammenDieser Leitfaden umfasst mehr als 8.000 Wörter und dennoch haben wir nur an der Oberfläche dessen gekratzt, was der Aufbau von Links tatsächlich mit sich bringt.Wir hoffen jedoch, dass dieser Leitfaden vieles für dich geklärt und die meisten brennenden Fragen, die du zum Thema Linkaufbau hattest, beantwortet hat. Er soll als solide Grundlage dienen, um noch mehr über den Linkaufbau zu lernen.Zum Schluss möchte ich mich bei einer Reihe von Hardcore-Linkaufbau-Praktikern bedanken (und einen Link anbringen), die sich freundlicherweise bereit erklärt haben, ihre Erfahrungen aus erster Hand mit mir zu teilen, als ich für diesen Leitfaden recherchierte:Charlotte Ang — TrafficBees;James Norquay — Prosperity Media;Bibi Lauri Raven — BibiBuzz;Matt Diggity — Diggity Marketing;Venchito Tampon — SharpRocket;Greg & Morgan — JollySEO;Alex Tachalova — Digital Olympus;Adam Enfroy — adamenfroy.com;Laura Hampton — Impression;Alex Nigmatulin — PRnews.io.Vielen Dank an alle! 🙂 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Tim Soulo Tim ist CMO und Produktberater bei Ahrefs. Vor allem aber ist er der größte Fan und der wahrste Missionar des Unternehmens. Erfahren Sie mehr über Tim",
  "headers": [
    {
      "level": "H1",
      "text": "Ein Anfängerleitfaden für den Linkaufbau"
    },
    {
      "level": "H2",
      "text": "Linkaufbau-Grundlagen"
    },
    {
      "level": "H3",
      "text": "Was ist Linkaufbau?"
    },
    {
      "level": "H3",
      "text": "Warum ist der Linkaufbau wichtig?"
    },
    {
      "level": "H4",
      "text": "1. Der Teufelskreis der SEO"
    },
    {
      "level": "H4",
      "text": "2. Deine Mitbewerber bauen wahrscheinlich Links auf"
    },
    {
      "level": "H3",
      "text": "Links sind nicht die Antwort auf alles"
    },
    {
      "level": "H2",
      "text": "Wie man Links aufbaut"
    },
    {
      "level": "H3",
      "text": "1. Links hinzufügen"
    },
    {
      "level": "H4",
      "text": "Einträge in Branchenverzeichnisse vornehmen"
    },
    {
      "level": "H4",
      "text": "Business-Profile in sozialen Netzwerken erstellen"
    },
    {
      "level": "H4",
      "text": "Blog-Kommentare erstellen"
    },
    {
      "level": "H3",
      "text": "2. Um Verlinkungen fragen"
    },
    {
      "level": "H3",
      "text": "3. Links kaufen"
    },
    {
      "level": "H4",
      "text": "Private Blog-Netzwerke"
    },
    {
      "level": "H4",
      "text": "Fiverr"
    },
    {
      "level": "H4",
      "text": "SPAM von Link-Verkäufern"
    },
    {
      "level": "H3",
      "text": "4. Links verdienen"
    },
    {
      "level": "H3",
      "text": "5. Links bewahren"
    },
    {
      "level": "H4",
      "text": "Link-Reklamation"
    },
    {
      "level": "H4",
      "text": "Reparieren von 404-Seiten, die Links enthalten"
    },
    {
      "level": "H2",
      "text": "Was macht einen guten Link aus?"
    },
    {
      "level": "H3",
      "text": "1. Autorität"
    },
    {
      "level": "H3",
      "text": "2. Relevanz"
    },
    {
      "level": "H3",
      "text": "3. Ankertext"
    },
    {
      "level": "H3",
      "text": "3. Ankertext"
    },
    {
      "level": "H3",
      "text": "4. Nofollow vs. Follow"
    },
    {
      "level": "H3",
      "text": "5. Platzierung"
    },
    {
      "level": "H3",
      "text": "6. Zielort"
    },
    {
      "level": "H2",
      "text": "Die besten Linkaufbau-Techniken"
    },
    {
      "level": "H3",
      "text": "1. Die Links der Mitbewerber aufgreifen"
    },
    {
      "level": "H3",
      "text": "2. Verlinkbare Assets erstellen"
    },
    {
      "level": "H3",
      "text": "3. Content-Promotion"
    },
    {
      "level": "H4",
      "text": "Werbung"
    },
    {
      "level": "H4",
      "text": "Outreach"
    },
    {
      "level": "H4",
      "text": "Communities"
    },
    {
      "level": "H3",
      "text": "4. Guest Blogging"
    },
    {
      "level": "H4",
      "text": "1. Arbeite dich nach oben"
    },
    {
      "level": "H4",
      "text": "2. Mache ein unwiderstehliches Angebot"
    },
    {
      "level": "H2",
      "text": "Linkaufbau-Tools"
    },
    {
      "level": "H3",
      "text": "1. Backlink-Recherche-Tools"
    },
    {
      "level": "H3",
      "text": "2. Content-Recherche-Tools"
    },
    {
      "level": "H3",
      "text": "3. Web-Monitoring-Tools"
    },
    {
      "level": "H3",
      "text": "4. E‑Mail-Outreach-Tools"
    },
    {
      "level": "H2",
      "text": "Fassen wir zusammen"
    }
  ],
  "author": "Tim Soulo Tim Soulo Tim Soulo"
}