{
  "url": "https://ahrefs.com/blog/de/links-von-derselben-domain/",
  "slug": "links-von-derselben-domain",
  "title": "4 Gründe um mehrere Links von derselben Webseite aufzubauen",
  "description": "Es ist völlig natürlich mehrfache Links von derselben Webseite zu haben. Aber solltest du dich darauf fokussieren mehr Links von derselben Domain zu erhalten? Finde es hier heraus.",
  "content": "Michal Pecánek Vermarkter und Content-Autor bei Ahrefs. Süchtig nach SEO, Luftfahrt, Parfums, Sushi und Tacos. Inhalt Den meisten SEOs ist es egal, wie viele Backlinks sie von jeder Website erhalten. Sie interessieren sich nur für die Anzahl der einzigartigen Websites (verweisende Domains), die auf sie verweisen.Do you ever reach out to websites that already link to you to get more links? Vote and comment with why you do or don’t.— Michal Pecanek (@michalpecanek) May 12, 2020Dafür gibt es ein paar Gründe.Erstens zeigen die meisten groß angelegten Studien eine starke Korrelation zwischen organischem Traffic und der Anzahl der Backlinks von einzigartigen Websites (verweisende Domains).Zweitens befürchten einige, dass zu viele Backlinks von derselben Website unnatürlich sind.Dies scheint jedoch nicht der Fall zu sein.Wir haben eine kleine Studie durchgeführt und festgestellt, dass 79,23% der verweisenden Domains mehrfach auf dieselbe Website verweisen.Und die meisten Webseiten verlinken 2–5 Mal.Mit anderen Worten, es ist völlig natürlich, mehrere Links von derselben Website zu haben.Aber welche triftigen Gründe gibt es, mehrere Links von jeder Domain aus aufzubauen?Hier sind vier davon:Erhöhe die “Autorität” deiner SeitenErhalte Links zu mehr SeitenErhalte mehr VerweistrafficBaue Links einfacher auf1. Erhöhe die “Autorität” deiner SeitenJede Webseite hat eine gewisse “Autorität”, die PageRank (PR) genannt wird. Dieser fließt über interne und externe Links zu anderen Seiten.PageRank ist die Grundlage von Googles Rankingalgorithmus und es ist auch heute noch ein Rankingsignal.DYK that after 18 years we’re still using PageRank (and 100s of other signals) in ranking?Wanna know how it works?https://t.co/CfOlxGauGF pic.twitter.com/3YJeNbXLml— Gary 鯨理／경리 Illyes (@methode) February 9, 2017Da PR von Seite zu Seite fließt, erhöht das Erhalten von Links von mehreren Seiten auf derselben Website ihre “Autorität”.Obwohl wir gerne ein paar Zahlen durchgehen würden, um die Bedeutung von PR heute abzuschätzen, ist das nicht möglich. Google hat seine öffentlichen PR-Bewertungen 2016 eingestellt. Wir haben jedoch eine klare Korrelation zwischen organischem Traffic und unserer Autoritätsmetrik auf Seitenebene, dem URL-Rating, gefunden.2. Erhalte Links zu mehr SeitenErinnerst du dich an den Graphen, den wir zuvor gezeigt hatten?Er zeigt die Korrelation zwischen organischem Traffic und der Anzahl der verweisenden Domains auf Seitenebene — nicht auf Domain-Ebene.Das ist wichtig, denn es legt nahe, dass du dich zur Steigerung des organischen Traffics darauf konzentrieren solltest, Links zu den Seiten aufzubauen, die du in Google ranken möchtest.Aber die Sache ist die: Die Leute verlinken nicht immer zu den Seiten, die du in Google ranken möchtest.Hier ist zum Beispiel eine Website, die auf eine unserer Studien verlinkt und auf nichts anderes:Unsere Datenstudien sind fantastische Linkmagneten, aber sie treiben selten den organischen Traffic an. Sicherlich können wir die Links, die sie antreiben, ausnutzen, indem wir einen Teil dieser “Autorität” über interne Links auf wichtige Seiten verteilen. Aber es ist immer besser, Links direkt zu den Seiten zu bekommen, die du ranken willst.Aus diesem Grund wäre es auch dann sinnvoll, wenn wir eine Linkbuilding-Kampagne für einen neuen Inhalt durchführen würden, diese Website zu pitchen.3. Erhalte mehr VerweistrafficBacklinks von stark frequentierten Seiten können den Verweistraffic auf deine Website erhöhen. Dies kann sich nicht nur positiv auf dein Geschäft auswirken, indem es die Konversionen steigert, sondern auch auf SEO. Denn mehr Aufmerksamkeit auf deinen Inhalt kann zu noch mehr Links führen.Schaue dir einfach das Diagramm der verweisenden Domains unserer Studie über Featured Snippets an:Screenshot vom Ahrefs’ Site Explorer.In den 36 Monaten seit der Veröffentlichung wurden über 1.200 verweisende Domains angezogen. Das sind durchschnittlich 34 RDs pro Monat. Die Seite erhält jedoch fast keinen organischen Traffic. Das bedeutet, dass diese Verlinker unsere Seite durch andere Mittel entdeckt haben müssen — höchstwahrscheinlich durch andere verlinkende Seiten, die Traffic erhalten.Das ist nicht schwer zu glauben. Wenn wir uns die Seiten anschauen, die auf unsere Studie verweisen, dann erhalten einige von ihnen viel organischen Traffic:Wenn du genauer hinsiehst, wirst du sehen, dass vier von sechs verweisenden Seiten mit dem meisten organischem Traffic auf backlinko.com sind. Dies zeigt, wie Links von einer Domain zu auch nur einer einzigen Seite gleichzeitig PageRank, Verweistraffic und Links zu dir schicken können.Die Moral der Geschichte ist folgende:Wenn es eine Möglichkeit gibt, einen Link von einer Seite mit viel Traffic zu erhalten, spielt es keine Rolle, ob du bereits einen Link von dieser Website hast. Es lohnt sich, die Sache weiterzuverfolgen, und sei es nur wegen des Referral-Traffics.TIPPWenn du Google Analytics verwendest, kannst du sehen, welche Websites dir den meisten (wertvollen) Referral-Traffic senden. Gehe einfach zu Akquisition > Gesamter Traffic > Referral und sortiere die Tabelle dann nach Konversionen oder Nutzern.Du kannst dann die leistungsfähigsten Verweisquellen in den Site-Explorer von Ahrefs einbinden und den Top Pages-Bericht überprüfen. Dieser zeigt die Top Pages nach geschätztem organischem Traffic.Von hier aus solltest du den Bericht nach Seiten durchsuchen, auf denen es sinnvoll sein könnte, einen kontextuellen Link zu platzieren.Wenn wir uns zum Beispiel den Bericht über die Top-Seiten von smartblogger.com ansehen, sehen wir viel Traffic zu einem Beitrag, in dem es darum geht, mit dem Bloggen Geld zu verdienen. Und wenn wir uns den Beitrag selbst anschauen, sehen wir, dass er die Bedeutung von SEO erwähnt und auch einen rivalisierenden SEO-Blog empfiehlt.Dies scheint eine gute Gelegenheit zu sein, einen kontextbezogenen Link von einer stark frequentierten Seite aus anzubringen.4. Baue Links leichter aufLinks von Personen zu erhalten, die bereits mit dir in Kontakt getreten sind, ist in der Regel einfacher als eine “kalte Kontaktaufnahme”.Aber wie findest du diese Leute?Gehe zum Bericht Backlinks im Site Explorer von Ahrefs, lege die Gruppierungsoption “Ein Link pro Domain” fest und wende den Filter “dofollow” an. Schaue von dort aus in die Spalte “Links”, um Websites zu finden, die bereits mehrfach mit dir verlinkt sind.Zum Beispiel haben wir zehn Links von gotchseo.com zu zahlreichen Blogposts.Daraus geht klar hervor, dass Nathan — der Mann hinter gotchseo.com - ein Fan unserer Inhalte ist. Wenn wir also etwas veröffentlichen, das ihn in Zukunft interessieren könnte, können wir ihn erreichen und mit ihm teilen.Wenn es ihm gefällt und er es wertvoll findet, könnte er sich dafür entscheiden, einen Link darauf zu setzen.Wenn nicht, können wir immer nach einer Gelegenheit für kontextbezogene Links auf seiner Website suchen. Und wenn es eine gibt, platzieren wir den Link. Um relevante Gelegenheiten zu finden, können wir den site: Such-Operator zusammen mit einem Wort oder Phrase, die unseren Artikel beschreibt, nutzen.Denke einfach daran, dass es wahrscheinlich nicht die beste Idee ist, häufigen Linkern die gleiche Outreach-E-Mail wie allen anderen zu senden. Sie sind bereits Fans deiner Arbeit und haben schon oft Links zu dir erstellt, also beleidige sie nicht mit einem allgemeinen Pitch.TippWenn du ein Liebhaber von Spreadsheets bist, empfehle ich dir auch, die Liste deiner verweisenden Domains zu exportieren und sie mit deiner Liste von Linkperspektiven abzugleichen. Du kannst sofort Notizen über den Kontext ihrer früheren Links erstellen und sie in deinem Pitch verwenden.SchlussgedankenIch bin sicher, dass du keine Gelegenheit verpassen würdest, auf einer Seite zu erscheinen, die tonnenweise Besucher anzieht — auch wenn die Seite bereits einen Link zu dir hat. Aber ich wollte dieses Thema ansprechen, weil, wie bei allen SEO-Dingen, Missverständnisse im Umlauf sind.Und schließlich wollte ich dich dazu anregen, deinen Ansatz für den Linkaufbau zu überdenken. Schließlich ist es wahrscheinlich der kreativste und schwierigste Teil von SEO.Hast du Fragen oder Anmerkungen? Ping mich auf Twitter an.Übersetzt von: Sebastian Simon. Sebastian Simon beschäftigt sich seit 2009 mit SEO, aktuell tut er das bei seven-bytes.de und heine.de. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Michal Pecánek Vermarkter und Content-Autor bei Ahrefs. Süchtig nach SEO, Luftfahrt, Parfums, Sushi und Tacos.",
  "headers": [
    {
      "level": "H1",
      "text": "4 Gründe um mehrere Links von derselben Webseite aufzubauen"
    },
    {
      "level": "H2",
      "text": "1. Erhöhe die “Autorität” deiner Seiten"
    },
    {
      "level": "H2",
      "text": "2. Erhalte Links zu mehr Seiten"
    },
    {
      "level": "H2",
      "text": "3. Erhalte mehr Verweistraffic"
    },
    {
      "level": "H2",
      "text": "4. Baue Links leichter auf"
    },
    {
      "level": "H2",
      "text": "Schlussgedanken"
    }
  ],
  "author": "Michal Pecánek"
}