{
  "url": "https://ahrefs.com/blog/de/linkbuilding-schnell/",
  "slug": "linkbuilding-schnell",
  "title": "Wie du schnell mit einer Linkbuilding Kampagne beginnst (und alles systematisch angehst)",
  "description": "Dieser Guide zeigt dir, wie du schnell potenzielle Linkmöglichkeiten und die dazugehörigen Kontaktinformationen ausfindig machst. Du lernst auch, wie du deinen Outreach systematisch angehst, automatisierst und skalierst.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (oder, in einfachen Worten, ich bin der Typ, der dafür sorgt, dass jeder Blog-Post EPISCH wird). Inhalt Du kennst die Linkbuilding-Basics, aber es fällt dir schwer sie in einer Kampagne umzusetzen? Dieser ausführliche Guide zeigt dir, wie es schnell geht.Der Linkbuilding Outreach kann in drei Arbeitsschritte unterteilt werden:Potenzielle Partner findenKontaktinformationen findenE‑Mails versendenDie meisten Informationen, die du online zu diesem Thema finden kannst, fokussieren sich auf den letzten Punkt: E‑Mails versenden. Aber wenn du jemals im Bereich Blogger Outreach aktiv warst, weisst du, dass das Hauptproblem darin besteht, potenzielle Partner und Kontaktinformation zu finden.Wenn du diese beiden Punkte richtig machst, ist das Versenden von E‑Mails einfach.In dieser praxisorientierten Anleitung fokussieren wir uns darauf, die ersten beiden Schritte des Prozesses effizienter zu gestalten. Und wir beleuchten auch, wie du deinen Outreach systematisch automatisieren und skalieren kannst.Lass uns direkt loslegen.Der ProzessBevor wir irgendetwas machen, müssen wir zunächst festlegen, welche Art der Kampagne wir umsetzen wollen.Um dies einfach zu halten, wählen wir eine Kampagne mit Gastbeiträgen.Bevor ich dich zu sehr langweile — ich weiss, dass Gastbeiträge alles andere als aufregend sind. Sie sind langweilig und etwas überholt. Ich wähle sie dennoch für die Veranschaulichung des Prozesses, da es sich dabei um ein unkompliziertes Beispiel handelt. Ich werde aber auch darauf eingehen, wie du diesen Prozess auf andere Linkbuilding-Strategien anwenden kannst.Bereit? Dann lass uns loslegen.Schritt 1: Potenzielle Partner findenIm ersten Schritt sollten wir das übliche Vorgehen —potenzielle Partner mit Hilfe einer Google-Recherche zu finden— vermeiden.Verstehe mich nicht falsch, Google ist hilfreich, um potenzielle Partner für sämtliche Kampagnen zu recherchieren aber ungeeignet, wenn eine schnelle Umsetzung das Ziel ist. Du musst Ergebnisse auswählen und SEO-Kennzahlen mit Drittanbieter-Tools checken, was einfach zu lange dauert.Deshalb nutzen wir stattdessen Ahrefs Content Explorer.Der Content Explorer ist eine Datenbank von circa einer Milliarde Webseiten, die sich durchsuchen und filtern lässt.Was wir jetzt nicht machen, ist Suchbefehle wie “Schreibe für uns” nutzen —obwohl dies grundsätzlich im Content Explorer möglich ist.Verwendung von Suchbefehlen, um “write for us”-Seiten im Content Explorer zu finden.Stattdessen nutzen wir das Tool, um Seiten zu finden, die über relevante Themen schreiben.Dafür gibt es drei Gründe:Die meisten Leute sind offen für Gastbeiträge —selbst wenn sie keine “Schreibe für uns”-Seite haben.Wenn Websites bereits Inhalte zu relevanten Themen veröffentlicht haben, wissen wir, dass es sich dabei um geeignete Partner handelt.Diese Vorgehen stellt uns zwei wichtige Datenpunkte zur Verfügung (Beitrags-URL und Verfasser), was es einfacher macht, Kontaktinformationen zu finden.Um zu beginnen, führen wir im Content Explorer eine “In title”-Suche durch, um Blogbeiträge über relevante Themen zu finden, wie unten dargestellt.(How OR why) AND ([keyword 1] OR [keyword 2])Wenn wir zum Beispiel eine Seite betreiben, die gesundheitsfördernde Nahrungsergänzungsmittel verkauft, können wir nach dem Folgenden suchen:Die Suche funktioniert auf folgende Art und Weise:Die Klammer gruppiert Wörter.Der “OR”-Befehl sorgt dafür, dass Ergebnisse die eines der beiden Wörter in Klammern enthalten, angezeigt werden (z.B. “how or why”).Der “AND”-Befehl, sorgt dafür, dass Ergebnisse angezeigt werden, die mindestens ein Wort aus der ersten Klammer (“how or why”) und ein Wort aus der zweiten Klammer (“muscle or gym”) enthalten.Zusammengefasst suchen wir demnach nach Seiten mit den Worten “how” oder “why” und “muscle” oder “gym” in den Title Tags.Die meisten Beiträge werden von Themen wie Muskelaufbau oder ins Fitnessstudio gehen, handeln.Hier ist z.B. ein kleiner Auszug aus unserer Suche:Nun müssen wir die Ergebnisse nach Seiten mit den folgenden Merkmalen filtern:Englisch: Der Content Explorer beinhaltet Seiten in vielen Sprachen aber in diesem Fall möchten wir nur Seiten auf englisch angezeigt bekommen, da wir unseren Outreach auf englisch durchführen.Live: Der Content Explorer beinhaltet sowohl Seiten die live sind als auch Seiten, welche nicht mehr erreichbar sind. Es macht keinen Sinn, Verfasser von nicht erreichbaren Seiten zu kontaktieren, da diese hinterfragen, wie wir ihre Seite gefunden haben und warum sie eine E‑Mail von uns erhalten.Websites mit einem DR von 20–95: Domain Rating (DR) ist eine Ahrefs SEO-Kennzahl, welche die Link-Autorität einer Seite misst. Es ist meist vermutlich nicht den Aufwand wert, Gastbeiträge für Seiten mit geringem DR zu verfassen, während es sich bei Seiten mit sehr hohen DR-Werten fast immer um Seiten wie Facebook, Google, usw. handelt. Wir möchten beide Fälle ausschließen, um keine Zeit zu verschwenden.Siehe unten, wie du diese Filter im Content Explorer auswählst:Wir müssen auch mehrere Seiten derselben Domain ausfiltern, da wir einen Website-Betreiber nur einmal kontaktieren möchten.Dafür können wir die “one page per domain”-Checkbox nutzen.2.685 Treffer — nicht schlecht für zwei Minuten Arbeit.Nun musst du nur noch die Ergebnisse in eine CSV-Datei exportieren und alles in ein Google Sheet importieren. Nutze nicht Excel dafür. Der Grund hierfür wird im nächsten Schritt deutlich.Nebenbei bemerkt. Du kannst bis zu 2.000 Ergebnisse aus dem Content Explorer exportieren, wenn du den “One page per domain”-Filter anwendest. Falls es für deine Suche mehr als 2.000 Ergebnisse gibt, passe den DR-Filter an und exportiere die Ergebnisse in mehreren Schritten. Wenn du z.B. 3.500 Ergebnisse für Seiten mit einem DR-Wert von 20–95 hast, kannst du stattdessen den Filter für Seiten von Websites mit einem DR-Wert von 20–50 anpassen, die Ergebnisse exportieren und den Prozess für Seiten von Websites mit einem DR-Wert von 51–95 wiederholen. Du kannst die Ergebnisse dann in Google Sheets zusammenfassen.Schritt 2: Kontaktinformation findenBevor wir Seitenbetreiber kontaktieren können, müssen wir Kontaktinformationen recherchieren — und zwar Vorname, Nachname und E‑Mail Adresse der entsprechenden Person.Dies ist normalerweise aus zweierlei Gründen eine große Hürde:Es handelt sich um einen manuellen Prozess. Du musst dir die Seite ansehen, einen Namen der Kontaktperson finden, und die entsprechende E‑Mail Adresse recherchieren.Auf manchen Seiten ist es leichter Kontaktinformationen zu finden als auf anderen. Manchmal dauert es 15 Minuten und mehr um eine E‑Mail Adresse zu finden.Aber hier ist die Lösung:Anstatt E‑Mail Adressen manuell zu recherchieren, nutzen wir das E‑Mail Recherche-Tool Hunter für die aufwendige Arbeit. Wir benötigen lediglich einen Vornamen, Nachnamen und einen Domain-Namen.Wenn ich z.B. meinen Namen und “ahrefs.com” bei Hunter angebe, findet das Tool meine E‑Mail Adresse:Aber wie finden wir Namen und Domains unserer potenziellen Partner?Wenn wir uns die exportierte Datei des Content Explorers genauer ansehen, existieren für manche Einträge bereits Verfassernamen.Nebenbei bemerkt. Ich habe in diesem Beispiel aus Datenschutzgründen alle Namen mit falschen Namen ersetzt. Wenn wir diese Namen zusammen mit der “Content URL” in Hunter eingeben, extrahiert das Tool die Domain und versucht die E‑Mail Adresse der Person zu finden. Wenn eine E‑Mail Adresse gefunden wird, können wir davon ausgehen, dass die Person mit der Seite in Verbindung steht. Wird keine E‑Mail Adresse gefunden, können wir davon ausgehen, dass es sich dabei um Gast-Blogger handelt und diese erstmal ignorieren.Hier das genaue Vorgehen:Zunächst filtern wir alle Seiten ohne Verfassernamen aus:Dann entfernen wir alle Spalten bis auf “Content Title”, “Content URL” und “Author”.Im dritten Schritt, fügen wir zwei weitere Spalten ein (D und E):In die Zelle D1 fügen wir folgende Formel ein:=IFERROR(ARRAYFORMULA(IF(C1:C=\"Author\",\"First name\",IFERROR(IF(search(\" \",C1:C),LEFT(C1:C,FIND(\" \",C1:C)-1),C1:C),C1:C))),\"\")Kopiere diese Formel in die Zelle E1:=IFERROR(ARRAYFORMULA(IF(C1:C=\"Author\",\"Last name\",IF(LEN(D1:D)<1,\"\",IFERROR(IF(search(\" \",C1:C),TRIM(RIGHT(SUBSTITUTE(C1:C,\" \",REPT(\" \",100)),100)),\"\"),\"unknown\")))),\"\")Dadurch wird der Vor- und Nachname auf zwei Zellen aufgeteilt.Dies ist wichtig, da wir nicht Hunters Web-Tool nutzen, um die E‑Mail Adressen zu finden, sondern das dazugehörige Add-On für Google Sheets, damit wir sie alle auf einmal suchen können.Wenn du diesem Prozess folgen möchtest, musst du dich registrieren, um einen API Key zu erhalten, was dir 50 kostenlose Suchen im Monat ermöglicht. Sobald du bereit bist, kannst du das Add-On in Google Sheets laden und die E‑Mail Finder Option nutzen.Gib ihm Tool an welche Zellen den Vornamen, Nachnamen und die URL enthalten. Trage nichts in das “Company Name” Feld ein.Klicke “find email addresses” und das Tool startet die Suche.Beachte, dass nicht immer eine E‑Mail Adresse gefunden wird. Der Name muss mit der Website in Verbindung stehen (d.h. eine persönliche @domain E‑Mail Adresse muss existieren) und diese muss sich in Hunters Datenbank befinden.Im letzten Schritt werden die E‑Mail Adressen, die Hunter findet, mit einem Tool wie Neverbounce verifiziert.Dafür nutzen wir Neverbounces Bulk-Tool und laden die Liste hoch und bereinigen diese.Nebenbei bemerkt. Wenn du dich bei Neverbouce registrierst, erhältst du 1000 kostenlose Credits. Benötigst du mehr, ist das Tool relativ günstig — für 1000 E‑Mail Adressen bezahlst du zwischen $3-$8.Zum Schluss exportieren wir die validierten E‑Mail Adressen und nutzten eine VLOOKUP Formel um sie in unser Dateienblatt einzufügen.Nun haben wir eine Reihe an potenziellen Partnern, die wir kontaktieren können.Lass uns die Datei in eine CSV Datei umwandeln und wir sind bereit für den letzten Teil des Prozesses.Schritt 3: E‑Mails versendenDie gute Nachricht ist, dass die aufwendige Arbeit größtenteils hinter uns liegt. Alles was jetzt noch getan werden muss, ist die potenziellen Kontakte in ein Outreach-Tool wie Mailshake, Buzzstream oder Pitchbox hochzuladen.Dann muss lediglich eine Outreach-Vorlage mit Platzhaltern erstellt werden.Nebenbei bemerkt. Bitte schreibe eine bessere Vorlage als im Beispiel oben. Ich habe es beabsichtigt einfach gehalten, um das Vorgehen zu demonstrieren. Es handelt sich dabei aber nicht um einen guten Pitch.An dieser Stelle kannst du auf gut Glück unzählige E‑Mails versenden, ohne diese zu personalisieren. Aber davon raten wir ab. Die Personalisierung deiner E‑Mail ist hier der einzige Unterschied zwischen einem spammy oder einem seriösen Ansatz. Nur weil wir Automatisierung nutzen, bedeutet dies nicht, dass die Regeln eines guten Outreaches nicht mehr zutreffen.Meine Einstellung hierzu ist Folgende: Wir automatisieren die langweiligen Aufgaben, damit wir mehr Zeit für die wichtigen Dinge haben, wie die Personalisierung von E‑Mails und die Überprüfung unserer potenziellen Kontakte.Verlangsamt dies den Prozess? Ja, natürlich aber selbst wenn es fünf Minuten dauert, eine E‑Mail zu personalisieren, sind das dennoch 12 E‑Mails in der Stunde.Gehen wir von einer geringen Konversionsrate von 8% aus, bedeutet dies ein Link für eine Stunde Arbeit.Falls das immer noch nach viel Arbeit für einen Link klingt, wird dich der nächste Abschnitt interessieren.Wie du diesen Prozess systematisch automatisierst und skalierstJemanden zu finden, der Outreach E‑Mails für dich versenden kann, ist einfach: Poste einen Job auf einer Freelancing-Website wie Upwork.Aber warum an dieser Stelle aufhören? Es ist möglich:Fast jeden Aspekt des Prozesses zu systematisieren und zu delegieren.Dinge zu automatisieren und Aufwand zu verringern.Zu skalieren und mehr potenzielle Partner zu kontaktieren.Siehe im Folgenden wie du diese Dinge umsetzen kannst:SystematisierungOben ist der Prozess für Linkbuilding beschrieben aber Prozesse sind nicht identisch mit Systemen. Ein Prozess ist eine Abfolge von Schritten, um ein Endziel zu erreichen, während ein System diese Schritte miteinander verbindet.Mit Systemen funktioniert gewissermaßen alles von alleine, sobald diese entsprechend eingerichtet sind.Im Folgenden ist eine einfache Möglichkeit beschrieben, wie der Prozess oben in ein System umgewandelt werden kann:Erstelle zunächst ein Trello Board mit Listen für jeden Schritt des Prozesses.Dokumentiere dann jeden einzelnen Schritt.Ich bevorzuge Google Docs hierfür, da du diese mit anderen Mitgliedern deines Teams teilen kannst. Für den oben beschriebenen Prozess, würdest du drei Dokumente erstellen: Eins um potenzielle Partner zu finden, eins um Kontaktinformationen zu recherchieren und eins um E‑Mails zu versenden.Skizziere in einem Dokument eine “Wie man E‑Mail Adressen recherchiert”-Vorgehensweise.Füge im dritten Schritt die Links zur Dokumentation zum Trello Board.Wenn du nun eine neue Kampagne beginnst, musst du lediglich eine neue Karte erstellen, die Person, die für den ersten Schritt verantwortlich ist, taggen und sie auf die Dokumentation aufmerksam machen.Du wirst dich jedoch vielleicht fragen, was passiert, wenn die Person die Aufgabe abgeschlossen hat. Solltest du kein Auge darauf haben und weitere Schritte an die nächste Person delegieren?Nein, das musst du nicht. Schließe das Delegieren des nächsten Schritts in deiner Dokumentation mit ein.AutomatisierungEin System zu haben, in dem alle Zahnräder aufeinander eingestellt sind, ist fantastisch aber wäre es nicht noch besser, wenn du die Anzahl an Zahnrädern im System reduzieren könntest?Dabei kann dir Automatisierung hilfreich sein.Schaue dir diese Video an, um zu lernen, wie du den Großteil des obigen Prozesses mit Zapier automatisieren kannst:https://www.youtube.com/watch?v=HyIXvIaUlLkSkalierenBeim Durchlesen diese Guides wirst du vielleicht festgestellt haben, dass der Prozess zwar kurz ist, systematisiert und zum Teil automatisiert werden kann aber dennoch viele potenzielle Möglichkeiten ungenutzt gelassen werden.Letzten Endes findet der Content Explorer nur Namen für einige Seiten, Hunter findet nur E‑Mail Adressen von einigen potenziellen Partnern und Neverbounces verifiziert nur einen Teil der E‑Mail Adressen.Wenn du mit 1000 potenziellen Chancen beginnst, könntest du am Ende des Prozesses nur 100 potenzielle Partner haben, die du kontaktieren kannst.Da es für jede Kampagne nur eine begrenzte Anzahl an möglichen Partnern gibt, macht es keinen Sinn 90% davon unter den Tisch fallen zu lassen.Aber nur um es klar zu stellen: Ich schlage nicht vor dies zu tun.Der Vorteil dieses Prozesses ist es, eine Kampagne so schnell wie möglich umzusetzen und diese nicht zu perfektionieren.Dieses Vorgehen verschafft dir schnell Gewissheit, ob eine Kampagne Potenzial hat oder nicht.Wenn sie kein Potenzial hat, stelle sie ein.Wenn sie Potential hat, ist es an der Zeit sie zu skalieren.Du hast bereits ein System etabliert, Skalieren ist damit so simpel, wie ein zusätzliches Dokument zu erstellen, um Namen und E‑Mail Adressen manuell zu recherchieren.Dies ist jedoch nicht der einzige Weg zu skalieren. Du kannst auch:Mehr Kampagnen durchführen.Dieses Prinzip auf mehr Linkbuilding Maßnahmen anwenden.Lass uns Option B genauer betrachten.Nutze diesen Prozess für ander Linkbuilding MaßnahmenAlles was wir bisher beleuchtet haben, kann auf fast jede Linkbuilding Maßnahme angewendet werden, vorausgesetzt das Finden potenzieller Partner beinhalten die Recherche des Vor- und Nachnamen.Dabei ergibt sich aber folgendes Problem: die meisten Prozesse um Partner ausfindig zu machen, beinhalten diesen Schritt nicht.Lass uns zum Beispiel davon ausgehen, dass du eine Gelegenheit für Broken Linkbuilding im Site Explorer identifizierst.Broken Linkbuilding Gelegenheit zum Thema “what is content marketing” im “Best by Links”-Report im Ahrefs Site Explorer.Backlinks zur nicht erreichbaren Seite zum Thema “what is content marketing” im Ahrefs Site Explorer. Jede dieser 117 verlinkenden Websites ist eine potenzielle Link-Möglichkeit für eine Broken Linkbuilding Kampagne.Wenn du den Backlink-Report exportiertierst, sind keine Verfassernamen beinhaltet.Das ist kein großes Problem. Solange diese möglichen Partner aus einer Liste von Seiten (nicht Websites) bestehen, musst du ledigliche einen zusätzlichen Schritt im Prozess hinzufügen: nutze den URL Profiler, um die Namen zu finden.Wie? Kopiere die möglichen Partner in den URL Profiler und wähle die “Readability” Checkbox aus.Wenn möglich, wird das die Verfassernamen von den Seiten extrahieren.Nebenbei bemerkt. Der URL Profiler ist nicht kostenlos aber es existiert eine 14-tägige Testphase.Findet das Tool so viele Namen wie der Content Explorer? Meiner Erfahrung nach nicht ganz aber es sind auch nicht viel weniger.Füge diese mit der VLOOKUPS-Formel zu deinen existierenden Daten in Google Sheets.Google benutzen, um Treffer zu finden?Du kannst mit dem URL Profiler auch Ahrefs SEO-Kennzahlen wie DR, UR und organischen Traffic abrufen.Wähle lediglich die entsprechenden Boxen für die Datenpunkte aus, die du abrufen möchtest.Danach handelt es sich im Grunde um den gleichen Prozess wie zuvor: E‑Mail Adressen finden, diese überprüfen und potenzielle Partner kontaktieren.Abschließende GedankenMit eine Linkbuilding Kampagne zu beginnen, muss nicht Tage und noch nicht einmal Stunden dauern.Mit dem dargestellten Prozess in diesem Guide sollte es innerhalb von 30 Minuten möglich sein zumindest ein paar Gastbeiträge gegenüber potenziellen Partnern vorzuschlagen. Und dies gilt auch, wenn du nicht viel Erfahrung mit Linkbuilding hast.Hast du Fragen? Ist irgendwas unklar? Kontaktiere mich auf Twitter.Übersetzt von Heike Radlanski. Heike beschäftigt sich mit allen Aspekten des Online Marketing und Product Managements. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Joshua Hardwick Head of Content @ Ahrefs (oder, in einfachen Worten, ich bin der Typ, der dafür sorgt, dass jeder Blog-Post EPISCH wird).",
  "headers": [
    {
      "level": "H1",
      "text": "Wie du schnell mit einer Linkbuilding Kampagne beginnst (und alles systematisch angehst)"
    },
    {
      "level": "H2",
      "text": "Der Prozess"
    },
    {
      "level": "H3",
      "text": "Schritt 1: Potenzielle Partner finden"
    },
    {
      "level": "H3",
      "text": "Schritt 2: Kontaktinformation finden"
    },
    {
      "level": "H3",
      "text": "Schritt 3: E‑Mails versenden"
    },
    {
      "level": "H2",
      "text": "Wie du diesen Prozess systematisch automatisierst und skalierst"
    },
    {
      "level": "H3",
      "text": "Systematisierung"
    },
    {
      "level": "H3",
      "text": "Automatisierung"
    },
    {
      "level": "H3",
      "text": "Skalieren"
    },
    {
      "level": "H2",
      "text": "Nutze diesen Prozess für ander Linkbuilding Maßnahmen"
    },
    {
      "level": "H2",
      "text": "Abschließende Gedanken"
    }
  ],
  "author": "Joshua Hardwick"
}