{
  "url": "https://ahrefs.com/blog/de/local-citations/",
  "slug": "local-citations",
  "title": "Wie man Local Citations erstellt (vollständiger Leitfaden)",
  "description": "Local Citations sind ein wichtiger Rankingfaktor für Local SEO. Erfahre, welche Arten von Zitierungen es gibt und wie du sie erhalten kannst.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (oder, in einfachen Worten, ich bin der Typ, der dafür sorgt, dass jeder Blog-Post EPISCH wird). Inhalt Als “Local Citation” (“Zitierung“) bezeichnet man jede Erwähnung des Namens, der Adresse oder der Telefonnummer deines Unternehmens online. Viele Suchmaschinenoptimierer erachten sie als einen wichtigen Rankingfaktor für Local SEO.Citations können an den unterschiedlichsten Stellen aufscheinen: in Unternehmensverzeichnissen, in den sozialen Netzwerken — überall dort, wo jemand nach Informationen zu örtlichen Unternehmen suchen könnte.Hier ist ein Beispiel für ein Café in New York:Hierbei handelt es sich um eine NAP-Zitierung, da der Name, die Adresse und die Telefonnummer des Cafés angezeigt werden (“NAP” = Name, Address, Phone Number).In diesem Blogbeitrag erfährst du:Warum Local Citations wichtig sindWelche Arten von Citations es gibtWie man Citations erhältWarum Einheitlichkeit und Genauigkeit wichtig sindWarum sind Citations wichtig?Citations sind vor allem für zwei Dinge wichtig:Um für lokale Suchanfragen (möglicherweise) höher zu rankenUm Leuten dabei zu helfen, dein Unternehmen online zu finden und zu erkundenWarum Citations für Local SEO nützlich sindMan geht davon aus, dass Citations Suchmaschinen dabei helfen, die Existenz, Rechtmäßigkeit und Vertrauenswürdigkeit deines Unternehmens zu verifizieren. Wenn dieselben Details auf vielen relevanten und vertrauenswürdigen Websites erscheinen, dann besteht für Google wahrscheinlich ein gestärktes Vertrauen dafür, dass dein Unternehmen tatsächlich existiert, geschäftstätig ist, und dass deine dazugehörigen Angaben der Wahrheit entsprechen.Laut einer Umfrage von Moz sind Citations der fünft wichtigste Rankingfaktor für lokale Suchanfragen.Dennoch muss bei dieser Umfrage auf einiges hingewiesen werden:Sie ist bereits ein paar Jahre alt. Die Umfrage wurde 2018 durchgeführt. Angesichts der Tatsache, dass Zitierungen mit ziemlicher Sicherheit im Laufe der Zeit an Bedeutung verloren haben, ist es sehr wahrscheinlich, dass sie heute eher weniger relevant sind.Nicht alle Suchmaschinenoptimierer sind der Meinung, dass Citations immer noch wichtig sind. Bereits im Jahr 2018 gaben ziemlich viele Suchmaschinenoptimierer bei der Umfrage von Moz an, dass Citations nicht mehr von großer Bedeutung sind und keinen allzu großen Einfluss haben.Vor allem der zweite Punkt ist sehr wichtig. Diesem stimmen wir im Allgemeinen zu.Wenn man einfach nur in irgendwelchen x‑beliebigen Quellen erwähnt wird, hat das wohl kaum eine große Auswirkung auf deine lokalen Rankings. Dennoch sind wir der Meinung, dass es durchaus Sinn macht, wenn Local Citations auf relevanten, vertrauenswürdigen Quellen vorzufinden sind, bei denen Besucher auch davon ausgehen, dass dein Unternehmen dort zu finden ist.An dieser Stelle wollen wir euch nicht vorenthalten, was John Mueller von Google zum Thema Zitierungen zu sagen hat:Nur weil ein Firmenname irgendwo erwähnt wird, bedeutet das nicht unbedingt, dass das gut oder schlecht für das Unternehmen ist. Ich würde diese Erwähnungen eher als Werbung sehen — wenn du glaubst, dass Leuten sie sehen werden und explizit nach deinem Unternehmen suchen, dann ist das großartig.Wie Citations dabei helfen, dein Unternehmen im Web zu findenNicht immer nutzen die Leute Google, um örtliche Unternehmen zu finden. Sie verwenden auch häufig Websites wie Yelp, Yellow Pages, und Fachverzeichnisse wie lawyers.com. Das ist einer der Gründe, warum es sinnvoll ist, sich auf diesen Seiten eintragen zu lassen und aufgelistet zu werden.Der andere Grund ist, dass Unternehmensverzeichnisse oft die Suchergebnisse für lokale Suchanfragen dominieren.Suche zum Beispiel einmal nach “plumber nottingham”:Nur sehr wenige der Top-Ergebnisse sind Installateur-Websites. Es sind meist Branchen- und Firmenverzeichnisse, die viele verschiedene Installateure auflisten.Da Google diese Art von Ergebnissen für die lokale Suche liefert, musst du dort erwähnt bzw. zitiert werden, damit Suchende dein Unternehmen finden können.Welche Arten von Citations gibt es?Aber bevor wir darüber sprechen, wie man zu Zitierungen kommt, müssen wir die zwei verschiedenen Arten von Zitierungen verstehen, die man erhalten kann.Strukturierte CitationsEine strukturierte Citation listet den Namen, die Adresse und die Telefonnummer (also die NAP-Daten) eines Unternehmens auf. Einträge in Verzeichnissen und Social-Media-Profile sind gute Beispiele dafür. Die Informationen der Unternehmen werden in ein und demselben Stil angezeigt, und die Seite wird gewissermaßen um diese Daten herum aufgebaut.Unstrukturierte CitationsEine unstrukturierte Citation ist eine kontextbezogene Erwähnung eines Unternehmens. Diese Zitierungen tauchen normalerweise in Blog- oder Forenbeiträgen oder als Folge von Erwähnungen in der Presse auf.Wie erhält man Citations?Die meisten Unternehmen profitieren davon, wenn sie über einige strukturierte und unstrukturierte Citations verfügen. Es ist jedoch nicht nötig, auf jeder x‑beliebigen Website erwähnt zu werden. Vielmehr gilt hier: Qualität vor Quantität.Befolge diese vier Schritte, um jene Citations zu erhalten, die du auch tatsächlich benötigst:Über die ‘Top‑3’-Datenaggregatoren gelistet werdenSich bei den wichtigsten Websites eintragen lassenSich bei beliebten Branchen- und lokalen Websites eintragen lassenUnstrukturierte Citations erhaltenSchritt #1. Über die ‘Top‑3’-Datenaggregatoren gelistet werdenEs gibt Tausende von Unternehmensverzeichnissen im Web. Wenn sich jedes einzelne darauf verlassen würde, dass die Geschäftsinhaber ihre NAP-Informationen von sich aus direkt angeben, gäbe es wahrscheinlich viele Lücken in den Verzeichnisdaten. Die meisten Geschäftsinhaber tragen ihre Daten natürlich nicht bei Tausenden von Websites ein.Datenaggregatoren lösen dieses Problem. Diese Firmen sammeln Informationen über Unternehmen und verteilen sie an eine Vielzahl von Websites. Wenn diese Firmen deine Unternehmensinformationen besitzen, werden diese Infos an vielen Stellen erwähnt bzw. zitiert.In den USA gibt es derzeit hauptsächlich drei große Datenaggregatoren:Express Update (von InfoGroup)Neustar LocalezeFactualNebenbei bemerkt. Darüber hinaus war früher auch die Firma Acxiom wichtig — ein ehemals ebenfalls großer Datenaggregator. Ihre Dienste wurden jedoch Ende 2019 eingestellt.Die Beantragung, Einreichung und Verwaltung von Unternehmenseinträgen sind bei InfoGroup (Express Update) und Neustar Localeze völlig kostenlos. Suche dort einfach nach deinem Unternehmen und fordere den Eintrag an, wenn er sich dort befindet. Wenn nicht, reiche einen neuen Eintrag ein.Stelle einfach nur sicher, dass du auch wirklich gründlich nach deinem Unternehmen suchst und erst alle Einträge anforderst, bevor du neue einreichst. Du musst sichergehen, dass du alle Duplikate anforderst und dass die Informationen korrekt sind.Bei Factual kannst du die Einträge nicht mehr direkt aktualisieren oder bearbeiten. Du musst mit einem ihrer Trusted Data Contributors (TDC) zusammenarbeiten, was normalerweise eine Gebühr kostet. Wir empfehlen deshalb, deren Verzeichnis nach deinem Unternehmen zu durchsuchen und die dort vorhandenen Informationen zu überprüfen. Wenn diese korrekt sind, sehr gut. Wenn sie nicht korrekt sind, dann kannst du jederzeit mit einem TDC wie Yext oder WhiteSpark zusammenarbeiten, um die Infos zu korrigieren. Unserer Meinung nach lohnt sich das allerdings für die meisten Unternehmen wahrscheinlich nicht, deshalb solltest du dir über Factual nicht allzu viele Gedanken machen.Schritt #2. Sich bei den wichtigsten Websites eintragen lassenDie ‘Top‑3’-Datenaggregatoren verteilen die NAP-Information von Unternehmen an viele bekannte Websites, aber eben nicht an alle. Deshalb empfiehlt es sich oft, seine Daten direkt bei den wichtigsten Seiten des eigenen Landes anzugeben.In den USA sind das Websites wie:Apple MapsFacebookYelpBing PlacesYellowPagesBBBFoursquareEine vollständige Liste der wichtigsten Quellen für Citations in den USA findest du hier und für andere Länder hier. Hierbei handelt es sich allerdings wohlgemerkt nur um eine Auswahl der “wichtigsten” Quellen basierend auf einer subjektiven Einschätzung. Es gibt viele solche Listen, und obwohl es zweifellos einige Überschneidungen gibt, sind sie kaum identisch.Aber: Wir glauben nicht, dass es sich lohnt, sich bei all diesen Websites eintragen zu lassen. Die meisten waren uns bis dato unbekannt. Zudem scheinen einige kaum Traffic zu erhalten.Das ist kaum überraschend, wenn man bedenkt, wie diese Website aussieht. Wir können uns nicht vorstellen, dass irgendjemand diese Seite dazu nutzt, um ein örtliches Geschäft zu finden (vielleicht im Jahr 1995?).Unser Rat ist also, diese Liste durchzusehen und sich bei jenen Websites eintragen zu lassen, die es wert sind.Die Frage nun lautet: Woher sollst du wissen, welche das sind? Wenn du von ihnen bereits gehört hast, stehen die Chancen gut, dass diese Seiten es wert sind, sich bei ihnen eintragen zu lassen (vorausgesetzt, es ist kostenlos). Ansonsten empfiehlt es sich auch, nach “[deine Branche] in [Standort]” zu googeln und zu überprüfen, ob sie irgendwo unter den ersten 100 Suchergebnissen zu finden sind.Wenn man zum Beispiel nach “plumber in new york” sucht, werden unter anderem die Seiten “Das Örtliche” and “MyHammer” in den Suchergebnissen aufgelistet.Nebenbei bemerkt. Es ist unwahrscheinlich, dass das Eintragen deiner Daten bei allen Websites, die auf der Liste stehen, negative Folgen nach sich ziehen könnte. Jedoch werden sich viele auch nicht richtig lohnen. Letztendlich liegt es also an dir. Was das Eintragen deines Unternehmens bei diesen Websites betrifft, gibt es zwei Möglichkeiten:Den Eintrag manuell anlegenWenn du viel Freizeit besitzen solltest und dich nicht an banalen Aufgaben störst, kannst du deine Einträge bei diesen Websites nacheinander vornehmen. Suche einfach auf jeder Website, die dir relevant und lohnend erscheint, nach deinem Unternehmen. Wenn es bereits eingetragen ist, stelle sicher, dass die Informationen dazu korrekt sind. Wenn sie nicht korrekt sind, versuche den Eintrag anzufordern (die meisten Sites bieten diese Möglichkeit), und korrigiere die Fehler. Sollte dein Unternehmen gar nicht vorhanden sein, füge es hinzu.Wenn du den Eintrag auch anfordern möchtest, um weitere Informationen über dein Unternehmen hinzufügen zu können, dann eignet sich Yelp dafür sehr gut. Mit Yelp kannst du beispielsweise Fotos und viele andere Details hinzufügen, nachdem du Anspruch auf diesen Eintrag erhoben hast.Da dieser Vorgang ziemlich mühsam und zeitaufwendig ist, empfiehlt sich das Tool Business Scan von Yext. Es überprüft automatisch, ob Einträge von deinem Unternehmen auf den “wichtigsten” Websites bereits existieren. Du musst nur deine Geschäftsinformationen eingeben, und schon erhältst du einen Bericht wie diesen:Wenn es “fehlende” oder ungenaue bzw. sogar falsche Einträge gibt, besuche einfach diese Website, suche nach deinem Unternehmen und füge es hinzu oder korrigiere die dazugehörigen Informationen.Einen Einreichungs- und Verwaltungsservice verwendenEs bereitet niemandem Freude, die gleichen Geschäftsinformationen auf verschiedenen Seiten händisch einzureichen. Deshalb haben einige Unternehmen Lösungen dafür entwickelt, um diesen Prozess zu erleichtern. Yext ist vielleicht das bekannteste dieser Unternehmen. Es wird direkt mit Hunderten von bekannten Websites integriert, was bedeutet, dass du deine Zitierungen von einem Ort aus einreichen und verwalten kannst.Du wirst sogar feststellen, dass einige Websites nur Einreichungen über Yext zulassen.Yext ist jedoch nicht das einzige Unternehmen, das Submissions- und Verwaltungsdienste anbietet. Unternehmen wie BrightLocal und Whitespark bieten sie auch an.Ob sich diese Einreichungsdienste lohnen, ist schwer zu sagen. Jeder Suchmaschinenoptimierer wird dazu eine andere Meinung haben. Persönlich würde ich angesichts der Tatsache, dass diese Dienstleistungen alles andere als billig sind, sagen, dass dein Geld wahrscheinlich woanders besser angelegt ist. Ich würde Einträge manuell nur zu den wenigen Websites hinzufügen, die auch am wichtigsten erscheinen — mehr nicht.Schritt #3. Sich bei beliebten Branchen- und lokalen Websites eintragen lassenNachdem du dich nun um die “Basis-Zitierungen” gekümmert hast, besteht der nächste Schritt darin, nach beliebten branchen- und geospezifischen Zitiermöglichkeiten zu suchen.Wenn du zum Beispiel ein Hotel betreibst, solltest du sicherstellen, dass dieses auf TripAdvisor aufgeführt wird. Wenn du ein Anwalt bist, solltest du dich vergewissern, dass du auf findlaw.com aufgeführt wirst. Wenn du ein Immobilienmakler bist, dann solltest du auf realtor.com aufgeführt werden. Also das ist selbsterklärend. Dies sind branchenspezifische Zitiermöglichkeiten.Der physische Standort deines Unternehmens wird weiteren Zitiermöglichkeiten Platz machen. Zum Beispiel wirst du wahrscheinlich bei der örtlichen Handelskammer und anderen lokalen Wirtschaftsverbänden gelistet werden wollen.Es gibt einige Methoden, diese Möglichkeiten zu finden.a) Verwende GoogleSuche auf Google nach einfachen Dingen wie:[Standort] Handelskammer[Standort] Firmenverzeichnis[Branche] Firmenverzeichnis[Branche] BrancheneinträgeEs ist nicht nötig, sich bei all diesen Websites anzumelden. Nutze dein Urteilsvermögen, um selbst abzuwägen, welche Websites es wert sind.b) Verwende Listen, die dir branchenspezifische Möglichkeiten für Zitierungen aufzeigenEs gibt eine ganze Reihe davon online, obwohl die Liste von BrightLocal eine der besten ist. Sie listet beliebte Möglichkeiten für Zitierungen für über 40 Geschäftskategorien auf.c) Verwende das Link-Intersect-Tool von AhrefsDie meisten Zitierungen enthalten den Firmennamen, die ‑Adresse, die ‑Telefonnummer sowie die URL der Website des Unternehmens. Dies ist als NAPW-Zitat bekannt (das “W” steht für “Website”).Obwohl es sich bei diesen Backlinks in der Regel um No-follow-Links handelt, kannst du sie nutzen, um Zitiermöglichkeiten zu entdecken. Suche auf Google einfach nach konkurrierenden Unternehmen und füge dann die Homepage-URLs von drei oder mehreren in das Link Intersect Tool von Ahrefs ein. Füge im unteren Feld deine Homepage-URL hinzu und setze alle Modi auf “URL”.Nebenbei bemerkt. Füge nicht die Homepages von Unternehmensverzeichnissen in das Tool ein. Verwende nur die Homepages von konkurrierenden örtlichen Unternehmen. Wenn du auf “Linkgelegenheiten anzeigen” (“Show link opportunities”) klickst, werden Websites angezeigt, die auf eine oder mehrere der von dir eingegebenen Homepages verweisen, aber nicht auf deine.Es ist jedoch recht schwierig, allein anhand der Liste zu erkennen, warum diese Links existieren. Du solltest also auf das Symbol klicken, um mehr Kontext zu jedem Link zu erhalten.Das obige sieht aus wie ein Verzeichniseintrag. Das können wir feststellen, indem wir die verweisende Seite besuchen.Denke daran, dass es sich hierbei um Websites handelt, von denen du keinen Link hast. Das bedeutet, dass du dort wahrscheinlich noch nicht aufgeführt wirst.Indem du eine Website anklickst, kannst du auch ihre SEO-Kennzahlen ansehen, einschließlich des geschätzten organischen Traffics. So kannst du feststellen, wie beliebt die Website ist und ob ein Eintrag in der Liste für dich wichtig sein könnte.<h3 id=“unstrukturierte-citations-erhalten”/>Schritt #4. Unstrukturierte Citations erhalten</h3>Wenn du es bereits bis zu diesem Schritt geschafft hast, dann hast du wahrscheinlich schon die meisten deiner Konkurrenten übertrumpft, wenn es um strukturierte Zitierungen geht. Worüber wir noch nicht wirklich gesprochen haben, sind unstrukturierte Zitierungen.Unstrukturierte Zitierungen sind eine ganz andere Sache. Sie stammen meist aus Erwähnungen in der Presse, Rezensionen und Blog-Einträgen über dein Unternehmen. Das bedeutet, dass sie schwieriger zu erhalten sind als strukturierte Zitatierungen. Jemand muss sich tatsächlich erst genügend Gedanken um dein Unternehmen machen, um darüber zu schreiben.So wird zum Beispiel Milk Beach, ein Londoner Café, in diesem Artikel von GQ zitiert:Dir ist bestimmt aufgefallen, dass es hier auch einen Backlink zur Website des Cafés gibt — bei diesem Link handelt es sich sogar auch um einen Follow-Link. Das ist bei unstrukturierten Zitierungen üblich — und das ist zum Teil auch der Grund dafür, warum sie so wichtig für die Suchmaschinenoptimierung sind.Nebenbei bemerkt. Nicht alle unstrukturierten Zitierungen enthalten Backlinks. Bei dem oben genannten Beispiel würde es sich immer noch um eine unstrukturierte Zitierung handeln, selbst wenn sie nicht auf die Website des Cafés verweisen würde. Es gibt einige Wege, um Möglichkeiten für unstrukturierte Zitierungen zu finden:Verwende GoogleEine bedeutende Quelle für unstrukturierte Zitatierungen sind Lieferantenseiten. Viele Unternehmen verfügen über solche. Hier werden jene Firmen aufgelistet und verlinkt, die von dem Unternehmen beliefert werden oder die das Unternehmen beliefern.Hier ist ein Beispiel:Diese lassen sich ganz einfach über Google finden. Erstelle einfach eine Liste deiner Lieferanten, mache ihre Websites ausfindig und suche dann nach so etwas wie:site:deinlieferant.com intitle:“Fachhändler”site:deinlieferant.com intitle:“Lieferanten”site:deinlieferant.com intitle:“Kunden”Du kannst auch einfach ihre Websites durchsehen. Es ist normalerweise nicht so schwierig, ihre Lieferantenseiten zu finden, wenn sie über solche verfügen.Verwende HAROHARO (Help A Reporter Out) ermöglicht Journalisten, sich mit Quellen wie beispielsweise Experten zu verbinden. Die Nutzung ist kostenlos und funktioniert wie folgt:Du registrierst dich.Du erhältst täglich E‑Mail-Benachrichtigungen mit Fragen von Journalisten.Du beantwortest eine Frage oder stellst ein Zitat zur Verfügung.Du wirst zitiert, wenn sie deine Aussagen in ihrem nächsten Artikel verwenden.Es kostet zwar etwas Zeit und Mühe, ist aber eine gute Möglichkeit, um qualitativ hochwertige Zitierungen und Links zu erhalten.Verwende den Site Explorer von AhrefsDa die meisten unstrukturierten Zitierungen einen Link zur Website des Unternehmens enthalten, kannst du Möglichkeiten für Zitierungen finden, indem du die Backlinks deiner Konkurrenten überprüfst.Nehmen wir an, du betreibst ein Café in London. Gib einfach die Domäne eines konkurrierenden Unternehmens in den Site Explorer von Ahrefs ein, stelle den URL-Modus ein, gehe zum Bericht Backlinks und filtere dann nach “Dofollow”-Links.Ab hier geht es darum, nach Trends zu suchen, die sich in Chancen verwandeln könnten. Wenn wir zum Beispiel den Bericht für Milk Beach betrachten, gibt es eine Vielzahl an Links und Zitierungen in Quellen, welche den besten “Brunch” in London auflisten.Sind das nützliche Informationen? Das kommt darauf an. Wenn dein Café keinen Brunch anbietet, wahrscheinlich nicht. Aber wenn doch, und wenn deine Kunden regelmäßig davon schwärmen, könnte es sich durchaus lohnen, mit einigen dieser Blogger und Journalisten in Kontakt zu treten.Zum Beispiel zählt diese Bloggerin in diesem Artikel ihre fünf Lieblingsorte für einen Brunch auf:Wenn sie unser Café nicht erwähnt, dann entweder, weil sie noch nie dort war oder weil sie es nicht mochte. Es könnte sich also lohnen, ihr eine freundliche E‑Mail zu schicken und sie vielleicht sogar zum Essen einzuladen. Wenn sie auf unser Angebot eingeht, könnte sie unser Café zu ihrem Blogbeitrag hinzufügen oder sogar eine eigene Rezension schreiben.Hier ist eine weitere Zitierung, die in dem Backlinks-Bericht auffällt:Diese hier stammt von einer Bloggerin, die über glutenfreie Lebensmittel schreibt. Nun, es würde wahrscheinlich keinen Sinn machen, mit ihr in Kontakt zu treten, da sie nicht mehr in Großbritannien lebt. Aber vorausgesetzt wir hätten ein schmackhaftes Angebot für Zöliakie-Betroffene, dann könnten wir nach anderen Bloggern in London suchen, die über glutenfreie Lebensmittel schreiben, und uns an sie wenden.Hier ist zum Beispiel schon eine Seite, die ich mit einer schnellen Google-Suche nach glutenfreien Bloggern in London gefunden habe. Hier werden eine Vielzahl von Unternehmen zitiert:Du siehst, dass dieser Prozess zwar ein wenig an gesunden Menschenverstand und Kreativität erfordert, aber dafür kann er auch einige fantastische Möglichkeiten aufdecken.Funktioniert es für jedes Unternehmen? Natürlich nicht. Wenn du eine Ein-Personen-Band in einer Kleinstadt bist, dann wurden deine Konkurrenten bisher wahrscheinlich auch noch nicht von Journalisten und Bloggern zitiert. Wenn das der Fall ist, deutet das auf wenig Konkurrenz hin, so dass du deinen Konkurrenten wahrscheinlich den Rang ablaufen kannst, indem du einfach auf deine strukturierten Zitierungen setzt.Warum es wichtig ist, dass deine Zitierungen einheitlich und genau sindSowohl bei strukturierten als auch bei unstrukturierten Zitierungen musst du darauf achten, sie genau und einheitlich zu halten. Das bedeutet, dass bei deinen Zitierungen auch immer die selben Daten angegeben werden sollten — also beispielsweise nicht zwei verschiedene Telefonnummern.Dies ist nicht nur schlecht für Local SEO, sondern schwächt auch das Vertrauen der Kunden. Tatsächlich ergab eine Studie, dass sage und schreibe 80% der Kunden das Vertrauen in lokale Unternehmen verlieren, wenn sie online falsche oder inkonsistente Kontaktdaten oder Firmennamen auffinden.Es ist leicht zu verstehen, warum das so ist. Wenn Unternehmen ihre Online-Präsenz nicht im Griff haben, dann nimmt man wahrscheinlich an, dass es sie nicht mehr gibt oder sie einfach unzuverlässig sind.Es gibt jedoch keinen Grund, sich nun allzu sehr um Einheitlichkeit zu bemühen. Wenn du in einem Verzeichnis als “Beanies Coffee Shop” und in einem anderen als “Beanies” geführt wirst, ist das wahrscheinlich kein großes Problem. Solange alles andere übereinstimmt (Adresse, Telefonnummer, Website usw.), wird Google mit ziemlicher Sicherheit in der Lage sein, zwei und zwei zusammenzufügen.Abschließende GedankenFür Local SEO sind Zitierungen sehr wichtig, aber sie sind bei weitem nicht das A und O des Ganzen. Du musst auch dein Google My Business-Profil optimieren, angemessene Keyword Recherchen durchführen, deine On-Page SEO beherrschen und vieles mehr.Unser umfangreicher Leitfaden zur Local SEO ist hierfür sehr nützlich.Hast du noch offene Fragen zum Thema Citations? Schreib mir auf Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Joshua Hardwick Head of Content @ Ahrefs (oder, in einfachen Worten, ich bin der Typ, der dafür sorgt, dass jeder Blog-Post EPISCH wird).",
  "headers": [
    {
      "level": "H1",
      "text": "Wie man Local Citations erstellt (vollständiger Leitfaden)"
    },
    {
      "level": "H2",
      "text": "Warum sind Citations wichtig?"
    },
    {
      "level": "H3",
      "text": "Warum Citations für Local SEO nützlich sind"
    },
    {
      "level": "H3",
      "text": "Wie Citations dabei helfen, dein Unternehmen im Web zu finden"
    },
    {
      "level": "H2",
      "text": "Welche Arten von Citations gibt es?"
    },
    {
      "level": "H3",
      "text": "Strukturierte Citations"
    },
    {
      "level": "H3",
      "text": "Unstrukturierte Citations"
    },
    {
      "level": "H2",
      "text": "Wie erhält man Citations?"
    },
    {
      "level": "H3",
      "text": "Schritt #1. Über die ‘Top‑3’-Datenaggregatoren gelistet werden"
    },
    {
      "level": "H3",
      "text": "Schritt #2. Sich bei den wichtigsten Websites eintragen lassen"
    },
    {
      "level": "H4",
      "text": "Den Eintrag manuell anlegen"
    },
    {
      "level": "H4",
      "text": "Einen Einreichungs- und Verwaltungsservice verwenden"
    },
    {
      "level": "H3",
      "text": "Schritt #3. Sich bei beliebten Branchen- und lokalen Websites eintragen lassen"
    },
    {
      "level": "H4",
      "text": "a) Verwende Google"
    },
    {
      "level": "H4",
      "text": "b) Verwende Listen, die dir branchenspezifische Möglichkeiten für Zitierungen aufzeigen"
    },
    {
      "level": "H4",
      "text": "c) Verwende das Link-Intersect-Tool von Ahrefs"
    },
    {
      "level": "H4",
      "text": "Verwende Google"
    },
    {
      "level": "H4",
      "text": "Verwende HARO"
    },
    {
      "level": "H4",
      "text": "Verwende den Site Explorer von Ahrefs"
    },
    {
      "level": "H2",
      "text": "Warum es wichtig ist, dass deine Zitierungen einheitlich und genau sind"
    },
    {
      "level": "H2",
      "text": "Abschließende Gedanken"
    }
  ],
  "author": "Joshua Hardwick"
}