{
  "url": "https://ahrefs.com/blog/de/lokale-keyword-recherche/",
  "slug": "lokale-keyword-recherche",
  "title": "Wie man eine lokale Keyword-Recherche im Jahr 2021 durchführt",
  "description": "Bei der lokalen Keyword-Recherche geht es darum, Keywords zu finden, nach denen Nutzer bei ihrer Suche nach lokalen Produkten und Dienstleistungen suchen.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (oder, in einfachen Worten, ich bin der Typ, der dafür sorgt, dass jeder Blog-Post EPISCH wird). Inhalt Bei der lokalen Keyword-Recherche geht es darum, Keywords zu finden, nach denen Leute suchen, wenn sie nach lokalen Produkten und Dienstleistungen suchen. Durch das Ranken für diese Keywords erhältst du gezielten lokalen Traffic auf deine Website und kannst mehr Kunden anlocken.Doch wie genau führt man eine lokale Keyword-Recherche durch?In diesem Leitfaden erfährst du:Warum eine lokale Keyword-Recherche wichtig istWie du eine lokale Keyword-Recherche durchführstWie man mit mehreren Standorten umgehtWie sieht es mit Keywords für Blogbeiträge aus?Wie du lokale Keyword-Rankings verfolgstWarum eine lokale Keyword-Recherche wichtig istEine lokale Keyword-Recherche ist wichtig, weil du verstehen musst, was die Leute in Suchmaschinen wie Google eingeben, wenn sie nach den Produkten oder Dienstleistungen deines Unternehmens suchen.Das mag selbstverständlich klingen, aber genau das ist das Problem.Die meisten Leute raten diese Keywords einfach und nehmen an, dass sie wissen, wie die Leute nach ihrem Unternehmen suchen. Das führt oft dazu, dass sie die falschen Keywords anvisieren oder Keywords komplett vernachlässigen, die sich positiv auf ihren Erfolg auswirken könnten.Wenn du zum Beispiel ein Klempner in London bist, hast du wahrscheinlich schon herausgefunden, dass du für Keywords wie “Klempner in London” ranken solltest. Doch was ist mit den anderen Dienstleistungen, die du anbietest? Hast du eine Seite, die sich mit dem Entstopfen von Abflüssen beschäftigt? Weißt du, wie die Leute nach diesen Dienstleistungen suchen?Diese Fragen sollen durch lokale Keyword-Recherche beantwortet werden.Wie du eine lokale Keyword-Recherche durchführstBefolge diese fünf einfachen Schritte:Liste die Dienstleistungen auf, die du anbietestPrüfe auf lokale AbsichtSuchvolumen überprüfenGruppiere und ordne die Keywords den URLs zuSuche nach ‘zu erwähnenden Themen’Schritt 1. Liste die Dienstleistungen auf, die du anbietestBevor du überhaupt mit der Suche nach Keywords beginnst, musst du erst einmal verstehen, welche Dienstleistungen das Unternehmen anbietet. Das solltest du tun, egal ob du lokale Keyword-Recherche für einen Kunden oder dein eigenes Unternehmen machst.Ich würde die folgende Vorgehensweise empfehlen:a) Nachfragen oder BrainstormingWenn du das für dein eigenes Unternehmen machst, hast du wahrscheinlich schon eine gute Vorstellung von den Dienstleistungen, die du anbietest. Notiere sie in einem Textdokument und mache mit dem nächsten Schritt weiter.Wenn du dies für einen Kunden machst, bitte diesen, die Dienstleistungen, die er anbietet, aufzulisten.Diese Übung ist sehr wichtig, denn viele Menschen denken nie bewusst über all die verschiedenen Dienstleistungen nach, die sie anbieten.Ein Klempner könnte zum Beispiel all diese Dienstleistungen anbieten…Abfluss freimachenBoiler-ReparaturenHeizkessel-InstallationWartung des BoilersEinbau von HeizkörpernReparatur von Rohrbrüchen… aber in ihrem Kopf denken sie wahrscheinlich nur an ihre Berufsbezeichnung: Klempner.Die Leute suchen tatsächlich nach “Klempner”, aber viele suchen auch nach spezifischen Dienstleistungen. Deshalb ist es wichtig, als erstes zu verstehen, was man alles anbietet.b) Ideen ausbauenMit einem Brainstorming wirst du nur selten alle relevanten Dienstleistungen aufdecken, nach denen die Leute suchen. Es lohnt sich also, sich eine Minute Zeit zu nehmen, um nach Dienstleistungen zu suchen, die du vielleicht übersehen hast.So funktioniert es am einfachsten:Gib deine Brainstorming-Ideen in den Keywords Explorer ein.Wähle dein Land aus dem DropdownGehe zum Bericht “Gleiche Begriffe”Dies zeigt alle Suchanfragen aus unserer Datenbank, die alle Wörter aus deinen Keywords enthalten (in beliebiger Reihenfolge). Dann musst du nur noch nach Dienstleistungen suchen, die du vielleicht übersehen hast.Wenn wir das zum Beispiel für Sanitärdienstleistungen machen, sehen wir Dinge, die wir übersehen haben, wie “Installation von Kombikesseln”, “Installation von Gaskesseln” und “Installation von Heizkörpern”.wichtigDenke daran, dass du hier nach Dienstleistungen suchst, die du übersehen hast, nicht nach Keywords, die du übersehen hast. Mit anderen Worten, du suchst nicht nach jeder möglichen Art und Weise, wie jemand nach genau der gleichen Sache suchen könnte, wie:KlempnerKlempnerfirmaKlempnerdienstDu suchst im Grunde nur nach Keywords, die zu Dienstleistungen passen.Eine andere Möglichkeit, “übersehene” Dienstleistungen zu finden, ist es, eine Website der Konkurrenz in den Site Explorer von Ahrefs einzutragen und dann im Top-Pages-Bericht nach URLs zu suchen, die auf Dienstleistungen verweisen.Alternativ kannst du auch in der Navigation der Website nachsehen, denn dort sind die Dienstleistungen in der Regel aufgelistet.c) Verfeinere deine ListeWenn du mit einem Kunden zusammenarbeitest, schicke ihm deine Ideen und frage ihn, ob er diese Dienstleistungen anbietet. Füge alle bestätigten Dienstleistungen zu deiner ersten Liste hinzu.Schritt 2. Prüfe auf lokale Absicht Bei der lokalen SEO geht es darum, für Keywords mit lokaler Absicht zu ranken, d.h. die Leute, die danach suchen, suchen explizit nach lokalen Dienstleistungen.Der nächste Schritt ist also zu überprüfen, ob die Leute, die nach diesen Dienstleistungen suchen, tatsächlich lokal einkaufen wollen.Wenn du in der gleichen Gegend wohnst wie das Unternehmen, für das du eine lokale Keyword-Recherche durchführst, ist es am einfachsten, wenn du bei Google nach den jeweiligen Dienstleistungen suchst. Google nutzt deinen Standort, um die Ergebnisse zu personalisieren. Du kannst also feststellen, ob es eine lokale Absicht gibt, indem du die SERP auf zwei Dinge überprüfst:Die Anzeige eines Ortplans bzw. KartenausschnittsLokale Unternehmen, die in den organischen Ergebnissen ranken.Wenn wir zum Beispiel nach “Heizungsinstallation” suchen, sehen wir einen Kartenausschnitt und ein paar lokale Unternehmen in den Suchergebnissen, weil dieses Keyword eine lokale Absicht aufweist.Wenn wir nach “Worcester Boiler” suchen (wir sprechen übrigens von Worcester, der Marke, nicht von Worcester, dem Standort), gibt es keinen Kartenausschnitt und keines der Ergebnisse ist von lokalen Unternehmen. Es scheint, dass dieses Keyword keine lokale Absicht verfolgt und die Suchenden einfach nur einen Worcester-Heizkessel kaufen wollen, um ihn selbst zu installieren.Keywords ohne lokale Absicht kannst du für den nächsten Schritt beiseite legen.Wenn du nicht in der gleichen Gegend wohnst wie das Unternehmen, für das du arbeitest, gibt es einen kleinen Umweg, um die lokale Absicht zu überprüfen:Öffne das Google Ad Preview ToolGib einen Suchbegriff ein (z. B. “Heizungsinstallation”)Lege einen lokalen Standort fest (z.B. Nottingham)Klicke auf “suchen”Du solltest eine lokale SERP sehen, in der du die Rankings lokaler Unternehmen und das Vorhandensein eines Kartenausschnitts überprüfen kannst:Schritt 3. Suchvolumen überprüfenGenaue lokale Suchvolumen für lokale Keywords zu bekommen ist schwer, da so ziemlich jedes große SEO Tool nur landesweite und globale Volumina anzeigt.Die Sache ist aber die: Die Leute machen sich bei der lokalen SEO viel zu viele Gedanken über das Suchvolumen.In neun von zehn Fällen, selbst wenn das Suchvolumen für deine Dienstleistungen sehr gering ist, solltest du trotzdem eine Seite darüber für deine Besucher erstellen.Nehmen wir zum Beispiel eine Dienstleistung wie die Installation eines Heizkessels.Wahrscheinlich suchen in einer kleinen Stadt nur sehr wenige Leute danach. Wenn es sich aber um eine Dienstleistung handelt, die du anbietest, solltest du wahrscheinlich trotzdem eine Seite darüber erstellen, weil es für die Besucher nützlich ist — auch für diejenigen, die dich durch das Googeln von etwas allgemeinem wie “Klempner” gefunden haben.In Anbetracht dieser Tatsache fragst du dich vielleicht: Warum solltest du das Suchvolumen überhaupt überprüfen?Die Antwort ist einfach: Damit du weißt, welche Seiten du bei deinen lokalen SEO-Bemühungen priorisieren musst.Wie findest du lokale Suchvolumen?Es hängt davon ab, ob du das Suchvolumen für implizite oder explizite Keywords überprüfen willst — ein Konzept, das Will Critchlow und Tom Anthony von Distilled in diesem Video aus dem Jahr 2013 erklären:https://youtu.be/uBgJ6E6hSY0?t=301Suchvolumen für implizite Keywords findenImplizite lokale Keywords sind diejenigen, bei denen der Suchende nach einem lokalen Ergebnis sucht, obwohl er seinen Standort nicht in seiner Suchanfrage erwähnt.Beispiele:KlempnerKesseltauschHeizkörper-InstallationDies ist zweifelsohne die Art und Weise, wie die meisten Menschen nach lokalen Unternehmen suchen. Warum sollte man sich die Mühe machen, “Klempner in New York City” einzugeben, wenn man die gleichen Ergebnisse erhält, wenn man einfach “Klempner” eingibt?Doch es gibt ein Problem:Wenn du das Suchvolumen für implizite Keywords im Keywords Explorer (oder einem anderen Keyword-Recherche-Tool) überprüfst, beziehen sich die Schätzungen auf das gesamte Land.Das ist für lokales SEO nicht sehr hilfreich, denn wir müssen wissen, wie viele Leute nach diesen impliziten Keywords in der Region suchen, die wir bedienen.Wie können wir diese Informationen finden?Der Google Keyword Planner ist wohl das beste Tool dafür.So gehst du vor:Öffne den Google Keyword PlannerWähle die Option “Suchvolumen und Prognosen abrufen”.Füge deine impliziten Keywords/Dienstleistungen einÄndere den Standort auf dein ServicegebietJetzt siehst du durchschnittliche monatliche Suchvolumen-Bereiche für implizite lokale Keywords in deinem Gebiet.Suchvolumen für explizite Keywords findenExplizite lokale Keywords sind Keywords, bei denen der Suchende explizit auf seinen Standort verweist.Beispiele:Klempner in NottinghamBoiler-Austausch NottinghamHeizkörperinstallation NottinghamWenn du festgestellt hast, dass die impliziten Suchanfragen für einige deiner Dienstleistungen keine lokale Absicht hatten, kannst du hier einen Standortmodifikator hinzufügen, um sie in explizite Suchanfragen zu verwandeln.Zum Beispiel hat die implizite Suche “worcester boiler” keine lokale Absicht, aber die explizite Suche (“worcester boiler nottingham”) schon:Bei expliziten Keywords musst du dich nicht auf den Google Keyword Planner verlassen, da dir die Suchanfrage selbst den Standort des Suchenden verrät. Du kannst also ein Keyword-Recherche-Tool wie den Keywords Explorer verwenden, um genauere Schätzungen des Suchvolumens für diese Keywords zu erhalten.Schritt 4. Gruppiere und ordne die Keywords den URLs zuBei der lokalen Keyword-Recherche geht es nicht nur darum, herauszufinden, wonach die Leute suchen. Es geht auch darum zu verstehen, wie du diese Keywords nutzen kannst.Die meiste Zeit wird deine Homepage nicht für alle Dienstleistungen, die du anbietest, ranken.Deshalb erstellen die meisten lokalen Unternehmen Seiten für jede einzelne Dienstleistung.Hier kann es ein wenig verwirrend werden, weil es nicht immer offensichtlich ist, welche Dienstleistungen eine eigene Seite brauchen und welche nicht.Nehmen wir zum Beispiel diese Dienstleistungen:Boiler-InstallationInstallation von Kombi-BoilernInstallation eines ÖlkesselsEs ist nicht klar, ob wir eigene Seiten für “Kombi-Boiler-Installation” und “Ölkessel-Installation” brauchen oder ob wir für all diese Begriffe und mehr mit einer Seite über “Boiler-Installation” ranken können.Am besten kannst du das überprüfen, indem du die aktuellen Top-Ranking-Ergebnisse für die Keywords analysierst.Wenn du dir zum Beispiel die Suchergebnisse für “Installation von Ölkesseln” ansiehst, ist die Seite des lokalen Unternehmens auf Platz 4 speziell für die Installation von Ölkesseln und nicht nur für die Installation von Boilern im Allgemeinen.Also, meiner Meinung nach, sollte unsere Seite eine eigene Seite für diese Dienstleistung haben.Wenn wir das Gleiche für “Gaskessel-Installation” machen, sehen wir diese Seite in den Top 10:Da es hier nicht speziell um die Installation von Gaskesseln geht, brauchen wir wahrscheinlich keine eigene Seite für diesen Service. Wir können versuchen, für diesen und ähnliche Begriffe zu ranken, indem wir eine allgemeine Seite über die Installation und den Austausch von Heizkesseln erstellen.Allerdings sollte man bedenken, dass es bei dieser Vorgehensweise einige Feinheiten gibt und es sich nicht um eine exakte Wissenschaft handelt. Wenn du dir zu irgendeinem Zeitpunkt unsicher bist, denke einfach darüber nach, ob die Besucher deiner Seite eine Seite, die einem bestimmten Service gewidmet ist, nützlich finden würden. Wenn es sich so anfühlt, als könntest du ihnen alles, was sie über diesen speziellen Service wissen müssen, auf einer allgemeinen Seite erzählen, ist es wahrscheinlich nicht wert, eine eigene Seite zu erstellen.Schritt 5. Suche nach ‘zu erwähnenden Themen’Sagen wir, eine der Dienstleistungen, die du anbietest, ist die Reparatur von Boilern.Wie erstellst du eine Seite, die lokal für “Boiler-Reparatur” und verwandte Begriffe rankt?Leider ist der Ansatz, den viele Leute hier wählen, Keyword-Stuffing. Das bedeutet, dass sie die populärsten Suchanfragen für eine Dienstleistung finden und genau diese Phrasen in ihrem Text wiederholen.Hier ist ein Beispiel:Das ist der falsche Ansatz. Es macht die Seite nur unübersichtlich.Aber auch wenn du deine Seite nicht mit Keywords überladen solltest, lohnt es sich aus einigen Gründen, nach relevanten “Themen, die man erwähnen sollte” zu suchen: Es kann die ‘thematische Relevanz’ verbessern. Wenn eine Seite über die Installation von Heizkesseln über die Arten von Heizkesseln, die du anbietest, die Preise und die Standorte, die du bedienst, handelt, wird das Google wahrscheinlich helfen, das allgemeine Thema deiner Seite zu verstehen und das Vertrauen haben, sie höher zu ranken. Es kann dir helfen, für Long-Tail Keywordszu ranken. Nicht jeder sucht auf die gleiche Weise nach etwas. Auf 100 Leute, die nach einer Boiler-Reparatur in London suchen, kommen wahrscheinlich eine Handvoll, die nach einer Boiler-Reparatur in Nord-London suchen. Es hilft deinen Besuchern. Leute, die nach einer Boiler-Installation suchen, wollen wahrscheinlich wissen, was du anbietest und wie viel es kosten wird.Schauen wir uns ein paar Möglichkeiten an, wie man das erreichen kann.Überprüfe das Keyword-Ranking für ähnliche SeitenSuche bei Google nach einer deiner Dienstleistungen und suche nach einer gut rankenden Seite von einem lokalen Unternehmen.Gib diese URL in den Site Explorer ein, gehe zum Bericht “Organische Keywords” und filtere nach den Top-10-Rankings.Wenn du dir diese Keywords ansiehst, wirst du häufig Themen entdecken, die du auf deiner Seite erwähnen solltest.Zum Beispiel rankt eine der am besten rankenden Boiler-Reparatur-Seiten in London auch für:Boiler-Reparatur Nord-LondonBoiler-Reparatur Ost-London Obwohl wir nicht genau diese Phrasen in den Inhalt unserer Seite packen wollen, macht es wahrscheinlich Sinn, die Gebiete, die wir bedienen, auf der Seite aufzuführen. Das kann uns potenziell helfen, für Long-Tails zu ranken und gibt potenziellen Kunden das Vertrauen, dass wir ihr Gebiet bedienen.Andere Themen, für die die Seite rankt, sind: Festpreis Boiler-ReparaturReparatur von Gasboilern Notfall Boiler-Reparatur London Kombiboiler-ReparaturEs sieht also so aus, als ob es sich lohnt zu erwähnen, welche Arten von Boilern wir reparieren (Gas, Kombi), ob wir Festpreise anbieten und ob wir für Notfälle verfügbar sind.Es lohnt sich, diesen Vorgang für alle relevanten Top-Ranking-Seiten zu wiederholen, um ein umfassendes Bild davon zu erhalten, wonach Kunden suchen.Top-Ranking-Seiten manuell überprüfenObwohl Keyword-Recherche-Tools wie der Keywords Explorer auf riesigen Datenbanken basieren (unsere enthält über 11 Milliarden Keywords), werden einige lokale Keywords einfach zu selten gesucht, als dass die Tools sie entdecken könnten.Aus diesem Grund lohnt es sich, die Top-Ranking-Seiten von lokalen Unternehmen auf erwähnenswerte Inhalte hin zu überprüfen.Hier sind zum Beispiel ein paar Dinge, die auf einer Top-Ranking-Seite über Boiler-Reparaturen erwähnt werden:Gassicherheits-RegistierungStädtische & Verband-Akkreditierungvaillant, worcester bosch, baxi (d.h. beliebte Boilermarken, die sie reparieren können)Selbst wenn nur ein paar Leute jeden Monat speziell nach “Boiler-Reparatur-Service mit Gassicherheits-Registrierung” in London suchen, wird die Erwähnung dieser Begriffe auf unserer Seite dazu beitragen, potenzielle Kunden zu informieren, Vertrauen aufzubauen und wahrscheinlich zu mehr Aufträgen führen — und das ist der ganze Sinn von lokaler SEO.Wenn du es vorziehst, nicht zu raten, kannst du auch den Bericht “Also talk about” im Ahrefs Keywords Explorer nutzen. Dieser zeigt dir, welche anderen Keywords und Phrasen die Top-Ranking-Seiten für dein Ziel-Keyword häufig erwähnen.Überprüfe häufige FragenLeute, die nach deinen Dienstleistungen suchen, wollen wahrscheinlich ein paar Fragen beantwortet haben, bevor sie dich beauftragen. Es lohnt sich also, nach diesen Fragen zu suchen und sie auf deiner Seite zu beantworten.Es gibt mehrere Möglichkeiten, dies zu tun.Die erste Methode ist, nach deiner Dienstleistung zu suchen und in den Suchergebnissen nach einer “Ähnliche Fragen”-Box zu suchen. Hier werden verwandte Fragen angezeigt, die Suchende auch auf Google stellen.Die zweite Methode ist, die Dienstleistung in den Keywords Explorer von Ahrefs einzugeben und den Fragen-Bericht zu prüfen. Dieser zeigt beliebte Fragen an, die den Namen der Dienstleistung enthalten.Wenn eine dieser Fragen so aussieht, als würden potenzielle Kunden sie wissen wollen, bevor sie mit dir Geschäfte machen, solltest du sie auf deiner Seite beantworten.Wie man mit mehreren Standorten umgehtWenn du Büros oder Läden an mehreren Standorten hast, ist es normalerweise nicht nötig, den gesamten Vorgang von oben für jeden Standort zu wiederholen. Du musst nur die Standorte auf deiner Website angeben.Wenn du nur ein paar Standorte hast, ist die einfachste Lösung, sie alle auf deiner Kontaktseite aufzuführen.Das ist es, was dieser lokale Sandwich-Laden macht:Google rankt deren Homepage dann für relevante explizite lokale Suchen.Wenn du möchtest, kannst du Landing Pages für jeden physischen Standort erstellen.Das ist es, was dieser Buchhalter tut:Wenn wir ihre Website in den Site Explorer von Ahrefs eingeben, sehen wir, dass Google ihre lokalen Landing Pages für relevante, explizite lokale Suchen rankt:Was ist mit Keywords für Blogbeiträge?Da lokale Unternehmen nur ihr lokales Gebiet abdecken, wirst du normalerweise nicht in der Lage sein, Blogbeiträge zu schreiben und diese bei Google zu ranken, die dann auch tatsächlich viel Umsatz generieren.Nehmen wir an, du bist Klempner…Wenn du im Keywords Explorer nach “Klempner” suchst und dir den Bericht “Fragen” ansiehst, siehst du viele Dinge, nach denen deine Kunden suchen könnten, wie z.B.:Wie viel kostet ein Klempner, um ein Bad einzurichten?Wie findet man einen Klempner, dem man vertrauen kann?Wie viel kostet ein Klempner-Notdienst?Das Problem ist, dass diese Suchanfragen selten eine lokale Absicht haben. Selbst wenn du es also schaffst, für diese Suchanfragen zu ranken, werden 99% der Besucher, die du anziehst, nicht aus deinem lokalen Umfeld kommen — und niemals zu Kunden werden.Bedeutet das, dass du keinen auf Keywords fokussierten Content für deinen lokalen Business Blog schreiben solltest?Nicht unbedingt. Keywords sind wirklich nur ein Indikator dafür, wonach die Leute suchen. Wenn viele Leute nach “Wie viel kostet ein Klempner für den Einbau eines Badezimmers” suchen, ist es klar, dass dies etwas ist, was potenzielle Kunden wissen wollen. Du könntest also einen Blogbeitrag zu diesem Thema schreiben, für Besucher, die über andere Wege auf deine Website kommen.Wie du lokale Keyword-Rankings verfolgstWenn du die Keyword-Recherche hinter dir hast und deine Seiten erstellt hast, brauchst du eine Möglichkeit, deine lokalen Keyword-Rankings zu verfolgen. Hier erfährst du, wie du das mit dem Rank Tracker von Ahrefs machen kannst: Öffne dein ProjektKlicke auf “+ Keywords hinzufügen”Wähle dein Land aus dem DropdownBeginne mit der Eingabe deines Gebiets (Stadt/Staat/Zip) in das TextfeldWähle ein Gebiet aus der AuswahllisteFüge deine Keywords hinzuFazitLokale Keyword-Recherche ist ziemlich einfach. Denk aber daran, dass dies nur ein Aspekt der lokalen SEO ist. Du solltest auch dein Google My Business Profil erstellen und optimieren, lokale Erwähnungen aufbauen, deine Seiten optimieren, Bewertungen einholen und vieles mehr. Erfahre mehr in unserem umfangreichen Leitfaden für lokale SEO.Hast du noch Fragen? Schreib mir auf Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Joshua Hardwick Head of Content @ Ahrefs (oder, in einfachen Worten, ich bin der Typ, der dafür sorgt, dass jeder Blog-Post EPISCH wird).",
  "headers": [
    {
      "level": "H1",
      "text": "Wie man eine lokale Keyword-Recherche im Jahr 2021 durchführt"
    },
    {
      "level": "H2",
      "text": "Warum eine lokale Keyword-Recherche wichtig ist"
    },
    {
      "level": "H2",
      "text": "Wie du eine lokale Keyword-Recherche durchführst"
    },
    {
      "level": "H3",
      "text": "Schritt 1. Liste die Dienstleistungen auf, die du anbietest"
    },
    {
      "level": "H4",
      "text": "a) Nachfragen oder Brainstorming"
    },
    {
      "level": "H4",
      "text": "b) Ideen ausbauen"
    },
    {
      "level": "H4",
      "text": "c) Verfeinere deine Liste"
    },
    {
      "level": "H3",
      "text": "Schritt 2. Prüfe auf lokale Absicht"
    },
    {
      "level": "H3",
      "text": "Schritt 3. Suchvolumen überprüfen"
    },
    {
      "level": "H4",
      "text": "Suchvolumen für implizite Keywords finden"
    },
    {
      "level": "H4",
      "text": "Suchvolumen für explizite Keywords finden"
    },
    {
      "level": "H3",
      "text": "Schritt 4. Gruppiere und ordne die Keywords den URLs zu"
    },
    {
      "level": "H3",
      "text": "Schritt 5. Suche nach ‘zu erwähnenden Themen’"
    },
    {
      "level": "H4",
      "text": "Überprüfe das Keyword-Ranking für ähnliche Seiten"
    },
    {
      "level": "H4",
      "text": "Top-Ranking-Seiten manuell überprüfen"
    },
    {
      "level": "H4",
      "text": "Überprüfe häufige Fragen"
    },
    {
      "level": "H2",
      "text": "Wie man mit mehreren Standorten umgeht"
    },
    {
      "level": "H2",
      "text": "Was ist mit Keywords für Blogbeiträge?"
    },
    {
      "level": "H2",
      "text": "Wie du lokale Keyword-Rankings verfolgst"
    },
    {
      "level": "H2",
      "text": "Fazit"
    }
  ],
  "author": "Joshua Hardwick"
}