{
  "url": "https://ahrefs.com/blog/de/long-tail-keywords/",
  "slug": "long-tail-keywords",
  "title": "Long-Tail Keywords: Was sie sind und wie man mit ihnen Such-Traffic generiert",
  "description": "Long-Tail Keywords sind Suchanfragen, die eine geringe Anzahl von Suchen pro Monat erhalten. Sie sind meist länger und spezifischer als Head Keywords.",
  "content": "Tim Soulo Tim ist CMO und Produktberater bei Ahrefs. Vor allem aber ist er der größte Fan und der wahrste Missionar des Unternehmens. Erfahren Sie mehr über Tim Inhalt Oft heißt es, dass Long-Tail-Keywords leichter zu ranken sind und für mehr Conversions sorgen. Doch ist das wirklich so?Es kommt darauf an. Es gibt zwei verschiedene Arten von Long-Tail-Keywords — und manche sind nicht einfacher zu ranken als ihre Short-Tail-Pendants.In diesem Artikel lernst du die Unterschiede zwischen den beiden Arten von Long-Tail-Keywords kennen, und wie du sie finden kannst. Doch zunächst zu den wichtigsten Punkten, die wir behandeln werden:Was sind Long-Tail-Keywords?Warum nennt man sie Long-Tail-Keywords?Warum sind Long-Tail-Keywords so toll?Wie findet man Long-Tail-Keywords?Die zwei Arten von Long-Tail-KeywordsWas sind Long-Tail-Keywords?Bei Long-Tail-Keywords handelt es sich um Suchanfragen, die nur eine geringe Anzahl von Suchen pro Monat erhalten. Sie sind in der Regel länger und spezifischer als ihre “Haupt”-Konterparts und haben daher oft eine höhere Conversion-Rate.Das Keyword “Meditation” ist zum Beispiel ein “Head”-Keyword, weil es 211.000 Suchanfragen pro Monat erhält. Das Keyword “Kann Meditation dich schlauer machen” ist ein Long-Tail-Keyword, weil es nur 50 Suchanfragen pro Monat erhält.Warum nennt man sie Long-Tail-Keywords?Long-Tail-Keywords haben ihren Namen von ihrer Position auf der “Such-Nachfragekurve”. Wenn wir alle Suchanfragen aufzeichnen, die im Laufe eines Monats bei Google gestellt wurden, und sie nach ihrem Suchvolumen ordnen, sieht das ungefähr so aus:Am “Kopf” der Kurve gibt es eine winzige Anzahl von Keywords mit sehr hohem Suchvolumen, während der “Schwanz” aus Milliarden von Keywords mit sehr niedrigem Suchvolumen besteht.Um genau zu sein, gibt es in der US-Datenbank von Ahrefs (die übrigens die größte in der Branche ist) nur 31.000 Keywords mit einem Suchvolumen von mehr als 100.000 Suchen pro Monat; auf der anderen Seite gibt es 3,8 Milliarden Keywords mit weniger als 10 Suchen pro Monat.So sieht das in einem Tortendiagramm aus:Wie du siehst, machen Keywords mit weniger als 10 Suchanfragen pro Monat fast 95% in unserer US-amerikanischen Keyword-Datenbank aus. Das sollte eigentlich nicht überraschen, wenn man bedenkt, dass ~15% der täglichen Google-Suchanfragen neu sind und noch nie gestellt wurden.95% aller Suchanfragen in den USA weisen weniger als 10 Suchen pro Monat auf.Um als “Long-Tail” zu gelten, muss ein Keyword aber nicht unbedingt weniger als 10 Suchanfragen pro Monat erhalten. Es gibt auch keinen bestimmten Schwellenwert für das Suchvolumen, ab dem ein Keyword als “Long-Tail” gilt. Es hängt hauptsächlich von dem Keyword ab, mit dem du es vergleichst. Ein großer Fehler ist es jedoch, Long-Tail-Keywords nach ihrer Wortanzahl zu definieren.Es gibt nämlich viele Keywords, die nur aus einem Wort bestehen und weniger als 100 Suchanfragen pro Monat erhalten. Es gibt aber auch Keywords, die fünf Wörter lang sind (oder mehr) und hunderttausende von monatlichen Suchanfragen aufweisen.Es ist also nicht die Länge eines Keywords, die es zu einem Long-Tail-Keyword macht. Es ist das Suchvolumen für dieses Keyword.Warum sind Long-Tail-Keywords so toll?Hier sind drei Gründe, warum du Long-Tail-Keywords zu einem festen Bestandteil deiner SEO-Strategie machen solltest.Grund #1. Long-Tail-Keywords sind (in der Regel) viel weniger umkämpftAngenommen, du hast gerade einen Blog über Kryptowährungen gestartet. Es gibt viele beliebte Keywords mit hohem Suchvolumen, die deinem Blog jede Menge Traffic bescheren könnten:Diese Keywords sind sehr verlockend. Aber seien wir mal ehrlich. Wie groß sind die Chancen, dass dein Blog in absehbarer Zeit für eines dieser Keywords ranken wird?Alle oben genannten Keywords haben einen hohen Keyword-Schwierigkeitswert (KD). Das bedeutet, dass es unglaublich schwer sein wird, bei Google auf die erste Seite zu gelangen. Und wenn deine Website ganz neu ist, ist das schlichtweg unmöglich. Schauen wir uns nun einige der weniger beliebten Suchanfragen zum Thema Bitcoin an:Wie du sehen kannst, ist ihr KD-Score dieses Mal niedrig. Das bedeutet, dass auch eine neue Website eine Chance hat, in den Top 10 der Suchergebnisse zu ranken und ein paar Besucher über diese Keywords zu bekommen.Grund #2. Long-Tail-Keywords sind (in der Regel) einfacher zu beantwortenVergleichen wir noch einmal die beiden oben genannten Keywords. “Wie kaufe ich Bitcoin?” scheint eine recht einfach zu beantwortende Frage zu sein. Aber wenn du dir die am besten rankende Seite für diese Suchanfrage ansiehst, umfasst die Seite tatsächlich 3.400 Wörter. Umgekehrt enthält die am besten rankende Seite für “wie man große Mengen Bitcoin auszahlen kann” nur 1.000 Wörter.Je allgemeiner die Suchanfrage ist, desto mehr Details musst du angeben, um sie zu beantworten. Wenn die Suchanfrage jedoch spezifisch ist, kannst du sie oft recht kurz beantworten und die Suchenden trotzdem zufriedenstellen.Mit anderen Worten: Die Erstellung von Inhalten für Long-Tail-Keywords erfordert in der Regel weniger Arbeit.Außerdem kannst du nach Gruppen ähnlicher Long-Tail-Suchanfragen suchen und sie mit Seiten beantworten, die nur wenige Unterschiede aufweisen. Schau dir zum Beispiel die folgende Gruppe von Keywords an:Die gleiche Website-Software (Website Builder) würde wahrscheinlich für Therapeuten genauso gut geeignet sein wie für Lehrer oder Schauspieler. Das bedeutet, dass du all diese unterschiedlichen Suchanfragen mit Seiten ansprechen kannst, die zu 80% ähnliche Inhalte haben, während die restlichen 20% auf das jeweilige Nutzerprofil zugeschnitten sind.Mit anderen Worten: Du kannst leicht ein Dutzend Seiten an einem Tag erstellen, um diese ähnlichen Suchanfragen zu beantworten.Grund #3. Es gibt VIELE davonJa, ein einzelnes Long-Tail-Keyword wird keine Flut von Traffic für deine Website generieren können. Aber sobald du auf immer mehr von ihnen setzt, wird sich der Such-Traffic irgendwann zu einem beachtlichen Wert steigern.Und da es in so gut wie jeder Branche eine Vielzahl von Long-Tail-Keywords gibt, ist es unwahrscheinlich, dass du unter einem Mangel an ihnen leidest.Zurück zu meinem Beispiel mit den Keywords “bester Website-Builder für __”. Eine Suche im Keywords Explorer von Ahrefs liefert über Tausend davon:Wie findet man Long-Tail-Keywords?Es gibt eine Reihe von Methoden, mit denen du Long-Tail-Keywords finden kannst. Manche sind mühsamer als andere, manche sind etwas “unkonventionell” und manche sind schlichtweg falsch.Beginnen wir mit einer falschen Methode.1. Nutze Google Autosuggest… NICHTEinige SEO-Experten raten dir, Long-Tail-Keywords mit Google Autosuggest zu suchen, indem du dein Keyword gefolgt von verschiedenen Buchstaben des Alphabets eingibst.Google Autosuggest ist eine Funktion, die dir einen schnellen Zugriff auf beliebte Suchanfragen ermöglicht. Wenn wir uns die Suchvolumina der Keywords im obigen Screenshot ansehen, werden wir feststellen, dass die meisten von ihnen eine recht ordentliche Anzahl von Suchanfragen aufweisen.Mit anderen Worten: Google Autosuggest bietet dir viel eher sehr beliebte Suchanfragen als die begehrten Long-Tails.Das Gleiche gilt für Online-Tools wie Answer The Public oder Soovle, die Autosuggest nutzen, um ihre Listen mit Keyword-Vorschlägen zu erstellen. Viele ihrer Keyword-Vorschläge werden sich als ziemlich populär und umkämpft herausstellen.2. Nutze den Keywords Explorer von AhrefsAnders als bei der vorherigen Methode ist bei dieser keine mühsame manuelle Arbeit nötig. Suche einfach im Keywords Explorer nach einem beliebigen Wort, das deine Nische/Branche definiert und verwende den Suchvolumenfilter, um sofort Tausende von Long-Tail-Keywords angezeigt zu bekommen. Wenn deine Website brandneu ist und eine niedrige Autorität aufweist, empfehle ich dir den KD-Filter, der dir hilft, die am wenigsten wettbewerbsfähigen Keywords zu finden.Probiere auch unbedingt die Schaltfläche “Fragen” aus. Er liefert oft coole Long-Tail-Suchanfragen, die als Fragen formuliert sind:3. Erfahre, für welche Keywords deine Konkurrenten rankenEine weitere gute Quelle für Long-Tail-Keywords sind deine Konkurrenten. Mit dem Site Explorer von Ahrefs kannst du sehen, für welche Long-Tail-Keywords sie ranken.Nimm einfach die Website deines Konkurrenten, gib sie in den Site Explorer ein und rufe den Bericht “Organische Keywords” auf, um zu sehen, welche Long-Tail-Keywords Traffic auf ihre Website bringen:Wiederhole das mit 5–10 Websites deiner Konkurrenten, und du wirst genug Ideen für Long-Tail-Keywords sammeln, die dich für die nächsten Monate beschäftigen werden.4. Durchsuche Reddit, Quora und Nischen-ForenWenn Menschen bei Google keine gute Antwort auf ihre Frage finden, stellen sie in Foren wie Quora und Reddit.Ich habe zum Beispiel nach dem Thema “Marketing” auf Quora gesucht und diesen Beitrag gesehen:Ein kurzer Check im Keywords Explorer ergab, dass es sich bei “Marketing-Manipulation” eigentlich um ein Long-Tail-Keyword mit einem niedrigen KD-Score handelt.Der Vorteil dieser Methode ist, dass diese Forenbeiträge möglicherweise gute Diskussionen enthalten, die bei der Erstellung eines Inhalts zu diesem Thema nützlich sein können.Der Nachteil ist, dass es ziemlich mühsam ist, Long-Tail-Keywords aus Foren zu finden. Und du musst immer noch ein SEO-Tool wie den Keywords Explorer benutzen, um das Suchvolumen und die KD deiner Keyword-Ideen zu überprüfen.Die Sache ist nur die, dass das gleiche Keyword in erster Linie auch im Keywords Explorer gefunden werden kann:Die zwei Arten von Long-Tail-KeywordsNicht alle Long-Tail-Keywords sind gleich. Einige von ihnen stellen eine einzigartige Suchanfrage dar, während andere lediglich eine weniger beliebte Variante einer beliebteren Suchanfrage sind.Wir nennen erstere “thematische Long-Tail-Keywords” und letztere “unterstützende Long-Tail-Keywords”.Unterstützende Long-Tail-KeywordsLass es mich anhand eines Beispiels erklären. “Beste gesunde Leckerlis für Hunde” ist definitiv ein Long-Tail-Keyword, weil es nur 100 Suchanfragen pro Monat erhält:Aber es gibt noch ein paar andere Suchanfragen, die das Gleiche bedeuten, aber ein viel größeres Suchvolumen aufweisen:Wenn du nach jedem dieser Keywords bei Google suchst, wirst du feststellen, dass dieselben Seiten für jedes dieser Keywords ganz oben ranken. Google ist schlau genug, um zu verstehen, dass verschiedene Menschen ihre Suchanfragen unterschiedlich formulieren, obwohl sie nach genau demselben suchen. Deshalb ranken die gleichen Seiten für alle diese Keyword-Variationen.Das heißt, wenn deine Seite für eine beliebte Suchanfrage wie “gesunde Hundeleckerlis” (6.800 Suchanfragen) rankt, wird sie automatisch auch für alle Long-Tail-Varianten der Anfrage gerankt. Du musst also nicht für jede Long-Tail-Variante eine eigene Seite erstellen. Stattdessen solltest du sie alle mit einer einzigen Seite abdecken.Aber woher weißt du, ob ein Long-Tail-Keyword zu einem breiteren Thema gehört oder nicht?Nun, wir bei Ahrefs haben genau dafür eine einzigartige Funktion entwickelt.Sie heißt Parent Topic.Wenn du ein Keyword in den Keywords Explorer eingibst, überprüfen wir die am besten rankende Seite für dieses Keyword und schauen, ob es eine beliebtere Suchanfrage gibt, für die diese Seite rankt.So sieht das für “beste gesunde Leckerlis für Hunde” aus:Wie du auf dem Screenshot oben sehen kannst, hat dieses Long-Tail-Keyword eine viel beliebtere Variante: “Gesündeste Hundeleckerlis” (2.500 Suchanfragen). Wenn du es schaffst, für diese Suchanfrage zu ranken, rankst du automatisch auch für das unterstützende Long-Tail-Keyword.Thematische Long-Tail-KeywordsSchauen wir uns jetzt eine andere Art von Long-Tail-Keywords an: “Fliegenbisse an Hundeohren”.Dieses Mal ist das übergeordnete Thema dasselbe wie das ursprüngliche Keyword. Das bedeutet, dass unser Keyword tatsächlich die beliebteste Art ist, nach dieser Sache zu suchen. Du kannst dieses Long-Tail-Keyword mit einer eigenen Seite ansprechen.Und wenn du es schaffst, für dieses aktuelle Long-Tail-Keyword zu ranken, rankst du automatisch auch für alle weniger beliebten “unterstützenden” Suchanfrage-Varianten:Aber leider ist es nicht immer so einfach.Schauen wir uns eine letzte Suchanfrage an: “Natürliche Schlafhilfe für Hunde”.Das Parent Topic legt nahe, dass dieses Long-Tail-Keyword nur eine Variation der Suchanfrage “Schlafhilfe für Hunde” darstellt (1.600 Suchanfragen).Aber ich denke, das Wort “natürlich” im ursprünglichen Keyword unterscheidet es von dem vorgeschlagenen Parent Topic. Die Menschen, die danach suchen, scheinen nach einer natürlichen Alternative zu den üblichen pharmazeutischen Mitteln zu suchen.Und wenn wir uns die Top-Suchergebnisse für dieses Keyword ansehen, scheint keines von ihnen von einer “natürlichen Schlafhilfe” zu handeln. Vielmehr geht es um “Schlafmittel” im Allgemeinen:Es macht also durchaus Sinn, einen eigenen Artikel für das Keyword “Natürliche Schlafhilfe für Hunde” zu erstellen. Die Chancen stehen gut, dass er für diese Suchanfrage auf Platz 1 rankt — auch wenn es keine anderen Artikel gibt, die dieses Thema behandeln.Mit anderen Worten: Du solltest nicht immer blind auf das vertrauen, was das Parent Topic dir vermittelt. Es ist nur ein Computer-Algorithmus und hat seine Schwächen und Grenzen. Es ist immer eine gute Idee, die am besten rankenden Seiten für dein Keyword zu analysieren und herauszufinden, ob deine Suchanfrage ein eigenständiges Thema oder einen Teil eines umfassenderen Themas darstellt.FazitDas ist alles, was ich im großen und Ganzen über Long-Tail-Keywords zu sagen habe. Das ist auch das, was sie so großartig macht.Ich hoffe, dieser Artikel hilft dir, deine SEO-Strategie zu verfeinern und den Such-Traffic auf deiner Website zu erhöhen.Wenn du weitere Fragen hast, schreib mir gerne auf Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Tim Soulo Tim ist CMO und Produktberater bei Ahrefs. Vor allem aber ist er der größte Fan und der wahrste Missionar des Unternehmens. Erfahren Sie mehr über Tim",
  "headers": [
    {
      "level": "H1",
      "text": "Long-Tail Keywords: Was sie sind und wie man mit ihnen Such-Traffic generiert"
    },
    {
      "level": "H2",
      "text": "Was sind Long-Tail-Keywords?"
    },
    {
      "level": "H2",
      "text": "Warum nennt man sie Long-Tail-Keywords?"
    },
    {
      "level": "H2",
      "text": "Warum sind Long-Tail-Keywords so toll?"
    },
    {
      "level": "H3",
      "text": "Grund #1. Long-Tail-Keywords sind (in der Regel) viel weniger umkämpft"
    },
    {
      "level": "H3",
      "text": "Grund #2. Long-Tail-Keywords sind (in der Regel) einfacher zu beantworten"
    },
    {
      "level": "H3",
      "text": "Grund #3. Es gibt VIELE davon"
    },
    {
      "level": "H2",
      "text": "Wie findet man Long-Tail-Keywords?"
    },
    {
      "level": "H3",
      "text": "1. Nutze Google Autosuggest… NICHT"
    },
    {
      "level": "H3",
      "text": "2. Nutze den Keywords Explorer von Ahrefs"
    },
    {
      "level": "H3",
      "text": "3. Erfahre, für welche Keywords deine Konkurrenten ranken"
    },
    {
      "level": "H3",
      "text": "4. Durchsuche Reddit, Quora und Nischen-Foren"
    },
    {
      "level": "H2",
      "text": "Die zwei Arten von Long-Tail-Keywords"
    },
    {
      "level": "H3",
      "text": "Unterstützende Long-Tail-Keywords"
    },
    {
      "level": "H3",
      "text": "Thematische Long-Tail-Keywords"
    },
    {
      "level": "H2",
      "text": "Fazit"
    }
  ],
  "author": "Tim Soulo"
}