{
  "url": "https://ahrefs.com/blog/de/marketing-faehigkeiten/",
  "slug": "marketing-faehigkeiten",
  "title": "7 nützliche Marketingfähigkeiten (mit denen ich meine Karriere vorangetrieben habe)",
  "description": "Das sind die Marketingfähigkeiten, die einem digitalen Marketingexperten geholfen haben, auf seiner Reise Erfolg zu haben - sechs Jahre lang und mehr.",
  "content": "Si Quan Ong Marketing @ Ahrefs. Ich lese, mache Breakdance und versuche zufäliige Lebensexperimente. Inhalt Es wird immer wieder darüber diskutiert, welche Fähigkeiten Marketer lernen sollten.Der eine sagt, es ist Copywriting, der andere, es ist Coding. Eine Person sagt, es ist Branding, eine andere, es ist strategisches Denken. Wenn man dann noch Performance Marketing, Data Science und Soft Skills wie Führungskompetenzen in diesen Mix integriert, erkennt man schnell, dass die Liste endlos ist.Gibt es eine richtige oder falsche Antwort? Ich glaube nicht. Denke doch mal darüber nach: Karriereberatung ist autobiographisch. Es hängt von der Marketingfunktion ab, die du ausübst und welche Fähigkeiten du auf dem Weg erworben hast, die nützlich waren. Schließlich können wir die Zukunft nicht vorhersagen; wir können nur auf unsere Vergangenheit zurückblicken.Und genau so werde ich diesen Beitrag angehen.Anstatt dir zu sagen, was du lernen sollst, werde ich dir die Fähigkeiten verraten, die mir auf meiner Reise als Digital Marketer geholfen haben — sechs Jahre lang und mehr.CopywritingContent-MarketingSEOE‑Mail-OutreachNetworkingArbeitspriorisierungExperimentelle Denkweise1. CopywritingVor sieben Jahren habe ich ein Buch mit dem Titel The Education of Millionaires gelesen. Das Buch betonte die Wichtigkeit von Copywriting, was mein Interesse weckte. Später las ich mehrere Bücher zu diesem Thema, übte mich in der Erstellung meines eigenen Newsletters und schrieb schließlich den Großteil der Texte für den Blog, die Landing Pages und die E‑Mails meiner Website. Und genau das mache ich seither — ich schreibe Werbetexte und erstelle Content für Unternehmen, für die ich arbeite.Im digitalen Marketing zu arbeiten bedeutet, dass es fast unmöglich ist, das Schreiben zu vermeiden. Egal ob es um die Erstellung eines Blogbeitrags, einen Tweet, einen Werbetext oder ein Video geht, man schreibt.Wenn es dir also nicht gelingt, die Aufmerksamkeit von jemandem mit deinen Worten zu erregen und zu halten, werden deine Marketingkampagnen immer weniger effektiv sein als sie sein könnten. Die Leute werden nicht auf deine Facebook-Werbung klicken, deine Blogbeiträge nicht lesen und deine Tweets ignorieren.Deshalb ist es so wichtig zu lernen, wie man gut schreibt.Want to improve your writing skills? My unconventional advice: Skip the usual books and learn copywriting.Copywriters write with clarity and simplicity. No fluff. They get straight to the point. Strong recommend.— David Perell (@david_perell) March 28, 2019 Willst du deine Schreibfertigkeiten verbessern? Mein unkonventioneller Rat: Überspringe die üblichen Bücher und lerne Copywriting. Copywriter schreiben einfach und klar. Kein Schnickschnack. Sie kommen direkt auf den Punkt. Sehr zu empfehlen.Wenn du Copywriting lernst, lernst du auch die Grundlagen des Marketings. Um großartige Texte zu schreiben, musst du wissen, an wen du verkaufst. Du musst deine Kunden recherchieren — du musst wissen, was sie wollen, brauchen und wie sie kommunizieren. All das wird dich zu einem besseren Marketer machen.Wie du damit anfängstAls erstes solltest du vergessen, was du in der Schule gelernt hast. Schreiben für den Online-Bereich unterscheidet sich vom schulischen Schreiben. Wenn du so schreibst, wie du es in der Schule getan hast, wird dein Blog keine Leserschaft finden.Als nächstes solltest du dir ein paar Ratgeber besorgen, die dir die Grundlagen von gutem Copywriting vermitteln. Hier sind einige, die ich persönlich genutzt habe: The Boron Letters (Buch) The Adweek Copywriting Handbook (Buch) Ogilvy on Advertising (Buch) The Halbert Copywriting Method Part III (Buch) Kopywriting Kourse (Kostenpflichtiger Kurs)Es lohnt sich auch, ein paar Bücher über Psychologie und die Kunst der Überzeugung zu lesen, da sie die Grundlage für gute Texte darstellen: Influence (Buch) Made to Stick (Buch) Contagious (Buch)Schließlich musst du schreiben. Da führt kein Weg dran vorbei. Um zu lernen, wie man schreibt, musst du auch tatsächlich schreiben. Erstelle eine Website, bewirb dich für ein Praktikum, tweete — das von dir gewählte Medium spielt keine Rolle, fang einfach an zu üben.2. Content-MarketingDamals hatte ich nicht allzu viele Ressourcen, die ich nutzen konnte. Also schien mir das Bloggen eine gute Möglichkeit zu sein, Traffic auf meine Website zu bekommen, ohne viel Geld auszugeben. Das führte mich natürlich zu Content-Marketing.Content-Marketing ist heute sehr angesagt. Schau dir den kometenhaften Anstieg des Interesses über die Zeit an:Daten von Google TrendsLaut HubSpot investieren 70% der Marketer aktiv in Content Marketing. Es gibt tonnenweise Beispiele von Personen, die Content Marketing nutzen, um erfolgreiche Unternehmen aufzubauen. Ahrefs ist eines davon. Es gibt aber auch andere wie Luxy Hair, Beardbrand, Shopify, etc.Also, warum ist Content Marketing so beliebt? Ein paar Gründe: Es nährt und konvertiert Leads. Die meisten Leute entscheiden sich nicht sofort für einen Kauf. Stattdessen begeben sie sich auf eine “Reise” — sie suchen, lesen Bewertungen, konsumieren Inhalte und sprechen mit anderen Personen. Content Marketing hilft dir, jede Phase dieser Reise abzudecken. Es klärt potenzielle Kunden auf. Kunden sind eher bereit, dein Produkt zu kaufen, wenn sie wissen, wie sie es verwenden können, um ihre Probleme zu lösen. Content Marketing schafft hier Abhilfe.Empfohlener Artikel: Warum ist Content Marketing wichtig? 5 Gründe Wie du damit anfängstGutes Texten ist nur ein Aspekt des Content-Marketings. Du musst auch den Rest kennen — Strategie, Themenrecherche, Erstellung der richtigen Art von Content, Content Promotion, etc.Lies zunächst diesen tollen Beitrag von Fio, der dir ein gutes Verständnis für das Thema vermittelt.Als nächstes solltest du dir diesen kostenlosen Kurs über das Bloggen für Unternehmen ansehen.Er dauert fünf Stunden, aber das ist es wert. Es wird dir alles beigebracht, was du wissen musst, um Traffic für deinen Blog zu generieren. Sogar erfahrene Marketer haben das eine oder andere noch gelernt.Me, an hour ago: I guess I’ll check out @timsoulo’s blogging for business course… but I doubt I’ll learn anything.Me, right now: *eyes glued to the screen, desk covered in notes*Well played, Tim.https://t.co/k3AnL3laos via @ahrefs #seo #contentmarketing pic.twitter.com/KkXGOxCJYH— Kyle Byers (@Kyle_Byers) May 8, 2018 Ich vor einer Stunde: Ich schätze, ich werde mir den Kurs von @timsoulo über das Bloggen für Unternehmen anschauen… aber ich bezweifle, dass ich etwas lernen werde. Ich jetzt gerade: *Augen kleben am Bildschirm, Schreibtisch voller Notizen*. Gut gespielt, Tim.Möchtest du mehr über Content-Marketing lernen? Hier gibt es weitere Informationsquellen:Wie du eine erfolgreiche Content-Marketing-Strategie entwickelst (9 Schritte)7 inspirierende Content-Marketing-Beispiele (und wie du sie wiederholst)Was ist B2B-Content-Marketing? 7 erfolgreiche BeispieleWie du in 9 Schritten einen Blogbeitrag schreibst (den die Leute tatsächlich lesen wollen)Content-Promotion-Checkliste für Anfänger3. Suchmaschinenoptimierung (Search Engine Optimization — SEO)Nachdem ich eine Weile gebloggt hatte, bemerkte ich, dass es ein Muster gab. Die meisten Artikel erzielten am Anfang Traffic, aber nach einiger Zeit verblasste dieser.Im Gegensatz dazu waren die Blogbeiträge, die stetig mehr Traffic erzielten, diejenigen, die bei Google rankten.Das herauszufinden, führte mich zur SEO.Das Erlernen von SEO hat mein Verständnis von Content-Marketing enorm erweitert. Anstatt ziellos im Hamsterrad der Content-Erstellung zu laufen und zu versuchen, mehr Traffic zu bekommen, indem ich mehr Content veröffentlichte, lehrte mich SEO, wie man Evergreen-Content erstellt, der auf Dauer passiven Traffic erzielt.Außerdem ist SEO-getriebenes Content-Marketing langfristig oft günstiger.Zum Beispiel rankt der Ahrefs-Blog für ~175.000 Keywords und generiert geschätzte 373.000 monatliche Zugriffe über die Suche.Aus dem Ahrefs Site ExplorerWenn wir all diesen Traffic über Google-Anzeigen akquirieren müssten, würde uns das $965.000 pro Monat (oder $11,58 Mio. jährlich) kosten. Wenn man bedenkt, dass wir nicht annähernd so viel für die Erstellung von Content ausgeben, wird deutlich, dass dies auf lange Sicht günstiger ist als bezahlte Anzeigen.Empfohlener Artikel:Warum SEO wichtig ist: 8 unbestreitbare Fakten und FallstudienWie du damit anfängstSchau dir dieses Video an, um zu verstehen, worum es bei SEO geht:https://www.youtube.com/watch?v=DvwS7cV9GmQWenn du dich dann mit den verschiedenen Unterthemen von SEO beschäftigen möchtest, empfehle ich dir, diese Infoquellen durchzugehen:Keyword-Recherche: Der Anfänger-Leitfaden von AhrefsOn-Page SEO: Umfassender Anfänger-LeitfadenDer Anfänger-Leitfaden zum Thema Linkaufbau Was ist technische SEO? 11 Best-Practice-Beispiele SEO-Kurs für Anfänger (von Ahrefs)4. E‑Mail-OutreachE‑Mail-Outreach bildet die Grundlage für den Großteil der Marketingaktivitäten. Partnerschaften, Events, Networking, Business Development, Linkaufbau — sie alle erfordern, dass du eine “kalte E‑Mail” versendest.Selbstverständlich ist das Wissen, wie man eine gute E‑Mail versendet, ausschlaggebend dafür, ob du das bekommst, was du willst, oder ob du ignoriert wirst.Wie du damit anfängstNur weil du jederzeit eine E‑Mail an jedermann senden kannst, bedeutet das nicht, dass deine E‑Mails immer willkommen sind. Je beschäftigter oder berühmter eine Person ist, desto mehr “Spam”-E-Mails erhält sie in ihrem Posteingang. Wenn du keine guten Outreach-Skills praktizierst, wird deine E‑Mail zu dieser Gruppe gehören und direkt im Papierkorb landen.Wie solltest du nun also vorgehen? Du musst dir überlegen, was für die Person dabei herausspringt, die du anschreibst. Klar, du kontaktierst sie, weil du etwas willst… aber was hat sie davon? Warum sollte sie dir helfen?Nimm dir jedes Mal einen Moment Zeit, um darüber nachzudenken, wenn du eine E‑Mail schreibst. Es könnte sein, weil:Du hast sie oder ihre Arbeit in einem Beitrag erwähnt.Du hast etwas Neues, Interessantes oder Einzigartiges, das du ihnen zeigen möchtestDu lädst sie auf deine Plattform ein, die eine Anzahl von >X Zuschauern/Zuhörern/Lesern hatDu hast ihren Rat genutzt und es hat funktioniertUnd so weiter.Mehr darüber, wie man gute Outreach-E-Mails versendet, erfährst du in diesem Beitrag oder in diesem Video:https://www.youtube.com/watch?v=nAIWG8883uo5. NetworkingIch habe meinen Job bei Ahrefs über Networking bekommen.Ich habe Tim, unseren Chief Marketing Officer, zum ersten Mal bei einem Event hier in Singapur getroffen. Zu einem späteren Zeitpunkt habe ich dann:Alle Inhalte von Ahrefs konsumiert und sie auf Social Media, Reddit, GrowthHackers, etc. beworbenTim für einen Gastartikel auf einem anderen Blog interviewt;Beim Launch von Bloggen für Unternehmen geholfen, indem ich es beworben und Tim mit Influencern vernetzt habeVor allem aber habe ich das alles kostenlos gemacht. Tim hat mich nicht darum gebeten, und ich habe keine Gegenleistung dafür verlangt. Und der Rest ist Geschichte.Ein Sprichwort besagt: “Es kommt nicht darauf an, was du weißt, sondern wen du kennst.” Die meisten Menschen geben es nur ungern zu, aber es ist wahr. (Bis auf den ersten Teil — Fähigkeiten sind auch wichtig.)Menschen wollen mit Leuten arbeiten, die sie kennen und denen sie vertrauen. Und Networking ist eine Abkürzung in diesem Prozess. Es geht auch nicht nur darum, Jobs zu bekommen. Mit einem anständigen Netzwerk kannst du:Feedback zu deinem Produkt, deiner Arbeit oder deinem Unternehmen erhalten.Lösungsansätze vorgeschlagen bekommen, um deine Probleme zu beheben, da die Leute in deinem Netzwerk vielleicht schon ähnliche Probleme hatten.Alternative Sichtweisen einholen.Wie Matthew Howells-Barby schon schreibt:Es gibt eine Grenze, wie viel du dir selbst beibringen kannst. Nicht nur das, sondern es gibt auch einige Probleme, die du wahrscheinlich nie selbst lösen wirst. Das ist der Punkt, an dem das Lernen durch andere unerlässlich ist.Seit einigen Jahren treffe ich mich fast einmal pro Woche mit einer Person, die ich vorher nicht kannte und die in einer ähnlichen Position wie ich in einem anderen Unternehmen arbeitet. Das kann ein 15- bis 20-minütiges Telefonat sein, ein persönliches Kaffeetrinken oder ein Besuch in ihrem Büro. Während dieser Treffen stelle ich eine Frage:“Was sind die schwierigsten Probleme, mit denen du konfrontiert wurdest und wie hast du sie gelöst?”Matthew Howells-Barby, VP Marketing HubSpotWie du damit anfängstDie meisten Leute verstehen Networking falsch. Sie beginnen auf dem falschen Fuß, indem sie einen Hintergedanken haben. Sie wollen sich mit dir anfreunden, weil — und nur weil — du für sie in irgendeiner Weise von Vorteil bist. In Adam Grants Buch Give and Take werden diese Menschen “Takers” genannt. Sie nehmen und geben nichts zurück. Und seien wir ehrlich: Wir können diese Menschen schon von weitem riechen.Das ist ein todsicherer Weg, um beim Networking zu versagen.Stattdessen solltest du ein “Giver” sein. Du tust etwas nicht deshalb, weil du einen Gefallen erwartest. Du bist einfach aufrichtig hilfsbereit und lieferst immer einen Mehrwert. Diese Menschen sind, wie Adam Grants Untersuchungen ergaben, die erfolgreichsten beim Networking.Es beginnt alles bei deiner Denkweise.Wenn du mehr über Networking lernen möchtest, empfehle ich dir diese Infoquellen: Never Eat Alone (Buch) How to Win Friends and Influence People (Buch) Six Minute Networking (Kostenloser Kurs)6. ArbeitspriorisierungDie meisten Menschen glauben fälschlicherweise, dass Produktivität bedeutet, so viel Arbeit wie möglich innerhalb einer begrenzten Zeitspanne zu erledigen. Allerdings kann man sich auch leicht selbst betrügen, indem man eine Liste mit trivialen Aufgaben erstellt und diese schnell abhakt.Ist das echte Produktivität? Ich glaube nicht.Das passiert, weil wir keine klare Vorstellung davon haben, welche Arbeit wir priorisieren sollten. Wir planen nicht, was wir erreichen wollen, bevor wir das Büro betreten/den Laptop einschalten und versinken dann in den Dringlichkeiten des Tages.Wenn du also produktiv sein und echte Arbeit leisten möchtest, musst du lernen, wie man Prioritäten setzt.Wie du damit anfängstGetting Things Done, Eisenhower Matrix, Bullet Journal — es gibt tonnenweise Modelle, Bücher und Kurse, die dir beibringen, wie du diese spezielle Fähigkeit lernen kannst. Sie alle funktionieren. Allerdings hängt es von deiner Persönlichkeit, deinen Vorlieben und deiner Umsetzung ab, ob sie auch für dich funktionieren.Ich persönlich folge einem System, das als “Weekly/Daily Goals” bekannt ist. Es besteht aus drei Regeln:Erstelle jede Woche eine wöchentliche To-Do-Liste.Erstelle jeden Abend eine tägliche To-Do-Liste (basierend auf den wöchentlichen To-Dos).Konzentriere dich jeden Tag auf die Erledigung der täglichen To-Dos.Es ist unglaublich einfach, aber genau darin liegt das Geheimnis. Ein Produktivitäts-/Priorisierungssystem muss einfach sein, sonst ist es schwer zu befolgen. Bis jetzt hat es für mich ziemlich gut funktioniert.Erfahre mehr über das System in diesem PDF.7. Experimentelle DenkweiseDigitales Marketing ist eine sich ständig verändernde Branche. Was heute funktioniert, funktioniert vielleicht morgen nicht mehr. Was für das eine Unternehmen funktioniert, funktioniert vielleicht nicht für dein eigenes.Deshalb musst du immer ausprobieren und herausfinden, was funktioniert und was nicht.Um dies zu tun, musst du wie ein Wissenschaftler denken, d.h. eine experimentelle Denkweise einnehmen. Sieh alles als ein Experiment an. Scheitern ist kein Versagen, sondern lediglich ein Datenpunkt. Es ist vorübergehend, und was du lernst, wird dir helfen, mehr über dein Unternehmen, deine Kunden und deine Branche zu erfahren.Wie du damit anfängstDas ist nicht wirklich eine Fähigkeit, sondern eine Denkweise, die du annehmen musst. Mir gefällt Derek Sivers Beschreibung:Frage dich selbst:Welches Experiment könntest du in den nächsten 30 Tagen ausprobieren?Was passiert, wenn du versuchst, für nur 48 Stunden das Gegenteil zu tun?Dann probiere es aus und schau, was passiert.Wie du deine Marketingfähigkeiten ausüben und verbessern kannstIn Ultralearning spricht der Autor Scott Young über ein Konzept namens Direktheit. Im Grunde genommen solltest du wissen, wie du die Fähigkeit, die du lernst, anwenden wirst. Dann solltest du üben, diese Fähigkeit in dieser speziellen Situation anzuwenden.Einfach ausgedrückt: Mach das Richtige.Bei bestimmten Aktivitäten verstehen wir es intuitiv. Um zu lernen, wie man einen Liegestütz macht, muss man Liegestütze machen. Doch wenn es um Marketing geht, geben viele von uns die Direktheit für falsche Alternativen auf, indem wir zum Beispiel die ganze Zeit Artikel lesen und uns einreden, wir würden “lernen”. Es geht nicht nur dir so — auch mir geht es so.Passives Lernen macht Spaß und fühlt sich wie Lernen an. Obwohl es hilfreich sein kann, verbessert es deine Fähigkeiten nicht automatisch. Um Marketingfähigkeiten zu erlernen oder zu verbessern, musst du sie tatsächlich ausüben.Copywriting? Schreiben. E‑Mail-Outreach? Versende E‑Mails.Wenn es dein Job erlaubt, baue die Praxis in deine Arbeit ein. Wenn du zum Beispiel Copywriting lernen willst, melde dich freiwillig, um einen Blogbeitrag für den Unternehmens-Blog zu schreiben. Du könntest auch Vorschläge machen, wie man die Überschrift einer Landing Page verbessern kann. Wenn du bereits ein Texter bist, dann schaue, ob du die neuen Copywriting-Prinzipien, die du gelernt hast, in deinen Content einbauen kannst.Wenn es schwierig ist, während der Arbeit zu üben, mach dir keine Sorgen. Erstelle nebenbei eine Website und nutze sie zum Üben.Denke daran, dass ich nicht vom Lesen oder Lernen abrate. Beides ist großartig und kann Ideen hervorbringen, die du vielleicht ausprobieren möchtest. Doch die ganze Zeit damit zu verbringen, ist keine Übung. Davon kann man immer mehr machen.Weiterführende Gedanken über FähigkeitenWenn man über Marketingfähigkeiten diskutiert, stößt man irgendwann auf dieses Thema: Soll man Spezialist oder Generalist sein?Genau wie bei der Debatte darüber, welche Marketingfähigkeiten du dir aneignen solltest, glaube ich nicht, dass es eine “richtige” Antwort gibt. Es kommt darauf an, was du dir von deiner Karriere erhoffst.Wenn du nach monetärem Erfolg suchst, dann ist es wahrscheinlich besser, ein Spezialist zu sein. Wie Kevin Indig meint:Als Spezialist ist es einfacher, deinen Wert zu steigern als als Generalist. Du kannst dich besser und schneller mit anderen vernetzen, weil das Fachgebiet kleiner ist. Du kannst deine Hard Skills schneller ausbauen, denn du verfügst über tiefgreifendes Wissen in einem Bereich statt über oberflächliches Wissen in vielen Bereichen. Soft Skills sind für beide Rollen notwendig, aber für Manager noch wichtiger. Das sind also gute Gründe, um als Spezialist anzufangen.Kevin Indig, Director of SEO ShopifyEntwickle einen Kompetenzkreis und konzentriere dich darauf, diesem Kreis zu dienen.Wenn du eine leitende Position anstrebst, solltest du in Betracht ziehen, ein “T‑förmiger Marketer” zu werden. Das bedeutet, dass du über ein breites Wissen in allen Bereichen des Marketings verfügst, aber in einem bestimmten Bereich überragend bist.Du kannst sogar noch weiter gehen und dich in zwei (π‑förmig) oder drei (M‑förmig) Bereichen des Marketings profilieren.Eine weitere Möglichkeit besteht darin, einen individuellen Talentstapel zu erstellen, den nur du hast. Scott Adams von “Dilbert” hat diese Idee populär gemacht.Er sagte, er sei weder der beste Künstler, noch der beste Komiker, noch der beste Geschäftsmann der Welt. Er hatte aber überdurchschnittliche Fähigkeiten in allen drei Bereichen und kombinierte sie, um Dilbert zu erschaffen, einen der erfolgreichsten Comicstrips der Welt.Wenn du zwei oder mehr Fähigkeiten beherrschst, die nur selten kombiniert werden, kannst du eine einzigartige Nische für dich schaffen und als Marketer wertvoller werden.Tim Ferriss geht hier näher auf das Konzept ein:https://www.youtube.com/watch?v=wCPbPMRNnvkFazitEs gibt kein Bündel von Marketingfähigkeiten, die du dir aneignen “musst”, um erfolgreich zu sein.Die Fähigkeiten, die du brauchst oder lernen willst, hängen letztendlich von deiner Marketingrolle, deinen Interessen und Neigungen ab.Die von mir vorgestellten Fähigkeiten sind diejenigen, von denen ich glaube, dass sie dazu beigetragen haben, wo ich heute bin. Hoffentlich haben sie bei dir einen Nerv getroffen und dir eine Idee vermittelt, wo und wie du vorgehen kannst.Hast du irgendwelche Fragen? Schreib mir auf Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Si Quan Ong Marketing @ Ahrefs. Ich lese, mache Breakdance und versuche zufäliige Lebensexperimente.",
  "headers": [
    {
      "level": "H1",
      "text": "7 nützliche Marketingfähigkeiten (mit denen ich meine Karriere vorangetrieben habe)"
    },
    {
      "level": "H2",
      "text": "1. Copywriting"
    },
    {
      "level": "H3",
      "text": "Wie du damit anfängst"
    },
    {
      "level": "H2",
      "text": "2. Content-Marketing"
    },
    {
      "level": "H3",
      "text": "Wie du damit anfängst"
    },
    {
      "level": "H2",
      "text": "3. Suchmaschinenoptimierung (Search Engine Optimization — SEO)"
    },
    {
      "level": "H3",
      "text": "Wie du damit anfängst"
    },
    {
      "level": "H2",
      "text": "4. E‑Mail-Outreach"
    },
    {
      "level": "H3",
      "text": "Wie du damit anfängst"
    },
    {
      "level": "H2",
      "text": "5. Networking"
    },
    {
      "level": "H3",
      "text": "Wie du damit anfängst"
    },
    {
      "level": "H2",
      "text": "6. Arbeitspriorisierung"
    },
    {
      "level": "H3",
      "text": "Wie du damit anfängst"
    },
    {
      "level": "H2",
      "text": "7. Experimentelle Denkweise"
    },
    {
      "level": "H3",
      "text": "Wie du damit anfängst"
    },
    {
      "level": "H2",
      "text": "Wie du deine Marketingfähigkeiten ausüben und verbessern kannst"
    },
    {
      "level": "H2",
      "text": "Weiterführende Gedanken über Fähigkeiten"
    },
    {
      "level": "H2",
      "text": "Fazit"
    }
  ],
  "author": "Si Quan Ong"
}