{
  "url": "https://ahrefs.com/blog/de/marketing-metriken/",
  "slug": "marketing-metriken",
  "title": "25 Marketing-Metriken, die du messen solltest",
  "description": "Wähle die richtigen Marketing-Metriken, manage sie im Laufe der Zeit und konzentriere dich darauf, die Gewinne deines Unternehmens zu steigern. Hier sind 25 Metriken, die du messen solltest.",
  "content": "Marc Thomas Head of Growth bei der B2B SaaS Marketing Agentur “Powered by Search”. Auf meinem Blog schreibe ich über die Themen Marketing und Wachstum. Inhalt Viele Marketing-Metriken sind nur dazu gut, dich gut dastehen zu lassen — deshalb nennt man sie Eitelkeits-Metriken.Eitelkeits-Metriken geben dir nicht den Einblick, den du brauchst, um gute Marketing-Entscheidungen zu treffen, was dazu führt, dass du Ressourcen in Dinge steckst, die für dein Business nicht von Bedeutung sind.Es ist besser, eine kleine Gruppe an aussagekräftigen Zahlen für jeden Kanal, den du bearbeitest, auszuwählen und sie mit den allgemeinen Umsatzzielen zu verknüpfen.Aber welche Metriken sind für die einzelnen Marketingkanäle sinnvoll, und wie solltest du sie nutzen?Hier sind 25 Marketing-Metriken, die du im Auge behalten solltest:Allgemeine MetrikenMetriken für die KundenbindungSEO-MetrikenMetriken für bezahlte AnzeigenE‑Mail-MetrikenSocial-Media-MetrikenAllgemeine MetrikenEinige Zahlen — wie z.B. Umsatz-Metriken — gehören nicht zu einem bestimmten Kanal, sondern erstrecken sich über deine gesamte Geschäftstätigkeit. Die meisten dieser Metriken solltest du erfassen, unabhängig davon, in welchem Bereich des Marketings du tätig bist.1. UmsatzwachstumDas Umsatzwachstum ist die Differenz zwischen zwei Umsatzzahlen. Zum Beispiel: vor und nach einer Marketingkampagne.So berechnest du diese MetrikUmsatzwachstum (%) = ((Umsatz am Ende — Umsatz am Anfang) / Umsatz am Anfang) × 1002. Customer Acquisition Cost (CAC) (Kundenakquisitionskosten)CAC ist der Betrag, den dein Unternehmen benötigt, um einen Kunden zu akquirieren. Je niedriger die Zahl ist, desto besser.Sie werden in erster Linie in Relation zu anderen Metriken wie dem Lifetime Value (mehr dazu später) verwendet, um herauszufinden, wie viel du dir in Zukunft leisten kannst, zusätzliche Kunden zu akquirieren.So berechnest du diese MetrikGesamtbetrag, der für Marketing ausgegeben wird / Anzahl der gewonnenen Neukunden3. ConversionsEine Conversion findet statt, wenn ein Besucher deiner Website eine Aktion abschließt, die von dir erfasst wird. Beispiele hierfür sind Anmeldungen, Demo-Buchungen und Käufe.Das Tracking von Conversions ermöglicht es dir zu sehen, wo Kunden wichtige Aktionen in ihrer Customer Journey abschließen.So berechnest du diese MetrikBei Google Analytics kannst du Ziele einrichten und dann die Conversion-Rate (der Prozentsatz der Personen, die eine Aktion abschließen) auf deiner Website erfassen.In der Abbildung unten sehen wir, auf welchen Seiten Besucher landen, bevor sie ein Produkt kaufen. Wir können auch die Conversion-Rate und den Umsatz sehen, der den Conversions zugeschrieben wird:4. Share of Voice (SOV)Share of voice sagt dir, wie sichtbar du im Vergleich zu deinen Mitbewerbern bist.Marktanteil und Share of Voice sind eng miteinander verbunden. Wenn du einen Share of Voice von 20% hast, hast du wahrscheinlich auch einen ähnlichen Marktanteil.Wenn dein Share of Voice über deinem Marktanteil im Vergleich zu deinen Mitbewerbern liegt, hast du einen Excess Share of Voice (eSOV). Langfristig wird dein Marktanteil wahrscheinlich zu deinem Share of Voice aufschließen.Das bedeutet, dass der SOV ein Indikator für zukünftiges Wachstum sein kann.So berechnest du diese MetrikShare of voice = Markensichtbarkeit / Potentielle Sichtbarkeit gesamtEs ist nicht praktikabel, den SOV für mehrere Kanäle gleichzeitig zu messen, also musst du ihn für jeden Kanal einzeln berechnen.So machst du es für die organische Suche:Erstelle eine Liste mit wichtigen KeywordsFüge sie zu Rank Tracker hinzuGehe zum Mitbewerber-Bericht (Competitors Report)Prüfe die Spalte Sichtbarkeit (Visibility)Hier kannst du sehen, wie viel Prozent der Klicks du für erfasste Keywords im Vergleich zur Konkurrenz erzielst.Empfohlener Artikel: Was ist Share of Voice? Wie du ihn kanalübergreifend messen kannst5. Return on Investment (ROI)ROI ist ein Maß für den Einfluss, den eine Kampagne oder ein Kanal auf den Umsatz des Unternehmens hatte.So berechnest du diese MetrikROI = (Umsatz, der den Marketingausgaben zugeschrieben wird — Marketingausgaben) / MarketingausgabenJe höher die Zahl ist, desto besser ist der ROI.Der ROI lässt sich am einfachsten bei Kanälen wie bezahlter Werbung berechnen, wo Werbepixel die Journey vom Lead zum Kunden effektiv erfassen können.Metriken für die KundenbindungIm Marketing geht es nicht nur darum, neue Kunden zu gewinnen, sondern auch darum, bestehende Kunden zu halten. Je länger du einen Kunden behältst, desto mehr Gewinn machst du mit ihm.6. AbwanderungsrateDie Abwanderungsrate ist die Rate, bei der Kunden aufhören, ihre Zahlungen zu leisten. Sie ist vor allem bei Software-as-a-Service (SaaS)-Unternehmen verbreitet, die auf wiederkehrende Einnahmen angewiesen sind, um zu wachsen.So berechnest du diese MetrikAbwanderungsrate = (Umsatzverluste während der Berichtsperiode / Umsatz zu Beginn der Berichtsperiode) x 100Eine hohe Abwanderungsrate kann ein Indikator für schlecht positionierte Produkte sein. Wenn deine Kunden ihre Kundenkonten auflösen, weil dein Produkt nicht das leistet, was sie erwartet haben, solltest du die Verkaufsseiten deiner Website überarbeiten und versuchen, dein Nutzenversprechen zu verdeutlichen.7. Lifetime Value (LTV)Der LTV gibt an, wie viel ein Kunde im Durchschnitt während seiner gesamten Kundenbeziehung mit deinem Unternehmen bezahlt.Nebenbei bemerkt. Manchmal werden auch die Akronyme CLV oder CLTV verwendet. Sie bedeuten das Gleiche. Das “C” steht für “Customer”.So berechnest du diese MetrikFür ein E‑Commerce-Unternehmen:LTV = durchschnittl. Bestellwert x durchschnittl. jährliche Kaufhäufigkeit x durchschnittl. Customer LifespanUm den LTV für ein SaaS-Unternehmen zu berechnen:LTV = durchschnittl. monatlicher Umsatz pro Kunde / durchschnittl. monatliche AbwanderungsquoteWenn dein Unternehmen neu ist, wird es einige Zeit dauern, um LTV-Zahlen zu erhalten, da du nicht weißt, wie lange der durchschnittliche Kunde zahlen wird.8. LTV:CACDas Verhältnis von LTV zu CAC sagt dir, wie viel du angemessenerweise ausgeben kannst, um einen neuen Kunden zu gewinnen.Wenn dein durchschnittlicher Kunde zum Beispiel $30 zahlt, wäre es sinnvoll, bis zu $29,99 auszugeben, um einen Kunden zu gewinnen. Allerdings würdest du am Ende nur 1 Cent Gewinn machen, was null Raum für Marge lässt.So berechnest du diese MetrikEs gibt kein einzelnes Verhältnis, das für jedes Unternehmen funktioniert, denn es gibt keinen bestimmten Betrag, den du für einen Kunden ausgeben solltest. Er variiert je nach Zeit, Unternehmen und Branche.9. Net Promoter Score (NPS)Der NPS ist eine weit verbreitete Metrik zur Messung der Kundenzufriedenheit. Unzufriedene Kunden geben oft niedrige Werte an, was darauf hindeutet, dass sie in Zukunft wahrscheinlich abwandern werden.So berechnest du diese MetrikNPS = Prozentsatz der Befürworter — Prozentsatz der KritikerUnter Verwendung einer einzigen, streng definierten Fragestellung wird beim NPS gefragt: “Wie wahrscheinlich ist es, dass du {Firmenname} einem Kollegen weiterempfehlen würdest?Die Punktzahl liegt zwischen 0 und 10. Jeder, der zwischen 0–6 Punkten liegt, ist ein Kritiker, 7–8 Punkte sind neutral, und 9–10 Punkte sind Befürworter.Die NPS-Werte reichen von ‑100 bis 100, wobei ein Wert über 70 als “erstklassig” angesehen wird.10. Wiederkaufsrate (Repeat Purchase Rate)Die Wiederkaufsrate ist der Prozentsatz der Kunden, die mehr als einmal bei dir kaufen.Sie wird häufig im E‑Commerce verwendet, um vorherzusagen, wie effektiv ein Unternehmen bei der Kundenbindung ist. So berechnest du diese MetrikWiederkaufsrate = Anzahl der Kunden, die mehr als einmal kaufen / Gesamtzahl der KundenEine hohe Wiederkaufsrate zeigt eine gesunde Kundenbindung und dass du mehr Geld für die Neukundengewinnung ausgeben kannst.SEO-MetrikenDie Suche ist ein fantastischer Kanal für das Wachstum deines Unternehmens. Es ist jedoch wichtig, dass du sicher stellst, dass du auf dem richtigen Weg bist und die Strategie, die du verfolgst, funktioniert.Nutze diese SEO-Metriken, um das Wachstum des Traffics über die Suche im Auge zu behalten.11. Branded vs. Non-Branded organischer Traffic Es ist oft hilfreich zu wissen, wie viele Leute deine Webseite finden, wenn sie nach deinem Firmennamen und verwandten Begriffen suchen (branded), im Unterschied zu allem anderen (non-branded).Wenn die meisten Leute dich finden, indem sie nach deinem Markennamen auf Google suchen, entgehen dir wahrscheinlich eine Vielzahl von Kunden, die einfach nach Lösungen für ihre Probleme suchen.So berechnest du diese MetrikDu kannst das Verhältnis von branded zu non-branded Traffic in der Google Search Console schätzungsweise ermitteln.Gehe zum Performance-Tab. Von hier aus musst du nach “Branded Searches” in deinem Bericht filtern. Füge dann deinen Markennamen und alle Variationen/Fehlschreibungen in das Suchfeld ein und wähle “queries containing” als Operator. Klicke auf “apply”:Wenn du mit dem Hinzufügen der Filter fertig bist, notiere dir die “Total Clicks” Zahl. Das ist die Zahl deines Branded Traffics.Dann änderst du die Operatoren all deiner Filter auf “Queries Not Containing” und notierst dir wieder die “Total Clicks”-Zahl.So erhältst du den Anteil des Traffics für den Branded Traffic im Vergleich zum Non-Branded Traffic.12. MarkenerwähnungenMarkenerwähnungen zeigen dir, wie häufig du Teil der Konversation in deiner Branche bist.Wenn eine Webseite dein Unternehmen oder eng verwandte Begriffe wie prominente Mitarbeiter (in Bezug auf ihre Arbeit) erwähnt, hast du eine Markenerwähnung verzeichnet.So kannst du diese Metrik erfassenWenn du in Zukunft benachrichtigt werden möchtest, wenn jemand deine Marke erwähnt, verwende Ahrefs Alerts.Gehe zu Ahrefs AlertsKlicke auf den “Erwähnungen”-TabKlicke auf “Alert hinzufügen” Gib deinen Markennamen einWähle die SprachenSchließe Domains aus, die du nicht erfassen willstLege dein Benachrichtigungsintervall festKlicke auf “hinzufügen”13. Backlink-WachstumBacklinks sind Links zu deiner Webseite von anderen Webseiten im Internet.Ein gutes Backlinkprofil wird dir helfen, in der Suche besser zu ranken und relevanten Empfehlungs-Traffic zu generieren. Indem du für Keywords rankst, nach denen deine Zielkunden suchen, kannst du im Laufe der Zeit Nutzer zu immer geringeren Kosten gewinnen.So berechnest du diese MetrikDu kannst das Wachstum der verweisenden Domains zu jeder Seite im Site Explorer überprüfen. Mit dem Bericht “Best by Links Growth” können wir sehen, welche Seiten in den letzten 1, 7 und 30 Tagen Backlinks gewonnen oder verloren haben:Metriken für bezahlte AnzeigenIneffiziente Ausgaben für bezahlte Anzeigen werden dein Geld in einem alarmierenden Ausmaß verschlingen.Anstatt es dem Zufall zu überlassen, solltest du die folgenden Metriken erfassen, um sicherzustellen, dass sich die Werbeausgaben auszahlen.14. Quality Score (Qualitätsfaktor)Google Ads nutzt den Quality Score, um einzuschätzen, wie relevant eine Anzeige für einen potentiellen Suchenden ist.So berechnest du diese MetrikGoogle berechnet sie für dich.Der Quality Score besteht aus drei Hauptfaktoren:Erwartete Click-Through-RateRelevanz der Anzeige für das KeywordLanding-Page-ErfahrungAnzeigen mit hoher Punktzahl (auf einer Skala von 1–10, wobei zehn die höchste Punktzahl ist) erhalten bessere Platzierungen und kosten im Allgemeinen weniger.Wenn du das weißt, hast du viel Spielraum, um deinen Quality Score zu verbessern, indem du deine Landing Page änderst, dein Targeting verbesserst oder die Anzeigentexte so veränderst, dass sie ansprechender sind.15. Cost Per Click (CPC) (Kosten pro Klick)Cost Per Click ist eine Zahl, die den Preis angibt, den du jedes Mal bezahlst, wenn jemand auf deine Anzeige klickt.So berechnest du diese MetrikCPC = Gesamtkosten der Klicks / Gesamtanzahl der KlicksDie Kosten pro Klick variieren von Keyword zu Keyword, aber du kannst einen durchschnittlichen CPC im Keywords Explorer ermitteln, während du eine Keyword-Recherche machst:Es ist eine hilfreiche Zahl, die du kennen solltest, damit du über deine Bietstrategie für bestehende und zukünftige Kampagnen nachdenken kannst.16. Kosten pro Conversion (Cost per Conversion)Die Kosten pro Conversion sagt dir, wie viel eine Conversion durch deine Anzeigen kostet.So berechnest du diese MetrikKosten pro Conversion = Gesamtbetrag der Ausgaben / Gesamtzahl der ConversionsSo kannst du entscheiden, ob es sich um einen effektiven Einsatz deines Marketingbudgets handelt.17. Return on Ad Spend (ROAS)ROAS ist der Ertrag in Euro für deine Werbeausgaben.So berechnest du diese MetrikROAS = Gesamter Conversion-Wert / Ausgegebener BetragROAS ist ähnlich wie Cost Per Conversion. Allerdings berücksichtigt ROAS nur Conversions, die mit einem Geldbetrag verbunden sind, während Cost Per Conversion auch Conversions wie “PDF herunterladen” einschließt, die keinen unmittelbaren Geldwert aufweisen.18. View-Through Conversions Als View-Through-Conversions werden Conversions bezeichnet, bei denen Kunden deine Anzeige sehen, aber nicht mit ihr interagieren und dann später eine Conversion auf deiner Website durchführen.So berechnest du diese MetrikWerbenetzwerke wissen, wie sie Conversions den Klicks und Views zuordnen können, da sie von dir verlangen, einen Pixel auf deiner Seite zu installieren, bevor du deine Kampagnen startest.Das Pixel sammelt Daten über die Besucher, auch darüber, woher sie kommen.Wenn ein Nutzer zum Beispiel deine Anzeige sieht, an ihr vorbei scrollt und dann 30 Tage später deine Website besucht, um einen Kauf zu tätigen, wird eine View-Through-Conversion zu deinen Kampagnenstatistiken hinzugefügt.Wenn dein Verkaufszyklus länger als 30 Tage beträgt, solltest du das Rückblick-Fenster für deine Kampagnen auf eine Länge einstellen, die für dein Unternehmen angemessen ist.E‑Mail-MetrikenAnders als bei der Suche und dem bezahlten Traffic, sind eigene Kanäle wie E‑Mail “immer aktiv”. Deine Abonnenten haben dir ihr Einverständnis gegeben, sie direkt per E‑Mail zu kontaktieren.Diese Metriken zeigen dir, wo du ihr Vertrauen behältst und wo du dich verbessern musst.19. Wachstumsrate der AbonnentenDie Abonnentenwachstumsrate ist der prozentuale Unterschied zwischen den Abonnenten am Anfang und am Ende einer Zeitperiode (Monat/Jahr/Gesamtperiode).So berechnest du diese MetrikAbonnentenwachstumsrate (%) = ((Abonnenten am Ende der Zeitperiode — Abonnenten am Anfang der Zeitperiode) / Abonnenten am Anfang der Zeitperiode) x 100Wachsende E‑Mail-Listen schaffen neue Möglichkeiten, potenzielle Kunden zu erreichen.Das Messen der Wachstumsrate deiner Mailingliste im Laufe der Zeit ist eine viel bessere Metrik als eine einzelne Abonnentenzahl.Die Wachstumsrate der Abonnenten gibt dir Aufschluss darüber, wie schnell du deine Liste erweiterst.20. ÖffnungsrateDie Öffnungsrate ist der Prozentsatz der Abonnenten, die deine E‑Mail geöffnet haben.So berechnest du diese MetrikÖffnungsrate = (Emails geöffnet / (Emails gesendet — Bounces)) * 100Du solltest eine hohe Öffnungsrate nicht als Zeichen für eine gute Kundenbindung heranziehen. Viele Leute öffnen E‑Mails und lesen sie nicht oder interagieren nicht mit ihnen. Manchmal öffnen sie nur, um den Lösch-Button zu drücken. Die Öffnungsrate unterscheidet nicht zwischen schlechten und guten Öffnungen.Dennoch kann die Öffnungsrate dir einige allgemeine Einblicke geben, wie gut deine Betreffzeile und deine Textauszüge bei deinem Publikum ankommen.21. KlickrateDie Klickrate ist der Prozentsatz an Empfängern, die auf einen Link in deiner E‑Mail klicken.So berechnest du diese MetrikKlickrate = (Angeklickte Emails / (Versendete Emails — Bounces)) * 100Link-Klicks in E‑Mails zeigen fast immer, dass dein Inhalt das Interesse des Lesers geweckt hat. Insofern ist die Klickrate ein verlässliches Maß für das Customer Engagement, das du als KPI für E‑Mails erfassen kannst.Die meisten E‑Mail-Dienstleister (Email Service Providers — ESPs) geben dir Daten zur Klickrate sowohl auf Kampagnen- als auch auf Account-Ebene.22. AbmelderateDie Abmelderate ist der Prozentsatz der Empfänger, die sich nach Erhalt deiner E‑Mail abmelden.So berechnest du diese MetrikAbmelderate = (Abmeldungen / (Versendete E‑Mails — Bounces)) * 100Das Erfassen der Abmelderate deiner Kampagnen ist nützlich, wenn die Zahlen deiner letzten Kampagnen hoch sind. Wenn sich jemand abmeldet, kannst du ihm keine Nachrichten mehr schicken, was sich wahrscheinlich auf deine Möglichkeiten auswirkt, ihm weitere Produkte/Dienstleistungen verkaufen zu können.Wenn du siehst, dass sich viele Leute abmelden, ist es wahrscheinlich, dass es ein Problem mit deinen Nachrichten gibt oder dass dein Marketing generell nicht die Erwartungen deiner Abonnenten erfüllt.23. Absprungrate (Bounce Rate)Die Absprungrate ist der Prozentsatz der E‑Mails, die nicht zugestellt wurden, weil eine E‑Mail-Adresse falsch ist, nicht existiert oder der E‑Mail-Server die Zustellung aus einem anderen Grund blockiert hat.So berechnest du diese MetrikAbsprungrate = (Anzahl der Absprünge (Bounces) / Versendete Emails) * 100Die Absprungrate kann sich negativ auf dein Business auswirken, weil deine Marketing-Botschaften nicht bei deinen potentiellen Kunden ankommen. In diesem Fall ist die Wahrscheinlichkeit geringer, dass sie in Zukunft bei dir kaufen.Die Absprungrate kann auch einen Hinweis auf den Zustand deiner Mailingliste geben. Wenn du eine hohe “Hard Bounce Rate” hast, kann es sein, dass du viele falsche E‑Mails erhalten hast.Nebenbei bemerkt. Gelegentlich wirst du Soft Bounces vorfinden. Es gibt dutzende Gründe für Soft Bounces, wie z.B. eine Nachricht, die von einem E‑Mail-Server als Spam eingestuft wurde oder ein volles Postfach des Empfängers. Im Gegensatz zu Hard Bounces werden die meisten ESPs versuchen, Soft Bounces zu einem anderen Zeitpunkt erneut zu versenden, bevor sie gelöscht werden. Social-Media-MetrikenSocial-Media-Metriken sind knifflig, weil soziale Netzwerke mit geheimnisvollen und oft wechselnden Algorithmen arbeiten.Darüber hinaus definiert jedes soziale Netzwerk die Metriken anders. Hier ist zum Beispiel, was eine Videoansicht auf verschiedenen sozialen Netzwerken ausmacht:Facebook/Instagram – 3 SekundenYouTube – 30 SekundenTwitter – 2 Sekunden, wenn 50% des Videorahmens sichtbar sindLinkedIn – 2 Sekunden, wenn 50 % des Videobildes sichtbar sindDas Fazit ist, dass das Erfassen von Metriken auf Social Media schwierig und anfällig für Veränderungen ist. Du musst dir die Frage stellen: Lohnt es sich überhaupt, diese Metriken in das Reporting aufzunehmen?24. Engagement Engagement ist eine breite Kategorie, die die spezifischen Aktivitäten bei Posts in jedem sozialen Netzwerk umfasst.So kannst du diese Metrik erfassenDu kannst die integrierten Analysetools jedes sozialen Netzwerks nutzen, um Engagement-Zahlen zu erhalten. Alternativ kannst du auch ein Social-Media-Analyse-Tool wie Buffer Analyze verwenden.Es gibt jedoch kein standardisiertes Set von Aktionen über alle sozialen Medien hinweg.Zum Beispiel:Twitter — Likes, Retweets, Zitat-Tweets, Antworten, Profil-KlicksFacebook - Shares, Views, Likes/Reaktionen, Kommentare, KlicksLinkedIn - Impressionen, Kommentare, Shares, ReaktionenDas bedeutet, dass es schwierig sein kann, den Wert des Engagements zwischen sozialen Netzwerken zu vergleichen.25. MarkenerwähnungenMarkenerwähnungen beziehen sich auf die Anzahl der Erwähnungen deines Markennamens in den sozialen Medien innerhalb eines bestimmten Zeitraums.So kannst du diese Metrik erfassenDu kannst ein Tool wie Hootsuite verwenden, um dies zu erfassen, wobei du sogar nach Stimmung segmentieren kannst, um zu verstehen, wie positiv dein Publikum deiner Marke gegenüber eingestellt ist.Die Erwähnungen deiner Marke in den sozialen Medien zu erfassen, gibt dir einen Einblick, wie deine Kunden den Markt wahrnehmen.Nehmen wir zum Beispiel an, dein Markenname wird regelmäßig in den sozialen Medien erwähnt. Das kann ein gutes Zeichen dafür sein, dass du weiterhin in soziale Medien als Marketingkanal investieren solltest.FazitEin berühmtes Zitat von Peter Drucker lautet: “Was man nicht messen kann, kann man nicht lenken”.Aber nur weil du stundenlang auf Google Analytics starrst, heißt das noch lange nicht, dass du deine Marketing-Metriken effektiv erfasst. Wenn du den Einfluss deines Marketings auf das Endergebnis nicht misst, wie willst du dann wissen, worin du in Zukunft investieren solltest?Wähle stattdessen die richtigen Metriken für deine Marketingkanäle, manage sie im Laufe der Zeit und konzentriere dich darauf, die Gewinne deines Unternehmens zu steigern.Hast du noch Fragen? Schreib mir auf Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human:",
  "headers": [
    {
      "level": "H1",
      "text": "25 Marketing-Metriken, die du messen solltest"
    },
    {
      "level": "H2",
      "text": "Allgemeine Metriken"
    },
    {
      "level": "H3",
      "text": "1. Umsatzwachstum"
    },
    {
      "level": "H4",
      "text": "So berechnest du diese Metrik"
    },
    {
      "level": "H3",
      "text": "2. Customer Acquisition Cost (CAC) (Kundenakquisitionskosten)"
    },
    {
      "level": "H4",
      "text": "So berechnest du diese Metrik"
    },
    {
      "level": "H3",
      "text": "3. Conversions"
    },
    {
      "level": "H4",
      "text": "So berechnest du diese Metrik"
    },
    {
      "level": "H3",
      "text": "4. Share of Voice (SOV)"
    },
    {
      "level": "H4",
      "text": "So berechnest du diese Metrik"
    },
    {
      "level": "H3",
      "text": "5. Return on Investment (ROI)"
    },
    {
      "level": "H4",
      "text": "So berechnest du diese Metrik"
    },
    {
      "level": "H2",
      "text": "Metriken für die Kundenbindung"
    },
    {
      "level": "H3",
      "text": "6. Abwanderungsrate"
    },
    {
      "level": "H4",
      "text": "So berechnest du diese Metrik"
    },
    {
      "level": "H3",
      "text": "7. Lifetime Value (LTV)"
    },
    {
      "level": "H4",
      "text": "So berechnest du diese Metrik"
    },
    {
      "level": "H3",
      "text": "8. LTV:CAC"
    },
    {
      "level": "H4",
      "text": "So berechnest du diese Metrik"
    },
    {
      "level": "H3",
      "text": "9. Net Promoter Score (NPS)"
    },
    {
      "level": "H4",
      "text": "So berechnest du diese Metrik"
    },
    {
      "level": "H3",
      "text": "10. Wiederkaufsrate (Repeat Purchase Rate)"
    },
    {
      "level": "H4",
      "text": "So berechnest du diese Metrik"
    },
    {
      "level": "H2",
      "text": "SEO-Metriken"
    },
    {
      "level": "H3",
      "text": "11. Branded vs. Non-Branded organischer Traffic"
    },
    {
      "level": "H4",
      "text": "So berechnest du diese Metrik"
    },
    {
      "level": "H3",
      "text": "12. Markenerwähnungen"
    },
    {
      "level": "H4",
      "text": "So kannst du diese Metrik erfassen"
    },
    {
      "level": "H3",
      "text": "13. Backlink-Wachstum"
    },
    {
      "level": "H4",
      "text": "So berechnest du diese Metrik"
    },
    {
      "level": "H2",
      "text": "Metriken für bezahlte Anzeigen"
    },
    {
      "level": "H3",
      "text": "14. Quality Score (Qualitätsfaktor)"
    },
    {
      "level": "H4",
      "text": "So berechnest du diese Metrik"
    },
    {
      "level": "H3",
      "text": "15. Cost Per Click (CPC) (Kosten pro Klick)"
    },
    {
      "level": "H4",
      "text": "So berechnest du diese Metrik"
    },
    {
      "level": "H3",
      "text": "16. Kosten pro Conversion (Cost per Conversion)"
    },
    {
      "level": "H4",
      "text": "So berechnest du diese Metrik"
    },
    {
      "level": "H3",
      "text": "17. Return on Ad Spend (ROAS)"
    },
    {
      "level": "H4",
      "text": "So berechnest du diese Metrik"
    },
    {
      "level": "H3",
      "text": "18. View-Through Conversions"
    },
    {
      "level": "H4",
      "text": "So berechnest du diese Metrik"
    },
    {
      "level": "H2",
      "text": "E‑Mail-Metriken"
    },
    {
      "level": "H3",
      "text": "19. Wachstumsrate der Abonnenten"
    },
    {
      "level": "H4",
      "text": "So berechnest du diese Metrik"
    },
    {
      "level": "H3",
      "text": "20. Öffnungsrate"
    },
    {
      "level": "H4",
      "text": "So berechnest du diese Metrik"
    },
    {
      "level": "H3",
      "text": "21. Klickrate"
    },
    {
      "level": "H4",
      "text": "So berechnest du diese Metrik"
    },
    {
      "level": "H3",
      "text": "22. Abmelderate"
    },
    {
      "level": "H4",
      "text": "So berechnest du diese Metrik"
    },
    {
      "level": "H3",
      "text": "23. Absprungrate (Bounce Rate)"
    },
    {
      "level": "H4",
      "text": "So berechnest du diese Metrik"
    },
    {
      "level": "H2",
      "text": "Social-Media-Metriken"
    },
    {
      "level": "H3",
      "text": "24. Engagement"
    },
    {
      "level": "H4",
      "text": "So kannst du diese Metrik erfassen"
    },
    {
      "level": "H3",
      "text": "25. Markenerwähnungen"
    },
    {
      "level": "H4",
      "text": "So kannst du diese Metrik erfassen"
    },
    {
      "level": "H2",
      "text": "Fazit"
    }
  ],
  "author": "Marc Thomas"
}