{
  "url": "https://ahrefs.com/blog/de/mundpropaganda-marketing/",
  "slug": "mundpropaganda-marketing",
  "title": "Mundpropaganda: Ein einfacher & geprüfter Leitfaden",
  "description": "Beim Mundpropaganda-Marketing geht es darum, natürliche Diskussionen über ein Produkt, einen Service oder ein Unternehmen anzuregen und zu beeinflussen. Erfahre, wie du davon profitieren kannst.",
  "content": "Michal Pecánek Vermarkter und Content-Autor bei Ahrefs. Süchtig nach SEO, Luftfahrt, Parfums, Sushi und Tacos. Article PerformanceData from AhrefsVerlinkung von Websites 2 Sign up for AhrefsGet SEO metrics of any website or URL.The number of websites linking to this post.This post's estimated monthly organic search traffic. Inhalt Du kannst es nicht kontrollieren, und die Ergebnisse hängen von deiner gesamten Marketingstrategie und ‑ausführung ab. Wenn du es richtig machst, kann es zu einem deiner stärksten Marketingkanäle werden.Ich möchte dir diesen oft übersehenen Marketingkanal vorstellen, der einen großen Einfluss auf unser Geschäft hat: Marketing durch Mundpropaganda.In diesem Artikel erfährst du Folgendes:Was Mundpropaganda-Marketing istWarum Mundpropaganda-Marketing wichtig istDas Schwungradprinzip hinter dem Mundpropaganda-MarketingFünf bewährte Tipps für das Mundpropaganda-MarketingAlso folge uns und mach unseren Erfolg nach.Was ist Mundpropaganda-Marketing?Die Begriffe “Mundpropaganda” und “Mundpropaganda-Marketing” werden manchmal synonym verwendet. Aber sie sind nicht dasselbe, und wir müssen den ersten definieren, um den zweiten zu verstehen.Mundpropaganda (MP) ist eine Handlung, bei der Menschen über ein Produkt oder eine Marke erzählen. In diesem Artikel werden wir nur über positive Mundpropaganda sprechen.Mundpropaganda-Marketing (MPM) ist der Prozess der Beeinflussung und Förderung natürlicher Gespräche über ein Produkt, eine Dienstleistung oder ein Unternehmen. Es bezieht sich auf die Incentivierung von MundpropagandaWarum ist Mundpropaganda-Marketing wichtig?Untersuchungen von Nielsen zeigen, dass 83 % der Menschen den Empfehlungen ihrer Freunde und Familie vertrauen. Es ist einfach der vertrauenswürdigste und authentischste Marketingkanal. Ihn kannst du nicht schlagen, egal wie gut deine Marketingkommunikation ist.Die Tatsache, dass uns mehr als 14.000 neue Kunden im Jahr 2020 gesagt haben, dass sie von ihren Freunden an Ahrefs verwiesen wurden, ist der beste Beweis für die Bedeutung von MPM:Aber es sind nicht nur Menschen, die du persönlich kennst, die einen solchen Einfluss auf deine Produktwahl haben können. Autoritäten und Influencer können eine ähnliche Rolle spielen. Matthew Woodward, ein bekannter SEO-Experte, hat uns zum Beispiel im Jahr 2020 mehr als 500 neue Kunden gebracht:Und diese Zahlen drücken den Einfluss von MPM. Das liegt daran, dass es sich um erinnerte Zuschreibungen handelt. Viele Leute wissen nicht mehr, wie sie von Ahrefs erfahren haben, oder sie sagen es uns einfach nicht.Das Schwungradprinzip hinter dem Mundpropaganda-MarketingMPM wird nicht in dem Moment zu einem wichtigen Teil deines Marketing-Mixes, in dem du anfängst, deine Aufmerksamkeit und Ressourcen darauf zu richten. Es braucht Zeit, sehr viel Zeit, und Schwungräder können erklären, warum.MPM kann man als einen sich selbst verstärkenden Marketingkanal bezeichnen. Am Anfang wirst du keine großen Auswirkungen sehen. Aber mit der Zeit wird es viel einfacher, Ergebnisse zu erzielen. Die Effekte können sich sogar gegenseitig verstärken.Du kannst hier im Grunde ein Schwungrad als Analogie verwenden. Rand Fishkin hat den Begriff “Marketing-Schwungrad” populär gemacht. Eines der Schwungräder mit Mundpropaganda kannst du hier sehen:Mundpropaganda-Schwungrad über Sparktoro.Der wichtigste Marketing-Treiber für das Wachstum von Ahrefs ist jedoch der langfristige Effekt von Mundpropaganda-Marketing in Kombination mit SEO und Content Marketing.Und das bringt uns zu den Tipps.Fünf bewährte Tipps für das Mundpropaganda-MarketingAlles, was hier aufgelistet ist, hat sich für uns bewährt. Wenn du diese Praktiken in deinem Marketing anwendest, wirst du in der Regel ziemlich gut abschneiden, aber die Liste ist nicht vollständig. Im Abschnitt “Abschließende Gedanken” verweise ich auf weitere bemerkenswerte Tipps.Tipp 1. Ein hervorragendes Produktangebot habenIch werde es dir gleich verraten. Du brauchst ein tolles Produkt, um Mundpropaganda zu fördern. Alle anderen Tipps und Taktiken werden das nicht ausgleichen, wenn du es nicht hast.Das Ahrefs-Produkt stand von Anfang an an der Spitze unseres Marketings. Im Jahr 2010 sind wir mit einem Tool zur Analyse von Backlinks in den Markt für SEO-Tools eingestiegen. Von da an haben wir uns schnell den Ruf erarbeitet, die Besten auf dem Markt zu sein. Ein paar Jahre und viele Funktionen später sind wir zu einem der beiden meistgenutzten All-in-One-SEO-Tools geworden.Auch deine Produktpositionierung, d.h. die Art und Weise, wie du dein Produkt potenziellen Kunden vorstellst, spielt hier eine Rolle. Der Schlüssel dazu ist eine gründliche Marktforschung, die sich sowohl an der Produkt-Roadmap als auch an deiner Positionierung orientieren sollte.Wenn du wie wir in der SaaS-Branche tätig bist, ist es außerdem hilfreich, Testversionen und/oder eine Freemium-Version deines Produkts anzubieten.Die Einführung der kostenlosen Ahrefs Webmaster Tools hat uns zum Beispiel geholfen, den Bekanntheitsgrad unseres Tools Site Audit zu steigern und wertvolle Mundpropaganda zu betreiben. Wir standen vor einigen Herausforderungen, als viele SEOs Ahrefs nicht als technische SEO-Lösung betrachteten.Aber das ist jetzt nicht mehr der Fall:Tipp 2. Führe deine Marke richtigBei der Mundpropaganda geht es darum, wie die Menschen deine Produkte erleben und wie sie deine Marke wahrnehmen. Es ist unwahrscheinlich, dass Menschen ein gutes Produkt weiterempfehlen, wenn sie das Unternehmen, das es verkauft, nicht mögen.Ich kann hier nicht einmal im Entferntesten einen Leitfaden zur Markenführung unterbringen, deshalb möchte ich dich nur daran erinnern, dass du immer an das große Ganze denken und langfristig planen solltest.Tatsächlich zeigen Untersuchungen, dass die meisten Unternehmen die größte Marketingeffektivität erzielen würden, wenn sie etwa 60 % in den Aufbau der Marke und 40 % in verkaufsfördernde Kampagnen investieren würden:So sieht richtiges Branding bei uns aus:Du weißt es bereits, und viele andere Marketer wissen es auch – bei Ahrefs steht das Produkt an erster Stelle. Und wir schrecken nicht davor zurück, dies auf besondere Art und Weise zu betonen.Das ist leichter gesagt als getan, aber tu dein Bestes, um eine sympathische Marke zu sein. Investiere in dein Online-Reputationsmanagement. Je besser du darin bist, desto mehr Mundpropaganda wirst du von deiner Zielgruppe bekommen. Diese Gruppe ist immer viel größer als dein Kundenstamm.Tipp 3. Fokus auf produktbezogenes Content MarketingContent Marketing ist der Prozess der Erstellung und Verbreitung von Inhalten, um Kunden zu gewinnen und zu binden. Unsere Inhalte sind unser wichtigstes Marketinginstrument, da sie allein über die organische Suche jeden Monat rund 1 Million Besuche generieren:Was vielleicht nicht so offensichtlich ist, ist, dass es auch der Hauptantrieb für unser MPM ist. Lass mich dir zeigen, was ich meine.Schau dir zum Beispiel diesen Tweet an:Making a habit of regularly visiting the @ahrefs blog again. Learned the basics from them back in 2015 and still consider them a go-to primer when approaching a new problem (e.g. manual content audit — which I haven’t done in years). Still super-fanning these guys 🙃— Kari Beaulieu (@SERP_queen) September 15, 2020Dass wir uns zu einer Autorität in der SEO-Branche entwickelt haben, ist eng mit unserem rasanten Geschäftswachstum verbunden. Das liegt daran, dass die Inhalte, die wir produzieren, produktorientiert sind. Da das Ahrefs-Toolset dir helfen kann, alle möglichen SEO- und Marketingprobleme zu lösen, ist es für uns einfach und natürlich, das Produkt in unseren Inhalten zu erwähnen.Erinnerst du dich an das Schwungradprinzip? Je mehr Traffic unsere Inhalte bekommen, desto mehr Leute wissen, wie Ahrefs ihnen helfen kann, und desto mehr empfehlen sie unser Produkt und unsere Lernressourcen weiter. Das führt zu mehr Erwähnungen, mehr Links und mehr Traffic.Dann beginnt der Kreislauf von Neuem.Dies sind die vier Schritte, um diese Taktik erfolgreich umzusetzen:Schritt 1. Mach eine Keyword-RechercheDir fallen sicher viele Probleme ein, die dein Produkt lösen oder bei denen es helfen kann. Einige sind häufiger als andere, und eine Keyword-Recherche wird dir helfen, diese zu identifizieren.Zum Beispiel wird das Keyword “word of mouth marketing” (Mundpropaganda-Marketing) weltweit etwa 11.000 Mal pro Monat gesucht:Da ich einen wertvollen Inhalt mit einzigartigen Informationen erstellen kann (unsere eigenen Erfahrungen mit MPM) und gleichzeitig natürlich Ahrefs anpreisen kann, ist das ein großartiges Thema, das ich ansprechen kann.Lesetipp: Wie recherchiere ich Keywords für SEO?Schritt 2. Konzentriere dich auf Themen mit hohem GeschäftspotenzialBei deiner Keyword-Recherche wirst du viele Ideen für Inhalte finden. Du musst sie nach Prioritäten ordnen. Hier sind die Kriterien, die du berücksichtigen solltest:Hohes Geschäftspotenzial, damit du dein Produkt leicht anpreisen kannstHohes Traffic-Potenzial, damit du eine Menge organischen Traffic bekommst, wenn du gut rankstNiedriger Keyword-Schwierigkeitsgrad (KD), damit es relativ einfach ist, gut zu rankenAber seien wir mal ehrlich. Du wirst fast nie Themen finden, die alle drei Kriterien erfüllen. Aber von diesen drei Kriterien legen wir in der Regel den Schwerpunkt auf ein hohes Geschäftspotenzial. Denn wenn deine Inhalte nicht produktorientiert sind, wird dein MPM wahrscheinlich nur deine Inhalte empfehlen, nicht dein Produkt.Wir verwenden die folgende Skala, um die Keywords zu klassifizieren, und ich empfehle dir, einen ähnlichen Ansatz zu verwenden:Lesetipp: Wie wähle ich die richtigen Keywords für SEO?Schritt 3. Verdopple die Verbreitung von InhaltenGute Inhalte zu erstellen, kostet viel Zeit und Mühe. Der Klick auf die Schaltfläche “Veröffentlichen” ist jedoch nur die halbe Miete.Du brauchst eine gute Content-Strategie, die mehrere Marketingkanäle nutzt, damit deine Inhalte schon bekannt werden, bevor sie in den SERPs ranken.So gehen wir im Allgemeinen mit unseren Inhalten um:Wir teilen sie auf unseren betrieblichen und persönlichen Social-Media-AccountsWir nehmen sie in unseren Newsletter aufWir veröffentlichen sie als eigenständige Beiträge und/oder Videos in den sozialen MedienWir bewerben sie mit AnzeigenIch möchte hier auch den Start einer Outreach-Kampagne hervorheben. Heutzutage tun wir das nur noch selten. Aber die Öffentlichkeitsarbeit kann entscheidend für deinen Erfolg sein, besonders wenn du in der Branche noch nicht so bekannt bist. Wenn du dich mit deinen Inhalten an die Medien und an Autoritäten der Branche wendest, kannst du dir tolle Backlinks und Anerkennung verschaffen, wenn du es richtig machst.Schritt 5. Optimieren und das Ganze von vorneNatürlich ist die Erstellung hervorragender produktbezogener Inhalte kein Allheilmittel für dein SEO und MPM. Du wirst viel Geduld brauchen. Außerdem solltest du die besten SEO-Praktiken auf deiner gesamten Website anwenden und auch den Rest der MPM-Tipps hier befolgen.Tipp 3. Schaffe oder stelle Markenbotschafter einIch glaube, dass der Einsatz von Markenbotschaftern der beste Ansatz für Influencer-Marketing ist, der wiederum deinem MPM einen großen Schub geben kann.Ein Markenbotschafter ist jemand, der regelmäßig im Rampenlicht steht und ein Unternehmen repräsentiert. Oft handelt es sich dabei um einen Mitarbeiter, der die Community beeinflussen kann. Aber du kannst diese langfristige Partnerschaft mit jedem eingehen. Sicherlich folgst du einigen Influencern, die schon seit Jahren für bestimmte Produkte werben.Wir haben zum Beispiel Patrick Stox. Er ist einer der bekanntesten technischen SEOs. Er spricht oft auf SEO-Veranstaltungen, organisiert sie und moderiert sogar einen beliebten Branchen-Subreddit namens TechSEO.Was die bezahlten Kampagnen angeht, so kommen die besten Sponsorings und ehrlichen Empfehlungen für unser Produkt von unseren langjährigen Kunden:Bedenke aber, dass du die Vorteile von MPM nicht nutzen kannst, wenn du einmalige oder kurzfristige Kampagnen durchführst. Hol dir die Influencer und Markenbotschafter, die regelmäßig für deine Produkte werben.Die besten Chancen hast du, wenn du dich an Menschen wendest, die bereits deine Kunden sind. Auch hier gilt: Wenn du ein hervorragendes Produkt hast, verbreiten sie es vielleicht sowieso schon kostenlos.Tipp 5. Baue eine engagierte Gemeinschaft aufEine große Fangemeinde in den sozialen Medien bedeutet noch lange kein gutes MPM. Damit das funktioniert, musst du die Mitglieder deines Publikums dazu ermutigen, sich untereinander auszutauschen, über alles zu reden, was mit deinem Unternehmen und deinen Produkten zu tun hat, und ihnen generell das Gefühl geben, dass sie dir näher stehen.Hier sind ein paar Tipps zum Aufbau einer Community, die dein MPM verstärken können.Erstelle eine Gruppe für deine KundenAhrefs Insider ist unsere Facebook-Gruppe “nur für Kunden”. Zum Zeitpunkt der Erstellung dieses Artikels hat sie ~16.500 Mitglieder:Im Laufe der Jahre haben wir daraus eine engagierte Gemeinschaft gemacht, deren Mitglieder bereit sind, ihr Wissen zu teilen, Fragen zu beantworten und Beiträge zu unserem Toolset zu liefern.Man könnte sagen, je größer die Gruppe, desto besser für die Mundpropaganda. Trotzdem lassen wir nur unsere Kunden rein. Und warum? Nun, es gibt zwei große Vorteile, die helfen, Mundpropaganda noch besser zu verbreiten.Erstens muss jeder, der auch nur für unseren günstigsten Monatstarif zahlt, ein gewisses Interesse an SEO haben und mit unserem Produkt vertraut sein. So ist sichergestellt, dass es in der Regel gute, relevante Diskussionen gibt, an denen sich die Mitglieder beteiligen wollen.Und zweitens kann die Gruppe, sobald sie ihren Mitgliedern einen Mehrwert bietet, einen FOMO-Effekt für diejenigen auslösen, die noch keine Mitglieder oder Kunden sind.Halte dein Publikum über deine Produktentwicklung auf dem LaufendenDu hast eine neue Funktion? Ist es eine neue Generation deines Produkts? Oder hat sich etwas aufgrund des Feedbacks deiner Community geändert? Nutze jeden verfügbaren Verbreitungskanal, um sie darüber zu informieren.Es gibt fast nie genug Öffentlichkeit, also sorge dafür, dass du alle deine Social-Media-Profile, Blog-Updates, Videos, Newsletter und natürlich auch deine eigene Gruppe nutzt.In unserem Fall erfahren die Mitglieder von Ahrefs Insider von unseren Produktaktualisierungen, sobald sie veröffentlicht werden:Du kannst dir sicher sein, dass diese Informationen dann über alle anderen oben genannten Vertriebskanäle weitergegeben werden.Initiiere Gespräche in deiner CommunityDas beste Szenario für deine Gemeinschaft und das Wachstum von Mundpropaganda ist, wenn die Menschen organisch miteinander in Kontakt treten. Das passiert sowohl innerhalb als auch außerhalb unserer FB-Gruppe. Aber gemeinsame Themen zu finden und diese Gespräche zu initiieren, erhöht das Mundpropaganda-Wachstum weiter.Wir fragen unsere Mitglieder zum Beispiel oft nach ihrer Meinung zu bestimmten Produktfunktionen oder SEO- und Marketingthemen. Darüber hinaus veranstalten wir jeden Monat ein “SEO-Speeddating”:Sei offen, sei empfänglich und denke über ihr Feedback nachGib deinen Kunden und Fans das Gefühl, dass sie gehört werden (und das sollten sie auch), und du wirst ihnen als Unternehmen näher kommen. Dies kann über Mitarbeiter und Markenbotschafter geschehen, wodurch sich die Interaktionen noch persönlicher anfühlen.Hier ist ein Beispiel dafür, wie unser CMO, Tim Soulo, in einem beliebten SEO-Reddit nach Produktfeedback fragt:Unnötig zu sagen, dass wir manchmal negative Nachrichten und Rückmeldungen bekommen. Das ist völlig normal und zu erwarten. Was vielleicht nicht so üblich ist: Wenn wir sagen, dass wir das Feedback und die Vorschläge mit dem Team besprechen, meinen wir das auch wirklich so. Ich empfehle dir, einen ähnlichen Ansatz zu wählen.Sich aufrichtig mit deinem Publikum auseinanderzusetzen, hat sowieso nur Vorteile. Das kann sogar in Form eines Videos sein, das auf eine häufig gestellte Frage antwortet:https://www.youtube.com/watch?v=AYlL4ZN1zHAVerteile hochwertige und nützliche Merchandising-ArtikelSeien wir mal ehrlich. Wahrscheinlich landen die meisten Marketingartikel, die du bekommst, irgendwo in einer Schublade. Aber was wäre, wenn du Dinge produzieren würdest, die die Leute benutzen wollen und sogar bereit sind, dafür zu bezahlen?I would drop a pretty penny on some ahrefs merch to be honest. @samsgoh hook it up with a hoodie.— Lazaroc.eth (@Lazaroc) January 8, 2021Deine Ware zu verkaufen kann als übertrieben angesehen werden. Aber eine gewisse Verknappung steigert definitiv die Nachfrage, wenn es sich lohnt. Wenn nur ein paar Leute bei einem Community-Event ein cooles Ding haben, kann das definitiv Gespräche auslösen.Ich trage unsere T‑Shirts und unseren Hoodie oft auf Branchenveranstaltungen. Viele SEOs kamen auf mich zu und fragten mich, wie sie die Fanartikel für sich selbst bekommen könnten. Ich kann dir versichern, dass einige von ihnen nicht wussten, wer ich bin oder dass ich für Ahrefs arbeite.Übrigens gibt es mehrere Möglichkeiten, unser Merchandise zu bekommen. Eine davon sind öffentliche Giveaways.Who wants this pretty box with some Ahrefs’ swag and goodies?😜Just tell us which Ahrefs’ feature is your favourite. We’ll select 10 people at random and send them these swag boxes. 🙃 pic.twitter.com/5DQ32B6Qly— Ahrefs (@ahrefs) April 7, 2021Aber wenn ich dir von den anderen Möglichkeiten erzähle, wird das die Verknappung und das FOMO nicht noch verstärken, also belassen wir es hier.FazitDu kannst mit MPM unabhängig von deinem Unternehmen erfolgreich sein, vor allem, wenn du bereits ein erstklassiges Produkt hast.Wenn wir über die hier erwähnten Taktiken hinausgehen, solltest du vielleicht auch in Betracht ziehen, deinen Net Promoter Score (NPS) zu bewerten und zu verbessern, Kunden zu ermutigen, Bewertungen auf wichtigen Plattformen zu hinterlassen, oder eine Geschenkaktion ohne Bedingungen zu planen.Alle diese Taktiken zusammen sind mehr als genug, um mit MPM erfolgreich zu sein.Noch Fragen? Schreib mir auf Twitter. Article PerformanceData from AhrefsVerlinkung von Websites 2 Sign up for AhrefsGet SEO metrics of any website or URL.The number of websites linking to this post.This post's estimated monthly organic search traffic.Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Michal Pecánek Vermarkter und Content-Autor bei Ahrefs. Süchtig nach SEO, Luftfahrt, Parfums, Sushi und Tacos.",
  "headers": [
    {
      "level": "H1",
      "text": "Mundpropaganda: Ein einfacher & geprüfter Leitfaden"
    },
    {
      "level": "H2",
      "text": "Was ist Mundpropaganda-Marketing?"
    },
    {
      "level": "H2",
      "text": "Warum ist Mundpropaganda-Marketing wichtig?"
    },
    {
      "level": "H2",
      "text": "Das Schwungradprinzip hinter dem Mundpropaganda-Marketing"
    },
    {
      "level": "H2",
      "text": "Fünf bewährte Tipps für das Mundpropaganda-Marketing"
    },
    {
      "level": "H3",
      "text": "Tipp 1. Ein hervorragendes Produktangebot haben"
    },
    {
      "level": "H3",
      "text": "Tipp 2. Führe deine Marke richtig"
    },
    {
      "level": "H3",
      "text": "Tipp 3. Fokus auf produktbezogenes Content Marketing"
    },
    {
      "level": "H4",
      "text": "Schritt 1. Mach eine Keyword-Recherche"
    },
    {
      "level": "H4",
      "text": "Schritt 2. Konzentriere dich auf Themen mit hohem Geschäftspotenzial"
    },
    {
      "level": "H4",
      "text": "Schritt 3. Verdopple die Verbreitung von Inhalten"
    },
    {
      "level": "H4",
      "text": "Schritt 5. Optimieren und das Ganze von vorne"
    },
    {
      "level": "H3",
      "text": "Tipp 3. Schaffe oder stelle Markenbotschafter ein"
    },
    {
      "level": "H3",
      "text": "Tipp 5. Baue eine engagierte Gemeinschaft auf"
    },
    {
      "level": "H4",
      "text": "Erstelle eine Gruppe für deine Kunden"
    },
    {
      "level": "H4",
      "text": "Halte dein Publikum über deine Produktentwicklung auf dem Laufenden"
    },
    {
      "level": "H4",
      "text": "Initiiere Gespräche in deiner Community"
    },
    {
      "level": "H4",
      "text": "Sei offen, sei empfänglich und denke über ihr Feedback nach"
    },
    {
      "level": "H4",
      "text": "Verteile hochwertige und nützliche Merchandising-Artikel"
    },
    {
      "level": "H2",
      "text": "Fazit"
    }
  ],
  "author": "Michal Pecánek"
}