{
  "url": "https://ahrefs.com/blog/de/negative-seo/",
  "slug": "negative-seo",
  "title": "Wie du negative SEO-Angriffe erkennst (und abwehrst)",
  "description": "Negative SEO bedeutet, dass ein Mitbewerber mit Black-Hat-Taktiken versucht, das Ranking einer konkurrierenden Website oder Webseite zu sabotieren.",
  "content": "Michal Pecánek Vermarkter und Content-Autor bei Ahrefs. Süchtig nach SEO, Luftfahrt, Parfums, Sushi und Tacos. Inhalt Ist dein organischer Such-Traffic in den letzten Monaten stark zurückgegangen und du weißt nicht warum?Auch wenn es heutzutage sehr unwahrscheinlich ist, könnte negative SEO der Übeltäter sein.Aber bevor wir darüber sprechen, wie man negative SEO erkennt, abwendet und bekämpft, müssen wir erst einmal verstehen, was das ist…Was ist negative SEO?Arten von negativen SEO-AngriffenFunktioniert negative SEO?Wie du die häufigsten Arten von negativen SEO-Angriffen erkennst, vermeidest und behebstWas ist negative SEO?Negative SEO bedeutet, dass ein Mitbewerber mit illegalen Methoden versucht, das Ranking einer konkurrierenden Website oder Webseite zu sabotieren. Diese Praxis ist nicht nur unethisch, sondern manchmal auch illegal.Arten von negativen SEO-AngriffenDer Aufbau minderwertiger Links im großen Stil ist vielleicht die häufigste und einfachste Art von negativer SEO, weil sie so einfach und billig ist. Es gibt viele Websites, die Tausende von spammigen Backlinks für so gut wie nichts verkaufen.Hier ist eine Seite, die 60 Millionen Backlinks für 1.475 $ anbietet:Das sind etwa 40.000 Links pro Dollar!Andere häufige Arten von negativer SEO sind:Das Einreichen von gefälschten Anträgen auf LinkentfernungDas Hinterlassen von gefälschten negativen BewertungenHacken von Websites und andere Formen von CyberangriffenFunktioniert negative SEO?Googles offizielle Haltung zu diesem Thema ab 2021 ist eindeutig Nein, und das schon seit vielen Jahren.John Mueller, Search Advocate bei Google, bezeichnet negative SEO heutzutage als eine Art Mem:I don’t think the meme of negative SEO will ever go away. It’s tempting to assume someone else is causing issues, and, yes, sometimes people have a lot of money, time, bad ideas. Time will tell, and I’m pretty confident it’ll be fine.— 🐄 John 🐄 (@JohnMu) March 1, 2021 Ich glaube nicht, dass das Mem der negativen SEO jemals verschwinden wird. Es ist verlockend, anzunehmen, dass jemand anderes die Probleme verursacht, und ja, manchmal haben Leute viel Geld, Zeit und schlechte Ideen. Die Zeit wird es zeigen, und ich bin ziemlich zuversichtlich, dass es gut gehen wird.Gary Illyes, ein weiterer Google-Mitarbeiter, hat ähnliche Aussagen getätigt: [Ich habe] mir Hunderte von vermeintlichen Fällen von negativer SEO angesehen, aber keiner davon war tatsächlich der Grund für den Rückgang der Besucherzahlen einer Website. […] Es ist zwar einfacher, negative SEO zu beschuldigen, aber in der Regel ist der Schuldige für einen Traffic-Rückgang etwas anderes, von dem man nichts weißt — vielleicht ein Algorithmus-Update oder ein Problem mit der Website.Gary Illyes, Webmaster Trends Analyst GoogleAber viele SEO-Experten werden dir sagen, dass es nicht immer die beste Idee ist, die Worte von Google für bare Münze zu nehmen. Wir sagen dir, was wir denken:Negative SEO kann immer noch funktionieren, aber sie ist viel weniger ein Problem als früher.Ich weiß, dass das eine gewagte Aussage ist, also lass mich dir erklären, warum wir das glauben.1. Google wertet jetzt Link-Spam ab, anstatt Websites zu degradierenPenguin ist der Teil des Google-Kernalgorithmus, der Linkspam abfangen soll.Vor 2016 funktionierte er folgendermaßen:Penguin erkennt einen Zustrom von Spam-Links zu einer Website.Die Website wird in den organischen Suchergebnissen herabgestuft (d.h. Ranking und Traffic-Verlust).Doch dann veröffentlichte Google Penguin 4.0.Anstatt ganze Websites herabzustufen, wertet Google nun Linkspam ab (oder versucht es zumindest).Hier erklärt Gary Illyes den Unterschied zwischen Abwertung und Degradierung:Herabstufen wie in “das Ranking einer Seite anpassen”. Abwerten im Sinne von “Oh, sieh mal, da kommt so ein Mist auf diese Seite zu. Stellen wir sicher, dass sich das nicht auf das Ranking auswirkt.Kurz gesagt: Google versucht, minderwertige Links zu erkennen und zu ignorieren, damit sie sich nicht auf dein Ranking auswirken.Deshalb wird unser kostenloser Backlink-Checker schätzungsweise 133.000 Mal pro Monat besucht…… obwohl jemand freundlicherweise von über einer Million spammiger Seiten auf sie verlinkt:Daten über den Ahrefs Site Explorer.Google leistet offensichtlich hervorragende Arbeit, indem es diesen eklatanten negativen SEO-Angriff ignoriert.2. Pinguin 4.0 ist “präziser”Früher hat Penguin ganze Websites mit Linkspam herabgestuft.Wenn du also auf einer Seite eine negative SEO-Attacke erlebst, straft Penguin deine gesamte Website ab und dein Ranking sinkt auf der ganzen Linie.Aber seit Pinguin 4.0 funktioniert das nicht immer so.Hier ist, was Google in seiner offiziellen Ankündigung mitteilt:Penguin ist jetzt noch granularer. Penguin wertet jetzt Spam ab, indem er das Ranking auf der Grundlage von Spam-Signalen anpasst, anstatt das Ranking der gesamten Website zu beeinflussen.Verwirrt? Hier ist die “Erklärung” von Google, was das bedeutet:Das bedeutet, dass es sich auf eine feinere Granularität als nur auf Seiten auswirkt. Es bedeutet nicht, dass es nur Seiten betrifft.Immer noch verwirrt? Hier ist unsere Interpretation:Penguin versucht, den einfachen Linkspam, der mit den meisten negativen SEO-Attacken verbunden ist, zu entwerten (zu ignorieren). Penguin versucht aber immer noch, diejenigen zu bestrafen, die absichtlich manipulative Links algorithmisch aufbauen. Das ist der Sinn von Penguin. Wenn Penguin Linkspam entdeckt, kann er die Seite, auf die die manipulativen Links verweisen, einen Teilbereich der Website oder die gesamte Website herabstufen. Das kommt darauf an.Mit anderen Worten: Die Wahrscheinlichkeit, dass ein negativer SEO-Angriff erfolgreich ist, ist heute geringer als in der Zeit vor Penguin 4.0. Außerdem wird Google im Erfolgsfall wahrscheinlich nicht deine gesamte Website herabstufen, so dass die negativen Auswirkungen im wirklichen Leben wahrscheinlich viel weniger katastrophal sind als früher.3. Das Geschäftsmodell von Google beruht darauf, dass negative SEO nicht funktioniertNegative SEO ist eine Taktik, die in der Regel von Website-Betreibern angewendet wird, die allein aufgrund ihrer Leistung nicht ranken können. Anstatt ihre Website zu verbessern, nutzen sie negative SEO, um die Konkurrenten, die es mehr verdienen und über ihnen ranken, abzuschießen.Das ist ungefähr so, als würde man mit Usain Bolt bei der Olympiade konkurrieren und seine Schnürsenkel miteinander zu verknoten.Niemand würde sich die Olympischen Spiele ansehen, wenn das erlaubt wäre. Es macht keinen Spaß, einem Verlierer dabei zuzusehen, wie er sich an die Spitze mogelt. Genauso würde niemand Google nutzen, wenn die Seite, die ganz oben steht, immer Spam wäre. Und wenn niemand Google nutzt, hat das Unternehmen keine Werbeeinnahmen. Ihr Geschäft würde sich auflösen.Aus diesem Grund hat Google Penguin 4.0 eingeführt. Deshalb wird er in Echtzeit ausgeführt und zielt darauf ab, Link-Spam zu entwerten, anstatt ganze Websites herabzustufen. Und deshalb investiert Google auch weiterhin in die Bekämpfung von negativer SEO.4. Link-Spam ist nicht die einzige Art von negativer SEODie drei oben genannten Punkte erklären, warum linkbasierte negative SEO-Angriffe heute viel seltener vorkommen als früher.Aber nicht alle negativen SEO-Angriffe sind linkbasiert.Jemand könnte deine Website hacken und spammige Links einfügen, gefälschte negative Bewertungen online stellen oder etwas viel Schlimmeres.Das ist ein wichtiger Punkt, den du im Hinterkopf behalten solltest.Beim Aufspüren und Abwehren von negativer SEO geht es nicht mehr darum, Links von zwielichtigen Websites zu finden und abzuweisen. Jetzt geht es darum, deine gesamte Online-Präsenz im Auge zu behalten und positive Sicherheitsmaßnahmen zu ergreifen, um die “Bösewichte” auf Abstand zu halten.Wie du die häufigsten Arten von negativen SEO-Angriffen erkennst, vermeidest und behebstIm Folgenden beschreibe ich, wie du diese sieben Arten von negativen SEO-Angriffen erkennst und abwehrst:Spammiger LinkaufbauGefälschte Anträge auf LinkentfernungScraping von InhaltenFalsche URL-ParameterGefälschte BewertungenHacking deiner WebsiteDDoS-AngriffeBeginnen wir mit der Taktik, die am häufigsten mit negativer SEO in Verbindung gebracht wird.1. Spammiger LinkaufbauDer Aufbau tonnenweise minderwertiger Links zu einer konkurrierenden Website ist wahrscheinlich die am weitesten verbreitete Form negativer SEO — und mit Sicherheit die am wenigsten ausgefeilte.Egal, ob diese Spam-Links von billigen Fiverr-Aufträgen, Scrapebox-Kommentarspam oder einem PBN (Private Blog Network) stammen, das Ergebnis ist dasselbe: ein plötzlicher Zustrom von dubiosen Links, die auf deine Seite verweisen.Wie Spam-Links deiner Website schaden könnenEs gibt zwei Ansätze für Link-Spam, wenn es um negative SEO geht, und ein skrupelloser SEO kann einen von beiden (oder sogar beide) anwenden. Der Mengenansatz: Tausende von minderwertigen Links auf deine Seite zu verweisen. Die überoptimierte Ankertext-Methode: Viele Links mit exakt übereinstimmenden Ankertexten auf eine rankende Seite setzen, um ihr ein unnatürliches Ankertextverhältnis zu geben.Beide Methoden zielen darauf ab, deine Seite abzustrafen — entweder algorithmisch durch Penguin oder durch eine manuelle Maßnahme von Googles Webspam-Team.Zum Glück sind diese beiden Taktiken leicht zu erkennen.Nebenbei bemerkt. Weitere Informationen über Spam-Links und wie sie deiner Website schaden können, findest du in unserem Leitfaden für schlechte Links.Wie man einen Spam-Link-Angriff erkenntHier sind drei Methoden, mit denen du Spam-Links (die du nicht selbst erstellt hast) erkennen kannst, die auf deine Website verweisen.Methode 1: Finde Spam-Links in EchtzeitDie einfachste Methode, einen aktiven Link-Spam-Angriff zu erkennen, ist die Überwachung neuer Backlinks, die auf deine Website verweisen.Das kannst du tun, indem du in Ahrefs Alerts einen Backlinks-Alarm einrichtest.Alerts > Backlinks > Neuer Alert > Domain eingeben > Neue Backlinks > E‑Mail-Intervall festlegen > HinzufügenDu bekommst dann regelmäßig eine E‑Mail, die dich über alle neuen Links informiert, die Ahrefs entdeckt hat und die auf deine Seite verweisen.Die obige Abbildung zeigt eine standardmäßige tägliche Verteilung der neuen verweisenden Domains auf ahrefs.com. Links von 0–30 DR-Domains werden immer häufiger vorkommen. Einige von ihnen sind spammig. Das ist normal und kein Grund zur Sorge.Wenn du den Alert eingerichtet hast und dir die Historie der neuen verweisenden Domains ansiehst, solltest du einen Überblick über den täglichen Zustrom von Backlinks in deinem Portfolio haben. Wenn du eine ungewöhnlich hohe Anzahl neuer verweisender Domains siehst, handelt es sich mit ziemlicher Sicherheit um einen negativen SEO-Angriff.Methode 2: Überprüfe die Diagramme der verweisenden Domains und SeitenNutze die Diagramme zu den verweisenden Domains und Seiten im Site Explorer von Ahrefs, um schnell Höhepunkte in deinem Backlink-Profil zu erkennen. Site Explorer > Domain eingeben > ÜbersichtEs ist wichtig zu wissen, dass ein plötzlicher Anstieg der verweisenden Domains eine gute Sache sein kann. Es kann zum Beispiel sein, dass einer deiner Beiträge viral gegangen ist oder dass du mit einer Outreach-Kampagne Erfolg hattest.Es könnte aber auch ein Zeichen für einen negativen SEO-Angriff sein.Hier erfährst du, wie du mit dem Ahrefs Site Explorer weiter nachforschen kannst:Öffne den Bericht “Backlinks”.Ändere den Modus auf “Ein Link pro Domain”.Klicke auf den Dofollow-FilterKlicke auf den Filter “Neue Backlinks”Wähle den Zeitraum, in dem der Höhepunkt aufgetreten istSortiere die Ergebnisse nach aufsteigendem Domain-Traffic.Du wirst wahrscheinlich einige Muster in den verweisenden Seiten und Ankertexten erkennen. Auch das kannst du filtern. In diesem Beispiel habe ich etwas Spam von blogspot.com gefunden:Der meiste Link-Spam ist nicht besonders raffiniert, so dass du die Trends schnell erkennst, wenn das der Fall ist.Ich muss dich jedoch davor warnen, auf verdächtig aussehende Websites und Links zu klicken. Es ist besser, wenn du das nicht tust, denn es kann ein Sicherheitsrisiko darstellen.Methode 3: Überprüfe den Anchor-BerichtDie ersten beiden Methoden sind am effektivsten, um groß angelegte Angriffe zu erkennen, bei denen jemand Hunderte oder Tausende von Links auf deine Website verweist.Aber es ist auch einfach, einen Versuch zu erkennen, dein Ankertext-Verhältnis zu manipulieren.So gehst du im Site Explorer vor:Klicke auf den Bericht Anchors/AnkerWähle Dofollow-LinksSieh dir die Spalte “Verweisende Seiten” mit der prozentualen Verwendung von Ankertexten anWenn du einen ungewöhnlich hohen Prozentsatz an Keyword-reichen Ankern siehst, könnte das ein Zeichen für schlechte Linkaufbau-Praktiken oder sogar für einen hinterhältigen Link-basierten negativen SEO-Angriff sein.In diesem Fall fand ich den folgenden Ankertext, der von mehreren verweisenden Domänen und Seiten verwendet wurde:Da es unwahrscheinlich ist, dass mehrere legitime Websites mit einem so langen und spezifischen Anker auf uns verlinken, handelt es sich wahrscheinlich um eine Art Link-Spam. Wir können weitere Untersuchungen durchführen, indem wir auf das Caret in der Spalte Ref. Domains oder Links to target klicken, um die verlinkenden Websites und Seiten anzuzeigen.Methode 4: Überprüfe den Bericht über die verweisenden IPsWenn du Links von vielen verweisenden Domains auf der selben Subnetz-IP hast, kann das ein weiteres Zeichen für einen negativen SEO-Angriff sein.Warum? Weil dies oft darauf hindeutet, dass die Websites am selben Ort gehostet werden.Wenn viele Websites am selben Ort gehostet werden, ist es wahrscheinlich, dass sie derselben Person gehören.Und wenn sie derselben Person gehören, dann handelt es sich wahrscheinlich um ein PBN.Um eine Aufschlüsselung zu sehen, schau dir den Bericht “Verweisende IPs” im Site Explorer an.Es ist wichtig zu wissen, dass es nicht ungewöhnlich ist, Links von ein paar Domains aus demselben Subnetz zu haben. Aber Hunderte oder sogar Tausende von Domains aus einem Subnetz sind verdächtig.Wenn wir uns die Mühe machen und uns das etwas genauer ansehen, sehen wir den gleichen alten Blogspot-Spam:So wehrst du dich gegen Link-Spam-AngriffeEs ist praktisch unmöglich, Spam-Links entfernen zu lassen. Das Einzige, was du proaktiv tun kannst, ist, sie abzulehnen bzw. zu desavouieren.Dabei lädst du eine Liste der verlinkenden Seiten (oder Websites) in einem bestimmten Format bei Google hoch und sagst ihnen damit: “Ich stehe nicht für diese Links ein — bitte ignoriere sie.”Aber die Sache ist die:Seit der Einführung von Penguin 4.0, der Linkspam abwertet und in Echtzeit arbeitet, herrscht unter SEOs Einigkeit darüber, dass es nicht nötig ist, Links abzulehnen bzw. zu desavouieren, solange du nicht die negativen Auswirkungen (d.h. sinkendes Ranking/Traffic) zu spüren bekommst.Der Grund dafür ist, dass Google offensichtlichen Link-Spam ziemlich gut ignoriert, so dass ein Disavowing oft nur Zeitverschwendung ist.Außerdem kann das Disavowing der falschen Links mehr schaden als nützen.Hier ist, was Marie Haynes — eine Expertin für Google-Sanktionen — dazu sagt:Ich würde sagen, dass du die meisten Websites einfach ignorieren kannst, wenn du von einer Flut von Spam-Links angegriffen wirst. Ich würde aber trotzdem Links ablehnen, wenn einer der folgenden Punkte zutrifft:Du hast in der Vergangenheit selbst Links zu SEO-Zwecken erstellt.Du bist in einer sehr wettbewerbsintensiven Branche tätig. Ich glaube, dass es in diesen Nischen strengere Algorithmen gibt, die negative SEO ein wenig effektiver machen können.Du siehst einen Rückgang des Traffics, der mit dem Ansturm der Links zusammenfällt und es gibt keine andere Erklärung für den Rückgang.Marie Haynes, Founder Marie Haynes ConsultingDenke daran, dass du ganze Domains nur dann disavowen solltest, wenn du sicher bist, dass keiner der Backlinks von ihnen legal ist. Wenn du dir bei diesem Prozess unsicher bist, wende dich an eine Expertin wie Marie.Weitere InformationenDisavow-FallstudienGoogles “Disavow Links Tool”: Ein vollständiger LeitfadenGoogle Abstrafungen: Wie man sie findet, behebt und vermeidet (ein Expertenleitfaden)Ankertext: Ein datengestützter Leitfaden (384.614 untersuchte Webseiten)Ein detaillierter Leitfaden zu Linkqualität, Linkabstrafungen und “schlechten Links”2. Gefälschte Anfragen zur LinkentfernungDies ist eine besonders hinterhältige Form der negativen SEO, bei der unethische SEOs E‑Mails wie diese an Websites schicken, die auf dich verlinken:Lieber Webmaster,die Website unseres Kunden X verfügt über Links auf Ihrer Seite Y.Aufgrund der jüngsten Änderungen im Google-Algorithmus benötigen wir diese Links nicht mehr und bitten Sie, sie zu entfernen.Vielen Dank!Irgendein SEO-UnternehmenWenn ihr Motiv nicht schon aus der E‑Mail ersichtlich ist, versuchen sie, Websites dazu zu bringen, deine besten Links zu entfernen.Wie gefälschte Linkanfragen deiner Seite schaden könnenEs sollte kein Zweifel daran bestehen, dass ein Link-Spam-Angriff auf deine Seite funktioniert. Solche Angriffe sind zwar selten, aber ihre Auswirkungen können enorm sein.Stell dir vor, du verlierst über Nacht viele deiner besten Backlinks. Das wird dazu führen, dass deine Rankings wie ein Stein fallen.Wie du eine Linkentfernungs-Attacke erkennstEs gibt keine Möglichkeit, die gefälschten Linkentfernung-Anfragen zu stoppen — das liegt nicht in deiner Hand.Was du aber tun kannst, ist, nach Anzeichen für einen aktiven Linkentfernungs-Angriff Ausschau zu halten und so schnell wie möglich Maßnahmen zu ergreifen, um deine Backlinks zu schützen.Dafür kannst du Ahrefs Alerts verwenden.Die Ahrefs Backlinks Alerts zeigen dir nicht nur alle neuen Links an, die auf deine Website verweisen, sondern können dich auch über verlorene Backlinks informieren.Du erhältst dann regelmäßig E‑Mails, die dich auf solche verlorenen Backlinks aufmerksam machen:Wenn du feststellst, dass hochwertige Backlinks verschwinden, solltest du das unabhängig von einem Verdacht auf einen negativen SEO-Angriff genauer untersuchen.Oft gibt es einen legitimen Grund für die Entfernung.Zum Beispiel könnte die Seite entfernt, umgeleitet oder der Inhalt aktualisiert worden sein.Wenn du aber keinen offensichtlichen Grund für die vielen verlorenen Links erkennen kannst, könnte das ein Zeichen für einen Linkentfernungs-Angriff sein. In diesem Fall lohnt es sich, die (ehemals) verlinkende Website zu kontaktieren und zu fragen, warum dein Link entfernt wurde.Wenn jemand tatsächlich einen gefälschten Antrag auf Linkentfernung geschickt hat, wirst du das auf diese Weise schnell herausfinden. Und selbst wenn es einen legitimen Grund für die Entfernung des Links gab, kann es sein, dass die Seite den Link wieder einfügt.Wie du dich gegen gefälschte Linkentfernungs-Anfragen wehrstSobald du weißt, dass eine Linkentfernungs-Attacke im Gange ist, gibt es zwei Möglichkeiten, dagegen vorzugehen: Wenn dein Link bereits entfernt wurde, wende dich an alle Websites, die deinen Link bereits entfernt haben. Lass sie wissen, dass die Anfrage nicht von deinem Unternehmen stammt, und bitte sie, den Link wiederherzustellen. Wenn die Seite immer noch verlinkt, solltest du deine Backlink-Warnungen noch genauer im Auge behalten und entsprechende Maßnahmen ergreifen, falls du weitere Links verlierst.3. Content-ScrapingVon Content-Scraping spricht man, wenn jemand deine Inhalte kopiert und sie wortwörtlich auf einer anderen Website veröffentlicht.In den meisten Fällen geschieht dies nicht in böser Absicht. Wer deine Inhalte kopiert, versucht in der Regel nur, kostenlose Inhalte zu erhalten. Sie versuchen nicht, deiner Website zu schaden, aber es kann trotzdem passieren.Wie Content-Scraping-Angriffe deiner Website schaden könnenGoogle mag es nicht, wenn Inhalte auf mehreren Seiten im Internet dupliziert werden.In der Regel wählt es eine Version aus, um sie zu ranken, und ignoriert den Rest.Ich möchte an dieser Stelle darauf hinweisen, dass es nicht schlimm ist, wenn du deine Inhalte auf hochrangigen Websites syndizierst und einen Link zu deinem Originalbeitrag setzt.Aber wenn jemand deine Inhalte ohne Quellenangabe kopiert, ist das nicht gut.Du würdest hoffen, dass Google klug genug ist, um deine Website als die ursprüngliche Quelle des Inhalts zu erkennen. In den meisten Fällen ist das auch der Fall.Aber nicht immer.Das ist meistens dann der Fall, wenn deine Inhalte auf einer angesehenen Website gepostet wurden. Manchmal sieht Google diese Autorität als Zeichen dafür, dass der Inhalt von dort stammen muss.Und wenn die Person, die deine Inhalte scraped und dupliziert, das auch so sieht…… dann hast du wirklich ein Problem.Wie du einen Content-Scraping-Angriffe erkennstDie schnellste und einfachste Methode, um herauszufinden, ob dein Inhalt gescraped wurde, ist, einen Absatz von deiner Seite zu kopieren und ihn bei Google einzufügen (mit Anführungszeichen).Beachte, dass Google nur nach bis zu 32 Wörtern sucht und alles in der Suchanfrage, das darüber hinausgeht, ignoriert.Wenn du den Verdacht hast, dass einige deiner URLs durch Content-Scraping geschädigt wurden, kannst du ihren Status jederzeit in der Google Search Console überprüfen. Wonach du suchst, ist die so genannte “Google-selected canonical”.Du findest es, nachdem du die URL in die Adressleiste der Google Search Console unter dem Abschnitt “Coverage” eingefügt hast:Du solltest dort die geprüfte URL sehen. Das bedeutet, dass Google die geprüfte URL als die verbindlichste Version des Inhalts betrachtet. Wenn du dort eine andere interne URL siehst, hast du ein Problem mit dupliziertem Content. Wenn du dort eine externe URL siehst, hast du es mit negativer SEO zu tun.Bei mehreren Seiten ist das eine zeitraubende Aufgabe. Stattdessen kannst du Tools wie Copyscape verwenden, die speziell dafür entwickelt wurden, gescrapte Inhalte in großem Umfang zu finden.Wenn du eine Liste mit doppelten externen URLs hast, kannst du mit dem Tool Batch Analysis überprüfen, ob eine dieser URLs organischen Traffic erhält. Sortiere die URLs nach Traffic:Wenn du eine URL findest, die organischen Traffic erhält, dann war ihr Content-Scraping erfolgreich.Aber wie ich bereits erwähnt habe, ist die Wahrscheinlichkeit, dass diese Taktik funktioniert, sehr gering.Wie du dich gegen Content-Scraping wehrstDu musst dich nur dann gegen Content-Scraping wehren, wenn es zu Problemen führt.Aber Diebstahl ist Diebstahl. Wenn du also nicht damit einverstanden bist, dass jemand deine Inhalte klaut, kannst du drei Dinge tun:1) Bitte um einen AttributionslinkDas kommt zwar selten vor, aber wenn die Seite, die deine Inhalte kopiert hat, von hoher Qualität ist und du das Gefühl hast, dass ein Link von ihr deinem Ranking helfen könnte, dann solltest du sie um einen Attributionslink bitten, der auf den kopierten Beitrag verweist.2) Reiche eine DMCA-Beschwerde einWenn der gescrapte Inhalt deinen organischen Traffic stiehlt, musst du das verhindern. Vergewissere dich vorher aber, dass dahinter eine böswillige Absicht steckt, bei der du keine Chance hast, einen kanonischen Attributionslink zu erhalten.Um Google dazu zu bringen, die Duplikate zu entfernen, musst du eine DMCA-Beschwerde (Digital Millennium Copyright Act) gegen jede Seite einreichen, die deine Inhalte kopiert hat.Das kannst du über das DMCA Dashboard von Google tun.Leider ist das kein schneller Prozess.Wenn du ihn durchlaufen willst, klicke dich in der Google-Hilfe für rechtliche Anliegen durch die Optionen, die dein Problem beschreiben. Wenn du zum Schritt “Anfrage erstellen” kommst, ist es wichtig, dass du so viele Details wie möglich angibst, um sicherzustellen, dass jede Takedown-Anfrage erfolgreich ist.Weitere Informationen zum DMCA-Takedown-Verfahren findest du in diesem Leitfaden von The Copyright Alliance.WICHTIGEin DMCA-Entfernungsantrag sollte dein letztes Mittel sein, um deine urheberrechtlich geschützten Inhalte online zu schützen. Du solltest nur davon Gebrauch machen, wenn eine Website ganz offensichtlich dein Urheberrecht verletzt (ohne Namensnennung) und nicht auf die Aufforderung reagiert, den Inhalt zu entfernen (oder zu nennen).3) Achte auf eine korrekte interne VerlinkungsstrukturWenn der gescrapte Inhalt mit dem Original identisch ist, verweist er mit seinen ursprünglichen internen Links auf deine Website zurück. Diese Links bringen dir keinen Link-Equity, aber sie sind ein guter Hinweis darauf, dass es sich um gescrapte Inhalte handelt.Wenn sie jedoch alle Links gelöscht haben, sollte es für die Suchmaschinen immer noch einfach sein, das Original zu finden, da sie in der Regel viel bessere interne und externe Linkprofile hat. Eine gute interne Verlinkungsstruktur ist eine der wichtigsten On-Page-SEO-Methoden.4. Falsche URL-ParameterURL-Parameter sind Werte, die im URL-String einer Seite gesetzt werden. In dem folgenden Beispiel ist der Parameter “Größe” “klein”:http://www.example.com/?size=smallDiese Parameter werden häufig in E‑Commerce-Systemen (und anderen) verwendet, um Seiten zu filtern und zu sortieren.Wie falsche URL-Parameter deiner Website schaden könnenURL-Parameter können alle möglichen Probleme bei der Indexierung verursachen, wenn deine Website nicht richtig konfiguriert ist.Eine Seite kann mehrfach indexiert werden, wobei sich der Inhalt nur geringfügig ändert.Zwielichtige SEOs können dies zu ihrem Vorteil nutzen.Wie? Indem sie mit gefälschten Parametern auf Seiten auf deiner Website verlinken.Google kann diesen Links folgen und — wenn die Website nicht richtig eingerichtet ist — die Seiten indexieren.Wie man einen Angriff mit falschen Parametern erkenntAm einfachsten kannst du diese Art von Angriff erkennen, indem du den Coverage Report in der Google Search Console überprüfst.Wenn du einen signifikanten Anstieg der indexierten Seiten feststellst, könnte dies auf einen Angriff hindeuten.Wie du dich gegen Angriffe mit falschen Parametern wehrstAm besten wehrst du dich gegen solche Angriffe, indem du von vornherein vorbeugende Maßnahmen ergreifst.Zum Glück ist das leicht zu machen.Ich habe einen gefälschten Parameter in die URL unseres SEO-Tipps-Beitrags eingefügt.Die Seite wird unter dieser URL geladen.Aber…Wir haben den selbstreferenzierenden canonical-Tag eingebaut, der Google wissen lässt, was die De-facto-Version dieser Seite ist.<link rel=\"canonical\" href=\"https://ahrefs.com/blog/de/seo-tipps/\" />Damit wird Google mitgeteilt, dass es nur die Stamm-URL indexieren und alle weiteren Parameter ignorieren soll.In den meisten Fällen sollte die Verwendung dieser selbstreferenzierenden Canonicals ausreichen, um diese Art von SEO-Angriffen zu verhindern.5. Gefälschte Rezensionen/BewertungenDu siehst dir wahrscheinlich die Online-Bewertungen an, bevor du ein Restaurant besuchen oder etwas online kaufen möchtest. Die Rich Snippets von Google können Bewertungen und Rezensionsdaten direkt in der SERP anzeigen, um Aufmerksamkeit zu erregen und einen Eindruck zu hinterlassen — positiv oder negativ.Wie gefälschte Bewertungen deiner Website schaden könnenStell dir vor, die Nutzer sehen schlechte Bewertungen für dein Unternehmen in den SERP. Du willst nicht, dass diese Art von Einfluss auf ihren Kaufprozess genommen wird.Wenn du in der SaaS- oder einer anderen B2B-Branche tätig bist, haben die bekanntesten Bewertungsplattformen wie G2 oder Capterra glücklicherweise Prozesse für die Authentizität von Bewertungen eingerichtet. Die Bewertung wird erst dann veröffentlicht, wenn sie genehmigt wurde. Es wäre also schwierig, solche Plattformen für einen negativen SEO-Angriff zu nutzen.Wenn du ein lokales Unternehmen hast, z. B. ein Restaurant, recherchieren die Leute bei Google My Business, Yelp, TripAdvisor und anderen lokalen Bewertungsdiensten über dich. Es ist viel einfacher, diese zu manipulieren, aber es ist in ihrem Interesse, die Bewertungen so objektiv und neutral wie möglich zu halten.Die Bewertungsplattformen sind jedoch nicht die einzigen Optionen. Google kann auch Ergebnisse für redaktionelle Bewertungen anzeigen.Jeder kann eine schlechte Bewertung deines Produkts oder deiner Dienstleistung veröffentlichen und sie kann in den SERP gut ranken. Wenn das Schema-Markup richtig eingerichtet ist, kann sie auch als Rich Result angezeigt werden.So erkennst du gefälschte BewertungenBehalte im Auge, welche Bewertungen in den SERPs für deine Marke erscheinen. Ein Monitoring wäre hier übertrieben; führe die Suche einfach einmal im Monat durch und überzeuge dich selbst. Wenn du sichergehen willst, dass du auch lokale SERPs abdeckst, suche von mehreren Standorten aus.Wie du dich gegen gefälschte Bewertungen wehrstWenn du mit gefälschten Bewertungen auf Bewertungsplattformen zu tun hast, melde sie. Erwarte nicht, dass die Plattformen sie sofort löschen. Das kann ein ziemlich langsamer Prozess sein. Wenn das Problem dringend ist, ist es am besten, wenn du versuchst, mit jemandem von der Bewertungsplattform in Kontakt zu treten. Nebenbei bemerkt. Vergewissere dich immer, dass die Bewertungen auch tatsächlich gefälscht sind. Versuche nicht, echte negative Bewertungen zu melden und zu löschen. Kümmere dich um sie, entschuldige dich und biete eine Entschädigung an. Führe Prozesse zur Beantwortung von Bewertungen ein. Du kannst dich auch wehren, indem du mehr deiner Kunden dazu ermutigst, Bewertungen zu schreiben. Auch hier gilt: Bleib authentisch. Es ist in Ordnung, wenn du deine Kunden dazu aufforderst, deinen Service zu bewerten, aber nicht, wenn du sie im Gegenzug für eine positive Bewertung bestechen willst.Testimonials und Bewertungen sind mächtige Waffen. Je mehr du davon hast, desto schwieriger ist es, von gefälschten Bewertungen beeinflusst zu werden. Sei reaktionsschnell, betone die unbestreitbar echten Bewertungen, und du wirst gut dastehen.6. Hacking deiner WebsiteHacking und Cyber-Attacken sind Formen von negativer SEO, die die Grenze zur Kriminalität überschreiten.Wie Hacking deiner Website schaden kannGoogle will seine Nutzer schützen und nimmt jede Website, die Schadsoftware enthält (oder auf Websites verlinkt, die dies tun), mit Argwohn zur Kenntnis.Wenn sie nicht direkt aus den SERPs entfernt werden, fügt Google den Ergebnissen für diese Website den Hinweis “Diese Website könnte gehackt worden sein” hinzu, wie du hier sehen kannst: Ich bin sicher, du würdest so ein Ergebnis nicht anklicken. Wenn deine Website also als gehackt markiert wird, musst du damit rechnen, dass dein Ranking sinkt.Wie du einen Website-Hackerangriff erkennstVon allen negativen SEO-Angriffen auf unserer Liste ist dieser oft am einfachsten zu erkennen.Hacking richtet in der Regel großen Schaden auf deiner Website an. Du kannst es nicht übersehen.Aber wenn du das Gefühl hast, dass du es doch bemerkt hast, dann klicke auf den Reiter “Sicherheitsprobleme” in der Google Search Console. Was man hier sehen möchte, ist ein Bildschirm wie dieser:Und nicht dieser:Wie du dich gegen Website-Hackerangriffe wehren kannstPrävention ist der Schlüssel. Die Stärke deiner Website hängt von deinen Server-Einstellungen und deiner Sicherheit ab.Wenn du das Pech hast, bereits gehackt worden zu sein, dann hast du wahrscheinlich eine große Aufgabe vor dir.Vorbeugung ist hier also das beste Mittel.Ich werde hier nicht versuchen, alles zu erklären, was du tun solltest, um deine Website gegen Hackerangriffe zu schützen. Das ist ein Thema für sich.Aber ich werde dir ein paar Tipps geben, die dir den Start erleichtern: Installiere ein Sicherheits-Plugin. Schau dir diese Plugin-Auswahl für WordPress an. Verwende sichere, starke Passwörter. Tut mir leid, aber “password1” reicht für deinen WordPress-Login nicht aus. Ein starkes Passwort hilft, Brute-Force-Angriffe zu verhindern. Halte dein CMS (und deine Plugins) auf dem neuesten Stand. Am besten ist es, wenn du automatische Updates aktivierst.Das ist ein sehr grundlegender Überblick, wohlgemerkt. Hier sind einige der besten Anleitungen zur Website-Sicherheit im Internet:Weitere InformationenWie man eine gehackte Website repariert — Google Webmasters10 Tipps zur Verbesserung der Sicherheit deiner WebsiteWie man eine gehackte WordPress-Website wiederherstelltKinsta-Fallstudie über manuelle Maßnahmen mit mehreren Ursachenpro tipWenn du das nötige Budget hast, empfehle ich dir, deine Website mit Diensten wie Sucuri abzusichern.Installiere die Software auf deiner Website und Sucuri überwacht sie aktiv auf Hacks, Änderungen, Brute-Force-Anmeldeversuche und mehr.Du erhältst eine Warnung, wenn etwas ungewöhnlich aussieht. Noch besser: Wenn du gehackt wirst, bereinigt Sucuri deine Website im Rahmen des Services.7. DDoS-AngriffeDDoS-Angriffe zielen jedoch nicht darauf ab, deine Website zu stören, sondern sie komplett lahmzulegen. DDoS steht für Distributed Denial-of-Service und ist ein böswilliger Versuch, legitime Anfragen und Datenverkehr von deiner Website fernzuhalten, indem dein Server oder die umliegende Infrastruktur überflutet wird, bis die Ressourcen erschöpft sind.Wie DDoS-Angriffe deiner Website schaden könnenGenerell gilt, dass dein Server und damit auch deine Website nicht funktionieren, wenn du nicht über Dienste verfügst, die DDoS-Angriffe verhindern und abschwächen können.Wenn deine Website oder ein paar Seiten aufgrund von Serverwartungen nicht verfügbar sind, ist das kein Problem. Google betrachtet den Fehler 503 Service Unavailable als eine vorübergehende Sache. Wenn dies jedoch über einen längeren Zeitraum andauert, kann es zur Deindexierung führen.Eine heimtückischere Form eines DDoS-Angriffs könnte ein Angriff sein, der deine Website nicht komplett lahmlegt, sondern sie stattdessen verlangsamt. Das würde nicht nur das Nutzererlebnis verschlechtern, sondern könnte sich auch auf dein Ranking auswirken, da die Seitengeschwindigkeit und die damit verbundenen Core Web Vitals Rankingfaktoren sind.So erkennst du einen DDoS-AngriffStelle sicher, dass du oder dein Technikteam den eingehenden Datenverkehr und die Anfragen überwacht. Das hilft, die heimlichen DDoS-Angriffe zu erkennen, aber die großen Angriffe können deine Website innerhalb weniger Sekunden lahmlegen.Der größte aufgezeichnete Angriff erreichte 2,54 Tbps. Das ist eine Bandbreite, die mit der einiger Video- und Streaming-Plattformen vergleichbar ist.Wie du dich gegen DDoS-Angriffe wehren kannstIn den allermeisten Fällen können du oder dein Team sich nicht direkt dagegen wehren.Am besten ist es, wenn du CDNs, dedizierte Server und andere Dienste mit großen Netzwerkinfrastrukturen nutzt, die oft über eigene DDoS-Schutzlösungen verfügen. Diese Dienste bieten in der Regel auch Load Balancing und Origin Shielding, um deinen Webhosting-Server bestmöglich vor Traffic- und Anfrage-Spitzen zu schützen.FazitIn diesem Beitrag habe ich die häufigsten Arten von negativen SEO-Angriffen aufgelistet. Diese Liste ist nicht vollständig, aber sie sollte die meisten negativen SEO-Fälle widerspiegeln, denen du begegnen kannst.Wie bereits mehrfach in diesem Beitrag erwähnt, ist es heutzutage sehr unwahrscheinlich, dass negative SEO funktioniert. Trotzdem ist es gut, wachsam zu sein. Also behalte deine Website, ihren Traffic und ihre Backlinks genau im Auge.Wenn du Erfahrungen mit negativer SEO, Fragen oder Kommentare hast, schreib mir auf Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Michal Pecánek Vermarkter und Content-Autor bei Ahrefs. Süchtig nach SEO, Luftfahrt, Parfums, Sushi und Tacos.",
  "headers": [
    {
      "level": "H1",
      "text": "Wie du negative SEO-Angriffe erkennst (und abwehrst)"
    },
    {
      "level": "H2",
      "text": "Was ist negative SEO?"
    },
    {
      "level": "H2",
      "text": "Arten von negativen SEO-Angriffen"
    },
    {
      "level": "H2",
      "text": "Funktioniert negative SEO?"
    },
    {
      "level": "H3",
      "text": "1. Google wertet jetzt Link-Spam ab, anstatt Websites zu degradieren"
    },
    {
      "level": "H3",
      "text": "2. Pinguin 4.0 ist “präziser”"
    },
    {
      "level": "H3",
      "text": "3. Das Geschäftsmodell von Google beruht darauf, dass negative SEO nicht funktioniert"
    },
    {
      "level": "H3",
      "text": "4. Link-Spam ist nicht die einzige Art von negativer SEO"
    },
    {
      "level": "H2",
      "text": "Wie du die häufigsten Arten von negativen SEO-Angriffen erkennst, vermeidest und behebst"
    },
    {
      "level": "H3",
      "text": "1. Spammiger Linkaufbau"
    },
    {
      "level": "H4",
      "text": "Wie Spam-Links deiner Website schaden können"
    },
    {
      "level": "H4",
      "text": "Wie man einen Spam-Link-Angriff erkennt"
    },
    {
      "level": "H5",
      "text": "Methode 1: Finde Spam-Links in Echtzeit"
    },
    {
      "level": "H5",
      "text": "Methode 2: Überprüfe die Diagramme der verweisenden Domains und Seiten"
    },
    {
      "level": "H5",
      "text": "Methode 3: Überprüfe den Anchor-Bericht"
    },
    {
      "level": "H5",
      "text": "Methode 4: Überprüfe den Bericht über die verweisenden IPs"
    },
    {
      "level": "H4",
      "text": "So wehrst du dich gegen Link-Spam-Angriffe"
    },
    {
      "level": "H3",
      "text": "2. Gefälschte Anfragen zur Linkentfernung"
    },
    {
      "level": "H4",
      "text": "Wie gefälschte Linkanfragen deiner Seite schaden können"
    },
    {
      "level": "H4",
      "text": "Wie du eine Linkentfernungs-Attacke erkennst"
    },
    {
      "level": "H4",
      "text": "Wie du dich gegen gefälschte Linkentfernungs-Anfragen wehrst"
    },
    {
      "level": "H3",
      "text": "3. Content-Scraping"
    },
    {
      "level": "H4",
      "text": "Wie Content-Scraping-Angriffe deiner Website schaden können"
    },
    {
      "level": "H4",
      "text": "Wie du einen Content-Scraping-Angriffe erkennst"
    },
    {
      "level": "H4",
      "text": "Wie du dich gegen Content-Scraping wehrst"
    },
    {
      "level": "H5",
      "text": "1) Bitte um einen Attributionslink"
    },
    {
      "level": "H5",
      "text": "2) Reiche eine DMCA-Beschwerde ein"
    },
    {
      "level": "H5",
      "text": "3) Achte auf eine korrekte interne Verlinkungsstruktur"
    },
    {
      "level": "H3",
      "text": "4. Falsche URL-Parameter"
    },
    {
      "level": "H4",
      "text": "Wie falsche URL-Parameter deiner Website schaden können"
    },
    {
      "level": "H4",
      "text": "Wie man einen Angriff mit falschen Parametern erkennt"
    },
    {
      "level": "H4",
      "text": "Wie du dich gegen Angriffe mit falschen Parametern wehrst"
    },
    {
      "level": "H3",
      "text": "5. Gefälschte Rezensionen/Bewertungen"
    },
    {
      "level": "H4",
      "text": "Wie gefälschte Bewertungen deiner Website schaden können"
    },
    {
      "level": "H4",
      "text": "So erkennst du gefälschte Bewertungen"
    },
    {
      "level": "H4",
      "text": "Wie du dich gegen gefälschte Bewertungen wehrst"
    },
    {
      "level": "H3",
      "text": "6. Hacking deiner Website"
    },
    {
      "level": "H4",
      "text": "Wie Hacking deiner Website schaden kann"
    },
    {
      "level": "H4",
      "text": "Wie du einen Website-Hackerangriff erkennst"
    },
    {
      "level": "H4",
      "text": ""
    },
    {
      "level": "H4",
      "text": "Wie du dich gegen Website-Hackerangriffe wehren kannst"
    },
    {
      "level": "H3",
      "text": "7. DDoS-Angriffe"
    },
    {
      "level": "H4",
      "text": "Wie DDoS-Angriffe deiner Website schaden können"
    },
    {
      "level": "H4",
      "text": "So erkennst du einen DDoS-Angriff"
    },
    {
      "level": "H4",
      "text": "Wie du dich gegen DDoS-Angriffe wehren kannst"
    },
    {
      "level": "H3",
      "text": "Fazit"
    }
  ],
  "author": "Michal Pecánek"
}