{
  "url": "https://ahrefs.com/blog/de/on-page-seo/",
  "slug": "on-page-seo",
  "title": "On-Page-SEO: Was es ist und wie man es macht (inkl. Checkliste) - SEO Blog by Ahrefs",
  "description": "On-Page-SEO ist alles, was auf der Seite selbst getan wird, um die Platzierung zu verbessern. Mit unserer praktischen Checkliste erfährst du, worauf du achten solltest.",
  "content": "Mateusz Makosiewicz Marketingforscher und Ausbilder bei Ahrefs. Mateusz hat über 10 Jahre Erfahrung im Marketing, die er in Agenturen, SaaS- und Hardware-Unternehmen gesammelt hat. Wenn er nicht schreibt, komponiert er Musik oder genießt lange Spaziergänge. In diesem Leitfaden erfährst du, wie du deine Inhalte optimieren kannst, damit sie bei Google besser ranken.Wir geben bewährte und leicht zu befolgende Ratschläge, worauf es bei On-Page-SEO wirklich ankommt.Du brauchst eine Checkliste? Die findest du hier auch.Contents SEO-Leitfaden 1Wie Suchmaschinen funktionieren 2SEO Grundlagen 3Keyword-Recherche 4SEO-Content (EN) 5On-Page-SEO 6Linkbuilding 7Technisches SEO Part 1On-Page-SEO-GrundlagenWas ist On-Page SEO?On-Page-SEO (oder On-Site-SEO) bezieht sich auf alles, was du auf der Seite selbst tun kannst, um ihre Platzierung zu verbessern. Dabei geht es darum, dass Google und Suchende deine Inhalte besser verstehen und verarbeiten können.Warum ist On-Page-SEO wichtig?Google schaut sich den Inhalt einer Seite an, um zu sehen, ob sie ein relevantes Suchergebnis ist.[1] Und wenn Google deinen Inhalt für weniger relevant hält als den deiner Konkurrenten, werden sie dich im Ranking übertreffen.Part 2Wie man On-Page-SEO betreibtWenn du jemals gehört hast, dass es bei On-Page-SEO darum geht, Keywords auf einer Seite zu wiederholen, ist das weit von der Wahrheit entfernt. Wenn du zu viel davon tust, schadet das deinem Ranking[2]. Gehen wir also einige sinnvolle Optimierungen durch, die sich positiv auswirken werden.Wir haben auch alle On-Page SEO-Elemente in einer Checkliste (Google Sheets) zusammengefasst. Hier erfährst du, wie du sie verwenden kannst:Klicke hier, um eine bearbeitbare Kopie der Checkliste in deinem Google Drive zu erstellenDupliziere das Hauptblatt für jede Seite, die du optimierstEine Vorschau auf die On-Page-SEO-Checkliste.Passe dich an die Suchabsicht anDie Suchabsicht ist der Grund für eine Suche. Wenn du sie verstehst, weißt du, wonach die Nutzerinnen und Nutzer suchen und was du in deinen Inhalten liefern musst.Um die Ergebnisse der Suchintentionsoptimierung zu veranschaulichen, ist hier der geschätzte organische Traffic auf einer unserer Seiten vor und nach der Suchintentionsausrichtung.Um die Suchabsicht zu erkennen, schau dir die Top-Ranking-Ergebnisse bei Google an und identifiziere die drei Cs der Suchabsicht:Content-Typ – Welche Art von Inhalt ist vorherrschend? Ist es ein Blogbeitrag, eine Produktseite, ein Video oder etwas anderes?Content-Format – Zu den gängigen Formaten gehören Anleitungen, Listen, Rezensionen, Vergleiche usw.Content-Blickwinkel – Das Alleinstellungsmerkmal der Top-Punkte, z. B. “am besten”, “am billigsten”, “für Anfänger” usw. Gibt Aufschluss darüber, worauf Suchende bei einer bestimmten Suche Wert legen.Die meisten Top-Ranking-Seiten für „Avocadosamen“ sind zum Beispiel Blogbeiträge, die als Anleitungen für die Aussaat dienen. Die Verwendung von „einfach“ und „simpel“ deutet darauf hin, dass es sich bei den Suchenden um Anfänger handelt, die nach unkomplizierten Ratschlägen suchen.Weitere InformationenWas ist Search Intent? Ein kompletter Leitfaden für EinsteigerBehandle dein Thema vollständigWenn dein Inhalt relevante Unterthemen abdeckt, ist es wahrscheinlicher, dass er die Erwartungen der Suchenden erfüllt. Außerdem kann er für relevantere Suchbegriffe ranken und dadurch mehr Besucher erhalten.Ein guter Ort, um nach Hinweisen zu suchen, sind die Seiten mit den besten Platzierungen. Du kannst manuell nach Gemeinsamkeiten zwischen ihnen suchen, z. B. nach Überschriften, FAQs, visuellen Hilfen, wie tief sie in das Thema einsteigen usw.Zum Beispiel erwähnen einige der Top-Seiten zum Thema „Geld sparen“ die Kündigung einiger Abonnements.Du kannst auch SEO-Tools wie Ahrefs verwenden, um dir die Schlüsselwörter zu zeigen, für die die Seiten mit den höchsten Rankings ranken. Einige dieser Schlüsselwörter können gute Unterthemen oder Punkte sein, die du in deinen Inhalt aufnehmen kannst.Hier ist, was du tun musst:Gib dein Hauptkeyword in Ahrefs’ Keywords ExplorerScrolle zur SERP-Übersicht und wähle ein paar Seiten mit den höchsten Rankings ausKlicke auf Öffnen in und wähle Inhalts LückeDu siehst eine Liste mit häufig vorkommenden Keywords; sie sind deine Anhaltspunkte dafür, wonach die Suchenden suchen.Hier ist ein Beispiel für die Suchanfrage „Content Marketing“. Hier suchen die Suchenden vielleicht nach einer Definition und nach Ratschlägen für die Erstellung einer Strategie oder eines Plans.Und wenn du eine bereits bestehende Seite optimierst, beziehe sie in die Analyse mit ein, um zu sehen, welche Unterthemen du vielleicht übersehen hast.Mach deinen Inhalt einzigartigWenn du ranken willst, solltest du nicht einfach andere Seiten wiederholen. Du musst etwas Neues in die SERPs (Suchmaschinenergebnisseiten) bringen.Das erhöht die Chance, dass du Links bekommst, was sich wiederum positiv auf dein Ranking auswirken kann.Du musst kreativ werden, denn die „Einzigartigkeit“ hängt davon ab, was bereits in den SERPs zu finden ist. Denke in etwa so:Originelle Recherche – Neue Erkenntnisse, Einsichten oder Entdeckungen. Zum Beispiel eine Branchenumfrage bei den Kunden eines Unternehmens.Einzigartige Ansicht oder Sichtweise auf ein Thema – Frische Perspektiven, Herausforderungen für konventionelles Denken, starke Meinungen. Zum Beispiel SEO-Tipps von einem langjährigen Branchenexperten.Ein schnellerer oder einfacherer Weg, ein bestimmtes Problem zu lösen oder etwas zu erreichen – Zum Beispiel Tipps, wie man vor 30 reich wird.Eine hilfreiche, kostenlose Ressource – Zum Beispiel eine Vorlage, ein Spickzettel, etc..Zum Beispiel bietet die Top-Ranking-Seite für „Wie man reich wird“ Expertenzitate zum Thema, was derzeit einzigartig in den SERP ist.Wenn du dich inspirieren lassen willst, was die Leute zu einem bestimmten Thema gerne verlinken, kannst du Ahrefs nutzen.Gib dein Keyword im Keywords Explorer ein, scrolle zur SERP-Übersicht und klicke auf die Backlink-Nummer einer Seite mit vielen verweisenden Domains.Schau dir als Nächstes die Backlink-Anker im Site Explorer an, um Muster zu erkennen. Dieser Beitrag hat zum Beispiel ziemlich viele Links bekommen, weil er die Vorteile des Kettlebell-Swing erwähnt.Erstelle eine visuelle Hierarchie durch die Verwendung von H1-H6-TagsHeader-Tags (H1, H2, etc.) helfen Google, den Inhalt deiner Seiten zu verstehen.[3]Außerdem helfen sie den Lesern, deinen Inhalt zu verstehen und verbessern die Lesbarkeit.Was den H1-Tag angeht, so ist es am besten, einen H1-Tag pro Seite zu verwenden und ihn mit dem Seitentitel abzustimmen.Quelle: Ahrefs’ SEO Toolbar.Um Seiten mit fehlenden oder leeren H1-Tags zu finden, crawlst du deine Website mit Ahrefs’ Site Audit und rufst den Content-Bericht auf. Mit einem Ahrefs Webmaster Tools (AWT)-Konto kannst du das kostenlos tun.Die Tags H2 bis H6 kannst du einfach für die Zwischenüberschriften deines Inhalts verwenden.Weitere InformationenWie man einen Blogbeitrag formatiert (für den Sucherfolg)Schreibe einen überzeugenden Titel-TagTitel-Tags sind oft die wichtigste Information, um zu entscheiden, auf welches Ergebnis du klickst.[4] Deshalb musst du sie überzeugend gestalten. Hier sind ein paar Tipps:Halte sie kurz – Weniger als 70 Zeichen sind am besten, um eine Beschneidung zu vermeiden.Entspricht der Suchabsicht – Sag den Suchenden, dass du hast, was sie suchen.Sei beschreibend – Sei nicht vage oder generisch.Vermeide Clickbait – Stelle sicher, dass sie mit deinem Inhalt übereinstimmen.Schließe das Keyword ein – Verwende eine ähnliche Variante, wenn es mehr Sinn macht.Füge das Jahr hinzu – Für Themen, die Aktualität erfordern.EmpfehlungDu kannst ChatGPT nutzen, um ein paar Ideen für den Titel zu sammeln und diese dann weiterzuverfolgen.Mit dem Site Audit von Ahrefs kannst du Seiten finden, die Probleme mit dem Title Tag haben, z. B. weil sie leer oder zu lang sind. Alles, was du brauchst, ist ein kostenloses AWT-Konto. Sobald du dich angemeldet und deine Website gecrawlt hast, kannst du im Inhaltsbericht nach Problemen suchen.Schreibe eine überzeugende Meta-BeschreibungMeta-Beschreibungen sind kein Google-Ranking-Faktor[5], können aber mehr Klicks und Traffic bringen. Das liegt daran, dass Google sie oft für das beschreibende Snippet in den Suchergebnissen verwendet. Hier sind ein paar Tipps, wie du sie schreibst:Halte sie kurz – Unter 160 Zeichen ist am besten, um ein Beschneiden zu vermeiden.Erweitere den Titel-Tag – Füge USPs ein, die du dort nicht unterbringen konntest.Entspreche der Suchabsicht – Konzentriere dich auf das, was die Suchenden wollen.Verwende eine aktive Sprache – Sprich den Suchenden direkt an.Füge dein Keyword hinzu – Google zeigt diese in den Ergebnissen oft fett an.EmpfehlungGenau wie beim Seitentitel kannst du ChatGPT verwenden, um Meta-Beschreibungen zu erstellen.Mit dem Site Audit von Ahrefs kannst du nach Seiten suchen, deren Meta-Beschreibung leer oder zu lang ist. Auch hierfür brauchst du ein kostenloses AWT-Konto. Wenn du dich angemeldet und deine Website gecrawlt hast, kannst du im Inhaltsbericht nach Problemen suchen.Wusstest du schonGoogle verwendet normalerweise keine Meta-Beschreibungen für das Such-Snippet. Unsere Studie ergab, dass sie nur in 37,22 % der Fälle verwendet werden.[6] In der restlichen Zeit werden andere Inhalte der jeweiligen Seite verwendet.[7]Lege benutzerfreundliche URLs festGoogle empfiehlt, in den URLs der Seiten Wörter zu verwenden, die für deinen Inhalt relevant sind.[8]Oft ist es am einfachsten, wenn du dein Ziel-Keyword in den Slug-Teil der URL einfügst.Wenn die URL-Struktur jedoch bereits einige Wörter deines Zielkeywords enthält, kannst du den Slug kürzer machen.Unser Zielkeyword ist zum Beispiel „seo for realtors“ (dt. SEO für Makler). Da die Seite im Verzeichnis „seo/for“ untergebracht war, konnten wir einfach „realtors“ (dt. Makler) als Slug verwenden.Optimiere deine BilderDie Bilder deiner Seiten können in der Google-Bildersuche ranken und mehr Traffic in deine Richtung schicken.Bei der Bildoptimierung geht es im Wesentlichen um diese drei Aufgaben. Verwende beschreibende DateinamenGoogle sagt, dass Dateinamen ihm Hinweise auf das Thema des Bildes geben.[9] Hier sind ein paar Tipps zur Namensgebung:Sei beschreibendSei prägnantFülle nicht mit KeywordsVerwende Bindestriche zwischen WörternVerwende einen beschreibenden Alt-TextGoogle verwendet auch Alt-Text (alternativer Text), um das Thema eines Bildes zu verstehen.[10] Das ist ein HTML-Attribut, das bei ‑Tags verwendet wird, um das Bild zu beschreiben. Es ist auf der Seite selbst nicht sichtbar und sieht in etwa so aus:<img src=\"https://deinedomain.de/welpe.jpg\" alt=\"welpe\">Der Hauptzweck von Alt-Text ist die Verbesserung der Zugänglichkeit für Besucher, die Bildschirmlesegeräte verwenden. Sie wandeln Seiteninhalte, einschließlich Bilder, in Audio um.Hier sind unsere besten Tipps für die Erstellung von Alt-Text:Sei beschreibendSei präziseFülle nicht mit KeywordsSag nicht, dass es ein Bild istDu kannst den Bilderbericht in Ahrefs’ Site Audit verwenden, um deine Website auf Bilder mit fehlendem Alt-Text zu überprüfen..Komprimiere BilderDurch das Komprimieren von Bildern werden die Dateien kleiner, was zu schnelleren Ladezeiten führt. Es gibt viele Tools, die dies ermöglichen. ShortPixel ist eine gute Option.Füge interne Links hinzuInterne Links sind Links von anderen Seiten auf deiner Website. Sie helfen Google zu verstehen, worum es auf einer Seite geht und erhöhen ihre Autorität. Das kann zu höheren Rankings führen.Hier erfährst du, wie du in AWT kostenlos interne Verlinkungsmöglichkeiten findest:Gehe zu Site AuditÖffne das Tool Internal Link Opportunities (dt. Interne Linkmöglichkeiten)Füge den Slug der Seite, die du optimieren willst, in das Suchfeld einWähle „Target page“ (dt. Zielseite) aus dem Dropdown-MenüHier ist zum Beispiel eine interne Verlinkungsmöglichkeit für diesen Leitfaden:Source page (dt. Quellseite) ist der Ort, an dem du den internen Link einfügen musst.Keyword context (dt. Keyword-Kontext) ist die Stelle, an der der Link auf der Seite eingefügt werden soll (mit dem fettgedruckten Keyword).Target page (dt. Zielseite) ist die Seite, die wir optimieren.Da es nur eine Sekunde dauert, interne Links hinzuzufügen, ist dies eine einfache und schnelle On-Page-Optimierung.EmpfehlungZwänge nicht zu viele interne Links in einen Absatz. Das schadet der Benutzerfreundlichkeit. Füge sie nur dort ein, wo sie für die Besucher nützlich sind..Weitere InformationenInterne Links für SEO: Ein praktischer LeitfadenVerwende externe LinksLaut Google ist die Verlinkung mit anderen Websites eine gute Möglichkeit, deinen Nutzern einen Mehrwert zu bieten.[11] Hab also keine Angst davor, es zu tun, wo es Sinn macht. Achte nur darauf, dass du nicht auf minderwertige, spammige Websites verlinkst.Das solltest du bei der Verlinkung zu externen Websites beachten:Zitiere und verlinke ihre QuellenVerlinke auf Ressourcen, die für die Leser nützlich sein könntenKennzeichne alle gesponserten oder bezahlten Links mit nofollow oder sponsoredWeise Erfahrungen oder Fachwissen zu dem Thema nachGoogle schätzt Inhalte von Experten oder Menschen mit Lebenserfahrung aus erster Hand. Welches der beiden für Google wichtiger ist, hängt vom jeweiligen Thema ab.Die vertrauenswürdigste Quelle für Informationen über die gesundheitlichen Vorteile von Matcha-Tee ist zum Beispiel jemand mit einer formalen Ausbildung in Ernährung und/oder Medizin.Dagegen braucht man für einen Testbericht über Handyhalterungen fürs Auto wahrscheinlich keinen Experten. Es reicht aus, wenn die Rezensenten genug Erfahrung mit den Produkten haben und das auch zeigen.Hier sind ein paar Möglichkeiten, wie du laut Google dein Fachwissen unter Beweis stellen kannst.[12] Du solltest:zeigen, dass du das Thema gut kennst. Zeig, wie du ein Problem lösen oder etwas mit deinem Fachwissen erreichen kannst..klare Informationsquellen angeben (und auf sie verlinken).Expertenzitate einfügen, um den Inhalt vertrauenswürdiger zu machen.Hintergrundinformationen über den Autor bereitstellen, z. B. einen Link zu einer „Autor“-Seite. Scheue dich nicht, deine Referenzen zu zeigen.sicherstellen, dass der Inhalt frei von leicht überprüfbaren sachlichen Fehlern ist.Und wenn es um Themen geht, für die du vielleicht Erfahrungen aus erster Hand oder aus dem Leben brauchst, sagt Google Folgendes.[13] Du solltest:erklären, wie du den Inhalt erstellt hast. Gib zum Beispiel einen Einblick in den Prozess der Überprüfung von Produkten.Beweisen, dass du bei der Erstellung der Inhalte mitgewirkt hast (z. B. Bilder oder Videos).Hintergrundinformationen über den/die Autor(en) liefern – ebenso über das Fachwissen.Part 3Fortgeschrittene On-Page SEO-TippsNachdem wir nun die Grundlagen behandelt haben, gehen wir bei der On-Page-SEO noch einen Schritt weiter.Optimiere für Featured SnippetsEin Featured Snippet beantwortet die Frage des Suchenden mit einer kurzen Antwort.[14] Du kannst verschiedene Arten von Snippets finden: Absätze, Listen, Videos usw.Google zieht sie aus den Suchergebnissen im Internet, und sie stammen fast alle von einer der Seiten, die in den Top 10 ranken.[15] Das bedeutet, dass du deinen Weg zur Spitzenposition abkürzen kannst, indem du das Snippet gewinnst.Die besten Möglichkeiten für ein Featured Snippet bieten sich bei Keywords, bei denen du bereits unter den ersten fünf Plätzen platziert bist und Google bereits ein Featured Snippet anzeigt.Du kannst diese Möglichkeiten mit dem Site Explorer von Ahrefs finden:Gib deine Domain einGehe zum Bericht Organische KeywordsVerwende Filter: Ranking auf den Positionen 1–5, Featured Snippets „wo das Ziel nicht rankt“””Suche nach Keywords, bei denen auf deiner Seite die Antwort fehlt, und füge sie dann hinzuDann musst du die Antwort auf deiner Seite einfügen. Und es kommt darauf an, wie du diese Antwort strukturierst, deshalb hier ein paar Tipps. Das solltest du:Biete präzise Erklärungen in einfacher Sprache.Richte dich immer nach der Suchabsicht; verstehe, nach welcher Art von Antwort der Suchende sucht.Idealerweise orientierst du dich an der Formatierung, die im aktuellen Featured Snippet verwendet wird. Wenn du zum Beispiel eine Liste im Snippet siehst, hast du wahrscheinlich auch bessere Chancen mit einer Liste.Weitere InformationenGoogles Featured Snippets: Alles, was du wissen musst, um sie zu bekommenErhalte Rich Snippets mit Schema MarkupRich Snippets sind Suchergebnisse, die in Webseiten eingebettete strukturierte Daten hervorheben. Ihr Zweck ist es, Suchenden auf einen Blick zusammenfassende Informationen über ein Ergebnis zu geben.[16]Strukturierte Daten sind kein Ranking-Faktor,[17] aber sie helfen Google, die Inhalte deiner Seiten besser zu verstehen.Rich Snippets machen deine Website außerdem in den Suchergebnissen auffälliger, was zu mehr Klicks führen kann.Um für die Anzeige von Rich Snippets in Frage zu kommen (Google zeigt sie nicht immer an), musst du einen einfachen Code namens Schema Markup anwenden. Dazu musst du in der Google-Dokumentation nach geeigneten Eigenschaften suchen und den Code mit einem Tool wie Schema.dev erstellen.Weitere InformationenWas ist Schema Markup? Wie man es für SEO nutztOptimiere das SeitenerlebnisUm deine Seiten zu bewerten, berücksichtigt Google auch eine Reihe von „Seitenerfahrungssignalen“. Dazu gehören unter anderem:Core Web Vitals (CWV) (mit anderen Worten, ob die Seite schnell genug und stabil ist).Sicherheit (ob die Seite über HTTPS verbunden ist).Mobilfreundlichkeit (Google verwendet die mobile Version deiner Seiten für die Indexierung und das Ranking).Vermeidung von aufdringlichen Zwischeneinblendungen und Dialogen.Die Signale für die Seitenerfahrung werden in der Regel für die gesamte Website und nicht für jede einzelne Seite verbessert. Du musst aber auch sicherstellen, dass neue Seitendesigns ebenfalls optimiert werden.Sicherheitsprobleme und Werbeeinblendungen sind am einfachsten zu beheben: Besorge dir ein SSL/TSL-Zertifikat und schalte Pop-ups aus, die die Nutzer/innen irritieren könnten. CWV und Mobilfreundlichkeit werden wahrscheinlich mehr Zeit in Anspruch nehmen.Du kannst den untenstehenden Links folgen, um dich durch den Prozess zu lotsen.Weitere InformationenFirst Input Delay (FID) – Definiert, gemessen und behobenLargest Contentful Paint (LCP) – Definiert, gemessen und wie man es korrigiertCumulative Layout Shift (CLS) – Definition, Messung und BehebungMobile SEO: 10 Tipps zur Optimierung einer mobilfreundlichen WebsiteÜberwache und aktualisiere den InhaltOn-Page-SEO ist etwas, das du immer wieder machen kannst. Wenn du mit deinen Google-Rankings nicht zufrieden bist, kannst du deine Inhalte jederzeit verbessern und neu veröffentlichen.Beginne mit der Überwachung der Positionen deiner Keywords. Gib deine Ziel-Keywords in ein Rank-Tracking-Tool wie den Rank Tracker von Ahrefs ein und beobachte die Rankings der nächsten drei Monate.Wenn eine Seite überhaupt nicht rankt oder du keinen Aufwärtstrend siehst (wie im Beispiel unten), ist die Wahrscheinlichkeit groß, dass eine Verbesserung des Inhalts hilft. Das Gleiche gilt für Seiten, die von den Spitzenpositionen gefallen sind.Diese Seite ist in den letzten drei Monaten immer wieder aus den Top 100 herausgefallen — ein Zeichen dafür, dass sie neu veröffentlicht werden sollte.Bei Ahrefs haben wir wiederholt gute Ergebnisse bei der Aktualisierung und sogar beim kompletten Umschreiben von Inhalten beobachtet. Unten siehst du ein Beispiel — der organische Traffic vervielfachte sich nach einer einfachen Aktualisierung.Weitere InformationenInhalte neu publizieren: Wie du alte Blogbeiträge für SEO aktualisierstContent Refreshing: Eine Schritt-für-Schritt-Strategie (basierend auf der Aktualisierung von 50+ Posts)Wichtigste ErkenntnisseOn-Page-SEO ist alles, was du auf der Seite selbst tun kannst, um ihre Rankings und Sichtbarkeit zu verbessern.Es geht nicht darum, Keywords zu wiederholen. Das kann deinen Rankings schaden.Es geht darum, Google und Suchenden zu helfen, deine Inhalte besser zu verstehen und zu verdauen.Wenn deine Seite nicht so rangiert, wie sie sollte, kannst du sie immer noch verbessern. Die Wiederveröffentlichung von Inhalten bringt oft gute Ergebnisse.FAQHäufig gestellte Fragen zur On-Page-SEO.Was ist der Unterschied zwischen On-Page-SEO und Off-Page-SEO?Sie zielen auf zwei verschiedene Kategorien von Faktoren ab. On-Page-SEO konzentriert sich auf die Beeinflussung von SEO-Faktoren auf einer Seite, während Off-Page-SEO sich auf Faktoren außerhalb einer Seite konzentriert. Mit anderen Worten: Bei der On-Page-SEO geht es um die Dinge, die du vollständig kontrollieren kannst, während du die Off-Page-SEO nicht vollständig kontrollieren kannst.Was ist der Unterschied zwischen On-Page-SEO und technischer SEO?Technische SEO befasst sich mit dem Backend der Website, damit Google und andere Suchmaschinen deine Seite finden, crawlen, verstehen und indexieren können. Die On-Page-SEO befasst sich mit dem Inhalt der Website, um dessen Relevanz und Qualität sicherzustellen.Braucht jede Seite SEO?Nein, nur die, von denen du willst, dass sie für Suchende sichtbar sind. Konzentriere deine SEO-Bemühungen also auf diejenigen, die für dein Unternehmen den größten Wert haben.Sind lange Seiten schlecht für SEO?Google hat keine Präferenz für die Seitenlänge. Biete immer eine angemessene Menge an Inhalten, die der Suchabsicht entsprechen und die Bedürfnisse der Suchenden erfüllen.Was ist Keyword-Stuffing?Das ist die übermäßige Verwendung eines Ziel-Keywords im Seiteninhalt mit dem Ziel, für dieses Keyword zu ranken. Google betrachtet dies als Spam-Technik und es kann zu einer manuellen Abstrafung führen.Referenzen“Ranking Results – How Google Search Works”. Google. Abgerufen 14. Juli 2023“Irrelevant Keywords and Keyword Stuffing”. Google. Abgerufen 17. August 2022John Mueller. “English Google Webmaster Central office-hours” Google Search Central YouTube Channel. 27. Dezember 2019“Control your title links in search results”. Google. Abgerufen 17. August 2022“Google does not use the keywords meta tag in web ranking”. Google. Abgerufen 17. August 2022“How Often Does Google Rewrite Meta Descriptions? (New Data Study)” Ahrefs. Abgerufen 19. Juni 2023“Control your snippets in search results”. Google. Abgerufen 17. August 2022“SEO Starter Guide”. Google. Abgerufen 12. Juli 2023“Google Images SEO Best Practices”. Google. Abgerufen 17. August 2022“Google Images SEO Best Practices”. Google. Abgerufen 17. August 2022John Mueller. “Linking Out: Good for SEO?”. Google Search Central YouTube Channel. 26. Juli 2019.“Creating Helpful, Reliable, People-First Content”. Google. Abgerufen 21. Juli 2023“Creating Helpful, Reliable, People-First Content”. Google. Abgerufen 21. Juli 2023“How Google’s featured snippets work”. Google. Abgerufen 14. Juli 2023“Ahrefs’ Study Of 2 Million Featured Snippets: 10 Important Takeaways”. Ahrefs. 30. Mai 2017. Abgerufen 14. Juli 2023 StudieKavi Goel, Ramanathan V. Guha, Othar Hansson. “Introducing Rich Snippets”. Google Search Central Blog. 12. Mai 2009. Abgerufen 17. August 2022John Mueller. “There’s no generic ranking boost for SD usage”. Twitter. 2. April 2018 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Mateusz Makosiewicz Mitwirkende Marketingforscher und Ausbilder bei Ahrefs. Mateusz hat über 10 Jahre Erfahrung im Marketing, die er in Agenturen, SaaS- und Hardware-Unternehmen gesammelt hat. Wenn er nicht schreibt, komponiert er Musik oder genießt lange Spaziergänge. Mitwirkende",
  "headers": [
    {
      "level": "H1",
      "text": "On-Page-SEO: Was es ist und wie man es macht (inkl. Checkliste)"
    },
    {
      "level": "H2",
      "text": "On-Page-SEO-Grundlagen"
    },
    {
      "level": "H3",
      "text": "Was ist On-Page SEO?"
    },
    {
      "level": "H3",
      "text": "Warum ist On-Page-SEO wichtig?"
    },
    {
      "level": "H2",
      "text": "Wie man On-Page-SEO betreibt"
    },
    {
      "level": "H3",
      "text": "Passe dich an die Suchabsicht an"
    },
    {
      "level": "H3",
      "text": "Behandle dein Thema vollständig"
    },
    {
      "level": "H3",
      "text": "Mach deinen Inhalt einzigartig"
    },
    {
      "level": "H3",
      "text": "Erstelle eine visuelle Hierarchie durch die Verwendung von H1-H6-Tags"
    },
    {
      "level": "H3",
      "text": "Schreibe einen überzeugenden Titel-Tag"
    },
    {
      "level": "H3",
      "text": "Schreibe eine überzeugende Meta-Beschreibung"
    },
    {
      "level": "H3",
      "text": "Lege benutzerfreundliche URLs fest"
    },
    {
      "level": "H3",
      "text": "Optimiere deine Bilder"
    },
    {
      "level": "H4",
      "text": "Verwende beschreibende Dateinamen"
    },
    {
      "level": "H4",
      "text": "Verwende einen beschreibenden Alt-Text"
    },
    {
      "level": "H4",
      "text": "Komprimiere Bilder"
    },
    {
      "level": "H3",
      "text": "Füge interne Links hinzu"
    },
    {
      "level": "H3",
      "text": "Verwende externe Links"
    },
    {
      "level": "H3",
      "text": "Weise Erfahrungen oder Fachwissen zu dem Thema nach"
    },
    {
      "level": "H2",
      "text": "Fortgeschrittene On-Page SEO-Tipps"
    },
    {
      "level": "H3",
      "text": "Optimiere für Featured Snippets"
    },
    {
      "level": "H3",
      "text": "Erhalte Rich Snippets mit Schema Markup"
    },
    {
      "level": "H3",
      "text": "Optimiere das Seitenerlebnis"
    },
    {
      "level": "H3",
      "text": "Überwache und aktualisiere den Inhalt"
    },
    {
      "level": "H2",
      "text": "Wichtigste Erkenntnisse"
    },
    {
      "level": "H2",
      "text": "FAQ"
    },
    {
      "level": "H3",
      "text": "Was ist der Unterschied zwischen On-Page-SEO und Off-Page-SEO?"
    },
    {
      "level": "H3",
      "text": "Was ist der Unterschied zwischen On-Page-SEO und technischer SEO?"
    },
    {
      "level": "H3",
      "text": "Braucht jede Seite SEO?"
    },
    {
      "level": "H3",
      "text": "Sind lange Seiten schlecht für SEO?"
    },
    {
      "level": "H3",
      "text": "Was ist Keyword-Stuffing?"
    },
    {
      "level": "H2",
      "text": "Referenzen"
    }
  ],
  "author": "Mateusz Makosiewicz  Joshua Hardwick Mateusz Makosiewicz Mateusz Makosiewicz"
}