{
  "url": "https://ahrefs.com/blog/de/organische-suche/",
  "slug": "organische-suche",
  "title": "Was ist die organische Suche? Alles was du wissen musst",
  "description": "Die organische Suche bezieht sich auf die nicht bezahlten Suchergebnisse einer Suchmaschine. Diese Ergebnisse können von Werbetreibenden weder gekauft noch beeinflusst werden.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (oder, in einfachen Worten, ich bin der Typ, der dafür sorgt, dass jeder Blog-Post EPISCH wird). Inhalt Organische Suche bezieht sich auf die nicht bezahlten Suchergebnisse einer Suchmaschine. Diese Ergebnisse können nicht von Werbetreibenden gekauft oder beeinflusst werden; sie sind diejenigen, die die Suchmaschine als am relevantesten für die Suchanfrage des Nutzers erachtet.In diesem Leitfaden gehen wir auf Folgendes ein:Arten von organischen SuchergebnissenWarum die organische Suche wichtig istWie man organische Suchrankings überprüft und überwachtWie man in den organischen Suchergebnissen höher ranktWie erhalte ich mehr Klicks in der organischen Suche?Welche Arten von organischen Suchergebnissen gibt es?Bei Google sehen die meisten organischen Suchergebnisse wie folgt aus:Diese sind als “Blue Link”-Ergebnisse bekannt. Vor einigen Jahren sahen alle organischen Suchergebnisse von Google so aus. Jetzt gibt es mehr Variationen und du wirst ziemlich häufig verschiedene “Arten” von Ergebnissen sehen.Lass uns einen Blick auf ein paar von ihnen werfen.Featured SnippetsFeatured Snippets sind kurze Ausschnitte, die die Frage des Suchenden knapp beantworten. Sie erscheinen an oder nahe der Spitze der organischen Suchergebnisse von Google und das Snippet wird aus einem der Top-Ranking-Ergebnisse gezogen.Du kannst dir alle Featured Snippets, die deine Website besitzt, kostenlos in den Ahrefs Webmaster Tools (AWT) anzeigen lassen.So geht’s:Registriere dich für einen kostenlosen Ahrefs Webmaster Tools (AWT)-AccountGib deine Website in den Site Explorer einÖffne den Organic Keywords 2.0-BerichtKlicke auf den “SERP features”-FilterFiltere nach Featured Snippets “wo das Ziel rankt”Video-CarouselsVideo-Carousels zeigen Videos, die mit der Suchanfrage zusammenhängen. Das gesamte Karussell nimmt eine organische Position ein.SchlagzeilenDie Schlagzeilen-Felder zeigen kürzlich veröffentlichte Inhalte zu einem Thema. Diese erscheinen in der Regel in den organischen Ergebnissen für aktuelle Themen.Ähnliche FragenDie Felder “Ähnliche Fragen” zeigen häufige Fragen, nach denen Menschen auch suchen. Jede Frage wird mit einem kurzen Auszug aus einer relevanten Seite im Web beantwortet.Empfohlene Lektüre: Was sind SERPs? Suchmaschinen-Ergebnisseiten erklärtWarum ist die organische Suche wichtig?In der organischen Suche für relevante Keywords zu ranken, bringt “kostenlosen” Traffic auf deine Website.Der Ahrefs-Blog zum Beispiel erhält jeden Monat geschätzte 355.000 Zugriffe über die organische Suche:Wenn wir Google für diesen Traffic bezahlen müssten, würde uns das geschätzte $946.000 pro Monat kosten:Da du Content kreieren und erstellen musst, um in den organischen Suchergebnissen zu ranken, sind die Kosten für den Traffic aus der organischen Suche natürlich nicht gleich Null. Dennoch ist es, wie auch bei uns, oft der kostengünstigste Weg, um qualitativ hochwertigen, zielgerichteten Traffic auf eine Website zu bringen.Die organische Suche ist auch wichtig für alle, die Videos auf YouTube veröffentlichen, da Google YouTube-Videos oft in seinen Video-Carousels und Featured Snippets rankt.Ein Video, das im Featured Snippet rankt, auch bekannt als vorgeschlagener Clip.Mit anderen Worten, deine Videos bei Google zu ranken, kann dir oft eine Menge Aufrufe bescheren.Zum Beispiel erhält dieses Video, das zeigt, wie man einen Apfelkuchen macht, laut dem Content Explorer von Ahrefs geschätzte 6.600 monatliche Besuche über Google:Wie man organische Suchrankings überprüft und überwachtWenn du neugierig bist, wo deine Website in der organischen Suche für ein bestimmtes Keyword rankt, probiere den kostenlosen Rank Checker von Ahrefs aus.Wenn du alternativ alle Keywords sehen willst, für die du in den Top 100 der organischen Suchergebnisse rankst, versuche Folgendes:Registriere dich für einen kostenlosen Ahrefs Webmaster Tools (AWT)-AccountGib deine Website in den Site Explorer einÖffne den Organic Keywords-BerichtHier siehst du alle Keywords aus unserer Datenbank mit über 450 Millionen Keywords einschließlich der Rankingpositionen und anderer Keyword-Metriken.Nebenbei bemerkt. Du kannst die Keyword-Rankings auch in der Google Search Console sehen. Im Gegensatz zu AWT ist man hier jedoch auf 1.000 Keywords beschränkt und es werden durchschnittliche Rankingpositionen angezeigt. Wenn du deine Rankings für ein bestimmtes Keyword im Laufe der Zeit überwachen möchtest, füge es einfach zu einem Rank-Tracking-Tool wie dem Ahrefs Rank Tracker hinzu.Wie man in den organischen Suchergebnissen höher ranktEin höheres Ranking in der organischen Suche führt normalerweise zu mehr organischem Traffic auf deiner Webseite.Niemand weiß genau, wie Google Webseiten rankt, aber wir kennen einige der wichtigeren Faktoren, die eine Rolle spielen.Hier sind nur fünf von ihnen:BacklinksRelevanzHTTPsMobile FreundlichkeitAktualitätBacklinksBacklinks sind ein wichtiger bekannter Rankingfaktor.Googles Search Quality Senior Strategist, Andrey Lipattsev, bestätigte dies während eines Webinars im Jahr 2016, und wir fanden in unserer unabhängigen Studie von über einer Milliarde Webseiten eine klare Korrelation zwischen Backlinks und organischem Traffic: Es gibt viele Methoden für den Linkaufbau, die du nutzen kannst, um mehr Backlinks zu erhalten, aber der beste Ausgangspunkt ist wohl herauszufinden, wer auf konkurrierende Top-Ranking-Seiten verlinkt und warum.Sagen wir zum Beispiel, dass du für “Tipps zum Lebenslauf” ranken möchtest.Wenn du eine der Top-Ranking-Seiten für dieses Keyword in den Site Explorer von Ahrefs eingibst und dir den Backlinks-Bericht ansiehst, wirst du ziemlich viele Backlinks von Seiten sehen, die Karrieretipps anbieten.In Anbetracht dieser Tatsache könnte es Sinn machen, deinen Link an die Verfasser der Beiträge zu diesem Thema zu pitchen.Empfohlene lektüre: Linkaufbau für SEO: Ein AnfängerleitfadenRelevanzGoogle hat viele Möglichkeiten, die Relevanz einer Seite zu bestimmen, wobei das grundlegendste Signal ist, ob deine Seite “die gleichen Keywords wie deine Suchanfrage” enthält.Allerdings wird dir das Einbinden von Keywords nicht dabei helfen, in der organischen Suche besser zu ranken, es sei denn, deine Seite entspricht der Suchintention, d.h. dem Grund für die Suchanfrage.Zum Beispiel geht aus den Suchergebnissen für “Tipps für den Lebenslauf” hervor, dass die Leute nach einem Blogbeitrag im Listenformat suchen.Wenn du eine Seite veröffentlichen würdest, auf der du ein Buch mit Tipps für den Lebenslauf verkaufst, würde sie in der organischen Suche für dieses Keyword mit ziemlicher Sicherheit nicht ranken, weil sie nicht mit der Suchintention übereinstimmt. Suchende möchten etwas lernen, nicht kaufen.Das Gegenteil gilt für das Keyword “Lebenslauf erstellen”, wo die Suchenden nach einem Tool suchen, nicht nach einem Blogbeitrag.Empfohlene Lektüre: Was ist die Suchintention? Ein vollständiger Leitfaden für AnfängerHTTPsHTTPs verschlüsselt alle Daten, die zwischen dem Benutzer und deinem Server gesendet werden, um die Sicherheit zu erhöhen. Hierbei handelt es sich seit 2014 um einen kleinen Google-Rankingfaktor.Woher weißt du, ob deine Website HTTPs verwendet?Schau dir einfach die Browserleiste an. Wenn dort ein Schloss-Symbol zu sehen ist, ist die Verbindung sicher:Wenn das nicht der Fall ist, lohnt es sich, das zu beheben.Empfohlene Lektüre: Was ist HTTPS? Alles was du wissen musstMobile FreundlichkeitMobile Freundlichkeit wurde im Jahr 2015 zu einem Rankingfaktor für mobile Ergebnisse. Jetzt, wo Googles Umstellung auf die Mobile-First-Indexierung fast abgeschlossen ist, ist sie auch ein Rankingfaktor für die meisten Websites auf dem Desktop.Wenn du wissen willst, wie mobilfreundlich deine Seite ist, schau dir den Bericht “Nutzerfreundlichkeit von mobilen Seiten” in der Google Search Console an:Empfohlene Lektüre: Mobile-First-Indexierung: Was du wissen musstAktualitätAktualität ist ein bedeutender Rankingfaktor, weil es sich dabei um ein Signal handelt, das von der Suchanfrage abhängt. Das bedeutet, dass es für manche Keywords wichtiger ist als für andere — und das hängt mit der Suchintention zusammen.Sieh dir ein Keyword wie “bestes Smartphone” an. Alle Ergebnisse wurden vor kurzem veröffentlicht.Das liegt daran, dass Aktualität bei diesem Suchbegriff wichtig ist. Es kommen ständig neue Smartphones auf den Markt, daher ist es unwahrscheinlich, dass Suchende im Jahr 2021 einen Testbericht über das iPhone 10 sehen wollen.Sieh dir nun die Ergebnisse für eine Suchanfrage wie “wie schneide ich eine Jeans zu” an:Obwohl einige erst kürzlich veröffentlicht wurden, wurden einige der top organischen Suchergebnisse im Jahr 2014 veröffentlicht. Das liegt daran, dass die Aktualität der Ergebnisse nicht wirklich eine Rolle spielt. Der Prozess zum Zuschneiden von Jeans ist heute weitgehend derselbe wie vor zehn Jahren.Empfohlene Lektüre: 10 Google Rankingfaktoren, die du nicht ignorieren solltestWie erhalte ich mehr Klicks in der organischen Suche?Ein gutes Ranking bei Google ist der wichtigste Faktor für den Suchtraffic, aber du kannst auch mehr Klicks erhalten, indem du überzeugende Title-Tags, Meta-Beschreibungen und URLs erstellst.Dies sind die drei Elemente, die in den Suchergebnissen von Google auftauchen:Nebenbei bemerkt. Google zeigt nicht immer die Meta-Beschreibung einer Seite an, sondern verwendet oft andere Inhalte der Seite für das beschreibende Snippet in der SERP. Schauen wir uns ein paar Best Practices für jedes einzelne an.Best Practices für den Title-Tag Beschränke dich auf 50–60 Zeichen. Lange Title-Tags werden in den SERPs abgeschnitten. Schreibe in Sentence Case oder Title Case. Niemals in Großbuchstaben. Baue dein Keyword ein. Aber nur, wenn es Sinn macht. Stimme mit der Suchintention überein. Wähle eine inhaltliche Ausrichtung, die mit dem übereinstimmt, wonach die Suchenden suchen. Baue den USP deines Inhalts ein. Erkläre den Suchenden, warum dein Inhalt einzigartig ist (z.B. “Wie man einen Apfelkuchen macht” → “Wie man einen Apfelkuchen in 20 Minuten macht”). Vermeide clickbait. Sei ehrlich und übertreibe es nicht.Empfohlene Lektüre: Wie du den perfekten Title-Tag für die SEO erstellstBest Practices für die Meta-Beschreibung Erweitere den Titel. Füge Details ein, für die du im Titel keinen Platz hattest. Stimme mit der Suchintention überein. Stimme sie mit dem überein, was Suchende wollen. Setze auf eine aktive Sprache. Sprich den Suchenden direkt an. Beschränke dich auf 120 Zeichen. Meta-Beschreibungen werden auch gekürzt. Baue dein Keyword ein. Aber auch hier gilt: nur wenn und wo es Sinn macht.Empfohlene Lektüre: Wie man die perfekte Meta-Beschreibung verfasstBest Practices für die URL Sei beschreibend. Gib einen Einblick, worum es auf der Seite geht. Mach sie “evergreen”. Entferne unnötige Daten und Zahlen. Vermeide die Wiederholung von Keywords. Das sieht nach Spam aus.Empfohlene Lektüre: Wie man SEO-freundliche URLs erstelltFAQsWenn du noch Fragen zur organischen Suche hast, findest du hier hoffentlich die Antwort.Was ist die organische Suche in Google Analytics?Bei der organischen Suche handelt es sich um eine der Traffic-Quellen in Google Analytics. Sie stellt die Besucher dar, die durch einen Klick von einem der organischen Suchergebnisse von Google auf deine Website gelangt sind. Du kannst eine Aufschlüsselung all deiner Traffic-Quellen sehen, indem du zu Akquisition > Sämtlicher Traffic > Kanäle navigierst.Was ist eine gute CTR für die organische Suche?Es gibt keine eindeutige Antwort auf diese Frage, da viele Faktoren die CTR beeinflussen. Zum Beispiel wirst du typischerweise eine viel höhere CTR für markenbezogene Suchanfragen sehen (d.h. wenn jemand nach deiner Marke sucht) als für nicht markenbezogene Suchanfragen. Du siehst auch tendenziell niedrigere CTRs für Keywords mit SERP-Funktionen in den Ergebnissen. Unser Ratschlag ist, sich nicht zu viele Gedanken darüber zu machen, es sei denn, deine Seite erzielt viel Traffic.Wie erhältst du zusätzliche Links in den organischen Suchergebnissen?Diese werden Sitelinks genannt. Wir haben einen vollständigen Leitfaden, der erklärt, wie du diese beeinflussen kannst.FazitWenn du Monat für Monat mehr Traffic auf deiner Webseite haben möchtest, lohnt es sich zu verstehen, wie du die organischen Suchergebnisse von Google beeinflussen und höher ranken kannst. Hier sind ein paar Quellen, die dir dabei helfen:Wie man bei Google höher ranktDer Anfänger-Leitfaden für SEOWie man es auf die erste Seite von Google schafftHast du Fragen? Schreib mir auf Twitter. Article PerformanceData from AhrefsVerlinkung von Websites 4 Sign up for AhrefsGet SEO metrics of any website or URL.The number of websites linking to this post.This post's estimated monthly organic search traffic.Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Joshua Hardwick Head of Content @ Ahrefs (oder, in einfachen Worten, ich bin der Typ, der dafür sorgt, dass jeder Blog-Post EPISCH wird).",
  "headers": [
    {
      "level": "H1",
      "text": "Was ist die organische Suche? Alles was du wissen musst"
    },
    {
      "level": "H2",
      "text": "Welche Arten von organischen Suchergebnissen gibt es?"
    },
    {
      "level": "H3",
      "text": "Featured Snippets"
    },
    {
      "level": "H3",
      "text": "Video-Carousels"
    },
    {
      "level": "H3",
      "text": "Schlagzeilen"
    },
    {
      "level": "H3",
      "text": "Ähnliche Fragen"
    },
    {
      "level": "H3",
      "text": "Warum ist die organische Suche wichtig?"
    },
    {
      "level": "H2",
      "text": "Wie man organische Suchrankings überprüft und überwacht"
    },
    {
      "level": "H2",
      "text": "Wie man in den organischen Suchergebnissen höher rankt"
    },
    {
      "level": "H3",
      "text": "Backlinks"
    },
    {
      "level": "H3",
      "text": "Relevanz"
    },
    {
      "level": "H3",
      "text": "HTTPs"
    },
    {
      "level": "H3",
      "text": "Mobile Freundlichkeit"
    },
    {
      "level": "H3",
      "text": "Aktualität"
    },
    {
      "level": "H2",
      "text": "Wie erhalte ich mehr Klicks in der organischen Suche?"
    },
    {
      "level": "H3",
      "text": "Best Practices für den Title-Tag"
    },
    {
      "level": "H3",
      "text": "Best Practices für die Meta-Beschreibung"
    },
    {
      "level": "H3",
      "text": "Best Practices für die URL"
    },
    {
      "level": "H2",
      "text": "FAQs"
    },
    {
      "level": "H3",
      "text": "Was ist die organische Suche in Google Analytics?"
    },
    {
      "level": "H3",
      "text": "Was ist eine gute CTR für die organische Suche?"
    },
    {
      "level": "H3",
      "text": "Wie erhältst du zusätzliche Links in den organischen Suchergebnissen?"
    },
    {
      "level": "H2",
      "text": "Fazit"
    }
  ],
  "author": "Joshua Hardwick"
}