{
  "url": "https://ahrefs.com/blog/de/pr-methoden-beispiele/",
  "slug": "pr-methoden-beispiele",
  "title": "9 großartige Public-Relations-Methoden mit Beispiel-Kampagnen",
  "description": "Public Relations (PR) beschreibt die Praxis, die Wahrnehmung einer Marke durch das Management der Kommunikation mit den Medien und der breiten Öffentlichkeit positiv zu beeinflussen.",
  "content": "Michal Pecánek Vermarkter und Content-Autor bei Ahrefs. Süchtig nach SEO, Luftfahrt, Parfums, Sushi und Tacos. Article PerformanceData from AhrefsVerlinkung von Websites 5 Sign up for AhrefsGet SEO metrics of any website or URL.The number of websites linking to this post.This post's estimated monthly organic search traffic. Inhalt Public Relations (PR) ist die Praxis, die Wahrnehmung einer Marke durch das Management der Kommunikation mit den Medien und der Öffentlichkeit positiv zu beeinflussen..Eine gute PR kann deine Markenbekanntheit steigern, Glaubwürdigkeit aufbauen, wertvolle Backlinks generieren, den Empfehlungs-Traffic ankurbeln, dein Zielpublikum einbinden und letztendlich zu mehr Umsatz führen.In diesem Artikel lernst du die folgenden 9 PR-Taktiken kennen, die alle Beispiele für PR-Kampagnen beinhalten:Beobachte und reagiere auf MedienanfragenNewsjackingNutze, was in der Welt gerade angesagt ist Pitche verlinkbare Assets an Journalisten und BloggerSetze auf MarkenbotschafterKooperiere mit anderen MarkenPR-Stunts und Guerilla-MarketingBewirb deine Werte, indem du für etwas eintrittstVerwandle negative Publicity in gute PR1. Beobachte und reagiere auf MedienanfragenJeder Autor braucht hin und wieder Expertenbeiträge für seine Texte. Dieser Experte kannst du in deinem Fachgebiet sein, und zwar ganz einfach.Alles, was du tun musst, ist, einen Feed mit Medienanfragen über Dienste wie HARO, Sourcebottle, ResponseSource oder JournoRequests zu abonnieren.So sieht der E‑Mail-Feed mit Anfragen von Journalisten und Bloggern bei HARO aus:Dein Ziel ist es, so schnell wie möglich wertvolle Informationen zu liefern, wenn du eine gute Gelegenheit dafür siehst.Das ist eine großartige Linkaufbau- und PR-Technik, besonders für Projekte in der Anfangsphase. Das liegt daran, dass deine Referenzen und der Wert der Informationen, die du zur Verfügung stellst, zählen, und nicht deine eigentliche Webseite oder deren Inhalt.Während du ein kostenpflichtiges Abonnement abschließen kannst, um auf Funktionen wie frühere Anfragen oder eingebaute Keyword-Filter zuzugreifen, habe ich mit den kostenlosen Versionen ausreichend Erfolg gehabt. Hier sind ein paar Tipps basierend auf meiner Erfahrung:a) Verwende Keywords, um durch die Feeds zu filternAllein HARO verschickt dreimal am Tag mehrere E‑Mails. Das Überfliegen all dieser E‑Mails stellt eine enorme Ablenkung im Arbeitsalltag dar.Um dies zu lösen, erstelle E‑Mail-Filter und Bedingungen. Diese beschränken die Echtzeit-Benachrichtigungen darauf, wenn der Feed Keywords enthält, die für dein Unternehmen relevant sind.Hier erfährst du, wie du einen Filter in Gmail erstellst:Klicke auf das Caret auf der rechten Seite der SuchleisteFüge [email protected] (oder einen anderen Feed) in das “von”-Feld einFüge deine Keywords (unter Verwendung des ODER-Trennzeichens) in das “Enthält die Wörter”-Feld ein. Verwende Anführungszeichen, um mehrere Wörter als ein Keyword zu betrachten.Einrichten eines HARO Filters in Gmail.b) Überprüfe die Autorität und die Vorgeschichte der PublikationDu wirst die Spreu vom Weizen trennen müssen. Da die schnelle Beschaffung von Informationen von Experten ein einfacher Weg ist, um Content zu erstellen, nutzen viele Unternehmen dies aus. Du solltest nur auf Anfragen antworten, die von “autoritären” Quellen kommen oder zumindest von solchen, die nicht übermäßig auf HARO angewiesen sind.Die zweite Sache ist leicht zu erkennen. Öffne einfach ein paar Artikel der Quelle und schaue, ob sie oft Verweise auf viele andere Personen und Unternehmen enthalten. Anhand des Feeds wirst du sehr schnell erkennen, welche Veröffentlichungen in deiner Nische du meiden solltest.Der beste Indikator für die Autorität ist, ob du die Publikation bereits kennst. Wenn sie neu für dich ist, prüfe, ob ihr Inhalt qualitativ hochwertig ist.Schließlich möchtest du, dass dein Beitrag eine solide Sichtbarkeit erlangt. Während du überprüfen kannst, wie es um die Social-Media-Posts der Publikation steht, ist einer der besten Indikatoren für die Qualität der Quelle, wie viel organischen Traffic die Website jeden Monat verzeichnet.Um dies zu überprüfen, gehe zum Ahrefs Site Explorer, gib die Website ein und prüfe ihre Übersichtsmetriken: Achte darauf, die Schätzungen des organischen Traffics und ihr Domain Rating (DR) zu überprüfen. DR ist ein Indikator für Autorität, denn es zeigt die Popularität einer Website in Bezug auf Backlinks von anderen Websites an.Der Screenshot oben zeigt die Daten für eine der Websites aus unserem HARO-Feed. In diesem Fall würde ich mir nicht die Mühe machen, darauf zu antworten, da du nicht erwarten kannst, dass viele Leute diesen Artikel lesen. Außerdem wäre der potenzielle Backlink nicht sehr wertvoll.c) Wähle Anfragen, zu denen du wirklich gute Informationen liefern kannstSelbst die einfachsten Beiträge erfordern mindestens 15 Minuten, um sie zu verfassen. Stelle sicher, dass du deine Chancen, ausgewählt zu werden, maximierst, indem du sachlich wertvolle und möglichst einzigartige Informationen lieferst.d) Antworte so schnell wie möglichViele Leute beobachten die gleiche Nische wie du. Oft gibt es enge Deadlines, um dich zu ermutigen, so schnell wie möglich zu antworten, aber verlasse dich nicht allein auf die Deadlines.Manche Autoren haben mir erzählt, dass sie schon vor der eigentlichen Deadline für weitere Beiträge gesperrt sind. Je früher du reagierst, desto höher ist die Chance, ausgewählt zu werden.e) Hol dir Hilfe von KollegenHier ist das Ergebnis einer erfolgreichen HARO-Einreichung für CDN77 (ein Unternehmen, für das ich früher gearbeitet habe):Du wirst sicherlich bemerken, dass mein Kollege in dem Beitrag zitiert wird und nicht ich. Das liegt daran, dass ich nicht qualifiziert war, die Frage nach den besten Tools für Systemadministratoren zu beantworten. Daher habe ich meinen Kollegen gebeten, stattdessen zu antworten. Zögere nicht, dasselbe zu tun.f) Halte dich an die VorgabenJournalisten geben fast immer das Format und die Bedingungen des Beitrags in der Anfrage bekannt:Weiche nicht davon ab. Außerdem solltest du versuchen, dem Autor alles zur Verfügung zu stellen, was er braucht, um deinen Beitrag zu veröffentlichen. Das bedeutet, dass du eine sehr kurze Biografie, Links zu deiner Website, eine Referenz für deine Glaubwürdigkeit bezüglich des Themas etc. einfügen solltest.Empfohlener Artikel: Wie du mit HARO Backlinks aufbaust und Presse bekommst2. NewsjackingNewsjacking ist eine “Evergreen-”PR-Methode. Es geht darum, Live-Nachrichten zu verfolgen und Gelegenheiten zu erkennen, deine Marke in den Mittelpunkt von Gesprächen zu stellen, indem du mit Experten-Kommentaren und Thought-Leadership-Beiträgen reagierst.Das bedeutet, dass du schnell, reaktiv und nutzbringend sein musst. Wenn du darin überragend bist, lohnt es sich enorm.Genauso hat mir Will Hobson, PR Direktor bei Rise at Seven, Newsjacking erklärt.Ihre Newsjacking-Kampagne für Ask Traders generierte über 250 Links, steigerte in sechs Monaten den organischen Traffic um 329% und die Conversions um 53% und erzielte eine durchgängige Berichterstattung in Artikeln von großen Medien, darunter auch diese:Hier sind ein paar der besten verweisenden Domains, die sie erzielt haben:Daten aus dem Ahrefs Site Explorer Backlinks-Bericht.Ich habe Will gebeten, seine Erfahrungen mit Newsjacking zu teilen und ein paar Tipps zu verraten, wie du es machen kannst. Das hat er gesagt:Newsjacking kann in verschiedenen Branchen eingesetzt werden, darunter Finanzen, Reisen, Kosmetik, Sportwetten, Automobil und für Verbrauchermarken. Besonders erfolgreich ist es in der Finanzbranche, wo interne Experten zur Verfügung stehen, um ihre Erkenntnisse, Meinungen und Weisheiten zu einer Reihe von Themen wie private Finanzen, Aktien, Geschäftsentwicklung, Wirtschaftsnachrichten und mehr preiszugeben.Es ist eine perfekte Methode, um Expertise, Autorität und Vertrauen in den Augen von Google und der allgemeinen Öffentlichkeit aufzubauen. Glaubwürdige Sprecher können mit nützlichen Einblicken und Expertentipps Links und Markenerwähnungen in schlagzeilenträchtigen Nachrichten erzielen.Dies kann ziemlich schnell zu einem Anstieg der organischen Rankings und natürlich auch zu mehr Umsatz führen.Es gibt zwei wesentliche Arten von Newsjacking, die wir bei Rise at Seven für unsere Kunden einsetzen, vor allem für jene in der Finanzbranche: Geplante Unternehmensberichterstattung - Kommentieren der wichtigsten Finanzergebnisse von großen Unternehmen. Du kannst diese Termine oft in den jeweiligen Zeitplänen der Unternehmen und auf ihrer Investor-Relations-Seite finden. Hier ist ein Beispiel für den Finanzkalender von Tesco. Reaktiv - Kommentieren von Eilmeldungen in vielen Branchen wie Einzelhandel, Fluggesellschaften und Banken. Das kann alles sein, von einer großen Handelskette, die Insolvenz anmeldet, bis hin zu einem Streik in der Branche, wie in der Vergangenheit, als die Piloten bei nationalen Fluggesellschaften streikten.Beobachte die Medien, um Newsjacking zu betreibenNewsjacking erfordert eine schnelle Reaktion. Am besten ist es, die Nachrichten über den Großteil des Tages zu verfolgen. Finde eine Möglichkeit, die Nachrichten zu konsumieren und mache das zu einem Teil deiner Routine; es spielt keine Rolle, ob es über einen Nachrichtensender, Radio oder soziale Medien ist.Ein guter Ansatz ist es, den ganzen Tag über Live-News-Blogs zu verfolgen. Die meisten Journalisten nutzen sie als Quelle für ihre Nachrichten. Beispiele in Großbritannien sind The BBC und The Guardian.Bereite deinen Kommentar vorSobald du deine Geschichte gefunden hast, musst du einen Kommentar vorbereiten. Dieser Kommentar kann maßgeschneidert oder vorgefertigt sein, je nach Geschichte. Doch was macht einen guten Kommentar aus?Mein wichtigster Rat für das Kommentieren von nationalen Finanznachrichten und allen anderen verbraucherrelevanten Themen ist, dass du eine Meinung abgeben solltest. Journalisten wollen einen Mehrwert zu ihrer Geschichte hinzufügen und nicht nur wiedergeben, was passiert ist. Achte darauf, dass dein Kommentar diese drei Dinge erfüllt: Was bedeutet das eigentlich? Was bedeutet dieses Ereignis, das du kommentierst, für die Verbraucher und das breite Publikum? Wie wird es sich auf den Durchschnittsbürger auswirken? Was ist deine Meinung? Was ist die Haltung deines Kommentars? Bist du mit dem, was passiert ist, einverstanden? Was wird als nächstes passieren? Was hält die Zukunft für diese Marke/dieses Unternehmen bereit? Wenn ein Unternehmen nach der Veröffentlichung seiner Unternehmensgewinne finanziell zu kämpfen hat, gib eine ehrliche Meinung dazu ab, ob es sich deiner Meinung nach erholen wird und was als nächstes passieren könnte.Kontaktiere JournalistenSobald du deinen Kommentar für die Veröffentlichung vorbereitet hast, stelle sicher, dass du eine Kontaktliste erstellt hast. Wenn die Geschichte geplant ist, strebe eine Liste von 50 Journalisten an, die in der Vergangenheit über die Geschichte geschrieben haben. Wenn dies eine rein reaktive Gelegenheit ist, stelle sicher, dass du jeden kontaktierst, der über das Thema spricht. Sobald du alles vorbereitet hast, bist du bereit für die effektive Kontaktaufnahme.3. Nutze, was in der Welt gerade angesagt istDas ist selbsterklärend. Nimm irgendetwas, das gerade im Trend ist, nutze deine kreativen Fähigkeiten, um die Botschaft deiner Marke damit zu verbinden, und du kannst eine große Reichweite erzielen. Das Ganze kann in jedem Format erfolgen.Erinnerst du dich an die Peloton-Fahrradwerbung, die viral ging und einen Hype auslöste? Ryan Reynolds nutzte das für seine Gin-Firma, indem er einen Folgespot mit der Peloton-Darstellerin kreierte:https://www.youtube.com/watch?v=H2t7lknrK28Aber du kannst auch mit einem einfachen Social-Media-Post viral gehen. Das hat McDonald’s mit dem mysteriösen Monolithen gemacht, der überall auf der Welt auftaucht:welcome to McDonald’s what can i get you? pic.twitter.com/iIgd8J5QIW— McDonald’s⁷ (@McDonalds) December 1, 2020 Willkommen bei McDonald’s, was kann ich dir bringen?Es gibt einige langfristige Trends wie die unglückliche COVID- und Home-Office-Situation. Das hat den Kreativstrategen Sam Hennig dazu veranlasst, das folgende Kampagnensujet für KitKat als Anspielung auf ihren “Have a break”-Slogan zu kreieren: Die Möglichkeiten sind nahezu endlos. Alles, was zählt, ist deine rechtzeitige Reaktion und Kreativität. Du kannst Tools wie Exploding Topics nutzen, um zu beobachten, welche Themen schnell an Popularität und Zugkraft gewinnen.4. Pitche verlinkbare Assets an Journalisten und BloggerDas Timing ist eine wichtige Variable, wenn es um die vorherigen Methoden geht. Allerdings kannst du die Medienberichterstattung auch jederzeit durch das Pitchen deiner Inhalte ankurbeln.Ein verlinkbares Asset ist eine Art von Inhalt, auf den Autoren gerne verweisen, so dass er ganz leicht Backlinks verdient. Das können Datenstudien, einzigartige Einblicke, Infografiken sein — alles, was andere als wertvoll für ihr Publikum empfinden.Datenstudien funktionieren am besten für uns in der Marketing- und SEO-Nische:Daten aus dem Ahrefs Site Explorer, die unsere am häufigsten verlinkten Seiten zeigen.Zum Beispiel hat unser bestes verlinkbares Asset Links von den folgenden Domains organisch verdient:Stell dir also die Reichweite vor, die du bekommen kannst, wenn du Outreach machst.Hier ist eine vereinfachte Vorgehensweise, wie du das machen kannst:a) Prüfe, welche Art von Content in deiner Nische Links anziehtGib deine Konkurrenten und andere Websites in deiner Nische in den Ahrefs Site Explorer ein und prüfe den Best-by-Links-Bericht wie oben gezeigt. Lass dich davon inspirieren. Wenn du mit etwas völlig Einzigartigem aufwarten kannst, von dem du glaubst, dass es für andere wertvoll ist, darauf zu verweisen, umso besser.b) Veröffentliche deine verlinkbaren AssetsStelle sicher, dass es das Beste ist, was du anbieten kannst. Die Person, die deine Outreach-Nachricht liest, sollte sofort nach dem Klick auf deinen Link sehen, was du anbietest.c) Kontaktiere die Leute, die auf diesen Inhalt verweisen könntenHier musst du drei Dinge tun:Finde Journalisten und Blogger, die über Themen berichten, die mit deinem verlinkbaren Asset zusammenhängenBesorge dir ihre KontaktinformationenKontaktiere sie mit einem überzeugenden PitchDas ist ein Thema für sich, daher verweise ich hier nur auf relevante Ressourcen, die dir helfen werden, diese Methode erfolgreich umzusetzen.Weitere InformationenIch habe gerade deine Outreach-E-Mail gelöscht, ohne sie zu lesen. Und NEIN, es tut mir nicht leid.Blogger-Outreach: Wie man es macht und skaliert, ohne sich wie ein Idiot zu fühlen7 effektive Wege, um jedermanns E‑Mail-Adresse zu findenWie du eine Linkaufbau-Kampagne schnell startest (und alles systematisierst)5. Setze auf MarkenbotschafterIch denke, für Influencer Marketing ist es am besten, Markenbotschafter zu haben.Ein Markenbotschafter ist jemand, der regelmäßig im Rampenlicht steht und ein Unternehmen repräsentiert. Das ist oft ein Mitarbeiter, der die Macht hat, die Community zu beeinflussen. Doch du kannst diese langfristigen Partnerschaften mit jedem eingehen. Ich bin mir sicher, dass du einigen Influencern folgst, die seit Jahren für bestimmte Produkte werben.Wir haben zum Beispiel Patrick. Er ist einer der bekanntesten technischen SEOs. Er spricht oft auf SEO-Events, organisiert sie und moderiert sogar einen beliebten Branchen-Subreddit namens TechSEO.In Bezug auf bezahlte Kampagnen kommen die besten Sponsorings und ehrlichen Empfehlungen für unser Produkt von unseren langjährigen Kunden:Quelle: Podcast-Werbung: 51.975$ ausgegeben. Was wir daraus gelernt haben.Der springende Punkt ist, dass du Influencer dazu bringen solltest, regelmäßig für deine Produkte zu werben, anstatt zu versuchen, meist ineffektive einmalige Kampagnen durchzuführen.Die besten Chancen hast du, wenn du dich an Personen wendest, die bereits deine Kunden sind. Sie bewerben es vielleicht bereits kostenlos, wenn sie das Produkt mögen. Die Voraussetzung ist, dass du ein hervorragendes Produkt hast.Hier ist ein Beispiel für die PR-Kampagne von Heinz Tomato Ketchup mit Ed Sheeran, der ein großer Fan von ihrem Ketchup ist:https://www.youtube.com/watch?v=keOaQm6RpBgEd hat mehrere Kampagnen mit ihnen gemacht und hat sogar ein Heinz Ketchup Tattoo auf seinem Körper. Einen besseren Influencer-Fan kannst du gar nicht haben.6. Kooperiere mit anderen Marken Einige Marken haben die gleichen Werte und Gemeinsamkeiten in ihren Zielgruppen. Sich zusammenzuschließen, um beide Kundengruppen anzusprechen, kann über Nischen hinweg für Win-Win-Kampagnen funktionieren.Die am meisten genutzte Partnerschaft ist die Produktion von Co-Branding-Produkten. Diese sind oft limitierte Auflagen mit einem Dringlichkeitsfaktor für die Nachfrage. Hier ist ein Beispiel für einen Game of Thrones Whisky mit Co-Branding:Du kannst auch Co-Branded-Werbeanzeigen erstellen, wie in diesem Beispiel von 2014 mit Uber und Spotify. Damals waren sie noch weit davon entfernt, die Giganten zu sein, die sie heute sind:https://www.youtube.com/watch?v=tBY5Lbcc5wEOder du kannst dich für die einfache Alternative entscheiden und einfach gemeinsam Content erstellen. Webinare, Podcasts und Artikel sind allesamt hervorragende Optionen.Hier ist ein Beispiel für ein Webinar, das von uns und Buffer gemeinsam veranstaltet wurde:https://www.youtube.com/watch?v=xn2XCFqREbU&t=261sBuffer ist ein Social-Media-Tool. Obwohl wir also ein gemeinsames Publikum haben, sind wir keine direkten Geschäftskonkurrenten. Und genau das ist der Trick: Gehe eine Partnerschaft mit einer nicht konkurrierenden Marke ein und erstelle dann Inhalte zu einem Thema, bei dem ihr beide ganz natürlich eure jeweiligen Produkte bewerben könnt.Doch wie findest du solche Marken?Im B2C-Bereich ist die Auswahl fast unbegrenzt. Du suchst nach Überschneidungen in dem, wofür die Unternehmen stehen (wenn überhaupt) und was deinen und ihren Kundenstamm anspricht. Der einfachste Weg, um Inspiration zu bekommen, ist, deine Kunden zu fragen.Der Faktor des komplementären Produkts kommt allerdings im B2B-Bereich ins Spiel. Wenn du frische Ideen für Unternehmen brauchst, mit denen du zusammenarbeiten kannst, verwende ein Audience-Research-Tool wie Sparktoro. Hier ist ein Auszug dessen, was ich in der kostenlosen Version erhalte, wenn ich ahrefs.com einsetze:Wir haben bereits mit Buffer kooperiert, aber HubSpot würde auch funktionieren. Da Sparktoro unser SEO-Toolset ergänzt, würde es ebenso der Beschreibung entsprechen.7. PR-Stunts und Guerilla-MarketingEin PR-Stunt ist alles Ungewöhnliche, was ein Unternehmen tut, um Medienrummel zu erzeugen. Es ist ein kreative Unterfangen, das sich manchmal den traditionellen Formen der Kommunikation widersetzt.Das lässt sich am besten anhand von ein paar Beispielen erklären.Wir haben es alle schon gesehen. Red Bull organisierte den höchsten Fallschirmsprung der Geschichte. Das passt nicht nur perfekt zur Marke, sondern ist auch buchstäblich ein Stunt. Und ganz nebenbei wurde es von GoPro co-gebrandet, aus offensichtlichen Gründen:https://www.youtube.com/watch?v=dYw4meRWGd4Aber du musst kein Event organisieren, das Millionen kostet. Es kann auch nur eine leicht ausgefallene Idee sein, die du in die Welt hinausschickst:Why should bread have all the fun, when there’s Weetabix? Serving up @HeinzUK Beanz on bix for breakfast with a twist. #ItHasToBeHeinz #HaveYouHadYourWeetabix pic.twitter.com/R0xq4Plbd0— Weetabix (@weetabix) February 9, 2021 Warum sollte Brot den ganzen Spaß haben, wenn es Weetabix gibt? Serviere @HeinzUK “Bohnen auf Brot” zum Frühstück mit einem besonderen Twist.Umstritten und riskant? Auf jeden Fall. Hat es funktioniert? Darauf kannst du wetten. Der Tweet ging viral und hat wohl zu einem 15%igen Verkaufsanstieg beigetragen.Doch du solltest das nicht wegen einer Umsatzsteigerung machen. Organische soziale Medien auf diese Weise zu nutzen, wäre größtenteils eine Zeitverschwendung. Der unbestreitbare Vorteil ist die Aufmerksamkeit in Form von Erwähnungen und Backlinks:142 Seiten griffen den viralen Tweet auf, darunter die größten Medienhäuser. Daten aus dem Ahrefs Content Explorer.Während dies großartige Beispiele für PR-Stunts sind, solltest du im Hinterkopf behalten, dass deine Bemühungen, auf diese Weise Earned Media zu bekommen, nicht immer in einem positiven Licht enden müssen. Einige PR-Stunts können ziemlich riskant für den Ruf deiner Marke sein. Die Leute interpretieren deine Ideen vielleicht nicht so, wie du es beabsichtigt hast.Dann haben wir noch Guerilla-Marketing-Kampagnen. Diese können sich mit PR-Stunts überschneiden, aber der Unterschied ist, dass Guerilla Marketing hauptsächlich im Freien stattfindet, kostengünstig ist und noch unkonventioneller und gewagter ist. Das Ziel ist es, die Leute zu überraschen, daher ist es normalerweise sehr einprägsam.Unsere Kaffeebecher auf der BrightonSEO, der größten SEO-Konferenz der Welt, waren ein subtiles Beispiel für Guerilla Marketing. Indem wir die Nährwertdaten durch Keyword-Daten ersetzt haben, haben wir Aufmerksamkeit erregt und für Gesprächsstoff gesorgt. The coffee cups are so cool 😎 @ahrefs @brightonseo #BrightonSEO #brightonseo2019 pic.twitter.com/Dcmr2nZyuF— Adam Najak ッ (@adamnajak) September 13, 2019 Die Kaffeetassen sind so coolDie Nutzung von öffentlichen Räumen ist jedoch wesentlich häufiger der Fall. Zum Beispiel kann man mit einem einfachen Zebrastreifen eine ganze Menge anstellen: Der Kreativität sind hier keine Grenzen gesetzt, wie du in dieser aktuellen Promo für ein neues Marmite-Produkt sehen kannst: 8. Bewirb deine Werte, indem du für etwas eintrittstLass mich mit einer kontra-intuitiven Denkübung beginnen. Denke über einige Marken nach, die du magst und deren Markenzweck, Mission Statement oder wofür sie stehen.Wenn du wie ich bist, wird es dir kaum gelingen. Die meisten Marken scheitern daran, einen vernünftigen Markenzweck zu kommunizieren. Ein Produkt zu verkaufen, das die Probleme der Menschen löst, reicht in der Regel aus — ein höheres Gut ist nicht nötig.Doch da die Konkurrenz gering ist, ist es deine Chance zu brillieren, wenn es ein höheres Gut gibt. Wenn du für etwas eintrittst, an das du wirklich glaubst, dann hast du die Chance auf großartige PR.Der Streit zwischen der Reddit-Community und der Investment-Welt der Unternehmen ist ein großartiges Beispiel aus den jüngsten Ereignissen und Kampagnen. Reddit hat es sogar in den Super Bowl geschafft, die teuerste Werbefläche der Welt:https://www.youtube.com/watch?v=_wkvH0qBMP8Wenn du die kurze Werbeanzeige anschaust, wird sie dich dazu bringen, sie anzuhalten oder später online zu suchen. So ein Format sieht man nicht jeden Tag. Es wurde als eine der effektivsten Werbeanzeigen an diesem Tag bewertet.Aus einer längerfristigen Kommunikationsperspektive betrachtet, gelingt es Patagonia immer wieder, deutlich zu machen, dass ihnen der Planet und das Thema Nachhaltigkeit am Herzen liegen. Dies war zum Beispiel ihre Black Friday Werbung:Auch vor der Politik schrecken sie nicht zurück. Sie gingen sogar so weit, die Trump-Regierung zu verklagen, um ihre Umweltanliegen damit zu unterstützen: Ich weiß nicht, wie sich dieser Aktivismus auf die Verkäufe ausgewirkt hat, aber eines ist klar: Patagonia ist konsequent und glaubwürdig in dem, wofür sie stehen. Das kann man von vielen anderen Unternehmen, die für ein “höheres Gut” werben, nicht behaupten. Erinnere dich nur an einige kontroverse Pepsi- oder Gillette-Werbungen.9. Verwandle negative Publicity in gute PREin unglückliches Ereignis, das dem Ruf deines Unternehmens schaden kann, in etwas Gutes zu verwandeln, ist zweifelsohne eine Herausforderung.Hier ist die berühmte Reaktion von KFC, als in Großbritannien das Hähnchen ausging:Du wirst offensichtlich nicht in der Lage sein, alles Schlechte umzudrehen. Die einfachste und oft auch beste Lösung ist es, die Verantwortung zu übernehmen und deine Fehler einzugestehen.In der Politik kann man oft schlechte PR-Aktionen, die “Schlechtes in Gutes verwandeln”, beobachten. Ich werde hier nicht näher darauf eingehen, da es oft die Verdrehung von Fakten und Manipulation beinhaltet. Es sollte aber selbstverständlich sein, dass deine Bemühungen aufrichtig sein sollten.FazitEine Sache ist es, PR zu verstehen, eine andere, sie erfolgreich auszuführen. Du kannst viele Marketing-Methoden einfach nachmachen, aber PR erfordert normalerweise viel mehr Kreativität.Lass dich auf jeden Fall inspirieren, indem du dir tolle PR-Kampagnen aus deiner Branche ansiehst. Allerdings musst du eine Menge eigener Kreativität aufbringen, damit die meisten PR-Methoden funktionieren. Also viel Glück dabei! Hast du irgendwelche Fragen? Schreib mir auf Twitter. Article PerformanceData from AhrefsVerlinkung von Websites 5 Sign up for AhrefsGet SEO metrics of any website or URL.The number of websites linking to this post.This post's estimated monthly organic search traffic.Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Michal Pecánek Vermarkter und Content-Autor bei Ahrefs. Süchtig nach SEO, Luftfahrt, Parfums, Sushi und Tacos.",
  "headers": [
    {
      "level": "H1",
      "text": "9 großartige Public-Relations-Methoden mit Beispiel-Kampagnen"
    },
    {
      "level": "H2",
      "text": "1. Beobachte und reagiere auf Medienanfragen"
    },
    {
      "level": "H3",
      "text": "a) Verwende Keywords, um durch die Feeds zu filtern"
    },
    {
      "level": "H3",
      "text": "b)  Überprüfe die Autorität und die Vorgeschichte der Publikation"
    },
    {
      "level": "H3",
      "text": "c) Wähle Anfragen, zu denen du wirklich gute Informationen liefern kannst"
    },
    {
      "level": "H3",
      "text": "d) Antworte so schnell wie möglich"
    },
    {
      "level": "H3",
      "text": "e) Hol dir Hilfe von Kollegen"
    },
    {
      "level": "H3",
      "text": "f) Halte dich an die Vorgaben"
    },
    {
      "level": "H2",
      "text": "2. Newsjacking"
    },
    {
      "level": "H3",
      "text": "Beobachte die Medien, um Newsjacking zu betreiben"
    },
    {
      "level": "H3",
      "text": "Bereite deinen Kommentar vor"
    },
    {
      "level": "H3",
      "text": "Kontaktiere Journalisten"
    },
    {
      "level": "H2",
      "text": "3. Nutze, was in der Welt gerade angesagt ist"
    },
    {
      "level": "H2",
      "text": "4. Pitche verlinkbare Assets an Journalisten und Blogger"
    },
    {
      "level": "H3",
      "text": "a)  Prüfe, welche Art von Content in deiner Nische Links anzieht"
    },
    {
      "level": "H3",
      "text": "b) Veröffentliche deine verlinkbaren Assets"
    },
    {
      "level": "H3",
      "text": "c) Kontaktiere die Leute, die auf diesen Inhalt verweisen könnten"
    },
    {
      "level": "H2",
      "text": "5. Setze auf Markenbotschafter"
    },
    {
      "level": "H2",
      "text": "6. Kooperiere mit anderen Marken"
    },
    {
      "level": "H2",
      "text": "7. PR-Stunts und Guerilla-Marketing"
    },
    {
      "level": "H2",
      "text": "8. Bewirb deine Werte, indem du für etwas eintrittst"
    },
    {
      "level": "H2",
      "text": "9. Verwandle negative Publicity in gute PR"
    },
    {
      "level": "H2",
      "text": "Fazit"
    }
  ],
  "author": "Michal Pecánek"
}