{
  "url": "https://ahrefs.com/blog/de/product-market-fit/",
  "slug": "product-market-fit",
  "title": "Wie man Product-Market-Fit erreicht (in 5 Schritten)",
  "description": "Von Product-Market-Fit (PMF) spricht man, wenn ein Unternehmen nachweisbare Anzeichen dafür hat, dass sein Produkt eine bestehende Nachfrage in einem potentiell großen Markt befriedigen kann.",
  "content": "Mateusz Makosiewicz Marketingforscher und Ausbilder bei Ahrefs. Mateusz hat über 10 Jahre Erfahrung im Marketing, die er in Agenturen, SaaS- und Hardware-Unternehmen gesammelt hat. Wenn er nicht schreibt, komponiert er Musik oder genießt lange Spaziergänge. Inhalt Startups sehen sich einem nicht enden wollenden Strom von Problemen und Herausforderungen gegenüber. Das Überleben in einem solchen Szenario ist eine Kunst, bei der man sich entscheiden muss, worauf man sich konzentrieren, was man zurückstellen oder einfach ignorieren will.Aber das ist nie einfach: Meinungsverschiedenheiten, Zeit- und Geldmangel und die falsche Vorstellung, dass eine wirklich großartige Geschäftsidee sofort in die Höhe schießen sollte, sind häufige Probleme, mit denen Start-ups konfrontiert werden.Der Product-Markt-Fit ist ein Konzept, das darauf abzielt, verschiedene Startup-Probleme zu lösen, indem es darauf abzielt, “das Einzige zu sein, was zählt”. Die Konzentration auf dieses Konzept sollte jedes Startup auf den richtigen Weg bringen, egal unter welchen Umständen. In diesem Artikel werden wir uns dieses viel diskutierte Konzept genauer ansehen. Das werden wir tun:Was ist Product-Market-Fit?Warum Product-Market-Fit wichtig istBeispiele für Product-Market-FitFünf Schritte zum Product-Market-FitWas ist Product-Market-Fit?Von Product-Market-Fit (PMF) spricht man, wenn ein Unternehmen bestätigte Signale hat, dass sein Produkt eine bestehende Nachfrage in einem Markt mit hohem Potenzial befriedigen kann. Der PMF ist in der Regel dann erreicht, wenn die Menschen bereit sind, das Produkt zu kaufen (auch wenn es noch nicht perfekt ist), es aktiv zu nutzen und es weiterzuempfehlen.Warum ist Product-Market-Fit wichtig?Um ein erfolgreiches Produkt zu entwickeln, muss man die richtigen Dinge in der richtigen Reihenfolge tun und sich auf das konzentrieren, was wirklich wichtig ist. Genauso wie Häuser von Grund auf gebaut werden müssen, sollten Unternehmen ein gutes Fundament schaffen, bevor sie weitergehen. Bevor sie mehr Leute einstellen oder die Kundenakquise ausweiten, sollten Startups zwei Dinge sicherstellen: Erstens, dass es genug Leute gibt, die bereit sind, für das Produkt zu bezahlen, und zweitens, dass der Markt selbst ein Wachstumspotenzial aufweist.Einfach gesagt: Ohne PMF gibt es kein nachhaltiges Wachstum.Beispiele für Product-Market-FitEs gibt einige mögliche Szenarien, um PMF zu erreichen. Manche Unternehmen finden eine gute Idee, auf die sie aufbauen. Andere müssen ihr Geschäft komplett umstellen (Pivot), um profitabel zu werden. Schauen wir uns also einige Beispiele für Unternehmen an, die ihren PMF gefunden haben. AhrefsAhrefs ist ein All-in-One SEO Toolkit, das mehrere Tools enthält, um den organischen Such-Traffic zu steigern, den Wettbewerb zu analysieren und technische SEO-Probleme zu lösen.Die fünf wichtigsten Tools von Ahrefs.In den Anfängen war Ahrefs jedoch nur ein einziges Tool, das für die Analyse von Backlinks entwickelt wurde (was nur ein Aspekt von SEO ist). Empfohlene Lektüre: SEO: Der komplette Anfänger-Leitfaden Das Leistungsversprechen (Value Proposition) von Ahrefs im Jahr 2011.Das Gründerteam von Ahrefs konzentrierte sich ausschließlich auf die Kundenzufriedenheit des ersten Produkts. Zu Beginn gab es kein Marketing- oder Vertriebsteam. Diese Strategie ermöglichte es dem Unternehmen, klare Signale von PMF zu erhalten. Dank des organischen Wachstums seines Kundenstamms war Ahrefs in der Lage, weitere erfolgreiche SEO Tools zu entwickeln und sein Team zu vergrößern.Es ist wichtig zu erwähnen, dass Ahrefs nicht bei der ersten PMF stehen geblieben ist. Um wettbewerbsfähig zu bleiben und mit der Nachfrage auf dem Markt Schritt zu halten, hat Ahrefs die Funktionalität von einem Einzweck-SEO-Tool zu einem umfassenden SEO-Toolkit erweitert. SlackDas ist Glitch, der Vorläufer von Slack, der nicht einmal eine Messaging-App war. Glitch war ein browserbasiertes Online-Multiplayer-Spiel, das 2012 auf den Markt kam und so aussah:Das Chat-Fenster auf der rechten Seite ist das, was später zu dem Slack wurde, das wir heute alle kennen. Der Rest wurde vom Unternehmen fallen gelassen und unter einer Open-Source-Lizenz veröffentlicht, damit jeder es übernehmen konnte. Slack fand sein PMF, indem es sich in ein völlig anderes Produkt verwandelte. Im Startup-Jargon nennt man das einen “Pivot”.Das Spiel Glitch hatte nicht den gewünschten Erfolg. Aber angesichts des Erfolgs des Spin-offs ist das völlig egal. Wichtig ist, dass du deine Lektion schnell verstehst und dich auf Dinge konzentrierst, die tatsächlich funktionieren.Play-DohPlay-Doh ist ein klassisches Spielzeug, das seit rund 50 Jahren in keinem Spielzeugladen fehlen darf. Die Marke ist sehr erfolgreich, aber ihre Reise auf der Suche nach PMF ist nicht ganz so reibungslos verlaufen.Zunächst einmal hatte Play-Doh ursprünglich eine ganz andere Anwendung für eine ganz andere Zielgruppe als heute. Das Produkt mit dem Namen Kutol war ein Wandreiniger, der speziell zum Abwaschen der schwarzen Rückstände auf Kohleöfen entwickelt wurde — ein häufiges Problem in den 1930er Jahren. Das Geschäft lief gut, bis die Kohleheizungen durch “sauberere” Gas- und Ölheizungen ersetzt wurden. Auf diese Weise verlor das Unternehmen seine ursprüngliche PMF. Aber es hat nicht aufgegeben. Die Legende besagt, dass ein Verwandter des Gründers Kutol im Kunst- und Handwerksunterricht mit Kindern eingesetzt hatte. Dieser Verwandte schlug etwas Ähnliches für eine neue, offizielle Produktanwendung vor. Also wagten die Hersteller von Kutol den Sprung ins kalte Wasser und tauften das Produkt in Play-Doh um, eine Modelliermasse für Kinder. Damit entdeckte das Unternehmen sein neues PMF und hat es seitdem nicht mehr aus den Augen verloren. Vorher und nachher. In den 1950er Jahren versuchte der Wandreiniger “Kutol”, seine PMF zurückzugewinnen. Auf diese Weise wurde er zu einem erfolgreichen Spielzeug.Fünf Schritte, um Product-Market-Fit zu erreichenDer Grundgedanke, der dem Prozess der PMF-Findung zugrunde liegt, ist ähnlich wie bei der wissenschaftlichen Methode. Um eine Entdeckung zu machen (z. B. welches Produkt du bauen sollst), musst du das Problem so gut erforschen, dass du eine Hypothese aufstellen und dann ein Experiment entwerfen kannst, mit dem du die Hypothese beweisen oder widerlegen kannst. Wenn du wissen willst, wie man den PMF für ein bereits existierendes Produkt misst, springe zu Schritt vier.Schritt #1. Formuliere die Werthypothese Eine Werthypothese ist eine Annahme, die erklärt, warum ein Kunde dein Produkt wahrscheinlich kaufen wird. Mit anderen Worten: Du musst angeben, welchen Wert dein Produkt für das Leben des Nutzers hat. Eine Werthypothese könnte etwa so aussehen:Der Online-Kauf von Büchern bietet ein besseres Erlebnis als der Kauf von Büchern im Laden.SEO-Profis brauchen ein Tool für die automatisierte technische SEO-Diagnose.E‑Mail-Kommunikation ist weniger produktiv als ein Online-Chat in Echtzeit. Deine Werthypothese wird später in der Konfrontation mit echten Nutzern getestet, die mit deinem Minimum Viable Product (MVP) interagieren. Großartige Produkte lösen echte, sinnvolle Probleme. Um diese Probleme und die potenziellen Kunden, die eine Lösung brauchen, zu identifizieren, musst du Marktforschung betreiben.Marktforschung kann ein sehr zeitaufwändiger Prozess sein. Aber die gute Nachricht ist, dass ein großer Teil der Marktforschung online durchgeführt werden kann, ohne dass du dafür viel Geld ausgeben musst.Mit einem SEO Tool wie Ahrefs kannst du zum Beispiel die Marktnachfrage abschätzen, indem du in den Suchmaschinen nach Anzeichen für die Suchnachfrage suchst, da diese oft miteinander korrelieren. Nehmen wir an, dein Startup möchte eine Online-Lösung für Entschädigungen bei verspäteten und gestrichenen Flügen anbieten. Da es sich dabei um ein Online-Produkt handelt, möchtest du herausfinden, wie oft Menschen nach Fragen suchen, die mit diesem Problem zu tun haben. Mit dem Keywords Explorer von Ahrefs sind diese Informationen nur ein paar Klicks entfernt. Der Begriff “Entschädigung bei Flugverspätung” wird weltweit etwa 1.600 Mal pro Monat gesucht und scheint ein weit verbreitetes Problem zu sein. Außerdem können wir sehen, dass die Suchnachfrage durch die Pandemie stark beeinträchtigt wurde.Schritt #2. Lege die Merkmale deines Minimum Viable Product fest Wenn du das Problem, das du lösen willst, klar definiert hast, besteht der nächste Schritt darin, die Funktionen festzulegen, mit denen du das Problem des Kunden lösen kannst.Wenn du zu wenige Funktionen baust, wird deine Lösung unvollständig sein. Aber auch zu viele Funktionen sind nicht gut, da sie den Kernwert des Produkts verwässern und das Risiko erhöhen, dass du deinen Prototyp zu sehr ausreizt. An dieser Stelle kommt ein MVP ins Spiel. Beim Aufbau eines MVP geht es um die richtige Art und die richtige Anzahl von Funktionen, die zur Überprüfung der Hypothese benötigt werden. Es ist wahrscheinlich eine gute Idee, mehrere Quellen und Arten von Forschung zu nutzen, um herauszufinden, was gebaut werden muss. Du kannst Schlussfolgerungen aus deiner Wettbewerbsanalyse, Umfragen, Beobachtungen und Branchenberichten kombinieren. Auch SEO Tools können hilfreich sein. Du kannst dir zum Beispiel einen guten Überblick darüber verschaffen, welche Funktionen für deine Konkurrenten den größten Nutzen bringen, indem du die Webseiten identifizierst, auf die sie bezahlten Traffic leiten, sowie die Top-Seiten nach organischem Such-Traffic. Angenommen, du möchtest ein Tool für das Projektmanagement entwickeln. Nehmen wir den Site Explorer von Ahrefs und schauen wir uns den Bericht über bezahlte Seiten für asana.com an:Und im Bericht über die Top-Seiten sehen wir die Landing Pages für die Produktfunktionen, die den meisten organischen Traffic erhalten: Daraus kannst du schließen, dass du die Integration von Formularen und Zeitleisten in deine Projektmanagement-App ernsthaft in Betracht ziehen solltest. Wenn es für deinen Konkurrenten gut ist, könnte es auch für dein Produkt gut sein (zusätzlich zu deinem einzigartigen Nutzenversprechen). Schritt #3. Kreiere dein Minimum Viable ProductWenn du dir einige der erfolgreichsten MVPs ansiehst, wirst du sehen, dass es viele Möglichkeiten gibt, sie zu bauen. Es muss nicht einmal ein voll funktionsfähiges Produkt sein.So begann Buffer als Landing Page, die Anmeldungen für ein Produkt sammelte, das es noch gar nicht gab. Dropbox überprüfte seine Geschäftsidee, indem es zwei Videos über das Produkt erstellte. Im ersten Video wurde das Produkt nicht einmal gezeigt. https://www.youtube.com/watch?v=w4eTR7tci6ASchauen wir uns nun ein paar Ideen an, wie du ein MVP erstellen kannst (neben der Entwicklung eines voll funktionsfähigen Produkts): Werbekampagnen — Du kannst verschiedene Arten von kreativen Inhalten für bestimmte Zielgruppen produzieren, um herauszufinden, welche Aspekte deines Produkts sie am meisten ansprechen. Prototypen — Du kannst Design Tools wie UXPin, Figma oder Marvel verwenden, um einen interaktiven, originalgetreuen Prototyp deiner Lösung zu erstellen und ihn den Leuten zu zeigen. Landing Pages - Ähnlich wie bei Buffer kannst du eine Landing Page erstellen, um deine Idee vorzustellen und über ein Anmeldeformular für eine Warteliste E‑Mail-Adressen zu sammeln. Später kannst du diese E‑Mails nutzen, um Feedback zu sammeln. Außerdem kannst du A/B‑Tests auf der Seite durchführen, um verschiedene Hypothesen zu testen. Kundeninterviews - Mit dieser Methode kannst du mit möglichst geringem Aufwand herausfinden, wie deine Interessenten auf dein Produkt reagieren würden. “Zauberer von Oz” MVP - Die Kunden denken, sie erleben ein echtes Produkt, aber du erbringst den Service durch manuelle Arbeit “hinter den Kulissen”. Concierge MVP — Ein manuelles MVP ähnlich dem “Zauberer von Oz”, aber du täuschst das Produkt nicht vor. Kickstarter/Vorbestellungsseiten - Du kannst die Nachfrage auf dem Markt testen, indem du Frühentschlossene dazu bringst, sich für dein Produkt zu registrieren. Wie auch immer du dein MVP erstellst, denk daran, dass es dazu beitragen muss, deine Nutzenhypothese zu bestätigen. Schritt #4. Teste dein Minimum Viable Product mit echten Nutzern In dieser Phase der PMF-Findung musst du so viel Feedback für dein Produkt sammeln, wie du kannst. Beschränke dich nicht nur auf positive oder negative Rückmeldungen. Versuche, tiefer zu graben und zu verstehen, was deine Nutzer mögen oder nicht mögen und was sie ändern wollen. Plattformen wie SurveyMonkey, UserTesting oder Remesh können dir dabei helfen, die richtige Zielgruppe zu erreichen, um Nutzertests und/oder Interviews durchzuführen. Du kannst dein MVP auch in Online-Communities veröffentlichen, die für die Zielgruppe deines Produkts relevant sind, oder es auf Plattformen wie Product Hunt teilen. Je nachdem, wie lange dein Produkt schon auf dem Markt ist, können Anzeichen für PMF (oder das Fehlen davon) an der Kundenzufriedenheit und dem Engagement der Kunden abgelesen werden. Betrachte diese Indikatoren: NPS-Wert – Führe eine Net Promoter Score-Umfrage unter deinen Nutzern durch. Wenn deine Nutzer mit dem Produkt nicht zufrieden sind, ist es unwahrscheinlich, dass sie es ihren Freunden empfehlen. Damit hast du geringe Chancen, durch Mundpropaganda organisch zu wachsen. Die 40%-Regel – Wie bei der NPS-Umfrage geht es auch hier nur um eine einzige Frage: “Wie würdest du dich fühlen, wenn du [Produkt] nicht mehr nutzen könntest?” Die möglichen Antworten sind a) sehr enttäuscht, b) etwas enttäuscht, c) nicht enttäuscht (es ist nicht wirklich nützlich) und d) k.A. — ich benutze [Produkt] nicht mehr. Wenn mindestens 40 % deiner Nutzer/innen die erste Option wählen, ist die Wahrscheinlichkeit groß, dass du die PMF erreicht hast. Cohort Retention Rate – Sie ist nur für Produkte vorgesehen, die über einen längeren Zeitraum genutzt werden sollen. Die Idee ist folgende: Wenn deine bezahlten Kunden bei deinem Produkt bleiben, ist das ein Zeichen für PMF. Die ideale Kundenbindungsrate hängt von der Art des Produkts und der Branche ab. Lies hier mehr über Benchmarks für Kundenbindungsraten. Schritt 5. Lerne von deinen Nutzern und führe Optimierungen durchIn dieser letzten Phase des Prozesses solltest du in der Lage sein, zwei Fragen zu beantworten: Hat dein MVP die Werthypothese bewiesen oder widerlegt? Und was kannst du tun, um dein zukünftiges Produkt besser zu machen?Ein negatives Ergebnis deines Werthypothesen-Experiments ist nicht das Ende der Welt. Je nach Feedback kannst du einige Änderungen vornehmen und deine Hypothese neu formulieren. Dann kannst du den Prozess noch einmal von vorne beginnen. Ein berühmtes Beispiel dafür ist die Luftpolsterfolie. Sie hat sich nicht als neue Art von Tapete oder Hausisolierung durchgesetzt. Außerdem können manche Geschäftsideen ihrer Zeit einfach voraus sein (z. B. aus technischen Gründen oder wegen der aktuellen Gesetzgebung). Vielleicht musst du es zu einem anderen Zeitpunkt erneut versuchen. Manche Geschäftsideen sind aber auch einfach nur schlecht, und du kannst nichts dagegen tun. Das Gute daran ist, dass du dir viel Zeit und Geld sparen kannst, wenn du dieses Problem frühzeitig entdeckst. Aber wenn du die ganze Zeit Recht hast und dein MVP die Konfrontation mit den Nutzern überlebt, hast du gute Chancen, erfolgreich zu sein. Mit anderen Worten: Es ist wahrscheinlich, dass du PMF gefunden hast. Bevor du dein MVP in ein voll funktionsfähiges Produkt verwandelst und auf den Markt bringst, solltest du noch ein paar Iterationen durchführen, um alle Rückmeldungen, die du erhalten hast, zu verarbeiten. Du willst von deinen Nutzern hören, dass dein MVP einfach zu bedienen ist und eine wertvolle Lösung bietet.Wie wir in unseren PMF-Beispielen gesehen haben, kann PMF eine vorübergehende Sache sein. Es kann sein, dass du irgendwann verlierst, wie Kutol (Play-Doh), oder dass du deine ursprüngliche Idee erweitern musst, wie Ahrefs.FazitDer Markt gewinnt immer. Ein großartiges Produkt wird auf einem ungünstigen Markt scheitern, und ein schlechtes Produkt wird auf einem florierenden Markt früher oder später an den Rand gedrängt werden. Deshalb ist es so wichtig, einen Markt zu wählen, auf dem die Nutzer ein echtes, bedeutsames Problem haben, das Produkt schnell auf den Markt zu bringen und es auf der Grundlage des Feedbacks zu verbessern. Wenn du in dieser Phase erfolgreich bist, kannst du die nächsten Schritte in Angriff nehmen: mehr Mitarbeiter einstellen und mehr Kunden gewinnen. Abschließend solltest du bedenken, dass nicht jedes Nutzerfeedback gleich gut ist. Du musst nicht alle Wünsche deiner Nutzer erfüllen. Konzentriere dich auf machbare Verbesserungen und Dinge, die mit deiner Produktvision übereinstimmen. Hast du Fragen oder Kommentare? Schreibt mir auf Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Mateusz Makosiewicz Marketingforscher und Ausbilder bei Ahrefs. Mateusz hat über 10 Jahre Erfahrung im Marketing, die er in Agenturen, SaaS- und Hardware-Unternehmen gesammelt hat. Wenn er nicht schreibt, komponiert er Musik oder genießt lange Spaziergänge.",
  "headers": [
    {
      "level": "H1",
      "text": "Wie man Product-Market-Fit erreicht (in 5 Schritten)"
    },
    {
      "level": "H2",
      "text": "Was ist Product-Market-Fit?"
    },
    {
      "level": "H2",
      "text": "Warum ist Product-Market-Fit wichtig?"
    },
    {
      "level": "H2",
      "text": "Beispiele für Product-Market-Fit"
    },
    {
      "level": "H3",
      "text": "Ahrefs"
    },
    {
      "level": "H3",
      "text": "Slack"
    },
    {
      "level": "H3",
      "text": "Play-Doh"
    },
    {
      "level": "H2",
      "text": "Fünf Schritte, um Product-Market-Fit zu erreichen"
    },
    {
      "level": "H3",
      "text": "Schritt #1. Formuliere die Werthypothese"
    },
    {
      "level": "H3",
      "text": "Schritt #2. Lege die Merkmale deines Minimum Viable Product fest"
    },
    {
      "level": "H3",
      "text": "Schritt #3. Kreiere dein Minimum Viable Product"
    },
    {
      "level": "H3",
      "text": "Schritt #4. Teste dein Minimum Viable Product mit echten Nutzern"
    },
    {
      "level": "H3",
      "text": "Schritt 5. Lerne von deinen Nutzern und führe Optimierungen durch"
    },
    {
      "level": "H2",
      "text": "Fazit"
    }
  ],
  "author": "Mateusz Makosiewicz"
}