{
  "url": "https://ahrefs.com/blog/de/seo-vertrag/",
  "slug": "seo-vertrag",
  "title": "Die ultimative SEO-Vertragsvorlage [100% kostenlos]",
  "description": "Du brauchst eine anpassbare SEO-Vertragsvorlage für deine Kunden? Hol dir unsere kostenlose Vorlage, die für Auftragnehmer und Agenturen entwickelt wurde.",
  "content": "Gary Coutard Marketing @ Ahrefs. Über 10 Jahre Erfahrung in den Bereichen SEO und Marketing. Gesundheitsfanatiker mit einer Leidenschaft für kreative Problemlösungen und Surfen. Inhalt Wenn du SEO-Kunden hast, die bereit sind, einen Vertrag zu unterschreiben, dann schicke ihnen einfach unseren SEO-Vertrag, den wir dir kostenlos zur Verfügung stellen.Diese Vertrags-Vorlage enthält 13 wichtige Abschnitte, die du brauchst, um dich abzusichern und klare Vereinbarungen mit deinen Kunden zu treffen. Sie ist außerdem vollständig anpassbar — du kannst ganz einfach die Namen austauschen, die Preise und Leistungen ändern und die allgemeinen Geschäftsbedingungen anpassen.Wie haben wir sie erstellt?Wir haben über 40 SEO-Agenturen und Freiberufler befragt, ihre SEO-Verträge analysiert und die besten Bestandteile herausgefiltert.Darauf gehen wir im Folgenden ein:Warum brauche ich einen SEO-Vertrag?Was sind die Gefahren, wenn man keinen angemessenen SEO-Vertrag hat?Wie du die Vorlage für den SEO-Vertrag anpassen kannstHaftungsausschluss: Bedenke, dass ich, Gary, kein Anwalt bin; nichts, was hier vorgestellt wird, sollte als Ersatz für eine Rechtsberatung angesehen werden. Weder Ahrefs noch ich tragen die Verantwortung für die Art und Weise, wie du diese Informationen verwendest. Es steht dir zwar frei, unseren SEO-Mustervertrag nach eigenem Ermessen wiederzuverwenden, du solltest aber immer einen qualifizierten Juristen zu Rate ziehen.Warum brauche ich einen SEO-Vertrag?Einen guten Vertrag für deine SEO-Dienstleistungen zu haben, wird:mehr Vertrauen schaffendir dabei helfen, dich rechtlich abzusichernklare Erwartungen für deine Kunden festlegenDoch könntest du nicht einfach nur einen mündlichen Vertrag abschließen?Das kann ich dir nicht beantworten. Was ich aber tun kann, ist, ein paar Statistiken über deine Kollegen zu teilen, die wir befragt haben.Von den über 40 Fachleuten, die wir weltweit befragt haben, verwenden 86 % einen schriftlichen Vertrag für ihre SEO-Dienstleistungen.Unter den Befragten sind Agenturen, Freiberufler und Auftragnehmer, die im Durchschnitt seit 9,5 Jahren im SEO-Bereich tätig sind.Im Durchschnitt arbeiten 22 Mitarbeiter als Angestellte oder Subunternehmer unter ihnen.Eine mündliche Vereinbarung mag also für eine kleine Anzahl von Menschen funktionieren. Aber laut unserer Umfrage und meiner persönlichen Erfahrung, die ich seit über einem Jahrzehnt in der SEO-Branche mache, ist ein schriftlicher Vertrag die beste Art, Geschäfte zu machen. Meiner Meinung nach ist ein solider Vertrag für dein Unternehmen so, als hättest du vor dem Flug deine Bordkarte bereit. So wird der Einstieg in das Geschäft mit neuen Kunden viel reibungsloser verlaufen. Dein schriftlicher Vertrag sagt dem Kunden, wo du hinwillst und wie du dorthin kommst.Hier sind ein paar weitere Gedanken von denjenigen, die wir befragt haben:Chris Anderson erklärt, wie dein SEO-Vertrag dazu beiträgt, Vertrauen aufzubauen:“Unser Vertrag hat uns viele Male gerettet, weil wir dafür gesorgt haben, dass er hieb- und stichfest ist. Vor allem gibt er uns das Selbstvertrauen, uns an die Vereinbarung zu halten und nicht einfach nachzugeben, wenn wir unter Druck geraten. Wir arbeiten mit Kunden auf der ganzen Welt zusammen, deshalb ist es wichtig, dass ein Jurist den Teil überprüft, der sicherstellt, dass der Vertrag mit unserem lokalen Recht übereinstimmt.”Chris Anderson, Founder SpringhillSamuel Hurley erklärt, wie dein SEO-Vertrag dich schützt:“In den ersten Tagen als neue Agentur arbeiteten wir mit sehr kleinen Unternehmen zusammen, bei denen unser Ansprechpartner oft der Inhaber des Unternehmens war. Es kam mehr als einmal vor, dass der Inhaber plötzlich unser Budget kürzen oder ad hoc monatlich umverteilen wollte, ohne Vorankündigung. In solchen Fällen hat uns der Vertrag wirklich geschützt. Außerdem finden wir es besonders wichtig, einen Bezugspunkt zu haben, der sagt: “Das haben wir mit euch vereinbart”. In unserer Branche gerät das oft in Vergessenheit, vor allem, wenn der Vertrag über einen längeren Zeitraum läuft.”Samuel Hurley, Co-founder NovosBrian Craig beschreibt, wie dein SEO-Vertrag hilft, klare Erwartungen zu stellen:“Der Hauptvorteil eines SEO-Vertrags ist, dass darin die Erwartungen im Voraus festgelegt werden. Selbst wenn es zu Problemen kommt, glaube ich, dass Menschen im Allgemeinen versuchen, das Richtige zu tun. Die meisten Konflikte entstehen durch unerfüllte oder unausgesprochene Erwartungen. Wenn es jemals eine Frage dazu gibt, wie bestimmte Situationen gehandhabt werden, können wir uns auf dieses Dokument berufen, das wir beide unterschrieben haben, um zu wissen, wie wir es richtig machen. Ich denke, es ist immer wichtig, Vereinbarungen wie diese von einem Anwalt überprüfen zu lassen, obwohl es eine Menge Geld spart, wenn du bereits einen Entwurf und eine Vorlage von dem hast, was du willst.”Brian Craig, Founder LegalScapesWas sind die Gefahren, wenn man keinen angemessenen SEO-Vertrag hat?Ohne eine schriftliche Vereinbarung können manche Dinge, die du mündlich oder in E‑Mails geäußert hast, falsch angewandt oder falsch interpretiert werden, was zu folgenden Konsequenzen führen kann:Schmerzhaft lange Auseinandersetzungen, die das Vertrauen zerstören (auch wenn du nicht schuld bist).Du wirst zu einer Leistung gezwungen, die du nicht erbringen wolltest oder müsstest.Ein verärgerter Kunde, der überall schlechte Kritiken schreibt.Im schlimmsten Fall gerätst du in einen Rechtsstreit.Manche Menschen glauben fälschlicherweise, dass sie ohne einen schriftlichen Vertrag für nichts haftbar gemacht und verklagt werden können. Zu sagen, dass das eine riskante Denkweise ist, ist eine Untertreibung.Die Länder und Gesetze sind unterschiedlich, aber ich weiß, dass man in den USA in einigen Fällen, in denen es um Auftragsarbeiten geht, keinen schriftlichen Vertrag braucht, um zu klagen und verklagt zu werden. Auch wenn ein schriftlicher Vertrag für SEO-Dienstleistungen die Möglichkeit eines Rechtsstreits nicht völlig ausschließt, so ist die Wahrscheinlichkeit doch geringer, dass es zu einem solchen kommt, da die Erwartungen und die zu erbringenden Leistungen in deinem Vertrag definiert und vereinbart wurden.Fazit: Auch wenn du dich für unsere Vorlage entscheidest, solltest du immer einen Juristen zu Rate ziehen, bevor du deinen Kunden einen Vertrag für deine SEO-Dienstleistungen schickst.“Das Rechtsdokument, das wir verwenden, bezieht sich auf alle unsere früheren Gespräche mit den Kunden und wird daher nicht als Vertrag bezeichnet, sondern als Vereinbarung, die wir für die Arbeit haben, mit der unsere Kunden uns beauftragen. Unsere Vereinbarungen werden allesamt von Juristen aufgesetzt. Damit stellen wir nicht nur sicher, dass wir unseren Kunden gegenüber das Richtige tun, sondern auch, dass wir, wenn es soweit ist, wissen, womit wir es zu tun haben und wie die örtlichen Gesetze uns schützen. Diese Vereinbarung hat uns bisher jeden Tag geholfen.”Sagar Sethi, MD XugarSo passt du die Vorlage für den SEO-Vertrag anUnsere SEO-Vertragsvorlage enthält 13 Schlüsselkomponenten, die aus der Befragung von über 40 SEO-Fachleuten und der manuellen Überprüfung von über einem Dutzend echter SEO-Verträge stammen. Doch eine Vorlage ist eine Vorlage, das heißt, du musst sie anpassen.Bevor du diesen Vertrag also an deine Kunden schickst, möchte ich mit dir jeden der 13 Bestandteile durchgehen und dir zeigen, wie du sie anpassen kannst.VertragsdefinitionenDeine VerpflichtungenDie Verpflichtungen des KundenVertragsdauerZahlungsbedingungenVertragsauflösungZusicherungenHaftungHaftungsfreistellungHöhere GewaltGerichtsbarkeit und AuslegungVertraulichkeitUnterzeichnung1. VertragsdefinitionenDieser Abschnitt enthält Definitionen der wichtigsten Begriffe in deinem Vertrag. Das mag albern klingen, ist aber sehr wichtig.Wenn du zum Beispiel von “SEO” oder “SEO-Arbeit” sprichst, was genau meinst du damit? Dein Kunde hat vielleicht eine Definition im Kopf, aber du hast vielleicht eine ganz andere Auffassung von diesem Begriff. An dieser Stelle kannst du alle Zweifel rund um Phrasen, Begriffe oder Konzepte aus dem Weg räumen, damit du ohne Angst vor möglichen Fehlinterpretationen vorankommen kannst.2. Deine VerpflichtungenIn diesem Abschnitt solltest du beschreiben, was du als SEO-Auftragnehmer tun wirst, wann du es tun wirst und wie. Hier solltest du darlegen, wie weit dein Leistungsumfang für den Kunden gehen wird.Da sich die von dir erbrachten SEO-Leistungen im Laufe der Zeit aufgrund von Aktualisierungen der Suchmaschinenalgorithmen und der Kundenbedürfnisse ändern, solltest du dich nicht zu sehr auf die Methoden festlegen, die du anwenden wirst. Auf diese Weise legst du dich nicht auf eine bestimmte Taktik oder einen bestimmten Arbeitsablauf fest.Konzentriere dich stattdessen darauf, jede Leistung zu beschreiben, die für die allgemeine Suchmaschinenoptimierung des Kunden von Vorteil ist. Wenn du diesen Abschnitt anpasst, zählst du die grundlegenden SEO-Maßnahmen auf, die du zum Erreichen der einzelnen Ergebnisse erbringst, wie zum Beispiel Onsite- oder On-Page-SEO.Und sei um Himmels willen nicht einer von denen, die eine bestimmte Kennzahl versprechen, wie zum Beispiel ein bestimmtes Domain Rating (DR) oder auf Platz 1 bei Google zu ranken!3. Die Verpflichtungen des KundenJetzt drehen wir den Spieß um und beschreiben den Verantwortungsbereich deines Kunden — was er wann und wie tun wird.Wenn du diesen Abschnitt durchgehst, denke an andere Dinge, zu denen sich dein Kunde verpflichten soll, abgesehen davon, dass er dich für deine Dienste bezahlt. Du solltest zum Beispiel festlegen, wie er dich bei Anfragen kontaktieren soll. Du solltest auch erklären, welche Mittel er dir zur Verfügung stellen muss, damit du deine Arbeit richtig machen kannst.4. VertragsdauerDa SEO ein fortlaufender Prozess ist, wird in diesem Abschnitt festgelegt, wie lange der Vertrag laufen soll.Jeder Auftragnehmer ist anders, also musst du diesen Abschnitt anpassen, um die Vertragsdauer genau zu definieren.Hast du eine obligatorische sechsmonatige Laufzeit, bei der sich dein Kunde verpflichten muss, deine Dienste in Anspruch zu nehmen, damit du gute Ergebnisse liefern kannst? Werden deine Dienste monatlich abgerechnet? Wann läuft der Vertrag aus? Hier solltest du das genau festlegen.5. ZahlungsbedingungenIm Zahlungsabschnitt dieses Vertrags wird nicht nur festgelegt, wie viel du für deine SEO-Arbeit berechnen wirst. Du wirst feststellen, dass es Platzhalterabschnitte gibt, in denen bestimmte Strafen für verspätete Zahlungen beschrieben werden, und dass es Bestimmungen gibt, die festlegen, wie mit Zahlungsausfällen und Streitigkeiten umgegangen werden soll. Sieh dir diese Bestimmungen an und verwende sie als Orientierungshilfe bei der Festlegung der Zahlungsbedingungen in deinem Vertrag. 6. VertragsauflösungDeine Kündigungsklausel ist sehr wichtig, denn sie bildet für dich oder den Kunden die rechtliche Grundlage, um den Vertrag einvernehmlich zu beenden. In diesem Abschnitt solltest du also festlegen, was einen Vertragsbruch darstellen würde und wie mit solchen Fällen umgegangen werden sollte.Wenn kein Vertragsbruch vorliegt, kann dein Kunde den Vertrag kündigen, wann immer er will? Was ist, wenn du oder dein Kunde das Geschäft aufgibt oder einfach nicht mehr zusammenarbeiten möchte? Lege in den Klauseln genau fest, wann und wie der Vertrag aufgelöst werden kann.7. ZusicherungenDer Abschnitt über die Zusicherungen ist im Grunde ein formelles Versprechen beider Parteien, ihren Teil der Abmachung zu erfüllen und einige grundlegende Regeln zu befolgen. Er kann dich auch vor unethischen Praktiken wie Abwerbung schützen.Sieh dir unseren Muster-SEO-Vertrag an und füge alle anderen “Versprechen” hinzu, denen du oder dein Kunde zustimmen sollten. Jede Region und jedes Land ist anders, daher enthält unser Muster die Grundlagen, die in den meisten Situationen benötigt werden.8. HaftungDie Haftung ist ein großes Problem für dich als Dienstleistungsanbieter. Auch wenn es keinen materiellen Schaden gibt, der entstehen könnte, stehen dein Ruf und dein Geld auf dem Spiel.In diesem Abschnitt unseres Muster-SEO-Vertrags wird deinen Kunden erklärt, dass du keinen Einfluss darauf hast, wie hoch Google ihre Website rankt. Er erklärt kunstvoll, dass du nicht für unerwünschte Ergebnisse wie niedrige Rankings, Leads, die nicht in Kunden umgewandelt werden, oder andere eitle Kennzahlen verantwortlich gemacht werden kannst, auf die du keinen Einfluss hast. Natürlich solltest du für die oben genannten Leistungen, denen du zugestimmt hast, zur Verantwortung gezogen werden.Die Festlegung klarer Haftungsgrenzen hilft enorm dabei, angemessene Erwartungen festzulegen und Beschwerden zu vermeiden. Achte also bei der Durchsicht dieses Abschnitts besonders auf den Haftungsteil in deinem Vertrag und stelle sicher, dass er für dich funktioniert! Das kann dir später eine Menge Stress ersparen!9. HaftungsfreistellungHaftungsfreistellung bedeutet, “jemanden vor der rechtlichen Haftung für seine Handlungen zu schützen” und möglicherweise “für den Verlust zu entschädigen”, wenn er oder sie in einen Rechtsstreit verwickelt wird.Mit anderen Worten: Im Abschnitt über die Entschädigung in unserem Vertrag erklärt ihr beide, dass ihr euch nicht gegenseitig den schwarzen Peter zuschieben wollt. Das schützt dich davor, verklagt zu werden.Wenn dein Kunde dich z.B. bittet, etwas auf seine Website zu stellen, und später dafür verklagt wird, möchtest du nicht, dass er die Schuld auf dich schiebt. Dieser Abschnitt soll das verhindern und festlegen, welche Art von Entschädigung du in dem seltenen Fall erhalten sollst, dass du in einen Rechtsstreit verwickelt wirst.Erkundige dich bei deinem Rechtsberater, um sicherzugehen, dass du vollständig geschützt bist, bevor du einen Vertrag zur Unterzeichnung abschickst.10. Höhere GewaltIn einem Geschäftsvertrag bezieht sich “höhere Gewalt” auf unkontrollierbare oder unvorhersehbare Ereignisse, die es unmöglich machen, den Vertrag zu erfüllen. Dazu gehören seltene Ereignisse wie ein Tornado, der in deiner Gegend wütet und dir den Zugang zum Internet verwehrt. Auch andere Ereignisse wie eine weltweite Pandemie (gar nicht mehr so selten!), ein Krieg oder ein Brand können darunter fallen.Wenn in deinem Gebiet andere Ereignisse höherer Gewalt üblich sind, ist dies die richtige Stelle, um sie zu definieren.11. Gerichtsbarkeit und AuslegungDer Sinn eines Vertrags ist doch, dass er rechtsverbindlich ist, oder? Die Gerichtsstandsklausel in einem Vertrag legt fest, welches örtliche Gericht für alle Streitigkeiten zuständig ist. Und die Auslegungsklausel gibt einer anderen Partei keinen Raum, die klare Bedeutung der in deinem Vertrag verwendeten Begriffe zu widerlegen.In der Regel solltest du die örtliche Zuständigkeit angeben, damit du im Falle eines Rechtsstreits nicht zu weit reisen musst, um eine Lösung zu finden. Sprich mit deinem Rechtsberater, wenn du diesen Abschnitt anpasst.12. VertraulichkeitDie Vertraulichkeitsklausel schützt deinen Kunden und dich vor dem Missbrauch von persönlichen Informationen. Wenn du diesen Abschnitt durchgehst, solltest du versuchen, die privaten Daten aufzulisten, die du von deinem Kunden erfragen wirst. Das wird ihm helfen, dir diese Informationen anzuvertrauen.Wenn ihr in dieser Klausel förmlich vereinbart, euch gegenseitig zu schützen, haben beide Parteien einen weiteren Anreiz, vorbeugende Maßnahmen zu ergreifen, damit sensible Informationen wie Sozialversicherungsnummern, persönliche Handynummern und andere vertraulich behandelt werden.13. UnterzeichnungIch glaube nicht, dass dies einer Erklärung bedarf. Es ist vernünftig, einen Abschnitt zu haben, in dem beide Parteien das Dokument unterschreiben und datieren.Allerdings habe ich eine Empfehlung für den Abschnitt mit der Unterschrift.Dein Kunde erwartet wahrscheinlich, dass du ein Internetgenie bist, oder? Du könntest also ein wenig amateurhaft wirken, wenn du ihm deinen SEO-Vertrag als PDF schickst und erwartest, dass er die Zeit findet, ihn auszudrucken, zu unterschreiben, einzuscannen und dann per E‑Mail an dich zurückzuschicken. Was für ein Albtraum.Außerdem schieben Kunden oft Dinge auf oder vergessen sie, wenn sie das Gefühl haben, dass zu viele Schritte nötig sind.Um den “Wow-Faktor” zu erhöhen, empfehle ich dir, dass du den Vertrag digital mit ihrem Finger unterschreiben lässt! Es gibt viele Apps für die elektronische Unterschrift, aber einige sind unnötig kompliziert und können teuer werden. Ich verwende diese App, weil sie super einfach ist, ihre Prüfprotokolle die Unterschrift deines Kunden als rechtsverbindlich beglaubigen, und habe ich schon erwähnt, dass sie kostenlos ist?Ich verlose sogar 12 Plätze für meinen kostenpflichtigen Business Plan der App an diejenigen, die diesen Artikel auf Twitter und LinkedIn am häufigsten teilen.Es ist ganz einfach: Du lädst dein PDF hoch, klickst an die Stelle, an der dein Kunde seinen Namen und seine Unterschrift hinzufügen soll — und fertig! Schicke es einfach an deinen Kunden und du hast es in weniger als einer Minute unterschrieben.FazitWenn du bisher keinen Vertrag für deine SEO-Dienstleistungen verwendet hast, hoffen wir, dass diese Vorlage dir einen Wettbewerbsvorsprung verschafft und für mehr Vertrauen beim Abschluss neuer Kunden sorgt.Wenn du die Vorlage bearbeitest, denke an diese beiden wichtigen Punkte: Setze klare Erwartungen. Hab keine Angst, in deinem Vertrag ins Detail zu gehen. Wenn du von Anfang an klar festlegst, was, von wem und wann getan wird, beugst du Missverständnissen vor und schaffst die Voraussetzungen für eine reibungslose Geschäftsbeziehung. Sprich mit deinem Rechtsberater. Ich habe dir einige praktische Tipps und Beispiele gegeben, aber ich bin nicht qualifiziert, dich rechtlich zu beraten. Bevor du einen Vertrag abschickst, solltest du dich von deinem Juristen beraten lassen.Lass mich über LinkedIn wissen, wenn du bei der Anpassung unserer Vorlage Fragen hast.Wir danken den folgenden Personen für ihren Beitrag zu unserer Recherche:Jonathan Gorham, enginescout.com.auMarkelle Harden, knowmad.comGareth Hoyle, marketingsignals.com Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human:",
  "headers": [
    {
      "level": "H1",
      "text": "Die ultimative SEO-Vertragsvorlage [100% kostenlos]"
    },
    {
      "level": "H2",
      "text": "Warum brauche ich einen SEO-Vertrag?"
    },
    {
      "level": "H2",
      "text": "Was sind die Gefahren, wenn man keinen angemessenen SEO-Vertrag hat?"
    },
    {
      "level": "H2",
      "text": "So passt du die Vorlage für den SEO-Vertrag an"
    },
    {
      "level": "H3",
      "text": "1. Vertragsdefinitionen"
    },
    {
      "level": "H3",
      "text": "2. Deine Verpflichtungen"
    },
    {
      "level": "H3",
      "text": "3. Die Verpflichtungen des Kunden"
    },
    {
      "level": "H3",
      "text": "4. Vertragsdauer"
    },
    {
      "level": "H3",
      "text": "5. Zahlungsbedingungen"
    },
    {
      "level": "H3",
      "text": "6. Vertragsauflösung"
    },
    {
      "level": "H3",
      "text": "7. Zusicherungen"
    },
    {
      "level": "H3",
      "text": "8. Haftung"
    },
    {
      "level": "H3",
      "text": "9. Haftungsfreistellung"
    },
    {
      "level": "H3",
      "text": "10. Höhere Gewalt"
    },
    {
      "level": "H3",
      "text": "11. Gerichtsbarkeit und Auslegung"
    },
    {
      "level": "H3",
      "text": "12. Vertraulichkeit"
    },
    {
      "level": "H3",
      "text": "13. Unterzeichnung"
    },
    {
      "level": "H2",
      "text": "Fazit"
    }
  ],
  "author": "Gary Coutard"
}