{
  "url": "https://ahrefs.com/blog/de/seo-mythen/",
  "slug": "seo-mythen",
  "title": "10 SEO-Mythen, die du ignorieren solltest",
  "description": "SEO-Mythen können dazu führen, dass du kostbare Zeit und Geld für Dinge verschwendest, die deine SEO nie optimieren werden. Dieser Beitrag macht ein paar gängige SEO-Mythen zunichte.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (oder, in einfachen Worten, ich bin der Typ, der dafür sorgt, dass jeder Blog-Post EPISCH wird). Inhalt Die meisten Mythen sind harmlos. Die Verdauung von Kaugummi dauert sieben Jahre. Haie können keinen Krebs bekommen. Der Blitz schlägt nie zweimal an derselben Stelle ein.Leider kann man das von den meisten SEO-Mythen nicht behaupten. Im besten Fall sind sie leicht irreführend. Im schlimmsten Fall führen sie dazu, dass du kostbare Zeit, Geld und Ressourcen für Dinge verschwendest, die keinesfalls deine SEO optimieren.Also lasst uns ein für alle Mal mit ein paar gängigen SEO-Mythen aufräumen.SEO ist totSEO ist nur eine einmalige AngelegenheitGoogle rankt nur “frischen” ContentEs ist einfacher für Long-Tail Keywords zu rankenDuplicate Content wird bestraftSoziale Signale unterstützen das RankingPPC (Pay per Click) hilft nicht dabei, höher zu rankenPageRank spielt keine Rolle mehrBei SEO dreht sich alles um RankingsKeyword-Recherche ist unwichtig1. SEO ist totVielleicht handelt es sich diesbezüglich mehr um einen puren Unsinn als um einen Mythos, aber es lohnt sich trotzdem, mit ihm aufzuräumen.Fauler Journalismus verkündet ja gerne und regelmäßig mal viele Dinge für tot, und SEO ist da nicht anders. Laut dem Content Explorer von Ahrefs wurde dieser Satz seit Juni 2016 3.367 Mal geäußert.Im Durchschnitt sind das 66 Mal im Monat.Also lasst uns das ein für alle Mal klarstellen:SEO. IST. NICHT. TOT.Woher wissen wir das? Nun, hier ist der organische Search Traffic zu unserem Blog der letzten drei Monate:2,1 Millionen Besuche… alle über “SEO”.Warum sagen die Leute dann immer wieder, SEO sei tot?Es gibt alle möglichen Gründe für diese Behauptung, aber das wohl bedeutendste Argument steht in Zusammenhang mit den folgenden Antworten, die heutzutage zunehmend in den Suchergebnissen vorkommen:Wirken sich solche Antworten negativ auf die Anzahl der Klicks auf Suchergebnisse aus? Ja, natürlich. Wenn wir uns diese Suchanfrage im Keywords Explorer von Ahrefs ansehen, sehen wir nur 1.200 Klicks bei einem geschätzten monatlichen Suchvolumen von 14.000. Das bedeutet, dass Menschen nur in 8% der Fälle auf die Suchergebnisse klicken.Aber das bedeutet nicht, dass SEO tot ist. Du kannst immer noch Klicks über dieses Keyword erhalten. Google zeigt die Antworten in den Suchergebnissen ohnehin nur für manche Keywords an.Die Wahrheit ist, solange Suchmaschinen noch existieren, benutzt werden und organische Suchergebnisse anzeigen, die du in irgendeiner Art und Weise beeinflussen kannst, ist SEO nicht tot.2. SEO ist nur eine einmalige AngelegenheitSEO ist ein bisschen vergleichbar damit, ins Fitnessstudio zu gehen. Es ist in Ordnung, hier und da ein Training zu verpassen, aber die Probleme beginnen, wenn du zu oft zu Hause bleibst und Chips isst (glaub mir, ich weiß, wovon ich spreche).So sieht es aus, wenn du damit anfängst, deine SEO zu vernachlässigen:Vor dieser Zeit habe ich die Website aktiv optimiert. Dann vernachlässigte ich sie und verlagerte meine Aufmerksamkeit auf andere Dinge. Du kannst sehen, dass der Traffic in den folgenden Monaten langsam abnahm.Dafür kann es mehrere Gründe geben:Deine Konkurrenten überholen dich (indem sie konsequent an ihrer SEO arbeiten).Du fängst an, Backlinks aufgrund von “toten Verweisen” zu verlieren.Dein Content verliert an “Frische” (mehr dazu weiter unten).Aus diesem Grund verlangen die meisten SEO-Experten (74,71%) ein monatliches Honorar für ihre Dienstleistungen und nicht einen Stundensatz oder eine einmalige Gebühr. Sie wissen, dass SEO ein fortlaufender Prozess ist und dass ihre Kunden langfristig investieren müssen, um Ergebnisse zu sehen.Gilt dies für absolut alle Websites? Nein. Es gibt seltene Fälle, in denen eine Website jahrelang vernachlässigt werden kann, und dennoch Monat für Monat beständigen Traffic anzieht.Hier ist ein Beispiel:Sie wurde zuletzt 2011 aktualisiert, zieht aber immer noch schätzungsweise ~500 monatliche organische Besuche an.3. Google rankt nur “frischen” ContentDas Wiederveröffentlichen von Content ist etwas, das wir sehr häufig tun. Wenn wir im Content Explorer von Ahrefs nach wiederveröffentlichten Beiträgen im Blog filtern, sehen wir, dass es seit 2016 ganze 136 wiederveröffentlichte Beiträge gibt.Warum investieren wir also so viel Mühe, um unseren Content “frisch” zu halten, wenn “Frische” ein Mythos ist?“Frische” ist ein anfrageabhängiger Ranking-Faktor. Das bedeutet, dass sie bei einigen Anfragen wichtiger ist als bei anderen. Es hängt alles davon ab, ob die “Frische” des Contents irgendeinen Einfluss auf die Qualität des Contents hat.SEO entwickelt sich ständig weiter, daher ist “Frische” für viele SEO-bezogene Anfragen von Bedeutung.Das passierte zum Beispiel, als wir unsere unsere Liste der Top Google-Suchanfragen monatelang nicht aktualisiert haben:Du kannst sehen, dass der Traffic monatelang rückläufig war, sich dann aber über Nacht ziemlich erholt hat, als wir diese aufgefrischt und neu veröffentlicht haben. Das liegt daran, dass sich die Top Google-Suchanfragen ständig ändern, und sich die Nutzer “frische” Ergebnisse erwarten.Auf der anderen Seite spielt die “Frische” bei einer Suchanfrage wie “Wie bindet man eine Krawatte” keine besondere Rolle, da sich die Vorgangsweise nie ändert. Aus diesem Grund rankt Google, auch Websites unter den ersten drei, die zuletzt 2013 aktualisiert wurden.4. Es ist einfacher für Long-Tail Keywords zu rankenDie meisten Leute denken, dass Long-Tail Keywords aus vielen Wörtern bestehen, aber das ist nicht ganz richtig. Long-Tail Keywords sind Suchanfragen mit geringem individuellen Suchvolumen. Die Anzahl der Wörter spielt keine Rolle.Zum Beispiel sind beide dieser Anfragen Long-Tail Keywords:Aber die Sache ist die: Auch wenn Long-Tails nur wenige monatliche Suchanfragen erhalten, ist es in der Regel nicht einfacher für sie zu ranken als bei ihren beliebteren Gegenstücken.Schauen wir uns zum Beispiel die Keyword-Schwierigkeits-Werte für diese Keywords an:Trotz der beträchtlichen Unterschiede bei den monatlichen Suchvolumina sind die Werte in etwa gleich. Das liegt daran, dass die Suchanfrage mit geringem Volumen das ist, was wir gerne als “unterstützendes Long-Tail Keyword” bezeichnen. Mit anderen Worten, es ist eine weniger populäre Art der Suche nach einem populären Thema.Es ist in der Regel nicht einfacher, für diese LongTails zu ranken, da Google meist die gleichen Suchergebnisse wie für das “Haupt”-Keyword rankt.Fairerweise muss man sagen, dass es eine andere Art von Long-Tail Keywords gibt, für die man einfacher ranken kann. Wir nennen diese gerne “Topical Long Tails”. Über diese erfährst du mehr in unserem kompletten Leitfaden zu Long-Tail-Keywords.5. Duplicate Content wird bestraftUm Duplicate Content handelt es sich, wenn exakter oder nahezu duplizierter Content an mehr als einer Stelle auftaucht. Er kann sich auf derselben Website oder auf mehreren Websites befinden.Zum Beispiel führen beide der folgenden URLs zum gleichen Blog-Beitrag:https://buffer.com/library/social-media-manager-checklist/https://buffer.com/resources/social-media-manager-checklist/Google teilte bei zahlreichen Gelegenheiten mit, dass es keine “Strafe” für doppelten Content gibt, aber dieser Mythos gerät dennoch zunehmend in Vergessenheit.Obwohl man für doppelten Content nicht bestraft wird, kann er dennoch SEO-Probleme verursachen — zum Beispiel:Unerwünschte oder “unfreundliche” URLs in den Suchergebnissen;Verwässerung von Backlinks;Verschwendetes Crawl-Budget;Gescrapter oder syndizierter Content;Wenn du befürchtest, dass du Duplicate Content auf deiner Website haben könntest, führe den Ahrefs Site Audit durch und überprüfe den Duplicate-Content-Bericht. Wenn du Cluster von nahen oder exakten Duplikaten siehst, lohnt es sich durchaus, die Probleme zu beheben.In unserem Anfänger-Leitfaden über Duplicate Content erfährst du, wie du das tun kannst.6. Soziale Signale unterstützen das RankingEs ist nicht abwegig anzunehmen, dass dein Content umso höher ranken wird, je mehr er auf Websites wie Facebook, Twitter und Pinterest geteilt wird. Denn wenn so viele Leuten etwas teilen, muss es doch interessant und wertvoll sein und vor allem wert, gerankt zu werden, oder?Vielleicht, aber laut John Mueller von Google haben soziale Signale keinen direkten Einfluss auf Rankings.https://www.youtube.com/watch?v=WszvyRune14#t=1192Das liegt wahrscheinlich daran, dass soziale Signale so verblüffend leicht zu manipulieren sind. Im Ernst, wirf einen Blick auf Fiverr. Du kannst Tausende von ihnen für wenig Geld bekommen.Aber wenn das wahr ist, warum zeigen dann so viele Studien eine Korrelation zwischen dem Teilen auf Social Media und den Rankings?Es gibt keinen eindeutigen Grund dafür, aber wir denken, dass die folgenden beiden Faktoren die wichtigsten sind, die dazu beitragen:Häufiges Teilen führt zu mehr Engagement, und das führt oft zu mehr Backlinks (die ein Ranking-Faktor sind).Webpages, die auf Google gut ranken, erhalten mehr Traffic, und einige der Besucher werden den Content auf Social Media teilen.7. PPC (Pay per Click) hilft nicht dabei, höher zu rankenUm es klar zu sagen: Bezahlte Google-Anzeigen werden das Ranking nicht direkt beeinflussen. Ich liebe Verschwörungstheorien genauso wie jeder andere, aber Google wird deine Website nicht höher ranken, nur weil du ihnen die Taschen mit Geld vollstopfst.Das bedeutet jedoch nicht, dass PPC (Pay per Click) dir nicht indirekt zu einem höheren Ranking verhelfen kann.Und das liegt daran, dass PPC-Anzeigen dazu beitragen können, Backlinks zu generieren.Kaum zu glauben? Wir haben kürzlich 1.246 Dollar für Google-Anzeigen ausgegeben, mit dem Ziel Links zu generieren. Das Ergebnis? Backlinks von elf neuen Websites.Das bedeutet jedoch nicht, dass du auf eine alte PPC-Kampagne setzen kannst und die Backlinks eintrudeln werden. Es muss strategisch angelegt sein.In diesem Video zeigen wir dir, wie wir vorgegangen sind:https://www.youtube.com/watch?v=Uz2bGhdnJN08. PageRank spielt keine Rolle mehrPageRank ist die Grundlage von Google. Es betrachtet die Quantität und Qualität der Backlinks, um den Wert einer Website zu beurteilen.Google hat bestätigt, dass der PageRank auch 2018 noch ein Ranking-Faktor ist:DYK that after 18 years we’re still using PageRank (and 100s of other signals) in ranking?Wanna know how it works?https://t.co/CfOlxGauGF pic.twitter.com/3YJeNbXLml— Gary 鯨理／경리 Illyes (@methode) February 9, 2017Aber seit Google die öffentlichen PageRank-Ergebnisse 2016 eingestellt hat, sind einige Leute der Meinung, dass wir SEOs nicht mehr über diese Metrik sprechen sollten:Dieses Argument hat zweifellos seine Berechtigung. Schließlich hat es wenig Sinn, über eine Metrik zu sprechen, die wir nicht mehr sehen können. Aber Tatsache ist, dass der PageRank immer noch ein Ranking-Signal ist, was bedeutet, dass es immer noch wichtig ist, qualitativ hochwertige Links zu deinen Webseiten zu erhalten.Dies wird noch durch die Tatsache untermauert, dass das URL-Rating (UR) von Ahrefs gut mit dem Search Traffic korreliert:Wenn du mit UR nicht vertraut bist, ist es unsere Autoritätsmetrik auf Seitenebene, die nach ähnlichen — aber nicht identischen — Prinzipien wie Googles ursprüngliche PageRank-Formel funktioniert.9. Bei SEO dreht sich alles um RankingsJeder will die Nummer eins sein. Das liegt in der Regel daran, dass man davon ausgeht, dass das best gerankte Suchergebnis den meisten Traffic erhält. Dies ist jedoch nicht immer richtig. Unsere Studie von 100.000 Suchanfragen zeigt, dass die best gerankte Webpage nur 49% der Zeit den meisten Search Traffic erhält.Warum? Weil die meisten Pages Traffic über viele Keywords erhalten, nicht nur von einem.Sehen wir uns zum Beispiel die top gerankten Pages für “proteinreiche Ernährung” an. Die Page auf Platz zwei erhält mehr geschätzten Traffic als die Page auf Platz eins, weil sie für mehr Keywords mit höherem Suchbedarf gerankt wird.Die Lektion hier ist, dass es an der Zeit ist, sich nicht mehr über die Top-Rankings zu sorgen, sondern sich stattdessen auf den Traffic zu konzentrieren.Wie das funktioniert, kannst du hier nachlesen. Das sind die Basics:Gehe auf dein Thema detaillierter ein.Generiere mehr Backlinks um die “Autorität” auf Seitenebene zu erhöhen.Finde die Suchintention heraus.10. Keyword-Recherche ist unwichtigAngesichts der Tatsache, dass die meisten Pages für Hunderte oder Tausende von Keywords gerankt werden, ist es kaum verwunderlich, dass manche Leute die Keyword-Recherche für tot halten. Welchen Sinn hat es, ein Keyword zu optimieren, wenn du wahrscheinlich von Hunderten von ihnen Traffic erhalten wirst?Diese Logis ist falsch, denn die Popularität eines Keywords stimmt üblicherweise mit dem allgemeinen Search-Traffic-Potenzial des Themas überein.Sehen wir uns zum Beispiel diese zwei Keywords an:Das zweite Keyword weist die Hälfte des Suchvolumens des ersten aufs. Und wenn wir uns den geschätzten Traffic zu jeder top gerankten Page ansehen, sehen wir, dass das Ranking für das Keyword mit dem höheren Volumen viel mehr organischen Traffic erzielt.Nebenbei bemerkt. Das Suchvolumen ist normalerweise ein guter Indikator für das Traffic-Potenzial, aber nicht immer. Tim erklärt hier mehr.Die Keyword-Recherche trägt auch dazu bei, sicherzustellen, dass deine Keywords auf die beliebteste Art der Suche nach einem Thema ausgerichtet sind. Das ist wichtig, wenn du den größt möglichen organischen Traffic auf deiner Website erzielen möchtest.Mehr über die richtige Keyword-Recherche erfährt du in unserem kompletten Guide zur Keyword-Recherche.FazitHandelt es sich hierbei um eine vollständige Liste von SEO-Mythen? Weit davon entfernt. Dies sind nur einige der häufigsten, auf die ich immer wieder stoße. Deshalb ist es sinnvoll, mit ihnen aufzuräumen.Habe ich andere frustrierende Mythen übersehen? Schreib mir auf Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Joshua Hardwick Head of Content @ Ahrefs (oder, in einfachen Worten, ich bin der Typ, der dafür sorgt, dass jeder Blog-Post EPISCH wird).",
  "headers": [
    {
      "level": "H1",
      "text": "10 SEO-Mythen, die du ignorieren solltest"
    },
    {
      "level": "H2",
      "text": "1. SEO ist tot"
    },
    {
      "level": "H2",
      "text": "2. SEO ist nur eine einmalige Angelegenheit"
    },
    {
      "level": "H2",
      "text": "3. Google rankt nur “frischen” Content"
    },
    {
      "level": "H2",
      "text": "4. Es ist einfacher für Long-Tail Keywords zu ranken"
    },
    {
      "level": "H2",
      "text": "5. Duplicate Content wird bestraft"
    },
    {
      "level": "H2",
      "text": "6. Soziale Signale unterstützen das Ranking"
    },
    {
      "level": "H2",
      "text": "7. PPC (Pay per Click) hilft nicht dabei, höher zu ranken"
    },
    {
      "level": "H2",
      "text": "8. PageRank spielt keine Rolle mehr"
    },
    {
      "level": "H2",
      "text": "9. Bei SEO dreht sich alles um Rankings"
    },
    {
      "level": "H2",
      "text": "10. Keyword-Recherche ist unwichtig"
    },
    {
      "level": "H2",
      "text": "Fazit"
    }
  ],
  "author": "Joshua Hardwick"
}