{
  "url": "https://ahrefs.com/blog/de/suchintention/",
  "slug": "suchintention",
  "title": "Suchintention in der SEO: Was es ist und wie du dafür optimierst",
  "description": "Die Suchintention ist der Grund für eine Suchanfrage. Um gut zu ranken, ist es wichtig, Inhalte zu erstellen, die auf die Suchabsicht abgestimmt sind. Erfahre wie.",
  "content": "Mateusz Makosiewicz Marketingforscher und Ausbilder bei Ahrefs. Mateusz hat über 10 Jahre Erfahrung im Marketing, die er in Agenturen, SaaS- und Hardware-Unternehmen gesammelt hat. Wenn er nicht schreibt, komponiert er Musik oder genießt lange Spaziergänge. Inhalt Die Suchintention ist der Grund für eine Suchanfrage. Mit anderen Worten: Es geht darum, wonach der Suchende sucht, wenn er eine Suchmaschine wie Google benutzt.In diesem Leitfaden erfährst du alles, was du über die Suchintention wissen musst und wie du deine Inhalte darauf abstimmst. Neu bei der Keyword-Recherche? Schau dir unserenEinsteigerleitfaden für die Keyword-RechercheInhaltWarum die Suchintention für SEO wichtig ist?Google legt bei den Suchergebnissen den Schwerpunkt auf Relevanz. Wenn du also bei Google ranken willst, müssen deine Inhalte das relevanteste Ergebnis für die Suchanfrage sein. Das bedeutet in erster Linie, dass du Inhalte erstellen musst, die mit der Suchabsicht der Zielgruppe übereinstimmen.Wenn du zum Beispiel nach „bester Geländewagen“ suchst, wirst du feststellen, dass alle Ergebnisse Geländewagen-Rankings und ‑Bewertungen sind und nicht die Produktseite eines bestimmten Autos.Das liegt daran, dass Google weiß, dass die Nutzer zuerst lernen und dann möglicherweise kaufen wollen.Die Optimierung für die Suchabsicht kann großartige Ergebnisse bringen. Durch die Änderung einer unserer Landing Pages haben wir in weniger als sechs Monaten 516 % mehr Besucher bekommen. Die Landing Page hatte kein gutes Ranking, weil ihr die Funktion eines kostenlosen Tools fehlte. Um die Seite an die Erwartungen der Suchenden für die Suchanfrage „Backlink-Checker“ anzupassen, mussten wir dieses Tool hinzufügen. Wie man die Suchabsicht findet und dafür optimiertSEOs gruppieren die Suchbegriffe in der Regel in eine der drei Kategorien von Suchabsichten:Informationelle Absicht – Suchende wollen etwas lernen. Transaktionelle Absicht – Suchende wollen etwas kaufen.Navigationsabsicht – Suchende sind auf der Suche nach einer bestimmten Website. Diese Suchintentionen sind in der Regel viel zu mehrdeutig, um nützlich zu sein. Zum Beispiel ist die Suchanfrage „beste Heißluftfritteuse“ informativ, denn die Suchenden wollen eindeutig etwas lernen und nicht kaufen. Aber das sagt nichts darüber aus, was sie eigentlich wollen.Wollen sie einen Blogbeitrag oder ein Video?Wollen sie eine Liste mit den besten Optionen oder eine einzige Empfehlung und Bewertung??Legen sie bei der Suche nach Empfehlungen Wert auf etwas Bestimmtes?Wenn du die Antworten auf diese Fragen nicht kennst, ist es unmöglich, die Suchabsicht der Zielgruppe zu erfüllen. Und wenn du nicht auf die Absicht eingehst, sind deine Chancen auf eine Platzierung gering bis gar nicht vorhanden.Deshalb haben wir eine neue (und hoffentlich bessere) Methode zur Klassifizierung von Absichten entwickelt.Hier sind die einzelnen Schritte:Schritt 1. Richte deine Inhalte auf die „drei Cs der Suchabsicht“ ausFür den Anfang musst du die drei Cs der Suchabsicht für dein Ziel-Keyword identifizieren und sicherstellen, dass dein Inhalt darauf abgestimmt ist. Die drei Cs sind:Content-TypContent-FormatContent-BlickwinkelDie Idee dahinter ist, dass es bei der Erstellung von Inhalten für Suchzwecke am sinnvollsten ist, der Masse zu folgen. Wenn zum Beispiel die meisten der Top-Seiten Anleitungen sind, solltest du auch eine Anleitung erstellen. Das bedeutet natürlich nicht, dass du sie komplett kopieren musst.Lass uns diesen Prozess genauer durchgehen.1. Content-TypDies bezieht sich auf den vorherrschenden „Typ“ des Inhalts in den Suchergebnissen und ist normalerweise einer der folgenden:Blog postVideoProdukt-SeiteKategorie-SeiteLandingpageWirf zum Beispiel einen Blick auf die Top-Suchergebnisse für „beste Heißluftfritteuse“ im Keywords Explorer von Ahrefs. Schon ein Blick auf die Titel zeigt, dass der dominierende Inhaltstyp ein Blogbeitrag ist.Das bedeutet, dass die Suchenden keine Seiten erwarten, auf denen die Hersteller von Heißluftfritteusen erklären, warum ihr Produkt das beste ist. Sie wollen die Meinung von jemandem, der verschiedene auf dem Markt erhältliche Optionen getestet hat, bevor sie den Kauf tätigen. Weitere InformationenWie du mit Blogbeiträgen Keywords gezielt ansprichst (und mehr Suchverkehr bekommst)2. Content-FormatDies bezieht sich auf das vorherrschende „Format“ der Seiten, die am besten platziert sind. Das Format der Inhalte bezieht sich in der Regel auf Blogbeiträge.Einige gängige Formate sind die folgenden:LeitfädenSchritt-für-Schritt-AnleitungenListenbeiträgeMeinungsartikelBewertungenVergleicheIn unserem Beispiel der „besten Heißluftfritteuse“ ist das dominierende Inhaltsformat ein Listenbeitrag — sieh dir nur die Titel an:Das bedeutet, dass Suchende eine Liste von Empfehlungen wollen, nicht nur eine einzelne Empfehlung oder eine einzelne Produktbewertung.3. Content-BlickwinkelDer Blickwinkel auf den Inhalt bezieht sich auf das Alleinstellungsmerkmal der am besten platzierten Beiträge und Seiten. Er gibt Aufschluss darüber, worauf Suchende bei dieser speziellen Suche Wert legen.In unserem Beispiel ist „2023“ der vorherrschende Inhaltsaspekt (d.h. die besten Produkte im laufenden Jahr). Auch das sieht man schon an den Titeln. Das bedeutet, dass die Suchenden aktuelle Empfehlungen wollen. Und das macht Sinn, denn es kommen ständig neue Fritteusen auf den Markt.Schritt 2. Finde Unterthemen, die du in deinem Inhalt behandeln kannstUm die Suchabsicht der Nutzer zu erfüllen, musst du dein Thema vollständig abdecken. Die Einbeziehung von Unterthemen, die die Suchenden vielleicht erwarten, ist eine gute Möglichkeit, dies zu erreichen.Im Folgenden findest du zwei Möglichkeiten, um wichtige Unterthemen zu finden.1. Besuche die Top-Ranking-SeitenGemeinsamkeiten zwischen den Top-Ranking-Seiten können dir Hinweise darauf geben, was Suchende zu einem bestimmten Thema erwarten.Wenn wir uns zum Beispiel einige der Top-Blogposts zum Thema „beste Heißluftfritteuse“ ansehen, sehen wir, dass sie die besten Produkte in ihren jeweiligen Kategorien empfehlen. Eine der häufigsten Kategorien ist eine kleine Heißluftfritteuse, die ideal für eine Person ist. Das Vorhandensein verschiedener Produktkategorien ist ein Hinweis darauf, dass die Menschen unterschiedliche Bedürfnisse haben, wenn es um diese Art von Produkt geht. Deshalb ist es wahrscheinlich eine gute Idee, ähnliche Produktkategorien in den Inhalt aufzunehmen.Führe eine der Analyse der Inhalts-Lücke auf Seitenebene durchEine Inhalts-Lücken-Analyse ist ein einfacher, automatisierter Weg, um gemeinsame Unterthemen und Kernpunkte zu finden. Dabei werden die gemeinsamen Keyword-Rankings für die analysierten Seiten aufgelistet. Machen wir zum Beispiel eine Inhalts-Lücken-Analyse für das Keyword „beste Heißluftfritteuse“ in Ahrefs. Dazu müssen wir das Keyword in den Keywords Explorer von Ahrefs eingeben und im Bericht Inhalts-Lücke einige Top-Ranking-Seiten mit der gleichen Suchabsicht öffnen.Wir sehen eine Liste mit häufigen Suchanfragen. Einige von ihnen eignen sich gut als Zwischenüberschriften oder Punkte für unsere Seite. Hier ist ein Auszug aus der Inhalts-Lücken-Analyse:Wenn du also eine Liste der besten Heißluftfritteusen aufstellst, solltest du unter anderem diese Dinge berücksichtigen:Beste günstige OptionBeste Option je nach Fassungsvermögen (klein/groß, Fassungsvermögen von einem Liter)Beste smarte Heißluftfritteuse Pro TippEinige SEOs verwenden die Suchvolatilität als Proxy für die Bestimmung der Klarheit der Suchabsicht. Um die Suchvolatilität zu beurteilen, füge dein Keyword in den Keywords Explorer von Ahrefs ein, scrolle dann nach unten zum SERP-Positionsverlaufsdiagramm und setze die Filter auf „Top 50“ und „letzte 6 Monate“.Keywords, die im Laufe der Zeit wenig oder gar nicht schwanken, sind eine gute Wahl, da sie eine klare Suchabsicht haben…Geringe SERP-Volatilität für die Suchanfrage „Wie man einen Lebenslauf schreibt“.… wohingegen Keywords mit starken Schwankungen in den Rankings weniger „zuverlässig“ zu sein scheinen, weil sich die Suchabsicht häufig ändert.Hohe SERP-Volatilität für das Keyword „Quecksilber“.Abschließende GedankenDie Suchabsicht ist einer der wichtigsten Rankingfaktoren.Wenn du den Suchenden nicht gibst, was sie wollen, sind deine Chancen auf eine Platzierung gering bis gar nicht vorhanden.Wir haben das immer wieder bei den Inhalten gesehen, die wir hier im Ahrefs Blog veröffentlichen.Wenn du langfristig ranken willst, ist das Verständnis der Suchabsicht ein Muss. Mach es dir zur Aufgabe, den Suchenden das zu geben, was sie wollen, und Google (und wahrscheinlich auch andere Suchmaschinen) werden dich dafür mit Sicherheit belohnen.Hast du Fragen oder Kommentare? Ping mich auf Twitter oder Mastodon an. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Mateusz Makosiewicz Mitwirkende Marketingforscher und Ausbilder bei Ahrefs. Mateusz hat über 10 Jahre Erfahrung im Marketing, die er in Agenturen, SaaS- und Hardware-Unternehmen gesammelt hat. Wenn er nicht schreibt, komponiert er Musik oder genießt lange Spaziergänge. Mitwirkende",
  "headers": [
    {
      "level": "H1",
      "text": "Suchintention in der SEO: Was es ist und wie du dafür optimierst"
    },
    {
      "level": "H2",
      "text": "Warum die Suchintention für SEO wichtig ist?"
    },
    {
      "level": "H2",
      "text": "Wie man die Suchabsicht findet und dafür optimiert"
    },
    {
      "level": "H3",
      "text": "Schritt 1. Richte deine Inhalte auf die „drei Cs der Suchabsicht“ aus"
    },
    {
      "level": "H4",
      "text": "1. Content-Typ"
    },
    {
      "level": "H4",
      "text": "2. Content-Format"
    },
    {
      "level": "H4",
      "text": "3. Content-Blickwinkel"
    },
    {
      "level": "H3",
      "text": "Schritt 2. Finde Unterthemen, die du in deinem Inhalt behandeln kannst"
    },
    {
      "level": "H4",
      "text": "1. Besuche die Top-Ranking-Seiten"
    },
    {
      "level": "H4",
      "text": "Führe eine der Analyse der Inhalts-Lücke auf Seitenebene durch"
    },
    {
      "level": "H2",
      "text": "Abschließende Gedanken"
    }
  ],
  "author": "Mateusz Makosiewicz, Joshua Hardwick"
}