{
  "url": "https://ahrefs.com/blog/de/technische-seo-2/",
  "slug": "technische-seo-2",
  "title": "Technische SEO - Leitfaden für Anfänger - SEO Blog by Ahrefs",
  "description": "Bei der technischen SEO geht es darum, deine Website so zu optimieren, dass Suchmaschinen wie Google deine Seiten finden, crawlen, verstehen und indexieren können.",
  "content": "Patrick Stox Patrick Stox ist Produktberater, technischer SEO und Markenbotschafter bei Ahrefs. Er ist Organisator des SEO-Meetups in Raleigh, der SEO-Konferenz in Raleigh, des Beer & SEO-Meetups, der Findability-Konferenz und Moderator bei /r/TechSEO. Article PerformanceData from AhrefsVerlinkung von Websites 2 Sign up for AhrefsGet SEO metrics of any website or URL.The number of websites linking to this post.This post's estimated monthly organic search traffic. Technische SEO ist der wichtigste Teil der SEO — bis sie es nicht mehr ist. Seiten müssen crawlbar und indexierbar sein, um überhaupt eine Chance auf ein Ranking zu haben, aber viele weitere Aktivitäten haben nur einen minimalen Einfluss im Vergleich zu den Inhalten und Links.Wir haben diesen Anfänger-Leitfaden geschrieben, um dir dabei zu helfen, einige der Grundlagen zu verstehen und zu erkennen, worin du deine Zeit am besten investieren solltest, um den Effekt zu maximieren. Es gibt eine Menge zusätzlicher Materialien, die im Artikel verlinkt sind, und sogar noch mehr am Ende des Artikels, mit denen du mehr lernen kannst.Lass uns anfangen.Contents SEO-Leitfaden 1Wie Suchmaschinen funktionieren 2SEO Grundlagen 3Keyword-Recherche 4SEO-Content (EN) 5On-Page-SEO 6Linkbuilding 7Technisches SEO Part 1Technische SEO-GrundlagenDa dies ein Leitfaden für Anfänger ist, lass uns mit den Grundlagen beginnen.Was ist technische SEO?Technische SEO ist der Prozess der Optimierung deiner Website, damit Suchmaschinen wie Google deine Seiten finden, crawlen, verstehen und indexieren können. Das Ziel ist es, gefunden zu werden und die Rankings zu verbessern.Wie kompliziert ist technische SEO?Das kommt darauf an. Die Grundlagen sind nicht wirklich schwer zu meistern, aber technische SEO kann komplex und schwer zu verstehen sein. Ich werde die Dinge in diesem Leitfaden so einfach wie möglich halten.Part 2Crawling verstehenIn diesem Kapitel erfährst du, wie du sicherstellst, dass Suchmaschinen deinen Inhalt effizient crawlen können.Wie Crawling funktioniertCrawler erfassen Inhalte von Seiten und nutzen die Links auf diesen Seiten, um weitere Seiten zu finden. So können sie Inhalte im Web finden. Es gibt ein paar Systeme in diesem Prozess, über die wir sprechen werden.Quelle: GoogleURL-QuellenEin Crawler muss irgendwo anfangen. Im Allgemeinen würde er eine Liste aller URLs erstellen, die er durch die Links auf den Seiten findet. Ein zweitrangiges System, um mehr URLs zu finden, sind Sitemaps, die von Nutzern erstellt werden oder verschiedene Systeme, die Listen von Seiten haben. Crawl-WarteschlangeAlle URLs, die gecrawlt oder neu gecrawlt werden müssen, werden priorisiert und der Crawl-Warteschlange hinzugefügt. Dies ist im Grunde eine geordnete Liste von URLs, die Google crawlen möchte.CrawlerDas System, das den Inhalt der Seiten erfasst.Verarbeitende SystemeDies sind verschiedene Systeme, die sich um die Kanonisierung kümmern, auf die wir gleich noch eingehen werden, die Seiten an den Renderer schicken, der die Seite wie ein Browser lädt, und die Seiten verarbeiten, um weitere URLs zum Crawlen zu bekommen.RendererDer Renderer lädt eine Seite wie ein Browser, auch mit JavaScript- und CSS-Dateien. Dies dient dazu, dass Google sehen kann, was die meisten Nutzer sehen werden.IndexDies sind die gespeicherten Seiten, die Google den Nutzern anzeigt.Crawl-KontrollenEs gibt ein paar Möglichkeiten, wie du kontrollieren kannst, was auf deiner Website gecrawlt wird. Hier sind ein paar Optionen.Robots.txtEine robots.txt-Datei informiert Suchmaschinen darüber, wo sie auf deiner Seite hingehen können und wo nicht.Nur ein kleiner Hinweis. Google indexiert möglicherweise Seiten, die nicht gecrawlt werden können, wenn Links auf diese Seiten verweisen. Das kann verwirrend sein, aber wenn du verhindern willst, dass Seiten indexiert werden, schau dir diesen Leitfaden und das Ablaufdiagramm an, die dich durch den Prozess führen können.Crawl-RateEs gibt eine Crawl-Delay-Anweisung, die du in der robots.txt verwenden kannst, die von vielen Crawlern unterstützt wird und mit der du festlegen kannst, wie oft sie die Seiten crawlen können. Leider respektiert Google dies nicht. Für Google musst du die Crawl-Rate in der Google Search Console ändern, wie hier beschrieben. ZugriffsbeschränkungenWenn du willst, dass die Seite für einige Nutzer zugänglich ist, aber nicht für Suchmaschinen, dann ist eine dieser drei Optionen wahrscheinlich die richtige:Irgendeine Art von Login-System; HTTP-Authentifizierung (bei der ein Passwort für den Zugriff erforderlich ist);IP-Whitelisting (was nur bestimmten IP-Adressen den Zugriff auf die Seiten erlaubt)Diese Art von Set-up ist am besten für interne Netzwerke, Member-only-Inhalte oder für Staging‑, Test- oder Entwicklungsseiten geeignet. Es erlaubt einer Gruppe von Nutzern auf die Seite zuzugreifen, aber Suchmaschinen können nicht auf sie zugreifen und werden die Seiten nicht indexieren.Wie man Crawl-Aktivitäten siehtDie einfachste Möglichkeit, um zu sehen, was Google crawlt, ist der Google Search-Console-Crawl-Stats-Bericht, der dir mehr Informationen darüber gibt, wie deine Website gecrawlt wird.Wenn du alle Crawl-Aktivitäten auf deiner Website sehen willst, musst du auf deine Server-Logs zugreifen und möglicherweise ein Tool verwenden, um die Daten besser zu analysieren. Dies kann ziemlich anspruchsvoll werden, aber wenn dein Hosting ein Control Panel wie cPanel hat, solltest du Zugang zu den Roh-Logs und einigen Aggregatoren wie Awstats und Webalizer haben.Crawl-AnpassungenJede Website hat ein anderes Crawl-Budget. Das ist eine Kombination aus der Häufigkeit, mit der Google eine Seite crawlen will und wie viel Crawling deine Seite zulässt. Beliebtere Seiten und Seiten, die sich oft ändern, werden häufiger gecrawlt, und Seiten, die nicht so beliebt oder gut verlinkt zu sein scheinen, werden weniger oft gecrawlt.Wenn die Crawler beim Crawlen deiner Website Anzeichen von Überlastung feststellen, werden sie das Crawlen verlangsamen oder sogar stoppen, bis sich die Bedingungen verbessern.Nachdem die Seiten gecrawlt wurden, werden sie gerendert und an den Index gesendet. Der Index ist die Hauptliste der Seiten, die bei Suchanfragen ausgegeben werden können. Lass uns über den Index sprechen.Wie man eine XML-Sitemap erstelltRobots.txt und SEO: Alles, was du wissen musstWie man URLs aus der Google-Suche entferntPart 3Die Indexierung verstehenIn diesem Kapitel werden wir erklären, wie du sicherstellst, dass deine Seiten indexiert werden und wie du überprüfen kannst, wie sie indexiert werden.Robots-AnweisungenEin Robots-Meta-Tag ist ein HTML-Snippet, das Suchmaschinen mitteilt, wie sie eine bestimmte Seite crawlen oder indexieren sollen. Er wird in den <head> Abschnitt einer Webseite eingefügt und sieht wie folgt aus:<meta name=\"robots\" content=\"noindex\" />KanonisierungWenn es mehrere Versionen der gleichen Seite gibt, wählt Google eine aus, um sie in den Index aufzunehmen. Dieser Prozess wird Kanonisierung genannt und die URL, die als kanonisch ausgewählt wird, ist diejenige, die Google in den Suchergebnissen anzeigt. Es gibt viele verschiedene Signale, die Google verwendet, um die kanonische URL auszuwählen, darunter:Kanonische TagsDuplizierte SeitenInterne LinksWeiterleitungenSitemap URLsDie einfachste Möglichkeit zu sehen, wie Google eine Seite indexiert hat, ist das URL-Prüftool in der Google Search Console zu nutzen. Es wird dir die von Google gewählte kanonische URL anzeigen. 10 Methoden, um deine Seite von Google indexieren zu lassenMobile-First-Indexing: Was du wissen musstRobots-Meta-Tag & X‑Robots-Tag: Alles, was du wissen musstKanonische Tags: Ein einfacher Leitfaden für AnfängerPart 4Schnelle Erfolge mit technischer SEOEines der schwierigsten Dinge für SEOs ist das Setzen von Prioritäten. Es gibt eine Menge Best Practices, aber einige Änderungen haben einen größeren Einfluss auf deine Rankings und deinen Traffic als andere. Hier sind einige Vorhaben, die ich empfehlen würde, zu priorisieren.Indexierung überprüfenStelle sicher, dass die Seiten, die gefunden werden sollen, in Google indexiert werden können. In den beiden vorherigen Kapiteln ging es nur um Crawling und Indexierung und das war kein Zufall.Du kannst den Indexability Report in Site Audit prüfen, um Seiten zu finden, die nicht indexiert werden können und die entsprechenden Gründe dafür. Er ist kostenlos in den Ahrefs Webmaster Tools.Verlorene Links zurückgewinnenWebsites neigen dazu, ihre URLs im Laufe der Jahre zu ändern. In vielen Fällen enthalten diese alten URLs Links von anderen Websites. Wenn diese nicht auf die aktuellen Seiten umgeleitet werden, sind diese Links verloren und zählen nicht mehr für deine Seiten. Es ist noch nicht zu spät, diese Weiterleitungen vorzunehmen und du kannst den verlorenen Wert schnell zurückgewinnen. Betrachte dies als den schnellsten Linkaufbau, den du jemals machen wirst.Site Explorer -> deinedomain.com -> Seiten -> Beste nach Links -> füge den “404 not found”-HTTP-Response-Filter hinzu. Ich sortiere das normalerweise nach “Verweisende Domains”.So sieht es für 1800flowers.com aus:Wenn ich mir die erste URL in archive.org anschaue, sehe ich, dass dies früher die Muttertagsseite war. Wenn du diese eine Seite auf die aktuelle Version umleitest, würdest du 225 Links von 59 verschiedenen Websites zurückgewinnen und es gibt noch viele weitere Möglichkeiten.Du solltest alle alten URLs auf ihre aktuellen Seiten umleiten, um diesen verlorenen Wert zurückzugewinnen. Interne Links hinzufügenInterne Links sind Links von einer Seite auf deiner Website zu einer anderen Seite auf deiner Website. Diese helfen dabei, dass deine Seiten gefunden werden und dass sie besser ranken. Wir haben ein Tool innerhalb von Site Audit, genannt Link Opportunities, das dir hilft, diese Möglichkeiten schnell zu finden.Schema-Markup hinzufügenSchema-Markup ist ein Code, der den Suchmaschinen dabei hilft, deine Inhalte besser zu verstehen und der viele Funktionen bietet, die deiner Website helfen können, sich in den Suchergebnissen von anderen abzuheben. Google hat eine Suchgalerie, die die verschiedenen Suchfunktionen und das Schema zeigt, das für deine Seite benötigt wird, um in Frage zu kommen.301-Weiterleitungen für SEO: Alles was du wissen musstInterne Links für SEO: Ein praktischer LeitfadenWas ist Schema-Markup? Wie man es für SEO nutztPart 5Weitere technische VorhabenDie Vorhaben, auf die wir in diesem Kapitel eingehen, sind alle empfehlenswert, um sich darauf zu konzentrieren. Sie können allerdings mit mehr Arbeitsaufwand und weniger Nutzen verbunden sein als die Quick-Win-Maßnahmen aus dem vorherigen Kapitel. Das bedeutet nicht, dass du sie nicht durchführen solltest. Es soll dir nur helfen, eine Vorstellung davon zu bekommen, wie du die verschiedenen Vorhaben priorisieren kannst.Page-Experience-SignaleDies sind weniger wichtige Rankingfaktoren, aber immer noch Dinge, die du dir zum Wohle deiner Nutzer ansehen solltest. Sie umfassen Aspekte der Website, die die User Experience (UX) beeinflussen.Core Web VitalsCore Web Vitals sind die Geschwindigkeits-Metriken, die Teil von Googles Page-Experience-Signalen sind und zur Messung der Nutzererfahrung verwendet werden. Die Metriken messen die visuelle Auslastung mit Largest Contentful Paint (LCP), die visuelle Stabilität mit Cumulative Layout Shift (CLS) und die Interaktivität mit First Input Delay (FID).HTTPSHTTPS schützt die Kommunikation zwischen deinem Browser und dem Server davor, von Angreifern abgefangen und manipuliert zu werden. Dies bietet Vertraulichkeit, Integrität und Authentifizierung für die große Mehrheit des heutigen WWW-Traffics. Deine Seiten sollten über HTTPS und nicht über HTTP geladen werden.Jede Webseite, die ein Schloss-Symbol in der Adressleiste aufweist, verwendet HTTPS.MobilfreundlichkeitEinfach ausgedrückt, wird hier geprüft, ob Webseiten richtig angezeigt werden und von Nutzern auf mobilen Geräten leicht zu bedienen sind.Wie kannst du wissen, wie mobilfreundlich deine Seite ist? Überprüfe den “Mobile-Usability”-Bericht in der Google Search Console.Dieser Bericht zeigt dir, ob eine deiner Seiten Probleme bezüglich der Mobilfreundlichkeit hat.Sicheres SurfenDies sind Überprüfungen, um sicherzustellen, dass die Seiten nicht betrügerisch sind, keine Malware und keine schädlichen Downloads enthalten.InterstitialsInterstitials verhindern, dass Inhalte angezeigt werden. Das sind Popups, die den Hauptinhalt verdecken und mit denen der Nutzer möglicherweise interagieren muss, bevor sie verschwinden.Hreflang — für mehrere SprachenHreflang ist ein HTML-Attribut, das verwendet wird, um die Sprache und geografische Ausrichtung einer Webseite anzugeben. Wenn du mehrere Versionen der gleichen Seite in verschiedenen Sprachen hast, kannst du den hreflang-Tag verwenden, um Suchmaschinen wie Google über diese Variationen zu informieren. Dies hilft ihnen, ihren Nutzern die richtige Version zu zeigen.Allgemeine Wartung / Zustand der WebsiteDiese Aufgaben werden wahrscheinlich keinen großen Einfluss auf dein Ranking haben, sind aber im Allgemeinen sinnvoll für das Nutzererlebnis.Kaputte LinksKaputte Links sind Links auf deiner Seite, die auf nicht existierende Ressourcen verweisen — diese können entweder intern (d.h. zu anderen Seiten auf deiner Domain) oder extern (d.h. zu Seiten auf anderen Domains) sein.Du kannst defekte Links auf deiner Website schnell mit Site Audit im Links-Bericht finden. Dieses Tool ist in den Ahrefs Webmaster Tools kostenlos.Redirect-KettenRedirect-Ketten sind eine Reihe von Weiterleitungen, die zwischen der Ausgangs-URL und der Ziel-URL erfolgen.Du kannst Redirect-Ketten auf deiner Website schnell mit Site Audit im Redirects-Bericht finden. Dieses Tool ist in den Ahrefs Webmaster Tools kostenlos. Core Web Vitals: Die Seitengeschwindigkeit ist jetzt noch wichtiger für SEOWie du die Seitengeschwindigkeit vom Start bis zum Ende verbesserst (Leitfaden für Fortgeschrittene)Was ist HTTPS? Alles was du wissen musstHreflang: Ein einfacher Leitfaden für AnfängerPart 6Tools für die technische SEODiese Tools helfen dir, die technischen Aspekte deiner Website zu verbessern.Google Search ConsoleGoogle Search Console (ehemals Google Webmaster Tools) ist ein kostenloser Service von Google, der dir hilft, die Darstellung deiner Website in den Suchergebnissen zu überwachen und Fehler zu beheben.Nutze es, um technische Fehler zu finden und zu beheben, Sitemaps einzureichen, Probleme mit strukturierten Daten zu erkennen und vieles mehr.Bing und Yandex haben ihre eigenen Versionen, ebenso wie Ahrefs. Die Webmaster Tools von Ahrefs sind ein kostenloses Tool, das dir hilft, die SEO-Performance deiner Website zu verbessern. Es ermöglicht dir:Den SEO-Zustand deiner Website zu überwachen100+ SEO-Probleme zu überprüfenAlle deine Backlinks einzusehenAlle Keywords zu sehen, für die du rankstHerauszufinden, wie viel Traffic deine Seiten erhaltenInterne Verlinkungsmöglichkeiten zu entdeckenEs ist unsere Antwort auf die Einschränkungen der Google Search ConsoleDer Mobile-Friendly-Test von GoogleDer Mobile-Friendly-Test von Google überprüft, wie einfach ein Besucher deine Seite auf einem mobilen Gerät nutzen kann. Er identifiziert auch spezifische Probleme bei der mobilen Nutzung, wie z.B. Text, der zu klein ist, um ihn lesen zu können, die Verwendung von inkompatiblen Plugins und so weiter.Der Mobile-Friendly-Test stellt dar, was Google sieht, wenn es die Seite crawlt. Du kannst auch den Rich-Results-Test verwenden, um zu sehen, welchen Inhalt Google für Desktop- oder Mobilgeräte sieht. Die DevTools von ChromeDie Chrome DevTools sind das in Chrome eingebaute Tool zum Debuggen von Webseiten. Nutze es, um Probleme mit der Seitengeschwindigkeit zu beheben, die Rendering-Performance von Webseiten zu verbessern und vieles mehr.Von einem technischen SEO-Standpunkt aus gesehen, bietet es unzählige Möglichkeiten.Die Toolbar von AhrefsDie SEO-Toolbar von Ahrefs ist eine kostenlose Erweiterung für Chrome und Firefox, die nützliche SEO-Daten über die von dir besuchten Seiten und Websites liefert. Die kostenlosen Funktionen sind:On-Page SEO-BerichtWeiterleitungs-Tracker mit HTTP-HeadernÜberprüfung defekter LinksLink-HighlighterSERP-PositionenZusätzlich erhältst du als Ahrefs-Nutzer:SEO-Metriken für jede Website und Seite, die du besuchst, sowie für die Google-SuchergebnisseKeyword-Metriken, wie z.B. das Suchvolumen und die Keyword-Schwierigkeit, direkt in der SERPSERP-Ergebnisse exportierenPageSpeed InsightsPageSpeed Insights analysiert die Ladegeschwindigkeit deiner Webseiten. Neben dem Performance-Score erhältst du auch Handlungsempfehlungen, um die Seiten schneller laden zu lassen.Fassen wir zusammenAll dies kratzt nur an der Oberfläche der technischen SEO. Es sollte dir die Grundlagen vermitteln. Viele der Abschnitte enthalten zusätzliche Links, mit denen du das Thema weiter vertiefen kannst. Es gibt viele andere Themen, die in diesem Leitfaden nicht behandelt wurden, daher habe ich eine Liste zusammengestellt, damit du mehr darüber erfahren kannst.Spezifischer FokusSEO für PDFsBilder-SEOJavaScript-SEOInfrastruktur-bezogenStatus-CodesWeiterleitungenHTTP/2/3CDNsAusgleich der BelastungHTTP HeadersWebsite-bezogenSeitengeschwindigkeitAMPPWAsM.-SeitenParameterbehandlungFacettennavigationPaginierungSeitenlinksCrawl-BudgetEdge-SEO / serverloses SEOSeiten entfernenWebsite-Architektur / TaxonomieURLsProzesseTechnische SEO-AuditsMigrationenAutomatisierung / PythonAnalyse von ProtokolldateienSEO-TestsSonstigesRegexUser AgentsViel Spaß beim Erforschen und Lernen. Melde dich bei mir auf Twitter, wenn du irgendwelche Fragen hast. Article PerformanceData from AhrefsVerlinkung von Websites 2 Sign up for AhrefsGet SEO metrics of any website or URL.The number of websites linking to this post.This post's estimated monthly organic search traffic.Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Patrick Stox Mitwirkende Patrick Stox ist Produktberater, technischer SEO und Markenbotschafter bei Ahrefs. Er ist Organisator des SEO-Meetups in Raleigh, der SEO-Konferenz in Raleigh, des Beer & SEO-Meetups, der Findability-Konferenz und Moderator bei /r/TechSEO. Mitwirkende",
  "headers": [
    {
      "level": "H1",
      "text": "Technische SEO — Leitfaden für Anfänger"
    },
    {
      "level": "H2",
      "text": "Technische SEO-Grundlagen"
    },
    {
      "level": "H3",
      "text": "Was ist technische SEO?"
    },
    {
      "level": "H3",
      "text": "Wie kompliziert ist technische SEO?"
    },
    {
      "level": "H2",
      "text": "Crawling verstehen"
    },
    {
      "level": "H3",
      "text": "Wie Crawling funktioniert"
    },
    {
      "level": "H4",
      "text": "URL-Quellen"
    },
    {
      "level": "H4",
      "text": "Crawl-Warteschlange"
    },
    {
      "level": "H4",
      "text": "Crawler"
    },
    {
      "level": "H4",
      "text": "Verarbeitende Systeme"
    },
    {
      "level": "H4",
      "text": "Renderer"
    },
    {
      "level": "H4",
      "text": "Index"
    },
    {
      "level": "H3",
      "text": "Crawl-Kontrollen"
    },
    {
      "level": "H4",
      "text": "Robots.txt"
    },
    {
      "level": "H4",
      "text": "Crawl-Rate"
    },
    {
      "level": "H4",
      "text": "Zugriffsbeschränkungen"
    },
    {
      "level": "H3",
      "text": "Wie man Crawl-Aktivitäten sieht"
    },
    {
      "level": "H3",
      "text": "Crawl-Anpassungen"
    },
    {
      "level": "H2",
      "text": "Die Indexierung verstehen"
    },
    {
      "level": "H3",
      "text": "Robots-Anweisungen"
    },
    {
      "level": "H3",
      "text": "Kanonisierung"
    },
    {
      "level": "H2",
      "text": "Schnelle Erfolge mit technischer SEO"
    },
    {
      "level": "H3",
      "text": "Indexierung überprüfen"
    },
    {
      "level": "H3",
      "text": "Verlorene Links zurückgewinnen"
    },
    {
      "level": "H3",
      "text": "Interne Links hinzufügen"
    },
    {
      "level": "H3",
      "text": "Schema-Markup hinzufügen"
    },
    {
      "level": "H2",
      "text": "Weitere technische Vorhaben"
    },
    {
      "level": "H3",
      "text": "Page-Experience-Signale"
    },
    {
      "level": "H4",
      "text": "Core Web Vitals"
    },
    {
      "level": "H4",
      "text": "HTTPS"
    },
    {
      "level": "H4",
      "text": "Mobilfreundlichkeit"
    },
    {
      "level": "H4",
      "text": "Sicheres Surfen"
    },
    {
      "level": "H4",
      "text": "Interstitials"
    },
    {
      "level": "H3",
      "text": "Hreflang — für mehrere Sprachen"
    },
    {
      "level": "H3",
      "text": "Allgemeine Wartung / Zustand der Website"
    },
    {
      "level": "H4",
      "text": "Kaputte Links"
    },
    {
      "level": "H4",
      "text": "Redirect-Ketten"
    },
    {
      "level": "H2",
      "text": "Tools für die technische SEO"
    },
    {
      "level": "H3",
      "text": "Google Search Console"
    },
    {
      "level": "H3",
      "text": "Der Mobile-Friendly-Test von Google"
    },
    {
      "level": "H3",
      "text": "Die DevTools von Chrome"
    },
    {
      "level": "H3",
      "text": "Die Toolbar von Ahrefs"
    },
    {
      "level": "H3",
      "text": "PageSpeed Insights"
    },
    {
      "level": "H2",
      "text": "Fassen wir zusammen"
    }
  ],
  "author": "Patrick Stox  Joshua Hardwick Patrick Stox Patrick Stox"
}