{
  "url": "https://ahrefs.com/blog/de/unternehmens-seo/",
  "slug": "unternehmens-seo",
  "title": "Wie du in Unternehmens-SEO erfolgreich sein kannst",
  "description": "Unternehmens-SEO kann durch die Größe des Unternehmens oder der Website, die Komplexität der Technologie oder der Teams oder durch globale Operationen definiert werden.",
  "content": "Patrick Stox Patrick Stox ist Produktberater, technischer SEO und Markenbotschafter bei Ahrefs. Er ist Organisator des SEO-Meetups in Raleigh, der SEO-Konferenz in Raleigh, des Beer & SEO-Meetups, der Findability-Konferenz und Moderator bei /r/TechSEO. Inhalt Unternehmens-SEO kann durch die Größe des Unternehmens oder der Website, die Komplexität der Technologie oder der Teams oder durch globale Operationen definiert werden. Ziel ist es, die Sichtbarkeit für diese Unternehmen in den organischen Suchergebnissen zu erhöhen.Woher weißt du, ob deine Firma als Unternehmen zählt? Ich scherze gerne darüber, dass man weiß, dass es ein Unternehmen ist, wenn jeder eine neue Sprache spricht, die fast ausschließlich aus drei Buchstaben besteht (“Hat der SEO SME den PLP überprüft?”), und es gibt für alles ein eigenes Team.Wenn das nach dem Umfeld klingt, in dem du arbeitest, dann lies weiter, denn ich werde dir Einsichten aus meinen früheren Erfahrungen mitteilen (vier Jahre intern bei IBM und viele Jahre für andere Unternehmen als Agentur und Berater), die dir vielleicht helfen können.Was du wissen musst, um erfolgreich zu seinWie Unternehmens-SEO durchgeführt wirdWas du wissen musst, um erfolgreich zu seinEgal, ob du intern in einem Unternehmen arbeitest oder eine Agentur bist, die mit Unternehmenskunden arbeitet, hier ist, was du wissen musst, um in der Unternehmenswelt erfolgreich zu sein.Dich VerkaufenUnternehmensressourcen und PlanungDaten/ReportingOrganisationAusbildung & EvangelisationDich VerkaufenEgal ob innerbetrieblich oder auf Agenturseite, dein Nummer-Eins-Job ist der Verkauf. Wenn das Unternehmen den Wert von SEO nicht erkennt, werden alle deine Projekte Ressourcen und Prioritäten an das verlieren, was das Unternehmen für wichtiger hält.Was nach meiner Erfahrung funktioniert, sind Mitteilungen, die leicht zu merken sind, zusammen mit Vereinfachung und Wiederholung. Je einfacher es ist, sich daran zu erinnern, worum es bei deinen Projekten geht, desto größer ist die Chance, dass sie an Attraktivität gewinnen. Du wirst vielen Leuten immer und immer wieder die gleichen Dinge sagen. Aber irgendwann werden die Leute SEO besser verstehen, und du wirst wahrscheinlich deine Unterstützer finden, die anfangen, das zu wiederholen, was du gesagt hast, und dich in Projekte einbinden.Ich habe viele Präsentationen mit einigen einfachen Fakten und Statistiken begonnen, die den Leuten helfen, die Wichtigkeit der „Suche“ zu verstehen. Hier sind ein paar Beispiele:Jeder googelt alles. Leute stellen Google Fragen, die sie niemals einer anderen Person stellen würden. Du kannst dies zum Tausch von Daten nutzen, da SEOs mit Tools wie dem Keywords Explorer auf Suchanfragen zugreifen können. Die meisten Kollegen wissen nicht, dass du Daten darüber hast, was die Leute suchen!89% der Recherchierenden im B2B-Bereich nutzen das Internet während des Rechercheprozesses. (Google). Mit anderen Worten, im Grunde jeder.Im Durchschnitt führen Recherchierende im B2B-Bereich durchschnittlich 12 Suchen durch, bevor sie sich auf die Website einer bestimmten Marke einlassen. 71% beginnen mit einer allgemeinen Suchanfrage, also suchen sie zuerst nach einem Produkt und nicht nach dir. (Google). Jede dieser Anfragen ist ein integraler Bestandteil der Kundenreise. Es ist wahrscheinlich, dass die Marken für die sich der Suchende letztendlich entscheidet, die ist, die ihm die Informationen gibt, die er benötigt. Diese Klicks können Marken-Touchpoints sein und bieten die Chance, als Marktführer in deinem Raum gesehen zu werden. Du möchtest jedes Mal zur Stelle sein, wenn jemand nach etwas sucht, das mit deinen Produkten zu tun hat.90,63% der Seiten erhalten keinen organischen Such-Traffic von Google. (Ahrefs). SEO ist harte Arbeit. Man muss sich die Mühe machen, eine Seite erfolgreich zu machen.Die durchschnittliche Top-Ranking-Seite erscheint außerdem in den Top 10 der Suchergebnisse für fast 1.000 weitere relevante Suchbegriffe. (Ahrefs). Dies kann helfen, die Idee zu verkaufen, dass der Inhalt ein Thema vertieft behandeln sollte.Darüber hinaus füge ich gerne einige Statistiken der Firma hinzu. Metriken wie der prozentuale Anteil des Traffics aus der organischen Suche, die Anzahl der Conversions, die Einnahmen oder das Wachstum von Jahr zu Jahr können alle helfen zu zeigen, wie wichtig SEO für das Unternehmung ist. Es ist auch nützlich, die Leute daran zu erinnern, dass SEO ein kontinuierlicher Prozess ist, da viele Leute es als eine einmalige Aufgabe ansehen.Auch hier gilt wieder, dass deine Botschaften haften bleiben müssen, wenn du willst, dass die Leute sich daran erinnern, wer du bist und damit sie sich für SEO interessieren.Unternehmensressourcen und PlanungRessourcen sind nie unbegrenzt. Das gilt unabhängig davon, ob du Teil eines Unternehmensteams oder eine Agentur bist, die mit einem Unternehmen zusammenarbeitet. Es wird große Budgets geben, aber es gibt auch eine Menge zu tun, und Unternehmensteams werden wahrscheinlich insgesamt ziemlich knapp an Ressourcen sein.Es wird länger dauern, die Dinge zu erledigen, und es ist unwahrscheinlich, dass du den neuesten SEO-Trends hinterherlaufen wirst. Wenn du die Grundlagen auf der Unternehmensebene richtig beherrschst, wirst du in den meisten Fällen besser abschneiden als die meisten anderen. Langweilig = €€€, wenn es um Unternehmens-SEO geht.Du wirst viel mehr für die Planung von Ressourcen und Projekten tun müssen. Du wirst eine Jahresplanung oder vielleicht sogar eine Quartalsplanung haben, um dich an den Unternehmenszielen auszurichten. Zeige ihnen, wie SEO hilft, die Unternehmensziele zu erreichen, und du wirst mehr Erfolg haben. Wahrscheinlich wirst du SEO-Prognosen erstellen müssen, wo du in einem Jahr sein wirst und sogar prognostizieren müssen, wo du im Vergleich zur Konkurrenz sein wirst.Du wirst eine Mischung aus verschiedenen Projekten haben wollen, um erfolgreich zu sein. Einige können unternehmensweite Initiativen oder Kooperationsprojekte mit anderen Teams sein, während andere vielleicht spezifisch für dein Team oder sogar für Einzelpersonen sind. Es kann sein, dass du einige Projekte hast, die sich auf die Top-Seiten, einzelne Bereiche der Website, Top-Produkte nach Verkäufen oder eine Reihe anderer Dinge konzentrieren. Teil deiner Aufgabe ist es, Prioritäten zu setzen. Du kannst dich nicht auf alles konzentrieren, denn wenn alles wichtig ist, ist nichts wichtig.Du wirst wahrscheinlich verschiedene Priorisierungsmethoden sehen, die Berechnungen wie „Potential Importance Ease (PIE)“ beinhalten. Ich benutze gerne eine „Impact Effort Matrix“ wie die untenstehende, weil sie visueller ist. Alles mit hoher Auswirkung und geringem Aufwand ist ein schneller Sieg, also nimm diese Aufgaben zuerst in Angriff. Dinge wie das Zurückgewinnen von Links zu deiner Website oder das Hinzufügen von internen Links werden wahrscheinlich auf diese Beschreibung passen. Die Erstellung von Inhalten ist normalerweise immer ein langfristiges Projekt. Weniger wichtige Dinge kommen auf die Auftragsliste, für den Moment wenn du mehr Zeit hast. Und Projekte, bei denen du die Ressourcen nicht rechtfertigen kannst, weil sie mit hohem Aufwand und geringer Wirkung verbunden sind, werden wahrscheinlich nie zustande kommen.Einer der Fehler, den viele SEOs in einer Unternehmensumgebung machen, ist es, sich in „geschäftiger Arbeit“ zu verfangen. Ja, in je mehr Dinge du involviert bist, desto mehr Dinge kannst du abfangen und beeinflussen. Es ist jedoch leicht, sich in einer Position wiederzufinden, in der man nur Kästchen ankreuzt und keine Strategie entwirft. Das Ergebnis sind Mikrogewinne, während man immer noch Makroprobleme hat. Bei Unternehmen dreht sich alles um die Größe, und dazu gehört auch, wie du arbeitest. Du musst dich darauf konzentrieren, was die größte Wirkung hat, was bedeutet, dass du wirklich nicht in jede Aufgabe oder jeden Prozess involviert sein solltest.Daten/ReportingDie Berichterstattung kann auf Unternehmensebene ein kolossaler Zeitfresser sein, aber es ist ein notwendiges Übel. Wenn du den Wert deiner Arbeit nicht beweisen kannst und wie sie zum Unternehmen beiträgt, wird niemand die Wichtigkeit von SEO erkennen. Du wirst wahrscheinlich Berichte in PowerPoint, Dashboards und vielleicht sogar in internen Tools erstellen.Das Wichtigste, woran du denken solltest, ist, deinen Bericht so anzupassen, dass er das enthält, was dein Zuhörerkreis für wichtig hält. Du hast vielleicht SEO-KPIs, die für dein Team wichtig sind, aber andere Teams werden sich wahrscheinlich mehr auf Conversions und Einnahmen konzentrieren. Es ist wahrscheinlich, dass je höher du kommst, desto mehr Leute einfach nur eine Zahl wollen, die ihnen sagt, wie die Dinge laufen. Wahrscheinlich wirst du auch die Häufigkeit der Berichte anpassen müssen, da einige von euch Echtzeit-Berichte wollen und andere vielleicht nur monatliche, vierteljährliche oder jährliche Berichte wollen.Zahlen können einprägsam sein und helfen, Ideen in Präsentationen zu verkaufen, aber du solltest dich bei der Berichterstattung mehr auf Visualisierungen konzentrieren, die leicht zu verstehen sind. Je einfacher diese zu verstehen sind, desto einprägsamer werden sie sein. Ein schnelles Kuchendiagramm, das zum Beispiel markenorientierten- vs. nicht markenorientierten Traffic zeigt, zeigt wahrscheinlich, dass die meisten organischen Besucher von markenorientierten Begriffen kommen, und du solltest stärker auf nicht markenorientierte Begriffe fokussiert sein.Du wirst auch eine Übersicht für Teams mit verschiedenen Tools und Daten erstellen wollen, auf die du Zugriff hast. Du musst daran denken, dass sie wahrscheinlich nichts über die Tools, Metriken oder Daten wissen, die du hast, und du weißt vielleicht nicht, welche Daten sie brauchen, um Entscheidungen zu treffen. Triff dich mit ihnen und finde heraus, was sie brauchen. Einige der Dinge, die SEOs für einfach halten, wie z.B. Keyword-Daten, können für andere Teams äußerst nützlich sein und ihnen helfen, fundierte Entscheidungen zu treffen. Share of Voice wird für Führungskräfte und Produktteams nützlich sein, um sie über ihre Marktposition zu informieren. Teams für Paid-Search und Produkte möchten vielleicht die Verbreitung von organischen, bezahlten und No-Click-Suchen sehen, wie wir sie im Keywords Explorer zeigen.Suchen ohne Klicks 65%Bezahlte Klicks 3%Organische Klicks 32% März 2017 – Dez. 2019Ein letzter Tipp für das Reporting ist, den Erfolg von Projekten mit einer Gruppe zu nutzen, um sie unternehmensweit zu bewerben und auszuweiten. Erzählt, wie ihr mit dem Team gearbeitet habt, was gut gelaufen ist, was ihr gelernt habt und wie ihr denkt, dass sich der Prozess in Zukunft ändern sollte. Das Storytelling trägt wesentlich dazu bei, die Akzeptanz zu fördern. Du kannst auch Pluspunkte sammeln, indem du andere zum Helden machst; schreibe ihnen gutes Feedback und Peer-Reviews, und sie werden in Zukunft eher bereitwillig mit dir zusammenzuarbeiten.OrganisationUnternehmensorganisationen neigen dazu, kompliziert zu sein. Du wirst wahrscheinlich viele Managementketten und eine Menge Komplexität erlernen müssen, bevor du bei einigen Projekten Fortschritte machen kannst. Sich in den richtigen Teams und mit den richtigen Leuten zu orientieren, kann einige Zeit in Anspruch nehmen, und externe Teams müssen sich möglicherweise auf das interne Team verlassen, um einen Großteil dieses Wissens zu erlangen.Deine Team OrganisationSEO-Teams können in vielen verschiedenen Organisationen sitzen — Marketing, Analytik, Produkt, Entwicklung, Content, Digital, etc. Ich glaube nicht, dass es eine richtige oder falsche Antwort darauf gibt, wo SEOs sein sollten, und vieles hängt von der Organisationsstruktur des Unternehmens selbst ab. Egal, wo du sitzt, du wirst wahrscheinlich mit all diesen Teams und darüber hinaus arbeiten. Wo dein Team sitzt, kann sich im Laufe der Zeit sogar ändern, wenn Unternehmen sich reorganisieren oder mit anderen Firmen fusionieren.Andere TeamsFür jede Aufgabe, für die eine SEO-Agentur zuständig sein könnte, gibt es wahrscheinlich ein Team, das dies auf Unternehmensebene tut. Du wirst wahrscheinlich auf Teams stoßen, von denen du noch nie etwas gehört hast, wie z.B. Taxonomie/Ontologie, und du wirst mit Teams arbeiten, an die du nicht gedacht hättest, wie z.B. Events, Markenaufbau oder Recht.In vielen Fällen wirst du mit diesen Teams an verschiedenen Projekten arbeiten, oder du brauchst Genehmigungen, um erfolgreich zu sein. Du solltest so viel Einblick wie möglich in das haben, woran im Unternehmen gearbeitet wird, und sicherstellen, dass diese Teams wissen, dass es dich gibt und dich bei Bedarf einbeziehen.Du wirst feststellen, dass viele dieser Teams wöchentliche Meetings, Bürozeiten, Networking-Events und sogar ‚Lunch and Learns’ haben. All dies sind großartige Möglichkeiten zu lernen, wer was macht und woran sie arbeiten. Wahrscheinlich solltest du all diese Dinge auch für SEO haben. Donuts, Pizza und Bier werden dir helfen, Leute kennenzulernen, aber die Lernkomponenten und das Teilen von Informationen werden dir helfen, unvergesslich zu bleiben.Ich war immer sehr opportunistisch in meinem SEO-Ansatz und versuchte, mit Teams zu arbeiten, wenn sie bereit waren, an Projekten zu arbeiten. Wenn du diese Chance verpasst, könnte es eine Weile dauern, bis sie wieder bereit sind, mit dir zu arbeiten.ExternDu wirst wahrscheinlich eine Agentur oder Agenturen haben, die mit dir an verschiedenen Dingen arbeiten. So wie ich das am besten verstanden habe, ist es am besten, wenn Agenturen die Lücken in deinem Team füllen. Vielleicht ist das mehr Routinearbeit, spezielle Aufgaben, mit denen dein Team vielleicht nicht viel Erfahrung hat, oder einfach zusätzliche Ressourcen bereitzustellen, damit dein Team mehr leisten kann.Wenn du eine Agentur bist, ist mein bester Ratschlag, flexibel zu sein und das zu tun, was von dir in dem Moment erwartet wird. Deine Aufgabe ist es, die Person oder das Team im Haus gut aussehen zu lassen, sie zu fördern und ihnen mehr Ressourcen zu verschaffen.Training & EvangelisationJe mehr du mit anderen teilst und sie ermächtigst, desto einfacher wird dein Leben in einem Unternehmen sein. Denke daran, dass du Ressourcenbeschränkungen hast, also trainiere Leute und finde deine Evangelisten, die an SEO glauben und helfen, SEO zu fördern. Das wird dir helfen, deinen Einfluss zu vergrößern.All die Dinge, die ich vorhin erwähnt habe, wie wöchentliche Meetings, Bürozeiten, Networking-Events und ‚Lunch and Learns’ sind großartig für Training und Evangelisation. Aber du kannst auch individuelle Teamtrainings, Gruppentrainings, Workshops und interne Kurse durchführen, die sich auf verschiedene Themen oder Tools konzentrieren. Suche nach Gelegenheiten, eine Einheit zu Firmenveranstaltungen/Workshops/Schulungen hinzuzufügen, die vielleicht von anderen Teams veranstaltet werden. Es wird wahrscheinlich Veranstaltungen geben, die auf Marketing, Entwicklung, Analyse oder anderer Bereiche ausgerichtet sind, in denen SEO ein relevantes Thema sein kann. Vielleicht sogar einen E‑Mail-Newsletter mit Neuigkeiten aus dem Unternehmen und der SEO-Branche starten, den die Leute nützlich finden würden. Jede Chance, dein Fachwissen zu zeigen, wird deinem SEO-Projekt zum Erfolg verhelfen.Wie Unternehmens-SEO durchgeführt wirdEines der interessantesten Dinge bei der Arbeit in Unternehmens-SEO ist, dass man ein nie endendes Angebot an Möglichkeiten hat. Du hast viel mehr Freiheit zu wählen, was du für wichtig hältst und was die größte Wirkung haben wird. Viele Unternehmen stellen Projekte oder Teams zusammen, die sich um einige der Kernprinzipien der SEO, Inhalte, Links und technische SEO, kümmern.Arbeiten mit Inhalten/AssetsLinks aufbauen und erstellenTechnisches SEOArbeiten mit Inhalten/AssetsEs gibt ein Missverständnis, dass große Websites mit hoher DR für jedes Keyword gerankt werden können. Die Realität ist, dass viele Unternehmens-Websites einen großen Teil ihres gesamten Traffics über Marken-Suchanfragen erhalten und dass sie bei nicht markengebundenen Begriffen möglicherweise kein gutes Ranking erzielen. Zum Beispiel hat apple.com einen DR von 97, was sie zu einer der stärksten Websites in unserem Index macht. Der meiste Traffic kommt von Markenbegriffen, und es mag dich überraschen, dass sie nicht für Begriffe wie „Smartphone“ gerankt werden. Tatsächlich kommen laut dem Site Explorer von Ahrefs über 41 Millionen US Bio-Besuche von Markenbegriffen. Das ist über die Hälfte ihres geschätzten organischen US-Traffics.Ich sage nicht, dass markengebundener Traffic schlecht ist, weil er es nicht ist. Er ist qualitativ hochwertig und konvertiert gut, und es gibt wahrscheinlich viele markenunabhängige Möglichkeiten für diese Seiten. Aber sie müssen sich trotzdem anstrengen und die Dinge richtig machen, wie jeder andere auch, wenn sie erfolgreich sein wollen.Verkäufe sind für die meisten Unternehmen lange Funnels. Trotzdem wollen viele Firmen die Top-of-the-Funnel und Informationsinhalte überspringen und sich mehr auf das Ende des Funnel-Verkehrs konzentrieren, der konvertiert. Dadurch verengen sie ihre Pipeline und geben ihren Konkurrenten die Möglichkeit, als Experten gesehen zu werden und statt ihnen selbst den Menschen zu helfen. Ebenso vernachlässigen viele Unternehmen die Nutzer nach dem Kauf. Dies führt zu verpassten Gelegenheiten im Fürsprecherbereich und auch im Upselling/Cross-Selling.Optimierung bestehender InhalteWahrscheinlich wirst du auf Inhalte stoßen, die zu sehr marken‑, produkt- oder sogar keyword-orientiert sind. Leute möchten nach Begriffen mit Seiten ranken die von ihnen kontrolliert werden aber nicht mit der Suchabsicht übereinstimmen. Ein gutes Beispiel ist jemand, der möchte, dass seine Produktseite für einen Informationsbegriff gerankt wird.Es gibt Zeiten, in denen du vielleicht Inhalte für Markenbegriffe optimieren und sogar erstellen möchtest, aber das sollte nicht deine übliche Strategie sein. Ebenso wenig solltest du „ein paar Keywords“ in marken- oder produktbezogene Seiten einstreuen, um zu versuchen, nach Informationsbegriffen zu ranken. Diese Seiten sind möglicherweise voll von Marketing- oder Verkaufsjargon und haben nicht den Inhalt, den du für ein Ranking brauchst. Deine beste Strategie wird sein, den Inhalt zu erstellen, von dem du weißt, dass er benötigt wird. Das bedeutet, eine Content-Strategie zu haben, um neue Seiten zu erstellen, die mit der Suchabsicht übereinstimmen.In anderen Fällen möchtest du vielleicht bestehende Inhalte aktualisieren, die bereits gut funktionieren. Du solltest sicherstellen, dass der Inhalt mit dem übereinstimmt, wonach die Leute suchen und wovon andere Top-Seiten handeln. Mache den Inhalt besser, indem du die Experten in deinem Unternehmen findest und dir deren Erkenntnisse einholst; die Art von Erkenntnissen, die andere Inhalte möglicherweise nicht abdecken.Ein üblicher Weg, Inhalte zu priorisieren, ist es, nach niedrig hängenden Chancen zu suchen, wie z.B. Seiten, die für dein Haupt-Keyword auf den Positionen 6–10 oder 11–20 platziert sind. Vielleicht kannst du den Inhalt dieser Seiten schnell verbessern, um ein höheres Ranking und mehr Traffic zu erhalten. Benutze die Google-Suchkonsole oder den Bericht Organische Keywords im Site Explorer, um Seiten zu finden, die dazu passen.Inhalte erstellenWenn du Inhalte erstellst, finde einen Prozess, der für dein Unternehmen und die Ersteller von Inhalten am besten funktioniert. Ich spreche gerne mit den Experten oder interviewe sie, um ihre Erkenntnisse zu erhalten. Ich schaue mir auch an, was die Leute rund um ein Thema suchen und was andere Seiten behandeln. Wahrscheinlich hast du ein Team von Leuten, die die Inhalte erstellen, und du kannst sie vielleicht dazu anleiten, diesen Prozess selbst durchzuführen. Alternativ dazu kannst du ihnen eine einfach zu verdauende Gliederung oder eine Inhaltsübersicht zur Verfügung stellen, die das abdeckt, was du in dem Artikel zu sehen erwartest.Wenn deine Mitarbeiter Inhalte schreiben wollen, musst du einen Weg finden, sie dazu zu befähigen. Das sind deine Experten, und auch wenn die Inhalte, die sie erstellen, ein wenig bearbeitet werden müssen, sind die Erkenntnisse dieser Mitarbeiter wertvoll und vielleicht nirgendwo anders zu finden. Wenn deine Experten nicht die Zeit haben, Inhalte zu schreiben, ist eine andere Möglichkeit, sie zu befragen. Die meisten Leute sind in der Regel froh, schnelle Einblicke mündlich zu geben, die du dann in deinen Inhalten verwenden kannst.Ich fange lieber mit den Top-Seiten meiner Konkurrenten an, als die Recherche mit einer Liste von Keywords zu beginnen. Wenn du diese Daten exportierst und kombinierst, bekommst du am Ende eine Liste mit den erfolgreichsten Inhalten deines Konkurrenten, und du kannst mit den Inhalten beginnen, von denen du weißt, dass sie bereits funktionieren und wahrscheinlich Wert für einen Konkurrenten haben. Jedes Team, mit dem ich je ge arbeitet habe, ob produkt- oder marketingorientiert, hat diese Daten gern gesehen. Du kannst sie im Bericht über die Top Seiten im Site Explorer finden.Das Erstellen von Inhalten muss einfach, wiederholbar und skalierbar sein, und ihr werdet so viel wie möglich von der „Reise des Benutzers (Customer Journey“ abdecken wollen. Denke daran, dass Inhalte für Menschen sind, also solltest du für die verschiedenen Dinge, nach denen sie suchen, da sein. Sei nützlich, sei relevant, zeige dein Fachwissen und du bist wahrscheinlich das Unternehmen, mit denen potenzielle Kunden Geschäfte machen wollen.Eines der Dinge, die ich gerne mit Content-Teams verwendet habe, war eine Kartensortierungsübung. Nimm die Daten, die du dir ansiehst, über das, was die Leute suchen und worüber die Top-Seiten handeln, und schreib sie auf Karteikarten. Lass deine Content-Autoren das so organisieren, dass es für sie Sinn macht. Sie werden deine Daten in Themen und Unterthemen gruppieren und sich die Inhaltsabschnitte oder Seiten ausdenken, die sie schreiben sollen. Das hilft dabei, die Leute zu trainieren, diese Aufgabe selbst zu erledigen, und es gibt keine richtige oder falsche Antwort darauf, wie sie organisiert werden sollte. Du kannst auch zeigen, wie die Top-Seiten diese Informationen abdecken, als Bestätigung, dass es funktioniert.Ein weiterer Tipp zur Inhaltserstellung ist die Übersetzung erfolgreicher Inhalte. Die meisten Unternehmen sind in vielen Ländern und in vielen verschiedenen Sprachen tätig. Wenn du Inhalte hast, die in einer Sprache gut funktionieren, werden sie wahrscheinlich auch in einer anderen Sprache gut funktionieren. Wir haben kürzlich damit begonnen, dies mit unseren Inhalten zu tun. Obwohl wir nur minimale Ressourcen für diesen Prozess bereitstellen, sehen wir bereits Ergebnisse.Organisches Traffic-Wachstum unseres spanischen Blogs in den letzten 16 Monaten.Ein letzter Tipp: Schaue dir an, welche Werbekanäle dir durch andere Teams zur Verfügung stehen. So können zum Beispiel Social-Media-Teams für neue Inhalte werben, und Paid-Media-Teams können sie mit Werbung und durch Syndikation ankurbeln. Stelle immer sicher, dass du ein Budget für die Promotion von Inhalten hast.Syndikation von Inhalten (Content Syndication)Bei größeren Websites wirst du wahrscheinlich auf etwas stoßen, das du vielleicht noch nie zuvor gesehen hast: Syndikation von Inhalten (Content Syndication). Content Syndication ist, wenn eine oder mehrere Websites Dritter eine exakte Kopie von Inhalten wiederveröffentlichen, die ursprünglich anderswo erschienen sind. Das kommt häufig bei Nachrichteninhalten vor, obwohl, um ehrlich zu sein, jede populäre Seite wahrscheinlich Scraper und eine kostenpflichtige Syndizierungsstrategie haben wird. Die Syndikation hat viele Vorteile, inklusive einer erhöhten Reichweite. Schaue dir unseren Beitrag über Content Syndication an, um mehr darüber zu erfahren und damit du weißt, wie du am besten vorgehen solltest.Links aufbauen und erstellenEine großer Teil des Linkaufbaus geschieht auf Unternehmensebene ohne SEO. Firmen sind normalerweise sehr aktiv und machen verschiedene Dinge. Du siehst vielleicht Fernsehwerbung, hörst Radiospots, hast viele neue Inhalte. Dann gibt es noch Public Relations, Social Media, bezahlte Werbung, Content Syndication, Events, Firmenpartnerschaften, Influencers, Promi-Werbung, Affiliate-Programme und vieles mehr. Die meisten Links werden wahrscheinlich auch ohne dich zustande kommen, aber du kannst dabei helfen, viele der Teams, die für diese Kanäle zuständig sind, mit bewährten Methoden anzuleiten.Externe LinksWenn du Linkaufbau-Projekte durchführst, hast du vielleicht ein paar schnelle Gewinne. Einer meiner Favoriten ist es, Links, die bereits auf deine Seite zeigen, einfach zurückzufordern, indem du Seiten umleitest, die derzeit eine 404-Antwort aufweisen.Site Explorer > deinedomain.de > Seiten > Best by Links > füge ein “404 not found” HTTP response filter hinzu > diese Seiten auf relevante aktuelle Seiten umleiten. Nicht verlinkte Erwähnungen der Marke oder sogar Erwähnungen von Top-Angestellten sind ein weiterer leichter Sieg. Über Unternehmen wird oft viel geredet, und jede dieser Erwähnungen bietet die Chance, einen Link zu bekommen. Auch wenn es anfangs keinen Link gibt, schadet es nicht, nach einem zu fragen. Du kannst den Content Explorer verwenden, um diese Erwähnungen im Web zu finden, und den eingebauten Filter zum Hervorheben nicht verlinkter Domains, um sich auf nicht verlinkte Erwähnungen zu konzentrieren.Möglicherweise arbeitest du am Ende auch mit externen Seiten wie Bewertungsplattformen oder Aggregatoren zusammen. Viele von diesen kosten Geld, und die Links sind nicht immer wertvoll. Aber sie können für die Sichtbarkeit unglaublich sein. Diese Sites rangieren für viele relevante Begriffe, und viele andere Unternehmensprofis werden wahrscheinlich ihre Reports ansehen. In vielen Fällen kann es sein, dass du, wenn du nicht an diesen Übersichten vorkommst, nicht in die Überlegungen für einen Kauf einbezogen wirst.Du kannst auch den Site Explorer benutzen, um die Links deiner Konkurrenten und verweisenden Domains zu überprüfen. Du kannst ihr gesamtes Linkprofil oder sogar ihr aktuelles Linkprofil ansehen, um zu sehen, wie sie ihre Links erhalten oder erstellen. Mit diesen Daten kannst du auch feststellen, ob es noch etwas anderes gibt, was du für den Linkaufbau unternehmen möchtest.Als Unternehmen hast du eine fast unbegrenzte Anzahl von Linkaufbau-Möglichkeiten. Alles hängt von deinem Budget und deiner Vorstellungskraft ab, aber wenn mich Leute nach dem wichtigsten Unterschied beim Linkaufbau auf Unternehmensebene fragen, sage ich ihnen normalerweise, dass es sich um Übernahmen handelt. Der einfachste Weg, sich für etwas Neues zu bewerben, ist es, ein Unternehmen zu kaufen, das für deine Zielbedingungen bereits gut platziert ist. Du fügst nicht nur ein Produkt/eine Dienstleistung oder neue Funktionen zu deinen Produkten hinzu, sondern du erbst auch den bestehenden Inhalt, was wahrscheinlich mit ein Grund dafür war, dass das übernommene Unternehmen bereits erfolgreich war.Mit diesen Akquisitionen oder anderen Websites, die dein Unternehmen möglicherweise kontrolliert, hast du auch Möglichkeiten für weitere Links. Wo es sinnvoll ist, wirst du Links zwischen diesen Websites hinzufügen wollen. Letztendlich möchtest du vielleicht die Inhalte auf einer Seite zusammenfassen, aber das ist nicht immer machbar. Selbst wenn dies der Fall ist, kann es sein, dass es nicht innerhalb eines vernünftigen Zeitrahmens geschieht, so dass du in der Zwischenzeit vielleicht Links zwischen den Seiten hinzufügen möchtest.Interne LinksIch fand immer, dass interne Links ein guter Weg sind, um Seiten einen höheren Rang zu verschaffen. Sogar diese Links können in einer Unternehmensumgebung schwer zu bekommen sein. Manchmal sind verschiedene Personen für verschiedene Bereiche der Website verantwortlich, was die interne Verlinkung zeitaufwändig machen kann.Abgesehen von den politischen Hürden kann der Prozess der internen Verlinkung ein wenig kompliziert sein. Entweder muss man die Website gut kennen und verschiedene Seiten durchlesen, um nach Verlinkungsmöglichkeiten zu suchen, oder man kann einem Prozess folgen, der viel Scraping und Crawling beinhaltet, um Möglichkeiten zu finden.Bei Ahrefs haben wir dies einfach, skalierbar und zugänglich gemacht, damit jeder diese Möglichkeiten finden kann. Wir haben einen Bericht über interne Link-Gelegenheiten im Site Audit, der gegebenenfalls interne Links empfiehlt.Im Bericht selbst gibt es ein Tutorial, das erklärt, wie es funktioniert.Ich würde auch empfehlen, nach Gelegenheiten Ausschau zu halten, um bessere Link-Anker-Texte zu verwenden. Es kommt häufig vor, dass Seitenersteller allgemeinen Link-Anchor-Text wie „Mehr erfahren“, „Mehr lesen“ oder „Hier klicken“ zu oft verwenden. Du kannst im Bericht Interne Backlinks im Site Explorer nach der Verwendung dieser Art von generischem Text suchen..StrafenIch bin mir nicht sicher, ob ich jemals eine große Website gesehen habe, die nicht wenigstens ein paar Strafen pro Jahr bekommt. Auch wenn dies für manche Leute überraschend sein mag, passiert es doch, weil viele dieser Seiten Leute haben, die Uploads missbrauchen oder nutzergenerierte Inhaltsbereiche haben, auf denen Leute Links spammen. Normalerweise ist das kein Problem, da die Strafen normalerweise nur Teile der Seite betreffen. Bei einigen Websites gibt es jedoch bedeutendere Probleme. Wenn dies bei einer bekannten Marke passiert, schafft es das normalerweise in die Nachrichten.Technisches SEOUnternehmens-Websites können komplexe Infrastrukturen und eine Menge veralteter Systeme haben. Es kann sogar viele verschiedene Teams geben, die für die Wartung von allem verantwortlich sind, was bedeutet, dass das technische Umfeld und das politische Umfeld knifflig sein können. Manchmal haben Seiten oder Bereiche der Site Probleme, die nie behoben werden, weil das zu teuer ist.Ein Fehler kann Millionen von Seiten aus dem Index heraushalten oder eine ganze Site aus den Suchergebnissen entfernen. Es gibt so viele bewegliche Teile, so viel, was schief gehen kann, und du wirst so oft die am wenigsten schlechte Option wählen müssen. Du wirst nicht die Kontrolle über alles haben. Tu einfach das Beste, was du kannst, und wenn du die Gelegenheit dazu hast, triff die zukunftssicherste Entscheidung, die du treffen kannst.Wenn du dich auf technische Projekte konzentrierst, wirst du wahrscheinlich eine unbegrenzte Anzahl von Dingen haben, die um deine Aufmerksamkeit kämpfen. Du musst lernen, Prioritäten bei den Aufgaben zu setzen und dich auf die wichtigsten Themen zu konzentrieren. Es wäre zwar toll, wenn du alles technisch perfekt machen könntest, aber es ist einfach nicht realistisch. Eines der Dinge, die ich an Ahrefs Site Audit mag, ist, dass man sich dafür entscheiden kann, Themen zu ignorieren, die man nicht für wichtig hält.In der Welt der Unternehmen wirst du dich wahrscheinlich auf viele verschiedene Teams verlassen, um deine Arbeit zu erledigen. Du wirst opportunistisch sein müssen und vielen dieser Teams innerhalb ihres eigenen Zeitplans helfen müssen, wenn sie bereit sind, loszulegen, aber das bedeutet nicht, dass du dich nicht schon im Voraus auf sie vorbereiten kannst. Du wirst herausfinden wollen, wie diese Teams arbeiten, ihre Prozesse und Werkzeuge, und Gelegenheiten, bei denen du mit ihnen interagieren kannst, wie z.B. Scrum Calls, Team Calls oder Bürozeiten, denen du vielleicht beiwohnen kannst. Wenn du sehr klar in deiner Kommunikation mit dem Team sein kannst, wird das den Prozess sehr viel einfacher machen. Lerne, Tickets in ihrem Projektmanagementsystem zu schreiben, das das Problem, die erwarteten Ergebnisse und den Wert der Umsetzung der Änderungen kommuniziert.Ein letzter Tipp: Wenn du scheinbar keine Fortschritte bei den Projekten machst, versuche, die Änderungen, die du machen willst, als A/B‑Test zu verkaufen. Viele Firmen wollen mehr Tests machen, und du kannst deine Änderungen „testen“, um zu sehen, welche Auswirkungen sie haben. Mit einer messbaren Auswirkung kannst du für eine dauerhaftere Lösung plädieren.Projekt IdeenIch möchte über einige Projekte sprechen, um dir den Einstieg in das Technische SEO in einem Unternehmen zu erleichtern.Indexing. Du hast wahrscheinlich einige Seiten indiziert, die nicht indiziert werden sollten, und viele Seiten, die nicht indiziert sind, die indiziert werden sollten. Die Kanonisierung ist ein weiteres Problem, das man überprüfen sollte, um sicherzustellen, dass die richtige Version der Seite indiziert ist. Du kannst auch bei der Identifizierung von Sicherheitsproblemen und Datenlecks helfen, indem du dir ansiehst, welche Seiten versehentlich indiziert wurden.Redirects. Finde defekte Seiten auf deiner Website, auf die Links zeigen, und leite diese Seiten dann um.Zukunftssicherung. Alles, was du tun kannst, um zu verhindern, dass in Zukunft etwas zerbricht oder Prozesse oder Systeme sich in Zukunft wieder ändern, ist es wert, dass du dich damit beschäftigst.Defekte Links. Finde und repariere sie.Pagespeed. Mache deine Website schneller.Schema-Markup implementieren um mehr Präsenz in den SERPs zu gewinnen.Sitemaps hinzufügen. Ich würde dafür sorgen, dass dies automatisiert wird. Manuelles Erstellen einer Sitemap ist selten eine kluge Nutzung deiner Zeit.Richtlinien, Checklisten und Entscheidungsbäume erstellen. Im Grunde genommen wird dir alles, was den Menschen hilft, die richtigen Entscheidungen zu treffen, in Zukunft Zeit sparen.Automatisierte Tests und die Überwachung der Seite können dabei helfen, Probleme zu erkennen, bevor sie in das System gelangen oder kurz danach.Log File Analyse. Ich sage immer, das ist ein großes Vielleicht. Logfiles können politisch, technisch aufwendig zu ziehen und zu speichern und kostspielig sein. Du musst den Zeit- und Ressourcenbedarf abschätzen, um zu sehen, ob deine Anwendungsfälle die Ressourcen rechtfertigen.Abschließende GedankenEs steht so viel auf dem Spiel bei Unternehmens-SEO und es gibt so viele Möglichkeiten. Lass dich nicht entmutigen, wenn du keine Fortschritte machst. Versuche einfach einen anderen Weg und gib niemals auf, und du wirst Fortschritte machen. Wenn ein Unternehmen und seine Leute endlich hinter SEO stehen, können sie eine Branche dominieren.In diesem Artikel wollte ich etwas von meiner Erfahrung in der Unternehmenswelt vermitteln, und einige Dinge, von denen ich glaube, dass sie hilfreich sein können. Ich hoffe, es sind wertvolle Informationen für einige von euch, die ihn lesen.Wenn du irgendwelche Tipps, Erfahrungen, die du gerne teilen möchtest oder Fragen hast, lass es mich auf Twitter wissen.Über­set­zt von sehrausch.de: Such­­maschi­­nen– & Con­ver­­­­sion-Opti­mierung, Online-Mar­ket­ing & Paid-Adver­tis­ing. Pass­ge­nau aus ein­er Hand. Article PerformanceData from AhrefsVerlinkung von Websites 2 Sign up for AhrefsGet SEO metrics of any website or URL.The number of websites linking to this post.This post's estimated monthly organic search traffic.Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Patrick Stox Patrick Stox ist Produktberater, technischer SEO und Markenbotschafter bei Ahrefs. Er ist Organisator des SEO-Meetups in Raleigh, der SEO-Konferenz in Raleigh, des Beer & SEO-Meetups, der Findability-Konferenz und Moderator bei /r/TechSEO.",
  "headers": [
    {
      "level": "H1",
      "text": "Wie du in Unternehmens-SEO erfolgreich sein kannst"
    },
    {
      "level": "H2",
      "text": "Was du wissen musst, um erfolgreich zu sein"
    },
    {
      "level": "H3",
      "text": "Dich Verkaufen"
    },
    {
      "level": "H3",
      "text": "Unternehmensressourcen und Planung"
    },
    {
      "level": "H3",
      "text": "Daten/Reporting"
    },
    {
      "level": "H3",
      "text": "Organisation"
    },
    {
      "level": "H4",
      "text": "Deine Team Organisation"
    },
    {
      "level": "H4",
      "text": "Andere Teams"
    },
    {
      "level": "H4",
      "text": "Extern"
    },
    {
      "level": "H3",
      "text": "Training & Evangelisation"
    },
    {
      "level": "H2",
      "text": "Wie Unternehmens-SEO durchgeführt wird"
    },
    {
      "level": "H3",
      "text": "Arbeiten mit Inhalten/Assets"
    },
    {
      "level": "H4",
      "text": "Optimierung bestehender Inhalte"
    },
    {
      "level": "H4",
      "text": "Inhalte erstellen"
    },
    {
      "level": "H4",
      "text": "Syndikation von Inhalten (Content Syndication)"
    },
    {
      "level": "H3",
      "text": "Links aufbauen und erstellen"
    },
    {
      "level": "H4",
      "text": "Externe Links"
    },
    {
      "level": "H4",
      "text": "Interne Links"
    },
    {
      "level": "H4",
      "text": "Strafen"
    },
    {
      "level": "H3",
      "text": "Technisches SEO"
    },
    {
      "level": "H4",
      "text": "Projekt Ideen"
    },
    {
      "level": "H2",
      "text": "Abschließende Gedanken"
    }
  ],
  "author": "Patrick Stox"
}