{
  "url": "https://ahrefs.com/blog/de/voice-search/",
  "slug": "voice-search",
  "title": "Voice Search: ein wirklich nützlicher Leitfaden",
  "description": "Bei Voice Search nutzt man seine Stimme, um mit einer Suchmaschine zu interagieren.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (oder, in einfachen Worten, ich bin der Typ, der dafür sorgt, dass jeder Blog-Post EPISCH wird). Inhalt Voice Search, also die Sprachsuche, wird von mehr Personen als jemals zuvor genutzt. Daher ist es keine Überraschung, dass Fragen wie “Hey Google, wie optimiere ich die Sprachsuche?” in aller Munde sind.Berechtigte Frage, aber ist das überhaupt möglich?In diesem Beitrag zeigen wir dir:Was ist Voice Search?Wie weit ist Voice Search verbreitet?Wissenswertes über Voice SearchWie du deine SEO für Voice Search optimierstSolltest du deine SEO für Voice Search optimieren?Was ist Voice Search?Bei der Sprachsuche verwendet man seine Stimme, um mit einer Suchmaschine zu interagieren, anstatt mittels einem geschriebenen Text zu suchen.Das mag zwar offensichtlich klingen, aber die Betonung liegt auf der Interaktion mit einer Suchmaschine. “Hey Google, mach das Licht an” ist kein Beispiel für eine Sprachsuche, weil es keine Suche ist. Hier erteilst du lediglich einen Sprachbefehl an einen Sprachassistenten. Genauso verhält es sich, wenn du Google bittest, einen Freund aus deiner Kontaktliste anzurufen. Die Suche erfolgt nicht über das Internet.Andererseits ist “Hey Google, wo ist der nächste Geldautomat?” ein Beispiel für eine Sprachsuche, weil du die Suchmaschine Google bittest, das Web nach einer Antwort zu durchsuchen.Wie weit ist Voice Search verbreitet?Google gibt an, dass 41% der Erwachsenen und 55% der Teenager täglich Voice Search nutzen. Und laut einer aktuellen Microsoft-Umfrage sind die folgenden Art und Weisen, die häufigsten wie digitale Assistenten genutzt werden:68% suchen nach schnellen Fakten.65% suchen nach einer Wegbeschreibung.47% suchen nach Unternehmen.44% suchen nach Produkten oder Dienstleistungen.Drei Dinge, die du über Voice Search wissen solltestBevor wir darüber sprechen, wie und ob du für Voice Search optimieren solltest, gibt es ein paar Dinge zu beachten:Die Antwort von Google variiert je nach GerätGoogle beantwortet die Fragen oftmals mit einem Featured SnippetGoogle zieht für gewöhnlich Antworten der best-gerankten Pages heran1. Die Antwort von Google variiert je nach GerätFrag Google auf deinem Handy, wie man Pizzateig zubereitet — und die Antwort dazu ist ziemlich einfach.Aber wenn du dieselbe Frage mittels Google Home stellst, wählt Google gleich ein Rezept für dich aus:2. Google beantwortet die Fragen oftmals mit einem Featured SnippetNach dieser Analyse von 10.000 Suchergebnissen mittels Google Home stammen 40,7% der Antworten über Voice Search von dem Featured Snippet.3. Google zieht für gewöhnlich Antworten der best-gerankten Pages heranSelbst wenn Google die Antwort nicht von dem Featured Snippet heranzieht, stammt sie in der Regel immer noch aus einem der Top-Rankingergebnisse. Tatsächlich stammen fast 91% der Suchergebnisse mittels Voice Search aus den ersten fünf Pages.Wie du deine SEO für Voice Search optimieren solltestIm Moment ist es nicht möglich zu sehen, wie viele Personen nach einem bestimmten Keyword mittels Voice Search suchen. Google gibt uns diese Daten nicht, und sie sind auch in keinem Keyword Recherche Tool zu finden — auch nicht von anderen Anbietern. Was wir aber wissen, ist, dass die Voice-Search-Technologie noch recht unausgereift ist und dass wir uns meist auf einfache Suchanfragen mittels Voice Search beschränken — wie beispielsweise:Wann wurde die Glühbirne erfunden?Wo befindet sich das nächste Fitnesscenter?Wie viel Proteinpulver ist zu viel?Wo kann ich eine Schwimmbrille kaufen?Wie lautet die Nummer der Pizzeria Pizzi in der Baumgartenstraße 2?Aus diesem Grund geht es bei Voice Search SEO hauptsächlich darum, relevante Fragen der Nutzer zu finden, zu beantworten und hinsichtlicher dieser Fragen zu optimieren.So könntest du das angehen:Erstelle ein Profil auf Google My BusinessFinde die Fragen, die Personen stellenÜberlege dir, ob und wo du Antworten liefern möchtestBeantworte die FrageStelle sicher, dass die Webpage schnell lädtErhalte mehr hochwertige BacklinksFüge Schema Markup hinzup1. Erstelle ein Profil auf Google My BusinessNutzer stellen mit hoher Wahrscheinlichkeit Fragen, die direkt mit deinem Unternehmen zu tun haben, und die beste Möglichkeit, diese Fragen zu beantworten, ist ein kostenloses Profil auf Google My Business. Warum? Weil Google in der Regel Antworten zu deinem Unternehmen von hier aus abruft, wenn sich die Information dort befindet.Sagen wir zum Beispiel, dass ich einen Termin bei meinem örtlichen Frisiersalon buchen möchte. Wenn ich Google nach der Nummer frage, stammt sie aus einem GMB-Profil.Wenn ich am Tag meines Termins nach einer Wegbeschreibung frage, stammt diese auch von GMB.Aber GMB ist nicht nur für Suchanfragen wichtig, die direkt mit deinem Unternehmen zu tun haben. Es ist ebenso wichtig, wenn nicht sogar noch wichtiger, für andere Arten der lokalen Suche. Wenn ich z.B. Google Home bitte, das beste italienische Restaurant vor Ort zu finden, liest es Vorschläge auf der Grundlage von GMB-Profilen vor.Es geht also nicht nur darum, ein Profil zu haben; du musst auch daran arbeiten, Bewertungen zu erhalten und dein Angebot zu optimieren. Und ein wichtiger Teil davon ist es, Informationen immer up-to-date zu halten.Hier eine wahre Geschichte, die beweist, wie wichtig das ist …Letztes Jahr habe ich Google nach dem Weg zu einer Zahnarztpraxis gefragt. Ungefähr zehn Minuten vor dem Ende meiner Reise wurde mir klar, dass Google mich zu ihrem alten Standort brachte, da sie ihre GMB-Adresse nach dem Umzug nie aktualisiert hatten. Ich hätte fast meinen Termin verpasst.2. Finde die Fragen, die Personen stellenAbgesehen von Google My Business geht es bei der Optimierung der Sprachsuche hauptsächlich um die Erstellung und Optimierung von Content für relevante Fragen, die von den Nutzern gestellt werden. Und es gibt ein paar Möglichkeiten, wie du diese finden kannst.Finde Fragen, für die du bereits rankstWenn deine Website bereits ein hohes Ranking für beliebte Fragen aufweist, sind dies Möglichkeiten für die Optimierung der Sprachsuche. Warum? Weil Google die meisten Antworten für die Sprachsuche von einer der best-gerankten Pages abruft.So findest du diese:Site Explorer > gib deine Domain ein > Organische Keywords > filter nach den top 5 rankings > filter nach Keywords, die “wer,” “was,” “wann,” “wo,” “warum,” “wie” etc. enthalten. Du kannst zum Beispiel sehen, dass unser Beitrag über die Such nach einer E‑Mail-Adresse für beliebte Fragen wie “Wie finde ich E‑Mail-Adressen” und “Wie finde ich die E‑Mail-Adresse von jemandem anhand seines Namens” rankt, die beide Hunderte von monatlichen Suchanfragen erhalten.Finde Fragen, für die deine Wettbewerber rankenWenn du bereits eine für Fragen rankst, liegt das wahrscheinlich daran, dass du diese Fragen bereits gänzlich oder zumindest teilweise irgendwo auf deiner Website beantwortet hast. Wenn Wettbewerber für Fragen ranken, für die du nicht rankst, dann liegt das wahrscheinlich daran, dass sie Fragen beantwortet haben, die du nicht beantwortet hast.Um diese zu finden, gib ein paar Domains deiner Wettbewerber in das Content Gap Tool von Ahrefs ein, und füge deine Domain dann in bei “But the target doesn’t rank for…” am Ende der Seite ein.Du solltest nun Keywords sehen, bei denen konkurrierende Domains ranken, aber du nicht. Du nun nach Keywords filtern, die Fragewörter wie “wer”, “was”, “warum”, “wie” usw. enthalten.Finde andere FragenEs wird immer Fragen geben, für die weder du noch deine Wettbewerber ranken. Diese findest du im Keywords Explorer von Ahrefs. Gib einfach ein paar “Seed”-Keywords ein, die sich auf das Thema deiner Website beziehen, und gehe dann zum Report Questions.Unsere Website handelt beispielsweise um das Thema SEO, also verwenden wir “SEO,” “link building,” and “keyword recherche” als “Seed”-Keywords.3. Überlege dir, ob und wo du Antworten liefern möchtestNun, da du einige relevante und beliebte Fragen gefunden hast, die Google gestellt werden, musst du einen Platz finden, wo du sie beantwortest. Schließlich kann Google keine Antwort von deiner Website vorlesen, wenn sie nicht da ist.Und so funktioniert das:Du hast im vorherigen Schritt wahrscheinlich viele potenzielle Fragen gefunden, die es zu beantworten gilt. Es lohnt sich, mit denen zu beginnen, für die du bereits rankst. Dann kannst du zu den Keywords übergehen, für die deine Wettbewerber ranken, und schließlich zu anderen Keywords.Sehen wir uns das etwas genauer an.Hast du die Frage bereits beantwortet?Wenn du bereits für eine Frage rankst, dann hast du diese Frage wahrscheinlich bereits auf dieser Website beantwortet. Aus diesem Grund ranken wir (im Featured Snippet) bei der Frage “Wie mit Affiliate-Marketing beginnen?”. Unser Guide über Affiliate Marketing beantwortet diese Frage mit einer einfachen Schritt-für-Schritt-Anleitung.Und die Frage “Was ist Affiliate-Marketing” wird mit einer kurzen Definition beantwortet:Wenn das bei deiner Frage der Fall ist, überprüfe den Hinweis zur Optimierung im nächsten Schritt.Kannst du die Antwort auf einer bestehenden Webpage hinzufügen?Wenn du die Frage noch nicht beantwortet hast, solltest du zunächst überlegen, ob es sinnvoll ist, sie auf einer bestehenden Page zu beantworten.Zum Beispiel ranken wir nicht für die Frage “Was ist ein Gast-Blogbeitrag?”, weil wir sie in keinem relevanten Blog-Beitrag beantwortet haben. Da wir jedoch bereits einen Beitrag über Gastbeiträge haben, wäre es sinnvoll, die Antwort dort hinzuzufügenDu solltest nur wissen, dass selbst dann, wenn Personen nach einer Frage suchen, möglicherweise mittels Voice Search, es nicht immer Sinn macht, diese auch zu beantworten.Zum Beispiel bei der Frage “wie finde ich alle E‑Mail Accounts auf meinen Namen?”Obwohl es sich um eine beliebte Frage handelt, wäre es für uns nicht sinnvoll, sie in unserem Beitrag über das Auffinden von E‑Mail-Adressen zu beantworten, da sie in keinem Zusammenhang steht. Der Versuch, die Antwort dort zu ergänzen, würde unsere Besucher nur verwirren und entfremden.Wenn du dir nicht sicher bist, ob eine Antwort auf eine Frage zum Thema der Website passt, schau im Keywords Explorer unter “Übergeordnetes Thema” (“Parent Topc”) nach. Wenn dieses das gleiche wie das Haupt-Keyword deiner Website ist, ist das ein Zeichen dafür, dass die Frage unter das übergeordnete Thema der Website fällt.Das übergeordnete Thema für “was ist ein Gastbeitrag?” ist “Gastbeiträge”, was auch das Haupt-Keyword unseres Blogbeitrages ist.Du kannst auch in der SERP-Übersicht nachsehen, ob ähnliche Websites wie deine bereits für diese Frage ranken. Wenn das der Fall ist, ist das ein weiteres Zeichen dafür, dass die Frage unter das allgemeine Thema deiner Website fällt.Hier sehen wir, dass die meisten top-gerankten Webpages umfangreiche Guides über Gastbeiträge sind:Macht es Sinn, die Frage auf einer neuen Webpage zu beantworten?Es macht kaum Sinn, neue Webpages nur für die Suche mittels Voice Search zu erstellen, aber du wirst manchmal Fragen zu Themen finden, die du noch nicht behandelt hast. Als ich z.B. Fragen für unseren Blogbeitrag über Influencer Marketing recherchierte, stolperte ich über die Frage “wie kann man Influencer auf Instagram finden?”.Angesichts der Arten von Webpages, die für diesen Begriff im Keywords Explorer gerankt werden, wäre es wahrscheinlich nicht sinnvoll, diese Frage in unserem Leitfaden zum Thema Influencer-Marketing zu beantworten. Es wäre sinnvoller, einen neuen Leitfaden speziell darüber zu schreiben, wie man Influencer auf Instagram findet.4. Beantworte die FrageDie Beantwortung von Fragen, ob auf einer neuen oder bestehenden Webpage, ist relativ einfach. Füge die Antwort einfach als kurzen Absatz oder Liste auf der Webpage ein.Woher weißt du, welches Format du wählen solltest? Stelle Google deine Frage und hör dir die Antwort an. Wenn ein kurzer Absatz vorgelesen wird, füge diesen hinzu. Wenn eine Aufzählung vorgelesen wird, füge diese ein.Es gibt jedoch noch einige andere Dinge, die du beim Verfassen von Antworten beachten solltest.Keep it short and sweetVielleicht ist dir aufgefallen, dass Google selten lange Antworten vorliest, also musst du dich kurz halten. Wie kurz? Google gibt keine definitive Zahl an, aber eine Studie ergab, dass die durchschnittliche Antwort von Google Home 29 Wörter beträgt. Das gibt dir also einen guten Anhaltspunkt.Stelle eine hohe Lesbarkeit sicherBezüglich der Sprachentwicklung für Google Assistant sagte Google das:Eine schlecht formulierte schriftliche Antwort ist viel leichter zu verstehen als eine grammatikalisch falsche gesprochene Antwort. Daher muss mehr Fokus auf die grammatikalische Korrektheit gelegt werden.Ist dies eine Bestätigung dafür, dass grammatikalische Korrektheit einen “Ranking Faktor” für Voice Search darstellt? Überhaupt nicht, aber es deutet sicherlich darauf hin, dass sie wichtig ist.Google sagt außerdem:Gesprochene Antworten müssen eine korrekte Aussprache und Intonation haben.Auch wenn der größte Teil der Arbeit bei Google liegt, da es in erster Linie um Fortschritte in der Text-to-Speech-Technologie geht, ist es dennoch wichtig, gut formatierte und interpunktierte Inhalte zu haben. Denn egal, wie gut Google bei der Umwandlung von Text in Sprache ist, lange Absätze ohne Kommas und zu viele lange Wörter werden immer schlecht klingen.5. Stelle sicher, dass die Webpage schnell lädtDiese Studie kam zu dem Ergebnis, dass “PageSpeed offenbar eine wichtige Rolle bei der Voice Search SEO spielt”, da das durchschnittliche Suchergebnis mittels Sprachsuche 52% schneller geladen wird als die durchschnittliche Webpage.Es ist jedoch wichtig zu beachten, dass es sich hierbei um korrelierende Daten handelt, die keine Kausalität beweisen. Es könnte einfach sein, dass schnell ladende Seiten dazu neigen, höher zu ranken, weil die Seitengeschwindigkeit ein Ranking-Faktor ist, und Google zieht normalerweise Sprachsuchergebnisse der ersten fünf gerankten Websites heran.Wie dem auch sei, eine schnell ladende Website ist wichtig für SEO, und es schadet deiner Ranking-Position in Voice Search sicherlich nicht.Weitere InformationenWie du die Ladezeit deiner Website in 20 Minuten verbesserstHow to Improve Page Speed from Start to Finish (Advanced Guide)6. Erhalte mehr hochwertige BacklinksBacklinks sind wohl einer der wichtigsten Ranking-Faktoren. Google betont das auch auf seiner Seite zum Thema, wie die Google-Suche funktioniert. Zudem konnten wir im Rahmen unserer Studie von mehr als einer Milliarde Webpages ebenfalls eine starke positive Korrelation zwischen Links von einzelnen Websites und dem Search Traffic feststellen..Natürlich sprechen wir hier von der regulären organischen Suche, aber dies bezieht sich auf Voice Search aus dem gleichen Grund wie die Seitengeschwindigkeit: Google zieht eher Sprachsuchergebnisse von hoch-gerankten Webpages heran.Erfahre mehr zum Thema Link Building im Video und unter anderen Blogbeiträgen.https://www.youtube.com/watch?v=3sF-m5LKCf4Weitere InformationenThe Noob Friendly Guide To Link BuildingWie man zu Backlinks kommt: 7 Taktiken, die keine neuen Inhalte erfordernLinkbuilding-Fallstudie: Wie wir Backlinks mit einer “Statistik”-Seite generiert haben (und dafür auf Platz 1 rankten)7. Füge Schema Markup hinzuSchema Markup ist ein Code, der Suchmaschinen dabei hilft, deinen Content zu verstehen und ihn in den Suchergebnissen besser darzustellen.Angesichts dieser Definition ist es schlüssig anzunehmen, dass es bei der Optimierung von Voice Search helfen könnte. Die Studie von Backlinko scheint jedoch auf das Gegenteil hinzuweisen, da 63,6% der Sprachsuchergebnisse überhaupt kein Schema verwenden.Auch wenn dies die allgemeine Schlussfolgerung sein könnte, ist Schema Markup bei der Optimierung bestimmter Arten von Content für Voice Search absolut wichtig.Das passiert zum Beispiel, wenn du Google Home bittest, ein Rezept zu finden:Beantwortest du die Frage mit “Ja”, fragt dich Google ob du die Zutaten oder Zubereitungsschritte durchlesen möchtest.Google zieht all diese Informationen aus dem Rezept-Markup der Webpage.Aber es sind nicht nur Rezepte, bei denen das Schema für die Sprachsuche wichtig ist. Google liest manchmal auch Informationen von Veranstaltungen und anderen Arten von Webpages vor. Hier ist zum Beispiel die Antwort, wenn du Google Home fragst, wo das Download-Festival stattfindet:Erfahre mehr dazu in den strukturierten Data Docs von Google und in unserem Leitfaden für strukturierte Daten.Zahlt sich die Optimierung für Voice Search aus?Es ist klar, dass du einige Dinge tun kannst, um die Sprachsuche zu optimieren, aber ist es die Mühe wert? Diese Frage ist schwer zu beantworten, da sie von deinen Zielen abhängt, aber hier sind ein paar positive und negative Aspekte, die es zu berücksichtigen gilt.1. Das Ranking bei der Voice Search erzielt vielleicht nicht viel TrafficDenke über die Fragen nach, die du Google stellst. Wahrscheinlich handelt es sich um Fragen wie::Was bedeutet [Begriff]?Wie stelle ich [Speise] her?Wo findet das [Ereignis] statt?Wie behebe ich [lästiges technisches Problem]?Du wirst feststellen, dass die meisten dieser Fragen mit ein paar Sätzen beantwortet werden können.Zum Beispiel fragte ich Google kürzlich: “Wie schalte ich WLAN-Anrufe auf meinem iPhone aus?”, und Google antwortete, indem es diesen Ausschnitt vorlas:Das Interessante daran ist, dass diese Art von Suchanfragen Sackgassen sind. Damit meine ich, dass die Suchenden wahrscheinlich nicht weitere Informationen benötigen oder wollen.Fazit: Das Ranking für diese Voice-Search-Anfragen wird dir wahrscheinlich nicht viel Traffic bescheren.2. Das Ranking in der Sprachsuche kann die Markenbekanntheit verbessernWir sollten uns daran erinnern, dass Traffic nicht alles ist. Es gibt noch andere Vorteile der SEO, wie beispielsweise Markenbekanntheit. Und das gilt auch für die Optimierung von Voice Search. Immer wenn Google eine Antwort vorliest, sagt es dir, woher sie kommt.Ist das Grund genug, Voice Search zu optimieren?Wahrscheinlich nicht, aber es ist ein netter ZUsatznutzen.3. Das Ranking in der Sprachsuche kann dir dabei helfen, mehr Reichweite zu erzielenEine weitere wichtige Sache, die man nicht vergessen sollte, ist, dass nicht jede Website existiert, um Geld zu verdienen. Denke an die Websites von Regierungsbehörden. Der größte Teil ihres Inhalts ist dazu da, den Bürgern wichtige Informationen zu liefern, daher ist es entscheidend, dass sie den verschiedenen Arten, wie Personen nach Informationen suchen, gerecht werden — einschließlich der Stimme.Stelle dir zum Beispiel vor, jemand fragt, wohin er ein Steuerformular schicken soll, und Google liest eine Antwort vor. Wenn diese Adresse ungenau ist oder von einem Dritten stammt, ist das nicht gut.Natürlich kann man argumentieren, dass das Abrufen von Sprachsuchergebnissen aus vertrauenswürdigen Quellen eher in der Verantwortung von Google liegt als in der eigenen. Das ist zwar richtig, aber Google kann keine Antwort von einer vertrauenswürdigen Webpage abrufen, wenn diese nicht vorhanden ist.FazitDas vielleicht Interessanteste an den Best Practices für Voice Search ist Folgendes: Sie ist nicht nur für sich selbst vorteilhaft. Sie hilft dir auch dabei, featured snippets zu erhalten, Platzierungen in People Also Ask’ (PAA) Boxen zu erzielen und bei einigen regelmäßigen Textsuchen aufzutauchenHast du noch Fragen? Schreib mir auf Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Joshua Hardwick Head of Content @ Ahrefs (oder, in einfachen Worten, ich bin der Typ, der dafür sorgt, dass jeder Blog-Post EPISCH wird).",
  "headers": [
    {
      "level": "H1",
      "text": "Voice Search: ein wirklich nützlicher Leitfaden"
    },
    {
      "level": "H2",
      "text": "Was ist Voice Search?"
    },
    {
      "level": "H2",
      "text": "Wie weit ist Voice Search verbreitet?"
    },
    {
      "level": "H2",
      "text": "Drei Dinge, die du über Voice Search wissen solltest"
    },
    {
      "level": "H3",
      "text": "1. Die Antwort von Google variiert je nach Gerät"
    },
    {
      "level": "H3",
      "text": "2. Google beantwortet die Fragen oftmals mit einem Featured Snippet"
    },
    {
      "level": "H3",
      "text": "3. Google zieht für gewöhnlich Antworten der best-gerankten Pages heran"
    },
    {
      "level": "H2",
      "text": "Wie du deine SEO für Voice Search optimieren solltest"
    },
    {
      "level": "H3",
      "text": "1. Erstelle ein Profil auf Google My Business"
    },
    {
      "level": "H3",
      "text": "2. Finde die Fragen, die Personen stellen"
    },
    {
      "level": "H4",
      "text": "Finde Fragen, für die du bereits rankst"
    },
    {
      "level": "H4",
      "text": "Finde Fragen, für die deine Wettbewerber ranken"
    },
    {
      "level": "H4",
      "text": "Finde andere Fragen"
    },
    {
      "level": "H3",
      "text": "3. Überlege dir, ob und wo du Antworten liefern möchtest"
    },
    {
      "level": "H4",
      "text": "Hast du die Frage bereits beantwortet?"
    },
    {
      "level": "H4",
      "text": "Kannst du die Antwort auf einer bestehenden Webpage hinzufügen?"
    },
    {
      "level": "H4",
      "text": "Macht es Sinn, die Frage auf einer neuen Webpage zu beantworten?"
    },
    {
      "level": "H3",
      "text": "4. Beantworte die Frage"
    },
    {
      "level": "H4",
      "text": "Keep it short and sweet"
    },
    {
      "level": "H4",
      "text": "Stelle eine hohe Lesbarkeit sicher"
    },
    {
      "level": "H3",
      "text": "5. Stelle sicher, dass die Webpage schnell lädt"
    },
    {
      "level": "H3",
      "text": "6. Erhalte mehr hochwertige Backlinks"
    },
    {
      "level": "H3",
      "text": "7. Füge Schema Markup hinzu"
    },
    {
      "level": "H2",
      "text": "Zahlt sich die Optimierung für Voice Search aus?"
    },
    {
      "level": "H3",
      "text": "1. Das Ranking bei der Voice Search erzielt vielleicht nicht viel Traffic"
    },
    {
      "level": "H3",
      "text": "2. Das Ranking in der Sprachsuche kann die Markenbekanntheit verbessern"
    },
    {
      "level": "H3",
      "text": "3. Das Ranking in der Sprachsuche kann dir dabei helfen, mehr Reichweite zu erzielen"
    },
    {
      "level": "H2",
      "text": "Fazit"
    }
  ],
  "author": "Joshua Hardwick"
}