{
  "url": "https://ahrefs.com/blog/de/weiterleitungen-fuer-seo/",
  "slug": "weiterleitungen-fuer-seo",
  "title": "Weiterleitungen für SEO: Ein einfacher (aber vollständiger) Leitfaden",
  "description": "Mit Weiterleitungen kannst du Nutzer (und Bots) zu einer anderen URL umleiten als jene, die sie angefordert haben. Erfahre, wann du sie einsetzen solltest und wie sie deiner SEO helfen können.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (oder, in einfachen Worten, ich bin der Typ, der dafür sorgt, dass jeder Blog-Post EPISCH wird). Inhalt Die meisten Website-Betreiber müssen sich irgendwann mit Weiterleitungen beschäftigen. Weiterleitungen helfen dabei, Dinge für Nutzer und Suchmaschinen zugänglich zu halten, wenn du ein Rebranding durchführst, mehrere Websites zusammenlegst, eine Seite löschst oder einfach eine Seite an einen neuen Ort verschiebst.Die Welt der Weiterleitungen ist jedoch sehr unübersichtlich, da es verschiedene Arten von Weiterleitungen für unterschiedliche Szenarien gibt. Deshalb ist es wichtig, die Unterschiede zwischen ihnen zu kennen.In diesem Leitfaden erfährst du es:Was Weiterleitungen sindWarum du Weiterleitungen nutzen solltestWann du Weiterleitungen nutzen solltestArten von WeiterleitungenBest Practices für WeiterleitungenWas sind Weiterleitungen?Umleitungen sind eine Möglichkeit, um Nutzer (und Bots) zu einer anderen URL weiterzuleiten als die, die sie angefordert haben. Warum solltest du Weiterleitungen nutzen?Es gibt zwei Gründe, warum du Weiterleitungen verwenden solltest, wenn du Inhalte verschiebst: Bessere Nutzererfahrung für Besucher — Du willst nicht, dass Besucher mit einer “Seite nicht gefunden”-Warnung konfrontiert werden, wenn sie versuchen, eine Seite aufzurufen, die verschoben wurde. Weiterleitungen lösen dieses Problem, indem sie die Besucher nahtlos an den neuen Ort des Inhalts weiterleiten. Hilf den Suchmaschinen, deine Website zu verstehen - Weiterleitungen teilen den Suchmaschinen mit, wohin Inhalte verschoben wurden und ob die Verschiebung dauerhaft oder vorübergehend ist. Dies beeinflusst, ob und wie die Seiten in den Suchergebnissen erscheinen. Wann solltest du Weiterleitungen nutzen?Du solltest Weiterleitungen verwenden, wenn du Inhalte von einer URL zu einer anderen verschiebst und gelegentlich, wenn du Inhalte löschst. Werfen wir einen kurzen Blick auf ein paar gängige Szenarien, in denen du sie verwenden solltest.Beim Verschieben von DomainsWenn du ein Rebranding durchführst und von einer Domain auf eine andere umziehst, musst du alle Seiten der alten Domain dauerhaft auf die neue Domain umleiten.Bei der Zusammenlegung von WebsitesWenn du mehrere Websites zu einer einzigen zusammenlegst, musst du die alten URLs dauerhaft auf die neuen URLs umleiten.Bei der Umstellung auf HTTPSWenn du von HTTP auf HTTPS umstellst (was dringend empfohlen wird), musst du alle unsicheren (HTTP-)Seiten und Ressourcen dauerhaft an ihren sicheren (HTTPS-)Ort umleiten.Bei der Durchführung einer WerbeaktionWenn du eine zeitlich begrenzte Werbeaktion durchführst und Besucher z. B. von domain.com/laptops auf domain.com/laptops-black-friday-deals umleiten möchtest, musst du eine zeitlich begrenzte Umleitung verwenden. Beim Löschen von SeitenWenn du Inhalte von deiner Website löschst, solltest du ihre URL nach Möglichkeit dauerhaft auf eine relevante, ähnliche Seite umleiten. So stellst du sicher, dass alle Backlinks auf die alte Seite für SEO-Zwecke weiterhin zählen. Außerdem wird so sichergestellt, dass alle Lesezeichen oder internen Links weiterhin funktionieren.Arten von Weiterleitungen Umleitungen werden in zwei Gruppen unterteilt: serverseitige Umleitungen und clientseitige Umleitungen. Jede Gruppe enthält eine Reihe von Weiterleitungen, die von Suchmaschinen als temporär oder permanent angesehen werden. Du musst also die richtige Weiterleitung für die jeweilige Aufgabe verwenden, um mögliche SEO-Probleme zu vermeiden. Serverseitige WeiterleitungenBei einer serverseitigen Weiterleitung entscheidet der Server, wohin der Nutzer oder die Suchmaschine weitergeleitet werden soll, wenn eine Seite angefordert wird. Dies geschieht durch die Rückgabe eines 3XX HTTP-Statuscodes. Wenn du SEO betreibst, wirst du meistens serverseitige Weiterleitungen verwenden, da clientseitige Weiterleitungen (die wir gleich besprechen werden) einige Nachteile haben und eher für ganz bestimmte und seltene Anwendungsfälle geeignet sind.Hier sind die 3XX-Weiterleitungen, die jeder SEO kennen sollte:301-WeiterleitungEine 301-Weiterleitung leitet die Nutzer zur neuen URL weiter und teilt den Suchmaschinen mit, dass die Ressource dauerhaft umgezogen ist. Wenn sie mit einer 301-Weiterleitung konfrontiert werden, lassen Suchmaschinen in der Regel die alte weitergeleitete URL zugunsten der neuen URL aus ihrem Index fallen. Außerdem übertragen sie den PageRank (Autorität) auf die neue URL. 302-WeiterleitungEine 302-Weiterleitung leitet die Nutzer zur neuen URL weiter und teilt den Suchmaschinen mit, dass die Ressource vorübergehend umgezogen ist. Bei einer 302-Weiterleitung lassen die Suchmaschinen die alte URL indexiert, obwohl sie umgeleitet wurde. Wenn du die 302-Weiterleitung jedoch lange Zeit bestehen lässt, werden die Suchmaschinen sie wahrscheinlich wie eine 301-Weiterleitung behandeln und stattdessen die neue URL indexieren. Wie 301er übertragen auch 302er den PageRank. Der Unterschied ist, dass die Übertragung “rückwärts” erfolgt. Mit anderen Worten: Der PageRank der “neuen” URL wird rückwärts auf die alte URL übertragen (es sei denn, die Suchmaschinen behandeln sie wie eine 301). 303-WeiterleitungEine 303-Weiterleitung leitet den Nutzer zu einer Ressource weiter, die der angefragten ähnlich ist, und ist eine temporäre Form der Weiterleitung. Sie wird z.B. verwendet, um zu verhindern, dass ein Nutzer ein Formular erneut ausfüllt, wenn er den “Zurück”-Button in seinem Browser drückt. Du wirst 303 Weiterleitungen normalerweise nicht für SEO-Zwecke verwenden. Wenn du sie verwendest, werden sie von den Suchmaschinen entweder als 301 oder 302 behandelt. 307-WeiterleitungEine 307-Weiterleitung ist dasselbe wie eine 302-Weiterleitung, außer dass sie die HTTP-Methode (POST, GET) der ursprünglichen Anfrage beibehält, wenn sie die Weiterleitung durchführt. 308-WeiterleitungEine 308-Weiterleitung ist dasselbe wie eine 301-Weiterleitung, nur dass die HTTP-Methode der ursprünglichen Anfrage bei der Weiterleitung beibehalten wird. Google sagt, dass es 308-Weiterleitungen genauso behandelt wie 301-Weiterleitungen, aber die meisten SEOs verwenden immer noch 301-Weiterleitungen. https://twitter.com/JohnMu/status/994633389356429312Client-seitige WeiterleitungenBei einer clientseitigen Weiterleitung entscheidet der Browser, wohin der Nutzer umgeleitet wird. Du solltest sie in der Regel nicht verwenden, es sei denn, du hast keine andere Möglichkeit. 307-WeiterleitungEine 307-Weiterleitung wird häufig auf der Client-Seite verwendet, wenn eine Website HSTS verwendet. Das liegt daran, dass HSTS dem Browser des Kunden mitteilt, dass der Server nur sichere (HTTPS-) Verbindungen akzeptiert und eine interne 307-Weiterleitung durchführen soll, wenn er in Zukunft unsichere (HTTP-) Ressourcen von der Website anfordert.Meta-Refresh-WeiterleitungEine Meta-Refresh-Weiterleitung weist den Browser an, den Nutzer nach einer bestimmten Anzahl von Sekunden weiterzuleiten. Google versteht sie und behandelt sie in der Regel genauso wie eine 301-Weiterleitung. Als John Mueller von Google auf Twitter nach Meta-Weiterleitungen mit Verzögerungen gefragt wurde, sagte er: “Wenn du willst, dass es wie eine Weiterleitung behandelt wird, ist es sinnvoll, dass es sich wie eine Weiterleitung verhält.” So oder so, Google rät davon ab, da sie für den Nutzer verwirrend sein können und nicht von allen Browsern unterstützt werden. Google empfiehlt, stattdessen eine serverseitige 301-Weiterleitung zu verwenden.JavaScript-WeiterleitungBei einer JavaScript-Weiterleitung wird, wie du wahrscheinlich schon erraten hast, JavaScript verwendet, um den Browser anzuweisen, den Nutzer zu einer anderen URL weiterzuleiten. Manche Leute glauben, dass eine JavaScript-Weiterleitung Probleme für Suchmaschinen verursacht, weil sie die Seite erst rendern müssen, um die Weiterleitung zu sehen. Das stimmt zwar, aber für Google ist das normalerweise kein Problem, weil die Seiten heutzutage so schnell gerendert werden. (Trotzdem kann es bei anderen Suchmaschinen zu Problemen kommen.) Alles in allem ist es immer noch besser, eine 3XX-Weiterleitung zu verwenden, wenn es möglich ist, aber eine JS-Weiterleitung ist in der Regel in Ordnung, wenn das deine einzige Option ist.Best Practices für WeiterleitungenWeiterleitungen können kompliziert sein. Um dir dabei zu helfen, findest du hier ein paar Best Practices, die du beachten solltest, wenn du im Bereich SEO tätig bist.Leite HTTP auf HTTPS umJeder sollte jetzt HTTPS verwenden. Es gibt deiner Website eine zusätzliche Sicherheitsebene und ist ein kleiner Google-Rankingfaktor. Es gibt mehrere Möglichkeiten, um zu überprüfen, ob deine Website richtig von HTTP auf HTTPS umgeleitet wird. Die erste ist, die SEO Toolbar von Ahrefs zu installieren und zu aktivieren und dann die HTTP-Version deiner Homepage aufzurufen. Sie sollte umgeleitet werden und du solltest einen 301 Response Code in der Toolbar sehen.Das Problem bei dieser Methode ist, dass du eine 307 sehen könntest, wenn deine Website HSTS verwendet. Hier ist also eine andere Methode:Öffne den Ahrefs Site AuditKlicke auf + Neues ProjektKlicke auf Manuell hinzufügenÄndere den Bereich auf HTTPGib deine Domain einDu solltest den Fehler “Nicht crawlbar” sowohl für die www- als auch für die nicht-www-Version deiner Homepage sehen, zusammen mit der Meldung “301 moved permanently”.Wenn es keine Weiterleitung gibt oder du eine andere Art der Weiterleitung als 301 oder 308 verwendest, solltest du deinen Entwickler bitten, auf 301 umzustellen. TIPPWelche Methode du auch immer verwendest, es lohnt sich, sie für ein paar Seiten zu wiederholen, damit du sicher sein kannst, dass auf deiner gesamten Website die richtigen Weiterleitungen eingerichtet sind. Verwende HSTS (um 307-Weiterleitungen zu erstellen)Die Implementierung von HSTS (HTTP Strict Transport Security) auf deinem Server verhindert, dass jemand auf unsichere (HTTP-)Inhalte auf deiner Website zugreift. Dies geschieht, indem du den Browsern mitteilst, dass dein Server nur sichere Verbindungen akzeptiert und dass sie eine interne 307-Weiterleitung zur HTTPS-Version jeder HTTP-Ressource, auf die sie zugreifen sollen, vornehmen sollen.Dies ist kein Ersatz für 301- oder 302-Weiterleitungen und ist auch nicht unbedingt notwendig, wenn diese auf deiner Website richtig eingerichtet sind. Wir sind jedoch der Meinung, dass dies heutzutage die beste Praxis ist — und sei es nur, um die Dinge für die Nutzer/innen ein wenig zu beschleunigen.Erfahre mehr: Strict-Transport-Security — MozillaTIPPNachdem du HSTS implementiert hast, solltest du in Erwägung ziehen, deine Website in die HSTS-Preload-Liste einzutragen. Dadurch wird HSTS für jeden aktiviert, der versucht, deine Website zu besuchen — auch wenn er sie vorher noch nicht besucht hat.Vermeide Meta-Refresh-WeiterleitungenMeta-Refresh-Weiterleitungen sind nicht ideal. Es lohnt sich also, deine Website darauf zu überprüfen und sie entweder durch eine 301- oder 302-Weiterleitung zu ersetzen. Das kannst du ganz einfach mit einem kostenlosen Ahrefs Webmaster Tools Account machen. Crawle einfach deine Website mit Site Audit und suche nach dem Fehler “meta refresh redirect”.Wenn du dann auf den Fehler klickst und “Betroffene URLs anzeigen” wählst, siehst du die URLs mit Meta-Refresh-Umleitungen. Leite gelöschte Seiten auf relevante, funktionierende Alternativen um (wo möglich)Die Umleitung von URLs ist sinnvoll, wenn du Inhalte verschiebst, aber auch wenn du Inhalte löschst, ist eine Umleitung oft sinnvoll. Denn die Fehlermeldung “404 nicht gefunden” ist nicht ideal, wenn ein Nutzer versucht, eine gelöschte Seite aufzurufen. Oft ist es nutzerfreundlicher, sie auf eine funktionierende Alternative umzuleiten. Zum Beispiel haben wir vor kurzem unsere Blog-Kategorieseiten überarbeitet. Dabei haben wir einige Kategorien gelöscht, darunter “Outreach & Content Promotion”. Anstatt diese Kategorie als 404 zu belassen, haben wir sie auf unsere Kategorie “Link Building” umgeleitet, da sie eine eng verwandte Alternative ist. Das kannst du nicht immer machen, da es nicht immer eine passende Alternative gibt. Aber wenn es eine gibt, hat das auch den Vorteil, dass der PageRank (die Autorität) der umgeleiteten Seite erhalten bleibt und auf die alternative Ressource übertragen wird. Die meisten Websites haben bereits einige tote oder gelöschte Seiten, die einen 404-Statuscode zurückgeben. Um diese zu finden, melde dich für ein kostenloses Ahrefs Webmaster Tools Konto an, crawle deine Website mit Site Audit, gehe zum Bericht Interne Seiten und suche dann nach dem Fehler “4XX Seite”:TIPPAktiviere “Backlinks” als Quelle, wenn du deinen Crawl einrichtest. So kann Site Audit gelöschte Seiten mit Backlinks finden, auch wenn es keine internen Links zu den Seiten auf deiner Website gibt. Um die betroffenen Seiten zu sehen, klicke auf den Fehler und dann auf “Betroffene URLs anzeigen”. Wenn du viele URLs siehst, klicke auf die Schaltfläche “Spalten verwalten”, füge die Spalte “Verweisende Domains” hinzu und sortiere dann absteigend nach verweisenden Domains. Dann kannst du die 404er mit den meisten Backlinks zuerst angehen. Vermeide lange WeiterleitungskettenVon Umleitungsketten spricht man, wenn zwischen einer angeforderten Ressource und ihrem endgültigen Ziel mehrere Umleitungen stattfinden.In der offiziellen Dokumentation von Google heißt es, dass Google bis zu 10 Redirect-Hops folgt, also sind kürzere Redirect-Ketten für SEO kein Problem. Googlebot folgt bis zu 10 Redirect Hops. Wenn der Crawler innerhalb von 10 Sprüngen keine Inhalte erhält, zeigt Search Console im Bericht zur Indexabdeckung der Website einen Weiterleitungsfehler an.Lange Weiterleitungsketten verlangsamen jedoch die Ladezeit für die Nutzer, daher solltest du sie nach Möglichkeit vermeiden. Du kannst lange Weiterleitungsketten kostenlos mit den Ahrefs Webmaster Tools finden: Crawle deine Website mit Site AuditGehe zum Bericht RedirectsKlicke auf den Reiter ProblemeSuche nach dem Fehler “Umleitungskette zu lang”.Klicke auf das Problem und klicke auf “Betroffene URLs anzeigen”, um die URLs, die eine Weiterleitungskette beginnen, und alle URLs in der Kette zu sehen. Vermeide WeiterleitungsschleifenWeiterleitungsschleifen sind Endlosschleifen von Weiterleitungen, die entstehen, wenn eine URL zu sich selbst weiterleitet oder wenn eine URL in einer Weiterleitungskette zu einer URL zurückleitet, die früher in der Kette steht. Sie sind aus zwei Gründen problematisch: Für die Nutzer - Sie unterbrechen den Zugang zu einer bestimmten Ressource und führen zu einer Fehlermeldung “zu viele Weiterleitungen” im Browser. Für Suchmaschinen - Sie sind eine “Falle” für Crawler und verschwenden das Crawl Budget.Die einfachste Möglichkeit, Weiterleitungsschleifen zu finden, besteht darin, deine Website mit einem Tool wie dem Ahrefs Site Audit zu crawlen. Das kannst du kostenlos mit einem Ahrefs Webmaster Tools-Konto tun.Crawle deine Website mit Site AuditRufe den Bericht Weiterleitungen aufKlicke auf den Reiter ProblemeSuche nach dem Fehler “Redirect loop” (Umleitungsschleife)Wenn du dann auf den Fehler und auf “Betroffene URLs anzeigen” klickst, siehst du eine Liste der URLs, die umgeleitet werden, sowie alle URLs in der Kette:Wie du eine Weiterleitungsschleife am besten behebst, hängt davon ab, ob die letzte URL in der Kette (vor der Schleife) das beabsichtigte Endziel ist.Ist dies der Fall, entferne die Weiterleitung von der letzten URL. Stelle dann sicher, dass die Ressource erreichbar ist und einen 200-Statuscode zurückgibt.Wenn das nicht der Fall ist, ändere die Umleitungsschleife auf das beabsichtigte Endziel. In beiden Fällen ist es ratsam, alle internen Links zu den verbleibenden Weiterleitungen gegen direkte Links zur endgültigen URL auszutauschen. FazitWeiterleitungen für SEO sind ziemlich einfach. Meistens verwendest du serverseitige 301- und 302-Weiterleitungen, je nachdem, ob die Weiterleitung dauerhaft oder vorübergehend ist. Es gibt jedoch einige Besonderheiten bei der Behandlung von 301 und 302 durch Google, daher lohnt es sich, diese beiden Leitfäden zu lesen, wenn du Probleme hast:301-Weiterleitungen für SEO: Alles, was du wissen musst301- vs. 302-Weiterleitungen für SEO: Welche solltest du verwenden?Hast du Fragen? Schreib mir auf Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Joshua Hardwick Head of Content @ Ahrefs (oder, in einfachen Worten, ich bin der Typ, der dafür sorgt, dass jeder Blog-Post EPISCH wird).",
  "headers": [
    {
      "level": "H1",
      "text": "Weiterleitungen für SEO: Ein einfacher (aber vollständiger) Leitfaden"
    },
    {
      "level": "H2",
      "text": "Was sind Weiterleitungen?"
    },
    {
      "level": "H2",
      "text": "Warum solltest du Weiterleitungen nutzen?"
    },
    {
      "level": "H2",
      "text": "Wann solltest du Weiterleitungen nutzen?"
    },
    {
      "level": "H3",
      "text": "Beim Verschieben von Domains"
    },
    {
      "level": "H3",
      "text": "Bei der Zusammenlegung von Websites"
    },
    {
      "level": "H3",
      "text": "Bei der Umstellung auf HTTPS"
    },
    {
      "level": "H3",
      "text": "Bei der Durchführung einer Werbeaktion"
    },
    {
      "level": "H3",
      "text": "Beim Löschen von Seiten"
    },
    {
      "level": "H2",
      "text": "Arten von Weiterleitungen"
    },
    {
      "level": "H3",
      "text": "Serverseitige Weiterleitungen"
    },
    {
      "level": "H4",
      "text": "301-Weiterleitung"
    },
    {
      "level": "H4",
      "text": "302-Weiterleitung"
    },
    {
      "level": "H4",
      "text": "303-Weiterleitung"
    },
    {
      "level": "H4",
      "text": "307-Weiterleitung"
    },
    {
      "level": "H4",
      "text": "308-Weiterleitung"
    },
    {
      "level": "H3",
      "text": "Client-seitige Weiterleitungen"
    },
    {
      "level": "H4",
      "text": "307-Weiterleitung"
    },
    {
      "level": "H4",
      "text": "Meta-Refresh-Weiterleitung"
    },
    {
      "level": "H4",
      "text": "JavaScript-Weiterleitung"
    },
    {
      "level": "H2",
      "text": "Best Practices für Weiterleitungen"
    },
    {
      "level": "H3",
      "text": "Leite HTTP auf HTTPS um"
    },
    {
      "level": "H3",
      "text": "Verwende HSTS (um 307-Weiterleitungen zu erstellen)"
    },
    {
      "level": "H3",
      "text": "Vermeide Meta-Refresh-Weiterleitungen"
    },
    {
      "level": "H3",
      "text": "Leite gelöschte Seiten auf relevante, funktionierende Alternativen um (wo möglich)"
    },
    {
      "level": "H3",
      "text": "Vermeide lange Weiterleitungsketten"
    },
    {
      "level": "H3",
      "text": "Vermeide Weiterleitungsschleifen"
    },
    {
      "level": "H2",
      "text": "Fazit"
    }
  ],
  "author": "Joshua Hardwick"
}