{
  "url": "https://ahrefs.com/blog/de/wie-du-website-autoritaet-erhoehst/",
  "slug": "wie-du-website-autoritaet-erhoehst",
  "title": "Wie du Website-Autorität (Domain-Rating) erhöhst",
  "description": "Lerne was Website-Autorität ist, wie sich Domain-Rating (DR) berechnet und wie du deinen Wert auf die richtige Art und Weise erhöhst.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (oder, in einfachen Worten, ich bin der Typ, der dafür sorgt, dass jeder Blog-Post EPISCH wird). Inhalt Wenn du besser bei Google ranken möchtest, um mehr organischen Traffic für deine Website zu erhalten, hast du vielleicht gelesen, dass die Verbesserung deiner Website-Autorität die Lösung sein kann.Aber auch wenn es nie schlecht ist, die Autorität deiner Website zu steigern, sollte es niemals dein vorrangiges Ziel sein, diesen Wert zu erhöhen.Statt dessen solltest du dich darauf konzentrieren, was dazu führt, dass dieser Wert steigt: hochwertige Backlinks von angesehen etablierten Websites.In diesem Guide lernst du:Was Website-Autorität (Domain-Rating) istWie dieser Wert berechnet wirdWie du dein Domain-Rating (auf die richtige Weise) erhöhst https://www.youtube.com/watch?v=cl1Ch9ARdQsWas ist Website-Autorität (Domain-Rating)?Website-Autorität ist ein Wert, der von SEO-Tool Anbietern verwendet wird. Er bemisst die relative Stärke deines Backlink-Profils im Vergleich zu allen andern Seiten in ihrem Index.Nahezu jedes bekannte SEO-Tool verwendet diesen Wert, aber die Bezeichnung und die Berechnungsweise unterscheidet sich in jedem Tool.Bei Ahrefs bezeichnen wir unseren Website-Autoritäten Wert als Domain-Rating (DR).Wie die meisten anderen Website-Autoritäten Werte, umspannt er eine Skala von 0–100.Nebenbei bemerkt. Du kannst die Autorität deiner Domain in unserem kostenlosen Website-Autoritäten Checker überprüfen.Es ist wichtig zu verstehen, dass die Skala für das Domain-Rating logarithmisch ist. Das bedeutet, es ist deutlich schwieriger von einem DR-Wert von 69 auf 70 zu gelangen als von 9 auf 10.Eine gute Möglichkeit sich dies vor Augen zu führen, ist der Gedanke an Rankings in Videospielen.Vielleicht startest du als “Späher” und es mag ein paar Stunden dauern, um einen “Ranger”-Status zu erlangen. Aber das nächste Level zu erreichen, könnte Monate dauern und nur Spieler, die wirklich investiert sind, erhalten den “Helden”-Status.Die logarithmische Skala bedeutet auch, dass ein DR von 20 mehr als doppelt so viel Autorität hat, als eine Seite mit einem DR von 10.Wie wird das Domain-Rating (die Autorität) berechnet?Bevor du versuchst deine Website-Autorität zu steigern, solltest du zunächst verstehen, wie das Domain-Rating berechnet wird.Also lass uns die drei Hauptpunkte betrachten, die das Domain-Rating beeinflussen.Die Anzahl an Websites die zu dir verlinkenDer DR-Wert von verlinkenden DomainsDie Anzahl an Seiten auf die jede verweisende Domain verlinkt1. Die Anzahl an Websites die zu dir verlinkenIn Ahrefs haben wir einen Wert, den wir Referring Domains (verweisende Domains) nennen. Dies ist die Anzahl an Websites, die zu einer Seite deiner Website linken.Du kannst diesen Wert für jede Seite sehen, die du im Site Explorer analysiert.Manche Leute denken, dass je höher diese Anzahl ist, desto besser das Domain-Rating. Allerdings ist es nicht ganz so einfach, da wir in unseren Berechnungen zum Domain-Rating nur “followed” Links berücksichtigen. Links mit UGC, sponsored und nofollow Attributen verbessern das DR nicht.Auch mehrere Links von derselben Website verbessern das DR einer Seite nicht, da wir die Anzahl an verweisenden Domains und nicht an Backlinks berücksichtigen.2. Der DR-Wert von verlinkenden DomainsJeder kann tausende Links von einigen Seiten mit geringer Qualität erhalten. Deshalb berücksichtigen wir auch den DR-Wert der verlinkenden Seite, wenn wir das DR berechnen.Das bedeutet, dass Backlinks von Websites mit hohem DR-Wert dein Domain-Rating tendenziell eher verbessern als solche mit geringen DR-Werten.Dies ist ein interessanter Punkt. Es bedeutet, dass auch dein DR steigen kann, wenn der DR-Wert einer verlinkenden Seite steigt.Wenn du zum Beispiel heute einen Link von einer Website mit einem DR-Wert von 15 erhältst und der Eigentümer der Seite hart daran arbeitet, Autorität und Links über eine Zeitraum zu steigern, könnte der selbe Link in einem Jahr von einer Website mit einem DR-Wert von 40 sein. Selbst wenn du nur diesen einen Link erhältst, könnte dein DR-Wert somit mit der Zeit steigen.Es macht also Sinn, Links von Seiten zu erhalten, die Potenzial zeigen, selbst wenn ihre DR-Werte zu dem Zeitpunkt relativ gering sind.Wie kannst du “Potenzial” beurteilen?Schau dir zunächst die Inhalte der Websites an. Wenn sie qualitativ hochwertige Dinge veröffentlichen, ist es wahrscheinlicher, dass sie mit der Zeit automatisch qualitativ hochwertige Links generieren.Schau dir im nächsten Schritt das Wachstum an Links in Ahrefs Site Explorer an. Wenn du einen langsamen stetigen Aufwärtstrend in der Grafik für verweisende Domains sehen kannst, stehen die Chancen nicht schlecht, dass diese Entwicklung weiter in die richtige Richtung gehen und ihr DR mit der Zeit steigen wird.3. Die Anzahl an Seiten auf die jede verweisende Domain verlinktSagen wir du hast zwei Follow-Links erhalten: einen von The Guardian und einen von IMDB. Beide dieser Seiten haben den gleichen DR-Wert aber welcher Link würde dein Domain-Rating am meisten verbessern?Antwort: Es kommt auf die Anzahl an Seiten an, zu denen sie jeweils mit mindestens einem Follow-Link verlinken. Zu je mehr uniquen Websites eine Seite verlinkt, desto weniger so genannte “DR-Equity” kann sie weitergeben.Lass uns den Linked Domains-Report für beide Seiten überprüfen und nur nach “followed” Links filtern.Es sieht so aus also ob The Guardian circa 50x mehr Seiten verlinkt als IMDB (272,218 vs. 5,256). Deshalb würde der Link von IMDB dein Domain-Rating mehr verbessern als der Link von The Guardian.Lass uns betrachten, welchen Unterschied dies auf das DR haben kann.Diese Website hat eine verweisende Domain, die IMDB ist. Ihr DR-Wert liegt bei 34.Diese Website hat auch eine verweisende Domain, aber in diesem Fall handelt es sich dabei um The Guardian. Ihr DR-Wert liegt bei 1.5.Es ist wichtig zu beachten, dass die Link-Autorität von IMDB deshalb nicht für alle Links höher ist, als die von The Guardian. Es gibt viele Faktoren, die zu einem guten Backlink beitragen.Wie du dein Domain-Rating steigerstGeneriere mehr Follow-Links zu deiner Seite und dein Domain-Rating wird steigen. Es ist so simpel. Beachte nur, dass wenn die Seite von der du einen Link erhältst selbst einen geringen DR-Wert hat, oder du zu vielen Websites verlinkst, die Steigerung deines Domain-Ratings nur geringfügig sein kann.Es ist auch wichtig zu beachten, dass Linkbuilding zu willkürlichen Seiten nicht immer helfen wird deine Rankings oder deinen organischen Traffic zu erhöhen. Da das aber mit an Sicherheit grenzender Wahrscheinlichkeit dein Endziel ist, solltest du dich bemühen Links direkt zu den Seiten aufzubauen, mit denen du bei Google ranken möchtest. Dies wird eine größere Auswirkung auf deinen organischen Traffic und deine Rankings haben, als einfach nur das DR “zu steigern”.Wir wissen das, da wir diesen Sachverhalt untersucht haben. Die Anzahl an verweisenden Domains korreliert stärker mit organischem Traffic als mit dem DR einer rankenden Website.Jedoch ist es nicht immer einfach, Links zu der Seite zu generieren, für die du bei Google ranken möchtest.Für eine Druckerei wäre es zum Beispiel schwierig Leute dazu zu bekommen, zu einer Seite zu verlinken, die Visitenkarten verkauft, da es wenig Anreiz gibt, dies zu tun. Wenn du also Schwierigkeiten hast……sind hier ein paar Möglichkeiten wie du deine Website- (Domain)-Autorität indirekt auf sinnvolle Art und Weise steigerst:Erstelle Inhalte die Leute verlinken möchtenKontaktiere relevante und etablierte WebsitesNutze interne Verlinkungen um die “Autorität” wichtiger Seiten zu verbessern1. Erstelle Inhalte die Leute verlinken möchtenDiese beinhalten die folgenden drei Eigenschaften:Nicht werbendLeute verklingen eher auf Seiten, die nicht nur dazu da sind, dir Geld zu erwirtschaften. Deshalb ist es so schwierig Links für Sales-Seiten und Affiliate-Bewertungen zu generieren.HilfreichEs gibt zwei Möglichkeiten etwas Hilfreiches zu erstellen.Die Erste ist etwas mit Mehrwert zu erstellen. Denke an Blogbeiträge, Rechner und kostenlose Tools. Unser kostenloser Backlink Checker ist ein gutes Beispiel hierfür. Er hat Backlinks von mehr als 1.850 verweisenden Domains generiert.Die Zweite ist etwas zu erstellen, das sich gut zitieren lässt. Denke an Statistiken, Studien und einzigartige Ideen, auf die Blogger und Journalisten verweisen, um einen Punkt zu verdeutlichen.Unsere Studie wie lange es dauert bei Google zu ranken ist ein gutes Beispiel hierfür. Sie hat Backlinks von mehr als 880 verweisenden Domains generiert.Hat Potenzial Links zu generierenInstalliere Ahrefs SEO Toolbar, suche bei Google nach dem Thema für das du Inhalte erstellen möchtest und schau dir die Anzahl an verweisenden Domains zu den Seiten im Top-Ranking an.Wenn diese eine hohe Anzahl an Links aufweisen, ist dies ein Zeichen für ein Thema, das verlinkenswert ist. Warum? Weil du sehen kannst, dass Seiten über dieses Thema Links generiert haben.Stelle allerdings sicher, dass du Themen vermeidest, die nicht mehr aktuell sind.Schau dir zum Beispiel die Ergebnisse im Top-Ranking für “the dress illusion” an:Es gibt tatsächliche viele Websites, die zu diesen Seiten verlinken, aber dies liegt daran, dass es 2015 für kurze Zeit ein zitierbares Thema war, als das Bild viral ging. Wenn diese Beiträge heute veröffentlicht worden wären, würden sie kaum Links generieren.Hast du Probleme ein geeignetes Thema zu finden?Suche im Keywords Explorer nach Seed Keywords und überprüfe dann den “All keywords”-Report. Basierend auf dem Seed Keyword solltest du eine Vielzahl an Keyword-Ideen sehen.Füge nun Wörter wie wer, was, wann, warum, wie, Guide, Tool, Rechner, Daten, Statistiken und Studien als Liste mit einem Komma getrennt zum “Include”-Filter hinzu und wähle “Any word” aus.Dies filtert erfolgreich nach Themen mit hohem Nutzen oder Zitierbarkeit.Filtere schließlich nach Keywords mit einem hohen Keyword Difficulty (KD)-Wert, wie 40+, um Themen zu finden, die in der Vergangenheit Links generiert haben. Der Grundgedanke basiert hier darauf, dass Keyword Difficulty auf der durchschnittlichen Anzahl an verlinkenden Domains zu den Ergebnissen im Top-Ranking basiert. Das heißt Seiten, die für Keywords mit hohem KD-Wert ranken, werden viele Backlinks haben.Halte nach einem relevanten und lohnenswerten Thema Ausschau und erstelle deine Inhalte in Übereinstimmung mit der Suchintention.2. Kontaktiere relevante und etablierte WebsitesInhalte zu haben, auf die Leute verlinken möchten, ist großartig, aber niemand kann auf Inhalte verlinken, die er nicht kennt.Deshalb musst du Websitebetreiber kontaktieren und über deine Inhalte in Kenntnis setzen.Es gibt eine Vielzahl an Möglichkeiten relevante Leute zu finden und zu kontaktieren, hier sind drei Gruppen, die du zunächst in Erwägung ziehen kannst:Leute die in deinem Artikel erwähnt werdenLeute die über ähnliche Themen Beiträge verfasst habenLeute die Beiträge über ähnliche Themen verlinkt habenLerne in unserem Guide über Blogger Outreach mehr darüber, wie du diese Leute findest und kontaktierst.3. Nutze interne Verlinkungen um die “Autorität” wichtiger Seiten zu verbessernFolge dem obigen Prozess kontinuierlich, um stetig deine Website-Autorität und dein SEO zu verbessern. Du kannst dann die “Middleman” Methode nutzen, um etwas dieser “Autorität” auf die Seiten, für die du ranken möchtest, zu leiten.Abschließende GedankenDeine Website-Autorität zu verbessern, sollte nie dein Hauptanliegen sein. Konzentriere dich stattdessen auf den Aufbau von qualitativ hochwertigen Links von relevanten und etablierten Websites zu den Seiten, für die du ranken möchtest. Dein Domain-Rating wird sich dadurch automatisch als Nebeneffekt dieses Prozesses verbessern.Links sind allerdings nicht der einzigste Google Ranking-Faktor. Wenn dein eigentliches Ziel es ist, besser bei Google zu ranken, folge unserem 6‑Schritte Guide.Oder lese unseren interaktiven Guide für Rankings auf der ersten Seite, falls du noch nicht dort rankst.Hast du Fragen? Stelle sie mir auf Twitter.Übersetzt von Heike Radlanski. Heike beschäftigt sich mit allen Aspekten des Online Marketing und Product Managements. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Joshua Hardwick Head of Content @ Ahrefs (oder, in einfachen Worten, ich bin der Typ, der dafür sorgt, dass jeder Blog-Post EPISCH wird).",
  "headers": [
    {
      "level": "H1",
      "text": "Wie du Website-Autorität (Domain-Rating) erhöhst"
    },
    {
      "level": "H2",
      "text": "Was ist Website-Autorität (Domain-Rating)?"
    },
    {
      "level": "H2",
      "text": "Wie wird das Domain-Rating (die Autorität) berechnet?"
    },
    {
      "level": "H3",
      "text": "1. Die Anzahl an Websites die zu dir verlinken"
    },
    {
      "level": "H3",
      "text": "2. Der DR-Wert von verlinkenden Domains"
    },
    {
      "level": "H3",
      "text": "3. Die Anzahl an Seiten auf die jede verweisende Domain verlinkt"
    },
    {
      "level": "H2",
      "text": "Wie du dein Domain-Rating steigerst"
    },
    {
      "level": "H3",
      "text": "1. Erstelle Inhalte die Leute verlinken möchten"
    },
    {
      "level": "H4",
      "text": "Nicht werbend"
    },
    {
      "level": "H4",
      "text": "Hilfreich"
    },
    {
      "level": "H4",
      "text": "Hat Potenzial Links zu generieren"
    },
    {
      "level": "H3",
      "text": "2. Kontaktiere relevante und etablierte Websites"
    },
    {
      "level": "H3",
      "text": "3. Nutze interne Verlinkungen um die “Autorität” wichtiger Seiten zu verbessern"
    },
    {
      "level": "H2",
      "text": "Abschließende Gedanken"
    }
  ],
  "author": "Joshua Hardwick"
}