{
  "url": "https://ahrefs.com/blog/de/wie-man-eine-sitemap-erstellt/",
  "slug": "wie-man-eine-sitemap-erstellt",
  "title": "Wie man eine XML-Sitemap erstellt (und sie bei Google einreicht)",
  "description": "Erfahre was eine Sitemap ist, warum du eine benötigst, wie man eine anlegt und wie man sie bei Google einreicht.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (oder, in einfachen Worten, ich bin der Typ, der dafür sorgt, dass jeder Blog-Post EPISCH wird). Inhalt Genauso schwer wie es ist einen neuen Ort ohne Karte zu finden, ist es auch für Google manchmal alle Seiten deiner Webseite ohne Sitemap zu finden.Glücklicherweise ist es schnell und einfach möglich eine XML-Sitemap zu erstellen und bei Google einzureichen.Weiter unten gehen wir Schritt für Schritt durch, wie man das tun kann.Aber lass uns zunächst einige Grundlagen durchgehen.(Du kennst die Grundlagen schon? Klicke hier um direkt zum Erstellen einer Sitemap zu springen.)Was ist eine Sitemap?Eine Sitemap ist eine XML-Datei, die alle wichtigen Inhalte auf deiner Webseite auflistet. Jede Seite oder Datei, die du bei Suchmaschinen erscheinen lassen möchtest, sollte in deiner Sitemap sein.Lustige TatsacheSitemaps können nicht mehr als 50.000 URLs auflisten und sie können nicht größer als 50 MB sein. Sollte deine Sitemap ein oder mehr dieser Zahlen übersteigen, dann musst du mehr als eine erstellen.Wie sieht eine XML-Sitemap aus?XML-Sitemaps sind für Suchmaschinen gemacht, nicht für Menschen. Deshalb können sie etwas überwältigend aussehen, wenn du nie eine zuvor gesehen hast.<?xml version=\"1.0\" encoding=\"UTF-8\"?> <urlset xmlns=\"http://www.sitemaps.org/schemas/sitemap/0.9\"> <url> <loc>https://ahrefs.com/</loc> <lastmod>2019-08-21T16:12:20+03:00</lastmod> </url> <url> <loc>https://ahrefs.com.com/blog/</loc> <lastmod>2019-07-31T07:56:12+03:00</lastmod> </url> </urlset> Lass uns das herunterbrechen.XML-Deklaration<?xml version=\"1.0\" encoding=\"UTF-8\"?>Dies teilt Suchmaschinen mit, dass sie eine XML-Datei lesen. Sie gibt außerdem die Version des XML und das benutzte Character Encoding an. Für Sitemaps sollte die Version 1.0 genutzt werden und das Encoding muss UTF‑8 sein.URL Set<urlset xmlns=\"http://www.sitemaps.org/schemas/sitemap/0.9\">Dabei handelt es sich um einen Container für alle URLs in der Sitemap. Es gibt außerdem gegenüber Crawlern an, welcher Protokoll-Standard benutzt wird. Die meisten Sitemaps spezifizieren den Sitemap 0.90-Standard, welcher neben anderen auch von Google, Yahoo! und Microsoft unterstützt wird.URL<url> <loc>https://ahrefs.com/</loc> <lastmod>2019-08-21T16:12:20+03:00</lastmod> </url>Das ist der Eltern-Tag für jede URL. Du musst den Ort einer URL in einem verschachtelten <loc> Tag angeben. Ganz wichtig ist, dass diese absolute, keine relativen, kanonischen URLs sein müssen.Obwohl das der einzige benötigte Tag hier ist, gibt es ein paar optionale Properties:<lastmod>: Spezifiziert das Datum, wann die Datei das letzte Mal angepasst wurde. Dies muss im W3C-Datumsformat stattfinden. Wenn du zum Beispiel einen Artikel am 25. September 2019 aktualisiert hast, dann würde das Attribut 2019-09-25 lauten. Du kannst außerdem die Uhrzeit hinzufügen, aber das ist optional.<priority>: Spezifiziert die Priorität der URL relativ zu allen anderen URLs auf der Seite. Die Werte rangieren zwischen 0.0 und 1.0. Höher ist wichtiger.<changefreq>: Spezifiziert wie häufig sich die Seite wahrscheinlich ändert. Sein Zweck ist es, Suchmaschinen einen Eindruck davon zu geben, wie häufig sie die URL nochmals crawlen sollten. Gültige Werte sind hier always, hourly, daily, weekly, monthly, yearly, und never.Keine dieser optionalen Tags ist wirklich sehr wichtig für SEO.Zu <lastmod>, gibt Googles Gary Ilyes an, dass sie es in den meisten Fällen ignorieren, da “Webmaster einen schrecklichen Job machen, um es korrekt zu halten.” Weil viele Sitemap-Generatoren dies auf das aktuelle Datum für alle Seiten setzen und nicht auf das Datum wann die Datei das letzte mal bearbeitet wurde, ist es einfach zu verstehen, warum.Zu <priority>, sagt Google sie ignorieren diesen Tag, weil es nur ein “großes Wirrwarr” darstellt.Zu <changefreq>, sagt John Mueller “Priority und Changefreq spielen keine so große Rolle mehr bei Sitemaps.”Warum benötige ich eine Sitemap?Google entdeckt neue Inhalte durch das Crawlen des Internets. Wenn sie eine Seite crawlen, dann berücksichtigen sie beides, interne und externe Verlinkungen auf dieser Seite. Sollte eine entdeckte Seite nicht in ihrem Suchindex sein, dann können sie deren Inhalte parsen und indexieren, wo es Sinn ergibt.Doch Google kann nicht alle Inhalte auf diesem Weg finden. Sollte eine Seite nicht durch andere bekannte Seiten verlinkt sein, werden sie diese nicht finden.Das ist der Punkt wo Sitemaps zum Tragen kommen.Sitemaps zeigen Google (und anderen Suchmaschinen), wo sie die wichtigsten Seiten deiner Webseite finden können, damit sie diese crawlen und indexieren können. Das ist wichtig, weil Suchmaschinen keine Inhalte ranken können, ohne diese zuvor zu indexieren.Wie man eine Sitemap erstelltEinige CMS generieren eine Sitemap für dich. Diese wird automatisch aktualisiert, wenn du Seiten und Posts zu deiner Seite hinzufügst oder entfernst. Wenn dein CMS dies nicht kann, dann ist in der Regel ein Plugin verfügbar, welches dies übernehmen kann.Eine Sitemap in WordPress erstellenObwohl WordPress hinter 34,5% aller Websites steckt, generiert es keine Sitemap für dich. Um eine zu erstellen, musst du ein Plugin wie Yoast SEO verwenden.Um Yoast zu installieren, logge dich auf deinem WordPress-Dashboard ein.Gehe zu Plugins > Neue hinzufügen.Suche nach “Yoast SEO.”Klicke “Jetzt installieren” beim ersten Ergebnis und dann “Aktivieren”.Gehe zu SEO > Allgemein > Features. Stelle sicher, dass der Punkt “XML-Sitemaps” eingeschaltet ist.Du solltest deine Sitemap (oder Index-Sitemap) nun unter yourdomain.com/sitemap.xml oder yourdomain.com/sitemap_index.xml sehen.Nebenbei bemerkt. Wenn deine WordPress-Installation in einem Unterordner oder auf einer Subdomain liegt, dann liegt deine Sitemap unter diesem Pfad. Die Sitemap unseres Blogs beispielsweise ist erreichbar unter ahrefs.com/blog/sitemap_index.xml.TIPPWenn du explizit einige Seitentypen (Tags, Kategorieseiten, etc.) in deiner Sitemap ein- oder ausschließen möchtest, dann gehe zu den “Sucherscheinungs”-Einstellungen.Du kannst außerdem individuelle Posts oder Seiten über die “Erweitert”-Meta Box im Editor ausschließen.WICHTIG. Schließe nur Seiten von deiner Sitemap aus, die du nicht in den Suchergebnissen sehen möchtest.Erfahre mehr darüber in unserem WordPress SEO Guide.Eine Sitemap in Wix erstellenWix erstellt automatisch eine Sitemap für dich. Du kannst sie unter yourwixsite.com/sitemap.xml finden.Leider hast du nicht viel Kontrolle darüber, welche Seiten in deine Sitemap gelangen oder nicht. Wenn du eine Seite ausschließen möchtest, dann gehe zum “SEO (Google)”-Einstellungsreiter für diese Seite und stelle den “Zeige diese Seite in den Suchergebnissen”-Schalter ab.Bedenke, dass dies ebenfalls einen noindex Meta-Tag zu dieser Seite hinzufügt, was dazu führen wird, dass sie nicht in den Suchergebnissen erscheinen wird.Nebenbei bemerkt. Wenn du eine URL in Wix kanonisierst, dann wird sie nicht aus deiner Sitemap entfernt. Während das die meisten Nutzer vermutlich nicht beeinträchtigt, solltest du dir im Klaren sein, dass kanonisierte Seiten in die Sitemap aufzunehmen kein Best Practice ist und gemischte Signale an Google senden kann. Eine Sitemap mit Squarespace erstellenSquarespace erstellt ebenfalls automatisch eine Sitemap für dich. Du kannst sie normalerweise unter yoursquarespacesite.com/sitemap.xml finden.Es gibt keine Möglichkeit deine Sitemap in Squarespace manuell zu bearbeiten, aber du kannst Noindex-Seiten aus Suchmaschinen mittels des “SEO”-Reiters ausschließen.Dies wird die Seiten auch aus deiner Sitemap entfernen.Eine Sitemap in Shopify erstellenShopify erstellt automatisch eine Sitemap für dich. Du kannst sie unter yourstore.com/sitemap.xml finden.Leider gibt es keine einfache Möglichkeit eine Seite in Shopify auf noindex zu setzen. Du musst den Code in den .liquid-Dateien direkt bearbeiten.Eine Sitemap ohne CMS erstellenWenn du glaubst, dass du weniger als ~300 Seiten auf deiner Webseite hast, dann installiere dir die kostenlose Version von Screaming Frog.Sobald er installiert ist, gehe zu Modus > Spider.Füge deine Homepage URL in die Box mit dem Namen “Enter URL to spider.”Klicke “Start.”Nebenbei bemerkt. Stelle sicher, dass du die kanonische Version (Hauptversion) deiner Homepage crawlst. Wenn du das nicht tust, wird Screaming Frog nur eine URL crawlen. Schaue in die untere, rechte Ecke sobald der Crawl fertig ist.Es wird so etwas wie das hier dort stehen:Wenn die Zahl 499 oder kleiner ist, gehe zu Sitemaps > XML sitemap.Da Google keine große Beachtung schenkt bezüglich <lastmod>, <changefreq>, und <priority>, empfehlen wir diese aus der Sitemap-Datei auszuschließen.Klicke “Next” und speichere die Sitemap auf deinem Computer. Erledigt.Wenn die Zahl “500 von 500” zeigt, dann macht es keinen Sinn die Sitemap zu exportieren. Weshalb? Weil es bedeutet, dass du das Crawl-Limit erreicht hast, bevor alle Seiten deiner Website gecrawlt werden konnten. Das hat zum Ergebnis, dass hunderte Seiten in der exportierten Sitemap fehlen könnten—was es ziemlich sinnlos macht.Eine Möglichkeit das zu lösen, ist einen kostenlosen Sitemap-Generator zu suchen. Es gibt viele davon.Leider sind die meisten nicht zuverlässig.Wir testeten einige der beliebtesten Generatoren und fanden heraus, dass nicht wenige nicht-kanonische URLs, nicht indexierte Seiten und Weiterleitungen enthielten. Das ist schlecht praktiziertes SEO.GeneratorVerwendet kanonisierte URLs?Verwendet nicht-indexierbare URLs?Verwendet Weiterleitungen?xml-sitemaps.comJa ❌Nein ✅Nein ✅web-site-map.comJa ❌Nein ✅Nein ✅xmlsitemapgenerator.orgJa ❌Nein ✅Nein ✅smallseotools.com/xml-sitemap-generatorJa ❌Ja ❌Ja ❌freesitemapgenerator.comJa ❌Ja ❌Ja ❌duplichecker.com/xml-sitemap-generator.phpJa ❌Ja ❌Ja ❌xsitemap.comJa ❌Ja ❌Ja ❌Also was ist die Lösung?Wenn Screaming Frog nicht deine gesamte Seite crawlen konnte, dann crawle deine Seite mit Ahrefs Site Audit.https://www.youtube.com/watch?v=LjinWqfGyVENebenbei bemerkt. Verifiziere deine Seite für schnelleres Crawling. Hier siehst du wie das geht. Sobald der Crawl vollständig ist, solltest du zum Page Explorer gehen und diese Filter hinzufügen.Klicke Exportieren > Aktuelle Tabellenansicht.Öffne die CSV-Datei, dann kopiere all die URLs der URL-Spalte und füge sie in dieses Tool ein.Klicke “Zur Warteschlange hinzufügen” dann “Exportiere Warteschlange als sitemap.xml.”Diese Datei ist deine fertige Sitemap.Wie man eine Sitemap bei Google einreichtUm loszulegen, solltest du wissen, wo sich deine Sitemap befindet.Wenn du ein Plugin benutzt, sind die Chancen hoch, dass die URL folgendes lautet: domain.com/sitemap.xml.Wenn du das manuell machst, dann nenne deine Sitemap z.B. sitemap.xml und lade sie dann in das Stammverzeichnis deiner Webseite. Du solltest die Sitemap dann unter domain.com/sitemap.xml erreichen können.Nebenbei bemerkt. Du kannst jegliche Namen für deine Sitemap verwenden, aber es ist empfehlenswert bei sitemap.xml zu bleiben. Wenn du mehrere Sitemaps hast, dann kannst du ein simples Namensschema wie sitemap_1.xml, sitemap_2.xml verwenden. Gehe zu Google Search Console > Sitemaps > Füge in Sitemap-Location ein > Klicke “Bestätigen”Das war es. Fertig.TIPPEs ist außerdem sinnvoll deine Sitemap URL(s) zur robots.txt hinzuzufügen.Du kannst diese Datei im Stammverzeichnis deines Webservers finden. Um deine Sitemap hinzuzufügen, öffne die Datei und füge folgende Zeile ein:Sitemap: https://www.yourdomain.com/sitemap.xmlDu musst die Beispiel-URL mit dem Ort deiner Sitemap austauschen.Wenn du mehrere Sitemaps hast, dann füge mehrere Zeilen hinzu.Sitemap: https://www.asos.com/sitemap_1.xml Sitemap: https://www.asos.com/sitemap_2.xmlÜbliche Website-Fehler, die deine Sitemap betreffenDie Google Search Console zeigt dir die meisten technischen Fehler, die mit deiner Sitemap zu tun haben.Zum Beispiel ist hier eine Warnung, dass eine unserer übermittelten URLs durch die robots.txt geblockt wird:Du kannst über dieses Thema und wie man es lösen kann hier mehr erfahren.Dennoch gibt es einige Probleme, zu denen Google dir nichts sagt.Unten findest du einige der häufigsten Fehler und wie man sie finden und beheben kann.Nutzlose Seiten mit geringfügiger Qualität in deiner SitemapJede Seite in deiner Sitemap sollte nun indexierbar und kanonisch sein.Leider bedeutet das nicht, dass alle Seiten von hoher Qualität sind. Wenn du eine große Menge an Inhalten hast, ist die Wahrscheinlichkeit groß, dass Seiten mit minderwertiger Qualität es in die Sitemap geschafft haben.Schaue dir zum Beispiel folgende beiden Seiten auf einer E‑Commerce-Seite an:Keine davon ist wertvoll für Suchende, trotzdem sind sie in der Sitemap der Seite und Google hat beide indexiert.Um diese Seiten zu finden, gehe zu Site Audit > Duplicate contentSchaue nach Bereichen mit doppelten und beinahe doppelten Seiten ohne Canonicals. Das sind die orangenen Quadrate. Klicke eines an, um die Seiten in der Gruppe zu sehen.Schau dir die Seiten an und prüfe, ob sie irgendeinen Wert haben.Seiten mit geringer Qualität auf der Webseite zu haben ist schlecht aus drei Gründen:Sie verschwenden Crawl-Budget. Google dazu zu bringen, Zeit und Ressourcen darauf zu verschwenden, nutzlose, schlechte Seiten zu crawlen ist nicht ideal. Sie könnten diese Zeit investieren, um stattdessen wichtigere Inhalte zu crawlen. (Zum Festhalten: Google sagt, dass Crawl-Budget “nichts ist worüber sich die meisten Publisher Sorgen machen müssten.”)Sie “stehlen” Link-Autorität von wichtigeren Seiten. Es gibt eine eindeutige Korrelation zwischen der Autorität von Seiten und ihren Rankings. Interne Links auf schlechte Seiten führen nur dazu, dass die Autorität die zu wichtigeren Seiten fließen könnte, abgeschwächt wird. (Interessanterweise sahen wir einen Anstieg an Stelle eines Abschwungs an Traffic, als wir beinahe die Hälfte der Artikel des Ahrefs-Blogs gelöscht hatten.)Sie führen zu einer schlechteren Nutzererfahrung. Es ergibt keinen Mehrwert für Besucher auf diesen Seiten zu landen. Es ist ärgerlich für Besucher darauf zu klicken und sie könnten die Seite verlassen, wenn sie denken, dass die Seite schlecht oder vernachlässigt ist.Alles in allem ist die beste Maßnahme minderwertige Inhalte von deiner Webseite und somit auch der Sitemap zu entfernen. Wenn du das machst, dann solltest du daran denken die internen Links zu diesen Seiten zu entfernen. Solltest du das nicht tun, würde das dazu führen, dass ein Problem (minderwertige Inhalte) mit einem anderen (kaputte Links) getauscht wird.Neben Duplikaten und beinahe Duplikaten kannst du auch nach Seiten mit wenigen Inhalten suchen.Prüfe einfach den “On-Page”-Bericht im Site Audit für Seiten mit einer “Geringe Wortanzahl”-Warnung.Seiten, die versehentlich aus der Sitemap ausgeschlossen werdenWenn du eine der empfohlenen Methoden von oben umgesetzt hast, um deine Sitemap zu erstellen, dann werden Seiten mit noindex oder Canonical Tags (nicht selbstreferentiell) nicht aufgenommen.Das ist eine gute Sache. Du solltest keine kanonisierten URLs oder nicht-indexierbare Seiten in deiner Sitemap aufnehmen.Das bedeutet, dass wenn du inkonsistente noindex-Tags auf deiner Seite hast, dann können Seiten fehlerhafterweise ausgeschlossen werden.Gehe, um nach Fehlern zu suchen, zum “Indexability”-Bericht in Site Audit und klicke auf die “Noindex page”-Warnung. Dies zeigt alle nicht-indexierten Seiten.Die meisten davon werden mit Absicht nicht indexierbar sein, aber es ist sinnvoll doppelt zu prüfen. Normalerweise sind falsche Noindex-Tags einfach zu erkennen, da sie auf ganzen Unterbereichen deiner Webseite existieren.Wenn du irgendwelche Seiten feststellst, die nicht auf noindex gesetzt sein sollten, dann entferne den noindex-Tag von der Seite und füge sie deiner Sitemap hinzu. Wenn du ein CMS benutzt, dann sollte das automatisch passieren.PROFI TIPPEs macht außerdem Sinn, auf falsche Canonicals und Weiterleitungen zu prüfen. Um das zu tun, gehe zum Page Explorer und füge folgende Filter hinzu:Entferne sämtliche falsche Canonicals und Weiterleitungen und füge die betreffenden Seiten dann deiner Sitemap hinzu.FAQsHier findest du einige Antworten zu häufig gestellten Fragen über Sitemaps. Lass uns wissen, wenn du weitere Fragen hast, die hier nicht beantwortet wurden und wir werden sie hinzufügen.Benötigt man eine Sitemap für AMP-Seiten?Nope.@Kfowler325 No need for sitemaps for AMP pages — the rel=amphtml link is enough for us.— 🍌 John 🍌 (@JohnMu) 13 October 2016Wie erstelle ich eine Sitemap für eine E‑Commerce-Webseite?Du kannst eine Sitemap für eine E‑Commerce-Seite auf dieselbe Art und Weise erstellen, wie du es für jede Seite tun würdest. Dabei solltest du insbesondere prüfen, ob es doppelte oder beinahe doppelte Inhalte auf deiner E‑Commerce-Seite gibt, da diese häufig im großen Stil durch das Raster rutschen z.B. durch eine facettierte Navigation.SchlussgedankenEine Sitemap zu erstellen ist keine Raketenwissenschaft, insbesondere wenn du ein Plugin benutzt, das die Hauptarbeit für dich übernimmt. Es ist auch nicht schwer eine von Hand zu erstellen—Crawle einfach deine Seite und formatiere die daraus resultierende Liste an URLs.Hierbei darf man nicht vergessen, dass Google keine Seiten in deiner Sitemap indexieren muss. Sitemaps haben außerdem nichts mit Rankings zu tun.Wenn du besser bei Google ranken möchtest, dann lies das.Hast du Fragen? Lasse es mich in den Kommentaren oder auf Twitter wissen.Übersetzt von: Sebastian Simon. Sebastian Simon beschäftigt sich seit 2009 mit SEO, aktuell tut er das bei seven-bytes.de und heine.de. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Joshua Hardwick Head of Content @ Ahrefs (oder, in einfachen Worten, ich bin der Typ, der dafür sorgt, dass jeder Blog-Post EPISCH wird).",
  "headers": [
    {
      "level": "H1",
      "text": "Wie man eine XML-Sitemap erstellt (und sie bei Google einreicht)"
    },
    {
      "level": "H2",
      "text": "Was ist eine Sitemap?"
    },
    {
      "level": "H2",
      "text": "Wie sieht eine XML-Sitemap aus?"
    },
    {
      "level": "H3",
      "text": "XML-Deklaration"
    },
    {
      "level": "H3",
      "text": "URL Set"
    },
    {
      "level": "H3",
      "text": "URL"
    },
    {
      "level": "H2",
      "text": "Warum benötige ich eine Sitemap?"
    },
    {
      "level": "H2",
      "text": "Wie man eine Sitemap erstellt"
    },
    {
      "level": "H3",
      "text": "Eine Sitemap in WordPress erstellen"
    },
    {
      "level": "H3",
      "text": "Eine Sitemap in Wix erstellen"
    },
    {
      "level": "H3",
      "text": "Eine Sitemap mit Squarespace erstellen"
    },
    {
      "level": "H3",
      "text": "Eine Sitemap in Shopify erstellen"
    },
    {
      "level": "H3",
      "text": "Eine Sitemap ohne CMS erstellen"
    },
    {
      "level": "H2",
      "text": "Wie man eine Sitemap bei Google einreicht"
    },
    {
      "level": "H2",
      "text": "Übliche Website-Fehler, die deine Sitemap betreffen"
    },
    {
      "level": "H3",
      "text": "Nutzlose Seiten mit geringfügiger Qualität in deiner Sitemap"
    },
    {
      "level": "H3",
      "text": "Seiten, die versehentlich aus der Sitemap ausgeschlossen werden"
    },
    {
      "level": "H2",
      "text": "FAQs"
    },
    {
      "level": "H3",
      "text": "Benötigt man eine Sitemap für AMP-Seiten?"
    },
    {
      "level": "H3",
      "text": "Wie erstelle ich eine Sitemap für eine E‑Commerce-Webseite?"
    },
    {
      "level": "H2",
      "text": "Schlussgedanken"
    }
  ],
  "author": "Joshua Hardwick"
}