{
  "url": "https://ahrefs.com/blog/de/wie-man-google-analytics-benutzt/",
  "slug": "wie-man-google-analytics-benutzt",
  "title": "Google Analytics 4 für Anfänger [Leitfaden für 2021]",
  "description": "Google Analytics 4 (GA4) ist ein kostenloses Web Analytics Tool von Google, mit dem du den Traffic und das Verhalten der Nutzer auf deiner Website verfolgen und messen kannst.",
  "content": "Kayle Larkin Datengetriebener SEM-Stratege. Er hat es sich zur Aufgabe gemacht, Analysen leicht verständlich und für alle Unternehmer zugänglich zu machen. Inhalt Eine erfolgreiche Website ohne Daten aufzubauen ist schwer. Wirklich schwer. Es ist wie ein Drahtseilakt mit verbundenen Augen, es ist möglich, aber es ist viel einfacher, wenn man etwas sieht.Hier kommt Google Analytics ins Spiel.Google Analytics sorgt für mehr Durchblick und ermöglicht es dir, zu erfahren, wer deine Website besucht, wie die Nutzer sie finden und was sie dort tun. Anhand dieser Daten kannst du mit Zuversicht einen Fuß vor den anderen setzen, um deine Website zu verbessern.In diesem Leitfaden erfährst du:Was Google Analytics 4 istWarum du Google Analytics nutzen solltestWie du Google Analytics einrichtestWie du Google Analytics verwendestWie du deine Website mit Google Analytics verbessern kannstWas ist Google Analytics 4?Google Analytics 4 (GA4) ist ein Web Analytics Tool von Google, mit dem du den Traffic und das Verhalten der Nutzer auf deiner Website kostenlos verfolgen und messen kannst. Es wird von schätzungsweise 28,8 Millionen Websites genutzt und hat damit einen geschätzten Anteil von 85,9 % am Webanalysemarkt.So sieht es aus:Nebenbei bemerkt. GA4 hat Universal Analytics im Oktober 2020 ersetzt. Es ist jetzt die Standardeinstellung für alle neuen Google Analytics-Eigenschaften. Warum du Google Analytics nutzen solltestDu hast deine Website eingerichtet, um potenzielle Kunden über deine Produkte oder Dienstleistungen zu informieren und sie zu treuen Kunden zu konvertieren. Um das zu erreichen, musst du wissen, woher die Besucher kommen, wofür sie sich am meisten interessieren und welche Berührungspunkte dazu beitragen, sie zu Kunden zu machen.Wenn du deine Daten mit GA4 aufzeichnest und analysierst, kannst du digitale Marketingstrategien entwickeln, um mehr Besucher anzuziehen und mehr Geld zu verdienen.Ist Google Analytics gratis?Google Analytics ist völlig kostenlos, hat aber Erfassungs- und Konfigurationsgrenzen. Die meisten KMU werden diese Grenzen nie überschreiten. Wenn du dir Sorgen machst, achte auf das grüne Häkchen neben jedem Berichtstitel; das bestätigt, dass du in dem Bericht keine Stichprobendaten siehst.Nebenbei bemerkt. Google Analytics 360 ist die kostenpflichtige Version von Google Analytics, die im Durchschnitt 150.000 US-Dollar pro Jahr kostet. Auf Unternehmensebene unterstützt dieser Service dabei, bis zu 500 Millionen Zugriffen pro Monat zu erzielen und bietet Unterstützung bei der Implementierung und dem technischen Support. Wie du Google Analytics einrichtestGenauso wie du keinen Fisch fangen kannst, ohne vorher dein Netz auszuwerfen, kann Google Analytics keine Daten sammeln, ohne installiert zu sein. Je früher du es also einrichtest, desto besser.Folge diesen drei Schritten, um Google Analytics zu installieren und zu testen:1. Erstelle und richte dein Google Analytics-Konto einFolge diesen Anweisungen, um dein Konto korrekt einzurichten:Öffne analytics.google.com.Klicke auf Messung starten.Gib einen Kontonamen ein (Dies ist für interne Zwecke. Wir empfehlen, deinen Firmennamen zu verwenden.)Bearbeite die Einstellungen für die Datenfreigabe (optional).Klicke auf Weiter.Gib einen Namen ein (Dies ist nur für den internen Gebrauch und deine Website-Domain eignet sich gut, besonders wenn du mit mehreren Websites unter einem Unternehmen arbeitest).Überprüfe die Meldezeitzone und die Währung (diese sollten dem Standort deines Unternehmens entsprechen).Klicke auf Erweiterte Optionen anzeigen.Schalte die Option “University Analytics-Eigenschaft erstellen” ein (dies gilt als Best Practice, um die erweiterten GA4-Maßnahmen zu aktivieren).Gib die Website-URL ein.Klicke auf Weiter.Gib Informationen zur Branche und Unternehmensgröße ein (optional).Klicke auf Erstellen.Akzeptiere die Google Analytics-Nutzungsbedingungen (Mach dich mit ihnen vertraut, bevor du zustimmst, da es für deinen Standort besondere Datenschutzbestimmungen geben kann).Überprüfe die Details des Webstreams (Achte darauf, dass alles korrekt ist, z. B. HTTP vs. HTTPS und www vs. nicht-www. Dies kann die Genauigkeit der Daten verfälschen).2. Füge das GA-Tag zu deiner Website hinzuBevor Google Analytics Daten sammeln kann, musst du das GA-Tag auf deiner Website installieren. Wie du das am einfachsten schaffst, hängt von der Konfiguration deiner Website ab.Wenn du WordPress verwendest…Installiere das GA Google Analytics Plugin.Rufe die Plugin-Einstellungen auf.Kopiere deine Measurement ID aus Google Analytics.Füge die Messungs-ID in das Feld GA-Tracking-ID in den Plugin-Einstellungen ein.Wähle Global Side Tag aus den Tracking-Methoden-Optionen.Klicke auf Änderungen speichern.Wenn du Wix verwendest…Rufe die Marketing-Integrationen auf.Unter Google Analytics, klicke auf Verbinden.Klicke auf Google Analytics verbinden.Füge deine Measurement ID von Google Analytics in das Pop-up-Fenster ein.Aktiviere das Kontrollkästchen IP-Anonymisierung, wenn du die IP-Adressen der Besucher vor Google verbergen möchtest.Klicke auf Speichern.Wenn du ein anderes CMS/eine andere Plattform verwendest…Google hat Links zu Anleitungen für die meisten CMS hier aufgelistet. Du wirst jedoch feststellen, dass nicht alle Plattformen die neue “G-” ID in GA4 bieten. In einigen Fällen musst du die Installation also manuell vornehmen, indem du den vollständigen gtag.js-Code in den <head> Abschnitt deiner Website kopierst.Alternativ kannst du auch den Google Tag Manager (GTM) verwenden. GTM ist eine etwas fortgeschrittene Option für Anfänger. Dennoch ist es meine bevorzugte Methode für das Hinzufügen von On-Page-Tags, weil ich normalerweise mehrere Marketing-Performance-Tags hinzufügen muss (Facebook, HubSpot, etc.).Wenn du mehr über den Google Tag Manager erfahren möchtest, lies das.3. Teste dein Set-upFehler beim Google Analytics-Tracking sind keine Seltenheit. Deshalb ist es wichtig, dass du dein Set-up testest, bevor du Feierabend machst.Es gibt verschiedene Möglichkeiten, dies zu tun, aber die bei weitem einfachste ist die Chrome-Erweiterung Tag Assistant von Google. Es handelt sich zwar um ein älteres Produkt, aber es funktioniert nach wie vor und kann immer noch heruntergeladen werden.Hier erfährst du, wie du deine Einstellungen mit der Erweiterung testen kannst:Installiere die Erweiterung.Öffne deine Website.Klicke auf das Symbol der Erweiterung in deiner Browserleiste.Klicke auf Aktivieren und aktualisiere deine Webseite.Ein nicht korrekt installierter Tag wird mit einem traurigen Smiley und rot dargestellt:Ein korrekt installierter Tag wird mit einem fröhlichen Smiley und grün dargestellt:So richtest du Zielvorhaben einGoogle Analytics beginnt automatisch mit der Messung des Traffics auf deiner Website und der Nutzerinteraktionen wie Seitenscrollen, ausgehende Klicks, Suchvorgänge auf der Website, Video-Engagement und Dateidownloads.Alle diese automatisch verfolgten Ereignisse können als Ziele markiert werden. Alle zusätzlichen Ziele, wie z.B. das Ausfüllen von Formularen oder Telefonanrufe, musst du mit GTM als Ereignis einrichten.In deiner GA4-Eigenschaft klickst du in der linken Navigation auf “Konfigurieren” (es sieht aus wie ein Tischsymbol).Schiebe einfach das Kästchen “Als Konvertierung markieren” für die Ereignisse, die du als Konvertierung auslösen möchtest.Wie du Google Analytics verwendestWenn du alles richtig eingerichtet hast, fragst du dich wahrscheinlich, wie du Google Analytics nun nutzen kannst. Diese Frage ist schwer zu beantworten, denn es gibt dafür keine einheitliche Methode. Google Analytics kann dir Hunderte von Informationen über deine Website liefern, und die Art und Weise, wie du es nutzt, hängt von den Daten ab, die du wissen möchtest.Aus diesem Grund werde ich hier nicht versuchen, jeden einzelnen Bericht zu erklären, sondern nur die Grundlagen erläutern, wie du GA4 nutzen kannst, um zu verstehen, wie Nutzer auf deine Website kommen, was sie dort tun und wie die Kunden über mehrere Kanäle zur Conversion gelangen.AkquiseAkquisitions-Berichte zeigen dir, wie die Nutzer auf deine Website kommen. In GA4 wird dies in zwei Kategorien unterteilt: Nutzerakquise und Traffic-Akquise.Die Berichte zur Nutzerakquise basieren auf dem Engagement der Nutzer, während die Traffic-Akquise auf dem Engagement der Sessions basiert. Diese Unterscheidung ist wichtig, weil ein Nutzer mehrere Sessions haben kann. Aus diesem Grund werden wir den Bericht zur Nutzerakquise erläutern.So gelangst du zum Bericht über die Nutzerakquise:Melde dich bei Google Analytics an.Klicke auf Lebenszyklus-Berichte erweitern.Klicke auf Akquisitions-Berichte.Klicke auf Nutzerakquise.Du kannst deinen Bericht segmentieren, indem du einen Vergleich für demografische Daten der Nutzer, ein Gerät oder ein benutzerdefiniertes Ereignis wie einen bestimmten Gutscheincode hinzufügst.Bleiben wir vorerst bei der Gesamtansicht und belassen wir es bei “Alle Nutzer”:Das Balkendiagramm und das Streudiagramm werden automatisch mit den Kennzahlen gefüllt, die du in der Tabelle unten festgelegt hast.Im obigen Beispiel haben wir “Erstes Nutzermedium” als Dimension in der ersten Spalte der Tabelle gewählt. Dies zeigt uns die Quelle, über die die Nutzer zuerst gewonnen wurden. Zum Beispiel fasst “organisch” den Traffic aus allen organischen Quellen zusammen: Google, Bing, Yahoo, etc.EngagementEngagement-Berichte zeigen dir, was die Nutzer auf deiner Website tun. Das Engagement wird anhand der durchschnittlichen Dauer, die deine Website im Mittelpunkt des Browsers stand, der Anzahl der Nutzer, die mindestens 90 % der Seite gescrollt haben, der Anzahl der Ereignisse und der Anzahl der Conversions gemessen.Werfen wir einen Blick auf einen der Engagement-Berichte: Seiten und Bildschirme.Um zu diesem Bericht zu gelangen:Melde dich bei Google Analytics an.Klicke auf Lebenszyklus-Berichte erweitern.Klicke auf Engagement-Berichte.Klicke auf Seiten und Bildschirme.Segmentiere deinen Bericht, indem du einen Vergleich für den Marketingkanal hinzufügst, den du analysieren möchtest. Nimm zum Beispiel die Dimension “Erstes Nutzermedium” mit dem Wert “organisch” auf.Das Balkendiagramm und das Punktediagramm werden automatisch mit den von dir in der Tabelle unten festgelegten Metriken gefüllt.Du kannst die Dimension bearbeiten, die das beschreibende Attribut oder Merkmal der Daten in Spalte 1 ändert. Wenn du zum Beispiel “Seitentitel und Bildschirmklasse” auswählst, wird der Seitentitel angezeigt, während “Seitenpfad + Abfragezeichenfolge und Bildschirmklasse” die URL anzeigt.Die restlichen Spalten in der Tabelle zeigen “Metriken”. Eine Metrik ist ein bestimmtes Element der Dimension. Zum Beispiel kann die Dimension “Seitentitel” mit einer Kennzahl wie “Neue Nutzer”, “Unique User Scrolls”, “Ereigniszählungen” und anderen Engagement-Kennzahlen verknüpft werden.ConversionsDer Conversions-Bericht zeigt dir, welche Nutzeraktivitäten zum Erfolg deines Unternehmens beitragen. Bei einem E‑Commerce-Shop könnte das ein Kauf sein. Bei einer Website zur Leadgenerierung könnte es das Ausfüllen eines Kontaktformulars sein.In GA4 werden die “Ziele” als Conversion-Ereignisse gemessen. Die Ereignisdaten, die du in deinen GA4-Berichten siehst, werden ausgelöst, wenn Nutzer mit deiner Website interagieren.So gelangst du zum Conversions-Bericht:Melde dich bei Google Analytics an.Klicke auf Lebenszyklus-Berichte erweitern.Klicke auf Engagement-Berichte erweitern.Klicke auf Conversions.Nebenbei bemerkt. Der Conversions-Bericht ist eigentlich eine Art Engagement-Bericht, aber ich wollte darauf hinweisen, weil er einer der wichtigsten Berichte in GA4 ist. Das Balkendiagramm und das Streudiagramm werden automatisch mit den Kennzahlen gefüllt, die du in der Tabelle unten festgelegt hast.In der Tabelle findest du eine Auflistung der Ereignisse nach Namen, Anzahl der zugehörigen Conversions, Gesamtnutzer und Einnahmen des Ereignisses. Klicke auf den Namen eines Ereignisses, um einen Bericht über dieses Ereignis zu öffnen.In einem E‑Commerce-Shop möchtest du vielleicht zusätzliche Informationen über die Nutzer sehen, die den Bestellvorgang beginnen. Dazu klickst du auf den Ereignisnamen “begin_checkout”.Daraufhin wird ein neuer Bericht geöffnet, der die Traffic-Quelle, die Anzahl der Conversions und den Wert nur für das ausgewählte Ereignis anzeigt.Klicke auf die Dropdown-Menüs in der oberen linken Ecke des Liniendiagramms, um die Metriken und Dimensionen im Bericht anzupassen.Du kannst zum Beispiel wählen, ob du die Anzahl der Conversions oder den Ereigniswert anzeigen möchtest. Du kannst auch die Herkunft der Ereignisse nach Ereignisquelle, Ereignismedium, Ereigniskampagne, Overtime oder nach Google Ads-Kennzahlen anzeigen lassen.Füge eine sekundäre Dimension, wie z.B. Stadt, zur Explorer-Tabelle hinzu, indem du auf das blaue Plus-Symbol neben Spalte 1 klickst.Wie du deine Website mit Google Analytics verbessern kannstGoogle Analytics einzurichten und zu verstehen, wie man Berichte konfiguriert, ist nur der Anfang. Der Vorteil, wenn du lernst, wie man GA4 benutzt, ist, dass du Marketingfragen mit echten Daten beantworten kannst.Wenn du Google Analytics gerade erst installiert hast, musst du mindestens 24–48 Stunden warten, bis die Daten in den Berichten angezeigt werden. Ich empfehle jedoch, mindestens 3–4 Wochen zu warten, bevor du eine Entscheidung auf der Grundlage der Berichte triffst.Im Folgenden findest du drei einfache Möglichkeiten, wie du die Daten in Google Analytics nutzen kannst, um deine Website zu verbessern.Verbessere den Traffic: Welche Kanäle bringen den meisten Traffic?Im Grunde geht es beim Suchmaschinenmarketing darum, mehr Nutzer auf eine Website zu locken. Um das zu erreichen, musst du wissen, welche Kanäle den meisten Traffic bringen.So findest du heraus, welche Marketingkanäle am besten funktionieren:Öffne den Bericht Nutzerakquise unter Akquise.Setze Spalte 1 auf Erstes Nutzermedium.Klicke auf die Überschrift Neue Nutzer, um die Tabelle absteigend nach Traffic-Volumen zu sortieren.Diese Marketingkanäle bringen die meisten neuen Nutzer (Erstbesucher) auf deine Website.Sieh dir weitere Kennzahlen in der Tabelle an, um den Beitrag der einzelnen Marketingkanäle zur Leistung deiner Website besser zu verstehen.Wenn du zum Beispiel auf die Engagement-Rate oder die durchschnittliche Engagement-Zeit klickst, erfährst du, welche Marketingmaßnahmen das Vertrauen der Besucher gewinnen.Die Engagement-Rate ist der Prozentsatz der Sitzungen, die mit deiner Website interagiert haben, geteilt durch alle Sessions. Im Gegensatz dazu ist die Verweildauer die durchschnittliche Zeit, in der deine Website im Vordergrund des Browserfensters des Nutzers stand.Um Verbesserungen zu messen, füge in der oberen rechten Ecke einen Vergleich für deinen Benchmark-Zeitraum hinzu.Verbessere die Effektivität der Inhalte: Welche Seiten bringen den meisten Traffic?Wenn du weißt, welche Inhalte den meisten organischen Traffic erzielen, kannst du deine Content-Marketing-Strategie besser abstimmen.Und so funktioniert es:Öffne den Bericht Seiten und Bildschirme unter Engagement.Klicke oben auf dem Bildschirm auf Alle Nutzer.Ändere die Dimension auf Erstes Nutzermedium.Wähle organisch als Dimensionswert.Klicke auf Anwenden.Klicke auf die Überschrift Neue Nutzer, um die Tabelle in absteigender Reihenfolge nach Traffic zu sortieren.Diese organischen Landing Pages bringen die meisten neuen Nutzer (Erstbesucher) auf deine Website. Du solltest mehr Artikel wie diese erstellen.Klicke ein zweites Mal auf die Kopfzeile, um die Tabelle nach aufsteigendem Wert zu sortieren. Wenn es organische Landing Pages mit null Traffic gibt, solltest du ihre Relevanz für deine Geschäftsziele neu bewerten und deine Strategie entsprechend anpassen. Dazu kann es gehören, den Inhalt neu zu veröffentlichen oder ihn von deiner Website zu entfernen.Verbessere das geografische Targeting: Woher kommen meine besten Kunden?Wenn du in Anzeigen oder SEO für mehrere Standorte investierst, brauchst du standortspezifische Einblicke, um zu verstehen, wo du deine Marketingaktivitäten verstärken oder verringern solltest. Hierfür kannst du den Bericht Demografische Details verwenden.So funktioniert es:Öffne den Bericht Demografische Details unter Demographie.Sortiere die Tabelle nach der Engagement-Rate, einem bestimmten Ereignis oder dem Gesamtumsatz.Dieser Bericht ist sehr nützlich für die Feinabstimmung der Standortausrichtung von Anzeigen.Wenn du deine Segmentierung genauer vornehmen möchtest, klicke auf das Dropdown-Menü Land in der ersten Spalte der Tabelle und ändere es zu Stadt oder Region.FazitDie Einrichtung von Google Analytics kann sich anfühlen, als würdest du Klingonisch lernen, aber für den Anfang reicht eine grundlegende Berichtserstellung aus. Wenn du zwanzig Minuten deines Tages investierst, um zu lernen, wie du GA4 einrichtest und wie du eine Handvoll Berichte erstellst, wird sich das immer wieder auszahlen.Der Erfolg liegt in den Daten.Hast du Fragen? Schreib mir auf Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human:",
  "headers": [
    {
      "level": "H1",
      "text": "Google Analytics 4 für Anfänger [Leitfaden für 2021]"
    },
    {
      "level": "H2",
      "text": "Was ist Google Analytics 4?"
    },
    {
      "level": "H2",
      "text": "Warum du Google Analytics nutzen solltest"
    },
    {
      "level": "H2",
      "text": "Ist Google Analytics gratis?"
    },
    {
      "level": "H2",
      "text": "Wie du Google Analytics einrichtest"
    },
    {
      "level": "H3",
      "text": "1. Erstelle und richte dein Google Analytics-Konto ein"
    },
    {
      "level": "H3",
      "text": "2. Füge das GA-Tag zu deiner Website hinzu"
    },
    {
      "level": "H4",
      "text": "Wenn du WordPress verwendest…"
    },
    {
      "level": "H4",
      "text": "Wenn du Wix verwendest…"
    },
    {
      "level": "H4",
      "text": "Wenn du ein anderes CMS/eine andere Plattform verwendest…"
    },
    {
      "level": "H3",
      "text": "3. Teste dein Set-up"
    },
    {
      "level": "H2",
      "text": "So richtest du Zielvorhaben ein"
    },
    {
      "level": "H2",
      "text": "Wie du Google Analytics verwendest"
    },
    {
      "level": "H3",
      "text": "Akquise"
    },
    {
      "level": "H3",
      "text": "Engagement"
    },
    {
      "level": "H3",
      "text": "Conversions"
    },
    {
      "level": "H2",
      "text": "Wie du deine Website mit Google Analytics verbessern kannst"
    },
    {
      "level": "H3",
      "text": "Verbessere den Traffic: Welche Kanäle bringen den meisten Traffic?"
    },
    {
      "level": "H3",
      "text": "Verbessere die Effektivität der Inhalte: Welche Seiten bringen den meisten Traffic?"
    },
    {
      "level": "H3",
      "text": "Verbessere das geografische Targeting: Woher kommen meine besten Kunden?"
    },
    {
      "level": "H2",
      "text": "Fazit"
    }
  ],
  "author": "Kayle Larkin"
}