{
  "url": "https://ahrefs.com/blog/de/wie-startet-man-ein-seo-business/",
  "slug": "wie-startet-man-ein-seo-business",
  "title": "Wie du dein SEO-Business in 6 Schritten aufbaust",
  "description": "Wenn du nach einem praktischen Leitfaden für die Gründung eines Lifestyle-SEO-Business suchst - von jemandem mit Erfahrung - dann ist dies der richtige Leitfaden für dich.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (oder, in einfachen Worten, ich bin der Typ, der dafür sorgt, dass jeder Blog-Post EPISCH wird). Article PerformanceData from AhrefsVerlinkung von Websites 2 Sign up for AhrefsGet SEO metrics of any website or URL.The number of websites linking to this post.This post's estimated monthly organic search traffic. Inhalt Ich arbeite seit über drei Jahren hauptberuflich für Ahrefs. Doch davor habe ich ein eigenes SEO-Unternehmen geführt.Mein Unternehmen war nicht besonders groß. Zu Spitzenzeiten habe ich zwischen $5k-$10k pro Monat umgesetzt. Wenn du hier also erwartest, von einem Gründer eines Fortune-500-Unternehmens zu lernen, muss ich dich enttäuschen.Wenn du hingegen nach einem praktischen Leitfaden für die Gründung eines Lifestyle-SEO-Unternehmens suchst, der von jemandem stammt, der diesen Weg gegangen ist, dann ist dies der richtige Leitfaden für dich.Und so funktioniert es:Bringe dir SEO beiErstelle deine eigene WebsiteWerde zum T‑förmigen MarketerGewinne KundenBringe deine Logistik auf VordermannSkaliere dein Business1. Bringe dir SEO beiEs ist unglaublich, wie viele Leute versuchen, mit wenig bis gar keinem SEO-Wissen ein Unternehmen zu gründen. Tu das nicht. Du musst dich bemühen zu lernen, wie man SEO gut macht, bevor du deinen Kunden Dienstleistungen anbietest.Ich kann gar nicht genug betonen, wie wichtig das ist.Wenn du nicht weißt, was du tust, kannst du mehr Schaden als Nutzen anrichten. Ich bin mir sicher, dass du von den Horrorgeschichten gehört hast, in denen Websites nach einer Abstrafung auf der millionsten Seite von Google landen. Du willst nicht, dass das deinen Kunden passiert. Ihre Websites sind ihr Lebensunterhalt; du solltest diese Tatsache nicht auf die leichte Schulter nehmen.Nun da wir das aus dem Weg geräumt haben; wie lernt man eigentlich SEO?Beginnen wir mit dem naheliegendsten Anlaufpunkt: dem Ahrefs-Blog und YouTube-Kanal. Wir haben im Laufe der Jahre hunderte von SEO-Tutorials veröffentlicht, von denen viele perfekt für Anfänger geeignet sind. Ich bin eindeutig voreingenommen, aber ich glaube nicht, dass es heutzutage einen besseren Startpunkt gibt, um SEO zu lernen.Wenn du dir unsicher bist, wo du anfangen sollst, schau dir unseren Anfänger-Leitfaden für SEO oder unseren SEO-Videokurs für Anfänger an. https://www.youtube.com/watch?v=btwC4zmewss&list=PLvJ_dXFSpd2vk6rQ4Rta5MhDIRmakFbp6Wenn du lieber woanders anfangen möchtest, schau dir die Website von Aleyda Solis an: learningseo.io.2. Erstelle deine eigene WebsiteDu würdest schließlich ja auch keine Steuerkanzlei gründen, nachdem du ein paar Bücher über Steuern gelesen hast, also solltest du auch kein SEO-Unternehmen gründen, nachdem du ein paar SEO-Ratgeber gelesen hast. Die Theorie zu kennen reicht nicht aus; du brauchst praktische Erfahrung, bevor du anfängst, Dienstleistungen für Unternehmen anzubieten.Wie sammelst du Erfahrung? Erstelle deine eigene Website und nutze sie als Experimentierfeld für deine SEO-Fähigkeiten.Das ist es, was ich getan habe.Im Jahr 2012 habe ich einen Fitness-Blog gestartet. Er war nichts Besonderes, aber nach nur zehn Monaten hatte er über 50.000 organische Besucher pro Monat.Und was noch besser ist, er hat sogar ein paar nette Affiliate-Provisionen von Amazon erhalten.Ich sollte an dieser Stelle wohl auch erwähnen, dass eine eigene Website nicht der einzige Weg ist, um praktische Erfahrungen zu sammeln. Eine andere Möglichkeit ist, eine seriöse Agentur zu finden und dort zu lernen. Da du aber diesen Leitfaden liest, bist du wahrscheinlich eher unternehmerisch veranlagt und willst nicht für jemand anderen arbeiten. In diesem Fall ist die einzige Option, eine eigene Website zu erstellen.Wenn du dir nicht sicher bist, wo du anfangen sollst, lies unseren Leitfaden zur Keyword-Recherche oder schau dir dieses Video an:https://www.youtube.com/watch?v=OMJQPqG2Uas3. Werde zum T‑förmigen MarketerWährend du deine SEO-Fähigkeiten auf deiner eigenen Website übst und verfeinerst, wirst du eine Ahnung davon bekommen, was dir am meisten Spaß macht.Das ist bei jedem anders. Für mich war es Linkaufbau und Content-Erstellung. Ich habe festgestellt, dass ich die technischen Angelegenheiten nicht wirklich genossen habe und Aufgaben wie Keyword-Recherche und On-Page-SEO nur Dinge waren, die ich tun musste. Ich habe sie sicherlich nicht geliebt.Aber warum ist das wichtig für die Gründung eines SEO-Unternehmens?Ganz einfach. Weil es SEO-Agenturen, die “All-in-One”-SEO-Dienstleistungen für Unternehmen anbieten, wie Sand am Meer gibt. Ich möchte niemanden davon abhalten, ein solches Unternehmen zu gründen, aber ich hatte mehr Erfolg, als ich mich spezialisiert und Dienstleistungen in einem bestimmten Bereich angeboten habe.Sobald du also weißt, was dir Spaß macht, ist es an der Zeit, dein Wissen in diesem Bereich zu erweitern. Wenn du das tust, wirst du bald zu dem, was Rand Fishkin einen T‑förmigen Marketer nennt. Du kannst dann beginnen, eine Nische für deine Dienstleistungen zu finden.4. Gewinne KundenJetzt, wo du die Grundlagen gelernt und deine Fähigkeiten in einem Bereich verfeinert hast, solltest du bereit sein, deine Dienstleistungen Kunden anzubieten. Doch wie findest du diese Personen?Hier sind nur ein paar Ideen:Freelancing-WebsitesWebsites für Freiberufler haben einen schlechten Ruf, und es ist leicht zu erkennen, warum. Stöbere eine Minute auf UpWork und du wirst sehen, dass die meisten Leute ziemlich unrealistische Erwartungen haben.Das ist es, wovon ich spreche:Wenn du aber bereit bist, ein bisschen Zeit zu investieren, um die Spreu vom Weizen zu trennen, ist es möglich, einige großartige Kunden auf Freelancer-Seiten zu finden.Woher ich das weiß? Ich habe meinen allerersten SEO-Kunden auf People Per Hour gefunden.Das war auch kein einmaliger Job für 50€. Ich habe mit diesem Kunden ein paar Jahre lang zusammen gearbeitet. Und obwohl ich nie einen Vertrag mit ihm abgeschlossen habe (man haue mir auf die Finger), hat er mir Aufträge im Wert von etwa 25.000€ pro Jahr zukommen lassen.Kalte Anrufe oder E‑MailsIch konnte mich nie dazu durchringen, Kaltakquise zu betreiben. Ich habe das vor vielen Jahren gemacht, als ich versucht habe, ein nicht-SEO-bezogenes Unternehmen auf die Beine zu stellen und ich fand es nervtötend. Ich bin extrem introvertiert, also ist das so ziemlich mein schlimmster Albtraum.Trotzdem verdient die Kaltakquise eine Erwähnung, weil sie funktioniert.Woher ich das weiß? Weil es einfach ein Zahlenspiel ist.Stell dir das folgendermaßen vor:Du versendest 1.000 Kaltakquise-E-Mails.50 Empfänger stimmen einem Anruf zu5 Anrufe konvertierenWenn man bedenkt, dass die meisten SEO-Profis $500-$1.000 pro Monat verlangen, sind fünf Conversions zwischen $2.500-$5.000 pro Monat wert. Wenn wir davon ausgehen, dass die Kunden im Durchschnitt 6 Monate bei uns bleiben, sind diese fünf Conversions $15.000-$30.000 wert.Das hört sich wahrscheinlich nicht nach einem lebensverändernden Betrag an, aber auch hier gilt: Es ist ein Zahlenspiel. Wenn du weißt, dass alle 1.000 E‑Mails $15k-$30k an Einnahmen bringen, musst du nur noch skalieren:2.000 Emails = $30k-$60k5.000 Emails = $75k-$150k10.000 Emails = $150k-$300k… du verstehst die Idee dahinter.RANDNOTIZ Diese Zahlen sind alle hypothetisch. Viele Dinge beeinflussen die Conversion Rate, einschließlich der Qualität deiner anfänglichen Interessenten. Wenn du an diesem Ansatz interessiert bist, schau dir diesen Beitrag an, in dem Daryl Rosser Schritt für Schritt erklärt, wie man SEO-Dienstleistungen per E‑Mail verkauft.Inbound MarketingDa ich introvertiert bin, war Inbound Marketing die primäre Methode, mit der ich Kunden gewinnen wollte. Also startete ich 2016 eine Website namens The SEO Project, um mich damit vertraut zu machen.Trotz des veralteten Designs (ich habe sie mehr als 4 Jahre lang vernachlässigt), kannst du sehen, dass es nicht die typische Website für SEO-Dienstleistungen ist. In der Tat bietet sie überhaupt keine Dienstleistungen an. Das liegt daran, dass ich mich entschieden habe, einen anderen Ansatz zu wählen.Hier ist kurz zusammengefasst, was ich gemacht habe:Ich erstellte einen Content-Beitrag zum Thema Linkaufbau (die Dienstleistung, die ich anbieten wollte)Ich bot die komplette Liste als PDF an, um die E‑Mail-Adressen der Besucher zu erhaltenIch habe mittels Outreach-Methoden die Liste verbreitet, um meinen Content bekannt zu machen Ich habe geplant, meine Dienstleistungen über die E‑Mail-Liste zu “verkaufen”(Lustige Tatsache: Meine Outreach-Aktivitäten für diesen Artikel führten zu meiner ersten Interaktion mit dem CMO von Ahrefs, Tim Soulo, der mich fragte, ob ich Lust hätte, für den Ahrefs-Blog zu schreiben. Ich sagte ja, und der Rest ist Geschichte)Nun, den letzten Punkt habe ich nie umgesetzt (warum, erkläre ich später). Allerdings habe ich die ersten drei tatsächlich gemacht und es geschafft, in nur wenigen Tagen eine Liste mit über 1.000+ Abonnenten aufzubauen.Das ist aber nicht die einzige Möglichkeit, um mit Inbound Marketing Kunden zu gewinnen.Hier sind ein paar weitere Möglichkeiten:Optimiere deine Seite, um bei Google für lukrative Suchbegriffe hoch zu ranken (z.B. “seo berater london”)Ziehe potentielle Kunden durch einen YouTube-Kanal anSchalte PPC-Anzeigen bei GoogleSchreibe GastbeiträgeLass uns ein bisschen mehr über den letzten Punkt sprechen.Gastbeiträge schreibenDas Verfassen von Gastbeiträgen ist eine weitere Maßnahme, die ich erfolgreich eingesetzt habe, um Kunden zu gewinnen, wie du in dieser E‑Mail sehen kannst:In diesem Fall hat mich der Kunde aufgrund eines Gastbeitrags auf dem Ahrefs-Blog gefunden. Ich habe ein paar Monate mit ihm gearbeitet und dabei 5.375$ Umsatz gemacht.Wenn du vorhast, diese Methode auszuprobieren, rate ich dir, nur Gastbeiträge für Branchen-Websites zu schreiben, die Traffic generieren. Denke daran, dass wir Gastbeiträge nicht als Linkaufbau-Methode verwenden, sondern als Marketing-Maßnahme.Am einfachsten findest du solche Websites mit dem Content Explorer von Ahrefs, einer durchsuchbaren Datenbank mit Inhalten von über sieben Milliarden Websites.Hier erfährst du, wie du ihn nutzen kannst, um Möglichkeiten für Gastbeiträge zu finden:Öffne den Content ExplorerSuche nach etwas, das mit SEO zu tun hatWähle “im Titel” aus dem DropdownKlicke auf “suchen”Überprüfe den Reiter “Websites”Überprüfe jede der Seiten in den Ergebnissen und schaue, ob es Sinn machen würde, einen Gastbeitrag zu schreiben.Erhalte ReferenzenWenn du großartige Arbeit für die Kunden leistest, die du mit den oben genannten Methoden gewinnst, werden sie dich zweifellos weiter empfehlen. Das ist das ideale Szenario, weil es eine unendliche Wachstumsschleife schafft — solange du konstant gute Arbeit ablieferst und deine Kunden beeindruckst.5. Bringe deine Logistik auf VordermannFokus ist essentiell, wenn du ein SEO-Business aufbaust, daher ist es wichtig, unnötige Ablenkungen zu minimieren. Du willst soviel Zeit wie möglich damit verbringen, Kunden zu gewinnen und Dienstleistungen zu erbringen, denn das ist es, was den Umsatz ausmacht.Hier sind meine Empfehlungen, um das zu tun:Besorge dir einen SteuerberaterDieser Punkt mag offensichtlich erscheinen, und ich weiß, dass er nicht nur für SEO-Unternehmen gilt, aber ich würde dir dringend raten, dir frühzeitig einen Steuerberater zu suchen.Wenn du das nicht tust, wirst du jedes Jahr unzählige Stunden damit verbringen, deine Steuererklärung zu machen — zumindest, wenn du in Großbritannien/USA/Kanada lebst. Das ist aus zwei Gründen nicht gut:Es ist extrem stressig.Es kostet dich Zeit, die du für dein Geschäft nutzen könntest.Ich spreche hier aus Erfahrung. Ich habe viel zu lange auf einen Steuerberater verzichtet, nur um ein paar hundert Dollar im Jahr zu sparen.Glaube mir, wenn ich sage, dass es das nicht wert ist.Nutze eine RechnungssoftwareDie Rechnungsstellung und das Eintreiben von Zahlungen ist eine weitere Sache, mit der du keine Zeit vergeuden solltest. Es gibt viele Apps, die dir dabei helfen.Hier sind meine Empfehlungen basierend auf meiner persönlichen Erfahrung:Wenn du nach einer kostenlosen App suchst, probiere Invoice Ninja aus. Du kannst so viele Rechnungen verschicken wie du willst, wiederkehrende Rechnungen einstellen, um die Rechnungsstellung für SEO-Kunden mit Retainern zu automatisieren, und es lässt sich mit den meisten Zahlungsgateways integrieren. Ich habe es in den Anfangszeiten meines Unternehmens jahrelang genutzt.Wenn du eine kostenpflichtige App suchst, probiere Xero. Dies ist eine Buchhaltungs-App, die aber auch die Rechnungsstellung übernimmt. Sie lässt sich auch mit den meisten Geschäftskonten und Zahlungsgateways integrieren. Xero ist seit ein paar Jahren die App meiner Wahl.Besorge dir ein Konto mit verschiedenen WährungenEs gibt nichts Frustrierenderes, als einen Kunden zu haben, der bereit ist zu zahlen, aber keine einfache Möglichkeit hat, Geld in seiner Landeswährung zu erhalten. Das ist normalerweise kein Problem, wenn du lokale SEO betreibst und mit Kunden in einem Land arbeitest, aber es wird schnell zu einem Problem, wenn du international mit SEO-Kunden arbeitest.Es gibt zwei mögliche Lösungen für dieses Problem: Besorge dir ein Mehrwährungs-Konto bei deiner Bank.Nutze einen Service wie Wise (früher Transferwise)Wenn du es einfach haben willst, kann ich dir auf jeden Fall Wise empfehlen. Ich nutze diesen Service schon seit ein paar Jahren und die Gebühren sind im Vergleich zu den meisten Banken unglaublich günstig. Sie machen es dir auch leicht, Zahlungen in über 50 Währungen zu senden und zu empfangen.6. Skaliere dein BusinessDer Aufbau eines SEO-Unternehmens erfordert eine Menge Zeit und Mühe. In diesem Blogbeitrag klingt es einfach, aber es wird viele Unsicherheiten auf dem Weg geben. Es ist unwahrscheinlich, dass du über Nacht eine millionenschwere Agentur aufbaust.Aus diesem Grund rate ich dir, dich nicht mit “Skalierung” oder der Anstellung von Mitarbeitern zu beschäftigen, bis dein Umsatz im mittleren fünfstelligen Bereich pro Jahr liegt.Das soll nicht heißen, dass du in den ersten Tagen deines Unternehmens davor zurückschrecken solltest, Freelancer oder virtuelle Assistenten (VAs) einzustellen. Es ist klug, Aufgaben zu delegieren, wenn die Dinge an Fahrt gewinnen und du dich überwältigt fühlst. Meiner Meinung nach ist es jedoch nicht ratsam, Vollzeitmitarbeiter einzustellen, bis dein Cashflow stabil ist und du dir sicher bist, dass du sie auch bezahlen kannst.Wenn du noch nicht an diesem Punkt bist, bleib am Ball. Ich weiß aus Erfahrung, dass es wahrscheinlich nicht so schnell gehen wird, wie du es gerne hättest.Wenn du bereits an diesem Punkt bist, hast du zwei Möglichkeiten:Lass die Dinge so wie sie sindBeginne damit, Mitarbeiter einzustellen und skaliere dein GeschäftAngesichts der ständigen “Hustle”-Mentalität in der Branche ist es wichtig, sich daran zu erinnern, dass die erste Option tatsächlich existiert. Nicht jeder möchte sein Geschäft auf sechs- oder siebenstellige Umsätze pro Jahr ausbauen. Wenn du mit deinem Umsatz und deinem Arbeitspensum als SEO-Freelancer zufrieden bist, ist es keine Schande, es dabei zu belassen.Das ist genau der Grund, warum ich nie an die E‑Mail-Liste “verkauft” habe, die ich zuvor erwähnt habe. Es hat eine Weile gedauert, bis ich das realisiert habe, aber ich wollte nie wirklich eine SEO-Agentur gründen. Ich war ziemlich glücklich damit, für ein paar Kunden zu arbeiten und ein bequemes Leben zu haben.Aber sagen wir mal, dass du dein Geschäft skalieren willst; wie machst du das?In der Theorie ist es einfach:Produktiviere deine DienstleistungenStelle Mitarbeiter einDie Produktivierung deiner Dienstleistungen bedeutet, dass du dein Angebot standardisierst und einen wiederholbaren Schritt-für-Schritt-Prozess entwickelst, um diese deinen Kunden bereitzustellen. Das ist vorteilhaft, weil es dadurch einfacher wird, Dienstleistungen zu erbringen und Mitarbeiter einzustellen.Apropos Personal, das ist der zweite Teil der Rechnung.Es ist unmöglich, dein Geschäft zu skalieren, ohne andere Leute an Bord zu holen, weil du nur eine begrenzte Anzahl von Stunden am Tag hast.Empfohlene Lektüre: Wie man SEO auslagert (einfaches Konzept)FazitDie meisten der oben genannten Ratschläge basieren auf meiner Erfahrung. Es ist erwähnenswert, dass es viele Möglichkeiten gibt, ein erfolgreiches SEO-Business aufzubauen. Dies ist einfach nur die Art und Weise, wie ich es gemacht habe.Schreib mir auf Twitter, wenn du irgendwelche Fragen hast. Article PerformanceData from AhrefsVerlinkung von Websites 2 Sign up for AhrefsGet SEO metrics of any website or URL.The number of websites linking to this post.This post's estimated monthly organic search traffic.Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Joshua Hardwick Head of Content @ Ahrefs (oder, in einfachen Worten, ich bin der Typ, der dafür sorgt, dass jeder Blog-Post EPISCH wird).",
  "headers": [
    {
      "level": "H1",
      "text": "Wie du dein SEO-Business in 6 Schritten aufbaust"
    },
    {
      "level": "H2",
      "text": "1. Bringe dir SEO bei"
    },
    {
      "level": "H2",
      "text": "2. Erstelle deine eigene Website"
    },
    {
      "level": "H2",
      "text": "3. Werde zum T‑förmigen Marketer"
    },
    {
      "level": "H2",
      "text": "4. Gewinne Kunden"
    },
    {
      "level": "H3",
      "text": "Freelancing-Websites"
    },
    {
      "level": "H3",
      "text": "Kalte Anrufe oder E‑Mails"
    },
    {
      "level": "H3",
      "text": "Inbound Marketing"
    },
    {
      "level": "H3",
      "text": "Gastbeiträge schreiben"
    },
    {
      "level": "H3",
      "text": "Erhalte Referenzen"
    },
    {
      "level": "H2",
      "text": "5. Bringe deine Logistik auf Vordermann"
    },
    {
      "level": "H3",
      "text": "Besorge dir einen Steuerberater"
    },
    {
      "level": "H3",
      "text": "Nutze eine Rechnungssoftware"
    },
    {
      "level": "H3",
      "text": "Besorge dir ein Konto mit verschiedenen Währungen"
    },
    {
      "level": "H2",
      "text": "6. Skaliere dein Business"
    },
    {
      "level": "H2",
      "text": "Fazit"
    }
  ],
  "author": "Joshua Hardwick"
}