{
  "url": "https://ahrefs.com/blog/de/wie-man-seo-verbessert/",
  "slug": "wie-man-seo-verbessert",
  "title": "Wie du SEO verbesserst: 15 Taktiken zur Verbesserung deines Rankings (ohne neue Inhalte zu erstellen)",
  "description": "Diese erprobten Taktiken sind ideal, um dein SEO zu verbessern und dein Ranking zu steigern – ohne neue Inhalte zu erstellen.",
  "content": "Si Quan Ong Marketing @ Ahrefs. Ich lese, mache Breakdance und versuche zufäliige Lebensexperimente. Inhalt SEO ist eine langfristige Angelegenheit.Das heißt aber nicht, dass es keine leicht realisierbaren Möglichkeiten gibt, dein SEO zu verbessern. Die folgenden Taktiken werden nicht nur dein Ranking verbessern, sondern auch dafür sorgen, dass du keine neuen Inhalte erstellen musst.Gehen wir sie durch.Inhalt1. Erhalte mehr Klicks auf deine bestplatzierten SeitenDer Titel-Tag ist eines der ersten Dinge, die ein Suchender sieht:Ein attraktiver Titel kann ihn dazu verleiten, deine Seite den anderen in den SERPs vorzuziehen.Es hat jedoch keinen Sinn, die Titel-Tags von Seiten zu optimieren, die von den Suchenden nicht gesehen werden. Deshalb sollten wir uns auf Seiten konzentrieren, die bereits gut ranken, insbesondere auf den Positionen 2 bis 5.Hier erfährst du, wie du sie findest:Gehe zu Ahrefs Site ExplorerGib deine Domain einGehe zum Bericht der Top SeitenSetze den Ranking-Filter auf 2–5Dann können wir ChatGPT als Inspiration nutzen, um ansprechende Titel-Tags zu erstellen. Bitten wir das Programm zum Beispiel darum, 10 klickstarke Titel für diesen Blogbeitrag zu erstellen. Um die besten Ergebnisse zu erzielen, gebe ich ihm einen Arbeitstitel und bitte es, diese Titel auf maximal 60 Zeichen zu begrenzen (da Google die Titel-Tags bei mehr Zeichen abschneidet).Ziemlich passabel. Und wir können sie sogar noch besser machen, wenn wir die Strategien in den folgenden Artikeln anwenden.Weitere InformationenWie du den perfekten SEO-Titel-Tag erstellst (unser 4‑Schritte-Prozess)Wie du die Click-Through-Rate (CTR) verbesserst: 9 erprobte und getestete Tipps 2. Inhalte mit abnehmendem Traffic auffrischenBei Ahrefs führen wir jedes Quartal ein Inhalts-Audit durch. Bei einem dieser Audits stellte ich fest, dass der organische Traffic auf unseren Beitrag über kostenlose SEO-Tools zurückging. Also habe ich ihn aktualisiert. Und die Besucherzahlen stiegen.Der einfachste Weg, Inhalte zu finden, die es wert sind, aktualisiert zu werden, ist, unser kostenloses WordPress-SEO-Plugin zu installieren und einen Inhalts-Audit durchzuführen. So erfährst du, welche Beiträge du aktualisieren solltest.Befolge dann die Schritte in der Anleitung unten, um diese Beiträge zu aktualisieren.Weitere InformationenInhalte neu publizieren: Wie du alte Blogbeiträge für SEO aktualisierst3. Fülle Inhaltslücken in bestehenden InhaltenWenn die Seiten auf den vorderen Plätzen ähnliche Unterthemen abdecken, sind sie wahrscheinlich wichtig und das, was die Suchenden zu sehen erwarten.Wir können diese Unterthemen finden, indem wir uns die häufigen Suchbegriffe ansehen, für die die bestplatzierten Seiten ranken. Hier erfährst du, wie du diese „Inhaltslücken“ findest:Gib dein Ziel-Keyword in Ahrefs Keywords ExplorerScrolle zur SERP-ÜbersichtPrüfe bis zu fünf relevante KonkurrenzseitenKlicke auf Öffnen in und wähle Content-LückeDadurch öffnet sich der Bericht Content-Gap, in dem du die gemeinsamen Keyword-Rankings dieser Seiten siehst. Sieh dir die Ergebnisse an, um zu sehen, ob es Unterthemen gibt, die du abdecken kannst.Wenn wir zum Beispiel unseren Beitrag über verdiente Medien (engl. earned Media) aktualisieren wollen, könnten wir Unterthemen wie diese einbeziehen:Beispiele für Owned MedienBeispiele für bezahlte MedienBezahlte vs. verdiente Medien4. Wichtige Seiten mit internen Links stärkenInterne Links sind Links von einer Seite auf derselben Domain zu einer anderen. Interne Links unterstützen den PageRank-Fluss auf deiner Website (ein bestätigter Google-Rankingfaktor).Wenn sie richtig eingesetzt werden, können sie die Leistung deiner Seiten bei Google steigern.Hier erfährst du, wie du Seiten findest, denen du interne Links hinzufügen kannst:Melde dich für die kostenlosen Ahrefs Webmaster Tools (AWT) anFühre einen Crawl mit Ahrefs Site AuditWenn der Crawl abgeschlossen ist, rufe den Bericht Internal link opportunities (dt. Interne Linkmöglichkeiten) aufDieser Bericht zeigt dir relevante interne Linkmöglichkeiten auf deiner Website. Suche nach deinen „Geld“-Seiten, indem du den Filter auf „Zielseite“ setzt. Sieh dir die empfohlenen Vorschläge an. Füge bei Bedarf deine internen Links hinzu.Weitere InformationenInterne Links für SEO: Ein praktischer Leitfaden5. Repariere defekte Backlinks, die zu deiner Website führenKaputte Backlinks kommen natürlich vor, weil Websites oft Seiten entfernen oder umleiten. Wenn du aber kaputte Seiten hast, auf die viele Seiten verlinken, verlierst du potenziellen Besucherverkehr und „Link-Kapital“.So findest du diese Seiten:Gehe zu Ahrefs Site ExplorerGib deine Domain einGehe zum Bericht Beste nach LinksSetze den „HTTP-Code“””-Filter auf 404 nicht gefundenSortiere die Ergebnisse nach Verweisende DomainsFolge dann diesem Flussdiagramm, um zu entscheiden, wie du sie „reparieren“ kannst:Weitere InformationenWie du kaputte Links findest und reparierst (um wertvollen „Link Juice“ zurückzugewinnen) 6. Versuche Featured Snippet zu gewinnenGoogle zeigt oft eine vollständige oder teilweise Antwort auf eine Suchanfrage direkt in den SERPs an.Dies wird als „Featured Snippet“ bezeichnet, und du kannst oft allen anderen voraus sein, wenn du es dir schnappst. Aber wie gewinnst du das Snippet?Das Wichtigste zuerst: Unseres Wissens nach musst du bereits auf der ersten Seite ranken. Das heißt, um für Featured Snippets zu optimieren, musst du Keywords finden:die Featured Snippets zeigen.mit denen du in den Top 10 rankst.mit ordentlichem Traffic-Potenzial.So findest du sie:Gehe zu Ahrefs Site ExplorerGib deine Domain einGehe zum Bericht Organische KeywordsSetze den Ranking-Filter auf 2–10Verwende den SERP-Features-Filter, um Keywords zu finden, die Featured Snippets auslösen, „bei denen das Ziel nicht rankt“.Sieh die Liste durch, um zu sehen, ob es Gelegenheiten gibt, bei denen du das Snippet ergattern kannst.Zum Beispiel rangieren wir derzeit auf Platz 3 für „seo content strategy“:Es sieht so aus, als ob das Snippet eine Definition für „SEO-Strategie“ verlangt, die wir nicht auf unserer Seite haben. Wir könnten diese Definition einfügen und so hoffentlich das Snippet für uns gewinnen. Weitere InformationenGoogles Featured Snippets: Alles, was du wissen musst, um sie zu erhalten 7. Füge FAQ-Abschnitte einFAQ-Abschnitte (dt. Häufig gestellte Fragen) beantworten häufig gestellte Fragen zu einem Thema. Wenn du sie zu deiner Seite hinzufügst, kannst du für Long-Tail-Keywords besser ranken.Weil wir eine häufig gestellte Frage im Zusammenhang mit H1-Tags — die Länge — beantwortet haben, ranken wir jetzt bei Google, wenn Personen nach dieser Antwort suchen:Hier erfährst du, wie du häufig gestellte Fragen finden und beantworten kannst:Gehe zu Keywords ExplorerGib dein Thema einGehe zum Bericht Übereinstimmende TermeSchalten auf „Fragen“ um8. Fordere Unverlinkte Erwähnungen einUnverlinkte Erwähnungen sind Online-Erwähnungen deiner Marke oder deines Produkts, die nicht zu deiner Website zurückverlinkt sind. Zum Beispiel: Diese Seite erwähnt uns, verlinkt aber nicht zurück:So findest du nicht verlinkte Erwähnungen für deine Marke:Gehe zu Ahrefs Web ExplorerSuche mit diesen Parametern: [marke] -outlinkdomain:deinedomain.de -site:deinedomain.deIn diesem Beispiel gibt es Millionen von Seiten zu durchsuchen. Es lohnt sich also, den Bericht nach Domain Rating (DR) oder verweisenden Domains zu filtern, um „minderwertige“ Chancen auszuschließen. Hier ist ein Beispiel für eine nicht verlinkte Erwähnung, die wir für unsere Marke gefunden haben:Anstatt den Autor einfach zu bitten, einen Link hinzuzufügen oder den Link „klickbar“ zu machen, überlege dir, wie du den Inhalt verbessern und für den Autor nützlich machen kannst.Da es sich in unserem Beispiel um eine Produktrezension handelt und unsere kostenlosen SEO-Tools oder AWT nicht erwähnt wurden, konnten wir den Autor kontaktieren und ihm Bescheid geben.Weitere InformationenEine einfache Anleitung, um (unverlinkte) Markenerwähnungen in Links zu verwandeln9. Verbessere deine Core Web VitalsDie Core Web Vitals (CWV) sind Teil von Googles Nutzerfreundlichkeit von Seiten und bestehen aus folgenden Elementen:Largest Contentful Paint (LCP)Cumulative Layout Shift (CLS)First Input Delay (FID)Sie sind Google-Rankingfaktoren.Du kannst deine CWV-Daten mit PageSpeed Insights überprüfen, einem kostenlosen Tool von Google, das die Leistung einer Seite analysiert und Vorschläge zur Verbesserung der Geschwindigkeit und des Nutzererlebnisses liefert.You can also connect PageSpeed Insights’ API to Site Audit Du kannst auch die API von PageSpeed Insights mit Site Audit verbinden und deine Core Web Vitals zusammen mit anderen technischen SEO-Problemen sehen:Weitere InformationenEine Anleitung zu Core Web VitalsLargest Contentful Paint (LCP) – DefinedDefiniert, gemessen und wie man es verbessertCumulative Layout Shift (CLS) – Definiert, gemessen und wie man es verbessertFirst Input Delay (FID) – Definiert, gemessen und wie man es verbessert10. Optimiere deine BilderGoogle verwendet alternativen Text (alt text), um das Thema eines Bildes zu verstehen. Er kann auch dazu beitragen, dass deine Bilder in Googles Bildersuche besser platziert werden und mehr Traffic erhalten.Führe einen Crawl mit Site Audit (über Ahrefs Webmaster Tools) durch, um Bilder ohne Alt-Text auf deiner Website zu finden:Dann musst du sie nur noch durchgehen und den Alt-Text hinzufügen. Er sollte beschreibend und kurz sein, aber stopfe ihn nicht mit Keywords voll (z. B. „schwarzes Kätzchen“).Weitere InformationenBilder-SEO: 12 praktische Tipps (für mehr organischen Traffic) 11. Verwende bestehende Inhalte in mehrere FormateWenn du bereits einen Inhalt erstellt hast, könntest du noch einen draufsetzen, indem du ihn in verschiedenen Formaten wiederverwendest. Wir haben zum Beispiel unsere SEO-Checkliste in ein Video verwandelt:https://www.youtube.com/watch?v=taU9P98zfjkAußerdem habe ich meinen Beitrag über die Skyscraper-Technik in einen Twitter-Thread übertragen:Does the Skyscraper Technique still work?We asked our followers this question and received 1,242 votes. Here are the results: pic.twitter.com/l8qadplDAF— Si Quan Ong 王思权/思權 (@siquanong) March 6, 2023 Aber warum solltest du das tun, wenn dein Ziel ist, dein Google-Ranking zu verbessern? Nun, YouTube-Videos ranken auch in den Google-Suchergebnissen:Google hat 2023 zudem Perspectives eingeführt. Dabei handelt es sich um eine Registerkarte in den SERPs, mit der Nutzer Ergebnisse von TikTok, YouTube, Quora, Reddit, Tweets und mehr sehen können. Heads-up! Perspectives rolled out on 6/12 and officially last week, but now I’m seeing the sister SERP feature that Google said would show up in the 10 blue links. It’s also labeled “Perspectives”, provides cards for discussions, social, etc. & links to the Perspectives filter: pic.twitter.com/0NBEEPI31a— Glenn Gabe (@glenngabe) June 29, 2023 Im Grunde genommen wird Google künftig auch Ergebnisse aus anderen Kanälen anzeigen, nicht nur von Websites. Es könnte also sein, dass „SEO verbessern“ in Zukunft bedeutet, auch auf anderen Kanälen Inhalte zu erstellen.Weitere Informationen13 clevere Wege, um Inhalte wiederzuverwenden12. Schnappe dir SitelinksSitelinks sind Links zu anderen Seiten (oder Abschnitten einer Seite), die unter einigen Google-Suchergebnissen erscheinen. Sie geben dir mehr Sichtbarkeit in den SERPs.Sitelinks sind oft Sprunglinks auf der Seite:Eine gute Möglichkeit, sie zu beeinflussen, ist also, ein Inhaltsverzeichnis für deine Seiten zu erstellen. Das machen wir für jeden Blogbeitrag:Wenn du WordPress verwendest, kannst du das mit einem Plugin wie Easy Table of Contents machen.Weitere InformationenWas sind Sitelinks? Wie beeinflusst man sie?13. Fokussiere dich auf lokale SEOWenn du ein Unternehmen bist, das Kunden vor Ort bedient, möchtest du auch in den lokalen „Map Pack“-Suchergebnissen erscheinen.Der einfachste Weg, dein lokales Ranking zu verbessern, ist die Beanspruchung und Optimierung deines Google Unternehmensprofils (GBP).Sobald du dich angemeldet hast, können die Informationen, die du deinem Unternehmensprofil hinzufügst, in den Suchergebnissen von Google und in Google Maps angezeigt werden.Im folgenden Leitfaden erfährst du, wie du dein GBP optimieren kannst.Weitere InformationenSo optimierst du deinen Google My Business-Eintrag in 30 Minuten14. Repliziere die Verzeichnislinks deiner KonkurrentenLokale Citations sind Erwähnungen des Namens, der Adresse und der Telefonnummer (NAP) deines Unternehmens im Internet. Insgesamt halten 7 % der SEOs diese Erwähnungen für den wichtigsten Rankingfaktor.Der einfachste Weg, diese Zitate aufzubauen, sind Verzeichnisse. Hier erfährst du, wie du Branchen- und Ortsverzeichnisse findest:Gehe zu Ahrefs Site ExplorerGib deine Domain einGehe zum Bericht Link-ÜberschneidungenFüge deine Mitbewerber im oberen Bereich hinzuKlicke auf Zeige Verlinkungs-MöglichkeitenDas zeigt dir die Websites, die auf eine oder mehrere Homepages deiner Konkurrenten verlinken, aber nicht auf deine. Sieh dir die Liste an, um Websites zu finden, die Nischen- und lokale Verzeichnisse sind.Wenn du dir nicht sicher bist, ob eine Seite ein Verzeichnis ist, klicke auf das Caret in einer der Spalten der konkurrierenden Seiten, um die verweisende Seite, den Anker und den Backlink zu sehen. In der Regel ist das ziemlich offensichtlich:Weitere InformationenLokale Erwähnungen aufbauen (vollständige Anleitung)15. Stelle sicher, dass deine Seiten von Google indexiert werden könnenWenn Google deine Seiten nicht indizieren kann, wirst du in den Suchergebnissen nicht ranken können. Damit das nicht passiert, kannst du mit Site Audit über die Ahrefs Webmaster Tools einen Crawl durchführen.Wenn eine deiner Seiten ein noindex-Tag hat, das Google daran hindert, die Seite zu indizieren, wird dies als Problem angezeigt:Wenn diese nicht absichtlich eingefügt wurden, solltest du sie entfernen.Weitere Informationen10 Wege, wie du Google dazu bringst, deine Website zu indizieren (die auch wirklich funktionieren)Abschließende GedankenDiese Taktiken haben das Potenzial, deine Rankings in den Suchmaschinen zu verbessern. Aber erwarte nicht, dass deine Rankings über Nacht steigen.Unsere Untersuchungen haben ergeben, dass nur 5,7 % aller neu veröffentlichten Seiten innerhalb eines Jahres die erste Seite von Google erreichen. Das ist keine Überraschung. SEO ist ein langfristiges Spiel.Auch wenn es sinnvoll ist, diese „niedrig hängenden Früchte“” zu nutzen, sind sie kein Ersatz für eine langfristige SEO-Strategie.Hast du Fragen oder Kommentare? Lass es mich auf Twitter oder in Threads wissen. Article PerformanceData from AhrefsVerlinkung von Websites 2 Sign up for AhrefsGet SEO metrics of any website or URL.The number of websites linking to this post.This post's estimated monthly organic search traffic.Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Si Quan Ong Marketing @ Ahrefs. Ich lese, mache Breakdance und versuche zufäliige Lebensexperimente.",
  "headers": [
    {
      "level": "H1",
      "text": "Wie du SEO verbesserst: 15 Taktiken zur Verbesserung deines Rankings (ohne neue Inhalte zu erstellen)"
    },
    {
      "level": "H2",
      "text": "1. Erhalte mehr Klicks auf deine bestplatzierten Seiten"
    },
    {
      "level": "H2",
      "text": "2. Inhalte mit abnehmendem Traffic auffrischen"
    },
    {
      "level": "H2",
      "text": "3. Fülle Inhaltslücken in bestehenden Inhalten"
    },
    {
      "level": "H2",
      "text": "4. Wichtige Seiten mit internen Links stärken"
    },
    {
      "level": "H2",
      "text": "5. Repariere defekte Backlinks, die zu deiner Website führen"
    },
    {
      "level": "H2",
      "text": "6. Versuche Featured Snippet zu gewinnen"
    },
    {
      "level": "H2",
      "text": "7. Füge FAQ-Abschnitte ein"
    },
    {
      "level": "H2",
      "text": "8. Fordere Unverlinkte Erwähnungen ein"
    },
    {
      "level": "H2",
      "text": "9. Verbessere deine Core Web Vitals"
    },
    {
      "level": "H2",
      "text": "10. Optimiere deine Bilder"
    },
    {
      "level": "H2",
      "text": "11. Verwende bestehende Inhalte in mehrere Formate"
    },
    {
      "level": "H2",
      "text": "12. Schnappe dir Sitelinks"
    },
    {
      "level": "H2",
      "text": "13. Fokussiere dich auf lokale SEO"
    },
    {
      "level": "H2",
      "text": "14. Repliziere die Verzeichnislinks deiner Konkurrenten"
    },
    {
      "level": "H2",
      "text": "15. Stelle sicher, dass deine Seiten von Google indexiert werden können"
    },
    {
      "level": "H2",
      "text": "Abschließende Gedanken"
    }
  ],
  "author": "Si Quan Ong"
}