{
  "url": "https://ahrefs.com/blog/de/youtube-seo/",
  "slug": "youtube-seo",
  "title": "YouTube SEO: Wie deine Videos ranken - komplette Anleitung",
  "description": "Möchtest du mit deinen Videos in YouTube ranken? Erfahre wie wir unsere YouTube-Suchansichten um fast 400% gesteigert haben in nur 7,5 Monaten und wie dir das auch gelingen kann.",
  "content": "Sam Oh Director of Product Education und alles, was mit Video zu tun hat @ Ahrefs. Ich erstelle Systeme. Inhalt Möchtest du wissen, wie wir unsere YouTube-Suchansichten um fast 400% gesteigert haben?Innerhalb von 7,5 Monaten erreichten wir Killer-Rankings auf YouTube für einige der begehrtesten Keywords in unserer Branche.Während Rankings geografisch ausgerichtet und immer im Wandel sind, sind hier einige Beispiele aufgeführt:#1 für “local SEO”#1 für “SEO tips”#2 für “SEO”Wir sind zwar nicht viral gegangen, aber wir sind vom ersten Tag an stetig gewachsen, seit wir damit angefangen haben, auf Keyword-Ziele ausgerichtete Videos zu veröffentlichten.Ahrefs YouTube Search Traffic über die letzten 7 Monate.Tatsächlich hat unser Kanal in diesem Zeitraum von 7 Monaten (~6 Jahre Aufmerksamkeit) über 3 Millionen Minuten Sendezeit gesammelt.Unser Kanal ist nicht riesig, wir veröffentlichen ein Video pro Woche, und unsere Branche ist nicht gerade “spannend”. Und im Vergleich zu unseren Top-Konkurrenten ist unsere Teilnehmerzahl mikroskopisch klein.Aber das ist es, was ich an YouTube SEO liebe.Jeder und jede hat die Möglichkeit, zu unterhalten, mitzumachen und zu ranken.In diesem Beitrag lernst du, wie du deine YouTube-Videos ranken lassen kannst, von Anfang bis Ende.https://youtu.be/NY3y0V9UDwMWas ist YouTube SEO? YouTube SEO ist der Prozess der Optimierung deiner Videos, Wiedergabelisten und Kanäle, um in den organischen Suchergebnissen von YouTube für eine bestimmte Suchanfrage ein hohes Ranking zu erzielenAnstatt zu versuchen, in jede Traffic-Quelle in YouTube Analytics vorzustoßen, werde ich mich auf das Ranking von Videos in der YouTube-Suche konzentrieren und ein paar Tipps geben, um deine Video-Rankings in der Google-Suche besonders schmackhaft zu gestalten.Daher werde ich nichts über vorgeschlagene Videos, Suchfunktionen und andere Traffic-Quellen schreiben.Wie der Such-Algorithmus von YouTube funktioniertYouTube beschreibt ihren Discovery und Search Ranking Algorithmus in zwei Sätzen.Videos werden anhand einer Vielzahl von Faktoren bewertet, darunter die Übereinstimmung von Titel, Beschreibung und Videoinhalten mit der Suchanfrage des Betrachters. Darüber hinaus untersuchen wir, welche Videos das meiste Engagement für eine Abfrage getrieben haben, und stellen sicher, dass es für die Zuschauer einfach ist, diese zu finden.Also ja, Keywords sind sowohl aus der On-Page- als auch aus der “In-Video”-Perspektive wichtig. Das Treffen der Suchabsicht ist entscheidend.Aber der wichtigste Bestandteil für effektives Video-SEO ist ein hohes Engagement.Sie wollen, dass du die Zuschauer so lange wie möglich auf ihrer Plattform hältst (auch wenn es nicht auf deinen eigenen Videos ist).Das liegt daran, dass mehr Videoaufrufe = mehr Anzeigen gezeigt werden = mehr Geld auf dem Konto von Alphabet Inc.Am wichtigsten ist, dass sie möchten, dass du das Engagement für deine Videos förderst und sie werden dich mit Sichtbarkeit belohnen.Die meisten Engagement-Metriken können in YouTube Analytics gemessen werden, wie z.B. likes/dislikes, Kommentare, CTR, Publikumsbindung, durchschnittliche Betrachtungsdauer, Klicks auf den Endscreen, Card-klicks und die Liste geht noch weiter.Fazit?Wenn du dein Publikum nicht zu Reaktionen bewegen kannst, sind deine Chancen, deine YouTube-Videos für ein relevantes Keyword zu ranken, gering bis gar nicht vorhanden.Genug geplaudert.Kommen wir zum 7‑stufigen Prozess um deine Keywords besser bei YouTube ranken zu lassen.Schritt #1: YouTube Keyword ResearchWenn du nicht auf Keywords mit Suchvolumen abzielst, dann wirst du keinen Traffic bekommen.Wir hatten im März — Juni einige Erfahrungen dazu aus erster Hand damit gemacht. Für unsere Reihe Marketing with Ahrefs haben wir eine Reihe von produktbezogenen Videos lanciert, die dazu dienen, unsere Nutzer aufzuklären und nicht den Traffic zu steigern.Lifetime Search Traffic für unser “keyword ideas” video.RANDNOTIZ. Wir schlagen nicht vor nur, Keyword-Videos zu erstellen. Es gibt verschiedene Möglichkeiten, Trendthemen aufzugreifen, vorgeschlagene Ansichten zu nutzen und Inhalte für bestehende Kunden zu erstellen.Aber im Gegensatz zur traditionellen Suchmaschinenoptimierung für Google verfügt YouTube nicht über ein offizielles Keyword-Recherchetool. Und viele Tools von Drittanbietern zapfen einfach nur beliebige Zahlen aus dem Google Keyword Planner ab.Glücklicherweise gibt es Tools und Hacks, mit denen du Suchvolumen für Keywords auf YouTube identifizieren kannst.YouTube Vorschläge gepaart mit Google TrendsYouTube Suggest ist ähnlich wie Google Suggest. Gib einfach ein Seed-Keyword in die Suchleiste ein, und du siehst eine Liste der relevanten Abfragen, die deine Keywords enthalten.Man kann auch ein Sternchen vor oder nach dem Ziel-Keyword verwenden, das als “Wildcard” dient.Da wir kein offizielles Tool zum Anzeigen von Suchvolumen haben, können wir einige der Vorschläge von YouTube in Google Trends eintragen.Aber Google Trends verwendet “relative Popularität”, um Keywords zu vergleichen. Nimm also diese Schätzungen nicht zu genau.Benutze den Ahrefs’ Keywords ExplorerVor kurzem haben wir unsere neueste Version des Keywords Explorer veröffentlicht, die Suchvolumen und Metriken für Suchmaschinen wie Google, YouTube, Bing, Amazon, Baidu und mehr enthält.Hier erhalten wir unsere Daten für unseren Top YouTube Suchbegriff Post her.Gib einfach ein Keyword oder eine Liste von Keywords ein und du siehst länderspezifische Suchvolumen, Klickdaten, globale Suchvolumen und kannst auf fünf Keyword-Ideenberichte zugreifen.Übersichtsreport für “SEO” in Ahrefs’ YouTube Keyword ToolEmpfehlung In voller Transparenz habe ich dieses Tool den größten Teil des Jahres 2018 nicht genutzt, aber ich habe es Anfang 2019 zur Optimierung unserer aktuellen Videos und natürlich für unsere neuen Videos eingesetzt.Bulk Keyword AnalyseKeywords Explorer ist sehr nützlich, wenn du nach einer große Liste von Keyword-Ideen suchst. Du kannst entweder vidIQ’ oder TubeBuddy’s Chrome-Erweiterung verwenden.Suche in YouTube nach einer Suchanfrage und schaue in die rechte Seitenleiste, wo du die Abschnitte “Related Queries” von VidIQ oder “Most Used Tags” von TubeBuddy siehst.TubeBuddy’s meistbenutzte TagsMarkiere alle relevanten Keywords > Copy > Paste in Keywords Explorer (unterstützt bis zu 10k Keywords). Wir zeigen dir dann alle Keywords mit YouTube-Suchvolumen gemäß unserer Datenbank an.Suchvolumen sind toll und alles, aber die Stärke von Keywords Explorer liegt in der Generierung neuer Keywordideen.Generiere neue KeywordideenNehmen wir an, du erstellst einen Kanal, in dem du technische Produkte unboxed und bewerten kannst. Beginnen wir also mit “unboxing” als unserem seed keyword.Dann gehe zum Phrase Match Report, der alle Keywords in unserer Datenbank auflistet, die deine Seed-Keywords enthalten.Also, was willst du unboxen? Vielleicht Handys, Spielekonsolen oder Kameraausrüstung?Die Sache ist die, dass niemand nach “unbox Handy” suchen wird. Bei der Suche nach Unboxingwird nach bestimmten Suchbegriffen gesucht (z.B. “iPhone X unboxing”).Schränken wir also unsere Ergebnisse ein, indem wir den Filter “Include” verwenden. Füge einfach einige Markenhersteller hinzu, wähle “any word” und schon geht es los.Boom. Über 672 relevante Themen, die du durchsuchen kannst.Höre hier nicht auf. Wenn du diese Produkte unboxen möchtest, kannst du genauso gut mehr Inhalte um sie herum erstellen.Vertausche einfach das Seed-Keyword und du findest einige zusätzliche Themen, zu denen du Videos erstellen kannst.Fazit: Es mangelt nicht an großartigen Keyword-Ideen.Wenn du nicht weiter kommst, dann schau dir unser Video über YouTube Keyword-Recherche an, das detaillierter auf diesen Prozess eingeht.https://youtu.be/kAuM2nQb_P8Der mehrfache Blick in die Suchergebnisse von GoogleDu hast es schon oft gehört.YouTube ist die zweitgrößte Suchmaschine. Blah, blah, blah.Aber warum nicht die weltweit größte Suchmaschine — Google — nutzen?Im Jahr 2017 verzeichnete GetSTAT einen Anstieg der Video-SERP-Features um 75,75%.Und 2019 ist es schwierig, mehr als 10 Minuten lang auf Google zu suchen, ohne ein Videoergebnis zu sehen.Es gibt ein paar Möglichkeiten, um zu sehen, wie viel organischen Search-Traffic die Videos erhalten.1. Suche in Google nach dem Ziel-KeywordGib eine Suchanfrage in Google aus deiner Liste der Keywords ein und hoffe, dass du ein Video Carousel oder ein spezifisches Video-SERP-Featuresiehst.Es scheint offensichtlich zu sein, aber ich kann wetten, dass die meisten Entwickler dies nicht tun, bevor sie ein Video erstellen. Achte auf die Länge und Titel der Videos, um eine Vorstellung davon zu bekommen, was Google zeigen will.2. Benutze den Content Explorer um Videos nach Themen zu suchenContent Explorer durchsucht eine Datenbank mit über einer Milliarde Webseiten nach denen, die ein bestimmtes Wort oder einen bestimmten Satz erwähnen. Jedes Ergebnis wird komplett mit SEO und sozialen Kennzahlen geliefert.Meine Lieblingsfunktion in diesem Tool ist, dass du Suchoperatoren verwenden kannst, um die Ergebnismenge einzugrenzen.Wenn du Videos finden möchtest, die auch in Google ranken, suche nach:site:youtube.com inurl:watch title:topicDann sortiere das Ergebnis nach Search-Traffic und du solltest eine schöne Liste von neuen Themen haben, um die herum du Inhalte erstellen kannst.PROFI TIPVideo-SERPs können sehr volatil sein. Es lohnt sich also, sich den organischen Traffic des Videos im Laufe der Zeit anzusehen.Klicke auf die Schaltfläche “Details” zu einem beliebigen Ergebnis, um den organischen Traffictrend zu analysieren.3. Benutze Site Explorer und Batch Analyse um hohe Traffic-Chancen zu aufzudeckenSuche nach eurem Ziel-Keyword in YouTube und kopier alle URLs der Top-Ranking-Videos.Du kannst die Scraper Chrome extension nutzen, um alle URLs aus den Suchergebnissen zu kopieren.Klicke rechts auf eine beliebige Stelle auf der Seite und klicke dann auf “scrape similar.”Dann nimm diesen Code als deinen “Selector.”//div/div/div/div/h3/aDann füge den XPath Code unter “columns” hinzu.concat ('https://www.youtube.com', @href)Klicke auf scrape und du solltest eine Liste haben, die wie diese aussieht:Jetzt füge alle Video-URls in das Batch Analysis tool > stelle mode auf URL > starte die Suche.Sortiere die Ergebnisse nach “Traffic” und du solltest einige großartige Möglichkeiten entdecken, die zusätzlichen Traffic aus Google Search zu dir bringen.Du kannst in die genauen organischen Keywords eintauchen, für die jedes Video ein Ranking hat, indem du den Bericht über organische Keywords aufrufst.Eine letzte Maßnahme, die ich empfehle, ist, sich die Traffic-Grafik “Overview Page” anzusehen, um zu sehen, ob das Video kontinuierlich Traffic von Google erhält oder ob die Keywords, für die es rankt, sehr volatil sind.Schritt #2: Identifiziere die SuchabsichtSearch Intent (oder Keyword Intent) bezieht sich auf den Grund, warum ein Benutzer nach einer Suchanfrage in einer Suchmaschine sucht.In den meisten Fällen sind Suchmaschinen gut darin, das für dich zu bestimmen.Suche einfach nach dem Keyword, für das du in YouTube ranken willst, und analysierst, worüber die besten 3–5 Ergebnisse sprechen (Inhalt und Betrachtung).Anstatt das Rad neu zu erfinden, folge dem Beispiel.PROFI TIPPEs ist am besten, dies inkognito zu tun und idealerweise ein VPN mit dem Standort, in dem du ranken möchtest, zu verwenden (z.B. bin ich in Kanada, also verwende ich eine US-IP).Zum Beispiel, wenn du den Leuten beibringen willst, wie man eine Website erstellt, dann würdest du ihnen wahrscheinlich eine Schritt-für-Schritt-Anleitung geben.YouTube stimmt zu.Aber was ist, wenn du für “Nintendo Switch-Spiele” ranken willst? YouTube wird dir sagen, dass die Leute ein “listenartiges” Video sehen wollen.Scheint offensichtlich zu sein, oder?Nehmen wir an, du bist Florist und willst für “viola” ranken. Schlechte Idee.Alle Ergebnisse zeigen, dass jemand, der nach diesem Begriff sucht, etwas über das Instrument wissen will — nicht über die Pflanze oder die Schauspielerin (Viola Davis).Erstellt ein Tabellenblatt und fügt eine Spalte mit dem Namen “Such-Intent” hinzu. Oder du kannst meines benutzen.Schritt #3: Erfülle Such-Intents mit einem hochauflösenden VideoAuf YouTube kannst du “Zufriedenheit” ableiten, indem du dir die Bindung des Publikums ansiehst. Und das Nebenprodukt einer hohen Retention sind oft Likes, Shares, Kommentare und höhere Rankings.Die Ziele von YouTube sind:“Hilf den Zuschauern, die Videos zu finden, die sie sich ansehen wollen.”” Maximiere die langfristige Bindung und Zufriedenheit der Zuschauer.”Es ist also deine Aufgabe, ein Video zu erstellen, das die Aufmerksamkeit des Publikums besser erregt und erhält.Hier ist, was wir bei Ahrefs tun, um die Aufbewahrungsfristen zu erreichen, auf die wir stolz sind.Durchschnittliche Sehzeit von einem unserer YouTube-Videos.a) Plane deine Videos bevor du sie erstellstIch bin der Erste, der es mit erhobenen Händen zugibt.Alle unsere wöchentlichen Tutorials sind geskriptet.Als introvertierter Mensch war ich nicht gesegnet mit den natürlichen Sprechfähigkeiten von Menschen wie Seth Godin, Gary Vaynerchuk und Tony Robbins.Aber keine Ausreden. Es hindert mich nicht daran, Videos zu erstellen, und es sollte dich auch nicht aufhalten.Wenn du Anleitungsvideos erstellst, ist das Letzte, was du tun willst, über deine Worte zu stolpern, über etwas anderes zu reden und die Leute zu bitten, 3 Minuten zu warten, weil du auf den falschen Link in deinem Screencast geklickt hast.Dies ermöglicht es dir nicht nur, deine Ideen prägnant zu halten, sondern bietet dir auch den Vorteil, dass du absichtlich Keywords in dein Video einbindest, auf die ich in Kürze näher eingehen werde.Aber was ist mit Vloggern?Wie Casey Neistat es ausdrückt:Die Geschichte ist König. Alles dient dem König.… Man muss etwas finden, woran ein Publikum interessiert ist, und es dann mit ihm auf eine Weise teilen, die auch für ihn von Interesse ist. Der einzige Weg, diese Dinge zu lernen und besser zu werden, ist, es immer und immer wieder zu tun.https://youtu.be/nLSUrTxquyEErkenne, was du erschaffst, für wen du es erschaffst, und dann lieferst du es.b) Beginne mit einem PaukenschlagDie ersten 10–15 Sekunden sind entscheidend für den Erfolg des Videos. Wenn du deine Leser fesselst, erhältst du Diagramme zur Publikumsbindung, die so aussehen.Vergisst du das verlierst du die Mehrheit deiner Zuschauer, bevor du die Chance hast, Mehrwert zu schaffen.Jede Nische ist anders und leider gibt es nicht eine Formel, die für jeden funktioniert.Zum Beispiel, Mama Natural holt ihr Publikum von Müttern sofort innerhalb von 2 Sekunden ab.https://youtu.be/mLAWLGkYPBgZum Glück werde ich weder eine Plazenta für unseren YouTube-Kanal essen, noch denke ich, dass SEOs und Vermarkter das gerne sehen würden.Da ich im Bereich How-to/Information für ein B2B-Publikum tätig bin, musste ich unzählige Tests durchführen, um zu sehen, was für uns funktioniert.Ich habe es auf 3 Schlüsselkomponenten heruntergebrochen, die ich die RIP-Formel nenne. Schau dir die ersten 30 Sekunden dieses Videos an und lass es mich für dich aufschlüsseln.https://youtu.be/oRGUdHlOqI01. Sei empathischJeder will verstanden werden. Gibt es also einen besseren Weg, die Aufmerksamkeit von jemandem zu erregen, als ihm zu zeigen, dass er nicht allein ist?Unser YouTube-Publikum besteht in erster Linie aus Marketingspezialisten, insbesondere mit einem Schwerpunkt auf SEO.Und in diesem Bereich haben wir alle mit unseren eigenen Fragen und Problemen zu kämpfen.Hier sind ein paar Dinge, die ich ausprobiert habe, die gut funktioniert haben:beginne mit einer rhetorischen Frage, die sich die Zuschauer vielleicht selbst gestellt haben. Während ich nicht sehen kann, wer sich hinter dem Bildschirm befindet, ist mein Ziel, ein physisches Nicken der Zustimmung zu erhalten.beginne mit einer Statistik, bei der sie zur negativen Mehrheit gehören.Unterhalte mit realen Szenarien und führe sie auf das Thema des Videos zurückIm obigen Beispiel habe ich einige Statistiken angegeben, um ihnen zu zeigen, dass 91% der Inhalte keinen Traffic von Google erhalten. Das ist die Mehrheit. Also, wenn du dabei bist.… fühl dich nicht schlecht.Egal, ob du ein B2B- oder B2C-Publikum anstrebst, eine wichtige Sache sich vor Augen zu halten ist, dass die Person auf der anderen Seite des Bildschirms ein Mensch ist.2. Identifiziere das ProblemLasst mich noch einmal auf die Suchabsicht eingehen. Wenn jemand nach deinem Keyword sucht, was will er dann lernen? Deine Antwort auf diese Frage wird oft ihr Problem sein.Für unser Video “SEO mistakes” würde ich vermuten, dass die Leute wissen wollen, was diese sogenannten “mistakes” sind und sie sehen wollen, ob sie ihren Website-Traffic beeinflussen.Aber jeder könnte durch das Video skimmen und diese “Fehler” in nur 20 Sekunden finden, was unserem Casemit hochauflösenden Videos nicht gerade zuträglich ist.Daher sage ich ausdrücklich:95% der Seiten kämpfen darum, relevanten Search-Traffic zu erhalten, der sich wirklich auf ihr Geschäft auswirken kann.Übersetzung: kein Traffic = kein Geschäft.3. PlaneLast but certainly not least, willst du ihnen einen Grund geben, da zu bleiben. In dieser expliziten Einleitung sagte ich:Was kann man also tun, um mehr organischen Traffic zu erhalten und unter den Top 5% aller Seiten im gesamten Internet zu sein? Das wirst du in diesem Video herausfinden.Übersetzung: schau dir dieses Video an, wenn du Traffic bekommen willst. Wer würde nicht gerne Traffic bekommen?Auf diese Weise wissen die Zuschauer, dass sie hier richtig sind bei einer Quelle, die ein Problem lösen könnte welches sie haben. Vielleicht war es etwas dick aufgetragen, “unter den ersten 5% des gesamten Internets zu sein”, aber es ist wahr (nach unseren Daten). Und es hat funktioniert.Aus Sicht der Aufmerksamkeit waren die Ergebnisse recht gut. Innerhalb von zwei Wochen hatten wir allein aus diesem Video über 100.000 Zuschauerminuten, 28.700 Ansichten und über 1.400 Abonnenten.Folgt der RIP-Formel, und haltet eure Videos am Leben.c) Frage deine Zuschauer nach Kommentaren, Likes und Abonnent zu werdenWie bekommt man mehr Abonnenten, Likes und Kommentare? Neben der Erstellung von Inhalten, die beim Publikum ankommen.….Du fragst.All dies dient dazu, das Engagement für dein Video zu steigern. Im Allgemeinen bitte ich am Ende darum, weil ich zuerst einen Mehrwert schaffen will. Und wenn jemand so lange dageblieben ist, wird er wahrscheinlich mehr von dem wollen, was er gesehen hat.Aber die Mehrheit der Zuschauer wird nicht das ganze Video sehen. Also kannst du vorher nach Reaktionenbitten, ohne bedürftig zu klingen.So werden beispielsweise einige unserer Videos über überschneidende Themen (z.B. Affiliate Marketing) berichten. Also sage ich so etwas wie: “Ich werde nicht weiter auf Affiliate-Marketing eingehen, aber hinterlasse einen Kommentar, wenn du mehr zu diesem Thema in einem zukünftigen Video sehen möchtest.”Fragen wie diese können dir nicht nur mehr Einblick in das Publikum geben, mit dem du sprichst, sondern sie sollten auch dazu beitragen, die Engagement Metriken zu verbessern.…Wenn du deinen Abonnenten stets einen hohen Mehrwert lieferst, werden sie Kommentare wie diesen hinterlassen:d) Editiere deine Videos strategischWenn du eines unserer Videos gesehen hast, kannst du denken, dass genauso viel Inhalt in einem einfachen Screencast geliefert werden könnte.Aber das ist weit davon entfernt, was wir praktizieren.Warum also nicht über einen Screencast sprechen? Oder warum nicht leidenschaftlich unter Verwendung expliziter Sprache über SEO sprechen, um meinen Standpunkt zu unterstreichen?Die Menschen haben eine kurze Aufmerksamkeitsspanne. Screencasts allein sind langweilig. Ich gehe so weit zu sagen, dass Gesichter auch langweilig sein können, es sei denn, man ist ein super engagierter Sprecher.Das bin ich nicht.Also kommt eine Menge darauf an die YouTube-Videos richtig zu bearbeiten. So sieht unser finales Projekt für eines unserer Videos aus:Hier einige Tipps, damit dein Video flüssig bleibt.Nebenbei bemerkt.Ich spreche nur aus der Perspektive von “How-to”-Tutorials, aber ich kann mir vorstellen, dass Vlogger auch von diesen profitieren können.1. Sprungschnitte hinzufügenEin Sprungschnitt ist ein Übergang zwischen zwei Aufnahmen aus der gleichen Position. Es erzeugt den Effekt, dass die Szene “springt””, daher der Name “Sprungschnitt”.Diese verleihen einem Video Dynamik und helfen, Fehler wie poliert aussehen zu lassen.2. Achte auf die Lücken in deinen HauptszenenWir haben zwei Hauptszenen in unseren Videos. Der Sprecher, der hellgrün beschriftet ist, und der Screencast in orange.Die rosa Schmierereien sind die Lücken. Die Identifizierung dieser Lücken kann dir helfen, Stellen zu finden, an denen etwas fehlt.Um unser Publikum besser an uns zu binden, halten wir unsere Lücken relativ klein, indem wir sie mit Texteinbelendungen, benutzerdefinierten Animationen und B‑Rolls ausfüllen.Aber eine wichtige Sache, die man bei diesen Lücken beachten sollte, ist, sie zu nutzen, wenn es Sinn macht. Die Benutzererfahrung sollte an erster Stelle stehen, und wenn es am sinnvollsten ist, länger auf einem Bildschirm zu bleiben, dann tu es.Da wir einen fantastischen hauseigenen Video-Editor haben, können wir einige tolle Experimente durchführen.3. Ziehe die Aufmerksamkeit deiner Zuschauer auf das, was sie sehen sollenIn allen unseren Screencasts fügen wir visuelle Effekte hinzu, um deine Aufmerksamkeit zu den Bereichen zu führen, von denen wir sprechen.Wenn ich zum Beispiel sagte: “Schau dir die Ampel an”, dann machen wir so etwas wie das hier.Erfahrene Ahrefs-Anwender wissen vielleicht, wo sie ohne den Effekt suchen müssen. Aber jemand, der unsere Tools noch nie ausprobiert hat, wird wahrscheinlich aufhören zuzuschauen, weil er keine Ahnung hat, wovon ich rede.Manchmal werden wir Formen, Objekte oder benutzerdefinierte Animationen verwenden, um unseren Standpunkt besser zu veranschaulichen.Auch das Hinzufügen von Soundeffekten, die das Motiv begleiten, kann helfen, die Aufmerksamkeit des Betrachters auf sich zu ziehen.4. Unterhalte mit Geschichten oder ErzählungenYouTube ist eine Unterhaltungsplattform. Aber Unterhaltung ist nicht immer einfach. Zum Beispiel, wenn ich in meinem Konfirmationsanzug herauskommen würde und über Link Building sprechen würde, würdest du weiter zusehen?Ich hoffe nicht.Während unser primärer Fokus also darauf liegt, SEO und Marketing zu lehren, tun wir unser Bestes, um es etwas unterhaltsamer zu gestalten, ohne es zu sehr zu übertreiben.In diesem Beispiel erstellen wir das Video über ein hypothetisches Unternehmen namens “Sam PhOHtography”.https://youtu.be/DvwS7cV9GmQUnd in diesem Video über Broken Link Building spreche ich davon, natürliche Sprache zu verwenden, anstatt roboterhafte E‑Mails zu versenden.https://youtu.be/IOSrx95e4loUnabhängig davon, in welcher Branche du tätig bist, bin ich zuversichtlich, dass es Möglichkeiten gibt, deine Videos unterhaltsamer zu gestalten, als du vielleicht denkst.Das Hinzufügen dieser kleinen, auf Engagement ausgerichteten Segmente hat uns geholfen, mit unserem Publikum auf individueller Ebene in Kontakt zu treten.https://youtu.be/j5EOWffq-gke) Erstelle brutalst ehrliche FeedbackschleifenEhrliche Kommunikation innerhalb eines Teams ist entscheidend. Und das ist meiner Meinung nach einer der Hauptgründe, warum das Marketing-Team von Ahrefs in der Lage ist, kontinuierlich großartige Inhalte für unseren Blog und YouTube-Kanal bereitzustellen.So sehen unsere Feedbackschleifen für Videos aus.1. Feedback zum SkriptNachdem ich einen Entwurf geschrieben habe, werden 3 unserer Teammitglieder, Josh, Nick und Tim, Feedback hinterlassen. Das Feedback kann in Form von starker Zustimmung, Ablehnung oder zusätzlichen Ideen erfolgen, von denen sie denken, dass sie die Qualität des Videos erhöhen werden.Wir werden jedes Wort und jeden Absatz, der geschrieben wird, respektvoll hinterfragen und der Ersteller wird die finale Entscheidung treffen.Nachdem ich das Video aufgenommen, die grundlegenden Bearbeitungen abgeschlossen und Produktionsnotizen hinzugefügt habe, wird unser Videoeditor meine Ideen zum Leben erwecken.2. Feedback zu den Video-EditsIch werde das Video überprüfen und wenn sich etwas nicht richtig anfühlt, dann werden Sergey (unser Videoeditor) und ich einen ähnlichen Feedbackprozess durchlaufen, der sich mehr auf die visuellen und Engagement-Aspekte konzentriert.Das entscheidende ist, dass der erste Entwurf niemals der letzte sein sollte.Finde eine Person oder Leute, auf die du dich verlassen kannst, für ehrliches Feedback. Kein Grund beleidigt zu sein. Wenn überhaupt, wird es das Team näher zusammen bringen (es sei denn, es ist dein Ehepartner).Schritt #4: On-Page Video OptimierungOn-page Optimierung für YouTube Videos konzentriert sich auf 4 Punkte:TitelBeschreibungTagsThumbnailJede dieser Funktionen bietet einen Kontext und beeinflusst die für das Video wichtigen Click-Through-Raten (CTR).Schließlich heißt es keine Klicks = keine Views.Erstelle den perfekten Titel- und Thumbnail-KombinationIm März 2018 startete YouTube Beta Studio, ihre neue Analyseplattform. Eine der neuen Kennzahlen, die hinzugefügt wurde, ist die “impressions click-through rate”.Um die Bedeutung von CTR zu unterstreichen, will YouTube die Ersteller, die CTR in ihrem Videoanalysetrichter zu erhöhen (für jedes Video).Du kannst die Chance erhöhen, dass YouTube deine Inhalte vorschlägt, indem du deine Klickrate und die Zeit angesehener Videos erhöhst.Zusätzlich zu den weiteren Ansichten können also die zusätzlichen Vorteile von YouTube genutzt werden, indem du deinen Zuschauern deine Videos außerhalb der organischen Suche vorschlägst (vorgeschlagene und durchsuchbare Funktionen).Hier sind einige bewährte Verfahren zur Erstellung von durchsuchbaren und anklickbaren Videos laut YouTube.1. Benutze dein Keyword im TitelWenn es um Keywords geht, empfiehlt YouTube, die relevantesten Suchbegriffe in deinen Titeln und Beschreibungen zu verwenden — vorausgesetzt, sie sind korrekt und nicht übertrieben.Die Studie von Briggsby bestätigt den Vorteil, dass das Ziel-Keyword in dem Titel enthalten ist. Sie fanden heraus, dass mehr als 90% der Top-Ranking-Videos mindestens einen Teil eines Ziel-Keywords in ihrem Titel enthalten.Es scheint zwar wichtig zu sein, zumindest teilweise Übereinstimmungen deinesZiel-Keywords in den Titel aufzunehmen, jedoch möchtest du nicht die “Klick-Würdigkeit” des Titels opfern.2. Dein Titel sollte unter 60 Zeichen bleibenYouTube empfiehlt, die Titel mit den wichtigsten Informationen zu Beginn übersichtlich halten.Aus Sicht der Suche bedeutet das oft, dass du dein Ziel-Keyword nahe dem Anfang deines Titels verwendest. Hier ist ein Beispiel:SEO Fehler: Warum 91% der Inhalte keinen organischen Traffic haben”.Wenn du deine Titel kurz hältst, wird verhindert, dass Klicks bei Such‑, Vorschlags- und Suchfunktionen durch Abschneiden verloren gehen.Nicht alle unsere Videos haben unter 60 Zeichen, aber ich plane, diese im Laufe der Zeit anzupassen.3. Verfasse einprägsame Titel, die Neugierde wecken oder einen Nutzen hervorhebenWenn du ein Tutorial über das Binden einer Krawatte erstellen würdest, könnte ein stichwortreicher Titel sein: “Wie bindet man eine Krawatte”. Aber das ist bestenfalls uninteressant.Es gibt zahlreiche bessere Positionen, die du einnehmen könntest:Wie man eine Krawatte mit der “007-Technik” bindetWie man eine Krawatte in 11 Sekunden flach bindetMeine 3‑Jährige bringt dir bei, wie man eine Krawatte bindetDer Punkt ist, dass langweilige Titel in einer umkämpften Wettbewerbslandschaft seltener auffallen.4. Erstelle ein Thumbnail (Miniaturansicht), die deinen Titel unterstreichtThumbnails sind in der Regel das erste, was du dir ansiehst, bevor du dich zu einem Video durchklickst. Meiner Meinung nach ist es der schwierigste Teil, ihn konsequent umzusetzen.Hier ist das Vorschaubild für unser SEO-Fehler-Video:Der Thumbnail-Text beschreibt das Video, da 91% die Mehrheit ausmachen.Und wenn man genau hinsieht, gibt es ein Bild von Googles Seitenzahlen, wobei der dritte Teil umkreist ist und besagt: “Du bist hier”.Du kannst dich auch von Dingen um dich herum inspirieren lassen und deine Vorstellungskraft nutzen, um unbestreitbare Wahrheiten zu sagen. Hier ist ein Thumbnail aus unserem Video, “wie lange dauert es, bis man bei Google zu ranken:”Und wenn du nicht weiter kommst, versuche, Ideen aus Google-Bildern oder Stockfotos zu bekommen. Eine Suche bei Adobe Stock nach dem Wort “System” zeigt diese Fotos an.Und unser Miniaturbild für unser Link Building System Video verwendet eine ähnliche Idee (aber cooler).Schreibe auffindbare BeschreibungenYouTube sagt, dass die Verwendung der “richtigen” Keywords die Views und die Betrachtungszeit erhöhen kann, da sie helfen, dass deine Videos in den Suchergebnissen erscheinen.In derselben Studie von Briggsby fanden sie heraus, dass 75% der Top-20-Ergebnisse eine breite Übereinstimmungsvariante in ihrem Beschreibungstext verwendeten.Aber was sind “die richtigen” Keywords?Zu Beginn fügen wir unser Ziel-Keyword sowohl im Titel als auch in der Beschreibung hinzu. Aber wir integrieren auch verwandte Keywords.Finde verwandte Keywords aus konkurrierenden VideosKlick dich durch zu einigen der Top-Ranking-Videos für dein Ziel-Keyword und lies deren Beschreibungen.Achte auf häufige Schlüsselwörter, die sie in ihren Beschreibungstexten verwenden. In vielen Fällen vergessen die Autoren die Beschreibungen, so dass es in diesem Fall als eine kleine, aber potenzielle Gelegenheit betrachtet werden sollte, sie zu übertreffen.Benutze ein Keyword ResearchToolIch weiß, dass ich erwähnt habe, dass die Verwendung von Keyword-Daten von Google eine schlechte Idee ist. Aber das warder Punkt, an dem es um die Themenrecherche geht, die bereits zu diesem Zeitpunkt erfolgen sein sollte.Tatsächlich empfiehlt YouTube für diese Phase die Verwendung von Tools wie Google Trends oder Google Keyword Planner.Anstatt Keywordideen von GKP zu verwenden, verwende ich den organischen Keyword-Bericht im Site Explorer.So kannst du es auch machen:Suche nach deinem Ziel-Keyword in Google.Kopiere und füge die Top-Ranking URL in den Site Explorer ein.Navigiere zum Bericht “Organische Keywords” in der Seitenleiste, der dir alle Keywords angezeigt werden, für die diese Seite Rankings hat.Von hier aus geht es nur darum, den Keyword-Bericht zu durchsuchen und Unterthemen und andere Phrasen auszuwählen, die für dein Video relevant sind.Aber es besteht keine Notwendigkeit, Keywords zu spammen. Nutze das, was Sinn macht.Ein Beispiel, das ich vom obigen Screenshot wegnehmen würde, ist die Konzentration auf das Binden eines Windsor-Knotens.Persönlich habe ich festgestellt, dass längere Beschreibungen besser funktionieren, da sie YouTube mehr Kontext zum Inhalt des Videos geben. Aber wir halten die Beschreibungen nur so lange, wie es nötig ist, und versuchen nicht, Keywords reinzuquetschen.TagsTags sind eine weitere Methode, um deinem Video einen Kontext zu geben, der dir helfen kann, in der YouTube-Suche und den Vorschlägen zu ranken.YouTube vereinfacht dies, indem es empfiehlt, Keywords und Phrasen hinzuzufügen, die dein Video am Besten beschreiben.Da du bereits deine Keyword-Recherche durchgeführt und deinen Titel und deine Beschreibung um diese Keywords herum optimiert hast, sollte es ziemlich einfach sein.Du kannst auch Tools wie VidIQ oder TubeBuddy verwenden, um die Tags für konkurrierende Videos anzuzeigen.Suche nach gängigen Tags in konkurrierenden Videos und füge deinem Video Tags hinzu, die sinnvoll sind.Schritt #5: In-Video OptimierungenDie Erstellung des Videos ist 80% der Schlacht. Es gibt zusätzliche Optimierungen, die du vornehmen kannst, um die Retention Rate zu erhöhen und eine bessere Benutzerfreundlichkeit für deine Zuschauer zu schaffen.1. Transkriptionen / Closed Captions (CC) (Untertitel)Viele Autoren, einschließlich mir selbst, glauben, dass YouTube Dateien mit geschlossenen Untertiteln liest, um den Kontext von Videos besser zu verstehen.YouTube erstellt automatisch eine Transkriptionsdatei und erledigt die meisten Wörter anständig. Aber es ist alles andere als perfekt (HFS = Ahrefs).Deine Zuschauer kommen wahrscheinlich aus der ganzen Welt und die Sprache, die du sprichst, ist vielleicht nicht ihre Muttersprache.Wenn du deine Videos gescripted hast, dann ist dieser Teil einfach.Klick auf deiner Videoseite auf das Video, das du bearbeiten möchtest. Wähle dann die Registerkarte “Untertitel/CC”.Da ich oft vom Script abweiche, empfehle ich die Option “Transcribe and auto-sync” zu verwenden.Jetzt geht es nur noch darum, das Skript einzufügen und zu überprüfen, ob alle geschriebenen Wörter mit den gesprochenen im Video übereinstimmen.Nachdem du die Datei eingereicht hast, synchronisiert YouTube das Skript automatisch mit deiner Stimme. Zur Sicherheit empfehle ich, das Video noch einmal anzusehen, um sicherzustellen, dass es richtig gemacht wurde.Basierend auf den letzten 90 Tagen verwendeten 16,4% der Besucher unsere englischen Untertitel.2. CardsYouTube-Karten sind ein interaktives Feature, das die Zuschauer ermutigt, eine von fünf Aktionen durchzuführen:Ein anderes Video oder eine andere Wiedergabeliste ansehenEntdecke bei YouTube einen anderen KanalSpende an einen gemeinnützigen ZweckEine Umfrage beantwortenBesuche einen externen LinkMan wählt einfach den Kartentyp aus, den man verwenden möchte > wählt eine geeignete Option (z.B. Video oder Playlist) > wählt einen Timecode aus, bei dem er ausgelöst werden soll.Wenn ein Betrachter auf diesen Timecode trifft, wird der Titel des Videos als Vorschlag eingeblendet. Wenn ein Benutzer auf das Info-Symbol klickt, kann er sich das vorgeschlagene Video ansehen.Anstatt so viele Karten wie möglich einzufügen, fügt man relevante Karten hinzu, bei denen ein Benutzer mehr über ein Unterthema erfahren mchte oder vor hohen Absprungspunkten(z.B. vor dem Ende des Videos).3. EndscreensDie Endbildschirme sind ähnlich wie Karten. Der Zweck ist es, die Zuschauer auf der YouTube-Plattform zu halten.Siehst du ein Muster? 🙂Für unseren Kanal haben wir einen Subscribe-Button sowie ein vorgeschlagenes Video, das der Zuschauer als nächstes ansehen sollte.Dies kann dazu beitragen, dass mehr Abonnenten gewonnen werden und die Zuschauer die Inhalte weiterhin nutzen können.Nebenbei bemerkt.Der Endbildschirm muss während des Bearbeitungsprozesses in das Video eingearbeitet werden. Für unseren Endbildschirm sind sowohl der Abonnementkreis als auch die Abschnitte “nächstes Video” leer. Wenn du Endbildschirmelemente hinzufügst, füllt es diese Abschnitte aus. Die Subscribe-Fläche sollte 196 x 196 px und das Video- oder Playlist-Rechteck 410px x 230px betragen. Hier ist eine kostenlose Vorlage, die du herunterladen kannst.Schritt #6: Publiziere und promote dein VideoDie ersten 24–48 Stunden nach der Veröffentlichung können entscheiden ob dein Video zum Hit oder Fail wird. In diesem Fall wird all die harte Arbeit, die du in dein Video gesteckt hast, getestet.Tatsächlich siehst du dein Video oft auf der ersten Seite von YouTube innerhalb des ersten Tages für deine Zielabfrage.Hier sind einige Tipps, um deine Videos in den ersten beiden Tagen zu bewerben.Finde den besten Zeitpunkt für die Veröffentlichung deines VideosDie beste Zeit ist, wenn die Zielgruppe Videos anschaut. Du kannst Spitzenwerte identifizieren, indem du deine Echtzeitberichte überwachst.Dies kann sich zwar von Tag zu Tag ändern, aber es gibt klare Muster, die du sehen wirst.Zum Beispiel dachte ich instinktiv, dass die beste Zeit für die Veröffentlichung unserer Videos an einem Wochentag gegen Mittag sein würde.Nachdem ich unsere Echtzeit-Analysen über eine Woche hinweg beobachtet hatte, stellte ich fest, dass unsere Ansichten im Allgemeinen zwischen 10:00 — 11:00 Uhr EST ihren Höhepunkt erreichen.Aber wenn man sich die beiden einstündigen Slots vor dem Spike (8:00–9:00 und 9:00–10:00 Uhr) ansieht, ist die Anzahl der Views fast gleich groß wie der Peak.Also begannen wir um 7:30 Uhr EST zu posten, was für uns zu funktionieren scheint.Die Veröffentlichung zum “besten” Zeitpunkt gibt dir die Möglichkeit, die Views zu maximieren.Wenn du noch keinebeträchtliche Anzahl von täglichen Ansichten aufgebaut hast, dann kannst du versuchen, diese allgemeinen Zeitfenster zu verfolgen, mit freundlicher Genehmigung von Frederator Networks.Fokussiere dich auf den Aufbau deiner Zielgruppe und nimm Anpassungen an deinen Veröffentlichungszeiten vor, während du deine eigenen Publikumsdaten sammelst.Auf Kommentare antworten/sich beteiligenYouTube ist eine soziale Plattform, was bedeutet, dass du interagieren musst.Versuche in der ersten Woche oder so, auf alle neuen Kommentare zu antworten, die die Leute hinterlassen, und gib “Herzen”, um deinen Kommentatoren Anerkennung zu zeigen.YouTube hat festgestellt, dass Zuschauer, die ein Herz erhalten haben, dreimal häufiger auf die Benachrichtigung klicken als andere Arten von Benachrichtigungen.Wir reagieren auf fast alle Kommentare, unabhängig davon, wann das Video veröffentlicht wurde.Werbe bei der bestehenden ZielgruppeHast du einen Blog, Newsletter oder Social Media Account? Nutze sie, um deine neuen YouTube-Videos zu bewerben.NewsletterSchicke deinen Abonnenten in den ersten 48 Stunden eine E‑Mail, in der sie über dein neues Video informiert werden.Bei Ahrefs veröffentlichen wir unsere wöchentlichen Videos am Mittwoch und setzen innerhalb weniger Stunden eine In-App-Benachrichtigung ein, um unsere Videos zu bewerben, ohne die Kunden zu stören.Am Donnerstag senden wir eine E‑Mail an unsere Blog-Abonnenten mit einem Link zu unserem neuesten Blog-Post und Video.Social mediaNative Videos haben für uns auf Social Media aus Sicht des Engagements nicht besonders gut funktioniert. Und es macht Sinn, wenn man an “Platform Intent” denkt.Ich weiß nicht, wie es dir geht, aber ich logge mich nicht bei Twitter ein, um ein 13-minütiges Video über den Aufbau von Links zu sehen.Auf Twitter twittern wir neue Videos für Follower am selben Tag innerhalb weniger Stunden nach dem Go Live.Auf Facebook veröffentlichen wir immer noch vollständige native Videos, aber wir verlinken zu einigen Videos auf unserem YouTube-Kanal.Alternativ kannst du kurze Ausschnitte deines Videos auf Facebook mit einem Teaser und einem Link zum vollständigen Video veröffentlichen.Wie du deine Videos bewerben kannst, wenn du kein Publikum hastWenn du kein bestehendes Publikum hast, musst du etwas härter arbeiten.Hier sind ein paar Dinge, die du tun kannst.1. Füge Video-Einbettungen zu den Quora-Antworten hinzuQuora ist ein beliebtes Frage-Antwort-Forum. Und das Hinzufügen von Inhalten in langen Formaten ist in diesem Netzwerk nicht ungewöhnlich.Der Prozess läuft so ab.Finde eine zu beantwortende Frage > gib die beste Antwort, die du finden kannst > binde dein Video dort ein, wo es deine Inhalte unterstützt.Du kannst nach Fragen mit der nativen Suche von Quora suchen oder wenn du einen datengesteuerten Weg suchst, um beliebte Fragen zu finden, dann verwende den organischen Keywords-Bericht in Site Explorer mit Quora als Ziel.Benutze dann das Suchfeld “einschließen”, um nach einem allgemeinen Keyword zu suchen, das sich auf dein Video bezieht. Stelle sicher, dass der Filter so eingestellt ist, dass er nur innerhalb von Keywords nach relevanteren Ergebnissen sucht.Poste einfach einen gut durchdachten Inhalt, der die Anfrage beantwortet und bette dein Video in deine Antwort ein.2. KooperationenKooperationen auf YouTube sind eine großartige Möglichkeit, neue, zielgerichtete Abonnenten schnell zu gewinnen. Wenn du gut darin bist, was du unterrichtest, dann lohnt es sich, Beziehungen zu YouTubers in deinem Raum mit einem ähnlichen Publikum aufzubauen.Die typische Zusammenarbeit funktioniert so.Finde einen ähnlichen, nicht konkurrierenden Kanal > bitte sie um Zusammenarbeit > erstelle ein Video für die Kanäle des anderen > empfehle deine Zielgruppe dem Kanal deinesPartners.Aber wenn du kein bestehendes Publikum hast, dann wird es schwierig sein, sie davon zu überzeugen, dass du Inhalte für ihren Kanal erstellen kannst.Die Lösung? Werde kreativ.Hier ist ein hypothetisches Beispiel, um deine kreativen Säfte fließen zu lassen.Nehmen wir an, du schaffst einen Kanal für die Reparatur von Elektronik. Du könntest einen beliebten Tech YouTube-Kanal kontaktieren und ihnen Inhalte zum Abrüsten des neuesten iPhone anbieten, das gestern veröffentlicht wurde.Du kannst ihnen zwar keine Zuschauer oder Abonnenten schicken, aber du kannst ihnen ein einzigartiges Stück Content geben, das auf ihrem Kanal besonders gut abschneiden würde. Sie haben das Publikum, du hast das technische Wissen dazu.Was auch immer dein Pitch ist, du solltest einen Punkt der Hebelwirkung haben, an dem der Nutzen darauf ausgerichtet ist.3. Bezahle für YouTube AdsDu hast kein Publikum? Kauf es.Im Moment sind YouTube-Anzeigen ziemlich billig. Du kannst nach Interesse, Keyword oder benutzerdefinierten Zielgruppen (z.B. Website-Traffic) suchen.Wenn du ein großartiges Video hast, richte einige Suchanzeigen ein, die auf deinem Ziel-Keyword basieren, mit der Absicht, dein Abonnement zu verdienen.Wenn die Abonnementennbasis wächst, werden diese mit deinen zukünftigen Videos benachrichtigt und helfen, dein Wachstum zu beschleunigen, ohne deinen Geldbeutel zu knacken.Schritt #7: Nach der Videoanalyse und ‑optimierungDu kannst das aktuelle Video nicht bearbeiten, sobald es veröffentlicht wurde, oder es wie einen Blogbeitrag umleiten.Es ist nervig, aber hey.… es ist nervig für alle.Am besten ist es, Daten aus deinen veröffentlichten Videos zu erhalten und zu erfahren, was zu einem hohen Engagement führt.Hier ist, wie es funktioniert:Analyse der Graphen zur PublikumsbindungKlicke auf YouTube Analytics > Wähle ein Video aus, das du optimieren möchtest > Zielgruppenbindung.Du siehst die durchschnittliche Ansichtsdauer, den Prozentsatz der angesehenen Videos und wenn du auf das Diagramm klickst, wird dir das Diagramm zur Zuschauerbindung für dieses Video angezeigt.ZuschauerbindungsgraphDieses Diagramm erfasst alle Ansichten für jede Sekunde, die im Video angesehen wird. Anschließend wird eine Retentionskurve in Prozent aufgezeichnet.Du kannst es verwenden, um beliebte Teile in deinem Video zu identifizieren. Wenn du gute Arbeit geleistet hast, um deine Zuschauer zu begeistern, wirst du eine graduelle Kurve sehen. Außerdem wirst du kleine Unebenheiten in der Grafik bemerken, die einige Autoren als “True Engagement” bezeichnen.Das ist eine gute Sache.Klick auf eine dieser “Unebenheiten” und springe zu dem Teil, an dem die Leute am meisten interagieren. Versuche zu entschlüsseln, warum mehr Menschen diesen Teil gesehen oder wieder gesehen haben.Z.B. geschah dieser Ausschlag weil Leute an dem Google-Suchoperator interessiert sind, den ich benutzt hatte.Lerne aus diesen Tipps und nutze sie, um herauszufinden, wie du zukünftige Videos noch ansprechender gestalten kannst.Man kann auch nach starken Absprungspunkten suchen. Analysiere, warum Leute gehen und fügeYouTube-Karten an diesen Orten hinzu.Nach dem Aussehen der obigen Grafik muss ich an meinem Intro arbeiten. Ich kann auch ein paar Karten zum Video hinzufügen. Definitiv eine am Ende und vielleicht eine in der Mitte. Erledigt und erledigt.Prüfe, ob du die Suchabsicht erfüllt hastIn YouTube Studio kannst du die durchschnittliche Ansichtsdauer für alle Keywords sehen, für die du ein Ranking hast.Beta Studio > Wähle dein Video > Analytics > reach viewers tab > Traffic-Quelle: YouTube searchWenn ein Keywordeine hohe durchschnittliche Betrachtungsdauer ergab, ist das gut für dich.Wenn du ein nicht so heißes Video produzierst, lügen die Statistiken nicht.Vergleiche diese Zahlen mit der durchschnittlichen Anzeigedauer und dem Prozentsatz der angesehenen Videos, um eine Vorstellung davon zu erhalten, ob du auf dem richtigen Weg bist.Wenn du Videos mit niedrigem Engagement produzierst, aber für dieses Keyword ein hohes Ranking haben mchtest, kannst du das Video aus einem neuen Blickwinkel neu erstellen.Schritt #8: Optimiere für die SitzungszeitDie Sitzungszeit ist die Gesamtzeit, die ein Zuschauer Videos auf YouTube betrachtet, ohne die Plattform zu verlassen.Warum ist daswichtig? Ab 2012 wurde es zu einem ranking factor.We’ve started adjusting the ranking of videos in YouTube search to reward engaging videos that keep viewers watching. […] The experimental results of this change have proven positive — less clicking, more watching. […] As with previous optimizations to our discovery features, this should benefit your channel if your videos drive more viewing time across YouTube.(Übersetzung: Wir haben damit begonnen, das Ranking der Videos in der YouTube-Suche anzupassen, um ansprechende Videos zu belohnen, die die Zuschauer am Zuschalten halten. Die experimentellen Ergebnisse dieser Veränderung haben sich als positiv erwiesen — weniger Klicken, mehr Zusehen. Wie bei früheren Optimierungen unserer Discovery-Funktionen sollte dies Ihrem Kanal zugute kommen, wenn Ihre Videos mehr Wiedergabezeit auf YouTube bringen.)Es gibt zwei wesentliche Vorteile bei der Verlängerung der Sitzungsdauer:Hält Zuschauer dazu an, deine Inhalte länger zu nutzen.Dein gesamter Kanal sollte mehr Vorschläge und Ansichten erhalten.Ich habe bereits über die Verwendung von Karten und Endscreens gesprochen, was dem Wachstum von Ahrefs’ Channel geholfen hat.Hier sind noch ein paar weitere Möglichkeiten, die Sitzungszeit zu verbessern.1. Erstelle eine SerieHast du jemals nach etwas auf YouTube gesucht, dir ein Video von einem Autorangesehen, von dem du noch nie gehört hast, und dann dessen ganze Serie gebinge-watched?Denke an #AskGaryVee oder 490 episodes von Casey Neistat’s VlogAls ich damit anfing, Videos für Ahrefs zu erstellen, erstellten wir eine Serie darüber, wie man Ahrefs nutzt für keyword research und link building.Die ersten zwei haben gut dabei geholfen, unsere Kunden zu schulen in unserer Marketing with Ahrefs Serie.Vor ein paar Monaten habe ich eine kurze Serie über WordPress SEO erstellt, die zum Zeitpunkt des Schreibens auf YouTube die Nummer 1 ist. Ich schreibe einen Teil davon einer höheren Sitzungszeit zu als unsere Wettbewerber für dieses Keyword.Um die Sendezeit mit Serien zu erhöhen, fügt man ein Video-Endbildschirmelement hinzu, das auf die “nächste Episode” zeigt, und verwendet eine Karte, die auf das gleiche Video zeigt, bevor die Zuschauer abspringen.Lies nun den nächsten Teil, denn dort passiert die Magie.2. Benutze Serien-PlaylistenEine Playlist ist eine Liste von Videos, die in der Reihenfolge ihrer Einstellung abgespielt werden.Eine Serien-Wiedergabeliste hingegen ist das alles auch, aber es ist auch die Art und Weise eines Erstellers, YouTube zu sagen, dass deine Gruppe von Videos eine “offizielle” Liste von Videos ist. Stellt euch vor, wie Netflix es mit Staffeln und Episoden eurer Lieblingssendung macht.Die Verwendung von Serien-Wiedergabelisten hilft YouTube zu verstehen, welche Videos als nächstes vorgeschlagen werden sollten, was deine Chancen erhöht, den “up next”-Platz zu belegen.Wenn du die Wiedergabeliste für Karte, Endbildschirm und Serie erstellt hast, hast du jetzt drei Stellen, an denen dein nächstes Video den Zuschauern empfohlen wird.3. Benutze meinen Channel Page HackDeine Kanalseite wird wahrscheinlich eine der am häufigsten besuchten Seiten sein. Es ist also eine Optimierung wert.Die konventionelle Konversionsweisheit wird dir sagen, dass du die wichtigsten Dinge ganz oben platzieren sollst. Also, ich habe Folgendes getan.Featured videoViele Autoren empfehlen die Verwendung eines Kanal-Trailers. Wir haben es versucht und es hat nicht funktioniert. Stattdessen verwenden wir unser Video zur On-Page-Optimierung.Wir interessieren uns nicht wirklich für das Keyword “On-Page-Optimierung”, aber unsere Analysen legen nahe, dass es eine solide “view to subscription”-Rate hat. Am wichtigsten ist, dass es für das Publikum, das wir ansprechen wollen, relevant ist — SEOs.Und relevantere Abonnenten bedeuten, dass mehr Menschen benachrichtigt werden und sich unsere neuen Videos ansehen.Um Videos zu finden, die heute Abonnenten gewinnen gehe zu YouTube Analytics > Publikum aufbauen> Klicke den Hauptgraph.Dann wähle ein Video das viele Abonnenten im Verhältnis zu einzigartigen Zuschauern hat.Es lohnt sich, vor der Auswahl eines Videos, das deinen Kanal repräsentiert, zusätzliche 10 Minuten zu investieren, um deinen Watchtime-Bericht zu durchforsten und ein Gleichgewicht zwischen Abonnenten und Retentionsrate zu finden.Eine Wiedergabeliste hinzufügenDein Kanal wird anders sein als unserer. Aber du und ich haben das gleiche Ziel.Behalte die Zuschauer so lange wie möglich.Wenn du deinen Kanal anpasst, hast du eine ganze Reihe von Optionen, die du hinzufügen kannst (Playlists, einzelne Videos, beliebte Videos usw.). Ich habe mich entschieden, eine einzige Wiedergabeliste von dem zu verwenden, was scheinbar zufällig erscheint.Aber es ist überhaupt nicht zufällig. Die ersten vier Videos, die du sehen wirst, sind:Part 1: Link building SeriePart 1: WordPress SEO SeriePart 1: Keyword research SeriePart 2: Keyword research SerieWenn du es nicht bemerkt hast, ist jedes dieser Videos das erste Video einer unserer Serien, abgesehen vom letzten Video, da wir (noch) keine vierte Videoserie haben.Jedes dieser Videos gehört zu einer “Serien-Wiedergabeliste”, d.h. wir geben unseren Zuschauern die Möglichkeit, ihr Thema auszuwählen, und YouTube wird die Vorschläge machen. Hier ist, was passiert, wenn du auf diese Videos klickst.Egal, auf welches Video du klickst, es erhöht unsere Chancen, dass die Zuschauer den Rest der Serie weiterhin sehen.Obwohl YouTube in seinen Analysen keine “Session Watch Time”-Metrik hat, bin ich fest davon überzeugt, dass sie zu unserer Erhöhung der gesamten Zuschauerzeit beiträgt.FazitYouTube SEO aus technischer Sicht ist einfach. Verbessere deine Titel, Beschreibungen und Tags.Füge relevante Karten, Endscreens oder Beschreibungslinks hinzu und du bist goldrichtig aufgestellt.Aber die größte Herausforderung bei Video-SEO ist es, dein Publikum zu begeistern.Nimm diese Prozesse und Tipps und konzentriere deine Aufmerksamkeit auf diese drei Dinge: Unterhaltung, Engagement und Ranking. Über­set­zt von seybold.de, Spezial­ist für Key­wor­drecherchen und Online Mar­ket­ing seit über 20 Jahren. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Artikel von Sam Oh Director of Product Education und alles, was mit Video zu tun hat @ Ahrefs. Ich erstelle Systeme.",
  "headers": [
    {
      "level": "H1",
      "text": "YouTube SEO: Wie deine Videos ranken — komplette Anleitung"
    },
    {
      "level": "H2",
      "text": "Was ist YouTube SEO?"
    },
    {
      "level": "H2",
      "text": "Wie der Such-Algorithmus von YouTube funktioniert"
    },
    {
      "level": "H2",
      "text": "Schritt #1: YouTube Keyword Research"
    },
    {
      "level": "H3",
      "text": "YouTube Vorschläge gepaart mit Google Trends"
    },
    {
      "level": "H3",
      "text": "Benutze den Ahrefs’ Keywords Explorer"
    },
    {
      "level": "H4",
      "text": "Bulk Keyword Analyse"
    },
    {
      "level": "H4",
      "text": "Generiere neue Keywordideen"
    },
    {
      "level": "H3",
      "text": "Der mehrfache Blick in die Suchergebnisse von Google"
    },
    {
      "level": "H4",
      "text": "1. Suche in Google nach dem Ziel-Keyword"
    },
    {
      "level": "H4",
      "text": "2. Benutze den Content Explorer um Videos nach Themen zu suchen"
    },
    {
      "level": "H4",
      "text": "3. Benutze Site Explorer und Batch Analyse um hohe Traffic-Chancen zu aufzudecken"
    },
    {
      "level": "H2",
      "text": "Schritt #2: Identifiziere die Suchabsicht"
    },
    {
      "level": "H2",
      "text": "Schritt #3: Erfülle Such-Intents mit einem hochauflösenden Video"
    },
    {
      "level": "H3",
      "text": "a) Plane deine Videos bevor du sie erstellst"
    },
    {
      "level": "H3",
      "text": "b) Beginne mit einem Paukenschlag"
    },
    {
      "level": "H4",
      "text": "1. Sei empathisch"
    },
    {
      "level": "H4",
      "text": "2. Identifiziere das Problem"
    },
    {
      "level": "H4",
      "text": "3. Plane"
    },
    {
      "level": "H3",
      "text": "c) Frage deine Zuschauer nach Kommentaren, Likes und Abonnent zu werden"
    },
    {
      "level": "H3",
      "text": "d) Editiere deine Videos strategisch"
    },
    {
      "level": "H4",
      "text": "1. Sprungschnitte hinzufügen"
    },
    {
      "level": "H4",
      "text": "2. Achte auf die Lücken in deinen Hauptszenen"
    },
    {
      "level": "H4",
      "text": "3. Ziehe die Aufmerksamkeit deiner Zuschauer auf das, was sie sehen sollen"
    },
    {
      "level": "H4",
      "text": "4. Unterhalte mit Geschichten oder Erzählungen"
    },
    {
      "level": "H3",
      "text": "e) Erstelle brutalst ehrliche Feedbackschleifen"
    },
    {
      "level": "H4",
      "text": "1. Feedback zum Skript"
    },
    {
      "level": "H4",
      "text": "2. Feedback zu den Video-Edits"
    },
    {
      "level": "H2",
      "text": "Schritt #4: On-Page Video Optimierung"
    },
    {
      "level": "H3",
      "text": "Erstelle den perfekten Titel- und Thumbnail-Kombination"
    },
    {
      "level": "H4",
      "text": "1. Benutze dein Keyword im Titel"
    },
    {
      "level": "H4",
      "text": "2. Dein Titel sollte unter 60 Zeichen bleiben"
    },
    {
      "level": "H4",
      "text": "3. Verfasse einprägsame Titel, die Neugierde wecken oder einen Nutzen hervorheben"
    },
    {
      "level": "H4",
      "text": "4. Erstelle ein Thumbnail (Miniaturansicht), die deinen Titel unterstreicht"
    },
    {
      "level": "H3",
      "text": "Schreibe auffindbare Beschreibungen"
    },
    {
      "level": "H4",
      "text": "Finde verwandte Keywords aus konkurrierenden Videos"
    },
    {
      "level": "H4",
      "text": "Benutze ein Keyword ResearchTool"
    },
    {
      "level": "H3",
      "text": "Tags"
    },
    {
      "level": "H2",
      "text": "Schritt #5: In-Video Optimierungen"
    },
    {
      "level": "H3",
      "text": "1. Transkriptionen / Closed Captions (CC) (Untertitel)"
    },
    {
      "level": "H3",
      "text": "2. Cards"
    },
    {
      "level": "H3",
      "text": "3. Endscreens"
    },
    {
      "level": "H2",
      "text": "Schritt #6: Publiziere und promote dein Video"
    },
    {
      "level": "H3",
      "text": "Finde den besten Zeitpunkt für die Veröffentlichung deines Videos"
    },
    {
      "level": "H3",
      "text": "Auf Kommentare antworten/sich beteiligen"
    },
    {
      "level": "H3",
      "text": "Werbe bei der bestehenden Zielgruppe"
    },
    {
      "level": "H4",
      "text": "Newsletter"
    },
    {
      "level": "H4",
      "text": "Social media"
    },
    {
      "level": "H3",
      "text": "Wie du deine Videos bewerben kannst, wenn du kein Publikum hast"
    },
    {
      "level": "H4",
      "text": "1. Füge Video-Einbettungen zu den Quora-Antworten hinzu"
    },
    {
      "level": "H4",
      "text": "2. Kooperationen"
    },
    {
      "level": "H4",
      "text": "3. Bezahle für YouTube Ads"
    },
    {
      "level": "H2",
      "text": "Schritt #7: Nach der Videoanalyse und ‑optimierung"
    },
    {
      "level": "H3",
      "text": "Analyse der Graphen zur Publikumsbindung"
    },
    {
      "level": "H4",
      "text": "Zuschauerbindungsgraph"
    },
    {
      "level": "H3",
      "text": "Prüfe, ob du die Suchabsicht erfüllt hast"
    },
    {
      "level": "H2",
      "text": "Schritt #8: Optimiere für die Sitzungszeit"
    },
    {
      "level": "H3",
      "text": "1. Erstelle eine Serie"
    },
    {
      "level": "H3",
      "text": "2. Benutze Serien-Playlisten"
    },
    {
      "level": "H3",
      "text": "3. Benutze meinen Channel Page Hack"
    },
    {
      "level": "H4",
      "text": "Featured video"
    },
    {
      "level": "H4",
      "text": "Eine Wiedergabeliste hinzufügen"
    },
    {
      "level": "H2",
      "text": "Fazit"
    }
  ],
  "author": "Sam Oh"
}