{
  "url": "https://backlinko.com/hub/youtube/playlists",
  "slug": "playlists",
  "title": "YouTube Video Playlists",
  "description": "Playlists are a great way to get more views on YouTube. This guide shows you exactly how to set up your playlists to maximize success.",
  "content": "PlaylistsWritten by Brian DeanLast updated Sep. 05, 2019What are Playlists? Playlists are a group of related YouTube videos that tend to be organized by topic or theme. When a user watches a playlist, the other videos in that playlist automatically play. Why are Playlists Important? Playlists are important for 3 main reasons: First, playlists make it easy to curate your content into different categories. That way, whenever someone new visits your channel page, they can easily find the right content for them: Second, playlists increase Watch Time. That’s because playlists automatically play all of the videos in that playlist. In fact, YouTube states that: “Great playlists can keep viewers watching longer.” Third, playlists are good for video SEO. That’s because playlists can rank for keywords that your audience searches for on YouTube: Best Practices Write Enticing Titles and Descriptions Your playlist title and description plays a big role in how your playlist performs. Unfortunately many YouTubers use generic sounding playlist titles, like “Ab Workouts” and “Cookie Recipes”. Instead, create compelling titles that highlight the benefit someone will get from your playlist, like: “How to Get a 6 Pack” and “Delicious (And Easy) Cookie Recipes”. Then, write a description that supports your title and outlines why your playlist is worth watching. For example, if you’re a filmmaker or video editor, Cinecom’s playlist titles (and descriptions) make it so you can’t help but check out the videos in their playlists: Keyword-Optimize Your Playlist Yup, just like with videos, you want to include keywords in your playlist title and description. This can help with your YouTube SEO for three main reasons: First, playlists themselves can rank in YouTube’s search results: So if you optimize your playlist around keywords that people search for, it can rank for those terms, leading to more views. Also, playlists give YouTube insights on the context of every video in that playlist. For example, let’s say you just created a video about speed reading. Based on your video’s title, video description and tags, YouTube probably has a good idea of what your video is about. But when you add that to a playlist called “Productivity Hacks”, and put it next to other related videos, YouTube gains an even better understanding of your video, which can lead to more visibility on YouTube: Finally, videos in a playlist are more likely to show up as suggested videos (even when someone watches one of your videos outside of that playlist). Why? Well, YouTube prefers to show “videos that are topically related” in the Suggested Videos column. And when you put a bunch of videos together in a playlist, you’re telling YouTube: “These videos are closely related”. That makes that set of videos very likely to show up as Suggested Videos whenever someone watches any video in that playlist. Use 4-7 Videos In Each Playlist You don’t want to overwhelm your audience with a massive playlist packed with 50 videos. If someone sees a playlist with a million videos in it, they’re not going to watch that playlist. Instead, stick to around 4-7 videos per playlist. This gives people enough content to achieve the benefit you outline in your playlist title… without overwhelming people with too much content. Set Your Best Thumbnail as Your Playlist Thumbnail Just like with a video, YouTube shows a thumbnail next to your playlist when it shows up the search results or in your channel’s “Playlists” tab: Did you know that you can change this thumbnail? Specifically, YouTube lets you use a thumbnail from a video in that playlist as your playlist thumbnail: So you want to choose a thumbnail that’s consistent with your playlist title and description. That way, when someone sees your awesome title, description and representative thumbnail, they’ll say: “This playlist looks awesome!”. Create “New Here” Playlist (Optional) Some YouTube Channels feature a “New Here” playlist at the top of their channel page. Here’s an example: The idea behind this playlist is that you give new visitors a curated list of your best stuff (or a list of videos that best represent your channel). And because it’s placed prominently at the top of your channel page, new visitors won’t be able to miss it. For example, Yes Theory features a “New Here” playlist that includes their most popular and interesting videos: Use Alternate Layouts You can choose to show your playlists as a vertical list… …or a horizontal list. That said, using 100% vertical or 100% horizontal layouts isn’t very eye-catching. Instead, alternate vertical and horizontal on your Channel Page. This mixes things up and makes each individual playlist stand out more. Start Your Playlists With Your Best Videos By default, when you add a new video to a playlist, YouTube adds it to the bottom of the list. But you can get much more out of your playlists by organizing your videos strategically. Here’s how: First, check out the stats on each video in that playlist using the Creator Studio. You want to zero-in on videos that have the best Audience Retention, Watch Time… or videos that do the best job of converting people into subscribers. For example, in this group of videos, you can see that this video has a much higher Watch Time than the others. Needless to say, you’d want to get this video in front of as many people as possible (because more Watch Time=higher rankings). The easiest way to do that? Start one of your playlists off with that video: Learn More How to Use Playlists to Get More Views on YouTube — 5 Tips: 5 tips for getting more out of your YouTube playlists. Helpful. Create & Manage Playlists: The nitty gritty of setting up playlists on your channel.",
  "headers": [
    {
      "level": "H3",
      "text": "Semrush helps you:"
    },
    {
      "level": "H3",
      "text": "Backlinko readers get:"
    },
    {
      "level": "H2",
      "text": "Grow your online visibility.\r\nOn all key channels.\r\nFrom just one platform."
    },
    {
      "level": "H1",
      "text": "Playlists"
    },
    {
      "level": "H4",
      "text": "Learn"
    },
    {
      "level": "H4",
      "text": "Company"
    },
    {
      "level": "H4",
      "text": "Connect"
    }
  ],
  "author": ""
}