{
  "url": "https://www.similarweb.com/blog/research/audience-and-brand-building/market-audience-sizing/",
  "slug": "market-audience-sizing",
  "title": "How to Size Your Market Using Audience Overlap | Similarweb",
  "description": "Discover market sizing opportunities with Audience Overlap. Read this article to find out how you can validate your digital strategy and win your market.",
  "content": "HomeBlogResearchAudience & Brand BuildingHow to Size Your Market Using Audience Overlap Research Intelligence How to Size Your Market Using Audience Overlap Check it out by Chloe Nicholls , Product Marketing Manager, Similarweb 4 Min. July 21, 2021 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic How big is your slice of the audience-share pie? And which other websites is your audience visiting? These are just two of the burning questions that our new, audience overlap feature can help you answer. Business-critical tasks for many digital researchers include analyzing the total addressable market or audience (TAM), identifying expansion opportunities or similar audiences to attract, plus sourcing potential partnerships. But this can be a challenge when you don’t have the tools or the data to easily size your market. Audience overlap lets digital researchers compare up to five websites (like competitors or partners) and measure their total unique visitors and shared audiences for market sizing. Six questions audience overlap can help you answer: What is the % overlap of my audience vs. competitors or partner sites? What’s my true share? What is the total addressable audience online? Which player has the most loyal audience for site traffic? How can I uncover untapped audience growth opportunities? How can I benchmark my traffic share to my competitors or my industry? Audience overlap in action Audience overlap can show you how up to five websites overlap. In the first chart below, you can compare each website directly. Let’s use gap.com to analyze how much of the website’s audience also visit competitor zara.com (12 monthly average, United States). In the example, you can see the total audience between these two players (gap.com and zara.com) is 8.8 million. Each website’s unique visitors and the total number of visitors across the entire group of websites, representing the total unique audience (excluding overlap), are broken down on the right. Next, hover over the overlap to see each site’s shared audience (average unique visitors) and percentage share. Here you can see the shared audience is 592,886 average unique visitors, with 33.7% of zara.com’s total audience (1.7 million) also visiting gap.com vs. 7.7% of gap.com’s total audience of 7.6 million. This tells us a higher proportion of zara.com’s audience also visits gap.com, so at least one out of three visitors goes on to gap.com. You can also add up to five websites, like competitors jcrew.com and abercrombie.com, to further understand the overlap between players. By hovering in the center, you can see the shared audience across all four players is 46,000, ranging between 0.6%-4.3% of each website respectively, and the total unique audience is 10.1 million. This means a small proportion of visitors are potential consumers of all four brands. Pro tip: Export the data from the Venn diagram to explore audience overlap within your own data visualization tools. You can also analyze audience loyalty within your comparison. This shows you the percentage of visitors who exclusively visit the site versus two or more sites in one session. A higher percentage of exclusive visitors indicates greater audience loyalty. Here you can see that 81% of gap.com’s audience only visits the website during one session over a monthly average, compared to zara.com (57%), jcrew.com (46%), and abercrombie.com (46%), which demonstrates the strong loyalty of gap.com’s visitors towards the brand. Finding partnership opportunities with audience overlap You can also use audience overlap analysis to identify potential partnership opportunities that align with your brand or product offering. Imagine you’re a digital strategist at the electric scooter company pureelectric.com. You’re gearing up to launch in the U.K. and want to identify partnerships to promote your new offering and build up excitement. Using audience overlap you can quickly and easily identify the total audience you can reach and what percentage of your audience you already share with potential partner brands. Here you can see the total unique audience is 528,000 (12-month period, in the United Kingdom) and bikeradar.com has the highest number of average unique visitors per month with 279k. Pureelectric.com also has a shared audience with bikeradar.com of 6,900 per month, with at least 12% of their total audience of 56,000 visiting bikeradar.com. This insight reveals a very high potential for pureelectric.com to reach its target audience, plus evaluate the relevance of other media brands to promote the electric scooter product. Try out the Audience Overlap tool Log into the platform to check out the feature. You can read more about audience overlap here. by Chloe Nicholls Product Marketing Manager, Similarweb Chloe, with 10+ years in B2B marketing, is passionate about data-driven business decisions. Based in London, she enjoys the arts, cafes, and theatres. Related Topics: Audience & Brand Building Product Updates This post is subject to Similarweb legal notices and disclaimers. Related Posts Updates Similarweb Product Updates: The September 2024 Edition Product Updates by Adelle Kehoe 2 Min. Oct 14, 2024 Updates Similarweb Product Updates: The August 2024 Edition Product Updates by Adelle Kehoe 3 Min. Sep 11, 2024 Updates Similarweb Rank Tracker Now Tracks Google’s AI Overviews Product Updates by Shay Harel 2 Min. Aug 19, 2024 Updates Similarweb Product Updates: The July 2024 Edition Product Updates by Adelle Kehoe 3 Min. Aug 12, 2024 Updates Say Hello to Similarweb’s Technical SEO Tool Product Updates by Adelle Kehoe 3 Min. Jul 18, 2024 Updates Introducing Data Exporter: Simplified Access to Similarweb Data at Scale Product Updates by Pavel Dimshiz 4 Min. Jul 11, 2024 Get game-changing digital insights today Contact us to set up a call with a market research specialist Talk To An Expert",
  "headers": [
    {
      "level": "H1",
      "text": "How to Size Your Market Using Audience Overlap"
    },
    {
      "level": "H2",
      "text": "Six questions audience overlap can help you answer:"
    },
    {
      "level": "H2",
      "text": "Audience overlap in action"
    },
    {
      "level": "H2",
      "text": "Finding partnership opportunities with audience overlap"
    },
    {
      "level": "H2",
      "text": "Try out the Audience Overlap tool"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The September 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The August 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Similarweb Rank Tracker Now Tracks Google’s AI Overviews"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The July 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Say Hello to Similarweb’s Technical SEO Tool"
    },
    {
      "level": "H3",
      "text": "Introducing Data Exporter: Simplified Access to Similarweb Data at Scale"
    },
    {
      "level": "H3",
      "text": "Get game-changing digital insights today"
    }
  ],
  "author": "by Chloe Nicholls"
}