{
  "url": "https://www.similarweb.com/blog/research/audience-and-brand-building/publishers-audience-analysis/",
  "slug": "publishers-audience-analysis",
  "title": "Audience Development & Growth: Publishers and Media | Similarweb",
  "description": "Audience development strategies are vital for user retention and brand loyalty. Increase engagement with key metrics for the news industry. Read now.",
  "content": "HomeBlogResearchAudience & Brand BuildingAudience Development: The Metrics Publishers and Media Depend On Research Intelligence Audience Development: The Metrics Publishers and Media Depend On Get the guide by Molly Winik , Senior Content Marketing Manager 7 Min. September 12, 2021 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic If you’ve ever set yourself a goal, like learning a new skill or changing career paths, you know the hardest part isn’t deciding what you want to do or how to do it. No, the hardest part is maintaining that goal once you’ve achieved it. Success is just as hard to preserve as it is to accomplish. This holds true for audience analysis and brand building. Targeting the most relevant audience is tricky, but usually, a good research strategy will get the job done. Making sure they don’t run off to the competition, well, that’s another story. The most challenging part of digital audience development is keeping them engaged – and turning unique visitors into loyal readers. In this article, we’ll use insights from Similarweb’s digital suite for publishers to show you how to reach, grow, and maintain your customer base. We also cover valuable metrics to help get you started. Audience development strategies and benefits Audience development is an approach to marketing that focuses on, you guessed it, understanding and nurturing your customer base. Traditionally, marketers divide this process into two parts: acquisition and retention. Audience development strategies merge them into one mutual effort to achieve both rapid audience growth and long-term brand loyalty. The goal is to establish and expand a solid base of loyal customers. For news outlets, that means a growing reader base and more subscribers. With an audience development plan your marketing strategy takes on a holistic nature. This brings a number of benefits: You make better use of your audience’s insights. You build a high level of trust among your audience. You generate higher customer satisfaction. You reach new audiences easier. You create more word-of-mouth promotion. The Publisher’s Guide to Audience Analysis The all-inclusive guide to help digital publishers grow their audience. Increase engagement and get key benchmarks Download now Audience development strategy: get to know the people An audience development strategy views your audience as a group of individuals rather than a digital metric that you need to increase. It means remembering that digital data is merely representative of your audience’s character, size, and behavior. What you need to focus on are the people behind the numbers. But, in the digital transformation era, how do you build these relationships? First, get to know your audience. Collect data about website demographics and audience geography. You want to know who is reading your content. Also, dive into audience engagement metrics to understand their behavior. Find out what their preferences and interests are. Using market segmentation to pinpoint and target different types of visitors is a vital step in any audience development, as it lets you optimize your content marketing strategy with an array of audience-specific messages. Creating different audience segments makes them more approachable as a whole and helps your outreach with curated and personal materials. Personalized content is a powerful tool for relationship building. It helps you provide the reader with what interests them most. You’ll be able to better draw them in and retain their attention. In parallel, identify gaps between your actual and target audience. A quick audience analysis forms the basis for your target audience persona development. Make the necessary adaptations to your marketing to bridge the gaps and better reach your target readership. Measuring audience development Relationships are hard to measure. Which metrics are most representative of successful digital audience development? Can you accurately quantify loyalty? Aneesh Raman, VP of audience development at the media company OZY says he primarily measures repeat visits. The Wall Street Journal measures the number of days in a month the reader is active. Other companies focus their attention on impact by measuring shares, referrals, and social media mentions. Need more convincing that it’s critical to monitor the right metric? Take the case study of a local newspaper in South Carolina. They managed to increase online subscriptions by 250% in two years. How? By swapping from measuring page views to monitoring time spent on the page and engaged minutes. With this information, they were able to better understand what their readers were looking for and what they engaged with the most. Ultimately they were able to modify their content strategy and build a loyal audience. Effective audience development is a continuous effort of monitoring performance and optimizing KPIs. Changes should be part of your routine. Always search for trends and opportunities and implement the relevant amendments. Keep the fundamental goal in mind: nurturing the relationship with the reader. Publisher benchmarks for audience development There isn’t a single way to measure audience development – there are lots of audience analysis types you can use. No matter what you choose, make sure you are combining the relevant metrics that let you gauge progress for audience reach, growth, and loyalty. To get started, see how you stack up against the competition. Your best opportunities lie in areas where you can combine your strengths with your competitors’ weaknesses. An efficient benchmarking tool gets you the data that helps you identify them. Next, get to know your audience through basic demographics and see where you are positioned in the market. Analyze your audience keeping the news industry benchmarks in mind, then dive into details. Compare yourself to some of the current industry benchmarks for publishers and media. Demographics – who are your readers? Demographic audience analysis is one of the easiest ways to get a general understanding of your audience. On a very basic level, you want to identify key information such as the age group, gender, and location of your target audience. Other factors could include education, socio-economic level, profession, marital status, and the list goes on. Audience demographics benchmarks Gender distribution, worldwide, all traffic, June – August 2021 57% men 43% women Currently, men are more likely than women to visit the top 100 news and media websites worldwide, with a split of 57% vs. 43% respectively. When looking at the U.S., gender distribution stays the same. Age groups: 20% aged 18-24 31% aged 25-34 20% aged 35-44 13% aged 45-55 10% age 65+ Age distribution skews younger for publishers worldwide. More than half of all digital news consumers are under the age of 35. This makes sense given that younger generations are more tech-savvy. Identify age groups or locations where you are most successful and start investigating engagement. Understand who your most active audience is and how they visit your website. If you want to dive deeper and do a situational audience analysis, you can correlate demographic and psychographic data with visitors’ feedback. Audience Analysis Guide: Publishers and Media Edition Get the guide Engagement – how do your readers behave? There’s no need to conduct in-depth market research to get a feeling of where you fit into the publishers’ landscape. First benchmark engagement metrics. to your industry averages and then compare your stats to your immediate competitors. Traffic and engagement benchmarks Worldwide, all traffic, June – August 2021 Monthly visits – 26.7 billion Average visit duration – 6 minutes 46 seconds Average pages per visit – 4.6 Average bounce rate – 42.5% Don’t forget to use competitive benchmarking against the top sites in your competitive set – this will provide you with more valuable data. Start correlating various engagement metrics with respect to demographic insights to get a clear picture of how different types of audiences behave. Always keep an eye on the bounce rate to identify potential errors or gaps in expectations. Growing your audience – are you gaining more readers? Check website traffic metrics, such as new users vs. returning users and daily or monthly active users. If the number of new users is growing, you are successful in the first phase of audience development, which is to grow your audience. If your number of returning users is growing, then you’re doing a good job at keeping these new users engaged and on your site. You’re on your way to converting them into long-lasting loyal readers. Audience growth benchmarks In the United States between July to August 2021, the percentage increase of new users for the top online publications in the US was: cnn.com (18.1%) washingtonpost.com (3.2%) nytimes.com (9.6%) foxnews.com (7.1%) nbcnews.com (6.7%) The positive growth for each website suggests that online publishers are growing as more and more readers turn to the internet to consume their news. Audience loyalty – are you holding on to your readers? It’s a different ballgame to gauge audience loyalty. Similarweb has developed some tools that help make the task achievable. Since your users are probably also visiting your competitors’ websites, you need to determine which ones they frequent and evaluate whether your audience is more or less likely to visit competitor sites. By tracking the total addressable audience, you’ll find opportunities to expand your audience and source potential partnerships. The end goal is to improve retention and engagement metrics. Audience loyalty and overlap If we look at three of the top digital publishers, we can see just how loyal readers are. Cnn.com and nytimes.com both get nearly 50% of their traffic share from exclusive visitors to their websites. Another helpful metric is audience overlap. You get to see the size of your mutual audience with competitor websites. This helps you assess the size of your audience compared to that of the competition and identify more potential audiences. Grow your audience with digital intelligence Similarweb has a variety of features that can aid in digital audience development. From pinpointing your target audience to gauging the loyalty of your visitors, our digital intelligence tools for publishers and media can boost readership and create long-lasting relationships. Get started with a free demo today. Want more audience insights? Get a sneak peek of our Publishers and Media Guide to Audience Analysis and Consumer Behavior. Download your full copy here. Audience Development FAQ What is the meaning of audience development? Audience development is about creating and being involved in a community, either by location or by your audience. How do you develop an audience? One good way to develop an audience is to collect data about website demographics and audience geography. by Molly Winik Senior Content Marketing Manager Molly has 8+ years of experience in marketing, content creation, and PR. Her work has been featured on Mention, The Times of Israel, and Culture Trip. Related Topics: Audience & Brand Building This post is subject to Similarweb legal notices and disclaimers. Related Posts Research Intelligence Competitive Matrix Types: Which Is Right For You? Company Research Market Research by Liz March 10 Min. Oct 15, 2024 Research Intelligence Nail Your Market Positioning: A Go-To Guide for Standing Out Market Research by Monique Ellis 9 Min. Oct 11, 2024 Research Intelligence Ecommerce Market Research: Your Secret Weapon for Online Success Market Research by Monique Ellis 6 Min. Sep 30, 2024 Research Intelligence A Guide to Market Research Terminology For Beginners Market Research by Monique Ellis 13 Min. Sep 30, 2024 Research Intelligence Consumer Profiling: Targeting Your Ideal Customer Audience & Brand Building by Monique Ellis 7 Min. Sep 30, 2024 Research Intelligence Market Opportunities: How to Identify and Analyze Them Market Research by James Quilter 11 Min. Sep 20, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Audience Development: The Metrics Publishers and Media Depend On"
    },
    {
      "level": "H2",
      "text": "Audience development strategies and benefits"
    },
    {
      "level": "H2",
      "text": "Audience development strategy: get to know the people"
    },
    {
      "level": "H2",
      "text": "Measuring audience development"
    },
    {
      "level": "H2",
      "text": "Publisher benchmarks for audience development"
    },
    {
      "level": "H3",
      "text": "Demographics – who are your readers?"
    },
    {
      "level": "H3",
      "text": "Engagement – how do your readers behave?"
    },
    {
      "level": "H3",
      "text": "Growing your audience – are you gaining more readers?"
    },
    {
      "level": "H3",
      "text": "Audience loyalty – are you holding on to your readers?"
    },
    {
      "level": "H2",
      "text": "Grow your audience with digital intelligence"
    },
    {
      "level": "H2",
      "text": "Audience Development FAQ"
    },
    {
      "level": "H3",
      "text": "Competitive Matrix Types: Which Is Right For You?"
    },
    {
      "level": "H3",
      "text": "Nail Your Market Positioning: A Go-To Guide for Standing Out"
    },
    {
      "level": "H3",
      "text": "Ecommerce Market Research: Your Secret Weapon for Online Success"
    },
    {
      "level": "H3",
      "text": "A Guide to Market Research Terminology For Beginners"
    },
    {
      "level": "H3",
      "text": "Consumer Profiling: Targeting Your Ideal Customer"
    },
    {
      "level": "H3",
      "text": "Market Opportunities: How to Identify and Analyze Them"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Molly Winik"
}