{
  "url": "https://moz.com/blog/category/design/p3",
  "slug": "p3",
  "title": "Design - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Rob Ousbey October 26, 2009 Getting the Best From On-Site Search on your Website Design Improving on-site search functionality can benefit a site by contributing to a better user experience, and by reducing the barriers for users to reach their destination pages. In this post, I'd like to suggest some different techniques you can implement to get more benefit from your site search. Read this post By: Rand Fishkin September 28, 2009 Design Trends: The Single Purpose Homepage Design Single-Purpose homepage designs are on the rise. This post covers the benefits and runs through examples of successful implementations along with a discussion of potential SEO impacts. Read this post D By: debbiec September 10, 2009 So Your Web Site Visitor Converted To a Sale or Lead and All You Can Say is Thank You? Design Did you know that on average a visitor will remain on a thank you page, after he has completed a form, longer than he remained on most of the web pages he visited before he completed the form? Well you might think what does it matter, he just did what i intended, he either just made a purchase or he has become a lead, however, there is really so much more that you could offer him. ... Read this post R By: raaboo July 1, 2009 Optimizing Joomla 1.5 for Search Engines Design A few posts on here have spoken about Joomla and its possibilities - but nothing really has been mentioned about Joomla 1.5 - so I thought I would contribute my experience.The most important things you need to do with Joomla are the following:Get your Template Right!So many times you will look at Joomla sites, only to notice scripting errors or templates that do n... Read this post By: Sam Niccolls June 25, 2009 5 Ways to Improve your SEO Landing Pages Design A lot a marketers focus optimization efforts deep down the conversion funnel. One particularly effective way to examine conversion rates and inform site changes is to filter out visitors who bounce. This gives you a view of your engagement data that shows only interested visitors. And ultimately, these are the ones most likely to convert into paying customers, and for whom you want to focus most o... Read this post J By: John Schmidt May 11, 2009 How Much Format Counts in the Rankings Design Here's a small illustration of the difference that a user friendly format can make. For my first SEO project, I updated a friend's site to comply with web standards and make it SEO friendly. I was of course eager to see the difference this would make in rankings and traffic. I was expecting to see some improvement, but I was surprised at how quick and dramatic the change was. Read this post By: David Ciccarelli January 5, 2009 Update the Copyright Year on Your Website Design First of all, Happy New Year! With the new year comes some annual maintenance that every webmaster should be conscious of. Here's a quick tip from my list of annual website maintenance. Read this post B By: brettster December 16, 2008 The New Easiest Trick to Increase Conversions Design Way too often load time is ignored due to the presumption that everyone else has broadband. Guess what - not everyone does, and those dial-uppers and smart-phone users are leaving your site, ASAP! Kinda makes you wanna just smush 'em, right? No, no, not your users. Your lard-tard images! Read this post M By: Michael Sparer November 7, 2008 How Paging Improves or Worsens Your Website Design Having read Duncan's post about Information Architecture, I thought I would write a short follow-up about an important means of navigation and IA: the paging navigator. Providing a well thought out paging navigator can immensely increase the value of your website for both search engines and users. What follows is a selection of different popular paging navigators and a short evaluation. Read this post By: Darren Slatten November 6, 2008 Microsoft Forces Me to Hate Internet Explorer Design I found a quote recently that really embodies my sentiments about Microsoft's Internet Explorer: \"If IE6 were a person, I'd punch that person in the face.\" Whose famous words are these? Mine. That's right, this is something that I--the World's Best SEO--actually said to a client last week, in response to an email he sent me. Here's the backstory... Read this post D By: Devin Mills October 20, 2008 Elements of a Great Website Design Plenty of big companies have Flash websites, you might think, so why not yours? The answer is simple. Complicated Flash websites won't help you sell anything. Think back to the animated sites you've seen in the past. They might look nice, but they load slowly, especially for users on slow connections. They can also be awkward to navigate, and they make it difficult for users to bookmark specific pages they'd like to return to. If the purpose of your website is to function like a television commercial, then make is as flashy as you want. Lexus, for example, doesn't sell cars from their website and most of the people who visit their website already know the Lexus brand; therefore, they do not care about a good search engine ranking. People know if they want to find out about Lexus, they can go to www.lexus.com. If your goal for your website is to be listed on the first page of Google, market and sell products, and take money from your customers, you will need a simple and easy to understand design that is search engine friendly. Read this post By: buybigtires October 14, 2008 Content, Design, and Engagement: Three Examples from the New Media Design Disclaimer: The following article is merely an examination of the way these sites engage their users, and not an endorsement of the content or viewpoints advanced by these sites. So I'm a news junkie, My phone can't refresh the page fast enough. I read the news at stoplights, during long restaurant waits. I have to know the current levels of the Ic... Read this post By: Rand Fishkin September 29, 2008 Popular Stories Widgets - Great for Visitors and Surprisingly Valuable for SEO, Too Design It should come as no surprise that having a widget or sidebar element on a news, blog or articles website is great for traffic and page views. Online outlets have been using them to boost readership, email-a-friend features and page views per session counts for years. But, did you know that they're also great for SEO? Let's take a look at some examples, and investigate the myriad of ben... Read this post I By: IndyMediaGroup September 18, 2008 How Flash Affects Your Website's Ranking with SEO Design I recently talked to a prospective client about building his site to promote his photography services. He wanted to use a service by blusites.com which charges no more than $400 for a completely built out site targeted to photographers all in flash. This template was ridiculous for its price -- shopping cart, blog, contact form, video and gallery uploads. He was almost ready to b... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Design"
    },
    {
      "level": "H2",
      "text": "Getting the Best From On-Site Search on your Website"
    },
    {
      "level": "H2",
      "text": "Design Trends: The Single Purpose Homepage"
    },
    {
      "level": "H2",
      "text": "So Your Web Site Visitor Converted To a Sale or Lead and All You Can Say is Thank You?"
    },
    {
      "level": "H2",
      "text": "Optimizing Joomla 1.5 for Search Engines"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "5 Ways to Improve your SEO Landing Pages"
    },
    {
      "level": "H2",
      "text": "How Much Format Counts in the Rankings"
    },
    {
      "level": "H2",
      "text": "Update the Copyright Year on Your Website"
    },
    {
      "level": "H2",
      "text": "The New Easiest Trick to Increase Conversions"
    },
    {
      "level": "H2",
      "text": "How Paging Improves or Worsens Your Website"
    },
    {
      "level": "H2",
      "text": "Microsoft Forces Me to Hate Internet Explorer"
    },
    {
      "level": "H2",
      "text": "Elements of a Great Website"
    },
    {
      "level": "H2",
      "text": "Content, Design, and Engagement: Three Examples from the New Media"
    },
    {
      "level": "H2",
      "text": "Popular Stories Widgets - Great for Visitors and Surprisingly Valuable for SEO, Too"
    },
    {
      "level": "H2",
      "text": "How Flash Affects Your Website's Ranking with SEO"
    }
  ],
  "author": "Rob Ousbey\n          \n            Rand Fishkin\n          \n            debbiec\n          \n            raaboo\n          \n            Sam Niccolls\n          \n            John Schmidt\n          \n            David Ciccarelli\n          \n            brettster\n          \n            Michael Sparer\n          \n            Darren Slatten\n          \n            Devin Mills\n          \n            buybigtires\n          \n            Rand Fishkin\n          \n            IndyMediaGroup"
}