{
  "url": "https://moz.com/blog/category/design/p4",
  "slug": "p4",
  "title": "Design - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "D By: Duncan Morris August 29, 2008 Applying On-Site SEO to Website Templates (Or Why Separation of Code and Content is a Good Thing) Design There are lots of people who would class themselves as a developer and would say they can code in any given language. Often the difference between a good developer and a great developer isn't anything to do with the program, how well it works, and how few bugs there are. The great developers make programs that work but they make them in a way that isolates the various components from each other... Read this post A By: AndrewMottaz August 21, 2008 Collaborative Web Development: Early Input for Success Design Search Engine Marketing - it's only as good as the underlying website you're promoting. I often ask marketers how the development process works for them. Do they have visibility into the project to make sure the website meets their goals? Are they satisfied with the speed and results of the development process? Frequently the answer is no. From e... Read this post By: Rand Fishkin July 14, 2008 8 Innovative Design & UI Elements That Make Sites Better Design It's been a long time since I've blogged about design & usability topics, but I think we're overdue for a revisit. Luckily, in my recent web browsing, I stumbled across some remarkably innovative (as well as several old-school) uncommon design elements that made me take notice. #1 - News via the Logo Sites like Google, Yahoo! & Reddit are famous for... Read this post By: Rebecca Kelley April 29, 2008 Let's Talk Landing Pages Design Chapter 4 of Web Design for ROI is all about landing pages, and it's the best and most valuable chapter thus far. The chapter starts off with this little gem of a quote: Enter the custom landing page. It's a web site's stand-in for ambassador, concierge, and superstar salesperson rolled into one. It's been carefully crafted to meet, ... Read this post C By: Carlos del Rio April 14, 2008 What BookWorm Needs to Do - Landing Page Redesign Design After reading Gab’s problems with Google I have decided that the community might enjoy talking about some of the decisions that you can make in designing your landing pages with a concrete example.... Read this post By: epurplemedia April 7, 2008 Web Site Design and Hosting: Pros and Cons Design Web presence has become a must for businesses, irrespective of their size or reach. Given its wide expanse, ubiquity and cost-effectiveness, the Internet has become a favourite with buyers and sellers alike. Web sites have to cater to a wide range of aspects in order to make an impact on their users. Design, content, links, search-engine friendliness, hosting, etc. are just some of the factors ... Read this post By: Rebecca Kelley April 1, 2008 Web Design for ROI: Chapter 3, Managing for ROI Design In an earlier post I had mentioned that I started reading Web Design for ROI by Lance Loveday and Sandra Niehaus (check out their website for more information on the book). Today I thought I'd share some tidbits from chapter 3, Managing for ROI. ... Read this post R By: RenB March 26, 2008 Why Should You Get Your Site Reviewed? Design Site reviews are a great tool in order to check how well your own site was/is being crafted. It can help you enhance some of the bad points and keep you going on the good ones. A reviewer usually lays an eye on everything that's on your site, be it on the front or hidden in the back alleys. One can also check how well your site is doing outside of itself, that is: on directories, article si... Read this post By: Jane Copland February 27, 2008 URLs & Domains Made Fun and Interesting Design I'm actually serious with the title here. This session was great. Honestly, I've been to more informative sessions here at SMX West than I've been to since Pubcon 2006, where I knew nothing about SEO and everything I heard was new. Unraveling URLs & Demystifying Domains had some good speakers who each provided... Read this post C By: Carlos del Rio January 15, 2008 Designing to Make Customers Design Consider one of the most compelling and confusing parts of online economies -- once someone finds your website, what exactly will they choose to do with it? With a little clever planning the answer is: whatever you want them to.Let's say you've have visitors flocking to your website. They're looking everywhere, at all your pages. Now what? You need to create a clear Action Pa... Read this post C By: Carlos del Rio January 8, 2008 Which Do YOU Need: Traffic or Customers? Design Doing business on the Internet means you have an unlimited audience -- it also means you have many competitors. Thankfully you also have numerous options to build your personal path to success on the web. They fall into two rough groups: Traffic and Customers.Building TrafficTraffic is all the people that ... Read this post L By: Lori Bourne December 18, 2007 To Search or Not to Search: That is the Question Design Recently I've been pondering one of the most basic principles of website usability: people don't use my site like I do. No, that's not quite it. It's more accurate to say this: people don’t use my site like I think they should. I've put a lot of time into making it easy to navigate, and yet still I'm surprised by the way people choose to get around my st... Read this post By: Anthony Kirlew September 20, 2007 Browser compatibility - what really matters? Design Let me start by saying I am not a web designer. I am an SEO consultant, and as such, I have been a part of many site redesigns. Recently, while working on a new launch for an existing site, the discussion of browser compatibility came up. Of course, the designers all weighed in with the Mac / Safari votes (no ill intent, just making the Mac / design connection) and the lead designer... Read this post By: buybigtires September 19, 2007 Confessions of a Former Flash Evangelist Design Like many in the web-design field, I was a conscript as opposed to a volunteer.My html was limited, my javascripting was poor, and the concept of LAMP sent me running away from the light. Okay, I'll be honest. I had no idea what LAMP actually did or how it worked. I wasn't going to try to find out, either. The one ace-in-my-pocket was a basic Flash/Actionscripti... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Design"
    },
    {
      "level": "H2",
      "text": "Applying On-Site SEO to Website Templates (Or Why Separation of Code and Content is a Good Thing)"
    },
    {
      "level": "H2",
      "text": "Collaborative Web Development: Early Input for Success"
    },
    {
      "level": "H2",
      "text": "8 Innovative Design & UI Elements That Make Sites Better"
    },
    {
      "level": "H2",
      "text": "Let's Talk Landing Pages"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "What BookWorm Needs to Do - Landing Page Redesign"
    },
    {
      "level": "H2",
      "text": "Web Site Design and Hosting: Pros and Cons"
    },
    {
      "level": "H2",
      "text": "Web Design for ROI: Chapter 3, Managing for ROI"
    },
    {
      "level": "H2",
      "text": "Why Should You Get Your Site Reviewed?"
    },
    {
      "level": "H2",
      "text": "URLs & Domains Made Fun and Interesting"
    },
    {
      "level": "H2",
      "text": "Designing to Make Customers"
    },
    {
      "level": "H2",
      "text": "Which Do YOU Need: Traffic or Customers?"
    },
    {
      "level": "H2",
      "text": "To Search or Not to Search: That is the Question"
    },
    {
      "level": "H2",
      "text": "Browser compatibility - what really matters?"
    },
    {
      "level": "H2",
      "text": "Confessions of a Former Flash Evangelist"
    }
  ],
  "author": "Duncan Morris\n          \n            AndrewMottaz\n          \n            Rand Fishkin\n          \n            Rebecca Kelley\n          \n            Carlos del Rio\n          \n            epurplemedia\n          \n            Rebecca Kelley\n          \n            RenB\n          \n            Jane Copland\n          \n            Carlos del Rio\n          \n            Carlos del Rio\n          \n            Lori Bourne\n          \n            Anthony Kirlew\n          \n            buybigtires"
}