{
  "url": "https://moz.com/blog/category/seo-reporting/p2",
  "slug": "p2",
  "title": "SEO Reporting - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Adriana Stein November 23, 2021 How to Measure the Quality of Your SEO Traffic Using Google Analytics SEO Analytics | SEO Reporting To get a better understanding of what’s considered “quality traffic”, we’ll look into various Google Analytics metrics that will help you create a rock solid SEO strategy. Read this post By: Katie Cunningham November 10, 2021 Improve Your Reporting and Make Stakeholders Listen by Incorporating Share of Voice SEO Reporting Share of voice (SOV) is a metric that can bring rank tracking to a higher-level conversation about overall awareness. Learn how to look at SOV with STAT, and then how to pull that data into the Google Data Visualization tool to create robust, customized reports for your client or business. Read this post By: Adriana Stein September 6, 2021 How to Calculate Your SEO ROI Using Google Analytics SEO Analytics | SEO Reporting Measuring ROI for your SEO efforts involves two factors: KPIs and the cost of your current SEO campaigns. With GA, you can pinpoint where your audience is coming from, set goals to stay on track, and incorporate the most attractive keywords to rank better in search engines. Read this post By: Caitlin Boroden August 26, 2021 Building a Basic Adobe Analytics Dashboard for SEO SEO Analytics | SEO Reporting Caitlin and Kristi cover the basics of Adobe Analytics for SEO, and guide you through creating a simple dashboard. To learn more, check out the full guide on Moz’s SEO Learning Center! Read this post By: Helen Pollitt August 18, 2021 Data Visualization: Win Friends and Influence People with Accurate Data SEO Reporting | SEO Analytics The key to good reporting is making sure your data elicits the thought, implication, or decision that you want to leave the reader with. To do that, you'll need to make smart choices in how you choose and display your data. Here's how. Read this post By: Brie E Anderson March 24, 2021 SEO Website Analytics: Going One Step Deeper Into GA SEO Analytics | SEO Reporting We rely heavily on analytics for reporting. But did you know that Google Analytics provides data that can be used as a strategy tool? This post offers a quick look at three very specific, very actionable Google Analytics views for uncovering SEO opportunities: tracking Core Web Vitals, finding and fixing 404s, and capitalizing on easy traffic opportunities. Read this post By: Dr. Peter J. Meyers March 19, 2021 Every Metric Is A Vanity Metric SEO Analytics | Whiteboard Friday | SEO Reporting Marketers can get caught up in specific metrics, focusing on those data points that make you look good in reporting, but don’t help you understand your performance. In this week’s episode of Whiteboard Friday, Dr. Pete discusses the vanity we bring to the metrics we track, and how to take a better, more realistic view of your results. Read this post By: Oeuyown Kim February 24, 2021 How Did US Stimulus Checks Impact On-Site Traffic and Conversions? [Case Study] Marketing Industry | SEO Analytics | SEO Reporting The team at Portent conducted a study verifying whether stimulus distributions correlated with revenue spikes in online retailers and auto industries. Dig into their results in this post, along with consumer data to use as predictive indicators through the rest of the pandemic. Read this post By: Chris Giarratana February 15, 2021 5 Tips to Invigorate Boring SEO Reports with Storytelling SEO Reporting | SEO Analytics Do you want to upsell current clients and build lasting relationships? Here are five SEO analytics tips that you can use today! Read this post By: Tom Capper February 1, 2021 SEO Forecasting in Google Sheets SEO Analytics | SEO Reporting After the success of a 2015 article in which he shared a free forecasting tool, Tom has created a new, free spreadsheet template to forecast how your SEO efforts will affect your site traffic. In this post, he shows you how it works and how to use it, and then how to build your own (better?) version. Read this post By: Miriam Ellis January 25, 2021 Outranking Tough Competitors: My One-Year Study of a Google Local Finder Local SEO | SEO Reporting Moz's local SEO subject matter expert, Miriam Ellis, conducted a one-year Google Local Finder study, tracking a local finder for a single query to see if anything brands or the public did could shift the top eatery out of its #1 spot. Here are the results. Read this post By: Miriam Ellis December 22, 2020 The Local SEO Stats & Practical Tactics of Google’s Top-Ranked Grocery Stores Local SEO | SEO Reporting Local SEO expert Miriam Ellis shares results from her analysis of the top local-pack-ranked grocery store in each of the 50 US capital cities, and summarizes the practical tactics she's learned from listening to grocers and their marketers, highlighting how they’re adapting and succeeding in unprecedented times. Read this post By: Robin Lord December 21, 2020 Avoiding False Conversions in Google Analytics SEO Analytics | Search Engines | SEO Reporting There are a huge number of ways you can track conversions in Google Analytics, and a huge number of ways to screw it up. This post is going to focus on some of the main ways you can mess up conversions when you’re basing them on users completing a form and then landing on a thank-you page. Read this post By: Dr. Peter J. Meyers December 16, 2020 Google's December 2020 Core Update: By the Numbers Search Engines | SEO Reporting | Algorithm Updates On December 3rd, Google announced that they were rolling out the latest Core Update. Seven days out, here are the trends we've seen. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO Reporting"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on SEO Reporting"
    },
    {
      "level": "H2",
      "text": "How to Measure the Quality of Your SEO Traffic Using Google Analytics"
    },
    {
      "level": "H2",
      "text": "Improve Your Reporting and Make Stakeholders Listen by Incorporating Share of Voice"
    },
    {
      "level": "H2",
      "text": "How to Calculate Your SEO ROI Using Google Analytics"
    },
    {
      "level": "H2",
      "text": "Building a Basic Adobe Analytics Dashboard for SEO"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Data Visualization: Win Friends and Influence People with Accurate Data"
    },
    {
      "level": "H2",
      "text": "SEO Website Analytics: Going One Step Deeper Into GA"
    },
    {
      "level": "H2",
      "text": "Every Metric Is A Vanity Metric"
    },
    {
      "level": "H2",
      "text": "How Did US Stimulus Checks Impact On-Site Traffic and Conversions? [Case Study]"
    },
    {
      "level": "H2",
      "text": "5 Tips to Invigorate Boring SEO Reports with Storytelling"
    },
    {
      "level": "H2",
      "text": "SEO Forecasting in Google Sheets"
    },
    {
      "level": "H2",
      "text": "Outranking Tough Competitors: My One-Year Study of a Google Local Finder"
    },
    {
      "level": "H2",
      "text": "The Local SEO Stats & Practical Tactics of Google’s Top-Ranked Grocery Stores"
    },
    {
      "level": "H2",
      "text": "Avoiding False Conversions in Google Analytics"
    },
    {
      "level": "H2",
      "text": "Google's December 2020 Core Update: By the Numbers"
    }
  ],
  "author": "Adriana Stein\n          \n            Katie Cunningham\n          \n            Adriana Stein\n          \n            Caitlin Boroden\n          \n            Helen Pollitt\n          \n            Brie E Anderson\n          \n            Dr. Peter J. Meyers\n          \n            Oeuyown Kim\n          \n            Chris Giarratana\n          \n            Tom Capper\n          \n            Miriam Ellis\n          \n            Miriam Ellis\n          \n            Robin Lord\n          \n            Dr. Peter J. Meyers"
}