{
  "url": "https://moz.com/blog/category/seo-reporting/p5",
  "slug": "p5",
  "title": "SEO Reporting - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Simon Poulton April 26, 2016 Here’s How to Spring Clean Your Google Analytics Channel Groupings SEO Analytics | SEO Reporting Google Analytics (GA) is a wonderful and powerful tool, but all too often it can lead to some poor decision-making based on incorrect Channel Grouping attribution. Of course, you should already have a well-defined and enforced UTM tagging strategy (if not, this excellent article from Annie Cushi... Read this post By: Kristina Kledzik April 21, 2016 How Long Do Backlinks Take to Show Effect? Link Building | SEO Reporting | SEO Basics The eternal question: How much time does it take for a link to affect rankings? Kristina Kledzik breaks out the entire process from start to finish. Read this post By: Craig Bradshaw March 30, 2016 Here's How to Supercharge Your Competitive Research Using a URL Profiler and Fusion Tables Link Building | SEO Reporting | Competitive Research Competitive analyses usually mean sifting through a ton of data. Craig Bradshaw's here to share an 8-step process that combines free data collection tools, fusion tables, and network graphs to take care of the heavy lifting when doing competitive research. Read this post By: Noah Lemas March 21, 2016 How & Why to Build a Basic Gantt Chart for Almost Any Project SEO Reporting If you're not using Gantt charts to frame your projects, now's the perfect time to start. A relatively easy way to boost team collaboration and help you win clients, using Gantt charts in your projects is actually far simpler than many people think. Read this post By: Tian Wang February 29, 2016 The Google Analytics Add-On for Sheets: An Intro to an Underutilized Tool SEO Reporting | SEO Analytics | SEO Tools Reporting can be a pain. In today's post, Tian Wang explains about an oft-ignored tool that can help ease some of that pain and make your reporting a breeze: the Google Analytics add-on for Google Sheets. Read this post By: Gabriele Toninelli February 25, 2016 Here’s How to Automate Google Analytics Reporting with Google Sheets SEO Analytics | SEO Reporting | SEO Tools When it comes to automating your Google Analytics reporting, Google Sheets is your friend. Read this post By: Daniel Hochuli February 18, 2016 How to Use Six Google Analytics Reports to Complete a Website Content Audit Content Marketing | SEO Analytics | SEO Reporting I'm a big believer that no good content marketing strategy should begin without a comprehensive audit of the website’s current performance. The simple reason is that you cannot plan ahead if you do not already have a great understanding of where you currently are. In this article, I will show you how a content audit with six important Google Analytics reports can help you make some sma... Read this post By: Rand Fishkin January 1, 2016 How to Build the Right Traffic Metrics Dashboard for 2016 SEO Reporting | Whiteboard Friday What you measure is what you're able to improve. Setting yourself up for success involves measuring your traffic metrics the right way, so you can identify areas to work on and implement the right actions. In the first Whiteboard Friday of 2016, Rand explains what you need to include when building your own traffics metrics dashboard in the new year. Read this post By: Ian Watson December 2, 2015 Let Data Take the Wheel – Using API-Integrated Reporting Dashboards Technical SEO | SEO Reporting How do you keep track of all the data that supports your business intelligence? Ian Watson walks us through setting up a live reporting dashboard that integrates your favorite APIs into an easy-to-visualize format. Read this post By: Bill Sebald October 27, 2015 Are Your Analytics Telling the Right Story? SEO Analytics | SEO Reporting | SEO Consulting Be honest: Are your recommendations based on true analysis, or a template you've become comfortable with? This piece by Bill Sebald will challenge you to think about how you value and use your time in Analytics, and provide useful Analytics examples. Read this post By: Anthony Coraggio October 8, 2015 Campaign Tracking Without Going Crazy: Keeping Order in AdWords Optimization SEO Reporting | SEO Tools | Paid Search Marketing (PPC) Pay-per-click advertising generates vast amounts of data, which presents us with tremendous potential for optimization and success. However, this formidable sword cuts both ways—even skilled managers can quickly find themselves adrift if tests and changes are not carefully tracked. Here’s a quick, actionable guide to keeping order in your AdWords account with a simple and professional activity log. Read this post By: Carlos Escalera Alonso August 2, 2015 Stop Ghost Spam in Google Analytics with One Filter SEO Analytics | SEO Reporting | SEO Basics Don't be distracted by web spam. A simple, easy to use filter could remove the majority of your worries surrounding spam. Read this post By: Amanda King June 25, 2015 How to Rid Your Website of Six Common Google Analytics Headaches SEO Analytics | SEO Reporting If Google Analytics was failing to report data correctly, would you be able to recognize and rectify the problem? After reading this post you will. Read this post By: Mark Haller April 2, 2015 Dead Simple Tips For Measuring Only What Matters SEO Analytics | SEO Reporting It's true that what gets measured, gets managed. But not everything needs to be managed. These tips make sure you only measure what matters. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO Reporting"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on SEO Reporting"
    },
    {
      "level": "H2",
      "text": "Here’s How to Spring Clean Your Google Analytics Channel Groupings"
    },
    {
      "level": "H2",
      "text": "How Long Do Backlinks Take to Show Effect?"
    },
    {
      "level": "H2",
      "text": "Here's How to Supercharge Your Competitive Research Using a URL Profiler and Fusion Tables"
    },
    {
      "level": "H2",
      "text": "How & Why to Build a Basic Gantt Chart for Almost Any Project"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "The Google Analytics Add-On for Sheets: An Intro to an Underutilized Tool"
    },
    {
      "level": "H2",
      "text": "Here’s How to Automate Google Analytics Reporting with Google Sheets"
    },
    {
      "level": "H2",
      "text": "How to Use Six Google Analytics Reports to Complete a Website Content Audit"
    },
    {
      "level": "H2",
      "text": "How to Build the Right Traffic Metrics Dashboard for 2016"
    },
    {
      "level": "H2",
      "text": "Let Data Take the Wheel – Using API-Integrated Reporting Dashboards"
    },
    {
      "level": "H2",
      "text": "Are Your Analytics Telling the Right Story?"
    },
    {
      "level": "H2",
      "text": "Campaign Tracking Without Going Crazy: Keeping Order in AdWords Optimization"
    },
    {
      "level": "H2",
      "text": "Stop Ghost Spam in Google Analytics with One Filter"
    },
    {
      "level": "H2",
      "text": "How to Rid Your Website of Six Common Google Analytics Headaches"
    },
    {
      "level": "H2",
      "text": "Dead Simple Tips For Measuring Only What Matters"
    }
  ],
  "author": "Simon Poulton\n          \n            Kristina Kledzik\n          \n            Craig Bradshaw\n          \n            Noah Lemas\n          \n            Tian Wang\n          \n            Gabriele Toninelli\n          \n            Daniel Hochuli\n          \n            Rand Fishkin\n          \n            Ian Watson\n          \n            Bill Sebald\n          \n            Anthony Coraggio\n          \n            Carlos Escalera Alonso\n          \n            Amanda King\n          \n            Mark Haller"
}