{
  "url": "https://www.similarweb.com/blog/insights/ecommerce-news/app-ecommerce-temu-gains-on-amazon/",
  "slug": "app-ecommerce-temu-gains-on-amazon",
  "title": "Temu Gains on Amazon in App Ecommerce, Becomes #2 Web Marketplace | Similarweb",
  "description": "No ecommerce company comes close to matching Amazon on the web, but in mobile app engagement Temu is catching up",
  "content": "HomeBlogInsightsEcommerce NewsTemu Gains on Amazon in App Ecommerce, Becomes #2 Web Marketplace Insights Temu Gains on Amazon in App Ecommerce, Becomes #2 Web Marketplace by David F. Carr 4 Min. September 11, 2024 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic No ecommerce company comes close to Amazon on the web, but in mobile app engagement Temu is catching up Temu’s mobile-first ecommerce strategy is paying off in the US, UK, and worldwide as it continues to gain on Amazon by the measure of app user engagement. Whether the company is translating that engagement proportionally into revenue is a different question – rivals like Shein have accused Temu of unfair competitive strategies that include losing money on every sale. Yet Temu has succeeded in getting consumers in the US, UK, and worldwide to treat it as the discount store in their pocket that they engage with on a monthly basis. Key takeaways In the US, the Temu app had 185.6 million monthly active users (MAUs) in August, compared with 237.6M for Amazon, according to Similarweb estimates for iOS and Android combined. While that’s still a difference of more than 50 million, Temu has narrowed Amazon’s lead by more than 30 million over the past year. In August, temu.com became the #2 website in Similarweb’s ecommerce marketplace rankings, attracting 684.4M visits worldwide. That puts it ahead of EBay, with 630.1M visits, and other major retailers. In the US, Temu is the #6 marketplace. However, Amazon’s dominance is much clearer on the web, where amazon.com attracted 2.7 billion visits worldwide in August — and that doesn’t even count the traffic to Amazon’s country-specific domains like amazon.co.uk. Temu’s US app user count was up 34% year-over-year (YoY) in August. Based on estimates for Android, monthly usage was up 145% worldwide. In the UK, combined iOS and Android MAUs for Temu were up 16.3% YoY in August. Shein’s app grew users faster, 41%. In the UK,, Amazon, Shein, and Temu are close rivals by MAUs at 15.8M for Amazon, 13.1M for Temu, and 9.6M for Shein. Temu’s upward trajectory in app engagement Temu’s rapid ascent in-app engagement began in 2023 but has continued this year. Here is the comparison for the US, MAUs for iOS and Android combined. Amazon is in the lead, but Temu is ahead of most app commerce competitors. Similar picture in the UK, albeit with Shein close behind Temu Temu has had a similar rapid ascent in the UK, closing in on Amazon as the most used mobile commerce player. Cost of living stresses in the UK have fueled the rise of Temu, with its aggressively low prices. Although our worldwide estimates are limited to Android, they show a similar pattern of growth for Temu on a global basis. Android monthly active users were up 144.5% YoY in August. Amazon is much farther ahead on the web, where Temu’s impact is smaller Temu doesn’t look like nearly as much of a threat to Amazon in terms of web traffic. The comparison below is with amazon.com, not even counting country-specific domains like amazon.co.uk. However, Temu is now the #2 ecommerce marketplace by web commerce worldwide. August’s web traffic to temu.com was up nearly 145% year-over-year (YoY) worldwide (meaning it more than doubled). Temu’s August web traffic was actually down 24% YoY in the UK, although overall the trend has been upward. Temu and Shein are more closely matched by web traffic in the UK, although both are far behind Amazon. Temu’s focus on mobile commerce pays dividends While Temu customers can buy on the web, the company heavily incentivizes usage of its mobile app, using gamification techniques to drive user engagement. That strategy has made Temu one of the most loved ecommerce apps. The Similarweb Insights & Communications team is available to pull additional or updated data on request for the news media (journalists are invited to write to press@similarweb.com). When citing our data, please reference Similarweb as the source and link back to the most relevant blog post or similarweb.com/blog/insights/. Contact: For more information, please write to press@similarweb.com. Methodology Disclaimer: All names, brands, trademarks, and registered trademarks are the property of their respective owners. The data, reports, and other materials provided or made available by Similarweb consist of or include estimated metrics and digital insights generated by Similarweb using its proprietary algorithms, based on information collected by Similarweb from multiple sources using its advanced data methodologies. Similarweb shall not be responsible for the accuracy of such data, reports, and materials and shall have no liability for any decision by any third party based in whole or in part on such data, reports, and materials. by David F. Carr David covers social media, digital advertising, and generative AI. With a background in web trends since the 1990s, he’s also the author of \"Social Collaboration for Dummies\". Related Topics: Ecommerce News This post is subject to Similarweb legal notices and disclaimers. Related Posts Insights Lululemon’s Reported Slowdown: What the Data Tells Us Ecommerce News by Daniel Reid 7 Min. Oct 10, 2024 Insights Search Ranking Shows How Merger of Tapestry and Capri Would Change the Luxury Market Ecommerce News by Inès Durand 4 Min. Oct 3, 2024 Insights Trending Brands: New Balance and Alo Yoga’s Breakout Performance in Athleisure Ecommerce News by Daniel Reid 5 Min. Sep 12, 2024 Insights How the Olympics Is Driving Online Shopping Ecommerce News by Daniel Reid 7 Min. Aug 7, 2024 Insights Australia’s Fashion Market: Small Players, Big Wins Ecommerce News by Mir Jawad 6 Min. Aug 1, 2024 Insights Prime Day July 2024: Top Day 1 Best Sellers You Can’t Miss Ecommerce News by Michelle Lang 5 Min. Jul 17, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Temu Gains on Amazon in App Ecommerce, Becomes #2 Web Marketplace"
    },
    {
      "level": "H2",
      "text": "No ecommerce company comes close to Amazon on the web, but in mobile app engagement Temu is catching up"
    },
    {
      "level": "H2",
      "text": "Key takeaways"
    },
    {
      "level": "H2",
      "text": "Temu’s upward trajectory in app engagement"
    },
    {
      "level": "H2",
      "text": "Similar picture in the UK, albeit with Shein close behind Temu"
    },
    {
      "level": "H2",
      "text": "Amazon is much farther ahead on the web, where Temu’s impact is smaller"
    },
    {
      "level": "H2",
      "text": "Temu’s focus on mobile commerce pays dividends"
    },
    {
      "level": "H3",
      "text": "Lululemon’s Reported Slowdown: What the Data Tells Us"
    },
    {
      "level": "H3",
      "text": "Search Ranking Shows How Merger of Tapestry and Capri Would Change the Luxury Market"
    },
    {
      "level": "H3",
      "text": "Trending Brands: New Balance and Alo Yoga’s Breakout Performance in Athleisure"
    },
    {
      "level": "H3",
      "text": "How the Olympics Is Driving Online Shopping"
    },
    {
      "level": "H3",
      "text": "Australia’s Fashion Market: Small Players, Big Wins"
    },
    {
      "level": "H3",
      "text": "Prime Day July 2024: Top Day 1 Best Sellers You Can’t Miss"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by David F. Carr"
}