{
  "url": "https://www.similarweb.com/blog/insights/ecommerce-news/baby-formula-supply-shock-not-a-surprise/",
  "slug": "baby-formula-supply-shock-not-a-surprise",
  "title": "Baby Formula Supply Shock Not a Surprise | Similarweb",
  "description": "Warning signs began mid-2021, according to an analysis of Similarweb Shopper Intelligence data shared by Amazon, Walmart, and Target. Learn more!",
  "content": "HomeBlogInsightsEcommerce NewsBaby Formula Supply Shock Not a Surprise Insights Baby Formula Supply Shock Not a Surprise Start your free trial by Seema Shah , Senior Director of Research and Analytics 6 Min. May 26, 2022 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Consumer purchasing trends indicate warning signs began in mid-2021 While the baby formula shortage made headlines in recent weeks, pandemic-related supply chain issues in addition to ingredient shortages had been negatively affecting product availability since mid-2021. Because of this shortage, parents have been scrambling to stock up on products, which has led to increased pressure on supply, but also a significant spike in prices. Key takeaways Fast-growing demand for baby formula buoyed units sold and revenue, as consumers pantry-stocked and retailers raised prices to meet demand; this in light of supply chain issues and product recalls Consumers’ searches for terms related to baby formula, including “where to buy” and “how to make homemade formula”, rose 44% from February to April 2022, according to Similarweb estimates High demand and limited supply have weighed on conversion rates or the number of purchases actually completed on Amazon In 2Q22 Recent price increases have come at a rate greater than overall inflation, according to Similarweb’s Shopper Intelligence platform, a proxy for consumer spending and behavior. The Shopper Intelligence analytics are based on data from Amazon.com, Walmart.com and Target.com. The trend has been further exacerbated by the voluntary recall of Abbott’s Similac, Alimentum, and EleCare baby formulas in February 2022 due to potential contamination at the production site. Our analysis leverages consumer purchasing behavior on amazon.com, walmart.com, and target.com to understand the cracks that had been building months before the crisis peaked. Demand surge is a double-edged sword for retailers The baby formula category experienced a sharp increase in both units sold and price, evidenced by large spikes in data for Amazon, Walmart and Target in 3Q21, according to the Similarweb Shopper Intelligence Platform. However, the three retailers did not necessarily move in tandem. As noted above, supply chain issues began cutting into product availability in the summer of 2021, which is when there is the first evidence of a spike in units sold and revenue. In 2H21, consumers began pantry stocking after signs of product out-of-stocks, with baby formula units sold rising 20%, 68%, and 20% on a YoY basis on Amazon, Walmart.com and Target.com, respectively. Manufacturers had already been struggling to procure ingredients and manage production because of issues including labor shortages and distribution bottlenecks. In a second hit to the baby formula sector, market leader Abbott’s products were recalled in February 2022. This resulted in its major facility’s production being suspended, further limiting the availability of baby formula at retail. Abbott, along with Mead Johnson and Perrigo control nearly 90% of the U.S. market, so any deviation in production from one will affect the entire industry. This is one of the few industries in which the majority of manufacturing is in the U.S., given strict regulations and tariffs of as high as 17.5% on imported formula. The FDA recall not only exacerbated the pre-existing product shortage but also led to a steep acceleration in panic buying. This chart highlights the growth in units sold on a YoY basis for Amazon.com, Walmart.com and Target.com. This massive surge in panic buying reached its highest in April with Amazon, Walmart, and Target selling 110%, 134%, and 37% more units, respectively, compared to April 2021. Like Amazon, Walmart, and Target cater to different audiences and differ in platform models, let’s dive deeper into the data behind these consumer purchasing trends on each platform. Amazon On Amazon, units sold of baby formula have risen consistently since August 2021, with the growth accelerating each month. In April 2022, units sold increased 110% to nearly 1 million units, while revenue jumped 166% to $69.7 million, with a majority sold from first-party sellers, according to Similarweb’s Shopper Intelligence platform. Revenue growth was likely due to a combination of product hoarding and inflation; prices of baby formula rose an average of 20.3% on a monthly basis from April 2021 to April 2022. In April 2022, when it appeared that excess inventory of baby formula had been exhausted, Amazon’s conversion rate dropped nearly 11% from the prior year and 18.2% from the prior month, according to Similarweb data. This is likely due to increased searches for products on the website, but limited conversion as products were out of stock. Amazon’s average price per unit of baby formula also increased 23% in the period after the recall, from February to April 2022, compared to the same period last year. These increases combined with the shortages impact lower-income households disproportionately as Similarweb data shows that 28% of Amazon’s audience has a household income of less than $50K a year. Walmart.com Like its rivals, Walmart.com has also faced heightened demand for baby formula, leading to large jumps in YoY growth for units sold and revenue in April 2022 (134% and 106%, respectively.) However, Walmart.com’s pricing trends were contrary to both amazon.com and target.com, according to Similarweb’s Shopper Intelligence data. The average price per unit sold at walmart.com actually fell an average of 2.1% from November 2021 to April 2022, with just one month (March) seeing an increase in price. As Walmart is one of the largest retailers in the world and is known to be extremely price competitive, especially in staples, the company likely refrained from price increases, particularly because 43% of Walmart’s baby formula consumers earn less than $50K a year, according to Similarweb data. Low-income consumers are likely to be most impacted by the increasing prices of baby formula. In March and April 2022, product views jumped about 40%, as parents frantically checked multiple retailers to find any available stock. Target.com Though units sold and revenue growth on target.com rose nearly every month since July 2020, its rate of growth on those metrics was much lower than Walmart.com and Amazon. Units sold rose 38% in April and sales increased 63% in the month. Product views also grew, up 63% in April, in line with sales growth, based on Similarweb’s Shopper Intelligence data. This could suggest a higher conversion rate. From a demographic perspective, Target.com’s baby formula consumers are much higher-end, with nearly 53% having incomes over $100,000, according to Similarweb data. However, Target’s price increases of baby formula products are likely to impact the 20.2% of its audience that falls in the under $50K income bracket. Searches related to shortage skyrocket From February to April 2022, there was a 44% increase in searches for keywords related to making baby formula at home, according to Similarweb estimates. This included consumers looking for ingredients, recipes, components of store-bought formula powders, as well as where there was a potential product available. Additionally, searches for “baby formula shortage” increased by 1,823% from March to April. Conclusion The U.S. government is working with international partners to import baby formula, while retailers are also rationing how many units consumers can purchase per visit. Both of these should help to alleviate some of the product availability issues. However, until Abbott’s facility returns to its normalized production rate and given the ongoing pressures in the supply chain, it’s likely that the baby formula shortage will persist into 2H22. The Similarweb Insights Newsroom is available to pull additional or updated data on request for the news media (journalists are invited to write to press@similarweb.com). When citing our data, please reference Similarweb as the source and link back to the most relevant blog post or similarweb.com/blog/insights/. Methodology Disclaimer: All data, reports and other materials provided or made available by Similarweb are based on data obtained from third parties, including estimations and extrapolations based on such data. Similarweb shall not be responsible for the accuracy of the materials and shall have no liability for any decision by any third party based in whole or in part on the materials. by Seema Shah Senior Director of Research and Analytics Seema Shah has 20+ years in consumer research, with experience at Granite Capital and Bloomberg. She holds an MBA from Columbia and a BA from Johns Hopkins. Related Topics: Ecommerce News This post is subject to Similarweb legal notices and disclaimers. Related Posts Insights Lululemon’s Reported Slowdown: What the Data Tells Us Ecommerce News by Daniel Reid 7 Min. Oct 10, 2024 Insights Search Ranking Shows How Merger of Tapestry and Capri Would Change the Luxury Market Ecommerce News by Inès Durand 4 Min. Oct 3, 2024 Insights Trending Brands: New Balance and Alo Yoga’s Breakout Performance in Athleisure Ecommerce News by Daniel Reid 5 Min. Sep 12, 2024 Insights Temu Gains on Amazon in App Ecommerce, Becomes #2 Web Marketplace Ecommerce News by David F. Carr 4 Min. Sep 11, 2024 Insights How the Olympics Is Driving Online Shopping Ecommerce News by Daniel Reid 7 Min. Aug 7, 2024 Insights Australia’s Fashion Market: Small Players, Big Wins Ecommerce News by Mir Jawad 6 Min. Aug 1, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Baby Formula Supply Shock Not a Surprise"
    },
    {
      "level": "H2",
      "text": "Consumer purchasing trends indicate warning signs began in mid-2021"
    },
    {
      "level": "H2",
      "text": "Key takeaways"
    },
    {
      "level": "H2",
      "text": "Demand surge is a double-edged sword for retailers"
    },
    {
      "level": "H2",
      "text": "Amazon"
    },
    {
      "level": "H2",
      "text": "Walmart.com"
    },
    {
      "level": "H2",
      "text": "Target.com"
    },
    {
      "level": "H2",
      "text": "Searches related to shortage skyrocket"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H3",
      "text": "Lululemon’s Reported Slowdown: What the Data Tells Us"
    },
    {
      "level": "H3",
      "text": "Search Ranking Shows How Merger of Tapestry and Capri Would Change the Luxury Market"
    },
    {
      "level": "H3",
      "text": "Trending Brands: New Balance and Alo Yoga’s Breakout Performance in Athleisure"
    },
    {
      "level": "H3",
      "text": "Temu Gains on Amazon in App Ecommerce, Becomes #2 Web Marketplace"
    },
    {
      "level": "H3",
      "text": "How the Olympics Is Driving Online Shopping"
    },
    {
      "level": "H3",
      "text": "Australia’s Fashion Market: Small Players, Big Wins"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Seema Shah"
}