{
  "url": "https://www.similarweb.com/blog/insights/ecommerce-news/black-friday-uk-insights/",
  "slug": "black-friday-uk-insights",
  "title": "UK Black Friday Ecommerce Traffic Drops 11% | Similarweb",
  "description": "Black Friday's hype seems to have waned, leaving a lackluster season for the UK’s top retailers. Enter now to get all the recent ecommerce insights.",
  "content": "HomeBlogInsightsEcommerce NewsBlack Friday: UK Ecommerce Traffic Falls As Consumers Prioritize Travel Spending Insights Black Friday: UK Ecommerce Traffic Falls As Consumers Prioritize Travel Spending Start your free trial by Inès Durand 4 Min. November 27, 2023 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Black Friday traffic to ecommerce sites dropped 11% year-on-year (YoY) The echoes of Black Friday’s usual fanfare have faded, leaving behind a rather underwhelming shopping season for UK retailers. While the event has traditionally been a boom for retailers, this year’s Black Friday failed to ignite the same level of excitement among UK shoppers. One of the primary reasons for this subdued response is the lingering impact of inflation. Despite a slight decline to 4.6%, UK inflation remains higher than in many European countries. This continued economic uncertainty has made shoppers more cautious about their spending habits. Adding to the dampened spirits was the timing of Black Friday, falling just a week before payday. With wallets still feeling the pinch, consumers were less inclined to splurge on impulse purchases. Similarweb, analyzing traffic to the top 1,041 ecommerce sites in the UK, revealed a shift in consumer preferences. While traffic to traditional gifting categories like Toys and Games and Consumer Electronics experienced significant declines of 22% and 30% YoY, respectively, there was a notable increase in traffic to the Travel and Health and Supplements industries, up by 7% and 2% YoY. These trends suggest that UK shoppers are prioritizing their well-being and long-term investments. The focus on travel indicates a yearning for escapism and a return to pre-pandemic normalcy, while the surge in traffic to Health & Supplements signifies a growing interest in preventive healthcare and self-care practices. Top UK Ecommerce Sectors In Black Friday Traffic and YoY Traffic Change UK, Desktop & Mobile Web, November 24th 2023 vs. November 25th 2022 Temu became the 14th most visited retailer on Black Friday, despite already offering low prices In a time when the UK’s cost of living continues to soar, casting a shadow over the finances of countless households, Temu has emerged as a beacon of hope, offering a lifeline to savvy shoppers seeking respite from the relentless burden. With its enticing discounts of up to 96% on essential items, Temu has swiftly captured the hearts and minds of consumers, proving to be an irresistible force on the retail landscape, even during the competitive Black Friday period. Temu’s philosophy of empowering customers to “shop like a billionaire” has struck a chord with cash-strapped individuals, offering them a sense of abundance and empowerment amidst the prevailing economic challenges. This unique approach has propelled Temu to the forefront of the UK’s retail scene, surpassing even established giants like Very in terms of website visits. Temu’s success is a testament to its ability to address the pressing needs of UK consumers, providing them with a viable alternative to the ever-rising prices that threaten to erode their purchasing power. In fact, according to Similarweb’s Market Research Panel of 1,824 Survey respondents, 45% of consumers planning to buy groceries during Black Friday were doing so to stock up. Top UK Ecommerce Sites In Black Friday Traffic UK, Desktop & Mobile Web, November 24th 2023 vs. November 25th 2022 UK Fashion winners are a combination of higher-end and low-priced items, reflecting consumers’ economic uncertainty Fastest-Growing Fashion Sites In Black Friday Traffic YoY (50K Visits On Black Friday) UK, Desktop & Mobile Web, November 24th 2023 vs. November 25th 2022 With a nearly flat GDP growth rate predicted for 2023, and household incomes dropping by 6% in 2023 and 2024, the UK is on the brink of a recession. This macroeconomic backdrop is represented well in Black Friday shopping behaviors in the Fashion and Apparel industry. Fastest-growing sites in the space sit on both sides of the price spectrum, from designer clothing sites Percivalclo, Coggles and Calvin Klein to mass-market retailers Crew-clothing, Everything5pounds, and Ego. Sephora.co.uk is stealing market share from other beauty retailers, coming at the 7th position in traffic within the industry Top UK Beauty Retailers In Black Friday Traffic and YoY Traffic Change UK, Desktop & Mobile Web, November 24th 2023 vs. November 25th 2022 Stay tuned for additional updates as we continue to dig through this year’s Black Friday shopping trends. The Similarweb Insights & Communications team is available to pull additional or updated data on request for the news media (journalists are invited to write to press@similarweb.com). When citing our data, please reference Similarweb as the source and link back to the most relevant blog post or similarweb.com/blog/insights/. Methodology Disclaimer: All names, brands, trademarks, and registered trademarks are the property of their respective owners. The data, reports, and other materials provided or made available by Similarweb consist of or include estimated metrics and digital insights generated by Similarweb using its proprietary algorithms, based on information collected by Similarweb from multiple sources using its advanced data methodologies. Similarweb shall not be responsible for the accuracy of such data, reports, and materials and shall have no liability for any decision by any third party based in whole or in part on such data, reports, and materials. by Inès Durand Inès provides market research insights in Retail, CPG, and Financial Services. Her work has appeared in Retail Today, CNBC, and AFP. Related Topics: Ecommerce News This post is subject to Similarweb legal notices and disclaimers. Related Posts Insights Lululemon’s Reported Slowdown: What the Data Tells Us Ecommerce News by Daniel Reid 7 Min. Oct 10, 2024 Insights Search Ranking Shows How Merger of Tapestry and Capri Would Change the Luxury Market Ecommerce News by Inès Durand 4 Min. Oct 3, 2024 Insights Trending Brands: New Balance and Alo Yoga’s Breakout Performance in Athleisure Ecommerce News by Daniel Reid 5 Min. Sep 12, 2024 Insights Temu Gains on Amazon in App Ecommerce, Becomes #2 Web Marketplace Ecommerce News by David F. Carr 4 Min. Sep 11, 2024 Insights How the Olympics Is Driving Online Shopping Ecommerce News by Daniel Reid 7 Min. Aug 7, 2024 Insights Australia’s Fashion Market: Small Players, Big Wins Ecommerce News by Mir Jawad 6 Min. Aug 1, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Black Friday: UK Ecommerce Traffic Falls As Consumers Prioritize Travel Spending"
    },
    {
      "level": "H2",
      "text": "Black Friday traffic to ecommerce sites dropped 11% year-on-year (YoY)"
    },
    {
      "level": "H2",
      "text": "Temu became the 14th most visited retailer on Black Friday, despite already offering low prices"
    },
    {
      "level": "H2",
      "text": "UK Fashion winners are a combination of higher-end and low-priced items, reflecting consumers’ economic uncertainty"
    },
    {
      "level": "H2",
      "text": "Sephora.co.uk is stealing market share from other beauty retailers, coming at the 7th position in traffic within the industry"
    },
    {
      "level": "H3",
      "text": "Lululemon’s Reported Slowdown: What the Data Tells Us"
    },
    {
      "level": "H3",
      "text": "Search Ranking Shows How Merger of Tapestry and Capri Would Change the Luxury Market"
    },
    {
      "level": "H3",
      "text": "Trending Brands: New Balance and Alo Yoga’s Breakout Performance in Athleisure"
    },
    {
      "level": "H3",
      "text": "Temu Gains on Amazon in App Ecommerce, Becomes #2 Web Marketplace"
    },
    {
      "level": "H3",
      "text": "How the Olympics Is Driving Online Shopping"
    },
    {
      "level": "H3",
      "text": "Australia’s Fashion Market: Small Players, Big Wins"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Inès Durand"
}