{
  "url": "https://www.similarweb.com/blog/insights/ecommerce-news/digital-100-fashion-apparel/",
  "slug": "digital-100-fashion-apparel",
  "title": "Digital 100 Apparel & Accessories Winner: Intimissimi | Similarweb",
  "description": "Intimissimi, a lingerie and intimates brand backed by celebrities topped, the Similarweb Digital 100 with 285.9% traffic growth in 2022.",
  "content": "HomeBlogInsightsEcommerce NewsDigital 100 Apparel & Accessories Winner: Intimissimi Insights Digital 100 Apparel & Accessories Winner: Intimissimi Start your free trial by Sneha Pandey , Insights Manager 4 Min. January 25, 2023 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Italian intimates fashion brand endorsed by celebrities tops the list, followed by Hong Kong-based fast-fashion brand In the Similarweb Digital 100 category for fashion, apparel, and accessories the top spot went to Intimissimi, a globally acclaimed lingerie and intimates brand that not only has Jennifer Lopez as its global brand ambassador, but is also backed by models and celebrities like – Sarah Jessica Parker, Heidi Klum, Irina Shayk, and Gisele Bundchen. While the brand has had a large European presence since the 90s, its US expansion has been fairly recent. Its biggest surge in US visits took place last November 2022 after its campaign with model Heidi Klum and emerging model daughter Leni Klum. Total traffic to intimissimi.com increased 285.9% between 2021 and 2022, according to Similarweb estimates. Fashion & Apparel is one of 10 key categories that make up the annual Similarweb Digital 100 ranking of the fastest-growing companies on the web. The ranking is based on desktop and mobile web traffic from the United States (see also the reports for the U.K., Germany, France, and Japan, with one for Australia to follow. Key takeaways The Similarweb Digital 100 fashion and apparel winners represent some of the most important and emerging themes in this industry: Fast-moving trends and price-conscious consumers in 2022 expedited the growth of ultra-fast fashion’s popularity over the last year. Social media’s micro-trend culture has fueled the rise of ultra-fast fashion companies, with faster apparel turnover and products sold at a fraction of the original price. Rising Shein competitors Emmiol and Cider came in second and fourth place respectively. These brands’ extremely cheap pricing may have also contributed to their popularity at a time when inflationary pressures impacted their target demographics this past year. DTC channels and DTC retailers have grown in importance. Brands like Youngla, which first gained popularity on Amazon, rode the pandemic wave of fitness wear and athleisure, grew exponentially, and prioritized affordability to become one of the fastest-growing brands in the industry. Celebrity brands and celebrity endorsements made a huge impact on brands this year. While the abundantly endorsed brand Intimissimi bagged first place, Kim Kardashian’s shapewear and loungewear brand SKIMS also made its mark in our rankings. The brand has been endorsed by celebrities and influencers alike – widely acclaimed for its size and color inclusivity. Back to work and travel trends also dominated 2022 with luggage and bag companies like carbon-neutral brand Monos, Portland Leather Goods, and Calpak bagging spots in the top 10. The Fastest-Growing Digital Apparel & Accessories Companies Get your copy. The Digital 100 Apparel & Accessories Top 10 Domain YoY Growth Description 1 intimissimi.com 285.9% Lingerie and intimates brand 2 emmiol.com 241.9% Fast fashion youth retailer 3 youngla.com 204.8% Direct-to-consumer fitness and loungewear 4 shopcider.com 182.8% Fast fashion retailer 5 monos.com 181.9% Premium, sustainable bags and luggage 6 onequince.com 163.1% Affordable/sustainable direct-to-consumer brand 7 skims.com 157.2% Kim Kardashian’s direct-to-consumer shapewear brand 8 portlandleathergoods.com 151.9% Full-grain affordable leather products 9 calpaktravel.com 134.4% Travel bags and accessories 10 oofos.com 132.9% Fitness and recovery footwear Direct Traffic & Organic Search Lead Acquisition Channels Although the winning brands invest in paid search, accounting for nearly 18% of the traffic they attract as a group, they still get more traffic (26.5%) from organic search. In other words, consumers are searching for what they have to offer. They also get a significant share of traffic (6.3%) from social media. Women Dominate Traffic Trends The winners draw more than three-quarters of their audience from women, particularly young women – and capturing the youth market is often a winning strategy. More from the Digital 100 For more details, download our A Day in the Life of the Cost-Conscious Consumer trends report, or visit the Similarweb Insights blog for posts on individual categories. In addition, Similarweb is releasing studies for the U.K., Germany, France, Japan, and Australia. The Similarweb Insights & Communications team is available to pull additional or updated data on request for the news media (journalists are invited to write to press@similarweb.com). When citing our data, please reference Similarweb as the source and link back to the most relevant blog post or similarweb.com/blog/insights/. Contact: For more information, please write to press@similarweb.com. Citation: Please refer to Similarweb as a digital intelligence platform. If online, please link back to www.similarweb.com or the most relevant blog post. Report By: Sneha Pandey, Insights Manager Methodology Disclaimer: All data, reports and other materials provided or made available by Similarweb are based on data obtained from third parties, including estimations and extrapolations based on such data. Similarweb shall not be responsible for the accuracy of the materials and shall have no liability for any decision by any third party based in whole or in part on the materials. by Sneha Pandey Insights Manager Sneha, a Purdue graduate, delivers data-driven insights on Retail, eCommerce, Politics, CPG, and B2B Software, helping Fortune 50 companies succeed. Related Topics: Ecommerce News This post is subject to Similarweb legal notices and disclaimers. Related Posts Insights Lululemon’s Reported Slowdown: What the Data Tells Us Ecommerce News by Daniel Reid 7 Min. Oct 10, 2024 Insights Search Ranking Shows How Merger of Tapestry and Capri Would Change the Luxury Market Ecommerce News by Inès Durand 4 Min. Oct 3, 2024 Insights Trending Brands: New Balance and Alo Yoga’s Breakout Performance in Athleisure Ecommerce News by Daniel Reid 5 Min. Sep 12, 2024 Insights Temu Gains on Amazon in App Ecommerce, Becomes #2 Web Marketplace Ecommerce News by David F. Carr 4 Min. Sep 11, 2024 Insights How the Olympics Is Driving Online Shopping Ecommerce News by Daniel Reid 7 Min. Aug 7, 2024 Insights Australia’s Fashion Market: Small Players, Big Wins Ecommerce News by Mir Jawad 6 Min. Aug 1, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Digital 100 Apparel & Accessories Winner: Intimissimi"
    },
    {
      "level": "H2",
      "text": "Italian intimates fashion brand endorsed by celebrities tops the list, followed by Hong Kong-based fast-fashion brand"
    },
    {
      "level": "H2",
      "text": "Key takeaways"
    },
    {
      "level": "H2",
      "text": "The Fastest-Growing Digital Apparel & Accessories Companies"
    },
    {
      "level": "H2",
      "text": "The Digital 100 Apparel & Accessories Top 10"
    },
    {
      "level": "H2",
      "text": "Direct Traffic & Organic Search Lead Acquisition Channels"
    },
    {
      "level": "H2",
      "text": "Women Dominate Traffic Trends"
    },
    {
      "level": "H2",
      "text": "More from the Digital 100"
    },
    {
      "level": "H3",
      "text": "Lululemon’s Reported Slowdown: What the Data Tells Us"
    },
    {
      "level": "H3",
      "text": "Search Ranking Shows How Merger of Tapestry and Capri Would Change the Luxury Market"
    },
    {
      "level": "H3",
      "text": "Trending Brands: New Balance and Alo Yoga’s Breakout Performance in Athleisure"
    },
    {
      "level": "H3",
      "text": "Temu Gains on Amazon in App Ecommerce, Becomes #2 Web Marketplace"
    },
    {
      "level": "H3",
      "text": "How the Olympics Is Driving Online Shopping"
    },
    {
      "level": "H3",
      "text": "Australia’s Fashion Market: Small Players, Big Wins"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Sneha Pandey"
}