{
  "url": "https://www.similarweb.com/blog/insights/ecommerce-news/fastest-growing-dtc/",
  "slug": "fastest-growing-dtc",
  "title": "Health Products Top List of Fastest-Growing US Direct to Consumer Ecommerce Sites | Similarweb",
  "description": "Hismileteeth.com grew traffic 455% over the past year, while mushroom coffee seller ryzesuperfoods.com was up 408.6%",
  "content": "HomeBlogInsightsEcommerce NewsHealth Products Top List of Fastest-Growing US Direct to Consumer Ecommerce Sites Insights Health Products Top List of Fastest-Growing US Direct to Consumer Ecommerce Sites Start your free trial by David F. Carr 5 Min. May 21, 2024 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Hismileteeth.com grew traffic 455% over the past year, while mushroom coffee seller ryzesuperfoods.com was up 408.6% Similarweb identified the fastest growing direct-to-consumer (DTC) ecommerce sites in the US and found that health product websites dominated the list. Eight of the top 15 focus on getting consumers to eat foods and supplements associated with claims of better health, or to drink more water. In DTC ecommerce, the manufacturer or brand sells its products directly to consumers rather than through an online retailer or marketplace (although they might sell through those channels as well). This report is based on an analysis of 10,000 web domains classified as DTC ecommerce, ranking them by the change in their traffic over the last 12 months versus the prior year. To narrow the field to significant digital businesses that have achieved real growth, we excluded domains that failed to consistently attract more than 50,000 monthly visits We also edited out a few domains that were misclassified. Key takeaways Dental care business Hismile (hismileteeth.com) grew 445.2% and ended April with 722.7K visits, according to Similarweb traffic estimates for the US. Mushroom coffee was a big winner, with traffic to ryzesuperfoods.com up 408.6% to 2.5M visits in April. Competitor everydaydose.com saw traffic rise 177.8% to 968.7K visits. Sex toys maker mysteryvibe.com grew traffic 284.5% to 616.3K visits. Water bottles also saw big gains, with owalalife.com up 275.7% to 940.6K visits and stanley1913.com up 162.6% to 2.9M visits. This list would not be complete without a nod to the economic power of Taylor Swift, whose store.taylorswift.com was up 175.6% to 3.6M visits. “The health and wellness category has been one of the fastest growing categories in the CPG space, mostly driven by increased consumer health consciousness,” said Maria Pashi, Principal Solutions Architect at Similarweb. “These disruptor brands in this category tend to heavily invest in influencer marketing and paid search to build discoverability and brand awareness, but it is the switch towards direct and organic traffic which signals returning customers and success in brand building. This is what ultimately will determine if a brand will be successful in the long-term.” Ranking the top 15 Here are the top 15 websites that met our criteria: 12-Mo Growth Visits in April Description 1 hismileteeth.com 445.2% 722.7K Teeth whitening and dental care products 2 ryzesuperfoods.com 408.6% 2.5M Mushroom coffee and superfoods 3 mysteryvibe.com 284.5% 616.3K Sex toys 4 owalalife.com 275.7% 940.6K Water bottles 5 paleovalley.com 181.0% 607.3K Health foods and supplements 6 everydaydose.com 177.8% 968.7K Mushroom coffee and superfoods 7 store.taylorswift.com 175.6% 3.6M Buy direct from Taylor Swift 8 us.zyn.com 173.3% 2.6M Nicotine pouches 9 thewoobles.com 170.2% 1.4M Learn to crochet kits 10 rpstrength.com 169.4% 273.7K Diet / bodybuilding products and services 11 stanley1913.com 162.6% 2.9M Water bottles 12 truekind.com 157.0% 282.1K Women’s bras and underwear 13 cymbiotika.com 151.9% 369.0K Dietary supplements 14 bugmd.com 150.5% 664.6K Pest repellent / pest traps 15 stix.golf 145.1% 289.7K “Simple, quality, and affordable golf clubs” Click on any links for more information about the domains mentioned, based on Similarweb data. Below are a few highlights focused on where these sites get their traffic. One thing to watch, according to our analysts: startup websites tend to rely heavily on paid search to build their brands, whereas direct traffic and strong organic search indicate staying power. Channels overview for hismileteeth.com (April 2024, US) Hismile has built its traffic with a strong paid search ads program, which brought in more traffic than any other single channel in April – although hismileteeth.com also ranks high for direct traffic and social media referrals. The company boasts of building its audience partly through connections with beauty bloggers and influencers. Channels overview for ryzesuperfoods.com (April 2024, US) Paid search is also a primary source of traffic to the Ryze website, accounting for 30.7% of traffic from within the US in April, although organic search is also a strong traffic driver. For everydaydose.com, a smaller competitor in the mushroom coffee category, paid search brought in 33.9% of traffic in April. Channels overview for mysteryvibe.com (April 2024, US) Sex toy maker MysteryVibe got less than 1% of its April traffic from paid search but 28.6% from organic search and 34.3% from people coming directly to the website. Channels overview for store.taylorswift.com (April 2024, US) The Taylor Swift store enjoys high levels of direct traffic (35%), as well as healthy traffic driven by referrals, social media, and organic search, with just 2% from paid search. Comparison by Bounce Rate Getting consumers to your website is a good start, but ecommerce companies also want to hold their attention long enough for them to take action. One metric where water bottle maker Owala scores well (and competitor Stanley is not far behind) is having a low bounce rate – the rate visitors land on a website but “bounce” or exit without exploring beyond a single page. The Similarweb Insights & Communications team is available to pull additional or updated data on request for the news media (journalists are invited to write to press@similarweb.com). When citing our data, please reference Similarweb as the source and link back to the most relevant blog post or similarweb.com. Methodology Disclaimer: All names, brands, trademarks, and registered trademarks are the property of their respective owners. The data, reports, and other materials provided or made available by Similarweb consist of or include estimated metrics and digital insights generated by Similarweb using its proprietary algorithms, based on information collected by Similarweb from multiple sources using its advanced data methodologies. Similarweb shall not be responsible for the accuracy of such data, reports, and materials and shall have no liability for any decision by any third party based in whole or in part on such data, reports, and materials. by David F. Carr David covers social media, digital advertising, and generative AI. With a background in web trends since the 1990s, he’s also the author of \"Social Collaboration for Dummies\". Related Topics: Ecommerce News This post is subject to Similarweb legal notices and disclaimers. Related Posts Insights Lululemon’s Reported Slowdown: What the Data Tells Us Ecommerce News by Daniel Reid 7 Min. Oct 10, 2024 Insights Search Ranking Shows How Merger of Tapestry and Capri Would Change the Luxury Market Ecommerce News by Inès Durand 4 Min. Oct 3, 2024 Insights Trending Brands: New Balance and Alo Yoga’s Breakout Performance in Athleisure Ecommerce News by Daniel Reid 5 Min. Sep 12, 2024 Insights Temu Gains on Amazon in App Ecommerce, Becomes #2 Web Marketplace Ecommerce News by David F. Carr 4 Min. Sep 11, 2024 Insights How the Olympics Is Driving Online Shopping Ecommerce News by Daniel Reid 7 Min. Aug 7, 2024 Insights Australia’s Fashion Market: Small Players, Big Wins Ecommerce News by Mir Jawad 6 Min. Aug 1, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Health Products Top List of Fastest-Growing US Direct to Consumer Ecommerce Sites"
    },
    {
      "level": "H2",
      "text": "Hismileteeth.com grew traffic 455% over the past year, while mushroom coffee seller ryzesuperfoods.com was up 408.6%"
    },
    {
      "level": "H2",
      "text": "Key takeaways"
    },
    {
      "level": "H2",
      "text": "Ranking the top 15"
    },
    {
      "level": "H2",
      "text": "Channels overview for hismileteeth.com (April 2024, US)"
    },
    {
      "level": "H2",
      "text": "Channels overview for ryzesuperfoods.com (April 2024, US)"
    },
    {
      "level": "H2",
      "text": "Channels overview for mysteryvibe.com (April 2024, US)"
    },
    {
      "level": "H2",
      "text": "Channels overview for store.taylorswift.com (April 2024, US)"
    },
    {
      "level": "H2",
      "text": "Comparison by Bounce Rate"
    },
    {
      "level": "H3",
      "text": "Lululemon’s Reported Slowdown: What the Data Tells Us"
    },
    {
      "level": "H3",
      "text": "Search Ranking Shows How Merger of Tapestry and Capri Would Change the Luxury Market"
    },
    {
      "level": "H3",
      "text": "Trending Brands: New Balance and Alo Yoga’s Breakout Performance in Athleisure"
    },
    {
      "level": "H3",
      "text": "Temu Gains on Amazon in App Ecommerce, Becomes #2 Web Marketplace"
    },
    {
      "level": "H3",
      "text": "How the Olympics Is Driving Online Shopping"
    },
    {
      "level": "H3",
      "text": "Australia’s Fashion Market: Small Players, Big Wins"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by David F. Carr"
}