{
  "url": "https://www.similarweb.com/blog/insights/ecommerce-news/hey-dude/",
  "slug": "hey-dude",
  "title": "Hey Dude Shoes Wins the 'Challenger Award' | Similarweb",
  "description": "Hey Dude Shoes won the Challenger Award for search tactics that captured share from bigger competitors - part of the Similarweb Digital Marketing Awards",
  "content": "HomeBlogInsightsEcommerce NewsHey Dude Shoes Wins the 'Challenger Award' for Using Search to Capture Market Share Insights Hey Dude Shoes Wins the ‘Challenger Award’ for Using Search to Capture Market Share Full Analysis by David F. Carr 3 Min. February 21, 2023 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Hey Dude is one of five Similarweb Digital Marketing Awards winners for 2023 Hey Dude Shoes won the Challenger Award for using clever search tactics to capture share from bigger competitors — part of the Similarweb Digital Marketing Awards announced today. This awards program recognizes success at using search marketing and other digital marketing techniques to drive website traffic, as judged by both Similarweb metrics and the reviews by our panel of digital marketing experts. Even though Hey Dude Shoes competes in a crowded category against some of the most recognized shoe brands in the world, they used a clever digital strategy to ensure customers looking for them on Google and Amazon found them – not the competition. Key takeaways In 2022, Hey Dude achieved a 45% year-over-year (YoY) growth in total visits, far and away the best of their main competitive set: toms.com, sperry.com, nike.com, and allbirds.com. Display traffic rose 126% YoY Referral traffic rose 127% YoY Hey Dude demonstrated particular success in driving up branded search traffic – getting customers to search for them by name. Experts at getting found As a newer brand with a limited marketing budget (compared to established players), Hey Dude needed a fresh strategy in order to compete effectively. Instead of going for increased brand awareness like established brands, who use their massive budget on both digital and traditional media, they needed to be the best at leveraging both Google and Amazon. THE WINNER: Why Hey Dude shoes? Read the full analysis Read the full analysis behind the award and learn about the other honorees: The Spotlight Award to Panasonic for leveraging search stickiness to drive brand recognition. The Titan Award to Shein, which built on its strong global brand to enter new markets such as Brazil. The Referral Award to Pizza Hut Japan for using referrals from other websites to capture market share. The Streamline Award to Lululemon for demonstrating excellence in pay-per-click mobile search as one of the tactics allowing it to defend its market share in a tough economy for retail. The Similarweb Insights & Communications team is available to pull additional or updated data on request for the news media (journalists are invited to write to press@similarweb.com). When citing our data, please reference Similarweb as the source and link back to the most relevant blog post or similarweb.com/blog/insights/. Contact: For more information, please write to press@similarweb.com. Citation: Please refer to Similarweb as a digital intelligence platform. If online, please link back to www.similarweb.com or the most relevant blog post. Report By: David F. Carr, Senior Insights Manager Methodology Disclaimer: All names, brands, trademarks and registered trademarks are the property of their respective owners. All data, reports, and other materials provided or made available by Similarweb are created by Similarweb using data obtained from third-party and proprietary sources, including estimations and extrapolations based on such data. Similarweb shall not be responsible for the accuracy of the materials and shall have no liability for any decision by any third party based in whole or in part on the materials. by David F. Carr David covers social media, digital advertising, and generative AI. With a background in web trends since the 1990s, he’s also the author of \"Social Collaboration for Dummies\". Related Topics: Ecommerce News This post is subject to Similarweb legal notices and disclaimers. Related Posts Insights Lululemon’s Reported Slowdown: What the Data Tells Us Ecommerce News by Daniel Reid 7 Min. Oct 10, 2024 Insights Search Ranking Shows How Merger of Tapestry and Capri Would Change the Luxury Market Ecommerce News by Inès Durand 4 Min. Oct 3, 2024 Insights Trending Brands: New Balance and Alo Yoga’s Breakout Performance in Athleisure Ecommerce News by Daniel Reid 5 Min. Sep 12, 2024 Insights Temu Gains on Amazon in App Ecommerce, Becomes #2 Web Marketplace Ecommerce News by David F. Carr 4 Min. Sep 11, 2024 Insights How the Olympics Is Driving Online Shopping Ecommerce News by Daniel Reid 7 Min. Aug 7, 2024 Insights Australia’s Fashion Market: Small Players, Big Wins Ecommerce News by Mir Jawad 6 Min. Aug 1, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Hey Dude Shoes Wins the ‘Challenger Award’ for Using Search to Capture Market Share"
    },
    {
      "level": "H2",
      "text": "Hey Dude is one of five Similarweb Digital Marketing Awards winners for 2023"
    },
    {
      "level": "H2",
      "text": "Key takeaways"
    },
    {
      "level": "H2",
      "text": "Experts at getting found"
    },
    {
      "level": "H3",
      "text": "THE WINNER:"
    },
    {
      "level": "H2",
      "text": "Read the full analysis"
    },
    {
      "level": "H3",
      "text": "Lululemon’s Reported Slowdown: What the Data Tells Us"
    },
    {
      "level": "H3",
      "text": "Search Ranking Shows How Merger of Tapestry and Capri Would Change the Luxury Market"
    },
    {
      "level": "H3",
      "text": "Trending Brands: New Balance and Alo Yoga’s Breakout Performance in Athleisure"
    },
    {
      "level": "H3",
      "text": "Temu Gains on Amazon in App Ecommerce, Becomes #2 Web Marketplace"
    },
    {
      "level": "H3",
      "text": "How the Olympics Is Driving Online Shopping"
    },
    {
      "level": "H3",
      "text": "Australia’s Fashion Market: Small Players, Big Wins"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by David F. Carr"
}