{
  "url": "https://www.similarweb.com/blog/insights/ecommerce-news/how-the-olympics-is-driving-online-shopping/",
  "slug": "how-the-olympics-is-driving-online-shopping",
  "title": "How the Olympics Is Driving Online Shopping | Similarweb",
  "description": "The Olympics is driving search clicks for and conversions for athletic shoe and apparel brands including Nike and GK Elite.",
  "content": "HomeBlogInsightsEcommerce NewsHow the Olympics Is Driving Online Shopping Insights How the Olympics Is Driving Online Shopping by Daniel Reid 7 Min. August 7, 2024 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic The Olympics is a major series of spectator sporting events, but it also drives consumers to action – including seeking out and buying products. To understand the extent of Olympics ecommerce activity, Similarweb prepared a custom day-by-day, week-by-week analysis of ecommerce conversions for athletic shoe brands. We also pulled together data from standard reports on search trends and website traffic drivers. In addition to shoe brands, we looked at a couple of apparel brands that were notable for their Olympics sponsorships: leotard maker GK Elite because of its sponsorship of Simone Biles and brand Athleta because of its sponsorships of Biles and champion swimmer Katie Ledecky. Key takeaways Nike stands out for the volume of Olympics-related search traffic it captures, both organic and paid. Both Nike and Hoka saw a measurable uptick in conversions – website visits resulting in a sale – the week coinciding with the start of the Olympics. Total web traffic to GK Elite grew more than 75% in a week as Olympics events began, and was one of the biggest winners for searches on “olympics” or “olympic.” Winning search clicks: Nike, followed by everybody else Searches related to the Olympics intensified as the games peaked around the time of the opening ceremonies on July 26 and remained elevated over the following weeks. Much of that traffic flowed to news and media websites, but brands captured an important fraction of it. Search traffic related to the Olympics. To rank selected footwear and apparel brands by the effectiveness of their search marketing, we reviewed paid and organic search clicks to the company domains from within a 28-day period that extended into the first weeks of the games. Nike was a dominant player across the board, but leotard maker GK Elite got perhaps the most significant lift, at least partly due to its sponsorship of gymnast Simone Biles. GK Elite’s total traffic rose more than 75% in a week. Search traffic to gkelite.com To create the summary charts below, we totaled stats for all the keywords that generated 50 or more clicks for each website. This is a topline view, filtered for searches that specifically mentioned “olympics” or “olympic” as an adjective. Here’s a sampling of the paid keywords that brought traffic to these sites: Keywords Clicks nike.com nike olympics drifit athletic fit 1,960 nike.com nike olympics 850 nike.com nike olympics 760 nike.com nike olympics 570 athleta.gap.com olympic socks 500 nike.com red shoes nike use volleyball player olympic games 2024 280 adidas.com olympics hat 260 gkelite.com girls’ usa olympic gymnastics leotards 240 on.com cloudmonster olympic 240 nike.com usa olympics clothing 230 nike.com nike olympics drifit 230 nike.com nike olympics backpack 190 nike.com nike track and field olympic trials uniform 180 asics.com asics olympic shoes 180 on.com on running sponsor olympic team switzerland 170 gkelite.com olympics women’s gymnastics team merch 150 gkelite.com olympic leotards 150 Of course, all of these sites were also competing for organic traffic, and here the gap between Nike and everyone else is not quite as large. Here is a sampling of the keywords driving the most traffic. Keywords Clicks asics.com australia 2024 olympics 4,500 gkelite.com olympic gymnastics leotards 3200 asics.com asics australia olympics 1,900 nike.com nike sb olympics 1,650 nike.com nike french olympic basketball jersey 1,220 nike.com nike sb japan olympic 970 asics.com asics japan olympic kit 780 adidas.com adidas 1972 olympic shoe 680 nike.com nike sb snkrs olympic kits 660 puma.com jamaica olympics aparrel 530 nike.com red shoes nike use volleyball player olympic games 2024 450 adidas.com sierra leone olympics kit launch kit date 420 nike.com olympic nike face mask 400 puma.com trinidad olympic kit 380 on.com team switzerland olympics 2024 370 nike.com curry olympic jersey 320 asics.com australia basketball jersey olympics 270 hoka.com hoka olympics athletes 220 adidas.com paris olympics official soccer ball 210 asics.com team phillipines olympic gear 190 asics.com olympics white sneakers au 170 nike.com usa olympic basketball jersey 150 nike.com nike air max dn se: olympics 150 nike.com nike sb japan olympic jersey 150 Other related keywords Searches for “olympic” or “olympics” as keywords is admittedly a simplistic approach. It gives us some idea of how much search marketing success these brands are achieving related to the Olympics games, but it doesn’t tell the whole story. There were also plenty of searches on the names of specific olympic athletes or olympic events. For example, GK paid for traffic on keywords that included “women’s gymnastics team,” which is pretty clearly an olympics reference, as was “simone biles leotards.” Nike’s paid search on “nike team usa” alone brought in about 2,500 clicks. Other beneficiaries of search traffic were more random, like Italian cheese maker Parmigiano Reggiano picking up 160 organic search clicks related to Giorgia Villa, who won silver in gymnastics. The traffic came not because of any current marketing campaign but because an ad she had done for the company years ago resurfaced on social media and went viral after her win. Instagram posts about Giorgia Villa. How are the Olympics paying off for sportswear brands? With sportswear brands sponsoring the event, athletes and teams themselves, they can expect the events unfolding at the games to have an impact on their visits and conversions. To have a look at this impact, we analyzed the visits of some selected sportswear brands and indexed the visits of the week before the games vs the first week of the games to look at how visits have grown or shrunk. Using indexed data makes it easier to show relative change in traffic to domains with much different traffic volumes on the same chart. Both Nike and Puma managed to increase visits to their DTC sites in the opening week of the Olympics while Adidas, Hoka and On Running all saw their visits decline vs the week prior – Adidas in particular seeing a substantial decline of 11%, based on US traffic. Despite this decline in visits for Hoka, both they and Nike were the only brands of the 5 to see conversions increase. Nike is very visible at the games so perhaps this is unexpected but Hoka is less so. Possibly, Hoka is benefitting more generally from consumers being inspired to take up activities like running. On the day of the Olympic Ceremony, Hoka doubled their conversions on the prior Friday with Nike jumping around 37%. While there have been declines for both brands, more often than not sales have been higher than the week prior to the Olympics starting. In fact for Nike, sales rocketed on July 31, perhaps boosted by Simone Biles and the Team USA gold medal in the all-around final on July 30. Nike sponsored the Team USA gymnastics team by providing apparel and so the athletes will have been seen in Nike tracksuits and footwear during the event. Despite Hoka seeing greater success as a result of the Olympics so far, it is important not to forget just how big Nike is in comparison. Hoka’s conversions peak over the past 2 weeks is 10K on August 2. By comparison, Nike had almost 87K conversions on the same day. Both brands do take different approaches to their business model, Nike decided a few years back to focus on it’s DTC offering and drive the majority of their sales direct but as such an established brand they have this luxury, Hoka currently do not. This isn’t to say Nike should not be worried about Hoka. Searches of ‘running shoes’ in the US over the last 6 months are up 24% YoY with ‘hoka’ leading the way at 13% of all searches. While Nike might be a larger brand overall, they face some stiff competition in the running space from relative newcomers like Hoka, Vivobarefoot and Altra. Overall, demand for “running shoes” as a topic is on the rise, based on internet search trends. What Olympics Fans Are Searching for on Amazon.com Amazon.com drew traffic from 2,850 organic and 250 paid searches related to “olympics” and “olympic,” which likely drove additional sales for some of the brands mentioned above. Similarweb Shopper data on trends within the amazon.com platform shows that product searches on “olympics” were up 361% the week of the opening ceremony and search clicks were up 342%, for a total of 27K search clicks. Here is a sampling of the merchandise and novelty items drawing attention. Searches on “team usa” drew another 7.1 K clicks from Amazon shoppers. The Similarweb Insights & Communications team is available to pull additional or updated data on request for the news media (journalists are invited to write to press@similarweb.com). When citing our data, please reference Similarweb as the source and link back to the most relevant blog post or similarweb.com/blog/insights/. David Carr, Editor, Insights News & Research, also contributed to this report. Methodology Disclaimer: All names, brands, trademarks, and registered trademarks are the property of their respective owners. The data, reports, and other materials provided or made available by Similarweb consist of or include estimated metrics and digital insights generated by Similarweb using its proprietary algorithms, based on information collected by Similarweb from multiple sources using its advanced data methodologies. Similarweb shall not be responsible for the accuracy of such data, reports, and materials and shall have no liability for any decision by any third party based in whole or in part on such data, reports, and materials. Image by PublicDomainPictures from Pixabay by Daniel Reid Daniel, a London-born maths graduate, transitioned from data analyst to insights guru, leveraging his analytical skills to become a trusted industry voice. Related Topics: Ecommerce News This post is subject to Similarweb legal notices and disclaimers. Related Posts Insights Lululemon’s Reported Slowdown: What the Data Tells Us Ecommerce News by Daniel Reid 7 Min. Oct 10, 2024 Insights Search Ranking Shows How Merger of Tapestry and Capri Would Change the Luxury Market Ecommerce News by Inès Durand 4 Min. Oct 3, 2024 Insights Trending Brands: New Balance and Alo Yoga’s Breakout Performance in Athleisure Ecommerce News by Daniel Reid 5 Min. Sep 12, 2024 Insights Temu Gains on Amazon in App Ecommerce, Becomes #2 Web Marketplace Ecommerce News by David F. Carr 4 Min. Sep 11, 2024 Insights Australia’s Fashion Market: Small Players, Big Wins Ecommerce News by Mir Jawad 6 Min. Aug 1, 2024 Insights Prime Day July 2024: Top Day 1 Best Sellers You Can’t Miss Ecommerce News by Michelle Lang 5 Min. Jul 17, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "How the Olympics Is Driving Online Shopping"
    },
    {
      "level": "H2",
      "text": "Key takeaways"
    },
    {
      "level": "H2",
      "text": "Winning search clicks: Nike, followed by everybody else"
    },
    {
      "level": "H3",
      "text": "Other related keywords"
    },
    {
      "level": "H2",
      "text": "How are the Olympics paying off for sportswear brands?"
    },
    {
      "level": "H2",
      "text": "What Olympics Fans Are Searching for on Amazon.com"
    },
    {
      "level": "H3",
      "text": "Lululemon’s Reported Slowdown: What the Data Tells Us"
    },
    {
      "level": "H3",
      "text": "Search Ranking Shows How Merger of Tapestry and Capri Would Change the Luxury Market"
    },
    {
      "level": "H3",
      "text": "Trending Brands: New Balance and Alo Yoga’s Breakout Performance in Athleisure"
    },
    {
      "level": "H3",
      "text": "Temu Gains on Amazon in App Ecommerce, Becomes #2 Web Marketplace"
    },
    {
      "level": "H3",
      "text": "Australia’s Fashion Market: Small Players, Big Wins"
    },
    {
      "level": "H3",
      "text": "Prime Day July 2024: Top Day 1 Best Sellers You Can’t Miss"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Daniel Reid"
}