{
  "url": "https://www.similarweb.com/blog/insights/ecommerce-news/pizza-hut-japan-marketing-award/",
  "slug": "pizza-hut-japan-marketing-award",
  "title": "Pizza Hut Japan Wins the ‘Referral Award’ | Similarweb",
  "description": "Pizza Hut Japan won the Referral Award for leveraging relationships with other websites to build traffic -- part of the Similarweb Digital Marketing Awards",
  "content": "HomeBlogInsightsEcommerce NewsPizza Hut Japan Wins the 'Referral Award' for Building Relationships and Traffic Insights Pizza Hut Japan Wins the ‘Referral Award’ for Building Relationships and Traffic Full Analysis by David F. Carr 2 Min. February 21, 2023 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Pizza Hut Japan is one of five Similarweb Digital Marketing Awards winners for 2023 Pizza Hut Japan won the Referral Award for leveraging relationships with other websites to build traffic to its own. The recognition is part of the Similarweb Digital Marketing Awards announced today. This awards program recognizes success at using search marketing and other digital marketing techniques to drive traffic, as judged by both Similarweb metrics and the reviews by our panel of digital marketing experts. Key takeaways In December 2022, Pizza Hut Japan saw a 50% month-over-month increase in traffic that was directly attributable to a referral program. The pizzahut.jp domain experienced a 94% year-over-year (YoY) increase in referral traffic from November to December 2022, the period during which a referral program capitalizing on anime and the World Cup was in place. Winning share Pizza Hut is no stranger to digital leadership and creativity, and its Japanese operation leveraged those skills to win share from bigger competitors. Before Pizzahut could compete on the volume of monthly visits, they first needed to grow traffic. That is precisely what they did – increasing month-over-month (MoM) traffic as of December 31, 2022, by over 50%. Pizzahut.jp was the leader in MoM growth for Japan’s restaurant and delivery category. Pizzahut.jp also outpaced the industry’s average MoM growth rate of 10%. Referral tactics Pizza Hut Japan partnered with the popular anime series, Blue Lock, during the 2022 World Cup. This partnership had an incredible impact on referral traffic. Pizzahut.jp experienced a 94% year-over-year (YoY) increase in referral traffic from November to December 2022 (the period in which the promotion took place). Read the full analysis Read the full analysis behind the award and learn about the other honorees: The Spotlight Award to Panasonic for leveraging search stickiness to drive brand recognition. The Titan Award to Shein, which built on its strong global brand to enter new markets such as Brazil. The Challenger Award to Hey Dude Shoes for using the reach of Google and Amazon to capture share from bigger competitors in the shoe segment. The Streamline Award to Lululemon for demonstrating excellence in pay-per-click mobile search as one of the tactics allowing it to defend its market share in a tough economy for retail. The Similarweb Insights & Communications team is available to pull additional or updated data on request for the news media (journalists are invited to write to press@similarweb.com). When citing our data, please reference Similarweb as the source and link back to the most relevant blog post or similarweb.com/blog/insights/. Contact: For more information, please write to press@similarweb.com. Citation: Please refer to Similarweb as a digital intelligence platform. If online, please link back to www.similarweb.com or the most relevant blog post. Report By: David F. Carr, Senior Insights Manager Methodology Disclaimer: All names, brands, trademarks and registered trademarks are the property of their respective owners. All data, reports, and other materials provided or made available by Similarweb are created by Similarweb using data obtained from third-party and proprietary sources, including estimations and extrapolations based on such data. Similarweb shall not be responsible for the accuracy of the materials and shall have no liability for any decision by any third party based in whole or in part on the materials. by David F. Carr David covers social media, digital advertising, and generative AI. With a background in web trends since the 1990s, he’s also the author of \"Social Collaboration for Dummies\". Related Topics: Ecommerce News This post is subject to Similarweb legal notices and disclaimers. Related Posts Insights Lululemon’s Reported Slowdown: What the Data Tells Us Ecommerce News by Daniel Reid 7 Min. Oct 10, 2024 Insights Search Ranking Shows How Merger of Tapestry and Capri Would Change the Luxury Market Ecommerce News by Inès Durand 4 Min. Oct 3, 2024 Insights Trending Brands: New Balance and Alo Yoga’s Breakout Performance in Athleisure Ecommerce News by Daniel Reid 5 Min. Sep 12, 2024 Insights Temu Gains on Amazon in App Ecommerce, Becomes #2 Web Marketplace Ecommerce News by David F. Carr 4 Min. Sep 11, 2024 Insights How the Olympics Is Driving Online Shopping Ecommerce News by Daniel Reid 7 Min. Aug 7, 2024 Insights Australia’s Fashion Market: Small Players, Big Wins Ecommerce News by Mir Jawad 6 Min. Aug 1, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Pizza Hut Japan Wins the ‘Referral Award’ for Building Relationships and Traffic"
    },
    {
      "level": "H2",
      "text": "Pizza Hut Japan is one of five Similarweb Digital Marketing Awards winners for 2023"
    },
    {
      "level": "H2",
      "text": "Key takeaways"
    },
    {
      "level": "H2",
      "text": "Winning share"
    },
    {
      "level": "H2",
      "text": "Referral tactics"
    },
    {
      "level": "H2",
      "text": "Read the full analysis"
    },
    {
      "level": "H3",
      "text": "Lululemon’s Reported Slowdown: What the Data Tells Us"
    },
    {
      "level": "H3",
      "text": "Search Ranking Shows How Merger of Tapestry and Capri Would Change the Luxury Market"
    },
    {
      "level": "H3",
      "text": "Trending Brands: New Balance and Alo Yoga’s Breakout Performance in Athleisure"
    },
    {
      "level": "H3",
      "text": "Temu Gains on Amazon in App Ecommerce, Becomes #2 Web Marketplace"
    },
    {
      "level": "H3",
      "text": "How the Olympics Is Driving Online Shopping"
    },
    {
      "level": "H3",
      "text": "Australia’s Fashion Market: Small Players, Big Wins"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by David F. Carr"
}