{
  "url": "https://www.similarweb.com/blog/insights/ecommerce-news/taylor-swift-effect-2/",
  "slug": "taylor-swift-effect-2",
  "title": "The Taylor Swift Effect: A Celebrity Business Playbook | Similarweb",
  "description": "Since her first set of re-releases in 2021 (Fearless and Red), Taylor Swift’s online store has more than doubled in traffic. Enter to learn more!",
  "content": "HomeBlogInsightsEcommerce NewsThe Taylor Swift Effect: A Celebrity Business Playbook Insights The Taylor Swift Effect: A Celebrity Business Playbook Start your free trial by RJ Jones , Vice President of Investor Relations, Communications, Insights, and Sustainability 8 Min. November 7, 2023 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic As celebrities move to own their success, Taylor Swift shows how it’s done In the music entertainment industry, musicians are finding ways to own their success – none more than Taylor Swift. She has crafted her own playbook, rewriting the rules of engagement in the celebrity business. This report unravels the layers of her strategic moves, examining their economic impact and influence not only within the confines of the music industry but across unexpected territories. Key takeaways Since her first set of re-releases in 2021 (Fearless and Red), Taylor Swift’s online store has more than doubled in traffic. So far this year (January through September), traffic to her store has grown 50.2% compared to 2022, reaching over 21 million visits. US Eras tour ticket traffic peaked on Ticketmaster and resellers in November 2022, marking a 56.3% year-over-year growth in traffic to Ticketmaster that month. Stubhub’s website saw an 80.7% increase in visits year over year, while Seat Geek grew 56.2% YoY, and Vivid Seats grew 35.1% YoY in November 2022. Taylor Swift’s Amazon brand averaged 26,900 monthly units sold in 2022, peaking at 86.6K units sold in November 2022 at the height of ticket sales. From January to September 2023, her Amazon brand averaged nearly 43,000 monthly units sold, peaking in July 2023 at 85.2K units sold as the tour came to a head. Over the last 12 months, Taylor Swift’s Amazon US brand has seen a 30% increase in loyalist unique customers (with 2-4 transactions), making up 19.5% of all unique customers from October 2022 to September 2023. Taylorswift.com’s shared US audience with espn.com increased 35.3% year over year in October 2023, while her website’s shared audience with nfl.com went up 61.4% year over year this October. The best way to start a concert tour: break Ticketmaster When it comes to driving attention and converting ticket sales to a concert tour, Taylor Swift has set a new standard. Ticket pre-sales for the Era’s tour launched with catastrophic effect on Ticketmaster in the U.S. and other locations around the world. While the U.S. pre-sale event in November 2022 was a disaster for Ticketmaster, it drove massive consumer and media interest in the tour. Demand for tickets in the U.S. overwhelmed Ticketmaster’s capabilities online and in its mobile apps, and caused frustration and angst for Swifties everywhere. Instead of Ticketmaster learning and adjusting for future pre-sales, the breakdowns continued globally in 2023. Generating this kind of global media mania around ticket scarcity for a concert tour is priceless for an artist, however, as the power of FOMO news coverage fuels even more demand for the tickets. US Eras tour ticket traffic peaked on Ticketmaster and resellers in November 2022, marking a 56.3% year-over-year growth in traffic to Ticketmaster that month. Stubhub’s website saw an 80.7% increase in visits year over year, while traffic to seatgeek.com grew 56.2% YoY, and traffic to vividseats.com grew 35.1% YoY in November 2022. At its November peak, US Eras Tour ticket pages reached a massive 7.1M Visits on Ticketmaster, making up 6.4% of total US traffic to the site. Simultaneously, Ticketmaster’s help center subdomain reached its highest peak in 3 years, with over 3.5M visits largely attributed to the chaos and outrage around the Eras Tour ticket sales. The big winners in this debacle were the lucky ticket buyers, both the fans and scalpers who used bots to acquire tickets despite the verified fans system. The resale values of Era’s tour tickets right after their release were upwards of 10x face value, equating to thousands of dollars for each ticket. This massive secondary demand in turn benefitted the ticket marketplaces of StubHub, Vivid Seats, and Seat Geek, creating a significant spike in fees for them from ticket sales that won’t likely be repeated soon. In effect, Taylor was a loser in this scenario – the gap in pricing from Ticketmaster to the resellers was substantial. Converting fan loyalty with highly coveted new and exclusive merch In November 2020, Taylor Swift announced that she was beginning to re-record her first six albums after her old label Big Machine Records sold all of her masters to music manager Scooter Braun – in a publicly criticized move. Over the last 3 years, she has re-released albums Fearless (Taylor’s Version), Red (Taylor’s Version), and Speak Now (Taylor’s Version), along with the highly anticipated re-release of 1989 (Taylor’s Version) released last week. Since her first set of re-releases in 2021 (Fearless and Red), Taylor Swift’s online store has more than doubled in traffic. So far this year (January through September), Traffic to store.taylorswift.com has already grown 50.2% compared to 2022, reaching over 21 million visits. Last year, her store saw 14.1 million visits and only grew 5.6% annually. Her store has grown 117% from 9.7 million visits in 2020 to over 21 million visits so far in 2023. With each re-release, Taylor has launched new merchandise. Popular collectible items include 4 versions of each re-released album on vinyl – each version includes different album art and color of the vinyl, as well as one unreleased song that’s only available on the vinyl., plus limited edition sweatshirts and T-shirts. Creating FOMO with these “merch drops” is a signature part of her engagement with fans. When new merchandise is available, her most loyal fans receive a 72-hour availability notice by email with an alert that the items will likely sell out. Whether or not the exhaustion of inventory actually occurs, the perception is enough to drive mania amongst the most devoted Swifties. 2023 concert excitement in the post-pandemic world shook up both Ticketmaster and Taylor Swift’s online store. Loyal fans sold out merchandise to be worn to the concerts (or right outside the concert venues in some cases) and movie screenings. Since her first re-release in 2020, Taylor Swift’s online store traffic surpassed all previous records, making her one of the most popular artists merchandise brands in 2023. Monthly traffic peaked in August 2023 at 4.8 million visits. Meanwhile, Taylor Swift’s Amazon brand averaged 26,900 monthly units sold in 2022, peaking at 86.6K units sold in November 2022, at the height of ticket sales. Thus far in 2023 (Jan – Sep), her Amazon brand has averaged nearly 43,000 monthly units sold, peaking in July 2023 at 85.2K units sold as the tour came to a head. While Taylor has been selling merch like CDs and Vinyl via Amazon US for quite some time, Beyoncé entered this market this July, narrowly surpassing Swift to reach 93.2K units sold with Renaissance tour apparel in addition to CDs & vinyl. Taylor’s Amazon US brand reflects audience loyalty Similarweb Shopper Intelligence identifies audience segments such as “loyalist” and “fanatic” customers. Over the last 12 months, Taylor Swift’s Amazon US brand has seen a 30% increase in loyalist unique customers (with 2-4 transactions), making up 19.5% of all unique customers from October 2022 to September 2023. Loyalists made up 34.5% of all transactions, while fanatics (5+ transactions) captured 6.1% of the share. The increase in loyalist customers has also brought a 23.7% increase in loyalist transactions which made up 34.5% of all transactions. Retailers cash in on Taylor Swift’s brand value In September 2023, Taylor Swift related product traffic on Amazon US increased 276% year over year to about 325K monthly visits, while her Etsy US traffic went up 430% year over year to about 406K. Riding on the coattails of her Eras Tour success, the release of her Eras Tour movie along with the highly anticipated re-release of 1989 Taylor’s Version propelled traffic to retailers as fans looked for merchandise, friendship bracelets, and costumes galore. Taylor Swift’s Halo Effect Data suggests that the potential economic effects or halo beyond Taylor Swift’s direct-to-fans efforts are substantial. Her impact crosses mediums and business types – some ways are expected, and others might be surprising. NFL and ESPN Reach New Audiences Interest in Taylor Swift’s dating life is a global obsession. Her budding relationship with Kansas City Chiefs star Travis Kelce recently brought a new set of eyes to her world – National Football League (NFL) fans. More importantly from the NFL’s perspective, Taylor Swift brought her fans into the NFL’s orbit. The NFL has benefited tremendously in terms of new viewership and crossover online audience from their relationship. The Taylor Swift effect impacted traffic to NFL.com, ESPN.com, and Travis Kelce’s NFL shop player page run by Fanatics. As Mike Florio of NBC Sports’ Pro Football Talk noted in a recent PFT Live podcast, this development is a dream scenario for the NFL, which has been trying to find ways to draw in new audiences to its platform. Visitors to Taylor Swift’s online store who also visited NFL.com increased 93% YoY. Taylorswift.com’s shared US audience with espn.com increased 35.3% year over year in October 2023, while her website’s shared audience with nfl.com went up 61.4% year over year this October. Taylor’s effect on Travis’ play on the field has not gone unnoticed. The “You Belong With TE” impact (and meme, of course) appears to be real. In games where Taylor Swift attends in person, Travis Kelce’s receiving yards per game are about twice the amount in his other games this season (per CBS). In addition to the Kansas City Chiefs benefiting from Taylor’s luxury box appearances, sports betters also are getting in on the action. Traffic to DraftKings KC page has risen 24% YoY in September – are these new bettors placing Swiftie laced prop bets? Maybe. Regardless, do fans want this trend to continue? Absolutely. To keep the lucky/winning streak going, as fans and bettors will perhaps beg of her someday soon, all she has to do is stay (with Kelce). What’s Next: Will Beyonce Run Plays from the Taylor Swift Playbook? We are on the lookout for other mega-pop celebs that can transcend traditional marketing strategies and go full “direct-to-fans” seemingly without limits. Our sense is that Beyonce and Ed Sheeran can likely replicate much of what Taylor Swift does, but after that our list of potentials is small. The Similarweb Insights & Communications team is available to pull additional or updated data on request for the news media (journalists are invited to write to press@similarweb.com). When citing our data, please reference Similarweb as the source and link back to the most relevant blog post or similarweb.com/blog/insights/. Contact: For more information, please write to press@similarweb.com. Report By: RJ Jones, VP – Investor Relations & Communications, Sneha Pandey – Insights Manager Methodology Disclaimer: All names, brands, trademarks, and registered trademarks are the property of their respective owners. The data, reports, and other materials provided or made available by Similarweb consist of or include estimated metrics and digital insights generated by Similarweb using its proprietary algorithms, based on information collected by Similarweb from multiple sources using its advanced data methodologies. Similarweb shall not be responsible for the accuracy of such data, reports, and materials and shall have no liability for any decision by any third party based in whole or in part on such data, reports, and materials. by RJ Jones Vice President of Investor Relations, Communications, Insights, and Sustainability Vice President of Investor Relations, Communications, Insights, and Sustainability Related Topics: Ecommerce News This post is subject to Similarweb legal notices and disclaimers. Related Posts Insights Lululemon’s Reported Slowdown: What the Data Tells Us Ecommerce News by Daniel Reid 7 Min. Oct 10, 2024 Insights Search Ranking Shows How Merger of Tapestry and Capri Would Change the Luxury Market Ecommerce News by Inès Durand 4 Min. Oct 3, 2024 Insights Trending Brands: New Balance and Alo Yoga’s Breakout Performance in Athleisure Ecommerce News by Daniel Reid 5 Min. Sep 12, 2024 Insights Temu Gains on Amazon in App Ecommerce, Becomes #2 Web Marketplace Ecommerce News by David F. Carr 4 Min. Sep 11, 2024 Insights How the Olympics Is Driving Online Shopping Ecommerce News by Daniel Reid 7 Min. Aug 7, 2024 Insights Australia’s Fashion Market: Small Players, Big Wins Ecommerce News by Mir Jawad 6 Min. Aug 1, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "The Taylor Swift Effect: A Celebrity Business Playbook"
    },
    {
      "level": "H2",
      "text": "As celebrities move to own their success, Taylor Swift shows how it’s done"
    },
    {
      "level": "H2",
      "text": "Key takeaways"
    },
    {
      "level": "H2",
      "text": "The best way to start a concert tour: break Ticketmaster"
    },
    {
      "level": "H2",
      "text": "Converting fan loyalty with highly coveted new and exclusive merch"
    },
    {
      "level": "H3",
      "text": "Taylor’s Amazon US brand reflects audience loyalty"
    },
    {
      "level": "H2",
      "text": "Retailers cash in on Taylor Swift’s brand value"
    },
    {
      "level": "H2",
      "text": "Taylor Swift’s Halo Effect"
    },
    {
      "level": "H3",
      "text": "NFL and ESPN Reach New Audiences"
    },
    {
      "level": "H2",
      "text": "What’s Next: Will Beyonce Run Plays from the Taylor Swift Playbook?"
    },
    {
      "level": "H3",
      "text": "Lululemon’s Reported Slowdown: What the Data Tells Us"
    },
    {
      "level": "H3",
      "text": "Search Ranking Shows How Merger of Tapestry and Capri Would Change the Luxury Market"
    },
    {
      "level": "H3",
      "text": "Trending Brands: New Balance and Alo Yoga’s Breakout Performance in Athleisure"
    },
    {
      "level": "H3",
      "text": "Temu Gains on Amazon in App Ecommerce, Becomes #2 Web Marketplace"
    },
    {
      "level": "H3",
      "text": "How the Olympics Is Driving Online Shopping"
    },
    {
      "level": "H3",
      "text": "Australia’s Fashion Market: Small Players, Big Wins"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by RJ Jones"
}