{
  "url": "https://moz.com/blog/category/on-page-seo/p17",
  "slug": "p17",
  "title": "On-page SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "K By: Karen Browning-Cutler August 16, 2007 Keyword Sprawl: You May Surprise Yourself On-page SEO I've read more beginner SEO guides than I can count, never really being able to convince myself that I'm not a beginner anymore. One thing that appears in a lot of these guides and lists of \"SEO Facts\" online is the fact that one shouldn't optimize a page for more than a certain number of terms. This usually ranges between one and three. I agree with this if you have free ... Read this post By: Rand Fishkin August 7, 2007 Combine & Conquer - The Accretive Powers of Joining Pages Together On-page SEO Just a quick tip tonight, since technically I'm supposed to be on vacation. One great way to help improve some of your rankings on a blog, content site or virtually any domain with lots of pages on similar topics is to eliminate the keyword cannibalization by 301'ing multiple pages relevant to a query/keyword to the highest ranking page. Here's a quick example: For the query - SEO Prici... Read this post M By: Megan-15336 August 1, 2007 Web Standards and SEO: More Questions than Answers On-page SEO I recently came across another article about \"validation\" and SEO. These articles always baffle me because most of what is in them doesn't have much to do with validation or SEO. Even some of the responses in ... Read this post By: Rand Fishkin July 10, 2007 Landing Page Optimization - Potentially More Rewarding than SEO On-page SEO As many of our readers here have no doubt seen, SEOmoz was the first participant in Roberta Rosenberg's Laning Page Makeover Clinic. Scott's been hard at work today generating a landing page that helps to meet these criteria and with a bit of luck, we can use Roberta's assistance to ramp up premium me... Read this post B By: Bud-Caddell May 3, 2007 That Settles It...Right? Underscores vs Dashes On-page SEO “Do not speak unless you can improve the silence” I still see many blogs that use underscores in the URL -- ../this_is_my_postBut from an SEO perspective, we've always been told dashes are the way to go, since older programming languages and PHP use the underscore with variables.. and then there's ... Read this post By: Rand Fishkin May 1, 2007 PageRank, Link Patterns & the New Flow of Link Juice On-page SEO I'm back home from a day's trip to San Francisco. Despite the 3:30am wakeup time, it was a good day - 8 hours of talking SEO with some very smart, talented people. One of the many subjects we discussed was passing link equity and I think there are valuable lessons to be learned for everyone in the search marketing (and web development) space. Let's start with a look at the typical patte... Read this post J By: JohnWebber April 26, 2007 Google's speedy index refresh On-page SEO A very interesting thing happened to my website after something as \"simple\" as a server upgrade. On Saturday we upgraded our primary web server to PHP5 and MySQL5. Everything went ok except for a couple phpbb and oscommerce installations.One of these oscommerce installations that went awry was www.footbagshop.com. I spen... Read this post I By: IgorMordkovich March 22, 2007 Increasing the Length of Website Visit ....It's All About The Size On-page SEO I would not consider myself a “blind man” or a senior who needs the text size on the webpage to be set at 24 points. Yet, I see that website owners forget that it’s a pain in the a** to read web copy … especially if it’s in small text size. One of th... Read this post E By: Ella_D February 20, 2007 24 On-site SEO Checkups For Clueless Developers / Marketers On-page SEO Although this will seem, to many of you, a very generic list of SEO on-site tips, you may be surprised to see how many SEO consultants and web developers overlook or forget these basic steps when launching a new site. These twenty- four On-site search engine optimisation checkups/tips can assure that any link building / link baiting efforts that will be made will give great results. Read this post O By: Oatmeal February 20, 2007 Dear Digg.com: I'm Going to Save You a Million Dollars with Three Lines of Code On-page SEO Dearest Digg, I couldn't help but notice your site has a small technical issue. It's no biggie, but I think fixing it could save you some money. I'm all about saving people money, just the other day I handed out coupons for a free trial-sized bag of hydrogenized bean-lard-mulch. I know, I'm practically a saint. I noticed ... Read this post P By: Patrick Altoft February 8, 2007 How to Stop vBulletin from Ruining Your Website On-page SEO In my opinion VBulletin is by far the best forum software but it can create some problems for your website.Most sites work very hard on creating good quality content but once they add a forum the site will attract a lot of user generated content and low value pages.The first thing you need to do is make sure that your directory indexes are set in your htaccess file. This means tha... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "On-page SEO"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on On-page SEO"
    },
    {
      "level": "H2",
      "text": "Keyword Sprawl: You May Surprise Yourself"
    },
    {
      "level": "H2",
      "text": "Combine & Conquer - The Accretive Powers of Joining Pages Together"
    },
    {
      "level": "H2",
      "text": "Web Standards and SEO: More Questions than Answers"
    },
    {
      "level": "H2",
      "text": "Landing Page Optimization - Potentially More Rewarding than SEO"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "That Settles It...Right? Underscores vs Dashes"
    },
    {
      "level": "H2",
      "text": "PageRank, Link Patterns & the New Flow of Link Juice"
    },
    {
      "level": "H2",
      "text": "Google's speedy index refresh"
    },
    {
      "level": "H2",
      "text": "Increasing the Length of Website Visit ....It's All About The Size"
    },
    {
      "level": "H2",
      "text": "24 On-site SEO Checkups For Clueless Developers / Marketers"
    },
    {
      "level": "H2",
      "text": "Dear Digg.com: I'm Going to Save You a Million Dollars with Three Lines of Code"
    },
    {
      "level": "H2",
      "text": "How to Stop vBulletin from Ruining Your Website"
    }
  ],
  "author": "Karen Browning-Cutler\n          \n            Rand Fishkin\n          \n            Megan-15336\n          \n            Rand Fishkin\n          \n            Bud-Caddell\n          \n            Rand Fishkin\n          \n            JohnWebber\n          \n            IgorMordkovich\n          \n            Ella_D\n          \n            Oatmeal\n          \n            Patrick Altoft"
}