{
  "url": "https://moz.com/blog/category/on-page-seo/p5",
  "slug": "p5",
  "title": "On-page SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Cyrus Shepard April 1, 2019 Topical SEO: 7 Concepts of Link Relevance & Google Rankings Advanced SEO | On-page SEO | Link Building To rank in Google, it’s not simply the number of votes you receive from popular pages, but the relevance and authority of those links as well. Read this post By: Paola-Didone March 26, 2019 The 5 SEO Recommendations That Matter in the End SEO Basics | Search Engines | On-page SEO SEO is an ever-changing game. Here are 5 things that I consider to be evergreen SEO recommendations. Read this post By: Samuel Mangialavori February 11, 2019 How to Identify and Tackle Keyword Cannibalization in 2019 On-page SEO | Content Marketing | SEO Basics Learn how to find and fix keyword cannibalisation before it impacts your SEO opportunities. Read this post By: Britney Muller January 4, 2019 On-Page SEO for 2019 On-page SEO | Whiteboard Friday In this expert checklist, Britney Muller shares her best tips for doing effective on-page SEO in 2019. Read this post By: Jeff Baker December 3, 2018 7 Search Ranking Factors Analyzed: A Follow-Up Study Advanced SEO | On-page SEO | Content Marketing How does newly written, original content perform over time, and which factors may impact that performance? Check out the results in this correlation study analysis and see where it might be smart to focus your efforts (and what to stop doing). Read this post By: Jo Cameron October 16, 2018 5 Ways We Improved User Experience and Organic Reach on the New Moz Help Hub On-page SEO | Content Marketing | User Experience (UX) When it came time for a redesign to our long-outdated Help Hub, we made some big changes that both improve the experience for searchers and help our support content show up in the SERPs. Read this post By: Patrick Curtis April 25, 2018 How We Got a 32% Organic Traffic Boost from 4 On-Page SEO Changes [Case Study] On-page SEO | Search Engines | Advanced SEO The Google Panda updates from 2012 hit forum sites hard. In this case study, learn how one site reversed a trend of stalled growth by implementing four on-page SEO fixes (and one non-solution you should avoid). Read this post By: Jacqueline Francis February 15, 2018 Reading Between the Lines: A 3-Step Guide to Reviewing Web Page Content Content Marketing | On-page SEO Re-evaluating and editing SEO content to make sure it's still relevant and impactful is just as important as creating it in the first place. Identify necessary changes and ensure your content continues to perform well using this 3-step guide and free grading rubric. Read this post By: Rand Fishkin December 1, 2017 Designing a Page's Content Flow to Maximize SEO Opportunity On-page SEO | Whiteboard Friday | User Experience (UX) Controlling and improving the flow of your page content can actually help your SEO. In today's Whiteboard Friday, we cover the questions and goals you need to hit the bullseye on this process. Read this post By: Rand Fishkin October 20, 2017 How Links in Headers, Footers, Content, and Navigation Can Impact SEO Link Building | On-page SEO | Whiteboard Friday This week's Whiteboard Friday covers links in headers and footers, in navigation versus content, and how that can affect internal and external links, link equity, and link value between your site and others. Read this post By: Will Critchlow May 29, 2017 Evidence of the Surprising State of JavaScript Indexing Advanced SEO | Technical SEO | On-page SEO What exactly is going on with JavaScript indexing? The evidence suggest Google is able to crawl it, but how and to what extent? Will Critchlow shares a collection of facts from across the web that paints a picture of the state of JavaScript indexing today and issues a hypothesis you just might wish to test. Read this post By: Felicia Crawford March 23, 2017 Your Daily SEO Fix: Keywords, Concepts, Page Optimization, and Happy NAPs Keyword Research | On-page SEO | Local SEO In our final week of the Daily SEO Fix video series, we cover some quick wins for on-page optimization, keyword research, and accurate NAP listings for your local endeavors using tools from the Moz suite. Read this post By: Everett Sizemore March 22, 2017 How to Do a Content Audit Content Marketing | Technical SEO | On-page SEO Learn how to do content audits for SEO in this Moz guide by Everett Sizemore, including tips for crawling large websites, rendering JavaScript content, and auditing dynamic mobile content. Read this post By: Rand Fishkin February 6, 2017 It's Time to Stop Doing On-Page SEO Like It's 2012 On-page SEO | Advanced SEO | SEO Tools What's new for on-page SEO in 2017? Rand outlines it in 5 succinct tactics: 1) Move beyond keyword repetition rules; 2) Searcher intent matters more than raw keywords; 3) Related topics are essential; 4) Links don't always beat on-page; and 5) Topical authority is more important than ever. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "On-page SEO"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on On-page SEO"
    },
    {
      "level": "H2",
      "text": "Topical SEO: 7 Concepts of Link Relevance & Google Rankings"
    },
    {
      "level": "H2",
      "text": "The 5 SEO Recommendations That Matter in the End"
    },
    {
      "level": "H2",
      "text": "How to Identify and Tackle Keyword Cannibalization in 2019"
    },
    {
      "level": "H2",
      "text": "On-Page SEO for 2019"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "7 Search Ranking Factors Analyzed: A Follow-Up Study"
    },
    {
      "level": "H2",
      "text": "5 Ways We Improved User Experience and Organic Reach on the New Moz Help Hub"
    },
    {
      "level": "H2",
      "text": "How We Got a 32% Organic Traffic Boost from 4 On-Page SEO Changes [Case Study]"
    },
    {
      "level": "H2",
      "text": "Reading Between the Lines: A 3-Step Guide to Reviewing Web Page Content"
    },
    {
      "level": "H2",
      "text": "Designing a Page's Content Flow to Maximize SEO Opportunity"
    },
    {
      "level": "H2",
      "text": "How Links in Headers, Footers, Content, and Navigation Can Impact SEO"
    },
    {
      "level": "H2",
      "text": "Evidence of the Surprising State of JavaScript Indexing"
    },
    {
      "level": "H2",
      "text": "Your Daily SEO Fix: Keywords, Concepts, Page Optimization, and Happy NAPs"
    },
    {
      "level": "H2",
      "text": "How to Do a Content Audit"
    },
    {
      "level": "H2",
      "text": "It's Time to Stop Doing On-Page SEO Like It's 2012"
    }
  ],
  "author": "Cyrus Shepard\n          \n            Paola-Didone\n          \n            Samuel Mangialavori\n          \n            Britney Muller\n          \n            Jeff Baker\n          \n            Jo Cameron\n          \n            Patrick Curtis\n          \n            Jacqueline Francis\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Will Critchlow\n          \n            Felicia Crawford\n          \n            Everett Sizemore\n          \n            Rand Fishkin"
}