{
  "url": "https://www.similarweb.com/blog/insights/airlines-news/",
  "slug": "airlines-news",
  "title": "Airline News, Updates & Insights | Similarweb",
  "description": "Get the latest insights from the Airline world, straight from the experts. Start building your advantage in the Airline industry with Similarweb.",
  "content": "HomeBlogInsightsAirline News 18 Articles Airline News Airline industry news and analysis Insights U.S. Airline Web Traffic Declined 2% in April, Second Consecutive Month of Declines Airline News by Jim Corridore 4 Min. May 8, 2023 Insights U.S. Airline Web Traffic Grew 10% in Q1, But Declined 3% in March Airline News Travel News by Jim Corridore 4 Min. Apr 11, 2023 Insights Air New Zealand Dominates NZ Air Travel Space Airline News by Jim Corridore 3 Min. Mar 13, 2023 Insights U.S. Airline Web Traffic Grew 9% in February 2023, a Slowdown from January’s 25% Gain Airline News by Jim Corridore 3 Min. Mar 8, 2023 Insights U.S. Airline Web Traffic Grew 25% in January, Led By 45% Growth at Frontier, 42% Gain at United Airlines Airline News by Jim Corridore 3 Min. Feb 24, 2023 Insights Ryanair Attracted 27 Million Website Visits in December 2022, Dominating Peers in Europe Airline News by Jim Corridore 3 Min. Feb 6, 2023 Insights Global Air Travel Demand Looks Strong Entering 2023 Airline News by Jim Corridore 2 Min. Dec 20, 2022 Insights Japanese Airline Web Traffic Still Lags Pre-Pandemic Levels Airline News by Jim Corridore 4 Min. Dec 7, 2022 Insights Australian Air Travel Demand Remains Strong Into the Holidays Airline News by Jim Corridore 4 Min. Nov 29, 2022 Insights U.K. Airline Demand Remains Strong, But Weakened in November Airline News by Jim Corridore 3 Min. Nov 22, 2022 Insights Airline Holiday Travel Demand Looks Healthy Airline News by Jim Corridore 3 Min. Nov 18, 2022 Insights European Airline Web Traffic Decelerates Heading into Fall Airline News by Jim Corridore 3 Min. Aug 15, 2022 Show more Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Airline News"
    },
    {
      "level": "H3",
      "text": "U.S. Airline Web Traffic Declined 2% in April, Second Consecutive Month of Declines"
    },
    {
      "level": "H3",
      "text": "U.S. Airline Web Traffic Grew 10% in Q1, But Declined 3% in March"
    },
    {
      "level": "H3",
      "text": "Air New Zealand Dominates NZ Air Travel Space"
    },
    {
      "level": "H3",
      "text": "U.S. Airline Web Traffic Grew 9% in February 2023, a Slowdown from January’s 25% Gain"
    },
    {
      "level": "H3",
      "text": "U.S. Airline Web Traffic Grew 25% in January, Led By 45% Growth at Frontier, 42% Gain at United Airlines"
    },
    {
      "level": "H3",
      "text": "Ryanair Attracted 27 Million Website Visits in December 2022, Dominating Peers in Europe"
    },
    {
      "level": "H3",
      "text": "Global Air Travel Demand Looks Strong Entering 2023"
    },
    {
      "level": "H3",
      "text": "Japanese Airline Web Traffic Still Lags Pre-Pandemic Levels"
    },
    {
      "level": "H3",
      "text": "Australian Air Travel Demand Remains Strong Into the Holidays"
    },
    {
      "level": "H3",
      "text": "U.K. Airline Demand Remains Strong, But Weakened in  November"
    },
    {
      "level": "H3",
      "text": "Airline Holiday Travel Demand Looks Healthy"
    },
    {
      "level": "H3",
      "text": "European Airline Web Traffic Decelerates Heading into Fall"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": ""
}