{
  "url": "https://www.similarweb.com/blog/insights/kamala-harris-candidacy-excites-the-political-web/",
  "slug": "kamala-harris-candidacy-excites-the-political-web",
  "title": "Kamala Harris Candidacy Excites the Political Web | Similarweb",
  "description": "Searchers want to know who she is, how to donate, and what’s up with the “coconut tree” meme, but also “why do people hate kamala harris”",
  "content": "HomeBlogInsightsKamala Harris Candidacy Excites the Political Web Insights Kamala Harris Candidacy Excites the Political Web by David F. Carr 4 Min. July 25, 2024 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Searchers want to know who she is, how to donate, and what’s up with the “coconut tree” meme, but also “why do people hate kamala harris” The Democratic presidential candidate switch from Joe Biden to Kamala Harris has shaken up the race – and the internet. Similarweb can confirm that the ActBlue fundraising website (actblue.com) has attracted more daily traffic on Sunday and Monday than any other day this year. Meanwhile, internet users are searching for more information on Kamala Harris – and although those include “how do I donate?” searches, they also include people asking, “why do people dislike kamala harris?” Key takeaways There were approximately 9 million searches on “kamala harris” Sunday and 3.3 million clicks on search results in web and mobile web traffic, according to Similarweb estimates, plus many more specific searches by people wanting to learn more about her. Searches for “kamala harris” were up 2,769% for the past 28 days versus the previous month. Most of that happened in the days since rumors began building and President Biden confirmed his “passing of the torch” to Harris on Sunday. Among the trending keywords other than Harris’s name (and misspellings of her name) were several related to her age, her parents, her ethnicity, her approval rating, whether she has children, and her coconut tree quote. Among search queries phrased as questions, “how old is kamala harris” was #1, followed by “does kamala harris have children” and “how to donate to kamala harris.” Then there were several variations on “why do people hate kamala harris” (details below). Traffic to actblue.com hit 2.2 million (M) visits on Sunday, an increase of more than 300% from the day before, and reached 2.9M on Monday, based on traffic from within the US. Democratic fundraising web traffic still doesn’t quite match the 3M daily traffic peak for WinRed (winred.com), the Republican fundraising website on May 31. That came after former President Donald J. Trump’s criminal conviction. The peak for winred.com during last week’s Republican nominating convention was 1.8M visits on July 15. These estimates are based on traffic from within the US. 9 million searches in a day This is what the rise in searches on “kamala harris” looked like, with most of the resulting traffic going to Wikipedia and news sites. Trending keywords, including the “coconut tree” What were people searching for? Most of the keywords on the list below are self explanatory, but the “coconut tree” meme requires some explanation. During a White House event last year, she uttered a quirky quote that her fans have adopted as an ironic motto: “You think you just fell out of a coconut tree? You exist in the context of all in which you live and what came before you.” Other terms on the list relate to people trying to learn about her age or ethnicity (African American and Asian American) and her approval rating. Keyword 28 Days Volume Clicks kamala harris 26.0M 21.3M kamala harris age 922.2K 353.2K kamala harris young 331.8K 236.7K kamala harris parents 318.8K 204.5K kamala harris approval rating 313.4K 478.4K kamala harris husband 310.6K 149.5K kamala harris ethnicity 232.1K 156.6K kamala harris nationality 174.4K 146.9K kamala harris’ approval rating 162.0K 202.7K kamala harris children 156.7K 223.3K kamala harris speech 139.0K 172.0K kamala harris coconut tree 138.4K 167.0K Questions people are asking When people enter their search in the form of a question, those questions can tell us more about what they are thinking. Again, many of these are about her age and origin story. Then there are those like “why do people hate kamala harris” and “why is kamala harris so unpopular.” We don’t necessarily know whether these searches reflect animosity toward Harris or questions from people who like her (or want to like her) and are trying to understand why other people don’t. Polling prior to her emergence as a presidential candidate tended to suggest that Kamala Harris was no more popular than Joe Biden, perhaps less so. That may change now that she has emerged from the relative obscurity of the vice presidency, but meanwhile these questions show people are aware of the doubts about her. Keyword 28 Days Volume Clicks how old is kamala harris 350.1K 120.9K does kamala harris have children 50.3K 83.6K how to donate to kamala harris 30.1K 0.0K where was kamala harris born 26.4K 14.8K does kamala harris have kids 24.1K 44.5K what has kamala harris done 23.1K 31.7K what nationality is kamala harris 16.8K 17.7K how tall is kamala harris 13.9K 24.8K why do people hate kamala harris 12.0K 16.3K what did kamala harris’ mother tell her? 11.7K 16.9K what race is kamala harris 10.0K 7.9K what ethnicity is kamala harris 9.7K 13.8K where is kamala harris from 9.5K 8.5K why is kamala harris so unpopular 7.6K 6.8K why do people dislike kamala harris 6.8K 5.2K why is kamala harris unpopular 6.1K 8.2K why do people not like kamala harris 5.6K 8.0K We detected more than 30,000 searches for “how to donate to kamala harris,” although it seems few people clicked directly from search to a fundraising page. Fundraising momentum for the Democrats Both parties funnel the bulk of their small dollar online donations to bespoke fundraising portals, ActBlue and WinRed. Until now, ActBlue has lagged in traffic and attention, but in recent days it has been catching up. The Similarweb Insights & Communications team is available to pull additional or updated data on request for the news media (journalists are invited to write to press@similarweb.com). When citing our data, please reference Similarweb as the source and link back to the most relevant blog post or similarweb.com/blog/insights/. Contact: For more information, please write to press@similarweb.com. Report By: David F. Carr, Senior Insights Manager Methodology Disclaimer: All names, brands, trademarks, and registered trademarks are the property of their respective owners. The data, reports, and other materials provided or made available by Similarweb consist of or include estimated metrics and digital insights generated by Similarweb using its proprietary algorithms, based on information collected by Similarweb from multiple sources using its advanced data methodologies. Similarweb shall not be responsible for the accuracy of such data, reports, and materials and shall have no liability for any decision by any third party based in whole or in part on such data, reports, and materials. by David F. Carr David covers social media, digital advertising, and generative AI. With a background in web trends since the 1990s, he’s also the author of \"Social Collaboration for Dummies\". This post is subject to Similarweb legal notices and disclaimers. Related Posts Insights Pawsitive Growth: Insights & Amazon Trends in the Pet Health Segment Marketing Insights by Maria Pashi 6 Min. Oct 11, 2024 Insights “Olympics Basketball” is the Sport Driving the Most Traffic for Paris Olympics by David F. Carr 4 Min. Jul 24, 2024 Insights World Population Day 2023: What Country Generates the Most Traffic to the Largest Websites? by Itay Gross 6 Min. Jul 6, 2023 Insights Bankrate and NerdWallet Win Share in Consumer Credit by David F. Carr 3 Min. May 8, 2023 Insights Chase Leads US Banks With 2.2 Billion Web Visits in Past 12 Months by Jim Corridore 4 Min. May 4, 2023 Insights Digital 100 Financial Services Winner: Synchrony by David F. Carr 3 Min. Jan 25, 2023 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Kamala Harris Candidacy Excites the Political Web"
    },
    {
      "level": "H2",
      "text": "Searchers want to know who she is, how to donate, and what’s up with the “coconut tree” meme, but also “why do people hate kamala harris”"
    },
    {
      "level": "H2",
      "text": "Key takeaways"
    },
    {
      "level": "H2",
      "text": "9 million searches in a day"
    },
    {
      "level": "H2",
      "text": "Trending keywords, including the “coconut tree”"
    },
    {
      "level": "H2",
      "text": "Questions people are asking"
    },
    {
      "level": "H2",
      "text": "Fundraising momentum for the Democrats"
    },
    {
      "level": "H3",
      "text": "Pawsitive Growth: Insights & Amazon Trends in the Pet Health Segment"
    },
    {
      "level": "H3",
      "text": "“Olympics Basketball” is the Sport Driving the Most Traffic for Paris Olympics"
    },
    {
      "level": "H3",
      "text": "World Population Day 2023: What Country Generates the Most Traffic to the Largest Websites?"
    },
    {
      "level": "H3",
      "text": "Bankrate and NerdWallet Win Share in Consumer Credit"
    },
    {
      "level": "H3",
      "text": "Chase Leads US Banks With 2.2 Billion Web Visits in Past 12 Months"
    },
    {
      "level": "H3",
      "text": "Digital 100 Financial Services Winner: Synchrony"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by David F. Carr"
}