{
  "url": "https://www.similarweb.com/blog/insights/telehealth-abortion/",
  "slug": "telehealth-abortion",
  "title": "Telehealth Abortions: The Next Battleground | Similarweb",
  "description": "Between the leaked U.S. Supreme Court opinion overturning the right to abortion and the official ruling, interest in telehealth medication options surged.",
  "content": "HomeBlogInsightsTelehealth Abortions: The Next Battleground Insights Telehealth Abortions: The Next Battleground Start your free trial by Sneha Pandey , Insights Manager 5 Min. June 28, 2022 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Demand for telehealth abortions skyrockets 2,585% on June 24th as states discuss crackdowns Between the May 2nd leak of a U.S. Supreme Court opinion overturning the constitutional right to abortion and the June 24th ruling that made it official, interest in medication abortion options available by online telehealth and by mail order has surged. Key Findings Searches for keywords related to purchasing abortion pills online increased 106% from April to May 2022, according to Similarweb estimates Traffic to telehealth abortion websites increased 456% from April to May 2022, followed by a 2,585% increase in daily visits to telehealth platforms the day of the verdict, June 24th, according to Similarweb estimates Aid Access is the leading international platform shipping abortion medication to states, despite state bans and restrictions. Traffic to Aid Access, Similarweb data shows, surged 528% from April to May 2022 – reaching an estimated 291,000 visits in May 2022, followed by a massive 2,170% increase in daily visits the day of the verdict, June 24th. Before 1973’s landmark decision, Roe v. Wade decriminalized abortion – and before medication abortion was made readily accessible, millions of Americans navigated loopholes and under-the-radar alternatives to surgical abortion that were largely unsafe if not deadly. Similarweb’s Commitment to Privacy: Since data collection is at the heart of our business, we have invested heavily and proactively for years to place compliance and user transparency at the center of our diverse data collection practices. We do not need PII or personal data to deliver any of the metrics and insights in our reports, which are based on anonymized and aggregated data. In addition, we do not collect IP data and no metric in our platform requires or uses IP data. Nearly 50 years later, millions of Americans yet again find themselves beginning to navigate legal loopholes and under-the-radar alternatives in the aftermath of Roe being overturned by the Supreme Court on June 24. However, people today may not need to turn to “back-alley” surgical abortions, as the illegal and often dangerous procedures of the past were then described. The difference this time is the accessibility to much safer, self-administered alternatives as a result of digital healthcare paired with mail order availability of abortion medication. Similarweb’s digital intelligence platform helps us dive deeper into emerging trends in what remains an unregulated legal gray area – and the next frontier for the abortion debate. The Demand For Telehealth Medication Abortion Platforms According to a report by the Guttmacher Institute, more than half of the abortions in the United States in 2020 were medication abortions. Medication abortions became increasingly popular during the COVID-19 pandemic – as a method that minimized contact in addition to providing significantly more privacy. This, along with the FDA’s approval of drugs prescribed via telehealth appointments, led to the accelerating popularity of domestic digital abortion companies, such as Hey Jane and Carafem, that entered the market as more affordable and efficient options for first-trimester patients. The recent leak of the Supreme Court draft opinion was followed by a surge in searches for online resources about medication abortion. These search trends only escalated in the lead-up to the verdict date, Similarweb estimates show. Searches for keywords related to purchasing abortion pills online increased by 106% from April to May 2022. As the list of trigger law states grew, so did traffic to telehealth abortion platforms – increasing 456% from April to May 2022 and reaching over 1.7M visits in May followed by a 2,585% increase in daily visits to telehealth platforms the day of the final verdict, June 24th. There appears to be a mass movement to leverage these platforms for consultations and mail-order medications amid heightened regulatory ambiguity and the onset of panic buying. Telemedicine Resource Platforms Reveal Loopholes Domestic mail order pills/telehealth consultation platforms saw large increases in traffic to their websites after the leak of a draft of the Supreme Court opinion (which wound up being very close to the text of the final ruling). However, many such platforms have paused operations in conservative states as a result of trigger laws. Increases prior to the verdict could be attributed to visitors looking to stockpile pills before state-specific restrictions and bans are implemented. Hey Jane up 134% May 2022 | up 2397% June 24, 2022 Carafem up 47% May 2022 | up 62% June 24, 2022 Some states moved to impose bans on domestic telemedicine in addition to medication abortions as part of trigger laws. Left with no options beyond out-of-state travel, demand for a cross-border alternative led people to overseas online pharmacies like Aid Access in their online searches. Aid Access is the primary international platform shipping abortion medication to states despite restrictions. It functions by navigating legal loopholes, allowing doctors overseas to prescribe and ship medication to any state in the US. As a result, this platform has been a key traffic leader in the category of abortion pill providers and resources. Traffic to Aid Access increased 528% from April to May 2022, reaching an estimated 291,000 visits in May 2022, followed by a massive 2,170% increase in daily visits the day of the verdict, June 24th. Similarly, Plan C helps connect people in states implementing bans with resources like Aid Access amongst other smaller platforms to mail order abortion medication. Plan C also contains instructions on using mail forwarding or virtual mailboxes to order abortion pills from domestic companies into a restricted state. Legal Uncertainty & Hard To Regulate Loopholes The U.S. Supreme Court ruling clears the way for states to set their own abortion policies – a motion that has begun to materialize through the implementation of “trigger laws” or restrictive abortion laws. Numerous states are moving to ban all forms of abortion, including nineteen states that have already banned telemedicine abortions. However, as this is a largely unregulated space, the availability of telehealth and mail-order options makes an outright ban incredibly difficult to enforce. While states can exercise control over domestic telehealth practices, international-based companies are looking to close the gap by operating in legal gray areas, as we can see from the widespread rise of Aid Access’s overseas consultative services and ability to ship medication to even the most restrictive states. As patients look to navigate this changing ecosystem, we can expect the next few months to highlight political discourse on topics like telehealth abortion regulation, abortion medications, patient privacy, cross-border abortions, contraceptive regulations, and mail order medications. There is only one certainty: medical abortions are the next front in the battle over abortion rights. The Similarweb Insights Newsroom is available to pull additional or updated data on request for the news media (journalists are invited to write to press@similarweb.com). When citing our data, please reference Similarweb as the source and link back to the most relevant blog post or similarweb.com/blog/insights/. Methodology Disclaimer: All data, reports and other materials provided or made available by Similarweb are based on data obtained from third parties, including estimations and extrapolations based on such data. Similarweb shall not be responsible for the accuracy of the materials and shall have no liability for any decision by any third party based in whole or in part on the materials. Photo by Michał Parzuchowski on Unsplash by Sneha Pandey Insights Manager Sneha, a Purdue graduate, delivers data-driven insights on Retail, eCommerce, Politics, CPG, and B2B Software, helping Fortune 50 companies succeed. This post is subject to Similarweb legal notices and disclaimers. Related Posts Insights Pawsitive Growth: Insights & Amazon Trends in the Pet Health Segment Marketing Insights by Maria Pashi 6 Min. Oct 11, 2024 Insights Kamala Harris Candidacy Excites the Political Web by David F. Carr 4 Min. Jul 25, 2024 Insights “Olympics Basketball” is the Sport Driving the Most Traffic for Paris Olympics by David F. Carr 4 Min. Jul 24, 2024 Insights World Population Day 2023: What Country Generates the Most Traffic to the Largest Websites? by Itay Gross 6 Min. Jul 6, 2023 Insights Bankrate and NerdWallet Win Share in Consumer Credit by David F. Carr 3 Min. May 8, 2023 Insights Chase Leads US Banks With 2.2 Billion Web Visits in Past 12 Months by Jim Corridore 4 Min. May 4, 2023 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Telehealth Abortions: The Next Battleground"
    },
    {
      "level": "H2",
      "text": "Demand for telehealth abortions skyrockets 2,585% on June 24th as states discuss crackdowns"
    },
    {
      "level": "H2",
      "text": "Key Findings"
    },
    {
      "level": "H2",
      "text": "The Demand For Telehealth Medication Abortion Platforms"
    },
    {
      "level": "H2",
      "text": "Telemedicine Resource Platforms Reveal Loopholes"
    },
    {
      "level": "H2",
      "text": "Legal Uncertainty & Hard To Regulate Loopholes"
    },
    {
      "level": "H3",
      "text": "Pawsitive Growth: Insights & Amazon Trends in the Pet Health Segment"
    },
    {
      "level": "H3",
      "text": "Kamala Harris Candidacy Excites the Political Web"
    },
    {
      "level": "H3",
      "text": "“Olympics Basketball” is the Sport Driving the Most Traffic for Paris Olympics"
    },
    {
      "level": "H3",
      "text": "World Population Day 2023: What Country Generates the Most Traffic to the Largest Websites?"
    },
    {
      "level": "H3",
      "text": "Bankrate and NerdWallet Win Share in Consumer Credit"
    },
    {
      "level": "H3",
      "text": "Chase Leads US Banks With 2.2 Billion Web Visits in Past 12 Months"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Sneha Pandey"
}