{
  "url": "https://moz.com/blog/category/advanced-seo/p11",
  "slug": "p11",
  "title": "Advanced SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Will Critchlow November 9, 2018 The Difference Between URL Structure and Information Architecture Advanced SEO | Whiteboard Friday How is URL structure different from information architecture, and why does the distinction matter? In this Whiteboard Friday, Will Critchlow helps us distinguish between the two disparate topics and shares some guiding questions to ask about each. Read this post By: Alexis Sanders October 9, 2018 The SEO Cyborg: How to Resonate with Users & Make Sense to Search Bots Advanced SEO SEO is more than the tri-force of crawling, indexing, and ranking. Alexis Sanders shares how the incredibly important steps of rendering, signaling, and connecting fit into the puzzle, and how you can use an enhanced SEO model to hyper-focus your efforts. Read this post By: Serge Stefoglo October 5, 2018 Faceted Navigation Intro Advanced SEO | Whiteboard Friday | E-Commerce SEO Faceted navigation is a common solution for e-commerce sites, but managing it on the SEO side can quickly spin out of control. In this week's Whiteboard Friday, get a refresher on what faceted nav is and why it matters, then dive into a few key solutions that can help you overcome its obstacles. Read this post By: Will Critchlow September 28, 2018 Surprising SEO A/B Test Results Advanced SEO | Whiteboard Friday Not every logical optimization made for SEO actually has positive results. In this week's edition of Whiteboard Friday, Will Critchlow explains what A/B testing for SEO entails and describes the surprising results he's seen that prove you can't always trust your instinct in our industry. Read this post By: Rand Fishkin September 7, 2018 SEO \"Dinosaur\" Tactics That You Should Retire Advanced SEO | Whiteboard Friday Let's admit it — many of us still practice outdated SEO tactics in the belief that they still work. In this week's Whiteboard Friday, Rand sets us straight and offers up a series of replacement activities that will go much farther toward moving the needle. Read this post By: Russ Jones August 28, 2018 A Quarter-Million Reasons to Use Moz's Link Intersect Tool Link Building | Advanced SEO | SEO Tools Smart link prospecting is the key to earning high quality links, faster. The Link Intersect tool helped my agency land a $250,000 contract — read the story and see what it can do for you. Read this post By: Dana DiTomaso August 3, 2018 Calculated Fields in Google Data Studio SEO Tools | Whiteboard Friday | Advanced SEO Google Data Studio is a powerful tool to have on your side. Dana DiTomaso takes us through how to use calculated fields in Google Data Studio to uncover more value in your data and improve your reports. Read this post L By: Laura Lippay July 31, 2018 Better Than Basics: Custom-Tailoring Your SEO Approach (With Real-World Examples) Advanced SEO | SEO Consulting One-size-fits-all just isn't true in SEO. Customizing your approach per each unique site and client is key to both SEO success and client retention. Read this post By: Heather Physioc July 10, 2018 Your Red-Tape Toolkit: 7 Ways to Earn Trust and Get Your Search Work Implemented SEO Consulting | Advanced SEO If corporate bureaucracy has ever kept you from doing your best SEO work, this is the article for you. Learn powerful tactics to cut through the red tape and bypass obstacles in Heather Physioc's follow-up to her MozCon 2018 talk! Read this post By: Heather Physioc June 26, 2018 How to Diagnose Your SEO Client's Search Maturity SEO Consulting | Advanced SEO Not every client starts with the same level of knowledge when it comes to SEO. In this post, you'll learn to diagnose your clients' search maturity using a methodical scorecard approach and increase the likelihood your work will be implemented. Read this post By: Dominic Woodman June 19, 2018 An 8-Point Checklist for Debugging Strange Technical SEO Problems Technical SEO | Advanced SEO Occasionally you'll face technical SEO problems with no straightforward solution. Dominic Woodman shares an essential 8-point checklist for troubleshooting just what went wrong (and ensuring you don't waste time on unimportant technical rabbit holes). Read this post By: Jeff Baker June 11, 2018 How a Few Pages Can Make or Break Your Website Content Marketing | Advanced SEO | Keyword Research When even a fraction of your pages rank well for a high-intent query, the impact on your traffic can be astonishing. But to see surprising results, the process for creating content needs to be rigorous and heavily supported by data. Read this post By: Jes Scholz June 5, 2018 Looking Beyond Keywords: How to Drive Conversion with Visual Search & Search by Camera Advanced SEO Cutting out the actual keyword search reduces the number of steps customers take between content and conversion. With visual search steadily on the rise, how can your brand take advantage of visual marketing? Read this post By: Russ Jones May 22, 2018 Backlink Blindspots: The State of Robots.txt Advanced SEO | SEO Tools | Link Building Ever wonder why you see different links in Google Search Console compared to Moz, Majestic, and Ahrefs? Learn how usage of robots.txt across the web impacts the major link indexes. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Advanced SEO"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Advanced SEO"
    },
    {
      "level": "H2",
      "text": "The Difference Between URL Structure and Information Architecture"
    },
    {
      "level": "H2",
      "text": "The SEO Cyborg: How to Resonate with Users & Make Sense to Search Bots"
    },
    {
      "level": "H2",
      "text": "Faceted Navigation Intro"
    },
    {
      "level": "H2",
      "text": "Surprising SEO A/B Test Results"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "SEO \"Dinosaur\" Tactics That You Should Retire"
    },
    {
      "level": "H2",
      "text": "A Quarter-Million Reasons to Use Moz's Link Intersect Tool"
    },
    {
      "level": "H2",
      "text": "Calculated Fields in Google Data Studio"
    },
    {
      "level": "H2",
      "text": "Better Than Basics: Custom-Tailoring Your SEO Approach (With Real-World Examples)"
    },
    {
      "level": "H2",
      "text": "Your Red-Tape Toolkit: 7 Ways to Earn Trust and Get Your Search Work Implemented"
    },
    {
      "level": "H2",
      "text": "How to Diagnose Your SEO Client's Search Maturity"
    },
    {
      "level": "H2",
      "text": "An 8-Point Checklist for Debugging Strange Technical SEO Problems"
    },
    {
      "level": "H2",
      "text": "How a Few Pages Can Make or Break Your Website"
    },
    {
      "level": "H2",
      "text": "Looking Beyond Keywords: How to Drive Conversion with Visual Search & Search by Camera"
    },
    {
      "level": "H2",
      "text": "Backlink Blindspots: The State of Robots.txt"
    }
  ],
  "author": "Will Critchlow\n          \n            Alexis Sanders\n          \n            Serge Stefoglo\n          \n            Will Critchlow\n          \n            Rand Fishkin\n          \n            Russ Jones\n          \n            Dana DiTomaso\n          \n            Laura Lippay\n          \n            Heather Physioc\n          \n            Heather Physioc\n          \n            Dominic Woodman\n          \n            Jeff Baker\n          \n            Jes Scholz\n          \n            Russ Jones"
}