{
  "url": "https://moz.com/blog/category/advanced-seo/p26",
  "slug": "p26",
  "title": "Advanced SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Rand Fishkin March 6, 2015 What Deep Learning and Machine Learning Mean For the Future of SEO Advanced SEO | Whiteboard Friday In today's Whiteboard Friday, Rand explores a future marked by machine learning, where Google's ranking algorithm updates itself based on potentially countless inputs. Read this post By: Bill Slawski March 3, 2015 How Google Pulls Structured Snippets from Websites' Tables Advanced SEO | Search Engines There are many pages on the Web that are filled with data in the form of tables, and Google is including some of that tablular data in search results in places that may surprise you. Here's how it works, and how you can take advantage. Read this post By: Justin Briggs February 17, 2015 Everything You Need to Know About Mobile App Search Technical SEO | Advanced SEO | Mobile SEO Mobile isn't the future. It's the present. Learn about new and emerging mobile app search opportunities, from mobile search results to app indexation. The growth of mobile search is transforming how we define technical SEO, moving beyond front-end and back-end optimization of websites into the realm of structured data and application development. Read this post By: Ellie Wilkinson February 12, 2015 How to Defeat Duplicate Content - Next Level Advanced SEO | Moz Tools Learn how to use Moz tools to identify and resolve duplicate content issues in this third installment of Next Level series. Read this post By: Brian Hughes February 4, 2015 How to Prevent Hackers from Using Bad Bots To Exploit Your Website Advanced SEO | User Experience (UX) Bandit bots are always circling, looking for an opportunity to attack your site. Make certain you aren't an easy victim. Read this post By: Rand Fishkin January 20, 2015 Why SEOs Need to Care About Correlation as Much (or More) than Causation Advanced SEO Gain a deeper understanding of what's really going on with your Google and your SEO by stepping away from causation for a moment and focusing on correlation. Rand explains. Read this post By: Rand Fishkin January 16, 2015 Hacking Keyword Targeting by Serving Interest-Based Searches Keyword Research | Whiteboard Friday | Advanced SEO Keywords that lead directly to conversions are sometimes in short supply, but tapping into your audience's other interests can bring unexpected returns. In today's Whiteboard Friday, Rand shows you how. Read this post By: Pratik Dholakiya January 12, 2015 7 Ways to Get Traffic and Leads When Google Won't Send Them Advanced SEO | Search Engines Often, the best methods to secure traffic and links are right under your nose, requiring little more than ingenuity and some legwork. Read this post By: Casey Meraz January 12, 2015 How to Have a Successful Local SEO Campaign in 2015 Local SEO | Advanced SEO Do you want to start the new year off right with a successful local SEO campaign in 2015? This new year guide by Casey Meraz will help you to understand the common issues businesses will face and how to jump start your campaign. Read this post By: Modestos Siotos January 7, 2015 12 Common Reasons Reconsideration Requests Fail Link Building | Advanced SEO Getting a Google penalty lifted can be an arduous, painful process, even for the most skilled SEOs and webmasters. However, some of the most common pitfalls are easy to avoid. Read this post A By: Alan Bleiweiss January 7, 2015 Case Study: One Site's Recovery from an Ugly SEO Mess Advanced SEO A comprehensive case study on how I helped a site recover from a massive Google algorithmic loss... Read this post By: Josh Bachynski January 2, 2015 Discussion: Can You Disavow out of Penguin? Link Building | Whiteboard Friday | Advanced SEO A rumor is spreading that you can get out of a Penguin penalty with a simple disavow file. In today's Whiteboard Friday, Josh Bachynski deconstructs that argument and starts a realistic discussion we hope you'll join in order to get at an answer. Read this post By: Trevor Klein December 30, 2014 The Best of 2014: Top People and Posts from the Moz Blog Content Marketing | Advanced SEO It's time for the annual round-up of the cream of the crop -- the very best of the Moz Blog from 2014. Whose comments earned more thumbs up than anyone else's this year? Dive in to find out, and happy New Year from Moz! Read this post By: Rand Fishkin December 19, 2014 Information Architecture for SEO Advanced SEO | Whiteboard Friday Many best practices in information architecture are increasingly leading to SEO benefits, and in today's Whiteboard Friday, Rand explains which ones you should pay attention to. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Advanced SEO"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Advanced SEO"
    },
    {
      "level": "H2",
      "text": "What Deep Learning and Machine Learning Mean For the Future of SEO"
    },
    {
      "level": "H2",
      "text": "How Google Pulls Structured Snippets from Websites' Tables"
    },
    {
      "level": "H2",
      "text": "Everything You Need to Know About Mobile App Search"
    },
    {
      "level": "H2",
      "text": "How to Defeat Duplicate Content - Next Level"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "How to Prevent Hackers from Using Bad Bots To Exploit Your Website"
    },
    {
      "level": "H2",
      "text": "Why SEOs Need to Care About Correlation as Much (or More) than Causation"
    },
    {
      "level": "H2",
      "text": "Hacking Keyword Targeting by Serving Interest-Based Searches"
    },
    {
      "level": "H2",
      "text": "7 Ways to Get Traffic and Leads When Google Won't Send Them"
    },
    {
      "level": "H2",
      "text": "How to Have a Successful Local SEO Campaign in 2015"
    },
    {
      "level": "H2",
      "text": "12 Common Reasons Reconsideration Requests Fail"
    },
    {
      "level": "H2",
      "text": "Case Study: One Site's Recovery from an Ugly SEO Mess"
    },
    {
      "level": "H2",
      "text": "Discussion: Can You Disavow out of Penguin?"
    },
    {
      "level": "H2",
      "text": "The Best of 2014: Top People and Posts from the Moz Blog"
    },
    {
      "level": "H2",
      "text": "Information Architecture for SEO"
    }
  ],
  "author": "Rand Fishkin\n          \n            Bill Slawski\n          \n            Justin Briggs\n          \n            Ellie Wilkinson\n          \n            Brian Hughes\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Pratik Dholakiya\n          \n            Casey Meraz\n          \n            Modestos Siotos\n          \n            Alan Bleiweiss\n          \n            Josh Bachynski\n          \n            Trevor Klein\n          \n            Rand Fishkin"
}