{
  "url": "https://moz.com/blog/category/advanced-seo/p29",
  "slug": "p29",
  "title": "Advanced SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Mark Traphagen July 9, 2014 Author Photos are Gone: Does Google Authorship Still Have Value? Technical SEO | Advanced SEO Does Google Authorship still matter once photos no longer show up in SERPs? Mark Traphagen considers why they were removed and what's next for Authorship. Read this post By: Casey Meraz July 9, 2014 Advanced Local Citation Audit & Clean Up: Achieve Consistent Data & Higher Rankings Local SEO | Advanced SEO Cleaning up your citations is not as easy as waving a magic wand or blinking while wearing your Google Glass. Read on to find out how to audit your citations and clean up your local listings! Read this post By: Hive Digital July 2, 2014 Panda Pummels Press Release Websites: The Road to Recovery On-page SEO | Advanced SEO | SEO Tools No one expects the Panda! Many of us were surprised when Google rolled out Panda 4.0 after telling us that it was essentially \"baked into\" the algorithm last year. After seeing many sites take breathtaking hits, what can we learn from their losses? What is the path to recovery? Read this post By: Rand Fishkin June 27, 2014 8 Ways to Use Email Alerts to Boost SEO Advanced SEO | Whiteboard Friday Email alerts can show you the freshest link building and relationship-building opportunities. In today's Whiteboard Friday, Rand offers eight specific types of alerts that you can set up to improve your SEO. Read this post By: Gianluca Fiorelli June 25, 2014 Analyzing 11,555 Questions Asked by SEOs: The Moz Q&A Meta Study Advanced SEO | Marketing Psychology | Community Management The Moz Community is one of the biggest SEO communities online. Analyzing the Moz Q&A, then, can help us understand what SEOs are really talking and worried about. Here's the result of analyzing more than 11,000 questions. Read this post By: Cyrus Shepard June 17, 2014 Feeding the Hummingbird: Structured Markup Isn't the Only Way to Talk to Google On-page SEO | Technical SEO | Advanced SEO Many SEOs limit their understanding of entity search to vague concepts of structured data, Schema.org and Freebase. They fall into the trap of thinking that the only way to participate in the entity SEO revolution is to markup your HTML with complex schema.org microdata. Let's explore why this isn't true. Read this post By: Tom Anthony June 16, 2014 IPv6, C-Blocks, and How They Affect SEO Technical SEO | Advanced SEO You have probably heard about IPv6, but you might remain a bit confused about the details of what it is, how it works, and what it means for the future of the Internet. This post gives a quick introduction to IPv6, and discusses possible SEO implications that could follow from IPv6 being rolled out (touching specifically on the concept of C-Blocks). Read this post By: Cyrus Shepard May 30, 2014 Breaking the SEO Rules: When Not to Follow Best Practices Whiteboard Friday | Advanced SEO Sometimes it makes more sense to ditch best practices when you're working toward other goals. In today's Whiteboard Friday, Cyrus lays out four situations in which we're often safe bucking the standard operating procedure. Read this post By: Cyrus Shepard May 28, 2014 Take the SEO Expert Quiz and Rule the Internet Technical SEO | Advanced SEO | SEO Basics You are master of the keyword. You create 1,000 links with a single tweet. Google engineers ask for your approval before updating their algorithm. You, my friend, are an SEO Expert. Prove it by taking our new SEO Expert Quiz. Read this post By: Irving Weiss May 27, 2014 SEO Guide to Google Webmaster Recommendations for Pagination Advanced SEO Our pagination strategy has changed several times to keep in step with Google's latest recommendations. At the end of this article, I will present a Google recommendation history. Read this post By: Gianluca Fiorelli May 13, 2014 Auditing the Moz Q&A: Optimization and Insights Advanced SEO Gianluca endeavored to learn more about our industry by analyzing more than 20,000 questions from Moz's Q&A section. Along the way, he discovered quite a bit about what makes for an effective online forum. Today's post covers what he learned. Read this post By: Simon Penson April 30, 2014 The Panda Patent: Brand Mentions Are the Future of Link Building Advanced SEO If a recently filed patent is any clue, Google is now working on major algorithmic changes to measure authority outside of followed links. Find out more about how brand mentions play an increasingly important part in that mix. Read this post By: Hive Digital April 23, 2014 Penguin Penalties: Do Webmasters Respond the Way They Should? Advanced SEO How do webmasters really respond to a Google update? Does Google really just penalize sites to encourage AdWords adoption? We unravel the assumptions with historical data to show you how the community-at-large is impacted by a Penguin update. Read this post By: Rand Fishkin April 10, 2014 Content-Gap SEO: A Potentially Untapped Opportunity Advanced SEO With certain types of search queries, it may be possible to get rankings and results without having to grind on external links simply by identifying gaps in the content provided by those who currently rank and providing it on your pages. This post describes some of Rand's theories about what Google's doing in content analysis and how marketers may be able to leverage it. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Advanced SEO"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Advanced SEO"
    },
    {
      "level": "H2",
      "text": "Author Photos are Gone: Does Google Authorship Still Have Value?"
    },
    {
      "level": "H2",
      "text": "Advanced Local Citation Audit & Clean Up: Achieve Consistent Data & Higher Rankings"
    },
    {
      "level": "H2",
      "text": "Panda Pummels Press Release Websites: The Road to Recovery"
    },
    {
      "level": "H2",
      "text": "8 Ways to Use Email Alerts to Boost SEO"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Analyzing 11,555 Questions Asked by SEOs: The Moz Q&A Meta Study"
    },
    {
      "level": "H2",
      "text": "Feeding the Hummingbird: Structured Markup Isn't the Only Way to Talk to Google"
    },
    {
      "level": "H2",
      "text": "IPv6, C-Blocks, and How They Affect SEO"
    },
    {
      "level": "H2",
      "text": "Breaking the SEO Rules: When Not to Follow Best Practices"
    },
    {
      "level": "H2",
      "text": "Take the SEO Expert Quiz and Rule the Internet"
    },
    {
      "level": "H2",
      "text": "SEO Guide to Google Webmaster Recommendations for Pagination"
    },
    {
      "level": "H2",
      "text": "Auditing the Moz Q&A: Optimization and Insights"
    },
    {
      "level": "H2",
      "text": "The Panda Patent: Brand Mentions Are the Future of Link Building"
    },
    {
      "level": "H2",
      "text": "Penguin Penalties: Do Webmasters Respond the Way They Should?"
    },
    {
      "level": "H2",
      "text": "Content-Gap SEO: A Potentially Untapped Opportunity"
    }
  ],
  "author": "Mark Traphagen\n          \n            Casey Meraz\n          \n            Hive Digital\n          \n            Rand Fishkin\n          \n            Gianluca Fiorelli\n          \n            Cyrus Shepard\n          \n            Tom Anthony\n          \n            Cyrus Shepard\n          \n            Cyrus Shepard\n          \n            Irving Weiss\n          \n            Gianluca Fiorelli\n          \n            Simon Penson\n          \n            Hive Digital\n          \n            Rand Fishkin"
}