{
  "url": "https://moz.com/blog/category/advanced-seo/p7",
  "slug": "p7",
  "title": "Advanced SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Emily Potter November 1, 2019 Hypothesis Testing in SEO & Statistical Significance Advanced SEO | SEO Analytics | Whiteboard Friday A/B testing your SEO changes can bring you a competitive edge and dodge the bullet of negative changes that could lower your traffic. In this Whiteboard Friday, Emily Potter shares why A/B testing your changes is important and how to develop a hypothesis, what goes into collecting and analyzing the data, and how to draw your conclusions. Read this post By: Felicia Crawford October 30, 2019 Get the Bingeable & Shareable MozCon 2019 Video Bundle! Advanced SEO | Moz News | SEO Events MozCon 2019 is over, but the experience lives on in the video bundle. Get access to all 27 presentations from this year’s event for you and your team. Read this post By: Britney Muller October 25, 2019 The Featured Snippets Cheat Sheet and Interactive Q&A Keyword Research | Content Marketing | Advanced SEO Dig into the SEO community's biggest questions when it comes to featured snippets. Plus, snag your free download of the Featured Snippets Cheat Sheet for strategic tips and reminders on how to win snippets of your own! Read this post By: Samuel Mangialavori October 21, 2019 5 Things You Should Know About \"People Also Ask\" & How to Take Advantage Advanced SEO | Search Engines People Also Ask boxes represent growing opportunity in the SERPs, but they're not the most straightforward SERP feature around. Learn all about PAAs and how you can start optimizing for them today. Read this post By: Cyrus Shepard October 15, 2019 New SEO Experiments: A/B Split Testing Google's UGC Attribute SEO Tools | On-page SEO | Advanced SEO We A/B tested adding rel=\"ugc\" to our Moz Blog comment links using Distilled's optimization delivery network (ODN). Here's what we found — and what we're thinking about testing next. Read this post By: Britney Muller October 11, 2019 Featured Snippets: What to Know & How to Target Keyword Research | Whiteboard Friday | Advanced SEO Featured snippets are still the best way to take up primo SERP real estate, and they seem to be changing all the time. Today, Britney Muller shares the results of the latest Moz research into featured snippet trends and data, plus some fantastic tips and tricks for winning your own. Read this post By: Daisy Quaker October 7, 2019 How We Grew Blog Traffic by 650% in Two Years — Organically Content Marketing | Advanced SEO | Blogging Content marketing isn't easy when your industry's topics are dry. Here are the eight tactics one digital marketer used to triple blog growth for an e-commerce and manufacturing company in two years. Read this post By: Ryan Stewart September 30, 2019 6 Ways to Get More Organic Traffic, Without Ranking Your Website Advanced SEO It's not always possible for your site to be competitive in the SERPs on its own. Luckily, Ryan Stewart is here to share six ways to grow organic traffic outside of hitting those top-ranking positions yourself. Read this post By: Kristin Tynski September 23, 2019 New Opportunities for Image SEO: How to Leverage Machine Vision for Strategic Wins Advanced SEO | On-page SEO Images are driving more traffic than ever before. What are some tools you can leverage to better optimize your image SEO and capitalize on the opportunity? Read this post By: Marie Haynes September 13, 2019 E-A-T and the Quality Raters' Guidelines Advanced SEO | Whiteboard Friday EAT — also known as Expertise, Authoritativeness, and Trustworthiness — is a big deal when it comes to Google's algorithms. But what exactly does this acronym entail, and why does it matter to your everyday work? In this bite-sized version of her full MozCon 2019 presentation, Marie Haynes describes exactly what E-A-T means and how it could have a make-or-break effect on your site. Read this post By: Luca Bares September 9, 2019 The Data You’re Using to Calculate CTR is Wrong and Here’s Why SEO Analytics | Advanced SEO GSC is an imperfect tool, but it gives SEOs the best information we have to understand an individual site's click performance in the SERPs. Read this post By: Kameron Jenkins August 23, 2019 Goodbye, Generic SEO Audit – Say Hello to Customization & Prioritization Technical SEO | Whiteboard Friday | Advanced SEO Though an SEO audit is essentially a checklist, it's important to both customize your approach and prioritize your fixes to be efficient and effective with your time and effort. In today's Whiteboard Friday, Kameron Jenkins shares a better way of improving your site. Read this post By: Lily Ray August 21, 2019 FAQ, HowTo, and Q&A: Using New Schema Types to Create Interactive Rich Results Advanced SEO | Technical SEO | SEO Tools Avoid misusing Schema, or it’s possible Google might take away these fantastic opportunities to enhance our organic listings in the future. Read this post By: Gaetano DiNardi August 8, 2019 Case Study: How a Media Company Grew 400% and Used SEO to Get Acquired Advanced SEO | Marketing Industry Bottom line: quality content based on strategic keyword research that satisfies searcher intent and aligns back to business goals is essential to growth. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Advanced SEO"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Advanced SEO"
    },
    {
      "level": "H2",
      "text": "Hypothesis Testing in SEO & Statistical Significance"
    },
    {
      "level": "H2",
      "text": "Get the Bingeable & Shareable MozCon 2019 Video Bundle!"
    },
    {
      "level": "H2",
      "text": "The Featured Snippets Cheat Sheet and Interactive Q&A"
    },
    {
      "level": "H2",
      "text": "5 Things You Should Know About \"People Also Ask\" & How to Take Advantage"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "New SEO Experiments: A/B Split Testing Google's UGC Attribute"
    },
    {
      "level": "H2",
      "text": "Featured Snippets: What to Know & How to Target"
    },
    {
      "level": "H2",
      "text": "How We Grew Blog Traffic by 650% in Two Years — Organically"
    },
    {
      "level": "H2",
      "text": "6 Ways to Get More Organic Traffic, Without Ranking Your Website"
    },
    {
      "level": "H2",
      "text": "New Opportunities for Image SEO: How to Leverage Machine Vision for Strategic Wins"
    },
    {
      "level": "H2",
      "text": "E-A-T and the Quality Raters' Guidelines"
    },
    {
      "level": "H2",
      "text": "The Data You’re Using to Calculate CTR is Wrong and Here’s Why"
    },
    {
      "level": "H2",
      "text": "Goodbye, Generic SEO Audit – Say Hello to Customization & Prioritization"
    },
    {
      "level": "H2",
      "text": "FAQ, HowTo, and Q&A: Using New Schema Types to Create Interactive Rich Results"
    },
    {
      "level": "H2",
      "text": "Case Study: How a Media Company Grew 400% and Used SEO to Get Acquired"
    }
  ],
  "author": "Emily Potter\n          \n            Felicia Crawford\n          \n            Britney Muller\n          \n            Samuel Mangialavori\n          \n            Cyrus Shepard\n          \n            Britney Muller\n          \n            Daisy Quaker\n          \n            Ryan Stewart\n          \n            Kristin Tynski\n          \n            Marie Haynes\n          \n            Luca Bares\n          \n            Kameron Jenkins\n          \n            Lily Ray\n          \n            Gaetano DiNardi"
}