{
  "url": "https://ahrefs.com/blog/author/tim-soulo/",
  "slug": "tim-soulo",
  "title": "Tim Soulo, Author at SEO Blog by Ahrefs",
  "description": "Tim Soulo, Author at SEO Blog by Ahrefs",
  "content": "SEO General SEOKeyword ResearchOn-Page SEOLink BuildingTechnical SEOLocal SEOEnterprise SEO Marketing General MarketingContent MarketingAffiliate MarketingPaid MarketingVideo Marketing Data & Studies Product Guides SEOKeyword ResearchOn-Page SEOLink BuildingTechnical SEOLocal SEO Search Search Subscribe Menu Search SEO General SEO Keyword Research On-Page SEO Link Building Technical SEO Local SEO Enterprise SEO Marketing General Marketing Content Marketing Affiliate Marketing Paid Marketing Video Marketing Data & Studies Product Guides SEO Keyword Research On-Page SEO Link Building Technical SEO Local SEO Subscribe AuthorsTim SouloCMO at AhrefsTim Soulo is the Chief Marketing Officer and Product advisor at Ahrefs. For the past 12 years Tim has been a prolific and notable contributor to the industries of SEO and digital marketing.His data research studies were cited by thousands of online publications including Inc, Techcrunch and Venturebeat and he has spoken at some of the largest industry conferences around the globe, such as PubCon (Las Vegas, US), BrightonSEO (Brighton, UK) and Digital Marketers Australia Conference (Melbourne, AU).Best Articles How long does it take to rank in Google? (A study by Ahrefs) Our research will answer the most popular question in SEO world: \"How long does it take to rank in Google?\" Another number-driven study from Ahrefs. 96.55% of Content Gets No Traffic From Google. Here's How to Be in the Other 3.45% [New Research for 2023] We studied around 14 billion webpages and found that 96.55% of them get no traffic from Google. Read this post to learn how to be in the other 3.45%. How many keywords can you rank for with one page? (Ahrefs’ study of 3M searches) But how many keywords exactly will an average page rank for? That’s the question we wanted to answer (plus a few more), so we picked 3 million random Show more posts Events Conferences, Podcasts & Interviews SuperFastBusiness Live. Sydney, Australia Conference2020 Watch ChiangMai SEO Conference. Chiang Mai, Thailand ↗ Conference88 slides2019 Watch Hubspot Grow. Singapore ↗ Conference36:482019 Listen Masters of SaaS ↗ Podcast51:102020 Watch Optimist ↗ Podcast1:00:232021 Listen The ABM Conversations ↗ Podcast42:222021 Watch Incoming Chat ↗ Interview36:162021 Watch BrightonSEO. Brighton, United Kingdom ↗ Conference17:532019 Watch LemList ↗ Webinar56:152020 Watch The SaaS Marketing Show ↗ Interview26:122020 Watch PubCon. Las Vegas, United States ↗ Conference77 slides2019 Most Recent Articles How to Get Search Traffic Without Ranking for Anything Tim Soulo July 18, 2024 Don’t Start a Podcast: 10 Lessons From 10K Downloads of Ahrefs Podcast Tim Soulo July 8, 2024 There’s No Such Thing as “Accurate” Search Volume Tim Soulo March 18, 2024 How To Get Backlinks: Add, Ask, Earn, Buy Tim Soulo January 25, 2024 We Published a Children’s Book. Here’s How to Get It. Tim Soulo January 25, 2024 123The Blog Squad Joshua Hardwick Head of Content161 articles Tim Soulo CMO40 articles Mateusz Makosiewicz Marketing Researcher & Educator94 articles Si Quan Ong SEO & Marketing Educator119 articles Patrick Stox Technical SEO61 articles Chris Haines Senior SEO Specialist62 articles Andrei Țiț Product Marketing14 articles Ryan Law Director of Content Marketing28 articles Despina Gavoyannis Senior SEO Specialist23 articles Constance Tan Product Marketing6 articles Rebekah Bek Product Marketing57 articles Louise Linehan Content Marketer8 articles Search English DeutschEspañolFrançaisItalianoPortuguês中文 EnglishDeutschEspañolFrançaisItalianoPortuguês中文 © 2024 Ahrefs Pte Ltd.Pick a topic SEO General SEO Keyword Research On-Page SEO Link Building Technical SEO Local SEO Enterprise SEO Marketing General Marketing Content Marketing Affiliate Marketing Paid Marketing Video Marketing Data & Studies Product Ahrefs Tools Core Tools Site Explorer Keywords Explorer Content Explorer Site Audit Rank Tracker Free Tools Backlink Checker Website Authority Checker Keyword Rank Checker Broken Link Checker SERP Checker Close Join the Ahrefs' DigestGet the week's best marketing content in your inbox. Email Subscription Subscribe Leave this field empty if you're human: Thanks!Please check your email inbox and spam folder. We've sent you a link to verify your email. Got It",
  "headers": [
    {
      "level": "H1",
      "text": "Tim Soulo"
    },
    {
      "level": "H2",
      "text": "Best Articles"
    },
    {
      "level": "H3",
      "text": "How long does it take to rank in Google? (A study by Ahrefs)"
    },
    {
      "level": "H3",
      "text": "96.55% of Content Gets No Traffic From Google. Here's How to Be in the Other 3.45% [New Research for 2023]"
    },
    {
      "level": "H3",
      "text": "How many keywords can you rank for with one page? (Ahrefs’ study of 3M searches)"
    },
    {
      "level": "H2",
      "text": "Events"
    },
    {
      "level": "H3",
      "text": "SuperFastBusiness Live. Sydney, Australia"
    },
    {
      "level": "H3",
      "text": "ChiangMai SEO Conference. Chiang Mai, Thailand ↗"
    },
    {
      "level": "H3",
      "text": "Hubspot Grow. Singapore ↗"
    },
    {
      "level": "H3",
      "text": "Masters of SaaS ↗"
    },
    {
      "level": "H3",
      "text": "Optimist ↗"
    },
    {
      "level": "H3",
      "text": "The ABM Conversations ↗"
    },
    {
      "level": "H3",
      "text": "Incoming Chat ↗"
    },
    {
      "level": "H3",
      "text": "BrightonSEO. Brighton, United Kingdom ↗"
    },
    {
      "level": "H3",
      "text": "LemList ↗"
    },
    {
      "level": "H3",
      "text": "The SaaS Marketing Show ↗"
    },
    {
      "level": "H3",
      "text": "PubCon. Las Vegas, United States ↗"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles"
    },
    {
      "level": "H3",
      "text": "How to Get Search Traffic Without Ranking for Anything"
    },
    {
      "level": "H3",
      "text": "Don’t Start a Podcast: 10 Lessons From 10K Downloads of Ahrefs Podcast"
    },
    {
      "level": "H3",
      "text": "There’s No Such Thing as “Accurate” Search Volume"
    },
    {
      "level": "H3",
      "text": "How To Get Backlinks: Add, Ask, Earn, Buy"
    },
    {
      "level": "H3",
      "text": "We Published a Children’s Book. Here’s How to Get It."
    },
    {
      "level": "H2",
      "text": "The Blog Squad"
    }
  ],
  "author": "Tim Soulo  Tim Soulo  Tim Soulo  Tim Soulo  Tim Soulo"
}