{
  "url": "https://www.similarweb.com/blog/marketing/seo/brightonseo-2024-takeaways/",
  "slug": "brightonseo-2024-takeaways",
  "title": "BrightonSEO 2024 - Main Highlights & Takeaways | Similarweb",
  "description": "Missed BrightonSEO? Click here for a recap: Insights on AI's impact on ecommerce, zero-click searches, actionable takeaways, expert advice, and key SEO updates",
  "content": "HomeBlogMarketingSEOMissed brightonSEO? Catch up on Google Trends, AI Impact, and SEO Must-Knows Marketing Intelligence Missed brightonSEO? Catch up on Google Trends, AI Impact, and SEO Must-Knows by James Quilter , Senior Content Marketing Manager 6 Min. October 9, 2024 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Similarweb was busy on our stand catching up with the industry at October’s brightonSEO. But we still managed to squeeze in some seriously insightful sessions. From John Mueller’s updates on Google tools to the game-changing power of AI-driven content creation, there was a lot to take in. There were over 100 sessions at the event. Here’s our summary of the 20-odd ones we saw: AI in ecommerce and content creation Zero-click searches and Google’s tightening grip on the search ecosystem Google Performance Max and what it means for PPC strategies In Q4 2023, there were five core updates. One coming immediately after Mueller’s session. Will it be the same this year? Let’s start with Google and what’s coming up. John Mueller’s insights, the DMA, and SEO trends Google Search Relations team lead John Mueller discussed critical Google updates affecting SEO, emphasizing changes like removing crawl rate limits, improving robots.txt error reporting, and bulk exports to BigQuery. Here is some (admittedly shaky) footage we shot from John Mueller’s keynote talk. Changes include: Google Search Console Updates: New features like removing the crawl rate limit and improved robots.txt error reporting AI Integration: Google’s AI overviews are becoming more integrated into search, combining traditional search results with AI-generated content Structured Data: Continued importance and potential new features related to structured data Google Trends: Upcoming focus on the platform He said understanding AI’s evolving role is key to future-proofing SEO strategies. AI chatbots like Google’s AI overviews are becoming more integrated into search. So SEOs must adapt by optimizing for AI-driven results. Mueller emphasized, “If you want to appear in these AI systems, not just in Google, then that’s something you should also keep in mind.” Criticism of Google – zero clicks and the EU Digital Markets Act The EU Digital Markets Act is targeting Google’s dominance. Speaking about the act, SEO consultant Luca Tagliaferro said SEO professionals need to adjust strategies. The DMA is specifically designed to ensure Google does not use its control of search to manipulate the algorithm and put its properties first on search queries. Tagliaferro said: “The EU gave Google two months to improve flight and hotel search results or face sanctions,” exemplifying how regulation could alter competitive landscapes​. The DMA fine could be as much as 10% of global annual revenue. Zero clicks to keep users on Google There was also concern about zero clicks and a possible Google strategy to keep users on the platform with AI Overviews, indicating a shift from its age-old strategy of referring people to the right site. In the rising zero-click world, SEOs must adapt and rethink visibility metrics. As Kaizen SEO lead Ed Coles put it: “We’re heading towards a zero-click world where users stay within the Google ecosystem.” Incidentally, if you’re interested in tracking zero clicks by category Similarweb has you covered. The #1 Market Intelligence Tool Generate insights to make informed, data-based decisions. The #1 Market Intelligence Tool The power of evergreen content and trust in AI Evergreen content remains crucial for both traffic and maintaining relevance over time. Meabe emphasized, “Define your terms, establish authority, and keep it fresh.” Successful evergreen articles start with phrases like “What is” and are structured concisely for easy understanding. “Refresh content to maintain relevance and avoid outdated information,” advised Foundation marketing senior content specialist Chris Meabe. In his research, Meabe found high-performing evergreen content required the following attributes: Use concise introductions (100-150 words) to define terms effectively Articles should be between 1,200 and 3,000 words Pages should have at least 10 links (outbound and inbound) Trust is crucial with more AI content As AI becomes more integrated into content, trust remains key. Spike director Duncan Colman spoke about AI’s impact on news and media content creation. He pointed out the importance of authenticity, especially in news and content creation. His introduction referenced the AI-created spokesperson for the Ukraine government and how they managed to make it trustworthy. He said: “Authenticity is key in news publishing,” and AI-driven content should align with this principle. Video content can be used to further enhance user engagement and trust. To do this, you need to put yourself in front of the camera. Evergreen Agency director Aaron Rudman-Hawkins underscored its role in humanizing brands: “If you’re talking to everyone, you are talking to no one.” Regularly producing high-quality video content tailored to niche audiences creates deeper connections and loyalty. The continuing impact of AI on SEO and content creation AI is fundamentally transforming SEO and content creation. SEO director Sebastian Dziubek highlighted that AI tools like ChatGPT help automate repetitive tasks, saving time and allowing SEOs to focus on strategic initiatives. He said: “AI allows you to have bigger scale, faster delivery, and superior insights.” Using AI to create content at scale for large sites For large-scale websites, AI is particularly valuable. Turu’s senior SEO manager Julien Deneuville emphasized the importance of using AI to generate content at scale. But he warned: “As your website size increases, technical SEO becomes very important, but content quality remains crucial.” Interestingly, link building is less important for large sites, he said. AI tools can produce large amounts of content, but ensuring relevance and accuracy is essential to maintaining SEO performance. RAG and AI in ecommerce Retrieval-Augmented Generation (RAG) is revolutionizing the ecommerce experience by streamlining how users find products. Skittle marketing & content manager Imogen Groome explained that RAG acts “like a librarian, quickly pulling relevant information” from various data sources to answer user queries, allowing for faster, more accurate results. This AI-driven system integrates product reviews and key attributes directly into search overviews, minimizing the time users spend researching products. Integration of AI Overviews into ecommerce The integration of AI overviews into ecommerce platforms enhances user convenience by pushing products earlier in the buyer journey. By summarizing reviews and highlighting product features, AI enables shoppers to make quicker, informed decisions. This shift “removes the messy middle” of online research, according to Groome, simplifying the purchase process. These changes create new opportunities for ecommerce. By optimizing for AI-driven product discovery and leveraging sentiment analysis, businesses can better position their products in the early stages of a consumer’s journey, improving visibility and increasing conversions. Insights on Google’s Performance Max and PPC Strategy Dentsu’s PPC & SEO senior manager Emily Schaffer highlighted the evolution of Google’s Performance Max (PMax). She pointed out that initial challenges, like a lack of transparency in spending and keyword data, are being addressed with new updates. Recent improvements, such as creative testing tools, performance insights, and pacing data, provide marketers with more control and transparency. Schaffer emphasized that “adapting to AI will continue to be part of our job” in PPC. Proving PPC value is critical Proving the value of PPC campaigns is critical, as Google senior industry manager Eoin Cahill stressed the importance of aligning marketing efforts with business goals. He said: “The best, most single thing you can do to drive value within your campaigns is to share the best estimate of economic value back with the Ads platform.” He urged marketers to communicate PPC metrics in terms that resonate with business objectives, helping shift the perception of marketing from a cost center to a growth driver. Integrating PPC and SEO strategies is also vital for maximizing overall effectiveness. Schaffer stated: “If you work in paid search, go and speak to your SEO team. If you work in SEO, go speak to your paid search team,” emphasizing the need for collaboration across these channels to achieve comprehensive search optimization. By the way, nothing to do with PPC, but speaking about B2B challenges, Cahill had a great quote that’s worth adding here. “The B2B marketing language that you use today does not land in the boardroom and it doesn’t even land beyond the marketing department.” What next? So is there a core update coming? Unlike last year’s event, Mueller said nothing was planned for later that day. But as AI continues to shape the future of SEO and digital marketing, it’s crucial to stay ahead of these trends and adapt strategies to maintain relevance and drive growth. Wherever we are at next year’s brightonSEO, there is little doubt that AI will reach into all areas of digital marketing. Whether you are optimizing for AI-driven search results, enhancing your PPC campaigns, or leveraging evergreen content for long-term visibility, these shifts demand a proactive, data-driven approach. Similarweb’s comprehensive SEO tools and insights can help you navigate this evolving landscape, providing the competitive intelligence and data you need to optimize performance across SEO, PPC, content, and ecommerce. Get in touch to see how we can support your efforts to stay on top in an AI-powered digital world. The #1 Market Intelligence Tool Generate insights to make informed, data-based decisions. The #1 Market Intelligence Tool by James Quilter Senior Content Marketing Manager James is an former journalist & content strategist in B2B tech, who has previously created content for companies like EDF and X (Twitter). He also has a journalism post-grad from LCC. Related Topics: SEO This post is subject to Similarweb legal notices and disclaimers. Related Posts Marketing Intelligence 10 Ways to Get Your Website to Show Up on Google SEO by Limor Barenholtz 10 Min. Oct 22, 2024 Marketing Intelligence How to Increase Organic Traffic to Your Website: A Step-by-Step Guide SEO by Limor Barenholtz 9 Min. Oct 19, 2024 Marketing Intelligence Boost Your Website Traffic With Social Media Marketing Strategy by Itay Gross 8 Min. Oct 17, 2024 Marketing Intelligence How to Use Heading Tags? Best Practices for SEO SEO by Lior Shapira 10 Min. Oct 1, 2024 Marketing Intelligence Starting a Blog? Best Blogging Guide for Beginners SEO by Lior Shapira 17 Min. Sep 29, 2024 Research Intelligence Competitive Benchmarking: Crack the Code to Your Competitors’ Success Business Benchmarking Marketing Strategy by Monique Ellis 9 Min. Sep 10, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Missed brightonSEO? Catch up on Google Trends, AI Impact, and SEO Must-Knows"
    },
    {
      "level": "H2",
      "text": "John Mueller’s insights, the DMA, and SEO trends"
    },
    {
      "level": "H3",
      "text": "Criticism of Google – zero clicks and the EU Digital Markets Act"
    },
    {
      "level": "H4",
      "text": "Zero clicks to keep users on Google"
    },
    {
      "level": "H2",
      "text": "The power of evergreen content and trust in AI"
    },
    {
      "level": "H3",
      "text": "Trust is crucial with more AI content"
    },
    {
      "level": "H2",
      "text": "The continuing impact of AI on SEO and content creation"
    },
    {
      "level": "H3",
      "text": "Using AI to create content at scale for large sites"
    },
    {
      "level": "H2",
      "text": "RAG and AI in ecommerce"
    },
    {
      "level": "H3",
      "text": "Integration of AI Overviews into ecommerce"
    },
    {
      "level": "H2",
      "text": "Insights on Google’s Performance Max and PPC Strategy"
    },
    {
      "level": "H3",
      "text": "Proving PPC value is critical"
    },
    {
      "level": "H2",
      "text": "What next?"
    },
    {
      "level": "H3",
      "text": "10 Ways to Get Your Website to Show Up on Google"
    },
    {
      "level": "H3",
      "text": "How to Increase Organic Traffic to Your Website: A Step-by-Step Guide"
    },
    {
      "level": "H3",
      "text": "Boost Your Website Traffic With Social Media"
    },
    {
      "level": "H3",
      "text": "How to Use Heading Tags? Best Practices for SEO"
    },
    {
      "level": "H3",
      "text": "Starting a Blog? Best Blogging Guide for Beginners"
    },
    {
      "level": "H3",
      "text": "Competitive Benchmarking: Crack the Code to Your Competitors’ Success"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by James Quilter"
}