{
  "url": "https://www.similarweb.com/blog/marketing/seo/disavow-links/",
  "slug": "disavow-links",
  "title": "Do You Need to Disavow Links After Penguin 4.0? | Similarweb",
  "description": "With Penguin 4.0, the need to disavow links is very limited. Monitoring and assessing a backlink profile will always be core SEO, but disavowing may not.",
  "content": "HomeBlogMarketingSEOIs the Google Disavow Tool Still in the 2022 SEO Tool Kit? Marketing Intelligence Is the Google Disavow Tool Still in the 2022 SEO Tool Kit? Get insights now by Shai Belinsky , Senior SEO Specialist 8 Min. December 30, 2021 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Backlinks to your site are critical to build a reputation in search engine rankings. These rankings determine your placement on results pages. Backlinks can work for or against you, just like your associations in real life. Filing a disavow file is a way to ask Google to ignore any association it assumes you have with the creator of a bad backlink. This option disassociates your site from unhealthy, unethical, low-quality links connected to your site. Site owners should consider using the Google Disavow Tool only if: You were given a manual action for unnatural links You have no manual action, but Your site does or previously participated in large-scale link schemes You notice a sudden surge of spam links sent to your site You think some backlinks are unnatural When to disavow links? There are two processes: monitoring your backlinks and affecting your search engine results. Google webmasters issue penalties called manual actions. Separately and automatically, the core algorithm filters your site based on the quality of backlinks with Penguin 4.0. You can be affected by both processes at the same time. Manual actions require an equally manual response by site owners. An effect from the core algorithm requires a different strategy. Recovery from both of these actions starts with a decision on whether or not to disavow the external links. You get a manual action for unnatural links – absolutely, disavow Google issues a manual action because of unnatural links in very few cases. A manual action notifies you that Google has penalized you for violating its quality guidelines. A penalty affects your site’s rank in search engine results and could reduce traffic to your website. The reason you get a “manual action” is that you will have to manually review the links pointing to your site. Then, select the ones you want to disavow, create a disavow file, and upload it to the Google Search Console to reverse the penalty. Note: There are manual actions given for unrelated reasons other than “unnatural links.” Manual actions occur when an otherwise reliable site has unnatural links pointing to it on a large scale. This scale is so large, that Google’s algorithms are uncomfortable ignoring them. If you have overdone manipulative link building but have some quality backlinks, Google may struggle to figure out which signal factors more. In this case, you can get a manual action. You have been filtered by the Penguin update – consider a proactive disavow You might still be affected without receiving an explicit notice from Google. If you build links with black hat techniques at a large scale, the algorithm may discredit your backlinks sitewide. This happens when the situation doesn’t warrant a manual penalty, but the algorithm is still suspicious. All your backlinks, good ones included, may get a little extra side-eye. You could see a drop in organic traffic, but you’ll never know for sure that Penguin is the reason. This can be a bit frustrating as mitigation efforts for a Penguin filter are impossible to test. You don’t get any notification if you’re being affected, but instead of taking drastic action with a disavow file, focus on building up your high-quality link profile and protecting yourself in the future. Focus on EAT to combat a Penguin filter Penguin considers the percentage of good to bad links on your site in its decision-making. Google categorizes “good” backlinks as those written with expertise, authoritativeness, and trustworthiness (EAT). Source: https://static.googleusercontent.com/media/guidelines.raterhub.com/en//searchqualityevaluatorguidelines.pdf If you are considering a disavow file without a manual action penalty, reconsider. A link and “mention”-building strategy to widen the gap between good and bad backlinks may be a better way to optimize. Similarweb’s Affiliate Engagement Score identifies high-quality traffic sources within your industry. This helps you earn backlinks that fit the E-E-A-T model favored by Google. What would you need to disavow? For most of the existence of manual actions and Penguin 4.0, site owners were primarily concerned with webpages considered low-quality linking to their site. This included: Pages created only to collect links Paid links Private Blogging Networks (PBNs) Low-quality directories Excessive link exchanges Links in automated spam comments Backlinks from pages that aren’t in your target country Hacked sites Negative SEO What most of these bad backlinks have in common is that they are inorganic links to your site, AKA manipulated. Google has an updated framework for labeling the quality of information moving along the internet. To filter harmful disinformation, Google’s guidelines rank the site links it considers lowest-quality: Harmful to self or others Harmful to specified groups Harmfully misleading information Untrustworthy webpages Spammy webpages Google’s Link Disavow Tool In 2012, Google launched its “webspam algorithm” to penalize sites using manipulative link building to grow. The penalized site would then see a dramatic dip in organic traffic, sometimes sitewide or on a specific subdomain. In the process, Google realized that it wanted to give webmasters a chance to clean up their digital marketing mistakes. As such, the tech giant developed the Disavow Tool to avoid being penalized by Google into digital obscurity. The Disavow Tool can be found in the Google Search Console (GSC). Penguin 4.0 In 2016, Google launched a new iteration of the program Penguin 4.0, it was a major change. At this point, the webspam algorithm became part of the core algorithm. This meant the webspam searcher ran in real time. The algorithm is super efficient at identifying and ignoring spammy links. It simply discredits the sites that fit the profile. If you have a small amount of manipulative link building or a normal amount of spammy backlinks, Penguin will likely ignore its backlink juice for your site. The Google Disavow Tool should be your last resort Google explicitly states the Disavow Tool should be used only as a last resort. If Google hasn’t given you a “manual action,” then the tool shouldn’t concern you. It gives you a lot of warning signs to back that message up. On the Webmaster Support page, you see your first warning: Once you proceed to Google’s Disavow Tool, you immediately see another: Finally, right before you submit your Disavow File, you get another warning about the tool. Misuse of the Disavow Tool could negatively impact your Google rankings A manual action message doesn’t tell you the specific “unnatural” links that Google thinks are suspicious. The onus is on you to review all the external links pointing to your site and decide whether they’re “good” or “bad.” But, that’s not an easy decision. Top disavow expert Marie Haynes sent this screenshot of “toxic” links generated from a backlink tool to her team. In her opinion, each “toxic” site is irrelevant: the Penguin algorithm ignores them. As such, dedicating resources to disavowing them would be a waste of time. Source: https://www.mariehaynes.com/disavow-advice-2021/ This shows that the process of picking out “spammy” links is not an easy one. It’s also fraught with danger for your site. Accidentally disavowing a natural link will also really affect your site rank. Most sites don’t need the Disavow Tool Google Webmasters reveal that most sites do not have toxic links pointing to their site, unless they created them on their own. Most sites don’t have any links, let alone the massive amount needed, to disavow. Google employees don’t use the Disavow Tool without a manual action penalty Gary Illyes, a Google Webmaster Trends Analyst, runs his own site and has never submitted a disavow file. He shared in 2017 at the SMX East Conference that he hasn’t looked at his links in two years. “I don’t use the disavow file…overusing it can destroy your rankings in a matter of hours… I personally trust the Google filters.” How to disavow backlinks The process of disavowing links through the Google Disavow Tool is technically really simple. Step 1: Create a list of backlinks to disavow You need to generate a list of backlinks to your site. From there, separating good from bad is where the process gets harder (and we’ll talk about that later on). Step 2: Format your list Once you’ve decided on your final disavow list, format it correctly to upload to the Google Disavow Tool. It has to be a .txt file and no larger than 2MB. Step 3: Upload Load up the Google Disavow Tool on a webpage. On the dropdown, select the “property” that you want to disavow links on. If there’s a historic Disavow File already on the site property, you need to “Replace” it. First, make sure to download it and review it for accuracy. Disavow files are cumulative. Once you upload the disavow file, the links are submitted and your job is done. How do you identify bad links to disavow? Monitor at a high level It’s good practice to keep a high-level look at your referral traffic from organic sources. You can do this with Similarweb’s free traffic checker. A sudden spike in traffic – whether up or down – is always a reason for investigation. It could be the result of something positive or negative. Being aware of your organic traffic metrics is a vital first step in problem-solving. However, as we discussed above, connecting a traffic spike (without a manual action notice) to a specific action from Google is not provable. Correlation is not causation. Build a link profile You can use multiple backlink sources to build out your backlink profile. Go into the Google Search Console and use a backlink tool. Each tool gives you a list of your backlinks, good and bad, for you to then combine. Some tools may label external links by domain authority or toxicity level to mimic Google’s PageRank scores. These labels give you a head start in navigating your list of external links. Perform a link audit Look through these links with a critical eye. You can ask yourself the following questions to see where and if you need to take disavowal action: Are the links live? Dead links, even from reputable sites, are not good backlinks. However, Penguin 4.0 likely ignores these. Are they nofollow? Rel=”nofollow” links are a great way to keep links without having them affect your rank. Links that are nofollow are not important to this link review. Did you or someone else pay for them? If you know that the links were paid for, they deserve extra attention. If they are rel=”nofollow” or rel=”sponsored” then you don’t have to worry about them. This is the best practice now for paid links. If the paid links are not labeled that way, try to get the links changed before taking further action. Is the anchor text over-optimized or irrelevant to your niche? Irrelevant anchor text means that maybe you’re linked from unrelated, spammy sites. Overly optimized, keyword-heavy, anchor text looks suspiciously inorganic to Google. How many links have unusual top-level domains (TLDs)? Top-level domains like .com, .org, or .edu are usually indicators of quality sites. If you have a lot of traffic from countries outside of your target, that may be suspicious. Spam sites often also have unusual TLDs; .xyz is often a spam site. Visit the sites yourself Once you’ve built your suspicious list, it’s important to physically visit the sites if you can. After this, you can settle on the links you’re deciding to disavow. Follow the steps above on How to Disavow Backlinks to complete the process. Do you need to disavow backlinks? The Google Disavow Tool used to be an incredibly necessary part of a webmaster’s toolkit. Disassociating your digital property from unethical, rule-breaking sites is undeniably critical. In fact, it’s so undeniably critical that Google incorporated its own lessons about how to do this into its core algorithm. Now that Google discredits low-quality sites for you, the manual disavowal tool has lost much of its necessity. With an understanding of how the Google algorithm has evolved, you can choose the best practices for your backlink strategy: Disavow only when you have a manual action notice for unnatural links Consider the good link to bad link ratio as your first line of defense Focus on new standards in Google, like E-A-T for gaining “backlink” juice Get Real-Time SEO Insights Discover the data you need to adapt to SEO trends in an instant. Try Similarweb free by Shai Belinsky Senior SEO Specialist Shai, with 8+ years in SEO, holds a Bachelor’s and an MBA. He enjoys TV shows, anime, movies, music, and cooking. Related Topics: Content Marketing SEO This post is subject to Similarweb legal notices and disclaimers. Related Posts Marketing Intelligence Top Trending Keywords on Google: What Are We Searching For? Content Marketing SEO by Darrell Mordecai 18 Min. Jun 17, 2024 Marketing Intelligence Copywriting Psychology: 7 Ways to Make Your Content Stick Content Marketing by Leah Messenger 9 Min. Apr 23, 2024 Marketing Intelligence Digital Marketing Strategy: A Beginner’s Guide Ad Intelligence Content Marketing by Leah Messenger 7 Min. Mar 26, 2024 Marketing Intelligence How to Conduct a Social Media Competitor Analysis: 5 Quick Steps Business Benchmarking Company Research by Leah Messenger 7 Min. Feb 23, 2024 Marketing Intelligence The Essential Guide to YouTube Competitor Analysis Content Marketing by Shai Belinsky 9 Min. Jan 31, 2024 Marketing Intelligence How to Check Website Traffic: Analyzing the Digital Data Ad Intelligence Affiliate Marketing by Limor Barenholtz 14 Min. Jan 17, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Is the Google Disavow Tool Still in the 2022 SEO Tool Kit?"
    },
    {
      "level": "H2",
      "text": "When to disavow links?"
    },
    {
      "level": "H3",
      "text": "You get a manual action for unnatural links – absolutely, disavow"
    },
    {
      "level": "H3",
      "text": "You have been filtered by the Penguin update – consider a proactive disavow"
    },
    {
      "level": "H4",
      "text": "Focus on EAT to combat a Penguin filter"
    },
    {
      "level": "H3",
      "text": "What would you need to disavow?"
    },
    {
      "level": "H2",
      "text": "Google’s Link Disavow Tool"
    },
    {
      "level": "H3",
      "text": "Penguin 4.0"
    },
    {
      "level": "H3",
      "text": "The Google Disavow Tool should be your last resort"
    },
    {
      "level": "H4",
      "text": "Misuse of the Disavow Tool could negatively impact your Google rankings"
    },
    {
      "level": "H4",
      "text": "Most sites don’t need the Disavow Tool"
    },
    {
      "level": "H4",
      "text": "Google employees don’t use the Disavow Tool without a manual action penalty"
    },
    {
      "level": "H2",
      "text": "How to disavow backlinks"
    },
    {
      "level": "H3",
      "text": "Step 1: Create a list of backlinks to disavow"
    },
    {
      "level": "H3",
      "text": "Step 2: Format your list"
    },
    {
      "level": "H3",
      "text": "Step 3: Upload"
    },
    {
      "level": "H2",
      "text": "How do you identify bad links to disavow?"
    },
    {
      "level": "H3",
      "text": "Monitor at a high level"
    },
    {
      "level": "H3",
      "text": "Build a link profile"
    },
    {
      "level": "H3",
      "text": "Perform a link audit"
    },
    {
      "level": "H3",
      "text": "Visit the sites yourself"
    },
    {
      "level": "H2",
      "text": "Do you need to disavow backlinks?"
    },
    {
      "level": "H3",
      "text": "Top Trending Keywords on Google: What Are We Searching For?"
    },
    {
      "level": "H3",
      "text": "Copywriting Psychology: 7 Ways to Make Your Content Stick"
    },
    {
      "level": "H3",
      "text": "Digital Marketing Strategy: A Beginner’s Guide"
    },
    {
      "level": "H3",
      "text": "How to Conduct a Social Media Competitor Analysis: 5 Quick Steps"
    },
    {
      "level": "H3",
      "text": "The Essential Guide to YouTube Competitor Analysis"
    },
    {
      "level": "H3",
      "text": "How to Check Website Traffic: Analyzing the Digital Data"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Shai Belinsky"
}