{
  "url": "https://www.similarweb.com/blog/marketing/seo/google-search-console/",
  "slug": "google-search-console",
  "title": "Google Search Console for SEO | Similarweb",
  "description": "Even if you use a paid rank tracker you should still start your rank tracking with Google Search Console. Find out how to boost your rankings and content.",
  "content": "HomeBlogMarketingSEOHow to Use Google Search Console for SEO Marketing Intelligence How to Use Google Search Console for SEO Start your free trial by Darrell Mordecai 15 Min. May 4, 2022 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Google Search Console is a great free tool. Yes, I use a paid rank tracking tool, but Google Search Console is always a part of my SEO journey, as it gives me extra information on how I track my pages in my rank-tracking tool. In this post, I’ll show you some simple strategies to improve your SEO with Google Search Console that anyone can implement. Now although I will show you some basic reports in Search Console, the main point of this post is to show you how Search Console can directly help your SEO strategy. How to Improve Your SEO Using Google Search Console There are many ways to use Search Console to improve your SEO, I’ll be focusing on low-hanging fruit strategies that will help you to move the needle quickly on your SEO. What’s more, I’ll be showing you two ways to use this awesome free tool. Yes, you can use Search Console to: Actively improve your rankings Maintain your site by troubleshooting errors That said, Search Console does have its limitations and I’ll show you what they are by demonstrating where you need a paid rank tracker. With that out the way, strap in, and let’s get going. Let’s start with the Performance report… How to Use the Performance Report Once you’ve published some content, promoted the heck out of it, and let it sit for a while, the first place to look is position data in the Google Search Console Performance Report. Here’s why… When you publish new content on the web, it takes time for Google to figure out where to place it on the SERPs. Google will test it out in various SERPs in various positions. What I’ve noticed over the years is your post won’t always end up on the target SERP. Surprises do happen. Sometimes Google simply can’t make heads or tails of what you’ve written. When this happens, your content might find itself ranking on page four of some very strange SERPs. A quick glance at Search Console Performance Report will reveal: If Google understands what your content is about Which SERPs your content is currently displayed on To get started, scroll down to the Performance report and click on Search results. Then, enter the URL into the Page filter and go to the Queries tab. Take a look at the queries. If the keywords make sense for your post, you know that Google understands it. The next step is to get your content to the top. If, on the other hand, the keywords are somewhat bizarre or have nothing to do with what you’ve written, that means Google has no idea what you’ve written about. For instance, in the screenshot below, Search Console is showing data for a blog post about situational awareness. Now I have to admit that ‘kryptonite leveling kit’ is a fascinating keyword, guaranteed to make Superman run with his tail between his legs. The problem is, it has absolutely nothing to do with situational awareness. In fact, almost none of these keywords do. As you can see, none of the search terms make any sense for the article. When you see a situation like this, you know there is work to be done. In the example above, when I looked at the article, I realized that the target keyword wasn’t clear to me. And if it isn’t clear to me, it certainly isn’t clear to Google. To do this I covered the basics by: Changing the basic metadata (title tag and meta description) Making sure the topic was crystal clear in the introduction Including the keyword at the top of the article Here are the keywords for the same article, tracked over the last three months. All of the keywords now make perfect sense for the article. As you can see, Google now understands what the article is about. This means the article is showing up on the right SERPs. This is my first pass. Once your article is ranking for the right terms, you want to make sure that your article gets to the top of Google. To do this, look at the position data for terms that are ranking on page two. Improve Your Page Two Rankings Now that Google is ranking your pages on the right SERPs your work has just begun. If you’ve done a good job of your on-page SEO and your content promotion, your page should rank towards the top of Google, perhaps on page two and maybe even on page one. If not, perhaps you’ve chosen a keyword that’s too competitive or maybe Google doesn’t see your content as a good answer to the search query. This means, if your content is nowhere near page two for any queries, take a look at what’s ranking in the top spots for your target keyword and try to see if your content is missing anything that is included in those pages. I’ll explain this a bit more in detail later in this blog post. If on the other hand, your content is getting impressions and maybe one or two clicks, your next low-hanging fruit strategy is to find page two rankings and improve those. Now, at this point I usually move over to the Similarweb rank tracker, however, you can also do this using Search Console. Back to finding page two keywords in Search Console. First, make sure that you click Average Position. Next, make sure you’re viewing your page by entering the URL into the Page filter. Once there, click on Queries and you’ll see a list of queries with a Position column. Click on Position at the top of the Position column. This will order your queries from the highest position to the lowest. Now scroll down until you see positions that are higher than 10, but not higher than 20. These are your page two queries. Your goal is to get your URL to show up on page one for these queries. Generally, you can do this by answering these queries in the body of your blog post. To do this, look for a keyword that: Your URL ranks on page two Represents a user query that could be thoroughly answered by your content If on the other hand, you don’t see anything that makes sense to include in your post, but you have found a query that might make an interesting blog post, you might have found a great cluster content opportunity. So, here is an example of a query that you could add to your post… If we go back to the blog post about situational awareness and look in Search Console we easily find keywords that are ranking on page two that make sense to be added to the post. As you can see in the screenshot above, ‘situational awareness activities’ has an average ranking position of 16.1. This means it’s ranking towards the middle of page two. Also, answering this query in the blog post makes perfect sense as the post deals with situational awareness in a general way. Adding activities and exercises seems like a natural next step. At this stage, it’s important to confirm that the term gets enough search volume to justify spending the time to write a new subsection for the article. You can get this data from your keyword research tool. Before writing anything, you must know how Google understands the term so that you can write an answer that Google sees as a good answer to the query. To do that, you’ll need to do some SERP analysis. SERP Analysis SERP analysis is a quick easy way to understand what Google considers as good content that convincingly answers the query. To do SERP analysis, type the query into Google and see what’s ranking at the top. Usually by reading the top three or four posts will give you a good indication of what Google expects to see in an answer to this query. Improving Your Content At this point, you should have some search terms that, with a slight push, you could rank on page one. You should also understand what top-ranking content should look like based on the top-ranking URLs in Google. The next step is to include similar content in your post. Although this is the process that I use, it’s important to make sure that you are not just ‘SEOing’ your content. In other words, use the top-ranking website content as a guide. However, don’t just rewrite their content in your own words. Instead, use their content to see what points to add. Make sure to expand on it and make it better than what’s currently ranking. In other words, think of the user first. Also, make sure that whatever you add will enhance your content. It has to make sense in the context of what you have already written. If it doesn’t, it will provide a bad user experience, which could hurt your rankings. Once you’ve improved the quality of your content, the next go-to strategy to improve your rankings is internal linking. Using the Links Report for Internal Linking So you’ve improved your content and you’re hoping to see it rising in the rankings. As an SEO it pays to rely on more than one tactic to improve your rankings. I’ve learned from experience that improving your internal links is one of the fastest ways to see your rankings improve. Search Console is a great place to do this. Improving Anchor Text To get started, scroll down to the Links tab in the right-hand menu. Once there, check out the Internal Links report. If you have hundreds of pages you can use the filter to find the URL you are working on. The report will show you the number of internal links pointing to the page. If you click on the URL, Search Console will show you all the pages on your site that are linking to your URL. This is super useful if you are optimizing your anchor text. That said, I personally find it frustrating that Search Console doesn’t show you the anchor text. If you want to see anchor texts, you’ll have to either go to the actual pages that are linking to your target page or use another tool. Once you’ve improved your anchor text and added some new internal links to your blog post, you can give the rest of your site a boost by finding pages that have a small number of internal links. Improve Pages With Almost No Internal Links As an SEO you are most likely always looking for opportunities to improve your rankings. Especially low-hanging fruit that won’t take hours to implement. The Search Console Internal Links report can show you many easy-to-implement internal link opportunities. Simply go to the report. You’ll notice that the report will show you the URLs with the most internal links at the top. If you click the top of the report where it says ‘Internal Links’ the report will invert, showing URLs that have a minimum of one internal link pointing to them. You’ll now see the URLs with the least amount of internal links. Although it’s not always appropriate, you might find older content that could use a few more internal links. If that content is high quality and relevant, it’s likely that some well-structured internal links will result in a quick boost in rankings. Another way to use Search Console to improve your SEO is to increase your click-through rates. Improving Your Click-through Rate Use Search Console to improve your click-through rates by looking for pages that are ranking at the top of Google and that get a large number of impressions but have a low click-through rate. In the screenshot above, the bottom query got 4648 impressions over a period of three months. What is interesting is the URL is ranked in position one but only has a 0.5% click-through rate. What could possibly be causing the low click-through rate? In all likelihood, there is something attracting more attention than your number one listing. This could either mean there are SERP features pushing the listing below the fold or there are Google Ads that are attracting attention away from the organic results. What’s more, Google might be answering the query in the SERP meaning there is no reason for your audience to click through to your page. If I were using a paid rank tracker, I could immediately see if there are SERP features ranking on the SERP. However, Search Console won’t tell you this. Instead, you will have to type the term into Google and take a look for yourself. SERP Features Pushing Your URL Below-The-Fold As you can see in the screenshot below, which is showing the Google SERP for the term ‘architectural software’, the Featured Snippet is gigantic, taking attention away from the organic result below it. In a case like this, your best bet would be to try to win the Featured Snippet. Google Ads Taking Attention Away from Your URL As I mentioned above, sometimes your URL’s CTR is low due to Google Ads drawing attention away from your URL. In the screenshot above, I typed the term ‘architectural software’ into Google. It’s important to note that this is the exact same term that I showed you in the previous example. The reason this screenshot is showing ads while the previous one didn’t is for the second one, I specifically looked at the results that are showing in the United States while for the first one I made the search outside of the United States. I used I Search From to do this. Looking at the screenshot, you’ll notice that not even the Featured Snippet is above the fold due to the ads that appear on the SERP. In a situation like this, you have very little chance of increasing your click-through rate in a substantial way. However, with everything in SEO, it really depends. You should first ask yourself, is the content country-specific? If not, you might still get substantial website traffic. You see, people running Google Ads only target countries where they expect to make the most money. This means the ads are not likely to show up in all countries. Ranking your content on the same SERP in countries where the ads are not showing should result in an increase in average click-through rates. What’s more, since ads are being shown for this term, you know that the term has commercial intent. This means you might still be able to make sales. In a case like this, it might make sense to optimize for the Featured Snippet in the hopes that your content will rank at the top of Google in different countries. To see what countries your content is ranking in, click on the Countries tab. If you see that your content ranks globally, it might make sense to try to increase the click-through rate by optimizing for the Featured Snippet. However, if you feel that ranking your URL in other countries is not worth the time or effort, your only chance of stealing attention away from the ads is to create your own ads or to rank on a different SERP. Now that you know how I use Search Console to improve my rankings, I want to point out one of the areas that I feel Search Console is lacking in. Core Web Vitals There’s no secret that Google now includes user experience in its algorithms. This means as an SEO you must be concerned with how easy the content is to access and interact with. Although the primary way to rank content is to make sure that it’s relevant, answers the search intent, and is authoritative, having a great user experience is considered a minor ranking factor. With Google’s Page Experience update including Core Web Vitals, you must keep an eye on site speed. Search Console is the first place to optimize your Core Web Vitals. To get started, scroll down to the Experience tab and click Page Experience. When you do that you’ll see an overview of your Page Experience metrics. From here, if you see any issues you can click through to the Core Web Vitals report. In the Core Web Vitals report, you can see how many URLs are: Poor Need Improvement Good If there are URLs that are either poor or need improvement, scroll down and you’ll see a list of issues you can work on. Now even though Core Web Vitals is a relatively lightweight ranking factor, it’s important to understand that successful SEO results from getting a combination of things right. This means you shouldn’t neglect site speed. URL Inspection Tool There are times when your content is just not showing up the way you’d expect in the search results. If you’ve done a great job of creating well-researched authoritative content and your on-page SEO is on point and your content is simply not showing up, you might have an indexing problem. To see if your page is indexed correctly, drop the URL into the inspect search box in the top bar. This will bring you the status of your page based on Google’s last crawl of the page. As you can see from the screenshot above, this report is broken up into three sections. Present on Google tells you if your page is indexed properly or if it has issues Coverage tells you how the Google discovered the URL Enhancements will tell you structured data details as well as AMP and mobile issues If you spot any issues, once you’ve fixed them, click the Test Live URL button in the top right-hand corner of the page. This will compare the live page with the indexed URL. I’ve not gone into all the details in this post but if you have any questions about this tool, check out the URL Inspection Tool on Google’s Help Center. Now that you are working on how Google indexes your pages, you might want to deal with any crawl errors. This is pretty easy to do with the Coverage Report under the Index tab. Coverage Report Although this blog is mainly about how you can incorporate Search Console into your SEO strategy, no post about Search Console would be complete without mentioning the Coverage Report. The reason this is so important is, that even with the best strategy in place, your site traffic won’t improve if you have technical issues or crawl errors. Enter the coverage report. You can find the Coverage Report under the Index tab in the right-hand menu. The report will show you: Errors Valid with warnings Valid Excluded As time is limited, you should generally focus on the Errors tab. Errors stop the pages from being indexed. This means the pages won’t show up in Google search. Simply click on the Error check box and scroll down to the Details table to see what to work on. Once you’ve fixed all of your Error pages, you should look through your Warnings. It’s likely that you’ll find some errors that are preventing some of your pages from being indexed. Once you’re done there, look over your Excluded pages. Search Console includes pages that it assumes were intentionally excluded. It makes sense to look through these pages just to make sure that’s the case. Now that you’ve looked at the data in Search Console the next step is to find your most profitable keywords and track them in a rank tracker. Use Your Rank Tracking Tool You can use Search Console data to help you pick high-impact keywords to track. Once you’ve done that, it’s important to add them to your rank tracker. The reason this is so important is a rank tracker will give you granular data that you simply can’t find in Search Console. As you can see above, the Similarweb Rank Tracker shows you keyword metrics including Search Volume, Position Trend, and more. What’s more the tool allows you to track keyword clusters separately with Keyword Tags. Keyword Tags allow you to see how each cluster is performing, giving you separate visibility metrics such as: Visibility Weighted Average Position Clicks You can also see your keyword tags in table form. This way you can easily see how each keyword cluster is performing. By doing this you can make high-level strategic decisions giving your the metrics to decide on which aspects fo your site to focus on. Want to go more granular? You can see the keywords in your tags. This will help you easily find quick wins or work on a separate strategy within each cluster. You can go more granular by seeing how the top 10 results are performing over time as well as see a SERP snapshot. As you can see, a rank tracker allows you to do similar actions but the data is arranged for you to improve your SEO performance at scale. Google Search Console – A Powerful Free Rank Tracking Tool By now you should understand some basic ways you can use Google Search Console to improve your rankings. You should also know where it’s lacking and how paid rank tracking tools will help you fill in some of the gaps. The main takeaway is when used together with the right paid tools, Google Search Console will fill in some basic gaps in you might find just using basic paid tools. On the other hand, once you have your initial analysis you can use a paid rank tracking tool to give you more granular data that will help you improve your rankings and visibility. However, as a stand-alone SEO tool, Search Console packs a powerful punch by giving you valuable insights that can really move the needle on your SEO. by Darrell Mordecai Darrell creates SEO content for Similarweb, drawing on his deep understanding of SEO and Google patents. Related Topics: SEO This post is subject to Similarweb legal notices and disclaimers. Related Posts Marketing Intelligence 10 Ways to Get Your Website to Show Up on Google SEO by Limor Barenholtz 10 Min. Oct 22, 2024 Marketing Intelligence How to Increase Organic Traffic to Your Website: A Step-by-Step Guide SEO by Limor Barenholtz 9 Min. Oct 19, 2024 Marketing Intelligence Boost Your Website Traffic With Social Media Marketing Strategy by Itay Gross 8 Min. Oct 17, 2024 Marketing Intelligence Missed brightonSEO? Catch up on Google Trends, AI Impact, and SEO Must-Knows SEO by James Quilter 6 Min. Oct 9, 2024 Marketing Intelligence How to Use Heading Tags? Best Practices for SEO SEO by Lior Shapira 10 Min. Oct 1, 2024 Marketing Intelligence Starting a Blog? Best Blogging Guide for Beginners SEO by Lior Shapira 17 Min. Sep 29, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "How to Use Google Search Console for SEO"
    },
    {
      "level": "H2",
      "text": "How to Improve Your SEO Using Google Search Console"
    },
    {
      "level": "H2",
      "text": "How to Use the Performance Report"
    },
    {
      "level": "H3",
      "text": "Improve Your Page Two Rankings"
    },
    {
      "level": "H3",
      "text": "SERP Analysis"
    },
    {
      "level": "H3",
      "text": "Improving Your Content"
    },
    {
      "level": "H2",
      "text": "Using the Links Report for Internal Linking"
    },
    {
      "level": "H3",
      "text": "Improving Anchor Text"
    },
    {
      "level": "H3",
      "text": "Improve Pages With Almost No Internal Links"
    },
    {
      "level": "H2",
      "text": "Improving Your Click-through Rate"
    },
    {
      "level": "H2",
      "text": "SERP Features Pushing Your URL Below-The-Fold"
    },
    {
      "level": "H2",
      "text": "Google Ads Taking Attention Away from Your URL"
    },
    {
      "level": "H2",
      "text": "Core Web Vitals"
    },
    {
      "level": "H2",
      "text": "URL Inspection Tool"
    },
    {
      "level": "H3",
      "text": "Coverage Report"
    },
    {
      "level": "H2",
      "text": "Use Your Rank Tracking Tool"
    },
    {
      "level": "H2",
      "text": "Google Search Console – A Powerful Free Rank Tracking Tool"
    },
    {
      "level": "H3",
      "text": "10 Ways to Get Your Website to Show Up on Google"
    },
    {
      "level": "H3",
      "text": "How to Increase Organic Traffic to Your Website: A Step-by-Step Guide"
    },
    {
      "level": "H3",
      "text": "Boost Your Website Traffic With Social Media"
    },
    {
      "level": "H3",
      "text": "Missed brightonSEO? Catch up on Google Trends, AI Impact, and SEO Must-Knows"
    },
    {
      "level": "H3",
      "text": "How to Use Heading Tags? Best Practices for SEO"
    },
    {
      "level": "H3",
      "text": "Starting a Blog? Best Blogging Guide for Beginners"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Darrell Mordecai"
}