{
  "url": "https://www.similarweb.com/blog/marketing/seo/google-entities/",
  "slug": "google-entities",
  "title": "What Are Google Entities and How To Do Entity SEO | Similarweb",
  "description": "What are Google entities? In this post, you'll learn what they are and how to use them to build an entity SEO strategy. Click here to get started.",
  "content": "HomeBlogMarketingSEOWhat Are Google Entities and How To Do Entity SEO Marketing Intelligence What Are Google Entities and How To Do Entity SEO Get the SEO strategy guide by Darrell Mordecai 18 Min. January 2, 2024 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Do you actually know what a Google entity is? Because entities are not keywords. And strategically you should treat entities differently to keyword research. Entities are the first foundation you need to understand when learning entity SEO. Curious to know why? Let’s take a deep dive into what Google SEO entities are and how they are used to build semantic relationships. In this post, we’ll clarify: What a Google entity is What the various component parts are What the Topic Layer is How you can get started with entity SEO Understanding this will help you to research topics on your own. Because semantic SEO is not just a few tactics and best practices, a real understanding can help you build strategies to get more organic traffic for your business. What are Google entities? An entity is a piece of information in Google’s Knowledge Graph database that defines a thing or concept that is singular, unique, well-defined, and distinguishable. These entities are often characterized by name, type, attributes, and relationship to other entities. Entities give Google the understanding necessary to answer user queries in search. Now, with that definition in hand, you might be wondering, surely an entity refers to an object in the real world? How do entities include concepts? If you asked that question, we’d be inclined to agree with you, people generally associate the word ‘entity’ with things in the real world. But, as we mentioned before, entities are meaningful units for organizing information on the web. From the perspective of organizing information, there is no real difference between abstract nouns (such as concepts, colors, and feelings) and concrete nouns (or real-world things). Entities are meaningful units for organizing information on the web… there is no real difference between abstract nouns and concrete nouns. Tweet this Google’s database, therefore, treats them in the same way as it treats real-world entities. What are the benefits of Google entities? According to Google, entities are meaningful units for organizing information and help its search engine to: Understand user queries Answer these questions Google solves a colossal problem. It organizes more than 50 billion pages of information on the web to make it easily searchable by its users. This means Google must ‘understand’ and categorize: User queries Web content To better solve this, Google and other search engines moved over from lexical search engines to semantic search engines. Lexical search engines find keyword strings in search queries and match them with those keywords in web content. This is an inaccurate way to search for information and led to the good old days of keyword stuffing. Semantic search, on the other hand, is an attempt to improve the accuracy of search results by analyzing the meaning of the words in the user’s search query and matching it with content that perfectly answers the query. To do this Google’s natural language processing algorithms are designed to ‘understand’ human language. Entities are meaningful units for organizing information. In order for Google to ‘understand’ search queries and match them up with the right content, Google needs to identify which entity the search query is referring to and how it relates to other entities. For example, if you were to type the query ‘Who invented situational awareness?’, Google somehow knows that the answer is ‘Oswald Boelke.’ Below, you can see that Google highlights Oswald Boelke. Featured Snippet defining Situational awareness Only a semantic search engine can answer a search query with a result that doesn’t include the query string. Now, before we get to entity SEO, let’s examine what makes up an entity. The anatomy of a Google entity What would you see if you were to look at a Google entity through a (metaphorical) microscope? Entities are made up of different parts, and understanding each part will help you see how they relate to one another. Understanding their relationship will help you create content that Google ‘understands’ and doing that could help you to rank higher and get more traffic. The first thing to understand is that entities exist in a catalog called a Knowledge Graph. What is the Google Knowledge Graph? Google’s Knowledge Graph is a repository of information used to store entities together with their descriptions and attributes. What’s more, the Knowledge Graph also structures the entities in a way that makes connections between entities and concepts. Understanding this structure is a key concept in understanding Google entities (more on this later). Google’s Knowledge Graph gets all of this entity information from resources such as: The CIA World Factbook Wikipedia Wikidata Google also gets entity information from the open web. This means Google will get entity definitions, categories, entity types, entity properties, and more from these sources. Google then stores all of that information in structured form in the Knowledge Graph. Now that you are familiar with the environment in which entities exist, let’s examine the entities themselves. Entities and their properties As we mentioned above, entities are made up of component parts. Let’s examine these parts separately. 1. Unique Identifier Simply put, an entity knowledge base needs to have a way to identify each separate entity. This means each entity needs its own unique identity. To see a unique identifier in the wild, let’s take a look at Google’s Knowledge Graph Search API explorer. In the screenshot below, we’ve typed the entity, John Lennon, into the query field. Google’s Knowledge Graph Search API explorer If you scroll down you’ll see “@id”: “kg:/m/01vsl3_” Unique Identifier for John Lennon’s Google entity This is the unique identifier. You’ll notice that the unique identifier is not the entity’s name. It’s an identifier that’s unique and machine-readable. Now, you might be wondering why Google doesn’t just use the entity’s name. The reason is that many entities have identical names, while the identifier is unique to each entity, allowing Google to easily distinguish them. 2. Entity name Each entity has a name. Unlike unique identifiers, entities may share names. For instance, Taj Mahal is both a historical building and a musician. Taj Mahal appearing in Google as a musician and a historical building What’s more, some entities might be known by more than one name. For example, typing Louis Armstrong or Satchmo into Google will bring similar results. These alternative names are considered aliases. So, if each entity has a unique identifier, why do they need names? The entity name is important because, even though the unique identifier is a way for the search engine to identify the entity, the name is how an actual person will linguistically identify the entity. People will include the name of the entity in search queries as well as in content. Google, on the other hand, will see the name in a search query or in a piece of content and, based on context, attempt to match the name with the entity ID in the Knowledge Base. As you can see in the screenshot below, the entity name is John Lennon (in case you hadn’t guessed. ) Entity name for John Lennon If you want to see the entity name in the wild, type it into Google, and if Google is confident it knows the entity, the name will be displayed at the top of the entity’s Knowledge Panel. Knowledge Panel for John Lennon’s Google entity 3. Entity types Entities are grouped into entity types. Entity types are simply categories that group entities with similar properties together. Typical entity types are people, places, things, or movies. So, looking back in Google’s Knowledge Graph Search API explorer, you can see the entity type by looking for “@type”. (Apparently, to Google, John Lennon is both a thing and a person.) “Person” and “Thing” entity type 4. Entity attributes Entities are generally characterized by sets of attributes. Each entity type will typically have its own sets of attributes. So, for instance, entities categorized as people will typically have attributes such as date of birth, family members, height, etc. Places, on the other hand, might have latitude, longitude, country, postal code, etc. as main attributes. Sometimes, these attributes are entities in their own right. For instance, country. When this happens, these attributes are not treated as attributes, but as related entities. This is particularly important for SEO, and we’ll explain why later in the post. To see attributes in the wild, let’s take a look at John Lennon’s Knowledge Panel. About section for John Lennon’s Knowledge Panel As you can see, the Knowledge Panel tells you: When and where he was born When and where he was assassinated His spouses His children His siblings The words in blue are attributes that are also entities in their own right. If you click on any of them, Google will redirect you to that entity’s SERP. 5. Related entities Related entities describe how entities relate to each other. For example, to Google, both John Lennon and the Beatles are entities that are associated with one another. The relationship is John Lennon is a member of the Beatles. To see the relationship for yourself, type ‘the Beatles members’ into Google. Members tab on the Beatles Knowledge Panel Above, you can see all the entities that Google considers to be members of Beatles the entity. Google uses these entity relationships to answer user-generated questions. So, for instance, in the example above, by searching for ‘Beatles members’, Google understands that the user is, in essence, asking, ‘Who are the members of the Beatles?’. Google already ‘understands’ the relationship between the Beatles and its members and is able to surface that information in the SERP feature above. Understanding how entities relate to each other is super powerful information when it comes to entity SEO. By including related entities in your entity content, you’ll be building context for Google to understand what entity your content is about. We’ll explain how to do this later in the post. How entities have changed search By using entities as a unit for categorizing information, and by organizing entities into relationships, Google is able to create a rich search experience. This means when you search Google, you often see SERP features that include related entities and entity attributes. This gives Google the ability to bring short answers to users’ questions. You can often see these answers featured in SERP features. As a side point, since Google presents entity information in SERP features, they are a rich source of information when you are trying to understand Google’s Knowledge Graph information, and analyzing them is crucial for entity SEO. For instance, if we type the word ‘weather’ into Google, Google can figure out that I’m requesting information about the entity’ weather.’ Google then looks for the answer to this question by looking at sites in its index. Google then compiles the information in a SERP feature. Google’s weather feature Now, before we get into how to do entity SEO, there is one more crucial concept you must understand. What is the Topic Layer? The Topic Layer is a semantic map organizing Google’s Knowledge Graph entities into topics and subtopics. This helps Google’s algorithms understand how entities within a topic relate to each other. The topic layer enables Google to refine the search results and enhance user experience by powering SERP features like Knowledge Panels, making search more nuanced and conceptually relevant. In 2018, Google added the Topic Layer to the Knowledge Graph. Before the Topic Layer existed, Google was already able to connect entities and present them in SERP features. So what did Google add by creating the Topic Layer? The Topic Layer was designed to help Google users by looking at search as a journey rather than only a way of getting quick information. There are topics that are too complex to take in quickly, and users might take many searches over multiple days. The Topic Layer was designed to help users explore a topic by providing ways to keep track of their searches and by suggesting things to explore next.This is a new paradigm in how Google helps its users. Google was great at answering questions. Google can now help users along greater search journeys. To see this for yourself, take a look at the results page for the search term’ marketing’. Knowledge Panel for Marketing As you can see in the Knowledge Panel, Google presents subtopics such as: Purpose Goals KPI These are all subtopics within the general topic of marketing. What’s more, Google also suggests other related searches, including: Internet marketing Marketing strategy Sales Social media marketing Again, these are all ways to arrange Google’s entities into topic/subtopic hierarchies. So, if marketing is the general topic, then internet marketing, marketing strategy, sales, and social media marketing are all subtopic entities. This means if you want to succeed in entity SEO, structure your content to align with how search engines organize information into topics and subtopics. Start your entity SEO campaign now Easily find semantically related keywords with the freshest, most accurate keyword data now. Go to Similarweb How to do entity SEO Now that you understand what Google SEO entities are and how Google uses them to answer user queries, it should be obvious that semantic SEO is much more than just including your keywords in your metadata and headers. At a high level, the goal of entity SEO is for your site to become an authority on your chosen entity. You do that by creating a thorough network of content that covers your entity and all of its related entities. You must then build that content into your site architecture in an easy-to-understand, machine-readable hierarchy. Sounds like a mouthful? Don’t worry, we’ve got you covered. There are three basic steps to entity SEO: Research how Google understands your entity Build site-wide entity connections Conduct on-page entity SEO Let’s get started. 1. Research how Google understands your entity In this section, we’ll show you how you can understand how Google understands your entity. Because if you present your content in a way that the search engine can understand, you’ll be able to establish your site as an authority. Get this wrong, you might just confuse Google. Confuse Google, and your content is likely to find itself gathering dust in a forgotten corner of Google’s index (read: Google Page Two ). Google has site-wide metrics that help it understand what your site is about. Your goal is to communicate your authority by including a well-structured content network that is easy to navigate and covers your topic thoroughly. (Or at least more thoroughly than your SEO competitors.) In this section, we’ll show you how to find entities for SEO optimization. Although we have a blog post explaining how to create a topical map, here are some ways to get started. The key is to try to compile a list of all the SEO entities that relate to your topic and structure that information into a topic/subtopic hierarchy. #1: SERP analysis Start by Googling your entity. The key here is to go broad with a head term. When you do that, Google assumes you are at the beginning of your search journey and will use information in its Knowledge Graph to present the topic at a high level in the SERP. You can Google your entity by looking for your broad topic, such as: Gardening Clint Eastwood If you find a Knowledge Panel, you are in luck. Knowledge Panels get their information directly from the Knowledge Graph. This will give you a clear understanding of what entities are connected to your main topic. Below, you can see a Knowledge Panel for the entity Charles III. Knowledge Panel for Charles III Just from this section alone, we can see the entity is connected to: Buckingham Palace London United Kingdom Prince Harry Duke of Sussex And more This means if you were to create a site about Charles III, these are some obvious SEO entities you’d have to include in your site content. Now, if you don’t find a Knowledge Panel, look for a Wikipedia page. #2: Analyze Wikipedia Google gets the majority of its entity information from Wikipedia pages. (You can see this in the wild as the majority of Knowledge Panels get their About section from Wikipedia). Wikipedia is an entity research gold mine. Just look for your entity in Wikipedia and scan all of the internal links. If the page you are on represents an entity, the pages that your page links to represent entities that are related to your target entity. For instance, below, we see a part of the Wikipedia page for the rock band Led Zeppelin. Led Zeppelin’s Wikipedia page Scanning the internal link anchor text, we see related entities such as: Robert Plant Jimmy Page John Paul Jones John Bonham Blues Folk music This research will help you understand entities closely related to your main entity or topic. Compile a list and try to map out how these entities are connected to each other. Another way to find SEO entities to include in your content is through SEO competitive analysis. #3: Competitor analysis An important part of your analysis is to understand how the web’s most successful sites include entities. You can do this by looking at their keyword clusters. Now, it’s important to understand that keywords are not entities, but keywords do include entity information that you can include in your analysis. The key is not to focus on the actual keyword phrases but to find the general topics that those phrases are referring to. For instance, below, the Similarweb Keyword Phrases report presents keyword phrases for the site simplisafe.com. Similarweb Keyword Phrses report analyzing Simplisafe website Looking at the phrases, you can see a list of topics including: Home security system Home security camera Glass break sensor Outdoor security cameras This is all good information. If you want to go a bit deeper and understand what entities relate to any one of these clusters, just click it, and you’ll be redirected to the Keywords report. For instance, below, we’ve clicked on the home security cameras cluster, and Similarweb is displaying the keywords for that cluster. Similarweb’s Keywords report for ‘home security cameras’ Scanning the keywords in the report, we can break down the topics into subtopics, including: Wireless home security cameras Home security camera reviews Home security cameras without subscription DIY home security cameras Outdoor home security cameras Now that you’ve researched the entities that relate to your general topic, it’s time to move on to the next step. Start your entity SEO campaign now Easily find semantically related keywords with the freshest, most accurate keyword data. Go to Similarweb 2. Build site-wide entity connections According to Google’s John Mueller, a structured site architecture helps Google understand how things are connected. This means Google analyzes your site structure, including: URL hierarchy Breadcrumbs Internal links The more logically you can structure your site, the more clarity you’ll give to the search engine. This will not only help Google understand what your site is about, but it’ll also help users navigate your content. In the example below, the general topic (or entity) is ‘travel.’ ‘Destinations’ is a subtopic, and Paris or Milan are related entities that exist logically within this topic/subtopic hierarchy. example.com/travel/ example.com/travel/destinations/paris example.com/travel/destinations/milan If you are not sure how to structure your site, try researching how the most successful sites in your industry structure their content. Similarweb’s Web Category Analysis Search Leaders report can help with that, too. Similarweb’s Web Category Analysis Search Leaders report for the Books and Literature industry in the US You don’t need to copy the site structure of leading competitors in your industry; instead, let their research inspire you. Crafting a site structure that’s more user-friendly than your competitors could give you a competitive edge over them. Now that you’ve built entity hierarchies into your site architecture, let’s move over to your on-page content. 3. On-page entity SEO Google crawls your site content and breaks it down semantically. This means your on-page site content must be optimized for entity SEO. There are three aspects to focus on: Semantic header structure Answering user intent Building entity connections within your content Semantic header structure Semantic header structure is similar to site structure but relates to how you structure each page. This simply means making sure that your H2s, H3s, etc., follow a logical structure. (See the table of contents bar on the left for an example of how this blog is structured.) It’s important to understand that a webpage is designed around one topic or is designed to answer a main user query. Think of a page as a mini-topic in its own right. This means your headers should be structured to break down your page content in a clear, digestible way. H1 – Primary entity focus Begin with the H1 header, explicitly featuring the primary entity or topic of your content. Keep it concise and indicative of the main theme. H2 – Subtopics and supporting entities Use H2 headers to introduce subtopics or supporting entities related to your main theme. This reinforces the primary entity while providing a clear structure. H3 – Deeper context and details H3 headers can delve further into specific aspects or details associated with subtopics. This adds depth to your content and signals relevance to search engines. For example: <h1>Unlocking Wellness: Embracing Healthy Eating Habits</h1> <h2>The Foundation of a Balanced Diet</h2> <h2>Exploring Nutrient-Rich Foods</h2> <h3>The Role of Macronutrients</h3> <h3>Essential Micronutrients for Optimal Health</h3> <h3>Creating Delicious and Nutritious Recipes</h3> <h2>Meal Planning for Long-Term Health</h2> Notice that the font type and size may often vary to emphasize this hierarchy for your readers as well. Answering user intent Since semantic search engines are designed to answer the user’s search intent, one simple way to increase page relevance is to answer the search query at the top of the page. This not only increases relevance but also makes for a better user experience. This might require some restructuring of content, as often blog content tends to take a while to get to the point. Imagine your blog post serving more than one user. Some are looking for a quick answer to a question. Others are looking for an in-depth analysis. Give a short answer at the beginning of the post for those looking for a short answer, and follow that with your in-depth analysis. Building entity connections within your content One way Google understands what your content is about is through context. At a high level, every page is focused on answering a search query. To answer a given query, Google analyzes the entities on a page. If you write about a certain topic, you will likely include common context words or entities. For instance, if you are writing about Bruce Lee, you will likely mention Jeet Kune Do at some point. This is because the entities Bruce Lee and Jeet Kune Do are connected. Below, you can see the SERP for Jeet Kune Do with the entity Bruce Lee highlighted. Google SERP fro Jeet Kune Do Bruce Lee appears literally ten times on this SERP. This means Google understands that these entities are connected. The more of these closely related entities you include in a piece of content, the more clear the content will be to Google. There are two methods for achieving this. First, you can utilize the “mystery word game,” a brilliant little trick by Laurent Bourelly. Simply write about your entity, but replace the entity’s name with a variable whenever you mention it. Here’s an example of what this might look like: A trailblazing figure in martial arts and cinema x’s impact extends far beyond the screen. Pioneering the philosophy of Jeet Kune Do, he emphasized fluidity and efficiency, revolutionizing martial arts while leaving an enduring legacy that resonates in both combat sports and philosophical discourse. If, after writing a paragraph, it’s obvious who or what you are writing about, you’ve most likely included enough content keywords. Another way to do this is to look at the top-performing content for your target keyword through the lens of Google’s Natural Language API demo. Below, we’ve entered the top-performing content for the keyword ‘Bruce Lee body’ into the demo, and as you can see, the tool shows a breakdown of the entities included in the text. Entities in Goolge’s Natural Language API demo Since the content goes into Bruce Lee’s diet and exercise routine, you can see fitness and health-focused entities on the page, such as: Bench press Bruce Lee diet Bruce Lee workout Intensity training McDonalds (everything in moderation, right? ) Track your topics with Keyword tags Since entity SEO is about how you present your target entity and its related entities in a topical hierarchy, the best way to track your campaigns is to segment your subtopics in your rank tracker. The best way to do that is to use keyword tags (within Similarweb, of course!). Below, we are tracking the site chuckjones.com. We’ve set up separate keyword tags for each subtopic on the site. Similarweb’s Rank Tracker Tags report By setting your search campaigns up this way, you can analyze each subtopic separately. Traffic for Wile E Coyote keywords Google entities — What’s next? Hopefully, this post has shed some light on the topic of entities in search. You now understand entities and have the basics to include entity SEO in your organic search marketing strategy. The way we see it, knowledge is power if you figure out how to use it wisely. So if you want to take your knowledge of semantic SEO to a place where you can use it to create a semantic SEO strategy, the next step is understanding the difference between keywords and topics. And if you’re prepared to put this knowledge into action, try using Similarweb. Download your copy of the indestructible SEO strategy guide All the elements you need to build a successful SEO strategy Get the guide now FAQs What is the difference between entities and keywords? Entities are pieces of information in Google’s Knowledge Graph that define a thing or concept that is singular, unique, well-defined, and distinguishable. Keywords on the other hand are strings that represent the words a user uses to search Google. What is entity search? Entity search involves using semantic understanding to connect and retrieve information based on specific objects, people, or concepts rather than relying solely on keyword matching. It enhances search accuracy and relevance. What are three examples of Google entities? 1.Barack Obama: Entity Type: Person Description: 44th President of the United States Eiffel Tower: Entity Type: Place Description: Iconic landmark in Paris, France Photosynthesis: Entity Type: Concept Description: Process by which plants convert sunlight into energy by Darrell Mordecai Darrell creates SEO content for Similarweb, drawing on his deep understanding of SEO and Google patents. Related Topics: SEO This post is subject to Similarweb legal notices and disclaimers. Related Posts Marketing Intelligence 10 Ways to Get Your Website to Show Up on Google SEO by Limor Barenholtz 10 Min. Oct 22, 2024 Marketing Intelligence How to Increase Organic Traffic to Your Website: A Step-by-Step Guide SEO by Limor Barenholtz 9 Min. Oct 19, 2024 Marketing Intelligence Boost Your Website Traffic With Social Media Marketing Strategy by Itay Gross 8 Min. Oct 17, 2024 Marketing Intelligence Missed brightonSEO? Catch up on Google Trends, AI Impact, and SEO Must-Knows SEO by James Quilter 6 Min. Oct 9, 2024 Marketing Intelligence How to Use Heading Tags? Best Practices for SEO SEO by Lior Shapira 10 Min. Oct 1, 2024 Marketing Intelligence Starting a Blog? Best Blogging Guide for Beginners SEO by Lior Shapira 17 Min. Sep 29, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "What Are Google Entities and How To Do Entity SEO"
    },
    {
      "level": "H2",
      "text": "What are Google entities?"
    },
    {
      "level": "H2",
      "text": "What are the benefits of Google entities?"
    },
    {
      "level": "H2",
      "text": "The anatomy of a Google entity"
    },
    {
      "level": "H3",
      "text": "What is the Google Knowledge Graph?"
    },
    {
      "level": "H3",
      "text": "Entities and their properties"
    },
    {
      "level": "H4",
      "text": "1. Unique Identifier"
    },
    {
      "level": "H4",
      "text": "2. Entity name"
    },
    {
      "level": "H4",
      "text": "3. Entity types"
    },
    {
      "level": "H4",
      "text": "4. Entity attributes"
    },
    {
      "level": "H4",
      "text": "5. Related entities"
    },
    {
      "level": "H2",
      "text": "How entities have changed search"
    },
    {
      "level": "H2",
      "text": "What is the Topic Layer?"
    },
    {
      "level": "H2",
      "text": "How to do entity SEO"
    },
    {
      "level": "H3",
      "text": "1. Research how Google understands your entity"
    },
    {
      "level": "H4",
      "text": "#1: SERP analysis"
    },
    {
      "level": "H4",
      "text": "#2: Analyze Wikipedia"
    },
    {
      "level": "H4",
      "text": "#3: Competitor analysis"
    },
    {
      "level": "H3",
      "text": "2. Build site-wide entity connections"
    },
    {
      "level": "H3",
      "text": "3. On-page entity SEO"
    },
    {
      "level": "H4",
      "text": "Semantic header structure"
    },
    {
      "level": "H4",
      "text": "Answering user intent"
    },
    {
      "level": "H4",
      "text": "Building entity connections within your content"
    },
    {
      "level": "H3",
      "text": "Track your topics with Keyword tags"
    },
    {
      "level": "H2",
      "text": "Google entities — What’s next?"
    },
    {
      "level": "H2",
      "text": "FAQs"
    },
    {
      "level": "H3",
      "text": "10 Ways to Get Your Website to Show Up on Google"
    },
    {
      "level": "H3",
      "text": "How to Increase Organic Traffic to Your Website: A Step-by-Step Guide"
    },
    {
      "level": "H3",
      "text": "Boost Your Website Traffic With Social Media"
    },
    {
      "level": "H3",
      "text": "Missed brightonSEO? Catch up on Google Trends, AI Impact, and SEO Must-Knows"
    },
    {
      "level": "H3",
      "text": "How to Use Heading Tags? Best Practices for SEO"
    },
    {
      "level": "H3",
      "text": "Starting a Blog? Best Blogging Guide for Beginners"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Darrell Mordecai"
}