{
  "url": "https://www.similarweb.com/blog/marketing/seo/image-optimization/",
  "slug": "image-optimization",
  "title": "SEO Image Optimization Guide | Similarweb",
  "description": "Many marketers forget to include image SEO, or alt text, in their SEO strategy. Learn how including strong alt text can impact your search traffic.",
  "content": "HomeBlogMarketingSEOEverything You Need to Know About SEO Image Optimization Marketing Intelligence Everything You Need to Know About SEO Image Optimization Start your free trial by Limor Barenholtz , Director of SEO at Similarweb 5 Min. June 16, 2020 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic When most marketers think about organic growth strategies, they do not consider the organic traffic that is driven by images. This blog details how you can discover new image keyword opportunities, which websites successfully drive traffic with image SEO, otherwise called image alternative text, and the impact of image search traffic on specific industries. What Is Image ALT Text? The purpose of image alt text (alternative text) is to describe the image in HTML text. Doing so will optimize your image and help your website with SEO which will help drive more organic traffic to your website. The example below shows the image alt text for a Pinterest page. The alt text of the above image reads “Bodyweight Exercises Chart”, which is the exact search query that produced the image in the search results. As you can see below, the image alt text directly impacts the image on Google SERP. How to Write a Descriptive and Optimized Image ALT Text For this example, looking at the keyword “bodybuilding plan” revealed that Pinterest won three of the top five positions, proving the key is to create an image text that accurately represents your image and will help you optimize for relevant keywords. So, as you may well guess, the first step to creating an SEO-optimized image text is to find all relevant keywords. How do you find the relevant keywords? In the image below, you can see how Similarweb’s Keyword Generator Tool revealed keyword results that “Bodybuilding workout plan – professional bodybuilding workout program” is a strong alt text phrase to use because all of those individual keywords have high volumes of traffic. In this case, to include keywords with high volumes and avoid keyword stuffing in a manner that appropriately describes the image, the alt text was created by combining the first and seventh keyword phrases in the image below. Pinterest.com When analyzing which websites heavily invest in image alt text, Pinterest is at the top of the list. In fact, almost 20% of Pinterest.com’s total desktop search traffic is from images alone. To put this number into perspective, Pinterest generated approximately 40M visits throughout the past 12 months from traffic driven by alt text. You might be wondering, what are Pinterest.com’s top-performing image keywords? When I applied the filters shown above it revealed Pinterest receives organic image traffic from keywords with millions of monthly searches. The most popular keyword is a cartoon, which drives .07% of the website’s image traffic, followed by the 2020 calendar with a .04% traffic share. The keywords photoshoot, world map, coloring pages, blue’s clues pinterest, wallpaper, and calendar 2020 each claim a .03% share. The keyword results can be found in the image below. 3 Simple Steps to Finding Image Alt Text Keyword Opportunities Analyze the keywords for your specific website category. For this example, as shown below, we check traffic to the Health > Nutrition Diets and Fitness category. For this category, 1.34% of all searches in this category are image searches. That percentage may look small, but since it’s out of hundreds of millions of searches each month, it accounts for a huge number of potential visitors. Filter to ‘Image Search’ Keywords to ensure you know which keywords will have the most impact on your image SEO strategy. One of the most important factors to consider when picking keywords for alt text is search volume. This means if you were a health and fitness website, you should use the keyword food since it boasts 11.8M searches, rather than the keyword phrase ab workouts which only accounts for 703K visits, even though it has grown about 71% MoM. Analyze image search keywords you discovered in Similarweb’s Keyword Analysis Tool. This step will help you understand relevant keywords’ performance, how they drive traffic, and who else is targeting them. As you can see in the screenshot below, this process will allow you to understand how many search visits are generated by the specific keyword you are interested in. It will also provide you with insight into how many searches for the keyword are clicked vs. non-clicked, which will help you understand actual traffic potential and avoid ending up with primarily zero-click traffic. The next stage of step three is to see who is currently competing for these keywords and what the traffic share distribution is. Through this, you can begin to grasp just how steep the competition is and start to benchmark against those competitors as you work to win traffic from this keyword. Take Your SEO Strategy to the Next Level Image SEO presents a huge opportunity for many websites to improve their ranking for their overall organic traffic strategy via alt text. When researching image SEO alt text, make sure to follow the process above to find all relevant image keyword opportunities, and to optimize your strategy. To learn more about conducting keyword research for SEO download our latest ebook for a step-by-step guide. by Limor Barenholtz Director of SEO at Similarweb Limor brings 20 years of SEO expertise, focusing on Technical SEO, JavaScript rendering, and mobile optimization. She thrives on solving complex problems and creating scalable strategies. Related Topics: SEO This post is subject to Similarweb legal notices and disclaimers. Related Posts Marketing Intelligence 10 Ways to Get Your Website to Show Up on Google SEO by Limor Barenholtz 10 Min. Oct 22, 2024 Marketing Intelligence How to Increase Organic Traffic to Your Website: A Step-by-Step Guide SEO by Limor Barenholtz 9 Min. Oct 19, 2024 Marketing Intelligence Boost Your Website Traffic With Social Media Marketing Strategy by Itay Gross 8 Min. Oct 17, 2024 Marketing Intelligence Missed brightonSEO? Catch up on Google Trends, AI Impact, and SEO Must-Knows SEO by James Quilter 6 Min. Oct 9, 2024 Marketing Intelligence How to Use Heading Tags? Best Practices for SEO SEO by Lior Shapira 10 Min. Oct 1, 2024 Marketing Intelligence Starting a Blog? Best Blogging Guide for Beginners SEO by Lior Shapira 17 Min. Sep 29, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Everything You Need to Know About SEO Image Optimization"
    },
    {
      "level": "H2",
      "text": "What Is Image ALT Text?"
    },
    {
      "level": "H2",
      "text": "How to Write a Descriptive and Optimized Image ALT Text"
    },
    {
      "level": "H2",
      "text": "Pinterest.com"
    },
    {
      "level": "H2",
      "text": "3 Simple Steps to Finding Image Alt Text Keyword Opportunities"
    },
    {
      "level": "H2",
      "text": "Take Your SEO Strategy to the Next Level"
    },
    {
      "level": "H3",
      "text": "10 Ways to Get Your Website to Show Up on Google"
    },
    {
      "level": "H3",
      "text": "How to Increase Organic Traffic to Your Website: A Step-by-Step Guide"
    },
    {
      "level": "H3",
      "text": "Boost Your Website Traffic With Social Media"
    },
    {
      "level": "H3",
      "text": "Missed brightonSEO? Catch up on Google Trends, AI Impact, and SEO Must-Knows"
    },
    {
      "level": "H3",
      "text": "How to Use Heading Tags? Best Practices for SEO"
    },
    {
      "level": "H3",
      "text": "Starting a Blog? Best Blogging Guide for Beginners"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Limor Barenholtz"
}