{
  "url": "https://www.similarweb.com/blog/marketing/seo/improve-google-rankings/",
  "slug": "improve-google-rankings",
  "title": "How To Rank Higher on Google in 7 Steps | Similarweb",
  "description": "Enhance your SEO strategy and improve your Google search ranking with these seven tips. Ready to target the right keywords and boost your performance?",
  "content": "HomeBlogMarketingSEO7 Actionable Ways to Improve Your Google Rankings Marketing Intelligence 7 Actionable Ways to Improve Your Google Rankings Get insights now by Brian Dean , Founder & CEO, Backlinko 9 Min. September 15, 2021 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic SEO is one of the most scalable channels for driving targeted traffic to your website. That’s the good news. The bad? It can be extremely complicated. Google’s algorithm uses “many factors“ (read: hundreds) to determine its rankings. Which makes things pretty complicated. Compounding the difficulty of developing an SEO strategy is that Google’s constantly changing its algorithm. Fortunately, you don’t need to know every Google ranking factor (or keep tabs on every update) to rank higher on the SERP. In fact, there are several actionable SEO and digital marketing strategies you can use that are effective over the short and long term. In this post we’ll show you how to improve your Google search ranking. Specifically, we’ll outline seven actionable SEO techniques that you can implement in hours or days – not weeks or months. 1. Use original images in your blog content It’s no secret that multimedia, like infographics, embedded videos, and screenshots, can enhance your SEO strategy and make your content more engaging and interesting. That said, Google may prefer to rank pages with original multimedia. In fact, an industry study undertaken by Reboot Online in 2019 (and updated in 2020) decided to test pages with and without original images. One set of pages used completely original images taken by the team. The other used publicly available stock images. To reduce the influence of other potential factors, the Reboot online team actually launched completely new websites from scratch. That way, they could attempt to isolate the impact (if any) of original images on Google rankings. Interestingly, they discovered that pages using original images consistently outranked those with stock photos. Or as the experimenters put it, “Surprisingly clear-cut results.” This implies that Google may give an edge to pages that contain original image content. This isn’t to say you can’t use images from elsewhere. But you should try to incorporate original images whenever possible. You don’t necessarily need to hire a pricey graphic design agency to create custom images for you. Here are a few relatively simple ways to generate original images for your blog content: Use a graphic design tool. There are several easy-to-use graphic design tools (like Canva) that are accessible to non-designers. Hire a pro. You can find affordable professional graphic designers from online marketplaces for freelance services such as Fiverr and UpWork. Many will offer packages specifically for creating images for blog posts. DIY designs. Use images that you take with your phone. Or even a screenshot that you take from your browser. 2. Write original meta descriptions Meta descriptions are an element of on-page content optimization that many people overlook. That’s likely because meta descriptions are a bit old school compared to more recent on-page SEO strategies like Core Web Vitals and semantic SEO. And Google often rewrites descriptions in the SERPs. The upshot is that meta descriptions are still highly relevant. Specifically, a well-written meta description can improve your site’s organic click-through rate (CTR). In some cases, improving your CTR can lead to significantly more organic traffic without needing to rank higher on Google. For example, let’s say that you rank #4 for a keyword that gets 10,000 searches per month. With a 3% CTR, that generates 300 clicks. By optimizing your title and description tags, you doubled that CTR to 6%. That same keyword would now generate 600 clicks. That’s the power of optimizing for CTR. While your title tag certainly plays a role in CTR, your description tag is also important. That’s because users will read it to determine if your site is a good fit for their query. What’s a good click-through rate? Drill down into 2021 CTR benchmarks and see where you stand Let’s go An analysis from 2019 of 5 million Google results discovered that simply using an original meta description boosted clicks by an average of 5%. Needless to say, using a compelling description can bump that number up even higher and boost brand SERP. Here are a few things to keep in mind as you write meta descriptions for your pages: Write each meta description carefully. Google’s guidelines state that: every page on your site should have a meta description those meta descriptions should be descriptive and unique Use Google Ads for inspiration. Search and analyze your target keywords’ performance on Google. And research ads to identify the most effective format and content. See some copy that stands out? Tweak that for your description. Make a clear promise. Searchers only take a few seconds (at most) to click on a result. Don’t be afraid to sell what your content brings to the table. Stay within the optimal length. Google cuts off meta descriptions that are more than 150+ characters. The exact length is actually determined by pixels, not characters. But the 150-character cut-off is a good rule of thumb. 3. Try broken link building No list of SEO strategies would be complete without mentioning link building. That’s because backlinks are still strongly correlated with Google rankings. And building the right backlinks can significantly improve Google rankings. “Great content” and “build relationships” are the cornerstones of earning backlinks to your site. While both tactics are important, neither are instantly actionable. Fortunately, there is an actionable tactic that you can use to encourage other blogs in your niche to link to you: broken link building. The team at Exploding Topics recently ran a small-scale broken link-building campaign. That campaign netted them 7 backlinks from 74 outreach emails (a 9.5% conversion rate). Here’s the scoop (and how you can use it for your own site): Find a page, tool, or resource in your niche that’s broken or outdated. The folks from Exploding Topics realized that an old Google search engine called Google Correlate had been shut down. You can use a free tool like Check My Links to analyze pages for potentially broken links. Or just keep an eye out for tools, businesses, and sites that are shutting down in your industry. Find sites that are linking to the broken/dead resource. You can use any dedicated backlink checker tool for this step. Reach out to the person who runs that page. Finally, give the site owner a heads up that they have a broken link on one of their pages. If you have a similar piece of content (or tracking tool) on your site, you can pitch that as a replacement for the broken link. In terms of the outreach email itself, try to personalize your message as much as possible. You can always work from a script to speed things up. Especially as you scale this process. This tested email script/template is a good starting point. 4. Boost underperforming pages If your site has been around for a while, you probably have a few pages that aren’t performing as well as they should. And you’ll have pages that used to rank but have started to decline. Identifying and fixing these pages is one of the fastest ways to improve your Google keyword rankings. Especially when you consider that a brand new piece of content can take five to ten hours to draft, write, edit, and publish. On the other hand, improving and updating an underperforming page may only take 30 minutes to an hour. First of all, find these underperforming pages. Look at top-performing organic pages first. You can easily find them with Similarweb Digital Marketing Intelligence or Google Analytics With a top organic pages tool, you can evaluate the performance of an individual website – examining their traffic share and traffic trends, the number of keywords driving traffic to the page, and the top keyword driving traffic to the page. Learn more about Similarweb’s Top Organic Page Tool What’s the value? Use Top Organic Pages to reverse engineer a website’s organic search to: Understand which pages are bringing the most organic traffic, and Analyze why that content is performing so well This will give you a direct view of your competitor’s content strategy! On Google, simply filter your traffic to “organic”. Then sort pages in descending order of traffic. This will show you pages that get the least amount of traffic from Google. These are pages that people often ignore. But they have the potential to get 10x more traffic with a few tweaks. Once you’ve identified a few of these pages, here’s how to give them a boost: – Check for outdated info. Does your page reference an old stat? Contain a screenshot of an old UI? Or include a step that no longer works? If so, update your content. – Make improvements. Notice an unclear sentence or a paragraph that’s too long. Feel free to make any changes needed to make the page more valuable to Google searchers. – Re-optimize. Sometimes a page struggles to rank because it’s targeting the wrong keyword. There’s nothing wrong with going back and re-optimizing the page around a more relevant, or less competitive, search phrase. 5. Improve your page’s dwell time Google’s recently updated How Search works’ document confirms that the company uses “aggregated and anonymized interaction data to assess whether search results are relevant to queries.” In other words, Google measures how users interact with its search results. And it takes these user interaction signals into account when it comes to Google rankings. These engagement metrics can include bounce rate, pages per visit, and session duration. One of the interaction signals Google pays close attention to is Dwell time. Dwell time is essentially how long someone spends on a webpage. A page with a high dwell time (along with other signals) suggests to Google that the page is a high-quality, relevant result. Here are a few ways to boost your website’s dwell time: – Add “you may also like” links. Including links to relevant content on your site can encourage readers to stay on your site longer. – Write crisp introductions. Introductions should provide important context around your post. But it’s also crucial to quickly transition readers into the “meat” of your content as quickly as possible. – Make your content “skimmable”. Short paragraphs, short sentences, and generous usage of subheadings can help readers understand your content. 6. Discover low-competition keywords in online communities Thanks largely to digital transformation, SEO is becoming much more competitive. This means keywords that used to be relatively easy to rank for are now a fight for the #1 position. Fortunately, there are still millions of untapped keywords out there – if you know where to look. Specifically, online communities are fantastic places to uncover untapped search terms that keyword research tools haven’t picked up on yet. If you’re in the startup tech world, a community like Hacker News is a goldmine of trending keywords that aren’t yet super competitive. If you’re in the health and fitness space, specific subreddits (like r/OMAD and r/keto) can uncover untapped search terms. Another way to implement this strategy is to search for a keyword in Google. Then, check out the “People also ask…” section of the search results. This SERP feature actually pulls questions from various online communities around the web. This can sometimes uncover topics and keywords that would be hard to find by manually reading threads. Enjoy 360 Visibility 24/7 Get the data you need to adapt to market changes and industry trends in an instant. Try Similarweb for free 7. Turn unlinked brand mentions into backlinks An unlinked brand mention is when someone mentions your brand without a link back to your site. It’s possible that Google uses unlinked brand mentions as a ranking signal. Even so, it’s preferable to turn that unlinked mention into a backlink. Fortunately, getting links from writers that have mentioned your brand is relatively easy (because they’ve already mentioned you!). So it’s just a matter of sending a friendly reminder to add a link to your site. To find unlinked mentions, you can use a tool like Mention.com or BuzzSumo. Both of which track brand mentions around the web (and have filters for specifically identifying brand mentions without a link). Then, it’s a matter of reaching out to the article’s author to remind them to add a link. The key here is to make the main purpose of the email to thank the writer for the mention. Then, casually mention that a link could “help their readers find us”. Final thoughts SEO is a continuous process involving almost every aspect of digital marketing (including content, design, partnerships, PR, and more). We hope these tactical strategies helped show you how to rank higher on Google. Many of these initiatives will take time and a dedicated team to pull off. But as you have seen in this article, there are plenty of actionable strategies that an individual or small team can pull off by themselves. Many of which don’t require a large investment of time or resources. by Brian Dean Founder & CEO, Backlinko Brian is the founder and CEO of Backlinko, which has 5 million yearly readers, and was featured by Forbes as a top \"blog to follow\". Related Topics: Content Marketing SEO This post is subject to Similarweb legal notices and disclaimers. Related Posts Marketing Intelligence Top Trending Keywords on Google: What Are We Searching For? Content Marketing SEO by Darrell Mordecai 18 Min. Jun 17, 2024 Marketing Intelligence Copywriting Psychology: 7 Ways to Make Your Content Stick Content Marketing by Leah Messenger 9 Min. Apr 23, 2024 Marketing Intelligence Digital Marketing Strategy: A Beginner’s Guide Ad Intelligence Content Marketing by Leah Messenger 7 Min. Mar 26, 2024 Marketing Intelligence How to Conduct a Social Media Competitor Analysis: 5 Quick Steps Business Benchmarking Company Research by Leah Messenger 7 Min. Feb 23, 2024 Marketing Intelligence The Essential Guide to YouTube Competitor Analysis Content Marketing by Shai Belinsky 9 Min. Jan 31, 2024 Marketing Intelligence How to Check Website Traffic: Analyzing the Digital Data Ad Intelligence Affiliate Marketing by Limor Barenholtz 14 Min. Jan 17, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "7 Actionable Ways to Improve Your Google Rankings"
    },
    {
      "level": "H2",
      "text": "1. Use original images in your blog content"
    },
    {
      "level": "H2",
      "text": "2. Write original meta descriptions"
    },
    {
      "level": "H2",
      "text": "3. Try broken link building"
    },
    {
      "level": "H2",
      "text": "4. Boost underperforming pages"
    },
    {
      "level": "H2",
      "text": "5. Improve your page’s dwell time"
    },
    {
      "level": "H2",
      "text": "6. Discover low-competition keywords in online communities"
    },
    {
      "level": "H2",
      "text": "7. Turn unlinked brand mentions into backlinks"
    },
    {
      "level": "H3",
      "text": "Final thoughts"
    },
    {
      "level": "H3",
      "text": "Top Trending Keywords on Google: What Are We Searching For?"
    },
    {
      "level": "H3",
      "text": "Copywriting Psychology: 7 Ways to Make Your Content Stick"
    },
    {
      "level": "H3",
      "text": "Digital Marketing Strategy: A Beginner’s Guide"
    },
    {
      "level": "H3",
      "text": "How to Conduct a Social Media Competitor Analysis: 5 Quick Steps"
    },
    {
      "level": "H3",
      "text": "The Essential Guide to YouTube Competitor Analysis"
    },
    {
      "level": "H3",
      "text": "How to Check Website Traffic: Analyzing the Digital Data"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Brian Dean"
}