{
  "url": "https://www.similarweb.com/blog/marketing/seo/integrated-search-strategy/",
  "slug": "integrated-search-strategy",
  "title": "How Holistic SEO Changes the Game | Similarweb",
  "description": "Each search engine is different, but your SEO strategy shouldn’t be. Learn how to create an integrated search strategy to win the three biggest search engines.",
  "content": "HomeBlogMarketingSEOHolistic SEO: 1 Killer Approach to Win on 3 Big Search Engines Marketing Intelligence Holistic SEO: 1 Killer Approach to Win on 3 Big Search Engines Watch On Demand by Gerald Murphy , Solution Business Manager, Similarweb 5 Min. October 5, 2021 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Imagine an engine. See the cylinders firing off? The oil greasing the cogs? We think of the engine as one unified machine when in reality it’s made of many moving parts. It’s the same for how you conceptualize search. Like an engine, search is composed of many parts including: Channels: Every search triggers results that contain relevant keywords for a query. Devices: The same user can visit the same website on multiple devices. Needs: Different search engines cater to different needs. Markets: Search behavior and SERP Features are unique. Different platforms: Search engines are more than Google. When all these parts work together to drive organic traffic, they create integrated SEO. Also called holistic SEO, this approach ensures your overall marketing strategy is working together and ultimately helps drive more traffic to your site. The first step to incorporating integrated SEO into your content is to first understand the basics of search and search engines. What do Amazon, Google, and YouTube have in common? Intent. The most important overlap between all search engines is search intent. Every time you run a query on a search engine, you’re looking to achieve something. Can you guess what that something is? Find relevant information. The best way to effectively craft a keyword strategy on multiple search engines is to ensure your target keywords match your audience’s search intent. No two search engines are alike, and many serve different purposes, so the most common search intents differ for each. Amazon focuses on keywords related to consideration and decision. YouTube, on the other hand, leans toward decision and inspirational keywords. Google is a hybrid and actually touches on all four intents. Buyer’s journey, keyword intent, and keyword research So now that you know the search intent, how do you apply that to integrated SEO? It’s simple. You align your target keywords with your audience’s search intent. Doing this is critical because it allows search engines to understand and optimize for the keywords that match the searcher’s needs. The aim of keyword research is to get the right searcher into your website. We call this keyword intent. There are three main types of keyword intent: Informational The searcher is looking to learn more information on a subject. Navigational The searcher is looking for something specific nearby. Transactional The searcher is ready to make a purchase. How do keyword intent and buyer journey relate? The buyer’s journey gives you a broad view of relevant keywords, while keyword intent focuses on the potential the keyword has to generate a purchase. Zero click is a hugely important metric because it helps you determine the quality of your keywords. A zero-click keyword means that the keyword gets no clicks from either SEO and/or PPC. In these cases, it’s not worth prioritizing these keywords in your holistic SEO strategy because they won’t drive traffic to your website. More clicks mean more traffic. Let’s take a look at how clicks relate to intent. Awareness keywords like ‘duvet’ are broad and do not show the intent of the searcher clearly. 85% of these searches are zero click. Search volume itself stands at 154,770 searches. Consideration keywords like ‘duvet covers’ are slightly more specific and focused, indicating that the searcher knows what type of product they want. Only 57% of the searches resulted in zero clicks. The search volume dropped to 96,030 queries. Decision keywords like ‘linen duvet cover’ are very high intent as the desired material has been identified and the searcher is clearly interested in making a purchase soon. Only 36% of these searches result in zero clicks. The search volume weighs in at 13,490 queries. Ready to E-E-A-T? In SEO, E-E-A-T stands for experience, expertise, authoritativeness, and trustworthiness. The E-E-A-T principle helps determine the quality of a website’s content. It does this by combining a search engine’s standard algorithm with feedback from human evaluators to further help the algorithm identify quality content more effectively. Quality is somewhat subjective, but it does mean the content has to exert the three cornerstones of E-E-A-T. E-E-A-T content is critical for all websites, but most important on YMYL (your money, your life) websites. YMYL are websites that produce content that can impact a person’s future happiness, health, financial stability, or safety. Examples are financial assistance or medical informational websites. Like keyword intent, content connects all three search engines of Amazon, Google, and YouTube, which is why E-E-A-T matters when creating an integrated search strategy. How Similarweb helps with holistic SEO So what’s the secret to a solid search term? Here are three of my favorite tools to help you determine this:. Keyword Generator – See keywords that are winning traffic on the three biggest search engines: Amazon, Google, and YouTube. In addition to finding keywords tailored to each search giant, you can check the quality of your keywords with our zero-click search feature and evaluate your keyword’s strength. Keywords by Industry – Filter by focus phrases like ‘what’ or ‘how’ to identify awareness keyword opportunities. SEO Competitive Analysis – Find out which keywords your competitors gain traffic from and their traffic share. Do the same for yourself to spot your keyword gaps and stay on top. Start winning search Now that you know the basics, you probably have a million questions about how you can build an integrated search strategy. Check out our webinar, Building an Integrated Search Strategy, with SEO guru Lily Ray to get all the juicy details. Craft your integrated SEO strategy Learn how to use one SEO strategy to win on all the biggest search engines Register to the webinar by Gerald Murphy Solution Business Manager, Similarweb Gerald, with 10+ years in SEO for brands like Nestlé and Shell, drives Similarweb's SEO strategy and is a digital enthusiast. Related Topics: SEO This post is subject to Similarweb legal notices and disclaimers. Related Posts Marketing Intelligence 10 Ways to Get Your Website to Show Up on Google SEO by Limor Barenholtz 10 Min. Oct 22, 2024 Marketing Intelligence How to Increase Organic Traffic to Your Website: A Step-by-Step Guide SEO by Limor Barenholtz 9 Min. Oct 19, 2024 Marketing Intelligence Boost Your Website Traffic With Social Media Marketing Strategy by Itay Gross 8 Min. Oct 17, 2024 Marketing Intelligence Missed brightonSEO? Catch up on Google Trends, AI Impact, and SEO Must-Knows SEO by James Quilter 6 Min. Oct 9, 2024 Marketing Intelligence How to Use Heading Tags? Best Practices for SEO SEO by Lior Shapira 10 Min. Oct 1, 2024 Marketing Intelligence Starting a Blog? Best Blogging Guide for Beginners SEO by Lior Shapira 17 Min. Sep 29, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Holistic SEO: 1 Killer Approach to Win on 3 Big Search Engines"
    },
    {
      "level": "H2",
      "text": "What do Amazon, Google, and YouTube have in common?"
    },
    {
      "level": "H2",
      "text": "Buyer’s journey, keyword intent, and keyword research"
    },
    {
      "level": "H2",
      "text": "How do keyword intent and buyer journey relate?"
    },
    {
      "level": "H2",
      "text": "Ready to E-E-A-T?"
    },
    {
      "level": "H2",
      "text": "How Similarweb helps with holistic SEO"
    },
    {
      "level": "H3",
      "text": "Start winning search"
    },
    {
      "level": "H3",
      "text": "10 Ways to Get Your Website to Show Up on Google"
    },
    {
      "level": "H3",
      "text": "How to Increase Organic Traffic to Your Website: A Step-by-Step Guide"
    },
    {
      "level": "H3",
      "text": "Boost Your Website Traffic With Social Media"
    },
    {
      "level": "H3",
      "text": "Missed brightonSEO? Catch up on Google Trends, AI Impact, and SEO Must-Knows"
    },
    {
      "level": "H3",
      "text": "How to Use Heading Tags? Best Practices for SEO"
    },
    {
      "level": "H3",
      "text": "Starting a Blog? Best Blogging Guide for Beginners"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Gerald Murphy"
}