{
  "url": "https://www.similarweb.com/blog/marketing/seo/keyword-research/",
  "slug": "keyword-research",
  "title": "Keyword Research - Beginners Guide [+Template] | Similarweb",
  "description": "Keyword research can make or break your SEO strategy. Learn how to do it like an expert with our comprehensive guide & free keyword research template",
  "content": "HomeBlogMarketingSEOKeyword Research – An In-Depth Guide to Help You Rank Higher [+Template] Marketing Intelligence Keyword Research – An In-Depth Guide to Help You Rank Higher [+Template] Download the template by Limor Barenholtz , Director of SEO at Similarweb 12 Min. September 2, 2020 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Keyword research can help you effectively reach more of your audience. By understanding exactly what they are searching for, you can create targeted content to meet their needs. But, in order to maximize your impact, you need to take a systematic approach using the most accurate keyword research tools. In this post, we’ll break down the complete step-by-step guide to how to conduct keyword research and the tools to use to achieve real results. What is keyword research? Keyword research is the process of finding the words and phrases your target audience is searching for on Google. Whether they are looking to find information like, pizza delivery options in your city, or are ready to purchase a product or a service, once you identify the high-value keywords they are searching related to your business, and their intent, you can optimize your search strategy and rank higher on Google. Why does keyword research matter to you? Using the right keywords (also known as search terms) gives your content the power to climb higher on search engine results pages (SERPs). This is exactly why keyword research is a pillar in search engine optimization (SEO). If you set up your keyword research properly, scaling your ongoing SEO efforts and powering your growth will be fairly easy to execute. It is important that your primary research is comprehensive and hones in on search intent because it will be the foundation of your search engine optimization strategy. Think of it as the base of all your future subject-specific SEO efforts to bring you new leads like a passive income. During this initial phase of research, your goal is to gather as many relevant keyword phrases as you can that could reach your audience. In this blog we will guide you through how to conduct keyword research: Scan your website for keywords Dig deeper into your keyword data with Google Search Console Take advantage of competitor analysis tools Find the most valuable phrases with the keyword generation tool Consolidate your keyword data Categorize keywords by user intent and semantic search Analyze long-tail vs. short-tail keywords Choose the right mix of keywords to focus on You can download our keyword research template below and apply what you learn as you go. How to do keyword research 1. Scan your website for keywords To start your keyword research process, the first step is to open your website and identify the main categories. Note any very obvious keywords you will need to include. The keywords you find during this process are the first ones you should add to your initial list to gain high-level insight into your website’s main goals. At this stage don’t focus on the specific terminology used, you can tweak the wording later, focus on understanding what your website is aiming to do and/or sell to understand how you will generate search traffic. Pro Tip: Pay special attention to how your content is organized. Look for where the content and product pages are located. If you have a menu, those keywords are (yes, you guessed it) key. You can also find additional crucial industry words by scanning your site as a whole, including content featured on your homepage, blogs, product pages, feature descriptions, mission statements, and FAQ. If you sell a product, both the product and its category would be included. Below you can see an example of important keywords on Similarweb’s homepage that would need to be included during this stage of SEO research. Words like ‘digital research’ and ‘investing’ relate to how our content is organized. As you go through your own website these are the types of phrases you are searching for in this stage of your keyword research. 2. Dig deep into your keyword data in Google Search Console Take a look at the data you already have. There’s no need to reinvent the wheel – yet. If you have access to Google Search Console, (which can also be visible through your Google Analytics account), you can navigate to the performance section and look at the search results reported there. The list you create here will give you a thorough review of your strongest keywords that are already working. If a term is performing well, you need to ensure you continue to include it in your SEO strategy, and possibly, even double down on your content efforts to win traffic from the term. Pro Tip: To use the Performance section effectively, set the data range for the page at 6 months, exclude all branded queries to compile a list of general terms that your audience is searching for, and then download the list it creates as a CSV file. 3. Take advantage of competitor analysis tools Use competitive data tools to analyze your website and gain more insight into your current performance. Keep in mind that the keywords you will find differ for macro-level SEO and local SEO. You could conduct macro-level keyword research for specific countries using Similarweb. This will help you drill down and understand the topics and keyword opportunities that are trending in countries that interest you. To do this, you can use Similarweb’s website analysis tool, and first, insert your own URL. Next, click on the Keywords section and filter out all branded keywords. After that, navigate to the “Competitors” section of your website analysis. Note the top three competitors you have and then run an audit on their websites too. For each audit you run, go to the Keyword Analysis section, filter out the branded search queries and export the reports for internal use. Remember that competitors’ traffic data can be as valuable as ranking data for your analysis, so don’t give up on any exported dataset yet – many of them will come in handy for your SEO strategy. Pro Tip: It can also be useful to filter out results that fall outside of the top 50 rankings in the Search Engine Results Pages (SERP) to weed out many irrelevant queries. Combine the keyword list you created for each of your competitors’ sites with the one you made for your own site. You should merge the exported Excel files into one. Now you can consolidate the ranking and traffic data for each of your competitors and then remove any duplicate keywords. Alternatively, you can decide not to consolidate your competitors’ ranking and traffic data and use only the keyword data. At this point you have the basis of the research: You found out what your website is ranked for, what phrases your competitors’ websites are ranked for, and what real people search for. Now it’s time to inspect your entire search potential. You can also perform micro-level research using Navads. Navads, acquired by Uberall in 2018, is the leading location data provider for the databases that power the navigation and mapping industry. It has a local search tool that helps you rank higher in map search results. 4. Find the most valuable phrases with Keyword Generation Tool Your next step is to use a keyword tool to discover more keyword ideas, synonyms, and suggestions. You can use Google Keyword Planner to discover new keyword ideas. Another and often easier option is to use a keyword research tool like Similarweb’s Keyword Generator Tool and insert keywords by the categories you found on your website during stage one. Diving into more specific categories ensures the keywords the tool suggests are relevant to your topic. Below you can see an example of how Similarweb’s tool provides keyword suggestions. You can sort by the type of keyword match (phrase match, related keywords, trending keywords, and question queries) as well as the metrics such as volume, yearly traffic trend, CPC, organic vs. paid, and the website winning the most traffic. Consider your target audience: Who are they? How do they search for what they need? What words or phrasing do they use? Are they primarily on desktop or mobile? This is also the perfect time to further research “interesting” phrases you may have found through competitive keyword research. Pro Tip: Since branded terms are usually irrelevant to SEO, be sure to filter out brand terms when you conduct your keyword research. You should also filter out irrelevant keyword phrase suggestions such as price and jobs. Again, in this stage, the goal is to compile a comprehensive keyword list for each of your chosen categories, so add as many relevant keywords as possible. You will probably discover that the broad category you started off with needs to be broken down into subtopics to make your keyword list usable for technical SEO and content marketing purposes. For example, digital marketing is a huge category that includes SEO, pay-per-click (PPC), media planning, marketing strategies, and more. So, each of those subjects should become its own subcategory at this stage since they each require research into specific keyword terms. After you’ve broken down your main category into more easily digestible bite-sized subcategories, each subcategory should have its own keyword list that you can download. Now, it’s time to download those lists and take some time to review each. If you find that one of your categories is still quite wide, meaning it contains many search queries and very large volumes, you can break it down further into more detailed subcategories until it’s manageable. Once you’re happy with your subcategory lists go to Google Keyword Planner. This tool allows up to 10 base phrases per ‘research,’ so group all phrases from the same subcategory together to find the best relevant keyword suggestions. ‘Research’ in SEO keyword planning refers to the maximum number of starting keywords that you can use in Google Keyword Planner to find related keyword suggestions. 5. Consolidate your keyword data At this point, you’re probably wondering why you have so many keyword lists, but don’t worry that means you’re on the right track! These lists are your data sources for all search volumes and trends, and also for your competitors’ ranking and performance data. In fact, now it’s time to combine all of the lists that fall into the same subcategory by migrating all the data to one master Excel file. Once you’ve combined them remove any duplicate keywords. The reason you are merging the lists you’ve made is so you can effectively organize and implement your keyword research when it’s go-time. Pro Tip: Perform search trend and rank calculations on your data lists. Then consolidate the sources and remove duplicate phrase entries. Finally, pull all the competitive data related to your research (competitors ranking, traffic shares, etc.). Now you can calculate competitive keyword difficulty and value easily and build a data-driven SEO strategy. For example, you can identify recent changes in search volumes as well as competitor’s weak spots, and adjust your strategy accordingly. To understand how to most effectively implement your keyword research, map out your data and insights against the current content on your website. Ask yourself: Which terms do you already have pages for? Which ones do you need to create pages for? These questions will allow you to understand how to prioritize your efforts and successfully execute your keyword strategy. 6. Categorize keywords by user intent and semantic search Start by dividing the phrases you’ve compiled into smaller groups based on topic similarities. From there you can break them down into large categories, like digital marketing, subcategories like SEO, and topic words like keyword research. For your topic keywords with semantic similarities, you want to keep in mind the users’ search intent for every query and effectively reach your potential customers. People can use the same keywords to mean different things, so an important part of this process is decoding the user’s search intent. For example, if someone searches for toilet paper what do they mean? Are they looking for places to order from, popular brands, or keeping tabs on which stores have toilet paper in stock? This is why you must understand search intent to categorize your keywords and ultimately reach your relevant target audience. Once you understand your target audience’s intent you can analyze the most relevant search phrases for them and for your business, and decide what are the right keywords for you. In general, there are four main intent categories: Informational: These generally include “how-to” questions and “what” questions. For example, ‘how to disinfect plastic.’ Commercial investigation: Specific Attributes, versus, best, for example, ‘Walmart vs Target.’ Transactional: This includes searches where the user has the intent to buy or download, for example, ‘buying waterproof kid’s toys.’ Navigational: This includes branded queries, like ‘Facebook updates.’ Pro Tip: Taking the time to thoroughly complete this step will help you to achieve very high clarity in your groups and ensure your SEO optimization efforts will have the largest impact possible. Remove all remaining terms that are still irrelevant to your SEO goals such as queries that include times, locations, and competitor names. What you deem irrelevant will change based on your individual site and industry, so there is not a hard and fast rule to follow. Optimization gaps are pages that are optimized for the wrong search intent, that have missing content, or are missing the right meta elements. To do this, continue re-dividing your keyword groups into smaller and smaller groups until you’re left only with keyword groups of semantically related search queries. 7. Analyze long-tail vs. short-tail keywords Within your keyword groups, it’s important to ensure you have a mix of short-tail and long-tail keywords. Short-tail keywords are more competitive and more to rank for because they are broader searches. On the other hand, long-tail keywords typically contain over three words and are less competitive because they are geared toward more specific searches. A good mix of the two types allows you to develop a keyword strategy that balances long-term and short-term wins. For example, which of these keyword phrases do you think would be easier to rank for? Toilet paper Reusable toilet paper [Did you pick the second one? Good!] The more competition there is for a keyword, the harder it is to rank. As you can tell, long-tail keywords are more specific so they have a much clearer search intent than short-tail keywords. They also usually drive higher-quality traffic to your site since people are looking for something specific, which results in a more qualified lead. At many times data will show long-tail keywords can also produce larger traffic volumes when accumulated than short-tails for a specific topic, in those cases, it will be a strategic decision to focus on long-tail keywords that offer higher relevancy and match the audience’s search intent. This is another reason to make sure you don’t only pick high-volume phrases, but look at the big picture and choose the right keywords for SEO that offer maximum relevance and potential. 8. Choose the right mix of keywords to focus on When creating your keyword plan you need to consider the following information and how they fit into your SEO strategy: Search volume: You should be closely evaluating the search volume of the keywords you are targeting. A keyword with a high search volume is more likely to be competitive, or harder to rank for. In order to rank higher on a high-volume, highly competitive keyword, you need to have site authority for the topic. One way you can build authority: create content on lower volume-related keywords. This shows Google that you are an expert on the topic and boosts your standing. Knowing the search volume for any given keyword helps you strategize to create the most effective approach given the characteristics of your website. Organic click-through rates (CTRs): This metric will give you an idea of how likely people are to click on posts that rank for a specific keyword. For example search terms like “what is the weather,” which are often answered on the Google Search Result page, may have a lower click-through rate since the user gets their answer question without needing to take another action. Keyword search trends: Trending keywords are constantly changing, so you need the most up-to-date data to stay on top of what’s trending in search. Similarweb has a keywords trends feature where you can quickly see what keywords are driving traffic now. Trends can change based on current events, pop culture developments (think Meghan and Harry’s Oprah interview), or even seasonal events like Black Friday. Watch for specific times to rank for keywords because that’s when it matters. Your competitors’ keywords: You can gain a lot of insight from keywords your competitors are ranking on. Using Similarweb’s Website Analysis, you can see the market share that each competitor has for specific keywords. Long-tail and short-tail keywords: As discussed earlier, you want to be sure you are focusing on the long-tail and short-tail keywords that make sense for your search strategy and your site’s level of authority. Now you have sorted and expanded on your data strategically. This means you can easily estimate the difficulty as well as the value of ranking for a keyword or a topic and build an SEO strategy that takes everything into account and can be easily deployed. You can make smarter choices in creating or optimizing content, easily discover and address content gaps, and scale your activity without duplication hazards. Put your keyword research to work Boom. You did it. You just completed your initial keyword research. You now have small keyword groups you can use to map out and optimize pages from your site and create new pages for keywords you know will win SEO traffic. The list you have now enables you to easily manage on-page optimization and keyword use, as well as mitigate the risk of duplicate content. FAQs What is keyword research? Keyword research is the process of finding the terms and phrases that your target audience is searching for on search engines. Why should I use keyword research? You should use keyword research to discover the right terms that will help you climb higher on the SERP, and therefore increase the traffic to your website. How do I conduct keyword research? You can conduct keyword research with SEO tools. Similarweb’s SEO tools allow you to discover keywords your target audience is searching for, and the terms that are driving traffic to your competitors. by Limor Barenholtz Director of SEO at Similarweb Limor brings 20 years of SEO expertise, focusing on Technical SEO, JavaScript rendering, and mobile optimization. She thrives on solving complex problems and creating scalable strategies. Sources Related Topics: Marketing Strategy SEO This post is subject to Similarweb legal notices and disclaimers. Related Posts Marketing Intelligence Boost Your Website Traffic With Social Media Marketing Strategy by Itay Gross 8 Min. Oct 17, 2024 Research Intelligence Competitive Benchmarking: Crack the Code to Your Competitors’ Success Business Benchmarking Marketing Strategy by Monique Ellis 9 Min. Sep 10, 2024 Marketing Intelligence Mastering Travel Competitor Analysis: A Step-by-Step Guide Marketing Strategy by Monique Ellis 8 Min. Sep 5, 2024 Marketing Intelligence What is Competitive Intelligence: Importance, Types & More Marketing Strategy by Daniel Schneider 10 Min. Sep 2, 2024 Marketing Intelligence Find Competitors of Your Company Using Smart Strategies Marketing Strategy by Monique Ellis 9 Min. Sep 2, 2024 Marketing Intelligence Finding Your Competitors’ Target Audience for a Unique Edge Marketing Strategy by Monique Ellis 7 Min. Sep 1, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Keyword Research – An In-Depth Guide to Help You Rank Higher [+Template]"
    },
    {
      "level": "H2",
      "text": "What is keyword research?"
    },
    {
      "level": "H2",
      "text": "Why does keyword research matter to you?"
    },
    {
      "level": "H2",
      "text": "How to do keyword research"
    },
    {
      "level": "H3",
      "text": "1. Scan your website for keywords"
    },
    {
      "level": "H3",
      "text": "2. Dig deep into your keyword data in Google Search Console"
    },
    {
      "level": "H3",
      "text": "3. Take advantage of competitor analysis tools"
    },
    {
      "level": "H3",
      "text": "4. Find the most valuable phrases with Keyword Generation Tool"
    },
    {
      "level": "H3",
      "text": "5. Consolidate your keyword data"
    },
    {
      "level": "H3",
      "text": "6. Categorize keywords by user intent and semantic search"
    },
    {
      "level": "H3",
      "text": "7. Analyze long-tail vs. short-tail keywords"
    },
    {
      "level": "H3",
      "text": "8. Choose the right mix of keywords to focus on"
    },
    {
      "level": "H3",
      "text": "Put your keyword research to work"
    },
    {
      "level": "H2",
      "text": "FAQs"
    },
    {
      "level": "H3",
      "text": "Boost Your Website Traffic With Social Media"
    },
    {
      "level": "H3",
      "text": "Competitive Benchmarking: Crack the Code to Your Competitors’ Success"
    },
    {
      "level": "H3",
      "text": "Mastering Travel Competitor Analysis: A Step-by-Step Guide"
    },
    {
      "level": "H3",
      "text": "What is Competitive Intelligence: Importance, Types & More"
    },
    {
      "level": "H3",
      "text": "Find Competitors of Your Company Using Smart Strategies"
    },
    {
      "level": "H3",
      "text": "Finding Your Competitors’ Target Audience for a Unique Edge"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Limor Barenholtz"
}