{
  "url": "https://www.similarweb.com/blog/marketing/seo/keywords-for-seo/",
  "slug": "keywords-for-seo",
  "title": "Where & How to Use Your SEO Keyword Research | Similarweb",
  "description": "Learn the best practices and most effective ways to use SEO keyword research to optimize your pages and send the right signals to get in Google SERP here.",
  "content": "HomeBlogMarketingSEOWhere & How to Use Keywords for SEO - What Really Matters Marketing Intelligence Where & How to Use Keywords for SEO – What Really Matters Start your free trial by Maayan Zohar Basteker , Senior SEO Specialist at Similarweb 13 Min. December 9, 2020 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic As a website owner or marketer, you can write the most amazing articles, but unless you use keywords properly, no one will read your breathtaking content. People simply won’t find it. And the most eager customer won’t get to your jaw-dropping offer if you don’t put up the right traffic signs for search engine crawlers. You need relevant keywords and strong search engine optimization to drive organic traffic to your web page. The big question is, where and how can you use keywords so your content will show up for the people it’s intended for? How do you use keywords in SEO efforts so crawlers identify them as relevant signs that drive traffic to your website? What is a keyword? A keyword, in SEO, is a search query – The words and phrases that people use when searching online. When John Doe or Jane Doe types a few words into the search engine’s search box, they expect to get from that search engine results that are helpful to them. For that goal, search engines like Google have “crawlers” or “spiders”, or simply “bots” that explore the web on an ongoing basis in order to find new pages and check any pages that were updated. Engines like Google have many factors and signals their algorithm inspects in order to decide which is the most relevant page for every query, and many of them rely on keywords as a metric to understand the relevancy of any type of content to any type of query. The most relevant pages then appear on the search engine result page (SERP) on John’s screen. If you want John Doe to find your content, you need to know how to use keywords for SEO in your content effectively. You’ve come to the right place. You’re about to find out. What do you do with your SEO keyword research? For the right people to find you, you need to know what they type into the search field when they search for what you offer. Keyword research is the only way to figure this out. With Similarweb’s market research tool, you can even benchmark against your competitors and see what works for them. If done right, you’ll get all the information needed to choose the right keywords to target. Read our Keyword Research Guide and discover the essential steps to identifying the best keywords for your site. Next, you need to make sure to use your list of keywords correctly in your content and link-building structure. It’s all about matching the search intent of the John and Jane Does out there. In this post, we explain the most important aspects to consider. Learn how to use keywords so search engines understand their relevance and help your SEO strategy succeed. Bonus: Download our pre-made keyword research example template below to gain a deeper understanding of the process and easily consolidate group, and sub-group your keywords to ensure you’re not only using keywords properly but that you’re using keywords that will make an impact. Utilize your keyword research in 3 main ways Getting search engines to appreciate the relevance of your page to specific keywords is not a black-or-white process. So, if you have a lot of questions now, that’s okay. Even SEO experts regularly debate the critical factors that impact ranking. We’ll discuss and answer some of the common questions here. Remember these when you incorporate SEO in your digital marketing strategy. 1. Content optimizations Create strong title tags Titles tags are the clickable headlines in search engine page results (SERPs). It is crucial you use your keywords when writing these for SEO and usability and social sharing purposes. They clearly tell your target audience what you are writing about and the value your content will offer them. Title tags are usually one of the most significant factors in whether or not somebody clicks on your article. Pro tips: Keep them under 60 characters, or the SERP cuts them off Ensure you use your keywords here without keyword stuffing Use a unique title on every page Write your title tag with your audience in mind. Consider your tone and word choice to increase clickability Include the most important information at the beginning Try to incorporate keywords in your headers and sub-headers Keep in mind, the purpose of headings is to provide a clue to what’s next. They must be clear, specific, and related to the paragraph’s message. The keywords will jump to your mind naturally if you concentrate on achieving that. Rather than creating long headlines around keywords, try to find the best-fitting headline for each section. Then review and assure that the key phrase appears in some. Does a strong meta description impact ranking? Although the meta description is not a direct factor in ranking, you still need to give it serious thought. That’s because it often determines whether a searcher will click through from the results pages to your site. And the click-through rate (CTR) does play an important role in ranking. What is the meta description? It’s an HTML attribute that provides a description or a very brief summary of the page. A meta description on Google’s search engine typically includes a maximum of 160 characters, however, you should always inspect how your description is shown in the search results since Google does not calculate characters for showing meta tags, but pixels. For instance, using “&” in your description will take up more pixels than just writing the word “and”. Search engines often display this page brief on the SERP right below your URL and page title. A searcher will read it to determine if the page is interesting. Therefore, it should be hyper-relevant (pun intended!) to the keywords and topic. If possible, sum up the page’s message and add a CTA-type sentence to entice the searcher. Writing the meta description like ad copy can increase your click-through rate. Make sure each page has a unique meta description, so Google doesn’t see multiple pages as duplicate content. Optimize Image Alt Texts using your keywords A good Alt text helps search engines better understand and rank your content and images in Google image search, as it provides context to search engines regarding what’s shown in the image. Yes, Google can not see images or videos, therefore it relies on the surrounding meta around the image in order to understand its relation and value to the content. This is why every image on your website needs what’s called Alt Text (short for alternative text), or Alt Tag. On top of allowing search engines insight into the image, this is also a piece of written text that becomes visible to the visitor in case the image does not load. It is also used widely today for accessibility by screen readers to describe the image to the visually impaired. The Alt Text for images should generally be descriptive of what the picture shows. Search engines use the Alt tag attribute to determine what’s on the image and its relation to the content. For this reason, you should try to add a keyphrase naturally without changing the Alt text’s descriptive nature. This lets the search engine understand its content and relevance to the search intent. Are you optimizing your images’ title tags? Not many use the image title tag as an SEO element, but it is another great place for you to incorporate your keywords to help search engines better understand your relevancy to these terms. The image title text is the tool-tip that pops up when you hover over an image online and can be used for optimization very easily, unlike the Alt tag which has accessibility functions as well that require more strict guidelines. This means that while for an Alt text tag, you’d want to describe the image, the image title is an attribute much closer to anchor text. Create content with related keywords Keyword research helps you select a specific key phrase for each individual page. This lets you create several pages on the same overall subject but with a different focus. Search engines can identify they are different but related. When Google considers your site an authority on the subject because you publish lots of valuable, related content, it affects your ranking. For example, if you are selling online insurance, you can write one page on “comparing health insurance fees for athletes” and another one on “why athletes need health insurance”. The words are almost the same, but the message is different. Ask yourself what athletes would use as a search term if they were interested in the topic. Be careful, though. When several pages are optimized for the same exact key terms, search engine crawlers get confused, and you run the risk that neither will rank well. That doesn’t mean you can’t use the same keyword on both pages. What it means is to analyze your pages and optimize each of them for a particular key phrase. The next point will help you understand how. 2. Technical optimizations Optimize your website’s main navigation & footer A website’s main navigation menu links and anchor texts are considered a strong signal to search engines about the most important pages of your website, so they are a great place to incorporate your keywords in. In case you are optimizing your navigation it’s important to remember that menu links usually have short anchor texts, pointing visitors to main areas – so keep it simple (i.e. – “Birth date calculator” and not “calculating your expected birth date”). If your website navigation does not allow search engines to get to the important parts of your website, it might be good to create a better navigation that allows engines and users more vision into the main areas and values you offer. The footer works the same, basically, but it’s considered a much lower-weight signal than the main navigation menu. In other words – a link with a good anchor text in the main menu is much more valuable than one in the footer. This is about it from the user’s perspective as well – the footer is the last thing you will get to when scrolling down on a page, and at any time you won’t even have to get there in order to find what you wanted. Should you use keywords in breadcrumbs? That’s a definite Yes. The breadcrumbs are links like any others on your website – navigational links. This means that they should (and usually would) correspond with your main navigation menu and your website hierarchy and that your anchor texts and link titles should do the same. The breadcrumbs also play a role in your website’s visibility in the search results as they are at many times the reason for having sitelinks for generic search terms, and not only for brand searches. Internal links – use keywords to link to relevant content When you link part of the text on your page to another page, you do so by adding a hyperlink. The clickable text that brings the reader to the linked page is the anchor text. This text should be concise and related to the target page content for two reasons: One, the reader will understand what to expect, and two, the search engine crawler can identify the connection. Internal links play a critical role in your site architecture. Your site needs a crawlable link structure that makes it easy for search engines to identify related pages by keywords. The best way to use keywords in an anchor text is to naturally incorporate a keyword that the target page is optimized for. So, when you write on the health insurance page, “Click here to read about health insurance for athletes”, use the last five words in the sentence as anchor text, not the generic “Click here”. What about using keywords in link titles? This is also recommended, as expected. The link title is much like an image “alt” text, but for links. In addition to linking to a different page, you can use the like title to insert your keywords for that page, just as another clue for Google regarding the linked page value and topic. 3. External Links Why anchor text is important in external linking When it comes to using keywords, the considerations for the anchor text of an external link are the same. The difference is that when you link to someone else’s page, you can’t know for sure which keywords they target. Also, keep in mind that external links do not have the same relevance for SEO as internal links. With a link to another website, you support that site because they get a backlink from you. The amount and quality of backlinks are considered one of the main ranking factors for a website. Make sure you link to serious pages and sites that are relevant to the subject of the text you are linking to. Know what’s on the target page and understand the content and its message so that you can choose the best words for your anchor text. Common keyword usage mistakes and how to avoid them Write for your audience Did we stress you with the keyword research idea? Don’t worry, it’s not rocket science. You can use an advanced keyword research tool such as Similarweb to do the hard work. Besides, logic and intuitive thinking are equally important ingredients in SEO. In the past, search engines attempted to match words or phrases exactly. Today, Google’s advanced algorithms are designed to identify search intent effectively. They analyze search terms not merely according to the meaning of the words but the query behind them. This means you need to understand what your audience wants and focus your content creation on matching the searcher’s intent. Above all, provide your audience with what they are looking for. Write for the reader, not for the search engine. Here’s how you can help search engines identify the search intent you target in your content. Incorporate the main keywords at the beginning When visitors arrive at your page, they want to understand what it is about immediately. If they think it’s not what they intended, they will quickly leave. Search engines are designed to mimic the associative thought process of the searcher. Make sure your reader and the search engine identify the page’s relevance to the search term right from the start. Incorporate your focus keyword within the first 100-150 words. Use keywords naturally Write with your audience’s questions in mind and provide related answers. When you write naturally about their pain points, your words will automatically match the search intent. Make sure to write in a language your target audience uses and understands. Similarweb’s keyword research product includes a keyword generator tool to find additional options. Mix short-tail and long-tail keywords You’ve heard the terms short-tail keywords and long-tail keywords. Let’s quickly recap what they mean. Short-tail, also referred to as focus keywords, head terms, or seed keywords, include only one or two words. Long-tail keywords are phrases or even entire sentences that include the focus keyword. As a rule of thumb, you should use a mix of both on your website. Why is that useful? Short-tail keywords are general and have much higher competition and lower conversion rates. On the other hand, they appear in more searches, and you can reach a broader audience. Long-tail keywords narrow down the search intent. This usually leads to higher conversion rates. Here’s an example: Anyone looking for insurance will find you if you rank high for the term. However, there will be many for whom you are not relevant. A more specific long-tail keyword will bring less quantity but higher quality website traffic – that’s who you really want to go after. The number of people looking for “health insurance for professional athletes” is much lower, but will be more relevant for the majority of searchers. Pro Tip: When you optimize your site, make sure to incorporate both short-tail and long-tail keywords. Use them to build a logical structure of related pages and help Google’s crawler detect their connection. For your insurance site, for instance, you could target the focus keyword “health insurance” with one page and add related pages, each focusing on a specific type (and each linking back to th main page). One targets the long-tail keyword “health insurance for athletes,” another one “health insurance for construction workers,” and so on. This way, you appear in general searches and drive a significant amount of traffic, and you’ll also show up in very specific searches that have a better chance of converting. Avoid keyword stuffing Ready to create content from your keywords? Hold your horses and go easy on them. Here’s why. In the past, many companies would jam texts with keywords in the hope of pushing up their ranking. Keywords appeared out of context and in almost every sentence. Today, search engines are smart enough to realize it’s not natural. When crawlers detect high keyword density, it’s labeled “keyword stuffing”. Not only will this harm your ranking, but it can even lead to a search penalty, which removes your page from the SERP entirely. Pro Tip: You can use this formula to calculate keyword density in your content: Keyword Density = (Number of words in copy) / (Number of times keyword appears in copy) The recommended density is about 2%. Using synonyms and semantically related words and phrases is a better tactic than loading your writing with the same expression. Beware of keyword stuffing in your copy and every element of your website, including the tags and snippets we’re about to discuss in the second part of this article. How to monitor your keyword ranking and performance To ensure your keywords do what you want them to do – rank high and drive lots of traffic to your content – you need to check up on them regularly. Set up a rank-tracking routine to monitor what’s going on on the SERP and how your pages act out. The best way to do this is by using a rank tracker tool that does most of the work for you. With Similarweb’s Rank Ranger, for example, you can closely monitor all your keywords and how your pages rank compared to the SERP competition. The tool offers various visualizations and graphs that show the past 30 days, so you can quickly identify changes, instabilities, and issues. For example, the tracking tool shows rank vs. clicks, so you can better assess the value of the keyword rank. You get a complete list of URLs that rank for the tracked keyword and apply filters to hone in on a specific range. The tool lets you investigate fluctuations in rankings and helps you understand Google’s preferences with the help of the SERP features monitor. You can set up dashboards that display the metrics you need to see for your periodic monitoring. From each dashboard, you can dig deeper into various reports and analyze them. A rank-tracking tool is essential in keeping your content optimized. One more piece of advice If you were to request a single piece of advice for using keywords in SEO, this would be it: Use keywords naturally and accurately. Don’t try to outsmart search engines; Simply give your reader what they want. The trick is to discover what your potential customers want and what real people search for. For this, you need an SEO tool that lets you conduct in-depth keyword research to then implement your findings and successfully drive traffic to your website. This blog was written in collaboration with Ruth M. Trucks. Enjoy 360 Visibility 24/7 Get the data you need to adapt to market changes and industry trends in an instant. Try Similarweb for free by Maayan Zohar Basteker Senior SEO Specialist at Similarweb Maayan, with 5+ years in SEO, specializes in complex research, strategy, and technical audits. She previously worked at a top digital marketing agency in Israel. Related Topics: SEO This post is subject to Similarweb legal notices and disclaimers. Related Posts Marketing Intelligence 10 Ways to Get Your Website to Show Up on Google SEO by Limor Barenholtz 10 Min. Oct 22, 2024 Marketing Intelligence How to Increase Organic Traffic to Your Website: A Step-by-Step Guide SEO by Limor Barenholtz 9 Min. Oct 19, 2024 Marketing Intelligence Boost Your Website Traffic With Social Media Marketing Strategy by Itay Gross 8 Min. Oct 17, 2024 Marketing Intelligence Missed brightonSEO? Catch up on Google Trends, AI Impact, and SEO Must-Knows SEO by James Quilter 6 Min. Oct 9, 2024 Marketing Intelligence How to Use Heading Tags? Best Practices for SEO SEO by Lior Shapira 10 Min. Oct 1, 2024 Marketing Intelligence Starting a Blog? Best Blogging Guide for Beginners SEO by Lior Shapira 17 Min. Sep 29, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Where & How to Use Keywords for SEO – What Really Matters"
    },
    {
      "level": "H2",
      "text": "What is a keyword?"
    },
    {
      "level": "H2",
      "text": "What do you do with your SEO keyword research?"
    },
    {
      "level": "H2",
      "text": "Utilize your keyword research in 3 main ways"
    },
    {
      "level": "H3",
      "text": "1. Content optimizations"
    },
    {
      "level": "H4",
      "text": "Create strong title tags"
    },
    {
      "level": "H4",
      "text": "Does a strong meta description impact ranking?"
    },
    {
      "level": "H4",
      "text": "Optimize Image Alt Texts using your keywords"
    },
    {
      "level": "H4",
      "text": "Are you optimizing your images’ title tags?"
    },
    {
      "level": "H4",
      "text": "Create content with related keywords"
    },
    {
      "level": "H3",
      "text": "2. Technical optimizations"
    },
    {
      "level": "H4",
      "text": "Optimize your website’s main navigation & footer"
    },
    {
      "level": "H4",
      "text": "Should you use keywords in breadcrumbs?"
    },
    {
      "level": "H4",
      "text": "Internal links – use keywords to link to relevant content"
    },
    {
      "level": "H4",
      "text": "What about using keywords in link titles?"
    },
    {
      "level": "H3",
      "text": "3. External Links"
    },
    {
      "level": "H4",
      "text": "Why anchor text is important in external linking"
    },
    {
      "level": "H2",
      "text": "Common keyword usage mistakes and how to avoid them"
    },
    {
      "level": "H3",
      "text": "Write for your audience"
    },
    {
      "level": "H3",
      "text": "Incorporate the main keywords at the beginning"
    },
    {
      "level": "H3",
      "text": "Use keywords naturally"
    },
    {
      "level": "H3",
      "text": "Mix short-tail and long-tail keywords"
    },
    {
      "level": "H3",
      "text": "Avoid keyword stuffing"
    },
    {
      "level": "H2",
      "text": "How to monitor your keyword ranking and performance"
    },
    {
      "level": "H3",
      "text": "One more piece of advice"
    },
    {
      "level": "H3",
      "text": "10 Ways to Get Your Website to Show Up on Google"
    },
    {
      "level": "H3",
      "text": "How to Increase Organic Traffic to Your Website: A Step-by-Step Guide"
    },
    {
      "level": "H3",
      "text": "Boost Your Website Traffic With Social Media"
    },
    {
      "level": "H3",
      "text": "Missed brightonSEO? Catch up on Google Trends, AI Impact, and SEO Must-Knows"
    },
    {
      "level": "H3",
      "text": "How to Use Heading Tags? Best Practices for SEO"
    },
    {
      "level": "H3",
      "text": "Starting a Blog? Best Blogging Guide for Beginners"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Maayan Zohar Basteker"
}