{
  "url": "https://www.similarweb.com/blog/marketing/seo/not-hreflang/",
  "slug": "not-hreflang",
  "title": "International SEO is not a Synonym for Hreflang | Similarweb",
  "description": "Discover the main factors you need to take into consideration when creating an international SEO strategy, and particularly when expanding into the EU.",
  "content": "HomeBlogMarketingSEOInternational SEO is not a Synonym for Hreflang Marketing Intelligence International SEO is not a Synonym for Hreflang Start your free trial by Gianluca Fiorelli , Sr. SEO Consultant & Founder of @TheInbounder 3 Min. May 26, 2020 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic A few years ago, Fernando Maciá, one of the most respected SEO veterans of the Spanish Search Industry, asked me to write the introduction for a book about Advanced SEO, which would be published a few months later. In that introduction, I wrote: “SEO is not for the weak in spirit, but for those who know that every day I have to learn a new thing.” If I had to add words to that statement, they would be as follows: “And International SEO is only for those brave of heart, because you never know which unknown territories you will discover with each project.” One of the many mistakes that SEO experts make in their work is reducing International SEO to merely a way to implement hreflang mark-ups. Not that it is incorrect to do so – far from it – but it is incorrect to think that a website is ready to conquer international markets with only the use of hreflang according to the established rules. Why is That My Stance About Hreflang? Instead of answering directly, I propose another question: what is SEO’s function? I think you will agree with me that SEO is a discipline in digital marketing, the purpose of which to make a website more visible, as a result of: Effective studies about the behavior of people as indicated by their internet searches; Studying the explicit research intentions that guide them; Discovering the language people use to search the internet; Understanding how competitors have obtained their visibility within search engines, which we want to replicate for our site; A degree of technical optimization of our site, which does not jeopardize the effectiveness of our SEO strategy. If excelling in these five points is difficult for a site that targets one national market, imagine the challenge that targeting a global market presents. Furthermore, as is typical in SEO, 1 + 1 does not equal 2, but in fact, 3. That’s to say that the difficulties in optimizing for international markets are much greater than the simple sum of the individual markets that are targeted. The Non-SEO Conditions that Influence International SEO Even though we live in a globalized world where the news spreads with a simple click and products become popular worldwide, we can never forget that there are also unique local influences, which ensure that the way information spreads varies greatly in different areas. One of the major factors is local legislation. In the European Union, for example, citizens have the right to move freely between countries, thanks to the Schengen Pact. This right does not refer only to the movement of people, but also to the free movement of goods. In other words, if I, for example, want to buy a product on a website, I can choose to do so on whichever country’s site has a sale regardless if I have a Spanish IP and the offer is on a French site. That right is so strong that even though the Schengen Pact has been temporarily suspended for people due to the Covid-19 crisis, it has not been suspended for the free movement of goods. This means that SEO experts will have to explain to any client who wants to expand into the European Union market that they cannot create a geo-fence and force users to stay on a single version of their website based on an IP address. In fact, doing so would not only be ill-advised from a technical point of view for the correct indexing of their international websites, but also because creating a geo-fence is a reason for onerous fines by the European Union. For most clients, the fines are more than likely to be the main deterrent against geo-fencing than the technical SEO reasons. Another major factor, especially in the case of eCommerce websites, is logistics. In fact, an eCommerce site may sell its products in many countries, but only have warehouses only in a couple of them. Therefore it will need to coordinate its services so that potential customers land on the correct version of the site that correlates to the location of the most relevant warehouse. That need is problematic, which may seem unrelated to SEO, but in reality, it influences the decisions that we SEO professionals must take into consideration when it comes to hreflang implementation, geo-IP 302 redirects, alerts, and even which version of an eCommerce site must be assigned as the default version of the site. As you can see from these two examples, International SEO work starts well before we touch the website itself. For this reason, the first meeting with a client who wants to internationalize online presence should be focused on questions that go beyond SEO and instead, investigate the business plan the client has prepared for the expansion into international markets. For more tips and tricks about building an International SEO strategy and how Similarweb can help, check out Gianluca Fiorelli’s report. by Gianluca Fiorelli Sr. SEO Consultant & Founder of @TheInbounder Gianluca Fiorelli is an international SEO expert and founder of @theinbounder conference. He specializes in SEO, branding, and digital marketing. Related Topics: Marketing Strategy SEO This post is subject to Similarweb legal notices and disclaimers. Related Posts Marketing Intelligence Boost Your Website Traffic With Social Media Marketing Strategy by Itay Gross 8 Min. Oct 17, 2024 Research Intelligence Competitive Benchmarking: Crack the Code to Your Competitors’ Success Business Benchmarking Marketing Strategy by Monique Ellis 9 Min. Sep 10, 2024 Marketing Intelligence Mastering Travel Competitor Analysis: A Step-by-Step Guide Marketing Strategy by Monique Ellis 8 Min. Sep 5, 2024 Marketing Intelligence What is Competitive Intelligence: Importance, Types & More Marketing Strategy by Daniel Schneider 10 Min. Sep 2, 2024 Marketing Intelligence Find Competitors of Your Company Using Smart Strategies Marketing Strategy by Monique Ellis 9 Min. Sep 2, 2024 Marketing Intelligence Finding Your Competitors’ Target Audience for a Unique Edge Marketing Strategy by Monique Ellis 7 Min. Sep 1, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "International SEO is not a Synonym for Hreflang"
    },
    {
      "level": "H2",
      "text": "Why is That My Stance About Hreflang?"
    },
    {
      "level": "H2",
      "text": "The Non-SEO Conditions that Influence International SEO"
    },
    {
      "level": "H3",
      "text": "Boost Your Website Traffic With Social Media"
    },
    {
      "level": "H3",
      "text": "Competitive Benchmarking: Crack the Code to Your Competitors’ Success"
    },
    {
      "level": "H3",
      "text": "Mastering Travel Competitor Analysis: A Step-by-Step Guide"
    },
    {
      "level": "H3",
      "text": "What is Competitive Intelligence: Importance, Types & More"
    },
    {
      "level": "H3",
      "text": "Find Competitors of Your Company Using Smart Strategies"
    },
    {
      "level": "H3",
      "text": "Finding Your Competitors’ Target Audience for a Unique Edge"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Gianluca Fiorelli"
}