{
  "url": "https://www.similarweb.com/blog/marketing/seo/seo-magic-bullet/",
  "slug": "seo-magic-bullet",
  "title": "The SEO Magic Bullet For B2B Marketers | Similarweb",
  "description": "Is there an SEO magic bullet for ranking? Does having more backlinks mean you will rank higher for a keyword? We analyzed the data - Read all about it here",
  "content": "HomeBlogMarketingSEOThe SEO Magic Bullet That B2B Marketers Have Been Waiting For Marketing Intelligence The SEO Magic Bullet That B2B Marketers Have Been Waiting For Start your free trial by Maayan Zohar Basteker , Senior SEO Specialist at Similarweb 7 Min. July 21, 2020 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic If you are in the B2B space and do not have a blog or SEO strategy yet, think again. A 2018 B2BMarketingZone study found that 45% of enterprises spend $20,000 or more each month on SEO. Why? Because 62% of buyers, according to a 2019 CMI study, say they make business decisions based solely on online content. Producing the right content, targeting the right audience, and ranking for the right search terms are all critical parts of the content process and SEO strategy. In this article, we will analyze many different keywords, spread across different industries, and targeted at the various stages of the buyers’ journey to see exactly what kind of content you should be churning in order to outrank the competition. Google Ranking Factors That Matter Before we proceed, here’s a disclaimer: According to Google, there are over 200 factors that determine a page’s ranking for a specific search term. These include: Domain level factors (how old your domain is, for instance) Page-level factors (keyword in the title, H1 tag, description, content length, etc.) Site-level factors (website authority) Backlink factors (how many links are pointed to your page, the website authority of the website linking to you, etc.) Here is the thing – Google’s algorithm is not public. While we know that these factors mentioned above do matter, it is not possible to guarantee a first spot in the SERPs. This article will hence be a reactive guide on how well-ranking pages are taking the right steps to rank for the specific search terms via proper SEO strategy. For the sake of keeping things organized, let’s focus on various keywords related to the SaaS segment, which is a highly competitive industry. Because it’s so competitive, marketers have to do a lot more work in producing content and building authority. You can say that if a particular strategy has worked for them, it can possibly work for your business or industry as well. From Prospect To A Buyer – The Transition A prospective customer goes through three distinct stages in the buying journey: 1) Awareness 2) Consideration 3) Decision The stage of the buyer’s journey is reflected in the kind of keywords they use to search, and their purchase intent (more on this below). The content you produce should also be determined by what the customer is seeking Be Seen By The Prospect Your objective during the ‘Awareness’ stage of the buyer journey is to be seen and known by the prospect. The target keywords here are often generic business-related searches. Competition is high for these keywords since it is not just your direct competitors, but also other businesses that are vying for the same audience. Let’s take a look at the following Awareness stage example on Oberlo (a dropshipping tool from Shopify): Oberlo has an article about digitizing business, and consequently ranks #1 for the keyword “move your business online”. Here, the keyword is not directly related to the product offering. However, the keyword appeals to an audience that may be interested in their offering (a business owner who is launching an online store) Address The Pain Points The buyer is now in the ‘Consideration’ stage of the journey. They acknowledge that a problem exists. Their searches are tangentially related to the solutions you offer. Since you are addressing their pain points, outranking competition here will help you build trust and credibility. This directly impacts conversions in the next stage Here’s a Consideration phase example on PageCloud (a website builder tool): PageCloud ranks #1 for “how to edit a website”. The prospective buyer does not yet need a website builder. But the prospect is curious to learn how to make any website changes without help from an agency. Let’s dive into another Consideration stage example with Genbook (an appointment scheduling tool for local businesses): Genbook ranks #2 for “How to create a book now post on Facebook”. A lot of local businesses rely on social media platforms for business and want to know how to include “Book Now” messages on their Facebook page. Going In For The Kill The prospective buyer is now in the final ‘Decision’ phase in the buying journey. They are now very aware of the needed solution and are shopping for the right tool or provider. Outranking your competitors here is a surefire way to convert your visitor into a customer. We’ll investigate the following Decision phase examples: Jitbit (a helpdesk tool) ranks #2 for “helpdesk demo”. The prospective buyer is now very close to making a decision and is seeking demos from service providers. G2 (a software comparison service) ranks #3 for “video conferencing software” below PCMag which ranks #2 for the same keyword. There is also DGI Communications that ranks #5 for the same keyword. Lifesize (a video conferencing application) ranks on the first page for “free video conferencing” with this article. What you see above are keywords that are highly targeted and specific to the business’ offering. The person searching these terms has very high purchase intent. Outranking competition here increases your chance of converting a prospect into a buyer. So, what exactly do these websites do right in order to rank for these keywords? Let’s analyze these pages. What It Takes To Outrank Your B2B Competitors Remember how there are over 200 factors that influence Google’s ranking algorithm? In the following section, we will see how they influence the rankings of the various SaaS keywords listed above. The Importance of Your Domain Name When it comes to ranking on Google, factors like the creation date and thus the age of a domain can play a critical role. Given this fact, let’s see if this impacts the rankings for the above keywords. Oberlo, the website that ranks #1 for the keyword “move your business online” was registered in June 2014, and enjoys sheer dominance here. Six years is good, but not old enough to be dominating the results as Oberlo does here. In comparison, check out the more competitive keyword “video conferencing software”. G2.com was registered way back in 1995. However, it’s worth pointing out that the company itself started out as G2Crowd.com which came into existence only in 2012, and only later began using the 1995 domain of g2.com. What does Google regard as the domain creation date? It’s anyone’s guess at this point. However, as this SEJ article points out, it is the website age that matters, and not the domain creation date. In this case, G2 would thus be eight years old. PCMag, which outranks G2 for this highly competitive keyword, as well as DGI Communications, lags behind G2, are both a couple of decades old. Source: BulkSEOTools.com What this does seem to suggest is that while the exact age of a domain may not always matter, really old domains can benefit from ranking higher on SERPS for the right keywords. Your On-Page Content Matters While there are plenty of different page-level factors that can influence SERP rankings, there are a few that will generate acute interest. One of these includes content length and keywords in titles, or headers. Take the example of the keyword “how to edit a website”. PageCloud, which ranks #1 for this keyword, has an article that is only 753 words long. Labnol.org, which ranks second, only contains 616 words. KopywritingKourse ranks #5 in the list and has an article that has over 5200 words, according to the website WordCounter.net. Does this mean that word count is not a significant factor? Not necessarily. What this probably implies is that while word count has helped KopywritingKourse beat the competition in order to hit the front page of the SERPs, there are perhaps other, more critical factors that influence ranking. Strategically placing the keyword in the title might be one of them. While PageCloud includes the exact match in their URL, the rest of the pages ranking on the first page of Google for this keyword only have semantically similar keywords. More Backlinks Don’t Always Mean Higher Ranking There are plenty of backlink-related factors that impact Google rankings. The most significant of them is the number of inbound links at a domain level. Majestic is a great tool to capture data related to this metric. For the keyword, “How To Create a Book Now Post On Facebook”, eConsultancy enjoys over 1.4 million backlinks, while Genbook has 2.91 million backlinks. For the keyword, “Free Video Conferencing”, Lifesize has 246K backlinks while HowToGeek (5.87 million), CNET (73.8 million), Zoom (79.98 million), TechRadar (55.2 million) all have several million more backlinks. For the keyword, “Helpdesk demo”, Hesk, the site ranking #1 has 1.46 million backlinks, while Jitbit, the site ranking #2 has 2.61 million backlinks with their demo page. Despite all these metrics, there is nothing conclusive here. While there are keywords where the influence of backlinks can be quite clearly seen, there are others where alternative factors play a bigger role than just backlinks in determining SERPs ranking. The Magic Bullet To Rank For B2B Keywords So what does it take to rank for your B2B marketing keywords? Is it the domain that matters? The content? The backlinks? Sorry to disappoint, but the key takeaway here is that there is no magic bullet. All of these different factors matter in equal measure. However, this does not mean that a younger website cannot outrank an older competition simply because domain age matters. What you lack in one factor may be more than compensated by doing well in another factor. As a B2B marketer, this is the key aspect to look for. And that is the only way to outdo the competition in SERPs. To improve your SEO keyword research, download Similarweb’s latest ebook and set yourself up for success. Enjoy 360 Visibility 24/7 Get the data you need to adapt to market changes and industry trends in an instant. Try Similarweb for free by Maayan Zohar Basteker Senior SEO Specialist at Similarweb Maayan, with 5+ years in SEO, specializes in complex research, strategy, and technical audits. She previously worked at a top digital marketing agency in Israel. Related Topics: SEO This post is subject to Similarweb legal notices and disclaimers. Related Posts Marketing Intelligence 10 Ways to Get Your Website to Show Up on Google SEO by Limor Barenholtz 10 Min. Oct 22, 2024 Marketing Intelligence How to Increase Organic Traffic to Your Website: A Step-by-Step Guide SEO by Limor Barenholtz 9 Min. Oct 19, 2024 Marketing Intelligence Boost Your Website Traffic With Social Media Marketing Strategy by Itay Gross 8 Min. Oct 17, 2024 Marketing Intelligence Missed brightonSEO? Catch up on Google Trends, AI Impact, and SEO Must-Knows SEO by James Quilter 6 Min. Oct 9, 2024 Marketing Intelligence How to Use Heading Tags? Best Practices for SEO SEO by Lior Shapira 10 Min. Oct 1, 2024 Marketing Intelligence Starting a Blog? Best Blogging Guide for Beginners SEO by Lior Shapira 17 Min. Sep 29, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "The SEO Magic Bullet That B2B Marketers Have Been Waiting For"
    },
    {
      "level": "H2",
      "text": "Google Ranking Factors That Matter"
    },
    {
      "level": "H2",
      "text": "From Prospect To A Buyer – The Transition"
    },
    {
      "level": "H3",
      "text": "Be Seen By The Prospect"
    },
    {
      "level": "H3",
      "text": "Address The Pain Points"
    },
    {
      "level": "H3",
      "text": "Going In For The Kill"
    },
    {
      "level": "H2",
      "text": "What It Takes To Outrank Your B2B Competitors"
    },
    {
      "level": "H3",
      "text": "The Importance of Your Domain Name"
    },
    {
      "level": "H3",
      "text": "Your On-Page Content Matters"
    },
    {
      "level": "H3",
      "text": "More Backlinks Don’t Always Mean Higher Ranking"
    },
    {
      "level": "H3",
      "text": "10 Ways to Get Your Website to Show Up on Google"
    },
    {
      "level": "H3",
      "text": "How to Increase Organic Traffic to Your Website: A Step-by-Step Guide"
    },
    {
      "level": "H3",
      "text": "Boost Your Website Traffic With Social Media"
    },
    {
      "level": "H3",
      "text": "Missed brightonSEO? Catch up on Google Trends, AI Impact, and SEO Must-Knows"
    },
    {
      "level": "H3",
      "text": "How to Use Heading Tags? Best Practices for SEO"
    },
    {
      "level": "H3",
      "text": "Starting a Blog? Best Blogging Guide for Beginners"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Maayan Zohar Basteker"
}