{
  "url": "https://www.similarweb.com/blog/marketing/seo/serp-feature-search-intent-data/",
  "slug": "serp-feature-search-intent-data",
  "title": "What Can SERP Features Tell You About Search Intent | Similarweb",
  "description": "How much traffic you can get on a SERP where there is a SERP feature? I looked into the data and discovered some interesting patterns. Find out more here.",
  "content": "HomeBlogMarketingSEOWhat Can SERP Features Tell You About Search Intent Marketing Intelligence What Can SERP Features Tell You About Search Intent Start your free trial by Darrell Mordecai 9 Min. May 24, 2023 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Google doesn’t publish SERP feature data. As a result, when it comes to SERP features, SEOs are left scratching their heads. Should we target SERP features? How much traffic can we expect from them? What do they tell us about user intent? How should we treat them strategically? So I decided to dig into some data to work this out. In this post, I’ll present the SERP feature data I found and examine what it means to your SEO strategy moving forward. The SERP Feature Data Before I get into the insights, I want to explain how I found this information. This study represents the melding of two data sets. Yes, I work for Rank Ranger and Similarweb. This means I have access to our Rank tracker’s SERP feature data and Similarweb’s keyword analysis tools. So I pulled thousands of keywords from the Rank tracker’s SERP feature data and ran them through Similarweb’s Keyword Analysis. What’s more, I didn’t need to use spreadsheets. I simply dropped the keywords into the Similarweb UI. A big win if you ask me. The Analysis Methodology Now that you understand the data, you have to understand what I’m actually measuring. I have no access to SERP feature click-through data. (Larry Page keeps this data hidden under his bed next to his secret teddy bear collection.) Instead, I pulled thousands of keywords where a specific SERP feature appears on the Google SERP. I created three buckets: Direct Answer keywords Featured Snippet keywords Knowledge Panel keywords My goal in doing this was to see if there are any obvious patterns that occur for each SERP feature. In other words, I assume that each SERP feature has a specific purpose, and looking for patterns will reveal how those SERP features help the user. The better you understand that, the better you can create content designed to help the user. This should mean more engaged traffic. And with a highly engaged audience, you’ll be able to naturally move them to the next stage of the buyer’s journey. So let’s jump into the data. Direct Answers Google’s Direct Answers SERP feature provides a concise response directly in the search results, without including a link to a specific webpage. It aims to provide a quick and straightforward answer to a user’s query. Now, understanding what a direct answer is, you’d imagine people are making these simple searches, finding their answers, and bouncing. In other words, you might imagine users who are checking the weather and have no need to click through to any results. So let’s look at the data. As you can see from the screenshot above, 74% of these searches are Zero-Click searches. That means 26% of this audience is clicking through to independent sites. That number is substantially higher than I was expecting. In other words, a percentage of these searches represent the beginning of a search journey. If we look at Organic vs Paid we see that a staggering 99,11% are organic. This is not at all surprising as people asking simple questions are not in the buying frame of mind. Now, let’s take a look at the search intent. As you can see from the screenshot above, the vast majority are informational. This is not surprising as Direct Answers are designed to answer specific user questions. They are looking for information. The bottom line from an SEO perspective is, that these keywords offer you the lowest value. Even if you are able to rank your content at the top of the search results only 26% of that audience is likely to click on your result. If you do decide to target these keywords, strategically you should be thinking of users at the beginning of a search journey. This means if you are able to get them to click, they are far from ready to buy anything. Focus on engagement and relationship building. Featured Snippets The Featured Snippet SERP feature presents a summarized answer at the top of the search results page. Unlike the Direct Answer, a Featured Snippet includes a link to the webpage from where the information was extracted. The link is typically accompanied by a brief excerpt that highlights the relevant content. I assume that this means Google includes the link because the user is more likely to click through to see a result. So for example, if you Google ‘2 car carport dimensions’ Google offers you a summarized answer. Okay, the user got what they were looking for. Why would they click through to the results? Well, if you click through to the content, the answer to this question is instantly obvious. As you can see from the screenshot above, carport sizes are not standard. There is no one simple answer and the website makes a recommendation that doesn’t appear in the Featured Snippet. My hypothesis is… A Featured Snippet provides an answer to a question that requires more delving. This means the user is more likely to click the results. Let’s see if the data supports my theory. As you can see from the screenshot above, 31% of the users making these searches are clicking through to view user-generated content. This is slightly higher than Direct Answers, which only earned 26% clicks which perhaps supports my hypothesis. Looking at intent we see the vast majority of the searches are looking for information. This is 100% in line with the expectation as Featured Snippets are directly answering user queries. Looking at Organic vs Paid, we see results that are similar to Direct Answers. The reason is the same as above. These searches are informational and advertisers prefer to spend money on searches that are lower down on the funnel. The bottom line is Featured Snippet searches are slightly more valuable than Direct Answer searches because users are more likely to click through to your content. Strategically target these searches to bring in top-of-the-funnel traffic to your brand. Once they are visiting your site, try to find ways to engage with this audience further. You never know when they will be ready to make a purchase. Knowledge Panels Google’s Knowledge Panels are information boxes that appear on the right-hand side of the search results page for specific entities, such as people, places, organizations, or topics. These panels aim to provide a comprehensive overview of the entity by aggregating information from various sources across the web. Knowledge Panels typically include key details about the entity, such as a brief description, images, related people or entities, website links, social media profiles, and other relevant information. They may also contain additional features like maps, reviews, ratings, and interactive elements, depending on the type of entity being displayed. The information displayed in Knowledge Panels is automatically generated by Google’s algorithms, which gather and organize data from reliable sources such as Wikipedia, official websites, and other trusted references. However, users can suggest edits or provide feedback to help improve the accuracy and completeness of the information presented in the Knowledge Panels. Now, it’s important to understand that Knowledge Panels are designed to be at the beginning of a search journey. To help users along their journeys, Google treats these searches as doorways into the topic. For those who are happy with a simple definition, there is usually a definition that more often than not comes from Wikipedia. If the user wants to carry on their search journey a typical Knowledge Panel provides links to related entities or features designed to refine the user’s original search. As you can see in the screenshot above, the Knowledge Panel includes a Wikipedia definition with a link. There are also subtopic dropdown menus for: Owner Founder Launch date In the screenshot above, Google provides links for: Metropolitan statistical area The mayor The weather With all of that in mind, let’s take a look at the data. The Zero-Click search data is interesting. Around half of these searches result in a click. Now to be clear, a click is defined as someone clicking a link and visiting a 3rd party website. If someone clicks a People Also Ask box and views the answer in the search results, or if someone clicks a People Also Search result and is redirected to another search result, these are counted as zero clicks. This means at least half of these users are looking for user-generated content. The rest were either satisfied by the search results or continued their search journeys by making further searches. Like Direct Answers and Featured Snippets, Knowledge Panels represent the beginning of the search journey. This explains why advertisers are not investing in these keywords. Looking at intent data, we see as expected the vast majority are informational. There are some navigational and transactional results. From a little experience, I believe these keywords represent branded keywords. And this means, yes many of these searches include broad searches for entities, but many include specific searches for brands. Yes, entity keywords might be difficult to target. If you are able to rank for them you could potentially see massive traffic. But, from experience, you’ll have to work on engaging this audience because as I’ve mentioned above, this audience is far from ready to buy anything. Branded keywords on the other hand are easy to rank on. Strategically when targeting branded keywords, you should be looking to increase your visibility on these SERPs. In other words, you should try to get site links, and Twitter boxes, and rank in all of the People Also Ask queries. Enhance Your SEO Strategy With Keyword Insights As you can see we can find a wealth of insights by analyzing keywords. And, understanding how the SERPs are designed to satisfy users and by seeing how users are reacting to these results can take your data analysis to the next level. For instance, once you have found your target keywords, analyze them further with tools like Similarweb to see: Zero-click data Intent Organic vs. paid distribution Then, break your keywords down into buckets so that you can tailor your strategy accordingly. For keywords with informational intent and a high occurrence of zero-click searches, consider developing evergreen content that directly addresses user queries. While these keywords may not generate immediate clicks or conversions, they play a vital role in establishing your brand as a trusted source of information. Focus on engaging and building relationships with these users at the beginning of their search journey, as they may convert into valuable customers over time. On the other hand, keywords with a transactional intent or a high ratio of paid results show a high likelihood of driving sales. Invest more resources in optimizing your content and targeting these specific queries. Although these keywords are highly competitive, they do have the potential to bring in immediate results and a higher return on investment. Take It to the Next Level With Keyword Tagging Once you have bucketed your keywords into search intent, you should treat them accordingly. This means when tracking your keywords, you could potentially bucket them according to strategy in your rank tracker by setting up tags according to intent. This way you can instantly analyze how your TOFU, MOFU, and BOFU content is performing. And having this clear will help you figure out what actions to focus on to move your business forward. As you can see from the screenshot above, the Rank Ranger Daily Snapshot (by Tag) is showing you keyword clusters that are grouped by intent. For instance, the Informational Keyword cluster includes 25 keywords. The Commercial Keyword cluster includes 11 keywords. By doing this you are able to analyze your keyword clusters and optimize each stage of the user journey separately. For instance, you might see that for one cluster a large number of URLs are ranking on page two. This means you might want to focus on bringing the URLs for that cluster onto page one. You can easily see that on the Tag Rank Distribution report. Now this is just one small example of how keyword tagging can help you visualize and optimize your customer journey. There is a lot more to say but I’ll leave it for another post. by Darrell Mordecai Darrell creates SEO content for Similarweb, drawing on his deep understanding of SEO and Google patents. Related Topics: SEO This post is subject to Similarweb legal notices and disclaimers. Related Posts Marketing Intelligence 10 Ways to Get Your Website to Show Up on Google SEO by Limor Barenholtz 10 Min. Oct 22, 2024 Marketing Intelligence How to Increase Organic Traffic to Your Website: A Step-by-Step Guide SEO by Limor Barenholtz 9 Min. Oct 19, 2024 Marketing Intelligence Boost Your Website Traffic With Social Media Marketing Strategy by Itay Gross 8 Min. Oct 17, 2024 Marketing Intelligence Missed brightonSEO? Catch up on Google Trends, AI Impact, and SEO Must-Knows SEO by James Quilter 6 Min. Oct 9, 2024 Marketing Intelligence How to Use Heading Tags? Best Practices for SEO SEO by Lior Shapira 10 Min. Oct 1, 2024 Marketing Intelligence Starting a Blog? Best Blogging Guide for Beginners SEO by Lior Shapira 17 Min. Sep 29, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "What Can SERP Features Tell You About Search Intent"
    },
    {
      "level": "H2",
      "text": "The SERP Feature Data"
    },
    {
      "level": "H2",
      "text": "The Analysis Methodology"
    },
    {
      "level": "H2",
      "text": "Direct Answers"
    },
    {
      "level": "H2",
      "text": "Featured Snippets"
    },
    {
      "level": "H2",
      "text": "Knowledge Panels"
    },
    {
      "level": "H2",
      "text": "Enhance Your SEO Strategy With Keyword Insights"
    },
    {
      "level": "H2",
      "text": "Take It to the Next Level With Keyword Tagging"
    },
    {
      "level": "H3",
      "text": "10 Ways to Get Your Website to Show Up on Google"
    },
    {
      "level": "H3",
      "text": "How to Increase Organic Traffic to Your Website: A Step-by-Step Guide"
    },
    {
      "level": "H3",
      "text": "Boost Your Website Traffic With Social Media"
    },
    {
      "level": "H3",
      "text": "Missed brightonSEO? Catch up on Google Trends, AI Impact, and SEO Must-Knows"
    },
    {
      "level": "H3",
      "text": "How to Use Heading Tags? Best Practices for SEO"
    },
    {
      "level": "H3",
      "text": "Starting a Blog? Best Blogging Guide for Beginners"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Darrell Mordecai"
}