{
  "url": "https://www.similarweb.com/blog/marketing/seo/technical-site-audit/",
  "slug": "technical-site-audit",
  "title": "How to do an SEO Technical Site Audit? | Similarweb",
  "description": "What should be included in a site audit and how do you know if you got your money’s worth? In this post we show you how.",
  "content": "HomeBlogMarketingSEOWhat Should Be Included in a Technical Site Audit Marketing Intelligence What Should Be Included in a Technical Site Audit Start your free trial by Darrell Mordecai 7 Min. February 17, 2014 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic As a business owner, you probably get generic emails all the time stating there are many things wrong with your site. These emails come with a promise to fix up your site so it ranks number one for just a few hundred dollars. You know you need to spiff up your site, and you are leery of these unsolicited emails. But on the other side of the coin you have SEO agencies that may charge $1000 or more for a site audit. So what do you do? What should be included in a site audit and how do you know if you got your money’s worth? There are many facets to a technical site audit. Many factors depend on the kind of business you run. Is it an e-commerce business wholly dependent on organic search for profitability? Is it a brick and mortar looking to enhance its sales with an online presence? Or is it a local business, like a landscaper that is dependent on being found in local search? Depending on the answer your SEO agency should look at a number of factors. Because of these factors, this post isn’t meant to be a comprehensive list of everything to everyone. However, any technical site audit should review the following: Google Analytics A good SEO agency will start with the basics – and that’s Google Analytics, a free web analytics service providing data and basic analytic tools for search engine optimization (SEO) and digital marketing purposes. If you have software to help you keep track of it all, most systems will pull data directly from GA. Some things that your agency will look at include: has it been set up correctly? Have you filtered out the IP address of the company – making sure that the 300 or so visits a day you get from employees don’t count? If you have an AdWords account is it linked properly? You should also check to make sure you have linked your Analytics account with an SEO platform such as Rank Ranger. Google Search Console Google Search Console (GSC) helps you understand how Google views your site. You can see if your site is healthy, or if you need to address errors, indexing rate decline or even penalties. Your agency should also check to ensure sharing between GSC and Google Analytics is enabled so you can see search queries directly in GA. Robots.txt The robots.txt file is a way to let Google know if there are pages on your site that shouldn’t crawl or index. Google doesn’t have to listen, but providing this is a good way to let Google know what you’d prefer. Sitemap Sitemaps are another way to communicate to Google about all the pages on your site. By creating and submitting your XML sitemap to Google through Search Console, you are informing Google about all the pages on your site it should crawl. Duplicate Content When Google finds identical pieces of content on the web, it has to decide which is more relevant. Whether you are the original creator or not, Google may choose to show someone else’s content. It’s in your best interest to ensure there is no substantial duplicate content from your site out there. Title & Meta Tags Title tags and meta tags should be reviewed to ensure that pages have unique tags. They should also be checked for proper keyword mapping to each page. That means keeping the page thematically relevant and using semantically related keywords throughout the tags and the content of the page. Lastly, are tags the proper length? Do they contain compelling calls to action? Rich Snippets – Reviews Does your site offer a product or service that can be reviewed? Use snippets and take advantage of Schema markup for reviews of your services. Using Schema, you can mark-up your pages in ways recognized by major search engines including Bing, Google, and Yahoo! Website Hierarchy & Navigation The agency should examine your website hierarchy from both a user perspective and to see how Google might crawl the site. Notice I put the user first – because that’s also what Google does. So create your site hierarchy for the user. This means things like having your most important pages easily reached and having your site laid out in an intuitive way. This hierarchy should be reflected in the URL structure as well because search engines don’t necessarily see the hierarchy – but they do see the URL structure. The logical URL structure and a way of conveying the site’s hierarchy to search engines can be achieved through communicative URLs. Internal Linking Internal linking is text-based linking from one page on the site to another, and is used to link keywords with relevant pages on your website. This helps search engines understand the relationship among pages and importance as they crawl your site. 404 Error Page The 404-error page tells users that a page which they attempted to navigate to does not exist. Use the 404 page as an opportunity to communicate to the user what the business is about and let them know what the next step may be. Provide suggestions for alternative navigation: Mobile Version How does your site look on a mobile device? Given the 39% rise in the number of shoppers using mobile devices over the last holiday season it’s critically important that your site looks and functions properly on all devices. Does your agency recommend a responsive site or a separate mobile site? They should have a recommendation one way or another and a solid reason why. Just remember, if you’re thinking of designing a mobile site to just add on to your desktop site – you’ll end up doing two of everything to keep up. Make sure there’s a solid strategy in place before you make this sort of decision. Site Speed Does the agency look at your site speed and recommend ways to improve it? Site speed is another important factor. What’s your site speed on a desktop versus a mobile device? If your site takes a long time to load – users will simply hit the back button. Social Media and Social Sharing Buttons Social signals have become increasingly important over the last year and will continue to gain traction. When people want to share information about your site on their social networks, make it as easy as possible by placing social sharing buttons on each page: Breadcrumbs Breadcrumb navigation offers a visually enticing way for users to keep track and know where they’re specifically located as they navigate your site. For search engines, breadcrumbs provide a quick navigational guide on where to go after they are done crawling one page. A good breadcrumb navigation looks like: Canonical Version A canonical page is the preferred version of a set of pages with highly similar content and usually refers to home pages. For example, most people would consider these the same URLs: www.example.com example.com www.example.com/index.html example.com/index.html However, search engines do not. They see these as separate pages. Because of this, you run the risk of the search engines considering these duplicate pages. To eliminate that risk, your web dev should implement page level 301 redirects to the one version of the page you would like to serve as the official. W3C Validation W3C stands for World Wide Web Consortium. It’s an organization that maintains standards for HTML and CSS Markup for the web. By complying with these standards in web design, it helps to ensure your site is compatible across various browser platforms, and operating systems. You can run a simple test here: http://validator.w3.org/ to see if your site complies. Code-to-Content Ratio The code-to-content ratio represents the percentage of actual text in a web page. The code-to-content ratio of a page is used by search engines and spiders to calculate the relevancy of a web page. Web crawlers want to make sure the pages they return match the queries that have been entered. One way is to ensure the content on the page is highly relevant. You can test your code-to-content ratio here: http://www.searchenginegenie.com/tools/ContentToTextRatio.php Anything lower than 25% and you should think about providing more content for your users and perhaps cleaning up the code on the backside. Location Page + Schema Code You should use a set of schemas for structured data markup on web pages. You can use these on separate location pages to signal to Google, Yahoo! And Bing your location. Find out more about location schema here: http://schema.org/LocalBusiness Authorship Using Google Authorship in conjunction with a Google+ account is a simple way to help visitors and searchers tie together your outside website efforts and actions such as writing articles and white papers. If done correctly, you will see results like this in the search engine results pages: Google has a tool to test it here. Image Alt tags If you have a site that is very dependent on images, such as a product, then ensuring that you have image alt tags will be important and relevant. If, however, you just have a few images or stock photos, don’t bother worrying about image alt tags. Besides being a waste of time, you may also be guilty of over-optimization. Blog Do you have a blog – and is it active? Is it on the same domain as your website? If it is, consider putting the three newest posts as a snippet on the homepage to make the homepage fresher. Other ideas you may want to include are service-specific testimonials on each page, transcriptions of videos, and a simple Contact Us form on each page of the site. A good SEO company will examine all of the elements above but also make suggestions for improvement that don’t necessarily apply across the board. Your technical site audit should provide you with a roadmap of where you want to take your site. by Darrell Mordecai Darrell creates SEO content for Similarweb, drawing on his deep understanding of SEO and Google patents. Related Topics: SEO This post is subject to Similarweb legal notices and disclaimers. Related Posts Marketing Intelligence 10 Ways to Get Your Website to Show Up on Google SEO by Limor Barenholtz 10 Min. Oct 22, 2024 Marketing Intelligence How to Increase Organic Traffic to Your Website: A Step-by-Step Guide SEO by Limor Barenholtz 9 Min. Oct 19, 2024 Marketing Intelligence Boost Your Website Traffic With Social Media Marketing Strategy by Itay Gross 8 Min. Oct 17, 2024 Marketing Intelligence Missed brightonSEO? Catch up on Google Trends, AI Impact, and SEO Must-Knows SEO by James Quilter 6 Min. Oct 9, 2024 Marketing Intelligence How to Use Heading Tags? Best Practices for SEO SEO by Lior Shapira 10 Min. Oct 1, 2024 Marketing Intelligence Starting a Blog? Best Blogging Guide for Beginners SEO by Lior Shapira 17 Min. Sep 29, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "What Should Be Included in a Technical Site Audit"
    },
    {
      "level": "H2",
      "text": "Google Analytics"
    },
    {
      "level": "H2",
      "text": "Google Search Console"
    },
    {
      "level": "H2",
      "text": "Robots.txt"
    },
    {
      "level": "H2",
      "text": "Sitemap"
    },
    {
      "level": "H2",
      "text": "Duplicate Content"
    },
    {
      "level": "H2",
      "text": "Title & Meta Tags"
    },
    {
      "level": "H2",
      "text": "Rich Snippets – Reviews"
    },
    {
      "level": "H2",
      "text": "Website Hierarchy & Navigation"
    },
    {
      "level": "H2",
      "text": "Internal Linking"
    },
    {
      "level": "H2",
      "text": "404 Error Page"
    },
    {
      "level": "H2",
      "text": "Mobile Version"
    },
    {
      "level": "H2",
      "text": "Site Speed"
    },
    {
      "level": "H2",
      "text": "Social Media and Social Sharing Buttons"
    },
    {
      "level": "H2",
      "text": "Breadcrumbs"
    },
    {
      "level": "H2",
      "text": "Canonical Version"
    },
    {
      "level": "H2",
      "text": "W3C Validation"
    },
    {
      "level": "H2",
      "text": "Code-to-Content Ratio"
    },
    {
      "level": "H2",
      "text": "Location Page + Schema Code"
    },
    {
      "level": "H2",
      "text": "Authorship"
    },
    {
      "level": "H2",
      "text": "Image Alt tags"
    },
    {
      "level": "H2",
      "text": "Blog"
    },
    {
      "level": "H3",
      "text": "10 Ways to Get Your Website to Show Up on Google"
    },
    {
      "level": "H3",
      "text": "How to Increase Organic Traffic to Your Website: A Step-by-Step Guide"
    },
    {
      "level": "H3",
      "text": "Boost Your Website Traffic With Social Media"
    },
    {
      "level": "H3",
      "text": "Missed brightonSEO? Catch up on Google Trends, AI Impact, and SEO Must-Knows"
    },
    {
      "level": "H3",
      "text": "How to Use Heading Tags? Best Practices for SEO"
    },
    {
      "level": "H3",
      "text": "Starting a Blog? Best Blogging Guide for Beginners"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Darrell Mordecai"
}