{
  "url": "https://www.similarweb.com/blog/marketing/seo/things-to-know/",
  "slug": "things-to-know",
  "title": "Google’s Things to Know SERP Feature | Similarweb",
  "description": "In 2022, Google launched Things to Know SERP feature. Understanding the new SERP feature could change your SEO activity. Enter to learn more.",
  "content": "HomeBlogMarketingSEOUnderstanding Google’s Things to Know SERP Feature Marketing Intelligence Understanding Google’s Things to Know SERP Feature Start your free trial by Darrell Mordecai 11 Min. June 23, 2022 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic When the May 2022 Core Update rolled out and the dust settled, we were all looking at the Google SERPs wondering what had changed. Yes, there are always rankings that change based on quality signals. But, as Google adds and changes its SERP features it really pays to be aware of those changes. So, on May 24th, I noticed this tweet by Lily Ray: The Tweet caught my attention for two reasons: It was a new feature and Similarweb is all about bringing you relevant actionable data about the Google SERPs The nature of the feature could change how you do SEO moving forward In order to understand why it might change SEO, I’ll first cover what we are seeing on the ground. What is The Things to Know Feature and How It Changes the User Experience? Google’s Things to Know SERP feature provides an expandable list of questions and subtopics that users commonly search when exploring a topic. The feature is designed to break the topic down into subtopics in order to help users at the beginning of a search journey. Now let’s understand that further. Over the past few years, Google’s approach to satisfying its customers has shifted from trying to answer user questions to taking its users on a journey of discovery. In a nutshell, this means when a person Googles something, they are not always looking for a quick answer to a question. Often a user is exploring the topic. They might type a broad query into Google, trying to understand a general topic. Once the user has a little information about the topic, they typically make another search, this time one that’s more refined. This process repeats itself until the user finds what they are looking for through a journey of discovery. To deal with this, in 2018, Google made a big announcement… Google’s Announcement Google announced that the search engine was changing its focus from providing answers to journeys. If you want to understand search journeys better check out how they describe journeys on their blog post. Simply speaking a search journey is when a user is researching a topic. This might result in multiple searches over time as broad topics often have many aspects a user might want to explore. This is a change in focus that has changed how we do SEO. The reason is that Google is not only presenting content to answer user queries. If Google can answer all the top-level general questions in the SERP and only encourage a click for something more specific, then the user is happy and so is Google. Now that you understand what search journeys mean to SEO, let’s take a look at Google’s new SERP feature ‘Things to Know’. The Things to Know Feature – A Stable Work In Progress Rank Ranger began tracking the feature on June 1st in both our API and Mobile SERP Features tool. At the time, we noticed that off the bat it was showing up on nearly 1% of SERP results. What’s more, when Google tests a new feature, it generally shows up inconsistently. The ‘Things to Know’ feature showed up consistently, day after day. All this seemed to indicate that the feature was here to stay. Looking at our data a year later, we see that the feature is now showing up on approximately 7.5% of mobile search results. That’s a substantial increase. If Google is taking this feature seriously, so should you. And, according to Rank Ranger data, we are seeing that it’s currently only showing up on mobile in the US. The fact that it’s only showing up in the US is not surprising. In the past, we’ve seen Google testing SERP features in the US before taking them to other countries. Also, there might be a reason it’s only showing up on mobile. I’d suggest that Google first collects data on the usage and relevance of the feature before taking it to a wider screen because on mobile the user is forced to view it before seeing other results. Okay, let’s look at some data. Digging Into the Data In order to understand the feature further, our SERP Team pulled out a list of keywords for the queries that produce a Things to Know box. I loaded the keywords into the Similarweb Acquisition SEO report to see what insights I could find. The first thing that caught my attention was the Zero Clicks metric. Zero-Click Searches In the screenshot above, you’ll see that 73% of searches were zero-click. This could mean one of two things. Either the user found what they were looking for in the SERP, which typically happens when people search things like the weather, or they clicked SERP features designed to refine their searches. So for instance, if Google suggests a different search and the user clicks on it, the search will be considered a no-click search. In other words, a click to an organic result is considered a click. Refining a search is not. To figure this out, let’s have a look at some of the keywords. college application process commodities trading drop shipping government bonds intermittent fasting The list above is a small sample of the keywords. Now, if you look at the keywords, you’ll notice that all of them are broad and unrefined. For instance, if you look at the keyword ‘commodities trading’, you’ll notice that the searcher hasn’t defined specifically what they want to research. They are searching the entire topic. Commodities trading has many aspects to it. I’ve looked through the keyword list, and from what I’ve seen, they are broad and unrefined searches like the ones above. This leads me to believe that the reason such a high quantity of keywords are resulting in zero clicks is the user is at the start of their journey and they are not ready to click through to any specific content. They are still looking for basic information. Another thing that caught my attention is the Organic vs Paid traffic. Organic vs Paid In the screenshot above, you’ll see a whopping 98.72% of the results are organic and not paid. Again, if we look at the keyword list, this will make perfect sense. Since the nature of the searches are broad and unrefined, only a tiny 1.28% of traffic is coming from advertising. The rest of the results are organic. One possible reason is if you advertise on broad informational searches where the search intent is undefined you’ll burn a hole in your credit card, so I don’t expect a huge volume of ads on these SERPs. Also, even if there are ads on these searches, ads usually serve a commercial intent. These searches have little to no commercial intent. Instead, the searcher is at the beginning of a search journey that may require many searches before they click through to any content. The Similarweb data paints an interesting picture… The Data Speaks When we look at the data together with the keywords we see an interesting picture that will give us an insight into how Google is serving its users. Google most likely doesn’t expect many users to click through to content and as a result is helping them understand the topic from the ground up. Understanding this further… How Does the Feature Change the Search Journey? As I mentioned above, Google is looking to take its users on journeys of discovery. This means Google is featuring information that’s higher up on the funnel right in the SERPs. As a user, you can click Google’s Things to Know accordion and see information right in the SERP. So, let’s look at an example. In the screenshot below, I have searched the term ‘about solar panels’. Firstly, Google suggests refining your search by giving you more options: Solar power Solar panel Scroll down and you see a Featured Snippet coming from Wikipedia. Google generally favors Wikipedia pages and more often than not uses Wikipedia to define entities. You then have the Things to Know and People Also Ask features. And finally organic results. Now, if I didn’t know any better, I’d think that Google is trying to get my attention. In other words… This indicates that Google is trying to keep the user’s attention, perhaps trying to help them to refine their search before offering an answer Now allow me to explain this further by looking at a different SERP. Is Google Replacing Head Terms With SERP Features? – SERP Analysis To try to wrap my head around the new feature, I had a look at many SERPs to see if there are any obvious patterns. Let’s look at the SERP for the keyword ‘affiliate marketing guide’ and apply some critical thinking… The first point is, as I’ve mentioned above, the query is fairly generic. You’d imagine the answer to a search query like ‘affiliate marketing guide’ would be a pillar page that covers the entire topic. If you’re not familiar with pillar pages, a pillar page covers an entire topic superficially. The page then features internal links to more in-depth articles. The goal of these pillar pages is to help give the reader an overview of the entire topic while providing them with an opportunity to explore any aspect of the topic they are interested in. This means, that the more generic the search query, the more likely you’ll see a pillar page ranking at the top. Back to the SERP… To answer the query, Google features a 4500-word pillar page as the top ranking. Makes perfect sense. Scroll down, and you see a ‘Things to know’ SERP feature. The feature includes top-level information like: Rules… How to successfully do… Startup costs… How to get start This is Google’s attempt at entering the user’s search journey while keeping them in Google’s ecosystem without the need for an additional search. What I find interesting is… These are all the types of overview questions that you’d expect to see in a pillar page. What’s more, you can click any heading in the feature and you’ll see an overview of the topic, presented the way you’d expect from a Featured Snippet. This is similar to how a pillar page allows you to click through to more granular information through internal links. If the user is not happy with the top-level Featured Snippet style summary, they can click through to the article where Google is pulling the information from. What’s more, if you look below the page title, Google adds a link to click through to the SERP for the term ‘how to be a successful affiliate marketing step by step’ (grammatical errors and all!) In other words, if the user isn’t happy clicking through to the suggested content, Google will keep you in its SERPs by suggesting another search. This provides a great user experience. Now you understand the feature, what does this mean to your SEO strategy? Things to Know – An Opportunity in Disguise Okay, I’ve covered how the Things to Know SERP feature is covering the beginning of the search journey. As I mentioned above, the SERP feature is in some way performing the function of a pillar page. And as a result, there are now some big opportunities to rank your supporting pages. Back to the keyword ‘about solar panels’… As you can see from the screenshot above, Google is inserting multiple user intents into the SERP. Even if you don’t get a pillar page into this SERP you can still get targeted SEO traffic to your site. What’s more, pillar pages exist at the beginning of the search journey. They are high up on the SEO funnel. This means pillar pages are not likely to directly bring you sales. The user has to click on your internal links to refine what they are looking for. And, there are a million and one reasons they might just leave your site before they ever click those links. So, you might not get your pillar page to the top of Google because let’s face it, there is only one top spot, especially on mobile. But you can still get targeted traffic to your site, because… The links in the Things to Know feature cover topics that are more granular and targeted. This is much higher quality traffic that is more likely to end up making a purchase or become a lead. And that brings us to the big question… How do you optimize your content to make it into the Things to Know feature? Here are some tips. How to Optimize for the Things to Know Feature So, you see an opportunity to make it into the Things to Know rich result. What do you do now? Although the feature is relatively new, it does look like a hub of Featured Snippets. So it stands to reason that you can treat it like a Featured Snippet. To get started, you must first pick the user intent you want to optimize for. Here are a few tips to optimize your content to get into the Things to Know box. 1. Target Search Intent Accurately Each mini-Featured Snippet in the Things to Know box has its own search intent. To have your content featured there, create an asset that answers that search intent thoroughly. You may need to look at what your competitors have created. Use them as a general guide and then create something better. 2. Optimize Content Structure Look at what’s currently ranking and pay particular attention to how Google is structuring the content. As you can see in the screenshot above, Google is bringing a bullet list. Click through to the content and see if the bullet list is coming from bullet list HTML or headers. When creating and optimizing your content, try to structure it in a similar way. 3. Look for Content Gaps Okay, you’ve created a stellar piece of content. Don’t hit publish yet. Try to analyze the content further. Is there something missing? Could you add points to make the content better? Remember, Google wants to present the best piece of content to serve its users, so don’t merely rewrite what already exists. Instead, go the extra mile and create something better. 4. Keep Your Language Simple Using simple language will help you in two ways. Firstly, it will be easy for your readers to read. Never forget that users often skim content to find what they are looking for. Make it easy for them. Another reason is Google’s algorithms attempt to understand the language in your content. If you use complicated language, you might confuse Google. Things to Know – The Big Picture We’ve covered the new feature at a high level, looking both at the data as well as performing some SERP analysis. By increasing the number of search intents, Google is creating more SERP real estate. This means you have a big opportunity to appear in highly competitive SERPs by featuring content that is lower down on the SEO funnel than you would have in the past. And, yes, Google has been adding search intents into the SERPs for a while now, but this new feature seems to get to the heart of the search journey by directly feeding the user’s search. People Also Ask boxes, on the other hand, do add search intents. But they seem to appear there as an afterthought. They present answers to other related queries people ask. Things to Know helps the user build their understanding of the topic from the ground up. These are essential things you need to know to understand the topic as a whole. From my perspective, as a content marketer, the Things to Know feature makes it easier to enter the conversation in the user’s mind with a variety of targeted assets. From my perspective, this feature is a big win. FAQs What is the Things to Know feature on Google? Google’s Things to Know SERP feature displays a list of subtopics in the Google SERPs that allow the user to explore their search topic. The feature looks similar to a People Also Ask box but focuses on the beginning of a user’s search journey. What is the Things to Know SERP feature designed to do? The Things to Know SERP feature is designed to break down broad topics into smaller subtopics in the search results. The goal of breaking down information this way is to help users break a topic into bite-sized chunks. This will help the user find the specific information they need in fewer searches, which will improve the user experience. How can I use the Things to Know Google feature to improve my SEO? You can incorporate the Things to Know feature into your SEO by optimizing your content to be featured. Although the methodology is similar to having your content featured in a People Also Ask box, the Tings to Know feature gives you a unique opportunity to have your content featured on broad searches. These searches typically have a high search volume and are generally highly competitive. by Darrell Mordecai Darrell creates SEO content for Similarweb, drawing on his deep understanding of SEO and Google patents. Related Topics: SEO This post is subject to Similarweb legal notices and disclaimers. Related Posts Marketing Intelligence 10 Ways to Get Your Website to Show Up on Google SEO by Limor Barenholtz 10 Min. Oct 22, 2024 Marketing Intelligence How to Increase Organic Traffic to Your Website: A Step-by-Step Guide SEO by Limor Barenholtz 9 Min. Oct 19, 2024 Marketing Intelligence Boost Your Website Traffic With Social Media Marketing Strategy by Itay Gross 8 Min. Oct 17, 2024 Marketing Intelligence Missed brightonSEO? Catch up on Google Trends, AI Impact, and SEO Must-Knows SEO by James Quilter 6 Min. Oct 9, 2024 Marketing Intelligence How to Use Heading Tags? Best Practices for SEO SEO by Lior Shapira 10 Min. Oct 1, 2024 Marketing Intelligence Starting a Blog? Best Blogging Guide for Beginners SEO by Lior Shapira 17 Min. Sep 29, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Understanding Google’s Things to Know SERP Feature"
    },
    {
      "level": "H2",
      "text": "What is The Things to Know Feature and How It Changes the User Experience?"
    },
    {
      "level": "H3",
      "text": "Google’s Announcement"
    },
    {
      "level": "H3",
      "text": "The Things to Know Feature – A Stable Work In Progress"
    },
    {
      "level": "H2",
      "text": "Digging Into the Data"
    },
    {
      "level": "H3",
      "text": "Zero-Click Searches"
    },
    {
      "level": "H3",
      "text": "Organic vs Paid"
    },
    {
      "level": "H3",
      "text": "The Data Speaks"
    },
    {
      "level": "H3",
      "text": "How Does the Feature Change the Search Journey?"
    },
    {
      "level": "H2",
      "text": "Is Google Replacing Head Terms With SERP Features? – SERP Analysis"
    },
    {
      "level": "H2",
      "text": "Things to Know – An Opportunity in Disguise"
    },
    {
      "level": "H2",
      "text": "How to Optimize for the Things to Know Feature"
    },
    {
      "level": "H3",
      "text": "1. Target Search Intent Accurately"
    },
    {
      "level": "H3",
      "text": "2. Optimize Content Structure"
    },
    {
      "level": "H3",
      "text": "3. Look for Content Gaps"
    },
    {
      "level": "H3",
      "text": "4. Keep Your Language Simple"
    },
    {
      "level": "H2",
      "text": "Things to Know – The Big Picture"
    },
    {
      "level": "H2",
      "text": "FAQs"
    },
    {
      "level": "H3",
      "text": "10 Ways to Get Your Website to Show Up on Google"
    },
    {
      "level": "H3",
      "text": "How to Increase Organic Traffic to Your Website: A Step-by-Step Guide"
    },
    {
      "level": "H3",
      "text": "Boost Your Website Traffic With Social Media"
    },
    {
      "level": "H3",
      "text": "Missed brightonSEO? Catch up on Google Trends, AI Impact, and SEO Must-Knows"
    },
    {
      "level": "H3",
      "text": "How to Use Heading Tags? Best Practices for SEO"
    },
    {
      "level": "H3",
      "text": "Starting a Blog? Best Blogging Guide for Beginners"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Darrell Mordecai"
}