{
  "url": "https://ahrefs.com/blog/category/product-blog/page/5/",
  "slug": "5",
  "title": "Product Blog - Page 5 of 6 - SEO Blog by Ahrefs",
  "description": "Learn all about the important new features and changes in Ahrefs. - Page 5",
  "content": "SEO General SEOKeyword ResearchOn-Page SEOLink BuildingTechnical SEOLocal SEOEnterprise SEO Marketing General MarketingContent MarketingAffiliate MarketingPaid MarketingVideo Marketing Data & Studies Product Guides SEOKeyword ResearchOn-Page SEOLink BuildingTechnical SEOLocal SEO Search Search Subscribe Menu Search SEO General SEO Keyword Research On-Page SEO Link Building Technical SEO Local SEO Enterprise SEO Marketing General Marketing Content Marketing Affiliate Marketing Paid Marketing Video Marketing Data & Studies Product Guides SEO Keyword Research On-Page SEO Link Building Technical SEO Local SEO Subscribe Product BlogLearn all about the important new features and changes in Ahrefs.Product Blog New: Get internal linking suggestions with Link Opportunities Rebekah Bek November 9, 2020Product Blog Introducing Historical Keyword Data in Site Explorer Rebekah Bek October 5, 2020Product Blog Ahrefs Webmaster Tools: What’s in it for our users? Rebekah Bek September 22, 2020Product Blog Ahrefs SEO Toolbar - What’s New? Nick Churick April 15, 2020Product Blog What’s New At Ahrefs? (March 2020) Si Quan Ong March 25, 2020Product Blog What’s new in Ahrefs’ Site Audit tool (May 2019) Nick Churick May 23, 2019Product Blog Ahrefs Site Audit: 11 Useful Features You Might Have Missed Nick Churick May 9, 2019Product Blog Ahrefs Content Explorer 2.0: Rebuilt From Scratch (With New Features) Tim Soulo April 4, 2019Product Blog Ahrefs Keywords Explorer 3.0: Re-Built From Scratch (With More Data) Tim Soulo February 4, 2019Product Blog The Resurrection of Ahrefs’ SEO Toolbar Nick Churick September 10, 2018Product Blog Ahrefs’ Rank Tracker just got even better! Tim Soulo June 6, 2018Product Blog Ahrefs’ backlink index just got A LOT better (hint: search traffic data) Tim Soulo April 18, 2018Product Blog Ahrefs’ Site Audit tool can now execute JavaScript while crawling your website Nick Churick January 18, 2018Product Blog This is the new Site Audit tool by Ahrefs Tim Soulo December 14, 2017Product Blog New in September: Traffic value, JS crawling, “delayed” links & more Tim Soulo October 5, 2017Product Blog Ahrefs crawlers are now rendering web pages and executing JavaScript Tim Soulo September 7, 2017Product Blog This is the new Rank Tracker by Ahrefs Tim Soulo August 29, 2017Product Blog New in June: Backend magic, Ahrefs Academy, Link lost reasons, etc Tim Soulo July 5, 2017Product Blog What’s new at Ahrefs in May? Tim Soulo May 31, 2017Product Blog Keywords Explorer 2.0 by Ahrefs: Setting new standards for keyword research Tim Soulo November 16, 2016 123456 Search English DeutschEspañolFrançaisItalianoPortuguês中文 EnglishDeutschEspañolFrançaisItalianoPortuguês中文 © 2024 Ahrefs Pte Ltd.Pick a topic SEO General SEO Keyword Research On-Page SEO Link Building Technical SEO Local SEO Enterprise SEO Marketing General Marketing Content Marketing Affiliate Marketing Paid Marketing Video Marketing Data & Studies Product Ahrefs Tools Core Tools Site Explorer Keywords Explorer Content Explorer Site Audit Rank Tracker Free Tools Backlink Checker Website Authority Checker Keyword Rank Checker Broken Link Checker SERP Checker Close Join the Ahrefs' DigestGet the week's best marketing content in your inbox. Email Subscription Subscribe Leave this field empty if you're human: Thanks!Please check your email inbox and spam folder. We've sent you a link to verify your email. Got It",
  "headers": [
    {
      "level": "H1",
      "text": "Product Blog"
    },
    {
      "level": "H3",
      "text": "New: Get internal linking suggestions with Link Opportunities"
    },
    {
      "level": "H3",
      "text": "Introducing Historical Keyword Data in Site Explorer"
    },
    {
      "level": "H3",
      "text": "Ahrefs Webmaster Tools: What’s in it for our users?"
    },
    {
      "level": "H3",
      "text": "Ahrefs SEO Toolbar - What’s New?"
    },
    {
      "level": "H3",
      "text": "What’s New At Ahrefs? (March 2020)"
    },
    {
      "level": "H3",
      "text": "What’s new in Ahrefs’ Site Audit tool (May 2019)"
    },
    {
      "level": "H3",
      "text": "Ahrefs Site Audit: 11 Useful Features You Might Have Missed"
    },
    {
      "level": "H3",
      "text": "Ahrefs Content Explorer 2.0: Rebuilt From Scratch (With New Features)"
    },
    {
      "level": "H3",
      "text": "Ahrefs Keywords Explorer 3.0: Re-Built From Scratch (With More Data)"
    },
    {
      "level": "H3",
      "text": "The Resurrection of Ahrefs’ SEO Toolbar"
    },
    {
      "level": "H3",
      "text": "Ahrefs’ Rank Tracker just got even better!"
    },
    {
      "level": "H3",
      "text": "Ahrefs’ backlink index just got A LOT better (hint: search traffic data)"
    },
    {
      "level": "H3",
      "text": "Ahrefs’ Site Audit tool can now execute JavaScript while crawling your website"
    },
    {
      "level": "H3",
      "text": "This is the new Site Audit tool by Ahrefs"
    },
    {
      "level": "H3",
      "text": "New in September: Traffic value, JS crawling, “delayed” links & more"
    },
    {
      "level": "H3",
      "text": "Ahrefs crawlers are now rendering web pages and executing JavaScript"
    },
    {
      "level": "H3",
      "text": "This is the new Rank Tracker by Ahrefs"
    },
    {
      "level": "H3",
      "text": "New in June: Backend magic, Ahrefs Academy, Link lost reasons, etc"
    },
    {
      "level": "H3",
      "text": "What’s new at Ahrefs in May?"
    },
    {
      "level": "H3",
      "text": "Keywords Explorer 2.0 by Ahrefs: Setting new standards for keyword research"
    }
  ],
  "author": "Rebekah Bek  Rebekah Bek  Rebekah Bek  Nick Churick  Si Quan Ong  Nick Churick  Nick Churick  Tim Soulo  Tim Soulo  Nick Churick  Tim Soulo  Tim Soulo  Nick Churick  Tim Soulo  Tim Soulo  Tim Soulo  Tim Soulo  Tim Soulo  Tim Soulo  Tim Soulo"
}