{
  "url": "https://moz.com/blog/category/local-seo/p13",
  "slug": "p13",
  "title": "Local SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Miriam Ellis October 23, 2018 The Ultimate Cheat Sheet for Taking Full Control of Your Google Knowledge Panels Local SEO | Search Engines Google's local Knowledge Panel is more detailed and more confusing than ever. Make sure your business is maximizing your GMB potential with this handy visual cheat sheet. Read this post By: Dana DiTomaso October 12, 2018 How to Create a Local Marketing Results Dashboard in Google Data Studio Local SEO | Whiteboard Friday Do your local clients understand exactly whether and how you're making them money? Learn how to create a client-friendly local marketing results dashboard in Google Data Studio from start to finish. Read this post By: Miriam Ellis September 17, 2018 Follow the Local SEO Leaders: A Guide to Our Industry’s Best Publications Local SEO The local SEO industry is rich with authoritative voices. Are you following the thought leaders that matter most to your work? Keep a finger on the pulse of all things local with our comprehensive list of resources. Read this post By: Miriam Ellis September 12, 2018 Local Business Transparency & Empathy for the Holidays: Tips + Downloadable Checklist Local SEO Consumers expect brands to be responsive and empathetic, especially during the holidays; if you're not, you risk both sales and dreaded 1-star reviews. Learn how to guard your business and delight your customers (we've got a checklist to help!). Read this post By: Tom Capper August 17, 2018 Do You Need Local Pages? Local SEO | Whiteboard Friday Whether or not you own or market a local business, it may make sense to compete for space in the organic SERPs using local pages. Tom Capper shares a 4-point process for determining whether local pages are right for you in this week's Whiteboard Friday. Read this post By: Miriam Ellis August 13, 2018 How to Win Local Customers Back from Amazon this Holiday Season Local SEO As Amazon continues to eat up more of the local retail market, businesses are scrambling to find ways to compete. Miriam Ellis shares a smart tactic with roots in good old-fashioned customer service to help win back your customers in the busy season. Read this post By: Miriam Ellis August 6, 2018 Take the 2018 Moz Local Search Marketing Industry Survey Local SEO | Marketing Industry Have insights to share about your experience with local SEO? Share your industry knowledge and be entered for a chance to win a $100 Amazon gift card! Read this post By: Miriam Ellis July 17, 2018 The Local SEO’s Guide to the Buy Local Phenomenon: A Competitive Advantage for Clients Local SEO The Buy Local movement is here to stay and growing — and its benefits to your local clients are almost endless. How can you harness its power and use Buy Local to help your clients see success? Read this post By: Sherry Bonelli July 3, 2018 How to Optimize Car Dealership Websites Local SEO | SEO Basics While most verticals require different SEO strategies, car dealerships face particularly complex challenges. What special considerations does this vertical require, and how can they effectively optimize their sites and GMB listings? Read this post By: Miriam Ellis June 21, 2018 Q&A: Lost Your Anonymous Google Reviews? The Scoop on Removal and Moving Forward Local SEO | Search Engines If you lost anonymous \"A Google User\" reviews since late May, you probably have a few questions about why they were removed. Miriam Ellis is here to share answers on how this affects your review strategy and local SEO as a whole. Read this post By: Miriam Ellis May 30, 2018 Getting Real with Retail: An Agency’s Guide to Inspiring In-Store Excellence Local SEO | Reputation Management When your agency encounters a client with a slew of negative reviews, it's a symptom of a bigger brick-and-mortar problem. But as a digital marketer, you're far from powerless when it comes to the in-store experience. Read this post By: Miriam Ellis May 16, 2018 Time to Act: Review Responses Just Evolved from \"Extra\" to \"Expected\" Local SEO Google is now sending reviewers notifications when a business owner responds to their review. With reviewers now expecting a response, how will this affect your review strategy and how can you keep track? Read this post By: Miriam Ellis April 17, 2018 Enterprise Local SEO is Different: A Checklist, a Mindset Local SEO Not all local SEO advice is applicable to enterprise local SEO. If you're marketing big brands with many locations, you need to learn what advice to ignore and what to implement. Get started with this enterprise local SEO checklist! Read this post By: Claudia Cruz April 3, 2018 The Guide to Local Sponsorship Marketing - The 2018 Edition Local SEO | Marketing Industry | Branding Local sponsorships are an actionable strategy that offer dozens of marketing benefits. Just like content campaigns, local PR campaigns, or review management, they have their own set of rules and best practices. Learn all about local sponsorship marketing and where they belong in your local SEO plan. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Local SEO"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Local SEO"
    },
    {
      "level": "H2",
      "text": "The Ultimate Cheat Sheet for Taking Full Control of Your Google Knowledge Panels"
    },
    {
      "level": "H2",
      "text": "How to Create a Local Marketing Results Dashboard in Google Data Studio"
    },
    {
      "level": "H2",
      "text": "Follow the Local SEO Leaders: A Guide to Our Industry’s Best Publications"
    },
    {
      "level": "H2",
      "text": "Local Business Transparency & Empathy for the Holidays: Tips + Downloadable Checklist"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Do You Need Local Pages?"
    },
    {
      "level": "H2",
      "text": "How to Win Local Customers Back from Amazon this Holiday Season"
    },
    {
      "level": "H2",
      "text": "Take the 2018 Moz Local Search Marketing Industry Survey"
    },
    {
      "level": "H2",
      "text": "The Local SEO’s Guide to the Buy Local Phenomenon: A Competitive Advantage for Clients"
    },
    {
      "level": "H2",
      "text": "How to Optimize Car Dealership Websites"
    },
    {
      "level": "H2",
      "text": "Q&A: Lost Your Anonymous Google Reviews? The Scoop on Removal and Moving Forward"
    },
    {
      "level": "H2",
      "text": "Getting Real with Retail: An Agency’s Guide to Inspiring In-Store Excellence"
    },
    {
      "level": "H2",
      "text": "Time to Act: Review Responses Just Evolved from \"Extra\" to \"Expected\""
    },
    {
      "level": "H2",
      "text": "Enterprise Local SEO is Different: A Checklist, a Mindset"
    },
    {
      "level": "H2",
      "text": "The Guide to Local Sponsorship Marketing - The 2018 Edition"
    }
  ],
  "author": "Miriam Ellis\n          \n            Dana DiTomaso\n          \n            Miriam Ellis\n          \n            Miriam Ellis\n          \n            Tom Capper\n          \n            Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis\n          \n            Sherry Bonelli\n          \n            Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis\n          \n            Claudia Cruz"
}