{
  "url": "https://moz.com/blog/category/local-seo/p18",
  "slug": "p18",
  "title": "Local SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Miriam Ellis August 3, 2016 Diagramming the Story of a 1-Star Review Local SEO | Reputation Management What earns a business a 1-star review? Not all negative reviews can be avoided, but the way you handle the situation can hugely impact how many stars you earn. Miriam dissects exactly what goes into a bad review and how to deal with it — professionally. Read this post By: Miriam Ellis July 13, 2016 Why I'd Recommend Local SEO as a Promising Career for Millennials Local SEO | Marketing Industry | SEO Consulting There's an up-and-coming generation that embodies the perfect ideals for a career in local SEO. For all the young people wondering how to marry their passion for community with their life's work, Miriam Ellis explains why local search marketing may be the answer. Read this post By: Ronell Smith July 7, 2016 How Local Content is Helping SMBs Keep Big Brands at Bay Content Marketing | Local SEO | Link Building Separate your brand from the competition by delivering knockout personalized content at every point of engagement. Read this post By: George Freitag June 17, 2016 Why Listing Accuracy is Important Local SEO | Whiteboard Friday | SEO Basics Whether you manage a single local listing or hundreds, the consistency of your NAP data across the web can make or break your business. With answers for just about everyone, Moz Local's George Freitag stars in this week's Whiteboard Friday covering all the boons and secrets of listing accuracy (give him a warm welcome, folks!). Read this post By: Miriam Ellis June 14, 2016 Are Coworking Offices Eligible for Google My Business Listings? Local SEO The question on everyone's mind: Are coworking spaces eligible for GMB listings? Learn the answer to this and other important local SEO considerations when your main place of business is a shared coworking space. Read this post By: David Farkas May 25, 2016 Here's How I'm Using Moz Content for Mining Local Link Opportunities Content Marketing | Local SEO | Link Building Searching for new workflows to help you build those local links? Take a look at how one SEO is using Moz Content to uncover content and linking opportunities. Read this post By: Miriam Ellis May 23, 2016 Getting Local Store Locator SEO Right Local SEO If you're a medium to large business with tons of locations, making sure customers find the correct local storefronts can have different rules. This post answers all your questions about getting store locator SEO right! Read this post By: Dudley Carr May 11, 2016 Moz Local: Fixing the Accuracy Pain Point Local SEO | Moz Tools | Moz News When you speak, we listen! The shiny new-and-improved Moz Local dashboard, revamped based on your feedback, gives you better distribution and better visualization of your listing accuracy. Read this post By: Miriam Ellis April 28, 2016 The Local SEO Agency's Complete Guide to Client Discovery and Onboarding Local SEO | Digital Marketing Agencies When sussing out new clients, it's crucial for Local SEOs to start off on the right foot. Miriam Ellis offers three free downloadable forms and some priceless advice to make your client onboarding process smooth as silk. Read this post By: Aleh Barysevich April 21, 2016 How to Find and Connect with Local Influencers in Your Industry Local SEO Finding and connecting with local influencers in your area can provide a shot in the arm for your business. Read this post By: Joy Hawkins April 19, 2016 The 9 Most Common Local SEO Myths, Dispelled Local SEO Have you taken any of these statements as truth? In this post, Google My Business Top Contributor Joy Hawkins shares and debunks the Local SEO myths she runs into most frequently. Read this post By: Erica McGillivray April 5, 2016 ​Hot off the Presses: The MozCon Local 2016 Video Bundle Local SEO | Moz News | SEO Events The 2016 MozCon Local Video Bundle is here. Get your copy with 14 videos (6 hours of Local Marketing knowledge) for only $99! Read this post By: Darren Shaw March 25, 2016 Why You Need to Find All Your NAP Variations Before Building Local Citations Local SEO | Whiteboard Friday Citation consistency got you down? It's one of the most important local search ranking factors, but it can be an overwhelming task to find inconsistencies, and it's often easy to create accidental duplicate listings. In today's guest Whiteboard Friday, Darren Shaw, founder of Whitespark and recent speaker at MozCon Local, outlines a foolproof way to discover all your NAP variations to prepare for proper citation building. Read this post By: Dr. Peter J. Meyers March 22, 2016 Moz Local Industry Report: Who's Winning Wireless Searches? Local SEO | Search Engines | Marketing Industry We analyzed 5 mobile phone buyer searches on Google across 5,000 cities (25,000 total markets) to find the winners and losers in both organic and local pack results. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Local SEO"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Local SEO"
    },
    {
      "level": "H2",
      "text": "Diagramming the Story of a 1-Star Review"
    },
    {
      "level": "H2",
      "text": "Why I'd Recommend Local SEO as a Promising Career for Millennials"
    },
    {
      "level": "H2",
      "text": "How Local Content is Helping SMBs Keep Big Brands at Bay"
    },
    {
      "level": "H2",
      "text": "Why Listing Accuracy is Important"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Are Coworking Offices Eligible for Google My Business Listings?"
    },
    {
      "level": "H2",
      "text": "Here's How I'm Using Moz Content for Mining Local Link Opportunities"
    },
    {
      "level": "H2",
      "text": "Getting Local Store Locator SEO Right"
    },
    {
      "level": "H2",
      "text": "Moz Local: Fixing the Accuracy Pain Point"
    },
    {
      "level": "H2",
      "text": "The Local SEO Agency's Complete Guide to Client Discovery and Onboarding"
    },
    {
      "level": "H2",
      "text": "How to Find and Connect with Local Influencers in Your Industry"
    },
    {
      "level": "H2",
      "text": "The 9 Most Common Local SEO Myths, Dispelled"
    },
    {
      "level": "H2",
      "text": "​Hot off the Presses: The MozCon Local 2016 Video Bundle"
    },
    {
      "level": "H2",
      "text": "Why You Need to Find All Your NAP Variations Before Building Local Citations"
    },
    {
      "level": "H2",
      "text": "Moz Local Industry Report: Who's Winning Wireless Searches?"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Ronell Smith\n          \n            George Freitag\n          \n            Miriam Ellis\n          \n            David Farkas\n          \n            Miriam Ellis\n          \n            Dudley Carr\n          \n            Miriam Ellis\n          \n            Aleh Barysevich\n          \n            Joy Hawkins\n          \n            Erica McGillivray\n          \n            Darren Shaw\n          \n            Dr. Peter J. Meyers"
}