{
  "url": "https://moz.com/blog/category/local-seo/p2",
  "slug": "p2",
  "title": "Local SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Myriam Jessier March 25, 2024 Cognitive Science Meets SEO: Why True Localization Matters Local SEO | Marketing Psychology Connect with diverse audiences across the globe by embracing a multi-local strategy. Explore how brands can merge cognitive science with local expertise. Read this post By: Miriam Ellis March 20, 2024 14 Local Search Developments You Need to Know About From Q1 2024 Local SEO | Marketing Industry From new European local SERPs and the GBP site shutdown to a grab bag of Google developments, Miriam Ellis recaps Q1 2024 local SEO news so you won’t miss a thing! Read this post By: Miriam Ellis March 14, 2024 Claddagh: How Local Businesses Inspire Love, Loyalty, and Friendship Local SEO | Community Management Miriam relays an old local business tale, with more than a dozen inspiring examples of love, loyalty, and friendship between local businesses and their customers. She ends with tips for removing barriers to form lasting business relationships. Read this post By: Miriam Ellis February 26, 2024 How to Create the Most Basic Google Business Profile Video with Canva, Even If You’re Not Great At This Stuff! Local SEO | Video Miriam takes you through how to create engaging videos step-by-step using Canva. Let your local business come to life on film! Read this post By: Miriam Ellis February 19, 2024 How to Create a Decent One-Page Local Business Site in the Face of the Google Website Shutdown Local SEO | Search Engines Nothing could be worse for a business than existing customers thinking you no longer exist. With millions of Google Business Profile websites being shut down, Miriam Ellis outlines your options for a free/cheap replacement site, with tons of tips for making a strong 1-page presence. Read this post By: Miriam Ellis February 13, 2024 A Little More Love for Local Business FAQs Local SEO | Content Marketing Be intentional when crafting your local business FAQ pages. A little more love for FAQs is worth the time, and the effort it takes to provide valuable insights for your team. Read this post By: Miriam Ellis January 23, 2024 What Belongs on Your Local Business' About Page? Local SEO | On-page SEO Nearly every business has an About page, but too often, its content is an afterthought. Turn that around with key real-world examples of local brands getting it right. Read this post By: Miriam Ellis January 17, 2024 What to Do With Aging Local Business Content: Review, Update, and Re-promote! Local SEO | Content Marketing Instead of seeing the benefits of your past hard work evaporate over time, discover how to keep your older content working for the local business you’re marketing. Read this post By: Miriam Ellis December 28, 2023 16 Local Search Developments You Need to Know About From Q4 2023 Local SEO | Marketing Industry Learn about the most recent local search developments of 2023 to get ready for the year ahead. Read this post By: Miriam Ellis December 7, 2023 30 Google Business Profile Photos Your Local Business Can Easily Take — Illustrated Local SEO | Content Marketing Uncover 30 different types of images your local business can use online to demonstrate E-E-A-T to both Google and potential customers. Read this post By: Amanda Jordan December 1, 2023 Link Building for Local Businesses — Whiteboard Friday Whiteboard Friday | Local SEO | Link Building Learn about link building for your local business in this Whiteboard Friday with Amanda Jordan. Read this post By: Miriam Ellis November 28, 2023 Local Business E-E-A-T: Real-world Examples of How This Works Local SEO | Content Marketing Explore tons of real-world local business examples to help you plan out your own full menu of E-E-A-T opportunities. Read this post By: Miriam Ellis November 16, 2023 Is the Nearby Filter Nav Actually Making Google’s SERPs More Local? Local SEO | Search Engines Is the Nearby filter navigation actually making Google’s SERPs more local? Find out more through Miriam’s research. Read this post By: Miriam Ellis November 8, 2023 The Location Landing Pages Salad Bar: Making Smart Local Business Content Choices in 2024 Local SEO | Content Marketing Navigate the complex world of creating engaging and unique location landing pages in this article with a buffet of content options, a checklist for creativity, and a lightning round of questions and answers. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Local SEO"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Local SEO"
    },
    {
      "level": "H2",
      "text": "Cognitive Science Meets SEO: Why True Localization Matters"
    },
    {
      "level": "H2",
      "text": "14 Local Search Developments You Need to Know About From Q1 2024"
    },
    {
      "level": "H2",
      "text": "Claddagh: How Local Businesses Inspire Love, Loyalty, and Friendship"
    },
    {
      "level": "H2",
      "text": "How to Create the Most Basic Google Business Profile Video with Canva, Even If You’re Not Great At This Stuff!"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "How to Create a Decent One-Page Local Business Site in the Face of the Google Website Shutdown"
    },
    {
      "level": "H2",
      "text": "A Little More Love for Local Business FAQs"
    },
    {
      "level": "H2",
      "text": "What Belongs on Your Local Business' About Page?"
    },
    {
      "level": "H2",
      "text": "What to Do With Aging Local Business Content: Review, Update, and Re-promote!"
    },
    {
      "level": "H2",
      "text": "16 Local Search Developments You Need to Know About From Q4 2023"
    },
    {
      "level": "H2",
      "text": "30 Google Business Profile Photos Your Local Business Can Easily Take — Illustrated"
    },
    {
      "level": "H2",
      "text": "Link Building for Local Businesses — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Local Business E-E-A-T: Real-world Examples of How This Works"
    },
    {
      "level": "H2",
      "text": "Is the Nearby Filter Nav Actually Making Google’s SERPs More Local?"
    },
    {
      "level": "H2",
      "text": "The Location Landing Pages Salad Bar: Making Smart Local Business Content Choices in 2024"
    }
  ],
  "author": "Myriam Jessier\n          \n            Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis\n          \n            Amanda Jordan\n          \n            Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}