{
  "url": "https://moz.com/blog/category/local-seo/p20",
  "slug": "p20",
  "title": "Local SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Casey Meraz November 10, 2015 Stop the Local SEO Tunnel Vision & Think Beyond the Basics Local SEO | Advanced SEO Yes, local SEO is hard. Are you making it harder on yourself, though? In this post, you'll explore the perils of local SEO tunnel vision and how to remain on top with fresh ideas and a new to-do list. Read this post By: Joy Hawkins November 2, 2015 Getting on the Map: The Intro to Local SEO for SABs Local SEO Local SEO is tricky when you don't have a dedicated brick-and-mortar storefront. If you've been left wondering how to maximize your presence on Google and in your target markets as an SEO or a service-area business owner, this introductory guide by Joy Hawkins will set you on the right path. Read this post By: Ryan Stewart October 7, 2015 Why I Stopped Selling SEO Services and You Should, Too Local SEO | Advanced SEO | SEO Basics It's no longer just about optimizing your website for Google. It's about optimizing your presence across the web. SEO has tentacles that extend well beyond your website, so it's important that you begin to think of search holistically, taking into account all of the areas that can be optimized. Read this post By: David Mihm September 24, 2015 Announcing the 2015 Local Search Ranking Factors Results Local SEO | Marketing Industry I'm happy to announce that the results of the 2015 Local Search Ranking Factors Survey are in! Read this post By: Rebecca Maynes September 17, 2015 Local Listings: How Canadian Retailers Stack Up and What You Can Learn Local SEO | International SEO When it comes to local listings accuracy, Canada's top retailers are underperforming. A solid local SEO strategy requires superior depth, visibility, reach, and precision. Read this post By: Erica McGillivray September 15, 2015 ​Announcing MozCon Local 2016! Local SEO | SEO Events Looking to level up your local marketing and SEO skills? Join us for MozCon Local, Thursday and Friday, February 18-19, 2016 in Seattle. With both an all-day conference and a half-day workshop, you'll hear from top local speakers on topics critical to local marketing. Read this post By: Kristi Hines August 25, 2015 The True Cost of Local Business Directories Local SEO Are you a local business owner? Explore the hows and whys of submitting your business to local business directories in order to boost your local search visibility on Google. Read this post By: Casey Meraz August 19, 2015 The New Snack Pack: Where Users are Clicking & How You Can Win Local SEO | Marketing Psychology | Conversion Rate Optimization (CRO) Have you seen the new Snack Pack? Explore Casey Meraz's click test results on Google's new local 3-pack, seeing what's changed, what works, and what the future holds. Read this post By: David Mihm August 18, 2015 New Moz Local Distribution Partners and Mobile-Friendly Interface Local SEO | Moz Tools Those of you who have logged into your Moz Local dashboard recently may have noticed a few updates this week! I thought I'd post a quick announcement to highlight them. Read this post By: Jennifer Slegg August 17, 2015 Google's Local Snack Pack Shake-Up: What You Need to Know Local SEO | Search Engines Google recently shook up the local results in its SERPs, killing the local 7-packs in favor of a 3-pack that resembles the mobile experience. This post tells you everything you need to know about the change and what it means for your local marketing. Read this post By: Mary Bowling July 28, 2015 MozCon 2015: Q&A Regarding Back to the Future with Local Search Local SEO If you're looking to stay ahead of the competition in Local SEO, start by striving to do the little things well and often. Read this post By: Calin Yablonski July 22, 2015 The Insane Power of Online Reviews for Local Businesses Local SEO | Reputation Management Many local brands are leaving money on the table by choosing to ignore online reviews, which are great vehicles for brand building and reputation management, and serve as excellent customer retention tools. Read this post By: David Mihm July 21, 2015 Moz Local Officially Launches in the UK Local SEO | Moz Tools To all Moz Local fans in the UK, I'm excited to announce that your wait is over. As the sun rises \"across the pond\" this morning, Moz Local is officially live in the United Kingdom! Read this post By: Casey Meraz June 28, 2015 Advanced Local SEO Competition Analysis Local SEO | Competitive Research Competition in local search is fierce. While it's typical to do some surface level research on your competitors before entering a market you can go much further down the SEO rabbit hole. In this article we will look at how you can find more competitors, pull their data, and use it to beat them in the search game. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Local SEO"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Local SEO"
    },
    {
      "level": "H2",
      "text": "Stop the Local SEO Tunnel Vision & Think Beyond the Basics"
    },
    {
      "level": "H2",
      "text": "Getting on the Map: The Intro to Local SEO for SABs"
    },
    {
      "level": "H2",
      "text": "Why I Stopped Selling SEO Services and You Should, Too"
    },
    {
      "level": "H2",
      "text": "Announcing the 2015 Local Search Ranking Factors Results"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Local Listings: How Canadian Retailers Stack Up and What You Can Learn"
    },
    {
      "level": "H2",
      "text": "​Announcing MozCon Local 2016!"
    },
    {
      "level": "H2",
      "text": "The True Cost of Local Business Directories"
    },
    {
      "level": "H2",
      "text": "The New Snack Pack: Where Users are Clicking & How You Can Win"
    },
    {
      "level": "H2",
      "text": "New Moz Local Distribution Partners and Mobile-Friendly Interface"
    },
    {
      "level": "H2",
      "text": "Google's Local Snack Pack Shake-Up: What You Need to Know"
    },
    {
      "level": "H2",
      "text": "MozCon 2015: Q&A Regarding Back to the Future with Local Search"
    },
    {
      "level": "H2",
      "text": "The Insane Power of Online Reviews for Local Businesses"
    },
    {
      "level": "H2",
      "text": "Moz Local Officially Launches in the UK"
    },
    {
      "level": "H2",
      "text": "Advanced Local SEO Competition Analysis"
    }
  ],
  "author": "Casey Meraz\n          \n            Joy Hawkins\n          \n            Ryan Stewart\n          \n            David Mihm\n          \n            Rebecca Maynes\n          \n            Erica McGillivray\n          \n            Kristi Hines\n          \n            Casey Meraz\n          \n            David Mihm\n          \n            Jennifer Slegg\n          \n            Mary Bowling\n          \n            Calin Yablonski\n          \n            David Mihm\n          \n            Casey Meraz"
}