{
  "url": "https://moz.com/blog/category/local-seo/p23",
  "slug": "p23",
  "title": "Local SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Kevin Richard December 13, 2013 Geolocation: The Ultimate Tip to Emulate Local Search Local SEO It's easy to customize the geolocation settings -- once or twice. However, these steps can be long and fastidious for results that might be unreliable, mainly if our prime concern is to collect data for filtering, comparing and verifying rankings based on the user's geographic location or when providing clients with direct links to different versions of SERPs from city based location. Read this post By: Jeff Finkelstein December 6, 2013 Google Business Photos May Correlate With Higher Local Search Ranking, Although Not a Magic Bullet Local SEO But do Google Business Photos help with local search rankings? Google's been mum, and I haven't been able to find any research on the matter. So I decided to test if there was a correlation between adoption of Google Business Photos and local search rankings. Read this post By: David Mihm December 4, 2013 Hummingbird's Unsung Impact on Local Search Local SEO There seems to have been a significant qualitative shift in local results since Google's release of Hummingbird that I haven't seen reported on search engine blogs and media outlets. Here's my take on what's going on and why. Read this post By: Greg Gifford November 27, 2013 Tips For Being A Local Search Superhero Local SEO Local search doesn’t have to be the arch-villain that you keep fighting but never really beat. With some knowledge, hard work, and a few tools in your utility belt, you can be the local search superhero that you’ve always wanted to be… Read this post By: Brian Gomez November 18, 2013 Get Your Multi-Location Business Ranking in Multiple Cities With One Domain Local SEO In this YouMoz post, I'll outline a strategy and some tactics I've used that have allowed me to help multiple clients achieve high rankings in different cities using only one domain name. These tactics have worked for businesses that have multiple locations, whether they are a large chain, multiple franchises or a law firm with offices in 10 cities. Read this post By: Miriam Ellis November 13, 2013 Top 20 Local Search Ranking Factors: An Illustrated Guide Local SEO This year's Local Search Ranking Factors identified 83 foundational ranking factors. This guide explains the top 20 most important factors and offers a succinct, illustrated example of each. Read this post By: Bridget Randolph October 7, 2013 Mobile Strategy for Small Businesses Local SEO For a small business on a tight budget, a mobile strategy may seem like a costly extra. This post covers why SMEs should care about mobile, and what they can do about it (even on a small-business budget). This is a tactics- and resource-heavy post, designed to provide tools to begin working right away on the process of building a mobile-friendly web presence. Read this post By: David Mihm October 3, 2013 Operation Clean Air: Clearing Up Misconceptions of Yelp's Review Filter Local SEO Rumors and theories about Yelp's review filter have led many people astray, thinking that filtered reviews are always fraudulent or otherwise useless. Moz's director of local search strategy debunks those theories with a summary of what's actually happening. Read this post By: David Mihm September 11, 2013 The 2013 Local Search Ecosystems (and a GetListed Upgrade) Local SEO Brand new visualizations show the state of the local search ecosystems in the US and several other countries. Along with this exploration, we're excited to announce the release of two data platforms to the roster we display on GetListed.org. Read this post By: David Mihm August 27, 2013 Comparing the Google+ and Google Places Page Management Interfaces Local SEO With an interface and user experience far superior to that of Google+ pages, Google's Places for Business dashboard effectively provides everything a small brick-and-mortar business needs. By continuing to promote both services, the company is only confusing its users. Read this post By: David Mihm August 7, 2013 Announcing the 2013 Local Search Ranking Factors Results Local SEO The full results of this year's Local Search Ranking Factors survey are in! Moz's director of local search strategy, David Mihm, walks us through some of the highlights and links to the full results. Read this post By: Dr. Peter J. Meyers July 11, 2013 How Does Google Count Local Results? Local SEO Blended results blurred the line between organic and local SEO. I share a hack to tell how Google counts organic results in a blended SERP, and how understanding how the two algorithms overlap can help you improve both your local and organic strategy. Read this post By: Casey Meraz June 28, 2013 Using The New Adwords Keyword Planner For Local SEO Keyword Research Keyword Research | Local SEO Let's face it. Local keyword research hasn't been easy since the Venice update. While we have always been able to use the Google Keyword Tool to find search volumes for keywords with Geo Modifiers such as \"City Name + Keyword,\" we have been lacking some reasonable data regarding keywords that do not already have a Geo Modifier. Read this post By: Casey Meraz April 10, 2013 Finding and Building Citations Like an Agency Local SEO So you want to rank locally? If you have already worked hard to add a few citations, complete your on-site local optimization, acquire customer reviews, and build some locally relevant links, well, now it's time to shift your focus. According to David Mihm, citations make-up roughly 25% of the overall local ranking factors. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Local SEO"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Local SEO"
    },
    {
      "level": "H2",
      "text": "Geolocation: The Ultimate Tip to Emulate Local Search"
    },
    {
      "level": "H2",
      "text": "Google Business Photos May Correlate With Higher Local Search Ranking, Although Not a Magic Bullet"
    },
    {
      "level": "H2",
      "text": "Hummingbird's Unsung Impact on Local Search"
    },
    {
      "level": "H2",
      "text": "Tips For Being A Local Search Superhero"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Get Your Multi-Location Business Ranking in Multiple Cities With One Domain"
    },
    {
      "level": "H2",
      "text": "Top 20 Local Search Ranking Factors: An Illustrated Guide"
    },
    {
      "level": "H2",
      "text": "Mobile Strategy for Small Businesses"
    },
    {
      "level": "H2",
      "text": "Operation Clean Air: Clearing Up Misconceptions of Yelp's Review Filter"
    },
    {
      "level": "H2",
      "text": "The 2013 Local Search Ecosystems (and a GetListed Upgrade)"
    },
    {
      "level": "H2",
      "text": "Comparing the Google+ and Google Places Page Management Interfaces"
    },
    {
      "level": "H2",
      "text": "Announcing the 2013 Local Search Ranking Factors Results"
    },
    {
      "level": "H2",
      "text": "How Does Google Count Local Results?"
    },
    {
      "level": "H2",
      "text": "Using The New Adwords Keyword Planner For Local SEO Keyword Research"
    },
    {
      "level": "H2",
      "text": "Finding and Building Citations Like an Agency"
    }
  ],
  "author": "Kevin Richard\n          \n            Jeff Finkelstein\n          \n            David Mihm\n          \n            Greg Gifford\n          \n            Brian Gomez\n          \n            Miriam Ellis\n          \n            Bridget Randolph\n          \n            David Mihm\n          \n            David Mihm\n          \n            David Mihm\n          \n            David Mihm\n          \n            Dr. Peter J. Meyers\n          \n            Casey Meraz\n          \n            Casey Meraz"
}