{
  "url": "https://moz.com/blog/category/local-seo/p26",
  "slug": "p26",
  "title": "Local SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: George Freitag November 27, 2010 How Google's New Local SERP Affected Your Ranking Local SEO As you probably noticed, last week Google did a pretty big makeover of its local search results page, incorporating the local results directly within the organic results. In some cases it appeared that the old “7-Pack” was just given larger real estate on the SERP. In others, it just looked like the websites were just given links to their Places page. And sometimes, it just looked l... Read this post By: Rand Fishkin October 13, 2010 Ranking for Keyword + Cityname in Multiple Geographies Local SEO I've been having a lot of conversations recently with websites in need of better rankings for keyword + cityname combinations in cities across the country (or around the world). This is one of the most challenging tasks in the SEO field, for four big reasons: Maps Results Bias Against Multi-City Domains Google's local/maps results are far more ch... Read this post By: Chip Holmes October 11, 2010 8 Free and Easy Killer Tips, Tricks, and Tools for a Superstar Site Local SEO This is my first post on SEOmoz and it really is more like a request for help from my fellow Mozzers. I have been working in SEO and PPC for the last ten years or so and now am a SME for SCORE which is a resource partner with the SBA. The general mission of SCORE is to help startup and existing businesses through business counseling. Most of the volunteers are retired executives with a wealth o... Read this post By: Rand Fishkin March 2, 2010 One Dead Simple Tactic for Better Rankings in Google Local Local SEO This post is short and easy to follow, just like the tactic it recommends. Most everyone who optimizes for Google Local (aka Google Maps) is familar with David Mihm's excellent and oft-referenced Local Search Ranking Factorts. In that document, and in many places where local results are analyzed, it's clear that getting your business/website into more listings that Google indexes is a v... Read this post T By: TelecomSEO February 10, 2010 UK Telephone Numbers and Local Search SEO Local SEO This article is mainly going to focus on the UK, so apologies to those of you who don't deal with UK telephone numbers on the sites you maintain. The US is, however, used for comparison.In the url=http://www.seomoz.org/ugc/do-all-your-business-telephone-numbers-work-as-published [ previous article ] I mentioned making sure all the numbers published online for your business are correc... Read this post By: Taylor Cimala January 11, 2010 Google Favorite Places Stickers and Local Search Local SEO Google recently began a pilot program to further cement the ties between its online search functionality and the physical world. Last month, the company distributed window decals to the most popular 100,000 or so locally listed businesses. It is easy to view this program cynically--as ... Read this post T By: Tim Sorweid October 8, 2009 Local Listing: An Attempt to Understand Rank Factors Local SEO Local listing rank has become a very large part of SEO over the past years and is becoming more so as Google improves their algorithm and displays the map 10 pack on more and more searches. With few good resources on the web (http://www.davidmihm.com/local-search-ranking-factors.shtml is great but starting to become out of date), I decided to take an indepth look into local searches for s... Read this post D By: Dennis Yu September 22, 2009 How To Geo-Target PPC Campaigns For Local Local SEO So much is written about how local lead gen is HOT, but so precious little on how to actually do it. Not surprising, since for every Brandon Hoffman, Dr. David Klein, and&nb... Read this post R By: rstellers August 27, 2009 Extreme Local Optimization Techniques Put To The Test Local SEO Inspired by Jennita's post, 10 reasons to submit to YOUmoz, This is my first post so I hope everyone likes it. I am fairly new to my SEO career. After being laid off from a totally unrelated field in December 2008 I was asked by a local business owner whom, I knew socially if I \"knew anything about Internet mark... Read this post W By: westgate July 1, 2009 UK Indexing Case Study Local SEO Optimizing a site for an overseas audience can be a daunting task. There are usually a number of barriers that make it more difficult than one would hope for. The barriers can come in the form of language or stipulations from the client, such as U.S. hosting that can't be changed or a non-geographical domain, like a .com or .org.A client that I am currently servicing asked me to optimize th... Read this post L By: Lora Baker June 8, 2009 Getting Bulk Local Listings Verified On Google's Local Business Center Local SEO In the last few months, Google's Local Business Center has implemented many changes that affect search marketing firms and our clients. One noticeable change has been how they have started marking listings as \"Unverified\" if you do not verify the listing by phone or mail. This includes every listing that is added with the Bulk Upload feature. One drawback to having a listing that is \"Unverified\" in the Local Business Center is that your ranking can be adversely affected depending on your industry. Another drawback is that if a user clicks \"More\" next to your local listing, the term \"Unverified\" is displayed prominently at the top of the listing. Read this post T By: Tom Critchlow June 1, 2009 Google Local - Out of Date, Riddled with Spam But Absolutely Worth It Local SEO Hello hello, today I'm going to talk a little about Google Local. The things I'm talking about aren't necessarily new or ground-breaking, but I think it's important to expose them to the Moz readership as Local isn't something that's talked about all that often on here and there are quite a few intricacies which you should be aware of when dealing with local optimisation, particularly for clients who have many locations and who rely on using a bulk upload to Google Local. Read this post E By: Edward Sexton May 8, 2009 Can a Site Gain International Traffic with Links to Babel Fish Translations? Local SEO I spotted a site recently that had different language versions. Nothing particularly new there, lots of big international sites have this functionality - such as Apple and most airport websites. Read this post T By: Tom Critchlow May 4, 2009 Geolocation & International SEO Frequently Asked Questions Local SEO While answering Q&A the other day it occurred to me that a lot of questions we see are basically the same question asked over and over again in different formats. In answering these questions we often end up re-using the same responses time and time again so I thought it would be a good idea to create a bit of an FAQ based off some of the most informative questions and answers which we've answ... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Local SEO"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Local SEO"
    },
    {
      "level": "H2",
      "text": "How Google's New Local SERP Affected Your Ranking"
    },
    {
      "level": "H2",
      "text": "Ranking for Keyword + Cityname in Multiple Geographies"
    },
    {
      "level": "H2",
      "text": "8 Free and Easy Killer Tips, Tricks, and Tools for a Superstar Site"
    },
    {
      "level": "H2",
      "text": "One Dead Simple Tactic for Better Rankings in Google Local"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "UK Telephone Numbers and Local Search SEO"
    },
    {
      "level": "H2",
      "text": "Google Favorite Places Stickers and Local Search"
    },
    {
      "level": "H2",
      "text": "Local Listing: An Attempt to Understand Rank Factors"
    },
    {
      "level": "H2",
      "text": "How To Geo-Target PPC Campaigns For Local"
    },
    {
      "level": "H2",
      "text": "Extreme Local Optimization Techniques Put To The Test"
    },
    {
      "level": "H2",
      "text": "UK Indexing Case Study"
    },
    {
      "level": "H2",
      "text": "Getting Bulk Local Listings Verified On Google's Local Business Center"
    },
    {
      "level": "H2",
      "text": "Google Local - Out of Date, Riddled with Spam But Absolutely Worth It"
    },
    {
      "level": "H2",
      "text": "Can a Site Gain International Traffic with Links to Babel Fish Translations?"
    },
    {
      "level": "H2",
      "text": "Geolocation & International SEO Frequently Asked Questions"
    }
  ],
  "author": "George Freitag\n          \n            Rand Fishkin\n          \n            Chip Holmes\n          \n            Rand Fishkin\n          \n            TelecomSEO\n          \n            Taylor Cimala\n          \n            Tim Sorweid\n          \n            Dennis Yu\n          \n            rstellers\n          \n            westgate\n          \n            Lora Baker\n          \n            Tom Critchlow\n          \n            Edward Sexton\n          \n            Tom Critchlow"
}