{
  "url": "https://moz.com/blog/category/local-seo/p3",
  "slug": "p3",
  "title": "Local SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Miriam Ellis October 24, 2023 5 Types of Holiday Local Business Content You Should Promote Local SEO | Content Marketing Uncover 5 key types of holiday shopping season content to boost your business's visibility and thrive this festive season. Read this post By: Miriam Ellis October 18, 2023 Announcing: The Local Business Content Marketing Guide Moz News | Local SEO Unlock the full potential of your local business with The Local Business Content Marketing Guide. Dive into actionable insights, real-world examples, and expert advice to help your business thrive. Read this post By: Miriam Ellis October 10, 2023 Celebrating Canada’s Small Business Month With Sustainable Local Biz Tips Local SEO | Reputation Management Happy Small Business Month! In this article, Miriam displays that by making sustainable local goods and services easier for everyone to find and choose online, we can work towards healing the climate together. Read this post By: Miriam Ellis October 4, 2023 12 Local Search Developments You Need to Know About from Q3 2023 Local SEO | Marketing Industry Discover Miriam’s 12 must-know developments in local search during Q3 2023. Stay ahead of the game as the holiday season approaches, and ensure your local business marketing strategy is primed for success. Read this post By: Miriam Ellis September 26, 2023 Takeaways from an Irish Locksmith Listing Spam Scandal Local SEO | Reputation Management In this article, Miriam discusses how to protect yourself from local listing spam, along with how local businesses can combat spam on their own listings, and build trust in their communities. Read this post By: Miriam Ellis August 21, 2023 What Diners Write About Most: A Study of Restaurant Review Place Topics Local SEO | Reputation Management Find out what diners write about most in their reviews in Miriam’s new study. Understand the sentiment behind customer reviews and use 'Place Topics' to improve areas that customers talk about the most, to ultimately enhance your restaurant's reputation and attract new customers. Read this post By: Miriam Ellis August 16, 2023 Top Local SEO Takeaways from MozCon 2023 Local SEO | SEO Events Miriam touches on all of the top local SEO takeaways from MozCon 2023, including tips on local link categorization, video SEO, and diverse takes on AI. Read this post By: Miriam Ellis July 19, 2023 How to Get More Local Business Reviews from Travelers Local SEO | Reputation Management Finding the most effective way to get travelers to review your local business will gift you with better local search rankings, a persuasive reputation, and a lucrative upward trend in transactions. Read this post By: Miriam Ellis July 10, 2023 Google SGE: Early Local Search Data Local SEO | Marketing Industry | AI and SEO If the local version of Google’s Search Generative Experience rolls out broadly, what will that be like for local business owners and their marketers? Learn more in this article, where Miriam sets out to answer that exact question. Read this post By: Miriam Ellis June 27, 2023 12 Local Search Developments You Need to Know About from Q2 2023 Local SEO Miriam Ellis is ready to share the latest local search developments from Q2 of 2023. This quarterly installment will keep you up-to-date with the most important local search developments of the past three months. Let’s dive right in! Read this post By: Amanda Jordan June 23, 2023 How to Create Kick-Ass Local Landing Pages — Whiteboard Friday Whiteboard Friday | Local SEO Learn all about how to create kick-ass local landing pages in this Whiteboard Friday with Amanda Jordan. Discover the most popular features and get to know the dos and don'ts when creating local landing pages. Read this post By: Miriam Ellis June 13, 2023 6 Local SEO Tasks for Summer Success Local SEO Every small effort in optimizing your local SEO presence can add up, allowing you to build habits, content, and connections that should help your business stand out in all seasons. With AI being the talk of the town, it’s more important than ever to keep up with trends and the ever-changing local SEO landscape! Let Miriam take you through 6 local SEO tips for the summer that are sure to bring you success. Read this post By: Greg Gifford June 2, 2023 Easy to Implement Tactics for Local Link Building — Whiteboard Friday Whiteboard Friday | Local SEO | Link Building Google’s local algorithm demands different tactics for link building. And even if you don't need local SEO, local link building strategies can still give you a different perspective and improve your work. In today’s episode, Greg walks you through some easy to implement local SEO tactics. Read this post By: Miriam Ellis May 8, 2023 2023’s Top 7 Local Search Ranking Factors, Illustrated and Explained Local SEO Today, we’re going to look at how to set the local businesses you market apart by mastering the top of the list of ranking factors, with lots of practical tips for improving your rankings so that you’re earning greater visibility. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Local SEO"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Local SEO"
    },
    {
      "level": "H2",
      "text": "5 Types of Holiday Local Business Content You Should Promote"
    },
    {
      "level": "H2",
      "text": "Announcing: The Local Business Content Marketing Guide"
    },
    {
      "level": "H2",
      "text": "Celebrating Canada’s Small Business Month With Sustainable Local Biz Tips"
    },
    {
      "level": "H2",
      "text": "12 Local Search Developments You Need to Know About from Q3 2023"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Takeaways from an Irish Locksmith Listing Spam Scandal"
    },
    {
      "level": "H2",
      "text": "What Diners Write About Most: A Study of Restaurant Review Place Topics"
    },
    {
      "level": "H2",
      "text": "Top Local SEO Takeaways from MozCon 2023"
    },
    {
      "level": "H2",
      "text": "How to Get More Local Business Reviews from Travelers"
    },
    {
      "level": "H2",
      "text": "Google SGE: Early Local Search Data"
    },
    {
      "level": "H2",
      "text": "12 Local Search Developments You Need to Know About from Q2 2023"
    },
    {
      "level": "H2",
      "text": "How to Create Kick-Ass Local Landing Pages — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "6 Local SEO Tasks for Summer Success"
    },
    {
      "level": "H2",
      "text": "Easy to Implement Tactics for Local Link Building — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "2023’s Top 7 Local Search Ranking Factors, Illustrated and Explained"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis\n          \n            Amanda Jordan\n          \n            Miriam Ellis\n          \n            Greg Gifford\n          \n            Miriam Ellis"
}