{
  "url": "https://moz.com/blog/category/local-seo/p4",
  "slug": "p4",
  "title": "Local SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Miriam Ellis April 11, 2023 How to Get Bard to Show Your Local Business: Advice from the Source Local SEO | Search Engines | AI and SEO We’re all Bard beginners right now, and so there are no foolish questions. Miriam started out with Bard by asking it local business questions, and learned some useful things from and about Google’s AI chat that you’ll need to know if this technology becomes part of your customers’ lives. Read this post By: Miriam Ellis April 4, 2023 Apple is Taking Their Maps More Seriously and Local Businesses Should, Too Local SEO | Mobile SEO Apple has just launched their new Apple Business Connect interface — designed to make it easier for small businesses to get listed on Apple Maps. If your last real look at Apple Maps was a decade ago when the platform was going through a very awkward stage, it may now be time to revisit the platform. Read this post By: Miriam Ellis March 28, 2023 13 Local Search Developments You Need to Know About from Q1 2023 Local SEO So much has already happened in local search this year. Let’s dive into the most interesting new things we’ve seen in the first three months of 2023! Read this post By: Miriam Ellis March 16, 2023 Three Irish Small Business Ideas that Could Be US Hits Local SEO In honor of St. Patrick's Day, Miriam shares three ideas for small businesses in the US that she has seen taking off in Ireland. Read this post By: Miriam Ellis March 1, 2023 Shelfies: Why and Where Local Businesses Should Publish Them Local SEO If you own or market a local brand, your camera has never been a greater business asset. Early smartphones may have inspired the selfie, but in a commercial context, it’s the “shelfie” that’s coming to the fore as a signal to both customers and search engines of what to expect on your premises. Read this post By: Miriam Ellis February 14, 2023 A Small Gift for Local SEOs and a Big Cheer for Original Images Local SEO According to 3M research, visual aids improve learning by 400% and humans process visual media 60,000 times faster than text. Meanwhile, Time’s Top 100 photos focus on the mighty power of imagery to make an emotional connection. But we’re at a funny moment in time with image content, because we could be on the verge of inundation. Miriam looks at this phenomenon with you today and considers how the local businesses you market can stand out in an increasingly-illustrated world. Read this post By: Miriam Ellis January 25, 2023 Renting vs. Owning the Post-Review Local Consumer Journey Local SEO Local search is a mixed blessing: Loss of control over significant parts of the customer journey can be a source of legitimate stress for owners and marketers, but control of the most important aspects of the consumer journey remains strongly on your side, and you can thrive without the parts you have to give up. Read this post By: Miriam Ellis January 18, 2023 The Ultimate Guide for Taking Full Control of Your Google Business Profile and NMX Local SEO | Search Engines Ready for a deep dive into the 40+ features found on Google Business Profiles and the New Merchant Experience? This article will take you through the most common features of these listings, explain what you can and can’t control on them, and teach you how to manage controllable features in the NMX. Here we go! Read this post By: Miriam Ellis January 12, 2023 5 Times ChatGPT Steered Me Wrong in Local SEO Local SEO | AI and SEO Miriam shares insights into times when ChatGPT steered her wrong with misinformed answers to common local SEO questions. In her post, she takes us through her testing process, providing examples and cautionary advice on the future of ChatGPT. Read this post By: Miriam Ellis January 11, 2023 How to Repair and Improve Local Business Reputation via Google Star Ratings and Reviews Local SEO In this post, you’ll find a set of sensible, actionable steps you can take to raise your Google Business Profile star ratings, improve your reviews, and begin developing the good online reputation you need in order to realize the full profit potential of the local businesses you market. Read this post By: Miriam Ellis January 4, 2023 2023 Local SEO Success: Human Power in a Year of Change Local SEO As we ring in 2023, Miriam shares insights from industry professionals that show why the developments we’ve seen over the past few months indicate greater change ahead — driven by Google’s attitude toward and handling of local and general search philosophy. Read this post By: Meghan Pahinui December 21, 2022 Daily SEO Fix: Monitoring Local Markets Moz Tools | Local SEO How can we keep an eye on our site’s performance within local markets to ensure we’re continuing to show up in relevant searches? In this edition of the Daily SEO Fix, we’ll look at how the Moz tools can help you to monitor how your site is performing in local markets. Read this post By: Miriam Ellis December 19, 2022 12 Local Search Developments You Need to Know About from Q4 2022 Local SEO There has been so much going on, it’s a small wonder if you haven’t caught every development, but here’s a list of some of the most interesting ones you should be aware of as we look towards 2023. We’ve got one new interface, two awful bugs, three new GBP features, four review developments, several guideline updates … all that’s missing is the partridge in the pear tree! Read this post By: Miriam Ellis December 14, 2022 13 Age-based Local Business Review Preferences You Can Serve Local SEO Today, we’ll be learning more about customer preferences by age group surrounding local business reviews, taking a deeper dive into some of the data from The Impact of Local Business Reviews on Consumer Behavior | SEO Industry Report. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Local SEO"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Local SEO"
    },
    {
      "level": "H2",
      "text": "How to Get Bard to Show Your Local Business: Advice from the Source"
    },
    {
      "level": "H2",
      "text": "Apple is Taking Their Maps More Seriously and Local Businesses Should, Too"
    },
    {
      "level": "H2",
      "text": "13 Local Search Developments You Need to Know About from Q1 2023"
    },
    {
      "level": "H2",
      "text": "Three Irish Small Business Ideas that Could Be US Hits"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Shelfies: Why and Where Local Businesses Should Publish Them"
    },
    {
      "level": "H2",
      "text": "A Small Gift for Local SEOs and a Big Cheer for Original Images"
    },
    {
      "level": "H2",
      "text": "Renting vs. Owning the Post-Review Local Consumer Journey"
    },
    {
      "level": "H2",
      "text": "The Ultimate Guide for Taking Full Control of Your Google Business Profile and NMX"
    },
    {
      "level": "H2",
      "text": "5 Times ChatGPT Steered Me Wrong in Local SEO"
    },
    {
      "level": "H2",
      "text": "How to Repair and Improve Local Business Reputation via Google Star Ratings and Reviews"
    },
    {
      "level": "H2",
      "text": "2023 Local SEO Success: Human Power in a Year of Change"
    },
    {
      "level": "H2",
      "text": "Daily SEO Fix: Monitoring Local Markets"
    },
    {
      "level": "H2",
      "text": "12 Local Search Developments You Need to Know About from Q4 2022"
    },
    {
      "level": "H2",
      "text": "13 Age-based Local Business Review Preferences You Can Serve"
    }
  ],
  "author": "Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis\n          \n            Miriam Ellis\n          \n            Meghan Pahinui\n          \n            Miriam Ellis\n          \n            Miriam Ellis"
}