{
  "url": "https://www.similarweb.com/blog/insights/real-estate-news/real-estate-may/",
  "slug": "real-estate-may",
  "title": "U.S. Real Estate Industry Traffic Share Update [May 2023] | Similarweb",
  "description": "Similarweb's May 2023 U.S. real estate home search traffic update also shows Opendoor dropped 43%. Overall traffic was down 0.5%. Get all the data here",
  "content": "HomeBlogInsightsReal Estate NewsZillow Continued to Lead the Web with 318 Million Monthly Visits, While Homes.com Grew over 200% Insights Zillow Continued to Lead the Web with 318 Million Monthly Visits, While Homes.com Grew over 200% Start your free trial by RJ Jones , Vice President of Investor Relations, Communications, Insights, and Sustainability 4 Min. June 22, 2023 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic May 2023 U.S. real estate home search traffic update also shows Opendoor dropped 43% Similarweb’s latest look at the real estate industry’s leading search sites for buying and selling homes shows an overall 0.5% year-over-year slight decrease in visits in the month of May. Homes.com saw the most growth in web traffic on a year-over-year basis at 201%, and RE/MAX grew 22%. Opendoor saw a 43% year-over-year web traffic decline, and Rocket Homes saw a 34% drop in traffic. Zillow led in share of traffic among real estate peers for the month of May 2023 (based on a look at seventeen leading peers) with a 43% share of traffic. Key metrics When Zillow, Trulia and Streeteasy are combined, their market share of traffic makes up 52% of the category, and represents Zillow Group’s leading position. Overall, the top 10 real estate sites continue to control 98% of traffic share. Five of the seventeen sites tracked saw a year-over-year increase in traffic: Homes.com, RE/MAX, Redfin, Compass and Trulia. Homes.com and Redfin were the share gain leaders, while Realtor.com, Zillow and Movoto lost the most share. Web traffic growth shows Homes.com performed best, Opendoor worst We watch traffic to these home search sites as a proxy for potential demand, as most consumers visit these websites before making in-person visits and purchases, and as part of the process of listing their owned homes for sale. The chart below shows the change in web traffic on a year-over-year basis. Homes.com saw major growth, while Opendoor performed the worst. Homes.com appears to be benefiting from increased advertising spend and organic growth. Opendoor saw a 43% decrease as demand has abated for its services. Rocket Homes continued to be impacted by the high interest rate environment, with a 33% decrease. Share of traffic finds Zillow leading, peers lagging The below chart shows the relative market share of each entity in the peer group relative to each other (share of traffic). Zillow leads with 43%, followed by Realtor.com at 19%, Redfin at 15%, and Trulia at 7%. Traffic to Compass, Keller Williams, and eXp Realty barely registers amongst peers, even though they are industry leaders in transaction units and volume. Changes in share of traffic show Realtor.com, Zillow performing worst (surprisingly) Shifts in share of traffic year-over-year show that Realtor (-2.4 percentage points) and Zillow (-1.2 percentage points) performed worst, while Homes.com (+2.8 percentage points) and Redfin (+1.4 percentage points) did the best. The slip by Zillow is surprising, possibly indicating the broad-based loss of buyer interest across the category due to market and rate conditions. Though Zillow has shown a consistent lead over the past year, it did lose share. While Homes.com’s and Redfin’s gains increased, Realtor.com faded further over the past twelve months. The list of the real estate sites in this report and their traffic rankings is below. Brand or Co Domain May 2023 Visits Visits YoY May 2023 Share Share YoY pp Zillow zillow.com 318,373,040 -3.2% 43.0% -1.2 Realtor.com realtor.com 138,616,167 -11.7% 18.7% -2.4 Redfin redfin.com 109,271,830 9.8% 14.8% 1.4 Trulia trulia.com 53,641,969 1.0% 7.2% 0.1 Homes.com homes.com 31,253,850 201.3% 4.2% 2.8 Movoto movoto.com 25,126,967 -11.2% 3.4% -0.4 OneHome onehome.com 17,480,800 -1.5% 2.4% 0.0 RE/MAX remax.com 12,850,082 22.3% 1.7% 0.3 Compass compass.com 9,404,738 2.1% 1.3% 0.0 Streeteasy streeteasy.com 9,351,719 -4.7% 1.3% -0.1 Century 21 century21.com 3,162,998 -23.0% 0.4% -0.1 Coldwell Banker coldwellbanker.com 2,776,910 -11.6% 0.4% 0.0 Rocket Homes rockethomes.com 2,356,616 -33.6% 0.3% -0.2 Keller Williams kw.com 2,110,243 -23.6% 0.3% -0.1 eXp Realty exprealty.com 1,758,579 -5.4% 0.2% 0.0 Opendoor opendoor.com 1,636,268 -43.4% 0.2% -0.2 Homelight homelight.com 1,232,051 -15.0% 0.2% 0.0 Publicly traded companies that own the websites mentioned in this report include Zillow Group (NASDAQ: Z, ZG), Redfin (NYSE: RDFN), News Corp (NASDAQ: NWS, NWSA), CoStar Group (NASDAQ: CSTR), Rocket Companies (NASDAQ: RKT), eXp World Holdings (NYSE: EXPI), Opendoor (NASDAQ: OPEN), Anywhere Real Estate (NASDAQ: HOUS), RE/MAX Holdings (NASDAQ: RMAX), Compass (NYSE: COMP). The Similarweb Insights & Communications team is available to pull additional or updated data on request for the news media (journalists are invited to write to press@similarweb.com). When citing our data, please reference Similarweb as the source and link back to the most relevant blog post or similarweb.com/blog/insights/. Contact: For more information, please write to press@similarweb.com. Methodology Disclaimer: All names, brands, trademarks, and registered trademarks are the property of their respective owners. The data, reports, and other materials provided or made available by Similarweb consist of or include estimated metrics and digital insights generated by Similarweb using its proprietary algorithms, based on information collected by Similarweb from multiple sources using its advanced data methodologies. Similarweb shall not be responsible for the accuracy of such data, reports, and materials and shall have no liability for any decision by any third party based in whole or in part on such data, reports, and materials. Image by Shahid Abdullah from Pixabay by RJ Jones Vice President of Investor Relations, Communications, Insights, and Sustainability Vice President of Investor Relations, Communications, Insights, and Sustainability Related Topics: Real Estate News Stock News This post is subject to Similarweb legal notices and disclaimers. Related Posts Insights Homes.com Web Traffic Grows 194% in Second Quarter; Zillow Remains Share Leader Real Estate News Stock News by RJ Jones 4 Min. Jul 31, 2023 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Zillow Continued to Lead the Web with 318 Million Monthly Visits, While Homes.com Grew over 200%"
    },
    {
      "level": "H2",
      "text": "May 2023 U.S. real estate home search traffic update also shows Opendoor dropped 43%"
    },
    {
      "level": "H3",
      "text": "Key metrics"
    },
    {
      "level": "H2",
      "text": "Web traffic growth shows Homes.com performed best, Opendoor worst"
    },
    {
      "level": "H2",
      "text": "Share of traffic finds Zillow leading, peers lagging"
    },
    {
      "level": "H2",
      "text": "Changes in share of traffic show Realtor.com, Zillow performing worst (surprisingly)"
    },
    {
      "level": "H3",
      "text": "Homes.com Web Traffic Grows 194% in Second Quarter; Zillow Remains Share Leader"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by RJ Jones"
}