{
  "url": "https://moz.com/blog/category/blogging/p3",
  "slug": "p3",
  "title": "Blogging - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Martina Mercer March 21, 2016 10 Simple Steps for Creating a Blog Your Readers Will Adore Content Marketing | Blogging | SEO Copywriting The keys to making your blog a success is knowing who'll be reading it and what they desire in the way of content. Read this post By: Nichole Elizabeth DeMeré March 15, 2016 Here’s How to Combine Storytelling and Data to Produce Persuasive Content Content Marketing | Blogging | SEO Copywriting Ever thought about what really sticks out in your audience's minds? Hint: it's not the hard facts alone. Combining data and storytelling can make your brand's content stick out in a meaningful way; Nichole DeMeré shows you how in today's post. Read this post By: Sam Anthony March 1, 2016 Here’s How a Brand New Website Built an Email List of More than 1,300 Contacts in Three Days Blogging | Email Marketing | Social Media Today I'm going to share how the website FunThingsToDo.io generated 22,000+ pageviews from one blog post. The unbelievable part is the post has zero backlinks and the domain name is only 3.5 months old... Read this post By: Felicia Crawford January 7, 2016 The Best of 2015: Top Posts and People of the Year Blogging | Moz News The Moz Blog Best of 2015 is hot off the presses! Check out the top posts of the year, which comments resonated with the community, who the top commenters were, and more. Here's to a great 2016! Read this post By: Brian Hughes December 29, 2015 Here’s How to Close More B2B Deals with Content Marketing Content Marketing | SEO Analytics | Blogging Content marketing could be the missing element for your brand in nudging B2B prospects toward a sale. Read this post K By: Karl Rahmani November 30, 2015 What We Learned from Testing Content Freshness on 13 Blog Posts Content Marketing | On-page SEO | Blogging Making content freshness work for your brand means looking beyond manipulating dates. Read this post By: Rand Fishkin November 27, 2015 How to Use Hosted Blog Platforms for SEO & Content Distribution Content Marketing | Whiteboard Friday | Blogging Where do you host your content? Is it on your own site, or on third-party platforms like Medium and LinkedIn? Rand goes over the boons and pitfalls of using hosted blog platforms in this week's Whiteboard Friday. Read this post By: Eric Enge October 19, 2015 Preparing Your Killer Content Marketing Pitch Content Marketing | Marketing Industry | Blogging The hardest part of writing any pitch isn't the creation of the pitch itself. It's the legwork you have to do in advance. Successful pitches are all about preparation, and frankly, there needs to be a lot of it. By following these essential 6 steps to crafting and delivering your pitch, you'll be sure to amplify your content marketing efforts. Read this post By: Sayed Shahnur October 16, 2015 Craft Winning CTAs with Four Simple Tips Content Marketing | Conversion Rate Optimization (CRO) | Blogging Even if you're a novice at crafting CTAs, you have the ability to create messages that attain clicks. Read this post By: Ronell Smith September 30, 2015 Why Meaning Will Ultimately Determine Your Brand's Content Marketing Success Content Marketing | Blogging | SEO Copywriting If your brand is ready to make the next big step in content marketing, adding meaning to the content you create and share is a necessity. Read this post By: Trevor Klein September 21, 2015 A Picture of You: Results of the 2015 Moz Blog Reader Survey Blogging | Moz News This summer, 750+ of our readers told us about themselves, their work, and their thoughts on the Moz Blog. Here's what they had to say. Read this post By: Michael Patterson September 18, 2015 The Strategy That Helped Sprout Social Double Its Blog Traffic Keyword Research | SEO Analytics | Blogging By being attentive to the user-insight gleaned from their website, Sprout Social turned a few simple tweaks into a bonafide blog-optimization strategy. Read this post By: Anthony D. Nelson September 9, 2015 Case Study: Can You Fake Blog Post Freshness? Content Marketing | On-page SEO | Blogging The author's small test seems to confirm Google's affinity for fresh content. You might consider a similar experiment for your site. Read this post By: Eric Enge September 9, 2015 A Clear Path for Marketers to Surviving Content Shock Content Marketing | Advanced SEO | Blogging The rise of content marketing has caused many to fear what's been billed as \"content shock,\" but this post outlines 6 ways to thrive as a content marketer in today's world. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Blogging"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Blogging"
    },
    {
      "level": "H2",
      "text": "10 Simple Steps for Creating a Blog Your Readers Will Adore"
    },
    {
      "level": "H2",
      "text": "Here’s How to Combine Storytelling and Data to Produce Persuasive Content"
    },
    {
      "level": "H2",
      "text": "Here’s How a Brand New Website Built an Email List of More than 1,300 Contacts in Three Days"
    },
    {
      "level": "H2",
      "text": "The Best of 2015: Top Posts and People of the Year"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Here’s How to Close More B2B Deals with Content Marketing"
    },
    {
      "level": "H2",
      "text": "What We Learned from Testing Content Freshness on 13 Blog Posts"
    },
    {
      "level": "H2",
      "text": "How to Use Hosted Blog Platforms for SEO & Content Distribution"
    },
    {
      "level": "H2",
      "text": "Preparing Your Killer Content Marketing Pitch"
    },
    {
      "level": "H2",
      "text": "Craft Winning CTAs with Four Simple Tips"
    },
    {
      "level": "H2",
      "text": "Why Meaning Will Ultimately Determine Your Brand's Content Marketing Success"
    },
    {
      "level": "H2",
      "text": "A Picture of You: Results of the 2015 Moz Blog Reader Survey"
    },
    {
      "level": "H2",
      "text": "The Strategy That Helped Sprout Social Double Its Blog Traffic"
    },
    {
      "level": "H2",
      "text": "Case Study: Can You Fake Blog Post Freshness?"
    },
    {
      "level": "H2",
      "text": "A Clear Path for Marketers to Surviving Content Shock"
    }
  ],
  "author": "Martina Mercer\n          \n            Nichole Elizabeth DeMeré\n          \n            Sam Anthony\n          \n            Felicia Crawford\n          \n            Brian Hughes\n          \n            Karl Rahmani\n          \n            Rand Fishkin\n          \n            Eric Enge\n          \n            Sayed Shahnur\n          \n            Ronell Smith\n          \n            Trevor Klein\n          \n            Michael Patterson\n          \n            Anthony D. Nelson\n          \n            Eric Enge"
}