{
  "url": "https://moz.com/blog/category/blogging/p5",
  "slug": "p5",
  "title": "Blogging - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Asif Dilshad January 30, 2014 Why I still do Guest Blogging Blogging Despite what Matt Cutts wrote, here is why I still guest blog. Read this post By: Jennifer Sable Lopez January 23, 2014 Time for Guest Blogging With a Purpose Blogging Guest blogging isn't dead. Being a Spammy McSpammer who only guest blogs to build links is dead. Read this post By: Federico Einhorn December 17, 2013 Four Reasons Why Guest Posts on Popular Sites Don't Always Get Results (and What to Do about Them) Blogging So you write a kick-ass article and publish it on a reputable blog. Surely, a post on [insert famous blog here] would send an avalanche of new visitors/subscribers/leads your way. Except that it doesn’t. What went wrong? Read this post By: Danny Dover December 4, 2013 11 Marketing Survival Lessons Learned from Accidentally Enraging an Island City-State Blogging 600,000 unique visitors flooded in to read the post and half of them were not happy with me. This post outlines the 11 most important marketing lessons I learned from accidentally enraging a good portion of the island of Singapore. Read this post By: Jeff Sauer October 24, 2013 How to Live Blog for Links and Notoriety Blogging Live blogging is equal parts exhilarating, nerve wracking and pressure filled. You need to think fast and use both sides of your brain as you soak in and spit out information at the same time. I imagine that a live blogger probably looks very similar to cookie monster to other conference goers as you pound away furiously at your computer and snap countless photos of the speaker. Read this post By: David Sottimano September 30, 2013 Blogger Outreach - What Do They Think About SEOs? Blogging Have you ever wondered why bloggers didn’t reply to your last outreach email? Why they refused to link to your shiny new infographic, or what they really think about SEOs? This post walks through the results from a survey of bloggers, offering a window into their world. Read this post By: Mackenzie Fogelson September 12, 2013 Five Steps to Finding (the Right) Guest-Blogging Opportunities Blogging Guest blogging can be an effective way to build credibility and attract the right customers to your business and your community. Here are five simple steps for finding the right opportunities. Read this post By: Alex Ramadan August 12, 2013 How to Get Your Guest Post Request Thrown in The Trash Instantly Blogging As someone who is on both sides of guest posting, requester and requestee, I’ve seen my fair share of great guest post requests and I’ve seen some truly awful ones. The truly appalling requests get thrown out right away. Identifying these types of posts is pretty easy, so easy that I can scan through an email and usually label it trash within a few seconds. Here are six things to avoid when sending out guest posts requests if you don't want your request landing in the trash: Read this post By: Zach Ball July 30, 2013 Guest Post Outreach Best Practices Blogging This is a section from the Page One Power Employee Handbook, with minor edits. In the spirit of TAGFEE we thought it'd be fun and (hopefully) helpful to share some of the information and best practices we use internally. Hope you enjoy! Read this post By: Joe Davies June 25, 2013 5 Unique Ways to Find Blog Post Ideas For Even the Most Painfully Boring Industries Blogging It's no fun coming up with blog ideas in those boring industries outside of SEO and marketing. You know what I mean, the 'real' world of forklifts, car dealerships, garden furniture and bedding. Even when coming up with new content for your own blog, in your own specialty niche, sometimes it can be a bit tough. Read this post By: Stephen Kenwright May 23, 2013 10 Lessons from a 100k Pageview Post Blogging This kind of thing might happen to Rand all the time, but it’s not often that a digital marketing company based in Leeds gets 100,000+ people reading anything it does (at least on its own site). That’s what unexpectedly happened to us on www.branded3.com a few weeks ago – what essentially started as a rant from some guy having a bad day blew up and now has 1,184 votes on Hacker News (and incoming links from some of the biggest sites in the world). Read this post By: Patrick O'Neill March 14, 2013 Deciding Where to Guest Blog: A TV Guide Approach Blogging Guest blogging can be one of the most daunting tasks for both professionals and casual bloggers, alike. You are faced with this unfathomably large sea of information and you are trying to find someone who will accept your little guest post on how to make tastier sugar cookies (or whatever). It certainly isn’t easy, and it’s going to take a lot of leg work before you start posting material that will generate a following for your own blog. The best thing that you can do – and sometimes, the only thing that you can do – is to try and impress a reputable blog to start building your own credibility as a writer. Read this post By: Pratik Dholakiya January 21, 2013 The Ultimate Guide to Advanced Guest Blogging Blogging With “content marketing” being the indisputable SEO buzzword of 2012, we can expect 2013 to see an onslaught of marketers trying to build links with guest posts. The growth in this market will cause some sites to lower their guest posting standards, others to raise them, and still more to stop accepting them altogether. We're going to help you combat this by sharing how we got posts up on ProBlogger and Search Engine Journal, and by introducing you to our strategy for success with our clients. Read this post By: Tanner Christensen January 9, 2013 How To Blog Successfully About Anything Blogging In order to create a successful blog, you must be passionately curious about the topic you're covering. Learn how to turn even the most uninteresting blog post topics into goldmines with these tips for successful bloggers. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Blogging"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Blogging"
    },
    {
      "level": "H2",
      "text": "Why I still do Guest Blogging"
    },
    {
      "level": "H2",
      "text": "Time for Guest Blogging With a Purpose"
    },
    {
      "level": "H2",
      "text": "Four Reasons Why Guest Posts on Popular Sites Don't Always Get Results (and What to Do about Them)"
    },
    {
      "level": "H2",
      "text": "11 Marketing Survival Lessons Learned from Accidentally Enraging an Island City-State"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "How to Live Blog for Links and Notoriety"
    },
    {
      "level": "H2",
      "text": "Blogger Outreach - What Do They Think About SEOs?"
    },
    {
      "level": "H2",
      "text": "Five Steps to Finding (the Right) Guest-Blogging Opportunities"
    },
    {
      "level": "H2",
      "text": "How to Get Your Guest Post Request Thrown in The Trash Instantly"
    },
    {
      "level": "H2",
      "text": "Guest Post Outreach Best Practices"
    },
    {
      "level": "H2",
      "text": "5 Unique Ways to Find Blog Post Ideas For Even the Most Painfully Boring Industries"
    },
    {
      "level": "H2",
      "text": "10 Lessons from a 100k Pageview Post"
    },
    {
      "level": "H2",
      "text": "Deciding Where to Guest Blog: A TV Guide Approach"
    },
    {
      "level": "H2",
      "text": "The Ultimate Guide to Advanced Guest Blogging"
    },
    {
      "level": "H2",
      "text": "How To Blog Successfully About Anything"
    }
  ],
  "author": "Asif Dilshad\n          \n            Jennifer Sable Lopez\n          \n            Federico Einhorn\n          \n            Danny Dover\n          \n            Jeff Sauer\n          \n            David Sottimano\n          \n            Mackenzie Fogelson\n          \n            Alex Ramadan\n          \n            Zach Ball\n          \n            Joe Davies\n          \n            Stephen Kenwright\n          \n            Patrick O'Neill\n          \n            Pratik Dholakiya\n          \n            Tanner Christensen"
}