{
  "url": "https://moz.com/blog/category/blogging/p8",
  "slug": "p8",
  "title": "Blogging - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "J By: Jonah Stein June 16, 2010 Help Us Stop Malware Hacking Blogging We are currently working on a new product to make sophisticated solutions to prevent hacking simple and affordable enough for the small web business owner and we need to get some feedback from designers, developers and site owners. These answers will help us make sure that our product contains the features you want and need. The survey should take less than ten minutes of your time. If you complete the questions, we’ll give you a free one-year basic subscription to the product when it launches. Read this post By: Rand Fishkin April 8, 2010 Why Won't Google Penalize/Ban the Site I Spam Reported? Blogging One of the most common complaints I've heard from webmasters and SEOs in the past 18 months has been around Google's inaction on spam reports. While the web spam team has been aggressive about asking webmasters to contribute via their spam report form (though they prefer the version in Webmaster Tools as this ... Read this post T By: Thomas Høgenhaven February 16, 2010 Getting Back From A Penalty - Second Time Around Blogging When attending SEO conferences and reading blogs, two topics seem to persist between all the trending ones: link building and penalties. The two permanent hot topics are obviously related, as most penalties today seem to be caused by the backlink profile. Being hit by a penalty – whether it’s a complete ban or merely a -50 filter, is a frustrating process. It is indeed Kaf... Read this post By: Jennifer Sable Lopez July 30, 2009 How to Spam Blogs and Possibly Get Away With It Blogging Ok, so you've all read about The Best Spam Submission Ever which was illustrated ever so eloquently (and if you haven't read it, please read it now... uhm well ok after you read this - it's awesomely funny!). As the post mentions, we sift through many YOUmoz entries every day determini... Read this post S By: Stu Price June 23, 2009 Case Study - How to Beat Google and Rank #2 for Viagra Blogging I have been following the keyword \"Viagra\" lately and have noticed a website creep up the ranking ladder. Most of the sites do belong on the front page of Google, such as: Viagra.com, Wikipedia, howstuffworks, etc. So... I was wondering how did http:... Read this post T By: Theo van der Zee March 31, 2009 Finding Hidden Links and Text Using the Web Developer Toolbar Blogging White hat versus black hat SEO seems like a never-ending discussion. An action one SEO finds absolutely fair might be seen as downright cheating by another. The ambiguity in the guidelines from search engines such as Google usually isn't adding much clearness to the discussion either. On some issues, however, the search engines are crystal clear, and hidden links/hidden text is one of those. Information on the matter is given in both the Google Guidelines and on the personal blog of Matt Cutts: hidden text and links are not allowed. Read this post By: Rand Fishkin March 17, 2009 Rewriting the Beginner's Guide Part IX: Myths, Penalties and Spam Blogging Common Myths & Misconceptions About Search Engines -------------------- Unfortunately, over the past 12 years, a great number of misconceptions have emerged about how the search engines operate and what's required to perform effectively. In this section, we'll cover the most common of these, and explain the \"real story\" behind the myth. Read this post By: John McElborough November 18, 2008 Has Google Given Up Trying to Police On-Page Ranking Factors? Blogging I was cruising around the Internet doing some research for a pitch the other day, and as I often do in such cases I had switched off javascript on my browser and forgotten to switch it back on again. That’s how I stumbled upon this beaut of a piece of crude ‘black-hatting’. Read this post By: Rand Fishkin November 6, 2008 How to Find the Spam You're Linking To Blogging Today, between meetings at the office, I had a brief IM chat with Jane, whose globetrotting ways have taken her to the UK for SMX London. Jane noted that our website - www.seomoz.org - was up for review on a search engine panel today, and received generally positive feedback from the engineers. One notable exception, however, was the fact that... Read this post C By: chris1 October 22, 2008 PissedConsumer.com: Link Farm Dominating Google SERPs Blogging First off I would like to point out that I am a paid search specialist, not an experienced SEO. If this article contains technical mistakes, I apologize. I am a marketer by nature, not a techie. I am technically savvy enough, however, to spot an obvious link farm/spam scheme, such as the one run by the web site: www.piss... Read this post By: Will Critchlow October 3, 2008 Link Forensics: Finding Shady Links Before Taking on New Clients Blogging What happened was that their past had just caught up with them. They had previously engaged a local SEO firm with tactics that were a bit past their sell-by date (mainly consisting of a huge link network of sub-domains off the SEO company's own site and some other properties). There was not only a question of tactics here, but also of plain common sense - not only was part of the link network on the SEO company's site, but so were proud links to \"our clients\" (all of whom got slapped, we believe). Read this post By: Jane Copland October 1, 2008 An Ethical Debate On Which We Can All (Maybe) Agree: The Average Webmaster And Dodgy SEO Blogging Yesterday afternoon, as I was at home recovering from a form of black death known as the common head cold, I came across Danny Sullivan's piece on Search Engine Land about his dealings with a lazy link broker. I recommend reading Danny's post, which details how he questioned a person who wanted a link on the Sphinn.com homepage with the anchor text \"search engine optimisation.\" The person represented a UK-based SEO firm. I'm not saying that reading or even acknowledging the status of Sphinn is necessary for success in our industry, but one should probably avoid trying to buy links from a site SEOs and search engine employees read with regularity. Read this post By: robert nicholson August 26, 2008 Typosquatting: Why Registering Your Common Misspell Domains is Essential Blogging This is a tactic in the books of certain Intel agencies- disclaimer - it can be used negatively - but if used defensively this can help your company, and give side benefits to SEO (betchya the spooks didnt figure that one out!) Ok so we're familar with the idea of Typo-squatting. When I look on google trends, or such, and see that 25% of... Read this post M By: mrpurple August 7, 2008 All That Is Wrong With SEO in the UK Blogging Have you used a search engine recently and been disappointed with the results it returned? If so it is unlikely you are alone. Here’s why. In order to survive in the online world, websites need traffic. Visitors are an essential commodity. They generate the page impressions and revenues that any website needs to grow and thrive. Without a consta... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Blogging"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Blogging"
    },
    {
      "level": "H2",
      "text": "Help Us Stop Malware Hacking"
    },
    {
      "level": "H2",
      "text": "Why Won't Google Penalize/Ban the Site I Spam Reported?"
    },
    {
      "level": "H2",
      "text": "Getting Back From A Penalty - Second Time Around"
    },
    {
      "level": "H2",
      "text": "How to Spam Blogs and Possibly Get Away With It"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Case Study - How to Beat Google and Rank #2 for Viagra"
    },
    {
      "level": "H2",
      "text": "Finding Hidden Links and Text Using the Web Developer Toolbar"
    },
    {
      "level": "H2",
      "text": "Rewriting the Beginner's Guide Part IX: Myths, Penalties and Spam"
    },
    {
      "level": "H2",
      "text": "Has Google Given Up Trying to Police On-Page Ranking Factors?"
    },
    {
      "level": "H2",
      "text": "How to Find the Spam You're Linking To"
    },
    {
      "level": "H2",
      "text": "PissedConsumer.com: Link Farm Dominating Google SERPs"
    },
    {
      "level": "H2",
      "text": "Link Forensics: Finding Shady Links Before Taking on New Clients"
    },
    {
      "level": "H2",
      "text": "An Ethical Debate On Which We Can All (Maybe) Agree: The Average Webmaster And Dodgy SEO"
    },
    {
      "level": "H2",
      "text": "Typosquatting: Why Registering Your Common Misspell Domains is Essential"
    },
    {
      "level": "H2",
      "text": "All That Is Wrong With SEO in the UK"
    }
  ],
  "author": "Jonah Stein\n          \n            Rand Fishkin\n          \n            Thomas Høgenhaven\n          \n            Jennifer Sable Lopez\n          \n            Stu Price\n          \n            Theo van der Zee\n          \n            Rand Fishkin\n          \n            John McElborough\n          \n            Rand Fishkin\n          \n            chris1\n          \n            Will Critchlow\n          \n            Jane Copland\n          \n            robert nicholson\n          \n            mrpurple"
}