{
  "url": "https://moz.com/blog/category/blogging/p9",
  "slug": "p9",
  "title": "Blogging - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Rand Fishkin July 26, 2008 Exposing Gray/Black Hat Information - What Should SEOmoz Do? Blogging For a long time, I've held the personal belief that to be a the best search marketer you can be requires knowledge of a vast information set. From web crawling and algorithmic... Read this post J By: John Sabia June 18, 2008 Trulia's Web Ranking Strategies Come Under Fire Blogging Trulia's Web Ranking Strategies Under Fire There is much controversy these days in the real estate blogging world about the overly aggressive link strategies employed by Trulia. Galen Ward, co-founder of Estately.com, a Seattle real estate brokerage, first brought to light the on... Read this post By: Darren Slatten June 3, 2008 Get Free Links on Search Engine Watch! Blogging Before you read any further... there are NO free links on Search Engine Watch. I just made that up to get your attention. Well... kinda. Ok, so maybe there ARE free links... but only if you're a douchebag SEO wannabe. I'm only using SEW as an example, because (1.) it's the first example I could find, and (2.) I'm hoping th... Read this post G By: George Davis April 17, 2008 Help! I've Been SEO Sabotaged! Blogging The following is a gross exageration of my reaction to an incident I experienced recently, the form of writing is intended to poke fun at my ridiculous reaction to it. So i'm doing some routine checking in on my inbound link numbers for our site, open up google webmaster tools and I see this : ... Read this post By: Rand Fishkin April 11, 2008 The Dangers of Cloaking Revealed at SMX Sydney Blogging Today at SMX Sydney (which I'll have a more detailed post about this weekend), Danny Sullivan and I sat together on a site review panel in the late afternoon. One of the sites we were asked to review was DiscoverTasmania.com. During our investigations, we stumbled across some remarkable cloaking f... Read this post By: Rand Fishkin March 19, 2008 Separating Web Spam from Quality Content - What are the Metrics? Blogging Let's try a little excercise... Common features of spam domains include: Long domain names .info, .cc, .us and other cheap, easy to grab TLDs Short registration period (1 year, maybe 2) High ratio of ad blocks to content Javascript redirects from initial landing pages Use of common, high-commer... Read this post N By: Nabha March 5, 2008 Why Be White Hat? Who Cares About Morals? Blogging Eric Ward, known as the first link builder, recently wrote: \"Why not try to fool Google? ... Why should I behave in an ethical and white-hat way when my competitor's aren't, but they still rank way ahead of me? These are all fair questions that probably won't be answered any time soon.\"(Search Marketing Standard, Winter 07/... Read this post By: Richard Baxter February 21, 2008 Using Hidden Links in Divs = Get Great Google Rankings Blogging Investigating rankings in Google's search results pages is part of every SEO's daily chores. From time to time, the odd ranking sticks out like a sore thumb. Sleeves rolled up and my best black hat on, let's try to find out what's happening here.... Read this post By: WelcomeDay December 26, 2007 Black or White SEO? Blogging I will be frank here.I am quite new to SEO, optimization, web design and site creation, etc. I have a few of my own sites and I am working hard on them using the best optimization tools available. But I can see some trends here already.I have a few friends that use black seo like doorways, cloaking, you name them... They can easily make over $10,000/month with a 2 month old site a... Read this post By: Rand Fishkin November 20, 2007 The Dark Side of Wikipedia Blogging Biased manipulation runs wild on Wikipedia and the extent to which it influences the pages of that site will probably never be known. In the field of SEO, where every link counts, Wikipedia's reference links at the bottom of articles and their external links in the body text of articles was once considered gold in terms of value for driving up search engine rankings. Early this year, Wikipedia ... Read this post P By: Patrick Altoft November 2, 2007 How to Optimise Your Site for Each Individual Search Engine Blogging Rebecca posted an interesting post yesterday discussing whether we should optimise sites for different search engines. While creating pages with different keyword densities sounds like an idea that might work it's a lot harder in practice.The technique I've used in the past is to change the ... Read this post By: Rand Fishkin October 24, 2007 Google Toolbar PageRank Losses For Hundreds of Websites Blogging This morning brings news from around the web of losses to the Google Toolbar PageRank (the little green pixels displayed in the toolbar) for a myriad of sites. I've gone through many of the threads and tried to pull together an accounting of websites that have been \"reportedly\" affected by the update. Hopefully, by collecting this data, and combining it with reports in the comments, we c... Read this post By: Rand Fishkin October 4, 2007 The \"Google Payola\" Issue Isn't Going Away Anytime Soon Blogging This morning, Andy Greenberg wrote an article for the front page of Forbes' technology section - Google Purges the Payola. The article focuses on the ongoing battle between search engines and paid links - a battle that most see as unlikely to ever end: ... Read this post By: Rand Fishkin August 15, 2007 Social Media Manipulation Runs Rampant Blogging I'm barely qualified to bring up this subject, as SEOmoz has certainly had our fair share of asking a friend to submit something to Digg, give us a boost on Reddit or add a tag at Del.icio.us, but I was pretty surprised to see the level to which social media manipulation has been taken:... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Blogging"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Blogging"
    },
    {
      "level": "H2",
      "text": "Exposing Gray/Black Hat Information - What Should SEOmoz Do?"
    },
    {
      "level": "H2",
      "text": "Trulia's Web Ranking Strategies Come Under Fire"
    },
    {
      "level": "H2",
      "text": "Get Free Links on Search Engine Watch!"
    },
    {
      "level": "H2",
      "text": "Help!  I've Been SEO Sabotaged!"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "The Dangers of Cloaking Revealed at SMX Sydney"
    },
    {
      "level": "H2",
      "text": "Separating Web Spam from Quality Content - What are the Metrics?"
    },
    {
      "level": "H2",
      "text": "Why Be White Hat? Who Cares About Morals?"
    },
    {
      "level": "H2",
      "text": "Using Hidden Links in Divs = Get Great Google Rankings"
    },
    {
      "level": "H2",
      "text": "Black or White SEO?"
    },
    {
      "level": "H2",
      "text": "The Dark Side of Wikipedia"
    },
    {
      "level": "H2",
      "text": "How to Optimise Your Site for Each Individual Search Engine"
    },
    {
      "level": "H2",
      "text": "Google Toolbar PageRank Losses For Hundreds of Websites"
    },
    {
      "level": "H2",
      "text": "The \"Google Payola\" Issue Isn't Going Away Anytime Soon"
    },
    {
      "level": "H2",
      "text": "Social Media Manipulation Runs Rampant"
    }
  ],
  "author": "Rand Fishkin\n          \n            John Sabia\n          \n            Darren Slatten\n          \n            George Davis\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Nabha\n          \n            Richard Baxter\n          \n            WelcomeDay\n          \n            Rand Fishkin\n          \n            Patrick Altoft\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin"
}