{
  "url": "https://backlinko.com/hub/seo#fundamentals",
  "slug": "seo",
  "title": "SEO Marketing Hub 2.0",
  "description": "The SEO Marketing Hub: a library of 30+ resources that cover basic and advanced search engine optimization concepts and techniques.",
  "content": "SEO FundamentalsWhat you'll learnLearn the basics of SEO all in one place, including crawling, indexing, search engine ranking signals, choosing keywords, content freshness, anchor text, and more. 8 ResourcesWhat Is SEO?Search Engine PositioningSEO vs. SEMSearch Engine Ranking FactorsSEO Best PracticesSEO MetricsSEO Friendly Web DesignWhat Are SERPs?Start nowKeyword Research StrategiesWhat you'll learnLearn how to find keywords that your audience searches for in Google, YouTube and other popular search engines. 4 ResourcesSEO KeywordsKeyword DifficultyChoose Keywords: A 6-Step Essential GuideLong Tail KeywordsStart nowContent Optimization StrategiesWhat you'll learnLearn how to optimize your content like the pros. See exactly how to optimize your site’s on-page SEO, get featured in the coveted Featured Snippet spot, and tap into Semantic SEO. 8 ResourcesSEO WritingMeta DescriptionsSEO Friendly URLsInternal LinkingSemantic SEORich SnippetsLSI KeywordsFeatured SnippetsStart nowTechnical SEOWhat you'll learnLearn tips and strategies to ensure that your website’s technical SEO is in tip-top shape, including techniques for improving your site’s loading speed, website architecture, and crawl budget. 6 ResourcesWebsite ArchitectureSitemapsCrawl BudgetPage Speed and SEORobots.txtDuplicate ContentStart nowLink Building for SEOWhat you'll learnLearn specific strategies that you can use to build links to your site, including Broken Link Building, Link Bait, Evergreen Content and data-driven industry studies. 5 ResourcesBacklinksBroken Link BuildingLink BaitResource Page Link BuildingOriginal Research and DataStart nowUser Experience SignalsWhat you'll learnLearn how to optimize your site’s pages around “User Experience Signals”, like CTR, Dwell Time, searcher intent, and more. 6 ResourcesDwell TimeBounce RatePogo StickingOrganic CTRSearch IntentCore Web VitalsStart nowSEO Tools and SoftwareWhat you'll learnLearn all about the world’s most popular SEO software, like SEMrush, Ahrefs, Moz and Raven Tools. Includes lots of pro tips to help you get the most out of each tool. 5 ResourcesSemrush Ultimate GuideYoast SEO PluginMoz ProRaven ToolsUbersuggestStart nowAdvanced SEO StrategiesWhat you'll learnA library of resources to help you step up your SEO game. 7 ResourcesMeasuring SEO Performance & ResultsContent Gap AnalysisContent AuditsSearch Engine VisibilitySERP FeaturesBuilding an SEO TeamEnterprise SEOStart now",
  "headers": [
    {
      "level": "H3",
      "text": "Semrush helps you:"
    },
    {
      "level": "H3",
      "text": "Backlinko readers get:"
    },
    {
      "level": "H2",
      "text": "Grow your online visibility.\r\nOn all key channels.\r\nFrom just one platform."
    },
    {
      "level": "H1",
      "text": "SEO Marketing Hub 2.0"
    },
    {
      "level": "H4",
      "text": "Learn"
    },
    {
      "level": "H4",
      "text": "Company"
    },
    {
      "level": "H4",
      "text": "Connect"
    }
  ],
  "author": ""
}