{
  "url": "https://moz.com/blog/category/seo-analytics/p13",
  "slug": "p13",
  "title": "SEO Analytics - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Ben Morel June 16, 2014 Is Google Analytics Hurting your Business? SEO Analytics When is “Good Enough” good enough? At Brighton SEO this year one of the talks opened with a rather bold statement: “Delete Google Analytics”. In this post, you'll question the common wisdom that Google Analytics is the best thing since hypertext protocols and ask yourself whether it might actually be harming your business. Read this post By: Steve Groller June 2, 2014 Maximize Your Social Media Strategy in Just 4 Steps SEO Analytics | Social Media In the agency space, we often find ourselves on one side of an epic conflict. The battleground: the lush, rolling hills of the digital marketing landscape. The weapon of choice: social media marketing. Marketing officers (and their overseers in senior management) always seem to want very particular results regarding social; in other words, ways to justify the expense or prove that an agency is \"worth its salt.\" Read this post M By: Matthew Brovelli May 28, 2014 Top 5 Mistakes to Avoid When Using Google Analytics with Site Search SEO Analytics The engineers I work with have developed a useful list of common mistakes that website owners make when using Google Analytics and site search, along with guidance for better understanding of what’s happening on your site. Read this post By: Tom Capper March 10, 2014 How to Set Up Meaningful (Non-Arbitrary) Custom Attribution in Google Analytics SEO Analytics Attribution modeling in Google Analytics is potentially very powerful in the results it can give us, yet few people use it well. This post shows you how to get started with the data you already have. Read this post By: Jeff Sauer February 25, 2014 (Provided): 10 Ways to Prove SEO Value in Google Analytics SEO Analytics We and our clients have relied on keyword reports for so long that we're now using (not provided) as a crutch. This post offers 10 ways you can use Google Analytics to prove your SEO value now that those keywords are gone. Read this post By: Geoff Kenyon February 17, 2014 Google Analytics Checklist for New Projects SEO Analytics Whether you're setting Google Analytics up on a site for the first time or checking a client's existing implementation, there are quite a few standards to remember. This post offers a simple checklist for doing the job right. Read this post By: Chad Wittman January 23, 2014 Make Facebook's Algorithm Change Work For You, Not Against You SEO Analytics Recently, many page admins have been experiencing a significant decrease in Total Reach—specifically, organic reach. For pages that want to keep their ad budget as low as possible, maximizing organic reach is vital. To best understand how to make a change like this work for you, and not against you, we need to examine what happened—and what you can do about it. Read this post By: David Kelly January 2, 2014 How to Use the Information Inside Google's Ved Parameter SEO Analytics With much of the information about where visitors came from now encrypted by Google, any tools that can help crack that code are worthwhile. This post shows you how to pull apart Google's ved parameter and break down the information it contains in Google Analytics. Read this post By: Tim Resnik December 18, 2013 Easing the Pain of Keyword Not Provided: 5 Tactics for Reclaiming Your Data SEO Analytics We've all become accustomed to seeing (not provided) instead of organic keywords, but many marketers are still wondering what to do without that data. Here are five tactics that'll get you back on track. Read this post C By: Craig Bradford December 2, 2013 Treat Your Channels like a Soccer Team SEO Analytics Different marketing channels play different roles, and just as you wouldn't build a soccer team with only goal-scoring strikers, you shouldn't build a suite of marketing channels that focus solely on conversions. Read this post By: Erica McGillivray November 29, 2013 Kyle Rush Reveals How the Obama Campaign Broke Every Online Fundraising Record: Free #MozCon Video SEO Analytics Watch Kyle Rush's full-length MozCon 2013 presentation for free on the conversion rate optimization and a/b testing that he did for Obama for America. Read this post By: Peter Meinertzhagen November 29, 2013 How to Calculate Share of Voice for Organic Search SEO Analytics In today’s post, I am going to be tackling a classic marketing measurement: share of voice. Share of voice is a way of measuring an amount of advertising presence or strength for a particular brand or product, or essentially: how much is our brand or product talked about compared to our competitors? The beauty of the internet is that we have a way of measuring how much we are being talked about, or what percentage of our audience’s attention we have. Read this post By: Geoff Kenyon November 11, 2013 How to Track the Online ROI of Offline Advertising SEO Analytics Tracking the success of offline marketing campaigns can be far more difficult than online campaigns, but it's equally important. Here are a few simple steps you can take to put that tracking in place. Read this post By: Clive Patterson November 6, 2013 5 Actionable Metrics To Track On Your Marketing Dashboard SEO Analytics The problem with Analytics is that there is too much data and most people don’t even know how to get started. Staring blankly at your visitor count may be interesting, but it’s not much use unless you can actually take action on it. One great way to reduce your procrastination and ensure that you actually use Analytics effectively is to set up a marketing dashboard. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO Analytics"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on SEO Analytics"
    },
    {
      "level": "H2",
      "text": "Is Google Analytics Hurting your Business?"
    },
    {
      "level": "H2",
      "text": "Maximize Your Social Media Strategy in Just 4 Steps"
    },
    {
      "level": "H2",
      "text": "Top 5 Mistakes to Avoid When Using Google Analytics with Site Search"
    },
    {
      "level": "H2",
      "text": "How to Set Up Meaningful (Non-Arbitrary) Custom Attribution in Google Analytics"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "(Provided): 10 Ways to Prove SEO Value in Google Analytics"
    },
    {
      "level": "H2",
      "text": "Google Analytics Checklist for New Projects"
    },
    {
      "level": "H2",
      "text": "Make Facebook's Algorithm Change Work For You, Not Against You"
    },
    {
      "level": "H2",
      "text": "How to Use the Information Inside Google's Ved Parameter"
    },
    {
      "level": "H2",
      "text": "Easing the Pain of Keyword Not Provided: 5 Tactics for Reclaiming Your Data"
    },
    {
      "level": "H2",
      "text": "Treat Your Channels like a Soccer Team"
    },
    {
      "level": "H2",
      "text": "Kyle Rush Reveals How the Obama Campaign Broke Every Online Fundraising Record: Free #MozCon Video"
    },
    {
      "level": "H2",
      "text": "How to Calculate Share of Voice for Organic Search"
    },
    {
      "level": "H2",
      "text": "How to Track the Online ROI of Offline Advertising"
    },
    {
      "level": "H2",
      "text": "5 Actionable Metrics To Track On Your Marketing Dashboard"
    }
  ],
  "author": "Ben Morel\n          \n            Steve Groller\n          \n            Matthew Brovelli\n          \n            Tom Capper\n          \n            Jeff Sauer\n          \n            Geoff Kenyon\n          \n            Chad Wittman\n          \n            David Kelly\n          \n            Tim Resnik\n          \n            Craig Bradford\n          \n            Erica McGillivray\n          \n            Peter Meinertzhagen\n          \n            Geoff Kenyon\n          \n            Clive Patterson"
}