{
  "url": "https://moz.com/blog/category/seo-analytics/p14",
  "slug": "p14",
  "title": "SEO Analytics - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Sean Smith November 1, 2013 How to Track PDF Traffic and Links in Google Analytics and Open Site Explorer SEO Analytics This tactic was actually shown to me by Jeremiah Smith (my brother) over at SimpleTiger. The need for this came about when one of our Healthcare Marketing clients needed to track the actual impact their PDFs were having on their organic search volume, and traffic in general. Read this post By: Dave Rekuc October 30, 2013 How to Discover New Opportunities with No Keyword Referral Data SEO Analytics The latest hurdle in the search industry is the possibility of 100% of search referral data to be hidden from Google organic search. Yowza. I'm not going to lie, that stings. But, as usual, marketers will not only find a way, but the savvy marketer will find a way to stand out from the pack. Read this post By: Rand Fishkin October 16, 2013 Why Visitor Analytics Aren't Enough for Modern Marketers SEO Analytics Visitor analytics tools like Google Analytics provide critical data to marketers, but we need to go beyond that information - both higher level (across competitive leading indicators) and deeper (into business metrics) to truly succeed. Read this post By: Mynda Treacy October 8, 2013 Inbound Link Categorization Dashboard Redesign SEO Analytics The moment I lay my eyes on this Inbound Link Categorization dashboard (see image below) in Mitch Monsen’s post, Tools for the Ultimate SEO dashboard, I could hear the data screaming to be released from those pie charts.... Read this post By: John Doherty September 23, 2013 Building Your Marketing Funnel with Google Analytics SEO Analytics Have you seen complete marketing funnels, but not been sure where to start building yours? In this post, John Doherty walks us through how to build a rudimentary full marketing funnel, from first touch to conversion, all with Google Analytics data. Read this post M By: Matthew Peters August 15, 2013 A New Analysis of Google SERPs Across Search Volume and Site Type SEO Analytics One of the most common questions about this year's Search Engine Ranking Factors study is whether there are any differences in search results across queries with different search volumes and topic categories. This post dives into the data to find the answer. Read this post C By: Craig Bradford August 12, 2013 Custom Segments to Increase Sales SEO Analytics Implementing Google Analytics is fairly simple, but most people don't take full advantage of what it offers. With custom segments, marketers can divide their audiences into smaller sets of data, learning how best to earn the business of each group. Read this post M By: Matthew Peters July 9, 2013 2013 Search Engine Ranking Factors SEO Analytics The results are in! Come check out Moz's 2013 Ranking Factors as Matt Peters presents a preview of the results from the survey and correlation study. Read this post By: Bojan Jovanović June 13, 2013 How to Track Website Visitors with JavaScript Disabled SEO Analytics According to data released by Yahoo!, around 2% of users in United States search the Internet with JavaScript disabled. This figure may sound small, but if we consider that number of Internet users in the U.S. was almost 240 million in 2010, we realize that we're probably missing out on the opportunity to track millions of potential visitors, and that's just in the U.S.! Read this post M By: Matthew Peters June 12, 2013 Determining Relevance: How Similarity Is Scored SEO Analytics Today's web search engines have sophisticated ways of measuring whether a web page is related to a given query, based on decades of research in Information Retrieval. Join me as I explore the inner workings of a search engine's relevance engine and explain what it means for SEOs. Read this post By: Tim Resnik May 22, 2013 Decoding Google's Referral String (or, how I surviVED Secure Search) SEO Analytics With initiatives like Google Secure Search, Universal Search, and Knowledge Graph, it's becoming increasingly difficult for marketers to figure out how and why they receive Google referrals. It's time to reclaim your data by analyzing the VED paramater to make sense of the black hole (not provided) has left in Google referral traffic. Read this post By: Michael Freeman May 20, 2013 How to Measure ROI for Lead-Gen Websites SEO Analytics Ecommerce sites have it very easy when trying to tie sales information back to online marketing activities whether it be organic, social, email, or paid campaigns. Since the purchase happens online, web analytics packages capture the transaction details and can generate detailed analyses on sales, visitor profitability, visits and days to transactions, etc. Read this post By: Dr. Peter J. Meyers May 2, 2013 How Not to Visualize Your Data SEO Analytics This is an ode to a data visualization I found on my box of tea. It's a perfect reminder of how we sometimes get carried away as marketers, especially as our tools make visualization easier. Read this post By: Alex Johnson April 22, 2013 Using Analytics To Grow Blog Traffic And Improve Your Link Building SEO Analytics Any good blogger with a relatively new blog should already be doing a couple of things. Firstly, you should be writing excellent content (old news I know), and secondly you should be promoting your content and your brand all over the place. What follows is a quick look at how we at ThinkTraffic are growing our blog traffic and also how we are using Analytics to make our efforts more effective. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO Analytics"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on SEO Analytics"
    },
    {
      "level": "H2",
      "text": "How to Track PDF Traffic and Links in Google Analytics and Open Site Explorer"
    },
    {
      "level": "H2",
      "text": "How to Discover New Opportunities with No Keyword Referral Data"
    },
    {
      "level": "H2",
      "text": "Why Visitor Analytics Aren't Enough for Modern Marketers"
    },
    {
      "level": "H2",
      "text": "Inbound Link Categorization Dashboard Redesign"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Building Your Marketing Funnel with Google Analytics"
    },
    {
      "level": "H2",
      "text": "A New Analysis of Google SERPs Across Search Volume and Site Type"
    },
    {
      "level": "H2",
      "text": "Custom Segments to Increase Sales"
    },
    {
      "level": "H2",
      "text": "2013 Search Engine Ranking Factors"
    },
    {
      "level": "H2",
      "text": "How to Track Website Visitors with JavaScript Disabled"
    },
    {
      "level": "H2",
      "text": "Determining Relevance: How Similarity Is Scored"
    },
    {
      "level": "H2",
      "text": "Decoding Google's Referral String (or, how I surviVED Secure Search)"
    },
    {
      "level": "H2",
      "text": "How to Measure ROI for Lead-Gen Websites"
    },
    {
      "level": "H2",
      "text": "How Not to Visualize Your Data"
    },
    {
      "level": "H2",
      "text": "Using Analytics To Grow Blog Traffic And Improve Your Link Building"
    }
  ],
  "author": "Sean Smith\n          \n            Dave Rekuc\n          \n            Rand Fishkin\n          \n            Mynda Treacy\n          \n            John Doherty\n          \n            Matthew Peters\n          \n            Craig Bradford\n          \n            Matthew Peters\n          \n            Bojan Jovanović\n          \n            Matthew Peters\n          \n            Tim Resnik\n          \n            Michael Freeman\n          \n            Dr. Peter J. Meyers\n          \n            Alex Johnson"
}