{
  "url": "https://moz.com/blog/category/seo-analytics/p19",
  "slug": "p19",
  "title": "SEO Analytics - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "Y By: Yotam Tavor October 3, 2011 Funneling Fun with Multi Channel Funnels SEO Analytics Not too long ago Google furnished us with a new reporting tool: Multi-Channel Funnels. The announcement on August 24 was very significant to those of us that cherish every single piece of data available on our traffic, mostly because we know what to do with it. We are able to derive Action Items and tactics based on data, and the more we have, the better we are at doing our... Read this post R By: Rohit Patil September 30, 2011 Creating Goal Funnels in Google Analytics Through Virtual Page Views SEO Analytics Tracking user behavior through Google Analytics can be quite tedious considering the limited path analysis options that GA has to offer. Funnel analysis can be especially prohibitive as you can analyze only one path leading to a given conversion. Calculating drop off rates in this case has its share of issues. Thankfully there is a handy workaround which has been explained in this post. ... Read this post By: John Doherty September 26, 2011 7 Google Analytics Advanced Segments I Love (and you should too) SEO Analytics I love using Advanced Segments in Google Analytics. Sure, you can export a big chunk of data to Excel and then use some Excel wizardry to clean up the data and display it in different ways, but what if you just need to get a quick snapshot of certain traffic or trends, but the default segments don't go far enough? I've put together a few of my favorite Google Analytics Advanced Segments for yo... Read this post By: Dr. Peter J. Meyers September 21, 2011 Correlation vs. Causation (A Mathographic) SEO Analytics Tired of infographics? How about a Mathographic? We dive deep into correlation analysis here on SEOmoz, so I thought it might be a good time to review the basics. Read this post By: Ben Ruedlinger September 8, 2011 WBF's - The Anatomy of a Successful Web Video Series SEO Analytics We’ve been hosting SEOmoz's video for a little over a year now. During that time SEOmoz has published about 60 Whiteboard Fridays. One thing to know about Wistia (in addition to our penchant for ping pong and video SEO) is that we have an unhealthy obsession with video analytics. Read this post By: Jeremy Dearringer August 30, 2011 The Greatest Attribution Ever Graphed SEO Analytics Step-by-Step Instructions for Non-Branded Custom Segmentation in the new Multi-Channel Funnels Section Multi Channel attribution is amazing, to say the least. In the immortal words of Avinash Kaushik, “You will have an orgasm!” If you weren’t there for Mozcon, I’m sorry. Don’t let it happen again, but yo... Read this post By: Sajeet Haridas Nair August 30, 2011 How Google Analytics Custom Reports Helped My Client to Increase His Revenue SEO Analytics I often wonder how the life of an SEO consultant would have been if there was no Google Analytics. I mean, sure in that case a lot of paid tools like Omniture, Webtrends, etc. would have dominated the analytics segment of the online world,... Read this post By: Rob Millard August 28, 2011 An SEO's Guide to RegEx SEO Analytics RegEx is not necessarily as complicated as it first seems. What looks like an assorted mess of random characters can be over facing, but in reality it only takes a little reading to be able to use some basic Regular Expressions in your day to day work. Read this post By: Mike Pantoliano August 21, 2011 Panda 2.4 and Analytics Session Update Rolled Out Simultaneously SEO Analytics On August 12, Google announced that their high-quality sites algorithm, otherwise known as \"Panda\", had been rolled out for all languages save for Korean, Chinese, and Japanese. The change is said to impact 6-9% of users' queries, down from the 12% seen in the initial Panda upda... Read this post By: Firstconversion.com August 5, 2011 Guide to Setting up Advanced Segments in Google Analytics for Complex Brand Names SEO Analytics This is a step by step guide to setting up Brand and Non Brand keyword segments for a complex brand – when you have multiple brand keywords and where your brand keywords mirror your non brand keywords. I have used the example of a client with a number of sub brands to demonstrate. Pay attention to the difference between AND and OR statements in the examples.... Read this post By: James Agate July 18, 2011 Three Awesome Ways to Leverage Google Analytics in eCommerce SEO SEO Analytics I love ROI focused search engine optimisation – the kinds of SEO tactics where you know the end result is going to impact on the bottom line. We are constantly seeking to help our clients leverage Google Analytics in a way that helps them to make more money and create a better user experience through stronger SEO campaigns. Here are three of the ways we do it... Read this post M By: Matthew Peters June 13, 2011 Does Google Use Facebook Shares to Influence Search Rankings? SEO Analytics Does Google use Facebook shares to rank search results? This post examines some recent modeling and attempts to separate correlation from causation. Read this post By: Paddy Moogan June 12, 2011 11 Analytics Metrics That Are Actionable SEO Analytics Last month I spoke at SAScon in the UK on the topic of getting actions from analytics. It's something that I feel quite strongly about so I wanted to write a post on here to talk about it a little and expand upon what I talked about at SAScon.The key question I want to answer is -\"What key metrics should I be tracking?\"I can break the answer down pretty quick... Read this post By: Casey Henry May 16, 2011 Raising the Bar on Data Sharing: Introducing Open Analytics SEO Analytics On the Internet, there is one thing that is as reliable as the gold in Fort Knox: a website's analytics. How many times do you read a great blog post with amazing infographics or just a post that was very well written and wondered how much traffic that site has received from it? At SEOmoz we strive to be transparent about everything we do, but even our traffic data is something that we don't often share Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO Analytics"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on SEO Analytics"
    },
    {
      "level": "H2",
      "text": "Funneling Fun with Multi Channel Funnels"
    },
    {
      "level": "H2",
      "text": "Creating Goal Funnels in Google Analytics Through Virtual Page Views"
    },
    {
      "level": "H2",
      "text": "7 Google Analytics Advanced Segments I Love (and you should too)"
    },
    {
      "level": "H2",
      "text": "Correlation vs. Causation (A Mathographic)"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "WBF's - The Anatomy of a Successful Web Video Series"
    },
    {
      "level": "H2",
      "text": "The Greatest Attribution Ever Graphed"
    },
    {
      "level": "H2",
      "text": "How Google Analytics Custom Reports Helped My Client to Increase His Revenue"
    },
    {
      "level": "H2",
      "text": "An SEO's Guide to RegEx"
    },
    {
      "level": "H2",
      "text": "Panda 2.4 and Analytics Session Update Rolled Out Simultaneously"
    },
    {
      "level": "H2",
      "text": "Guide to Setting up Advanced Segments in Google Analytics for Complex Brand Names"
    },
    {
      "level": "H2",
      "text": "Three Awesome Ways to Leverage Google Analytics in eCommerce SEO"
    },
    {
      "level": "H2",
      "text": "Does Google Use Facebook Shares to Influence Search Rankings?"
    },
    {
      "level": "H2",
      "text": "11 Analytics Metrics That Are Actionable"
    },
    {
      "level": "H2",
      "text": "Raising the Bar on Data Sharing: Introducing Open Analytics"
    }
  ],
  "author": "Yotam Tavor\n          \n            Rohit Patil\n          \n            John Doherty\n          \n            Dr. Peter J. Meyers\n          \n            Ben Ruedlinger\n          \n            Jeremy Dearringer\n          \n            Sajeet Haridas Nair\n          \n            Rob Millard\n          \n            Mike Pantoliano\n          \n            Firstconversion.com\n          \n            James Agate\n          \n            Matthew Peters\n          \n            Paddy Moogan\n          \n            Casey Henry"
}