{
  "url": "https://moz.com/blog/category/seo-analytics/p2",
  "slug": "p2",
  "title": "SEO Analytics - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Brie E Anderson July 17, 2023 Your GA4 Migration: 10 Things You DON’T Want to Miss SEO Tools | SEO Analytics | SEO Reporting GA4 may seem like a monster, but you’re here, so you’re already tackling it! In this article, let Brie take you through 10 things you don’t want to miss in your GA4 migration. Read this post By: Dana DiTomaso May 12, 2023 GA4 Audiences: Not Just for Ads! — Whiteboard Friday Whiteboard Friday | SEO Analytics There are many interesting features in GA4, including Audiences, which many people may only be using for their ads. In this episode of Whiteboard Friday, Dana shows you why Audiences can be useful for reporting on other areas of your marketing efforts as well. Read this post By: Will Critchlow May 5, 2023 How to Create 8 Million SEO Test Ideas Using ChatGPT — Whiteboard Friday Whiteboard Friday | SEO Analytics | AI and SEO As SEOs, we tend to come from an audit mindset, to look for things that are wrong and to try and decide what is the best way of doing things. In today’s episode, Will tries to get you into a testing mindset, and helps you do so by generating test ideas through ChatGPT. Read this post By: Robin Lord March 20, 2023 How to Avoid Duplicate Conversions and Recreating the Conversion Funnel for GA4 SEO Analytics | Advanced SEO In this post, Robin takes you through how to avoid double counting in GA4, how to automatically ignore suspicious conversions, and how to recreate (and improve) the kind of funnels used in Universal Analytics. Read this post By: Dominic Woodman March 17, 2023 You're Measuring Your Branded SERP Wrong – Whiteboard Friday Whiteboard Friday | SEO Analytics | Branding For SEOs, the part of brand experience that we control the most is the SERP, yet traditional ways of measuring brand reach on the SERP often fall short. Today, Dominic talks through an example of how they fall short, and how we can do better. Read this post By: Jess Joyce February 22, 2023 20 Google Analytics Alternatives SEO Analytics | SEO Reporting If you haven’t yet set up GA4 yet, or are on the fence, now is the time to take a look at what else is out there and how the landscape has changed. Read this post By: Dominick Sorrentino February 20, 2023 How to Use Estimated Brand Reach as a Meaningful Marketing Metric SEO Analytics Estimating brand reach is indeed possible. Doing it right demands nuance and a bit of tenacity in your approach, but the rewards are worth it. Read this post By: Will Critchlow February 10, 2023 Lessons Learned from SEO Tests that Didn't \"Win\" – Whiteboard Friday Whiteboard Friday | SEO Analytics We love to talk about winning SEO tests, like those wonderful instances where you run an A/B test and you see positive impact. In today’s episode, though, Will is going to discuss the losing tests: those with negative results — or no results — where you couldn't prove an impact. Read this post By: Tom Capper November 21, 2022 A Different Way of Thinking About Core Updates Search Engines | SEO Analytics | Algorithm Updates Google algorithm updates seem to come in two main flavors. There are very specific updates, like the Page Experience Update, which tend to be announced well in advance, provide detailed information on how the ranking factor will work, and eventually arrive as a slight anti-climax. This post is about the other flavor: the updates announced when they're happening or have already happened with vague guidance. The kind that can have cataclysmic results for affected sites. Read this post By: Tom Capper October 28, 2022 Metrics for Better Keyword Research — Whiteboard Friday Whiteboard Friday | SEO Analytics | Keyword Research In today’s Whiteboard Friday, Tom explains some of the common mistakes SEOs make when doing keyword research that are easy to fix, many of which come from metrics like search volume, click-through rate, and difficulty. Read this post By: Logan Bryant October 19, 2022 Beyond Title Tags: 5 Worthwhile SEO Tests that Seem “Untestworthy” SEO Analytics | On-page SEO SEO includes a vast array of activities where the outcomes of our work are either uncertain or difficult to predict. For this reason, optimizations that seem \"untestworthy\" might actually be worth your while to experiment on. Today, Logan walks you through five of his favorite ones. Read this post By: Robin Lord October 7, 2022 Estimating Search Opportunity — Whiteboard Friday Whiteboard Friday | SEO Analytics | Keyword Research Estimating the opportunities within your various SEO efforts is an important component of your analytics, not only to help determine where to focus your energy, but also to prove the potential value of your work to others. In today’s episode, Robin walks you through a good strategy for this all-important estimative work. Read this post By: Dave Westby October 3, 2022 Uncover Your Most Valuable Keywords with Aira’s New Keyword Opportunity Estimation Sheet Keyword Research | SEO Analytics When you have a list of keywords, it’s often tricky to know where you could potentially rank, what levels of traffic you can earn, and how this relates to conversions and revenue. To help, Dave walks you through Aira’s new Keyword Opportunity Estimation Google Sheet, which tries to answer these questions. Read this post By: Ruth Burr Reedy September 30, 2022 Preparing Your Data Consumers for GA4 — Whiteboard Friday Whiteboard Friday | SEO Analytics In this week’s episode, Ruth Burr Reedy discusses what a lot of marketers may not be thinking about enough: the people besides us who use Analytics data, and what they need to know about Google Analytics 4 in order to continue using Analytics data. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO Analytics"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on SEO Analytics"
    },
    {
      "level": "H2",
      "text": "Your GA4 Migration: 10 Things You DON’T Want to Miss"
    },
    {
      "level": "H2",
      "text": "GA4 Audiences: Not Just for Ads! — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "How to Create 8 Million SEO Test Ideas Using ChatGPT — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "How to Avoid Duplicate Conversions and Recreating the Conversion Funnel for GA4"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "You're Measuring Your Branded SERP Wrong – Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "20 Google Analytics Alternatives"
    },
    {
      "level": "H2",
      "text": "How to Use Estimated Brand Reach as a Meaningful Marketing Metric"
    },
    {
      "level": "H2",
      "text": "Lessons Learned from SEO Tests that Didn't \"Win\" – Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "A Different Way of Thinking About Core Updates"
    },
    {
      "level": "H2",
      "text": "Metrics for Better Keyword Research — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Beyond Title Tags: 5 Worthwhile SEO Tests that Seem “Untestworthy”"
    },
    {
      "level": "H2",
      "text": "Estimating Search Opportunity — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Uncover Your Most Valuable Keywords with Aira’s New Keyword Opportunity Estimation Sheet"
    },
    {
      "level": "H2",
      "text": "Preparing Your Data Consumers for GA4 — Whiteboard Friday"
    }
  ],
  "author": "Brie E Anderson\n          \n            Dana DiTomaso\n          \n            Will Critchlow\n          \n            Robin Lord\n          \n            Dominic Woodman\n          \n            Jess Joyce\n          \n            Dominick Sorrentino\n          \n            Will Critchlow\n          \n            Tom Capper\n          \n            Tom Capper\n          \n            Logan Bryant\n          \n            Robin Lord\n          \n            Dave Westby\n          \n            Ruth Burr Reedy"
}