{
  "url": "https://moz.com/blog/category/seo-analytics/p25",
  "slug": "p25",
  "title": "SEO Analytics - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "V By: Vinny Goldsmith August 4, 2008 Thanks to Batman, I Worry Less About My Bounce Rate SEO Analytics I'm not going to come out and say I predicted it, but I had a hunch the most recent Batman movie (The Dark Knight) was going to be dominant at the box office. And even though there were those that doubted me, it was a pretty safe bet. There were too many card... Read this post By: Rich Page July 23, 2008 Stop Wasting Money on SEM: How To Drive Cheaper, Better Traffic SEO Analytics Pause your SEM spending money immediately. Why? Because there are two things you can do to get your website visitors even cheaper, and then start your spending again. Do these two fairly simple things:1: Optimize Your Site FirstChance are, as you read this, people are visiting your website, and leaving. Never to come back. So you are wasting your SEM eff... Read this post By: Wayne Sleight July 18, 2008 BLVD Status - Track Micro Conversions and Non-Traditional Goals SEO Analytics A while back Rand and Scott put together a white board friday on setting up some extra Java Script to trak non traditional conversions and goals. At the time my brother and I were about 5 mon... Read this post K By: Kate Morris July 1, 2008 Finding Your Broad Match Key Phrases SEO Analytics INTRO: In the most recent Whiteboard Friday, a good friend of mine, Tom Critchlow (I can call you a good friend can't I Tom??), went over some great PPC basic tips. I noticed a lot of people in the comments wanted to hear more about PPC. Well I've been doing the paid side of SEM for a few years (I remember Overture before Ya... Read this post S By: Stuart McIlreavy June 27, 2008 Metrics That the CEO Needs to Know SEO Analytics It's hard to get anyones attention when you are talking about analytics and data. Often I'll go in to a meeting with a really exciting analytics report. When I start speaking about the data CEO will say something like......”Anyyyyyway, moving right along.”And then i’ll say...... “But don’t you want to hear me talking about the data??”Then the CEO says... Read this post By: Danny Dover June 24, 2008 The Evil Side of Google? Exploring Google's User Data Collection SEO Analytics Google Inc. is first and foremost a data company. In the past, it competed on a level playing field by manipulating publicly available data better than its competition. By doing this, it had unprecedented success. Enter Web 2.0. Hard drives, processors, bandwidth and even workers are now all relatively inexpensive. This has caused the barriers to entry in the search field to drastic... Read this post T By: Tom Critchlow June 19, 2008 Analytics Spam - Coming To An Internet Near You! SEO Analytics Before I launch into my inagural moz blog post let me make one thing clear. I'm not a blackhat. We don't do blackhat work for clients and frankly I don't do that much of it in my free time either. Just thought I'd like to clear that up before I launch into talking about the shadier things online.... Again! Read this post S By: SteveWitt25 June 13, 2008 Call Tracking is Missing from the UK SEO Analytics One of the key considerations raised at the recent SMX even in Seattle, was the need to track all conversions, especially those taken from telephone calls. This is a process we have long been pondering, not least because clients are never forthcoming with the information if you ask them. Given that up to 63% of all sales are occurring offline (Jupiter Researc... Read this post J By: jay5r May 19, 2008 Bad Bots Confound Web Analytics By Executing Javascript Tags SEO Analytics As SEOs we've come to rely heavily on analytics packages - it's how we prove our value. We've always been told spiders don't execute Javascript. That means stats based on log files have bot traffic, while stats based on Javascript tagging don't include bots. Some see this ... Read this post S By: Stephen Tallamy April 11, 2008 Analytics with an SEO Timeline SEO Analytics I was using Google Trends the other day and thought \"if only I could have something like this for my analytics\". For those of you who haven't seen a Google Trends report before here is an example: ... Read this post S By: Stuart McIlreavy March 25, 2008 Chicks Don't Dig Analytics, So Don't Toss Out the TV Just Yet SEO Analytics There was a time, can't quite remember when, that I stopped watching TV and started watching web analytics.It may sound sad and most of my friends have not been backward in telling me so.But I see the bright side. The Analytics tickle me pink. I can watch them all day long. As I grow more confident in my passion, Im starting to tell people that they should be doing the same.Let me give you ... Read this post By: Rand Fishkin March 13, 2008 The Holy Grail of Long Tail Information Finally Trackable SEO Analytics This is a feature I've been asking for in analytics packages for the last 2 years: This report lets a search marketer actually visualize the healthiness and distribution of their site's keyword-based search traffic. In the example above, I'm showing the repor... Read this post By: Jeff Tirey March 12, 2008 Web Analytics Now Expands to Include Offline Phone Call Tracking SEO Analytics Web analytics users can now track offline phone calls from within their web analytics package of choice with a new service from Mongoose Metrics. Analytics integration support includes such vendors as Google Analytics, Omniture, ClickTracks, WebTrends, Coremetrics, IndexTools and any other web analytics packag... Read this post J By: Jean Marc Thomas March 3, 2008 How to Improve Your AdWords Campaigns SEO Analytics In the first company, as I started to work with my Adwords campaigns, the only goal there was to get clicks (visitors) as most clients wishes. This was one of the 2 key figures that my boss was watching everyday. The other one was the CTR. If we were under 12%, the campaign was not good enough, and we had to work on the keywords or the ads. As I moved on to some other companies, im... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO Analytics"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on SEO Analytics"
    },
    {
      "level": "H2",
      "text": "Thanks to Batman, I Worry Less About My Bounce Rate"
    },
    {
      "level": "H2",
      "text": "Stop Wasting Money on SEM: How To Drive Cheaper, Better Traffic"
    },
    {
      "level": "H2",
      "text": "BLVD Status - Track Micro Conversions and Non-Traditional Goals"
    },
    {
      "level": "H2",
      "text": "Finding Your Broad Match Key Phrases"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Metrics That the CEO Needs to Know"
    },
    {
      "level": "H2",
      "text": "The Evil Side of Google? Exploring Google's User Data Collection"
    },
    {
      "level": "H2",
      "text": "Analytics Spam - Coming To An Internet Near You!"
    },
    {
      "level": "H2",
      "text": "Call Tracking is Missing from the UK"
    },
    {
      "level": "H2",
      "text": "Bad Bots Confound Web Analytics By Executing Javascript Tags"
    },
    {
      "level": "H2",
      "text": "Analytics with an SEO Timeline"
    },
    {
      "level": "H2",
      "text": "Chicks Don't Dig Analytics, So Don't Toss Out the TV Just Yet"
    },
    {
      "level": "H2",
      "text": "The Holy Grail of Long Tail Information Finally Trackable"
    },
    {
      "level": "H2",
      "text": "Web Analytics Now Expands to Include Offline Phone Call Tracking"
    },
    {
      "level": "H2",
      "text": "How to Improve Your AdWords Campaigns"
    }
  ],
  "author": "Vinny Goldsmith\n          \n            Rich Page\n          \n            Wayne Sleight\n          \n            Kate Morris\n          \n            Stuart McIlreavy\n          \n            Danny Dover\n          \n            Tom Critchlow\n          \n            SteveWitt25\n          \n            jay5r\n          \n            Stephen Tallamy\n          \n            Stuart McIlreavy\n          \n            Rand Fishkin\n          \n            Jeff Tirey\n          \n            Jean Marc Thomas"
}