{
  "url": "https://www.semrush.com/blog/20-seo-experiments-to-get-more-organic-traffic/",
  "slug": "20-seo-experiments-to-get-more-organic-traffic",
  "title": "20+ SEO Experiments to Get More Organic Traffic",
  "description": "Want to get more organic traffic? Here are 20+ SEO experiments you can run on your site with the aim of increasing traffic and CTR—with examples.",
  "content": "20+ SEO Experiments for Increasing Organic TrafficMarketers are no strangers to A/B testing.From user experiences to email and ad copy, it is a crucial part of making sure our activity resonates with our audiences — so much so that 60% believe it is “highly valuable” for conversion rate optimization (CRO).That’s all well and good, but what about SEO?The same principles of improving conversions by testing emails, ads, and UX should apply to increasing organic traffic by testing titles, metas, adding, moving, and removing on page elements.Our research shows that 87% of marketers think SEO is “very important” or “crucial” to their marketing strategy. For 35% of them, proving the value of SEO to leadership is their biggest challenge.SEO split-testing helps assess whether you’re leaving money on the table with your strategy. You’ll get concrete data to feedback to stakeholders—which proves SEO should be a channel they invest in and take seriously.The best part? Almost all (96%) of companies that do run SEO experiments report an increase in traffic. Another 92% see uplifts in click-through rates; over half say new customers come their way.We created this guide to explain why, and illustrate the importance and potential of A/B testing SEO with nine experiments that could help you attract more organic traffic.What is SEO Testing and Why Does it Matter?There are tons of ranking factors you will need to take into account when optimizing your website. Some are off-site or site-wide, such as backlinks, brand reputation, and security.However, search engine crawlers are concerned with the optimization of every single page when it comes to ranking your content. The factors that matter include: The inclusion of keywords in the page’s meta titles and descriptions; The placement of heading tags; The presence of keywords in anchor text; and The Schema markup of a page.With SEO split-testing, you can A/B test each of those elements and more without waiting weeks for search algorithms to feedback the results. It takes three simple steps: Divide a type of templatized page, such as blog posts, product, or category pages, into two groups: Control (which stay the same) and Variant (which the change is implemented on); Make changes to the Variant group; and then Monitor the difference in organic traffic between the two groups.By not running SEO split-testing experiments, websites with 100,000 monthly organic sessions could be missing out on potentially huge step jumps in organic traffic, whilst those with comparatively small amounts could be missing valuable opportunities to grow. A/B testing gives you more control over your SEO activity by allowing you the room to make small, low-risk changes to your website before rolling them out site-wide — and who wouldn’t want that?20+ SEO Split-Testing Experiments to TrySEO split-testing works similarly to other A/B testing practices: you make one change on the website and monitor the response to it. The only difference is that you are monitoring a search engine’s response to the tweaks you have made to your group of Variant pages, and not the users visiting them. It’s why SEO split-testing tracks improvements to metrics like organic traffic, click-through rates (CTR), and organic ranking positions, and not on-page conversion rates.Here are 20+ SEO experiments you can try to identify improvements to be made to your own organic search strategy: Meta Titles Meta Descriptions Heading Tags Image Alt Text Delete Element Move Element Add Element Internal Links Link Anchor Text Schema Markup1. Meta TitlesMeta titles are one of the first things users see in your listings in the search engine results pages (SERPs), so they play an important role in influencing clicks. While it’s not considered a direct ranking factor, Google’s algorithm takes CTR into consideration when evaluating the quality of organic search results, so it follows in theory that better CTRs should contribute to better rankings — meta titles matter here.You can test your own meta titles by monitoring changes in rankings and/or CTRs when you: Add or remove “free shipping”; Add or remove your brand name; Use action words like “buy” or “download”; or Change the character length.Remember: People read these meta titles when deciding between different pieces of content in the SERPs. By testing them on selected product pages in a Variant group, you will be able to see how such changes might affect your CTRs and rankings across your whole site. 2. Meta DescriptionsMeta descriptions appear beneath the meta title and give searchers clarity on what a page covers. They exist to add context and encourage click-throughs, convincing searchers why they should click your results over those of competitors.You can run a variety of SEO experiments on these meta tags, such as adding or removing: Star ratings; Incentives like “free shipping”; and Secondary keywords.Here’s an example of this test in action. One retailer added “new styles just added” to their meta descriptions and saw a consistent uplift in organic traffic:An example of the test in actionThink about how tweaks to your meta descriptions might help them resonate more with potential customers and, in turn, improve your CTRs.3. Heading TagsHeading tags are on-page elements that help Google understand what a page is about. You will have one main H1 for each page, and several H2s or H3s as subheaders to break up your content. These can be tested to help you improve the clarity of your site’s content for search engine crawlers, so they can do a better job of finding the right results for their users. Run split-test experiments with your Control and Variant groups to see whether any of the following changes affect organic traffic: Placement of the title tag; Length of sentences; Use of H2s or H3s for subheadings; and Inclusion of different keywords.4. Image Alt TextSearch engines rely on alt text to interpret images and find suitable results for users.The good news is that you can split-test whether or not Googlebot changes the ranking position of a page or the image in Google Image search based on the changes you make to your alt texts.Some alt text-related SEO experiments include: Using hyphens vs. spacing; Adding or removing characters; and Switching up the use of keywords. 5. Delete ElementSo far, the SEO experiments we have recommended are all related to specific on-page elements like meta titles and image alt texts.However, it is likely that you have elements that aren’t essential to the page itself, but can still be part of your split-testing experiments.You can test whether or not deleting certain elements has a positive or negative impact on search performance, such as: Breadcrumbs; Images; Social media buttons; and Pop-up forms. Let’s put this into practice and say you have the following breadcrumb format on product pages: “Pet > Dog Beds > Small Dog Beds > Betsy Comfy Bolster Blue by Wolf.” You want to test whether Googlebot understands a page better if it has more context on the product via breadcrumbs. So, you run an SEO test that deletes the breadcrumb from the Variant group.The end result? Organic traffic to those Variant pages decreases by 6%. In this case, Googlebot seems to prefer the presence of breadcrumbs, so you can start to think about the effect such an element might have if you implemented it site-wide. 6. Move ElementOf course, you don’t have to remove elements altogether when running SEO experiments.You can test whether or not simply moving certain elements makes a difference to SEO results. This can include: Moving images above or below headings; and Moving content blocks to other locations on the page.Remember: While these changes might impact on-page user behavior metrics, the purpose of SEO split-testing is to monitor Google’s response to a change. You will likely need to work with CRO teams to find the sweet spot, combining SEO and user experience metrics to figure out an optimal page layout.7. Add ElementWould the addition of a new element cause any change to your organic traffic? In some cases, adding an image to a page can result in uplifts in traffic — especially if it gets picked up in image search. An SEO split-test will help you find out.Run SEO experiments to see whether including the following on a page impacts its search traffic: Inserting an image; Including an internal link to another page; or Adding a different content block above the fold.8. Internal LinksInternal links direct people (and search engines) to other relevant pages of your site. They can improve user behavior metrics like bounce rates, time on site, and pages per session — all of which are key indicators of the quality of a site’s content and user experience. You can run A/B tests on these internal links to determine whether or not changes to any of the following improve your SEO performance: A link’s position on the page (such as the navigation bar); The page being linked to; or Shallow vs. deep links.9. Link Anchor TextAnchor text gives search engines a description of the link to which you are pointing. It helps crawlers determine what the page is about, and, therefore, what it should rank for.Yes, but anchor text (and image alt text) helps us quite a bit in understanding context, so I wouldn't leave it out if you can avoid it.— ð John ð (@JohnMu) May 15, 2017You can run split-tests to see how changes to anchor texts might affect things like CTR, time on site, and organic rankings. You might experiment with: Character length; Exact match vs. broad match text; or Format (i.e. does hyperlinking over an image make a difference?).10. Schema MarkupOne glance over Google’s SERP shows that the days of 10 organic listings and nothing more are gone. Now, you will see a range of rich results in the SERP — be that starred reviews, recipe ingredients, or headlines from news stories. All of these are built using Schema markup, which is a way of using structured data to show Google exactly what additional information it can pull from your pages to show users in its search results.In the SERP below, for example, you will see an entire page of rich results taking precedence over the organic listings:Anything that is more useful and eye-catching than organic listings is likely to get more attention. So, you can run SEO experiments to test: Whether Schema markup makes a difference; Different structured data types; and JSON-LD vs. Microdata code.If you see positive results from any Schema split-test, you will be able to start planning a wider roll-out across your site in the hope of achieving similar results, with further tests if necessary to support your decisions.Ready to Start SEO Split-Testing?As you can see, there is a wide range of SEO experiments you can run on your website to find ways to improve your organic performance.The good news? SplitSignal is an SEO split-testing platform that can do the hard work for you when it comes to any of these experiments, and more. It will divide your selected pages into Control and Variant groups, run SEO split-tests with lightweight Javascript code, and report on the results of Google Search Console (GSC) data.There is no risk of significant impact on your Core Web Vitals, and you can enjoy the luxury of making small changes to your SEO strategy without risking your entire site’s organic traffic levels.Quickly uncover which SEO changes might increase your organic traffic by requesting a SplitSignal demo today.",
  "headers": [
    {
      "level": "H1",
      "text": "20+ SEO Experiments to Get More Organic Traffic"
    },
    {
      "level": "H2",
      "text": "20+ SEO Experiments for Increasing Organic Traffic"
    },
    {
      "level": "H2",
      "text": "What is SEO Testing and Why Does it Matter?"
    },
    {
      "level": "H2",
      "text": "20+ SEO Split-Testing Experiments to Try"
    },
    {
      "level": "H3",
      "text": "1. Meta Titles"
    },
    {
      "level": "H3",
      "text": "2. Meta Descriptions"
    },
    {
      "level": "H3",
      "text": "3. Heading Tags"
    },
    {
      "level": "H3",
      "text": "4. Image Alt Text"
    },
    {
      "level": "H3",
      "text": "5. Delete Element"
    },
    {
      "level": "H3",
      "text": "6. Move Element"
    },
    {
      "level": "H3",
      "text": "7. Add Element"
    },
    {
      "level": "H3",
      "text": "8. Internal Links"
    },
    {
      "level": "H3",
      "text": "9. Link Anchor Text"
    },
    {
      "level": "H3",
      "text": "10. Schema Markup"
    },
    {
      "level": "H2",
      "text": "Ready to Start SEO Split-Testing?"
    }
  ],
  "author": ""
}