{
  "url": "https://www.semrush.com/blog/36-experts-share-insights-about-seo-around-europe/",
  "slug": "36-experts-share-insights-about-seo-around-europe",
  "title": "36 Experts Share Insights About SEO Around Europe",
  "description": "37 experts from 23 European states to tell more about SEO market in their country",
  "content": "There’s no doubt that the SEO market in each country is different. Different languages and different stages of economic development is a factor that makes the SEO market in every European country unique. Elena Terenteva's article SEO Around the World inspired me to go deeper into this topic. Going deeper I decided to stay local and to focus on my region – Europe. I asked 36 experts from 21 European states to tell more about SEO market in their country. I personally learned lots of interesting tidbits and advice! Editor Update: New experts from France have been added! International SEO Fun-Facts The main focus in the UK is about generating ROI rather than simply looking at specific rankings. In Denmark, good consultants go by an hourly wage of 150 to 250 dollars. In the Benelux (Belgium, Netherlands & Luxembourg), there are over 100+ dialect languages. Google has historically put a special “spam-eye” on the German SEO-Market because there was a very active SEO-Black-Hat-Scene in the past. Romania is in the top 10 internet speed connection in world wide ranking. The most popular advertising channel in Portugal is still TV. Seznam is a Czech search engine and it is a source of about 37 % organic traffic. The Slovak market is close to the Czech one, so e-shops often launch in both countries. The SEO market in Norway is probably the smallest of all Scandinavian countries. The second most popular search engine in Turkey is... Yandex. Sweden is by far the most competitive of the Scandinavian markets. In Ukraine, Google has 65% of the market and Yandex has 30% of the market. Let’s move on to what the top experts had to say for each region and country! United Kingdom Patrick Langridge – Head of SEO at Screaming Frog I think the SEO industry in the UK is a really exciting place to be right now, with lots developments in skillsets and lots of competition too – both amongst agencies and also within the search results themselves! It feels like there is a real hot bed of talent in the UK, with multiple large SEO conurbations across the country; London, Brighton, Leeds, Manchester, Oxford, to name just a few. This is helping to increase the size of the talent pool of talented marketers, technical SEOs, content writers and PRs too. Certainly that’s what we’re seeing with our agency, that we’re developing more service lines and refining existing ones to meet the needs of our clients, in order to feel more like an extension of their own marketing or digital teams, rather than the stereotypical external agency model. More broadly in UK SEO we’ve seen some big changes from Google that we’re having to adapt to – local SEO especially is a big focus for us, with more and more search results being localised for users. Having worked with clients in the US, Australia and across Europe, the UK feels just as competitive and challenging a market as any other territory. What makes the SEO market unique in the UK is sheer competition in what is a relatively small place! The digital UK market is highly aware of SEO and there is great competition between agencies, freelance consultants and in-house experts to deliver great work. This is exciting because it promotes the highest standards of work, with search professionals all across the UK pushing themselves to learn and adapt quicker than ever. Ian Lloyd - Director of Digital Operations at WMG SEO in the UK is a highly competitive market and barely a week goes by without hearing about a new agency start up. However, the low barriers to entry are significantly offset by the advanced skillsets that ensure an agency’s longevity - many go out of business or fail to expand beyond the spare room. Differentiating yourself is key, as businesses have become more switched on to SEO and its benefits, so you need to be offering them a service that is more comprehensive than ever before. The main focus now is all about generating ROI rather than simply looking at specific rankings. We want clients to stay with us and if we can demonstrate clear ROI from our actions then that’s most of the battle. An agency’s role is to understand the client’s business needs and relate them into a focused SEO strategy. We’ve seen a number of areas of strategy change recently, which include a focus on big creative campaigns becoming more measurable. It’s no longer about creative for creative’s sake, but now the focus is clearly on the objectives around creativity. International rollout is also the order of the day. Many businesses are looking for further growth markets and therefore the demand for international SEO is continuing to increase. Having the depth of knowledge within your agency and, crucially, the head count with the appropriate skill levels is of paramount importance. Things we are seeing which aren’t changing and we see great returns from are the optimisation of websites – the simple things still work very well – and the hard fact that intelligently written content generates traffic. Furthermore, we now see many more companies come to us with their content marketing strategies in place, aiming for a more holistic approach to getting their brand out there Hazel Jarrett – Founder and MD of SEO+ In the UK 89% of online searches are made through Google with Bing a poor second at5% SEO is a competitive industry in the UK, unfortunately, there continues to be many companies that over promise and under deliver and I've been aware, in recent years, that although all sizes of business now understand the value of SEO, many of them are trusting SEO companies considerably less. As a result reputation matters as much as ranking well in Google. Having said that, reputation for most types of business has increased in importance, with over 90% of UK consumers now reading online reviews, trusting them as much as personal recommendations, before deciding whether or not to buy from a company. With the spectacular rise of mobile devices, the way people search and use the internet has evolved significantly in the UK and this has had a huge impact on local businesses. As we know, Google is sophisticated enough to identify a searcher’s location and return search results for local businesses if they think a search has ‘local intent’, this in turn has led to a notable increase in local businesses requesting SEO services. For UK businesses, social media has become mainstream with the majority now engaging with social media in some form. It is widely considered to be a long term part of the marketing mix. Facebook has been and continues to be the most active social media platform. Instagram is now increasing in popularity but has a much younger audience, 39% of its UK users are aged 16-24. Facebook’s 16-24 demographic are just 16% of UK users. Twitter appears to be the latest victim of slightly declining user numbers in the UK. It's thought that Twitter is the most likely victim of Instagram’s success. Pinterest is another relatively new platform and although there are no exact numbers for Pinterest, it claims to have doubled its UK user base in 2015. Denmark Henrik Bondtofte – Bondtofte & Co In Denmark, 95% of search engine traffic comes from Google and we barely look to other search engines. Microsoft’s Bing stands for the rest of the search engine market in Denmark. Bing is mostly used by the elderly in Denmark. Having worked in many markets, I must say that the competition in Denmark is very low compared to other markets. The only Scandinavian market I know of with less competition is Norway. Since Denmark is such a small country, it’s clear that we have advantages as there are fewer companies fighting for positions, however, that also results in less potential visits as we have fewer searchers as well. The Danish market has been very slow to adapt SEO, especially smaller to medium sized companies. In the last two years we have seen quite a turnaround where we clearly notice that even small companies understand the importance of SEO. We have also seen a huge shift in the spend on digital marketing services, especially how SEO and Facebook budgets have risen to new levels. In Denmark, Facebook is by far the superior social media, but Snapchat is gaining momentum. Sadly, the Twitter scene in Denmark isn’t that big; it’s mostly inhabited by techies, politicians and performers. Google+ never really got a hang of the mainstream user in Denmark and to this day Google+ is a flat out ghost town in Denmark. In Denmark, good consultants go by an hourly wage of 150 to 250 dollars. My own hourly wage is 210 US dollars. I know of no serious SEO provider in Denmark that goes below these thresholds. When Danish SEO consultants or companies charge less, it’s usually due to the fact that they have very little experience with the field; for instance by only having a couple of years of experience or less. The most competitive keywords in Denmark resemble many of the same keywords that are competitive in other countries. These include keywords like children’s clothing, loans, insurance, cellular phones, lawyer, etc. More and more people will feel comfortable with SEO and the market will see a rising demand for SEO services. SEO has had quite a bad reputation in Denmark as well as in many other countries. As Google advances and we start to see more and more people being able to relate to the different tasks of SEO, it will become a lot more holistic. Technical SEO can be hard for a lot of people to comprehend and understand, but most people do understand and like the thought that great content and good use of media and user behavior data can be a vital part of an SEO strategy. As Google becomes more “intelligent,” it is easier to sell SEO, as it plays a role in other parts of a company’s marketing mix as well. France Thomas Cubel – SEO Consultant in France In France, the major issues I seen are indexing, duplicate contents, creating lot of contents and backlink properly (like any other country!) Issues with on-page, on-site, and off-site, but the challenge is to convince clients to invest in SEO. France is a beautiful country with a lot of cultures, but we don’t have lot of clients with tons of money to invest for that. We need to improve their understanding and stress the necessity of SEO (and marketing) every time. Personally, I try to make pedagogical explanations with analogies to help clients understand, and when I do this, more understand what I propose and why. In the next few years, I think companies and clients will diversify techniques to attract more traffic and ROI. SEO will become increasingly complex. We already see it today with Information Retrieval, Semantic, box, KG, but also SEA, marketing automation, UX, and more. I foresee that clients will need to invest more money in the future. Today, we could improve a small website for 2500-5000€ if the niche is not hard, but in the future, we’ll need to create more content, backlinks, strategies - essentially, more of everything! Content marketing (video, photo, infography, ebook, games, etc) is a good example. SEO will connect every aspect of a company together because we have increased our skill in multiple areas. By the way, a good thing about the French SEO community and the market is that we aren’t in competition, we are friends generally. We have a limited number of SEO professionals. We eat, drink and sleep together to discuss about SEO and we share techniques. That’s a very cool atmosphere. I send clients to competitors and the community will send to me clients too. It's a win-win! If you're interested in expanding your knowledge, we also have lot of conferences and community meetups that we use to help us. Our community is open and willing to help those looking to increase their knowledge. To me, it seems that we have techniques that others country (including the USA) doesn’t already have. Benjamin Thiers – Head of Content Marketing at Digimood Today, in France, there are still many types of SEO professionals such as freelancers, SEO companies, and web agencies, and they are all very different from each other including the services they provide. As a general rule, the quality of their offered services is constantly adapting to Google's constantly improving its algorithm. The way we do SEO has to evolve with the algorithm’s evolution. No mistake is allowed! Only professional SEO experts can survive and thrive in such an environment. It is important that these experts can share their experiences and knowledge. In France, many SEO professionals are members of the SEO Camp, an association that was created in 2008 and a variety of the events organized across France are run by them. They host after work get-togethers, private or public meetings, conferences, dinners and more. Promoting digital business in France was the French Tech goal. And it worked. The emulation it has created among the web experts has also had a positive impact on SEO. What about the role of school and training SEO wise? Its the best way for French SEO to continue growing. A university degree dedicated to SEO and web content was recently created in Mulhouse. The Aix Marseille University also offers a good SEO training with its M@ntic course. Despite all the efforts that are made to make French SEO more widespread, I must say that our clients often lack SEO culture and I deplore that. Sometimes, we have the same problem when we work with web developers. Every month, worried companies call Digimood because they have lost positions on Google after their website makeover. We also received some unbelievable requests from prospects who expect to reach the first position on a highly competitive keyword in a few weeks only, with a small website and no budget. I think we definitely have to focus on two main goals in the next few years, andwhen I say “we”, I mean SEO professionals. First of all, we have to educate our clients. I am in favor of the transfer of skills and knowledge. If our client understands SEO and its issues, he can then become a very profitable partner to us. We believe that our value lies in our experience and strategic vision more than on secret tips we would like to keep for ourselves. That’s why we are happy to share our experience with our clients. To defend this point of view, I have even written a book with Julien Ringard : « Ce que Google Veut » (in French), meaning « What Google wants ». Secondly, we have to think about SEO as a part of a global digital strategy. We have to reach the first results on the SERP, but we can’t sacrifice topics such as content marketing or UX. The days when we created doorway pages or didn’t integrate the user satisfaction to a SEO strategy are gone. We must take part in the creation of our clients’ digital strategy. What Google wants is (most of the time) what the user wants. Never forget this. Nathalie d’Abbadie – SEO team leader at Eskimoz and author of the blog The Natterbox Google represented 94% of Internet searches in France in 2016. However, many SEO consultants still find it difficult to convince potential clients of the importance of SEO. Google is by far the first customer acquisition channel but SEO is often neglected, even by big corporations. Because of this, SEO is frequently part of a company’s communication budget and the average price of a day’s work on SEO in France is lower than in other countries. Furthermore, clients often have difficulty waiting a few months for notable results: many expect miracles overnight! However, we are slowly moving forward in terms of market recognition and therefore, overall understanding of SEO – as well as the wish to comprehend how Google works - is on the rise. This slightly slow start hasn’t prevented France from developing many powerful tools to improve online visibility! Yooda Insight, Ranks Explorer, SEO Observer and On Crawl are all highly useful solutions developed in France, as well as Qwant, a French alternative search engine. There are also many well-known French SEO specialists such as Olivier Andrieu, the author of several excellent books on Google and SEO, or Kevin Richard, the founder of SEO Observer. Furthermore, there is a highly active community of consultants on Twitter, Facebook and even Skype who share ideas of new techniques to try or websites that are open to linkbuilding. This is all the more impressive that there are still relatively few university courses that teach modern-day SEO in France. Many competent consultants acquire their knowledge on the job and not necessarily during their studies. White Hat agencies are fairly rare in France as Black Hat is alive and well. The use of pre-Penguin techniques is a surprising but very real phenomenon in our country. Victims of Penguin penalties are often forced to disallow thousands of links and restart the linkbuilding process completely. In short, SEO is a growing market in France, and it's a very interesting area to work in! Germany Olaf Kopp – Co-Founder & Head Of SEO at Aufgesang Inbound Marketing I think Germany is next to the US and UK as the most competitive SEM & SEO markets in the world. Google has historically put a special “spam-eye” on the German SEO-Market because there was a very active SEO black-hat scene in the past. In 2014, a lot of link-networks were penalized and several networks from Germany were first. But this black-hat stuff belongs to history now. Internationally respected SEOs like Marcus Tober, Marcus Tandler or Andre Alpar come from Germany, and some of the leading software engineering companies for SEO tools like Searchmetrics or onpage.org were founded in Germany. The German SEO-industry is internationally described as being analysis driven, having a sense of community and being fast moving. We got several big online marketing events started originally as pure SEO events, or founded by SEOs several years ago, like SMX (Munich), SEOCampixx (Berlin), OMCap (Berlin) and SEOday (Cologne). But the trend at the moment is toward more regional and smaller events. In the agency landscape of the last two years, we recognize several joint ventures and consolidations of agencies of different stages of the value creation chain. Especially between former SEO agencies with CRO agencies, PPC agencies, marketing agencies or communication agencies.But it is obvious that it is very difficult to conquer the cultural borders especially between online marketing and marketing or communication agencies. To speak from our own experience, it can take ages to create integrated structures and processes for joining different mind sets and workflows. In 2012, we joined together an AdWords/SEO agency with a PR agency to form the Aufgesang Agency Group. When you speak of German search engines, Google leads with 94% Market share; but also, more and more Amazon is being used for product searches. I think Amazon, more than Facebook, will be the most dangerous competitor to Google in the future. At the moment, we are recognizing a shift to alternative search systems beside Google because of the changing appearance of the SERPs for the benefit of the AdWords ads and the missing possibilities to influence the rankings in a quick and tactical or technical manner. Matthias Hotz – Senior SEO Systems Consultant & Architekt at One Advertising AG The SEO market in Germany is still growing. Many big companies are aware of SEO and what it can do for them. Small and mid sized companies are becoming more aware of it and there is a significant growth in this market. Those that do a big share of their business online have inhouse SEO people or a complete department which handles SEO strategies. Most of them work together with SEO agencies when it comes to technical SEO or content generation. The knowledge of the clients varies. There are many well educated inhouse SEOs that know their job pretty well, and on the other side, you see still people that are working in this sector but have no clue what to do to achieve good rankings. This comes with a lack of SEO specialists at the moment. Many companies are searching for staff in the SEO sector. As an SEO manager or technical SEO specialist, you can choose your employer from a bunch of good companies. Surprisingly, most of the customers expect no miracles from you in terms of ranking success. They know that SEO takes time and there will be little progress in the first months. They accept it as long as they can see general progress. I guess it’s still a good time in Germany to start a SEO company. I know a handful that started as a one man show 2-3 years ago and have since grown in teams of up to 20 persons. Another problem is that there is no quality measurement for SEO agencies, so you rely heavily on recommendations or references. There are still a number of companies that do a bad job for their customers. But it’s getting better. Most German SEO agencies serve only German speaking countries (Austria, Switzerland, Germany). At the moment, there seems to be no need to expand to other European countries because the market is big enough and could still absorb more people doing SEO. We have many good SEO conferences in Germany like the SMX in Munich, SEO Campixx in Berlin and the SEO Day in Cologne. Most of them are sold out very quickly and have excellent speakers attending. In larger cities, you can find weekly or monthly SEO meetings in bars where you can talk with the local SEOs. Italy Giuseppe Pastore – SEO Consultant SEO in Italy is growing as an industry thanks to a bigger interest from companies willing to increase their organic visibility and get the most from people shifting from offline to online purchases, and this obviously makes happy SEOs. It’s always been true, in the last years, that digital marketing was increasing its budgets’ share in respect to traditional medias, but most of that money was going to paid advertising (display and PPC). SEO was strategic goal for fewer companies, and this has led to fewer professionals (comparing Italy to UK or Germany) and a less competitive market. I’ve observed a trend of growth in many aspects: you can spot more job positions available not only in agencies but also in-house (something very rare in the past), more and more little agencies and freelancers are trying to get clients from bigger ones, and there’s a increase of affiliated websites in SERPs that is a clear side effect of people approaching SEO for their own purposes. As an industry, I can say most of us know each other quite well if we look at the seasoned SEOs, and like in other countries you have big dogs leaving the scene (but still attracting big clients and banking their competencies) and newcomers trying to get exposure and recognition. In my opinion, new people always help to raise the bar, bringing new ideas, talent and approaches, so I welcome anyone joining the club and helping this industry to grow in numbers and in consideration from companies. Coming to events, sadly we have lost SMX Milan this year. That has been a big event in 2013-2015. I’ve spoke at the last edition and the level was quite good even if the conference was aimed to engage also people new to SEO. Anyway, we still have our most important event, Search Marketing Connect (previously Convegno GT), organized by good friends of mine, Giorgio Taverniti and Andrea Pernici, which has existed since 2005 and represents the highest moment for Italian SEOs, with really deep speeches, and also international speakers in the last years. I’ve spoken there since 2015, and it’s been great feeling people interested and enthusiastic. We also have a bunch of other (some big and some little) events, and for the lucky ones living in Milan like me we have periodical informal aperitifs organized by Enrico Altavilla, who is in my opinion one of better SEOs in the world (even if he doesn’t like showing off). To conclude, I can’t that wish this industry to rock the stage more and more, every day. Italian SEO’s are cool. Romania Mihai Vinatoru – Co-Founder & Ceo at Digital Workforce The search market is dominated by Google and for most people the search engine is their homepage, both on desktop and mobile devices. With an estimated number of 17,000 online shops and 10+ million people using the internet every day, Romania is one of the most active and dynamic markets in the region. From an SEO perspective, we have huge competition between online players, all of them aiming to get the top ranks in Google. Most of them are still using old benchmarks, such as “top 3 in Google for those 10 keywords,” but more and more of them are understanding the concept of SEO visibility and the fact that essentially you have to be as visible as possible for a much larger array of relevant keywords without actually optimizing for each and every one of them in particular. The SEO service providers market in Romania is still fragmented, with only 3-5 players that exclusively provideSEO services. Most of the agencies in our country try to offer integrated services (combinations of SEO, PPC, social media or even web development). There is also a large number of freelancers that try to provide SEO services but can't afford the tools or have the connections with big publishers for native advertising. The big brands generally choose to work with a specialised SEO agency. Adrian Ficker – Trainer Online Marketing at LeonPaul Media 97% of searches from Romania are made through Google’s search engine. We have 883,142 domains registered in Romania and about 8.8 million internet users. That doesn't mean that all this is SEO subject matter. But it gives us a sense of dimension of our SEO opportunities. Also, more than 80% of people research subject matter on Google before making a purchase, regardless of whether the purchase is made online or at an offline location like a specialized store. We have 16 million mobile 3G+ and 4G internet connections. So, responsive design is a very important factor in the Romanian SEO market. Romania has very good internet network speeds, and most of the internet users from our country have access to top speed internet connections. Worldwide, the country of Romania ranks in the top 10 for internet speed connection. We have about 200 companies offering SEO services, from which the top 30 have some real long experience in SEO algorithms. To this 200, we can also add the individual experts. Regarding SEO practices, I can say that not all of the algorithm releases in the US have been fully implemented on Google Romania. We can see a lot of specialized niches where the client has more than one domain in the first page of results with cloned sites. This being a monopolistic tactic that still works. Also, another big issue is the link-building strategies that had been used in the past and are also still usedtoday. I am referring to link-building tactics on farm sites and on subdomains with C-Class IPs like Blogspot or WordPress. We also have SEO companies that manage outsourcing for content and links, with a very small sense of Google algorithm reality. Here, I’ve encountered bloggers with more than 10 domains hosted on the same IP. I still encounter weekly potential SEO clients who are thinking that SEO is cheap and the only way of getting good traffic. From an AdWords and Facebook expert, I can say that SEO is not the best way to invest your total annual marketing budget. In conclusion, in Romania we have quite a good and challenging market. Although, we are behind with the education of entrepreneurs who don't understand what SEO is and how can it can be used for their businesses. Spain Laura Congosto – Online Marketing Manager en Anoop Systems In Spain, we use the same search engines as the rest of the world. Google is by far the leader in the sector, although they are not as strong as they used to be since Baidu is developing really fast after the Chinese market boomed. In regards to social media, users are increasing day by day. Facebook is the most used social network in Spain, followed by Youtube (which also stands as the leader in reputation) and Twitter. LinkedIn, Instagram and Twitter are the social networks that grew up more. SEO in Spain is still growing. Now, some clients from different sectors start getting involved and collaborate in a more passionate way in order to achieve success in their SEO strategy, although there is still a big path to walk through and many sectors are not working in their SEO yet. Search engine technology is moving forward so fast that being up-to-date is a very hard task. Being able to transfer the recent knowledge and changes to clients, who are not literate about SEO, and the difficulty of measuring the results obtained place our work constantly under a question mark. Hardly 35% of companies in Spain prepare strategies about SEO. And the ones that decide to prepare them pay a monthly fee. Alvaro Muñoz González – SEO/SEM en YoSEOMarketing at YoSEOMarketing SEO in Spain is still in the expansion phase. The number of new professionals is increasing each month. There are still many companies and professionals that offer SEO at a very cheap price and really add a null service to its customers. It’s clear that there is every customer and budget right SEO service. Not everyone needs the same or can invest the same. Each customer needs a different service and price. Each time the SEO covers more fields of marketing online, fully trained to give good service, content, social networking, web design... in the end it affects organic positioning as necessary. Nevertheless, 40% of Spanish companies who have a good SEO strategy seated within their marketing mix, have a long way to go and margin improvement is high both for companies and for all professionals who are dedicated to this. In the future, I think many companies will offer SEO services with extreme professionalism and specialization in the sector. Companies will be increasingly formed in digital marketing and not fall into false promises for 100 € per month. SEO is a job that not only requires technical expertise but also a lot of dedication. In a few years, there will only be externally true experts in the field and most companies have included some position in the organization working organic positioning from a strategic perspective. The SEO normally paid by monthly payment is a service to track and work permanently. Also included are bonus objectives. 4.Se is very aware of the importance of organic positioning, but there is still a long way to go in Spain. But the day in which all companies will have a professional SEO is coming. The internet is becoming an accessible channel for all audiences. It is much cheaper than traditional media like television. SEO is a channel increasingly used to reach potential customers. The investment is divided between SEO and SEM regarding the digital marketing budget. If you need short-term results you'll invest in SEM and if you want stable and long-term results you will be investing in SEO. If a company has available liquidity, these can be combined perfectly. Portugal Nuno Hipólito – Director at Resolution The major issues that SEO companies or, more broadly, companies that do SEO in Portugal face is still one of awareness. Most brands don’t yet acknowledge that they have an SEO problem and are more focused on the design of their online properties or in UX issues, and most of the time completely ignore the need to optimize their content for search engines. With the rise of content marketing, this has become a larger problem, because most new content that brands are producing (sometimes at very large costs) is not being found and gets lost as background noise, hampering the success of these kinds of initiatives. I think content marketing is a perfect way to educate brands on the value of SEO techniques, simply because it’s a simple and cheap way to get the most of their investment. You can have the best content in the world, but if only a few people see it, what’s the point? We are beginning to see heavy investments in content and in the next 3-5 years content producers will surely invest also in SEO in order to maximize returns. Classic SEO – where you optimize a site or a landing page for instance – will probably follow suite and get better awareness. There are two models. Freelancers usually get paid hourly and their rates can vary tremendously, since our market is very small. Since bigger clients usually work with agencies, those projects can be budgeted taking into consideration not only man-hours but also the type of content being optimized. In an agency framework, the budget varies according to the size of the project but an average sized site can be optimized for around 2 to 3 thousand euros, including all SEO tasks such as link building. As to educating customers, that is always half the work of selling an SEO project. The evangelizing occurs before and during the project and we always need to stress that results come with time, never before the first 3 months and most frequently only after 6 months. In our agency, we make sure to stress this very early on to control expectations and deliver exactly what we can promise to deliver in that timeframe. We never do a project that lasts for less than 6 months for this exact reason — so we don’t get discredited by a client suspicious of our work. The Portuguese market is fairly competitive, but not yet saturated, especially at the large-sized client base. We have a lot of freelancers but not that many professionals in agencies. The most popular advertising channel in Portugal is still TV. Our market is small and prices are comparatively competitive when considering other European countries. Digital follows suite and is increasing year over year. Organic strategies, such as SEO, still lag behind paid strategies, such as Adwords or Facebook Ads, since they are seen as too complex and specialized.SEOs usually trade “secrets” in Facebook forums or directly when they meet up personally. I’m not aware of any SEO conferences yet in Portugal. Again, we're in a small market. Inês Santos – Market Manager at Emailbidding In Portugal, the SEO has a long way to go — simple as that! Regarding this topic, imagine that you have a big cake. Okay, now slice it into 3 different sized pieces where big corporations are the thinnest, startups get a middle sized piece and traditional small to medium sized companies grab the biggest slice. Now that you have in mind the Portuguese business panorama, let's focus on startups and the small/medium companies. The first ones have a profound knowledge about what is SEO and the business impact of a good SEO strategy but they simply don't have time nor money to invest in it. The risk is too high in such an early stage for them. The big problem regarding this topic is it is the biggest slice of the cake - de SME’s - for them, backlinks, domain authority and page rank are completely new topics under the table and panda, penguin or colibri are just animals. So, first things first. “EDUCATE, EDUCATE and educate a bit more” are the first 3 steps on a digital marketing strategy for these businesses. When finally you attract their attention to the problem, you face the second problem and, note that 90% of the time this occurred to me during my presentation meetings, they asked me this: \"OK Inês, this is what we need now, but how much will this cost? Will it be expensive? You know that we are in a financial crisis!\" and here starts another and the real problem for them. As a marketer, this could be a big challenge! From my experience, loads of negotiations end up here because in order for most of these businesses to begin a real good SEO strategy they need to start over from scratch with a new website development, SEO audits, and then implement the SEO techniques to achieve the proposed objectives. Summing it up, SEO in Portugal is a kind of hot spot where only the brave ones will survive. In Portugal, it’s much easier to sell paid media where you could offer almost instant results with Google Adwords, Email marketing or Facebook ads. Definitely, these are the most popular advertising channels and normally the Portuguese entrepreneurs feel more comfortable on starting their digital strategy here. So, in order for it to be possible to change this scenario, it will be great to have more meetups and seminars where the experts could talk about SEO and its great relevance on businesses and brands. Czech Republic Marie Štouračová – SEO Consultant at RobertNemec.com In the Czech Republic, we have two major search engines — Google and Seznam. Seznam is a Czech search engine and a source of about 37% of organic traffic (according to research conducted in 2014). The amount of Seznam traffic differs depending on a website topic. Bing has a very small share there — in our experience it is about 1-5% of organic traffic. There are some differences between Google and Seznam, so we sometimes are forced to have a dual approach with SEO . Generally Seznam is inspired by Google; they do their best to develop it to be better, especially lately. Compared with Google, Seznam doesn’t understand the exact meaning of some composite longer search queries as well, it can’t personalize search results, the use of geolocation is just at the beginning and the crawling technologies can’t crawl JavaScript very well, so there it’s more important to keep an internal links easily accessible. There are a lot of differences. One recent example: Google prefers HTTPS protocol websites so a lot of people wanted to redirect their pages from HTTP to HTTPS. That was a serious problem for Seznam – it could not handle a redirection as well and there was a huge problem with its indexation of HTTPS pages. People from Seznam have fixed this in spring 2016. But it is natural that Seznam doesn’t have as good a technical process and functionalities as Google does. Seznam is Czech localized only — Google is global — they have incomparable capital funding. In the Czech republic, there are a few well known SEO experts and agencies. We know each other and meet each other at some events, such as a conference SEO restart (which is the only conference focused just on SEO in the Czech Republic). But we also have a larger international conference, Marketing Festival, focused on digital marketing and strategies in general. People from all over Europe visit it and speakers there are specialists from all over the world. A monthly salary for a SEO Consultant position in the Czech Republic is on average from 724 USD to 1,509 USD, based on experience. The average monthly salary in the Czech Republic is about 1,075 USD. There is a trend that individual specialists become more focused just on one channel or one marketing discipline and they try to be the best just in that. In the past, it was common that one person could do more things. But in the case of agencies it is the opposite. In the past, there were some SEO agencies but now agencies try to manage marketing completely and employ various specialists. In conclusion, here are some things about our clients in the Czech Republic: In my experience, people from larger companies know important things about SEO pretty well and don’t expect they will be on the first position on some competitive keyword in one month. People from smaller companies sometimes have unrealistic expectations. It is not the rule of course, but in my opinion there is some correlation about expectations, knowledge of digital marketing and a company’s size. But it also depends on a business topic. Either way, we always educate our clients about the whole process and all the factors. We want our clients to understand it and keep them informed. The Netherlands Gregory Liénard – Owner of Ipower As a Belgian internet service provider, @iPower has always closely followed-up on new developments. Nowadays, we obviously focus on SEO which in Europe is concentrated basically on the organic search results in Google. We have a small share of German, British, American, Canadian and even more exotic customers, but Dutch (55%), Belgian (30%) and French (10%) customers are our main target audience for the moment. Our experience: SEO is hardly developed in France, is slowly growing in Belgium and is rapidly becoming the most important digital marketing feature in the Netherlands.Well optimized content is still the basis for any good SEO effort: optimized landing pages for specific keywords work best in our experience. Of course, for maximum conversion they have to be optimized not only for Google and other search engines, but also for human visitors. But writing them is tough, and even when a landing page is optimized to the max, Google generally puts it in ‘the best class of the school,’ together with some thirty or forty other ‘pupils’ top 30 or 40, depending on the competition. To reach the first page – top 10 – even an optimized landing page needs external support — links from other, relevant and high quality webpages. The problem is there is no way one can precisely predict any results any SEO action will generate. These will only be apparent by actually making the effort. There is quite a lot of distrust among Dutch and Belgian companies who have had bad experiences with SEO agencies who promise a lot to close long-term contracts but afterwards deliver relatively few results. We are trying to counter this by allowing customers, potential customers and basically everyone who wants to optimize their website/webpages to use our own analysis program, SeoPageOptimizer.com, for writing optimized content free of charge, for one analysis per day. Potential customers can ‘test drive’ our linkbuilding service, Keyboost.com, for one keyword per website/webshop, also free of charge. If they like the results, they can activate their account for that one keyword, or request an analysis to determine for which other keywords their website can reach higher rankings. Additional trust is built up by working with short-term contracts (three months to achieve the maximum possible positions, terminable online after that period).SEO is large but hasn’t reached its full potential in the Netherlands yet. It’s still growing in Belgium and is only starting in France. It’s also a continuing process: Google algorithms develop, social media interfere, new technologies emerge… For companies, outsourcing SEO completely will most likely prove to not be the best approach. A close and efficient cooperation with a strong SEO agency, but with a strong own input, is definitely the way to go. Steven van Vessum - Chief Customer Officer at ContentKing For such a small country, the Netherlands has a huge amount of digital marketing agencies. We literally have tens of thousands (which is a lot for a country with 17 million people.) The market is very fragmented, although there is about 50 top agencies that dominate the market. The big brands work with those agencies, and they also work with some freelance SEO consultants that have worked at these top agencies previously. Smaller, less well-known agencies usually charge at least € 75. The top agencies at least € 100, but often € 150. In the Netherlands, we've always been taught that we need to be flexible in terms of learning other languages and understanding other cultures. Simply because the Netherlands is such a small country, and so few people speak Dutch. We're quite comfortable moving into other markets such as Belgium, Germany, France, United Kingdom, Italy and Spain. The agencies don't necessarily do this because bringing on clients for agencies heavily relies on real life meetings, but web shops often move beyond the borders of the Netherlands. And then the agencies follow, helping their client to be there successful as well. Some agencies even made this their specialisation and set up offices in those countries. Over the years, I've seen a trend in the way agencies work together with their clients. In the past, clients and agencies thought it would be possible to outsource this thing called SEO. We lived in a different SEO world back then, and it worked well for a while (\"SEO landingpages FTW\"). As search engines evolved (think: Panda and Penguin updates) and the agency market become more mature, this stopped working. You had to create meaningful content. That would, theoretically, attract links organically. A close cooperation between agencies and clients was the way to go. They started producing content together, agencies would train in-house staff, spend time in their client's office physically and so on. It takes two to tango, but it took the Dutch agency industry a while to figure that out. An interesting thing about the Dutch SEO market is that for a long time everyone obsessed about link directories. The one that's best known is called Startpagina.nl. Once search engines became more and more known to the public, there was a big shift of users who stopped using linkdirectories and started using search engines instead. Still, until this day linkdirectory Startpagina.nl claims to have 1.000.000 visitors a day. I guess we have a hard time saying goodbye to our old habits! Norway Slavisa Gacic – GM & Co-founder at Nettrafikk AS Norwegians perform about 20 million web search queries on a daily basis. 90-95% of these queries are entered into Google and Google’s affiliated services. Bing is the 2nd largest search engine, followed by Yahoo and kvasir.no. Bing, being the default search engine of Internet Explorer and Safari, is mostly used by the older part of the population. This does not include searches in rubric pages, yellow pages and newspapers/other websites with search functionality. As with most countries, SEO started up in Norway using what we classify today as black-hat techniques. This has been an issue for some years, but it would seem that this old way of thinking about SEO is mostly behind us now. Hummingbird, Panda and Penguin updates the last few years have influenced the Norwegian market in a very positive way when it comes to SEO’s value. RankBrain and machine learning/artificial intelligence have not influenced the Norwegian SERP as much as they have in other countries, but we are moving towards a market where RankBrain and AI will influence visibility more and more. The marketing budgets have moved more towards digital, with SEO becoming a natural part of digital marketing. Even old-school marketers have begun to focus more on digital marketing and SEO, and the biggest ad agencies have divisions that focus on digital advertising and optimization. The companies in Norway either pay for a pre-project, like an SEO analysis or have a retainer. The hourly rate of a good senior SEO consultant is from 140 to 250 euros. Expectations Towards SEO and Degree of Knowledge Google’s updates lately have led to more informed clients with more reasonable expectations. Most of them are aware that SEO isn’t an overnight solution, although some clients still ask for results within a few weeks. Norwegian SEO Markets vs. the Rest of Scandinavia The SEO market in Norway is probably the smallest of all Scandinavian countries and there are only a few serious SEO businesses. However, the demand for SEO-competence is growing and more companies are taking steps towards working professionally with SEO. SEO Popularity and Share of Marketing Budgets in Norway SEO still has some leftover baggage from the early days and there are still many companies that haven’t fully embraced its potential, but it has become more of an ”everyday item” within marketing and more companies are adding SEO to their marketing budget every year. If we divide marketing budgets into analogue and digital, the digital part of the marketing budget is increasing each year. Both SMB and larger clients might add SEO to their marketing budget, but it depends a lot on whether they are in touch with an agency that includes SEO or not. Five to six years ago, the split would be something like 85% on TV, radio and other traditional marketing activities and 15% on digital activities. In the past two years, there has been a big shift and the split is now around 60% traditional and 40% digital. Overall, SEO is becoming more popular and is included in more marketing budgets than ever before. The SEO Business The number of SEO experts in Norway is hard to pinpoint, mostly because the degree of SEO knowledge is hard to accurately describe when it comes to in-house competence. In the industry there are at most 50-100 people who can rightly call themselves SEO experts, but there are several more if you count people with some knowledge of SEO (focusing on areas within SEO, such as content, front-end, java, conversion, blogging, and such). There have been attempts to gather representatives from the industry, but to my knowledge there has only been one attempt to gather SEO consultants in particular. This informal meeting resulted in about 40 attendees. More representatives appeared during a ”Social Media Days” event, a ”Performance Conference,” and other events that usually mix social media, SEO, design, and digital media. A Facebook group called “SEO og organisk synlighet i Norge” aims to gather all SEO experts and affiliates in one public group. Poland Wojciech Szymański – Head of marketing at Ideo Sp. z o.o. Companies in Poland are aware of the need to promote in search engines. Positioning is a complex service dealing with promotion of the website on the selected keywords to reach top placements in the search engine. SEO is an important element in the company internet strategy. This is one of the most effective forms of user-friendly e-promotion because internet users use search engines as a primary tool for collecting information and reaching out to other websites. In Poland we know, that if you want your website to display high positions in search engine results it must be effectively optimized, so that it is friendly for search engine, and at the same time friendly for Internet users. The most popular search engine in Poland is Google which hosts about 95% of all queries. We notice that Google pays more and more attention to the optimization of users and content on the page. The published content must be unique and mustn’t be duplicated from other websites. After changes in the Google's algorithm many sites in Poland lost their positions. The major issues that SEO companies in Poland have are very large number of pages of poor quality, i.e. with a small amount of content or a small usability, which positioning is not possible. In Poland it can be seen that a lot of companies are using Black Hat SEO. This also influences the negative opinion about the Polish SEO market. I think that within the next few years, Google will introduce a lot of new security features that restrict Black Hat SEO in Poland and in the world. What's more, clients of SEO companies will not be required only to reach links and code optimization, but also content delivery. Clients pay for SEO in Poland in two ways. The first way is Pay for Performance SEO. It means you only pay for results, nothing else. The second way is fixed fee, which depends on how long the SEO company spends on work for the customer. We have been positioning over 300 websites now. 70% of the phrases we’re working on are in the top 10 within the first year, and the next 20% within the next 2 years. In Poland there are a lot of companies selling similar products or services. Sometimes we meet at conferences or informal meetings. The agency also we took part in the prestigious Partners program Rising Stars, which was attended by 30 fastest growing e-marketing agency in Poland. Mateusz Rzetecki – Senior SEO Specialist at Bluerank When I think about SEO in Poland, the first thing that comes to my mind is Google. Currently, Google has 97-98% of the market so usually we don’t conduct activities on Bing or other search engines. I have to say that SEO industry in Poland has changed significantly in recent years. Just a few years ago, even the biggest players in the market have used black hat SEO methods. In 2012, Google punished many companies e.g banks, price comparison sites, and e-commerce websites for unnatural links which had a significant impact on the present industry. I think that Google considered our market as one of the most spammed in Europe. In recent years, we had a lot of actions undertaken by Google webspam team targeting link exchange systems. Today, SEO in Poland is totally different. It is oriented on high quality white hat actions and content marketing. Many companies appreciate this approach, as evidenced by the growing number of our clients. The fact that our campaigns (last ESA in BEST USE OF CONTENT MARKETING) are appreciated by specialists from across Europe shows that SEO and Content Marketing in Poland are at a very high level. What is important is the fact that more and more customers are becoming aware of SEO and how it can affect their business. They begin to realize the complexity of SEO activities and are able to allocate adequate budgets for it. What 's more , the whole SEO industry began to move away from payment only for results, which was very popular few years ago, to flat fee plus bonus for effects. This is definitely the best solution for both the agency and the client. Therefore, I think it is an ideal market for agencies and freelancers who work in this field. When it comes to competitiveness our market is one of the most ambitious in Europe. I know several foreign markets and none of them is as competitive as Poland. This means that every day you have to improve your skills. Belgium Rod Davies – SEO & Adwords Expert at Promote SEO I think the SEO & SEM industries in Belgium are going through a very exciting growth period. We work in both the Netherlands and Belgium and have seen trends in both countries change for the better.When we started working in the Netherlands & Belgium the power of SEO & SEM was barely known. Belgium as a country still relies heavily on word of mouth marketing for small/medium businesses. In saying that we are seeing a dramatic move away from the previous offline marketing tactics to online.It's still early years for SEO & SEM development here compared to the USA, UK And Australian markets. The talent pool here in SEO is not high compared to foreign markets and for good reason. Working in the Netherlands and Belgium is a difficult task to do correctly.Take for example the issue of a large number of languages and dialects to optimise for. In the Benelux (Belgium, Netherlands & Luxemburg) their are over 100+ dialect languages. In addition to this Belgium also has three \"official\" languages. French, German and Dutch. The Dutch language in Belgium is different then that of the Netherlands & so is their version of French. When optimising websites for SEO \"Properly\" you need to research the right language/dialect to optimise for. Write content for the specific languages your trying to optimise for and take into consideration any cultural differences that may affect the user search patterns. To date the best way to overcome these obstacles has been to travel a lot & visit the different regions, just last week i was in the Friesland region learning the different cultures better and the language. Finland Simo Orpana – SEO Consultant at Tulos Helsinki Oy Google is the market leader with such a large margin that SEO activities are really optimization for Google. Bing is used in small portion for SEM, since the clicks are usually cheaper, but no websites are optimized for organic Bing searches.There are only a handful of high quality SEO agencies in Finland. The market is divided between smaller SEO focused agencies and larger digital marketing agencies, that provide SEO services as a part of their service portfolio. Top SEO consultants normally tend to work in smaller agencies. There are not too many international agencies competing in Finnish markets.As a company, our biggest challenge is not to compete against other agencies for clients but to convince potential clients that SEO and digital marketing is something that they should start doing. Decision makers in companies don’t normally know how much growth potential there is in digital marketing. They are more likely to invest greater amount of money to more traditional marketing even though it’s much harder to measure and the ROI is smaller. Smaller companies often see SEO as a way to compete against bigger rivals. International companies are also more familiar with SEO than the domestic ones.It’s also easier for companies to invest in Facebook advertising than to SEO, since it’s something they can more easily understand. SEO as a concept is more difficult to understand, especially when getting the results usually takes time. More and more companies are also interested in YouTube optimizing, which makes sense, since it’s the second largest search engine after Google. Besides us, there are not too many agencies offering this service. Advertising in Facebook is already popular and Instagram ads are getting more popular. Twitter is rarely used by companies but there is some interesting testing done in Snapchat. Google+ is dead and buried. All in all, companies in Finland are getting more interested in SEO, even though the change is slow. There are also more and more smaller agencies coming to market. I think at the moment SEO companies face two major issues. One is to convince potential clients that they should invest in SEO. The bigger challenge that SEO companies face is the lack of skilled SEO professionals. In Finnish universities SEO is seen as a technical skill rather than marketing skill, which means that marketing major students only geta little education about SEO. I think part of the problem is that university professors are a bit clueless aboutmodern SEO. Most of the SEO professionals in Finland are self-taught. I think SEO will become more mainstream in the next 3-5 years. Companies simply can't afford to neglect this side of marketing.There will probably be more SEO agencies and bigger marketing agencies will hire more SEO people. Majority of clients see SEO as a project which will be ready at some point. Sometimes it takes a bit of effort from our side to get them to realize that SEO should always be seen as a continuous process. Some of the clients believe that if we are good in what we do, we should be able to get the clients website in top positions in 1-2 months which of course is not always possible. SEO circles in Finland are quite small and many of the SEO professionals have worked for more than one agency. It means that most of the people know each other if only by name and often meet informally fordrinks. I'm not sure if there are any big SEO conferences in Finland. Jaakko Suojanen – CEO and Founder of Suomen Digimarkkinointi Ltd Google rules the market in Finland. I think that 5 years ago Finland was way behind US and UK, we didn't have that many good companies or SEO experts here. In 2016 we are not so far behind and new good companies are starting all the time, so competition is rising. What makes Finland’s SEO markets different, is our small size. There are only little over 5 million people here, so that creates challenges to SEO. This manifests itself in a much lower search volume and that shows especially in the volume of long-tail searches. So our long-tail is shorter than US and UK long-tail and we have to consider that when creating content and when doing keyword research. Since we are a small country, there are fewer companies and websites and also less link building opportunities, so good quality links really make a big difference here in Finland, since they are in short supply. One interesting thing to notice, is that many SEO tools don't give accurate data here in Finland. I think that’s because of the low search volume too, our big volume keywords are not big volume to the tools that are built for US and UK and that’s why many good keywords and links are under the radar for those tools.Our language, Finnish, is also the second most difficult language in the world: only Chinese is rated to be more difficult. That seems to be a challenge for Google, both in SEO and Adwords. We have created our own way to do keyword research and creating keyword strategies for AdWords here in Finland. Finland's search marketing scene is small, people are quite open and help each other out a lot here. I think search market in Finland is in a really interesting phase, competition is growing and companies are beginning to understand the power of SEO and Adwords – of course when it’s done right. Slovakia Ladislav Varga – Product and Marketing Manager at Mediatel spol The SEO industry in Slovakia is an exciting industry to be from sales and technical point of view. Mediatel as a former Yellow Pages company handling several thousands of clients figured out pretty quickly that Google is the SEO of choice. Almost all traffic to www.ZlateStranky.sk (Yellow Pages) and to several other web pages, Mediatel creates is coming from Google. Officially, 98% of search engine traffic comes from Google, and we barely look to other search engines like Bing or JYXO for example. http://www.rankings.sk/en/rankings/search-engines.html. It is interesting to see how Google is changing some algorithms on a daily basis. Search results for some queries based on IP are also very interesting. Looking at the industry, I can say there is a big competition in Enterprise business, and the big agencies are fighting for the big clients. But in the SMB business where our main effort is focused, the competition is relatively low. Mediatel is also doing SEO for bigger clients. What Mediatel figured out with years of experience doing SEO, was that clients are not interested in what we can do on their web pages regarding On-page or where are the backlinks, what they are interested in is their off-page. Clients are mainly interested in how their web pages are moving up in organic search from month to month. What really works for Mediatel in terms of selling SEO products are sales pitches such as SEO compared to PPC is active 24/7 and works in the long term. We can measure it very well and prove our efforts to clients. Nice reports about how we move this page and what traffic we generated through organic search is also a must. SEO is not perceived by clients and users as advertising. All that matters is who is first on Google in organic as they will be the leader in the field. Daniel Duriš – Senior Consultant at Pizza SEO SEO market in Slovakia has a long history. First media mentions of SEO started around 2003 and by 2008, there were several agencies specializing in SEO.With slow education of the market on why SEO is important, many new players started to offer their services with varying levels of quality. Today, you can find multiple options: from websites offering cheap one-time SEO service, through freelancers with shorter or longer history and SEO specialized agencies to online marketing agencies that have grown from SEO-only to offering a holistic approach to online marketing. Even PR and media agencies have jumped on the bandwagon, although often choosing to subcontract such services. Even today, you can find forums with people discussing years old myths about search engine optimization and believing in their impact. Alas, link building is often seen as free or paid directory registration or solely posting of online PR articles without thinking about implications of creating such unnatural backlink profile. Maybe these have been hanging around for long here, also because Google is sometimes slower to apply some of its ranking signals as Slavic languages are more complicated for parsing and lexing due to declinations and diacritics. Top quality SEO requires budgets and patience that many clients do not have, but comes with content creation and usually runs together with other services such as remarketing (PPC) or social profile management.Slovak market is close to the Czech one, so often e-shops launch in both countries. There are some great SEO tools for these languages as often international tools do no provide language specific position monitoring etc. Tomas Svoroda – CEO at Seocentrum SEO in Slovakia as well as in the rest of the world has undergone a significant transformation. Mainly, two algorithms are responsible for that - panda and penguin primary. After this update the strategy of link building has began to change significantly, reciprocal link exchange has dropped out and more effort is given to content. However, some of the basic mistakes are still to be seen, even among the experienced agencies, which I attribute to their rapid growth and thereby to the recruitment of people not skilled enough, who are still learning. Slovakia is a small country with approx. 5 million inhabitants, but we have a well-developed IT structure. Only few individuals and only us among agencies focus solely on SEO likely. Others offer comprehensive services from each important area - website making, PPC, social content and some of them digital, too. However, I have noticed only few freelancers and like 5 bigger agencies in the SEO services area overall. The remaining consultants then offer other services primarily and SEO is only a marginal matter. Price for services stands from 100 - 150 € per month, up to like 500 - 600 € per month, these are common fees which are allocated according to the campaigns complexity as well as the client size. Similarly, it also depends on the content of the service, whether an audit, consultations, or just link purchasing is a part of it. Some of the agencies use their network of blogs, others like us have long-term contracts with the leading portals where we buy ads for our clients for a good price, they wouldn't be able to access themselves. It is still possible to see the different link building techniques, other forms of approaching to problems and their solutions which are specific to each agency and it's like their handwriting. However, it is going to be similar everywhere in the world. Level of websites and e-shops over the last years has increased dramatically so we don't focus on the technical side that much anymore. Rather we focus on the structure and content within the onpage consultations and history because of the possible penalties and inappropriate reference profile, which may be a time bomb in the future. The trend of mobile versions is coming to us from the west, which is a duty already, as well as deep analytics and content personalization gradually. The last two mentioned are still in their infancy and it will take a few years before they become a common part of website creation and management. Turkey Osman Mutlu -– SEO Executive at SEOzeo When we observe the search engine market in Turkey, as one might expect, Google leads the pack. We know that Yahoo and Bing are the two most preferred engines after Google in Europe and the US but in Turkey, there is a different engine which plays a huge role; Yandex! The fact that the Russian search leader Yandex is Fenerbahçe’s (one of the popular Turkish football clubs) jersey sponsor and also has free navigation app with a built-in map, current traffic information, walking or driving directions, it became the second most popular search engine in Turkey. Although Yandex has been slightly affected by the diplomatic crisis between Russia and Turkey, the search engine maintains its strong position in the market. Search engines (especially Google) have made major updates to their local search ranking factors but unfortunately, these updates don't seem to be rolled out in Turkey yet. It seems like it will take time for us to see these updates in the Turkish market. As we wait that to happen, we also try to guess how the effects of above-mentioned updates will change the SEO industry in Turkey.Sadly, we can also say that SEO is taken into account as if it is only a process of link building in Turkey, thus it causes the increase of websites doing SEO which can be considered as spam. We could observe some serious changes in SERPs with the new Penguin algorithm which we are sure is about to be released soon. We can say that the awareness on the technical part of SEO increased lately, nevertheless, this is not enough yet. We should also mention the positive improvements. The SEO market in Turkey is expanding, and it is possible to say that people are becoming more conscious about SEO services. Especially small and medium-sized companies invest in SEO and thus, they contribute to the market's growth and development. The growth of the market and players involved in the SEO market consequently trigger competition and force SEO agencies to provide more quality services to their customers. Mert Erkal – Founder at Stradiji Roughly 95% of search engine traffic comes from Google.com.tr in Turkey. Yandex is the other search engine which has been trying to increase its market share for a few years now, yet, Google still dominates the market. While Google is the dominant player in the Turkish market, most SEO agencies ignore rest of the search engines and their webmaster guidelines. Google faces difficulties with the semantics of Turkish (check Google translate and you will understand what I mean). We can still see some low-quality websites ranking high in SERPs which are not compatible with Google guidelines. Frankly speaking, sometimes I have a feeling that Google sees Turkey as a market to sell Google Adwords. The quality of SERPs comes in the second place. That’s why blackhat SEO tactics can still work in Turkey for some niche segments. Having said that, Google has started Turkish Office Hours - Google Hangout meetings recently. They also encourage webmasters to contribute in Turkish Google Webmaster Forum. These are positive indications that Google has decided to increase the knowledge and quality of SEO in Turkey. There are hundreds of people in Turkish forums whom you can still buy link packages, and it seems that it works for some websites in Turkey. We (Stradiji) introduce Google algorithm updates as they happen globally by posting about them on our blog, but when our followers and customers see that they do not work in Turkey or takes so long time to work, most people don’t take them so seriously. There is a contradiction between Google’s global algorithm announcements and what we see in Turkish SERPs and rankings. I am not sure, but maybe Google’s resource for Turkey is not enough to clean up all the blackhat powered websites. Most companies have started to understand the importance of ON page SEO and technical SEO; not only for the search engine robots but for the user experience they provide. Tools like Deep Crawl and Searchmetrics have become very popular amongst agencies and companies. Turkey has one of the highest mobile penetration with more than 30 million young people using their smartphones all day long. Investment on mobile SEO and mobile user experience have been rapidly increasing since last year. Google’s mobilegeddon algorithm update has increased this process in Turkey. Most companies are using Google’s Page Speed Insights to increase their mobile and desktop page speed these days. There is an ongoing SEO conference being held in Istanbul, Turkey called SEOZONE since 3 years. SEOZEO agency organized these events. Popular SEO professionals, ex-Googlers, companies like Searchmetrics, Deep Crawl, SEO Monitor, are invited to the event. These events worked like an eye opener for most digital marketers and SEO professionals in Turkey. Companies increase their allocated budget for SEO each year. Like everywhere in the world there are some good quality SEO agencies and the bad ones. Unfortunately, SEO experience of decisive digital managers are fairly new, most of them confuse Google Adwords with organic search results, that is why they can easily select an SEO agency or company which sooner or later they will regret. Turkey is an emerging country with more than 30 million young people who are regularly shopping from the Internet. It is not rocket science to say that the importance of SEO will continue to increase in Turkey. SEO agencies like SEOZEO and Stradiji will continue to introduce Turkish digital workers to how to do SEO by world standards. Lithuania Arvydas Tamulis – SEO specialist at NFQ There are several challenges Lithuanian SEO agencies have to deal with. BlackHat is still an issue, and it’s easy to sell. First, it’s competition with other pseudo-SEO agencies which provide shady SEO services. PBN’s, 301’s and other BH methods still work to some extent. Since these methods are less time consuming, they can be sold at a lower price. But the results are short term and in most of the cases, they end up as a traffic drop or even a penalty. This leads to a second issue. Clients learn it the hard way SEO services started to gain attention only 2-3 years ago. Before, Adwords was a major channel to promote small/medium business. However, competition and prices for a click went up, so most of the businesses turned to SEO as a “free channel”. But it’s not. So you have to educate your client that it’s a constant investment, and the result is not instant as it is with Adwords. Not being confident about the result, most of the clients try cheaper (usually shady) SEO services and burn their sites. After this happens, they come back to proper SEO agencies willing to pay extra. Go global or go home More and more Lithuanian companies are expanding to foreign markets. This increases a need for professional SEO services in foreign or global markets.This trend will definitely continue. So, more and more Lithuanian SEO agencies will need to learn how to compete in these markets. And those who will fail to learn this will have to deal with much local market and much smaller budgets allocated to the home market. Andrius Sejonas – Co-Founder & CEO Market Rats The SEO market in Lithuania is quite chaotic. I can count more than 50 companies that offer SEO services, while the whole market share in Lithuania reaches 2.8 million inhabitants. Due to the fact that people in Lithuania mostly speak in Lithuanian, Russian, and English languages and they get relatively low wages for hours spent while working, typically from 30 to 60 Euros, a large part of SEO services is being exported. The main focus, more precisely 96-98%, goes to google. However the more powerful neighbors such as Russia is where there is no language barrier, and several agencies specialize with Yandex Search Engine system. The google.lt SEO Search Engine itself is very dynamic and less predictable, since new innovations to google SE come very delayed. Also, we still have some operating spam actions, which in fact should not even be available (which we do not want at all!) Speaking about the complexity of the language (Lithuanian language is one of the most complex in the world), it accounts for why we sometimes face certain problems when some Lithuanian keywords can't be normally understood. For instance, when the case of the word changes at the same time changes the root of the word that are being comprehended as two different keywords by search engine system. In terms of market growth, this SEO boom started 4-5 years ago. Some time having passed, some specialized SEO agencies have settled in the market and have raised the perch of this service quality high enough. From that time, the budget and the amount of the competition growth is clearly visible in every year. In the last 2-3 years, the public’s perception of SEO specialists has really changed. Today, people who work with SEO are called real professionals, while previously SEO specialists were considered to be sorcerers or even worse - charlatans. However today, even the most famous or biggest companies first ask for our advice and only later on take an important step (such as entry into the market). Due to the fact that in Lithuania there are not enough related content sources, we deal with a problem of the relatively small market of outside SEO. Therefore, the fight for the positions sometimes happens really fiercely. The whole fight is happening not only according to good content strategy, but also because of the collaboration with portals and so on. It is quite common that Social networking websites are being utilized for SEO purposes, but again due to market size the usage of social networking websites itself is not always properly used.The fight for positions in the strongest Lithuanian SEO markets is like a daily routine with persistent spammers who suddenly pop up in the Google top 10. All in all, the writing of SEO articles is quite widely prevalent these days and now I can count about 200 journalists and writers who offer SEO article writing services. Ireland Luke Fitzgerald – Head of SEO at Wolfgang Digital The SEO industry in Ireland has become increasingly complex and competitive in equal measures over the past couple of years as the number of independent consultants and specialist agencies has proliferated; particularly in the capital city Dublin, where a technological renaissance is unfolding in the shadows of global tech behemoths Google, Facebook, LinkedIn, Hubspot et al – all located within a square kilometre of each other in and around the aptly-dubbed ‘Silicon Docks’ in the heart of the Dublin docklands. Gone are the days of low-tech link building and on-page specialists working in silos at Irish agencies; the majority of cutting edge SEO practitioners here in Ireland who have a proven track record of success are doing so by combining a wide range of skills and offering them as part of a holistic SEO package, so we see firms consolidating outreach, content creation, graphic design, technical SEO, dev implementation and the creation of bespoke tools to offer clients a truly robust offering under one roof. The generalist Vs specialist debate rages on, but we’ve found it’s probably best to have a nice mix of both, along with a good mix of introverts and extroverts who dovetail nicely to bring a unique, interdependent blend of both performance and communication; they simply can’t function without each other. The level of in-depth knowledge of solid, technical SEO has been increasing at an encouraging rate both among our agency peers as evident at top-notch search marketing events such as Learn Inbound and 3XE but also among our clients themselves. Many of them are increasingly keen to learn more about SEO and how it can benefit their business; the client-led demand for it has been nothing short of phenomenal over the past 12 months and we’re chomping at the bit to get stuck into technical audits, landmark content creation and award-winning performance led campaigns for clients in a multitude of cutting-edge industries ranging from high-street fashion retailers to legal firms and financial institutions. Exciting times ahead for us Irish SEOs as we wait with baited breath for the next big algorithum update from our neighborly overlords in GooglePlex IE, at least we know where they live if they come for us! In all honesty, it’s a godsend having Big G right around the corner, at least my AdWords colleagues tell me! They’ve been nothing but helpful whenever the need to communicate has arisen and they even let us host our client events in their offices, we must be doing something right! Sweden Michael Wahlgren – CEO and Founder at Pineberry Swedes are known for being early adopters when it comes to the Internet and technology which in turn has made the Swedish SEO market competitive. Especially if you consider that we are only 10 million people. Sweden is by far the most competitive of the Scandinavian markets. This also makes the knowledge level of SEO relatively high compared to other markets, both among industry experts and companies. From being a niche channel, SEO is becoming one of the most important marketing channels for many Swedish companies. Larger companies are struggling a bit with SEO. They have a hard time implementing the necessary technical changes, making Google a playing field where smaller companies still can compete with larger ones. The Swedish SEO industry is quite fragmented with a lot of small and medium sized SEO agencies. I expect the market will consolidate in the next 3-5 years. Most Swedish SEO agencies charge a monthly fee for their services. A few still work with performance-based fees, but this is declining. You very seldom find an SEO company charging an hourly fee. Four times a year Swedish SEOs get together at SEO Snack (seosnack.se) in Stockholm. A perfect opportunity if you want to meet up with the SEO scene in Sweden! Nira Hindocha – SEO Specialist at Be Better Online Swedish behaviour: Talking about SEO in Sweden automatically directs your thoughts towards Google. 94% of Swedes use Google everyday on their mobile phones and laptops while 3.5% use Bing, which is the second biggest search engine in Sweden. The Swedish SEO-market: Swedish people have more or less always been up to date when it comes to SEO and technology in general. Several companies have been here from the beginning of SEO and are still here while the market significantly keeps growing, which it has been doing the last couple of years. Even though we have a lot of SEO-agencies, many web-developing agencies have recently started to include SEO in their packages. With this said, everyone basically does “SEO” but just because everyone does it, doesn’t mean it’s good SEO. A winning SEO-strategy Content and links have always been a key ranking factor, but instead of just obeying the current rules Google has set for us - try to understand what the search engines are trying to accomplish. Google wants to make sure their users always get a great experience using their services, which is why they update their algorithm continuously. They reward the best user-friendly websites that can answer the questions people ask Google everyday by showing them at the top. This is a reason for why websites with fast page speed is becoming a more important ranking factor, especially for mobile traffic - forcing companies to make even lighter websites. This is probably why the Accelerated Mobile Pages (AMP) initiative is being launched, a format for building websites that initially eliminates websites with slow loading speed by only accepting a limited set of allowed technical functionality - optimized for fast rendering and performances. I’m really looking forward to seeing what Google has planned for Sweden in the future. Bulgaria Ognyan Mladenov – SEO Expert at SEOM In Bulgaria, almost all the traffic from the search engines comes from Google. In some niches such as tourism and real estate, there is a decent amount of visits from Yandex, mainly because of the large number of citizens from the former Soviet republics who are now living in Bulgaria. The levels of competition in Bulgaria are lower compared to those in the Western markets, but SEO is very specific, due to the lack of good websites for link building and quality copywriting services. An important feature is a lack of Bulgarian versions of Amazon and Ebay, which makes reaching the top positions much easier. On the other hand, there is one or several prominent large informational websites or forums in every niche with a lot of traffic. They generally occupy the top results, which makes it incredibly difficult for the small businesses to breakthrough. A significant part of the rapidly growing number of online stores has certain difficulties with the loading speed - in most of the mobile versions there is a lack of adaptive design, while in over 97% of cases SSL certificates are only wishful thinking. The community of Bulgarian optimizers is extremely large and cohesive. Each year, many special events are conducted, the largest of which is SEO Conference Bulgaria with over 600 attendees. Besides professional SEO agencies, almost every web design company offers search engine optimization services, but sometimes the quality is not very good. In recent years, there has been a significant demand for in-house professionals from the large and medium sized companies. Zdravko Genchev – CEO at Maxcart As a CEO of E-commerce SaaS company, I’m learning a lot about how SEO tactics perform in Bulgarian markets. Having gathered feedback from thousands of online stores in Bulgaria, I would like to share with you some interesting facts about SEO and SEM markets in our country. In 2016, more and more оnline entrepreneurs prefer to pay for Google AdWords (Prefer PPC) rather than order SEO services from agencies. Here are some strong reasons they have: Quality SEO services are expensive, especially for small and medium sized businesses, and satisfying results come in the long term. Through so many updates to the Search Engine algorithms like Penguins, Pandas, Calibres and all kinds of known and unknown animals, business owners in Bulgaria decided it was very unreliable using SEO marketing companies. In Bulgaria the level of competition is significantly lower, compared to developed and large European markets like UK and Germany for example. As a result, you can rank a website in low competitive niche in local search in less than a month. Ranking videos from YouTube on first page seems to be a great opportunity in Bulgaria for lots of domains. Building SkyScraper articles works in competitive niches and is probably the most efficient technique for so many websites nowadays in E-commerce SEO. Content marketing has been hit in the developed markets for years. In Bulgaria, this technique has been neglected by SEO specialists and business owners who optimize their websites on their own. In 2016 the picture is different. More and more sites are starting to produce quality content. Borislav Arapchev – CEO at Idea Studio LTD As a small country with low standards, in Bulgaria we face a lot of clients that want amazing SEO results with a few dollars, which is not possible. When a team of SEO professionals is working on a project, the team performs site audit, errors and weak things fixing, content analysis and content improvement, link audit, links disavow (if needed), social media signals, content distribution, brand strengthening, competitors monitoring, clients behavioranalysis , etc. So ... it's a lot of work, many people are involved and it can’t be cheap. In the next 3-5 years, serious clients will understand that SEO is an investment, that keeping your website on the top requires the assistance of an SEO agency which will focus on quality of the website and give the client solutions and answers. The most popular rate of payment for SEO services in Bulgaria is monthly. It's between 400-1000 Bulgarian levs, which is equal to 200-500 Euros monthly.Some agencies work per results, but this scheme is not so popular, because results depends on the third party - Google, and nothing is sure. If a team of 5 people work for one month on a website's success, they want monthly salary, so monthly payments are most popular. A lot of clients have unrealistic expectations - 1st Google page in 1 or 2 months.Or even they say “I can wait” and they call you later, on the second week and ask “What's up?” Another problem is that they don't know basic SEO principles and want to be ranked for potatoes, for example, when their website only has tomatoes.So, it’s our role to explain to them how SEO works and how they can help us in the process. The worst SEO clients are those that think they know SEO and give us advice to buy 500 links or to make huge Email marketing campaigns. So the worst problems on a website are usually caused by their owners, not competitors. I think the most popular advertising channels in Bulgaria are SEO, Facebook advertising and Google Adwords advertising. FB ads and Google ads are for brand visibility mostly and for quick results, while SEO is for long term market benefits and solid brand popularization. There are a lot of SEO companies in Bulgaria and a lot of SEO specialists as well. But the big and solid ones are not so many -I could mention SEOM, Cloxy, Netpeak, Inbound.bg, Orm.bg, we - Idea Studio (ha-ha-ha, I'm not so modest),Serpact, Ganbox,and others...We know each other personally and even we are competitors sometimes, other times we are friends and we help each other, which is fantastic! I'm happy and proud to be part of Bulgarian SEO community! We have annual SEO Conference (now under the name OA Conf.), also WordPress Camp, eComm Congress, Evolution Awards, etc... Believe me, sometimes ten minutes of networking, speaking with some colleagues on these events, could give you some SEO idea worth thousands of dollars. Ukraine Mykhailo Karboinov – Head of SEO at Netpeak Historically, SEO has been developing in Ukraine at a more rapid rate than in many other countries of the world because the Internet space of this country is located at the intersection of the two search engines: Google (65% of the market) and Yandex (30% of the market). Different search engines use different algorithms and approaches to the site ranking. For Google - external links are important, while Yandex - in contrary - applies search engine pessimization for it. Therefore, specialists have to seek for the golden mean and place an additional emphasis on the internal optimization. It is followed by the necessity to use a serious and complex software and SaaS (Serpstat, Netpeak Spider, Netpeak Checker, Ahrefs etc.) Moreover, thanks to the current situation, Ukrainian specialists are often of a higher professional level that the ones in the West as they are used to working with the site, not with the external links. At the same time, the economic situation within the country dictates an extremely low level of salaries (the cost of one hour of work is no more than $50). Taking into account the leading position of Google, low prices and high professional level of local executives, foreign clients often refer to Ukrainian SEO optimizers to request some work with their websites. Croatia Josip Ivanovic – General Director at Dejan SEO Being a part of Australian company Dejan Marketing, here in Croatia, we are doing everything by the rules. All of our work is white hat, and it is hard. Main reason is that, here we have a lot of old school spamming techniques bringing good and fast results, and other agencies (most of them) are using it. It's worth saying that Google either can't do anything about it because it's a small market, or they don't care (for the same reason). This has a huge impact on prices, because they can achieve good results in relatively short periods of time and for a low price. On the other hand, if you are doing white hat, then you'll have expensive and much longer campaign. But, better times are coming. Croatian business owners are getting more educated, or frightened by stories they read on the internet about Google penalties, and this has started to impact their decision when choosing SEO provider. So, my conclusion is that better days are coming.",
  "headers": [
    {
      "level": "H1",
      "text": "36+ Experts Share Insights About SEO Around Europe"
    },
    {
      "level": "H3",
      "text": "International SEO Fun-Facts"
    },
    {
      "level": "H2",
      "text": "United Kingdom"
    },
    {
      "level": "H2",
      "text": "Denmark"
    },
    {
      "level": "H2",
      "text": "France"
    },
    {
      "level": "H2",
      "text": "Germany"
    },
    {
      "level": "H2",
      "text": "Italy"
    },
    {
      "level": "H2",
      "text": "Romania"
    },
    {
      "level": "H2",
      "text": "Spain"
    },
    {
      "level": "H2",
      "text": "Portugal"
    },
    {
      "level": "H2",
      "text": "Czech Republic"
    },
    {
      "level": "H2",
      "text": "The Netherlands"
    },
    {
      "level": "H2",
      "text": "Norway"
    },
    {
      "level": "H2",
      "text": "Poland"
    },
    {
      "level": "H2",
      "text": "Belgium"
    },
    {
      "level": "H2",
      "text": "Finland"
    },
    {
      "level": "H2",
      "text": "Slovakia"
    },
    {
      "level": "H2",
      "text": "Turkey"
    },
    {
      "level": "H2",
      "text": "Lithuania"
    },
    {
      "level": "H2",
      "text": "Ireland"
    },
    {
      "level": "H2",
      "text": "Sweden"
    },
    {
      "level": "H2",
      "text": "Bulgaria"
    },
    {
      "level": "H2",
      "text": "Ukraine"
    },
    {
      "level": "H2",
      "text": "Croatia"
    },
    {
      "level": "H6",
      "text": "Most popular pages"
    },
    {
      "level": "H6",
      "text": "SEO Checklist: 41 Tips to Optimize Your Website"
    },
    {
      "level": "H6",
      "text": "How to Perform a Complete SEO Audit (in 14 Steps)"
    },
    {
      "level": "H6",
      "text": "A Beginner’s Guide to Keyword Search Volume"
    }
  ],
  "author": ""
}