{
  "url": "https://www.semrush.com/blog/amazon-ppc-complete-beginners-guide/",
  "slug": "amazon-ppc-complete-beginners-guide",
  "title": "The Amazon PPC Launch Plan: Everything You Need to Advertise on Amazon",
  "description": "Amazon PPC is essential to creating visibility for your product.  Here is everything you need to know to get started with Amazon PPC; it doesn‘t have to be complicated. Your journey starts with the launch plan outlined in this article.",
  "content": "Life doesn’t always come with blueprints, But, when it does, you have to take advantage of it. To be honest, we created this Amazon PPC launch plan to make advertising on Amazon easier for new sellers who don’t know where to turn for advice on paid advertising. This article is your blueprint. Use it to increase your sales and drive traffic to your Amazon product listing.In this launch plan, you will learn: What Amazon PPC Is Why Amazon PPC is Becoming Increasingly Important How to Start Your Amazon Advertising How to Optimize Your Ads Effectively What is Amazon PPC?To me, Amazon PPC is the greatest thing that ever happened to eCommerce. Selling on Amazon is the best way to drive traffic to your product. Amazon has over 2.64 billion visitors every month at the bottom of the sales funnel, looking to buy as soon as they type Amazon.com in their search bar. The desire to buy on Amazon helps provide much higher conversion rates than what brands will experience on Google Ads or Facebook Ads.PPC advertising is just the cherry on top. PPC advertising is advertising you pay for to show up on Amazon to increase the visibility of your product. PPC stands for pay-per-click, where the advertiser pays for each click a potential customer performs. Like Google Ads, Amazon PPC is a bidding system where the seller bids on search terms in hopes to appear for them in on the Amazon search results page (SERP).Amazon is Placing Ads Everywhere Without Changing User ExperienceThe beautiful thing about Amazon is that the eCommerce site can have ads on every web page and not ruin the user experience; this is unlike any other site in the world. And with 56% of customers starting their shopping journey on Amazon, brands are just now seeing the importance of advertising on Amazon.According to CNBC, Brian Olsavsky, Amazon's chief financial officer, said during the earnings call \"It's now a multibillion-dollar program and growing very quickly,\" Olsavsky said advertising on its site is beneficial to both the customers and sellers on Amazon's platform. Ads help Amazon shoppers discover new brands and products more efficiently, while sellers can more effectively reach their target customers, he said.Amazon is continuing to add features to its ad platform such as remarketing to third-party sites, Enhanced Brand Content, and attribution, among others.How Does Amazon Advertising Work?Amazon has two selling platforms: Vendor Central and Seller Central. Vendor Central is for the bigger sellers, and Seller Central is for the smaller sellers. Each platform has ad types that overlap.As mentioned before, Amazon sellers bid on search terms in an auction-style system. The winner of the search term’s ad appears in the Amazon search engine results page (SERP) when a potential customer searches a keyword.Sponsored Product Ads are the most popular type of ad on Amazon, appearing at every stage of the buying journey and have the highest conversion rate (around 10%). Headline Search ads appear at the top of the SERP and require some copywriting. Product Display ads appear on the product display pages and can be interest or competitor targeted.Here is an example of a Sponsored Product Ad:A Product Display Ad:A Headline Search Ad:These are the basic types of ads, but Amazon Advertising also offers ad types like Enhanced Brand Content, A+ Content, and videos to increase brand awareness and trust even more.Focus on Your Product Before AdvertisingThe number one thing you should prioritize before starting to advertise is ensuring your product details are set up properly. Like anything, bad product display pages can lead to a number of problems when selling on Amazon.Before focusing on PPC be sure to: Add accurate product descriptions: Not being accurate or completely transparent about your product can lead to bad reviews, which hurt your ad and product ranking. Have plenty of images of your product: Customers are more likely to buy your product if they see it and can trust it is what they want to buy. Set a competitive price: This is business 101, but you want to ensure your product is at a good price point compared to your competitors. Set yourself up to get good reviews: Reviews are very important to ad rank and customer trust on Amazon. If you don’t supply a good product or are misleading about your product, you will get bad reviews and put yourself in an Amazon selling hole. Think of your product detail page as your brand’s landing page. You want to make sure it’s optimized before you bring traffic to it.How to Start Your Amazon AdvertisingIf you are not using an Amazon PPC tool, we always recommend starting with an automatic campaign. An auto campaign is where your Amazon PPC journey should begin; it will provide you with all the information you need to get started without any additional keyword or advertising tools.The auto campaign is powerful because Amazon provides you with suggested keywords and allows you to bid on them for a low amount until you see which ones convert. I said “low amount” because it may be your first instinct to bid high on search terms you think you will earn money on or want to rank for. Giving in to this temptation will lead you on a path of wasted spend and high ACoS. (FYI, I have defined Amazon PPC terms below the video) To begin, start an automatic broad match campaign (and name it AUTO - RESEARCH) for Sponsored Product Ads. Bid low, to begin with (around 10 cents), see what search terms pick up some impressions, and then inch-up your bids 10 cents until you earn a conversion. Once you get that first conversion, take that search term and place it in a new manual exact match campaign (and name it MANUAL - EXACT - TARGET ACOS) and continue to inch the bid up until you reach your target ACoS (TACoS).Repeat this process for each search term that wins a conversion. For the search terms that don’t convert after a few weeks, keeping them around and bidding on them means your wasting money, right? This is where Negative Keywords come in. Negative Keywords are keywords you don’t want your product to appear for. By turning search terms that don’t convert into Negative Keywords, this will avoid wasted spend and lower your ACoS. If a term isn’t converting, you don’t want it around to suck up your budget, but even if a search term gets one conversion, you should put it in that manual exact match campaign. This method is called the Inch-Up Method.Keep in mind: Amazon delays accurate metrics for up to 48 hours! Viola! You are on your way to dominating Amazon PPC.Here is a quick video recapping this method:Some Amazon PPC Terms You May Not KnowWhen I described that method above, I threw out a bunch of PPC terms. Here is a glossary to catch you up to speed.ACoS: ACoS stands for advertising cost of sale, and it is the percentage of how much you spend on ads compared to a sale. It is calculated by ad spend/sale. The average ACoS for our users is 30.1%TACoS: Target ACoS is where you want your ACoS to be at a campaign level. Low ACoS means high profitability and low visibility and high ACoS is higher visibility and lower profitability. High ACoS isn’t a bad thing as some sellers think. I often compare it to buying an ad spot in the Superbowl. The price will be higher, but the brand awareness and sales potential are infinite. Before deciding your TACoS, figure out your breakeven ACoS.Keyword Match Types: Broad: The most general type of match type. We want to put our first auto campaign in broad match to cast a wide net of possible search terms we can show up for. As an online advertiser, we have no idea what our products can show up before because we can’t predict most user behavior. Broad match terms are also the cheapest. Phrase: This match type is a little more specific and little more expensive. Phrase match encompasses phrases your search term might appear in. Exact: This match type is exactly what it sounds like; exact match is the most expensive and specific match type. Impressions: How many times customers have viewed your ad.Clicks: How many times customers have clicked on your ad.CPC or aCPC: CPC stands for cost-per-click or how much you are paying each time an Amazon customer clicks on your ads. aCPC is the average cost-per-click. The average CPC for our users is $.78.Conversion Rate: The percentage of sales you get compared to the number of clicks. The average conversion rate for our users is 9.67%How to improve Your Amazon Advertising SkillsIf you are coming over from Google Ads, Amazon PPC is actually easy to conquer. Amazon has a lower competition and a higher conversion rate than Google. The learning curve is easier and Amazon takes a lot of features from Google. They also based their ad platform off of Google’s. If you are brand new to Amazon PPC, Google Ads are a great place to begin your education by learning the history of PPC. Amazon PPC is relatively new, and sellers are just now realizing the power of Amazon ads, so the educational material is more limited than Google Ads.Once you have completed the Inch-Up Method, take your Amazon PPC to the next level by adding Headline Search and Product Display ads to drive more traffic to your product. Also, it would be beneficial to know how Amazon’s A9 ad ranking algorithm works and how you can optimize for it.Here is an infographic to help:Lastly, learn the difference between organic and paid traffic on Amazon and how their relationship effects each other.Now You Have Everything to Get Started with Amazon PPCThat is enough to get started advertising on Amazon, but Amazon PPC is a continual process. You should always be optimizing your ads to keep up with Amazon’s algorithm changes, competition, and changing business motives.You can always refer to this post and repeat the process when in doubt, launching a new product or on top your already optimized ads to fine-tune them even more. Thanks for reading!",
  "headers": [
    {
      "level": "H1",
      "text": "What Is Amazon PPC?: A Complete Beginners Guide to Optimization"
    },
    {
      "level": "H2",
      "text": "What is Amazon PPC?"
    },
    {
      "level": "H2",
      "text": "Amazon is Placing Ads Everywhere Without Changing User Experience"
    },
    {
      "level": "H2",
      "text": "How Does Amazon Advertising Work?"
    },
    {
      "level": "H2",
      "text": "Focus on Your Product Before Advertising"
    },
    {
      "level": "H2",
      "text": "How to Start Your Amazon Advertising"
    },
    {
      "level": "H2",
      "text": "Some Amazon PPC Terms You May Not Know"
    },
    {
      "level": "H2",
      "text": "How to improve Your Amazon Advertising Skills"
    },
    {
      "level": "H2",
      "text": "Now You Have Everything to Get Started with Amazon PPC"
    },
    {
      "level": "H6",
      "text": "Most popular pages"
    },
    {
      "level": "H6",
      "text": "SEO Checklist: 41 Tips to Optimize Your Website"
    },
    {
      "level": "H6",
      "text": "How to Perform a Complete SEO Audit (in 14 Steps)"
    },
    {
      "level": "H6",
      "text": "A Beginner’s Guide to Keyword Search Volume"
    }
  ],
  "author": ""
}