{
  "url": "https://www.semrush.com/blog/analyzing-competitors-traffic/?utm_source=blog&utm_medium=article&utm_campaign=en-audience-insights-12112021",
  "slug": "analyzing-competitors-traffic",
  "title": "How to Analyze Competitor Website Traffic in 2024",
  "description": "Learn to analyze competitor website traffic and compare metrics, engagement, devices, and demographics.",
  "content": "Want to grow your business with competitor traffic analysis? You’re in the right place. In this article, you’ll learn how to analyze your competitors’ website traffic, why this strategy works, and which tools give you the most accurate data. Tip: Create a free Semrush account (no credit card needed) to follow along with the steps in this guide.What Is Competitor Traffic Analysis? Competitor traffic analysis is the process of analyzing your competitors’ website traffic and using the data to improve your own website performance. There are many tools that can help you do competitor analysis, including Semrush’s Traffic Analytics tool.These tools can provide you with various metrics and insights, such as: How much traffic your competitors are driving If their audience is growing or declining Which channels drive the most traffic What user experience looks like (i.e., average visit duration and bounce rate) Visitor demographics and locations that bring in the most traffic Which pages users visit after visiting their websitesAnd lots more. Essentially, competitive intelligence helps you see what’s already working for others. And build upon that success. Can You Really Track Competitor Website Traffic? For your own website’s traffic data, Google Analytics is the most comprehensive and accurate tool. But it won’t do the trick for your competitors. You can check a competitor’s site traffic, but you need a specific tool. Like Semrush’s Traffic Analytics.The tool leverages clickstream data (data about the pages a user visits) from multiple proprietary and third-party data sources. Then, it uses an AI algorithm to accumulate, clean, and process the raw data from over 200M+ internet users. For example, you’ll be able to see general information about your competitor’s audience. Like this:A consumer journey report to see where your competitor’s audience comes from and where they go next. And tons of other traffic insights. Like the top visited pages, top subfolders, geographic distribution, and more. How to Analyze Competitor Website TrafficData can tell a story. It can tell you whether visitors are finding what they’re looking for. Or if your new partnership is paying off. Among many other things. Which means insights drawn from competitor data can help you outcompete them. And earn more traffic. Let’s take a look at a few tactics you can use. Measure Competitor Website TrafficLet’s start with a broad view. It helps lay the foundation for more in-depth research later on. So, first, enter any competitor website into Traffic Analytics, hit “Analyze,” and you’ll see this dashboard:You’ll quickly see estimates of the site’s traffic and engagement. And how they’ve increased or decreased over time. Here’s a quick overview of what each metric means: Visits: the estimated total visits to the website during that month Unique Visitors: the estimated total unique visitors to the website during that month Pages/Visit: the average number of pages a person visits in one session on the website Avg. Visit Duration: the average amount of time visitors spend on the website Bounce Rate: The percentage of visitors who leave the website after seeing just one page You can also add your domain in the “Root domain” field and compare these broad metrics to yours. Note: Traffic Analytics data is based on estimates and averages. The best way to look at your real numbers is with Google Analytics. Now let’s dive a little deeper. Examine Traffic Trends Across TimeScroll further down in the Traffic Analytics dashboard and you’ll see a trend graph. Like so:It shows the same broad metrics we saw before, but depicted over time. Which can help spot any competitor trends and provides a forecast of what they expect to see in May. And you can also add up to four more competitors to compare website traffic data against. It may help uncover other trends.For example, are there spikes or significant drops in organic traffic? If so, are they seasonal (do they happen every year)? Does it affect all the websites you’re comparing?Think about what could’ve caused them. Especially for spikes. Did a competitor do something special? Was it due to a campaign they ran?Learning what caused spikes can help you see what works. Then, you can mimic your competitors’ strategies and win some traffic yourself. Likewise, discovering what caused drops in traffic can help you learn what you should avoid. Compare Website Traffic Customer Experience Now let’s compare user experience across your competitors. Namely, pages per visit, average visit duration, and bounce rate. Add your domain (or up to four other competitors) to the tool. Click “Compare.”And you’ll quickly see how these user experience metrics compare. Analyzing these metrics is important because, sometimes, seeing a high number of visitors can be deceiving. It doesn’t paint the full picture. Comparing these engagement metrics can give you a better understanding of how users are behaving. And if they’re finding what they need. For example, has a competitor’s bounce rate worsened over time?If so, this could mean: Users aren’t finding the content interesting or helpful A promoted offer isn’t as good is it seems Traffic is coming from countries where the product or service isn’t availableTracking these metrics over time can reveal who is winning when it comes to serving customers what they want. And can help you learn from what is working and steer clear of what is not. Track User Sources & JourneysNow let’s take a look at where your competitors' traffic comes from and goes. You’ll see that in the “Traffic Journey” tab. If you’re comparing multiple competitors, the first graph shows each competitor’s traffic volume by traffic channel. Like this:If you just analyze one competitor, you’ll see a more detailed graph showing the traffic volume each channel brings in per month. Both graphs can help you see the channels driving traffic for your competitors. So you can replicate what’s already working (in a better way). Now, to understand the user journey, scroll further down. This next graph shows where users come from and where they go afterward. Further down, the “Traffic Journey Details” table contains more details about the traffic sources and destination sites.Use this information to identify trends. For example, do lots of users go to a particular website after visiting your competitor? Why do you think that is? Perhaps that site has helpful content that is missing on your competitor’s site. If so, think about adding that content to your site. And try to win (or retain) some traffic that way. Explore Top Pages, Subdomains, and SubfoldersFirst, to see your competitors' top pages head to the “Top Pages” tab. You’ll see a report with detailed data. Including page views, unique visitors, traffic channels for each page, and a variety of sorting options.To search for specific pages (those promoted on organic social media or with paid social ads), filter according to the traffic channel to bring those pages to the top. Like this:You can also filter by page. And see the actual page by clicking on it. For example, we sorted Vrbo pages by the word “vacation.” As the graph shows, the page selected focuses on “Santa Barbara.” And receives a lot of traffic from paid search and organic socials. Which means you now have insights into Vrbo’s marketing strategy.Finally, the “Subfolders” and “Subdomains” tabs show your competitor’s top subfolders and subdomains by traffic and channel. Like this:And this:Use this information to determine if you should focus on creating similar subfolders or subdomains. Pro tip:Another tool you can use to monitor traffic changes easily isOrganic Research.Start by entering the domain name you would like to examine. Navigate to the “Position Changes” tab and then look at the “Top Page Changes” widget to see the domain’s pages with the most change in estimated traffic. You can click on the built-in filter icon to be taken to the “All Position Changes” report. This report has several preset filters about the keywords your competitor is gaining or losing traffic to (plus more). This makes it easy to isolate certain metrics for more thorough analysis. You can even see if they have been dropped in or out of a SERP feature. Once you’ve got the specific data you’re looking for, you can export this report using a customizable date range. Click the “Export” button to send the information to an Excel spreadsheet, CSV, or CSV Semicolon. Further reading: What Is a Subdomain and How to Set One Up? Subdomain vs. Subfolder: Which Is Better for SEO?Generate Audience Insights The “Audience Overview” tab is a great starting place for understanding how your market’s audience interacts with you and your competitors. The overlap graph shows the size of your competitors' audience. And the extent to which their audiences overlap. For example, the graph below depicts the audiences for five major U.S. newspapers.The largest circle belongs to The New York Times, indicating they have the largest audience with 48.6M monthly visitors. They share the largest overlap with The Washington Post, meaning 7.9M people who visited The New York Times website also visited The Washington Post. To see smaller newspapers in relation to each other, use the drop-down menu. The graph shows that The Wall Street Journal shares a larger audience with The New York Times than the LA Times does. And the shared audience between The Wall Street Journal and the Chicago Tribune is also quite small.Using this information, you might learn who you could partner with or which audiences to target to grow your traffic.Note: For more detailed audience insights, check out One2Target. You’ll get information about their income levels, employment status, education level, interests, and more.Track Competitor Web Traffic Globally The “Geo Distribution” tab shows information about audiences worldwide. For a general picture of a competitor’s global web traffic, start by analyzing the “Traffic Map.” In this case, the majority of The Guardian’s traffic is split between the United States and the United Kingdom—with the U.K. taking the prize when it comes to total traffic numbers. On the map, countries that account for less than 10% of the website traffic are light blue, suggesting there is some audience in these countries, even if those markets are small.For a closer look at traffic trends over time, scroll down to the “Trend by Visits” graph. The graph above shows the growth trend in various countries. For example, notice the spike in traffic from Australia in late 2020. It might be a good idea to do some more research into this specific market. And the “Traffic by Country” table below shows data for specific locations. Each entry has a drop-down tab that shows top website pages in that country. Considering the Australian market again, the market seems to be growing. And may be a good target for future growth. And examining the country’s top pages (business, education, and U.K. news), you might need to consider similar content if you’re looking to expand into this market. Take Competitor Analysis a Step Further Checking competitor website traffic is a smart way to boost your own website’s traffic. But you shouldn’t stop there. Conducting a more thorough competitor analysis can help you capitalize on their weaknesses, replicate their strengths, and prioritize tasks. For example, you can run a keyword gap analysis to find keywords your competitors are ranking for but you aren’t. Or find sites that link to your competitors but not to you. Or discover their best-performing pages to create something better or similar. Check out Semrush’s suite of competitor analysis tools. And stay ahead of the game.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Analyze & Compare Competitor Website Traffic in 2024"
    },
    {
      "level": "H2",
      "text": "What Is Competitor Traffic Analysis?"
    },
    {
      "level": "H2",
      "text": "Can You Really Track Competitor Website Traffic?"
    },
    {
      "level": "H2",
      "text": "How to Analyze Competitor Website Traffic"
    },
    {
      "level": "H3",
      "text": "Measure Competitor Website Traffic"
    },
    {
      "level": "H3",
      "text": "Examine Traffic Trends Across Time"
    },
    {
      "level": "H3",
      "text": "Compare Website Traffic Customer Experience"
    },
    {
      "level": "H3",
      "text": "Track User Sources & Journeys"
    },
    {
      "level": "H3",
      "text": "Explore Top Pages, Subdomains, and Subfolders"
    },
    {
      "level": "H3",
      "text": "Generate Audience Insights"
    },
    {
      "level": "H3",
      "text": "Track Competitor Web Traffic Globally"
    },
    {
      "level": "H2",
      "text": "Take Competitor Analysis a Step Further"
    }
  ],
  "author": ""
}