{
  "url": "https://www.semrush.com/blog/backlink-network-graph/",
  "slug": "backlink-network-graph",
  "title": "Get a Bird’s Eye View of Any Website’s Link Network",
  "description": "Save time analyzing backlinks with the Semrush Network Graph.",
  "content": "When you look for backlink opportunities, do you sometimes spend hours going through dozens or hundreds of links? While slow and steady often wins the race, sometimes you need a shortcut to see the big picture. Now, you can have one! It’s on Semrush and it's called the Network Graph. Use it to examine any website’s link profile and gauge its value in seconds.Here’s what it looks like:You can quickly spot any potential problems in the backlink network, such as private blog networks (PBNs) or link schemes. Plus, you can see how many backlinks pointing to the queried domain are highly relevant to your niche. You won’t need to spend hours investigating backlinks, and you won’t need to comb through rows of data. Instead, you can get the full impression in seconds.This graph will come in handy when: You want to save time while investigating a website’s authority and connections. You need a visual aid to help show someone their domain’s network of referring domains. You want to find niche-specific backlink opportunities. You want to discover the 2nd and 3rd-tier of links that link to your referring domains. You need insight into a site’s link health or potential connections to a PBN or link scheme.How Does the Semrush Network Graph Work?To bring you this Network Graph, Semrush studies its Backlink Analytics data in a few steps.First, Semrush analyzes the most significant links for the domain you put in the search bar. We do this by gathering every referring domain’s Authority Score and the frequency of sending links to other sites. The more links to your site, the more significant this referring domain is.In this step, Semrush analyzes up to 12 first-tier links, 10 second-tier links, and 8 third-tier links for every site in the network. This means your Network Graph could have a total of 960 websites identified (12x10x8=960). Next, Semrush determines if the link network is “moderate,” “relevant,” “reputable,” or a “toxic network.” This conclusion comes from analyzing the health and relevancy of the domains found in the network.The more niche-relevant backlinks, the more reputable the network. The most niche-relevant sites will be marked green. You’ll also see a percentage score telling you what percentage of the sites in the network are considered highly relevant. How to Analyze a Website’s Link Network When you look at a Network Graph, you can get an idea of the backlink profile’s quality in a few seconds. Then, you can dive deeper by clicking on the points in the web or the list of domains on the right. For your first impression, here are the main signals to follow: Larger dots indicate sites with a high Authority Score, meaning they likely have lots of backlinks and trust in the eyes of Google. Smaller dots are less authoritative. Green dots indicate sites that are highly relevant to your niche. Red dots indicate sites that are potentially a part of a manipulative link scheme. A large green dot is a big authority in your niche. A small green dot is a smaller niche site that has topical relevance. A large gray dot is a big authority without a direct topical relevance. A small gray dot isn’t a huge authority and also isn’t a topical authority in your niche, but it's still a healthy backlink A small red dot is a potentially dangerous link due to signs of a link scheme. A cluster of red dots could be a link scheme like a private blog network PBN. A spread-out web of mostly green links is a sign of an overall healthy network. A web with multiple clusters of red links is a sign of a potentially dangerous network.Wondering what these different networks might look like? Here are three examples.Example 1: A reputable link graphThis domain’s network is considered reputable because of the high authority of referring domains and the fact that 42% of those domains are relevant to its niche. If you are in the same niche as this site and considering it for link building outreach, the graph tells us it's a great target.Example 2: A suspicious link graphThis domain’s network is considered suspicious because of the lack of high authority referring domains and the possible connections to link networks. This graph tells us to be wary of connecting your site to this site. Remember, engaging in link schemes goes against Google’s spam policies and will not help your SEO. Example 3: A moderate link graphThis domain’s network is considered moderate. It has some high authority referring domains, but it also has some connections to potential link networks and a lower percentage of niche-relevant links (29%). If you’re considering it for a link building opportunity, it could be a good connection–probably just not as good as a graph like our first example. What Can You Do With a Network Graph?There are countless ways to use this report. But in general, it makes it easier for you to: Gauge the link building power of a domain with a bird’s eye view Spot a website’s most niche-relevant links Understand if a website is a good outreach prospect based on its network Identify PBNs or link schemes in your niche (so you can stay away) Discover domains that are linking to your backlinks or your competitor’s backlinks (second and third--tier links)Finding Prospects in Your Competitor’s Network GraphOf course, competitive backlink analysis is a great way to find link building opportunities for your own site. The Network Graph report aims to make it easier to find the best opportunities faster.How? All you have to do is enter your competitor’s site into the report and look through all of the green dots. These are the sites that are most relevant to your competitor’s niche (and hopefully yours, too). Why are relevant links so important? When Google evaluates links for SEO weight, it looks at the context of the link as well as the authority of the link.Let’s imagine you’re in the tourism industry in Florence, Italy, and you’re looking to build relevant backlinks. We’ll look at two types of prospects: a large website with high authority, and a smaller site with more topical relevance.This first website is widely popular with an Authority Score of 89, meaning it has a lot of powerful backlinks. However, the site also has nearly one million outbound links from its domain to other domains. In other words, it’s not that rare to get a link from this site.On the other hand, here’s the graph of a more niche-focused site. This site is a travel blog all about things to do in and around Piedmont, Italy. While it only has an Authority Score of 30, it has a highly relevant network graph and is linking out to less than 600 domains. That means that any link from this domain must be highly relevant to its niche: tourism and Italy. So a link to your tourism site from the niche site would likely be more valuable than a link from the larger, more general one.See the Big Picture, FasterLink building is a huge part of SEO, and there are endless ways to go about your research. You’ll want to dive deep with competitive backlink analysis, but you’ll also want to step back and see the big picture.With a visual aid like this Network Graph, seeing that big picture can be done a lot faster.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Analyze Any Website’s Backlink Network"
    },
    {
      "level": "H2",
      "text": "How Does the Semrush Network Graph Work?"
    },
    {
      "level": "H2",
      "text": "How to Analyze a Website’s Link Network"
    },
    {
      "level": "H3",
      "text": "Example 1: A reputable link graph"
    },
    {
      "level": "H3",
      "text": "Example 2: A suspicious link graph"
    },
    {
      "level": "H3",
      "text": "Example 3: A moderate link graph"
    },
    {
      "level": "H2",
      "text": "What Can You Do With a Network Graph?"
    },
    {
      "level": "H2",
      "text": "Finding Prospects in Your Competitor’s Network Graph"
    },
    {
      "level": "H2",
      "text": "See the Big Picture, Faster"
    }
  ],
  "author": ""
}