{
  "url": "https://www.semrush.com/blog/bad-seo-practices/",
  "slug": "bad-seo-practices",
  "title": "7 Bad SEO Practices & How to Avoid Them",
  "description": "Bad SEO hurts your search engine visibility. Here are some common bad SEO tactics and how to avoid them.",
  "content": "SEO can improve your website’s rankings in search engines like Google. Earning you more traffic, more clicks, and more conversions. But bad SEO can hurt your search engine rankings and visibility. Losing you time and money. Luckily, bad SEO is within your control. To stop it from damaging your website’s rankings and reputation, learn about these seven common bad SEO practices. And how you can fix or avoid them. But first, let’s define bad SEO and its consequences.What Is Bad SEO?Bad SEO is any practice that hurts your rankings, provides a poor user experience (UX), or goes against Google’s guidelines. These are often outdated SEO practices.But bad SEO can also be accidental. Like your site having lots of duplicate content you didn’t know about.Or, intentional. Like trying to exploit a search engine algorithm through unethical techniques. What Are Unethical SEO Techniques?Unethical SEO techniques are practices used to improve your website’s rankings that violate search engine guidelines. These practices are used to manipulate a search engine’s algorithm.Alternatively, ethical SEO techniques are practices used to improve your website’s rankings that follow search engine guidelines.Trying to exploit loopholes in a search algorithm will likely catch up with you. As search engines evolve, unethical SEO is becoming easier to spot. And the penalties for getting caught often aren’t worth the risk.What Is a Google Penalty?A Google penalty (also known as a manual action) can happen when the search engine determines your site isn’t following its search policies. Basically, it’s a punishment if Google thinks you’re using unethical SEO practices. Google has strict guidelines on technical requirements, spam policies, and best practices. Your ability to rank well in Google—or even appear in the search results at all—depends in part on adherence to these policies. A Google penalty can be incredibly harmful to your business. And should be avoided at all costs. 7 Bad SEO Practices & How to Avoid ThemFamiliarize yourself with these common SEO mistakes and learn how to steer clear of them. 1. Low-Quality Content High-quality content is one of the cornerstones of SEO. So, naturally, poor content can translate to bad SEO. Producing low-quality content in an effort to save time or money will likely accomplish the opposite. It can lead to poor search rankings, low conversions, and a hit to your brand’s reputation. A piece of content may be low quality if it: Isn’t original Doesn’t answer the user’s search query (i.e., what they typed into Google before landing on your page) Doesn’t back up claims with facts and citations Has numerous grammatical or spelling errors Has poor readability Lacks E-E-A-TE-E-A-T stands for Experience, Expertise, Authoritativeness, and Trustworthiness. It’s especially important in “Your Money or Your Life” (YMYL) content—like health and financial advice—which has the potential to affect someone’s livelihood. E-E-A-T isn’t an official ranking factor. But it is part of Google’s Search Quality Rater Guidelines. This is a handbook Google’s Quality Raters use to assess content. How to Avoid Low-Quality ContentTo avoid publishing low-quality content, you need to produce high-quality content that's: Accurate Relevant Readable Useful Satisfying search intent Grammatically correct Credible (demonstrating strong E-E-A-T)This type of content is relevant to both your site and your audience. To brainstorm relevant content ideas, open Semrush’s Topic Research tool.Enter a word or phrase within your site’s niche. Then, click “Get content ideas.”This will generate a list of potential subtopics for you to write about.Click “Show More” to get a list of possible headlines, questions, and related searches. Use this tool to explore topics audiences are searching for and how you can address them. High-quality content is all about meeting the user’s needs. Which starts with the right subject matter. 2. Duplicate ContentDuplicate content refers to pages created with the same content. Or nearly the same, with a few words changed here and there. By nature, duplicate content is unoriginal. And unoriginality can be a marker of low-quality content. There are a few potentially negative consequences of duplicate content, like: Lower page rankings The wrong version of a page showing in Google results Indexing issuesAll of the above can lead to a decline in site traffic. Which can harm your business or website goals.Duplicate content can happen without you realizing it. For example, if you accidentally create a new piece of content on a topic you already have a page about. Or if you publish variations of pages (like separate U.S. and U.K. versions of a page). You can easily find duplicate content on your site using Semrush’s Site Audit tool. Open the tool and click “Create project.”Configure your settings and run an audit on your site.Once your audit is complete, you’ll see an overview of your site’s health. Click over to the “Issues” tab and look for the term “duplicate content.” Here, you’ll see an error notice for any duplicate content issues on your site. Click on the link in the error message to get more details about your duplicate content. Once you’ve found the problem, you can stop it from hurting your SEO. How to Avoid Duplicate ContentThere are multiple ways to prevent duplicate content:Canonical TagsA canonical tag is a snippet of HTML code that signals to Google that a page is the original, even if versions of it exist elsewhere. Google can treat the canonical page as the main page and show that one in its results—rather than other versions of the content. Use 301 Redirects A 301 redirect tells Google a page has been permanently moved. A 301 redirect can be used in various situations, such as moving an existing page to a new URL. 3. Too Many Ads Above the FoldDisplaying too many ads above the fold can negatively impact your site. Ads can be a great way to monetize your site. And placing them front and center where more people are likely to see and click on them is often wise. However, having a “top-heavy” page means you have too many ads above the fold—the part of your website that’s first visible before a user scrolls down. Like this:Top-heavy pages may be punished in search engine rankings. Plus, too many ads above the fold can discourage users from staying on your site. How to Avoid Too Many Ads Above the FoldBalance your above-the-fold ads with non-monetized content. Again—ads above the fold are fine.But users shouldn’t be met with a large block of them upon clicking on your page. Instead, mix ads in with the content they came for. And follow ad placement best practices.For example, avoid these types of ads on desktop displays: Pop-up ads Auto-playing video ads with sound Prestitial ads with countdown Large sticky adsImage Source: Better Ads4. Keyword StuffingKeyword stuffing is the practice of unnaturally loading your content with keywords. This practice makes content appear unnatural and difficult to read for users. And it can result in a manual action from Google. It’s an outdated SEO practice that was once commonly used to manipulate the Google search algorithm. But the algorithm has evolved to detect stuffing, and the practice will do your SEO efforts more harm than good. Keyword stuffing sacrifices the quality of a piece of content. Writing for the sake of jamming in keywords is usually apparent. Resulting in lackluster—and sometimes even confusing—content.How to Avoid Keyword StuffingUse keywords naturally in your content. Keywords are a critical component of good SEO. But optimizing a page for keywords should never mean the quality suffers. It comes down to how you use keywords. Not how many keywords you use. Or how many times you use a specific keyword. The important thing is to use keywords naturally and where they make sense. For example, your target keyword should appear in your page’s: Title Meta description Opening section Body (when it naturally comes up)5. Toxic BacklinksToxic backlinks are backlinks that can harm your website’s visibility in Google results. These potentially harmful backlinks are typically acquired through what Google calls “link spam.”In its link spam guidelines, Google gives the following examples: Buying or selling links Exchanging links for money, goods, services, or samples Excessive link exchanges (“Link to me and I’ll link to you”) Partner pages exclusively for the sake of linking Using automated programs or services to create links to your site Requiring a link as part of a contract Paid ads with optimized links Low-quality directory or bookmark site links Keyword-rich, hidden, or low-quality links embedded in widgets Links in the footers or templates of content that appear on other sites Forum comments with optimized linksHaving links that appear to come from one of these spammy techniques could result in a Google penalty. How to Avoid Toxic BacklinksTo find whether you have bad backlinks, go to Semrush’s Backlink Audit tool. Start a project, configure your settings, then click “Start Backlink Audit.”When your audit is ready, you’ll see a detailed report of your site’s backlink health.Go to the “Audit” tab for a breakdown of sites linking to you.Here, you’ll notice a metric labeled Toxicity Score (TS). TS is a measure of how disreputable a page is that’s linking to you. The higher the TS, the lower the likely quality of that link. And the more potential it has to be harmful. In the “Audit” tab, filter your links by Toxicity Score 60–100.Then, check the boxes on the left-hand side. Next, click the “Remove” button, select “Domain” or “URL,” and add them to your “Remove” list.Go to the “Remove” tab and connect your email. Click the “Send” button next to a link, then write an email requesting link removal. If a website won’t remove the toxic link, your next option is to disavow the link. However, Google only recommends that you disavow links if: You have a considerable number of toxic links Those links have caused a manual action. Or are likely to cause one. NoteThis shouldn’t be your first line of defense. Only resort to disavowing if it’s necessary. And you’ve already tried getting the links manually removed. 6. Content SpinningContent spinning (also called article spinning) is when you take someone else’s piece of content, tweak it slightly, then publish it on your own site. Basically, it’s thinly veiled plagiarism. So even if you’re clever about changing words here and there, publishing spun content can harm your SEO. How to Avoid Content SpinningAvoid content spinning by only publishing original content. To get ahead of your competitors, there are two approaches you can take: Get inspired by competitor content: Look at what competitors are producing to get inspiration for your own content. Then, find ways to approach the topics from new angles. Or, take a similar approach but add value where the competing piece is lacking. Take advantage of competitors’ content gaps: If you’re pressed for content ideas, look for gaps in your competitors’ strategies and create content that’s ahead of the competition To find competitive content ideas, use the Keyword Gap tool.Enter your website’s domain and up to four competitors’ domains. Then click “Compare.”This will generate a comparison report between you and your competitors’ keyword targeting. Scroll down to the detailed keyword report. Click over to the “Missing” tab to learn what keywords your competitors—but not you—are ranking for. 7. Over-Optimized Anchor TextAnchor text is the clickable text that’s connected to a link. Here’s an example of a link where “rankings on Google” is the anchor text. Links help Google crawl and index your site. By leading crawlers from one page to another relevant page. And anchor text also helps those crawlers understand what the linked-to page is all about. Anchor text is similarly important for the user experience. It directs users to relevant resources. And lets them know what to expect if they click on the link.But some SEOs misuse anchor text by over-optimizing it. Over-optimized anchor text is stuffed with keywords in an attempt to rank the linked page higher for those keywords. Here’s an example from Google of over-optimized anchor text:These anchor texts are keyword-rich terms—and vague. They rely on using high-value keywords at the expense of the user experience. They don’t clearly indicate what’s on the other side of the link. How to Avoid Over-Optimized Anchor TextTo avoid over-optimized anchor text, follow anchor text best practices, like: Be descriptive but concise Only link where a link is relevant Make it clear what’s being linked to Don’t stuff anchor text with keywords Use natural languageRemember that Google guidelines are meant to improve the user experience. So, first think of how links and their anchor text benefit the user. Rather than how it appears to Google crawlers. Safeguard Your Digital PresenceThis is only a handful of bad SEO practices. Ultimately, the best way to avoid bad SEO is to follow SEO best practices. But mistakes still happen. The key?Catching them in time and fixing them quickly. So your website’s rankings, traffic, and profits don’t suffer. To stop bad SEO in its tracks, regularly use the Site Audit tool and make adjustments to maximize your returns on SEO efforts.",
  "headers": [
    {
      "level": "H1",
      "text": "7 Bad SEO Practices & How to Avoid Them"
    },
    {
      "level": "H2",
      "text": "What Is Bad SEO?"
    },
    {
      "level": "H3",
      "text": "What Are Unethical SEO Techniques?"
    },
    {
      "level": "H3",
      "text": "What Is a Google Penalty?"
    },
    {
      "level": "H2",
      "text": "7 Bad SEO Practices & How to Avoid Them"
    },
    {
      "level": "H2",
      "text": "1. Low-Quality Content"
    },
    {
      "level": "H3",
      "text": "How to Avoid Low-Quality Content"
    },
    {
      "level": "H2",
      "text": "2. Duplicate Content"
    },
    {
      "level": "H3",
      "text": "How to Avoid Duplicate Content"
    },
    {
      "level": "H4",
      "text": "Canonical Tags"
    },
    {
      "level": "H4",
      "text": "Use 301 Redirects"
    },
    {
      "level": "H2",
      "text": "3. Too Many Ads Above the Fold"
    },
    {
      "level": "H3",
      "text": "How to Avoid Too Many Ads Above the Fold"
    },
    {
      "level": "H2",
      "text": "4. Keyword Stuffing"
    },
    {
      "level": "H3",
      "text": "How to Avoid Keyword Stuffing"
    },
    {
      "level": "H2",
      "text": "5. Toxic Backlinks"
    },
    {
      "level": "H3",
      "text": "How to Avoid Toxic Backlinks"
    },
    {
      "level": "H2",
      "text": "6. Content Spinning"
    },
    {
      "level": "H3",
      "text": "How to Avoid Content Spinning"
    },
    {
      "level": "H2",
      "text": "7. Over-Optimized Anchor Text"
    },
    {
      "level": "H3",
      "text": "How to Avoid Over-Optimized Anchor Text"
    },
    {
      "level": "H2",
      "text": "Safeguard Your Digital Presence"
    }
  ],
  "author": ""
}