{
  "url": "https://www.semrush.com/blog/bakery-website-content-plan/",
  "slug": "bakery-website-content-plan",
  "title": "SEO for Small Business: How to Make Keyword-Focused Content",
  "description": "Want to learn how to create a thoughtful content strategy for your website? Take a look at how one agency did just that for a small local bakery.",
  "content": "In the last episode of SEO Reality Show, we covered how one marketing agency went about selecting the most relevant and competitive content topics for their client Edelweiss’ blog. In this episode, we will share how that agency then built a keyword-optimized content marketing plan. Are you ready to learn more? Let’s get started! Challenge: choosing the optimal content planning strategy in terms of time and budget.Step 1. Turning Content Topics into Keyword OpportunitiesWith the prep work of researching and making a targeted topic list done, the agency had to assess which of their selected topics would generate the most high-volume keywords that they could then use in optimized content for the Edelweiss Bakery site. But, how did the agency go about determining what would make a perfect main keyword? They used Semrush’s keyword research tools, which provided them with valuable keyword performance insights. These insights helped the agency craft not only the content creation strategy but also the content deployment strategy as well.Let’s take a look at two real examples of how the agency used their expertise, their targeted topic list, and Semrush’s tools to make some important keyword discoveries.Targeted Topic Example #1: Liverwurst In the process of reviewing their chosen bakery-related content topics, the agency noticed that many searchers seemed to be making liverwurst-related queries. Sensing a possible opportunity to craft content around liverwurst-related keywords, the agency tapped into Semrush’s Keyword Magic Tool to assess if there were any adjacent “liverwurst” keyword opportunities that they could use to further optimize their content. They started by entering “liverwurst sandwich” into the tool to see if it was a high-volume keyword they could use to build blog content around. Does “liverwurst sandwich” seem like a potentially valuable keyword for the Edelweiss blog? The Keyword Magic Tool revealed that there were in fact adjacent keyword opportunities around “liverwurst sandwich.” The Keyword Magic Tool also revealed that the first possible keyword they identified, “liverwurst sandwich,” did have a relatively high monthly search volume of 2,900, and a relatively low keyword difficulty rating of 43. The first associated keyword “liverwurst sandwich recipe” that the Keyword Magic Tool identified had a lower monthly search volume of 110, but it also had a slightly lower keyword difficulty score of 42 — meaning that if the agency decided to use that keyword to optimize content around, they might have a slightly easier time of getting that content to rank in Google over “liverwurst sandwich.”So, the agency decided to take a deeper look at their options. They plugged “liverwurst sandwich” into the Keyword Overview Tool, and were able to see that 9 out of 10 results for “liverwurst sandwich” were actually recipes. This meant that the agency could potentially craft a compelling, keyword-optimized liverwurst sandwich recipe blog and other content around the topic of liverwurst. The Semrush keyword research tools revealed that liverwurst was definitely a worthwhile content topic for the agency to explore. Analyzing the search engine page results using the Keyword Overview ToolTargeted Topic Example #2: TunaUsing the same process as the example above, the agency discovered that there were a large number of queries around the topic of tuna, so they started by plugging “tuna sandwich” into the Keyword Magic Tool. The tool showed that there were four similar/adjacent keywords that the agency could consider optimizing content around: “tuna sandwich” — the highest volume, but also the most competitive “tuna sandwich recipe” — optimal volume and optimal complexity “how to make tuna sandwich” — high difficulty, low volumeOnce again, the Keyword Magic Tool provided an in-depth analysis of the search landscape around the agency’s chosen topics and potential keywords. With help from the Keyword Magic Tool, the agency was able to see that if they decided to build tuna-related content, “tuna sandwich recipe” had an ideal mix of good monthly search volume and low keyword difficulty score. They could also see that the adjacent keyword opportunities were virtually endless. A more complex version of determining what keywords to selectStep 2. Deciding on a Content Deployment StrategySo, with the help of the keyword research tools, the agency had identified a number of keywords they could potentially use in optimized content on Edelweiss’ site. By knowing the monthly search volume and difficulty of ranking for these potential keywords, they could begin to build a content deployment strategy. However, before they started building that strategy, they asked for Edelweiss’ input. The agency proposed two content deployment strategy options to the bakery: Divide up and evenly distribute the high-volume keywords between each month’s content calendar, which would offer a near-equal keyword search volume level month-over-month. Split the content calendar up so that the content optimized for the keywords with the highest search volume would be written and published in the first months of the agency’s contract with Edelweiss. This would mean that the keyword search volume of the content calendar would wane as the months went on.The bakery decided that the second approach was the best choice for their business. Because content strategy and implementation can take a very long time to yield results for most businesses, the bakery wanted the agency to prioritize content optimized for high-volume keywords first. This way, the business could begin seeing increased traffic to their site in the immediate term of their contract. Step 3. Creating a Long-Term Content Plan1. Dividing up the Keywords The agency put all of the potential keywords they identified into a Google sheet. From there, they distributed these keywords between each month of their contract, ensuring that there was a mix of high- and low-volume keywords for each month. They front-loaded the first months of the content calendar with a greater proportion of high-volume keywords, just as the client had asked them to do. Dividing the topics into monthly clusters2. Checking the Quality of the Content Calendar Once the agency assigned all of the proposed keywords to a specific month, they continued to optimize and organize the monthly keyword clusters, acknowledging through their organization that seasons and weather play a role in how people eat (and how they search). Their calendar was also optimized to provide readers a balance of potential topics. Here is the six-month content calendar the agency created. 3. Automating the WorkflowFor content planning, the agency used an internal CRM optimized to their internal workflow and processes. Tooltip: To organize your publication calendar, you can use a regular Google Sheet, a Trello Board, or Semrush’s Marketing Calendar, which allows you to set up technical specifications and control the timing of your writing and the quality of the finished content. This is especially useful if you work with copywriters directly.Creating a content preparation calendar together with SemrushNext upSo, after all was said and done, the agency had crafted a calendar with six months’ worth of potential keywords to target for their client — at an impressive output of 14 keyword-optimized pieces per month. In the next episode, we will walk you through how the agency makes their final keyword selections and prepares technical assignments for the copywriters in charge of Edelweiss’ blog. It will be an episode you won’t want to miss!Infographic - Building a Keyword-Targeted Content Strategy",
  "headers": [
    {
      "level": "H1",
      "text": "How One Agency Built a Keyword-Targeted Content Strategy for Their Client"
    },
    {
      "level": "H2",
      "text": "Step 1. Turning Content Topics into Keyword Opportunities"
    },
    {
      "level": "H3",
      "text": "Targeted Topic Example #1: Liverwurst"
    },
    {
      "level": "H3",
      "text": "Targeted Topic Example #2: Tuna"
    },
    {
      "level": "H2",
      "text": "Step 2. Deciding on a Content Deployment Strategy"
    },
    {
      "level": "H2",
      "text": "Step 3. Creating a Long-Term Content Plan"
    },
    {
      "level": "H3",
      "text": "1. Dividing up the Keywords"
    },
    {
      "level": "H3",
      "text": "2. Checking the Quality of the Content Calendar"
    },
    {
      "level": "H3",
      "text": "3. Automating the Workflow"
    },
    {
      "level": "H2",
      "text": "Next up"
    },
    {
      "level": "H2",
      "text": "Infographic - Building a Keyword-Targeted Content Strategy"
    }
  ],
  "author": ""
}