{
  "url": "https://www.semrush.com/blog/becoming-a-copywriter/",
  "slug": "becoming-a-copywriter",
  "title": "How to Get Started As a Copywriter [Research]",
  "description": "Copywriting uses the written word to persuade your audience. Explore this guide to building a copywriting career: learn about the top skills, responsibilities, and salary benchmarks.",
  "content": "Copywriting has a lot going for it as a career choice. You can work across many industries, flex your creative muscle, work from anywhere, and get a good paycheck at the end of the month. So, how can you get started as a copywriter? This article is a step-by-step guide to building a copywriting career based on our analysis of 400+ copywriter job postings on Indeed.com. You’ll learn everything you need to know about: What copywriting is What a copywriter does The skills and qualities that a copywriter needs How to become a copywriter What a copywriter gets paid Are you sitting comfortably? Then let’s get started! What Is Copywriting? Let’s kick off with a quick definition of copywriting: Copywriting is the art (or science) of using the written word to persuade, inform, or sell to your audience. You can find it in a variety of mediums, from newsletters to trade brochures to infomercials, and much more.The most effective copy draws on psychology, linguistics, and a deep understanding of the target audience.Copywriting is used in almost every industry. For businesses, it is an essential part of marketing, advertising, and sales. What Is a Copywriter?A copywriter is a professional writer who specializes in persuasive writing and creates copy for various marketing materials. They put together all the headlines, adverts, product descriptions, and slogans that surround us. They may work in-house, freelance, or even as consultants. What Is the Difference Between a Copywriter and a Content Writer?Copywriters usually work closely with other advertising or marketing professionals. However, don’t make the mistake of confusing copywriters with content writers. There is a lot of overlap in copywriting and content writing skills. The key difference can be boiled down to this: Content writers create content that is designed to inform or educate (blogs, articles, case studies, white papers etc.) Copywriters create content that is designed to persuade or sell (adverts, slogans, emails, taglines, etc.) Let’s take a look at a copywriter’s day to day. What Does a Copywriter Do? The main function of a copywriter is—surprise, surprise—writing copy. But there’s a whole lot more to the job than sitting down at your computer and dashing off a few slogans. Within our job market analysis in the State of Content Marketing: 2023 Global Report we looked at a breakdown of copywriting job descriptions. These were the top copywriter responsibilities: A copywriter’s day-to-day tasks will depend on a few things, e.g., what kind of copy they write, what kind of project(s) they’re working on, etc. Let’s explore some of these roles in more detail:Meeting Clients and Team MembersCopywriters need to have a clear understanding of their clients’ (or team members’ if it’s an in-house role) goals and requirements at the start of a project. They will establish objectives, target audiences, channel strategy, deadlines, brand tone of voice, and lots more. Doing ResearchWhether it’s audiences, products, or the competition, copywriters will need the kind of in-depth knowledge of these areas that only comes from research. What copywriters learn at this stage helps them understand the needs, challenges, goals, and objections of their target buyers.Ultimately, research helps writers produce persuasive writing that resonates with their audience, creates an emotional connection and helps them rationalize their purchase.Brainstorming Concepts This is the most collaborative part of the role, where copywriters work alongside advertising executives and brand managers to nail down creative concepts. WritingOnce the clients have communicated their needs, the competition has been researched and the concept has been determined, it’s time for a copywriter to start writing! Copywriters work across various marketing channels, such as email, print and digital social media, some product-focused blog posts, and email marketing.EditingIn copywriting departments and agencies, colleagues will often check one another's work. Freelancer writers might not have an external editor, so they’ll check their own work before sending it out. Either way, editing and proofreading are an important part of being a successful copywriter, making sure that every word is perfect. Keeping Up to Date with TrendsTo be competitive, stay in demand, and provide the best service, professional copywriters need a solid understanding of current marketing principles and techniques.So, it’s essential to keep up to date with marketing trends and new industry technologies. On any given day, copywriters will find that their tasks are a mix of creative, analytical and collaborative. The Key Skills and Qualities of a CopywriterSo, what are the key skills and qualities necessary for success in the field of copywriting? Get out your notepad—it’s a long list!Here were the top 10 copywriting skills in 2023, according to our research:Let's explore some other important skills in detail.Writing SkillsCopywriters need to have an excellent command of language to write clear, compelling copy. The good news? You don’t need a degree to be a good copywriter. The most important thing you can do to develop your writing skills is to practice writing as much as possible on a broad range of topics. But if you are going to be working in-house, it’s worth noting that most companies want some degree-level qualification. Research SkillsYou’ve got to have a solid understanding of what you’re writing about. So, research skills are important. You need to be able to read and research your topic, absorb the information and then use that knowledge to inform your copy. Like writing, research is a skill that you can hone through lots of practice. Communication SkillsWhen you’re dealing with clients, collaborating with colleagues, or getting feedback from an editor, you need to be able to communicate effectively to do your best work. SalesWhen learning copywriting, it’s also a good idea to dive into sales techniques. Good sales representatives understand how to tell the story, connect with the customer, and spark them into action. As an online copywriter, you’ll have to do the same—only you won’t be talking to potential clients face to face. The Qualities of a Good Copywriter Whether you want to hire copywriters or actually become one yourself, it’s worth thinking about their qualities:CreativityWhen it comes to copywriting, creativity really separates the wheat from the chaff (or humans from AI!) You need to be able to come up with original ideas and new angles which will grab your audience’s attention. Taking a creative approach to each campaign will help you to craft engaging and compelling copy. OrganizationCopywriters will often find themselves juggling different projects at different stages. You might be researching one project, writing copy for a different client, and editing copy for another campaign. So, it’s crucial to be organized and methodical. Strong time management skills will help you to meet your deadlines successfully, and keep your clients and colleagues happy! CuriosityTo write well about something, you need to learn about it first. You’ll be working across lots of different industries, so if you are genuinely interested, you’ll be more motivated to do a deep dive into your topic and learn everything you can.It will also help you to stay up to date with emerging trends and tech. An enquiring mind will stand you in good stead, and help you to make the most of every project and campaign. AdaptabilityWhile it’s a good idea to develop your own niche where you’re a copywriting expert (more on that later) it’s also important to remain adaptable. Long term, you’ll want to work over lots of different forms of content, as well as write about different industries. After all, variety is the spice of lif—and it’ll keep your career interesting. A Growth MindsetEvery campaign is an opportunity to learn something. So, it’s important to have a growth mindset as a copywriter. It will help you to accept constructive criticism, make changes to your work, learn from feedback and improve your skill set with every project.If that sounds like you, then you’ll be well suited to a career in copywriting. So, how do copywriters get started? Different Types of Copywriting JobsOnce you’re ready to launch yourself as a professional copywriter, you have three different options: Working as an in-house copywriter Working for a marketing agency Working as a freelance copywriter Let’s take a look at the ins and outs of each different type of work situation. In-house Copywriting If you have specialist knowledge of a particular subject (for example a background in healthcare) then in-house copywriting could suit you down to the ground. It offers the security of a permanent contract, and you’ll be able to become an expert in the product or services that your company offers. Agency Copywriting In some ways, agency copywriting offers the best of both worlds. You’ll have financial security and the benefits of a permanent contract (hello paid holidays). But you’ll also get to work with a wide range of clients and take part in lots of different campaigns, so you won’t get bored easily. What’s more, agency work gives you lots of opportunities to learn and grow from your colleagues, as you’re all working in the same field. Freelance Copywriting Freelancing comes with its own risks and rewards. You’ll need to find your own clients. But once you’ve built up your reputation you can choose who you work with, only taking on campaigns that you’re truly excited about. What’s more, when you’re working for yourself, you have lots of flexibility and reap all the rewards. The downside is a lack of job security offered by fixed hours and a contract. How to Find Copywriting Jobs For in-house and agency work, most companies will advertise through the usual channels and job recruitment websites. LinkedIn is a good place to check for and apply for copywriting openings. You’ll need an up-to-date CV of your writing experience, as well as other relevant experience you might have. For example, if you’re applying for a job as a copywriter at a fintech company, and you have a financial background, that’s definitely worth including. You’ll also need to put together a writing portfolio. Select your best pieces of work, and try to include a good variety of styles and mediums, so that employers can get a sense of the quality and range of your work. Finding Freelance Copywriting ProjectsIf you’re tempted to go down the freelance route, you might be wondering where to find copywriting clients. Here are the most usual sources: NetworkingBuilding a strong professional network will be of immense help to you in getting your first few clients, but it can be tricky to know how. Attend local conferences and industry events, and make an effort to chat to people during breaks. Prepare a quick introduction beforehand to make introducing yourself easier, and don’t forget a business card. Remember to connect with people afterwards via LinkedIn.ReferralsOnce you’ve done your first few projects, tell your clients that you’re looking for more work. They’ll be happy to refer you to business contacts if you’ve provided them with a great service. Make sure to be clear about the kind of clients and projects you’re looking for—that way referrals will lead to useful connections. Freelance MarketplacesCheck out freelance marketplaces like Upwork or Fiverr. Once you’ve created a profile and uploaded your writing portfolio, you’ll be able to submit proposals for jobs that interest you. You can set your own rates and negotiate with clients. Marketing AgenciesIf you aren’t having much luck finding clients, approach a marketing agency. They often work with freelancers. You won’t be able to charge as much because the agency takes a cut—they have to cover overheads, sales costs and account management costs.It’s a good way of gaining experience and reducing your own workload—for example, you won’t have to deal with the ins and outs of contract negotiation. This approach can also add to your portfolio at the beginning of your freelance career.Once you’ve started finding clients and putting together proposals, you might be wondering what to charge for your services. Don’t worry, the next section has you covered.Copywriting Salaries and Rates Copywriting salaries will vary according to where you are. Agencies in big urban cities like London and New York will pay more than an in-house copywriting job in a small town. That being said, lots of copywriting roles now have the option of remote or hybrid work, so depending on where you apply, you might see a big difference in salary. In-house Copywriter SalariesOur research shows that almost 2 in 5 copywriting jobs are now advertised as either remote or hybrid. However, the majority are still in-office roles. Salaries vary quite dramatically based on experience and seniority. The average copywriter salary across all positions is around $68,000 in the US in 2024. Freelance Copywriter RatesFreelance copywriting rates are a bit more complicated. If you’ve decided to go down the freelance route, you’ll have to figure out what you need to charge. Too low, and you’ll risk underselling yourself. Too high, and you might lose potential work to other writers charging a lower rate. There’s a rough way to figure it out, dividing your ideal annual income by the number of days you think you can sell in a year. For example: Your ideal annual income: $50,000 (before tax) The days you can sell in a year: 100 Your daily rate: $500Hourly rates go from $19 upwards, depending on the industry, location (yours and the client), your experience, and turnaround time. Don’t forget to charge for the time you’ll spend communicating with the client at the start of the project, and the time you’ll spend doing revisions and making changes based on client feedback. Final ThoughtsCopywriting is a rewarding, flexible career. Not only does it pay well, but it has room for creativity. You’ll also have the chance to work in a number of different contexts—in-house, freelance, or freelance with an agency. Even better, it doesn’t matter if you're fresh out of school or already have a 20-year career behind you. You can learn the ropes and use your industry experience to your advantage. Be sure to build a portfolio, have clear objectives and financial expectations—and start networking. Good luck and get writing!Learn more about the art of copywriting and content marketing trends in the State of Content Marketing Global Report 2023.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Get Started As a Copywriter [Research]"
    },
    {
      "level": "H2",
      "text": "What Is Copywriting?"
    },
    {
      "level": "H2",
      "text": "What Is a Copywriter?"
    },
    {
      "level": "H2",
      "text": "What Is the Difference Between a Copywriter and a Content Writer?"
    },
    {
      "level": "H2",
      "text": "What Does a Copywriter Do?"
    },
    {
      "level": "H3",
      "text": "Meeting Clients and Team Members"
    },
    {
      "level": "H3",
      "text": "Doing Research"
    },
    {
      "level": "H3",
      "text": "Brainstorming Concepts"
    },
    {
      "level": "H3",
      "text": "Writing"
    },
    {
      "level": "H3",
      "text": "Editing"
    },
    {
      "level": "H3",
      "text": "Keeping Up to Date with Trends"
    },
    {
      "level": "H2",
      "text": "The Key Skills and Qualities of a Copywriter"
    },
    {
      "level": "H4",
      "text": "Writing Skills"
    },
    {
      "level": "H4",
      "text": "Research Skills"
    },
    {
      "level": "H4",
      "text": "Communication Skills"
    },
    {
      "level": "H4",
      "text": "Sales"
    },
    {
      "level": "H3",
      "text": "The Qualities of a Good Copywriter"
    },
    {
      "level": "H4",
      "text": "Creativity"
    },
    {
      "level": "H4",
      "text": "Organization"
    },
    {
      "level": "H4",
      "text": "Curiosity"
    },
    {
      "level": "H4",
      "text": "Adaptability"
    },
    {
      "level": "H4",
      "text": "A Growth Mindset"
    },
    {
      "level": "H2",
      "text": "Different Types of Copywriting Jobs"
    },
    {
      "level": "H3",
      "text": "In-house Copywriting"
    },
    {
      "level": "H3",
      "text": "Agency Copywriting"
    },
    {
      "level": "H3",
      "text": "Freelance Copywriting"
    },
    {
      "level": "H2",
      "text": "How to Find Copywriting Jobs"
    },
    {
      "level": "H3",
      "text": "Finding Freelance Copywriting Projects"
    },
    {
      "level": "H4",
      "text": "Networking"
    },
    {
      "level": "H4",
      "text": "Referrals"
    },
    {
      "level": "H4",
      "text": "Freelance Marketplaces"
    },
    {
      "level": "H4",
      "text": "Marketing Agencies"
    },
    {
      "level": "H2",
      "text": "Copywriting Salaries and Rates"
    },
    {
      "level": "H3",
      "text": "In-house Copywriter Salaries"
    },
    {
      "level": "H3",
      "text": "Freelance Copywriter Rates"
    },
    {
      "level": "H2",
      "text": "Final Thoughts"
    },
    {
      "level": "H6",
      "text": "Most popular pages"
    },
    {
      "level": "H6",
      "text": "SEO Checklist: 41 Tips to Optimize Your Website"
    },
    {
      "level": "H6",
      "text": "How to Perform a Complete SEO Audit (in 14 Steps)"
    },
    {
      "level": "H6",
      "text": "A Beginner’s Guide to Keyword Search Volume"
    }
  ],
  "author": ""
}