{
  "url": "https://www.semrush.com/blog/best-social-media-campaigns/",
  "slug": "best-social-media-campaigns",
  "title": "8 Best Social Media Campaigns To Inspire You in 2024",
  "description": "Learn from eight of the best social media campaigns and build lasting relationships with your audience.",
  "content": "A social media campaign is a marketing approach brands use to promote their products and services on social media platforms.Successful social media campaigns increase brand awareness, express your company’s personality, and encourage loyalty. They can be one-off or long-term marketing efforts.In this article, we’ll cover eight of the best social media campaigns from recent years. Including takeaways for small businesses without huge budgets and endless resources.1. Warner Bros. BarbieVariety reported that Warner Bros. spent $150 million on marketing for the studio’s 2023 Barbie movie. Even though this number is staggering (and more than the $145 million budget used to produce the movie itself), any brand can use the studio’s “breadcrumb strategy” to stimulate conversation on social media.Simply stagger your content to entice people over a longer period of time.The Barbie movie’s first teaser trailer was released more than a year in advance, and generated around four million engagements on social networks.Image source: ComscoreBut the second trailer shot to #28 on YouTube's Trending videos in under 24 hours and generated 18 million social media engagements.While the second trailer continued to climb in views, the Barbie marketing team created a free AI-powered selfie-generator tool. Users could create personalized versions of the movie posters. Then share them on social media for more free word-of-mouth marketing.Even celebrities like Zooey Deschanel got involved.This image generator gave the studio the same benefits of influencer marketing for no extra effort. People were seeing big names effectively promote the movie.The resulting memes, movie stills, and user-generated content (UGC) from the public who saw the crew filming scenes also created a buzz on social channels. Each piece of content became a “breadcrumb”.For example, Margot Robbie and Ryan Gosling were spotted filming in Los Angeles and social media users were sure to post the hot gossip. This behind-the-scenes stream of content only added to the intrigue of the storyline.Warner Bros. President of Global Marketing Josh Goldstine joked, “Someone took a picture of a pink sunset and thanked the work of the Warner Bros. marketing department.”Through their breadcrumb strategy, Barbie’s team created a prolonged, highly-impactful social media campaign.What you can do: Spark curiosity and build anticipation for your main campaign. The key is to strategically plan and schedule your content breadcrumbs well in advance. Luckily, Semrush's Social Poster tool empowers you to do just that. The intuitive calendar interface makes it easy to draft, schedule, and publish content across multiple platforms. You can even experiment with different posting times to see what resonates best with your audience. This ensures that each breadcrumb leaves a lasting impression.2. Dove’s Real BeautyBack in 2004, Dove launched the Dove Campaign for Real Beauty, a first-ever campaign to post a diverse range of regular women on its marketing materials instead of models. Decades later, this strategy is still holding strong and has helped the brand grow their social following.Using real bodies elicits an emotional response, advocating the message that true beauty comes from within. Dove now runs educational programs like The Self-Esteem Project through social media with the hashtag #DoveSelfEsteemProject.The aim of this social media campign is to help a quarter of a billion young people worldwide feel more confident about themselves by 2030 (and of course to sell more soap).Previous hashtags from the campaign (some still in use) include: #ShowUs: A collection of selfies and UGC from women and non-binary users. #NoDigitalDistortion: Posted under images to prove Dove hasn’t altered bodies and skin in any way. #NoLikesNeeded: Aims to show younger social media users that liking themselves is the only “Like” that counts. #PassTheCROWN: A campaign to end race-based hair discrimination.Dove highlights its overarching values on its Instagram account bio saying, “Let’s change beauty together and help raise self esteem in the next generation.” Since 2004, the beauty brand has showcased only natural women and bodies. And promises never to distort bodies in images.What you can do: Find out what your target audience values and create campaigns around these messages. Semrush’s Audience Intelligence tool allows you to segment your audience and provide a detailed summary of each group.This breakdown can include keywords from user bios, top influencers, most used hashtags, and overall demographic tendencies. Segment your audience as much as possible to target different demographics with each social media campaign.3. Apple’s #ShotOniPhoneApple’s #ShotOniPhone is a long-running campaign that combines UGC with out-of-home advertising. iPhone users can hashtag social media content for the chance to have their photo featured on an Apple billboard.Below was one of the billboards for Apple’s summer campaign. Instead of highlighting the device people use to take pictures, Apple uses the photos themselves.Image Source: Ads of the WorldIn 2022, the brand asked users to share their best macro photos for that year’s challenge. The social campaign celebrated three things that made 2 cm macros possible: new lens design, autofocus capability in the Ultra Wide format, and more advanced software.The campaign demonstrated the quality of the newest iPhone without being overly promotional. It also used gamification by turning the request for shots into a challenge and encouraging participation. There are currently just over 29 million Instagram posts with the #shotoniphone tag.To apply, users are asked to tag the photo on Instagram or submit on Twitter, Weibo, or even through email. They also need to have the original shot (to prove they took the image) and easy-to-find contact details so Apple’s advertising agency can get in touch.The billboards only highlight shots from the newest iPhone, creating more demand for sales.What you can do: Engage audiences with a UGC-inspired competition, challenge, or game. Create a fun hashtag around the content so it’s easy for you and others to track and monitor Need help knowing what keywords to target? Use Semrush’s Keyword Magic tool to gain access to an extensive database of over 24.6 billion keywords for global research.4. Spotify WrappedSpotify Wrapped is an annual wrap-up of users’ most-listened-to music and podcasts. It’s personalized, in-app data built for sharing as an Instagram Story.Image Source: Newsroom SpotifyEvery year, the categories and designs are different. But the structure stays the same.Most years, the interactive roundup includes: Total time spent listening Most-played artists, songs, and genres Favorite podcasts New artists and genresInstagram Stories only last 24 hours (unless you save them as a Highlight). X (formerly Twitter) users also like to share their Wrapped screenshots on the platform.But this conversation isn’t limited to the first week of December when the new Wrapped drops. Users talk about the data stories all year round using keywords “Wrapped” or “Spotify Wrapped” or the official hashtag #SpotifyWrapped.Spotify designs these internal metrics to be super shareable. With the push of a button, Instagram users can share their highlights without resizing or reformatting.It’s also become an ongoing game for users, who listen to more of the artists and playlists they love so they appear on next year’s Wrapped.What you can do: Offer personalized, shareable content that encourages more use of your product or service. Reach out to influencers to participate in your content creation. Use Semrush’s Influencer Analytics tool to identify the perfect ambassador for your brand and see what the competition is doing. 5. Patagonia Mission-Led ContentPatagonia doesn’t use its social media marketing strategy to promote its products. Instead, it focuses on content that drives awareness of relevant social causes and environmental issues.For example, here is one of its TikTok videos featuring a clip from a short film on the importance of recycling.This Instagram post is a shot from a recent March to End Fossil Fuels protest. It endorses the cause and includes a link to a relevant petition in its bio.This X post is another clip from a short film about the effect of dams on greenhouse gas emissions.Patagonia has been focused on UGC and standing up for its beliefs for a long time. The brand does discuss topics like its manufacturing process on social media, but it doesn’t push sales. Or make products the focus of any posts.Instead, all messages and calls to action (CTAs) are about protecting the environment and rethinking consumerism. The brand isn’t afraid to speak out about issues it believes to be important.For example, this statement explained why Patagonia boycotted Facebook ads starting in 2020:It’s a bold strategy that may not work for all brands. But it highlights the impact of prioritizing your mission over products.What you can do: Push the value of your product (not the product itself). Advocate for global social causes or nonprofits that relate to your mission. Try out Semrush’s AI Writing Assistant tool to generate diverse types of content in 28 different languages though 75 AI-driven content creation tools. 6. Starbucks SeasonalityStarbucks adapts its social media channels and the type of content it posts to match that season’s menu offerings. It complements this seasonality by creating a sense of community and belonging with other customers.For example, nearly every video on its TikTok feed features a human. This mix of TikTok users, Starbucks employees, and celebrities visually represents its seasonal products. And the user-generated content feels more real and relatable.Starbucks uses this human-led social media campaign to drive more engagement and sales. It’s built around two key psychological tactics: Social proof: People see others like them enjoying the brand’s drinks, food, and atmosphere. Fear of missing out (FOMO): People become aware that they may miss out on limited-time seasonal offerings if they don’t hurry down to their local Starbucks.During October, you can expect most of these videos to reference “pumpkin spice”, “fall”, or “Halloween.” The video below is a perfect example. A customer talks through each of the new fall menu items with their own personal flair. It’s a post built around Starbucks’ famous pumpkin-flavored drinks and the wide variety of people who enjoy them. It’s a year-round strategy that adapts to that season’s special offers and deals. The company offers deals on refreshers in summer and peppermint mochas in winter. These campaigns lean heavily into feelings of well-being and nostalgia.Starbucks also varies its daily posts between Reels and still images. This mix keeps its audience satisfied with eye-catching visuals while also catering to the algorithm.The focus on seasonality also includes posts about cultural events. For example, this Instagram post celebrates Hispanic Heritage Month as a way to encourage the sense of community and warmth that Starbucks pushes as part of its values.What you can do: Create a sense of urgency by highlighting limited-time offers for events, seasons, and holidays. Be sure to carry your brand values through campaigns and all social interactions.Use AdCreative.ai to automate banner creation for seasonal marketing campaigns. This tool supports multiple formats (Facebook, Instagram, LinkedIn, X) and eliminates the need for design skills.7. Airbnb’s StorytellingAirbnb uses a narrative feel and format to create an emotional connection with its audience. It segments its social media posts, using storytelling to highlight the benefits of its service for both guests and hosts. Recently, it ran two digital marketing campaigns simultaneously. For one campaign, Airbnb invited photographers to use the service as guests and take photos during their stays. Co-founder and CEO Brian Chesky introduced the new social media advertising strategy with a video on his X account:While Airbnb paid artists to take the trips, what the audience saw were seemingly candid moments of families and friends on vacation.Airbnb appealed to guests with a bank of high-quality, user-generated footage—and the story of an amazing getaway.The company compiled the shots into social posts and video ads. This documentary-style content from guests’ perspectives feels more natural. It gives new audiences a sneak peek of what their trips could be like.Airbnb also appeals to hosts by telling a story through images. It uses its Instagram content to strategically showcase homes that are available on the platform. With over 5 million followers, this is a good strategy to give properties more exposure and entice new hosts to sign up.The brand recently began experimenting with documentary-style editing for home shots. The white border ties in with the photographers’ campaign format and makes it look like visitors’ photos. The idyllic images evoke the kind of vibe guests can expect to enjoy when staying at a property, and provide inspiration for what hosts can offer their guests.The strategy of using split captions is meant to cater to both audiences. For example, “Close enough to walk to the touristy stuff, yet far enough away to escape it” summarizes the experience for guests.While the bottom half, “Each home in this category receives a 3D scan and detailed Accessibility Review” outlines the benefits for potential hosts who may want to list their home in the same category within Airbnb.What you can do: Show your audience a preview of what their experience with your brand will be like using high-quality images and videos. Use Semrush's AI Video Marketing Automator to speed up the creative process. Convert any blog post to video, quickly customize and edit your existing video content, and translate your videos into 20+ languages. 8. ASOS The DressASOS capitalized on a social media post that involved a negative mention of one of the company’s products. The brand turned it into a positive story that generated tons of free PR.Thea Lauryn Chippendale posted a screenshot of a rude Tinder message where a man insulted a dress she was wearing in one of her profile photos. The dress happened to be from ASOS.The post went viral. As other users complimented the dress, asking where she bought it, ASOS decided to jump on the chance to defend not only this woman but her choice of clothing.The British retailer asked Thea to check her direct messages (DMs). The dress she wore in the image was still on sale at the time. The brand asked for her permission to use the user-generated content on its product page.Thanks to Thea’s ability to be vulnerable on social media and ASOS’s social “listening”, the whole affair made quite a splash online. Many news outlets picked up the story and Thea became the official model for the dress on ASOS’s website.What you can do: Pay close attention on social media for any mentions of your brand or products. You never know what will come of a casual mention or review. Use Semrush’s Topic Research tool to identify the most popular subtopics and top-shared headlines around a particular topic. Use the Media Monitoring app by Brand24 to track brand mentions on TikTok, YouTube, Telegram, and Reddit.Use Semrush to Supercharge Your Next Social Media CampaignAn effective social media campaign begins with knowing your audience. Start your research with the Audience Intelligence app, then move on to your competitors and analyze what they’re doing with Semrush Social.But research is just the beginning. To truly stand out, you need a constant stream of fresh, engaging content ideas. That's where Semrush's Social Content AI comes in. Simply provide your website URL, and this AI-powered tool will generate over 100 social post ideas daily, organized by topic, sparking your creativity and helping you stay ahead of the curve.Get inspired, stay ahead of the competition, and craft campaigns that resonate with your audience. Try Semrush for free today!",
  "headers": [
    {
      "level": "H1",
      "text": "8 Best Social Media Campaigns to Inspire You in 2024"
    },
    {
      "level": "H2",
      "text": "1. Warner Bros. Barbie"
    },
    {
      "level": "H2",
      "text": "2. Dove’s Real Beauty"
    },
    {
      "level": "H2",
      "text": "3. Apple’s #ShotOniPhone"
    },
    {
      "level": "H2",
      "text": "4. Spotify Wrapped"
    },
    {
      "level": "H2",
      "text": "5. Patagonia Mission-Led Content"
    },
    {
      "level": "H2",
      "text": "6. Starbucks Seasonality"
    },
    {
      "level": "H2",
      "text": "7. Airbnb’s Storytelling"
    },
    {
      "level": "H2",
      "text": "8. ASOS The Dress"
    },
    {
      "level": "H2",
      "text": "Use Semrush to Supercharge Your Next Social Media Campaign"
    }
  ],
  "author": ""
}