{
  "url": "https://www.semrush.com/blog/best-way-write-headlines-will-increase-traffic/",
  "slug": "best-way-write-headlines-will-increase-traffic",
  "title": "What Is the Best Way To Write Headlines that Will Increase Traffic?",
  "description": "Nathan Ellering of CoSchedule shares his expert tips on how to write great headlines.",
  "content": "Headlines are to your blog posts, as covers are to books. Everyone tells you not to judge a book by its cover, but they do it anyway. Everyone also judges your blog posts by their headlines. Why wouldn’t they? There’s more content published than ever before, and people scan headlines to see if something is actually worth their time to read. So it makes sense that writing the best headlines has never been more important: Last month, 6 million posts published on WordPress alone. That’s like 1.4 million posts every single day. 8 out of 10 people who see your headlines will actually read them. Only two of those 10 people will click through to read your posts. Yikes. So, as marketers, we have two big problems to overcome: There’s a ton of noise out there — lots and lots of content is published every day. People are tuning out what doesn’t matter to them before they even know if it could matter to them. Writing awesome headlines is the best way to connect with your audience from the very beginning. And as your audience digs deeper, your traffic will grow. Then when they find out your content is even better than your headline, you’ll get more social media shares. And when you get more shares, you’ll get even more traffic — and all of that helps you rise in the ranks of search engines. Shares, traffic and search results seem to piggyback off of each other’s success. Writing the best headlines can entice your audience to click through to see if your content is worth your time, which can help you grow your marketing reach organically. So here’s exactly how to write the best headlines that will inspire more traffic: Focus on the basics for humans … and robots. Use headlines where they’ll have the biggest impact. A/B/C test your headlines to find the best one. And away we go. How to Actually Write the Best Headlines It all begins with a few simple basics that will help your audience understand what your content is about. And when you do this right, you’ll help search engines find your stuff, too. 1. Find and Use Keywords Your Audience is Looking For in Your Headlines Before writing your headline — and especially your post — it’s really helpful to know your target keyword. That way, you can use it a few times from the get-go instead of retroactively adding it later. Find a keyword with a decent amount of average monthly searches, low competition — possibly medium if your PageRank or Domain Authority trumps your competition — and a difficulty score of roughly less than 60%. Tip: When I do this, I use two tools to choose my keywords: Google’s Keyword Planner and Moz’s Keyword Difficulty and SERP Analysis research tool. Try Google’s Keyword Planner and Moz’s Keyword Difficulty and SERP Analysis research tool to choose an awesome keyword for your next post. Now sprinkle that term in your body copy a few times to let your audience — and the robots — know that your body copy actually covers the information you mentioned in your headline. 2. Focus on a Headline Type that’s Proven to Work Certain types of posts get more traction than others. At CoSchedule, we researched more than 1 million headlines and found that these three types of headlines were shared the most on social media: List posts:# Secrets Of Successful Keyword. “How to” posts:How To Do Keyword To Benefit. Question posts:Is_Keyword Helping You Benefit? There are a lot of other fun ways to make your headline stand out. I’m not trying to discredit them by not including them here — our research just proves that these headline types drive the most social interaction. Since social interaction drives traffic, these three headline types win the prize. 3. Make Sure Your Headline is a Good Length CoSchedule’s research also found that headlines that are six words or fewer are the easiest for your audience to read. Remember, your audience is skimming. The most-read words from headlines are the first three and last three — it’s no surprise that six words is an optimal length for headlines. But shorter is better for robots, too. Headlines that are 55 characters tend to get the most click-throughs. Since Google shows roughly 55 characters in its SERPs, there’s a big correlation here. 4. Is Your Headline Sunny or Cloudy? Headlines with strongly positive or negative emotions get more engagement than those that are kind of… well… blah. Draw on the emotions of your audience to pique their interests. You’re doing that by mentioning the benefit of reading your post in the headline — now just make sure your actual word choice draws them in. 5. Use a Headline Analyzer To Do All of This Don’t have the time to balance emotional words with all the rest, count your words and characters, preview it in Google’s SERPs and email subject lines and review your sentiment? No problem. Try this free headline analyzer from CoSchedule to score your headlines. It’ll measure everything you need to write the best headlines that are most likely to result in social shares, traffic and search results. Where to Use Your Headlines to Have the Biggest Impact So now you know how to write amazing headlines. Terrific. Since you’re reading SEMrush, I’m just going to go ahead and assume you’re somewhat aware of SEO best practices. So here’s a simple reminder of places to use your amazing headlines so they actually make a difference: H1: I don’t care what your headline looks like — just make sure you tag it correctly to help search engines read it. Title Tags: This is almost more important than your H1 because it seems to pull into more places including SERPs and social media shares. Email Subject Lines: If necessary, reword the headline to have your main keyword within the first 20 characters — because that’s all people see a lot of times. Think of checking email on smartphones here — about half of all email is read on mobile Social Media Messages: Try using your headlines in the social media messages you share. Just don’t fall into the trap of only using your headlines. Mix it up with awesome quotes, questions, tips and other useful stuff from your posts. Knowing all the places where headlines make a difference pretty much reiterates how important they are. Now Your Headline is Awesome and Guaranteed to Be Super Successful Right? Well… while you used research to structure your headline in the way we’ve seen others have been really successful — and you’re using them in all the right places — you should still test what works best for your unique audience. So before you call it good and never touch your headline again, there are some simple ways to double check that your headline will actually inspire more traffic. Write a Bunch of Headlines to Find the Best Ones You know that three headline types typically get the most social media interaction: “how to,” questions and lists. Now, write 30 headlines or more with at least 10 of each of these headline types. Note: I find it’s easier to write headlines first so it drives your entire writing process. Sometimes, list post headlines just won’t be a good fit unless you think about this from the get-go. That’s fine, just write 15 “how to” and 15 question headlines. Use a headline analyzer to write these headlines so you can see your entire list with their scores next to them. Pick the best three to use in your A/B/C testing. Preferably, pick the best headline from each of the three headline types. A/B/C Test Your Best Headlines Yup, that wasn’t a typo. You’ve heard of A/B testing, but you can easily A/B/C test your headlines with the tools you’re (most likely) already using: Twitter and email. Twitter is Excellent For Headline A/B Tests This is really simple. And it’s exactly what we do at CoSchedule to choose the best headlines for our posts. Right when you publish your post, share it on Twitter with your best of the best headline. An hour later, share the post again with your second best headline. This is an actual example of how we use Twitter to A/B test our headlines at CoSchedule. Give it an hour, and use Twitter Analytics to gauge which headline received the most interaction. Pick the winner and change your headline if necessary. Note: This is not an exact science. But you might be surprised at the results. Now Test Your Third Headline in the Email You Send Out Anyway Most solid email programs allow you to A/B test your email subject lines. While you can use a shortened version of your headlines as your subject lines, this still gives you the opportunity to see if a different version of your headline may be more successful than another. Don’t waste this opportunity to know you’re using the best headline for your content. If your C headline gets more opens… it might be the best one for your content. Now all you have to do is change it in your H1, title and social media messages to get the best results. Note: This is also not an exact science. Think critically about the best headline among all three choices and choose the one your gut tells you is the best. Now Go and Get ‘Em, Tiger Some final advice: First, give this time. Writing amazing headlines isn’t easy. In fact, writing the best headlines is really tough. That’s why we created the headline analyzer. Second, practice makes perfect. If you consistently write a bunch of headlines, you’ll find yourself getting better and better. Finally — and most importantly — focus on what your readers will actually care about. Research helps, but only you know how to connect your benefits to your audience’s needs. So how do you plan to write headlines that will increase your traffic?",
  "headers": [
    {
      "level": "H1",
      "text": "What Is the Best Way To Write Headlines that Will Increase Traffic?"
    },
    {
      "level": "H2",
      "text": "How to Actually Write the Best Headlines"
    },
    {
      "level": "H3",
      "text": "1. Find and Use Keywords Your Audience is Looking For in Your Headlines"
    },
    {
      "level": "H3",
      "text": "2. Focus on a Headline Type that’s Proven to Work"
    },
    {
      "level": "H3",
      "text": "3. Make Sure Your Headline is a Good Length"
    },
    {
      "level": "H3",
      "text": "4. Is Your Headline Sunny or Cloudy?"
    },
    {
      "level": "H3",
      "text": "5. Use a Headline Analyzer To Do All of This"
    },
    {
      "level": "H2",
      "text": "Where to Use Your Headlines to Have the Biggest Impact"
    },
    {
      "level": "H2",
      "text": "Now Your Headline is Awesome and Guaranteed to Be Super Successful"
    },
    {
      "level": "H3",
      "text": "Write a Bunch of Headlines to Find the Best Ones"
    },
    {
      "level": "H3",
      "text": "A/B/C Test Your Best Headlines"
    },
    {
      "level": "H3",
      "text": "Twitter is Excellent For Headline A/B Tests"
    },
    {
      "level": "H3",
      "text": "Now Test Your Third Headline in the Email You Send Out Anyway"
    },
    {
      "level": "H2",
      "text": "Now Go and Get ‘Em, Tiger"
    },
    {
      "level": "H6",
      "text": "Most popular pages"
    },
    {
      "level": "H6",
      "text": "SEO Checklist: 41 Tips to Optimize Your Website"
    },
    {
      "level": "H6",
      "text": "How to Perform a Complete SEO Audit (in 14 Steps)"
    },
    {
      "level": "H6",
      "text": "A Beginner’s Guide to Keyword Search Volume"
    }
  ],
  "author": ""
}