{
  "url": "https://www.semrush.com/blog/bounce-rate/",
  "slug": "bounce-rate",
  "title": "What Is Bounce Rate? How to Interpret & Improve this Metric",
  "description": "Bounce rate is the percentage of visitors who land on a page on your site, don’t engage, and leave.",
  "content": "What Is Bounce Rate?Bounce rate is a metric that measures the percentage of unengaged sessions on your website or app. Meaning the session didn’t last longer than 10 seconds, trigger a conversion event, or include a second pageview or screenview. It can help you understand how well your site or app attracts and retains users. And whether it matches their expectations and needs. Let’s learn more about bounce rates and how to improve them.Bounce Rate vs. Exit RateExit rate is the percentage of sessions that end on a particular page or screen. And is equal to the number of exits divided by the number of sessions.Let’s say a visitor lands on an article on your blog. Then, they click on an internal link and land on another article. And after reading that second article, they close their browser. That’s not a bounce. But, because the visitor left your site on the second article, it will increase that page’s exit rate. Bounce rate, on the other hand, is the percentage of unengaged sessions that start and end on the same page. For example, a visitor lands on an article on your blog. And then they close their browser five seconds later. That’s a bounce. And it’ll increase that page’s bounce rate. So, all bounces are exits. But not all exits are bounces.How Is Bounce Rate Calculated? Bounce rate is calculated by dividing the number of unengaged sessions by the total number of sessions.Bounce rate = # unengaged sessions / total # of sessionsThis also means bounce rate is the inverse of engagement rate. So, if your site has a 70% engagement rate, then your bounce rate is 30%.What Is a Good Bounce Rate?A good bounce rate is around 40% or lower. And a bounce rate of 60% or higher may be an indication you need to evaluate your page content and make it more helpful and engaging for users.A report from Databox supports these numbers.While you want your bounce rate to be as low as possible, bounce rates can also vary depending on the industry, page type, and even seasonality.For example, here are some bounce rate benchmarks for different industries the Databox report found: Average Bounce Rate Industry 27.92% Apparel and footwear 49.47% Consulting and professional services 42.4% Education 38.65% Health and wellness 48.24% SaaS To sum up, your question shouldn’t be: What is a good bounce rate?You should instead ask yourself: How does my website bounce rate compare to industry benchmarks? How do my webpage bounce rates compare to each other? How do my campaign bounce rates compare to each other? How have my bounce rates changed over time?Does Bounce Rate Affect SEO?Bounce rate isn’t a confirmed Google ranking factor. It’s just a metric. And one Google has repeatedly said does not directly influence rankings.But you should try your best to improve your bounce rate. Why?A high bounce rate is often a symptom of weakness in other SEO and user experience factors like: Slow loading speed Low-quality webpage design A mismatch between content and keywords Poor mobile optimizationWhen someone “fixes” your bounce rate, they’re usually addressing one of these issues. Plus, a lower bounce rate usually indicates that your content is engaging and useful.And Google definitely cares about that. TipUse On Page SEO Checker to quickly find issues with your webpage content that can negatively affect your bounce rate, the user experience, and your overall SEO performance. How to Find Bounce Rate in Google AnalyticsBy default, most reports in Google Analytics don’t include bounce rate. But you can customize reports and add it in.Here’s how:In the dashboard, go to the “Reports” tab (on the left-hand side).Then, click on “Engagement” and then “Pages and screens.”Next, use the pencil icon on the top right portion of your screen to customize the report. Like this:A sidebar should appear to the right of the icon. In that sidebar, select “Metrics.”This sidebar shows the default metrics included in the “Pages and screens” report.Click “Add metric” at the very bottom.And select “Bounce rate.” Click and drag the six dots beside the “Bounce rate” to move it up so that it’s one of the first columns. Then, click “Apply.”Bounce rate is now included in the report. So, click “Save.” You’ve successfully customized the standard report to include bounce rate. How to Reduce Bounce RateHere are six ways to improve your user experience, engagement, and, ultimately, bounce rates. TipSign up for a free Semrush account (no credit card needed) so you can follow along. Give the User What They Want to SeeYour pages should give searchers what they’re looking for. They need to satisfy search intent (a user’s main goal when conducting a search). Otherwise, users are going to bounce back to the search engine results page (SERP).A quick way to find any keyword’s intent is to use Keyword Overview.That should give you an idea of the type of content you should create. For example, if the intent is informational, you should probably write a blog post that answers the user’s questions. But that’s not enough. You also need to make sure that your title tag (HTML that tells search engines what the page title is) and meta description (HTML that briefly summarizes the page) set the right expectations for your page. These can both show in search results, so they’re often the first things searchers see before they click on your page. They should tell searchers what your page is about and why they should visit it. And once they land on your page, the H1 (main page heading) and page content have to align with those expectations. To make sure your pages are optimized, try On Page SEO Checker. It’ll analyze your pages and tell you what you can do to optimize your pages and why you should. This is how you give the user what they want to see. To reduce your bounce rate.Improve Page Load SpeedPage speed can make or break the user experience. Because as page load time increases, the probability of someone bouncing increases. You can use the “Site Performance” report in the Site Audit tool to get an overview of your website’s speed metrics.Like so:You’ll get insight into what issues are causing slow loading times. And actionable advice on how to fix them.The report will give you specific recommendations. For example, it shows whether there are uncompressed pages on your site. Clicking on the “Why and how to fix it” link will open a pop-up telling you all about the error and how to address it.Like so:To enable compression on your webpages, download a plugin like PageSpeed Ninja. You can also download an image compressor like TinyPNG to keep your image sizes small. Optimize the Mobile User Experience Mobile traffic accounts for more than half of all web traffic worldwide. Meaning that if you want to have a low bounce rate, your site needs to work really well on phones and tablets. That includes having intuitive navigation, large fonts, and responsive design.Here’s how to make that happen.First, see how your site performs on mobile devices.One way to check quickly and easily is to use Google’s PageSpeed Insights tool and select “Mobile.”It’ll provide an overall performance score and suggestions to make your pages faster. You can also use Google Chrome to see what your page actually looks like on mobile. It’s a quick and easy test that’s useful when you’re building a site. Or want to see how your site looks on mobile at a moment’s notice. To do this, go to the page you want to check and right-click anywhere. Then hit “Inspect.”The inspect window will appear to the right or bottom of your page. Click on the mobile device icon in that window.If you’d like to see what your page looks like on different devices, you can change your screen size.Just use the “Responsive” drop-down menu located on the upper left corner of your window.To return to your normal screen, click on the “X” in the top right corner. Purposefully Use Internal Links If you want to prevent visitors from bouncing from your pages, consider adding internal links to other content on your site.Especially on blog posts. By linking to related posts and articles within the body copy, you provide an opportunity for someone to click through and read other posts. Another great way to do that is to add a “related posts” section at the end of your articles.Like this:That way, you give visitors something to do after reading your post. Instead of bouncing.Internal links are also crucial for SEO success because they: Help Google find and understand the pages on your site Help Google understand the relationship between your pages Help distribute ranking authority across your siteMake Your Content Easy to ReadWeb visitors are in a rush to learn something. They’re scanning for the information they want. Which means:If they can’t find what they want fast, you’re going to end up with a high bounce rate. Here are a few ways to make your content easy to read: Use subheadings. Headers break up your content into digestible sections. And make it really easy for readers to skim and understand your content. Use white space. Give your content room to breathe by using lots of white space around your text. Like this: Use short paragraphs and sentences. Break up paragraphs into one- to two-sentence chunks. And try to write only one idea per paragraph.To make sure your content is optimized for readability, use the SEO Writing Assistant. You’ll get a “Readability” score, a list of issues, and recommendations on how to improve. Like this:Use a Table of ContentsA table of contents shows the reader they’ll get exactly what they’re looking for (search intent). And lets them skip to the sections that are most important to them. If you make both those things as easy as possible for visitors, they’ll be less likely to bounce. Let’s say you land on this page:It’s a good guide.But it’s really difficult to find one specific tip or step. Whereas in this guide, you can instantly find what you’re looking for.Pro tipMake the table of contents appealing. Like a movie trailer is for a movie. Think of it as a sales pitch for people to keep reading the article.Don’t Stop at Bounce RateBounce rate is an important metric that tells you how engaging and relevant your pages are for your visitors.But it’s not the only one.There are many other factors that affect your site’s performance—semantics, backlinks, SERP features, keyword usage, etc. And a tool like On Page SEO Checker can give you actionable advice on how to improve all of them. The tool’s optimization ideas are based on your top 10 competitors for each of your target keywords.Which means you’ll be well on your way to beating and outranking your competitors.",
  "headers": [
    {
      "level": "H1",
      "text": "What Is Bounce Rate & What Is a Good Rate?"
    },
    {
      "level": "H2",
      "text": "What Is Bounce Rate?"
    },
    {
      "level": "H3",
      "text": "Bounce Rate vs. Exit Rate"
    },
    {
      "level": "H2",
      "text": "How Is Bounce Rate Calculated?"
    },
    {
      "level": "H2",
      "text": "What Is a Good Bounce Rate?"
    },
    {
      "level": "H2",
      "text": "Does Bounce Rate Affect SEO?"
    },
    {
      "level": "H2",
      "text": "How to Find Bounce Rate in Google Analytics"
    },
    {
      "level": "H2",
      "text": "How to Reduce Bounce Rate"
    },
    {
      "level": "H3",
      "text": "Give the User What They Want to See"
    },
    {
      "level": "H3",
      "text": "Improve Page Load Speed"
    },
    {
      "level": "H3",
      "text": "Optimize the Mobile User Experience"
    },
    {
      "level": "H3",
      "text": "Purposefully Use Internal Links"
    },
    {
      "level": "H3",
      "text": "Make Your Content Easy to Read"
    },
    {
      "level": "H3",
      "text": "Use a Table of Contents"
    },
    {
      "level": "H2",
      "text": "Don’t Stop at Bounce Rate"
    }
  ],
  "author": ""
}