{
  "url": "https://www.semrush.com/blog/branded-search/",
  "slug": "branded-search",
  "title": "What Is Branded Search? (And How to Optimize Your Site for It)",
  "description": "A branded search is a search engine query that contains the name of your brand, service, or product.",
  "content": "What Is Branded Search?A branded search is an online search for information on a specific brand.For example, a person who searches “where to buy Swatch watches” wants to know where they can buy watches made by the Swatch company specifically.Imagine someone does a branded search involving your brand. This means they aren’t interested in just any random brand. They want information on your offerings.In this article, we’ll explain how to make the most of this opportunity. Types of Branded KeywordsBranded keywords refer to the search terms used to find brand-related content.They come in various types: The name of the brand itself: “McDonalds menu,” “McDonalds near me,” and “how to work at McDonalds” contain the McDonald’s brand name The name of a brand’s product: “Nintendo Switch games” and “Nintendo Switch price” refer to the gaming console sold by Nintendo The name of a brand’s service: “FedEx SameDay delivery” and “FedEx SameDay tracking” refer to FedEx’s SameDay delivery service Trademarked names: “Dockers pants” and “Dockers D3 Classic” contain the “Dockers” trademarkBranded Search vs. Non-Branded SearchUnlike branded searches, non-branded searches have no relation to any brand.To illustrate, here are examples of branded vs. non-branded keywords with the named brands in bold: “Philadelphia Cream Cheese recipes” vs. “Cream cheese recipes” “How to wash a Speedo swimsuit” vs. “How to wash a swimsuit” “Where do Starbucks coffee beans come from” vs. “Where do coffee beans come from”Notice how non-branded keywords are generic—unlike their branded counterparts.Why Are Non-Branded Keywords Important?Creating content that targets non-branded keywords is essential even though these keywords don’t include your brand. Doing so helps you reach people who may not have heard of you but may still benefit from what you offer.Once you capture these searchers’ attention, you can educate them about your brand and how your offerings solve their pain points. To convert them into customers.Then, as users become aware of your brand, they may also begin using your branded keywords in searches.Why Are Branded Keywords Important?Branded keywords offer opportunities to make more sales.That’s because people who use branded keywords like “[your service] pricing” or “buy [your product]” already know of your brand. They’re more likely to buy your products than people who have never heard of you.Or, if these people have already bought your product, they may be looking for information on using it. They may be using branded keywords like “how to clean [your product]” or “[your product] instruction manual.”By creating pages that address your customers’ needs, you’ll keep them happy. They may become repeat customers or recommend you to others. Leading to higher revenue.Tracking your branded keyphrases can also help you gain insights on your brand like: The extent of audience knowledge of your brand: Your branded keywords’ search volumes can indicate how aware people are of your brand. Plus, you find out what customers don’t know about your brand based on the branded question keywords they use. Customer sentiments: Using branded keywords like “[your brand name] review” lets you discover others’ views of your brand. Including negative opinions that need addressing. Your top competitors: Branded keywords like “[your brand name] vs. [competitor name]” tell you the businesses users are comparing you to Content gaps: Discover information on your brand people want but you don’t have content for yet Your share of search: Share of search refers to the volume of search queries your brand owns compared to all brands in your niche. The more search queries in your niche that involve your branded keywords, the higher your share of search.Benefits of Branded TrafficBranded traffic refers to website visitors looking for information about that brand specifically.By leveraging branded traffic, you stand to: Enjoy higher organic search rankings: Search engines will likely see your content as a more authoritative results option for your branded keywords compared to content provided by others. They may rank your content higher for these keywords. Enhance your brand reputation and credibility: Some branded keyword searchers may be looking for opinions of your brand. If you can direct these searchers to favorable reviews of your products, you’ll likely improve your brand reputation. Improve the user experience: Provide users with content that addresses the branded questions they’re asking. This way, they get the reliable, accurate answers they want. And their interaction with your brand will end with them feeling satisfied. Reap a higher return on investment on search branding ads: Pay-per-click (PPC) campaigns for branded searches can get you a return on ad spend as high as 19X that for non-branded keywordsThis can all lead to more traffic for your website and more positive sentiments toward your brand.You can capitalize by gaining more customers and sales. After all, 54% of global consumers surveyed prefer to get pre-purchase information via search engines.How to Identify Branded KeywordsHere are six keyword research methods for identifying your branded keywords:1. Use the Semrush Organic Research ToolThe Semrush Organic Research tool displays all the branded keywords you already rank for in one comprehensive report.To use the tool, log in to your Semrush account and click “SEO” > “Organic Research” in the left sidebar.Type your brand’s domain into the tool. Choose the country for which you want to check your branded keyword rankings. Then click “Search.”Click the “Positions” tab.Then, select “Advanced filters” and update the filter condition so it reads “Include” > “Keyword type” > “Branded.”Click “Apply,” and the tool will provide a filtered report of your branded keywords.From here, view information for each branded keyword, like: Your ranking position The domain URL that’s ranking for the keyword The presence of search engine results page (SERP) features like featured snippets or “People Also Ask” boxesApply more filters if you want to refine your branded keyword list further.For example, use the “Positions” filter to display only branded keywords for which you rank in positions 11-20. So you know what these are and can work to improve your rankings for them.2. Use the Semrush Keyword Gap ToolDo a competitive analysis of the branded keywords your rivals are ranking for—but you aren’t—with Semrush’s Keyword Gap tool.Launch the tool by going to “SEO” > “Keyword Gap” from your Semrush account’s left sidebar. Then, click “+ Add up to 3 competitors” so you can provide multiple competing domains.Type the root domains for your brand and at least two competitors. Leave the settings as “Root domain” and “Organic keywords” respectively.Choose the country for which you want to compare your branded keyword rankings. Then, click “Compare.”Click “Advanced filters” and update the filter condition so it reads “Include” > “Keyword”> “Containing” > “[Your brand name].” Then, click “Apply.”Scroll down and click “Missing” to get a list of your branded keywords that your competitors are all ranking for but you aren’t.Click a competitor’s domain to sort their rankings from highest to lowest.This is useful for seeing which of your branded keywords they’re ranking highly for. (And you aren’t.)3. Use Google AutocompleteGoogle’s autocomplete feature suggests branded queries for search terms containing your brand name.Go to the Google homepage and type your brand name into the search bar. Google will suggest a list of keywords containing your brand name for you to consider targeting.After that, type “a” into the search bar such that your search query becomes “[your brand name] a.” Google will suggest more branded related keywords as you do so.To get even more branded keyword ideas, replace “a” with “b,” “c,” and the rest of the letters in the alphabet until you reach “[your brand name] z.” 4. Look at the ‘People Also Ask’ and ‘People Also Search for’ SectionsGoogle also displays keyword suggestions in the “People also ask” (PAA) and “People also search for” (PASF) sections on its SERPs.Type your brand name into Google’s search bar. Then, hit “Enter” or “return” on your keyboard to run the search.Scroll down the SERP. Under its PAA and PASF sections, you’ll find more keywords you might want to add to your brand keyword list.5. View Your Google Search Console Performance ReportGoogle Search Console’s performance reports offer insights into the branded keywords for which people are clicking through the SERPs to visit your website.Open Google Search Console and click “Search results” in the left sidebar to view the “Performance on Search results” report.On this report, click the “Total clicks” report to enable it if it isn’t already.Then, click “+ New” > “Query…” to create a new filter.Under “Filter,” change the “Queries containing” setting to “Custom (regex).”Leave the filter condition as “Matches regex.” Then, enter your branded keywords into the query field. You can separate multiple keywords with a pipe (|).Finally, click “Apply.”Scroll down to view the branded keywords that have contributed to clicks to your website.6. View Your Google Analytics 4 Query ReportsCheck Google Analytics 4 (GA4) to learn the organic keywords people have used to visit your website. Including branded ones.Start by connecting your website’s GA4 property to your Google Search Console account if you haven’t already. (See how here: [GA4] Search Console integration.)Then, in GA4’s sidebar, navigate to “Reports” > “Search Console” > “Queries.”GA4 will display your website’s organic search query report. Type your brand name into the search bar just above the list of organic keywords. Then, hit “Enter” or “return” on your keyboard.GA4 will filter the report to display just the organic keywords containing your brand name.9 Ways to Optimize for Branded Search TrafficAfter identifying your branded keywords, use these nine tips to boost the search traffic they send you:1. Audit and Improve Your Current PagesApply on-page SEO improvements to the pages targeting your branded keywords to help these pages rank higher for them.These improvements include: Adding your branded keywords in your pages’ title tags and headers Ensuring your pages’ content is relevant to their target branded keyword Verifying your pages’ information is up to dateIf you aren’t sure which parts of your pages need work, Semrush’s On Page SEO Checker can help.This tool analyzes how your pages rank for your target keywords compared to your top 10 competitors’ search rankings. It then provides suggestions for enhancing your pages to outrank your rivals.Go to your Semrush account and click “SEO” > “On Page SEO Checker” in the left sidebar. Select “+ Create project” at the top right of the screen.Enter your brand’s domain and an optional project name. Then, click “Create project.”Click “Set up” next to the newly created website project.The tool’s configuration settings will appear. Choose your target location, then click “Continue.”Next, provide the tool with the pages that aren’t ranking well for your branded keywords by selecting “Organic Research.”Click “Advanced filters” and set up: Your preferred country database The minimum and maximum page position range. Leave the minimum position as “11” to find pages not ranking in the top 10 of the SERPs. The number of keywords to retrieve Your branded keyword in the “Keywords containing” fieldThen, click “+ Add.”Finally, click “Collect ideas.”At the bottom of the tool’s report, you’ll see a list of top pages worth optimizing. Click the “# ideas” button next to any page to get optimization ideas.For example: To help the “https://www.mailerlite.com/mailchimp-alternative” page rank higher for the “mailchimp vs mailerlite” and “mailerlite vs mailchimp” branded keywords, the tool provides recommendations like: Adding related keywords to the page’s content Getting backlinks from certain domainsAct on the tool’s suggestions for your pages.2. Create New Pages Targeting Your Branded KeywordsAfter updating existing pages to better target your branded keywords, consider creating new pages.Do so by writing relevant content that matches the search intent of the branded keyword you want to target. Then, optimize the content for your branded keyword using a tool like Semrush’s SEO Writing Assistant.Navigate to the tool by going to “Content Marketing” > “SEO Writing Assistant” from your Semrush account. Then, click “+ Analyze new text.”Paste your content into the tool. Click “Set a new goal” in the right sidebar, and then add at least two branded keywords and your target audience. Hit “Get recommendations” after that.Under the “SEO” section, you’ll see branded SEO suggestions to take action on, like: Using your branded keyword in your title Adding keywords related to your target ones Adding alternative (alt) text to imagesThis editing tool also evaluates your content’s readability and tone of voice. So you can work on these and create the highest-quality content for readers.3. Optimize for Sitelinks in Search ResultsSitelinks are a list of links under certain Google search results. They lead to other pages on the domain.For example, here are the sitelinks for IHOP’s homepage:Having sitelinks appear for your domain on your branded keywords’ search results: Offers users other relevant links to click to visit your website Helps your search result take up more space on the SERPs. And push competing search results downward and out of view.Thus sending more traffic to you instead of other websites.Google automatically generates sitelinks based on your website’s structure. There’s no guarantee Google will display sitelinks for your domain. Improve your chances using methods like: Crafting relevant and useful—yet concise—page titles Adding internal links to important pages Using short and descriptive anchor text (the clickable text accompanying the link) for internal links4. Manage Your Brand’s Google Knowledge PanelKnowledge panels are information boxes on the Google SERPs for entities like people and organizations.Here is Bellroy’s knowledge panel, for instance:Knowledge panels tend to appear for branded keywords consisting of just the brand’s name.For instance, you’ll see Bellroy’s knowledge panel when you search for “Bellroy.” But not when you search for “Bellroy wallet.”The panel also contains a link to the brand’s homepage, which can direct more traffic to its website.Google automatically generates knowledge panels based on content it finds online. But you can claim your brand’s knowledge panel and request edits to it.This way, you’ll keep its information accurate and up to date. And give users the most authoritative facts about your brand and shape their impression of it.To claim your brand’s knowledge panel, go through Google’s verification process. It includes signing in to one of your brand’s official sites or social profiles to show you represent it.You’ll be able to edit your knowledge panel once verification is complete.Further reading: Google Knowledge Panel: What Is It & How to Get One5. Use Reviews to Manage Reputation IssuesOnline reputation management is an important part of a branded keyword strategy.That’s because people use branding keywords like “[your brand name] review” to learn others’ opinions of your brand.Good reviews can send more website traffic and sales your way. Bad reviews can have the opposite effect.Use a local SEO tool like Semrush’s Review Management to monitor reviews about your brand—and respond to them—so you improve your brand’s reputation.Access the tool by clicking “Local” > “Review Management” from your Semrush account. Then, type your business name into the tool and click the “Search” icon.Scroll down the next page that loads, click “Manage reviews now,” and follow the signup process.Afterward, you’ll see your brand’s reviews on platforms like Yelp and EZlocal in the “Review Management” report.Click the “Reply” button next to any review to respond to it. Aim to foster positive sentiments toward your brand as you do this.For example, you could leave thank-you notes for positive feedback. Or share details on the follow-up actions you’ve taken in response to negative reviews.Review Management also provides AI-generated replies if you need ideas on how to respond.6. Answer Questions in ‘People Also Ask’ SectionsThe PAA section is a box on the Google SERPs that contains questions related to the original search term. Users can click these questions to quickly see answers.For example, here’s the PAA section when you Google “ko-fi”:The answer will also contain a link to its source website. So users can click and read more.Aim to have Google feature your answer—and your website—for your branded keywords’ PAA questions. To do this, review the PAA questions that appear when you search for your branded keywords. Add these questions and short answers to them in places on your website like: Your frequently asked questions (FAQs) page FAQ sections for specific product and service pagesCase in point:Google pulled the answer to the PAA question, “How much does Ko-fi cost?” from the FAQ section of Ko-fi’s memberships page.7. Maintain an Active Social Media PresencePost valuable content on social media regularly to build brand awareness and brand authority. As social media users come to trust you, they’ll be more likely to do branded searches for information on—or from—your brand instead of a competitor.If you find engaging followers on multiple social media channels challenging, try a tool like Semrush’s Social Poster.It provides a calendar for viewing your past and upcoming posts on various social platforms. Including Facebook, Instagram, and Google Business Profile.The tool also helps you schedule and publish posts on these platforms in one place.Further reading: The Ultimate Guide To Social Media Marketing: Strategies & Tips8. Build Branded BacklinksBranded backlinks are links on other websites that direct users to your pages and include your brand name in their anchor text.Just like this press release on PR Newswire, which contains a branded backlink to the Semrush website:Building branded backlinks can increase your brand’s visibility as it gets seen by users of other websites. These users may then use your branded keywords to learn more about you.Your website may also get a nice rankings boost from the backlink itself.To get branded backlinks, collaborate on branded content with websites that can make your brand name part of the backlink’s anchor text.Just like how The Kangaroo Kite got a branded backlink from The Planet D after contributing this guest post:Another way to get branded backlinks? Check for new unlinked mentions of your brand. Then ask the websites behind them to turn the mentions into backlinks.One way of finding unlinked mentions is to Google “[your brand name] -[domain name].” Such as “semrush -semrush.com.”You’ll get search results for websites—apart from your own—that mention your brand name:Sift through the results to find unlinked mentions.Alternatively, track new unlinked mentions using Semrush’s Brand Monitoring tool. It automatically alerts you of these via email. No manual Googling needed.Further reading: How to Get Backlinks: 10 Strategies That Work9. Buy Search Ads for Your Branded KeywordsAlthough you’ll likely rank well on your branded keywords in organic listings, consider buying the ad space above them.That’s because competitors can also place ads on your branded keywords—the same keywords you’ve painstakingly generated search demand for.Just like what car rental business RentalCars.com appears to have done on the branded keyword for its rival, Turo:Buying ads on your branded keywords doesn’t prevent others from doing the same.You may also face a drop in organic branded search traffic if searchers visit your website via your paid ads instead.But at least you’ll have taken up one branded paid search ad slot that could have directed searchers away from your website.Further reading: What Is Google Ads & How Does It Work? A Comprehensive GuideTurn Brand Search Into Traffic and SalesSearchers who use your branded keywords are already aware of your brand. So, don’t waste the opportunity to direct them to your website. And convert them into customers.From Organic Research to SEO Writing Assistant, Review Management, and more, Semrush offers many tools for identifying your branded keywords, optimizing content for them, and improving your brand reputation as a whole.Sign up for a free Semrush account to explore these tools today.",
  "headers": [
    {
      "level": "H1",
      "text": "What Is Branded Search? (And How to Optimize Your Site for It)"
    },
    {
      "level": "H2",
      "text": "What Is Branded Search?"
    },
    {
      "level": "H3",
      "text": "Types of Branded Keywords"
    },
    {
      "level": "H2",
      "text": "Branded Search vs. Non-Branded Search"
    },
    {
      "level": "H3",
      "text": "Why Are Non-Branded Keywords Important?"
    },
    {
      "level": "H3",
      "text": "Why Are Branded Keywords Important?"
    },
    {
      "level": "H2",
      "text": "Benefits of Branded Traffic"
    },
    {
      "level": "H2",
      "text": "How to Identify Branded Keywords"
    },
    {
      "level": "H3",
      "text": "1. Use the Semrush Organic Research Tool"
    },
    {
      "level": "H3",
      "text": "2. Use the Semrush Keyword Gap Tool"
    },
    {
      "level": "H3",
      "text": "3. Use Google Autocomplete"
    },
    {
      "level": "H3",
      "text": "4. Look at the ‘People Also Ask’ and ‘People Also Search for’ Sections"
    },
    {
      "level": "H3",
      "text": "5. View Your Google Search Console Performance Report"
    },
    {
      "level": "H3",
      "text": "6. View Your Google Analytics 4 Query Reports"
    },
    {
      "level": "H2",
      "text": "9 Ways to Optimize for Branded Search Traffic"
    },
    {
      "level": "H3",
      "text": "1. Audit and Improve Your Current Pages"
    },
    {
      "level": "H3",
      "text": "2. Create New Pages Targeting Your Branded Keywords"
    },
    {
      "level": "H3",
      "text": "3. Optimize for Sitelinks in Search Results"
    },
    {
      "level": "H3",
      "text": "4. Manage Your Brand’s Google Knowledge Panel"
    },
    {
      "level": "H3",
      "text": "5. Use Reviews to Manage Reputation Issues"
    },
    {
      "level": "H3",
      "text": "6. Answer Questions in ‘People Also Ask’ Sections"
    },
    {
      "level": "H3",
      "text": "7. Maintain an Active Social Media Presence"
    },
    {
      "level": "H3",
      "text": "8. Build Branded Backlinks"
    },
    {
      "level": "H3",
      "text": "9. Buy Search Ads for Your Branded Keywords"
    },
    {
      "level": "H2",
      "text": "Turn Brand Search Into Traffic and Sales"
    }
  ],
  "author": ""
}