{
  "url": "https://www.semrush.com/blog/brand-visibility-what-is-it-how-can-i-increase-it/",
  "slug": "brand-visibility-what-is-it-how-can-i-increase-it",
  "title": "Brand Visibility",
  "description": "Knowing how to measure and improve brand visibility is vital to making sure your brand is seen. Here‘s how to get started.",
  "content": "People tend to choose what is most familiar to us, even if we only do so unconsciously. Which means that the more visible your brand, the greater is your ability to acquire and retain customers. Many factors influence how a prospective customer or client chooses one brand over another, but one thing that inarguably matters is simply how visible your brand is.We could think about it from a risk mitigation perspective. The safest decision is often to follow the most popular option. It’s why we have the old saying, “no one ever got fired for buying IBM.”Today, we might change that saying to “no one ever got fired for buying Salesforce,” but the point stands: the most well-known brand in a space is often the most trusted, whether or not that level of trust is deserved. Which is why brand visibility is one of the most important metrics your brand isn’t tracking.What Is Brand Visibility?Brand visibility is defined as the proportion of exposure a brand enjoys in relation to its competitors and its industry. It’s a component of brand awareness, which is an umbrella term that describes several different methods of measuring a brand’s overall coverage and sentiment in a market. Because brand visibility measures, quite literally, how “visible” a brand is to target customers, it matters greatly how and where you measure this. In other words, brand visibility is something you should calculate on a per-channel basis, not necessarily in aggregate. You can have a search brand visibility number that resembles a metric like “share of search.” You can have a social media brand visibility number that calculates your overall brand reach vs that of your competitors. Unlike metrics such as market share or share of search, however, the brand visibility metric need not be calculated in relation to competitors or your market in general. It can act as a standalone metric, something you benchmark and hope to improve over time. Marketing91 gives the following explanation of brand visibility:“If you can recall at least one person whom you see on your newsfeeds daily, that is how band visibility works. All the posts may not be quality content. But appearance is what matters.”Brand visibility is an important input metric into your overall brand awareness, but you still need to care about quality, sentiment, and targeted placements. I’ll offer some advice below on how to make sure your brand visibility efforts are actually translating to increased sales and business impact. Brand Visibility vs Brand Awareness vs Brand PerceptionTo define brand visibility accurately, it helps to see where it sits among other related metrics like brand awareness and brand perception.Brand AwarenessAt the highest level, we have brand awareness. Brand awareness is a catchall metric that includes various measurements and methodologies that answer the question, “are prospects aware of our brand?” In measuring brand awareness, it may be best to layer your measurement approach depending on which specific question you want to answer. Do you care about measuring your overall success in a market? Market share is the way to do it. Do you want to see how many people in your target audience can recall your brand without prompting? Brand recall surveys are the way to go. Is SERP coverage important to you? Share of search can show what percentage of search results are owned by or mention your brand.All of these methods answer slightly different variants of the question, “how aware are people of our brand?” Brand PerceptionBrand perception is a metric that focuses not only on awareness and reach, but sentiment. Sure, people are aware of our brand. They know it exists. But how do they feel about our brand? Do they like it? Do they hate it? What’s their opinion on the brand?Brand perception is complicated—it is both in your control and outside of your control. You can attempt to construct brand positioning and a narrative, but in the end, how you the market perceives you is influenced by a confluence of factors, including: Customer service Product quality Competitors and their positioning Changing market trends Marketing and advertisingAs Qualtrics puts it:“Customers, not companies, own brand perception. Brand perception is what customers believe a product or service represents, not what the company owning the brand says it does. Brand perception comes from customer use, experience, functionality, reputation and word of mouth recommendation—on social media channels as well as face to face.”Measuring brand perception is as much art as science, as you can reach pretty different conclusions depending on the method you use to measure it and how and when you conduct the research.One of the most popular ways to measure brand perceptions is focus groups, which can be affected several factors, including: The makeup of the sample group you interview The interactions among the group itself The questions you ask and in what order The Hawthorne Effect, (in which individuals modify an aspect of their behavior in response to their awareness of being observed)Much of what we think of as “branding” fits under the brand perception bucket. We’re trying to sculpt a narrative or the emotions around our brand and company. Brand perception is also frequently measured through sentiment analysis on social media and the web in general. Tools like Brand Monitoring help you identify not only brand visibility on the web, but also how people are talking about your brand. Sentiment analysis, however, is not a perfect science. It’s relatively difficult to parse out nuanced takes on a product through machine learning alone. For example, a critical tweet by a power user may be flagged as negative, when in fact, that critical tweet may have been delivered from a place of love and care for the brand. AI cannot yet detect sarcasm or humor.Divorced Friend Burning Through New Hobbies At Unsustainable Rate https://t.co/yLQWYA4eMA pic.twitter.com/KBhbhlB6uR— The Onion (@TheOnion) July 3, 2022Brand VisibilityBrand visibility is a building block towards brand awareness in general. In many ways, the additive effect of brand visibility and brand perception equals your brand equity, which is defined as the “value premium that a company generates from a product with a recognizable name when compared to a generic equivalent.” As CXL put it, “Visibility is an upstream measure and has a positive influence on awareness (the more you’re seen, the more likely you are to be recognized).”Brand visibility is much more of a leading indicator than the others mentioned here. It’s largely under your control as well: You can ramp up ad spend on brand campaigns You can flood segments and markets and see your brand visibility metrics move You can enact surround sound SEO campaigns to monopolize key search phrases with your brandAgain, there are many ways to measure brand visibility, which is best computed on a channel basis. I’ll walk through 6 ways to measure brand awareness below. How to Measure Brand Visibility: 6 MethodsLet’s walk through 6 different ways to measure brand awareness for the following channels: Search (organic) Search (paid) Search (surround sound) Social media (organic) Social media (paid) Referral and review site1. Brand Search (organic)Share of search is one of the most popular ways to audit your brand visibility in organic search. Essentially, share of search is like market share, but it specifically measures your proportion of brand search queries in relation to the quantity of brand search queries of your competitors. The most common way to measure this is to find the estimated search traffic for your brand keyword and the estimated search traffic for your main competitors’ branded keywords. You can either use Google Trends or an SEO tool like Semrush. As an example, we’ll use Buffer, a social media planning app. Knowing the space, we can assume their biggest competitors are Hootsuite, Planable, and Sprout Social. Using Google Trends, just enter each keyword and pull the time window back to 1-2 years. The time series data view already gives a strong picture of brand performance in the search engine:If you want to calculate your share of search, you can pull this data to a spreadsheet and calculate what percentage of branded search traffic you have in relation to your market. In this case, Buffer has an outstanding share of search, with 88% of branded search traffic being for their brand.2. Search (paid)Measuring brand visibility in paid search is somewhat similar to measuring brand visibility in a search engine. It, too, requires you to select a class of keywords you’re actively targeting and measure your presence in relation to competitors among those keywords.In paid search, however, you’re only looking at paid placements and the associated brand metrics among paid ads and ad clicks: Impressions Impression share Lost impression share Average position Click through rateWhile some of this is difficult to estimate for your competitors, you can get a lot of this information (especially average position and visibility) in Semrush’s advertising tools:For some of these metrics, like impressions and click through rate, you may simply have to benchmark against your own track record instead of trying to estimate that of your competitors. There often is no industry-standard “good” numbers for these KPIs.3. Search (surround sound)My favorite way to measure brand visibility in search is with “SERP visibility” or share of search.This also centers on search engine visibility, but I believe the most holistic way to gauge how much of a search presence is owned by your brand is with the surround sound strategy.The surround sound strategy seeks not only to rank for a keyword or to outbid competitors for a keyword. Rather, the goal is to monopolize a search results page and appear on all the pages that rank for a product category keyword (i.e. something brand agnostic that prospects would use to comparison shop, like “best SEO software”).“(With surround sound), the goal is to monopolize a search results page and appear on all the pages that rank for a product category keyword.”At the product discovery stage, prospects are looking for recommendations and are trying to infer the relative value of products within a category. When someone searches, “best referral marketing tools,” there are a ton of pages that essentially act as recommendation engines for the searcher:Of course, it helps if you rank your piece of content for this keyword. But it’s even better for your brand to be mentioned on every single one of these pages. Let’s use Woorise as an example. They rank here in position two for the keyword with this listicle. However, they aren’t mentioned on any of the rest of the pages that rank. To measure their SERP visibility, we can use Semrush’s Surround Sound Tool to do a quick audit. Just pop your keyword, SERP depth (how many pages you want to be included), and your brand and domain name into the interface here. You can (and should) also add some competitors. I’ll use Referral Rock as an example:Now, you can see, of the pages that rank for the keyword “best referral marketing tools,” how many mention your brand (Woorise) and how many mention your competitor (Referral Rock):Clearly, Referral Rock is dominating the SERP visibility game. This is also apparent when you look at the high level dashboard for this campaign, which shows there is only one mention for Woorise (their own listicle):When you look at the competitive view, you can see that Referral Rock as a whopping 64.5% visibility to Woorise’s 9.3%:Thus, Woorise could benefit from engaging in some surround sound SEO (which I’ll cover in the “ways to increase brand visibility” section). 4. Social Media (organic)Organic social media marketing is a great way to make your brand more visible. You can probably think of a few brands who have stood out on social media in recent years, like Wendy’s. They’re top of mind because they’re both active and get mentioned a ton:You can measure brand visibility by your own overall impressions and awareness, which are easily found in Twitter Analytics:Brand visibility metrics are often available in whatever social media planning tool you use as well. I use Hypefury and here’s what my report looks like:If you want to measure how others are talking about you, a social listening tool like Mention can help. This can help you both identify spikes and trends in your brand exposure as well as the sentiment with which people are talking about you. At a high level, I can see metrics like how many total social followers I have in relation to my competitors:Mention has several other tools to track your brand visibility in social media, though, including competitive Twitter, LinkedIn, Facebook, and Instagram reports as well as proactive social listening and notification tools: The tough part about measuring brand visibility in social media is the difficulty identifying whether or not your target audience is seeing your content.Most analytics tools don’t distinguish between the types of accounts who are following or engaging with your content, and of course, some accounts are more important to your business than others. 5. Social Media (paid)Paid social media is a bit easier to measure as you have all the performance metrics associated with paid search, such as: Impressions Click through rate Conversion rateAnd with these metrics, you can determine your ROAS (Return on Ad Spend) as well as infer if the messaging is actually reaching the right people (not just a lot of people). These things are measured on a per-platform basis, or through Google Analytics.6. Referral and Review SitesIn B2B marketing, some of the most important bottom-of-the funnel assets you can have are favorable placements on review sites and affiliate blogs. When people are comparison shopping, they want to see that you’re well recommended and trusted by influential people and brands in the space. A high ranking on a Gartner chart can often move the needle for enterprise software buyers, and simply appearing favorably on G2 or Capterra means you’ll be in the conversation among your buyers. I recommend many B2B marketers to look at this on an individual basis, since not all review sites carry the same gravitas. In most cases, buyers are looking at a few sites like Gartner, Forrester, G2, and Capterra, and the rest don’t matter as much.On a broader level, though, you can still see your overall SERP visibility using the Surround Sound tool, which can include placements on review sites like G2, as well as social media profiles when you add additional domains in settings.3 Ways to Increase Brand Visibility (+ Examples)Now that you know what brand visibility is and how to measure it, are you ready for the one secret hack on increasing brand visibility? The silver bullet that allows you to surpass your competitors and reach Salesforce-level dominance in your industry?You know where this is going: there isn’t one.Instead, start with the two foundational strategic elements: Choose your channels Define how you will measure your effortsChoose Your Channels & KPIsChoosing your channels is important because you can’t play and win everywhere, at least not at first. Zoho and HubSpot, for example, are on par with Salesforce for this set of keywords even though they are far smaller companies overall:Trying to win everywhere is likely to dilute your capital, focus, and quality, and in trying to win everywhere, you’ll end up winning nowhere. As Robert Greene wrote in the 48 Laws of Power:“Conserve your forces and energies by keeping them concentrated at their strongest point. You gain more by finding a rich mine and mining it deeper, than by flitting from one shallow mine to another—intensity defeats extensity every time.”I can’t tell you where your efforts are best spent. For some companies, that will be social media. Some companies will do well by focusing on review sites at the exclusion of organic search. This is a decision that hinges on tons of contextual elements and strategic trade offs.Once you decide on your channel, figure out up front how you will measure your efforts.Deciding how you will measure your results after you start working can open up decision making errors like cherry picking your data. There are like a hundred metrics you could look at to determine your social media success - is it retweets that matter? Engagement to your tweets? Brand mentions? Brand perception and sentiment?Now, since I promised to give you some methods to increase your brand visibility, I’ll focus on a few underrated methods I’ve used to bring more attention to my brand in various channels. Let’s walk through three methods with examples: Surround sound SEO Decentralized content marketing Review site marketing1. Surround Sound SEOSurround sound SEO is my favorite way to increase your brand visibility.Why? It’s super targeted.Not only are you harvesting demand from search engines, but you’re doing so for search terms directly for people who are in the comparison shopping and product discovery stage.Sure, you could put billboards up or sponsor a professional sports stadium. But how many soccer fans are going to see your ads and then immediately purchase? The brand awareness you generate is still surely valuable, but surround sound SEO offers a better bang for your buck. And you can lean on both the brand visibility benefits as well as measure the results with direct response analytics (i.e. people will search for something like “best survey software” and immediately sign up for your product).Let’s look at HubSpot as an example.Everyone in digital marketing knows HubSpot is a powerhouse when it comes to content marketing. They invented the term inbound marketing. While all of this search traffic does drive leads and trials, a lot of it is very high up in the funnel. For example, an article on motivational sales quotes may bring a lot of traffic, but it didn’t drive actual freemium product users. When I was working on growth there, we looked at our data and realized that a handful of articles were converting at 5-10X the average conversion rate. The pattern? They were all product listicles like this one:We realized that we also drove a lot of signups via referral traffic when other websites wrote product listicles and mentioned HubSpot.Thus, the surround sound strategy was born. Instead of seeking to rank only our own content, we sought to monopolize the search engine results pages for our highest value keywords. This drove hundreds to thousands of new signups per month.I already wrote a whole series about how we accomplished this. I also wrote a piece for Semrush on how my company executed the surround sound strategy for our own podcast.The tactics differ depending on the company, but the goal remains the same: beg, borrow, and buy your way onto the pages that rank for your targeted keywords.First, this requires auditing the SERPs and seeing what already ranks. This will likely be a mix of the following types of pages:Affiliate bloggers Product pages Editorial content from bloggers and competitorsYou can easily audit the search engines using Semrush’s surround sound tool: Ignoring product pages (since you won’t likely get listed on competitor product pages), each type of page warrants its own strategy to get mentioned on it. For review sites, you’ll have to play by their rules, which require either driving tons of customer reviews or paying for placement (I’ll walk through that strategy below). For affiliate bloggers, you’ll have to have an affiliate program or at least be willing to pay a flat fee for placement. For editorial content, you can partner with these companies in various ways, or you can even write net new guest posts for high domain rating sites to try to usurp them in the rankings.And of course, always write your own product listicle since you can control the tone, branding, CTAs, and the placement of your own product on the list.For more detailed instructions on the surround sound strategy, read this post. Best for: business in industries with high search demand. Competitive niches. 2. Decentralized Content MarketingLooking to build up your brand presence on social media? One of my favorite ways to do this is via a technique I call “decentralized content marketing.”Most people look at content marketing as a synonym for blogging. The blog is the centralized repository of all content, and it’s tightly controlled by the content team and their editorial processes. Many B2B SaaS companies and services companies are flipping the script, though. Instead of relying solely on SEO traffic to their blog and using a branded social media account to spread the content, they support and enable each individual employee to build up their own social presence.Two popular examples of this are The Hustle and Morning Brew—both daily tech newsletters. You may follow their official brand accounts, but it’s more likely you follow individuals who work at these companies. The founder of Morning Brew, for example, has over 100k Twitter followers:Steph Smith, who used to work at The Hustle, also has her own powerful Twitter presence (as did almost all of their content creators):The hardest part of decentralized content marketing is incentivizing and supporting your employees in their own content creation and brand.This is how we look at the decentralized content process at Omniscient: Build a bucket of ideas Create message consistency guardrails Identify channel / message / business fit Incentivize employees and lower the friction to posting Repurpose everything Iterate and experimentBuild a Bucket of IdeasYour bucket of ideas could just be a spreadsheet of potential LinkedIn post ideas. It could also be a robust content calendar created through tons of keyword research and customer interviews. What’s important is you develop a massive backlog of content ideas from which your employees can pull. This ensures you don’t have a dry pipeline of content, as you’ll need a constant flow of publication to make this work. The way we do this is by ideating “Kitchen Side” podcast ideas—episodes where we chat about content and SEO related topics and pain points. We have the podcast conversation, record it and publish it, and then pick through the content for social post ideas that the entire team can use to fill their feeds. Create Message-Consistency GuardrailsWhile we don’t care as much about the tone or style our employees write in, many larger companies will want to uphold some sense of brand voice consistency.My advice is to loosen your control here, but you can still create guidelines and guardrails so your employees know how to structure their social posts.The best way to do this is with an editorial style guide or editorial calendar. This can be short and sweet, or extensive. The more detailed and long you make your guide, the harder it is to read and follow, and the less likely you are to get participation. Identify Channel / Message / Business FitFocus only on the channels that can move the needle for your business. Leave room for experimentation, but quickly turn off experiments that aren’t working.For example, we thought YouTube would be a great way to repurpose our long form interviews. But we picked up very little traction after 6 months or so, so we decided to stop making an effort there and instead double down on LinkedIn and Twitter.Which channels you focus on depends on two things: Where your customers hang out What your strengths areIf you pick channels that don’t have target customers, no amount of brand visibility will matter. And if you pick a channel where your customers are, but one that you don’t like using or are unlikely to win at, your strategy will also fall through.There may be target customers for our agency on TikTok, but I don’t use the platform or enjoy the platform, so I choose not to engage there (yet). But many of our target customers are on LinkedIn and I really enjoy writing content there, so we double down on it. Incentivize Employees and Lower the Friction to PostingThis is the hardest part. The more of your employee base that is using social, sharing your content, and building their brand, the better this strategy works.But for many employees, being a thought leader isn’t in their job description.So you have to motivate them. I like the BJ Fogg Behavior Model for this. You can either increase motivation or lower the friction, or both.Increasing the motivation could mean using monetary incentives for certain brand-reach milestones on social media. I could also just mean talking about the strategy in your weekly meetings and making it salient and therefore top of mind. Lowering the friction means making it as easy as possible for people to engage on social media. When we started the strategy, I did this by simply interviewing my team and writing the first month’s posts for them. When they saw traction and engagement, they got hooked and started writing for themselves. It could also mean scheduling a weekly working session or a content brainstorm. Repurpose EverythingThe name of the game in decentralized content marketing is efficiency. If you create one piece of content, it should be repurposed as many times and in as many ways as possible to increase the potential reach.If you record a podcast, turn it into a blog post. Turn that blog post into 10 LinkedIn posts and 30 Tweets. For every tweet you write, use a tool like Jasper (an AI copywriting tool) to rewrite the tweet 10 different ways. Repost it yourself or give these rewrites to your team to post.Find creative ways to repurpose your efforts. This is a volume-based technique, so the more content you can generate from a single idea, the better. Iterate and ExperimentFinally, be open to learning, improvement, and experimentation.I actually use decentralized content marketing to learn what type of messaging resonates. My ladder looks like this: Post on Twitter 30X a week Take the most popular tweets and turn them into LinkedIn posts 4-5X per week Take the most popular LinkedIn posts and turn them into blog posts or podcast discussions Take the most popular blog posts and turn them into courses or webinars. This way, you can use cheap content creation and lower-friction platforms to test what resonates before you spend a ton of time and money creating more expensive assets like ebooks, blog posts, and courses. Best for: B2B business and those that rely on expertise to sell their services or product. Low search volume spaces.3. Review Site MarketingIn some industries, the best thing you can do is be well-represented on the platforms where buyers look to find recommendations.This is especially true for local businesses (think: Yelp), low price B2C products (like books, think: Amazon), and high ticket enterprise software (think: Gartner).All of these platforms have their nuances, but most of them boil down to this: drive a high velocity of positive customer reviews. The exception is Gartner, which has analysts that review the product in relation to both its market share and popularity as well as its strength as a product. Driving reviews as an acquisition technique is sort of a catch 22, as having more customers obviously helps you drive more customer reviews. But make do with what you have: Run an NPS survey and ask your promoters to review you on your site of choice Run a cold outreach campaign to high value customers to create reviews or testimonials If allowed, encourage users to write reviews by giving free product usage or monetary rewards (just make sure they disclose this in their reviews). With this technique, you have to be all in to win. If you just have a few reviews, your competitors will crowd you out. You really need volume for this one to work. Best for: competitive local businesses and B2C companies. Also, high-ticket enterprise software.ConclusionIn some ways, brand visibility is simple. It’s the ‘mere exposure effect’ at scale—the goal is to be visible in places where your potential customers hang out.But choosing where to increase your brand visibility, how to measure it, and how to improve it are the hard parts. To summarize: Brand visibility is a building block of brand awareness. Along with brand perception, these building blocks contribute to “brand equity,” the overall value of a brand. Brand visibility is measured on a per-channel basis, not holistically across many channels. Picking the right channel is just as important as any tactic you choose to increase brand visibilityWhere should you start? I recommend taking advantage of the early-adopter bonus you’ll get when you adopt Surround Sound SEO. It’s the next frontier for brand visibility and your competitors probably haven’t adopted it—yet.",
  "headers": [
    {
      "level": "H1",
      "text": "Brand Visibility—What Is It? How Can I Increase It?"
    },
    {
      "level": "H2",
      "text": "What Is Brand Visibility?"
    },
    {
      "level": "H2",
      "text": "Brand Visibility vs Brand Awareness vs Brand Perception"
    },
    {
      "level": "H2",
      "text": "Brand Awareness"
    },
    {
      "level": "H2",
      "text": "Brand Perception"
    },
    {
      "level": "H2",
      "text": "Brand Visibility"
    },
    {
      "level": "H2",
      "text": "How to Measure Brand Visibility: 6 Methods"
    },
    {
      "level": "H3",
      "text": "1. Brand Search (organic)"
    },
    {
      "level": "H3",
      "text": "2. Search (paid)"
    },
    {
      "level": "H3",
      "text": "3. Search (surround sound)"
    },
    {
      "level": "H3",
      "text": "4. Social Media (organic)"
    },
    {
      "level": "H3",
      "text": "5. Social Media (paid)"
    },
    {
      "level": "H3",
      "text": "6. Referral and Review Sites"
    },
    {
      "level": "H2",
      "text": "3 Ways to Increase Brand Visibility (+ Examples)"
    },
    {
      "level": "H3",
      "text": "Choose Your Channels & KPIs"
    },
    {
      "level": "H2",
      "text": "1. Surround Sound SEO"
    },
    {
      "level": "H2",
      "text": "2. Decentralized Content Marketing"
    },
    {
      "level": "H4",
      "text": "Build a Bucket of Ideas"
    },
    {
      "level": "H4",
      "text": "Create Message-Consistency Guardrails"
    },
    {
      "level": "H4",
      "text": "Identify Channel / Message / Business Fit"
    },
    {
      "level": "H4",
      "text": "Incentivize Employees and Lower the Friction to Posting"
    },
    {
      "level": "H4",
      "text": "Repurpose Everything"
    },
    {
      "level": "H4",
      "text": "Iterate and Experiment"
    },
    {
      "level": "H2",
      "text": "3. Review Site Marketing"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    }
  ],
  "author": ""
}