{
  "url": "https://www.semrush.com/blog/broken-link-building/",
  "slug": "broken-link-building",
  "title": "Broken Link Building: What It Is & How to Do It Right in 2024",
  "description": "Broken link building is finding dead links on other sites and convincing web admins to link to your site instead.",
  "content": "What Is Broken Link Building?Broken link building is the process of finding dead links on other websites and convincing web admins to replace them with working links to your website.A link is “broken,” “dead,” or “invalid” when it points to a page that’s inaccessible. Like this:Usually, you’ll look for links to external pages that return 404 Not Found errors. This HTTP status code indicates that the page was deleted. You can offer the linking site an alternative resource to link out to.However, you can look for other kinds of broken links. And work to inherit them.What Are the Benefits of Broken Link Building?Broken link building can be an effective way to earn links from external domains (known as backlinks). In addition to driving valuable referral traffic, backlinks can benefit your SEO. Because Google treats certain types of backlinks like votes of confidence. The higher the quality and quantity of backlinks you have, the more authoritative your site is perceived to be. And that can lead to higher search engine rankings.Broken link building can have a higher success rate than other link building tactics. Because you’re helping web admins solve an issue on their site. And providing a reason to link to you. Plus, the strategy can help you: Earn backlinks on pages with established traffic and authority Inherit links that previously pointed to competitors Generate link bait ideas (i.e., link-worthy content ideas) How to Do Broken Link BuildingLearn how to do broken link building step by step: Identify Your Broken Backlinks Identify Competitors’ Broken Backlinks Evaluate Link Opportunities Identify Outreach Contacts Send Your PitchLet’s get started.1. Identify Your Broken BacklinksStart by finding dead links that were supposed to point to your website in the first place (i.e., broken backlinks). In these cases, you’re more likely to have a viable alternative link. And the admin is more likely to update the link in your favor.Find broken backlinks with Semrush’s Backlink Audit tool.Enter your domain and click “Start Backlink Audit.”Then, follow the prompts to configure the Backlink Audit tool.Once your backlink audit is ready, go to the “Audit” tab. Check the box next to “Target URL error.”This filters for backlinks that point to 4xx (Client Error) or 5xx (Server Error) pages on your website.Next, go to the “Toxicity Score” filter and select “0-44 Non-toxic.”This filters out potentially harmful backlinks. Restoring these potentially harmful broken backlinks could harm your site.You now have a list of broken backlinks that could be worth fixing.Export the results using the “Export to CSV” button. You can now jump ahead to step three. Or find your competitors’ broken backlinks first.Tip: Use Semrush’s Link Building Tool to find and recover lost backlinks. This includes broken and removed backlinks. 2. Identify Competitors’ Broken BacklinksWhen you find competitors’ broken backlinks, you have an opportunity to “steal” them.There are two main methods: Analyze Your Competitors’ Backlink Profiles Check for Broken Links on Resource PagesLet’s explore each tactic step by step.Analyze Your Competitors’ Backlink ProfilesWith Semrush’s Backlink Analytics tool, you can review your competitors’ backlink profiles. And filter for links to broken pages.To start, enter your domain and click “Analyze.”Click “...” then “Competitors.”The tool provides a list of “Domain Competitors.”This is based on the number of referring domains pointing to each competitor and the number of referring domains you have in common.Generally, the more backlinks you already share, the better your chance of inheriting their broken backlinks.Click on the top competitor’s domain to explore their backlinks.Then, go to the “Indexed Pages” tab.And apply the “Broken Pages” filter. You’ll see a list of 4xx and 5xx pages on the competitor’s site. Click the number in the “Backlinks” column to see a breakdown of backlinks to each one.Filter for “Active” backlinks. Then export your results.Repeat this process for other pages and competitors. And combine your exported data in one spreadsheet.You’ll analyze your opportunities in step three.Check for Broken Links on Resource PagesSome websites have resource pages that contain useful links to external websites. If these pages contain dead links, you might be able to inherit them. (Along with any other links to the broken pages.)Find resource pages using Google. Google search operators can help narrow your search. Here are some templates: “useful links” AND [topic] [topic] intitle:“useful resources” [topic] inurl:resourcesFor example:Use an extension like Check My Links to find invalid links on resource pages.Look for broken backlinks you could inherit. Ones that are relevant to your brand.To find out if the broken page has other backlinks you could pursue, copy the broken URL. Then, paste it into Semrush’s Backlink Analytics tool and click “Analyze.”The “Backlinks” tab shows a list of backlinks to the broken page.Use the “Export” button to save your results in a spreadsheet. You’ll evaluate them in the next step.3. Evaluate Link OpportunitiesNext, evaluate and prioritize your broken link building opportunities. So you can use resources more effectively.One consideration is the potential value of the backlink.Gauge this with Semrush’s Authority Score (AS) metric. It measures the authoritativeness of a page or domain on a scale of 0-100.Generally, the higher the referring page or domain’s score, the more valuable the backlink for SEO.Sort the “Page AS” and “AS” spreadsheet columns into descending order. Tip: For more ways to evaluate the potential value of a backlink, read our backlink analysis guide.Next, review each broken link in context. Simply open its source URL and find the hyperlinked element.To find out what the linked page used to look like, enter the dead link into Wayback Machine.Then, click the date of the most recent snapshot. You can check earlier dates if you need to. When you open the snapshot, you can see the deleted page. And work to find a comparable resource on your website.Consider the alternative link you could recommend to the web admin. And the likelihood they'll accept your suggestion.The web admin is more likely to link to your site if: Your suggested link is relevant and useful in context Your suggested page is the best of its kind Their page gets ample traffic Linking to your site presents no conflict of interest The original link was supposed to point to your siteTip: Maximize your chance of success by improving your content. Or creating quality content from scratch. But you’ll need to weigh the potential benefits against the effort required.Conversely, the web admin is less likely to link to your site if: They can easily find a better alternative Their content is outdated (e.g., an old news article) Linking to your site presents a conflict of interest (e.g., you’re a competitor) The original link was sponsored or pointed to a partner site The original link appears within user-generated content (e.g., a forum comment)In these cases, the admin might decide to link elsewhere, leave the dead link in place, or remove it altogether.So, pursuing these broken link building opportunities could do more harm than good. You’ll waste time and potentially harm relationships with useful contacts.Decide whether the opportunity is worth pursuing and add notes to your spreadsheet.Like this:When you’re ready to pursue one or more opportunities, move to the next step.4. Identify Outreach ContactsOutreach is the process of contacting web admins (usually via email) and requesting that they link to your site. In broken link building, the idea is to point out the broken backlink. And offer your alternative.First, determine whom to contact. Staff writers typically have the motive and power to update dead links. Open the source page’s URL to check for an author byline.You might need to check the writer’s author page or social media profiles to learn more about them.Let’s say you’re pursuing a broken link building SEO opportunity in this article:Natasha’s author page shows that she’s a staff writer. And even includes her email address.You could even try direct messaging her on Twitter.If that tactic doesn’t work, check the site’s “Contact” or “Meet the Team” page.Look for a specific contact (a particular person’s email address) rather than a generic email address (like hello@example.com). Direct requests to the most relevant person are more likely to succeed.Tip: For help finding an email address, try Prowly. The tool’s media database contains over 1 million contacts. And you can search by name or website.5. Send Your PitchNext, write and send your pitch. Admins are often receptive to broken link building emails. After all, you’re bringing their attention to an issue on their website. And providing a suggestion to help them fix it.You’ve ensured your alternative link is a good fit and identified the right contact. All that’s left is making a clear, friendly, and compelling proposal.Here are some best practices: Start with a personalized greeting Reference the broken link upfront Explain why your link makes a good alternative Include hyperlinks for easy reference Keep your email conciseHere’s a broken link building email example:Hi Michael,I noticed your Dunder Mifflin article “How to Make Your Office More Economical” contains a broken link.Looks like EcoMag deleted their paper recycling report, as the URL brings up a 404 error.If you’re looking for an alternative, we’ve just published a new paper waste report here at WasteCo.We found that offices recycle just 40% of paper on average!Kind regards,LesleyAfter sending your email, keep an eye out for a reply. Or an update to the broken link.If there’s no change after three working days, follow up in the original email thread. Just ask the contact whether they’ve had a chance to consider your proposal.Alternatively, simplify the entire broken link building process using Semrush’s Link Building Tool.After setting up your campaign and connecting your email account, head over to the “In Progress” tab.Scroll down and click “Import.”Select “General” as the outreach strategy.Enter the referring domains selected for broken link building and click “Add” > “Add new domains.”Next, find the site you want to email and click “Contact.”On this page, you’ll draft a broken link building outreach email.You can even save it as a template.Once you’ve written the email, click “Send and proceed to next.”The tool will automatically update the “Status” column.You can see whether your email has been sent, delivered, read, or replied to. Ideally, you’ll eventually see the notification, “Backlink earned.”Go to the “Monitor” report to learn more about your backlink and ensure it remains active.Tip: Semrush’s Link Building Tool finds other link building prospects based on your target keywords and competitors. Check them out in the “Prospects” report.Don’t Stop at Dead Link BuildingBroken link building is just one way to earn backlinks that drive SEO results and referral traffic. To build a healthy backlink profile, employ a variety of link building tactics.To keep learning, check out these resources: Link Building for SEO: The Beginner’s Guide Link Building Strategies: 8 Ways to Build Links in 2024 Backlink Management Course with Greg GiffordOr find missed backlink opportunities with Semrush’s Backlink Gap tool. It shows which domains link to your competitors, but not to you.You can easily review prospects and send your favorite opportunities to the Link Building Tool.",
  "headers": [
    {
      "level": "H1",
      "text": "Broken Link Building: What It Is & How to Do It Right in 2024"
    },
    {
      "level": "H2",
      "text": "What Is Broken Link Building?"
    },
    {
      "level": "H2",
      "text": "What Are the Benefits of Broken Link Building?"
    },
    {
      "level": "H2",
      "text": "How to Do Broken Link Building"
    },
    {
      "level": "H3",
      "text": "1. Identify Your Broken Backlinks"
    },
    {
      "level": "H3",
      "text": "2. Identify Competitors’ Broken Backlinks"
    },
    {
      "level": "H4",
      "text": "Analyze Your Competitors’ Backlink Profiles"
    },
    {
      "level": "H4",
      "text": "Check for Broken Links on Resource Pages"
    },
    {
      "level": "H3",
      "text": "3. Evaluate Link Opportunities"
    },
    {
      "level": "H3",
      "text": "4. Identify Outreach Contacts"
    },
    {
      "level": "H3",
      "text": "5. Send Your Pitch"
    },
    {
      "level": "H2",
      "text": "Don’t Stop at Dead Link Building"
    }
  ],
  "author": ""
}