{
  "url": "https://www.semrush.com/blog/buyers-journey/",
  "slug": "buyers-journey",
  "title": "The Buyer’s Journey: What It Is & How to Map It",
  "description": "The buyer’s journey refers to the awareness, consideration, and decision stages a customer goes through.",
  "content": "What Is the Buyer’s Journey?The buyer’s journey (or purchase journey) is the process a customer typically goes through before making a purchase. From the moment they identify a desire or need to when they decide to buy.Understanding the buying journey helps you choose the best marketing tactics and communicate with your audience more effectively. And that should ultimately lead to more sales.The process is typically broken down into three stages.What Are the Buyer Journey Stages?The three stages of the buyer’s journey are awareness, consideration, and decision.The consumer becomes aware of a problem, considers the solution(s) available, then decides where to buy.Let’s say you sell kitchen appliances: Someone’s dishwasher breaks and they want a replacement (awareness) They read online comparison guides about the best models (consideration) They decide to buy from you because you offer free delivery (decision)In reality, your customers’ buying journeys are unique. And they can be far more complex than this model suggests.But the awareness > consideration > decision framework makes it easier to understand prospects’ thoughts and behaviors at the most important stages. So you can work out how to engage them earlier in their decision-making process. And increase the chance that they ultimately buy from you.NoteThe three stages of the buyer’s journey correspond with the top, middle, and bottom of the marketing funnel (ToFu/MoFu/BoFu). This model helps you understand audience behavior on the whole, rather than a specific buyer’s perspective. How to Do Buyer Journey MappingBuyer journey mapping is the process of defining and visualizing the awareness, consideration, and decision stages.The idea is to create representatives of valuable buyer journeys. So you can work out how to engage prospects at each crucial phase.Let’s dive in.1. Create Buyer PersonasBuyer personas are fictional profiles that represent different types of prospects. They help you understand the audience segments you’re targeting.Personas typically cover: Demographics Socioeconomic status Personality and habits Pain points Content preferencesHere’s an example created with Semrush’s Persona tool:To create effective buyer personas, you need to conduct audience research.First, analyze your competitors’ audiences with Semrush’s One2Target tool.Choose your target country, enter the domains of up to five competitors, then click “Analyze.”The tool will gather insights about these rivals’ audiences. Here are the charts you’ll find in each report: Demographics: Age, gender, and location Socioeconomics: Household size, household income level, employment status, and education level Behavior: Most visited social media platforms, top interests (based on visited domains), and most-used devicesYou can analyze your own website visitors in Google Analytics 4 (GA4).After signing in, go to “Reports” > “User” > “User attributes” > “Overview.”GA4 collects the following data about web users by default: Demographics: Age, gender, interests, language, Location: City, country, region, continent, subcontinent Technology: Browser, operating system and version, platform, device brand, device categoryTo get additional data, you need to configure your own user-scoped dimensions.You can then use the “Audiences” report to see how predefined or custom segments (e.g., users in San Francisco) interact with your site differently.The data you gather will help build realistic buyer personas for existing and prospective audiences. So you can get into their mindsets more easily.2. Analyze Users’ Traffic JourneysTraffic journeys are routes users take through various webpages or websites.When you know what websites and channels are involved in the buyer’s journey, you can try to engage your prospects through them more effectively.For example, a prospect with a broken dishwasher might take this journey: google.com, to search for information about the latest models consumerreports.org, to see their dishwasher ratings google.com, to search for their chosen model bestbuy.com, to see the price of their chosen model lowes.com, to see the price of their chosen model bestbuy.com, to buy their chosen modelKnowing that, you might decide to: Use search engine optimization (SEO) and/or paid search ads to get more exposure in search engine results pages Run digital ads on popular sites in your niche Form partnerships with influencers List your business on directories, review sites, etc. Post social media content and adsBy reaching prospects earlier and more frequently, you increase the chance they ultimately buy from you.You can see what sites and channels your current visitors come from by going to “Life cycle” > “Acquisition” > “Traffic acquisition” in GA4.TipGoogle can identify some traffic sources (e.g., google.com, facebook.com) automatically. For more precise tracking, use UTM parameters on links placed outside your site.To find out where your competitors’ visitors come from, use the Traffic Analytics tool.After entering the domain(s) you’re interested in, open the “Traffic Journey” report.Then, scroll down to “Traffic Journey Details.”Below, we can see that organic (unpaid) Google results drive 27.99% of competitors’ traffic. This indicates that organic search plays a major role in awareness and consideration stages.If you go to the “Destinations” tab, you’ll see where users go after visiting your competitors.This can provide valuable insight into the consideration and decision stages.In our example, many users go to coupon sites like capitaloneshopping.com after visiting a competitor. This suggests that discounts play a major role in the decision stage.Our dishwasher retailer might therefore decide to offer exclusive discounts. Or partner with coupon sites.TipYou can access Traffic Analytics, One2Target, and other helpful tools with a Semrush .Trends subscription.3. Perform Keyword Research for Every StageKeyword research is the process of identifying search engine queries that prospects use. So you can work out how to appear in the results for them.Here’s a keyword example for each buyer journey stage: Awareness: dishwasher not draining Consideration: best dishwasher 2024 Decision: frigidaire dishwasherMany marketers rightfully focus on buyer keywords (search queries that people use when they’re ready to purchase). Because they’re keen to generate sales.But it’s important to target keywords used in the earlier stages, too. Not only will this maximize your brand’s reach, but it will help you build trust that can pay dividends later.One of the best ways to find keywords is with Semrush’s Keyword Magic Tool.Enter a term to base your search around (e.g., “dishwasher”), choose your target country, and click “Search.”By default, the tool presents a list of “Broad Match” keywords that contain your starting keyword or a close variation.In the “Intent” column, you can see the type(s) of search intent behind each keyword—i.e., the general purpose behind the user’s search. This gives a good indication of what buyer journey stage the keyword corresponds to. Intent Type Description Buyer Journey Stage Keyword Example Informational (I) The user wants to find information Awareness dishwasher not draining Commercial (C) The user wants to research a brand, product, or service Consideration best dishwasher 2024 Navigational (N) The user wants to find a specific page or website Decision best buy dishwashers Transactional (T) The user wants to take action (e.g., buy something) Decision frigidaire dishwasher You can easily filter by intent. And other data points, such as: Volume: The average number of monthly searches for the keyword KD %: The keyword difficulty score, which measures organic ranking difficulty out of 100 CPC (USD): The estimated cost per click to advertise on this keywordOnce you’ve identified the keywords you want to target, you can create SEO-friendly content and/or paid search ads.4. Fill Out the Buyer’s Journey TemplateUse our free buyer’s journey template to record key information about your buyer journeys.Follow the link then click “Use Template” to create your copy in Google Docs. (You might need to sign into Google first.)Then, follow the advice in this guide to fill out each section.You should end up with a few buyer journey maps that look something like this:Buying Journey Content: Tips & ExamplesLet’s explore some content marketing tips and examples for the three buyer stages:Awareness StageAwareness stage content should help prospects to recognize and understand their pain point. That way, you can build trust with the prospect. And start guiding them toward purchase.For example, appliance brand Whirlpool has a blog post about how long dishwashers run for. It gets around 7.3K unpaid visits from Google each month, according to Semrush’s Organic Research tool. The post attracts people who are concerned about their appliance’s performance. And gives them useful advice and information—with no hard sell.As a result, prospective customers are gently guided toward the next phase of the buying journey. Having built familiarity and trust with the Whirlpool brand.Generally, the best types of content for the awareness stage are: Troubleshooting guides/videos How-to guides Checklists Thought leadership Industry/company news articles Original research TemplatesConsideration StageConsideration stage content should help prospects weigh the solutions available to them. And present your product or service as one of the best options.For example, Whirlpool has a dishwasher measurement guide that equips shoppers with all the information they need to find the right-sized model. It also introduces them to relevant products.Generally, the best types of content for the consideration stage are: Comparison guides Buying guides FAQs Product buying quizzes Gift guidesDecision StageDecision stage content should convince customers to get their chosen product or service from you (rather than a competitor).For example, Best Buy’s product pages immediately draw attention to special offers, financing options, pickup/delivery information, and customer reviews. Which can all play a pivotal role in customers’ buying decisions.Shoppers can also read various questions and answers. Or speak to a customer service advisor.This reduces the risk that they abandon their purchase due to a lack of information. Generally, the best types of content for the consideration stage are: Landing pages/product pages Free trials or demos Customer reviews/testimonials Case studies/success storiesNoteThe buyer’s journey is a subset of the customer journey, which also includes post-purchase stages such as loyalty and advocacy.Start Mapping Your Buyer JourneysIf you haven’t already, create your buyer journey template.Then, claim your free Semrush trial to start collecting valuable data: Define your audience’s demographics, socioeconomics, and behaviors Research your prospects’ traffic journeys Find out what keywords your prospects use Analyze your competitors’ content",
  "headers": [
    {
      "level": "H1",
      "text": "The Buyer’s Journey: What It Is & How to Map It"
    },
    {
      "level": "H2",
      "text": "What Is the Buyer’s Journey?"
    },
    {
      "level": "H2",
      "text": "What Are the Buyer Journey Stages?"
    },
    {
      "level": "H2",
      "text": "How to Do Buyer Journey Mapping"
    },
    {
      "level": "H3",
      "text": "1. Create Buyer Personas"
    },
    {
      "level": "H3",
      "text": "2. Analyze Users’ Traffic Journeys"
    },
    {
      "level": "H3",
      "text": "3. Perform Keyword Research for Every Stage"
    },
    {
      "level": "H3",
      "text": "4. Fill Out the Buyer’s Journey Template"
    },
    {
      "level": "H2",
      "text": "Buying Journey Content: Tips & Examples"
    },
    {
      "level": "H3",
      "text": "Awareness Stage"
    },
    {
      "level": "H3",
      "text": "Consideration Stage"
    },
    {
      "level": "H3",
      "text": "Decision Stage"
    },
    {
      "level": "H2",
      "text": "Start Mapping Your Buyer Journeys"
    }
  ],
  "author": ""
}