{
  "url": "https://www.semrush.com/blog/changing-domain-name-seo/",
  "slug": "changing-domain-name-seo",
  "title": "Changing Domain Names & SEO: Tips to Keep Your Rankings",
  "description": "Learn how to change your domain name without experiencing a loss in organic search rankings.",
  "content": "Does Changing Domain Names Affect Your SEO?Changing domain names can affect your website’s authority, rankings, and traffic. In some cases, it can feel like starting over from an SEO perspective. One of the main reasons why is that backlinks (links from other sites that point to yours) to your old website won’t automatically point to your new site. And those are important factors search engines like Google take into account when ranking your content.Think of it this way:Changing your domain name changes the URL of every page on your website. So, all the backlinks you had pointing to your old domain no longer point to your website. That said, it’s hard to predict the exact SEO impact of changing domain names. And you don’t necessarily have to lose your backlinks.There are also other things to consider.So, let’s look at some scenarios when switching domains might be a good idea. And some scenarios when it might not be.When You Might Want to Change your Domain NameThere are a few reasons why you might want to change your domain name: Rebranding or changing your company name: If your business undergoes a rebrand or name change, updating your domain to match can ensure consistency and avoid causing confusion Choosing a better-known top-level domain: Moving from a less common top-level domain (TLD) like “.net” to a more recognized one like “.com” can increase credibility and memorability Picking a simpler domain: This can increase direct traffic and make your brand more memorable Expanding to new markets or product lines: A new domain might better reflect your expanded offerings or target audience Overcoming negative associations: If your domain has been associated with negative press, a new one may offer a fresh startWhen You Might Not Want to Change Your Domain NameChanging your domain name isn’t always a good idea. It’s best to avoid making a change if: You have established brand recognition: If your current domain is well-known and associated with your brand, changing it could confuse customers and prospects. And cost you your hard-earned awareness. You recently invested in marketing: If you've just spent a substantial amount on marketing materials or campaigns featuring your current domain, changing it right now means that time and money was wasted You’re in the middle of a peak business period: Changing domains during your busiest season could disrupt sales. It’s often better to wait for a quieter time when less revenue is at risk. You don’t have sufficient budget: Domain changes can be costly when factoring in new branding, marketing, and potential technical issues Your team lacks technical expertise: A domain name change is a type of website migration, so it’s not always feasible for smaller companies without development resourcesAn Overview of How to Migrate to a New DomainHere’s a general overview of what goes into migrating to a new domain name:NoteThis is a high-level look at what a migration entails. For step-by-step guidance, check out our website migration checklist. 1. Do Preliminary WorkTake your time to prepare for the migration. To ensure you stay organized and don’t make mistakes. It’s a good idea to collect some benchmark data, establish clear goals, and create a detailed timeline. And for a domain change, you’ll want to purchase a new domain and also configure the domain name system (DNS) settings. These make your site accessible and impact performance.2. Create a New Site and Block Access to ItThe simplest way to create a new website for a domain name change is to create a copy of your existing site. Which you can then use as a staging site to make changes and run tests.This is rather technical, so work with a developer who understands the process.Then, make sure to block access to the staging site. There are a few ways you can do this, but consider using password protection. Which displays a login screen like this:This prevents both web crawlers and users from accessing your new site before it’s ready.And consider adding a noindex tag to every page—which tells crawlers not to include them in search results. Especially if you plan to run tests to verify that your new site can be properly crawled before pushing it live.3. Prepare the New SiteMigrations focused on changing domains don’t often require substantial changes. But if you do need to make any, now’s the time to do it.That might include adjusting your navigation, updating your logo, etc.Just know that it’s typically best to keep changes as minimal as possible. To avoid disruptions and determine what causes any issues that arise. 4. Map Old URLs to New URLsNext, build a list of your current website’s pages. Because you’ll need to implement redirects from all of the old pages to their new locations on the new domain.You’ll do this using 301 redirects. Which are permanent redirects that tell search engines and browsers that your original URLs have been permanently replaced with new ones.To create your list, use Semrush’s Site Audit tool.Enter your old domain and click “Start Audit.”Follow the prompts to configure the audit. And be sure to set the limit to higher than the total number of pages you have on your site. To ensure nothing is missed.Once the crawl is complete, click the “Crawled Pages” tab to see a full list of your URLs. In the top right corner, click “Export” and choose either “Export to XLSX” for Excel or “Export to CSV.”You can now map each of your previous URLs to the new URL where the same content will live on the new site.For example:If the URLs of your content are staying the same besides the domain name, things will be pretty easy. Your new URL will simply be the same as the old url but with the domain switched out. If you’re also changing the subfolders or URL slugs of pages on your site, then you’ll need to be careful when mapping old URLs to the new ones.For example, if you’re changing from “old-domain.com/about-us/” to “new-domain.com/about/.”If there are any pages on your old site that you don’t want to keep, don’t set a new destination for them. But set them to serve a 410 status code—this indicates the page has been permanently deleted. 5. Update the URLs on Your New SiteYou can now begin the process of updating all the internal links on your new website. So you’re not using unnecessary redirects that can slow down your site and potentially hurt your SEO performance. Relying solely on redirects could also lead to redirect chains—when multiple redirects occur between an initial URL that’s requested and the final destination URL. This can be confusing for users and also impact how search engines crawl your website.So, go through each page and update all the internal links to point to the appropriate URL on your new site. This includes links that appear in your website’s code, your XML sitemap (the file that lists all the URLs you want search engines to index), and your robots.txt file (which specifies the URLs you want to block).6. Back Up Your Old WebsiteBefore you start the migration, back up your website. So you can revert to it in case anything goes wrong during the transfer.It can also provide a handy comparison tool to check that all content and features have been successfully migrated to the new domain.The process depends on how your site’s hosted. A few options are to do it through your site host’s control panel or a content management system (CMS) plugin.There are also third-party services like CodeGuard or Sucuri that will do it for you.7. Migrate Your Site and Remove BlocksNext, make the new site live. And try to do it during low-traffic times if possible.It’s best to move in stages to reduce the risk of making a mistake. So consider moving just one section at a time.Once your new site is live, remove the blocks (password protection and/or noindex tags) you added earlier. So both search engines and users can access your site. At this point, we recommend running Site Audit on your new website. So you can see whether there are any issues in the “Crawlability” report that need to be addressed.8. Enable Redirects and Page RemovalsOnce your new domain is live with all of your content, you need to implement your 301 redirects. So users and search engines see your new content rather than error messages. If you have a WordPress site, you can use plugins like Yoast, RankMath, or Redirection. Just make sure that the plugin you use allows you to redirect using absolute URLs (the entire page addresses)—not just relative URLs. If the plugin only supports relative URL redirects, you won’t be able to redirect your old domain’s URLs to the new one. If you’re not using WordPress or you have many pages on your site, you may need to use a more advanced method for implementing redirects in bulk. Like adding redirects through your .htaccess file.9. Monitor ResultsTo determine whether your domain migration has been successful, periodically monitor your performance data.When you first change your domain, your organic search traffic will almost certainly drop. You should see your traffic rebound in a few weeks. But it can vary. So, continue to compare the data from your new site against the data you collected from your old site.If you don’t see improvements after a few weeks, consider using the Site Audit tool to check for technical and on-page issues that could be getting in the way.Tips for Changing Your Domain the Right WayNow that you have a better understanding of what goes into a migration, let’s go over some tips that can make changing domain names even smoother.Choose an Appropriate Domain NameYour site’s domain name might not be a ranking factor for you, but it can impact your visibility and click-through rates.For example, people who don’t know your domain but know your brand are likely to use Google to search your brand name. And if they see a URL that matches the brand name in the search engine results page (SERP), they’re going to be more likely to click.When choosing a new domain name, there are two parts to consider: Second-level domain: The unique identifier of your website (e.g., the “semrush” in “semrush.com”). This should match (or nearly match) your brand name. Top-level domain: The part that comes after second-level domain (e.g., the “.com” in “semrush.com”)It’s usually (but not always) best to opt for a domain name that ends in “.com.”If you can’t get a “.com” domain name that makes sense, consider “.co,” or “.net.” These are also memorable options. Or think about alternative TLDs that are more relevant to your business.For example, “.io” is a good choice for companies that want to be strongly associated with technology.Pro tipYou should also check that there are social media accounts available with the same name. To ensure consistency across your entire online presence.But don’t rush into choosing a new domain name.Make sure the domain you want is available. And then check whether it was previously owned. If it was, you might want to verify that it doesn’t have a lot of toxic backlinks (bad links that can sometimes hinder SEO performance). You can check a domain’s backlinks using Semrush’s Backlink Audit tool.Export Your Backlinks & Ask Those Sites to Update the LinksBefore changing domains, it’s critical to take stock of your website’s backlinks. So you can take steps to reclaim them rather than relying solely on your redirects. Using Semrush’s Backlink Analytics tool, you can easily see all of the links pointing to your old site.Input your old domain and click “Analyze.”Click on the “Backlinks” tab. Then, click “Export” and save the list as either an Excel spreadsheet or a CSV file. Use this list to identify any relevant, high-authority websites that link to your old domain. Then, consider contacting them to ask them to update their links to your new site.NoteRedirecting old pages with backlinks pointing to them is helpful from an SEO perspective. But it’s often better to have the link point directly to your new domain. And you achieve that after changing domain names through outreach.Outreach involves contacting the website owners and asking them to make updates to existing links on your behalf.For each link you want to address: Identify the right contact: Determine the best person to contact Craft an outreach message: Write an email explaining that you changed domains and request that they update the link in question Be specific: In the message, be sure to indicate exactly where the link is on their website, which page it links to, and the new URL you want them to useOutreach campaigns like this can take a lot of time. And you likely won’t succeed with every message.So, prioritize the most important links to avoid wasting time and resources.Verify Your New Website with Google Search ConsoleVerifying your new domain with Google Search Console (GSC) informs Google about the domain name change. You’ll need to do two things here: Create a property for your new domain Use Google Search Console’s Change of Address toolTo get started, log in to Search Console.Click on the property drop-down at the top and choose “+ Add property.”This will take you through the process of setting up GSC for your new domain.Once you’ve set up the property for your new domain, go back to the property for your old domain.Then, click “Settings” and select “Change of address.”Under “Update Google,” click the “Select new site” drop-down and choose the domain property that you just set up for your new website.When you’re done, click “Validate & Update.” Google will then attempt to validate that you’ve implemented the necessary redirects before indicating a change of address. Once successful, a notification will appear on both the old and new domain properties.Search Console will begin populating data for your new domain (this could take a few days), and notify you of any related errors.NoteYou’ll need to update other tools and platforms you use with your new domain as well. Like your Google Business Profile, Google Analytics 4, social media pages, and any citations that mention your business details. Announce the Domain ChangeAfter you’ve successfully changed your domain, let everyone know. To encourage traffic to the new site and help avoid any confusion. Let people know via: Social media Email Blog post Press releaseYou could also add a note on the website itself. So, if people reach the new domain through a redirect, they’ll know to go straight to the correct domain next time.Pro tipIf you have physical marketing materials with the old domain name on (like flyers, business cards, and banners) make sure to print updated versions with the new domain.Verify That Your Internal Links All Got UpdatedUse Semrush’s Backlink Analytics tool to make sure all your internal links are now pointing to your new domain.Enter your new domain and click “Analyze.”Then, click the “Outbound Domains” tab to see a list of the domains that your new site links to. Look for instances of your old domain on the list. And click the arrow next to the number of outbound links to expand the list. This shows each of the pages on your new domain that contain a link to your old domain. Next, go through each page and change the links so they point to your new domain.FAQsHow Many 301 Redirects Can You Have?There’s no limit to the number of 301 redirects you can have. But it’s still best practice to minimize the number of redirects on your site. Because having lots of them can affect your website’s performance.How Long Should Redirects Stay in Place?Your 301 redirects are classed as permanent redirects and should stay in place for as long as you use your new domain name. If you need a temporary redirect for whatever reason, use 302 redirects. But remember to eventually update them.How Long Will It Take for Google to Index Your New Domain?Google doesn’t provide a set time frame for how long it takes to index your new URLs. This process can take several weeks in some cases. You can track your new domain’s search rankings and visibility using the Project Dashboard in Semrush. Access this and many more digital marketing tools with a free Semrush trial.",
  "headers": [
    {
      "level": "H1",
      "text": "Changing Domain Names & SEO: Tips to Keep Your Rankings"
    },
    {
      "level": "H2",
      "text": "Does Changing Domain Names Affect Your SEO?"
    },
    {
      "level": "H2",
      "text": "When You Might Want to Change your Domain Name"
    },
    {
      "level": "H2",
      "text": "When You Might Not Want to Change Your Domain Name"
    },
    {
      "level": "H2",
      "text": "An Overview of How to Migrate to a New Domain"
    },
    {
      "level": "H3",
      "text": "1. Do Preliminary Work"
    },
    {
      "level": "H3",
      "text": "2. Create a New Site and Block Access to It"
    },
    {
      "level": "H3",
      "text": "3. Prepare the New Site"
    },
    {
      "level": "H3",
      "text": "4. Map Old URLs to New URLs"
    },
    {
      "level": "H3",
      "text": "5. Update the URLs on Your New Site"
    },
    {
      "level": "H3",
      "text": "6. Back Up Your Old Website"
    },
    {
      "level": "H3",
      "text": "7. Migrate Your Site and Remove Blocks"
    },
    {
      "level": "H3",
      "text": "8. Enable Redirects and Page Removals"
    },
    {
      "level": "H3",
      "text": "9. Monitor Results"
    },
    {
      "level": "H2",
      "text": "Tips for Changing Your Domain the Right Way"
    },
    {
      "level": "H3",
      "text": "Choose an Appropriate Domain Name"
    },
    {
      "level": "H3",
      "text": "Export Your Backlinks & Ask Those Sites to Update the Links"
    },
    {
      "level": "H3",
      "text": "Verify Your New Website with Google Search Console"
    },
    {
      "level": "H3",
      "text": "Announce the Domain Change"
    },
    {
      "level": "H3",
      "text": "Verify That Your Internal Links All Got Updated"
    },
    {
      "level": "H2",
      "text": "FAQs"
    },
    {
      "level": "H3",
      "text": "How Many 301 Redirects Can You Have?"
    },
    {
      "level": "H3",
      "text": "How Long Should Redirects Stay in Place?"
    },
    {
      "level": "H3",
      "text": "How Long Will It Take for Google to Index Your New Domain?"
    }
  ],
  "author": ""
}