{
  "url": "https://www.semrush.com/blog/common-agency-challenges-solutions/",
  "slug": "common-agency-challenges-solutions",
  "title": "Common Agency Challenges and Solutions: An Insider’s View",
  "description": "For insights and solutions, we reached out to agency owners and managers to ask them about their biggest challenge and how they deal with them. You will find a solution for each; there is a lot to learn,",
  "content": "Agency struggles are real; we hear about them all the time at Semrush. One of our goals is to provide as many solutions to you as we can. So we asked our community which of the following is their biggest agency struggle — management, client management, training, or work efficiency. As you can see, work efficiency was the winner, but all of the issues appear to be challenging according to the comments we received. To gain some insights and solutions, we reached out to agency owners and managers to ask them about their biggest challenges and how they deal with them. Below you will find a solution for each; there is a lot to learn, so keep reading and share your thoughts in the comments. Marty Weintraub, Aimclear All of the above are challenges, with the greatest being client management. Like any cutting-edge service or consulting industry, clients come to our relationship with set expectations, usually based on the outcome their model requires — not the realities of a competitive, integrated marketing environment that requires testing and experimentation to solve. We have learned how a great deal of friction can be avoided by setting expectations in healthily assertive ways, as to a range of possible outcomes for each tactic and what next steps might be for each scenario towards the end goal. We are not afraid to discuss and gain advance buy-in for how testing iterations may succeed and common reasons for failure; this encourages our clients to observe with a more realistic perspective. Victories are sweeter because our client knew that sometimes brands fail in this tactic--and they won. Since we are usually successful, gaining buy-in for reality is a happy trust builder.It is also easier to have the hard conversation after rare but inevitable testing framework setbacks because everyone understood possibilities ahead of time — also trust-building. Jake Bohall, Hive Digital I would agree that all of these items have been a challenge for our agency over our 17+ years, with some being more prominent than others from time to time. As a small agency, we tend to be able to experiment and test new methods, and have discovered that depending upon staffing/clients/etc. — any one technique is subject to suddenly become inefficient. Improving Management Processes Our agency spent a number of years addressing management styles and work efficiency by employing the principals from the book \"Scaling Up\". While it may seem a bit cheesy, this book really improved our management processes and has helped our team become much more efficient — which generates more success for our customers, empowers our teams, and makes room to grow the business.The book helps you develop meeting cycles and structure your business around scalable systems to be a more efficient, fluid, and process-driven organization. Work Efficiency Another key approach we have taken towards work efficiency is to ensure we have established 'work time' on our calendars (blocking other calls, etc. from happening) and that we give our employees time for learning. We have an expectation that each person invests 80-100 hours on specific client-related work each month, which leaves quite a bit of time for organizing self, staying up to date on trends/changes, and open debates within the teams on best practices. Without this carve-out for \"me time,\" our team would be over-extended on deliverables and wouldn't be able to keep up with the industry pace or develop new ideas. We have also experimented with rotating clients internally (not the lead, just the bulk of the work), as every iteration breeds improvement. When you \"catch up\" on what someone else has been doing, you are likely to ask why did they do it this way — they could have done x, and almost every time that happens, the entire team learns something and gets more efficient. Kelsey Libert, Fractl In seven years, Fractl went from a small family-run business to a 100+ person agency with offices across Florida, California, and the UK. We faced challenges across all four of the points you outlined at different phases in our growth. Work Efficiency/Training When we first founded Fractl in 2012, Kristin was creating projects, and I was pitching — we were the All-Star team landing client coverage on TIME, TechCrunch, CNN, and the most elusive sites on the web. As our lead-flow and company grew, we needed to become better educators and delegators in order to manage the next phase in our business: scale and efficiency. For our Media Relations team, I put together a 25-page training guide with granular sections on the most important parts of pitching — personalization, subject lines, and framing of actionable story-based takeaways. My favorite asset was a “winning pitches” document that highlighted unique pitches I wrote that landed top-tier press, something junior team members could emulate. Over the years, we added “pre-pitch strategy templates” and “promo collaboration meetings” as a way for our top performers to help give feedback and train junior team members. More recently, we started incentivizing placements with new publishers and writers, so our team wouldn’t fall back on established relationships resulting in writer burnout. Additionally, to fight burnout, we created opt-in weekly email blasts for our most prized writer relationships, allowing these writers to pick their favorite campaigns from a weekly email of new content (vs. 10 different pitches from Fractl a week). In Creative Strategy, Kristin implemented “Peer Review” which created a platform for campaign feedback during two critical points in production, and gathered Kristin and other senior team members for feedback to ensure we were putting our best work out across a myriad of clients. As publishers became more stringent with the types of content they’d accept, we added in SPS testing, more rigorous methods reviews, and new methodologies to help increase the authority of our content. Lastly, we’ve been utilizing Klipfolio to build robust agency analytics in each of our core departments: Creative Strategy, Media Relations, Editorial, Design, and Account Management. These analytics helped us identify agency capacity, performance benchmarks, and challenging clients, among a dozen other metrics that bubble up important issues and opportunities our executive team needs to address. Management Employee management is one of the hardest and most rewarding parts of business ownership. When Fractl was small, the team felt like a family — my co-founders Nick and Dan hosted several employees for Thanksgiving dinner every year, and Kristin and I routinely threw house parties throughout the year. Our small size fostered more frequent communication and collaboration between partners and employees, which led to greater trust, transparency, and respect across the entire agency. As we grew, the partners needed to step back from the day-to-day 1:1 employee management, and focus on optimizing the business for scale. We fumbled a few times putting people in place who were excellent executors, but subpar managers, and quickly learned too much distance from operations was not good for the business and its need for constant refinement and innovation. We stepped back in to flatten the org and test new management models, ultimately landing on the Account Team model, which created “mini Fractl’s” within the agency, having account managers, designers, writers, creative strategists, and media relations cohorts specialize on specific client verticals. Client Management In Fractl’s early years, we quickly learned client diversification was key to our longevity when one $MM client represented 50% of our revenue, which was a huge risk. We worked aggressively over the next year to increase our brand awareness and authority while simultaneously increasing our minimums to 6-12 month contracts, which enabled us to make a larger impact on our clients and demonstrate a greater ROI which in turn provided greater stability in our client roster. Motoko Hunt, AJPR \"Client Management\" can be a huge challenge as each client has different structures, understandings of SEM/SEO, and different goals. It takes time for a client and an agency to understand each other's process. I realized that I needed to first understand clients before I start the work, or nothing will change on the client's campaigns or websites. Since then, I have been using the first couple of meetings to understand them. The questions I typically ask them are about: Organizational structure, with details of who manages or handles what. Typical workflow and process of marketing and content creation. Global websites and management process. Their current year's business goals. Current pain points and challenges. The responses and inputs from a client help me to provide the projects and recommendations that work for them. I also provide SEM/SEO training to clients — not just for the SEM/SEO teams but also to the departments that will have a huge impact on search performance such as IT, Web, Content Editors, and Marketing. When they understand how their work impacts the websites and campaign performances, they are much more cooperative. Lily Ray, Path Interactive For SEO professionals, working through day-to-day tasks with efficiency can be a challenge given how many different marketing strategies we are tasked with focusing on at the same time. Agency life, in particular, requires balancing all of those marketing initiatives for several clients at a time. Having multiple clients also means day-to-day schedules can also be unpredictable; if one client is facing a website emergency that happens to take place during an important scheduled meeting with another client, agency employees must figure out creative ways to be everywhere at once. At Path Interactive, we've developed numerous techniques and processes for increasing our efficiency and being able to deliver high-quality work to all our clients at the same time. They boil down to three components: the right staffing model, the right technology, and consistent, open communication. Staffing We take hiring seriously and conduct rigorous interview processes that ensure employees have a strong work ethic, a passion for digital marketing, strong communication skills, and a curiosity to try new things and bring new ideas to the table. We generally ask potential candidates to complete an SEO exercise which helps us to better understand their approach to solving problems. We also maintain a strong intern program which gives us the ability to train prospective hires over the course of several months — giving them deep, hands-on experience in SEO and creating a great pool of potential employees to pull from in the future. By bringing on the right people and training them properly, it ensures our team is equipped to handle the fast-paced, dynamic, and challenging work they’ll dive into as part of our team. It also helps solidify that the teams are able to multi-task, change gears, and move quickly, which is required for success at an agency. In some cases, we also identify dedicated role opportunities to solve for certain time-intensive workflows such as analytics configuration or editorial support. Building a staff with both generalized and specialized expertise can also help improve efficiencies in a big way. Technology Investing in the right technology makes us smarter and helps us do our jobs more effectively. Our team invests in over 30 pieces of SEO software, from enterprise crawling to rank tracking, link auditing, site architecture visualization, wireframing, and more. With a variety of tools, we are able to create efficiencies in our workflows by knowing which tool to use for which process, and saving time that would have been spent doing manual analysis. For example, by creating automated dashboards and pulling in data from a variety of our tools, we eliminate the need to manually build reports on a weekly/monthly basis. We also use task management software and diligently track our time against these tasks to analyze where and how our time is being spent across the agency. This information allows our leadership team to not only understand profitability across teams and clients but also identify areas where employees may be getting “stuck” spending too much time on certain tasks. We discuss and view these as opportunities to increase our overall efficiency. Communication Strong internal communication is key for improving efficiency. Our SEO team maintains consistent weekly team meetings in which we share our approaches to solving complex problems for our clients. These “show and tell” sessions help us all to save time by quickly creating collective wisdom, thereby ensuring no one is spending time “reinventing the wheel” – especially as our SEO technology offers more and more new features over time. Our managers are also regularly tapped to contribute ideas for improved agency processes or new technologies that can make our teams’ jobs easier, more efficient, and more effective. Managers regularly act as advocates for other employees to identify opportunities for increasing efficiency or making the agency a better place to work overall. Adam Proehl, NordicClick Like most agencies, we have struggled with all of those things mentioned. The biggest consistent one has probably been training, which ultimately affects the other three. It is always an issue that will never go away, but we have gotten smarter about it and seen some success mitigating the challenges that come with it. The most important things we have done include: Tasking our internal subject matter experts with keeping updated checklists of skills that new team members should have. Having new team members shadow current ones and take on as much work as possible under supervision and review, and is an investment that we make (in other words, we don’t think it’s right to charge the clients for training our own staff). Getting much smarter about verifying that job candidates do indeed have the skillset they claim to. And, we do have a budget for sending team members to external events and conferences to learn. For new team members who have been here less than a year, we send them to local events (and there are plenty available). For staff that have some tenure, we don’t hesitate to send them to national shows that make sense for them. Ross Hudgens, Siege Media Training initially was a challenge for our agency. One thing we did to overcome it, was specifically appointing head of training (and hiring). She was accountable for approving hires and in turn, training them — meaning that the early stage created accountability/more structure to the process and also, lessons from repeat learnings with new hires. She also worked on an internal training course with video, rich media and etc. to accelerate the process of training with our new hires. By putting someone specifically in the role, she was able to excel in it and also accelerate the process for other new people. A Big Thank You to Everyone that Contributed Running an agency isn't easy. There are so many different things to manage while onboarding clients, keeping up with industry changes, and trying to complete every task of the day. We would love to know what your big challenges are, so we can help find solutions for you.",
  "headers": [
    {
      "level": "H1",
      "text": "Common Agency Challenges and Solutions: An Insider’s View"
    },
    {
      "level": "H2",
      "text": "Marty Weintraub, Aimclear"
    },
    {
      "level": "H2",
      "text": "Jake Bohall, Hive Digital"
    },
    {
      "level": "H3",
      "text": "Improving Management Processes"
    },
    {
      "level": "H3",
      "text": "Work Efficiency"
    },
    {
      "level": "H2",
      "text": "Kelsey Libert, Fractl"
    },
    {
      "level": "H3",
      "text": "Work Efficiency/Training"
    },
    {
      "level": "H3",
      "text": "Management"
    },
    {
      "level": "H3",
      "text": "Client Management"
    },
    {
      "level": "H2",
      "text": "Motoko Hunt, AJPR"
    },
    {
      "level": "H2",
      "text": "Lily Ray, Path Interactive"
    },
    {
      "level": "H3",
      "text": "Staffing"
    },
    {
      "level": "H3",
      "text": "Technology"
    },
    {
      "level": "H3",
      "text": "Communication"
    },
    {
      "level": "H2",
      "text": "Adam Proehl, NordicClick"
    },
    {
      "level": "H2",
      "text": "Ross Hudgens, Siege Media"
    },
    {
      "level": "H2",
      "text": "A Big Thank You to Everyone that Contributed"
    },
    {
      "level": "H6",
      "text": "Most popular pages"
    },
    {
      "level": "H6",
      "text": "SEO Checklist: 41 Tips to Optimize Your Website"
    },
    {
      "level": "H6",
      "text": "How to Perform a Complete SEO Audit (in 14 Steps)"
    },
    {
      "level": "H6",
      "text": "A Beginner’s Guide to Keyword Search Volume"
    }
  ],
  "author": ""
}