{
  "url": "https://www.semrush.com/blog/competitor-keywords/",
  "slug": "competitor-keywords",
  "title": "How to Find & Analyze Competitor Keywords",
  "description": "Competitor keywords are search engine queries that rivals rank for. Learn how you can rank for them, too.",
  "content": "In this guide, you’ll learn how to enhance your search engine optimization (SEO) or pay-per-click (PPC) strategy with competitor keyword research.And ultimately get more high-quality traffic from search engines.What Are Competitor Keywords?Competitor keywords are search terms that rival websites rank for in search engines like Google. Either in the organic (unpaid) or sponsored (paid) results.For example, if you compete with 1-800-Flowers.com, “flower delivery” is a competitor keyword. Why?Because people searching for \"flower delivery\" are looking for a service that both you and your competitors offer. And they might visit any of your websites from the search results.The process of finding and analyzing competitors’ keywords is known as competitor keyword research. And it can help you: Understand what relevant audiences search for Identify opportunities to outperform rivals and divert traffic to your site Avoid targeting keywords that are too difficult (or expensive) to appear for Set benchmarks for your search engine marketing strategyHow to Find Competitors’ KeywordsTo find competitors’ keywords, you need access to a domain keyword database like Semrush’s.We recommend that you search it with the Keyword Gap tool. Which lets you compare your Google rankings against multiple competitors’ rankings to spot the best keyword opportunities.Specifically, use the tool to compare: Organic keywords: Keywords that trigger a top-100 organic result for a site in your analysis. This option is best if you’re doing keyword research for SEO (i.e., to optimize content on your site). Paid keywords: Keywords that trigger a sponsored result for a site in your analysis. This is the best option if you’re doing PPC keyword research (i.e., finding keywords for Google Ads or other search engine advertising campaigns). PLA keywords: Keywords that trigger a product listing ad (PLA) for a site in your analysis. This is the best option if you’re planning to advertise through Google Shopping or similar.Here’s what each result type looks like on Google:We’ll also explain how to get an in-depth look at a particular competitor’s organic, paid, and PLA keywords. Compare Your Rankings Against Competitors’ RankingsTo compare your rankings against those of your competitors, go to the Keyword Gap tool. Enter your domain and up to four competitors’ domains. And choose which types of keywords you want to look at.Then, select your target country and click “Compare.”Scroll down to the table to see your and your competitors’ keyword data.Click the “Weak” tab to see where you’re ranking lower than all your competitors.This means that searchers are likely to visit a competitor over you. So, you may want to try to improve your rankings (we’ll talk more about how to do this later).Click the “Missing” tab to view keywords that all rivals rank for but you don’t. And the “Untapped” tab to see keywords that at least one rival ranks for but you don’t.In these sections, you may find relevant and valuable keywords you’re missing out on. The “Strong” tab shows where you’re ranking higher than all your competitors. While “Unique” shows where you’re the only one of the group ranking.These keywords give you a competitive advantage. You might be able to strengthen this advantage by pursuing even higher rankings for those search terms.In the following sections, we’ll explain how to find organic, paid, and PLA keywords for a specific competitor’s site. This is useful if you want to conduct a more in-depth analysis. After completing your keyword competition analysis, you’ll learn how to choose the best keywords for your marketing strategy.Check Organic Keywords for a Rival SiteCheck a competitor’s organic keywords rankings with the Organic Research tool.Just enter a rival’s domain, choose your target location, and click “Search.”TipFor help identifying your organic keyword competitors, enter your own domain into the Organic Research tool. Then, go to the “Competitors” tab and consult the “Organic Competitors” table. Next, open the “Positions” report and scroll down to the “Organic Search Positions” table.The “Position” column reveals the site’s organic ranking for each keyword.For example, this “1” means the competitor’s result appears in the top organic position for “monthly flower delivery service”:If you see an icon in the “Positions” column, it means the site has secured a special feature on the search engine results page called a SERP feature.For example, this shows that the competitor’s site is featured in the People Also Ask box for “daffodils”:Here’s what that result looks like in the search engine results page (SERP):Later, we’ll explain how to choose the best competitor keywords to use in your own SEO strategy.Check Paid Search Keywords for a Rival SiteTo see which keywords are triggering (or have previously triggered) a competitor’s search ads, use the Advertising Research tool.Simply enter their domain, choose your target location, and click “Search.”TipFor help identifying your ad competitors, enter your own domain into the Advertising Research tool. Then, go to the “Competitors” tab and consult the “Paid Competitors” table. Scroll down to the “Paid Search Positions” table to see the full keyword breakdown.The right side of the “Pos.” (position) column shows the competitor’s latest ranking in the sponsored results.For example, here’s what a No. 2 ad ranking looks like:Later, we’ll explain how to choose the best keywords for your PPC strategy.Check PLA Keywords for a Rival SiteWith the PLA Research tool, you’ll see what keywords trigger (or have previously triggered) a competitor’s Google Shopping ads.Enter a rival’s domain, choose your target location, and click “Search.”TipFor help identifying your main Google Shopping competitors, enter your own domain into the PLA Research tool. Then, go to the “Competitors” tab and consult the “PLA Competitors” table. Then, scroll down to the “PLA Positions” table.The right side of the “Pos.” column shows their position based on the most recent data.For example, here’s what a No. 3 ranking looks like:Next, we’ll explain how to choose the best competitor keywords for your campaigns.How to Do a Competitor Keyword AnalysisA competitor keyword analysis is the process of looking at metrics and SERPs for competitor keywords. With the goal of identifying the best keywords for your own marketing strategy.Below, we’ll go over the steps to follow for the best results.TipThe Semrush tool you use to find competitor keywords will provide access to key data. If you want additional insights about a particular search term and access to the SERP, click the keyword to open it in Keyword Overview.Analyze Search IntentTo create content and ads that perform well and attract target audiences, you must understand the search intent behind each keyword (i.e., what the typical searcher is looking for).For example, people searching “types of flowers” usually want to learn about flowers. Not necessarily buy them.This means the SERP is dominated by educational content rather than product pages and ads.When you analyze competitor keywords in Semrush, you’ll see the type of intent: Intent Type Description Keyword Example Informational (I) Keywords used to find information. Generally, they’re used early in the buying journey, so it’s rare that they trigger advertisements. “types of flowers” Navigational (N) Keywords used to find specific websites or webpages. Competitors’ branded keywords can be hard to rank for organically. But you might want to advertise on these terms. “1800 flowers” Commercial (C) Keywords used to research brands, products, or services. Outranking competitors for these terms helps you control the narrative around your brand and capture more sales. “best flowers for delivery” Transactional (T) Keywords people use when they’re ready to take action (e.g., make a purchase). These are the most popular keywords for advertising, but organic rankings are also extremely valuable. “flowers near me” For further insight into search intent, see what results appear on the SERP itself.View them in your target location via Keyword Overview (and some other tools). Just click the “View SERP” button or the icon that looks like this:When conducting your SERP analysis, ask questions like: What types of sites are ranking? What types of content are ranking? Will resulting traffic contribute toward my business goals?This will help you determine if your site is a good fit for the keyword. And vice versa.Examine Search VolumesSearch volume is the average number of monthly searches a keyword receives. The higher the keyword’s volume, the higher a search result’s potential reach.When you’re doing competitor keyword research in Semrush, you can easily find Google search volumes for your chosen location.For example, our database shows that “pink tulips” gets 9,900 searches per month in the U.S.:While volume is important to consider when choosing keywords, you shouldn’t always go for the higher-volume keywords and ignore the lower-volume ones.Why?Sometimes, people search for the same thing in different ways. This means the search demand around a particular topic can be much higher than one keyword’s volume makes it seem. Plus, keywords with high search volumes tend to attract fierce competition. As we’ll discuss in the following sections.Look at Keyword Difficulty ScoresKeyword difficulty (KD%) measures how hard it’ll be to earn a high organic ranking for a given keyword. It’s an important metric in SEO. Because you don’t want to waste time targeting keywords you’re unlikely to rank highly for. After all, the top organic result gets an average click-through rate (CTR) of over 22%. But starting in position 6, average click-through rates drop to less than 5%.Semrush measures keyword difficulty out of 100. And splits scores into six categories:Here’s what that data looks like in the Keyword Gap tool:Generally, keyword difficulty scores correlate strongly with search volumes and the level of purchase intent behind the keyword. Because popular keywords that are likely to generate sales attract more competition. For example: “Flower delivery” has 246,000 monthly searches, commercial intent, and a 74% keyword difficulty score “July birth flower” has 49,500 monthly searches, informational intent, and a 35% keyword difficulty scoreCheck Personal Keyword DifficultyPersonal keyword difficulty (PKD%) gauges how hard it will be for your specific website to rank in the top 10 search results for a particular keyword. This means you get a more accurate idea of whether you can realistically rank for a keyword.PKD% is calculated using an advanced AI algorithm. Which looks at: How relevant your website is to the keyword The competition for that topic How your website compares to the domains currently ranking on the SERPYou’ll find PKD% in the Keyword Magic Tool and Keyword Overview tool. Here, we’ll use the Keyword Magic Tool.Open the tool, enter your seed keyword, select the location, add your domain, and hit \"Search.\"Check the \"PKD%\" column. Which shows how hard it is for your domain to rank for that keyword. In this case, the analyzed domain is incredibly likely to rank well for the first seven keywords listed.This personalized data gives you a more realistic picture of whether you can rank for specific keywords your competitors are ranking for. So you can devote your efforts to targeting the most realistic opportunities.Consider Cost Per ClickCost per click (CPC) is how much you’ll pay when a user clicks on your ad.The CPC estimates in Semrush help you determine which competitor keywords are within your PPC marketing budget.But CPC is also a useful metric in SEO. Because it indicates how valuable the keyword is. After all, advertisers are unlikely to spend money on clicks that don’t generate a profit.For example, “flowers delivered” has an estimated CPC of $4.09. Because people who click through are relatively likely to purchase a bouquet.On the other hand, “different types of flowers” has an estimated CPC of $0.24. Because people who click through are unlikely to make a purchase.So, a florist should probably target “flowers delivered” before “different types of flowers” for advertising purposes.Evaluate Competitive DensitySemrush’s competitive density (“Com.”) metric gauges how popular a keyword is among search advertisers.It’s measured from 0-1, with scores above 0.80 suggesting a high level of competition.In PPC, a high competitive density score suggests it’ll be harder to advertise on the SERP. Because lots of sites are competing for the same ad space.In SEO, a high competitive density score suggests that you’ll be competing against lots of ads on the SERP. And this may negatively affect the number of organic clicks you get.But note that many users prefer organic results over ads. How to Use Competitor KeywordsHere are three steps to follow after selecting the competitor keywords you want to target:1. Identify Topic and Keyword ClustersYou can use competitor keywords to group terms into topic clusters—closely related pages that include a pillar (main) page on a broad topic and subpages on more specific topics. Which helps build topical authority.And each of those pillar pages and subpages can target a keyword cluster—a group of keywords with the same search intent—e.g., “flower delivery” and “flower delivery service.” Which makes it possible for one page to rank for multiple terms. NoteKeyword clusters aren’t just for website content. You can also use them for paid ad campaigns. To begin, create a structured list of keywords in Keyword Strategy Builder. Open the tool, enter up to five keywords you identified earlier, and click “Create list.”In the “Topics and pages” tab, the “Topical Overview” report shows keywords organized into a visual map of main topics (pillar pages) and their more detailed topics (subpages).NoteAdd keywords directly from the Keyword Magic Tool by selecting the keywords you want to add. Then, clicking \"+ Add to keyword list\" and creating your list. Click on any topic (a pillar page or subpage) to view its related keywords (the keyword cluster) and metrics like search volume and keyword difficulty. Scroll down to see the information presented as a table. Review the data to decide which topics to tackle first. And consider prioritizing those with high search volumes and low difficulty scores to maximize your SEO impact. Look for the green “high ranking potential” tag to identify these topics. If you’re more focused on paid campaigns, look for keyword clusters (shown as pillar pages or subpages) with primarily commercial and/or transactional intent. You’re now ready to start creating website content or search ads for high-priority topics. 2. Study Your Competitors’ ContentFor the best chance of outranking your competitors, you need to create content or ads that are better than theirs.Ideally, you want to create content that’s the best of its kind. So first, see what you’re up against.Evaluating Organic ResultsIf you look up a competitor keyword in the Keyword Overview tool, you can see the top-ranking organic results from the “SERP Analysis” section. Just click the icons that look like this:Then, analyze the quality of the content by asking yourself questions like these: Is the content easy to read and understand? Is it accurate and up to date? What subtopics does the content cover? What’s the word count? Are HTML heading tags used to structure the page? What kind of format does the content follow? How are relevant keywords used across the page? Are there internal links to other pages on the site? Or external links to useful resources? Has the creator used bullet points, images, charts, videos, etc. to help users absorb information more easily? Is there a better way to present this information? Do the title tag (the page title) and meta description (summary that can appear in search results) include keywords? How can you make your result stand apart on the SERP? Does the content demonstrate Experience, Expertise, Authoritativeness, and Trustworthiness (E-E-A-T)?This kind of analysis helps you identify strengths to emulate. And weaknesses to capitalize on.For more advice on creating content that ranks highly, check out our guide to quality content.Evaluating Paid ResultsFor terms you want to to use for paid search, enter a competitor keyword in the Ads History tool to see what search ads have ranked well in your target location.The numbered boxes represent each advertiser’s highest-ranking position by month. Click them to see what ad copy was used.Visit the ad’s landing page directly by clicking the blue link. And use what you see to get more inspiration for your own campaign.To learn more about earning high ad rankings, check out our guides on Quality Scores and keyword bidding.TipFor help setting up your first paid search campaign, use the Ads Launch Assistant. It’s a free app created by Semrush.3. Track Your RankingsOnce you’ve published your content or launched your ads, track your rankings with our Position Tracking tool. And see how your performance compares against competitors’.Here’s how:First, follow our Position Tracking configuration guide to add your competitor keywords and generate your tracking report. Once it’s ready, click the “Add” link at the top of the “Landscape” report.Then, add or choose the domains of up to 20 competitors. And click “Save changes.”When you’re done, head to the “Overview” report.And use the “Add domain” drop-downs to select up to four competitors.Now, you’ll see how you’re performing against your chosen competitors.You’ll see organic results by default. But you can switch to Google Ads data via the gear icon in the upper right.At the top of the report, various graphs help you compare your overall performance.For example, the “Visibility” graph shows how prominently each site ranks for the tracked keywords. (A score of 100% means a position 1 ranking for every keyword.)To see a breakdown of tracked keywords, scroll down to the “Rankings Overview” table. You’ll see each site’s previous and current rankings for each term. There are also icons to show ownership of SERP features. This makes it easy to see whether you’re outranking your competitors. And what direction each site’s rankings are going in.Just remember that it can take months to improve your SEO rankings. And it’s normal for positions to fluctuate.Start Outranking Your CompetitorsTake the next steps to start outranking your competitors. First, identify the keywords your competitors are targeting that you might have missed. Then, use our AI-powered Keyword Strategy Builder to plan your pages and search campaigns. Try it today.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Find & Analyze Competitor Keywords"
    },
    {
      "level": "H2",
      "text": "What Are Competitor Keywords?"
    },
    {
      "level": "H2",
      "text": "How to Find Competitors’ Keywords"
    },
    {
      "level": "H3",
      "text": "Compare Your Rankings Against Competitors’ Rankings"
    },
    {
      "level": "H3",
      "text": "Check Organic Keywords for a Rival Site"
    },
    {
      "level": "H3",
      "text": "Check Paid Search Keywords for a Rival Site"
    },
    {
      "level": "H3",
      "text": "Check PLA Keywords for a Rival Site"
    },
    {
      "level": "H2",
      "text": "How to Do a Competitor Keyword Analysis"
    },
    {
      "level": "H3",
      "text": "Analyze Search Intent"
    },
    {
      "level": "H3",
      "text": "Examine Search Volumes"
    },
    {
      "level": "H3",
      "text": "Look at Keyword Difficulty Scores"
    },
    {
      "level": "H3",
      "text": "Check Personal Keyword Difficulty"
    },
    {
      "level": "H3",
      "text": "Consider Cost Per Click"
    },
    {
      "level": "H3",
      "text": "Evaluate Competitive Density"
    },
    {
      "level": "H2",
      "text": "How to Use Competitor Keywords"
    },
    {
      "level": "H3",
      "text": "1. Identify Topic and Keyword Clusters"
    },
    {
      "level": "H3",
      "text": "2. Study Your Competitors’ Content"
    },
    {
      "level": "H4",
      "text": "Evaluating Organic Results"
    },
    {
      "level": "H4",
      "text": "Evaluating Paid Results"
    },
    {
      "level": "H3",
      "text": "3. Track Your Rankings"
    },
    {
      "level": "H2",
      "text": "Start Outranking Your Competitors"
    }
  ],
  "author": ""
}