{
  "url": "https://www.semrush.com/blog/competitor-ad-spend/",
  "slug": "competitor-ad-spend",
  "title": "Competitor Ad Spend: How to Uncover Your Rival’s Budget",
  "description": "Ever wonder what your competitors are spending on ads? Knowing this can boost your budget strategy and keep your marketing ahead of the game.",
  "content": "Ever wondered what your competitors’ ad budget and spend is?Beyond curiosity, this information can help you make better strategic decisions about your own budget allocation, and it can help keep your marketing efforts effective and ahead of the curve.But you don’t know what you don’t know. That is, until you dive into our AdClarity and Advertising Research solutions. Here’s how the tools can calculate your competitor's ad budget, plus estimate your rivals’ pay-per-click (PPC) spend. The best part? You can do it all on a free 7-day trial.Estimate Display Ad Spend with AdClarityIt’s frustrating to not have a complete picture of what’s happening in your market’s ad landscape. Knowing how much competitors are spending on ads, when, and where, offers a huge insight into how your brand should be operating (and overtaking!).AdClarity is an app that can estimate any advertiser’s digital ad spend on Google display ads, social ads, or video ads on YouTube. You can search for data by publisher, advertiser, campaigns, keywords, groups or comparisons.Insights from the app include: Estimated expenditure Ad types distribution Ad buying methods Advertiser expenditure trends Expenditure breakdown Top ads Top campaigns Top publishers Ad buying methodsAdClarity can be used by anyone with a Semrush account (even a free account or trial). The app is subscription based and plan prices vary according to the tier you select – social and video ads, display ads, or all advertising channels. You can test it out anytime with a free seven day trial. Once you’re in the app, here’s how to estimate ad spend on each channel.Estimating Google Display Ad SpendWith the display ad subscription, you can use AdClarity to figure out how much your competitors are spending on their Google Display ads. To get started, click the search bar at the top of the page and enter search terms that are relevant to your competitor. This could be the name of your competitor, their campaign titles or other keywords. For now, let’s take a look at ad spend for British supermarket, Tesco.Underneath, you can also select the device, timeframe and location you’d like to focus your search on. Next, you’ll be shown a range of data about your competitors’ ad spend. This includes estimated expenditure, display ad placement, ad buying methods, advertiser expenditure trends, top ads, top campaigns, top publishers, and ad buying methods.Here, we can see that in the past three months, Tesco has spent an estimated $111,900 for 30.2 million ad impressions. The majority of its display ad placement is far below the fold and it mostly buys ads programmatically. The supermarket averages 2.3 million weekly average impressions on display ads, spending $8,600 per week on these ads. It uses 92 of its total 102 ad publishers per week too.Further down in the report, we can see that Tesco’s top ad by impressions is an ad about a Guinness draught nitrosurge.By clicking on this ad, you can access even more details, including the publisher, the option to view the campaign landing page, and a full report on that ad campaign. You can also export the information for your internal marketing notes.Scroll down again, and AdClarity reveals that Tesco’s top campaign has 43.18% of the company’s total ad impressions. We also learn that Tesco spent $477,880 on this campaign – 42.8% of its total budget. Below, we’re shown that British newspaper the Mirror is Tesco’s most used ad publisher in these three months, followed by DailyMail, and the Guardian. Lastly, the tool highlights that Tesco’s majority ad buying method is programmatic (50%). The company spent $14.95 million on this method, totaling 49.53% of its budget during this period. Second was direct delivery methods (20%), then programmatic direct (17%), programmatic ad network (13%), and ad network (0.02%).Now that we’ve gotten an overview of this company’s spending on Google Display (an estimated $111.9k in 3 months for 30M impressions), we can compare it to the other advertising channels. Estimating Social Media Ad SpendSocial media is a big beast. With AdClarity’s social and video subscription, you can discover what your competitors are spending on each social channel. That means you can identify where competition is more fierce and where to prioritize your own ad budget spend.When you log in to AdClarity, enter your competitor name, campaign or keywords into the top search bar. Select your desired channel (choose Social), timeframe, and location. For this example, we’ll stick with Tesco.In the first row of widgets, you’ll see estimated expenditure, social ad placement, and social ad types. It tells us that Tesco spent $1.9 million for 270.7 million impressions over three months. Compared to its spending in the Google Display channel ($111.9k), we can infer that Tesco spent more than ten times the budget on social media ads. This report also highlights that the brand mostly used feed for its placements, and spent the majority of its social media advertising budget on video ads. Next up in the advertiser expenditure trends widget, AdClarity shows that Tesco had 20.8 million weekly average impressions in the timeframe, spent $148,900 per week on average, and used only five publishers per week (out of a total of 102). We also learn that Tesco’s top ad on social media was for customer delivery drivers, which cost the supermarket $94,300 to run and earned 11.10 million impressions.Clicking on the ad, we see that it was published on Facebook. At the top of this box, there’s the option to see the full campaign report, view the campaign landing page, and export the ad information.In the top campaigns list, Tesco’s Facebook page is number one. We can see here that the budget for this campaign ($737,790) was 38.12% of all of Tesco’s social ad budget over the three months.Finally, we’re shown that Tesco mostly used Facebook as an ad publisher in the given timeframe. Ads on this platform received 73.55% of all Tesco’s social ad impressions. In total, Tesco spent $199.08 million on Facebook ads in the three months. Instagram and Pinterest were Tesco’s second and third most used social networks for ads in the period.Now that we’ve gotten an idea of their social media ad spend compared to Google Display, let’s take a look at their video ad spend on YouTube and other publishers. Estimating Video Ad Spend on YouTubeWith the same social media and video subscription to AdClarity, you can dive into your competitors’ video ad activity and spend. Like before, head to your dashboard, enter your competitor, campaign or keyword, and you’ll be given a breakdown of ad spending data.Here you can see estimated expenditure, video ad placement, ad buying methods. Sticking with Tesco, we can detect that the company had 121.7 million impressions of its video ads over three months. In the same period, the supermarket spent $764,200 (more than their spend on Google Display but less than their spend on social ads).In terms of ad placement, the majority of Tesco’s video ads were pre roll (58.04%), followed by post roll (29.82%), and mid roll (12.14%). Tesco’s dominant ad buying method was programmatic (95.23%).Next, there’s a graph showing the general trend for Tesco’s advertiser expenditure among its video ads. AdClarity tells us that the brand had 9.4 million weekly average impressions of its ads, and spent $58,800 per week on average on these types of ads. The highest number of video ad impressions was on April 1st, when 31.3 million impressions were recorded.We then have a tile view of the top video ads for Tesco.Clicking on the best-performing video ad, we can see that it has 38.7 million impressions, and that Tesco spent $176,200 to run the ad on YouTube. Under the top campaigns section, the tool reveals that Tesco’s highest-performing video ad campaign received 56.17 million impressions and cost $255,970 in ad spend (33.5% of the total video ad budget).Meanwhile, the top publishers' widget confirms that Tesco spent the most money ($392,200) and received the most video ad impressions (86.14 million) on YouTube. The Mirror was the second most lucrative publisher for Tesco. Further down, you can access a breakdown of the specific YouTube channels that Tesco used for its video ads. This data is great for competitors who want to know which granular channels to target (or search for similar channels/hosts) in their own competitive ad strategy.With AdClarity, we can see that Tesco ran four campaigns on the Birdy channel. In total, Tesco spent $50,830 on video ads here, and received 11.16 million impressions. Other notable YouTube channels used by Tesco were YouTube channels Ellie Goulding VEVO, Olivia Rodrigo, and Adele VEVO. At this point, we can see a breakdown of Tesco’s ad spending on each channel over 3 months as: Google Display: $111.9k for 30M impressions Social Ads: $1.9M for 270M impressions Video Ads: $764k for 121M impressionsEstimate Paid Search Ad Spend with Advertising ResearchAdvertising Research is another savvy ad spend tool from Semrush. It can estimate any PPC advertiser’s spending on Google search ads, based on the keywords their ads rank for. This tool produces in-depth reports and is available with any Semrush free trial or paid subscription.To generate your report, enter the domain of your competitor. We’ll enter Tesco once again. Hit ‘search’ and wait as your report is compiled. You’ll then see a screen with the keywords, traffic, traffic cost, paid search trends, and paid search positions of your competitor.The Traffic Cost metric is the estimated average monthly cost to rank for the listed keywords in Google Ads. The number is estimated based on cost-per-click (CPC) and position data from Semrush. With this information, you can benchmark your own PPC budget based on that of your competitors’ paid search. That means you can create an impactful ad strategy and be less likely to over/under spend.For the month of June, Semrush estimates that Tesco would have to spend $116,500 to rank for all its listed keywords in Google Ads. All data shown is for the current month of access. Historical data is available with a Guru or Business Semrush account. If we take this 116.5k number and multiply it by three, we can estimate the company spent about $349,500 on Google search ads in the same time period. Uncover Your Rival’s Budget, Step into the Ad SpotlightKnowledge is power, and the more you know about your competitors’ ad decisions and spending, the more likely you are to outcompete them. Using AdClarity, you can access estimations about your competitors for any given timeframe and get an important look into activity in your market. For example, with Tesco we can estimate that in three months, the supermarket spent: $111,900 on Google Display ads $1,900,000 on social media ads $764,200 on video ads $349,500 on Google search ads With AdClarity and Advertising Research in your toolbelt, you can get valuable data about your rivals’ ad spending, where it’s focused, and how the ads performed. And, because you can select the type of ads you want information about (display, social, video) your insights are better tailored to your strategy and can accelerate your ad success.Want an ad budget breakdown of your close competitors? Sign up for a free trial of Semrush and AdClarity today.",
  "headers": [
    {
      "level": "H1",
      "text": "Competitor Ad Spend: How to Uncover Your Rival’s Budget"
    },
    {
      "level": "H2",
      "text": "Estimate Display Ad Spend with AdClarity"
    },
    {
      "level": "H3",
      "text": "Estimating Google Display Ad Spend"
    },
    {
      "level": "H3",
      "text": "Estimating Social Media Ad Spend"
    },
    {
      "level": "H3",
      "text": "Estimating Video Ad Spend on YouTube"
    },
    {
      "level": "H2",
      "text": "Estimate Paid Search Ad Spend with Advertising Research"
    },
    {
      "level": "H2",
      "text": "Uncover Your Rival’s Budget, Step into the Ad Spotlight"
    }
  ],
  "author": ""
}