{
  "url": "https://www.semrush.com/blog/competitive-insights/",
  "slug": "competitive-insights",
  "title": "9 Competitive Insights & How to Get Them",
  "description": "Competitive insights are learnings about rival businesses that help you make better business decisions.",
  "content": "Competitive insights (or competitor insights) are pieces of information about rival businesses that empower you to make better decisions for your own business. To get competitive insights, you need to manually analyze the activities, plans, and results of other businesses in your niche. Or use specialized tools. Let’s explore nine key competitive insights and how to get them:1. Market Share for Various MetricsCalculate the market share for every company in your industry. That way, you can put every business’s performance into perspective and identify your biggest threats.But don’t just concentrate on share of revenue. See which companies dominate based on relevant industry metrics, such as: Unit sales Monthly active users Web trafficThat way, you can work out which helps companies succeed in different areas.Let’s say you want to evaluate your and your competitors’ share of web traffic.With Semrush’s Market Explorer tool, you can quickly find out how web traffic in your niche is split between domains.Just click “Find Competitors” and enter your homepage URL.Then, choose your location and click “Research a market.”The tool will analyze traffic to your domain and up to 99 competitors’ domains.In the “Growth Quadrant” module, you can see where you and your rivals stand in the competitive landscape.Scroll down to “Share of Visits” under “Domain vs Market Dynamics” to see each company’s share of market traffic.2. Traffic Acquisition ChannelsKnowing where competitors get their website traffic from can help you identify acquisition channels you’re missing out on. And areas where you’re underperforming.Go to the “Benchmarking” report in Market Explorer to see which channels drive the most traffic in your market.You can select up to five domains to compare. Analyze your biggest rivals.Here’s a breakdown of the main traffic acquisition channels. And tactics to improve your performance in each one: Traffic Channel Description Traffic Acquisition Tactics Direct Visits that occur when people type your URL into their browser or open a bookmark Content creation + offline marketing and advertising (e.g., direct mail and billboards) Referral Visits from links on external websites Link building + digital PR (getting online publications to link to/talk about your site) Organic Search Unpaid visits from search engine results Search engine optimization (SEO) Paid Search Visits from search engine advertisements Pay-per-click (PPC) marketing Organic Social Unpaid visits from social media links Social media marketing Paid Social Visits from social media advertisements Social media advertising Email Visits from email links Email marketing Display Ads Visits from display advertisements Display advertising Further reading: How to Do a Digital Marketing Competitor Analysis3. Social Media PresenceIf your competitors are on social media platforms that you aren’t, you could be missing out on valuable reach and engagement.Most businesses link to their social media profiles in their website footer. So, you can manually check what platforms they’re using.But you can get a better (and quicker) understanding with the Market Explorer tool.The “Social Media Distribution Strategy” graph in the “Benchmarking” report shows the most used platforms in your market. And a detailed breakdown for five selected domains.Here’s a quick overview of the platforms covered: Reddit A collection of online communities/forums. Marketing on Reddit can be tricky, but it’s a good way to reach niche audiences. Instagram An image- and video-sharing platform. It’s particularly good for brands in fashion, interior design, etc. YouTube A video-sharing platform with a popular search function. You can use YouTube SEO techniques to increase your content’s reach. Pinterest A virtual pinboard that lets you post images, videos, and links. You can use the Pinterest Trends tool to find popular topics. Facebook A social network that’s particularly good for local businesses. Read about Facebook Business Manager for help getting started. X (formerly Twitter) A microblogging platform that’s commonly used for marketing and customer service Other This category covers other social platforms like TikTok and Snapchat For more competitive insights, use the Social Tracker tool (part of Semrush Social).You can see which rivals’ posts get the most engagement on Facebook, X, Instagram, YouTube, and Pinterest.And compare select audience, activity, and engagement metrics.Then, use the inspiration and insights you gain from evaluating your competitors’ performance to guide your own social content strategy.4. Product and Service OfferingsAnalyzing competitors’ products and services can help you identify potential areas for innovation. And determine ways to differentiate your offering.You can focus on elements like quality, pricing, and features.Let’s say you own a yoga clothing brand. You might find that none of your competitors use the same high-quality materials that you do. So, you decide to focus on this unique selling proposition (USP) in your marketing materials.And perhaps you learn that one of your competitors offers a wide variety of color options. So, you're inspired to expand your own color offerings.5. Target AudiencesFind out which target audiences your competitors are pursuing. So you can ensure you’re not missing out on any important segments.You can also look for gaps in the entire market. And try to fill them.Competitors’ websites can provide insight into who’s being targeted—and how.For example, Slack has dedicated landing pages for various departments and industries. Each one focuses on different product benefits.The company also creates content for different target audiences.The number of resources available for each segment indicates how important the segment is to the brand. While the content itself provides insight into Slack’s personalization strategy.We can also learn about Slack’s customers through its success stories.If you want to pursue the same kinds of clients, you can use these stories to gather useful information for your buyer personas (e.g., details about their pain points).To see which audiences actually visit rivals’ websites, use Semrush’s One2Target tool.Just enter up to five competitors’ domains to see breakdowns for: Demographics: Age, gender, and country Socioeconomics: Household size, household income level, employment status, and education level Behavior: Most visited social media platforms, top interests, and device type usageIn the “Audience Overlap” section, you can see the most visited domains for each brand’s audience.These could be great places to earn coverage (through link building or digital PR). Or to advertise your business.6. Popular WebpagesAnalyzing your competitors’ most visited webpages helps you work out which products, services, and content types are popular in your niche.To get started, enter a rival domain into the Traffic Analytics tool.Then, head to the “Top Pages” report. And choose the time range and location you’re interested in.You’ll find the following metrics for each page: Traffic Share Page views as a percentage of overall domain traffic 1Y Trend How page views have fluctuated over the past 12 months Unique Pageviews The number of visits to the page (scroll to the right for a breakdown by acquisition channel) Unique Visitors The number of individual users who visited the page Entrances The number of website visits that started on that page Avg. Visit Duration How long the average visit lasted (MM:SS) Exits The number of website visits that ended on that page TipClick the header of any numerical column to sort results from high to low or low to high.To review the content on any page, click the icon to open the URL in the “Page” column:Then, apply any competitor insights you gather to your own business strategy.For example, you might consider: Stocking products that generate lots of page views Creating your own versions of blog posts that generate lots of entrances Mimicking seasonal landing pages that attract lots of visits in DecemberTipTo keep track of the new content your competitors publish, use the EyeOn tool. You can monitor website pages, social posts, and more across up to 20 domains.Further reading: How to Do a Competitive Content Analysis7. Google Keyword RankingsLooking at competitors’ Google keyword rankings (i.e., when and where they appear in search results) is one of the best ways to spot SEO opportunities. Because you can see what’s working for your rivals and try to outperform them.To get started, enter your domain and a competitor’s domain into the Keyword Gap tool.Then, choose your country and click “Compare.”Scroll down to the keyword table and select “Weak.” This will show you search queries that the competitor outranks you for. You can see your exact positions in the corresponding columns.To improve these positions, you’ll probably need to optimize the ranking pages.Next, go to the “Missing” tab. To see keywords the competitor ranks for but you don’t.To earn rankings for these keywords, you’ll probably need to create quality content from scratch.But you should only target keywords that are relevant to your business and target audience.If you need help prioritizing, focus on the following columns: Volume: The average number of searches the keyword receives per month. The higher the volume, the higher the potential traffic. KD%: The keyword difficulty score, which measures the keyword’s competitiveness. The lower the score, the easier it should be to earn a high ranking. Intent: The general purpose behind the search. Typically, keywords with transactional search intent are more likely to generate conversions.Further reading: How to Do an SEO Competitor Analysis8. Advertising Strategies and ResultsKnowing where competitors advertise (and what results they’re getting) doesn’t just alert you to advertising opportunities. It helps you understand your competitor’s positioning strategy—i.e., how they’re portraying their brand to consumers.We recommend that you use: Advertising Research to analyze competitors’ text ads on Google Search PLA Research to analyze competitors’ Google Shopping ads AdClarity to analyze competitors’ display, video, and social media adsFor example, let’s take a look at Slack’s advertising activity in AdClarity.We can see that the company spent an estimated $27K on video and banner advertising in the U.S. during December 2023 (they weren’t running social ads at this time). And generated around 5.7M impressions.The “Top Ads” section shows what messaging and visuals Slack used to attract interest.While the “Top publishers and apps” section shows where the ads were placed.9. Reputational Strengths and WeaknessesIt’s important to understand what consumers think about your competitors. Because you can try to emulate their strengths. And capitalize on their weaknesses.For example: If your main competitor is praised for having great customer service, you might want to adopt some of their policies yourself If your main competitor is criticized for poor-quality service, highlighting your own five-star reviews could help you get more customersThird-party review platforms are some of the best places to gather competitor insights.Identify sites that your target audiences use (e.g., Google and Yelp). Then, read through recent reviews about your competitors and try to identify common themes.We also recommend looking at references to your competitors online.Search those brand names in Google and explore the results to see what people are saying. (You’ll need to skip past the brand’s own website, social profiles, etc.)The “News” section can be a particularly good place to find recent commentary.TipIf you want to narrow your Google results, you can use various search operators and filters.See what people are saying on social media sites, too.Like this:Alternatively, streamline the entire process with the Brand Monitoring app.Just add a competitor’s name to see where they’re mentioned in the press or social media. And whether the sentiment is positive, negative, or neutral.In the “Analytics” tab, you can track the overall sentiment balance. And look at trends over time.Start Gathering Competitive InsightsWhichever methods you use to gather competitor insights, do it on an ongoing basis. Because the sooner you identify changes in the competitive landscape, the sooner you can act on them. With Semrush, it’s faster and easier to get the digital marketing insights you need. Find out for yourself by starting your free trial.",
  "headers": [
    {
      "level": "H1",
      "text": "9 Competitive Insights & How to Get Them"
    },
    {
      "level": "H2",
      "text": "1. Market Share for Various Metrics"
    },
    {
      "level": "H2",
      "text": "2. Traffic Acquisition Channels"
    },
    {
      "level": "H2",
      "text": "3. Social Media Presence"
    },
    {
      "level": "H2",
      "text": "4. Product and Service Offerings"
    },
    {
      "level": "H2",
      "text": "5. Target Audiences"
    },
    {
      "level": "H2",
      "text": "6. Popular Webpages"
    },
    {
      "level": "H2",
      "text": "7. Google Keyword Rankings"
    },
    {
      "level": "H2",
      "text": "8. Advertising Strategies and Results"
    },
    {
      "level": "H2",
      "text": "9. Reputational Strengths and Weaknesses"
    },
    {
      "level": "H2",
      "text": "Start Gathering Competitive Insights"
    }
  ],
  "author": ""
}