{
  "url": "https://www.semrush.com/blog/competitive-analysis/",
  "slug": "competitive-analysis",
  "title": "What Is a Competitor Analysis & How to Do It in 2024",
  "description": "Grab our competitor analysis template to learn more about your competitors. And how you can stay ahead.",
  "content": "What Is a Competitive Analysis?A competitive analysis is the process of gathering data about the products, sales, and marketing strategies of your competitors (i.e., other businesses in the same industry). Businesses use that data to identify their strengths and weaknesses and discover potential opportunities. A competitor analysis can help you understand the market landscape and make informed decisions to improve your position in the industry. Depending on your business, you can analyze competitors in many ways. But we’ll cover the basic steps you need to know.Pro TipGenerate a competitive analysis snapshot in a few clicks with Semrush’s Market Explorer. Get competitor data, like: Market Share by Channel Traffic Sources Organic TrafficWhy Competitive Analyses Are ImportantCompetitive analyses are essential for any business that wants to succeed in a crowded and competitive market.Regularly conducting competitive analyses can help you: Understand your market and industry Compare your results with your competitors’ performance Identify gaps in your strategy that your competitors address Develop strategies and tactics that promote your unique value proposition Stay on top of market changes to gain a competitive edge over your competitorsRead on to find out how you can get started.What to Include in a Competitive AnalysisThe factors you include in your competitor analysis depend largely on your goals and industry.For example, an online pet store owner will want to see what products their competitors sell that they don’t. A SaaS company, on the other hand, will probably want to look into their competitors’ features and pricing pages.To get you started, here are seven factors that stay the same across the board:Features or ProductsCompare your features or products to your competitors’ and highlight those that make you stand out or fall behind.For example, if you’re selling an email marketing tool, you might want to compare features such as: Templates Segmentation Automation Support IntegrationsThat way, you get a clearer picture of what your competitors are doing differently and why.PricingPricing is the amount of money you charge for your product or service.Use your competitors’ pricing strategy to guide your own. And make sure you’re not over- or under-charging your customers. Suppose you run an online course platform. You might want to compare pricing factors such as: Pricing model (e.g., subscription, one-time, freemium) Pricing tiers (e.g., basic, premium, enterprise) Pricing options (e.g., monthly, annual, lifetime) Pricing discounts (e.g., coupons, bundles, referrals) Pricing value (e.g., features, quality, reputation)Target AudienceTarget audience is the group of people you’d like to reach and serve with your product or service.When conducting a competitive analysis in marketing, try to discern who your competitors are targeting. How does it differ from your target audience? What are their needs, preferences, behaviors, and pain points? Are they targeting someone you aren’t? How can you better serve them?For example, if you run a fitness app, you might want to compare target audience characteristics such as: Demographics (e.g., age, gender, location) Psychographics (e.g., interests, values, goals) Behaviors (e.g., habits, preferences, pain points) Needs (e.g., problems, solutions, benefits)MarketingMarketing is the process of promoting and selling your product or service to your target audience. Look at your competitors’ marketing strategies to identify how you can improve your own. And increase your awareness, visibility, and conversions.For example, if you own a travel booking website, you might want to compare marketing channels such as: Website (e.g., design, content, SEO) Social media (e.g., platforms, posts, engagement) Email (e.g., newsletters, campaigns, open rates) Advertising (e.g., platforms, ads, clicks) PR (e.g., media coverage, press releases, reviews)DifferentiatorsDifferentiators are the factors that make your product or service unique and superior.Identify what that means for you.Look at how your customers position themselves to find out what sets you apart. And how your product or service is better.Then, communicate those differentiators to your customers. For example, if you sell a vegan meal delivery service, you might want to highlight differentiators such as: Quality (e.g., organic ingredients, fresh delivery) Variety (e.g., cuisines, dishes, flavors) Convenience (e.g., easy ordering, flexible plans) Sustainability (e.g., eco-friendly packaging, carbon offsetting) Social impact (e.g., donations, partnerships)StrengthsStrengths are the aspects of your product or service that give you an advantage over your competitors. List and analyze your strengths in your competition analysis. So that you know what you can double down on.For example, if you run a cloud storage service, you might identify strengths such as: Security (e.g., encryption, backup) Speed (e.g., upload, download) Storage (e.g., space, files) Collaboration (e.g., sharing, editing) Innovation (e.g., features, updates)WeaknessesWeaknesses are the aspects of your product or service that put you at a disadvantage compared to your competitors. List these out as well. Acknowledge them. Analyze how they affect your performance and results. And then work on improving them.For example, if you are selling a video streaming platform, you might want identify weaknesses such as: Content (e.g., quantity, quality, exclusivity) Pricing (e.g., cost, value, affordability) User experience (e.g., interface, navigation, personalization) Customer service (e.g., support, feedback, retention) Competition (e.g., rivals, threats, substitutes)How to Do a Competitive AnalysisBefore you start this walkthrough, grab a copy of Semrush’s Competitive Analysis Template to follow along.Here’s what it looks like:Perform a competitor analysis with these seven steps.Pro TipCreate a free Semrush account (no credit card needed) to follow along with the steps in this guide.1. Identify Your CompetitorsFirst, build a list of key competitors to watch out for.This lets you see who might be competing for your audience’s attention. And gives you an idea of who to focus on throughout your competitor analysis.We’ll walk you through how to find your competitors in these four key areas: Your industry Organic search Paid search Your communitySo that you can enter your data into your competitive analysis document. Like this:Find Your Industry CompetitorsYour industry competitors sell similar products or services to yours.Focus primarily on direct competitors, though. Meaning brands that fill a similar gap within your niche.An example of direct competitors is Abercrombie & Fitch and Aritzia. Both fashion brands focus on trendy women’s clothing—popular with Generation Z and younger millennials. They occupy the same position in the market.An indirect competitor would be Animal Crossing and Mortal Kombat. They’re both video games, but their audiences are vastly different.You should also consider your business’s size and competition level. For example, a local Toyota dealership may rank for similar keywords as the overarching Toyota brand.This doesn’t mean they will directly compete. The local dealership’s competition would be other local dealerships instead. Keep context in mind as you use competitor analysis tools.Here are a few ways to identify direct competitors: Market research: Study the market to find companies selling similar products that fulfill the same purpose. Talk to your sales team to find out which companies often come up in their sales process. Customer feedback: Once customers decide on your product, ask them what other products they were considering. This will help you identify closely related companies. Social media and online communities: Many people seek recommendations on social media or forums like Reddit and Quora. Investigate customer conversations on these sites to find potential competitors.For a general view of your digital competitors in your industry, use a competitor analysis tool like Market Explorer.First, select “Find Competitors” and enter your domain. This will automatically generate a list of the major players in your space.The “Overview” tab will show you who you compete with online. It will also visualize their relative market share, audience size, and growth rate.Now, scroll to the “Growth Quadrant” widget.The Growth Quadrant chart breaks down you and your competitors into four basic categories: Niche Players: New or small companies with smaller audience size and a low growth rate Game Changers: Emerging companies with a comparatively smaller audience size that are growing quickly Established Players: Companies with large, established audiences Leaders: Companies with both a large audience and a rapid growth rateNote where each competitor stands. And how their audience and traffic growth compare to yours. Which players occupy the same quadrant as you? Which should you be most concerned about?Once you’ve identified key competitors in your industry, research their online presence through organic, paid, and local searches.Find Your Organic CompetitorsNext, identify your competitors in organic search. These are brands that target the same SEO keywords as you.These can differ from industry competitors. They may not have the same type of business you do. But they still compete with you in Google’s search results.You can easily find organic competitors with the “Competitors” report in Semrush’s Organic Research tool.Start by entering your domain and clicking “Search.”Then, click on the “Competitors” tab.You’ll see a list of organic competitors sorted by Competition Level. This metric is based on the number of keywords a competitor ranks for. And the number of keywords you and the competitor share. Like so:Note your biggest organic search competitors and any new names that did not appear in Market Explorer.Pro TipHead to the “Position Changes” tab to see the specific keywords your top organic competitors have been ranking for and monitor how their rankings shift over time to identify keyword opportunities. Find Your Paid Search CompetitorsNext, look for your paid search competitors. These are businesses that show up for the paid keywords you’re targeting.Ads that show up for users depend on many factors, including location, device, and context of the search term.A tool like Advertising Research can help you identify who your paid competitors are. And how their paid ads perform.To get started, enter your domain and hit “Search.”Next, head to the “Competitors” tab.Scroll and you’ll see a list of paid search competitors, sorted by competition level:You can also see how many paid keywords you have in common, how much paid traffic your competitors’ ads drive, and how many paid keywords your competitors rank for.Find Your Local SEO CompetitorsIf you run a business with a physical storefront, you must identify your local competitors—both online and offline.These are competitors who offer a similar product or service (filling the same market gap) within your geographic area. To do that, track important local keywords and compare your business’s proximity with other sites that rank for those keywords.And you’ll want to make sure your website ranks prominently on Google for location-specific keywords. That means optimizing your site for local SEO so you’ll appear in local search results. Like so:You can start your competitor research by using the Keyword Overview tool. To see what the SERP (search engine results page) looks like for keywords like “pizza near me.”The top-ranking domains are your local SEO competitors.To then track important local keywords and competitors, use the Position Tracking tool.Enter your domain in the Position Tracking tool. And, click “Set up tracking.”Set a local target (e.g., the city or state where your company operates).On the next page, you can add the keywords you’d like to track and click “Add keywords to campaign.”Now, you’re ready to “Start Tracking.”Once your campaign is ready, visit the “Competitors Discovery” tab to find local competitors.You’ll get a list of competitors sorted by “Visibility.”Visibility is based on click-through rate (CTR) and shows a website’s progress in Google’s top 100 ranked webpages for keywords in the current tracking campaign.Take note of competitors who are dominating the local conversation. Then, ensure your website is optimized for local search with up-to-date address and contact information across all your platforms (especially your Google Business Profile). Further reading: Local Keyword Research for SEO: What It Is & How to Do It Google My Business: A Guide to Google Business Profile2. Create Competitor ProfilesBuilding a profile for each of your main competitors allows you to benchmark important details, including market share and audience demographics.Here’s what that’ll look like in your competitive analysis document:Let’s begin by analyzing market share, or the influence a brand has within their industry.Analyzing Market ShareMarket share is a percentage of a company’s sales or revenue out of the total sales or revenue for its industry.Publicly traded companies are required to state their earnings every quarter.Many private companies are, too. So, you can get a lot of information by searching “[company name] quarterly report” or “[company name] annual report” in Google.You can also consider estimations from trusted business publications.For example, Yahoo Finance reports on a lot of this information for public companies.Here’s some of the market share information for Apple:To calculate market share, divide the total company revenue by total industry sales.Like this: Select a fiscal period (usually quarterly or annual) Calculate a company’s total sales for that period Calculate the industry’s total sales for that period Divide the company’s revenue by industry sales Multiply that number by 100 to find the market share percentageHere’s a real-world example: Toyota sold 2,332,262 vehicles in the U.S. in 2021.And 15 million total vehicles were sold in the U.S. during the same period.If we divide Toyota’s total sales (2,332,262) by the industry’s total sales (15,000,000), we get 0.155.Multiply that by 100, and we get 15.5%. Which is Toyota’s market share for 2021.We recommend completing this step for your main direct competitors. It’ll help you benchmark your success within your industry.Understanding Audience DemographicsMarket share shows you which competitor has the biggest influence over your audience. But it doesn’t tell you who that audience is. Understanding audience demographics can help you connect with customers and create products and services that address their needs.You can use a tool like Market Explorer to analyze any website’s audience demographics. Enter a competitor’s URL and head to the “Audience” tab.This report provides a high-level overview of the audience demographics in your niche, including: Age and sex Social media preferences Audience interestsNext, find out how your audience compares to and overlaps with your closest competitors. You can do this with Traffic Analytics.Select “Check Competitors.” Then, enter your domain and up to four competitor domains into the search bar, and click “Analyze.” Now, head to the “Audience Overview” tab. You’ll see a side-by-side comparison of each domain’s audience. And how much they overlap. Building Your Competitor Profiles It’s time to round out your competitor profiles by filling in basic company information. This provides context that could help you analyze your findings. And build a more competitive marketing strategy.For example, one of your competitors may have only been around for a few years. But if they’ve raised millions in funding rounds, they may be a bigger threat to you than a larger, more established competitor.You can find basic information about your competitors in the “Company Info” section of the Traffic Analytics “Overview” report. Just scroll down and you’ll see the widget. You can see which categories your competitors operate in, their funding amount, and roughly how many employees they have.Further reading: How to Use Website Demographics to Improve Your Marketing Strategy3. Analyze Your Competitors' Product, Pricing, Place, and Promotional StrategiesOnce you have all the preliminary insights, it’s time to explore “the four Ps” of marketing: product, price, place, and promotion. Let’s break it down: Product: How the product meets customers’ needs Pricing: How much their product or service costs Place: Where customers are looking for the product Promotion: How they advertise to their customersAdd that information to your competitive analysis document so that you can access and analyze the data easier:Analyzing this information about your competitors will give you a deeper understanding of their marketing strategies.You can replicate what’s already working in a better way. And avoid making the same mistakes. ProductBegin by visiting each competitor’s site and asking yourself: What’s their most popular product or service? What features does the product offer? Who’s the target audience for this product? What problem does this product solve?Take notes on your findings.Your competitors’ websites will give you insights into which products they prioritize. And which products they heavily promote or prominently display in their navigational menus.Steve Madden, for example, heavily prioritizes women’s apparel and accessories. They have several main navigation drop-downs for these topics: ”Women’s Shoes,” “Women’s Clothing,” “Handbags,” and “Accessories.”Like this:If we scroll further, we can also see that they are promoting what is probably a popular product right on the homepage:This is why manual investigation is important—you can get clear insights into what your competitor prioritizes just by navigating their site.PriceOnce you’ve identified popular products, pay attention to pricing.Here are some things to note in your competitor analysis: How does your competitor’s product pricing line up against comparable products? Do they have frequent sales, discounts, or other special offers?Of course, you need to make a profit. But if you notice that your competitors price similar products lower or constantly offer discounts, you may need to change your pricing strategy.PlaceThe third P refers to where your product or service is available. This can be a physical storefront, an online store, or both.If you place your product somewhere—in person or online—where your target audience doesn’t shop, you probably won’t see great results.To start, here are a couple of questions to consider: Where does your target audience shop? What distribution channels should you use to reach your audience?Here’s an example of “place” in action:Celebrity makeup artist Patrick Ta is known for his famous clients and luxury makeup line. So, it makes more sense that he sells his products in Sephora stores rather than affordable retail chains like Walmart or CVS.Place also applies to where you market your product.Say your company offers financial planning services. Your core audience probably skews a little older. So, it wouldn’t make much sense to market your services on Snapchat, which has a notoriously young audience without as much buying power.PromotionPromotion is all about where your competitors market their products or services. This includes both advertising channels and brand messaging.Here are a couple of things to consider when researching your competitors’ promotion strategies: Which of your competitor’s promotional channels drive the most traffic? (This could include direct, referral, paid, organic, or social.) What is their advertising strategy?To get an idea of how your competitors generate their traffic, head to the “Benchmarking” report in Market Explorer. You’ll see a breakdown of their traffic generation and social media distribution. And can compare up to five competitors at once. Like this:Here are a few conclusions you may draw from competitors’ best-performing channels: Direct: Direct traffic is when users navigate to a website directly, without the push of ads or links. So your competitor likely has strong brand awareness Referral: Referral traffic is when users arrive on a website through another source, like a link on another domain. So your competitor probably has a strong backlink profile, places banner ads on other sites, or has a strong digital PR presence Search: Search is traffic from organic search, which means your competitor prioritizes SEO and content. You can analyze their content marketing and identify their top pages. Social: Your competitor likely has a solid social media presence with an engaged audience. Investigate which platforms they use most. Paid: Your competitor probably has a strong advertising budget, particularly for paid search. Investigate which keywords they’re bidding on and analyze their ad copy with our Advertising Research tool.4. Evaluate Competitor Marketing StrategiesOne of the best ways to understand a competitor’s marketing efforts is to browse their website. It’s manual work, but it’s well worth the effort.Pay attention to any of the following elements: Do they run a blog? Do they produce whitepapers or ebooks? Do they share videos or webinars? Do they host a podcast? Do they use static visual content like infographics and cartoons? How about case studies? Do they have an FAQs section? Do they showcase featured articles? Do you notice press releases? Do they have a media kit? Do they publish buying guides and data sheets? How much are they investing in PPC? What online and offline advertising campaigns are they using?Take note of what your competitors are doing and what you aren’t.See what’s missing from your site and incorporate relevant missing elements into your own strategy. You should also look into your competitors’ paid marketing strategies.And you can easily do that with a tool like Advertising Research. Enter a competitor’s domain and click “Analyze.” You’ll see a dashboard with a summary of their ad campaigns, including: The number of keywords bringing in traffic from paid search The estimated monthly traffic from paid search The estimated average monthly cost to rank for those keywords in Google AdsScroll down and you’ll get a list of keywords your competitor is bidding for in Google Ads. Plus, you’ll see: The position they’re ranking for The average CPC for each keyword The exact URL they’re targeting with each keywordLike so:If you want to dive a little deeper, click on the “Ads Copies” tab. You’ll see the actual ad copy your competitor is running in Google Ads. And the keywords that trigger those ads. Pro TipUse AdClarity – Advertising Intelligence. To get specific data about your competitor’s advertising efforts. Like your competitors’ estimated expenditure, ad type distribution, ad buying methods, and ad spend trends. You can also see their current top ads. To get inspiration for your own creative advertising campaigns.Further reading: What Is Google Ads & How Does It Work? A Comprehensive Guide Marketing Strategy Guide: What It Is and How to Create One5. Analyze Marketing ChannelsOne of the most important aspects of competitive analysis is to understand how your competitors are reaching their target audience. In other words, what marketing channels are they using? How effective are they? How can you leverage them for your own business?And these marketing channels can be divided into eight main categories: Direct: When a user enter the URL directly into a browser's search bar Referral: When a user visits from clicking a link on another website Organic search: When a user visits from a search engine’s organic results Paid search: When a user visits from a search engine’s paid search ads Organic social: When a user visits from clicking a link on social media Paid social: When a user visits from clicking an ad on social media Email: When a user visits from clicking a link or banner in an email Display ads: When a user visits from clicking a display ad (banner, image, video, etc.) on another websiteYou can quickly analyze any competitor’s marketing channels with Market Explorer. Just enter their URL and scroll down to the “Domain vs Market Dynamics” widget. Click on each marketing channel to examine it more closely.Like this:Try to see how your main competitors’ marketing channels compare to yours. And record that data in your competitive analysis document.And determine whether you need to make any changes to say or get ahead.Further reading: Effective Digital Marketing Channels & How to Use Them6. Identify Your Strengths, Weaknesses, Opportunities & ThreatsAfter completing your competitor analysis, turn your observations into actionable insights by performing a SWOT analysis.SWOT stands for strengths, weaknesses, opportunities, and threats. A SWOT analysis looks like this—you’ll fill in each quadrant for your brand based on your competitive analysis findings:If you fill out a SWOT analysis for both your brand and your competitors, you can compare the answers to the above questions to see where each brand excels.This will help you identify where you’re doing well and where you can improve.Further reading: SWOT Analysis: What It Is & How to Do It [Examples + Template] How to Do a Competitive Landscape Analysis7. Track & Monitor ResultsOnce you have done your competitive analysis, you need to track and monitor results. This’ll help you measure your effectiveness and identify areas for improvement.There are different ways to do this, depending on your goals and metrics. But one of the most efficient is to set up a monthly competitor report. Head to My Reports, scroll through, and select “Monthly Competitor Analysis.”Enter your domain and two competitor domains. And click “Create report.”You’ll quickly get a competitor analysis report.First is a summary of your domain’s current performance. Then, you’ll see how your domain compares to your competitors. Like so: The great thing about the report is that it’s interactive. You can edit, add, or remove any widget you want. For example, if you want to add more competitors to “Traffic Analytics Overview,” hover over the widget and click the pencil icon.Add more competitors to the “Competitors” box, and click “Apply.” Here:The widget will immediately display data for the competitors you added. Once you’re done, click “Generate PDF report” on the top right. In the pop-up, enable “Email report” and “Schedule report.” Select your ideal time frame for the tool to run the report and email it to you.And click “Generate and send.” Now you have an easy and effective way to track and monitor performance against competitors. How Often Should You Do a Competitor Analysis?You should run a competitor analysis at least every quarter. And ideally every month. Why? Because digital marketing is always changing. And you need to stay on top of what your competitors are doing. However, you may also want to do a competitor analysis even more frequently. Especially if you notice any significant events or trends that affect your industry. For example, you may want to do an ad-hoc competitor analysis if you’re: Launching a new product or service Entering a new market or segment Facing a new competitor or losing market share Changing your pricing or positioning Updating your branding or messagingWhatever frequency you choose, make sure to set a clear schedule and stick to it. Doing a competitor analysis can help you stay ahead of the curve and gain a competitive edge in your market.Keep Tabs on the CompetitionYou’ve learned how to conduct a competitive analysis and why it’s important for your business.But don’t stop there. The market is constantly changing, and so are your competitors. You need to keep an eye on their strategies, strengths, weaknesses, and opportunities.You can do that with Market Explorer. It can help you: Discover new competitors in your niche Analyze your competitors’ performance, traffic sources, and growth trends Benchmark your website against them and identify gaps and opportunities Identify the best channels and tactics to reach your target audience Get insights into your competitors’ customer behavior and preferencesAnd more. Get a comprehensive overview of your competitive landscape and stay ahead of the game.",
  "headers": [
    {
      "level": "H1",
      "text": "What Is a Competitive Analysis & How to Do It (With Template)"
    },
    {
      "level": "H2",
      "text": "What Is a Competitive Analysis?"
    },
    {
      "level": "H2",
      "text": "Why Competitive Analyses Are Important"
    },
    {
      "level": "H2",
      "text": "What to Include in a Competitive Analysis"
    },
    {
      "level": "H3",
      "text": "Features or Products"
    },
    {
      "level": "H3",
      "text": "Pricing"
    },
    {
      "level": "H3",
      "text": "Target Audience"
    },
    {
      "level": "H3",
      "text": "Marketing"
    },
    {
      "level": "H3",
      "text": "Differentiators"
    },
    {
      "level": "H3",
      "text": "Strengths"
    },
    {
      "level": "H3",
      "text": "Weaknesses"
    },
    {
      "level": "H2",
      "text": "How to Do a Competitive Analysis"
    },
    {
      "level": "H3",
      "text": "1. Identify Your Competitors"
    },
    {
      "level": "H4",
      "text": "Find Your Industry Competitors"
    },
    {
      "level": "H4",
      "text": "Find Your Organic Competitors"
    },
    {
      "level": "H4",
      "text": "Find Your Paid Search Competitors"
    },
    {
      "level": "H4",
      "text": "Find Your Local SEO Competitors"
    },
    {
      "level": "H3",
      "text": "2. Create Competitor Profiles"
    },
    {
      "level": "H4",
      "text": "Analyzing Market Share"
    },
    {
      "level": "H4",
      "text": "Understanding Audience Demographics"
    },
    {
      "level": "H4",
      "text": "Building Your Competitor Profiles"
    },
    {
      "level": "H3",
      "text": "3. Analyze Your Competitors' Product, Pricing, Place, and Promotional Strategies"
    },
    {
      "level": "H4",
      "text": "Product"
    },
    {
      "level": "H4",
      "text": "Price"
    },
    {
      "level": "H4",
      "text": "Place"
    },
    {
      "level": "H4",
      "text": "Promotion"
    },
    {
      "level": "H3",
      "text": "4. Evaluate Competitor Marketing Strategies"
    },
    {
      "level": "H3",
      "text": "5. Analyze Marketing Channels"
    },
    {
      "level": "H3",
      "text": "6. Identify Your Strengths, Weaknesses, Opportunities & Threats"
    },
    {
      "level": "H3",
      "text": "7. Track & Monitor Results"
    },
    {
      "level": "H2",
      "text": "How Often Should You Do a Competitor Analysis?"
    },
    {
      "level": "H2",
      "text": "Keep Tabs on the Competition"
    }
  ],
  "author": ""
}