{
  "url": "https://www.semrush.com/blog/competitive-landscape/",
  "slug": "competitive-landscape",
  "title": "How to Do a Competitive Landscape Analysis",
  "description": "Running a competitive landscape analysis helps you discover competitors and new strategy. We’ll show you how competitive analysis works and 5 frameworks to use.",
  "content": "Whenever you’re trying to get from point A to point B, it helps to understand the terrain between the two. How far do you have to go? What hazards should you look out for? Where can you stop for gas? Knowing the landscape makes for a successful journey. As a business owner or marketer, it’s all about the market landscape. Without a doubt, you’ll encounter competitors along the way, and they can slow down your progress. That’s why it's important to know exactly where they stand. A competitive landscape analysis provides the information necessary to overcome your competitors and reach your destination. In this article, we’ll explain what a competitive landscape analysis is, describe some common competitive landscape analysis frameworks, and offer some techniques that demonstrate how to conduct a landscape analysis.What Is a Competitive Landscape Analysis? Competitive landscape analysis is the process of examining your market to identify your competitors and figure out where they stand with regard to other players, including you. While the competitive landscape analysis process shares a lot in common with competitor analysis or market analysis, there’s an important distinction. Competitive landscape analysis is primarily focused on studying the relationship between businesses and how they relate to each other.You can use the process to analyze and understand a variety of different metrics, such as: Market share Product offerings and pricing Website traffic data Positioning and messaging Company growth and trajectory Competitive landscapes change over time, and they may look different depending on what metrics you’re analyzing. Because of this, competitive landscape analysis is usually considered an ongoing process.There are also a variety of ways to organize your analysis. You may decide to use a simple spreadsheet or a more advanced competitive matrix. Either way, an understanding of the relationships between players on the field is the goal. 5 Competitive Landscape Analysis FrameworksThere are a variety of frameworks you can use for analyzing the competition. Different frameworks will yield different insights about the competitive landscape. Here are 5 common competitive landscape frameworks and some ideas on what insights they might generate. SWOT Analysis A SWOT analysis is a process of examining your business using a 2X2 grid. Each quadrant of the grid represents a letter in the acronym SWOT. In the quadrant, you write down your business’s Strengths, Weaknesses, Opportunities, and Threats as they relate to your competition. A SWOT analysis can be great for strategic planning, as it opens up ideas about potential opportunities to seize and threats to counteract. Strategic Group Analysis With a Strategic Group Analysis, you organize competitors into clusters according to their business models or strategies. The clusters help illustrate the landscape and better understand relationships between businesses. Some criteria for clusters include: Product diversity Geographic coverage Markets served Distribution channels used Marketing strategies Product quality or pricing A Strategic Group Analysis can help you pinpoint your closest competitors and understand the precise nature of the competition. It can also help you examine different strategies to realize opportunities or problems. BCG Matrix A BCG Matrix, popularized by the Boston Consulting Group (IE BCG), is a framework that helps you decide how to prioritize different products, services, or aspects of your business. The matrix examines items along two dimensions: growth and market share. The items are then placed in one of four categories: Pets — Items with low growth rate and low market share Question marks — products with small market share and high growth rates Stars — items with high market share and fast growth rate Cash cows — products with high market share but lower growth rates Considering your products alongside competitor products can help you think about where to invest in terms of product development, product-line expansion, and product marketing. Perceptual Mapping Perceptual Mapping is a framework for understanding how your brand or product is positioned with regard to your competitors. With this framework, you place brands or products on a grid with two criteria defining the X and Y axis. For example, quality and price. Customer feedback is central for understanding how the market perceives a given business and product. Perceptual mapping is useful for understanding how people think about your product compared to your competitors’, allowing you to make decisions about future positioning efforts. Porter’s Five Forces A Porter’s Five Forces analysis provides a framework for examining the overall competitiveness of a particular market. Overall competitiveness is determined based on five forces: The intensity of the competitive landscape Level of supplier power Buyer’s entry/exit costs The threat of substitute products Access to the market for new entrantsThe Porter’s Five Forces framework can be especially useful if you’re interested in entering a new market or expanding a product line or service offering. It can help in identifying the key challenges you may face in your efforts. How to Gather Data for a Competitive Landscape Analysis (with Examples) Once you’ve selected the right competitive analysis framework for organizing your landscape analysis, you’ll need to figure out where to collect data about your competitors. You might start by simply analyzing your competitors' websites or social media pages. You could also look at industry resources such as Statista, Pew, or Gartner. Or you might try a competitive intelligence software like Semrush .Trends or Kompyte. When you need data on competitor paid or organic web traffic, traffic generation strategy, market share, or content marketing, the .Trends tools can help you understand the lay of the land. Let’s take a look at three examples to highlight Semrush’s features. This is by no means a full overview of these tools. As a brief exploration, it provides a sense of what kind of data you can gather with Semrush .Trends to plug into your selected competitor analysis framework. Overall Market Landscape Analysis Data For overall market landscape data, we can begin with Market Explorer’s Overview report. Simply enter competitor domains and the tool returns a host of insights you can use to better understand the competitive landscape.The Growth Quadrant is a great competitive landscape example. It helps you visualize the lay of the business terrain by showing you where each of your competitors stands over a given period, and in relation to one another. Let’s look at the data gathering process by examining the food delivery industry.This graph depicts competitor movements from October 2021 to November 2022. With this particular landscape chart, it’s clear that Doordash leads the pack with consistently high traffic numbers and also a significant growth percentage over the last year. And while Uber Eats and Grubhub still aren’t seeing Doordash-level success, they’ve witnessed a movement toward higher levels of consistent traffic. We might also consider the Market Summary section of the Overview Report for information about competitor growth rates and market share. For example, the Key Players and Market Size sections of the summary show the percent of the market each player owns and the size of the overall market.In September 2022, the Total Addressable Market (TAM) was nearly 6B with a Serviceable Addressable Market (SAM) of 1B. The fact that the SAM is only one-sixth the size of the TAM suggests there’s still plenty of room for this market to grow.Doordash captured the lion’s share of traffic with 65% of total market traffic. And though Uber Eats has seen strong growth over the past year, they still only had 17% of the market cornered. Using historical data, we can track market size and share over time, which provides an understanding of changes in the landscape. For example, here’s a look at the Market Summary for September 2020.From the 2020 vantage point, Doordash isn’t quite as in control of the market as they will be in 2022. Likewise, Uber Eats isn’t lagging behind Grubhub by such a large margin. With this new information, we might track the changes in market share month by month, or try to figure out what steps Doordash or Uber Eats took to overcome the competition. It’s also interesting to note that the market was more than 2X smaller in 2020, so as the market has grown between 2020 and 2022, Doordash has done the best job of capturing new market share. The Benchmarking Report in Market Explorer also offers useful data for your landscape analysis. For example, the Market Share by Channel Graph depicts a side by side comparison of what share of the market goes to which business through a given channel. Here’s a look at Market Share by Channel in September 2021. As the market leader, Doordash took the top spot in each traffic channel, earning more than half of all traffic in the Direct, Referral, and Social categories. Looking at the graph for 2022, however, shows a slightly different picture. In 2022, we discover Uber Eats has taken the prize in the Referral category with a total of 42% of the market traffic. Likewise, both Grubhub and Uber Eats made gains in the Search category. Audience Landscape Analysis Data For competitor audience data, Traffic Analytics provides a ton of insights that can help you understand your market’s audience and where it corresponds to each of your competitors. In particular, the Audience Insights report offers all of the data you need to understand your competitors’ relationships to the market audience. With the Audience widget, you can view the breakdown of the market audience among competitors in terms of age and sex. For example, with the food delivery market the majority of the audience skews slightly toward men, and the majority of audience members are in the 25-44 age range.Looking closer, we can gather data about individual competitors to track and make comparisons. For example, notice the orange bars in the graph belonging to Uber Eats. The portion of the audience that uses Uber Eats is heavily consolidated in the 25-34 age range. Doordash, represented by the blue bars, has a slightly more distributed audience age range. The Audience Insights Report also provides useful data about how competitors’ audiences overlap. This graph shows the audience overlap among Doordash, Grubhub, and Uber Eats in September 2022. Doordash, represented by the large blue circle, has the largest number of unique visitors, while Uber Eats and Gubhub have audiences much closer in size. When looking at the way the circles overlap, however, it becomes clear how the audience is shared among these three competitors. While Grubhub and Uber Eats are much closer in audience size, Grubhub shares a larger portion of their audience with Doordash than Uber Eats, making them more vulnerable to Doordash. Finally, the Audience Insights report offers a variety of data points related to demographics, psychographics, and socioeconomics. Here’s a look at the Employment Status breakdown for Doordash, Grubhub, and Uber Eats. As shown, there are approximately 14.4M homemakers in the delivery market’s audience. Of this audience, 61% prefer Doordash, 21% prefer Uber Eats, and 19% prefer Grubhub. Comparing the Homemaker segment to the Parental Leave segment, we discover the percentage of Doordash users is 6% smaller within the Parental Leave segment, and the portion of those on Parental Leave that prefer Uber Eats is over 9% larger. Product Landscape Analysis Data When it comes to the competitive landscape as it relates to products and services, both Traffic Analytics and EyeOn can provide a wealth of data. The Top Pages report in Traffic Analytics lists your competitors most popular web pages and provides filtering options to bring the most useful data to the forefront. Here’s a look at Doordash’s Top Pages report for the month of September 2022. Notice the highlighted pages on the list. In terms of a competitive landscape analysis looking closely at service offerings, these pages may provide big picture insights into the Doordash’s business strategy and results. The first highlighted page allows users to sign up to deliver for Doordash.com, which could provide insight into one specific aspect of the company’s growth strategy if tracked month by month. In September 2021, 836K Unique Visitors accessed the /signup page. The second highlighted page, “/consumer/checkout,” should give us a sense of the number of users making it to checkout. From here, we can estimate conversions by dividing the number of Unique Pageviews for the checkout page by the total number of Unique Pageviews for doordash.com, and then multiply by 100. To use this example: 11.6M Unique Pageviews (checkout) / 79M Unique Views (Doordash home page) equals .146, and .146 x 100 equals 14.6. So, the estimated conversion rate would be 14.6%. We could compare conversion numbers across competitors and across various time periods to help us compare conversions or analyze the strengths of their sales funnels. Each page also offers a dropdown view with a graph revealing the sources of the page’s traffic. For example, consider Uber Eats’ page for their “Eats Pass,” a subscription service that offers their users discounts and special offers. From this view, we can visualize the traffic sources for this page and better understand how Uber Eats markets this product. While direct traffic is most common, the amount of referral traffic coming to the page is also high. This suggests strong partnerships are part of their marketing strategy. Finally, the EyeOn tool tracks your competitors, providing an organized view of their marketing trends and a timeline of their recent Google Search Ads, Blog Posts, and New Pages. In terms of tracking products and services, the Timeline feature depicts an overall view of what products competitors are offering and which ones are getting the most promo attention. For example, Doordash recently ran an ad looking to attract new businesses to utilize their services.From the EyeOn timeline, you can navigate directly to the landing page to peek at how they’re promoting a particular product or service. Digging deeper can provide important context about competitors’ marketing strategy. For example, the ad itself doesn’t say anything about COVID, but notice the image of restaurant owners in masks and the focus on “reopening” and “recovery” as a marketing strategy to attract customers in a COVID influenced market. EyeOn will also send you a weekly email detailing your competitors ads and blog activity. With the combination of the trends graphs, Timeline, and weekly emails, you’ll be able to keep a close watch on your competitors' new product and service rollouts, their most popular promos, and trends in their marketing activity. Your Competitive Landscape Report Once you’ve uncovered your competitors, selected a framework for analyzing the competition, and gathered data, you’ll need to organize your findings. Again, understanding the lay of the land for strategic planning is the entire point of the competitive landscape analysis. This often involves sharing your findings with other stakeholders. A variety of tools exist to help you share your findings. For simple analyses, a simple spreadsheet or a whiteboard may work.For other research, you may want to use a tool like Google Looker Studio (formerly known as Google Data Studio) or Tableau. Either way, because landscape analyses focus on relationships between businesses, it can help to study and present your findings visually.Don’t be afraid to get creative!Often, looking at data in different ways helps draw better conclusions and explain your findings to stakeholders with more clarity.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Do a Competitive Landscape Analysis (If You’ve Never Done It Before)"
    },
    {
      "level": "H2",
      "text": "What Is a Competitive Landscape Analysis?"
    },
    {
      "level": "H2",
      "text": "5 Competitive Landscape Analysis Frameworks"
    },
    {
      "level": "H3",
      "text": "SWOT Analysis"
    },
    {
      "level": "H3",
      "text": "Strategic Group Analysis"
    },
    {
      "level": "H3",
      "text": "BCG Matrix"
    },
    {
      "level": "H3",
      "text": "Perceptual Mapping"
    },
    {
      "level": "H3",
      "text": "Porter’s Five Forces"
    },
    {
      "level": "H2",
      "text": "How to Gather Data for a Competitive Landscape Analysis (with Examples)"
    },
    {
      "level": "H3",
      "text": "Overall Market Landscape Analysis Data"
    },
    {
      "level": "H3",
      "text": "Audience Landscape Analysis Data"
    },
    {
      "level": "H3",
      "text": "Product Landscape Analysis Data"
    },
    {
      "level": "H2",
      "text": "Your Competitive Landscape Report"
    },
    {
      "level": "H6",
      "text": "Most popular pages"
    },
    {
      "level": "H6",
      "text": "SEO Checklist: 41 Tips to Optimize Your Website"
    },
    {
      "level": "H6",
      "text": "How to Perform a Complete SEO Audit (in 14 Steps)"
    },
    {
      "level": "H6",
      "text": "A Beginner’s Guide to Keyword Search Volume"
    }
  ],
  "author": ""
}