{
  "url": "https://www.semrush.com/blog/content-marketing-landscape-in-2022/",
  "slug": "content-marketing-landscape-in-2022",
  "title": "How SMBs Engage in Content Marketing in 2022",
  "description": "SMBs account for 99.9% of all businesses in the US. Here we look at their content marketing goals, production practices & what achieves the best ROI.",
  "content": "Forget sexy startups, head turning unicorns and world-conquering enterprises—it’s Small and Midsize businesses (SMBs), where we find the true beating heart of the US economy. There are approximately 32.5 million SMBs in the States. They account for 99.9% of all businesses, employ approximately 47% of the private workforce, and represent an equally significant portion of GDP.So of course we wanted to understand exactly how SMBs engage in content marketing and how it impacts their businesses. In this snapshot of the content marketing industry, we explore: What SMBs look like How SMBs create content A dive into content creation practices in industry verticals A look at content marketing goals for SMBs Content marketing goals by industry vertical How company type affects content marketing goals SMB content marketing budgets What SMB content types look like Content marketing type by industry vertical How target audiences affect content production Where SMBs get the best results from their content marketing Differences in content performance across industriesWhat SMBs Look Like We surveyed 217 small and midsize businesses in the US with a staff of 1-50 people, across a range of industries and domains. A slight majority (32%) of respondents fell into the 45-60 age bracket, followed by 30-44 (29%), then the over 60s (20%), and 18-29 (19%).Most respondents work in business to business (B2B) and Business to consumer (B2C) industries (37% and 36% respectively) and 12% work B2B2C. The remainder, (totalling approximately 14% of responses) are in consumer to consumer (C2C), Direct to consumer (D2C) and Consumer to business (C2B) businesses. The industries covered in the survey are also a melting pot, ranging from agricultural operations to entertainment companies, insurance firms and logistics. How SMBs Create ContentThe numbers are dizzying—SMBs pump out billions of words of content every month. With over 70 million blogs published on the Wordpress platform alone, the content marketing industry is clearly thriving. The question is, who’s doing the work? Our survey has uncovered that in-house writers are the most popular option for sourcing marketing content, with over 60% of the responses.In second place, but also quite a way behind, come digital and content agencies. Only 18% of the responses from SMBs point to this option. Next, we see writers from one’s own network, premium freelancers, and writers from gig sites like Upwork and Fiverr are engaged a similar amount, accounting for 14%, 13%, and 11.5% of total responses.The data also shows us that working with content writing services or content marketplaces is relatively uncommon among SMBs. In fact, only 8% rely on their services for content production. Artificial Intelligence (AI) writing tools are even less popular, with under 5% of responses going for this option.It’s very possible that these relatively new content production options are not yet on our respondents’ radars. Many experienced marketers may still prefer more traditional or time-tested ways of working.On top of this, the results give us a general idea of SMB trends. However, with such a broad range of industries, it’s also important to consider that there are greater differences between industry verticals. A Dive Into content Creation Practices in Industry VerticalsWhen we analyzed some selected industries separately, we found out that the breakdown looks a little different.Content Marketing in the Advertising IndustryIn the advertising industry it’s more popular to hire premium freelance writers—accounting for 58% of total responses. A quarter of professionals in this space work with writers who have been referred, and another quarter work with writers from gig websites. Notably, no respondents in advertising said they work with in-house writers.Content Marketing in the Food and Beverage IndustryIn contrast, in the Food and Beverage industry, we see a big reliance on in-house writers (53% of responses) and digital and content agencies (40% of responses). Next in popularity are writers who have been referred (26%). Then there’s an even split between content marketing marketplaces and writers from gig sites like Upwork and Fiverr (both at 13%). Premium Freelance writers and AI writing tools are not popular options at all, each garnering under 10% of the responses.Other Key IndustriesAmong the Healthcare, Ecommerce, Education industries, the top three preferences were: In-house writers Freelancers from their own network or referred writers Writers from gig sites like Upwork and Fiverr We hypothesize that SMBs may be mostly unaware of some alternatives like content writing services and AI content writing tools. A Look at Content Marketing Goals for SMBsWithout an objective, content marketing is just noise. So we wanted to dig into the reasons why SMBs all over the US engage in content production. Here are how their business goals break down:Top content marketing goals in order of importance Build your brand awareness — 46% Increase traffic to your website — 41% Improve sales results — 40% Build engagement on social media — 29% Onboard and retain clients — 27% Lead generation — 23% SEO — higher positions in search engines, more backlinks, more referring domains — 20% Other (please specify) — 6% Of those who chose “Other,” most say they want to “get better local site visibility” and “get more people to enjoy what I create.”Content Marketing Goals by Industry VerticalOnce again, the general overview is an interesting one, but we see more meaningful results when we look at content marketing goals by industry sector. As you might expect, there were several notable differences.Education Industry Content Marketing GoalsFor companies in the Education domain, our responses show it’s most important to use content to build a stronger brand (71%) and engage with potential customers in specific channels (42%), alongside achieving higher positions in the search results (also 42%).Building brand awareness certainly seems to match with the characteristics of the education industry. After all, content is an excellent vehicle to offer support, expertise and set your company apart from the rest in terms of thought leadership.Ecommerce Industry Content Marketing GoalsWhen it comes to ecommerce, respondents understandably say their goals relate to generating more targeted traffic to their sites (86% of the responses) and improving sales results (57% of the responses). Interestingly, the ecommerce cohort is also focused on building an engaged social media community (57% of responses) and, linked to this, they understand the importance of building brand awareness (43%). This may be down to social selling capacities, the power of peer recommendations and reviews—as well as the lure of repeat custom.Fewer responses show concern about SEO and lead generation as standalone metrics. Perhaps this relates to a stronger reliance on digital ads on social and search in this industry vertical.Advertising Industry Content Marketing GoalsIn the Advertising sector, we see content is mostly used to build a solid organic presence (41% of responses) and use this channel as their key source of customer acquisition. But there’s quite an even spread among other goals.How Company Type Affects Content Marketing GoalsIndustry is one major influencing factor when it comes to content marketing goals, but company type is also a key consideration. Whether a company is B2B, B2C, B2B2C or another permutation, will make a difference to a marketer’s objectives. In the survey, we wanted to uncover how these goals differ by company type.B2B GoalsIn B2B, we see that Lead generation (48%) is the primary goal, followed by Onboarding and client retention (47%), then Increasing website traffic (45%).B2C GoalsThings look different in B2C companies. The main aim is to build engagement on social media (48%), followed by improving sales results (45%), and finally lead generation (38%).SMB Content Marketing BudgetsThe vast majority of SMBs have a maximum budget of around $1000 for monthly content production. The 22% of respondents with higher budgets are more determined to create content at scale and set their spending between $1000 and $2000 per month.The advertising industry falls into this bracket and has the highest content marketing spend. Just over 66% say they budget $1000-$2000 per month for content creation. What SMB Content Types Look LikeSo now we know who’s creating content, how they’re creating it, and why. It’s time to look at what they are actually producing—and it’s an interesting insight into content marketing practices in the US as a whole. We had a full-range of answers, with significant numbers favoring all the usual suspects: emails, blog posts, product descriptions, and videos.But what is different is that we see a shift from the usual top preference for blogs. Emails or newsletters are a clear winner here. This suggests that the goal posts have moved and we’re seeing greater conversions (or more sales) through more finely segmented content marketing. Ads and product descriptions are also quite popular, indicating the importance of a fast return on investment when it comes to marketing spend. Videos, too, have a robust presence, which follows a growing trend in the last few years. What we see less of also makes sense too. Ebooks and white papers as premium content are not as frequent a choice. Marketers are often more selective about producing gated or long form content, as it often takes more time and resources to do so. Content Marketing Types by Industry VerticalOnce again, the types of content brands are creating differs starkly by industry. Given the very different target markets in question and their various preferences for content consumption, it makes sense. Here’s how content marketing breaks down in several key industries:Healthcare Startups and Growing Businesses The overwhelming majority of Healthcare startups and growing businesses (66%) are using blog articles to build brand awareness and generate leads. Emails are also widely used to achieve these business goals (58%). As for other content formats, they are either of secondary importance for the surveyed Healthcare SMBs or are almost completely ignored.Manufacturing Industry SMBsManufacturing SMBs invest more into product descriptions (61.5%), which rings true as much of their efforts are focused on promoting physical products which warrant showcasing. Organic social posts (46%) and videos (46%) are also popular. Their aim with these content formats is to build better brand awareness, generate more traffic to their sites and increase sales. It’s a sensible move considering how well videos do so well to assuage doubts, answer objections through visual demonstrations, and show customer experience.Retail Sector SMBsWe see a similar scenario playing out in the retail sector, which also favors organic posts (53%), product descriptions (41%) and video (35%). Their principal aim is also to increase sales, with an even split of results when it comes to increasing traffic, building brand awareness and building engagement (41% per answer).How Target Audiences Affect Content ProductionWhere a company sells its services has a big effect on the type of content it needs to produce. Here we delved into the content varieties that B2B, B2C and other organization types create.There is a gulf between B2B and B2C: While blog posts are the number one for B2Bs, it’s not even in the top five for B2Cs. While organic social media posts are an absolute king for B2Cs, they don’t feature for B2Bs. Here’s how it breaks down:B2B Top 5 Content Formats (Sorted by Popularity): Blog posts / articles (55%) Case studies (38%) Emails (36%) Press releases (34%) Website copy (32%)B2C Top 5 Content Formats: Organic social posts (73%) Ads (48%) Guest posts (43%) Press releases (34%)—only this content type is the same for both Emails (33%)As a takeaway here, what works well for others, may not work well for your business. It’s key to always consider (and test) content formats for your target audiences, and pay attention to your results carefully. Where SMBs Get the Best Results from Their Content MarketingHere’s the question that everyone is asking: What’s working and what’s not?First, let’s look back at email—the most favored form of content. Email is also the number one content type when it comes to earning incremental gains, showing 27% of the responses. Then we see that blogs also drive content marketing results, with 22% of responses. Next, with 20%, we can see that ads also pay off.Not far behind, with 19%, guest posts seem to perform well. This stands in contrast to the concerns of some marketers who claim that guest posts are ineffective. Other back videos (16%) and organic social (15%).Overall, we see that it clearly pays dividends to create a diverse range of content types.Differences in Content Performance Across IndustriesOnce again, the breakdown of top-performing content formats look somewhat different, if you drill down into different industry verticals. Here’s what we found:Content Marketing Performance in Advertising SMBs in the advertising sector see the best results in press releases by a long shot (66%) and then blog articles (33%), followed by website copywriting (25%). Other content types, including ads and case studies only received about 16% of the responses.Healthcare Content Marketing PerformanceDespite investing heavily and dedicating more resources and budgets to blog articles, Healthcare SMBs see decent return on investment from all content types. If we were to take an educated guess at the reasons for this, we would say that with such a large and diverse market, they require a similar range of content types to suit differing needs.Manufacturing Startups and Growing BusinessesNo heads will turn when we say that for manufacturing startups and growing businesses the best returns on investment come from product descriptions (38%). But we also see decent performance coming from videos, emails, and ads (23% each) and blogs (15%).Final WordsWhile there are a few unsurprising insights in this research, there are certainly some standout details. We did not expect email to overtake blogs in popularity, nor did we see that organic social posts would be so overwhelmingly popular for B2C businesses. We would also like to highlight the importance of testing different content types to determine your audience’ preferences to ensure that what you create has the impact you had hoped for. As we’ve seen, any content type can be your best performer—but you have to be sure that it’s well produced, has a clear objective and resonates with your target audience.",
  "headers": [
    {
      "level": "H1",
      "text": "The Content Marketing Landscape in 2022: Small & Midsize Businesses"
    },
    {
      "level": "H2",
      "text": "What SMBs Look Like"
    },
    {
      "level": "H2",
      "text": "How SMBs Create Content"
    },
    {
      "level": "H2",
      "text": "A Dive Into content Creation Practices in Industry Verticals"
    },
    {
      "level": "H3",
      "text": "Content Marketing in the Advertising Industry"
    },
    {
      "level": "H3",
      "text": "Content Marketing in the Food and Beverage Industry"
    },
    {
      "level": "H3",
      "text": "Other Key Industries"
    },
    {
      "level": "H2",
      "text": "A Look at Content Marketing Goals for SMBs"
    },
    {
      "level": "H3",
      "text": "Top content marketing goals in order of importance"
    },
    {
      "level": "H2",
      "text": "Content Marketing Goals by Industry Vertical"
    },
    {
      "level": "H3",
      "text": "Education Industry Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Ecommerce Industry Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "Advertising Industry Content Marketing Goals"
    },
    {
      "level": "H2",
      "text": "How Company Type Affects Content Marketing Goals"
    },
    {
      "level": "H3",
      "text": "B2B Goals"
    },
    {
      "level": "H3",
      "text": "B2C Goals"
    },
    {
      "level": "H2",
      "text": "SMB Content Marketing Budgets"
    },
    {
      "level": "H2",
      "text": "What SMB Content Types Look Like"
    },
    {
      "level": "H2",
      "text": "Content Marketing Types by Industry Vertical"
    },
    {
      "level": "H3",
      "text": "Healthcare Startups and Growing Businesses"
    },
    {
      "level": "H3",
      "text": "Manufacturing Industry SMBs"
    },
    {
      "level": "H3",
      "text": "Retail Sector SMBs"
    },
    {
      "level": "H2",
      "text": "How Target Audiences Affect Content Production"
    },
    {
      "level": "H3",
      "text": "B2B Top 5 Content Formats (Sorted by Popularity):"
    },
    {
      "level": "H3",
      "text": "B2C Top 5 Content Formats:"
    },
    {
      "level": "H2",
      "text": "Where SMBs Get the Best Results from Their Content Marketing"
    },
    {
      "level": "H2",
      "text": "Differences in Content Performance Across Industries"
    },
    {
      "level": "H3",
      "text": "Content Marketing Performance in Advertising"
    },
    {
      "level": "H3",
      "text": "Healthcare Content Marketing Performance"
    },
    {
      "level": "H3",
      "text": "Manufacturing Startups and Growing Businesses"
    },
    {
      "level": "H2",
      "text": "Final Words"
    },
    {
      "level": "H6",
      "text": "Most popular pages"
    },
    {
      "level": "H6",
      "text": "SEO Checklist: 41 Tips to Optimize Your Website"
    },
    {
      "level": "H6",
      "text": "How to Perform a Complete SEO Audit (in 14 Steps)"
    },
    {
      "level": "H6",
      "text": "A Beginner’s Guide to Keyword Search Volume"
    }
  ],
  "author": ""
}