{
  "url": "https://www.semrush.com/blog/content-spam/",
  "slug": "content-spam",
  "title": "Content Spam 101: What It Is + What to Do About",
  "description": "Learn how to spot content spam, how to avoid it in your writing, and how to report it.",
  "content": "What Is Content Spam?Content spam is low-quality content that uses manipulative or unethical SEO tactics to try to increase clicks, traffic, or conversions. Or, in extreme cases, to try to steal user info (usually through phishing).Marketers, website owners, and even seemingly reputable sources can engage in content spamming practices to try to artificially boost website rankings. For instance, keyword stuffing is a common form of content spam.And let’s say you worked hard on a blog post about healthy eating. A week later, you find the same post on another website, mixed with ads for weight loss pills and other products you would never promote.That’s also content spam.Types of Content SpamThere are a bunch of different forms of spam content designed to deceive both users and search engines.Here are some common examples: Cloaking: Showing different content to search engines and users to attract traffic under false pretenses. For instance, a site might seemingly contain content about popular novels, but it actually only has cookbook advertisements. Doorways: Low-quality intermediate pages that content spammers design to attract traffic for specific search queries, yet lead users to another page that’s not as useful as the final destination. Imagine a website with different URLs that all lead to the same web page, often with irrelevant or misleading content, to capture more traffic. Hidden text and links: Text or links that are hidden from users but visible to search engines. For example, publishing white text on a white background. It’s a sneaky way to include more keywords and links without it being apparent to visitors. Keyword stuffing: Cramming web pages with keywords in a way that is unnatural, repetitive, or out of context to try to boost search engine rankings. Think of a web page repeating the phrase \"organic dog food\", even when it’s unnecessary, to try to rank for it: \"Our organic dog food is the best organic dog food because when it comes to organic dog food, we know you want organic dog food that's nutritious.\" Scraped content: Stolen content that spammers republish without adding value, originality, or citing their source. Content scrapers typically use automated tools to systematically copy content from other websites. Spammy automatically-generated content: Content created by bots, automated processes, or AI that’s typically stuffed with keywords and lacks user value. For example, an article on \"The Best Burgers in New York\" where the content nonsensically lists various burger-related terms without providing real insights or reviews, about burgers in New York. The piece might repeat phrases like \"best New York burger experience\" or \"top burger New York\" to try to manipulate search engine rankings. Thin affiliate pages: Pages filled with thin content, affiliate links (links to products or services that earn the page owner a commission for referrals), and copied product descriptions. These pages are created solely to serve the spammer’s financial interests. User-generated spam: Spam content posted by individual users on different platforms, like in forums or comments. This kind of spam usually repeatedly promotes products, services, or websites to try to boost traffic (sometimes to fraudulent sites) and to improve their search engine rankings. Link spam: Paying for backlinks instead of earning them naturally Check out Google Search’s full list of spam policies to learn about others.How Can Content Spam Impact Your Site?Publishing spam or being a victim of content spam negatively impacts your brand. Initially, publishing content spam might seem like a quick way to boost traffic and improve search engine rankings.After all, Google Search Advocate John Mueller even admitted that, sometimes, it’s tough to determine original posts vs. plagiarized content—especially if the spam website is “higher quality” than the source.But bottom line: content spam isn’t ethical or helpful. And it almost always backfires.Here are some consequences of engaging in content spam: Google penalties: Google's algorithms and employees still can identify and penalize spammy content practices, flagging the website with a Manual Action. If this happens, your site will probably suffer a significant drop in rankings or get kicked of search results entirely. Loss of trust: Low-quality spam content impacts your brand credibility. And makes users less likely to return to or recommend your site. Fewer conversions: Even if spammy content does drives traffic to your site, it's unlikely to lead to meaningful actions (like purchases or sign-ups) if your content doesn’t meet user needsOn the other hand, if, say, your content has been scraped and re-published without your consent, it can lead to issues like: Diluted visibility: If search engines struggle to identify your site as the original source, your rankings can take a hit—especially if the spam site has higher authority than yours. Increased competition: When spam sites copy your content, they're also competing with you for the same keywords. This can impact your search rankings and make it harder for users to find your original conten Reputation damage: When users and search engines associate your content with low-quality or spam sites, it can indirectly harm your site's reputation.How to Avoid Content Spam in Your Web Pages and Getting FlaggedWhile most spammers know exactly what they’re doing, it’s still possible to engage in spammy practices without realizing it. For example, you might overuse keywords to the point where your content becomes difficult to read. Or duplicate content across pages to try to help it rank for more search queries.You’re not trying to harm users—but you’re not actually helping them. And you can still get flagged for these practices, regardless of your intent.Keep these best practices in mind to keep your writing clear of anything close to spam content:Use the E-E-A-T Framework to Guide Your WritingExperience, Expertise, Authoritativeness, and Trustworthiness (E-E-A-T) is a concept included in Google’s Search Quality Rater Guidlines. Making sure your content reflects those elements is a good way to check that you’re providing real value to users. And while E-E-A-T itself isn't a direct ranking factor, content that embodies E-E-A-T helps build user trust and brand credibility. Which, in turn, can positively impact your rankings.Ask yourself these questions to stay on the E-E-A-T track when writing content: Experience: Does your content demonstrate relevant knowledge or hands-on learning about the topic? Have you shared clear examples or case studies that illustrate your work with the subject? Expertise: How are you demonstrating the accuracy of your claims? Do you cite reputable sources or include expert opinions? Authoritativeness: Is your content recognized by peers or authoritative figures in your industry? Do other experts reference your work as a trusted source of information? Trustworthiness: Does your site have a clear way for visitors to verify the accuracy of your information (e.g., contact information, citations)? Is your content free from factual errors and clearly distinguished from opinion pieces?Additionally, use SEO Writing Assistant to make sure your content works for both users and search engines. The tool gives recommendations on how to improve your content’s readability, SEO, originality, and tone of voice.Click on “SEO Writing Assistant” under “Content Marketing.” Then, click “Analyze my text.” NoteIf you’ve used this tool before, just click \"+ Analyze new text.\"Type or paste your content in the input box. On the right-hand sidebar, add a minimum of two target keywords in the “Keywords” box. Select your target audience, then click the “Get recommendations” button.You’ll see a content score pop up on the right. Along with a graph that highlights your content’s strongest and weakest areas:Click the “Highlight issues” drop-down menu to show content issues to resolve. Use the toggle buttons to focus on specific areas.Scroll down on the right pane to view more details and recommendations on how to improve your content. Use Keywords AppropriatelyProper keyword use improves your content's relevance and searchability without resorting to spammy practices. By integrating keywords thoughtfully, you ensure your content remains informative and user-focused.Here’s how to do it: Use Semrush’s Keyword Magic Tool to research and select keywords that are directly relevant to your content's topic Incorporate keywords naturally within the text, titles, and meta descriptions, so that people and search engines that read your content smoothly Use keywords to support content creation, not dominate it. Come up with relevant content ideas, then integrate relevant keywords where they make sense contextually.Implement Organic Link BuildingLike keywords, links should complement your content—not dominate it. Focus on creating quality content that uses links to direct users to relevant pages. Whether on your site or on other credible sites.Incorporating thoughtful internal and external links provides direct value to readers. And also puts you in a better position to organically earn backlinks from reputable sites.Speaking of, don’t pay for backlinks.Instead, use link building strategies like reaching out to relevant websites for guest posting opportunities. It’s OK to want to get links—but do so in a way where you’re still contributing helpful, useful information.How to Identify Third-Party Content SpamWhether you’re just surfing the web or trying to figure out why your rankings have suddenly crashed, it’s good to know the signs of content spam. This way, you can take steps to remediate it. And help keep the web useful and safe.Here are some quick tips: Check for relevance and quality: Spam often lacks depth and presents irrelevant or repeated information Look for excessive keyword use: An unnatural frequency of keywords can indicate keyword stuffing Evaluate the writing style: AI-generated or poorly written content that lacks a human touch or logical flow can be a red flag for spam Beware of suspicious content structures: Pages that are cluttered with ads, have hidden text, or lead users through unnecessary redirects may be using content spamming practicesIf you’re still in doubt, use Semrush’s Backlink Analytics tool to check the website’s credibility via its Authority Score (AS).Enter the domain name in the search bar, and click the “Analyze” button.You’ll see “Authority Score” on the left side of the report, ranking the site on a scale of 0 to 100.This score evaluates the following factors: Link Power: The quantity and quality of backlinks Organic Traffic: How much organic traffic the website gets Natural Profile: If the site’s backlink profile has hallmarks of spam or organic backlinksConduct an SEO AuditAn SEO audit is used to review your website for any SEO issues, including ones impacting your backlink profile and content indexing—ones that can stem from spam content.Use Semrush tools to check things out: Site Audit for checking technical or crawl errors Backlink Audit for identifying toxic backlinks Backlink Analysis for spotting significant changes in your or your competitors’ backlink profiles On Page SEO Checker for performing your website’s on-page SEO auditIf you perform these audits and nothing serious pops up, yet you continue to experience downward ranking spikes, you might be dealing with content spam. Check for sudden drops in search rankings Compare your site’s rankings drop with competitors Check to see if the drops align with Google updates Perform a site audit to find technical or crawl errors and an on-page SEO audit Use a backlink audit to identify toxic backlinks or changes in backlink profilesCheck for PlagiarismRunning plagiarism checks is a clear way to identify if you've accidentally copied someone else's content. Or if someone else has copied yours.Semrush’s SEO Writing Assistant scans the web to find instances of duplicate content. So that you can check for plagiarism.Go to the tool. And click \"Import text from web\" or paste your article into the space provided.Then, click on \"Originality\" in the graph that appears. And hit \"Check\" under \"Originality\" in the right sidebar.The tool will highlight text in your article that appears on other websites. It will also give you a list of those instances and and tell you the text's original source.Hover over the eye icons under \"Original source.\" To see which domains contain copies of the text you imported.If your domain appears, exclude it by clicking on the eye icon.Now you have a list of pages that copied your text. Click on the links under \"Original source\" to open the page with duplicate content. And see if you need to take action.Pro tipRun your articles through SEO Writing Assistant before publishing. To get specific suggestions on how to improve your content's readability, SEO, and tone of voice.How to Report Content SpamIf you encounter content spam, report it to Google.If they find the content violates their guidelines, they’ll take action to address it. Like decreasing the site’s ranking or removing the content from SERPs.NoteGoogle doesn't provide specific timelines for how long it takes to resolve instances of spam, as it depends on the complexity of the spam and how many reports Google is handling at the time. General Content SpamFill out Google’s dedicated content spam form:Enter one or more URLs. Select what’s wrong with the page, then click “Continue.”From here, select the bubbles that best represent the kind of spam you’ve encountered. And, if you’d like, add more information for why you’re reporting the site in the optional “Additional details” section. Then, hit “Submit.”Content Scraping Spam and PlagiarismFill out Google’s “Report Content on Google” form.Select the Google product where you saw the spam content.NoteDepending on which product you pick, you might need to answer another question about the source, as shown below: Next, answer whether the spam relates to AI content.Then, either click “Policy (non-legal) reasons to report content” or “Legal reasons to report content.”Depending on which button you choose, you’ll be directed to different Google instructions on how to finish filing your report.In addition to submitting with Google, you can also: Contact the publisher to remove the potentially plagiarized content Consult a legal professional or file a Digital Millennium Copyright Act (DMCA) notice. This notice allows you to ask the website’s web hosting company or a search engine to remove the plagiarized content.Cybersecurity-Related Content SpamFill out Google’s “Report a Phishing Page” form. Include the URL and describe why you believe it's a phishing attempt. The Future of Content SpamWhile generative AI helps streamline content writing, it can also make it easier to produce content spam. Which can lead to a rise in spammy content popping up on SERPs.And we can expect more cybercriminals to take advantage of these capabilities as well. The goal?To create deceptive content that tricks users into submitting personal information.Fortunately, there are steps you can take to steer clear of content spam. Stick to publishing relevant, high-quality content. Report spam when you see it (and encourage others to do the same).And use Semrush to conduct regular site audits, backlink analysis, and plagiarism checks to detect spam.",
  "headers": [
    {
      "level": "H1",
      "text": "Content Spam 101: What It Is + What to Do About"
    },
    {
      "level": "H2",
      "text": "What Is Content Spam?"
    },
    {
      "level": "H3",
      "text": "Types of Content Spam"
    },
    {
      "level": "H2",
      "text": "How Can Content Spam Impact Your Site?"
    },
    {
      "level": "H2",
      "text": "How to Avoid Content Spam in Your Web Pages and Getting Flagged"
    },
    {
      "level": "H3",
      "text": "Use the E-E-A-T Framework to Guide Your Writing"
    },
    {
      "level": "H3",
      "text": "Use Keywords Appropriately"
    },
    {
      "level": "H3",
      "text": "Implement Organic Link Building"
    },
    {
      "level": "H2",
      "text": "How to Identify Third-Party Content Spam"
    },
    {
      "level": "H3",
      "text": "Conduct an SEO Audit"
    },
    {
      "level": "H3",
      "text": "Check for Plagiarism"
    },
    {
      "level": "H2",
      "text": "How to Report Content Spam"
    },
    {
      "level": "H3",
      "text": "General Content Spam"
    },
    {
      "level": "H3",
      "text": "Content Scraping Spam and Plagiarism"
    },
    {
      "level": "H3",
      "text": "Cybersecurity-Related Content Spam"
    },
    {
      "level": "H2",
      "text": "The Future of Content Spam"
    }
  ],
  "author": ""
}