{
  "url": "https://www.semrush.com/blog/content-audit-for-content-marketing-strategy/?utm_source=ContentOptimizationBlog&utm_medium=Blog&utm_campaign=stateofCM22",
  "slug": "content-audit-for-content-marketing-strategy",
  "title": "How to Do a Website Content Audit in 2024 (+ Template)",
  "description": "Learn how to perform a successful audit of your website content in five simple steps.",
  "content": "High-performing content is key for meeting your overall business goals. But how can you ensure the content you’ve created is actually driving results? Try revisiting your existing content to see how effective it is—which is where a content audit comes in.What Is a Content Audit and Why Do One?A content audit is the process of analyzing the existing content on your website to measure how well it’s performing and supporting your business goals.If you have content pieces that are helping you achieve your desired results, you’ll want to create more pieces like them. But if you have many that are performing below your expectations, you may need to update, consolidate, or delete them.We recently audited our own blog and made improvements to many of the articles.The result?Our blog’s organic traffic has reached an all-time high and continues to grow, as you can see from this graph in our Domain Overview tool.By meticulously evaluating our content, we were able to pinpoint exactly what needed to be done to improve performance.A content audit can also help you: Reveal topics that you haven’t covered yet, providing opportunities for new content creation Ensure that all the content aligns with your brand voice and style guidelines Find opportunities to improve engagement Come up with ideas to increase conversionsSo, if you’re looking to achieve greater success, a thorough content audit might be what you need.In this guide, we’ll walk you through a proven content audit process. Let’s get started.How to Do a Content Audit (Step by Step)Below, we’ll show you exactly how to perform a content audit for your website.1. Define Your GoalFirst things first—you need to define your goal.Having a clear goal from the start is crucial because it’ll determine how you measure content performance and evaluate whether your efforts were successful after implementing any changes.Here are some general goals people have when they decide to do a content audit: Improve SEO results: Check how your existing content is performing in organic search (unpaid search engine results) and identify opportunities to increase rankings and organic traffic Increase engagement: Understand the current level of user engagement with your content and find ways to enhance it Improve conversion rates: Evaluate how well your content guides users toward conversion goals like lead generation, purchases, or other desired actions—and optimize it accordinglyIt’s also wise to make your goal specific. So there’s no question about whether you achieved it later on. Your specific goal could be something like achieving an average ranking position of 3 across all content pieces and increasing overall organic traffic to more than 200,000 visits per month.Once you're clear about your goal, you can tailor your content audit process accordingly. And determine which metrics you’ll want to focus on when you benchmark your current performance. You’ll see how to do this later in the guide. For now, just make a copy of our SEO content audit template so you can follow along.2. Compile a List of Relevant Content PagesNext, collect a list of all the important content pages on your site. Which might include blog posts, white papers, landing pages, etc.Why is this important?Because you don't want to accidentally overlook any pages during the auditing process.If key pages are left out, you won't get a complete picture of how your content is performing. This can lead to missed opportunities for optimization and improvement.If you have a small website, it’s easy to manually collect all the links.But if your website is large, you need a tool like Site Audit. To save time and find your pages automatically.To get started, open the tool, enter your website URL, and click “Start Audit.”The configuration window will open up. From here, you need to adjust a few basic settings.First, specify subsections of your website where all your content pieces live. So the tool can focus on those areas only.You can do this by going to the “Allow/disallow URLs” tab and adding the relevant subfolders in the first box.For example, you might include /blog/, /resources/, and any other subfolders containing your content.Next, set a threshold for how many content pages you want the tool to find—which is basically all of them. So, go back to the “Domain and limit of pages” option. If you have roughly 900 content pieces, adjust the threshold to the next highest number available in the drop-down list (i.e., 1,000).This will ensure all the relevant content pages get captured by the tool.Once you’re done, click “Start Site Audit.”The tool will take up to a few minutes to collect data.Once it’s done, go to the “Crawled Pages” report and you’ll get a list of pages found by the tool.Export the list as a CSV file (there’s an export button in the top right corner).Then, copy and paste the URLs into your copy of the content audit template.IMPORTANT: Exclude pages that have been recently published if your goal is focused on SEO. Because new pages probably haven’t had the opportunity to establish themselves in search results, auditing them now could lead to misguided conclusions and unnecessary changes.3. Measure the Current PerformanceOnce you have a list of your pages, it's time to evaluate how each page is currently performing. As well as the overall performance of the content sections.This will help you see where you currently stand, so you can work toward your goal.If your goal is to improve SEO performance, you should focus on the following information.Organic TrafficOrganic traffic is how much unpaid traffic your pages have received from search engines like Google.It’s one of the most important metrics for measuring SEO success.Because a high amount of organic traffic often translates to more conversions. Like form submissions and purchases.You can use Google Analytics to find out how much organic traffic your content pages are getting.To do so, log in to Google Analytics and choose the site you’re auditing.Go to “Reports” > “Acquisition” > “Traffic acquisition.”From here, set the date range to the last full month. And filter for a particular page by adding a “Page path and screen class” filter and pasting in the URL slug.Scroll down to see how much traffic came from organic search.Do this for each and every page on your list.Then, go back to the content audit spreadsheet. And log the traffic numbers for each URL in the \"Organic Traffic\" column. Now, if you add all the traffic numbers together (using the SUM function), you'll get the total organic traffic for all your content sections combined.Note that number in the “Total Organic Traffic” column in the audit spreadsheet.Keyword RankingsThe next thing you need to check is where your content pages are currently ranking for their primary (main) target keyword.Are they ranking in the top three results? Top 10? Or further down on the search engine results pages (SERPs)?Finding this information is important because it allows you to assess your pages’ current performance to identify which ones need optimization.Use Semrush’s Position Tracking tool to get ranking data.Open the tool, enter your domain name, and click “Set up tracking.”You’ll see a setup window. In the “Targeting” section, adjust your tracking preferences by choosing a search engine, device, location, and language.Then, click “Continue To Keywords.”Here, input the primary keywords associated with your pages. (If you’re not sure what these are, check out our primary keywords guide to identify the most relevant terms for your pages.)Then, click “Add keywords to campaign” and “Start Tracking.”Now, the tool will check where pages rank for these keywords and report those positions.Specify these ranking positions in the \"Current Ranking\" column of the content audit spreadsheet.After that, calculate the average (with the AVERAGE function) to get an overall sense of where your content pieces usually rank.Note that number in the “Average Ranking” column in the audit template.BacklinksBacklinks are links that point from other websites to your own. They’re incredibly important from a ranking standpoint.So, you need to get backlink data for each of your content pages. And find the total number of backlinks your main content sections have.Having this data allows you to pinpoint content pieces that may be underperforming due to a lack of quality backlinks.To get the backlink data, you can use Semrush’s Backlink Analytics tool.Open the tool, enter one of your content sections, and click “Analyze.”Navigate to the “Indexed pages” report.Here, you’ll see a list of your content pieces along with how many backlinks each one has. Once you have numbers, add the data in the “Backlinks” column in your content audit spreadsheet.Repeat the process for all the other content sections you’re auditing.After you’re done, add all the numbers together—once again, the SUM function will come in handy. And you’ll get the total backlinks your content sections have.Record that number in the “Total Backlinks” column in the content audit spreadsheet.On-Page SEOYour content’s SEO performance also depends on its on-page optimization. This refers to the various elements within the page itself that influence how well it can rank in search engines. Some key on-page factors are: Title tag: The page title that shows up on browser tabs and can appear in search results Meta description: The brief page description that can appear under the title in search results Header tags (H1, H2, etc.): The hierarchical headings that structure the content Content quality: The depth and overall value of the page's main content Keyword optimization: How well the target keywords are naturally incorporated into areas like the title, headers, body copy, etc. URL slug: The last portion of the URL that identifies the page When auditing your content, you should confirm whether it’s optimized for on-page SEO.To do so, use Semrush’s On Page SEO Checker tool.Open the tool, enter your domain name, and click “Get ideas.”The setup window will open. From here, set your target location and click “Continue.”Go back to the original CSV file you downloaded from Site Audit and upload it into a blank spreadsheet.Edit it to contain just two columns: keywords (these should be the first column, and you’ll need to add them) and URLs (these should be the second column). And delete the remaining columns.Then, export the edited file as a CSV and add it to the On Page SEO setup wizard using the “File” option.And click “Collect ideas.”Now, the tool will analyze each page to figure out if the various on-page elements are optimized for better search engine visibility.If not, it will suggest ideas for each page.In our content audit template, you'll see a column for \"On-Page SEO\" where you can select \"Yes\" if pages are properly optimized and \"No\" if they lack some optimizations.Technical SEOLastly, you need to check the technical SEO health of your content pages. As well as your entire website.Why?Because technical SEO can influence whether search engines can find, store, and display your content in search results.So, you should check that there are no technical issues holding your content back. These could be: Duplicate content: Having substantive blocks of identical (or nearly identical) content across multiple pages on your site. Which can hurt rankings. Broken internal links: Including links to your own pages that are returning 404 errors, which means they couldn’t be found. That impacts crawlability (search engines’ ability to explore your website). Slow site speed: Having content that takes too long to load. Which frustrates users and can hinder rankings. Lack of mobile-friendliness: Publishing content that doesn't display properly on mobile devices. Which hurts your performance. Lack of security: Not having a properly configured secure sockets layer (SSL) certificate for hypertext transfer protocol secure (HTTPS). It’s the more secure version of HTTP and is a confirmed ranking factor. Rogue noindex tags: Unintentionally using noindex meta tags blocks important pages from being indexed and appearing in search resultsYou can find whether your site is affected by any of these issues (and others that are harmful) using Semrush’s Site Audit tool.Create a new project in the tool and set up an audit of your entire website. After the audit is done, first go to the “Issues” tab. These are the issues your website pages have (including some of your content pages).If you click on the issue link, you’ll see a list of affected pages.And if you click on the “Why and how to fix link,” you’ll find more details about the issue and how you can fix it.Even though your audit is focused on content pages only, you need to make sure all the other pages are free from technical issues. And solve for sitewide problems if there are any.Now, let's fill out the content audit spreadsheet. For each page on your list, check the “Crawled Pages” report to confirm whether there were issues identified and how many.And make a note of the number in the \"Technical SEO\" column.Make note of any technical issues with the rest of your site as well.Address those first. Then move on to the next step.4. Implement an Action PlanAfter your audit spreadsheet is filled out, review each page manually and decide on the best course of action.If your objective is to improve SEO performance, you have the following four options to choose from:Keep As-IsIf a page is already meeting or exceeding the performance goals you set initially, then leaving it as is may be the right move.For example, let's say your goal was to achieve an average ranking position of three for all your content pages. If the page in question is currently ranking two, it’s met that goal. And it’s also safe to say that the page is already bringing in lots of organic traffic and contributing well to the traffic goal you have.So, keeping that page unchanged could be an appropriate decision.But you should also make sure the content is still accurate and relevant.If it is, then that page may not need any changes.UpdateYou should update the page when: It’s not currently meeting the performance goals you established for the audit It’s meeting the goal but contains outdated or irrelevant informationIf you have an SEO-focused goal, specifically look at the page’s current ranking. Because if you improve its ranking, organic traffic will very likely increase. Which will help in achieving your traffic goal.When updating the page, try to improve its quality.How?Start by evaluating whether the page’s content satisfies search intent (the general purpose behind a searcher’s query). Does it cover everything a user wants to know about the topic? If not, rewrite the content with search intent in mind. And make sure the writing is clear and engaging. And is formatted using subheadings, short sentences, and short paragraphs to improve readability.You’ll also need to make sure you’re following on-page SEO best practices. And that there are no technical SEO issues impeding your content’s performance.So, refer to the content audit template to see if there are issues with either category that need to be addressed.And see whether you have enough backlinks to outrank your competition. Check the number of backlinks your page has in the content audit template. If you’re not ranking as high as you want, it might be because the pages above you have more backlinks.You can see if that’s the case in our Keyword Overview tool. Type the primary keyword your page is targeting, select the location, and click “Search.”Go to the “SERP Analysis” section. And you’ll see how many backlinks the top-ranking pages have.For the best chance of ranking, you’ll need a similar or higher number.NoteThis is just a brief overview, and a lot goes into achieving top rankings in Google. To learn more, check out our guide about how to rank higher on Google.Consolidate & RedirectThis option makes sense when you have duplicate pages on your site (which you can identify in Site Audit).Instead of having overlapping content across multiple pages, consolidate the best elements into one definitive piece. And redirect the other piece(s) to the main one.This approach has two key benefits: It prevents you from competing with yourself for the same keyword in search results It funnels all the link equity (ranking strength) to a single canonical (main) URL to boost its ability to rankLet's say you have three separate blog posts that all cover how to use Instagram for business, and you’re not sure how to proceed. Here’s what to do in that case: Identify which one is already ranking highest to use as the starting base Then, cherry-pick the great examples, tips, etc. from the other two posts and add them to the main one Finally, redirect from the other two posts to the newly modified version or implement canonical tags. This can improve its position in search results.DeleteSometimes, the right move might be to delete the page. If your goal is centered on SEO, that’s often the case when: It gets no organic traffic It has no backlinks It targets a keyword (or covers a topic) that’s not important for your businessBefore deleting, always check Google Analytics to ensure the page isn’t getting a significant amount of traffic from other sources or driving a high portion of conversions. Deleting a page like this could negatively impact your business.As you analyze each page, assign the appropriate action next to each URL in the content audit spreadsheet. And start taking action.5. Measure Your ResultsAfter you’ve implemented the action plan, the next step is to check whether you’ve achieved your set goal.But how long should you wait before measuring results?There's no definitive time frame. But if your goal is to improve SEO results, we recommend waiting for at least three to four months before analyzing the performance.This allows enough time for search engines to process the updates. And any positive ranking impacts to fully materialize in organic traffic.Once you decide to begin, revisit the audit template. Open the dedicated “Post-Audit Analysis” tab and start reassessing the performance using the same data sources from the initial audit.Compare the new numbers against your baseline.If you hit your targets, that's great! If not, you’ll at least see whether you’re making progress toward your goal. In that case, wait for a few more months and analyze the results once again.Content Audit TemplateIf you haven’t already, make a copy of our SEO content audit template.Simply click the \"Use Template\" button in the top right corner. This will make an editable copy in your Google Drive.This template includes columns to record all the key information we've discussed. Feel free to edit them based on your goal. Or add more columns if you need to.FAQsTo wrap things up, we’ll cover some frequently asked questions about website content audits.How Often Should You Do a Content Audit?Conduct content audits on a regular basis to ensure your content remains relevant and effective.The frequency can vary based on the size of your website. And how often you publish new content. For smaller websites with infrequent new posts, an annual content audit might be enough.Larger websites that constantly add new content will need to audit more frequently—possibly every six months or even quarterly.Our State of Content Marketing report indicates that one-third of marketers conduct content audits at least twice a year. But many choose to update their content as needed when it becomes outdated. Without following a fixed audit schedule.How Can You Get a Buy-in from Stakeholders for a Content Audit Project?To get approval for an audit, start by clearly explaining the benefits. Such as improving metrics like traffic, engagement, and conversions.And work directly with your stakeholders to define a clear goal for the audit.Then, outline the specific process you'll follow, the criteria for evaluating content, who will be involved, and the estimated costs versus potential returns. With this strategic approach, you can increase your chances of securing buy-in from stakeholders. Which Tools Should You Use When Doing a Content Audit?When conducting a web content audit, you’ll need a variety of tools to collect different types of data. For an SEO-focused content audit, essential tools include: Google Analytics: To get insights into your content’s organic traffic Excel or Google Sheets: To organize and analyze data effectively Site Audit: To get a list of your relevant content pages and identify issues and opportunities Position Tracking, On-Page SEO Checker, and Backlink Analytics: To get insights into other valuable SEO information SERP Gap Analyzer: To help you choose between improving your existing content or creating new content.",
  "headers": [
    {
      "level": "H1",
      "text": "The Ultimate Guide on How to Do a Content Audit (+ Template)"
    },
    {
      "level": "H2",
      "text": "What Is a Content Audit and Why Do One?"
    },
    {
      "level": "H2",
      "text": "How to Do a Content Audit (Step by Step)"
    },
    {
      "level": "H3",
      "text": "1. Define Your Goal"
    },
    {
      "level": "H3",
      "text": "2. Compile a List of Relevant Content Pages"
    },
    {
      "level": "H3",
      "text": "3. Measure the Current Performance"
    },
    {
      "level": "H4",
      "text": "Organic Traffic"
    },
    {
      "level": "H4",
      "text": "Keyword Rankings"
    },
    {
      "level": "H4",
      "text": "Backlinks"
    },
    {
      "level": "H4",
      "text": "On-Page SEO"
    },
    {
      "level": "H4",
      "text": "Technical SEO"
    },
    {
      "level": "H3",
      "text": "4. Implement an Action Plan"
    },
    {
      "level": "H4",
      "text": "Keep As-Is"
    },
    {
      "level": "H4",
      "text": "Update"
    },
    {
      "level": "H4",
      "text": "Consolidate & Redirect"
    },
    {
      "level": "H4",
      "text": "Delete"
    },
    {
      "level": "H3",
      "text": "5. Measure Your Results"
    },
    {
      "level": "H2",
      "text": "Content Audit Template"
    },
    {
      "level": "H2",
      "text": "FAQs"
    },
    {
      "level": "H3",
      "text": "How Often Should You Do a Content Audit?"
    },
    {
      "level": "H3",
      "text": "How Can You Get a Buy-in from Stakeholders for a Content Audit Project?"
    },
    {
      "level": "H3",
      "text": "Which Tools Should You Use When Doing a Content Audit?"
    }
  ],
  "author": ""
}