{
  "url": "https://www.semrush.com/blog/digital-pr-goals/",
  "slug": "digital-pr-goals",
  "title": "How to Set, Track, and Reach Digital PR Goals",
  "description": "Digital PR helps gain brand recognition and reach SEO and general marketing goals. Use this guide to learn how to set, track, and reach digital PR goals.",
  "content": "Digital PR tends to be complicated because of its ambiguity as a concept. Is it just another SEO buzzword? A fancy way of saying link building? Traditional PR but online? In some ways, these are all true. What Is Digital PR?Digital PR is a bit of a buzzword because PR is something brands have always done. Tactics to sway public opinion have been around since ancient Greece, but today these PR tactics are carried out largely online. With the abundance of media online, it’s natural that traditional PR tactics have entered the digital sphere. Now, instead of leveraging television, newspapers and radio, brands seek to leverage online news and popular blogs to increase brand awareness. For SEOs, digital PR is especially interesting because of the link building implications. When a site mentions your brand by name, they’re likely to link back to your site, oftentimes bolstering your authority score and improving your overall organic presence. But, digital PR, while it might result in link building, does more than traditional link building because the benefits go beyond simply gaining a backlink to impress Google. Let’s explore.Why Is Digital PR so Important?Link builders have historically tried to get as many links as possible to convince Google that their site is authoritative. Google, in an effort to dissuade spammy link building techniques, has moved towards a more brand-centric approach that focuses heavily on the quality and relevancy of each link. Digital PR opens up link building possibilities as it focuses on creating content that brands want to link to because it elevates the existing content on their site. Digital PR has massive implications that go beyond SEO metrics. Sure, digital PR can land you quality links and boost your position in SERPs, but there’s a more human element on the line in digital PR. Backlinks, traditionally, have been referred to as “votes” for a site. Google takes these “votes” into consideration when ranking sites. If a backlink is a vote, then a brand mention from an authoritative site is a public endorsement from a powerful figure. Not only are they voting for you, they’re endorsing your brand—in a very public way.Digital PR Priorities With this mind, Digital PR prioritizes a few different things, all which need to be taken into consideration when crafting a digital PR campaign. Some of these elements include: Unique and valuable content Brand mentions Backlinks Yes—backlinks are still a pivotal aspect of a well-rounded digital PR campaign. The major distinction is the quality and relevance of the link rather than link volume. Why Do You Need Digital PR Goals? If you’re launching a digital PR campaign, there’s likely a specific business need you’re looking to improve. Improving leads and conversions is, of course, the metric you want to drive, but what’s your bigger mission? Are you an up and coming brand trying to establish yourself as an authority in your space? Or are you an established brand trying to find new audiences and get a leg up on competitors? Digital PR isn’t as simple as putting great content into the world and then waiting for the results to come. You need to know who you’re speaking to and where they spend their time. If you create targeted goals from the start, you’ll be able to demonstrate value by the end. SMART Goals for Digital PR The best way to set targeted digital PR goals is by using SMART goals. You’ve probably heard of SMART goals before. But, as a refresher, here’s what the acronym stands for: Specific Measurable Actionable Relevant Time bound SMART goals are especially important because digital PR encompasses numerous marketing metrics and the results aren’t always clear cut. Therefore, it’s important to lay out goals in this framework early.SMART Goals in Action Let’s say improving SEO is at the heart of your digital PR campaign. Great, but what specifically do you want to improve? More links? Better rankings? All the above? Digital PR can accomplish all of this; however, it’s easier to get full support from your team if you incorporate the SMART elements. Here’s a good example that involves improving authority score, a metric used to grade the overall quality of a domain.“Through this digital PR campaign, we plan on raising our authority score from 75 to 80 by the end of Q4.” This goal works because it’s… Specific: The goal includes a clear and specific metric you can reference at the end of the campaign. If all goes according to plan, your campaign will boost your overall authority score. Measurable: Your authority score is a trackable metric. You can measure your progress throughout the campaign. Attainable: You’re not claiming to raise your score by 20 points. A five point jump is an attainable, but noteworthy, improvement. Relevant: If you’re working with a SEO team, you need to reference a metric that matters to them. Reporting on social media metrics, for instance, won’t matter as much to a SEO team as will authority score. Time-bound: There’s a clear timeline for the campaign. You’re claiming to accomplish this by the end of Q4.How to Track Digital PR Success Even if your SMART goals are specific to organic growth, there are a number of other metrics you can track to prove the broader worth of your campaign. A few of these include:Leads and Conversions The end goal of every marketing campaign is an increase in customers. Since digital PR leads to increased traffic to your site, you should see more users engaging with your products or services. If your site is well-optimized, you should expect an uptick in conversions resulting from the increase in leads and traffic. Comparing leads and conversions before and after your campaign can help you attach ROI to digital PR. That’s the simple way of tracking PR impact on leads and conversions, but because so many other efforts are occurring concurrently, it’s too simple for many of us. If you’d like to dig deeper, stick with us. Otherwise, skip to the next section. Calculating monthly link value is an effective way to attach ROI to digital PR. Monthly link value is found by taking the traffic value of your strongest competitor, also known as the winning domain, and dividing it by the site’s total number of linking root domains. The result is the monthly link value for the domain that’s bringing in the most traffic. This number provides a strong estimate of how valuable backlinks are in your vertical. FORMULA: Monthly Traffic Value of Winning Domain / Total Number of Linking Root Domains = Monthly Value per Link of Winning DomainSay you’re a pet food supply company looking to launch a digital PR campaign. In this vertical, Chewy is the winning domain. By using the calculation above, you can calculate Chewy’s monthly link value. Winning domains with high link values indicate that backlinks are more valuable in that vertical. For instance, if Chewy had a monthly link value of $800 (they don’t), then investing in digital PR makes a lot of sense and you can expect short term ROI.Chewy has an estimated 5.2M backlinks.Chewy’s estimated organic traffic value is $11.5M/month.So, a link gained might be estimated to be worth $2.21/month. They don’t need to invest in link building, but you might still want to. Why?For sites without the extensive brand awareness of Chewy, even if there is low link value, digital PR still makes sense, but mainly for the reason that it can help you boost organic visibility. By dominating share of search, improving authority score, and generating passive links, conversions will come, but it may take a little more time.High Authority Links While digital PR is not traditional link building, it should result in high authority passive links that compound over time. A large part of digital PR involves creating shareable assets, like data studies and interactives. As a result, high DA sites will want to link to them because it makes their own content more valuable.Brand Mentions While brand mentions may not directly result in improved rankings, they do a great deal for brand awareness. Brand mentions from authoritative sites are powerful endorsements and are crucial for brand building. When a trustworthy 3rd-party site mentions your brand, they’re in effect recommending you to potential new customers. Here’s a quote from Google’s Jon Mueller that nicely summarizes the power of brand mentions. Organic Traffic Better links lead to higher rankings and, therefore, more traffic. The organic benefits of digital PR can’t be ignored, and traffic is a big one. If your campaign goes according to plan, you should expect more users to find your site through non-branded queries.Social Media SharesSocial media shares are another good indicator of whether or not a piece of content is performing well in digital PR. The “success” number, often known as social proof, is typically dependent on your industry, but should always adhere to the SMART formula. An example may be: “We expect this asset to get at least 30 shares on Linkedin in the first 24 hours” or“We expect this asset to get at least 50 retweets on Twitter in the first 48 hours.” Social media is another medium that won’t directly affect your SEO metrics, but will widen your reach to attract more users in your target audience.Share of SearchYou get one spot in a SERP for a non-branded keyword, but you can get limitless mentions on other pages that rank for other relevant non-brand queries. Share of search measures your overall brand visibility in SERPS, on your site, and on other sites. If your brand appears in 5 out of the top 20 results, that's 25% coverage. If you make it to 10, then you own 50% of the share of search. How to Reach Digital PR Goals Digital PR goals are reached by combining quality content with targeted outreach. The process should always start with identifying who your audience is and where they spend their time online. Without this information, you won’t know what content to create, the best content framework to use, and what publications to pitch. Creating Valuable ContentOnce you figure out who your audience is and what their online presence looks like, you can begin the process of crafting content that will provide maximum value. This typically requires more creativity, as high authority publications are more likely to mention and link to wholly unique content, like data studies, interactives, and content pertaining to current events.Providing unique data that helps tell a compelling story is a great way to get a journalist’s attention. Data adds a layer of trust to content and can oftentimes elevate your content over competitors. If you’re able, gathering unique user data from surveys is sometimes the most effective way to enhance your content. Interactivity can accomplish more than pure copy can. Interactive maps and crawlable charts can make complex topics easier to digest, which can often separate your content from SERP competitors. Performing Targeted Outreach Once you’ve created your content, the next step is determining how to get it to relevant journalists and publications. A common myth in digital PR is that the best way to do outreach is by sending hundreds of cold emails to prospects. Doing high-volume outreach isn’t wrong in itself, but the prospects you pitch need to fully align with your initial audience research. You’ll want to keep your pitch list narrowed to only journalists and publications that are a good fit for your specific content and audience.Tools for Successful Digital PR Campaigns Digital PR campaigns require a preliminary deep dive into topic research and the competitive landscape as well as a knowledge of how to best pitch your product. There are a number of different tools to help get you started. Surround Sound from SemrushOne of the first steps in your workflow will be finding the most valuable opportunities for mentions. That’s where Surround Sound shines.Surround Sound allows you to audit SERPs to see your brand’s visibility compared to competitors. With this information, you can easily identify blindspots in search—enabling you to create targeted strategies to grow your organic presence over time.To use the tool, simply enter your desired keywords and the dashboard will show every site containing your brand content. From there, you can identify where your brand should and shouldn’t be and create a targeted growth plan. To use the tool, simply enter your desired keywords and the dashboard will show every site containing your brand content. From there, you can identify where your brand should and shouldn’t be and create a targeted growth plan. Prowly from SemrushNow that you have your target sites and pages, it’s time to start building the relationships and making the requests for those sites to mention you. Prowly gives marketers a centralized place for all PR activities: contacts, emails, analytics, and more.With this tool you can find relevant journalists, stay in the know about your media contacts, create creative press releases, distribute your pitches, build a targeted media approach, and have insights into overall PR performance.PitchboxPitchbox is an effective outreach tool that makes it simple to find and pitch the right prospects. Pitchbox helps you craft personalized outreach emails that can help you dramatically improve your response rate. Google TrendsWhen it comes to finding topically relevant content to craft your content around, Google Trends should be the first place to go. Google trends gives you real time data into popular and trending topics, which can be pivotal when pitching new content ideas.Hunter When pitching prospects, you’ll need to be able to scan a website for the right email addresses. Hunter lets you do exactly that. The Hunter chrome extension scans websites for every email address. If it can’t find one, it will recommend a natural email pattern that you can test as well. Help a Reporter Out (HARO)An easy way to elevate a piece of content is by incorporating an expert quote. HARO is an easy tool for connecting with subject matter experts and gaining quotes. HARO allows you to put in a request for an expert quote on a specific topic. As a result, you can elevate your content and the source can get a mention in a piece online. It’s a win win. Digital PR Goals are Marketing Goals While SEO exists in a digital space, it serves a profoundly human purpose. Content online is meant to be consumed by human readers, and search engines are working to ensure that valuable content ranks atop the rest. Digital PR represents a shift in link building efforts and content creation. Content that performs well in digital PR will passively link over time, thus helping your brand gain long-term visibility. When done well, digital PR will move the needle on larger marketing efforts and skyrocket your growth. And it all starts with setting the right goals.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Set, Track, and Reach Digital PR Goals"
    },
    {
      "level": "H2",
      "text": "What Is Digital PR?"
    },
    {
      "level": "H2",
      "text": "Why Is Digital PR so Important?"
    },
    {
      "level": "H3",
      "text": "Digital PR Priorities"
    },
    {
      "level": "H2",
      "text": "Why Do You Need Digital PR Goals?"
    },
    {
      "level": "H2",
      "text": "SMART Goals for Digital PR"
    },
    {
      "level": "H3",
      "text": "SMART Goals in Action"
    },
    {
      "level": "H2",
      "text": "How to Track Digital PR Success"
    },
    {
      "level": "H3",
      "text": "Leads and Conversions"
    },
    {
      "level": "H3",
      "text": "High Authority Links"
    },
    {
      "level": "H3",
      "text": "Brand Mentions"
    },
    {
      "level": "H3",
      "text": "Organic Traffic"
    },
    {
      "level": "H3",
      "text": "Social Media Shares"
    },
    {
      "level": "H3",
      "text": "Share of Search"
    },
    {
      "level": "H2",
      "text": "How to Reach Digital PR Goals"
    },
    {
      "level": "H3",
      "text": "Creating Valuable Content"
    },
    {
      "level": "H3",
      "text": "Performing Targeted Outreach"
    },
    {
      "level": "H2",
      "text": "Tools for Successful Digital PR Campaigns"
    },
    {
      "level": "H3",
      "text": "Surround Sound from Semrush"
    },
    {
      "level": "H3",
      "text": "Prowly from Semrush"
    },
    {
      "level": "H3",
      "text": "Pitchbox"
    },
    {
      "level": "H3",
      "text": "Google Trends"
    },
    {
      "level": "H3",
      "text": "Hunter"
    },
    {
      "level": "H3",
      "text": "Help a Reporter Out (HARO)"
    },
    {
      "level": "H2",
      "text": "Digital PR Goals are Marketing Goals"
    }
  ],
  "author": ""
}