{
  "url": "https://www.semrush.com/blog/display-ads/",
  "slug": "display-ads",
  "title": "Display Ads: What They Are, Types, & How They Work",
  "description": "Display advertising is online ads with visuals that appear on websites and apps. Learn how it works.",
  "content": "What Is Display Advertising?Display advertising is a type of advertising that helps you visually showcase your brand or product on various online platforms.It encourages users to take specific actions. Such as clicking to visit a landing page, filling out a form, or making a purchase.Here’s a display ad example from Forbes’ homepage:Display advertising allows you to use a mix of text, images, and videos to get your message across.It’s also highly scalable. You can reach a broad audience. Or focus on a niche market by customizing your display ads to show up for specific groups of people based on what they like, where they browse, and who they are.Display Ads vs. Search AdsDisplay ads appear online when users are already browsing. They show up based on topics and users’ interests. On the other hand, search ads target users looking for products, services, or information similar to what you offer. They appear based on users’ search queries. Here’s an example of search ads:This fundamental difference allows display ads to nurture long-term brand recognition. While search ads help achieve immediate conversions.Here’s an overview that explains what display ads are and how they differ from search ads:Benefits of Display AdvertisingEnhanced Brand VisibilityDisplay advertising puts your brand in front of a large audience. By strategically placing your ads on websites that align with your target market.This can help you increase brand awareness.Targeted ReachDisplay ads let you target specific demographics, locations, and behaviors.This means you can focus your advertising spending on audiences most likely to convert. You’re not just throwing your ad into the digital abyss but placing it where it counts.Engaging CreativesDisplay ads offer a range of creative formats—from simple text and images to interactive elements and videos.These diverse options allow you to capture your audience’s attention in a way that resonates with them.Whether it’s a short video clip or an interactive quiz, these formats can make your brand memorable.Cost EffectiveDisplay ads often have a lower cost per impression. You can set your budget and even opt for different pricing models based on your needs. This level of flexibility and the added benefit of efficient targeting makes display ads relatively affordable.Real-Time AnalyticsYou get access to real-time analytics with display advertising.You can track metrics like click-through rates, impressions, and conversions to make data-driven decisions. This helps you to optimize your campaigns for better performance over time.Note: While display advertising offers numerous advantages, it’s essential to consider potential challenges. These could include ad fatigue, in which your audience becomes desensitized to your ads if they see them too often, or the risk of your ads appearing on irrelevant or low-quality websites. You can avoid these issues with proper targeting and regular monitoring.Types and Formats of Display AdsThere are many types of display ads—from broad categories like contextual and mobile ads to specific ones like pop-up and infographic ads. Each type can be of a specific format. Let’s first look at common ad formats: Static ads: Simple, non-moving ads that can consist of text and images. Usually saved as JPEG or PNG files, these ads are quick to load and easy to create. Animated ads: Use motion to capture attention. Created as GIFs or HTML5 files, they can display multiple frames, which allows for more complex messaging or storytelling. Video ads: Use moving visuals and sound to engage the audience. They can be added to websites and social media feeds or appear as pop-ups. Interactive ads: Engage users through clickable elements, forms, or other interactive features. Often built using HTML5, these ads encourage user participation.Now, let’s look at some of the common display ad types:Banner AdsBanner ads are graphics that can appear at the top, bottom, or sides of webpages. They leverage a combination of texts and visuals (either static or animated).Here’s a banner ad example from Investopedia:The strategic placement on webpages ensures a large audience sees your banner ads. Which is why they’re suitable for driving traffic to specific pages or building brand identity.When clicked, the ad’s call to action (CTA) can lead users to your chosen landing page to learn more or to make a purchase—depending on your campaign’s goal.Interstitial AdsInterstitial display ads are full-screen ads that cover the interface of a website or app. They usually appear during natural transition points. Like when you’re moving between app screens or waiting for a webpage to load.Here’s an interstitial display ad example from a mobile gaming app:Source: Google AdMobThese ads can be images or videos. They’re hard to ignore, which makes them highly effective for capturing immediate attention. This is why advertisers often use them for promotions or announcements that require quick action.Pop-Up AdsPop-up ads are small windows that appear over a website’s content. They can be in the form of static images, text, or even interactive media.You can set the rules to trigger them. For example, you can set them to appear when a user scrolls halfway down a page or after they’ve been on the site for a certain amount of time.Here’s an example of a pop-up ad from Search Engine Journal:Unlike interstitial ads that cover the entire screen, pop-up ads are smaller. Interstitial ads usually appear during transitions, like when a page is loading. In contrast, pop-up ads can show up at specific, predefined moments.This makes them effective for capturing immediate attention. They even have a good conversion rate of around 11%.However, because they can interrupt and even harm the user experience, it’s important to use them sparingly to avoid annoying website visitors.Rich Media Display AdsRich media display ads are interactive ads that can include video, audio, and clickable elements—offering a multilayered experience for your audience.These ads can do things like expand when you hover over them or play a video when clicked. This makes them more engaging than standard ads, which are usually just static images or text.Here’s an example of a rich media ad where the user can slide a bar across the ad to reveal the function of the product:With rich media ads, you can incorporate features like forms or quizzes directly within the ad. Which allows you to gather data or even make sales without requiring the user to leave the page they’re on.Retargeting Display AdsRetargeting display ads help you re-engage individuals who have previously interacted with you on your website or app but didn’t make a purchase or take a desired action.These dynamic display ads remind them of your brand by displaying relevant products or content they’ve previously viewed.Here’s an example:So unlike standard display ads, retargeting ads are not aimed at a broad audience but are specifically targeted to individuals familiar with your brand.They can take the form of banner ads, video ads, or even rich media—depending on your campaign goals.Native Display AdsNative display ads look and feel like the content around them. Which allows you to advertise in a way that feels less like an ad and more like part of the content.Here’s an example from Pinterest:You may often hear the native ads vs. display ads comparisons. However, it’s important to note that native ads with visual elements actually fall under the category of display advertising.They are usually labeled as “sponsored” or “promoted” to maintain transparency. And can take the form of images, videos, or interactive pieces.Since native display ads integrate seamlessly into the user experience, they can be more likely to engage your target audience—especially those who are averse to disruptive advertising. This makes them ideal for campaigns aiming to build a deeper connection with your audience rather than just capturing immediate attention.How Does Display Advertising Work?To get your display ads in front of your target audience, you’ll work with ad networks like the Google Display Network (GDN). These platforms handle the distribution and targeting.Let’s take an in-depth look at how display advertising works. And how you can plan and execute your campaign.Define Your Target AudienceDefining your target audience ensures your display ads reach people genuinely interested in your product or service, maximizing your return on investment (ROI).For example, if you’re a fitness brand targeting young adults, you’ll want to place your ads on health and wellness websites. Or other websites where this demographic spends their time.Conversely, if you’re a B2B software company, industry-specific websites and forums might be more effective platforms for your display ads.This targeted approach not only increases your ads’ visibility but also improves the likelihood of conversion.You can use Semrush’s One2Target to define your target audience.Open the tool and enter up to five of your competitors’ domains. The tool will gather information about their audience’s demographics, socioeconomics, and behavior.You can use this data to create customer personas—a representation of your ideal customer. These personas will serve as a blueprint for selecting the right platforms and crafting messages for your display ads.Here’s an example of a persona built with the Semrush Persona tool:Choose Your Campaign’s GoalsSetting specific goals will help you allocate your budget and tailor your display ads more effectively.For instance, if your goal is to increase brand awareness, you’ll likely focus on platforms with a broad reach and design ads that are visually striking. On the other hand, if you’re aiming for immediate sales, retargeting ads on platforms with high conversion rates might be your go-to option. So, a goal-driven approach will ensure that every decision you make aligns with your goal.To choose your campaign’s goals, you should start by evaluating your business needs and what you ultimately want to achieve. Discuss it with your team.Are you looking to attract new customers? Is your focus more on retaining existing ones? Are you launching a new product and want more awareness?Once you’ve identified your overarching objectives, break them down into measurable targets.Remember, your goals should be specific, measurable, achievable, relevant, and time-bound (SMART).Here’s an example of a SMART goal: Increase website traffic from display ads by 15% in the next three months. Specific: The goal clearly states the desire to boost website traffic from display ads Measurable: The target is a 15% increase, which can be tracked Achievable: Assuming current trends and resources, a 15% increase is a realistic target Relevant: The goal aligns with broader marketing objectives to drive more website visits Time-bound: The goal is set to be achieved within a three-month time frameDo Competitive AnalysisUnderstanding your competitors’ display ad strategies can help you identify the most effective ad placements, designs, and messaging. Which can not only guide how you allocate your budget but also allow you to strategically place your ads where your competitors are advertising.This way, you can potentially capture some of their audience’s attention.(This tactic can be especially effective if your ads offer something unique or more compelling than your competitors.)So, start by listing your main competitors and examining their display ads.Look at where they’re placing their ads, the types of designs they’re using, and the messaging in their copy and CTAs.This will give you a sense of what’s already working in your market.You can use Semrush’s AdClarity tool for this. It’s an advertising intelligence solution that can help you: Analyze competitors’ ad campaigns See where they are spending their ad budget Compare their ad strategies with your own Understand what the best-performing advertisers are doingOpen the tool and enter your competitor’s domain. You’ll see a dashboard like this:Scroll down and you’ll find the “Top Ads” widget. This shows all the top display ads of your competitor and other competing advertisers in the selected period. Sorted by the highest number of impressions, duration, or recency.Click on any ad to find its landing page and full campaign report. In addition, you will find various other insights. Including the advertiser’s estimated expenditure on display ads, display ads placement, top advertisers in your market, and ad buying methods.You can use details from that competitive analysis to fine-tune your own display ad campaign for better performance.Finalize Display Ad Placement, Type, and FormatChoosing the right websites for your display ads ensures that your message lands directly in front of people most likely to be interested in your product or service.When deciding where to place your ads, you should consider these three factors: Audience relevance: Make sure the website or platform aligns with your target audience’s interests Traffic volume: A website with high traffic increases the visibility of your ad but may also be more expensive Ad space quality: Look for websites that offer prime ad space, ensuring your ad is easily visible and not buried at the bottom of the pageNow, you can directly approach websites to place your ads. But this method is often time-consuming and may not be cost-effective.A more efficient route is to use ad networks.An ad network acts as an intermediary that connects advertisers with multiple websites, streamlining the placement and tracking of your ads.It handles ad distribution—whether it’s across various websites on the internet or within its own ecosystems.Google Display Network and Meta Audience Network are two of the most popular ad networks.GDN reaches over 90% of internet users worldwide. It can serve your ads on more than 2 million partner websites, apps, or videos based on your business type and the users who match your specific criteria.Let’s say you choose GDN as your ad network. There are two types of Google display ads you can opt for: Uploaded display ads: These are ads you design from scratch and upload in various sizes. You have full control over the design, but you’re also responsible for ensuring each ad meets the Google display ads specs for its intended placement. In this case, here are some common Google display ad sizes you can go for: Responsive display ads: This is a more automated option. It’s also the default. You provide the basic elements like images, logos, and text. Google then automatically generates different combinations and sizes to fit various responsive display ads specs, optimizing for performance along the way. You can build your Google display ads campaign by going to your Google Ads account. First, click “Create.”Then, select your campaign objective and “Display” as the campaign type.You will then have to configure your campaign settings. Which would include: Choosing target locations and languages Setting your budget and bidding strategy Selecting your targeting strategyNext, you’ll create responsive display ads where you can upload your images, logos, headlines, descriptions, and videos (pictured below). Google will automatically generate the best ad combinations for your target audience.The final step is to review your campaign. If everything looks good, hit “Publish campaign,” and your ads will go for approval. It typically takes one day to get the approval before your ads are live.Generally, once you’ve chosen an ad network, you’ll need to decide on the type and format of your display ads. For example, GDN offers options like banner ads, interstitial ads, and video ads. So, you will find various Google display ads specs in the network.When considering your display ad type and format, follow these tips: Alignment with goals: Choose a type and format that directly supports your campaign objectives Audience preference: Take into account which formats are most engaging for your target audience Resource availability: Be mindful that some formats, like video or interactive ads, may require more resources to create than others Platform limitations: Different ad networks may have restrictions on ad types or formats. For instance, GDN allows various formats, including banner and interstitial ads. While a platform like LinkedIn doesn’t offer the options for interactive display ads. So, choose a platform that accommodates your needs.By this point, you should have a comprehensive understanding of where your ads will appear, what they will look like, and who they will target.Allocate a BudgetA well-allocated budget allows you to scale your display ad campaigns effectively and maximize ROI. While a poorly planned one can lead to overspending without returns or insufficient reach.When setting your budget, you should consider the platforms you’ll be using. Different platforms have different pricing models, like cost per click (CPC) or cost per 1,000 impressions (CPM). Choose the one that aligns with your goals and budget.For example, with a Google display ad campaign, you can choose how you want to pay—based on the number of impressions your ad receives or the actual conversions like signups or sales. They even suggest bidding strategies to help you meet your online advertising goals.You should also think about the duration of your campaign. A short-term campaign aimed at boosting seasonal sales will have a different budget requirement than a long-term brand awareness campaign.Here are some other factors to consider when allocating your budget to display ads: Campaign goals: Your budget should align with what you aim to achieve. If you’re looking for quick conversions, you might allocate more toward retargeting ads. Audience reach: Consider the size and demographics of your target audience. A broader audience might require a larger budget. Ad format and type: Some formats are more expensive to produce and run. For instance, video ads generally cost more than static image ads. Frequency: How often do you want your ads to appear? More frequent appearances will require a higher budget.If you plan your budget carefully, you’ll be better positioned to run a successful, cost-effective display advertising campaign.Design a Compelling VisualYour ad’s visual design is your first opportunity to engage your audience. A poorly designed ad can turn potential customers away, while a compelling one can boost your click-through rates.When selecting colors, you should consider the emotions you want to evoke. For instance, blue instills trust, while red catches the eye but can signal anger. So, align your color choices with your campaign’s objectives.Here’s a list of popular colors and their meaning:You should also focus on font selection. Pick a font that’s easy to read and reflects the essence of your brand. For example, a playful font might work for a children’s product. But it would be inappropriate for a law firm.Incorporate your brand elements like logos and taglines in a way that complements your ad’s primary message. Rather than overshadowing it.Here are some other tips for designing a compelling visual for your display ads: Visual balance: Maintain a balanced layout where text and images complement each other instead of competing for attention Call to action: Make your CTA stand out, but ensure it aligns with the overall design and message of your ad Consistency: Keep the design consistent with other marketing materials for brand recognition Simplicity: Less is often more. Avoid clutter and focus on one primary message per ad. Local elements: If your campaign targets a specific location, consider incorporating local elements or languagesCraft Effective Ad Copy and CTAsThe right ad copy and CTA can directly influence your conversion rates by engaging the viewer and guiding them through decision-making. This could mean turning a casual website visitor into a lead or long-term customer.When crafting your ad copy, focus on the unique value proposition your product offers. It should speak directly to the pain points of the target audience.The copy should be simple, straightforward, and clear in its message. Here’s an example of great ad copy from Canvas Factory:Similarly, your CTA should be a clear directive that aligns with your ad copy. Specific action-oriented phrases like “Request a Demo,” “Get a Free Quote,” or “Learn How We Can Help” can be more effective than a generic “Click Here.”Here are some other tips you should follow for creating compelling ad copy and CTAs: Speak to pain points: Your ad copy should address specific challenges your audience faces and how your product or service provides a solution Concision is key: You have limited space in a display ad. Make every word count. Your message should be concise—yet persuasive—and align with your visual elements. Create a sense of urgency: Phrases like “Offer Ends Soon” or “Limited Spots Available” can prompt quicker decision-making Include social proof: Testimonials, ratings, or mentions from existing customers can add credibility to your ad copy Consistency across channels: Ensure that the language, tone, and messaging in your display ads are consistent with your other marketing channelsMonitor and Optimize the CampaignContinuous monitoring and optimization are essential to ensure you get the best ROI. By tracking your ad’s performance, you can identify what’s working and what needs tweaking.For instance, if you notice that a particular ad is getting a lot of clicks but few conversions, it might indicate an issue with the landing page or the ad’s messaging. On the other hand, an ad with few clicks might need a design or placement adjustment.Most ad platforms offer built-in analytics that provide real-time data on your display ad’s performance. Here’s how the insights dashboard of Google Ads typically looks:Image Source: Google SupportKeep an eye on your analytics to track key performance indicators (KPIs) like click-through rate, conversion rate, and cost per conversion. These metrics will help you understand how well your ad is performing and where you need to make adjustments.Here are some other tips to effectively monitor and optimize your display ads: Conduct A/B testing: This involves running two slightly different versions of an ad to see which one gets better results. It helps you understand what elements are resonating with your audience. Refine your targeting: If you’re not seeing the expected engagement, you may need to adjust who you’re targeting. Look at metrics like audience demographics and behavior to make more informed decisions. Check your landing pages: Make sure the landing page your ad directs to is doing its job. It should be user-friendly and aligned with the ad’s message to encourage conversions. Do cost analysis: Regularly review your spending to ensure you’re getting good value for your investment. If certain ads are draining your budget but not delivering results, it might be time to pause or adjust them.Ready to Launch Your Display Ad Campaign?Display ads can deliver excellent results.But only if you can plan and execute the campaign properly. And for that, you need the right tools that help you understand your audience, competitors, and market well.For example, to generate multiple branded and conversion-focused ad creatives in a matter of minutes, take a look at AdCreative.ai. In addition, check out AdClarity to analyze and understand your competitors’ display ad strategies.",
  "headers": [
    {
      "level": "H1",
      "text": "Display Ads: What They Are, Types, & How They Work"
    },
    {
      "level": "H2",
      "text": "What Is Display Advertising?"
    },
    {
      "level": "H3",
      "text": "Display Ads vs. Search Ads"
    },
    {
      "level": "H2",
      "text": "Benefits of Display Advertising"
    },
    {
      "level": "H3",
      "text": "Enhanced Brand Visibility"
    },
    {
      "level": "H3",
      "text": "Targeted Reach"
    },
    {
      "level": "H3",
      "text": "Engaging Creatives"
    },
    {
      "level": "H3",
      "text": "Cost Effective"
    },
    {
      "level": "H3",
      "text": "Real-Time Analytics"
    },
    {
      "level": "H2",
      "text": "Types and Formats of Display Ads"
    },
    {
      "level": "H3",
      "text": "Banner Ads"
    },
    {
      "level": "H3",
      "text": "Interstitial Ads"
    },
    {
      "level": "H3",
      "text": "Pop-Up Ads"
    },
    {
      "level": "H3",
      "text": "Rich Media Display Ads"
    },
    {
      "level": "H3",
      "text": "Retargeting Display Ads"
    },
    {
      "level": "H3",
      "text": "Native Display Ads"
    },
    {
      "level": "H2",
      "text": "How Does Display Advertising Work?"
    },
    {
      "level": "H3",
      "text": "Define Your Target Audience"
    },
    {
      "level": "H3",
      "text": "Choose Your Campaign’s Goals"
    },
    {
      "level": "H3",
      "text": "Do Competitive Analysis"
    },
    {
      "level": "H3",
      "text": "Finalize Display Ad Placement, Type, and Format"
    },
    {
      "level": "H3",
      "text": "Allocate a Budget"
    },
    {
      "level": "H3",
      "text": "Design a Compelling Visual"
    },
    {
      "level": "H3",
      "text": "Craft Effective Ad Copy and CTAs"
    },
    {
      "level": "H3",
      "text": "Monitor and Optimize the Campaign"
    },
    {
      "level": "H2",
      "text": "Ready to Launch Your Display Ad Campaign?"
    }
  ],
  "author": ""
}