{
  "url": "https://www.semrush.com/blog/ecommerce-statistics/",
  "slug": "ecommerce-statistics",
  "title": "31 Ecommerce Statistics to Know About in 2024",
  "description": "Discover the most important ecommerce statistics you need to know about in 2024.",
  "content": "If you sell products or services online, knowing the facts about ecommerce is key.Why?Because it can help you understand what the competition is up to, reveal untapped opportunities, and more.With that in mind, here are the top 31 ecommerce statistics.General Ecommerce Industry Statistics There are more than 27 million ecommerce websites on the internet. Shopify is the most popular and is used by more than 5 million websites. (BuiltWith, 2024)Image Data Source: BuiltWith Global ecommerce sales reached an estimated $5.8 trillion in 2023. And Alibaba is the largest ecommerce retailer in the world, with a 23% market share. (Statista, 2023) Amazon is set to surpass Alibaba in global sales by 2027 (Statista, 2023) Amazon is expected to reach nearly 41% of total ecommerce sales in the U.S. in 2025 (eMarketer, 2024) The average number of products per ecommerce order is 4.41 (Statista, 2024) The average ecommerce conversion rate is 3.52% (Dynamic Yield, 2024) The average ecommerce cart abandonment rate is 70.19% (Baymard Institute, 2023) The top reason for cart abandonment is that the additional costs (e.g., shipping fees) are too high (Statista, 2024) More than 90% of U.S. shoppers typically look for deals and discounts before making an online purchase (Statista, 2020) Millennials and Gen Z shoppers are more likely to wait for discounts before purchasing something online. Gen X shoppers are the least likely to wait for discounts. (Statista, 2023) Free shipping is the most important ecommerce delivery criterion for U.S. shoppers (Statista, 2024) Ecommerce businesses lost $48 billion to fraud in 2023 (Juniper Research, 2024)What These Stats RevealGiven the huge footprint Amazon and Alibaba have in the ecommerce space, it’s a good idea to use those types of platforms if it makes sense for your brand. It’s also clear that online shoppers have a lot of barriers to buying. So, it’s wise to do anything you can to streamline their experiences.One way to do that is to ensure your pages load quickly. Which deters visitors from leaving before making a purchase.Use the Site Audit tool to identify slow pages. And then take steps to improve them.Mobile Ecommerce Statistics Smartphone devices accounted for 77% of online retail store visits in Q1 of 2024 (Statista, 2024) Two-thirds of online purchases are made with smartphone devices (Statista, 2024) Worldwide mobile ecommerce sales reached $2.2 trillion in 2023. And they’re expected to surpass $3.4 trillion by 2027. (Statista, 2023) Mobile ecommerce sales account for 60% of all ecommerce sales globally (Statista, 2023) More than three-quarters of U.S. adults make online purchases using a smartphone (Pew Research, 2022)Image Data Source: Pew Research Almost half of U.S. adults aged 30 to 49 make online purchases using their smartphone every week (Pew Research, 2022)What These Stats RevealIt should come as no surprise that mobile devices account for a large percentage of online ecommerce visits and purchases.And because smartphone use in online shopping is expected to grow, it’s a good idea to work on making your website as mobile-friendly as possible.Use Semrush’s Site Audit tool to identify issues that affect your website’s mobile performance.Social Commerce Statistics Three out of every 10 U.S. social media users have purchased a product after seeing an influencer post about it (Pew Research, 2022) U.S. adults aged 18 to 29 are most likely to make purchases based on influencer recommendations, with 41% having done so (Pew Research, 2022)Image Source: Pew Research Almost half (49.5%) of social media users in the U.S. have made at least one purchase via a social channel in 2023 (eMarketer, 2023) U.S. social sales are expected to grow to over $144 billion by 2027 (eMarketer, 2023) Worldwide social commerce sales amounted to $571 billion in 2023 (Statista, 2024) Forecasts show that annual social commerce sales per buyer will rise to over $1,200 by 2027 (eMarketer, 2023) Adult social media users in the U.S. are most likely to make purchases through Facebook (eMarketer, 2024) Facebook is expected to have over 69 million social buyers in 2025. Instagram follows right behind it, with 47 million expected social buyers by 2025 (Statista, 2023) Almost 70% of Gen Z shoppers are likely to make purchases directly on TikTok (Jungle Scout, 2023)What These Stats RevealSocial media platforms and influencers have a big impact on online shoppers’ behavior. So, it’s crucial to have a social media marketing strategy and a strong brand presence across relevant social networks.You can use the “Behavior” report in Semrush’s One2Target tool to learn which platforms your audience spends the most time on.And then work on growing your brand’s presence across those platforms.Online Payment Statistics Digital wallet payments account for about half of all ecommerce payments around the world (Statista, 2023) The estimated transaction value for ecommerce digital wallet payments in 2023 was $3.1 billion (Statista, 2023) Digital wallets are expected to make up 61% of ecommerce transaction value—for a total of $5.4 billion—by 2027 (Statista, 2023) PayPal is the most popular ecommerce payment brand among U.S. shoppers (Statista, 2024)Image Source: StatistaWhat These Stats RevealDigital wallets are steadily overtaking credit and debit cards as ecommerce payment options.If you haven’t done so already, you should work on implementing multiple digital wallet payment options to give customers more ways to pay. And possibly optimize conversion rates among shoppers who aren’t comfortable sharing their credit or debit card information online.Grow Your Ecommerce BusinessKeeping up with online shopping trends is crucial for ensuring that your ecommerce business stays profitable.We recommend that you focus on growing your brand’s presence on social media and implementing more payment options to cater to consumers’ changing preferences. Also, work on improving your website’s performance and mobile-friendliness with the help of Semrush’s Site Audit tool.Get started with Semrush today.",
  "headers": [
    {
      "level": "H1",
      "text": "31 Ecommerce Statistics to Know About in 2024"
    },
    {
      "level": "H2",
      "text": "General Ecommerce Industry Statistics"
    },
    {
      "level": "H3",
      "text": "What These Stats Reveal"
    },
    {
      "level": "H2",
      "text": "Mobile Ecommerce Statistics"
    },
    {
      "level": "H3",
      "text": "What These Stats Reveal"
    },
    {
      "level": "H2",
      "text": "Social Commerce Statistics"
    },
    {
      "level": "H3",
      "text": "What These Stats Reveal"
    },
    {
      "level": "H3",
      "text": "Online Payment Statistics"
    },
    {
      "level": "H3",
      "text": "What These Stats Reveal"
    },
    {
      "level": "H2",
      "text": "Grow Your Ecommerce Business"
    }
  ],
  "author": ""
}