{
  "url": "https://www.semrush.com/blog/evergreen-content/",
  "slug": "evergreen-content",
  "title": "Evergreen Content: What It Is & How to Create It",
  "description": "Evergreen content is content that remains relevant for a long period of time. Discover its role in SEO success.",
  "content": "What Is Evergreen Content?Evergreen content is continually relevant to readers over an extended period of time—often several years. It typically addresses common problems or questions many people have. And it doesn’t need frequent updates to remain relevant. For example, a blog post about “how to write a book” is evergreen. The information doesn’t change and it’s a topic people will be interested in long term. Seasonal vs. Trending Content vs. EvergreenSeasonal content is only relevant at specific times in the year. Like content about Halloween or other time-specific holidays.Trending content is only relevant for a brief period of time. But the interest in the topic will slow down eventually.For example, the interest for “Orange is the New Black” (a TV show) petered out after the show ended:Evergreen content remains more relevant compared to trending and seasonal content. It is not: A press release News and current event articles Research reports on topics that are outdated quickly Holiday-specific contentFormats and Examples of Evergreen ContentEvergreen content comes in many different formats. The most widely used formats are: How-to guide or tutorial: A list of instructions to complete a specific task or learn a new skill FAQ: A piece that addresses common questions and problems in your niche Guide: A comprehensive resource that provides in-depth information on a specific topic Listicle: A curated list of tips, recommendations, or resources relevant to your audience Expert interview: A published conversation with relevant industry experts Case study: A report that shows how your customer solved a problem using your products or services Resource library: A collection of valuable tools, templates, or references in one place Infographic: A graphic that presents or illustrates information in a visual mannerHere’s an example of an infographic we made about a case study:And see how paddleboard company Bluefin put together a comprehensive buyer’s guide to address buyer concerns:Benefits of Evergreen ContentHigher Return on InvestmentEvergreen content often gives you a better return on your investment compared to trending content. Why?Because its long-term topical relevance gives you a consistent stream of traffic, leads, and potential sales.For example:Say you have an evergreen piece of content. And it generates five sales per day.You also have a piece of trending content that goes viral. The viral content generates 400 sales over a few days. But eventually trickles down to zero.The trending content might seem like a better value. But your evergreen content could end up producing over 1,800 sales each year (5 sales per day x 365 days).So, if you want the most bang for your buck, focus on evergreen content.Higher ShareabilityEvergreen content usually gets more shares than trending topics.Since evergreen topics are always relevant, people will share them on social media year after year.This means over time, you can build up more social shares.More social shares will increase your brand exposure. And help you build credibility within your niche.More BacklinksWebsites with lots of backlinks—links from one website that point to another website—often rank higher in the search results.And since evergreen content has a long lifespan, it tends to attract more backlinks. As your backlinks grow, so will your site’s authority. Which means you’ll have a better chance of ranking higher in search results. And driving more visitors to your site.Consistent TrafficOptimizing evergreen content for search engines helps you drive a steady flow of traffic to your site.And unlike seasonal or trending content, you won’t need to worry about traffic waning throughout the year.Let’s look at a few real-life examples.Take Casper’s guide on “how to fix your sleep schedule.”There are nearly 12,000 searches for four different variations of the primary keyword each month. Because Casper’s guide ranks high, it gets around 1,400 monthly visitors from organic search:Another great example of evergreen content is Calcuator.net’s Mortgage Calculator:The search term “mortgage calculator” generates over 3.4M monthly searches in the United States.And because Calculator.net ranks on the first page, they get over 340,000 monthly visitors from organic search:How to Create Evergreen Content in 4 Steps1. Choose a TopicTo create evergreen content, select a topic that is timeless and relevant to your audience. Ask yourself: “Is this something people will be interested in several years from now?”If the answer is yes, the topic is likely evergreen. (We’ll show you how to confirm this in the following steps.)If you’re unsure about a topic’s evergreen appeal, use the Topic Research tool. Enter your niche—we’ll go with “meditation” here. It’s optional to also indicate a domain.Then, select where your audience is from and click “Get content ideas.” Go through the topics and jot down ones you think are relevant to your audience.In the next step, we’ll uncover evergreen keywords for your chosen topic.2. Conduct Keyword ResearchKeyword research helps you find keywords you can rank high for in search results.Let’s stick with the “meditation” topic from above. One of the topics suggested is “meditation apps.” You might think that’s a good keyword in and of itself. But through keyword research, we can find even more keywords for that one topic.Here’s how:First, access the Keyword Magic Tool.Enter your topic (we’ll use “meditation apps”), select your country, and click “Search.”You’ll get a list of keywords relevant to your topic.There are plenty of unique keywords you can write about. Like “free meditation apps” or “christian meditation app.”Displayed beside each keyword is a search intent category and monthly search volume. The Keyword Difficulty (KD %) column helps you determine how hard it is to rank for each one.Go through the list and pick a keyword that’s relevant to your audience. After picking a keyword, let’s confirm that it’s evergreen.Click the “>>” symbol next to your keyword. It will open up a keyword overview window. Make sure the blue bars shown in the “Trend” section are relatively stable. Here’s an example of how a seasonal keyword might look. In this example, the keyword is “christmas cookies”:If your keyword isn’t evergreen, head back to the Keyword Magic tool and pick a new one.3. Choose Your Content FormatPicking the right format helps your content resonate with your audience.For example, you’ll likely want to use a listicle-style blog post format if you’re writing a blog post on “free meditation apps.”And if your keyword is “how to meditate,” the ideal format would be a how-to guide.If you’re unsure which format is best, use the Keyword Overview tool to guide you. Enter your keyword and click “Search.” Then, scroll down to the “SERP Analysis” section.This shows you which websites rank high for your keyword. Click on each website to read the content. Look for patterns and use a critical eye to determine which format will work best for your keyword.But what if you don’t notice any patterns? Feel free to experiment. You can always revise and reformat your content down the road. 4. Write and Publish Your ContentGreat content has the potential to rank high in search results. Which brings you more traffic (and more business). For help with writing content, use the SEO Writing Assistant. Start by clicking “+ Analyze new text.”Click the “Set a new goal” drop-down and enter at least two keywords. Next, input your content. You can write directly in the editor directly or paste your content in.Then, choose your target audience (desktop or mobile), input your keywords, and click “Get recommendations.”SEO Writing Assistant puts together recommendations to improve your content based on: Readability SEO Tone of voice OriginalityThis way, you’ll know exactly what’s needed to write content that ranks as high as possible in search results.Below are a few more tips to keep in mind when writing quality evergreen content.Add Visual EnhancementsVisual enhancements like infographics and imagery break up the text and convey information more effectively.They also make your content more shareable (since readers have more elements to share).Take a look at how bed retailer Dreams added an infographic to their article:And how Nike added photos of each Yoga pose to complement the accompanying text:Here are a few more ideas: Add images with key pieces of information Incorporate charts or graphs that highlight important data points Include screenshots or step-by-step images to illustrate a process or tutorial Use icons or symbols to emphasize key takeaways or sectionsUse Clear and Concise LanguageClear and concise language helps your content remain timeless.Here’s why:Industry terms you use today may not be relevant in a few years. So, avoid jargon in your evergreen pieces. Next, clear language improves readability and allows a wider audience to enjoy your content. Lastly, concise language helps maintain readers’ attention. Readers appreciate content that quickly delivers value without unnecessary fluff. And if your readers make it to the end of your article, they’ll be more likely to follow through on your call to action (CTA). Avoid Pop Culture ReferencesTo keep content fresh and relevant, avoid pop culture references. Pop culture references are short-lived and put a lifespan on your content. For example: The documentary Tiger King took the world by storm in 2020. But a mere three years later, there’s barely any mention of it. Google Trends confirms this:Encourage User InteractionUser interaction keeps your content fresh long after you’ve published it.Give users a way to interact with each piece you create. Add things like social share buttons and a comment section to your blog posts. Like this review section for a recipe blog:As a bonus, comment sections help you pinpoint ways to improve your content in the future.If users continually ask the same question in the comments, it may mean you need to add key information to your piece.Add Internal Links to Relevant PiecesInternal links—links that point to different pages on the same website—help search engines discover your content. So that your content can rank in the search results.Internal links also guide readers to other pieces of content they may find useful. This keeps users on your site for longer and establishes you as a valuable resource.Updating Evergreen ContentUpdating your content keeps it fresh. Which can help it rank higher and ensure you’re providing readers with timely information.Here are some examples of when you should update a piece of evergreen content: Your rankings are falling: Use our Position Tracking tool to keep a close eye on each keyword you rank for. Update your content when rankings start to slip. You want to rank higher: Try reworking the content if you’re not ranking well for a keyword New information was released: Update your content if new research comes out in your niche There were changes in your industry: Keep an eye on best practices in your industry and make sure your content reflects those best practices You updated your business: Make sure the information remains relevant to your business. If it’s not, spend time updating your content to reflect any changes that occurred. Promoting Evergreen Content for Maximum ImpactConsistently promoting your content helps you grow your reach even faster.Here are a few ideas:1. Social MediaSocial media is a great way to promote evergreen content without reinventing the wheel.Repurpose your content by sharing quotes, excerpts, and interesting facts from each piece.You can schedule your social posts with Social Poster. Just follow these steps:After connecting your social account, click “New post.”Create your post and click ”Schedule”:Create multiple posts (scheduled at various intervals) for each piece of evergreen content. That way, you can continually promote your evergreen content in a (mostly) hands-off fashion.2. Email MarketingYour newsletter is a fantastic way to connect directly with folks who love your brand.Add email sign-up forms directly to your blog posts to capture new leads. Here’s one from Mailchimp:Then, send out newsletters that promote each piece of evergreen content you publish.3. Guest BloggingGuest blogging helps you reach a new audience and acquire backlinks in one go.Let’s say you write a blog post about skydiving tips for your skydiving business.You could seek a local tourism website and write a guest post for them about skydiving equipment. Then, within your guest post, you can link to your original blog post on skydiving tips.Here’s how to find guest posts:Head to Google and search “[your niche] + guest post” and “[your niche] + write for us.”The query will yield websites that have published guest posts in the past. And are likely to publish them in the future.Do a second search for “[your niche] + write for us.”This will bring up a list of sites with a “write for us” page. Indicating they are open to guest posts.Go through the websites and find ones that are good fits for your brand.4. Content SyndicationContent syndication is when you republish your content on other reputable websites. It helps you reach a wider audience, gain backlinks, and drive traffic back to your site.To find websites that republish content, try searching the following: “republished with permission” [keyword] “republished from” [keyword] “originally appeared on” [keyword] “syndicated from” [keyword]This brings up different websites that have republished content in the past.See if these sites have published any guidelines on content syndication. Then reach out to see if they’d allow you to republish your own content. Important: Make sure to apply content syndication best practices so no republished content compromises your original page.5. Paid AdsYou can turn to paid ads to generate traffic to your content right away. By advertising your content with different platforms like Google Ads.To make the most of your paid advertising strategy, encourage readers to share your content with social share buttons and clear CTAs. This helps you generate organic traffic even after you turn off the ads.Measuring Performance of Evergreen ContentMeasuring the right key performance indicators (KPIs) helps ensure your evergreen content performs its best.The KPIs you track depend on your business and goals. We put together useful ones you might want to consider.1. Organic Search SessionsOrganic search sessions is free traffic that comes from search engines (not paid ads).High organic sessions means your evergreen content is ranking high. And that people are clicking on it in the search results. Analytic tools—like Google Analytics 4 (GA4)—help you track and monitor organic sessions for each page (and piece of content) on your website.Update content with low (or falling) organic search sessions. The SEO Writing Assistant gives you tips on how to improve your content so it ranks higher. 2. Average Engagement TimeAverage engagement time is the length of time a user is focused on your website. If a user on your website switches tabs, they’re no longer considered engaged. You want your average engagement time to be as high as possible. It means people enjoy your evergreen content.Tap into the Organic Traffic Insights tool to view the average engagement time for each piece of evergreen content. Spot which pieces have lower-than-average engagement times.Two reasons your average engagement time could be low: Your content doesn’t meet the searcher’s intent: Use the Keyword Overview tool to re-evaluate the keyword’s search intent Page readability is poor: Use the SEO Writing Assistant for tips to improve the readability of your content3. BacklinksBacklinks help your SEO and rankings. So, you want to make sure your evergreen content is getting backlinks. One way to monitor backlinks to your evergreen content is through the Backlink Analytics tool. To start, enter your domain and click “Analyze”:Then click the “Backlinks” tab:You can see new and lost backlinks. Plus all your backlink sources. Filter the report by typing the URL for your evergreen content into the search bar:Identify which which pages get the most backlinks and spend time promoting pages that aren’t getting many backlinks.4. Social SharesSocial shares refer to the number of times people have shared your content on social media. A high share amount means people love your content. Tools like SharedCount tally up all your social shares per page.Monitor this information over time to see which pages perform best. Here are some ideas to encourage more people to share your evergreen content: Add visible social share buttons Include a clear CTA that asks users to share your piece Use ClickToTweet to pre-write a post for people to share on X (formerly Twitter)Create Your Next Evergreen Piece of ContentEvergreen content can help you create an SEO powerhouse.But for that to happen, you need to identify which topics and keywords are evergreen to your audience.Ready to get started? Use the Keyword Magic Tool to find your next evergreen content idea.",
  "headers": [
    {
      "level": "H1",
      "text": "Evergreen Content: What It Is & How to Create It"
    },
    {
      "level": "H2",
      "text": "What Is Evergreen Content?"
    },
    {
      "level": "H3",
      "text": "Seasonal vs. Trending Content vs. Evergreen"
    },
    {
      "level": "H2",
      "text": "Formats and Examples of Evergreen Content"
    },
    {
      "level": "H2",
      "text": "Benefits of Evergreen Content"
    },
    {
      "level": "H3",
      "text": "Higher Return on Investment"
    },
    {
      "level": "H3",
      "text": "Higher Shareability"
    },
    {
      "level": "H3",
      "text": "More Backlinks"
    },
    {
      "level": "H3",
      "text": "Consistent Traffic"
    },
    {
      "level": "H2",
      "text": "How to Create Evergreen Content in 4 Steps"
    },
    {
      "level": "H3",
      "text": "1. Choose a Topic"
    },
    {
      "level": "H3",
      "text": "2. Conduct Keyword Research"
    },
    {
      "level": "H3",
      "text": "3. Choose Your Content Format"
    },
    {
      "level": "H3",
      "text": "4. Write and Publish Your Content"
    },
    {
      "level": "H4",
      "text": "Add Visual Enhancements"
    },
    {
      "level": "H4",
      "text": "Use Clear and Concise Language"
    },
    {
      "level": "H4",
      "text": "Avoid Pop Culture References"
    },
    {
      "level": "H4",
      "text": "Encourage User Interaction"
    },
    {
      "level": "H4",
      "text": "Add Internal Links to Relevant Pieces"
    },
    {
      "level": "H2",
      "text": "Updating Evergreen Content"
    },
    {
      "level": "H2",
      "text": "Promoting Evergreen Content for Maximum Impact"
    },
    {
      "level": "H3",
      "text": "1. Social Media"
    },
    {
      "level": "H3",
      "text": "2. Email Marketing"
    },
    {
      "level": "H3",
      "text": "3. Guest Blogging"
    },
    {
      "level": "H3",
      "text": "4. Content Syndication"
    },
    {
      "level": "H3",
      "text": "5. Paid Ads"
    },
    {
      "level": "H2",
      "text": "Measuring Performance of Evergreen Content"
    },
    {
      "level": "H3",
      "text": "1. Organic Search Sessions"
    },
    {
      "level": "H3",
      "text": "2. Average Engagement Time"
    },
    {
      "level": "H3",
      "text": "3. Backlinks"
    },
    {
      "level": "H3",
      "text": "4. Social Shares"
    },
    {
      "level": "H2",
      "text": "Create Your Next Evergreen Piece of Content"
    }
  ],
  "author": ""
}