{
  "url": "https://www.semrush.com/blog/facebook-advertising/",
  "slug": "facebook-advertising",
  "title": "Facebook Advertising: How to Run Campaigns on Facebook",
  "description": "Kick-start your journey into Facebook ads with our tutorial. Packed with visuals & tips for newcomers.",
  "content": "Facebook advertising is a low-cost way to grow your business using social media.Follow this guide to learn how to advertise on Facebook in eight easy steps.What Is Facebook Advertising?Advertising on Facebook is when a business pays to promote its products or services to Facebook’s user base.Facebook allows businesses to target ads to users based on specific information such as interests, gender, and location.This makes it easy to get your business in front of people who are most likely to be interested in your product or service.Running a Facebook advertisement is a form of social media advertising.Businesses manage Facebook campaigns in Ads Manager. Which is a built-in tool on the Facebook platform.Below is an example of Facebook advertising. The advert promotes the Captain Whidbey Inn near Seattle, Washington.We know this is a Facebook ad because it says “Sponsored” in the top left corner.Why Advertise on Facebook?Facebook boasts over 2 million daily active users (DAU) and is one of the world's most popular social media platforms.This means that advertising on Facebook can potentially reach a large, diverse audience.Here’s a chart from Statista showing Facebook’s DAU count from Q3 2008 to Q2 2023.Notice how the chart shows long-term, stable growth?This clearly indicates to advertisers that Facebook is a reliable platform to invest time and resources in because their user base keeps increasing.And thanks to Facebook’s high number of customer touchpoints, there are various opportunities to advertise your business on the platform.For example, advertise on Facebook via Marketplace, Messenger, or the Facebook homepage.This allows you to place ad campaigns where your potential customers will most likely see and engage with them, which helps you grow your business.How Much Does It Cost to Advertise on Facebook?Facebook advertising is a low-cost way to promote your business.The amount you spend on Facebook advertising will depend on various factors, including: Social media goals Social media budget Campaign objectives Ad placement Campaign duration Seasonality Advertisers typically measure the success of Facebook paid advertising campaigns by measuring cost per click (CPC).This metric tells advertisers how much they spent for each ad click.As of January 2024, the average cost per click on Facebook was $0.55.Image Source: RevealbotHowever, Facebook ad costs can differ depending on the industry.For example, IT and software companies generally have the highest cost per click at $0.85.Whereas food products and other services have a lower CPC—around $0.18.Facebook calculates cost per click by dividing the total cost of an ad by the total number of clicks.The CPC formula looks like this:Cost per click = total ad cost / total number of clicks What Are the Different Types of Facebook Ads?There are several types of Facebook ads to use to promote your business.Let’s look at each ad format and explain the best use to help create successful advertising campaigns on Facebook.Image AdsImage ads are one of the most basic forms of advertising on Facebook. The ad consists of a single photo, ad copy, and a call to action (CTA).Create a new image ad using Ads Manager or create one from an existing post on your Facebook Business Page. Which is known as a boosted post.Use image ads to promote your product or service and convince people to take action. For example, click a button to shop your store or call your business.Here’s a Facebook image ad example from fitness brand Peloton:In this ad example, the call to action encourages the ad viewer to “Shop now.” This aligns with the ad’s copy that tells the audience Peloton is having a sale.Video AdsVideo ads promote your product or service using video. Like image ads, you create a video ad in Ads Manager or boost an existing post.Or record your own video ad and upload it to Facebook.Video ads are highly engaging and capture an audience's attention. They also allow you to share a single, clear message in an easily digestible format.Here’s a screenshot from a Facebook video ad from women’s cycling brand Samsara:Video also helps tell a story and connect with your target audience emotionally.Use video to showcase product demos, provide tutorials or how-to content, or show a behind-the-scenes look at your business.Facebook video ads can be as long as 240 minutes. Or as short as one second.The length of your Facebook ad will depend on the placement on the platform.For example, ads on Facebook Marketplace can run for the full 240 minutes. In contrast, Facebook Stories ads can be between one and 15 seconds long.Carousel AdsCarousel ads give you space to share up to 10 images or videos the audience can swipe through.Each image or video has its own headline, description, and button. Meaning that you’ll convey a lot of information in one advertisement.Use carousel ads to showcase a variety of products or features, provide updates, tell a story, or highlight multiple features of one product. Here is an example of a carousel ad from fashion company Topo Designs:Collection AdsCollection ads on Facebook are designed to turn casual browsers into passionate buyers.The ad format includes a main feature image or video and three smaller images beneath in a grid. Users who tap and browse your collection ad will be directed to an immersive Instant Experience designed to generate further engagement with your brand.Here’s an example of a collection ad by Spruce:Collection ads are especially useful for ecommerce businesses and merchants who can use collection ads to drive purchases from a catalog.Further reading: How to Create an Ecommerce Facebook Ads StrategyInstant Experience Ads (Formerly Canvas Ads)Instant Experience ads are full-screen Facebook advertisements optimized for mobile browsing.Designed to capture audience attention, Instant Experience ads open after a viewer taps on the ad.Use Instant Experience ads to create an engaging visual experience, tell a story about your brand, and deep dive into your message by linking two or more Instant Experience ads together.Here’s an example of an Instant Experience ad by Skoda:Poll AdsPoll ads allow you to survey your target audience with a two-answer poll.Use polls to ask your audience questions or gain insight into how they feel about a topic or your latest product.Here’s an example of a poll ad by Novo Nordisk: This helps you learn more about your target audience. Use the information from your poll to help shape future campaigns.Slideshow AdsSlideshow ads are a looping sequence of three to 10 images or one video.Use slideshow ads to communicate a story, showcase your products or services, and simplify a complex message.Slideshow ads are a good alternative to video ads. Which can be expensive to produce.And because slideshow ads can use up to five times less data than video, the ad format is useful to reach audiences with slower internet speeds. Like this ad from Charter College:Stories AdsStories ads are highly engaging, interactive, full-screen, vertical images or videos in Facebook’s Story feed.Include clear visuals and a compelling narrative to use Facebook Stories to improve brand awareness and generate interest in your product or service. Include a call to action in your story and direct a viewer to a landing page for further engagement with your business. Like Tropicana does here:Lead AdsLead ads collect information from a viewer and offer an opportunity for audiences to engage deeper with a business and continue on their journey to become a customer.Lead ads will include a call to action. For example, sign up, request a demo, or register. The viewer then inputs information. Which creates the lead. Use leads to grow your business and scale an email list (if you have one). Sync lead ads with your customer relationship management (CRM) system to ensure an effective follow-up.Messenger AdsMessenger Ads appear in the Chats tab on Facebook’s Messenger app. When a viewer taps on a listed ad, a detailed view automatically opens in Messenger containing your ad details.When creating Messenger ads, include images, ad copy, and a CTA. Which helps drive engagement and interaction.Use the ad format ideal to create conversation, drive clicks to your store, and strengthen customer relationships.TipTo quickly generate branded and conversion-focused ad creatives for Facebook, check out the AdCreative.ai app in the Semrush App Center.How to Advertise on FacebookTo start seeing results from Facebook advertising, you need a Business Page. Manage your Facebook Page using Meta Business Manager. Which is a built-in tool for businesses to organize, manage, and control their business assets on Facebook.If you already have a Facebook Business Page, skip ahead to Step Three. If you don’t, follow the steps below:Log in to your personal account and navigate to the left sidebar. Click “Pages.”Then, click “Create New Page.”Follow the onscreen instructions to add Business Page information such as page name, category, and a short description of what you do.Next, click “Create Page.”Further reading: How to Promote Your Business on FacebookStep 2: Navigate to Ads ManagerOnce you’ve set up your page, navigate to the left side of your screen. Click “Ads Manager.”Ads Manager is the dashboard where you create, manage, and monitor your Facebook advertising campaigns. You’ll visit this page often while using Facebook to advertise, so bookmark or save the Ads Manager URL for future reference.To start building your Facebook ad, click the green “+ Create” button in the top-center of the Ads Manager screen.Step 3. Choose a Campaign ObjectiveNext, choose your campaign objective. This must relate to your social media goals. Otherwise, you’ll struggle to prove a positive return on investment (ROI) from advertising on Facebook.For example, if your goal is to increase brand awareness using social media, don’t set a Facebook campaign objective to make sales. Because these objectives drive different results. So, it can be difficult to create the results you need to achieve your social media goals.If you haven’t set any social media goals, start with the SMART framework:Specific: What do you want to achieve? Measurable: Can you track and report on ad campaign metrics? Achievable: Will you achieve the goal in your time frame? Relevant: How does this goal support business objectives?Time-bound: What is the timeline for the ad campaign?Let’s look at each Facebook campaign objective in more detail:AwarenessThe awareness objective helps improve brand recognition and introduces your business to a new audience. Choose this objective to: Reach new potential customers Increase your target audience’s awareness of your brand Share video content with an engaged audienceTrafficThe traffic objective sends ad viewers to an online destination predetermined by you. For example, a website, landing page, app, or event.Choose this objective to: Increase social media traffic to your website Send ad viewers to a landing page Direct audiences to other Meta products (e.g., Instagram, WhatsApp, or Messenger) Get people to call your businessEngagementComments, likes, shares, and saves are all forms of engagement that tell Facebook your audience is interested in your ad.Which helps them perform better on the platform.Choose this objective to: Increase audience interaction and engagement with your ad Get your audience to take action Increase video views Generate responses to an eventLeadsRunning a lead-generation ad campaign on Facebook lets you capture high-quality information from potential customers.Choose this objective to: Grow your customer base and build connections Acquire phone numbers and email addresses Expand registrations for an eventFurther reading: Getting Low-Quality Leads from Your Facebook Ads? Here's What to DoApp PromotionIf you’ve got a new app to launch, running an app promotion campaign will help you gain more downloads and customers.For example, if you’re a new grocery delivery app, you could use the app promotion campaign objective to increase downloads of your new product.Choose this objective to: Increase downloads of your app Optimize your ad with App Events for deeper customer insights and targeting Drive high-value purchases Increase link clicks to your appSalesSales are a key driver of business revenue.The sales campaign objective lets you target people who are likely to make a purchase. Or, perform an action—like putting an item in their basket.Choose this objective to: Gain more customers and increase revenue Focus on conversions Encourage purchase from a catalogChoose the campaign objective that best fits your social media goal. Then, click “Continue.”In this example, we’ve selected the traffic campaign objective. With the goal to increase calls to a fictional pizza parlor called Mario’s Pizza Seattle.Step 4. Create Your Ad CampaignFill out the specific details of your campaign, starting with the campaign name.The campaign name should reference the product or service you’re advertising, the campaign objective, and the date.Next, clarify if your ad falls under Facebook’s special ad categories (e.g., finance, education, politics, etc.).And confirm the buying type and campaign objective.Now, you have the option to create an A/B test. Which is a research method that compares two versions of a Facebook ad to determine the one that performs better.For now, we’ll leave this unchecked.If you’re creating multiple Facebook ads, activate the Advantage campaign budget. But for now, we can also leave this turned off.Then, click “Next” to name your ad set.An ad set is a group of ads that share the same setting. For example, audience or location.Then, choose the location you want to drive traffic to.For the traffic campaign objective, choose between a website, an app, messaging apps (WhatsApp, Messenger, Instagram), or calls.We want more calls for our pizza business, so we’ll select that option. Step 5. Set Your Ad Budget and ScheduleNext, you need to set your ad budget.How much money you allocate from your social media budget to Facebook advertising will depend on: Your campaign goals How your Facebook audience buys How many people managing ad campaigns Your ad campaign durationThere are two types of Facebook ad budgets:Daily BudgetA daily budget has a limit on the amount you spend each day advertising your business on Facebook. By setting a daily budget, the platform will show an ad to your target audience when and where they’re most likely to engage.Once your budget is reached, your ad stops running for the day. And starts again the next day.Lifetime BudgetA lifetime budget is the total amount you’ll spend during the entire duration of your ad campaign. Provide Facebook with details on a start and end date, and the platform will allocate the money based on the performance of your ad. Once your budget is reached, the ad campaign will finish.As a starting point, we recommend beginning with a small ad budget to help you test your Facebook ad’s effectiveness.If the ad is successful, scale it to meet your campaign goals.Choose whether you want to run a daily or lifetime budget, enter your budget amounts, and schedule the duration of your campaign.Step 6. Customize Your Target AudienceFor your Facebook advertisement to be effective, it needs to be placed in front of an audience most likely to be interested in your product or service.Otherwise, you’ll struggle to drive engagement. And your campaigns won’t generate results.To get inside the minds of consumers and understand what engages them, you need to conduct audience research to uncover specific demographics, behaviors, and characteristics.This way, you’ll create Facebook advertising campaigns that resonate.Use Semrush’s Audience Intelligence Tool to get an accurate picture of your target audience.The tool helps identify and gain insights by examining audience demographics, interests, content engagement, online habits, and purchase behavior.This allows you to build helpful profiles of who you should target in your ad content.To create a new audience for your Facebook advertisement, follow these steps:Locations: Choose a relevant location to target with your ad campaign. For example, our fictional pizza place, Mario’s, is located in Seattle, so that’s an obvious city for them to target.Age and gender: Set the age and gender of your target audience. For Mario’s, we’ve chosen men aged 18-35.Detailed targeting: Enter the interests of your target audience. In Mario’s case, pizza.It’s important to include as much information about your target audience as possible. This will help build ad campaigns that achieve results.For example, if your target audience speaks more than one language, add this information.Next, look to the side of the screen. Facebook provides information on: Audience definition: How specific or broad your audience targeting is Estimate audience size: The number of people you could reach with your daily budget Estimated results: The expected daily results from your campaignRemember—these are daily estimates, so your actual results may vary.If you’re happy with your estimates, click “Next.”Step 7. Design and Finalize Your AdNow, it’s time to name your ad.It’s best practice to include information about the design of your Facebook ad. For example, image use and copy information.Next, confirm the identity of the Facebook page you’ll run ad campaigns on.Then, choose the format of your ad. For example, a single image or video, carousel, or collection.Next, scroll down to the “Ad creative” section.This is where you’ll add creative and interactive elements to your ad. For example, images, videos, ad copy, and a call to action.Click “Add media.”Select the image or video you want to include in your Facebook ad. Then, click “Next.”Now, add the copy that will appear alongside your Facebook advertisement. Facebook ad copy is one of the most important elements of your ad. It needs to be engaging, hook the audience, and explain what you’re advertising.Luckily, Facebook makes writing ad copy easy by breaking it down into three elements: Primary text: Appears above the ad creative (e.g., images or video). Use 125 characters or less for the best impact. Headline: Appears below the ad creative. Use 40 characters or less. Description: Appears just below the headline. Use 30 characters or less.In this example from running shoe company On, we can see they’ve leveraged their Facebook copy perfectly to promote their weatherproof shoe. And they encourage the audience to engage further with their brand by including a CTA (“Shop now”).But starting from a blank page is hard. If you need support writing Facebook ad copy, use Semrush’s AI Writing Assistant.The tool helps generate creative ideas, checks for spelling and grammar, and uses AI to align your ad copy with your brand voice, tone, and target audience.Here’s the Facebook ad copy we’ve added for Mario’s: Primary text: Dial Mario’s for a slice of the good stuff. Delivered straight to you. No fees, no fuss. BOGO every Tuesday! Headline: Mario’s Pizza Seattle Description: NY-slice on the West CoastThis ad copy works because:Primary text: Includes a catchy opening slogan, tells the audience Mario’s delivers for no fee, and explains the deal they’re promoting (buy one, get one every Tuesday).Headline: States the name of the business. Description: Includes a short description of the business and its place in the market.For our chosen campaign objective (traffic), we need to set a destination for our viewers after they engage with our ad.Because we selected our conversion destination as calls, we have the option to enter our phone number. Next, preview your ad. You’ll see how your ad will appear in Facebook feeds, Stories and Reels, and search results.Confirm that your ad is correct, then hit “Publish.”Congratulations! You’ve just learned how to create a Facebook ad.Step 8. Measure the Results of Your Facebook Ad CampaignOnce your Facebook ads are running, you need to keep an eye on how they perform.Use Ads Manager to understand how your campaign helps achieve your goals.To do this, navigate to Facebook Ads Manager. And click “Ads reporting.”The dashboard will show a detailed report of your ad campaign. And allows you to see key performance metrics at a glance. Including: Reach: the number of accounts that saw your ads at least once Impressions: the number of times your ad is shown to accounts (regardless of whether they see it) Results: the results of your ad. For example, the number of link clicks. Amount spent: how much you spent on the ad campaign Cost-per-result: measures the cost-effectiveness of your ad campaignImage Source: MarTechUse this information to understand how your Facebook ad campaign is performing.Further reading: 18 Social Media KPIs (and How to Track Them)Facebook Advertising: Best PracticesUnderstand Facebook Ad SpecsImages and videos form the backbone of many Facebook ad campaigns. So, these creative elements must be accurate. And because your Facebook advertisement represents your business, you don’t want to include blurry images or wonky videos.Familiarize yourself with Facebook ad specs to ensure you upload the right creative file types and sizes:Facebook Image Ad SpecsFile type: JPG or PNG Ratio: 1.91:1 to 1:1 Resolution: At least 1080 x 1080 pixels Primary text: 125 characters Headline: 27 characters Description: 27 characters Maximum file size: 30 MBMinimum width: 600 pixelsMinimum height: 600 pixelsHere’s an example of a Facebook image ad by Good Protein:Facebook Video Ad SpecsFile type: MP4, MOV or GIF Ratio: 1:1 (for desktop or mobile) or 4:5 (for mobile only) Video settings: H.264 compression, square pixels, fixed frame rate, progressive scan, and stereo AAC audio compression at over 128 kbpsResolution: At least 1080 x 1080 pixelsPrimary text: 125 characters Headline: 27 characters Description: 27 characters Video duration: 1 second to 241 minutesMaximum file size: 4 GBMinimum width: 120 pixelsMinimum height: 120 pixelsHere’s a Facebook video ad from Goodfood:Facebook Carousel Ad SpecsImage file type: JPG or PNG Video file type: MP4, MOV or GIF Ratio: 1:1 Resolution: At least 1080 x 1080 pixels Primary text: 125 characters Headline: 32 characters Description: 18 characters Number of carousel cards: 2 to 10Image maximum file size: 30 MBVideo maximum file size: 4 GBVideo duration: 1 second to 240 minutesHere’s a carousel ad example by Upside Drinks:Facebook Collection Ad SpecsImage type: JPG or PNG Video file type: MP4, MOV or GIF Ratio: 1:1 Resolution: At least 1080 x 1080 pixels Primary text: 125 characters Headline: 40 characters Image maximum file size: 30 MBVideo maximum file size: 4 GBFurther reading: 8 Signs of Facebook Ads Issues and How to Fix ThemPromote Organic Posts That Already Perform WellLook at your organic (i.e., not paid) Facebook posts to understand the types of content that resonate with your target audience.This way, you’ll easily create and run a boosted post that advertises content your audience will likely engage with.For example, Mario’s shares an organic post announcing they’re opening soon, which creates a lot of engagement.They could then boost this organic post to create an ad.Promoting organic posts also means you don’t need to spend much time creating a Facebook ad. The content is already there and ready to be distributed to your target audience.To understand which organic posts create engagement on Facebook, use Semrush Social.Simply open the tool and click “+ Add profile.”Then, follow the prompts to connect Facebook. Like this:Then, open the tool to the “Overview” tab. Here, take a look at metrics from each of your social channels:To look specifically at the performance of individual Facebook posts, go to the “Facebook” tab and select “Posts.”Here, you’ll see which Facebook posts create the best engagement:Now, use this information to help determine which Facebook posts might work well as ads.Get Started on Facebook Advertising with SemrushAdvertising on Facebook is an efficient and cost-effective way to grow your business.Whether you’re looking to run your first ad campaign or you’re a seasoned paid social pro, Semrush comes with a suite of tools to help you run successful campaigns.Sign up today to get started.",
  "headers": [
    {
      "level": "H1",
      "text": "Facebook Advertising: How to Run Campaigns on Facebook"
    },
    {
      "level": "H2",
      "text": "What Is Facebook Advertising?"
    },
    {
      "level": "H2",
      "text": "Why Advertise on Facebook?"
    },
    {
      "level": "H2",
      "text": "How Much Does It Cost to Advertise on Facebook?"
    },
    {
      "level": "H2",
      "text": "What Are the Different Types of Facebook Ads?"
    },
    {
      "level": "H3",
      "text": "Image Ads"
    },
    {
      "level": "H3",
      "text": "Video Ads"
    },
    {
      "level": "H3",
      "text": "Carousel Ads"
    },
    {
      "level": "H3",
      "text": "Collection Ads"
    },
    {
      "level": "H3",
      "text": "Instant Experience Ads (Formerly Canvas Ads)"
    },
    {
      "level": "H3",
      "text": "Poll Ads"
    },
    {
      "level": "H3",
      "text": "Slideshow Ads"
    },
    {
      "level": "H3",
      "text": "Stories Ads"
    },
    {
      "level": "H3",
      "text": "Lead Ads"
    },
    {
      "level": "H3",
      "text": "Messenger Ads"
    },
    {
      "level": "H2",
      "text": "How to Advertise on Facebook"
    },
    {
      "level": "H3",
      "text": "Step 2: Navigate to Ads Manager"
    },
    {
      "level": "H3",
      "text": "Step 3. Choose a Campaign Objective"
    },
    {
      "level": "H4",
      "text": "Awareness"
    },
    {
      "level": "H4",
      "text": "Traffic"
    },
    {
      "level": "H4",
      "text": "Engagement"
    },
    {
      "level": "H4",
      "text": "Leads"
    },
    {
      "level": "H4",
      "text": "App Promotion"
    },
    {
      "level": "H4",
      "text": "Sales"
    },
    {
      "level": "H3",
      "text": "Step 4. Create Your Ad Campaign"
    },
    {
      "level": "H3",
      "text": "Step 5. Set Your Ad Budget and Schedule"
    },
    {
      "level": "H4",
      "text": "Daily Budget"
    },
    {
      "level": "H4",
      "text": "Lifetime Budget"
    },
    {
      "level": "H3",
      "text": "Step 6. Customize Your Target Audience"
    },
    {
      "level": "H3",
      "text": "Step 7. Design and Finalize Your Ad"
    },
    {
      "level": "H3",
      "text": "Step 8. Measure the Results of Your Facebook Ad Campaign"
    },
    {
      "level": "H2",
      "text": "Facebook Advertising: Best Practices"
    },
    {
      "level": "H3",
      "text": "Understand Facebook Ad Specs"
    },
    {
      "level": "H4",
      "text": "Facebook Image Ad Specs"
    },
    {
      "level": "H4",
      "text": "Facebook Video Ad Specs"
    },
    {
      "level": "H4",
      "text": "Facebook Carousel Ad Specs"
    },
    {
      "level": "H4",
      "text": "Facebook Collection Ad Specs"
    },
    {
      "level": "H3",
      "text": "Promote Organic Posts That Already Perform Well"
    },
    {
      "level": "H2",
      "text": "Get Started on Facebook Advertising with Semrush"
    }
  ],
  "author": ""
}