{
  "url": "https://www.semrush.com/blog/featured-snippet/",
  "slug": "featured-snippet",
  "title": "How To Optimize for Google Featured Snippets [Research]",
  "description": "Semrush & Brado analyzed over 200 mln SERPs to identify how to optimize for Google featured snippets. The how-to guide describes all factors that are vital to win the featured snippet position.",
  "content": "When the featured snippet was first introduced, it became something of a podium prize. Google, being Google, didn’t give us much in the way of how to earn a featured snippet, but SEOs, being SEOs, crunched the data to win the race anyway.Semrush and I have been doing exactly that for years now to ultimately help you understand featured snippets, how they work, and how you can win them for yourself.Our new study gives you the most comprehensive breakdown of that yet, and you can use its results and recommendations as your complete guide to making the most of your featured snippet opportunities, whether you are a first-timer or a hall-of-famer.The sections of this article are as follows: The Methodology of Our Featured Snippets Study Key Takeaways of the Study What are Featured Snippets and Why do They Matter? What is a Featured Snippet? Example of a Featured Snippet Why do Featured Snippets Matter? The Benefits of Featured Snippets The Featured Snippet Landscape What is the Featured Snippet’s Position on the SERP? Example of a double featured snippet Do Featured Snippets Differ by Keyword Categories (Industries)? Popular Domains Earning Featured Snippets What are the Different Types of Featured Snippets? How to Earn Featured Snippets Choose Your Keywords Leverage the Power of Questions Format for a Featured Snippet Date Your Content Use Subfolders Wisely Build Featured Snippet Hubs What is a Featured Snippet Hub? The Anatomy of a Featured Snippet Hub URL Content Can’t Stand Alone How to Earn a Featured Snippet [Infographic] Final ThoughtsThe Methodology of Our Featured Snippets Study Semrush and Brado analyzed what percentage of keywords generate featured snippets in the Organic Research database (covering 46.1 million keywords on mobile, and 160 million keywords on desktop in the U.S.).To focus the research, we isolated and studied mobile data for 2 main reasons: The share of mobile search traffic is only growing and Google knows it; and We revealed that approximately 79% of SERPs have the same domains in featured snippets on both desktop and mobile in these data. We then took a subset of 1 million random SERPs with featured snippets, and analyzed it to uncover patterns and insights that will help us all create better optimized content for earning featured snippets.Key Takeaways of the StudyBefore we get into the grit of it, here’s a quick summary of our key findings:What are Featured Snippets and Why do They Matter?What is a Featured Snippet?A featured snippet is a dedicated section of selected content located at or near the top of a Google SERP. It features text or video from a website that aims to directly answer the search query. The viewer can click on the answer in the featured snippet to learn more on the website itself.Example of a Featured SnippetWhy do Featured Snippets Matter?Featured snippets put your website at the top of the SERP and make it much more clickable, whether on mobile or desktop (91% of the keywords in our dataset had featured snippets on both). Their prominence in Google can be an indicator of brand authority, which can bode well for the way users see you, too.On mobile screens, in particular, featured snippets tend to take up 50% or more of the screenWe tested it on 10,000 SERPs scaled to iPhone X and Google Pixel screen sizes. This means that when you earn a featured snippet, you are pushing competitors off the initial screen entirely, which can be a huge competitive advantage.What’s interesting is our study found that:Featured snippets appear more often for keywords that indicate specific intent at a certain point in the sales funnel, such as long-tail keywordsSo brands can try to attract visitors that are more likely to become customers.A dog food brand, for instance, might optimize content for the search term “what are the most important ingredients in puppy dog food?” and attract interested searchers as a result. With the right combination of informative content, user experience and calls-to-action amongst other things, they might well nudge such a user towards a conversion. The Benefits of Featured SnippetsAs well as appearing at the top of SERPs, there are a few benefits of owning featured snippets: Audience behavior insights: They might give you the opportunity to learn more about the objectives of your visitors by showing you what they do when they land on your content; Higher brand authority: Both Google and viewers might consider your website to have more relevant information written by experts; Higher click-through rate (CTR): This varies based on the content of the featured snippets, but generally speaking, your CTR could benefit from having more eyes on your entry in a SERP. The Featured Snippet LandscapeThe baseline is that around 19% of keywords in Google have a featured snippet. They show up way more often with long-tail queries or questions (the proofs are below, in “How to earn Featured Snippets” section), which is what people generally use when they type a query into Google, so the opportunities they present are significant.What is the Featured Snippet’s Position on the SERP? The featured snippet is in the first organic position 99% of the time — literally. There’s a 0.7% chance the snippet will be second, and an even slighter chance it will be in positions 3-8.Those figures can change if the SERP has more than a single featured snippet. In our subset, 7.3% of SERPs have 2 featured snippets stacked together — double featured snippets. Remarkably, 99.9987% of them are in the first position and 0.0013% are in third.Example of a double featured snippetDo Featured Snippets Differ by Keyword Categories (Industries)?In this particular dataset, we found that featured snippets are more common in some industries than others:Roughly 62% of SERPs in Travel and Computer & Electonics have a featured snippet, whilst keywords about real estate only have them 11% of the time.That said, keyword categories and domain categories are not the same thing; they need to be considered together. Health, for example, might have come out 13th in the list above, but, as you will see below, domains within the health category actually had the most featured snippets.Popular Domains Earning Featured SnippetsSome of the most popular domains earning featured snippets weren’t surprising at all. Leading the pack by a long shot was Wikipedia, which is in the Reference category. In our subset, it had 2.77% of the featured snippets.The top 10 domains for featured snippets in our dataset were: Wikipedia Quora Pinterest Healthline Amazon YouTube Reddit WebMD NIH (The National Institutes of Health in the US) Fandom These huge domains might dominate the featured snippets landscape, but it’s possible for any domain to earn one. Here’s a look at the categories of the domains that generated the most featured snippets in our research:What are the Different Types of Featured Snippets?On average in our dataset, there were 4 kinds of featured snippets: paragraphs, lists, tables, and videos. Paragraphs were the most common with 70% of the results, while videos accounted for only 4.6%. Important Note: You might have noticed the averages above, e.g. 6 items per list, 5 rows per table, but it’s important to remember that this is not a hard-and-fast rule. As always, concentrate on quality and not quantity in your area of expertise.Google will typically display a blue ‘More Items’ link when it cuts content short. This link tells the user there is additional information, and it may help improve your CTR (versus including all of your information in the featured snippet).How to Earn Featured SnippetsThe featured snippet game is all about strategy. In order to rank for featured snippets, you need to format your website content to win them. Even if you write content based on a query that already has a featured snippet in its SERP, you still have a chance to replace the current snippet with a new one: yours.Based on our study, here’s a rundown of the main on-page SEO elements you need to consider in order to be in the running for (and win) a featured snippet:Choose Your KeywordsLet’s say you’re a farm and you want to teach consumers how to select the best fruit. You’re not going to have much luck going after the keyword “apple” alone, so it is crucial to be strategic and choose your keywords wisely.This is where featured snippets can help you. The more words in the query, the higher the chance of the SERP returning a featured snippet, according to our data: Of keywords made up of a single word, only 4.3% had a featured snippet; Of keywords made up of 5 words, 17% had a featured snippet; and Of keywords made up of 10 words, 55.5% had a featured snippetThe best way to increase the length of your keywords is to consider the questions your audience is asking about your products and/or services. Longer queries can often reveal intent, too, as they tend to be much more specific than shorter ones.You can earn a featured snippet for shorter keywords like “ripe apple” (and someone has), but you will likely have better luck and see more visitors in a certain part of the sales funnel when you get a featured snippet for a more specific keyword. You might, for instance, provide an authoritative answer to the question “how do I choose a ripe apple?” and get a featured snippet as a result, which could lead to more valuable visitors because of the suggested intention behind the query — they could be closer to the point of purchase.Leverage the Power of QuestionsGone are the days when Google users threw every potential keyword into the search box and hoped for the best. Google and other search engines have become portals for every question under the sun, and featured snippets pop up fairly often depending on the kind of question that’s asked.In our dataset, 29% of keywords that triggered a featured snippet started with a question-based word, such as “why,” “do,” and “can.” Here are the top queries that result in featured snippets: 77.6% of questions that start with “why”; and 72.4% of queries that start with “can”. Questions beginning with “where” trigger featured snippets least often at only 18.6%. This is probably due to the fact that Google defaults to another search feature, such as Local Pack or Map, when the word “where” is used.Semrush’s Keyword Magic Tool did a lot of the heavy lifting here, as it finds all possible relevant questions and long-tail keywords.Once you have your questions based on your related keywords, it’s time to start creating a content plan. You can answer multiple questions in one article, or have a series of articles based on the questions surrounding a specific keyword. However, make sure you keep the user intent in mind and avoid putting all your eggs into one basket.Use Topic Research to streamline your content creation process and SEO Writing Assistant to help you create optimized, search-engine-friendly content that, where necessary, is geared towards earning featured snippets.Format for a Featured SnippetThe type of featured snippet you could earn will likely be easy to figure out. If you recall from earlier, your 4 featured snippet formats are: paragraph, list, table, and video.As you write and use these formats naturally within your content, consider the data listed above for each type.Try to be as succinct as possible whilst sticking to roughly 40-50 words or 250-300 characters(but don’t use that as an everlasting rule).Writing with a featured snippet in mind helps users, too, especially if they are speed-readers. For the readers who love more depth, your subsequent paragraphs can add examples, humor, or whatever else you’d like to include after the definition written for the featured snippet.Images in Featured SnippetsWhen you insert images, be aware that those included in featured snippets aren’t always taken from your content. Google uses the Images algorithm to load the image separately, so sometimes it’s a crapshoot, but there are some things you can do to prevent this.For instance,The average graphic in a featured snippet is 159 pixels tall and 197 pixels wide, so basically 160 x 200px. Try to keep that ratio with your own images.If Google uses them in featured snippets, it will create thumbnails, so you can scale up to 960 x 1200px for better quality if you like.Date Your ContentMany websites refrain from putting dates on their posts in order to appear relevant for as long as possible, but this isn’t always user-friendly, for example, if the reader needs to know for research purposes.Dated content actually shows up regularly in featured snippets. Among the different types of featured snippets, here are the percentages of those that included a date: Paragraph: 44% List: 47% Table: 19% Video: 20% We checked our subset to see whether or not the date made a difference, and it turned out that, whilst more recent content was favored, older articles won the featured snippet if they provided the best answer. About 1% of featured snippet content was less than a week old, and sometimes a featured snippet’s content was only several hours old.The vast majority of featured snippets, though, were from content posted within the past 2-3 years; 70% of featured snippets in our subset were from 2018, 2019, and 2020. The argument for and against putting dates on content isn’t going away any time soon, but the arguments for are pretty strong: Dating your content is best for the reader because it reduces confusion and frustration; Dated content builds trust, especially when it shows that it’s been updated with current information; Algorithms may show preference based on fresh content; and There might be a recency bias in the click-through rate. My advice: date your content. Monitor pages that are doing well — whether that’s based on click-throughs, engagement, conversions, or another metric — and, once they begin to stagnate, update them. Refresh and re-optimize your content, and make sure your statistics are always current. Let readers know the original publication date and when it was updated. You may earn a featured snippet and boost your metrics without having to invest in an entirely new piece of content.Use Subfolders WiselySubfolders are listed after forward slashes in the URL, as follows: domain.com is the root domain. It has zero subfolders; domain.com/subfolder has one subfolder; and domain.com/subfolder1/subfolder2 has two subfolders. According to our research, a very long URL is less likely to get a featured snippet, so 1-3 subfolders is the sweet spotImagine all your content printed out. Maybe you have 100 different pieces of content, and you want to keep them organized. To find specific pieces quickly, you wouldn’t just throw them all into one folder called “blog.” You’d create folders for different keywords to keep everything organized, right?A clear, intuitive subfolder architecture organizes your site’s content and sets you up for possible featured snippets, for example: domain.com/main-topic/subtopic-a/ domain.com/main-topic/subtopic-b/ domain.com/main-topic/subtopic-c/Build Featured Snippet HubsWhat is a Featured Snippet Hub?A content hub is created when you use subfolders to organize your pages by specific keywords. For example, if you’re a software company that offers platforms for different departments, you could have a marketing content hub, a sales hub, a customer service hub, and more.The idea here is to take one piece of content (text or video) from a selected subfolder and turn it into a featured snippet hub, which is essentially any URL or video that earns 10 or more featured snippets. The Anatomy of a Featured Snippet Hub URLYou can create a featured snippet hub by answering multiple questions in a single piece of content, and presenting the information in as many ways as possible: quick paragraphs, lists, tables, videos, and more. There are 3 main benefits of this strategy; you can: Earn multiple featured snippets; Make the content easy to scan; and Keep the reader interested with easily digestible information (and not walls of text). Featured snippet hubs, on average, contain 1,100 or more words and take about 5 minutes to read. To help readers benefit from an article quickly, featured snippet hubs have an average of 14.5 headlines, which, in our research, included H1, H2, and H3 tags.They have images, too, with the average featured snippet hub containing 8 images scattered throughout the content. Here’s the kicker: all these images have alt tags for further optimization.Content Can’t Stand AloneTo earn a featured snippet, content has to be strategic. It starts with keywords with clear search intent, expands with content your audience finds valuable, and gains momentum when it’s optimized for search engines.This takes effort, but there are a number of tools that help smoothen the process: Position tracking in Semrush includes a helpful featured snippet report. This report shows you the featured snippets you’ve earned, any featured snippets you’ve lost, and which keywords started or stopped triggering featured snippets in your location; Additionally, Semrush’s Organic Research reports help you find featured snippet opportunities, whether or not there’s already a featured snippet on that SERP. You may already rank well for certain keywords, and, with some tweaks and updates, you could earn the featured snippet for them, too. If a competitor already has the featured snippet, this report shows you how so you can analyze their content — and then try to beat it. How to Earn a Featured Snippet [Infographic]Here, we have a step-by-step guide to earning featured snippets, as well as the link to the extended Featured Snippet stats (below) to use as a cheat sheet when you want to publish content fit for featured snippets:Looking for more helpful tips? Check out some of these resources: Download \"How to get a featured snippet\" guide Download the cheat sheet to create content fit for featured snippets Final ThoughtsFeatured snippets, much like almost every other Google feature, will continue to evolve. It can be both exciting and rewarding to research and uncover new ways to leverage them to improve the SERPs for everyone.If you have your own insights into featured snippets to share, or you have anything to say about the Semrush and Brado research here, I’d love to hear about it on Twitter. I’ll also share more information on the upcoming webinar, join our discussion!",
  "headers": [
    {
      "level": "H1",
      "text": "How To Optimize for Google Featured Snippets [Research]"
    },
    {
      "level": "H2",
      "text": "The Methodology of Our Featured Snippets Study"
    },
    {
      "level": "H2",
      "text": "Key Takeaways of the Study"
    },
    {
      "level": "H2",
      "text": "What are Featured Snippets and Why do They Matter?"
    },
    {
      "level": "H3",
      "text": "What is a Featured Snippet?"
    },
    {
      "level": "H3",
      "text": "Example of a Featured Snippet"
    },
    {
      "level": "H3",
      "text": "Why do Featured Snippets Matter?"
    },
    {
      "level": "H4",
      "text": "The Benefits of Featured Snippets"
    },
    {
      "level": "H2",
      "text": "The Featured Snippet Landscape"
    },
    {
      "level": "H3",
      "text": "What is the Featured Snippet’s Position on the SERP?"
    },
    {
      "level": "H4",
      "text": "Example of a double featured snippet"
    },
    {
      "level": "H3",
      "text": "Do Featured Snippets Differ by Keyword Categories (Industries)?"
    },
    {
      "level": "H3",
      "text": "Popular Domains Earning Featured Snippets"
    },
    {
      "level": "H3",
      "text": "What are the Different Types of Featured Snippets?"
    },
    {
      "level": "H2",
      "text": "How to Earn Featured Snippets"
    },
    {
      "level": "H3",
      "text": "Choose Your Keywords"
    },
    {
      "level": "H3",
      "text": "Leverage the Power of Questions"
    },
    {
      "level": "H3",
      "text": "Format for a Featured Snippet"
    },
    {
      "level": "H3",
      "text": "Date Your Content"
    },
    {
      "level": "H3",
      "text": "Use Subfolders Wisely"
    },
    {
      "level": "H3",
      "text": "Build Featured Snippet Hubs"
    },
    {
      "level": "H4",
      "text": "What is a Featured Snippet Hub?"
    },
    {
      "level": "H4",
      "text": "The Anatomy of a Featured Snippet Hub URL"
    },
    {
      "level": "H3",
      "text": "Content Can’t Stand Alone"
    },
    {
      "level": "H2",
      "text": "How to Earn a Featured Snippet [Infographic]"
    },
    {
      "level": "H2",
      "text": "Final Thoughts"
    },
    {
      "level": "H6",
      "text": "Most popular pages"
    },
    {
      "level": "H6",
      "text": "SEO Checklist: 41 Tips to Optimize Your Website"
    },
    {
      "level": "H6",
      "text": "How to Perform a Complete SEO Audit (in 14 Steps)"
    },
    {
      "level": "H6",
      "text": "A Beginner’s Guide to Keyword Search Volume"
    }
  ],
  "author": ""
}