{
  "url": "https://www.semrush.com/blog/find-products-to-sell-on-amazon/",
  "slug": "find-products-to-sell-on-amazon",
  "title": "How to Find Products to Sell on Amazon",
  "description": "If you’re just starting out, the key is simple: data and research.",
  "content": "Did you know the majority of Amazon sales come from independent sellers? Joining them might seem simple enough—create your listing, make it look appealing, and wait for the sales to roll in, right?Well, not exactly. With nearly 2 million active sellers on Amazon, it’s a competitive space. But, just like in the traditional retail world, the key to success lies in picking the right products to sell in the first place. And this is where many sellers get tripped up.So, how do you find products that are going to sell on Amazon and bring in the cash? Many beginners make some common mistakes like: Relying on anecdotal evidence (\"I’ve seen this product trending lately on Amazon.\") Trusting their gut (\"This item feels like the next big thing.\") Chasing global trends (\"Everyone’s talking about this new Lego collaboration, so I should sell something similar.\")While these approaches might seem like good ideas, they aren’t the best strategies for figuring out which products will actually succeed on Amazon.The Easiest Way for BeginnersIf you’re just starting out, the key is simple: data and research. Finding a winning product on Amazon requires digging into the numbers and analyzing the current market.It may sound tricky, but with the right tools and strategy, you can streamline the process of finding profitable products to sell. For example, you can use Product Research Pulse to gather data about a specific product’s estimated demand level, expenses, and profit.And even track estimated sales over a given period of time.Let’s dive in to everything you need to know about this process. What is Amazon Product Research?In a nutshell, Amazon product research is the process of identifying products to sell on Amazon that will generate profit. It’s all about finding items with high demand and low competition.While some sellers wing it and hope for the best, you can go the smart route and base your decisions on real data. This means you’ll be validating your ideas before you even think about spending money.When done correctly, Amazon product research helps you uncover products with low costs, a wide potential customer base, and limited competition.Finding the Best Products to Sell on AmazonTo get a clear idea of what’s selling well, tools like Product Research Pulse can be a game changer. This tool gives you an overview of what’s hot right now on Amazon, helping you spot items that could be your next best-seller.The idea is to use data to craft a strategy that identifies winning products you can confidently add to your store.What Makes a Winning Product?Before diving into research, let’s break down the criteria that make for a great product to sell on Amazon. 1. High DemandThere’s no point in selling something no one is searching for. As a rule of thumb, you can start by looking for products that have the potential to generate at least 10 sales a day. 2. Low CompetitionEven if an item is in demand, you’ll have a tough time standing out if the market is flooded with competitors. Fewer sellers mean better chances of landing those top search results, especially if you’re a new seller.3. Mid-range PricingProducts priced between $10 and $50 tend to hit the sweet spot. If you’re just starting out, avoid high-priced items because you likely don’t have the brand reputation to charge premium rates. But don’t go too cheap either—products under $10 leave little room for profit after Amazon’s fees.4. Low Competitor ReviewsIf a competing product doesn’t have many reviews, it might be easier to surpass it in the rankings. Reviews are a key part of Amazon’s algorithm, so this is a useful factor to consider.5. Non-branded or White Label ProductsIt’s tough to compete with major brands, so try starting with products that aren’t dominated by well-known names. Look for generic or white-label options to increase your chances of success.6. Lightweight and CompactIf you’re sourcing from overseas (like China), shipping costs can add up fast. Look for products that are lightweight (under 3 pounds) and easy to ship to keep costs down. Fragile items are also best avoided due to the risk of damage during transit.Before finalizing your product choice, make sure it isn’t on Amazon’s restricted list. If it’s not, you might’ve found your golden ticket.A Real Story of Finding a Winning ProductHere’s a cool story from Quin Amorim, CEO of Prolific Zone, who shared his experience with finding a surprise hit product on Amazon.In 2016, Quin was managing an account for a pharmaceutical company that sold cold and flu medicine. While doing keyword research, he stumbled across a totally unrelated product—a portable wooden table tray. Here’s his first-hand experience with discovering a winning product:“Over the years, I sourced hundreds of products, but this particular product was an adrenaline rush from start to finish.The whole process was different than any other product sourced to date, and to be honest it was a combination of luck, out-of-the-box thinking, and the right timing.This was late 2016, after Amazon had removed the option to offer a product in exchange for a review.I was managing a Vendor Central account for a pharma company that had one of the most well-known OTC drugs in North America, and they were unhappy with Vendor, so we decided to move a cold & flu medicine to Seller Central, and do FBA. While doing keyword research, we found a search term that was not even closely related to the product, but it popped up constantly - we ranked high for one portable wooden table/tray.Not only that, but after a while, the tray showed up within the “frequently bought together” space.Our conclusion was that people who were sick with cold and flu liked to have their meals served to them in bed or on the couch, so a loved one would order these trays.We researched the demand, checked out the competition (at the time there were only a handful of sellers), and realized it was oversized by a couple of inches. We sent a simple inquiry to the manufacturer, who said he could downsize the exact same tray by 2\". This helped us take the product out of the oversized category and save $4 per unit in FBA fees!I'm happy to say the first \"test order\" was 600 units, and they all sold in 5 days. By February 2017, we had the highest daily sales, with a casino ordering 1900 units in one day to offer trays to their guests for Valentine’s Day.All thanks to keyword research for an over-the-counter drug”.12 Ways to Figure Out What to Sell on AmazonReady to start finding your own winning products? Here are 12 ways to get started: Browse Amazon’s Best-Sellers: Check out Amazon’s best-sellers list in different categories to see what’s consistently in demand. Look at Trending and Most Wished-For Products: Check Amazon’s trending and wish list sections to gauge customer interest. Analyze Top Sellers: Study what top sellers in your niche are offering to see what’s working for them. Go to Amazon’s Best Sellers, choose your category, and take note of the top items. Then, check the “Customers Also Bought” section for additional ideas. Follow Amazon Affiliates: Affiliates only promote high-converting products, so checking out what they’re pushing can give you ideas. Check Profitability: Use tools like Amazon’s FBA calculator or Product Research Pulse’s Sales Estimator to ensure your chosen product will generate profit after fees. Avoid Big Brand Territory: Stay clear of products dominated by large, well-known brands. Find Market Gaps: Look for areas where there’s demand but little competition. One place to look: customer reviews. Customer reviews on Amazon can tell you what people love or hate about existing products, revealing potential gaps you can fill. Look for Low-Competition Products: Focus on niches with fewer sellers for easier market entry. Read Customer Reviews: Dig through customer reviews to spot opportunities for product improvements. Size Matters: Smaller, lightweight products are easier and cheaper to ship. Refill-Based Products: Items that need regular refills (like toiletries) create repeat customers. Use Research Tools: Simplify the process with Amazon product research tools to find profitable products faster. With a free Semrush account, you can test out Product Research Pulse.Product Research Pulse: Competitive Data for Amazon SellersThis app can help you find profitable products to sell on not only Amazon, but also Walmart and eBay. The best part? It’s available to try with a free 7-day trial. After that, it’s just $2.99 a month.Once inside, you can use several features to choose how you want to analyze products and sellers on Amazon. Let’s take a look at a few. Single Product AnalysisSearch for a product using its identifier (ASIN, UPC, EAN, etc.) and get detailed insights, like sales estimates, expenses (shipping, fees), and profitability.For Amazon, input an ASIN to quickly see how much profit you could make, factoring in Amazon's fees and shipping costs. You can also analyze demand trends in different markets like eBay or Walmart, providing a more comprehensive picture.Sales EstimatorThis feature estimates sales data, like how much revenue a product or seller has generated based on its category and rank, or ASIN.Use it to track competitors and gauge the potential profitability of a product before jumping in. This can give you a competitive edge by knowing who the top sellers are and how much they are making.Discover Products by Keywords or CategoriesYou can identify trending products based on keyword searches or product categories and sort them by criteria like price and best seller rank.Sort by best seller rank to identify relevant products that are currently selling the most. Product Research Pulse will then recommend specific products based on demand levels, making it easier for you to spot opportunities.Bulk Product AnalysisIf you have a list of potential products, you can upload them in bulk to analyze them all at once, saving time.Gather multiple product ideas, and use the multi product analysis feature to compare profitability, competition, and demand for all items at once, speeding up decision-making.Tracking Competitor StoresProduct Research Pulse also lets you analyze entire ecommerce stores to see how they are performing.Identify and monitor top sellers in your niche to see the top selling products. With this information, you can adjust your strategy accordingly.It’s a great way to uncover profitable products, track competition, and estimate your potential returns, all from one platform​.Taking a Data-Driven ApproachAmazon product research might seem overwhelming at first, but with the right tools and strategy, it’s totally doable. All you need is to take a data-driven approach to uncover profitable products and turn your Amazon store into a money-making machine.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Find Products to Sell on Amazon"
    },
    {
      "level": "H2",
      "text": "The Easiest Way for Beginners"
    },
    {
      "level": "H2",
      "text": "What is Amazon Product Research?"
    },
    {
      "level": "H2",
      "text": "Finding the Best Products to Sell on Amazon"
    },
    {
      "level": "H3",
      "text": "What Makes a Winning Product?"
    },
    {
      "level": "H4",
      "text": "1. High Demand"
    },
    {
      "level": "H4",
      "text": "2. Low Competition"
    },
    {
      "level": "H4",
      "text": "3. Mid-range Pricing"
    },
    {
      "level": "H4",
      "text": "4. Low Competitor Reviews"
    },
    {
      "level": "H4",
      "text": "5. Non-branded or White Label Products"
    },
    {
      "level": "H4",
      "text": "6. Lightweight and Compact"
    },
    {
      "level": "H3",
      "text": "A Real Story of Finding a Winning Product"
    },
    {
      "level": "H2",
      "text": "12 Ways to Figure Out What to Sell on Amazon"
    },
    {
      "level": "H2",
      "text": "Product Research Pulse: Competitive Data for Amazon Sellers"
    },
    {
      "level": "H3",
      "text": "Single Product Analysis"
    },
    {
      "level": "H3",
      "text": "Sales Estimator"
    },
    {
      "level": "H3",
      "text": "Discover Products by Keywords or Categories"
    },
    {
      "level": "H3",
      "text": "Bulk Product Analysis"
    },
    {
      "level": "H3",
      "text": "Tracking Competitor Stores"
    },
    {
      "level": "H3",
      "text": "Taking a Data-Driven Approach"
    }
  ],
  "author": ""
}