{
  "url": "https://www.semrush.com/blog/get-to-top-local-positions-on-all-devices/",
  "slug": "get-to-top-local-positions-on-all-devices",
  "title": "5 Steps for Improving Your Local SEO",
  "description": "Improve your local SEO in 5 steps. Learn how to track local keywords, local packs, unify listings, and manage Google Business Profile.",
  "content": "For a local business, it can be hard to compete with the big names online, but if you are strategic in your approach and have the right tools, you can easily improve your local SEO performance by growing the visibility of your brand and thus increase your sales.Here are the five steps that can help with local SEO: Unify Your Business Listings How to Use Listing Management Track Your Local Positions How to Set Up Position Tracking How to Set up Local Heatmap in Listing Management Manage Google Business Profile Managing Your Online Ratings and Reviews Adding GBP Posts with Social Media Poster Optimize Your Website for Mobile Find Local Content Ideas and Build Links ConclusionIf you want to start with some of the basics of local SEO, head to our guide: What is Local SEO? Unify Your Business ListingsLet’s start with a simple yet important thing that a lot of business owners ignore — Digital Knowledge Management.What is digital knowledge?Digital knowledge refers to the public facts about a business that can be found online. This includes location-specific information like name, address, and phone number (also known as NAP data), along with more complex information like hours of operation, and whether or not you are pet-friendly.Since this information appears not only on your own website, but also across Google Business Profile, Facebook, Yelp, TripAdvisor, Apple Maps, Yahoo, Bing, and the rest of the search ecosystem, it is important to make sure this info is unified.It is not enough to simply put the facts about your business on your own website — you need to make sure that information is correct and consistent across the various apps, maps, social networks, voice assistants, directories, and other services that consumers are using to search and find info.Why is digital knowledge important for SEO?When the facts about your business appear consistently across a lot of sources, search engines and consumers both trust the information more. Higher trust leads to higher local search ranking and can eventually bring an audience of eager and ready-to-buy customers to your doorstep.The key is to have consistent information in each business listing and keep it updated. However, this can take a lot of time to do manually, especially if your business has more than one location. Also, many online maps, apps, and directories are constantly crawling for the most up-to-date information, which means you might find the listings you’ve just updated have reverted to incorrect information. This can become a tedious and frustrating cycle.To address the issues a local business may face, we created the Listing Management tool. How to Use Listing ManagementTo use our local business listing service, simply enter your business information once and Semrush will make sure all of your details are distributed and unified across every citation.To start, just enter your business information:Click Check listings and see all your listings and the status of each:The Listing Management tool harnesses Yext’s Knowledge Network to publish data across all the most popular directories and intelligent services — including Facebook, Google, Yelp, Foursquare, TripAdvisor, Apple Maps, Yahoo, Bing, and many more. With Amazon Alexa as a part of the Knowledge Network, you can now ensure Alexa has the most up-to-date information about your business and reach people that are searching with their voice from the comfort of their homes. In addition to managing your business citations, this tool has a few more functions that will help your local SEO such as review management and position tracking, which we’ll cover later in this post.Track Your Local PositionsIn order to know how well you’re doing, you’ll need to set up tracking, which can be done in two main ways. 1. The Position Tracking tool can track your website’s rankings for a custom set of target keywords in a target location and show you how well you’re competing for special results like the local pack and SERP Features. The data is collected daily, so you are getting the freshest information.2. With a Premium location enabled in Listing Management, you can also track your positions in Google’s Local Finder for up to five target keywords and up to three different zip codes. More on that below, first let’s go over Position Tracking.How to Set Up Position TrackingWhen configuring Position Tracking for your website, you can choose to track any subdomain, URL, or subfolder and then choose your target area - city, state, or even zip-code specific.On the first step of the setup, pay close attention to the input form for the business name:Insert the name of your company exactly as it appears on Google Business Profile, and Semrush will be able to track how you compete in the local map packs. Pay attention to the case sensitivity (e.g., if it is “Best Pizza” in the Google directory, “best pizza” won’t do here).This way you will be able to see if you appear in Local packs, even if they don’t have a link to your website.The second step of the setup is crucial for local SEO — choosing the device and location you want to target:Position Tracking allows you to target the location by the ZIP code, which means that your targeting can go deeper than at a city level. Your visibility and appearance in Local packs are about proximity, so monitoring and managing your search engine performance for your exact location is extremely beneficial. As well as this, focusing on your local queries will spare you the work, and will save you time and money.To finish setup you need to add your keywords, and, optionally, your competitors. Let the tool gather keyword data and get to work.Another very useful feature of the Position Tracking tool is filtering by SERP features.Let’s take a look at Local packs. Filter the words that you don’t rank for:Now you have the list of keywords you need to work on:Another important SERP feature that you need for your website is Reviews. Stars on your snippets are advantageous as they are eye-catching.The workflow of finding keywords that trigger reviews is the same as filtering for Local packs. But there is a technical nuance in acquiring it — you will need to add a special markup on the pages of your website.How to Set up Local Heatmap in Listing ManagementGo to your locations list in Listing Management and select the Upgrade location button.Then, you’ll be able to add up to five keywords that you want to track your positions for in Google’s Local Finder. Once you add your target keywords, you’ll be able to view positions in a heatmap that looks like this:Each bubble on the map represents a specific latitude and longitude where searchers may see a new order of local results for their query. Use this to understand specifically where your business is getting more visibility and facing tougher competition in your immediate surrounding area.Manage Google Business ProfileGoogle Business Profile (GBP) is often the first impression that people get for your business and brand; it cannot be ignored. It dramatically affects your visibility on the Local Pack feature, Google Maps, and organic rankings.If you haven’t created and verified your GBP profile yet, you can do it right now. Just input your business information and follow instructions, while avoiding these GBP mistakes.Within Semrush, you can upload pictures, update your address and opening hours, and create posts for your GBP listing through the use of the Listing Management tool and Social Media Poster tool.Here’s what you’ll see in Listing Management to connect your account:In addition to Facebook, Twitter, and Instagram, you can upload your pictures, business logo, and videos directly to GBP from this interface. Just select your location and click on Edit info.Then find your GBP account to upload information and pictures.Managing Your Online Ratings and ReviewsTracking your ratings and reviews from all business listings in one place can also be done with the Listing Management tool.Reviews can be a great source of feedback for you and insight on customers’ decision-making.Be sure to constantly check your ratings and learn how to respond to Google reviews promptly.. Even the negative comments can work in your favor if handled the right way. Note: If you upgrade one of your locations in Listing Management to a Premium location, you will be able to respond to your reviews on GBP and Facebook directly from within Semrush. Here’s how the review management system looks in the tool: Adding GBP Posts with Social Media PosterIn Semrush’s Social Media Poster, you can manage a content calendar of posts across multiple social channels from one place. On GBP, you can create and schedule events, special offers, or important announcements in GBP, so your customers are always updated with your activities.Once it is created and scheduled, the tool will automatically upload the posts by the due date.Please note: scheduling to Google Business Profile from Social Media Poster is available with a Guru or Business subscription to Semrush. Optimize Your Website for MobileSince a lot of people search for local businesses on the go, it’s critical that you provide a good mobile experience on your website.Ever since Google rolled out mobile-first indexing, optimizing a website for the mobile experience has become more important than ever. Some basic ways to optimize for mobile are: Making sure your site is responsive to mobile screens Having your pages load quickly Ensuring the mobile site is easy to navigate Offering high-quality pictures and short descriptions of your business/service As always, you should follow Google’s guidelines for creating a mobile-friendly website.Checking Your Mobile Site Health with Site AuditWhether you implement a responsive or adaptive design, you should set up the Site Audit tool to check on your website’s health.To make sure you’re crawling the mobile site, just select the mobile user agent in step 2 of the setup process.This way our crawler will go through the mobile version of your website.Once the crawl is finished (it should only take a few minutes), you can assess your website’s Site Health score and identify the biggest issues threatening its visibility and user experience. Glance at the Thematic Scores, and review your top issues:When you sort out critical errors, go back to thematic reports.Start with Crawlability — you want all of the essential pages of your website to be accessible to people and search engines in order to be indexed.Then move to the Performance report — page load speed always matters and is especially significant for the mobile experience. The Internal Linking report is about the informational architecture of your website — you want your users to get the information they need in the fewest possible number of clicks. Structuring your website correctly will also help its rankings by evenly spreading the link juice.The HTTPS report assesses how secure your website is, which nowadays is vital for every website, not just the ones dealing with sensitive information.Finally, the International SEO report is a must for businesses with multilingual websites — hreflang implementation is a very tricky business.Maintaining a healthy website is an ongoing process, but for now, let’s move on to the visibility of your website.Find Local Content Ideas and Build LinksAs a local website, you can still follow the same steps as any site in order to grow your visibility through SEO. Start by finding topics that you can create new content or optimize your existing pages around, and then seek to build backlinks to this new content. Find new ideas for new content to put on your website with our Topic Research Tool. This tool is a powerhouse of idea generation - just set your target location and enter the topic related to your website or service. Then, you can find tons of ideas for blog posts, FAQs, and trending topics to cover on your website/marketing plan.Read more about using the Topic Research tool here. A quick tip: To create new content and make sure it is optimized for search as you write, check out our SEO Content Template and SEO Writing Assistant tools. Lastly, to gain more backlinks, you can start by setting up a campaign with the Link Building Tool. This tool asks you to provide either your target keywords or top competitors to base their recommendations off on. After the setup process is done, it will give you a huge list of prospective sites that you could reach out to in the hopes of acquiring a link to your site. In your list of prospects, you’ll likely find local blogs, media sites, and related sites that are talking about other websites in your niche. Some more link building strategies that could work for a local site include: Reaching out to the local websites that write local news, cover local businesses, and host local blogs. Offering your product or service to a local blogger/review site in exchange for a backlink to your site. Giving to your local community by sponsoring charities or local organizations which can lead to backlinks. Finding your competitor’s broken backlinks. Finding unlinked mentions of your local business. Offering a scholarship program for your employees to build links from educational sites. For our full guide on Link Building, read Link Building for SEO: Which Strategies Work in 2020 (And Which Don’t). ConclusionSEO is a marathon, not a sprint. So don’t be discouraged if you don’t see immediate results. However, if you follow the steps above, you should definitely start to see your local visibility improve over time. Feel free to reach out to us at any time if you have any questions about using our tools in your local SEO journey. 5 Steps for Improving local SEO",
  "headers": [
    {
      "level": "H1",
      "text": "How To Improve Your Local SEO in 5 Steps"
    },
    {
      "level": "H2",
      "text": "Unify Your Business Listings"
    },
    {
      "level": "H3",
      "text": "How to Use Listing Management"
    },
    {
      "level": "H2",
      "text": "Track Your Local Positions"
    },
    {
      "level": "H3",
      "text": "How to Set Up Position Tracking"
    },
    {
      "level": "H3",
      "text": "How to Set up Local Heatmap in Listing Management"
    },
    {
      "level": "H2",
      "text": "Manage Google Business Profile"
    },
    {
      "level": "H3",
      "text": "Managing Your Online Ratings and Reviews"
    },
    {
      "level": "H3",
      "text": "Adding GBP Posts with Social Media Poster"
    },
    {
      "level": "H2",
      "text": "Optimize Your Website for Mobile"
    },
    {
      "level": "H2",
      "text": "Find Local Content Ideas and Build Links"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H6",
      "text": "Most popular pages"
    },
    {
      "level": "H6",
      "text": "SEO Checklist: 41 Tips to Optimize Your Website"
    },
    {
      "level": "H6",
      "text": "How to Perform a Complete SEO Audit (in 14 Steps)"
    },
    {
      "level": "H6",
      "text": "A Beginner’s Guide to Keyword Search Volume"
    }
  ],
  "author": ""
}