{
  "url": "https://www.semrush.com/blog/google-knowledge-panel/",
  "slug": "google-knowledge-panel",
  "title": "Google Knowledge Panel: What Is It & How to Get One",
  "description": "Knowledge panels show up in Google SERPs and can help you gain more visibility and engagement.",
  "content": "What Is a Google Knowledge Panel?A Google knowledge panel is a type of rich result that appears on the right side of the SERPs when people search for an entity, such as a person, place, organization, or thing. It provides a summary of information about the entity based on Google’s understanding of the topic and can include facts, images, links, and other relevant details to help users learn more. Here’s what a knowledge panel looks like:Google Business Profile (formerly Google My Business) boxes are not knowledge panels. They are business listings that contain information provided by the businesses. Like this:Further reading: What Are SERP Features? An In-Depth GuideWhy Are Google Knowledge Panels Important?Google knowledge panels are important for SEO because they can help you: Increase your visibility and authority on Google. Knowledge panels appear on the right side of the search results, which means they can attract more attention and clicks from users. They also show that Google recognizes your entity as relevant and trustworthy for the query Enhance your brand image and reputation. Knowledge panels can showcase your logo, social media profiles, website, and other information that can help users learn more about you and your business. They can also feature reviews, ratings, awards, and other positive signals that can boost your credibility and reputation Drive more traffic and conversions to your website. Knowledge panels can include direct links to your website, products, services, events, and other pages that can generate more traffic and leads for your business. They can also display rich snippets, such as FAQs, how-to guides, videos, and images, that can provide more value to users and increase their engagementNote: You can quickly see if any keywords trigger knowledge panels with the Keyword Magic tool’s advanced filters. How Does Google Generate Knowledge Panels?Knowledge panels are automatically generated and powered by information from Google’s Knowledge Graph (a database of millions of facts). Google has amassed these facts from materials shared across the web. And from databases like Wikipedia, Wikidata, Crunchbase, and LinkedIn.Google has a patent that talks specifically about knowledge panels. And it mentions the methodology for generating them. The overall process is complex, but we can simplify it into four simple steps.When a user searches for an entity, Google can do the following: Identify entities in the search query Select a knowledge panel template that matches the entity type Fill in placeholders in the knowledge panel template Merge search results and the knowledge panel in SERPsImages can also appear in knowledge panels, and Google picks them from different resources. For example, individuals who have claimed their knowledge panels can select a featured image. Images for other entities are a preview of Google Images results for the entity and are automatically sourced from across the web. Like this:Knowledge panels also update automatically. They can do so as information changes, directly from the entity in the panel, or from general user feedback. If you (or your business) are an entity in a knowledge panel, you can claim the knowledge panel and suggest changes. How to Get a Google Knowledge Panel You can’t directly apply for a knowledge panel. But you can do certain things to make it more likely for one to appear. Pick a Primary Entity Home PageThe first step is identifying the primary page that describes your entity. Some call this the “entity home” or “entity home page.” It’s simply the page where the entity “lives” in Google’s view. And where Google can go for information about you or the company.The entity’s home can be any page—as long as it only talks about you or the company. An SEO recommendation is to have your entity home page on a dedicated “about” page rather than the homepage.You also want that page on your site where you can control the information. Many sites will recommend creating a Wikipedia page. Having a Wikipedia page can be great for your business for many reasons. But you don’t want to have your entity home page on a site you don’t completely control.If you do, your knowledge panel will always be flaky, prone to errors, and liable to disappear.State as Many Facts as You CanOn the entity home page, state the facts you want Google to understand.Use multiple sections with simple descriptions and helpful, factual information. And add links to sources that talk about you or your company. The more trustworthy the source, the better. Then, add organization Schema.org markup (structured data vocabulary) to convey that same information in Google’s “native language.” Like this:<script type=\"application/ld+json\">{\"@context\": \"http://schema.org\", \"@type\": \"Corporation\", \"name\": \"Semrush\", \"description\": \"Semrush - online visibility management and content marketing SaaS platform\", \"logo\": \"https://cdn.semrush.com/__static__/semrush-logo-700.jpg\", \"email\": \"mailto:mail@semrush.com\", \"telephone\": \"+1-800-815-9959\", \"url\": \"https://www.semrush.com/\", }</script>You’re just reiterating what you say on the page in a way Google can easily digest. Further reading: Organization Schema: What It Is & How to Implement ItCorroborate the FactsIn this final step, your goal is to ensure the links you include in your entity home page contain factual information. The content on each of those links should corroborate exactly what you say. Each page should have the same (or similar) descriptions of you or your business. The key is consistency. The more Google sees the same information on sources they trust, the more confidence they have that the information is accurate. Better still, if every page you link to links back to the entity home, you create an infinite loop of self-confirming information with the page you control. How to Claim a Google Knowledge PanelIf you see a knowledge panel for your entity, you can claim it by getting verified on Google. Here’s how:Get Verified on GoogleStart by going to Google and searching for yourself or the entity you represent. Once you see the knowledge panel, click “Claim this knowledge panel” at the bottom. If you’re on a mobile device, locate the “About” section and tap “Claim this knowledge panel.” Like this:Then, sign in to one of the official sites or social profiles listed for the entity.For example, you can sign into YouTube, Google Search Console, Twitter, or Facebook. You'll be asked to provide additional information if Google can’t identify your entity home—like a government-issued ID or proof of your legal relationship with the entity. Add Users and Authorized RepresentativesOnce you’re verified, you can add other users as authorized representatives. Start by going to the “Manage users” page and clicking “Start now” under “Add people to this account.”Then, click “Add new user.” Enter the new user’s Gmail address. Now, toggle the different levels to grant the new user’s permissions—for example, Manager, Owner, or Contributor. Click “Invite,” and you’re all set.Manage User PermissionsYou (or any account manager) can remove or change a user’s permissions. To do this, go to the “Manage users” page again and click “Start now.” Then, click the “Menu” icon next to the user’s name you want to manage. And select an option like “Remove as manager,” “Remove user,” or “Transfer ownership.” How to Edit Your Google Knowledge PanelKnowledge panels are generated automatically and can’t be edited directly. What you can do, as a verified entity, is suggest changes. You can suggest changes to: Featured images Titles Subtitles Descriptions Social media profilesAnd others.To suggest a change, go to Google, search for the entity, and find the knowledge panel. Then, click “Suggest edits” above the title. Note: If you don’t see this option, you either haven’t been verified by Google or are signed in with a different account. Then, click on the information you want to suggest changes for. Like so:Note: If you have more than one suggested edit, submit feedback for each separately. Now, in the pop-up box, enter a short description, including the following: Your suggested change Why you believe Google should implement the change If possible, a URL that confirms your changesThen, click “Send.” Note: Anyone can suggest edits to a knowledge panel through the “Feedback” link at the bottom of the panel. Why Do Knowledge Panels Disappear?Google knowledge panels can disappear for a number of reasons. Let’s explore each one. Knowledge Graph UpdateGoogle updates the Knowledge Graph periodically. When they do, there’s a shake-up of information they accept as fact and, thus, a shake-up of knowledge panels. These updates are dangerous if your entity lacks an entity home and sufficient corroboration. You can use this Knowledge Graph sensor to track data refreshes and algorithm updates. You Lose Your Entity HomeWhether Google has recognized your entity home or not, they usually use a “foundation” source as a crutch ( i.e., Wikipedia, Twitter, LinkedIn, etc.). If Google loses that reference for any reason, it may drop the knowledge panel. For example, if Google relied on your Wikipedia article, and your Wikipedia article is deleted, you may lose the knowledge panel. Or if your “About” page suddenly disappears. Or if Google was relying on your Twitter account and you closed it.You can lose your knowledge panel in any of those cases. Human InterventionGoogle employees will sometimes delete knowledge panels. This can happen when the Google panel is perceived as untruthful, a duplicate, or spam. The first two are straightforward, so let’s talk about knowledge panel spam. Knowledge panel spam is when people trigger and manage knowledge panels with techniques that don’t comply with Google’s guidelines. Examples of knowledge panel spam can include paid pseudo-Wikis, self-created fandom sites, and mass press releases. There are more, but the rule of thumb is, “if you pay for it and it is quick and easy, it is probably spam.”Track Keywords That Trigger the Knowledge PanelAn SEO best practice is to track keywords that trigger SERP features, like the knowledge panel. One way to do that is to plug your URL into a tool like Organic Research and head to the “Positions” tab. Then, click the “SERP features” drop-down, hover over “Domain ranks,” and then click “Knowledge panel.”Like this:These are all the keywords for which your domain shows up in the Google knowledge panel. Now, add these keywords to a keyword list. Select them all and click the “Add to keyword list” button. Now, select “Create new empty list” and give your list a name. Perhaps something like “Knowledge Panel.”You can then find your new list in Keyword Strategy Builder. Open the tool, click on your list, and you’ll see detailed information about each keyword. Including monthly search volume, search trends, other SERP features, and more.Like so:You can also add other keywords to this list. For example, if not already on your list, we recommend adding keywords like “[Brand],” “about [Brand],” and “what is [Brand].” These tend to also trigger knowledge panels.To do so, click the “Add keywords” button.Then, add your keywords separated by commas or one per line. And click “Add keywords.”Keep an eye on the keywords on this list and make sure they keep triggering your knowledge panel. Click on the “SERP features” drop-down, select “Knowledge panel,” and click “Apply.” All your keywords should still show. If they don’t, take a look at your entity home and corroborative sources to see if anything has changed. And adjust accordingly. This post was updated in 2023. Excerpts from the original article by Jason Barnard may remain.",
  "headers": [
    {
      "level": "H1",
      "text": "Google Knowledge Panel: What Is It & How to Get One"
    },
    {
      "level": "H2",
      "text": "What Is a Google Knowledge Panel?"
    },
    {
      "level": "H2",
      "text": "Why Are Google Knowledge Panels Important?"
    },
    {
      "level": "H2",
      "text": "How Does Google Generate Knowledge Panels?"
    },
    {
      "level": "H2",
      "text": "How to Get a Google Knowledge Panel"
    },
    {
      "level": "H3",
      "text": "Pick a Primary Entity Home Page"
    },
    {
      "level": "H3",
      "text": "State as Many Facts as You Can"
    },
    {
      "level": "H3",
      "text": "Corroborate the Facts"
    },
    {
      "level": "H2",
      "text": "How to Claim a Google Knowledge Panel"
    },
    {
      "level": "H3",
      "text": "Get Verified on Google"
    },
    {
      "level": "H3",
      "text": "Add Users and Authorized Representatives"
    },
    {
      "level": "H3",
      "text": "Manage User Permissions"
    },
    {
      "level": "H2",
      "text": "How to Edit Your Google Knowledge Panel"
    },
    {
      "level": "H2",
      "text": "Why Do Knowledge Panels Disappear?"
    },
    {
      "level": "H3",
      "text": "Knowledge Graph Update"
    },
    {
      "level": "H3",
      "text": "You Lose Your Entity Home"
    },
    {
      "level": "H3",
      "text": "Human Intervention"
    },
    {
      "level": "H2",
      "text": "Track Keywords That Trigger the Knowledge Panel"
    }
  ],
  "author": ""
}