{
  "url": "https://www.semrush.com/blog/google-advanced-search/",
  "slug": "google-advanced-search",
  "title": "How to Use Google Advanced Search to Improve Your SEO",
  "description": "Unlock the power of Google Advanced Search and discover tips to optimize online visibility.",
  "content": "What Is Google Advanced Search?Google Advanced Search is a feature provided by Google that lets users refine their search results. Users can access advanced search through different search functions or search operators.Like this advanced search. This search only displays pages on Semrush’s site with the word “blogging” in the title. And only includes pages we published or updated within the past year.Advanced search can also help your search engine optimization efforts.Let’s explore different ways to use Google’s advanced search functionality. Along with advanced search operators to help you navigate the search results.How to Do an Advanced Search on GoogleGoogle has a few advanced search functions: Filters: Tools to filter websites, images, videos, shopping, news, maps, books, flights, and finance Advanced Search: An advanced search engine to narrow your results in Google’s search results Advanced Image Search: An advanced search engine to narrow your results in Google’s image search resultsHere’s how to use each one:FiltersFilters appear under Google’s search box. Use them to refine results by narrowing the type (such as images, videos, shopping, or news). Then, use “Tools” to narrow the results further.For example, say you want to find trending news topics to cover for your blog.You could search your niche and click “News,” “Tools,” and sort news articles by the past week to see what’s happening in your niche. Keep in mind that some filters may only appear for specific languages. Or only for those logged into their Google accounts.Advanced SearchGoogle Advanced Search lets you find pages with specific words or numbers. Or exclude certain words from the search.You can then narrow those results further by specifying: A language A region The last time a page was updated A specific site or domain Where the terms appear (like the text or the URL) Specific formats (like PDFs or PowerPoints) Pages with certain usage rights (like ones free for commercial use)For example, say you want to find recent shopping statistics for an article you’re writing.You can do this using advanced search. To start, enter search terms in the first input box. Then, set the “last update” to the past year (to find recent research). Lastly, set the file type to a PDF (to display PDF reports). Then, click “Advanced Search.”Here’s how using advanced search changes the search results. The results on the left are from a standard Google search for “shopping statistics.” And the right uses our criteria from Google’s advanced search. The difference?The advanced Google search pulls up more PDF reports. So you don’t need to sift through as much content to find what you need.Advanced Image SearchGoogle Advanced Image Search helps you find specific images that include or exclude certain words.Then, it lets you narrow your search by specifying: An image size An aspect ratio Specific colors you want in the image Type of image (like a face, artwork, or clip art) The region where the image was published A website or domain A specific file type (like JPG or PNG) Usage rights (if you want to find images you can use for free, commercially)Let’s say you want to add a clip art image of a red dog to a blog post. And you want to make sure it’s free for commercial use. You also want the image to have a transparent background (which is usually a PNG-type image).Here’s how that search looks:In the above search, we used the words “red dog” and specified an image with the color red.We also specified that we want clip art. And a PNG file type (to help us find images with transparent backgrounds).Lastly, we set the usage rights to Creative Commons. Which helps us find images we may be able to use for free.Here are the results:Advanced image search gives you what you need. So you don’t need to spend time scrolling to find the right image.12 Google Advanced Search OperatorsGoogle’s advanced search functionality can be a good starting point to narrow the search results.But learning advanced search operators (commands you type into Google) gives you even more flexibility to find what you need. Here are 12 useful operators to start using today.TipWhen using advanced search operators, don’t add a space between the search operator and the search term. Otherwise, the search operator might not work. Operators to Find Specific Sites and Pages1. site: Find Relevant Backlink OpportunitiesThe “site:” operator can help you find indexed pages from a website (pages stored in Google’s index).It can also help you determine if a site is relevant for backlink outreach (links from other sites that point to your site).Ideally, your backlinks should come from sites related to your niche. Backlinks from relevant websites in relevant niches, even if not identical, typically yield greater impact compared to those from unrelated sites. To see if a website is relevant, search “site:domain.com” (use the domain of the target site). This shows you how many pages are indexed. In the example below, it’s around 104,000. Then, search “site:potentialdomain.com keyword” (use a keyword for your niche). This shows how many pages mention the keyword you entered. Here, it’s 162,000.Calculate the ratio of the second number to the first number. If the percentage is 60% or above, you may have a relevant prospect (in the example above, it’s 155%).Then, check the prospect using Backlink Analytics to make sure it’s a reputable website.Enter the domain and click “Analyze.”Look at the “Authority Score (AS).” It measures a domain’s reputation by calculating metrics like its backlink profile, organic website traffic, and spam factors. Review the Authority Score to ensure the website is reputable and not spammy. As backlinks from spammy websites can hurt your website’s organic performance. And note the Authority Score. Sites with high Authority Scores can be harder to obtain backlinks from. But these backlinks could have more impact. Whereas a site with a lower Authority Score might not have as much impact but could be easier to obtain a backlink from.2. inurl: Find Guest Posting OpportunitiesThe “inurl:” search operator locates sites with specific words in the URL. Using it can help you find guest blogging opportunities (where you publish an article on someone else’s website).To find websites that accept guest posts in your niche, search any of these operators: “Your niche” inurl:guest-post “Your niche” inurl:guest-blog “Your niche” inurl:write-for-us “Your niche” inurl:submit-an-article “Your niche” inurl:become-a-contributor “Your niche” inurl:writers-wanted (Make sure to include the hyphens between each word. Otherwise, Google will only account for the first word after the colon.)For example, searching ““fitness” inurl:write-for-us” displays search results like this:As you go through these searches, click on each site and read their instructions for pitching your guest post.And as before, check each website with Semrush’s Backlink Analytics to make sure the website is reputable.3. allinurl: Get New Content IdeasThe “allinurl:” operator displays sites that have multiple words in the URL. Use “allinurl:” to come up with new long-tail keywords relevant to your niche.Start by searching “allinurl:” with multiple keywords, like this:Go through the search results and scan for new content ideas. Like this one that shows “beginner piano music for kids.” And “free beginner piano sheet music.”Then, check how many monthly searches your potential keywords get with Keyword Overview. Enter your keywords(s) and click “Search.”Pay attention to the “Volume” (the average number of monthly searches) and “Keyword Difficulty (KD)” (a percentage that indicates how hard it may be to rank well for the keyword).4. intitle: Spot Areas of Low Market ShareUsing “intitle:” displays webpages that contain one specific keyword in the title. For example, if you search “intitle:sunglasses,” the search results display webpages that have the word “sunglasses” in the title.And while search operators work great on their own, combining them lets you get more specific with your search results.We can combine “intitle:” with “site:domain.com” to see how extensively your competitors cover a topic.Like so:This food blog has 230 pages that contain the word “vegan.” Use this information to help you spot areas of opportunity. Like which topics your competitors cover more than you. And which topics you need to write more content for.By understanding which topics you need to write more content for, you can increase your market share in the search results.After identifying topics, use the Keyword Gap tool to find which exact keywords your competitors rank for that you don’t. Just enter your domain with up to four competitors and click “Compare.”Enter your topic to filter the keywords (in this case, we used “vegan”). Then, click “Missing” to view a list of keywords your competitor ranks for, but you don’t.Select keywords with a high volume and a low keyword difficulty.Then, write content for each keyword to grow your market share in the search results.5. allintitle: Identify Content GapsThe “allintitle:” search operator displays pages that contain multiple words in their title. And you can use it to identify content gaps in your niche.Start by brainstorming keywords relevant to your niche. Then, use “allintitle:” to search each keyword. While you search each keyword, note how many results there are. The search results might suggest a potential content gap if you find relatively few pages with the exact keyword in their titles. And you can fill that gap with your own content.But make sure the keywords you choose have search volume. Otherwise, you might end up writing content that people aren’t searching for.To check search volume, use the Keyword Overview tool. Enter your keyword and click “Search.”Review the volume. If the keyword doesn’t have any search volume, look to the “Keyword ideas” section. It’ll help you find related keywords that might have more search volume.Then, write content for your selected keyword.6. filetype: Find Unwanted Published Files in the Search ResultsUse “filetype:” operator to make sure Google hasn’t indexed files you don’t want in the search results. Like files people need to pay to access—such as a premium ebook.To check for unwanted files in the search results, search: “filetype:PDF site:yourdomain.com.” Replace PDF with the file type of your choice.(Here’s a complete list of the different file types you can search for on Google.)Like this:Go through the results. Or narrow them using a keyword, like this: “ebook filetype:PDF site:yourdomain.com.”If you find a file you want Google to remove from the search result, use the x-robots-tag. This instructs Google not to index it.7. related: Identify Your CompetitorsThe “related:” search operator can help you find websites relevant to a site. Which can help you identify your competitors in the search results. Identifying your competitors gives you insight into their SEO strategy. Like which keywords they target (and which ones you should, too).However, Google is getting rid of this search operator, according to Google Search Liaison on Twitter. And instead of seeing related websites, you might see your own website:But there are other ways to view your competitors. Like Semrush’s Organic Research tool.Here’s how:First, enter the domain and click “Search.”Scroll to “Main Organic Competitors” to view the website’s competitors. Click “View all # competitors” to expand the list. Now, you have a full list of related websites, along with information for each site. Like how much traffic it gets.Use this information to benchmark your site’s traffic against your competitors.Operators to Find Specific Text8. allintext: Spot Internal Linking OpportunitiesThe “allintext:” operator displays websites that contain all the words you’ve listed. And pairing it with the “site:” operator can help you find internal linking opportunities.Internal links are links on a website that point to other pages on the same website. Here’s an example:Adding internal links to your pages helps search engines understand your content and discover new pages. And helps people (and search engines) navigate your site.To search your site for internal linking opportunities, search “allintext:your keywords site:yourdomain.com.”For example, say we just wrote a blog post about advanced SEO tips for restaurants. Here’s what we might search: This search shows pages on our site that are relevant to all the keywords we inputted. And it gives us ideas for internal linking opportunities. Try this for your own content to get a list of relevant pages you can use as internal links.9. “ ” Track Brand MentionsAdding quotations around a word or phrase tells Google to search for that exact phrase with no variation. This advanced operator is useful if you want to track brand mentions. Simply search your brand name or trademarks on Google using quotations. When you search this, your own website might show in the search results. Like ours does:If this happens, use this search operator: ““your name” -site:yourdomain.com.” The minus sign tells Google to exclude the listed site from the search results.Then, go through the search results and track who mentions your brand. You might even find websites that have mentioned your brand but haven’t linked to you. If this happens, contact these websites and ask if they can add a link to your brand name.If you want to automate brand monitoring, use Semrush’s Brand Monitoring tool. It alerts you anytime someone mentions your brand or links to your website.This way, you can monitor your brand reputation on auto-pilot. 10. allinanchor: Monitor Brand AwarenessThe “allinanchor:” operator searches for pages with multiple words in their anchor text (the text that a link is attached to).You can use it to search for branded anchor text—when a website links to you using your brand name or a variation of it—to monitor brand awareness. First, jot down a list of branded terms. For Semrush we might list: Semrush SEMrush semrush.comYou can also list your products, services, and trademarks.Then, search each branded term using the “allinanchor:” operator. Like this:Unfortunately, this search operator isn’t always reliable. And Google might not show results that mention the anchor text specified.If this happens, try Semrush’s Brand Monitoring. Brand Monitoring can track branded backlinks and notify you when someone mentions—and links to—your site.Keep track of how your branded backlinks grow with time. They can help you understand how quickly—or slowly—your brand awareness is growing.Other Useful Operators11. * Get New Keyword IdeasAdding an asterisk between words can help you get new ideas for keywords. For example, searching for “gardening tips for *” yields results like this:Scroll through the search results to come up with new long-tail keyword ideas. In the above example, we have “gardening tips for beginners.”After picking a keyword, use the SEO Writing Assistant to help you write content.Click “+ Analyze New Text.”Enter your keyword(s) and click “Get recommendations.”Then, write your content in the text editor. As you write, the SEO Writing Assistant will grade your text. And give you suggestions based on readability, SEO, originality, and tone of voice. These suggestions can help you write a piece your audience enjoys. And ranks higher in the search results. 12. link: Analyze Backlinks (Depreciated)The “link:” search operator was used to find pages that link to a specific URL. However, Google depreciated this search operator in 2017, according to Google Search Advocate John Mueller.And while you can still use it, the results aren’t accurate.But you can still find sites that link to a specific URL with Semrush’s Backlink Analytics tool. To get started, enter the domain you want to check and click “Analyze.”Click the “Backlinks” tab. This shows a list of all pages linking to the specified site. Improve Your SEO with Google Advanced Search OperatorsAdvanced search operators can help you get new keyword ideas, monitor brand mentions, find backlink opportunities, and more.And when you pair advanced search operators with Semrush tools—like Keyword Overview, Backlink Analytics, and Domain Overview—you can unlock a gold mine of helpful data. Ready to try it for yourself?Start using Semrush for free.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Use Google Advanced Search to Improve Your SEO"
    },
    {
      "level": "H2",
      "text": "What Is Google Advanced Search?"
    },
    {
      "level": "H2",
      "text": "How to Do an Advanced Search on Google"
    },
    {
      "level": "H3",
      "text": "Filters"
    },
    {
      "level": "H3",
      "text": "Advanced Search"
    },
    {
      "level": "H3",
      "text": "Advanced Image Search"
    },
    {
      "level": "H2",
      "text": "12 Google Advanced Search Operators"
    },
    {
      "level": "H2",
      "text": "Operators to Find Specific Sites and Pages"
    },
    {
      "level": "H3",
      "text": "1. site: Find Relevant Backlink Opportunities"
    },
    {
      "level": "H3",
      "text": "2. inurl: Find Guest Posting Opportunities"
    },
    {
      "level": "H3",
      "text": "3. allinurl: Get New Content Ideas"
    },
    {
      "level": "H3",
      "text": "4. intitle: Spot Areas of Low Market Share"
    },
    {
      "level": "H3",
      "text": "5. allintitle: Identify Content Gaps"
    },
    {
      "level": "H3",
      "text": "6. filetype: Find Unwanted Published Files in the Search Results"
    },
    {
      "level": "H3",
      "text": "7. related: Identify Your Competitors"
    },
    {
      "level": "H2",
      "text": "Operators to Find Specific Text"
    },
    {
      "level": "H3",
      "text": "8. allintext: Spot Internal Linking Opportunities"
    },
    {
      "level": "H3",
      "text": "9. “ ” Track Brand Mentions"
    },
    {
      "level": "H3",
      "text": "10. allinanchor: Monitor Brand Awareness"
    },
    {
      "level": "H2",
      "text": "Other Useful Operators"
    },
    {
      "level": "H3",
      "text": "11. * Get New Keyword Ideas"
    },
    {
      "level": "H3",
      "text": "12. link: Analyze Backlinks (Depreciated)"
    },
    {
      "level": "H2",
      "text": "Improve Your SEO with Google Advanced Search Operators"
    }
  ],
  "author": ""
}