{
  "url": "https://www.semrush.com/blog/google-ads-impressions/",
  "slug": "google-ads-impressions",
  "title": "What Are Impressions on Google Ads and Are They Important?",
  "description": "Learn what impressions are on Google Ads and why they matter for your online advertising campaigns.",
  "content": "What Are Google Ads Impressions?Impressions on Google Ads count the number of times your ad is shown to users on Google or any other site on the Google Network. Users don’t need to click on your ad for it to count as an impression. There are three types of Google Ads impressions. Search impressions: These occur when your ad appears in the search results on Google or partner sites Display impressions: These are displayed on websites within the Google Display Network (GDN), including Google services like Gmail and YouTube Video impressions: Are counted when your video ad appears on YouTube or other video partners in the Display NetworkHow Google Ads Counts ImpressionsGoogle Ads counts an impression each time your ad is displayed, whether that’s in search results or elsewhere on the Google Network.Here is an example of a Google Ad on a website within the Google Display Network:Google Ads would count an impression for each of these ads every time they are shown on the page. Whether you as the user actually notice it or not. And whether it’s a real user or bot traffic. Accidental page refreshes can also lead to extra impressions. If someone refreshes a page, Google Ads may count impressions before and after the refresh. This could skew your impressions, making it seem like more users saw your ads than was actually the case.However, Google can filter out impressions (and clicks) that their systems detect as “invalid activity.” This helps to ensure you get accurate information about your campaign performance.If real users are shown your ad but they scroll past without noticing it, it still counts as an impression. This could lead to lower click-through rates (CTRs) on your ads, suggesting your ads aren’t engaging. But the user could have just scrolled too fast. Or left the page the moment your ad displayed. That’s why it’s important to monitor a range of ad metrics together, like clicks, cost per click, and conversions. Google Ads Impressions vs. ClicksImpressions are when someone sees your ad. Clicks are when someone engages with your ad and actually clicks on it. Generally, you want a high number of both impressions and clicks. This means that lots of people are seeing your ad, and many of them are interested enough to click on it. In other words, you’ll also have a high click-through rate.What Is Google Ads Impression Share?Your Google Ads impression share (IS) is the percentage of impressions you get on your ads compared to the total number of impressions you could get. It’s a good way to measure the performance of your ads against others in your category. Your budget (and bids) will have a big impact on your impression share. The more you spend (in total and per bid), the more likely your ad is to appear in front of searchers, and so the more likely you are to have a higher impression share.Improving the quality of your ads can also improve your impression share. Do this by improving the three key elements that go into your ad’s Quality Score: Expected click-through rate Ad relevance Landing page experienceBut there is no “ideal” impression share for every ad campaign. It depends on a wide range of factors, such as how many people search for the terms you’re targeting, and how much your competitors are spending. So, monitoring your impressions data in general is important to understand how well your ads are performing. The Importance of Google Ads ImpressionsYour campaign goals will ultimately determine how important impressions are for your business. If you’re a new company and brand awareness is your goal, you may want a high volume of impressions, with less focus on clicks. But if you’re budget-conscious and conversion-focused, you may be more concerned with how many clicks lead to purchases. So total impressions will be less important than your conversion rate.Factors That Affect Google Ads ImpressionsYour Google Ads impressions can be affected by: Your budget: Generally, the higher your budget, the more impressions you may be able to get Where your ads are shown: Limiting your ads to appearing in search results may lead to lower impressions than if you allow them to appear on the Google Display Network Your ad quality: Google uses a metric called Quality Score to assess the overall quality of your ads, and this can impact how often they are shown to users (see above) Your campaign settings: These include things like geographic targeting options, the keywords you’re targeting (and keyword match types), and when you schedule your ads to showIf you’re getting a lot of impressions on your ads, this could mean your campaigns are well optimized for maximum reach. But if you’re not getting clicks from those impressions, you may be reaching the wrong people. On the other hand, a very low number of impressions with a reasonably high click-through rate could suggest you’re not reaching enough people. But if your target audience is small, your campaign may actually be highly optimized. This illustrates just how important it is to consider more than just your impression data. But increasing your impressions and displaying your ads to more of the right people is one way to improve your Google Ads campaign performance. 7 Strategies to Increase Google Ads Impressions1. Choose the Right KeywordsChoosing the right keywords ensures you maximize your impressions. But also that you get impressions from the right people. Let’s say you sell skis and ski poles. If you targeted a term like “skiing,” your ad might get lots of impressions. But they could be impressions for people searching for things like “skiing holidays” and “ski resorts” or even “skiing tips.” These are not people likely to be looking to buy ski equipment.You’d instead want to pick keywords like “ski equipment” and “ski poles.” Use Semrush’s Keyword Magic Tool to find more of the right keywords to target with your ads.Enter your primary keyword (a word related to your business or product, like ski equipment), choose a target location, and click “Search.”You’ll see a list of keywords along with various important metrics for each one. Pay attention to volume (the estimated number of monthly searches) and cost per click (CPC). Ideally you’ll target keywords that are related to your business, have a high search volume, and have a low CPC.Pro tipYou can sort the list by any of these metrics by clicking on the column header. And you can apply extra filters to further refine the results. Also pay attention to the “Intent” column. This can help you quickly identify keywords with the right search intent. Keywords with a “T” or “C” in this column indicate transactional and commercial intent respectively, which are likely better targets than keywords with navigational or informational intent.When you find keywords that meet these criteria, you can click the checkbox to the left of the keyword. Once you’ve selected some for your campaign, click the “+ Add to keyword list” button and select a list or create a new one.You can then find this list and any others you create in the Keyword Strategy Builder. Try the Keyword Magic Tool for free today to start finding the right keywords to get more impressions on your Google Ads campaigns.2. Use the Correct Keyword Match TypesSpecifying keyword match types ensures you don’t appear in search results for products or services you don’t sell. Or for search terms unrelated to your business.There are three keyword match types to choose from in Google Ads: [Exact match] queries must match your keyword’s meaning “Phrase match” queries must include your keyword’s meaning Broad match queries must relate to your keyword’s meaningChoosing the right match types ensures your ads appear in places where you’re likely to get impressions and conversions. Sticking with our ski equipment example, if you only sell ski poles and not ski boots, you might want to target exact match keywords like [ski poles] and [poles for skiing], where the square brackets signify exact match.Targeting phrase match queries like “ski poles” (with the quotation marks) or even broad match (ski poles without any punctuation) might get you a lot more impressions. But you could appear in searches for people who are unlikely to convert into customers, potentially wasting your ad budget.3. Select the Right Bidding StrategyChoosing how you want Google’s algorithms to bid on the keywords you have chosen is the key to getting maximum results from your ads. For ads designed to turn visitors into customers, you’ll likely choose a bidding strategy like “Maximize Conversions.” However, if impressions are your goal (such as to boost brand awareness), you can select a specific bidding strategy to achieve that. The “Target Impression Share” bidding strategy automatically adjusts your bids to maximize your ads chances of appearing in search results. The equivalent of this for display campaigns is “CPM,” where you pay based on the number of impressions your ads receive.4. Adjust Your Ad Scheduling and GeotargetingGoogle Ads allows you to adjust your ad schedule to show your ads when potential customers are more likely to be online. You can increase your ad impressions by adjusting your ad scheduling to align with these peak times. For example, if you’re targeting working professionals, your ads might perform better during lunch hours or early evenings on weekdays.You can also adjust the area you’re targeting with your ads. Obviously this will depend on where you’re based and where your target audience is located. But it can have an impact on your impressions and impression share.Bear in mind that, if you target a smaller area, you might see your impression share increase. But your potential number of impressions may decrease. So, adjust this setting alongside your campaign budget and ad scheduling to maximize your ad’s performance.5. Improve the Quality of Your AdsThe quality of your ads and landing pages factor into your Quality Score and have a direct impact on how often and where your ads are shown. So, improving the quality of your ads and landing pages can help increase your impressions and impression share.Part of this involves ensuring you’re targeting the right keywords that are actually relevant to what you’re offering on your landing page. As we noted earlier, the Keyword Magic Tool helps you choose relevant keywords, while also optimizing for high search volumes and low costs per click.Here are some more quick ways to improve the quality of your ads to get more impressions: Craft compelling headlines: Your ad’s headlines should accurately reflect what you're offering and encourage users to click Use persuasive ad copy: The body of your ad should expand on the promise made in your headline Highlight your unique selling proposition (USP): Your ad should clearly communicate what differentiates your offer from competitors Include a call to action (CTA): Your CTA should be clear, concise, and use action words like \"Buy Now\" or \"Sign Up Today\" Incorporate visual elements: For display and video campaigns, all visuals should be high quality, relevant, and aligned with your brand identityFurther reading: 8 Google Ads Best Practices to Maximize Return on Ad Spend6. Use the Right Campaign TypesGoogle offers a mixture of campaign types you can use for your ads. These campaigns cover search, display, and video ads, along with local, shopping, and more.Determining the right Google Ads campaign type to use involves understanding your specific business needs and your audience's preferences. Start by analyzing your target audience's online behavior—where they spend their time, what they search for, and how they consume content. This research might include reviewing website analytics, conducting surveys, or observing trends in your industry.If you’re not sure what your target audience looks like, you can look to your competitors as a guide (they probably have a similar target audience). To do this, use Semrush’s One2Target tool. Simply enter your competitor’s domain and click “Analyze.” You’ll then see a screen with demographic information about your competitor’s (and therefore likely your) target audience. Use this data to learn more about who your target audience is and where they’re located. Click on the “Behavior” tab to get more useful information for choosing your campaign type.If you scroll down on this tab, you’ll see information about the social media platforms your target audience uses most. If you see YouTube with a high percentage, for example, you may want to consider incorporating the video campaign type.7. Analyze Your Competitors’ AdsYou can gain useful insights to improve your ad quality and get more impressions by looking at your competitors’ campaigns.Look at their ads, the keywords they target, and the messaging they use to attract customers. Use Semrush’s Advertising Research tool to do this.Enter a competitor’s URL in the search bar, choose a target location, and click “Search.”From here, you can see the keywords your competitors are bidding on. And competitive metrics like CPC and search volume for those keywords. You can even view your competitor's ad copy to learn what works for their campaigns. To do this, click the “Ads Copies” tab at the top. Studying their ad copy can help you understand what’s working for them. You’ll also see the keywords that can trigger these ads in search results by clicking on the “Keywords” drop-down menu.Do this for your top competitors to gain insights you can apply to improve your own ad campaigns.Improve Your Google Ads Performance with SemrushYour Google Ads impressions data can tell you a lot about your campaign’s performance. But to improve your ads and get more impressions, you need to do your own research to understand how best to optimize your ads for your target audience.Semrush’s suite of digital marketing tools can help you do exactly that: Keyword Magic Tool: For finding the right keywords to target for maximum impressions One2Target: To learn more about your target audience to better tailor your ad content and campaign types Advertising Research: For gaining insights from your competitors to improve your own ad copyTry these tools and more with a Semrush free trial.",
  "headers": [
    {
      "level": "H1",
      "text": "What Are Impressions on Google Ads and Are They Important?"
    },
    {
      "level": "H2",
      "text": "What Are Google Ads Impressions?"
    },
    {
      "level": "H2",
      "text": "How Google Ads Counts Impressions"
    },
    {
      "level": "H3",
      "text": "Google Ads Impressions vs. Clicks"
    },
    {
      "level": "H2",
      "text": "What Is Google Ads Impression Share?"
    },
    {
      "level": "H2",
      "text": "The Importance of Google Ads Impressions"
    },
    {
      "level": "H3",
      "text": "Factors That Affect Google Ads Impressions"
    },
    {
      "level": "H2",
      "text": "7 Strategies to Increase Google Ads Impressions"
    },
    {
      "level": "H3",
      "text": "1. Choose the Right Keywords"
    },
    {
      "level": "H3",
      "text": "2. Use the Correct Keyword Match Types"
    },
    {
      "level": "H3",
      "text": "3. Select the Right Bidding Strategy"
    },
    {
      "level": "H3",
      "text": "4. Adjust Your Ad Scheduling and Geotargeting"
    },
    {
      "level": "H3",
      "text": "5. Improve the Quality of Your Ads"
    },
    {
      "level": "H3",
      "text": "6. Use the Right Campaign Types"
    },
    {
      "level": "H3",
      "text": "7. Analyze Your Competitors’ Ads"
    },
    {
      "level": "H2",
      "text": "Improve Your Google Ads Performance with Semrush"
    }
  ],
  "author": ""
}