{
  "url": "https://www.semrush.com/blog/google-website-analytics/",
  "slug": "google-website-analytics",
  "title": "Google Website Analytics",
  "description": "Review these 35 useful Google Analytics insights to better understand your website‘s traffic.",
  "content": "Google Analytics is arguably one of the most valuable and powerful tools for website analytics. Let’s explore 35 valuable data insights Google Analytics offers and how you can use them to improve your marketing and SEO.What Is Google Analytics?Google Analytics is a web analytics tool designed to collect user data. It sorts the data into easy-to-read reports via a customizable dashboard.Example of a custom Google Analytics dashboardWhat Is a Metric in Google Analytics?In Google Analytics, a metric is a single, measurable piece of data. Metrics can appear in sums or ratios.Some common Google Analytics metrics include pages per session, screen views, bounce rate, and time on page.Screenshot of a Google Analytics reportTypes of Google Analytics Insights Insight 1: Active Users on SiteThis metric indicates how many active users are on your site in real-time. You can also use this metric to double-check if you’ve set up Google Analytics correctly on your website. Insight 2: Top Active PagesUse this metric to track the most active pages on your website in real-time. If you’ve launched a new blog post and you’ve pushed it through your marketing channels, this metric can indicate if your new content is drawing any traffic.Insight 3: Goal Conversions The Goal conversions metric helps you track conversions on your website. You can also use this report to review any buttons, forms, or transactions used to complete a conversion. You’ll have to set your goals in Google Analytics first before you can see this data. When a user completes a specific event, Google counts it as a conversion towards your goal. You can also use this metric to determine whether your website can track conversions correctly. Note that this metric only tracks conversions completed in the last 30 minutes.Insight 4: Audience AgeYou’ll mostly use this to understand or refine your target audience. Review this metric to track the average age range of your website’s visitors. Insight 5: Audience GenderSimilar to the above, this metric is great for understanding your user demographics. Combine this with other audience metrics to verify your target market is responding to your campaign.Insight 6: Audience Geographic LocationThis chart tracks the locations of users visiting your site. It can also indicate which language your user’s browsing in. This metric can be useful for marketers working on international campaigns who want to better understand their reach. Depending on the number of international users, you may need to consider an alternate language version of your website. Insight 7: New vs. Returning VisitorsThis chart easily segments your overall visitors into new or returning visitors. New visitors are visitors that have never landed on your website before. Returning visitors are visitors that have visited your website more than once in the past two years. An influx of new visitors can indicate a successful marketing campaign, popular content, or an increase in brand awareness. Returning visitors can provide more insight into popular pages on your website, valuable content you can repurpose, or even a compelling product to highlight. You can also target returning users with loyalty rewards or a more enticing CTA.Insight 8: Desktop vs. Mobile This chart segments visitors by device. Compare mobile to desktop visitors to determine how visitors primarily access your website. If your marketing campaign targets one or the other, this metric can help you track its success. Insight 9: Users Flow This metric shows you the journey of a user on your website. You’ll be able to see which websites lead visitors to yours, or which websites they visited after leaving your site.Insight 10: Lifetime Value (LTV) of a UserThis insight looks at a user in the first 90 days after they have visited your site. If you have someone sign-up for a service, this metric is essential.You can set the metric to measure page views, conversions, or other goals you want to select. You can then start to determine how this user will use your site and be a great customer for you in the future.Insight 11: Top Acquisition ChannelsThis is arguably the most important acquisition metric. This shows your site’s most powerful traffic sources and which campaigns are working, where most of your business is likely coming from.Insight 12: New UsersThis metric tells you the number of first-time visitors to your website. If you’re launching a new campaign to get new visitors and new signups, this is the metric you need to focus on.Insight 13: Landing PagesIf you’re running PPC ads, this metric can show you the effectiveness of your ads or their landing pages. If a blog post or web page suddenly becomes popular, you’ll be able to review their metrics with this chart.Insight 14: SessionsA session is a unit of time — usually 30 minutes. This widget tracks how many sessions a user has been active on your website. A single user can have multiple sessions.Insight 15: Sessions via Social ReferralsHow many sessions were created from a social source, such as Facebook or Instagram? This widget is your best bet for monitoring any social media traffic or campaign results. Insight 16: Track Specific Campaigns with UTM TrackingUrchin Tracking Modules (UTM) are unique URLs that track the effectiveness of specific marketing campaigns. Insight 17: Average Session DurationThis metric averages the session length of your visitors. It is a helpful metric for comparing different marketing channels and campaigns.Insight 18: Bounce RateThe bounce rate is a percentage of single-page visits or sessions where the user did not interact with the site. High bounce rates indicate users leave your site quickly. If you have high bounce rates, you’ll need to create a strategy to help visitors stay on your website longer.Insight 19: Site Content MetricsThis shows you which pages on your website people are interacting with the most. It shows you which pages and which content catches people’s attention.Insight 20: Behavior FlowThe user flow metric shows the volume of users from different locations. However, Behavior Flow indicates what users do once they land on your website. It can show you the order of pages visited and time spent per page.Do users follow internal links to other pages? Do they follow a logical path of browsing, adding to the cart, and checking out?Insight 21: Exit Pages This shows you which page users left your site. Use this widget to determine if there’s a specific issue with the page, like a poor call to action, broken links or Insight 22: Average Page Load TimesThis metric is good for the Core Web Vitals, as page load speed is one of the critical components in Google’s page ranking. Issues affecting page load speeds can be a slow server, image compression, lazy loading, and page layout shift.Insight 23: Goal Completions You can set up goals with your website. Completion of these goals by users will return this metric to you. These goals can include completing a form, watching a video, or making a purchaseInsight 24: Goal Conversion RateLike the previous metric, this gives you a percentage of goals completed by visitors to your website.Insight 25: Reverse Goal PathAgain, following up from the above, you can follow the path they took to get there for those who did complete the goals. This helps track the user’s journey, and you can find spots along the way to strengthen your message and increase the conversion rate.Insight 26: Average Ecommerce Order ValueThis insight gives you the average dollar amount per order on your website. It provides a good indicator of the ROI for your marketing campaign and can give you an idea about setting prices for your products and services.Insight 27: Checkout Behaviour AnalysisThis metric shows you when a customer checks out and pays for their items or leaves the cart entirely. It's suitable for triggering abandoned cart emails and for understanding the customer’s journey.Insight 28: Multi-Channel ConversionsWith this insight, you can investigate which channels are giving you the most conversions on your website. You can combine channels to give you an overall conversion amount as well.Use this metric to determine where you should invest more of your marketing budget to get better ROI.Insight 29: Top Conversion PathsCheck out what are the most successful paths users take to your website and then conversion. This gives you some insights into your target audience and how well your marketing campaigns are going.These insights can also reveal to you a target audience you didn't know you had.Insight 30: In-Market SegmentsWith this insight, you can investigate where Google places your users. “In-market segments” is the same kind of analysis used by Google Ads. These are people who are actively looking for your products and services; Google groups them by their search intent.Insight 31: Conversion ProbabilityThis is an interesting metric because it can predict the probability of a user converting through your channels. This gives you insight into which marketing channels are working and hitting the right target audience with your marketing message.You can focus more money on the channels which predict higher conversions to get a better ROI and let the lower prediction channels ease off.Insight 32: On-Site Search TermsIf your website has search functionality, this insight will tell you what people search for once they land on your website. This allows you to put more resources toward the category or products they’re searching for, build a channel directly to those pages, with marketing and backlinks.It can also show you which pages they are searching, if there is a content issue, such as descriptions being misleading or not clear enough for the user.Hidden Insights & MetricsSome hidden insights and metrics are not immediately available in “out-of-the-box” Google Analytics. Adding some of these metrics can give you insights you might not have known you needed.Insight 33: Query Word Count (Paid Ads Linking)You can integrate your Google Ads account with your Google Analytics account. This allows you to see the number of clicks for a PPC by the word count in a search term.You can choose the number of words in a Google Ad, the length of search terms, and help budget for more effective campaigns.Insight 34: Search Console QueriesLink your Google Search Console with your Google Analytics account to see which search queries your website receives impressions. You can see clicks and view your click-through rate as well.This integration means you don’t need to look at your Google Search Console. You can find the information in one place.Insight 35: Not Provided KeywordsHidden keywords, or ‘not provided’ keywords, are common within Google Analytics. You can find this information under Acquisition. Our Organic Traffic Insights tool is an excellent workaround as well for this. It can; Check landing pages from your GA dashboard where GA showed the not-provided keywords. Merges this data with your Google Search Console data for each page. Adds keywords that drive traffic to the same pages. Gives you a list of not-provided keywords.For more information about the Organic Traffic Insights tool, check out our knowledge base.All of Your Insights in One PlaceYou can integrate your Google Analytics account with your SEO Dashboard to see all these great insights in one place. No need to switch screens and copy data from one page or dashboard to another.You can quickly and easily see the metrics and insights, compare them to your keywords and your competitors’ marketing.Check out our knowledge base to learn how to link Google Analytics to Semrush, and what metrics and insights you can uncover when you do.Final Thoughts The more you know about your customers, the better you can develop your content to serve them and get more ideas on building your business.With some tweaks, you can gain even more insights into your customers, their behavior, profiles, and more with Google Analytics.",
  "headers": [
    {
      "level": "H1",
      "text": "35 Insights that Google Analytics Can Give You About Your Website"
    },
    {
      "level": "H2",
      "text": "What Is Google Analytics?"
    },
    {
      "level": "H3",
      "text": "What Is a Metric in Google Analytics?"
    },
    {
      "level": "H2",
      "text": "Types of Google Analytics Insights"
    },
    {
      "level": "H3",
      "text": "Insight 1: Active Users on Site"
    },
    {
      "level": "H3",
      "text": "Insight 2: Top Active Pages"
    },
    {
      "level": "H3",
      "text": "Insight 3: Goal Conversions"
    },
    {
      "level": "H3",
      "text": "Insight 4: Audience Age"
    },
    {
      "level": "H3",
      "text": "Insight 5: Audience Gender"
    },
    {
      "level": "H3",
      "text": "Insight 6: Audience Geographic Location"
    },
    {
      "level": "H3",
      "text": "Insight 7: New vs. Returning Visitors"
    },
    {
      "level": "H3",
      "text": "Insight 8: Desktop vs. Mobile"
    },
    {
      "level": "H3",
      "text": "Insight 9: Users Flow"
    },
    {
      "level": "H3",
      "text": "Insight 10: Lifetime Value (LTV) of a User"
    },
    {
      "level": "H3",
      "text": "Insight 11: Top Acquisition Channels"
    },
    {
      "level": "H3",
      "text": "Insight 12: New Users"
    },
    {
      "level": "H3",
      "text": "Insight 13: Landing Pages"
    },
    {
      "level": "H3",
      "text": "Insight 14: Sessions"
    },
    {
      "level": "H3",
      "text": "Insight 15: Sessions via Social Referrals"
    },
    {
      "level": "H3",
      "text": "Insight 16: Track Specific Campaigns with UTM Tracking"
    },
    {
      "level": "H3",
      "text": "Insight 17: Average Session Duration"
    },
    {
      "level": "H3",
      "text": "Insight 18: Bounce Rate"
    },
    {
      "level": "H3",
      "text": "Insight 19: Site Content Metrics"
    },
    {
      "level": "H3",
      "text": "Insight 20: Behavior Flow"
    },
    {
      "level": "H3",
      "text": "Insight 21: Exit Pages"
    },
    {
      "level": "H3",
      "text": "Insight 22: Average Page Load Times"
    },
    {
      "level": "H3",
      "text": "Insight 23: Goal Completions"
    },
    {
      "level": "H3",
      "text": "Insight 24: Goal Conversion Rate"
    },
    {
      "level": "H3",
      "text": "Insight 25: Reverse Goal Path"
    },
    {
      "level": "H3",
      "text": "Insight 26: Average Ecommerce Order Value"
    },
    {
      "level": "H3",
      "text": "Insight 27: Checkout Behaviour Analysis"
    },
    {
      "level": "H3",
      "text": "Insight 28: Multi-Channel Conversions"
    },
    {
      "level": "H3",
      "text": "Insight 29: Top Conversion Paths"
    },
    {
      "level": "H3",
      "text": "Insight 30: In-Market Segments"
    },
    {
      "level": "H3",
      "text": "Insight 31: Conversion Probability"
    },
    {
      "level": "H3",
      "text": "Insight 32: On-Site Search Terms"
    },
    {
      "level": "H2",
      "text": "Hidden Insights & Metrics"
    },
    {
      "level": "H3",
      "text": "Insight 33: Query Word Count (Paid Ads Linking)"
    },
    {
      "level": "H3",
      "text": "Insight 34: Search Console Queries"
    },
    {
      "level": "H3",
      "text": "Insight 35: Not Provided Keywords"
    },
    {
      "level": "H2",
      "text": "All of Your Insights in One Place"
    },
    {
      "level": "H2",
      "text": "Final Thoughts"
    },
    {
      "level": "H6",
      "text": "Most popular pages"
    },
    {
      "level": "H6",
      "text": "SEO Checklist: 41 Tips to Optimize Your Website"
    },
    {
      "level": "H6",
      "text": "How to Perform a Complete SEO Audit (in 14 Steps)"
    },
    {
      "level": "H6",
      "text": "A Beginner’s Guide to Keyword Search Volume"
    }
  ],
  "author": ""
}