{
  "url": "https://www.semrush.com/blog/google-keyword-planner/",
  "slug": "google-keyword-planner",
  "title": "How to Use Google Keyword Planner to Find Good Keywords",
  "description": "Google Keyword Planner is a free tool that lets you research the queries people type into Google.",
  "content": "Google’s Keyword Planner is a free keyword research tool on the Google Ads platform. It can tell you what search terms people use in Google, how popular these terms are, and how much they might cost to advertise on.The tool is designed for PPC keyword research (finding keywords for ads). But you can also use it for SEO keyword research (finding keywords for your website).Here’s how to use Google Keyword Planner. Step by step.Step 1: Access Keyword PlannerTo access Google’s Keyword Planner, go to the tool’s URL within Google Ads.If you haven’t already, you’ll need to: Sign in to or create your Google account Make sure your account is in Expert mode—not Smart mode. (You know you’re in Expert mode if the “Settings” icon is absent from the navigation menu in the top right corner.)You’ll set up your Google Ads account as though you’re planning to advertise on Google. But don’t worry—you won’t have to launch an ad campaign if you don’t want to.When you’re using Google Ads, you can access the Keyword Planner by going to “Tools” > “Planning” > “Keyword Planner.”TipPlanning to launch your first Google Ads campaign? Use the Ads Launch Assistant. It handles the entire process.Step 2: Discover New KeywordsOnce you’ve accessed Keyword Planner, choose “Discover new keywords.”(You should only select “Get search volume and forecasts” if you’ve already selected your keywords.)You then have two options: Start with keywords: The tool will come up with keyword ideas based on the terms you enter Start with a website: The tool will scan your chosen domain or page to come up with keyword ideas. You can get ideas from your own website or a competitor’s.Add your keyword or URL (depending on your chosen method).Then, select your target language and location(s). You can choose countries, regions, cities, etc.When you’re done, click “Get results.”Keyword Planner will present keyword ideas alongside a variety of metrics.Step 3: Refine Your Keyword ListRefining your keyword list allows you to focus on relevant keywords you might want to target—i.e., terms you have the best chance of showing for and getting conversions from.Go to “Add filter” > “Keyword” to filter for keywords that contain or don’t contain a particular term.If you want to include/exclude terms with similar meanings as well, choose “Semantic Match” instead of “Text Match.”For example, a luxury brand might want to avoid keywords containing “cheap” or similar terms:If you used the “Start with keywords” option, you can find commonly occurring terms in the “Refine keywords” section.Click “Expand all” and uncheck the boxes alongside any irrelevant terms (e.g., brand names you don’t sell). This will remove the corresponding keywords from your results.If you’re planning an ad campaign, you might want to save irrelevant keywords as negative keywords. These are search terms that prevent your ads from showing.Just use the checkboxes to select irrelevant keywords. Then, click “⋮ More” > “Add as negative keywords.”You’ll need to choose the appropriate keyword match type for each negative keyword: “Broad match” means your ad won’t show if the query contains your negative keyword with the terms appearing in any order “Phrase match” means your ad won’t show if the query contains your negative keyword with the terms in the order you specified “Exact match” means your ad won’t show if the query matches the negative keyword exactly as you entered itStep 4: Look at Search VolumesKeyword search volume is the average number of monthly searches for a keyword each month. It gives you an idea of how many views your results could get.Google’s Keyword Planner displays volumes in the “Avg. monthly searches” column:As you can see, these estimates are very broad. So, it’s difficult to compare keywords and spot the best opportunities.To get more precise estimates, do keyword research with Semrush. Our database has the most accurate search volumes on the market.For example, here are some results from the Keyword Magic Tool: While Keyword Planner tells you that “running shoes” gets 100K-1M searches per month, the Keyword Magic Tool tells you it’s around 165,000.So, you get a better idea of potential traffic.TipWhether you’re using the Keyword Planner or the Keyword Magic Tool, you can click column headers to sort results from high to low or low to high.Step 5: Separate PPC Keywords from SEO KeywordsThe keywords you use for PPC campaigns are usually different from the ones you’ll use on your website. Because they fulfill different purposes.(There are exceptions. For example, you’ll likely use some of the same keywords on a product page as you would for a campaign that leads to that product page.)To determine which terms you’ll want to use for paid ads and which are better suited for your website, you’ll want to analyze each term’s search intent (what the searcher is trying to achieve).There are four main types of intent: Navigational: Users want to find a particular website or page Informational: Users want to learn more about a topic Commercial: Users want to conduct research before prior to making a purchase decision Transactional: Users want to complete an action like a purchaseThe latter two are typically best for ad campaigns. Because they indicate users are nearly ready to buy.To understand a keyword’s search intent, search it in Semrush’s Keyword Overview tool. You can see what type of keyword you’re dealing with. And analyze the top-ranking results.Once you know which terms you want to use for ads, you can save them by checking the boxes alongside them and clicking “Add keyword(s) to create plan” (thereafter, “Add keyword(s)”).To access just these PPC keywords in the next steps, go to the “Saved keywords” tab in Keyword Planner.Step 6: Evaluate Competition Levels (and Costs for PPC Keywords)If lots of websites compete for the same keywords, it’s harder to earn a prominent spot on the search results page. And in the case of ads, it’ll be more expensive.Let’s explore how to evaluate both PPC and SEO keywords:Evaluate PPC KeywordsKeyword Planner provides four metrics to help you measure ad competition and estimate costs: Competition (indexed value) The percentage of available ad spots that are typically filled. The higher the number, the harder it’ll be to earn a spot. Top of bid (low range) The lower end of what advertisers have historically bid for the top ad spot. It gives you a rough idea of the minimum cost per click in this ad space. Top of page bid (high range) The higher end of what advertisers have historically bid for the top ad spot. It gives you a rough idea of the maximum cost per click for this keyword. Competition This can be “–” (if there isn’t enough data), “Low,” “Medium,” or “High.” It reflects the number of advertisers bidding on this keyword relative to other keywords. TipClick “Add filter” (from the main “Keyword ideas” tab) to filter your keyword results based on these metrics (and others). But you might prefer to analyze competition levels in the Keyword Magic Tool. It provides two metrics that make it easy to evaluate and compare PPC keywords: “Com.” measures ad competition on a scale of 0.00-1.00—with higher numbers indicating more competition “CPC (USD)” represents the average cost per click (CPC) in your local currencyEvaluate SEO KeywordsThe competition metrics in Keyword Planner can give you a general sense of how likely you are to rank organically for a keyword. After all, more competition for ad spaces generally means more competition for organic rankings.But the Keyword Magic Tool is a particularly good option for gauging SEO ranking difficulty.Enter your domain to see a Personal Keyword Difficulty score (PKD %) for each keyword idea. This measures how hard it’ll be for your specific domain to reach the top 10 organic results. You can find filters for this metric (and others) near the top of the page:Once you find keywords you want to target, you can go ahead with creating SEO content.Step 7: Get PPC ForecastsTo see how an ad campaign using your saved PPC terms might perform, go to the “Forecast” tab in Keyword Planner.Experiment with different bid strategies, campaign dates, and budgets to see the predicted results. And try to design an ad campaign that supports your business goals.If you’re ready to progress with your plan, click “Create campaign” and follow the instructions.Take Keyword Research to the Next LevelSemrush’s Keyword Magic Tool is a great alternative or companion to Google’s Keyword Planner. It allows you to: Gather more precise keyword search volumes Check your SEO ranking potential Find keywords that trigger desirable SERP features See the search intent category for each keyword Review search results pages in one clickAnd much more.Create your free Semrush account to give it a try.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Use Google Keyword Planner"
    },
    {
      "level": "H2",
      "text": "Step 1: Access Keyword Planner"
    },
    {
      "level": "H2",
      "text": "Step 2: Discover New Keywords"
    },
    {
      "level": "H2",
      "text": "Step 3: Refine Your Keyword List"
    },
    {
      "level": "H2",
      "text": "Step 4: Look at Search Volumes"
    },
    {
      "level": "H2",
      "text": "Step 5: Separate PPC Keywords from SEO Keywords"
    },
    {
      "level": "H2",
      "text": "Step 6: Evaluate Competition Levels (and Costs for PPC Keywords)"
    },
    {
      "level": "H3",
      "text": "Evaluate PPC Keywords"
    },
    {
      "level": "H3",
      "text": "Evaluate SEO Keywords"
    },
    {
      "level": "H2",
      "text": "Step 7: Get PPC Forecasts"
    },
    {
      "level": "H2",
      "text": "Take Keyword Research to the Next Level"
    }
  ],
  "author": ""
}