{
  "url": "https://www.semrush.com/blog/google-panda/",
  "slug": "google-panda",
  "title": "What Is Google Panda? A Complete Guide",
  "description": "Panda is the name of an algorithm Google released in 2011. Learn its history, impact, and relevance.",
  "content": "What Is Google Panda?Google Panda is a search algorithm update introduced in February 2011.Panda’s goal was to reduce the number of low-quality websites on search engine results pages (SERPs). It was one of Google’s earliest updates aimed at controlling content quality.By filtering out thin and irrelevant pages, Panda helped users find more useful content on Google. Today, Google Panda no longer exists as its own entity. But it remains part of Google’s core algorithm. Why Did Google Create Panda?Google launched Panda to curb the content farms—also known as mills—that once dominated the SERPs. Content mills are companies who hire freelance writers to create content as fast as possible. They almost always favor quantity over quality. The goal of content mills was to rank well on search engines to generate more advertising revenue. They would churn out unhelpful, low-quality content in bulk—often consisting of similar topics with slight keyword variations. Before Panda, Google’s quality control wasn’t great. So these sites flooded the SERPs.This meant repetitive, untruthful, and even plagiarized content could reach the number one spot on Google. Google introduced Panda to assess the quality of web pages. And reward high-quality content with better rankings. Through its evaluation process (we’ll explore what triggers Google Panda later), Google Panda could separate content farm articles from expert-written articles. The algorithm would then penalize content farm articles, allowing quality articles to rank higher. Sites Most Affected by PandaThe Google Panda update hit content farms hard. It massively diminished their influence on search results as these sites failed to meet Google’s new (and much stricter) quality standards. For example, Demand Media was a prominent content farm valued at $1 billion in January 2011. They pumped out thousands of unhelpful articles for various clients. The company reported a loss of $6.4 million the year after Google implemented Panda.Business directories with low-quality listings and ecommerce sites with repetitive content also suffered. When rankings tanked, webmasters had to change their SEO strategies. For example, ecommerce sites now had to write unique descriptions for every product page. Above all, Panda redefined the standard of what content Google rewarded with high rankings in the SERPs. Why Is Google Panda Important?The Google Panda update dramatically improved the quality of the SERPs.Panda encouraged content creators to prioritize quality over quantity and focus on providing value. It’s something Google still focuses on today.But that’s not to say Panda defeated low-quality content once and for all. Panda has been updated several times since its initial launch. Plus, there have been many Google algorithm updates since Panda—Penguin, Pirate, and Hummingbird, to name a few. However, Panda stands out because it was Google’s first major step toward becoming a more effective search engine. Why?Because Panda represents the shift towards search engines actually answering search intent. How Google Panda Evaluates Content QualityUpdates to Panda through the years have improved how Google rewards sites with value. And penalizes publishing low-quality content.To determine a website’s quality, Panda considered aspects such as: The usefulness and uniqueness of the content. Does the content answer what the user is looking for? Is it original to the website? Or is the content thin, poorly structured, and misspelled, or plagiarized from another site? The overall quality of the user experience. Is the information on the page easy to read, or is it hidden between large advertisements? The authority and trustworthiness of the website and its authors. Is it an accurate source of information? Does the writer have experience in the field? Are the sources listed reliable? With these guidelines in mind, Google’s algorithm uses a set of rules, calculations, and ranking factors to assign each site a quality score. This helps decide how well the site will rank.Google never discloses the exact ranking signals used in the algorithm. This keeps websites from gaming the system.But Google gives us a set of Search Quality Rater Guidelines that help us understand their requirements. They include things like Experience, Expertise, Authoritativeness, and Trustworthiness (E-E-A-T), Core Updates, and Product Review Updates. Following Google’s guidelines will help your site rank. Regardless of algorithm updates, you should always strive to create high-quality content. What Triggers a Google Panda Penalty?Panda penalizes websites that produce low-quality content on the SERPs.The primary factors Panda uses to do this include duplicate, thin, or useless content. Google Panda may also lower rankings for having a high ad-to-content ratio. Or for failing to include enough E-E-A-T signals in your copy. Let’s look at these triggers more in depth: Duplicate ContentDuplicate content refers to identical or highly similar content on multiple pages. Either within a single website (internal duplicate content) or across different domains (external duplicate content).If the similarities are minimal and unintentional, your site is unlikely to be penalized. But if it appears the duplicate content is deceptive and manipulates search engine results, you’ll likely move down the SERPs.A great way to see if you have duplicate content is to use the Semrush Site Audit tool. You can set up the tool to your specifications using our guide, or use the standard settings. Once you’ve configured your settings, click “Start Site Audit.”Once the tool crawls all the pages on your site, it will produce a dashboard like this:To check for duplicate content issues, click the “Issues” tab. If you have any pages with duplicate content—or pages with content that’s at least 85% identical—the tool will flag it as an Error. It will also show you the affected URLs and give you steps to fix them.Low-Quality ContentPanda was based on the idea that low-quality content doesn’t provide value to users. Therefore, it shouldn’t be at the top of the SERPs.But what does Panda consider low-quality?Tactics like keyword stuffing (overusing keywords to manipulate the algorithm) affect readability:“If you’re searching for the best pizza in New York, our pizza restaurant is the best pizza restaurant in New York. We have the best pizza in New York, and our pizza toppings are the best in New York. Come to our pizza restaurant in New York today to try the best pizza in New York!”This paragraph is hard to read. And adds no value to the reader. The algorithm will likely prevent this content from ranking high on the SERPs based solely on its lack of readability.It might seem like an extreme example. But this kind of content was found on page one of Google before Panda. For your content to rank highly today, you need to avoid tactics like this.You can use Semrush’s On Page SEO Checker to see what pages have keyword stuffing. And other low-quality content issues.In On Page SEO Checker, click on the “Optimization Ideas” report: Click the blue “X Ideas” button next to one of the suggested URLs: If you scroll down to the Content section, you’ll see whether you have issues with keyword stuffing: Thin ContentThanks to Panda, web pages containing content with minimal text or relevance are unlikely to rank.However, thin content isn’t only pages with a low word count. This definition also covers: Auto-generated content: Text within a webpage created using a code or program. This text makes little sense but could have appeared high on the SERPs in the pre-Panda days. This machine-generated copy is low quality, incoherent, and lacking in answers. Thin affiliate pages: Pages featuring product affiliate links with descriptions and reviews. Usually reproduced from the original merchant with no original content. Spun content: This tactic involves taking a piece of content that’s already online and editing it just enough (either manually or with a tool) to pass plagiarism detectors The above content types don’t add value. They’re designed to manipulate Google’s algorithm. Panda detects these pages and adjusts rankings as necessary. Lack of E-E-A-T Panda originally dictated that websites must have Expertise, Authoritativeness, and Trustworthiness (E-A-T) signals. Google rewards sites that meet these criteria with higher rankings.In December 2022, Google updated its Quality Rater Guidelines to E-E-A-T, which added a second E for Experience.When analyzing your content, these are factors you need to consider: Experience: Do you have first-hand experience with the topic of your content or website? Expertise: Do you have the knowledge or credentials to be considered a reliable source? Authoritativeness: Do others in your industry look to you as a leader or an expert? Trustworthiness: Are you clear about who wrote your content, and is it factually accurate?If any of these are missing from your content, see what you can do to improve your E-E-A-T. A great way to check your authoritativeness? Use Semrush’s Backlink Analytics tool to get a general idea of how you compare to your competition. Enter your domain name and click “Analyze.”On the next page, you can enter up to four competitors’ websites:You’ll get a chart showing your authority score, and your competitors’:Keep in mind this isn’t exactly what Google means by authoritativeness. But it will show you what sites in your industry are an authority and give you ideas for improvement. Low-Quality User-Generated Content User-generated content (UGC) is exactly what it sounds like—content created by users. This can be anything from Facebook posts to TikTok videos.Google Panda is unlikely to lower your rankings for featuring UGC on your domain if you use it properly. If your content is of low value or obviously designed to manipulate rankings, you’ll likely be penalized. Things like spammy comment sections and poorly written guest posts.This type of content doesn’t create value for users. And it’s exactly the content Panda was created to mitigate. Excessive AdsOne question Google uses to define a high-quality site is: “Does this article have an excessive amount of ads that distract from or interfere with the main content?”This means pages composed primarily of ads with little or no original content are considered low-quality. We’re sure you’ve seen examples of pages filled with huge ads or images that impede your ability to read the text—this is something Panda aims to combat.Affiliate Links Surrounded by Low-Quality ContentThis refers to poor content with links pointing to paid affiliate programs. These programs are where a business or influencer—known as the “affiliate”—is paid a commission for sending traffic through referral links. There’s no issue with using affiliate links in your content. But the content needs to be valuable to the reader on its own. It can’t just set the stage for affiliate links so you can make a profit.How Do You Know If You’ve Been Hit by Panda? Google Panda penalizes sites with low-quality content with drops in traffic and rankings, or even deindexing pages. Let’s look at how you can tell if these issues are affecting your site. A Drop in TrafficA sudden drop in organic traffic may be a sign Panda has penalized you. Semrush’s Organic Research tool can show you traffic to your site. Just put your domain into the tool and click “Search.”From the dashboard, click on the “Traffic” graph. It will open an overview of your traffic for the selected timeframe.The chart shows we’ve had a traffic level of 2.3 million over the last month. With an 20.17% increase from the previous month.But if this figure showed a significant drop, it may be Google penalizing low-quality content on your website.To see if your traffic dip is algorithm-related, use the Semrush Sensor tool. It keeps track of changes made to Google’s algorithm. This tool checks the SERP volatility of the industry you work in. You can also see SERP volatility for your website if you have Position Tracking setup. Just click on the “Personal Score” tab: Keep in mind algorithm updates can often take several days or weeks to complete. If you see a steep drop, wait a few days and see if it recovers before taking drastic action.A Drop in Rankings Like diminished traffic, a drop in rankings could indicate you’ve failed to meet Google’s content standards. To track this, open the Organic Research tool again. From the dashboard, click “Position Changes.” You can see whether your rankings have changed dramatically over the previous month. Scroll down to see how your positions have changed for specific keywords:If it’s a Panda-related penalty, you’ll likely have a significant drop in rankings across your site. Panda penalties affect your whole domain, not just a few pages. If only a few of your keywords have dropped, it probably isn’t because of Panda. A Decrease in Indexed Pages Checking the index status of your pages regularly allows you to notice changes. You can monitor this using Google Search Console (GSC). In GSC, click “Indexing” > “Pages” on the sidebar.Here, you’ll see a graph showing the total number of indexed and non-indexed pages. And a list of the URLs on your domain with their index status. Scroll down to see the reason your pages aren’t indexed:If Panda penalizes your website, you’ll likely see more pages with “Crawled - currently not indexed.” This means Google crawled your site and decided not to index these pages. A common reason is that you have too much low-quality content.To see which pages are affected, click “Crawled - currently not indexed.” If you click “LEARN MORE,” Google will give you more information on the error. Scroll down to see a list of your affected pages:Go through the affected pages and update their content if you suspect it’s a Panda penalty. Then you can click “VALIDATE FIX” to have Google crawl the page again.How to Recover from Panda Panda penalties can be detrimental to a website's success. Thankfully, recovery is possible.Here are important initial steps to take:1. Identify the SourceBefore you can recover from a Panda penalty, it’s critical to identify the source of the problem. This can be difficult, as a Panda penalty may result from one of many factors.But as we mentioned above, three common indicators are a drop in traffic, decreased rankings, and an increase in deindexed pages.Once you identify the source of the issue, analyze affected pages. Review their content for readability, originality, and relevance.2. Revise and Refresh Your ContentAsk yourself: does your site provide content that’s informative, relevant, and user friendly? Does it satisfy E-E-A-T?If not, update your outdated content. The Semrush Topic Research tool can help you get started. Just enter a topic (or your domain) and click “Get content ideas.”When the tool loads, you’ll see several cards with content ideas for your site. The tool will also tell you if you cover the topic on your site (green cards) or not (blue cards).Clicking “Show more” at the bottom of a card will open up ideas for headings, related questions, and more. If you click “Add to your favorites” next to these ideas, the tool will add them to a list.Scroll back to the top and click “Favorite Ideas.” From here, you can send your ideas to the SEO Content Template or export to an XLSX file. Repeat the process to generate more content ideas. The more high-quality content you produce, the faster your website will recover.How Long Does It Take to Recover From a Panda Penalty?There is no set time frame for recovering from a Panda penalty. Recovering from an algorithmic action can be difficult, and resolving the issues won’t happen overnight. The timeline depends on how well you turn your website into a source of value. And how fast. It also depends on how badly your rankings dropped to begin with. The good news is, by focusing on creating high-quality content across your website, you’re unlikely to be penalized again in the future.Create Quality Content to Avoid Google PenaltiesPanda completely redefined “quality content.” And now that you know how it works, you can start creating new content for your website and avoid losing traffic.A great next step? Start building your SEO strategy with our Ultimate Guide to Content Marketing Strategy. It walks you through crafting an SEO strategy based on high-quality content that gets Panda’s stamp of approval.FAQsIs Google Panda Still a Thing?Google Panda is still very much a thing. It is now part of Google’s core algorithm. The ranking criteria it introduced in 2011—to avoid thin content, duplicate content, etc.—are still used to measure content quality. What Was Google’s Panda Update Also Known as?The Google Panda update was also known as the Farmer Update. Google’s name for the update was Panda. This nickname was in honor of Navneet Panda, the software engineer who played an integral role in making the update possible.What Is the Benefit of Google Panda?Google Panda benefits web users by improving the quality of search engine results. It rewards sites with high-quality content and a positive user experience. Its focus is on providing users with exactly what they want.Websites who have low-quality content, offer a poor user experience, and lack relevancy get a lower search results ranking. What Is the Difference Between Google Panda and Google Penguin?Panda’s ranking factors target low-quality content, while Penguin focuses on spammy or manipulative link-building practices. Panda gave site-wide penalties, meaning it affected all pages on a site. Google Penguin’s penalties are page-specific; they’re applied on individual pages and require you to clean up your link profile before they’re lifted. Is Word Count a Factor for Panda?Word count was not a factor for Panda, and there’s still no set minimum word count your pages should have today. Instead, Google encourages websites to use as many words as required to bring the reader value. Can External Factors Like Backlinks Impact Google Panda Algorithm Penalties?Building a more robust backlink profile is essential as a general SEO practice. However, Panda didn’t deal directly with backlinks. It’s Google Penguin that’s responsible for these external factors. How Often Should I Update My Website’s Content to Comply with Google’s Panda Algorithm?Google is constantly changing, and so are its trends, to keep high-quality content ranking. However, update your website as often as required to stay ahead of your competition.For instance, if you have a product review article dated 2023, and your competition has one with 2024 in the title, users are more likely to click the latter for up-to-date information.",
  "headers": [
    {
      "level": "H1",
      "text": "What Is Google Panda? A Complete Guide"
    },
    {
      "level": "H2",
      "text": "What Is Google Panda?"
    },
    {
      "level": "H3",
      "text": "Why Did Google Create Panda?"
    },
    {
      "level": "H3",
      "text": "Sites Most Affected by Panda"
    },
    {
      "level": "H2",
      "text": "Why Is Google Panda Important?"
    },
    {
      "level": "H2",
      "text": "How Google Panda Evaluates Content Quality"
    },
    {
      "level": "H2",
      "text": "What Triggers a Google Panda Penalty?"
    },
    {
      "level": "H3",
      "text": "Duplicate Content"
    },
    {
      "level": "H3",
      "text": "Low-Quality Content"
    },
    {
      "level": "H3",
      "text": "Thin Content"
    },
    {
      "level": "H3",
      "text": "Lack of E-E-A-T"
    },
    {
      "level": "H3",
      "text": "Low-Quality User-Generated Content"
    },
    {
      "level": "H3",
      "text": "Excessive Ads"
    },
    {
      "level": "H3",
      "text": "Affiliate Links Surrounded by Low-Quality Content"
    },
    {
      "level": "H2",
      "text": "How Do You Know If You’ve Been Hit by Panda?"
    },
    {
      "level": "H3",
      "text": "A Drop in Traffic"
    },
    {
      "level": "H3",
      "text": "A Drop in Rankings"
    },
    {
      "level": "H3",
      "text": "A Decrease in Indexed Pages"
    },
    {
      "level": "H2",
      "text": "How to Recover from Panda"
    },
    {
      "level": "H3",
      "text": "1. Identify the Source"
    },
    {
      "level": "H3",
      "text": "2. Revise and Refresh Your Content"
    },
    {
      "level": "H2",
      "text": "How Long Does It Take to Recover From a Panda Penalty?"
    },
    {
      "level": "H2",
      "text": "Create Quality Content to Avoid Google Penalties"
    },
    {
      "level": "H2",
      "text": "FAQs"
    },
    {
      "level": "H3",
      "text": "Is Google Panda Still a Thing?"
    },
    {
      "level": "H3",
      "text": "What Was Google’s Panda Update Also Known as?"
    },
    {
      "level": "H3",
      "text": "What Is the Benefit of Google Panda?"
    },
    {
      "level": "H3",
      "text": "What Is the Difference Between Google Panda and Google Penguin?"
    },
    {
      "level": "H3",
      "text": "Is Word Count a Factor for Panda?"
    },
    {
      "level": "H3",
      "text": "Can External Factors Like Backlinks Impact Google Panda Algorithm Penalties?"
    },
    {
      "level": "H3",
      "text": "How Often Should I Update My Website’s Content to Comply with Google’s Panda Algorithm?"
    }
  ],
  "author": ""
}