{
  "url": "https://www.semrush.com/blog/google-december-2020-core-update-1/",
  "slug": "google-december-2020-core-update-1",
  "title": "Analyzing Google’s December 2020 Core Update",
  "description": "On December 3rd, 2020 Google announced that a core algorithm update was rolling out. Check which industries are the SERP winners and losers and which websites seem to be the most affected ones so far.",
  "content": "Just as most of us were preparing the holiday chill, Google gave us an early Christmas “present” - a new core algorithm update which officially started rolling out on December 3, 2020. The December 2020 Core Update is now rolling out live. As is typical with these updates, it will typically take about one to two weeks to fully roll out. — Google SearchLiaison (@searchliaison) December 3, 2020 SearchLiaison’s tweet confirmed that, by the time it's Christmas, we should have witnessed the full reach of the third core update for 2020. Early Signs of a Core Update with Substantial Impact At the outset, the December 2020 core update looked like it could have an even bigger impact than the one back in May. Early Semrush Sensor data suggested this could be the case, as the average SERP volatility on December 4 had a score of 9.4 - similar to the May 2020 core update. January’s core update stood at a comparably lower 8-point mark. Semrush Sensor data Since we’re still only in the first few days from roll-out, I’d suggest we wait until the update has finished to understand its full impact. In the meantime, keep an eye on your traffic and visibility changes. Even if you’re hit pretty hard at the start of a core update, it’s not uncommon to recover (even partially) while the update is still taking place. December 2020 Core Update Winners and Losers Multiple sectors seem to be affected this time. On December 4, the second day of the roll-out, SERPs for most site categories reached a 9.4 volatility mark (and all of them presented volatility above 9), even SERPs that on the first day of the update seemed to be relatively unaffected by it like Books & Literature and Real Estate. Even “green zone” categories (industries that rarely experience any noticeable volatility outside a broad algorithm update) this time shook hard. On the same day, we also spotted a sudden spike in Shopping results on SERPs, which then quickly returned to pre-update levels. Semrush Sensor data The most affected industries In general, sectors affected the most across both desktop and mobile are Health, Real Estate, and Law & Government. On desktop search, the Travel and Finance categories were also seeing high volatility rates in the first days of this roll-out; on mobile, Jobs & Education and Pets & Animals sector sites. The most affected sites by domain size It seems that larger domains are so far seriously affected. Almost 50% of the biggest winners and losers so far are domains with traffic surpassing 1 million monthly visitors. 1 in 3 domains experiencing visibility drops are sites with over 10 million visitors per month. The most affected sites by category As a broad algorithm update, this has a significant impact across numerous industries. Below, we have grouped winning and losing domains by industry. SERPs Winners On the winning side are sites operating within the Business & Industrial, Internet & Telecom and Beauty & Fitness industries. On average, the biggest SERPs winners gained 20 positions, with sites like zoominfo.com (a for-sale business contact database) seeing their average rankings jumping 67 positions on December 3 and 4. LinkedIn was another big winner, moving up 47 positions on average on the day. With the results of the pandemic still dominating the economy, these substantial adjustments could reflect the rapidly changing landscape in business and recruitment. Here are the 10 sites that witnessed the largest position spikes on the first day of the December 2020 core update: Top 10 SERP Winning Domains (Dec 3-4) Domain Gained Positions Average Position (Post-update) Site Category zoominfo.com 67 13 Business & Industrial whitepages.com 55 15 Internet & Telecom linkedin.com 47 11 Business & Industrial ebay.com 44 12 Shopping vimeo.com 37 14 Arts & Entertainment loginbrain.com 35 10 Reference yahoo.com 33 13 News foursquare.com 32 13 Business & Industrial businesswire.com 30 13 Business & Industrial soundcloud.com 27 14 Arts & Entertainment SERP Losing Domains Among the domains that saw the biggest organic visibility losses, sites in the Online Communities, Shopping and News sectors present the biggest position drops. On December 4, the average position loss for sites across the worst affected industries was a whopping 23 positions. But domains like yellowpages.com and newsbreak.com saw even more dramatic drops, losing 94 and 83 positions respectively in a single day. Here are the top 10 sites that suffered the most when December’s core update starting rolling out: Top 10 SERP Losing Domains (Dec 3-4) Domain Lost Positions Average Position (Post-update) Site Category yellowpages.com -94 16 Internet & Telecom newsbreak.com -83 18 News gettyimages.com -55 15 Shopping wish.com -48 18 Shopping echovita.com -39 16 Reference urbandictionary.com -37 14 Reference local.com -36 16 People & Society dnb.com -35 14 Business & Industrial aliexpress.com -35 15 Shopping findanyanswer.com -34 16 Reference Navigating Through the December 2020 Update The SEO community seems to be questioning the bad timing of the update - sure, it was rolled out after Black Friday and Cyber Monday, but right before Christmas (and in a year like 2020!). Marie Haynes dag out this tweet by Matt Cutts from 2013: This didn't age well. https://t.co/GhFnYhFXWT — Marie Haynes (@Marie_Haynes) December 3, 2020 Although John Mueller told Barry Schwartz that he sees no issue, for many businesses whose biggest sales surge occurs just before the Christmas holidays, this algorithm update could cause significant distress. As with all other core updates, Google’s advice remains consistent: Invest in creating high-quality content that follows best-in-class industry practices; Make use of structured data to help search engines uncover the most relevant content per search query; and Fix any SEO issues that hinder smooth user experience. Wait until the update’s fully rolled-out before you decide to make any significant changes to your website. Although Google claims that sites can see some recovery in-between core updates, if you’ve been negatively affected you will still have to work on perfecting your SEO and content experience after this update is complete: Make sure to run a full site audit to fix any major and minor SEO issues. Our Site Audit tool can help you detect potential issues and offer improvement suggestions. Keep monitoring your online visibility and rankings - the Position Tracking tool’s custom triggers can be a big help here if you want to spot any position drops in a timely manner.",
  "headers": [
    {
      "level": "H1",
      "text": "Analyzing Google’s December 2020 Core Update"
    },
    {
      "level": "H2",
      "text": "Early Signs of a Core Update with Substantial Impact"
    },
    {
      "level": "H2",
      "text": "December 2020 Core Update Winners and Losers"
    },
    {
      "level": "H3",
      "text": "The most affected industries"
    },
    {
      "level": "H3",
      "text": "The most affected sites by domain size"
    },
    {
      "level": "H3",
      "text": "The most affected sites by category"
    },
    {
      "level": "H3",
      "text": "SERPs Winners"
    },
    {
      "level": "H4",
      "text": "Top 10 SERP Winning Domains (Dec 3-4)"
    },
    {
      "level": "H3",
      "text": "SERP Losing Domains"
    },
    {
      "level": "H4",
      "text": "Top 10 SERP Losing Domains (Dec 3-4)"
    },
    {
      "level": "H2",
      "text": "Navigating Through the December 2020 Update"
    },
    {
      "level": "H6",
      "text": "Most popular pages"
    },
    {
      "level": "H6",
      "text": "SEO Checklist: 41 Tips to Optimize Your Website"
    },
    {
      "level": "H6",
      "text": "How to Perform a Complete SEO Audit (in 14 Steps)"
    },
    {
      "level": "H6",
      "text": "A Beginner’s Guide to Keyword Search Volume"
    }
  ],
  "author": ""
}