{
  "url": "https://www.semrush.com/blog/google-local-services-ads/",
  "slug": "google-local-services-ads",
  "title": "Google Local Services Ads: What They Are & How to Set Them Up",
  "description": "Learn how to set up Google Local Services Ads to get qualified leads from customers in your area.",
  "content": "What Are Google Local Services Ads?Google Local Services Ads are paid ads that help local service businesses collect leads directly through phone calls and message requests. They only appear for relevant local businesses to the person searching. And at the very top of Google’s search results. These ads can display the company’s name, reviews, ratings, city, phone number, opening hours, and more. Like this:So businesses can connect with qualified leads, ready to convert. The Difference Between Local Services Ads and PPCYou pay per lead with Local Services Ads (LSA). Unlike pay-per-click (PPC) advertising, where you pay when someone simply clicks on your ad.There’s no direct keyword bidding on ads for Local Services. You can instead let Google set your bid. Or manually set your own maximum bid per lead. Another important difference is where your ads appear. PPC ads show up above or below Google search results. Like so:And on other Google search partner websites.Whereas Local Services Ads always appear at the top of Google’s search results. Like this:Plus, with PPC, you need to do the hard work of keyword research and A/B testing to show up for the right search queries and find customers. But with LSAs, Google automatically generates your ads and determines rankings by your review rating, response rate, and proximity to a searcher’s location. And you’ll only pay if a customer calls, books, or messages you directly through the ad.Note: Google LSAs shouldn’t replace PPC ads or organic listings. They simply provide a way to reach different customers at a different stage of the marketing funnel.. How to Know if Your Business Qualifies for Local Services AdsCurrently, Local Services Ads are available for certain service categories and locations. Here are the countries where you can currently run Local Services Ads: Austria Belgium Canada France Germany Ireland Italy Spain Switzerland United Kingdom United StatesAnd these are many of the supported service categories: Appliance repair services Carpenters Carpet cleaning services Cleaning services Countertop services Electricians Fencing services Flooring services Foundations services Garage door services General contractor services Handyman Home inspection services HVAC (heating or air conditioning) Junk removal services Landscaping services Lawn care services Moving services Pest control services Plumbers Pool cleaning services Pool contracting services Roofers Siding services Snow removal services Tree services Water damage services Window cleaning services Window repair servicesNote: The supported services may vary by location. For example, law firms can use LSAs in the United States but not in the United Kingdom. Use Google to check your business eligibility.But even if your business is eligible, you must pass Google’s screening and verification process before running Local Services Ads. The process varies by industry and location. And may include background, business registration, insurance, and license checks. Check Google’s business screening and verification requirements to view requirements by business category.Then, set up your Local Services account and wait for approval. How Much Do Google Local Services Ads Cost? Local Services Ads are pay-per-lead and can cost around $25 USD per lead. Costs can vary widely. Your exact LSA cost will depend on your location, industry, and competitors. For a rough estimate, check out Google’s cost tool. The great thing about Google Local Ads, though, is that you control your budget. You set your budget based on the number of leads you want per week. And once you reach your monthly limit, your ad stops showing. Unless, of course, you increase your budget. What Is Google Guarantee?The Google Guarantee is a badge that appears in Local Services Ads for home service providers. It shows potential customers that Google has vetted your business. Only home service businesses that have passed Google’s screening and verification process can get a badge. Which can give customers peace of mind. This is what the Google Guarantee looks like:An additional benefit of the Google Guarantee badge is that Google may reimburse customers who are dissatisfied with the quality of your work. At no cost to you. These are the lifetime reimbursement limits for each country: United States: $2,000 Canada: CAD $2,000 United Kingdom: GBP £1,500 Ireland: EUR €1,500 Spain: EUR €1,500 France: EUR €1,500 Italy: EUR €1,500 Germany: EUR €1,500 Austria: EUR €1,500 Belgium: EUR €1,500 Switzerland: CHF ₣2,000Note: Customers must book services through Local Search Ads to be eligible for reimbursement. And reimbursement is solely at Google’s discretion.Google will not reimburse customers for add-ons or future projects, damages to property, dissatisfaction with price or provider responsiveness, or cancellations.Read Google’s reimbursement guide to learn more about how the process works for customers.What Is Google Screened?Google Screened is an endorsement badge that shows that a professional service business has passed license checks. Which can help build trust with potential customers.The free screening process verifies that professional licenses are current. Both when businesses join Local Services and on an ongoing basis. The Google Screened badge covers professional services, including the following: Law Financial planning Real estate Child care or preschool industriesHere’s what the Google Screened badge looks like:Note: The Google Screened badge is currently only available for businesses in select verticals in the United States. How to Set Up Google Local Services AdsSetting up Google Local Services Ads is easy. Here’s the process, step by step:1. Create Your Profile and Check for EligibilitySet up your account by navigating to the Google Local Services Ads page. If you already have a Google Ads account, click “Sign in.” If you don’t, click “Get started.” Next, fill in your location information and job (services) category. Click “Check Eligibility.”Then, create your profile by filling in all your business details. Including name, address, website, service areas, service types, business hours, and more. Some fields are optional. But the more information you give Google, the better your chances of getting approved. The final step is a generic preview of your ad and how it’ll be displayed. You can’t edit anything in this step. It’s just a preview of what your ad can look like in Local Services Ads. 2. Prove Your Business Is TrustworthyIn the next step, you’ll get the chance to let Google know your business is trustworthy. Depending on your location and service category, you’ll be asked to provide more or less information. For example, Google may ask for details regarding your business license or proof of insurance. If so, fill out those sections with as much detail as possible. Then, with all the information you’ve entered, Google will automatically start looking for reviews on your Google Business Profile. Note: Your review score and the number of reviews play a big role in how Google ranks your business. If you don’t have customer reviews yet, click on “See link options.”You can send these links to previous or current customers to get reviews. Any review you get from these links will be shown as verified reviews. The next step is to choose the type of bidding you want. And your weekly budget. You can choose one of Google’s suggested budgets or set your own. The final step is adding your billing information. If you already have a Google Ads account, Local Services can use your existing payment information. If you don’t, fill this section in. And you’re done! 3. Wait for ApprovalGoogle’s screening and verification process can take anywhere from a couple of days to weeks. It depends on your business type and the state, province, and country in which you operate. (Among other factors.)To learn what’s required to complete your screening and verification, check out Google’s requirements page. There, scroll down to select your country and business category. How to Manage Your Local Services AdsOnce approved, you’ll see your account in the “Live Accounts” section within your dashboard. But Google Service Ads don’t launch automatically. To start running ads, click on your “Account name” and then hit “Edit Profile.”Then, you’ll see a switch button that says, “Your ad is paused.” Toggle it on to launch your Local Services Ads. Manage Your AccountAfter turning your ads on, scroll down to view and edit your account details.The “Budget” box shows your bidding mode, weekly budget, and leads. If you want to increase or decrease your budget, click the pencil icon at the top right. And adjust accordingly. “Job types” lists all the services you offer. If you add or remove services at any point in time, adjust them here. Below that, you’ll see two sections that aren’t part of the approval process.The first is “Photos.”Upload high-quality photos of your team, work, or equipment. This can give potential customers an impression of what your business looks like. It helps build trust and reputation. For more information, check out the Local Services Ads photo guidelines.The second is “Message Leads,” under “Settings.” Turn this option on so leads can contact you via message and email. In addition to calls. Messages are 50% of the cost of a phone lead. Note: Messaging is currently only available in the U.S. and Canada. Then, if you scroll down a little more, you can confirm your service areas and business hours. Manage Your LeadsLeads are folks who have shown interest but aren’t customers yet. So, the sooner you follow up, the higher your chances of converting that lead into a customer. To see (and manage) your leads, click on “Leads” in the left-hand column. Note: You can also manage your leads via the Local Services app on Android and iOS. This dashboard shows your new, active, booked, and completed leads. As well as a list of each customer, job type, location, lead type, and last activity. If you click on a lead, you’ll see a summary. Including the status, lead type, business category, and a few sections for you to add additional information. You can even listen to call recordings (U.S. and Canada only). Here are the steps you can take after reviewing your leads: Reply by sending your message as an email or text message (U.S. and Canada only) Call the lead based on the phone number they listed Decline the requestOnce you respond to a lead, their status becomes “Active.” You can find all active leads in the “Active” section of the dashboard.After you book a job, mark that lead as “booked” to track upcoming jobs.Like so:This feature helps you schedule upcoming appointments, send confirmation emails, and gather customer reviews. Manage Your ReportsTo review your budget and lead performance, head to the “Reports” section. You’ll see an overview of your budget, how many leads you’ve been charged for, and any appointments booked. If you scroll down, you’ll see specific information about your leads. Like phone number, name, lead type, and business category.This specific information can help you evaluate whether the leads coming in are high-quality. Or if you’d need to tweak anything to get better results.Plus, this is data coming directly from the ad platform. Something you don’t get with regular Google Ads campaigns. You can also use the drop-downs to change the “charge status” and “lead status.” And get more granular information. Manage Your ReviewsYour star rating and number of reviews impact how Google ranks your business within Local Services Ads. Businesses with higher ratings and more reviews stand out. And tend to book more jobs. Which means: When managing your Local Services Ads, one of the most important elements is generating reviews. And following up with them. To start, go to the left-hand column and click “Reviews.” You’ll see an overview of the reviews you’re getting. And a list of the jobs you’ve completed for your customers. Click on “Ask for review” under the “Action” column to ask customers about leaving a review on Google for you. Customers are more likely to leave a review if the request comes directly from you. So don’t be afraid to reach out and ask customers directly for Google reviews. Also, reply to every review. It shows customers you value their business and feedback. But you can’t respond to any reviews from your Local Services Ads account. You’ll need to do that directly on your Google Business Profile. Or use a tool like Semrush’s Listing Management. You’ll be able to see all your reviews in one place. And reply quickly to help your business gain more trust online.Improve Your Local Services Ads PerformanceThough Google Local Services Ads always show up at the top of Google’s search results, there is still limited space. Up to three Local Services Ads can appear on desktop. And two on mobile. Meaning you need to optimize your profile as much as possible to get higher rankings. Google ranks Local Services Ads by evaluating the following: Your maximum bid amount per lead Your proximity to the searcher’s location Your responsiveness to customer questions and requests Your review rating and number of reviews So, play around with your budget to find that range where you feel comfortable paying for the leads that are coming in. And pay very close attention to your reviews. Ask for as many reviews as you can. And reply to all of them in a timely manner.",
  "headers": [
    {
      "level": "H1",
      "text": "Google Local Services Ads: What They Are & How to Set Them Up"
    },
    {
      "level": "H2",
      "text": "What Are Google Local Services Ads?"
    },
    {
      "level": "H2",
      "text": "The Difference Between Local Services Ads and PPC"
    },
    {
      "level": "H2",
      "text": "How to Know if Your Business Qualifies for Local Services Ads"
    },
    {
      "level": "H2",
      "text": "How Much Do Google Local Services Ads Cost?"
    },
    {
      "level": "H2",
      "text": "What Is Google Guarantee?"
    },
    {
      "level": "H2",
      "text": "What Is Google Screened?"
    },
    {
      "level": "H2",
      "text": "How to Set Up Google Local Services Ads"
    },
    {
      "level": "H3",
      "text": "1. Create Your Profile and Check for Eligibility"
    },
    {
      "level": "H3",
      "text": "2. Prove Your Business Is Trustworthy"
    },
    {
      "level": "H3",
      "text": "3. Wait for Approval"
    },
    {
      "level": "H2",
      "text": "How to Manage Your Local Services Ads"
    },
    {
      "level": "H3",
      "text": "Manage Your Account"
    },
    {
      "level": "H3",
      "text": "Manage Your Leads"
    },
    {
      "level": "H3",
      "text": "Manage Your Reports"
    },
    {
      "level": "H3",
      "text": "Manage Your Reviews"
    },
    {
      "level": "H2",
      "text": "Improve Your Local Services Ads Performance"
    }
  ],
  "author": ""
}