{
  "url": "https://www.semrush.com/blog/how-to-add-keywords-to-google-my-business/",
  "slug": "how-to-add-keywords-to-google-my-business",
  "title": "How to Add Keywords to a Google My Business Profile",
  "description": "Learn where and how to add keywords to a Google My Business profile with our step-by-step guide.",
  "content": "Google My Business (GMB), now called Google Business Profile (GBP), is a free tool that lets you control how your business shows up on Google Search, Google Maps, and Google Shopping.Adding relevant keywords to your Business Profile can make your business more visible and drive local search traffic to your website. Here’s how to do it.Access Your Google Business ProfileIf you haven’t set up your Google Business Profile yet, do that first. Learn how in our Ultimate Guide to Google My Business. Then head back here to start adding your keywords.If your Google Business Profile is all set up, login to your Google account and go to the Google Business Profile page.Click “Manage now.”You’ll see a menu with various ways to interact with and adjust your company’s profile.We’ve created a dummy business profile that we’ll use to show you how to add keywords.Our dummy profile isn’t verified because we don’t want it to appear online. But be sure to verify your account so that people can find your business. Learn more about verification in our full GMB guide.Click the “Edit profile” button to start using the keyword tips in this guide.Add Keywords as Business CategoriesThe keyword in your Business category field is the most foundational keyword for pointing people to your business. Make sure yours describes what you do accurately.Our profile contains “Florist.” This targets the broadest customer base.A search for “florists in New York”, for example, brings up a list of local businesses that self-categorize as florists.You added at least one keyword to your Business category when you originally set up your profile.Adding more ensures you appear for as many relevant searches as possible. So let’s do that now.Click on “Business category.”Click on “+ Add another category.”You’ll notice this is not an open text field. Google limits the categories you can choose and the specific wording available for each available category. Start typing keywords relevant to your business to see related categories appear. You’ll have to select from the list provided. For example, you can type in “flower shop” but can’t select it. You need to pick “florist,” “wholesale florist,” or similar from the provided options. This keeps Google search results organized and consistent.For our example business, we added “Wholesale florist” as an additional category to specifically target business customers.Add as many keywords as you think accurately describe your business. This way, people searching for different terms are more likely to find your business.Once you’re happy with your list of additional categories, hit “Save” and check out your updated profile.Add Keywords to Your Business DescriptionAdding keywords to your business description helps Google and people searching on Google better understand what you do, who you serve, and what you sell.Weave relevant keywords naturally into the descriptive text and avoid keyword stuffing. This ensures your description is valuable, relevant, and easy to understand.A great business description explains: What you offer What sets you apart Your history Anything else that’s helpful for customers to knowHere’s an example from a florist in San Diego.Find the “Business information” window again. Click the “Description” field to open a text box.Type or paste in your business description which uses the specific keywords you want to include.In this example we’ve included search terms that our florist’s ideal customers may enter into Google. Like “wholesale flower orders,” “skilled florists,” and “locally sourced flowers.”When done, hit “Save.”You can always revisit this description to make tweaks as your business evolves.Add Keywords to Your Product DescriptionsAdding keywords to product and service descriptions helps Google and its users understand what you offer and who it’s most valuable to.Find the “Your business on Google” menu again. Select “Edit products.”If you haven’t added products to your profile, another window will pop up. Click “Get started” to proceed.If you have previously added products to your profile, you’ll see a list of them like this:Click on any product. This will take you to a window where you can edit details including the product description. If it’s your first time, the fields will be empty.Use the text box to describe your product clearly. Readers should immediately understand its value. Include target keywords as you see fit.In this example, we chose “white and pink flowers” and “perfect Easter gift.” The first is a simple description. It’s a common color combination our customers search for. The second is a seasonal description to capture spikes in search intent.Hit “Publish” and move on to the next product on your list.Add Keywords to Your Service DescriptionsBusiness profiles in some categories have the option to add services too. You can add keywords to descriptions here just like you would for products. Our florist example doesn’t have an option for listing services, so let’s use the example of a marketing agency.Find the “Your business on Google” menu again. Notice it gives you extra options in the menu for “Edit services” and “Bookings.”Click “Edit services.”Here, you can choose from Google’s suggested services or add a custom service. If you click to add a custom service, you can add in a name for it.When you’ve added your services, hit “Save.”You can edit your service details on the next page when you click on the service name.Add in the relevant information, including the keywords you want to include. Then hit “Save.”Add Keywords as Business AttributesAdding factual attributes to your profile makes it more likely your business will show up in your target customers’ search results.Factual attributes are predefined descriptions of something your business has or does. Like whether your restaurant has outdoor seating or whether your store offers delivery.For example, if we search “Denver donuts delivery,” the top Places results are businesses that confirmed when building or editing their Google Business Profile that they deliver.Notice: in the Places results list, “delivery” is in bold each time. That’s Google highlighting the results’ relevance. As it does with keywords in general search rankings.Note: Factual attributes differ from subjective attributes, like whether a cafe is child-friendly or suitable for groups. Google sources subjective attributes through customers’ opinions.To add factual attributes for your business, find the “Your business on Google” menu again. Select “Edit profile.”On the “Business information” page, select “More” from the top row of tabs.You can add a range of attributes, from seating and delivery options to payment methods and amenities.Click on any field to edit it. Click “Save” to confirm your changes.Add as many attributes as are relevant and accurate for your business. Revisit your profile at least monthly to check that your attributes are still correct. Otherwise you risk showing up for irrelevant searches or misleading potential customers.How to Find Keywords That’ll Drive More TrafficThe right keywords can increase relevant search traffic. They improve discoverability and help your audience find your business when they search.The easiest way to find keywords worth including in your Google My Business profile is with a keyword research tool.Here are some easy techniques to start.Tip: Create a free Semrush account to get 10 free searches per day. Then try the following methods for yourself.Use a Seed Keyword to Generate Fresh IdeasA seed keyword is a broad keyword that describes your niche. You use it to discover more relevant keyword ideas.Our florist might use the term “flowers.” We’ll run with that example throughout this guide.To start, enter your seed keyword into a keyword research tool. The Keyword Magic Tool is a great option.Choose your target location and hit “Search.”The tool will list all the keyword suggestions relevant to your chosen seed term. In this case there are more than 1.4 million.Some of these terms will be irrelevant or too competitive. For example: The keyword phrase “flowers miley cyrus” refers to a pop song. Using that keyword would attract the wrong traffic. And “flowers” by itself would be difficult to rank for at first because it’s highly competitive. Notice it has a monthly search volume of 1 million and the highest keyword difficulty.Thankfully we can dig deeper into our niche using the topical groups and subgroups in the column to the left of the main list. There we should find relevant keywords that will help us stand out.Hide irrelevant keyword groups by clicking the eye icons next to them.If we click the topical group “wedding” and subgroup “bouquet,” we get a list of around 1,400 audience-relevant keyword suggestions related to wedding bouquets.To use your time and budget efficiently, identify keywords with: Lower-than-average keyword difficulty ratings (KD%) Significant search volumes (the average number of monthly searches for a given keyword over a 12-month period).Like these:Then build those keywords into your Google My Business listing in places like your product description.Another useful tool you can use is Keyword Strategy Builder. In it, you can create keyword lists for easy tracking and future reference. Then, add terms you want to target in a marketing campaign by clicking the “+” symbol next to the term wherever you see it in a Semrush tool. Once you collect your starting list, the Keyword Strategy Builder can cluster the keywords into related groups. Create a dedicated Google Business Profile list to keep your data organized.Identify Ranking Opportunities Through Competitor Research The Organic Research tool can help you find relevant keywords where your competitor doesn’t appear in the local packs. These are prime opportunities.Because our example business is a florist, we’ll use well-known competitor FTD as an example.To start, enter the URL for your competitor’s website into the search box.Use the drop-down to choose your target location.Then hit “Search.”You’ll see that more than 141,500 keywords drive traffic to the FTD site via Google’s top 100 organic search results. Below the statistics, we get a list of the top-performing terms. Toggle to “SERP Features” to see keywords that display additional features in the SERPs. The top terms aren’t useful for our own profile. They are too broad. Dig deeper by clicking “View all keywords.”In the full report, we’ll want to filter results to view only those keywords with SERP features that our competitors don’t rank for. In the SERP features drop-down, click “Domain doesn’t rank” then “Local pack.” In this example, enriching your Google Business profile with relevant keywords listed here can help it show up for related searches and capture more traffic. Further reading: These are just a couple of simple, data-driven methods to generate keyword ideas using keyword research tools. Learn more about the broader research process in our keyword research guide.5 Pro Tips to Optimize Your Google Business ProfileNow you know how to add the right keywords to Google My Business. How else can you optimize your profile for more traffic?Here are five tips to increase clicks and conversions through Google Search, Maps, and Shopping.1. Review NAP Accuracy and ConsistencyYour company’s name, address, and phone number—known as “NAP”—are the most important pieces of information in your Google Business Profile.Why?Because these details help potential customers quickly identify and discover your business. Keeping them current makes that possible.And keeping them consistent everywhere your business appears online prevents confusion.First ensure everything is correct in your business account.Open the “Business information”window by selecting “Edit profile.”On the “About” tab, look for your “Business name.”Click the existing entry to edit it. Match all other branding to the letter. Make sure the name is capitalized consistently everywhere it’s listed and watch out for regional spelling nuances (e.g., “color” vs. “colour”).Click “Save,” to capture any changes.Then hit the “Contact” tab at the top or scroll down to find your listed “Phone number” and “Business location.” Check them for accuracy and click existing entries to edit them if needed. Click “Save,” for any changes.The easiest way to keep NAP info consistent across multiple directories is to use the Listing Management tool.It allows you to: Edit multiple directory records in one go (70+ for the US, 40+ for other countries) Keep listings free of duplicates, which optimizes your company’s visibility Get reports on how often people search for your business and how often Google displays itFurther reading: Learn more about the Listing Management tool and the benefits of keeping NAP records consistent in our Knowledge Base guide on Listing Management.2. Respond to Customer ReviewsReviews play a key role in your business reputation. They’re one of the first things people see when they search for your company on Google.That means it’s essential to keep track and reply when appropriate.To access your reviews in GBP, find the “Your business on Google” menu again. Select “Read reviews” from the menu.You’ll see all your latest reviews. Respond to each one as you see fit.Acknowledge positive feedback publicly and address negative comments. This shows you value customer satisfaction and personalizes the experience.48.17% of buyers give brands the benefit of the doubt after getting an apology and explanation according to Trust Signals researchers.That means apologizing could save you from further bad press. Or even encourage a positive review about your customer service.To respond to reviews from multiple platforms in one place you can integrate your Google Business Profile with the Listing Management tool.3. Use Google Posts to Update CustomersGoogle Posts help you improve the customer experience. They allow you to share time-sensitive information and important updates directly to Google Search, Maps, and Shopping.Posts show in your profile like this:Posting regularly also shows you’re active online. It implies to visitors that the rest of your profile is up to date too.In the example above, someone searching for Asmara Coffee House would see the closure notice and know to delay their trip.You can also share information on promotions, events, and new products through your business posts. Add images to grab searchers’ attention faster.Whenever you have something new to share, find the “Your business on Google” menu and click “Add update.”Add a description, photos, even a button if you like, and click “Post.”4. Add Images to Your ListingAdding images to your Google Business Profile can help you stand out in the search engine results pages (SERPs).Here’s a great one from South Bay Skates. It shows people what to expect when they visit the store.You can add four types of images to your GMB profile: Logo: Your visual identity when you post updates or reply to reviews Cover photo: A single image that represents your business (like the South Bay Skates example above) Photo: Images that give customers extra insight into your company (e.g., interior and exterior shots or pictures of the team) Product image: Photos of specific products listed on your profileTo add a logo, cover photo, or photo, select “Add photo” from the “Your business on Google” menu.Select the type of image you’d like to add.To add a product image, go back to the “Your business on Google” menu and select “Edit products.”Add a new product (with images) or edit existing product images by clicking on them individually.Here are GBP’s photo size guidelines: Format: JPG or PNG Size: Between 10 KB and 5 MB Recommended resolution: 720 px tall, 720 px wide Minimum resolution: 250 px tall, 250 px wide Quality: Ensure the photo is in focus and well lit, without significant alterations or excessive use of filters5. Prioritize User ExperienceGreat user experiences signal to Google and potential customers that they should visit your page. After all, great experiences are what Google strives to provide for searchers.Give users the necessary information to assess your business and make buying decisions. This includes essentials like accurate opening times, attributes, and contact information.And inform customers about changes to your business even when they’re not positive or exciting.Increasing your costs? Prepare customers and explain your reasons.Closing early? Post about it to prevent disappointment and reputational damage.Finally, own up to and address mistakes and issues that customers highlight in messages and Google reviews. This could save you from bad press and even get you some positive press.Maintain Your Google Business Profile with SemrushAdding keywords to GMB isn’t a one-time thing. Searchers’ interests change over time. So will your business. Your profile’s content must reflect both.To stay on top of changes, build profile optimization into your digital marketing strategy.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Add Keywords to a Google My Business Profile"
    },
    {
      "level": "H2",
      "text": "Access Your Google Business Profile"
    },
    {
      "level": "H2",
      "text": "Add Keywords as Business Categories"
    },
    {
      "level": "H2",
      "text": "Add Keywords to Your Business Description"
    },
    {
      "level": "H2",
      "text": "Add Keywords to Your Product Descriptions"
    },
    {
      "level": "H2",
      "text": "Add Keywords to Your Service Descriptions"
    },
    {
      "level": "H2",
      "text": "Add Keywords as Business Attributes"
    },
    {
      "level": "H2",
      "text": "How to Find Keywords That’ll Drive More Traffic"
    },
    {
      "level": "H3",
      "text": "Use a Seed Keyword to Generate Fresh Ideas"
    },
    {
      "level": "H3",
      "text": "Identify Ranking Opportunities Through Competitor Research"
    },
    {
      "level": "H2",
      "text": "5 Pro Tips to Optimize Your Google Business Profile"
    },
    {
      "level": "H3",
      "text": "1. Review NAP Accuracy and Consistency"
    },
    {
      "level": "H3",
      "text": "2. Respond to Customer Reviews"
    },
    {
      "level": "H3",
      "text": "3. Use Google Posts to Update Customers"
    },
    {
      "level": "H3",
      "text": "4. Add Images to Your Listing"
    },
    {
      "level": "H3",
      "text": "5. Prioritize User Experience"
    },
    {
      "level": "H2",
      "text": "Maintain Your Google Business Profile with Semrush"
    }
  ],
  "author": ""
}