{
  "url": "https://www.semrush.com/blog/how-to-find-commercial-intent-based-keyword-phrases-for-any-niche/",
  "slug": "how-to-find-commercial-intent-based-keyword-phrases-for-any-niche",
  "title": "A Guide to Commercial Intent Keywords & How to Find Them",
  "description": "Commercial intent keywords are searches made by customers who are nearly ready to buy.",
  "content": "Commercial intent keywords are some of the highest-value keywords your website can rank for.Here’s what you need to know about them. And how to find them.What Are Commercial Intent Keywords?Commercial intent keywords are searches made by customers who are nearly ready to buy. They know their problem. And they’re doing research to look for a solution.To clarify, we distinguish between four core types of search intent—the reason behind a user’s search. Commercial intent is one. And the other three are: Navigational intent: Searches made by users to find a specific page (e.g., “facebook login”) Informational intent: Searches made by users to learn more about something (e.g., “what is seo”) Transactional intent: Searches made by users to complete a purchase (e.g., “buy weather station”)Here’s a visual to further illustrate the differences:Examples of Commercial Intent KeywordsWithin the commercial intent keyword category, we can break it down further into three types (more on this soon).For now, here’s a variety of commercial intent keyword examples across various industries: “best weather stations” “project management software” “best affordable tennis shoes” “hellofresh alternatives”Why Are Commercial Intent Keywords Important?Traffic coming from commercial intent keywords can have a much higher conversion rate than informational intent keywords. So you can often drive more revenue with less website traffic.And your SEO strategy can begin with them. You don’t necessarily have to start with informational content and build toward content that will convert later on. (But that strategy does work well in some contexts.)It’s true that all buyers need to go through a decision-making process. It starts with becoming aware of a problem, through to researching the options and deciding on a solution.But you don’t have to be the one to kick-start that journey. There are already prospective customers out there who are further along. And these are the people you can target with commercial intent keywords. You can step into the picture directly in the middle of the funnel. When the prospect starts looking for their solution.Types of Commercial Intent Keywords (With Examples)There isn’t an industry standard for labeling types of commercial intent keywords. But here are some common types of commercial intent keywords:Product-Focused KeywordsProduct-focused keywords indicate that a person is looking to learn more about a specific product or category of product. Customers searching for these types of keywords are in the research phase. They might not be ready to buy immediately, but they’re close to making a decision.Product-focused keywords often include: A specific product name (e.g., “rolex oyster perpetual” and “iphone 14”) A product category (e.g., “fishing rods” and “project management software”) A specific brand name (without specifying a product; e.g., “dyson”)The idea can be applied to services, too. But those searches usually mention: A profession (e.g., “plumbers”) Companies (e.g., “plumbing companies”) The term “services” (e.g., “plumbing services”)The commercial intent subcategory will likely provide you a bunch of valuable keywords you’ll want to include in your SEO strategy.You can find keywords that are even easier to rank for by applying modifiers such as “with” or “for.”For example, “weather stations with lightning detectors.” When a search is more specific, there are usually fewer pages which directly address what the searcher is looking for, which makes it easier to rank.Investigative KeywordsInvestigative keywords indicate that the user is looking into a range of potential solutions to a problem. And comparing options.Common types of investigative keywords include: Best (e.g., “best tennis shoes”) Vs (e.g., “omega seamaster vs rolex submariner”) Review (e.g., “trello review”) Alternatives (e.g., “trello alternatives”)These keywords are valuable because the searcher is aware of their needs. For example, in the case of “best tennis shoes,” the person is already sold on the general benefits of tennis shoes. They’ve already decided that they’re interested in tennis shoes. And they’re likely close to buying. Now, they just need to find the right product.Local Commercial KeywordsThese are search queries that indicate commercial intent within a specific geographic area.It’s as straightforward as that. These keywords are high-value because the searcher is close to buying. And likely located near your business.Here are some examples of local commercial intent keywords: Near me (e.g. dentist near me, chinese takeout near me) [Service] in [location] (e.g. cleaners in London)Commonly Mistaken for Commercial Intent: “Buy Now” Keywords“Buy now” keywords (like “buy iphone 14”) are transactional—not commercial. They indicate clear intent to buy rather than an intention to research. Search queries of this type might contain: The word “buy” (e.g., “buy tennis shoes”) The word “discount” (e.g., “walmart discount”) The word “coupon” (e.g., “costco coupon”) The words “free shipping” (e.g., “shein free shipping”) The words “gift card” (e.g., “amazon gift card”)They’re primarily seen in ecommerce. But they also exist in other industries. In SaaS, these keywords also commonly include a brand name (e.g., “netflix signup”). For some services, you can also find keywords that indicate an immediate need even if they don’t contain these particular purchase-oriented terms (e.g., “emergency plumber”).Most of these keywords are used for branded searches. And are only valuable to the brand named.For example, “walmart discount” is only a valuable keyword for Walmart.How to Find Commercial Intent KeywordsHere are five reliable methods to find potentially high-converting commercial intent keywords:1. Use a Keyword Research ToolUsing a dedicated keyword research tool is by far the most efficient and data-driven method for finding relevant keywords.You can start with a seed keyword (a bigger topic/category within your niche) and use it to discover more keyword ideas.Here’s how to do it using Semrush’s Keyword Magic tool.First, enter your seed keyword (we can start simply with the product category) and choose your target country. And click “Search.”The tool will surface keyword suggestions. In this case, there are 45K+ results.Next, we can apply filters to narrow down our ideas.To start, we can use the “Intent” filter to show only commercial intent keywords.And since there are still hundreds of results, we can narrow further.Try adding modifiers that indicate clear buyer intent. For example, “best.”Click “Include keywords” and enter “best” (or another modifier). Use the “Any keywords” option if you want to add several ideas (e.g., “best,” “review,” “vs,” “alternative”).Now, we’re left with highly relevant keywords that clearly indicate some intention to buy a weather station.It’s also possible to filter this list down further to find the keywords which are likely to be easier to rank for.Each keyword has a Keyword Difficulty score. This tells you how much SEO effort will be required to rank in the top 10 search results. The higher the score, the harder it is to rank (from 0 to 100).To find low-competition keywords from the remaining list, you can either: Click “KD %” to apply a Keyword Difficulty filter, or Sort by the Keyword Difficulty columnHere, we see low-competition commercial intent keywords related to the seed term “weather station” like: “best rv weather station” “best weather station under $100” “best weather station for farmers”They all have a measurable monthly search volume in our target country. And are likely to have a high conversion rate.You can repeat this process with other modifiers and/or seed keyword ideas.2. Check Competitor RankingsThe second thing you can do to find commercial intent keywords is reverse-engineer your competitors’ strategies.A fast way to do it is with Keyword Gap, a Semrush tool that lets you compare your keyword profile with up to four competitors’ keyword profiles.First, input your own domain and one to four competing domains. Then click “Compare.”The tool will generate lists of keywords that all these sites rank for. Including keywords that only your competitors rank for (but you don’t).Focus on the “Missing” (indicates keywords all your competitors rank for but you don’t) and “Weak” (indicates keywords all your competitors outrank you for) tabs to find opportunities.You can also apply filters like “Intent”, “KD %”, and “Keyword includes” to narrow down the results.3. Analyze Your Google Search Console DataIf you already have an established website, your Google Search Console impressions data is likely to reveal some untapped commercial keyword ideas.Your existing content is gathering impressions every day—even for keywords you didn’t intend to rank for.And you can filter the data to surface new commercial intent keyword ideas.Start by heading to Google Search Console. (If you haven’t used it before, you’ll need to set up Google Search Console and verify ownership of your website.)Go to “Performance” in the left sidebar and then select “Search results.”Next, click “New” and select “Query.”Now, you can add a filter. For example, including “Queries containing” and adding “best” would show you all the impressions and clicks you’ve had from keywords that include the word “best.”Then you can repeat with other words or phrases that might indicate commercial intent. For example, you can look for all the queries containing “vs.” Then all the queries containing “alternatives.” And so on.4. Look for Ideas Using Google’s AutocompleteGoogle's autocomplete function is a great free option for discovering commercial intent keywords.If you don’t have a software budget (and you don’t have any existing Search Console data), this is a good place to start.Start with a seed term like your product category. Let’s try “dog food.” Apply a modifier like “best.”Now, look for the suggestions Google offers that are relevant to your target market. And repeat with different commercial intent keywords and modifiers.You won’t get data like search volume and Keyword Difficulty. But this method is still worth considering because Google confirms that autocomplete keywords are based on real searches people have made. Not just predictive text that may have never been searched.5. Listen to Your CustomersHearing about challenges directly from customers (or prospects) can lead to commercial intent keyword ideas.If you can, ask them: What are you using our products for? Which problems do you need to solve? How do you refer to our product?Be sure to consider whether your prospective customers might use a different language than you. It might reveal more commercial keyword ideas.For example, a person in the U.S. might say “sweater” while a person in the U.K.would say “jumper.”Additionally, you can directly ask how a customer heard about you. Which might spark ideas.If you don’t have direct customer contact, here are a few other opportunities to get insights: Read through customer support tickets Listen to sales or customer success call recordings Read customer comments, public reviews, social posts, and forum threads Ask your customer-facing colleagues what they hearThen, you can verify your ideas (check for search volume and Keyword Difficulty) using Keyword Overview.Leverage Commercial Intent Keywords for Faster ROIUse the tactics above to find commercial intent keywords. Shoot for the low-competition stuff first to get some quicker results. Think “best weather stations for farmers,” rather than “best weather stations,” for example.To learn more about finding low-competition keywords, take a look at “How to Find Low-Competition Keywords with Semrush.”And begin discovering ideas using the Keyword Magic Tool. (You can start for free.)",
  "headers": [
    {
      "level": "H1",
      "text": "A Guide to Commercial Intent Keywords & How to Find Them"
    },
    {
      "level": "H2",
      "text": "What Are Commercial Intent Keywords?"
    },
    {
      "level": "H3",
      "text": "Examples of Commercial Intent Keywords"
    },
    {
      "level": "H2",
      "text": "Why Are Commercial Intent Keywords Important?"
    },
    {
      "level": "H2",
      "text": "Types of Commercial Intent Keywords (With Examples)"
    },
    {
      "level": "H3",
      "text": "Product-Focused Keywords"
    },
    {
      "level": "H3",
      "text": "Investigative Keywords"
    },
    {
      "level": "H3",
      "text": "Local Commercial Keywords"
    },
    {
      "level": "H3",
      "text": "Commonly Mistaken for Commercial Intent: “Buy Now” Keywords"
    },
    {
      "level": "H2",
      "text": "How to Find Commercial Intent Keywords"
    },
    {
      "level": "H3",
      "text": "1. Use a Keyword Research Tool"
    },
    {
      "level": "H3",
      "text": "2. Check Competitor Rankings"
    },
    {
      "level": "H3",
      "text": "3. Analyze Your Google Search Console Data"
    },
    {
      "level": "H3",
      "text": "4. Look for Ideas Using Google’s Autocomplete"
    },
    {
      "level": "H3",
      "text": "5. Listen to Your Customers"
    },
    {
      "level": "H2",
      "text": "Leverage Commercial Intent Keywords for Faster ROI"
    }
  ],
  "author": ""
}