{
  "url": "https://www.semrush.com/blog/how-to-use-search-intent-for-your-business/?utm_source=ContentOptimizationBlog&utm_medium=Blog&utm_campaign=stateofCM22",
  "slug": "how-to-use-search-intent-for-your-business",
  "title": "What Is Search Intent in SEO & Why Is It Important?",
  "description": "Learn what search intent is, why it‘s important for SEO, and how to determine the intent of a keyword.",
  "content": "What Is Search Intent?Search intent (also known as user intent) is the reason why a user types a particular query into a search engine. It represents what the user is trying to achieve with their search, whether that's finding an answer to a question, looking for a specific website, purchasing a product, or exploring a topic.Let's say someone searches for “best dog food” on Google.They're not trying to navigate to a specific page. And they don't want to buy a specific product either. (At least not yet.) They want to do their research before making a purchase.That means the keyword has commercial intent. And we can use this knowledge to adjust our content to target this keyword better.Why Is Search Intent Important in SEO?The top goal of search engines (like Google) is to provide relevant results for users. So understanding search intent can impact your ability to rank in search results.Google has put a lot of effort into interpreting the intent behind search queries used in search. (Just take a look at Google's Search Quality Evaluator Guidelines—there's a whole section on user intent and how to identify different intent types.)So if you want to rank in Google, you must make sure your pages satisfy the search intent behind the keywords they’re targeting.A thorough understanding of search intent can help you: Have a more effective content strategy: by targeting keywords that align with the needs of your target audience Create relevant content: by understanding your users' needs and creating content that fulfills them Rank higher in search results: by showing search engines that your content is valuable and relevant to their usersTo illustrate this, let's get back to our example from the beginning. The keyword “best dog food” has 74,000 searches per month.Let's say you have an ecommerce website selling pet food. Wouldn't it be great to rank for this keyword with the product page of your best-selling dog food brand?Absolutely. But you won't. If you look at the Google results, you'll see that Google does not consider “best dog food” to be a transactional keyword.The search results are full of review articles listing the top dog food brands. It does not rank any ecommerce websites.Therefore, you wouldn't be able to rank with a product page here, even if it seems relevant at first glance.The Four Types of Search IntentWe usually distinguish between four types of search intent: Navigational intent: Users want to find a specific page (e.g., “reddit login”) Informational intent: Users want to learn more about something (e.g., “what is seo”) Commercial intent: Users want to do research before making a purchase decision (e.g., “best coffee maker”) Transactional intent: Users want to complete a specific action, usually a purchase (e.g., “buy subaru forester”)Let's take a closer look at each of them.1. Navigational Search IntentNavigational intent means that the user wants to find a specific page. Unlike with other intent types, searchers already know what they’re trying to find.Here are some examples of keywords with navigational intent: starbucks gmail login semrush keyword magic tool ikea refund policyAs you can see, navigational keywords are often branded. They're all about ensuring that your target audience can find your pages easily when they need to find them.2. Informational Search IntentInformational search intent means that the user wants to learn something. These searches are often phrased as questions and use words like who, what, where, why, and how.Here are some examples of keywords with informational intent: bruce willis movies what is seo california time now how to clean a dishwasherGoogle will often answer the more specific questions directly in the SERP:But for most informational queries, the No. 1 content type is still a blog post. That's why blogging likely needs to be part of your SEO strategy. Here are the top benefits of targeting informational keywords: Visibility: Informational queries make up a significant number of searches in Google. If you want visibility, you can’t ignore them. Building trust: Providing useful information andeducating your audience is a great way to build trust in your expertise Targeting new leads: Content that targets informational keywords can bring in new leads you can convert laterAlthough ranking for informational queries probably won't bring you tons of direct conversions, it can still be a valuable opportunity to grow your business.3. Commercial Search IntentCommercial search intent includes keywords your audience uses when they’re doing their research before a purchase.The commercial intent lies somewhere between informational and transactional intent. The user is looking for information, but the information is closely connected to the action.Here are some examples of keywords with commercial intent: best indoor plants for low light apple watch ultra review mailchimp alternatives hbo max vs netflixThe search results for commercial queries often include third-party pages with independent reviews of the products. That's why it can be very hard (even impossible) to rank for some commercial keywords relevant to your brand. Luckily, there are marketing strategies (as well as tools, like Semrush’s Surround Sound) that can help you stay visible in the decision-making process of your potential customers. 4. Transactional Search IntentTransactional search intent means users want to do something specific, often an action you might want them to do as a business owner.Despite what the name implies, this isn’t restricted just to purchases. For example, a user doing a transactional search might want to complete a newsletter signup or download software.Here are some examples of keywords with transactional intent: iphone 13 pro max price personality test online semrush trial watch friendsTransactional keywords are your money-makers. These are the keywords your future customers use when they’re ready to convert. How to Determine Search IntentSearch intent often aligns with where users are in the marketing funnel. In general, it works like this: Awareness: User searches for informational keywords like “how to do keyword research” Consideration: User searches for commercial keywords like “best keyword research tools” Conversion: User searches for transactional or navigational keywords like “Semrush plans”That's why determining search intent is a crucial step in any content strategy.In many cases, you can determine a keyword’s intent based on the keyword itself (e.g., question words like what, why, or how usually signify informational intent).But sometimes, the intent is not that obvious at first sight. The thing is, you don’t have to figure it out yourself—several tools in Semrush calculate search intent automatically for every keyword. Here's where you find the “Intent” metric in Keyword Overview:The calculation is based on the words contained within the keyword phrase and the SERP features that are present in the search results of the analyzed keyword. In the Keyword Magic Tool, there's a dedicated data column that shows the intent type of the keyword. That means you can work with search intent during your keyword research without leaving the tool or having to guess the intent.You can also use a filter to only show keywords with a certain intent type.Let's say you're doing keyword research for a company blog. Since a blog usually targets an audience in the “Awareness” stage of the marketing funnel, you probably want to focus on keywords with informational intent.Just click the “Intent” filter and select the intent type you want. Tip: To learn more about how to integrate search intent into your content strategy, read our keyword research guide.Always check the actual SERP results to see what pages rank for the keyword.In Keyword Overview, you can do that by scrolling down to the “SERP Analysis” section.By clicking the search icon, you can also see the snapshot of the actual search results to get a better overview of what the SERP for your keyword looks like.Proper analysis of the SERP ensures that you'll learn about the intent behind a query and allows you to get inspiration from the top results.It is important to realize that to nail search intent in Google’s eyes, you need to do much more than just create the right type of page.Study the SERP and find out: What makes the top results best How deeply the top results cover the topic What angle they use How can you create even better content (by providing better information, data, examples, media, or user experience)Let’s say a user wants to buy a new air purifier. They search for “best air purifier.”The intent is clearly commercial.But you need more than just a standard top 10 review to rank for the keyword. One of the top results—the 10 Best Air Purifiers review by Modern Castle—is a great example of commercial content that puts their readers' needs first.It opens with a photo of Derek, the author of the post, with all the models he has tested for the purpose of the review. Right below, you can find a video summarizing the post for those who prefer watching reviews rather than reading.The article categorizes products by coverage area—which is probably the most important aspect you consider when choosing an air purifier. Then, the article continues by covering each of the products, providing technical specs and other details. As well as the actual performance data derived from the author’s tests.The post concludes with a table comparing all the products and their rating. And links to a detailed review for each of them. The information is easy to digest, well-structured, and highly organized.Follow this approach when adding content to your website. Ask yourself: What is my audience trying to find on this page?Then build a well-structured page with that need in mind. FAQsHow Important Is Search Intent?Understanding search intent is an essential part of keyword research for SEO.Better intent optimization means Google is more likely to show your page for the query. Which, in turn, means more relevant and qualified traffic to your website.What Is Keyword Intent?Keyword intent or keyword search intent is the same thing as search intent. It basically means the search intent behind a specific keyword. Some keywords may have a clear intent, while some intent may not be obvious from the keyword. We call this a “mixed intent.” A common example of a mixed intent is a search term that is the name of a specific product—like “iphone 13 pro max.” Since it’s unclear whether a user’s intent is transactional, commercial, or informational, the Google search results will include various types of results and SERP features to make sure they meet different search needs.How Many Types of Search Intent Are There?The most common intent categorization includes four types of search intent: navigational, informational, commercial, and transactional.Google uses a slightly different categorization. In their Search Quality Evaluator Guidelines, they distinguish between: “Know” queries: Users want to get information about something (corresponds to the informational intent) “Do” queries: Users want to do something (corresponds to the transactional intent) “Website” queries: Users want to visit a specific website (corresponds to the navigational intent) “Visit-in-person” queries: Users want to visit a specific physical placeHow Do I Find the Search Intent Behind a Keyword?To find the search intent of a keyword, you can simply use Semrush. All of our keyword-related tools detect search intent automatically. Create a free account and try it now!It’s also a good idea to look at the search results for a keyword to see the actual results and SERP features Google identified as the most relevant.",
  "headers": [
    {
      "level": "H1",
      "text": "What Is Search Intent? A Complete Guide"
    },
    {
      "level": "H2",
      "text": "What Is Search Intent?"
    },
    {
      "level": "H2",
      "text": "Why Is Search Intent Important in SEO?"
    },
    {
      "level": "H2",
      "text": "The Four Types of Search Intent"
    },
    {
      "level": "H3",
      "text": "1. Navigational Search Intent"
    },
    {
      "level": "H3",
      "text": "2. Informational Search Intent"
    },
    {
      "level": "H3",
      "text": "3. Commercial Search Intent"
    },
    {
      "level": "H3",
      "text": "4. Transactional Search Intent"
    },
    {
      "level": "H2",
      "text": "How to Determine Search Intent"
    },
    {
      "level": "H2",
      "text": "FAQs"
    },
    {
      "level": "H3",
      "text": "How Important Is Search Intent?"
    },
    {
      "level": "H3",
      "text": "What Is Keyword Intent?"
    },
    {
      "level": "H3",
      "text": "How Many Types of Search Intent Are There?"
    },
    {
      "level": "H3",
      "text": "How Do I Find the Search Intent Behind a Keyword?"
    }
  ],
  "author": ""
}