{
  "url": "https://www.semrush.com/blog/how-to-use-quora-content-marketing-keyword-research/",
  "slug": "how-to-use-quora-content-marketing-keyword-research",
  "title": "How To Use Quora For Content Marketing and Keyword Research",
  "description": "Have you ever wished for a platform that could generate evergreen traffic to your blog, even years after your content marketing efforts? (hint — it is not Facebook or Twitter) Well, look no further because Quora is here",
  "content": "Have you ever wished for a platform that could generate evergreen traffic to your blog, even years after your content marketing efforts? (hint - it is not Facebook or Twitter)Well, look no further because Quora is here!It is an effective and mostly overlooked content marketing tool that, when done right, generates long-lasting results. What is even better is that the traffic generated by Quora is Google-proof.Many marketers are ignoring this amazing platform (which boasts more than 300 million people), but there a few lone gunslingers that are reaping the benefits and taking full advantage of Quora (like Game Designer, Ernest W. Adams).Are you excited to master Quora?In this guide, you will learn: What Quora is. Why you Should use Quora. What the Quora Ranking Factors are. How to Use Quora for Keyword Research.What is Quora?Quora is a Q&A community where questions are asked and answered in the form of opinions. That is why 300 million people love visiting it to read everyone's opinions. I try to find answers on Quora instead of Google because it gives an emotional touch to answers.Above, you can see people are looking for answers on Quora to help someone with depression. Quora provides fantastic answers from experts around the world on any topic.For every question like this, there are hundreds of answers from real people who have gone through depression themselves, like Matthew Russel.Why Should You Use Quora?Quora provides tremendous opportunities for people and businesses to get traffic just by answering questions. The first reason is apparent: Quora is the fastest growing site and has surpassed 600 million visits a month.Don't believe me? Here you can see traffic statistics with Traffic Analytics.The best part?Search is a major source of visitors. It means more than 50 percent of users come from search engines to visit Quora.Unlike Facebook, where search counts for only 13% of traffic.I am sure those 13% of users are asking questions like “How to Delete a Facebook Account” on Google.Here are some of the powerful reasons why you should use Quora:1. Brand AwarenessThere is no doubt Quora is an excellent platform for brand awareness since thousands of people can see your answers.If you are running a new startup that sells a productivity tool for entrepreneurs and don't have the capital for marketing, then you could use Quora to market your product or blog at no extra cost simply by answering questions.Really what it boils down to is spending the time rather than the dollars to achieve this brand awareness. If you spend 30 minutes a day to write one answer per day, you will quickly see things stack up in your favor.Now imagine doing that for 2 years. Einstein calls it the eighth wonder of the world. Of course, consistency is the key to success when it comes to Quora. After your years of hard work, your brand will be more visible to people who will love to buy your services and products.2. TrafficTraffic is the backbone of this strategy. You have to think outside the box and use smart tactics that generate traffic to your Quora answers. Do the following when answering questions on Quora: Share Key Credibility Building Information in Your Answer TitleThis is crucial since most users read the title first. It gives you instant brand awareness.Additionally, people are skeptical about reading answers from anyone other than a subject matter expert. Including a website domain name in the title helps build credibility.Another example is including your job role in the title. If a person has mentioned in the title that they are an electrical engineer and has written an answer about SEO, nobody will take their advice seriously.That is why you should include as much key information in the title as possible. Give users a reason to trust you and to visit your site (same as how Edward Lichstein has done).Keep in mind that the link is not clickable; it is just there so that people can see it.Of course, your domain name matters too. It should be short, professional, easy to pronounce and give a sense of credibility. Have a Compelling BioThe best tip to success in the online world is to think like a customer.Think about who will click on your profile link? The ones who get impressed by your answers and want to know more about you. But why would they visit your site? Because human beings are curious.When people start liking you, they start following you and start reading your future answers. That is why you should make a little extra effort to make your bio appealing and include a CTA that compels users to visit your site. You can also present other options, like joining your secret weekly newsletter. Guiding Users to Click Through to Your Website from Your AnswerTo get users to click on your link to your site, you need to write the perfect answer. Here, copywriting skills are the key to success.Did you see what I did there? Instead of explaining which copywriting skills you need to write successful answers, I simply linked to a post that dived into the details. It practically forces you to click through.That being said, you should definitely read the copywriting skills post; I am not kidding; it is chock-full of actionable advice. So do the exact same thing when writing your answer on Quora.If you are a beginner and feeling a bit lost, try spending a week on Quora researching answers which have been liked the most (identify which characteristics help them go viral).There are two ways you can drive traffic to your site with Quora answers: Writing incomplete lists. For example, your answer has 7 talking points, but you write about only 3 of them and then tell folks they can read the remaining 4 points on your site (and follow it up with a link). Use internal links intelligently. Once a user is on your website, be sure to include key links (with effective anchors) that will guide them to other pages of your website.Later I will explain in more detail how to write better.3. Getting Emerging Content IdeasMillions of Quora users ask thousands of questions every day. When you use Quora regularly, you get content ideas in your Quora timeline that weren't possible otherwise. People ask questions that you cannot easily find on the internet. This is because every day, we face unique problems; unique problems that need unique solutions.For example, each new release of the iPhone comes with a slew of new user experiences and functionality. People immediately start asking questions about how to do certain things with the new phone.That is where the subject matter experts (that have already figured out the answers) come in and share their experience. They get large amounts of traffic from search engines because they are the first to see and respond to these questions.Pro Tip: Type partial questions or your keyword in the Quora search box, you will find questions that could be effective for your content ideas and marketing.Also, you can use Quora filters too. Be the first to find a question that would be worth writing an answer to attract users.4. TrustHere you can see the comments of Adepetun Kenny, who is thanking Hector for his answer. When you start getting such comments, it is safe to say you have gained your audience's trust.Be sure to write effective answers which can help you gain credibility and trust in the future.Use Quora and SEMrush for Keyword Research to Get More TrafficLet’s get started on how to find the perfect keywords using a combination of SEMrrush and Quora.Step 1 - SEMrush Data:Go to SEMrush Domain Overview, and input Quora. It will give you data for 53.5 million keywords. New keywords are added daily.Quora is a multi-language website that ranks for millions of keywords in different countries. As such, SEMrush has keyword data for almost every country (this is valuable for people who want to market within their respective country).Step 2 - Filtering the DataRaw data is useless until you apply filters. SEMrush provides robust filtering options for finding the perfect keywords.Here are the three most effective filters that I use: #1 - Featured Snippet You should filter keywords that are ranking for featured snippet Google. Why? Because Google thinks the topic is important to users, and that the sites that received the snippets had content worthy of a snippet. There is a lot to learn from the snippet, the keywords within them, and the resulting page.In some instances, your blog can outrank Quora (if your website is fully optimized with the latest on-page SEO best practices, is found to be factual/helpful/useful, and has backlinks. Check out this detailed article with on-page SEO tips).But the best part?If you write a comprehensive answer on Quora for these \"featured snippet\" keywords, you are more likely to get search engine traffic to your answer, and thus, your blog too.Don't believe me? Here is a keyword I picked \"winner winner chicken dinner.\"Here you can see how Google ranks the keyword.The question has only ten answers on Quora.There are a lot of people searching for this keyword.You might be thinking of how to find keywords related to your niche with SEMrush.You can apply another condition with a keyword that reflects your niche; in this example, I typed “laptop”.This condition will filter out the keywords having a laptop term in them. Additionally, the keywords are still ranking for the zero position (aka featured snippet).This also shows that 746 keywords are ranking for the keyword having the term laptop on Quora for the featured snippets.Pro Tip: You can embed a YouTube video in your Quora answer provided you make videos related to the niche. Of course, the videos would have to be professional and attractive. Position 1 to 5 Not all Quora keywords are featured snippets. Therefore, we need to apply the Positions Filter to get more data for our keywords.Make sure you apply an advanced filter for the word count to get long-tail keywords for low competition. I applied the “Words count” and “Greater than three” conditions to find long-tail keywords. Results In SEMrush, this is one of the best filters because you can find low competition keywords instantly. The results are the total websites that are indexed in Google's database for the given keyword.Google shows Quora is mentioned more than 80 million times across the web. It means it is more competitive to rank for if you want to rank in the SERPs.Why Is the Result Filter in SEMrush so Effective?The result filter helps you find keywords that have low competition (the fewer the number of results, the lesser the competition).I know what are you thinking; why not use the Google Keyword Tool instead of results? Honestly, I find better keywords with low competition when I use this Results Filter methodology on SEMrush, vs. using Google's Keyword Tool.Pro Tip: For most keywords, you may not find the search results equal to the SEMrush results. For this purpose, use a Google Search operator that filters out the websites that are using the keyword in the title only.I typed \"Best Gaming Laptop Under 10000\". It shows only 283 websites are targeting the keyword. You can find a keyword where only 50 websites are targeting the keyword with SEMrush's filter.allintitle:your keywordStep 3 - Writing to Rank On QuoraLet's talk about my favorite part, how to rank your answer better on Quora.Note: The ranking factors explained here are the results of my direct experience on Quora.1. Extensive Answer:A long quality answer is always better because it helps to rank better on Quora and Google.On Google, an extensive article ranks for more keywords.Can you prove it?Yes. Check out this article by SEMrush, which not only goes into detail about this but ranks for over 300 keywords by itself.Make sure when you start writing an answer on Quora that you include your target keywords. It creates relevancy when you use the question keywords in your answer. See the below screenshot.2. ImagesPlacing an image at the top of your answer draws more attention to it, but it is important to use an image that carefully reflects the answer.Pictures affect the human mind. These types of images should be used with care: Fear Love Hate MotivationPro Tip:If you start your answer with an engaging story, you are more likely to get noticed. Look how Hector Quintanilla does it.3. Reading TimeThe more time readers spend on your answers, the more it can improve your ranking on Quora.Pro Tip:Keep in mind the following tips every time you write an answer on Quora: Use bullet points Use italics Use important words and related words Use quotation sentences Eye-catching imagesAll of these things serve to keep your readers engaged and, thus spend more time on your answer.4. Past Answer Credibility:If you have written dull answers in the past before that brings no engagement to the table, you are less likely to rank your answer on Quora for your future answers.So focus on writing impressive answers that can win the trust of your followers. You can see the past answers of any member on Quora.5. Fresh ContentThis is the most important factor that many marketers ignore. For example, I rank many answers that weren't updated for more than a year, but when I update my outdated answers; it ranks to a higher position on Quora.Make sure you keep updating your old answers to make it more relevant to users and search engines.6. FollowersQuality followers help in ranking your answer faster since they can upvote and share your answer quickly.Consequently, make sure you stick to only one niche to answer questions and get relevant followers. Because if you get irrelevant followers who are not interested in your answers, you will end up losing your credibility.Quality followers on Quora work exactly on the same principle as YouTube (with subscribers). Quality subscribers on YouTube give you excellent retention for your videos that boosts your video ranking on YouTube. The same can be said for Quora. Good Quora followers increase your read time and upvotes that can help in ranking.Step 4 - Tracking Your AnswerIf you have written an answer, you must track how it is performing.You can make your own Google sheet and audit the report each week or month, depending on how much time you have.Do you want a copy of the Quora Tracking Sheet? Get it here.You don't need to make a separate column for each day; you can see the history of each cell in a Google Sheet when you make even a tiny amendment.Wrapping upQuora has become an essential part of many people's lives on the internet (more than 300 million users). It provides a compelling opportunity for businesses to market their products and blogs to their target demographic.There are a few key ingredients for executing the correct strategy that can drive results. Those ingredients are: Writing catchy answer titles with your website domain name in them. Getting answers ranked on Quora and search engines by doing keyword research using Semrush and including images and videos in your posts. Using various techniques to get users to click through answer links to your website. Smart internal linking on website landing pages to keep traffic on your site longer.Have you ever used Quora as part of your marketing strategy? Tell us your thoughts in the comments section below.",
  "headers": [
    {
      "level": "H1",
      "text": "How To Use Quora For Content Marketing and Keyword Research"
    },
    {
      "level": "H3",
      "text": "Are you excited to master Quora?"
    },
    {
      "level": "H2",
      "text": "What is Quora?"
    },
    {
      "level": "H2",
      "text": "Why Should You Use Quora?"
    },
    {
      "level": "H3",
      "text": "Here are some of the powerful reasons why you should use Quora:"
    },
    {
      "level": "H4",
      "text": "There are two ways you can drive traffic to your site with Quora answers:"
    },
    {
      "level": "H2",
      "text": "Use Quora and SEMrush for Keyword Research to Get More Traffic"
    },
    {
      "level": "H3",
      "text": "Step 1 - SEMrush Data:"
    },
    {
      "level": "H3",
      "text": "Step 2 - Filtering the Data"
    },
    {
      "level": "H4",
      "text": "#1 - Featured Snippet"
    },
    {
      "level": "H4",
      "text": "Position 1 to 5"
    },
    {
      "level": "H4",
      "text": "Results"
    },
    {
      "level": "H4",
      "text": "Why Is the Result Filter in SEMrush so Effective?"
    },
    {
      "level": "H2",
      "text": "Step 3 - Writing to Rank On Quora"
    },
    {
      "level": "H3",
      "text": "1. Extensive Answer:"
    },
    {
      "level": "H3",
      "text": "2. Images"
    },
    {
      "level": "H3",
      "text": "3. Reading Time"
    },
    {
      "level": "H3",
      "text": "4. Past Answer Credibility:"
    },
    {
      "level": "H3",
      "text": "5. Fresh Content"
    },
    {
      "level": "H3",
      "text": "6. Followers"
    },
    {
      "level": "H2",
      "text": "Step 4 - Tracking Your Answer"
    },
    {
      "level": "H2",
      "text": "Wrapping up"
    },
    {
      "level": "H6",
      "text": "Most popular pages"
    },
    {
      "level": "H6",
      "text": "SEO Checklist: 41 Tips to Optimize Your Website"
    },
    {
      "level": "H6",
      "text": "How to Perform a Complete SEO Audit (in 14 Steps)"
    },
    {
      "level": "H6",
      "text": "A Beginner’s Guide to Keyword Search Volume"
    }
  ],
  "author": ""
}