{
  "url": "https://www.semrush.com/blog/how-to-see-your-competitors-facebook-ads/",
  "slug": "how-to-see-your-competitors-facebook-ads",
  "title": "How To See Your Competitors’ Facebook Ads",
  "description": "Wondering what your competitors‘ Facebook ads look like? Follow this workflow.",
  "content": "Ever find yourself scrolling Facebook and thinking, “Why didn’t I come up with that ad?” If you’re a competitive business, you want your ads to be more eye-catching, relevant, and enticing than what similar companies have to offer. But, it’s frustrating when you don’t even know what your competitor’s ads look like.There are some great free resources like the Facebook Ad Library but these have limited performance data.AdClarity gives you the full picture. This app lets you easily research and understand competitor ad campaigns on Facebook (or any other major digital ad platform). All you have to do is sign up for a 7-day free trial via the Semrush App Center to get started. Once you’re in the app, you’ll be able to uncover their ads with stats on when the ads ran, estimated spend, and impressions, like this:An example of Facebook ads you can analyze in AdClarityLet’s walk you through how to use AdClarity to see Facebook ads of competitors and stay ahead of your rivals.Discover Competitor Ads With AdClarityBefore you can analyze competitor data, you need to sign up for your free 7-day AdClarity trial. Go to the Semrush App Center to find the tool. You’ll see a choice of three AdClarity plans. Select either ‘Social and Video Only’ or ‘All Advertising Channels’ to access the tools for Facebook.Step 1. Query Your Competitor’s DomainStart by typing your competitor’s domain into the search bar at the top of the dashboard. We’re using the multinational coffeehouse, Starbucks, as our example.AdClarity gives you a list of possible matches for the search term including the domain, social media channels, and any campaigns. Scroll to the domain name.Note: You’ll see an option with the brand name and ‘Facebook.com’ in brackets. Selecting this shows you ads leading to the company’s Facebook page.Click the ‘Submit’ button on the right-hand side of the search bar to pull up your competitor’s ad data.Choose a date range and location from the menu below the search bar to filter your results.Step 2. Note Ad Spend and ImpressionsOnce you’ve selected the filters you want, AdClarity fills the dashboard with your competitor’s ad activity and performance data. The top three panels display the total estimated expenditure, social ad placement, and social ad types.Here’s what these metrics tell you about your competitor’s ad performance: Estimated expenditure: The total the company spent on social media advertising and how many impressions they got (from what AdClarity saw on FB, Instagram, X, LinkedIn, Pinterest, & TikTok). Here, we can see Starbucks budgeted $12.2M on ads and got 2.4B impressions. Social ad placement: This panel shows where the competitor has chosen to place their ads. Starbucks has only decided to run ads in feeds. Social ad types: Here, you can see the different types of ads your competitor runs and how much of each type they use. The majority of Starbucks ads are static images but there are a few videos and carousels too.Scroll to the very bottom of the page to see the same data for the brand’s Facebook ads: Here’s what the metrics tell you now: Impressions: You can see the competitor’s Facebook ad impressions and their percentage of the total across the platforms listed. Here, Starbucks’ Facebook ads account for 37.97% of its entire social media impressions. Spend: Similar to impressions, you see how much the company paid for Facebook ads and the percentage of the total ad spend. Starbucks spent $5.22M which was 46.86% of their budget. Change: This percentage indicates how much the metric has increased or decreased within the selected data range. For example, Starbucks' Facebook impressions and ad spend have both decreased by around 15% in the past three months.Click either Impressions or Spend to rank the social networks from highest to lowest. The same data then appears in the pie chart to the right. Step 2. Analyze Ad Spend Over TimeScroll back up the page and you can see a large panel with a line chart displaying ad spend and impressions over time.You can customize the line chart. De-select metrics at the top or social networks at the bottom to hide them. Click on the drop-down menu in the top right corner to view trends across days, weeks, or months.The line chart shows Starbucks had a surge in Facebook ad spend and impressions between June 17th and June 22nd. While the company spent over $5M over the past three months, most of that was in just two weeks.Say you want to emulate Starbucks’ ad strategy. You now know you should invest a lot of your budget into placing static images in the Facebook feed around the middle of June. Step 3. Analyze their Ad CreativesScroll past these panels to ‘Top Social Ads’ to see the Facebook ads your competitor is running and analyze their strategy.You can find several filter options at the top of the box. Click the first dropdown menu and select a category to order the ads by recency, length, or number of impressions.De-select icons in the first set of boxes to hide ads for specific social networks. To focus on Facebook, leave only the ‘F symbol colored in.Select and de-select icons in the second set of boxes to filter by ad type. Here, if we filter by ‘Facebook’ and rank by impressions, the Starbucks ad for iced tea is at the top.You can click on individual ads to get more data about each one. The icons on the far right side of the Top Social Ads box let you filter by ad type. Click on them to hide specific types of Facebook ads and concentrate your search.By this stage, you can see what type of content your competitor is spending most of their ad budget on. You know which products and marketing strategies they think will drive the best results.Now you have a chance to get ahead. Look for gaps in your competitor’s ad strategy that you can highlight in your own campaigns. Or compare and see where you’re falling short so you can refine your approach.Repeat the Process With Multiple CompetitorsAnalyzing one competitor gives you a close look at their specific ad strategy. By comparing multiple brands, you can understand broader trends and patterns in your industry.It’s easy to use AdClarity to analyze a batch of competitors in one go.Step 1. Add Competitor DomainsReturn to the top of the page with the search bar. Click on the blue ‘+Add’ icon to type in other competitor brands. As before, type in the brand names and select them from the drop-down menu. Click the blue ‘Submit’ button when you’ve entered all the competitors you want to analyze.AdClarity then displays all the cumulative Facebook ad data for these brands. To break it down, go to the top right corner and click the ‘Compare’ button.Confirm the brands you want to analyze and click ‘Compare’ again.Step 2. Compare Competitor SharesAs before, you can see the total expenditure and impressions for each competitor at the top. Only the box is now called ‘Share of Voice’ and it displays the metrics for each brand as bar graphs.The bar graph gives each metric as a percentage of the total across all the brands. For example, Starbucks accounts for 91% of the impressions generated by itself, Dunkin Donuts, Tim Horton’s, and Lavazza.Hover over the different colored bars to get more details. Alternatively, select the ‘Heatmap’ button in the top right to visualize the data in a table.Scroll down and you’ll see the Expenditure Trends box again. You can’t filter by social network this time but you can still select the date range or hide metrics and brands.Scroll further and you can see a breakdown of each competitor’s ad spend, impressions, and publishers over social channels. You can see Starbucks has budgeted the most at $11.31M.Go to the bottom of the page to get more details about specific channels. You’ll find a box called ‘Top publishers and apps’.Choose whether you want to compare impressions or ad spend by clicking on the metrics in the top left. Click the brand names at the bottom of the box to hide them.You can also visualize the data as a table if you click the button in the top right corner.The chart shows each brand’s ad spend and impressions for social media channels. It displays these both as numbers and as a percentage of the total.Here, you can see that Starbucks has the largest share of ad spend on Facebook. Their total budget was $5.2M which came to 76%.Going back to the Expenditure Breakdown, we can see that’s half of what Starbucks spent on social media ads in total.Click on Impressions and we can see that Starbucks also got the majority of the views.Overall, Starbucks’ ad spend accounted for 76% of the total budget of all four competitors. They ended up with 83% of the impressions. However, they have similar numbers on Pinterest, Instagram, and X.This data suggests Starbucks may be prioritizing ad strategies that improve its visibility and brand presence across select networking sites.Step 3. Compare Ad CreativesTop Social Ads is the same as for an individual brand analysis except for one additional filter. Now you can choose whether to categorize all the ads by brand or in one go.Again, you can sort the ads by date, duration, or number of impressions.If we filter by impressions, for example, we see that Starbucks has the ad with the most views. It produced all of the ads in the top spots except one video by Dunkin Donuts.If we view by advertiser, we can see Starbucks competitors have launched a similar product. Dunkin Donuts even has a range of colorful iced teas. At the end of our competitor analysis, we know that Starbucks has invested the most in Facebook Ads of all the major global coffee houses. They’re using these ads to showcase their new seasonal cold beverages at the start of the summer.If you plan to launch a similar product, you now have a better understanding of when to run your ads and how to make them stand out.Stay One Move Ahead of Competitors Tracking and analyzing competitor ads on Facebook gives you a significant edge. By getting early insights into their strategies, you can refine your approach and create more effective campaigns. Competitor analysis is simple with a reliable tool like AdClarity in your back pocket. Focus all your attention on one rival or look at all the key players in your niche to get meaningful insights.",
  "headers": [
    {
      "level": "H1",
      "text": "How To See Your Competitors’ Facebook Ads"
    },
    {
      "level": "H2",
      "text": "Discover Competitor Ads With AdClarity"
    },
    {
      "level": "H3",
      "text": "Step 1. Query Your Competitor’s Domain"
    },
    {
      "level": "H3",
      "text": "Step 2. Note Ad Spend and Impressions"
    },
    {
      "level": "H3",
      "text": "Step 2. Analyze Ad Spend Over Time"
    },
    {
      "level": "H3",
      "text": "Step 3. Analyze their Ad Creatives"
    },
    {
      "level": "H2",
      "text": "Repeat the Process With Multiple Competitors"
    },
    {
      "level": "H3",
      "text": "Step 1. Add Competitor Domains"
    },
    {
      "level": "H3",
      "text": "Step 2. Compare Competitor Shares"
    },
    {
      "level": "H3",
      "text": "Step 3. Compare Ad Creatives"
    },
    {
      "level": "H2",
      "text": "Stay One Move Ahead of Competitors"
    }
  ],
  "author": ""
}