{
  "url": "https://www.semrush.com/blog/how-to-build-website-authority/",
  "slug": "how-to-build-website-authority",
  "title": "How to Increase Website Authority: 5 Actionable Tips",
  "description": "Increase your website authority by getting quality backlinks, increasing organic traffic, gaining listings, etc.",
  "content": "What Is Website Authority?Website authority is a term that refers to your website’s overall reputation and SEO performance. To give you an idea of how likely your website is to rank well in search results.That means increasing your domain’s authority can boost your visibility. Because search engines like Google want to rank trusted sites. One way to measure your website’s authority is with Semrush’s Authority Score metric. Which is based on data about your site and is expressed as a percentage—the higher, the better.You can find your site’s Authority Score in Domain Overview (and a few other tools):This guide will give you a better understanding of how Semrush calculates Authority Score. And show you how to boost your domain authority with five concrete tips.How Is a Website’s Authority Score Calculated?Semrush calculates a website’s Authority Score using the following three elements: Link power: The quantity and quality of the website’s backlinks (links on other sites that point to the site in question) Organic traffic: The estimated number of organic visits a site receives from search engines every month Spam factors: An evaluation that looks for signs of link manipulation (questionable practices designed to trick search engines)When combined, this collection of metrics provides a reliable estimate of your domain’s overall authority from the perspective of search engines.Is Authority Score a Ranking Factor?Ranking factors are the metrics that Google uses in its algorithms to determine which search results should be prioritized on the search engine results pages (SERPs). And we don’t know all the details on these complex systems.That means Authority Score and similar metrics aren’t ranking factors.But a website’s Authority Score is calculated using metrics that are confirmed ranking factors. Like the number and quality of backlinks you have.So, Authority Score is a good way to gauge the ranking potential of your website. As long as you create quality, trustworthy content, you should start to see your Authority Score increase over time. And your rankings may very well improve.What’s a Good Authority Score?To get a sense of whether your Authority Score is good, compare yours with the scores of other websites in your niche. Or those in similar niches.For example, an Authority Score of 20 might seem low. But if the average Authority Score of websites in your industry is 15, then your score is actually quite good.Use Backlink Analytics to check how your Authority Score compares with your competitors’ scores. Enter your domain and hit “Analyze.”You’ll see your Authority Score close to the top.Enter up to four competitors in the fields at the top of the page, above all the data. Then hit “Compare.”Now, you should see a chart that compares your Authority Score with your competitors’ scores.You’ll easily be able to see how strong your Authority Score is relative to your competition. Now, let’s dig into concrete tips that can help you increase website authority.5 Tips to Increase Your Website’s AuthorityHere are five concrete tips to improve domain authority:1. Get Quality Backlinks with Valuable ContentGaining more high-quality backlinks can improve your Authority Score. And potentially your rankings in Google—we do know that backlinks impact rankings. A great way to acquire more quality backlinks is by creating link-worthy content—pieces other websites would be happy to link to because they’re valuable to their target audience. And then reaching out to relevant publications/websites to share the URLs.Link-worthy content can include the following: Case studies Step-by-step guides Original research InfographicsFor example, McKinsey & Company published an article on the state of AI in 2023. And that page has nearly 34,000 backlinks, according to Semrush’s Backlink Analytics tool.Most of those backlinks are in text form. Which means other articles refer to McKinsey & Company’s article as a source of reliable information.Earning backlinks in this way will be easier if your content meets the following quality standards: Original: Includes original writing, reporting, or research Accurate: References the most current information Well-sourced: Properly cites and links out to expert sources Relevant: Topically related to your industry and current trends Evergreen: Has long-term value long after the publication date High value: Provides concrete and actionable takeaways for industry peersAfter creating your link-worthy content, it’s time to acquire backlinks to your content by reaching out to authoritative websites.First, go to the Link Building Tool. Enter your domain and click “Start Link Building.”Follow the prompts to complete the setup, and then go to the “Prospects.” This is a list of websites you can contact to request backlinks. And it shows their Authority Scores to give you a better idea of which sites to prioritize.When you find a few sites that you want to reach out to, select the checkboxes to the left of their names. Then, click on the “To In Progress” button on the left side of the table.Head over to the “In Progress” tab. Scroll down and click “Contact” beside a website you want to reach out to.Finally, craft your message and send it off. The tool will help identify the email address you need for outreach.After you establish yourself as a reliable source of information, you likely won’t have to do as much outreach. More sites may naturally link to your content.2. Increase Organic Traffic with Optimized ContentGetting lots of organic traffic means your content is ranking. Which suggests that your content meets Google’s quality standards.So, increasing your organic traffic is likely to increase your website authority. And one way to increase organic traffic is by optimizing your content using SEO techniques.Here’s how to do it:Perform Keyword ResearchA keyword is a term your target audience enters into search engines to find products, services, and information related to your industry.Keyword research unveils those terms. So you can find out what your audience is searching for. And create content that meets their wants and needs.If you have a term in mind that you think might be worthwhile, use Keyword Overview to analyze it. Enter your intended keyword and homepage URL. Select your target location in the drop-down. Then hit “Search.”The tool will generate a dashboard with a ton of data about your chosen keyword.Here are the data points to take note of: Volume: The number of monthly searches for the given keyword Personal Keyword Difficulty: An estimate of how difficult it is for your specific website to rank in the top 10 organic results based on your website’s authority, topical relevance, and the level of competition for the keyword Topical Authority: Whether the keyword aligns thematically with your website’s content Intent (search intent): What the searcher’s goal is by searching this term (more on this later)In this case, “dog bone” might not be the best term to target. Because this website’s Personal Keyword Difficulty score is 59%. So, it’s unlikely to rank in the top results.But there might be related keywords worth targeting. Click “View high-potential keywords” to find them.This will redirect you to the Keyword Magic Tool. And show you a list of terms related to the keyword you originally entered. With Personal Keyword Difficulty scores that are more attainable for your website (10%-50%).Click the plus sign to the left of keywords that align with your brand and products/services and select the appropriate list (or create a new one) from the drop-down to save them.NoteIf your website is already ranking for a keyword, your position number will appear to the right of the term. Like this: Once you have your list of keywords, use them to create quality, optimized content.Create Optimized ContentCreating quality content that’s trustworthy, meets search intent, and optimized using keywords and on-page SEO best practices can help your content rank better on search engine results pages (SERPs).Here’s how to do that.First, figure out the search intent of the keyword you want to target.There are four types of search intent: Informational: Searchers are looking for specific information or the answer to a question (e.g., “what is a dog bone”) Navigational: Searchers are looking for specific websites, businesses, or pages of a website (e.g., “petco dog bones”) Commercial: Searchers are planning make a purchase in the future but are still in the research phase (e.g., “best dog bones”) Transactional: Searchers are planning to make a purchase (e.g., “buy dog bones”)Let’s say you want to target the keyword “dog bone.” According to the Keyword Overview tool, the intent is commercial.This means you probably want to target this keyword with a product page. Not long-form content explaining what a dog bone is.The keyword “marrow bones for dogs,” on the other hand, has both commercial and informational intent.So, content that explains what marrow bones are, lists the benefits of marrow bones, and includes CTAs to pages that sell this product is a great way to target this keyword.Now that you’ve analyzed intent, add your target keywords to the SEO Content Template tool.Doing so will generate a brief you can use to guide the content you create. Including semantic keywords and a table that shows you how your competitors use your target keyword.When you’re ready to start writing, click on “Real-time Content Check” > “Open in SEO Writing Assistant.”Start writing based on search intent and the information you find within the SEO Content Template.SEO Writing Assistant will check your content for readability, tone of voice, SEO, and originality. And provides suggestions that can improve your odds of appearing high in search results.If you need help, use the AI-powered Smart Writer tools. They can help generate additional text, rephrase existing copy, and more. It’s also a good idea to keep other on-page SEO tactics in mind. Like making your URL slug SEO-friendly and including engaging visuals.3. Monitor for Bad LinksYour website’s authority is influenced by the quantity and quality of backlinks pointing to your website. So, it’s important to monitor your backlinks to understand how healthy your backlink profile is. Review your backlinks in the Backlink Audit tool.Enter your domain name. And click “Start Backlink Audit.” The Backlink Audit tool will take some time to gather and analyze your website’s data.When the analysis is done, head to the “Overview” tab to see your Overall Toxicity Score. This is an indicator of the quality of external websites that link to your website.A rating of “Medium” or “High” suggests you have room to improve. In most cases, that simply means working to obtain more backlinks from relevant, reputable websites. But if you’ve knowingly used any questionable practices to gain backlinks (like paying for them) and you’ve received a manual action penalty via Google Search Console, you’ll want to take steps to address your bad backlinks.If that’s the case, go to the “Audit” tab to see the following information: What site the backlinks are from What anchor text they used (if any) What pages on your website the backlinks point to The Authority Score of the source websites The Toxicity Score of the source websitesUse the “Toxicity Score” filter to find backlinks from websites that are most likely to be harmful. Set the filter to “60-100 Toxic.”These backlinks may be hurting your Authority Score (and your ranking potential). And you might want to remove them.Here’s how:Select the links you want to remove by clicking on the checkboxes. And then click on the “Move to Remove list” button (it looks like a paper airplane).Next, click over to the “Remove” tab. Click the “Send” button to open a contact form with an email to request the removal of the backlink.If this method doesn’t work, use Google Search Console’s disavow tool. But only do this if you’re absolutely sure that the backlinks you’ve flagged are hurting your site. 4. Develop a Solid Internal Linking StrategyInternal links help readers and search engines discover new and related content within your website. And they also pass authority to other pages on your site. A great internal linking strategy is topic clustering. Topic clusters are groups of pages that explore a topic in depth and showcase topical expertise.A topic cluster includes a pillar page that explores the primary topic. As well as cluster content: multiple pages that delve deeper into specific subtopics.The pillar page is connected to the cluster content by internal links. And vice versa.Let’s consider an example: a pillar page titled “A Complete Guide to Dog Bones.” With the following cluster content that explores these potential subtopics: “dental dog bones” “marrow dog bones” “natural dog bones”Don't know where to start with topic clusters? Semrush can help.Go to the Keyword Strategy Builder. Enter up to five seed keywords from the keyword research that you did earlier.Select the correct country in the drop-down. Then, click “Create list.”Once the tool is ready, scroll down to the \"Pages Details\" section to see an overview of your pillar topics and subpages that support each topic. When you’re ready to start writing a piece of content, click on the “Write content” button to the right of a subpage or pillar page.Then click “Send keywords” in the pop-up that appears. Which will redirect you to SEO Writing Assistant.Once you’ve created and published the pages for your topic cluster, add internal links between them.5. Get Your Website Listed in Relevant DirectoriesOnline directories are websites that provide catalogs of other businesses. And search engines look for consistent information about local and small businesses across directories to confirm they’re trustworthy.So, getting listed in relevant online directories is an easy and affordable way to increase website authority. And potentially boost rankings.To get started, identify the most important online directories in your industry. Then submit your business listing to those websites.Here’s a list of online directories to get you started: Yelp Tripadvisor OpenTable Zagat Thumbtack AngiIf you don’t want to submit your business listing to each site manually (which can be tedious and lead to errors), check out the Listing Management tool. Simply enter your website URL into the space provided and click on “Get Free Report.”You’ll see the following information: How good your online presence is How many inconsistent listings you have Your average star ratingAnd if you scroll down, you’ll see a list of directories that have inconsistent information. And platforms where your business listing doesn’t appear.Click on the “Try it now” button near the top of the page to sign up for a plan. Then, you’ll be able to automatically distribute your information across all those directories. Monitor & Improve Your Domain’s AuthorityNow that you know how to increase domain authority, start tracking your Authority Score in Semrush. To see how it changes and whether you need to take additional steps to improve it.Tools like this make the process simple: Domain Overview: Monitor your overall website performance Backlink Analytics: See your backlink profile Keyword Overview &Keyword Magic Tool: Do keyword research Keyword Strategy Builder: Find topic clusters for your internal linking strategy Listing Management: Check business listings in online directoriesTry them today.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Increase Website Authority: 5 Actionable Tips"
    },
    {
      "level": "H2",
      "text": "What Is Website Authority?"
    },
    {
      "level": "H2",
      "text": "How Is a Website’s Authority Score Calculated?"
    },
    {
      "level": "H2",
      "text": "Is Authority Score a Ranking Factor?"
    },
    {
      "level": "H2",
      "text": "What’s a Good Authority Score?"
    },
    {
      "level": "H2",
      "text": "5 Tips to Increase Your Website’s Authority"
    },
    {
      "level": "H3",
      "text": "1. Get Quality Backlinks with Valuable Content"
    },
    {
      "level": "H3",
      "text": "2. Increase Organic Traffic with Optimized Content"
    },
    {
      "level": "H4",
      "text": "Perform Keyword Research"
    },
    {
      "level": "H4",
      "text": "Create Optimized Content"
    },
    {
      "level": "H3",
      "text": "3. Monitor for Bad Links"
    },
    {
      "level": "H3",
      "text": "4. Develop a Solid Internal Linking Strategy"
    },
    {
      "level": "H3",
      "text": "5. Get Your Website Listed in Relevant Directories"
    },
    {
      "level": "H2",
      "text": "Monitor & Improve Your Domain’s Authority"
    }
  ],
  "author": ""
}