{
  "url": "https://www.semrush.com/blog/how-long-does-it-take-to-rank/",
  "slug": "how-long-does-it-take-to-rank",
  "title": "Study: What Does It Take to Rank | Semrush",
  "description": "We analyzed 28,000 domains to find out how long it takes to rank higher on Google and get to the first page. Here’s what we found.",
  "content": "Getting your content to rank on the first page is the best way to drive organic traffic to your site. Websites that invest in SEO from the start, get over 4,000+ visits in the first year. And the websites that don't, get 0, and lose on the potential to gain more and more presence over time. How do we know this? We have anaylized over 28,000 new websites and what they have achieved in a year. This article covers all of our top findings, and provides guidance on how you can use this data to craft your own successful SEO strategy.How Long Does it Take to Rank in Google: Stats and Key Findings Out of the 28,000 domains we studied, only 7.65% had content ranking in the top 100 for the entire length of the study (13 months). Nearly all (92.3%) of the domains ranking in the top 100 for all 13 months had at least one backlink By the 6th month, only 19% of the domains started ranking in top 10 and maintained there till the end of the period 55.1% of the domains that failed to make it to the top 10 had no backlinks The average length of keywords for the top 10% of sites ranges from 3.2 to 3.5 words. Longer content performed better—content ranking in the top positions was on average 3.5 times longer than other lower-ranking pieces Domains in the top positions maintained better site health overall, compared to lower-ranking sitesMethodology: How We Gathered Our DataTo find subjects for this study, we selected 28,000 random domains that had never appeared in Semrush’s US database before July 2021, but were now ranking somewhere in the top 100 for at least one keyword. This ensured we were analyzing only new or recently created domains. From July 2021 to July 2022 (13 months total), we collected the historical data of the number of keywords each website ranked for. We eliminated any domains that fell out of the top 100 altogether at any point during the course of the study, to eliminate spam websites or abandoned domains. This left us with 2,155 websites remaining, meaning more than 92% of websites failed to stay within the top 100 over one year. We kept watch over these remaining domains, monitoring which ones appeared in the top 10 results for at least one keyword at least once over the period. Finally, we refined our remaining domains to a set of 178 “winners” using two criteria: Winning domains had at least 8 positions in the top 10 search results by July 2022 The total search volume for their ranking keywords was at least 1,160We compared those to the full group of qualifying domains to find any common characteristics that explain why they performed so well comparatively.Traffic Patterns & Data: How Long Does it Take to Rank in Google?We’ll begin by examining some of the patterns we saw regarding the 2,155 qualifying websites. Fewer Than 5% of Websites Can Maintain First-Page Rankings for a Whole YearGetting the first page at least once in a year was achievable for most qualified websites, but in many cases their hold on those positions would fluctuate. Our findings show that it’s common for domains to lose their top-10 positions and gain others month to month. The overall percentage of sites ranking in the top 10 increased, leveling off at around 41% toward the end of the study. Around 41% of domains were ranking in the top 10 positions after 6 months. However, these positions weren’t always stable: many of the sites analyzed fell out of the top 10 positions only to reappear again later. 27% of the websites that made it to the top 10 remained there for the entire length of the study. Only 4.2% of the qualified domains managed to have at least one top-10 keyword ranking for all 13 months of the study. Nearly 10% only appeared in the top 10 only one month of the year. SEO Winners: What Does it Take to Rank Higher on Google?The top 10% of websites saw a number of benefits from the work they put in to achieve and maintain rankings. As a result, they got over 4,000 average monthly organic search visits after their first year, while those websites not ranking got almost zero.Without Backlinks, Most Domains Won’t Reach the First PageBacklinks play a major role in ranking success. Of the qualified websites, more than half of those without at least one backlink never reached the first page. When looking at domains that never reached the first page, we found that 15.7% had no backlink data. More Referring Domains In this chart, you can see that the top-performers steadily increased the median number of referring domains linking to their site, while the group average among all qualifying sites remained stagnant for most of the year. Increased Domain Authority Because the top-performing websites earned more backlinks from a wider variety of referring domains, they also enjoyed improved domain authority compared to the average qualified site. The top 10% of domains ended the year with an average domain authority of 20.3, while the average for the qualified group was under 10. Top-Performing Websites Rank for Longer KeywordsThe websites in our study that saw the most SEO benefits also ranked for slightly longer keywords. Over the course of the study, the average length of keywords for the top 10% of sites ranged from 3.2 to 3.5 words. The full sample of qualifying sites was below 3.5 words for the entire length of the study, and by the end had dropped below 3.0 words. It may be that some of these sites were successful in part because they specifically targeted longer keywords, which often have a lower difficulty score (and are therefore easier to rank for).Top Sites Earned More Total Search Volume and More Organic TrafficTop-performing websites ranked for keywords with significantly higher search volume, compared to the larger group of qualified websites. The top 10% steadily earned more and more search volume from their top-10 keywords, likely because their increased domain authority allowed them to rank for more competitive, higher-volume phrases. The websites with the most keywords on the first page over the course of the study also pulled in more organic traffic. For these top performers, organic traffic increased steadily until leveling off and decreasing slightly toward the end of the study period. Still, they received a much higher volume of organic traffic than the group of qualifying sites, even after the plateau. Longer Content Ranks for More Keywords and Shows Up in the Top 10 More OftenWe noticed an important trend among the top-performing 10% of qualified websites: compared to all of the qualifying domains, they featured longer content. The average word count for the top performers was 846 words, compared to an average of 243 words for all qualifying websites. This suggests longer content increases the likelihood of ranking on the first page: Some of the websites we analyzed published even longer content—upwards of 1,500 words. Our research shows that content over 1,000 words was likely to rank for multiple keywords; as word count decreases, the number of keyword rankings also went down. Top-Performing Domains Ranked More Than Just Their HomepagesWe found that between 40% and 50% of qualifying domains had their homepages ranking in the top 10 at some point. When we isolated the top-performing 10% of domains, we saw that by the end of the year, they got more pages ranking in the top 10 positions. As websites publish more optimized content, those pages begin to rank on the first page. Inevitably, these content pieces achieve their goal of ranking for specific keywords, diversifying the types of ranking pages in our study. Top-Performing Sites Maintain Better Overall Site Health Across More Pages Using Semrush’s sophisticated site auditing tool, we analyzed the overall site health of all qualifying pages, once again comparing the top 10% to the full group. While both groups maintained a site health average score of 84 out of 100, the top-performing websites featured nearly double the median number of pages crawled. The more pages a website has, the harder it is to maintain a healthy site (as more pages leave more opportunities for errors). Therefore, top-performing websites were likely putting in more effort to maintain that site health score, and this also had an effect on improving their ranking power over the course of the study. How to Use This Data in Your SEO StrategyThere are a number of things growing websites can do to get onto the first page faster and start pulling in organic traffic within a year. Here’s a quick checklist to keep in mind as you plan your SEO strategy: Regularly monitor your site health using Semrush’s SEO site auditing tool Make earning backlinks a priority. Aim to get backlinks from a large range of reputable, high-authority sites with these 11 backlinking strategies Focus on creating long-form, in-depth content (1,500+ words where appropriate) with SEO Writing Assistant Target long-tail keywords of 3 words or more.",
  "headers": [
    {
      "level": "H1",
      "text": "Study: How Long Does It Take to Rank Higher on Google"
    },
    {
      "level": "H2",
      "text": "How Long Does it Take to Rank in Google: Stats and Key Findings"
    },
    {
      "level": "H2",
      "text": "Methodology: How We Gathered Our Data"
    },
    {
      "level": "H2",
      "text": "Traffic Patterns & Data: How Long Does it Take to Rank in Google?"
    },
    {
      "level": "H3",
      "text": "Fewer Than 5% of Websites Can Maintain First-Page Rankings for a Whole Year"
    },
    {
      "level": "H2",
      "text": "SEO Winners: What Does it Take to Rank Higher on Google?"
    },
    {
      "level": "H3",
      "text": "Without Backlinks, Most Domains Won’t Reach the First Page"
    },
    {
      "level": "H4",
      "text": "More Referring Domains"
    },
    {
      "level": "H4",
      "text": "Increased Domain Authority"
    },
    {
      "level": "H3",
      "text": "Top-Performing Websites Rank for Longer Keywords"
    },
    {
      "level": "H3",
      "text": "Top Sites Earned More Total Search Volume and More Organic Traffic"
    },
    {
      "level": "H3",
      "text": "Longer Content Ranks for More Keywords and Shows Up in the Top 10 More Often"
    },
    {
      "level": "H3",
      "text": "Top-Performing Domains Ranked More Than Just Their Homepages"
    },
    {
      "level": "H3",
      "text": "Top-Performing Sites Maintain Better Overall Site Health Across More Pages"
    },
    {
      "level": "H2",
      "text": "How to Use This Data in Your SEO Strategy"
    },
    {
      "level": "H6",
      "text": "Most popular pages"
    },
    {
      "level": "H6",
      "text": "SEO Checklist: 41 Tips to Optimize Your Website"
    },
    {
      "level": "H6",
      "text": "How to Perform a Complete SEO Audit (in 14 Steps)"
    },
    {
      "level": "H6",
      "text": "A Beginner’s Guide to Keyword Search Volume"
    }
  ],
  "author": ""
}