{
  "url": "https://www.semrush.com/blog/how-to-write-copy/",
  "slug": "how-to-write-copy",
  "title": "How to Write Copy That Converts: 12 Tips and Examples",
  "description": "Want to learn how to write copy like a pro? Keep reading for 12 effective writing tips and real-life examples",
  "content": "Copywriting is the act of writing words for advertising or marketing purposes. It must be concise, snappy, and convincing to motivate people to take action. In this article, you’ll learn how to write copy like a pro. Keep reading for 12 tips any small business owner or marketer can use. 1. Prioritize Your HeadlineBegin your copy with a punchy headline that entices readers to learn more about your product or service. Why is this so important? On average, only two out of 10 people will make it past your headline. Writing eye-catching and intriguing copy encourages people to make it further down the page. Great headlines share these four traits: Attention-grabbing Easy to understand and digest Accurately summarize the main idea of your message Appeal to a specific group of peopleFor example, online review platform Trustpilot’s landing page summarizes how to use its site and why it’s beneficial: Site visitors understand how and why to use Trustpilot’s search box with just nine words. You can use a headline to clarify your offer, like Trustpilot. Or you can use it to intrigue people instead.For example, The Adventurists is a unique travel company that promotes extreme and unusual adventures. The headline “Generators of Odysseys and Chaos” conveys the offbeat experiences it sells:“Odysseys and chaos” are persuasive and strategic word choices that will tempt their target audience into learning more. You can also turn your headline into a question, like non-dairy milk brand Oatly.Here, Oatly uses the headline “Why Oats?” to playfully intrigue the reader into watching the video below:Use headlines to summarize your product, service, or future plans. And start to paint a memorable picture of your brand.Further reading: How to Write SEO Headlines That Rank2. Include Keywords to Optimize Web CopySEO copywriters use keyword research to analyze search queries. These are the words people type into search engines to find information, products, websites, businesses, or services.For example, the Semrush homepage targets people looking for a suite of marketing tools. That’s why we’ve included keywords like “online marketing,” “SEO,” and “content marketing:”Include relevant keywords in SEO copywriting. This will give your webpages the best shot at ranking well in organic searches that relate to your product.But how do you find the keywords your audience is searching for?You can use Semrush’s Keyword Magic Tool. Let’s say you’re a wedding planner who wants to write copy for your new website that encourages people to use your services. First, you need to research keywords to optimize each page and help prospective clients find you.Navigate to the Keyword Magic Tool in Semrush and enter a phrase that relates to your industry (e.g., “wedding planning”). Then, pick the most relevant country for your target audience and click “Search.”You’ll see a list of all associated keywords for “wedding planning.”You could use some of these phrases on your website or landing page to appeal to those searching for these terms. For example: “Planning a wedding? We’ve got you.” Or “Download our free wedding planning checklist.”It’s vital to optimize your copy for SEO. But it’s equally vital to use keywords naturally so they don’t disrupt or degrade your copy. Prioritize human readers over search engines to keep readability high. 3. Follow the AIDA StructureUse the AIDA acronym to encourage conversions. This copywriting technique leads people through four stages of the purchasing process.The AIDA structure stands for these stages: Attention: Catch the reader’s attention to build awareness Interest: Connect with and interest them in your offer Desire: Explain the offer’s value to generate desire Action: Convince the reader to take actionFor example, here’s how mattress brand Casper used AIDA on their site to lead consumers to take the desired action. First, they grab their target audience’s attention by giving their product an unusual name: “Snow Mattress.” Next, they create interest with phrases like “enhanced comfort and support” and “engineered with our coolest sleep technology.”After that, they move on to desire with bullet points that highlight product benefits (e.g., “12+ hours of cooler sleep”).Finally, the ad ends with a call to action (CTA) button: “Shop Snow Mattress.” Why is this effective? The copywriting tells a persuasive story of what the reader will get if they buy the brand’s mattress: a “perfect balance of comfort and sleep.”4. Address the ReaderUsing the pronouns “you” or “me” makes the reader a character in the story. So it feels like a more intimate experience you’ve designed for them.On one hand, you can create a connection with the reader by addressing them as “you.” Conversely, you can put yourself in their shoes and refer to them as “me.”For example, wine subscription service Good Pair Days draws in readers with great copy that speaks directly to the reader with phrases like “your palate” and “as you like:”“We love you just the way you are” feels like Good Pair Days is speaking to a friend. Why is this effective? Because it helps the reader form an attachment to the brand.Another popular tactic for CTA buttons is to use the words “me” or “my.” For example, a classic Unbounce case study found that switching from “your” to “my” led to a 90% click-through rate increase.You can see this tactic still in action today on a variety of sites. On Lemon.io, a platform that matches startups with developers, the phrase “match me with a dev” gives the impression of immediate value. The wording persuades their target audience to enter their name and email address. When you’re writing copy for CTAs, be specific, concise, and involve the potential customer in the story. This helps to inspire action.5. Take Advantage of Reviews and Testimonials Use real reviews, testimonials, and customer phrases in copy to inspire trust and make your brand seem more relatable.Do this by looking at reviews or customer support messages and picking out the phrases people use to describe your product.Review sites like Trustpilot and Yelp are goldmines of customer voices. Check these sites for reviews of your product, and look for phrases and sentences you can use in promotional copy. For example, let's look at a review a customer posted after buying a pillow from Groove Pillows:You could use the line, “From discomfort and sleepless nights to sound sleeping and no pain,” as an effective testimonial on social media or as the header on a landing page.Here’s another example of how impactful customers’ words can be: A Yelp reviewer used the phrase “Best buffalo pizza in Brooklyn” when reviewing a pizza place. This line would make for deliciously effective sales copy, from web copy to paid ads. One caveat: Always ask for permission from the reviewer before you use their words or images as digital marketing material.You may be able to use a portion of a review without someone’s name or use a first name only to keep it anonymous. However, it’s always best to ask. You can even turn a bad review into humorous sales copy.How?Use the disparaging phrase on an outdoor menu stand to grab the attention of passersby and make them laugh. A restaurant in Iceland used this tactic to entice walk-ins: “Come in and try the worst pizza that one guy on TripAdvisor ever had in his life” is funny and self-effacing. Plus, it intrigues people to find out whether the pizza is reallythatbad.You can also consider featuring real customers’ photos (with permission) on your website, landing pages, or paid ads to make your copy more impactful. This can make your brand seem more relatable and trustworthy. For example, Non-alcoholic spirit brand Three Spirit highlights these happy customers on its homepage to help their copy connect with web visitors:6. Leverage AI to Enhance Your WorkEven great copywriters use artificial intelligence (AI) to help with ideas, first drafts, rephrasing, and proofreading.Let’s say you run a dating agency in New York City. You can ask the free chatbot ChatGPT for tagline ideas for your website:Always check that any suggestion isn’t copyrighted before using it as part of your marketing strategy. You can do so using the United States Patent and Trademark Office database or Grammarly for plagiarism. You can also use AI to improve your ideas: The more information you give it, the more accurate its responses will be.Here’s how to write more effective ChatGPT prompts: Provide contextual details (e.g., explain what your product does and who it’s for) Feed it reference material (e.g., an article’s introduction if you want it to write the rest) Set parameters (e.g., word count or format) Refine your prompts if it doesn’t get it right (e.g., change your wording to be clearer)Once ChatGPT gets you started, use Semrush’s SEO Writing Assistant to brush up your copywriting skills.For example, the Rephraser feature can help you rewrite and paraphrase your text.Head to the SEO Writing Assistant tool and click “Analyze new text.”Copy and paste your text into the blank box.Highlight a section of text and use the “Rephrase” button to quickly rephrase text on the same page. Or use the “Rephraser” button, which opens the Rephraser tool, for more detailed changes.Let’s click the latter.On the next popup screen, click “Rephrase:”Multiple ideas for rephrased versions of your copy will appear. You can switch between these by clicking the small “Idea [Number]” buttons above the text box.Do this as many times as you need to until you have a version you like. Then copy and paste it into the document you’re working from to customize it further.7. Get Specific with DataRequest and use data from your sales, marketing, and finance teams and turn it into a line of unique copy. Target those most likely to convert with a relevant message that resonates.Let’s say you sell sugar-free soda, and you did some research on Google Analytics and found that 70% of your customers make repeat purchases. You could write a new tagline on your packaging that says, “This soda is so nice, 70% of customers buy it at least twice!”Why would this work? It ties into the psychological principle of “social proof.” When we’re not sure how to act in a new situation, we look at what others are doing—and let that lead our behavior.For example, inbound marketing platform HubSpot uses data on several areas of its homepage:The company highlights that they have over 3 million social media followers and 10 million monthly blog visitors.Showing how many people follow HubSpot’s blog and social media platforms is further social proof—encouraging people to learn more or sign up.Another company that gets specific with data is project management software Basecamp.The copywriting on its site proves that you can also use data to convey the literal value of your product. Like the “Save big with Basecamp” section on its pricing page: Here, the company shows how their product is a better value than competitors by replacing the capabilities of three popular apps at less than half the price.This copywriting strategy handles a big potential objection up front (the expense) and spotlights the valuable features simultaneously.The banner at the top of the page also uses data to show how many users signed up last week:Here, Basecamp uses numbers as further proof. The reader thinks, “If all these people are doing it, I should too.”Employing these tactics helps lead the web visitor further down the marketing funnel toward a purchase. 8. Turn a Call to Action Into a “Click for Value”Instead of asking people to click your CTA button, tell them what they’ll get when they do. Why? Because specific CTA buttons are more enticing. Create more value with your call to action by: Swapping generic demands with benefits for the reader Targeting a particular group of customers Understanding the goal (to pique curiosity)For example, analytics platform Crazy Egg doesn’t demand you “Click here to start” with its CTA. Rather, it offers “Show me my Heatmap” to tell you what’s going to happen when you click: Instead of asking the reader to perform an action (“Click”), the copywriter is offering value (“Show me my Heatmap”).Another example comes from Wandering Bear Coffee.Here, the offer isn’t as complex. If you’re on the site, you’re researching coffee or looking to buy it.So Wandering Bear’s CTA, “Get caffeinated,” is still direct but a little more fun:The lesson from both examples?Use your CTA copy as an opportunity to put the focus on your target audience and highlight the benefit they get from clicking. 9. Write How You TalkWhen writing copy, consider the way your customers speak. In other words, forget dry sales talk and focus on sounding human with conversational copywriting.Here are some conversational copywriting tips to help you nail this style: Use contractions and start sentences with conjunctions (e.g., “you’re” and “but”) Empathize with your reader (e.g., “We get how you’re feeling”) Drop the industry terms and overcomplicated language (jargon) to be more accessible (e.g., “anterior” = “front”) Don’t be afraid to break grammatical rules (e.g., “Let’s do this, y’all ”)For example, print and design company MOO uses words like “a load of” and “snoozable” to make its ad copy more informal:Using “RSVPs” and “VIPs” also makes the headline more rhythmic and memorable.Another example is Monzo, a digital bank that promises to “Make money easy.” And it bases its whole brand identity on being accessible to everyone.The brand doesn’t use jargon on its landing page. Instead, casual phrases like “important stuff” keep the copy relatable and conversational. With the rise of artificial intelligence (more on that below), it’s even more critical for good copy to sound human. Whether you’re a blogger or business owner, use simple, conversational language (the way humans actually speak) to help forge connections with your target audience. Further reading: Copywriting 101: The Ultimate Guide to Creating Effective Copy10. Say More with LessStick to shorter, simpler versions of words to improve readability. And swap walls of text for strategic formatting with short paragraphs and bullet points.Here’s the deal: If a shorter word means the same thing as a longer version, go with the former.Instead of “accomplish,” say “do.” In place of “discontinue,” go with “stop.”Lemonade Insurance uses this type of copy to explain why its service is different from other brokers.Let’s take Lemonade’s tagline, “Instant everything. Great prices. Big heart,” for example. Insurance as an industry can be intimidating. But concise sentences show how accessible Lemonade is in comparison.Here’s how to stick to the point and use the power of editing with concise, simple language to appear more accessible, like Lemonade: Before Editing After Editing “Get all insurance quotes within a matter of seconds” “Instant everything” “We’ve got better prices than most brokers” “Great prices” “We care about our customers and team members” “Big heart” 11. Use Power Words Sparingly Avoid words that sound like you’re exaggerating. This can detach readers from your intended message and keep them from connecting with your content. Use the following words sparingly when writing copy: Power words: Words that are supposed to be emotionally compelling but sound like they’re trying too hard (e.g., skyrocket) Adverbs: Words that modify verbs (e.g., loudly roared) weaken copywriting and make it feel cluttered Adjectives: Words that describe nouns (e.g., yellow flower) can feel dull and don’t let the reader imagine an alternativeInstead, target people’s emotions with less bravado to inspire action.For example, the signup page for the daily newsletter Morning Brew sticks to simple language with an intriguing message:There are no power words or meaningless adverbs and adjectives to distract you.Here’s why.People don’t use words like “supercharge” or “power up” in everyday conversation. But copywriters love to overuse them. To readers, they feel like they’re trying too hard.Power up your marketing. Supercharge your sales. Optimize your support. The above copy sounds unnatural.The same goes for adverbs like “very” and “extremely.” As Stephen King wrote: “I believe the road to hell is paved withadverbs, and I will shout it from the rooftops.” If you don’t need the word to clarify your message, get rid of it.But this doesn’t mean you should avoid adjectives entirely. Why? The right one can make copy more memorable. Clothing company Hiut Denim uses “famous newsletter” to inject personality into its email marketingCTA:But the wrong adjective can feel vague and unnecessary. Phrases like “Free gift” and “unexpected surprise” are redundant and sound fake. The solution?If you can replace an adjective with a stronger noun, do it. Here are some examples: Careless mistake = blunder Several people = crowd Big house = mansionWhen it comes to copy, ask yourself if it adds to your brand voice or message. If it does, keep it. If it doesn’t, cut it.12. Consider Your Customer What works for one audience won’t always work for another. For example: “Buy now” may not be as effective with a B2B (business to business) audience. This is because multiple team members may need to be involved before a purchase can be made. Take the messaging app Slack, for example. They don’t ask for payment immediately since they know their audience of B2B businesses tends to need buy-in from others.Instead, they offer two tailored CTAs: “Meet Slack for Enterprise” or “Talk to sales”:Slack assumes those looking for their services will want to do more research and speak to other team members before they’re ready to buy. But when prospects have moved further down the funnel, they hook them with an enticing statement: This line of copy reassures buyers there’s no risk in trying Slack out. So, it’s more likely that decision-makers and larger teams will agree to give them a shot.When writing copy, it’s essential you consider your audience—are they B2B or B2C (business to consumer), and what are their pain points and preferences?Effective copywriting starts with an in-depth understanding of your audience. This way, you know their priorities, what they find valuable, and how best to phrase your words to make a strong connection.Further reading: Target Audience: What It Is and How to Find YoursLearn How to Write Copy That Converts Wondering how to write copy that will attract, retain, and convert your audience?It’s simple: Use your audience’s language when they search for products like yours.Use Semrush’s Keyword Magic Tool to find the most effective words and phrases to target in your copywriting. Then, use the AI-powered SEO Writing Assistant to help you refine your first draft.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Write Copy That Converts: 12 Tips and Examples"
    },
    {
      "level": "H2",
      "text": "1. Prioritize Your Headline"
    },
    {
      "level": "H2",
      "text": "2. Include Keywords to Optimize Web Copy"
    },
    {
      "level": "H2",
      "text": "3. Follow the AIDA Structure"
    },
    {
      "level": "H2",
      "text": "4. Address the Reader"
    },
    {
      "level": "H2",
      "text": "5. Take Advantage of Reviews and Testimonials"
    },
    {
      "level": "H2",
      "text": "6. Leverage AI to Enhance Your Work"
    },
    {
      "level": "H2",
      "text": "7. Get Specific with Data"
    },
    {
      "level": "H2",
      "text": "8. Turn a Call to Action Into a “Click for Value”"
    },
    {
      "level": "H2",
      "text": "9. Write How You Talk"
    },
    {
      "level": "H2",
      "text": "10. Say More with Less"
    },
    {
      "level": "H2",
      "text": "11. Use Power Words Sparingly"
    },
    {
      "level": "H2",
      "text": "12. Consider Your Customer"
    },
    {
      "level": "H2",
      "text": "Learn How to Write Copy That Converts"
    }
  ],
  "author": ""
}