{
  "url": "https://www.semrush.com/blog/how-to-set-up-google-analytics/",
  "slug": "how-to-set-up-google-analytics",
  "title": "How to Set Up GA4: A Complete Step-by-Step Guide (2024)",
  "description": "Learn how to set up GA4 in five steps. And three different methods for installing it on your website.",
  "content": "What Is GA4?Google Analytics 4 (GA4) is a free tool for tracking visits to websites and apps. And the interactions that happen on these. The tool provides insights into traffic numbers, user demographics, most-visited pages, and more.Google is the developer of GA4—and its predecessor, Universal Analytics (UA).In this guide, we’ll explore how GA4 differs from UA and how to set up GA4.And how to use it to track your website’s performance.How GA4 Tracking Differs from UAUA is the previous version of Google Analytics before Google launched GA4 in October 2020.GA4 differs from UA in ways like: Terminology for user interactions: UA calls user interactions “hits.” With different hit types for page views, events, and other interactions. In contrast, GA4 calls all user interactions “events.” Changes to the Google Analytics account structure: UA accounts could contain multiple properties. Which could, in turn, contain multiple views for creating filtered data segments. GA4 accounts can still contain multiple properties, but they cannot contain views. And unlike UA properties, GA4 properties can receive multiple data streams from websites and apps. Instead of tracking data from only one source.Standard UA accounts stopped processing data on July 1, 2023. So, if you want to track your website performance using Google Analytics, you will need to set up GA4.Further reading: Differences Between GA4 and UAHow to Set up GA4Setting up GA4 involves five main steps: Create a GA4 Account Create a GA4 Property Provide Your Business Details Provide Your Business Objectives Create a Data StreamNoteThis process assumes you haven’t set up UA on your website. If you have, use Google’s free GA4 Setup Assistant instead. It’ll walk you through migrating from UA to GA4.1. Create a GA4 AccountYou will need a Google Analytics account to set up GA4. If you don’t already have a GA4 account, create one by going to https://analytics.google.com/ and logging in to your Google account.NoteIf you don’t have a Google account, click “Create account” on the login screen to create one.Once you’ve logged in, click the gear icon on the left sidebar to access the “Admin” settings.Then, on the Admin dashboard, click “+ Create” > “Account” to create your Google Analytics account.Give your account a name in the “Account name” field. And use the “Account Data Sharing Settings” to select the purposes for which you’re willing to share your data with Google.Click “Next” when you’re done.2. Create a GA4 PropertyThe next step is to create a property in your GA4 account.A property is a collection of data from a website and/or app. A simple GA4 property example is a property that contains data from just one website. Or one app.But if you have more advanced reporting needs, set up a property to comprise data from multiple sources.To create a GA4 property, give your property a name using the “Property name” field. The name needs to contain at least four characters.Next, provide your preferred time zone and currency for your reports.Click “Next.”3. Provide Your Business DetailsFill out the “Industry category” and “Business size” fields.Click “Next.”4. Provide Your Business ObjectivesSelect at least one of the business objectives shown on the screen. This is to help GA4 customize its default reports to meet your needs.If you select “Get baseline reports,” GA4 will provide a collection of reports for activity across the customer life cycle. Instead of providing reports tailored to a specific business objective.Then, click “Create.”The Google Analytics terms of service agreement will appear on the screen. Adjust the country setting to view the appropriate agreement for your geographical region if you need to.Review the terms of service. If you accept them, click “I Accept” to proceed to the next step.NoteIf your business is subject to the General Data Protection Regulation (GDPR), you’ll also need to select the “I also accept the Data Processing Terms as required by GDPR” checkbox.5. Create a Data StreamThe final step is to create a data stream. Which will send data from your website or app to your GA4 property.The steps for creating a data stream differ depending on whether your data source is a website, iOS app, or Android app.To create a data stream from a website, click “Web.”Type your domain into the “Website URL” field. And use the “Stream name” field to name your data stream.Then click “Create stream.”A window will slide in, showing your data stream’s measurement ID and other details.Save the measurement ID to a text file for convenient reference—you may need it later.After creating the data stream for your website, the next step is to install GA4 on it.Further reading: This guide covers how to create data streams from iOS and Android apps.How to Install GA4 on Your WebsiteWatch this video for an overview of the GA4 installation process on a website: We’ll also share the steps for these three GA4 installation methods below. Install GA4 with Google Tag Manager Install GA4 Using an Integration Install GA4 ManuallyThe first method is ideal if you already have Google Tag Manager (GTM) installed on your website.In contrast, we recommend using the second method if you created your website using a website builder like WordPress, Squarespace, or Wix. And don’t have GTM installed on it.If your website doesn’t have GTM installed and it can’t integrate with GA4 (whether with a native or third-party integration), use the third method instead.Method 1: Install GA4 with Google Tag ManagerGTM is a platform for installing code snippets (called “tags”) on a website without modifying its code directly. This includes tags for GA4.If you want to use this GA4 installation method but haven’t set up GTM for your website, follow the steps here to do so first.In the process, you will set up a “container,” which is a collection of the tags and other modifications you’ve added to your website using GTM.Then, go to https://tagmanager.google.com/ and log in to your Google account.Select your website’s GTM container.Click the “Add a new tag” option on your container’s workspace overview.Click “Untitled Tag” to give your tag a name, like “GA4 Setup”:Then, click anywhere in the “Tag Configuration” panel.From the “Choose tag type” window that slides in, select “Google Tag.”Fill out the “Tag ID” field with your GA4 data stream’s measurement ID. If you haven’t saved your measurement ID after creating your data stream, learn how to find it here.After that, optionally adjust your tag’s configuration, shared event, and advanced settings.When you’re done, click anywhere in the “Triggering” panel to set up when GTM should “fire” (or load) the GA4 tag. So the tag will send data from your website to GA4.From the “Choose a trigger” window that slides in, select “Initialization - All Pages.” This is the standard GA4 trigger option, which will cause the GA4 tag to fire ahead of any other tags you’ve added to your website.Click “Save” at the top of the tag setup window to save your new tag.Next, test your GA4 tag by clicking “Preview” from your container’s workspace overview.The Google Tag Assistant will launch in a new browser tab. Type your domain into the “Your website’s URL” field, then click “Connect.”Your website will load in a new window. Leave that window open and go back to the Tag Assistant page.If Tag Assistant manages to connect to your website, a “Connected!” window will appear. Click “Continue” to close it.You will see your GA4 tag under the “Tags Fired” category of the “Output of [your measurement ID]” panel if GTM successfully loaded it.If so, close Tag Assistant and your website. Then, click “Submit” on your container’s workspace overview to save the changes to GTM.A “Submit Changes” window will slide in.Leave the “Submission Configuration” setting as “Publish and Create Version.” After that, use: The “Version Name” field to name the new version of your website (e.g., “GA4 installed”) The “Version Description” field to provide details of your changesFinally, click “Publish” to make your changes to GTM live. And activate your website’s GA4 installation.Method 2: Install GA4 Using an IntegrationSome website builders, like Squarespace and Wix, offer native GA4 integration.In other words:They contain built-in functionality for connecting a website created on their platform with GA4. You just need to navigate to a certain setting and provide your GA4 property’s measurement ID.These guides explain how to install GA4 using the relevant website builder’s native GA4 integration: How to install GA4 on a Squarespace website How to install GA4 on a Wix websiteIn contrast, the WordPress website builder doesn’t natively integrate with GA4. Instead, use a third-party WordPress plugin to install GA4 on a WordPress website. There are many such plugins out there.We’ll demonstrate the process using Google’s Site Kit plugin.Log in to your WordPress admin dashboard and go to “Plugins” > “Add New Plugin” in the left sidebar.On the “Add Plugins” page, type “site kit” into the search field.Then, hit “Enter” or “return” on your keyboard to run the search.Look for the plugin titled “Site Kit by Google – Analytics, Search Console, AdSense, Speed.” Click the “Install Now” button to install the plugin on your website.After that, click “Activate” to activate Site Kit.You will see a success message confirming Site Kit’s activation. Click “Start setup” to begin setting it up.The setup screen will show a checkbox stating “Connect Google Analytics as part of your setup.” Check this box, then click “Sign in with Google.”Sign in to your Google account on the login screen that appears. And proceed through the next few screens for granting Site Kit access to your Google account.Site Kit will then walk you through these three steps: Verifying your ownership of your website Turning on metrics in your Site Kit dashboard Setting up Google Search Console (GSC)When you’ve finished doing these, you’ll see a screen titled “Set up Google Analytics.” Click the “Next” button on this screen to install GA4 on your website.On the “Connect Service” screen that loads, use the “Account,” “Property,” and “Web Data Stream” drop-down menus to select the GA4 account, property, and data stream you set up earlier.Then, click “Configure Analytics.”A success message will appear to confirm GA4’s installation on your website.Method 3: Install GA4 ManuallyNoteThis method involves working with your website’s code. If you are uncomfortable doing this, try using the GTM or GA4 integration methods to install GA4 on your website instead. Alternatively, contact a developer for help.To install GA4 manually, go to the “Web stream details” window for your website’s data stream in GA4. Navigate to it by clicking “Admin” in the left sidebar:Then, under “Property settings,” select “Data collection and modification” > “Data streams.”Click the data stream for your website on the “Data streams” page that appears.When the “Web stream details” window slides in, scroll down and select “View tag instructions.”Then, click “Install manually.”A code snippet will appear on the page. Use the clipboard icon to copy it.Then, paste the code snippet into the Hypertext Markup Language (HTML) for every page of your website immediately after the page’s <head> tag.Save your changes.Pro tipCheck if your website theme files contain a header.php file that generates the <head> section for all your webpages. If so, paste the code snippet just after the <head> tag in that file.Doing this will automatically add the code snippet below the <head> tag for all your website’s pages.How to Track Events with GA4In UA, “events” broadly refer only to users’ interactions with content, excluding the loading of pages. But GA4 considers all interactions or occurrences on your website (or app) to be “events.”Examples of GA4 events are: The loading of a page A user’s first visit to a website A user’s submission of a form The adding of an item to a shopping cartTo track events in GA4, click “Reports” in GA4’s left sidebar.Then, click “Engagement” > “Events.”You will get a list of the events GA4 has detected on your website over a specified date range.For each event, you can view metrics like: Event count: The number of times users have triggered the event Total users: The number of unique users who have triggered the event Event count per user: The average number of times each user has triggered the event Total revenue: The total revenue the event has generatedClick the date range setting at the top to change the time frame for which the report should display event data.Click any event in the report to get event-specific metrics like: Event count by country Event count by gender Events per sessionFor example, here’s the report for the user_engagement event.It’s also possible to create an “Exploration,” or advanced custom report, of specific GA4 events. Learn more in this guide:Further reading: How to Create a Custom GA4 Events ExplorationHow to Track Conversions with GA4A conversion is a GA4 event that fulfills a business objective. Examples of conversions are: The filling out of a product demonstration booking form The placing of an order The downloading of a file on your websiteGA4 doesn’t provide default conversion events. So, set them up yourself to match your business goals.Once you’ve set up your conversion events, GA4 will record them as they occur.Find GA4’s Conversions report by clicking “Reports” in GA4’s left sidebar.Then, click “Engagement” > “Conversions.”For any given time frame, you can see these metrics for each conversion event: Conversions: The number of times the conversion event has occurred Total users: The number of unique users who converted Total revenue: The revenue you’ve earned from the conversion eventUse the Conversions metric in other GA4 reports to track the conversions from various traffic acquisition sources, pages, and other data attributes.For example, on the Pages and screens report, you’ll see the number of conversion events that have occurred for each web page listed in the report.Click the Conversion metric’s “All events” drop-down menu to get just the number of conversions for specific conversion events.How to Import Data to GA4You can import the data from other sources, like a customer relationship management (CRM) tool, to GA4. This allows you to consolidate your data into a single platform. And analyze it holistically.Types of data you can import to GA4 are: Ad cost data Item data User ID data Client ID data Offline event dataImport your data either: Manually via a CSV file Automatically, on a regular schedule, by connecting GA4 to a CSV file you’ve uploaded to your Secure File Transfer Protocol (SFTP) serverTo import data to GA4, click “Admin” in the platform’s left sidebar.Then, under “Property settings,” select “Data collection and modification” > “Data import.”Click “Create data source.”Give your data source a descriptive name. And select the appropriate data type you’re importing.Then, scroll down and select your import source.If your import source is a CSV file, click “Upload CSV” to upload your CSV file.But if you’re importing from your SFTP server, change the import source to “SFTP.” Fill out your SFTP server username and the URL to your CSV file on the server. And set up your import schedule.After setting up your import source, click “Next.”The next step is to map your import source’s data fields to those in GA4.If you’re manually uploading a CSV file, use each GA4 field’s drop-down menu to map it to the appropriate field in your CSV file.Then, click “Import.”The import will start immediately.On the other hand, if your import source is your SFTP server, click the pencil icon. And rename your import fields to match those in the CSV file on your server.Then, click “Create & generate key.”GA4 will generate a public key to authorize its connection to your SFTP server. Copy the public key and add it to your SFTP server settings.NoteCheck your SFTP server’s support articles if you aren’t sure how to input the public key. Or contact its support team for help.Once the authorization is successful, GA4 will import your data following the schedule you set up earlier.Then, use GA4 to analyze the data you’ve collected from GA4 and other sources.Types of Analyses in GA4With GA4, you can analyze issues like: The number of users who visited your website. Adjust the date range to get user counts for specific time frames. And identify trends in user numbers over time. The demographics of your website visitors. Including their countries and cities of origin, languages spoken, gender, and interests Your website’s most popular pages. Plus, their effectiveness at generating conversions The events happening on your website The conversions happening on your website Your top sources of website traffic. Be it traffic from organic search, email, referrals, or direct visits The devices users use to visit your website. Not just whether they are using a desktop or mobile device but also specific device operating systems and browsers Your users’ purchase journeys. From the start of a session to the viewing of a product, and finally, checkout. And how many users are dropping out at each stage of the purchase funnel.Use these insights to evaluate your website’s effectiveness in raising awareness of your business among your target audience, growing your customer base, and generating sales.But if you find GA4’s reports challenging to interpret, AI Narratives for GA4 can help.This artificial intelligence tool uses your GA4 data to generate easy-to-understand reports on your website’s page views, conversions, revenue, and other performance metrics. It also provides recommendations for improving these.AI Narratives for GA4 can automatically email you its reports for convenient reference. And alert you when it detects unusual website traffic fluctuations.Connect GA4 with other tools for even more performance insights.For example, Semrush’s Organic Traffic Insights integrates with GA4 and GSC to show the keyword, user, and session data from these tools and Semrush’s database for your landing pages in one place.Organic Traffic Insights can also tell you which keywords are bringing traffic to your pages. Even if GA4 lists these keywords as “(not provided)” in its reports.Then, learn your ranking positions and share of traffic for these keywords.Get Started with GA4Setting up GA4 takes some initial effort, but the wealth of (free) website performance data you’ll unlock in the process is well worth it.To get even more out of GA4, pair it with AI Narratives with GA4 and Organic Traffic Insights.These tools can enrich your GA4 reports with recommended next steps. And provide a holistic view of your search engine rankings.Try both for free by signing up for a Semrush account.FAQsHow Do I Get Access to GA4?To get access to GA4, sign up for a Google account and a Google Analytics account. After that, follow GA4’s onboarding steps to set it up.If you’re installing GA4 on a website, use GTM or a GA4 integration. Or, manually add a code snippet to your webpages.What Is the Best Practice for a GA4 Setup?Google recommends that users add not more than three data streams to a GA4 property. Meaning, one each for a website, iOS app, and Android app.If your brand owns multiple websites or apps, setting up multiple GA4 properties may be appropriate depending on your data measurement objectives.How Much Does It Cost to Set up GA4?GA4 is a free tool, so setting it up will cost you nothing. But you’ll incur costs if your GA4 setup includes integrations with paid third-party tools.For example, if you have a Semrush account, you can use the AI Narratives for GA4 tool for free for seven days. It costs $39/month after that.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Set Up GA4: A Complete Step-by-Step Guide (2024)"
    },
    {
      "level": "H2",
      "text": "What Is GA4?"
    },
    {
      "level": "H2",
      "text": "How GA4 Tracking Differs from UA"
    },
    {
      "level": "H2",
      "text": "How to Set up GA4"
    },
    {
      "level": "H3",
      "text": "1. Create a GA4 Account"
    },
    {
      "level": "H3",
      "text": "2. Create a GA4 Property"
    },
    {
      "level": "H3",
      "text": "3. Provide Your Business Details"
    },
    {
      "level": "H3",
      "text": "4. Provide Your Business Objectives"
    },
    {
      "level": "H3",
      "text": "5. Create a Data Stream"
    },
    {
      "level": "H2",
      "text": "How to Install GA4 on Your Website"
    },
    {
      "level": "H3",
      "text": "Method 1: Install GA4 with Google Tag Manager"
    },
    {
      "level": "H3",
      "text": "Method 2: Install GA4 Using an Integration"
    },
    {
      "level": "H3",
      "text": "Method 3: Install GA4 Manually"
    },
    {
      "level": "H2",
      "text": "How to Track Events with GA4"
    },
    {
      "level": "H2",
      "text": "How to Track Conversions with GA4"
    },
    {
      "level": "H2",
      "text": "How to Import Data to GA4"
    },
    {
      "level": "H2",
      "text": "Types of Analyses in GA4"
    },
    {
      "level": "H2",
      "text": "Get Started with GA4"
    },
    {
      "level": "H2",
      "text": "FAQs"
    },
    {
      "level": "H3",
      "text": "How Do I Get Access to GA4?"
    },
    {
      "level": "H3",
      "text": "What Is the Best Practice for a GA4 Setup?"
    },
    {
      "level": "H3",
      "text": "How Much Does It Cost to Set up GA4?"
    }
  ],
  "author": ""
}