{
  "url": "https://www.semrush.com/blog/how-to-use-reddit-keyword-research-content-marketing-strategy/",
  "slug": "how-to-use-reddit-keyword-research-content-marketing-strategy",
  "title": "Reddit Keyword Research: Uncover Hidden SEO Opportunities",
  "description": "Discover untapped keyword research tactics on Reddit and learn how to boost your website‘s visibility.",
  "content": "Reddit is a social media website where millions of people come together to discuss and debate. And anyone can find a subreddit to suit their interests.This is precisely why Reddit is an excellent platform for keyword research.In this guide, we’ll share a step-by-step process for how to do keyword research on Reddit. And show you the tools you can use to amplify your results.What Is Reddit Keyword Research?Reddit keyword research is the process of extracting keywords from the conversations people have about different topics on the platform. It helps you discover what your target audiences are interested in. Then, you can leverage those insights for content creation and improve your chances of ranking highly in search results.Why Use Reddit for Keyword Research?Reddit is a powerful and underrated keyword research tool. It provides you with deep insights into your audience’s interests and pain points.Known as “the front page of the internet,” Reddit has 57 million daily active users. But its large user base isn’t the only reason you should consider Reddit for keyword research.Reddit users participate in subreddits—active communities organized around a shared interest—that cover industry-specific topics (r/GoogleAnalytics), personal issues (r/relationship_advice), and general interest categories like music (r/Techno).These subreddits are gold mines for user-generated content like product reviews. And they allow you to detect up-and-coming trends before they even begin making mainstream waves.Let’s say you own a skin care brand. And the first subreddit you go to for keyword research is r/SkincareAddiction. While reading the posts in this subreddit, you’ll be able to: Discover topics that your audience is currently interested in Understand what your audience is looking for when selecting a new skin care product Identify broader trends that are influencing shopping habits Connect with influencers and subject matter experts (SMEs) Find out how your customers are using your product and read honest reviewsWith highly active subreddits such as r/SkincareAddiction, you can get all of these insights in near real time. Which allows you to create content that’s relevant and engaging to your audience.How Does Reddit’s Search Functionality Work?Using Reddit’s search feature is easy on both desktop and mobile. Below are the steps to help you get started:1. Navigate to the Search FunctionNavigate to the “Search Reddit” bar at the top of the page.On mobile, look for the magnifying glass in the top right corner of the homepage.2. Search for a TopicType in your query and click enter. Or click “Search for skincare.”Reddit will automatically generate a list of matching communities. Note that clicking on any of the subreddits will take you directly to their homepage without showing you the search results.3. Analyze the Search ResultsThe search results page on Reddit includes all “Posts,” “Comments,” “Communities,” and “People” that contain your query. You can use the “Sort” drop-down menu to filter posts by: Relevance Hot Top New Most CommentsUsing the “Time” filter, you can refine the search results based on when they were published. Which is helpful for discovering new conversations from the last month, week, or even 24 hours.On the right-hand side, you’ll find a “Communities” tab related to the “skincare” keyword. (These are the same subreddits you’ll see if you click on “Communities” in the top row.)When you click on one of the subreddits in the “Communities” tab, you‘ll be taken to the subreddit homepage where you can run another search query limited to that community.Here’s what that type of search looks like:Take some time to experiment and familiarize yourself with the search filters. They’re essential for digging up conversations and communities that will lead you to the right keywords.Let’s go over exactly how to find keywords next.How to Do Reddit Keyword ResearchHere’s a step-by-step guide to conducting keyword research on Reddit:Identify High-Performing SubredditsFinding high-performing subreddits should be the main focus of your Reddit keyword research strategy.Why?Because those subreddits allow you to quickly discover new trends while building relationships with other Redditors. Which is essential to establish credibility in your niche.Using the skin care industry as an example, here’s an easy way to find the top subreddits to prioritize:1. Search Specifically for CommunitiesAfter doing a Reddit search for “skincare,” apply the “Communities” filter to see all related subreddits.Pay attention to the number of members in each subreddit. Because more members usually means higher engagement. But also pay attention to the kind of skin care each community focuses on. If your company is a U.S. skin care brand with products for people over age 30, then r/30PlusSkinCare will be a better choice than r/AsianBeauty (which focuses on Asian brands).A subreddit wiki is another indicator of a highly engaged community. For example, r/SkincareAddiction includes a wiki with information on everything from posting guidelines to product ingredients. This is also a sign of a knowledgeable audience who aren’t just consumers, but also experts in their own right.2. Explore Adjacent SubredditsNot all skin care-related communities will contain the keyword “skincare” in their name. So, consider related topics.If your company treats specific skin conditions like eczema or psoriasis, try to find subreddits that focus exclusively on those topics.Some subreddits also provide a list of related communities in the right-hand sidebar. In the case of r/IndianSkincareAddicts, suggested communities include r/IndianBeautyDeals, r/AsianBeauty, and r/SkincareAddiction.3. Evaluate the Number of Comments and New PostsChecking the number of comments and upvotes on new posts is a great way to evaluate engagement. It’s important to do this in addition to looking for subreddits that have a large membership. Because some subreddits could have gained a large following 10 years ago, while only a small minority of members remain active today. If you filter posts by “Hot,” Reddit will show you all new posts that are getting a lot of engagement.In the example below, we can see that many posts published less than 24 hours ago are already getting hundreds of upvotes and dozens of comments.Once you choose your top subreddits, it’s time to become an active part of those communities.Pro tip: Try to limit your choice to your top three subreddits based on membership, engagement, and relevance. Prioritizing a few communities allows you to invest more time into your subreddits of choice and find high-quality keywords. This doesn’t mean jumping into self-promotion—some subreddits even have strict rules against any kind of advertising.It means participating in discussions and offering advice to understand your audience’s pain points on a deeper level. These pain points and other newfound customer knowledge can inform your keyword research. And they allow you to differentiate yourself from your competitors, since most brands aren’t using Reddit for this purpose.Mine Keyword Ideas from Reddit Threads and CommentsThere are a couple of ways to manually find keyword ideas on Reddit. (For automated methods, jump to the tools section.)First, open the subreddit you want to mine for keywords.Depending on which types of keywords you’re interested in, there are different queries you can enter.To find informational keywords (ones users search to find information), type any of the following into the subreddit search bar: “why” “how” “what” “guide”You can also apply filters. In the example below, we searched “how” and applied the “Hot” filter to find recent posts with high engagement.To find commercial keywords (ones users search when they want to evaluate brands, products, or services), run a search using any of the following: “best” “recommendation” or “reqs” “vs” “advice” “review”You can also search for specific skin conditions that your products treat. Or look up products by name.Identify Posts and Comments with the Most PotentialDepending on the size of the subreddit, you could find hundreds of potential ideas using the mining strategies listed above.So, how can you separate ideas that have the potential from those that don’t?The first step is to pay attention to comments. If a post has many comments, it means the topic is popular within the community.Upvotes also matter. But it’s possible for an engaging topic to get a low number of upvotes compared to comments:And make note of any posts that have many upvotes but few comments or lack a good response. Because they’re an opportunity for you to fill an information gap with helpful content.When you extract ideas from comments, upvotes are the primary metric you should be looking at. They indicate the community finds that content relevant and helpful.Comments or posts that have been heavily downvoted can also be sources of ideas. For example, subreddit members could have downvoted a comment that shared a common skin care misconception. But you can use the comment as an idea for a blog post that dispels this misconception.Finally, add any interesting posts or comments to a spreadsheet. In one column, you can write down the topic and paste the URL in another. This will help you keep track of Reddit conversations over time.With all of these ideas in one place, it’ll be easier to brainstorm content and extract keywords.Analyze Terms with Keyword Research ToolsNow you’re ready to extract and analyze keywords. Analysis is important to understand what kind of content ranks for a specific keyword, how many people are searching it, and whether your website can rank.Let’s use the following post as an example:From just one post, we can already extract a couple of potential keywords: “dry and bumpy skin” “simple skincare routine” “skincare routine for dry and bumpy skin”Next, we want to understand the search intent (the reason behind a searcher’s query), search volume, and Keyword Difficulty (our metric that indicates how difficult it would be to rank in the top 10 results) for each keyword.We can do this using a keyword research tool like Keyword Overview.First, plug all your keywords into the tool and click “Search.”When the analysis is complete, you’ll see a table listing metrics for each keyword.Now, evaluate this information to determine whether these are the right keywords to target.For example, you’re less likely to rank in the top 10 results for the keyword “simple skincare routine” (which has a Keyword Difficulty of 81) if your website has an authority score of 20. So, you might want to look into the other ideas you’ve collected to find an alternative keyword that you have a better chance of ranking for.A long-tail keyword like “men’s skincare routine oily skin” that has a Keyword Difficulty of 25 may be a better choice.As your website builds credibility, you can create a balance between targeting high- and low-difficulty keywords. So you don’t miss out on targeting valuable terms.Leverage Reddit Keyword Insights for Content CreationReddit insights allow you to create unique and useful content for multiple channels.Traditional keyword research methods like a competitor gap analysis help you understand what your competitors are doing. But they don’t provide you with a direct insight into your audience. Or help you detect real-time changes in their behavior.But Reddit does.Highly engaged Reddit communities allow you to discover trends as they arise. So you can cover them on your blog or social media pages before your competitors catch on. This can make you stand out as an industry leader and a brand that’s in touch with its audience.For example, you can use Reddit to discover which products skin care consumers are talking about if you’re writing an article about leading skin care trends.Instead of writing a generic SEO article that rehashes the top-ranking articles, Reddit insights can help you bring a unique voice to the conversation.You can even reach out to active Redditors and offer to include their testimonials or opinions in your article. This means your audience will see its interests and concerns reflected in your content. And you might become a trustworthy resource on product- or industry-related topics.Reddit posts and comments can also be a great source of “hot takes” that fuel engagement on social media. The post in the example below (with over 300 comments) is a gold mine of unique opinions.And you can turn these opinions into thought leadership articles for your website or newsletter.Ensuring Your Reddit-Sourced Keywords RankThe next step is to make sure your articles are properly optimized for the target keywords you found on Reddit. So your time and effort doesn’t go to waste.Here are our top tips for optimizing content: Align your article with the user’s search intent Include semantic keywords (keywords related to the main idea you’re writing about) in addition to the target keyword Break up the content with H2s, H3s, and H4s to improve readability Avoid keyword stuffing Include images to visually engage the readers Add relevant internal linksFurther reading: The Art of Content Optimization: The Complete 2024 Guide4 Reddit Keyword Research Tools to Use for Better ResultsReddit keyword research tools can help you find and filter keywords faster than manually combing through posts and comments. Below are our top three picks.1. Organic ResearchWith Semrush’s Organic Research tool, you can discover keywords that a particular subreddit ranks for.The first step is to paste the URL of the subreddit into the search bar, select your target region, and click “Search.”The tool will generate a report with insights into the number of keyword rankings, traffic, competitors, etc.Scroll down to “Top Keywords” and click on “View all 2.1K keywords.” (The exact number on this button will vary depending on the subreddit.)This will take you to a page that contains all the keywords the subreddit currently ranks for. And you can use filters to refine the results. In the example below, we set the search intent filter to “Informational” and the Keyword Difficulty to “Possible.” And applied an advanced filter to exclude all keywords that contain the word “reddit.” To remove all branded keywords from the list.When you’ve identified some good options, you can export the keywords in a CSV or XLSX file format.Pros: It provides numerous filters that help you find the precise keywords you’re looking for It allows you to easily exclude any brands or words you want to avoid It includes historical traffic insights to help you understand audience interest in a specific subreddit (and the topic it covers)2. Trend Analytics for RedditWith Trend Analytics for Reddit, you can dive into the fastest growing subreddits, compare subreddit growth trends, and research the top posts and keywords on Reddit. Find this app in the Semrush App Center and take a free seven-day trial to get started.Inside, you’ll see four tabs for the different functions of the app: Top subreddits: A table showing you the biggest subreddits on the site, plus metrics on visitors and trends Subreddits comparison: Generate a comparison graph of two subreddits to see which one is trending with more interest over time Posts: Filter by time period and location and get a list of the top posts on Reddit based on number of visits Keywords: Research any keyword or compare two keywords side by side to see clicks and keyword search volume on RedditIf you’re curious about which subreddit is growing faster between two options, the “Subreddits comparison” tab makes it easy to see.You can run a similar comparison in the “Keywords” tab, giving you insight into how topics compare. Take this info and use it to inform your decision-making for where you’ll focus your marketing and advertising on Reddit. 3. Related Subreddits FinderThe Related subreddits finder is a simple tool that does what it says—it helps you find related subreddits.When you enter a community’s name in the top left corner, the graph will populate with all other related subreddits.The tool determines the connection based on user activity. For example, members of the r/GoogleAnalytics community frequently post to r/TechSEO.When you click on one of the subreddits in the graph, you can see user posts and filter them by “Hot,” “New,” “Top,” etc. The tool doesn’t display comments. But it does open the Reddit thread in a new window.Pros: It’s free and easy to use It discovers related subreddits in seconds, so you don’t have to do any manual digging It allows you to uncover audience interests you might not have been aware of4. KeywordditKeyworddit is a tool that extracts a list of top keywords from your subreddit of choice.Enter the name of a subreddit, click “Get keywords,” and the tool will generate a list of all keywords mentioned in the community.The keywords are sorted according to monthly search volume in the U.S. And you can download a CSV file of all keywords by clicking on “Export.”Clicking on “Context” will take you to a Google SERP that lists all Reddit posts that contain that specific keyword.Pros: It’s free and easy to use It quickly generates a list of the top keywords in a given subreddit It allows you to download a CSV file that you can upload into another keyword research tool to get more insightsTracking and Refining Your Reddit Keyword Research EffortsOnce you start publishing content based on your Reddit keyword research, make sure to track which keywords you’re ranking for and how your ranking has changed over time. You should also monitor the amount of traffic your Reddit keywords are bringing in. And whether visitors find the content engaging.You’ll want to monitor your: Keyword rankings Organic search traffic User engagement (such as engagement time)Semrush allows you to monitor all three.To set up keyword performance monitoring, use Position Tracking.Get started by following the configuration steps.Input all the keywords you want to monitor and click “Start Tracking.” After a few minutes, the tool will gather all the data and take you to the “Landscape” report. Whichoffers insight into your visibility (an index based on the average position of your domain’s ranking pages), estimated traffic, and average position for the target keywords. On the right-hand side, you can see a summary report. Which includes alerts on new competitors.To track organic search traffic and user engagement, use the Organic Traffic Insights tool.(Before this step, we recommend connecting your Google Analytics and Google Search Console properties to Semrush. This simple step allows you to have all of your website data in one place.)In the dashboard, you’re able to track your average engagement time, engagement rate, and sessions. You can also track the number of keywords each page ranks for using both Semrush and Google Search Console data.Over time, these metrics will reveal insights to help you to adjust your content creation process and focus on what resonates with your audience. Tracking keyword rankings will also alert you when some of your articles are suffering from content decay (a steady decline in traffic and keyword rankings).Spotting dwindling rankings and organic traffic early on allows you to update content before it has a drastic impact on your website.Amplify Your Keyword Research with RedditReddit is a gold mine of great content ideas, but few people use it for keyword research. That’s great news for you. You’ll be able to find content ideas that stand out in a sea of generic blog posts. And your audience will actually want to read what you have to say.With a tool like Organic Research, you can cut back on manual digging and discover hundreds of valuable new keywords from your favorite subreddits in seconds.",
  "headers": [
    {
      "level": "H1",
      "text": "Reddit Keyword Research: Uncover Hidden SEO Opportunities"
    },
    {
      "level": "H2",
      "text": "What Is Reddit Keyword Research?"
    },
    {
      "level": "H2",
      "text": "Why Use Reddit for Keyword Research?"
    },
    {
      "level": "H2",
      "text": "How Does Reddit’s Search Functionality Work?"
    },
    {
      "level": "H3",
      "text": "1. Navigate to the Search Function"
    },
    {
      "level": "H3",
      "text": "2. Search for a Topic"
    },
    {
      "level": "H3",
      "text": "3. Analyze the Search Results"
    },
    {
      "level": "H2",
      "text": "How to Do Reddit Keyword Research"
    },
    {
      "level": "H3",
      "text": "Identify High-Performing Subreddits"
    },
    {
      "level": "H4",
      "text": "1. Search Specifically for Communities"
    },
    {
      "level": "H4",
      "text": "2. Explore Adjacent Subreddits"
    },
    {
      "level": "H4",
      "text": "3. Evaluate the Number of Comments and New Posts"
    },
    {
      "level": "H3",
      "text": "Mine Keyword Ideas from Reddit Threads and Comments"
    },
    {
      "level": "H3",
      "text": "Identify Posts and Comments with the Most Potential"
    },
    {
      "level": "H3",
      "text": "Analyze Terms with Keyword Research Tools"
    },
    {
      "level": "H3",
      "text": "Leverage Reddit Keyword Insights for Content Creation"
    },
    {
      "level": "H4",
      "text": "Ensuring Your Reddit-Sourced Keywords Rank"
    },
    {
      "level": "H2",
      "text": "4 Reddit Keyword Research Tools to Use for Better Results"
    },
    {
      "level": "H3",
      "text": "1. Organic Research"
    },
    {
      "level": "H3",
      "text": "2. Trend Analytics for Reddit"
    },
    {
      "level": "H3",
      "text": "3. Related Subreddits Finder"
    },
    {
      "level": "H3",
      "text": "4. Keyworddit"
    },
    {
      "level": "H2",
      "text": "Tracking and Refining Your Reddit Keyword Research Efforts"
    },
    {
      "level": "H2",
      "text": "Amplify Your Keyword Research with Reddit"
    }
  ],
  "author": ""
}