{
  "url": "https://www.semrush.com/blog/how-to-use-the-semrush-audience-insights-for-your-marketing-campaigns/?utm_source=blog&utm_medium=banner&utm_campaign=en_segmentation_strategy",
  "slug": "how-to-use-the-semrush-audience-insights-for-your-marketing-campaigns",
  "title": "How To Use the Semrush Audience Insights for Your Marketing Campaigns",
  "description": "The Audience Insights report provides information on how you can better connect with your potential customers and partners. You can use it to equip your presales, advertising, media-buying, and remarketing campaigns.",
  "content": "Are you sure you have a feel for your target online audience? Marketing itself is not rocket science, but consumer behavior sure can feel like it. Customers make choices based on many volatile factors, some of which are not at all obvious. You can’t predict their actions, but you can leverage consumer insights to optimize your marketing campaign in a timely way. Invaluable insights can come from examining website traffic data. What magazines do your target audience read? What alternatives do your loyal customers consider? Are they finding what they need on your website? You can answer these questions and many more with the help of the Semrush Audience Insights report. Below you'll find several scenarios in which Semrush Audience data leads to insights that could inform your strategic business decisions. The Value of Audience Insights Data 1. Gain Insights From the Least Evident Competitors 2. Broaden the Range of Partners for Collaboration 3. Review Your Media Partners 4. Estimate the Potential Reach of the Media 5. Compare Your Placements Against Those of Competitors 6. Find Your Customers’ Favorite Social Networks 7. Research Regional Markets 8. Define the Leader in a Niche 9. Don’t Rely On Professed Target Audiences (and existing press kits) 10. Monitor Market Position Dynamics Conclusion1. Gain Insights From the Least Evident CompetitorsPremium brands don’t usually compete with the mass market. Though your audience may not care that much about the market you identify with — they just want a polo shirt. As we see from the graphs below, a portion of visitors who went to the Ralph Lauren website are completely fine with taking a look at what H&M has to offer.Go down to the Audience Insights part of the report and filter it to find more apparel websites visited by Ralph Lauren’s and Lacoste’s audience. You’ll see that some of them wouldn’t mind shopping at department stores such as Nordstrom or Dillards. With this kind of search, you can pinpoint additional competitors or potential partners that may not be on your radar. 2. Broaden the Range of Partners for CollaborationSometimes, customers choose between product categories that have no direct connection at first glance. Sephora cosmetics, Pandora jewelry, Victoria’s Secret lingerie, and a Netflix subscription are not interchangeable in practical terms — yet all of them make great options for a holiday gift.Such overlap can point out possible partners for collaboration or co-marketing. While the overlap doesn’t necessarily imply a full-scale co-branding project, it might be the choice of prizes for a draw on social media. Apart from promotions for your own products, you might want to impress your audience with additional offers they might like. To understand if the prospective partner will accept your proposal, you can benchmark the volume of the unique and shared audience by hovering over the different segments of the chart. For example, Netflix shares 2.4m visitors with Sephora, but their unique audiences make 301.5M against 12.9M.Another way to find more relevant partnerships is going down to the Audience Insights section of the report and using the “shared” or “excluding” filters. For example, you can find the websites visited by both Sephora and Pandora customers and then keep only those that fall into relevant business categories.In the same way, the “Exclude” filter will help you find the websites visited by your competitors’ prospects but not yours. Simply type in your rivals’ URLs and exclude yourself from the search.With these filtering options, you can find more specific information that can lead to more informed decisions when it comes to possible partnerships. 3. Review Your Media PartnersLet’s say you are comparing several media platforms, and are considering two websites — both alike in reputation (and target audience). Should you consider both? Depending on how bold your brand policy is, you can try out some unconventional solutions based on audience insight. Imagine you’ve worked with business magazines in the past. Their readers definitely belong to your target group. However, showing ads to exactly the same users may not be in your best interests if your campaign's objective is reach. Check the media options that are usually excluded from your list. Consider several platforms that claim to have your target audience in their press kits but have little overlap.For example, you may discover that GQ website visitors have the same socio-demographic characteristics as your target group. Audience Overlap shows you that these relevant users likely haven’t been reached by your ads in other, more serious magazines. While a men’s fashion magazine may be unlikely to publish a long read about company development, a creative experiment with writing outside the box could help you get to the part of your target audience that has not been covered in previous marketing campaigns.You can also try out a placement in the media with the biggest share of the unique audience for the broadest reach (Wallstreet Journal) or one with which you share the most audience members (Newsweek). This can help you create an additional touchpoint with your potential customers.The Audience Insights “Shared” filter will help you find more media that fall into the same category as Forbes and WSJ and share most of the audience.4. Estimate the Potential Reach of the MediaYou can also compare audiences from your website and a media platform. The graphs will show you the number of users who have visited both. If your aim is to reach new people, consider working with the resource that you have the least Audience Overlap with. We have compared audiences of the official Gucci website and three fashion publications. Elle, is a more general women's magazine, while Vogue and Vanity Fair, tend to be more about ‘upper-class’ style. Gucci customers read Elle as well as Vanity Fair. Whatever the reason, consider this new data when planning your next placements.This approach also works for your GDN placements (Google Display Network ads), as you need to make sure the audience overlap between you and your prospective publisher is significant. 5. Compare Your Placements Against Those of Competitors You can also check how one of your rivals (we chose Prada and Armani) is presented in the same media.Gucci still has the greatest percentage of visitors who also read Elle online. However, if you observed the opposite picture for your competitor, check their traffic sources. This way you’ll find out if the paid placements prevail, and understand whether it makes sense to invest more in advertising on comparable media.6. Find Your Customers’ Favorite Social NetworksThe majority of today’s internet users spend a lot of time on social media. That’s why website owners look for suitable networks to promote their business accounts. To find such a network, check the overlap between your audience and each of the target social media platforms. The larger the overlap, the more users visit both your site and a particular social network during the selected month. Additionally, you can use this report to find which social networks your competitors’ audience prefers. Use this information to attract attention to your account with some engaging content or social media ads.7. Research Regional MarketsOwning an international brand is not necessarily a competitive advantage, especially in such a volatile industry as ecommerce. To develop the company in a specific geographical market, take a closer look at the locals. We’ll analyze ASOS. In the UK, this retailer competes with Amazon and eBay. In Russia, the situation is different; the company shares its target audience with local multi-branded online stores, Lamoda and Wildberries. Let’s see what consumer insights Audience Overlap can give us.As you can see, more customers of Lamoda visit Wildberries than ASOS, and more Wildberries customers visit Lamoda than ASOS. If we take a closer look at the numbers, 328k visitors from Lamoda and 581k visitors from Wildberries also visited ASOS. This means that, for ASOS, competing against Wildberries (analyzing their choice, delivery, and pricing model) could be almost twice as efficient as competing against Lamoda. You could use this customer insight as a sign to continue your market research in the field of positioning and communication strategies.8. Define the Leader in a NicheBeing too general is rarely a good plan, especially when one player already owns the majority of the market share within a particular niche. Let’s say you are developing the marketing strategy of a sports shoe brand. You know for sure there are companies that offer various types of clothing and one that specializes in sneakers. Will you have to compete with the industry leaders? Or will you manage to have more or less consistent competition within your niche? Let's see what Audience Overlap shows us with some popular brands. Nike has a significant overlap with almost any sports shoe seller you can think of. This means that the audience searching for Puma’s, Reebok’s, or New Balance’s footwear also considers buying Nike. As a product marketing or brand manager for an opposing brand, you might feel motivated to study their offers more closely, monitor their marketing campaigns, and evaluate some of their approaches.9. Don’t Rely On Professed Target Audiences (and existing press kits)If you are an owner of several websites (or the one responsible for their promotion on media platforms), you need valid data to present in your press kit. Let’s look at the example of Condé Nast Inc., which owns publications aimed at various target groups. You may assume that since Vogue, Glamour, and W Magazine are women’s magazines, all advertising activities on these sites should be targeted at that demographic. However, Audience Overlap shows a different picture.In reality, quite a few users also visit the Wired and GQ websites. Are these women interested in the lifestyle section of the men’s magazine? Possibly, they are helping their boyfriends to revamp their wardrobes. The graphs won’t tell you their specific intent, but they can give you valuable insights for future advertisers that you can include in your press kit.10. Monitor Market Position DynamicsWith Audience Overlap, you can see how your positions in the market change over time. Enter two competing domains and move from one time period tab to another to observe the trend. We studied how Covid-19 impacted audience trends between Walmart and Amazon, two major online retailers. First, we checked the percentage of users who visited both websites before the arrival of Covid-19 in the United States. Then we went on to the period where most US states were reporting widespread Covid transmission (April 2020). Along with a massive increase in visits to the Walmart and Amazon websites due to the increase in online shopping, we also noticed an increase in overlap percentage.In January 2020, 30.52% of users who visited Walmart's website, also visited Amazon. If we compare these numbers to April of 2020, just four months later, we discover that the number of Walmart site visitors also visiting Amazon increased by nearly 12%. The next step could be checking other competitors, revealing the one that welcomed the most significant part of your once-loyal audience, and taking the best from their development and communication strategies.You can compare Audience Overlap for several countries one by one to determine if a trend is global or country specific. It will give you an idea of whether you need to strengthen your campaign in a particular market or study the options deeply and revise your offers.ConclusionThe Audience Insights report provides a wealth of information on how you can better connect with your potential customers and partners. You can use it for competitive research, to equip your presales, advertising, media-buying, and remarketing campaigns, and to estimate the potential of a new market. Along with Audience Insights, the Traffic Analytics tool has much more to offer. From general traffic data for any website to its top pages and subdomains, and audience behavior metrics, the tool offers all of the traffic data you need in a single dashboard.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Use the Semrush Audience Insights for Your Marketing Campaigns"
    },
    {
      "level": "H2",
      "text": "1. Gain Insights From the Least Evident Competitors"
    },
    {
      "level": "H2",
      "text": "2. Broaden the Range of Partners for Collaboration"
    },
    {
      "level": "H2",
      "text": "3. Review Your Media Partners"
    },
    {
      "level": "H2",
      "text": "4. Estimate the Potential Reach of the Media"
    },
    {
      "level": "H2",
      "text": "5. Compare Your Placements Against Those of Competitors"
    },
    {
      "level": "H2",
      "text": "6. Find Your Customers’ Favorite Social Networks"
    },
    {
      "level": "H2",
      "text": "7. Research Regional Markets"
    },
    {
      "level": "H2",
      "text": "8. Define the Leader in a Niche"
    },
    {
      "level": "H2",
      "text": "9. Don’t Rely On Professed Target Audiences (and existing press kits)"
    },
    {
      "level": "H2",
      "text": "10. Monitor Market Position Dynamics"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H6",
      "text": "Most popular pages"
    },
    {
      "level": "H6",
      "text": "SEO Checklist: 41 Tips to Optimize Your Website"
    },
    {
      "level": "H6",
      "text": "How to Perform a Complete SEO Audit (in 14 Steps)"
    },
    {
      "level": "H6",
      "text": "A Beginner’s Guide to Keyword Search Volume"
    }
  ],
  "author": ""
}