{
  "url": "https://www.semrush.com/blog/how-to-measure-writing-quality-and-content-performance/",
  "slug": "how-to-measure-writing-quality-and-content-performance",
  "title": "The Ultimate Quality and Content Performance Checklist",
  "description": "Discover top-ranked ways to measure content quality & performance based on the findings from the State of Content Ops & Outsourcing Report.",
  "content": "Engaging content is high energy fuel for your inbound marketing machine. But how do you know if the cogs are turning properly? And what can you do to measure that impact and the quality of your content?Whether you’re new to content marketing or just ramping up your efforts, it’s important to set aside some time to maintain your content engine. You’ll need to review your work and determine how your target audience is responding to it.There are a dizzying number of marketing metrics out there. So let’s take a breath and simplify them. This guide will explore some of the most popular performance metrics — and show you how and why to use them.Top-Ranked Ways to Evaluate Writing QualityWhen people say they are looking for well-written articles or other content formats, what exactly do they mean? Isn’t good writing just a subjective thing? We don’t think it is. For the State of Content Ops & Outsourcing report 2021, we conducted over twenty video interviews with seasoned marketing experts. On top of this, we carried out a survey of 700 companies to understand the unskippable factors of quality writing. Here’s what they had to say:1. Does it cover the topic in-depth?When evaluating a piece of writing, it’s important to pay attention to whether or not it covers a topic comprehensively. This is the type of content that truly engages audiences. Does the content educate and inform those looking to answer a specific question? Or will they learn more about a topic?Sixty-one percent of marketers we surveyed said that reviewing the depth of the topic is crucial. Google also rewards pages that cover a topic more in-depth with top rankings.According to Michał Leszczyński, Head of Content and Partnerships at GetResponse, the easiest and quickest way to check content comprehensiveness is with an SEO optimization tool. The initial score from the tool will give you a first look at how well the writer understands the topic. You’ll also see if the content has the potential to appear for specific search queries. As you start to review more and more content, it will be fairly easy to tell whether a writer truly understands the topic or is just trying to hit a word count. Dasha Nazarova, Head of Marketing at RedTrack, points out that it’s also important to pay attention to the “emotional quality” of the content. “If I read it and it resonates with me, then it’s good quality,” she says.2. Is the grammar spotless?Content that is packed with language mistakes can look unprofessional. According to 54% of marketers we surveyed, grammar is the second-most important aspect when evaluating writing quality. “We pay attention to grammar, style, and the way writers approach the topic,” says Agata Krzysztofik from Piktochart. It's hard to argue with that approach. Grammar mistakes make it difficult for readers to understand your point. Worse, a poorly written article can even mislead people. 3. Does it showcase a native-level command of the language?Fifty-two percent of the marketers we surveyed ranked language competency as a top indicator of quality writing. “The content writers we work with are usually native speakers. Or they demonstrate a near-native language competency,” says Andrew Klubnikin, Content Lead at ITRex Group. There is an undeniably strong link between in-language content and a consumer’s likelihood of making a purchase. Seventy-two percent of consumers spend most or all of their time on websites in their own language. They also say they’re more likely to buy a product with information in their own language.It goes without saying that you should speak the language of your customers. 4. Is the tone of voice appropriate for your target audience?The tone of voice is another crucial writing quality factor. Forty-eight percent of the marketers we surveyed agreed. ​​Your company’s tone of voice represents your brand personality and values. This can include the words you choose and the order in which you put them. It also applies to all the content you create, whether for your website, social media, email, or any other channel.As Faruk Aydin, Head of Growth at iAge Technologies, explains it: I believe a writer is kind of a translation machine between me and the audience. I think a content writer is a kind of magic box. There is me, a hard block, a content writer, and then people who are looking for information.Faruk Aydin, Head of Growth at iAge TechnologiesUsing an appropriate tone of voice can help you connect with your audience. Perhaps more importantly, it can also make you stand out in an increasingly noisy world. 5. Does it provide practical value to readers?Finally, it’s important to evaluate the style of your writing. Does it provide practical value to your readers?“The first criteria is — do I read this piece to the end? Do I like it? And if I stop, that means there's something wrong,” says Anja Mutschler of 20blue agency. She believes the best way to attract people is by telling a story. She highlights the importance of a really good structure, using listicles, bullet points, and clear headlines for online texts. “As for the writing style, is the grammar good, does it have short sentences, does it have a good rhythm?”Quality writing answers questions. It addresses pain points and tells an interesting story. It focuses on providing value first and promoting your company second. The Most Important Metrics to Measure Content PerformanceNo matter how interesting or well-written your copy, the value it generates for your business is all that really matters.Having said that, content marketing can require a significant investment in time and resources. So, how can you evaluate whether your content was worth it? By measuring its performance. There are several content performance metrics out there. Let’s take a look at which ones the marketing experts we surveyed ranked as most important for content marketing success. 1. Organic trafficYou’ve probably heard that traffic is a vanity metric, but it’s still one of the main reasons why businesses use content marketing. Therefore, it remains a top metric to evaluate content performance. In fact, our survey results confirmed that organic traffic is still the number one performance metric with 69% of votes.Organic traffic will show you how many people found your website’s page through a search engine. A low figure may indicate that the page was not optimized properly. Or perhaps the search volume for the keywords in the content is too low.“We mostly focus on organic traffic,” says Alessandra Colaci of Mailshake. Her company focuses heavily on how they can dominate in their space for traffic. 2. Social traffic and social media engagementWhether or not content triggers reactions and comments on social media is the second-most popular performance metric, according to 47% of the marketers we surveyed.Evaluating traffic and seeing how people engage with your content on social media channels help you understand attitudes towards your brand. As well as tracking comments, likes, and shares, you can look at qualitative data. For example, how are you mentioned on social media and in what context? What kind of shares and comments are you getting? 3. Average Time on PageThe average Time on Page metric will help you understand whether visitors are carefully reading your content or just skimming it. If you discover people are spending a lot of time on certain pages, then it’s a good indicator it’s a top performer and that they find that content interesting and valuable. As Brooklin Nash of Sales Hacker points out, “High numbers of traffic are less important to me than how many people are engaging with our content once it's there.” He goes on to say that, “if people are spending some time on the article, and then converting to a community and engaging in the community because of that original article, that’s a success.”When analyzing your content, identify the best-performing and worst-performing pages. This exercise will give you insights into the ideal content format, length, and structure for future marketing campaigns. 4. Number of generated leadsAnother important factor in evaluating performance for any piece of content is the number of generated leads. In most cases, leads are potential clients. They are people who have shared personal details while engaging with your content. This is where gated content (such as ebooks, reports, white papers, webinars, and online courses) comes in handy and facilitates this information collection.When you have a high number of new leads, it indicates your target audience finds your content valuable. After all, people don’t usually give out their email addresses or other contact information for something they don’t need or find interesting. But it’s not enough to simply get new leads. Sometimes, you may already have existing leads, or people who have already engaged with your content and shared their contact details. You’ll want to keep these people engaged with other content on your website. By analyzing the number of existing leads who have interacted with your content, you can continuously improve your lead nurturing efforts along your content marketing funnel.5. Number of conversionsFinally, measuring and tracking organic conversion rate (either sales, leads, or both depending on your company’s structure) is another key way to measure content performance. In content marketing, a conversion is when a person engages with your content and performs a desired action. This could be making a purchase or simply filling out a form. Emilia Korczyńska from Userpilot admitted that her team used to track many factors. These include time on page, bounce rate, and sessions. However, they quickly became overwhelmed. “At the end of the day, we focused on two metrics that really moved the needle — number of conversions (CR also) and positions,” she says. If you’re going to use the number of conversions as an indicator for content performance, just remember to set a benchmark before you begin any campaign. Otherwise, it will be difficult to know if there’s been an increase. One way to do this is to take an average of conversions generated in the three months before your campaign began. Use this as a benchmark for measuring growth. You can then track conversions easily using tools like Google Analytics. Taking a more strategic approach to content creationIt's never too late to start honing your content strategy and understand exactly how it works for your business. If you invest a lot of resources in your content team, it’s crucial to set aside some time every month or quarter to review performance. Use the questions and metrics listed in this guide to help you. This extra effort will help you identify weak points in the writing process, fix issues, and evaluate whether your content still focuses on your audience's needs. Lastly, it’s important to remember that what works today in the world of content may not work tomorrow. Making adjustments should always be part of your content campaigns. When you evaluate your content on a regular basis, you can take note of what your audience is responding to and double down on those efforts more quickly. You can even go a step further and routinely check your competitors’ similar successful content for ideas to help improve your content performance. High-quality content has the power to create trust, build brand awareness, and turn people into customers and advocates of your brand, regardless of your industry. Make sure your content is making an impact by regularly evaluating its quality and performance.",
  "headers": [
    {
      "level": "H1",
      "text": "How Experts Measure Writing Quality & Content Performance"
    },
    {
      "level": "H2",
      "text": "Top-Ranked Ways to Evaluate Writing Quality"
    },
    {
      "level": "H3",
      "text": "1. Does it cover the topic in-depth?"
    },
    {
      "level": "H3",
      "text": "2. Is the grammar spotless?"
    },
    {
      "level": "H3",
      "text": "3. Does it showcase a native-level command of the language?"
    },
    {
      "level": "H3",
      "text": "4. Is the tone of voice appropriate for your target audience?"
    },
    {
      "level": "H3",
      "text": "5. Does it provide practical value to readers?"
    },
    {
      "level": "H2",
      "text": "The Most Important Metrics to Measure Content Performance"
    },
    {
      "level": "H3",
      "text": "1. Organic traffic"
    },
    {
      "level": "H3",
      "text": "2. Social traffic and social media engagement"
    },
    {
      "level": "H3",
      "text": "3. Average Time on Page"
    },
    {
      "level": "H3",
      "text": "4. Number of generated leads"
    },
    {
      "level": "H3",
      "text": "5. Number of conversions"
    },
    {
      "level": "H2",
      "text": "Taking a more strategic approach to content creation"
    },
    {
      "level": "H6",
      "text": "Most popular pages"
    },
    {
      "level": "H6",
      "text": "SEO Checklist: 41 Tips to Optimize Your Website"
    },
    {
      "level": "H6",
      "text": "How to Perform a Complete SEO Audit (in 14 Steps)"
    },
    {
      "level": "H6",
      "text": "A Beginner’s Guide to Keyword Search Volume"
    }
  ],
  "author": ""
}