{
  "url": "https://www.semrush.com/blog/how-to-plan-ppc-campaign/",
  "slug": "how-to-plan-ppc-campaign",
  "title": "What Is a PPC Campaign? The Complete Guide for Beginners",
  "description": "PPC campaigns involve you paying each time a user clicks your ad. Find out how to set one up.",
  "content": "Pay-per-click (PPC) campaigns deliver quick and easily measurable results.But how do you put together a PPC campaign? And where can you run those ads?You’re about to find outBut let’s start with the basics.TipThis guide is easier to follow along with if you have a Semrush account. And you can register for free (no credit card required).What Is a PPC Campaign?A PPC campaign is an advertising campaign that’s part of a digital marketing model where a company pays a fee each time a user clicks on the ad. And that fee is referred to as the cost per click (CPC)—which is determined through an ad auction.PPC campaigns allow companies to advertise to enormous user bases on various platforms.For example, here’s a PPC search ad on Google for the term “kitchen supplies”:And here’s a Reddit PPC ad:Benefits of PPC CampaignsHere are the primary advantages of PPC campaigns:PPC Campaigns Drive Results QuicklyYou can get a campaign running within a day as long as you have creative assets, copy, and a budget at the ready. And most of the waiting time is for the platform to approve your ads.Once approved, your ads will start showing to the audience you defined (more on that later). And will likely start generating results. When it comes to PPC vs. SEO, the latter can also drive impressive results. But that can take many months given the time it takes for rankings and traffic to increase. Which you can see in the chart below outlining organic (unpaid) traffic to semrush.com.PPC Campaigns Have Precise TargetingYou can be incredibly specific about the audience you want to show your ads to. Which improves the likelihood that they’ll be interested in your offerings and helps maximize your return on investment (ROI).It’s possible to narrow down your audience based on geographic location, interests, and more.Consider how that compares to content marketing. You can write content intended for a specific audience, but you don’t have full control over who sees it.PPC Campaigns AreEasy to MeasureEvery platform that includes PPC ads provides data about your campaign. To give you insights into what is and isn’t effective. You can review impressions, clicks, the click-through rate (CTR), conversions, conversion rate, CPC, and more.You can also use the available metrics to calculate your return on ad spend (ROAS). Which measures how much revenue you generated from every dollar spent on advertising.Plus, you can easily turn off an underperforming ad set or modify its features to make it more effective.And you can begin discovering trends and optimal tactics for future campaigns once you gain some preliminary data.PPC Campaigns Are CustomizablePPC campaigns let you select the copy, creative assets (when applicable), keywords (when applicable), audience, placements, and much more. Most of the limitations are easy to work with: using the appropriate image sizes, staying within character counts (like the image below from Meta Ads Manager shows), and avoiding anything that could be seen as potentially harmful.You can also always go back and tweak campaigns, ad sets, or ads themselves if you need to.Key Components of a PPC CampaignEach platform envisions the structure of PPC campaigns slightly differently, but there are always a few key components.PPC Objectives and Ad SetsPPC campaigns have overarching objectives, ad sets (groups of related ads), and individual ads. And some ads also incorporate keywordsYou can envision the structure of a campaign that uses keywords like this:Each campaign is composed of one or more ad sets aimed at achieving the overarching objective.For example, a SaaS company may have a different campaign for each of the products or services they sell.Each ad set within a campaign will follow the goal set forth by the campaign objective. And will have one or more ads with different creative assets, targeting, and budget options. NoteIn some platforms, you can set a budget for the entire campaign and allocate parts of it to each ad set.Finally, each ad within an ad set will have its own creative, copy, and call to action (CTA).PPC Ad ContentAd copy and creative differ by platform and ad type. For example, you may be able to use GIFs or videos instead of static images. Or more or fewer characters for headlines and descriptions. Ad copy is the simplest to understand—you have to give your ads some text that will be displayed. Well-crafted ad copy can heavily influence CTR. Because it’s one of the two primary ways to let users know what you’re advertising.The other foundational part is the creative (but not for search ads, which are text only). Images, videos, and GIFs are used to entice users to click on the ad.Another component is ad assets (previously called ad extensions) for search ads. And they can be quite valuable. Assets provide additional information. Like location, additional sitelinks, prices, and much more.NoteUsing ad assets is generally a good practice. They don’t cost you anything extra, take up more visual space (making your ad more noticeable), and provide valuable information to the user.Targeting OptionsThere are a number of ways to target just the right audience based on the platform you’re using. To ensure you reach the right people.Most social media platforms let you select demographic, behavioral, and psychographic data to narrow down who sees your advertisements.Here’s what it looks like in Meta Ads Manager:Search engines like Bing and Google combine audience and keyword targeting. So, your ads will appear whenever someone from your targeted group searches for certain keywords.Budget and Bidding OptionsYou’ll have budget and bidding options. The former will generally be split either into a daily or lifetime budget.Restricting yourself to a daily budget only will spend a set amount of money per day. While restricting yourself to a lifetime budget will spend varying amounts per day until the budget is spent.Using both may also be possible. Which will make the campaign spend up to the daily amount until the amount set in the lifetime budget is exhausted.Here’s what the budget setup looks like for Reddit ads:Most platforms use a bidding process to determine what ads to show users. Meaning there will be several competing ads, and the one with the highest bid (that meets any other criteria) gets shown more often than others.If your ad gets shown, you could pay up to the bid amount (or a bit more on Reddit) whenever a user clicks on your ad.Higher competition means you’ll usually need to bid higher. And note that you can usually modify your bid amount, setting the maximum allowed bid. Which is the maximum amount you want to pay for a click.If you’re new to PPC campaign management, consider keeping the default bid settings. Most platforms have solid algorithms that are capable of optimizing bidding strategies without your intervention.Manual bidding can be successful, but you need to do a lot of research to understand how to optimize your PPC campaigns.How to Prepare for a PPC CampaignYou have to take a few preliminary steps before beginning to set up a PPC campaign. Here’s what to do.Review Your Competitor’s PPC CampaignsConducting a competitive analysis is a great way to gain inspiration for your campaign. Because it helps you learn what’s worked for your rivals.You can do this for search ads using Semrush’s Advertising Research tool. Enter a competitor’s domain into the search bar. And click “Search.”The “Positions” tab will show first.You’ll be able to see how many keywords they’re bidding on, their estimated paid traffic, and the cost of that traffic.Now, look at the “Paid Search Positions” table to find the exact keywords your competitor is bidding. And see related data.Next, go to the “Ads Copies” tab.This report will show you the exact copy your competitor used in their search ads for the selected time range. And which keywords they’re bidding on.Don’t be afraid to take inspiration from these.Finally, visit the “Pages” tab to find all of the landing pages your competitors are driving to from their PPC campaigns.Find Your AudienceAudience research will help you narrow down to a distinct market segment. To improve your overall results.Semrush’s One2Target lets you uncover the demographic, socioeconomic, and psychographic audience for your target audience.Open the tool, make sure “Check Competitors” is selected, input up to five competitors’ URLs, and click “Analyze.”The “Demographics” report will appear. And give you a breakdown of the audience’s age, country, and more.Now, let’s click on “Socioeconomics.” You’ll see the audience’s household income and size, employment status, and education level.Finally, go to the “Behavior” tab to get data on interests, social media usage, and device type.All this information can help you better understand who you’re speaking to. And what type of messaging will resonate with them. Step-by-Step Guide to Launching a PPC CampaignFollow along to learn how to set up a search campaign in Google Ads. Each platform will have a slightly different set of steps, but the overarching process will be the same.1. Select Your GoalAlmost all platforms will have a campaign objective (or goal). In Google Ads, your options are: sales, leads, website traffic, awareness and consideration, app promotion, local store visits and promotions, and an option to customize your own goal.Selecting an objective will influence the bidding structure and how and when your ad is shown. Luckily, it’s quite easy to decide which objective is best. Here’s how: Pick sales or leads if you intend to make sales Pick traffic, awareness and consideration, or local visits if you want to increase brand awareness Pick app installs if you want to drive more users to your app2. Conduct Keyword ResearchKeywords are essential for search campaigns. Because they define the cases when users will see your ads (along with targeting).For example, a user who searches for “wooden watch” may see your ad if you’re bidding on that keyword.You can find some keywords by using Keyword Gap to analyze yourself against your competitors. Enter your domain and up to four competitors’ domains. Then, make sure to select “Paid Keywords” from the drop-down menus and click “Compare.”Once you see the report, scroll down to the table. Then, make sure your domain is displayed next to “All keyword details for:” and select the “Missing” tab.You’ll now see a list of keywords that all your competitors have paid rankings for but you don’t. You can also see the monthly search volumes for those keywords, your competitors’ paid rankings, and the average CPC advertisers pay for each keyword. From this list, identify relevant options you want to focus on for your PPC campaign. You can use the Semrush’s Keyword Magic Tool to find further options. Input one of the keywords you want to bid on based on the terms you discovered during your gap analysis. Then, click “Search.”You’ll then get a list of similar keywords. Click the gear icon at the top of the table and select the checkbox next to “Competitive Density” to add it to the table. Review this metric as well as CPC when considering keywords. Finally, take a look at the “Intent” column. Here’s a rundown of the main intent categories and which types of campaigns they’re best for: Informational (I): Means a user is looking for information. This can be good for awareness or traffic goals. Navigational (N): Means a user is looking for an exact webpage or brand. This can be used to bid on branded keywords (e.g., “slack integration” if your company has a Slack integration). Commercial (C): Means a user is investigating options or brands. This can be good for both sales and lead campaigns. Transactional (T): Means a user is looking to make a purchase. This is best for leads, sales, and app installs.Filter based on the intent that best aligns with your goal to get a good starting list for your PPC campaign.3. Choose Your Bidding StrategyNext, you’ll need to choose your bidding strategy.You can either add your maximum CPC limit now or at the keyword level.If you’re new to PPC campaigns and aren’t sure about the appropriate maximum CPC, review the averages you saw during your keyword research. 4. Select Your Campaign SettingsEach search campaign includes a variety of audience targeting options to narrow down the audience based on the research you conducted.Google Ads lets you target specific locations, languages, and audience segments (e.g, interests, demographics, etc).Keep in mind that you can set up ad sets for each campaign. They’re basically collections of ads that are each a bit different.5. Enter Your Keywords and Write Compelling Ad CopyCopy is the only thing incentivizing users to click on your search ad. So, it needs to be good and also incorporate your target keywords.Start by entering the keywords you selected during research.Next, write your copy in the space provided.Keep in mind what you learned based on the copy your competitors are using as well as the keywords Google Ads recommends using. But experiment on your own as well.Many companies will put their unique selling propositions (USPs) in the title to make themselves stand out. For example, you might include stand-out selling points like “natural materials,” and “craftsmanship” in your headlines if you’re creating ads promoting your watches.Make sure your descriptions always include a CTA like “buy,” “get,” “try,” “discover,” etc. And don’t be afraid to include sentence fragments or omit words to remain within character limits.You can also experiment with writing out numbers in different ways (“1K” vs. “1,000” vs. “1 000”). And including or excluding your brand name. Don’t forget about including ad assets, either.You get more visual real estate and often a clearer CTA for the user.Pro tipGoogle Ads lets you input multiple headlines and descriptions. The platform will then mix them up to find the best possible option.5. Optimize Your Landing PageYour PPC campaign’s ads will have to point to a landing page. And it should clearly match the keyword intent and offer a great user experience.Let’s say you’re in software sales. Focus on clearly showing the product in the landing page hero space, including a clear purchase button, and incorporating descriptions that are easy to understand.If you listed various USPs in your ad copy, make sure they’re represented on the landing page as well. Like this page:Adding reviews, testimonials, and other social proof can also work well. Because those elements help build trust.But avoid including anything that can slow down the page load time. So you don’t negatively impact the user experience.Finally, make navigating the page as simple as possible. By avoiding too many links or buttons that lead to other pages.6. Set Your BudgetYou assign your daily budget in Google Ads in the final step by making a simple selection. Which is then used to pay for the clicks.Google will give you three recommended options. And a custom budget option where you can assign a daily budget of any size.You’ll also get an estimation of the weekly number of clicks, average CPC, and the weekly cost.NoteYour actual spend may vary each day. Because Google uses a monthly basis, your maximum spend over the course of a month won’t be more than your daily budget times the number of days.7. Monitor and Optimize Your CampaignsYou can make tweaks to PPC campaigns while they’re live to get better results. Which is often a good idea.But you first need to understand what good performance is. Which is challenging if you’ve never run a search campaign before. So, start by looking at industry benchmarks for PPC campaigns to get a good idea on what results can be considered good.Once you’ve run a few campaigns, you can then look at them for benchmarks.Then, look at the data in Google Ads. And pay attention to these key metrics: CTR Conversion rate Impressions Clicks CPCIt’s also a good idea to supplement this information with external data. Which you can do with Semrush’s Position Tracking tool:Open the tool, enter your domain, and click “Set up tracking.”Follow the Position Tracking configuration guide to complete all the steps in the setup wizard. And make sure to add all the keywords you’re targeting with your PPC ads.Then, click “Start Tracking.”Once the tool is set up, you’ll see the “Landscape” tab. Click the gear icon in the upper right corner and select the circle next to “Google Ads” under “Type.”You’ll now see high-level information about your paid keyword rankings and how they’ve changed.Head to the “Overview” tab for a more detailed look at all your paid search rankings.Next, go to the “Competitors Discovery” tab to see who your closest competitors are. And how you compare.The Position Tracking tool also alerts you about any sudden, large changes.If you notice something you want to improve based on your position changes or your data from within Google Ads, you can adjust either your ads or your landing page. For example, let’s say you have lots of impressions and a good CTR but a low number of sales or conversions. That could indicate something is wrong with the landing page.So, try experimenting with the landing page copy, images, and CTAs.Or perhaps you’re getting few impressions and have a bad CTR, but you’re getting a decent number of sales or conversions considering that. This indicates that you may need to adjust the ads themselves.In this case, you can modify your ads by testing different USPs, appealing to a particular pain point, or even adjusting your keywords. PPC Advertising PlatformsGoogle Ads isn’t the only platform for PPC ads. Here’s a quick rundown of the options:Google AdsGoogle Ads makes it possible to reach nearly any audience. And offers numerous targeting options.But there’s a lot of competition compared to other platforms. And it may be harder (or more expensive) to compete for certain keywords.Google Ads also separates itself into the Search Network (Search, Maps, Shopping, etc.) and the Display Network (YouTube, Gmail, Blogger, etc.). YouTube AdsYouTube offers various video ad formats for different business needs. And includes similar targeting options as Google Ads.Here are a few of the choices: Skippable in-stream video ads that play before, during, or after any video the targeted audience is viewing. And can be skipped after five seconds. Unskippable in-stream video ads that play before, during, or after any video and cannot be skipped. But are 30 seconds or less. In-feed video ads are video ads that appear in YouTube search results, on YouTube’s mobile homepage, and alongside related videosYou can also run text and image ads on YouTube. Which appear at the bottom of the video player.Pro tipMany YouTube users listen to videos instead of watching them. Including voice-overs in your video ads can help you reach that part of the audience as well.Bing Ads (Microsoft Advertising)Running ads on Bing and Microsoft Advertising partner sites gives you similar targeting options and features as Google Ads.But there are unique features like LinkedIn profile targeting and image extensions (which gives search ads visual appeal). And it allows you to import campaigns from Google Ads.Here’s what a Bing ad looks like:Bing Ads may also be less competitive than Google Ads. Which can help you spend less on PPC campaigns.LinkedIn AdsLinkedIn Ads enables you to easily target industry professionals and businesses.Here’s what a LinkedIn ad looks like:This platform includes unique targeting options like job titles, company names, industries and sectors, and more.And there’s even a type of ad that lets you send direct messages to users without having a connection to them.Reddit AdsReddit lets you target its subreddits. Which are created for enthusiasts of specific topics like gaming, food, etc.And they look like this:Most of its targeting features are similar to those on Google Ads, but they’re not as extensive. Which is understandable. Because the main draw are subreddits.You also get to choose from multiple creative formats like images, GIFs, videos, and even text-only ads.Meta AdsMeta Ads combines advertising on Facebook, Instagram, and Messenger into one platform. One of the great things about Meta Ads is that you have the ability to reach diverse audiences.It also provides a complete array of demographic, geographic, and psychographic targeting options. And you get a high variety of creative asset options—GIFs, videos, images, etc.Turn PPC Campaigns Into a Long-Term PPC StrategySetting up a single PPC campaign and managing it is just the start. You’ll want to run more in the future. Once you do, you’ll want to perform a PPC audit every once in a while. To find ways to improve performance and better manage your budgets.And you can drive even better results with our advertising tools like Advertising Research and Position Tracking. Try them today by signing up for an account.",
  "headers": [
    {
      "level": "H1",
      "text": "What Is a PPC Campaign? The Complete Guide for Beginners"
    },
    {
      "level": "H2",
      "text": "What Is a PPC Campaign?"
    },
    {
      "level": "H3",
      "text": "Benefits of PPC Campaigns"
    },
    {
      "level": "H4",
      "text": "PPC Campaigns Drive Results Quickly"
    },
    {
      "level": "H4",
      "text": "PPC Campaigns Have Precise Targeting"
    },
    {
      "level": "H4",
      "text": "PPC Campaigns AreEasy to Measure"
    },
    {
      "level": "H4",
      "text": "PPC Campaigns Are Customizable"
    },
    {
      "level": "H2",
      "text": "Key Components of a PPC Campaign"
    },
    {
      "level": "H3",
      "text": "PPC Objectives and Ad Sets"
    },
    {
      "level": "H3",
      "text": "PPC Ad Content"
    },
    {
      "level": "H3",
      "text": "Targeting Options"
    },
    {
      "level": "H3",
      "text": "Budget and Bidding Options"
    },
    {
      "level": "H2",
      "text": "How to Prepare for a PPC Campaign"
    },
    {
      "level": "H3",
      "text": "Review Your Competitor’s PPC Campaigns"
    },
    {
      "level": "H3",
      "text": "Find Your Audience"
    },
    {
      "level": "H2",
      "text": "Step-by-Step Guide to Launching a PPC Campaign"
    },
    {
      "level": "H3",
      "text": "1. Select Your Goal"
    },
    {
      "level": "H3",
      "text": "2. Conduct Keyword Research"
    },
    {
      "level": "H3",
      "text": "3. Choose Your Bidding Strategy"
    },
    {
      "level": "H3",
      "text": "4. Select Your Campaign Settings"
    },
    {
      "level": "H3",
      "text": "5. Enter Your Keywords and Write Compelling Ad Copy"
    },
    {
      "level": "H3",
      "text": "5. Optimize Your Landing Page"
    },
    {
      "level": "H3",
      "text": "6. Set Your Budget"
    },
    {
      "level": "H3",
      "text": "7. Monitor and Optimize Your Campaigns"
    },
    {
      "level": "H2",
      "text": "PPC Advertising Platforms"
    },
    {
      "level": "H3",
      "text": "Google Ads"
    },
    {
      "level": "H3",
      "text": "YouTube Ads"
    },
    {
      "level": "H3",
      "text": "Bing Ads (Microsoft Advertising)"
    },
    {
      "level": "H3",
      "text": "LinkedIn Ads"
    },
    {
      "level": "H3",
      "text": "Reddit Ads"
    },
    {
      "level": "H3",
      "text": "Meta Ads"
    },
    {
      "level": "H2",
      "text": "Turn PPC Campaigns Into a Long-Term PPC Strategy"
    }
  ],
  "author": ""
}