{
  "url": "https://www.semrush.com/blog/how-to-develop-your-international-seo-strategy/",
  "slug": "how-to-develop-your-international-seo-strategy",
  "title": "How To Develop Your International SEO Strategy",
  "description": "Ready to take your business to the next level? Time for your brand to reach a global audience? Read our ultimate international SEO strategy guide and take on our expert and in-depth tips.",
  "content": "Editor's Note: This is an update of the article originally published on January 20th, 2016. Your company has been growing and growing, and at some point you’ve decided to go global. You’ve defined your overall business strategy, you know which countries you are targeting and who you will be competing against in the new markets. Your next logical step would be to evaluate your SEO opportunities in your target locations and think about how your digital presence should be organized. In this how-to-guide, we will show you how to plan your digital globalization with the help of SEMrush and other marketing tools. As an example, we will look at the case of a Canadian retailer who is nurturing plans to open a chain of department stores in the Netherlands. The strategy can be divided into 5 steps: Estimate your potential in your target countries Analyze the competitive landscape Conduct an international keyword research Localize your brand Decide on the main technical aspects Estimate your potential in your target countries Solutions: Google Analytics, SEMrush Domain Analytics Start with estimating your international SEO potential by finding out how your website is ranked in your target countries (for example, the Netherlands). In your Google Analytics account, go to Audience → Geo → Language or Location. You will see the number of sessions from that particular country: Then let's dig a bit deeper to see exactly which keywords your website is ranking for in your target countries. Use SEMrush Domain Analytics to generate an Overview report for your domain. Type in your domain, select your target database and click ‘Search’. Take a look at the organic search report showing the number of keywords you are ranking for in the top 100 organic search results, as well as estimates of monthly traffic to your domain. You may find that your domain isn't ranked in your target countries for any keywords. In this case, you can type in the domain of your local competitor and carry on with the analysis: On the doughnut chart in the left bottom corner of the report, click the slice you want to analyze for a more detailed view. In our case, it is the brown slice, which represents the Netherlands. Here’s the list of keywords we got: Take a look at the keywords to see if they are relevant to your industry, and evaluate their search volume (1). In the example above, we see that the domain is already ranked in Google.nl for many brand keywords (like 'mac lipstick') with a good search volume. It means that it definitely has the potential to get higher rankings and more traffic once the local version is launched. As a result, you’ll be able to establish if you already have organic traffic coming from your target countries (with GA), along with the relevance of this traffic towards your goals (with the Organic Search Positions report by SEMrush). Analyze the competitive landscape Solution: SEMrush Organic Competitors report Regardless of the scale of your website’s international potential, you must know who you are fighting against in the new digital market. You will probably already know your most bitter competitors in that country. However, this doesn’t necessarily mean that they are as successful in terms of their digital presence. We, on the other hand, will focus on your organic competitors. Use SEMrush Organic Competitors report to run a quick analysis of your competitors in the locations you are targeting. Under the same Domain Analytics tab, go to Organic Research → Competitors. Choose the relevant language database. You will get the following report: You should pay special attention to the bubbles situated above you and to your right. They represent those competitors whose total traffic exceeds yours and who are ranking for a greater number of keywords than you are. Once you’ve figured out which of your competitors to look up to in terms of digital achievements, move on to exploring the best keywords to borrow from them. Conduct an international keyword research Solution: SEMrush Domain vs. Domain report You’ve identified your primary competitors, so it’s time to determine which keywords they are indexed for in your target countries and to select the best ones to use for your SEO. The table below the bubble graph shows your organic competitors: We’re now going to use the Domain vs. Domain tool which allows you to compare yourself against your competitors’ domains in terms of common and unique keywords. To do that, find your most important competitors (as defined in the previous step) in the list and click on the number of keywords in the “Common Keywords” column. You will be redirected to the ‘Domain vs. Domain’ report: Switch to ‘Advanced mode’. Next, define your comparison parameters as ‘Unique to the first domain’s keywords’, because at this stage, we’re primarily interested in those keywords for which your competitor is ranking, but you aren’t. Make sure your competitor’s domain is typed in first: You will be given a list of keywords for which your competitor is getting traffic, unlike you. Before you decide to pinch some of these keywords, you should identify the search terms with a high search volume and low difficulty level - in other words, those that are more likely to bring your traffic. To do that, set up advanced filters. A good start will be including keywords with search volume greater than 500 and excluding those with the keyword difficulty level greater than 60. Click ‘Apply’ (1). You can then select the keywords you would like to borrow (2) by ticking the box to the left of each keyword and exporting them to an Excel or CSV file (3): Explore several competitors in the same way to get a whole bunch of keywords to enrich your content with. Use them in product descriptions, news, blog articles and any other content pieces. There are several other options for finding keywords to use in your content. For instance, consider using the SEO Keyword Magic Tool to find long-tail matches and related keywords in your target language. The tool will be also great for tracking your keywords' performance once your website is up and running. Localize your brand You’ve gathered valuable keywords, and now it's time to start creating content in the local language. However, it wouldn’t be enough to simply translate the original texts and stuff them with keywords. What works for Sweden can be completely irrelevant for Russia. On the other hand, there are certain types of content, like technical descriptions, where you have to be precise and explicit. To get your ducks in a row regarding translation, localization of technical sheets, banners, terms of use and other content, read this exhaustive article by Martin Kura ‘ Web Localization Strategy: How to Localize Content Like a Marketer’. It will help you define the right workflow for every type of content on your website. Consider special local aspects as well. For example, you need to be careful with the forms of ‘you’: in Germany, Italy, Spain and many other countries you should use the polite form of ‘you’ when talking to someone you don’t know. Also, keep in mind that, for example, Germans are much stricter in the use of formal ‘you’ than Italians. To help you gain some insights into important nuances that only locals know about, we asked 32 experts from all over the world (literally: from Japan to Brazil) to share their best practices in the article ‘ How to Localize Your Global Brand’. There you’ll certainly find many useful tips on how to build a successful SEO strategy in different countries. Decide on the main technical aspects Last but not least, you need to handle the technical side of your international SEO. The main aspects you will have to consider include: Choosing the right structure for your website Deciding on the server’s location Ensuring the correct hreflang implementation Website structure Before you decide on the structure for your website, define your goal: are you targeting a language or a country? If you are going to target countries that share a language, use the language targeting approach. If you’re targeting a specific audience/country, then country targeting is your best choice. Our retailer, for example, is targeting the Netherlands, so in this case country targeting would be an ideal tactic. Next, choose your international site structure based on your targeting. There’s a lot of debate around what to use for better SEO results: country code top-level domains, subdomains or a subfolders. To learn more about the pros and cons of each site structure, check out this article on How to Choose the Right International SEO Site Structure, or take a look at this chart: Local Hostings The server’s location has a significant influence on your rankings. The more distant the server, the slower the site speed, the worse the user experience. Find out what web hosting solution works best for your international website in this article: International Web Hosting Issues: Does Server Location Really Matter? Martin Kura explains why server location is important for search engines and analyzes the way IKEA, Lush and Google went about it. Hreflang implementation International SEO done right means that your users in each target country or targeted language are coming to the right country or language version of your site. Hreflang annotations play an important role in this process as they are meant to cross-reference pages that are similar in content, but target different audiences. Incorrect hreflang implementation can seriously harm your rankings and the overall user experience. To generate hreflang tags easily and quickly, you can use the Hreflang Tags Generator Tool by Aleyda Solis. After this, whenever you want to check and fix the issues with hreflang tags that you’ve already implemented on your website, use the SEMrush International SEO report. Conclusion You have evaluated your SEO potential in your target countries, analyzed your competitive landscape, pulled together a list of most profitable keywords for your international SEO and even thought through the technical aspects of developing an internationally targeted website. Now get yourself out to the international SEO battlefield and good luck! Once your international website is up and running, assess its performance with the right set of tools as described in this SEMrush solution guide on how to do international SEO.",
  "headers": [
    {
      "level": "H1",
      "text": "How To Develop Your International SEO Strategy"
    },
    {
      "level": "H2",
      "text": "Estimate your potential in your target countries"
    },
    {
      "level": "H2",
      "text": "Analyze the competitive landscape"
    },
    {
      "level": "H2",
      "text": "Conduct an international keyword research"
    },
    {
      "level": "H2",
      "text": "Localize your brand"
    },
    {
      "level": "H2",
      "text": "Decide on the main technical aspects"
    },
    {
      "level": "H3",
      "text": "Website structure"
    },
    {
      "level": "H3",
      "text": "Local Hostings"
    },
    {
      "level": "H3",
      "text": "Hreflang implementation"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H6",
      "text": "Most popular pages"
    },
    {
      "level": "H6",
      "text": "SEO Checklist: 41 Tips to Optimize Your Website"
    },
    {
      "level": "H6",
      "text": "How to Perform a Complete SEO Audit (in 14 Steps)"
    },
    {
      "level": "H6",
      "text": "A Beginner’s Guide to Keyword Search Volume"
    }
  ],
  "author": ""
}