{
  "url": "https://www.semrush.com/blog/how-to-create-e-commerce-facebook-ads-strategy-case-study/",
  "slug": "how-to-create-e-commerce-facebook-ads-strategy-case-study",
  "title": "How To Create a Facebook Ads Strategy for an Ecommerce",
  "description": "If you want to earn money on your ecommerce you have to create a successful Facebook Ads Strategy: read the ecommerce Case Study and discover how to earn money from Facebook Ads.",
  "content": "3 Ways to Create Your Facebook Ads Strategy for An e-Commerce Site People are on Facebook to chat with friends, to see friend's photos, to meet old friends and so on. You can’t immediately start selling your products or services to people who don’t know you. They have to understand who you are, what you can offer them, why they need you, and why they have to buy from you instead of your competitors. You have to earn their trust. To begin the trust process, I often create a Facebook Ads strategy for my clients based on 3 different phases: Brand Awareness Engagement Conversion Brand Awareness Campaigns In the first phase, Brand Awareness, our goal is to make people connect with the brand/product/service. Once they know the brand, they will know who the company is, what they can buy from them, what its standards are, and the benefits of investing in their a product or service. The first campaign is focused on growing the page to increase the number of targeted fans. By “targeted”, I mean people who are really interested in investing in a related product or service. I usually use a corporate or product image for this kind of campaign with copy that shows the values and the corporate features of the brand or the Company. People that see the ad are more prone to think “Wow, why haven’t I heard about this brand before?” Engagement Campaigns In the second phase, Engagement, my goal is to establish a relationship with the fans of the page. The goal is to receive likes, comments, shares, and maybe questions about how to buy the product or the service. In an engagement campaign, I usually use a video that immediately highlights the benefits, the advantages and/or the main strengths of a product or a service. Below is an example of an Italian e-commerce store that sells \"Made in Italy\" oil (sorry; copy is in Italian): Figure 2: A campaign video Let’s see the performances of this campaign: Timing: Campaign was live from November 5th to 10th. Budget: 50 euros (so less than 10 euros per day). Goal: At least 20,000 people to reach, and more than 50 engagement keys (likes, comments, shares). Results: 40,315 people reached, 69 likes and 22 shares + direct messages to know how to buy the oil. As you can see in 5 days with 50 euros, we reached brilliant results. Campaigns for Conversions The third phase, Conversion, is focused on selling the products to people who already know this product because they are a fan of the page or have visited the e-commerce site several times before deciding to buy (retargeting). For this kind of campaign, I use the carousel to show more products at a glance or a customized image with products I have to sell. Facebook Ads are extremely powerful for commerce that promotes a special offer or discount (in my experience, the discount has to be strong; for instance, 50%) or free shipping. How a Beauty e-Commerce Earned 11.875 Euros in 5 Days with Facebook Ads Here is a brief case study of a beauty e-commerce that sells hair products. Let's look at the results during a Black Friday promotion! Timing: from November, 21th to 25th. Budget: 1.300 euros. Results: 166 purchases. Cost per result: 7.83. Purchases Conversion Value: 11.875 euros These results are amazing: I spent 1.300 euros, and I earned 11.875 euros in 5 days. This is the ad: Figure 3: A successful ad campaign Let’s Analyze the Campaign Starting From the Structure 1. I chose a “Conversions” campaign since my goal was selling products (not traffic to website or engagement). 2. I tracked “Purchase” ad event. Figure 4: Purchase conversion 3. Audience. I used retargeting: People who visited the website in the last 60 days. People who made a purchase on the website in the last 60 days. People who added to cart products in the last 60 days. Email leads of customers of the last 3 months. Lookalike. I also targeted my audience for interests (I chose hair brand names and beauty interests). Location: Italy. Age: 24-55 years, only women. 4. Platforms: I chose only Facebook feeds, Instagram feed and Audience Network. 5. Copy: It was very minimal, clear and it focused on keywords such as “Black Friday”, “capelli” (= hair), “bellezza” (= beauty), “SCONTO” (= sale). The sale amount is clearly expressed: 50%. Also, the title highlights the percentage of discount. The copy was brief, and it was easy to read: focus only on the discount — no more information. In this case, the copy was very short; in other cases, you can try a longer copy. Research Tip I suggest you use the Topic Research tool from SEMrush to find ideas for keywords your customers use; it is so important to use the same language that your users do in your marketing — including on Facebook. Figure 5: Topic Research - SEMrush With data from the Topic Research tool, you will have an idea of which copy/keywords to use for your ad. You can find your creative inspiration will providing the information your target audience is looking for. 6. Image: I used a collage of real products (not an image you can find on a stock image website), and the consumer attention is pulled to the middle by a big circle that shows the huge discount. 7. Call-to-Action: I used “Shop Now”. You have to choose a call-to-action according to what you ask your customer to do. Get straight to the point. Conclusion I explained these three steps process for Black Friday promotion, but you can adopt it throughout the year. If you decide to promote your business on Facebook, you have to advertise on it not only during strong promotion days (such as Black Friday or Christmas sales) but also throughout several months of the year. In this case, I recommend you to think about a strategy that could bring you real interested customers. I have already said that you have to earn people trust before trying to sell them your products or services, so I suggest that you create some ads throughout the year with different goals: 1. Start From a Like campaign to get fans interested in your brand (Facebook Audience Insights can help you a lot); you have to add real targeted fans to your page. This kind of campaign should run almost 15 days per month. I have seen in my experience that even 5€ per day is great. 2. Promote Videos throughout the year, in particular just before you launch your products or services sale. Your goal here is to get engagements on videos, especially people who ask for more information about your brand and what you do or sell. If you don't have any, think about creating them. Videos are effective and extremely engaging. A tip for you: when creating your campaign's audience, type your brand name's competitors in the \"Detailed targeting\" section. For instance, if I am promoting a digital marketing event, I can type \"Social Media Week\" and other similar events: Figure 6: detailed targeting So you can show your ad to people who are interested in your competitors' activities. 3. When you have built your trusted audience, it is the right moment to sell your products or service. Remember that you can't sell to \"cold audience\" on Facebook: if people don't know you, they won't buy anything from you. So, focus on retargeting. Show your ad to \"hot audience\", that means an audience that is inclined to buy from you. People who: Already visited your website during the last 90 days. Already visited your purchase page during the last 30 days. Watched your videos at almost 50%. Already purchased from you (or added to cart) during the last 90 days. Retargeting on Facebook is really powerful for sales. 3 Issues That Can Negatively Affect Your Facebook Campaigns In my experience as a Facebook Ads manager for clients, I have committed three errors that I am going to share with you so that you can avoid them. 1. Creating Ads Quickly For many reasons (clients pressure, enthusiasm, too many ongoing projects) you may think you can create a campaign in just 1 hour. Wrong. It takes a lot of time, sometimes even if 8 or 10 hours to create a single campaign. The risks you want to avoid are selecting the wrong audience and create boring advertising. Take your time when: Analyzing data from Facebook Audience Insights. Analyzing the language of your audience; how do your target talk on forums, blogs, and social networks? Creating attractive images or videos. Writing persuasive copy. 2. Running the Same Campaign For a Long Time (i.e., one month). Wrong. It is better to concentrate all of your budget in a short period campaign rather than splitting your budget into several days. For example, if you have to promote a product, tell people your promotion will expire in 3 days, so your campaign will be online for a few days. It is better to spend 200 euros in 3 days than 200 euros in 20 days. 3. Making Ads Complex Wrong. Make your ad easy: Easy to read Easy to understand You have a few seconds to grab your customer's attention on Facebook, so avoid complicated copywriting, make it snappy, and avoid complicated discounts or strange images. Simplicity is the best choice: Get straight to the point in a few short sentences. Show your products or an image that visually explain the benefits of what you are trying to sell. I hope this article can be useful to you. I am glad to answer to your comments or thoughts below.",
  "headers": [
    {
      "level": "H1",
      "text": "How To Create an Ecommerce Facebook Ads Strategy: A Case Study"
    },
    {
      "level": "H3",
      "text": "3 Ways to Create Your Facebook Ads Strategy for An e-Commerce Site"
    },
    {
      "level": "H3",
      "text": "Brand Awareness Campaigns"
    },
    {
      "level": "H3",
      "text": "Engagement Campaigns"
    },
    {
      "level": "H3",
      "text": "Campaigns for Conversions"
    },
    {
      "level": "H2",
      "text": "How a Beauty e-Commerce Earned 11.875 Euros in 5 Days with Facebook Ads"
    },
    {
      "level": "H3",
      "text": "Let’s Analyze the Campaign Starting From the Structure"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H3",
      "text": "3 Issues That Can Negatively Affect Your Facebook Campaigns"
    },
    {
      "level": "H6",
      "text": "Most popular pages"
    },
    {
      "level": "H6",
      "text": "SEO Checklist: 41 Tips to Optimize Your Website"
    },
    {
      "level": "H6",
      "text": "How to Perform a Complete SEO Audit (in 14 Steps)"
    },
    {
      "level": "H6",
      "text": "A Beginner’s Guide to Keyword Search Volume"
    }
  ],
  "author": ""
}