{
  "url": "https://www.semrush.com/blog/how-to-make-an-ad/",
  "slug": "how-to-make-an-ad",
  "title": "How to Make an Ad, Step by Step",
  "description": "A great ad doesn’t bombard audiences’ in their newsfeed, it conveys a clear brand message, offers value, and earns users’ attention.",
  "content": "Ads are essential for brand visibility and engagement. A great ad doesn’t bombard audiences’ in their newsfeed, it conveys a clear brand message, offers value, and earns users’ attention.In a sea of ads, brands are tasked with creating ads that are both competitive and creative. Not sure how to get started? Here’s a six step process to follow, using the smartest advertising tools available and delivering real business results.How to Make an Ad in 6 StepsThe more tailored your ad is toward your target audience, the more deeply it will resonate with them, and the more successful the outcome. With these six steps, you can make an advertisement for your business: Research your target audience Know the type of ad you want Choose your platform Finesse your messaging Craft creative content Optimize your ad for conversionsLet’s dive in!1. Research your target audienceTo begin making an ad, first spend time understanding your buyer personas - or who you’re speaking to. Pay attention to demographics, user preferences, behaviors, and other data points that update you about the people you’re trying to reach. Allow this information to shape your ad, not the other way around.There are a number of ways to conduct audience research. You could ask users to complete surveys, host feedback sessions, use social media analytics, or an audience research tool. The goal of this step is to find out what your audience’s pain points, needs, and communication preferences are. Once you have that info, you can create user personas, like the one below. You could also look into tracked user metrics from existing products/services that you have. Once you know who your ad is for, you can start to consider how to angle the ad: Does this audience want to be sold something? Do they need to be informed or inspired? How aware of your brand are they? These questions will ensure that your ad has purpose.2. Know the type of ad you wantAds come in many forms, and the type of ad you use will depend on your target audience and overall strategy goals. Some of the most common ad formats are: Display ads – ads that visually showcase your brand or product on online platforms and have a specific CTA. Pay-per-click ads – ads that appear on search engine results pages. HTML5 Animated – an interactive ad that uses animated text and images or video. HTML5 Static – a static ad that uses still images and text. Banner ads – these appear in social, display, and video channels, and can be a mixture of text and images. Carousel ads – these are a series of images, videos or text in a cycle, all within one ad. They appear on social and display advertising. Video ads – video ads that appear on streaming services like YouTube. In-stream video ads – video ads that appear within other videos on social media. Promoted account ads – ads that have been bought or sponsored by a brand and are shared via posts on social media.3. Choose your platformThere’s no shortage of platforms to display an ad – you could choose social media, Google’s Display Network, a search engine or third-party websites. Google Display Network is a collection of millions of websites, videos, and apps where your adverts can be shown. This network puts your ads in front of a significant portion of internet users, plus you’ll reach people who aren’t necessarily searching for your brand, product or services. Within each ad platform, there’s an array of different options that will place your ad in front of different audiences with different marketing expectations.Take time to know where makes the most sense for your ad. Check the average age, location, content consumption, and interests of the people who regularly use each platform. Essentially, you want to find where your target audience(s) are visiting, but you should also factor in the ad features of the platform. Facebook ads and Instagram ads both offer detailed ad functionality where you can filter who sees your ad based on a range of criteria. Meanwhile, Google Ads enables you to reach users searching for information, products and services related to your brand.The platform you select plays a big role in the return on investment (ROI) of your ad. Ad pricing varies across platforms, and even if you have a spectacularly designed ad, if it’s not accessible to the right people at the right time, it won’t achieve its goals.4. Finesse your messagingYou may have an idea of what you want your ad to be, but how do you want to express it? The best ads have a clear and compelling message – and they are quickly decipherable (there’s a lot of content competing for attention online). This slightly controversial Instagram ad from heropost, for example, clearly positions itself as a cheaper option compared to its competitors. They should also represent your brand effectively. Your ad is an extension of your brand, and you need it to be memorable, engaging, and strike audiences’ emotions. Using your target audience research, consider how people like to be communicated to and what resonates with them (you could look at what previous messaging has prompted them to act). Keep in mind your brand values and tone of voice, and why you’re making the ad. What does the ad share with people that they don’t already know or have? You want to position yourself as an authority but also a great narrator. This Instagram ad is visually simple. It gives you a very clear message and speaks to a customer need:Think of it like being in a crowded room where you want people to hear your voice and instantly think “Oh, I want to hear what they have to say.”5. Craft creative contentAny ad is an opportunity to get creative. Start by honing in on your brand’s value proposition and exploring how that can be brought to light in your ad. Maybe you have a unique approach to sustainability, perhaps you’re known for your cutting-edge technology, whatever your “special sauce,” it should be translated in your ad’s layout and design. For instance, the simple image in the ad below creatively shows the principle behind the product being sold. You may be tempted to include multimedia like polls and product carousels. However, be conscious of placement and volume – too many elements can be overwhelming, too few can be interpreted as mundane. This brilliant ad by KitKat is a great example of creativity in action, in outdoor marketing. (H/T The Marketing Millennials)Also take into consideration your target audience’s needs – do they have time to interpret mysterious ads? Do they require big text? Do they relate more to interactive content than static content?Your ad should always have an obvious call-to-action (CTA), or step that you’re asking users to take. The simple “Book Now” in the ad below leaves no doubt as to what the viewer should do next. From a design perspective, the CTA should be distinguishable from the rest of the ad copy and design, and should be an instruction that prepares users for where they will go next (for example, to a landing page, a live chat, a product review). You have total creative freedom with ads but there should still be a connecting thread between your brand, the ad, and the user experience to ensure the best results.Integrate your brand colors, slogans, logo, and other recognizable components where possible, but also don’t be afraid to experiment with your ad space. You don’t want to go so far from your branding that people can’t recognize you, but you can try different approaches with aesthetics to evoke different emotions from users. Ultimately, you want a creative ad that stands out for the right reasons, not because it’s impossible to digest or connect with a brand.6. Optimize your ad for conversionsThe goal of your ad is to achieve a conversion of some sort; that could be a customer making a purchase, signing up to a newsletter, liking a post or any other tangible action. Such conversions don’t happen without the ad being carefully curated for that step.First, make sure that you have a clear objective for your ad campaign and define the KPIs (Key Performance Indicators) that will measure its success. Once your ad is up and running, continually test its performance and iterate copy, design, placement, and targeting options accordingly.It’s also beneficial to use A/B testing to run different versions of your ad at the same time, to see which results in more conversions.Data is key for conversions. Harness analytics tools (both on the platforms where you have your ad and external tools) to keep on top of who interacts with your ad, when, and if they convert.This information can reveal gaps in your ad strategy and highlight what elements you should maximize to increase conversions further.Using an AI Ad CreatorWe’ve gone into the theory, now let’s look at how you can put it into practice with AdCreative.ai - a new addition to the Semrush App Center, designed to create digital advertisements for any platform in seconds.With this app, you can generate more than 180 conversion-focused video ads or banners within seconds, and without needing previous design experience. Below, follow how to make an impactful ad using AdCreative.ai1. Input your brand detailsShare your website URL or manually upload details about your brand (including your brand description, logo, and colors), and AdCreative.ai technology will automatically generate ads that align. You can also specify the font and design colors you want.We’ll use mcdonalds.com as an example to see what kind of ads it can create for the popular fast food chain.2. Select your ad type and formatDepending on your brand needs and ad focus, choose from the following ad options: Ad package – Generate ad strategies, ad creatives, texts, and target audiences, all within individual projects. This article will guide you through the steps of the ad package. Ad creatives – Create conversion-focused images, videos, animations, text, and more for ads for your product or service. Social creatives – Launch engagement-oriented social media posts. Ad texts – Leverage copy written by AI and optimized for conversions. Batch creatives – Create multiple ad creatives from multiple product photos. Product photo ads – Use AI to convert your brand photos into professional content. Ad videos – Repurpose product images into videos for ad conversions. Stock images – Generate unique, royalty-free images with AI. Custom templates – Build a custom template for your social media and display ads that AI can populate with copy.With each method of ad generation, the app will give you hundreds of options to choose from, which is ideal for A/B testing.While the custom template option gives you the most control over your ad design, the ad package option can generate a wide range of assets for you quickly. 3. Set up your ad strategySpecify the product/service, target audience, language, and goal that you want your ad to concentrate on. Then choose from a range of possible AI ad strategies, ranging from: Direct conversion focused Tailored content Lead generation Conversion-focused content Online presence Custom strategyNext, choose the platform where you want to display your ad. After, choose the size of the ad creative you want to design. Browse a range of free stock images to have as the background of your ad, then view suggested copy written by AI for the ad.Pick an image from the list of stock images. This will be used in your ad.Then, you’ll review the ad copy, which is generated by AI. This ad features a header, subheader, body text, and CTA. You can edit the copy according to your preferences. Once you’re happy with this copy, select “Generate” and the app will create hundreds of assets for you to test.4. Pick your preferred ad creativeAfter a minute or so, the app will generate your ads and you can review your options. Here are some sample ads it made based on input from mcdonalds.com and the stock image:View a comprehensive list of AI-generated ad creatives, tailored to your brand and goals. Each creative has a conversion score of out 100, indicating its potential to prompt users to take your desired action. You can edit the colors, text, and logo of your ads at any time. Ad creatives are free to download and can be saved to any device. In the ‘Text’ tab, you can view copy for social media posts. Meanwhile, the ‘Audiences’ tab provides information about what audience interests to target, as well as their ideal age range and gender.Choose as many options as you like from the creative, text, and audience tabs. These will then be saved under that particular project, and you can access them whenever. Creating Video Ads with AIWant to make video ads with this app? No problem. Just go back to the list of options and select “Ad videos.”From here the process is almost the same - just upload your own or select your product photo from the stock image database to get started. You’ll start to see a preview of what your video ads might look like. Remove the background of your stock image to make the product photo stand out more on your ad.Again, you’ll be able to review your finished ads, this time with moving backgrounds and royalty-free music to make them even more captivating.Generating video ads like this with the help of AI is a great way to get started with online advertising if you don’t have the budget for a designer or ad agency.The Making of Modern AdsGreat marketing always requires a human touch, however, in the digital sphere, AI and other tools can accelerate your marketing efforts, especially when it comes to making ads. Not only does the tech save you time, it can generate effective, data-driven ads that are more likely to produce high ROI.Use the steps above to make your own compelling ad, and try AdCreative.ai to ensure that your ads are attention-grabbing, attractive, and inspire action.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Make an Ad, Step by Step"
    },
    {
      "level": "H2",
      "text": "How to Make an Ad in 6 Steps"
    },
    {
      "level": "H3",
      "text": "1. Research your target audience"
    },
    {
      "level": "H3",
      "text": "2. Know the type of ad you want"
    },
    {
      "level": "H3",
      "text": "3. Choose your platform"
    },
    {
      "level": "H3",
      "text": "4. Finesse your messaging"
    },
    {
      "level": "H3",
      "text": "5. Craft creative content"
    },
    {
      "level": "H3",
      "text": "6. Optimize your ad for conversions"
    },
    {
      "level": "H2",
      "text": "Using an AI Ad Creator"
    },
    {
      "level": "H4",
      "text": "1. Input your brand details"
    },
    {
      "level": "H4",
      "text": "2. Select your ad type and format"
    },
    {
      "level": "H4",
      "text": "3. Set up your ad strategy"
    },
    {
      "level": "H4",
      "text": "4. Pick your preferred ad creative"
    },
    {
      "level": "H2",
      "text": "Creating Video Ads with AI"
    },
    {
      "level": "H3",
      "text": "The Making of Modern Ads"
    }
  ],
  "author": ""
}