{
  "url": "https://www.semrush.com/blog/how-to-upsell/",
  "slug": "how-to-upsell",
  "title": "Top 5 Actionable Ideas for Upselling Your Agency Clients",
  "description": "Looking to increase revenue by upselling existing clients? We have 5 ideas for how to upsell clients on premium services. Read on to learn more.",
  "content": "Upselling and cross-selling services to customers are almost givens for any agency looking to keep existing clients. In fact, you have a 60% to 70% likelihood of upselling an existing client, compared to a 5% to 20% chance that you will successfully pitch a new client, according to University of Virginia Professor of Business Administration, Paul W. Farris in his book, “Marketing Metrics: The Definitive Guide to Measuring Market Performance.” Those are some promising statistics. If you haven’t upsold or cross-sold to your clients, this is your sign to consider it. Not sure where to start? We’ve put together five compelling ideas for upselling and cross-selling your clientele. Read on to get started. How to Upsell ClientsIf you’ve been in business for any length of time, you probably have several clients that you would love to keep on for as long as possible. These clients might be easy to work with, have large contracts, or have unique marketing needs that your digital agency is very well suited to serve. Whatever the reason, these are the types of business relationships that you want to nurture. The truth is, it can be nerve-wracking to start upselling existing clients. What if they don’t like hearing pitches for additional work? How do you know when you’re overselling?Look for these signs to know if you are upselling at the right pace: Clients are very engaged in your presentations or pitches — no one is on the phone or doing other work while you’re presenting Your client is quick to respond to your emails, texts, or other forms of communication Your client stays on topic — no one tries to change the conversation when sales-focused topics arise If your client is showing signs that they aren’t interested in the upsell, you might still have a chance to cross-sell your services. We’ll talk about that in point 4. But first, let’s talk about how you can punch up your services to make them particularly enticing to clients.1. Offer Robust Competitor Analysis and Market ResearchThis one might seem obvious. After all, most agencies offer competitor analysis as part of their existing marketing contracts. However, you could potentially add to your toolbox by offering customized reports and presentations on market saturation, competitor advantages, and gaps in marketing strategies that your clients can capitalize on. Giving clients a tangible, up-to-date road map to their competition not only helps them gain traction in their market but also offers them a service that will need to be updated and customized over time, meaning they have a better chance of staying with your agency long term. We’ll dive deeper into reports in just a moment. Another tool you can deploy is commissioned market research. Working with consulting firms or data analysts can give you invaluable insights and statistics your client can then use to showcase their value proposition to their own customers. Bottom line: Being the go-to agency for up-to-date market intelligence and research as well as competitor analysis will make your business very enticing to existing clients. It can be work to amass and maintain this kind of data, but it makes your agency both trustworthy and authoritative. 2. Build on the Client’s Existing Marketing StrategyIf you’ve been building content, doing technical updates to clients’ sites, and overseeing paid advertising campaigns, you might think you’ve got your client covered from all angles. However, you almost always have room to expand on an existing marketing contract. Maybe your client is struggling with amplification of their digital content, and your business can offer outreach for a fraction of what it would cost your client to do that work in house. Here are a few other things you can do to build on an existing client’s marketing strategy: Influencer marketing: Social media influencers have played a big role in the digital marketing world in the last few years. In fact, 80% of marketing professionals find influencer marketing to be effective. Maybe your agency can offer a niche influencer marketing service that pairs clients with influencers in their industry to promote their products or services. Social media management: Social media can be overwhelming for businesses to manage in-house. Consider offering an extension of your contracts that includes social media or community management. Reputation management and PR specialists: Bad press, viral news stories, and other negative information that appears online about clients can seriously damage their brand reputation. Offering PR and reputation management services takes a weight off clients, and they can trust that you have their best interests at heart. Bottom line: You almost always have room to add services to your agency repertoire. Offering additional benefits and marketing tools to your clients makes you their go-to source for virtually all of their external-facing communication, which in turn is great for your business.3. Create Eye-Catching Reports, Private Client Portals, and Personalized DashboardsNever underestimate the power of a well-presented pitch or report. Having personalized collateral that clients can return to when they have questions, need additional clarity, or would like to check the status of their marketing campaigns is a great way to add a personal touch to the client experience. You can introduce these customizations at any point, but it might be especially enticing when the client’s marketing campaign begins to grow and you have a lot of data and figures to track. Customized reports and dashboards also give your clients polished materials to pass on to their stakeholders and leadership. Our client portal is a collaborative tool that agencies can charge their clients to use. This is a simple but powerful upgrade to any existing reporting services your agency offers. Our Agency Growth Kit add-on gives agencies all the tools necessary to smoothly and efficiently manage client interactions. In addition, you get access to customizable, white-label client reports, and client dashboards. Bottom line: Offering a customized client experience beyond boilerplate reports and quarterly updates gives your agency the edge on competitors that don’t and won’t go the extra mile for their clients. You can charge clients for this 24/7 client portal access. This is an effective way to keep clients coming back for more work with your agency. You can also manage your interactions with all of your existing and prospective clients in one convenient space like our CRM — saving you precious time and resources. 4. Pitch Video and Photo Production for Ecommerce (Cross-Selling)One of the most time-consuming and costly parts of running an eCommerce business is producing and organizing the visual marketing of products and services. If you are finding that you have clients that are averse to upselling, you might be surprised at how eager and willing they are to be cross-sold on additional services your agency offers. For example, if you have visual marketing specialists in-house, you can leverage their skill sets to take clients’ eCommerce sites from text-heavy, confusing digital mazes (that their customers are apt to get lost in) into sleek, pleasant digital experiences. Bottom line: Cross-selling can be an effective marketing strategy for your agency when you have clients averse to upsells. Cross-selling can include a number of things, but ultimately it’s a way for you to leverage already existing facets of your business in order to expand client contracts.5. Upgrade Standard Client Services to Premium Services One of the easiest ways to upsell clients is by creating premium service categories that they can opt into. Here is how to upsell these types of services: Offering 24-hour communication with an agency representative More frequent check-ins and account management updates Training for your clients’ in-house staff Customized reports (as mentioned above) Premium website upgrades Bottom line: Chances are your agency offers services that can be customized and charged at a premium rate. If clients are happy with the existing services you offer, they may be more open to paying for premium services, which in turn creates a lucrative and lasting relationship between you and your clients. The upfront costs of offering premium services to clients are typically minimal and can rely on existing resources. It’s a great way to make your clients feel like VIPs while earning their trust and long-term business. When Is the Best Time to Upsell? So, when is the best time to upsell a client? Every agency approaches the upsell process differently; however, a very common time for agencies to attempt an upsell is after a big milestone is reached in the client’s marketing campaign. This is when clients are primed to hear what else you can offer to increase their success and brand visibility. Another great time is when a client expresses frustration or problem outside the existing scope of your work together. If you can solve this problem for them through an upsell or by cross-selling your services, they will be more likely to be open to the idea. The more successful you are at upselling, the more likely it is that clients will continue to add on additional services with your agency. How to Gauge Price Increases How much should you charge when upselling or cross-selling a client? For an upsell, Retail Doctor recommends that you don’t go more than 25% of the initial contract price. This is a general rule of thumb, and you can decide what price to set based on your individual business needs. That said, you’ll want to create a price range that doesn’t scare off existing customers. You can even offer payment plans and discounts to clients who opt into multiple upsells or premium packages. This is also where doing your own competitive research becomes very important. The Agency Partners Platform will give you an idea of what other reputable agencies are charging for their services. Final Thoughts Learning how to upsell to clients can be complex, but it doesn’t need to be stressful. If you have yet to implement an upselling or cross-selling strategy for your agency, you may want to consider trialing new services and upsells with your most trusted and secure clients. You could also consider offering incentives to clients who give you valuable feedback on your upselling process. You will have successes and learning experiences along the way as you find the best method for marketing to your existing clients, but with some practice and a client-first approach to your pitches, you will be in the best position to grow your business.",
  "headers": [
    {
      "level": "H1",
      "text": "Top 5 Actionable Ideas for Upselling Your Agency Clients"
    },
    {
      "level": "H2",
      "text": "How to Upsell Clients"
    },
    {
      "level": "H3",
      "text": "1. Offer Robust Competitor Analysis and Market Research"
    },
    {
      "level": "H3",
      "text": "2. Build on the Client’s Existing Marketing Strategy"
    },
    {
      "level": "H3",
      "text": "3. Create Eye-Catching Reports, Private Client Portals, and Personalized Dashboards"
    },
    {
      "level": "H3",
      "text": "4. Pitch Video and Photo Production for Ecommerce (Cross-Selling)"
    },
    {
      "level": "H3",
      "text": "5. Upgrade Standard Client Services to Premium Services"
    },
    {
      "level": "H2",
      "text": "When Is the Best Time to Upsell?"
    },
    {
      "level": "H2",
      "text": "How to Gauge Price Increases"
    },
    {
      "level": "H2",
      "text": "Final Thoughts"
    }
  ],
  "author": ""
}