{
  "url": "https://www.semrush.com/blog/how-to-find-low-competition-keywords-with-semrush/",
  "slug": "how-to-find-low-competition-keywords-with-semrush",
  "title": "Keyword Research for Low Competition Opportunities",
  "description": "How can you find low-competition keywords to boost your website’s rank? Find out here.",
  "content": "Finding a low-competition keyword is like finding a juicy peach in a grocery store. Most of the peaches look great until you sink your teeth into a tough one. Keywords are the same. Unfortunately, heavy keyword competition makes a lot of keywords really hard to rank for with SEO. But, when you learn how to look closer and spot the difference between the hard ones and the juicy ones, you can start finding easy low-competition keywords to go after with your SEO plan.What Are Low-Competition Keywords? Low-competition keywords are search queries that have fewer companies and websites overtly competing for high organic rankings with SEO.Because they have less competition, these keywords are good opportunities for an SEO plan.Targeting low-competition keywords with helpful content on your website can help you achieve your organic traffic goals with less off-page strategy or social promotion. Finding the Low-Hanging Fruit in SEO In terms of SEO, low-hanging fruits are high search volume low-competition keywords. Searches in the sweet spot of being not popular enough to be overly crowded with competitors, but still common enough to send your website traffic.This sweet spot is where you find your best opportunities to start getting organic search traffic to your site.If you’re entering a new market or starting a new website, you’re going to want to find as much low-hanging fruit for your SEO strategy as possible.Take it from Alizée Baudez, SEO consultant and digital marketing specialist: With the Keyword Magic Tool, I like to start by filtering out KD% that are too high. That way, I know my client won’t focus on unreachable keywords...This is a simple way to go grab low-hanging fruits and make sure the content plan that we'll follow will actually be useful to customers.Alizée Baudez, SEO Consultant & Digital Marketing SpecialistHow to Find Low-Competition Keywords with High Traffic You can quickly find long-tail keywords and specific questions people search for online by looking at our metrics like keyword difficulty, competitive density, and volume. In just three easy steps on Semrush, you can build a juicy list of keywords with high volume and low competition—even if you’ve never tried it before: Build your initial keyword list Expand your keyword list Filter for high-volume keywords with less competitionStep 1. Build Your Initial Keyword List (How to Research Competitors’ Keywords)Start with: Organic Research Positions. Here you have to: Go to Semrush Organic Research Enter a competitor’s domain name and click Search You will get a list of keywords your competitor’s website is ranking for in Google’s top 100 organic search results.We’ll use the healthy cooking niche as an example so a competitor would be eatingwell.com.Now, you can dig through their performance and see the keywords where they’re getting traffic from search engines.Take note of the KD% (keyword difficulty) column. This is our way of measuring the difficulty of competing for this keyword if you’re starting from scratch. We’ll talk more about KD% below in this post.You can also use filters to find more specific search terms that are more relevant to your business. For example, here’s how it looks with a filter to find keywords that include “vegan.” You can combine filters for KD%, volume, or even number of words per phrase (for example, keywords containing 4 words or more) to find low competition, long-tail keywords that you can add to your list.Repeat this process for multiple competitors and send the keywords you like into the Keyword Strategy Builder where you can save a master list of up to 1000 keywords.Pictured above is an example of an Organic Positions report getting filtered by KD% and then sending the top 100 keywords to a new list in Keyword Strategy Builder.Next tool to use: Keyword Gap Go to the Keyword Gap tool to compare keywords between domains to find more long-tail queries Enter your site and up to four of your competitors into the input fields and hit the compare buttonFor example, we took the following three domains: eatingwell.com, verywellfit.com, and health.com.In a few clicks, we built a list of over six million keywords for the healthy cooking niche.TipIf you don’t know which domains are in your website’s industry, use the Competitors report tab in Organic Research.Use the missing, weak, and untapped filters to find the best opportunities for your site. Now export the keywords you like from this report to the Keyword Strategy Builder to combine the list with your other exports so you can keep a master list going. The next step will help you find even more keyword ideas to add here.Step 2. Find More High Search Volume Low-Competition KeywordsTool to use: Keyword Magic ToolNow it's time to expand your low competition high volume keyword list with more phrases you might have overlooked. To find phrase match keywords, Go to the Keyword Magic Tool Enter a term from your initial list of search terms, and click Search You will get a list of expanded keyword phrases that include your queried term.Next, use the Related filter to find related keywords. This will list phrases that are semantically related to a particular queried search term and may not share the same phrasing but have similar search results. You’ll want to add some of these to your plan as well to cover your bases.To find question keywords (which make for great content topics) use the Questions filter. This will display only keyword phrases that include who, what, where, when, why, or how.If we’re looking at this list of keywords in the image above—KD% is still pretty high. So if you see KD scores like this you’ll want to add a filter for lower difficulty. More on this in step 3.Again, send your desired keywords to the list in Keyword Strategy Builder with all the other keywords you’d like to target.TipUse the SERP Gap Analyzer app in the Semrush App Center to find specific keyword opportunities for your site. This app scans Google SERPs related to your seed topic to find weaknesses in high-ranking pages and easy-to-rank-for terms. To use it for topic suggestions, click the “Suggested Seed Topics” tab. Once you enter your website and click “Suggest,” the app will recommend topics to consider. To run an analysis on any of the recommended terms, simply click that topic. Step 3. Filter for High-Volume Keywords With Less CompetitionThe average monthly search volume for each keyword shows you how much potential traffic you can receive. The higher your rankings for high-volume search terms are, the more traffic will be driven to your website. Yet, competition for the most popular keywords is very high. There’s no sense in trying to rank for keywords you have no chance of ranking for. You need to find that balance between a keyword’s search volume and its competition level.To help you with this step, Semrush has two main ways of filtering to find low competition keywords: Keyword Difficulty (SEO)—an estimation of how difficult it would be to organically outrank the current websites and webpages ranking in the top spots on Google for a particular keyword. Competition Level (PPC)—the density of paid advertisers using a particular search phrase for their ads. Although this metric refers to competition in paid search, it can be somewhat representative of organic search competition as well.In the Keyword Strategy Builder, you should be able to locate the column for each metric. Both metrics will help you look closer to find the best keywords to start targeting to find success.Estimating Keyword DifficultyKeyword difficulty (from 1-100%) shows you an estimate of how difficult it would be to seize your competitors’ positions in the Google top 100 with a particular keyword. The higher the percentage, the more effort you’ll need to outrank your competition for targeted keywords: Above 69%: The most difficult keywords. You’ll have to invest a lot of SEO and link-building efforts, as well as time before you’ll be able to enter the Google top 20. If you have a new site, focusing on highly competitive keywords might not be a reasonable idea. From 50-69%: Keywords with average difficulty. Entering the Google top 20 with these keywords won't be easy either. However, with high-quality content and relevant backlinks, you might be able to seize your competitors’ positions in time. From 30-49%: Keywords that are possible to rank for when you’re starting out. Below 30%: Keywords that are the very easiest to rank for, likely with low search volume or highly specific search intent.Discovering low-competition, high-volume keywords will require hard work and patience. But if you are lucky enough to find a strong list of these search terms and implement them throughout your site, you’ll have a very good chance of ranking high for these high-volume search terms.Estimating Competition LevelFor estimating Competition Level, we can assume the scale is roughly the same. The main difference here is that the metric is a decimal between 0 and 1 and that it measures the density of paid advertisers. The closer the score is to 1, the higher the number of advertisers currently bidding on this keyword. Therefore, the harder it would be to stand out in the search results. Above 0.80: These keywords are highly competitive among advertisers and therefore likely send traffic to paid results. You could infer that if a keyword has a high density of advertisers, the search has some intent on making a transaction. From 0.60-0.80: Keywords with an average density of advertisers. You could experiment with advertising on these keywords if your organic efforts don’t work out, but it won’t be a quick win on any of these keywords, either. Below 0.60: Keywords with the lowest density of advertisers. This could either mean that they are under the radar of most competitors that advertise in your niche, or they are simply not profitable to advertise on. Keep this in mind when dedicating.Again, you can refer to the suggested ranges above but the best opportunities to start with are keywords with KD% less than 50. Start looking for those keywords in the 40s, 30s, or below that are relevant to you, and then build up from there. Think About Search Intent However, just because a keyword has low competition and high volume doesn’t mean it’s right for your target audience. A quick reminder: there are four main forms of search intent. They include: informational navigational transactional commercialSo, let’s say you find a keyword that has loads of volume and has no competition. Great, right? Well, no. If that keyword is a navigational search query for another brand, those searchers aren't looking for your site. But, if you find a high-volume search query inquiring about a service you sell that has low competition, that would be a good keyword to add to your list. It’s worth remembering that search intent also has a role in who you’re trying to attract. Factor in CPCWhat if a term is low competition, but doesn’t have high volume? Since a lot of high-volume keywords are already being targeted by a lot of companies online, most low-competition keywords will have relatively low volume. This is okay!If you take a look at the CPC, it could indicate something about this keyword’s value. Cost-per-click is the amount an advertiser pays for a click on their ad depending on the keyword (decided upon before). It’s a term for paid ads, but you can use it with low competition to find searchers ready to buy. Maybe a term is highly relevant to your site but only has a search volume of 20. If the intent is right, the competition is low, and it has a high CPC, it’s a search term you might want to consider. Use Your Resources Google tweeted in 2022 that 15% of Google searches have never been searched for before. How can you capitalize on these keywords that have 0 search volume? Find where your target audience frequents. Visit groups on social media, forums, and sites like YouTube to see what your target audience is talking about. What problems do they have? How do they phrase what they’re looking for? You can use sources like these to find keywords that are completely untapped because they haven’t been searched yet but will be soon. Measure Difficulty With the Keyword Overview ReportYou can quickly estimate keyword competition in bulk with the Semrush Keyword Overview. Just enter a list of up to 100 keywords from this tool’s main page.Perhaps you have a list of keyword targets or a list of keywords your site already ranks for exported from Google Search Console. You can drop that list in here and quickly see how we rate the difficulty of each keyword. From the Keyword Overview homepage, you can view the keyword difficulty of up to 100 keywords at once. Enter one search term per line, choose your regional database, and click the Analyze button. The report will give you the KD scores, along with other metrics like volume and CPC, of your unique batch of keywords. Bonus: Spot Low-Competition Keywords for SERP FeaturesA low-difficulty keyword that has a Featured Snippet on the SERP would be a great opportunity because you could: Take up more real estate at the top of the SERP Give your audience information faster and look trustworthy to them Theoretically acquire this more easily than a high-difficulty keywordFor tips on acquiring a Featured Snippet, check out How to Target and Win SERP Features.While you’re in the Bulk Keyword Analysis, you can also see which keywords trigger SERP Features like Featured Snippets or Instant Answers. Recap and More ResourcesLearning how to do keyword research is essential for businesses. To do it well, you need to be careful when choosing your targets. For more tips on keyword research with Semrush, check out: How to Use Semrush for Keyword Research Advanced Keyword Research with Semrush (Ft. Keyword Magic Tool)In March 2022 we updated our search volume algorithm to make it easier to find the target keywords you need to top the SERP.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Find Low-Competition Keywords with Semrush [Super Easy]"
    },
    {
      "level": "H2",
      "text": "What Are Low-Competition Keywords?"
    },
    {
      "level": "H2",
      "text": "Finding the Low-Hanging Fruit in SEO"
    },
    {
      "level": "H2",
      "text": "How to Find Low-Competition Keywords with High Traffic"
    },
    {
      "level": "H2",
      "text": "Step 1. Build Your Initial Keyword List (How to Research Competitors’ Keywords)"
    },
    {
      "level": "H2",
      "text": "Step 2. Find More High Search Volume Low-Competition Keywords"
    },
    {
      "level": "H2",
      "text": "Step 3. Filter for High-Volume Keywords With Less Competition"
    },
    {
      "level": "H2",
      "text": "Estimating Keyword Difficulty"
    },
    {
      "level": "H2",
      "text": "Estimating Competition Level"
    },
    {
      "level": "H3",
      "text": "Think About Search Intent"
    },
    {
      "level": "H3",
      "text": "Factor in CPC"
    },
    {
      "level": "H3",
      "text": "Use Your Resources"
    },
    {
      "level": "H2",
      "text": "Measure Difficulty With the Keyword Overview Report"
    },
    {
      "level": "H2",
      "text": "Bonus: Spot Low-Competition Keywords for SERP Features"
    },
    {
      "level": "H2",
      "text": "Recap and More Resources"
    },
    {
      "level": "H6",
      "text": "Most popular pages"
    },
    {
      "level": "H6",
      "text": "SEO Checklist: 41 Tips to Optimize Your Website"
    },
    {
      "level": "H6",
      "text": "How to Perform a Complete SEO Audit (in 14 Steps)"
    },
    {
      "level": "H6",
      "text": "A Beginner’s Guide to Keyword Search Volume"
    }
  ],
  "author": ""
}