{
  "url": "https://www.semrush.com/blog/how-to-use-emoticons-memes-and-gifs-in-social-media-marketing/",
  "slug": "how-to-use-emoticons-memes-and-gifs-in-social-media-marketing",
  "title": "How To Use Emoticons, Memes and GIFs in Social Media Marketing",
  "description": "Taking a closer look at emoticons, memes, and GIFs to see have to safely use them in your social media marketing efforts. Bunch of examples included.",
  "content": "One of the toughest tasks for many marketers is the constant need to track, test and improve upon current trends in the industry. It is probably one of the main reasons why you are reading this article right now.Today, we will look at emoticons, memes, and GIFs and try to deduce if they are worth being a part of your social media marketing efforts as well as teach you a thing or two that will help you use these graphics without embarrassing yourself.While these “visual expressions” have been around since we were capable of sending first emails, we have seen a significant rise in their usage for marketing purposes only in the last couple of years. The main reason for that is actually quite simple; brands and businesses noticed that this can be a great way to connect and engage with millennials. Additionally, these graphics are a form of visual content, and social media craves visual content.But enough of my rambling, let’s review how can you take advantage of them and what you should pay special attention to since there are many traps to fall into.EmoticonsIf there is one thing on this list that I shouldn’t have to clarify it is definitely emoticons. We use them in text messages, emails, tweets and every other message we leave on our social media channels.I mean, a few months back, we had The Emoji Movie where Patrick Stewart lent his voice to the poop emoji. That should speak enough about their popularity.How can you use them: Distinguish your brand by designing your own emojis. Use them to increase engagement on your social media updates (e.g., ask your audience to vote on something through the use of emoji). Respond to comments and tweets with emojis to communicate a specific emotion. Use them to tell a story (like McDonald’s did in the example below). Emojis aren’t bound by language barriers so they can be used to reach a wider audience without the need for translation. Things to keep in mind: Don’t be overly complicated. The message you are trying to convey has to be easy to understand (look at the Deadpool and Chevrolet examples below). Not everyone has the patience to decipher your messages. Don’t go overboard. Too many emojis tend to be distracting and can move the focus away from the message you want to send. In the worst case scenario, your audience may even find it annoying. Make sure you know what the emoji expresses. Turn to Emojipedia - an emoji dictionary that also features latest news and development from the emoji world (yeah, you read that right). Avoid using emojis in serious situations. Emoticons are inherently fun, cheeky, and informal and as such should be avoided when dealing with serious issues or communicating in strictly formal environments. Good example #1 - McDonald’s Good Times CampaignMcDonald’s used emoticons to tell a story in a way that associates their brand with positive things. It is often used in their tweets. Cool, simple, and effective.Good example #2 - Deadpool BillboardsThese billboards caught the attention of many fans and pictures like the one above got a lot of shares on different social channels. We can’t measure how much overall impact this had on the moviegoers, but the fact remains that Deadpool is the highest grossing R-rated movie of all times.Good example #3 - #EndageredEmojiWorld Wide Fund For Nature started the #EndageredEmoji Twitter campaign to raise the awareness about endangered animals and hopefully raise some funds that will help to save them from extinction.Bad example #1 - #ChevyGoesEmojiChevrolet decided to write a press release and asked their audience to decode it. While the campaign did create a lot of buzz, the overwhelming number of dislikes proves they tried to be too clever.I’m sorry Chevrolet, it had to be done :)MemesMemes are extremely versatile. They can come in the form of an image, a video, a GIF, a text (a phrase) or a combination of all of the above. Their origin is often related to a popular cultural reference. Memes are meant to be funny and heavily rely on sarcasm.People always try to find a new way to use them, so it is not rare to come across the same meme with a bunch of slight variations.How to use them: Memes can be a perfect addition to your humor-based campaign. Use of memes will increase engagement and shareability of your content. Target a specific group of people who understand the context to make a stronger connection with them. Memes can provide a way to answer both positive and negative comments and feedback on social media. Things to keep in mind: Memes often have a short life-span. The more popular a meme is, the faster it becomes irrelevant and old. Most likely because people get bored seeing it all the time. Make sure you are using them correctly. You need to follow “meme trends” if you want to use them successfully. Missing the true intention of a joke can set you up for a tsunami of embarrassment. KnowYourMeme is a great resource to inform yourself on their meaning and connotations behind a particular meme. Do not try too hard. If you overuse them, your audience might get the feeling that you are trying too hard to capitalize on a trend which could make them avoid your brand. Content first, memes second. Memes are here to grab attention and enhance your content. They can’t replace the content itself. Good example #1 - Jimmy John’s Twitter postsA perfect example of using a “ You vs. the guy…” meme in the right context to promote your product.Good example #2 - #OscarNomNoms by SeamlessSeamless (online food delivery company) used 2014 Academy award nomination to create their own memes and start the hashtag OscarNomNoms creating Oscar film spoof posters.Bad example #1 - WhataburgerA great example of how to use a meme in the wrong way. This is a Confession Bear meme people use to express controversial opinions and taboo behaviors. Wanting a burger definitely, doesn’t fit into that category and their followers were quick to notice that.Bad example #2 - FAFSAThis was a tweet from the Federal College Financial Aid that received a lot of backlash from their followers who thought that not being able to afford college isn’t particularly funny. They deleted the tweet and issued an apology calling it an “ill-conceived attempt at reaching students through social media.\"GIFsGIF stands for Graphics Interchange Format. In laic terms, you have a bunch of pictures crammed together into one file that is shown in succession which results in animation.GIFs have a higher engagement than images and are significantly cheaper to create than videos. Here is a great guide if you are looking to create your own animated GIFs for marketing purposes.We love GIFs and memes so much that we even created a page cleverly named things to whine about where we like to share memes in the form of a GIF and channel our daily frustrations as content marketers in a productive direction.You can use GIFs to: Spice things up by creating an animated version of your logo. Showcase your product or service (like Wendy’s often does on their Facebook page). Drive traffic to your blog posts (follow the example of General Electric). Involve your followers by asking them to tag a friend that can relate to a GIF you posted or ask them to give you feedback in the form of a GIF (here is a great example from FC Arsenal). Reply to comments in a witty manner. Tell a story or describe a process. Animate data you can share across your social media channels (a great example from Mashable). Announce news and collaborations ( like Nintendo and Vans). Things to keep in mind: GIFs should generally be short (up to 10 seconds or so). They are meant to be consumed quickly. Quality is important. GIFs obviously aren’t suited to be in Full HD format, but if you can count the number of pixels on the screen, you may want to look for one that has a better quality. Beware of copyright issues. Be sure you are following “fair use” when you are creating a GIF from the material you don’t own. Choose your hosting carefully. GIFs don’t always play nice, so twitching, freezing, and refusing to load are not rare issues. Choose reliable sites to host your GIFs like Giphy or Imgur. Size does matter. Facebook recommends that GIF files should be up to 8MB and that text should be less than 20% of the image. Opt for subtle motions. GIFs have a lot of trouble animating fast motions so it is better to avoid it whenever you can. Since we linked to many examples already, this time we will skip showing of additional examples. Also, to be honest, it is pretty hard to find the original GIFs for these examples and giving screenshots just doesn’t fit into this section.Context Is EverythingThere is a time and place for everything. A stand-up comedian can joke about anything while he is on the stage. You, on the other hand, don’t have that luxury.Seeing people get showered with ice cold water may seem silly at first, but when you understand that they are trying to raise awareness about a disease called ALS, suddenly, things make more sense.That is why context is so crucial.You need to make sure that your audience is also familiar with the context you are using a particular meme/emoticon in. If you use a meme to brag about something you won, but your audience doesn’t know you won something, they may get the wrong impression.In short, always: Make sure the situation is appropriate. Know in which context the emoticon/meme should be used. Make sure the audience knows what are you referring to. Beware of Things Going ViralAll of these graphics became popular because they are fun and easy to use, fast to consume, and easy to share.These characteristics help them to go viral which could also help your comment or post to go viral too. The threat lurking behind the corner is that you could get attention for the wrong reasons. While you can argue that there isn’t such a thing as negative publicity, I really doubt you would consciously expose your brand to ridicule just to gain some attention.With sites like Reddit around, if something actually goes viral, it sometimes results in a temporary shut down of your website, as the server can’t handle so many requests. This is known as the Digg effect.While this is highly unlikely to happen, I thought it was interesting information to share :)Know Your AudienceAs with any piece of content that leaves your workshop to engage your current and potential customers, you first need to make sure you know your target audience.While it is hard to do any damage with a restrained use of emoticons, memes are a different story.Keep in mind that memes attract young adults that like to spend a lot of time on the internet.If your audience doesn’t consist of that demographic, there is no point in using them. You will just aggravate your audience as they will not understand what you’re doing.Also, keep in mind that using memes and GIFs will affect your brand image. If you want to be seen as traditional, serious, professional, etc., you may want to avoid using them completely.To truly understand and engage your audience, leveraging tools like Social Analytics from Semrush Social is crucial. It provides a detailed analysis of your social media profiles, helping you understand who your audience is and what kind of content—whether it's GIFs, emoticons, or memes—works best with them. This data-driven approach ensures you tailor your content strategy effectively, maximizing engagement and resonance with your specific audience demographicsSafety In ModerationWhile these graphics may be addictive and fun to use, there can be too much of a good thing. If you don’t believe me, just look at what his love of explosions did to Michael Bay.While I did mention this couple of times already, I will repeat it again - don’t overuse these elements. They can be addictive when you get the hang of how to use them properly, but they will lose its effectiveness if they are popping out of your every post and comment.Additionally, the more you use them, the higher the chance you will make a mistake and set yourself up for a joke.If You Make A Mistake, Play It CoolIf you find yourself in a situation where you have messed up, it is best to own up to your mistake. Trying to find an excuse will just push you further down the hole.If you, for example, use a meme in a completely wrong context and people start to point that out in the comments, the worst thing you could do is try to get out of it by using another meme. This option is only viable if you really know what you are doing. And if you used a meme wrongly in the first place, there is a decent chance you could do it again.To avoid being on the lists such as “ Biggest Social Media Fails of 2017”, consult with a colleague that is well versed in “meme usage” or just leave the comment section to run its course. One or two mistakes won’t break your social media marketing strategy, but a constant misuse of emoticons, memes, and GIFs could have a serious negative impact.Off You GoSmiley faces, funny GIFs, and perfectly timed memes are waiting to boost your social media engagement. The power is in your hands, use it wisely.",
  "headers": [
    {
      "level": "H1",
      "text": "How To Use Emoticons, Memes and GIFs in Social Media Marketing Without Embarrassing Yourself"
    },
    {
      "level": "H2",
      "text": "Emoticons"
    },
    {
      "level": "H3",
      "text": "How can you use them:"
    },
    {
      "level": "H3",
      "text": "Things to keep in mind:"
    },
    {
      "level": "H2",
      "text": "Memes"
    },
    {
      "level": "H3",
      "text": "How to use them:"
    },
    {
      "level": "H3",
      "text": "Things to keep in mind:"
    },
    {
      "level": "H2",
      "text": "GIFs"
    },
    {
      "level": "H3",
      "text": "You can use GIFs to:"
    },
    {
      "level": "H3",
      "text": "Things to keep in mind:"
    },
    {
      "level": "H2",
      "text": "Context Is Everything"
    },
    {
      "level": "H3",
      "text": "That is why context is so crucial."
    },
    {
      "level": "H2",
      "text": "Beware of Things Going Viral"
    },
    {
      "level": "H2",
      "text": "Know Your Audience"
    },
    {
      "level": "H2",
      "text": "Safety In Moderation"
    },
    {
      "level": "H2",
      "text": "If You Make A Mistake, Play It Cool"
    },
    {
      "level": "H2",
      "text": "Off You Go"
    },
    {
      "level": "H6",
      "text": "Most popular pages"
    },
    {
      "level": "H6",
      "text": "SEO Checklist: 41 Tips to Optimize Your Website"
    },
    {
      "level": "H6",
      "text": "How to Perform a Complete SEO Audit (in 14 Steps)"
    },
    {
      "level": "H6",
      "text": "A Beginner’s Guide to Keyword Search Volume"
    }
  ],
  "author": ""
}