{
  "url": "https://www.semrush.com/blog/how-to-leverage-newsjacking/",
  "slug": "how-to-leverage-newsjacking",
  "title": "What Is Newsjacking? 10 Powerful Examples + a How-to Guide",
  "description": "Explore newsjacking in 2024: Boost brand visibility and engagement by leveraging the latest trends and news in your marketing strategy.",
  "content": "Ever wondered how brands turn breaking news into marketing gold? Enter the realm of newsjacking, where savvy companies leverage current events to get their brand in front of new audiences.What Is Newsjacking?Newsjacking is the act of leveraging a news story to gain visibility for your brand. It involves taking advantage of the right timing and wit to generate media attention for your brand by capitalizing on trending topics. This approach was first introduced by marketing and sales expert David Meerman Scott in 2011. An illustration of this is when the airline Virgin Atlantic referenced the momentous legalization of same-sex marriage in an advertisement promoting their services for honeymoon vacations. Image Source: The GuardianThis positive display of support reflected well on the brand, resulting in increased visibility and engagement. Although social media is often employed to share newsjacked stories, it is not the only method. Blogging, web page content, videos, and other means can also achieve the same effect.For example, in MarketWatch’s blog post, “7 Management Lessons from the Walking Dead,” the brand effectively centered a blog post around a popular television series to educate readers about about management. Image Source: MarketWatchBy doing so, they were able to make a somewhat dry topic engaging and relatable. Why Newsjack?Newsjacking continues to be effective, especially given the concentrated focus on breaking news stories on social media platforms. An excellent example is how the OREO Cookie brand effectively utilizes current happenings to draw focus toward its product and maintain relevance. In this case, Oreo cleverly referenced the power outage during Super Bowl XLVII in real time, making their product an active part of the discussion.Image Source: XBrands that successfully newsjack also experience the following benefits: Increased Visibility: When you newsjack effectively, you tap into the audience of a trending topic and significantly increase your content’s reach. Established Authority: Sharing insightful perspectives on current events can position your brand as a thought leader in your industry. Enhanced Engagement: Trending topics often come with higher engagement rates since they resonate with what many people are currently discussing. SEO Benefits: Newsjacking can become a news story within itself, which could help generate backlinks and features in various reputable, high-authority media sites. Return on Investment: Newsjacking can be a cost effective strategy requiring less investment than traditional marketing campaigns while yielding high engagement rates and coverage. Newsjacking can become a game changer for getting your brand noticed, sparking engagement, and driving SEO. By mastering the art of newsjacking, you’re not just following trends, you have the opportunity to set them. How to NewsjackUnfortunately, newsjacking can become a PR disaster when done incorrectly. This is why it is important to avoid the most common pitfalls.With this in mind, we’ve compiled a quick, step-by-step guide on how to newsjack successfully. Here’s what you need to do.1. Find Relevant StoriesOf course, you can’t piggyback on emerging stories if you don’t know they are happening, so you always need to stay informed. Actively monitoring relevant news websites is part of this, but there are other ways to keep your finger on the pulse. You can use Google Trends or a Google Trends alternative to find hot topics.For example, the TrendFeed app lets you easily research hundreds of topics across dozens of industries, allowing you to be among the first to know what is happening in your market. By commenting on breaking, relevant content first, you can set the narrative in your industry and secure your audience’s attention.For instance, if you run a fitness company, simply navigate to the Health and Fitness section under Health and Wellness and choose the desired news story to discuss. TrendFeed will even write and share your post for you with the help of AI.You can also leverage other sources, such as: Reddit and industry-specific forums: You can get a good idea of what’s trending in your sector simply by browsing dedicated forums. Reddit is particularly well-suited to this, as posts can be filtered by popularity within the last day, week, or month. Social media: Hashtags are great for spotting stories and topics gaining traction, particularly on Twitter and Instagram. Semrush Topic Research: Enter a subject into the search bar, and Topic Research will help you brainstorm content ideas. You can also use it to create new headlines and articles. Google Alerts. Google Alerts is an excellent tool for staying on top of news and developments for a given topic. Simply enter a search term and get the latest stories, trends, and changes. Best of all, you can set up real-time, daily, or weekly email alerts and filter based on location, language, and even type of source. Relationships with Journalists: Journalists are often receptive to collaborating if you can do the legwork for them and produce a piece of content or data surrounding a viral story to showcase. While it’s impossible to predict the news, you can still identify and plan for relevant events that you know will occur. These could include major sporting events and significant anniversaries, where you can create content ahead of time and then post when appropriate. For example, Burger King took advantage of the popular event, Homecoming, by mentioning it in a social media message promoting a special meal deal.Image Source: FacebookTo keep up with current events, platforms such as National Today and Event Guide are great resources for discovering these daily and monthly celebrations, observances, and birthdays, and they even provide information on trending events and hashtags.2. Research Your Angle and Your KeywordsIf a particular story or topic is gaining traction, people will be Googling it. This means with a little keyword research, you can position your newsjack to acquire a lot of that search traffic.To identify suitable keywords, you can use the Semrush Keyword Magic tool, but keep in mind the semantics of the term. For instance, countless news stories surrounding the celebrities Taylor Swift and Travis Kelce have been circulating on social media platforms. If you glance at the keyword research, you will find high volume keywords that are easy targets. By incorporating these keywords into your newsjack commentary, you could rank for a viral topic and grossly expand your business’s impact. This is exemplified in CBS News Planet's reference to the couple in an article concerning a large stingray. Image Source: X3. Be Quick, but Be AccurateWhen it comes to newsjacking, timing is everything. According to David Meerman Scott, the entry point for your content should be just after the news has broken—but before it’s been fully covered by multiple media sources.Image Source: David Meereman ScottHowever, while time is of the essence with newsjacking, you must verify the story's primary source before you produce any content based on a news story and conduct more research into it if needed.If something has been misreported, the source isn’t reliable, or it’s unclear what’s happened, you may end up with an egg on your face if you try to newsjack it.For example, this happened when DiGiorno tried to jump in on the #WhyIStayed hashtag on Twitter. The hashtag was being used to bring to light serious issues surrounding domestic violence, and DiGiorno, not understanding the context, used the hashtag to promote their pizza. Image Source: MediumThis was perceived as insensitive and ignorant of the serious nature of the discussion. DiGiorno quickly deleted the post and issued an apology. Image Source: X4. Be Ethical, Don’t Capitalize on Disasters or TragediesEthics and authenticity are crucial in newsjacking and any kind of PR or marketing activity. Ensuring that your newsjacked content doesn’t feel forced, insincere, and inconsistent with your brand voice is critical. There is a fine line between newsjacking and simply jumping on the bandwagon, and audiences — especially digital ones — are usually savvy enough to recognize this.For example, exploiting natural disasters or tragic events could potentially damage the credibility of your brand.Consider the companies that attempted to newsjack Hurricane Sandy. Image Source: XNot only was this event chosen in poor taste, but its reference was irrelevant to the event, resulting in negative attention for these companies. Image Source: XTherefore, your approach to newsjacking should be authentic to your brand and sensitive to the context, ensuring effectiveness without attracting negative scrutiny.5. Choose the Most Appropriate Distribution ChannelsOnce you’ve created your content, you must distribute it as quickly as possible. Here’s a couple of places to start.First, leverage your own social media outlets. Spreading the word yourself makes it easier for people to share your content and expose your brand to new audiences.However, when using social media platforms, consider where your audience spends their time; don’t post on TikTok if your client base communicates on LinkedIn. Second, you could also leverage connections to journalists and influencers who may be interested in your content.For example, you can use PR and media outreach platforms such as Prowly to identify and contact suitable journalists, as well as monitor your brand mentions online. You can also use a tool like Influencer Analytics to find influencers who are ready to work with your brand. Identify one that aligns with your audience and make a connection. It could mean more to your audience if an influencer shares your commentary or unique perspective on a trending story.No matter which approach you choose for newsjacking, ensure that it complements your other marketing tactics. It is most effective when combined with other tactics in your overall marketing strategy.Top Newsjacking ExamplesSo, what exactly does a successful newsjack look like? Here are a few more examples for your inspiration:Wendy’s and McDonald’sThe fast food chain Wendy’s has a notoriously amusing social media presence, especially on Facebook. Given this, their satirical newsjack that took a friendly jab at competitor McDonald’s was well received. In this ad, Wendy’s comically questioned whether any of the planned McDonald’s burger modifications would actually improve the taste. Image Source: FacebookWhile not all companies could get away with this type of banter, this particular newsjack resulted in thousands of reactions, comments, and shares, positively reflecting the company. Southwest and the Football PlayoffsNewsjacking doesn’t always have to involve explicitly sharing news stories. In this Southwest example, the company subtly alluded to the widely renowned football playoffs between the Dallas Cowboys and Seattle Seahawks. Image Source: FacebookWhile this is a quieter and more casual example of newsjacking, the result was still increased engagement among social media users. Aviation Gin & the Controversial Peloton Ad In 2019, the sports equipment manufacturer Peloton received widespread backlash and criticism for a poorly judged ad campaign in which a husband gifts his wife an exercise bike. However, amidst the media storm, alcoholic beverages producer Aviation Gin spotted an excellent newsjacking opportunity, hiring Monica Ruiz — the actress from the Peloton ad — to appear in their own spot.The company — owned by actor Ryan Reynolds — is renowned for its humorous marketing campaigns, and the ad subtly mocked both the original ad and the negative message it was conveying. As a result, it received media and public acclaim while staying brand consistent, timely (Ruiz was hired just two days after the Peloton ad aired), and positive.Oreos and Area 51Newsjacking is often directed toward internet trends but requires being ahead of the game. Certain online fads only last for weeks or even days; if you're late to join in, you won't be able to make a positive impact.Some brands are better at this than others; for instance, Oreo — the original newsjackers — was quick to execute a successful bit during 2019’s proposed “invasion” of Area 51 in the US.Image Source: XDunkin’ and the Blue and Gold DressDunkin’ (formerly Dunkin’ Donuts) also nailed this approach in 2015, successfully piggybacking on the furor over a picture of a dress that appeared blue to some viewers and gold to others.Image Source: XNewsjacking internet trends can be hugely successful, especially if you can seamlessly connect them to your products.Calm and the 2020 US ElectionMany brands attempted to wade into the 2020 US presidential election, with some seeing more favorable results than others. Meditation app Calm was undeniably one of the big winners, largely due to its sponsor spots on CNN’s rolling coverage.Image Source: FacebookThe spots — which featured 30 seconds of relaxing visual experiences, such as rain cascading on leaves — were perfectly placed as a counterpoint to the noise, stress, and anxiety around the election itself, with the brand perfectly capturing the mood and sentiment of its audience. App downloads soared after the election, generating a great return for the company.Final ThoughtsAs we have seen, using current events to promote your brand can be a smart and cost-effective way to get more people to notice your brand, visit your website, and potentially become customers. However, doing this without careful thought can hurt your brand's image. As we wrap up, remember that newsjacking can make your brand more relevant and engaging. But you should always keep these tips in mind: Find relevant stories Research your angle Be timely but accurate Be ethical Share on an appropriate channelTo find the next trending story in your niche, the TrendFeed app or Topic Research Tool are excellent places to start.",
  "headers": [
    {
      "level": "H1",
      "text": "What Is Newsjacking? 10 Powerful Examples + a How-to Guide"
    },
    {
      "level": "H2",
      "text": "What Is Newsjacking?"
    },
    {
      "level": "H2",
      "text": "Why Newsjack?"
    },
    {
      "level": "H2",
      "text": "How to Newsjack"
    },
    {
      "level": "H3",
      "text": "1. Find Relevant Stories"
    },
    {
      "level": "H3",
      "text": "2. Research Your Angle and Your Keywords"
    },
    {
      "level": "H3",
      "text": "3. Be Quick, but Be Accurate"
    },
    {
      "level": "H3",
      "text": "4. Be Ethical, Don’t Capitalize on Disasters or Tragedies"
    },
    {
      "level": "H3",
      "text": "5. Choose the Most Appropriate Distribution Channels"
    },
    {
      "level": "H2",
      "text": "Top Newsjacking Examples"
    },
    {
      "level": "H3",
      "text": "Wendy’s and McDonald’s"
    },
    {
      "level": "H3",
      "text": "Southwest and the Football Playoffs"
    },
    {
      "level": "H3",
      "text": "Aviation Gin & the Controversial Peloton Ad"
    },
    {
      "level": "H3",
      "text": "Oreos and Area 51"
    },
    {
      "level": "H3",
      "text": "Dunkin’ and the Blue and Gold Dress"
    },
    {
      "level": "H3",
      "text": "Calm and the 2020 US Election"
    },
    {
      "level": "H2",
      "text": "Final Thoughts"
    },
    {
      "level": "H6",
      "text": "Most popular pages"
    },
    {
      "level": "H6",
      "text": "SEO Checklist: 41 Tips to Optimize Your Website"
    },
    {
      "level": "H6",
      "text": "How to Perform a Complete SEO Audit (in 14 Steps)"
    },
    {
      "level": "H6",
      "text": "A Beginner’s Guide to Keyword Search Volume"
    }
  ],
  "author": ""
}