{
  "url": "https://www.semrush.com/blog/how-to-disavow/",
  "slug": "how-to-disavow",
  "title": "How to Disavow Links: A Guide",
  "description": "Wondering if a link needs to be disavowed? See the steps to disavowing in Google Search Console and Google’s official stance on the subject, as well as some insights you need.",
  "content": "When it comes to building a strong website, backlinks are one of the most important factors. However, that contributes to the general sense of uncertainty that surrounds the managing of backlinks. Forget the discussion over the ethics of acquiring backlinks—what about getting rid of them? Should the average SEO be concerned with disavowing links?Unlike some other topics, Google has been quite forthcoming on their backlink disavowal views and its place in your search engine optimization toolbox. Let’s examine why you might want to disavow a link and how to do it.Why Disavow Links?The only Google-prescribed use case for link disavowal is to address penalties levied against your web property. If you receive a message from Google about “unnatural links,” you are being penalized whether you are knowingly complicit or not.Part of being a webmaster is addressing Google penalties as they come up. That shouldn’t be an issue if you stick to white hat SEO, but knowing how to keep a clean backlink profile is vital to your long term SEO strategy.To make your life a bit easier, Semrush offers tools to manage the whole process of disavowing links from end-to-end. You can integrate your Google Analytics and Search Console with Semrush's Backlinks Audit Tool. This way, you get more accurate backlink data.What Is a Bad Backlink?The vast majority of organic backlinks are “good backlinks”—they represent the ideal internet that Google is striving for, one where good content is referenced frequently and freely. Most of them won’t really move the needle for your site, but they are slowly building your reputation as a trustworthy, authoritative resource.“Bad backlinks,” on the other hand, are almost always inorganic (though there are exceptions). Two of the biggest offenders are links that can be purchased en masse from shady SEO sites and intentional backlinking schemes utilizing a private backlink network (PBN). Here are Google’s guidelines on “link schemes.”It is also possible to “organically” receive a link from one of those ultra spammy-looking sites that are just lists of products and links with no real content. The link probably wasn’t placed by a human, and it is certainly not benefitting your site, so those are safe to remove as well.Check out this guide: Backlink Analysis: How to Spot Quality and Toxic Backlinks Negative SEO AttackBad backlinks are also the subject of a particularly unscrupulous strategy called a Negative SEO Attack. At this point, everyone with the barest knowledge of SEO knows not to purchase hundreds or thousands of backlinks as it will certainly lead to a penalty on your site. Instead, you can attack your competitors by purchasing all of those backlinks and pointing them at your rival’s domain, ensuring they get penalized.The only recourse for a victim of a negative SEO attack is to disavow all of the links that targeted their site.When to Disavow Links?If it isn’t already clear, disavowing backlinks isn’t something you do on a whim. It is a fairly serious action that can significantly impact your search ranking, for better or for worse. In general, you should only disavow a link that you know for sure is bringing you down. Check the Google Quality Guidelines for a more exhaustive list.Note that a link from a low-traffic or low domain authority site is not a bad link. It probably won’t contribute much individually, but every link is a vote of confidence in your site that Google takes into account.What Happens When You Disavow a Backlink?So what exactly does a link disavow do? It is a request for Google to ignore those links to your domain. If the link disavow is successful, it won’t be counted for or against you when determining ranking in the search results.Google is not obligated to honor your request for link disavowal; they specifically say in their documentation that submitting the disavow file is a “suggestion.”However, in the same material, they describe it as a tool to fix bad linking practices or undo the work of a poor SEO you hired, so you can expect them to honor the link disavow instead of being punitive.Is it possible to undo a link disavow? Yes, probably. It is definitely possible to delete a disavow file you previously uploaded, but it is not clear whether Google holds on to a copy of the list or whether they immediately reinstate the links and their influence on your ranking. For this reason, experimenting with link disavowal to manipulate search rankings is a bad idea.How to Disavow Links in Google Search ConsoleEveryone that has a Google Analytics tracking tag on their website also has access to Google’s Search Console tool, which houses information on the linking structure of the site. You can conduct a link audit from the Link Report page of Search Console. Just click the big “Export External Links” button on the top right of the screen and choose “More Sample Links.” Export it as the file type of your choice.You can use the Semrush Backlink Audit Tool to identify the links you want to disavow and create a text file (*.txt) to be submitted to the Google Disavow Tool.However, if you're doing it on your own, there’s a very specific format you need to follow, but it’s simple enough: Each entry needs to be on a different line Each entry needs to begin with “domain:” (without the quotation marks) The filename is unimportant. Following these rules, here are a few example entries you might find in a typical list: domain:spammysite.com domain:niche.pbn.com domain:blackhat.com/link-to-my-site Blacklisting the entire domain will save you the tedium of listing each URL specifically. Besides, there are few instances in which you would want to disavow a single link from a site but still allow other links from that domain. Head over to the Google Disavow Tool and click through all of the warning prompts until you reach the dialogue box that allows you to browse your folders and choose a file to upload.If you have multiple accounts, be sure to select the correct property.Then, select the disavow file you already created, and select 'Open' to upload it to the disavow tool. Within the next day or so, Google will no longer take the listed domains into account when determining your pages' ranking.To quickly summarize, here are the steps to use the Google Disavow Tool: Step 1: Define which links you want to disavow. Step 2: Create your list of links to disavow. Separate by URL and/or by domain. Step 3: Upload your disavow list as a .txt file to the Google Disavow Tool. Disavow Links Quickly and Easily with SemrushThe above process sounds pretty simple until you realize that we skipped the hard part—identifying the bad backlinks.We know the signs of a bad backlink, but Google only serves you a list of domains and how many times they linked to you when you run the external link report. There’s no information that would help you determine whether or not the link is worth keeping. The only way to know is to check out each domain yourself, which’s simply not feasible for most sites. Even a small site will accumulate thousands of backlinks after a few years. Even if you spot the obvious spam sites, it could be near impossible to know if a site is part of a PBN or is otherwise disliked by Google.That is where Semrush’s Backlink Audit tool comes in.I use the Backlink Audit tool to get a list of all of the potentially toxic backlinks (along with an estimation of how bad they might be). Mine is set up to deliver a weekly report on new links so I can quickly spot and remove any backlink that looks particularly bad.Semrush’s Backlink Audit tool lets me easily round up all of the suspect backlinks and export them to the disavow list. There I can choose whether to blacklist the specific URLs or the entire domain before exporting it to a preformatted .txt file, ready to upload to Google’s Disavow Tool.Now that you know how to use Google's Disavow Tool, it’s important to monitor your backlink profile and only disavow links that you need to remove. With this guide, you're on your way to improving your website!",
  "headers": [
    {
      "level": "H1",
      "text": "How to Disavow Links"
    },
    {
      "level": "H2",
      "text": "Why Disavow Links?"
    },
    {
      "level": "H3",
      "text": "What Is a Bad Backlink?"
    },
    {
      "level": "H3",
      "text": "When to Disavow Links?"
    },
    {
      "level": "H3",
      "text": "What Happens When You Disavow a Backlink?"
    },
    {
      "level": "H2",
      "text": "How to Disavow Links in Google Search Console"
    },
    {
      "level": "H2",
      "text": "Disavow Links Quickly and Easily with Semrush"
    },
    {
      "level": "H6",
      "text": "Most popular pages"
    },
    {
      "level": "H6",
      "text": "SEO Checklist: 41 Tips to Optimize Your Website"
    },
    {
      "level": "H6",
      "text": "How to Perform a Complete SEO Audit (in 14 Steps)"
    },
    {
      "level": "H6",
      "text": "A Beginner’s Guide to Keyword Search Volume"
    }
  ],
  "author": ""
}