{
  "url": "https://www.semrush.com/blog/instagram-seo/",
  "slug": "instagram-seo",
  "title": "6 Instagram SEO Tips to Increase Your Reach",
  "description": "Wondering if Instagram SEO is worth your time? Find out the answer and six tips to boost your visibility.",
  "content": "Search engine optimization (SEO) techniques help your content rank higher on Google, Bing, and Yahoo. But they can also help your Instagram profile appear higher in the app’s search results.In this article, we’ll look at how Instagram ranks profiles and content. Plus, we’ll walk through six ways to boost your overall visibility on the platform.What Is Instagram SEO?Instagram SEO is the process of optimizing your account and content to rank higher in Instagram’s search results. Doing so can help increase your reach and drive more followers and conversions to your account.You can’t convert people into customers if they can’t find you. Instagram SEO can give your brand more visibility if you know how to leverage it.When someone types a search query into Instagram, SEO tactics help your posts appear in the top results. This can include the content you make, but also audio, tags, and places associated with it.The “top” content is what Instagram considers the most relevant to the search term. You need to optimize all parts of your profile and anything you post, from your Instagram bio to minor details in your content.While Instagram SEO has some similarities to regular SEO, it’s also platform-specific and very different from Google. Why Should You Use SEO on Instagram?Instagram SEO connects you with people actively searching for content related to your business. It can help you build an engaged following of prospective customers who are more likely to convert.Another reason to care about Instagram SEO? Social media isn’t going away anytime soon. Instagram has over 2 billion monthly active users you can tap into. Studies show that Instagram users want to engage with brands as part of their experience.And according to Instagram, there are over 200 million business accounts that users visit every day. Here’s what our account looks like:About 50% of Instagram users say they discover new brands, products, and services on the platform. Some 44% of users also buy products on the platform weekly using tags and the Shop feature.Many users see Instagram to discover businesses, brands, services, and products. And that’s why it’s important to be as visible on the platform as possible.Top Instagram Ranking Factors to ConsiderThe top three Instagram ranking factors that apply to marketers are search text, user activity, and popularity signals.The platform says there isn’t one Instagram algorithm. Instead, there’s a personalized set of classifiers and processes for each user.Instagram tailors content based on how people use the app: Feed and Stories: Recent posts from friends and family you follow Explore: Content discovery and recommendations from accounts you don’t follow Reels: Entertaining content, mostly from accounts you don’t follow Search: Relevant content found by typing in specific search termsNow let’s look at how the platform decides which content users see first when browsing.Search TextLike regular SEO, search text—the text a user types into the search bar—is the most important ranking factor on Instagram.The search function is the primary way to navigate content on Instagram. When people use it, the search query they type shows specific intent.The platform will also recommend phrases to get users started:Based on the terms used, the Instagram search engine will find relevant bios, captions, hashtags, and even usernames it thinks match the intent.Hashtags used to be the main way users found new content. But one recent study from Hootsuite found keyword-rich captions got 30% more reach and twice as many likes as hashtags.That doesn’t mean you should stop using hashtags (we’ll get to why soon), but using Instagram SEO to optimize all your content is key to better reach.User ActivityInstagram’s algorithms pay attention to content and accounts users have engaged with recently. This helps the platform understand which posts are relevant to specific audiences.If users watch a lot of fitness-related content, Instagram will probably recommend fitness influencer accounts:The platform also determines the link between the content creator and the viewer. If a user follows your business page or they’ve commented in the past, it’s more likely they’ll see your content in their feed.Having mutual connections also has a big impact on visibility. Friends of people who follow your business will see your profile ranked higher than others in search results. This makes it easier for people in your target audience to find you. Popularity SignalsInstagram will boost content that is trending in popularity. This means more people will see it, even if it doesn’t exactly follow their usual content history.For example, this post from Tom Holland recreating the famous Spider-Man meme was everywhere in 2022:Instagram also considers information about the person posting content. For example, an influencer who’s had a lot of interaction over the past few weeks will probably rank higher than someone new to the platform.It’s important to note these popularity signals have more impact on the Explore and Reels pages. Individual user preference is weighed more heavily on the Home page.6 Instagram SEO Tactics to Boost Your VisibilityThere isn’t one surefire way to be in the top results on Instagram’s search or recommendations.But these six Instagram SEO tips will help increase your discoverability on the platform.1. Use Specific Keywords to Help Your Instagram SEO RankingEvery time an Instagram user searches for a keyword related to your business, you have a chance to drive high-quality traffic to your profile.Your Instagram SEO strategy needs to use keywords just like any other effective content marketing strategy.According to Instagram CEO Adam Mosseri, when the site is indexing content, it looks at four things to make sense of a profile: Your handle Your profile name Your bio Your captionsThose are prime spots for including keywords relevant to your audience.Your handle will likely be your brand name, but you can use your profile name and bio to include keywords that apply to you.For example, if you type in “interior decorating,” you’ll see the top accounts have those keywords (or related versions) in their handles, profile names, and bios.Another Instagram marketing tip for your bio is adding location tags alongside keywords. That is especially important for location-specific small businesses.Only business accounts can add tags, but it makes it easier for people in your area to find you. Your captions also need to be descriptive and use target keywords. Use them to write engaging content to entice new followers while providing value for your current audience.Not sure which keywords to use? Semrush’s Keyword Magic Tool can help you figure out what your audience is searching for from a database of 24 billion keywords.If you sell dog accessories, for example, you can type “dog accessories” into the tool to get a list of relevant keywords. The “Volume” column shows you how many people are searching for these terms on Google. The “Trend” column also shows how the level of interest changes over time (e.g., if it’s seasonal).Remember that search text is Instagram’s most important ranking factor. So make the most of it by using keywords throughout your account and content.2. Use 3-5 Relevant Hashtags in Your CaptionsTactical use of keywords results in better reach. But Instagram recommends you also use hashtags in your captions to help the platform understand the context of your content.Mosseri says hashtags will not significantly change your reach. But it’s still good practice to use them. One study analyzed over 75 million Instagram posts and confirmed hashtags don’t directly increase post views.However, hashtags help Instagram’s algorithms understand content and make it more discoverable for users. According to a post from Instagram's creator community, Instagram captions with relevant hashtags add context to your post. It’s important to strike a balance, however. As Mosseri says in the above video, “don’t do a ton” of hashtags. They won’t help and can look spammy.Here’s an example of what not to do:With that in mind, here are four tips for using Instagram hashtags meaningfully: Use hashtags relevant to your target audience Only use 3-5 per post (more than that won’t positively affect reach) Mix well-known and niche hashtags to broaden your discoverability Use them in your caption (not as a comment)The caption vs. comments argument for hashtags has been going on for as long as Instagram has existed. But even Mosseri uses them in his captions:3. Avoid Watermarks and Logos on Instagram ReelsInstagram is cracking down on users who recycle their content from other social media platforms. Mosseri says Instagram will recommend Reels with watermarks and logos to users less often than ones without. That’s especially relevant given the rise of TikTok and the rivalry between the apps. For example, here’s what a TikTok video shared on Instagram looks like:They’re usually lower quality and always have the TikTok logo and user’s handle somewhere on the screen.An Instagram spokesperson said in 2021 that the platform would deemphasize watermarked content in recommendations. Mosseri confirmed that using third-party tools to post a video is still allowed. But any type of logo superimposed onto content will cause it to be down-ranked.To avoid being penalized, upload your content directly to Instagram rather than copying from another social media platform. 4. Leverage Instagram Alt TextWriting keyword-rich alt text (alternative text) can help improve the performance of your posts.Just like keywords in your profile and captions, Instagram uses this text to understand what an image is about and serve it to relevant users. Alt text is used to describe your images and videos for people who use a screen reader to access Instagram. Including detailed descriptions helps with accessibility, and relevant keywords can help your SEO efforts.To add alt text to the next photo you post, after you write a caption scroll down and select “Advanced settings.”Under Accessibility, click “Write alt text,” then add a photo description. Incorporate relevant keywords if they fit naturally.Once you’re finished, click “Done.”Photo IDs do the same thing as alt text, but you include them as part of your captions (usually at the bottom). Rather than using your alt text again, find another way of describing the image and use keywords here too.Here’s an example of Porter Airlines using a photo ID:You should include both alt text and photo IDs wherever possible. Here are six tips to make the most of your alt text and photo IDs: Include your keywords they fit naturally (don’t force them) Be descriptive but clear Make sure the description is relevant to the image Quote any text that’s within the image (e.g., if there’s a sign or an overlay) Cut intro words like “a photo of” or “a video of” Aim for under 100 characters5. Find the Right Days and Times to PostAudience interaction is a significant ranking factor on Instagram. Posting when your followers are most active will boost your organic reach and engagement.According to original research by CoSchedule, the best times, hours, and days for B2C businesses to post on Instagram are the following (in order): Top five best times: 9:01 am, 7:59 pm, 9:00 am, 8:00 pm, and 7:59 pm Top five best hours: 9:00 am, 8:00 am, 10:00 am, 12:00 pm, and 3:00 pm Worst five hours: 2:00 am, 3:00 am, 4:00 am, 11:00 pm, and 5:00 am Top three best days: Wednesdays, Fridays, and Tuesdays Top three worst days: Sundays, Saturdays, and ThursdaysThe times for B2B are similar—most activity happens around lunch or after work.This is a starting point, not an exact formula. Luckily, you can use Semrush Social to remove the guesswork and get the results you want. The Social Analytics tool shows how followers interact with your posts, and what time they’re online.This tool also tells you more about your audience’s demographics, so you can cater content to them. In Social Tracker, you can benchmark your performance against competitors. You can find their follower counts, posting schedules, and engagement stats like hashtag use, and then use similar tactics for your account. With Social Poster, you have access to an interactive calendar to plan out an entire year of Instagram posts.Set the dates and times your audience is active, create drafts, and build a schedule of great content for your account.Mosseri suggests two feed posts per week and two stories per day is ideal for building a following. But you may find that more (or less) works for your audience.Posting valuable Instagram content consistently (and at the right times) is crucial for successful social media management.6. Encourage Engagement by Engaging YourselfEngaging with other accounts in your niche helps Instagram understand where yours fits in.Similarly, engaging with your target audience encourages them to engage back, which helps with popularity signals.Engagement is one of the most significant ranking factors for Instagram. And sticking to a niche is one of the best ways to build a dedicated following.Micro- and nano-influencers are accounts with less than 60,000 and 10,000 followers, respectively. But they have much higher engagement rates because they have a more personal connection with their followers.One study found nano-influencers have high engagement rates—an average of 6%. That’s 6 times the rate of macro-influencers.That proves more followers aren’t always necessary for better business. A small number of loyal customers can result in more consistent conversions.That’s why you should encourage all kinds of engagement on your posts—including comments, saves, likes, and shares—to build up a community.Here are a few tips to help improve your engagement rate: Research your target audience so you create the type of social media content they like Create relatable memes and graphics that have potential for sharing Ask questions in your captions and ask people to share their answers Host giveaways or competitions with relevant prizes for a spike in engagement Track your content’s reach and engagement rate to figure out what resonates and create similar postsAn important part of increasing engagement is making sure you reply to people who engage with your content. You can use the Social Media Toolkit to help you keep track of new comments and messages and reply quickly.Use Instagram SEO to Grow Your BusinessRemember, SEO for Instagram isn’t a quick fix for reach and engagement. It’s a long-term strategy, but these best practices will get you started.Instagram is always updating its algorithms, which means things will evolve. Luckily, the platform is upfront about updates.To further expand your reach and engagement, consider a multi-channel approach. Social Poster allows you to seamlessly publish content to both TikTok and Instagram, enabling you to repurpose engaging TikToks as Reels and tap into a wider audience.Consistency is key with Instagram SEO. Social Content AI can help you create captivating Instagram visuals at scale that keep your feed ‘alive’ and enhance your brand's presence.Want to get ahead of the next update?Sign up for a free Semrush account to find the best keywords for your Instagram SEO strategy today.",
  "headers": [
    {
      "level": "H1",
      "text": "6 Instagram SEO Tips to Increase Your Reach"
    },
    {
      "level": "H2",
      "text": "What Is Instagram SEO?"
    },
    {
      "level": "H2",
      "text": "Why Should You Use SEO on Instagram?"
    },
    {
      "level": "H2",
      "text": "Top Instagram Ranking Factors to Consider"
    },
    {
      "level": "H3",
      "text": "Search Text"
    },
    {
      "level": "H3",
      "text": "User Activity"
    },
    {
      "level": "H3",
      "text": "Popularity Signals"
    },
    {
      "level": "H2",
      "text": "6 Instagram SEO Tactics to Boost Your Visibility"
    },
    {
      "level": "H3",
      "text": "1. Use Specific Keywords to Help Your Instagram SEO Ranking"
    },
    {
      "level": "H3",
      "text": "2. Use 3-5 Relevant Hashtags in Your Captions"
    },
    {
      "level": "H3",
      "text": "3. Avoid Watermarks and Logos on Instagram Reels"
    },
    {
      "level": "H3",
      "text": "4. Leverage Instagram Alt Text"
    },
    {
      "level": "H3",
      "text": "5. Find the Right Days and Times to Post"
    },
    {
      "level": "H3",
      "text": "6. Encourage Engagement by Engaging Yourself"
    },
    {
      "level": "H2",
      "text": "Use Instagram SEO to Grow Your Business"
    }
  ],
  "author": ""
}