{
  "url": "https://www.semrush.com/blog/internal-linking-mistakes/",
  "slug": "internal-linking-mistakes",
  "title": "11 Common Internal Linking Mistakes & How to Fix Them",
  "description": "Learn about common internal linking mistakes. And how to find, fix, and prevent them.",
  "content": "Internal links direct users and search engine bots to different pages on the same website. So they can be great for your SEO.But internal linking mistakes—like broken links or orphan pages—can undermine your site’s SEO and hurt the user experience (UX).In this article, you’ll learn about 11 of the most common internal linking mistakes and how to address them.But let’s start with why you should fix internal link issues in the first place. Why Is Fixing Internal Linking Mistakes Important?Fixing internal linking mistakes can benefit you in three main ways.Let’s take a closer look at how effective internal linking improves your site’s health and SEO performance:It Helps Search Engines Understand Your Site StructureInternal links are like road signs that show Google how your site is organized. This is known as your website structure.When you have internal linking errors, Google can get confused. And struggle to find pages or figure out how they relate to one another. This can lead to some pages not getting crawled or indexed properly, which could hurt your website's visibility and rankings in search results. On the other hand, a robust internal linking structure makes it easy for Google bots to understand your website architecture, discover new pages, and effectively distribute page authority throughout your site. It Improves the User ExperienceSpotting and addressing internal linking mistakes ensures a better user experience. Because visitors to your site can find relevant content and answers more easily.Let’s say a user finds an informational guide on your blog about gardening tips. This makes it easier for them to get a comprehensive understanding of the topic. So, they’re more likely to stay on your site and complete. And may even take a desired action, like making a purchase or signing up for a newsletter.It Helps Pass Link EquityLink equity (or link juice) is the value and authority that a link passes from one webpage to another on. By passing authority to other pages, internal links help distribute ranking power throughout your website. Which can improve rankings.Here’s a visual representation of how the process looks:Further reading: Internal Links: Ultimate Guide + StrategiesHow to Find & Fix 11 Common Internal Linking MistakesHere are 11 of the most common internal linking mistakes. And how to discover and fix them:Internal Linking Mistake #1: Broken Internal LinksBroken links point to pages that can’t be found or no longer exist. This can happen because of a malformed or mistyped URL. Or because the linked page has been deleted, moved to a different location, or renamed.When you click on a broken link, you might see an error message like \"404 Page Not Found.\" Or a custom page like this:Broken links affect the flow of link equity throughout your site, which can negatively impact rankings. How to Fix ItUse Semrush’s Site Audit tool to check for broken links.To get started, follow the configuration guide and click “Start Audit.”When your audit is ready, you’ll see an “Overview” dashboard like this one:To find more information on your internal links, click on “View details” in the “Internal Linking” module under “Thematic Reports.”You can find broken links under the “Errors” section. If there are any issues, click on the “# Issues” button.You’ll then see a list of the affected URLs. Like this:To fix the issue, first check if the link’s URL is correct. If not, you can adjust the issue (like a typo).For ones that are correct but broken, either remove them or replace them with links that point to live pages.Further reading: How to Find and Fix Broken Links with SemrushInternal Linking Mistake #2: Too Many On-Page LinksToo many links can make your page seem spammy and cluttered. Which can overwhelm your users and cause them to leave. Overdoing links also makes it harder for search engines to understand your site structure and the hierarchy of your pages. Meaning it’s more difficult for Google to crawl and index your site.This can lead to lower (or no) visibility in search results and reduced organic traffic.How to Fix ItSemrush’s Site Audit tool triggers this issue for pages with over 3,000 links.So, make sure to address any pages that have this issue.And use internal links strategically and thoughtfully. By thinking about what’s most important for your audience. This will help visitors and search engines navigate your site better.Internal Linking Mistake #3: Redirect Chains and LoopsA redirect is a way to send website visitors and search engines to a URL or webpage different from the one they initially requested. It's like rerouting traffic to a new destination.Setting up redirects from one page to another can be useful. But when done incorrectly, it seriously damages the user experience and can negatively affect your rankings. For example, if an internal link leads to page that redirects to another redirect, it creates a chain. Here’s what that looks like:Long redirect chains can slow down your site and waste crawling resources. Which can cause crawlability and indexability issues.Sometimes, that chain can end up looping on itself. For example, if URL X redirects to URL Y and URL Y redirects to URL X. This confuses search engine bots and provides a poor user experience because it won’t direct to a final destination. And you definitely don't want to amplify those problems by including internal links to them within your content.How to Fix ItYou can identify redirect chains and loops with Site Audit. Just click the “Issues” tab and look for a “# redirect chains and loops” error.Fix redirect chains by linking straight to destination pages. For redirect loops, make sure that the links go directly from the starting page to the destination page—without going around in circles. Internal Linking Mistake #4: Misuse of Temporary RedirectsTemporary redirects (such as 302 redirects) instruct search engine bots to keep the link value of the original page while temporarily pointing to a different one. Because the original will be restored soon. This is a short-term solution for temporary content relocation and website maintenance.But including internal links to temporary redirects won’t pass any link juice to the new page. Which can damage your page’s rankings if you use this type of redirect by mistake. How to Fix ItYou can find out if you’re having any issues with temporary redirects in Site Audit under the “Issues” tab. Just enter “temporary” in the search bar.If you have any links to temporary redirects, change them to permanent pages whenever possible.Internal Linking Mistake #5: Overuse of Permanent RedirectsPermanent redirects (like 301 redirects and 308 permanent redirects) tell search engines that a page has been permanently moved to a new location.They instruct search engines to remove the old page from the index. And help pass authority to the new page. This is useful in many cases. Like if you’ve changed your website’s architecture.But any redirect consumes crawl budget—the amount of time and resources Google will devote to crawling your pages before moving on.If your crawl budget is wasted on “hopping” from redirect to redirect because you haven’t updated your internal links to point to the correct pages, search engine bots can stop crawling your website before they get to all of your important pages. This can be especially problematic if you’ll need to use substantially more redirects in the future. For example, to migrate your site.How to Fix ItWe recommend keeping the number of redirects to a reasonable minimum. Review all URLs with a permanent redirect (which you can view in Site Audit), and change internal links to them to a target page URL when possible.Internal Linking Mistake #6: Nofollow Attributes in Internal LinksThe rel=\"nofollow\" attribute tells search engine bots not to follow specific links or pass link equity. Here’s an example of what a nofollow link looks like in HTML:<a href=\"https://example.com\" rel=\"nofollow\">Example Link</a>There are cases when this attribute comes in handy. Like when you’re linking to an external site you don’t necessarily endorse.But for the most part, using the nofollow attribute for internal links isn’t the best idea. There are better options for preventing certain pages on your site from being crawled and indexed.How to Fix ItYou can find internal nofollow links under the “Warnings” section of your “Internal Linking” report in the Site Audit tool.Generally, you’ll want to remove the nofollow attribute from internal links to avoid withholding authority that those links could provide to the linked pages.If your intention is to block certain pages from indexing, you’re better off using the meta robots “noindex” value. Internal Linking Mistake #7: Orphan PagesAn orphan page is a webpage that has no incoming internal links. Here’s a visual representation:Orphan pages are isolated from the rest of the website's content. Making it harder for users to find them.They’re also challenging for search engines to discover and index. How to Fix ItHead to the Site Audit tool. Then, find orphan pages under the “Notices” section of your “Internal Linking” report.Make sure every page within your website—especially those with useful content—is connected to other pages through internal links.Further reading: Orphan Pages: How They Affect SEO (and How to Fix Them)Internal Linking Mistake #8: Pages with Too Few Incoming Internal LinksPages without enough relevant internal links pointing to them signal to search engines that they may not be important. This affects the overall visibility of a page and how well it ranks.Both users and search engine bots also have a hard time finding pages that aren’t well-connected to the rest of your site’s content. How to Fix ItCheck the “Internal Linking” report in the Site Audit tool for these pages. Look for “Pages with only one internal link” in the “Notices” section.Then, find related pages on your site and add some links pointing to pages with too few internal links.Pro tipYou can use Semrush’s Backlink Gap alongside Site Audit to uncover opportunities to gain links from other sites that point to your site. This way, you can enhance both your internal and external link profiles for a more well-rounded link building strategy.Internal Linking Mistake #9: Excessive Crawl DepthCrawl depth is the number of clicks it takes to reach a page from your site’s homepage. The more clicks there are, the harder it is for crawlers and users to reach the page. That’s why having important pages more than three or so clicks away from the homepage hurts your SEO and UX.How to Fix ItLook for “Page Crawl Depth more than 3 clicks” under the “Notices” section of your “Internal Linking” report in the Site Audit tool.Then, click the “# Issues” button to find out which pages are affected.Make sure your most important pages can be reached within three clicks. For other pages that are buried deep within your site architecture, try linking to them more directly from relevant content.Internal Linking Mistake #10: Misuse of Anchor TextAnchor text is a clickable text in a hyperlink that guides users and search engines to other pages.For example:Relevant and descriptive anchor text can improve UX. Because it makes navigation more intuitive and efficient by clearly indicating what the user can expect to see if they click through to the page.It’s also easier for search engine bots to understand what pages are about and how they relate to each other. But that also means improper anchor text can be detrimental.Here are some possible mistakes you might be making with anchor text for your internal links: Keyword stuffing: Filling anchor text with too many keywords, especially if they don’t fit naturally makes links seem artificial and spammy Non-descriptive anchor text: Using vague phrases like “click here” or “read more” don’t give users or search engines a clear idea about the target page Forced and unnatural wording: Crafting anchor text that’s awkward, out of place, or grammatically incorrect just to include certain keywords won’t do you any favors Links with no anchor text: Embedding links without any text makes it harder to understand what the target page is about and is also less visually appealingHow to Fix ItIn Site Audit, head over to the “Issues” tab.Next, enter “anchor” in the search bar to filter the issues by anchor text mistakes. You’ll likely notice two main issues here: “# links on this page have no anchor text” “# links have non-descriptive anchor text”Click on each of these links to see a list of the affected pages. And add or edit succinct, descriptive anchor text to address the problems.Internal Linking Mistake #11: Irrelevant LinksFrom a UX point of view, the purpose of internal links is to add depth and additional resources to your narrative.But when a link leads to an unrelated page, it breaks the natural flow of the user journey. For example, imagine you’re reading an article on improving website health and click on a link with the anchor text “SEO optimization.” But you’re then taken to a page about artificial intelligence statistics.This abrupt shift in topic is confusing and irritating. Some users might even leave the site altogether.And remember that search engines use links to understand the relationship between pages on your site.This means links to random pages can send mixed signals. And harm your site's visibility.How to Fix ItStart by auditing your existing internal links. Make sure they’re relevant to the topic of the page and add value for the users, whether it's to provide further details on a subject, support a claim made in your content, or guide people to related pages.If you find any irrelevant links, consider removing them or replacing them with more appropriate ones.Here are some other tips for future linking: Define clear linking guidelines and ensure each link has a clear purpose Always align links with user intent so each click brings them closer to what they’re looking for Regularly review and update content to ensure the links are still relevant and usefulFAQs about Internal LinkingHow Many Internal Links Should You Include per Page?The number of internal links per page for SEO depends on the content and the structure of your website. There isn't a specific number that applies universally. Instead, focus on providing relevant and helpful internal links that enhance the user experience.Which Pages Should You Link to?When deciding which pages on your website to link to, consider the following: Relevance: Link to pages that are directly related to the content on the current page Hierarchy: Prioritize linking to important pages like key category pages or content hubs Supporting content: Link to supporting content that provides more in-depth information on a particular topic High-traffic pages: Identify high-traffic pages on your website and use them as hubs to link to other relevant pagesHow Do You Keep Track of Your Internal Links?Use Semrush’s Site Audit to analyze your internal linking performance. For an in-depth analysis of your most important pages, you can also use Semrush’s On Page SEO Checker for improvement suggestions on: Strategy Backlinks User experience SERP features Semantic keywordsAnd more.",
  "headers": [
    {
      "level": "H1",
      "text": "11 Common Internal Linking Mistakes & How to Fix Them"
    },
    {
      "level": "H2",
      "text": "Why Is Fixing Internal Linking Mistakes Important?"
    },
    {
      "level": "H3",
      "text": "It Helps Search Engines Understand Your Site Structure"
    },
    {
      "level": "H3",
      "text": "It Improves the User Experience"
    },
    {
      "level": "H3",
      "text": "It Helps Pass Link Equity"
    },
    {
      "level": "H2",
      "text": "How to Find & Fix 11 Common Internal Linking Mistakes"
    },
    {
      "level": "H2",
      "text": "Internal Linking Mistake #1: Broken Internal Links"
    },
    {
      "level": "H3",
      "text": "How to Fix It"
    },
    {
      "level": "H2",
      "text": "Internal Linking Mistake #2: Too Many On-Page Links"
    },
    {
      "level": "H3",
      "text": "How to Fix It"
    },
    {
      "level": "H2",
      "text": "Internal Linking Mistake #3: Redirect Chains and Loops"
    },
    {
      "level": "H3",
      "text": "How to Fix It"
    },
    {
      "level": "H2",
      "text": "Internal Linking Mistake #4: Misuse of Temporary Redirects"
    },
    {
      "level": "H3",
      "text": "How to Fix It"
    },
    {
      "level": "H2",
      "text": "Internal Linking Mistake #5: Overuse of Permanent Redirects"
    },
    {
      "level": "H3",
      "text": "How to Fix It"
    },
    {
      "level": "H2",
      "text": "Internal Linking Mistake #6: Nofollow Attributes in Internal Links"
    },
    {
      "level": "H3",
      "text": "How to Fix It"
    },
    {
      "level": "H2",
      "text": "Internal Linking Mistake #7: Orphan Pages"
    },
    {
      "level": "H3",
      "text": "How to Fix It"
    },
    {
      "level": "H2",
      "text": "Internal Linking Mistake #8: Pages with Too Few Incoming Internal Links"
    },
    {
      "level": "H3",
      "text": "How to Fix It"
    },
    {
      "level": "H2",
      "text": "Internal Linking Mistake #9: Excessive Crawl Depth"
    },
    {
      "level": "H3",
      "text": "How to Fix It"
    },
    {
      "level": "H2",
      "text": "Internal Linking Mistake #10: Misuse of Anchor Text"
    },
    {
      "level": "H3",
      "text": "How to Fix It"
    },
    {
      "level": "H2",
      "text": "Internal Linking Mistake #11: Irrelevant Links"
    },
    {
      "level": "H3",
      "text": "How to Fix It"
    },
    {
      "level": "H2",
      "text": "FAQs about Internal Linking"
    },
    {
      "level": "H3",
      "text": "How Many Internal Links Should You Include per Page?"
    },
    {
      "level": "H3",
      "text": "Which Pages Should You Link to?"
    },
    {
      "level": "H3",
      "text": "How Do You Keep Track of Your Internal Links?"
    }
  ],
  "author": ""
}