{
  "url": "https://www.semrush.com/blog/international-web-hosting-issues-does-server-location-really-matter/",
  "slug": "international-web-hosting-issues-does-server-location-really-matter",
  "title": "International Web Hosting Issues: Does Server Location Really Matter?",
  "description": "Technical Checklist for Multi-Server Sites. How is the server location connected with top search results? How to choose server location?",
  "content": "Editor's Note: This article is an updated article originally published on June 24th, 2015. Back in 2009, the younger version of Matt Cutts explained: In 2015, Google's John Mueller has come out with a slightly different statement: For search, specifically for geotargeting, the server's location plays a very small role, in many cases it's irrelevant. If you use a ccTLD or a gTLD together with Webmaster Tools, then we'll mainly use the geotargeting from there, regardless of where your server is located. You definitely don't need to host your website in any specific geographic location -- use what works best for you, and give us that information via a ccTLD or Webmaster Tools. OK, John. I'll hold you to that one! Once I'm done with Google, I'll check the results in other search engines as well. So, how is server location connected withtop search results? The research has shown the following: Google Local Domains For Google, local servers are preferred, but are not decisive. This is especially true for local queries where websites hosted locally were preferred in the results. Yandex In Russia, Yandex frequently shows results from different countries, so server location does not matter that much. Naver As I thought, Naver is happy to show any content in Korean that they consider to be high quality or relevant. So again, the server location does not matter greatly. Yahoo! Results from Yahoo! Japan were almost exclusively from Japan, which could indicate that Yahoo prefers locally hosted websites there. Baidu Very few results that appeared on Baidu were websites hosted outside China. Some of the results were from Hong Kong, but the others were almost entirely from Mainland China. So, is server location really important for search engines? For Google, definitely not decisive. Foreign-hosted websites frequently appeared in top results. However, distance of the server definitely plays a role. Out of other search engines, Baidu in China and Yahoo! in Japan showed locally hosted websites more frequently, which indicates server location might be one of their ranking factors. When targeting users in China or Japan, I would recommend having a separate website that runs on a local server. You can read the complete results of the research on my blog. Site Speed Site loading speed is one of the most important ranking factors nowadays. Not only this, but without a doubt, site speedgreatly influences user experience. According to research from April 2014, 47 % of users expect your webpage to load in 2 seconds or less. A website that is hosted on a server located in the UK, but accessed from Amsterdam, Netherlands. See the complete test here: http://tools.pingdom.com/fpt/#!/cHPzd4/www.sock-aid.com … and the same website accessed from New York, USA. See the complete test here: http://tools.pingdom.com/fpt/#!/bMujcU/www.sock-aid.com Apparently, IP location is one of the major factors affecting site speed. In other words, a distant server may slow down the overall user experience by as much as a few seconds. The question remains, what web hosting solution should I choose for my international website to ensure all users worldwide have a good experience while browsing? The IKEA Way: One Fast Server with CDN for Multiple Markets IKEA has gained a strong international online presence by using a single TLD (ikea.com) and subfolders that contain country-specific content. I would recommend this solution to all brands who want to or have already built a strong website with country/language subfolders. You should focus on a host that offers CDN service ( Content Delivery Network) that delivers the content to users based on their geographic data. The principle of CDN (Content Delivery Network). Source: en.wikipedia.org/wiki/Geocast In the case of a single TLD, I would recommend choosing a web hosting provider in the same country as the majority of your customers, or certainly close by. If you want to target users in North America or in its vicinity , a US provider would be the best option. For European users, a provider in the Netherlands or Germany would make the most sense. You should also check other important factors such as server uptime. Find the list of the most reliable CDN providers here: http://www.thetoptens.com/best-content-delivery-network-cdn-providers The Lush Way: One Provider with Multiple Server Locations Lush uses local ccTLDs and builds their brand upon a strong local presence. For this reason, they use a few local hosting providers that ensure the fastest access possible, to please both local users and search engines. A list of some hosts with multiple server locations The Google Way: Servers In Key Markets List of Google data centers. Source: www.google.com Believe it or not, Google has to deal with user experience as well. Even Googlebot has to crawl a huge amount of websites located all over the world. In addition to the map above, they also recently opened a data center in South Korea. Legal Issues Using a US-based hosting provider puts your web presence under the jurisdiction of US law. Laws like the Digital Millennium Copyright Act (DMCA). The DMCA is a wide-reaching law that gives people and organizations who hold copyrights in the US a strong legal hammer to remove any content online that they believe violates their copyright. Businesses operating in China face strong censorship and their websites must not contain topics that are banned by the Chinese government. Additionally, websites hosted in China must firstly obtain an ICP record. When targeting users in China, I therefore recommend placing your website content on a server in Hong Kong. Many European countries are covered under the Electronic Commerce Directive Electronic Commerce Directive. When targeting European users, your website must comply with local regulations and laws. Otherwise it may be taken down by the host based on a court’s order. My recommendation is using a hosting provider in Switzerland. Since there are no laws quite like DCMA, hosting providers must evaluate takedowns more carefully. For further reading about legal issues, check out this article: Internationalizing Your Website’s Server. Which providers do you use for the hosting of your international website? Have you or your users had any difficulties resulting from server distance? Let me know in the comments!",
  "headers": [
    {
      "level": "H1",
      "text": "International Web Hosting Issues: Does Server Location Really Matter?"
    },
    {
      "level": "H2",
      "text": "OK, John. I'll hold you to that one!"
    },
    {
      "level": "H3",
      "text": "Google Local Domains"
    },
    {
      "level": "H3",
      "text": "Yandex"
    },
    {
      "level": "H3",
      "text": "Naver"
    },
    {
      "level": "H3",
      "text": "Yahoo!"
    },
    {
      "level": "H3",
      "text": "Baidu"
    },
    {
      "level": "H2",
      "text": "So, is server location really important for search engines?"
    },
    {
      "level": "H2",
      "text": "Site Speed"
    },
    {
      "level": "H2",
      "text": "The IKEA Way: One Fast Server with CDN for Multiple Markets"
    },
    {
      "level": "H2",
      "text": "The Lush Way: One Provider with Multiple Server Locations"
    },
    {
      "level": "H2",
      "text": "The Google Way: Servers In Key Markets"
    },
    {
      "level": "H2",
      "text": "Legal Issues"
    },
    {
      "level": "H6",
      "text": "Most popular pages"
    },
    {
      "level": "H6",
      "text": "SEO Checklist: 41 Tips to Optimize Your Website"
    },
    {
      "level": "H6",
      "text": "How to Perform a Complete SEO Audit (in 14 Steps)"
    },
    {
      "level": "H6",
      "text": "A Beginner’s Guide to Keyword Search Volume"
    }
  ],
  "author": ""
}