{
  "url": "https://www.semrush.com/blog/introduction-to-ctr-click-through-rate/",
  "slug": "introduction-to-ctr-click-through-rate",
  "title": "Introduction to CTR (Click-Through Rate)",
  "description": "Achieving a high page CTR is essential for PPC success — it directly affects the quality score and how much a business pays for clicks on their advert.",
  "content": "CTR stands for Click-Through-Rate. This is the percentage rate at which people click on a particular ad when online. Achieving a high page CTR is essential for achieving PPC success, because it directly affects both the quality score as well as how much a business pays every time someone clicks on their search advert. Are your click-through rates holding you back, or are they high enough? These are some of the questions that bother almost every webmaster. What Can Impact a Page CTR? Several factors can impact a page CTR, which is why there is no definitive answer to this question. A few of the factors to consider are as follows: Audiences and targeting B2B or B2C Brand or non-branded A keyword's place in the search funnel Ad copy's creative messaging — CTA Type of offer Display URL Images/design Industry competitiveness So, what is a Good CTR? This is one of the most common ‘it depends’ questions you will ever come across in a online marketing campaign, where the answer ‘it depends’ is really the reality, sorry guys! That’s the way it is. This is what a good CTR should look like. A keyword with a very high commercial intent and is very specific 10% to 20% from ad position 1 (or 5% from position 5 on the side) can be seen. A keyword with a low commercial intent and is non-specific might gather less than a 1% CTR. In both the above instances, you could have a nice CTR from a quality score standpoint. Good CTR: Good CTR will depend on several points like targeting, industry, placements, keywords, etc. You can try following points to improve your CTR on display network thought. Use the following tips. If you are running keyword based campaign on display try to find out which domains are giving you better CTR and add them in managed placements Keep in mind on display all keywords are broad match so you need to make sure that you have negative keywords to make sure that you get relevant impressions Try checking Relative CTR metrics for your placements Click Through Rate Formula: Let's suppose your ad receives 10 clicks per 100 impressions, then the CTR would be calculated as given below:- CTR= 10/100 = 0.1 A CTR of 1% is considered ideal. Click Through Rate for Email Campaigns Most email service providers (ESPs) can track your e-mails and allow you to view the results in an e-mail tracking report. These e-mail tracking reports are analytical summaries of the results of a given e-mail campaign. Among the many interesting and insightful bits of information you can pick up from a report is your page CTR. The following are some tips to help you get better at getting good CTR rates for email campaigns. Take the total number of clicks on all links in your e-mail and subtract any multiple clicks attributed to a single subscriber in order to get totally unique clicks. Then, you can take the total number of tracked opens and divide by the total number of unique clicks to get clicks per open. Multiply clicks open by one hundred and you will get the page CTR. How to get Good CTR Targeted keywords to bid on. Discover cheaper, cost-efficient clicks. Use tools and methodology for closely integrating keywords with ad text and landing pages. Have the ability to quickly and efficiently segment keyword groups to generate closer targeting. Using Auction Insights Tool With the Auction insights report, you can compare your performance with other advertisers who compete in the same set of auctions as you do. This will help you to see how often your ads rank higher than other advertisers’ ads on the search results page, and how often your ads appear compared to the competitions based on your estimated possible impressions. This information can help you make strategic decisions about page CTR, bids, budgets, and keyword choices by showing you where you are succeeding and where you may be missing out on opportunities in the marketing campaign. Determining a good CTR is also common sense marketing. Sometimes to increase awareness or achieve an objective, you will have to bid on less relevant or complementary keywords or audience targets. Hopefully, this information will help you understand the concept of the page CTR.",
  "headers": [
    {
      "level": "H1",
      "text": "Introduction to CTR (Click-Through Rate)"
    },
    {
      "level": "H2",
      "text": "What Can Impact a Page CTR?"
    },
    {
      "level": "H2",
      "text": "So, what is a Good CTR?"
    },
    {
      "level": "H2",
      "text": "Good CTR:"
    },
    {
      "level": "H2",
      "text": "Click Through Rate Formula:"
    },
    {
      "level": "H2",
      "text": "Click Through Rate for Email Campaigns"
    },
    {
      "level": "H2",
      "text": "How to get Good CTR"
    },
    {
      "level": "H2",
      "text": "Using Auction Insights Tool"
    },
    {
      "level": "H6",
      "text": "Most popular pages"
    },
    {
      "level": "H6",
      "text": "SEO Checklist: 41 Tips to Optimize Your Website"
    },
    {
      "level": "H6",
      "text": "How to Perform a Complete SEO Audit (in 14 Steps)"
    },
    {
      "level": "H6",
      "text": "A Beginner’s Guide to Keyword Search Volume"
    }
  ],
  "author": ""
}