{
  "url": "https://www.semrush.com/blog/key-future-seo-aeo-understanding-credibility/",
  "slug": "key-future-seo-aeo-understanding-credibility",
  "title": "The Future of SEO: Understanding, Credibility, & Deliverability",
  "description": "Google (and Bing) use understanding and credibility to ensure that they guide their users quickly and simply to the best available result. What should you be doing to take advantage?",
  "content": "When someone searches on Google (or Bing), they express a problem they are seeking to solve or a question they need the correct answer to. The \"raison d'être\" of Google and Bing has always been to guide their users quickly and simply to the best available result. Ideally, for Google and Bing, “the best available result” is the single best answer. If they can, they will provide the searcher with one single definitive answer or solution - for example, featured snippets or knowledge panels. Taking that further, Google Assistant, Microsoft Cortana, and services such as Google Discover are moving that needle further and further away from simple search and closer to answer / solution providers. Google and Bing are moving towards becoming Answer Engines rather than Search Engines, meaning that we can start to consider Search Engine Optimization as Answer Engine Optimization. And that is where my approach based on the three pillars of Understanding, Credibility, and Deliverability truly comes into its own. With the rise of voice search and the move toward answer engines, Google and Bing are increasingly relying upon understanding, credibility, and deliverability to provide the one, single, best solution. What should you be doing to take advantage? In this article, we will review: Overview of the Situation The Foundation of the Future How Does Google Evaluate Deliverability? What You Need to Do - Starting Today A Simple View For the Future (Answer Engines) Overview of the Situation The Evolution of Desktop → Mobile → Voice Search evolves with the devices we use. That is key. The switch from desktop to mobile has had (and continues to have) a major impact on search behavior. The switch to voice will have a similar, perhaps even bigger impact - both in terms of how users search and how Google and Bing provide answers to those users. Voice is naturally more verbose, more natural.... and ultimately requires a single answer. In the relatively slow days of the desktop-noughties, ranking page 1 was a success. Ranking in the top few pages was acceptable. User chooses the best solution/answer from 10 to 20 options. In the mobile world of today, ranking top 3 is a success. Ranking in the top half of page 1 is acceptable. User chooses the best solution/answer from half a dozen options. As Google and Bing evolve from search engines to answer engines, ranking #1 (increasingly position 0) is a success. Ranking in the top 3 or the rich results/SERP features is acceptable. User accepts the suggested best solution/answer but retains a (little exercised) option to choose from a top 2 or 3. Acceptable Ranking SERP by Device What Does This Mean to Your Organic Traffic? In 2021: Start to prepare. If you aren’t ready this year, you won’t have missed the boat. But now is a perfect time to start changing your thinking from \"Page 1 or nowhere\" to \"#1 or nowhere\". And get to work preparing your site and your company for this new paradigm. Beyond 2022: Panic. It is not unreasonable to imagine that by 2024, search traffic is divided equally between desktop, mobile, and voice. In 2005, first place gave 30% of the market share. In 2017, first place gave 40% of the market share. In 2022, first place will give 60% of the market share. In 2026, first place will give 80% of the market share. As you can see, the shift towards the dominance of that top spot has accelerated and will probably continue to accelerate. As we move to a world that will increasingly favor voice search, ranking at the top (no.1 / position 0 / featured snippet/answer box) is going to be critical. Your competitors know it. They are working towards that. A Few (Not-So-Doom-and-Gloom) Provisos That May Help Calm Your Nerves: The importance of this trend of \"no.1 or nowhere\" will vary enormously between markets and business types... Generally speaking, niche markets and local businesses will be most affected by this trend. Long-tail search queries will increase, leaving more opportunity to get at least some #1 rankings and spreading the risk. Voice search will not 100% replace mobile in the same way that mobile did not 100% replace desktop. It is crucial to bear in mind that desktop, mobile, and voice will all continue to bring a share of traffic. It is anybody's guess what the relative importance will be. On Desktop and mobile rich elements (SERP features) that stand out visually (video carousels, knowledge panels, podcast carousels, etc.) allow you to also aim for spots elsewhere on the SERP that can be very effective in giving your brand visibility and driving traffic. The Foundation of the Future What Google is looking for above all else. Understanding - Looking from Google's point of view, it needs to understand who you are, what you offer, and what audience you can serve in order to consider your offer as a potential candidate to be suggested as the best solution to its users. Credibility - Once it has understood your offer, in order to present it as the best from several possibilities, Google will look at relative credibility - compare you to the competing solutions and answers. Deliverability - Once it has understood your offer and is convinced yours is better than the competition, it needs to be confident that your content is appropriate for the user in their current situation. In the new world of Answer Engines, understanding, credibility, and deliverability are what matter most. By Far. Understanding: Google is not starting from scratch; it has already understood some things about your brand. It has a pretty good basic understanding of almost all brands and an excellent and detailed understanding of some. Your Brand SERP (the Google result for a search on your exact match brand name) is a good gauge of how well it has understood your brand. If the results it shows are an accurate representation of your brand - who you are and what you do - then Google has a good basic understanding. Read more about how to ‘read’ your Brand SERP here. Hummingbird and understanding With Hummingbird and entity-based search (read more here or here), understanding is increasingly a major advantage in SEO/AEO. And Google’s understanding of your brand comes from 3 main types of online resources. Sites and pages you control (your own site, but also sites that offer accounts and profiles you control) Google properties (such as GMB, YouTube, Google Play, Google Books), Independent, trustworthy, authoritative websites ( Kalicube provides a partial list here) Significant note about a site's authority and other such third party link-based measurements. They are gauges of popularity, not trustworthiness. Faux-news humor sites, such as The Onion, has a very high site authority score but is not trustworthy. It's not a reliable source of facts for Google :) Insights into Google’s Understanding You can gain an insight into the level and confidence of Google’s understanding of your brand by searching your exact brand name and seeing if it shows a knowledge panel on the right-hand side on desktop. Google has understood a great deal about Microsoft. Much less about Kalicube! Another insight is to look at Google’s Knowledge Graph. See what information the Knowledge Graph API returns and the level of confidence it attributes to its understanding. Here we see what is driving those knowledge panels, and just how confident Google is that it has understood these brands: who they are and what they do. The screenshot is from Kalicube’s handy tool where you can look up your brand (or your competitors.) Check that out here. What Is Google's Take on Credibility? Once again, Google is not starting from scratch; it already has an opinion about your brand's credibility (good or bad). It has a great deal of information to base its \"opinion\" on. And Google’s information for judging your credibility is mostly based on its evaluation of online feedback from the public (users, clients, prospects, peers, influencers…). Once again, the information comes from 3 main types of online resources. Sites and pages you control (your own site, your social accounts, review sites) Google properties (such as GMB, YouTube, Google Play, Google Books), Independent, trustworthy, authoritative websites How Does Google Evaluate Deliverability? Google wants to be sure that its user gets the solution they are looking for as efficiently as possible and in the most appropriate format. That increasingly means the content may be delivered on SERP. On SERP elements where Google doesn’t send the user to your site include featured snippets (text and video) for simple answers to simple questions, People Also Ask, Google My Business panels that provide the required information (telephone number of the business, for example). With rich elements such as video carousels, image carousels, Twitter boxes, then deliverability can be about the platform the content is found. Google may consider that YouTube (or Twitter, or Facebook, for that matter) may be a more appropriate platform for its user to consume your video content than your site. Then, of course, your site. Here deliverability is all about whether Google believes your site can deliver the solution effectively to its user. That can be in the form of traditional SEO signals such as a fast page that is mobile-friendly or less obvious concepts such as a great checkout experience for an ecommerce site, great accompanying content around a video, and so on. In short, is Google confident YOU can deliver the solution effectively to its user (NEVER lose sight of the fact that these are Google’s users)? What You Need to Do - Starting Today What you can do to get ahead of the competition. Communicate - You can sit back and hope that Google will understand your brand and your offers. Or you can actively communicate who you are, what you offer, and to whom. Convince - You can sit back and hope that Google will realize that you and your offer are the best of the best. Or you can seek to convince it that your offer is the best, most credible available. Package - You can create content and hope that Google can do something with it. Or you can place your content on relevant platforms, produce your content in appropriate formats, and package that content on your site in a way that makes it easy for your audience (and Google) to consume. Looking at it from another angle... The onus is on you. Communicate so that Google understands, convince it that your brand is the most credible solution and ensure that your content is formatted appropriately for delivery Techniques That Will Help You Communicate Effectively and Improve Understanding: Advice: Do a search on your brand name right now and see what comes up on pages 1 and 2. Then work to ensure that every result on those first two pages accurately reflects who you are, what you do, and satisfies your audience's focal points. Semantic HTML5. Structured Schema.org markup. Quality content using appropriate vocabulary. Get/improve links and mentions from highly pertinent brands that are also authoritative. Get/improve confirmation by trusted, authoritative, and relevant third parties. Techniques That Will Help You Convince Google You Are Highly Credible Advice: Do a search on your brand name plus the word “reviews” right now and see what comes up on pages 1, 2, and 3. Those are the opinions that Google thinks are the most representative of public opinion about your brand (users, clients, prospects, peers, influencers…). The first thing to do is work to ensure that every result on the first two pages reflects your brand positively. Leapfrog the bad stuff by promoting the positive results on pages 2 and 3 Get positive reviews on the review platforms that appear on pages 1 to 3 Ask journalists to update articles that appear on pages 1 to 3. Generate positive client feedback from social media/reviews (including your reaction). Obtain peer-group confirmation (associations, conferences, etc.). Get vocal support from influencers, thought leaders, and journalists. Get links and mentions from highly pertinent brands. Confirm and valorize all the above on your own site. Techniques That Will Help You Present/Package Your Content for Better Deliverability Advice: Do a search on your brand name and look at the rich elements (SERP features) Google shows. If the result is dull and boring (10 blue links), then your content strategy is too narrow, and/or Google is unconvinced about your capacity to deliver your (quality) content as a solution for its users. Make your site faster than the competition. Make your site mobile friendly. Format the textual content on your pages using HTML5 best practices. Create your content in the most appropriate format on a case by case basis (video, audio, tables, lists, how-to’s, headings and paragraphs, etc.) Publish your content on the most relevant platform on a case-by-case basis (your sites, YouTube, Twitter, Facebook, etc.) Sidenote: Understanding, credibility, and deliverability need to evolve in tandem. To attach any sort of credibility to your brand or your offers, Google needs to understand who you are. To suggest your solution or answer to its user, Google needs to be convinced it is deliverable. Understanding without credibility means nothing. Credibility without deliverability serves no purpose. If you neglect any one of these three pillars, your SEO strategy will fail. Understanding, credibility, and deliverability are interdependent, and none has any meaningful leverage without the other. A Simple View For the Future (Answer Engines) Google wants to understand. It is your job to communicate and educate it. Google seeks credibility. It is your job to convince it. Google requires deliverability. It is your job to package and present your content appropriately. Together, Understanding, Credibility, and Deliverability Are the Primary and Most Reliable Route to SEO/AEO Success for Your Brand. Footnote: I have been doing extensive research at Kalicube.pro since January 2017. This article is based on that research. Here is the data we have collected and analyzed in the past year.",
  "headers": [
    {
      "level": "H1",
      "text": "The Future of SEO: Understanding, Credibility, & Deliverability"
    },
    {
      "level": "H2",
      "text": "Overview of the Situation"
    },
    {
      "level": "H3",
      "text": "The Evolution of Desktop → Mobile → Voice"
    },
    {
      "level": "H4",
      "text": "Voice is naturally more verbose, more natural.... and ultimately requires a single answer."
    },
    {
      "level": "H3",
      "text": "What Does This Mean to Your Organic Traffic?"
    },
    {
      "level": "H4",
      "text": "In 2021: Start to prepare."
    },
    {
      "level": "H4",
      "text": "Beyond 2022: Panic."
    },
    {
      "level": "H3",
      "text": "A Few (Not-So-Doom-and-Gloom) Provisos That May Help Calm Your Nerves:"
    },
    {
      "level": "H2",
      "text": "The Foundation of the Future"
    },
    {
      "level": "H4",
      "text": "Understanding:"
    },
    {
      "level": "H3",
      "text": "Insights into Google’s Understanding"
    },
    {
      "level": "H3",
      "text": "What Is Google's Take on Credibility?"
    },
    {
      "level": "H2",
      "text": "How Does Google Evaluate Deliverability?"
    },
    {
      "level": "H2",
      "text": "What You Need to Do - Starting Today"
    },
    {
      "level": "H3",
      "text": "Techniques That Will Help You Communicate Effectively and Improve Understanding:"
    },
    {
      "level": "H3",
      "text": "Techniques That Will Help You Convince Google You Are Highly Credible"
    },
    {
      "level": "H3",
      "text": "Techniques That Will Help You Present/Package Your Content for Better Deliverability"
    },
    {
      "level": "H2",
      "text": "A Simple View For the Future (Answer Engines)"
    },
    {
      "level": "H3",
      "text": "Together, Understanding, Credibility, and Deliverability Are the Primary and Most Reliable Route to SEO/AEO Success for Your Brand."
    },
    {
      "level": "H6",
      "text": "Most popular pages"
    },
    {
      "level": "H6",
      "text": "SEO Checklist: 41 Tips to Optimize Your Website"
    },
    {
      "level": "H6",
      "text": "How to Perform a Complete SEO Audit (in 14 Steps)"
    },
    {
      "level": "H6",
      "text": "A Beginner’s Guide to Keyword Search Volume"
    }
  ],
  "author": ""
}