{
  "url": "https://www.semrush.com/blog/keyword-match-types/",
  "slug": "keyword-match-types",
  "title": "Keyword Match Types in Google Ads & SEO [2024]",
  "description": "Learn how to use keyword match types in Google Ads: broad match, phrase match, and exact match.",
  "content": "Keyword match types affect which search queries your ads show for in Google. But they don’t play a role in organic rankings.Here’s what you need to know for your PPC and SEO campaigns:What Are Keyword Match Types in Google Ads?In Google Ads, the keyword match type determines the scope of search queries that could trigger your ads. Your choice affects the potential reach and relevance of your paid search results.These are the three keyword match types: Broad match: Queries must relate to your chosen keyword (highest reach, lowest relevance) Phrase match: Queries must include your keyword’s meaning (medium reach, medium relevance) Exact match: Queries must match your keyword’s meaning (lowest reach, highest relevance)You can also use these keyword match types for negative keywords.This means the different types of keywords in Google Ads are broad match keywords, phrase match keywords, exact match keywords, broad match negative keywords, phrase match negative keywords, and exact match negative keywords.Keep reading to learn more about each one.1. Broad MatchBroad match means your ads can show when searchers use related keywords (as determined by Google’s AI). It provides the widest reach of any keyword match type.Here are some of the relevancy signals that broad match considers: Other keywords in your ad group The user’s previous searches The user’s location Your landing page contentBroad match is the default keyword match type on Google Ads. It doesn’t require any special notation.So, let’s say you bid on interior paint.Your ad could show for the following queries: Lavender paint (because your ad group contains “purple paint”) Interior design (because it’s topically related to your keyword) Sherwin-Williams (because your landing page mentions this paint brand) Buy interior paint (because the query contains your keyword’s meaning) Paint for interior (because the query matches your keyword’s meaning)This means ads can reach more people who are potentially interested in your products or services. But there is a risk of showing for less relevant queries.Google recommends that you use broad match keywords in conjunction with Smart Bidding to “help reach searches that are relevant to your business and expected to perform within your goals.”Smart Bidding is an AI system that adjusts your bids based on expected conversions or conversion value.As with any keyword match type, you’ll only pay when someone clicks your ad.When using broad match keywords, there’s also a risk of ad poaching. This occurs when similar broad match keywords appear in multiple ad groups, causing your ads to compete against each other.To prevent this issue, use Semrush’s PPC Keyword Tool.The cross-group negatives function automatically adds negative keywords to your groups. To prevent overlaps that can harm your performance.2. Phrase MatchPhrase match means your ads can show when queries include the meaning of your keyword (as determined by Google’s AI). This keyword match type provides a middle ground between reach and relevance.To denote phrase match keywords in Google Ads, wrap your keyword in quotation marks.Let’s say you bid on “interior paint” (with the punctuation included).Your ad could show for the following queries: Buy interior paint (because the query contains your keyword’s meaning) Paint for living room (because the query contains your keyword’s meaning) White wall paint (because the query contains your keyword’s meaning) Paint for interior (because the query matches your keyword’s meaning)But shouldn’t appear for more tangential queries like “lavender paint” or “interior design.”Phrase match keywords are helpful for brand and competitor campaigns. Because you can ensure that queries refer to your brand name or a competitor’s.Tip: Design and optimize your Google Ads campaigns in Semrush’s PPC Keyword Tool. You can easily plan keyword match types, remove duplicate keywords, and more.3. Exact MatchExact match means your ads can only show when queries have the same meaning as your keyword. To denote phrase match keywords in Google Ads, wrap your keyword in square brackets.Let’s say you bid on [interior paint].Your ad could show for the following queries: Interior paint Paint for interior Room paintBut shouldn’t appear for more tangential queries like “paint for living room” or “white wall paint.”Phrase match keywords are helpful if industry regulations dictate you can only advertise on specific terms.Keyword Match Types for Negative KeywordsYou can use the same keyword categories (broad match, phrase match, and exact match) when adding negative keywords to your Google Ads campaign.Negative keywords are keywords you don’t want ads to show for. The matching types work a little differently: Negative broad match: Your ad won’t show if the query contains your keyword in any order Negative phrase match: Your ad won’t show if the query contains your keyword in the exact order Negative exact match: Your ad won’t show if the query is exactly the same as your keywordLet’s say you sell all kinds of interior paints except chalkboard paint.One of the most efficient ways to set up your campaign is to create a broad match for “interior paints.” Then add a negative phrase match for “chalkboard,” “chalkboards,” “chalk board,” “blackboard,” etc.Try organizing your positive and negative keywords in Semrush’s PPC Keyword Tool. During the setup process, you can add keywords from Semrush. Or upload a file containing target keyword data.Next, create ad groups manually. Or take advantage of the “Auto grouping” or “1 kw = 1 gr” (one keyword equals one group) features:You can then: Clean out unwanted keyword modifiers and other elements (e.g., prepositions) Add negative keywords at the group or campaign level Automatically add cross-group negatives Remove duplicate keywords Export your plan in a Google Ads-friendly formatCheck out the PPC Keyword Tool manual to learn more. Or sign up now to jump straight in.What Are Keyword Match Types in SEO?In SEO, keyword match types aren’t really a thing.Google uses sophisticated algorithms to evaluate the meaning and context of each search query. Then ranks organic results based on their relevance, quality, and usability.You don’t get to explicitly state what relevant queries you want to rank for. But adding target keywords to your content can help you rank higher.Google explains its organic keyword matching system like this:The most basic signal that information is relevant is when content contains the same keywords as your search query. For example, with web pages, if those keywords appear on the page, or if they appear in the headings or body of the text, the information might be more relevant.Here are three important things to remember: You do not necessarily need to use keywords to rank for them Using a keyword does not guarantee that you’ll rank for it Keyword usage should always comply with Google’s spam guidelinesFor help using keywords effectively, read our keyword optimization guide. Or use Semrush’s SEO Writing Assistant.Enter your keywords and choose your target audience.Then, click “Get recommendations.”Start typing, and the tool will review your keyword usage in real time.The SEO Writing Assistant will also score your content’s readability, originality, and tone of voice.How to Find Keywords for PPC and SEOKeyword research allows you to find out what your target audience searches for. And collect associated data, such as search volume (the average number of monthly searches).This information helps you optimize your PPC and SEO campaigns.Go to Semrush’s Keyword Magic Tool to give it a try.Simply enter a keyword to base your search around (e.g., “best restaurants nyc”).Then, choose your country and click “Search.”You can switch between the following keyword match types on Semrush (which work differently from those found on Google Ads): Broad Match: Find keywords that include your keyword or a variation Phrase Match: Find keywords that include your exact keyword(s) in any order Exact Match: Find keywords that include your exact keywords in the exact order Related: Find keywords that generate similar search results to your starting keywordHere’s your quick guide to the keyword metrics provided: Metric Description Best for Intent The type of search intent. This indicates what stage of the marketing funnel the user is at. SEO and PPC Volume Keyword search volume. The average number of monthly searches. SEO and PPC KD % Keyword difficulty score. The higher the score, the harder it will be to rank in Google’s top 10 organic results. SEO CPC (USD) Cost per click. The average amount (in US dollars) that advertisers pay per click. PPC Com. Competitive density. The higher the score, the harder it will be to rank in Google’s paid results. PPC Take advantage of the filters and sorting options to narrow your results. And find the best keywords for your search campaigns.Make sure to save your chosen terms in Keyword Strategy Builder. You can easily create different keyword categories or keyword clusters:Plus, you can send keywords on to: PPC Keyword Tool, where you can plan Google Ad campaigns Position Tracking, where you can track paid and organic rankings SEO Writing Assistant, where you can create optimized content",
  "headers": [
    {
      "level": "H1",
      "text": "Keyword Match Types in Google Ads & SEO [2024]"
    },
    {
      "level": "H2",
      "text": "What Are Keyword Match Types in Google Ads?"
    },
    {
      "level": "H2",
      "text": "1. Broad Match"
    },
    {
      "level": "H2",
      "text": "2. Phrase Match"
    },
    {
      "level": "H2",
      "text": "3. Exact Match"
    },
    {
      "level": "H2",
      "text": "Keyword Match Types for Negative Keywords"
    },
    {
      "level": "H2",
      "text": "What Are Keyword Match Types in SEO?"
    },
    {
      "level": "H2",
      "text": "How to Find Keywords for PPC and SEO"
    }
  ],
  "author": ""
}