{
  "url": "https://www.semrush.com/blog/keyword-analysis/",
  "slug": "keyword-analysis",
  "title": "Keyword Analysis for SEO: What It Is & How to Do It",
  "description": "SEO keyword analysis helps you identify the best unpaid ranking opportunities for your business.",
  "content": "What Is Keyword Analysis?Keyword analysis is the process of evaluating queries people type into search engines to identify and prioritize search terms you want to rank for—and use them more effectively.When used in SEO, analyses typically focus on keyword popularity, the level of competition in organic (unpaid) search results, and the intention behind the average user’s search.Let’s say a sneaker retailer finds these keywords during keyword research: “shop sneakers” “chunky sneakers” “how to clean sneakers”After conducting a keyword analysis, they might decide to focus on “chunky sneakers.” Because it’s relatively popular, easy to rank for, and likely to generate sales. As this data from Keyword Overview suggests:We’ll go over how to gather and understand all these keywords metrics later.TipTo learn about keyword analysis for search advertising campaigns, check out our keyword research for PPC guide.Why Is Keyword Analysis Important?Doing a keyword analysis helps you understand the potential costs and benefits of targeting a given topic. So you can make better search engine marketing decisions.SEO keyword analysis is largely about identifying keywords that: Have a decent amount of monthly searches Are relatively easy to rank for organically Will bring in targeted traffic (i.e., visitors who are likely to drive revenue)Gaining a better understanding of keywords also helps you optimize content more effectively. Because it tells you what users are looking for.Types of KeywordsBefore you do keyword analysis for SEO, it’s helpful to know the most common types of keywords.Let’s explore them:Informational, Navigational, Commercial, and Transactional KeywordsIf we focus on search intent (the purpose behind the user’s search), there are four types of keywords: Intent Type Description Keyword Example Informational The user wants to find information “how to clean sneakers” Navigational The user wants to find a specific page or website “nike website” Commercial The user wants to research a brand, product, or service “best sneakers” Transactional The user wants to take action (e.g., make a purchase or booking) “white vans sneakers” You’ll see the intent category (or categories) when you analyze keywords in Semrush.This can help you understand where the user is in the marketing funnel—i.e., how likely they are to convert. And what type of content you need to create.TipWhen you’re doing keyword research in Semrush, it’s possible to filter results based on the intent type.Long-Tail and Short-Tail KeywordsShort-tail keywords are broad search terms that get relatively high search volumes. Whereas long-tail keywords are more specific search terms that often have relatively low search volumes.For example, Semrush data shows that “sneakers” (a short-tail keyword) gets 201K searches per month in the U.S. And “nike black and pink sneakers” (a long-tail keyword) gets 590.Generally, long-tail keywords are easier to rank for because they tend to attract less competition.Branded and Non-Branded KeywordsBranded keywords are search terms that are specific to a particular brand (e.g., “nike” and “air jordan sneakers”).Non-branded keywords are search queries that don’t specify a brand name (e.g., “sneakers”).Generally, your own branded keywords are easier to rank highly for. And they can drive a lot of clicks and conversions.Here are the main types of branded search terms:How to Do Keyword Analysis in SEOBelow, we’ll explain how to do a thorough keyword analysis.Many steps require access to a keyword research tool. If you want to follow along, we recommend that you create a free Semrush account.Tip​​​​​​You can get some of these metrics in other keyword research tools, like Google Keyword Planner. But Semrush gives you access to the biggest keyword database on the market. And other advantages. Analyze Search IntentAnalyzing search intent (why people use a particular keyword) helps you understand: What resources are required to create quality content (i.e., content that has good ranking potential) How valuable any resulting traffic is likely to beLet’s imagine you’re a sneaker retailer analyzing three keywords: “buy sneakers” has the potential to drive lots of revenue. You already have a sneakers product category page that’s suited to this keyword. It just needs a few minor improvements. “how to clean sneakers” is unlikely to drive immediate sales. But it could help you reach and engage people who have a good chance of buying in the future. To rank, you’ll probably need to create an in-depth guide. “sneakers movie” is unlikely to generate any value because it’s not relevant to your business. So, it’s not worth investing the time to create content targeting that term.In Semrush’s keyword tools, you can see the search intent category for any keyword.For further insight, scroll down to the “SERP Analysis” section in Keyword Overview. This shows you what kinds of results are already ranking for the keyword in your selected location.And you can easily click through to view the search engine results page (SERP) or any top-ranking result.For example, our sneaker retailer might consider targeting “best sneakers” on their product category page.But if we analyze the SERP, we can see that it’s dominated by roundup articles.This suggests that the search intent is to get sneaker recommendations from trusted publications.So, the keyword isn’t a good fit for the retailer’s product category page.Consider Search VolumeSearch volume refers to the average number of monthly searches a keyword receives.Keywords with higher search volumes have the potential to drive more traffic to your website.For example, our data shows that “sneakers” gets 201K searches per month in the U.S. And that “nike black and pink sneakers” gets 590. As part of your keyword analysis, you might also want to check whether volumes are on an upward or downward trend. For example, this graph indicates that “sustainable sneakers” is growing in popularity: Just make sure to account for any seasonality (e.g., Christmas-related keywords peaking in December).When you’re doing keyword research in Semrush, you can filter results based on volume.Like this:However, it’s important to remember that volumes aren’t everything.High-volume keywords won’t necessarily drive conversions. And they tend to be harder to rank for because they usually attract more competition.This is what we’ll discuss in the next section.Determine Keyword DifficultyKeyword difficulty is a metric that indicates how hard it is to earn a high organic ranking in the SERP. In other words: how competitive the keyword is.Semrush has the most accurate keyword difficulty metric on the market. It’s represented by “KD%” and works on a 0-100 scale.The higher the score, the harder it’ll be to rank organically on the first page of Google. For example, “red sneakers” has a keyword difficulty score of 28%: That suggests the term should be relatively easy to rank for.On the other hand, “nike sneakers” has a difficulty score of 100%. Meaning the keyword is far too competitive for most websites to realistically rank for.One of the best ways to gauge your competitiveness is with our Authority Score metric. Which is largely based on the quality and quantity of links you have from other websites (known as backlinks).You can check your domain’s Authority Score in the Backlink Analytics tool. The higher your score out of 100, the easier you should find it to rank.For example, nike.com has an Authority Score of 97. Whereas supershoes.com has an Authority Score of 32.This means that Super Shoes will find it hard to outrank Nike. And the retailer may be better off focusing on low-difficulty keywords.NoteYour topical authority (i.e., your expertise and credibility on a given subject) can also affect your ranking potential.Look at the SERP LandscapeThe SERP landscape refers to the composition of a search results page. It indicates what ranking opportunities are available and how many clicks each result is likely to get.(Although, it’s liable to change.)For example, many SERPs have a featured snippet that looks something like this:Featured snippets tend to affect user behavior in one of two ways: The snippet detracts clicks from other results because it’s so much more prominent. This is good if you own the snippet but bad if you don’t. The snippet provides all the information the searcher needs. This leads to a zero-click search, meaning that no results are clicked.So, the presence of a featured snippet might affect your decision on whether to target a keyword.There are many other types of SERP features (non-standard search results) as well. And their presence can affect your results in various ways.So, they’re definitely worth taking into account when doing a keyword analysis for your website.When you analyze keywords in Semrush, you can easily see how many SERP features each keyword triggers. And exactly which ones they are.Of course, you can also click through to see the SERP for yourself.Reviewing the presence of SERP features and how they impact the search experience makes it clearer which terms are worth targeting. And which ones you may want to avoid. TipWhen you do keyword research in the Keyword Magic Tool or Organic Research, you can filter for keywords that trigger (or don’t trigger) certain SERP features.Refer to the CPC MetricCost per click (CPC) is an advertising metric, but it can come in handy when doing an SEO keyword analysis. Here’s why:CPC is the amount an advertiser pays when someone clicks on their sponsored result. And it’s determined by an auction.Generally, advertisers will only bid on a keyword if they think they’ll achieve a positive return on investment.This means CPC is a strong indicator of a keyword’s profit potential.For example, Semrush data shows the CPC for “burberry mens sneakers” is $6.82. This indicates that the keyword drives high-ticket sales.(For comparison, the CPC for “cheap mens sneakers” is just $1.56.)Of course, there are many other factors that affect a keyword’s revenue potential. But CPC is certainly worth a look.Choose the Right Keywords for Your BusinessKeyword analyses help you make more informed decisions. But there’s no scientific way to choose the best keywords for your website.Ultimately, you have to make a judgment call:How do the potential costs and benefits of targeting this keyword compare?As your SEO journey progresses, you should find it easier to make these kinds of decisions. Because you can see how your predictions play out. And adjust your approach accordingly.With Semrush’s Position Tracking tool, you can easily track your rankings for target keywords.And it’s available to try alongside all our keyword analysis tools.Start your free trial to get the full experience.",
  "headers": [
    {
      "level": "H1",
      "text": "Keyword Analysis for SEO: What It Is & How to Do It"
    },
    {
      "level": "H2",
      "text": "What Is Keyword Analysis?"
    },
    {
      "level": "H2",
      "text": "Why Is Keyword Analysis Important?"
    },
    {
      "level": "H2",
      "text": "Types of Keywords"
    },
    {
      "level": "H3",
      "text": "Informational, Navigational, Commercial, and Transactional Keywords"
    },
    {
      "level": "H3",
      "text": "Long-Tail and Short-Tail Keywords"
    },
    {
      "level": "H3",
      "text": "Branded and Non-Branded Keywords"
    },
    {
      "level": "H2",
      "text": "How to Do Keyword Analysis in SEO"
    },
    {
      "level": "H3",
      "text": "Analyze Search Intent"
    },
    {
      "level": "H3",
      "text": "Consider Search Volume"
    },
    {
      "level": "H3",
      "text": "Determine Keyword Difficulty"
    },
    {
      "level": "H3",
      "text": "Look at the SERP Landscape"
    },
    {
      "level": "H3",
      "text": "Refer to the CPC Metric"
    },
    {
      "level": "H2",
      "text": "Choose the Right Keywords for Your Business"
    }
  ],
  "author": ""
}