{
  "url": "https://www.semrush.com/blog/keyword-marketing/",
  "slug": "keyword-marketing",
  "title": "Keyword Marketing: What It Is & How to Do It",
  "description": "Keyword marketing helps your ads and content appear in search results. Learn how to do it for your business.",
  "content": "Search engines process billions of users’ queries (also called keywords and search terms) every day. Getting your pages displayed in search results for certain keywords can help you reach those users. And ultimately drive site visits and sales.In this piece, we’ll show you how to use keyword marketing to get better results from your paid and unpaid search efforts. What Is Keyword Marketing?Keyword marketing involves selecting and using search terms that are relevant to your business for your ads and website content. To increase the chances of gaining visibility when users enter those terms in search engines. When done right, it helps your content appear in organic (meaning unpaid) search results—the standard blue links. And in the case of ads, it can help you appear in pay-per-click (PPC) ads—the paid portion. Keyword marketing enables you to reach the right people. And show them the kinds of content, products, and/or services they’re interested in.Why Are Keywords Important in Marketing?Strategically using keywords allows you to appear prominently in search engines. Which can translate to more website traffic, leads, and revenue.And while you might be tempted to think that ads do this best, that isn't always the case.In fact, one poll found that about 49% of digital marketers say organic search yields the highest return on investment (ROI) for their websites out of the main digital marketing channels. And 19% say paid search offers the best return. Another advantage of keyword marketing is that you can measure performance. Each keyword has an approximate number of monthly searches. And you can track how many of those searches end up on your site. How to Find and Use Keywords for AdvertisingIf you're trying to quickly drive conversions or make searchers aware of your brand, ads are a great choice. Just know that results dry up as soon as you stop running them.Let’s explore this process.1. Identify Relevant PPC KeywordsFinding the right PPC keywords ensures they align with your business's campaign. And you can do that through keyword research.Let’s say you sell athletic shoes.Start by brainstorming some broad terms related to your products. Like these: “running shoes” “trainers” “sneakers” “athletic shoes”This list can now help you discover more keywords. To do that, head to Semrush’s Keyword Magic Tool. Start with one of your broad terms and click “Search.” The tool will return keyword suggestions based on your starting term. You can then review this list to identify keywords that align with your PPC campaign’s objectives. The first thing to take into account is search intent—what the searcher is looking to achieve. And there are several types of search intent. For example, your goal might be to sell a particular product. This requires you to identify buyer intent keywords (i.e., commercial and transactional terms) that indicate a searcher is likely to make a purchase. Here are a few other factors to consider when identifying relevant keywords: Search volume (Volume): This is the average number of searches the term gets each month. Ideally, you want to pick keywords that people search frequently to help drive as many people to your offer as possible. Cost per click (CPC): This is the average amount advertisers pay for each click on one of their PPC ads. You can get more value out of your budget by opting for keywords with low CPC. But keep in mind that a high CPC also suggests the term is valuable and likely to convert.You can identify additional keywords by analyzing your competitors. To do that, head to Semrush’s Advertising Research tool. Enter a competitor’s URL and hit “Search.” You’ll now see a list of keywords that competitor’s ads appear for. You can then work your way through these keywords. And take note of those that fit your criteria and PPC campaign’s goals. 2. Create Keyword GroupsCreating keyword groups helps you organize your campaign’s structure and ensure each ad reaches the intended searchers. If your business is an athletic footwear brand and uses search ads to sell running shoes, one of your keyword groups could look like this: “best running shoes for men” “best mens running shoes” “mens running shoes best” “best trail running shoes for men” “best shoes for running men”To perform keyword grouping, first analyze your keywords for common themes, products, audience types, use cases, or user intents. And keep in mind that keywords within each group should be satisfied by similar ad copy and landing pages. Then, create initial groups based on these similarities. You can use spreadsheet tools for this purpose. Aim for relatively small, focused groups of 10-20 closely related keywords. And name each group descriptively. Now, you can align your ad copy and landing pages with each group's theme. 3. Create Compelling AdsYour ad copy needs to incentivize searchers to click on your search ad. To achieve that, you’ll need to write compelling copy that accurately reflects your offer.The specific text components include: Display path: This is the URL shown in the ad, giving users an idea of where they'll land if they click. It doesn't have to be the exact URL, but should represent the page's content. Headlines: These are the most prominent parts in your ad, shown in larger, blue font. Ads typically display two to three headlines, and they should convey your main message. Description: This is the body text of your ad, providing more details about your offer, product, or service. It gives you space to expand on your headlines and include additional selling points.Here’s an actual ad with these components. Your copy should include relevant target keywords. Many brands also add their unique selling propositions (USPs) in the headlines to stand out. For example, a footwear brand might add USPs like “ultra-lightweight design” or “advanced shock absorption” in their headlines. Your descriptions should always include calls to action (CTAs) like “buy,” “try,” “join,” “discover,” etc.And you can also include ad assets. These are additional pieces of content (like images and links to additional pages) that help your ad take up more real estate and stand out.Here’s an example of a few ad assets:4. Launch and Monitor Your PPC CampaignsLaunching PPC campaigns involves setting up your campaign budget, detailing keyword groups, adding ad copy, specifying location settings, and then hitting publish on your paid ad. You may also need to enter your billing information if you haven’t done it before. But launching search ads is only the beginning. You also need to monitor your search ad campaigns to learn which keywords drive results and which don’t. Here are some metrics you can track to assess your ad performance: Conversion rate: The percentage of ad clicks that ended in conversions CPC: The amount you paid for each ad click Click-through rate: The percentage of people who click on an ad or link after seeing itYou can find these metrics in your Google Ads dashboard (note that you need to set up conversion tracking to have access to related metrics):TipCheck out our Google Ads account guide to learn more about how to get set up.Analyzing each of the above metrics can reveal useful insights. For instance, a falling conversion rate signals there’s a discrepancy between the ad and the landing page. Or, a rising CPC might indicate more competition has started bidding on your keywords. You can learn more about how to manage your campaigns in our PPC management guide. How to Find and Use Keywords for SEOIf you’re trying to establish a long-term organic presence in search results, SEO is a great choice. Just know that SEO is slow to start but can yield results for months or even years. Let’s explore this process. 1. Identify Relevant SEO KeywordsFinding the right SEO keywords helps you drive qualified search traffic that’s more likely to convert. And you can do that through keyword research. Start by identifying a seed term (a broad topic or main concept that you want to create content around). If you’re launching a blog on nutritious eating, for instance, one of your seed keywords can be “healthy lifestyle” or “healthy eating.” The Keyword Magic Tool can help you get many keyword suggestions based on your seed keyword.Head to the tool, enter your seed keyword, and click “Search.” You’ll now see a list of keywords related to your seed term. Now, select keywords that closely align with your brand.Another way to find relevant SEO keywords is to conduct a keyword gap analysis. Which reveals the keywords your competitors rank for but you don’t. To do that, head to Semrush’s Keyword Gap tool. Add your domain and those of your competitors and click “Compare.” Once on the main dashboard, click “Missing” just above the keyword list to see the terms your competitors rank for that you don’t. Review these keywords and mark those you find interesting. Add them to the list of the terms you identified when basing your research around seed keywords.2. Evaluate and Choose KeywordsNow that you have a list of keywords to choose from, it’s time to figure out which ones to target with your website content. Our Keyword Overview tool can help with that. Head to this tool, add your list of keywords, enter your domain, and hit “Search.” You’ll then reach the “Bulk Analysis” dashboard. Which shows your keywords along with various metrics. Here’s how to use the data to decide which keywords you should pursue: Relevant intent: Look for informational terms that lend themselves to organic search. Ranking for these terms often involves producing educational content. But you might also look for commercial and transactional terms you can use for product or service landing pages. Decent search volume: Prioritize keywords with a reasonable number of monthly searches—at least 100 is a good general rule of thumb. This data point is listed in the “Volume” column. Realistic difficulty: You want to go after keywords that your domain can feasibly rank for. So, look for the keywords with low Personal Keyword Difficulty (PKD %) scores—49% or lower. Because these represent terms your specific domain stands a good chance of ranking for. Trending topics: Look for keywords with monthly search volumes that are either stable or trending upward. You can find this data point in the “Trend” column. 3. Analyze Search Intent More ThoroughlyNow, analyze the search intent behind each keyword more in depth. So you know what kind of content you should create to stand a good chance of ranking. Try to understand what kind of content type (e.g., blog posts and videos), format (e.g., opinion pieces and list posts), and angle is served.For instance, let’s look at the search results for “healthy lifestyle tips.”We can conclude that to rank for this term, you’ll need to create a list-style article that contains: 10+ actionable tips A skimmable structure Expert input Well over 1,000 wordsLet’s review MedicineNet’s article for even more insight.For one, it’s written and reviewed by relevant experts whose titles are highlighted in the bylines.Second, the author is using relevant subheadings and bullet points to enable readers to skim through and find sections they are interested in. Use these findings to write a content brief (if you won’t be writing the piece yourself) that shares these details.4. Create Quality ContentYour content needs to be high quality to effectively compete in SERPs. Which means it should satisfy search intent, present information clearly, and provide a great user experience. But to stand out, consider adding more value to your content by: Introducing unique angles Providing original data Designing original media Adding useful examplesYou also need to prioritize on-page SEO (improvements to pages that can help them rank). Here are some key on-page SEO tips to implement: Include your target keyword in key areas like the title tag, URL, and subheadings Structure your page with heading tags (HTML elements that define headings) Write a compelling title tag (HTML that specifies the page’s title) that’s 60 characters or fewer Add internal links to other content on your site where useful Use descriptive alt text for your images5. Publish and Monitor Your ContentPublishing your content enables Google to crawl (find), index (store), and start showing those pages search results. You can then monitor how your content performs. There are several metrics you can track: Keyword rankings: The positions your site’s content has in search engine results for specific search terms Organic sessions: Visits to your website that come from unpaid search engine results Conversions: The number of website visitors who complete a desired action, such as making a purchase or filling out a formIt’ll likely take several months before you start seeing meaningful organic sessions and conversions. You can track these two metrics using Google Analytics 4. But your site will first have to rank for your target keywords. And you can track these using Semrush’s Position Tracking tool.Head to the tool, enter your domain, and click “Set up tracking.” You can now configure settings and add the keywords you want to track. Click “Start Tracking” after that.Go to the “Overview” tab to see your positions for your tracked keywords. As well as how those rankings have changed. And the “Pages” tab may also be helpful. It shows all of your pages that rank for at least one of the keywords you’re tracking.It’s a good idea to monitor your keyword rankings on a weekly basis. Ideally, you’ll achieve a graduate increase in your rankings. Which can later translate to organic traffic and conversions. Use Keywords to Boost Your Marketing ResultsWith keyword marketing, you can reach your audience through search ads and organic results. And if you can afford it, using these two methods together is a great idea.Semrush offers a range of tools to support your efforts for both SEO and PPC.Sign up for a free account today.",
  "headers": [
    {
      "level": "H1",
      "text": "Keyword Marketing: What It Is & How to Do It"
    },
    {
      "level": "H2",
      "text": "What Is Keyword Marketing?"
    },
    {
      "level": "H2",
      "text": "Why Are Keywords Important in Marketing?"
    },
    {
      "level": "H2",
      "text": "How to Find and Use Keywords for Advertising"
    },
    {
      "level": "H3",
      "text": "1. Identify Relevant PPC Keywords"
    },
    {
      "level": "H3",
      "text": "2. Create Keyword Groups"
    },
    {
      "level": "H3",
      "text": "3. Create Compelling Ads"
    },
    {
      "level": "H3",
      "text": "4. Launch and Monitor Your PPC Campaigns"
    },
    {
      "level": "H2",
      "text": "How to Find and Use Keywords for SEO"
    },
    {
      "level": "H3",
      "text": "1. Identify Relevant SEO Keywords"
    },
    {
      "level": "H3",
      "text": "2. Evaluate and Choose Keywords"
    },
    {
      "level": "H3",
      "text": "3. Analyze Search Intent More Thoroughly"
    },
    {
      "level": "H3",
      "text": "4. Create Quality Content"
    },
    {
      "level": "H3",
      "text": "5. Publish and Monitor Your Content"
    },
    {
      "level": "H2",
      "text": "Use Keywords to Boost Your Marketing Results"
    }
  ],
  "author": ""
}