{
  "url": "https://www.semrush.com/blog/keyword-competition/",
  "slug": "keyword-competition",
  "title": "Understanding Keyword Competition in SEO and PPC",
  "description": "Keyword competition is a metric that indicates how difficult it’ll be to rank highly for a search engine query.",
  "content": "What Is Keyword Competition?Keyword competition is a metric that indicates how difficult it’ll be to rank prominently for a given search query in search engines like Google. Which helps you understand your potential to generate traffic from a particular keyword (because higher-ranking results usually get more clicks).Competition is most commonly referenced in pay-per-click (PPC) marketing.In PPC, high competition means you’ll have to pay higher costs and meet higher standards to have ads appear for a keyword.Keyword competition is also a concept in search engine optimization (SEO). But it’s more commonly known as keyword difficulty.In SEO, high difficulty means you need to meet higher standards (in terms of content quality, user experience, and/or website authority) to earn a prominent unpaid ranking.NoteLater on, we’ll explain how to check keyword competition with the Keyword Overview tool.How Is Keyword Competition Calculated?Keyword research tools calculate keyword competition in different ways.In Google Keyword Planner, two metrics represent keyword competition in paid search results: Competition: The number of advertisers bidding on the keyword relative to all keywords across Google. If enough data is available, there will be a “High,” “Medium,” or “Low” rating. Competition (indexed value): The number of ad slots filled divided by the number of ad slots available—expressed as a percentage. For example, a score of 75 means a quarter of available ad spaces are unfilled.In Semrush, there’s a PPC metric called competitive density. It represents the number of advertisers bidding on a given term on a scale from 0.0 to 1.0 (anything above 0.8 is considered highly competitive).Semrush also includes a keyword difficulty (KD %) score that’s expressed as a percentage. Which helps you understand organic competition levels (anything above 50% is considered difficult to rank for).This metric is based on numerous factors, including: The median number of domains that link to the top 10 URLs The median Authority Scores of the top 10 domains Characteristics of the search engine results page (SERP)If you enter your domain, you can get a Personal Keyword Difficulty (PKD %) score. Which represents ranking difficulty for your site in particular.It considers your own Authority Score, number of referring domains, etc.Why Are Some Terms More Competitive Than Others?Competition levels vary because some terms are more likely to drive traffic and results than others. To better understand this, consider that keyword competition typically has a positive correlation with two main factors: Keyword search volume: The average number of monthly searches the keyword gets. Higher-volume keywords tend to have wider appeal and relevancy, so they attract more attention and investment. More specific keywords (known as long-tail keywords) tend to have lower volumes and competition levels. Purchase intent: How ready the searcher is to make a purchase. This is particularly important in PPC, because most advertisers want to generate a direct return on their ad spend. (In SEO, it’s more feasible to cost-effectively reach users at all stages of the buying journey.)When you do SEO keyword research or PPC keyword research in Semrush, you can see average monthly search volumes alongside keyword competition metrics. And you’ll likely see this correlation.You can also view the type of search intent (what the user is hoping to achieve with their search) behind each keyword. Which helps you understand the level of purchase intent. Intent Type Description Purchase Intent Level Informational (I) The user is seeking information Low Commercial (C) The user is researching a brand, product, or service Medium to High Navigational (N) The user is seeking a specific website or webpage Medium to High Transactional (T) The user is ready to take action (e.g., make a purchase) High How to Check Keyword CompetitionTo check competition levels for keywords you’ve already chosen, enter your term(s) into the Keyword Overview tool. Then enter your domain, choose your target country, and click “Search.”You’ll immediately see the competitive density and Personal Keyword Difficulty scores.But the tool is much more than a keyword competition checker. It also provides search volumes, intent types, keyword ideas, and more.To check competition levels as you’re discovering new keywords, use the Keyword Magic Tool.Enter a term to base your search around, along with your domain and target country. Then, click “Search.”The tool will collect “Broad Match” keywords that contain your starting term or a close variation.And display various keyword metrics. Including competitive density, keyword difficulty, and Personal Keyword Difficulty scores.Semrush also provides competition metrics in other tools, including: Keyword Gap, which lets you compare your keyword rankings against competitors’ Position Tracking, which lets you monitor your rankings for target keywords Organic Research, which lets you check keyword rankings for a chosen domain Advertising Research, which lets you review any domain’s Google search adsHow to Compete for Desirable TermsIn SEO, it’s wise to target keywords with a 0%-49% (“Very Easy” to “Possible”) PKD%. Because these are more likely to yield high rankings and conversions.The Keyword Magic Tool lets you filter for keywords in your chosen range:Keywords will become relatively easier to rank for as you improve your website’s authority.You can do that by: Creating quality content that caters to your audience’s needs Increasing your topical authority by covering relevant topics comprehensively Using link building to improve your site’s perceived authority Maintaining a solid foundation of good technical SEO Following our on-page SEO checklist to optimize your content for searchPPC makes it possible to rank prominently for keywords that are inaccessible through SEO.But it’s not as simple as making higher bids than your competitors.You also need to create high-quality ads that align with user needs. And build fast-loading, conversion-focused landing pages.Track Your Performance for Competitive KeywordsOnce you’ve started targeting terms with your ads and content, track your keyword rankings.This will give you a sense of how competitive your site is and whether your strategy is working. So you can make more informed decisions in the future.With Semrush’s Position Tracking tool, you can monitor your performance in Google’s paid and organic results. And easily reference the KD % keyword competition metric.",
  "headers": [
    {
      "level": "H1",
      "text": "Understanding Keyword Competition in SEO and PPC"
    },
    {
      "level": "H2",
      "text": "What Is Keyword Competition?"
    },
    {
      "level": "H2",
      "text": "How Is Keyword Competition Calculated?"
    },
    {
      "level": "H2",
      "text": "Why Are Some Terms More Competitive Than Others?"
    },
    {
      "level": "H2",
      "text": "How to Check Keyword Competition"
    },
    {
      "level": "H2",
      "text": "How to Compete for Desirable Terms"
    },
    {
      "level": "H2",
      "text": "Track Your Performance for Competitive Keywords"
    }
  ],
  "author": ""
}