{
  "url": "https://www.semrush.com/blog/keyword-gap-analysis/",
  "slug": "keyword-gap-analysis",
  "title": "Keyword Gap Analysis: What It Is & How to Do It",
  "description": "Learn how to do a keyword gap analysis to find keywords your competitors are ranking for but you aren‘t.",
  "content": "What Is a Keyword Gap Analysis?A keyword gap analysis involves comparing your website’s keyword rankings with your competitors’. And identifying the relevant keywords they rank for that you don’t.This process also helps you uncover keywords they're outperforming you for.A keyword gap analysis is important in building a comprehensive SEO strategy. Because it helps you identify opportunities you might be missing out on. And come up with new content ideas.For example, you can use the Keyword Gap tool to find keywords multiple competitors rank for that you don’t.By creating (or updating) content targeting these keywords, your website can gain more visibility in search engine results. Which could lead to increased organic traffic to your website.Keyword Gap Analysis vs. Content Gap AnalysisKeyword and content gap analyses cover some similar steps. But the main difference is that a keyword gap analysis identifies keywords, while a content gap analysis uncovers content topics.Plus, a content gap analysis often takes the entire customer journey into account. And helps you fill the gaps in your content that may or may not be apparent based on keywords your audience is searching for.For example, let’s say you’re a plumbing company in Boston. You do a keyword gap analysis and find a lot of keywords that your competitors are ranking for but you aren’t. Such as: “plumbing company in boston” “plumbing services boston” “emergency plumbing boston”But you also do a content gap analysis based on the pain points your customers face at different stages of the customer journey. And uncover a lot of topics you could cover on your website to resolve them.That includes topics like: How much does a plumber charge to fix a leak? Does home insurance cover plumbing? Do you tip a plumber?Further reading: Content Gap Analysis: 4 Steps to Earn More Traffic and TrustWhy Perform a Keyword Gap Analysis?Performing a keyword gap analysis and implementing what you learned from it can improve your search rankings and boost your website’s organic traffic.This is critical for remaining competitive within your niche. Otherwise, prospective customers will be more likely to discover one of your competitors instead of you.Plus, discovering keywords you’re not ranking for that your competitors are can be useful for your paid campaigns.Especially if you notice that many of those keywords have commercial or transactional intent. This means that users are looking to do their final research before buying something or are ready to complete an action like a purchase.And a good keyword gap analysis will help you refine your content plan.Next, we’ll walk you through how to do a keyword gap analysis. And what to do with the results once you’re done.How to Do a Keyword Gap AnalysisHere are the steps to find new ranking opportunities through a keyword gap analysis.1. Select Competitors for Your AnalysisSelecting the right competitors for your analysis ensures you’ll get results that are relevant to your business.If you target keywords based on companies that aren’t in your specific niche, you might not see any organic traffic improvements. And if you do, that increase likely won’t lead to a commercial action from visitors.So, how can you find the right competitors? Start by considering who your commercial competition is. These are the companies you likely already know about that directly compete with you based on having very similar products or services. They may even be in a similar geographic region.But you can also find competitors by looking into which brands compete with you from an organic search perspective. Do this with the Organic Research tool.Enter your domain into the tool. And click “Search.”On the report that appears, click “Competitors.”You’ll now see a list of your top organic competitors, how many keywords you have in common with each, and more.To find a broader list of competitors you compete against across all acquisition channels (not just organic search), use Market Explorer.Open the tool, select \"Find Competitors,\" choose your desired location, and enter your domain. Then, click \"Research a market.\"You’ll see an “Overview” report like this:Go to the “All Domains” tab to see a list of competing domains. With insights on how much traffic they’re driving across different channels.Look at the top competitors and pick ones that you haven’t yet identified.By the end, you should have a good list of competitors.2. Find Your Keyword GapsOnce you select the competitors for your analysis, go to the Keyword Gap tool.Enter your domain and up to four competitors’ domains. Then, select your location and click “Compare.”Pro tipChange the “Root domain” drop-down menu to the appropriate alternative if you only want to evaluate a specific part of a competitor’s site. Meaning you would choose “Subfolder” if you want to evaluate a competitor’s blog if it’s something like “example.com/blog.”You’ll then see a report showing how your keywords overlap with your competitors’ keywords. And your top opportunities.Scroll down to see a table that lists all the competitors. And how their keyword profiles intersect with yours.We’ll go over how to use this table next. 3. Analyze Your Keyword GapsNow that the Keyword Gap tool has provided information about how your rankings compare to your competitors’ rankings, let’s review how to analyze the results effectively.Click on the “Missing” tab.You’ll see a list of keywords that all of the analyzed competitors rank for but you don’t.Start going through the list to find keyword opportunities.To further narrow your results, try the filters.Use the “Position” filter to focus on keywords where your competitors rank in the top 10 results. Which can reveal high-impact opportunities. Or, let’s say your domain isn’t well-known and hasn’t built much authority yet. It might be a good idea to filter for only keywords with a relatively low keyword difficulty score.You can do this by clicking the “KD” drop-down menu, setting a manual range from 0 to 49, and selecting “Apply.”You’ll now see only missing keywords with difficulty scores of 49 or lower.Next, explore this list to evaluate some more specific keywords.You’ll want to consider each keyword’s search intent and monthly search volume to determine which keywords you want to focus on and how to use them throughout your site.4. Select and Save Relevant KeywordsThe next step is to use Keyword Gap to save the keywords you want to add to your content plan.In the list of “Missing” keywords with difficulty scores between 0 and 49, select the ones that are most relevant to your company by checking the box next to each.Then, click on the “+ Add to keyword list” button to save them.Name your list in a way that’ll be easy for you and your team members to find and understand later. For example, “Project Management.”Next, click the checkmark to create a list that you can later open in Keyword Strategy Builder.You can also export these keywords to further analyze them offline or share them with your team.Click the \"Export\" button and choose the format you prefer: Excel, CSV, or CSV Semicolon.Repeat this process for the keyword list filtered to show only terms your competitors have a top-10 ranking for. Then, do the same for the “Weak” and “Untapped” tabs. The “Weak” tab shows keywords your competitors are outperforming you for. Meaning, your content targeting those terms likely needs improvement.And the “Untapped” tab shows terms at least one competitor is ranking for but you aren’t. These can be great opportunities for you to add something new to your site and attract more visitors.Make sure to add each new term to the same list.By now, you’ve saved quite a lot of keywords to open in Keyword Strategy Builder. Which you can use to group keywords around similar topics.5. Group KeywordsNext, you’ll want to group your terms into topic clusters (thematically related pages that have a main pillar page and related subpages) and keyword clusters (collections of keywords that share the same intent). This allows you to create pages that build your topical authority. And that all incorporate multiple search terms. To improve your SEO potential.Here’s how:Go to Keyword Strategy Builder. In the “Keyword lists” section, choose the list you created earlier.Once the list is open, click the \"Cluster this list\" option from the top of the dashboard.The tool automatically organizes your keywords into pillar pages and subpages under each pillar page.Click on the gray arrow beside any pillar page or subpage to see its keyword cluster (on the left) as well as articles that already rank well in the search results for those terms (on the right). Keep an eye out for the \"high ranking potential\" tag. These represent pages focused on keyword clusters that have high search volume and low keyword difficulty—which can drive the most traffic for the least effort.Use these keyword topics to create new content. Or, optimize existing content that already includes them (but isn’t ranking well).6. Create New Content and Optimize Old ContentYou’re now equipped with new keywords and page ideas, which you can use to create new content and update existing pieces. To boost your performance in search results and increase organic traffic to your website.Use SEO Writing Assistant in your content writing process to ensure your content is optimized.To access SEO Writing Assistant from Keyword Strategy Builder, click on “Write content” next to the topic you want to write about.Choose whether you want to optimize your content for desktop or mobile (labeled as “Phone”).Then, click “Send keywords” to send the keyword cluster to the SEO Writing Assistant.Start writing your new content in the text editor.On the right, you’ll notice a graph rating your article in four categories: Readability SEO Originality Tone of voiceBy clicking on each of these categories, you’ll get a list of recommendations to improve your content.For example, click on “SEO.”And scroll down to see a list of recommendations.Implement these recommendations to make the most out of your article.If you’re not unsure which part of the article suggestions refer to, click on “Highlight Issues.” And select “SEO.”This will highlight the portion of the article that needs improvement from an SEO perspective.Once you’ve implemented suggestions and the content is ready, publish it on your website.7. Monitor Your Ranking ChangesIt’s important to monitor your performance in search results. To see whether the improvements you made are having an impact. And to troubleshoot potential problems that might arise.You can easily track your content’s performance with Position Tracking.TipIf you’re using this tool for the first time, go through these configuration instructions first.Go back to the topics you created in Keyword Strategy Builder.Choose the pillar pages or subpages you used when creating and updating content. And click on “Send keywords.”Choose the circle next to “Position Tracking” and click “Apply.”Next, choose the appropriate project. And click “Send keywords.”You’re now tracking these keywords. And you’ll be able to see how your website progresses in search results over time.In Position Tracking, click the “Overview” tab and scroll down to “Rankings Overview” to see how your content is performing.Here, you can see your pages’ positions in search results for each keyword you’re tracking.Don’t forget to keep adding keywords you create content for. So you can stay on top of how you’re performing for all your target terms.Find Keyword Opportunities You’re Missing Out OnWhen done right, a keyword gap analysis can help you significantly improve your rankings in search results and increase organic traffic to your site.Ready to get started?Try Keyword Gap today to begin exploring valuable keyword opportunities for your website.",
  "headers": [
    {
      "level": "H1",
      "text": "Keyword Gap Analysis: What It Is & How to Do It"
    },
    {
      "level": "H2",
      "text": "What Is a Keyword Gap Analysis?"
    },
    {
      "level": "H2",
      "text": "Keyword Gap Analysis vs. Content Gap Analysis"
    },
    {
      "level": "H2",
      "text": "Why Perform a Keyword Gap Analysis?"
    },
    {
      "level": "H2",
      "text": "How to Do a Keyword Gap Analysis"
    },
    {
      "level": "H3",
      "text": "1. Select Competitors for Your Analysis"
    },
    {
      "level": "H3",
      "text": "2. Find Your Keyword Gaps"
    },
    {
      "level": "H3",
      "text": "3. Analyze Your Keyword Gaps"
    },
    {
      "level": "H3",
      "text": "4. Select and Save Relevant Keywords"
    },
    {
      "level": "H3",
      "text": "5. Group Keywords"
    },
    {
      "level": "H3",
      "text": "6. Create New Content and Optimize Old Content"
    },
    {
      "level": "H3",
      "text": "7. Monitor Your Ranking Changes"
    },
    {
      "level": "H2",
      "text": "Find Keyword Opportunities You’re Missing Out On"
    }
  ],
  "author": ""
}