{
  "url": "https://www.semrush.com/blog/keyword-search-volume/",
  "slug": "keyword-search-volume",
  "title": "Keyword Search Volume: What It Is & How to Find It",
  "description": "Keyword search volume usually refers to the average number of monthly searches a keyword gets in Google.",
  "content": "What Is Keyword Search Volume?Keyword search volume is the average number of monthly searches for a particular search term in a particular location. And typically refers to searches in Google.For example, Semrush’s Keyword Overview tool shows that “dog food” has a Google search volume of 135K in the U.S.:This means there are an estimated 135,000 Google searches for “dog food” in the U.S. in a typical month.NoteSemrush search volumes are based on Google searches from the previous 12 months. Our U.S. database has the most accurate search volumes on the market.Why Are Search Volumes Important?Search volumes indicate the level of interest in a keyword. And how much traffic your search results could generate.That means they can help you choose the best keywords for: Search engine optimization (SEO): Efforts to rank in organic (unpaid) search results Pay-per-click (PPC) marketing: Efforts to rank in sponsored (paid) search resultsThat said, high-volume keywords aren’t always relevant to your business. And they tend to attract strong competition from other websites.So, it’s important to consider search volumes alongside other keyword metrics. (More on this later.)How to Find Keyword Search VolumesOne of the best ways to find Google search volumes is with Semrush’s Keyword Magic Tool.Enter a term to base your search around, choose your target country, and click “Search.”The tool will present a list of “Broad Match” keywords that contain your starting keyword or a close variation.And display their monthly search volumes in the “Volume” column.To check if a keyword is relevant, click the icon in the “SF” column. This lets you look at the Google results page in your chosen location (as of the date shown in the column to the right). So you can see what kinds of results perform well.Take a look at the other metrics provided in Keyword Magic Tool, too.If you’re doing keyword research for SEO, enter your domain into the purple box. Then, look at the Personal Keyword Difficulty (PKD %) column.This tells you how hard it’ll be for your specific domain to rank in Google’s top 10 organic results. And you may want to compare it to the general keyword difficulty (KD %) metric. Because when your Personal Keyword Difficulty score is the lower of the two numbers, it indicates the term is especially relevant to your website.If you’re doing keyword research for PPC, pay attention to the “CPC (USD)” column. Which shows the average cost per click advertisers pay for each keyword.And the Competitive Density (Com.) column, which lets you know the level of competition between advertisers. On a scale from 0.00 (least competitive) to 1.00 (most competitive).TipYou can also find keyword search volumes and other metrics in these tools: Keyword Overview: Gather metrics for pre-selected keywords Topic Research: Get content ideas based on your chosen topic Organic Research: Enter a URL to see what keywords it ranks for Keyword Gap: Compare your keyword rankings against competitors’How to Find Local Keyword Search VolumesWith the Keyword Overview tool, you can find local search volumes—i.e., search volumes in particular regions or cities. This helps you understand your potential reach in target areas. And better understand your localized audiences.To get started, enter a keyword into the search bar.Then, choose your target country and sub-location. And click “Search.”The tool will display the local and national search volumes:You can also get other useful metrics for local keyword research.And analyze the results page for your chosen search location.TipClick keywords found in other Semrush tools (e.g., Keyword Magic Tool) to open them in Keyword Overview. Make sure to enter your target location once you get there. What Is a Good Search Volume for a Keyword?What makes a good search volume depends on the keyword’s competitiveness, cost, and potential business value. For example, 100 monthly searches might be good for a low-competition, low-cost, and high-value keyword. Because the volume is likely to translate into worthwhile traffic and conversions.But 100 monthly searches probably isn’t good for a high-competition, high-cost, and low-value keyword. Because the volume is unlikely to translate into worthwhile traffic and conversions.You can evaluate these factors together in the Keyword Magic Tool.If you’re researching keywords for SEO: Look at the search volume in the “Volume” column Evaluate competition levels with the Personal Keyword Difficulty score Analyze the results page to determine the potential costs of creating top-ranking content Analyze search intent (what the searcher wants to achieve) by looking at the “Intent” column and reviewing the search results page. To understand the keyword’s potential business value (i.e., how likely it is to drive conversions and how valuable these conversions could be).If you’re researching keywords for PPC: Look at the search volume in the “Volume” column Measure competition with the Competitive Density metric Evaluate potential costs with the average CPC metric Analyze search intent (what the searcher wants to achieve) by looking at the “Intent” column and reviewing the search results page. To understand the keyword’s potential business value (i.e., how likely it is to drive conversions and how valuable these conversions could be).Understanding Search Volume TrendsMany factors influence actual monthly search volumes, including: Seasonality: Some searches are tied to seasonal events (e.g., Christmas) Trends: Current events and trending topics can cause spikes in searches Marketing campaigns: Effective marketing can drive more online searches User behavior: Shifts in user habits (e.g., the rise of mobile search) Market factors: Competitor activities, economic indicators, etc.In Semrush, the “Trend” graph shows how actual search volumes have fluctuated over the past 12 months. If you need more context, search your keyword in Google Trends. You can see how search interest has changed since 2004.Look out for the following kinds of keywords: Evergreen keywords: Terms that get consistent interest across the year. These tend to be good candidates for SEO and long-term ad campaigns. Seasonal keywords: Terms that get more interest at specific times of year. For the best results, you must plan your SEO and PPC efforts accordingly. Fad keywords: Terms that experience a sudden and short-term spike in interest. These may be appropriate for advertising but aren’t good for SEO. Declining keywords: Terms that are getting gradually less popular. These may prove less beneficial for your business than current search volumes suggest. Rising keywords: Terms that are getting gradually more popular. These may prove more valuable for your business than current search volumes suggest. Monitor Your Keyword RankingsWhatever keywords you decide to target, track your rankings. To monitor your performance.Semrush's Position Tracking tool lets you monitor your organic and paid rankings for target keywords in target location(s). So you can see what's working and what isn't. And act accordingly.",
  "headers": [
    {
      "level": "H1",
      "text": "Keyword Search Volume: What It Is & How to Find It"
    },
    {
      "level": "H2",
      "text": "What Is Keyword Search Volume?"
    },
    {
      "level": "H2",
      "text": "Why Are Search Volumes Important?"
    },
    {
      "level": "H2",
      "text": "How to Find Keyword Search Volumes"
    },
    {
      "level": "H3",
      "text": "How to Find Local Keyword Search Volumes"
    },
    {
      "level": "H2",
      "text": "What Is a Good Search Volume for a Keyword?"
    },
    {
      "level": "H2",
      "text": "Understanding Search Volume Trends"
    },
    {
      "level": "H2",
      "text": "Monitor Your Keyword Rankings"
    }
  ],
  "author": ""
}