{
  "url": "https://www.semrush.com/blog/keyword-strategy/",
  "slug": "keyword-strategy",
  "title": "Keyword Strategy in SEO: What It Is & How to Create One",
  "description": "A keyword strategy defines the search engine queries you want to rank for and how you‘ll target them.",
  "content": "What Is a Keyword Strategy?A keyword strategy is a plan that defines the search engine queries you want to rank for, how you’ll try to rank for them, and in what order. Meaning it helps you prioritize keywords and target them effectively.And it’s distinct from keyword researchWhile keyword research provides the data you need, a keyword strategy gives data meaning and direction. To ensure that your optimization efforts align with your business’s goals and resources.For example, keyword research might tell you that “online accounting software” gets searched over 10 times more than “accounting software for contractors.”But as part of your keyword strategy, you might decide to focus on the latter. Because it’s less competitive and more relevant to your audience.How to Create a Keyword StrategyLearning how to create a keyword strategy helps you maximize your SEO efforts. Which can help boost search engine traffic and conversions.Follow these steps for success:1. Review Your Existing RankingsBy reviewing your existing keyword rankings, you can create performance benchmarks. And find opportunities to improve.To get this data, sign in to Google Search Console (GSC).Go to “Performance” > “Search results.” And check all the boxes at the top.Scroll down to the “Queries” table to see the keywords you ranked for over the selected time range.Along with the following data: Clicks: The number of times users clicked your result Impressions: The number of times your result was shown CTR: The click-through rate (the percentage of impressions that generated clicks) Position: Your average organic ranking over the selected time range (the lower, the better)Click “Export” to save this data in a Google Sheets, Excel, or CSV file.To quickly see which pages have the most potential for improvement, import your keywords and target pages to Semrush’s On Page SEO Checker.The tool analyzes the target page and the top 10 results for each keyword. To provide tailored optimization ideas.After setting it up, scroll down to “TOP pages to optimize” to see pages with the most potential.Then, click “# ideas” next to a URL to see its recommendations.2. Consider Your Wider Marketing GoalsRemember your wider marketing goals as you create your keyword strategy.Why?Unified marketing strategies tend to be more efficient and effective—especially on smaller teams. Because everything’s pulling in the same direction.For example, let’s say you’re launching a vegan protein powder.Your plans already include sending an email newsletter, posting on social media, and sending out a press release. But make sure to target relevant keywords as well. By publishing an SEO-optimized landing page and related blog posts.This ensures your launch has the biggest possible impact. Which will likely improve the campaign’s overall profitability. And help establish your brand as a topical authority.Aligning keyword strategies with marketing goals also keeps brand messaging consistent.For example, keyword research might tell you that “cheap watches” has high search demand. But targeting that keyword might conflict with your positioning as a luxury brand.So, it’s crucial to make your keyword decisions based on what’s most relevant to your brand. And not get preoccupied with keyword research alone.TipIf you haven’t already, create buyer personas and define your brand identity. This will help you recognize keywords with the most business potential.3. Identify Keyword OpportunitiesKeyword opportunities are relevant keywords you don’t rank for yet. And filling these gaps can help you reach and eventually convert members of your target audiences.You can use many keyword research methods to find keyword ideas. But one of the easiest ways is with Semrush’s Keyword Gap tool.Enter your domain and up to four competitors’ domains. (The tool provides suggestions to help.)Then, choose your country and click “Compare.”You’ll see an overview of the keywords that you and your competitors rank for.Scroll down and select “Missing” to see keywords that all rivals rank for but you don’t. Click “Untapped” to see keywords that at least one competitor ranks for but you don’t.Like in this example:This can give you some ideas for keywords to target. Another method is to use Semrush’s Keyword Magic Tool.Simply enter a seed keyword to base your search around. Then, choose your country and click “Search.”The “Broad Match” tab will show you results containing your starting keyword or a close variation.You’ll learn how to identify the best keywords for your SEO keyword strategy later in this guide.4. Organize Your KeywordsAs you gather keywords, you'll notice that some are naturally related to common themes. And it’s a good idea to group them in a few ways.First, create topic clusters—groups of thematically related and interlinked pages. Which help you establish deeper authority in particular areas.Each topic cluster include two types of pages: Pillar page: Think of a pillar page as the main hub or foundation for a broad topic Subpages: These are more specific pages that dive into subtopics of your pillar page’s topicNext, you’ll want to create keyword clusters—groups of search terms that share the same search intent (the reason motivating the search) and can be targeted within the same page. To allow you to rank for more keywords.Semrush’s Keyword Strategy Builder simplifies the process of building out pillar pages, subpages, and keyword clusters for each page.To get started, enter up to five keywords you identified earlier and choose the location of your target market. Then, click “Create list.”Once the tool is ready, you’ll see a visual representation of your suggested pillar pages and subpages. And a detailed breakdown below.In this case, Keyword Strategy Builder suggests using “brewed coffee” as the primary (main) keyword for a pillar page. And creating subpages on related topics such as “coffee filters” and “commercial espresso machine.” Each line displays the page’s primary keyword. But the metrics represent values for the page’s entire keyword cluster (click the gray arrow next to any page to view its full keyword cluster).That means you see the overall search intent, search volume (the average number of monthly searches), and keyword difficulty (a measure of how difficult it’ll be to rank) for the entire group of keywords each page is targeting. This lets you evaluate search opportunities more accurately. Instead of just focusing on one keyword.NoteBeware of getting too focused on search volume. As we explain throughout this keyword strategy guide, many other factors affect a keyword’s potential.5. Consider the Search LandscapeThe search landscape refers to the search engine results page (SERP) composition for a keyword. It determines what opportunities there are to rank. And how likely users are to see and click each result.In the example below, the first organic result for the keyword “coffee routine” appears right at the top. And there are no ads.This suggests that a high organic ranking for this keyword could drive a lot of clicks.In the next example, the top organic result appears below an ad and map pack (this is a type of specialized result called a SERP feature). This means organic results could get lower CTRs. So, you might be better off optimizing for prominent SERP features. Or, pursuing other keywords instead.To understand the search landscape for a specific keyword, pay attention to a few metrics in Semrush’s Keyword Magic Tool. NoteAdd your domain name in the purple bar that reads “AI-powered feature if you want to get personalized results. We’ll go over those in more detail later in this guide.Pay attention to competitive density (Com.)—a measure of Google Ads competition on a scale from 0 to 1. With higher scores meaning more competition. And look at the SERP features as well. To see which SERP features appear for a given term: Clicking any one of the keywords takes you to the Keyword Overview tool.Scroll down to the “SERP Analysis” section to see the overall number of results and all the SERP features available for that keyword. Click “View SERP” to take a look at the results in full.Search landscapes are liable to change. But these snapshots should help you identify search results that’ll get the most clicks. So you can optimize your SEO keyword strategy accordingly.6. Evaluate Keyword IntentKeyword intent is the purpose behind a user’s search. And it’s vital for determining which keywords to focus on and how. Why?Because if you don’t satisfy user needs, you’re unlikely to rank.For example, you’d probably struggle to rank high for “nintendo switch” with a blog post. Because the search results are dominated by product listing ads and product pages:Intent can also tell you where the user is in the marketing funnel. And how likely they are to convert.For example, someone who searches “nintendo switch games” is more likely to make an immediate purchase than someone who searches “upcoming nintendo switch games.” So, the first keyword might deliver more value upfront.While Keyword Strategy Builder provides a general sense of intent for each keyword cluster, it’s a good idea to look into the intent for individual search terms. To get a fuller sense of what type of content to create. Semrush’s Keyword Magic Tool shows you the type of search intent at a glance: Informational (I): Searchers want to find information Navigational (N): Searchers want to find a specific site or page Commercial (C): Searchers want to investigate brands, products, or services Transactional (T): Searchers want to complete an action (e.g., make a purchase)If you’re looking to plug particular gaps in your funnel, filter by search intent.Like this:Then, evaluate your odds of ranking.7. Assess Your Ranking PotentialBefore you pursue a keyword, check how competitive it is by evaluating its keyword difficulty score. So you know if you have a reasonable chance of ranking for it. Semrush also provides a personal keyword difficulty (PKD %) score out of 100. Which is determined by using AI to evaluate your domain's relevance to the term, the competition level for the topic, and how your domain compares to rival domains. It’s a good idea to target at least some keywords with lower personal keyword difficulty scores. Why?Because they’re likely easier to rank for. Which can help you start building tropical authority on a subject. To find these opportunities, filter for keywords with a personal difficulty score of “Easy” or “Very Easy”:For an even better understanding of your ranking potential, take a look at the Keyword Overview to see the level of topical authority your site has. And the potential position you could reach in the search results. For example, GameStop sells games and consoles but doesn’t offer repair services. So, their topical authority on “nintendo switch repair” is moderate. And they may struggle to rank well. It might be better for them to focus on keywords they have more topical authority on. Like “nintendo switch games” or “nintendo switch accessories.”8. Take Stock of Your ResourcesTo build an effective keyword strategy for SEO, you must know what resources are at your disposal.This includes: Time Money Skills Knowledge Tools For example, you’ll struggle to rank for “how to play pickleball video” if you don’t have the skills and tools required to make a video. Or, the budget to hire a professional.It’s also helpful to take stock of your existing assets, such as: Blog posts Ebooks Videos Testimonials and case studies Proprietary data ImagesIt’s likely that many of these assets have untapped potential. So, leveraging them effectively could help you achieve keyword goals more quickly and easily.For example, if you already have an infographic about “pickleball court dimensions,” it might make sense to pursue this keyword before one that requires brand-new content.9. Plan and Prioritize Your ContentOnce you’ve evaluated your keywords, go back to Keyword Strategy Builder. And determine which pillar pages and subpages to prioritize based on your findings.Then, decide where and how to create those pages. We recommend creating a keyword map. Like this:In the document, note whether each page needs to be improved or created. And decide on a priority order for each task.For example, you might focus on improving key landing pages. Before creating blog posts that target untapped keywords.To get content recommendations, enter your keywords into Semrush’s SEO Content Template tool.You’ll see a suggested word count, readability score, and more.10. Track Your Results and Keep AdaptingWhatever goals you’re working toward, it’s important to track your progress.Measuring SEO metrics lets you know what’s working and what isn’t. So you can adapt your keywords strategy accordingly.With Semrush’s Position Tracking tool, you’ll see where you rank for your target keywords. And get alerts about important changes.Just click on the bell icon after setting up your project. And set the desired trigger(s).Go to the “Overview” tab and scroll down to the “Rankings Overview” to see rankings for your target keywords. And see at a glance whether you rank in any SERP features.To see SERP features you’re missing out on, use the filter at the top.Position Tracking also allows you to check performance by page, group keywords using tags, create PDF reports, and more.For an overview of your top landing pages, use Organic Traffic Insights.The tool compiles useful data from Semrush, Google Search Console, and Google Analytics 4 (GA4).Build Your Own Keyword StrategyCreating an effective keyword strategy is key to maximizing your SEO efforts. By prioritizing and targeting the right keywords, you can improve your chances of ranking. And drive more traffic to your site.To simplify this process, take advantage of tools like Semrush’s Keyword Strategy Builder. Ready to start creating your keyword strategy? Sign up for a free Semrush account today.",
  "headers": [
    {
      "level": "H1",
      "text": "Keyword Strategy in SEO: What It Is & How to Create One"
    },
    {
      "level": "H2",
      "text": "What Is a Keyword Strategy?"
    },
    {
      "level": "H2",
      "text": "How to Create a Keyword Strategy"
    },
    {
      "level": "H2",
      "text": "1. Review Your Existing Rankings"
    },
    {
      "level": "H2",
      "text": "2. Consider Your Wider Marketing Goals"
    },
    {
      "level": "H2",
      "text": "3. Identify Keyword Opportunities"
    },
    {
      "level": "H2",
      "text": "4. Organize Your Keywords"
    },
    {
      "level": "H2",
      "text": "5. Consider the Search Landscape"
    },
    {
      "level": "H2",
      "text": "6. Evaluate Keyword Intent"
    },
    {
      "level": "H2",
      "text": "7. Assess Your Ranking Potential"
    },
    {
      "level": "H2",
      "text": "8. Take Stock of Your Resources"
    },
    {
      "level": "H2",
      "text": "9. Plan and Prioritize Your Content"
    },
    {
      "level": "H2",
      "text": "10. Track Your Results and Keep Adapting"
    },
    {
      "level": "H2",
      "text": "Build Your Own Keyword Strategy"
    }
  ],
  "author": ""
}