{
  "url": "https://www.semrush.com/blog/kpi-marketing/",
  "slug": "kpi-marketing",
  "title": "16 Marketing KPIs You Need to Monitor in 2024",
  "description": "Unlock success by learning how to identify, track, and act on marketing KPIs in 2024.",
  "content": "What Is a KPI in Marketing?Key performance indicators (KPIs) are quantifiable metrics measuring how companies achieve a specific goal. There are KPIs for every department in a company, whether it’s marketing, sales, or any other division.Marketing KPIs measure how effective your marketing efforts are. Defining and tracking marketing KPIs is important because it enables you to: Measure progress: Determining which marketing initiatives meet or exceed expectations Optimize budget: Directing spending towards channels that maximize return on investment (ROI) Guide decision-making: Extracting data-driven insights that can inform strategic decisions Identify weaknesses: Identifying underperforming campaigns or assets that can be improved 16 Marketing KPI Examples to Track in 2024There are various marketing KPIs to track. Some common marketing KPI examples include customer leads, conversion rate, and return on investment (ROI). These KPIs can be tracked for individual channels or campaigns but also for a company as a whole. But there are also channel-specific KPIs. Like organic sessions for SEO or engagement rate for social media. For instance, here’s the “Insights” dashboard from Instagram that shows social media metrics you may be tracking as KPIs:Let’s look at some of the most important general marketing KPIs. As well as KPIs for SEO, paid, email marketing, and social media channels. General Marketing KPIsGeneral marketing KPIs focus on core data points—like conversions and ROI—that are relevant irrespective of which channels you focus on. These KPIs help you understand how much value your marketing efforts drive. 1. Customer LeadsA customer lead is an organization or an individual with the potential to become your customer. Or someone who has expressed an interest in your offering. For example, a person who has filled out a contact form on your site or signed up for a free trial is a lead. Like when a visitor clicks “Start your free trial” in the following Semrush call to action (CTA):There are two broad categories of leads: Marketing qualified leads (MQLs): A prospect who engaged with your marketing initiatives. For example, downloading an ebook or clicking on a Facebook ad. Sales qualified leads (SQLs): A prospect that has shown an intent to buy (by booking a demo, for example) and is ready to talk to the sales teamTracking the number and quality of leads helps you determine potential future revenue. More leads could mean more paying customers.Also, monitor which channels and campaigns bring leads. Then, invest additional resources into the marketing initiatives that perform exceptionally well. 2. Cost Per LeadCost per lead (CPL) is the amount you pay to acquire a new lead from your marketing efforts. You can track CPL across different channels and campaigns. So you can assess which activities generate leads at the lowest cost. Calculate CPL by dividing your marketing spend (whether total or in specific channels and campaigns) by the number of leads generated: ​Analyzing CPL can yield important insights. A rising CPL, for instance, might indicate decreasing efficiency in your marketing campaigns or strategies.You can also compare your CPL performance against industry benchmarks. Find marketing trends and stats to benchmark against in Semrush’s The State of Content Marketing: 2023 Global Report.If your performance is below the industry average, then you can analyze your marketing to understand what can be improved. Maybe your ads or landing pages need to be refreshed. Or perhaps the product features need to be expanded. 3. Conversion RateConversion rate is the percentage of users who take a desired action after interacting with your marketing ads, campaigns, and other assets.This desired action can range from signing up for a newsletter to making a purchase. Or any other objective you want your audience to complete.Calculate the conversion rate by dividing the number of conversions (e.g., users making a purchase) by the number of users who clicked on your ad or visited your landing page. Multiply the result by 100 to get a percentage. Like this:Conversion rate helps you understand how much of your traffic turns into leads. And how many of these leads turn into paying customers and contribute to revenue. Tracking conversion rates of ads and pages also enables you to test which messaging, CTAs, and page designs are effective in driving conversions. So you can further optimize conversion rates.4. Customer Lifetime ValueCustomer lifetime value (CLV or CLTV) is the total revenue a business can expect to earn from a customer during their entire business relationship. CLV is a vital metric for understanding your business. To be profitable, your CLV needs to be higher than your sales and marketing spend for acquiring a single customer.Here’s a simple formula to calculate CLV:For example, let’s say that your: Average transaction value = $100 Average number of transactions in a year = 5 Average retention rate = 2 yearsYour CLV for this customer is $100 x 5 x 2 = $1,000You can boost CLV by nurturing prospects and upselling existing customers. So that you generate more revenue from a single customer. Here’s an example of an upsell offer in which a watch bands company offers a discount to its newsletter subscribers, many of which are existing customers:If successful, this discount offer would enable the company to generate more revenue from its existing customer base, boosting CLV in the process.5. Return on Marketing InvestmentReturn on marketing investment (ROMI) refers to the amount of money your marketing efforts generate compared to their cost.A positive ROMI shows marketing is contributing to the company’s bottom line. And that you spend your marketing budget effectively. Here’s the formula to calculate ROMI for a campaign or a channel:For example, an online retailer sends out a promotional email to their subscriber list, costing them $1,000 in design and distribution costs. This results in $20,000 in sales at a 30% margin.Your ROMI would look like this: Gross profit = $6,000 ($20,000 × .30) Marketing cost = $1,000ROMI = ($6,000 − $1,000) / $1,000 x 100 = 500%You can compare ROMIs of different channels or campaigns to identify and double down on the best-performing ones. Maybe you’ll discover that Facebook social media ads are more effective than LinkedIn ads. Or that organic traffic yields the highest ROMI of all your channels.High ROMI also helps you convince stakeholders to invest more money in specific marketing initiatives.SEO KPIsSEO can be an effective marketing channel. But it takes time to deliver results, which is why measuring relevant KPIs is vital to understand if you’re going in the right direction.6. Keyword RankingsKeyword ranking is your webpage’s position in search results for a specific search query. For example, Semrush has an article on link building. When users enter “link building SEO” in a search engine, our link building guide appears in the top spot for that query. Like this:Pages can rank for multiple keywords. And the top three organic search positions get over two-thirds of all clicks. Tracking your keyword rankings as a KPI and improving them is important because it translates into more website traffic. You can use Semrush’s Position Tracking tool to monitor your website’s rankings for a custom set of target keywords. The tool allows you to set up campaigns and receive regular updates on how your rankings are changing over time. This information is crucial for assessing the effectiveness of your SEO efforts and adjusting your strategy accordingly.Head to the tool, enter your URL, and press “Set up tracking” to get started.Follow our configuration guide on how to set up your tracking campaign, then add the keywords you want to monitor. Then, click “Start Tracking.” You’ll receive daily updates providing you with a summary of the number of keywords for which your domain has pages ranking. This allows you to track this vital KPI and make any necessary adjustments quickly and efficiently.For example, you may notice that you completely lost a keyword ranking. Or that your page ranks a few spots lower than the position previously held. You can investigate why this happened and hopefully reverse the trend. Maybe competitors produced a better piece of content than yours. You can then improve the quality of your piece to regain lost rankings. 7. Organic SessionsA session is a time period in which a user engages with a website or an app. For instance, a user enters your site, opens a few pages, and leaves. This is counted as a single session.Organic sessions are initiated by visitors who land on your site by clicking on organic search results.Tracking organic sessions as a KPI helps you understand how much organic traffic your site attracts. And how effective your marketing efforts are. You can find organic sessions in Google Analytics 4 (GA4). To get started, open GA4 and head to the “Reports” tab. Then, click “Engagement” > ”Landing page.” Then, go to the top-right corner to set the time period you’re interested in. Last, click the “Add filter +” button in the upper center part and set the following conditions to display only organic search visits: “Dimensions”: Session default channel group “Match Type”: Exactly matches “Value”: Organic search Then Click “Apply.” You can sort pages by various metrics, such as sessions and users. Identify top-performing pages to understand which topics and content formats drive the most organic visitors. You can then cover similar topics and move away from those that don’t resonate with readers. Further reading: Google Analytics for Beginners: Getting Started with GA48. BacklinksBacklinks are links on other websites that point to your website. For example, we got a backlink from Backlinko as it linked to one of our studies, as seen below:Google treats backlinks as an endorsement of your site. That’s why they’re one of the most important ranking factors. Especially when they come from a variety of reputable domains instead of a small number of low-quality sites.Your site becomes more authoritative in the eyes of Google as you acquire more backlinks. This can translate into better keyword rankings and more organic traffic.You can use Semrush’s Backlink Analytics to check which sites link to you. Head to the tool, enter your domain or URL, and click “Analyze.” You’ll now reach the “Overview” dashboard. You’ll find important data points here, including Authority Score (AS). This is our proprietary metric measuring the domain’s reputability. You can also see how many referring domains and backlinks your site acquires over time. You want these metrics to trend upward all the time. Compare your site with your competitors by adding their domains to the root domain fields at the top.Now, you’ll learn how your backlink profile compares to that of your competition across various metrics, including AS, referring domains, and more.For instance, your backlink profile may be weaker than that of your competitors. You can then explore link building techniques to grow backlinks and catch up with your SEO competition.Paid Channels KPIsTracking relevant KPIs for paid channels ensures that you spend every advertising dollar efficiently. Let's explore the essential KPIs for this channel and why they matter.9. Return on Advertising Spend Return on advertising spend (ROAS) refers to the revenue earned from money spent on advertising. Track ROAS to get a clear picture of how your ad budget translates into revenue. Marketers can track ROAS across different campaigns, channels, and platforms. ROAS is simple to calculate. Divide the revenue generated from the ad campaign by the total ad spend. For example, imagine a local boutique that sells handcrafted jewelry. They run a Facebook ad campaign that costs $500. After a month, the campaign has brought in $2,500 in sales. The ROAS would be five, which means they earned $5 for every dollar spent.A positive ROAS indicates that the campaign is profitable, while a ROAS of less than one indicates that the campaign is unprofitable. You can prioritize campaigns or channels with positive ROAS. And either discontinue or improve unprofitable ads by crafting more engaging visuals, better headlines, and clearer calls to action. 10. Cost Per AcquisitionCost per acquisition (CPA) is the amount of marketing spend it takes to acquire a paying customer in a specific channel (or in total). This spend includes all costs, from salaries and software to any other type of overhead. Here’s a simple formula to calculate the CPA of your paid ads campaign for a given period:Track CPA to understand if your ads are profitable and efficient. To turn a profit, for example, your CPA should be lower than your customer lifetime value (CLV). A high (or growing) CPA might indicate a decreasing efficiency of your paid ads. You can reduce CPA by testing different ad targeting, copy, and visuals. You can also optimize conversion rates with improved messaging and landing page designs. Tracking CPA on a per-channel basis can yield further insights. Maybe you’ll notice Google Ads campaigns deliver customer acquisitions much cheaper than Facebook Ads and SEO. So you can then dedicate more budget to Google Ads. 11. Cost Per MilleCost per mille (CPM), also known as cost per thousand, is the amount of money advertisers pay for every 1,000 impressions their ads receive. Impressions refer to the number of times an ad is displayed and seen by web users. CPM helps advertisers forecast how much money it would cost to reach their audience with a specific ad. This helps marketers plan and stay within budget. Many platforms calculate CPM automatically. Here’s what it looks like inside Facebook’s Ads Manager dashboard:You can also calculate CPM manually with this formula:Tracking CPM is especially useful for optimizing brand awareness ads. You can lower your CPM by targeting audiences with specific demographics or interests. For example, adult car owners are more likely to engage with car detailing ads than high school teens who may not even have cars. Advertising platforms reward engaging ads with broader reach, which translates into lower CPM. Email Marketing KPIsWhether you run a newsletter or use emails for nurture campaigns, tracking the right KPIs can help you optimize your email marketing efforts. Let’s dive into some of the most important email marketing KPIs. 12. SubscribersSubscribers refer to the individuals who have opted in to receive your emails. Most email platforms will monitor your number of subscribers. Here’s what it looks like in Mailchimp:The number of subscribers is a critical KPI because it reflects the size of the audience you can reach with your email campaigns.Subscribers can also be nurtured and converted through well-crafted email campaigns. And they are more likely to convert than other prospects if you have built a relationship with them.You can grow your subscriber base in different ways. For example, you can offer a discount or valuable information in exchange for their email address. And once people sign up, deliver value constantly so they stay engaged instead of unsubscribing soon after. 13. Open RateOpen rate is the percentage of recipients who open an email compared to the total number of emails sent out. This data point is typically provided by your email marketing platform. Here’s what it looks like in the Mailchimp marketing platform:Tracking open rates helps you gauge the engagement and relevance of your email campaign. High open rates indicate that the subject line resonates with the audience. Monitor open rates continuously. It allows you to compare the performance of different subject lines over time. Maybe you’ll notice shorter subject lines or those with a question mark work better than others. Like the title of the following email from Semrush:If you notice your open rates going down, you may consider revamping the email’s subject line and sender name.You can also send different emails and subject lines to different segments of your audience. For example, a pet store might send different email offers or content to cat owners versus dog owners.14. Click-Through RateEmail click-through rate (CTR) is the ratio of users who click on a specific link in your email to the number of total recipients who have opened the email. Most email marketing platforms track this metric. Here’s what it looks like in the Mailchimp marketing platform:CTR reveals how many people engage with your content and want to learn more about your offer or your brand. You can benchmark your CTR against industry standards. For example, the average click-through rate in ecommerce is 2.01%. If you work in this industry and have a CTR above the average one, your email marketing campaigns are likely performing well.Writing great email content can help improve your CTR. Get to the point fast, make your content skimmable, and support copy with strong visuals. Also, keep your content consistent in both the design and copy. Like how writer and growth consultant Lenny Rachitsky does in his emails:You can learn more about writing great emails in our email content guide. Social Media KPIsSocial media is a core channel in many marketing strategies. Social platforms collect data on their audiences and make it easy to track KPIs, like the ones we cover below. 15. Follower CountFollower count is the total number of people who follow your social media profiles across different platforms. You can easily find this figure on your social profiles. Here’s an example of Semrush’s Facebook profile showing the number of likes it has:Follower count helps you gauge the popularity of your brand. And provides you with more people who can potentially see your content. Brands still need to create engaging content, though. A large follower count doesn’t guarantee that each follower will see each of your posts. Follower count also acts as a social proof. For example, customers may perceive an ecommerce brand with 100k Facebook followers as more credible than a competing brand with only 50 followers. A growing follower count may translate into more revenue. That’s why tracking follower count as a social media KPI is important. 16. Average Engagement RateThe average engagement rate (AER) is the percentage of people who liked, commented, shared, or saved your content relative to the number of your followers.You can calculate AER easily. Divide the total number of engagements your social content received by the total number of posts in a specific time period. Then, divide the result by the number of your followers. And multiply it by 100 to get the rate. Here’s the formula:Some social media platforms already track this metric for you. Here’s what it looks like on LinkedIn’s analytics platform:AER offers a high-level view of how well your social media content resonates with your audience. Tracking AER over time helps understand the impact of your content strategies. For example, maybe you doubled down on video content three months ago. And you noticed the engagement rate skyrocketing ever since then—which indicates you made the right move. Monitoring AER across platforms helps you understand where your content resonates the most. And you can then focus more on those platforms. You can also explore our suite of social media marketing tools. For instance, Social Media Analytics helps you track KPIs and set up automated reporting. While Social Poster makes it easy to create, schedule, and share posts across multiple social platforms. Further reading: 18 Social Media KPIs (and How to Track Them)How to Track Marketing KPIsYou’ll likely need to track multiple KPIs across various channels. Done manually, this process of extracting, arranging, and visualizing data points can be time-consuming. But tools like Semrush’s My Reports can save you a lot of time. Head to this tool and either use one of the existing templates, like “Monthly SEO Report,” or set up a new custom report by clicking “Start from scratch.”The tool allows you to add various widgets, including those from GA4, Google Ads, Google Search Console, and more. The widgets are visualizations of specific data points. The end report can look impressive. Here’s an example of one page of a completed Google Ads report.Learn more about using Semrush reporting features.Start Tracking and Acting on Your Marketing KPIsTrack relevant KPIs to identify opportunities to exploit and challenges to address. Because a single insight you act on can unlock massive wins for your brand. Utilize the various Semrush tools mentioned above—like Position Tracking, Backlink Analytics, and the Social Media Toolkit—to access the wealth of data needed to run such data-driven marketing. Ready to get started? Sign up for a free trial today.",
  "headers": [
    {
      "level": "H1",
      "text": "16 Marketing KPIs You Need to Monitor in 2024"
    },
    {
      "level": "H2",
      "text": "What Is a KPI in Marketing?"
    },
    {
      "level": "H2",
      "text": "16 Marketing KPI Examples to Track in 2024"
    },
    {
      "level": "H2",
      "text": "General Marketing KPIs"
    },
    {
      "level": "H3",
      "text": "1. Customer Leads"
    },
    {
      "level": "H3",
      "text": "2. Cost Per Lead"
    },
    {
      "level": "H3",
      "text": "3. Conversion Rate"
    },
    {
      "level": "H3",
      "text": "4. Customer Lifetime Value"
    },
    {
      "level": "H3",
      "text": "5. Return on Marketing Investment"
    },
    {
      "level": "H2",
      "text": "SEO KPIs"
    },
    {
      "level": "H3",
      "text": "6. Keyword Rankings"
    },
    {
      "level": "H3",
      "text": "7. Organic Sessions"
    },
    {
      "level": "H3",
      "text": "8. Backlinks"
    },
    {
      "level": "H2",
      "text": "Paid Channels KPIs"
    },
    {
      "level": "H3",
      "text": "9. Return on Advertising Spend"
    },
    {
      "level": "H3",
      "text": "10. Cost Per Acquisition"
    },
    {
      "level": "H3",
      "text": "11. Cost Per Mille"
    },
    {
      "level": "H2",
      "text": "Email Marketing KPIs"
    },
    {
      "level": "H3",
      "text": "12. Subscribers"
    },
    {
      "level": "H3",
      "text": "13. Open Rate"
    },
    {
      "level": "H3",
      "text": "14. Click-Through Rate"
    },
    {
      "level": "H2",
      "text": "Social Media KPIs"
    },
    {
      "level": "H3",
      "text": "15. Follower Count"
    },
    {
      "level": "H3",
      "text": "16. Average Engagement Rate"
    },
    {
      "level": "H2",
      "text": "How to Track Marketing KPIs"
    },
    {
      "level": "H2",
      "text": "Start Tracking and Acting on Your Marketing KPIs"
    }
  ],
  "author": ""
}