{
  "url": "https://www.semrush.com/blog/local-business-seo/",
  "slug": "local-business-seo",
  "title": "A Step-by-Step Guide to Local Business SEO",
  "description": "Learn the basics of local business SEO and improve your online visibility with our comprehensive guide.",
  "content": "If you run a brick-and-mortar business, local business SEO can help you drive more customers to both your website and physical location.In this article, we’ll explain how to get started with local SEO for small businesses.What Is Local SEO?Local SEO is a strategy that aims to improve how frequently your business appears in local search results.Its goal is to help brick-and-mortar businesses get more website and in-person visits from users in nearby areas.How to Get Started with Local SEOFollow these seven steps to get started with local SEO.1. Claim and Optimize Your Google Business ProfileGoogle provides businesses with a free listing called a Google Business Profile.Optimizing your Google Business Profile will improve your business’s visibility in search engine results across Google Search, Google Maps, and Google’s other services.If your business is discoverable through Google Maps, Google will automatically create a Google Business Profile for it. All you need to do is claim it. Go to the Google Maps page and use your Google account details to log in.Enter the name of your business in the search bar.Click on your business name. Then scroll down and click on “Claim this business.”On the next screen, click the “Manage now” button.Google will ask you to verify that you manage the business. The verification methods available to you will depend on the business category, region, and other factors. But common methods for most businesses will include either phone or video verification.Once you complete the verification, you’ll be able to manage your Google Business Profile. Note that it might take Google up to seven days to review your verification.Follow these steps to optimize your Google Business Profile:Double-Check Essential Business InformationIf you’ve just claimed your profile, there’s a chance not all the information is accurate. Double-check the most important information about your business: Name Business address Business phone number Website URL Business hoursChoose the Right CategorySelecting an appropriate category for your business is crucial for getting discovered more frequently by searchers.In fact, 84% of local searches are for a product or service. Not a specific business name. There are also category-specific features you can gain access to. For example, restaurants get the option to add a reservation button or a menu to their profile.After selecting a primary category, you can also choose secondary categories. For example, if your primary category is “Grocery Store,” you can also select the type of grocery store you run as a secondary category (e.g., “Gourmet Grocery Store”).Add AttributesYou can also add category-specific attributes to your profile. Restaurants, for example, can add attributes such as “Dine-in,” “Takeout,” and “Delivery.”Make sure to add any relevant attributes that might be useful to your customers.Upload Photos of Your BusinessAccording to Google, businesses that upload photos to their profile get 42% more requests for driving directions through Google Maps. They also generate 35% more clicks to their website compared to businesses that don’t upload photos.Add high-quality photos of your business and products to your profile.Remember to adhere to Google’s image guidelines while doing so: Use JPG or PNG images. Make sure the image size is between 10 KB and 5 MB Use a resolution of 250 x 250 px or higher Ensure the photo is in focus and well-lit Avoid excessive use of image filtersAdd Products or ServicesMake it easier for customers to see what you offer by adding your products or services to your profile.Include the name, description, and price of each product or service you add.2. Conduct Local Keyword ResearchPerforming keyword research will help you uncover what search terms people use when looking for products or services in your area.You can then optimize content on your website for these terms. Using these terms, or keywords, gives you a better chance of getting your business displayed in local search results.Here are three methods you can use to uncover keywords you should target when doing SEO for local businesses.Use Semrush’s Keyword Magic ToolThe Keyword Magic Tool can suggest relevant keywords you can target based on a single seed keyword (a broad keyword that’s highly relevant to your business). On the Keyword Magic Tool page, type in your seed keyword. Then, hit the green “Search” button.The tool will present you with a list of keywords.You can filter the list by search volume, keyword difficulty, search intent, and more. This allows you to focus on keywords that are easier to rank for but have a decently high search volume.And clicking on keywords provides even more information, including some metrics that are specific to your local area.Analyze Your Competitors’ WebsitesAnother way to find relevant local keywords is to look at your competitors’ websites to see what they’re ranking for.You can use Semrush’s Organic Research tool to do this. Enter a competitor website and click the “Search” button.The tool will give you a detailed report. Click on the “Positions” tab.You’ll then be able to see a list of all the keywords the website is ranking for.To exclude keywords that include your competitor’s brand name, click on “Advanced filters.”Now, you can select keywords that are relevant for your business and export them by hitting the “Export” button.Hold on to this list. Because you’ll need to use it when creating content for your website.3. Create Location-Specific Content on Your WebsiteA big part of SEO for a local business involves creating content specific to your area and publishing it on your website.This helps associate your business and website with a physical location. And allows you to establish your business as a local authority.You can use the keywords you uncovered in the previous step as a starting point for the topics you should cover with your content. Here’s how to do it.Prioritize Keywords Based on Difficulty and VolumeThe keyword research you performed in the previous step likely resulted in a large list of keywords. Prioritize the right keywords so your pages can rank faster and start driving visitors from Google search results sooner.A good way to prioritize: Start with keywords that are fairly easy to rank for but have a high search volume. You can use Semrush’s Keyword Difficulty metric to understand how difficult it’s going to be to rank well for a specific keyword.For example, going back to the “Positions” tab in the Organic Research tool report from the previous step, you could simply use the “KD” drop-down to filter the keyword list to only show “Very Easy” or “Easy Keywords”.Then, sort that list based on keyword volume by clicking on the “Volume” column header in the report.This way, you’ll end up with a list of keywords that are relatively easy to rank for, sorted by search volume (from highest to lowest).Create High-Quality ContentOnce you know which keywords to target with your content, it’s time to actually create the content itself.Keep in mind that, in order for content to rank and be effective in driving customers, it needs to be of high quality. But what does high-quality content look like?According to Google, high-quality content is comprehensive and based on original information derived from analysis or research. Here’s how you can create high-quality content: Perform extensive research. Start by doing in-depth research on the topic you’re covering. Read existing content on the topic, watch videos or listen to podcasts related to the topic, and interview subject matter experts. Be comprehensive. Try to cover the topic comprehensively, answering all the questions readers might have about the topic Use data. Incorporate data from studies or surveys to back up your claimsFinally, optimize your content for Google Search. We’ll show you how to do this in the next section.4. Optimize Your Website for Local SearchFor the best chance of having your business displayed in relevant local searches, you need to optimize your website for local search. Here’s how to do it.Analyze Your Website for On-Page SEO IssuesUse Semrush’s On Page SEO Checker to find on-page SEO issues you need to fix on your website. Enter your domain and click the “Get ideas” button.Next, select a target location for Google Search targeting.Click the “Continue” button.The tool will automatically pull pages from your website to check for issues.To continue, click the “Collect ideas” button.You can also: Add pages yourself by clicking the “Manually” tab Upload a .CSV file containing your desired target pages by clicking the “File” tab Integrate data from Google Analytics and Google Search Console by clicking the “GSC” tab and connecting your Google account Add landing pages and keywords from Semrush’s organic research database by clicking the “Organic Research” tabThe tool will analyze your chosen pages and provide you with a detailed report. You can review the optimization suggestions by clicking on the “Optimization ideas” tab.To view suggestions for a specific page, click on the associated “Ideas” button.You’ll get a list of optimization suggestions for that page, along with a detailed explanation for each one.Use SEO-Friendly URLsGoogle has specific guidelines on how to structure page URLs. Such as: Use simple, descriptive words Don’t use non-ASCII characters Use hyphens to separate words, not underscoresApart from these official guidelines, practical tips you should consider are: Use your primary keyword as the URL slug. This helps both users and Google understand what your page is about. Organize website content into subfolders. Subfolders are directories within your website’s main directory (e.g., www.domain.com/blog/). Organizing content in this way makes it easier to navigate your website. Use lowercase. Avoid using both uppercase and lowercase in your URLs. This helps you avoid broken links that might occur if you accidentally use the wrong case when linking to a page.Optimize Title Tags and Meta Descriptions The title tag tells Google how you want the title of your webpage to be displayed in search results.Your title tag should clearly state what your page is about. It should also contain the primary keyword you want the page to rank for.Keep the title tag between 50-60 characters to reduce the chances of it being cut off on the search results page.Google also displays meta descriptions in search results. Use the meta description to add more information about the content of your page.Keep the meta description at around 100 characters. To increase the number of people who click on your page in the search results, use action verbs in your meta description and let users know how they’ll benefit from visiting your page.You can use a tool like To The Web to check the length of your title tags and meta descriptions. Use Header Tags ProperlyHeader tags are used to structure content on a webpage. They help both search engines and users find the main points within your content and navigate a page more easily.Header tags range from H1 to H6.H1 is the most important heading tag on a page. Use it for the title of the page and include the primary keyword you’re targeting. There should only be one H1 tag on every page.Use H2 tags for the main points discussed throughout your content. Some of the H2 tags on a page should contain your primary or secondary keywords to help Google understand what your content is about.Use H3, H4, H5, and H6 tags for subsections. Put keywords in these tags if they fit naturally, but don’t overdo it.Add Internal LinksInternal links make it easier for users to navigate your website. They also assist Google in discovering and then indexing all the pages on your website more effectively.Each page you create should link to other relevant pages on your website.But how do you know which pages should link to each other? Follow these steps: Identify the most important pages on your website. Consider which pages provide the most complete information about what your business does. This will usually include your homepage plus product or service pages. Link to your most important pages frequently. Where it makes sense, link to one or more of your most important pages from other pages on your website. This will signal to Google which pages on your website are the most important for website visitors. Focus on contextual links. Most of your internal links should be contextual — included within the page content at places where it makes sense to do so based on the context. For example, if you mention a specific topic on a page and also have a more detailed guide on the topic on a different page. Don’t force links in just for the sake of including a link.Another important aspect of effective internal linking is anchor text (the clickable text part of a link).A good anchor text for your link tells both Google and visitors what the page you’re linking to is about.Strive to use short anchor text for your links (up to five words). Avoid using click-bait style “click here” anchor text and opt for descriptive anchor text that hints at what the page is about.If the page you’re linking to is targeting a specific keyword, it’s also good practice to use that keyword (or a variant of it) as the anchor text.Semrush’s Site Audit tool can help you uncover any internal linking issues on your website. Enter your domain name and click the “Start Audit” button.You can customize your audit, but the default settings are also a great place to start. Click the “Start Site Audit” button to run the tool.The tool will then audit your website for issues. Once the report is generated, click on the “View details” button in the “Internal linking” section.You’ll then be able to see all the internal linking issues the tool has discovered on your website.You can click on the “Learn more” and “Why and how to fix it” links next to every issue to learn more about each specific issue.Improve Your Website’s SpeedGoogle has confirmed that page speed is a ranking factor for both desktop and mobile searches.Strive to make your website as fast as possible to get higher rankings in local search results.Here are a few things you can do to improve your website speed: Upgrade your web hosting. Avoid using shared hosting, where multiple websites are hosted on the same server. Instead, opt for dedicated hosting from a reputable hosting provider. Use a Content Delivery Network (CDN). A CDN can speed up your website by delivering content from servers that are physically closest to your website visitors. Popular CDN providers include Cloudflare and Akamai. Remove unnecessary scripts. Scripts (like those created with the JavaScript programming language) can add dynamic capabilities to your website. Sometimes, you might have unnecessary scripts running on your website and slowing it down. Review the scripts on your website and remove any you don’t need. Minify scripts. There will be scripts you can’t remove without affecting website functionality. Use a tool like Minifier to reduce the size of these scripts and have them load faster. Compress images. Large, high-definition images can take a while to load, which slows down your website. For faster loading, use a web-friendly image format (such as WebP) or compress your images using a tool like Kraken. Optimize fonts. Loading fonts can slow down your website. To avoid this, opt for self-hosting fonts (instead of loading them from a third-party website) or use a system font (the default font used on a user’s device).You can also use Semrush’s Site Audit tool to uncover issues affecting your page speed. Click on the “View details” button in the “Site Performance” section of the report.You’ll get a report outlining the issues you need to address to improve your website’s performance and how to fix them.5. Ensure Accuracy and Consistency of Your NAP CitationsNAP stands for your business name, address, and phone number.NAP citations are mentions of your business name, address, and phone number online. These often appear in business directories, as well as your Google Business Profile and your social media profiles.It’s crucial that your NAP information is accurate and consistent across the internet.Why?Because Google will use it to verify your business information and match your business and website with the right local searches.You can find all your business’s NAP citations and ensure they’re accurate with Semrush’s Listing Management tool. In the Listing Management tool, type in the name of your business.The tool will present you with a list of businesses with that name. Choose the correct one based on your business address.Alternatively, you can search for your business by typing in your website or phone number.Once you find your business, click on the magnifying glass. The tool will analyze your NAP citations and give you a report. It will show you: A grade for your overall online presence The number of NAP citations you need to fix The average star rating for your business The total number of reviews found for your business onlineIf you scroll down, you’ll see a list of all the directories with missing or inaccurate NAP information for your business.You can export the list by clicking on the “Export to PDF” button at the top.If you have a paid subscription, you can also have the tool automatically distribute your correct business information to dozens of directories.6. Create an Online Review Management ProcessA Semrush study revealed a correlation between the number of reviews a business has and its performance in local search results.In other words: The more satisfied customers leave reviews for your business, the better for your local business SEO.Here’s a step-by-step online review management process you can follow.Take a Proactive Approach to Generating ReviewsIf you want to get reviews for your business, you can’t just wait for customers to do it on their own. You need to be proactive and ask customers to leave a review for your business.Here are a few ideas: Ask customers to do it once they’re ready to leave your store. Use in-store signs to remind customers to leave a review. Collect customers’ email addresses and send them an automated review request email. Post on your social media channels and ask previous customers to rate and review your business.One important thing to keep in mind: Google’s content policies prohibit paid or incentivized reviews. So, avoid using tactics such as offering discounts or paying people to leave a review for your business.Set Up Automated Review MonitoringWith Google Business, Yelp, and dozens of other popular review sites out there, it's hard to stay on top of customer reviews for your business. This is where review monitoring software can help.You can use Semrush’s Listing Management tool to monitor and reply to all incoming reviews from your customers.In the Listing Management tool, go to the “Review Management” tab.Here, you’ll be able to see and reply to all the reviews customers have left for your business. You can sort the reviews by rating or date.To reply to a review, click on the “Enter your reply” field below the review, type in your response, and click the “Reply” button.Respond to All ReviewsRespond to all reviews left for your business, regardless of whether they’re positive or negative. This shows that you care about your customers. And that you’re quick to address customer dissatisfaction.For positive reviews, it’s best practice to thank the customer for leaving the review. And show that you appreciate and value them.Respond to negative reviews as soon as possible. Address the customer’s issues and try to turn their negative experience into a positive one.Always be respectful while doing so. And acknowledge the customer’s frustration.7. Monitor and Analyze Your Local SEO EffortsMonitor your local SEO performance closely. This will help you understand whether your strategy is working or needs to be changed.You can use Semrush’s Position Tracking tool to see how your website is ranking for specific keywords. Enter your domain and click the “Set up tracking” button.Choose a location for your business and enter your business name in the pop-up that appears.Then, click on “Continue To Keywords.”On the next page, enter the keywords you’d like to track. You can also import keywords from a .TXT or .CSV file.Finally, hit the “Start tracking” button.The tool will then gather the data for your keywords and present you with a detailed report of your keyword performance. Click on the “Overview” tab to see an overview of your rankings by keyword.Improve Your Local SEO with SemrushYou’ve reached the end of our guide on local SEO for small businesses.Follow the steps above to give your business the best chance of ranking well in local search results.And to give your efforts a head start, sign up for a free trial of Semrush.",
  "headers": [
    {
      "level": "H1",
      "text": "A Step-by-Step Guide to Local Business SEO"
    },
    {
      "level": "H2",
      "text": "What Is Local SEO?"
    },
    {
      "level": "H2",
      "text": "How to Get Started with Local SEO"
    },
    {
      "level": "H3",
      "text": "1. Claim and Optimize Your Google Business Profile"
    },
    {
      "level": "H4",
      "text": "Double-Check Essential Business Information"
    },
    {
      "level": "H4",
      "text": "Choose the Right Category"
    },
    {
      "level": "H4",
      "text": "Add Attributes"
    },
    {
      "level": "H4",
      "text": "Upload Photos of Your Business"
    },
    {
      "level": "H4",
      "text": "Add Products or Services"
    },
    {
      "level": "H3",
      "text": "2. Conduct Local Keyword Research"
    },
    {
      "level": "H4",
      "text": "Use Semrush’s Keyword Magic Tool"
    },
    {
      "level": "H4",
      "text": "Analyze Your Competitors’ Websites"
    },
    {
      "level": "H3",
      "text": "3. Create Location-Specific Content on Your Website"
    },
    {
      "level": "H4",
      "text": "Prioritize Keywords Based on Difficulty and Volume"
    },
    {
      "level": "H4",
      "text": "Create High-Quality Content"
    },
    {
      "level": "H3",
      "text": "4. Optimize Your Website for Local Search"
    },
    {
      "level": "H4",
      "text": "Analyze Your Website for On-Page SEO Issues"
    },
    {
      "level": "H4",
      "text": "Use SEO-Friendly URLs"
    },
    {
      "level": "H4",
      "text": "Optimize Title Tags and Meta Descriptions"
    },
    {
      "level": "H4",
      "text": "Use Header Tags Properly"
    },
    {
      "level": "H4",
      "text": "Add Internal Links"
    },
    {
      "level": "H4",
      "text": "Improve Your Website’s Speed"
    },
    {
      "level": "H3",
      "text": "5. Ensure Accuracy and Consistency of Your NAP Citations"
    },
    {
      "level": "H3",
      "text": "6. Create an Online Review Management Process"
    },
    {
      "level": "H4",
      "text": "Take a Proactive Approach to Generating Reviews"
    },
    {
      "level": "H4",
      "text": "Set Up Automated Review Monitoring"
    },
    {
      "level": "H4",
      "text": "Respond to All Reviews"
    },
    {
      "level": "H3",
      "text": "7. Monitor and Analyze Your Local SEO Efforts"
    },
    {
      "level": "H2",
      "text": "Improve Your Local SEO with Semrush"
    }
  ],
  "author": ""
}