{
  "url": "https://www.semrush.com/blog/marketing-budget/",
  "slug": "marketing-budget",
  "title": "How to Create a Marketing Budget in 9 Steps (+ Free Template)",
  "description": "Learn how to create a marketing budget for your brand. Plus, get a free template to start tracking costs today.",
  "content": "What Is a Marketing Budget?A marketing budget outlines the expenses a business plans to allocate toward marketing in a specific time frame. Budgets are typically established on an annual or quarterly basis. The expenses detailed in a marketing budget may include the following: Marketing team salaries Software costs Web hosting Ad placement Press relations expenses Outsourcing costsHow much you should spend on marketing depends on a range of factors, including: Industry size Growth stage Annual revenue Location Customer base Overall business strategyDownload our free marketing budget templateHow to Determine Your Marketing BudgetCommon approaches include: Spending a fixed percentage of your revenue or overall budget on marketing Basing your marketing budget on industry benchmarks Allowing your business goals to determine your marketing expenditure Let’s consider each method. Marketing Budget as a Percentage of Revenue or Overall BudgetIn this method, you allocate a set percentage of your total revenue or overall budget to marketing expenses. In 2023, the average marketing budget was 9.1%of total revenue, according to Gartner’s CMO Spend and Strategy Survey. 2023 Marketing Budget as a Percent of Total Revenue (2019-2023)Image Source: GartnerYour marketing budget will be influenced by various factors. Like your company’s growth stage. And industry. For example, consumer packaged goods companies allocated an average of 22.61% of their overall budgets to marketing in 2023. For mining and construction companies, that percentage dropped to 3.75%.This Statista graph shows various industries’ average marketing expenses as a percentage of overall budget: Image Source: StatistaMarketing Budget Informed by Industry BenchmarksIn this method, you research what other businesses in your industry or niche spend on marketing. This information informs your marketing budget allocation. Every industry has marketing norms. And benchmarks. Some industries dedicate a larger portion of their overall budget to marketing than others. Similarly, the distribution of marketing budgets across various channels will vary from industry to industry. The data in the table below shows the average marketing budget by industry, based on CMO Survey data.Useful industry benchmarks include: The average total amount spent on marketing Which channels are favored by companies in your industry How much companies in your niche typically spend on each channel How effective businesses similar to yours find individual marketing channelsWhere can you find this information? Find recent industry averages in marketing or industry research reports. For instance, The CMO Survey regularly conducts surveys of chief marketing officers. And publishes the results for free. Sites like Statista publish benchmarking data. But often require a membership to access it. Industry associations, LinkedIn groups, forums, and industry newsletters are good places to learn about marketing norms. And trends in your industry. Semrush’s Advertising Research tool lets you explore and analyze competitors’ paid search ad history. Allowing you to see what they spend on pay-per-click (PPC) marketing. Marketing Budget Driven by Business GoalsStart with the business outcomes you want to achieve through marketing. And work backwards from there.For example: You set a goal to acquire 100 new customers using a specific channel. To calculate how much you need to budget for marketing to reach this goal, you first need to know how much it costs to acquire one new customer. Then, multiply that number by the number of new customers (100). And add fixed marketing costs. Like payroll and software. If your customer acquisition cost is $250 per customer, and your fixed marketing costs amount to $13,000, the equation would look like this:($250 x 100) + $13,000 = $38,000To reach your customer acquisition goal, you’d budget $38,000 for this marketing campaign. Repeat this process for each marketing goal. Whether you want to grow your following on social media, increase organic traffic to your website, or drive product demo signups.This is only a guideline. To establish your marketing budget, consider your business numbers and goals.Marketing Budget ExamplesSometimes, the fastest way to learn is by example. Sample Marketing Budget for a Small Business Company: FreshBite Catering Industry: Food & beverage Offering: Catering services for corporate events, weddings, and special occasions Annual revenue: $500,000 Marketing budget as a percentage of revenue: 10% ($50,000) Target customer: Corporations, event planners, engaged couples, and individuals hosting events Marketing goals: Increase brand awareness, boost catering bookings, and expand client baseSample Startup Marketing Budget Company name: SmartSavings App Industry: Financial technology (Fintech) Offering: Mobile application for personal finance management, budgeting, and savings Annual revenue: $500,000 (post-funding) Marketing budget as a percentage of revenue: 15% ($75,000) Target customer: Millennials and young professionals seeking to improve their financial habits Marketing goals: Increase app downloads, user engagement, and brand recognition through targeted digital advertising, influencer partnerships, and app store optimizationSample B2B Marketing Budget Company name: DataInsight Analytics Industry: B2B software as a service (SaaS) Offering: Business intelligence and analytics platform for data-driven decision-making. Annual revenue: $8,000,000 Marketing budget as a percentage of revenue: 12% ($960,000) Target customer: Mid-sized to large enterprises across various industries seeking to leverage data for strategic insights. Marketing goals: Strengthen brand authority through thought leadership content, nurture leads with targeted email campaigns and webinars, and expand reach through strategic partnerships with industry influencers and consulting firmsCommon Marketing CostsMarketing costs refer to all the expenses involved in promoting a brand, product(s), or service(s), such as the following: Web development SEO Ads Software Salaries Freelance help Event venue rental Marketing agency feesBasically, it's all the money you spend to get the word out about your business. And attract new customers. The key to staying within your budget is paying attention to the details. It’s also a good idea to build some flexibility into your budget. To account for unexpected expenses. Paid AdvertisingPaid advertising costs include the expenses associated with advertising.Paid media accounted for 25.6% of marketing budgets in 2023, according to Gartner’s report.Paid advertising includes traditional advertising media. And online paid advertising opportunities.Examples include: Ads in print media TV commercials Radio spots Billboards and other physical displays Search engine ads Display ads Retargeting campaigns Affiliate marketing commissions Social media marketingPaid advertising costs are not just placement fees. Factor in the costs of creating content, managing the campaigns, and budgeting for ads that vary by engagement. Such as cost-per-click (CPC) and pay-per-click (PPC) models. Payroll and New EmployeesLabor typically accounts for 24.6% of a CMO’s budget. Agencies and services make up 23.3%, according to the Gartner CMO survey. Image Source: GartnerMarketing talent costs include payroll. And benefits like raises and bonuses for marketing staff. And recruitment costs involved in hiring new employees. Marketing talent includes: Creative directors Artists/creatives Copy editors SEO strategists Writers Marketing managers Data analysts Photographers Videographers PPC specialists Copywriters Content managers Graphic designers Content creators Video editors Sound engineers Social media marketersNew marketing hires come with additional costs. Like recruiting, onboarding, and training. And equipment and software licenses or “seats.”Freelancers and AgenciesIn-house, agency partner, or freelancer? This is a question you’ll likely face when establishing and updating your marketing budget. Currently, 20.2% of marketing tasks are outsourced. This number is expected to increase by 5% within the next year. Image Source: The CMO SurveyMany marketers hire outside help. Like freelancers, agencies, and other vendors. Outsourcing has its pros and cons. Some of which we’ve listed below.Pros: Freelancers and agencies extend your in-house capacity Outsourcing avoids many costs associated with permanent staff You can hire on-demand experts who would otherwise command high salaries Hiring an agency is often more efficient than doing the work in house If you lack the skills, resources, or equipment to execute a project in house, outsourcing can bridge these gaps Paying hourly or per-project gives you greater budget flexibility Cons: Experienced freelancers and vendors with specialized skills are expensive Finding talented, reliable freelancers can be difficult and time-consuming Outsourcing can involve a lot of feedback and back-and-forth to get on the same page Agencies and freelancers require active management to ensure you’re getting your money’s worth. Outsourcing involves more ongoing admin than hiring full-time staff. Like managing contracts and invoices.Marketing SoftwareMarketing software covers a wide range of tools. To plan, create, manage, and track marketing campaigns. To name a few: Analytics software: Try a tool like Google Analytics to track campaign performance SEO reporting tools: Use tools like Keyword Magic to conduct keyword research. And Site Audit to track the performance of your website. CMS platforms: For managing and publishing content Email marketing software: For managing contact lists SMS marketing tools: For mass communication Project management software: To streamline collaboration. And keep teams on track. Marketing automation software: For streamlining marketing workflows Social media scheduling tools: Look for tools like Social Poster that let you easily schedule posts. And analyze results. Image and video editing software: For creating brand assets Lead prospecting and CRM tools: For managing sales and customer relationshipsBefore you invest in any marketing software, learn about each tool's features. And read reviews and customer testimonials.Content CreationContent creation costs overlap considerably with talent, outsourcing, and even software costs. And content creation is often the most expensive part. Aside from the cost of hiring professional creatives, content costs include all the materials, tools, equipment, software, resources, and other incidental expenses involved in creating marketing collateral. To give you an idea of content marketing costs, here are some statistics: $112,000 was the average annual salary for a full-time U.S.-based content marketer in 2023. 69% of marketers allocate more than 10% of their marketing budget to content 20% of marketers spend $3,000–$5,000 on content per monthWhere Are Marketers Focusing Their Marketing Spend?In 2023, CMOs planned to increase investments in the following categories: Social advertising: 53% Digital video advertising: 51% Influencer marketing: 49% Digital display advertising: 46% SEO: 46%Change in Investments for Digital Channels in 2023 (Percentage of Respondents)Image Source: GartnerIncreasing investment in social media, digital video, and influencer marketing makes sense. Considering the popularity of video-based social channels like TikTok, YouTube, and Instagram Reels. You might not shift your budget to new channels right away. But it can help steer your marketing strategy in the long term. And help you choose where to start experimenting.Download our free marketing budget template How to Develop a Marketing Budget1. Define Your Marketing GoalsWith clearly defined objectives, you can identify which channels and tactics to prioritize. From there, it’s much easier to calculate the costs involved. And estimate your return on investment (ROI). So you can allocate funds where they’ll have the most impact.The SMART goals framework offers a simple approach to creating clear, achievable goals. Specific: Be clear and precise about what you want to achieve. Measurable: Set metrics and criteria to track progress and evaluate performance. Like the number of email signups or conversion rate. Actionable: Set goals that are realistic. And achievable. With the available resources and time. Relevant: Set goals that align with broader business objectives. Like increasing sales and improving brand awareness. Time-bound: Establish clear time frames and deadlines. And schedule milestones to measure progress.For example, say your goal is to increase website traffic. Here’s how to turn that into a SMART goal: Specific: Improve organic website traffic Measurable: Improve organic website traffic by 20% Actionable: Hire an SEO agency to write optimized blog posts. To improve organic website traffic by 20%. Relevant: Hire an SEO agency to write optimized blog posts to improve organic website traffic by 20%. To increase brand awareness. And generate leads. Time-bound: Hire an SEO agency to write optimized blog posts. To improve organic website traffic by 20% by year-end to increase brand awareness. And generate leads.SMART goals help you budget because you know exactly what you want to achieve. And when. They keep you focused. And ensure you're not just going through the motions. But making real progress.2. Understand Your Audience Successful marketing hinges on knowing your ideal customers inside out. And targeting them with laser-like focus. Understand your target audience by creating detailed buyer personas. The more you know about your ideal buyer, the less guesswork marketing involves. And the more efficiently you can allocate your marketing budget. A buyer persona is a hypothetical customer profile that represents a segment of your audience. Buyer personas reflect your target customers’ behavior, motivations, preferences, and problems. And how your business solves them. To create your buyer personas, start by gathering data about your current and prospective customers. Use surveys, interviews, and data from Google Analytics. And other platforms.Look for patterns that reveal their motivations. And pain points. It’s a lot easier to sell a product when you know exactly who you’re talking to. And which of their needs your offer addresses. Once you have useful insights, create three-to-five personas. If you try to cast the net too wide, your messaging will not be specific enough to be relatable. Next, add demographic and psychographic data. Include the following: Age Sex Job role Income level Geographic locationPrefer to use a template? Use the Semrush Persona tool for free. Select a person who looks like one of your (potential) customers. Click “More Photos” below the images if none of the initial options feel right. Once you select a photo, choose one of three templates: Default template: A general template for creating a buyer persona. Adjustable to your specific needs. B2B template: Designed for business-to-business scenarios, this template can be altered to fit your particular business requirements User persona template: Specifically for detailing the characteristics of current or potential users of your product or serviceClick on the template you’d like to use. Fill out the template with details describing your hypothetical customer. Next, add demographic information. Like age, location, education level, and income level. Complete the sections in any order. Upload a different photo if you prefer. Here’s an example of a completed persona:Remember, the more specific your customer personas, the easier it is to connect with your audience. And help ensure you use your marketing budget effectively. 3. Determine Monthly ExpensesIt’s a good idea to understand how much you spend just to operate the business. Before you decide how much money to allocate to future marketing projects.Review your historic monthly marketing spend. Taking into account ongoing expenses like: Payroll Software subscriptions Website hosting fees Website maintenance Monthly advertising costs Incidental expenses that vary month-to-month. Like outsourcing to freelancers.The idea is to arrive at a baseline. That can serve as your minimum monthly budget for marketing. Don’t forget to build in a buffer for unexpected costs. Or opportunities. 4. Research the Competition Taking inspiration from your competitors’ marketing efforts can help guide your own marketing strategy. And budget. Learn from their successful campaigns. And identify gaps in their strategy. Use the following tools to analyze your competitors’ marketing tactics. And expenditures. Traffic Analytics: See how much traffic your competitors get Organic Research: Find keyword opportunities. By comparing your site’s ranking keywords to those of competitors’ sites. Advertising Research: Research your competitors’ ad strategies Social Tracker: Audit your competitors’ social media strategiesFor example, use Organic Research to view details about your competitors' ranking keywords, website traffic, traffic cost, and more. Drill down into the data to discover exactly which keywords they’re ranking for (and which in positions). Identify their top pages, track position changes, and explore which SERP Features are boosting their search visibility. 5. Audit Past Marketing PerformanceAnalyze data from previous marketing campaigns to identify which channels, tactics, and campaigns were most (and least) cost-effective. At feeding your sales funnel. Here are some marketing metrics to explore: Revenue/sales growth: Increase in sales in a specific time frame Number of impressions or views: How many users viewed your content or ad Click-through rate: How many users clicked on your content or ad Conversion rate: What percentage of users completed a desired action. Like submitting a form, subscribing to your newsletter, downloading a file, or completing a purchase. Return on investment: Revenue growth minus advertising costs Cost per conversion: Average cost of a completed action (number of conversions divided by campaign cost) Organic traffic: Traffic resulting from content marketing Direct traffic: Traffic resulting from branded searches. This can signal brand awareness.The more you drill down into your marketing data, the more insight you’ll gain into precisely why a specific tactic worked. This, in turn, makes it easier to create successful campaigns in the future.Further reading: Top 50 Marketing KPIs for Businesses and Agencies6. Use a Marketing Budget Template Start with a budget template that provides guidelines by dividing your potential marketing expenses into categories. To better understand the types of expenses to anticipate. And budget for. Plus, it’s much easier and faster to fill out a template than start with a blank spreadsheet.Free Marketing Budget Template Use our free, comprehensive marketing budget template as a starting point. And customize to meet your needs. Get our free marketing budget template here.Each budget sheet is divided into subsections so you can organize your expenses by category. Like “software,” “content creation,” and “distribution.” Get as granular as you want when planning your budget. Each line item includes a field for “Projected Spend” and “Actual Spend.” So you can easily monitor your budget at a glance. The template includes a built-in marketing budget calculator that automatically adds up your totals as you input numbers. And make updates.Our template also features separate tabs you can use for individual channels, categories, or campaigns. For example, you might use the template to create a “master budget” for video advertising as a channel. And use additional tabs to create production and promotion budgets. For each individual video.7. Allocate Your Marketing SpendA common way to distribute marketing spend is by following the 70-20-10 rule. This means allocating: 70% toward proven marketing efforts that have been known to yield good results. Like blogs that drive organic traffic. Or high-conversion Instagram ads. 20% to newer or less established strategies that have gained some traction and show promise. Like scaling up your video-based marketing. 10% of the budget for “moonshot” marketing experiments. These are new and unproven channels or initiatives. That could potentially offer impressive results. Like testing a new social media platformFor example, your digital marketing budget might account for 70% of your spending. While 20% goes to traditional advertising channels. The final 10% might be allocated to something like ordering custom company swag (merchandise).8. Choose Your Marketing Channels Wisely Prioritizing the right channels is a key part of your marketing budget. When we say “channel,” we mean every medium that can be used to create an audience touchpoint. Not just different social media platforms.Examples of marketing channels include Billboards Printed materials Emails SMS Push notifications Blogs Search ads Display ads Videos Affiliate programs Webinars Offline activities and events Various social media platforms Broadcast mediaHow much of your marketing budget should you allocate to each channel? It depends on which channels offer the best potential ROI. For your particular business. Some factors to consider include Your business model: Some channels are more effective for some business models than others. For example, the best channel for a restaurant likely wouldn’t work for a B2B software company. Your target audience: Different channels appeal to different demographics. For teenagers, you might prioritize TikTok. Whereas traditional advertising media may be more effective if you’re targeting older consumers Your marketing strategy: Depending on your marketing goals and past data, prioritize two or three proven channels. And allocate a smaller amount to trying out a new channel. Your marketing objectives: Some channels are better suited to meeting certain objectives than others. If you aim to improve your conversion rate by 20%, you might prioritize your website. And email copy. Your budget: Depending on the size of your budget,certain marketing channels may simply be too expensive. For instance, broadcast ads may be too expensive for your current budget. Or the CPC may be too high to sustain a paid ads campaign. 9. Measure Performance and Calculate ROITo find out whether your marketing is successful, track performance. And calculate the ROI. Knowing which channels, tactics, and campaigns offer the highest ROI enables you to fine-tune your budget allocations.It’s easier to calculate ROI from some channels and campaigns than others. For instance, paid search advertising with a clear cost-per-click makes it easy to compare campaign costs to total sales revenue. On the other hand, it can be a challenge to calculate marketing ROI when you can’t always attribute sales or conversions to an individual campaign. Or touchpoint. However, there are a couple of formulas you can use. To get an estimate of your marketing ROI. Simple Marketing ROI Calculation This formula assumes that all revenue growth is the result of marketing investment. ((Revenue growth - marketing costs) / Marketing costs) x 100 = ROI %Example: A company spends $5,000 on marketing. And sees $20,000 in revenue growth. (($20,000 revenue growth - $5,000 marketing costs) / $5,000) x 100 = 300% ROIThis method is unlikely to give you an accurate idea of your marketing ROI. Unless marketing is directly responsible forall of your revenue growth. This is rare but could apply to you if your business is brand new. Or your business model relies entirely on paid advertising. And all your sales are directly attributable to ad spend (e.g., dropshipping). ROI Calculation Accounting for Organic Revenue GrowthThis formula aims to get a more accurate ROI by first subtracting your average organic revenue growth from total revenue growth. This average growth average is calculated based on the existing sales trend in the months leading up to a new marketing campaign.((Revenue growth - average organic revenue growth - campaign cost) / Marketing costs) x 100 = ROI %Example: A company with a historic average organic revenue growth of 6% launches a $5,000 ad campaign. And sees $20,000 in revenue growth. (($20,000 revenue growth - 6% of $20,000 - $5,000 campaign cost) / $5,000) x 100 = 276% ROIThis method offers a more accurate ROI than the first formula. As you can imagine, such calculations become much more complex when you account for multiple campaigns. And channels. Not to mention the long-term returns resulting from investments in evergreen content and SEO. Further reading: Learn more about calculating content marketing ROI or SEO ROI. Stretch Your Marketing Dollars with SemrushSetting a realistic and effective marketing budget starts with knowing your goals. And understanding your audience. Once you’ve completed these steps, download our free marketing budget template. To allocate marketing spend. And measure performance throughout the year. Use Semrush’s tools, like Keyword Magic and Advertising Research, to get maximum mileage out of your marketing budget. And make your marketing strategy a success. Whether it’s market research, SEO strategy, content marketing, paid advertising, or social media management, our tools deliver results. And stretch your marketing dollars further.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Create a Marketing Budget in 9 Steps (+ Free Template)"
    },
    {
      "level": "H2",
      "text": "What Is a Marketing Budget?"
    },
    {
      "level": "H2",
      "text": "How to Determine Your Marketing Budget"
    },
    {
      "level": "H3",
      "text": "Marketing Budget as a Percentage of Revenue or Overall Budget"
    },
    {
      "level": "H3",
      "text": "Marketing Budget Informed by Industry Benchmarks"
    },
    {
      "level": "H3",
      "text": "Marketing Budget Driven by Business Goals"
    },
    {
      "level": "H3",
      "text": "Marketing Budget Examples"
    },
    {
      "level": "H3",
      "text": "Sample Marketing Budget for a Small Business"
    },
    {
      "level": "H3",
      "text": "Sample Startup Marketing Budget"
    },
    {
      "level": "H3",
      "text": "Sample B2B Marketing Budget"
    },
    {
      "level": "H2",
      "text": "Common Marketing Costs"
    },
    {
      "level": "H3",
      "text": "Paid Advertising"
    },
    {
      "level": "H3",
      "text": "Payroll and New Employees"
    },
    {
      "level": "H3",
      "text": "Freelancers and Agencies"
    },
    {
      "level": "H3",
      "text": "Marketing Software"
    },
    {
      "level": "H3",
      "text": "Content Creation"
    },
    {
      "level": "H2",
      "text": "Where Are Marketers Focusing Their Marketing Spend?"
    },
    {
      "level": "H2",
      "text": "How to Develop a Marketing Budget"
    },
    {
      "level": "H2",
      "text": "1. Define Your Marketing Goals"
    },
    {
      "level": "H2",
      "text": "2. Understand Your Audience"
    },
    {
      "level": "H2",
      "text": "3. Determine Monthly Expenses"
    },
    {
      "level": "H2",
      "text": "4. Research the Competition"
    },
    {
      "level": "H2",
      "text": "5. Audit Past Marketing Performance"
    },
    {
      "level": "H2",
      "text": "6. Use a Marketing Budget Template"
    },
    {
      "level": "H3",
      "text": "Free Marketing Budget Template"
    },
    {
      "level": "H2",
      "text": "7. Allocate Your Marketing Spend"
    },
    {
      "level": "H2",
      "text": "8. Choose Your Marketing Channels Wisely"
    },
    {
      "level": "H2",
      "text": "9. Measure Performance and Calculate ROI"
    },
    {
      "level": "H3",
      "text": "Simple Marketing ROI Calculation"
    },
    {
      "level": "H3",
      "text": "ROI Calculation Accounting for Organic Revenue Growth"
    },
    {
      "level": "H2",
      "text": "Stretch Your Marketing Dollars with Semrush"
    }
  ],
  "author": ""
}