{
  "url": "https://www.semrush.com/blog/market-segmentation-strategy/",
  "slug": "market-segmentation-strategy",
  "title": "Market Segmentation: Types, Examples, and Strategies",
  "description": "Market segmentation is essential for your total marketing strategy. Learn about the different types of market segmentation with examples here.",
  "content": "Market segmentation is a crucial component of any successful marketing strategy. Why? Well, just think about your own target market. Hopefully, everyone in your target market has an interest in your products or services. But are all of your potential customers the same age, sex, or located in the same region? Do they have the same income and education levels? Do they all have the same pain points, needs, or desires?If your market is like most, your target audience includes a large variety of potential customers. Because of this, a strategy that doesn’t take into consideration the diversity of characteristics within the target market runs the risk of missing the mark more often than not. As expert marketer Seth Godin said, “Your customer isn’t ‘Everyone’.” You need to get specific about who you’re communicating with when it comes to your marketing. This is where a market segmentation strategy comes into play. What Is Market Segmentation?A market segment is a group of individuals within a larger target market who share a particular set of characteristics. Most target markets will have a number of different market segments, or groups that share similar traits. For example, if we were to look at the athletic footwear market, we’d discover a variety of different segments: One segment might be made up of true athletes who are training hard in the gym every day Another segment may be looking for a comfortable pair of shoes to wear when walking their dog Some customers may be interested in style to impress others in their social group Others might be looking for stability to reduce pain and prevent falls The high school basketball player and retired grandmother both have an interest in athletic sneakers, but for very different reasons. Each segment represents customers with different characteristics, desires, needs that will influence their experience when shopping for, purchasing, and using the product. What Is Market Segmentation and Why Is It Important in Marketing? Segmentation is the process of taking a broad market and breaking it into various groups (A.K.A. segments) according to specific characteristics, desires, or needs. Take a brewery for example, their broad target market consists of customers who want to drink good beer and eat pub style food. When looking at the broad target market, however, many segments exist inside of the market. They might identify a segment that eats vegetarian, one that wants to drink IPAs, one that wants to spend less and drink more, one that prefers clever names for the beers, and one that likes to bring their whole family out for dinner. So, why is segmentation important for marketing teams? Well, understanding segments can help in a few ways. To summarize, we can say it like this: Segmentation helps marketers make the right offers to the right customers with the right message.Returning to our brewery example, let’s say the marketing team identified a valuable segment of their market made up of families with high incomes and young children. The marketing team might try to draw this audience toward their business by focusing their marketing efforts on this particular segment. For example, the marketers might create an offer for a kids meal or add some outdoor seating with a small playground set for kids. They’d place their advertisements in places where parents will see them, and in their messages, they’d focus on the family friendly atmosphere and might show images of families eating out. Common Types of Market Segmentation There are endless ways to segment any market. When it comes to your unique target market, you should define how you want to segment based on your unique needs and goals.Getting creative with your segmentation can help you unleash new value in your market, but if you’re looking for some quick criteria, these types of segmentation are sure to be useful: Geographic segmentation: Where is your audience located geographically? Do they live in the city or in a rural area? What languages do they speak? Demographic segmentation: What are the age groups, religions, sexes, income levels, education levels, or family sizes? Psychographic segmentation: What lifestyles, interests, hobbies, opinions, or influencers define your audience? Behavioral segmentation: Where are audience members at in their buyer journey, what brand loyalty traits do they possess, what price sensitivity exist, what’s the purchasing style, and how high is their usage rate based on behavior? Media preference segmentation: What social media platforms, television networks, newspapers, search engines, and other media outlets does the audience engage with? Benefit segmentation: What do audience members hope to get out of the offering? What are their desires, pain points, and needs? B2B Market Segmentation & Firmographics Segmentation for B2B (Business-to-business) marketers differs from the kind of segmentation B2C (business-to-consumer) marketers do. While B2C customers focus on the characteristics of their individual customers, B2B marketers focus on firmographics and business needs. Firmographics are characteristics of a business organization that can be used as criteria for segmentation. Instead of using Demographics, psychographics, or behaviors like B2C marketers, B2B marketers might focus on other criteria such as: Industry Number of employees Location Revenue Purchasing power Customer lifetime value Customer profitability Product usageIn order to make effective marketing decisions, B2B marketers also need to understand the buying process and decision making criteria within the businesses. This will ensure the marketing experience is designed specifically for the business they’re approaching. A 4-step Market Segmentation Strategy & Market Segmentation Example When it comes to segmenting your audience to prepare for a targeted campaign, intuition and luck will only take you so far. Businesses that have the most success with customer segmentation have a clear strategy in place. Before we get into the hands on work of developing a strategy, let’s try to come up with a definition for Market Segmentation Strategy. A working definition might go something like this: A market segmentation strategy is the process through which you identify, organize, research, and target a specific segment of a broad target market. Built into this definition, we can pull out a four step process for developing a segmentation strategy. Identify the major segments inside your broad customer base—In this step, you’ll do some broad market research to uncover what kinds of characteristics, desires, and needs exist within your target market. Organize the audience into segments—Here, you’ll define your segments based on various features and characteristics within your market. Research and choose a segment—Then, you’ll do some deeper research on each segment to figure out which you’d like to focus on in your marketing campaign. Create offers, craft messaging, and choose venues—Based on your research, you’ll create offers for the segment you want to target, craft the messaging you’d like to approach them with, and figure out what venues will provide the most exposure for your target segment. Let’s look at each step and use Semrush’s One2Target tool to uncover some market segments. For this example, we’ll return to the athletic footwear market. Identify Your Market’s Major Segments The broadest level of your market segmentation strategy is the identification process. Here, you’re exploring your broad market to better understand what groups exist within your target market. There are many ways to do this, including: Government data sources Publicly available data or reports from research firms Website analytics Social media platforms Market research software For this example, we entered adidas.com into Semrush’s One2Target and chose nike.com and puma.com to define our market. Looking at the Demographics Report we discovered that the main segment of the audience for these domains is men aged 25 to 34. Jumping over to the Socioeconomics Report, we might also gather some data related to household sizes and incomes. In this report, it’s clear the largest segment of our target market consists of households of 3-4 people in a low income bracket. At this stage of the process, however, you want to look beyond your largest segment and seek to identify and interesting trends in the data. For example, in each of the domains, there’s a large percentage of female audience members. We might also note puma.com is popular among younger audiences, while adidas is the most popular among audiences in the 65+ range. Likewise, there’s a large segment of our target market that live in households of 2 with a middle income range. Any of these features of our chosen market could become a segment we want to target. Organize the market into segments Based on the data we gathered in the last section, we can pull out at least three segments of our market we might target in a future marketing campaign. Here are three options: Males aged 25-34 living in families of 3-4 with middle to low incomes Females aged 45-54 who live in 2 person households and earn a medium income Males aged 18-24 who prefer Puma sneakers with medium to high incomes living in 5-6 person households We identified these segments based on trends that emerge in the data depicted on the graphs in the last section. As a closer look, here’s where we got the segment of males aged 18-24 who prefer Puma sneakers, have medium to high incomes, and live in 5-6 person households. Research and choose a segment to target After doing some deeper research on your identified segments, you’ll want to choose the segment you want to target in your marketing campaign. The segment you choose to target will depend on your resources and your goals. When choosing a particular segment, you may want to consider: Size—Is it large enough to support your goals? Growth potential—Is the segment going to grow in the future in size or purchasing power? Purchasing power—Will the segment have the resources to purchase your product? Needs and wants—Is the segment’s needs and wants aligned with what you have to offer? Competition—What is the level of competition within the segment? Are you able to differentiate your product? The Hooley’s Segment Attractiveness and Resource Strength Framework The Hooley’s Segment Attractiveness and Resource Strength Framework is another way to identify which segment is the best choice for your next campaign. The framework helps you identify the most attractive market segments and your ability to compete for those segments. The framework consists of two dimensions: segment attractiveness and resource strength. The segment attractiveness dimension evaluates the potential of a particular market segment, while the resource strength dimension evaluates a company’s ability to compete in that segment.Segment attractiveness is evaluated based on the following criteria: Market size and growth potential Profitability and potential returns Competitive intensity and rivalry Entry barriers and ease of entry Customer needs and wants Compatibility with the company’s mission and valuesResource strength is evaluated based on the following criteria: Financial resources Marketing capabilities Human resources and skills Technological capabilities Distribution and supply chain capabilities Brand equity and reputationWith this data, you can weigh the potential of various segments to figure out which are the best, which need improvement, which are poor prospects, and which are your worst prospects. Create offers, craft messaging, and choose advertising venuesAfter making a final decision on which segment to target, you’ll need to decide how to design your offers, how to communicate with the audience, and where to share your messages so they reach your desired audience. When it comes to designing your offers, think about the segment’s major pain points and their biggest desires. Are they tight on disposable income? Do they want something to do with their kids? Are they looking for something practical or are they seeking leisure?These kinds of questions will help you think about what kind of offer to make to gain their interest. When developing your messaging, use language that the segment uses in their daily lives. For instance, you may want to avoid slang or trendy language with an older audience. If your advertising contains images or sounds, make sure they resonate with the segment’s everyday experience. Finally, choose advertising venues where your audience segment spends their time. One way to do this is with the Also Visited table in One2Target’s Audience Overlap Report.Let’s say we wanted to run some voice ads on music streaming websites. We could filter the Visited Domains table to show only music based domains. Here’s a look at adidas.com’s and puma.com’s also visited pages in the music category. Notice the differences in the lists of domains offered by One2Target. For Adidas, which had an older audience, Spotify is the top visited domain in the music category. So if we were targeting our segment of women aged 45-54, we might place ads here. Puma, on the other hand, had a younger audience. Their top music sites were genius.com, and lower down the list, tidal.com, a music streaming service more popular among younger audiences. These might be our choices if we were targeting our younger segment. Think Long Term with Your Market Segmentation Strategy Audience segmentation is a powerful tool that can help you improve your marketing plan and more effectively reach your target audience. By breaking your market into smaller, more specific groups based on key characteristics, you can create more relevant and personalized marketing campaigns. It’s important to remember as you move toward the future that markets change and audiences evolve. Because of this constant change, it’s important to return to your segmentation strategy on a regular basis to make sure you’re still speaking to your audience’s needs. This will allow you to build longer and stronger relationships with your customers, increase engagement, and ultimately drive sales.",
  "headers": [
    {
      "level": "H1",
      "text": "Market Segmentation: Types, Examples, and Strategies"
    },
    {
      "level": "H2",
      "text": "What Is Market Segmentation?"
    },
    {
      "level": "H2",
      "text": "What Is Market Segmentation and Why Is It Important in Marketing?"
    },
    {
      "level": "H2",
      "text": "Common Types of Market Segmentation"
    },
    {
      "level": "H3",
      "text": "B2B Market Segmentation & Firmographics"
    },
    {
      "level": "H2",
      "text": "A 4-step Market Segmentation Strategy & Market Segmentation Example"
    },
    {
      "level": "H3",
      "text": "Identify Your Market’s Major Segments"
    },
    {
      "level": "H3",
      "text": "The Hooley’s Segment Attractiveness and Resource Strength Framework"
    },
    {
      "level": "H2",
      "text": "Think Long Term with Your Market Segmentation Strategy"
    },
    {
      "level": "H6",
      "text": "Most popular pages"
    },
    {
      "level": "H6",
      "text": "SEO Checklist: 41 Tips to Optimize Your Website"
    },
    {
      "level": "H6",
      "text": "How to Perform a Complete SEO Audit (in 14 Steps)"
    },
    {
      "level": "H6",
      "text": "A Beginner’s Guide to Keyword Search Volume"
    }
  ],
  "author": ""
}