{
  "url": "https://www.semrush.com/blog/market-research-guide/",
  "slug": "market-research-guide",
  "title": "Market Research: What It Is & How to Do It",
  "description": "Learn to do market research, the process of gathering information about your target market and customers.",
  "content": "To compete in today’s highly competitive markets, it’s essential to keep your finger on the pulse of what's going on in your industry.Well-conducted market research will help you with that. In this article, we’ll explore: What market research is and why it's important Different market research types and methods How to do market researchLet's dive in.What Is Market Research?Market research is the process of gathering and analyzing information about your business's target market. The main goal is to discover who your customers are and what they want. Market research helps you answer questions like the following: What are the demographics of my target audience? What are their interests and buying habits? What do they think about my business or industry? What problems can I help this group of people solve? How can I best connect with them? Market research analysis is more than simply tracking numbers. It goes one step further by attempting to uncover the “why” behind the numbers.Why Should You Do Market Research?Understanding your target audience allows you to: Identify business opportunities Attract a loyal customer base Find out what influences buying behavior Verify the success of a product Understand your brand perceptionAll of these things contribute to a healthy business plan and robust marketing strategy. When Should You Conduct Market Research? Market research can take up time and resources. Be strategic about when you conduct your research studies.Here are four times when you should consider conducting market research: Before launching a new business or venture: Initial market research helps you uncover competing products, pricing structures, and marketing efforts of your competitors Before entering new markets: It’s crucial to understand your potential customers in new markets. Economic shifts, emerging trends, and cultural values differ from place to place. Market research helps you avoid costly mistakes. Before developing or launching new products or services: As your company grows, you’ll likely roll out new products and/or services. You’ll want to understand the market conditions before making any big moves. After any of the above: After launching a new business, entering new markets, or releasing new products or services, conduct follow-up research. This will help you determine what’s working and what needs work.Besides the above situations, you should always keep an eye on trends and industry developments. Markets and customers are always changing. It’s important to stay informed. Further reading: How to Define Your Target AudienceTypes of Market ResearchBefore conducting market research, consider what insights you’re looking for: Are you trying to understand your competitors? Do you want to better market your products? Looking to address a customer pain point?There are two main types of market research to address these questions: primary market research and secondary market research.Primary Market Research Primary market research brings you close to the action. You do it yourself, usually up close and personal with the subject of the research.For example, primary research methods can include: Focus groups Interviews Observation-based research (like in-person observation)These research methods allow you to collect two types of data: Qualitative data: Descriptive data you cannot express in numbers. Examples include people's preferences, dislikes, and emotional responses. Interviews and discussion groups typically produce qualitative data. Quantitative data: Number-based data, including page views and social media follows. You usually present this kind of data in charts and graphs. Secondary Market Research Secondary market research refers to third-party data you collect from public or private records that are not your own. Because the data is already available, it’s typically more cost-effective. And less resource-intensive. Here are some examples of secondary sources: Company reports: Company-created reports about their own businesses (e.g., company websites, investor relation websites, Yahoo Finance, Google Finance) Industry statistics: Information and data on entire industries, as opposed to single companies (e.g., Statista, Pew, Gartner, Forrester) White papers: Authoritative market analysis written by third parties about a specific topic related to a given industry (e.g., trade magazines, market research companies) Government agency data: Government-collected data shared with the general public (e.g., Bureau of Labor Statistics, Census data, U.S. Securities and Exchange Commission)Secondary sources provide a macro-level view of your industry, plus insights about other competitors in the market. Just make sure the data and insights are accurate and reliable by using reputable sources.Market Research Methods The best market research method depends on what you’re trying to understand about your market. Of course, you can combine multiple methods to get a more comprehensive view.Here’s a breakdown of recommended methods based on your market research goal: What are you researching? Recommended research methods Customer needs, wants, and pain points Interviews Focus groups Surveys Observational research Market segmentation and demographics Market trends and opportunities Competitive analysis Secondary market research data Focus groups Market segmentation and demographics Business performance and marketing efforts Competitive analysis Interviews Focus groups Surveys Now, let's take a closer look at seven popular market research methods.InterviewsInterviews allow for in-depth discussions with people from your target audience. They can be free-flowing and unstructured. Or structured and detailed. Before conducting an interview, think about what kind of information you need and develop a list of questions.Here are examples of questions you can ask to address specific areas of business: Customer pain points: What are the main issues you face with X? Customer goals: What are you looking for in X? Brand awareness: Have you heard of X? Brand preferences: Do you prefer X over Y? Why? Pricing: How much would you pay for X? Customer interests and behavior: How do you spend your free time?Note: While you can record interviews to help record the data, keep in mind that recording can influence people’s answers.Competitive Analysis Competitive analysis is the process of researching your competitors’ products, services, prices, promotions, and other activities. By analyzing competitors, you can avoid their mistakes, replicate their success, and stay on the cutting edge of your industry. To do that, try a competitor analysis tool like Market Explorer.After entering your domain and your competitors’ domains, you'll get a complete overview of your market (including its size, traffic, and consolidation). Plus detailed information about your top competitors.The tool provides information about your competitors' traffic generation strategies, audience, and top keywords. Use this data to benchmark what success will look like for your business. Note: Learn more by reading our detailed guide to competitive analysis (with a template).Focus GroupsFocus groups are group interviews where participants can test your product, provide feedback, answer questions, etc.They allow you to get insights into your target audience in a way that would not be possible with other methods.Focus groups typically consist of five to 10 people who represent your target audience. Sessions are typically recorded.Look for the following when you review the data: Repeated words or phrases Similar reactions (confusion, frustration, delight) Inconsistent reactions or outlying opinions Quotes that capture the essence of the group’s feelings, reactions, and opinions Collect the data in a spreadsheet so you can organize and categorize it later for deeper analysis.Market SegmentationMarket segmentation is the process of breaking your market’s audience into groups. There are many ways to segment your audience, but here are a few examples: Demographic information (e.g., age, gender, or location) Socioeconomic factors (e.g., household income and employment status) Psychographic aspects (e.g., interests, desires, and preferences) Thinking about your market audience in categories allows you to better understand how to meet their needs and make sure your marketing efforts are impactful.To unveil demographic, socioeconomic, and psychographic data for any market audience, use Semrush’s .Trends tool set.For example, Market Explorer can provide a lot of information about your competitors’ audience. (Or nearly any audience in the market.)Let’s use Nike as an example to see what we can learn about their target market audience. This “Audience” report reflects data from the top sites in Nike’s market. A quick look at the data shows important information about Nike’s target market audience.For example: The audience is relatively evenly split between male and female, with the 25 to 34 years of age category being the largest segment A majority of the audience prefers YouTube as their social media platform of choice Nike’s target market audience is predominantly interested in retail sites This information lets us make educated guesses about what products our audience might be looking for. And market those products on platforms where this demographic spends the most time. Next, turn to the One2Target tool to gather additional data about a specific competitor’s audience. For example, here’s the “Socioeconomics” report for nike.com. It includes information about the audience's household size and income level, employment status, education level, and much more.Here are some insights we've gathered about Nike’s target market audience: The majority of Nike’s audience lives in households of three or four people, which indicates Nike is popular among families Most of Nike’s customers fall into the middle- or low-income level The majority of Nike’s audience works full-time, but it’s interesting to notice that a sizable segment of the audience are homemakers Over 90% of the audience has graduated from high school or gone to college This additional information helps you create buyer personas—profile depictions of your ideal customers. So you can target marketing campaigns more effectively.You can use our free buyer persona templates. Your final buyer persona profile will look something like this:All of this helps you target your campaigns more effectively by offering messages your customers relate to, in a language they understand, about products they want and can afford.Further reading: Market Segmentation, Website DemographicsSecondary Market Research Data Market reports, white papers, and consumer rating sites provide useful data for your business. The same is true of organizations like Pew, Gartner, Ipsos, and Forrester.For reviews and ratings, rely on sites like G2 and Trustpilot. They show insights into customer experience and satisfaction with your company and your competitors. Here's an example of Semrush's G2 review page:Note: Keep in mind that customers often write reviews when they are extremely satisifed or extremely dissatisfied with a product, so this data may skew in either direction.Observation-Based ResearchObservation-based research involves watching people from your target audience interact with products, services, marketing assets, etc. The way they react, ask questions, hit roadblocks, and respond in other ways provides useful information about how to improve. For example, you might invite participants to your office to watch them: Navigate through your website Purchase a product through your online store Engage with a physical product You may notice they get lost, enjoy something particular, or get frustrated at a certain point. This data provides insights for improvements. Surveys Surveys allow you to connect with your audience and receive direct feedback. Conduct online surveys to reach a large number of participants and get answers quickly.Services like SurveyMonkey and Google Forms provide survey templates, distribution tools, and data organization and display options. Some social media platforms also allow you to survey your audience. Here's an example of a simple poll conducted by Semrush on LinkedIn: Surveys allow you to collect both quantitative and qualitative data. Provide a variety of question types—multiple choice, “yes or no,” short answer, and scales—to engage your audience and provide a wide variety of useful data points. How to Do Market Research (Step by Step)Now it’s time to make a market research plan for your business.Here’s how to conduct market research in five steps: Define the Focus of Your Research Develop a Marketing Research Plan Collect Data Analyze Data and Generate Insights Present Your Findings and Continue Testing To walk you through the process, we’ll follow a fictional footwear company seeking to break into the running shoe market.Step 1: Define the Focus of Your Research Before you begin collecting data, narrow the focus of your research. This allows you to choose the right methods and tools.You may choose to focus on one of the following: A specific question you need to answer to create more effective marketing campaigns Market opportunities you want to explore further Specific topics your target audience seems interested inUse your initial observations or questions to determine what issue or topic you want to focus on.Then do some general research to get an idea of your audience's thoughts, preferences, and pain points.This can be as simple as conducting keyword research with a tool like Semrush's Keyword Magic Tool.Type in the seed keyword (any general keyword related to your niche or product), choose the target country, and click “Search.”Our footwear company launching a new shoe line might choose “running shoes.”You'll get a list of keyword suggestions:Then, switch the search criteria from “All” keywords to “Questions.”This will help us explore the most common questions people have about running shoes. The top searches revealed some consistent themes: How long do running shoes last? When should you replace your running shoes? What are the best running shoes? We can narrow down the results to only see keywords with commercial search intent. These are keywords people use when researching a product before making a purchase.To do so, select “Commercial” in the “Intent” filter at the top. This initial search provides some ideas about where to focus our research. For the sake of this example, let’s explore what running shoes consumers think are the best and why. Step 2: Develop a Market Research Plan After you determine your research goals, develop a plan to get more data. Start by answering some basic questions about methods you could use. Primary source methods: Will you interview key individuals? Will you hold a focus group? Could you survey people about their experiences? Secondary source methods: What third-party research companies have researched your market? Could you access customer reviews? Can you look at other companies' marketing efforts?Let’s return to our example shoe company. If we want to understand more about what shoes runners like best and why, we could pick three methods: Review studies conducted by third-party market researchers about product quality (manufacturing, features, life span, etc.) Interview runners about their experiences with various shoes Hold focus groups to understand how people think, feel, and talk about their favorite brandsBefore beginning the hands-on research, get a bird’s-eye view of the market. This will help you pinpoint industry leaders. And see what their strategies and growth prospects look like. Semrush’s .Trends tools can help you do this. Open the Market Explorer tool and choose one of three options: Create List: Create a custom market with competitors of your choice Find Competitors: Have the tool compile and analyze a list of competitors Analyze Category: Examine an entire industryLet's say you want to create your own custom list. First, select the location and enter the competitors. In our example, we'll enter six domains of popular running shoe brands: nike.com adidas.com saucony.com hoka.com asics.com brooks.comThen, name the list. We’ll name our list “Running shoe brands.” Hit “Create and analyze.”The first thing you’ll notice in the “Overview” report is the “Market Summary” widget.This widget provides an overview of the market including the level of consolidation, the key players and their market share percentage, the market size, and more.In our case, we see that the market has a moderately high consolidation level. This means most of the market share is owned (or “consolidated”) by one large player, with a few smaller players owning the remaining share.We see nike.com is the market leader, owning 66.2% of the market. Followed by adidas.com (20.77%) and hoka.com (7.06%).Finally, the Market Size is large with a Total Addressable Market of 807.6M. This means there are approximately 807 million individuals who need your product or service (though not all of them may be willing, ready, or able to make a purchase).Scroll down to discover the “Growth Quadrant.” This helps you understand how competitors are growing over time in relation to one another.The Growth Quadrant contains four sections: Game Changers: Emerging websites with a high growth potential Leaders: Big, well-known companies whose website traffic is growing Niche Players: Companies with smaller presence Established Players: Stable, popular websites Nike holds the lead in terms of traffic. And Adidas saw a large gain in traffic growth percentage. This growth pushed them closer to the “Leaders” quadrant from the “Established Players” category.Looking at some of the minor players, Saucony moved to the “Game Changers” quadrant. In this case, we’d definitely want to look into what they’re doing to drive traffic and ask our research subjects questions about this brand.Overall, these broad insights help us determine what research methods we want to use and what questions we’d like to ask our target audience.Once you’ve decided which direction to go in, come up with a timeline, delegate responsibilities, and execute your research. Step 3: Collect Data How you collect data will depend on the type of research method you choose.For qualitative research, like focus groups or interviews, write out answers and compare notes later. With surveys, you might produce reports.Tools like Google Forms and Survey Monkey offer reports that organize your data and even include illustrations where applicable. For quantitative research, collect raw data using a simple spreadsheet or more advanced data storage software. Tools like Google Looker Studio (formerly Google Data Studio) and Tableau allow you to organize and depict data as graphs or charts. For our footwear company example, we might collect qualitative data through our focus groups and interviews. For quantitative data, we could use the Semrush .Trends tools. For example, Traffic Analytics provides traffic numbers for competitors’ websites. First, select your target location and enter up to five competitors' domains.Then, hit “Analyze.”You'll get useful insights into your competitors’ traffic—including the trends, traffic sources, geo-distribution, etc. Here’s a look at saucony.com’s “Top Pages” report:It allows us to see which pages have shown significant growth in traffic in the last 12 months.In our example, it is the /endorphin-2-collection/ page:In this example, we've discovered a page with an upcoming product launch—Endorphin Pro+ shoes. In our focus groups, we could study customer responses to this launch or compare the traffic numbers or sources with new releases coming from competitors.Step 4: Analyze Data and Generate InsightsAnalyzing data helps you discover answers to your initial research question(s) and turn those answers into strategies. This process begins by organizing the data. With quantitative data, add everything up and enter it into a central location. Like a spreadsheet. Organize ratings, rankings, “yes and no” answers, selections of multiple choice questions, and any other data. Once it’s organized, crunch the numbers to look for averages, ranges, or other important statistics. For qualitative data, review all of the collected data and sort it into categories.For example: Concerns Questions Frustrations Strengths Weaknesses Recommendations Organizing this data will help clarify themes. Once you organize your data, review your initial research goals. Here are some guiding questions: Does the data illuminate any trends? Can I think of any explanations for these trends? What’s surprising or interesting about the data? Does the collected data help answer my original questions? Does it lead to any other interesting questions? As you notice trends or themes, present them visually. Tools like Miro and Mural can help you brainstorm, discover connections, and invite different people to the table to help interpret the data. To continue with our footwear company example, let’s pretend we discovered these five insights based on the data: Customers like durable running shoes; their favorite shoes last a long time Customers are willing to pay more for quality running shoes Customers are less likely to be loyal to one brand; quality matters over brand Customers respond best to ads that depict professional runners Customers like flashy designs and colors on their running shoesHighlight data that supports your argument or solves the problems you’re researching.Don’t worry if you discover negative results or trends. This gives you a chance to change direction and drop projects or strategies that aren't working. Which can save you time and money.Step 5: Present Your Findings and Continue Testing Now that you’ve done the heavy lifting, it’s time to put your findings to good use. Typically, this involves presenting your research to stakeholders and discussing improvements to your business or marketing plan.When presenting data, it helps to show: How the research produced the data How the data led to your insights How your insights led to actionable suggestionsLet’s return to our running shoe company. If we wanted to present information about pricing to our stakeholders, we might structure it like this: We looked at which shoes avid runners prefer and why. The top shoes tend to be more expensive than less popular shoes. We asked about this in focus groups and interviews. Participants told us they’re willing to invest more money into a good pair of shoes. High quality matters more than lower prices. Along with this, runners who pay more expect greater durability. Based on this data, our business might benefit from using quality materials and manufacturing processes instead of cutting costs with cheap materials and labor. We could improve our marketing strategy by highlighting the high-quality materials and care we put into manufacturing each pair. Once you've made adjustments to your business or marketing plan based on the data, continue your research to see if your strategies are successful. A great way to follow up on the moves you’ve made based on your in-depth market research studies is agile market research. The “agile” part means gathering data quickly and being able to iterate the process at any time.While it won’t replace in-depth market research, agile market research allows you to test hypotheses, receive feedback, and make swift changes. Let’s say we conducted a large-scale study on running shoes and launched our new product. Here’s an example of what the agile market research process might look like after that: Ask questions: Are the new shoes we developed comfortable? Review customer feedback for trends: E.g., many customers said the shoes were too tight on their toes. Generate insights: The design of the toe in our shoes needs improvement Make improvements: Adjust the shape of the shoes in the toe and release new model Ask questions: How do your toes feel in our new shoes? Complete the agile market research process over and over again for continuous improvement. Before You Start Your ResearchThough market research is a big undertaking, it’s necessary for survival in a competitive marketplace. A good place to start is the Semrush .Trends toolkit. The tools it contains provide you with quantitative data that will give you instant insights into your specific market and competitors.This way, you can make informed decisions about your further data collection methods (e.g., focus groups, surveys, etc.).You may also try the so-called SWOT analysis—a technique that helps you assess your business's strengths, weaknesses, opportunities, and threats. Read our guide to SWOT analysis that also includes a free template.Keep an eye out, stay curious, and good luck out there!",
  "headers": [
    {
      "level": "H1",
      "text": "Market Research: What It Is & How to Do It"
    },
    {
      "level": "H2",
      "text": "What Is Market Research?"
    },
    {
      "level": "H3",
      "text": "Why Should You Do Market Research?"
    },
    {
      "level": "H3",
      "text": "When Should You Conduct Market Research?"
    },
    {
      "level": "H2",
      "text": "Types of Market Research"
    },
    {
      "level": "H3",
      "text": "Primary Market Research"
    },
    {
      "level": "H3",
      "text": "Secondary Market Research"
    },
    {
      "level": "H2",
      "text": "Market Research Methods"
    },
    {
      "level": "H3",
      "text": "Interviews"
    },
    {
      "level": "H3",
      "text": "Competitive Analysis"
    },
    {
      "level": "H3",
      "text": "Focus Groups"
    },
    {
      "level": "H3",
      "text": "Market Segmentation"
    },
    {
      "level": "H3",
      "text": "Secondary Market Research Data"
    },
    {
      "level": "H3",
      "text": "Observation-Based Research"
    },
    {
      "level": "H3",
      "text": "Surveys"
    },
    {
      "level": "H2",
      "text": "How to Do Market Research (Step by Step)"
    },
    {
      "level": "H3",
      "text": "Step 1: Define the Focus of Your Research"
    },
    {
      "level": "H3",
      "text": "Step 2: Develop a Market Research Plan"
    },
    {
      "level": "H3",
      "text": "Step 3: Collect Data"
    },
    {
      "level": "H3",
      "text": "Step 4: Analyze Data and Generate Insights"
    },
    {
      "level": "H3",
      "text": "Step 5: Present Your Findings and Continue Testing"
    },
    {
      "level": "H2",
      "text": "Before You Start Your Research"
    }
  ],
  "author": ""
}