{
  "url": "https://www.semrush.com/blog/measure-content-marketing-success/",
  "slug": "measure-content-marketing-success",
  "title": "Content Marketing ROI: How to Measure Your Results",
  "description": "Use metrics to quantify content marketing ROI. And find out which marketing efforts are most successful.",
  "content": "Marketing has long since moved on from a “spray and pray” approach. Today campaigns are often surgically targeted, planned, and tracked, but many marketers aren’t confident about how to measure the effects of their efforts.A recent CMO Survey found that an astonishing 65% of marketers can’t quantitatively demonstrate the impact of their marketing.Image Source Many marketers realize that we are falling short. CMI reports that 44% say improving their content measurement is a top priority for 2020, but some aspects of content marketing are easier to measure than others.What Is Content Marketing ROI? Content marketing ROI is a percentage that shows how much revenue you gained from content marketing in comparison to what you spent.How to Calculate Content Marketing ROIA very popular formula for calculating ROI is the return minus total investment, divided by investment, and that answer is expressed as a percentage:An example:The important thing to keep in mind with this formula is the total investment—not just the cost of one piece of content. You can learn more about including all overhead costs in Jay’s post. What are your most successful content marketing campaigns, channels, and assets?How do you know?Tracking conversions from an internal blog post to online sales, for example, is quite simple. However, few customer journeys are that straightforward, especially in the convoluted, non-linear world of B2B marketing.TrustRadius found that buying committees make 95% of tech purchases, but “49% of buyers won’t ever interact with a vendor representative.” Instead, they make their decisions fully based on the content available on various digital touchpoints, and review sites are a major resource for buyers.This data shows why you need to combine a number of different stats and implement a sophisticated attribution model to measure your content’s business performance with any level of precision. On the other hand, that might not be fully necessary. Here are some rules for the road when determining how you are going to measure content marketing success.Understand What Constitutes Success: KPIs and ROICreate your own scoring system for the KPIs that matter most to you. As basic as this may sound, only 65% of marketers have decided on the content marketing success metrics, or key performance indicators (KPIs), that they will be referencing to determine success.Image SourceHere are some other KPIs you can measure from the Content Marketing Institute. ROI: Sales, Leads, and RevenueEach marketing group will set up slightly different systems, but there are some similarities. For example, if sales data and revenue are your main concern, you need to track the long customer journey to purchase.You may focus on social media engagement metrics to track brand awareness, and if you are striving to prove content marketing ROI to your boss or client, you will want to assign dollar values to every micro-conversion, as leads progress through the stages of your funnel.So if, for example, you know that your average customer lifetime value is $1000 and that generally, 2% of your email newsletter subscribers convert to become customers, then you could, based on a number of factors, assign $20 as the value of a newsletter opt-in conversion.Image SourceBenji Hyam of the Grow and Convert agency recently tweeted out the above chart, which shows how his company uses micro-conversion goals specific to a given client’s situation (in this case, registering as a user and then actually using the software) to demonstrate ROI on his team’s services. Here, content marketing success statistics are framed in such a way that the reporting underscores the business value of the agency’s involvement.Select Your Marketing Metrics With CareChoosing the right metrics can be hard, especially when you are overwhelmed with data. For each metric, ask if it will support your key goals and enable you to act. Track conversions, but most of all, track actionable metrics—the ones that give you the information you can use to optimize activity over time.Image SourceAs popular as they may be, make sure to steer well clear of vanity metrics like web traffic, which is only valuable when buttressed by and mashed up with other metrics, like traffic source and destination, behavior flow, or time spent on content.For example, beyond time on page, which is easily skewed, scroll depth is a useful way to check how much attention visitors are paying to your content.One often-overlooked metric is authority, which reveals how your target audience views your brand. It is highly valuable but tricky to track. Data relating to the number and nature of inbound links, mentions of your brand on social media, and earned media coverage are all indications that your authority, digital footprint, and brand awareness are growing.And despite what you might have read others asserting, in my book, it is vital to track keyword rankings—either with an SEO performance tracking tool or by opening a browser window behind a VPN to see how highly your pages appear on the relevant SERPs (or both). You can use Semrush for this by looking at the “Rankings” report in the Semrush Position Tracking tool.Image SourceJust remember that this only works when you know which SEO terms matter for your business. Correlate sales data and conversions with your SEO ranking to check that you are hitting the right terms.Another reason to keep an eye on your SEO is to monitor blog impact. Blogging regularly should holistically result in SERP gains for your domain, correlating with increased rankings for money terms, thereby sending more qualified traffic to your blog. All the more so if you tackle your editorial calendar strategically, informed by a ranking gap analysis.Research from Brian Dean confirms that even in 2020, there was a huge dropoff in clickthroughs from organic search results between page one and beyond.Image SourceIf you are rising or staying steady for the right keywords, you are sure to draw more traffic. But don’t stop there.Compare your SEO results with social shares and conversion rates. Together, these metrics can paint a holistic picture of the extent to which your content is hitting the right keywords, gaining popularity among your target audience, and achieving your conversion goals. All three need to be true to achieve true content marketing success.While Google Analytics is extremely limiting in its ability to tell content marketing success stories for you, some especially useful metrics to consider in the industry-standard platform are Page Value and Assisted Conversions.You should keep an eye on both, because content may become less (or more) relevant over time. The Time to Purchase metric can also be significant, especially if you are trying to shorten the sales cycle.Heading to other solutions, you can use Oribi to gain useful insights into which pages are viewed most along people’s paths to purchase. Once implemented on a website, the tool starts tracking visitor interactions with all page elements and then uses AI to suggest events worthy of “pinning” for later tracking.This basically allows you to circumvent any need for complex attribution models or cumbersome manual setup of conversion events in Analytics.Image SourceBut no matter which tools you use to track whatever KPIs make the most sense, just remember that all metrics change over time, so keep reassessing which ones you track.Set BenchmarksAlways remember that success is relative. You need to know how you are performing at a given point in time so that you can see if you are improving or sustaining losses. Create benchmarks so that you can see changes over time in metrics like subscribes, sales, and social mentions.As Shopify’s Shanelle Mullin points out in the Drift blog, “While it may be personally interesting to see how your conversion rates stack up against the rest of your industry, that information is useless… A good conversion rate is an improved conversion rate.”Example: Number of LeadsAnyone can look at just the number of leads, but you to dig deeper so you can track the strategies that work. What amount of targeted traffic converts to high-quality leads? How many high-quality leads become a sale? How much of your organic traffic leads result in a sale? CompetitorsIn the world of business, you are not your own competitor. While industry-wide benchmarks don’t necessarily paint any kind of useful picture, it can be a good idea to set benchmarks against your company’s top rivals. And note what share of social conversation or search results they have so that you can plot your trajectory against theirs.Keeping an eye on your competitors is especially important in SEO because rankings are always relative. Google doesn’t surface your content about a given topic above your competitor’s simply because its algorithms believe your content page has a certain threshold of authority—it does so because your page has more authority than your competitor’s page has.Measure the UnmeasurableNo matter how hard you try, some content marketing efforts can’t be fully tracked. Nonetheless, you can and should measure those aspects that can reveal the extent to which you are making progress or impacting growth.It is true that proxy metrics are highly flawed when it comes to measurement precision, but they can still be useful “smoking gun” indicators that you are on the right track.“Sometimes, there are still gaps in the data where it’s just not possible to see the immediate impact of certain metrics on core objectives,” Google Large Customer Solutions VP Karen Sauder asserts. “But don’t let that hold you back. Instead, get to better measurement using proxy metrics, or key directional indicators.”Image SourceEarned media, for example, is often one of those blind spots. Mentions from contributors, or publishing guest posts can be valuable for boosting your reach and bringing you to new audiences, but since they don’t live on your company’s servers, they can be hard to measure.Direct traffic is only one small piece of the puzzle. Organic search referrals are highly significant, especially for branded search terms, which can be an effective key directional indicator for brand awareness.While you can’t gain a complete picture of brand awareness lift without carrying out cumbersome surveys, growth in search referrals is a reasonably useful proxy metric that can demonstrate that your earned media activity is on the right track.Conversation and EngagementShare of conversation is another clue to brand awareness, authority, and customer attitudes. It relies on social listening to assess what share of voice you have right now, establish a benchmark, and then measure to see by what percentage it rises or falls each quarter.Likewise, social media engagement is another important proxy solution to explore unquantifiable attitudes towards your brand. As well as tracking comments, likes and shares, look at qualitative data, like how you are mentioned, in what context, and what kind of shares and comments you are getting.Yes, there is such a thing as negative publicity.Examine not just how many times your brand is mentioned or content is shared, but also drill down to see who is doing the sharing, mentioning, or commenting. Check if any of your social media followers are influencers with large followings or individuals with authority within a specific niche.Measuring Content Marketing Success Is a Multi-faceted TaskNo one said that measuring content marketing success would be easy, but it is achievable when you combine the right tactics.Setting your own KPIs, selectively choosing metrics, establishing benchmarks to measure progress, experimenting with qualitative elements, and creating the right mix of proxy metrics to track progress with non-owned media can improve your ability to assess the impact of your content marketing in 2024.",
  "headers": [
    {
      "level": "H1",
      "text": "Content Marketing ROI: How to Measure Your Success"
    },
    {
      "level": "H2",
      "text": "What Is Content Marketing ROI?"
    },
    {
      "level": "H3",
      "text": "How to Calculate Content Marketing ROI"
    },
    {
      "level": "H3",
      "text": "What are your most successful content marketing campaigns, channels, and assets?"
    },
    {
      "level": "H2",
      "text": "Understand What Constitutes Success: KPIs and ROI"
    },
    {
      "level": "H3",
      "text": "ROI: Sales, Leads, and Revenue"
    },
    {
      "level": "H2",
      "text": "Select Your Marketing Metrics With Care"
    },
    {
      "level": "H2",
      "text": "Set Benchmarks"
    },
    {
      "level": "H2",
      "text": "Measure the Unmeasurable"
    },
    {
      "level": "H3",
      "text": "Measuring Content Marketing Success Is a Multi-faceted Task"
    },
    {
      "level": "H6",
      "text": "Most popular pages"
    },
    {
      "level": "H6",
      "text": "SEO Checklist: 41 Tips to Optimize Your Website"
    },
    {
      "level": "H6",
      "text": "How to Perform a Complete SEO Audit (in 14 Steps)"
    },
    {
      "level": "H6",
      "text": "A Beginner’s Guide to Keyword Search Volume"
    }
  ],
  "author": ""
}