{
  "url": "https://www.semrush.com/blog/mobile-keyword-research/",
  "slug": "mobile-keyword-research",
  "title": "Mobile Keyword Research: What It Is & How to Do It",
  "description": "Discover 5 simple steps to uncover mobile keywords for your site. Plus tools to make the job easier.",
  "content": "Performing mobile keyword research can help you find new search terms that are relevant to you.And that can attract more mobile users to your site.Today, we’re walking you through how to find these keywords. And sharing some mobile keyword research tools to make the process easier.But let’s start with some fundamentals.What Is Mobile Keyword Research?Mobile keyword research is the process of uncovering what people type into search engines while using mobile devices.But general keyword research usually takes into account all devices that people use to search queries. Like desktop computers and tablets. Mobile vs. Desktop KeywordsThere are three main ways mobile keywords differ from desktop keywords:ConversationalMany mobile keywords are more conversational compared to desktop searches. Because searchers have a greater tendency to use voice search on their phones than on other devices.For example, on a desktop device you might search “best italian restaurants nyc.” But your voice search might be “what are the best-rated italian restaurants in new york city?”Tapping into conversational mobile keywords can help you find long-tail keywords—highly specific search queries. And that’s great because those searchers are often more motivated to take the next step.Near the Middle of the FunnelMobile users tend to be closer to the middle of the marketing funnel, according to research. Near the “consideration” stage.Users are evaluating their options before buying during this stage. And might search things like product reviews. Or price comparisons. LocalizedMobile keywords tend to be more localized than desktop keywords. Why?Because mobile searches may happen while people are away from their homes (and desktop computers).Say a user is searching for hardware stores on their smartphone while running errands. So they can find a place to buy a hammer.They might look up “hardware store + [neighborhood they’re in].” Or “hardware store + [their city].” But desktop users at home might search “buy a hammer.” Because they can easily order one from any major ecommerce provider—regardless of location.How to Conduct Mobile Keyword ResearchWe’ll walk you through the steps to perform mobile keyword research using a fictional example: A plant store based in Chicago. Step 1: Identify Keywords You Already Rank forFirst, identify your current top keywords. Because you can use them in the coming steps to uncover mobile keywords that might be a good fit.You can check keywords you rank for in Google Search Console.After you log in to Google Search Console, head to “Performance” > “Search results.”And check all the boxes at the top.Next, scroll to the “Queries” table. The “Position” column shows your average ranking over the chosen time range. Click the top of the column twice to sort it so the keywords you have the highest rankings for appear at the top.And jot down your highest-ranking keywords. Don’t worry about generating a huge list. Just choose a handful of terms that can serve as starting points.We’ll use “chicago plants” in our example throughout. To show you what to do with these keywords.Step 2: Uncover Voice Search KeywordsResearch from UpCity shows that half of people in the U.S. use voice search daily. And those searches tend to happen on mobile devices.Voice searches are usually longer and are often grammatically-correct questions. You can use the Keyword Magic Tool to find these questions.Go to the tool, type in one of your keywords from above, select your country, and click “Search.”The tool gives you a comprehensive list of keywords related to your initial keyword.We want to identify questions. So, select “Questions.” And set the word count minimum to “5.” This displays potential voice search questions. Go through the list and select the keywords you want to rank for. And click “+ Add to list” to create a list for later reference. Step 3: Find Middle-of-the-Funnel KeywordsCommercial keywords are located in the middle of the funnel (MoFu). And identifying them can help attract mobile users to your site. Since people tend to use mobile devices for MoFu-type searches.Head back to the Keyword Magic Tool to find relevant commercial keywords. Search for a keyword as you did in the previous step. And then select “Commercial” in the “Intent” drop-down.This gives you a list of commercial keywords to consider. Select relevant ones and add them to your keyword list.Step 4: Perform a Competitor AnalysisDoing an SEO competitor analysis can uncover the mobile keywords you don’t rank for but your competitors do.To find these keywords, open the Keyword Gap tool. Enter your domain along with up to four competitors. Then, select your country and click “Compare.”Select “Mobile” from the drop-down. To display only mobile keywords.Scroll down to the table. And click “Untapped” to view keywords you don’t rank for but at least one of your competitors does.Review the keywords. And add ones you want to rank for to your keyword list.Step 5: Review Your KeywordsReview each keyword from the steps above to determine which ones to prioritize and how to use them.First, head to Keyword Strategy Builder. Then, scroll to the “Keyword lists” section and click your list.From Keyword Strategy Builder, click one of your keywords in the list to open it in the Keyword Overview tool where you can review essential keyword information.Select “Mobile” in the drop-down. To display information for the mobile keyword (and not the desktop version).Here’s what to review:Volume and DifficultyStart by reviewing how much search volume (the average number of monthly searches) the keyword gets. And its keyword difficulty—how hard it is to rank for the keyword. Prioritize creating content for keywords with a high volume (the threshold for “high” depends on how many site visitors you tend to get) and low difficulty. To give your site a better chance at ranking high enough to drive traffic. Search IntentWe’ve mentioned above that mobile keywords tend to be in the middle of the funnel. And have a search intent—what users want to achieve from their search—that’s commercial.But mobile keywords may also have other search intents. And knowing these intents can help you create the right type of content for each keyword. The four search intents are: Navigational intent: Users want to find a specific website or page (e.g., “semrush login”). These searches may happen at any point in the funnel. Informational intent: Users want to learn something (e.g., “what is content marketing?”). Informational searches tend to happen at the top of the funnel. Commercial intent: Users want to do research before buying a product (e.g., “best nike shoes for sprinters”). These searches usually happen in the middle of the funnel. Transactional intent: Users want to complete an action, like buying a product (e.g., “buy iphone 15 pro”). Transactional searches typically occur near the bottom of the funnel.Knowing a keyword’s intent can help you develop content that aligns with what searchers want. And hopefully nudge them toward a conversion.You can determine a keyword’s search intent right in Keyword Overview.Then, check the search engine results pages (SERPs) to determine the exact type of content your audience wants.For example, someone searching for an informational keyword may want how-to guides. Whereas someone searching for commercial keywords could want product reviews.So, scroll down to the “SERP Analysis” section to review the types of pages that are ranking. Our example below mostly shows pages that describe a business. Which likely means people searching for “plant nursery chicago” want to find a business. This means creating a page that talks about your business would be better than creating a product reviews page.Presence of SERP FeaturesThe SERPs contain different types of results. And SERP features are unique results outside of traditional organic results—like videos and People Also Ask (PAA).Knowing which SERP feature a keyword triggers can help you tailor your content to those features. And potentially increase your chance at ranking highly for it. When in the Keyword Overview report, scroll down to the “SERP Analysis” section. And pay attention to the SERP features. For example, the keyword “plant nursery chicago” includes images. So, you’d want to include optimized images on that page. To increase their chances of appearing for that SERP feature. And make note of whether your keyword has a featured snippet. Featured snippets are web excerpts that quickly answer a user’s query and are usually displayed above organic search results.Google often pulls featured snippets when answering voice queries. Here’s the same example as above as a featured snippet for voice search via Google Assistant:This means you can increase your chances of ranking for mobile searches by optimizing your content for featured snippets. How to Use Mobile KeywordsYou now have a list of mobile keywords that you need to strategically use on your website.Here’s how you can do that:Create Search-Focused ContentCreating content that incorporates your mobile keywords—or optimizing existing content for them—is one of the best ways to improve your visibility among mobile searchers.Semrush’s SEO Writing Assistant can help you optimize your content. Open the tool, click the green “+ Analyze new text” button. Then, enter at least two keywords. Click the drop-down to adjust your target audience. Then, select “Phone” and click “Get recommendations.”Write your content (or paste in existing content) directly in the text editor.If you need inspiration or get stuck, use SEO Writing Assistant’s “Smart Writer” features to help you write text. As you go, the tool grades your text (and gives you tips for improvement) based on four categories: readability, SEO, originality, and tone of voice. After writing and optimizing your content, publish it to your website. Use Google Business ProfileLocal SEO—a practice designed to optimize your site for nearby search traffic—is critical for mobile. Because of how many people use their phones to look into businesses they’re close to.So, it’s valuable to rank for keywords like “[your business] near me” and “[your business] nearby.” Which are location-based keywords that are frequently used in mobile searches.But in most cases, you can’t rank for keywords like “near me” in the traditional sense. For example, a plant store in Chicago shouldn’t pack their website with phrases like “plant stores near me” and “plant stores nearby.” So, what’s the fix? First, sign up with Google Business Profile and complete your listing. This ensures your company is listed when Google users look for businesses in your niche and location. You should also set your business location on Google Maps. These steps can help improve “nearby” and “near me” keyword rankings.And help you show up in results like this.Optimize Your ImagesAdding high-quality images to your website (and optimizing those images) can help you appear in traditional search results, image search results, and Google Lens search results.To optimize images for your keywords and search as a whole, you can: Use relevant keywords in image file names. Like “monstera-chicago.jpg” instead of “IMG_1467.jpg.” Add descriptive alt text. Alt text describes your image for screen readers and search engines. And you can add keywords to alt text if those keywords are relevant and describe your image.Measure Your Mobile Keyword ResultsTracking your performance related to mobile keywords helps you understand what’s working well. And what you need to improve. Here’s what to monitor:PositionsTrack your mobile keyword positions in the SERPs. To see whether you need to make adjustments to improve your rankings.Use Position Tracking for this.Enter your domain and click “Set up tracking.”Select which search engine you want to focus on, click “Mobile,” and choose your location.Then, click “Continue To Keywords.” Add all the mobile keywords you want to track and click “Add keywords to campaign.” Lastly, click “Start Tracking.”The “Landscape” tab tells you your site’s overall performance for your chosen keywords. To see the performance for individual keywords, click “Overview” and scroll to “Rankings Overview.” The “Diff” column tells you how your rankings changed from the previous time period. (You can adjust the time period at the top of the report.)Make note of any keywords that are ranking worse than they were previously. Or any that aren’t ranking as high as you’d like.You might want to consider re-optimizing these pieces in the SEO Writing Assistant. Or try building backlinks—links from other domains that point to those pages. Because gaining backlinks might increase your rankings.Organic SessionsSessions are visits that start when someone loads a page on your site and end after 30 minutes of inactivity or when a user leaves. And checking how many come from search results helps you see if you’ve put your mobile keyword research to good use.You can track tons of metrics like how many organic sessions from mobile your content gets with Organic Traffic Insights. Open the tool, enter your domain, and click “Get Insights.”The tool will prompt you to connect your Google Analytics and Google Search Console accounts. And our configuration guide can help you if you get stuck.You’ll see a report with useful metrics after connecting both accounts.Select “Mobile” from the drop-down to view traffic metrics specific to mobile.Review the “Sessions” column to see how many organic sessions you get from mobile search. NoteYou can also select “Desktop” or “Tablet” to compare traffic across devices.Pay attention to pages with lower-than-anticipated traffic. You may want to improve the title tags—the HTML page title that might show in search results—for these pages. Accurate and enticing title tags can encourage more people to click your content in search results. Which increases organic sessions.ConversionsConversions help you understand the return on investment (ROI) for mobile traffic. This is important because while conversions aren’t a direct measure of mobile SEO success, they reveal how well your efforts are supporting business goals. Look to your “Conversions” column within Organic Traffic Insights. Look at your top-converting pages. And try to understand why they do well. Then, review low-converting pages to see what could be impeding their performance.Get Better Results with Mobile KeywordsTargeting mobile-specific keywords opens the door to a potentially large traffic source.And it enables you to create content that meets searchers’ needs and preferences when they’re using their mobile devices.Semrush’s tools make doing mobile keyword research easy and efficient. Ready to try them for free?",
  "headers": [
    {
      "level": "H1",
      "text": "Mobile Keyword Research: What It Is & How to Do It"
    },
    {
      "level": "H2",
      "text": "What Is Mobile Keyword Research?"
    },
    {
      "level": "H2",
      "text": "Mobile vs. Desktop Keywords"
    },
    {
      "level": "H3",
      "text": "Conversational"
    },
    {
      "level": "H3",
      "text": "Near the Middle of the Funnel"
    },
    {
      "level": "H3",
      "text": "Localized"
    },
    {
      "level": "H2",
      "text": "How to Conduct Mobile Keyword Research"
    },
    {
      "level": "H3",
      "text": "Step 1: Identify Keywords You Already Rank for"
    },
    {
      "level": "H3",
      "text": "Step 2: Uncover Voice Search Keywords"
    },
    {
      "level": "H3",
      "text": "Step 3: Find Middle-of-the-Funnel Keywords"
    },
    {
      "level": "H3",
      "text": "Step 4: Perform a Competitor Analysis"
    },
    {
      "level": "H3",
      "text": "Step 5: Review Your Keywords"
    },
    {
      "level": "H4",
      "text": "Volume and Difficulty"
    },
    {
      "level": "H4",
      "text": "Search Intent"
    },
    {
      "level": "H4",
      "text": "Presence of SERP Features"
    },
    {
      "level": "H2",
      "text": "How to Use Mobile Keywords"
    },
    {
      "level": "H3",
      "text": "Create Search-Focused Content"
    },
    {
      "level": "H3",
      "text": "Use Google Business Profile"
    },
    {
      "level": "H3",
      "text": "Optimize Your Images"
    },
    {
      "level": "H2",
      "text": "Measure Your Mobile Keyword Results"
    },
    {
      "level": "H3",
      "text": "Positions"
    },
    {
      "level": "H3",
      "text": "Organic Sessions"
    },
    {
      "level": "H3",
      "text": "Conversions"
    },
    {
      "level": "H2",
      "text": "Get Better Results with Mobile Keywords"
    }
  ],
  "author": ""
}