{
  "url": "https://www.semrush.com/blog/mobile-local-marketing/",
  "slug": "mobile-local-marketing",
  "title": "Mobile Local Marketing: 6 Strategies to Drive Local Customers",
  "description": "Discover ways to increase engagement and sales through mobile local marketing.",
  "content": "What Is Mobile Local Marketing?Mobile local marketing is a type of marketing that targets nearby potential buyers through their phones. It's for businesses with a physical location. For example, an ice cream shop could text a coupon to people who are within a one-mile radius (as long as they’ve opted in for text message communication). The coupon increases the chance they’ll stop by.Why Mobile Local Marketing MattersMobile local marketing lets businesses reach and engage with potential customers in a personalized way and in real time. Mobile devices are always at hand. Americans spend an average of four hours and 25 minutes on their phones every day.And because 75% of Americans check their phones within five minutes of receiving a notification, local mobile marketing can be an effective way to reach your audience. This immediate communication can build stronger relationships. And encourage customers to take action and visit your store or purchase a product.6 Strategies for Effective Mobile Local MarketingLocal Mobile SearchLocal mobile search helps people find businesses in their area.Here’s how it works:When people perform a search for a business, Google can use their location to pull up nearby businesses. People can also add an area (like a city or a neighborhood) to find businesses located in that specific area. Like this search for “Italian food” in New York:Your business has a higher chance of showing up in these search results, as long as you’ve optimized your site for local mobile search. Google gives three ranking factors for local searches: Relevance: How well a Google Business Profile matches what someone searches for. For example, a pizzeria may show in the results if you search “Italian food.” But a French-inspired bakery probably wouldn't. Distance: How close a local result is to the searcher. Someone in Sacramento searching for a grocery store likely wouldn’t see businesses located in Los Angeles. Prominence: How well known a business is. Google considers elements like backlinks (links from other sites that point to yours), articles, directories, and reviews to determine this.Because Google considers backlinks for local mobile searches, consider growing your backlink profile. To build backlinks, use Semrush’s Link Building Tool.Click “+ Create project.”Fill out your domain and project name (if you want to use one). Click “Create project.”Then, add the local keywords you want to rank for. (Learn how to find local keywords if you don’t already have some.)After you’re done adding keywords, click “Competitors.” Then, add your competitors' URLs, and click “Start Link Building.” When the tool is done analyzing the data, it will display a message. Click “View prospects.” This brings you to a page displaying sites you may want to ask for backlinks.Look for relevant sites. When you come across a site you’d like to reach out to, click the “To In Progress” button. Semrush will add this site to the “In Progress” tab. Click the “In Progress” tab to contact your prospects by clicking the “Contact” button.The screen expands to reveal an email editor. You can choose who to send the email to, write your email, and send it within this screen.Then, track the emails you send in the “Status” column. This shows whether your email was sent, received, opened, or replied to. Repeat this process regularly to build quality backlinks. To increase your chance of ranking higher in mobile local search. GeofencingA geofence is a virtual boundary around a specific location. You can send targeted messages to people within the geofenced location (if they’ve opted in to receive text message communication from your business). The app Too Good To Go uses geofencing to send text messages that advertise nearby deals.Or you can use geofences to deliver personalized ads that are displayed on the websites people browse.For example, say you have a coffee shop. When people enter your geofenced area, you can serve ads for your coffee shop on the websites and apps they visit. These activities put you top of mind with your audience. And encourage people to visit your store when they’re nearby.You can implement geofencing with some ad platforms. And target a location near your business.Or you can hire a developer or agency to build a custom app with geofencing capabilities.GeoconquestingGeoconquesting is similar to geofencing. Except instead of placing a geofence around your location, you place them around your competitors' locations.Then, you can trigger messages and ads to appear when your ideal buyer visits your competitors.Geoconquesting lets you reach customers already in the market for your products or services. These people are likely to be receptive to your messaging. Which increases your chance of converting them into customers.Dunkin’ used geoconquesting to target consumers who had visited a competing business. These consumers saw banners ads offering $1 coffee coupons within 30 days of their visit. As a result, 3.6% of people who saw the ad redeemed the coupon.Like geofencing, you can use ads, or work with a developer to create a geoconquesting campaign.Bluetooth Low Energy (BLE) BeaconsBLE beacons are small wireless transmitters that use Bluetooth to send signals to nearby smartphones. These signals trigger specific actions on mobile devices. Here’s how it works:When someone enters a location with BLE beacons (and they’ve downloaded the store’s app), they will get highly personalized messages delivered to their phones.Here are a few examples of using beacons for location-based mobile marketing: Send discounts to customers for specific products when customers are in close proximity to the BLEs near those products Provide in-store navigation to help customers find the products they need (and advertise complementary products customers may want) Track the effectiveness of online advertising campaigns by using beacons to measure how many people with their mobile devices view your online ads and then visit your physical locationTarget uses beacons to help shoppers find items they want to buy. Imagine Google Maps but for shopping. Customers can watch themselves move through the store via a blue dot on their phone. This can decrease the chance of a customer leaving the store because they couldn’t find what they wanted to buy.QR CodesQR codes are barcodes scannable by smartphones. When someone scans a QR code, the code directs them to a landing page. For example, you can include a QR code in a neighborhood newsletter to advertise your business. When customers scan the code, they’re taken to a page with a coupon to use within the next week. Or you can use QR codes in your business to direct people to opt in to SMS text messages. Which can improve your geofencing campaigns. As you’ll have a larger list of people to send targeted text messages to the next time they’re near your business.McDonald's uses branded QR codes as advertisements.When someone scans the code, they can access McDonald's’ online ordering. Which helps drive sales for nearby stores. Tools like QR Code Generator help users create QR codes automatically. After creating your QR code, add it to marketing materials and advertisements to promote your business to local patrons. Wi-Fi MarketingAn estimated 47% of Americans regularly use public Wi-Fi. And you can advertise your business by providing free Wi-Fi. When people are inside your location, they can log in to use your free Wi-Fi.Use this opportunity to tailor your Wi-Fi login and thank you pages to advertise special promotions.Plus, you can enable email opt in on your Wi-Fi login page. This helps you build an email list to further your communication with people interested in your business.Restaurant Pizza Nova used Wi-Fi marketing to capture hundreds of thousands of leads across 140 locations. They then sent out targeted email campaigns. Which increased sales and resulted in a 15x return on investment (ROI).You can set up your own Wi-Fi marketing campaign using Wi-Fi marketing software. 4 Mobile Local Marketing Best PracticesFix Errors on Your Mobile SiteA mobile-friendly website that’s easy to use and navigate on smartphones is essential for a good user experience. Plus, pages designed for mobile may rank better in Google’s mobile search results.A mobile-friendly website fits smaller screens like tablets and smartphones. Here’s how our website looks on three different screen sizes:Notice how the user doesn’t need to scroll sideways to view the content on smaller screens. This lets users explore your site without any roadblocks.Mobile websites should also be error-free. Errors can cause users to leave. And might hurt your rankings.To check for errors on your mobile site, use Semrush's Site Audit tool. Click “+ Create project” to get started.In the “Crawler settings,” set the “User agent” to “SiteAuditBot-Mobile.” Doing this tells the Site Audit tool to crawl your site like Google’s Mobile Crawler does. After configuring the Site Audit Settings, click “Start Site Audit.”When Semrush completes the audit, you’ll see a dashboard that displays your mobile site’s health.Click on the “Issues” tab. This shows you the “Errors,” “Warnings,” and “Notices” affecting your mobile site.Click on each error for more details, including how to fix it.Go through your site and fix the errors. This can increase your chance of ranking higher in the search results. So, when people use their phones to search for queries related to your business, you have a better chance of ranking higher.And run an audit for the desktop version of your site, too. Fix site errors regardless of the device to ensure higher rankings and a good user experience.Manage Local CitationsLocal citations are references to your business’s NAP (name, address, phone number) data. And building local citations can help you rank higher. Especially for local mobile searches. Here’s why.When people search for a local business, Google cross-checks business information across various sources. Like your Google Business Profile, your website, and other business directories. If the information across these sources is consistent, your website appears more trustworthy. And your site may be more likely to display in search results. Plus, adding your business to different platforms puts you on the map (literally). For example, adding your business information to Facebook puts you on Instagram’s searchable map. Where social media users can filter and sort nearby businesses.Here is a list of business directories you can add your business to: Google Business Profile Bing Places for Business Yelp for Business Facebook Instagram for Business LinkedIn Apple Maps FoursquareWhile the above directories are a good start, there are many other places to add your business listing. The easiest way to add your listing to a large number of directories (and manage your listings after you’ve added them) is to use a tool like Listing Management.On the left-hand side of your Semrush dashboard, click the “Local” drop-down. Then click “Listing Management.”To start, enter your company name. Choose the company with the correct address from the dropdown list.A report will show up with errors for your current listings.Go through this report and fix any errors. To make sure your listings are consistent across the web.With a paid subscription, you can automatically add business information to dozens of directories.Here’s how.Click “Edit Business Info” to edit your business listing.Fill out your information. And add links to social media profiles, your Google Business Profile, and more.After you’ve filled out your profile, the tool will direct you to a dashboard with all your listings.Identify Mobile KeywordsThe terms people search for on their mobile devices can differ from what they search for on a desktop computer.Generally, mobile keywords are shorter. And tend to be localized. For example, if you’re walking around and want to go somewhere for brunch, you might search “brunch near me” on your phone.But if you’re at home and planning to go for brunch in a few days, you might search “best brunch in [city you’re in].”These searches display different results. So you should optimize your site for both.To optimize for mobile keywords, you need to perform mobile keyword research. To do that, use Semrush’s Keyword Gap tool. Enter your domain along with your competitors' domains. Then click “Compare.”Change the device to “Mobile.”Then scroll down to the keywords. Look at your “Missing” keywords (keywords where competitors outrank you) and “Untapped” keywords (keywords that at least one of your competitors ranks for, but you don’t).You can also narrow your results for local keywords. Use a filter with phrases like your city or neighborhood.This displays keywords that contain local phrases. Go through these and find ones relevant to your business that you’d like to write content on (which we’ll discuss next).Optimize Content for Mobile KeywordsOptimizing new and existing content for mobile search can help you rank higher. To get help with optimizing content, use the SEO Writing Assistant.You can find the SEO Writing Assistent in your Semrush dashboard under the “Content Marketing” drop-down. Click “SEO Writing Assistant.”Once in the tool, click “Analyze new text.”Then, enter your keywords. Under “Target audience,” choose your area and select “Phone.” Then click “Get recommendations.”Paste existing content into the editor. Or write new content directly in the editor. (You can also connect the SEO Writer with a Google Doc if you prefer to write there.)The SEO Writing Assistant grades your text. And gives you suggestions on readability, SEO, originality, and tone of voice.Use these suggestions to create content that has the best chance of ranking high for mobile local searches. Measuring and Analyzing SuccessHere are three ways to track your mobile local marketing efforts:Position TrackingSemrush’s Position Tracking tool lets you track the positions of your keywords. So you know how your mobile keywords are performing.Access the Position Tracking tool in your Semrush dashboard. Go to “KEYWORD RESEARCH” and click on “Position Tracking.”Then, enter your domain. Click “Set up tracking.”Choose a location for your business and enter your business name. Then click “Continue To Keywords.”Next, enter the local mobile keywords you want to track. You can type these or import them from a .txt or .csv file. Lastly, click “Add keywords to campaign” then click “Starttracking.”You’ll see a report with data on your keyword’s performance. Click the “Overview” tab. This displays information like how each keyword ranks.Find keywords that don’t rank well. And use the SEO Writing Assistant to evaluate and improve the content for those keywords.Engagement RateEngagement rate (in Google Analytics 4) is the percentage of people who visit your website and engage with it in some way. Google defines engagement as a session longer than 10 seconds, a session with a conversion, or a session with at least two page views or screen views.Use Organic Traffic Insights to view your mobile engagement rate.In your Semrush dashboard, go to “KEYWORD RESEARCH,” and click “Organic Traffic Insights.”First, create a project by clicking “+ Create project.”Enter your domain, name your project (if you like), and click “Create project.”Locate your project in the list and click the blue “Set up” button.Go through the prompts to connect your Google account. Then select the location you want information for, and \"Mobile\" as the device for the report.This displays metrics and info for mobile visitors. Make note of your average engagement rate.Go through your landing pages and look for pages with lower-than-average engagement rates.Try to understand why these pages have low engagement rates. They could have poorly optimized content. If so, use the SEO Writing Assistant to improve the content.Or these pages might need mobile improvements. Use Site Audit to fix any errors or issues that may be affecting these pages.Alternatively, look at landing pages with high engagement rates. Analyze these to pinpoint what’s working. And apply those tactics to low-performing landing pages.Conversion RateConversion rate is the percentage of people who perform a desired action. Like buying a product. Or signing up to use your Wi-Fi.But conversion rates for local mobile marketing aren’t always straightforward to track.Here’s an example: Say you set up geofencing. And someone sees an ad for your business within your geofence. They decide to stop by and make a purchase.You’ve converted this visitor. But how can you attribute that sale to your geofence?Although conversion tracking or mobile local marketing is tricky, it’s not impossible. Here are some tips: Pair geofencing conversion zones with your geofenced area. Geofencing conversion zones track mobile devices that move from your geofenced area to the geofenced conversion area (typically your physical storefront). So you can track conversions better. Send QR codes to unique URLs. Use Organic Traffic Insights to track conversion rates from these URLs. Use post-purchase customer surveys to ask customers how they found your business Track conversions with beacon technology. Beacons can track devices that see your ads and then enter your physical store.With these tips, you can have a good understanding of how local mobile traffic converts.Start a Mobile Marketing Strategy for Your Local BusinessLocation-based mobile marketing can help your business increase foot traffic and sell more products.And with Semrush, you can optimize your mobile site, create content for local traffic, manage local citations, and more. Ready to try it for yourself? Start using Semrush today—for free.",
  "headers": [
    {
      "level": "H1",
      "text": "Mobile Local Marketing: 6 Strategies to Drive Local Customers"
    },
    {
      "level": "H2",
      "text": "What Is Mobile Local Marketing?"
    },
    {
      "level": "H2",
      "text": "Why Mobile Local Marketing Matters"
    },
    {
      "level": "H2",
      "text": "6 Strategies for Effective Mobile Local Marketing"
    },
    {
      "level": "H3",
      "text": "Local Mobile Search"
    },
    {
      "level": "H3",
      "text": "Geofencing"
    },
    {
      "level": "H3",
      "text": "Geoconquesting"
    },
    {
      "level": "H3",
      "text": "Bluetooth Low Energy (BLE) Beacons"
    },
    {
      "level": "H3",
      "text": "QR Codes"
    },
    {
      "level": "H3",
      "text": "Wi-Fi Marketing"
    },
    {
      "level": "H2",
      "text": "4 Mobile Local Marketing Best Practices"
    },
    {
      "level": "H3",
      "text": "Fix Errors on Your Mobile Site"
    },
    {
      "level": "H3",
      "text": "Manage Local Citations"
    },
    {
      "level": "H3",
      "text": "Identify Mobile Keywords"
    },
    {
      "level": "H3",
      "text": "Optimize Content for Mobile Keywords"
    },
    {
      "level": "H2",
      "text": "Measuring and Analyzing Success"
    },
    {
      "level": "H3",
      "text": "Position Tracking"
    },
    {
      "level": "H3",
      "text": "Engagement Rate"
    },
    {
      "level": "H3",
      "text": "Conversion Rate"
    },
    {
      "level": "H2",
      "text": "Start a Mobile Marketing Strategy for Your Local Business"
    }
  ],
  "author": ""
}