{
  "url": "https://www.semrush.com/blog/mobile-serp/",
  "slug": "mobile-serp",
  "title": "Google’s Mobile SERP: Everything You Need to Know",
  "description": "Explore the features of the most popular search experience on earth, then use them to benefit your business",
  "content": "What Is a Mobile SERP?A mobile search engine results page (SERP) is the version of the results page that a search engine displays on mobile devices, rather than desktop.Is the Google Mobile SERP Important?It’s important to understand Google’s mobile SERP because it’s the most used search experience of all. Over 60% of searches now occur on mobile devices. And as of October 2023, 91.55% of searches happen on Google. Plus, Google predominantly uses the mobile version of a website to index and rank it within its results. This is known as mobile-first indexing.Once you understand how mobile SERPs work, you’ll be better equipped to optimize your content to perform well on mobile. This can help you win more organic traffic.Google Mobile SERP FeaturesAlthough they look a little different on mobile devices, SERP features (non-standard elements like those listed below) are mostly the same on mobile as they are on desktop.They include (but aren’t limited to): Featured snippet Google Ads Local pack Videos Top stories Images Knowledge panel People Also Ask Related searchesFurther reading: What Are SERP Features? An In-Depth GuideHere are three differences, though.1. App Packs Only Exist on MobileOne SERP feature that is unique to mobile is the app pack. If a search implies that the user could be looking for an app, links to the app itself are displayed.App packs are typically positioned mid-page, below sponsored results, below the first organic result(s), and sometimes below People Also Ask. The exact position varies. It looks like this:The results are specific to the device’s operating system. Links direct users to the app’s page within the appropriate app store. 2. Some SERP Features Are More ProminentSome mobile SERP features take up a greater percentage of screen space compared to their desktop SERP counterparts.For example, here’s the featured snippet for “how to prepare an interview” on desktop:Note that the next feature (People Also Ask) is fully visible without scrolling.On mobile, it looks like this:Almost the entire screen (before scrolling) is taken up by the featured snippet.The same is true of local packs, videos, and other features.Because of their prominence on screen, it’s likely that SERP features on mobile get a greater share of the overall clicks than they do on desktop.3. Some Google SERP Features Appear More (or Less) Often on MobileAlthough most of the Google SERP features exist on both desktop and mobile, they don’t always appear at the same frequencies.In this Semrush study on ecommerce SERP features, we found certain features appeared more in desktop SERPs, while others appeared more in mobile SERPs.For example: Related products appeared in 99% of desktop SERPs but only 76% of mobile SERPs. The average number of products shown was also higher (five on desktop vs. four on mobile).The buying guide feature (an expandable list of product-related questions) was also more frequently displayed on desktop versus mobile. (7% and 6% of the time, respectively.)On the flip side, local packs were seen more frequently on mobile devices (31% vs. 26% on desktop).How to Check if Your Site Has Google Mobile SERP Features If you want to check whether your website appears in any mobile Google SERP features, you can use Semrush’s Position Tracking.It gives you an overview of your organic rankings for a set of target keywords. And it monitors your site’s appearance in Google SERP features.To set it up, head to the Position Tracking tool, enter your domain name, then click “Set up tracking.”You’ll select configuration options in the “New Position Tracking Campaign” pop-up menu.In the “Targeting” tab, be sure to choose “Google” as your search engine and “Mobile” as your device type.In the “Keywords” tab, add the specific keywords you want to monitor. Be sure to include the ones you think may trigger an appearance in a Google SERP feature. Once everything is set up, “Start Tracking.”Then head to the “Overview” report.To check Google SERP features, scroll past the graph to the “Rankings Overview” table.The column titled “SF” displays information about the SERP features shown for that keyword.The number indicates how many SERP features are present. Clicking it shows which they are.Clicking the icon next to the number lets you see what the SERP actually looks like for users.To quickly view all the tracked keywords where your site displays in Google SERP features, use the “SERP Features” drop-down filter. Select “yourdomain.com ranks.”Google Mobile SERP DesignThe mobile SERP adapts to suit smaller screen sizes in various ways. Here are three unique-to-mobile design elements. 1. No SidebarsSome Google SERP features, like a knowledge panel, appear in the right sidebar on desktop SERPs.(A knowledge panel displays a short overview about a topic, brand, or business without requiring the user to click.)On mobile, since there isn’t space for two columns, they appear at the top instead.The same is true for Google Business Profiles. On desktop, the profile appears in the right sidebar:While on mobile, the profile appears above the organic results:2. Shorter Meta Descriptions, Longer Title TagsThe anatomy of a regular, organic result is the same on mobile as it is on desktop.Organic results consist of: Website name Title tag Meta description Favicon (logo image) URL path Sometimes other Google SERP features like reviews (shown below) or sitelinksHowever, titles and descriptions display at different maximum lengths on mobile SERPs. There’s no actual limit for the number of characters in a title tag or meta description. But there is a point after which Google will cut off characters when they’re too long. Like this:On mobile SERPs, the meta descriptions are cut off sooner than they are on desktop.On desktop, meta descriptions cut off at approximately 960 pixels or 152 characters. On mobile, they cut off after approximately 680 pixels or 105 characters. Which means it’s best to stick with a limit of 105 characters.And title tags?Mobile SERPs can technically display longer ones because they can use multiple lines.Here’s an example of a title tag that is cut off on desktop:But not on mobile:Title tags are cut off after around 600 pixels on desktop, which is about 60 characters. While they can be longer on mobile devices, it’s best to stick with that threshold to ensure your title tags don’t get truncated on any device. 3. Tap-to-Call ButtonsFor convenience, some Google mobile SERP features let users initiate a call in one tap. They’re mostly seen when searching for a local business.Google Ads can also contain tap-to-call buttons, which look like this:Google Business Profiles have tap-to-call buttons too, which look like this:Changes to the Google Mobile SERP DesignGoogle regularly makes small tweaks to the mobile SERP design. And often runs experiments.Here are three notable changes to the mobile SERP that impacted user experience.1. Google’s 2021 Mobile SERP RedesignOne significant design update from early 2021 was well documented.Key changes included: Larger, bolder text for accessibility and easier scanning Edge-to-edge results for more visual space and a modern look Rounded icons and corners, aligning with Google’s brandingImage Source: Google2. Continuous ScrollingGoogle removed pagination from their SERPs. Instead of tapping “See More,” “Next,” or a page number after 10 organic results, more now load automatically.As a result, it’s likely that results in position 11 or lower get a small increase in visibility.This change was introduced first to mobile in late 2021. It rolled out on desktop in late 2022.Note“Continuous scrolling” doesn’t mean infinite scrolling. After a while (usually four pages), the user still needs to click “More search results.”3. Adding Website Names and FaviconsPrior to 2019, branding wasn’t clear for organic listings.After a Google SERP design update (which came to mobile first), two new elements were added: Website name Favicon (logo image)It’s useful for searchers to see at a glance who is the publisher of the content. That way, they can quickly identify familiar brands. Or assess credibility.Image Source: GoogleHow to Preview Mobile Search Results for Keywords of InterestIf you want to see what mobile search results look like for a specific keyword of interest, you can use a tool like Keyword Overview.This is more reliable than trying to create the experience on your own device since location affects search results. The SERP you see on your mobile device might not be the same if you’re not searching from your target location.Start by entering your target keyword and choosing the target country.You’ll get useful information like average number of searches per month, Keyword Difficulty (how much SEO effort it would take to rank in the top 10 results), and more.Next, click the “Desktop” drop-down and switch to “Mobile.”Then, scroll down to the “SERP Analysis” section, and click “View SERP.”You’ll get something that looks like this, simulating a real mobile search for your target keyword in your target location.Learn to Conquer the Mobile SERPInterested in increasing your visibility on mobile SERPs and getting more traffic to your site? Read this comprehensive guide next: The Complete Guide to Mobile SEOYou’ll learn how to: Optimize your website for mobile Write mobile-friendly content Analyze competitor mobile SEO performanceAnd more.When you’re ready to start tracking your mobile SEO performance, give Semrush Position Tracking a try (for free).",
  "headers": [
    {
      "level": "H1",
      "text": "Google’s Mobile SERP: Everything You Need to Know"
    },
    {
      "level": "H2",
      "text": "What Is a Mobile SERP?"
    },
    {
      "level": "H2",
      "text": "Is the Google Mobile SERP Important?"
    },
    {
      "level": "H2",
      "text": "Google Mobile SERP Features"
    },
    {
      "level": "H3",
      "text": "1. App Packs Only Exist on Mobile"
    },
    {
      "level": "H3",
      "text": "2. Some SERP Features Are More Prominent"
    },
    {
      "level": "H3",
      "text": "3. Some Google SERP Features Appear More (or Less) Often on Mobile"
    },
    {
      "level": "H2",
      "text": "How to Check if Your Site Has Google Mobile SERP Features"
    },
    {
      "level": "H2",
      "text": "Google Mobile SERP Design"
    },
    {
      "level": "H3",
      "text": "1. No Sidebars"
    },
    {
      "level": "H3",
      "text": "2. Shorter Meta Descriptions, Longer Title Tags"
    },
    {
      "level": "H3",
      "text": "3. Tap-to-Call Buttons"
    },
    {
      "level": "H2",
      "text": "Changes to the Google Mobile SERP Design"
    },
    {
      "level": "H3",
      "text": "1. Google’s 2021 Mobile SERP Redesign"
    },
    {
      "level": "H3",
      "text": "2. Continuous Scrolling"
    },
    {
      "level": "H3",
      "text": "3. Adding Website Names and Favicons"
    },
    {
      "level": "H2",
      "text": "How to Preview Mobile Search Results for Keywords of Interest"
    },
    {
      "level": "H2",
      "text": "Learn to Conquer the Mobile SERP"
    }
  ],
  "author": ""
}