{
  "url": "https://www.semrush.com/blog/most-common-legal-ethical-aspects-of-blogging-and-content-marketing/",
  "slug": "most-common-legal-ethical-aspects-of-blogging-and-content-marketing",
  "title": "Most Common Legal Aspects of Blogging and Content Marketing",
  "description": "A roundup with experts about the most common legal and ethical aspects of blogging and content marketing, where we discuss ethical borders and provide tips, useful to both novice writers and experts.",
  "content": "Content marketing has the highest priority in marketing these days. It’s a naturally growing trend, not just a temporary fad that serious marketers can easily neglect. “86 percent of B2B marketers report that their organizations are using content marketing, and 70 percent of them are creating more content than they did one year ago.” contentmarketinginstitute.com But as we all know, if there's profit to be made, there are those who will take advantage of it with shortcuts. While black hat techniques may work to an extent, using them comes with a price —losing not just your search positions, but your reputation. Along with your users' trust, your reputation is your most valuable asset. Professional writers are not just individuals with verbal skills; real professionals can enrich your community with new knowledge, change minds and influence readers' decisions. But more importantly – professionals stay responsible and don't allow themselves to cross borders beyond which writers’ interests harm readers, editors, and other writers. We decided to find information on the most common legal and ethical aspects of blogging and content marketing, discuss ethical borders and make a roundup useful to both novice writers and experts. Don’t forget to check out the SlideShare presentation – it contains additional information and useful links on the topic. We are very glad to introduce guest experts of this roundtable who shared their experiences and thoughts on dealing with sharp, ethical questions. Kerry Butters Technology writer, founder, and director of markITwrite, digital content agency. Amberly Dressler Managing Editor at Website Magazine. Gideon Greenspan Entrepreneur, Co-Founder and CTO of Copyscape, the web's leading search engine for textual plagiarism. Susan Gunelius President & CEO of KeySplash Creative, Inc., marketing communications company offering copywriting and content writing, published author. Andrew Hutchinson Content and Social Media Manager at Social Media Today. Kelsey Jones Former Executive Editor of SEJ and Owner of StoryShout - first news content marketing agency. Kelley Keller Intellectual property (IP) attorney, speaker, legal blogger, and small business educator . Trevor Klein Audience Development Manager at Moz. John Rampton Entrepreneur and writer; a blogging expert by Forbes, contributor for Entrepreneur, TechCrunch and Mashable. What is Plagiarism On what terms can a text be considered plagiarism? How can you find out if someone is using your content? How can you prevent it and what can you do to minimize your loses if you’re a victim of fraudulent actions? Plagiarism can greatly harm your website, your reputation and your relationships with editors and other authors. It’s also a huge, indisputable ethics violation. On what terms can text be considered as plagiarism? Andrew Hutchinson If someone duplicates and reproduces your content without permission, and without attribution, that's plagiarism. Also, if someone copies your work but rewords it slightly to try to get away with it, that's plagiarism. I think the open access of the web has made some people feel as though everything is free, that the traditional rules of plagiarism don't apply in the digital world, but the rules are the same. If you steal something from somewhere else, it's stealing. John Rampton I consider five consecutive words copied as plagiarism. After the fifth word, you should consider what you're doing stealing. Is there any way to detect plagiarism? Before publishing, do you use plagiarism-detection software? Kelsey Jones Yes, we run all our content through Copyscape. We also syndicate some posts from sites like WordStream and Unbounce; and we use canonical redirect to make sure that search engines don't see it as duplicate content. The blogs we syndicate from also know we do this. Amberly Dressler We use plagiarism-detection software for guest posts. Some contributors have been as bold as to hijack complete paragraphs from various sources and format them into one article. At the opposite end of the spectrum, companies have simply misread our guidelines and published their pieces on their own blogs, or with other publications, before sending them to us, an honest mistake. What issues can be considered copyright violations? Kelley Keller Copyright law gives the author of an original work the exclusive right to:(1) copy, (2) distribute, (3) make derivatives of, (4) publicly perform, and (5) publicly display their works.As authors of original works, bloggers enjoy these same rights. If you copy content and post it as your own, you have violated the copyright owner’s exclusive right to copy, distribute, and publicly perform their work. But there are exceptions to this reservation of rights, the most popular of which is “fair use.” What should you do if your text has been copied? Gideon Greenspan I think the issue that troubles most website owners is the risk of their original site being demoted in search engines, in favor of a site that has scraped their content. This is of course infuriating, and it can take some time to resolve. Another lesser concern is possible brand weakening. The most important thing is to remain calm and be aware of what is and is not in your power. For example, you can't force a web hosting company located in a weak legal jurisdiction to take down the offending content. However, you can petition American search engines (via the Digital Millennium Copyright Act) to remove that content, which achieves a similar result from the perspective of web users. It is always worth starting by politely contacting the owners of the plagiarizing site, since mistakes can genuinely be made—especially if their content writing was outsourced. John Rampton You can contact them and ask them to attribute content, and technically you could send a note from an attorney; but I've never gone that far. My stuff gets copied daily. If it's my best stuff, I ask for a link. Where is the line between fair use and plagiarism? Kelley Keller The line between plagiarism and fair use under copyright law is a thin one!Many plagiarisms are also copyright infringements and vice versa; they are not mutually exclusive. Plagiarism is using another’s work (whether copyright protected or not) without giving credit to the original source, such as quoting from the Gettysburg Address without attributing it to Abraham Lincoln. Copyright infringement, on the other hand, is the unauthorized use of another's legally protected work, regardless of attribution, such as reprinting the copyrighted lyrics from a Rolling Stones hit in a blog post without permission from the copyright owner (probably the record company).The fair use rule basically says that sometimes a copyright infringement isn't illegal given the unique context and circumstances of the unauthorized use, which generally includes non-commercial uses of some (not all) of a protected work (images, videos, blogs, and the like) for news reporting, educational uses, and even parodies. If the reprint of the Rolling Stones' lyrics gave credit to the band, there would be no plagiarism, but there is still a copyright infringement since no permission was given.However, if the blog were for a news agency's website, and only some of the lyrics were reprinted (just the part needed to make the point of the story), then it could be considered a fair use. Susan Gunelius First, understand that fair use is muddy waters, and a blogger is safest simply assuming that their use of another person's original work is not covered under fair use. Plagiarism is different because it's the act of copying another person's work and passing it off as your own. Copyrights are related to ownership of the work, and giving others permission to use the work in their own work. In other words, if you plagiarize something, you're probably violating copyright laws; but if you violate a copyright law, you're not necessarily guilty of plagiarism. Violation of Copyright Laws Images are objects of intellectual property. Like texts, they are protected by laws that reinforce the author’s ownership and regulate process of transfer it to other people just under certain conditions. What consequences can copyright violation lead to? How can you avoid trouble and remain not just within ethical, but also legal boundaries when creating visuals. Do you check to see if your contributors’ images come from reliable sources? If an image violates copyright law, what consequences might you face? Kelsey Jones Yep, we only allow images that come from Creative Commons or Shutterstock, because Shutterstock is the only image site we have a site-specific license for. We also allow illustrative screenshots (e.g., a screenshot of someone's Google Analytics dashboard, if they are describing a custom step on that screen) or images for which the author got written permission by emailing the creator. If an image violates copyright laws, we would probably end up having to pay a hefty fine, which is why we are diligent about not allowing copyrighted images on the site. We started being very strict about this when I came on as editor in the Fall of 2013. Trevor Klein Images are really difficult, as there are so many factors to consider. Is the source cited by the author actually the original source? (It's relatively easy to rip off someone's image, then stick it on Flickr with a Creative Commons license.) Has it been altered sufficiently in order to comprise an original work? Is it being published on a medium or in a way that brings up the \"fair use\" question? We try hard to perform detailed checks on all our images, but don't claim to be perfect. It's far easier to request that authors create their own images (screenshots, etc.), as they're usually better at illustrating their own points anyway. And, in the rare case something slips through, we'll happily work with the image's creator to remedy the situation amicably, using that situation to get a little better at things as we go along. What sources do you use for image research? Andrew Hutchinson Images are always an issue. I generally make my own. Learning Photoshop is a great skill to have, so the more I can create, the better. Sometimes this doesn't work in my favor, but most times, I'm able to create professional-looking images or utilize my own photos. If I need a stock image, Wikipedia is actually a good source, as all the images are licensed under Creative Commons (there are specific restrictions, so you need to check each, case-by-case). Kerry Butters I find Creative Commons images through a Google image search with the ‘marked for reuse’ option. I also use sites such as Pixabay and Flickr, and a few others. For other images, I use stock image sites and, occasionally, freelance photographers. Creative Commons images - what users should be aware of while using them? Susan Gunelius Beware of Creative Commons when searching for images to use in blog posts, because images on Flickr and similar sites are often uploaded by someone other than the owner. That means the Creative Commons license that the uploader applied to the image might not be the same license that the owner of the image applied to it; and if you use that image, you could be violating copyright laws. Many bloggers have received the dreaded Getty Images Demand Letter for this very reason. Ethics of Ghostwriting Opinions of ghostwriting range from harshly negative to complete approval, with hundreds of shades in between. Let’s see what out participants think about it. Do you consider ghostwriting ethical? Is there a line beyond which ghostwriting is becoming an unhealthy practice? Trevor Klein It isn't inherently unethical. In a sense, if it's good enough for the President of the United States, it's good enough for me. That doesn't mean, though, that I'm a fan of it. It tends to make the editorial process more difficult, as there are at least three people involved, where there's normally just an author and an editor. That's a necessary step: The purported author (the one whose face will appear with the post) needs to, at least, be involved in the creation of the piece, and signal its final approval before it's published. There are a number of situations that would warrant this approach, most often involving an author that's either incredibly busy or isn't able to illustrate their ideas very well in writing. Neither of those situations should mean their ideas don't get published. I wouldn't accept a ghostwritten post if I thought that the purported author wasn't actually heavily involved; although, at the end of the day, I'd far rather they were upfront about their collaboration. My sincere thanks to our staff writer Jane Doe for helping me get these ideas on paper is transparent, easy, and doesn't approach any ethical boundaries. John Rampton I think it’s 100 percent ethical and something I personally have had done for me and have done for other people. I think it's a very heathy practice and the only way to scale content. Kelsey Jones I think ghostwriting is the \"elephant in the room\" for many highly visible people in our industry. I myself have ghostwritten for three colleagues whose work appears on sites like Forbes and The Huffington Post. At Search Engine Journal, we know many people use ghostwriters; but if we knew for a fact that someone was using a ghostwriter who wrote their posts completely from scratch, we wouldn't publish it. Andrew Hutchinson Yes, I think ghostwriting is an ethical practice, and it enables writers to expand their offerings, as you can write for someone else without having your name attached. Sometimes a business owner will want to promote their company and their content; having your name attached can detract from this. But they still need a good writer and good content, so there's a solid business case for ghostwriting. The ethics of such a practice comes down to the integrity of the author. I think the real question is how that content is shared and promoted by the writer. If I were to promote something via my own social networks, for example, something that I'd written, but I didn't make that clear, the ethics of such a practice are questionable. Kerry Butters Online, the only real problem with it is that it’s often done without a real reason when it would make no difference to give the writer a byline. This means that a lot of good writers then find it hard to build a good presence and portfolio, because a site owner prefers to have a blog posted by ‘admin’ for example. Writer bylines should be given wherever possible – it’s only fair. Brand Mentions in Guest Posts The temptation to include your company name in your guest article for a big website or a well-known blog is totally understandable. It is possible to earn points not for your personal authority, but for the company you represent. Let’s dispel all doubts and define the boundaries within which brand references are valid and ethical. Do you consider it to be ethical to mention your company’s name while guest blogging? Andrew Hutchinson I'm a freelance writer, so in my case, yes. If I were writing on behalf of a client or business, I also think it would be ethical, as in that instance, you're working to promote your expertise and that of the brand you represent. If you don't mention them, you're not showcasing your knowledge. Kerry Butters No, I think that it’s important for writers to remain transparent and not plug their own interests. It’s OK in some respects, for example when giving a quote for an industry piece, but for the most part, it should be avoided. Do you accept articles with brand or company mentions if the contributor is an affiliate? Is it ethical to mention affiliated brands? On what terms would you claim an article as promotional? Kelsey Jones We usually strip out all links that are promotional in that way. If an author wants to link to something they are involved with, we require a disclosure. Overall, we don't allow any affiliate links or links that are overly promotional. SEJ wants to remain a place for thought leaders to share their knowledge and further their communities, not to promote their wares to our audience for free. We do sponsored reviews, but those are paid for and clearly marked in the title, and at the bottom and top of the post. Amberly Dressler Ninety-nine percent of the time-affiliate-written pieces are very obvious and are rejected for their clear affiliation to the brand mentioned in them (e.g., an article about mobile apps with a link to a phone carrier), which is why Website Magazine requires articles to be vendor neutral and rejects those that are not. Trevor Klein First and foremost, it has to provide unique value -- in our minds and to our audience. If it doesn't, it'll get declined on those grounds just like any other post would. If we really believe the tools or services in question are great, and the author writes about them in a way that's educational and not “salesy,” then we'll at least take a look. The only other requirement would be that the author immediately discloses their affiliation. I'll also say that it's generally best to try to get a neutral third-party to write the piece, as the “grain of salt” it requires of the readership is significantly smaller. When is brand mention becoming unhealthy practice? Susan Gunelius One of the most important but misunderstood legal issues that bloggers must understand relates to disclosing material connections. The U.S. Code of Federal Regulations provides very specific instructions on how bloggers should disclose material connections, which could be in the form of monetary compensation, free items, free advertising and so on. Bloggers most frequently violate laws related to disclosing materials connections when they publish blog posts that a third party pays them for, or when they publish a review about a product or service without disclosing the compensation or free product they received from the third party in exchange for publishing the post or review. The connection must be very clearly communicated in the blog post. If an advertiser asks a blogger to publish a sponsored post, or write a product review, but also asks the blogger not to disclose the fact that the advertiser paid for the post or review, the blogger should turn down the offer. Both the advertiser and the blogger could get into trouble if they're caught. Well, we hope you found this post useful! If you have something to add, you want to share your experience or discuss any other ethical questions of blogging and content marketing, please, leave your comments below.",
  "headers": [
    {
      "level": "H1",
      "text": "Most Common Legal Aspects of Blogging and Content Marketing"
    },
    {
      "level": "H2",
      "text": "What is Plagiarism"
    },
    {
      "level": "H3",
      "text": "On what terms can text be considered as plagiarism?"
    },
    {
      "level": "H3",
      "text": "Is there any way to detect plagiarism? Before publishing, do you use plagiarism-detection software?"
    },
    {
      "level": "H3",
      "text": "What issues can be considered copyright violations?"
    },
    {
      "level": "H3",
      "text": "What should you do if your text has been copied?"
    },
    {
      "level": "H3",
      "text": "Where is the line between fair use and plagiarism?"
    },
    {
      "level": "H2",
      "text": "Violation of Copyright Laws"
    },
    {
      "level": "H3",
      "text": "Do you check to see if your contributors’ images come from reliable sources? If an image violates copyright law, what consequences might you face?"
    },
    {
      "level": "H3",
      "text": "What sources do you use for image research?"
    },
    {
      "level": "H3",
      "text": "Creative Commons images - what users should be aware of while using them?"
    },
    {
      "level": "H2",
      "text": "Ethics of Ghostwriting"
    },
    {
      "level": "H3",
      "text": "Do you consider ghostwriting ethical? Is there a line beyond which ghostwriting is becoming an unhealthy practice?"
    },
    {
      "level": "H2",
      "text": "Brand Mentions in Guest Posts"
    },
    {
      "level": "H3",
      "text": "Do you consider it to be ethical to mention your company’s name while guest blogging?"
    },
    {
      "level": "H3",
      "text": "Do you accept articles with brand or company mentions if the contributor is an affiliate? Is it ethical to mention affiliated brands? On what terms would you claim an article as promotional?"
    },
    {
      "level": "H3",
      "text": "When is brand mention becoming unhealthy practice?"
    },
    {
      "level": "H6",
      "text": "Most popular pages"
    },
    {
      "level": "H6",
      "text": "SEO Checklist: 41 Tips to Optimize Your Website"
    },
    {
      "level": "H6",
      "text": "How to Perform a Complete SEO Audit (in 14 Steps)"
    },
    {
      "level": "H6",
      "text": "A Beginner’s Guide to Keyword Search Volume"
    }
  ],
  "author": ""
}