{
  "url": "https://www.semrush.com/blog/must-know-seo-practices-for-content-delivery-networks-cdns/",
  "slug": "must-know-seo-practices-for-content-delivery-networks-cdns",
  "title": "Best Practices for Content Delivery Networks (CDN) SEO",
  "description": "Do you use a CDN (content delivery network)? Make sure your SEO isn‘t negatively impacted with these tips.",
  "content": "A content delivery network (CDN) definitely wins the SEO battle when it comes to page speed optimization techniques. Server location does matter a lot for search engine rankings and there are issues with internal web hosting.Plenty of discussions, how-to-guides, and articles supporting CDN usage are already all over. So, let us not add one more to it. Instead, let's look at how to make the best use of a CDN service without allowing your SEO to suffer.Installing and configuring a CDN on your website needs technical expertise and some ground-up activities. Implementing a CDN on your website requires that you know what values and what devalues your overall page speed optimization so the CDN can boost its performance. Setting up a CDN is not a straightforward process, and doing it wrong can hurt your SEO to a large extent. There are profound examples of it.Considering most of us know about CDN and its benefits, let me take you through some of the preparatory SEO guidelines that can help you maximize CDN investment. Following them will ensure that you don’t run the risk of losing all your visitors coming through Google image searches.Step#1: Set Up CDN Using Your Own SubdomainIn your DNS setup, create a ‘custom domain,’ preferably a sub-domain for your website, like cdn.yoursite.com, and use that as a CNAME. This ensures that CDN service exists on your own subdomain instead of one of the CDN provider’s subdomains, such as yoursite.cdn.com. If you are not sure what this difference signifies, it is better that you ask the provider if they can install the service on your own subdomain. Most of the popular CDN services can be set up the way you want.Enabling CDN using your own subdomain keeps the service proprietary to you and points SEO values of the CDN based resources to your root domain — yoursite.com instead of cdn.com. This approach maintains or even increases your main site's authority scores. This in turn boosts your SEO rankings. And of course, you are not bypassing your domain value to a third-party CDN site while improving page speed.Step#2: Be Consistent with the File Names and Their PathsSticking to the file naming conventions always pays off. Even if you opt for a CDN service or do some technical changes in your website files, the basics should not change. For example, you have an image at www.yoursite.com/resources/image1.jpg and your CDN provider renames the path to cdn.yoursite.com/resources/image000123.jpg or changes the entire folder structure so that your image file appears as cdn.yoursite.com/assets/image1.jpg. This may result in 404 errors for those old image paths unless automatically redirected to new paths.If the pre-CDN path of your image file appears as www.yoursite.com/resources/image1.jpg, your post-CDN file path should look like cdn.yoursite.com/resources/image1.jpg. Maintaining the file-path naming conventions avoids unwanted 404 issues and protects your site from negative SEO impacts.Step#3: Use Webmaster Tools to Your AdvantageUse Google Webmasters Tools and Bing Webmasters Tools to further control your geographical target; it does not matter the location of the IP address of your CDN provider is a different one than of your default place. This step is important as you don’t want search engines to automatically target a different geographical location (based on CDN provider’s IP address) than your intended territory. Most of us know that search engines prefer locally hosted websites.Setting up and verifying your CDN subdomain in GWT is easy. It also allows you to remove or block certain URLs (pre-CDN or post-CDN) based on your specific needs. Following the Google Webmaster guidelines on geo-targeting basics negates any discrepancy in SEO objectives and adds value to your localized SEO effort.Step#4: Be Sure to Add rel=Canonical TagsA CDN is generally known for hosting or caching website resources like image files, CSS, JavaScript, and video files that are heavy in size. However, if you host the entire site on a content delivery network you may run into a duplicate content issue. For example, if the pre-CDN page URL of your “About Us” section is www.yoursite.com/about-us/, the post-CDN page URL would look like cdn.yoursite.com/about-us/. These two separate URLs pointing to the same page may result in severe SEO issues having duplicate page content.Using rel canonical tag can avoid this duplicate content issue. Ensure that you use www.yoursite.com/about-us/ as a canonical or absolute URL path on the page cdn.yoursite.com/about-us/ and apply the same process throughout the other pages hosted in the CDN server. Following this approach will help Google to identify the preferred URL path that you wish to be recognized, indexed, and shown in the search results. This saves you from losing existing search engine rankings and link juice from previously indexed pages.For instance: Previously, when Moz.com introduced “Amazon CloudFront” — a CDN service introduced by Amazon for their website pages, they ran into similar duplicate content issues. Later on Moz had to throw 404 error pages in CloudFront and avoid duplicate content issues. Since Amazon’s CDN doesn’t cache 404 pages except for images, the problem got resolved in a few days. The Moz people also had to invalidate every page that was already cached and indexed by Google by using the page removal process of Google Webmaster Tools.CDN SEO and Its UsesUsing CDN service is only helpful if it does not harm your SEO efforts. Therefore, a CDN provider needs to follow the best practice CDN installation methods that not only improve page load speed but also render a positive effect on search engine rankings.",
  "headers": [
    {
      "level": "H1",
      "text": "Best Practices for Content Delivery Networks (CDN) SEO"
    },
    {
      "level": "H3",
      "text": "Step#1: Set Up CDN Using Your Own Subdomain"
    },
    {
      "level": "H3",
      "text": "Step#2: Be Consistent with the File Names and Their Paths"
    },
    {
      "level": "H3",
      "text": "Step#3: Use Webmaster Tools to Your Advantage"
    },
    {
      "level": "H3",
      "text": "Step#4: Be Sure to Add rel=Canonical Tags"
    },
    {
      "level": "H2",
      "text": "CDN SEO and Its Uses"
    },
    {
      "level": "H6",
      "text": "Most popular pages"
    },
    {
      "level": "H6",
      "text": "SEO Checklist: 41 Tips to Optimize Your Website"
    },
    {
      "level": "H6",
      "text": "How to Perform a Complete SEO Audit (in 14 Steps)"
    },
    {
      "level": "H6",
      "text": "A Beginner’s Guide to Keyword Search Volume"
    }
  ],
  "author": ""
}