{
  "url": "https://www.semrush.com/blog/native-ads/",
  "slug": "native-ads",
  "title": "Native Ads: What They Are & How to Use Them",
  "description": "Learn what native ads are, why you should use them, and how to get started with native advertising.",
  "content": "What Are Native Ads?Native ads are a type of paid advertisement that blends with the look and feel of the content on the platform where they appear.And native advertising lets you engage your audience across different channels. Such as search engines, social media feeds, and content discovery platforms like Google Discover, Feedly, Reddit, Quora, and more.Native ad formats include: Articles Social posts Images Videos These ads are typically marked as “Sponsored,” “Promoted,” or “Ad.”For example, Think with Google uses native advertising to promote content on LinkedIn:A native ad fits seamlessly into the page content and design. So it looks like organic content. Here’s what native advertising looks like on a Google search engine results page (SERP):Unlike display ads, native advertising doesn’t disrupt the user experience. That’s why it’s a popular paid advertising tactic.Pro tipUse Semrush’s Keyword Magic Tool to get relevant keyword ideas for your native advertising strategy. Native Ads vs. Display AdsHere’s a quick rundown of the differences between native and display ads: Native Ads Display Ads Ideal for Content promotion, brand awareness, engagement, building trust Brand awareness, retargeting, lead generation, conversion Appearance Sponsored content, social media ads, in-feed units Banners, pop-ups, interstitials, rich media Blending Blends in with the content Stands out from the content Example A travel website article recommending a “5 Must-See Places in Hawaii” list sponsored by a resort An automobile company promoting their newly launched car on a news site Click-through rate (CTR) High Low User experience Less intrusive and feels like a soft sell More intrusive and comes across as a hard sell Now, let’s get into the details.Native AdsNative ads mostly appear on social media feeds, SERPs, news or publishing sites, and video platforms. They help you: Promote content: Place your content in front of a larger, relevant audience. And amplify its reach. Drive engagement: Encourage the audience to engage with and share your promoted content Build trust: Establish your brand as a source of quality information. By providing valuable, informative, or entertaining content through native ads.In the online advertising world, native ads can be hard to spot. And you’ll typically consume them like you would regular content.For example, this ad for fashion brand Djerf Avenue blends with the surrounding content on Pinterest. You only know it’s an ad from the “Promoted by” label. Thanks to their ability to blend into platforms, native ads tend to get more clicks than display ads.Display AdsDisplay ads are visual advertisements that appear on websites, apps, and social media platforms. They come in various sizes and formats. Like banners, interstitials, and pop-ups.Display ads can use a combination of text, images, videos, and graphics.Unlike native ads, they’re designed to grab the audience’s attention. But they also tend to be more intrusive than native ads. Here’s an example: Elastic, a search analytics platform, uses banner advertising to promote its product on Fortune. The ad is at the top of the screen, making it hard to miss. And features a bold headline.Display ads help you: Increase brand visibility: Reach a large audience Reach potential customers: Target your ads to the people most interested in your offerings Generate leads: Promote lead magnets like tools, gated content, free trials, and webinars Boost conversions: Retarget users who previously showed interest in your product or interacted with your website or social accounts. And convert them into paying customers.For example, see how Adobe promotes its free trial of Acrobat Pro DC on Search Engine Journal in the image below? This is a perfect example of using display ads for lead generation.And GoDaddy is using ads to drive conversions.NoteDisplay and native ads serve different purposes. So, consider using both as part of your marketing strategy. To leverage the strengths of each ad format to optimize your marketing performance.Benefits of Native AdvertisingNative ads’ benefits go beyond better performance for advertisers. They also improve the overall experience for the audience. Here are some specific benefits: Less intrusive: Native ads don’t interrupt users’ flow. This can enhance user satisfaction and loyalty to the platform. Higher engagement rates: Native ads often feature content that aligns with the audience's interests. And because they feel less like ads, they can garner more engagement. Reduced ad blindness: Thanks to its subtle approach, native advertising helps combat people’s tendency to subconsciously ignore ads. So your audience doesn’t tire of seeing your ads. Targeted reach: Native ads enable you to target audiences based on demographics, interests, and more. Which could result in more conversions. Improved brand awareness: Even if users don't click a native ad, they might still notice your brand, logo, or product. This builds familiarity to help them recall your brand when they're ready to buy.5 Popular Native Ad Types In-Feed/In-Content Native AdsIn-feed and in-content ad units both match the style of the surrounding content. And differ only in placement: In-feed ads appear in content feeds. Like news or social media feeds. In-content ads appear within a single piece of content. Such as a news article.Let’s look at some examples of in-feed native ads.Here’s how Atlassian promoted industry recognition on the Google Discover feed. It looks just like a regular article. But it’s really an in-feed native ad. Native video ads are another popular in-feed advertising format that many brands use.For instance, this native video ad from Aramco on X (formerly Twitter) looks like a regular corporate branding video about women's golf. But it’s an advertisement. Notice the “Ad” label in the top-right corner.TipUse Semrush’s audience research tool One2Target to analyze your target market’s online behavior. And reach them on their preferred channels with the kind of ads they prefer. Content Recommendation AdsContent recommendation ads (also known as content recommendation widgets or sponsored content ads) help you promote content assets. Like blog posts, articles, videos, product pages, landing pages, and more. You can usually find them at the bottom of articles or in a webpage’s sidebars. With labels like: “Recommended for You” “You Might Also Like” “Sponsored” “Recommended Content”Advertising platforms like Outbrain, Taboola, and RevContent help you reach audiences across various publisher platforms by automatically showing relevant content recommendations. Based on content consumption preferences and behavior across websites. Here’s an example of multiple content recommendation ads on Newsweek’s website.Branded ContentBranded content is paid editorial content. It looks like a regular article or video on a website but a brand pays for it as a part of an advertising deal with a publisher. This native ad type helps you reach a wider yet targeted audience by partnering with top publications.For example, sustainable footwear brand Allbirds collaborated with the New York Times to publish branded content as a native ad. While it reads like a regular article, it's a paid post by Allbirds.Done well, this ad format can provide the same value the organic content does. And may even get similar engagement.So, collaborate with the publisher’s creative and editorial teams to ensure branded content matches the site. Or work with a marketing agency. Further reading: Sponsored Content: The Ultimate Guide with Inspiring ExamplesPaid Search AdsPaid search advertising allows you to display your ads on search engines like Google and Bing.These ads look similar to organic results. But they’re labeled “Sponsored” or “Ad.”Like this:These ads are a type of pay-per-click (PPC) ad.Here’s how it works:You bid on keywords and phrases relevant to your business. And when users’ search queries include those keywords, your ad can be shown to them in search results.Use our Keyword Magic Tool to find relevant keywords for your ad campaigns. You’ll get thousands of keyword ideas. And the average cost per click (CPC)—the average amount advertisers are willing to spend for a click on their ads. Promoted ListingsPromoted listings are product ads that appear on ecommerce marketplaces like Amazon, eBay, and Etsy. And you can use these ads to increase visibility and drive sales. Like other native ads, promoted products blend with regular product listings. And mimic the appearance of the ecommerce platform.But they’re marked “Sponsored,” so shoppers know they’re seeing advertised products.Here’s what promoted listings look like on Amazon:Further reading: Product Listing Ads: What They Are and How to Use ThemHow to Get Started with Native Advertising1. Define Your Native Ad Campaign GoalsStart by clearly outlining your native advertising goals. Which will help you decide the right ad platforms, formats, and budgets for your campaigns.For example: If your goal is to generate leads for your professional services, you might opt for in-feed ads or sponsored content on platforms like LinkedIn, X, or Quora If you want to drive sales for physical products, promoted listings on top ecommerce marketplaces can work wellNext, ensure your goals are specific, measurable, actionable, relevant, and time-bound (SMART). Say you want to increase sales for your T-shirt business. Using the SMART framework, this same goal would look something like this: “Increase T-shirt sales by 10% in the next three months using promoted listings.” Specific: Mentions increasing T-shirt sales by 10% using promoted listings Measurable: Specifies a 10% sales increase serves as a performance measurement metric Actionable: Clarifies that promoted listings are the method to achieve sales growth Relevant: Alludes to the fact that increasing sales of a product directly impacts business objectives Time-bound: Includes a specific three-month time range for completion2. Know Your Target AudienceNative ad campaign success largely depends on how well you know your target audience. Because it helps you ensure your ads are reaching the right people and that you’re using your budget efficiently.Here are some key questions to help you understand your target audience: Who are my current customers? Analyze demographic and socioeconomic data like age, gender, income level, and education. And research overlapping interests to identify ad topics that will resonate with them. What problems does my product or service solve? Find out who is most affected by the issues your product or service addresses. To effectively position your product as an ideal solution. Where does my target audience spend their time online? Track preferred social media platforms, websites, and forums. This helps you effectively place your ads. How does my target audience consume content? Find out whether they prefer video, text, audio, or images. Check when they’ll most likely consume (and engage with) content.To find the above information, conduct market research using customer interviews and surveys and analytics tools like Google Analytics (note this will only provide insight into your current website visitors).To gain deeper insights on your target audience, use Semrush’s One2Target tool.Open the tool, enter three to five competing domains, and click “Analyze.”In the “Demographics” tab, you’ll see: How the audience is distributed across age groups and gender for each competitor The number of unique visitors for each domain The countries each domain’s site visitors are fromThen, head to the “Socioeconomics” tab to learn about household size, income level, etc.Now, click the “Behavior” tab. To learn about your audience’s content consumption patterns and interests. And the social media channels and devices they use.Hit “Export” to save this data. And refer to it while planning your native ad campaigns. For example, use the audience’s online behavior data to choose the most effective ad platforms and formats. And reference the demographic information to create highly relevant ads.This can help increase your campaign’s engagement and conversion rates.3. Choose the Right Native Advertising PlatformNow, think carefully about which platform(s) are best for your ads. Because the choice of platform can play a huge role in performance.These key factors can help you choose the right native ad platform(s): Audience: Consider what you discover about your audience. To assess whether the platform can effectively target your customers. Campaign goals: If your goal is lead generation, consider networks specializing in lead capture forms within native ads. And for sales-related goals, platforms with strong ecommerce integrations might be a good fit. Platform features and ease of use: Is the platform's interface user-friendly for managing ad campaigns? Does the platform offer detailed reporting that allows you to effectively measure performance? Customer service: Will you have access to customer support if needed?Begin with one or two platforms. And test your campaigns before scaling up.Here's a breakdown of native ad platform options:Content Recommendation NetworksThese platforms help you reach audiences across diverse websites using in-feed ads and content recommendation widgets.Here are a few you can choose from: Outbrain RevContent TaboolaSocial Media PlatformsSocial media platforms allow you to use targeting options and promoted post formats to drive engagement.Some of your options are: Facebook Instagram X LinkedInTo ensure you're making the best choice, leverage tools like Social Analytics from Semrush Social. This app provides detailed insights into your social media performance and audience preferences on Facebook, Instagram and LinkedIn. This helps you understand which platforms work best for your native advertising campaigns.Search EnginesSearch ads give you the opportunity to run native ads within search results. And target users based on search queries.Here are two options: Google Ads Microsoft (Bing) AdvertisingDemand-Side Platforms (DSPs)Demand-side platforms provide access to a wide range of native ad networks and publishers. These platforms are often suited for larger budgets. And technical expertise.These are a few potential choices: The Trade Desk Nexxen MediaMath4. Set a Budget for Your Ad CampaignWhen deciding your campaign budget, consider these factors: Campaign goals Scope (or duration) Average costs Conversion rateWhile setting goals and scope is an internal decision, you'll need to research average advertising costs and conversion rates. For example, WordStream publishes an advertising benchmark report every year. And it includes information about cost per click, click-through rate, and conversion rate. And ad platforms like Google Ads and LinkedIn Ads provide benchmarking tools. To help you find data related to your industry and location.Here’s an example that explains how to define your campaign budget:Let’s say your goal is to generate 100 new leads every month using PPC search ads on Google.The average CPC in your industry is $2.50. So, you can assume that it’ll cost you roughly $2.50 each time a user clicks your ad.And the benchmark conversion rate is 2%. This means you'll need approximately 5,000 clicks to generate 100 leads (100 / 0.02 = 5,000).So, your estimated monthly budget would be $12,500 for this campaign (5,000 x $2.50 = $12,500).Pro tipStart with a small budget for testing. This allows you to collect data, assess performance, and adjust your spending before going all in.5. Create High-Quality Content for Your Native AdsAd copy and design can make or break your campaigns. So, it’s crucial that your native ads are created to convey value and drive engagement.Follow these best practices: Match your content to your audience’s interests. Show/explain how your product or service can solve their pain points. Provide value—information, education, and/or entertainment—through your native ads. Your audience will likely be turned off by overt sales pitches. Choose an ad design that complements the platform for a seamless user experience Ensure your chosen platform follows the ethical practices of native advertising to maintain audience trust. For example, check if the publisher clearly marks native ads as “Sponsored” or “Promoted Content.”If you’ve opted to run search ads, study your competition for inspiration using our Advertising Research tool. Enter a competitor's website. And hit “Search.”Select the “Ad Copies” report from the top menu. Now, you’ll see your competitors’ ad copy. Including keywords they’re targeting. Like this:6. Monitor Your Native Ad Campaign’s PerformanceContinuously test and measure your native ad performance. So you can gain insights on what resonates with your audience and optimize accordingly. We recommend tracking these metrics (many platforms have built-in analytics dashboards to track these): Engagement: The number of user interactions with your ad (likes, comments, shares, video views, etc.) Impressions: The number of times your ad is displayed to users Click-through rate (CTR): The percentage of people who click on your ad after seeing it Cost per click (CPC): The amount you pay each time someone clicks on your ad Conversion rate: The percentage of users who take the desired action out of the total number of people who click on your ad. Like completing a purchase or signing up for a webinar. Cost per acquisition (CPA): The cost to acquire a new customer Return on ad spend (ROAS): The amount of revenue you earn for every dollar you spend on advertisingAnd consider adding UTM parameters (tracking codes) to your native ads’ URLs. To monitor the traffic and conversions from native ads in Google Analytics.Improve Your Engagement and ROI with Native AdsNative advertising isn’t about tricking your audience to click your ads. It’s about connecting with them authentically, fostering engagement, and building trust.And you can do just that with tools like One2Target, Advertising Research and Social Analytics.Get started with a free trial of Semrush.",
  "headers": [
    {
      "level": "H1",
      "text": "Native Ads: What They Are & How to Use Them"
    },
    {
      "level": "H2",
      "text": "What Are Native Ads?"
    },
    {
      "level": "H2",
      "text": "Native Ads vs. Display Ads"
    },
    {
      "level": "H3",
      "text": "Native Ads"
    },
    {
      "level": "H3",
      "text": "Display Ads"
    },
    {
      "level": "H2",
      "text": "Benefits of Native Advertising"
    },
    {
      "level": "H2",
      "text": "5 Popular Native Ad Types"
    },
    {
      "level": "H3",
      "text": "In-Feed/In-Content Native Ads"
    },
    {
      "level": "H3",
      "text": "Content Recommendation Ads"
    },
    {
      "level": "H3",
      "text": "Branded Content"
    },
    {
      "level": "H3",
      "text": "Paid Search Ads"
    },
    {
      "level": "H3",
      "text": "Promoted Listings"
    },
    {
      "level": "H2",
      "text": "How to Get Started with Native Advertising"
    },
    {
      "level": "H3",
      "text": "1. Define Your Native Ad Campaign Goals"
    },
    {
      "level": "H3",
      "text": "2. Know Your Target Audience"
    },
    {
      "level": "H3",
      "text": "3. Choose the Right Native Advertising Platform"
    },
    {
      "level": "H4",
      "text": "Content Recommendation Networks"
    },
    {
      "level": "H4",
      "text": "Social Media Platforms"
    },
    {
      "level": "H4",
      "text": "Search Engines"
    },
    {
      "level": "H4",
      "text": "Demand-Side Platforms (DSPs)"
    },
    {
      "level": "H3",
      "text": "4. Set a Budget for Your Ad Campaign"
    },
    {
      "level": "H3",
      "text": "5. Create High-Quality Content for Your Native Ads"
    },
    {
      "level": "H3",
      "text": "6. Monitor Your Native Ad Campaign’s Performance"
    },
    {
      "level": "H2",
      "text": "Improve Your Engagement and ROI with Native Ads"
    }
  ],
  "author": ""
}