{
  "url": "https://www.semrush.com/blog/new-authority-score-manipulation-resistant-metric/",
  "slug": "new-authority-score-manipulation-resistant-metric",
  "title": "New Authority Score: The Most Manipulation-Resistant Metric",
  "description": "A major update to our Authority Score metric makes it easier to accurately evaluate domain reputability. New improvements include factoring in organic traffic and common spam signals, a visualizer, and a Network Graph report that identifies PBNs and signs of natural/unnatural link profiles. Our solution, Semrush Authority Score, is the most trustworthy source of website authority. Try it for free today.",
  "content": "Today we made a major update to our Authority Score (AS) metric that makes it easier to accurately benchmark a site’s reputability.Let’s talk about it. The ChallengeYou need accurate metrics to find the best link building partnerships, and we want to help. After conducting more than 30 interviews with our users and industry experts, we concluded that unfortunately, there was no ideal solution for evaluating domain reputability. The main reason was that these scores could be manipulated to make sites appear to have more authority than they do in reality.You want to find sites with high authority, but you don’t want to fall for a site that inflated its “authority” with link schemes and shady manipulation tactics.That’s a waste of your time and money.What you need is something more reliable, accurate, and clear. The SolutionWe updated our solution, Semrush Authority Score, and can say it’s the most trustworthy source of website authority for sites that may have been involved in link manipulation. We say this because of how it's performing and the parameters we’ve added to the formula. Some improvements include: Factoring in organic traffic to better judge a site’s real value Factoring in spam signals to resist manipulation A visualizer in the tool that shows how we calculate the score A Network Graph report that makes it easier to spot Private Blog Networks (PBNs) and signs of natural/unnatural link profilesWe also ran a comparison study with other competing scores and tested how each score correlates with organic traffic and signs of spam. When we compared our new score to similar metrics from Moz and Ahrefs, we found Semrush to be the least susceptible to manipulation in those cases. If you want to dig deeply into the research, check it out here. Here’s what you’ll see when looking at a domain’s Authority Score in Backlink Analytics:We’re excited to share what we’ve changed and think you’ll be excited, too.What’s New?Previously, our Authority Score’s formula was based on two complex algorithms that used organic search data, traffic data, and backlink data to grade a website’s overall quality. While this system worked for a while, we believed it wasn’t clear enough to our customers. With this rebuild, we’ve made Authority Score easier to understand, more reliable, and more consistent.Today, the formula puts more direct emphasis on organic traffic and common signs of link spam. By weighing organic traffic and spam factors, we’ve given our score the strongest defense against manipulation possible.Now, Authority Score breaks down into three main elements. Link Power Organic Traffic Spam FactorsLink PowerLink Power refers to the number of backlinks a domain has, and the amount of backlinks those referring domains have. The more high-quality backlinks, the more authority. This is the foundation of our calculation and is similar to how Google PageRank evaluates sites. The difference is we’ve added more factors to strengthen our score from potential manipulation to make it more trustworthy. One strength of Semrush Backlink Analytics is our ability to pay attention to a domain’s category (or niche). You can see this visualized with the recently released Network Graph.In that report, you can see a domain’s full link network, not just one link deep, but the domains that link to its links, three tiers deep. When a domain links to another site in the same niche, it represents a more relevant connection than a link from an unrelated category. If your site’s Network Graph is highly reputable, meaning it has lots of niche relevant sites, you could see this reflected in your Authority Score label.Organic TrafficYou can’t fully understand a site’s SEO weight on backlinks alone. Some sites don’t have a lot of referring domains, but they still attract tons of organic visitors every day. One example might be a weather forecasting site that gets organic visits every day.Being one of the most-trafficked sites in their niche would make them an authoritative source, whether or not they have the most link power. We wanted to accurately depict the authoritativeness of sites like that with our Authority Score, so organic traffic is now a bigger part of the calculation.Organic traffic comes from our Domain Analytics data and tells us how much monthly organic traffic goes to a domain via Google search. The more organic traffic, the more authority.We consider organic traffic from Google in all languages to understand a site’s total reach.Spam Factors If we didn’t check for spam signals, Authority Score would be easier to manipulate with link spam. Using spam factors, we can find domains involved in link manipulation. Even trusted domains can be attacked by spam, so we don't weigh these too heavily that a single spam signal could tank an otherwise well-established site’s score.Breaking down and showing the Authority Score according to specific metrics such as organic traffic not only brings meaning to the score itself but serves as a better way to profile competitors at a glance.Mordy Oberstein, Head of SEO Branding at WixHow the Parameters Impact the ScoreA domain’s final Authority Score is calculated after reviewing each parameter (quality of backlink profile, a site’s organic traffic, and spam factors). However, some parameters carry more weight than others.These parameters are weighted in the following order: Link power Organic traffic No organic rankings on SERPs Unnaturally high % of dofollow domains An imbalance between links and organic traffic Too many referring domains with the same IP address Too many referring domains with the same IP network Presence of another domain with an identical backlink profile Link power is calculated by the amount of follow referring domains, along with the authority of those referring domains, that point to a website.Organic traffic comes from our Domain Analytics and is estimated based on a website’s total keyword positions and the click potential of every position.No organic rankings on SERPs means that the site has 0 keyword rankings within Google’s top 100 organic positions.Unnaturally high % of dofollow domains means that more than 90% of the website’s referring domains only send links without the “nofollow” attribute. This is an unusually high ratio, which is almost always the result of unethical and unnatural link-building to manipulate search engines.An imbalance between links and organic traffic can indicate a site with poor user experience that built an unnaturally large backlink profile, likely as an attempt to manipulate search engines. Too many referring domains with the same IP address or network is also a sign of a manipulated link profile. Private Blog Networks (PBNs) are networks of fake blogs created for the sole purpose of providing backlinks for SEO value. They can often be identified when it's clear that a group of related sites link to each other and are hosted on the IP address or subnet.Presence of another domain with an identical backlink profile means that we found at least one other domain with a backlink competition level of at least 95%. That metric can be found in our Backlink Overview report if you scroll down to the “Similar Profiles” widget. Competition level of 95% or higher would be a sign of unethical and unnatural link manipulation.Why We Changed ItOver the past 6 months, we spoke with our customers and experts in the field about what would make the perfect metric to measure website authority. We heard a repeated emphasis on organic traffic and spam being considered in addition to links. With the updated Authority Score factoring in organic traffic and spam, I can more effectively evaluate the impact of links coming from a site.Spam factors are especially relevant today, with Google releasing another update to their system that better detects search spam and removes the value of links that violate its guidelines.Jacob Clarke, Organic Growth at NerdWalletA goal of our update was to get closer to our understanding of Google’s current ranking system. We don’t know all of the factors, but we can see where it’s headed.Google’s Search Evaluator guidelines from 2022 show it really cares about content quality. An entire section details how evaluators determine experience, expertise, authoritativeness, and trustworthiness (E-E-A-T) for sites that can affect your money or your life (YMYL). Google also recently announced a link spam update to “neutralize the impact of unnatural links on search results.”In the past, it was easier to manipulate Authority Score with link schemes while ignoring the need for helpful content. Now, we know Google is putting more emphasis on content quality and expertise to determine reputability.So, we decided to update our score to keep up with Google’s current best practices regarding links and spam.How Can Authority Score Help You? To learn more ways to use this metric in your link building, read Authority Score Explained. How Does Semrush Compare With Other Domain Rating Scores?To hold a relevant and thorough comparison, we ran a comparison study looking at 24,000 domains of different sizes and checked each domain’s scores from Moz and Ahrefs in addition to our new Semrush data.The majority of these domains had similar scores in all three tools. However, there were clear cases when Ahrefs and Moz over or underestimated a domain’s reputability. We noticed these cases occurred when our competitors’ tools didn’t consider organic traffic and/or spam factors to give a fair estimation. As a result, they’d give unfairly high estimations to suspicious profiles or unfairly low estimations to sites with high organic traffic.After that, we built a correlation with spam factors and found out that Semrush’s AS correlates with common spam factors better than Ahrefs DR and Moz DA. It proves our hypothesis that Authority Score is the most resistant to authority manipulation among cases of sites involved with link spam.Find the rest of the data in our full Authority Score comparison study.ConclusionIt’s never been easy to evaluate domain reputability with pinpoint accuracy. But, as we factor in more metrics to improve our calculation, we get closer.Looking at our new score and the other options on the market, we believe Semrush Authority Score should be the first choice for SEOs that need trustworthy and clear data. I believe receiving Authority Score data from an in-depth analysis of organic traffic and spam factors is highly valuable, especially considering the quality-over-quantity approach I usually seek for digital PR campaigns and the campaign KPIs. It’s exciting as we can now provide additional insights and data while creating & presenting the link-building strategy and the logic behind it so that we can be on the same page with our partners or potential clients while deciding on our KPIs.Yagmur Simsek, SEO Strategist at Re:signalSee what you can do with Authority Score on tools like: Keyword Overview Link Building Tool Domain Overview Backlink Audit Backlink Gap Backlink Analytics Bulk Backlinks Analysis",
  "headers": [
    {
      "level": "H1",
      "text": "New Authority Score: The Most Manipulation-Resistant Metric"
    },
    {
      "level": "H2",
      "text": "The Challenge"
    },
    {
      "level": "H2",
      "text": "The Solution"
    },
    {
      "level": "H2",
      "text": "What’s New?"
    },
    {
      "level": "H3",
      "text": "Link Power"
    },
    {
      "level": "H3",
      "text": "Organic Traffic"
    },
    {
      "level": "H3",
      "text": "Spam Factors"
    },
    {
      "level": "H2",
      "text": "How the Parameters Impact the Score"
    },
    {
      "level": "H2",
      "text": "Why We Changed It"
    },
    {
      "level": "H2",
      "text": "How Can Authority Score Help You?"
    },
    {
      "level": "H2",
      "text": "How Does Semrush Compare With Other Domain Rating Scores?"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    }
  ],
  "author": ""
}