{
  "url": "https://www.semrush.com/blog/nofollow-links/",
  "slug": "nofollow-links",
  "title": "Nofollow Links vs. Follow Links: All You Need to Know",
  "description": "Nofollow links are a type of hyperlink that include the rel=“nofollow“ attribute. Learn more in this guide.",
  "content": "What Are Nofollow Links?Nofollow links are hyperlinks with the rel=\"nofollow\" attribute in their HTML code.The “nofollow” value tells Google not to crawl (scan to understand) the linked page to pass link equity (ranking strength) to it.A nofollow link might look like this in HTML code:<a href=\"https://example.com/\" rel=\"nofollow\">Click here</a>The presence of the rel=\"nofollow\" attribute confirms that the link is nofollow.What Are Dofollow Links?“Dofollow” links (also known as “follow” links) are the standard type of hyperlink on the web. These are links without any special attributes (such as nofollow, UGC, or sponsored) attached to them.In HTML code, a follow link looks like this:<a href=\"https://example.com/\">Click here</a>Here, the absence of any of the above “rel” attributes means it's a follow link.NoteTechnically, “follow” and “dofollow” terms don’t exist. We just use them for convenience to differentiate them from nofollow links.How Do Nofollow and Dofollow Links Differ?The main difference between nofollow and dofollow links is in how they influence search rankings of the linked page.Dofollow links can boost the search ranking of the page they link to. But nofollow links likely can’t.Let’s say we link to Apple’s website like this: <a href=\"https://apple.com/\">Apple</a>That becomes a dofollow link that can influence Apple’s search engine rankings.But we can also link to it like this:<a href=\"https://apple.com/\" rel=\"nofollow\">Apple</a>The nofollow attribute generally won’t pass ranking power to Apple's site.Does that mean nofollow links are completely useless?Not exactly.Why Are Nofollow Links Important?Here are a three reasons why receiving nofollow links is beneficial:Referral TrafficIf you have nofollow backlinks (links from other websites pointing to your own) from popular websites, they can drive referral traffic to your site.In fact, some sites such as Forbes only use nofollow attributes for external links (links that point to other websites). Like in this author byline:But it’s still good to get a backlink from them because they have a large audience. And that audience can click those links to land on your website. ExposureGetting mentioned on popular websites is great for brand awareness. And that can naturally lead to more follow backlinks from other sites. For example, if a popular blogger links to your site but uses the nofollow attribute, it still raises awareness of your brand among their audience.Multiple readers may then go on to organically link to your site. And those could easily be follow links that can pass link equity.Backlink Profile Diversity Search engines value a natural and diverse backlink profile. This includes a mix of both nofollow and follow links. A website with only follow links may appear unnatural or manipulative to search engines, potentially triggering red flags. By having a healthy balance of nofollow links, your site demonstrates a more organic growth pattern.That’s why nofollow links are also important for SEO.How to Check If a Link Is NofollowTo see whether a specific link has a nofollow attribute, check the page source code. Hover over the link, right-click it, and choose “Inspect.” (This item can have different names in different browsers.)If you see the word “nofollow” within the “rel” attribute, it means the link is nofollow. If you want to see the split between follow and nofollow backlinks to your site (or a competitor’s site), try Semrush’s Backlink Analytics tool.Just enter the domain you want to evaluate and click “Analyze.”Then, go to the “Backlinks” tab.Here, in the “Link Attributes” section, you’ll get a detailed breakdown of the attributes of the links pointing to the analyzed domain. Plus, you can use filters to see specific backlinks with a certain attribute. For example, if you want to see only active (meaning ones that are currently live) “sponsored” backlinks for a domain, you’ll select the “Active” and “Sponsored” tabs.(“Sponsored” is another “rel” attribute that’s used to indicate links that are purchased in any way. Like if you sponsored an article on a blog that linked back to you. Google treats these links the same as nofollow—which means they don’t transfer link equity.)The tool will list all the backlinks that meet these criteria. This can be useful if you want to inspect the paid digital PR activities of your competitors. NoteFrom here on, we’ll use the general term nofollow links to refer to links all that don’t pass link equity. This includes rel=\"nofollow,\" rel=\"sponsored,\" and rel=\"ugc.\"When to Use Nofollow LinksHere are the most common use cases for nofollow links: Linking to a page you don’t want to endorse. If you don’t want to be associated with the linked page (e.g., you need to link to a gambling website but don’t want to indicate you encourage gambling), use rel=\"nofollow.\" Including sponsored/paid links. If the link is sponsored or purchased in any way, use rel=\"sponsored.\" This applies both to links pointing to other sites from your site and links pointing to your site. So, make sure others linking to you with a paid link are doing so correctly. Using affiliate links. Similarly, for affiliate links pointing to or from your website, use rel=\"sponsored.\" Incorporating user-generated content. For links created by users on your website (such as links in comments or forum discussions), use rel=\"ugc.\" Otherwise, people will spam your site with links in an attempt to improve their search rankings.When to Avoid Using Nofollow LinksIn the past, the nofollow attribute was often used outside of its primary purpose to influence how link equity passes from your page. For example, if you wanted to pass more link equity to your own pages through internal links, you would use the nofollow attribute for all the external links.This technique (called PageRank sculpting) doesn’t work anymore. Because Google changed the way it uses nofollow links for PageRank. But some still think of the nofollow attribute in this way—and some bad practices prevail. With all that in mind, here are two common examples of how not to use nofollow: Nofollow for all external links. You shouldn’t use the nofollow attribute for all links pointing out from your site. It doesn’t help your website (and may even hurt it). Nofollow for internal links. You shouldn’t use the “nofollow” attribute for internal links. If you don’t want a certain page to be crawled or indexed, there are better ways to indicate that, such as by using robots meta tags.If you’re unsure whether you’re using nofollow correctly on your site, Semrush’s Site Audit tool can help.Create a free account (no credit card needed) and set up your first crawl. (If you’re not sure how, follow this step-by-step setup guide.)Once the audit is complete, head to the “Internal Linking” thematic report by clicking “View details.” On the right side, you’ll see a list of all the possible issues related to internal linking.In the “Warnings” section, look for “Nofollow attributes in outgoing internal links.” If the tool has detected issues, you can click the link with the number of issues.This will guide you to a complete list of pages where nofollow internal links were detected.Go through the list and remove the nofollow attributes. Secondly, review all your external links with the nofollow attribute. Just look for the “Nofollow attributes in outgoing external links” issue in the “Notices” section.Again, go through the links and reconsider your use of nofollow attributes. And make sure they’re all truly necessary. Next StepsNow that you know the basics of nofollow and follow links, you may want to dive deeper into how links impact SEO and how to get the best backlinks for your website.Here are some useful resources: What Are Backlinks? Link Building for SEO Backlink Management (free video course) Internal LinkingIf you want to start building links right away, make sure to try our Link Building Tool. With a free account, you can start your first link building campaign.",
  "headers": [
    {
      "level": "H1",
      "text": "Nofollow Links vs. Follow Links: All You Need to Know"
    },
    {
      "level": "H2",
      "text": "What Are Nofollow Links?"
    },
    {
      "level": "H3",
      "text": "What Are Dofollow Links?"
    },
    {
      "level": "H2",
      "text": "How Do Nofollow and Dofollow Links Differ?"
    },
    {
      "level": "H2",
      "text": "Why Are Nofollow Links Important?"
    },
    {
      "level": "H3",
      "text": "Referral Traffic"
    },
    {
      "level": "H3",
      "text": "Exposure"
    },
    {
      "level": "H3",
      "text": "Backlink Profile Diversity"
    },
    {
      "level": "H2",
      "text": "How to Check If a Link Is Nofollow"
    },
    {
      "level": "H2",
      "text": "When to Use Nofollow Links"
    },
    {
      "level": "H2",
      "text": "When to Avoid Using Nofollow Links"
    },
    {
      "level": "H2",
      "text": "Next Steps"
    }
  ],
  "author": ""
}