{
  "url": "https://www.semrush.com/blog/on-page-seo/",
  "slug": "on-page-seo",
  "title": "On-Page SEO: How to Optimize a Page and Drive Traffic",
  "description": "This is a guide to on-page SEO. Learn exactly how to optimize your titles, descriptions, and content in 2024.",
  "content": "What Is On-Page SEO?On-page SEO (also called on-site SEO) is the process of optimizing webpages and their content for both search engines and users. It can help rank pages higher on Google and drive more organic traffic. Common tasks associated with on-page SEO include optimizing for search intent, title tags, internal links, and URLs.Below, we’ll cover different techniques for optimizing your site for on-page concerns.But first, let’s explore the difference between on-page SEO and off-page SEO:On-Page SEO vs. Off-Page SEOOn-page SEO covers anything you can do on a webpage (or internally) to improve your rankings. Off-page SEO covers anything you can optimize outside of your site (or externally) in an attempt to boost your rankings. Backlinks are arguably the biggest off-page SEO factor. Other examples include social media and PR.Both are important components of any good SEO strategy.But you have more control over on-page SEO factors. So focusing on those is a good place to start.Why Is On-Page SEO Important?Search engines use keywords and other on-page SEO elements to check whether a page matches a user’s search intent. And if the page is relevant and useful, Google serves it to the user.In other words:Google pays attention to on-page SEO signals when ranking pages.The Google algorithm is always changing, but Google continues to prioritize user experience. Google recommends focusing on “people-first content.” Meaning creating valuable content that matches user intent is more important than ever.Now, let’s take a look at how you can update your content to reflect on-page SEO best practices.Pro tipTo quickly get actionable on-page SEO optimization ideas for your site, run it through On Page SEO Checker.9 On-Page SEO Techniques for Your WebsiteHere are some key on-page optimization techniques you should consider: Write unique, helpful content Place target keywords strategically Write keyword-rich title tags Write click-worthy meta descriptions Use headings and subheadings to structure your page Optimize URLs Add internal links Add external links Include and optimize images Let’s look at these in more detail.TipCreate a free Semrush account (no credit card needed) to follow along with the techniques in this guide. 1. Write Unique, Helpful Content One of the most important on site SEO steps you should take is to create high-quality content that matches your readers’ search intent.Start by performing keyword research to find relevant topics and target keywords.For this example, we’ll use the Keyword Magic Tool.Enter the topic you want to research and click “Search.” We’ll use the keyword “audio book” as our example. You’ll get a list of keywords related to your seed keyword, sorted by search volume.High search volume can be useful to target. But pay attention to the keyword difficulty (KD %) level, too. It’s much more difficult to rank for more competitive keywords (which have higher KD % scores).Target less competitive long-tail keywords, too. They often have lower search volume but lower keyword difficulty. Which means they can be easier to rank for.The Keyword Magic Tool automatically sorts related keywords into relevant categories.They’re located in the left-hand sidebar. You can narrow your research by selecting one.Here:Once you’ve selected your keywords, it’s time to create your content.Read our guide to formatting a blog post when you’re ready to get started.In the meantime, here are a few best practices to create optimized, high-quality content: Incorporate keywords naturally into your content (and avoid keyword stuffing) Make sure your content matches the search intent of your target keyword Fully answer the query—your content should be useful to users Write unique content that offers something competitors don’t Include visual content (more on that later)Further reading: What Is Quality Content & How to Create It2. Place Target Keywords StrategicallySo you have your target keywords. Now it’s time to strategically place them in your content. Google scans your content to see what a page is about—and readers will likely do the same.So you should include your target keywords in these key areas: H1 First paragraph Subheaders (H2s, H3s, etc.)This will help Google gain context about the topic of your page. And users will be able to quickly tell whether the page matches their search intent.You can begin analyzing your content with On Page SEO Checker. Start by configuring the tool for your site.Once you complete the setup, you’ll see a page that looks like this:You can click on a specific page from the recommended “TOP pages to optimize” list, or review the “Optimization Ideas” tab for a complete overview.Click on the “# ideas” blue button to see recommendations.The content section will let you know whether you’ve used your target keywords in key places like the H1 and body of the of the page (and whether keyword stuffing is detected):If the tool does detect issues, it will provide recommendations.Like this:It also provides helpful information about related keywords you can add to your text to further optimize it.3. Write Keyword-Rich Title TagsTitle tags are pieces of HTML code that indicate what the title of a page is. And display that title in search engines, social media posts, and browser tabs.Additionally,they can influence whether a user decides to click on your page.They can look like this on the SERP (search engine results page):Here are a few tips to follow when writing your title tags: Keep it brief. We recommend keeping title tags between 50 and 60 characters so Google doesn’t cut them off Include your target keyword. This helps both Google and users determine what your page is about. Be unique. Avoid duplicate title tags so that each individual page’s purpose is clear to Google (and users know what they’re clicking on).On Page SEO Checker will also provide tips to help you write better title tags. Plus information about what, how, and why to do it. Further reading: What Is a Title Tag & How to Optimize Title Tags for Google4. Write Click-Worthy Meta DescriptionsA meta description tag is an HTML element on a site that provides a brief summary of the page. And search engines like Google may use it to generate a snippet (the descriptive text part of a search result). It usually shows up on the SERP below your page’s title. Like this:Meta descriptions don’t directly influence Google rankings. But, like title tags, they can be a deciding factor between a user clicking on your page or another one. Which means they can encourage more search traffic.And if your meta description doesn’t match the user’s search intent (or the content on the page), Google may choose its own description for the SERP. So it’s best to follow these best practices to increase your chances of Google using your chosen meta description: Consider mobile devices. Google truncates meta descriptions after about 120 characters on mobile. So it’s best to keep them on the shorter side. Include your target keyword. This helps users determine if their page matches their search intent. Google also bolds keywords (and synonyms of keywords) that match the user’s search query. Which stands out visually and could boost clicks. Use active voice. Active voice saves space and communicates your message more clearly. Add a CTA(call to action). Entice users to click with CTA phrases (like “try for free,” or “find out more”).You can also find tips for writing better meta descriptions in On Page SEO Checker.Further reading: What Is a Meta Description? [+ SEO & Writing Tips]5. Use Headings and Subheadings to Structure Your PageH1 tags and subsequent headings allow users to easily skim your page. And help Google understand the hierarchy of your page.Look at the following image. And see how difficult it is to read a page without organized headings (compared to one that has them).The right is an example of on-page SEO done right. It’s easy to skim and find specific information.Headings also help Google better understand your page’s structure and determine whether your page matches a user’s search intent. Which can help you rank higher for relevant keywords.You can use keywords and keyword variations in headings to give Google more context about the structure of your page and what information you cover.Use the H1 as your page title or headline. And include H2s to cover subtopics. If you need to cover content in further detail, use H3s, H4s, etc.On Page SEO Checker will also provide ideas to help you optimize your headings.6. Optimize URLsGoogle recommends using simple URLS that don’t look “cryptic” or intimidating. In other words:Use words that are relevant to your content so users can tell what your page is about.And not random numbers, publish dates, or full sentences. Website themes will often use these by default, so it’s important to update your URL before publishing.Using your target keyword in your URL is a good way to ensure your URL matches the topic of your content.An “unfriendly” URL might look something like this:And this is how you could update it to be more useful and easy to understand:The more context Google has about a particular page, the better it can understand it. And if Google understands what a page is about, it’s able to match it with relevant search queries.Further reading: What Is a URL? Meaning, Structure, and Optimization Tips7. Strategically Add Internal LinksInternal links are hyperlinks that point to different pages on the same site. Here’s what an internal link looks like on a webpage:Internal links are an important part of on-page SEO optimization. Here’s why: They help search engines understand your site’s structure and how pages are related to each other They allow Google crawlers to discover and navigate to new pages They signal to Google that the linked-to page is valuable They help users navigate through your website (and keep them on your site longer)Further reading: Internal Links: Ultimate Guide + Strategies8. Add External Links to Authoritative SourcesExternal links are links on your site that point to other sites. They’re important because they enhance user experience and build trust with your audience.Google has said that adding links to authoritative external sources is a great way to provide value to your users. And providing solid user experience is always a good thing.Here are a few best practices for you to follow: Only link to authoritative and trustworthy sites related to the topic and niche Use descriptive and natural anchor text to show readers what to expect when they click Balance the number and placement of external links to avoid looking spammyYou can quickly check your site for external link issues with Site Audit. Just head to the “Issues” tab and type “external” in the search bar.Further reading: What Is an External Link? + SEO Best Practices9. Include and Optimize Images Including images in your content increases your chances of ranking in Google Images. This is a great way to get more traffic to your site.A good place to start optimizing your images is by writing descriptive alt text for them.Alt text (short for alternative text) is text included in HTML code that describes an image on a webpage.It has two main purposes: It provides context for search engine crawlers It allows people using screen readers to hear descriptions of imagesHere’s an example:Here are some tips for writing good alt text: Keep it brief. Screen readers stop reading alt text after about 125 characters. Include a target keyword. Include your target keyword for context (but don’t spam keywords for the sake of it). Don’t add alt text to decorative images. Graphics like horizontal page breaks, a magnifying glass in a search bar, etc., don’t require further explanation. Don’t include “image of” or “picture of.” Alt text implies that it’s describing an image, so there’s no need to waste characters on these phrases.To find missing image alt text on your site, head to the “Issues” report in Site Audit. And search for “alt attributes” in the search bar if you have multiple errors to comb through.Aside from adding optimized alt text, here are a few of ways to optimize images: Write descriptive file names to help search engines understand what your image is about Use free tools like ImageOptim to compress images for faster load times Use lazy loading, which tells web browsers to wait to load images until the user scrolls to themFurther reading: Image SEO and Alt Tags: 10 Image Optimization TipsAdvanced On-Page SEO TacticsOnce you’ve got the on site SEO basics down, you can try out some more advanced SEO page optimization techniques. Let’s start with an important on-page SEO factor—page speed.Optimize for Page SpeedWe may never know every Google ranking factor. But we do know that page speed is a confirmed ranking factor.So it’s more important than ever to optimize for page speed.You can use Google’s free PageSpeed Insights tool to get an overall performance score for both mobile and desktop, in addition to actionable suggestions for improvement.This tool assesses Google’s Core Web Vitals, which are factors that impact page experience. The Core Web Vitals are: Largest Contentful Paint (LCP): amount of time it takes for the main piece of content to load First Input Delay (FID): amount of time it takes for your website to respond to the first interaction from a user (like a click on a link) Cumulative Layout Shift (CLS): amount your webpage shifts (or “moves down”) as more content (e.g., banners, images) loadsTo get started, enter your URL and click the “Analyze” button:Here’s what the report looks like:And here’s the full list of errors that might slow your site down:There’s also an “Opportunities” report that gives suggestions for improvement:For more in-depth information on technical errors, you can use Site Audit.Find “Core Web Vitals” under “Thematic Reports.” Click “View details.”You’ll see the overall status of your SEO pages’ performance over time. In this report, you’ll also see technical details like we talked about earlier. Such as LCP and CLS. The Core Web Vitals report includes Total Blocking Time (TBT) to closely estimate FID.Under each column, you’ll find top recommended improvements and the pages affected.Click on each underlined suggestion to read more about the issue and how to fix it.Run this report at least once a month to keep up with any errors. You can also send automated reports to yourself or clients in the “My Reports” management tab in Semrush.Target Featured SnippetsBecause featured snippets appear in “position zero” above other organic results, they can help boost your click-through rate (CTR).There are different forms of featured snippets, including: Definitions Tables Lists VideosTo check if a keyword has a current featured snippet, go to Keyword Overview. We’ll use the example “can dogs eat watermelon.”Enter your keyword and click “Search.” You’ll see information about search volume, keyword difficulty, and more.Scroll down to the “SERP Analysis” section of the page. To the right of this graph, you’ll see a link that says “View SERP.” Click it to view what the SERP looks like for that keyword when it’s not influenced by location, user behavior, etc.Now we can see that “can dogs eat watermelon” does indeed have a featured snippet. And which pages are ranking underneath that.If you want to take the top spot, update (or create) your own page following on-page SEO best practices.Some ways to target a featured snippet include: Answering the query in a concise, user-friendly way Understanding (and catering directly to) the user’s search intent Formatting the answer accordingly—could be a quick one- or two-sentence answer, a table, a video, etc.Add Schema MarkupSchema markup allows search engines to better understand information on your website. It adds code to a page that better communicates the page topic. So you can convey to search engines that your page is about an event, contains a recipe, etc. And the SERP result can reflect that.Using schema can provide rich snippets in the SERP. They look like this:In addition to taking up more valuable space on the SERP, schema markup also can improve your page’s organic CTR.The above example uses recipe schema markup. But you can add many different types to your pages. Common types of schema include: Reviews Products Events People Local businessesAnd more.You can find information on every type at Schema.org.Let’s look at an example of schema markup in action. Say you type “new york events near me” into Google.The top of the SERP looks something like this:To better your chances of showing up above the normal search results like this, you can use “Event” schema markup.Which communicates the event date, address, and location to Google.Google may then feature these events above other results because they’re more useful.Here’s Google’s resource on adding Event structured data. And here’s what the Event schema might look like in your page’s code:You can use Site Audit to check if you’ve implemented structured data correctly.You’ll see a report labeled “Markup” under “Thematic Reports.”Click the “View details” button.Site Audit will score any pages that have schema markup, break down pages by schema type, and alert you of any existing issues.If Site Audit does flag any issues with your markup, we recommend running those individual pages through Schema.org’s markup validator. It’ll let you know if you’ve implemented the markup properly.Further reading: What Is Schema Markup & How to Implement Structured DataImplement Proven On-Page SEO TechniquesNow that you know what on-page SEO is, it’s time for you to take action. Execute on the techniques mentioned earlier, and you’ll be on your way to better rankings and traffic. Start by signing up for a free Semrush account (no credit card needed). You’ll get access to On Page SEO Checker. But you’ll also be able to: Do keyword research Analyze your competitors Track your keyword rankings Run a site auditAnd more.",
  "headers": [
    {
      "level": "H1",
      "text": "On-Page SEO: What It Is and How to Do It"
    },
    {
      "level": "H2",
      "text": "What Is On-Page SEO?"
    },
    {
      "level": "H3",
      "text": "On-Page SEO vs. Off-Page SEO"
    },
    {
      "level": "H2",
      "text": "Why Is On-Page SEO Important?"
    },
    {
      "level": "H2",
      "text": "9 On-Page SEO Techniques for Your Website"
    },
    {
      "level": "H3",
      "text": "1. Write Unique, Helpful Content"
    },
    {
      "level": "H3",
      "text": "2. Place Target Keywords Strategically"
    },
    {
      "level": "H3",
      "text": "3. Write Keyword-Rich Title Tags"
    },
    {
      "level": "H3",
      "text": "4. Write Click-Worthy Meta Descriptions"
    },
    {
      "level": "H3",
      "text": "5. Use Headings and Subheadings to Structure Your Page"
    },
    {
      "level": "H3",
      "text": "6. Optimize URLs"
    },
    {
      "level": "H3",
      "text": "7. Strategically Add Internal Links"
    },
    {
      "level": "H3",
      "text": "8. Add External Links to Authoritative Sources"
    },
    {
      "level": "H3",
      "text": "9. Include and Optimize Images"
    },
    {
      "level": "H2",
      "text": "Advanced On-Page SEO Tactics"
    },
    {
      "level": "H3",
      "text": "Optimize for Page Speed"
    },
    {
      "level": "H3",
      "text": "Target Featured Snippets"
    },
    {
      "level": "H3",
      "text": "Add Schema Markup"
    },
    {
      "level": "H2",
      "text": "Implement Proven On-Page SEO Techniques"
    }
  ],
  "author": ""
}