{
  "url": "https://www.semrush.com/blog/online-reputation-management/",
  "slug": "online-reputation-management",
  "title": "A Beginner’s Guide to Online Reputation Management",
  "description": "Online reputation management (ORM) is the process of creating a positive online presence for your brand.",
  "content": "Every business is at risk of receiving negative attention online.In this guide, we’ll explain how online reputation management (ORM) can help you deal with—or prepare for—negative attention. And equip you with the tactics you need to come out on top.What Is Online Reputation Management?Online reputation management is the process of monitoring and influencing how your business is perceived on the internet, with the aim of neutralizing negative sentiments and promoting positive ones.It typically involves responding to bad reviews, suppressing unfavorable search results, and correcting misinformation about your business.ORM overlaps with digital public relations (digital PR), but the emphasis is on defending your reputation. Rather than proactively building a good brand image.Side noteOnline reputation management is also known as digital reputation management or internet reputation management.Why Reputation Management Is Important for Your BusinessOnline reputation management is important because it helps ensure consumers view your business more favorably. And are therefore more likely to engage with you.Almost 60% of U.S. consumers said they would avoid buying from a brand that comes across as untrustworthy.Here are a few other reasons reputation management is crucial for your business: It impacts buying decisions. 59% of shoppers said they perform online research before making a purchase. And 97% of consumers consult product reviews before buying. So, you could lose customers based on how your brand appears online. It helps you deal with negative reviews. Negative reviews are inevitable—but staying on top of your online presence can help you turn those reviews around. Customers whose complaints on social media got handled in under five minutes tended to spend more on future purchases. It provides valuable feedback. If you get the same complaint multiple times, there’s probably an underlying issue to fix. Start collecting useful insights on your products, services, or overall customer experience by reading reviews.TipIf you have a Google Business Profile, check your review stats for free with the Review Management tool. You can also see which listing sites you’re missing out on.ORM Failure ExamplesLet’s review real-life examples of ORM failures so you can see how much they impact real businesses.United AirlinesUnited Airlines lost over $1 billion in market value after a video of a passenger being dragged off an overbooked flight went viral.The video amassed over 1 million online mentions in one day and over 100 million views. Many viewers criticized the CEO’s lack of action in a crisis of public perception.This crisis happened in 2017 but is still routinely brought up in ORM conversations today.NestléNestlé also faced a notorious brand reputation management failure when Greenpeace accused them of harmful environmental practices online.Rather than addressing the issue head-on, Nestlé reportedly asked YouTube to remove Greenpeace’s video.The company had to temporarily shut down its public page due to negative comments that included an altered version of the KitKat logo reading “Killer.”It only takes one negative story to create an online reputation nightmare. Which is why it’s best to proactively manage your brand image and have a plan in case of a crisis.TipUse the Brand Monitoring app to find out when your brand’s being talked about. You can even set up email alerts for mentions with negative sentiment.Online Reputation Management Media ChannelsTo manage your online reputation effectively, you need to monitor and act across multiple channels (platforms that allow you to engage with audiences).Let’s explore the four main types:Paid MediaPaid media is any form of online content that requires payment to feature your brand. This includes Google ads, social media ads, PPC ads, sponsored posts, and promotions by influencers.This channel allows you to earn exposure in highly relevant locations (e.g., on your audience’s favorite sites) and gives you full control over the messaging.For example, some people have accused Airbnb of harming local economics. Banner ads like this are meant to help them counter the criticism:The downside of paid media is that it can be expensive. And audiences tend to be more skeptical of brand-controlled messaging.TipSemrush has a variety of advertising tools and apps that help you manage campaigns effectively.Earned MediaEarned media is coverage your brand receives from third-party platforms (without payment). Audiences tend to see this as authentic and trustworthy.Examples include: Press coverage Blog posts on other websites Forum discussions Reviews on external sites (e.g., Trustpilot or Google)For example, here’s an article about Airbnb on The New York Times website:Organic coverage (i.e., coverage earned without your intervention) can have positive or negative sentiment.But there are a few techniques you can use to secure positive exposure.For example, you can ask customers to leave reviews on external sites. Or send interesting press releases to journalists in your niche.TipProwly helps you find journalists in your niche and send effective outreach emails.Shared MediaShared media is any content about your brand posted on social media platforms. Whether that content is from your brand’s account or someone else’s.Unaddressed complaints, negative comments, and low ratings on shared media channels can seriously harm your company’s online reputation and turn off potential customers.So, you should pay attention to what’s happening on your social media accounts the same way you would pay attention to customer comments inside a brick-and-mortar establishment.Semrush’s Social Inbox can help.The tool collects comments, private messages, and mentions from all your linked accounts. And lets you tag, assign, or reply to them.So, you can manage everything in one place.Owned MediaOwned media is any media you control, like your website or email newsletter.To portray your desired brand identity, you need to define elements including: Tone of voice Design guidelines Value proposition Target audienceThen, you can use various techniques to increase the reach of owned media. For example, you can use SEO to improve your website’s visibility in search engines. And build your email marketing list.This gets your preferred messaging out there and helps override any negative commentary.How to Do Online Reputation ManagementTo avoid PR crises and the effects of bad reviews, you need to manage your brand’s online reputation properly.Here’s how to do online reputation management in nine steps:1. Audit Your Online ReputationBefore putting any ORM process in place, conduct an extensive online reputation audit.The goal is to find out how your customers view and talk about your brand online. Doing so will give you an idea of what’s going well and what challenges you may need to overcome to make important changes.You can do that by looking at Google results: Open an incognito browser window Search your brand name in Google Review your Google Business Profile, if you have one (ratings, reviews, comments, images, etc.) Take note of what results appear on page one Make note of which sites you can control (like social profiles) and which you can’t (like third-party sites)—this will help you strategize laterFor example:Search for your brand on the following site types, too: Social media platforms Online communities (e.g., Reddit) Review sites (e.g., Trustpilot)Once you’ve gathered sufficient information, you should have an idea of what the average consumer sees when they look up your brand.2. Establish an Online Reputation Management StrategyNow that you know your brand’s current standing, it’s time to set up an online reputation management strategy. First, decide what you want to prioritize.Prioritize Tactics and TasksPrioritizing which ORM tactics to implement and which mentions to respond to first will help you manage your online reputation better.You can use the Impact Matrix to decide how to prioritize your tasks: Quick wins are easy to accomplish and have a high business impact Big bets take more effort to accomplish but have a high business impact Fill-ins are simple but have a low business impact Thankless tasks take a lot of effort but have a low business impactAn example of a “quick win” might be responding to a negative review. It won’t take a lot of time. But a well-crafted response can positively impact your online presence.That being said, you should respond to critical tasks first. If you have an ORM crisis on your hands, address that first.​​Once you have your prioritization goals in place, develop clear documentation to keep things organized.Establish GuidelinesDevelop policy guidelines, communication guidelines, and a defined tone of voice to stay consistent in your messaging to customers.Managing comments, reviews, and mentions from several channels can be overwhelming if you don’t set ground rules. Policy Documentation Writing down policy guidelines can help you prioritize tasks and streamline communication, especially when multiple people are working on online brand reputation management.To start, here are a few things you can include in your documentation: Who’s in charge of what channel. If it’s everyone’s responsibility, it’s no one’s responsibility. Clearly define who’s in charge of which channel and try to stick to it. If multiple people work on the same channels, clearly define their responsibilities so nothing slips through the cracks. Response templates. Come up with response templates for frequently asked questions. This will save time and help your brand sound more unified. Who’s who in your field. Do you have any influencer partners everyone on the team should know about? Any particular trolls you no longer respond to because it would only escalate the situation? Keep this information in your policy documents.Communication GuidelinesCommunication guidelines help you prioritize day-to-day reputation management tasks and decide what issues to respond to first.Depending on the size of your following, you may get many mentions and reviews at once. So you’ll need to decide what is urgent versus what can wait. Urgent: Could this review be detrimental to your brand? Check the profile of the person who wrote the review. If they are popular in your space, the negative review may have a higher chance of going viral. In this case, the situation may be urgent. Non-urgent: Could this situation be resolved easily? Is it a typical question or concern you can easily fix? It probably doesn’t warrant an urgent response. But be sure to come up with an acceptable time frame for addressing non-urgent communications. You don’t want to leave your customers hanging.What you consider urgent will depend on your goals and audience. For example, if your audience primarily hangs out on TikTok, you should respond to negative comments there before negative comments on Facebook.Tone of VoiceEstablish a tone of voice and share the guidelines with anyone in your company who communicates with customers or creates content.Here are a few things to keep in mind when building your brand’s tone of voice: Who is your target audience, and how do they communicate with each other? Is your brand formal or casual—or somewhere in between? Does your brand communicate with slang and emojis? Are there any words or phrases your brand should never use? What’s your brand’s mission, and how does it affect communication?You can use our tone of voice template to define how you want your brand to sound.A good way to start is to choose adjectives that describe your brand (e.g., “cheerful,” “trustworthy,” “authoritative,” etc.). Like this:Just remember that tone shifts may be necessary in online reputation marketing.For example, Ben & Jerry’s usually has a lighthearted and playful tone of voice.But the brand adopts a more serious tone when talking about its social values.3. Monitor Brand MentionsYou need to know what people say about your brand—and quickly. The longer it takes for you to respond, the more negativity can spread and the more problems can escalate.You can set up Google Alerts for your brand name and any misspellings. To receive an email when new results show up in Google Search.However, this won’t catch everything. And it can take some time for results to show up.That’s why we recommend using the Brand Monitoring app for online reputation monitoring.This tool automatically collects mentions from dozens of platforms. Including news sites, blogs, and discussion groups.This saves you time and gives you a more accurate picture of how people talk about, share, and interact with your brand on the web.After signing up, create a “Brand” query. Then, enter your brand name and other settings.Once you’re happy with your settings and preview, click “Create query.”You’ll get a detailed report that contains your most recent mentions. Use the filters to focus on specific types (e.g., those with negative sentiment).In the “Analytics” tab, you can track mentions and sentiment over time. And gather lots of other useful data.Use the information from the tool to assess the state of your online reputation. And whether intervention is required.4. Plan Your Crisis Management StrategyCrises happen without warning. The good news? You can prepare for them with a crisis management strategy.Your strategy should outline an internal communication plan, which team members will handle public responses, and how to address social media mentions.Here are a few things you can do to prepare in advance: Use media monitoring tools. Tools like Brand Monitoring will quickly alert you if there are any unexpected conversations happening about your brand. Keep an eye on industry trends. Legislation changes, cultural changes, or technological advancements may put stress on your business, depending on your industry. Know which channels your audience prefers and how to communicate most efficiently. If your audience gravitates toward Facebook, use Facebook as your primary communication channel. This way, you will reach a wider audience more efficiently. Know who’s in charge of responding to comments and reviews. You may choose to have one or two people publicly communicate during a time of crisis, depending on the severity of the situation. Draft responses to react quickly to negative comments. Just be sure that no one copies and pastes the same response without personalizing it. This can look insensitive in a time of crisis.While it’s best to avoid a crisis, sometimes things are out of your control. The way you respond could make or break what your audience thinks about your brand overall.5. Encourage Customer Reviews OnlineEncourage customers to leave truthful reviews on Google and other review websites.This helps potential customers to discover your brand. And, assuming the reviews are mostly positive, encourages more people to choose your business.Users might even see your ratings when searching Google.How to Get Your Customers to Leave a ReviewNot all customers will leave reviews, but you can do a few things to make the review process easier (meaning a review is more likely): Share links to leave reviews in thank-you emails or at the end of chat interactions on your site Include clear instructions on how to leave a review (with applicable links) Offer incentives like discounts to customers who leave reviews Respond to all your reviews (negative and positive) so customers can see that their opinion matters Encourage customers to contact you directly if they have a bad experience to discourage them from leaving bad reviewsFor example, Passion Planner, an ecommerce brand, asks customers for a review via email after every purchase. And incentivizes reviews with a discount code.Their approach is effective because customers can review products right within that email. It’s simple and customers get a reward for doing it.Positive reviews can be a huge advantage for your business, so encourage happy customers to leave a good review without much effort on their part.6. Manage Negative Online ReviewsA whopping 94% of customers admit that a negative online review can prevent them from choosing a particular business.You can attempt to neutralize a negative review by writing a thoughtful response.For example, this restaurant owner expressed disappointment at letting their customer down. And offered to make it up to them:To ensure you can respond quickly, claim your business on relevant review platforms. And sign up for alerts about new reviews, where possible.If you’re a local business, you can use Semrush’s Review Management tool to monitor reviews across multiple platforms.It also provides review analytics, so you can compare your metrics against competitors’.How to Respond to Negative ReviewsIt’s best to respond to negative reviews quickly before they spiral out of control. Here are some general guidelines for navigating negative reviews: Improve your response time. The earlier you resolve an issue, the less likely it is to spiral out of control. Show courtesy. Thank the reviewer for their feedback and be polite as you address their concerns. Acknowledge mistakes. If your business is at fault, it’s often a good idea to acknowledge the mistake. But keep in mind that apologizing could result in legal action in some cases. Use phrases like “We understand your frustration” or “How can we make this better?” Try to keep things public. Keep conversations around negative reviews public when possible. This shows other customers that you’re responsive and approachable. (But respond privately if there’s sensitive customer information involved.) Offer a refund or discount. This should be a last resort to appease the customer. However, this might be the right approach if your product or service is the root of the problem. Reach out to third-party authors. If someone writes a negative review or blog post about you, you can ask them to make changes. So long as you have compelling proof about improvements you’ve made or inaccuracies in the review or post. Make improvements to your service/product. If you see the same complaint many times, consider making changes or updates to your product. Keep customers posted on how you’re resolving the issue.TipIf you receive a fake review, report it to the review platform and request that it’s removed.How to Push Negative Reviews Down in Search RankingsYou can attempt to suppress negative reviews so that they’re less visible on review platforms and Google’s search engine results pages (SERPs).Here are a few ways to drown out bad reviews: Get lots of positive reviews by asking happy customers to rate you Promote positive content like testimonials and reviews prominently on your site Update existing authoritative content Build authority by building backlinks to positive articles (or positive reviews on external sites) Partner with influencers within your niche to promote your content Share positive reviews on your social profiles and shout out the reviewer Share third-party endorsements from other companies and brandsThere’s no quick fix for ranking better, but these tips can help you put your best foot forward using content. Not all of these tips address specific ranking factors, but they all push your positive content into more prominent places.7. Maintain Consistent BrandingAll the content you create should reflect the brand identity you want to portray. Because everything a customer sees shapes their perception. By branding content consistently, you can influence opinions more strongly and improve recall.Something as small as a reply to an Instagram comment can make a big impact.For example, Asos writes personalized responses and uses emojis to portray a fun and laid-back image.Remember: Just one poorly worded comment could harm your brand’s online reputation.8. Create Content for Branded KeywordsBranded keywords are search queries that contain your brand name or a close variation. Creating quality content around these keywords helps you control the narrative around your brand.In other words, it’s an effective form of online reputation marketing.For example, Airbnb has an article entitled “How Airbnb works to make it safe to share your place.” This ranks when people search terms like “is airbnb safe.”Apply SEO best practices like these to increase your chances of ranking highly: Use the target keyword in your title tag, meta description, H1 tag, and first paragraph of body content Demonstrate experience, expertise, authoritativeness, and trustworthiness (E-E-A-T) Build backlinks from authoritative sites in your industryTo further dominate the SERP for a branded keyword, you can: Post relevant content on social media sites Send press releases that prompt journalists to write positive stories on the topic Write guest posts on the topic for other sitesLet’s learn how to find and prioritize your branded keywords.How to Define Your Branded KeywordsTo find out what branded keywords people search for, use Semrush’s Organic Research tool.Input your domain and navigate to the “Positions” report. Then, apply two “Advanced filters”: “Exclude,” “Keyword type,” and “Not branded” “Exclude,” “Keyword type,” and “Branded for other domain.”Like this:Identify which branded keywords could have the highest impact by looking at the search volume (i.e., the average number of searches per month).For example, keywords with a search volume of 1K (1,000) have a much wider potential reach than keywords with a search volume of 10.Once you identify your most important branded keywords, check the SERP for each one. Just click the icon in the “SERP” column. Like this:If the results are largely unfavorable, you can try to take action.For example, Airbnb might attempt to outrank some of the negative results for “is airbnb worth it.” By creating a detailed blog post on the topic.Pro tipIf you choose to manually search for branded keywords on Google, open a private browser window. This prevents results from being personalized based on your search history and precise location.9. Choose Influencers WiselyInfluencer marketing is paying relevant online influencers (e.g., social content creators) to promote your business to their audience. And it can yield great results. For example, activewear company Lululemon partnered with fitness influencer Damian Warner. To reach his audience of over 30,000 followers.Keep in mind that things can quickly go wrong if you don’t choose the right partners.Take Disney’s Maker Studios, for example.They partnered with the popular gaming YouTuber Felix Kjellberg (aka PewDiePie) in 2014. Which gave him co-ownership of a multichannel network that produced videos, apps, and merchandise.But that partnership came to an end in 2017 due to controversy.PewDiePie had posted several videos that included inappropriate and deeply offensive content.When Maker Studio caught wind of these videos, they cut all ties with the YouTuber.While Disney took steps to end the partnership, PewDiePie was already affiliated with them at the time. Which turned the issue into a reputation crisis for the company, as well.For the best results, work with influencers who fit your brand image. Bonus points if customers already associate them with you.Let’s say a social media personality who shares your audience demographic is already known for wearing your clothes and has even organically posted about you before. They could be a good fit for an influencer partnership.On the other hand, someone who’s never worn your clothes before and has promoted other brands in your space probably wouldn’t work well.Ready to start an influencer marketing campaign? Here’s how:How to Start an Influencer Marketing CampaignThe first step is the same as any marketing campaign: Establish your goals.Some common goals of influencer marketing campaigns are brand awareness, engagement, influencer-generated content, and sales.Once you set your campaign goal, set a budget. Influencers’ rates vary, so do some research before reaching out.You can find influencer rates by using the Influencer Analytics tool.Next, it’s time to find influencers in your niche.Rather than blindly sending cold emails or spending hours scrolling through social media, simply click on the “Influencer Discovery” tab to get a whole list of trustworthy influencers.With the tool, you can: Find influencers by platform and keywords Filter out influencers based on your criteria View influencer profiles Monitor your brand mentions Analyze your competitors’ influencer strategyPro tipUse social listening to decide which influencers to work with. Choosing an influencer who’s already a fan of your brand can be a huge asset to your campaign.Once you’ve chosen a few influencers you’d like to work with, it’s time to reach out.Here are a few tips on crafting your initial email: Get personal. Address influencers by name to make it clear that you’re familiar with their personal brand. And let them know why you think this would be a good partnership. Provide details. Give influencers as much information up front as possible so they can decide whether the partnership is a good fit. Discuss next steps. Make your email actionable by prompting next steps. Let influencers know if you need access to their media kit or provide them with a link about your campaign.Once you’ve chosen an influencer, set up reporting for your campaign. Collect data before your campaign kicks off so you can see the campaign’s overall impact.And last but not least: Follow the rules. Businesses in the U.S. can get in serious trouble if their partners fail to follow the Federal Trade Commission’s social media guidelines. (Other countries may have similar rules.)This includes clearly stating which posts are ads (usually with hashtags like #ad or #sponsored) and placing that label somewhere visible toward the beginning of the post. Consult with a legal professional for official guidance.Manage Your Online Reputation with SemrushSemrush tools empower you to streamline online reputation management and get better results.Our platform includes: Media monitoring apps: See what competitors, influencers, and consumers say about your brand SEO tools: Get positive exposure on search engine results pages Social media tools: Monitor and manage your reputation through social networksAnd many more online reputation management tools.Sign up free to explore your options.",
  "headers": [
    {
      "level": "H1",
      "text": "A Beginner’s Guide to Online Reputation Management"
    },
    {
      "level": "H2",
      "text": "What Is Online Reputation Management?"
    },
    {
      "level": "H2",
      "text": "Why Reputation Management Is Important for Your Business"
    },
    {
      "level": "H3",
      "text": "ORM Failure Examples"
    },
    {
      "level": "H4",
      "text": "United Airlines"
    },
    {
      "level": "H4",
      "text": "Nestlé"
    },
    {
      "level": "H2",
      "text": "Online Reputation Management Media Channels"
    },
    {
      "level": "H3",
      "text": "Paid Media"
    },
    {
      "level": "H3",
      "text": "Earned Media"
    },
    {
      "level": "H3",
      "text": "Shared Media"
    },
    {
      "level": "H3",
      "text": "Owned Media"
    },
    {
      "level": "H2",
      "text": "How to Do Online Reputation Management"
    },
    {
      "level": "H3",
      "text": "1. Audit Your Online Reputation"
    },
    {
      "level": "H3",
      "text": "2. Establish an Online Reputation Management Strategy"
    },
    {
      "level": "H4",
      "text": "Prioritize Tactics and Tasks"
    },
    {
      "level": "H4",
      "text": "Establish Guidelines"
    },
    {
      "level": "H5",
      "text": "Policy Documentation"
    },
    {
      "level": "H5",
      "text": "Communication Guidelines"
    },
    {
      "level": "H5",
      "text": "Tone of Voice"
    },
    {
      "level": "H3",
      "text": "3. Monitor Brand Mentions"
    },
    {
      "level": "H3",
      "text": "4. Plan Your Crisis Management Strategy"
    },
    {
      "level": "H3",
      "text": "5. Encourage Customer Reviews Online"
    },
    {
      "level": "H4",
      "text": "How to Get Your Customers to Leave a Review"
    },
    {
      "level": "H3",
      "text": "6. Manage Negative Online Reviews"
    },
    {
      "level": "H4",
      "text": "How to Respond to Negative Reviews"
    },
    {
      "level": "H4",
      "text": "How to Push Negative Reviews Down in Search Rankings"
    },
    {
      "level": "H3",
      "text": "7. Maintain Consistent Branding"
    },
    {
      "level": "H3",
      "text": "8. Create Content for Branded Keywords"
    },
    {
      "level": "H4",
      "text": "How to Define Your Branded Keywords"
    },
    {
      "level": "H3",
      "text": "9. Choose Influencers Wisely"
    },
    {
      "level": "H4",
      "text": "How to Start an Influencer Marketing Campaign"
    },
    {
      "level": "H2",
      "text": "Manage Your Online Reputation with Semrush"
    }
  ],
  "author": ""
}