{
  "url": "https://www.semrush.com/blog/online-learning-platform-seo-case-study/",
  "slug": "online-learning-platform-seo-case-study",
  "title": "SEO Case Study: How UK-based agency helped an online learning platform increase organic traffic by 59.5%",
  "description": "Learn how UK-based agency Re:signal helped their client, Learning with Experts, increase their organic traffic.",
  "content": "In the spring of 2021, we focused one of the SEO Reality Show episodes on the approach one of our agency partners, Re:signal, took to help their client, Learning with Experts, increase their organic traffic. Now that several months have passed, we wanted to circle back on that story and provide some results from their hard work and close collaboration.The Client Learning with Experts is a global classroom community that brings people together to learn from expert tutors and each other.The Agency Re:signal is an award-winning UK-based SEO agency focused on driving organic performance for brands.The ObjectiveThe demand for online learning increased exponentially over the past 18-months as people looked to expand their skills and explore new interests while home-bound during the pandemic. With so many now searching for similar terms related to online learning, competition became fierce for companies trying to promote their various courses online. When Learning with Experts came to Re:signal, they had the lowest organic visibility compared to their competitors. Their objective, and what they were looking to Re:signal to help them with, was to increase their online visibility and stand out from their competitors. The Solution The agency focused on 3 key areas to help Learning with Experts increase organic visibility: Identifying keyword opportunities based on competitor rankings Exploring opportunities for improvement of the site health and structure Optimizing category pages and creating new blog contentThe Implementation Step 1. Identifying Keyword Opportunities Based on Competitor Rankings Re:Signal assessed the content using Google’s EAT criteria to determine areas for improved position in the SERPs. The key to success was in aligning searchers’ interests with content that was relevant and informative — along with content length and the type of content.As a result, content was the key focus for the ensuing three months, with the opportunity to optimise category pages and create new blog content. The Re:Signal team identified that Learning with Experts had 265 keywords missing in comparison to their competitors when using the Keyword Gap tool. The big search opportunities identified were: online classes (2,900) garden design (49,500) cooking classes (8,100) online fashion courses (880) The agency also used the Keyword Magic tool to discover new ideas for long-tail keywords and to expand keyword lists to cover as many as possible related to priority topics in their content.This keyword research led to the creation of content themes and topic suggestions that they used to craft new content throughout May and June 2021. Step 2. Exploring Opportunities to Improve Site Health and Structure Site audit allowed the agency to identify the most critical technical issues to fix such as: Crawl errors Issues with Mobile Usability Pages with duplicate titles; Pages with no canonical tag. After fixing the critical issues, the agency identified opportunities to improve Conversion Rate (CVR) on top converting sections. Using the On-Page SEO Checker tool, the agency revealed the following content issues to fix: The category landing pages were not using a clear primary heading (h1). The content was too thin across a few pages, in regards to descriptive content. Metadata issues.Step 3. Optimizing Category Pages and Creating New Blog ContentThen, ​​the agency team had to receive concrete recommendations for creating fully SEO-optimized content in the SEO Content Template tool. After collecting all the data, the agency started creating content directly in the tool.To check the SEO potential and originality of the content written, the account team then used the SEO Writing Assistant, which offered SEO recommendations related to the tone of voice, target keywords, and readability status based on the top 10 ranking pages for the given keywords in a given location.See an example below, titled 10 inspirational front garden design ideas. The agency also created a Google Data Studio Dashboard to assess the performance of this content over time. Over a three-month period, seven blog posts were created. The data collected proved that viewers were keenly interested in useful content about gardening, in particular. With summer approaching at that time, the agency’s recommendation to Learning with Experts was to provide more great content related to that area of interest.ResultsRe:Signal team uncovered opportunities to close the gaps with direct competitors and improve position for popular areas of focus, including: Arts (photography) Health (wellbeing/gardening, food and drink) Recreation Home. Over a five-month period leading into the summer of 2021, Re:Signal noted an uplift of 59.5% in organic sessions, driving a 94.9% uplift in organic revenue. In addition, Learning with Experts recently launched a B2B service offering, “ Learning with Experts For Business.” The Re:Signal team also worked with the client to help ensure their new page related to this new business offering included relevant on-page SEO fundamentals with plans for further navigational enhancements to be implemented.Follow the Semrush SEO Reality Show series and discover more real-world examples of what’s possible when talented marketers deploy powerful SEO tools, in collaboration with clients who are willing to change the way they market. SEO Case Study Infographic",
  "headers": [
    {
      "level": "H1",
      "text": "SEO Case Study: How UK-based Agency Helped an Online Learning Platform Increase Organic Traffic by 59.5%"
    },
    {
      "level": "H2",
      "text": "The Client"
    },
    {
      "level": "H2",
      "text": "The Agency"
    },
    {
      "level": "H2",
      "text": "The Objective"
    },
    {
      "level": "H2",
      "text": "The Solution"
    },
    {
      "level": "H2",
      "text": "The Implementation"
    },
    {
      "level": "H3",
      "text": "Step 1. Identifying Keyword Opportunities Based on Competitor Rankings"
    },
    {
      "level": "H3",
      "text": "Step 2. Exploring Opportunities to Improve Site Health and Structure"
    },
    {
      "level": "H3",
      "text": "Step 3. Optimizing Category Pages and Creating New Blog Content"
    },
    {
      "level": "H2",
      "text": "Results"
    },
    {
      "level": "H2",
      "text": "SEO Case Study Infographic"
    },
    {
      "level": "H6",
      "text": "Most popular pages"
    },
    {
      "level": "H6",
      "text": "SEO Checklist: 41 Tips to Optimize Your Website"
    },
    {
      "level": "H6",
      "text": "How to Perform a Complete SEO Audit (in 14 Steps)"
    },
    {
      "level": "H6",
      "text": "A Beginner’s Guide to Keyword Search Volume"
    }
  ],
  "author": ""
}