{
  "url": "https://www.semrush.com/blog/organic-ctr/",
  "slug": "organic-ctr",
  "title": "How to Understand, Measure, and Improve Your Organic CTR",
  "description": "Want to boost your organic CTR? Learn to measure, benchmark, and improve your click rate in this comprehensive, easy-to-follow post.",
  "content": "What Is Organic CTR?The number of people who click on a link in search engine results pages (SERPs) represents the organic click-through rate (CTR). This metric is expressed as a percentage. For example, say there are 100 searches for “blueberry pie.” A link to your site shows up every time in the results. Your page receives 10 clicks. Your organic CTR would be 10% (10 out of 100).Here’s the formula:Organic CTR is an important SEO key performance indicator (KPI) that you should track to gauge how well your site is performing in search.The higher your organic click-through rate, the more organic traffic you should expect from Google and other search engines. (This assumes that the number of impressions remains consistent.)It’s often used as an SEO metric to understand if your pages are resonating with searchers.Is Organic CTR a Google Ranking Factor?No. Organic CTR is not a Google ranking factor, but that doesn’t mean you should ignore it. Google uses CTR to test and measure other changes to the algorithm and overall quality of search results. But a higher CTR will not directly improve your page’s ranking.In other words, you can’t trick the Google algorithm into ranking your page higher by simply performing searches over and over, clicking on your own site from the organic search results. That would make the SERPs too easy to manipulate.On the flip side, having a low CTR won’t hurt your rankings directly.Additionally, tracking this metric can give you a better idea of your website’s visibility and performance in search results. If you see that very few people click on your links, you might need to tweak your SEO strategy. How to Determine Your Organic CTRThe easiest way to determine your CTR is Google Search Console (GSC).GSC provides primary data on how your website performs on Google searches and automatically calculates CTRs that you can track a few different ways.If you don’t already have GSC set up for your website, follow our guide on how to do so.Measuring Sitewide Organic CTRFrom inside GSC, click “Performance” > “Search results.”Note: Depending on your website, you may just have a single page called “Performance.”This will take you to a snapshot of your website’s performance in Google search, including your sitewide organic CTR.This is the aggregate click-through rate for all pages on your site and all keywords or search queries. It can be a helpful metric for understanding how your entire site is performing in search. But beware. Sitewide CTR can be a misleading KPI. Even if your sitewide CTR is declining, it doesn’t necessarily mean anything is wrong. In fact, it could mean things are going really well. For example, say your site has just started to rank for many new keywords. But it’s still climbing the SERPs. Right now, you rank mostly in positions #8 through #12 for the new keywords.These new keywords likely have a lower CTR because they don’t rank in the top 3 positions. So they will bring down your sitewide average. Use your sitewide CTR in conjunction with the other CTR metrics below for a better understanding of how your site is performing.Measuring CTR for a Specific Search QueryYou can also measure the CTR for a specific query across all pages on your website.Click the “Average CTR” box to enable the CTR column in the table below. Then, scroll down to the “Queries” table to see the CTR for a single search query.But, once again, there’s a limitation. Your site may have multiple pages that rank for the same query. The pages that rank lower likely have a lower CTR. This could bring down the average and make it look as though your site is not performing well for that keyword.Pro tip: If you find that you have multiple pages ranking for the same queries, this may be an issue known as keyword cannibalization. Read our guide on how to address this.Measuring CTR for a Specific PageMeasuring your CTR for a specific page will tell you what percentage of impressions for that page end up generating a click.To do this:Click the “Pages” tab in the table at the bottom of the page.Remember, this is an average.This means your average CTR will be affected by the average position for all queries for which that page ranks.And pages on your site may rank for dozens or hundreds of keywords.It might rank well for a small number of keywords. But it could also rank relatively low for many more, which could bring down your average.Measuring CTR for a Specific Page and Search QueryThe most actionable CTR metric you can analyze is the click rate for a specific page and a specific keyword or query. E.g., how well does your “blueberry pie recipes” landing page perform for the query “blueberry pie?”This will give you the most reliable measurement of your performance for that topic.To determine this CTR:Start by clicking on the URL of the page you’re analyzing from the table.This will apply a filter to the data. Now, you’ll only see metrics related to that specific page.Next, click the “Queries” tab.GSC will now provide you with data about how that specific page performed for the queries listed in the table. Simply find the query you want to analyze and review the CTR column to see how it performs. You can use this number to identify potential issues or opportunities for optimization.Use the benchmark data to understand if you have a relatively high CTR or low CTR based on your ranking.Then, follow the action steps in the How to Improve Organic CTR section to improve.What’s a Good Organic CTR?There is no universal benchmark for what constitutes a “good” or “bad” organic CTR.Your CTR will depend heavily on which other pages and SERP features (e.g., featured snippets) appear in the search results. But you can use benchmark data to compare your performance.Your page’s ranking position will have a major impact on the number of clicks you receive. Backlinko studied more than 4 million Google search results to understand benchmarks of organic CTR. The study includes organic CTR data from 1,312,881 pages and 12,166,560 search queries via various Google Search Console accounts. Here are the findings for pages that appear on the first page of Google:Image Source: BacklinkoThe first organic result in Google’s SERP has an average CTR of 27.6%. Position two has a CTR of 15.8%.And so on.So, what’s a good CTR? Anything at or above these benchmarks would indicate your page is outperforming the average. Anytime you’re analyzing your own performance, be sure to consider the average position when deciding if your CTR is “good” or “bad.”Factors That Influence Organic CTROrganic CTR is highly contextual, and many factors influence it: SERP position: In many cases, the most influential factor in your organic CTR is where your page ranks. The first three spots get the majority of all clicks and have a higher CTR than pages that rank position #4 and below. Search intent: The type of query could affect the CTR. For example, informational queries (e.g., “how to bake a cake”) might have a different CTR than transactional queries (e.g., “buy chocolate cake online”). SERP features: Some SERPs contain featured snippets, map packs, and other features that can dramatically change the CTR of other organic results. They can also skew the distribution of which pages receive clicks. Rich snippets: Some links in the SERP will contain additional information, such as ratings or sitelinks. This can improve the CTR for those links and decrease the CTR for other results. Brand recognition: Established brands or websites with strong domain authority might naturally have a higher CTR due to recognition and trust Industry or niche: Different industries have varying average CTRs Mobile vs. desktop searches: The user’s device used can influence CTR. Mobile searches can have a different CTR pattern than their desktop counterparts. Title and meta description: Compelling page titles and meta descriptions can influence a user's decision to click on your link (more on this later in the post) As you can see, some factors are external and others are directly related to your website and SEO efforts. For instance, your company size or history, advertising efforts, and social media presence can all influence brand recognition. On the other hand, page titles and meta descriptions are within the realm of SEO. And you can directly impact their effect on organic CTR. How to Improve Organic CTR If your page or website has a low CTR (or if you just want to increase it beyond the average), there are many strategies you can pursue to generate more clicks. 1. Conduct a Website Audit First, use the Semrush Site Audit tool to analyze your website’s performance. This practice can also help you identify potential issues affecting your SEO efforts. For example, your pages may take too long to load, which can negatively impact the user experience. Or you may have duplicate title tags, 4xx errors, and other technical problems that could hurt your rankings. To get started, log in to your Semrush account and click “Site Audit” under “On-Page & Tech SEO” on the left side of the screen. Next, click “Create Project” and follow the instructions provided. You’ll have to enter your website’s URL, select the preferred crawl source, and set a limit on the number of checked pages per audit. You can also configure crawler settings and other parameters. After that, click “Start Audit” and check the results. The Semrush Site Audit tool will display a detailed overview of your website’s health and crawled pages, as well as the top issues affecting its performance. From here, you can select “Crawled Pages,” “Issues,” “Statistics,” and other relevant categories for further insights. Semrush will also make recommendations based on the problems you may be facing. Let’s say one or more of your pages display a 404 error. Click “Why and how to fix it” to learn more about this issue and how to address it. For starters, address the problems listed under “Top Issues” on the “Overview” page. After that, look into those listed under “Warnings” and “Notices” under “Issues.”2. Target Featured Snippets Featured snippets are a SERP feature from Google designed to provide users with quick and concise answers to their queries. These text excerpts appear above Google’s organic search results for maximum visibility. We often refer to featured snippets as “Position Zero.” This is because they appear above the rest of the organic results. This is valuable real estate and can attract a significant portion of clicks. So, how do you land your web page in the coveted position zero?Surprisingly, you don’t have to rank #1. The vast majority of featured snippets come from pages ranking anywhere on the first page of Google. So, even if your website is in the fourth or fifth position, you can still land featured snippets. But only about 20% of SERPs have a featured snippet. So, you need to uncover which topics and keywords contain a featured snippet. Then, optimize your content to try to capture the top spot. If you’re looking at the CTR of a single page or keyword, conduct the search manually. Is there a featured snippet? Great. Optimize your content to target it. (More on this in the infographic below.)If you’re looking for a sitewide strategy, use the Organic Research tool.This will help you discover keywords that meet three criteria: You already rank on page #1 There is a featured snippet on the SERP Your site does not already occupy the featured snippetFirst, click the “Organic Research” tool on the left sidebar of your Semrush dashboard. Type the URL of your site in the text box. Click “Search.”Next, tab over to “Positions.” Then, click the “Organic” filter.Finally, click the “Pos.” filter drop-down and choose “Top 10.” Click “Apply.” Next, click the “SERP features” filter. Hover over “Domain doesn’t ra…” and click “Featured Snippet.” The result is filtered for keywords where your website ranks in the top 10 but doesn’t have a featured snippet, even though a Featured snippet is present on the SERP. These pages are all potential opportunities for optimization.In this example, the first result listed ranks position #2. But there is also a featured snippet at the top of the results. How do you capture it?You’ll have to optimize for featured snippets. Depending on the exact type of snippet that appears (paragraph, list, table, etc.), you can craft a section of your content to try to match the format and style of the result.You can also reverse engineer the process. Rather than updating your existing content, you can create new content that specifically targets searches that contain featured snippets.You can conduct an SEO competitive analysis to see the keywords where your competitors rank that include a featured snippet. Or use Keyword Magic to generate a list of keywords that you can filter by the presence of a featured snippet. There’s just one caveat to this whole process. Many featured snippets lead to an increased CTR.But some featured snippets actually lower your CTR. In particular, any time the full answer to a query is displayed directly in the SERP (think a definition of a word), users may be less likely to click the link and visit your website. Like this example:Any time a user performs a search without clicking on any result, it’s called a zero-click search.As you’re identifying featured snippets to target, consider the context and whether a searcher is likely to click on the source shown within the snippet. 3. Optimize Title TagsYour page’s title tag is likely the first thing a searcher sees when reviewing the SERP. And it can play a big role in how likely they are to click.Experiments from Backlinko confirmed that optimizing the title tag can improve CTR. Sometimes, it’s enough to tweak the title tag length to get more clicks. Optimize your page’s title tag by following best practices: Aim for 6 to 9 words: Studies have found that titles with six to nine words tend to have the highest CTR. In addition, make sure your title is less than 60 total characters, or it won’t appear in full in SERPs. Include the primary keyword: Use the target keyword for the page in the title. This will signal to the user that the page is indeed about the topic they’re searching. And it will often appear bold in the SERP. Plus, it’s an SEO best practice. Describe the content: Ensure your title describes the content on your page. Whether it’s a guide, a list of tips, or a review. Don’t keyword stuff: Using your target keyword once is great. Using it multiple times (or stringing together numerous synonyms) is excessive and can turn users away from your site. 4. Improve Meta DescriptionsMeta descriptions help users further understand your page’s content when they’re reviewing search results. It’s not a Google ranking factor. So optimizing your meta description won’t shoot you to the top of the SERP. But it can help convince someone to click through to your site.It’s sort of like the sub-heading of the advertisement for your page.Here are some best practices: Hit the right length: Meta descriptions can be 680px long. Or about 105 characters. Try to get as close to the limit as possible without going over. If it’s too long, people will only see a part of it in search results. If it’s too short, you’re wasting valuable space you could use to your advantage. Add the keyword: Using your primary keyword in the meta description can help draw the user’s attention to the result. Google often bolds sections of the meta description that closely match the user’s search query. Consider search intent: Write the meta description with the target audience in mind. Their search intent might be to learn information, make a purchase, or research a brand. Make sure your meta description meets their expectations by using language that mirrors their intent. (E.g., “learn,” “shop,” “buy,” “compare,” etc.) Include a CTA: Encourage the reader to take a step. Like all copywriting, crafting a meta description is all about compelling action. Make each meta description unique: Don’t copy and paste the same description across multiple or all pages on your website Keep in mind that Google does not always display the meta description as you’ve written it. So, while it’s valuable to spend time crafting a compelling description, don’t be surprised if Google uses another snippet of text from the page instead. 5. Target Rich Snippets with Schema MarkupIn some cases, Google will use schema markup on your page to add additional features to your site’s SERP listing. These features are called rich snippets. (Sometimes called “rich results.”)They give your site extra real estate in the SERP, which can boost your CTR. Rich snippets include things like: Sitelinks Reviews Recipes FAQsHere’s an example of a rich snippet:So how do you get them?The main way to influence your likelihood of earning rich snippets is to implement schema markup on all relevant elements on your page.Schema markup is additional code added to your site’s HTML that helps search engines better understand the content on the page. The markup describes elements on your page in a structured data language easily understood by crawlers and bots. It looks like this:Follow this guide to optimize for rich snippets. In some cases, you can trigger sitelinks (extra links to landing pages on your site or sections within your page) without schema.Try adding a table of contents.Having a structured table of contents listing (and linking to) each heading or section of the page can trigger sitelinks to appear.It also improves your content’s readability and user experience (UX).6. Optimize the Page’s URLYour site and URL structure appear in the SERP listing along with your page’s title and a meta description. And it can affect your CTR.The page path shown in the SERP generally follows along with your site’s URL structure. So, if your URL is: example.com/blog/blueberry-pie.Then the URL in the SERP would likely display as: Example.com > blog > Blueberry Pie.But if the URL is: Example.com/blog/category/10/gibberish/blueberry-pie.Then the URL might be Example.com > blog > category > 10 > gibberish > Blueberry Pie.It’s not very pretty, right?Optimizing your URL and site structure can improve the way your listing appears. Plus, it has additional benefits for SEO and user experience. 7. Target Long-Tail KeywordsYou can improve your organic CTR by adjusting your SEO strategy. We know that your ranking is one of the most important factors.So if you can rank higher in the SERP, you would likely see a higher CTR.But how do you rank higher?One strategy is to focus on long-tail keywords. These are keywords that generally have lower search volume than short-tail keywords (or “head terms”). But they also tend to be less competitive. For example, rather than trying to rank for “blueberry pie,” maybe you decide to target “blueberry hand pies” or “mini blueberry pies.”Both of these keywords have a lower search volume than the head term (“blueberry pies”). But they have a significantly lower keyword difficulty or competition.This means it might be easier for you to rank higher.Thus, you’d see an improvement in your overall CTR and more traffic.Identify and target long-tail keywords by following our guide on conducting keyword research.8. Optimize Your FaviconChanging or adding a favicon to your website could increase CTR.What’s that? The favicon (sometimes called “bookmark icon” or “website icon”) is the small image that appears next to your page when it’s opened in a browser tab or added to a user’s bookmark list.But it also appears in the SERP:If your site doesn’t have a favicon, Google will display a placeholder image. Since this is one of the first visual elements users see in the SERPs, having a well-designed favicon—rather than a generic image—could make your result more inviting and clickable. First, make sure that your site is displaying a favicon and that it accurately represents your website or brand. It’s usually a version of your logo.Secondly, consider optimizing your favicon to make it more clear and easily recognizable.9. Improve Page Loading Speed According to Google, mobile users are 32% more likely to leave a web page if its load time increases from one second to three seconds. The same goes for desktop users, who will eventually leave a page that takes too long to load. With that in mind, use the Site Audit tool to see if your website has slow-loading pages. These will be listed under “Issues.” If you find any, take the following steps to improve their load speed: Clean up the HTML code of that particular page Compress your images with a dedicated tool like Squoosh or TinyPNG Enable browser caching Use a content delivery network (CDN) Limit the number of HTTP requests Delete unnecessary media files, such as old or unused imagesFor example, a CDN would allow you to store copies of your files on servers spread across different regions and countries. This way, they’d become more easily accessible to users located in those regions, which in turn can reduce page load speed. If all else fails, consider switching to a different web host. Some providers optimize their servers for speed, leading to faster loading pages. On a similar note, it may be worth switching to cloud hosting, dedicated hosting, or virtual private server (VPS) hosting. These options are usually faster and more secure than shared hosting. 10. Eliminate Keyword CannibalizationIf two or more pages on your site rank for the same keyword, they’ll compete with each other in search results. In this case, we’re talking about keyword cannibalization, a problem that can affect your site’s performance. Basically, it’s too much of a good thing. The only exception is when your target keyword caters to different search intents. For example, you may have one page designed for customers who want to learn more about the “best classical guitars,” and another page for those looking to buy one. But if both pages satisfy the same search intent, Google may devalue the page you want to prioritize. This practice can also dilute your anchor text and links, making it harder to compete with other sites targeting the same keyword as you. What you can do about it is conduct a website audit and then decide which page you want to keep. Alternatively, merge the pages into one page, such as “Your Ultimate Guide to the Best Classical Guitars.” Pro tip: Use the Semrush Position Tracking tool to identify keyword cannibalization that needs fixing.More Ways to Increase Organic TrafficImproving your site’s organic CTR is a small but important step in increasing your site’s overall organic traffic. But don’t stop there. Read our comprehensive guide on How to Increase Organic Traffic to learn additional tactics and advanced strategies to grow your website and your business. Meanwhile, keep experimenting with the Keyword Magic tool to discover new search terms related to your business. Use them to optimize your blog posts, web pages, meta descriptions, and title tags so you can rank higher in SERPs. Don’t forget to use Semrush’s Organic Research tool to see what works best for your competitors. After that, refine your SEO strategy to rank for new keywords and gain more exposure online.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Understand, Measure, and Improve Your Organic CTR"
    },
    {
      "level": "H2",
      "text": "What Is Organic CTR?"
    },
    {
      "level": "H2",
      "text": "Is Organic CTR a Google Ranking Factor?"
    },
    {
      "level": "H2",
      "text": "How to Determine Your Organic CTR"
    },
    {
      "level": "H3",
      "text": "Measuring Sitewide Organic CTR"
    },
    {
      "level": "H3",
      "text": "Measuring CTR for a Specific Search Query"
    },
    {
      "level": "H3",
      "text": "Measuring CTR for a Specific Page"
    },
    {
      "level": "H3",
      "text": "Measuring CTR for a Specific Page and Search Query"
    },
    {
      "level": "H2",
      "text": "What’s a Good Organic CTR?"
    },
    {
      "level": "H2",
      "text": "Factors That Influence Organic CTR"
    },
    {
      "level": "H2",
      "text": "How to Improve Organic CTR"
    },
    {
      "level": "H3",
      "text": "1. Conduct a Website Audit"
    },
    {
      "level": "H3",
      "text": "2. Target Featured Snippets"
    },
    {
      "level": "H3",
      "text": "3. Optimize Title Tags"
    },
    {
      "level": "H3",
      "text": "4. Improve Meta Descriptions"
    },
    {
      "level": "H3",
      "text": "5. Target Rich Snippets with Schema Markup"
    },
    {
      "level": "H3",
      "text": "6. Optimize the Page’s URL"
    },
    {
      "level": "H3",
      "text": "7. Target Long-Tail Keywords"
    },
    {
      "level": "H3",
      "text": "8. Optimize Your Favicon"
    },
    {
      "level": "H3",
      "text": "9. Improve Page Loading Speed"
    },
    {
      "level": "H3",
      "text": "10. Eliminate Keyword Cannibalization"
    },
    {
      "level": "H2",
      "text": "More Ways to Increase Organic Traffic"
    }
  ],
  "author": ""
}