{
  "url": "https://www.semrush.com/blog/pagerank/",
  "slug": "pagerank",
  "title": "Is Google PageRank Still Important?",
  "description": "Google PageRank measures a webpage’s importance based on the quality and quantity of links pointing to it.",
  "content": "PageRank is one of the oldest Google algorithms. It was developed in 1996 as a part of a college research project, but it remains important today. And it plays a key role in SEO.In this article, you’ll learn how PageRank works and how you can use that knowledge to improve your SEO results.But let’s start with the basics.What Is PageRank?PageRank is a Google algorithm (though there are many others) that measures webpage importance based on the quality and quantity of incoming links. It treats these links as votes. And pages that receive more high-quality links are considered more important in search results.Basically, the PageRank algorithm was designed to: Identify valuable content: It decides which pages are most useful and relevant based on the links they receive from other reputable sites Reward sites with natural, high-quality backlinks: Pages that earn links from trusted, authoritative sources are considered more important and rank higher in search results Discourage link manipulation: By valuing quality in addition to quantity, PageRank makes it harder for sites to artificially boost their rankings through mass link building or link farms Organize web content by relevance and authority: It creates a hierarchy of webpages that helps Google understand which pages are most authoritative on specific topicsPreviously, Google would publicly assign a PageRank score—which ranged from 0 (PR0) to 10 (PR10)—to every webpage. And SEOs could see those scores via the Google Toolbar.Note\"Google Toolbar\" and \"PageRank Toolbar\" are often used interchangeably. But the Google Toolbar was a browser add-on with multiple features. The PageRank score was one such feature.This score worked on a logarithmic scale, which many SEOs think had a logarithmic base of five. Meaning each incremental increase represents a fivefold increase in importance.For example, a PR4 page would be considered 25 times more important than a PR2 page. Not twice as important, as a linear scale suggests.Google retired its toolbar in 2016 and removed the public PageRank score display because SEOs became fixated on the metric. But the PageRank algorithm remains important today.TipWhile you can’t view your PageRank scores anymore, Semrush’s Authority Score (shown here in Backlink Analytics) gives you a reliable way to gauge a website’s reputability and quality. How Does PageRank Work?PageRank measures webpage importance based on incoming links. And how credible the source providing the link is. This flow of ranking authority between pages is sometimes referred to by SEOs as “link juice.” And can be visualized like this:When Google's founders first developed the algorithm, they based it on the idea that a link from one website to another indicated a level of trust and authority.In their original paper introducing Google, the founders noted that not all votes are created equal.The authority of a page is taken into account. So, a link from a PR6 page is ultimately a more authoritative vote than one from a PR2 page.And the more links on a page, the more their power is diluted.This means it’s more beneficial for SEO when a page links to their site only. Rather than lots of different sites.NoteThis is based on information in a paper published by Google’s founders in 1998. PageRank and related internal algorithms have likely changed since that time.History of Google PageRank April 1, 1998: Larry Page and Sergey Brin publish “The Anatomy of a Large-Scale Hypertextual Web Search Engine” September 1, 1998: Larry Page and Sergey Brin file the first PageRank patent September 4, 1998: Google is incorporated December 11, 2000: Google launches the Google Toolbar June 17, 2004: Google files the reasonable surfer patent October 12, 2006: Google files its “seed sets” patent March 8, 2016: Google announces Google Toolbar’s retirement March 27, 2024: Leaked Google search API documents reveal PageRank is still used internallyPageRank Is BornGoogle’s Lawrence Page (Larry Page) and Sergey Brin developed PageRank based on the idea that information on the web could be ranked based on a page’s popularity via links. And the first PageRank patent was filed in September 1998. It became the original algorithm that Google used to calculate a webpage’s importance. Their paper explains that “the citation (link) graph of the web is an important resource that has largely gone unused in existing web search engines.”PageRank is what made Google so unique.The Introduction of the Google ToolbarGoogle launched the Google Toolbar in 2000. This was important in PageRank’s history because it enabled users to see any page’s score.But SEOs soon became fixated on increasing PageRank as a way to improve rankings. Their goal was to get as many links as possible from webpages with the highest PageRank possible.This led to manipulation, with money changing hands for links. So, links were placed in unnatural locations and in bulk.NoteGoogle now penalizes websites that engage in questionable tactics like paying for links. And issues manual actions (penalties) via Google Search Console. An Updated PageRank PatentThe original PageRank patent expired in 2018 and wasn’t renewed. And a former Google employee confirmed around this time that the original algorithm hadn’t been used since 2006.But that didn’t mean PageRank was over. Because the original patent was seemingly replaced by this new one from 2006.This patent references “seed sites in the trusted seed sets” and defines these as “specially selected high-quality pages which provide good web connectivity to other non-seed pages.” Two examples provided were the Google Directory (which was still live when the patent was filed) and The New York Times. Effectively because they were seen as reliable, covered many interests, and were connected to many other websites.The new patent looked to give a ranking score to a webpage based on how far away it is from a seed set. That said, this patent doesn’t actually reference PageRank (or claim to be an updated version of the algorithm).But the SEO community has understood that it acts as a PageRank modifier based on the proximity to the seed set of sites. Google Retires the ToolbarGoogle stopped updating its PageRank score in December 2013. And completely retired its toolbar in 2016, which removed the public-facing PageRank metric.Without a publicly shown score, there was no accurate measure of a webpage’s authority (at least officially). So, it became harder for SEOs to manipulate the algorithm.Google’s Internal Document Leak Referencing PageRankIn March 2024, a leak of Google's internal API documents revealed how Google ranks webpages. And uncovered that Google uses multiple PageRank versions internally.While we don't know exactly how each version works, this tells us that Google still considers the importance of links when ranking pages.Here are the PageRank versions referenced in the leaked document and what they could possibly mean: RawPageRank: Likely the basic calculation of a page's importance based on links PageRank2: An updated version, though its exact differences are unclear PageRank_NS (nearest seed): This version might help Google understand content relationships and identify low-quality pages FirstCoveragePageRank: This appears to be the PageRank value when Google first discovers and indexes a pageAlso, your homepage's PageRank influences every page on your site. Meaning a strong and well-linked homepage can boost your entire website's authority in Google's eyes.While PageRank scores aren't public anymore, the principles behind PageRank continue to shape how Google evaluates websites. This Google content warehouse API leak proves that.Factors That Influenced PageRankNot all links are equal in terms of the SEO PageRank they pass. But there are more factors that can influence PageRank—or did so in the past.You need to understand not only what these influencing factors are, but also how they apply to SEO today.Anchor TextAnchor text is the clickable text that a link is attached to.In the early days of Google, anchor text had a key influence on a page’s rankings. Link building became a race between SEOs to see who could gain as many exact-match anchor text links (links placed over the precise terms they wanted to rank for) as possible from high-PageRank pages. Fast-forward to today, and Google considers anchor text manipulation to be a form of link spam. And engaging in this practice can lead to a manual penalty that harms your rankings.To find which anchor texts third-party sites are using when linking to your domain, use Semrush’s Backlink Analytics.Open the tool, enter your domain, and click “Analyze.”Go to the “Anchors” tab. You’ll see the list of anchor texts sorted by popularity. Anchor text used in the most backlinks is at the top.In most cases, you don’t need to worry. But it’s still a good idea to ensure you have varied anchor text and ensure your ling building efforts are following SEO best practices.The Likelihood of a Link Being ClickedLinks more likely to be clicked carry more PageRank weight.The original PageRank algorithm assigned an equal weight to links on a page. Whereas Google's reasonable surfer patent states that not all links are as likely to be clicked. So, links carry different weights depending on where they are.For example, links in the following locations are less likely to be clicked than links in prominent locations. Terms of service pages Banner advertisements Website footersInternal LinksInternal links are links between pages on your own website. (In contrast to backlinks—links to your pages from other domains.)Internal linking is a powerful SEO tactic. Because it helps PageRank to flow through your site.It’s a particularly good way to drive authority to orphaned pages—pages that aren’t linked to from anywhere else. TipSemrush’s Site Audit tool includes an internal linking report that helps you identify broken links, orphaned pages, poor anchor text, and much more. Nofollow LinksNofollow links are links that contain the rel=”nofollow” attribute. And look something like this:<a href=\"https://website.com/\" rel=\"nofollow\">Click this link</a>Originally, nofollow links didn’t pass PageRank. So, some SEOs started using the nofollow attribute to sculpt the flow of PageRank—known as “PageRank sculpting.”For example, someone engaging in PageRank sculpting would write guest posts with links to five different websites. And add a nofollow attribute to all the links except the one pointing to their own site.In 2009, Google’s Matt Cutts said PageRank sculpting wouldn’t work. Because PageRank would still be diluted by the presence of nofollow links.Google eventually announced it would treat the nofollow attributes as “hints.” In other words, it would decide whether these links should pass PageRank.For more information, check out our guide to nofollow, sponsored, and UGC links.Why PageRank Still MattersThere are multiple sources confirming that PageRank is as relevant as ever.In 2017, Google’s Gary Illyes confirmed on X (formerly Twitter) that the algorithm still uses PageRank.The 2024 leak provides concrete evidence of this, revealing multiple PageRank variations. This shows how Google has evolved the concept over time to keep it relevant and effective.PageRank still matters today because it helps Google: Assess webpage authority and relevance Determine the value of links pointing to your site Understand how information flows through your website's structureThat means understanding PageRank helps you make informed SEO decisions that can improve your organic visibility. Like deciding to create valuable content that’ll naturally attract links. And strategically interlinking your pages. Does a Replacement PageRank Metric Exist?Google doesn’t offer a way to measure PageRank. But Semrush’s Authority Score provides an alternative way to gauge your site’s overall quality and ranking power.The score (from 0 to 100) is based on: Link power: The quality and quantity of backlinks pointing to your site Organic traffic: The estimated monthly average of your organic search traffic Spam factors: Indicators of a spammy vs. natural link profileAuthority score isn’t a direct stand-in for PageRank. But it can give you some of the same information that the PageRank scores in Google Toolbar used to give.Semrush’s Backlink Audit helps you monitor your own Authority Score and backlinks.Open the tool, enter your domain, and click \"Start Backlink Audit.\"Once setup is complete, the “Overview” tab shows your Authority Score and its trend.Use the “Audit” report to review the backlinks you’ve received.You can even check your competitors’ Authority Scores with Semrush’s Backlink Analytics tool.Just enter a competitor’s domain. And click “Analyze.”Add up to four competitors to compare their Authority Scores. And access other helpful metrics.NoteThird-party metrics like Authority Score aren’t used in Google’s algorithms. A higher Authority Score doesn’t necessarily translate to higher rankings.Start Improving Your PageRankImproving your internal links and building high-quality backlinks to your website are the best ways to improve your PageRank.There are many link building strategies you can use, such as: Outreach: Share your content with publishers who might want to link to it Broken link building: Find broken backlinks and ask owners to fix them (offering your content as a replacement option) Guest blogging: Write high-quality content for relevant sites (just be aware that not all sites allow you to link back to your own website and that many that do use nofollow attributes) Be a source: Respond to online media requests via platforms like ConnectivelyGet started with Semrush’s Link Building Tool.The tool analyzes your competitors’ profiles to find link opportunities. And helps you manage the entire link-building process.",
  "headers": [
    {
      "level": "H1",
      "text": "Google PageRank in 2024: What Google Search Leak Reveals"
    },
    {
      "level": "H2",
      "text": "What Is PageRank?"
    },
    {
      "level": "H2",
      "text": "How Does PageRank Work?"
    },
    {
      "level": "H2",
      "text": "History of Google PageRank"
    },
    {
      "level": "H3",
      "text": "PageRank Is Born"
    },
    {
      "level": "H3",
      "text": "The Introduction of the Google Toolbar"
    },
    {
      "level": "H3",
      "text": "An Updated PageRank Patent"
    },
    {
      "level": "H3",
      "text": "Google Retires the Toolbar"
    },
    {
      "level": "H3",
      "text": "Google’s Internal Document Leak Referencing PageRank"
    },
    {
      "level": "H2",
      "text": "Factors That Influenced PageRank"
    },
    {
      "level": "H3",
      "text": "Anchor Text"
    },
    {
      "level": "H3",
      "text": "The Likelihood of a Link Being Clicked"
    },
    {
      "level": "H3",
      "text": "Internal Links"
    },
    {
      "level": "H3",
      "text": "Nofollow Links"
    },
    {
      "level": "H2",
      "text": "Why PageRank Still Matters"
    },
    {
      "level": "H2",
      "text": "Does a Replacement PageRank Metric Exist?"
    },
    {
      "level": "H2",
      "text": "Start Improving Your PageRank"
    }
  ],
  "author": ""
}