{
  "url": "https://www.semrush.com/blog/page-authority/",
  "slug": "page-authority",
  "title": "Page Authority: What It Means in SEO and How to Improve Your Score",
  "description": "Page Authority is a metric that indicates how likely a page is to rank. Learn how to check your score.",
  "content": "What Is Page Authority?Page Authority (PA) is a value score search engines place on webpages. It’s used as a metric to indicate a page's likelihood of ranking in search results. Think of Page Authority as a grade for how much search engines trust and value a specific page on the internet. The score is calculated based on various factors, such as the quantity and quality of links pointing to that page.Page Authority scores typically range from zero to 100. A higher score indicates a stronger likelihood that the page will rank well in search engine results. The scoring system is logarithmic, meaning that it becomes more challenging to achieve higher scores as you move up the scale.What Is the Difference Between PageRank and Page Authority?Google's PageRank is an algorithm that focuses on the quality and quantity of links. Conversely, Page Authority is a score that considers multiple factors, such as content quality and relevance.A page can improve its authority when a page with a high PageRank score links to it.Previously, anyone could see a webpage's PageRank score via the Google Toolbar. Despite Google retiring the toolbar in 2016, John Mueller, Search Advocate at Google, confirmed the search engine still used PageRank internally in 2020.Google no longer allows you to measure PageRank. But you can still evaluate your site’s ability to rank using Semrush’s Authority Score, which we explain in detail below. How Is Page Authority Determined?Search engines determine Page Authority via complex algorithms. Key factors include the quality of inbound links and the relevance of the page’s content.Semrush calculates Page Authority as “Authority Score,” which is a compound metric that grades the overall quality of a website or webpage.Your Authority Score is calculated through the following factors, which have been weighted in order: Link power (quality and quantity of backlinks) Organic traffic (estimated monthly average of organic search traffic) No organic rankings on search engine results pages (SERPs) Unnaturally high percentage of dofollow domains An imbalance between links and organic traffic Too many referring domains with the same IP address Too many referring domains with the same IP network Presence of another domain with an identical backlink profileYou can find your Authority Score using Semrush’s Backlink Analytics, which doubles as a Page Authority checker. Let’s use Bellroy as an example to get the authority of their “Wallets” category page.Navigate to Backlink Analytics. Enter the page URL and click “Analyze.”You’ll see an overview of that URL’s link profile.At the top of the page, next to the field containing your URL, choose “Exact URL” in the drop-down.In the “Authority Score” box, you’ll see a score for the root domain and the specific page you entered. What Is a Good Page Authority?As mentioned earlier, Page Authority scores for most SEO tools are on a 100-point scale. The higher the score, the higher the authority.When viewing your Authority Score in Backlink Analytics, you might notice Semrush provides some context (referred to as a label) about the score. In the example below, the context is “Poor traffic to backlink ratio.”A score of at least 50 is generally considered a good authority site. Here are some other labels you may see: Low authority Low authority but niche relevant Average Average but niche relevant Good Good and niche relevant Very good Very good and niche relevant Excellent Superb Industry leaderIn the example below, a score of 66 shows as “excellent and niche relevant,” which indicates great authority and a strong backlink profile.Do not use the score to compare your Page Authority to all other pages on the web. For example, if you’re a small-town news site in Maine, don’t compare your pages to the New York Times.Instead, judge your page’s score against similar websites in your niche. See how you compare to other pages that cover news in other small towns in Maine.How to Improve Page AuthorityCreating quality content, earning backlinks from trustworthy domains, and reducing spam factors can all help improve Page Authority and SEO results.Here are a few factors to consider to increase your Page Authority.Age and TrustOlder pages have more time to grow authority. As a page ages, it may attract more inbound links, which are crucial for influencing Page Authority.Search engines attribute trust to pages that have a history of providing reliable information. The longer a page has been accessible and consistently maintained, the more likely the search engines will recognize it as a trustworthy source.Over time, older pages may undergo improvements. The content's maturity and regular updates can enhance its quality and relevance.PopularityIf your content resonates with your audience, they may share and even link to it from their websites. Use internal links from other pages on your site to point to content that performs well and resonates with your followers.Also, when content is shared on social media, more people will see it. They may share it with their network, putting your content in front of audiences you might have never reached before.Freshness of the Last UpdateUpdating your content to provide helpful, timely information can signal relevance to search engines, helping pages rank higher.Here are a few scenarios where content optimization may be necessary: Google rolled out an algorithm update that impacted your industry with new ranking factors (like the Medic update that targeted medical sites) Your rankings are falling You want to rank higher New information was released on your covered topics There were changes in your industry You updated your businessFurther Reading: How to Get Backlinks: 10 Strategies That WorkWhy Did Your Page Authority Change?Various factors, such as search engine algorithm changes, updates to your website, or increased competition, can impact your Page Authority in SEO.Other reasons why your Authority Score can change include: Being outperformed by competitors Your SEO strategies weren’t effective, or they did more harm than good Your link-building efforts haven’t been fruitful Your page doesn’t have backlinks from reputable websites Your website experienced a negative SEO attack with bad linksThe Three Levels of AuthorityWhile Page Authority is important, it's not the only factor that goes into the success of your SEO efforts. There are three levels of authority, and their scores will help you measure the success of your SEO efforts. By optimizing your website according to Domain Authority, Page Authority, and link authority, you could improve your website's search visibility and credibility in search results. What Is Domain Authority?Domain Authority is a measurement that indicates the overall strength and credibility of your entire domain in the eyes of Google.Like Page Authority, the Semrush version of Domain Authority is Authority Score. As you’ve learned, Authority Score grades the overall quality of a website or webpage on a logarithmic scale from zero to 100. The higher the domain score, the more likely Google will trust it as an authority.Using AI and machine learning, Authority Score measures a domain’s authority, and is based on three facets: Link power: Quality and quantity of backlinks (links from other websites that point to yours) Organic traffic: Estimated monthly average of organic search traffic Spam factors: Indicators of a spammy vs. natural link profileTo view your website’s Authority score, use the Semrush Project Dashboard.Using the brand Girls Who Code as an example, here’s what the dashboard looks like:And here’s how to set up your own dashboard:First, click the “Create project” button under the “My Projects” section.A box will then pop up. Enter your website’s domain, enter an optional project name (such as the name of your business or website), and click “Create project.”Now, you’ll see a dashboard. Under “Domain Analytics” on the top left, you’ll see your site’s Authority Score (or Domain Authority) and performance trend compared to the last 30 days.You’ll also see other helpful metrics like “Organic Traffic,” “Organic Keywords,” “Paid Keywords,” and “Ref. Domains.” Page Authority vs. Domain AuthorityPage Authority is similar to Domain Authority because it focuses on link power, organic traffic, and spam factors. However, Page Authority focuses on a single page URL, while Domain Authority focuses on the overall domain. In Semrush, Authority Score is a compound metric that evaluates a webpage or domain’s quality with a score from zero to 100. What Is Link Authority?Link authority, or backlink authority, is a backlink's ranking power. It measures a link's ability to influence the authority of the page it’s pointing to. High-quality backlinks from reputable websites are the most coveted. They strongly influence your website’s credibility by passing link equity, like a vote of confidence. Backlinks also help improve the potential ranking strength of the linked page.To analyze the impact of backlinks for your own domain or for your competitors, use the Backlink Analytics tool again. Study backlink profiles and make comparisons between multiple domains.Use this tool as a starting point for your competitive research. Enter your competitor’s domain and click “Analyze.” You’ll then see an overview of the domain’s link profile.Collect insights on competitors' most recent backlinks, the size of their overall backlink profile, and referring domains.For a detailed look at who’s linking to your competitor, go to the “Backlinks” tab. Here, you can see the specific backlinks, their Authority Scores, anchor text, and more.Improve and Analyze Page AuthorityThere are many ways you can work on improving your Page Authority score, from higher-quality content that meets search intent to building a strong backlink profile. As you work to improve the authority of your webpages and overall domain, use tools like Backlink Analytics. Knowing your Authority Score helps you understand and analyze Domain Authority, Page Authority, and backlink quality so you know the strengths of your website and areas of improvement. Try Backlink Analytics for free as your go-to Page Authority checker. Gain insights into your backlink profile and how links may affect your website.",
  "headers": [
    {
      "level": "H1",
      "text": "Page Authority: What It Means in SEO and How to Improve Your Score"
    },
    {
      "level": "H2",
      "text": "What Is Page Authority?"
    },
    {
      "level": "H2",
      "text": "What Is the Difference Between PageRank and Page Authority?"
    },
    {
      "level": "H2",
      "text": "How Is Page Authority Determined?"
    },
    {
      "level": "H2",
      "text": "What Is a Good Page Authority?"
    },
    {
      "level": "H2",
      "text": "How to Improve Page Authority"
    },
    {
      "level": "H3",
      "text": "Age and Trust"
    },
    {
      "level": "H3",
      "text": "Popularity"
    },
    {
      "level": "H3",
      "text": "Freshness of the Last Update"
    },
    {
      "level": "H2",
      "text": "Why Did Your Page Authority Change?"
    },
    {
      "level": "H2",
      "text": "The Three Levels of Authority"
    },
    {
      "level": "H2",
      "text": "What Is Domain Authority?"
    },
    {
      "level": "H2",
      "text": "Page Authority vs. Domain Authority"
    },
    {
      "level": "H2",
      "text": "What Is Link Authority?"
    },
    {
      "level": "H2",
      "text": "Improve and Analyze Page Authority"
    }
  ],
  "author": ""
}