{
  "url": "https://www.semrush.com/blog/pillar-page-examples/",
  "slug": "pillar-page-examples",
  "title": "9 Pillar Page Examples (And How to Make Yours Just as Great)",
  "description": "Learn why these pillar page examples stand out. And get tips for your own pillar page creation efforts.",
  "content": "What Is a Pillar Page?A pillar page is a webpage that offers an extensive overview of a broad topic.It’s called a “pillar” page because it provides foundational knowledge of the topic. Which other pages called “cluster pages” will expand upon while covering relevant subtopics.The pillar page also links to the cluster pages—and vice versa—to help readers broaden their knowledge of the overall topic cluster.Like so:This way, readers can learn more about the main topic as a whole. No matter whether they started by reading a pillar page or a cluster page.Let’s look at three types of pillar pages you can create, along with some of the best pillar page examples.Types of Pillar PagesThere are three broad categories of pillar pages: “Guide” pillar pages aim to provide an overall guide to a topic. They may answer general questions like “What is [topic],” “How does [topic] work,” “How can you get started with [topic],” and “What are tips for doing [topic].” “What-is” pillar pages focus on defining a topic and providing its background context. For example, apart from answering the question “What is [topic],” a what-is pillar page may also explain how the topic’s underlying concepts were derived. Or, the history behind it. “How-to” pillar pages explain how to do something in relation to the topic. They often include step-by-step instructions. How-to pillar pages may also include diagrams and videos to facilitate the discussion.There is some overlap between each pillar page type.For example, guide pillar pages often include explanations of “what is” and “how to.” Which “what-is” and “how-to” pillar pages respectively also cover—though usually in more detail.So, we recommend not getting hung up on forcing your content into any one pillar page type.Instead, focus your efforts on finding keywords worth creating pillar pages for—and building high-performing content pillars around.How to Find Pillar Page KeywordsSemrush’s Keyword Magic Tool can help you find broad keywords for pillar pages.Launch the tool and type a broad keyword related to your niche into it. Select the country from which you want to see results, then click “Search.”You will get a list of potential pillar page keywords.In this example, the Keyword Magic Tool suggests keywords like: Meditation: Could be the keyword for a guide pillar page on meditation Meditation music: Could be the keyword for a guide pillar page on meditation music How to meditate: Could be the keyword for a how-to pillar page explaining how to meditateYou can also refine the keyword list using the filters at the top of the tool.For example, select “Broad Match” to see keywords that are variations of your initial keyword.And click the “Questions” tab to get keywords in the form of questions. Like: How to meditate: Could be the keyword for a how-to pillar page explaining how to meditate (as mentioned earlier) What is meditation: Could be the keyword for a what-is pillar page explaining what meditation is. And how the practice came about. What is transcendental meditation: Could be the keyword for a what-is pillar page explaining the concept of transcendental meditationFinding Pillar Page Subtopics for Cluster PagesAfter creating your pillar page, build cluster pages on relevant subtopics.Doing so creates a topic cluster. Which helps your website become the one-stop, go-to resource for information on your niche.In turn, getting you more eyeballs on and backlinks to your website. And potentially boosting your traffic and rankings.Get ideas for pillar page subtopics by researching keyword clusters in Semrush’s Keyword Overview tool.Enter your pillar page keyword into the tool and select “US” as the database from which you want to get results. Then click “Search.”NoteOnly the United States database can provide keyword cluster data at this time.Scroll down the “Overview” page and click “View all clusters” to get keyword clusters for your pillar page keyword.The tool will display the keyword clusters in a new browser tab. Make a note of those that look like good pillar page subtopics.Semrush’s Topic Research tool can also help you generate a list of pillar page subtopics.Launch the tool and type your pillar page keyword into the search bar. Select the country from which you want to see results, then click “Get content ideas.”You’ll see various cards with related topic ideas for your pillar page keyword. Along with the search volume for their associated keywords.Click any card to learn: The headlines of articles others have written about this related topic The questions people have been asking about this topic Related searches for the topicAll of these can provide inspiration for pillar page subtopics.9 Top Pillar Page ExamplesLet’s look at nine outstanding examples of pillar pages—three from each pillar page type—worth taking notes from as you create your own.Examples of Guide Pillar Pages1. “A First-Time Owner’s Guide to Caring for a New Puppy” by PetcubeThis guide pillar page provides essential information that first-time owners should know about getting a puppy, like: How to choose a puppy How to puppy-proof their home Types of puppy supplies they’ll need Basic puppy training commands Common new puppy owner mistakesEach page section includes links to other articles with more detailed information on related topics:And at the bottom of the page are answers to frequently asked questions (FAQs) on puppy ownership.The page also includes photos of cute puppies!These photos catch the reader’s eye. And entice them to continue reading.In any case, readers will know the page will take them roughly 11 minutes to read. As seen from the page’s estimated read time:Which in turn gives them an idea of the page’s comprehensiveness beforehand.Main takeaways: Provide answers to FAQs on your pillar page. These answers can also appear as the answers to the “People Also Ask” (PAA) questions on Google’s search engine results pages (SERPs)—and get great visibility there. Seventy-five percent of PAA results are found within the top three results on the SERPs, according to our 2020 PAA SEO study. Include images to make your page more visually interesting. And hold readers’ attention for longer. (But since images generally have larger file sizes, compress them. So they don’t take too long to load.) Display your pillar page’s estimated read time to let readers know how long they may need to read it in full. And help them decide whether your page provides the level of detail they’re looking for.2. “Guide to Pottery Techniques: Everything You Need to Know” by GatheredGathered collaborated with expert potter Katrina Pechal to produce this guide pillar page on pottery-making.A table of contents at the top of the page tells readers what they can learn from it:And each table of contents heading is a jump link that leads visitors to its respective content section when clicked.Sprinkled throughout the page are images and video embeds that help illustrate various pottery techniques:The page also recommends places where budding potters can access materials and kilns. To start making their own ceramics.Main takeaways: Include insights from experts in your pillar page. To increase the value the page offers to readers. Especially if you aren’t a specialist in the topic yourself. Add jump links—also known as anchor links—to help readers easily skip to the topics on the page they’re more interested in Illustrate concepts using images and videos if these help get the point across more easily than text explanations3. “Rock Climbing Basics: Getting Started” by REI Expert AdviceREI’s guide pillar page on rock climbing basics breaks down the process of getting started with the sport in five steps.The page summarizes these steps in the introduction, with jump links to their respective discussions on the page. And it includes a link to a handy glossary for readers unfamiliar with rock climbing terms.The discussion on rock climbing gear links out to dedicated gear guides for readers to learn more about each item:REI has also taken steps to improve its page’s credibility.The page links to other authoritative websites on rock climbing, like the American Mountain Guides Association and the Professional Climbing Guides Institute.And at the bottom of the page are the biographies of its author and contributing expert. Which talk about their rock-climbing experience.While at the top, you’ll see that the page has gotten hundreds of reviews—leading to an overall positive review of four out of five stars.This acts as social proof that many others have found the guide useful. Suggesting that you will, too.Main takeaways: Link to a glossary if your pillar page contains technical terms readers may not understand Signal your page’s credibility by linking readers to other authoritative websites on the topic. And highlighting the page author’s experience, expertise, authority, and trustworthiness (E-E-A-T). Finally, incorporate elements of social proof, like user reviews and testimonials.Examples of What-Is Pillar Pages4. “Local SEO: What Is It & How to Do It” by SemrushThis what-is pillar page defines local SEO at the outset to fulfill the search intent for its “what is local SEO” target keyword right away.Without making users read fluffy, filler introductions.After explaining what local SEO is, the page goes into related topics that people interested in local SEO may also want to know. Like: Why local SEO is important How local SEO works How to do local SEO Local SEO toolsThe page puts these topics in a “sticky” table of contents that stays in place even as the reader scrolls down. To help the reader conveniently jump to different sections from any part of the page.The page uses short paragraphs to improve readability.And it includes “Further reading” links at the end of certain topic sections. So users can learn more about these topics.The page also demonstrates how readers can use Semrush’s tools to improve their local SEO.Which drives awareness of them. And encourages account sign-ups.Main takeaways: Define the subject of your what-is pillar page at the start of it. Don’t bury this explanation further down the page or make it difficult to find. After defining the subject, provide readers with related information they may find useful. Both on the pillar page and via the relevant resources you’ve linked to. If the page features your products or services, show how these can solve the reader’s pain points. Instead of merely listing their features.5. “What Is Engineering?” by Live ScienceThis page by Live Science explains what engineering is. Starting from a broad overview of engineering as a concept, followed by breakdowns of different types of engineering.The page also links to guides to each engineering type for users to read more about them.Live Science’s main target audience is laypeople interested in science. And some people in this audience may be aspiring engineers.So, Live Science’s what-is pillar page provides information on the qualifications they’ll need to become one. Plus, the work environments and salaries they can expect.Live Science rounds off its pillar page with extra resources for studying engineering or working in that field. To help potential future engineers with their career goals.Main takeaways: When explaining a topic spanning many subtopics, provide a broad definition of it first—before defining its various subtopics Know your target audience. So you can provide relevant information catering to their wants and needs6. “What Is Fast Fashion and Why Is It So Bad?” by Good on YouGood on You’s pillar page gives readers an in-depth look into fast fashion. With the aim of furthering its goal to stop the practice.The page first explains what fast fashion is for readers new to the concept. It then provides background information on fast fashion’s evolution over time for greater context.And it shares tips for spotting fast fashion brands in list form for easy reading.Good on You also displays especially compelling information on fast fashion as large block quotes. So they catch the reader’s attention. And keep them hooked.The organization links to other articles on its website for readers to learn more about the concepts it has discussed.And the page ends by providing resources for readers who want to know how they can help stop the fast fashion trend.These resources include: Other related articles on sustainable fashion (which is the opposite of fast fashion) Recommendations of sustainable clothing brands readers can shop withMain takeaways: Format your content in a way that helps hold the reader’s interest. Like using block quotes to emphasize quotes or key points. And lists to present information in bite-sized chunks. Tell readers what they should do after reading your page. This could be reading other resources you’ve linked to. Or checking out your product or service.Examples of How-to Pillar Pages7. “How to Start a Business in 15 Steps” by NerdWalletNerdWallet’s pillar page lists the 15 key steps for starting a business.Each step consists of: A clear, descriptive heading. Phrased as an action readers need to take. A concise discussion on the topic Links to other pages. For readers to learn more about different aspects of the topic.The page orders the steps logically—they’re in the sequence readers will need to follow to get their business off the ground.A table of contents at the top helps readers jump to certain steps. Instead of scrolling and reading the page in full.But listing all 15 steps can make the page look too intimidating to read. And crowd out the page’s main content.So, the table of contents shows only the first five steps. Before hiding the rest with a “Show More” link.Main takeaways: Phrase some of your how-to pillar page headings as actions. Like “Sign up for an account” instead of “Why you need an account.” So readers know what they need to do to achieve their objective. Present the steps in your how-to pillar page sequentially. Starting from the very beginning. Then, building upon what readers have done in previous steps.8. “How to Record a Podcast (It’s Easier Than You Think!)” by The Podcast HostThe title of this how-to pillar page on recording a podcast includes the phrase “It’s Easier Than You Think!”To reassure readers that recording a podcast isn’t difficult. In case they’ve never done it before and think the process will be tough.The page then covers three main aspects of podcast recording—planning, equipment, and software.Apart from providing explanations in text form, the page includes a YouTube video on the same subject. To cater to visual learners.Throughout the page’s contents are links to guides that cover certain topics in more detail.After covering the main topic of how to record a podcast, the page gets into related topics. Like: How to record a podcast in the same room as your guest Whether you can add music and sound effects to your podcast recordingMain takeaways: Make your pillar page title compelling and click-worthy. Use power words and phrases that appeal to emotions, like “It’s Easier Than You Think!,” “Free,” and “Tried-and-Tested.” Answer questions related to your how-to pillar page’s main topic. To address other concerns readers may have.9. “How to Plan a Wedding” by BridesBrides has put together a list of 44 bite-sized tips for couples wanting to plan their wedding.Each tip is numbered “# of 44” to help readers know how far along they’ve gotten on the page. Especially since the list is long.The tips include links to related articles.There’s also an infographic with Brides’ top five wedding planning tips to summarize the essential things couples should know about planning a wedding. In a visually appealing way, too.And notice how Brides states the date it updated the page:This way, readers know when the page was last updated. Which can instill confidence in its freshness, relevance, and usefulness if it had been updated recently.Main takeaways: Give readers a sense of their progress through the discussion to motivate them to read to the end. Like how Brides has marked its tips as “# of 44.” Or adding a progress bar to the top of the page. Use custom infographics and diagrams to add color to your pillar page. And explain concepts more visually. Provide your pillar page’s last-updated date. To signal to readers how current its discussion is.Start Creating Your Own Pillar PagesAdopt the best practices from these pillar page examples to make your own pillar pages just as valuable.Tools like Keyword Magic and Topic Research can also help you find the right keywords and topics for your pillar pages and cluster pages.Try them for free by signing up for a Semrush account.",
  "headers": [
    {
      "level": "H1",
      "text": "9 Pillar Page Examples (And How to Make Yours Just as Great)"
    },
    {
      "level": "H2",
      "text": "What Is a Pillar Page?"
    },
    {
      "level": "H2",
      "text": "Types of Pillar Pages"
    },
    {
      "level": "H2",
      "text": "How to Find Pillar Page Keywords"
    },
    {
      "level": "H2",
      "text": "Finding Pillar Page Subtopics for Cluster Pages"
    },
    {
      "level": "H2",
      "text": "9 Top Pillar Page Examples"
    },
    {
      "level": "H3",
      "text": "Examples of Guide Pillar Pages"
    },
    {
      "level": "H4",
      "text": "1. “A First-Time Owner’s Guide to Caring for a New Puppy” by Petcube"
    },
    {
      "level": "H4",
      "text": "2. “Guide to Pottery Techniques: Everything You Need to Know” by Gathered"
    },
    {
      "level": "H4",
      "text": "3. “Rock Climbing Basics: Getting Started” by REI Expert Advice"
    },
    {
      "level": "H3",
      "text": "Examples of What-Is Pillar Pages"
    },
    {
      "level": "H4",
      "text": "4. “Local SEO: What Is It & How to Do It” by Semrush"
    },
    {
      "level": "H4",
      "text": "5. “What Is Engineering?” by Live Science"
    },
    {
      "level": "H4",
      "text": "6. “What Is Fast Fashion and Why Is It So Bad?” by Good on You"
    },
    {
      "level": "H3",
      "text": "Examples of How-to Pillar Pages"
    },
    {
      "level": "H4",
      "text": "7. “How to Start a Business in 15 Steps” by NerdWallet"
    },
    {
      "level": "H4",
      "text": "8. “How to Record a Podcast (It’s Easier Than You Think!)” by The Podcast Host"
    },
    {
      "level": "H4",
      "text": "9. “How to Plan a Wedding” by Brides"
    },
    {
      "level": "H2",
      "text": "Start Creating Your Own Pillar Pages"
    }
  ],
  "author": ""
}