{
  "url": "https://www.semrush.com/blog/pinterest-seo/",
  "slug": "pinterest-seo",
  "title": "Pinterest SEO: 7 Tips to Boost Your Reach & Drive More Traffic",
  "description": "Using Pinterest SEO can help increase your brand awareness and drive more traffic to your website.",
  "content": "What Is Pinterest SEO?Pinterest SEO is a set of practices to make your profile and content more visible on Pinterest. With the goal of driving more traffic to your website.It involves optimizing your Pinterest content, like Pins and boards, using keywords and high-quality images, along with optimizing your profile.Here’s what content looks like on Pinterest:Note the link attached to the pin—if users click that, they’ll be taken directly to the link you add to your pin.If users click on the image, they are taken to a page with more information about your pin. Where they’ll also see the link you add. Usually to your website, blog post, or landing page.Which is why Pinterest SEO and ranking well on Pinterest is crucial for business owners who want to gain an extra source of traffic.Traffic that could turn into new customers and sources of revenue.Why Pinterest SEO Is ImportantTo better illustrate the importance of Pinterest, let’s take a look at a Pinterest profile named “Life Is Messy and Brilliant.”They have 144.8K followers on Pinterest and 2.9 million monthly profile views. That’s a lot of views that could potentially translate into website traffic.According to Semrush’s Traffic Analytics tool, over a third of this website’s traffic comes from Pinterest.Pinterest can therefore serve as a valuable traffic source for your website. Diversifying where your website visitors come from can reduce your reliance on a single source, like Google.Pro tipYou can use the Traffic Analytics tool to find out how much of your competitors’ website traffic comes from Pinterest. 7 Ways to Boost Your Reach with Pinterest SEOHere are 7 tips to help you turn Pinterest into a major source of traffic for your website:1. Set Your Pinterest Account up for SuccessBefore we get into optimizing your content, you need to optimize your Pinterest account. Here are a few ways you can do that:Create a Pinterest Business AccountA free Pinterest business account gives you access to the Pinterest Business Hub. Where you can create ads and monitor your Pins’ performance. It comes with two free tools: Pinterest Analytics: To get insights about your Pins’ engagement and see how people interact with your content Pinterest Ads Manager: Where you can create, manage, and report on Pinterest ad campaignsPlus, you can create different content types, like rich Pins. These are Pins with information pulled directly from your website. Ideal for recipes, articles, and product-focused pins (more on them later).If you already have a personal account, you can switch to Pinterest Business by choosing the “Convert to business” option from the side menu:If you’re starting from scratch, you can create a new business account, instead:Now that you have your business account, it’s time to optimize your profile.Optimize Your ProfileYour profile has four main parts: Your profile name Your description Your username Your websiteHere’s what that looks like on Pinterest:Note that the profile name, username, and website are all consistent.You have to optimize all four to tell Pinterest what your business and account is all about.To edit your profile, click the icon beside your profile picture. Then click “Settings.”The first page you’ll see is the “Edit Profile” page. Now, let’s start optimizing.NoteAt this stage, don’t worry about keywords yet. Simply enter information about your brand. We’ll get into Pinterest keyword research later in the article.To optimize your profile name, we recommend going with your brand name and a short description of what you do or offer.Live Eat Learn’s profile name is “Live Eat Learn | Vegetarian Food Blog.” That way, anyone who sees their page knows exactly what they do.Next, fill out the “about” section. Explain who you are and what your company offers (in 500 characters or fewer).For example, YEABUCHA, a kombucha brewing company, uses words like “home brew kombucha kits,” “elderberry syrup,” and “recipes” in their description.These are all products or guidance that they offer. But they’re also likely keywords they’re targeting too.Then, add your website into the space provided.Lastly, use your brand (or a variation) as your username. Keeping this consistent across your channels is key for building brand awareness. Your username will also show in your Pinterest profile URL.2. Claim Your WebsiteLinking your website to your Pinterest account does a few things: It allows you to get valuable insights about how your content is shared It shows people your profile when they save Pins with content from your websiteWhen you claim your website, your profile picture and profile link appear on all Pins associated with your website and brand. This lets you benefit even further from your audience sharing your content.There are three ways to claim your website: Adding an HTML tag Uploading an HTML file Adding a DNS TXT recordFor all three methods, you first need to click the icon next to your profile picture. Then click “Settings.”In the left-hand navigation, click “Claimed accounts.”Next to “Websites” click “Claim.” You’ll see a popup with the three options. Choose whichever one suits your setup best.Once you’ve claimed your website, you should see it in the “Websites” section of the “Claimed accounts” page.Pro tipYou can also add snippets of code to your website (or plugins if you use a CMS like WordPress) that let people instantly save images on your site to their Pinterest boards with a “Save to Pinterest” button.3. Conduct Keyword ResearchMuch like traditional organic SEO, Pinterest SEO has its foundations in keyword research.You need to optimize your boards and Pins for the terms your target audience is searching for. But first you need to know what terms you want to target.Pinterest as a Search EnginePinterest is a search engine in its own right, and you can take advantage of that to perform keyword research right within the platform itself. To do this, simply enter a broad keyword related to your business into the search bar.You’ll see other (often longer) phrases related to the term you provided. Here, you can find more specific ideas for your Pins that relate to your primary topic.In the example above, some popular suggested search terms relate to ideas for bullet journal pages. This could be a great idea for a series of Pins or an entire board dedicated to the topic.How to Choose Which Keywords to TargetAs with standard keyword research for a blog or website, you need to choose which keywords you target wisely. It may be tempting to go for the broad keywords, such as “bullet journal.” But you’re going to be competing with lots of other accounts. Many of which may be well established on the platform.So, it’s often best to target long-tail keywords first. Long-tail keywords are more specific search terms that typically have lower search volumes. But because these search terms are so specific, it’s often easier to know what content to create (in this case Pins) to really nail the search intent and cater to exactly what the searcher is looking for. For example, take these search results for the term “bullet journal” (a broad keyword):There is a lot of variety in terms of the specific pins that show. Some are for sleep trackers, others for money trackers. Some cater to beginners, while some are generic lists of ideas for inspiration.Compare that to search results for “bullet journal weekly spread” (a long-tail search term):You’ll see almost all of the top results contain the term “weekly spread” and so they are tightly related to the search term.If you target the broader term, you might reach a wider audience if you manage to rank highly. But optimizing for more specific keywords may make it easier to rank in Pinterest search results. And you might be able to better cater to what the searcher is looking for, improving engagement and possibly driving more targeted traffic to your website.Now that you know what terms to target, it’s time to start optimizing your Pinterest content.4. Create Relevant Board Names to Make Them DiscoverableWhen naming your Pinterest boards, simplicity is key. Stick to primary keywords or key phrases. This helps with discoverability and conveys exactly what the board is about, which makes for a better user experience.Here’s an example of a board from a company offering hand-painted wall art:“Living Room Wall Art Ideas” and “Acrylic Paintings” are both primary keywords related to this business. The former is a long-tail keyword and highly specific, while the latter is shorter and broader. Importantly, both are also relevant to what the board contains.It’s smart to nest a specific, long-tail keyword next to a more competitive one. This way, Pinterest has an easier time understanding which search terms it may be relevant to, and your audience knows exactly what they’re getting when they click through to it.This can lead to better engagement (like comments and shares). And potentially more traffic to your website.5. Optimize Your PinsYour Pin’s title is one of the first things Pinterest users see. It needs to capture attention, describe exactly what’s in the Pin, and include keywords for SEO:Avoid stuffing keywords for the sake of SEO. Aim to naturally fit your keyword in, so it appears unique and relevant, rather than robotic.Here are some important steps to keep in mind while optimizing titles and descriptions for your Pins:Prioritize the First 30 Characters in the TitleWhile you can include up to 100 characters, your title may get truncated in users’ feeds after around 30 characters (although up to 50 or more may show on desktop). So it’s best to include the most important keywords at the beginning of your Pin’s title.For example, the author of this vegan chocolate cake recipe placed the most important terms, “vegan” and “chocolate cake” at the start of the title in this feed:They also added extra words like “best” and “the easiest” to spark curiosity, invite people to click on the pin, and eventually check out the recipe on their website.Highlight Uniqueness in the DescriptionWhat can you say in a few sentences to draw people to the product or article in your Pin? What unique aspects can you highlight to stand out and resonate with your target audience?Including these details helps you connect with users and give them a reason to click through to your website.Australian Natural Soap Company does this well:Their description has three prominent elements: A question: Starting with a question can draw people’s attention and instantly connect with the problem your audience experiences. Here, they relate to the trouble of finding the right skin care products. Descriptive adjectives: Use strong, descriptive language to amplify the problem and paint the picture inside the reader’s head. Here, the company refers to the high costs of finding appropriate skin care products for demanding skin types. Call to action: Invite people to learn more about your product or service that’s linked to the pin. Here, the company achieves it by inviting you to “say hello” to their products.Most Pinterest beginners struggle to craft a strong description for their Pins. They either repeat keywords from the title or use generic descriptions of their content.Make sure your descriptions are relevant, speak directly to your target audience, and naturally fit keywords in. All while making it clear why a user should click through to your website.Don’t Repeat Titles in Descriptions Think of the description as an opportunity to add more relevant keywords to your Pin. If you write a good description, the audience will get more information about the content. Helping them make the decision to click your link.Both Pinterest and your audience rely on titles and descriptions to understand what your content is about and how much value it provides. Avoid just using exactly the same keywords in your Pin’s description as you do in its title. Instead, use each field to highlight different aspects of your Pins, better address your audience's search intentions, and help them decide if your content is what they're looking for.For example, see how this Pinner uses different text in the Pin title compared to the Pin description:The title is well optimized for a target term like “fudgy vegan chocolate cake.” And the description adds to this by including related keywords like “chocolate cake recipe” and “chocolate frosting.” It also naturally includes the word “vegan” again.These keywords provide context for the Pinterest search engine. And also for users to understand if this recipe is right for them. Doing both of these things well with your own Pins will increase your chances of success on the platform.Use the Right FormatsFinally, here are some quick ways to optimize the images you use in your Pins (based on Pinterest’s guidance for advertisers): Stick to an aspect ratio of 2:3, ideally going for 1000 x 1500 pixels Upload images as JPEG or PNG files Keep them to 20 MB at most on desktop (32 MB on the app) For video pins, Pinterest recommends sticking to square videos, or aspect ratios of 2:3, 4:5, or 9:16 Upload videos as .mp4, .mov, or .m4v files up to 2 GB (maximum of 15 minutes)Pro tipYou can also add alt text to your Pins to make your images and videos more accessible.6. Find and Jump on Pinterest TrendsPinterest Trends shows you in real-time what Pinners across different regions or countries are searching for. You can take advantage of this by optimizing your content for the top search terms to potentially improve your content’s discoverability.Here’s how:Say you own a cooking blog and want to bring more visitors to your website via Pinterest. First, visit Pinterest Trends and choose the country or region you want to optimize for.Scroll down to see the top trends in your region for the month.On the right-hand side, you’ll see trends from all the categories. Using the panel on the left, you can narrow your search by filtering via: Trend type Interests Keywords Age GenderFor example, if you want to see the trending recipes for a culinary blog, you can filter for “Food and Drinks” from the interest section, and type “recipe” in the keywords section. Here are the results:As it’s currently spring at the time of writing this article, seasonal recipes are trending. A food blogger might want to focus on spring or summer recipes to take advantage of the increased search demand.But it’s important to bear in mind that chasing trends like this can be difficult and resource intensive. And it's hard to predict how long a trend will last. So, only jump on trends that are related to your business and that you think are worthwhile creating Pins for.7. Create Rich PinsRich Pins automatically sync information from your website to your Pins. This feature is available after you set up a business account and claim your website, so make sure you’ve done that first.There are three types of rich Pins:Recipe Rich PinsThese are perfect for cooking blogs and recipe sites.Here’s everything you can add to your recipe rich Pins: Title Serving size Cooking time Ratings Diet preference List of ingredientsA rich Pin for a recipe looks like this:Article Rich PinsArticle rich Pins are ideal for bloggers of all kinds.This rich Pin can include a: Headline or title Description of the article Author of the article or blog postArticle rich Pins can often look like regular pins. But the benefit from the Pinner’s perspective is that it pulls the information in automatically and dynamically.Product Rich PinsFinally, product rich Pins include the most up-to-date information about your product, like: Pricing Availability Product title Product descriptionRich Pins are a great way to add more helpful details to your Pins for users, without having to manually update them as things change.Streamline Your Pinterest SEO StrategyUse these best practices to strengthen your Pinterest SEO strategy. This can lead to more eyes on your content, allow you to reach a wider audience, and get more people to click through to your website. Posting high-quality, relevant Pins on a consistent basis is key. Automate this process using the Social Poster, part of Semrush Social.Head to the tool and connect your Pinterest profile. Click “All profiles” > “Add profile” > “Connect Pinterest” and then follow the instructions to link your account. Then, select the “+” button on the day for which you want to schedule your Pinterest post.Fill out your Pin’s details, select a time to post it, and then click “Schedule” when you’re ready. Make sure to add a link if you want to use this Pin to drive traffic to your website.This can save you time when posting your Pins on a regular basis. All while still benefiting from the traffic potential and even rich Pins.Access the Social Poster—along with the ability to easily compare your metrics to competitors—as part of Semrush Social.",
  "headers": [
    {
      "level": "H1",
      "text": "Pinterest SEO: 7 Tips to Boost Your Reach & Drive More Traffic"
    },
    {
      "level": "H2",
      "text": "What Is Pinterest SEO?"
    },
    {
      "level": "H2",
      "text": "Why Pinterest SEO Is Important"
    },
    {
      "level": "H2",
      "text": "7 Ways to Boost Your Reach with Pinterest SEO"
    },
    {
      "level": "H3",
      "text": "1. Set Your Pinterest Account up for Success"
    },
    {
      "level": "H4",
      "text": "Create a Pinterest Business Account"
    },
    {
      "level": "H4",
      "text": "Optimize Your Profile"
    },
    {
      "level": "H3",
      "text": "2. Claim Your Website"
    },
    {
      "level": "H3",
      "text": "3. Conduct Keyword Research"
    },
    {
      "level": "H4",
      "text": "Pinterest as a Search Engine"
    },
    {
      "level": "H4",
      "text": "How to Choose Which Keywords to Target"
    },
    {
      "level": "H3",
      "text": "4. Create Relevant Board Names to Make Them Discoverable"
    },
    {
      "level": "H3",
      "text": "5. Optimize Your Pins"
    },
    {
      "level": "H4",
      "text": "Prioritize the First 30 Characters in the Title"
    },
    {
      "level": "H4",
      "text": "Highlight Uniqueness in the Description"
    },
    {
      "level": "H4",
      "text": "Don’t Repeat Titles in Descriptions"
    },
    {
      "level": "H4",
      "text": "Use the Right Formats"
    },
    {
      "level": "H3",
      "text": "6. Find and Jump on Pinterest Trends"
    },
    {
      "level": "H3",
      "text": "7. Create Rich Pins"
    },
    {
      "level": "H4",
      "text": "Recipe Rich Pins"
    },
    {
      "level": "H4",
      "text": "Article Rich Pins"
    },
    {
      "level": "H4",
      "text": "Product Rich Pins"
    },
    {
      "level": "H2",
      "text": "Streamline Your Pinterest SEO Strategy"
    }
  ],
  "author": ""
}