{
  "url": "https://www.semrush.com/blog/ppc-keyword-research/",
  "slug": "ppc-keyword-research",
  "title": "How to Do PPC Keyword Research for Your Ad Campaigns",
  "description": "Learn how to do PPC keyword research to find the most profitable keywords for your ad campaigns.",
  "content": "Pay-per-click (PPC) advertising on Google and Bing relies heavily on PPC keyword research.In this article, you’ll learn how to select the right keywords to get your marketing campaigns in front of the highest number of potential customers.PPC Keyword Research: 3 Key ConsiderationsThe success of a PPC campaign depends on several factors, including the keywords used. To maximize your results, consider the following aspects when doing keyword research for PPC. 1. Search IntentYour target search terms and search intent should align with your campaign goals.Together, these two factors determine the number of impressions and clicks your ad might receive based on the search ad algorithm. They also play a role in your cost per click (CPC).Search intent indicates the type of search a user is performing. It’s generally grouped into four categories: Informational: The user wants to learn more about a topic or product Navigational: The user wants to find a specific website, page, or location Commercial: The user wants to research specific services, products, or brands Transactional: The user wants to take action, like make a purchaseUse Semrush’s Keyword Overview to find a keyword’s search intent. Click “SEO” > Keyword Research” > “Keyword Overview” from the left-hand navigation of your Semrush tool dashboard. Then, enter your keyword, select the target location, and click “Search.”You’ll see the search intent of your chosen keyword in the default “Overview” report that appears.Keywords with more commercial or transactional intent tend to generate more conversions. The explanation is simple: Visitors with transactional intent are closer to making a purchase when they see and click on your ad.So, if they search for “life jackets,” they’re probably shopping for one. Basically, they’re ready to buy. You just need to give them that final push to take action. On the other hand, those searching for “swimming safety” or similar terms are probably looking for information. At this point, their intent is informational and not transactional—so they’re less likely to purchase right away. What you should do is give them the information they need to move further down the sales funnel.Further reading: ToFu, MoFu, BoFu: A Practical Guide to the Conversion FunnelSearch intent is also important because of Google’s Quality Score guidelines.According to Google Ads documentation, Quality Score is “a diagnostic tool meant to give you a sense of how well your ad quality compares to other advertisers.”It’s a score from 1-10 Google assigns to your ads based on three factors: Expected click-through rate (CTR): How likely it is that a user will click on your ad based on the ad copy and keyword targeting Ad relevance: How closely does your ad matches the search intent Landing page experience: Your website layout, performance, and overall experienceA higher Quality Score means your ad is more likely to appear toward the top of the search engine results page (SERP). Your Ad Rank score is largely determined by your Quality Score and ad relevance. Which means you’ll pay less for each click.This is why it’s important to choose keywords with search intent that aligns with your offer.2. Search VolumeSelect keywords with a high search volume and search intent that aligns with your campaign goals and your budget.This helps to increase your clicks and conversions.Search volume is a metric that estimates the number of times users search for a given keyword (or related keywords) over a certain period of time (usually monthly).You can check the search volume of a keyword in the Keyword Overview tool (as well as Google’s Keyword Planner).For example, in Keyword Overview, “life jackets” has an estimated monthly search volume of 18,100.Your ad appears when users search one of your targeted keywords. The search volume of the keywords you select determines how often your ad can display to users. This is called impressions.If your PPC ad shows up more often, then more users have a chance to click on it.There is, however, an inverse relationship between search volume and buying intent. Keywords with higher search volume tend to be more general and therefore have lower conversion rates.There are three categories of keywords: Head terms: Broad match keywords with high search volumes. They often consist of one or two words, like “shoes” or “life jackets.” Medium-tail: More specific keywords with good traffic. These usually consist of two to three words, such as “cheap business laptops” or “yoga health benefits,” and are more specific than broad match keywords. Long-tail: Detailed or specific keywords with lower search volumes. They often consist of three words or more, such as “women's blue running shoes” or “red life jackets for young children.”Broad match keywords are more generic than medium- and long-tail keywords. For example, search terms like “men’s shoes” or “hatha yoga” are not as specific as “men’s shoes size chart” or “hatha yoga classes near me.”Therefore, they tend to have a higher search volume and are more difficult to rank for. Which drives PPC costs up. 3. CPCWhen it comes to keyword PPC research, you’ll want to choose keywords that align with your marketing budget and campaign goals.The cost to run your PPC campaign is determined by the number of clicks your ads receive and the CPC.You can find the CPC of specific keywords with the Keyword Overview tool. For instance, the CPC of “life jackets” is $0.46.This is the amount you get charged each time a user clicks on your ad. Important: Consider the total amount you can afford to spend—including which specific keywords to bid on.Let’s say you have a budget of $100 per month to spend on ads. You might want to target keywords with a CPC of $0.50-$1 rather than $20 per click.Google Ads will determine where your ads appear in search results based on these factors. But that doesn’t mean you must pay an arm and a leg to get maximum visibility. Instead, optimize your copy and choose less competitive keywords. Ultimately, the best keywords for your campaign will generate a greater return on investment (ROI). Test higher CPC keywords to see how their conversion rate compares to lower CPC keywords. Why?Because it’s possible that the five clicks you receive from $20 search queries generate more conversions or revenue than 100 clicks on $1 ads.NoteYou can set budget and bid caps on your PPC advertising campaigns using platforms like Google Ads (formerly AdWords). So you won’t have to worry about going over budget if you target expensive keywords. Instead, you limit the number of impressions and clicks based on your budget.PPC vs. SEO Keyword ResearchPPC and SEO require keyword research and the process for both is similar. But the approach to evaluating and choosing keywords is often different. What makes a keyword “good”?SEO and content marketing are used to reach buyers throughout their purchase journey. So before they’re ready to buy, informational keywords may be in order. In line with the previous example, think “swimming safety,” “when to buy a new life jacket,” or “life jacket sizes.”PPC campaigns, on the other hand, generally use terms that drive immediate sales or conversions.But what is PPC keyword research in the first place? This process is all about identifying relevant keywords to bid on when running online advertising campaigns. For example, an online store selling water sports equipment may target keywords like “buy life jackets online” or “life jackets for children.” Digital marketing strategies usually include both SEO and PPC campaigns. Each one requires its own approach to optimization to ensure a high ROI.Wondering how to do keyword research for PPC on your own? Try this step-by-step approach.How to Do PPC Keyword ResearchStep 1: Brainstorm KeywordsDifferent keywords will yield different results in terms of advertising costs, campaign results, and visibility.With that in mind, start the PPC keyword research process by looking up relevant keywords. First, consider what you already know.What products or services do you sell?What other words might a searcher use to describe your products or services?Let’s go back to the “life jackets” example.You might come up with a list of keywords like: Life jackets Life vests Life preservers Floatation jacketsDon’t worry about identifying all of the possible modifiers at this stage. It would be impossible to brainstorm every keyword that’s relevant to your niche.These are just a starting point as you prepare for the next step.Step 2: Conduct Keyword ResearchUse your list of keywords to discover more keywords and conduct research. Head to the Keyword Magic Tool to find new keyword ideas. In the left-hand navigation, click “Advertising” > “Keyword Research” > Keyword Magic Tool.”Type in a keyword, enter your domain name, and click “Search.” NoteAdding your domain is optional, but we strongly encourage it. This way, Keyword Magic Tool can provide AI-driven keyword insights specific to your website.Keyword Magic Tool will return keyword suggestions based on your initial keyword. Review the list to find the best keywords that align with your PPC campaign’s goals.Consider factors such as: Search volume: Choose keywords that users search frequently. This ensures your ads have enough potential audience to justify your investment. Personal Keyword Difficulty (PKD%): Look for keywords where your site can easily rank, indicated by a lower PKD%. This score reflects how tough the keyword competition is for your domain to appear in the top 10 results of search engine results pages (SERP). CPC: Assess the expense for each click on your ads. Maximize your budget by opting for keywords that offer a good balance between cost and conversion potential. Competitive density: Look for keywords with fewer advertisers bidding. Lower competition can help you secure ad placements at reduced costs. Search intent: Prioritize keywords with commercial (researching products) or transactional (ready to purchase) intent. Which are more likely to lead to sales.Click the checkbox next to each keyword you consider useful for your campaign.NoteThere’s no need to select all of the misspelled versions of your keyword. Depending on your keyword match type, you’ll be able to target those specific keywords without adding them to your campaign. When you’re finished browsing through the suggestions, click “Add to keyword list” > “Create new empty list.” In the text box that appears, type a name for your list and click the green check mark.And that’s how you build a list of keywords you want to target. Add any further relevant keywords to that list, and later organize them by search intent, search volume, the ads they fit, and other criteria. Type the next keyword from your original list (step one) in the search box at the top of Keyword Magic Tool. Click “Search” and repeat the process for each of your target keywords.Now, it’s time to expand your search by analyzing competitor keywords.Step 3: Analyze Competitor KeywordsLearn what keywords other sites in your niche or industry are bidding on. These keywords could be valuable for your business, too.For this, we’ll use the Advertising Research tool.From the left-hand navigation, go to Advertising” > “Market Analysis” > “Advertising Research.” In the text box, type the URL of a competitor and click “Search.”TipNot sure what sites to research? Try typing keywords from steps one or two into Google search. See what sites advertise for the keywords you’re planning to target.You’ll see an Advertising Research report for the website you typed in. Which opens the “Positions” tab by default.Under “Paid Search Positions,” you’ll get a list of the keywords where the competing website’s ads appeared over a specific time period—such as 30 days. And each ad’s landing page URL.Review the keywords to see what might work for your campaign. Check any relevant keywords to export them into a separate document or spreadsheet. Like this:Repeat this process for other competing websites in your niche. To find more competitors, head to the report’s “Competitors” tab. Under “Paid Competitors,” you’ll see a list of websites the analyzed domain competes against in Google’s paid search results.TipAlso check your competitors’ ad landing pages and ad copy to see how they optimize for specific keywords. Head to the “Ads Copies” tab to view both. After you’ve analyzed relevant competitors, add their keywords to the list you created in step two. Here’s how.In the left-hand navigation, click “Advertising” > “Keyword Research” > “Keyword Strategy Builder”(previously Keyword Manager).Then, click on the name of the keyword list you created in Keyword Magic Tool in step two. Click “Add keywords.”Copy and paste the keywords from your competitive analysis into the box. Then click “Add keywords.”You should now have a fairly strong selection of relevant keywords to consider for your ad campaign. Step 4: Create a Final Keyword ListKeyword groups organize related terms and topics to give your PPC campaign structure.Now that you have a list of keywords, use PPC Keyword Tool to analyze your keywords and form them into ad groups. Open “Keyword Strategy Builder.” Find the name of the keyword list you created (steps two and three) and click on it.On the Keyword Strategy Builder page, click “Send keywords.” Select “All” and “PPC Keyword Tool.” Then, click “Apply.” If you see a window prompting you with a “Set up PPC Keyword Tool” button, click it.In the text box on the PPC Keyword Tool page, type the URL of your website—this will be the name of your PPC project. Click “Set up.”You’ll see the “Add keywords” window. Click “Manually.” Now, type one of your keywords into the text box—it doesn’t matter which one. Click “Add.”Click “Location.”Click the “Country” drop-down menu and select the country. If your ads target a specific region or city, select them from the relevant drop-down menus. Then click “Start PPC Keyword Tool.”Now, go back to the “Keyword Strategy Builder” page to send your keywords. At this point, you’ll get a prompt to “Send To PPC Keyword Tool.” From the drop-down menus, select the website project that you just created. Then, choose “Default campaign” and “Default group” under “Campaign” and “Group.” Click “Send keywords.”You should see a message that says “Successful.” Click “Go to PPC Keyword Tool.”Finally, click the URL of the website project you just created. You’ll see your full keyword list inside the PPC Keyword Tool.Step 5: Create Keyword GroupsOrganize your keywords into campaigns and ad groups to make it easier to track and manage your ad spend. Ad groups allow you to structure your PPC campaigns in a way that aligns closely with your marketing objectives. Ensuring each group targets a specific audience or theme.This strategic segmentation enhances your ad relevance and improves the efficiency of your spending.Use the PPC Keyword Tool to quickly create and adjust ad groups before you upload them into Google Ads.To add keywords to a new group from the “PPC keyword tool” page, click “+ Group” from the list on the left.In the text box, type the name of the new keyword group you’re creating, then click the check mark.Select the checkbox next to each keyword you want to add to this group.Click “Actions” > “Move to group.”Click the “Group” drop-down menu from the “Move keywords to group” window that appears. Then, click the name of the group where you want to move the keywords. Finally, click “Move to group.”Organize your keywords into groups that make it easy for you to track and manage them. For instance, you can group keywords by: By product or service: This makes it easier to tailor your ad copy and landing pages directly to user search intents By customer intent: Separate keywords by the buying stage they represent, such as awareness, consideration, or decision. This helps target the right ads to the right audience at the right time. By demographic: If your products appeal to different demographic groups, consider separating keywords by demographic indicators like age, gender, or locationLet’s say you want to target different buyer personas. You can organize your keywords into categories such as “women’s sports apparel,” “men’s casual wear,” and “children’s educational toys.”Each category should reflect the specific search behaviors and preferences of these groups. Allowing you to tailor your ads for maximum relevance and impact.Step 6: Adjust Keyword Matching and Negative KeywordsChoose the correct keyword matching strategy and add negative keywords to your campaigns to help protect your ad budget.Depending on the type of keyword match you choose, your ads could show up for a variety of keyword searches. Negative keywords tell Google Ads when not to display your ads.First, let’s dive into the keyword match types.There are three main match options in Google Ads: Broad match: Matches any keyword or search phrase that Google considers to be closely related to the term you’re targeting. For example, “life jackets” might match “life vests” and “water flotation devices.” Phrase match: Matches any search query that contains your target phrase, even if it has additional words before or after. It’ll also match slightly modified variations of the same terms (e.g., “life jackets” might match “children’s life jackets” and “red life vests”). Exact match: Only matches the exact query or synonyms as you’ve described them. In this case, you might specify “life jackets” and “life vests.”Change the match type for keywords on your list using the PPC Keyword Tool. In the left-hand navigation, click “Advertising” > “PPC Keyword Tool,” and click on your project of choice. Then, click the drop-down navigation from the “Match type” column. (By default, it will say “Broad match.”) Click on another match type from the list. Keywords that we do not want to trigger ads in our campaigns are called negative keywords. In the PPC Keyword tool:Click the “Negatives” toggle. Then click “+ Negatives” > “Manually.”In the text box, type or paste a list of negative keywords. Click “Add.” When you’re done adding keywords, click “Add keywords.”Consider adding negative keywords for things like: Brand names that you don’t sell (e.g., “nike”) Types or options you don’t offer (e.g., “child”) People searching for coupons, deals, or freebies (e.g., “coupon,” “free tools”)Use the cross-group negatives feature in the PPC Keyword Tool to automatically generate negative keyword suggestions. This helps you avoid overlap between your ad groups and campaigns. To do this, click the “Cross-group negatives” button.When your campaign is running, you’ll see a list of search terms in your Google Ads account that triggered your ads. Use the data from the search terms report to add negative keywords.This helps to improve campaign performance by excluding unintentional placements.Step 7: Export Your PPC Keyword CampaignSemrush’s PPC Keyword Tool makes it easy to export your keyword lists and import them into Google Ads. In the top-right corner, click the “Export data” button. Choose “All.” Select the campaign from the drop-down menu. Then, choose “Keywords + Negatives” from the “Report” drop-down menu. Click “Export to CSV.”Save the file to your local drive.Now, let’s upload it to Google Ads. Open Google Ads Editor. NoteIf you don’t have Google Ads Editor installed, download it from the Google Ads Editor page. Launch it and sign in.Go to “Account” > “Import” > “From file.”Locate, select, and upload the CSV file you saved earlier. Google Ads Editor will process the CSV file.Review possible errors and make the necessary adjustments. This may involve setting the default max. CPC, max. CPM, etc.Once done, review the changes and complete the setup.This will integrate your newly refined keywords into your Google Ads campaigns.Step 8: Monitor Your Campaigns and Update Your Keyword ListsKeyword research doesn’t stop when you launch your Google Ads campaign.Because you pay for every click you receive, you want to continuously monitor the keywords that trigger your ads. Here are some key metrics and aspects you should focus on: Conversion rate: Measure how often a click on your ad leads to a conversion CPC: Monitor how much you are paying for each click. An increasing CPC could indicate increased competition or changes in bidding strategy. Wasted spend: Check for keywords that cost money but do not lead to conversions. Adding these as negative keywords can reduce waste. Quality Score: Google rates the quality and relevance of your keywords and ads. It affects your CPC and ad position. A high Quality Score means your ad meets your audience’s needs more effectively, potentially lowering your costs.Monitoring the above will help you make informed decisions to refine your PPC strategy and improve campaign performance.Generally, you should look at the search terms that trigger your ads in Google Ads. This will help you see what actual queries bring up your ads.Then, add new high-performing keywords based on your learnings. Or pause low-performing ones to optimize your ad spend.Use the Semrush PPC Keyword Tool, Google Ads Editor, or Google Keyword Planner to update your campaign.PPC Keyword Research FAQsDoes PPC Affect SEO?No. Running PPC campaigns does not directly impact your site’s organic rankings and SEO. But many companies use both strategies for a comprehensive approach to digital marketing.Is PPC Cheaper Than SEO?There are too many factors to say for sure which strategy is cheaper.For PPC campaigns, you must consider the cost to conduct research, develop a strategy, and run the ads. Then add in what you pay for each click.With SEO, there are costs for experts to develop and execute a long-term strategy. Plus things like content writing, design, and website UX.Is PPC Easier Than SEO?PPC outcomes are often more predictable than SEO. But that doesn’t always make it easier.While the basic process of setting up and running campaigns may seem simple, competition can be fierce. And there are algorithms and Ad Rank calculations to understand in order to optimize your campaign performance. How Do I Find Good PPC Keywords?Similar to SEO keyword research, PPC keyword research requires some technical know-how and the right tools. For starters, use a tool like Google Keyword Planner or Semrush’s Keyword Magic Tool to do keyword research for PPC campaigns. After that, follow the steps outlined in our PPC keyword research guide to get your strategy right.Which Tool Is Used for PPC Keywords?Semrush offers a suite of PPC keyword research tools. Keyword Overview, the Keyword Magic Tool, and the PPC Keyword Tool help you uncover and analyze high-performing keywords. These comprehensive PPC keyword research tools allow you to explore potential keywords, understand competitive metrics, and refine your ad campaigns for better results.Sign up for a free Semrush account to raise your PPC campaigns’ success rate.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Do PPC Keyword Research for Your Ad Campaigns"
    },
    {
      "level": "H2",
      "text": "PPC Keyword Research: 3 Key Considerations"
    },
    {
      "level": "H3",
      "text": "1. Search Intent"
    },
    {
      "level": "H3",
      "text": "2. Search Volume"
    },
    {
      "level": "H3",
      "text": "3. CPC"
    },
    {
      "level": "H2",
      "text": "PPC vs. SEO Keyword Research"
    },
    {
      "level": "H2",
      "text": "How to Do PPC Keyword Research"
    },
    {
      "level": "H3",
      "text": "Step 1: Brainstorm Keywords"
    },
    {
      "level": "H3",
      "text": "Step 2: Conduct Keyword Research"
    },
    {
      "level": "H3",
      "text": "Step 3: Analyze Competitor Keywords"
    },
    {
      "level": "H3",
      "text": "Step 4: Create a Final Keyword List"
    },
    {
      "level": "H3",
      "text": "Step 5: Create Keyword Groups"
    },
    {
      "level": "H3",
      "text": "Step 6: Adjust Keyword Matching and Negative Keywords"
    },
    {
      "level": "H3",
      "text": "Step 7: Export Your PPC Keyword Campaign"
    },
    {
      "level": "H3",
      "text": "Step 8: Monitor Your Campaigns and Update Your Keyword Lists"
    },
    {
      "level": "H2",
      "text": "PPC Keyword Research FAQs"
    },
    {
      "level": "H3",
      "text": "Does PPC Affect SEO?"
    },
    {
      "level": "H3",
      "text": "Is PPC Cheaper Than SEO?"
    },
    {
      "level": "H3",
      "text": "Is PPC Easier Than SEO?"
    },
    {
      "level": "H3",
      "text": "How Do I Find Good PPC Keywords?"
    },
    {
      "level": "H3",
      "text": "Which Tool Is Used for PPC Keywords?"
    }
  ],
  "author": ""
}