{
  "url": "https://www.semrush.com/blog/press-release-template/",
  "slug": "press-release-template",
  "title": "10 Free Press Release Templates + Formatting Tips and Examples",
  "description": "Use our press release templates to write and structure your release so it captures media attention.",
  "content": "A press release is a brief news article about your company that you create and distribute to attract media attention.Press releases help protect your brand reputation and drive awareness.And companies distribute press releases by sharing them on their websites, through wire services, or by reaching out to journalists/publications directly.Having some tips and press release templates can help you do this more effectively. In this article, we’ll go over: Press release templates you can customize for your brand How to format a press release Press release examples to help you create one from scratchLet’s get started.10 Free Press Release TemplatesBelow, you’ll find free press release templates you can download and customize based on your needs.There are some commonalities among each. But we’ll get to those details later.Standard Press Release TemplateYou can use a standard press release template for announcements ranging from a new company initiative to your latest industry study. To generate buzz and get some new eyes on your company.What to include: The announcement’s significance Compelling quotes and/or stats Relevant linksDownload the standard press release template for free:New Business Press Release TemplateDistributing a press release about your new company is a great way to reach some prospective customers. To drive brand awareness that can lead to future business.What to include: A unique value proposition The business’s location (physical address and/or relevant links) The founders’ industry experience and expertiseDownload the new business press release template for free:New Product/Service Press Release TemplateWhen you have a new product or service, distributing a press release is a great way to let potential customers know about it. So you can promote it and drive sales.What to include: Key product/service details and specifications When and where the product or service will be available A unique value proposition PricingDownload the new product/service press release template for free:Event Press Release TemplateYou can use this press release template for the events you’re hosting soon or to announce your company’s presence at a significant event. Which can increase brand awareness and/or ticket sales.What to include: An event overview The event’s date The event’s location PricingDownload the event press release template for free:New Hire Press Release TemplateThis press release template is useful for announcing a new executive or a board member. Which is important information for shareholders and prospective employees.What to include: The new hire’s track record in your industry The new hire’s role, responsibilities, and future plans Compelling quotes from the new hire and an executiveDownload the new hire press release template for free:Partnership Press Release TemplateAnnounce your company’s new partnership with this press release template. Because it increases brand awareness for all companies involved and can drive new sales.What to include: The partnership details (partnership project, goals, etc.) Information on all companies included The benefits for the customers, partners, and the industry Quotes from key representativesDownload the partnership press release template for free:Rebranding Press Release TemplateYou can use this press release template for your rebranding campaign. To let the shareholders and customers know you’ll be operating under a different identity. And to generate some media coverage for your new brand.What to include: Your brand’s new name, logo, colors, tagline, etc. The reasons for the rebranding The impact on customers (changes in the offering, pricing, etc.) Some visual elements to showcase the new identityDownload the rebranding press release template for free:Award Press Release TemplateUse this award press release template to let the media know about a prestigious award you just won. To highlight your expertise and excellence.What to include: The award’s details and importance Whether you’ve won the award multiple times The number of applicants/contenders The criteria for selecting awardees, especially the ones that highlight your expertiseDownload the award press release template for free:Crisis Management Press Release TemplateWhen you’re facing a public crisis that affects your company, use this press release template. So you can reduce negative publicity, and let the public know how you’re addressing the issue.What to include: An overview of the crisis Your response and the action you’re already taking or planning to take Details about your future communications on the issue Relevant links to resources where you’ll share updates Download the crisis management template for free:Merger/Acquisition Press Release TemplateWhen your company has been a part of a merger or acquisition, distribute a press release about it. To inform shareholders and customers about the change and increase brand awareness.What to include: Information about all companies involved in the merger/acquisition Key details of the merger/acquisition (including financial terms) Key management/leadership changes The impact on customers and employees for all companies involvedDownload the merger/acquisition press release template for free:An Overview of Press Release Formatting by SectionLet’s discuss how to format a press release. We’ve broken it down by the major components. Contact Information and Release DateIn a standard press release, the section above the headline is where you share key information with journalists. To help them communicate with you and understand when it was published (or if it has yet to be published).Here’s what to include: Your company name and logo Media contact (someone from your PR or marketing department): Their name, job title, phone number, and email address Date of the press release: The date when you’re issuing the press release, which should be discussed with and approved by all relevant stakeholders at your company Release guidelines: Terms for referencing or sharing information from the releaseRelease guidelines are focused on publication dates. Because companies sometimes conduct media pitches and other forms of outreach to share information with members of the press before an official announcement.Here’s a breakdown of the different types: For immediate release: Use this phrase when your press release is meant to be shared right away. This is the most commonly used term for press releases. For release [Date/time]: Use this phrase when the information in your press release isn’t time-sensitive and can be shared later Embargoed until [Date/time]: Use this phrase when you’re sharing sensitive information that can’t be released before a specific date and timeHeadlineHeadlines are an essential part of a press release. Journalists and readers can decide whether they want to engage with the story based on it.A press release headline should contain the main information about the story you’re sharing.For some press announcements that are straightforward, the headline will be simple.For example, your company is announcing financial results to shareholders. In this case, the release doesn’t have to have a clever headline.It’s enough to state what you’re announcing. Like this:But you may be trying to grab the attention of a wider audience with other announcements.In these cases, you can get creative and develop a catchy headline or highlight a key data point.Here’s an example of how Semrush announced the results of a mental health study.This press release was issued to mark Mental Health Awareness Month. And it addresses the main statistic from the study that’s likely to catch readers’ attention.The headline should be placed below the contact and publish date information.SubheadingsSubheadings are an optional part of the press release. But they can be very beneficial for highlighting a message you want to share.You can use them to highlight data points from your release. Or some key findings you’ll be sharing in your announcement.Let’s have another look at the financial results announcement to see some effective subheadings (which are italicized):The first subheading covers the main data point about the financial update. And reveals that revenue is up compared to the previous year.The second subheading mentions another great milestone—surpassing 100,000 paying customers.Both of these subheadings give readers the information they need to know about this release. And entice them to read more.DatelineThe body copy should start with a dateline—the first line of a body paragraph that contains the location where it originated and the date of the release.Here’s a dateline example from a Semrush press release:By using a dateline, you’re indicating that the story is current and which locations it’s relevant to.The location in the dateline should match the location of your business.What about businesses that have multiple locations?In general, you should use the head office location. That’s where the news typically originates from.But there can be cases when one of the other offices issues a press release that’s only relevant to their location. In that case, you should use that office’s location.For example, Pipedrive is a company headquartered in New York.Most of their press releases have New York as the location in their datelines.But they sometimes use the location of another office.Like this press release about UK companies:Body CopyThe first paragraph should briefly cover the most important information.When writing out the first paragraph, make sure to answer: Who? What? Where? When? Why?By addressing these questions, you’ll ensure you’ve included all the main details.Use the remaining body paragraphs to expand on this information.You can include compelling quotes from the company’s representatives, data points and statistics to support your announcement, and relevant links.At the end of the body copy, include a call to action (an actionable step you want readers to take) relevant to the press release.Here’s an example of a press release with a few calls to action:Boilerplate and End NotationThe end of your press release should include a boilerplate and an end notation.Boilerplate is an “About us” statement where you share the key information about your company.A boilerplate should include: The company’s name Publicly traded companies can include a stock ticker symbol A clear description of what the company does One or more unique value propositions Information about the size/scale of the company (number of offices, employees, paying customers, etc.) Significant awards/recognitions A link to your websiteHere’s what Semrush’s boilerplate looks like:Once your press release is done, add the end notation “###.” That’s a signal of where the press release ends. When wire services or journalists see the end notation, they know they’ve seen the entire press release.Press Release ExamplesHaving a look at some press release examples can help you craft yours. Especially if you’re creating them from scratch.Partnership Announcement from MicrosoftThis press release from Microsoft announced a partnership with Viasat. By studying this press release, you can see how Microsoft described what both companies bring to the table and why their partnership is essential.In this release, you’ll notice how Microsoft used some of the key elements to convey its message.The headline doesn’t only state that they have partnered with Viasat. It also conveys the main goal of their partnerships, which is “delivering internet access to underserved communities.”They’ve also used two quotes from executives from both companies that support the message.Let’s have a look at the quote from Microsoft’s representative, Teresa Hutson. Which touches on the vision of the partnership and expands on the details of how they’ll achieve their goal.At the end of the release, you’ll notice there are two boilerplates.It’s standard practice to include information about all companies that are involved in a partnership.New Hire Press Release from AppleThe next press release example is from Apple. They issued this press release to announce an executive team personnel change.One team member, Dan Riccio, is moving on to another position. And his position will be filled by John Ternus.Let’s explore how Apple announced this transition in its press release.In the first paragraph, they state the most important information. Which includes Riccio’s new role, who he’ll be reporting to, and his industry experience.That’s followed by an announcement that Ternus will be taking over Riccio’s previous position.The next section is a quote from Apple’s CEO, Tim Cook.This quote emphasizes that both Riccio and Ternus are important team members. And mentions their expertise.Rebranding from Facebook to Meta Press ReleaseWhen a company as large as Facebook rebrands to Meta, it’s a big undertaking to effectively communicate the change to a wide audience.So let’s have a look at the press release.The headline they used is short and straightforward. And it also emphasizes two key changes in their rebranding.The first one is the name change. And the second one is the new company description.They repositioned from a social networking company to a social technology company, and that’s clearly stated.Below the headline, they added an image of the new logo. To showcase their new visual identity.Meta also did a great job of stating how the rebranding will impact both users and investors.At the end of the release, Meta uses a new boilerplate to further explain what kind of impact the company will have on the industry.Frequently Asked Questions About Press ReleasesHow Long Should a Press Release Be?The length of a press release will depend on the story you’re sharing. But it’s generally a good idea to keep it around 400 words (about the length of one printed page).However, if you don’t have a lot to say, it can be shorter than that. As long as it covers all the necessary information.What Rules Should You Follow When Writing a Press Release?Here are some general rules you should follow when writing a press release: Cover the five “W” questions in the body of your release (Who? What? When? Where? Why?) Share release guidelines for publication Include a dateline with the company’s location and the date of the release Finish with a boilerplate about the companyFor more style rules and guidelines, explore the AP Stylebook.Why Are Press Releases Important?Well-crafted press releases and other forms of digital PR help grow brand awareness.Getting press releases featured in media can drive referral traffic (visits to your website that come from other websites) and lead to more backlinks (links to your domain from other domains).Gaining backlinks is important. Because backlinks can improve your website’s visibility in search engine results.You can look into the state of your backlink profile using Backlink Analytics.You’ll get an overview of your domain’s backlink profile. Which you can further explore with the tool.How Can You Drive Better Results from Your Press Releases?Proactively sending your press releases to members of the media and other relevant websites is a great way to build more backlinks. And improve your site’s visibility.If you’re short on ideas about which domains to reach out to to gain backlinks, try our Link Building Tool. Follow these instructions on how to set up the tool.Once you’re done, you’ll get a list of potential prospects you can reach out to gain some more links to your website.",
  "headers": [
    {
      "level": "H1",
      "text": "10 Free Press Release Templates + Formatting Tips and Examples"
    },
    {
      "level": "H2",
      "text": "10 Free Press Release Templates"
    },
    {
      "level": "H3",
      "text": "Standard Press Release Template"
    },
    {
      "level": "H3",
      "text": "New Business Press Release Template"
    },
    {
      "level": "H3",
      "text": "New Product/Service Press Release Template"
    },
    {
      "level": "H3",
      "text": "Event Press Release Template"
    },
    {
      "level": "H3",
      "text": "New Hire Press Release Template"
    },
    {
      "level": "H3",
      "text": "Partnership Press Release Template"
    },
    {
      "level": "H3",
      "text": "Rebranding Press Release Template"
    },
    {
      "level": "H3",
      "text": "Award Press Release Template"
    },
    {
      "level": "H3",
      "text": "Crisis Management Press Release Template"
    },
    {
      "level": "H3",
      "text": "Merger/Acquisition Press Release Template"
    },
    {
      "level": "H2",
      "text": "An Overview of Press Release Formatting by Section"
    },
    {
      "level": "H3",
      "text": "Contact Information and Release Date"
    },
    {
      "level": "H3",
      "text": "Headline"
    },
    {
      "level": "H3",
      "text": "Subheadings"
    },
    {
      "level": "H3",
      "text": "Dateline"
    },
    {
      "level": "H3",
      "text": "Body Copy"
    },
    {
      "level": "H3",
      "text": "Boilerplate and End Notation"
    },
    {
      "level": "H2",
      "text": "Press Release Examples"
    },
    {
      "level": "H3",
      "text": "Partnership Announcement from Microsoft"
    },
    {
      "level": "H3",
      "text": "New Hire Press Release from Apple"
    },
    {
      "level": "H3",
      "text": "Rebranding from Facebook to Meta Press Release"
    },
    {
      "level": "H2",
      "text": "Frequently Asked Questions About Press Releases"
    },
    {
      "level": "H3",
      "text": "How Long Should a Press Release Be?"
    },
    {
      "level": "H3",
      "text": "What Rules Should You Follow When Writing a Press Release?"
    },
    {
      "level": "H3",
      "text": "Why Are Press Releases Important?"
    },
    {
      "level": "H3",
      "text": "How Can You Drive Better Results from Your Press Releases?"
    }
  ],
  "author": ""
}