{
  "url": "https://www.semrush.com/blog/product-serp-study/",
  "slug": "product-serp-study",
  "title": "Capture Product SERP Features with These Ecommerce Insights [Semrush Study]",
  "description": "Get insights on product SERP features on Google and improve your product listings for increased revenue. Read the full study.",
  "content": "To better understand how products appear in Search Engine Results Page (SERP) features, Semrush collected 7,000 SERPs for product-oriented searches to uncover what features are more prominent.SERP Features on Mobile and DesktopSemrush examined five product-related features and how they appeared on desktop and mobile—Popular Products, Product Filter, Refine, Buying Guide, and Related Products.Among the highlighted SERPs: Most features display on both mobile and desktop at similar frequencies Popular Products show at the highest frequency in 79% of product searches for mobile Product Filter has the biggest percentage difference between mobile (36%) and desktop (61%)The above bar chart can help you make informed decisions on how to target the features most relevant to your ideal customers. Ecommerce SERP Feature BreakdownPopular ProductsPopular Products displays relevant items from various ecommerce stores.On desktop, the maximum number of items in the product list was at 32 while mobile listed a max of 10. This means more products can show up on desktop compared to mobile search. On average, mobile showed a lower number of unique stores (three) compared to desktop search, which delivered five.Product FilterThe Product Filter feature appears at the top of the SERP on desktop only. It suggests clarifying keywords for the search query. RefineThe Refine feature contains a list of related search queries to help narrow the product search by categories.The average number of categories on desktop and mobile are the same.On mobile, the Refine feature is less product-oriented than on desktop, and looks similar to the Related keywords feature for non-shopping related searches. Buying GuideThe Buying Guide is a list of questions about a product’s features related to the search query. You can expand each block to learn more about a specific feature of the product.By default, only four items are shown; click “More considerations” to reveal other questions. On average, seven blocks come up on both mobile and desktop devices.The average number of questions and the median number of questions are the same across the board (7) for both desktop and mobile.Related ProductsSimilar to Popular Products, the Related Products feature shows a variety of relevant items across many different stores. Unlike Popular Products, it provides more information about each item and is formatted in a way to encourage comparison.Desktop view:Mobile view:The share of related products with reviews is almost identical on both desktop (99.32%) and mobile (99.02%). Related descriptions show up far less frequently on mobile at 11.49%.As for the average number of products, desktop lists five items while mobile shows four.Most of these blocks contain products with reviews, underlining the importance of earning customer reviews for each product. Improve Your Product Listings with Semrush DataWith this data, collected by Semrush, you can target Google’s product SERP features to increase your visibility and reach.To capture product-related Google SERP features, try the Ecommerce Booster app in the Semrush App Center. It assesses your current listings and provides an action plan that helps you climb rankings in the SERPs.For more tools to develop your ecommerce business, see our Ecommerce app collection.",
  "headers": [
    {
      "level": "H1",
      "text": "Revamp Product Listings for SERPs with These Ecommerce Insights"
    },
    {
      "level": "H2",
      "text": "SERP Features on Mobile and Desktop"
    },
    {
      "level": "H2",
      "text": "Ecommerce SERP Feature Breakdown"
    },
    {
      "level": "H3",
      "text": "Popular Products"
    },
    {
      "level": "H3",
      "text": "Product Filter"
    },
    {
      "level": "H3",
      "text": "Refine"
    },
    {
      "level": "H3",
      "text": "Buying Guide"
    },
    {
      "level": "H3",
      "text": "Related Products"
    },
    {
      "level": "H2",
      "text": "Improve Your Product Listings with Semrush Data"
    },
    {
      "level": "H6",
      "text": "Most popular pages"
    },
    {
      "level": "H6",
      "text": "SEO Checklist: 41 Tips to Optimize Your Website"
    },
    {
      "level": "H6",
      "text": "How to Perform a Complete SEO Audit (in 14 Steps)"
    },
    {
      "level": "H6",
      "text": "A Beginner’s Guide to Keyword Search Volume"
    }
  ],
  "author": ""
}