{
  "url": "https://www.semrush.com/blog/quality-score/",
  "slug": "quality-score",
  "title": "A Guide to Quality Score: What It Is & How to Improve It",
  "description": "Learn what quality score is, why it’s crucial for Google Ads performance, and actionable tips to improve it.",
  "content": "What Is Quality Score?Quality Score (QS) is a metric Google uses to evaluate your ad quality.It’s measured on a 1-10 scale.A higher score suggests that your ad is likely more relevant compared to competitors’ ads. A lower score indicates there are areas for improvement.This score reflects how well your ad aligns with potential customers’ needs and search intent. And can affect the performance of your ad.Think of it as a feedback mechanism: Google aims to show users the most relevant ads for their queries. And it uses Quality Score (among other factors) to determine whether your ad serves this goal.How Is Quality Score Calculated?Google Ads calculates Quality Score by combining the performance of three components: Expected click-through rate (CTR) Ad relevance Landing page experienceExpected CTRThis metric estimates how often people will click on your ad when their search query is the same as your target keyword.Google uses historical data to make this prediction.A higher expected CTR means Google believes your ad is more likely to get clicked, which positively impacts your QS.Ad RelevanceAd relevance measures how closely your ad’s target keyword and content align with what users are actually looking for when they search.If your ad is highly relevant to the query, it increases your QS. And it’s more likely to be shown to users.Landing Page ExperienceThis assesses the quality of the page users land on after clicking your ad.To determine landing page experience, Google looks at factors like page load speed, mobile friendliness, and content relevance.A better landing page experience helps your QS. (It also makes users more likely to take the action you desire.)Calculating the 1-10 ScoreEach of these components contributes to your overall QS. Google grades them as “Below average,” “Average,” and “Above average.”How does it grade them?By comparing your ad with your competitors’ who have bid on the same keyword. For example, if your expected CTR, ad relevance, and landing page experience for a specific keyword are lower than your competitors’ on average, you’d be rated “Below average” for each component.If they are equal to your competitors’, you’d get “Average.”And if they’re higher than your competitors’, you’d get “Above average.”Each grading carries points. Which combine to give you a Quality Score for every keyword.But here’s the thing:These three components contributing to your ad’s QS don’t carry equal weight.There isn’t any confirmation from Google about this. However, according to research published by Search Engine Land, the expected CTR and landing page experience carry 3.5 points each. And ad relevance carries 2 points.So, the estimated importance of the three components in determining the Quality Score looks like this:Here’s a breakdown of what this means: If your expected CTR is above average, you get 3.5 points. If it’s average, you get 1.75 points. And if it’s below average, you get 0 points. If your ad relevance is above average, you get 2 points. If it’s average, you get 1 point. And if it’s below average, you get 0 points. If your landing page experience is above average, you get 3.5 points. If it’s average, you get 1.75 points. And if it’s below average, you get 0 points.Now, let’s look at the formula that provides an estimated Quality Score: 1 + Expected CTR Weight + Landing Page Experience weight + Ad Relevance weight.Your ad starts with one point. This is your base point.Then, your grades for each of the three components are combined. Which gives you a Quality Score for each keyword.For example, you’ve bid on the keyword “best CRM for sales team.”Let’s say Google has graded the keyword across three components like this: Expected CTR: Average Ad relevance: Below average Landing page experience: Above averageWe know the estimated value of these grades: Expected CTR: Average → 1.75 Ad relevance: Below average → 0 Landing page experience: Above average → 3.5Let’s use our Quality Score formula: 1 (base point) + 1.75 (expected CTR) + 0 (ad relevance) + 3.5 (landing page experience) = 6.25Since Google doesn’t show fractions, this final value is rounded to 6, which is your Quality Score for the keyword “best CRM for sales team.”Here are a few more examples:So, what is a good quality point score?It depends on the type of keyword you’re targeting. For instance, if you’re targeting branded keywords (keywords specific to your brand name or products), you should look for a score of 9-10.For commercial intent keywords (keywords indicating a strong intent to purchase or convert), you should aim for at least 8.And for low-intent keywords (keywords where users are likely just browsing or seeking information), 6-7 is an ideal Google Ads quality score.How to Check Your Quality ScoreYou can view your Quality Score in your Google Ads account. Each keyword you’re targeting receives a Quality Score.Open your Google Ads account. Navigate to the “Campaigns” tab. Click \"Audiences, keywords, and content\" > \"Search keywords.\"In the upper right corner, click \"Columns” > “Modify columns.”Under “Modify columns for keywords,” click “Quality Score.”In this section, select “Quality Score” and its components to add them to the table. You can also see past Google Ads Quality Score stats for your defined reporting period by selecting metrics that have “(hist.)” in the field.Click “Apply.”Your selected columns will be added to the table. This is how your keywords dashboard will look:NoteIf you’re new to Google Ads, the Quality Score might show as ‘—’ until enough data is collected.Why Does Quality Score Matter? Quality Score affects the cost and effectiveness of your Google search ad campaigns.Here’s a detailed look at why it’s so important:1. It Can Influence Ad PerformanceYour Google Quality Score provides insights into the quality and relevance of your ads, landing pages, and keywords in relation to a user’s search query.Although this score isn’t the direct factor in the auction (a real-time process that determines which ads appear for a specific search query), its components play a role.If these components are rated as “Below average,” your ad might not appear at all or appear less frequently and without assets (formerly known as extensions). On the other hand, if they’re “Above average,” your ad has a better chance of appearing in the search results.2. It Determines Your Ad RankAd Rank is the score that helps decide your ad’s position on the Google results page.Quality Score influences Ad Rank.A strong score can boost your Ad Rank, making your ad more prominent in search results.Higher visibility can result in more clicks and higher chances of achieving your campaign goals.3. It Can Lower Your Cost Per ClickCost per click (CPC) is the price you pay when someone clicks on your ad. In Google Ads, CPC isn’t a flat rate. It’s calculated based on several factors, one of which is your Quality Score. Google aims to show the most relevant and useful ads to users. And your Quality Score is a measure of how well your ad meets that criterion.When you have a high Quality Score, Google rewards you with a lower CPC. This is because Google wants to encourage advertisers to create high-quality, relevant ads that enhance the user experience (UX). As a result, you could end up paying less per click compared to competitors with lower Quality Scores. In fact, if your Quality Score is a perfect 10, your CPC could be discounted by 50%. But if your QS is low, you could pay 400% more than the benchmark amount.When you look at the overall impact of a good Quality Score, you get several benefits, like: More ad visibility: With a high Quality Score, your ads are more likely to be displayed and in better positions, increasing your chances of getting noticed Better budget management: A high Quality Score allows you to get more out of your budget, enabling you to either save money or reach more potential customers Lower cost per conversion: By reducing your CPC and improving your ad’s relevance, a high Quality Score can also lower the cost you pay for each successful conversion High ROI: A good Quality Score can maximize the return on your advertising investment by lowering costs and increasing effectivenessThese are the benefits of a high Google Quality Score. But what if your QS is low? There are several things you can do to improve it.How to Improve Quality ScoreImproving your Quality Score revolves around enhancing expected CTR, ad relevance, and landing page experience.Start by identifying which components are rated as “Below average” or “Average” and prioritize addressing them.When you know which ad needs improvement, here are the tips you can follow:1. Find Relevant KeywordsSelecting relevant keywords helps ensure your ads reach users genuinely interested in what you’re offering.Imagine you’re selling handmade wooden dining tables. Using keywords like “handcrafted oak dining table” will target your audience more effectively than broad terms like “dining table.”This can help boost your expected CTR and ad relevance. And as a result, your Google Ads Quality Score.You can use Semrush’s Keyword Magic Tool to find relevant keywords for your ad campaigns.Open the tool and enter your seed keyword (a generic term related to your product or business). Select your preferred location and click “Search.”You’ll see a list of thousands of keyword ideas.Keep an eye on the CPC and Competitive Density (level of competition among advertisers for the keyword) columns. You want to pick keywords that have low CPC and competitive density.Also, you should look at the Match Modifiers. These are types of keyword matches that control how closely your keyword needs to match a user’s search term.To ensure your ads show for the most relevant search query, stick to “Exact Match” (shows keyword ideas that match your seed keyword in the same form and order) and “Phrase Match” (shows keyword ideas that include your seed keyword in the same form but in various orders).You can get started with the Keyword Magic Tool for free. 2. Organize Your Ad GroupsIn Google Ads, you have campaigns. And within these campaigns, you have ad groups filled with specific keywords. Think of these ad groups as containers holding related keywords. How you organize these keywords directly impacts how well your ads match user searches.For example, if you run a footwear store and group all shoe-related keywords together, your ad might show up for a broad search like “shoes.”But if you separate them into “men’s shoes,” “women’s shoes,” and “children’s shoes,” your ads become more specific.So when someone searches for “women’s running shoes,” they see an ad that’s closely related. Which increases the chances they’ll click on it.You can use the PPC Keyword Tool to group and organize your keywords for your search ad campaign.Open the tool, enter your domain, and complete the configuration. You can follow our detailed PPC Keyword Tool configuration guide for help.Once the tool is configured, you will see this dashboard:The PPC Keyword Tool allows you to curate, clean, and group keywords for your ad campaigns.You can also set negative keywords (terms that prevent your ad from being triggered by specific words or phrases) to filter out searches that aren’t relevant to your products.For instance, if you don’t offer “metal dining tables,” adding “metal” as a negative keyword will ensure your ad doesn’t show up for those searches. This will ensure your ad shows up for relevant searches and saves you money.Once you have created, grouped, and optimized your keyword lists, you can easily export them to Google Ads.3. Align Your Ad Copy with Keyword IntentYour ad should match the intent of the keyword to resonate with what your potential customers are actively seeking.Imagine you’re a shoe retailer. If a user searches for “buy best running shoes for marathons,” they’re specifically interested in shoes specialized for long-distance running.In this case, your ad copy should directly address this need. By highlighting shoe features that cater to marathon runners.The Keyword Magic Tool shows the intent of each keyword (pictured below). Which can help you understand the purpose behind the target keyword and aid in writing optimized ad copy.You can also filter keywords based on intent.In addition to optimizing your ad to match users’ search intent, you must ensure your ad copy stands out, hooks attention, and compels users to click. So when they’re presented with multiple ads on the search engine results page (SERP), users click on yours.Follow these tips: Address pain points. Understand your target audience’s challenges and directly address how your product can solve them. Use a clear call to action. Direct users on what action they should take next, whether it’s “Shop Now,” “Learn More,” or “Get a Free Quote.” Highlight unique selling points. What sets you apart from competitors? Whether it’s free shipping, a limited-time discount, or a unique feature, make it known. Stay direct and concise. Ensure your ad copy is short and to the point but still effectively communicates your message. Test and improve. Use A/B testing (comparing two versions to see which performs better) to try out different ad copy and see which one gets more clicks.You can also look at your competitors’ ad copy to learn what they are doing and what’s working for them.Open Semrush’s Advertising Research, enter your competitor’s domain, and click “Search.”You’ll find several tabs: “Positions,” “Position Changes,” “Competitors,” “Ads Copies,” “Ads History,” “Pages,” and “Subdomains.” Click “Ads Copies.”You’ll see the ad copy your competitor has used. Review it to understand what they’re saying and focusing on. And what emotional triggers they’re using. These insights can help you create more compelling ad copy that gets clicked.4. Optimize Your Landing PageUsers who click on your ad have a specific expectation based on the ad’s message.If your landing page doesn’t meet this expectation or is difficult to navigate, the user will likely leave without taking the desired action.Here are a few tips to improve your landing page experience: Fast loading speed: Ensure your page loads quickly, especially on mobile devices. Use tools like Google’s PageSpeed Insights to check and improve load times. Mobile-friendly design: With many users accessing sites via mobile, make sure your landing page is responsive and looks good on all devices Clear and relevant content: The content should match the user’s search intent and the promise made in the ad. If your ad is about “winter boots,” the landing page should prominently feature winter boots. Easy navigation: Users should find it easy to navigate your page and access information. Avoid clutter and use clear headings. Legible text: Use readable fonts and ensure there’s a good contrast between text and background Clear call-to-action: Guide users on what to do next, whether it’s making a purchase, signing up, or downloading a resourceTipYou can use the conversion rate of your landing page as a measure of the page’s experience. If a lot of people are visiting your landing page but aren’t converting, it indicates you need to optimize the page for a better user experience.Take the First Step: Improve Ad RelevanceUse Google Quality Score as a diagnostic tool to assess whether your ad and landing page are relevant for people searching your keyword.It can help you understand where to focus your efforts and how to improve your ad performance.So, go to your Google Ads account and look at your Quality Score. If it’s lower than it should be, take active measures to increase it.You can start by creating a list of high-quality keywords that help you develop relevant ads and reach the right target audience. Try the Keyword Magic Tool for keyword research. Then, tailor your ad content for maximum impact.",
  "headers": [
    {
      "level": "H1",
      "text": "A Guide to Quality Score: What It Is & How to Improve It"
    },
    {
      "level": "H2",
      "text": "What Is Quality Score?"
    },
    {
      "level": "H2",
      "text": "How Is Quality Score Calculated?"
    },
    {
      "level": "H3",
      "text": "Expected CTR"
    },
    {
      "level": "H3",
      "text": "Ad Relevance"
    },
    {
      "level": "H3",
      "text": "Landing Page Experience"
    },
    {
      "level": "H3",
      "text": "Calculating the 1-10 Score"
    },
    {
      "level": "H2",
      "text": "How to Check Your Quality Score"
    },
    {
      "level": "H2",
      "text": "Why Does Quality Score Matter?"
    },
    {
      "level": "H3",
      "text": "1. It Can Influence Ad Performance"
    },
    {
      "level": "H3",
      "text": "2. It Determines Your Ad Rank"
    },
    {
      "level": "H3",
      "text": "3. It Can Lower Your Cost Per Click"
    },
    {
      "level": "H2",
      "text": "How to Improve Quality Score"
    },
    {
      "level": "H3",
      "text": "1. Find Relevant Keywords"
    },
    {
      "level": "H3",
      "text": "2. Organize Your Ad Groups"
    },
    {
      "level": "H3",
      "text": "3. Align Your Ad Copy with Keyword Intent"
    },
    {
      "level": "H3",
      "text": "4. Optimize Your Landing Page"
    },
    {
      "level": "H2",
      "text": "Take the First Step: Improve Ad Relevance"
    }
  ],
  "author": ""
}