{
  "url": "https://www.semrush.com/blog/query-deserves-freshness/",
  "slug": "query-deserves-freshness",
  "title": "Query Deserves Freshness: What It Is & How It Works",
  "description": "Query deserves freshness (QDF) is a model Google uses to rank fresh content for queries that need new info.",
  "content": "What Is Query Deserves Freshness? Query deserves freshness (QDF) is a part of Google’s algorithm that prioritizes newer content in search results when a searched topic is trending, rapidly evolving, or changing over time.It was introduced as a model that can determine when there’s demand for fresh information.For example, QDF may elevate articles published in the past few hours or minutes when queries are related to breaking news stories. Like this:QDF actually predates the Google freshness algorithm update that occurred in 2011. The freshness algorithm aims to better decide when to provide particularly timely content. And does that by determining when queries are related to news/trending topics, regularly recurring events, and information that frequently changes.One example is that people searching for the “best laptops” get reviews of modern models:How Does QDF Work?QDF works by determining if publishers and searchers are more interested in a topic than usual.If lots of articles are being published and there’s also a spike in searches, it suggests the topic is trending. And Google prioritizes fresh content.Google’s then head of search, Amit Singhal, said in a 2007 interview with The New York Times:The QDF solution revolves around determining whether a topic is ‘hot.’ If news sites or blog posts are actively writing about a topic, the model figures that it is one for which users are more likely to want current information. The model also examines Google’s own stream of billions of search queries.Google can tell when an article was published/updated by looking at various signals.But freshness isn’t the only thing that influences rankings.Other factors, such as the site’s trustworthiness, still matter.TipSemrush’s Authority Score metric can help you assess how reputable your site likely appears to search engines (the higher the score, the better). Check yours using Backlink Analytics. How to Optimize for QDFOptimizing for QDF can help your news-related content rank highly. Here are some tips for success: Apply SEO best practices to your site and content Monitor Google Trends to identify relevant search trends you might want to cover Try to publish time-sensitive content quickly—without sacrificing quality Use Google News SEO tactics to increase your chance of appearing across Google properties where news stories appear Add schema markup to help Google better understand your articles Optimize your crawl budget to ensure Google crawls your new content quickly Follow Google’s guidelines for news publishersBut keep in mind that freshness matters for some non-news queries as well. So, it’s always a good idea to make sure any potentially time-sensitive content is up to date and optimized for SEO.Make Your Entire Site More Search-FriendlyWhether the query deserves freshness or not, SEO can help you get higher rankings for relevant search terms in Google.And Semrush has all the tools you need to succeed.Create your free account to conduct keyword research, check your site for technical errors, create search-optimized content, and much more.",
  "headers": [
    {
      "level": "H1",
      "text": "Query Deserves Freshness: What It Is & How It Works"
    },
    {
      "level": "H2",
      "text": "What Is Query Deserves Freshness?"
    },
    {
      "level": "H2",
      "text": "How Does QDF Work?"
    },
    {
      "level": "H2",
      "text": "How to Optimize for QDF"
    },
    {
      "level": "H2",
      "text": "Make Your Entire Site More Search-Friendly"
    }
  ],
  "author": ""
}