{
  "url": "https://www.semrush.com/blog/reddit-guide/",
  "slug": "reddit-guide",
  "title": "Reddit Marketing 101: How to Successfully Market on Reddit",
  "description": "Discover tips for effective Reddit marketing in this comprehensive guide. Start marketing on Reddit today.",
  "content": "Reddit marketing provides access to highly engaged users in communities based on interests, hobbies, or activities. Which is great news for brands who want to reach them.Wondering how to start constructing a Reddit marketing strategy?You’ve come to the right place. We’re about to cover the basics of Reddit marketing and how you can start leveraging proven tactics. Let’s get started.How Does Reddit Work?Reddit is one of the top 20 most visited websites in the world. And it’s where millions of people come to engage with each other and discuss whatever interests them most.Posts can reach the front page through a voting system that lets registered users cast upvotes (to promote content) or downvotes (to make the content less visible). Subreddits are like subforums. Any user can create a subreddit for any imaginable topic (within legal boundaries).You can find subreddits for philosophy, AI, specific brands, athletic activities, and much more. And each subreddit has its own URL where users can post topics and comments.Other users can then upvote or downvote any post according to their liking. Posts with a lot of downvotes get removed from the default (also called “hot”) feed faster. And ones with a lot of upvotes stay up for longer.If a post is upvoted enough, it may be moved to the front page (also called /r/all for registered users).This type of active, topic-focused community clearly presents a marketing opportunity. The platform even allows you to run paid ads to target specific audiences. 4 Advantages of Marketing on Reddit Let’s go through each of the main benefits of marketing on Reddit:Enjoy Precise TargetingEach subreddit attracts a community of people who are interested in a particular topic. Meaning the subreddit automatically segments the audience for you.One of the main advantages of Reddit is that the number of subreddits is large. So, you’ll always be able to find numerous communities that will fit your niche.How niche does it get?There’s a subreddit for people who hate onions. And posting anything in support of onions will get the user quickly banned. They have more than 50,000 followers. Your business can undoubtedly find its audience. And they’re a good audience for your marketing efforts.Build Brand Credibility and AuthorityPosting on Reddit allows you to interact with users by providing help or guidance. And you can make your brand seem more human just by engaging in discussions.This will make your brand seem more authoritative, credible, and warm.To engage users more directly, you can also build your own subreddit. It’s a free and relatively simple process.Simply go to the homepage and click on the “Create Community” button on the right side. A new window will pop up.All you need to do is enter a name, select the community type, and indicate whether your subreddit will feature adult content. Then click on “Create Community.”That’s it. You now have your own subreddit.It can be used to answer support queries, manage issues with products or services, and much more. To build up brand loyalty and improve your reputation.But it takes time to build a community. So, you can go to existing subreddits and answer questions there. If you’re not promoting something, users are usually receptive.You can also post topics on other subreddits. And a good post can get upvotes that give it more visibility. Which can help increase brand awareness—for free.Receive Direct FeedbackCompanies that have thriving subreddits can use them to receive suggestions and feedback from their community.Like this:You can also do that without having a subreddit.How?Any popular product or service will likely get discussed on Reddit. And users will gladly share their feedback. All you need to do is perform a few searches for your (or your competitors’) products or services and read through the discussions.These discussions are free and unfiltered commentary on the benefits and drawbacks of a brand. And an incredibly inexpensive starting point for market research.Reddit’s search results are sometimes hard to navigate. So, you can supplement them with Google search results by using the “site:” operator. For example, searching for “site:reddit.com [your brand].”Manage Your Brand ReputationIt’s possible that you’ll come across negative comments and reviews when looking into users’ feedback. And addressing those issues makes you seem more trustworthy. Here’s how you should do it: Address them by their username. It’s a small touch that makes it more personal. Offer remedies. A discount code, store credit, or a refund could be an option. Stay courteous. Which can be hard. But lashing out is never the solution. Offer to move the conversation elsewhere. Give them an email address or a phone number to call. Apologize if necessary. Not all negative comments will be your fault. But when it is, apologizeTipWith the Trend Analytics for Reddit App, you can conduct Reddit research on trending subreddits, posts, and keywords. Plus, compare subreddits side by side to evaluate the best marketing opportunities. An Overview of Paid Ads on RedditReddit advertising enables you to run ads as standard promoted posts and as what they call Premium Takeover units—more impactful ads that are also more expensive. And use demographics and subreddits to find your perfect audience. NotePremium takeover units are only available to managed advertisers. You can apply to become one here.Reddit offers many of the advertising options you’d find on any other platform. Including the ability to turn one of your organic posts into an ad.When creating a campaign, you’ll have to choose between “Simple Create” and “Advanced Create.” Simple Create: Displays a single page with a few of the most popular options for assets, targeting, and delivery. Setup is quick and simple. So, it’s a great option for your first Reddit campaign. Advanced Create: Includes four pages for setup that offer more customization for placement, targeting, and other options. It takes longer but offers better optimization features.How to Run Paid Ads on RedditSetting up your first Reddit campaign can be a bit daunting, so we’ll guide you through each step. If you already know how to do this, skip to learn about some other marketing tactics.NoteUsing the “Simple Create” option can be a helpful way to get started. But “Advanced Create” allows for more customization, so we’ll focus on that option for this process. 1. Set up a Reddit Ads AccountStart by going to the Reddit Ads homepage to create an account.And know that your sponsored posts will be tied to a username just like for any other user.If you have a Reddit account, you can log in with it. You’ll only have to enter some business details. Such as your first name, business name, etc.But it’s a better idea to register a username that matches your business name. To represent your brand better.2. Fill Out Your Basic Campaign DetailsOnce you’re logged in, start by choosing “Advanced Create.” And the next screen will include a few fields.Pay particular attention to the objectives.There are six options available. And each objective determines which types of posts and cost structures you can use.You may be familiar with the cost per click (CPC) model. Which charges you for each click on your ad.Reddit Ads also use cost per thousand impressions (CPM) and cost per view (CPV), depending on your chosen campaign objective. Here’s how the objective affects the way you’re charged: Campaign objective Cost structure Brand Awareness and Reach CPM Traffic Conversions App Installs Catalog Sales CPC Video Views CPV After selecting your objective, you’ll need to think of a name and add a payment method.3. Choose Whether You Want to Use Automated Ad CreationThe next screen gives you the option to select automated ad creation. Which can improve your campaign performance.You can choose this option by checking the box.You’ll now be able to upload several sets of creative and copy. And the Reddit algorithm will create multiple combinations to find the best-performing ad.4. Create a Well-Defined AudienceYou’ll want to do extensive research on relevant subreddits to extract the most value out of Reddit advertising. Because Reddit lets you target people who’ve interacted with specific subreddits.Here’s how:You can find all related subreddits by using the search function on the homepage.Simply enter a keyword (e.g., “gaming”) and click on “Search for ‘[keyword]’.”Then, select the “Communities” tab. All communities related to your keyword will be outlined in a handy list.You can also target by interest group, which Reddit determines based on what content those users have interacted with. So, it’ll include a broader group of users.And you can even target people who’ve viewed relevant keywords. And Reddit will show your ad in conversations that contain your keywords.Keyword-based audience segmentation is best used for awareness campaigns. Because it creates a much larger audience than other options.NoteThere’s also a dynamic audience expansion option that will target users with interests similar to the subreddit and interest groups you choose. But it’s unavailable for keyword-based or custom audiences. Lastly, you can create a custom audience to include or exclude based on: A customer list Users who’ve visited your website Reddit users who have previously interacted with your Reddit ads5. Choose Demographics and DevicesUnder the demographics section, you’ll be able to target users based on location. And you can both include and exclude locations from your targeting.You can also target users based on cell carriers, devices, or a mix of both. There’s two default options: “All” and “Custom.”Selecting the “All” tab will automatically include every device type. And let you choose one or more carriers if you’d like.The “Custom” tab allows you to choose the devices, the device models, and the cell carriers for your campaign.TipDevice targeting will mostly be relevant to device-specific campaigns like for advertising apps.6. Select Your Placement OptionsSome campaign objectives will determine your placement for you. But you’ll otherwise get to choose from these options: feed, conversation, and both.Feed placements appear when users are scrolling through the platform. But not within posts or conversations. This is a good starting option, especially if you use subreddit targeting. You’ll get fewer viewers overall, but they’ll likely be more engaged. Conversation placements will appear somewhere between the post and first comment only when a user clicks to read the comments of a Reddit post.These may capture more engaged users (as they’re viewing the post or intending to comment). There’s also the option to combine both placement types. Reddit says this should be the most cost-effective placement method.The placements section also allows you to exclude subreddits and keywords that could be harmful for your brand. 7. Assign Your BudgetBudgeting has two main options—a daily or lifetime budget.Setting a daily budget limits the amount of money spent on your campaign per 24 hours. You can run the ads continuously or choose an end date for the campaign.Setting a lifetime budget limits the amount of money spent on your campaign over a chosen date range. You have to set an end date when selecting a lifetime budget.You can also select a maximum cost in either case. Or use the platform’s default recommendation.Experiment with the maximum cost to find the sweet spot. If you set it too low, the ad may never show. If you set it too high, you may overspend and run out of budget very quickly.NoteReddit states that the actual spend on your ad groups may be up to 20% higher due to the real-time nature of advertising. 8. Draft Your CreativeIf you chose automated ad creation at the beginning, you’ll be allowed to create up to five headlines. And include up to five images or videos.Your options will be more varied if you didn’t select the automation option. And this allows you to boost an organic post previously made under your business account and choose from a few more creative options like carousel or text-only advertisements.Keep Reddit’s best practices for creative in mind: Use a 4:5 or 1:1 aspect ratio for images and videos Add text overlays and closed captions Include clear branding Keep headlines to 150 characters at most Keep videos to 60 seconds at most Include Reddit-specific language or information Include a clear call to action (CTA)An Overview of Organic Marketing on RedditOrganic marketing on Reddit is simply posting within subreddits without using paid advertising.You do need to manage your expectations given that many posts will get little (if any) response. And it’s also possible you could face backlash.This happened to EA games when a representative responded to a user’s frustration about costly game elements. Their post was downvoted so heavily it made it into the “Guinness World Records 2020.”But there’s the opposite end of the spectrum, too. Your comment or post may gain just as many upvotes, getting it pushed to tens of millions of daily users globally. And it could possibly outperform paid advertising.How to Do Organic Marketing on RedditParticipating in everyday Redditing is a good way to kickstart your organic marketing efforts on the platform.Here are two ways to do that:Leave Comments and Engage in DiscussionsTo reach a new audience, you’ll have to be active all over the platform. And provide valuable insights while engaging in conversations.How can you do that?It depends on your objectives, your larger marketing strategy, and your brand. But you can take inspiration from this success story Zapier published about sustainable clothing company Bastet Noir.A company representative browsed relevant subreddits like r/ethicalfashion, r/Etsy, and r/femalefashionadvice. Then posted style advice and started discussions.Source: ZapierThey then went on to post photos of the representative wearing company clothing, which evolved into people asking where they could buy those clothes.People began to ask where they could get those clothes. So, Bastet Noir shared links that drove web traffic and sales. There’s a lot to learn from their methods.Here are a few steps to go through: Identify relevant subreddits. Use the search function to find communities with relevant interests. You can even use the “site:” operator to look for mentions of your brand or your competitors’ brands. Answer queries only when you can be useful. Avoid being overtly promotional and be sure to make it clear you’re a company representative. Include mentions of products or services carefully. Only mention services and products when a Redditor is specifically looking for them like when asking for a good replacement. Engage in other conversations. Join conversations with other redditors on a variety of relevant topics without engaging in controversy. You can even maximize how much visibility your comments receive by looking into which keywords relevant subreddits are ranking for. Meaning posts focused on those keywords are getting traffic from organic search.You can use Semrush’s Organic Research to do this.Open the tool and enter the subreddit URL. And click “Search.”In the report that appears, scroll down to “Top Keywords.” And click “View all # keywords.”You’ll now see a list of keywords the subreddit ranks for. And metrics like monthly search volume.Once you identify some keywords relevant to your niche, click the arrow icon next to the corresponding URL to see the exact post. Finding high-visibility posts like this can help you reach even more people.Create Posts in SubredditsPosts have a greater potential reach than comments. Comments are limited to one post in one subreddit. But posts are visible throughout the subreddit and may also get moved to the front page.Here’s how to post effectively:Start by analyzing the subreddit, its rules, and its most common topics. In the Bastet Noir example, the company representative would post questions relating to fashion, trends, and clothing. But rarely mentioned their brand, products, or anything else that would have come across too self-promotional.Here’s how you can replicate that approach: Post about a trending topic, interesting insights, or an honest question that others in the community might be dealing with Prioritize starting discussions and providing information Use conversational languageDon’t get discouraged if your first few posts don’t get lots of traction. It may take some experimentation to get posts right. To maximize your reach, focus on times when there are lots of active users on the subreddit. You can find the number of active members at the sidebar.Why?Because all posts start out in the “New” tab. And with enough upvotes they get moved to the “Hot” tab. So, posting during high-traffic hours gives you a better chance of reaching the “Hot” tab.NoteSome subreddits change the default naming of “Members” and “Online” to various other funny or catchy phrases. You’ll always be able to find the number of online users by looking at the number that has the small green dot below it.Occasional posts that mention your brand or offerings can also be effective. But only if they provide real value to the communityYou can also post promotional content in subreddits that focus on deals, such as /r/DealsReddit.But many other marketers will be using these subreddits. So, if you want to improve your odds of getting noticed, find deal communities that are directly tied to your products or services.Other Marketing Tactics to Use on RedditManaging a subreddit, participating in discussion, and running ads may seem like a lot. But there are even more ways to take advantage of marketing on Reddit.Run an AMAWhile usually reserved for well-known names and brands, an ask me anything (AMA) can be an effective way to incorporate some promotional material within organic content.Like this:AMAs are usually posted on r/IAmA or a dedicated subreddit. Some users will post in both. AMA readers can then ask any relevant question they wish.These have potential to generate lots of engagement for companies. And AMAs have been used by brands like ProtonVPN.AMAs can also be effective also for non-marketing purposes. For example brands that have been experiencing negative press can use AMAs to answer burning questions people have and provide large-scale communication.Host GiveawaysGiveaways are a tried-and-true method for generating engagement. And there are two options—giveaway subreddits and dedicated subreddits.Here’s how to make use of giveaway subreddits:Start by finding a subreddit that has a lot of user activity. A good example is /r/RandomActsofGaming as it has many active posters.Avoid subreddits where there are only a few comments and active users.You can use a third-party raffle tool or any system that requires user interaction (such as commenting). And after the giveaway is complete, simply message the winner and edit your post to let people know it’s ended.Giveaway subreddits are easy. But they may attract people who are only interested in giveaways—and not in your products.So, posting in dedicated subreddits can be more effective.You can ask moderators of larger subreddits to help you host giveaways. Because they can help you gain more traction.Here’s an example with a moderator-approved giveaway:You can message subreddit moderators through a dedicated button in the subreddit. Which you can find on the right-hand side of the screen after scrolling down a bit.Just know that converting those users into paying customers may be difficult. It’s usually a tactic best used along with other organic marketing approaches.Reddit Marketing Practices to AvoidHere are a few activities to avoid to prevent damaging your brand or your marketing efforts:Thinly Veiled MarketingOne of the most well-known marketing failures on Reddit was Woody Harrelson’s AMA, which was made with the intention of promoting his upcoming movie “Rampart.”The actor (or whoever was running the AMA) refused to answer anything that wasn’t directly related to the movie. This clearly goes against the concept of an AMA and was an overt marketing attempt. Redditors soon turned against the actor.While this is an extreme example, it’s a good reminder that you need to be careful about how you approach marketing on Reddit.Shilling Products“Shill” is a term the Reddit community uses to refer to company representatives who push their products or services but pretend to be regular users.Authenticity is a key aspect of Reddit. So, anything that looks and feels like marketing without being upfront about it will likely receive backlash.There’s even a subreddit (/r/HailCorporate) dedicated to uncovering shilling practices.Getting exposed as a shill can damage your reputation on Reddit through downvotes. And remember that most subreddits don’t allow product or service promotion. Subreddits typically post rules (including those about promotions) to the right side of your screen.Violating those rules could get you muted or even banned. How to Measure Reddit Marketing SuccessSubreddits, organic marketing, and paid advertising each have their own metrics you should keep an eye on.Let’s start with subreddits.Track Subreddit SuccessKeep an eye on the total number of members, the average number of posts per month, and overall views. These metrics show whether your subreddit is growing and whether users are engaging with your content. You can find all of these metrics in the “Mod Tools” section.First, visit your subreddit by going to its dedicated URL.Under “About Community,” click on “Mod Tools.”You’ll be brought to a new page with many new buttons available.Click on “Insights”.You’ll now see a screen with some data about your subreddit. Pay attention to these two options: Community growth shows the number of views and new members (subscribers) to your subreddit Community health shows the number of posts and comments madeThese two pages will provide you with all the insights needed to track your subreddit’s success.Track Organic MarketingYou’ll want to track your organic marketing efforts directly on Reddit.Start by looking at your posts and the comments you’ve made. And check the upvote count and the number of replies for each. If you open each post individually, you’ll get more data. Like the number of views a post received and its upvote rate.It’s also worth taking your time to investigate how much traffic you’re getting from Reddit. And you can find that using Google Analytics 4 and applying a filter to only display data where the traffic source is Reddit.Further reading: Google Analytics for Beginners: Getting Started with GA4Track Paid AdvertisingThe Reddit Ads dashboard will give you data like click-through rate (CTR), impressions, clicks, campaign costs, and more. You can find everything under the Reddit Ads dashboard.You should also measure return on ad spend (ROAS) as a way to measure a campaign’s success. That’s how much revenue you gain for each dollar spent on advertising. ROAS is calculated by dividing the total amount of revenue generated from your ads by the total amount spent on them:Get Started with Reddit MarketingReddit can be valuable as a marketing channel. But paid ads can be expensive. And it takes time to build your reputation through organic means.You can gain momentum more quickly if you focus on providing responses to high-visibility posts in relevant subreddits.And Organic Research can help you identify those posts. So you can start sharing your expertise and providing value for users.",
  "headers": [
    {
      "level": "H1",
      "text": "Reddit Marketing 101: How to Successfully Market on Reddit"
    },
    {
      "level": "H2",
      "text": "How Does Reddit Work?"
    },
    {
      "level": "H2",
      "text": "4 Advantages of Marketing on Reddit"
    },
    {
      "level": "H3",
      "text": "Enjoy Precise Targeting"
    },
    {
      "level": "H3",
      "text": "Build Brand Credibility and Authority"
    },
    {
      "level": "H3",
      "text": "Receive Direct Feedback"
    },
    {
      "level": "H3",
      "text": "Manage Your Brand Reputation"
    },
    {
      "level": "H2",
      "text": "An Overview of Paid Ads on Reddit"
    },
    {
      "level": "H3",
      "text": "How to Run Paid Ads on Reddit"
    },
    {
      "level": "H4",
      "text": "1. Set up a Reddit Ads Account"
    },
    {
      "level": "H4",
      "text": "2. Fill Out Your Basic Campaign Details"
    },
    {
      "level": "H4",
      "text": "3. Choose Whether You Want to Use Automated Ad Creation"
    },
    {
      "level": "H4",
      "text": "4. Create a Well-Defined Audience"
    },
    {
      "level": "H4",
      "text": "5. Choose Demographics and Devices"
    },
    {
      "level": "H4",
      "text": "6. Select Your Placement Options"
    },
    {
      "level": "H4",
      "text": "7. Assign Your Budget"
    },
    {
      "level": "H4",
      "text": "8. Draft Your Creative"
    },
    {
      "level": "H2",
      "text": "An Overview of Organic Marketing on Reddit"
    },
    {
      "level": "H3",
      "text": "How to Do Organic Marketing on Reddit"
    },
    {
      "level": "H4",
      "text": "Leave Comments and Engage in Discussions"
    },
    {
      "level": "H4",
      "text": "Create Posts in Subreddits"
    },
    {
      "level": "H2",
      "text": "Other Marketing Tactics to Use on Reddit"
    },
    {
      "level": "H3",
      "text": "Run an AMA"
    },
    {
      "level": "H3",
      "text": "Host Giveaways"
    },
    {
      "level": "H2",
      "text": "Reddit Marketing Practices to Avoid"
    },
    {
      "level": "H3",
      "text": "Thinly Veiled Marketing"
    },
    {
      "level": "H3",
      "text": "Shilling Products"
    },
    {
      "level": "H2",
      "text": "How to Measure Reddit Marketing Success"
    },
    {
      "level": "H4",
      "text": "Track Subreddit Success"
    },
    {
      "level": "H4",
      "text": "Track Organic Marketing"
    },
    {
      "level": "H4",
      "text": "Track Paid Advertising"
    },
    {
      "level": "H2",
      "text": "Get Started with Reddit Marketing"
    }
  ],
  "author": ""
}