{
  "url": "https://www.semrush.com/blog/secondary-keywords/",
  "slug": "secondary-keywords",
  "title": "How to Find & Use Secondary Keywords to Boost Your SEO Traffic",
  "description": "Secondary keywords are terms related to the primary query a page targets, such as synonyms and subtopics.",
  "content": "What Are Secondary Keywords?Secondary keywords are keywords that are closely related to the target keyword (also known as the primary keyword) a page is aiming to rank for. To help search engines better understand what a page is about.Secondary keywords are often synonyms or long-tail versions of the primary keyword. For example, a page targeting the keyword “improve seo” might include the following secondary keywords: “how to improve seo” “ways to improve seo” “best practices to improve seo”Why Are Secondary Keywords Important for SEO?Secondary keywords help your content rank higher for more relevant search queries. Without the need to create additional pages. And that can drive more organic traffic to your site, increase conversions, and boost revenue for your business.This has to do with semantic search. Semantic search is how Google and other search engines translate what users type in the search box into a query they can understand and match.For instance, someone looking for vegan recipes might use any of the following search queries: “vegan meal ideas” “vegan recipes i can make for my family on a Thursday night” Behind the scenes, the search engine takes the words users type into the box and figures out which pages contain relevant content.They interpret the language and search intent (the reason behind the query). Then, translate it into a more common topic or phrase. In this case, something like “vegan recipes.”That’s why Google will return similar search results for any of these queries. Because it understands that the different searchers share the same intent.So, including secondary keywords or variations can improve your rankings for other versions of a search query.What if you target the primary keyword and ignore secondary keywords?You could rank well for “vegan recipes.” But miss out on traffic from people searching for “easy vegan recipes” and other variations. That means you’re limiting your overall potential traffic to that page.Pro tipUse our AI-powered Keyword Strategy Builder to create a comprehensive keyword strategy in seconds. Including recommended pillar pages and subpages.How to Find Secondary KeywordsLet’s go over two ways to find secondary keywords to use in your content:Check Top-Ranking PagesStart by analyzing the top-ranking pages for your target keyword. And check which secondary keywords they rank for.Here’s how to do it using our Organic Research tool:Paste the URL of a competitor’s page you’d like to analyze. Then, click “Search.”The tool will generate a report. Navigate to the “Positions” tab.Scroll to the “Organic Search Positions” section. Here, you’ll see all the keywords the page ranks for. Along with the search volume and difficulty score for each.Use the drop-down filters at the top to help narrow your results: Search volume: Average number of times users search for a specific keyword over a 12-month period. You might set a minimum threshold, for example. Difficulty: How hard it’ll be for you to rank highly for a given keyword. You might want to filter for terms that are easier to rank for, especially if your site is new. Search intent: The purpose behind a user’s search. For example, you might want to filter out transactional terms if the term you’re focused on is informational.Select specific keywords by clicking the checkboxes next to them and add them to a keyword list by clicking “+ Add to list.”Or export the keywords as a CSV or Excel file by clicking “Export.”Explore New Keyword IdeasThe Keyword Magic Tool also generates keyword ideas based on your primary keyword. Here’s how:Enter your primary keyword and domain. Then, click “Search.”The tool will generate many keyword ideas based on your primary keyword.And consider filtering the results based on search volume, Personal Keyword Difficulty (how likely your specific domain is to rank for that keyword), search intent, etc.From here, select the keywords you’d like to use. Add them to a keyword list in Semrush by clicking “+ Add to list.”Or export them to a CSV or XLSX file by clicking the export icon.How to Incorporate Secondary Keywords into Your ContentOnce you’ve discovered secondary keywords through keyword research, you’ll want to add them to your new or existing content.How?Incorporate each of the secondary keywords at least once within your text.Keep in mind that secondary keywords are usually close variations or synonyms of your target keyword. It should be pretty straightforward to edit a few instances of your primary keyword to be a secondary keyword instead. For example:“Check out these great vegan recipes” becomes “Check out these great vegan meal ideas.”You can also add the secondary keywords in the following spots: Subheadings Image alt text (HTML that briefly describes an image) Meta descriptions (HTML that provides a short page summary)And keep the reader in mind at all times. Which you can do with the below tips: Focus on search intent: Remember that this search is likely part of a larger journey for the user. Consider the query and the topic of the keyword you’re targeting. But also consider topics that will be valuable as users explore further. Don’t over-optimize: Keyword stuffing means overusing keywords to try to improve SEO. It’s a bad practice that applies to both primary and secondary keywords. So, don’t cram secondary keywords into your article—keyword density isn’t a ranking factor anyway. Use keywords naturally: Secondary keywords should always enhance the reader’s understanding. If you find yourself forcing the terms into a sentence or disrupting the content’s flow and clarity, try adding them elsewhere. Consider context: Use secondary keywords where it makes sense. For instance, you may not want to use a synonym when introducing the definition of your target term. But you could explain that the term in question is sometimes referred to in other ways. Remember your primary keyword: Secondary keywords are valuable, but stick to your primary keyword in critical spots. Like the title tag, headings, and regular occurrences throughout the body content.Use a tool like the SEO Writing Assistant to quickly optimize your content.Click “Content Marketing” > “SEO Writing Assistant” from the navigation. Then, click “Analyze new text.”Paste your list of primary and secondary keywords into the “Keywords” text box on the right. Then, click “Get recommendations.”The SEO Writing Assistant will score any content you create based on readability, SEO, originality, and tone of voice. In the right-hand sidebar, you’ll get specific suggestions for improving and optimizing your content. Based on the keywords you’re targeting. You can also compose content in Google Docs or Microsoft Word. Then, paste your draft into the SEO Writing Assistant when done. Alternatively, install the SWA add-on to get the same recommendations while writing in Google Docs.Next, we’ll note some important differences between keyword terms.How Secondary Keywords Differ from Other Types of KeywordsSecondary Keywords vs. LSI Keywords or Related KeywordsRelated keywords (so-called latent semantic indexing keywords) are not the same as secondary keywords. While “latent semantic indexing keywords” is a misnomer, it refers to the concept of related keywords. Related keywords (or related terms) are words and phrases associated with your primary keyword or topic. But they’re not necessarily close variations or synonyms. For instance, “tofu” is related to “vegan recipes.” A lot of content discussing vegan recipes references the use of tofu. So, it’s definitely a good SEO practice to use related keywords in your content. It helps signal article quality and topical depth. Search engines like Google (and users) probably expect most comprehensive articles about vegan recipes to mention the word “tofu” at some point.But be aware that using the word “tofu” in your vegan recipe article likely won’t help you rank for “tofu.” Because the intent is very different.To rank for related keywords, you’ll need to create a unique page or piece of content targeting that term (and its secondary keywords).Further reading: Semantic Keywords: What They Are and How to Find ThemSecondary Keywords vs. Long-Tail KeywordsThese are also not the same thing. Long-tail keywords are more specific keywords (often with lower search volumes). In contrast to short-tail keywords (also called head terms) that generally denote broad topics with high search volumes.Because long-tail keywords are more specific, users typing in these search terms may be more likely to take action. Like completing a form or making a purchase.Whether a term is a long-tail keyword or a short-tail keyword has no effect on whether it’s primary or secondary. These are just separate ways of categorizing and using keywords in your SEO strategy. Let’s explain this better with an example. A keyword like “homemade coffee filters” could be considered long-tail. It’s more specific than the short-tail keyword “coffee filters.” Right?But you could still use “homemade coffee filters” as your primary keyword. Identifying it as long-tail doesn’t mean it can’t also be a primary keyword. These categories are neither mutually exclusive nor mutually inclusive.The secondary keywords in this case would be even more specific terms. Like “homemade filters for percolator coffee pots.” Use Secondary Keywords to Boost Your Organic TrafficUsing secondary keywords throughout your content can help your pages rank for multiple keywords. And allow you to drive more organic traffic to your website.And they’re easy to find.Use Semrush’s Organic Research and Keyword Magic Tool to uncover secondary keywords you can add to your content today.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Find & Use Secondary Keywords to Boost Your SEO Traffic"
    },
    {
      "level": "H2",
      "text": "What Are Secondary Keywords?"
    },
    {
      "level": "H2",
      "text": "Why Are Secondary Keywords Important for SEO?"
    },
    {
      "level": "H2",
      "text": "How to Find Secondary Keywords"
    },
    {
      "level": "H3",
      "text": "Check Top-Ranking Pages"
    },
    {
      "level": "H3",
      "text": "Explore New Keyword Ideas"
    },
    {
      "level": "H2",
      "text": "How to Incorporate Secondary Keywords into Your Content"
    },
    {
      "level": "H2",
      "text": "How Secondary Keywords Differ from Other Types of Keywords"
    },
    {
      "level": "H3",
      "text": "Secondary Keywords vs. LSI Keywords or Related Keywords"
    },
    {
      "level": "H3",
      "text": "Secondary Keywords vs. Long-Tail Keywords"
    },
    {
      "level": "H2",
      "text": "Use Secondary Keywords to Boost Your Organic Traffic"
    }
  ],
  "author": ""
}