{
  "url": "https://www.semrush.com/blog/semantic-keywords/",
  "slug": "semantic-keywords",
  "title": "Semantic Keywords: What They Are & How to Find Them",
  "description": "In SEO, semantic keywords are words or phrases that are conceptually related to a given keyword or topic.",
  "content": "What Are Semantic Keywords?Semantic keywords are words or phrases that are conceptually related to a given keyword or topic. For example, “italy” and “dough” are semantically related to “pizza.”It’s important not to confuse semantic keywords with target keywords (keywords you want to rank for). For example, you might want a page to rank for “pizza dough recipe” and related keywords like “how to make italian pizza dough.” But you wouldn’t really want it to rank for “italy.”NoteSome people refer to semantic keywords as LSI keywords. But the terms are not perfectly interchangeable. Why Use Semantic Keywords in SEO?Semantic keywords help search engines understand your content’s subject matter, scope, and depth. And that can help you rank more prominently for relevant queries.This is because Google uses semantic search (not keyword search) to find search results.In other words, Google doesn’t just look for the user’s search terms on your page. It tries to match the meaning of the query with the meaning of your page.For example, Google infers that people searching for “authentic pizza dough” want Italian-style recipes. And infers that pizza recipes containing terms like “rustic Italian” and “Neapolitan style” are relevant.Google performs semantic analyses with the help of various systems, such as: Google Knowledge Graph: A database that maps relationships between people, places, and things Natural language processing: A form of artificial intelligence that helps computers interpret human languageWhen you optimize your content for these systems, you’re doing semantic SEO.How to Find Semantic KeywordsOnce you’ve chosen a keyword or topic to base your content around, look for semantically related keywords. Because they’ll help you create relevant, information-rich content that’s easy for users and search engines to understand.Here’s how to find semantic keywords with seven different tools:SEO Content TemplateEnter the target keyword(s) for a page into Semrush’s SEO Content Template. The tool will analyze the top 10 Google results to provide a list of semantically related keywords (along with other recommendations).For example, here are the results for “how to make pizza dough”: Adding these semantic keywords to your content can help you replicate your rivals’ success.When you’re ready to start writing, click “Real-time Content Check” then “Open in SEO Writing Assistant.”SEO Writing AssistantThe SEO Writing Assistant reviews your content in real time. And provides recommendations on how to improve it.If you didn’t go to the tool directly from SEO Content Template, create a new document with your target keyword(s) added.Then, go to the “Add recommended keywords:” section to see any semantic keywords you’ve missed.Keyword Magic ToolSemrush’s Keyword Magic Tool allows you to search our keyword database. And you can use it to do a semantic keyword search.Enter your target keyword and country. And the tool will present “Broad Match” keywords that contain the starting word(s) or a close variation.For example, here are the U.S. results for “how to make pizza dough”: On the left, you’ll find a list of commonly occurring terms. Which can make good semantic keywords.In our example, “yeast” is the most common modifier. So, it’s a good idea to use this term (and other popular terms) in your pizza dough recipe.Take a look at specific keyword results, too. Because you might find secondary keywords (other relevant keywords you want your page to rank for)—e.g., “how to make pizza dough from scratch.” Or you might find keywords you can target on other pages—e.g., “how to make pizza dough without yeast.”TipAdd internal links between highly related pages on your site. And place these links using descriptive text. This can help search engines (and users) understand semantic relationships between your pages. And help you increase your topical authority. Organic ResearchWith the Organic Research tool, you can see what search terms a URL appears for in Google.Analyzing your competitors’ keyword rankings can be a great way to source semantic keyword ideas.For example, here are the results for a pizza crust recipe on the Sally’s Baking Addiction site:If there are lots of results to scroll through, you might want to export your results to a spreadsheet. And then import the keywords to a word cloud generator like this one. So you can visualize the most commonly occurring terms.Like this:TipSearch your target keyword in the Keyword Overview tool to discover the top-ranking pages in your target location. Then, click the URLs to go to Organic Research to find semantic terms. Google SearchYou can often find semantically similar keywords on Google’s search engine results pages (SERPs).Pay particular attention to the following elements (when they appear): Autocomplete suggestions: Look at the autocomplete suggestions that come up as you type your query into Google Related searches: Google may display related search queries that allow users to refine their search. These can provide great inspiration for semantic keywords. Bolded terms: In addition to bolding the search term used, Google may also bold related terms that appear in snippets People Also Ask: The People Also Ask (PAA) box is a SERP feature (an additional element in search results) that contains popular questions and answers from across the web. This can be a great source of semantic keywords and question keywords.Google TrendsWhen you explore a subject in Google Trends, you can find related topics and search terms. Which you can use as semantic keywords.Head to Google Trends, enter a search term, and choose a result from the list:Then, select the region and time range you want to explore. (You can also change the category and search type, if you wish.)Scroll down to the “Related topics” and “Related queries” sections.“Rising” topics and queries are those that have had the biggest relative increase in search popularity over the selected time range. (“Breakout” refers to an increase over 5,000%.)Switch to the “Top” results to see the most popular related topics or queries.The most searched result gets a score of 100. And the others are scored relatively (e.g., something with a score of 50 was half as popular).Keyword PlannerGoogle Keyword Planner is a free tool that lets you find keywords for paid search ads. But you can also use it to find semantically related keywords.Visit Keyword Planner and click “Discover new keywords” to get started.Then, enter your target keyword(s) and click “Get results.”The tool will present a list of keyword ideas.And in the “Refine keywords,” section, you’ll find common term categories.Expand these categories to discover the specific terms to get inspiration for your content.Start Creating Semantically Rich ContentIncorporating semantic keywords (in appropriate contexts) helps you create content that’s better for users and search engines. And more likely to generate rankings, traffic, and conversions.To streamline the content creation process, use the SEO Writing Assistant: Track your use of target keywords and semantic keywords Generate or improve written content with the help of AI Monitor your content’s readability, originality, and tone of voice",
  "headers": [
    {
      "level": "H1",
      "text": "Semantic Keywords: What They Are & How to Find Them"
    },
    {
      "level": "H2",
      "text": "What Are Semantic Keywords?"
    },
    {
      "level": "H2",
      "text": "Why Use Semantic Keywords in SEO?"
    },
    {
      "level": "H2",
      "text": "How to Find Semantic Keywords"
    },
    {
      "level": "H3",
      "text": "SEO Content Template"
    },
    {
      "level": "H3",
      "text": "SEO Writing Assistant"
    },
    {
      "level": "H3",
      "text": "Keyword Magic Tool"
    },
    {
      "level": "H3",
      "text": "Organic Research"
    },
    {
      "level": "H3",
      "text": "Google Search"
    },
    {
      "level": "H3",
      "text": "Google Trends"
    },
    {
      "level": "H3",
      "text": "Keyword Planner"
    },
    {
      "level": "H2",
      "text": "Start Creating Semantically Rich Content"
    }
  ],
  "author": ""
}