{
  "url": "https://www.semrush.com/blog/semrush-seo-reality-show-episode-2/",
  "slug": "semrush-seo-reality-show-episode-2",
  "title": "SEO Analysis Increases Global Classroom Community Visibility",
  "description": "Gain marketing perspective inside agencies and brands facing real-world challenges. Tune in for the second look behind the scenes.",
  "content": "It’s time for SEO Reality Show Episode #2. The first episode set up a powerful case study about a major trucking company in the Midwest and its agency team from Aimclear. We learned of the recruiting challenges the trucking company faced and the core SEO strategies Aimclear chose using Semrush’s tools. Episode #2 jumps across “The Pond” to explore our second Reality Show case study featuring the challenges confronting an innovative online classroom community, Learning With Experts. The agency team Semrush selected for this challenge is UK-based Re:Signal — proven SEO experts and digital marketers. Read on to understand the business challenges for this case study and the opportunities that came directly out of Semrush. Client Name: Learning With Experts Learning With Experts (LWE) is a global classroom community that brings people together to learn from expert tutors and each other. Led by industry leaders, Learning With Experts offers interactive online courses within the respectful fields of Gardening, Food & Drink, Photography, Jewellery, Floristry and Antiques. Founded in 2015 by Elspeth Briscoe with the launch of horticultural and photography community; In 2020: 6 categories, 157 courses, and 67 experts available Course levels range from beginner to specialist. Learning With Experts is not a learning one-to-one but altogether as a class. It is a community for everyone who is passionate about these types of interests, whether you are looking for a career change or whether you are very keenly interested to learn more about it. “Online learning that’s guaranteed to lift the spirits!” The challenge was to increase Learning with Experts' visibility to take market share away from their competitors. Agency Name: Re:signal Re:signal is a Multi-Award-Winning SEO Agency, focused on driving organic performance. Their vision is to be the SEO and Content Marketing Agency for brands anticipating the future. They have continued to grow from strength to strength, with significant new client wins and team hires. Re:signal has a strong industry reputation — including winning search agency of the year (UK Agency Awards, 2018), Best use of organic search (DADI awards, 2018) and 13x UK and EU Search Awards (2013-2018). Also featured in Deloitte Fast 50 UK and Fast 500 EMEA and The FT’s 2018 Top 1000 Growing Companies in Europe. In 2019, Re:signal was named as the Best Small SEO Agency in Europe at EU Search Awards. The Marketing Approach Learning with Experts had the lowest organic visibility against their competitors when they came to Re:signal. The marketing goal has become to increase Learning with Experts visibility to compete with their competitors. Re:signal identified areas of the client’s content that were not performing as strongly as content by their competitors. Semrush empowered the team to make improvements for better search results. The combination of Semrush’s tools, Re:signal’s SEO expertise, and the Learning with Experts team, have been able to move quickly with the implementation of recommendations and understanding where the biggest challenges lie. Strategy & Approach: Re:signal and Learning with Experts have focused on these different areas to increase organic visibility: Keyword Gap Analysis — Identify opportunities for growth by extending the number of related targeted keywords with high search volume by filling the gap with the competition. Visibility/ranking/traffic drops for main categories and opportunities — Investigate reasons for recent drops and secure content on the best keywords for main categories against possible fluctuations. Metadata reviews, speed audit, content audit, IA audits and link profile analysis — Identify opportunities for improvement of the site structure. Learning with Experts and the Re:signal team have set clear goals and targets to reach the organic growth potential. It was built in a time frame based on SEO consultancy and Content marketing, highlighting the weeks when these areas would be focused on. In the table below you can see the further details: Using Semrush’s Tools The Re:signal team used Semrush data to guide the creation of new content for each of the following areas in focus: Identified the competitors outperforming each product category in the search results. What those competitors weren’t doing too well, leaving them vulnerable to their SEO. Several Semrush tools were used for this project, but three specific reports were essential for the growth of this strategy: 1. Competitive research Re:signal conducted brief keyword research to identify opportunities for growth by extending the number of related targeted keywords with high search volume by filling the gap with the competition. With the Keyword Gap tool, they were able to identify the keywords that their competitors were ranking for and they’re not, what we call the “not ranking keywords”. They also identified the unique keywords for Learning with Experts and discovered gaps in competitors’ strategies. The team used this report to understand which keywords they were missing in order to benefit from incorporating a wider keyword variety in their content and also to identify opportunities for improvement of keywords ranking in positions #4-10 & #11-51. As we can see from the graph from the SEMrush report, Learning with Experts had 265 keywords missing in comparison with their competitors. The team found big opportunities like “online classes” (2,900), “garden design”(49,500), “cooking classes” (8,100) or “online fashion courses” (880). Overall, the number of ranking keywords when compared to direct competitors was the lowest and very limited. Closing the gap with the competitors especially for keywords with high search volume and ranking in position 1-10 — represented a strong potential for growth. 2. Site Audit Site Audit tool allowed the team to identify opportunities and tackle current issues by leveraging browser caching and ensuring a cache validator is present for static assets, compress images, use, and optimize css/js files. The first audit showed a few critical errors that were urgent to fix, including: 28 Crawl errors have been reported that need to be fixed; 35 pages seem to have Mobile Usability issues and need to be reviewed; Approx 10% of the crawled pages (266) with duplicate titles; 94% of the crawled pages seem not to present any canonical tag. 3. On-Page SEO Checker With On Page SEO Checker, the team identified opportunities for on-page content optimization and improved performance for main categories and most converting pages. Also, it was possible to identify opportunities to improve their Conversion Rate (CVR) on top converting sections. With this tool the team was able to analyze: The content length Inclusion of relevant keywords How informative the content is What type of content can be found on a webpage Through this tool, the agency made content suggestions, relevant to the Learning With Experts website, including: The category landing pages were not using a clear primary heading (h1). The content was too thin across a few pages, in regards to descriptive content. Metadata issues. 4. SEO Content Template With the SEO Content Template tool, the team got concrete recommendations for creating fully SEO-optimized content pieces. We chose target settings for location and device type in the tool, and then input the main keywords that we want to use to rank for in our content piece. After the data was collected, the team got concrete recommendations. We could also see how competitors were using our target keyword in their content. After collecting all the data, we could start creating content and checking its SEO-friendliness directly in the tool. Infographic What’s next? The client will receive from the agency continuous technical support for the implementation of dev fixes. Additionally, Re:signal will focus on Link building opportunities. With the Backlink Gap tool, the team will identify opportunities for Learning with Experts growth by improving the number of high authority linking domains and filling the gap with the competition. Using data from these reports, the team will assist Learning with Experts with content writing and briefing for category pages and assistance with product page content; Also, will focus on recommendations for overhauling existing blog content and the creation of new blog content, including topics and keywords.",
  "headers": [
    {
      "level": "H1",
      "text": "SEO Analysis Increases Global Classroom Community Visibility — Semrush Reality Show Episode #2"
    },
    {
      "level": "H2",
      "text": "Client Name: Learning With Experts"
    },
    {
      "level": "H2",
      "text": "Agency Name: Re:signal"
    },
    {
      "level": "H2",
      "text": "The Marketing Approach"
    },
    {
      "level": "H3",
      "text": "Strategy & Approach:"
    },
    {
      "level": "H2",
      "text": "Using Semrush’s Tools"
    },
    {
      "level": "H4",
      "text": "1. Competitive research"
    },
    {
      "level": "H4",
      "text": "2. Site Audit"
    },
    {
      "level": "H4",
      "text": "3. On-Page SEO Checker"
    },
    {
      "level": "H4",
      "text": "4. SEO Content Template"
    },
    {
      "level": "H2",
      "text": "Infographic"
    },
    {
      "level": "H2",
      "text": "What’s next?"
    },
    {
      "level": "H6",
      "text": "Most popular pages"
    },
    {
      "level": "H6",
      "text": "SEO Checklist: 41 Tips to Optimize Your Website"
    },
    {
      "level": "H6",
      "text": "How to Perform a Complete SEO Audit (in 14 Steps)"
    },
    {
      "level": "H6",
      "text": "A Beginner’s Guide to Keyword Search Volume"
    }
  ],
  "author": ""
}