{
  "url": "https://www.semrush.com/blog/semrush-position-tracking-tool-best-features/",
  "slug": "semrush-position-tracking-tool-best-features",
  "title": "13 Features To Try In Semrush Position Tracking Tool",
  "description": "Learn how the Semrush Position Tracking tool can help you easily track your SERP rankings for particular keywords and get traffic you want from specific locations and devices.",
  "content": "The Position Tracking tool has long been one of the most beloved tools in the Semrush software suite. The tool allows you to track and analyze SERPs and how you rank on them, including SERP features. With this SEO tracker, you can monitor specific geolocations and types of devices, sort tracking results, and statistics using various settings and filters, spot cannibalization issues, compare your SEO performance to that of the competitors, and export SEO reports.Next time you set up a campaign, here are 13 of the best features to take advantage of in our rank tracking tool. Here they are: #1 Hyper Targeting by ZIP Code #2 Devices and Locations Report #3 Competitors Discovery Report #4 Google Data Studio Integration #5 Cannibalization Report #6 Filtering by SERP Feature #7 Featured Snippets Report #8 Tracking Results in Local Pack #9 Interface Language Selection #10 Tags #11 Customized Alerts #12 Stunning PDF Reports #13 Tracking on the go!#1 Hyper Targeting by ZIP CodeFor a local business, it is essential to focus SEO efforts on the area in which it operates. Online visibility is critical, and nowadays it has a lot to do with proximity. So, having the ability to track and manage your search engine performance in an exact location is extremely beneficial.Editor's note: If you want to start with some local SEO basics, head to our guide on What is Local SEO.This feature allows you to track down your local SEO results on a ZIP Code level for even more specific tracking. That means you are getting the most accurate data and can focus on the most relevant local queries, attract more clients, and save your time and money.To try this feature, set up a new project or add a new location to an existing one. Start typing your postal code, or the name of your street, and get the drop-down list of suggestions.#2 Devices and Locations ReportAs businesses keep going global, users keep going mobile. This makes the work of SEOs a lot tougher because if you really want to know how a website is positioned, you’ll need to be tracking more than one location or device. That dilemma is exactly what makes this next feature so great.With a Guru subscription, you can track your target keywords across up to 10 targetings per Project — by targeting we mean the combination of location, device, and language. With a Business subscription, you can track target keywords across an unlimited number of targetings in a single Semrush Project.You can choose to track all of the same keywords in your targetings, or set a custom list of target keywords for each device or location. See below how it looks to track a set of target keywords in Italy on desktop (blue line) and mobile (green line) results in the same Project. #3 Competitors Discovery ReportTake a look at our Competitors Discovery report to see exactly who is competing for your target keywords in your target location and device. Once you select “Set as competitor” for one of these sites, you can track all of their positions alongside your own.If you find some kind of Wikipedia-like giant, you can just blacklist them in one click. It’s important to mention that for each location selected, you will get a relevant list of competitors.Find as many rivals as you can and add them to your Competitors list. Then, you can see who is winning in the Top 3, Top 10, Top 20, and Top 100 positions in our Rankings Distribution report.You can always come back to this report and see if a new company has unexpectedly improved its performance. Talented start-ups and old market players surprise us all the time.The competitor tracking part of this tool allows you to see up to 20 rivals in a table at once. The best part of this feature is that you can add or remove competitors at any time, and since we keep track of top 100 results for all keywords, you will be able to see historical data going back to the start of your campaign for any newly added rivals.You can manage your competitors from the Competitors Discovery tab, or from the settings gear drop down and selecting “Added competitors.”#4 Google Data Studio IntegrationIn 2019, we introduced an integration between Semrush and Google Data Studio.Now (with a Business subscription) you can add data from your Position Tracking campaign into a custom report or dashboard on Google Data Studio.Along with all of the other capabilities of Google Data Studio, this connection gives you full creative control over how you organize and present your data.Follow this link to try it out. Read more about how to use this connection on our Knowledge Base. #5 Cannibalization ReportDid you know that there is a report fully dedicated to spotting and helping you avoid keyword cannibalization? This tab was added to the tool in May of 2020 and gives your site an overall Cannibalization Health score based on how many instances of pages cannibalizing each other we found. You can analyze the affected keywords per page, total estimated traffic, and the pages most affected by cannibalization among the keywords you are tracking. #6 Filtering by SERP FeatureSERP Features change so frequently that it can be difficult to accurately check if they reduce the click-through-rate to the domain or not. Moreover, the quality of the answers provided in the snippet highly influences the user’s decision whether or not to jump to the website to “read more.”There are plenty of Google rich results that can help you attract attention to your snippet on the SERP. I would even call them “must-haves” for mobile SEO strategies, where at times the size of the screen means SERP Features are the only chance to stay visible. With a smart approach, you can choose SERP Features that will help you gain traffic, and avoid those that do not link to your domain but occupy the real estate of the SERP. In the Position Tracking tool we detect SERPs with or without the following SERP features, as well as a combination of them: Featured Snippet Local Pack Reviews AMP Site Links Video or Featured Video Top Stories People Also Ask Images Twitter Instant Answer Knowledge Panel. In addition, you can see the queries with paid results. While paid ads are not technically SERP Features, this information about the presence of paid ads on a SERP helps you estimate how visible your domain could be in these organic results.If there’s a lot of paid promo going on in the results, you might choose to invest in PPC rather than SEO to get the visibility you’re looking for.So, how can you play around with these filters? Here are some scenarios you might want to try out:1. Check which keywords in your campaign trigger a “Target SERP Feature” to see where you should focus your efforts.Choose in the SERP Features drop-down menu → “Feature on SERP” → select the target feature.2. Check to see which of your target SERP features are already occupied by your rivals. There will be times that you will see some giant is in a SERP feature and you won’t have a chance to move it. Don’t give up — find those queries where you can have a fighting chance to win.Set your domain as the first in the top menu, choose in the SERP Features drop-down menu → “your domain doesn’t rank” → select the target feature.3. Check where you managed to earn a SERP feature. It is a good way to show your client or boss that your strategy is working.Set your domain as the first in the top menu, choose in the SERP Features drop-down menu → “your domain ranks” → select the target feature.Check out our blog post on how the Semrush toolkit can help you win SERP features if you want to learn more.#7 Featured Snippets ReportIf you’ve already jumped to Position Tracking to play around with SERP features filters, there is a chance you may have started with Featured Snippets. A Featured Snippet is one of the most popular SERP features and to simplify the process of finding your low-hanging fruit, we added this new report.So how does it save you time?First, you will want to open this report and stay in the Opportunities tab. This will show you all of the keywords where there is a rival occupying a Featured Snippet.In the “Featured snippet URL” column you can go to your rivals page and analyze what is so special about it. These values could range from on-page SEO elements, the structure of the content, the way it answers a user's question, and other aspects that you have missed together with ‘position zero’.On top of that, this report will automatically show you all the Featured Snippets that you won, where you have lost them, and which keywords started or stopped triggering Featured Snippets in your location. With constantly increasing SERP volatility you have to remain flexible in your process.#8 Tracking Results in Local Pack The other ‘good to win’ SERP Feature is the Local Pack, especially if your business operates on a local level. Getting into local packs requires a lot of off-page work. This might include the need to edit your Google business listing, ensuring correct and consistent NAP data, and citation management.If the Local Pack is an opportunity that applies to you, don’t forget to set up your business name for all your locations to see where you managed to get into those Local Packs and where Google doesn’t include your domain. This area is especially important when you target mobile devices. If you notice that the spelling of your business name doesn’t match the one that you currently have in Local Packs, that is a red flag that could mean you need to go back to the previous steps and recheck the information you provided.#9 Interface Language SelectionSEO specialists working in multilingual countries face many challenges.Your customers speak and search for information in different languages. So, to track the most accurate results, you’ll need to make sure you specify both the location and the language of your target keywords in the setup stage. This will enable your campaign to track search results in specific languages as they appear in browsers in your set location. #10 TagsLet’s imagine we work on the SEO of an online store that sells sports equipment, clothing, and offers a big assortment of goods. In this case, we’ll be tracking thousands of keywords for various product categories, various locations, seasonal occasions, genders, ages, and colors. To avoid losing your sanity in a massive and unorganized mess, you’ll need to use tags. Assign the categories to your groups of keywords and you can easily sort them at any time while looking at your reports.Tags can be added from the initial setup window (as seen below) or at any point while your campaign is running by opening the Position Tracking settings menu.#11 Customized AlertsSave precious time and set up your own custom alerts to notify you only when an important change happens. #12 Stunning PDF ReportsEveryone that works in marketing faces the challenge of proving how your efforts bring valuable results. Numbers do the talking, but when you show them to your boss or client — they need to look pretty, too. With our PDF builder, you can make a visually appealing SEO report in minutes. This add-on eliminates the need to create reports by hand. If you set up recurring reports, they will automatically update your results and send it out to your chosen list of recipients.#13 Tracking on the go!Need to stay vigilant 24/7? Free and available for Android and iOS, our Position Tracking mobile app lets you monitor all your set up projects in all locations, wherever you are. Once logged in, you can view all your projects running in the tool. Check all the basic metrics (Visibility, Estimated traffic, Average position) to stay up to date with ranking fluctuations. Download Semrush app on the App StoreGet Semrush app on Google PlayKeep up with our product news in the News Section, here on our blog in the Discover Semrush category, or on our official Twitter account.And don’t forget to share with us all your thoughts and suggestions at tracking-tool-feedback@semrush.com.Let’s make our Position Tracking Tool even more awesome together.How to track SERP rankings and improve online visibility with the SEMrush Position Tracking tool",
  "headers": [
    {
      "level": "H1",
      "text": "How to Track SERP Rankings with the Semrush Position Tracking Tool"
    },
    {
      "level": "H2",
      "text": "#1 Hyper Targeting by ZIP Code"
    },
    {
      "level": "H2",
      "text": "#2 Devices and Locations Report"
    },
    {
      "level": "H2",
      "text": "#3 Competitors Discovery Report"
    },
    {
      "level": "H2",
      "text": "#4 Google Data Studio Integration"
    },
    {
      "level": "H2",
      "text": "#5 Cannibalization Report"
    },
    {
      "level": "H2",
      "text": "#6 Filtering by SERP Feature"
    },
    {
      "level": "H2",
      "text": "#7 Featured Snippets Report"
    },
    {
      "level": "H2",
      "text": "#8 Tracking Results in Local Pack"
    },
    {
      "level": "H2",
      "text": "#9 Interface Language Selection"
    },
    {
      "level": "H2",
      "text": "#10 Tags"
    },
    {
      "level": "H2",
      "text": "#11 Customized Alerts"
    },
    {
      "level": "H2",
      "text": "#12 Stunning PDF Reports"
    },
    {
      "level": "H2",
      "text": "#13 Tracking on the go!"
    },
    {
      "level": "H6",
      "text": "Most popular pages"
    },
    {
      "level": "H6",
      "text": "SEO Checklist: 41 Tips to Optimize Your Website"
    },
    {
      "level": "H6",
      "text": "How to Perform a Complete SEO Audit (in 14 Steps)"
    },
    {
      "level": "H6",
      "text": "A Beginner’s Guide to Keyword Search Volume"
    }
  ],
  "author": ""
}