{
  "url": "https://www.semrush.com/blog/seo-roi/",
  "slug": "seo-roi",
  "title": "The ROI of SEO: How to Measure SEO ROI (with Formulas)",
  "description": "SEO ROI measures how much revenue SEO generates compared to its cost. Learn how to measure it.",
  "content": "Are you unsure about potential SEO returns for your business? Or maybe you need help justifying your SEO budget to stakeholders.Either way, it’s important to understand SEO return on investment (ROI).Below, we'll show you how to measure the ROI of SEO. Step by step. But first, let's cover some basics.What Is the ROI of SEO?The ROI of SEO measures how much revenue SEO activities generate for a business compared to their cost. It’s one of the most important concerns for any SEO consultant or manager. (Or anyone who does SEO, really.)It’s an essential key performance indicator (KPI) to measure. It helps tie your SEO efforts to business goals. You’ll have a positive SEO ROI if the revenue generated by your SEO strategy is higher than its cost.The SEO ROI formula is simple. It’s similar to calculating ROI for any other type of investment. It looks like this:For example, if the revenue from SEO is $5,000. And the total SEO cost was $2,000, then the ROI is 150%.However, SEO ROI depends on multiple factors. Such as industry, competition level, website history, SEO strategy, and more. For instance, industries with higher online competition might see a slower or lower ROI. Because they can need more effort and resources to rank well.But the potential ROI and benefits of a well-executed SEO strategy make it a worthwhile investment for many businesses.For example, using Semrush’s Organic Research tool, we see that the graphic design suite Canva gets around 19.8 million monthly organic visitors from the U.S. Which would cost $26.4 million in monthly ad spend—if it acquired this traffic from paid advertising. Note that it’s the monthly organic traffic from just the U.S. alone. The Domain Overview tool shows that Canva attracts over 168 million monthly organic traffic worldwide. This organic traffic not only brings visitors but also represents a substantial monetary value. Which companies would otherwise need to invest in paid advertising to achieve. However, it can take time to see such significant SEO results.However, if you plan and execute an SEO strategy the right way, it can generate exponential (and recurring) ROI over the years. Why Is Measuring the ROI of SEO Important?Organic search is a top traffic source for websites. Plus, almost every purchase today involves organic search in some way. With SEO being such an important traffic channel, you should know its financial value for your business. Let’s look at some more reasons to measure the ROI of SEO: Communicating success: While you should track other SEO KPIs, the ultimate measure of profitability is positive ROI. If you can prove a positive ROI, you’ll have a much easier time proving success and getting buy-in from stakeholders. Allocating resources: Tracking ROI helps you know which SEO tactics work (and which don’t). So you can allocate resources accordingly. Benchmarking: Measuring ROI coupled with competitor analysis reveals whether you’re outperforming or falling behind your competitors. So you can strategize your future SEO efforts. And stay ahead of the competition. That said, let’s see how to determine SEO return on investment. How to Measure SEO ROIWe already know the formula to measure the ROI of SEO:To fill the data in this formula, we need two main components: SEO costs: The total investment in SEO activities Revenue from SEO: The total value of conversions (or sales) generated from SEO effortsLet’s go through the required steps.1. Calculate Your SEO InvestmentFirst, you need to calculate the cost of your total investment in SEO. Add all the costs associated with the channel. Use this as your investment figure. Typically, these costs can include:In-House SEO ResourcesThese are employees who work on SEO 100% of the time. Some roles—like copywriters or developers—may only occasionally work on SEO tasks. In this case, break down their cost to an hourly or daily rate. Track their time spent on SEO tasks and add it to your calculation. Freelancers and AgenciesIt’s simple to track SEO investment for outside SEO agencies and freelancers. Because most agency contracts are on a retainer model, usually with a fixed monthly fee.Add agency fees (or freelancer rates) directly to your investment calculation. Further reading: How to Outsource SEO: A Step-by-Step GuideToolsIf your team uses SEO tools (like Semrush), take the monthly cost and add it to your calculation. If there are tools that other departments share, consider partially including the cost. Add these up. Content Distribution CostsSEO investment doesn’t just include content creation costs. You also have to add content distribution and promotion costs. Such as social media promotion, influencer outreach, and email marketing. And the costs of tools you’d use for these activities. Link Building CostsLink building costs mainly consist of money spent on various activities for guest posting campaigns. Include all related expenses.That’s your total cost of SEO investment. NoteThese costs might change every month—which is normal. Just account for any changes when measuring your ROI of SEO. 2. Track and Analyze ConversionsNext, track and measure the value of each conversion. For this step, you’ll need Google Analytics 4 (GA4) (or a similar tool). It can help you quickly and easily measure your business’s revenue from organic search. But the type of conversions you track and the value you assign them are different for every business.For example, ecommerce stores can use tracking to pull sales data from their online transactions. And accurately measure their revenue. However, lead generation businesses have to set up goals (like form submissions) and assign them dollar values. Here’s how to set up conversion tracking for ecommerce and lead-gen businesses.Tracking Ecommerce Conversion ValuesTo start collecting ecommerce conversion data, add ecommerce events to your website in Google Tag Manager (GTM). If you haven’t set it up yet, follow Google’s instructions. Once you start tracking, you’ll see an ecommerce report with detailed information about your transactions. In Google Analytics, go to “Reports” > “Monetization” > “Ecommerce purchases.”Like so:Then, filter to organic traffic. Click “Add filter.” Then select “Session source/medium” in the drop-down under “Dimension” and “google/organic” underneath “Dimension values.”Then, click “Apply.”The detailed information is great. But we specifically want one number: the conversion value. So, click the “Insights” icon on the top right. The tool will display the total revenue for the selected time frame. Like this:This is your total value of conversions. Tracking Lead Generation Conversion ValuesTracking conversions can be more challenging if you don’t make sales on your site.Unlike ecommerce transactions, a lead (or a conversion) doesn't have a specific associated value. Unless you assign one. Do this in Google Analytics. Head to “Admin” -> “Events.”And click “Create event.”Then, create events for each of your conversions. These can be any actions that contribute to your business’s success. Like form submissions, free trial signups, or visits to a certain page. Let’s create an event for a form submission.First, give your event a name. Then select your “Parameter,” “Operator,” and “Value.” You should see your conversion under “Existing events.” Next, toggle the switch under “Mark as conversion.” You’ll now see your event as a conversion in the “Conversions” tab. You still need to assign a monetary value to your conversion. To do so, go to your event. In the “Parameter configuration” section, click “Add modification.”And in the “Parameter” field, enter a currency type (e.g., EUR) and enter the value (e.g., “50” for 50 euros).Click “Save,” and you’re done. Use this to help you calculate the ROI of your SEO. Every time an event is triggered, a monetary value is assigned to it.But how do you know how much value to assign to each event?The simplest (and usually most effective) way is by calculating:Customer LTV is the total amount a customer is expected to spend with your business during the average lifetime of your relationship. And lead conversion rate is the percentage of leads you generate that turn into sales. For example, let’s say the average lifetime value of a customer is $20,000 and your close rate is 15%. Your goal value should be set at $3,000. Of course, this method involves some assumptions and variables. However, it's a way to calculate the return for a business where leads are the main source of conversions. Understanding Assisted ConversionsThere are often multiple touchpoints in the customer’s buying journey before they finally convert. SEO can play a role in initial brand awareness or later research stages. Even if it’s not the last touchpoint before the purchase.However, you don’t need to factor in the assisted conversions separately now. The conversion reports in Google Analytics 4 already account for these partial contributions. From organic search to final conversions. But it still makes sense to check how different channels contribute to conversions. Click “Advertising” > “Attribution” > “Attribution paths” in Google Analytics. Choose the conversion event you want to analyze. You’ll see how organic search contributes to different touchpoints in customers’ conversion journeys. By this stage, you have the cost of investment in SEO and the value of your conversions. You're ready to calculate your SEO campaign's ROI.3. Calculate Your Return on InvestmentOnce you have the numbers you need, calculating your ROI from SEO is easy.Use the same formula you saw before:SEO ROI = (SEO revenue - SEO costs) / SEO costsLet’s assume that in one month, your SEO campaign generated $200,000. And the cost of investment was $40,000. Plug these figures into your formula:($200,000 - $40,000) / $40,000 = 4That means for every $1 you spent on SEO, you saw a return of $4. In other words, your ROI is 400% (4 x 100 to get a percentage). That's all there is to it. Use this formula to calculate the ROI of your SEO campaign across any period you choose. As long as you know the costs and returns. How to Forecast SEO ROINow that you know how to measure the ROI of SEO, start to think about forecasting. Whether you work in-house or at an agency, you’ll likely have to project how much growth and revenue you expect to generate.In any case, forecasting SEO ROI is important. It helps allocate resources, prioritize SEO efforts, and make adjustments. To start, consider the following: Your website’s past SEO performance Your traffic potential Your average conversion rate To see a site’s SEO performance, plug its URL into Semrush’s Domain Overview tool and click “Search.” Head to the “Compare domains” tab and add your top four competitors. Then, click “Compare.”If you scroll down, you’ll see a monthly traffic trend graph. Toggle between “Organic” and “Paid” to see if any competitors are driving traffic via pay-per-click (PPC) ads.Scroll down further, and you’ll see two boxes. Check “Top Opportunities” to find keywords you should create content around. And “Keyword Overlap” to see the intersecting keywords among your competitors. This shows the connection between organic traffic and content in your industry. As for traffic potential, use our Traffic Analytics tool. Launch the tool and add your top four competitors. Then, click “Analyze.”You’ll see the overall trend of visits, pages per visit, visit duration, bounce rate, and more. Take note of how overall traffic performance changes per quarter. You can also go to the “Top Pages” tab to see which pages get the most traffic. Then, click on “Show Insights” to find pages with growing and declining traffic.Observe any seasonal changes. See how your site’s organic traffic performs compared to others. And look for trends that can help you forecast future strategies. Finally, consider your average conversion rate. You should have already calculated this if you’ve measured your SEO ROI. Create hypotheses based on all the data you gathered. Think about which SEO activities can create which outcomes and result in how many conversions (and how much revenue). Challenges of Calculating and Communicating SEO ROINow, let’s look at the nuances and challenges of calculating and communicating SEO ROI.They are: Isolating SEO efforts: It can be difficult to attribute conversions solely to SEO. Because customers are influenced by multiple factors. Like search visibility, paid ads, branding efforts, and more. Non-financial benefits: SEO also generates value beyond conversions. For example, increased brand visibility, improved user experience, and more authority. It’s difficult to assign a dollar value to these long-term benefits. Long time frames for returns: It takes time to get significant results from organic search. So, it’s a big task to justify SEO investment to stakeholders. Who usually expect quick gains. Ongoing returns from past efforts: Successful SEO campaigns continue to deliver value over time. So, it becomes difficult to calculate ROI for specific periods. TipFocus on the bigger picture when communicating SEO ROI. Highlight the long-term, cumulative benefits of SEO in addition to tangible metrics.How Long Does It Take to See ROI from Your SEO Efforts?While you may see some quick wins early on, getting significant results from SEO takes time.Typically, it can take 4-12 months to see the benefits of SEO, according to Google’s Maile Ohye.In most cases, SEOs need four months to a year to help your business first implement improvements and then see potential benefit.— Maile Ohye, GoogleSo, keep in mind that SEO is a long-term play. If you consistently invest time, effort, and resources. The ROI compounds over time. While you do that, track your keyword rankings and site visibility with the Position Tracking tool.Follow the configuration instructions to set up keyword position tracking. Once you’ve set up the tool, you’ll see a dashboard like this:Let’s say you want to analyze keywords in positions 4-10. To find optimization opportunities for ranking in the top three positions.Go to the “Overview” report. Click the “Top positions & changes” drop-down menu. Select “# 4-10” and “All.”Scroll down to see your report for keyword rankings # 4-10. Now, check the keywords with low keyword difficulty (KD%) and high search volume. They’re low-hanging fruits. Identifying and capitalizing on these opportunities can boost your SEO and drive impactful results for your business. Create an alert by clicking the bell icon at the top.For example, get a notification when a keyword ranking drops from the top three positions. And take action to regain the position. To learn more, read our detailed guide to keyword tracking.Measure Your SEO Progress with SemrushKnowing the ROI of your SEO is a powerful way to prove your efforts are working. Use it to get buy-in for additional investment in your SEO strategy.Think about it—if you prove a stable ROI on SEO, it’ll likely be easier to ask for further investments in talent, new tools, and more.Improve your SEO ROI with Semrush’s SEO tools: Examine a domain’s SEO growth trends with Domain Overview Analyze your competitors’ website traffic with Traffic Analytics Monitor your (and your competitors’) keyword rankings with Position Tracking toolGet started enhancing your SEO ROI with a free Semrush account today.",
  "headers": [
    {
      "level": "H1",
      "text": "The ROI of SEO: How to Measure SEO ROI (with Formulas)"
    },
    {
      "level": "H2",
      "text": "What Is the ROI of SEO?"
    },
    {
      "level": "H2",
      "text": "Why Is Measuring the ROI of SEO Important?"
    },
    {
      "level": "H2",
      "text": "How to Measure SEO ROI"
    },
    {
      "level": "H3",
      "text": "1. Calculate Your SEO Investment"
    },
    {
      "level": "H3",
      "text": "In-House SEO Resources"
    },
    {
      "level": "H3",
      "text": "Freelancers and Agencies"
    },
    {
      "level": "H3",
      "text": "Tools"
    },
    {
      "level": "H3",
      "text": "Content Distribution Costs"
    },
    {
      "level": "H3",
      "text": "Link Building Costs"
    },
    {
      "level": "H3",
      "text": "2. Track and Analyze Conversions"
    },
    {
      "level": "H3",
      "text": "Tracking Ecommerce Conversion Values"
    },
    {
      "level": "H3",
      "text": "Tracking Lead Generation Conversion Values"
    },
    {
      "level": "H3",
      "text": "Understanding Assisted Conversions"
    },
    {
      "level": "H3",
      "text": "3. Calculate Your Return on Investment"
    },
    {
      "level": "H2",
      "text": "How to Forecast SEO ROI"
    },
    {
      "level": "H2",
      "text": "Challenges of Calculating and Communicating SEO ROI"
    },
    {
      "level": "H2",
      "text": "How Long Does It Take to See ROI from Your SEO Efforts?"
    },
    {
      "level": "H2",
      "text": "Measure Your SEO Progress with Semrush"
    }
  ],
  "author": ""
}