{
  "url": "https://www.semrush.com/blog/seo-product-description/",
  "slug": "seo-product-description",
  "title": "SEO Product Descriptions: What They Are & How to Write Them",
  "description": "Learn how to write SEO product descriptions that rank in search and convert shoppers into customers.",
  "content": "What Is an SEO Product Description?An SEO product description is written content that’s designed to inform shoppers about a product, convert shoppers into customers, and increase the product’s visibility in unpaid search results. Ecommerce sites can use SEO product descriptions on product pages to rank higher for relevant keywords in Google.For example, here’s a product description from Hydro Flask:This helps the page rank for keywords like “64 oz water bottle”:This keyword alone gets 9,900 searches per month, according to Semrush’s Keyword Overview tool. And it has commercial search intent (i.e., users are doing research before making a purchase decision).So, you can see the value in doing SEO for product pages.You can also use SEO product descriptions in other locations, such as: Online marketplaces: Adding optimized descriptions to listings can help you rank higher on Amazon and other marketplaces. And get your third-party product pages ranked on Google. Social media platforms: Some social media platforms, like Facebook and Instagram, allow you to create product catalogs. SEO descriptions can help your products get discovered through search. Google Merchant Center: Effective product feed descriptions can improve performance of your Google Shopping ads. And help you get free product listings on Google surfaces.How to Write SEO Product DescriptionsLearn how to write a product description that generates organic traffic and conversions.Here are seven best practices:1. Optimize for Target KeywordsWhen doing SEO for products, target keywords are search queries you want to rank for.Using target keywords in product descriptions can help you rank higher in search results. Because it helps prove your product is relevant to the user.To find what people search on Google, perform keyword research with Semrush’s Keyword Magic Tool.Enter a word or phrase related to your product. Then, choose your country and click “Search.”You’ll see keywords that contain your starting term(s) or a close variation.To focus on keywords that people use while shopping, filter for transactional search intent.Like this:If you’re optimizing your product feed, filter for keywords that trigger product listing ads. And other Google Shopping-related SERP features.Like this:Once you’ve finished applying filters, choose target keywords. Making sure your product matches what the searcher is looking for.Generally, more specific keywords are better for SEO product descriptions. Even though their search volumes (average number of monthly searches) are likely to be lower.Why?Long-tail keywords tend to have lower keyword difficulty scores (KD %). Meaning it’s easier to rank on Google’s first page.Plus, specific keywords attract highly targeted traffic. Meaning your sales conversion rate should be higher.Think of it this way:Who’s more likely to buy a 64oz stainless steel water bottle: Someone who searches for that exact thing, or someone who searches “water bottles”?Whatever keywords you choose, incorporate them naturally.Don’t write something like this:\"Stay hydrated with our 64oz Stainless Steel Water Bottle, your ultimate hydration partner! This 64oz stainless steel water bottle, made from quality stainless steel, is the water bottle for all your hydration needs. Forget about other water bottles, this stainless steel bottle with a 64oz capacity keeps your water cool all day. If you're in search of a water bottle, then our 64oz Stainless Steel Water Bottle, featuring stainless steel construction, is the best water bottle choice for you.\"Forcing keywords into your SEO product descriptions is a practice known as keyword stuffing. It’s against Google’s spam policies. And it can put potential customers off, too.Tip: Find keywords for your Amazon product descriptions with the Keyword Wizard for Amazon.2. Adopt the Right Tone of VoiceTone of voice refers to the personality behind your brand’s writing. Choosing the right tone of voice—and using it consistently—helps you build a brand identity. And engage your target audience.So, it’s important that it shines through in your SEO optimized product descriptions.For example, Firebox uses humor to emphasize the quirkiness of its products:While Nike empowers audiences with strong and confident language:For help with tone of voice, use Semrush’s SEO Writing Assistant.The tool analyzes your text in real time. And highlights sentences that are too casual or formal, based on your target tone.The SEO Writing Assistant also scores your originality, readability, and SEO. If you need help rephrasing or composing content, take advantage of the Smart Writer tools. 3. Prove Your Product’s ValueTo persuade people to buy your product, you need to show the value that’s in it for them.So, use these tips when writing product descriptions:Translate Features into BenefitsIt’s important to explain the benefit behind each product feature.For example, people don’t really care that this Dyson vacuum cleaner has nylon bristles. But they do care that those bristles “remove stubborn dirt and pet hair from carpets and rugs.”Use Lifestyle CopywritingLifestyle copywriting is about selling the experiences a product can offer.It paints a picture of a life the target audience desires. To tap into their aspirations and emotions. And, ultimately, prompt purchases.Let’s say you’re writing an SEO product description for hiking boots.As well as talking about features and benefits, you could talk about adventures in the wilderness. Fun days out with the family. Or whatever appeals to your target audience.If you haven’t already, create buyer personas (profiles that represent each type of target customer).Throughout this process, you’ll define your target customers’ goals, values, and pain points. And document them for easy reference.Here’s an example created with the Semrush Persona tool:Support Your ClaimsWhen making claims about your product, you need to back them up. In order to build trust with your potential customers.Many marketers fall into the trap of making generic and unsubstantiated claims—for example, saying that a product is “easy to use.”Instead, explain how to use the product. And let readers come to that conclusion themselves.Facts and figures can also inspire confidence in your products.For example, here’s part of Amazon’s product description for the Kindle Paperwhite:\"Kindle Paperwhite is IPX8 rated to protect against accidental immersion in up to two meters of fresh water for up to 60 minutes, and up to 0.25 meters of seawater for up to 3 minutes.\"4. Improve ReadabilityMake your SEO product descriptions easy to read. So that shoppers can find and absorb information more easily. Here are a few simple tips you can use: Use proper spellings and grammar (tools like Grammarly can help) Replace complex words with short, familiar words Remove unnecessary words to keep your writing concise Keep sentences short (under 20 words) Avoid the passive voice Break up text using line spaces, headers, bullet points, etc.Wondering how long a product description should be?Get a recommended text length and readability score for your product page with Semrush’s SEO Content Template.Enter your target keyword(s), choose your location and device, then click “Create content template.”The tool will analyze your top 10 Google rivals. And build a content brief accordingly.Scroll down to the “Key recommendations” section:See how competitors use your target keywords, too. These SEO description examples can help you write your own content. And optimize it effectively.When you’ve finished reviewing your brief, go back to the top of the page. Where you’ll find various options: Order content writing: Send the brief to a professional writer Export to DOC: Save your brief as a .docx file Real-time Content Check: Use your brief in the SEO Writing Assistant5. Use AI to Your AdvantageAI copywriting tools can make it quicker to write SEO product descriptions.For example, the AI Writing Assistant has tools for: Amazon Product Descriptions Ecommerce Description Bullet Points Ecommerce Product Names Ecommerce Product Descriptions Product DescriptionsSign up for your free 7-day trial and choose the tool you’d like to use.Then, fill out the form and choose the number of results you want.Click “Generate” when you’re done.Choose your favorite result. And click “Check Plagiarism” to ensure the text is original.You can then copy or save your product description.Whatever AI tool you use, it’s crucial to fact-check your content before publishing.And for the best results, make other improvements manually. Based on the tips in this guide. The more you tailor your SEO product descriptions to your brand and target audience, the better their results should be.Tip: For similar reasons, avoid using fill-in-the-blanks product description templates. Boilerplate content offers less value to the reader and may harm your SEO.6. Add Structured DataIf you add structured data (or schema markup) to your product pages, Google can create rich snippets.These are enhanced search results. Which can drive more traffic to your site.For example, the result below includes the product’s rating and price. As well as weight and height information. All thanks to product structured data.To get started, go to Google’s Structured Data Markup Helper.Select “Products.”Then, enter your product page URL and click “Start Tagging.”Next, highlight your SEO product description and click “Description.”Repeat this process to tag other elements. Including the product name, price, and aggregate rating.When you’re finished, click “CREATE HTML.”Then, click “Finish” and follow the instructions provided.Once your page is updated, check everything’s working with Google’s Rich Results Test.Tip: Product SEO goes far beyond descriptions. For more advice, learn about SEO for landing pages.7. Include Useful InformationGive shoppers all the information they might need to make a purchasing decision.Product descriptions should include features, benefits, and technical specifications. But the best descriptions can also include usage and maintenance instructions, packaging and environmental information, FAQs, comparison tables, testimonials, and more.Here are some other elements to include on your product pages: Call to action buttons (e.g., “Buy Now”) Product images and videos Pricing and special offers Delivery and returns information Stock availability Links to related products or categories Customer reviews Awards and accolades Social sharing buttons Live chatAmazon, Apple, and Walmart are the biggest retail sites in search, according to the Semrush Rank for February 2024. So, try looking at their sites for product SEO examples.How to Hire a Professional WriterIf you’re short on time or want better results, consider hiring a professional writer for your SEO product descriptions.On Semrush’s Content Marketplace, you can order product descriptions in minutes. And you’ll pay a set rate based on word count alone.Click “Order Now” under the service you want.Then, fill out the brief to let our team know what you need.We’ll match you with a trained writer who’s suited to your industry. And deliver your unique product descriptions within five working days.",
  "headers": [
    {
      "level": "H1",
      "text": "SEO Product Descriptions: What They Are & How to Write Them"
    },
    {
      "level": "H2",
      "text": "What Is an SEO Product Description?"
    },
    {
      "level": "H2",
      "text": "How to Write SEO Product Descriptions"
    },
    {
      "level": "H3",
      "text": "1. Optimize for Target Keywords"
    },
    {
      "level": "H3",
      "text": "2. Adopt the Right Tone of Voice"
    },
    {
      "level": "H3",
      "text": "3. Prove Your Product’s Value"
    },
    {
      "level": "H4",
      "text": "Translate Features into Benefits"
    },
    {
      "level": "H4",
      "text": "Use Lifestyle Copywriting"
    },
    {
      "level": "H4",
      "text": "Support Your Claims"
    },
    {
      "level": "H3",
      "text": "4. Improve Readability"
    },
    {
      "level": "H3",
      "text": "5. Use AI to Your Advantage"
    },
    {
      "level": "H3",
      "text": "6. Add Structured Data"
    },
    {
      "level": "H3",
      "text": "7. Include Useful Information"
    },
    {
      "level": "H2",
      "text": "How to Hire a Professional Writer"
    }
  ],
  "author": ""
}