{
  "url": "https://www.semrush.com/blog/seo-blog-post/",
  "slug": "seo-blog-post",
  "title": "How to Write an SEO Blog Post: 11 Key Tips",
  "description": "Learn to optimize your blog posts for search engines. And boost your chances of ranking in search results.",
  "content": "An SEO blog post is optimized to rank well in organic search results. It uses SEO best practices and meets the quality standards that matter to users and search engines.SEO-friendly blog posts can increase your website’s visibility in search engine results pages (SERPs). And drive qualified traffic to your website. In other words, users interested in your products or services.The below tips will show you how to write blog posts for SEO. And offer insights for creating high-quality content tailored to your target audience.1. Choose a Target KeywordEach blog post you publish has the opportunity to rank for relevant keywords. You should optimize each post with a target keyword in mind. A target keyword (or primary keyword) is the main keyword you want the page to rank for. It’s often a high-level term that encompasses a broad topic. Like “indoor garden tips” or “best gardening tools.” But you can also optimize your blog post for: Secondary keywords: Variations and synonyms of your primary keyword Related keywords:Terms or subtopics related to the primary keyword Long-tail keywords: More specific related keyword phrases that have lower search volume but high intent Questions: Related questions that users commonly ask about the topic you’re writing aboutA great SEO blog post may rank for hundreds of different search queries. But your target keyword will serve as the foundation of your strategy (and the other tips in this article). To find a primary keyword, use the Keyword Magic Tool. Enter the primary topic of your blog post. Input your homepage URL and your target location. Then, click “Search.”TipNot sure where to start? Start with a general description of the topic you’re writing about. As an example, we’ll use “dog training.”The tool will provide a table of keywords related to your search. Plus, a variety of metrics that can help you determine the best target keyword for your blog post.Pay particular attention to the following columns: Intent: The main goal behind the user’s search (more on this later) Volume: The average monthly searches for the keyword (over the last 12-month period). A target keyword should have decent search volume. So more people see your blog post. Personal Keyword Difficulty (PKD%): How difficult it is for your specific website to rank well for the keyword based on your current website authority. The higher the percentage, the more challenging it may be to rank for the keyword. SERP Features: Various features that appear in the SERP results for the term (e.g., video results, People Also Ask, etc.). These may influence how you structure your blog post. Or what elements you include on the page.Review the columns to determine the best target keyword for your post. You can also use the filters above the table to narrow down your choices.For example, click the “Personal KD%” filter, then choose “Easy” or “Very Easy.”This will filter the table to the keywords with the lowest PKD%. Choosing one of these low-competition keywords may increase the chances of your SEO blog post ranking at the top of results.Once you have your target keyword in mind, you’re ready to execute the next tips.2. Meet Search IntentSearch intent is the purpose behind the user’s query—what they’re hoping to find. Google wants to rank webpages that match the searcher’s intent. To provide users with a more satisfying experience.So, your blog post needs to satisfy user intent to rank. The four main types are: Navigational: When users are seeking a specific website, business, or brand Informational: When users are looking for more information about a topic Commercial: When users are researching about a potential or future purchase Transactional: When users want to make a purchase (or other transaction/conversion) soonDiscover intent by looking at the top-ranking results for a keyword. For example, the keyword “how to crate train a puppy” has informational intent. Google ranks “how-to” style blog posts at the top of results for this query.But the keyword “best crates for puppies” has both transactional and commercial intent. The user may be ready to buy right now or still be researching. So, Google shows a comparison guide and a listicle-style blog post that contrasts different dog crates. And the left-hand side features filters for crate sizes, features, and price ranges. Helping users refine their search for specific products.The search intent of your target keyword should influence the style or type of blog post you create. Pro tipYour blog posts should be primarily optimized for keywords with informational or commercial intent. Because users with those intents are more likely to engage with long-form content. If you want to rank for keywords with transactional intent, optimize your product, category, or service pages for those queries. Another way to find the search intent of your target keyword is to use Semrush’s Keyword Overview.Enter your target keyword, your homepage URL, and your target location. Then, click “Search.”You’ll find search intent under the “Intent” column. Match that intent throughout the writing and optimization process.3. Structure Your Content with HeadingsHeadings make your blog post easier to read and scan. They also provide the opportunity to include secondary and related keywords. Which can increase your rankings for those terms as well.Below are examples of H1 through H6 headings:Visually, headings break up large sections of text. They also make it easier for users to navigate through your blog post to find the exact information they are looking for.For search engine bots, heading tags communicate more about the content on the page. And the topical depth and breadth of your SEO blog post. Here are some tips for optimizing your heading tags: Only use one H1 tag. It should include your target keyword and be the same as your title tag. Use a logical hierarchy. H2s should appear below your H1, H3s below your H2s, and so on. Include secondary keywords. And elaborate on those topics in the body content. Be descriptive and concise. Headings that are too long can be difficult to read and scan.4. Use Keywords Throughout Your Blog PostUse your primary and secondary keywords throughout your SEO blog post. To increase your chances of ranking for those terms.But do so naturally and without keyword stuffing. Here’s an example of what keyword stuffing looks like.Incorporating secondary keywords into your blog post is a great way to avoid keyword stuffing. But you can also include semantically related terms.Use Semrush’s SEO Content Template to find them.Enter the primary keyword of your blog post. Select your target location. Then, click “Create content template.”The tool will generate a template for creating a blog post on the topic. Look to the table labeled “Key recommendations (based on your Google top 10 rivals).” Then, find the row labeled “Semantically related keywords.”Adding these terms into your blog post can help you increase your topical relevance for the target keyword.Without having to use the same term over and over again.If you need more ideas for how to use keywords, scroll down to the section labeled “See how your competitors use your target keywords.”Click “Show more” under any item in the list to expand the content.These examples are from the top-ranking search results. So, it’s a good idea to use them as ideas for your own post. You’ll find more helpful guidance in the content template. For example, a suggested text length:5. Add Visuals and MultimediaImages, videos, and audio can make your blog post more engaging for users. In some cases, they may be a requirement for ranking at the top of results.For example, this blog post from beChewy ranks for “how to crate train a puppy.” It uses high-quality visuals to illustrate each step.This not only makes the post engaging, it helps satisfy search intent. Because the user is looking for a how-to guide with details for each step of the process.Using various types of media is also a great way to break up large blocks of text. It can also provide a better user experience, which can have indirect impacts on your SEO efforts.NoteWhen adding multimedia to your blog posts, make sure those elements don’t slow down your page load times too much. Which can actually work against your optimization efforts.So, follow image SEO best practices. Like compressing images and using modern image formats. To learn more, read our image SEO guide. 6. Optimize Your Blog TitleThe title tag of your blog tells users and search engines the main topic of your post. It can impact what keywords your blog post ranks for. And Google may use your title tag in the SERPs as the blue, clickable hyperlink to your page. Like this:Your title tag can also influence whether users click through to your post. So, here are some tips for optimizing yours: Google will only display around 60 characters of your title tag (or 600 pixels). Don’t exceed this number. Include your primary keyword as close to the beginning of your title as possible Have a unique title tag from other pages on your site. Otherwise, Google may get confused on which page to rank. Make sure your title is communicative and click-worthy7. Write an Engaging Meta DescriptionA meta description gives users and search engines more information about the topics and subtopics your blog post covers. It may also appear with your SERP result beneath the title tag.Like this:Meta descriptions are not a direct Google ranking factor. But they present an opportunity to add keywords. And entice users to click through to the page.Some best practices for meta descriptions are: Less than 105 characters (680 pixels on mobile) Includes related keywords or keyword variations Optimized for search intent Includes click-worthy information or a call to action (CTA)8. Include a Detailed Author BioAuthor bios give users more information about the creator of the blog post. Like the author’s relevant industry experience or expertise in the subject matter.It usually appears at the end of a blog post. Here’s an example:Author bios help your blog post showcase two important quality signals: experience and expertise.These are the first two items in E-E-A-T (Experience, Expertise, Authoritativeness, Trust)—guidelines Google’s Search Quality Raters use to evaluate the quality of web content.To showcase expertise and experience in your author bios, do the following: Hire industry experts to write and create your content Include the author’s education, degrees, or certifications Highlight their industry experience and the primary topics they write about Create author pages that link to all of the blog posts the experts have written for your website9. Add Expert InsightsIncluding expert insights in your blog posts increases your website’s credibility and trustworthiness.There is so much content on the internet. And much of it is being written by AI. Content that is accurate, well-sourced, and enhanced with insights from real people can differentiate your website. And it can help your content rank higher. Expertise is an important part of creating content that displays both E-E-A-T and helpfulness. Here are some practical ways to add expert insights: Hire an industry expert to write or contribute to your blog Interview an industry expert and quote their insights in your post Include external links to authoritative websites, original research, case studies, or primary sources10. Add Links to Other Relevant ContentInternal links point to other relevant blog posts or pages on your website. They help users find relevant content. And help search engines discover new pages.They also showcase that your website features lots of helpful content about topics in your industry.The more content you have on your site, the easier it will be to find internal linking opportunities. Here are some important best practices to follow: Prioritize relevance and natural linking. You should only link to pages that provide users with value. Pay attention to anchor text (the clickable text that appears with the link). It should be concise and accurately describe the content of the linked-to page. Don’t internally link to pages with 301 redirects. Search engine bots will follow the links on your blog, so only send them to the most up-to-date URL.11. Use a Short, SEO-Friendly URLA URL is the web address of a page. Ideally, it should communicate to users what your page is about. And where a page is located in your website’s hierarchy.When publishing your blog post, your content management system (e.g., WordPress, Shopify, etc.) may generate a unique URL for your post. It might look like this:mydomain.com/post-id?=8394asddkfueBut that doesn’t give users very much information about the page. So, it’s important that you customize your blog post URLs.Here’s an example of a bad versus good URL for SEO purposes.And here are some best practices for creating SEO-friendly URLs: Use the HTTPS protocol, as this is a direct Google ranking factor Leverage subfolders to organize your content. Many sites use the subfolder /blog/ to organize their blog posts. Be concise. Long URLs are less user-friendly and not as shareable. Include your primary keyword in your URL slugOptimize Your Blog Posts for Search EnginesBy following the tips in this article, you’ll increase your chances of appearing in a high spot in the SERPs. And getting more eyes on your blog content.For even better results, create a free Semrush account to access the Keyword Magic Tool and other powerful resources. This tool can help you identify the best keywords to target, enhancing your content's ranking potential.Ready to take your blog to the next level? Sign up for Semrush today and start optimizing your posts with advanced SEO tools.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Write an SEO Blog Post: 11 Key Tips"
    },
    {
      "level": "H2",
      "text": "1. Choose a Target Keyword"
    },
    {
      "level": "H2",
      "text": "2. Meet Search Intent"
    },
    {
      "level": "H2",
      "text": "3. Structure Your Content with Headings"
    },
    {
      "level": "H2",
      "text": "4. Use Keywords Throughout Your Blog Post"
    },
    {
      "level": "H2",
      "text": "5. Add Visuals and Multimedia"
    },
    {
      "level": "H2",
      "text": "6. Optimize Your Blog Title"
    },
    {
      "level": "H2",
      "text": "7. Write an Engaging Meta Description"
    },
    {
      "level": "H2",
      "text": "8. Include a Detailed Author Bio"
    },
    {
      "level": "H2",
      "text": "9. Add Expert Insights"
    },
    {
      "level": "H2",
      "text": "10. Add Links to Other Relevant Content"
    },
    {
      "level": "H2",
      "text": "11. Use a Short, SEO-Friendly URL"
    },
    {
      "level": "H2",
      "text": "Optimize Your Blog Posts for Search Engines"
    }
  ],
  "author": ""
}