{
  "url": "https://www.semrush.com/blog/seo-techniques/",
  "slug": "seo-techniques",
  "title": "16 SEO Techniques to Boost Organic Traffic + Rankings",
  "description": "Looking to boost your online visibility? Try these 16 SEO techniques to improve organic rankings and traffic.",
  "content": "Here are 16 SEO techniques for building an effective SEO strategy.1. Emulate Top-Performing PagesDon’t guess what content will perform best.Instead, use the SEO tactic of researching your competitors’ best-performing pages. To find what’s already working for them and create something better or similar. Head to Semrush’s Organic Research tool. Enter a competitor’s URL and click “Search.”Then, click the “Pages” tab.You’ll see your competitor’s pages sorted by the amount of traffic they bring in. From there, dive deeper. Click on the icon next to the URL to open their best-performing pages.Like so:Analyze each page carefully. And look for patterns.For example: Is their content short-form or long-form? Are they mostly blog posts? Or something different? Do they use lots of visual assets?The answers to these questions should guide your content strategy. So you can replicate what’s already working but in a better way. This SEO tactic can also help you find other competitors you hadn’t previously considered. Click on the “Competitors” tab, and you’ll get a list of competitors for your chosen URL.And other insights like the number of common keywords, estimated organic traffic, and the number of pay-per-click (PPC) keywords they use in their campaigns.You can then repeat this process for each of your competitors’ domains. And gather information about the pages that perform best in your industry.2. Target Keywords Your Competitors Are Ranking forA keyword gap analysis identifies keywords you don’t rank for but your competitors do.Every gap represents a chance for you to reel in more traffic. There are two easy ways to start—using the Keyword Gap tool and the Position Changes report in the Organic Research tool. To use the Keyword Gap tool, enter your domain next to where it says “You,” and then add your top competitors’ domains. And click “Compare.”Scroll down to the table and select “Missing.” Now, you have a list of keywords you don’t rank for but all your competitors do. Which you can create content around to fill in the gaps. The other way to see what keywords your competitors are ranking for is to navigate to the Organic Research tool. Type in your competitor’s URL and hit “Search.” Once your results have been generated, you’ll go to the “Position Changes” tab. Look at the widget to the right called “Top Page Changes.” Here, you get a straightforward view of the pages on your competitor’s site that have experienced the biggest changes in estimated traffic. You can click the little filter button beside each link to be taken directly to the “All Position Changes” section. To gain deeper insights into traffic losses, gains, and even SERP features that have been won or lost. From there, you can filter down further to see specifics. Like by showing only pages that have experienced ranking drops.This is great for sourcing opportunities to outrank your competitors. Then, when you fully understand the SEO landscape, you can optimize or create content that better aligns with the search intent (the purpose behind the user’s search) of the query so more users can find you first. You can export this data into an Excel spreadsheet, CSV file, or CSV semicolon file. Select your custom date range and hit the “Export” button at the top of the “All Position Changes” table. For more details, read our guide to using competitor keywords.3. Find (and Steal) Your Competitors’ Broken BacklinksBroken link building refers to finding links that don’t work on other websites and recommending they link to you instead. For this search engine optimization technique, you want to find your competitor’s broken backlinks. And steal them. Start by entering a competitor’s domain into our Backlink Analytics tool and clicking “Analyze.” Then, click on the “Indexed Pages” tab and tick the box labeled “Broken Pages.”These are all your competitor’s broken pages. And each one is a promising backlink opportunity for you.Click on a number in the “Backlinks” column to see the specific URLs that have links pointing to the corresponding broken page. Like so: This will take you to a list of pages linking to your competitor’s broken page. Next, filter by “Follow” links. These are the websites you should reach out to. And suggest they link to you instead. Once you repeat this SEO method for a few competitors, you should have a decent list of prospects.Then, all you have to do is make your pitch to get those backlinks. Pro tipUse Semrush’s Link Building Tool to manage link outreach campaigns. You can retrieve contact information automatically and connect your email account to reach out directly from our platform.4. Leverage Internal LinksInternal links are links from any page on your website to another page on your website.And they’re super important because they help: Search engines understand how your site is structured Pass link authority to improve rankings Visitors navigate your siteTo quickly find pages that could benefit from getting more links, start by entering your domain into our Organic Research tool and clicking the “Positions” tab. Then, choose the “Positions” drop-down and select “#11-20.” You’ll get a list of search queries that you have URLs ranking for in positions 11 through 20. These could all benefit from a boost in authority.For this example, let’s try to boost the page targeting the keyword “h1 tag.”Next, go to Google and run a site search on your site (SEOquake in this example) for “h1 tag.” That’ll show every page on SEOquake that contains the keyword.Like this: Then, go through each one of these pages. If they don’t have an internal link to the page you identified in Organic Research, be sure to add it where it makes sense. Repeat this process for the rest of the pages in the table to increase your chances of ranking higher. . NoteThis process is a good starting point for building internal links. But to get the most accurate information about your rankings, it’s best to set up a project with all your target keywords in Position Tracking.5. Manage Your Backlink ProfileNot all backlinks are good for your site. There are potentially harmful links sometimes called toxic links. And they can sometimes negatively affect your rankings and organic traffic. Google is generally good at ignoring bad links pointing to your site. But they’re likely worth addressing if you’ve deliberately violated Google’s spam guidelines to generate a significant number of backlinks and that’s resulted in receiving a manual action—a penalty that can harm your rankings.Manual action notifications come through Google Search Console. And your report will look like this if you don’t have any:To get a sense of the overall health of your backlink profile, use our Backlink Audit tool. Configure the tool and wait as it analyzes your backlink profile. Once done, you’ll see a box labeled “Overall Toxicity Score” and a breakdown of your link profile in terms of risk. If you’ve determined that you might run into issues stemming from bad backlinks, review your toxic links and remove or disavow them. (Disavowal should be done only with extreme caution and a high level of expertise.) The Backlink Audit tool will show you how to do all of that—step by step. 6. Earn Authority Backlinks with Digital PRDigital PR is one of the best SEO tactics focused on link building. Which is a process designed to earn links from high-authority websites.Common digital PR techniques include: Writing press releases Creating data-driven content (journalists love data) Reactive PR (become a source)This third option is by far the quickest way to get started. You can sign up for a service like Connectively. Platforms like this connect writers that need sources to folks like you—an expert. And it’s great because they solicit responses from you. Not the other way around. Plus, major publications use these services.Start by signing up as a source. You’ll get emails with a list of requests for expert sources.If a query sounds interesting and relevant to your niche, send the writer a contribution. It doesn’t take much work, and it’s one of the best ways to build quality links. At scale. NoteThere are other tools worth looking into as well. Like Help a B2B Writer, Qwoted, and SourceBottle.Read our guide to digital PR to learn more about building links this way.7. Turn Brand Mentions Into LinksSometimes, you’ll find a website that mentions your business but doesn’t link to your site. That’s called an unlinked brand mention. Like this:And finding unlinked brand mentions (and asking for a link) is one of the best methods of SEO aimed at getting more backlinks. Most website owners will be happy to turn that mention into a link. Your job is to find those unlinked brand mentions.You can easily do that with the Media Monitoring tool. Configure the tool. And you’ll see a list of all your mentions on the web. The list includes blog posts, social media posts, and news articles that mention your brand.Take note of all the unlinked mentions you find. And reach out to kindly ask for a backlink. 8. Show Topical ExpertiseGoogle wants to rank the best result for any search query. Which is why it’s important to think about optimizing for topics. Not just keywords.This is where topic clusters come in. A topic cluster is a group of pages that cover more detailed subtopics of one main subject and are linked together. They help Google understand the structure of your website and how pages connect to each other. And show your authority on a particular topic.Topic clusters consist of three main parts: The pillar page (which focuses on a single, overarching topic) A cluster of pages (which cover related subtopics) Internal linking between the pillar page and the clustersYour first step is to pick a topic you want to rank for. This will be your pillar page. For example, your pillar page can be about “link building,” and cluster subtopics can be “guest blogging” and “email outreach.” Among others. Try to think about topics. Not keywords.If you need help with ideas for topics, use our Topic Research tool. Search for a broad term related to your business. And the tool will show a list of topics in different cards.Pick topics that are broad enough to have lots of subtopics. Once you have a list, start your keyword research. This will help determine which subtopics you’ll create content around. Then, use our Keyword Magic Tool to connect topics to keywords. Enter the topic you want suggestions for. The tool will show a list of related keywords sorted by the average number of monthly searches. After researching keywords for all your topics, you’ll need to map your cluster. This mapping process will allow you to see (and organize) all your content. Including what you currently have and what you need to create. 9. Optimize for People Also AskThe search engine results pages (SERPs) go way beyond traditional results.And SEOs need to tweak their techniques to take advantage of as many SERP features (special results that aren’t just the standard blue links) as possible.People also ask (PAA) is one of these. PAA is a Google SERP feature that shows searchers additional questions related to their original search query. And provides quick answers to them. Like so:You should optimize for PAA because it can help you gain more visibility by helping you rank for additional relevant keywords. And appear in more places on the SERPs.You can get an overview of the existing SERP features for your keywords with our Position Tracking tool.Enter your domain, create a project, and add all the keywords you’d like to track. Then go to the “Overview” tab, click the “SERP Features” drop-down, and select “People also ask.”. Like this:You’ll see keywords that trigger PAA boxes on SERPs.Here are two things you can do to rank in People also ask boxes: Use those questions in your subheaders Give a dictionary-style answer to PAA questions at the beginning of your articlesTo dive deeper, read our study on how to maximize PAA opportunities.10. Optimize for Image SEOImage SEO refers to optimizing images to help them rank in more search results. So you can get more traffic. Here are a few image SEO best practices: Use descriptive file names for your images Add descriptive alt text (copy that explains the image, which displays when the image fails to load and is read aloud by screen readers) Compress image to improve page speed Create an image sitemap (a file that lists images so Google can more easily find and index them) Add image structured data (code that makes it possible for relevant images to display in search results)To get an idea of how well the images on your site are optimized, run an audit using our Site Audit tool. Then, go to the “Issues” tab and search for “images.”You’ll get a list of all the errors, warnings, and notices regarding your images. For example, images that are broken, too large, missing alt text, etc. Run this audit at least once a month to keep an eye on your image SEO. 11. Improve Your Organic CTR Using PPC TestingOptimizing for rankings also helps you optimize for clicks. One study found that moving up one spot in search results increases your click-through rate (CTR) by 2.8% on average. And the more clicks you get, the more traffic you get.The other main elements that can impact your site’s CTR are your: Title tag (HTML that specifies the page title and may appear in search results) Meta description (HTML that provides a brief summary of the page and may appear in search results)How do you know what title tag or meta description will deliver the highest CTR?You test it.You could test organically. By changing your title tags and meta descriptions and waiting to see what happens.Or you can leverage pay-per-click search ads.You’ll likely see quicker results and get powerful data about which titles and lengths perform better. Just be sure to properly set up your test to determine what’s having the biggest impact on CTR. To determine the best title tag to use, test at least three different headlines but keep the description the same for each To determine the best description to use, test at least three different ones but keep the title/headline the same for eachIf you don’t know which pages to test first, we recommend prioritizing those that are performing well but could use a boost. For example, pages ranking in positions #4-10. To quickly find them, head to our Organic Research tool and enter your domain.Then, go to the “Positions” tab, and filter by position. So long as you receive sufficient clicks on your ads, you can use the data about which headlines and descriptions perform best to update your pages’ title tags and meta descriptions. To improve your organic CTR.12. Optimize for the Core Web VitalsThe Core Web Vitals are metrics that Google uses to measure a website’s overall user experience.They’re made up of three specific measurements: Largest Contentful Paint (LCP): The time it takes for the main content of a page to load. Ideally, 2.5 seconds or faster. First Input Delay (FID): The time it takes for a page to become interactive, which is ideally less than 100 milliseconds. This is being replaced by Interaction to Next Paint (INP)—how long it takes for a page to respond to user actions—in March 2024. Cumulative Layout Shift (CLS): The amount of layout shift of visual page content that’s unexpected. This should be less than 0.1.You can audit your site’s Core Web Vitals quickly and easily using Site Audit. Find the box labeled “Core Web Vitals” in your dashboard. Click “View details.”You’ll see your pages broken down by their status for the Core Web Vitals metrics. You’ll also get tips on how to improve your performance.13. Leverage Programmatic SEOProgrammatic SEO is a tactic where you create keyword-focused pages in an automated way.Wise’s currency conversion pages are a perfect example.These pages assist users in converting between various currencies—from U.S. dollars to Indian rupees, from Euros to U.S. dollars, etc. And almost every currency combination has its own distinct page.Wise gets around 4.2 million monthly organic visits from the U.S. alone for these pages.And these are the keywords the traffic comes from.You can likely replicate a similar approach for your website.The first step is to discover relevant keywords that have many variations with similar intent.For example, if you’re in the travel space, you could use terms like “best hotels in” in the Keyword Magic Tool to find more keywords.As you can see, we have 127,680 keywords with a combined monthly search volume of 4,972,400. Ranking for even a small fraction of these terms could bring in a lot of traffic.14. Use AI in Your Content Creation ProcessAI tools are pretty good at handling some parts of your content creation. For example, creating searched-optimized outlines for your blog posts.By using them to create outlines, you can speed up your content creation process. That enables you to publish a greater number of quality pieces that can drive traffic to your site..For example, we used this prompt format in ChatGPT:Create an outline for my article about [topic] based on these keywords: “[first keyword],” “[second keyword],” etc.And it created our outline.ContentShake AI makes this even simpler.Just enter details about your business when setting it up, select one of the suggested article ideas, and it’ll generate a detailed outline complete with images, subheadings, and more.You don’t have to follow the exact outlines these tool provide. They’re only suggestions. You can edit based on your specific requirements.15. Improve Page SpeedPage speed is a measure of how quickly your webpages load. Which is important for SEO rankings.You can use PageSpeed Insights to check how fast your webpages load.It gives you an overall score from 0 to 100. The higher the score, the better.You can do a few things to improve your page speed.First, reduce the total number of requests your webpages make to assemble all the content. Each additional request adds to the loading time of your page. You can ask your developer to analyze your webpages to identify unnecessary requests. They can eliminate or combine them to reduce the load time.Then, enable caching. Caching is when your browser stores a copy of your webpage on visitors’ devices. This way, when they visit the same page again, it loads faster. If you’re using WordPress, you can use plugins like WP Rocket or W3 Total Cache to enable caching.And lastly, optimize images.Images are often the largest files on webpages, so they take the longest to load.You can use tools like ShortPixel to reduce the size of your images without compromising their quality16. Create Link-Worthy ContentLink-worthy content is any content that provides a lot of value to users.Examples include: Free tools Interactive calculators In-depth guides Interesting datasetsBecause of the value they provide, many websites link to them naturally.Look at this cost of living calculator from NerdWallet as an example:This calculator allows you to compare the cost of living in two different cities. You can enter your current city, your desired city, and your pre-tax household income.Then, it’ll show how much income you need to maintain your standard of living in the new city. And a breakdown of the cost structure relating to housing, transportation, food, etc.And this page has roughly 22,000 backlinks from nearly 2,600 different domains.Making calculators and other link-worthy content like this that are relevant to your niche could be a good way to get backlinks.Continue Improving Your SEO PerformanceNow that you know the best SEO techniques to boost your traffic and rankings, it’s time to deepen your knowledge. Here are a few helpful resources to guide your next steps: Keyword Mapping for SEO: Guide + Free Template What Is Silo SEO and Is There a Better Option? International SEO: Best Practices for Global Online Success SEO Crash Course with Brian Dean (+ Certification)",
  "headers": [
    {
      "level": "H1",
      "text": "16 SEO Techniques to Boost Organic Traffic + Rankings"
    },
    {
      "level": "H2",
      "text": "1. Emulate Top-Performing Pages"
    },
    {
      "level": "H2",
      "text": "2. Target Keywords Your Competitors Are Ranking for"
    },
    {
      "level": "H2",
      "text": "3. Find (and Steal) Your Competitors’ Broken Backlinks"
    },
    {
      "level": "H2",
      "text": "4. Leverage Internal Links"
    },
    {
      "level": "H2",
      "text": "5. Manage Your Backlink Profile"
    },
    {
      "level": "H2",
      "text": "6. Earn Authority Backlinks with Digital PR"
    },
    {
      "level": "H2",
      "text": "7. Turn Brand Mentions Into Links"
    },
    {
      "level": "H2",
      "text": "8. Show Topical Expertise"
    },
    {
      "level": "H2",
      "text": "9. Optimize for People Also Ask"
    },
    {
      "level": "H2",
      "text": "10. Optimize for Image SEO"
    },
    {
      "level": "H2",
      "text": "11. Improve Your Organic CTR Using PPC Testing"
    },
    {
      "level": "H2",
      "text": "12. Optimize for the Core Web Vitals"
    },
    {
      "level": "H2",
      "text": "13. Leverage Programmatic SEO"
    },
    {
      "level": "H2",
      "text": "14. Use AI in Your Content Creation Process"
    },
    {
      "level": "H2",
      "text": "15. Improve Page Speed"
    },
    {
      "level": "H2",
      "text": "16. Create Link-Worthy Content"
    },
    {
      "level": "H2",
      "text": "Continue Improving Your SEO Performance"
    }
  ],
  "author": ""
}