{
  "url": "https://www.semrush.com/blog/seo-reality-show-bakery-1/",
  "slug": "seo-reality-show-bakery-1",
  "title": "How An Artisan Bakery Is Increasing SEO Through Competitor Analysis",
  "description": "See how a powerful digital agency helps an artisan bakery in Fort Lauderdale capture web traffic and convert them into customers.",
  "content": "Have you missed our SEO Reality Show? We did, too. The good news, though, is that we’re launching a new series of episodes. This time, all of our episodes feature one real-world business from a non-digital industry (and with minimal marketing experience!), as we work with a small-but-powerful agency to increase SEO results and business results in real time.We'll take a close look at how this digital agency helps an artisan bakery from Florida capture web traffic and convert it into customers. And if you’re wondering how to do competitor analysis when it comes to SEO for bakeries or small businesses, this is one you won’t want to miss. Spoiler: the list of competitors provided by the bakery and the list of online competitors are completely different!How the Show WorksBefore we look at this case study, we want to address how the show works. Semrush selects a small business with limited marketing experience and partners them up with a highly effective marketing agency. During the Reality Show, both parties are given access to Semrush’s top-level subscription plan. The agency is tasked with going above and beyond to see what could be achieved with modest marketing budgets, effective and step-by-step SEO tactics that other businesses or agencies can repeat for themselves. As the agency creates their optimization strategy and implements SEO tactics for the business, Semrush shares their approach with you in the format of detailed blog posts. Some of the blog posts are accompanied by video interviews with key players of the project.The New Business Featured: Edelweiss BakeryBased in Fort Lauderdale, Florida, Edelweiss Bakery makes traditional artisanal bread, European pastries, and cafe items like soups and sandwiches. They also supply bread and baked goods to local grocery stores and restaurants. While the bakery has been baking fresh bread daily since 1997, marketing has changed a great deal since then. They wanted to increase traffic to their site, which could help drive customers to visit them in-store and to order online directly via their website. In a competitive industry and location, they knew they wanted to increase their ranking in the SERPs so that every kind of customer could more easily find them and convert. In order to do that, the agency they were partnered with knew that competitor analysis was an important first step due to the local competition. Starting Competitor AnalysisCompetitor analysis should never be overlooked; it’s a crucial first stage when it comes to optimizing any business’s online strategy and performance. It can help you adapt to stand out in the market and even outperform your competition. The expert agency conducted competitive analysis in three key steps. Let’s take a look at each one. Step 1. Obtaining Source Data From the Client The first thing the agency did was to compile a list of brands that the client said was their direct competition. The client noted 28 different competitors, which was impressive because many brands are unaware of competition outside of two or three brands. This list included a few local cafes that had a similar range of products as the bakery. Figure 1. List of competitors provided by the ClientHowever, in order to identify truly strong players online, the agency knew they needed to dig deeper. A common error that many business owners make is that they believe that offline competitors and online competitors are one in the same. This, however, is a misconception; someone who isn’t a direct in-person competitor could be dominating the search traffic you’re trying to attract, making them an online competitor you need to take into account. Offline competitors and online competitors are not the same!Step 2. Identifying Organic Competitors In order to identify the business’s organic online competitors who they were competing against in search, the agency used Semrush’s Organic Research tool. First, they typed the name of the bakery into the search bar, and then chose the relevant country. In this case, it was the US. Figure 2. Tool Organic Research from SemrushNext, they scrolled down to find the Main Organic Competitors block, and clicked on the VIEW ALL button. This showed the agency the list of core online organic competitors that they needed to consider. Figure 3. We are looking for competitors using Semrush Organic ResearchTo be as thorough as possible, the agency then clicked on the ”Competitors” tab in the Organic Research tool. Figure 4. We are looking for competitors using Semrush Here, they sorted the competitor sites in terms of competition level. This was based on the total number of keywords each site was ranking for, and it takes into account how many keywords the brand was trying to rank for. Figure 5. We sort the list by metric com.levelFor this analysis, the agency removed sites that had a similarity of less than 1% from the list. Each brand is different, but that was the metric they chose to go with. Once they did this, they exported the filtered list from Semrush and then combined it with the list of competitors provided by the client in an Excel document. Figure 6. Exporting the filtered list in just one clickAfter removing duplicate domains, the agency ended up with a list of 60 domains for further analysis. The more data for analysis, the better!Figure 7. The final list of sites for further analysisStep 3. Data Collection & Defining Major Competitors At this point, the agency had 60 competitors to assess. In order to find what they considered to be the “real” competitors, they looked at the three following parameters: The number of keywords in the organic Traffic in Organic Age of domainThe first metrics were available through the Organic Research tool in Semrush, and they checked a site’s domain age with this tool. Figure 7. Checking the domain age is easyNext, the agency needed to identify those sites that matched the following parameters: Young site (up to 3 years old, not older than our website) Traffic Indicators are comparable or exceeding the traffic of a promoted site Traffic growth dynamics are positive (or at least not stagnates)When assessing these metrics, the agency knew that they can export the list of the analyzed sites with all the necessary metrics by simple click on the Export button.Figure 8. Exporting information with one click is real!The age of a domain is particularly important when conducting competitor analysis. The fact is that the older the domain name, the better the search engines can rank it. This is because older domains are perceived to be more reliable and stable sites. And if the site isn’t lagging behind in trends of web development like usability characteristics, websites can accrue positive behavioral signals that Google can read. As a result, mature sites can be given a priority in the SERPs.The agency looked for young sites, therefore, to determine why they’re so successful. In this case, since there were only a few sites that met the original source requirements, they extended the search to websites that were five years old or younger. Once this list was finalized, the agency looked at growth dynamics over the last year. To do this, they went to the Compare Domains report in Semrush Domain Overview tool. Since the tool allows you to simultaneously compare no more than 5 sites (1 of which is the bakery’s website), the agency would conduct the comparison several different times. Figure 9. We are only interested in leaders! [Get Your Competitor Analysis Template]As a result, they selected 6 successful competitors (marked in green in our template), which they would then assess for the following: Defining the backlinks strategies they use Building the structure of our site Organization of internal linking caobakerycafe.com nanoufrenchbakery.com europeanbakerymaine.com europeanbakerycafe.com amoremiocakes.com loveleebakeshop.com One of the bakery's key competitors (loveebakeshop.com) aggressively grew up from March to April 2021. The agency noted this, and intended to research more into why the brand had such exponential growth before a sudden fall. Figure 10. Not all competitors are equally useful.The Outcome We’re only on episode one of the season, but we’ve already seen the agency collect a list of competitors— consisting of 60 sites which they narrowed down to six “first-level” competitors after in-depth research. Three of the sites were from the list of competitors the client delivered, and three were identified using a strategic process and Semrush’s tools. And with that, this episode is over right when it was getting exciting! Next, the agency is going to build a strong link profile for a bakery in order to rank higher in the search results. Stay tuned! Infographic: Increasing SEO Through Competitor Analysis [Get Your Competitor Analysis Template]",
  "headers": [
    {
      "level": "H1",
      "text": "How An Artisan Bakery Is Increasing SEO Through Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "How the Show Works"
    },
    {
      "level": "H2",
      "text": "The New Business Featured: Edelweiss Bakery"
    },
    {
      "level": "H2",
      "text": "Starting Competitor Analysis"
    },
    {
      "level": "H3",
      "text": "Step 1. Obtaining Source Data From the Client"
    },
    {
      "level": "H3",
      "text": "Step 2. Identifying Organic Competitors"
    },
    {
      "level": "H3",
      "text": "Step 3. Data Collection & Defining Major Competitors"
    },
    {
      "level": "H2",
      "text": "The Outcome"
    },
    {
      "level": "H2",
      "text": "Infographic: Increasing SEO Through Competitor Analysis"
    },
    {
      "level": "H6",
      "text": "Most popular pages"
    },
    {
      "level": "H6",
      "text": "SEO Checklist: 41 Tips to Optimize Your Website"
    },
    {
      "level": "H6",
      "text": "How to Perform a Complete SEO Audit (in 14 Steps)"
    },
    {
      "level": "H6",
      "text": "A Beginner’s Guide to Keyword Search Volume"
    }
  ],
  "author": ""
}