{
  "url": "https://www.semrush.com/blog/seo-reality-show-bakery-4/",
  "slug": "seo-reality-show-bakery-4",
  "title": "How to Conduct Semantic SEO Research for an Artisan Bakery",
  "description": "Developing your semantics core is an essential part of SEO optimization. See how to conduct semantics SEO research in this case study of a Miami-based bakery.",
  "content": "So far on our SEO Reality Show journey, we’ve been partnering an expert agency with a Florida-based artisan bakery to help the bakery get more results through search. Previously on the SEO Reality Show ... Episode 1 - completed competitor research Episode 2 - prepared a list of websites to place links Episode 3 - created a new website structureAnd today’s episode is going to look at how the agency conducted semantic research to find the right terms to optimize for in order to beat competitors in Google. Let’s get started!What is the Semantic Core?A site’s semantic core (also known as “semantics” or “semantics SEO”) is a list of search queries that their target audience will enter into the search engine when looking for a product or service. These are going to be core search terms that you need to incorporate into your site and optimize for accordingly, building the core semantics into the appropriate places in your site structure.Why Now is the Time to Conduct Semantic SEO Research Having a ready-made structure for the client’s future website is important before you start with SEO semantics. In the last episode, the expert agency developed the structure of the client’s site and had their agreement.1. The website structure that the client agreed onThe reason is simple: it’s downright difficult to collect semantics without a ready-made structure, like exploring the world only by touch without sight, sound, taste, or smell. There’s not enough information there to give you the big-picture view you need to do it well.If you start doing semantic keyword research without a detailed site structure, you’re also likely to end up with some non-target queries built into your site’s core, which can bring the wrong kind of traffic to you. They may not even relate to your business or your products. With a ready-made structure, however, everything is easier. Let’s take a look at how our expert agency conducted semantics research for SEO for Edelweiss Bakery. The ProcessThere are different ways to build a high-quality semantic core, depending on the size of the niche, the availability of resources (including time), and the available tools.In this case, the agency decided to use the following approach: Take the semantics of competitors Add keywords using the Semrush Keyword Magic Tool Put together a list of queries for each individual page that needed optimizationThis how-to case study is going to focus specifically on the preparation of semantics for the bakery’s main home page. Step 1 — Collecting the Competition’s Semantics First, the agency needed to determine the target pages we want to pull our research from. The bakery’s main page needed to be optimized for those searching for the intent “bakery fort lauderdale”, which is where it’s located. This is a high-intent keyword because the user’s intention is strong; they want to find a local bakery near them. Understanding what users are searching for when finding these products is crucial. Next, the agency analyzed the established list of competitors, looking for pages that had focused on a similar intent. caobakerycafe.com nanoufrenchbakery.com europeanbakerymaine.com europeanbakerycafe.com amoremiocakes.com loveleebakeshop.com They looked at all the home pages of the sites to see what queries they were ranking for. If their home pages were optimized for something else, the agency would look at other pages that seemed to align with their client’s search intent. These pages would typically have labels like “Bakery” or “Cafe.” The easiest way to determine the query the page is optimized for is to look at it’s meta title tag. If it mentioned “bakery fort lauderdale” or something very close (like “bakery in fort lauderdale” or “fort lauderdale bakery”), then that was a good sign. To find a site’s meta title tag, the agency used the free add-on for the Chrome browser SEO Meta in 1 Click. In this example, the home pages turned out to be the target pages of competitors for subsequent analysis.2. Example of determining the page we need on the competitor's website europeanbakerymaine.comAfter finding the right pages, the agency used the Keyword Gap tool. They would enter in the landing pages on competitors ' sites that we selected earlier and study their keywords. Pro tip: Make sure that the search region is accurate. In this case, they specified that the search region was in the United States. You also want to choose for the search type “Exact URL.” 3. The agency copies the page address from the browser's address bar and transfer it to the Keyword Gap tool4. Selecting the keywords that are relevant for usThe agency then transferred the keywords that suited the client’s site to a saved list by clicking on the “+” to the Keyword Strategy Builder tool. All the keywords they chose had the following properties: Corresponded to the intent Matched the product type It was suitable for GEO (if there is a GEO key like “Miami, Florida”) Was not brandedIn our case, the agency could only add the “bakery fort lauderdale” query. Since there are 6 competitors and only 4 windows for entering competitors, they performed the task in 2 iterations. They ended up with a total of 79 keywords. 5. Folder in Keyword Strategy Builder with selected keywordsIt is important to note that for requests like the custom bakery near me, the bakery would barely see any progress in organic search. With these types of SEO queries, SERP consists of local restaurant aggregators and reviews services. That being said, it is worth paying attention to such key phrases. The fact is that they may contain unique words that characterize the topic, which we will need to add to the text of the page when writing the copy. In this case, it is a custom bakery.Step 2 — The Keyword List ExpansionDespite having 79 keywords already, the agency knew that their best bet was to expand their list of key phrases further while refining the list simultaneously. To do this, they went to the Keyword Strategy Builder and carefully studied the list they already had. They then needed to prepare marker phrases, which would be expanded. A marker phrase or query is the shortest possible phrase that characterizes the user's intent. After looking closely, we identified the following markers: custom bakery german bakery german bread german pastries european bakery european bread european pastries european bakery cafe custom bakeryIn the previous step, the agency deliberately left some keywords in order to use them as markers later. For example, “good bakery near” me will be converted to the marker query good bakery. 6. Creating a list of marker phrasesA small life hack: The list of markers can also be expanded by typing the available markers in Google. Pay attention to the snippets — sometimes you can find additional keywords there that can be expanded.7. New marker phrases from Google SERPTo further expand the semantic core, the agency went to the Keyword Magic Tool and add the marker phrases step by step. They selected words and phrases according to criteria similar to those specified in the first step, and added them by clicking on “+” to the Keyword Strategy Builder tool. When doing this yourself, if the number of phrases for analysis is too large, you can use the built-in filters Semrush — Language, Volume and KD.8. Keyword list expansion using the Keyword Magic ToolAfter expanding the list of key queries and cleaning it from unsuitable queries (queries that contain tails like near me, keys with zero search volume), the agency had a clean list of 60 keywords.Step 3 — Finalizing The Semantics After all the keywords are collected, the agency used the Keyword Strategy Builder tool to download them using the Export button. They then send the list to the client for approval.9. Exporting our semantics from the Keyword Strategy Builder for further coordination with the clientThe final list after client approval was 29 keywords. This is plenty to write a strong copy that will promote the landing page using a variety of keywords. By the way, in order to create several groups of keywords, Keyword Strategy Builder has a key tagging tool. You can tag keys either one at a time or in bulk to create keyword clusters.10. Keyword tagging process in the Keyword Strategy Builder toolNote that the metrics, including KD, CPC, Vol and Com, change their values over time. In order to keep your finger on the pulse, update them directly in the Keyword Strategy Builder interface by clicking the Update metrics button, as our expert agency did.11. Updating metrics in the Keyword Strategy Builder [Get Your Semantic Core Template]Next Up That’s it for this episode of our SEO Reality Show, but stay tuned: in our next episodes, the agency will prepare the layout of the product page, including meta tags and the technical specifications for writing copy for the home page itself. We’ll also closely look at technical analysis, which is often overlooked.We’ll see you next time! Infographic: Conducting Semantic SEO Research in 3 Steps",
  "headers": [
    {
      "level": "H1",
      "text": "How Marketing Experts are Increasing a Bakery's Online Visibility with Semantic SEO Research"
    },
    {
      "level": "H2",
      "text": "What is the Semantic Core?"
    },
    {
      "level": "H2",
      "text": "Why Now is the Time to Conduct Semantic SEO Research"
    },
    {
      "level": "H2",
      "text": "The Process"
    },
    {
      "level": "H2",
      "text": "Step 1 — Collecting the Competition’s Semantics"
    },
    {
      "level": "H2",
      "text": "Step 2 — The Keyword List Expansion"
    },
    {
      "level": "H2",
      "text": "Step 3 — Finalizing The Semantics"
    },
    {
      "level": "H2",
      "text": "Next Up"
    },
    {
      "level": "H2",
      "text": "Infographic: Conducting Semantic SEO Research in 3 Steps"
    },
    {
      "level": "H6",
      "text": "Most popular pages"
    },
    {
      "level": "H6",
      "text": "SEO Checklist: 41 Tips to Optimize Your Website"
    },
    {
      "level": "H6",
      "text": "How to Perform a Complete SEO Audit (in 14 Steps)"
    },
    {
      "level": "H6",
      "text": "A Beginner’s Guide to Keyword Search Volume"
    }
  ],
  "author": ""
}