{
  "url": "https://www.semrush.com/blog/seo-case-study-bakery/",
  "slug": "seo-case-study-bakery",
  "title": "SEO Case Study: How an Agency Boosted Bakery’s Traffic by 460%",
  "description": "Learn how an agency increased a bakery’s organic search traffic by 460%. See the results in a detailed SEO case study.",
  "content": "In our SEO Reality Show series, we’ve been sharing the individual steps a partner agency took to help an artisan bakery improve their search visibility, capture quality web traffic, and convert site visitors into customers.Seven months have now passed since they started this journey, and we’re happy to share with you the results of this hard work of the agency-client duo.About the Client Edelweiss Bakery is the subject of this SEO case study.Edelweiss is a small local bakery in Fort Lauderdale, Florida (U.S.) that makes a variety of freshly-baked goods, including traditional artisanal bread, European pastries, cafe items like soups and sandwiches, and more. They’ve been in business for over 20 years, and though they are a popular location with locals, they struggled to attract the kind of organic search traffic online that they wanted. About the AgencyThe agency partner helping Edelweiss Bakery with their SEO and site challenges is Why SEO Serious, an international SEO agency. This agency offers internet marketing services specializing in both SEO and analytic services. They work within modern frameworks to increase the growth of site traffic while assessing behavioral factors and daily monitoring.The ChallengesEdelweiss Bakery’s primary challenges included a lack of online and offline orders, and lower than desired brand visibility online. These challenges were directly impacting their business.The SolutionFor this SEO Reality Show Series, we paired Edelweiss Bakery with Why SEO Serious agency so they could work together to resolve the technical and strategic issues preventing the bakery from getting the visibility and sales they wanted.The agency identified 3 key stages of optimization tactics that could help Edelweiss resolve their challenges and reach their objectives.Stage 1. Main SEO Optimization Conduct competitor research Explore link-building opportunities Improve the bakery’s website structure Run keyword research for site’s homepage and overall digital presence Conduct a technical SEO audit Redesign the bakery’s homepage Optimize the bakery’s meta title and meta description Update the bakery’s Google My Business profile and register for local directoriesStage 2. Blog Creation and Optimization Find relevant blog topics Build a content strategy Choose impactful blog theme Create an effective content brief Carry out a blog SEO audit Create SEO-friendly contentStage 3. Ecommerce Section Optimization Create and optimize ecommerce page and product cards Set up ecommerce analyticsThe ImplementationBelow is a high-level recap of what the agency did during each step of their strategic optimization process. For a deeper dive into each implementation step, we’ve linked to the specific blog post that focuses on the agency’s strategy and tactics. Stage 1. Main SEO Optimization1. Conduct Competitor Research In part one of this series, we shared how the agency helped Edelweiss better understand who their online competitors really are. This was done by using online tools to identify top performers who were in the same industry and ranking for similar keywords. Competitor research not only helped the agency identify who the bakery’s competitors were, but it also helped the bakery realize that their most significant online competitors were different from their local, offline competitors. Tools the agency used to identify organic online competitors: Semrush’s Organic Research ICANN Lookup Domain OverviewYou can see the details here.2. Explore link-building opportunities In episode 2 of our series, the agency identified which keywords and pages helped competitor sites collect the most traffic and how backlinks contributed to driving that traffic. Their aim was to help Edelweiss build a strong backlink profile by getting more links to their site pages from other domains, increase their domain authority (DA) score and rank higher in the search results. The agency’s strategy was to assess Edelweiss’s link profile and look for new backlinking opportunities. Tools the agency used to find link-building opportunities for the bakery: Link Building Tool Backlink Gap See the details here. 3. Improve the bakery’s website structureStage three of the agency’s process was centered around improving the structure of Edelweiss’ website. The goal was to ensure that every potential entry point was fully optimized to appeal to more users.The larger and wider the site structure, the more opportunities the bakery would have to appeal to their target audiences.To improve their site structure, the agency optimized the number sections on the bakery’s website and provided more relevant content on the existing pages.Tools the agency used to build a more effective site structure for Edelweiss: Xmind Site Audit See the details here.4. Run keyword research for the site’s homepage & overall digital presenceTo help Edelweiss attract the right visitors to their site, the agency focused on keyword research for the bakery’s homepage. In collaboration with the bakery, they developed a finalized list of relevant, high-intent key phrases. This list of keywords was then used to help guide the bakery’s homepage content as well as the meta title and meta description.Tools the agency used to conduct keyword research for Edelweiss’ home page: SEO Meta in 1 Click Keyword Gap Keyword Magic Tool Keyword Strategy Builder See the details here. 5. Conduct a technical SEO audit To ensure that Edelweiss was not missing out on opportunities to improve their SEO ranking potential, the agency conducted an SEO audit.By analyzing the technical state of the bakery’s website, the agency gained better insight into where Edelweiss’ website was struggling beyond keywords and site structure and compiled a list of issues for the site’s developer to address. Tools the agency used to conduct an SEO audit of Edelweiss’ website: Site Audit Google’s PageSpeed Insights Mobile-Friendly Test See the details here.6. Redesign the bakery’s homepage With the previously compiled data thoroughly researched and carefully sorted through, the agency was able to apply these insights to update and optimize Edelweiss Bakery’s homepage. They created a mockup of a new homepage that would appeal to all segments of the bakery’s target audience while improving site performance on desktop and mobile.Tools the agency used to create a mockup of a new homepage design for Edelweiss’ site: Google’s CS location changer plugin Figma’s free tool Keyword Overview See the details here.7. Optimize the bakery’s meta title and meta description With the redesign of Edelweiss’ homepage complete, the agency focused on creating a new meta title and meta description for their homepage to help improve their SERP ranking and increase their click-through rate. They used the findings from their earlier keyword research and paid close attention to search intent. Tool the agency used to create a strong meta title and meta description for the bakery’s new home page: SEO Meta in 1 Click See the details here.8. Update the bakery’s Google My Business profile & register for local directoriesThe final step in the agency’s process to improve Edelweiss’s online presence was to revamp their Google My Business (GMB) profile.The agency also looked for additional opportunities with online registries to help increase the bakery’s reach and used an automated tool to submit the bakery’s information to new registries, creating a more well-rounded digital presence. Tool the agency used to distribute the bakery's business data automatically to the most authoritative directories: Listing Management Tool See the details here. Stage 2. Blog Creation and Optimization1. Find relevant blog topicsWith all the optimizations described above, the agency and Edelweiss have moved forward in their collaboration to start the bakery’s blog.They built and finalized a full list of keywords and potential topics that could be valuable for their target audience.Tools the agency used to create and expand the list: Semrush Topic Research Keyword Strategy Builder Keyword Magic Tool See the details here. 2. Build a content strategyAfter selecting the most relevant and competitive content topics for Edelweiss’ blog, the agency started building a keyword-optimized content marketing plan.They crafted a six-month content planning calendar, with 14 keyword-optimized pieces per month.Tools the agency used to turn topics into keyword opportunities, decide on a content deployment strategy and create a long-term content plan: Semrush Keyword Magic Tool Keyword Overview Marketing Calendar See the details here. 3. Choose impactful blog themeThe next step after determining blog topics and developing a content plan was choosing a blog theme.A blog’s theme can play an important role in either keeping the reader on the page or compelling him to hit the exit button.Tool the agency used to choose an effective theme template: Wordpress themes See the details here. 4. Create an effective content briefThe agency has already chosen the list of impactful topics and a website content plan. Now it’s time to create content!In order to create not only engaging, but high-ranking content, the agency crafted a list of technical specifications for their inhouse copywriters to follow.Tools the agency used to create a technical content brief: SEO Meta in 1 Click Semrush Keyword Gap Keyword Magic Tool Keyword Strategy Builder See the details here. 5. Carry out a blog SEO auditPreviously, the agency conducted a technical site audit of the bakery’s homepage. They used a similar process to ensure the blog performs well in Google search.During the audit, a lot of things were done and checked by the SEO experts.Tools the agency used to perform a technical SEO audit for the blog: Semrush Site Audit Google’s PageSpeed Insights Mobile-Friendly Test See the details here. 6. Create SEO-friendly contentWith all of the preparations in place, the agency was ready to create the content itself. To achieve their goals on deadline, they knew that outsourcing content writing was the best option.Tools the agency used to create blog content for their bakery client: SEO Content Template SEO Meta in 1 Click Character Count Online Keyword Magic Tool See the details here. Stage 3. Ecommerce Section Optimization1. Create and optimize ecommerce page and product cardsThe bakery already had an existing ecommerce section before starting to work with the agency, but it was just a small section on the main page; there were no product cards or categories. The agency knew that to increase purchase potential, there needed to be a dedicated ecommerce page with the ability to view items by category and to add product cards for each item customers could purchase.Tools the agency used to revamp the bakery’s ecommerce features in order to increase product visibility and online purchases: Keyword Magic Tool WooCommerce See the details here. 2. Set up ecommerce analyticsAfter the store section was designed and implemented, it was decided to apply an eсommerce analytics system to track and help grow sales on the bakery’s website.The agency began setting up the necessary data and information inside the tools to get the most accurate results.Tools the agency used to implement ecommerce analytics for the bakery’s website: Google Analytics Google Tag Manager See the details here. ResultsSeven months is normally a realistic timeframe to evaluate results and see the impact of SEO optimizations. In the case of this collaboration between Why SEO Serious and Edelweiss, the first results appeared after 4 months—when all technical and content improvements were implemented to their website main page. By that time organic traffic to the bakery website had already increased by 214%. In terms of tracking results within a 7 months time frame, the biggest challenge in this particular case was the implementation of improvements on a client’s side.Here are some stats of agency actions during the last 7 months!As a result of their work, both organic traffic and ranking positions improved for multiple keywords. The chart below shows the position distribution for the keywords Edelweiss wanted to rank for. May June July Aug Sep Oct Nov TOP-3 5 6 7 6 8 8 8 TOP-10 4 3 6 12 14 26 19 TOP-20 6 7 15 28 35 32 27 Mobile organic traffic increased from 171 monthly visits to 785, which is a 460% increase.Overall, the results thus far have been both positive and significant. We anticipate better performance for Edelweiss’s website in terms of traffic growth and conversion to orders in a couple of months.Final ThoughtsWe’ve got great results for our SEO Reality Show’s bakery, but we’re not done! We’ll show you soon how to track metrics over time and keep you updated on the bakery’s metrics growth. Stay tuned!Infographic",
  "headers": [
    {
      "level": "H1",
      "text": "Case Study: How an SEO Agency Helped an Artisan Bakery Increase Mobile Organic Traffic by 460%"
    },
    {
      "level": "H2",
      "text": "About the Client"
    },
    {
      "level": "H2",
      "text": "About the Agency"
    },
    {
      "level": "H2",
      "text": "The Challenges"
    },
    {
      "level": "H2",
      "text": "The Solution"
    },
    {
      "level": "H3",
      "text": "Stage 1. Main SEO Optimization"
    },
    {
      "level": "H3",
      "text": "Stage 2. Blog Creation and Optimization"
    },
    {
      "level": "H3",
      "text": "Stage 3. Ecommerce Section Optimization"
    },
    {
      "level": "H2",
      "text": "The Implementation"
    },
    {
      "level": "H2",
      "text": "Stage 1. Main SEO Optimization"
    },
    {
      "level": "H3",
      "text": "1. Conduct Competitor Research"
    },
    {
      "level": "H3",
      "text": "2. Explore link-building opportunities"
    },
    {
      "level": "H3",
      "text": "3. Improve the bakery’s website structure"
    },
    {
      "level": "H3",
      "text": "4. Run keyword research for the site’s homepage & overall digital presence"
    },
    {
      "level": "H3",
      "text": "5. Conduct a technical SEO audit"
    },
    {
      "level": "H3",
      "text": "6. Redesign the bakery’s homepage"
    },
    {
      "level": "H3",
      "text": "7. Optimize the bakery’s meta title and meta description"
    },
    {
      "level": "H3",
      "text": "8. Update the bakery’s Google My Business profile & register for local directories"
    },
    {
      "level": "H2",
      "text": "Stage 2. Blog Creation and Optimization"
    },
    {
      "level": "H3",
      "text": "1. Find relevant blog topics"
    },
    {
      "level": "H3",
      "text": "2. Build a content strategy"
    },
    {
      "level": "H3",
      "text": "3. Choose impactful blog theme"
    },
    {
      "level": "H3",
      "text": "4. Create an effective content brief"
    },
    {
      "level": "H3",
      "text": "5. Carry out a blog SEO audit"
    },
    {
      "level": "H3",
      "text": "6. Create SEO-friendly content"
    },
    {
      "level": "H2",
      "text": "Stage 3. Ecommerce Section Optimization"
    },
    {
      "level": "H3",
      "text": "1. Create and optimize ecommerce page and product cards"
    },
    {
      "level": "H3",
      "text": "2. Set up ecommerce analytics"
    },
    {
      "level": "H2",
      "text": "Results"
    },
    {
      "level": "H2",
      "text": "Final Thoughts"
    },
    {
      "level": "H2",
      "text": "Infographic"
    }
  ],
  "author": ""
}