{
  "url": "https://www.semrush.com/blog/seo-writing/",
  "slug": "seo-writing",
  "title": "SEO Writing: 16 Tips for Creating SEO-Optimized Content",
  "description": "SEO writing is the process of writing content with the goal of ranking well on search engines like Google.",
  "content": "What Is SEO Writing?SEO writing is the process of writing content in a way that’s intended to make it rank higher in search engines like Google for relevant keywords. This involves: Optimizing your content for target keywords Making sure your content is helpful to readers Helping search engines understand what your content is aboutThis guide teaches you why SEO writing matters and how to hone your SEO writing skills in 16 easy pointers. Read on.Why Is SEO Writing Important?SEO writing is important because it helps you reach more people who are interested in your content.When you write with SEO in mind, your content has a higher chance of being discovered in Google.What is great SEO content writing like in practice? Let’s look at a few examples.Our guide to SEO gets over 4,400 organic visitors each month, according to Domain Overview. It also has around 5,100 backlinks (links from other sites that point to this guide). Some of that success is due to its use of some SEO writing best practices we’ll go over later: It’s written with quality in mind It satisfies search intent (the reason behind the user’s query) It uses keyword-rich subheadings It includes imagesAnother example is this how-to guide from Chewy’s blog: It gets nearly 850 organic visits per month. And has accumulated over 240 backlinks.Here are some of the SEO writing tips driving those results: It includes more than one keyword It uses high-quality videos and images It’s easy to read and scan It includes links to other content on the site that users will probably find usefulWhile both examples use SEO writing best practices, they also make sure to prioritize the user. And that’s important.Think of SEO as a bridge that helps search engine users reach your content. That bridge is what gets your valuable content noticed. Make sense?Good. Now, let’s see how to actually create SEO-optimized content.16 Tips for Creating SEO-Optimized Content1. Find Your Primary KeywordsEach piece of content you write should be optimized for a primary keyword. This is the main term (or phrase) you want your content to rank for.To find your primary keyword, use Semrush’s Keyword Magic Tool. Type your topic into the search bar and enter your domain name in the “AI-powered feature” space. Then, select your target location and click “Search.”The tool will show you potential candidates for your primary keyword.Having access to all these keywords is great. But how do you know which one to choose as your primary keyword?Here are some tips to consider.Your primary keyword should: Be relevant to your content. It should reflect the main topic of your content and be relevant to your industry. Have a decent search volume. Enough people should be searching for that keyword. What constitutes a decent search volume depends on the niche of your website. Look at the “Volume” column to see how many people search for each keyword. Be within your ranking capabilities. It shouldn’t be too difficult for you to rank for. Look to the Personal Keyword Difficulty (PKD %) column to see the ranking difficulty for your specific website. The lower the percentage, the easier it’ll be for your website to rank for that term.For example, you might choose “dog behavior training” as your primary keyword if you’re writing content about this topic.This keyword has a search volume of 2,900 searches per month and a Personal Keyword Difficulty score of 46%—meaning there’s a very realistic chance of ranking. It’s also clear that users searching this term want to learn something. So, it’s definitely a good primary keyword to target.(Targeting a keyword means using it in your content. We’ll see how to do that correctly later in this guide.)2. Identify Content GapsNext, look to your competitors to see if there are any content opportunities you haven’t yet discovered.Use Topic Research for this.Enter a broad keyword related to your niche, select your target location, and click “+ Enter domain to find content on.” Then, type in a competitor’s domain, and click “Get content ideas.” You’ll see a list of different topics relevant to your keyword and the entered domain. If your selected competitor has covered any of the topics the tool suggests, they’ll be highlighted in green and feature checkmark. These are great topics to include in your own content plans.Expand one of those cards by clicking “Show more” to look at the following information: Volume: The number of searches this topic gets on average each month Headlines: The top headlines for content covering that topic Questions: Related questions you can include in your contentRepeat this process for other relevant topics your competition is covering to find even more ideas.3. Choose Your Secondary KeywordsOnce you have some primary keywords to target, you’ll also need to find secondary keywords. These are keywords that are closely related to your primary keyword.These may include synonyms, related subtopics, or long-tail variations (meaning highly specific terms) of your primary keyword.Using secondary keywords is important because: They increase your chances of ranking for even more keywords—not just for the primary one They’re often comparatively easier to rank for. While the primary keyword may have a lot of competition, the secondary keywords likely have less.Find secondary keywords using Semrush’s Keyword Magic Tool.First, see whether your primary keyword has a default grouping on the left-hand side.If it does, click on it. And you’ll see all the related keywords belonging to that group.These keywords are close variations of your primary keyword. And they can make for great secondary keywords to target in your content.Another way to find secondary keywords is to use the “Questions” tab on the left-hand side.This will show you all the questions that people are asking related to your topic.Some of these questions (secondary keywords) might be worth addressing as subtopics in your content.You can also look to see which secondary keywords your competitors are ranking for in Organic Research. Enter a specific page’s URL and click “Search.” (Make sure that “Exact URL” is selected from the drop-down in the next screen.)In the “Overview” report, look at the section labeled “Top Keywords.” These are terms that the competitor’s content is ranking for. Click “View all # keywords” to see the complete list.These are terms that page is ranking for. And you can gather secondary keywords for your own content based on this list.4. Satisfy Search IntentAfter you’ve identified your keywords, you need to make sure the content you create satisfies search intent.Search intent is the reason why users search for your keywords. There are four main types of search intent. Informational: The searcher is looking for information about a topic Navigational: The searcher is looking for a specific website or page Commercial: The searcher is researching options Transactional: The searcher wants to make a purchase soonFor blog posts, your primary and secondary keywords should have informational intent. Because users who want to learn something about a topic find helpful articles and in-depth blog posts valuable.Some common content formats for informational search intent keywords include: How-to guides List posts Step-by-step tutorials Definition posts Comparison postsYou can find out which content format works best for your topic by looking at the top-ranking pages on Google.For example, we see that the top-ranking pages for “positive reinforcement dog training” are definition posts that define the concept and answer common questions about it.So, if you were to target this keyword (and related secondary keywords), you need to create something similar: a post on what this training concept is and how to use it.Doing so will improve your chances of ranking higher.5. Create Quality ContentQuality content is at the core of effective SEO writing. Without focusing on quality, no amount of optimization will help you rank higher.But what is quality content?It’s content that: Is accurate Provides value to your audience Is original and unique Is engaging and interactiveHow do you create quality content?Hire someone who’s not only a good writer, but who also has first-hand domain expertise.This is especially important if you’re creating content around “Your Money or Your Life” (YMYL) topics. YMYL is a term Google uses to describe topics that can have a significant impact on a reader’s well-being.These include topics related to health/medical advice, legal matters, financial planning, or news/current events. Google holds this type of content to a higher standard because of the potential implications on readers’ lives. Misinformation or poor-quality writing in these areas can lead to serious repercussions.For example, if you’re creating content around vegan diet plans, misinformation in this area may lead readers to make health-related decisions that can negatively impact their well-being. That’s why working with a qualified health expert for SEO content writing services would be a smart move.They can help you create accurate, valuable, and original content that covers all the aspects of a vegan diet plan.By creating quality content this way, you can build trust with your audience. And establish yourself as an expert in your niche.6. Leverage Keywords in Your ContentIncorporate your researched keywords into your SEO content writing naturally.Google looks at the words in your content to understand what it’s about. So it can rank it appropriately.But avoid keyword stuffing. At all costs.Keyword stuffing is the practice of using keywords in an unnatural way. It’s a tactic some use to try to manipulate search engines into ranking their content higher. See how the example below is doing it wrong:Keyword stuffing like this can make your content look spammy to both Google and your readers. And your content may not rank very well as a result.To check whether you’re using keywords correctly, try Semrush’s SEO Writing Assistant.It highlights when any of your keywords are used in an unnatural way.Simply import your page content into the tool, and start making changes directly in the content editor. 7. Structure Content with SubheadingsSubheadings (H2-H6) are miniature titles that divide your content into sections. To indicate the most important areas and make the whole piece more scannable.They’re important for SEO because they help you: Make your content easier to read and understand Use keywords and related terms in a natural way Allow users to easily find the information they need. Which is great for the user experience.See how the example on the right is much easier to scan for information?You need to structure your content similarly.First, write a catchy title that includes your primary keyword. This will be your H1 (the first heading in your content).Then, organize the rest of your content with relevant H2 subheadings, H3 subheadings, and so on.(H2 subheadings should support your H1, H3 subheadings should support your H2s, etc.)Like this:By organizing your content with subheadings, you can create a clear and logical structure that helps both Google and your readers understand and navigate your content.8. Make Your Content Easy to ReadOne of the key aspects of good SEO writing is readability—a measure of how easily your audience can read and understand your content.If your content is difficult to read, users will bounce off your page (and likely never come back).Behavior like this signals to Google that your content is of low quality. So, it may not rank very well.Using subheadings is a good start. But there are other things you need to do to improve readability: Use short sentences and paragraphs. This will make your content more scannable and digestible. Use simple and clear language. So readers of all levels can understand your writing. Use visuals. Images, infographics, videos, graphs, or other visual assets are powerful tools that can enhance your content and make it more engaging. Use bullet points and numbered lists. They’re great for presenting information in a clear and concise way.Run your content through Semrush’s SEO Writing Assistant to measure its readability.The tool tells you how easy it is to parse:It also highlights words or sentences that could be rewritten to enhance readability.9. Include Multimedia Elements in Your ContentIncorporating multimedia into your content makes it more engaging. And encourages users to interact with your content.For some keywords, multimedia may even be a requirement for ranking. For example, the results for “teach a dog to sit” include videos at the top. Google recognizes that users who search this keyword are interested in learning through the video format.Here are a few different elements you can add to your content: Images Infographics Videos AudioFor example, The Spruce Pets includes a high-quality video in their blog post about positive reinforcement training.Beyond increasing engagement and better aligning with search intent, incorporating multimedia can also help you rank in image and video searches. Which can increase your organic visibility and drive more traffic to your website.10. Add Internal LinksInternal links are links that point to other pages on your own website. To direct readers to other valuable, relevant content.Internal links are also important for SEO because they distribute link equity (ranking power). So other pieces of content can also rank higher.When adding internal links, make sure your anchor text (the clickable text that includes a link) is relevant to the linked content.The idea is that the link should be super relevant. So, don’t add links anywhere and everywhere for the sake of it. Only link to content where it naturally makes sense.For example, if you’re writing an article about a positive reinforcement dog training, you can add links to other pieces of content that provide more information on topics such as: Training treats for puppies Essential dog commands Puppy training schedulesThese links will help readers learn more about dog training. And show Google that your site is an authority on the topic.11. Link to High-Quality External ResourcesAdding external links (also called outbound links) to authoritative websites for sourcing purposes shows that your content was created with accuracy and credibility in mind.Outbound links can also bring value to users. Because those links lead to resources users can visit to expand their knowledge of the topic.It’s a good idea to provide an external link any time you’re referencing: Statistics Reports Surveys Case studies InterviewsBut statistics and research do change over time. So, make sure you link out to the most up-to-date information available. 12. Optimize Your Content for Featured Snippets & AI OverviewsGoogle could be showing featured snippets (direct answers at the top of the search results) or AI Overviews (AI-generated summaries that link to relevant sources) for your primary and secondary keywords. Which are huge opportunities to increase your visibility.For example, if you search for “is vegan diet healthy,” you might see an AI Overview and featured snippet like this:Google typically pulls the featured snippet and AI Overview content from top-ranking pages.You can appear in these prominent places by optimizing your content for them.First, search for your keywords using Google to see whether there are any featured snippets or AI Overviews in the search results.If there are, consider what information is included and how it’s formatted.This will help you understand what Google and users are looking for. And how you can improve your content to rank for those prominent results.Generally, the optimization process boils down to: Providing clear and concise explanations in simple language Using other SEO tactics like gaining reputable backlinks, priming your website for crawling and indexing, etc. To give your content the best possible chance of ranking highly.13. Create an Optimized Title TagA title tag is the title of your webpage or article that may appear in search results. Google looks at the title tag to understand your content’s topic. So it can rank the content appropriately.For users, the title tag is their first impression of your content. They read it first before deciding to click through and read more.So, it’s worth optimizing it. Here are some tips to consider: Make sure your title tag entices users to click. You can use power words, numbers, and brackets for that. Include your primary keyword in your title tag (preferably at the beginning). This will help you rank for that keyword and show relevance to the user’s query. Keep your title tag around 55 characters long. So Google doesn’t truncate it in search results.Here’s an example of a good title tag: How to Lose Weight on a Vegan Diet Plan (7 Easy Steps).As you can see, this title tag is around 55 characters, includes the keyword, and uses both a number and power word to entice a click.You need to do the same with your own content’s title tags.14. Write a Compelling Meta DescriptionA meta description is a short summary of your article that can appear below the title tag.Google may not always display the meta description you set for your page. Sometimes, they override it and generate the description that they think will work best for users.And it’s worth mentioning that meta descriptions aren’t a direct ranking factor. Despite all this, it’s still worth optimizing them. Because a well-written meta description can entice users to click on your result.Here are some tips to follow: Use active voice. This will improve clarity by addressing users directly. Use action verbs. This will nudge users to click through and explore your article. So, use phrases like “learn more,” “find out,” or “dive deep.” Keep it brief. Google cuts off meta description after about 105 characters on mobile. So, keep it to one to two short sentences to stay below that threshold. Use your target keyword. This will signal to users that your page covers the topic they want to learn about.Here’s an example of a good meta description: Wondering how to lose weight on a vegan diet plan? Dive deep into the secrets many don’t talk about.As you can see, this meta description is under 105 characters, includes the target keyword, uses active voice, and includes an action verb to entice a click.You need to apply the same principles when writing meta descriptions for your own content.15. Optimize Your URL SlugA URL slug is the last part of your page’s URL. Here’s an example:Google looks at the URL slug to understand what topic your content covers. Which is why you should optimize it.Here are some best practices to follow when determining what your slug should be: Include your target keyword. This can help Google understand what your article is about and show it for relevant queries. Use hyphens to separate words. Hyphens are the standard way to separate words in a URL slug. Avoid using dates. Dates in your URL slug can make your article look outdated. Be concise and descriptive. Rather than being overly long or confusing.By following these tips, you can create an optimized URL slug that will help your article rank higher on Google and drive more traffic.16. Promote Your ContentContent promotion involves sharing your content through different marketing channels. Which drives referral traffic and leads to backlinks that can improve your rankings over time.For example, you can link to your blog articles in social posts. Like this:Content promotion may include sharing your content via: Social media posts Email marketing outreach Press releases Paid ads Other places on your website (e.g., sidebar links, pop-ups, internal links, etc.)Pro tipUse Social Poster to schedule posts across your primary social accounts like Facebook and LinkedIn. Plus, use it to identify the best times to post to drive the most engagement from your followers.Start Your SEO Writing JourneyThat’s pretty much everything you need to know to go out and start writing SEO content.For every piece, follow the advice we’ve shared above. And your articles will likely start ranking well on Google.And using Semrush tools can make your SEO writing process even easier and more effective. Start your free trial today.",
  "headers": [
    {
      "level": "H1",
      "text": "SEO Writing: 16 Tips for Creating SEO-Optimized Content"
    },
    {
      "level": "H2",
      "text": "What Is SEO Writing?"
    },
    {
      "level": "H2",
      "text": "Why Is SEO Writing Important?"
    },
    {
      "level": "H2",
      "text": "16 Tips for Creating SEO-Optimized Content"
    },
    {
      "level": "H3",
      "text": "1. Find Your Primary Keywords"
    },
    {
      "level": "H3",
      "text": "2. Identify Content Gaps"
    },
    {
      "level": "H3",
      "text": "3. Choose Your Secondary Keywords"
    },
    {
      "level": "H3",
      "text": "4. Satisfy Search Intent"
    },
    {
      "level": "H3",
      "text": "5. Create Quality Content"
    },
    {
      "level": "H3",
      "text": "6. Leverage Keywords in Your Content"
    },
    {
      "level": "H3",
      "text": "7. Structure Content with Subheadings"
    },
    {
      "level": "H3",
      "text": "8. Make Your Content Easy to Read"
    },
    {
      "level": "H3",
      "text": "9. Include Multimedia Elements in Your Content"
    },
    {
      "level": "H3",
      "text": "10. Add Internal Links"
    },
    {
      "level": "H3",
      "text": "11. Link to High-Quality External Resources"
    },
    {
      "level": "H3",
      "text": "12. Optimize Your Content for Featured Snippets & AI Overviews"
    },
    {
      "level": "H3",
      "text": "13. Create an Optimized Title Tag"
    },
    {
      "level": "H3",
      "text": "14. Write a Compelling Meta Description"
    },
    {
      "level": "H3",
      "text": "15. Optimize Your URL Slug"
    },
    {
      "level": "H3",
      "text": "16. Promote Your Content"
    },
    {
      "level": "H2",
      "text": "Start Your SEO Writing Journey"
    }
  ],
  "author": ""
}