{
  "url": "https://www.semrush.com/blog/september-2022-core-update-impact/",
  "slug": "september-2022-core-update-impact",
  "title": "September 2022 Core Update Impact",
  "description": "Analysis of September 2022 Core Update Impact",
  "content": "The month of September 2022 has been one of the most dynamic months in SEO in quite some time. After announcing the Helpful Content Update (HCU) in late August the update complete its roll-out on September 9th (it’s important to remember the HCU is continually being refined and will play an active role in ranking). Just a few days later on September 12th, Google announced the September 2022 Core Update Parenthetically, this was followed by the announcement of the latest Product Review Update on September 20th. With that, here’s an overview of the impact the September 2022 Core Update had.How Volatile Was the September 2022 Core Update? A cursory review of the data indicates that the September update was far less volatile that the previous core update, the May 2022 Core Update. This is confirmed as we dig deeper into the data. Specifically, the relative increases in rank volatility when compared to pre-update levels were far less significant during the September 2022 Core Update compared to its predecessor. Overall, the September 2022 Core Update presented rank volatility increases that were 53% less drastic than change in volatility seen during the May 2022 Core Update.The increases in rank volatility compared to pre-update levels exhibited during the September 2022 Core Update were so relatively low that not a single vertical cracked even a 4-point increase (the average itself was barely over 2-points). Looking at the data above, and for comparison, you’ll see that numbers verticals saw over a 5-point increase in volatility during the May 2022 Core Update. Interestingly, during the May 2022 Core Update both the Travel and Real Estate niches were some of the most volatile. Here, during the September 2022 Core Update, they were two of the least volatile verticals with the Travel niche displaying a volatility increase of under one full point. For further contextualization, the levels of rank volatility increases recorded during the May 2022 Core Update were 19% less than the November 2021 Core Update that preceded it. Thus, the current September update saw 53% fewer volatility increases than what was recorded during the May 2022 Core Update, an update already significate “weaker” than some of its predecessors (namely, the November 2021 Core Update). Rounding out the most volatile niches during the September update were: Online Communities Hobbies & Leisure Pets & Animals Beauty & Fitness GamesHowever, what I think really tells the story of this update is the data around peak volatility recorded. Even during the already described “weaker” May 2022 Core Update, the peak levels of volatility reached what we typically see during a core update. Thus, when we compared peak volatility during the May 2022 Core Update to the November 2021 Core Update there was not an enormous discrepancy between the two overall. The May update hit an average peak volatility of 9.3 and the November update peaked at 9.4. A marginal difference.Not so during the September 2022 Core Update which peaked at an average volatility level of 5.2.In fact, the highest peak volatility was seen within the Games vertical which didn’t even crack a peak level over 8. In other words, this is a real divergence between how core updates typically behave. Even when an update might not be as powerful overall as others, the peak levels recorded are within the same ballpark. Here, during the September 2022 Core Update we diverge from the general trend in a noticeable way. The September 2022 Core Update Diverges From Normative Trends The disparity between the data trends seen during the September 2022 Core Update and its predecessors is reflected in the data around average gains and losses. During the May 2022 Core Update the average number of positions gained stood at 3.41 and the average loss was 3.77 ranking positions. This is similar to what we saw during the November 2021 Core Update where the average gain stood at 3.2 positions and the average loss was 3.3 positions. However, during the September 2022 Core Update the average gain and loss was essentially a full position less. Here the average gain and loss were both approximately 2.5 positions. This makes perfect sense as the overall level of volatility was less during the update. However, it does point to the fact that even when Google was rewarding/demoting sites, the update tended to be less impactful overall. This is interesting because once Google decides to change the rankings you might think they would simply reward or demote to the usual extent that they tend to do during a core update. The trend continues when looking at the percentage of sites that rank top 20 or better. Here, of all of the URLs ranking 20 or better, 14.52% of them did not rank within the top 20 prior to the September 2022 Core Update. This stands at a bit of contradistinction to both the May 2022 and November 2021 Core Updates where 17.06% and 16.19% of the URLs within the top 20 were not ranking as such respectively. Once we start looking at the top 10 results things start to normalize and the September 2022 Core Update looks more like your traditional core update. To that, 6.53% of the URLs ranking in the top 10 were ranking beyond position 20 before the update. This is quite similar to the May 2022 Core Update where 6.7% of the URLs ranking top 10 came from beyond position 20. Of course, none of this matters if your site or one of your key pages was negatively impacted by the update. While overall, the data points to the September 2022 Core Update as being less impactful, that’s an average. A given site or page might have experienced catastrophic ranking losses. Moreover, even if a page didn’t lose 100 ranking positions, falling from a top 3 or 4 ranking on the SERP to position 12-13 can mean a serious loss of traffic and revenue. A Lot of Updates Saying we’re in a volatile environment is perhaps an understatement. Yes, the September 2022 Core Update did not pack the usual punch of a core update (again, for a specific site it sure may have). However, this core update is sandwiched between two other significant algorithmic events, the Helpful Content Update and the September 2022 Product Review Update. That’s a lot of various ways to be impacted by the algorithm all at once. The updates are a bit staggered so that should help you diagnose, potentially, which update was at play in your rank movement. (Of course, with the Product Review Update, being a review site and/or being ranked on SERPs that contain review sites makes diagnosing the “culprit” a bit easier). Whatever the case, diving in a carefully monitoring what happened in your rankings is almost certainly the prudent thing to do in such an environment.",
  "headers": [
    {
      "level": "H1",
      "text": "September 2022 Core Update Impact"
    },
    {
      "level": "H2",
      "text": "How Volatile Was the September 2022 Core Update?"
    },
    {
      "level": "H2",
      "text": "The September 2022 Core Update Diverges From Normative Trends"
    },
    {
      "level": "H2",
      "text": "A Lot of Updates"
    }
  ],
  "author": ""
}