{
  "url": "https://www.semrush.com/blog/share-of-search/",
  "slug": "share-of-search",
  "title": "Share of Search: The Ultimate Guide & 3 Measurement Tools",
  "description": "Share of search might be the most important metric you’ve never heard of. What is it, how do we measure it, and how can we improve it or use it to help us win at search?",
  "content": "Share of search might be the most important metric you’ve never heard of.If you’re like me, you might be a little skeptical about tracking new metrics, assuming they’re inherently meaningless. This one, though, strikes me differently. It correlates with overall market share, or at least acts as a leading indicator. More importantly, it’s more manageable and focused than overall market share, and it brings together brand and performance teams in a magical way.This blog post will explore share of search from a functional standpoint: what is it, how do we measure it, and how can we improve it or use it to help us win at search?What Is Share of Search?Share of search is the volume of search queries for a given brand in proportion to all of the search queries for all the brands in a category. Share of search in many ways resembles market share. But whereas market share looks at actual sales or revenue proportions in relation to the overall market, share of search strictly looks at search volume and search engines as a landscape. In this way, share of search is a metric of importance for several teams, including SEO and demand generation, but also brand and product marketing teams. Brand Metrics: Share of Search vs Share of Voice vs Market ShareThere are many metrics we marketers use to approximate ‘brand awareness.’ The problem is, all brand awareness metrics mean something slightly different. Share of Search ≠ Share of Voice ≠ Market ShareWhat Is Market Share?Market share is the most common and high level brand awareness metric. It’s the percent of total sales in an industry generated by a particular company. You calculate this by taking a company’s sales over a period of time and dividing it by the total sales of the entire industry over the same period of time.It’s generally hard to get the exact market share of a company because it’s hard to estimate private company sales. It’s also getting harder to distinguish who exactly is in your industry and who is not.For example, is Mailchimp competing in the email marketing industry, or the broader marketing technology industry?Either way, market share is a lagging metric that is built over time through many different inputs, like sales, product development, brand initiatives, and on and on.Datanyze tries to approximate the market share by calculating how many companies use a given tool, but while it’s a good approximation, it doesn’t actually translate to revenue and sales. What Is Share of Voice?Share of voice, oddly enough, doesn’t really mean anything. Or rather, it means several different things depending on whose blog you’re reading.It started out as an advertising metric. According to Wikipedia, share of voice “measures the percentage of media spending by a company compared to the total media expenditure for the product, service, or category in the market.”HubSpot defines share of voice is “a marketing metric that allows you to compare brand awareness on different marketing channels against your competitors.” So basically, share of voice means whatever you want it to mean—as long as it takes into account your proportion of awareness in a specific channel in relation to the broader space you operate in.Brand recall is a metric closely related to share of voice. This one is more closely associated with brand awareness, as you actually survey potential customers and see how likely they are to recall your brand in relation to competitors. Why You Should Track Share of SearchShare of search is the most specific of the brand awareness metrics here. Share of search is typically based on Google Trends search data and is defined by the number of searches a brand receives divided by the searches for all brands within a competitor set over a certain time period.I’ll broaden the definition to include your brand’s representation on a given search results page for a search query related to your product category. I call this “SERP visibility,” it’s also tied in to your search visibility. For example, take the search query “best CRM software.” This query represents someone searching directly for CRM software and shopping around for options. At this stage, they may already know a few CRM tools (like HubSpot), but they may not know some other tools (like Pipedrive). So the search result page will be correlated with existing “share of voice,” but it can also be managed and manipulated to drive more of it! That’s why I love this metric: it’s controllable. With most brand awareness metrics, you’re tracking lagging indicators and trying to tell a story backwards.But with share of search or SERP visibility, you can actually increase your overall real estate for a given search query. This will improve your share of voice in search as well as drive referrals and conversions, which tie directly to business results. “With share of search or SERP visibility, you can actually increase your overall real estate for a given search query.”How to Measure Share of SearchShare of search can mean two different things: Classic share of search SERP visibility (or maybe share of SERPs)Both of these require an initial audit and understanding of the industry in which you operate and the other competitors in that space. I’ll walk through three ways to measure share of search here.1. Google TrendsIn the classic model of share of search, all you need is Google Trends or an SEO tool like Semrush. Let’s start with Google Trends, as it’s the simplest methodology to get started.Google Trends is a free tool that shows you keyword search volume trends over time. Using Google Trends to measure share of search has some clear limitations, namely that you can only see brand search terms between yourself and competitors. You can’t really see how much of a given category keyword (like “CRM software”) you own this way.But it does give us a good high level overview of your brand awareness in a space. To start, make note of your competitors. With Google Trends, I recommend not making this comprehensive, but rather just listing out your top 3-5 competitors. As an example, let’s explore the digital asset management (DAM) space and pretend we’re working for Aprimo. Their top few competitors may be: Bynder Adobe Experience Manager MediaValetJust plug all these keywords into Google Trends:The trends data is interesting, but we’ll want to summarize it and see what percentage of search queries Aprimo gets in comparison to the rest of their competitors.To do this, take Aprimo’s branded search traffic and calculate that as a percentage of all the branded search traffic among your competitors. It looks like they clock in at about 16.7% of the market here:Like I mentioned, Google Trends is a bit of a simplistic way to calculate measure of search, but it’s a great high-level audit for where your brand currently stands in relation to competitors as well as how you trend over time. 2. Semrush Keyword OverviewYou could use an SEO tool, which gives you even more data to work with. We will, of course, use Semrush to walk through our examples.First, you can replicate the same data you got from Google Trends by using the Keyword Overview tool and entering all of the branded terms again:Again, add up all of the keyword search volume. Then take Aprimo’s search volume and divide it by the total summarized volume. This will give you their relative percentage in relation to competitors. We can see, using this method, that Aprimo clocks in at 15.2%, roughly similar to our measurement using Google Trends:If you have multiple category keywords that describe your product, you can also use Semrush to calculate the average position your website ranks for among these keywords. For example, HubSpot could be called “marketing software,” “CRM software,” and “sales software.” Let’s see where they rank for the following terms in relation to Salesforce, Zoho, and ActiveCampaign.Use the Semrush Position Tracker tool, where you can enter your domain and the keywords you want to track. Add your competitors.You now have a few options depending on which specific metric you want to track.One of them is getting the average ranking for these keywords:The other is getting your “visibility score,” which I’ll talk about in greater detail next:You can see that HubSpot’s brand visibility and average rank are much better than the competition. Necessary caveat here though: obviously Salesforce has a much bigger market cap than HubSpot, yet their share of search metrics don’t surpass HubSpot’s. That’s a feature, not a bug of this metric. If we’re looking at market share, Salesforce crushes HubSpot, but again, there are many compounding and disparate reasons for this. They sell to the enterprise. Their go-to-market and product suite differs. They sell in different ways than solely through search.But as far as metrics you can manage, share of search is something concrete. HubSpot can win in this field, which contributes to their growth and market share (which again, is a lagging metric that includes many inputs).3. Surround Sound SEOFinally, my favorite way to measure share of search.Most share of search metrics are measuring branded search traffic (which is basically a lagging indicator) or average ranking position for a set of keywords.Using the surround sound SEO strategy, though, we seek not only to rank highly for a given keyword, but to monopolize the search results page for that term.Let me explain.If you’re searching for “CRM software,” or “best CRM software,” you probably already know a few software tools in the space. But there are many you don’t know, and this keyword implies you’re exploring your options. I call these “product exploration keywords.” It’s like asking for recommendations. If you asked ten friends which software they recommend, and they all said the same thing, you’d be pretty likely to try out that software, right? That’s the goal with the surround sound SEO strategy. When you analyze the SERPs, this goal becomes common sense. You can see here, for example, that the first search result is from Zapier.com, which is not a CRM software. They do write about CRM software, though, and they rank the top options (Zoho and Salesforce both appearing).It’s clearly important, from a buyer’s journey perspective, to get on this list. Appearing at number one on Zapier’s list is like one of ten influential friends recommending your product. Appearing on all of the lists on this page is like all ten recommending your product. Growth marketer Zach Grove has seen that getting added to these “Best of” lists can have an outsized (positive) impact on your other digital marketing efforts:“Whenever I run a qualitative ‘How did you hear about us?’ survey for companies I consult with, I’m always surprised by how many customers write: ‘I was researching XYZ products and I saw you listed on a few sites.’”According to Google Analytics, interestingly, these same customers eventually signed up via Facebook Ads, email, or organic social. The lesson: getting your product listed in more high-ranking, high-intent pages (i.e. Surround Sound SEO) builds the initial trust needed to drive sales from your other marketing channels later.”I’ve seen the same thing, anecdotally, with a list I published on the “best content marketing agencies.” Despite the fact that I’m obviously biased in writing this list, prospects will still mention it when I ask where they found us on sales calls. So how do you measure this? You could do it manually, but I prefer Semrush’s Surround Sound tool.Just pop in your keywords, your competitors, how many search results you want to analyze, and start your campaign tracking.This will immediately give you a ton of data, auditing where you stand in comparison to your competitors for these search queries. At a high level, we can see that Salesforce actually does beat HubSpot on “CRM” related keywords:You can also get a glimpse at your own positions and visibility, without comparing competitors:This shows you a breakdown of each keyword with its associated search volume and potential traffic, as well as your brand’s visibility and number of mentions for each keyword.What I like about Surround Sound SEO is that this is actionable data. You can actually go out and do things to improve your numbers once you know where you stand.To start increasing your SERP visibility, first look at where you’re not mentioned but your competitors are. You can find this in the “pages” section of the tool:Of course, there are a few competitor pages ranking here that you probably can’t get mentioned on. But if you find an opening where you’re not mentioned, it’s time to build an outreach plan. How you get on that list is outside the scope of this article, but I wrote about account-based link building and our own Surround Sound case study previously. Share of search via surround sound strategy—or as I call it, SERP visibility—is both a leading and lagging indicator of your position in the market. Of course if you’re already well known, you’re likely to have high visibility. But you can also work towards greater visibility, which drives awareness, conversions, and ultimately contributes to the other share of search modalities I outlined above (eventually, even market share).SERP Visibility: An Alternative to Share of Search?Part of my goal in writing this piece was to introduce and define share of search as it is currently used. The other part of my goal, I’ll admit, is to redefine the term to include or be replaced by SERP visibility. Why?Share of search (as measured by branded search volume divided by the total volume of searches across your own domain and that of your competitors) tracks closely to market share, but there are limitations. First, like market share, it’s a lagging indicator. There’s not much you can do to make more people search your brand, outside of all the normal brand building initiatives (much of which is simply a function of time). While it’s good to take a temperature check as to where your brand stands against competitors, there’s not much you can do in the near term to increase this or to decrease the amount of interest and search volume of your competition. Second, as an indicator of brand awareness, it excludes many other forms of discovery. In many spaces, digital and search are still not the primary means of discovering a brand. In enterprise software, for example, Salesforce could probably drop from most search results without much hit to their market cap. So if you’re hoping to find a metric to holistically measure your brand recall and recognition, it may or may not do the job well, depending on your marketing mix and industry. But SERP visibility is both a measurement of your brand awareness and something you can control and improve to drive more results in digital and search. Back to the Salesforce example: they’re naturally going to have high SERP visibility because they are already well known. If you’re writing a listicle on the “best CRM,” you’re almost obligated to include them because of their market penetration. But if you’re a newer player with less brand exposure, you can feasibly match or exceed the SERP visibility of Salesforce and drive more signups via search by getting mentioned on the pages that already rank for your keywords. ConclusionTracking your share of search is a narrower way to measure brand awareness than other modalities such as market share and share of voice. It is, however, a lagging indicator much like market share or brand recall. Tracking share of search is easy. You simply calculate the volume of search traffic for your brand name, the volume of search traffic for your competitors’ brand names, and then calculate the percentage of brand search volume you own in comparison to the industry.I like this metric, but a version of this I like even better is SERP visibility: the percentage of the SERPs on which you are mentioned for a product category search term (something like “best email marketing software”—a generic term for your industry or product line). Not only is this metric a good audit of your brand awareness, but you can also manage and improve it. This is done through surround sound SEO, and if you execute well (and use the right tools), you can drive not only increased brand awareness, but actual sales and referral traffic, which are key goals in digital PR.",
  "headers": [
    {
      "level": "H1",
      "text": "Share of Search: The Ultimate Guide & 3 Measurement Tools"
    },
    {
      "level": "H2",
      "text": "What Is Share of Search?"
    },
    {
      "level": "H2",
      "text": "Brand Metrics: Share of Search vs Share of Voice vs Market Share"
    },
    {
      "level": "H2",
      "text": "What Is Market Share?"
    },
    {
      "level": "H3",
      "text": "What Is Share of Voice?"
    },
    {
      "level": "H3",
      "text": "Why You Should Track Share of Search"
    },
    {
      "level": "H2",
      "text": "How to Measure Share of Search"
    },
    {
      "level": "H3",
      "text": "1. Google Trends"
    },
    {
      "level": "H3",
      "text": "2. Semrush Keyword Overview"
    },
    {
      "level": "H3",
      "text": "3. Surround Sound SEO"
    },
    {
      "level": "H2",
      "text": "SERP Visibility: An Alternative to Share of Search?"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    }
  ],
  "author": ""
}