{
  "url": "https://www.semrush.com/blog/silo-seo/",
  "slug": "silo-seo",
  "title": "What Is Silo SEO and Is There a Better Option?",
  "description": "Is a silo SEO structure good for your website? Learn best practices for optimizing site architecture.",
  "content": "You may have heard content siloing recommended as an effective way to structure your site for search engines.But siloing, by its strictest definition, can actually limit your site’s performance and usefulness.In this article, we’ll explain silo SEO and how it works. Then we’ll cover why it’s not such a good idea and how to optimize your site architecture instead.What Is Silo SEO?Silo SEO is a form of website architecture that involves grouping content by topic into self-contained sections of your website.Content within each group (or “silo”) is interlinked, but the key part of this strategy is that silos remain isolated and don’t link between each other.Creating a hierarchy of pages on your site and connecting them is part of technical SEO—a search engine optimization process that makes your site easier to crawl and index.So, what does a silo structure look like?Let’s say you have a gardening blog for content marketing purposes. From your homepage, you split your site into distinct categories (silos).You might have these three category pages: Sowing seeds Plant care Gardening equipmentEverything you write about seeds will fall under the “sowing seeds” silo. And you’ll link posts within this silo to each other.For example, say you have an article about the best seeds to sow in the summer. You can link from that to articles on the best seeds to sow in the spring, fall, and winter.The same process goes for posts in the “plant care” and “gardening equipment” silos.This means your gardening site structure would look something like this:With this structure, you don’t link between articles in separate silos even if there’s thematic overlap.For example, if you have a post on organic gardening, you can’t link to anything about seasonal planting, as that sits under “sowing seeds.”Just like a physical silo, a virtual silo for website content must stand alone.The Argument for SEO Silo StructureA silo structure is good for site owners, website users, and search engines. It helps you organize your content and build authority in your niche. Users can more easily find what they need. And search engine bots (site crawlers) can assess your site more easily.Here are some of the perceived benefits:Simplified Site StructureIf you’re creating a website for the first time or want to make your site easier for search engines to crawl, silos are a simple concept to understand and implement.The clearly organized internal linking structure helps search engine crawlers discover and index new pages:A crawler lands on one of your pages, then follows the pages it links to. This helps it understand what the page—and your site—is about. All the pages add context and authority to each other. The more pages you have on a topic, the more authority you can build on it.Easier NavigationA silo structure gives your web pages a logical hierarchy. This improves user experience (UX) by making it easier for visitors to find the information they need.Using internal links to connect posts and landing pages on similar topics helps users navigate between pages and keeps them on your site longer.Builds Topical AuthorityWhen you organize your content into silos, it grows your topical authority. That’s the measure of how trustworthy, or credible, your website content is.The more high-quality content you provide on a topic, the bigger the impact on your topical authority.Covering individual topics related to a niche in individual silos helps Google understand how the pages in each silo connect. This establishes you as an authoritative source on those topics for search engines as well as website visitors.To create authoritative content, follow Google’s quality guidelines. That means writing content that shows experience, expertise, authoritativeness, and trustworthiness (E-E-A-T): Experience: Does the content creator have first-hand experience of the topic? Expertise: Do they have the knowledge or skills on the topic? Authoritativeness: Are they a go-to source for the topic? Trustworthiness: What does the About page say? Are there any independent reviews that can verify how trustworthy they are?The Problem with Content SilosSilos limit where the internal links on your website can point to.If you can’t link relevant information across your site, visitors may return to the search engine results pages (SERPs) to look for related content, and end up on rival sites.This could result in missed opportunities for leads or conversions.For example, imagine we had a silo for keyword optimization, and another for competitor research.A prospect found us via a page on keyword optimization. But they also want help with their competitor research.If the content on the keyword optimization page doesn’t link to competitor research even if it’s relevant, that prospect may think we can’t help them with both. So they may go to a competitor instead.Some experts also argue that siloed content is planned and artificial.Because search engines are increasingly looking for more human-focused ways of grading content, you’ll get more value out of natural linking that people find useful or logical.Content silos also risk orphan pages. This is when none of the other pages on your site link to a page.Users can only find orphan pages if they have the direct URL or visit your sitemap. Crawlers may also find it challenging to add context to the page. As a result, the page could suffer in the SERPs and get fewer visitors.The Importance of Internal LinkingGoogle Search Advocate John Mueller says, “Internal linking is super critical for SEO” because it helps search engines discover and rank your content pages.Search engines want natural links that humans find useful or logical in the context of your content. This is different to how search engines used to organize and grade webpages.A more natural internal linking strategy helps to avoid orphan pages, because you can link from any page on your site to any other page.Here’s what an internal link (the clickable orange anchor text) looks like:While link building focuses on getting external links to your site, internal links create website structure and can guide visitors and crawlers to your most important pages.“Important” to you could be a high-converting landing page. Or an article that gives you a competitive edge.Google’s SEO Starter Guide stresses the importance of creating a “naturally flowing hierarchy”:The guide says all of your site’s pages should be reachable through links and that you should help users discover similar content.Linking from one page to another also gives Google (and readers) more context about that page.For Google, this helps explain the page’s relevance, which can affect how that page ranks in SERPs.Using internal links makes it easier for users to learn more from related pages with a single click.So if an article touches on a topic, but doesn’t fully explain it because it’s outside of the scope of the piece, you can use an internal link to point the user to somewhere they can learn more.The user gets to learn more with a click, and you get to mention related topics without explaining them in full.Content Silos vs. Topic ClustersTopic clusters are an alternative to content silo architecture. They’re a group of related content (blogs, landing pages, etc.) centered on a common topic. Each cluster has a pillar page as its central hub. These pieces of content provide a broad overview of the topic and link to the related pages.Both silos and topic clusters segment content by category. Both also help you organize your content to become an authority site on particular topics. Because of these similarities, people often use the two terms interchangeably.But there’s one significant difference: you can link between topic clusters.Here’s how the two methods compare:Once you link outside the silo architecture, you break the rules of siloing.Topic clusters are a way to maintain a clear structure while getting all the benefits of internal linking.How to Optimize Your Site Architecture for Search EnginesBasing your entire site architecture on a silo structure can be an effective SEO strategy—but only if you loosen the rules and allow interlinking between silos (like with topic clusters).Here are four ways to create a logical hierarchy and organize your content on your site:1. Create Organized Content PillarsStructuring your content to prioritize top-level topics and then linking down to long-tail versions helps you rank for all relevant keywords.For example, you might have an ultimate guide that covers the most popular digital marketing strategies. This parent page would be your pillar. From here, you’d have separate cluster pages that cover the sub-topics within the pillar page. In this case, there might be posts for SEO strategies, social media, and paid ads.Each cluster page links back to the pillar page and you interlink these posts, too.Here’s what that looks like:Instead of keeping each silo separate, you interlink clusters or pillars.For example, say you have a pillar page for SEO basics, as in the above example. Now say you also have a pillar page for content basics, and linked to that, a cluster page on content creation. You could offer more value and keep visitors on your site by linking from the content creation page to the keyword research cluster page under SEO basics.When your pillar pages rank, you get multiple SEO benefits like backlinks and traffic.Because you link your clusters (AKA child pages) to these pillars, they get some of the benefits passed on (known as “link juice”).Once you implement pillars and topic clusters, you’ll find all your content is no more than a few clicks away from your homepage. But only if you interlink everything correctly.If you aren’t sure which keywords to use for topic clusters, try Semrush’s Keyword Strategy Builder. Input a seed keyword (or up to 5) and click the green “Create list” button to get started.For this example, we’ll use “painted pet portraits.”The Keyword Strategy Builder will display relevant keywords. And automatically sort into groups by topic.These groups are labeled as topics and pages (previously labeled as keyword clusters).Assign one keyword cluster (rather than one keyword) to each page in your topic cluster. Then, you can optimize your content accordingly.So you can rank for a wider variety of relevant keywords.2. Use Subdirectories to Create Meaningful URLsAnother way to help your pages rank is to optimize their URL structure for SEO. Using subdirectories (or subfolders) instead of subdomains can increase your traffic and visibility. Subdomains (e.g., blog.yourdomain.com) are almost like separate websites that break your primary domain into distinct categories. They’re used to host things like blogs or ecommerce stores that are part of a larger site. Subdirectories (e.g., yourdomain.com/blog/) use folders to organize content within the main domain.Google says it’s fine to use either.But search engines may not share your link juice from content on your primary domain with your subdomain. Which could make it harder to rank higher.Here’s what happened when SEO consultant Andy Chadwick moved his blog from a subdomain to a folder on his main domain:In this case, organic traffic more than doubled.A similar trend happened when one of SEO expert Stephen Kenwright’s clients did the same:Here, visibility more than tripled.Switching your subdomains to subfolders doesn’t guarantee you’ll see the same results.But Kenwright noted in a subsequent tweet, “I have never seen the opposite happen when that switch is made.”Here are a few tips on how to optimize your URLs using subdomains: Protect your visitors’ sensitive information with an HTTPS certificate Choose an appropriate top-level domain (e.g., .com or .org) that fits your site’s purpose Use subfolders that logically organize your content and show users where they are on your site (e.g., https://website.com/blog/case-studies) Write URL slugs that are short, descriptive, and separated by hyphens (e.g., https://website.com/best-seo-strategies)While optimized URLs are great for navigation, internal links are still key to optimizing site structure.John Mueller’s comments on social media echo this theory:3. Bridge Your Site with Internal LinksInterlinking posts in a hierarchy helps search engines give more visibility to your important pages. This also improves your UX, because it’s easier for them to find related subjects, services, and links on your site.John Mueller says that the number of clicks from your homepage to another page tells Google how important it is.A flat hierarchy structure (when you link all pages on a site directly to the homepage) is a popular strategy for keeping content close to the homepage. But it makes it harder for Google to know which pages to prioritize.Grouping content into pillar pages and topic clusters gives Google clear instructions on page distinctions. Creating a hierarchy helps the search engine give your important pages more visibility. For instance, you might link pages in a pyramid-type linking structure that puts important content at the top and branches out.A pyramid structure helps you avoid burying your important pages under layers of content.For instance, a big ecommerce site with thousands of products can use this structure so they don’t end up with any pages that are 20 clicks deep and hard to find.You can determine the effectiveness of your current internal linking structure with Semrush’s Site Audit tool.Enter your domain and click “Start Audit.”Under Thematic Reports, you’ll see a percentage representing your Internal Linking score.Click “View details” to access the full report.Here, you’ll get five insights to audit your current setup.1. Pages Crawl Depth shows how many clicks it takes to reach specific pages on your site.​​​​2. Internal Links shows how many internal links pages on your website have. Clicking each bar breaks down which pages have the specified number.3. Internal Link Distribution shows how search engines could distribute your “link juice” across your pages.4. Internal Link Issues show problems with your internal linking structure. You should fix Errors immediately, while Warnings and Notices aren’t as urgent.5. Pages Passing Most Internal LinkRank shows your strongest pages. You can use these to pass on internal link juice.Once you have all this information, you can fix common problems like: Broken links that send users to pages that don’t exist Too many links on one page that can confuse crawlers and site visitors Nofollow links that don’t pass on any “link juice” Orphan pages that have zero links (which means it’s harder for users and crawlers to find them) Crawl depth of more than three clicks (which suggests the page isn’t important)Using internal links to bridge all your pages means you won’t have any dead ends on your website. Plus, you’ll make it clear to Google and users where to focus their attention.4. Always Consider User ExperienceWebsite visitors won’t stay on a site that’s difficult to navigate or understand. However you structure your site, make sure it’s easy to use and that the content aligns with expectations.While it’s important to make search engines happy, metrics that indicate an excellent human user experience significantly impact rankings.For instance, how long a user spends on a site and how many times they click tells Google’s algorithms a lot about the site.You can find and track important UX metrics in Google Analytics.For example, head to Engagement > Overview to see users’ average engagement time on your site.To find the average engagement time per page, click “Landing page.”If your engagement rate is low on certain pages, it may indicate users struggle with the content or usability of that page. This baseline will help you see where you can improve the user experience.Poor UX results suggest users don’t find your content relevant or useful. If the results persist, Google will reconfigure that content’s position in the SERPs.John Mueller had this to say about the relationship between UX and technical SEO:To create a good user experience: Prioritize important pages Align content with expectations Make it easy for users to find desired information Create intuitive navigationA silo site structure that allows internal linking (AKA pillars and clusters) can ensure the above.And while you don’t want important pages buried too deep, you should design your site with the number of topics and subtopics that make sense for your unique offering.The Best Site Structure Isn’t Self-ContainedTo organize your site for users and for SEO, aim for pillar posts and topic clusters that allow for logical internal linking.Wondering where to start?If you’re a newer site creating content for the first time, use our Keyword Strategy Builder to map out your pillar and cluster posts.If you want to improve your established internal linking structure, get an overview of any issues in Site Audit.",
  "headers": [
    {
      "level": "H1",
      "text": "What Is Silo SEO and Is There a Better Option?"
    },
    {
      "level": "H2",
      "text": "What Is Silo SEO?"
    },
    {
      "level": "H2",
      "text": "The Argument for SEO Silo Structure"
    },
    {
      "level": "H3",
      "text": "Simplified Site Structure"
    },
    {
      "level": "H3",
      "text": "Easier Navigation"
    },
    {
      "level": "H3",
      "text": "Builds Topical Authority"
    },
    {
      "level": "H2",
      "text": "The Problem with Content Silos"
    },
    {
      "level": "H2",
      "text": "The Importance of Internal Linking"
    },
    {
      "level": "H2",
      "text": "Content Silos vs. Topic Clusters"
    },
    {
      "level": "H2",
      "text": "How to Optimize Your Site Architecture for Search Engines"
    },
    {
      "level": "H3",
      "text": "1. Create Organized Content Pillars"
    },
    {
      "level": "H3",
      "text": "2. Use Subdirectories to Create Meaningful URLs"
    },
    {
      "level": "H3",
      "text": "3. Bridge Your Site with Internal Links"
    },
    {
      "level": "H3",
      "text": "4. Always Consider User Experience"
    },
    {
      "level": "H2",
      "text": "The Best Site Structure Isn’t Self-Contained"
    }
  ],
  "author": ""
}