{
  "url": "https://www.semrush.com/blog/small-business-seo/",
  "slug": "small-business-seo",
  "title": "Small Business SEO: 14 SEO Tips for Small Business Websites",
  "description": "Use these small business SEO tips to start improving your traffic, visibility in search results, and business.",
  "content": "Regardless of size, location, or type, your business can benefit from SEO.And you can start doing effective SEO for a small business website today. Even with limited time and resources.Below, we’ve provided concrete, actionable steps to get you started with small business search engine optimization.What Is Small Business SEO?Small business SEO is the process of optimizing your website and online presence to improve traffic from Google and other search engines.This means bringing more of the right people to your website: potential customers, clients, and leads.Small business SEO is simply a subset of general SEO. But with a more targeted approach and fewer resources.And if you’re a small business with a physical location, an emphasis on local search results, too.Small Business SEO vs. Local SEOSmall business SEO and local SEO are related. But they’re not the same thing.Local SEO can help any business, large or small, that has a physical location.But small business SEO is just for small businesses, whether they have a physical location or not.With that said, small businesses often have physical locations and need local SEO, so we’ll cover both in the tips below. Benefits of SEO for Small BusinessThe benefits of SEO for small businesses include the following:Increased AwarenessWith more visibility in the SERPs, more people will see your listing and become aware of your business.Increased awareness can lead to more business over time.Increased TrafficAs you optimize your online presence with SEO, you can get more traffic to your website, social media pages, and Google Business Profile.As you get more traffic, you’ll have the opportunity to turn that traffic into clients or customers.Connect With Your Target Audience Early SEO provides the opportunity to reach your target audience early in their buyer journey. By providing quality content that addresses pain points users may be experiencing early on, you can connect with your target audience and garner trust in your brand.For example, while Semrush offers a wide range of powerful SEO tools, we’ve provided this article to help you with small business SEO before you even consider paying for SEO tools.Competitive AdvantageBy ranking higher in search results and increasing your online visibility, you can reach more people and generate more leads and sales.This can help you compete with larger companies in your industry and strengthen your foothold in the marketplace.You’re Open 24/7Your target customers don’t live their lives nine-to-five. They have needs and problems and may look for solutions at all hours of the day.With an optimized online presence, your business can be an option for them whenever they need it. It’s FreeUnlike traditional marketing strategies that rely on upfront investment and ongoing costs, small businesses can leverage SEO for free.It only requires time and effort.If you’re willing to put in the time and effort, SEO is a cost-effective marketing strategy that can reap long-term benefits for your business.14 SEO Tips for Small BusinessesHere are 14 tips that will help you leverage effective SEO for your small business.1. Set Up Google Analytics and Google Search ConsoleGoogle Analytics and Google Search Console are fundamental tools for tracking your SEO efforts and monitoring your progress. You’ll need to first gain a baseline understanding of your current traffic and engagement metrics to know whether any SEO efforts are working. You’ll also need to continue to monitor this data over time to understand how you're doing, track your progress, and know which changes have had positive effects on your business.Fortunately, Google provides these solutions for free.And they connect with your pre-existing website using a few lines of code. (Don’t worry—it’s easy.) Google Analytics is an analytics platform that provides in-depth data on traffic, how users engage with your website, conversions, user demographics, and much more. Google Analytics is an integral tool for tracking your progress and understanding your users. Further reading: How to Set Up Google AnalyticsGoogle Search Console is a dashboard that provides data and information on how your site appears in Google Search.It will also provide data on any issues Google has with your website and allow you to submit fixes, sitemaps, and other important information. While Google Analytics is important for understanding your users and how they interact with your site, Google Search Console is key for understanding how Google views your site and how it performs in the SERPs.Further reading: How to Add Google Search Console to Your Website2. Set Up Your Google Business ProfileA Google Business Profile is absolutely essential if you’re a local business that serves customers in a specific geographic area.Such local businesses include restaurants, physical stores, law firms, doctor offices, dental offices, electricians, mechanics, and many more.Google Business Profile is a free tool that influences how your business appears on Google Search, Google Maps, and Google Shopping. It’s basically a profile you can set up on Google to help users find and learn about your business.With a Google Business Profile, you can gain search visibility and garner and respond to reviews.You can also share important business information with customers, such as your phone number, email address, and business hours. Users will see your listing when they search for terms related to your local business.Additionally, Google Business Profile accounts have access to analytics and data.The platform provides data on profile views, calls, messages, how many times people searched for your business, and more.You can use this data to further optimize your profile. Further reading: How to Set Up Your Google Business Profile3. Do Keyword ResearchKeyword research is the foundation of any small business SEO strategy.You’ll use it to ideate content, optimize your pages, build a site structure, and even curate your Google Business Profile listing.Keywords are words and phrases users type into Google search. Keywords are important for SEO because they tell you exactly what people are searching for and the words used to find it.You can use these keywords to optimize your website so that both Google and your potential customers know that your business can provide what they are looking for. To do keyword research, write down a list of terms that you would expect people to search for when trying to find a business like yours.Then open the Keyword Overview tool and enter the terms you just wrote down.Click “Search.”The Keyword Overview tool will provide information on each of the keywords you entered. This information includes the number of monthly searches of each term, its search intent, and its keyword difficulty (how hard it will be to rank in the top 10 for that term in Google search results). Typically, higher search volumes mean greater difficulty.So when first getting started, you may want to choose lower-volume keywords with lower difficulty. You can add these keywords to a list to begin building out a keyword plan.Once you’ve started to build out your list, you can take your keyword research a step further with the Keyword Magic Tool. You can use this tool to generate more keywords related to your business.Open the tool and enter any of the main keywords you've identified.For example, if you run a sushi restaurant in Chicago, you might enter “sushi chicago.”Click “Search.”You'll receive a list of keyword ideas that are related to the main search term you entered.Add any relevant terms to your keyword list.You’ll use this list later to plan out your site's structure, content, and optimizations. Since we’re looking at a local business (e.g., a sushi restaurant in Chicago), it’s valuable to analyze the keyword data that’s specific to that city.To do that, head to the Keyword Overview tool, enter your keyword, and select your location from the drop-down menu.Now, you’ll see city-specific keyword data for your chosen keyword. Such as keyword difficulty, search intent, local search volume, competitive density, and cost-per-click (CPC).These metrics will give you a good baseline of how difficult it is to rank locally for your target keyword. And how costly it would be to run a Google Ads campaign.Furthermore, you’ll get an even better understanding of the local market with the SERP analysis in the same report.This shows you which competitor webpages are ranking for your keywords. And how authoritative those pages are.It also shows you which SERP features (such as images, sitelinks, People Also Ask, etc.) your local rivals rank for—which we’ll dive into in our next tip.Further reading: How to Do Keyword Research for SEO4. Analyze SERP CompetitorsBy analyzing your SERP competitors, you can find additional keywords, understand the kind of content your users want to see, and gain a broader understanding of the online landscape for your business.But what are SERP competitors?Your SERP competitors are the websites you’ll be competing with for visibility on the SERPs. They may or may not be your offline competitors. Take a look at the SERP for “sushi in chicago.”The top three results in the map pack (labeled in the image as “Places”) are sushi restaurants. These may be your actual offline competitors.However, after that, the results seem to be restaurant review websites and blogs.Regardless of which sites you find in the SERPs, you need to know what you’re up against so you can tailor your approach accordingly.You can analyze these sites for how they use keywords, how they structure their sites, and what kind of content they are creating.You’ll need this information when it comes time to start optimizing your own site. When analyzing SERP competitors for your target keywords, note the following: Are they ranking their homepage or a dedicated page? How are keywords used on the page? How do they structure their websites? (Hint: Look at their header navigation menus.) What kind of content do they have? Who do they seem to be targeting (e.g., children, families, businesspeople, etc.)?You can take your SERP competitor analysis a step further with Semrush’s Organic Research tool. Simply enter the URL of one of your competitors and click “Search.”In the Organic Research dashboard, you can see how many keywords they rank for, how much monthly traffic they get from Google, and their top SEO keywords.If you click on the “Positions” tab, you can see all the keywords your competitor ranks for. Many of these keywords are ones you should also target. In the above example, we can see that this small sushi business brings in more than 4.5% of its organic traffic every month with the keyword “sushi restaurant.”This may not seem like a lot, but it’s 4.5% of an estimated 23,400 visitors every month from one keyword.That’s over 1,000 potential customers.Every month. It’s also only one of near 1,900 keywords they rank for. You get the idea. SERP competitor analysis is a crucial step in optimizing your own website.Further reading: How to Do SERP Analysis5. Review Your Site StructureSite structure is the way your pages and content are grouped together.It determines how easily search engines and users can navigate your website. This includes your header and footer menus, as well as your URL structure and how you link to pages within your site. With a bad site structure, your pages may not rank well. And your users will never find them.This is bad for SEO. And bad for business.A good site structure enables users (and search engines) to easily navigate your website and reach every page in four clicks or fewer. To review your website’s current structure, pretend you’re a user looking for specific information on your website. Can you find what you need easily? Is anything confusing, in the wrong place, or hidden?If you notice any problems with your website structure, you should consider mapping out a new one.Keyword research is often key to determining the ideal website structure.But what’s most important is that your website’s structure is clear, easy, and logical.For our sushi restaurant in Chicago, we could stick with a simple structure. With the following items in the header menu: Menu page About page Online reservations page Contact page Blog where we could post articles or news about our business (optional) Gallery of images (optional)If we have multiple locations for our restaurant, we can include individual pages for each location, using URLs like the following: sushi-restaurant.com/lincoln-park/ sushi-restaurant.com/michigan-ave/ sushi-restaurant.com/wicker-park/Or if you're operating in a single location but have multiple aspects to your business, you may go with something like: sushi-restaurant.com/omakase/ sushi-restaurant.com/catering/ sushi-restaurant.com/take-out-bento/Map out the pages you need based on your keyword research and SERP analysis. And carefully consider how your customers engage with your business.Further reading: How to Build Your Website Architecture for SEO6. Add Schema MarkupSchema markup is specially formatted data you can add to your code to provide search engines with additional information about your page. Using schema markup can also help you appear in special results in the SERPs called rich results.In the example below, Google serves up rich results for Target.These rich results are not only helpful for users, but they provide Target with more SERP real estate, as they push the rest of the results down.This will likely result in more clicks for Target.There are schema types for: Local businesses Restaurants Dentists Florists Hospitals Hotels Nail salons Real estate agents And moreWhile schema is an advanced SEO concept, there are simple ways to implement it on your website using third-party tools and plugins. Further reading: What Is Schema Markup & How to Implement Structured Data7. Optimize On-Page ElementsOptimizing on-page elements, such as titles, meta descriptions, and headers, is one of the quickest ways to get SEO wins for small businesses. TitlesTitles, also referred to as title tags and meta titles, are website elements that denote the title of a page.They’re most commonly seen and used in search results. In the example below, “Hamachi Sushi Bar - Chicago” is the title. Titles can be optimized with keywords to influence ranking in the SERPs. And because they’re the first thing users notice in the search results, you should optimize them for clickability and compellingness.For Hamachi Sushi Bar, a better title for their homepage—one that leverages keywords and will entice users to click—might look like this:Ensure every page on your website has a unique, compelling title.Here are some more best practices for writing title tags: Titles should be 55 to 60 characters long Use your target keywords Describe your page content clearly and accurately Help people understand what they will find on the page Entice users to click Use your company name or brand wisely Keep it simpleFurther reading: What Is a Title Tag & How to Optimize Title Tags for GoogleMeta DescriptionsMeta descriptions are website elements that tell Google and your users what your pages are about. They’re a great opportunity to tell users a little bit about your pages and encourage them to click on your result.They can be found in the SERPs, just under the title. In the example below, it seems Kamehachi forgot to write a meta description, so Google pulled bits of text from the page in order to give users some information. This is a missed opportunity for Kamehachi. A better, more compelling meta description for Kamehachi’s homepage might look like this: Ensure every page on your site has a unique meta description that accurately reflects the contents of the page. And ideally, leverage keywords from your research.Here are some best practices for writing meta descriptions for your small business: Meta descriptions should be one or two sentences and 140 to 160 characters long Include one or two keywords Add a call to action if it’s relevant Meta descriptions should be meaningful and descriptive of your content Target an emotionFurther reading: What Is a Meta Description & How to Write OneHeadersHeaders are elements that denote the structure and hierarchy of content. That just means headers are the differently sized and/or styled text that indicates different sections of a piece of content.Header values used on websites are H1, H2, H3, H4, H5, and H6.H1s are typically the biggest and most important.They usually serve as the on-page title of the page. In the example below, taken from the Semrush blog, we can see two headers, an H2 and an H3:Headers like these make up the structure of a page or piece of content. And provide Google (and users) with more context on what your page is about. Google recommends using headers to structure your content.And the search engine appears to assign more weight to keywords used in headers. Leverage keywords in headers to better connect your page with the terms your target audience is searching for. Just make sure your headers still read naturally and provide a logical structure for your page.The following are some best practices for using headers: Use an H1 for the main heading (or on-page title) of every page Include keywords naturally Use H2s through H6s to break up your page content and provide a logical structure Write for your target users Use them to summarize the content contained in their sections Further reading: What Is an H1 Tag? Why It Matters & Best Practices for SEO8. Create Content to Connect With Your CustomersCreating content is a great way to bring more traffic to your website. It can help you reach potential customers and turn them into actual customers.The idea is for users to find your content in the SERPs, engage with it, and keep you in mind when they are ready to make a purchase or become a customer. But to create effective content for small business SEO, you need to understand your target audience and what they want to see.This is where your keyword research is beneficial.You can use keyword research to create pages that target important keywords for your business. For example, we used the Keyword Magic Tool to find keywords that included the word “sushi.”Using this cursory research, we can create several articles for our sushi restaurant that target keywords like “what is sushi,” “is sushi healthy,” and “is sushi gluten free.” Thousands of people search these questions every month. If you can rank for these terms, you can bring a lot of potential customers to your website. You’ll also be adding a way to educate and connect with your potential customers.Use your unique experience and expertise to create high-quality, informative content that provides value to your audience.Incorporate keywords and use headers to structure your content.Add visuals like images and videos to make your content more engaging.You can also promote your content by sharing it on social media and other channels to bring in even more traffic.Great content that connects with your target audience can bring traffic to your website and continue to do so long after it’s published. Further reading: Content Marketing for Small Business9. Find and Fix Basic SEO IssuesMany technical aspects of SEO could negatively affect your rankings and visibility in the SERPs.These include the following: Pages Google can’t find or crawl Broken links Slow site speed Sitemap errors Duplicate content Web security issues Schema implementation errors And moreThese issues are often difficult to diagnose and resolve for small businesses with limited time and resources.Fortunately, tools like Semrush’s Site Audit tool can do a lot of the work for you. Simply type in your domain and click “Start Audit” to begin setting up an audit for your website.The next page presents options you can use to fine-tune your audit. However, as a small business, you probably don’t have to worry about them for now. So click “Start Site Audit.”Once it’s ready, click on your project to see the results of your audit. The Site Audit dashboard provides a number of issues it found with your site.You can click on the errors, warnings, or notices to get more detailed information on them. As well as suggestions on how to fix them.Work your way through the issues and fix what you can. Even if you can’t fix everything at the moment, any improvements you make will only improve your SEO and search visibility.Further reading: How to Perform an SEO Audit10. Create Relevant Online Listings for Your BusinessOne of Google’s core ranking factors is backlinks. These are links on other websites that point to your website. They are important for Google because they serve as votes of confidence in your website.Basically, a link to your website tells Google your site is a good resource.The more backlinks you get, and the bigger and better the sites you get them from, the better it looks to Google.And Google will rank your site higher as a result. But getting websites to link to yours isn’t easy.It takes time and skill.Still, small businesses need backlinks to rank well in the SERPs. Luckily, a simple way to get links to your website is to submit your business to relevant directories.Not only will you build relevant links to your website from each directory profile, but you’ll also appear on directory pages that rank on Google. For example, the following are good places to start submitting your business listing: Google Business Profile (as outlined in tip No. 2 above) Facebook LinkedIn Bing Places for Business Yelp for Business Apple MapsThere are many other industry-specific business listings to seek out and consider. Links from these directories will help with your SEO efforts. And you may also get traffic directly from these directories.Just ensure that the business name, address, and phone number (we refer to these collectively as NAPs) you submit are accurate and consistent. (More on this later.)Further reading: Link Building for SEO11. Ask Your Suppliers and Business Associations to Link to Your WebsiteAnother proven link building strategy that nearly every small business can execute is to reach out to suppliers and business associations and ask them to link to you.If you sell or use another business’s products, reach out to them and ask whether they’d be willing to link to your site. They probably have a “where to buy” or “stockists” section on their own website.They may also have a testimonials section, where they’d most likely be willing to feature you in exchange for a testimonial. Alternatively, if you sell products that other companies use as part of their own offerings, you could ask them to link to your website in a section that describes where they source materials.They may also have a section that outlines their business partners. Get creative and try to think of more ways you can get links to your website on other websites related to your industry. Further reading: How to Get Backlinks12. Monitor Local ListingsThe accuracy and consistency of your important business information (NAP, or name, address, and phone number) is vital.If this information is inaccurate somewhere—say, on your website or on your Google Business Profile—potential customers won’t be able to reach you. And you’ll miss out on business.Users will feel the pain, too. They’ll have found a business they like, only to be unable to reach it.Google recognizes this and places great importance on the accuracy and consistency of your local listings—specifically your business name, address, and phone number.If your business has two different phone numbers or addresses listed out there on the internet somewhere, Google will probably rank you lower. After all, Google wants to serve up the best, most helpful results.But it doesn’t know which of these listings is the right one.Why would it serve up a result that may have inaccurate business information?So it’s essential to monitor your local listings (that is, everywhere online that your business is mentioned) and ensure that they’re all up to date and consistent. But as your number of listings grows, keeping track of them all can become increasingly complicated.Semrush’s Listing Management tool provides a convenient solution to this problem.Simply type in your business name and select it from the options.In the example below, we looked into the local listings of Sushi-san, a sushi restaurant in Chicago. Unfortunately, Sushi-san has a few issues to resolve, including 34 inaccurate or inconsistent listings. The Listing Management tool will not only show you exactly which listings are problematic and how, but it will also help you fix them. Further reading: Listing Management13. Encourage & Respond to Reviews Reviews affect your Google ranking and whether people will trust your business.The more reviews you have, the better it is for business. In fact, the number of reviews can be even more important than your rating.(Of course, you should try to keep your rating as high as possible, too.)In the example below, we searched for “sushi in chicago.” As you can see, Juno Sushi Chicago ranks above Sushi Suite 202, despite having an inferior rating. This may be because Juno Sushi Chicago has more reviews. At least partly.Encourage your clients and customers to leave ratings and reviews. And respond to the reviews—whether they’re positive or negative. People love to see businesses that are attentive and care about their customers.Google also appears to reward businesses that respond to reviews, as it indicates freshness and activity. Further reading: Online Reputation Management14. Track Your RankingsTracking your ranking and performance for important keywords is crucial for properly attributing your SEO efforts. After all, you want to know that your work is paying off, right? Google Analytics and Google Search Console can provide a lot of valuable data.But they can’t tell you how well you rank for specific keywords.This information can help you understand which of your optimization techniques are working. And which need further refinement.Semrush’s Position Tracking tool provides detailed information on how you rank for your keywords. Including local results. It also provides traffic estimates and historical data. So you can see how rankings have changed over time. Additionally, you can track your rankings in specific cities and even neighborhoods. This gives you unparalleled insights into your local rankings and how your customers are seeing your results on Google.To get started, open the Position Tracking tool and click “Create project.”In the pop-up window, enter your domain name, give your project a name, and click “Create project.”Then choose your location and language. And add your business name as its show in the local map pack.Click “Continue To Keywords.”Add the keywords you want to track to the “Keywords” field.Click “Add keywords to campaign.” Then click “Start Tracking.”In the Position Tracking dashboard, you’ll be able to view ranking data on specific keywords, ranking distributions, search visibility, and even “share of voice” related to your competitors. Monitor your ranking data over time. And make SEO tweaks to pages that aren’t performing as well as you think they should be. Further reading: How to Track Your Google RankingsLeverage SEO for Small Business to Drive Ongoing SuccessYou can do many of the tasks outlined above in a single day. And for free.And if you do everything on this list, you’ll probably see some great results.But like most worthwhile endeavors, you’ll only see long-term benefits from SEO if you keep at it. SEO is a process.You need to keep creating great content for your users.Keep optimizing your titles, meta descriptions, and headers.And keep tracking your traffic and rankings.With a bit of persistence, you can achieve long-term success with small business SEO.",
  "headers": [
    {
      "level": "H1",
      "text": "Small Business SEO: 14 SEO Tips for Small Businesses"
    },
    {
      "level": "H2",
      "text": "What Is Small Business SEO?"
    },
    {
      "level": "H3",
      "text": "Small Business SEO vs. Local SEO"
    },
    {
      "level": "H2",
      "text": "Benefits of SEO for Small Business"
    },
    {
      "level": "H3",
      "text": "Increased Awareness"
    },
    {
      "level": "H3",
      "text": "Increased Traffic"
    },
    {
      "level": "H3",
      "text": "Connect With Your Target Audience Early"
    },
    {
      "level": "H3",
      "text": "Competitive Advantage"
    },
    {
      "level": "H3",
      "text": "You’re Open 24/7"
    },
    {
      "level": "H3",
      "text": "It’s Free"
    },
    {
      "level": "H2",
      "text": "14 SEO Tips for Small Businesses"
    },
    {
      "level": "H3",
      "text": "1. Set Up Google Analytics and Google Search Console"
    },
    {
      "level": "H3",
      "text": "2. Set Up Your Google Business Profile"
    },
    {
      "level": "H3",
      "text": "3. Do Keyword Research"
    },
    {
      "level": "H3",
      "text": "4. Analyze SERP Competitors"
    },
    {
      "level": "H3",
      "text": "5. Review Your Site Structure"
    },
    {
      "level": "H3",
      "text": "6. Add Schema Markup"
    },
    {
      "level": "H3",
      "text": "7. Optimize On-Page Elements"
    },
    {
      "level": "H4",
      "text": "Titles"
    },
    {
      "level": "H4",
      "text": "Meta Descriptions"
    },
    {
      "level": "H4",
      "text": "Headers"
    },
    {
      "level": "H3",
      "text": "8. Create Content to Connect With Your Customers"
    },
    {
      "level": "H3",
      "text": "9. Find and Fix Basic SEO Issues"
    },
    {
      "level": "H3",
      "text": "10. Create Relevant Online Listings for Your Business"
    },
    {
      "level": "H3",
      "text": "11. Ask Your Suppliers and Business Associations to Link to Your Website"
    },
    {
      "level": "H3",
      "text": "12. Monitor Local Listings"
    },
    {
      "level": "H3",
      "text": "13. Encourage & Respond to Reviews"
    },
    {
      "level": "H3",
      "text": "14. Track Your Rankings"
    },
    {
      "level": "H2",
      "text": "Leverage SEO for Small Business to Drive Ongoing Success"
    }
  ],
  "author": ""
}