{
  "url": "https://www.semrush.com/blog/social-media-metrics/",
  "slug": "social-media-metrics",
  "title": "19 Social Media Metrics to Measure Performance",
  "description": "Wondering which social media metrics to track? Check out 19 essential metrics for brands and creators.",
  "content": "You need to evaluate the right social media metrics (data points that reveal performance insights) to understand how well your efforts are paying off.But it can be challenging to identify the exact metrics you should track.To make it easier, we’ve compiled a list of 19 social media metrics you can study to determine which ones should make your list.But first, let’s start with the basics.Why Is It Important to Measure Social Media Metrics? Social media metrics are quantitative and qualitative data points that can help you measure your performance on social channels. To reveal what’s working and what’s not. For instance, if you see that a particular type of post is getting a lot of engagement, you know your audience likes that content. And you can create more like it. For example, this post on our LinkedIn page suggests our audience is interested in events:More specifically, tracking metrics allows you to: Understand your audience: Some metrics let you see who your followers are and what content they engage with the most. This can help you tailor your content based on their preferences. Optimize your budget: If you’re spending money on ads as well as organic (unpaid) social posts, measuring results helps you see if you’re getting good returns on these tactics. And provides you with information you can use to adjust how you allocate funds. Identify trends: Tracking social media metrics makes it easier to spot trends and shifts in audience behavior. Which can help you stay ahead of your competition. Justify investment: Monitoring performance makes it easier to prove the value of your social media efforts to stakeholders Find ways to improve: Keeping tabs on your performance can give you ideas on what to do more of and what should be adjusted19 Social Media Marketing Metrics to TrackWe’ve divided these social media marketing metrics into categories. So you can focus on the ones that are most relevant to you.Social Media Awareness MetricsHere are a few key metrics to assess brand awareness on social media:Audience Growth RateAudience growth rate measures the percentage increase in your followers or subscribers over a specific time period. It helps you understand how effectively you’re attracting new audiences and makes it easy to compare one time range to another. Here’s the formula to calculate your audience growth rate:Audience growth rate = [(number of followers in current period – number of followers from previous period) / number of followers from previous period] x 100If you ended December with 5,000 followers and ended March with 8,000 followers, your profile saw 3,000 new followers. This means your profile experienced a 60% audience growth rate over that quarter. Tools like Social Tracker can help you benchmark your audience growth rate against your competitors’ rates. You can also assess the total number of followers/subscribers for multiple brands across different platforms. ImpressionsImpressions refer to the number of times a social media post is viewed. To give you a sense of your visibility on a platform. Here’s an example of one of our posts that received over 105,000 impressions:You can measure impressions for specific posts, for particular campaigns, or across your entire presence on a platform. To get a full view of your content’s performance.Video ViewsVideo views represent the number of times people have watched your videos, depending on each platform’s criteria for what a view is. And this metric shows how much visibility your video content is receiving.For example, this video on Semrush’s YouTube channel has garnered over 7 million views. Keep in mind that different social media platforms have different definitions of what counts as a video view. For instance, YouTube counts it as a view after 30 seconds. While Instagram and Facebook count it a view after three seconds.Brand MentionsBrand mentions are when people use your brand name (whether you’re tagged or not) in their content or comments. And they help you see how often people talk about you on social media—and what those users say about your brand.For example, an X (formerly Twitter) user posted about the ease of designing with Canva—without tagging the brand. Even so, Canva commented on this post. You can also analyze people’s perceptions of your brand through sentiment analysis. Which reveals how people feel about your brand—whether it’s positive, negative, or neutral. The Brand Monitoring tool offers a quick and easy way to track brand mentions and sentiment.You can filter brand mentions based on multiple factors like keywords, country, date range, and more. And filtering by source lets you look specifically for mentions across social platforms like Facebook, Instagram, Twitter, TikTok, and YouTube.The tool analyzes the sentiment for each brand mention. Which you can see at the bottom of the post.You can also set up alerts for your brand and competitors. To get notified whenever these brands are mentioned.Go to the “Analytics” tab to get a more holistic look at your mentions, sentiment, and more.Social Media Engagement MetricsConsider tracking these engagement metrics for social media: ReactionsReactions are basic engagements (like, love, laugh, etc.) that represent what users think about your content. And provide insight into which types of content resonate with people the most.For instance, having several posts with a high number of \"Funny\" reactions on LinkedIn suggests you might want to focus on lighthearted or entertaining posts. Like SEO-focused creator Liam Fallen does with posts like this:This strong engagement reflects that Fallen’s audience appreciates a playful approach.CommentsComments are responses from followers (and non-followers) on your posts. They can be positive, negative, or neutral. Comments reveal topics people feel strongly about. That’s because writing a comment takes more time and thought than leaving a reaction.Plus, you can consider feedback-driven comments as ways to improve your social media strategy. Or even your broader marketing efforts. Here's an example of an Instagram post from Editorial Candle that features praise and feedback:SharesShares (also called reposts on certain platforms) are when your audience distributes your content to their own network. It’s a good sign when people find your content valuable enough to share with others.Why?Because it indicates that they agree with your ideas, find your content inspirational, have an emotional response to it, etc. Here’s an example of a user sharing one of our LinkedIn posts:The more your content is shared (in ways that suggest positive sentiment), the more credibility it builds. Further helping you position your brand as a trusted authority in your industry.Average View DurationAverage view duration measures the average amount of time people spend watching your video content. And highlights how well your content keeps viewers engaged. Here’s the formula for measuring average view duration:Average view duration = total watch time (in minutes) / total number of viewsLet’s say your total watch time is 100 minutes and the number of views is 50. That means your average view duration is 2 minutes.You can calculate this metric for your entire profile or a specific video. Average Engagement RateAverage engagement rate measures the level of interaction your social media content receives compared to the size of your following. It shows how well your content resonates with audiences.You can calculate your average engagement rate in a few different ways. The first is for your entire presence on a particular platform.Here’s the formula:Average engagement rate = [(total number of engagements / total number of posts) / total number of followers] x 100So, let’s say your account has 5,000 followers. You shared 20 posts in the last month and gained 3,000 engagements. With these numbers, your average engagement rate for the month would be 3%. You can also calculate engagement rate for a single post. Just divide the total number of engagements the post received by your total number of followers. Social Analytics makes it easy to see your average engagement rate across your profiles in a glance. So you can skip the manual calculations.NoteWhile engagement rate is calculated against your number of followers, remember that even non-followers can engage with your content.Amplification RateAmplification rate shows how often your posts are shared by your followers in relation to the number of followers you have. Which indicates their willingness to show an affinity for your brand. Here’s the formula to calculate the amplification rate for a social media profile:Amplification rate = [(total number of shares / total number of posts) / total number of followers] x 100You can also track the amplification rate for a specific post by dividing the number of shares by the total number of followers.So, let’s say you have 10,000 followers on a platform and one of your posts is shared 200 times. Using the formula, the amplification rate for this post would be 2%.Social Media Conversion MetricsLet’s look at some of the most crucial conversion-focused metrics for social media:Organic Social TrafficOrganic social traffic is the number of users who arrive at your website via unpaid social media. Which helps you understand how effectively your social media efforts translate to visits.To accurately track which platforms and campaigns are bringing traffic, use Urchin Tracking Module (UTM) codes. These snippets at the end of URLs make it clear where the visitors are from.You can add UTM links for your website to specific posts (or your profile’s bio). This process is easy with Social Poster—which lets you create and schedule posts on any social channel with an interactive calendar. When you schedule a new post, click on the “UTM” button and add the campaign name, medium, and source (platform name). This automatically adds a UTM link to the post to help you track organic social traffic.Conversions A conversion occurs when a user takes one of your desired actions. And your total number of conversions tells you how effectively your social content inspires action. The conversions you track will vary depending on what you’re aiming to achieve with your campaigns. For example, someone could make a purchase on your website, download your app, or subscribe to your newsletter. You can measure conversions through tools like Google Analytics 4 (GA4) by setting up key events. Check out our complete guide on setting up conversion events on GA4. Click-Through RateClick-through rate (CTR) measures the percentage of clicks on a call to action (CTA) within your social posts out of all the times your posts were viewed. A CTA can be used for both organic and paid social media posts and could be a link to your website, your in-app store, etc.This metric helps you understand how effectively you’re capturing your audience’s interest in your content and products.Here’s the formula for an individual post’s (or ad’s) CTR:Click-through rate = (total number of clicks / total number of impressions) x 100So, suppose you add a link to one of your products in a Facebook post. It’s seen 500 times but only gets 25 clicks. Your CTR would be 5%This post from LuxenHome includes tags for two products and an additional CTA to visit the shop.Conversion RateConversion rate is the percentage of people who took a desired action after clicking on a link within your social media posts or ads. It shows how well your social media marketing efforts translate into meaningful actions, such as app downloads, newsletter sign-ups, or purchases. Here’s the formula to calculate your conversion rate:Conversion rate = (total number of conversions / total number of clicks) x 100You can track this metric for your organic social media posts by setting up conversion tracking in GA4. The tool shares channel-wise conversion rates (called “session key event rate”). Where “Organic Social” indicates the conversion rate from users who come from social media platforms. Customer Satisfaction MetricsHere are some key metrics you can use to gauge how happy your customers are with your brand:NoteThese metrics are specific to customers—not your broader audience across social media. Net Promoter ScoreNet promoter score (NPS) measures loyalty through questions about customers’ willingness to recommend your brand to others. And you can share an NPS survey on social media (by directly messaging your customers or sharing a link to a survey) that asks actual customers to fill it out.Customers are categorized into three groups based on their responses: Detractors (0–6 score range): Unhappy customers who are likely to switch to a competitor and wouldn’t recommend your brand to their friends Passives (7–8 score range): Neutral customers who don’t feel a strong sense of loyalty toward your brand but wouldn’t necessarily switch to a competing brand Promoters (9–10 score range): Satisfied customers who strongly advocate for your brand and recommend youHere’s the formula to calculate NPS:Net promoter score = (% of promoters – % of detractors)If 50% of your customers are promoters and 20% are detractors, your NPS would be 30. And it reveals that you have more satisfied customers likely to recommend your brand than unsatisfied ones.But if only 30% of your customers are promoters and 40% are detractors, your NPS would be -10. This negative score indicates customers are largely unhappy with your brand.If your NPS is negative, you need to take action. Start by analyzing feedback from detractors to pinpoint common issues—whether it's product quality, service delays, or poor customer support.Next, work on implementing changes that directly address these concerns. Like investing in better training for your support team or considering using chatbots for quicker replies if customers are unhappy with slow responses.Customer Satisfaction ScoreCustomer satisfaction score (CSAT) measures how happy customers are with your brand overall. You can track CSAT among your social media followers by sending them a direct survey link through messages or sharing a link to a survey. Here’s the formula to calculate CSAT:CSAT = (total number of satisfied responses / total number of responses) x 100If 80 out of 100 customer respondents indicate they’re satisfied, your CSAT score would be 80%. Meaning the majority of your customers are happy with your brand.Paid Social Media MetricsLet’s go over some of the most important metrics that are specific to your paid social campaigns: Cost Per ClickCost per click (CPC) is how much you pay for each click on your pay-per-click (PPC) ads. It’s most commonly used for lead generation campaigns and can help you determine whether your budget could be used more efficiently for social ads like this one:When creating an ad campaign, you can set a maximum cost per click based on your budget.Here’s how to calculate CPC:Cost per click = total cost of clicks / total number of clicks So, let’s say you run a Facebook ad campaign with a total spend of $500 and it receives 1,000 clicks. Using the formula, your actual CPC would be $0.50.Cost Per Thousand ImpressionsCost per thousand impressions (CPM) is how much you pay for every thousand impressions your ad receives. This means the CPM model works well for awareness campaigns. Here’s how to calculate the average cost per thousand impressions:Cost per thousand Impressions = (total cost of campaign / total impressions) x 1,000Suppose you run a LinkedIn ad campaign that costs $800 and generates 200,000 impressions. Using the formula, your CPM would be $4.This LinkedIn ad is a good example of the type of promotion that companies use the CPM model for:Return On Ad SpendReturn on ad spend (ROAS) calculates the revenue earned relative to the money spent on an ad campaign. To understand the financial effectiveness of your ad campaigns. Over time, this helps you identify which campaigns are the most profitable. So you can invest more in similar ads. Here’s the formula for calculating ROAS:Return on ad spend = revenue from an ad campaign / cost of running the ad campaignFor example, if you earned $2,000 in revenue from an ad campaign that cost $1,000, your ROAS is 2. This means you earned $2 in revenue for every dollar spent on the campaign, indicating a profitable campaign.Achieve Social Media SuccessMonitoring social media metrics might sound overwhelming. But Semrush Social offers a complete toolkit to manage and track social media performance. You can continuously monitor how you perform relative to your competitors using Social Tracker. And stay on top of your own metrics with Social Analytics.Get started with Semrush Social today.",
  "headers": [
    {
      "level": "H1",
      "text": "19 Social Media Metrics to Measure Performance"
    },
    {
      "level": "H2",
      "text": "Why Is It Important to Measure Social Media Metrics?"
    },
    {
      "level": "H2",
      "text": "19 Social Media Marketing Metrics to Track"
    },
    {
      "level": "H3",
      "text": "Social Media Awareness Metrics"
    },
    {
      "level": "H4",
      "text": "Audience Growth Rate"
    },
    {
      "level": "H4",
      "text": "Impressions"
    },
    {
      "level": "H4",
      "text": "Video Views"
    },
    {
      "level": "H4",
      "text": "Brand Mentions"
    },
    {
      "level": "H3",
      "text": "Social Media Engagement Metrics"
    },
    {
      "level": "H4",
      "text": "Reactions"
    },
    {
      "level": "H4",
      "text": "Comments"
    },
    {
      "level": "H4",
      "text": "Shares"
    },
    {
      "level": "H4",
      "text": "Average View Duration"
    },
    {
      "level": "H4",
      "text": "Average Engagement Rate"
    },
    {
      "level": "H4",
      "text": "Amplification Rate"
    },
    {
      "level": "H3",
      "text": "Social Media Conversion Metrics"
    },
    {
      "level": "H4",
      "text": "Organic Social Traffic"
    },
    {
      "level": "H4",
      "text": "Conversions"
    },
    {
      "level": "H4",
      "text": "Click-Through Rate"
    },
    {
      "level": "H4",
      "text": "Conversion Rate"
    },
    {
      "level": "H3",
      "text": "Customer Satisfaction Metrics"
    },
    {
      "level": "H4",
      "text": "Net Promoter Score"
    },
    {
      "level": "H4",
      "text": "Customer Satisfaction Score"
    },
    {
      "level": "H3",
      "text": "Paid Social Media Metrics"
    },
    {
      "level": "H4",
      "text": "Cost Per Click"
    },
    {
      "level": "H4",
      "text": "Cost Per Thousand Impressions"
    },
    {
      "level": "H4",
      "text": "Return On Ad Spend"
    },
    {
      "level": "H2",
      "text": "Achieve Social Media Success"
    }
  ],
  "author": ""
}