{
  "url": "https://www.semrush.com/blog/state-of-search/",
  "slug": "state-of-search",
  "title": "State of Search: Discover How the Web Changed in 2021",
  "description": "The State of Search 2021 report analyzes some of the world’s leading markets and contains everything you need to plan your post-pandemic growth strategy. Read all about our findings on recent Google updates, user behaviors, and more.",
  "content": "If you’re wondering how the events of the past couple of years have affected the digital ecosystem, you’re not alone…As marketers, we’ve had to be agile and adapt to a huge amount of change since early 2020 and, let’s face it, it’s been a lot to take in for us all. Will the world of Search ever be the same again? How suitable will pre-pandemic tactics be in today’s climate? What is the new state of Search for the world’s most active markets?Thanks to our wide range of tools and reports, we’ve been in a unique position to be able to investigate, analyze and document the market-specific data that will help you find the answers to those questions. We used those tools and reports to unearth how the web changed in 2021 versus 2020, and pulled together a 360-degree analysis of Google updates, user behaviors, and SEO actions based on our data.The State of Search 2022 analyzes some of the world’s leading markets and contains everything you need to plan your post-pandemic growth strategy. Download the full report to take a deep dive into the data—or check out some of our headline findings right here:State of the Web There were significantly fewer newly ranking URLs in the top 100 results versus 2020 The average drop in the number of newly ranking URLs per market was 7.4% Traffic share by device saw an increase for desktop in 2020, which continued into summer 2021 even after many physical establishments had begun to open up againState of Search Informational keywords made up 60% of unique search terms Over half of all searches in 2021 were 1-2 words, while almost three quarters of ads shown by Google were 3-5 wordsState of Ranking Volatility across all niches was higher on average in 2021 than it was in 2020 Despite this, the average maximum volatility score actually decreased year-on-yearSERP Features Search Ads at the top of the SERP were down in 2021 versus 2020 on both desktop and mobile Featured Snippets appeared less frequently year-on-year on both types of device Average display levels of the Knowledge Panel feature increased on desktop, but decreased on mobile FAQ markup was far more common on both desktop and mobile in 2021 than in 2020 Google was still ignoring title tags and rewriting the SERP title 62.1% of the timeState of eCommerce Organic traffic going to eCommerce sites decreased by 23.2% year-on-year Amazon lost 37.5% of its organic traffic versus 2020, and appeared far less frequently in the Search Ads space across devicesState of Local The overwhelming majority of local listings shown to users were within two miles of the searcher’s location; only 6% of listings were more than 10 miles awayState of Technical SEO Larger sites were more likely to suffer from hreflang issues than smaller ones:Size of Domains (# of Pages) with Hreflang Issues Usage of different forms of structured data varied across our data set, with larger sites more likely to have implemented itDifferent Forms of Structured Data Usage by Domain Size (# of Pages) The most common markups across our selected sites were for sitelinks search box and articlesMost Popular Structured Data Items for All WebsitesPart of our analysis focused on the abilities of sites to pass the Core Web Vitals (CWVs) tests. The results indicated a great deal of room for improvement as some of the biggest domains in the world look to start growing again after the pandemic:Share of URLs with \"Good\" CWV Scores per Metric As of October 2021, only 32% of URLs passed CWV-related tests with scores for LCP, FID, and CLS on mobilePercentages of URLs with \"Good\" CWV Scores It was 52% more likely that a URL would pass CWV tests when using field data instead of lab data on mobileLooking at the data per metric, we saw that: 54% more URLs passed LCP tests when using lab data 9% more URLs passed CLS tests when using lab data 76% fewer URLs passed when TBT was the metric, not FID Download the Full Report to Discover More about the State of SearchHow does your site compare to the wider web in 2022? Do these facts and figures fall in line with what you’ve experienced? Are you changing your strategy in 2022 and targeting growth or even a return to stability after the pandemic? Whatever your plans, they will be bolstered by a fuller understanding of the state of Search today. Read the full report now to equip yourself with both global and industry-specific data to help you on your path. You never know, you might spot a new market opportunity in the process…",
  "headers": [
    {
      "level": "H1",
      "text": "State of Search: Discover How the Web Changed in 2021"
    },
    {
      "level": "H3",
      "text": "State of the Web"
    },
    {
      "level": "H3",
      "text": "State of Search"
    },
    {
      "level": "H3",
      "text": "State of Ranking"
    },
    {
      "level": "H3",
      "text": "SERP Features"
    },
    {
      "level": "H3",
      "text": "State of eCommerce"
    },
    {
      "level": "H3",
      "text": "State of Local"
    },
    {
      "level": "H3",
      "text": "State of Technical SEO"
    },
    {
      "level": "H3",
      "text": "Download the Full Report to Discover More about the State of Search"
    },
    {
      "level": "H6",
      "text": "Most popular pages"
    },
    {
      "level": "H6",
      "text": "SEO Checklist: 41 Tips to Optimize Your Website"
    },
    {
      "level": "H6",
      "text": "How to Perform a Complete SEO Audit (in 14 Steps)"
    },
    {
      "level": "H6",
      "text": "A Beginner’s Guide to Keyword Search Volume"
    }
  ],
  "author": ""
}