{
  "url": "https://www.semrush.com/blog/surround-sound-seo/",
  "slug": "surround-sound-seo",
  "title": "How to Use Surround Sound SEO",
  "description": "Want to be everywhere your customers are searching online WITHOUT buying ads? Discover how with Surround Sound SEO.",
  "content": "You’re probably familiar with “Surround Sound” audio, which refers to the effect generated by multiple speakers configured to create an immersive sound experience, making you feel like you are inside the action. That’s a large part of what makes watching a movie in a theater special!Part SEO, part PR, you can use Surround Sound marketing to envelop your potential customers in information about your brand all along the path of the decision-making process, making your brand the obvious choice when they’re ready to buy. What Is Surround Sound SEO?The term Surround Sound Marketing, coined by HubSpot, refers to a strategy that prioritizes being found in as many of the top-ranking pages as possible versus simply getting your own domain to rank at the top of the results. In other words, the goal is to make sure your brand is visible every time someone searches for a relevant keyword, and for potential customers to see your business mentioned in as many of those top-ranking pages as possible—even if those pages are not on your own domain.So, Surround Sound Marketing Involves: Figuring out where your customers go online while making a decision to purchase. Finding a way to appear on as many of those destinations as possible.Why Use a Surround Sound SEO Marketing Strategy?Surround Sound marketing enables you to be everywhere your customers are searching online, even if you can't compete for the top-ranking spot in the SERPs (search engine results page). Get Found in SERPsTraditional SEO prioritizes getting our own content to rank. With over 4 million blog posts published daily, gaining a top spot in the search results for important keywords can be tough. Sometimes it’s near impossible. The great news is that you don’t need to own those top spots in order to succeed, you just need to be included in the existing top pages!Take a look at the top organic results for “best meal delivery services.” Not one of the top results is owned by a meal delivery service company. The competition is just too great. Instead, we see results from large publications such as NBC, CNET, and Good Housekeeping. You will not outrank them.What you may be able to do though, is to convince these publications to include a mention and a link to your website on those pages of theirs that do rank for the applicable keywords. Now you’re starting to achieve SERP coverage without your website ever directly appearing in those top results.Surround Sound SEO helps you identify potential gaps in search coverage and pursue new growth opportunities.Buyers Are Doing Their Research - Be Where They AreStudies show that people visit an average of three websites before making a purchase. And the more websites they visit before making a purchase, the more they are likely to spend.Think back to the last few purchases you made. Did you do one Google search and choose the first result you saw? Did you go directly to a brand site and buy? Or did you ask friends and acquaintances for recommendations, search for reviews and review articles, check Amazon for top-reviewed products, and check social media posts and comments for the brand and product you were considering?If one brand shows up in all of those steps (in effect being endorsed by 3rd-party sites) how much more likely are you to choose it over a brand that only appeared once along the way? This is your goal—be everywhere they’re looking.Be Seen RepeatedlyOne of the oldest teachings in modern marketing tells us that people need to be exposed to your brand messaging an average of seven times before they make a purchase. And while the actual number of interactions or brand messages required varies, Surround Sound SEO greatly increases the number of opportunities buyers have to see and engage with content about your brand. Get Trusted Sources To Talk About YouConsumer trust in brands is waning. A 2021 study found that only 34% of 1,000 consumers polled said they trust the brands they use, while 81% said that trust is a deciding factor in purchase decisions. What consumers DO trust is unbiased 3rd-party information. This is what you’ll be building when you use Surround Sound SEO.Ad Costs Continue To IncreaseIn July of 2021, Business Insider reported that Facebook and Instagram CPM (cost per thousand impressions) rose 89% year over year. YouTube CPMs also reportedly increased an incredible 108%. As targeting options and audience size decrease with new regulations and increased competition, this trend is likely to continue. Ads also present a trust challenge. Only 19 and 38 percent of people surveyed say they trust social media and search engine advertising. Surround Sound Marketing WorksHubSpot coined the phrase “Surround Sound Marketing” and implemented it for their own brand. Over a period of seven months, they gained an increase of over 40% in their SERPs coverage for the keywords they targeted.What would that kind of increase mean for your business?Building on Rented Land?What about the argument that you “shouldn’t build your house on rented land”? That’s all well and good if you have buyers showing up at your house in droves. Otherwise, it pays to meet them where they are! Maintaining your own “house” is still important, but with Surround Sound SEO you’ll also make sure that people can find you wherever they’re looking.Who Should Use a Surround Sound SEO Marketing Strategy?Many businesses benefit from more coverage in keyword search results, but the Surround Sound strategy becomes practically mandatory if: Your business is new Resources for content and content distribution are limited Your industry is competitive This strategy works for local businesses, and brick-and-mortar businesses (small and large). Early results show that it works well for D2C (Direct to Consumer) and SAAS (Software as a Service) companies, too.How to Create a Surround Sound SEO StrategyThere are several important steps to creating a Surround Sound marketing strategy but the good news is, you likely have much of the work done already. Let’s get into it! 1. Map Out Your Personalized Buyer JourneyUnderstanding your customers’ unique buyer’s journey is key to showing up just when they need you. This buyer’s journey can typically be broken down into three stages, and you want people to be able to find you at every stage. That said, Surround Sound SEO is especially useful in the consideration and decision stages.Awareness: The stage where a prospect is determining that they have a need or a problem that’s related to what you sell. At this time, they’re not looking for solutions, just figuring out the extent of their problem. Be a reliable source for information, creating valuable content that focuses on the problem. If you can easily acquire mentions on popular pages for these keywords, by all means do so. However, these keywords tend to be a bit removed from the decision stage. Search example: “how to eat healthy with no time to cook.”Consideration: The stage where your buyer is committed to researching all the available solutions to solve their problem. You want to be found in as many of these information sources as possible. Get mentioned in content about the solution. Search example: “Meal delivery services.”Decision: The end point of the journey when a prospect has narrowed down the list of solutions, and they are looking for confirmation that they’re making the right choice. Make sure you are mentioned in content that answers your customers’ questions about your product or service. Search example: “Best meal delivery services.”2. Determine Where Your Customers Are Searching for SolutionsWhen it comes to figuring out where you need to appear, there is no substitute for asking your existing customers where they heard about you. If they don’t remember, you can ask something like, “Where do you go or who do you listen to when you’re researching or deciding on a solution for xxxx?” You’ll likely hear about podcasts, social media platforms, blogs, and other publications that they trust. A simple survey tool such as Typeform makes it easy to collect and analyze this information.You’ll want to appear in all those places from their first search through to the recommendation or review that finalizes their decision.3. Find the Keywords You Should TargetIdentify the keywords your potential customers use when making a decision to purchase. There are three types of keywords to consider: Variations on your product or service - “Meal planning,” “meal prep services,” “meal delivery service,” might be some examples. These are the kinds of words you would use to ask your friends, search on Amazon, or when looking for products on Google Review and list keywords -“Best meal delivery service,” “best meal prep options 2022,” “highest-rated meal delivery,” for example. You could also tie in some of your unique features or value propositions, such as “best meal delivery service for vegans,” “most affordable meal prep service,” or “best kid-friendly meal delivery service” Alternatives to something they may have considered or used already—“best Green Chef alternatives”You can use the Semrush Keyword Magic tool to find related terms and variations with high search volume. This tool also allows you to filter by intent (here we see keywords with a commercial intent). Create a spreadsheet or an Airtable and list your keywords, monthly search volume, and difficulty score. (Here’s a simple Google Sheet template you can use.)“Best Meal delivery service” has a keyword difficulty score of 85, which means that without a substantial effort in content promotion, SEO, and link building, you have very little (to no) chance of ranking for this keyword. HOWEVER, you’re not trying to rank your own site. You’re trying to get the existing top-ranking sites to mention you. With Surround Sound marketing, you CAN target that keyword.Prioritize Target KeywordsNot all keywords are created equal! Appearing in 40 results for a keyword with 100 monthly searches is not nearly as useful as appearing in 10 searches for a keyword with tens of thousands of monthly searches!To account for this, subtract your visibility score from one and multiply it by the monthly searches (“volume”) for each keyword. This spreadsheet will do that for you. This represents your additional SERP coverage potential opportunity for that keyword. Examples:If you appear in 15 of the top 20 search results for “best meal delivery service,” which keyword has an average of 33,000 monthly impressions, you’ll divide 15 by 20 and then multiply by 33,000. That gives you an opportunity score of 24,750. Compare that to “best meal kit delivery service” where you appear in 10 of the top 20 results and the average search volume is 4 thousand monthly. That looks like (1-.5)*4,000 for an opportunity score of 2,000. Sort your results by opportunity and start with the highest numbers.4. Identify the Specific Pages Where You’d Like to Be MentionedHere you’ll be identifying pages that link to your competitors and NOT to you. Determine How Well You Rank for Those Important Keywords TodayTo check your rankings manually, do an incognito Google search for each keyword. Open the top 20 pages and search for mentions of your brand and links to your domain. In your spreadsheet, enter the number of mentions you find, whether the page includes a link to your site, and whether or not your competitors are mentioned. The spreadsheet will calculate your visibility score (% of mentions in the top 20 SERPs).This is a pretty tedious step, but vital to the process. It’s a great task for a virtual assistant. Keeping your keyword list pared down will also save you time.Surround Sound SEO is even easier with our new tool, aptly named Surround Sound! Try it now.What If Your Brand isn’t Mentioned in the Top 20 Results?We all start from zero, so if that’s what you’re seeing, don’t lose hope. This just means that your possibilities are endless! And starting from nothing means that every new SERP exposure can be tremendously impactful.Sentiment Matters—What If Some of the Mentions Are Negative?Maybe your competitor published something unflattering. Or perhaps a product review was posted before you refined it to its current state. There’s not much you can do about competitor content aside from outranking them in search results. Fortunately, you know how to do that now.For a fair negative review, whether in a blog post or on social media, see if you can start a conversation publicly or via email. Apologize for their less-than-ideal experience and offer to let them try (for free) your new and improved product. They may be willing to update their review if they have a better experience this time.5. Get Top-Ranking Publications to Mention YouAs you’re evaluating the pages where your competitors appear but you do not, you’re likely to spot some patterns. Many of the sites and pages are likely to be: Review sites List articles Shopping sites Social platforms Big publishersIf you want a busy marketer who is in charge of a blog, online store, review site, or social presence to consider your request, you’re going to need to provide value. Some ideas that may get their attention (and cooperation) include: Offering to send free products. You may even send more than one person would need—giving them the pleasure of sharing. This is often the most compelling offer. An offer to promote their content or engage in mutually-beneficial co marketing. Offering to write content for their site. When it’s well written, doesn’t need editing, and provides value to the reader, marketing teams love free content! Just make sure it’s better than the page they have that mentions your competition so it can outrank that page.Sending an email or social media message out of the blue might not be the best way to engage with the people in charge of these sites. You can warm up your targets on social, engaging with their content in an authentic way that adds value. When the time is right, send an email or direct message with your offer, but make sure it is obvious that you have researched them and you understand their goals and needs.Make your offer/ask, but also invite them to get on a 15-minute call so you can find out exactly what they’d like to get from you. You may have to send more than one email or message to get their attention. Get creative and try to avoid “I’m bumping this to the top of your email,” subject lines, as they may have an effect opposite to that desired. HubSpot has some great resources for writing effective outreach emails.Keep track of the emails you send to each company in a CRM or your handy Airtable or spreadsheet. And of course, keep track of partnerships scored and make sure to follow up regularly to keep it active.How to Track Your Surround Sound SEO ResultsAfter a few weeks or when you have a new link, return to step four above and repeat! You’ll be looking for an increase in your Coverage score, indicating that you appear in more of the top-ranking pages for your keywords.Simplify Surround Sound SEO and Content Marketing with Surround Sound from SemrushNow in beta, our Surround Sound marketing tool helps you to: Analyze your current SERPs coverage Find pages where you SHOULD be ranking Compare your coverage with your competitors, and Track your progress. Set up your first campaign today.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Use Surround Sound SEO"
    },
    {
      "level": "H2",
      "text": "What Is Surround Sound SEO?"
    },
    {
      "level": "H2",
      "text": "Why Use a Surround Sound SEO Marketing Strategy?"
    },
    {
      "level": "H3",
      "text": "Get Found in SERPs"
    },
    {
      "level": "H3",
      "text": "Buyers Are Doing Their Research - Be Where They Are"
    },
    {
      "level": "H3",
      "text": "Be Seen Repeatedly"
    },
    {
      "level": "H3",
      "text": "Get Trusted Sources To Talk About You"
    },
    {
      "level": "H3",
      "text": "Ad Costs Continue To Increase"
    },
    {
      "level": "H3",
      "text": "Surround Sound Marketing Works"
    },
    {
      "level": "H2",
      "text": "Building on Rented Land?"
    },
    {
      "level": "H2",
      "text": "Who Should Use a Surround Sound SEO Marketing Strategy?"
    },
    {
      "level": "H2",
      "text": "How to Create a Surround Sound SEO Strategy"
    },
    {
      "level": "H3",
      "text": "1. Map Out Your Personalized Buyer Journey"
    },
    {
      "level": "H3",
      "text": "2. Determine Where Your Customers Are Searching for Solutions"
    },
    {
      "level": "H3",
      "text": "3. Find the Keywords You Should Target"
    },
    {
      "level": "H4",
      "text": "Prioritize Target Keywords"
    },
    {
      "level": "H3",
      "text": "4. Identify the Specific Pages Where You’d Like to Be Mentioned"
    },
    {
      "level": "H3",
      "text": "Determine How Well You Rank for Those Important Keywords Today"
    },
    {
      "level": "H3",
      "text": "What If Your Brand isn’t Mentioned in the Top 20 Results?"
    },
    {
      "level": "H3",
      "text": "Sentiment Matters—What If Some of the Mentions Are Negative?"
    },
    {
      "level": "H3",
      "text": "5. Get Top-Ranking Publications to Mention You"
    },
    {
      "level": "H2",
      "text": "How to Track Your Surround Sound SEO Results"
    },
    {
      "level": "H2",
      "text": "Simplify Surround Sound SEO and Content Marketing with Surround Sound from Semrush"
    }
  ],
  "author": ""
}