{
  "url": "https://www.semrush.com/blog/swot-analysis-examples/",
  "slug": "swot-analysis-examples",
  "title": "SWOT Analysis: What It Is & How to Do It [Examples + Template]",
  "description": "Learn how to boost your business with a SWOT (strengths, weaknesses, opportunities, threats) analysis.",
  "content": "What Is a SWOT Analysis? A SWOT analysis is a framework that evaluates a business’ strengths, weaknesses, opportunities, and threats. The acronym \"SWOT\" stands for these four factors. Performing a SWOT analysis can help you make better business decisions.The analysis typically involves creating a matrix with the four categories: What’s working for your business (strengths) What’s not working (weaknesses) The external factors your business could capitalize on (opportunities) The external factors that could harm your business (threats)In this post, you’ll learn how to do a SWOT analysis. We’ll include examples and also give you a free SWOT analysis template.Let’s get to it.Why Is a SWOT Analysis Important? A SWOT analysis is a valuable framework that can help you evaluate your business from different angles. And discover new ways to grow and improve.By doing a SWOT analysis, you can: Use your strengths to stand out from your competitors Address your weaknesses before they hurt you Find and seize new opportunities Prepare for and avoid potential threatsWhich means:A SWOT analysis can help you make smarter decisions, plan better, and reach your goals faster.Tip: Use Market Explorer to benchmark yourself against your competitors by comparing traffic acquisition, market share, and audience data.What Are the Components of a SWOT Analysis?A SWOT analysis evaluates a business or project based on four key factors that can be divided into two categories: internal and external. Here’s how you might think about filling out a SWOT chart based on these two categories:Let’s take a look at each component.Internal FactorsInternal factors are the aspects of your business within your control. They include resources, capabilities, skills, assets, and competitive advantages. And they can be divided further into two categories: strengths and weaknesses.StrengthsStrengths are the positive attributes that give you an advantage over competitors. They’re the things that you do well, you’re proud of, and help you stand out.Some examples of strengths are: A loyal customer base A strong brand reputation A unique product or service A skilled and motivated team A high-quality websiteWeaknessesWeaknesses are your business’s negative attributes that limit your performance or hinder your growth. They’re the things you need to improve, fix, or avoid.Some examples of weaknesses are: A lack of financial resources A high turnover rate A weak online presence A low customer satisfaction rate A low-quality product or serviceExternal FactorsExternal factors are the aspects of your business that are outside of your control. These can include trends, events, economic changes, and the competitive landscape. And they can also be divided into two categories: opportunities and threats.OpportunitiesOpportunities are favorable situations or conditions you can leverage to achieve your business goals. In other words, things you can use to your advantage or benefit from.Some SWOT analysis opportunities examples are: A growing demand for your product or service A new market segment or niche A new technology that automates routine tasks A new partnership or collaborationThreatsThreats are unfavorable situations or conditions that can harm your business. They’re risks or challenges you need to recognize.Some examples of threats are: A declining demand for your product or service A new competitor or alternative A new technology that makes one of your services obsolete A negative publicity campaign A change in regulation or policyNow that you know about the different components, let’s take a look at exactly how to do a SWOT analysis. Free SWOT Analysis TemplateHere’s a SWOT analysis template you can use to follow along.Why put your results into a SWOT analysis template like this one? Because it’s easy to read and keeps things organized.How to Do a SWOT Analysis (6 Simple Steps)A SWOT analysis is an assessment of your business’s strengths, weaknesses, opportunities, and threats.But it’s more than that. It’s also a tool to strategically advance your business.And that means going beyond a simple list of facts.Here’s how to do a SWOT analysis the right way:1. Establish Your GoalHaving a goal will help you choose what’s most relevant for your analysis. Otherwise, you might end up with a ton of basic information and no idea of how to apply it to your business.So, set a goal.It could be any major decision or change for your business: Decide whether you should expand your business Assess the feasibility of new products or services Understand the risks and benefits of changing HR processesWhat if you can’t think of a goal?Here’s a handy formula:(Fill in the blanks.) My business needs __________. We might meet that need by doing these things: __________ __________ __________You can pick more than one goal from that list. Or just the most important one. It’s up to you.Let’s look at an example:My business needs more capital to continue operating. We might be able to meet that need by doing these things: Raising prices Investing more in our sales team Seeking new investorsLet’s say you choose the first item—raising prices. The goal of your SWOT analysis could be something like this: To find out whether raising prices will result in enough working capital for the business to continue operating.Again, this is just one example. Whatever your goal is, keep it top of mind while you complete your SWOT analysis.2. Assess StrengthsFor the next four steps, we’ll walk through how to do each part of the SWOT analysis itself.The “S” in SWOT stands for strengths. In this step, you’ll list your business’s strengths.Get started by asking some questions:What should you include? At this stage, every idea is a good one. So don’t leave anything out.We’ll cover how to narrow down your list in the last step.Remember: Strengths are internal factors. That means you have control over them. And you can build on them.Here are some examples of strengths you might list in a SWOT analysis: More organic web traffic than your competitors Cutting-edge features or products that your competitors don’t have Recent investments or a large amount of working capitalIf you need help thinking of strengths, use a competitive intelligence toolkit like Semrush .Trends. It’ll help you see how you stack up against your competitors in terms of traffic, audience demographics, market share, and much more. For example, you could use Traffic Analytics and see that organic traffic is way up compared to similar sites. Or that your bounce rate is way lower than others. Either way, it can reveal lots of things. Just enter up to five competitor domains and choose your market country or region. Then, compare the results to your own traffic data.3. Uncover WeaknessesYour business has weaknesses. And that’s OK—your goal is to make improvements.Start by writing down your weaknesses. Be honest with yourself. And be thorough.Here are some questions that can help:Listing your weaknesses can be a bummer. But there’s good news:Like strengths, weaknesses are internal factors. That means you have control over them and can use them to improve.Here are some examples of weaknesses you might include in a SWOT analysis: High operating expenses relative to revenue Long customer support response times SEO content creation efforts failing to increase organic reachJust as Semrush’s .Trends can help you find strengths, it can also help find weaknesses. Use these tools wisely as you conduct your competitive SEO analysis. 4. Consider OpportunitiesOpportunities are the “O” in SWOT. Here are some questions you can think through to uncover opportunities:It’s easy to confuse “opportunities” with “strengths.” To avoid that, keep this in mind:Strengths are internal factors. They exist inside your business. Opportunities are external factors. They happen outside of your business.You build on strengths. You use opportunities to your advantage. It’s a subtle but important distinction.Here are some examples of opportunities you might list in a SWOT analysis: Market shifts increasing demand for a product your business could sell Your ideal customers flocking to a new social media platform you can use to reach them A competitor ceasing operations in a region where you don’t currently operateTip: A great way to find opportunities is to use the Keyword Gap tool. It’ll help find keywords your competitors are ranking for, but you aren’t. Each of those keywords is an opportunity for you to bring in more traffic. 5. Identify ThreatsThreats are the “T” in SWOT. And they’re the opposite of opportunities.They’re external factors that could put your business at risk.Here are some questions that will help you identify threats:Threats evolve over time based on factors outside of your control. But you can plan for them.If you’re paying close attention to your industry, you probably know the major threats you face. Write them down in your template. Here are some examples of threats you might list in a SWOT analysis: An emerging competitor A legal change that could affect your business Economic conditions that negatively impact your customers’ buying powerYou can use Market Explorer in the .Trends toolkit to spot emerging competitors and trends.Enter your domain to find competitors in your market.Then scroll down to the growth quadrant to see which domains are rising in your industry. You can view competitors by behavior, traffic, and growth metrics. 6. Narrow Your ListsAt this point, you should have a decent number of items in each of your four SWOT categories. Now, you have to narrow them down.There’s no set maximum number of items for each category. But keep this in mind:You don’t want to overwhelm yourself.Stick to the most important items. Stay focused so you can make impactful changes. Struggling to narrow your lists? Try the impact effort matrix. It’s a tool to help you decide which actions could have the greatest impact with the least effort.And it looks like this:Here’s how to do it: Compile all of the items from your SWOT analysis Draw a four-quadrant diagram. On the vertical axis, you’re measuring the impact of an item on your business. On the horizontal axis, you’re measuring the effort required to implement or address that item. Place each strength, weakness, opportunity, and threat into its appropriate quadrant based on required effort and potential impact The items in the top left quadrant are likely to be your best options. Because they’ll have the most impact for the least effort.When Should You Do a SWOT Analysis?There’s rarely a wrong time to do a SWOT analysis.Bottom line: If you’re looking for clarity on a business move you’re considering, that’s a great time to do one.Here are some other perfect times to do a SWOT analysis: When your business is undergoing significant internal changes When external conditions are changing Before strategic planning On a regular basis3 Real-World SWOT ExamplesNow that we've covered how to perform a SWOT analysis, let's put those steps to the test with some examples.1. Marketing Agency SWOT Analysis ExampleImagine you’re running a marketing agency that does SEO, social media, and content marketing. You’re thinking about investing a lot of time and resources into your website’s blog. You know that great, search engine-optimized blog content could earn you more inbound leads over time. But you’re not sure whether it’s the right move.So, you do a SWOT analysis to help you decide. The goal is to answer this question:Should we invest more time and resources into our website content to increase our inbound leads?Start with your strengths. Here are the fictional marketing agency’s strengths: Your all-remote team saves money on office space and enables you to hire the best talent, regardless of their geographic location Many members of your existing team have content creation skills You consistently outperform your competition by getting better SEO results for your clientsAdd your weaknesses: Your team struggles to get deliverables to clients on time each month You have published very little on your blog in the past, so your current search engine rankings are minimal to nonexistent Your team has no codified processes for content creation, such as style guides or publishing standard operating procedures (SOPs)Next up is opportunities: Few of your local competitors have invested heavily in their own blog content People enter keywords related to your services into Google many times per month Recent market research suggests that your ideal clients are more likely to trust agencies with active blogsFinally, list the threats your agency faces: Search engines are becoming more selective about what they will display in search results, leaning more heavily on long-established blogs The economy is showing early signs of a downturn that could reduce investment in marketing, meaning your investment in content is less likely to yield ROI New agencies with strong content and SEO strategies are popping up in droves as more people leave their jobs to start their own businesses Strengths Weaknesses Remote team saves money and attracts talent Employees have content creation experience Clients get great SEO results Team struggles to deliver on time as it is Current search rankings are nonexistent No SOPs for content creation Opportunities Threats Local competitors haven’t invested in their own content Strong search demand related to your services Ideal clients more likely to trust agencies with active blogs Search engines are becoming more selective An economic downturn may be on the horizon New agencies with strong SEO strategies are entering the market That’s it. Of course, now you actually have to do something with this information.More specifically:You need to see how your website content is actually performing.You can use Google Search Console to measure that.Go to “Search results” and check the box for “Average position.”Scroll down to see your organic keyword rankings or positions:These tell you where the website currently stands in Google search results for particular keywords.In our fictional agency SWOT analysis example, your baseline organic keyword rankings would give you an idea of your starting point.And in Semrush’s Domain Overview tool, you can find organic competitors. This tells you about the competition you’d face if you invested more in your website content. Scroll down until you see your top organic keywords:There’s also a competitive positioning map. Which puts your website’s search engine performance in visual context with your competitors:2. Local Service Business SWOT Analysis ExampleNow, let’s look at an example SWOT analysis for a local service business. Our example will be about a criminal defense law firm. But many of the principles we’ll explore could apply to other local services businesses: HVAC contractors Plumbers Electricians Home remodelers Accountants Florists CaterersLet’s dive in:Your fictional criminal defense law firm operates primarily in the Manhattan area of New York City. You focus on white collar criminal defense but offer other types of criminal defense. You’re considering an expansion. You want to open a new office on Long Island, New York, and offer your services there.But you’re not sure whether the expansion will be profitable. To find out, you do a SWOT analysis:It’s always the same process. Begin with strengths: You get many Manhattan clients through referrals from past clients and word of mouth You have a highly successful track record with your clients You have room in the budget to hire new attorneys and open a second officeTime for your firm’s weaknesses: Your team is inexperienced with cases outside of white collar crimes Your attorneys are familiar with New York City courthouses and judges, but they’re not experienced with those on Long Island Your firm’s digital marketing and advertising efforts have been largely ineffectiveOn to opportunities: Few Long Island law firms offer white collar criminal defense (your area of specialty) Economic development and business expansion on Long Island may increase the local need for white collar criminal defense services Statewide law enforcement crackdowns may increase demand for criminal defense across the state of New YorkFinish it off with the threats your firm faces: Your competitors are also considering expanding to Long Island Real estate taxes are rising rapidly on Long Island with no signs of slowing down Competing law firms have hundreds of positive online reviews Strengths Weaknesses Clients come to you through referrals and your reputation You have demonstrated success You have the money to expand You’re not familiar with all types of criminal defense work Your attorneys don’t know the Long Island legal market well You’ve struggled to raise awareness of your firm through marketing and advertising Opportunities Threats Long Island may have unmet demand for your area of specialty More business activity in the area may increase demand for white collar criminal defense Increased law enforcement activity may increase the need for criminal defense services Competitors may also enter the Long Island market Real estate taxes are rising rapidly on Long Island Competitors have a much stronger digital presence than your firm With the SWOT analysis complete, it’s time to take action. To further explore your local market, you could use Market Explorer. This tool offers a Benchmarking report that shows side-by-side comparisons of main players in your local market. Go into the tool and click “Find Competitors.”Then, under “Location,” select your country or region. Enter your domain. And click “Research a market.”Like this:You get a detailed market summary:Here, you’ll find out: Who the key players in your market are How much business consolidation has occurred in your market How much total traffic is available in your market Total addressable market (TAM) and serviceable available market (SAM)You’ll also get a look at a Growth Quadrant for your market.The Growth Quadrant shows where your business’s website falls among your competitors. Are you a leader, established player, niche player, or game changer? And where are your competitors on that scale?The Growth Quadrant places your website and your competitors within one of those quadrants. That helps you identify your own positioning and where you could go. Going back to our law firm thinking about expanding: The Growth Quadrant could help them understand who the established players are on Long Island. And whether there’s room to break into the market.Further reading: Small Business SEO3. Ecommerce SWOT Analysis ExampleFor this next example, let’s imagine you run an ecommerce business. One of your competitors has just offered to buy your brand.You’re not sure whether you should sell your business or keep it. So, you do a SWOT analysis to get a clearer picture.You list your strengths: Your business is consistently profitable Your website is ranking well in Google search results for some extremely valuable keywords related to your products You have automated many of your internal processes to reduce labor expensesNext, you list your weaknesses: You have poor customer support operations, which has led to some negative online reviews Few of your products generate a very high profit margin, so you have to sell at high volumes consistently You rarely have repeat customers, meaning you have to spend more on marketing and advertising to acquire new customersOpportunities are up next: One of your key competitors recently decided to dissolve their business. That leaves a gap in the market. One of your products was recently featured in a popular TV show. That could drive up demand. You’ve started to receive queries about influencer partnerships and affiliate marketing opportunitiesLast but not least, threats: Your products are not environmentally friendly. Growing environmental awareness could lead to lower public opinion of your products. Much of your ability to sell your products rests with third parties like Amazon and Shopify. A single change in those third-party platforms could severely harm sales. Political unrest is making it difficult to ship your products to one of your key buyer markets Strengths Weaknesses Your business is profitable Your SEO efforts are driving sales You have automated processes to cut expenses Your customer support is lacking Slim profit margins mean you have to sell a lot You have high customer acquisition costs because you don’t retain many customers Opportunities Threats A key competitor left the market A TV appearance may drive demand for your product Affiliate and influencer marketing opportunities could drive more sales Environmental sentiment could reduce the popularity of your products Third-party selling platforms could change their rules and wreck your current sales processes Shipping is becoming unreliable in one of your key markets Remember: Your next step after actually writing the analysis is to do something.In this case, you need to make a decision. If you’ve done your SWOT analysis right, you should have the information you need to make that decision.Analyze Your Business & Achieve Your GoalsSetting and achieving goals is key to business success. And a SWOT analysis is key to evaluating goals and the ways you can achieve them.If you haven’t already, grab your free SWOT analysis template.Take your time. Be thoughtful. And your SWOT analysis will lead to results.",
  "headers": [
    {
      "level": "H1",
      "text": "SWOT Analysis: What It Is & How to Do It [Examples + Template]"
    },
    {
      "level": "H2",
      "text": "What Is a SWOT Analysis?"
    },
    {
      "level": "H2",
      "text": "Why Is a SWOT Analysis Important?"
    },
    {
      "level": "H2",
      "text": "What Are the Components of a SWOT Analysis?"
    },
    {
      "level": "H3",
      "text": "Internal Factors"
    },
    {
      "level": "H4",
      "text": "Strengths"
    },
    {
      "level": "H4",
      "text": "Weaknesses"
    },
    {
      "level": "H3",
      "text": "External Factors"
    },
    {
      "level": "H4",
      "text": "Opportunities"
    },
    {
      "level": "H4",
      "text": "Threats"
    },
    {
      "level": "H2",
      "text": "Free SWOT Analysis Template"
    },
    {
      "level": "H2",
      "text": "How to Do a SWOT Analysis (6 Simple Steps)"
    },
    {
      "level": "H3",
      "text": "1. Establish Your Goal"
    },
    {
      "level": "H3",
      "text": "2. Assess Strengths"
    },
    {
      "level": "H3",
      "text": "3. Uncover Weaknesses"
    },
    {
      "level": "H3",
      "text": "4. Consider Opportunities"
    },
    {
      "level": "H3",
      "text": "5. Identify Threats"
    },
    {
      "level": "H3",
      "text": "6. Narrow Your Lists"
    },
    {
      "level": "H2",
      "text": "When Should You Do a SWOT Analysis?"
    },
    {
      "level": "H2",
      "text": "3 Real-World SWOT Examples"
    },
    {
      "level": "H3",
      "text": "1. Marketing Agency SWOT Analysis Example"
    },
    {
      "level": "H3",
      "text": "2. Local Service Business SWOT Analysis Example"
    },
    {
      "level": "H3",
      "text": "3. Ecommerce SWOT Analysis Example"
    },
    {
      "level": "H2",
      "text": "Analyze Your Business & Achieve Your Goals"
    }
  ],
  "author": ""
}