{
  "url": "https://www.semrush.com/blog/the-art-of-crafting-successful-facebook-ads-semrushchat/",
  "slug": "the-art-of-crafting-successful-facebook-ads-semrushchat",
  "title": "The Art of Crafting Successful Facebook Ads #Semrushchat",
  "description": "#Semrushchat experts share their best tips on creating most effective Facebook ads.",
  "content": "Do you want to spice up your advertising game and make your ads more effective? During the most recent #SEMrushchat, we collected a list of actionable techniques for crafting successful Facebook ads and ensuring you spend your advertising budget wisely. Susan Wenograd, Facebook Ads and paid search maven, international speaker, trainer, and writer for Search Engine Journal and Marketing Land, joined us along with other chat participants to share 20+ tips for developing a winning Facebook ad campaign, as well as some predictions of the Facebook advertising future. Q1. What are some of your top tips in creating an effective Facebook ad? Use the AIDA Model AIDA, which stands for attention, interest, desire, and action, is one of the core principles of modern marketing and advertising. In order to make it work, you need to attract attention of your audience. Once you’ve captured their attention, you should keep it by providing something entertaining or memorable in your ad. Then your goal is to create desire; this step is sometimes called “decision”. Your message that you deliver in your ad should be highly relevant to your audience. You need to make an offer they can’t refuse. Finally, you should find a way to make people complete the desired action, whether it’s visiting your website, subscribing to your blog, or making a call. A1) AIDA rules still even with Facebook ads. Attention, Interest, Desire Action, use great graphics and ensure you track #semrushchat — Dawn Anderson (@dawnieando) November 1, 2017 Avoid Selling Facebook ads are not only about selling your product or service, but also for building long-term relationships with people. Instead of attacking your potential users with countless salesy messages, you can focus on increasing your brand awareness through your message. “Try and think how you'd go up and shake their hand in person. Offer value and be helpful first, conversational in your ad copy,” recommended Susan Wenograd‏ - @SusanEDub. A1. I can tell you where NOT to start first. So many advertisers try and sell right off the bat. FB is a cold audience. #semrushchat — Susan Wenograd (@SusanEDub) November 1, 2017 Offer Value Provide a value proposition that will tell people why they should click on your ad and learn more about your brand. Ask yourself: how is it different from many other brands that offer a similar product or service? You want to prove to your potential followers or clients that your ads deserve their attention. You can try something like \"10,000 happy marketers use our service to enhance their strategy!” Or, you can provide some kind of incentive in your ad by offering a discount or free trial. A1: Offer value. Have a strong CTA. Your landing page should have a great UX to complete the sale. FB doesn't work alone. #semrushchat — Dario Zadro (@DarioZadro) November 1, 2017 Employ CTAs That Make People Take Action Aside from making your ad relevant and nice-looking, you need to make sure that its call-to-action is clear, and tells viewers what they should do next. Be straightforward, and ask users to complete the desired action. The main goal of your CTA is to encourage people to perform a particular action right off the bat. Therefore, it may be worth including a sense of urgency in your CTA. A1: communicating value as clearly as possible, using a design that sticks out from Facebook's, include a strong CTA #semrushchat — Kevin_Indig (@Kevin_Indig) November 1, 2017 Grab User’s Attention with the Right Images Don’t underestimate the power of visuals in your Facebook ads. Every day, people are seeing large amounts of ads in their news feed, this means that you need to stand out from the crowd to get your paid content noticed. A1 Specifically, be thoughtful about the images. I see folks get lazy here. The Newsfeed is LOUD and it's FULL. #semrushchat — Susan Wenograd (@SusanEDub) November 1, 2017 Make sure to take into account all of the important elements of your Facebook ad images: size, shape, color, and message. Use images that are eye-catching and avoid visuals that have many small details and text that can distract a viewer’s attention. Also, make sure that your image is relevant to your product or service and communicates the core message of your ad. A1: Create eye-catching, quality images. I cringe when I see ads with bad images. Quality content is also important for ads. #semrushchat — Netvantage Marketing (@netvantage) November 1, 2017 Susan Wenograd also pointed out that when it comes to Facebook ads, it’s sometimes better to opt for something less polished, because it better resonates with a social media audience and looks more of a social post, rather than advertising. Q2. Which Facebook advertising techniques can be effective for companies with small budgets? Align Your Goals with Your Campaigns If you operate with limited budgets, you need to set the right objectives that you want to accomplish with your advertising campaign. Think of what type of actions you want your potential users to take to benefit your business and then align your goals with your ad campaigns. Be specific in your ads to tell viewers what to do next. For example, if you want to collect a customer base first, you probably need to get people to sign up for your email list, rather than simply visit your website. “Initially, you know what you're trying to achieve with the ads. A small budget can go a long way with specific goals,” tweeted Netvantage Marketing‏ - @netvantage. A2. Also, align your goals with the campaigns. Many ppl pick Conversion campaigns by default, but they're the most $$$ #semrushchat — Susan Wenograd (@SusanEDub) November 1, 2017 Be Specific About Who You Are Targeting In order to make sure that people who see your ads are eager to engage with it, you need to choose a relevant audience to target. You can get specific with users who will see your ads by narrowing down your audience by age, gender, location, and other characteristics and use targeting features that are built into Facebook Audience Manager and Facebook Power Editor. A2: Be hyper-focused on who you're targeting. Make sure that you're spending money to reach the people who will convert. #semrushchat — Flying Cork (@flyingcorkpgh) November 1, 2017 A2: Plan the demographic, geographic, and interests targeting in advance and tailor it to your business. #semrushchat — Digital Addicts (@digitaladdicts_) November 1, 2017 Target Users Who Already Like Your Page By using Audience Insights, you can find potential customers more effectively and narrow down the audience by their interests. It will help you target those users who already like your page and create more meaningful, directed ads. A2: For quick conversions, run ads against FB users who already like your page. These are the people most likely to purchase #semrushchat — Tim Levene (@timlev4) November 1, 2017 A2) Gain a more detailed understanding of your audience and narrow your campaigns to meet very specific criteria #semrushchat — Paul Gregory (@chimpfish) November 1, 2017 Use Split Testing Feature The split testing feature for Facebook ads is a powerful tool that can help advertisers to analyze which ads deliver the best results for their business. With this feature, you are able to test different elements of your ads and then optimize for your audiences, placements, and delivery settings to get the most out of your Facebook ad campaigns and maximize return on investment. A2. There is also the Split Testing feature, and that can help you test things really quickly to determine how to move forward. #semrushchat — Susan Wenograd (@SusanEDub) November 1, 2017 Boost Your Posts Some of our chat participants suggested boosting your posts on Facebook, if you are a business with a small advertising budget. Boosting a post is very easy to do, you just need to click the \"Boost Post\" button that appears in the lower right corner of your post. Once you do this, and the boost is approved by Facebook, more people will see this particular post in their news feed, which can help you get more users to like, share, and comment on your posts. A2: With small budgets, it's best to focus on \"boosts\" rather than full FB campaigns #semrushchat — Dario Zadro (@DarioZadro) November 1, 2017 The difference between Boosted Posts and Facebook Ads is that the former is the most basic advertising you can do on the social platform. If you’re looking for a more customized promotion, it’s worth using Facebook ads that provide much more targeting options. Ads also allow you to format your content in a number of different ways and add an optional CTA button. Q3. Video Ads: What are the best practices for creating a Facebook ads landing page promoting a video on Facebook? There’s so more to Facebook advertising than just the ads. In order to ensure the success of your Facebook ad campaign, you also need a strong accompanying landing page that performs the same functions as any other landing page, which is to drive visitor action. Here are some techniques to create landing pages that promote a video on Facebook: Make Sure Your Landing Page and Your Video Are Related Always avoid deceiving Facebook users with your ads. There should be no misleading content about your landing page and you should provide a clear offer and make sure that you communicate the same message across your landing page and in your video. It’s important that your landing page delivers exactly what it promises so that your users know exactly what to expect. For instance, if you're offering instant access to your video, don’t force users to leave their email address before they can watch this video; this is not a direct access. A3. Make sure the video and your landing page are related. The video should be a logical lead to the landing page. #semrushchat — Reva Minkoff (@revaminkoff) November 1, 2017 A3: Make sure that there's cohesion between the content of the video and the content of your LP. #semrushchat — Maria Marchewka (@_MariaMarchewka) November 1, 2017 Make an Impact in the First Seconds If used correctly, Facebook video ads can be a powerful user acquisition tool. However, people see too many posts in their Facebook news feeds, so they make quick decisions about whether or not your post is worth paying attention to. When using a Facebook video ad, try to grab viewers' attention in the first 2-3 seconds; videos that fail to do that are likely to result in poor engagement. A3 Video ads on Facebook is one of the best user acquisition tactics. Background music and first few seconds are imp #semrushchat @SusanEDub — Neha Udani (@UdaniNeha) November 1, 2017 Choose the Right Thumbnail In order to encourage users to click on your video to make it play, you need to trigger their curiosity. This is where a good thumbnail can help. Choose from options provided by Facebook as they offer several images that they select from the video. You also can upload your own customized image for the thumbnail to make it more intriguing. a3) Focus on the why people wouldn't like to miss the video, why is it worthwhile to them? Great thumbnail would help as well #semrushchat — Lucas Vos (@lucasvos) November 1, 2017 Use Subtitles According to Facebook, captioning a video increases average video view time by 12%. Because many users are scrolling through the Facebook feed with the sound off, your message can be lost if there are no subtitles. On the other hand, by adding captions to your Facebook video ad, you can significantly boost engagement. A3: First, use subtitles in the video. Maybe people watch videos in public on their phone. #semrushchat — Netvantage Marketing (@netvantage) November 1, 2017 Try Micro Conversions A micro conversion is a small step on the way towards your major conversion goal. Susan Wenograd‏ - @SusanEDub mentioned that videos tend to result in high engagement, but conversion is often lower than with other types of ads. She recommended to start with micro conversions; by tracking and analyzing these small actions, you can see how a user is progressing towards a more valuable stage, which is a macro conversion. Without this information, advertisers are thrashing about in the dark. There are many examples of micro conversions you can measure, such as viewing a product page, signing up for a newsletter, spending a certain amount of time on a website, or simply watching a video. A3. Ppl declare it a failure when sale doesn't happen. Try for a micro conversion on the LP first, like a sign up or download. #semrushchat — Susan Wenograd (@SusanEDub) November 1, 2017 Video ads can be great for sales. You just need to make sure that it clearly communicates your message to the viewers and is worth paying their attention to. Q4. Let’s say you have a CTR of +5%, but low conversions. What is the problem and how could you solve it? Social Media Examiner surveyed over 5,700 marketers and found that in 2017, 94% of them used Facebook for marketing, compared to 93% in the previous year. What’s more, 62% of marketers surveyed said that this social network is their most important marketing platform. Although many marketers use Facebook to amplify their marketing efforts, not all of them find positive conversion rate results from their Facebook ad campaigns. Susan Wenograd says that conversion rate depends on your audience. If you work with a cold audience, low conversion is an expected behavior. The same is true for the type of campaign you choose, for example, if you want to drive traffic to your website with Facebook ads, this means that conversions are not the primary goal of this campaign. A4. Likewise, depends on what type of capaiign. If it's Traffic campaign type, FB is finding people to click, not convert. #semrushchat — Susan Wenograd (@SusanEDub) November 1, 2017 Here are some other reasons why your Facebook ads have low conversions and how you can resolve this issue: Improve Your Landing Page If people are clicking on your ad, but not converting, this could mean that your creative and your landing page are not related. “If it's a warm audience, you likely have a disconnect between your creative and the landing page,” tweeted Susan Wenograd‏ - @SusanEDub. When users land on your landing page, they should see what they were promised. Otherwise, they will leave it without converting. A4: If CTR is good, but you have low conversions, you should tweak the landing page you're directing them to. #semrushchat — Express Writers (@ExpWriters) November 1, 2017 Q4: Could be an indication of misleading ad copy or a landing page that needs improvement. Either way, stay true to your brand. #semrushchat — Tim Levene (@timlev4) November 1, 2017 Make Your Message Clear The issue may also be related to vague advertising messages. Writing ambiguous ad copy is a common problem for people who are new to marketing or advertising, but when it comes to ads, you don’t have much space to explain your product or service in detail. You need to be concise, descriptive, straightforward, and fair. Don’t write that your business can solve your audience’s problems, instead, explain how it will do so. A4) The Landing Page might not be relevant enough or your Ad may have misleading messaging #semrushchat — Paul Gregory (@chimpfish) November 1, 2017 Provide a Strong CTA on Your Landing Page A good CTA button is one of the most important elements of any landing page. Look at your CTA and answer the following questions: Is it compelling enough? Does it have a contrasting color to attract users? Is it's placement effective? Is your CTA copy clear and self-explanatory? Whether or not people will want to perform a desired action largely depends on the quality of your CTA. A4: Is there a CTA on the landing page? Make sure your audiences knows what to do next. #semrushchat — Netvantage Marketing (@netvantage) November 1, 2017 Focus on Your Audience In order to make your ad and your landing page more effective, you need to invest time into figuring out who your target audience is, what they want and need, and what they can expect from your business. Find out who’s clicking and who isn’t to learn more about your viewers. Try to look at your landing page from your eyes. Is what you see helpful? Make sure that your ad and your landing page resonates with your audience. A4: Take a look at your target audience and see who clicking through and who isn't. Then, adjust your audience accordingly. #semrushchat — Digital Addicts (@digitaladdicts_) November 1, 2017 You can also use heatmaps to get more insights into your audience and see what people are doing on your page, how they're behaving, and where they bounce. #A4: users didn't find what the ad promised on the LP. I'd rework the ad and add heatmapping to see where users bounce #semrushchat — Kevin_Indig (@Kevin_Indig) November 1, 2017 As you can see, there are several reasons why users don’t convert. Take a closer look at your advertising and your landing page to figure out the problem so that you can make necessary changes. Q5. Where do you think Facebook advertising is going? What are the latest trends? Finally, as we promised, we collected a list of trends and predictions for the future of Facebook advertising: Special thanks to the following chat guests who helped us to create this list: @SusanEDub, @FranJolly, @netvantage, @Kevin_Indig, @UdaniNeha, @basecreative, @salmonseo, @lucasvos, @ThinkSEM, @FredDeesJuneyah, @simoncox, and @revaminkoff. That’s it for today! Hopefully, the tips from this post will help you create amazing Facebook ads to reach your business goals. You can also check out our Ultimate Facebook Ads Audit Guide. We would like to thank Susan Wenograd and our other chat guests for sharing their expertise. Join us this Wednesday as we do a Real-Time Website Analysis!",
  "headers": [
    {
      "level": "H1",
      "text": "The Art of Crafting Successful Facebook Ads #Semrushchat"
    },
    {
      "level": "H2",
      "text": "Q1. What are some of your top tips in creating an effective Facebook ad?"
    },
    {
      "level": "H3",
      "text": "Use the AIDA Model"
    },
    {
      "level": "H3",
      "text": "Avoid Selling"
    },
    {
      "level": "H3",
      "text": "Offer Value"
    },
    {
      "level": "H3",
      "text": "Employ CTAs That Make People Take Action"
    },
    {
      "level": "H3",
      "text": "Grab User’s Attention with the Right Images"
    },
    {
      "level": "H2",
      "text": "Q2. Which Facebook advertising techniques can be effective for companies with small budgets?"
    },
    {
      "level": "H3",
      "text": "Align Your Goals with Your Campaigns"
    },
    {
      "level": "H3",
      "text": "Be Specific About Who You Are Targeting"
    },
    {
      "level": "H3",
      "text": "Target Users Who Already Like Your Page"
    },
    {
      "level": "H3",
      "text": "Use Split Testing Feature"
    },
    {
      "level": "H3",
      "text": "Boost Your Posts"
    },
    {
      "level": "H2",
      "text": "Q3. Video Ads: What are the best practices for creating a Facebook ads landing page promoting a video on Facebook?"
    },
    {
      "level": "H3",
      "text": "Make Sure Your Landing Page and Your Video Are Related"
    },
    {
      "level": "H3",
      "text": "Make an Impact in the First Seconds"
    },
    {
      "level": "H3",
      "text": "Choose the Right Thumbnail"
    },
    {
      "level": "H3",
      "text": "Use Subtitles"
    },
    {
      "level": "H3",
      "text": "Try Micro Conversions"
    },
    {
      "level": "H2",
      "text": "Q4. Let’s say you have a CTR of +5%, but low conversions. What is the problem and how could you solve it?"
    },
    {
      "level": "H3",
      "text": "Improve Your Landing Page"
    },
    {
      "level": "H3",
      "text": "Make Your Message Clear"
    },
    {
      "level": "H3",
      "text": "Provide a Strong CTA on Your Landing Page"
    },
    {
      "level": "H3",
      "text": "Focus on Your Audience"
    },
    {
      "level": "H2",
      "text": "Q5. Where do you think Facebook advertising is going? What are the latest trends?"
    },
    {
      "level": "H6",
      "text": "Most popular pages"
    },
    {
      "level": "H6",
      "text": "SEO Checklist: 41 Tips to Optimize Your Website"
    },
    {
      "level": "H6",
      "text": "How to Perform a Complete SEO Audit (in 14 Steps)"
    },
    {
      "level": "H6",
      "text": "A Beginner’s Guide to Keyword Search Volume"
    }
  ],
  "author": ""
}