{
  "url": "https://www.semrush.com/blog/top-semrush-updates/",
  "slug": "top-semrush-updates",
  "title": "Top Semrush Updates of the Year",
  "description": "Semrush tools constantly evolve. Here’s a roundup of our top updates in every category, from 2022 and the first half of 2023.",
  "content": "The digital marketing world just keeps on changing. Since the beginning of 2022, the landscape has been rocked by seismic shifts: The rise of AI, especially for content generation A continued surge in video, on social media and in search Increased personalization, leveraging AI and customer data to tailor digital experiences The importance of authenticity, and making sure that AI-generated content has a human touchAnd that’s just the tip of the iceberg. In the last 18 months, Semrush has delivered 33 major updates, including: 25 product updates 8 app updates (including six brand new apps)Keep reading for the best Semrush updates you might have missed—and how you can use them to boost your visibility, beat your competition, and delight your audience.SEO UpdatesThe Most Accurate Search Volume Data on the MarketTwenty expert data scientists spent two years perfecting it, and in 2022, we delivered big. We added new data sources to the mix. Put simply, Semrush search volumes got even more comprehensive. We’ve updated our keyword databases for the United States, United Kingdom, Australia, Canada, France, Spain, Italy, Belgium, the Netherlands, Germany, Israel, and Brazil to reflect the new search volumes.Check it for yourself in Keyword Overview, Keyword Gap, Organic Research, and the Keyword Magic tool.Read more about the update on our blog.Build Authority with Semantic Core Opportunities in Keyword Strategy BuilderKeyword Strategy Builder is the ultimate tool to build your strategy with smart search insights. We’ve made it even more insightful with the new Keyword Clusters feature. Keyword Clusters automatically groups your list thematically, helping you: Create a semantic core for your site in one click Plan content clusters to build topical expertise Understand the relationships between topics Sort keywords by essential metrics like Keyword Density (KD%) and Search VolumeReady to write? Just send your keywords to the SEO Writing Assistant and start creating. You can also share these lists with the team and collaborate without ever leaving the tool. Just click the share button and enter their email. It’s that simple.Try it yourself. Explore your keyword clusters in the updated Keyword Strategy Builder tool.A More Comprehensive Authority ScoreSemrush’s Authority Score measures how authoritative a site is online. We updated its already complex algorithms to include both organic traffic and spam factors, making it more resistant to manipulation.Here’s a breakdown of the updated parameters, both positive and negative:This gives you an even clearer picture of how competitive any site is.Find the updated Authority Score in all the same places it lived already—in Domain Overview, Backlink Analytics, Backlink Audit, Link Building, and in Keyword Overview’s SERP Analysis widget.Read more about the updated metric on our blog.Goodbye Universal Analytics, Hello GA4You’ve probably already heard the news: Universal Analytics sunsets on July 1, 2023. We’ve already launched GA4 integrations for: SEO Dashboard Organic Traffic Insights Position Tracking Backlink Audit Site Audit My ReportsIf you haven’t yet moved over to GA4, now is a good time to start. First, learn more about it in our Semrush Academy course. Then, reconnect your properties to your Semrush projects and start analyzing your new data.Instantly Analyze the Best Backlinks in Any Domain’s ProfileThe new Network Graph report, which you can find in Backlink Analytics, gives you a bird’s-eye view of the best backlinks on any domain’s backlink profile. Now, it’s easier than ever to spot: Multiple tiers of referring domains The overall reputability of a site, based on the quality of their backlinks Niche-relevant backlink opportunities Potential problems like link spam or private blog networksUse it to get insights on a competitor, a potential client, or yourself! Find it in the Backlink Analytics tool.Learn more about Network Graph on the Semrush blog.Optimize Your JavaScript with Site AuditSite Audit can now crawl and analyze your site’s JavaScript, even if it’s rendered client-side. Once you enable this feature, the tool will flag JS-specific errors and warnings you might otherwise have missed.But that’s not all. We’ve also added the JS Impact report, which identifies issues where your JavaScript isn’t rendering as it should—potentially resulting in a loss of rankings. Here’s what the report looks like:The JS Impact report can identify changes to any of the following elements: Titles Descriptions Links Word count Canonicals Client-side redirects Meta robots Markup JavaScript crawling is available for Guru and Business users, so if that’s you, try it yourself by running an audit. Read more about the update on our blog.Deliver Next-Level Traffic Insights with 38 Search FeaturesSemrush now tracks a staggering 38 unique SERP features and identifies more powerful opportunities to boost your brand’s visibility. But that’s not all. You can also track your SERP features wins—and the traffic they drive to your site—separately from traditional organic search positions. Now, you’ll have a better understanding of how SERP features contribute to your SEO goals, and which are the most valuable for your strategy.Here’s the full list. (Starred items are new!)Spot the new SERP features in Organic Research, Domain Overview, Keyword Magic, Keyword Overview, and the Semrush Sensor tool. Read more about the update on our blog.Local SEO UpdatesBoost Your Local SEO in 22 More CountriesThe Listing Management tool helps manage all your business listings, reviews, and directory citations—all in one place. And now you can use it in 28 countries. We didn’t stop there. To improve our users’ experience around reviews, we created a new feature for Premium locations in Listing Management: Review Analytics. Use it to compile reports about competitors’ reviews, and get analytics about their review profiles. The report includes data like: How many reviews each competitor has Their average rating The full text of their top reviews, and their responses Categories and attributes from competitors’ GBPsAnd that’s not the only new Premium feature—we also enhanced Heatmaps. Now, you can get ultra-local keyword suggestions for your business, based on the ChatGPT AI.Try the new features for yourself with a Premium location in Listing Management.Competitive & Market Research UpdatesDemystify Their Traffic Strategy with 3 New Traffic ChannelsSemrush has spent the last year and a half leveling-up on competitive research. Now you can analyze traffic from eight channels: Direct traffic Organic search Paid search (updated) Organic social Paid social (new) Display ads (new) Email (new) ReferralHere’s a short breakdown of the changes: We updated the Paid channel to include the whole scope of Google paid search traffic, as well as paid traffic from other search engines We split organic and paid social traffic into separate channels We added new channels for display ads and emailWhat does this mean for you? It’s an HD-quality picture of your competitors’ traffic sources—and tons more data to make your strategy more competitive.Find it in Traffic Analytics, Market Explorer, and the Traffic Analytics API.Target the Ultimate Growth Opportunities with .TrendsSemrush .Trends is the ultimate competitive intelligence solution, providing you with instant insights into your biggest competitors and growth opportunities.Here are the top .Trends updates of the year.Keyword Data in Traffic Analytics? Yes, PleaseWe added a useful new widget to the Traffic Analytics Traffic Journey report: Top Keywords. It shows you any domain’s top traffic-driving keywords—both paid and organic. This update gives you quick, actionable insights into your competitors’ ranking performance. Now, you don’t just know HOW they rank, but also how effectively—so you know which competitor keywords are your most valuable targets.Try the new widget yourself in Traffic Analytics. (Not a .Trends user? Learn more about it on our Pricing page.)Check Your Competitors’ Conversions and Growth in Market ExplorerMarket Explorer also got a boost, with big changes to the Growth Quadrants widget. Growth Quadrants can now analyze up to 100 individual domains, making it more comprehensive than ever before. And with the new Growth Paths feature, you can get instant insights into growth trends in your market.To help you get the most out of all this data, we added a few more customization options: Zoom in and out for multiple perspectives on your target market Select the specific domains you want to focus on, and exclude the rest Set custom filters like date range and locationWe’ve also added a new metric: Purchase Conversion. It uses clickstream data to estimate the number of visits on a competitor’s site that ended in a purchase.Use it to better understand the competitive landscape, or to benchmark your own site’s performance. Find all these updates alongside your favorite features in Market Explorer.In-Depth Audience Insights from One2TargetOne2Target, a new tool for .Trends users, takes a deep dive into your audience and that of your competitors. The tool has four reports exploring audience demographics, online behaviors, socioeconomic status, and even overlap with competitors. Learn about your audience’s: Average education level Average household size Income and employment Favorite brands, devices, and social media platformsUse what you learn to create more impactful audience segments and fine-tune your marketing strategy.Try One2Target today, and get to know your target audience.Content Marketing UpdatesEmpower Your Content Creation with AI in SEO Writing AssistantSEO Writing Assistant has two new AI features, making it a more powerful writing partner. First, Rephraser saves you valuable minutes rewriting short copy. It can paraphrase, simplify, expand, or summarize text in just a few clicks. Need more long-form assistance? If you’re a Guru or Business user, try Compose with AI. It can generate short sections or entire articles in a snap. Just enter a prompt, and watch the magic happen. But that’s not all. With the new Ask AI feature, SEO Writing Assistant can also help with those last minute research questions. Just pose your question, and the tool will compose an answer for you to use in your content.Test-drive the new features—optimize your next article with SEO Writing Assistant.Social Media UpdatesNever Miss a Mention with Social Media InboxInstead of hopping from app to app, manage all your mentions from one centralized platform with Semrush’s new Social Media Inbox. The tool brings all your social media communications under one roof. You can: Manage conversations across Facebook, Instagram, LinkedIn, and Twitter Reply to messages on every platform from one place Organize and prioritize your messages with intuitive tags Assign communications to team members Strengthen your social media communication strategy with Semrush’s Social Media Inbox. By Popular Demand: Schedule and Approve Carousels and Reels in Social Media PosterYou asked for it, and we delivered. Social Poster can now post, schedule, and analyze Instagram reels and carousels.But that’s not all. Social Poster also has a new Post Approval functionality. Now, anyone who schedules a post can mark it as needing approval—so you can schedule your content with confidence that it meets your quality standards.Try it for yourself free in Social Poster.Agency UpdatesScale Your Agency Growth Kit with New Pricing TiersIn April, the Agency Growth Kit implemented a new, tiered pricing model. Moving forward, you have two options: AGK Start ($69/month): Created especially for small agencies and solopreneurs, this tier covers every essential step of your agency workflow. It’s available for Semrush Pro users only. AGK Scale ($149/month): The perfect solution for larger agencies, with expanded access and premium tools. Available to all paid users.What does this mean for you? Get a plan that’s the right size for your agency, and grow with confidence.Seamless Deliverables and Communication in Client PortalAgency Growth Kit users saw an exciting new feature appear: Client Portal, a custom, secure, white-labeled portal perfect for all your reporting needs. With Client Portal, you can: Securely share reports and updates with your clients Track each stage of a project Create and approve new tasks View project history Communicate directly with clients through task commentingClient Portal is part of Semrush CRM. If you’re an Agency Growth Kit user, check it out for yourself!Discover Your Future Clients in Lead FinderAgency Growth Kit users got a brand-new tool designed to help them build their business. Lead Finder helps agencies find super-relevant prospects in need of their services, and then helps them craft the perfect pitch. Here’s how it works: Choose a location and a technology your agency specializes in—for example, WordPress Click “Find Leads” Instantly find a list of websites using that tech Evaluate metrics and run an express Site Audit to identify their needs and how you can solve themLead generation has never been so smooth.If you’re an AGK user and haven’t tried it yet, explore Lead Finder now.App Center UpdatesTrack Competitor Media Coverage with Brand Monitoring by ProwlyThe Brand Monitoring app by Prowly helps you stay up-to-date on your competitors’ mentions, media coverage, and shifts in sentiment.Use it to track your own mentions or a competitor’s, including: Brand mentions on social media and across the web New content from influential people, such as leadership, influencers, or influential authors Branded keywords or other phrases, such as product names or campaign taglines Brand popularity, sentiment, and share of voice Backlinks leading to important content, such as product or landing pagesBrand Monitoring can also track mentions in 185 languages and from 245 countries.Empower your digital PR with the most up-to-date info from Brand Monitoring. Leverage Competitor Ad Data with AdClarity – Advertising IntelligenceAdClarity users, rejoice: In addition to the app’s incredible display advertising intelligence, you can now analyze social and video ad channels.We’ve also made the app’s limits more flexible, so you can subscribe to the ad channels you really need. Try AdClarity free for 7 days in the Semrush App Center.Position Yourself for Ecommerce Success with Shopify FinderThe Shopify Finder app by FindNiche gets you the inside scoop on any product sold on Shopify. With it, you can analyze: How competitive your niche is Demand and profitability for any product Pricing and profit trendBonus: If you purchase an add-on, you can get all the same data for products on AliExpress. Try Shopify Finder free for 7 days in the Semrush App Center.Leverage AI to Create High-Quality Content Easily in ContentShakeNeed a writing partner to help you concept, plan, write, and optimize your content? Meet ContentShake, brand-new in the Semrush App Center. ContentShake combines your business expertise and brand DNA with AI and competitive intelligence. This empowers you to produce high-quality articles for your site, faster and easier than ever.It also: Uses real-time Google search data for competitor research Provides weekly updates with new content ideas based on keyword trends Learns your tone of voice when generating text and enables you to control it Integrates with WordPress Try ContentShake for free, and start generating amazing content.Quick & Easy Quality Control with Plagiarism CheckerThe Plagiarism Checker app can make vetting your content faster and easier than ever before.Just copy and paste up to 6,000 words, and the tool will automatically report on: How much was likely plagiarized—and the top sources Whether the text was likely AI-generated How long and difficult it is to read Grammatical errorsAnd best of all, it’s free! Check your copy in Plagiarism Checker now.Amp Up Your Influencer Campaigns with Influencer AnalyticsStep up your influencer campaigns with Influencer Analytics, new to the Semrush App Center. With it, you can: Search for powerful influencers on the social platforms that work best for your brand Find partners who target the audience you need to reach Uncover your competitors’ strategies by identifying influencers they work with Budget more effectively by analyzing the estimated cost of advertising with your ideal influencers Save time with real-time campaign execution and reportingAll that in one app. Try Influencer Analytics yourself and find your brand’s next greatest influencer.Endless Content Ideas in AI Social Content GeneratorThe AI Social Content Generator app by Predis.AI quickly creates fresh, brand-aligned image and video content for your social platforms. It uses the power of AI to help you: Build on-trend and on-brand content in a few clicks, including text, hashtags, images, videos, carousels, and more Bust through writer’s block with content ideas relevant to your business Create high-performing content with user-friendly templates Uncover the strategies your competitors are using to power conversions Simply select your content type, follow the prompts, and let AI work its magic.Level-up your social media content. Try AI Social Content Generator free for 7 days.As Your Marketing Needs Evolve, So Will WeAs any digital marketer knows, the online landscape will continue to shift—and with it, so will your marketing needs. We’ll keep listening to your feedback and insights, and improving our tools accordingly.Keep your eyes on the Semrush Newsroom for continued industry and product updates.",
  "headers": [
    {
      "level": "H1",
      "text": "Top Semrush Updates You Won’t Want to Miss"
    },
    {
      "level": "H2",
      "text": "SEO Updates"
    },
    {
      "level": "H3",
      "text": "The Most Accurate Search Volume Data on the Market"
    },
    {
      "level": "H3",
      "text": "Build Authority with Semantic Core Opportunities in Keyword Strategy Builder"
    },
    {
      "level": "H3",
      "text": "A More Comprehensive Authority Score"
    },
    {
      "level": "H3",
      "text": "Goodbye Universal Analytics, Hello GA4"
    },
    {
      "level": "H3",
      "text": "Instantly Analyze the Best Backlinks in Any Domain’s Profile"
    },
    {
      "level": "H3",
      "text": "Optimize Your JavaScript with Site Audit"
    },
    {
      "level": "H3",
      "text": "Deliver Next-Level Traffic Insights with 38 Search Features"
    },
    {
      "level": "H2",
      "text": "Local SEO Updates"
    },
    {
      "level": "H3",
      "text": "Boost Your Local SEO in 22 More Countries"
    },
    {
      "level": "H2",
      "text": "Competitive & Market Research Updates"
    },
    {
      "level": "H3",
      "text": "Demystify Their Traffic Strategy with 3 New Traffic Channels"
    },
    {
      "level": "H3",
      "text": "Target the Ultimate Growth Opportunities with .Trends"
    },
    {
      "level": "H4",
      "text": "Keyword Data in Traffic Analytics? Yes, Please"
    },
    {
      "level": "H4",
      "text": "Check Your Competitors’ Conversions and Growth in Market Explorer"
    },
    {
      "level": "H4",
      "text": "In-Depth Audience Insights from One2Target"
    },
    {
      "level": "H2",
      "text": "Content Marketing Updates"
    },
    {
      "level": "H3",
      "text": "Empower Your Content Creation with AI in SEO Writing Assistant"
    },
    {
      "level": "H2",
      "text": "Social Media Updates"
    },
    {
      "level": "H3",
      "text": "Never Miss a Mention with Social Media Inbox"
    },
    {
      "level": "H3",
      "text": "By Popular Demand: Schedule and Approve Carousels and Reels in Social Media Poster"
    },
    {
      "level": "H2",
      "text": "Agency Updates"
    },
    {
      "level": "H3",
      "text": "Scale Your Agency Growth Kit with New Pricing Tiers"
    },
    {
      "level": "H3",
      "text": "Seamless Deliverables and Communication in Client Portal"
    },
    {
      "level": "H3",
      "text": "Discover Your Future Clients in Lead Finder"
    },
    {
      "level": "H2",
      "text": "App Center Updates"
    },
    {
      "level": "H3",
      "text": "Track Competitor Media Coverage with Brand Monitoring by Prowly"
    },
    {
      "level": "H3",
      "text": "Leverage Competitor Ad Data with AdClarity – Advertising Intelligence"
    },
    {
      "level": "H3",
      "text": "Position Yourself for Ecommerce Success with Shopify Finder"
    },
    {
      "level": "H3",
      "text": "Leverage AI to Create High-Quality Content Easily in ContentShake"
    },
    {
      "level": "H3",
      "text": "Quick & Easy Quality Control with Plagiarism Checker"
    },
    {
      "level": "H3",
      "text": "Amp Up Your Influencer Campaigns with Influencer Analytics"
    },
    {
      "level": "H3",
      "text": "Endless Content Ideas in AI Social Content Generator"
    },
    {
      "level": "H2",
      "text": "As Your Marketing Needs Evolve, So Will We"
    },
    {
      "level": "H6",
      "text": "Most popular pages"
    },
    {
      "level": "H6",
      "text": "SEO Checklist: 41 Tips to Optimize Your Website"
    },
    {
      "level": "H6",
      "text": "How to Perform a Complete SEO Audit (in 14 Steps)"
    },
    {
      "level": "H6",
      "text": "A Beginner’s Guide to Keyword Search Volume"
    }
  ],
  "author": ""
}