{
  "url": "https://www.semrush.com/blog/top-level-domains/",
  "slug": "top-level-domains",
  "title": "What Is a Top Level Domain (TLD)? Top Level Domains Explained",
  "description": "A top-level domain is the last piece of text in a domain name. And it can affect how users perceive your brand.",
  "content": "What Is a Top-Level Domain?A top-level domain (TLD) is the last segment of text in a domain name, such as .com or .net. Top-level domains are also called domain extensions, domain suffixes, and URL extensions. TLDs are important because they indicate the type or category of a website, such as commercial (.com), network (.net), organization (.org), or country-specific (.uk, .fr, .pe).Top-level domains seem like a minor issue. But they’re a major part of any online business’s marketing strategy.And they look like this:TLDs are also part of the DNS hierarchy, which is a system that organizes domain names into different levels. The DNS hierarchy is like an inverted tree, with the root domain at the top and the subdomains at the lower levels. The root domain is represented by a dot (.) and it contains all the TLDs. For example, the domain name www.example.com has three levels: the root domain (.), the top-level domain (.com), and the second-level domain (example). The second-level domain can also have subdomains, such as blog.example.com or mail.example.com.Like this:The DNS hierarchy helps to resolve domain names into IP addresses, which are numerical identifiers for computers on the Internet. When you type a domain name into your browser, it sends a query to a DNS server—a computer that stores information about domain names and IP addresses. The DNS server then follows the DNS hierarchy to find the IP address that matches the domain name. For example, if you type www.example.com, the DNS server will first ask the root server for the IP address of .com, then ask the .com server for the IP address of example, and then ask the example server for the IP address of www. This process is called DNS resolution.Do Top-Level Domains Affect SEO?Yes, TLDs can affect SEO and your overall marketing performance.TLDs are a minor factor compared to on-page SEO, backlink profiles, and other aspects of your marketing endeavors.Google has confirmed that using a custom TLD that includes keywords does “not give any advantage or disadvantage in search.” But while top-level domains won’t directly impact your ranking on Google, they can affect how people perceive your brand. It’s a matter of trust.To users, some top-level domains seem more legitimate than others. A study shows, for example, that .com and .org are among the most trustworthy TLDs to use for your website. Image Source: GrowthBadgerIf users perceive your TLD to be more legitimate, they may be more likely to click on your site in search results.This means you could get more organic traffic with a generic top-level domain like .com than you could with a less common TLD.Your TLD can affect other channels because users are more likely to click links they perceive as trustworthy anywhere—not just in search engine results.To quickly check if any domain is roughly perceived as trustworthy, use Backlink Analytics. You’ll be able to see a breakdown of referring domains by their top-level domain type. Further reading: What Are Backlinks & Why They Matter for SEO What Is a URL? Meaning, Structure, and Optimization TipsTop-Level Domain ExamplesThere are tons of different types of TLDs available for your specific needs. Let’s dive into some popular and interesting top-level domain examples to give you a clearer picture: .com — This is the most popular TLD and stands for “commercial.” It’s the go-to choice for most businesses and organizations worldwide. Websites like Google.com, Amazon.com, and Facebook.com use this TLD. .org — Short for “organization,” this TLD is often associated with nonprofit entities. Notable examples include Wikipedia.org and RedCross.org. .net — Originally intended for network-related websites, .net has become a versatile TLD used by various businesses. One example is SlideShare.net. .gov — Exclusive to the United States government, websites with .gov TLDs are reserved for federal agencies and institutions, such as USA.gov. .edu — Just like .gov, .edu is exclusive, but for educational institutions in the United States. Harvard.edu and MIT.edu are well-known examples. .io — Although originally intended for British Indian Ocean Territory, .io has gained popularity among tech startups and companies looking for a catchy domain, as seen with Cloudtalk.io. .co — Often used as an abbreviation for “company” or “corporation,” .co has been embraced by startups and businesses as a snappy alternative to .com. Notable examples include Angel.co and Tradelink.co. .me — This TLD has a personal touch and is frequently used for personal blogs and portfolios. Like About.me and Join.me, for example. .blog — A clear indication of a blog, this TLD is increasingly popular among bloggers and content creators. Notable blogs like Seths.blog and Tim.blog use it.These examples show the diversity of top-level domains for creating a unique online presence. Whether you’re running a business, launching a personal blog, or supporting a cause, choosing the right TLD can make a significant impact on your website’s identity and purpose.Types of Top-Level DomainsThe Internet Corporation for Assigned Names and Numbers (ICANN) operates the Internet Assigned Numbers Authority (IANA), which regulates the use and allocation of domain names.The IANA groups top-level domains into six main types:Generic Top-Level Domains (gTLD)Generic top-level domains have three or more characters. And anyone can register them.They are the most common TLDs. They’re what users expect to see when they browse the web. Here are some of the most popular gTLDs: .com .net .orgDespite their label, generic TLDs can still provide users with information about a website.For example, .net often represents networking websites, while .org represents organizations.Some companies have started to make their gTLDs even more specific. As of 2011, established companies and organizations are allowed to apply for and register their own gTLDs.As a result, you can now visit sites with TLDs like the following: .google .amazon .appleIn 2014, geographic top-level domains (geoTLD) were introduced as a way to associate a website with a geographical, geopolitical, ethnic, linguistic, or cultural community.While geoTLDs are related to regions and communities, they are considered gTLDs because their registration is not restricted.Examples of geoTLDs include the following: .berlin .amsterdam .parisAs of February 2024, there are 1,249 generic top-level domains.Generic-Restricted Top-Level Domains (grTLD)Generic-restricted top-level domains (grTLDs) are similar to gTLDs. But their eligibility is restricted for special uses.IANA requires proof of eligibility to register one.The following domain extensions are grTLDs: .biz .name .proThe .biz grTLD, for example, is designated for bona fide business and commercial use. Your average blog or affiliate site may not be eligible.Sponsored Top-Level Domains (sTLD) Sponsored top-level domains are a specialized TLD sponsored by private agencies and organizations. These top-level domains are reserved for groups and organizations that share common themes and criteria. (Like businesses or government agencies.)The sponsoring agencies have the final say on eligibility requirements.Examples of sTLDs include: .gov .museum .edu .mil (U.S. military)Like generic top-level domains, sponsored top-level domains provide information about websites and their related industries.For example, .edu is reserved for accredited educational institutions in the United States. And .gov represents U.S. government websites. Websites with sTLDs help users find official information quickly and are generally considered trustworthy. To get an sTLD for your website, you must apply for one with an ICANN-accredited registrar and ensure you meet the specific criteria. There are currently only 14 sponsored top-level domains in the IANA database. Country-Code Top-Level Domains (ccTLD)Country-code top-level domains are two-letter extensions reserved for countries, sovereign states, and territories.ccTLDs are available to websites and organizations from the corresponding country or territory. Or to corporations that have a presence in the region. Websites can use ccTLDs to demonstrate to customers which country they’re based in and serve. ccTLDs also help Google geotarget your site for more accurate search results. However, country-code top-level domains only target countries and territories, not languages. International SEO and multilingual websites require more than just a ccTLD.The following is a list of common ccTLDs: .ca (Canada) .br (Brazil) .de (Germany) .fr (France) .ie (Ireland) .in (India) .uk (United Kingdom) .us (United States) .io (British Indian Ocean Territory)In recent years, websites have also leveraged ccTLDs for branding purposes.For example, .io is a ccTLD often used in the tech industry, while .ly (Libya) and .es (Spain) are commonly used to optimize complete domain names, as in Bitly’s bit.ly.In fact, Google has taken note of this practice and has started treating some ccTLDs as gTLDs.As of February 2024, the IANA database listed 317 country-code top-level domains.Test Top-Level Domains (tTLD)Test top-level domains are a set of TLDs (and domains) reserved for testing and development purposes.You can’t register these domains with the Domain Name System (DNS). Which means you can use test top-level domains to freely test software changes without fear of conflict with a current or future domain name. tTLDs are typically only used for documentation and internal development processes. The four main tTLDs include the following: .test .example .invalid .localhostThe IANA database lists several additional tTLDs.Infrastructure Top-Level DomainAn infrastructure top-level domain contains one TLD: the Address and Routing Parameter Area (ARPA, or .arpa).In fact, .arpa was the first top-level domain in existence.You can’t register it as a TLD, as it’s typically only used for internet infrastructure purposes.Choose the Best TLD for Your Website and Your UsersTop-level domains indicate your site’s purpose and help attract your target audience.If you want to target users by country, you may need a country-code top-level domain. If your audience is global, then a generic top-level domain might be the way to go. A great way to determine which TLD will work best for your industry and target audience is to observe what your competitors are doing.Simply looking at the TLDs they use is a great place to start.But you can take the analysis a step further using Semrush’s Backlink Analytics tool.To begin, type in a competitor’s URL and click “Analyze.”The main “Overview” tab provides information about who is linking to your competitor’s website and how.But if you scroll down to the “TLD Distribution” panel, you’ll see a breakdown of the referring domains by their TLDs.Like this:Click on the number of domains to get an expanded view of the data. This report is useful for choosing a TLD because it’s fair to assume that most of the sites linking to your competitors are in a similar industry or community.If most of the websites in your industry or community are using ccTLDs such as .uk, it may indicate user preference for such TLDs. But if neither your competitors nor the websites linking to them are using a TLD like .io, it may suggest you shouldn’t use it either. Ultimately, though, you want to choose a TLD that accurately reflects your website and its purpose. And that aligns with the expectations and perceptions of your target audience.List of Top-Level Domains by PopularityNot sure which TLD is right for you? Use the following TLD list to help determine the best option.If your goal is to use a common TLD that users are familiar with, choose a more popular one. Or if you’re looking to stand out, you may want to choose a more unique option.Before you decide, review the top-level domain list based on popularity: Rank TLD Percentage of Websites Using TLD 1 .com 49.2% 2 .org 4.6% 3 .ru 4.0% 4 .net 3.0% 5 .de 2.4% 6 .uk 2.1% 7 .au 1.7% 8 .fr 1.6% 9 .in 1.5% 10 .br 1.4% 11 .jp 1.4% 12 .it 1.2% 13 .ir 1.1% 14 .pl 1.1% 15 .ca 1.0% 16 .nl 0.9% 17 .ua 0.8% 18 .vn 0.7% 19 .tr 0.7% 20 .co 0.7% 21 .cz 0.6% 22 .es 0.6% 23 .gr 0.5% 24 .ch 0.5% 25 .info 0.5% 26 .cn 0.5% 27 .eu 0.5% 28 .za 0.5% 29 .io 0.5% 30 .il 0.5% 31 .id 0.4% 32 .tw 0.4% 33 .kr 0.4% 34 .mx 0.4% 35 .ro 0.4% 36 .be 0.4% 37 .ar 0.4% 38 .se 0.4% 39 .hu 0.3% 40 .nz 0.3% 41 .at 0.3% 42 .cl 0.3% 43 .dk 0.3% 44 .by 0.3% 45 .sk 0.2% 46 .us 0.2% 47 .no 0.2% 48 .xyz 0.2% 49 .рф 0.2% 50 .me 0.2%",
  "headers": [
    {
      "level": "H1",
      "text": "What Is a Top-Level Domain? TLDs Explained with Examples"
    },
    {
      "level": "H2",
      "text": "What Is a Top-Level Domain?"
    },
    {
      "level": "H2",
      "text": "Do Top-Level Domains Affect SEO?"
    },
    {
      "level": "H2",
      "text": "Top-Level Domain Examples"
    },
    {
      "level": "H2",
      "text": "Types of Top-Level Domains"
    },
    {
      "level": "H3",
      "text": "Generic Top-Level Domains (gTLD)"
    },
    {
      "level": "H3",
      "text": "Generic-Restricted Top-Level Domains (grTLD)"
    },
    {
      "level": "H3",
      "text": "Sponsored Top-Level Domains (sTLD)"
    },
    {
      "level": "H3",
      "text": "Country-Code Top-Level Domains (ccTLD)"
    },
    {
      "level": "H3",
      "text": "Test Top-Level Domains (tTLD)"
    },
    {
      "level": "H3",
      "text": "Infrastructure Top-Level Domain"
    },
    {
      "level": "H2",
      "text": "Choose the Best TLD for Your Website and Your Users"
    },
    {
      "level": "H2",
      "text": "List of Top-Level Domains by Popularity"
    }
  ],
  "author": ""
}