{
  "url": "https://www.semrush.com/blog/topic-clusters/",
  "slug": "topic-clusters",
  "title": "Topic Clusters for SEO: What They Are & How to Create Them",
  "description": "SEO topic clusters are groups of webpages used to establish authority around a particular subject.",
  "content": "What Is a Topic Cluster?A topic cluster (or content cluster) is a group of interconnected, thematically related pages on a website. Each cluster includes one pillar page, which is the main page that provides a broad overview of a particular topic. And multiple subpages (also called cluster pages), which cover associated subtopics.All of these pages are connected with internal links (links that direct to other pages on your site).Like so:What Are the Benefits of Topic Clusters?An effective topic cluster strategy can help with search engine optimization (SEO).Why?Because the more quality content you publish on a relevant topic, the more keywords (search queries) you can rank for. Which helps attract more users to your website. And build more topical authority.Let’s say you have a pillar page about how to decorate an apartment. And cluster pages that talk about kitchen decor, living room furniture, and bedding.Publishing high-quality content on all these pages signals that your website is an authority on apartment decoration.This is important because Google wants to rank content that demonstrates Experience, Expertise, Authoritativeness, and Trustworthiness (E-E-A-T).NoteIn the news sector, Google uses a dedicated topical authority system to prioritize search results from “news teams that are intimately familiar with the location and topic.”Plus, SEO topic clusters contribute to an effective site structure. By linking to and from a pillar page, you allow Google and users to easily: Find related content Understand the significance of the pillar page Recognize semantic relationships (how the content fits together)This is similar to the way a bookstore organizes books. With titles being grouped by section.Here’s a visual representation:Last but not least, establishing a reputation as a subject matter expert can help you attract and convert target audiences. Because people usually prefer to engage with credible companies.How To Create Topic Clusters and Monitor Their PerformanceLearn how to create topic clusters that drive organic traffic (unpaid search engine traffic). And improve user engagement on your website.1. Choose a Core TopicFirst, you need to choose a topic to base your content cluster around. Start with a simple brainstorming session. And consider: Which topics are relevant and important to your brand? Which topics have worked well for you in the past? What content do you already have? Which topics does your target audience care about? Which topics do your competitors talk about?Your chosen topic should be broad enough to warrant several pieces of content. But not so broad that the cluster could become oversized and unfocused.The right approach depends on your goals and audience.For example, restaurant team management platform 7Shifts has a guide to restaurant costs that acts as a pillar page for other related topics. And links to 7Shifts’ other articles about restaurant bookkeeping, accounting, and labor costs.But a company that focuses on workforce management across industries might have a much broader cost-saving guide. And pages devoted to different types of businesses—restaurants, software companies, etc.Depending on your industry and offering, you might have a lot of ideas for topic clusters to include in your content calendar.So, let’s perform some keyword research to gauge the level of interest in your potential topics.2. Perform Keyword ResearchKeyword research is the process of finding queries you want to rank for (i.e., target keywords). And collecting data that helps you evaluate ranking opportunities.This is key to identifying the best topic cluster ideas. And creating SEO-friendly content.Use Semrush’s Keyword Magic Tool to find relevant keywords to inform your topic clusters.Let’s say your business sells hair products.To start, enter a seed keyword (a broad term related to your business) into the search bar. And click “Search.” Pro tipEnter your domain in the purple search bar to get AI-powered insights based on your domain. The results include over 8 million keywords. So, look for a term that’s relevant to your brand and broad enough to include additional pillar pages and subpages. And look at the following metrics: Intent: Search intent can be navigational, informational, commercial, or transactional. Topic clusters often center around keywords with informational or commercial search intent. Volume: The average number of monthly searches for your target keyword. This indicates the potential reach of your content each month. Keyword difficulty (KD %): A score indicating how difficult it’ll be to rank in Google’s top 10 organic results for a given term. Generally, the higher the number out of 100, the harder it’ll be to rank.A keyword like “curly hair” is a great candidate. Because it gets 90,500 searches per month, has a reasonably low difficulty score, has informational intent, and makes sense for your business (because you have a line of curly hair products).Click on the keyword to learn more about it.For example, the “Trend” section contains an overview of monthly search volume over the past 12 months.As you can see, this term gets a pretty consistent stream of searches throughout the year. Once you’re happy with your starting keyword’s potential, the next step is to determine your pillar pages and subpages.3. Identify Pillar Pages and SubpagesTo find ideas for your pillar pages and subpages, use Semrush’s AI-powered Keyword Strategy Builder. Which is far easier and faster than trying to do it manually.Start by entering the keyword you identified in the previous step. And click “Create list.”The tool will then generate pillar page and subpage ideas for you (this process can take up to 15 minutes).In this case, one of the pillar pages targets the keyword “curly hair routine.” And its subpages cover topics like “curly hair products” and “best curl cream.”Both pillar pages and subpages contain what’s called a keyword cluster. Which is a group of search terms that share the same intent (you can see any page’s keyword cluster by clicking the gray arrow next to the respective page).Using a single page to target each of the terms in the keyword cluster enables you to rank for more search terms.The tool can potentially provide many ideas. So, prioritize pillar pages and subpages by evaluating intent, search volumes, and difficulty scores.And consider incorporating both highly specific and popular search queries. To increase your chances of becoming more visible in search results more quickly.4. Create Quality ContentOnce you’ve planned out your first topic cluster, you’re ready to create and publish quality content that’s useful, authoritative, accurate, and relevant to your target audience. Pro tip If you already have content that could fit in your topic cluster, improve that rather than creating a similar page. Duplicate content can harm your SEO.It’s a good idea to start with your pillar page. Because this is the page that provides a broad overview of your core topic. And the foundation for your topic cluster.Then, create your pillar page with links to your cluster pages in mind. Consider a travel blog that wants to publish a Disney World planning guide as a pillar page. And used Keyword Strategy Builder to identify “budgeting for disney world,” “when to travel to disney world,” and “best disney world hotels” as some of the subpages.The guide’s heading structure might look something like this: Disney World Vacation Planning: The Ultimate Guide for 2024 1. Plan Your Budget 2. Decide When to Travel 3. Choose Where to Stay 4. Create an Itinerary 5. Book Restaurants 6. Create a Packing List 7. Learn Disney World Tips & Tricks After publishing your pillar page, you can create cluster pages at your own pace. (Of course, the sooner you publish your content, the sooner you can start seeing results.)Remember to add internal links from the pillar page to its cluster pages. And vice versa.If you need help creating search-friendly content, use Semrush’s SEO Content Template.Enter the page’s keyword cluster, choose your focus country and device, and click “Create content template.”The tool provides suggestions based on the top 10 rival webpages.This includes a recommended text length. And ideas for domains you can earn backlinks from.(Backlinks are links from other websites pointing toward your website. Google treats certain types of backlinks like recommendations. So, they can boost your topical authority even further.)When you’re ready to start writing, head over to the “Real-time Content Check” tab.And click “Open in SEO Writing Assistant.”Semrush’s SEO Writing Assistant scores your content’s readability, originality, SEO, and tone of voice in real time.In addition to improving your content’s quality and SEO potential, this tool helps you maintain consistency across your content cluster.As you review the tools’ recommendations, keep these tips in mind: Choose a primary keyword: Pick the main keyword you want each page to rank for (which is likely the one Keyword Strategy Builder specified). Try to use this primary keyword in your page’s title tag, meta description, URL slug, H1, and first paragraph of body content. Include secondary keywords: Use the other keywords from your keyword cluster (secondary keywords) within the content. But be careful to avoid forcing keywords in, as this can harm your SEO. Analyze competing content: Look at rival pages to work out how to create something even better. This will also help with the research process. Write for people first: Make sure your content is created primarily for your target audience—not for search engines. Providing genuine value should improve rankings and engagement. Be clear and concise: Make it quick and easy for readers to get the information they need. Structure and format your content thoughtfully to make it more digestible. Build internal links: Link to other pages in the cluster so users can easily navigate between them. And attach your links to keyword-rich anchor text to enhance Google’s understanding.NoteThe SEO Content Template, SEO Writing Assistant, and Topic Research tools are all part of Semrush’s Content Marketing Platform. Which you can try for free.5. Measure Your Cluster’s PerformanceMonitor your content clusters’ performance, so you know what’s working and what isn’t.This way, you can: Expand top-performing clusters with additional content Review and improve low-performing content Adapt your topic cluster strategy based on meaningful dataThere are many content marketing metrics you can track. But SEO topic clusters are primarily used to generate organic rankings.So, we recommend adding your target keywords to Semrush’s Position Tracking tool.It allows you to track your Google rankings for individual keywords.Plus, you can use tags to group related keywords (e.g., keywords targeted on the same page). Navigate to the “Tags” report to see how each keyword group is performing as a whole.Topic Cluster ExamplesFor a better understanding of what topic clusters are and how they work, check out these topic cluster examples:Healthline’s Allergy Content ClusterHealthline has an article called “Everything You Need to Know About Allergies” that acts as a pillar page for an allergy content cluster.It provides an overview of several subtopics, including symptoms, causes, and treatments.The article links to cluster pages that provide more detailed information on these subtopics.Like this:Here’s a snapshot of the linked food allergies cluster page:Petcube’s Puppy Care Content ClusterPetcube, a pet technology company, attracts its target audience with a “Puppy Care 101” guide. Which covers all the basics that first-time puppy owners need to know.At the ends of many sections, Petcube links to more detailed subtopic guides.Like this:Other subpage topics include raising a puppy, adopting from a shelter, puppy-proofing, puppy supplies, and crate training.Wistia’s Video Marketing GuideVideo marketing platform Wistia’s video marketing guide acts as a pillar page for cluster pages like video marketing funnel stages, examples, promotion, and more.The pillar page also includes numerous instructional videos. Which makes it a valuable resource and adds to Wistia’s topical authority.TipCheck out our dedicated article for more pillar page examples.Build Your Topic Clusters in SecondsTopic clustering requires plenty of keyword research. But with Semrush’s Keyword Strategy Builder, you’re likely to save hours. The AI-powered tool automatically generates pillar page and subpage ideas. Allowing you to populate your content calendar in a fraction of the time it takes to do it from scratch. That means you can start creating content—and improving your rankings—right away.",
  "headers": [
    {
      "level": "H1",
      "text": "Topic Clusters for SEO: What They Are & How to Create Them"
    },
    {
      "level": "H2",
      "text": "What Is a Topic Cluster?"
    },
    {
      "level": "H2",
      "text": "What Are the Benefits of Topic Clusters?"
    },
    {
      "level": "H2",
      "text": "How To Create Topic Clusters and Monitor Their Performance"
    },
    {
      "level": "H3",
      "text": "1. Choose a Core Topic"
    },
    {
      "level": "H3",
      "text": "2. Perform Keyword Research"
    },
    {
      "level": "H3",
      "text": "3. Identify Pillar Pages and Subpages"
    },
    {
      "level": "H3",
      "text": "4. Create Quality Content"
    },
    {
      "level": "H3",
      "text": "5. Measure Your Cluster’s Performance"
    },
    {
      "level": "H2",
      "text": "Topic Cluster Examples"
    },
    {
      "level": "H3",
      "text": "Healthline’s Allergy Content Cluster"
    },
    {
      "level": "H3",
      "text": "Petcube’s Puppy Care Content Cluster"
    },
    {
      "level": "H3",
      "text": "Wistia’s Video Marketing Guide"
    },
    {
      "level": "H2",
      "text": "Build Your Topic Clusters in Seconds"
    }
  ],
  "author": ""
}