{
  "url": "https://www.semrush.com/blog/total-addressable-market/",
  "slug": "total-addressable-market",
  "title": "What Is Total Addressable Market (TAM) and How to Calculate It",
  "description": "Learn how calculating the total addressable market can help you assess your company’s revenue potential.",
  "content": "What Is Total Addressable Market?Total Addressable Market (TAM), also referred to as total available market, is a way for companies to determine how much money they could make if they sold their product or service to every possible customer in a specific market. TAM helps businesses understand the maximum revenue they could generate if they had 100% market share.For example, say a company produces organic energy bars. Its TAM would be the total potential revenue it could generate by selling its products to everyone interested in buying organic energy bars.TAM isn’t a revenue projection. Instead, it’s a way for companies to understand the current marketplace’s size. While capturing 100% of the market may not be feasible, understanding TAM helps businesses prioritize specific products and customer segments. All while assessing their potential return on investment. Most companies also assess the number of customers they can realistically target with metrics known as Serviceable Addressable Market or Serviceable Available Market (SAM) and Serviceable Obtainable Market or Share of Market (SOM)The Differences between TAM, SAM, and SOMTAM, SAM, and SOM are three distinct concepts representing various market subsets: TAM is the total demand for a specific product or service within a given market SAM is the portion of the TAM that a company can target and serve realistically SOM is the percentage of the market that a company currently captures or intends to capture based on its competitive position and market shareAll three work together to guide businesses in resource allocation, market targeting, and growth strategies. Let’s return to the previous organic energy bar example. Global consumer expenditure on organic food was $259.06 billion in 2022. That would be the total addressable market, including products like fresh produce, packaged goods, dairy products, meat, and beverages.Organic energy bars, valued at $361.05 million in 2021, comprise only 0.14% of the global organic food market. This market share is the SAM.Several large companies manufacture and supply these products within the organic energy bar market. The SOM refers to the specific portion of the market our example company can feasibly capture.TAM, SAM, and SOM offer different insights for your business: TAM signifies scalability potential SAM represents target market share SOM indicates sales potential in the near futureEach of these calculations gives your business a much-needed bird’s eye view of the market.4 Methods for Calculating TAMThere are four total addressable market calculation methods for your business: Top-Down, Bottom-Up, Value Theory, and Semrush’s Market Explorer Overview Report. 1. Top-DownA top-down analysis starts with a large population representing the target market. Then it narrows gradually to a target market segment based on factors like geography and other demographics. It looks like an inverted pyramid, with the broad target market at the top and the target market segment at the bottom.Industry data from research companies like Gartner, the World Bank, or Forrester can help identify which subsections of your industry align with your goals. It can also give you a good idea of the size of those subsections.For example, say you have a software as a service (SaaS) startup offering personalized fitness training for adults interested in fitness in the United States. You gather industry data from reputable sources like those listed above. You start broad: The total number of adults in the U.S. is 258.3 million. Then you narrow down your market segment based on your other criteria. Through the Centers for Disease Control and Prevention (CDC), you find that 28% of that population (or about 72 million people) falls within your target market criteria—adults who work out regularly.Based on market research findings, you estimate that this target market's average annual spending on fitness-related services is $500 per person.To calculate the TAM, multiply the number of American adults who work out regularly (72 million) by the average spending per person ($500). That gives you a TAM of $36.5 billion. Unfortunately, data generated by third-party industry groups may not always reflect your niche market. For example, say your tech startup develops virtual reality fitness training. Third-party industry reports might provide data on the overall fitness market but may not accurately capture the specific trends around virtual reality in the healthcare industry.In this case, marketing research consulting firms can conduct a study for you based on your industry needs.2. Bottom-UpThe bottom-up approach inverts the top-down method. It starts with ideal target market segments and builds up to a total addressable market. The bottom-up approach can be more reliable than the top-down. Why?Because it’s based on primary market research using existing pricing data and previous sales. To find your TAM using this method, multiply your average sales price by your total number of current customers. That gives you your annual contract value (ACV). Then multiply your ACV by the total number of potential customers in your market (your SAM). That yields your total addressable market. Suppose you operate a coffee shop. Your average sales price per customer is $5 and you currently serve 200 customers daily, yielding an ACV of $1,000.Then multiply your ACV ($1,000) by the estimated local area’s potential market (10K). That gives you a TAM of $10 million.3. Value TheoryThe value theory approach estimates a product-market fit: the value your products or services provide customers and how much they will pay for them in the future. Value theory is helpful when a company introduces a new product line, enters a new market, or wants to cross-sell products to existing customers. Using the coffee shop example: say you roast specialty beans in-house but your competitors outsource their beans from other roasters. Start by asking two questions: How many people would value your beans? How much are they willing to pay for this unique experience?If other shops sell their outsourced coffee beans at $11 for a 12-ounce bag, how much would customers pay for your freshly roasted beans? Answering these questions requires an informed estimate. You’ll have to conduct a competitive pricing analysis from your direct and indirect competitors, researching their value propositions and comparing prices. Let’s say you determine the price is $16 per bag. Multiply this number ($16) by the total number of people or companies that perceive the same value and would want to pay the premium price for your company’s product. Let's assume 20% of the potential customer base values the freshness of your in-house roasted beans. If there are 10K potential customers in your market, multiply that by 20%, giving you 2,000 customers. Finally, multiply the premium price ($16) by the number of customers in the premium segment (2,000). That gives you a TAM of $32K. Value theory is based largely on speculation, so its conclusions won’t be 100% accurate. But by focusing on your product’s value, you can estimate how pricing would capture that value. 4. Market Explorer Overview ReportWith a tool like Semrush’s Market Explorer Overview, you can get a detailed analysis of the market landscape and competitor insights. It enables businesses to calculate their TAM automatically, saving time and effort.When you first use the tool, you must select how you want it to gather and organize your data. You have three options: Create List: Enter a maximum of 100 domains to build a personalized market list. You can then receive domain recommendations while maintaining control over the final selection. You can also name a list and save it for future analysis. Find Competitors: Specify a starting domain. The tool identifies related competitors based on organic search results. That expands your understanding of the competitive landscape. Analyze Category: Select from 110 business categories. The tool will gather data for the top 1,000 domains within that specific industry. That provides valuable insights for industry-specific analysis and benchmarking.Each option requires selecting a geographic location (country, region, or worldwide). After you select a region, the tool brings you to the Overview Report. Market Size shows you the total number of potential buyers in your market. The Market Explorer tool currently includes calculations for TAM and SAM but not SOMIn the upper left corner, you’ll see the Market Summary. If you specify a desired date range, you’ll see the data displayed as a graph so you can track changes more easily.However, with TAM and SAM calculations, companies can estimate market potential and find other ways to increase their market share.Check out the Market Explorer Overview report for a closer look at everything else the tool can do.Why Is TAM Important?The total addressable market is important for many reasons: Helps assess the potential size and value of the market to help you find opportunities Identifies and prioritizes customer segments with the most significant revenue potential to give you a leg up Allows you make informed decisions about resource allocation (e.g., marketing budgets and product development efforts). That way, you can ensure you’re spending your money in the right places.and ensure your employees are always doing something constructive. Evaluates the competitive landscape and identifies revenue opportunities for growth or differentiation. TAM can often be misunderstood. But having even a rough idea of the market size is critical in modern business. By using TAM, you’ll always be one step ahead.How Other Companies Use TAMTAM is most useful when evaluating business opportunities and scalability. The examples below show different ways big-name companies used TAM to promote their market potential. Airbnb: Swaying Investors with TAMSharing TAM and SAM figures can attract potential investors and funding by demonstrating revenue growth potential and market size. Airbnb used these numbers in their initial pitch deck to get early-stage investors on board:Including the TAM and SAM allowed the founders to give investors a concrete idea of what they could achieve.The company continues to share these numbers so investors know their substantial market opportunity:Uber: Challenging TAM Assumptions When Uber entered the scene, the company faced criticism around its TAM valuation. New York University finance professor Aswath Damodaran argued against Uber’s initial TAM of $17 billion, concluding that the best value estimate was around $5.9 billion.However, he found these numbers through an assumption. He based his numbers on historical data: Uber’s market potential was very different from the previous limousine and car-for-hire markets because it provided a radically different experience. Before Uber, there was no way to estimate average pickup times for taxis or track the cab’s current location through an app. Uber also expanded its market by not requiring cash for transactions. Referring to the past to estimate TAM provided a limited understanding of Uber’s disruptive impact on the market. Instead, investors had to consider these variables, which one analyst projected would expand the TAM to three times the original estimation. The analyst’s estimates ranged from $450 billion to nearly $1.4 trillion. Much higher than the NYU professor’s estimation and Uber’s initial TAM. Calculating TAM sometimes requires a forward-thinking approach that analyzes the potential impact of new business models, emerging markets, and untapped customer segments.Stripe: Growing and Expanding TAM When Stripe launched in 2009, using SaaS solutions or cloud-based software for digital payments was a strange proposition. Now seemingly every restaurant and coffee shop does it. But Stripe isn’t just an online payment processor. Of course, it makes money from its core product, but it’s also expanded into fraud prevention platforms and corporate credit cards. In the process, the company’s valuation went from $20 million in 2011 to $94.4 billion in 2021. Stripe’s flexibility allowed it to experiment and grow its TAM significantly.Exploring Your Company’s Total Addressable Market (TAM)Projecting your business’s growth over the next year requires understanding the total addressable market and its potential.By leveraging tools like Semrush’s Market Explorer Overview, you can streamline the TAM calculation process and gain valuable market insights, saving you time and effort on manual calculations. From there, you can tailor your marketing strategies, optimize resource allocation, and make informed decisions to boost growth.",
  "headers": [
    {
      "level": "H1",
      "text": "What Is Total Addressable Market (TAM) and How to Calculate It"
    },
    {
      "level": "H2",
      "text": "What Is Total Addressable Market?"
    },
    {
      "level": "H3",
      "text": "The Differences between TAM, SAM, and SOM"
    },
    {
      "level": "H2",
      "text": "4 Methods for Calculating TAM"
    },
    {
      "level": "H3",
      "text": "1. Top-Down"
    },
    {
      "level": "H3",
      "text": "2. Bottom-Up"
    },
    {
      "level": "H3",
      "text": "3. Value Theory"
    },
    {
      "level": "H3",
      "text": "4. Market Explorer Overview Report"
    },
    {
      "level": "H2",
      "text": "Why Is TAM Important?"
    },
    {
      "level": "H2",
      "text": "How Other Companies Use TAM"
    },
    {
      "level": "H3",
      "text": "Airbnb: Swaying Investors with TAM"
    },
    {
      "level": "H3",
      "text": "Uber: Challenging TAM Assumptions"
    },
    {
      "level": "H3",
      "text": "Stripe: Growing and Expanding TAM"
    },
    {
      "level": "H2",
      "text": "Exploring Your Company’s Total Addressable Market (TAM)"
    }
  ],
  "author": ""
}