{
  "url": "https://www.semrush.com/blog/toxic-links-guidelines/",
  "slug": "toxic-links-guidelines",
  "title": "What Are Toxic Backlinks? How to Find & Remove Them",
  "description": "Toxic backlinks are incoming links that harm your site’s search visibility or have the potential to.",
  "content": "What Are Toxic Backlinks?Toxic backlinks (or bad backlinks) are incoming links that negatively affect your website’s visibility in search engine results pages or have the potential to. The term usually refers to links that violate Google’s link spam guidelines because they were placed on external sites for SEO purposes, rather than for users’ benefit.Google analyzes your backlinks to determine how prominent and trustworthy your site is. This means that certain kinds of links from other sites can benefit your SEO.To discourage manipulative link building, Google has various policies and systems in place. This means that links acquired through questionable practices are often ignored or “devalued.”But a large volume of toxic backlinks can trigger a manual action (or Google penalty). Because it can suggest that your site has engaged in systematic spamming.A penalty can lead to your site being suppressed in or removed from search results. Here’s Google’s stance on links intended to manipulate rankings:Links obtained primarily for artificial manipulation of Search rankings are link spam. Our algorithms and manual actions aim to nullify these unnatural links at scale, and we will continue to improve our coverage.You can quickly gauge your backlink profile’s health with the Toxicity Score metric in Semrush’s Backlink Audit tool. 9 Causes of Toxic BacklinksLet’s explore nine practices that can generate toxic backlinks.1. Paying for LinksYou should never exchange money, goods, or services for standard follow links (links that have the potential to pass SEO value or PageRank).If you exchange money, goods, or services for a link, the creator should qualify the link (i.e., turn it into a nofollow link). By adding one of these nofollow attributes to the link’s HTML code: rel=\"nofollow\": This asks Google to ignore the link for ranking purposes rel=\"sponsored\": This tells Google that the link was bought and should not count for ranking purposesFor example:<a href=\"https://example.com/\" rel=\"nofollow\">Anchor Text Here</a>So, make sure your backlinks are nofollow when: Placing digital advertisements Gifting products in exchange for reviews Working with influencers Paying for directory listingsAmong other link building activities.You can check your “follow” links in Semrush’s Backlink Analytics tool.Enter your domain and click “Analyze.”Go to the “Backlinks” tab and scroll down to apply the “Follow” filter.Then, manually check whether any of the backlinks were paid for.If so, consider reaching out to the publisher and asking them to add a nofollow attribute.2. Exchanging LinksA link exchange occurs when two websites agree to link to each other purely for SEO purposes. The resulting links are called reciprocal links.While it’s natural to link to sites that also link to you, having lots of reciprocal links in your backlink profile may raise Google’s suspicions.If your domain has engaged in a link exchange that violates Google’s guidelines, consider removing the affected link from your site.3. Engaging with Private Blog NetworksPrivate blog networks (PBNs) are groups of websites that are owned by the same party and exist only to supply links to a target website (or websites).Search engines like Google are good at spotting PBNs. So, owning or buying links from a PBN is a very risky tactic.Usually, it’s a good idea to remove these potentially toxic backlinks as soon as possible.4. Using Link Building BotsLink building bots are programs that place backlinks automatically. For example, they may exploit areas that accept user-generated content. Such as blog comment sections, forums, and free directories.All resulting links could be toxic links. So, beware of services that promise backlinks at speed and at scale. Or any kind of link building automation.5. Posting Unnatural Links on Other SitesAvoid adding unnatural links to your site when posting content elsewhere (e.g., forums, comments sections, and social media platforms).Not only does this reflect badly on your brand, but it’s also a form of link spam.In fact, Google recommends that webmasters automatically apply the rel=\"ugc\" attribute to links within user-generated content. To ensure these kinds of links are nofollow.You can see this in action on Reddit:6. Listing Your Business on Low-Quality DirectoriesIt could do more harm than good to list your business in a low-quality directory.These are directories that have little to no editorial process—i.e., anyone can submit their information and get listed. They tend to be extremely broad directories that provide a poor user experience.Also, beware of directories that charge for placements. Especially if they emphasize that you’ll get a link.Not all directories that offer links are going to result in toxic backlinks. But some can. And that’s why it’s important to remain vigilant as you build out your directory listings.TipFind legitimate directories for your local business with Semrush’s Listing Management tool.7. Creating Widgets with LinksIf you create a widget (an embeddable tool) that links to your site, the link should be nofollow.Just like this one in TradingView’s stock price widget:Why?Users embedding the widget don’t have control over the link’s placement and anchor text (the text the link is attached to). So, Google believes the link shouldn’t count as an endorsement of the site.8. Mandating Backlinks Through ContractsGoogle’s spam policies say that “requiring a link as part of a Terms of Service, contract, or similar arrangement without allowing a third-party content owner the choice of qualifying the outbound link” is a form of link spam. If your business has done this in the past, consider contacting your partners or clients. And asking them to remove or add a nofollow attribute to your links.Of course, you’ll also need to adapt your contractual template.9. Being the Victim of a Negative SEO AttackNegative SEO is the sabotaging of another site’s search engine performance.For example, an unscrupulous competitor might build spammy links to your domain with the aim of triggering a Google penalty. And overtaking your site in search results.According to Google’s John Mueller, these aren’t really toxic backlinks because they don’t have the potential to harm your site’s search performance.When a Reddit user asked what to do about a negative SEO attack, he responded like this:But some SEOs argue that Google isn’t perfect. And that it’s safer to take action against these links than rely on Google to ignore them.How to Find Bad BacklinksGoogle does a good job of ignoring the occasional low-quality backlink, but you should check for toxic backlinks if you’re concerned about your past link building activities. Or if Google has issued a manual action for unnatural links to your site.To see if you have a manual action, sign into Google Search Console. And go to “Security & Manual Actions” > “Manual actions.”If there are “No issues detected,” it could still be worth doing a toxic backlink check. To help protect your site against future penalties.If you have a manual action for unnatural links to your site, it’s crucial to find these bad backlinks. And clean them up as soon as possible. So your site can start to recover.Here’s how:Option 1: Use a Toxic Backlink CheckerThe easiest way to find bad backlinks is to use a toxic backlink checker. Like Semrush’s Backlink Audit tool.Enter your domain and click “Start Backlink Audit.”Then, follow the instructions to configure your audit. Once complete, you’ll see your “Overview” report.If you have Google Analytics, Google Search Console, or Majestic accounts, click “Integrations” to connect them. To provide more accurate results.You’re now ready to conduct an in-depth backlink analysis.Go to the “Audit” report and look at the backlinks flagged for review.The tool analyzes 45+ markers to assign each backlink a Toxicity Score (TS) from 0-100.The higher the score, the more likely the link is to be toxic.Click a Toxicity Score to see which toxic markers were found. And whether they’re classified as “Dangerous” or “Potentially dangerous.”In the “Anchor” column, you can read the backlink’s anchor text. And see which category it falls under.Bad backlinks tend to use one of two types: Money anchor text, which matches a target keyword (e.g., “best running shoes”) Compound anchor text, which contains a brand name and another word or phrase (e.g., “Amazon running shoes”)Because these anchor texts are more SEO-oriented.In the “AS” column, you can see the referring domain’s Authority Score (AS). This is a measure of the page’s overall authority reflected as a metric out of 100.The higher the AS, the less likely the backlink is to be toxic.To look at the backlink on the site where it’s located, click the icon alongside the source URL.Using all the information you’ve gathered, decide whether the backlink is toxic. And doing more harm than good for your site. If not, click the “Move to Whitelist” icon If yes, click the “Move to Remove list” iconLater, we’ll explain how to remove the bad backlinks you’ve found.TipRerun your backlink audit every month or so. To keep on top of potentially harmful backlinks.Option 2: Check Toxic Backlinks ManuallyIf you don’t have access to a toxic link checker, you’ll need to find all your backlinks. And check each one manually.You can see sites that link to yours through Google Search Console.Go to “Links” in the left sidebar.Then, click “More” in the “Top linking sites” section.From here, you can export the list of sites that link to you.Open your file in a spreadsheet. And start to look for toxic backlinks. Google Search Console provides limited data. So finding bad backlinks can be an extremely time-consuming process.To speed things up, Google recommends focusing on sites that link to you the most. Or the most recently created links.How to Remove Toxic BacklinksAfter finding a toxic backlink you want to address, contact the referring domain to request that they remove it or add the appropriate “rel” attribute (e.g., rel=\"nofollow\").If that doesn’t work, you may need to disavow the link (see below before taking any action).Let’s go over both.How to Request Link RemovalsFollow our Backlink Audit workflow above, and then go to the “Remove” report to see all the bad backlinks you flagged for removal.Click “Add” next to “Mailbox:” and follow the instructions to connect your business mailbox. This allows you to send emails from your company email address.Next, choose a backlink to tackle. (We recommend starting at the top, as results are sorted according to Toxicity Score. From highest to lowest.)And find an email address for the referring domain. When possible, the tool will provide a link to the site’s contact page and social profiles below the domain information in the table to help you.When you’re ready, click “Send” to draft your email.The tool provides a template (with placeholders) to help you draft a persuasive message.You’ll need to explain: Where the backlink is located That you want them to remove it Your reason for asking them to remove itMake sure your email is concise, clear, and friendly. So the recipient is more likely to read, understand, and act upon it.Once you’re happy with your message, click “Send and proceed to next.” You can then work through your other toxic backlinks.After closing the email editor, check the “Status” column. This will show whether your email has been sent, delivered, read, or replied to.If you haven’t received a response within a few working days, click “Resend” to draft and send a follow-up email.The icon in the “Access link” column shows whether the backlink has been removed.If your toxic backlinks aren’t removed within a couple of weeks, you might want to disavow them (but read the information on disavowal below before taking any action).How to Disavow Toxic BacklinksDisavowing links is the process of asking Google to ignore specific backlinks to your site. So they no longer impact your SEO.Google’s John Mueller (@JohnMu on X) has advised against disavowing links unless: Your have a manual action for unnatural backlinks and You bought links in the pastAt the Pubcon Austin 2023 conference, Google’s Gary Illyes (@methode on X) reportedly suggested link disavows normally do more harm than good.Image source: XSo, you should take extreme caution before disavowing links.If you want to proceed, return to your “Remove” list in Backlink Audit.Select backlinks using check boxes, then click “Disavow.”We recommend that you disavow at the domain level rather than the URL level. This allows you to catch toxic links on any duplicate pages (e.g., “example.com/toxic-page” and “example.com/toxic-page.html”). And prevent issues from reoccuring on the same site.Head to “Disavow” once you’ve completed your list, and click “Export to TXT.”Then, upload your .txt file to Google’s disavow tool.Once that’s done, return to Backlink Analytics and click “Yes, I uploaded the file.” So that the tool can recalculate your site’s Toxicity Score.If you had a manual action against your site, submit a reconsideration request through Google Search Console.Using this button in the Manual Actions report:It may take several weeks for Google to take your disavow file into account. And see any impact on your SEO results.Strengthen Your Backlink Profile with SemrushStrengthening your backlink profile isn’t just about finding and removing toxic backlinks. It’s about earning quality backlinks on relevant sites.Learn how to build ethical and effective backlinks with our link building guide.Or jump straight in with Semrush’s link building tools: Backlink Gap: See which domains link to competitors but not to you Backlink Analytics: Analyze and compare backlink profiles Link Building Tool: Find link building prospects and manage outreach campaigns",
  "headers": [
    {
      "level": "H1",
      "text": "Toxic Backlinks: What They Are & How to Find Them"
    },
    {
      "level": "H2",
      "text": "What Are Toxic Backlinks?"
    },
    {
      "level": "H2",
      "text": "9 Causes of Toxic Backlinks"
    },
    {
      "level": "H3",
      "text": "1. Paying for Links"
    },
    {
      "level": "H3",
      "text": "2. Exchanging Links"
    },
    {
      "level": "H3",
      "text": "3. Engaging with Private Blog Networks"
    },
    {
      "level": "H3",
      "text": "4. Using Link Building Bots"
    },
    {
      "level": "H3",
      "text": "5. Posting Unnatural Links on Other Sites"
    },
    {
      "level": "H3",
      "text": "6. Listing Your Business on Low-Quality Directories"
    },
    {
      "level": "H3",
      "text": "7. Creating Widgets with Links"
    },
    {
      "level": "H3",
      "text": "8. Mandating Backlinks Through Contracts"
    },
    {
      "level": "H3",
      "text": "9. Being the Victim of a Negative SEO Attack"
    },
    {
      "level": "H2",
      "text": "How to Find Bad Backlinks"
    },
    {
      "level": "H3",
      "text": "Option 1: Use a Toxic Backlink Checker"
    },
    {
      "level": "H3",
      "text": "Option 2: Check Toxic Backlinks Manually"
    },
    {
      "level": "H2",
      "text": "How to Remove Toxic Backlinks"
    },
    {
      "level": "H3",
      "text": "How to Request Link Removals"
    },
    {
      "level": "H3",
      "text": "How to Disavow Toxic Backlinks"
    },
    {
      "level": "H2",
      "text": "Strengthen Your Backlink Profile with Semrush"
    }
  ],
  "author": ""
}