{
  "url": "https://www.semrush.com/blog/types-of-digital-ads-study/",
  "slug": "types-of-digital-ads-study",
  "title": "Types of Digital Ads [Study]",
  "description": "By partnering with AdClarity, we’ve investigated ad types, ad channels and ad spend so you can plan and strategize with the kind of competitive edge that other players don’t have in your industry.",
  "content": "Have you ever wished you could peek behind the curtain and see the exact ad types your competitors are spending their advertising budget on? In our latest study, we dived into that exact question.This study looked into the advertising trends of almost 1,000 domains across various industries, with the goal of helping you benchmark your own ad strategy.By partnering with AdClarity, we’ve investigated ad types, ad channels and ad spend so you can plan and strategize with the kind of competitive edge that other players don’t have in your industry.In case you missed it, this is a follow-up to the first installment of this series—Using Competitor Ad Spending Data for Benchmarking. For even deeper insight into how your industry is advertising, watch this space for more insights to come.For now, though, let’s dive into the different types of digital ads and how their popularity fluctuates between domains and industries. If you want to check out the data on more specific competitor ad types, you can uncover detailed breakdowns of your niche competitors’ advertising campaigns with AdClarity here.Types of Digital AdsFirst, let’s define the types of digital ads that you’ll encounter in social media, display, and video advertising channels. Here’s a list of all the formats that were included in the analysis: Banner: A combination of text and images in a portrait, landscape or square format. These ad types appear in the display, social, and video channels. Carousel: A series of texts, images or videos on a cycle, combined into one ad. Carousels can appear in social and display advertising. HTML5 Animated: An interactive display ad with animated text and images or video designed to catch the eye of the viewer through motion. HTML5 Static: A static display ad that uses still images and text to catch the eye and call the viewer to action. In-stream video: A video ad that appears within other videos on social networks. Promoted account: An ad that appears like a normal post on a platform such as X, but has been bought or ‘sponsored’ by the advertiser to promote their account. Video: A video ad that might appear on the likes of YouTube or streaming services. Video Masthead: A video feature that allows advertisers to place their ads in prominent positions, such as on the YouTube home screen, across multiple devices. Our MethodologyThe three channels for digital advertising we investigated in our study were: Social (social video and display ads) Video (desktop, mobile, and in-app video ads) Display (desktop, mobile, and in-app display ads)To understand how these channels were most commonly utilized, we looked at the ad types (listed above) published by 956 domains from the top players in 13 industries in the US. The timescale stretched from January 2021 to May 2023 to allow any trends to reveal themselves over time.Discover more about our methodology in the first blog of the series here: Using Competitor Ad Spending Data for Benchmarking.Digital Ad Spending by IndustryBy way of a quick recap, we saw last time that the Retail industry was the clear leader when it came to total ad spend. At $443.4M per month, it spent 95% more than the second-biggest spender, Streaming Services, over the selected time period: Digital Ad Spending by ChannelBreaking that spending down by channel, we see right away how popular social media was across the industries, with an average adoption rate of 51%:Social Media Ad Spending DistributionIn terms of specific publishers in the social field, there was a runaway winner there, too, with Facebook attracting almost $2.5B in total spend: PUBLISHER SPEND Facebook $2,486,819,048 Instagram $589,559,266 Twitter $176,881,432 TikTok $58,984,254 This accounted for over three-quarters of total ad spend for all advertisers, with Instagram coming in a distant second place: If we bring YouTube into the mix, which AdClarity classifies as a video platform and not a social platform, we can see that it eclipsed Instagram in terms of total spend, but was still over $1B behind Facebook: PUBLISHER_DOMAIN SPEND Facebook $2,486,819,048 YouTube $1,325,080,859 Instagram $589,559,266 Twitter $176,881,432 TikTok $58,984,254 An interesting pattern reveals itself when we zoom out to see ad spend over time. While social media ad spend accounted for more than 40% of the total at all times, the levels of spend on video and display changed quite dramatically: Interestingly, though, they returned to around the level at which they started on this timescale by May 2023.Social media was the most popular channel for the Fashion, Food Delivery and Online Education industries, and the least popular for Home Décor, Pets and, perhaps surprisingly, Retail.Domains in the SaaS, Travel and Pets industries made heavy use of video to advertise themselves, but Media and Dating didn’t lean so much on the medium. Display advertising was the channel of choice for Dating, Retail and Home Décor, but this wasn’t the case in the Fashion and Food Delivery industries.You can take a look at YouTube and Facebook as publishers in more depth in the AdClarity app here, and delve into the specific advertisers and campaigns on each platform over time.Popular Ad Types by IndustryNow, let’s get into ad spending by ad type across the 13 industries. The chart below shows us how common HTML5 Static ads were almost across the board, particularly with players in the Retail and Travel industries: Streaming Services were the most likely to opt for banner ads, but the overall popularity of display ads was low. This could be because such banner ads, whether static or animated, are more often used in apps or on social media platforms nowadays, rather than on websites. Average Digital Ad LifetimeAnother useful insight for your planning and strategy around digital ads comes from the average length of time each type of ad tended to remain live.Despite being employed less frequently amongst our chosen domains, display banners stayed live for the longest at an average of 135 days. By comparison, video had a shorter shelf life of 53 days, indicating the need to roll out fresh creative more often in that format. Channel Creative Type Age (days) Display Banner 135 Display HTML5 Animated 80 Video Video 53 Social Banner 49 Display HTML5 Static 36 Display Carousel 26 Social Promoted account 25 Video Banner 21 Video Video Masthead 19 Social In-Stream Video 11 Social Carousel 10 Carousels and in-stream videos only lasted 10-11 days on social media, which could be a sign that due diligence wasn’t always paid in the research and testing phases for those ads. Videos in particular are usually more expensive to create than other media formats, so it’s crucial that the content they are presenting is thoroughly researched before including them in a social media advertising campaign.The longer lifetime of banner ads suggests that they were relied upon for broader reach in brand campaigns rather than, for instance, product-specific launches. The findings indicate that they are a good bet for long-term advertising, particularly for well-known brands that want to remain in the spotlight. Videos, in contrast, might have a greater impact in short-term campaigns when urgent sales targets need to be hit.Looking Closer with AdClarity With the insights this study has revealed, you can benchmark social media advertising against the top advertisers in your industry with a far better understanding of their overall spend levels and preferred ad types. If you want a closer analysis, AdClarity allows you to dig even deeper by searching for specific competitors and analyzing their campaigns and even their creative. You can see your competitor’s ad spending by media type, publisher, channel, and more. When you have your finger on the pulse of advertising using AdClarity, you can plan your own spend and media formats more effectively and, of course, know when and how to adjust your marketing strategy. You might look at the top banner ads for some of the world’s leading brands over time, for instance, here’s a sample of what you can see from Spotify: From there, you might want to delve into the structure of specific ad campaigns and uncover details about brand strategy, product releases and seasonal spending. This can be found easily from the ‘Top campaigns’ widget: AdClarity even lets you investigate specific ads and find out not only their dimensions and publication dates, but also how they’re performing. Take this ad from Nike, for example:With the ability to see estimations for both impressions and spend of an ad, you can estimate your competitor’s CPM for their ad campaigns as well.You might find that some brands, such as Tiffany & Co. spend most of their advertising budget on video, especially when influencers like Beyoncé are involved: Whatever you need to find out about your competitors’ advertising habits, AdClarity is there for you. Try it today to get planning for advertising success tomorrow—you can find it in the Semrush App Center to get started.",
  "headers": [
    {
      "level": "H1",
      "text": "Advertising Trends: The Most Popular Types of Digital Ads [Study]"
    },
    {
      "level": "H2",
      "text": "Types of Digital Ads"
    },
    {
      "level": "H2",
      "text": "Our Methodology"
    },
    {
      "level": "H2",
      "text": "Digital Ad Spending by Industry"
    },
    {
      "level": "H2",
      "text": "Digital Ad Spending by Channel"
    },
    {
      "level": "H2",
      "text": "Social Media Ad Spending Distribution"
    },
    {
      "level": "H2",
      "text": "Popular Ad Types by Industry"
    },
    {
      "level": "H2",
      "text": "Average Digital Ad Lifetime"
    },
    {
      "level": "H2",
      "text": "Looking Closer with AdClarity"
    }
  ],
  "author": ""
}