{
  "url": "https://www.semrush.com/blog/types-of-backlinks/",
  "slug": "types-of-backlinks",
  "title": "Types of Backlinks: Which Ones Help Your Website?",
  "description": "Not all types of backlinks are valuable. Learn which ones boost your search rankings. And which to avoid.",
  "content": "What Are Backlinks?Backlinks are links your website gets from other websites. They’re called “backlinks” because they “link back” to your website.People use backlinks to visit other relevant pages. And search engines use backlinks to: Follow to the linked page. And understand its contents. Recognize that the linked page is likely reputable. And may be deserving of higher rankings.Why Do Backlinks Matter in SEO?The more backlinks your website has from reputable sources, the more authoritative it can seem to search engines.Which may help it rank higher.Our Ranking Factors study found that domains with high-ranking pages generally have more backlinks than domains with lower-ranking ones.And higher search rankings can lead to more organic traffic, leads, and sales. What Makes a Backlink Valuable?Backlinks can improve your search rankings. If they meet these conditions: The backlink is a dofollow link: Dofollow links are standard links. Meaning they don’t contain “rel” attributes that discourage search engines from treating the links as endorsements. (We’ll cover this more later.) The backlink is from an authoritative website: If a highly reputable website links to a page, search engines may also consider that page highly reputable. And rank it higher. The backlink’s anchor text accurately describes the linked page: Anchor text is the text users click to visit a link. Backlinks with descriptive anchor text help search engines better understand linked pages. The backlink is found on relevant websites: Search engines may treat a backlink as spam if the website it’s on has little relevance to the page it links to. Like a gardening website that links to a page on trucks for no apparent reason. The backlink naturally reads as part of its surrounding content: Search engines may view links disconnected from the overall content as spam. One example is a link that appears at the end of a paragraph without being part of a sentence.Where a backlink comes from—editorial publications, forums, social media, etc.—may also affect its value.We’ll explain that more later. But first, let’s go over the main types of backlinks. The 4 Main Types of BacklinksDofollow BacklinksDofollow backlinks (or follow backlinks) are links without a “rel” attribute in the HTML. By default, all hyperlinks are dofollow. If you link to someone’s website but don’t change the HTML code, it would be considered a dofollow backlink.Dofollow backlinks indicate you endorse the linked page. And encourage search engines to discover and possibly rank the linked pages.Dofollow links look like this in HTML code: <a href=\"https://example.com/\">Visit ACME’s homepage</a>You should use dofollow backlinks when: You’re creating internal links, which are links to other pages on your website. To help search engines discover and index these pages. You’re linking to another website’s resource because you find it helpfulNote“Dofollow” and “follow” are unofficial backlink terms. But the SEO community has begun to use them to differentiate between the other types. Nofollow BacklinksNofollow backlinks are links with the rel=“nofollow” attribute. Which discourages search engines from following the linked page. Or treating the link as an endorsement for higher rankings.Nofollow links look like this in HTML code:<a href=\"https://example.com/\" rel=\"nofollow\">Visit ACME’s homepage</a>Making your backlink nofollow suggests to Google you don’t want to associate your site with the linked page. Like if you’re linking to a competitor’s page. Sponsored BacklinksSponsored backlinks (also known as paid links) contain the rel=“sponsored” attribute. And indicate that the person inserting the link may get paid for doing so. Here’s an example of a sponsored backlink:<a href=\"https://example.com/\" rel=\"sponsored\">Check the latest flight prices (affiliate link)</a>Search engines generally don’t take sponsored backlinks into account when ranking pages.Why?Because they view these links as less trustworthy.After all, the person who added the link could have done so out of financial gain. And not because they genuinely thought it was helpful.Further reading: How Do Affiliate Programs Work?UGC BacklinksUGC backlinks are backlinks in user-generated content. Meaning non-sponsored content that individuals—as opposed to brands—create on their own.Examples of UGC are: Social media posts Forum posts Blog post commentsUGC backlinks have the rel=“ugc” attribute. And they look like this:<a href=\"https://example.com/\" rel=\"ugc\">Visit my website</a>UGC backlinks discourage search engines from following the linked pages. Or treating them as endorsements.This is to combat link spam.For example, a person trying to increase their website’s rankings might spam a forum with dozens of low-quality comments that include links to their website.So, if you run a blog where users can submit UGC, mark their links with the “ugc” attribute.Pro tipUse Semrush’s Backlink Audit tool to check for spammy backlinks to your website. And contact site owners right from the tool to ask them to remove them.Backlinks That Can Boost Your SEOHere are some kinds of backlinks that are likely to positively impact your SEO performance. Note that these are all generally dofollow backlinks. Editorial BacklinksEditorial backlinks are backlinks from publications. Meaning websites (like news sites and blogs) that produce content primarily to inform or educate.Editorial publications may link to your content if it enhances the discussion. Or if they’ve cited it as a source.For example, Bankrate’s mortgage calculator received a backlink from online magazine Slate:Receiving dofollow links from editorial publications can help boost your rankings. But the publication’s authority and relevance also matter.The more respected the publication is within your industry, the more weight search engines will place on its ranking endorsement.Because these backlinks are so valuable, it’s a good idea to understand how much of your backlink profile they make up.Open Backlink Audit, enter your domain name, and click “Start Backlink Audit.”After you follow the configuration steps, you’ll be taken to the “Overview” report. Look at your “Overall Toxicity Score” to get a sense of how healthy your backlink profile is.This one is labeled as “Low,” which means most of its backlinks come from reputable sources. But if yours says “High” or “Medium,” that suggests you should prioritize gaining more high-quality backlinks. We’ll go over a few ways to do that later in this article. Image BacklinksImage backlinks are links from images. Or text linking to the image’s source or creator.For example, Space.com included a photo credit in one of its articles: Now, the photographer has a backlink from Space.com. Potentially helping to boost their site’s authority. And rankings.Video BacklinksVideo backlinks are links to a video’s source or creator.For instance, The Claridge Hotel has provided video credits on this page:These credits link to the respective video creators’ websites. So, they now have backlinks from the hotel’s website.Backlinks That Are Less Likely to Help Your SEOThese backlinks won’t help to build your authority in the way the above ones will. But they may still be beneficial.Guest Post BacklinksGuest post backlinks are backlinks from guest posts. Which are articles you write for someone else’s website or blog.Guest posting can help you reach a wider audience and promote your brand. And gain backlinks. For example, when a writer contributes a guest post to Forbes, they receive a backlink to their website in the author bio.But know that Google recommends marking guest post backlinks as nofollow.This is because the contributor has intentionally added these links to their guest post. Making the endorsements less authentic.But nofollow guest post backlinks can still have value. Because they can send traffic and leads to the contributor’s website. And even increase sales. Press Release BacklinksPress release backlinks are links in press releases that organizations share with the media to announce new business developments. And they often include links to additional information.For example, this press release from web accessibility solutions provider UserWay mentions that its solutions are now available on Semrush’s App Center—which it links to.But as with guest post links, these links are often nofollow ones. So, they may have little impact on your search rankings.That said, they can still drive referral traffic to your site. And possibly lead to more branded searches in the future.Further reading: 6 Tips to Make Your Press Release SEO Friendly in 2024Comment BacklinksComment backlinks are links shared in forum, blog, social media post comments.Here’s one in the comment section of a One Dog Woof blog post:Online comments are considered UGC. So, websites often mark these links with the rel=“ugc” attribute. And sometimes make them nofollow as well.Generally speaking, it’s best to include links in comments only when you think it genuinely provides helpful information users are likely to appreciate.Directory BacklinksDirectory backlinks are links from online directories like Google, Yelp, and Tripadvisor. For example, this Tripadvisor listing for Spanish restaurant Arroceria Maribel includes a backlink to its website.Links from directories don’t generally boost your SEO the way editorial backlinks do, but they can provide valuable referral traffic. And Google looks for consistency within the information you include in your listings to verify that your site is trustworthy. Which can improve your local SEO results. Pro tipUse Semrush’s Listing Management tool to automatically list your business on dozens of directories. And create directory backlinks to your website at the same time.Social Media BacklinksSocial media backlinks are links from social media profiles and posts to other websites.For example, healthy drink retailer Innocent added a link to its website in its Instagram bio:Social media platforms tend to add the rel=“nofollow” attribute to backlinks on their platforms. So, these backlinks may be less valuable.But they lead to more referral traffic. And lead to more recognition that could impact your search visibility later on.Further reading: A 6-Step Guide to Social Media for Small BusinessesBacklinks That Can Harm Your SEOBacklinks that aim to manipulate search rankings can hurt your performance.Paid Dofollow BacklinksYou should never pay for dofollow backlinks. This violates Google’s spam policies. And may result in a penalty that decreases your search engine visibility.And know that the payment need not involve money. Giving a person a free product so they’ll write about it—and link to your website—also counts.If you collaborate with a website for sponsored content, those links should be nofollow or sponsored.Spammy Comment Section or Forum Post BacklinksComments and forum posts with unhelpful backlinks or an excessive number of backlinks aren’t going to help your rankings. They might even harm your SEO performance if it’s clear that the poster is trying to manipulate search engines.If you want to include backlinks in your forum posts and comments, add only those that truly provide value to the discussion. And sparingly.And keep in mind that forums may mark your backlinks as UGC anyway. Hidden Widget BacklinksWidgets are apps users can install on a website by inserting a few lines of code. Like this weather widget from Tomorrow.io on The Shoals Now!’s website:If you create widgets like this, they shouldn’t contain invisible links back to your site from websites that install your widget.But your widget can link to your website as a form of credit. As long as the link is visible and uses the rel=“nofollow” attribute. Like Tomorrow.io’s widget.This way, the websites that install your widget won’t inadvertently endorse you.How to Acquire Valuable BacklinksWant to get useful, non-spammy backlinks?Try these tips:Publish Useful ContentPublishing original, high-quality research can help you get dofollow backlinks from editorial publications. Because they frequently cite data and experts in their articles and link back to the original source.Take this pricing study from OpenView Venture Partners, for example.According to Semrush’s Backlink Analytics tool, the study has gotten more than 170 backlinks since its publication in February 2023.And 147 of these are dofollow backlinks.Creating infographics is another option for getting backlinks from other sites. Here are a few infographic best practices that may improve your rankings outside of earning backlinks: Give your infographics descriptive filenames like “content-marketing-funnel.png.” Not “Infographic1.png.” Add alternative (alt) text that provides more information on the image Create an image sitemap to help search engines discover and rank your images for search queriesBuild Relationships with Other Website OwnersGet to know others in your industry—especially those who run authoritative websites. This way, they’ll be more receptive to requests to include links to your website.Find high-authority websites to build relationships with using Semrush’s Link Building Tool.Enter your domain and an optional project name.Then, click “Create project.”Then, follow the prompts to configure your project.When the tool has finished running, go to the “Prospects” tab to see a list of domains you can reach out to for backlinks.The “AS” column tells you each domain’s estimated Authority Score. A higher score indicates the domain is more authoritative. And that a backlink from it may improve your rankings more.And the “Rating” column provides the tool’s rating (out of five) for the domain.Consider both of these metrics to prioritize domains.Use the checkboxes on the left to select the domains you want to approach for backlinks. Then, click “To In Progress” at the top of the list to add the selected domains to your “In Progress” list.Next, select the “In Progress” tab.Start researching these websites to see what types of content they publish. And review your own content to find pages that might be useful to them.Once you do, use the “Contact” button to draft a personalized email sharing your content and asking for a link. The tool will then track your progress.How to Monitor Your BacklinksHow many types of backlinks have you received? And where are they coming from?Find out by using these backlink tools.Google Search ConsoleGoogle Search Console (GSC) is a free tool for website owners to get basic data on their website traffic and performance. Among various features, it can help you find backlinks.Here’s how to use it:Set up GSC for your website if you haven’t already. After that, click “Links” in the left sidebar.Scroll the “Links” page until you see the “Top linking sites” section. Click “More” at the bottom of this section to see: The detected number of backlinks for your website. This figure includes only unique links. GSC counts multiple instances of the same backlink only once. A list of websites that have linked to yours the mostClick any website on the list to learn: The number of backlinks you’ve gotten from that website The number of pages belonging to you the other website has linked to Which of your pages the website has linked toSemrush’s Backlink Analytics ToolSemrush’s Backlink Analytics tool offers detailed reports on your website’s backlink profile. This includes data unavailable in GSC like: Your backlinks’ anchor texts Whether a backlink is dofollow or not Whether a backlink is active or lostType your website domain into the tool and click “Analyze.”When it’s finished running, click the “Backlinks” tab on the top menu.You’ll see a summary of your website’s number of backlinks. And these backlinks’ types and “rel” attributes.Scroll down to view your backlinks. For each backlink, you’ll get details like the URL and the Authority Score of the page that linked to you. And the backlink’s anchor text.If you’ve lost a backlink, the tool will share why.Click “Follow” to view just your dofollow backlinks.Studying which pages have garnered the most dofollow backlinks can inform the content you create in the future. Which you can pitch to the website owners you’ve built relationships with.Create a Stronger Backlink ProfileBacklinks from reputable websites are incredibly valuable for improving your rankings.And you can improve your backlink profile with Semrush’s suite of backlink tools.Sign up for a Semrush account to try them for free.",
  "headers": [
    {
      "level": "H1",
      "text": "Types of Backlinks: Which Ones Help Your Website?"
    },
    {
      "level": "H2",
      "text": "What Are Backlinks?"
    },
    {
      "level": "H2",
      "text": "Why Do Backlinks Matter in SEO?"
    },
    {
      "level": "H2",
      "text": "What Makes a Backlink Valuable?"
    },
    {
      "level": "H2",
      "text": "The 4 Main Types of Backlinks"
    },
    {
      "level": "H3",
      "text": "Dofollow Backlinks"
    },
    {
      "level": "H3",
      "text": "Nofollow Backlinks"
    },
    {
      "level": "H3",
      "text": "Sponsored Backlinks"
    },
    {
      "level": "H3",
      "text": "UGC Backlinks"
    },
    {
      "level": "H2",
      "text": "Backlinks That Can Boost Your SEO"
    },
    {
      "level": "H3",
      "text": "Editorial Backlinks"
    },
    {
      "level": "H3",
      "text": "Image Backlinks"
    },
    {
      "level": "H3",
      "text": "Video Backlinks"
    },
    {
      "level": "H2",
      "text": "Backlinks That Are Less Likely to Help Your SEO"
    },
    {
      "level": "H3",
      "text": "Guest Post Backlinks"
    },
    {
      "level": "H3",
      "text": "Press Release Backlinks"
    },
    {
      "level": "H3",
      "text": "Comment Backlinks"
    },
    {
      "level": "H3",
      "text": "Directory Backlinks"
    },
    {
      "level": "H3",
      "text": "Social Media Backlinks"
    },
    {
      "level": "H2",
      "text": "Backlinks That Can Harm Your SEO"
    },
    {
      "level": "H3",
      "text": "Paid Dofollow Backlinks"
    },
    {
      "level": "H3",
      "text": "Spammy Comment Section or Forum Post Backlinks"
    },
    {
      "level": "H3",
      "text": "Hidden Widget Backlinks"
    },
    {
      "level": "H2",
      "text": "How to Acquire Valuable Backlinks"
    },
    {
      "level": "H3",
      "text": "Publish Useful Content"
    },
    {
      "level": "H3",
      "text": "Build Relationships with Other Website Owners"
    },
    {
      "level": "H2",
      "text": "How to Monitor Your Backlinks"
    },
    {
      "level": "H3",
      "text": "Google Search Console"
    },
    {
      "level": "H3",
      "text": "Semrush’s Backlink Analytics Tool"
    },
    {
      "level": "H2",
      "text": "Create a Stronger Backlink Profile"
    }
  ],
  "author": ""
}