{
  "url": "https://www.semrush.com/blog/understanding-google-s-august-update/",
  "slug": "understanding-google-s-august-update",
  "title": "Understanding Google’s August 2024 Core Update: Key Insights and Impact",
  "description": "Explore the key details of Google‘s August 2024 Core Update and its impact on search rankings.",
  "content": "On August 15th, Google announced it was launching a Core Update for August 2024. While Google originally said it would take a month to complete, the update’s roll-out ended on September 3rd, lasting for a total of 20 days. Today we released the August 2024 core update. It continues our work to improve the quality of our search results by showing more content that people find genuinely useful and less content that feels like it was made just to perform well on Search.https://t.co/T6Qt0JUoWt— Google Search Central (@googlesearchc) August 15, 2024There’s a lot to take in with this update due to Google’s extended pre- and post-rank search volatility, as well as the update’s overall context. Let’s dive in!The Context Around Google’s August 2024 Core UpdateThis Core Update was released following a contentious update in March 2024. That contention began with the shuttering of Google’s Helpful Content Update (HCU) process, as “helpfulness” was being ascertained by the company’s core algorithm itself, not a separate ranking system. While not a contentious move per se, the March 2024 Core Update didn’t produce any rank recoveries for sites hit by Google’s September 2023 Helpful Content Update (the previous most-recent HCU). This lack of recovery became a sore point for many site owners and SEO managers. As outcry over the March update mounted, Google opened a feedback form, and even went so far as to meet with individual sites hit by the update. Upon the release of the August 2024 Core Update, Google was quite conscious of the issues with previous rank recoveries. Google Search Advocate John Mueller noted: \"[Google’s] latest update takes into account the feedback we’ve heard from some creators and others over the past few months.”Three days after the August 2024 Core Update completed, Danny Sullivan spoke to SERoundtable’s Barry Schwartz at length regarding the level of rank recovery seen during the update. During this discussion, Danny noted the lack of full recovery:“I think the changes have helped some of those sites, but generally have not brought those sites all the way back up to the level they were back to – say, last September or so.” As you can see below, while the site in question saw an incredible gain during the August 2024 Core Update, going from essentially 0 organic traffic to close to a million monthly visits, it is nothing compared to where they were prior to the September 2023 HCU.The scale of any reversal depends on the site. Taken with Danny’s statement, though, it doesn’t seem like the recovery will satisfy most sites impacted by the September 2023 HCU issue. The owners of these websites feel they made improvements that should result in better rankings. Analyzing the Impact and Trends of the August 2024 Core UpdateGetting a grasp on the update’s overall and aggregate impact is a bit complicated. Much of this complication comes from the levels of rank volatility that surrounded the update, with extreme volatility levels noted for prolonged periods both before and after the update deployed. This stands in stark contrast to the March 2024 Core Update, which saw clearer and more distinct volatility trends: As seen above, Google’s August 2024 Core Update already came in “hot” with the volatility that preceded, giving the update a more volatile starting point. Unlike the March 2024 Core Update, August’s changes presented a significantly-prolonged period of constant volatility. It’s no surprise, then, that the August 2024 Core Update shows higher levels of peak volatility than back in March, as the volatility around the update was already at a high level:This unique environment of high volatility also makes it difficult to assess the increase in volatility seen during the August 2024 Core Update, and makes it impossible to compare to its predecessor from March:Astonishingly, because the baseline period prior to the update was so volatile, some verticals saw less volatility during the update than before it. I don’t think I recall ever seeing anything like that before! Again, that isn’t to say the update did not result in a tremendous amount of increased volatility. Rather, it’s simply difficult to pinpoint that specific volatility and separate it from its wider context. This is all the more true as the volatility seen after the update has resulted in some significant rank reversals, as can be seen below: To pin this down a bit more, we compared the volatility seen during the August update to an earlier baseline period with more “normal” volatility levels. Now, this process is inherently tainted from a data collection standpoint, as the way the data was collected in March no longer directly correlates with how it was collected in August. That said, from a pure “numbers” point of view, we are now more accurately comparing levels of volatility, since the pre-update levels in August were an aberration. The numbers now show that there isn’t a huge difference in volatility change between the March and August 2024 Core Updates. What makes this data point stand tall, at least for me, is that it aligns with the data around the dramatic amount of fluctuations in the rank. For example, during the August 2024 Core Update, there was an average position loss of 2.63 positions and an average gain of 2.66 positions:There were some outliers here with the Science, Real Estate, Arts & Entertainment fields, as well as the Books & Literature verticals seeing smaller fluctuations on average. This is occuring while the Food & Drink and Law & Government verticals saw higher-than-average rank movement. (I’m leaving aside the News vertical, which is always higher than average.) The average positions gained and lost are very similar to the overall average seen back in March, where there was both an average position gain and loss of 2.3. The two updates were also similar in their tendencies to see new URLs ranking at the top of the SERP from beyond position 20. 3% of URLs ranking in the top 5 spots following the March update came from beyond position 20. The August update presented a marginal difference, with 3.3% of URLs ranking in the top 5 spots having ranked beyond position 20 prior to the update. The same holds true when looking at the top 10 results, with both the March and August 2024 Core Updates yielding similar data: As such, from the perspective of “How drastic were the ranking shifts?”, the August 2024 Core Update seems to be very close in range to what we saw back in March. Increasing TensionsWith the August 2024 Core Update not producing the recovery many sites feel was deserved, the stage is set for current industry tensions to continue (if not intensify). Google did not release a feedback form with this core update as it had back in March. However, Danny Sullivan seemed to indicate that this was because Google is still combing through the feedback from March. Hopefully, as Google continues to review user feedback, there will continue to be dialogue between website owners and the company’s search engineers. Ranking losses can have real and serious impacts on businesses, and I think the conversations Danny has started with sites is healthy for both sides as Google steadily works on algorithmic improvements.",
  "headers": [
    {
      "level": "H1",
      "text": "Understanding Google’s August 2024 Update"
    },
    {
      "level": "H2",
      "text": "The Context Around Google’s August 2024 Core Update"
    },
    {
      "level": "H2",
      "text": "Analyzing the Impact and Trends of the August 2024 Core Update"
    },
    {
      "level": "H2",
      "text": "Increasing Tensions"
    },
    {
      "level": "H6",
      "text": "Most popular pages"
    },
    {
      "level": "H6",
      "text": "SEO Checklist: 41 Tips to Optimize Your Website"
    },
    {
      "level": "H6",
      "text": "How to Perform a Complete SEO Audit (in 14 Steps)"
    },
    {
      "level": "H6",
      "text": "A Beginner’s Guide to Keyword Search Volume"
    }
  ],
  "author": ""
}