{
  "url": "https://www.semrush.com/blog/unnatural-links/",
  "slug": "unnatural-links",
  "title": "Unnatural Links: What They Are and How to Fix Your Link Profile",
  "description": "Learn how to identify unnatural links and fix your website’s link profile for improved online visibility.",
  "content": "What Are Unnatural Links?Inbound or outbound website links that have the sole purpose of improving a site’s organic search rankings are called unnatural links. Purchased, exchanged, or created links may—intentionally or unintentionally—deceive search engines into believing a website has more authority than it actually does. Such links don’t add value to site visitors.Because search engines want to give users the best possible experience and search results, they penalize websites that use unnatural links to gain added online visibility.Imagine searching for “best pizza in NYC.” One of the first few organic search results you click on contains the following text:“The best pizza in NYC is found in pizzerias across the city. New York has a long history of outstanding pizza production.”The above example contains the relevant keyword. But it fails to provide meaningful information and address your specific search intent: to identify the best pizza you can order in the city. In this case, the keyword and the outbound links to popular websites like nyc.gov are likely a ploy to rank well in online searches.That’s why search engines like Google come down hard on websites that use unnatural links, also known as “link spam.”Google uses links as an important factor in determining the relevancy of webpages. Any links that are intended to manipulate rankings in Google Search results may be considered link spam. This includes any behavior that manipulates links to your site or outgoing links from your site.How Unnatural Links Impact SEOUnnatural links hurt your website’s SEO performance. Link quality is a factor in Google’s ranking algorithm, so including unnatural links can hurt your site rankings. Reduced visibility in search results makes it more difficult for users to find your content. Which can decrease organic traffic to your site. After six years running, a website woke up to an unnatural links warning on April 1, 2023 (not an April Fool’s joke). The penalty Google issued had far-reaching consequences.We analyzed the website in question and found that organic traffic fell from 238,759 to 23,268 between March and April 2023.Similarly, there was a steep drop in organic keyword positions. The 1,400-plus keywords occupying the top three Google spots before the manual warning fell to 113.If you aren’t careful about the quality of your inbound and outbound links, your site could also face a similar unnatural links penalty from Google.Unnatural Links and Google PenaltiesGoogle provides linking guidelines in its spam policies to ensure high-quality content and user experience. If your site is in violation, it could receive a manual action, or a penalty. NoteIt’s called a “manual” action because Google’s team manually reviews sites it suspects of unnatural linking.Google penalizes sites that engage in unnatural, manipulative link practices that solely aim to boost a site’s rankings. Namely:If a site has a manual action, some or all of that site will not be shown in Google search results.Meaning either a drop in search rankings or outright removal from Google’s index.When evaluating sites for unnatural links, Google focuses on link quality. It doesn’t directly consider the age of the links, so older bad links may also harm your site.Google also doesn’t take a domain’s authority score or PageRank into consideration. Which means that even reputable websites are subject to a manual warning for unnatural links.Further reading: A Comprehensive Guide to Understanding Google PenaltiesGoogle Link Spam Update ExplainedGoogle launched a link spam update in December 2022 to curb the impact of unnatural links in search results. The update uses SpamBrain, an AI-based spam prevention system that Google has been perfecting since 2018. It’s trained to detect direct and indirect spam at scale. In addition to potentially considering the above “best pizza in NYC” example as spam, it can also: Flag sites that buy links Expose external websites that pass a lot of unverified outbound linksGoogle Search Central indicated at the time: Our algorithms and manual actions aim to nullify these unnatural links at scale, and we will continue to improve our coverage.In fact, the search engine has already made four core updates since then—in March, August, October, and November 2023.As Google gets better at detecting unnatural links, the risks and consequences of using them increase significantly.Common Types of Unnatural LinksHere are seven types of unnatural links to avoid at all costs.1. Blog Comments or Forum PostsUser-generated spam, like blog comments or forum threads on other websites that promote and link back to your website, may count as unnatural links. Avoid leaving blog comments or forum posts like this one:2. Spam ListingsEnsure your online business or brand isn’t misrepresented. Spam listings are business profiles that attempt to gain an unfair advantage in search results through keyword stuffing, virtual or incorrect addresses, and other questionable tactics.Whenever you find a fake listing, take the necessary steps to delete it. Otherwise, it can cause your legitimate business to appear illegitimate.3. Low-Quality DirectoriesStay away from generic online business directories that claim to improve your search rankings. They may have low-quality, hidden keyword links that signal spam to search engines.A low-quality directory may have any of the following characteristics: It automatically accepts all submissions without any criteria It’s not user-friendly and is difficult to navigate, etc. It’s not secure (it’s HTTP rather than HTTPS)Don’t encourage these directories to use your business name. Limit your website’s presence to high-quality directories like Google Business Profile, Reddit, and Yelp. Additionally, consider building links for your website on relevant industry sites. For instance, you might want to list a pizzeria on a site like OpenTable, a reservation site that allows you to list your business so customers can find you.4. Link ExchangesA link exchange is when you get a link from another website and you give that site a link in return. Google deems exchanging links with other websites to be bad practice because the strategy isn’t natural and organic. The search engine is even more likely to penalize bulk link exchanges—a large-scale version that involves many sites linking to each other. Especially when they concern websites from unrelated industries. Because Google values contextual relevance, links between unrelated topics and sites can raise suspicion.To inform Google about your relationship with a linked page, qualify all known links using the rel attribute. For example, a guest post or paid promotion containing a link exchange must be qualified with a rel=\"sponsored\" or rel=\"nofollow\" tag. These tags will tell Google not to follow—and potentially flag—those specific links.Further reading: Nofollow Links vs. ‘Follow’ Links: All You Need to Know5. Poor Quality PBNsPrivate blog networks (PBNs) are websites that accept money for providing backlinks to improve search rankings for your website. They may offer a temporary SEO boost, but any influence is likely short-lived. Why?Because Google’s algorithms are good at detecting manipulation. Plus, the consequences of using a PBN can involve a Google penalty or outright de-indexing.Searching online for “PBN links for sale” shows many such websites out there.Important: Avoid engaging with PBNs that advertise link-building services for a fee.6. Sitewide LinksSitewide links are links that appear on every page of a website. Most websites have a navigation and footer with sitewide links to products, services, about and contact information, etc., to help users and search crawlers navigate the content. For example, Semrush uses the following sitewide links in its footer:John Mueller, Search Advocate at Google, indicates that the search engine doesn’t automatically interpret sitewide links as unnatural:In general, if these are normal links—organic links—that are happening that are pointing at your content, then I would just let them be. That’s the way the internet works. People link to your content.That said, too many links can make your site or page seem spammy or cluttered—which may overwhelm visitors. To prevent people from leaving, use sitewide links sparingly in the header and footer of your website. These sections have a predictable position: their links enable sitewide navigation.The body of a page is where the content resides. Here, sitewide links can clutter the layout and distract from the messaging.7. Automatically Generated LinksSpammers can intentionally lower the credibility of your website by posting automatic links. A spammer is someone who engages in unwanted, manipulative activities to cause harm or promote their content.Consider this Search Console Help poster’s question on how to remove harmful auto-generated links from a website. The solution? Beef up website security to avoid bad backlinks to your pages. Otherwise, your website may suffer a link penalty from Google.How to Find Unnatural Links in Your Link ProfileIdentify unnatural links that jeopardize your website’s link profile by using Semrush’s Backlink Audit Tool. Here’s how.Set Up Semrush Backlink AuditLog in to your Semrush account and select Backlink Audit.If this is your first time using Semrush, sign up for a free trial, enter your domain, and click “Start Backlink Audit.” If you’re running an audit on an existing domain (or project) already in Semrush, click the “Set up” button to determine your audit parameters. To add a new domain, click “+ Create project.” Then, enter the website address and project name (optional). Click “Create project.”The tool will now ask you to choose your audit parameters. For most websites, this is the default “Campaign Scope” option of “Root domain.” Other optional audit settings in the left navigation include: Brand settings: Enter and track your official brand name—helpful if your domain name is different from your brand name Domain categories: Indicate the themes (categories) your domain is associated with, ranging anywhere from Arts to Travel. This allows the tool to provide more accurate results. Target countries: Select the countries associated with your business or audience. So the tool can better understand if backlinks from certain countries are relevant.When you’re ready, click “Start Backlink Audit” to continue. Depending on the size of your site, it may take several minutes to run the audit. A status bar will indicate its progress. You can leave this page and return to it later. When the audit is complete, click the domain to see more details. Analyze Link Quality and RelevanceRelevant, high-quality links boost your site’s SEO ranking and contribute to a better user experience.NoteLink quality refers to the credibility and trustworthiness of the websites that link to your site. Relevance refers to how closely a link aligns with the content of the page it points to.Backlink Audit provides an overview of all the links to your site. Categorizing them as toxic, potentially toxic, and non-toxic.You also get an “Overall Toxicity Score” based on the percentage of your toxic backlinks—inbound links that can harm your site’s visibility in search engine results pages (SERPs).Further reading: Toxic Backlinks: What They Are & How to Find ThemSemrush scores websites with 10% or more toxic links as highly toxic. Sites with toxic links from 3% to 9% indicate a medium toxicity score. The lowest score applies to sites with less than 3% toxic links.The above report shows that our example website contains 283 toxic links and 780 potentially toxic ones. Click on the red part of the score bar to go to the “Audit” section, where you’ll see the list of toxic links and their specific details.Spot Patterns of Unnatural LinksWhen analyzing backlinks, Google looks for repetitive or unusual linking patterns—such as PBNs, low-quality directories, and blog comments. These often indicate manipulative practices rather than natural links. Backlink Audit helps you investigate flagged links so you can quickly spot any that meet these suspicious patterns. For instance, the tool automatically detects money and compound anchor texts that send strong spam signals. You can investigate each toxic link in detail in the “Audit” section of the report.Here, you’ll be able to view the following information for each backlink: Anchor: The clickable text in a backlink Authority Score (AS): Semrush’s proprietary metric for the domain’s reputability. It accounts for the number and quality of backlinks, organic search traffic, and overall authenticity. Toxicity Score (TS): Measures the probable risk of a particular backlink using a 100-point scale, from 0 (good) to 100 (very toxic)If you hover over the TS, you’ll get a glimpse of the “Toxic Markers” for each flagged link. Backlink Audit considers over 45 criteria to calculate toxicity. This assessment helps you organize your backlinks into three lists: “Whitelist,” “Remove,” and “Disavow.” To indicate your intended action for each link.TipRerun your backlink audit every month to monitor potentially harmful backlinks.Monitoring your backlinks with regular audits helps you: Maintain a healthy link profile Ensure your backlinks come from reputable and relevant sources Identify and remove low-quality or spammy links that might harm your site’s credibility Optimize your link-building strategy and improve your site’s search visibilityHow to Remove Unnatural Links From Your Link ProfileOnce you’ve pinpointed unnatural links to your website, you can proceed to either remove or disavow them. Here’s how.Contact Webmasters for Link RemovalAfter you identify the source of the unnatural link, contact the website owner or webmaster to request its removal. Two methods to do this are: Visit the website and look for a “Contact Us” link or an email address Use a tool like Whois to find registration details about the website and corresponding contact informationProvide enough context and information in a brief email. Also, send screenshots of the offending links and the correct URLs.There are no guarantees that the webmaster or site owner will honor your request immediately. Budget for a few follow-up messages.You can easily remove links using Backlink Audit. Click the checkbox to the left of a link, then hit the “Remove” button. Select “Domain” to get rid of links from the same domain. Or “URL” to remove a single, specific link. Click “Move to Remove” to finalize your action. You’ll now be able to find these links in the “Remove” list we mentioned above.Click the “Mailbox: Add” link at the top of any Backlink Audit view to specify an email address you want to send your message from. Next, select the email provider you want to connect with. Now, send a bulk removal request email to all the web admins for whom you have email IDs. The tool also lets you send follow-up emails.Monitor Removal ProgressMake sure you follow up and monitor the progress of your link removal efforts. This includes confirming that webmasters have eliminated the links as requested, monitoring how link removals affect your site’s performance, and identifying persistent issues.Manual monitoring of several emails across different web admins can be difficult to manage. The “Remove” tab in Backlink Audit makes this process efficient. The “Status” column has four category labels to indicate the progress of each removal request email: Not sent Sent Opened RepliedGrouping emails this way helps you take the appropriate next step for each email.Finally, Backlink Audit also gives you a report of all successfully removed links. What you’ll need to deal with at this stage are the links that still await removal.Use Google’s Disavow Tool If your link removal requests don’t work, you have the option to disavow unwanted backlinks using Google’s Disavow Links tool. Disavowal instructs Google not to consider the links you indicate when it crawls your site. The search engine won’t consider your disavowed backlinks the next time it checks for link spam.Important: Only disavow links when absolutely necessary, if removal isn’t a possibility. Here’s what Google says about it:To disavow, prepare a .txt file with your list of unwanted backlink URLs. Go to the Disavow Links tool page and select your property (domain). Then click the “Upload disavow list” button to upload your file.Further reading: Check out our guide on How to Disavow Links for step-by-step instructions.You can also use Semrush’s Backlink Audit. Start by selecting all the backlinks you want to disavow from the “Audit” section. Choose between “Domain” and “URL,” then click “Move to Disavow.” This action doesn’t automatically disavow the links. You must still export a .txt file and upload it to the Google tool.TipYou can only have one disavow file per property, so you’ll need to update and replace your old list if you want to disavow new URLs. But you can’t do that directly in Google’s Disavow Links tool. Save your original .txt file, add any new bad links as you go, and re-upload it to the tool when needed.Best Practices for Organic Link BuildingAddressing unnatural links is only one part of ensuring your website maintains a healthy backlink profile.Here are a few ethical, organic link-building practices that enhance your site’s SEO without risking penalties: Outreach: Contact relevant websites and influencers to ask for a natural backlink. Use a tool like Semrush’s Link Building Tool to find the right prospects. Become a source: Position your brand as a trusted source and authority for reporters, journalists, and bloggers Broken link building: Find broken external links on other websites in your niche. Reach out and recommend changing the link to point to your content instead. Linkable assets: Create helpful resources like infographics, original research, and in-depth guides Unlinked brand mentions: Find mentions of your brand on other websites that don’t link to you. Reach out to ask for a link. Examine competitor backlinks: Replicate the same (healthy) link-building strategies as your competitorsFix Your Backlink Profile With SemrushGoogle usually doesn’t provide further context when issuing an unnatural links warning. So the answer to the below question or similar ones is a resounding “No.”With the click of a button, a tool like Backlink Audit can help you detect what might trigger an unnatural links warning from Google. The tool identifies all your toxic backlinks.The Link Building Tool can complement your efforts for a healthy and successful SEO strategy. It helps you compile link-building opportunities for your domain, set up email outreach, and monitor newly acquired backlinks.Start taking full control of your backlink profile with Semrush.",
  "headers": [
    {
      "level": "H1",
      "text": "Unnatural Links: What They Are and How to Fix Your Link Profile"
    },
    {
      "level": "H2",
      "text": "What Are Unnatural Links?"
    },
    {
      "level": "H2",
      "text": "How Unnatural Links Impact SEO"
    },
    {
      "level": "H2",
      "text": "Unnatural Links and Google Penalties"
    },
    {
      "level": "H2",
      "text": "Google Link Spam Update Explained"
    },
    {
      "level": "H2",
      "text": "Common Types of Unnatural Links"
    },
    {
      "level": "H3",
      "text": "1. Blog Comments or Forum Posts"
    },
    {
      "level": "H3",
      "text": "2. Spam Listings"
    },
    {
      "level": "H3",
      "text": "3. Low-Quality Directories"
    },
    {
      "level": "H3",
      "text": "4. Link Exchanges"
    },
    {
      "level": "H3",
      "text": "5. Poor Quality PBNs"
    },
    {
      "level": "H3",
      "text": "6. Sitewide Links"
    },
    {
      "level": "H3",
      "text": "7. Automatically Generated Links"
    },
    {
      "level": "H2",
      "text": "How to Find Unnatural Links in Your Link Profile"
    },
    {
      "level": "H3",
      "text": "Set Up Semrush Backlink Audit"
    },
    {
      "level": "H3",
      "text": "Analyze Link Quality and Relevance"
    },
    {
      "level": "H3",
      "text": "Spot Patterns of Unnatural Links"
    },
    {
      "level": "H2",
      "text": "How to Remove Unnatural Links From Your Link Profile"
    },
    {
      "level": "H3",
      "text": "Contact Webmasters for Link Removal"
    },
    {
      "level": "H3",
      "text": "Monitor Removal Progress"
    },
    {
      "level": "H3",
      "text": "Use Google’s Disavow Tool"
    },
    {
      "level": "H2",
      "text": "Best Practices for Organic Link Building"
    },
    {
      "level": "H2",
      "text": "Fix Your Backlink Profile With Semrush"
    }
  ],
  "author": ""
}