{
  "url": "https://www.semrush.com/blog/what-will-make-you-stand-out-on-linkedin-in-2020/",
  "slug": "what-will-make-you-stand-out-on-linkedin-in-2020",
  "title": "What Will Make You Stand Out on LinkedIn: Expert Insights",
  "description": "Check out this top LinkedIn advice from three LinkedIn experts and be sure to stand out on the platform!",
  "content": "LinkedIn offers incredible opportunities to expand your network, to establish your reputation in your industry, and to connect with new clients, employers, and employees alike. We talked to three experts in the industry and asked about their top LinkedIn advice to help users and brands stand out on the platform: SEO Expert, Linkedin Maverick (29,700 relevant connections) and Founder at Accelerate Agency Nicholas Brown Entrepreneur and Hubspot Academy Instructor Dr. Ai Addyson-Zhang Co-Founder of Growth Marketing Pro Hailey Friedman. Understand Why It Is So ValuableTo get the most out of LinkedIn and truly set yourself apart, it is good to start by understanding why the platform is so valuable. “It is more B2B-focused than other social networks,” Brown explained, “like Facebook, that is more private. So you can target a specific audience that you need. It works well for SaaS and B2B brands that target mid- and enterprise-segments.”While many B2B and SaaS businesses may struggle on other platforms to drive the same kind of engagement as B2C brands, LinkedIn flips the script… and they do it well. “It is almost like Facebook, the early days of Facebook; the organic reach on LinkedIn, it is insane,” said Addyson-Zhang.“LinkedIn always performs the best in terms of generating warm leads, meaningful connections, or just engagement.The quality of conversations I have on LinkedIn, it is the best. Not with random people, but with people I want to talk to. We are getting high and meaningful professional connections.” — Addyson-Zhang.Declining organic reach has majorly impacted official Pages on Facebook, and has even impacted users on Instagram more recently. Since LinkedIn is a professional network, the organic reach hasn’t been torn to shreds, making it exceptionally valuable. The organic potential was stressed by Friedman, as well, who said, “There is still definitely an opportunity for LinkedIn to organically boost your posts and get seen by a lot of people without paying for it, which I think is what is still very unique.”Define Your Target Audience & Connect IntentionallyUnderstanding who your target audience is and how to connect with them is paramount in marketing, but for some reason, people seem to forget that on LinkedIn.“When implementing a LinkedIn strategy for your company, you should start the process by clearly defining the target audience,” Brown said. And what that entails? “This involves identifying companies that you want to target and the key decision-makers within these companies. Over time, and with a strategy in place, you can quickly grow a professional network comprised of a mixture of your peers, potential customers, and people who can help you on your journey.”When it comes to connections, it is important to try to connect only with people who are actually in that target audience. You don’t just want to connect with everyone possible because they won’t offer value to you and can drag your engagement rate down. “If you are just randomly following people, the algorithms will be so confused,”Addyson-Zhang explained. “Right now, I am only following social media marketers, entrepreneurs, and people in education, so all the recommendations and people who engage with me [belong in] those categories. So you don’t want to follow random people; that will really mess up the algorithms, which is not beneficial if you want to use this as a business generation platform.”If you are not sure where to start when it comes to finding these audience members, Addyson-Zhang recommends using LinkedIn search, including searching for hashtags, first and second-degree connections, and searching for those who work in relevant industries. If you can find them talking about your industry, it is a great opening to reach out and send a connection request.And about those connection requests, make them count. Both Addyson-Zhang and Friedman mentioned that sending a connection request with a personalized message about why you would like to connect is the best way to build your network. Create More Video Video is a relatively new feature on LinkedIn, but it is officially here to stay. Audiences love video, and it can be an interesting and effective way to tell stories and deliver content while driving engagement.“My video is my biggest business generation,” Addyson-Zhang explained. “I do either pre-recorded video or live video. Video is performing really, really, really well.”Addyson-Zhang talks about problems in her industry (education), tips and application information, and other topics that are immediately relevant to her audience. She believes that the reason it is so effective is because it all comes down to communicating on a more seemingly personal level:\"I think people are so tired of being sold to, and we are so hungry for that human connection. Video is a great way to humanize what you do and who you are to build that trust. Face-to-face is ideal, but so many of us, we can’t do face-to-face. So the next ideal situation, I think, is video content, and my video really helps me a lot.” She recommends that everyone on LinkedIn creates a mix of prerecorded and live video that will be relevant to their audience because it is estimated that by 2020, 82% of internet activity will be watching video content. Use Engagement-Boosting Strategies It is essential to remember that all social media platforms have an emphasis on social content. Interactivity is key here, and it is about connecting with people, not just posting content into a void. Using engagement-boosting strategies is going to be key to building strong relationships that will help you stand out.You want to start, according to Friedman, with getting people interested enough that they want to click to read more.“Making sure that you are using that first and second line to write a really engaging hook is important,\"she said while explaining the importance of the beginning of every post. “When they click to read more, they are engaging with the posts.”She did stress, however, that while getting people to read your full posts, you also wanted to drive engagement, and she gave an example on how to do exactly that. “Say you have this amazingly free guide that has helped thousands of people, then say comment below if you want me to send it to you.”Being careful with how you interact with engagement is key, too.“Don’t just post a piece of content and disappear; that doesn’t work,” Addyson-Zhang explained. “Actually spend time to engage with the people. Even in the comments section, you keep the conversation going. Don’t kill a conversation by saying, “Hey, great point, thank you for commenting. On top of that, what do you think about this? Oh, that’s interesting. Why did you mention this?” Brown said, “Ask for people’s help on articles and opinions, and don’t forget to tag relevant people in your post, but don’t spam them! Finally, interact with the audience, use their opinions and thoughts in the articles that you’re writing, then publish the content. Post it on LinkedIn and let them know what you have done. It is likely that they will share it.” Know Which Types of Content Will Yield Best Results Not all content is created equal, so it is crucial to know what will perform best and help you make a lasting impact on your connections. And that starts with creating content with your target audience in mind and considering how you can get it in front of them.“LinkedIn has a pretty smart algorithm,” Friedman explained. “If you want to target content marketers, then you can say, ‘Hey content marketers, look at this tip,’ If you call out who you are trying to reach, LinkedIn actually sees that and will boost your post to those people. You use certain keywords within the post, and you can use hashtags. You don’t need to have a big following to get a big following.” As LinkedIn sees high-engagement as a sign of relevance, they will give your content more priority, giving you incredible visibility in the process. This means that quality is key.“My video is highly intentional,” Addyson-Zhang said. “What you really have to do is make sure that what you are producing is actually showing up in front of the right people who are likely to purchase from you. I have a very clear strategy.” “Besides videos,” Addyson-Zhang continues, “people should definitely take advantage of the documents feature. It is so powerful! My guess is that because the ‘documents’ feature is new, the LinkedIn algorithms work harder to promote this type of content so that more people will use it. It is like when LinkedIn just started giving people access to use the video feature, its organic reach was insane.”Brown also recommends using curated content to keep your audience engaged, too, saying, “Curated content gets a lot of engagement. We have posted an article about the best 20 tools and asked our audience, “What other tools can you add to the comments?’ We got a lot of engagement and suggestions that we organized in a stand-alone blog post. We then tagged all these people after the post was published, thanking them for their input. This new blog post performed even better than the initial one.” Leverage Stories to Keep Your Audience Interested All of our experts put a big emphasis on the importance of connecting authentically with your audience, and using stories is a highly effective way to do this.“The type of content that tends to stand out on LinkedIn is when people are vulnerable and share personal stories,” Friedman said, “So if you can use the space within your LinkedIn posts to create a really engaging hook sentence. He says, \"Share something that people would never imagine you would share publicly on a space like LinkedIn. Tell a personal story, share a struggle… people really gravitate towards that.” Addyson-Zhang strongly agreed, saying that social media is used to share stories. “What stories can you share in a second? Use social media to spotlight your internal employees, your customers, your communities.”“If you really understand your consumers,” she said, “If you really understand their pain points, I think that will help you a lot to craft amazing, compelling stories. I admittedly speak to parents who are concerned about their children’s future, so I know exactly their pain points, and I know the content that is performing well; I really tap into the emotion.” Stories are so powerful because they are memorable, and they resonate with your audience emotionally, so use them as a key component of your strategy. Prioritize Quality Over Quantity You want your content to do the work for you. As Addyson-Zhang explained, “My content does the branding for me; my video content does the community building for me.”To drive these kinds of results, you need to be prioritizing quality over quantity. Every single one of our experts mentioned this. “One mistake I made when I was using LinkedIn or social media, I was talking about random stuff,” Addyson-Zhang said. “As a result, I was attracting random people to my life. I was wasting so much time. But now I am actually spending less time on social media, but my business is growing more.” More high-quality and meaningful, intentional, strategic content is key, and Addyson-Zhang explained why so clearly:“We are already bombarded with so much noise. You need to spend more time to give us quality content.”“I think with LinkedIn, you get what you give,” Friedman elaborated. “I wouldn’t post more than once a day, probably, or a couple of times a week. It is really quality over quantity, I would say. It is about writing really, really incredible stories and engaging posts, really sharing your story, and sharing things that you are learning throughout the day and finding in your business.” In this post, you will find some great tips from Hayley Friedman on how to go viral on LinkedIn.“It is all about the content,” Brown shared when explaining the biggest mistake he saw people making on LinkedIn. “Producing content that doesn’t convert, focusing on keywords that don’t convert. If you are targeting a keyword that is more general and has no right user intent for your business, it won’t be beneficial for you.”Brown also mentioned something key: “I used to spend 80% of the time on creating and 20% on promoting content, and it didn’t work well. If you are putting efforts into producing great content, you need to focus on promotion to get good results.” Conclusion LinkedIn can offer enormous potential, whether you want to use it to establish your brand, show thought leadership, or build a meaningful community that can benefit you or your business. It is different from other social platforms, and that means that you need to adapt your strategies accordingly. The advice here from these experts is a great place to start. So, adapt your strategy accordingly as we start moving into 2021, getting yourself ready for an incredible new year!",
  "headers": [
    {
      "level": "H1",
      "text": "What Will Make You Stand Out on LinkedIn: The Expert Insights You Need to See"
    },
    {
      "level": "H2",
      "text": "Understand Why It Is So Valuable"
    },
    {
      "level": "H2",
      "text": "Define Your Target Audience & Connect Intentionally"
    },
    {
      "level": "H2",
      "text": "Create More Video"
    },
    {
      "level": "H2",
      "text": "Use Engagement-Boosting Strategies"
    },
    {
      "level": "H2",
      "text": "Know Which Types of Content Will Yield Best Results"
    },
    {
      "level": "H2",
      "text": "Leverage Stories to Keep Your Audience Interested"
    },
    {
      "level": "H2",
      "text": "Prioritize Quality Over Quantity"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H6",
      "text": "Most popular pages"
    },
    {
      "level": "H6",
      "text": "SEO Checklist: 41 Tips to Optimize Your Website"
    },
    {
      "level": "H6",
      "text": "How to Perform a Complete SEO Audit (in 14 Steps)"
    },
    {
      "level": "H6",
      "text": "A Beginner’s Guide to Keyword Search Volume"
    }
  ],
  "author": ""
}