{
  "url": "https://www.semrush.com/blog/word-of-mouth-stats/",
  "slug": "word-of-mouth-stats",
  "title": "49 Word of Mouth Marketing Statistics to Boost Your Bottom Line",
  "description": "To understand how powerful word-of-mouth marketing (WOMM) really is, we’ve created a list of word-of-mouth marketing statistics for you.",
  "content": "Can you think about the last time you experienced something and had to tell your friends about it? This is essentially word-of-mouth marketing (WOMM), and we experience it nearly every day. That’s why almost half (48%) of businesses worldwide rely heavily on the power of word-of-mouth marketing. It’s a free form of advertising (in most cases), which utilizes loyal customers to spread the word about your products/services. To understand how powerful word-of-mouth marketing really is, we’ve created a list of word-of-mouth marketing statistics for you. General Word-of-Mouth Statistics The Power of Word-of-Mouth Marketing Statistics Brand Discovery Through Word-of-Mouth Statistics Brand Consideration Through Word-of-Mouth statistics Influence on Purchases Through Word-of-Mouth Statistics How Customer Service Drives Word-of-Mouth Statistics Word-of-Mouth for Small Business Statistics Organic vs. Non-Organic Word-of-MouthGeneral Word-of-Mouth Statistics 23% of people talk about their favorite products with friends and family every day. Furthermore, 78% of people rave about their favorite recent experiences to people they know at least once per week. 90% of people are much more likely to trust a recommended brand (even from strangers). 88% of people had the highest level of trust in a brand when a friend or family member recommended it. Out of the top five popular ways to recommend a business, word-of-mouth comes first, followed by Facebook, Google, and Twitter. 26% of people will completely avoid a brand if their friend or family tells a negative story about their experience. 21% of people will lose trust in a brand, whether they’ve been a customer or not, because of bad word-of-mouth. The Power of Word-of-Mouth Marketing Statistics On average, word-of-mouth drives $6 trillion in annual global spending and is responsible for 13% of all sales. Word-of-mouth is even more effective than paid ads, resulting in five times more sales. 28% of people say that word-of-mouth increases brand affinity (a customer’s common values with a brand). 64% of marketers agree that word-of-mouth is the most effective form of marketing. 70% of marketers are looking to increase their online word-of-mouth spending, while 29% off-line. Most marketers (83%) use word-of-mouth marketing because it increases brand awareness. 43% of marketers use word-of-mouth marketing to increase sales. Brand Discovery Through Word-of-Mouth Statistics Millennials were 38% more likely to discover brands through recommendations from friends and family. In Colombia and Mexico, 39% of people hear about products for the first time from word-of-mouth recommendations. 32% of people come across new podcasts from word-of-mouth recommendations, and 29% specifically from friends’ recommendations. 20% of people become aware of Smartphone apps through word-of-mouth recommendations. Consumers knew about Amazon Prime Day in 2020, mostly from Amazon’s website itself. However, 17% of people found out from friends and family. In Australia, 42% of people discover new brands through search engines, and 38% through word-of-mouth recommendations. In Romania, word-of-mouth is the least popular way to discover new products, with only 28% of the population finding products this way. 16% of Baby Boomers discover new brands through word-of-mouth. Generation X is the most to discover products through word-of-mouth, with 18% regularly finding products this way. And for Generation Z, only 12% discover new products by word-of-mouth.Brand Consideration Through Word-of-Mouth statistics 17% of Chinese luxury guests considering which hotel to stay in agree that word-of-mouth is among the top factors in their decision making. 28% of people considered visiting a convenience store after mentioned by someone they knew in the U.S. in 2019. Word-of-mouth was the fourth-leading reason for considering visiting convenience stores, according to 17% of Canadians. 23% of consumers consider buying their Christmas gifts because of word-of-mouth recommendations. Also, 23% of people consider the gifts they buy for Valentine’s day, depending on recommendations. Influence on Purchases Through Word-of-Mouth Statistics Word-of-mouth is directly responsible for 90% of all purchases. 23% of Singaporean shoppers bought something in a physical store in 2019 based on a friend’s recommendation. 37% of Americans decided on which restaurant to eat at based on word-of-mouth recommendations. Likewise, 31% of electronics purchases are heavily influenced by word-of-mouth recommendations. 20% of North Americans who became aware of a product through word-of-mouth made the purchase instantaneously. Over half of craft beer drinkers in the U.K. said they would buy a beer they’ve never tried if friends recommended it. How Customer Service Drives Word-of-Mouth Statistics If a customer feels satisfied with their interaction with your business, 96% will return and will be more likely to tell the people around them. On average, customers who have their problems resolved by a business will tell four to six people about their positive experience. Customer loyalty, in most cases, is worth ten times more than a single purchase. Brands that offer positive experiences receive three times more word-of-mouth than brands that offer dull experiences. The average customer who has a bad experience tells eight to 16 people about it. Customers who have a second bad experience with a business will tell over 20 people.Word-of-Mouth for Small Business Statistics Most businesses become aware of new artificial intelligence technologies from colleagues, networking, and seeing other companies use them. 8% of B2B marketers find word-of-mouth marketing effective in promoting live events for marketing purposes. Word-of-mouth counts as one of the top traffic sources for small businesses that do affiliate marketing. 20% of businesses plan to use word-of-mouth marketing in their yearly marketing strategy. 65% of businesses use word-of-mouth recommendations to recruit for open positions. Word-of-mouth can be an extremely powerful marketing tool for small businesses. A mosquito fumigation service said 76% of their clients come from word-of-mouth recommendations. When buying business software, 46% of small businesses choose based on colleagues’ recommendations and other companies in the industry. In the U.S., word-of-mouth marketing is in 48% of businesses ’ best marketing tools. Organic vs. Non-Organic Word-of-MouthWhat marketers need to understand is that there are two ways you can create WOM. Organic WOM simply starts by consistently giving customers great experiences with your brand. From there, you can let the rest take care of itself. On the other hand, if your business isn’t getting enough organic WOM, you can generate amplified WOM through marketing campaigns. A common strategy for creating campaigns is finding brand advocates, a.k.a, people who actively promote your product with their networks (mostly on social media platforms). Tinder is an excellent example of a WOM marketing campaign. When the app went live in 2012, they relied completely on brand ambassadors to spread the word. Thanks to WOM, they already had 50 million users just two years after launching. Using influencers to spread the word about your brand is another effective WOM marketing strategy. Audible worked with influencers to target YouTube users. By using influencers from different backgrounds, they were able to target people with a variety of interests. They worked with influencers in gaming, entertainment, people and blog, film and animation, etc.As a result, Audible reached over 123 million YouTube viewers in one single WOM marketing campaign. While organic WOM is the best and longest-term strategy for your business, and you can be quite successful from it, you can definitely kickstart your word-of-mouth strategy by using amplified WOM. We hope these word-of-mouth statistics helped you shape an idea of how powerful WOMM is and give you thoughts on how to use it in your business’s future. Solid keyword research underpins every successful SEO and PPC strategy. Here, we will share everything you need to know about Google Keyword Planner for your campaigns.We got our sources from Statista Premium and the following pages: Invesp CSM Tapadoo",
  "headers": [
    {
      "level": "H1",
      "text": "Word of Mouth Marketing: 49 Statistics to Help You Boost Your Bottom Line"
    },
    {
      "level": "H2",
      "text": "General Word-of-Mouth Statistics"
    },
    {
      "level": "H2",
      "text": "The Power of Word-of-Mouth Marketing Statistics"
    },
    {
      "level": "H2",
      "text": "Brand Discovery Through Word-of-Mouth Statistics"
    },
    {
      "level": "H2",
      "text": "Brand Consideration Through Word-of-Mouth statistics"
    },
    {
      "level": "H2",
      "text": "Influence on Purchases Through Word-of-Mouth Statistics"
    },
    {
      "level": "H2",
      "text": "How Customer Service Drives Word-of-Mouth Statistics"
    },
    {
      "level": "H2",
      "text": "Word-of-Mouth for Small Business Statistics"
    },
    {
      "level": "H2",
      "text": "Organic vs. Non-Organic Word-of-Mouth"
    },
    {
      "level": "H6",
      "text": "Most popular pages"
    },
    {
      "level": "H6",
      "text": "SEO Checklist: 41 Tips to Optimize Your Website"
    },
    {
      "level": "H6",
      "text": "How to Perform a Complete SEO Audit (in 14 Steps)"
    },
    {
      "level": "H6",
      "text": "A Beginner’s Guide to Keyword Search Volume"
    }
  ],
  "author": ""
}