{
  "url": "https://www.semrush.com/blog/yoast-seo-semrush/",
  "slug": "yoast-seo-semrush",
  "title": "How to Use the Yoast SEO Semrush Integration",
  "description": "Together, Semrush and Yoast SEO help you find and target the best keywords without ever having to leave your WordPress editor! Learn how in this guide.",
  "content": "If you’re a site owner using WordPress, chances are you’re already using Yoast SEO to optimize it. But did you know that you can use Yoast to leverage the power of Semrush, without ever needing to leave your site editor?Below, we’ll show you how Semrush and Yoast SEO work together—and how you can use them both to boost your site’s visibility.What Is the Yoast SEO & Semrush Integration?If you’re reading this, you probably already know what Yoast is—a WordPress plugin that helps you optimize your site for search engines. But what’s Semrush, and how do the two work together? First, Semrush.Semrush is an online SaaS platform that helps people run digital marketing campaigns more effectively. That means it can help with things like SEO, content marketing, competitive research, paid ads, and more. Semrush also has the largest keyword database on the market, with 24.7 billion keywords and counting.And what does all that have to do with Yoast?Simple. The Semrush integration with Yoast SEO empowers you to find high-performing keywords in Semrush’s massive database, without ever having to leave the WordPress editor to do it.With it, you can: Find and target relevant keywords Find new, high-quality content ideas Optimize your content to rank higher Get more eyes on your siteIn other words, together, Yoast and Semrush make keyword research easier and more effective, by providing you with the data you need, right where and when you need it. Within the site editor.Convenient, huh?Next, let’s look at how to enable the integration in WordPress.How to Connect Semrush to Yoast SEOReady to enable Semrush in Yoast SEO? It’s simple, and only requires a few clicks.First, open the Yoast SEO sidebar in the WordPress Editor of any page on your website. (Don’t have Yoast yet? Learn more about how to install and use it here.)Then, enter a focus keyword, and click “Get Related Keyphrases.” This will prompt a new window to open. Here, you have two options: Log into your existing Semrush account Register for a new Semrush accountThe type of Semrush account you have will determine how many keywords you can search for each day. More on that later. Once you’ve either logged in or registered, the next step is to grant Yoast SEO permission to access your Semrush account. You should only need to do this once. Going forward, the related keyphrases tool—and all that Semrush data—will be available to you automatically.Next, let’s learn more about what the integration can do.Features & LimitationsWith the Yoast SEO Semrush integration, you’ll get access to Semrush’s entire 24.7 billion keyword database. And for each keyphrase you find, you’ll learn its: Volume: The average number of searches per month, based on the last 12 months of data Trend: How interest in that keyword changed over the last 12 months, based on its monthly search volumeIt’s available on both the free and premium versions of Yoast. What’s the difference between using the Semrush integration on Yoast SEO free vs. premium?In short, Yoast SEO Premium has a variety of features not available on the free version. Since we’re focusing on the Semrush integration specifically, the most relevant differences are: Premium users can use the tool to target up to 5 keyphrases per post, whereas free users can only target one Premium users can target up to five related keyphrase using the “Add as related keyphrase” button, and get recommendations about them from the toolNow for the Semrush side of things. The number of keyphrases you can find each day varies depending on your Semrush account type. Here’s how it breaks down: Semrush Account Type Number of Keyphrase Searches Per Day Results Per Search Free 10 10 Pro 3,000 10,000 Guru 5,000 30,000 Business 10,000 50,000 These limitations apply both on Yoast SEO and within the main Semrush interface. So, if you’re already an avid Semrush user, be aware that each keyphrase search on Yoast SEO will also count toward your daily limit.You can find out more about Semrush pricing and limitations here. Getting Started with Yoast and SemrushBy now, you’ve connected your Semrush account to Yoast SEO. It’s time to dive in and start optimizing.First, open any page or post on your site in your WordPress editor—or create a new one. Then, open Yoast SEO in the sidebar.At the top of the sidebar, you’ll see a field called “Focus keyphrase.” A focus keyphrase, or focus keyword, is the primary search term you want that page to rank for. It should also accurately describe the contents of that page. Start by entering your focus keyphrase for that page. Not sure what your focus keyphrase should be? Don’t worry. Just enter your page’s main topic for now. You can replace it later.Next, click “Find Related Keyphrases.” Since you’ve already connected your Semrush account, you should automatically see the Related Keyphrases window, containing a list of search terms related to your focus keyphrase. Now, it’s time to choose your target keyphrases. First, use the drop-down to select the country you want to rank for. Then choose keyphrases you want this page to target: If you need a new focus keyphrase, make a note of the best one, and update Yoast SEO accordingly once you leave the Related Keyphrases tool. If you’re a Yoast SEO Premium user, click “Add related keyphrase” for up to five additional search terms If you’re using the free version, make a note of the ones you want to target and try to integrate them into your content laterNow let’s look at how to choose effective keyphrases to target.How to Choose Effective Focus and Related KeyphrasesFirst, let’s examine the keyphrases themselves. You probably see two different types: Short-tail keywords are only one or two words. They usually have a very high search volume, and cover a very general or high level topic, like “bicycles.” As such, they’re usually hard to rank for, especially for a new site. Long-tail keywords usually consist of multiple words, as in “how to choose a mountain bike for beginners.” They are typically much more specific, and less competitive by comparison.Start by identifying any keyword that accurately describes the contents of your page. Next, we’ll use Volume and Trend data to narrow the list down. As described above, search volume is the average number of times that phrase is searched for each month. The higher this number, the more popular—and the larger your potential audience. And the trend graph shows you how that popularity has changed over time. If the line is going down, fewer people are searching. So how do we use this data? Simple. First, eliminate any keywords that you believe are too low in volume to compete for. If you’re not sure, take a look at the trend. For example, if a low volume keyword is consistently trending down, you may think it’s not worth your time.Next, look at the highest-volume keyphrases on your list. One strategy is to simply target all of the highest volume keyphrases, because they have the highest potential audience. However, the more popular a keyword, the harder it probably is to rank for. That’s why it’s helpful to first analyze your focus keyphrases using Semrush’s Keyword Overview tool. Find it by clicking the “Get more insights at Semrush” link at the bottom of the Related Keyphrases window. This will open the Keyword Overview tool in the main Semrush platform, showing data for your current focus keyphrase.Here, you can learn: How difficult it is to rank Its search intent (informational, commercial, or transactional) Related keywords and questions to target Your biggest competitors to rank Other features that appear on the search page (like featured snippets, or People Also Ask boxes)Using what you learn, eliminate any keyphrases you don’t think are worth targeting, whether they’re too difficult, too low volume, or not relevant enough. You should be left with a shorter list of workable keyphrases. Choose the best one for your focus keyword, if you haven’t already settled on one. Then, choose up to five more to support it. These are your related keyphrases.A related keyphrase, also called a supporting, tertiary, or secondary keyword, is an additional word or phrase you want to rank for, but which is lower priority than your focus keyphrase. Often, these are variations or subtopics of your primary keyword.If you’re using Yoast SEO Premium, the tool will help you target these supporting keywords in your content, similar to how it provides recommendations for your focus keyword.Using the free version? Don’t worry. You can still target related keyphrases by integrating them thoughtfully into your content—for example, in relevant subheaders, or throughout the text. How to Find New Opportunities to Rank in Search ResultsKeyword research can uncover plenty of opportunities for your site to rank well in organic search results. Not sure where to start? Here are four key considerations.Low-Hanging Fruit KeywordsIt may be tempting to exclusively target the highest volume, most competitive keywords available, because they have the biggest audience. And if you do win, this could pay off in spades.But—especially if you’re building a new site, or are competing in a crowded niche—those wins might be a long way off, and may require strenuous effort.That’s where low-hanging fruit comes in.In this context, low-hanging fruit refers to keyphrases that, although they may have low search volume, are easy to win with relatively little effort. Why target them? Here are just a few reasons: Ranking for more keywords can help build your site’s credibility over time—even if they’re low volume or low competition ones They can still bring relevant traffic to your site Quick wins like these can balance out more difficult keyword goalsRelated TopicsHere’s a familiar scenario: You’re doing keyword research, and you find an interesting keyword, with good search volume, and not too much competition. But you can’t use it, because it isn’t quite accurate to the content you’re creating. Or can you?Building out a library of related content about a topic can help to build your site’s subject-matter authority. And that authority can help you rank for even harder keywords in the future. Learn more about this strategy in our article about topic clusters.Need more related content ideas ASAP? Semrush can help. Just enter your main topic into the Keyword Overview tool, and scroll down to the “Keyword Ideas” section. Each question or keyword variation is a potential topic you could cover on your site. Search IntentIf you want your content to rank, make sure it aligns with its target keyword’s intent.What is search intent?Search intent is the purpose behind a user’s query. In other words, it refers to the type of information a user is trying to find.There are four basic types: Informational: The user wants to learn about a topic (“types of dog food”) Commercial: The user is investigating a potential purchase, but isn’t ready to buy yet (“the best dog food brands”) Transactional: The user is trying to make a purchase right now (“blue buffalo life protection small breed”) Navigational: the user is trying to get somewhere—an address, a website, a phone number, etc. (“contact purina”)Search engines use intent to determine which content and features to show in the results. So if your page is misaligned with what they think users want, they’re unlikely to rank it.Semrush’s Keyword Overview tool shows you the Search Intent for any phrase.By aligning your page contents with the search intent behind your focus keyphrase, you won’t just increase your odds of ranking higher. You’ll also ensure that your content is both relevant and helpful for your audience.SERP FeaturesSERP features, also called “search features,” are elements of a search results page.Have you ever asked a question on Google, only to find the answer conveniently displayed in a box at the top of the results? That’s just one example of a search feature. Winning one of these can boost your site’s visibility significantly. After all, when was the last time you scrolled past one to click on a lower-ranked result?Semrush can help you identify keyphrases currently displaying SERP features. Using the Keyword Magic tool, you can even filter for the ones you want to target.So how do you target them? Short answer: it depends on the type you want to target.Generally speaking, the key is to make sure all your content is helpful, relevant, and easy to understand for humans and search engine crawlers alike. For more specific hints, try learning from your competition. Which page currently owns the feature you’re after? Analyze that page to learn how they won. For example, let’s say your biggest competitor won the featured snippet you want. By viewing the page, you find that they: Used easy-to-understand, topical headers related to pertinent questions Answered each question right underneath each header, with minimal fluff Used charts and bullet points to organize their data for easy reading Link to authoritative sourcesYou can replicate all of these strategies while creating and optimizing unique content for your audience. Learn more in our article on winning SERP features.Semrush and Yoast SEO: A Perfect MatchBetween the power of Semrush and Yoast SEO, you’ve got all the resources you need to rank at your fingertips. You’ve got the world’s biggest keyword database, and the perfect plugin to help you target them. Want to learn even more? Check out our Ultimate Guide to WordPress SEO on the Semrush blog, or Semrush Academy’s On-Page and Technical SEO Course.Happy optimizing!",
  "headers": [
    {
      "level": "H1",
      "text": "How to Rank with the Yoast SEO Semrush Integration"
    },
    {
      "level": "H2",
      "text": "What Is the Yoast SEO & Semrush Integration?"
    },
    {
      "level": "H2",
      "text": "How to Connect Semrush to Yoast SEO"
    },
    {
      "level": "H2",
      "text": "Features & Limitations"
    },
    {
      "level": "H2",
      "text": "Getting Started with Yoast and Semrush"
    },
    {
      "level": "H3",
      "text": "How to Choose Effective Focus and Related Keyphrases"
    },
    {
      "level": "H2",
      "text": "How to Find New Opportunities to Rank in Search Results"
    },
    {
      "level": "H2",
      "text": "Low-Hanging Fruit Keywords"
    },
    {
      "level": "H3",
      "text": "Related Topics"
    },
    {
      "level": "H4",
      "text": "Search Intent"
    },
    {
      "level": "H4",
      "text": "SERP Features"
    },
    {
      "level": "H2",
      "text": "Semrush and Yoast SEO: A Perfect Match"
    },
    {
      "level": "H6",
      "text": "Most popular pages"
    },
    {
      "level": "H6",
      "text": "SEO Checklist: 41 Tips to Optimize Your Website"
    },
    {
      "level": "H6",
      "text": "How to Perform a Complete SEO Audit (in 14 Steps)"
    },
    {
      "level": "H6",
      "text": "A Beginner’s Guide to Keyword Search Volume"
    }
  ],
  "author": ""
}