{
  "url": "https://www.semrush.com/blog/youtube-seo-study/",
  "slug": "youtube-seo-study",
  "title": "YouTube SEO Study",
  "description": "YouTube SEO Study to help you rank higher",
  "content": "It’s pretty impressive to see something that started as a video-dating website become the second most-used search engine (and website) after Google, with more than 2 billion monthly active users.Today, YouTube is more than just a video platform for casual entertainment and music videos — it is a full-fledged search engine of its own. Just consider how pandemic-inspired shifts on YouTube align with our previous findings for Google: In March 2020, YouTube searches for videos that had “home office” in the title grew by a whopping 210%, “home workout” views surged by 515%, and videos featuring doing something “at home” got 700% more daily uploads. These demand patterns are identical to what we uncovered in our studies that assessed the pandemic impact on Google searches: Home Decor and Sports & Outdoors were the fastest-growing ecommerce categories back in 2020.And if YouTube is a search engine, there are ranking algorithms that affect videos’ organic visibility.Together with Tubics, developer partner of Semrush App Center, we’ve run extensive research, studying many different variables, to unwrap YouTube’s ranking algo and arm you with key takeaways and actionable tips to potentially get your videos ranking at position one!YouTube SEO Study: Key TakeawaysBelow, we will get into the details of YouTube SEO, but here is a sneak peek into the important discoveries from our study: More than half of the videos that ranked at the first position have more than 50 words in the description. 52% of videos ranking for “how-to” keywords have more than 100 words in the descriptions, while for the general sample, it’s only 31%. 52% of videos ranking for “how-to” keywords are longer than 5 minutes, while for the general sample, it’s only 33%. Only 8% of videos with timestamps rank at the first position. 55% of videos have a match ratio between title and keyword equal to 1. Title similarity with keyword ratio, number of views, and video duration are the most important parameters, according to the Machine Learning model we used for this research.What Is YouTube SEO?Before we take a deep dive into the study, we should highlight that YouTube SEO is a bit different from regular SEO and video creators really need to understand the algorithm to appear high in search results.YouTube’s ranking decisions are largely based on the following factors: Channel growth dynamics (number of subscribers and views); Engagement signals (likes, dislikes, comments); Video features (video length, metadata, descriptions, etc.).We’ve analyzed each variable to uncover data-driven insights that will help in getting your videos the best visibility on YouTube.Study MethodologyWe pulled 15,000 keywords from our Google Keywords Database, which triggered a Featured Video result on the SERP. Then we took a look at YouTube’s top 10 search results for each of these keywords to check how different video features affect their positions in YouTube search. Based on this data, we gathered a wide range of metrics to assess which of them affect videos’ performance. Among other things, we’ve analyzed the performance of “how-to” keywords versus general keywords, the search positioning of videos based on their engagement metrics (likes, comments, views), and a video’s key elements (description, title, tags). We used median values instead of average values to compare metrics for different positions since they are more resistant to outliers.Machine Learning ModelWe used a Machine Learning model to identify what features of a YouTube video were most important for ranking. By using decision tree models, we identified that title similarity with keyword ratio, the number of views and video duration were the most important factors for this model.Alongside these metrics, we tracked non-engagement-related metrics (title length, tag similarity ratio, description length), which showed an impact on rankings as well.To compare search terms, titles, descriptions, and tags, we used the Levenshtein Distance Similarity Partial Ratio. This metric has values from 0 to 1, where 0 means keywords are totally different, and 1 means keywords are a match. Dissecting YouTube’s Ranking Algo Exploring the top 10 results for the analyzed keywords, we were able to pinpoint some general patterns across the key factors affecting videos’ visibility on YouTube.Let’s take a look at things that shape YouTube’s unique ranking algo. When It Comes to YouTube SEO, Do Growth Dynamics Matter?SubscribersOur data shows that most of the results in a YouTube search come from the channels with the largest number of subscribers. However, 18% of videos were featured on channels that have less than 1,000 subscribers. This means that even small channels can find themselves among the top 10 search results.For example, when searching for the keywords “how to apply thermal paste” or “most annoying sound in the world,” we can see that smaller channels take the number one position. Below we can see that Tech Illiterate with 6.43K subscribers outranks Linus Tech Tips with 13.7M. If we wanted to explain why, we could immediately pinpoint that Tech Illiterate has a lower share of dislikes and a more elaborate video description. But do those factors really matter and have a ranking impact? Keep reading.Tip: When trying to rank for keywords, don’t focus on your competition. Don’t worry about getting millions of subscribers, although it helps. Focus on creating engaging, high-quality content. The good stats and followers will come.ViewsThe average number of views for a YouTube video sitting in the second position is 74% less than the average number of views for a video in the first spot.The causation can be reversed, however. The first video on the list is simply more likely to be viewed. So this may be more of a chicken and egg matter. But there’s one view-related factor that certainly impacts rankings. YouTube estimates the watch time for each video for each keyword, so it will suggest the ones that are more likely to be viewed till the end.If you search for “baking tips,” you will find a big difference in the number of views between the first position video from Scrumdiddlyumptious at 3.9M and the second-place video from Claire Saffitz x Dessert Person at only 446K views. The first video is 9X shorter, so chances are, it has better chances of being viewed till the very end.Tip: Don’t wait around for YouTube’s ranking algo to kick in. Actively promote your video and share it across multiple channels when it’s fresh out of the oven, to ensure more early traction and reach a broader audience. Assessing How Engagement Metrics Affect YouTube RankingsYouTube has publicly said that it encourages creatives to interact with their audience to maximize engagement and help with ranking.While we could take YouTube’s word for it, we decided to see to what extent engagement affects video rankings and how.LikesThe average number of likes for the second position on YouTube’s search results is 72% less than the average number of likes for the first position. This data is reflected in the above example, where Scrumdiddlyumptious’ video got twice the number of likes than that of Claire Saffitz x Dessert Person (24K vs. 12K likes).The difference between the first position and the other positions is quite dramatic. But this insight may have a similar chicken-egg connotation. Higher-ranking videos get more views and thus more likes and dislikes. The number of likes correlates with the number of views, with the correlation coefficient being 99%. DislikesThe average number of dislikes for the second position is 70% less than the average number of dislikes for the first position. This shows the same logic as with likes.CommentsWith comments, things are more straightforward. We spotted a shared correlation, that if a video received more views, it was more likely to get comments. This showed a correlation of 99.9%, where the median* number of comments was 259.Tip: Tired of hearing “like the video and don’t forget to subscribe to my channel” while watching YouTube? There’s a reason the creators do this. Encourage viewers to like your video and leave comments with any opinions or thoughts and get back to them within 24 or 48 hours to show viewer engagement. The comments and opinions of your followers can drive robust discussions; reactions to your video and to comments also fuel engagement. Video Features and Elements’ Impact On YouTube RankingsFrom promotional efforts and engagement signals to channel size and its growth dynamics, what we discussed above had to do with the “external” factors affecting your videos’ ranking performance. The internal qualities of the video can make a big difference, too.Video durationA video’s length can play a role when it comes to rankings. Our results show the distribution of video duration by percentages where 45% of videos in our study had a duration of 3 to 5 minutes, and 5% had a duration of less than 1 minute. It’s important to note that some of the results (0.4%) are live streams, which have no duration parameter.The “go concise or go elaborate” question stands before every creator. And data can give us some ballpark numbers.Almost half of all videos making it to the top 10 search results on YouTube are 3-5-minutes long. The next most successful video formats are either 1-3 or 5-10 minutes long.If we take a dynamic view at video length, we’ll see that the median video length increases with the position of the video. However, the difference is not too dramatic.While it looks like 3-5-minute videos are the way to go, the logical (and maybe right) answer would be “it depends.” After all, users searching for “crunch exercise” and “The Sopranos” ending explained” expect different levels of detail.When doing a search for a “crunch exercise” on YouTube, we typically get a selection of videos that are on the shorter end of the spectrum:As for “The Sopranos’ ending explained,” we get more elaborate video pieces that actually address the query, meaning they go all-in on clarifying the series’ finale:Tip: Create videos that have the right balance between length and quality. Have a good intro and outro to keep users engaged throughout the entire video. Use end-screens to provide a seamless viewer flow. Titles and descriptionsOur study shows that when it comes to titles and descriptions, there are two things to tackle: Word limit; and Keywords. 54% of all the analyzed videos come with an average of 8 words in their title. And looking at all the data, we can see that being overly wordy is not a popular tactic among YouTubers.You can get more generous with video descriptions, though. They give both YouTube and users more context of what to expect in a video, and as we’ll see further, offer more space for keyword placement. 31% of the top-performing videos feature 11-30-word descriptions. But it seems like you can get more wordy here.We found that the average number of words in a description was 107, and 17% of videos ranking for position one had at least 250 words in the description.Mentioning the keyword that your video is optimized around will allow YouTube to easily understand that your video addresses the user’s search term. Our study shows that 30% of video descriptions had a similarity with keywords equal to 1, meaning that the main keyword was mentioned in a video’s description. The average description similarity with a keyword was 0.42.Tip: Our research indicates that the top videos have longer descriptions. Ensure that your description accurately reflects the video’s content so that users have a good idea of what to expect. Typical headline best practices work for YouTube, too. Try including the main target keyword in your video’s title without keyword stuffing. Add numbers to your title to entice viewers to click (e.g. ‘5 Ways to Change a Flat Tire’).Number of links, hashtags, and tags in the descriptionOur study shows that the average number of links in a video description was 3.Having references and links in your video’s description is a good way of driving viewers through their customer journey by smoothly directing them to other videos on your channel or even back to your website. When it comes to adding links to video descriptions, try to include branded links (e.g., instead of bit.ly/xx, we’d use semrush.com/xx) as they potentially increase CTR by 39%.YouTube Creator Academy has publicly said in one of their articles that they advise video creators to use hashtags in their descriptions. Our results show that 36% of videos ranking position one do have them. Starting from position two, hashtag usage goes down to 24%.Some YouTubers go all in and add as many hashtags as possible. But YouTube will only display three hashtags, and if you use more than 15, it will simply ignore all of them. So it’s best to stay reasonable and stick to YouTube’s guidelines. Now let’s look at the impact of YouTube Tags. Tags are not to be confused with hashtags, which are displayed underneath a video. These are the hidden messages associated with a video, and it’s up to a creator to add them when uploading a video. Our study shows top-ranking videos use an average of 13 tags. Their usage seems to have a tight correlation with rankings: videos with fewer tags tend to come at lower rankings.Tags (as is the deal with our ‘regular’ metatags) should be closely intertwined with keywords as this is an element meant for crawlers and not for humans. From our research, the average tag similarity with keywords was 0.58, where 0 means keywords are totally different, and 1 means keywords match.Clearly, the closer the match between tags and keywords, the higher the rankings.Tip: Use links to other videos in your description if they’re relevant. When using hashtags, consider the keywords you have discovered with Semrush and your YouTube traffic source report. Finally, don’t go overboard with the use of tags. Use this Chrome extension to find out all the tags on a video. Brain Dean recommends having your first tag as your target keyword.TimestampsTimestamps allow video creators to link to specific “moments” of a video so viewers can easily navigate to certain parts of a video. Timestamps even appear on Google SERP with the video. Timestamps now provoke quite some discussions among YouTubers, with some thinking that timestamps decrease the length of viewership and others expecting an engagement increase.Our study shows that videos with timestamps make up 8% of all videos that rank for the first position. Position Number of videos Share among all the videos at the same position Share among all the videos with timestamps 1 162 1.1% 8.2% 2 167 1.2% 8.4% 3 198 1.4% 10% 4 222 1.5% 11% 5 199 1.4% 10% 6 216 1.5% 11% 7 198 1.4% 10% 8 196 1.4% 9.8% 9 206 1.4% 10.3% 10 220 1.5% 11% We may infer that for search rankings, timestamps don’t make much of a difference. However, this sample predominantly contains shorter videos that don’t typically feature timestamps. For longer videos, they can have increasing importance.With “how-to” keywords, only 4% of videos from our sample have timestamps in the description. This number doesn’t change significantly with the position.As for the “to add or not to add” question, since both watch time and engagement have equal importance when it comes to YouTube SEO, it’s always best to experiment in this case and see how your rankings and other metrics change with or without timestamps.Tip: There is no magic number when it comes to timestamps, but don’t go overboard. Make sure you list timestamps in chronological order (based on the video's timeline) and keep the timestamp label to the point but descriptive.Exploring YouTube SEO Specifics for “How-to” Keywords vs. Other KeywordsWe analyzed 1,165 keywords that start with “how-to.” We chose “how-to” queries because they usually represent the educational intent and those videos people mostly find from searches. So our assumption was that search optimization should be more important for them than for other keywords.Here are the main differences from the general results. Video duration (in seconds)For general keywords, the median video duration was 16 minutes and 53 seconds, while it was at 7 minutes and 57 seconds for “how-to” keywords. If the general keywords’ top-performing videos were typically of an average length, in the “how-to” case, they are on the longer end of the spectrum. Number of words in the descriptionThe average number of words in a description for general keywords was 152 versus 107 words for “how-to” keywords. Using YouTube SEO Insights for Growing Our YouTube ChannelOver a year ago, we began optimizing our own videos on the Semrush YouTube Channel. We launched the YouTube finetuning campaign to better address users’ queries, as well as to improve our videos’ positions across YouTube’s search results. As a result, organic traffic to our videos grew by 37%.Here are some of the quickest tweaks that brought the largest impact to our rankings and overall channel’s performance: Added long descriptions (at least 2,000 symbols, 400-600 words); Used timestamps and tags in all the videos (in our case, timestamps did not affect watch times and even positively affected our user engagement stats); Added 2-3 main keywords in video titles to fulfill search intent.In this video, we reveal our proven YouTube SEO tips. Final WordsNow that you are equipped with data-driven insights from our YouTube SEO study and even have a heads up from our own YouTube growth experience, here’s a final checklist to go through once you start your YouTube optimization journey: When considering competition, don't let their channel size discourage you. With some keywords, the number of subscribers doesn't always matter. Focus more on creating a quality video that fully addresses a user’s query. Give your video the attention it deserves by sharing it across multiple social media channels (Twitter, Facebook, Instagram, Pinterest, Quora). A good YouTube channel has strong engagement metrics. Make sure the content you upload entices users to engage by having a motivating intro and outro. Get creative with your titles to encourage users to click. No matter what type of video you’re uploading, make sure you have an elaborate and compelling description. Utilize the power of tags and hashtags and make the most of your channel’s insights. Leverage what you have complete control of. Take advantage of free tools and chrome extensions, such as Video Rank Tracker, TubeBuddy and vidIQ, that will help you in YouTube rank monitoring, analytics, competitor scouting, and more.",
  "headers": [
    {
      "level": "H1",
      "text": "YouTube SEO Study: Insights & Data to Help You Rank Higher"
    },
    {
      "level": "H2",
      "text": "YouTube SEO Study: Key Takeaways"
    },
    {
      "level": "H2",
      "text": "What Is YouTube SEO?"
    },
    {
      "level": "H3",
      "text": "Study Methodology"
    },
    {
      "level": "H3",
      "text": "Machine Learning Model"
    },
    {
      "level": "H3",
      "text": "Dissecting YouTube’s Ranking Algo"
    },
    {
      "level": "H3",
      "text": "When It Comes to YouTube SEO, Do Growth Dynamics Matter?"
    },
    {
      "level": "H4",
      "text": "Subscribers"
    },
    {
      "level": "H4",
      "text": "Views"
    },
    {
      "level": "H3",
      "text": "Assessing How Engagement Metrics Affect YouTube Rankings"
    },
    {
      "level": "H4",
      "text": "Likes"
    },
    {
      "level": "H4",
      "text": "Dislikes"
    },
    {
      "level": "H4",
      "text": "Comments"
    },
    {
      "level": "H3",
      "text": "Video Features and Elements’ Impact On YouTube Rankings"
    },
    {
      "level": "H4",
      "text": "Video duration"
    },
    {
      "level": "H4",
      "text": "Titles and descriptions"
    },
    {
      "level": "H4",
      "text": "Number of links, hashtags, and tags in the description"
    },
    {
      "level": "H4",
      "text": "Timestamps"
    },
    {
      "level": "H2",
      "text": "Exploring YouTube SEO Specifics for “How-to” Keywords vs. Other Keywords"
    },
    {
      "level": "H2",
      "text": "Using YouTube SEO Insights for Growing Our YouTube Channel"
    },
    {
      "level": "H2",
      "text": "Final Words"
    },
    {
      "level": "H6",
      "text": "Most popular pages"
    },
    {
      "level": "H6",
      "text": "SEO Checklist: 41 Tips to Optimize Your Website"
    },
    {
      "level": "H6",
      "text": "How to Perform a Complete SEO Audit (in 14 Steps)"
    },
    {
      "level": "H6",
      "text": "A Beginner’s Guide to Keyword Search Volume"
    }
  ],
  "author": ""
}