{
  "url": "https://www.similarweb.com/blog/research/company-research/research-companies/",
  "slug": "research-companies",
  "title": "How to Research a Company: The Ultimate Guide | Similarweb",
  "description": "A guide to company research that shows you all the important metrics you should be considering in 2022. Follow our 8 steps and get it done in a day.",
  "content": "HomeBlogResearchCompany ResearchHow to Research a Company: The Ultimate Guide Research Intelligence How to Research a Company: The Ultimate Guide Free trial of Similarweb by Liz March , Digital Research Specialist 8 Min. May 23, 2022 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Good company research can take many forms. Depending on your research goals, you might want to look at the strengths, weaknesses, opportunities, and threats of a market, or drill down into key industry leaders and emerging players to unpack their successes. If you want to beat the competition, you need to know their business as well (if not better) than your own. The more intel you have, the quicker you’ll be able to spot and leverage opportunities, respond to market changes, and grow. Read on to discover how to research a company online, tear down its strategies, and take over its market share. What is company research? Company research gathers and analyzes information about a business and its customers. This means understanding its performance data and target audience so you can optimize your own strategy. In today’s fiercely competitive markets, doing good company research is a game-changer. In fact, a 2022 report on competitive intelligence found that 98% of businesses believe researching their competitors is vital for success. If you have the right tools to collect accurate competitive intelligence, you’ll be able to anticipate your competitors’ moves and emerging threats to stay ahead and succeed. How to do company research in 8 steps Researching a company is a bit like doing detective work. The deeper you go, the more questions you ask, and the more curious you are, the better the outcome will be. Here are eight steps to steer you through the process of doing company research. 1. Track top competitors You want to know exactly what your rivals are doing, where they’re going, and how the competitive landscape is changing. With this data, you can carefully plan your next move and take action when and where it’s needed most. Competitive tracking tools like Similarweb give you the ability to track what your rivals are up to. You can measure each competitor’s digital footprint, and identify any changes or growth over time. Did someone experience a sudden uptick in website visits? Would you like to know why and how? Perhaps they launched a new feature or ad campaign, or maybe its social channel is driving growth. With Similarweb Research Intelligence, you get alerts about changes so you can be sure you’ll never miss a beat. Analyzing the top performers in your industry will give you new ideas and provide targets for what is achievable for you. Similarweb’s Analyze Industry Leaders tool will tell you who is winning in your industry based on their website performance. A Market Quadrant Analysis graph, or competitive matrix, provides a visual snapshot of the websites in your industry and how they compare based on different metrics. The industry leaders may inspire you to try new things, while the weaker competitors in your industry can provide you with swift opportunities to chip into their market share. Pro tip: Similarweb’s Similar Sites tool helps you uncover up to 40 domains that are similar to yours. Finding these domains can be infinitely useful when conducting a competitive content analysis. You can audit these domains to learn more about their content strategy and upgrade your own. 2. Benchmark Now that you have a good view of the market, you need to drill down into your competitors’ performance. You want to understand their metrics and KPIs so you can benchmark them against your own. A company research and analysis tool can help you understand your competitors’ digital reach and performance. You can look at multiple websites or domains owned by a single company to analyze their aggregated data or look at a specific market. This will give you a good idea of the business’ size and market share. You’ll also want to look at their engagement metrics and any changes over time. If you see their metrics improving, they are probably investing in a digital strategy. You should look into this to see what has been working for them. We’ll show you how in the next section. Pro Tip: Don’t forget to look at mobile app intelligence too. There are five key metrics you’ll want to track when benchmarking an app: Engagement Retention Installs Rank Demographics 3. Compare traffic and engagement These days, it’s no longer enough to consider website traffic and engagement metrics on their own. The complete digital perspective of any company includes mobile app intelligence, alongside traditional desktop and mobile web metrics. You need to see the full picture before you make any judgments or decisions. Using Similarweb digital intelligence, I wanted to view the key players in the travel industry – specifically travel booking sites, like booking.com, Expedia, and Airbnb. First, I want my company research to focus on mobile web and desktop traffic alone. Using Similarweb Digital Research Intelligence, I can see the overall benchmarks for traffic and engagement. This shows metrics like monthly visits, unique visitors, pages per visit, bounce rate, and visit duration. The top websites include booking.com, Airbnb, Expedia, Agoda, and Hotels.com. So, in essence, these are my industry leaders. However, knowing how important apps are these days to consumers, I want to consider app intelligence in my company research too. When I add this data into the mix, things look a little different. On both Android and iOS: Expedia, Airbnb, VRBO, booking.com, and Hopper are my top five. Now, my view of industry leaders has changed. We’ve got three key players who are leading desktop, mobile web, and app platforms; and four others, who respectively dominate different channels. Here, you can see a range of engagement metrics that apply to mobile apps on Android. Including active users, number of sessions, and session times; which shows engagement, upturns, downturns, and opportunities at a glance. So, when you view traffic and engagement metrics, make sure you explore desktop, mobile web, and app intelligence to get an accurate picture of what’s really going on. 4. View audience interests Understanding cross-browsing behavior tells you what other sites your users are interested in. Maybe they are looking at other products and solutions like yours! This audience interests tool allows you to evaluate the browsing behavior of your target audience, helping you understand user intent and their purchasing process. You might even discover new markets or a specific niche audience, and come up with new audience acquisition strategies. 5. Pinpoint audience overlap Who else holds your potential customer’s attention? With Similarweb’s Audience Overlap feature, you can analyze metrics and insights on the overlap of visitors across up to five websites for a selected time period and geographical region. You’ll be able to determine the size of your total addressable audience, evaluate what part of the audience is shared, and pinpoint your unreached audience potential. This is also a good way to gauge audience loyalty. You’ll see the proportion of monthly active users who look at multiple sites in the same category or just one site. 6. Analyze specific pages While a company may be your competitor, you may not be competing on every front. You might only want to look at a particular segment of a business when doing your company research. This ensures that your insights are specific and useful, and leave out less relevant information. Similarweb’s Segment Analysis tool lets you slice the URL of a website to analyze just the parts that are relevant to you. You can deconstruct their website to look at a specific category, topic, brand, or whatever else interests you. This can help you benchmark a specific line of business or individual products. This analysis is extremely powerful for marketing and sales managers, data analysts, and BI specialists who want to optimize their strategies for specific business segments. For example, if you are a clothing retailer looking to launch a line of kids’ clothes, you can use this tool to analyze your competitors’ kids’ clothing lines. 7. Reveal successful conversion strategies What makes customers convert? The only way to know for sure is to analyze conversion data across your industry. You need to understand the conversion funnel, which keywords and marketing channels drive traffic, and which trends your potential customers are interested in. You can get a unique view of your industry’s conversion data with Similarweb’s Conversion Analysis tool. Check out each company’s conversion efficiency and how they scale over time. You can identify efficient marketing channels, go-to-market strategies, and their ROI for marketing spending. You can also benchmark your metrics across the industry average. Understanding conversion strategies also reveals opportunities for your own growth. You can examine category performance at top retailers such as Amazon, Walmart, and Target, and identify what consumers are searching for at the different retailers and what converts. When you understand the customer journey, you can better position yourself to guide them toward purchasing from you. 8. Research mobile app performance When you research a business, you need to look at all customer touchpoints. Today, that means analyzing apps alongside web and mobile web traffic. You want to know how well your competitors’ apps rank so you can focus on your own app strategy. With rapid consumer adoption of mobile-first spending (46% of people now complete a full purchase via mobile), app intelligence is a key consideration for any type of company research. In almost every industry, the digital landscape changes when you add app intelligence metrics. If you’re looking at apps competitively, you want to consider: Downloads Monthly/Daily Active Users No. of sessions/session time Sessions per user Overall rank Category rank User retention App demographics Similarweb App Intelligence Premium now provides a few ways to help you view app rankings, downloads, engagement, and usage metrics across both Android and iOS. From benchmarking an app to unpacking the successes of those with apps in your market; good company research should include app analysis. By unifying digital insights, you see a truer picture of a company’s successes online. How to research a company like an expert Follow these eight steps and you’ll quickly be able to research any company in any niche like a pro. Uncover key insights that tell you more about a market, target audience, or competitors to shape your own strategy for success. Ready to get growing? Grab a free trial of Similarweb today. See Similarweb In Action Don't miss out! Have the latest data at your fingertips. Try Similarweb free FAQ Why do company research? Your business doesn’t exist in a vacuum. You’re competing with other companies and operating in an industry that has its own norms and expectations. If you want to succeed, you need to research other companies in your industry to ensure your strategy is aligned, but also positioned to give you a competitive advantage. You won’t be able to do this without researching other companies. What to look for when researching a company? You want to review all their company metrics, including traffic and engagement metrics, and look at their strategy, focus, processes, and content. You should search for any interesting ideas and identify where the company excels. All the data you collect will be valuable for you to compete. What can company research tell you? Good company research shows you how a market, company, and its target audience’s interests change over time. It can help you develop your own strategy for growth, and shows trends and emerging threats to watch out for. by Liz March Digital Research Specialist Liz March has 15 years of experience in content creation. She enjoys the outdoors, F1, and reading, and is pursuing a BSc in Environmental Science. Related Topics: Company Research This post is subject to Similarweb legal notices and disclaimers. Related Posts Research Intelligence Competitive Matrix Types: Which Is Right For You? Company Research Market Research by Liz March 10 Min. Oct 15, 2024 Marketing Intelligence How to Conduct a Social Media Competitor Analysis: 5 Quick Steps Business Benchmarking Company Research by Leah Messenger 7 Min. Feb 23, 2024 Research Intelligence Most Popular Messaging Apps Worldwide 2023 Company Research Market Research by Liz March 6 Min. Jan 31, 2023 Research Intelligence Market Sizing: Measuring Your TAM, SAM, and SOM Company Research Market Research by Liz March 8 Min. Jun 10, 2022 Marketing Intelligence How To Create Better Competitive Analysis Reports Ad Intelligence Affiliate Marketing by Ruth Trucks 11 Min. Apr 5, 2022 Updates Fresh Updates: Analyze Entire Companies With Company Analysis Company Research Product Updates by Chloe Nicholls 3 Min. Mar 24, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "How to Research a Company: The Ultimate Guide"
    },
    {
      "level": "H2",
      "text": "What is company research?"
    },
    {
      "level": "H2",
      "text": "How to do company research in 8 steps"
    },
    {
      "level": "H3",
      "text": "1. Track top competitors"
    },
    {
      "level": "H3",
      "text": "2. Benchmark"
    },
    {
      "level": "H3",
      "text": "3. Compare traffic and engagement"
    },
    {
      "level": "H3",
      "text": "4. View audience interests"
    },
    {
      "level": "H3",
      "text": "5. Pinpoint audience overlap"
    },
    {
      "level": "H3",
      "text": "6. Analyze specific pages"
    },
    {
      "level": "H3",
      "text": "7. Reveal successful conversion strategies"
    },
    {
      "level": "H3",
      "text": "8. Research mobile app performance"
    },
    {
      "level": "H2",
      "text": "How to research a company like an expert"
    },
    {
      "level": "H2",
      "text": "FAQ"
    },
    {
      "level": "H3",
      "text": "Competitive Matrix Types: Which Is Right For You?"
    },
    {
      "level": "H3",
      "text": "How to Conduct a Social Media Competitor Analysis: 5 Quick Steps"
    },
    {
      "level": "H3",
      "text": "Most Popular Messaging Apps Worldwide 2023"
    },
    {
      "level": "H3",
      "text": "Market Sizing: Measuring Your TAM, SAM, and SOM"
    },
    {
      "level": "H3",
      "text": "How To Create Better Competitive Analysis Reports"
    },
    {
      "level": "H3",
      "text": "Fresh Updates: Analyze Entire Companies With Company Analysis"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Liz March"
}