{
  "url": "https://www.similarweb.com/blog/insights/cryptocurrency-news/coinbase-grows-us-uk-crypto-app-users/",
  "slug": "coinbase-grows-us-uk-crypto-app-users",
  "title": "Coinbase Grows US, UK Crypto App Users | Similarweb",
  "description": "In two key markets, Coinbase is ahead of rivals in app usage and widening its lead. In the US, active users rose 71% over the last year.",
  "content": "HomeBlogInsightsCryptocurrency NewsCoinbase Grows US, UK Crypto App Users Insights Coinbase Grows US, UK Crypto App Users by David F. Carr 5 Min. August 23, 2024 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic In two key markets, Coinbase is ahead of rivals in app usage and widening its lead. In the US, monthly active users were up 71% over last year as of July. By a wide margin, Binance is the largest of the cryptocurrency exchanges by trading volume, web visits, and app usage worldwide. But in the US and UK, it lags far behind Coinbase in app usage. Because apps play an important role in the crypto financial and software ecosystem, it’s significant that Coinbase is on a growth track in app usage, building on its reputation for providing a consumer-friendly experience. Binance may become even less of a factor in the US following a series of civil and criminal rulings against the company. Coinbase has struggled with regulatory challenges as well, including an SEC lawsuit. In the UK, Binance’s business has been stalled by conflict with regulators, and regulators also recently fined Coinbase, alleging a lack of financial crime prevention controls. Meanwhile, here is how the competitive digital landscape has been shaping up. Key takeaways In the US, the Coinbase exchange app had 16.7M monthly active users in July, up 71% year-over-year (YoY) and 3.1% month-over-month (MoM), according to Similarweb estimates. The next most popular exchange app, Crypto.com, had 2M monthly active users. In the UK, the Coinbase app’s growth isn’t quite as pronounced, but in July it had 1.3M monthly active users, compared with 279.5K for Binance. That’s a reversal from a few years ago, when Binance was in the lead. On the other hand, the Binance app remains among the most used cyrpto apps in the UK despite the fact that the company stopped accepting new customers in October. The US user base for Coinbase has also pulled ahead of usage for Robinhood, a more diversified consumer finance app that supports crypto trading. Smaller but fast growing crypto apps in the US include OKX, with active users up 260% YoY, Blockchain.com’s crypto wallet up 164.6% and Bybit, up 50.7%. Worldwide, the Binance app leads Coinbase in monthly active users by 5-to-1, judging by estimates for Android. On the web, binance.com drew 53.9M visitors in July, compared with 32.2M for coinbase.com. Binance also operates several country-specific websites, including binance.us for the US market. Coinbase increases an already big lead in the US Not only is Coinbase significantly ahead, but it has been growing its lead in recent months. The growth of the iOS version has been particularly strong, +87.9% YoY. Here is a little more detail on how some of the numbers break down for popular crypto apps. Smaller but fast growing crypto apps include OKX, with active users up 260% YoY, Blockchain.com’s crypto wallet up 164.6% and Bybit, up 50.7%. Monthly Active Users, iOS and Android, US July 2024 YoY MoM Coinbase: Buy Bitcoin & Ether 16.7M 71.2% 3.1% Coinbase Wallet: NFTs & Crypto 2.4M 101.5% -19.1% Crypto.com – Buy Bitcoin, ETH 2.0M 0.4% 2.5% Blockchain.com: Crypto Wallet 817.8K 164.6% -28.5% Binance.US: Buy Bitcoin & ETH 621.0K 0.6% -28.7% Kraken – Buy Bitcoin & Crypto 323.1K -44.7% 4.1% OKX: Buy Bitcoin BTC & Crypto 300.3K 260.0% -11.8% Gemini: Buy Bitcoin & Crypto 246.7K -36.4% -25.5% Crypto.com l DeFi Wallet 220.1K 31.8% 1.4% Bybit: Buy Bitcoin & Crypto 170.1K 50.7% 36.6% Coinbase edges ahead of Robinhood In the US, Coinbase has had a rival in Robinhood, a consumer finance app that supports crypto trading but is not exclusively focused on crypto. Coinbase’s growth in active users have put it ahead of Robinhood by that measure in recent months. Coinbase leapfrogs Binance, solidifies lead in the UK Coinbase has the leading crypto app in the UK and pulled farther ahead of Binance in both app monthly active users and website visitors in mid-2023 as regulatory issues for Binance intensified. Although YoY usage was down slightly in July, the gap between Coinbase and Binance user counts has been growing wider. Monthly Active Users, iOS and Android, US Jul 2024 YoY MoM Coinbase: Buy Bitcoin & Ether 1.3M -3.4% 6.6% Binance 729.5K -31.0% -0.6% Crypto.com – Buy Bitcoin, ETH 470.8K -11.1% -2.5% KuCoin: Buy Bitcoin &amp; Crypto 110.6K -24.1% Coinbase Wallet: NFTs & Crypto 83.9K -25.8% Similarweb tracks a longer list of apps on Android than on iOS, and we’ve shared an Android only summary below. The trend is similar for Coinbase and Binance, but we can see strong growth for OKX, Kraken, and Bitget as well. Monthly Active Users, iOS and Android, UK Jul 2024 YoY MoM Coinbase: Buy Bitcoin & Ether 245.4K -4.2% 5.7% Binance 186.1K -30.7% 2.5% Crypto.com – Buy Bitcoin, ETH 164.4K -6.0% 0.2% OKX: Buy Bitcoin BTC & Crypto 120.7K 113.7% 2.1% KuCoin: Buy Bitcoin &amp; Crypto 67.1K -35.9% -24.4% Kraken – Buy Bitcoin & Crypto 55.6K 88.1% 51.2% Coinbase Wallet: NFTs & Crypto 50.6K -48.6% -25.0% Bybit: Buy Bitcoin & Crypto 48.8K -8.0% -2.9% Kraken Pro: Crypto Trading 43.9K 115.7% 6.7% Bitget – Buy & Sell Crypto 29.2K 211.4% -3.4% MEXC-Buy & Sell Bitcoin 27.0K 59.7% -9.5% Blockchain.com: Crypto Wallet 26.9K -17.6% -18.0% Binance remains dominant worldwide Coinbase’s dominance in the US contrasts with Binance’s stronger position worldwide. While Binance has been hobbled by regulatory restrictions in the US and UK, Coinbase established itself in the US and has been working to expand worldwide. If we look at global app usage estimates (based on Android), Binance far ahead, with Bybit and OKX also ahead of Coinbase. The Similarweb Insights & Communications team is available to pull additional or updated data on request for the news media (journalists are invited to write to press@similarweb.com). When citing our data, please reference Similarweb as the source and link back to the most relevant blog post or similarweb.com/blog/insights/. Contact: For more information, please write to press@similarweb.com. Methodology Disclaimer: All names, brands, trademarks, and registered trademarks are the property of their respective owners. The data, reports, and other materials provided or made available by Similarweb consist of or include estimated metrics and digital insights generated by Similarweb using its proprietary algorithms, based on information collected by Similarweb from multiple sources using its advanced data methodologies. Similarweb shall not be responsible for the accuracy of such data, reports, and materials and shall have no liability for any decision by any third party based in whole or in part on such data, reports, and materials. by David F. Carr David covers social media, digital advertising, and generative AI. With a background in web trends since the 1990s, he’s also the author of \"Social Collaboration for Dummies\". Related Topics: Cryptocurrency News This post is subject to Similarweb legal notices and disclaimers. Related Posts Insights Sweat Wallet is the Fastest Growing Financial App in the US Cryptocurrency News by David F. Carr 5 Min. Jun 11, 2024 Insights Robinhood Engagement Down 36.8% on Web, 34% on Apps Cryptocurrency News by David F. Carr 4 Min. May 4, 2023 Insights Crypto.com Suffers Biggest Loss of Traffic Among US Cryptocurrency Exchanges, Down Nearly 60% Cryptocurrency News by David F. Carr 3 Min. Apr 19, 2023 Insights Cryptocurrency Exchanges: Down Overall, Coinbase Losing Share Cryptocurrency News by David F. Carr 3 Min. Mar 17, 2023 Insights How World Cup Offline Advertising Drove Online Traffic for Crypto.com Cryptocurrency News by Similarweb 4 Min. Jan 11, 2023 Insights Coinbase Web and App Metrics Trended Down with Crypto Market in Q2 Cryptocurrency News by David F. Carr 3 Min. Aug 3, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Coinbase Grows US, UK Crypto App Users"
    },
    {
      "level": "H2",
      "text": "In two key markets, Coinbase is ahead of rivals in app usage and widening its lead. In the US, monthly active users were up 71% over last year as of July."
    },
    {
      "level": "H2",
      "text": "Key takeaways"
    },
    {
      "level": "H2",
      "text": "Coinbase increases an already big lead in the US"
    },
    {
      "level": "H3",
      "text": "Monthly Active Users, iOS and Android, US"
    },
    {
      "level": "H2",
      "text": "Coinbase edges ahead of Robinhood"
    },
    {
      "level": "H2",
      "text": "Coinbase leapfrogs Binance, solidifies lead in the UK"
    },
    {
      "level": "H3",
      "text": "Monthly Active Users, iOS and Android, US"
    },
    {
      "level": "H3",
      "text": "Monthly Active Users, iOS and Android, UK"
    },
    {
      "level": "H2",
      "text": "Binance remains dominant worldwide"
    },
    {
      "level": "H3",
      "text": "Sweat Wallet is the Fastest Growing Financial App in the US"
    },
    {
      "level": "H3",
      "text": "Robinhood Engagement Down 36.8% on Web, 34% on Apps"
    },
    {
      "level": "H3",
      "text": "Crypto.com Suffers Biggest Loss of Traffic Among US Cryptocurrency Exchanges, Down Nearly 60%"
    },
    {
      "level": "H3",
      "text": "Cryptocurrency Exchanges: Down Overall, Coinbase Losing Share"
    },
    {
      "level": "H3",
      "text": "How World Cup Offline Advertising Drove Online Traffic for Crypto.com"
    },
    {
      "level": "H3",
      "text": "Coinbase Web and App Metrics Trended Down with Crypto Market in Q2"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by David F. Carr"
}