{
  "url": "https://www.similarweb.com/blog/insights/cryptocurrency-news/cryptocurrency-news-traffic/",
  "slug": "cryptocurrency-news-traffic",
  "title": "How Cryptocurrency News Tracks Market Moves | Similarweb",
  "description": "The digital publishers for cryptocurrency news and market data see traffic ebb and flow with the market, but we look at who is capturing a bigger share.",
  "content": "HomeBlogInsightsCryptocurrency NewsHow Cryptocurrency News Tracks Market Moves Insights How Cryptocurrency News Tracks Market Moves Start your free trial by David F. Carr 2 Min. March 5, 2022 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic The ups, downs, and evolution of cryptocurrency are increasingly covered by mainstream media and traditional investor news publications, but to really dig into them, investors turn to news and information sites dedicated to crypto. Similarweb evaluated the most visited Crypto-related news sites and found: CoinMarketCap is a giant in this niche, attracting 549.8 million visits in January, according to Similarweb estimates. CoinDesk traffic spiked to 63.8 million visits in May 2021, the month of a crash in the price of Bitcoin. Exploding demand for crypto news is a pattern we see in every boom and bust. CoinMarketCap attracted more than 272 million visits or four times CoinDesk’s total. News or just numbers? CoinMarketCap is a market data site, so visitors primarily go straight to pages showing price and volume fluctuations for Bitcoin, Ethereum, and other currencies. The site offers some news and feature content, but Cointelegraph and Coindesk are much more focused on news and analysis. Still, it’s noteworthy that CoinMarketCap snagged nearly 17 times more visits than the next most popular news and information website, according to Similarweb estimates, in addition to conquering engagement measures like average pages per visit (2.97) and visit duration (almost six minutes). Cointelegraph has been attracting more visitors than CoinDesk in recent months. However, CoinDesk had a significant lead in traffic for most of 2021, getting 63.8 million visits in May. However, Cointelegraph pulled ahead in September 2021 – and neither has topped 20 million visits since. How the sites rank Here’s what the ranking looks like for the sites we looked at: And here’s what it looks like without CoinMarketCap in the mix: For more detail, download the full report. The Similarweb Insights Newsroom is available to pull additional or updated data on request for the news media (journalists are invited to write to press@similarweb.com). Please link back to this post as a reference for readers. Download the full report by David F. Carr David covers social media, digital advertising, and generative AI. With a background in web trends since the 1990s, he’s also the author of \"Social Collaboration for Dummies\". Related Topics: Cryptocurrency News This post is subject to Similarweb legal notices and disclaimers. Related Posts Insights Coinbase Grows US, UK Crypto App Users Cryptocurrency News by David F. Carr 5 Min. Aug 23, 2024 Insights Sweat Wallet is the Fastest Growing Financial App in the US Cryptocurrency News by David F. Carr 5 Min. Jun 11, 2024 Insights Robinhood Engagement Down 36.8% on Web, 34% on Apps Cryptocurrency News by David F. Carr 4 Min. May 4, 2023 Insights Crypto.com Suffers Biggest Loss of Traffic Among US Cryptocurrency Exchanges, Down Nearly 60% Cryptocurrency News by David F. Carr 3 Min. Apr 19, 2023 Insights Cryptocurrency Exchanges: Down Overall, Coinbase Losing Share Cryptocurrency News by David F. Carr 3 Min. Mar 17, 2023 Insights How World Cup Offline Advertising Drove Online Traffic for Crypto.com Cryptocurrency News by Similarweb 4 Min. Jan 11, 2023 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "How Cryptocurrency News Tracks Market Moves"
    },
    {
      "level": "H2",
      "text": "News or just numbers?"
    },
    {
      "level": "H2",
      "text": "How the sites rank"
    },
    {
      "level": "H2",
      "text": "Download the full report"
    },
    {
      "level": "H3",
      "text": "Coinbase Grows US, UK Crypto App Users"
    },
    {
      "level": "H3",
      "text": "Sweat Wallet is the Fastest Growing Financial App in the US"
    },
    {
      "level": "H3",
      "text": "Robinhood Engagement Down 36.8% on Web, 34% on Apps"
    },
    {
      "level": "H3",
      "text": "Crypto.com Suffers Biggest Loss of Traffic Among US Cryptocurrency Exchanges, Down Nearly 60%"
    },
    {
      "level": "H3",
      "text": "Cryptocurrency Exchanges: Down Overall, Coinbase Losing Share"
    },
    {
      "level": "H3",
      "text": "How World Cup Offline Advertising Drove Online Traffic for Crypto.com"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by David F. Carr"
}