{
  "url": "https://www.similarweb.com/blog/insights/cryptocurrency-news/fastest-growing-financial-apps/",
  "slug": "fastest-growing-financial-apps",
  "title": "Sweat Wallet is the Fastest Growing Financial App in the US | Similarweb",
  "description": "Crypto / fitness app Sweat Wallet monthly active users rose more than 5,000% year-over year. Credit access/score boosting apps also grew",
  "content": "HomeBlogInsightsCryptocurrency NewsSweat Wallet is the Fastest Growing Financial App in the US Insights Sweat Wallet is the Fastest Growing Financial App in the US Start your free trial by David F. Carr 5 Min. June 11, 2024 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Crypto / fitness app Sweat Wallet monthly active user count was up more than 5,000% year-over year in May. Apps promising to help consumers get and build credit are also growing quickly The fastest growing financial app in the US is Sweat Wallet, a crypto wallet related to Sweat Coin, a cryptocurrency designed to reward physical activity (as in, it’s a step counter app that lets you “mine” coins by walking or running). Sweat Wallet stood out in Similarweb’s analysis of more than 100 of the most popular consumer finance apps, based on monthly active users (MAU) for iOS and Android, combined. Below, we look at the top 10 fastest-growing finance apps, as well as the ones with the most users. This multi-platform analysis doesn’t cover one giant of the industry, Apple Pay, which is tightly tied to iOS, or other apps that don’t exist on both of the two major app platforms. Key takeaways Half of the top 10 fastest-growing apps promise to help consumers get faster access to credit or build their scores. Two of the top 10 are crypto apps: Sweat Wallet and the app for the OKX cryptocurrencies exchange. Two of the top 10, Ria Money Transfer and Taptap Send, are used for international money transfers. The fast-growing apps we’re highlighting are a small fraction of the size of Cash App, with active users up 19.8% year-over-year but on a much larger base – to 138.8 million monthly active users in the US, according to Similarweb estimates. The growth champions This graph shows the relative magnitude of growth for the top apps on our list, Sweat Wallet (iOS) (Android) grew from tens of thousands of monthly active users a year ago to 1.8 million in May 2024, according to Similarweb estimates. The user estimates cited in this report are for iOS and Android combined for users in the US. Here are the top 10 on our list, ranked by year over year growth for the month of May, with their combined number of monthly active users in millions (M) or thousands (K), plus a sentence from each app’s app store listing. Click on the iOS and Android links for more detail about app performance on that platform. Sweat Wallet app (iOS) (Android), +5,191% / 1.8M “The easiest way to walk into crypto. With no payment required, anyone can start minting SWEAT, a cryptocurrency, with their steps.” Atlas – Rewards Credit Card app (iOS) (Android), +724% / 2.9M “Atlas is a rewards credit card with 4x higher approval rates than traditional credit cards. It’s designed to be easy to get even without an existing credit history.” OKX: Buy Bitcoin BTC & Crypto app (iOS) (Android), +514% / 293.8K “OKX is one of the most secure and trusted cryptocurrency exchange apps in the world to trade and buy Bitcoin (BTC), Ethereum (ETH), Ripple (XRP), Tether (USDT), Dogecoin (DOGE), and other cryptos.” One – Mobile Banking app (iOS) (Android) +458% / 2.4M “One is a financial technology company, not a bank. Banking services provided by Coastal Community Bank, Member FDIC.” Credit Genie: Get Cash Advance app (iOS) (Android) +386% / 3.9M “Improve your financial health with breakthrough financial tools and services from Credit Genie, and find better ways to budget your spending.” Deferit: Pay bills in 4 app (iOS) (Android) 303% / 382.2K “Move payments and stay on top of your bills all from within the app.” Ria Money Transfer: Send Money app (iOS) (Android) +234% / 884.3K “Send money online to anywhere in the world with the Ria Money Transfer app — the international money transfer service provider trusted for over 35 years to provide among the best exchange rates and lowest fees in the industry.” Taptap Send: Send money abroad app (iOS) (Android) +225% / 841.6K “Transfer money abroad quickly, at great rates, straight from your phone.” Kikoff – Build Credit Quickly app (iOS) (Android) +211.8% / 2.5M “If you’re ready to build your credit, Kikoff is the fastest, smartest, and easiest way to do it.” Dovly: Grow your Credit Score app (iOS) (Android) +207% / 506.7K “Boost your credit score fast with an AI credit engine proven to optimize results. Dovly AI is more than a credit builder, credit repair app or credit monitoring app.” This top 10 list is a snapshot of the currently fastest growing apps, which varies from month to month, but 7 out of 10 were the same when we looked at the numbers for April (with Deferit, Taptap Send, and Kikoff as the new entrants for May) and Sweat Wallet was on top for both periods. Growth trajectories for fast-growing finance apps As much as Sweat Wallet has grown, usage is actually down from its peak popularity in October 2023. Meanwhile, several of the other fastest growing sites that are reaching into the millions of monthly active users have a faster growth trajectory over the past several months – even though their comparison with May 2023 is not quite as dramatic. By month-over-month growth, April to May, we would get a different list of fastest-growing apps: Month over Month BTCC – Trade Bitcoin & Crypto 199.3% Bybit: Buy Bitcoin & Crypto 155.0% Credit Genie: Get Cash Advance 111.7% Rain Instant Pay 88.9% Atlas – Rewards Credit Card 60.7% NerdWallet: Manage Your Money 58.6% Deferit: Pay bills in 4 50.6% The ones not showing up on our year-over-year list include: BTCC – Trade Bitcoin & Crypto app (iOS) (Android) “Our app provides you with a safe and secure environment to trade crypto with the lowest fees in town and up to 150x leverage.” Bybit: Buy Bitcoin & Crypto app (iOS) (Android) “Welcome to Bybit, your gateway to the world of cryptocurrencies.” Rain Instant Pay app (iOS) (Android) “Experience financial freedom with Rain – your key to unlocking your paycheck before payday!” NerdWallet: Manage Your Money app (iOS) (Android) “Track your budget, finances and credit – all in one place and all for free.” Most of the biggest apps are also growing For perspective, the fast-growing apps we’ve featured are breaking into the single millions of monthly active users in the US, but Cash App has well over 100 million, according to Similarweb estimates, and others have tens of millions of MAU. Most are growing strongly, although their scale makes it hard to show the same huge percentage gains as the smaller players. The exception is Venmo, for which has been trending down. Venmo was averaging about 65M MAU in the Spring months of 2023 but was down to 60M as of May 2024. Here’s what the top of the list by user volume looks like: Cash App app (iOS) (Android) 138.8 M, +19.8% Chase Mobile app (iOS) (Android) 61.0M / 34.1% Venmo app (iOS) (Android) 60.1 M / -3.2% Capital One Mobile app (iOS) (Android) 42.3 M, +6.2% Intuit Credit Karma app (iOS) (Android) 32.1 M, +3.5% The Similarweb Insights & Communications team is available to pull additional or updated data on request for the news media (journalists are invited to write to press@similarweb.com). When citing our data, please reference Similarweb as the source and link back to the most relevant blog post or similarweb.com. Methodology Disclaimer: All names, brands, trademarks, and registered trademarks are the property of their respective owners. The data, reports, and other materials provided or made available by Similarweb consist of or include estimated metrics and digital insights generated by Similarweb using its proprietary algorithms, based on information collected by Similarweb from multiple sources using its advanced data methodologies. Similarweb shall not be responsible for the accuracy of such data, reports, and materials and shall have no liability for any decision by any third party based in whole or in part on such data, reports, and materials. by David F. Carr David covers social media, digital advertising, and generative AI. With a background in web trends since the 1990s, he’s also the author of \"Social Collaboration for Dummies\". Related Topics: Cryptocurrency News This post is subject to Similarweb legal notices and disclaimers. Related Posts Insights Coinbase Grows US, UK Crypto App Users Cryptocurrency News by David F. Carr 5 Min. Aug 23, 2024 Insights Robinhood Engagement Down 36.8% on Web, 34% on Apps Cryptocurrency News by David F. Carr 4 Min. May 4, 2023 Insights Crypto.com Suffers Biggest Loss of Traffic Among US Cryptocurrency Exchanges, Down Nearly 60% Cryptocurrency News by David F. Carr 3 Min. Apr 19, 2023 Insights Cryptocurrency Exchanges: Down Overall, Coinbase Losing Share Cryptocurrency News by David F. Carr 3 Min. Mar 17, 2023 Insights How World Cup Offline Advertising Drove Online Traffic for Crypto.com Cryptocurrency News by Similarweb 4 Min. Jan 11, 2023 Insights Coinbase Web and App Metrics Trended Down with Crypto Market in Q2 Cryptocurrency News by David F. Carr 3 Min. Aug 3, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Sweat Wallet is the Fastest Growing Financial App in the US"
    },
    {
      "level": "H2",
      "text": "Crypto / fitness app Sweat Wallet monthly active user count was up more than 5,000% year-over year in May. Apps promising to help consumers get and build credit are also growing quickly"
    },
    {
      "level": "H2",
      "text": "Key takeaways"
    },
    {
      "level": "H2",
      "text": "The growth champions"
    },
    {
      "level": "H2",
      "text": "Growth trajectories for fast-growing finance apps"
    },
    {
      "level": "H2",
      "text": "Most of the biggest apps are also growing"
    },
    {
      "level": "H3",
      "text": "Coinbase Grows US, UK Crypto App Users"
    },
    {
      "level": "H3",
      "text": "Robinhood Engagement Down 36.8% on Web, 34% on Apps"
    },
    {
      "level": "H3",
      "text": "Crypto.com Suffers Biggest Loss of Traffic Among US Cryptocurrency Exchanges, Down Nearly 60%"
    },
    {
      "level": "H3",
      "text": "Cryptocurrency Exchanges: Down Overall, Coinbase Losing Share"
    },
    {
      "level": "H3",
      "text": "How World Cup Offline Advertising Drove Online Traffic for Crypto.com"
    },
    {
      "level": "H3",
      "text": "Coinbase Web and App Metrics Trended Down with Crypto Market in Q2"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by David F. Carr"
}