{
  "url": "https://www.similarweb.com/blog/insights/marketing-insights/progressive-paid-media/",
  "slug": "progressive-paid-media",
  "title": "How Progressive’s Paid Media Strategy Paves the Way to Customer Growth | Similarweb",
  "description": "Discover how Progressive's bold move into paid search has led to a dramatic increase in traffic and market share. Learn how you can apply similar tactics using Similarweb’s digital marketing suite.",
  "content": "HomeBlogInsightsMarketing InsightsHow Progressive’s Paid Media Strategy Paves the Way to Customer Growth Insights How Progressive’s Paid Media Strategy Paves the Way to Customer Growth Start your free trial by Maria Pashi , Data Specialist 4 Min. August 23, 2024 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic In today’s fiercely competitive insurance landscape, standing out is harder than ever. Progressive Insurance, America’s largest motor insurance carrier, has maximized growth across its user acquisition funnel with an aggressive paid media strategy. In this blog post, we dive into the specifics of Progressive’s success, including the PPC spend, winning display ads, and aggregator referrals, and how its approach to paid media has set it apart from key competitors. From Past Progressive to Future Perfect The US insurance industry as a whole grew by 13.4% year-over-year (YoY) in the last 12 months, but Progressive was in a league of its own. The company’s quote request page traffic surged by an incredible 181% YoY, resulting in 13 million more visits than its closest competitor, Geico. Both Geico and Allstate, its next closest rival, recorded YoY traffic growth of 57% and 55%, respectively. Liberty Mutual saw a more modest uptick of 5% YoY growth. The power of paid media In 2024, Progressive made a bold move by massively increasing its investment in paid media. As of June 2024, pay-per-click (PPC) spending increased by 340% YoY. This investment translated into 10.2 million more paid search visits to progressive.com than second-place allstate.com over the past six months. Such a massive push into paid search not only boosted visibility but also drove significant customer acquisition, leaving competitors scrambling to catch up. Alongside its paid search strategy, Progressive’s savvy use of display ads has also contributed to its growth. These are two of the most recent ads active: By tailoring display ads to the right audience segments, Progressive has managed to maintain a strong presence across various digital touchpoints, reinforcing its brand and driving more traffic to quote request pages. Progressive’s significant investment in paid search was central to its customer growth strategy and screamed success as the company captured over 50% of the search traffic for key non-branded keywords like “car insurance” and “auto insurance quotes.” By concentrating on these high-traffic terms, Progressive ensured that it reached potential customers early in their buying journey, making a strong first impression before competitors had a chance. Growth through third-party lead generation platforms Progressive’s growth story doesn’t stop with paid search. The company also capitalized on strategic partnerships with companies like Mediaalpha, which prides itself on being the: “lead-buying platform that helps you connect with high-intent insurance shoppers.” Progressive’s paid strategy led to a 900% YoY increase in aggregator referrals from Mediaalpha, resulting in nearly 1 million additional visits over just three months. This surge underscores the effectiveness of tapping into trusted third-party sources to drive high-intent traffic directly to your site. Enticing the competition’s customers Progressive’s comprehensive, omnichannel paid strategy has also triggered an increase in cross-visitation rates. For instance, 12.5% of visitors from Liberty Mutual and 12% from Geico also visited Progressive on the same day. These figures highlight how effective Progressive is in attracting and converting customers who were initially considering other providers. Driving towards a winning strategy, together Progressive’s aggressive paid search strategy in 2024 has clearly paid off, enabling it to outmaneuver its competitors and secure a dominant position in the insurance industry. By leveraging paid media, strategic partnerships, and targeted advertising, Progressive has set a new standard for customer acquisition. If you’re looking to replicate this success, try Similarweb’s digital marketing suite. Our all-in-one competitive analysis platform offers the tools and insights you need to craft data-driven marketing strategies that can help you gain the edge you need to win online. Ready to win your market? Get the data and insights you need to beat the competition Get a demo Title photo by Brock Wegner on Unsplash. by Maria Pashi Data Specialist With 10+ years in CPG and roles at Unilever and Apple, Maria uses data to shape ecommerce strategies and market insights. Outside work, she loves dancing and exploring. Related Topics: Marketing Insights This post is subject to Similarweb legal notices and disclaimers. Related Posts Insights How Kroger Masters the Online Grocery Space Marketing Insights by Daniel Schneider 5 Min. Aug 7, 2024 Insights ELOREA’s Meteoric Rise in the Digital Perfume Market Marketing Insights by Darrell Mordecai 5 Min. Jul 18, 2024 Insights Birdbuddy’s Soaring Success: How Strategic Marketing Took Flight Marketing Insights by Adelle Kehoe 5 Min. Jul 11, 2024 Insights Wildgrain’s SEO: A Content-Driven Strategy Marketing Insights by Darrell Mordecai 5 Min. Jun 27, 2024 Insights How Greenies Leads the Pack With an Innovative PR Marketing Strategy Marketing Insights by Darrell Mordecai 4 Min. Jun 19, 2024 Insights Sprint to Success: How Running Shoe Brands are Winning Online Marketing Insights by Maria Pashi 5 Min. Jun 13, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "How Progressive’s Paid Media Strategy Paves the Way to Customer Growth"
    },
    {
      "level": "H2",
      "text": "From Past Progressive to Future Perfect"
    },
    {
      "level": "H2",
      "text": "The power of paid media"
    },
    {
      "level": "H2",
      "text": "Growth through third-party lead generation platforms"
    },
    {
      "level": "H2",
      "text": "Enticing the competition’s customers"
    },
    {
      "level": "H2",
      "text": "Driving towards a  winning strategy, together"
    },
    {
      "level": "H3",
      "text": "How Kroger Masters the Online Grocery Space"
    },
    {
      "level": "H3",
      "text": "ELOREA’s Meteoric Rise in the Digital Perfume Market"
    },
    {
      "level": "H3",
      "text": "Birdbuddy’s Soaring Success: How Strategic Marketing Took Flight"
    },
    {
      "level": "H3",
      "text": "Wildgrain’s SEO: A Content-Driven Strategy"
    },
    {
      "level": "H3",
      "text": "How Greenies Leads the Pack With an Innovative PR Marketing Strategy"
    },
    {
      "level": "H3",
      "text": "Sprint to Success: How Running Shoe Brands are Winning Online"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Maria Pashi"
}