{
  "url": "https://www.similarweb.com/blog/insights/airlines-news/european-airlines-web-traffic-still-strong-but-growth-decelerating/",
  "slug": "european-airlines-web-traffic-still-strong-but-growth-decelerating",
  "title": "European Airline Web Traffic Decelerates Heading into Fall | Similarweb",
  "description": "Traffic to leading European airline websites has recovered from pre-pandemic levels. However, the pace of growth slowed sharply in June and July.",
  "content": "HomeBlogInsightsAirline NewsEuropean Airline Web Traffic Decelerates Heading into Fall Insights European Airline Web Traffic Decelerates Heading into Fall Start your free trial by Jim Corridore , Senior Analyst 3 Min. August 15, 2022 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Traffic to leading European airline websites has recovered from pre-pandemic levels, with growth soaring since the pandemic trough which occurred in April 2020. However, the pace of growth slowed sharply in June and July. While demand remains sharply above pandemic levels, falling traffic could be a warning for the fall travel season. Key takeaways Web traffic for ten leading European airlines for the month of July 2022 was 14% higher than experienced in August 2019 (pre-pandemic), showing the recovery from COVID lows. From the pandemic low in April 2020, July traffic numbers were 242% stronger. However, recent web traffic growth has decelerated, with July up 0.5% from June 2022, after June was 0.5% lower than May. July was 22% higher year over year, with June up 45%, May up 98%, and April up 188%, highlighting how momentum has slowed. However, demand seems to have stabilized at current levels over the past three months. Airline web traffic highlights post-pandemic recovery, with deceleration heading into the fall As a proxy for air travel demand, airline web traffic is a good leading indicator. The overwhelming majority of airline reservations are made online. For this reason, airline web traffic portends future air travel. For this report, we tracked ten leading European airlines (Ryanair, Easyjet, Wizz Air, Emirates, British Airways, Lufthansa, Qatar, Air France, Iberia, and Qantas). From the pandemic low in April 2020 to July 2022 monthly web traffic was 242% higher for the airlines as a group. Web Traffic growth has decelerated A look at the below chart on growth rates highlights how sharply web traffic has slowed in recent months. July 2022 saw web traffic growth year over year sharply slow from prior months for most European airlines. The notable exception was Emirates, which experienced a 26% rise in visits to their website in Europe. Interestingly, Ryanair, while maintaining its market share lead over peers in terms of web traffic by a wide margin, saw its growth slow sharply from earlier in the year. Growth in web traffic for Ryanair in February (year over year) was 410%, slowing each month after to 400% in March, 299% in April, 119% in May, 35% in June, and 12% in July. Of course, those growth rates were unsustainably large as Ryanair and the industry started to recover from the pandemic. Ryanair leads the pack by a wide range A look at overall web traffic to European airlines gives us a proxy for market share in the industry. Ryanair leads by a wide range with a 26% share in Europe among the ten airlines we looked at. Second place, lagging by a wide margin, was Easyjet with a 12.5% share of traffic among these ten airlines, followed by Wizz Air with 9.8%. The chart below shows the relative market share for ten European airlines for July 2022. Conclusion While European airline demand has clearly recovered from the deep decline that occurred during the pandemic, heading into fall growth has decelerated. Ryanair remains the clear leader in European traffic, while Emirates saw strong website traffic growth in July. The Similarweb Communications and Insights Team is available to pull additional or updated data on request for the news media (journalists are invited to write to press@similarweb.com). When citing our data, please reference Similarweb as the source and link back to the most relevant blog post or similarweb.com/blog/insights/. Methodology Disclaimer: All data, reports and other materials provided or made available by Similarweb are based on data obtained from third parties, including estimations and extrapolations based on such data. Similarweb shall not be responsible for the accuracy of the materials and shall have no liability for any decision by any third party based in whole or in part on the materials. by Jim Corridore Senior Analyst Jim provides insights across multiple sectors. With 30 years on Wall Street and numerous awards for stock-picking, he is a SUNY Albany graduate. Related Topics: Airline News This post is subject to Similarweb legal notices and disclaimers. Related Posts Insights U.S. Airline Web Traffic Declined 2% in April, Second Consecutive Month of Declines Airline News by Jim Corridore 4 Min. May 8, 2023 Insights U.S. Airline Web Traffic Grew 10% in Q1, But Declined 3% in March Airline News Travel News by Jim Corridore 4 Min. Apr 11, 2023 Insights Air New Zealand Dominates NZ Air Travel Space Airline News by Jim Corridore 3 Min. Mar 13, 2023 Insights U.S. Airline Web Traffic Grew 9% in February 2023, a Slowdown from January’s 25% Gain Airline News by Jim Corridore 3 Min. Mar 8, 2023 Insights U.S. Airline Web Traffic Grew 25% in January, Led By 45% Growth at Frontier, 42% Gain at United Airlines Airline News by Jim Corridore 3 Min. Feb 24, 2023 Insights Ryanair Attracted 27 Million Website Visits in December 2022, Dominating Peers in Europe Airline News by Jim Corridore 3 Min. Feb 6, 2023 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "European Airline Web Traffic Decelerates Heading into Fall"
    },
    {
      "level": "H2",
      "text": "Key takeaways"
    },
    {
      "level": "H2",
      "text": "Airline web traffic highlights post-pandemic recovery, with deceleration heading into the fall"
    },
    {
      "level": "H2",
      "text": "Web Traffic growth has decelerated"
    },
    {
      "level": "H2",
      "text": "Ryanair leads the pack by a wide range"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H3",
      "text": "U.S. Airline Web Traffic Declined 2% in April, Second Consecutive Month of Declines"
    },
    {
      "level": "H3",
      "text": "U.S. Airline Web Traffic Grew 10% in Q1, But Declined 3% in March"
    },
    {
      "level": "H3",
      "text": "Air New Zealand Dominates NZ Air Travel Space"
    },
    {
      "level": "H3",
      "text": "U.S. Airline Web Traffic Grew 9% in February 2023, a Slowdown from January’s 25% Gain"
    },
    {
      "level": "H3",
      "text": "U.S. Airline Web Traffic Grew 25% in January, Led By 45% Growth at Frontier, 42% Gain at United Airlines"
    },
    {
      "level": "H3",
      "text": "Ryanair Attracted 27 Million Website Visits in December 2022, Dominating Peers in Europe"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Jim Corridore"
}