{
  "url": "https://moz.com/blog/category/keyword-research/p11",
  "slug": "p11",
  "title": "Keyword Research - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Neil Patel April 16, 2012 How to Improve Your Rankings with Semantic Keyword Research Keyword Research Don't forget about semantic keyword research to help you focus your content and and improve your rankings. Read this post E By: Ethan Lyon March 16, 2012 How Much Does That Keyword Cost? [TOOL] Keyword Research More and more, SEOs and small business owners are realizing that you cannot pay the electric bills or rent in rankings, and often times, traffic. Google Analytics or other site analytics packages can tell you your most profitable keyword broken down into a dollar value, however, what if you’re not ranking for the keyword but still want to assign a dollar value to it? Read this post By: James Norquay March 14, 2012 50 of the Most Competitive SEO Keywords! Keyword Research So recently I was having a chat to some friends involved in the digital space and they had a question: \"Hey what do you think are the most competitive SEO term in the Australian SEO market?\". Been involved with internet marketing for almost 8 years now I had a good grasp on some of the most difficult terms, I have personally worked in some of the most difficult markets in both Australia and the United States so I thought what better opportunity than to put together some research in this space. Read this post By: Keri Morgret February 28, 2012 Stop Paying for Stupid Clicks: Negative Keywords for Positive ROI Keyword Research One of my guilty pleasures is looking through the search query reports (SQR) of an AdWords campaign for the cringe-worthy search queries that led to someone clicking on a PPC ad. Really Google? You felt that goat transportation cost was related to my keyword of freight costs? Or that a babe cam search should show my ad for digital camera? Sadly, these matches and worse can happen if you lack proper negative keywords. Read this post By: Zack Notes February 23, 2012 How to Forecast Seasonal Keyword Traffic with Google Insights and Python Scripts Keyword Research A while back, I went to a Distilled meetup here in NYC. SEER Interactive's Mark Lavoritano did some cool slides on the seasonality of keywords. Basically, his presentation made the point that you should not only think about which keywords you want to rank for but also WHEN they are most valuable. Read this post By: Rand Fishkin February 14, 2012 Be Careful Using AdWords for Keyword Research Keyword Research For the past decade, most of us in the field of search have relied on Google's AdWords data (either in the public tool, the API or the tools inside AdWords accounts). It's the best source we've got, but many marketers may not realize that sadly, the numbers and queries may not always match up to what's actually happening on Google's search engine. I'll illustrate ... Read this post D By: Daniel Peskin February 4, 2012 How to Build an Advanced Keyword Analysis Report in Excel Keyword Research Analyzing keyword performance, discovering new keyword opportunities, and determining which keywords to focus efforts on can be painstaking when you have thousands of keywords to review. With keyword metrics coming from all over the place (Analytics, Adwords, Webmaster Tools, etc.), it’s challenging to analyze all the data in one place regularly without having to do a decent amount of manual data manipulation. In addition, dependent on your site’s business model, tying revenue metrics to keyword data is a whole other battle. Read this post By: Karen Semyan February 1, 2012 Find New Keywords: Simplifying Keyword Research Keyword Research In December, we rolled out branded keyword rules and metrics to campaigns, to help you segment your branded traffic. Now, we’re excited to introduce a companion feature to make your keyword research easier: Find New Keywords. With this feature, you can view keywords sending you organic search traffic, filter on your brand rules, and determine if you want to track them in your campaign.... Read this post By: Adam Thompson December 15, 2011 6 Ways Google Insights for Search Can Help Fine-Tune Your Keyword Strategy Keyword Research Google is indisputably seated at the throne in the free internet app kingdom. With 45+ tools in its arsenal, most marketers only use and are familiar with a few of them. One slightly lesser-known tool your marketing campaign should not live without is Google Insights for Search. Here are six of the ways Google Insights can help fine-tune your keyword strategy: Read this post By: James Norquay October 18, 2011 Advanced SEO Keyword Research Tips and Ideas! Keyword Research This post is for anyone who is an SEO, Online Marketer, Domain Name Buyer or PPC in general and does keyword research using the Google Keyword Tool. Don't get me wrong -- keyword research is a very important aspect for SEO and if you do not do it correctly you can make a huge mistake by targeting your whole SEO campaign around specific keywords which are not all that correct. Some times the data can leave you a bit angry when you compare it with other real time sources or more accurate PPC data. Read this post M By: Michael King September 28, 2011 Using Social Media to Get Ahead of Search Demand Keyword Research Before I even start saying anything about keyword research I want to take my hat off to Richard Baxter because the tools and methodologies he shared at MozCon make me feel silly about even thinking about bringing something to the Keyword Research table. Now with that said, have a few ideas about using data sources outside of those that the Search Engines provide to get a sense of what needs people are looking to fulfill right now. Consider this the first in a series. Read this post By: Richard Shove September 6, 2011 Big Brand SEO - Campaigns, Integration and Extended Brand Keywords Keyword Research Throughout my six years as an SEO, there have been times when I've questioned the value of SEO for clients. The reasoning behind this was that popular non-brand phrases were unlikely to drive business or in some cases where markets were dominated by aggregator sites, where people require choice from the offering, rather than an individual brand. Data was often backed up by generic paid search generating negative return and eventually being switched off. Read this post By: James Agate August 24, 2011 6 Keyword Research Mistakes You Might be Making Keyword Research Keyword research is an all too often under-appreciated aspect of SEO. I've written a few keyword research posts here on Moz and that's because I believe it to be the blueprint of any successful SEO campaign... Read this post By: Steve Morgan August 16, 2011 Are Word Limits in the Google Keyword Tool Affecting the Long Tail in Your SEO Keyword Research? Keyword Research Chances are - if you visit SEOmoz on a regular basis - you already know the importance of keywords, choosing your keywords correctly and therefore that keyword research is one of the most important areas behind a successful SEO strategy. The Google AdWords Keyword Tool is probably the i... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Keyword Research"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Keyword Research"
    },
    {
      "level": "H2",
      "text": "How to Improve Your Rankings with Semantic Keyword Research"
    },
    {
      "level": "H2",
      "text": "How Much Does That Keyword Cost? [TOOL]"
    },
    {
      "level": "H2",
      "text": "50 of the Most Competitive SEO Keywords!"
    },
    {
      "level": "H2",
      "text": "Stop Paying for Stupid Clicks: Negative Keywords for Positive ROI"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "How to Forecast Seasonal Keyword Traffic with Google Insights and Python Scripts"
    },
    {
      "level": "H2",
      "text": "Be Careful Using AdWords for Keyword Research"
    },
    {
      "level": "H2",
      "text": "How to Build an Advanced Keyword Analysis Report in Excel"
    },
    {
      "level": "H2",
      "text": "Find New Keywords: Simplifying Keyword Research"
    },
    {
      "level": "H2",
      "text": "6  Ways Google Insights for Search Can Help Fine-Tune Your Keyword Strategy"
    },
    {
      "level": "H2",
      "text": "Advanced SEO Keyword Research Tips and Ideas!"
    },
    {
      "level": "H2",
      "text": "Using Social Media to Get Ahead of Search Demand"
    },
    {
      "level": "H2",
      "text": "Big Brand SEO - Campaigns, Integration and Extended Brand Keywords"
    },
    {
      "level": "H2",
      "text": "6 Keyword Research Mistakes You Might be Making"
    },
    {
      "level": "H2",
      "text": "Are Word Limits in the Google Keyword Tool Affecting the Long Tail in Your SEO Keyword Research?"
    }
  ],
  "author": "Neil Patel\n          \n            Ethan Lyon\n          \n            James Norquay\n          \n            Keri Morgret\n          \n            Zack Notes\n          \n            Rand Fishkin\n          \n            Daniel Peskin\n          \n            Karen Semyan\n          \n            Adam Thompson\n          \n            James Norquay\n          \n            Michael King\n          \n            Richard Shove\n          \n            James Agate\n          \n            Steve Morgan"
}