{
  "url": "https://moz.com/blog/category/keyword-research/p12",
  "slug": "p12",
  "title": "Keyword Research - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Richard Baxter August 15, 2011 How to Get Search Volume Data Straight into Excel [Mozcon Debrief] Keyword Research Just to say thanks to the Mozteam for flying me over to sunny Seattle, I brought them a new toy to give away. And, it rocks... Read this post B By: Brian Austad July 13, 2011 What Small Business Clients Need to Know About Keywords and SEO Keyword Research OK, so I've worked-on or managed well over 100 SEO campaigns over the last few years and a common trend I've noticed is that many small business clients don't really understand how choosing the right keywords affects and defines an SEO campaign and what it takes to deliver results. Read this post By: James Agate May 16, 2011 Using E-Commerce Keyword Research to Hook More Customers Keyword Research To some, keyword research is keyword research...the type of website doesn't matter! To me however, ecommerce websites require a different approach to keyword research because ecommerce is in my opinion an entirely different beast. The following is a step-by-step process for how I do SEO keyword research for my ecommerce clients... Read this post By: James Agate April 22, 2011 The Subtlety of Really Good Keyword Research Keyword Research Keyword research is an area of SEO that all too often gets overlooked. I like to write about it but I like even more to actually do it. It fuels not only my love of crunching data but also my enjoyment of making judgments. Keyword research seems like a straightforward task; you pull up a huge list of keywords, narrow it down to the relevant ... Read this post By: Dr. Peter J. Meyers March 9, 2011 What Keywords Do I Rank For? Keyword Research Ever wondered how to find ALL they keywords that you rank for? Turns out, it's a lot harder than you might think. Read this post By: Dr. Peter J. Meyers February 23, 2011 I'm Ranking, So Where's My Traffic?! Keyword Research In SEO, nothing is quite as frustrating as pouring time and money into your chosen keyword and finally breaking into the Top 10, only find that you still have no visitors. Read this post By: Richard Baxter February 8, 2011 Keyword Research - Using Categories to Make Your Process More Actionable Keyword Research Most SEO’s don’t like doing keyword research. It’s data intensive, requires some heavy lifting with Excel, and, let’s be honest, feels a bit like guess work. This post aims to help a lot with that! Read this post By: Brandon Na January 12, 2011 How Does Your Local SEO Market Compare With Other Large Cities? Keyword Research Recently, in my efforts to improve my business, I looked over the competition not only in my local Seattle SEO market, but also jumped over into other cities to gauge who's doing the \"right things\" out there in other cities. In order to figure out which markets to examine with what little time I feel I have (despite ha... Read this post N By: NomadicMatt36 December 15, 2010 Think the Opposite when Picking Travel Related Keywords Keyword Research Picking keywords is one of the most important parts of SEO. You want the best keywords with the highest value so you can make the most money. People spend hours looking through analytics tools for the juiciest keywords. This is especially true in travel. After pornography, travel is the second thing people spend money on on the Internet. Read this post By: Jonathan Walker November 16, 2010 A Quick Approach To Keyword Research Keyword Research Getting a starting point for your keywords is often very straight forward as they should relate to the area of business you are in, products you sell, or services you provide. For the purpose of the example, we’re conducting keyword research for a company that is selling....Halloween costumes! With that example, what keywords have you thought of? I imagine “Halloween Costumes” is one of them right? Perhaps “Halloween Costumes Shop” is another? Read this post By: Paul Lalley November 10, 2010 Time-Sensitive Keywords: Mobi, Jargon and Buzzwords Keyword Research Language has always evolved, so sayth etymologists, aka word nerds. But in the past, it evolved slowly as cultures integrated and media was limited to the newspaper and Life magazine, a household staple in the ‘50s and yes, I used to read it every week. Digital interconnectivity has sped up the evolution of language like a meth-crazed lexicographer. Read this post By: Nick LeRoy October 25, 2010 The 25 Absolute Most Difficult Keywords To Rank For - An SEO Nightmare Keyword Research Ask any SEO and they will tell you just how important it is to do keyword research. Not only do you need to find keywords that are related to your niche but you need to figure out which ones are actually obtainable for your site. Everyone talks about the “low hanging fruit” and maximizing the long tail keywords. What about the juggernaut keywords? Which keywords are arguab... Read this post By: Kieron Hughes October 11, 2010 Using YouTube as a Keyword Research Tool for SEO Keyword Research This isn't a post about keyword research for video content on YouTube, but exploring the ways in which it can be used to find relevant data, information and keywords in topics where you have a low understanding of the services and industry. Now for an example... ... Read this post O By: Ollivier Jacq August 4, 2010 How to Get the Most of Google Suggest? Keyword Research Hi there Mozzers! My name is Ollivier Jacq and I work for Paradizo.com This is my first post here at SEOmoz. Everybody knows Google Suggest, but if not here is a short explanation from Google: &ldquo... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Keyword Research"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Keyword Research"
    },
    {
      "level": "H2",
      "text": "How to Get Search Volume Data Straight into Excel [Mozcon Debrief]"
    },
    {
      "level": "H2",
      "text": "What Small Business Clients Need to Know About Keywords and SEO"
    },
    {
      "level": "H2",
      "text": "Using E-Commerce Keyword Research to Hook More Customers"
    },
    {
      "level": "H2",
      "text": "The Subtlety of Really Good Keyword Research"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "What Keywords Do I Rank For?"
    },
    {
      "level": "H2",
      "text": "I'm Ranking, So Where's My Traffic?!"
    },
    {
      "level": "H2",
      "text": "Keyword Research - Using Categories to Make Your Process More Actionable"
    },
    {
      "level": "H2",
      "text": "How Does Your Local SEO Market Compare With Other Large Cities?"
    },
    {
      "level": "H2",
      "text": "Think the Opposite when Picking Travel Related Keywords"
    },
    {
      "level": "H2",
      "text": "A Quick Approach To Keyword Research"
    },
    {
      "level": "H2",
      "text": "Time-Sensitive Keywords: Mobi, Jargon and Buzzwords"
    },
    {
      "level": "H2",
      "text": "The 25 Absolute Most Difficult Keywords To Rank For - An SEO Nightmare"
    },
    {
      "level": "H2",
      "text": "Using YouTube as a Keyword Research Tool for SEO"
    },
    {
      "level": "H2",
      "text": "How to Get the Most of Google Suggest?"
    }
  ],
  "author": "Richard Baxter\n          \n            Brian Austad\n          \n            James Agate\n          \n            James Agate\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers\n          \n            Richard Baxter\n          \n            Brandon Na\n          \n            NomadicMatt36\n          \n            Jonathan Walker\n          \n            Paul Lalley\n          \n            Nick LeRoy\n          \n            Kieron Hughes\n          \n            Ollivier Jacq"
}