{
  "url": "https://moz.com/blog/category/keyword-research/p13",
  "slug": "p13",
  "title": "Keyword Research - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "T By: Tom Critchlow July 5, 2010 Using Google's Webmaster Tools Search Queries Report To Identify Low Hanging Fruit Keyword Research Wouldn't it be great if you could somehow spot those SEO opportunities on your site which were low effort and high value? Well this post gives you a few ways you can do that! Sweet. I'm going to be digging around in the recently released search queries report in Google Webmaster Tools:... Read this post By: Orion Group June 28, 2010 Competitive Analysis Example: How I Researched a Niche Online and What I Learned Keyword Research In this blog post I will explain the process and tools I used to analyze a niche online and then I will share the results of my research. I hope you find this both interesting and helpful. The tools I used included: Google.com SEOmoz.org SEO for Firefox Toolbar (Some of the data points are a result of my subjective... Read this post S By: Sam Crocker June 20, 2010 Choosing the Right Keyphrases - Especially for the Smaller Sites! Keyword Research Hey there folks! Today's post is a hands-on walkthrough of some of the decision making used when choosing the keyphrases to target. Producing a list of the most important terms in an industry is nice, but actually choosing the right keyphrases is essential. The post was largely created in response to a question submitted by Kien in the comments of my last post. Read this post C By: chewiezx2 June 2, 2010 Googles External Keyword Tool: Old vs. New vs. WMC vs. GA Keyword Research This is the ultimate showdown. Well, not really, but let me suspend reality for a minute or 20 as I put these ‘official’ keyword research tools up to the test. The purpose of this post is to try to gain a better understanding of which keyword tools to use and what to expect from them. After all, we all want to be able to effectively pick the ‘right’ keywor... Read this post S By: Sam Crocker May 30, 2010 Keyword Research Tools - Build Your Own Adventure Keyword Research My mother used to scold me for misusing my toys, playing with my food and for having a bit too much energy. She was well within her rights, as I was a bit of a handful, but at the moment one particular phrase really sticks out in my mind “Is that what that was made for Sam? Use it the right way, please.” Whether I was riding down the stairs in a sleepin... Read this post By: Charlie Gray May 26, 2010 The Halo Effect on SEO Campaigns Keyword Research When working with prospective clients, we often talk with them about the many long-tail or related keywords that they may show up for, in addition to the primary keyword, as we optimize their website structure, increase their content, and improve their link profile. At OrangeSoda, we refer to this as the \"halo effect,\" but it is also referred to as the umbrella effect, keyword as... Read this post N By: Nick Gunn April 27, 2010 Keyword Tag Cloud Generator Keyword Research Having spent some time looking into keywords on customer and competitor sites, I decided there must be an easier way of collecting and viewing the data? Checking for keywords in page titles, headers, anchor text, image file names, etc can be quite time consuming. I started to think about how useful it would be to have a tool which would crawl a site and t... Read this post By: Rob Ousbey April 25, 2010 Client Based Keyword Research: How to Grow Plants Up a Wall Keyword Research There are a variety of tools and techniques recommended for SEO keyword research, from the free to the expensive, from the well known to those that are almost kept a secret. However, There's one source of keyword ideas which is often overlooked: the customers (and potential customers) served on a daily basis. Read this post N By: Nick Gunn March 18, 2010 Web Seer - Using Google Suggest for Keyword Research Keyword Research Google's \"Suggest\" feature is an interesting insight into popular searches - start typing a search phrase and Google will suggest popular phrases based on recent queries: (I find Number 4 in the list is particu... Read this post By: Rand Fishkin March 9, 2010 Targeting Multiple Keywords vs. Singular Keyword Focus Keyword Research Despite being a seemingly simple topic, this one seems to stymie even experienced SEOs. There's a natural conflict that creates the issue - the more keywords you target on a single page, the less you need to link build and optimize (for both search engines and user experience/conversion rate) on many pages. ... Read this post By: Rand Fishkin January 19, 2010 Keyword Targeting: How to Employ Multiple Keywords for SEO & Conversions Keyword Research At some point during your University's SEO 201: Advanced Keyword Research & Targeting class, they probably gave a few lectures and case studies on how to effectively split up your keyword research list across multiple pages and use those terms/phrases to maximum benefit. But, for those who might have missed that lesson (which would be, umm, all of us, since no... Read this post By: Rand Fishkin November 24, 2009 Illustrating the Long Tail Keyword Research The long tail of search demand has been around since the dawn of web search and, since that time, search marketers have been attempting to tap into the powerful stream that high quantities of unique content can provide. I recently came across some great data from Hitwise (about 1 year old, but still highly relevant) showing off just how substantive the long tail can be. Bill Tancer's post ... Read this post By: Brian Brown November 17, 2009 Get Annual Local Demand from Google AdWords Keyword Tool Keyword Research I realized it has been some time since posting on SEOmoz. I just released a new tool, the Google Keyword Tool Annualizer, over on the Netconcepts website and announced it on the ... Read this post N By: nunoandrade October 7, 2009 Determining Keyword Value: A Recipe for Prioritizing Page Optimizations Keyword Research E-commerce search engine optimization is quite possibly the most tedious and time-consuming type of SEO. An e-commerce web site can have hundreds of categories and thousands of product pages, all waiting to be optimized, haunting your every moment.The amount of work on an e-commerce site can be so daunting it can sometimes be difficult to even know where to start. If it's a bra... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Keyword Research"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Keyword Research"
    },
    {
      "level": "H2",
      "text": "Using Google's Webmaster Tools Search Queries Report To Identify Low Hanging Fruit"
    },
    {
      "level": "H2",
      "text": "Competitive Analysis Example: How I Researched a Niche Online and What I Learned"
    },
    {
      "level": "H2",
      "text": "Choosing the Right Keyphrases - Especially for the Smaller Sites!"
    },
    {
      "level": "H2",
      "text": "Googles External Keyword Tool: Old vs. New vs. WMC vs. GA"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Keyword Research Tools - Build Your Own Adventure"
    },
    {
      "level": "H2",
      "text": "The Halo Effect on SEO Campaigns"
    },
    {
      "level": "H2",
      "text": "Keyword Tag Cloud Generator"
    },
    {
      "level": "H2",
      "text": "Client Based Keyword Research: How to Grow Plants Up a Wall"
    },
    {
      "level": "H2",
      "text": "Web Seer - Using Google Suggest for Keyword Research"
    },
    {
      "level": "H2",
      "text": "Targeting Multiple Keywords vs. Singular Keyword Focus"
    },
    {
      "level": "H2",
      "text": "Keyword Targeting: How to Employ Multiple Keywords for SEO & Conversions"
    },
    {
      "level": "H2",
      "text": "Illustrating the Long Tail"
    },
    {
      "level": "H2",
      "text": "Get Annual Local Demand from Google AdWords Keyword Tool"
    },
    {
      "level": "H2",
      "text": "Determining Keyword Value: A Recipe for Prioritizing Page Optimizations"
    }
  ],
  "author": "Tom Critchlow\n          \n            Orion Group\n          \n            Sam Crocker\n          \n            chewiezx2\n          \n            Sam Crocker\n          \n            Charlie Gray\n          \n            Nick Gunn\n          \n            Rob Ousbey\n          \n            Nick Gunn\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Brian Brown\n          \n            nunoandrade"
}