{
  "url": "https://moz.com/blog/category/keyword-research/p17",
  "slug": "p17",
  "title": "Keyword Research - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Rand Fishkin May 8, 2006 What Women Want on the Web Keyword Research One of the best forum threads I've read in a long time is in progress at Cre8asite. Started by Kim Krause Berg herself, innocently enough with a post about women equalling men online in pure numbers (though it would appear from the latest eMarketer numbers that ... Read this post By: Rand Fishkin April 17, 2006 Country-Specific Targeting Keyword Research When it comes to the search engines and country-specific content or searches, there are several obvious variables the engines use to determine the geography of a particular site or company: TLD (.com or .co.uk or .ca for example) Hosting (Is the site hosted in the UK, the US, Canada?) Inbound links (Are they primarily from US sites, UK ... Read this post By: Rand Fishkin April 3, 2006 The Accidental Wisdom of Long Tail Targeting Keyword Research In the long tail of keyword searches, the great value comes from having hundreds or thousands of unique, valuable content pages written on a niche subject. The millions of completely unique search terms that hit the engines each day help to bring in traffic that a purely \"designed\" strategy could never receive. What's fascinating about the long tail targeting process is that i... Read this post By: Rand Fishkin February 23, 2006 Beauty in URLs Keyword Research Mike Schinkel has an older, but golden post on the beauty of URLs. There's nothing revolutionary here, but since I've been seeing so many ugly URLs in the SERPs lately (have hyphens and subdomains made a comeback with BigDaddy or is it just me?), I have to step in. A few of his rules include: Well De... Read this post By: Rand Fishkin February 20, 2006 Help Developing Dictionary Project Keyword Research At Michael's insistence, I'm going to try to put together a large list of terms and definitions relevant to SEO, web development and the Internet in general. The formats will look like (as ... Read this post By: Rand Fishkin January 25, 2006 Quick Take on .co.uk vs. .com Keyword Research Lots of questions popping up lately about how to rank well on Google.co.uk vs. Google.com. Danny shared this nugget of gold at SEW today: google uk is going to favor uk based sites by default, even if you don't use the pages from the uk option. you want to do well ... Read this post By: Rand Fishkin January 8, 2006 Speculation on How Search Engines Apply Temporal Data Keyword Research In my opinion, temporal based data is one of the most valuable kinds of information that feeds into a modern search engine's algorithm. With it, search engines know when terms are getting more popular, when new terms are being used by searchers a... Read this post E By: EGOL December 14, 2005 CPKs and Blog Serendipity Keyword Research I am always running the logs on my websites seeing where the traffic is coming from. One of my websites has a blog and I post to that blog almost every day. My initial set-up for that blog had seven posts on the homepage and the archiving was done weekly. After I had been ... Read this post By: Rand Fishkin November 9, 2005 Search Spies Keyword Research If you like watching what the world is searching for, search spies (programs that output the searches that are being performed on the site in real time) are a fun resource. Over at SEOChat, Mick's asked the question and Jammer & Skipsel have provided very nice lists. There's quite a few: ... Read this post By: Rand Fishkin November 7, 2005 Rank Check Tool Keyword Research Rod Coleman emailed me last night about his new rank checking and monitoring tool. It's free to sign up for 10 terms or $5/month for up to 75 terms. It checks the following engines: Alltheweb Altavista AOL... Read this post By: Rand Fishkin July 12, 2005 Gauging Keyword Performance Keyword Research Today has me thinking on the subject of measuring keyword performance. I'm about to begin a relatively large scale campaign on both the organic and PPC side for a client and have wrestled with the neccessary facts and figures to track in order to have reasonable metrics. Here's a sh... Read this post By: Rand Fishkin March 22, 2005 Keyword Spreadsheet Keyword Research In reference to a thread at SEOChat on the anatomy of a good keyword by Robert Paulson, I have deleted the specific terms out of one of my own keyword spreadsheets and am offering it for download. You're welcome to re-use this a... Read this post By: Rand Fishkin February 22, 2005 Keyword Phrases that Bring Conversions Keyword Research A report from emarketer today - Search Query Keyword Insight - details the results of some research over the pas... Read this post By: Rand Fishkin February 22, 2005 The Keyword Research Guru Keyword Research Rarely do I give a colleague praise so publicly, yet Dan Thies deserves it. His efforts are unmatched in the area of keyword research and targeting, an often under-appreciated specialty in the SEO business. Recently, Dan has started a ... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Keyword Research"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Keyword Research"
    },
    {
      "level": "H2",
      "text": "What Women Want on the Web"
    },
    {
      "level": "H2",
      "text": "Country-Specific Targeting"
    },
    {
      "level": "H2",
      "text": "The Accidental Wisdom of Long Tail Targeting"
    },
    {
      "level": "H2",
      "text": "Beauty in URLs"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Help Developing Dictionary Project"
    },
    {
      "level": "H2",
      "text": "Quick Take on .co.uk vs. .com"
    },
    {
      "level": "H2",
      "text": "Speculation on How Search Engines Apply Temporal Data"
    },
    {
      "level": "H2",
      "text": "CPKs and Blog Serendipity"
    },
    {
      "level": "H2",
      "text": "Search Spies"
    },
    {
      "level": "H2",
      "text": "Rank Check Tool"
    },
    {
      "level": "H2",
      "text": "Gauging Keyword Performance"
    },
    {
      "level": "H2",
      "text": "Keyword Spreadsheet"
    },
    {
      "level": "H2",
      "text": "Keyword Phrases that Bring Conversions"
    },
    {
      "level": "H2",
      "text": "The Keyword Research Guru"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            EGOL\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin"
}