{
  "url": "https://moz.com/blog/category/keyword-research/p6",
  "slug": "p6",
  "title": "Keyword Research - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Brian Childs June 15, 2017 How to Target Multiple Keywords with One Page - Next Level Keyword Research | SEO Tools | SEO Basics In this edition of our educational Next Level series, you'll learn an easy workflow for researching and targeting multiple keywords on one page. Read on and level up! Read this post By: Kirk Williams May 30, 2017 No, Paid Search Audiences Won’t Replace Keywords Paid Search Marketing (PPC) | Keyword Research Keywords or audience targeting? Kirk Williams sets out to argue that far from being dead, keywords are still the most useful tool in the paid search marketer's toolbox. Read this post By: Russ Jones May 8, 2017 Not Your Dad's Keyword Tool: Advanced Keyword Research Use Cases Keyword Research | Advanced SEO | SEO Tools This isn't your dad's keyword tool. Learn about novel ways to take advantage of powerful keyword tools like Moz Keyword Explorer to do far more than find related keywords. Read this post By: Dmitry Dragilev April 19, 2017 [Case Study] How We Ranked #1 for a High-Volume Keyword in Under 3 Months Keyword Research | Content Marketing | Advanced SEO If you've been struggling to take the number-one spot in the SERPs for a competitive keyword, take a cue from this case study. Dmitry Dragilev shares his team's 8-step methodology for ranking first in a popular niche. Read this post By: Felicia Crawford March 23, 2017 Your Daily SEO Fix: Keywords, Concepts, Page Optimization, and Happy NAPs Keyword Research | On-page SEO | Local SEO In our final week of the Daily SEO Fix video series, we cover some quick wins for on-page optimization, keyword research, and accurate NAP listings for your local endeavors using tools from the Moz suite. Read this post By: Purna Virji March 21, 2017 The Step-By-Step Guide to Testing Voice Search Via PPC Paid Search Marketing (PPC) | Keyword Research | Mobile SEO Conversational interfaces are becoming more and more popular, but it's hard to know where to start when it comes to voice search. A $50 PPC budget is enough to jumpstart your voice search keyword list and strategy — learn how in this step-by-step guide. Read this post By: Felicia Crawford March 9, 2017 Your Daily SEO Fix: The Keyword Research Edition Keyword Research | Moz Tools | SEO Basics You have SEO quandaries, we have tools to solve them. Check out four quick videos (starring real, live Mozzers!) designed to help you level up your skills and get the most out of both our free and paid tools. Read this post By: Rand Fishkin February 24, 2017 3 Tactics for Hyperlocal Keywords Whiteboard Friday | Local SEO | Keyword Research Reaching the perfect audience is priceless, but hyperlocal keyword research is frustrating. In this Whiteboard Friday, Rand shares how to find powerful, laser-focused keywords to bring you *exactly* the customers you're looking for. Read this post By: Sarah Lively February 13, 2017 How to Uncover Hidden Keyword-Level Data Using Google Sheets Keyword Research | SEO Analytics | Advanced SEO Which keywords are driving your organic traffic? Keyword-level data doesn't have to be (not provided). Sarah Lively shares a smart solution using two free add-ons for Google Sheets. Read this post By: Rand Fishkin February 10, 2017 The Keyword + Year Content/Rankings Hack Keyword Research | Whiteboard Friday Earning site traffic from competitive keywords with decent search volume doesn't always have to be a struggle. In this Whiteboard Friday, Rand shares how to make ranking for competitive keywords easier on yourself using very fresh content. Read this post By: Brian Childs January 19, 2017 How to Identify Your E-Commerce Product Page Keywords Using MozBar E-Commerce SEO | Keyword Research Which keywords are right for your e-commerce product pages? Brian Childs walks you through how to simplify your research process on-the-go with the SEO toolbar. Read this post By: Jo Cameron December 27, 2016 Hunting Down SERP Features to Understand Intent & Drive Traffic - Next Level SEO Basics | Content Marketing | Keyword Research SERP features are your insight into what content Google thinks best serves the needs of searchers for any given keyword. Learn how to target and win them with this follow-along educational workflow. Read this post By: Dr. Peter J. Meyers December 6, 2016 Tactical Keyword Research in a RankBrain World Keyword Research | Advanced SEO RankBrain represents a more advanced way of measuring relevance, built on teaching machines to discover the relationships between words. How should RankBrain change our approach to SEO and specifically to keyword research? Read this post By: Alexis Sanders November 14, 2016 What Is Semantic Search and What Should You Do About It? Keyword Research | SEO Basics Semantic search is the present and future, and it's important to have a good handle on what it is and how you can use it to your advantage. This post presents 5 strategies for getting started with semantic SEO. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Keyword Research"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Keyword Research"
    },
    {
      "level": "H2",
      "text": "How to Target Multiple Keywords with One Page - Next Level"
    },
    {
      "level": "H2",
      "text": "No, Paid Search Audiences Won’t Replace Keywords"
    },
    {
      "level": "H2",
      "text": "Not Your Dad's Keyword Tool: Advanced Keyword Research Use Cases"
    },
    {
      "level": "H2",
      "text": "[Case Study] How We Ranked #1 for a High-Volume Keyword in Under 3 Months"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Your Daily SEO Fix: Keywords, Concepts, Page Optimization, and Happy NAPs"
    },
    {
      "level": "H2",
      "text": "The Step-By-Step Guide to Testing Voice Search Via PPC"
    },
    {
      "level": "H2",
      "text": "Your Daily SEO Fix: The Keyword Research Edition"
    },
    {
      "level": "H2",
      "text": "3 Tactics for Hyperlocal Keywords"
    },
    {
      "level": "H2",
      "text": "How to Uncover Hidden Keyword-Level Data Using Google Sheets"
    },
    {
      "level": "H2",
      "text": "The Keyword + Year Content/Rankings Hack"
    },
    {
      "level": "H2",
      "text": "How to Identify Your E-Commerce Product Page Keywords Using MozBar"
    },
    {
      "level": "H2",
      "text": "Hunting Down SERP Features to Understand Intent & Drive Traffic - Next Level"
    },
    {
      "level": "H2",
      "text": "Tactical Keyword Research in a RankBrain World"
    },
    {
      "level": "H2",
      "text": "What Is Semantic Search and What Should You Do About It?"
    }
  ],
  "author": "Brian Childs\n          \n            Kirk Williams\n          \n            Russ Jones\n          \n            Dmitry Dragilev\n          \n            Felicia Crawford\n          \n            Purna Virji\n          \n            Felicia Crawford\n          \n            Rand Fishkin\n          \n            Sarah Lively\n          \n            Rand Fishkin\n          \n            Brian Childs\n          \n            Jo Cameron\n          \n            Dr. Peter J. Meyers\n          \n            Alexis Sanders"
}