{
  "url": "https://moz.com/blog/category/keyword-research/p9",
  "slug": "p9",
  "title": "Keyword Research - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Michael Patterson September 18, 2015 The Strategy That Helped Sprout Social Double Its Blog Traffic Keyword Research | SEO Analytics | Blogging By being attentive to the user-insight gleaned from their website, Sprout Social turned a few simple tweaks into a bonafide blog-optimization strategy. Read this post By: Rand Fishkin August 27, 2015 Moz's Acquisition of SERPscape, Russ Jones Joining Our Team, and a Sneak Peek at a New Tool Keyword Research | Moz Tools | Moz News Today, it's my pleasure to announce some exciting news. First, if you haven't already seen it via his blog post, I'm thrilled to welcome Russ Jones, a longtime community member and great contributor to the SEO world, to Moz. Read this post By: Rand Fishkin July 24, 2015 Pinpoint vs. Floodlight Content and Keyword Research Strategies Content Marketing | Whiteboard Friday | Keyword Research Keyword research and content creation have a major aspect in common: We can choose a wide range of topics (or keywords), from very broad to very narrow. In today's Whiteboard Friday, Rand shows us how that parallel affects the decisions we make as marketers. Read this post By: Jamie Press July 14, 2015 Case Study: How I Turned Autocomplete Ideas into Traffic & Ranking Results with Only 5 Hours of Effort Keyword Research | Link Building | Blogging Don't sleep on Google Autocomplete for helping you uncover some low-hanging fruit content ideas. Read this post By: Rand Fishkin June 19, 2015 How to Estimate the Total Volume and Value of Keywords in a Given Market or Niche Keyword Research | Whiteboard Friday With the right combination of data, we can get a great sense for the relative value of keywords within certain markets/niches. In today's Whiteboard Friday, Rand shows you how. Read this post By: Rand Fishkin June 12, 2015 Why We Can't Do Keyword Research Like It's 2010 Whiteboard Friday | Keyword Research From selection to the actual research, keywords simply aren't the same beast they were five years ago. In today's Whiteboard Friday, Rand shows you how to do keyword research in 2015, ensuring you don't harm your site with obsolete tactics. Read this post By: Matt Gratt May 18, 2015 Keyword Research for the Modern Customer Journey Keyword Research As searcher behavior gets more complicated, we as marketers have to evolve our approach to keyword research. Here's how to match your keyword research process to your customer's purchase journey. Read this post By: Eric Enge May 13, 2015 Inverse Document Frequency and the Importance of Uniqueness On-page SEO | Advanced SEO | Keyword Research Can learning about Inverse Document Frequency teach us to create better content? It can, and this article explains how. Read this post By: Jeremy_Gottlieb January 28, 2015 How to do Keyword Research in 90 Minutes Keyword Research | SEO Basics Using a hypothetical client, Jeremy Gottlieb shows you just how much keyword research you can get done in 90 minutes (and walks you step-by-step through how to do it). Read this post By: Rand Fishkin January 16, 2015 Hacking Keyword Targeting by Serving Interest-Based Searches Keyword Research | Whiteboard Friday | Advanced SEO Keywords that lead directly to conversions are sometimes in short supply, but tapping into your audience's other interests can bring unexpected returns. In today's Whiteboard Friday, Rand shows you how. Read this post By: Neil Patel September 10, 2014 Back to Fundamentals: 6 Untapped Keyword Sources that Will Boost Organic Traffic Keyword Research | SEO Basics Tapping out of keyword sources and running out of ideas? Use these not-so-obvious ways to get more keywords that'll improve your organic traffic. Read this post By: Rand Fishkin September 5, 2014 Keyword Research and Targeting Without Exact Match Keyword Research | Whiteboard Friday Google recently removed the ability to target exact match keywords in AdWords. In today's Whiteboard Friday, Rand tells us what that means to marketers performing keyword research, offering tips for the most effective approaches going forward. Read this post By: Eli Schwartz June 11, 2014 How to Win Big in International SEO: Assume Nothing (and Definitely Don't Stereotype) Content Marketing | Keyword Research | International SEO The most important thing for anyone looking to do international SEO to know is: don’t make assumptions. Read this post By: Jay Leary June 10, 2014 Help with (Not Provided): New Landing Pages Report in Moz Analytics Keyword Research | Moz Tools (not provided) created a big headache for SEOs. To help fill some of the reporting gaps, Moz Analytics is introducing a new Landing Pages report. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Keyword Research"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Keyword Research"
    },
    {
      "level": "H2",
      "text": "The Strategy That Helped Sprout Social Double Its Blog Traffic"
    },
    {
      "level": "H2",
      "text": "Moz's Acquisition of SERPscape, Russ Jones Joining Our Team, and a Sneak Peek at a New Tool"
    },
    {
      "level": "H2",
      "text": "Pinpoint vs. Floodlight Content and Keyword Research Strategies"
    },
    {
      "level": "H2",
      "text": "Case Study: How I Turned Autocomplete Ideas into Traffic & Ranking Results with Only 5 Hours of Effort"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "How to Estimate the Total Volume and Value of Keywords in a Given Market or Niche"
    },
    {
      "level": "H2",
      "text": "Why We Can't Do Keyword Research Like It's 2010"
    },
    {
      "level": "H2",
      "text": "Keyword Research for the Modern Customer Journey"
    },
    {
      "level": "H2",
      "text": "Inverse Document Frequency and the Importance of Uniqueness"
    },
    {
      "level": "H2",
      "text": "How to do Keyword Research in 90 Minutes"
    },
    {
      "level": "H2",
      "text": "Hacking Keyword Targeting by Serving Interest-Based Searches"
    },
    {
      "level": "H2",
      "text": "Back to Fundamentals: 6 Untapped Keyword Sources that Will Boost Organic Traffic"
    },
    {
      "level": "H2",
      "text": "Keyword Research and Targeting Without Exact Match"
    },
    {
      "level": "H2",
      "text": "How to Win Big in International SEO: Assume Nothing (and Definitely Don't Stereotype)"
    },
    {
      "level": "H2",
      "text": "Help with (Not Provided): New Landing Pages Report in Moz Analytics"
    }
  ],
  "author": "Michael Patterson\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Jamie Press\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Matt Gratt\n          \n            Eric Enge\n          \n            Jeremy_Gottlieb\n          \n            Rand Fishkin\n          \n            Neil Patel\n          \n            Rand Fishkin\n          \n            Eli Schwartz\n          \n            Jay Leary"
}