{
  "url": "https://ahrefs.com/blog/category/product-blog/",
  "slug": "product-blog",
  "title": "Product Blog - SEO Blog by Ahrefs",
  "description": "Learn all about the important new features and changes in Ahrefs.",
  "content": "SEO General SEOKeyword ResearchOn-Page SEOLink BuildingTechnical SEOLocal SEOEnterprise SEO Marketing General MarketingContent MarketingAffiliate MarketingPaid MarketingVideo Marketing Data & Studies Product Guides SEOKeyword ResearchOn-Page SEOLink BuildingTechnical SEOLocal SEO Search Search Subscribe Menu Search SEO General SEO Keyword Research On-Page SEO Link Building Technical SEO Local SEO Enterprise SEO Marketing General Marketing Content Marketing Affiliate Marketing Paid Marketing Video Marketing Data & Studies Product Guides SEO Keyword Research On-Page SEO Link Building Technical SEO Local SEO Subscribe Product BlogLearn all about the important new features and changes in Ahrefs.Most Recent ArticlesAhrefs Insights, Product Blog Ahrefs Certification: What To Expect and How It Works Andrei Țiț October 22, 2024Product Blog Report builder, AI Content Helper, and more (Sept 2024) Rebekah Bek October 4, 2024Product Blog Get Ahrefs at group buy pricing – with zero risk Rebekah Bek September 30, 2024Product Blog AI Content Helper: Content Optimization That Doesn’t Turn Your Brain Off Andrei Țiț September 19, 2024Product Blog Introducing: Reports (beta) Andrei Țiț September 16, 2024Product Blog Compare page text changes side-by-side in Site Audit and more (Aug 2024) Rebekah Bek September 5, 2024Product Blog The Game-Changer in Free Website Crawlers You Need to Know About Nick Churick September 4, 2024Product Blog Ahrefs’ $29 Starter plan – what’s included and how it compares Rebekah Bek September 2, 2024Product Blog Content changes on performance charts, and more (Jul 2024) Rebekah Bek August 8, 2024Product Blog Introducing: Content changes Andrei Țiț August 6, 2024Product Blog Coming soon: Patch issues in Site Audit Rebekah Bek July 31, 2024Product Blog All of Ahrefs AI features, explained Andrei Țiț July 29, 2024Product Blog Ahrefs Integrations – connect your favourite tools Rebekah Bek July 16, 2024Product Blog Ahrefs Alternatives: 8 Reasons The Companies in this SERP Don’t Compare Rebekah Bek July 9, 2024Product Blog AI translations, IndexNow in Site Audit, and more (Jun 2024) Rebekah Bek July 3, 2024Product Blog Hack The Box grows 211% YoY in top 10 keyword rankings across their diverse offerings Constance Tan July 3, 2024Product Blog Ahrefs Changelog: Running List of New Features Rebekah Bek June 25, 2024Product Blog SenS Online Solutions gains a competitive edge over other agencies with Ahrefs Constance Tan June 7, 2024Product Blog What’s new at Ahrefs? (May 2024) Rebekah Bek June 6, 2024Product Blog What’s new at Ahrefs? (April 2024) Rebekah Bek May 2, 2024 123456 Search English DeutschEspañolFrançaisItalianoPortuguês中文 EnglishDeutschEspañolFrançaisItalianoPortuguês中文 © 2024 Ahrefs Pte Ltd.Pick a topic SEO General SEO Keyword Research On-Page SEO Link Building Technical SEO Local SEO Enterprise SEO Marketing General Marketing Content Marketing Affiliate Marketing Paid Marketing Video Marketing Data & Studies Product Ahrefs Tools Core Tools Site Explorer Keywords Explorer Content Explorer Site Audit Rank Tracker Free Tools Backlink Checker Website Authority Checker Keyword Rank Checker Broken Link Checker SERP Checker Close Join the Ahrefs' DigestGet the week's best marketing content in your inbox. Email Subscription Subscribe Leave this field empty if you're human: Thanks!Please check your email inbox and spam folder. We've sent you a link to verify your email. Got It",
  "headers": [
    {
      "level": "H1",
      "text": "Product Blog"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles"
    },
    {
      "level": "H3",
      "text": "Ahrefs Certification: What To Expect and How It Works"
    },
    {
      "level": "H3",
      "text": "Report builder, AI Content Helper, and more (Sept 2024)"
    },
    {
      "level": "H3",
      "text": "Get Ahrefs at group buy pricing – with zero risk"
    },
    {
      "level": "H3",
      "text": "AI Content Helper: Content Optimization That Doesn’t Turn Your Brain Off"
    },
    {
      "level": "H3",
      "text": "Introducing: Reports (beta)"
    },
    {
      "level": "H3",
      "text": "Compare page text changes side-by-side in Site Audit and more (Aug 2024)"
    },
    {
      "level": "H3",
      "text": "The Game-Changer in Free Website Crawlers You Need to Know About"
    },
    {
      "level": "H3",
      "text": "Ahrefs’ $29 Starter plan – what’s included and how it compares"
    },
    {
      "level": "H3",
      "text": "Content changes on performance charts, and more (Jul 2024)"
    },
    {
      "level": "H3",
      "text": "Introducing: Content changes"
    },
    {
      "level": "H3",
      "text": "Coming soon: Patch issues in Site Audit"
    },
    {
      "level": "H3",
      "text": "All of Ahrefs AI features, explained"
    },
    {
      "level": "H3",
      "text": "Ahrefs Integrations – connect your favourite tools"
    },
    {
      "level": "H3",
      "text": "Ahrefs Alternatives: 8 Reasons The Companies in this SERP Don’t Compare"
    },
    {
      "level": "H3",
      "text": "AI translations, IndexNow in Site Audit, and more (Jun 2024)"
    },
    {
      "level": "H3",
      "text": "Hack The Box grows 211% YoY in top 10 keyword rankings across their diverse offerings"
    },
    {
      "level": "H3",
      "text": "Ahrefs Changelog: Running List of New Features"
    },
    {
      "level": "H3",
      "text": "SenS Online Solutions gains a competitive edge over other agencies with Ahrefs"
    },
    {
      "level": "H3",
      "text": "What’s new at Ahrefs? (May 2024)"
    },
    {
      "level": "H3",
      "text": "What’s new at Ahrefs? (April 2024)"
    }
  ],
  "author": "Andrei Țiț  Rebekah Bek  Rebekah Bek  Andrei Țiț  Andrei Țiț  Rebekah Bek  Nick Churick  Rebekah Bek  Rebekah Bek  Andrei Țiț  Rebekah Bek  Andrei Țiț  Rebekah Bek  Rebekah Bek  Rebekah Bek  Constance Tan  Rebekah Bek  Constance Tan  Rebekah Bek  Rebekah Bek"
}