{
  "url": "https://www.similarweb.com/blog/insights/media-entertainment-news/cnn-may/",
  "slug": "cnn-may",
  "title": "CNN Digital Performance & Ratings Drop After Trump Town Hall | Similarweb",
  "description": "CNN's Trump Town Hall didn't do any more to for traffic online than it did to boost ratings - both continued a downward trend in May. Click to get the data",
  "content": "HomeBlogInsightsMedia & Entertainment NewsCNN Digital Traffic Drops in Sync with Ratings After Trump Town Hall Insights CNN Digital Traffic Drops in Sync with Ratings After Trump Town Hall Start your free trial by David F. Carr 4 Min. June 15, 2023 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic May’s 25% drop in prime-time ratings was matched by a 6.6% drop in web traffic Before Chris Licht was fired as CEO of CNN earlier this month, he made a big bet on a Town Hall event featuring Donald J. Trump as a way of burnishing the network’s reputation for unbiased journalism – and also a sure-fire way of boosting CNN’s audience. It hasn’t worked out that way for either CNN’s ratings, digital traffic, or reputation. The reputational damage was magnified by the PR disaster of a fly-on-the-wall profile in The Atlantic Monthly titled “Inside the Meltdown at CNN,” which captured Licht’s planning of and hopes for the Town Hall as well as his realization that it had not gone well. While the reputational damage was significant, probably a bigger factor in his dismissal was that his tactics failed to bring in a larger audience for CNN. Although the Trump Town Hall did bring in 3.3 million cable viewers, the critical “prime time demo” ratings for May wound up being down 25%, year-over-year. Also in May, US web traffic was down 6.6% year-over-year. Traffic was also depressed in February, March, and April – by more than 20% in February and March. A year ago, CNN scrapped plans for a CNN+ streaming service, but digital news remains an important element of the company’s success. Key takeaways In May, CNN web traffic was down 6.6%, despite all the positive and negative attention generated by the Trump Town Hall. Worldwide, traffic to cnn.com was down 8.2%. Fox News is also seeing web traffic drop, along with ratings, following the departure of star anchor Tucker Carlson. US web traffic for foxnews.com was down 5% year-over-year in May. Meanwhile, US web traffic for msnbc.com was up 37.5% year-over-year in May. MSNBC is enjoying a surge in interest propelled by the multiple indictments of Donald Trump. Although its website gets far less traffic than either cnn.com or foxnews.com, MSNBC recently topped CNN and Fox with its prime-time coverage of the unsealing of the latest Trump indictment and Monday’s arraignment in Miami. CNN remains one of the top destinations for online news in the US, attracting 430.6 million visits in May, only slightly less than the New York Times, which got 432 million visits. The New York Times has also seen web traffic dip on a year-over-year basis for the past several months – although that seems to be mostly the effect of comparison with peak traffic months in early 2022 when the Wordle online game it had purchased was all the rage. Over the past two years, the Times has clearly grown its online traffic – by 40% in the US and by 49% worldwide. Traffic to cnn.com dropped by nearly 2% over the same period. CNN draws a lot of traffic but is not growing it CNN’s web presence is significantly bigger than foxnews.com and much bigger than msnbc.com. However, MSNBC has been growing traffic more consistently than either CNN or Fox News in recent months. CNN has been in the news for the wrong reasons Those who cover the news don’t necessarily like to be “the story” – particularly when it’s a bad story. But the news analysis and commentary on plans for a Trump Town Hall tended to be highly critical, and The Atlantic Monthly’s story created the impression that Licht was adrift in his job and in deep trouble with his superiors. He only lasted a few weeks after it was published. The article was one of the most-read stories on theatlantic.com in the early days of June, accounting for about 38% of the traffic to the website on June 7, the day Licht’s ouster was announced. Not the only site to see traffic slump Whether or not the controversy over the Trump Town Hall event had a cause-and-effect on CNN’s traffic slump is not necessarily clear, and the controversies over Chris Licht’s leadership could be mostly insider baseball of more interest to journalists than their readers and viewers. News ratings and web traffic rise and fall with the pace of news and the public’s interest in it, as well as the quality of the execution from a publication or news network. In context, May’s drop in traffic for CNN was consistent with what we saw from other news operations in May. Among the news outlets we’ve been following regularly, only People Magazine and the Wall Street Journal saw traffic rise year-over-year. However, even if we look at the data over a longer time horizon – the last year of data, versus the 12 months before that – CNN is down 5.1%, while key rivals are seeing traffic growth, including the New York Times (+16.9%) and MSNBC (+17.5%). The Similarweb Insights & Communications team is available to pull additional or updated data on request for the news media (journalists are invited to write to press@similarweb.com). When citing our data, please reference Similarweb as the source and link back to the most relevant blog post or similarweb.com/blog/insights/. Contact: For more information, please write to press@similarweb.com. Report By: David F. Carr, Senior Insights Manager Methodology Disclaimer: All names, brands, trademarks, and registered trademarks are the property of their respective owners. The data, reports, and other materials provided or made available by Similarweb consist of or include estimated metrics and digital insights generated by Similarweb using its proprietary algorithms, based on information collected by Similarweb from multiple sources using its advanced data methodologies. Similarweb shall not be responsible for the accuracy of such data, reports, and materials and shall have no liability for any decision by any third party based in whole or in part on such data, reports, and materials. by David F. Carr David covers social media, digital advertising, and generative AI. With a background in web trends since the 1990s, he’s also the author of \"Social Collaboration for Dummies\". Related Topics: Media & Entertainment News This post is subject to Similarweb legal notices and disclaimers. Related Posts Insights The Democratic National Convention in Search and News Traffic Media & Entertainment News by David F. Carr 5 Min. Aug 26, 2024 Insights Where the Olympics News Drove the Most News Traffic Media & Entertainment News by David F. Carr 4 Min. Aug 14, 2024 Insights Similarweb Traffic League: Who Was the Most Popular Football Club in April 2024? Media & Entertainment News by Itay Gross 4 Min. May 28, 2024 Insights NCAA’s Women’s Basketball Stars Eclipsing Men’s Ahead of March Madness Media & Entertainment News by Molly Winik 3 Min. Mar 18, 2024 Insights A Super Bowl with a Difference: Swifties Flock to This Year’s Event Betting News Media & Entertainment News by Daniel Reid 5 Min. Feb 6, 2024 Insights Parentz Talk Tops Digital 100 Ranking of Fastest Growing News & Media Sites Media & Entertainment News by Inès Durand 4 Min. Jan 10, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "CNN Digital Traffic Drops in Sync with Ratings After Trump Town Hall"
    },
    {
      "level": "H2",
      "text": "May’s 25% drop in prime-time ratings was matched by a 6.6% drop in web traffic"
    },
    {
      "level": "H2",
      "text": "Key takeaways"
    },
    {
      "level": "H2",
      "text": "CNN draws a lot of traffic but is not growing it"
    },
    {
      "level": "H2",
      "text": "CNN has been in the news for the wrong reasons"
    },
    {
      "level": "H2",
      "text": "Not the only site to see traffic slump"
    },
    {
      "level": "H3",
      "text": "The Democratic National Convention in Search and News Traffic"
    },
    {
      "level": "H3",
      "text": "Where the Olympics News Drove the Most News Traffic"
    },
    {
      "level": "H3",
      "text": "Similarweb Traffic League: Who Was the Most Popular Football Club in April 2024?"
    },
    {
      "level": "H3",
      "text": "NCAA’s Women’s Basketball Stars Eclipsing Men’s Ahead of March Madness"
    },
    {
      "level": "H3",
      "text": "A Super Bowl with a Difference: Swifties Flock to This Year’s Event"
    },
    {
      "level": "H3",
      "text": "Parentz Talk Tops Digital 100 Ranking of Fastest Growing News & Media Sites"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by David F. Carr"
}