{
  "url": "https://www.similarweb.com/blog/insights/media-entertainment-news/fortnite-fastest/",
  "slug": "fortnite-fastest",
  "title": "Fortnite Black Friday Traffic Surge Continued Into December | Similarweb",
  "description": "Fortnite traffic surged 213% from October to November and was up over 734% year-over-year (+1,200% in the US). Want to learn more about the popular game?",
  "content": "HomeBlogInsightsMedia & Entertainment NewsFortnite Black Friday Traffic Surge Continued Into December Insights Fortnite Black Friday Traffic Surge Continued Into December Start your free trial by David F. Carr 3 Min. December 13, 2023 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Fortnite traffic surged 213% from October to November and was up over 734% year-over-year (+1,200% in the US) Fortnite has been a popular gaming and virtual world property for years, but recent efforts by the developers and marketers to revitalize Fortnite are proving extremely successful this holiday season. The big traffic bump the Fortnite website saw around Black Friday – when discounts for the in-game currency revved up interest – continued unabated into the first week of December. Key takeaways From October to November, worldwide traffic to fortnite.com jumped 212.8%, and the year-over year increase was 734%, according to Similarweb estimates. In the US, the month over month increase was 275% and the year-over-year increase was over 1,200%. In November, fortnite.com attracted 82 million visits. With 42.8 million worldwide unique visitors in November, Fortnite was the fastest-growing website across all categories, up 254% month-over-month and 961% year-over year. Another gaming site, Hero Wars (hero-wars.com), grew its visitors 139% month-over-month and 233% year-over-year. Another gaming site, Warhammer (warhammer.com), saw an even bigger percentage increase based on US traffic – the largest in our analysis – up over 1,900% month-over-month and nearly 3,700% year-over year to 5.8 million visits in November. However, this was at least partly due to a URL change. Based on an analysis of the fastest growing websites across all categories, a couple of Secret Santa-themed sites, Drawnames (drawnames.com) and Elfster (elfster.com) also attracted by month-over-month traffic bumps in the US, up 788% and 526%, respectively, October to November. Both also grew traffic year-over-year, by 32% for DrawNames and 18.2% for Elfster. For this ranking, we analyzed traffic across 2,000 top websites that Similarweb tracks. Fortnite traffic still rising, far higher than over the holidays last year Fortnite is a product of Epic Games that has been around since 2017. Its recent popularity stems from the introduction of several new game play modes, including one featuring Lego characters and a retro mode that allows players to experience the game as it was when they first played it. After a relatively quiet 2022 holiday season, Fortnite experienced several traffic peaks in 2023 as new features came online, then took off sharply around Thanksgiving. After receiving a strong Black Friday bump, traffic increased another 50% over the last week for which we have data (through December 10). Warhammer also experiencing a boom in new interest Warhammer has been around as a tabletop fantasy wargame since the 1980s, but its recent surge in popularity probably has more to do with the release of the related streaming game Warhammer 40,000: Rogue Trader. Possibly even more significant is a URL change Warhammer’s parent company Games Workshop made to direct more traffic to that domain. Fastest growing websites worldwide Based on month-over-month growth in unique visitors, these were the fastest growing websites worldwide in November. Fastest growing in the US: Warhammer, Drawnames, and Elfster Based on US data, Warhammer was the clear winner by percentage growth, and Fortnite is farther back in the pack. That was also true by total traffic. However, on a year-over-year basis, Fortnite grew both its user count and its total traffic by over 1,200%. The Similarweb Insights & Communications team is available to pull additional or updated data on request for the news media (journalists are invited to write to press@similarweb.com). When citing our data, please reference Similarweb as the source and link back to the most relevant blog post or similarweb.com/blog/insights/. Methodology Disclaimer: All names, brands, trademarks, and registered trademarks are the property of their respective owners. The data, reports, and other materials provided or made available by Similarweb consist of or include estimated metrics and digital insights generated by Similarweb using its proprietary algorithms, based on information collected by Similarweb from multiple sources using its advanced data methodologies. Similarweb shall not be responsible for the accuracy of such data, reports, and materials and shall have no liability for any decision by any third party based in whole or in part on such data, reports, and materials. by David F. Carr David covers social media, digital advertising, and generative AI. With a background in web trends since the 1990s, he’s also the author of \"Social Collaboration for Dummies\". Related Topics: Ecommerce News Media & Entertainment News This post is subject to Similarweb legal notices and disclaimers. Related Posts Insights The Democratic National Convention in Search and News Traffic Media & Entertainment News by David F. Carr 5 Min. Aug 26, 2024 Insights Where the Olympics News Drove the Most News Traffic Media & Entertainment News by David F. Carr 4 Min. Aug 14, 2024 Insights Similarweb Traffic League: Who Was the Most Popular Football Club in April 2024? Media & Entertainment News by Itay Gross 4 Min. May 28, 2024 Insights NCAA’s Women’s Basketball Stars Eclipsing Men’s Ahead of March Madness Media & Entertainment News by Molly Winik 3 Min. Mar 18, 2024 Insights A Super Bowl with a Difference: Swifties Flock to This Year’s Event Betting News Media & Entertainment News by Daniel Reid 5 Min. Feb 6, 2024 Insights Parentz Talk Tops Digital 100 Ranking of Fastest Growing News & Media Sites Media & Entertainment News by Inès Durand 4 Min. Jan 10, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Fortnite Black Friday Traffic Surge Continued Into December"
    },
    {
      "level": "H2",
      "text": "Fortnite traffic surged 213% from October to November and was up over 734% year-over-year (+1,200% in the US)"
    },
    {
      "level": "H2",
      "text": "Key takeaways"
    },
    {
      "level": "H2",
      "text": "Fortnite traffic still rising, far higher than over the holidays last year"
    },
    {
      "level": "H2",
      "text": "Warhammer also experiencing a boom in new interest"
    },
    {
      "level": "H2",
      "text": "Fastest growing websites worldwide"
    },
    {
      "level": "H2",
      "text": "Fastest growing in the US: Warhammer, Drawnames, and Elfster"
    },
    {
      "level": "H3",
      "text": "The Democratic National Convention in Search and News Traffic"
    },
    {
      "level": "H3",
      "text": "Where the Olympics News Drove the Most News Traffic"
    },
    {
      "level": "H3",
      "text": "Similarweb Traffic League: Who Was the Most Popular Football Club in April 2024?"
    },
    {
      "level": "H3",
      "text": "NCAA’s Women’s Basketball Stars Eclipsing Men’s Ahead of March Madness"
    },
    {
      "level": "H3",
      "text": "A Super Bowl with a Difference: Swifties Flock to This Year’s Event"
    },
    {
      "level": "H3",
      "text": "Parentz Talk Tops Digital 100 Ranking of Fastest Growing News & Media Sites"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by David F. Carr"
}