{
  "url": "https://www.similarweb.com/blog/insights/media-entertainment-news/hbo-max-rebrand-streaming-industry/",
  "slug": "hbo-max-rebrand-streaming-industry",
  "title": "Cancellation Traffic on Max Surges After Rebrand From HBO Max | Similarweb",
  "description": "Cancellation traffic on Max surged 598% in one week after the end of Succession and transition from HBO Max, marking a 468.4% YoY increase in May, 2023.",
  "content": "HomeBlogInsightsMedia & Entertainment NewsCancellation Traffic on Max Surges 598% After End of Succession and Transition From HBO Max Insights Cancellation Traffic on Max Surges 598% After End of Succession and Transition From HBO Max Start your free trial by Sneha Pandey , Insights Manager 4 Min. June 14, 2023 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic On May 23, 2023, HBO Max rebranded to Max, unifying the HBO Max and Discovery+ streaming services under one brand. The decision to discard the venerable HBO brand puzzled many observers, resulting in confusion among subscribers as they discovered TV and mobile apps were no longer functional. The conclusion of tentpole titles Succession on May 28th seems to have been one factor spurring an exodus, resulting in a 598% surge in confirmed cancellations over the course of a week, according to Similarweb estimates. Key takeaways The rebranding and Succession exodus: Max.com’s cancellation traffic rose 598% week over week (May 24th – May 30th vs May 17th – May 23rd) to over 46,474 visits after the rebrand on May 23rd and the end of Succession on May 28th. Discovery+ loses subscribers to the bundle: Discovery+’s cancellation traffic spiked 42.3% month over month and 566.7% year over year in May 2023 amidst the consolidation of the 2 platforms. Meanwhile, the platform’s subscriber traffic has seen large year-over-year declines in month traffic this year, decreasing -40.21% YoY in May 2023. Technical issues overshadowed the transition: In the aftermath of the transition, Max.com’s help center gained 11.28 million visits in May ‘23 while HBO’s help center saw 6.073 million visits. This marked the highest volume of help center traffic in the platform’s history, with visits up 209.6% month over month compared to April ‘23 and visits up 144.4% year over year compared to May ‘22. Millions flock to see the new platform: Max.com traffic reached 103.4 million unique visitors in May 2023, surpassing Netflix’s 51.65 million visitors and Hulu’s 33.61 million unique visitors. Unprecedented cancellation traffic surge According to Similarweb data, Max.com saw a 598.4% increase in cancellation traffic from May 24 to May 30 compared to the previous week. Cancellation traffic surged 75.8% on May 28th compared to the previous day, marking the end of Succession. The trend continued into the following days with another 65.8% increase in cancellation traffic on May 29th compared to the previous day. Despite these changes going into effect towards the end of May, they made a dent in the bigger picture. Cancellation traffic jumped over 468.4% year over year in May 2023 Max.com saw 59,761 cancellation visits in May in addition to Hbomax.com’s 24,585 cancellation visits. Max.com’s cancellation traffic alone was 70.2% higher than Hbomax.com’s in April. When taking both platforms into account, this marked a 140.2% month-over-month increase and a 468.4% year-over-year increase in cancellation traffic. The increase in cancellation traffic coincided with the end of the popular HBO series Succession on May 28. This trend may prove the necessity of an extended-release content model to maintain long-term engagement and member retention. In other words, we suspect Max needs more must-see programming to keep subscribers from canceling. That may prove hard to come by if the platform continues to be impacted by the industry-wide writer’s strike. Discovery+ loses subscribers to bundle Cancellation traffic on Discovery+ spiked by 42.3% month over month and a massive 566.7% year over year in May 2023. This increase is likely due to the consolidation of the two platforms and ongoing content issues. While Discovery+ will continue to have its own separate offering, some users subscribed to both platforms may have decided to cancel Discovery+ in favor of the bundle. Technical issues overshadow the transition Technical issues following the transition to Max resulted in a surge in traffic to the HBO Max and Max help centers. Some subscribers reported difficulties when trying to convert their subscriptions, and there were also reports of errors and delays. According to Similarweb data, the help center saw a 209.6% month-over-month increase in traffic and a 144.4% year-over-year increase in traffic in May 2023. However, Warner Bros. Discovery has downplayed these issues, stating that they were minor and have since been resolved. But the change left more than 17 million subscribers looking for help on one of the two support sites. The future of streaming: one-size-fits-all and bundles The streaming industry is witnessing a shift towards all-in-one platforms that cater to the entire family, as consumers seek convenience and cost-effectiveness. To better compete with market leaders like Netflix and Amazon Prime, companies such as Warner Bros. Discovery are consolidating their services. Warner Bros. Discovery thought combining HBO, Discovery+, and other services into Max would make them more competitive with Disney+ and others – even as Disney+ is consolidating with Hulu. But Max is off to a rough start. The Similarweb Insights & Communications team is available to pull additional or updated data on request for the news media (journalists are invited to write to press@similarweb.com). When citing our data, please reference Similarweb as the source and link back to the most relevant blog post or similarweb.com/blog/insights/. Contact: For more information, please write to press@similarweb.com. Report By: Sneha Pandey, Insights Manager Methodology Disclaimer: All names, brands, trademarks, and registered trademarks are the property of their respective owners. The data, reports, and other materials provided or made available by Similarweb consist of or include estimated metrics and digital insights generated by Similarweb using its proprietary algorithms, based on information collected by Similarweb from multiple sources using its advanced data methodologies. Similarweb shall not be responsible for the accuracy of such data, reports, and materials and shall have no liability for any decision by any third party based in whole or in part on such data, reports, and materials. by Sneha Pandey Insights Manager Sneha, a Purdue graduate, delivers data-driven insights on Retail, eCommerce, Politics, CPG, and B2B Software, helping Fortune 50 companies succeed. Related Topics: Media & Entertainment News This post is subject to Similarweb legal notices and disclaimers. Related Posts Insights The Democratic National Convention in Search and News Traffic Media & Entertainment News by David F. Carr 5 Min. Aug 26, 2024 Insights Where the Olympics News Drove the Most News Traffic Media & Entertainment News by David F. Carr 4 Min. Aug 14, 2024 Insights Similarweb Traffic League: Who Was the Most Popular Football Club in April 2024? Media & Entertainment News by Itay Gross 4 Min. May 28, 2024 Insights NCAA’s Women’s Basketball Stars Eclipsing Men’s Ahead of March Madness Media & Entertainment News by Molly Winik 3 Min. Mar 18, 2024 Insights A Super Bowl with a Difference: Swifties Flock to This Year’s Event Betting News Media & Entertainment News by Daniel Reid 5 Min. Feb 6, 2024 Insights Parentz Talk Tops Digital 100 Ranking of Fastest Growing News & Media Sites Media & Entertainment News by Inès Durand 4 Min. Jan 10, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Cancellation Traffic on Max Surges 598% After End of Succession and Transition From HBO Max"
    },
    {
      "level": "H2",
      "text": "Key takeaways"
    },
    {
      "level": "H2",
      "text": "Unprecedented cancellation traffic surge"
    },
    {
      "level": "H2",
      "text": "Cancellation traffic jumped over 468.4% year over year in May 2023"
    },
    {
      "level": "H2",
      "text": "Discovery+ loses subscribers to bundle"
    },
    {
      "level": "H2",
      "text": "Technical issues overshadow the transition"
    },
    {
      "level": "H2",
      "text": "The future of streaming: one-size-fits-all and bundles"
    },
    {
      "level": "H3",
      "text": "The Democratic National Convention in Search and News Traffic"
    },
    {
      "level": "H3",
      "text": "Where the Olympics News Drove the Most News Traffic"
    },
    {
      "level": "H3",
      "text": "Similarweb Traffic League: Who Was the Most Popular Football Club in April 2024?"
    },
    {
      "level": "H3",
      "text": "NCAA’s Women’s Basketball Stars Eclipsing Men’s Ahead of March Madness"
    },
    {
      "level": "H3",
      "text": "A Super Bowl with a Difference: Swifties Flock to This Year’s Event"
    },
    {
      "level": "H3",
      "text": "Parentz Talk Tops Digital 100 Ranking of Fastest Growing News & Media Sites"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Sneha Pandey"
}