{
  "url": "https://www.similarweb.com/blog/insights/media-entertainment-news/netflix-roku-potential-merger-magic/",
  "slug": "netflix-roku-potential-merger-magic",
  "title": "Netflix & Roku: Potential Merger Magic? | Similarweb",
  "description": "We analyzed the logic for a potential merger of Netflix and Roku, following Business Insider's report of an unusual freeze on Roku employee stock trading.",
  "content": "HomeBlogInsightsMedia & Entertainment NewsNetflix & Roku: Potential Merger Magic? Insights Netflix & Roku: Potential Merger Magic? Start your free trial by Anthony T. Occhipinti , Senior Analyst 4 Min. June 22, 2022 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic On June 8th, Business Insider published a story regarding Roku’s recent decision to close the trading window in its stock for all employees – prompting “internal chatter” among employees that the company may be an acquisition target, with Netflix as the most likely buyer. Roku’s move to limit employee trading comes at a time when such restrictions normally don’t apply. Key takeaways Similarweb estimates show a 28.5% surge in traffic visits to Roku’s ad site from February to May 2022, highlighting the secular trend toward streaming adoption As a point of comparison, streaming competitor Hulu’s ad site traffic experienced an even stronger 74% surge in visits over the same February-May period Traffic (measured by desktop and mobile visits) to HBO Max, Discovery+ and Peacock’s respective ad sites is so low, that Similarweb’s platform considers them insignificant, highlighting the difficulty and time required to build a successful ad business in the streaming space Roku & Netflix Merger Speculation The Business Insider story has set off a wave of speculation among investors and industry observers regarding the wisdom of Netflix purchasing Roku. At first glance, such a marriage seems to make sense. Netflix recently announced its intention to build an ad-supported tier, a move that many had speculated may occur. This is due to the company reporting a decline in subscribers for Q1 2022 earnings that surprised Wall Street. Disney has also recently announced its intention to create an ad-supported tier of service for Disney+. Since Roku’s revenues are primarily ad-based, owning Roku would instantly give Netflix an ad platform that it would otherwise take time and money to build. Roku’s Business Model Roku has built a lucrative ad business. Its ad revenues are over 7x its device revenues and have much higher margins. On the Q1 2022 earnings call, Roku’s CEO Anthony Wood said the traditional TV advertising business in the U.S. is a $60 billion market. For perspective, Roku’s 2021 ad revenues were $2.3 billion, which is only 3.8% of this $60 billion total addressable market. That suggests a strong runway for growth. He also noted that only 18% of traditional TV ad spend has moved to streaming, while streaming’s portion of total TV viewing time is now near 50%. In addition, the company noted in its Q1 2022 earnings release that streaming viewership has now surpassed traditional legacy TV viewership for the first time during the quarter for the 18-49 age cohort, a key demographic for advertisers. Specifically, 65% of adults in the cohort watched streaming, compared to 63% watching traditional TV, according to Nielsen. Similarweb estimates corroborate this, showing about 63% of global visitors to roku.com fell into the 18-44 age cohort for the one-year period ending May 2022. Furthermore, advertising revenue growth for legacy pay TV is either declining or growing at a much slower rate. Charter’s ad revenue growth actually declined year-over-year by -6.2% in 2021. While Comcast’s ad revenues grew 8.7% in 2021, this rate pales in comparison to Roku’s ad platform growth last year, which grew 80%. Roku may have a competitive advantage over legacy pay TV due to its technology and data collection capabilities. Gathering more demographic data on viewers gives Roku the ability to offer clients targeted ads and a better return on investment. Global monthly visitors to roku.com on both desktop and mobile increased 45.7% year-over-year in May 2022 High Barriers to Entry for Ad Business It’s taken Roku over a decade to build its ad business. Even for deep-pocketed companies like Netflix, building a book of advertising clients takes time. For reference, we compared traffic visits to Roku’s advertising site and Hulu’s advertising site. These are sites where advertisers can connect with each platform to begin their advertising journey. Hulu has also built a thriving ad platform, although it launched in 2007, once again highlighting the time required to build a successful ad business. Hulu has seen site traffic to its ad site surge 74% from February to May 2022. This compares to Roku’s ad site traffic growth of 28.5% over the same period. This strong near-term growth reflects the secular trend toward streaming adoption for both on-demand and linear TV viewing. We also looked at companies with nascent ad businesses like HBO Max, Discovery+, and Peacock, all of which have ad-supported tiers. Traffic levels to their ad sales sites were so low, that Similarweb’s platform considers the data insignificant. HBO Max and Peacock have only existed for around two years while Discovery+ launched in the U.S. in January 2021. Outlook Netflix is the most mature streaming service. Now that they may be facing growth headwinds, it makes strategic sense for them to explore other avenues for growth – such as offering an ad-supported tier, building a rumored cloud gaming platform, and continuing to consider acquisitions as organic subscriber growth slows. The company already announced mobile gaming in November 2021 for existing subscribers to access at no additional cost. And while a Netflix-Roku merger remains only speculation, for now, it does seem to make sense for Netflix if they want to save time and avoid going the do-it-yourself route by building an ad business from scratch. The “build or buy” question here would seem to lean toward the latter option. If these companies are not currently in merger talks, the question remains: why did Roku management decide to restrict employee trading? Might they be talking with a different suitor, or is something else going on? The Similarweb Insights Newsroom is available to pull additional or updated data on request for the news media (journalists are invited to write to press@similarweb.com). When citing our data, please reference Similarweb as the source and link back to the most relevant blog post or similarweb.com/blog/insights/. Supporting Data: Google Sheet Methodology Disclaimer: All data, reports and other materials provided or made available by Similarweb are based on data obtained from third parties, including estimations and extrapolations based on such data. Similarweb shall not be responsible for the accuracy of the materials and shall have no liability for any decision by any third party based in whole or in part on the materials. by Anthony T. Occhipinti Senior Analyst Anthony, with a finance background, joined Similarweb in 2022. A Kansas City native and KC Chiefs fan, he enjoys golf, cooking, and family life in New Jersey. Related Topics: Media & Entertainment News This post is subject to Similarweb legal notices and disclaimers. Related Posts Insights The Democratic National Convention in Search and News Traffic Media & Entertainment News by David F. Carr 5 Min. Aug 26, 2024 Insights Where the Olympics News Drove the Most News Traffic Media & Entertainment News by David F. Carr 4 Min. Aug 14, 2024 Insights Similarweb Traffic League: Who Was the Most Popular Football Club in April 2024? Media & Entertainment News by Itay Gross 4 Min. May 28, 2024 Insights NCAA’s Women’s Basketball Stars Eclipsing Men’s Ahead of March Madness Media & Entertainment News by Molly Winik 3 Min. Mar 18, 2024 Insights A Super Bowl with a Difference: Swifties Flock to This Year’s Event Betting News Media & Entertainment News by Daniel Reid 5 Min. Feb 6, 2024 Insights Parentz Talk Tops Digital 100 Ranking of Fastest Growing News & Media Sites Media & Entertainment News by Inès Durand 4 Min. Jan 10, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Netflix & Roku: Potential Merger Magic?"
    },
    {
      "level": "H2",
      "text": "Key takeaways"
    },
    {
      "level": "H2",
      "text": "Roku & Netflix Merger Speculation"
    },
    {
      "level": "H2",
      "text": "Roku’s Business Model"
    },
    {
      "level": "H2",
      "text": "High Barriers to Entry for Ad Business"
    },
    {
      "level": "H2",
      "text": "Outlook"
    },
    {
      "level": "H3",
      "text": "The Democratic National Convention in Search and News Traffic"
    },
    {
      "level": "H3",
      "text": "Where the Olympics News Drove the Most News Traffic"
    },
    {
      "level": "H3",
      "text": "Similarweb Traffic League: Who Was the Most Popular Football Club in April 2024?"
    },
    {
      "level": "H3",
      "text": "NCAA’s Women’s Basketball Stars Eclipsing Men’s Ahead of March Madness"
    },
    {
      "level": "H3",
      "text": "A Super Bowl with a Difference: Swifties Flock to This Year’s Event"
    },
    {
      "level": "H3",
      "text": "Parentz Talk Tops Digital 100 Ranking of Fastest Growing News & Media Sites"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Anthony T. Occhipinti"
}