{
  "url": "https://www.similarweb.com/blog/insights/media-entertainment-news/nytimes-and-media/",
  "slug": "nytimes-and-media",
  "title": "Q2 Update: Visits to NYTimes.com Dropped By 27.4% | Similarweb",
  "description": "The New York Times has made long-term traffic gains with lifestyle properties like the Wordle game, but is giving up some of those gains this year",
  "content": "HomeBlogInsightsMedia & Entertainment NewsNYTimes.com Traffic Dropped 27.4% in Q2 Insights NYTimes.com Traffic Dropped 27.4% in Q2 Start your free trial by David F. Carr 4 Min. July 21, 2023 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Measured over the long term, the New York Times has still gained from properties like Wordle and its cooking site For a full year, the New York Times website enjoyed traffic gains, 60% to 142% year-over-year, largely based on lifestyle content such as cooking and games (particularly Wordle), which were the sweetener on top of its journalistic content. But every month since February, traffic has been down, as it was by 27.4% year-over-year in the second quarter. Similarweb’s latest survey of the performance of news and media websites focuses on nytimes.com because its downturn has been so dramatic but also includes other leading US publications measured by estimates of their worldwide traffic. Key takeaways Traffic to nytimes.com was down 27.4% year-over-year in Q2. In June, it was down 14.6% year-over-year. Share of traffic, within the competitive set we track, was down 4 percentage points year-over-year for nytimes.com to 30.2%. That still leaves the website with a significant lead. The next most popular site, cnn.com, has a 25.9% share by that measure. Traffic to cnn.com was down 3.1% year-over-year for the quarter, perhaps weighed down by controversies like the one over deciding to host a Town Hall event with former President Trump in May. However, in June traffic to cnn.com was actually up 6.9% year-over-year. Similarweb’s survey of the performance of news and websites shows the greatest gains for People (people.com +16.1%) and USA Today (usatoday.com +14.7%). Like the New York Times, the Washington Post saw a significant dip in traffic (washingtonpost.com -17.3%). All these statistics are for year-over-year change. We attribute the decline in nytimes.com traffic partly to tough year-over-year comparisons with the past year’s boom. Looked at from the broader perspective of a trailing 12 months analysis, web traffic to the Times website is up 8.9% over the previous year. Still, the Times could use another Wordle-like traffic boost about now. The New York Times Company (NASDAQ: NYT) is scheduled to report Q2 earnings in early August. Meanwhile, traffic to the advertising portal at advertising.nytimes.com appears to be stuttering, in a bad sign for advertiser interest. The Q2 drop in traffic for nytimes.com was greater than any other site’s gain The New York Times and the Washington Post saw the biggest loss in their digital audiences. NYTimes.com’s share of traffic dropped 6.4% Multiple competitors gained a point or two at the expense of the New York Times. In the big picture, NYTimes.com is still ahead While performance over the past several months must be humbling for digital strategists at the New York Times, if looked at over a larger timeframe their efforts to capitalize on lifestyle content have succeeded in bringing in traffic on an ongoing basis, regardless of the news cycle. The chart below shows performance over the past 12 months, compared with the previous 12 months. At the same time, a continued weakening in digital demand for Times content will eventually eat into those gains. And on a percentage basis, the People Magazine website – a purveyor of purely lighter fare – looks even better, having gained 22% compared with 8.9% for the New York Times. The media properties mentioned in this report owned by public companies include the New York Times (NYSE: NYT), People Magazine (part of IAC, NYSE: IAC), the New York Post, Fox News, and the Wall Street Journal (News Corp, NASDAQ: NWSA), CNN (Warner Brothers Discovery, NYSE: WBD), and USA Today (Gannett, NYSE: GCI). The Washington Post is owned by Nash Holdings, which is controlled by Jeff Bezos. The Similarweb Insights & Communications team is available to pull additional or updated data on request for the news media (journalists are invited to write to press@similarweb.com). When citing our data, please reference Similarweb as the source and link back to the most relevant blog post or similarweb.com/blog/insights/. Contact: For more information, please write to press@similarweb.com. Methodology Disclaimer: All names, brands, trademarks, and registered trademarks are the property of their respective owners. The data, reports, and other materials provided or made available by Similarweb consist of or include estimated metrics and digital insights generated by Similarweb using its proprietary algorithms, based on information collected by Similarweb from multiple sources using its advanced data methodologies. Similarweb shall not be responsible for the accuracy of such data, reports, and materials and shall have no liability for any decision by any third party based in whole or in part on such data, reports, and materials. by David F. Carr David covers social media, digital advertising, and generative AI. With a background in web trends since the 1990s, he’s also the author of \"Social Collaboration for Dummies\". Related Topics: Media & Entertainment News This post is subject to Similarweb legal notices and disclaimers. Related Posts Insights The Democratic National Convention in Search and News Traffic Media & Entertainment News by David F. Carr 5 Min. Aug 26, 2024 Insights Where the Olympics News Drove the Most News Traffic Media & Entertainment News by David F. Carr 4 Min. Aug 14, 2024 Insights Similarweb Traffic League: Who Was the Most Popular Football Club in April 2024? Media & Entertainment News by Itay Gross 4 Min. May 28, 2024 Insights NCAA’s Women’s Basketball Stars Eclipsing Men’s Ahead of March Madness Media & Entertainment News by Molly Winik 3 Min. Mar 18, 2024 Insights A Super Bowl with a Difference: Swifties Flock to This Year’s Event Betting News Media & Entertainment News by Daniel Reid 5 Min. Feb 6, 2024 Insights Parentz Talk Tops Digital 100 Ranking of Fastest Growing News & Media Sites Media & Entertainment News by Inès Durand 4 Min. Jan 10, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "NYTimes.com Traffic Dropped 27.4% in Q2"
    },
    {
      "level": "H2",
      "text": "Measured over the long term, the New York Times has still gained from properties like Wordle and its cooking site"
    },
    {
      "level": "H2",
      "text": "Key takeaways"
    },
    {
      "level": "H2",
      "text": "The Q2 drop in traffic for nytimes.com was greater than any other site’s gain"
    },
    {
      "level": "H2",
      "text": "NYTimes.com’s share of traffic dropped 6.4%"
    },
    {
      "level": "H2",
      "text": "In the big picture, NYTimes.com is still ahead"
    },
    {
      "level": "H3",
      "text": "The Democratic National Convention in Search and News Traffic"
    },
    {
      "level": "H3",
      "text": "Where the Olympics News Drove the Most News Traffic"
    },
    {
      "level": "H3",
      "text": "Similarweb Traffic League: Who Was the Most Popular Football Club in April 2024?"
    },
    {
      "level": "H3",
      "text": "NCAA’s Women’s Basketball Stars Eclipsing Men’s Ahead of March Madness"
    },
    {
      "level": "H3",
      "text": "A Super Bowl with a Difference: Swifties Flock to This Year’s Event"
    },
    {
      "level": "H3",
      "text": "Parentz Talk Tops Digital 100 Ranking of Fastest Growing News & Media Sites"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by David F. Carr"
}