{
  "url": "https://www.similarweb.com/blog/insights/media-entertainment-news/streaming-wars/",
  "slug": "streaming-wars",
  "title": "Streaming Wars: Netflix Remains King, But Disney Continues to See Strong Growth | Similarweb",
  "description": "Streaming services continue to gain adoption as consumers are transitioning away from cable and broadcast. Who's gaining and who's losing?",
  "content": "HomeBlogInsightsMedia & Entertainment NewsStreaming Wars: Netflix Remains King, But Disney Continues to See Strong Growth Insights Streaming Wars: Netflix Remains King, But Disney Continues to See Strong Growth Start your free trial by Anthony T. Occhipinti , Senior Analyst 10 Min. March 14, 2022 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Streaming services continue to gain adoption as consumers are transitioning away from cable and broadcast. Similarweb estimates show strong traffic visits to sign-up pages for most services, while cancellation traffic is generally lower. Key takeaways Content is king, pushing continued investment in exclusive programming that is key to attracting and keeping subscribers on streaming sites Streamers are creating content to compete with larger more established studios and adjusting distribution strategies to be eligible for highly coveted industry awards Popular streaming services are seeing more traffic to their sign-up pages than cancellation pages, according to Similarweb estimates, as streaming adoption continues to see strong growth – accelerated by shifting behavior during the pandemic-induced lockdowns and ongoing cord-cutting Competition remains fierce, given low switching costs for consumers While Netflix is the global leader in streaming with almost 222 million paid subscribers, Disney+ is in second place with 130 million paid subs (as of fiscal Q1 2022 ending Jan 1, 2022) HBO Max is in third place with almost 74 million paid subs (although this includes subscribers to its premium channels) while Hulu is fourth with 41 million paid subs, according to Similarweb estimates Amazon Prime Video is a major player, as well, with over 200 million Prime members streaming content during 2021 Paramount+ is another large player with 32.8M paid subs as of Q4 2021 As the streaming age is now in full swing, we examined how the major players are faring as the arms race for content heats up. Specifically, we looked at Similarweb estimates for global desktop-only traffic to sign-up and cancellation pages (see charts below). According to a TransUnion December 2021 survey conducted by the Harris Poll, more consumers are streaming now than watching cable and satellite TV. In fact, the survey found that 70% of Americans who have watched TV in the past month have streamed TV or movies. By comparison, in March 2018, CNBC found that nearly 60% of Americans have some form of streaming service. Ultimately, each platform’s success will be determined by the quality and quantity of its exclusive content and the ability to continue to create this content. This is a very capital-intensive business, and each service will continue to increase pricing in order to fund its growth in content. This requires a delicate balance between managing these growing costs while optimizing price increases to ensure the service’s value stays high and existing subs do not churn. The Academy Awards were held on March 27th and AppleTV+ became the first streaming service to win the Oscar for Best Picture with its film Coda. This is a huge win for Apple and for the entire streaming space. As a result, search interest in Coda saw a spike in volume: We looked at the five most popular streaming platforms to get a sense of how each is performing according to Similarweb estimates: Netflix, Disney+, Amazon Prime Video, Hulu and HBO Max. Specifically, we drilled down on the number of visits to the sign-up and cancellation pages over the course of 2021 to understand the traffic volume each is experiencing. Netflix Netflix is the streaming pioneer and, therefore, the most mature. That said, it is still seeing healthy growth in subscriber numbers. In Q4 2021, they had 8.2+ million paying global net adds to reach a total of 221.8 million paying global subscribers per their earnings report. In the US & Canada, they now report 75.2 million paying subscribers as of the end of the quarter. In recent years, the growth driver for Netflix has been international. Looking at Q4 2021, the EMEA, LATAM, and APAC regions had a combined +7 million paid net additions versus ~1.2 million in the US & Canada. The number of visits, according to Similarweb estimates, seen going to Netflix’s sign-up and cancellation pages corroborates this growth as there are more international monthly visitors than US & Canadian visitors going back to December 2019. We believe there is a high rate of conversion for visitors reaching these pages as users tend to sign up and cancel using the browser. One of the key drivers for international sub-growth has been investment in local content specific to the country and filmed in the local language. Some of this content, such as Squid Games and Lupin, have had broader global appeal with the former South Korean-produced hit becoming a worldwide sensation. Netflix has been focused on producing quality content in order to increase subscriber growth and keep churn low. When the Oscar nominations were announced on February 8th, Netflix received 27 nominations for 10 titles including The Power of the Dog, which received 12 nominations, more than any other picture. Disney+ Disney rolled out its Disney+ streaming service in late 2019 and has quickly seen the platform grow into one of the must-have services for streaming. The company has four main content properties: Disney, Pixar, Marvel, and Lucasfilm. Additional content is also showcased. These include National Geographic and some additional media assets they recently purchased from Fox such as The Simpsons. While Disney is traditionally viewed as a brand targeted to a younger audience, management noted on the recent Q1 2022 earnings call (fiscal year Q1 ended January 1st, 2022 so a Q4 calendar quarter) that slightly over 50% of households subscribed to Disney+ do not have children. Management also announced that they ended the quarter with almost 130 million global paid subscribers for Disney+, which reflected an increase of over 11 million net additions from fiscal Q4. The Disney content engine has led to a proven strategy, which has been copied by others, of creating IP and then monetizing it through other channels, especially merchandise and visits to its theme parks. Disney’s content machine positioned it to attract droves of subscribers at the launch of Disney+, given its large library of very popular, family-friendly content. This represented a shift in strategy for the company, as the prior strategy in place for decades had them keeping their classic content in the “vault” and only releasing it every seven years or so for the new generation. In order to attract those interested in only new content, they released a new Star Wars TV series, The Mandalorian, which was a huge success from its launch. This has led to several new TV series in the pipeline for both Star Wars and Marvel concepts, among other new and exclusive content. This is content that not only attracts new subscribers but is also retaining them. Disney+ has provided the company with an opportunity to introduce new content that can then be further monetized in keeping with its core strategy. Marvel and Star Wars appeal to a largely young male demographic, who tend to be fanatical in their devotion. This subscriber loyalty is important because of this cohort’s propensity to buy movie tickets as well as merchandise. When you add the exclusivity of TV shows for these properties on Disney+, it elevates the streaming service as a must-have app for devoted fans. There are currently at least seven Star Wars television series in the works, including the highly anticipated Obi-Wan Kenobi series debuting in May. These are in addition to The Mandalorian and its spin-off, The Book of Boba Fett, as well as two live-action series and four animated series currently on the platform. Marvel brandishes five TV series already available to stream, with another twelve in the works as well. There are also new Disney-branded television series and movies that have been added to the platform as well. On March 4, 2022, Disney announced they will introduce an ad-supported offering for Disney+ in the US in late 2022 and plans to expand it internationally in 2023. This version of the service would be offered at a lower price point with the goal of increasing its addressable market to a broader audience although Disney did not disclose pricing at this time. The company views this step as a “building block” to achieve its long-term target of 230-260 million Disney+ subscribers by FY 2024. This move may put pressure on Netflix to offer its own ad-supported plan. As we look at Similarweb estimates, we note strong traffic to the Disney+ sign-up page while the cancellation page is seeing much less traffic. We expect international sign-up visits to remain strong as Disney has announced the launch of Disney+ in 42 additional countries in Europe, the Middle East and Africa this summer. Hulu Hulu is a streaming service and joint venture between Disney and Comcast, with Disney owning a majority stake at 67% and has the option to purchase Comcast’s 33% stake as early as 2024. Hulu has two offerings: a Netflix-like streaming library, in addition to a Live TV service that has always included the Hulu library and now comes bundled with Disney+ and ESPN+. Hulu had 45.3 million paid subscribers (including 4.3 million Live TV subs) at the end of fiscal Q1 2022 (ended January 1, 2022) per Disney’s earnings report. Some of Hulu’s original content includes the TV series The Handmaid’s Tale, Ramy, Atlanta, and the recent hit, Reservation Dogs (rated 98% on Rotten Tomatoes). Like Disney+, Similarweb estimates show strong monthly sign-up visits for Hulu, particularly in the US, while cancellation visits are much lower with very few visits coming from international traffic. *** HBO Max HBO Max, owned by WarnerMedia, is expected to be spun off from AT&T in Q2 2022. Those shares will then be merged with all shares classes of Discovery capital stock. This transaction is expected to close in Q2 2022. For years, the narrative around HBO was that it would need to transform itself from a linear premium cable channel into a streaming service in order to compete with the likes of Netflix and others. HBO Max is the realization of that transformation. At the end of Q4 2021, HBO Max and its premium channels had 73.8 million global subscribers after adding 13.1 million subscribers in 2021 per its earnings report. HBO Max maintains a broad library of popular original content, including the TV series Game of Thrones, The Sopranos, Sex in the City, and, more recently, a limited series hit starring Kate Winslet called Mare of Easttown (95% rating on Rotten Tomatoes). Similarweb estimates show strong HBO sign-up visits, especially internationally, from June 2021 forward. This is due to management’s focus on LATAM subscriber growth in 2021, with it launching in 39 territories in the region at the end of June. This year should be another strong year of international growth for HBO Max as it plans to launch its service in 15 additional European countries in March. Amazon Prime Amazon began bundling Prime Video with its Prime subscription in 2011. Since then, the company has been very focused on investing in content and has seen its streaming library grow to include a host of original movies and TV shows. It notably has tripled the number of Amazon Originals since 2018. During the 2022 Super Bowl, the company ran an ad for its upcoming Lord of the Rings television series, subtitled The Rings of Power, set to debut this September. The company has committed to producing five seasons and is expected to spend over $1 billion on the series, with Vanity Fair reporting the first season alone cost $462 million. If true, that would make it the most expensive television series ever made. While other traditional streamers like Netflix have avoided adding sports programming as part of their streaming packages, Amazon has invested in sports and has been simulcasting the NFL’s Thursday Night Football package on Prime Video. It has also been broadcasted on NFL Network and often on Fox as well. The company recently announced that for the 2022 NFL season, it has acquired exclusive rights to broadcast Thursday Night Football on Prime Video. As we look at Similarweb estimates, it’s important to note that Prime sign-ups include all Prime customers. Since Prime Video is bundled with Prime, many of these customers may not be watching the video service. So it’s difficult to ascertain how many of these Prime Video subs could be defined as monthly active users, which is how we would view anyone paying a monthly fee for access to a streaming service. However, Amazon did disclose in its Q4 2021 earnings press release that over 200 million Prime members streamed content in 2021. Amazon has also recently announced a $20 increase in the annual subscription fee for Prime. Consequently, it will be interesting to see if this leads to an increase in cancellations over the course of 2022. Everyone Else Notably, there are several other players in the highly competitive streaming space, but we chose to focus on these five stalwarts as they are the largest. Apple is presumably another large player, but it does not disclose subscriber numbers for its AppleTV+ service. However, it will be interesting to see if traffic to its sign-up page spikes post-Academy Awards now that its exclusive film Coda has won the Oscar for Best Picture. Paramount+ is also a large player with 32.8M subscribers as of the end of Q4 2021. Comcast’s Peacock service is much smaller, with only 9 million paying subscribers at the end of Q4 2021, according to the respective company reports. In a post-pandemic world, it’s clear the overall number of hours viewed has declined as the re-opening continues. However, subscriber totals across these platforms have continued to increase – demonstrating both the popularity and stickiness of streaming. For now, it would appear streamers do have pricing power. But just as the cord-cutting trend proved the wallet-share limits of video entertainment on consumers’ budgets, a combination of increasing apps and increasing prices may soon limit the ability of consumers to pay more for these services and new entrants’ ability to gain share. This could lead to streamers exploring other avenues for revenue growth – perhaps gaming and advertising (Disney recently announced an ad-supported version of Disney+). The price elasticity of demand for streamers will eventually become an important topic to follow. The Similarweb Insights Newsroom is available to pull additional or updated data on request for the news media (journalists are invited to write to press@similarweb.com). When citing our data, please reference Similarweb as the source and link back to the most relevant blog post or similarweb.com. Citation: Please refer to Similarweb as a digital intelligence platform. If online, please link back to www.similarweb.com or the most relevant blog post. Methodology Disclaimer:All data, reports and other materials provided or made available by Similarweb are based on data obtained from third parties, including estimations and extrapolations based on such data. Similarweb shall not be responsible for the accuracy of the materials and shall have no liability for any decision by any third party based in whole or in part on the materials. Photo by Nicolas J Leclercq on Unsplash by Anthony T. Occhipinti Senior Analyst Anthony, with a finance background, joined Similarweb in 2022. A Kansas City native and KC Chiefs fan, he enjoys golf, cooking, and family life in New Jersey. Related Topics: Media & Entertainment News This post is subject to Similarweb legal notices and disclaimers. Related Posts Insights The Democratic National Convention in Search and News Traffic Media & Entertainment News by David F. Carr 5 Min. Aug 26, 2024 Insights Where the Olympics News Drove the Most News Traffic Media & Entertainment News by David F. Carr 4 Min. Aug 14, 2024 Insights Similarweb Traffic League: Who Was the Most Popular Football Club in April 2024? Media & Entertainment News by Itay Gross 4 Min. May 28, 2024 Insights NCAA’s Women’s Basketball Stars Eclipsing Men’s Ahead of March Madness Media & Entertainment News by Molly Winik 3 Min. Mar 18, 2024 Insights A Super Bowl with a Difference: Swifties Flock to This Year’s Event Betting News Media & Entertainment News by Daniel Reid 5 Min. Feb 6, 2024 Insights Parentz Talk Tops Digital 100 Ranking of Fastest Growing News & Media Sites Media & Entertainment News by Inès Durand 4 Min. Jan 10, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Streaming Wars: Netflix Remains King, But Disney Continues to See Strong Growth"
    },
    {
      "level": "H2",
      "text": "Key takeaways"
    },
    {
      "level": "H2",
      "text": "Netflix"
    },
    {
      "level": "H2",
      "text": "Disney+"
    },
    {
      "level": "H2",
      "text": "Hulu"
    },
    {
      "level": "H2",
      "text": "HBO Max"
    },
    {
      "level": "H2",
      "text": "Amazon Prime"
    },
    {
      "level": "H2",
      "text": "Everyone Else"
    },
    {
      "level": "H3",
      "text": "The Democratic National Convention in Search and News Traffic"
    },
    {
      "level": "H3",
      "text": "Where the Olympics News Drove the Most News Traffic"
    },
    {
      "level": "H3",
      "text": "Similarweb Traffic League: Who Was the Most Popular Football Club in April 2024?"
    },
    {
      "level": "H3",
      "text": "NCAA’s Women’s Basketball Stars Eclipsing Men’s Ahead of March Madness"
    },
    {
      "level": "H3",
      "text": "A Super Bowl with a Difference: Swifties Flock to This Year’s Event"
    },
    {
      "level": "H3",
      "text": "Parentz Talk Tops Digital 100 Ranking of Fastest Growing News & Media Sites"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Anthony T. Occhipinti"
}