{
  "url": "https://ahrefs.com/blog/180-marketing/",
  "slug": "180-marketing",
  "title": "Ahrefs Customer Story: 180 Marketing",
  "description": "See how 180 Marketing slashed their SEO tools cost by 70%, replacing multiple subscriptions with just Ahrefs.",
  "content": "Constance Tan Constance is devoted to improving the value users get out of Ahrefs. She enjoys trying new things, and learning about the many ways software eats the world.Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Ahrefs played a pivotal role in the success of an SEO campaign for an ecommerce customer. 180 Marketing started working with them in July of 2023 and still work with them today. The main KPIs focused on were organic search traffic and revenue, which increased around +350% in just 8 months.Ahrefs is simply the best all-in-one SEO tool on the market. It’s impossible to be a top tier SEO without Ahrefs. And at the rate they’re releasing new powerful features, there’s no way anyone else can catch up.Jeff Oxford, CEO 180 MarketingAbout 180 Marketing180 Marketing is an eCommerce SEO company based in Oregon, working exclusively with eCommerce businesses.Problem: Paying for separate tools add up fastIn early 2015, 180 Marketing used separate tools for keyword research, backlink analysis and content research/ideation. They were looking to rely on a single SEO tool for both quality backlinks and rankings data.We found that two providers from our existing SEO tool stack were inadequate in either area. Moz had a great backlink index, but lacked ranking data. On the other hand, Semrush had ranking data, but less reliable backlink data.Jeff Oxford, CEO 180 MarketingSolution: Switch to Ahrefs for better tools coverage and lower costsOnce they discovered Ahrefs, 180 marketing saw the opportunity to consolidate their tool stack, save costs, and rely on accurate backlink and rankings data. This was thanks in part to Ahrefs’ backlink index getting updated every 15 minutes and covering over 190 geo-locations for rankings. After moving to Ahrefs, they managed to cut their SEO tool costs by around 70%.1. Onboarding was smooth and hassle-freeIt was super easy to get started with Ahrefs. The UI/UX was very straightforward and we were able to pick it up and run with it without having to read any documentation or watch any videos. Also, the Ahrefs support team has always been very responsive and helpful in answering any of our many nuanced questions.Jeff Oxford, CEO 180 Marketing2. Complete SEO coverage that keeps getting betterJeff recalls that the continued addition of more and more features throughout the years further solidified their decision to switch:Keywords Explorer quickly became the center of their keyword research process. They no longer had to rely only on free keyword data from Google AdWords Keyword Planner, or spend on separate keyword research tools.Site Audit helped them find technical issues such as 404 pages with backlinks, important images missing alt text, and structured data not set up correctly.Content Explorer gave a plethora of content ideas and link prospects, removing the need to pay for standalone tools like BuzzSumo.Web Explorer provided another effective way to quickly find highly qualified link prospects. 180 Marketing eventually ended up rewriting their Link Prospecting SOPs to incorporate this powerful tool.SERP comparison feature helped them easily understand changes in search intent for keywords over time, as well as winners/losers after Google updates over time.Page Inspect made it very easy to identify what changes their clients were making to important pages, and in some cases without even informing them.Upgrade your SEO Stack with AhrefsSign up for an Ahrefs account and get started with the tools that helped 180 Marketing streamline their costs and enhance their SEO capabilitiesKeywords ExplorerSite AuditSite ExplorerContent ExplorerWeb ExplorerSERP ComparisonAhrefs API Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Constance Tan Constance is devoted to improving the value users get out of Ahrefs. She enjoys trying new things, and learning about the many ways software eats the world.",
  "headers": [
    {
      "level": "H1",
      "text": "180 Marketing Upgrades Their SEO Tools Stack and Slashes Cost by 70%"
    },
    {
      "level": "H2",
      "text": "Problem: Paying for separate tools add up fast"
    },
    {
      "level": "H2",
      "text": "Solution: Switch to Ahrefs for better tools coverage and lower costs"
    },
    {
      "level": "H3",
      "text": "1. Onboarding was smooth and hassle-free"
    },
    {
      "level": "H3",
      "text": "2. Complete SEO coverage that keeps getting better"
    },
    {
      "level": "H2",
      "text": "Upgrade your SEO Stack with Ahrefs"
    }
  ],
  "author": "Constance Tan"
}