{
  "url": "https://ahrefs.com/blog/advanced-keyword-research/",
  "slug": "advanced-keyword-research",
  "title": "Advanced Keyword Research: 5 Tips for Finding Untapped Keywords",
  "description": "Build search traffic and rankings by targeting the keywords your competitors haven’t found yet with these five tips.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Most people start keyword research by entering a few broad seed keywords into a popular keyword tool, then checking keyword ideas.There’s nothing wrong with this process because it makes sense to tackle popular keywords. But it does leave some of the less obvious keywords on the table.In this guide, you’ll learn five advanced keyword research tips for finding untapped keywords.Contents1. Find newly published pages with trafficIf you want to find keywords that you can potentially rank for quickly, look for newly published pages that already get traffic from Google. You can do this in Ahrefs’ Content Explorer. Enter a broad topicSwitch the search mode to “In title”Filter for pages published once within the last 90 daysFilter for pages with an estimated 500+ monthly search visitsFilter for pages on sites with a DR less than or equal yoursExclude results from homepages and subdomainsFor example, let’s say we’re in the fitness niche. If we search for “protein” and filter the results, we end up with 10 pages, including this one about the top 20 highest protein nuts and seeds.If we hit the “Details” caret and check the page’s traffic, we see it started attracting organic traffic just a few days after publishing. Since then, it’s been consistently getting around 1.1K monthly search visits.If we switch to the “Organic keywords” tab, we see that it’s getting most of this traffic from keyword rankings in the U.S.Most of these keywords also have reasonably low Keyword Difficulty (KD) scores.Given that this site has no more authority than our hypothetical fitness website (because we filtered by DR), chances are we can also rank for this keyword fairly quickly. Here’s another page that ranked quickly: This time, it’s about blueberry Kodiak cake muffins. If we hit the “Details” caret again, we see that it was attracting an estimated 963 monthly search visits just two months after publishing. And it’s getting even more traffic now.This time, it gets most of its search traffic from the keyword “kodiak cake muffins,” which has a KD score of just 12. This could be another good keyword to target for some quick organic traffic. Keep in mind that this method can unearth pages with short traffic spikes. This can happen when a page jumps in and out of the top 10 for a high-volume keyword or ranks in the “Top Stories” SERP feature. You should always further investigate where a page gets its traffic from before committing to creating content. You can do this in Ahrefs’ Site Explorer.2. Find competitors’ low-competition topicsIf your competitors are getting search traffic from Google, they’ve probably already done keyword research. This means you can piggyback off their hard work by reverse engineering the low-competition topics they rank for.Here’s how to do that: Enter a competitor’s domain into Site ExplorerGo to the Top pages reportFilter for traffic from low-difficulty keywords, say under KD 20Filter for pages with 500+ estimated monthly search visitsYou’ll now see pages with at least 500 monthly visits from keywords with low KD scores.The traffic column shows the page’s estimated traffic from keywords with low KD scores.If you see a topic you may want to target, hit the caret next to the URL and compare the URL’s total estimated traffic with the amount of traffic it gets from low-KD terms (the number in the traffic column). If these two numbers are relatively close, it’s a low-competition topic. If the numbers are vastly different, as is the case for our free backlink checker, it isn’t. The page just gets some long-tail traffic from low-competition terms.3. Find and expand on unique keyword ideasKeyword modifiers are add-ons to base keywords. Common examples include “best,” “near me,” and the current year.For this use case, we’re looking for modifiers that do two things:Make sense combined with popular keywords in our nicheAlter the search results For example, if we search for “best credit cards” and “best credit cards 2022” (“2022” is the modifier), the search results are nearly identical. This is because both searchers want up-to-date recommendations. In fact, the top result for both queries is the same.But if we search for “best credit cards” and “best credit cards for bad credit” (“for bad credit” is the modifier), the results are completely different. This is what we want.The best place to look for relevant modifiers is a competitor’s Top pages report in Site Explorer.For example, if we do this for ketoasap.com, we see keywords like “low carb mcdonalds” and “low carb at red robin.” Given that people are likely also searching for low-carb options at other fast-food restaurants, we can infer a base keyword and a modifier here: Base keyword: “low carb”Modifier: the fast-food restaurant itself Knowing this, we can use Ahrefs’ Keywords Explorer to find more similar keywords. All we need to do is enter our base keyword, go to the Matching terms report, then add other popular modifiers to the “Include” filter (using the “Any word” option). If we hit “Apply,” we end up with dozens of low-competition topics to create content about. 4. Identify uncommon seedsMost people do keyword research the same way. They enter a few common broad keywords into a keyword research tool, then sift through the list of ideas for keywords to target.There’s nothing wrong with this process, but the reality is your competitors are probably doing the same thing with the same seed keywords. This leads to everyone targeting the same keywords and fierce competition.One solution to this problem is to use less competitive seed keywords to unearth keyword ideas competitors haven’t considered.Here’s a simple way to find uncommon seeds:Enter a popular niche website into Site ExplorerGo to the Organic keywords reportExclude common seedsLook for words and phrases that would make good seed keywordsFor example, let’s say we’re in the fitness niche. If we check the Organic keywords report for bodybuilding.com, we see lots of keywords that contain common seeds like “workouts.”If we use the “Exclude” filter to exclude keywords containing common seeds, we can then sift through the report for less common keywords that make good seeds. Here are a few that stand out from this report:tdeerussian twistbcaasIf we use these as seed keywords in Keywords Explorer, go to the Matching terms report, and filter for low-KD keywords, we see plenty of ideas with decent search volumes that competitors probably haven’t considered.Notice that many of these have low KD scores too. This further indicates that there’s less serious competition for these keywords.5. Find affiliate keywords at scaleListicles of the “best” products are affiliate site owners’ bread and butter. But these aren’t the only lucrative affiliate keywords. You can also target “product comparison” and “review” keywords. Examples of these may be “airpods pro vs airpods max” or “airpods pro review.” These keywords are great because the people searching for them are close to buying. They’ve already done their research and narrowed their choices down. And because you’ll likely be their last touchpoint before they pull the trigger, you’ll get the affiliate commission. Here’s a simple way to find these keywords at scale:Enter a few popular brands in your niche into Keywords ExplorerGo to the Matching terms reportSelect the “Include” filter, click “Any word,” then type “review” and “vs”For example, let’s say we’re in the fitness niche. If we enter popular protein powder brands into Keywords Explorer and filter for “vs” and “review” keywords, we can see what products people want to see reviews and comparisons for. Because search intent for these keywords is clear, they’re pretty much all great candidates for an affiliate website.RecommendationIf you don’t know many brands in your niche, check the brands listed on a popular e-commerce site in your niche. For example, if we go to the “protein” category on bodybuilding.com’s store and hit the “brands” filter, we see a list of popular brands of protein powder.Final thoughtsKeywords that your competitors haven’t found yet are usually lower competition. Being one of the first to target them is often a much easier way to build search traffic than targeting the same competitive terms as everyone else. Got questions? Ping me on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Keep Learning 6 Keyword Research Tips to Find Untapped Opportunities Keyword research is a crucial factor in the success of most websites. But the conventional process can leave a lot of keywords on the table. 4 Ways to Find Untapped Keyword Ideas With Great Traffic Potential How to Use Google Trends for Keyword Research: 7 Effective Ways Google Trends is often underestimated when it comes to keyword research. Learn some helpful overlooked features of this tool. How to Do YouTube Keyword Research in 3 Easy Steps Learn the keyword approach that helped us grow our channel from 10,000 to over 200,000 monthly views in around a year. How to Do Keyword Research for Affiliate Sites Keyword research for affiliate sites is about finding high-volume keywords, where you can naturally plug product recommendations.",
  "headers": [
    {
      "level": "H1",
      "text": "Advanced Keyword Research: 5 Tips for Finding Untapped Keywords"
    },
    {
      "level": "H2",
      "text": "1. Find newly published pages with traffic"
    },
    {
      "level": "H2",
      "text": "2. Find competitors’ low-competition topics"
    },
    {
      "level": "H2",
      "text": "3. Find and expand on unique keyword ideas"
    },
    {
      "level": "H2",
      "text": "4. Identify uncommon seeds"
    },
    {
      "level": "H2",
      "text": "5. Find affiliate keywords at scale"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Joshua Hardwick"
}