{
  "url": "https://ahrefs.com/blog/advertise-your-business/",
  "slug": "advertise-your-business",
  "title": "How to Advertise Your Business: 5 Proven Low-Cost Strategies",
  "description": "Want to promote your business but don't have much to spare? Fret not, these five budget-friendly strategies are just what you need.",
  "content": "Bill Widmer 8+ years as a digital nomad, Bill is on a mission to travel the world and fund it using SEO and content marketing. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents So you want to promote your business?I could give you some generic advice like “make a website” and “post on social media.” But you probably already thought of that—and likely haven’t had any luck with it yet. Instead, let me share some of the proven, low-cost promotion strategies I’ve learned in my 10+ years as an entrepreneur running six-figure companies. Here’s how to advertise your business.Contents1. Do search engine optimizationSearch engine optimization (or SEO) is my preferred way of promoting a business. I’ve done social media, email marketing, paid ads, and even phone calls and door-to-door sales—none of them ever achieved the ROI that SEO has for me. Plus, you can do SEO entirely yourself, and it doesn’t cost anything to do. You just need to learn the tactics, then write content and send outreach emails (more on that in a moment).I’m assuming you already have a website. If not, read our guide to building an SEO-friendly website first. The truth is nearly every business needs a website.Once you’ve got your website, here are three steps to optimize your website for search engines:Step 1. Find a keyword to targetSEO is all about keywords. Keywords are the words or phrases people type into Google in order to get an answer. Until you know what keyword(s) you want to rank for, you won’t know what kind of content you need to create in order to rank.When looking for keywords, the things you should pay attention to are a mix of:Traffic potential – The sum of the organic traffic you can get. Business potential – Can your business potentially make money if you rank highly for a given keyword?Ranking difficulty – How difficult it might be to rank higher than the competition for a given keyword.Search intent – What is the person actually looking for when they search for a given keyword?There are a lot of ways to find keywords. But one of the easiest is to come up with a broad “seed” keyword that relates to your niche, then plug it into Ahrefs’ Keywords Explorer.A seed keyword is a generic, top-level keyword that encompasses a niche as a whole.For example, let’s say my business sells coffee-related items. My first seed keyword would be “coffee.” I can plug that into Keywords Explorer, then go to the Matching terms report to see a list of keywords that contain the word “coffee”:This brings up over 3 million keywords—far too many. Let’s add some filters to narrow this list:Set KD (Keyword Difficulty) to a max of 30. This will show us only keywords that are relatively easy to rank for based on things like competitors’ authority and backlinks.Set volume to a minimum of 500. This will only show us keywords that get at least 500 monthly searches.This brought our results down to 8,045 keywords. That’s still a lot, but things are much more manageable now. You can set stricter filters to narrow this down further if you want.Scrolling through, I quickly found the keyword “coffee table with storage,” which gets over 28,000 searches per month and has a KD of just 17—meaning it could be easy for a new business to rank for.Checking the Google SERP (search engine results page) for this keyword, I can see three websites with relatively low Domain Rating (DR) scores of 27, 11, and 4 are ranking highly for this keyword—despite not having any external backlinks pointing to them.In other words, newer websites can compete for this keyword, it has a very high traffic and business potential, and the search intent is for direct product sales pages where the searcher can buy the product. It’s a great potential keyword.I covered a lot here, but if you want more information on how to find keyword ideas, check out some of our other guides:How to Do Keyword Research for SEOWhat Are Keywords? How to Use Them for SEO8 Most Important Types of Keywords for SEODon’t have an Ahrefs subscription? Try our free keyword generator instead.Step 2. Create optimized contentOnce you have an idea of which keyword you want to rank for, it’s time to create search-optimized content for that keyword.The first thing you have to understand before you create any content is what the search intent is for your chosen keyword.Search intent encompasses three Cs:Content typeContent formatContent angleThe “type” of content could be a blog post, video, product page, etc. The format could be a how-to guide, a list post, a review, etc. The content angle refers to the unique selling point of the top-ranking posts and pages—things like whether it includes the year in the title or talks about a certain subtopic over anything else.There’s a lot that goes into understanding search intent, so check out our full guide to search intent to learn more.In the last example, the search intent is a product page. However, if I choose the keyword “best mushroom coffee” instead, the search intent changes to a best-of list post:Note that getting search intent right is only the first step. Once you start creating the content, you also need to follow some on-page SEO best practices:Including alt text on your imagesSetting proper meta tagsIncluding relevant internal linksEtcFollow the checklist in our complete guide to on-page SEO to make this step easier.Step 3. Build linksYou need internal links (links from one page on your site to another page on your site) and backlinks (links from someone else’s website pointing to your website).Add internal links contextually when creating content. They help Google (and users) find your pages and boost their authority. External backlinks, on the other hand, can be difficult to come by. But they are one of the most important Google ranking factors. Without them, you will have a hard time ranking highly.There are four basic ways to build backlinks:Adding links to other websites – Examples include doing so on your social media profiles and in business listing directories. This is the easiest method but will likely have the least impact on your rankings.Asking for links via outreach – This is probably where most of your links will come from in the beginning until you’re more well known. There are many tactics to build links this way, for example, broken link building, guest blogging, or resource page link building. Buying links – We don’t recommend this method, as Google considers this link spam. You may also lose your rankings if it catches you doing it.Earning links passively – This is the best way to build links because it happens on auto-pilot once you have great content that blog owners and news websites find and want to link to without even knowing you.There’s a lot that goes into link building, so read our full guide to link building to learn more.2. Create (or improve) your Google Business pageIf you have a physical business, a Google Business Profile (GBP) will help you show up on Google searches and in Google Maps—which is how most people find local businesses these days.It’s one of the best free ways to promote your business that actually works. GBPs show up like this:Here’s how to set one up (and optimize it for higher rankings and improved conversions):Create (or claim) your Google Business accountFill in your information: business name, address, phone number, email, hours of operation, etcMake sure to add any relevant photos of your business or your products or servicesAfter you set up your profile, reach out to customers about giving you reviews. Reviews are extremely important to rank at the top of the search results. Without good reviews, your competition will outrank you.Read our guide to optimizing your Google Business Profile for more info.3. Post on social mediaBut wait, I thought you weren’t going to give me this generic advice?Well, posting on social media is actually a great way to advertise your small business. However, posting randomly without a strategy won’t do anything but waste your time.Here’s how to effectively advertise your business on social media:Step 1. Choose the right social platformDon’t try to do it all. While you can and should create a profile on the big social media platforms so you don’t lose your handle, it’s not necessary to use them all right off the bat.Instead, see where your competitors are getting most of their traffic from and start with those platforms. You can find that information using Similarweb.Back to my “coffee” example—let’s look at Death Wish Coffee to see where it’s succeeding on social:In this case, it gets the majority of its traffic from Instagram. I wouldn’t choose Instagram from just one example. But if several of your competitors are all succeeding on the same platform, that’s a good sign it’s a good platform to use.Step 2. Create a content strategyNow you need to make a game plan. What kind of content will you create? How frequently will you post? Who will make and post the content? What hashtags should you use?These are all questions you need to answer. A little brainstorming goes a long way. Look at your competitors’ social media to see what’s doing well for them and to give you ideas.Here are some guides to help you with this step:Buffer’s Instagram Marketing for Small Business GuideBuffer’s Facebook Marketing for Small Business GuideHubSpot’s Ultimate Guide to Pinterest MarketingAhrefs’ Twitter Marketing StrategyWe also have some free AI writing tools to help you with things like generating Instagram hashtags and writing your social media bio.Step 3. Automate your postingRemembering to post every day can quickly get exhausting. Instead, it’s best to set aside time every week to schedule all your posts for that week or even for the whole month.You can use automation tools like Buffer or Hootsuite to schedule and automate your posting.Step 4. Interact with your followersWhile it can be tempting to just “set it and forget it,” the most value from social media will come from interacting with your followers. If you’re lucky enough to get people to comment on your posts, it’s worthwhile to take the time to respond.You can even respond to comments right from your automation tool if you choose Buffer or Hootsuite. Again, this can be a weekly task—although people will appreciate faster response times. Step 5. Track results and tweak over timeOne of the reasons most businesses fail with social media is that they aren’t setting goals or tracking progress. How can you know if something is doing well if you aren’t tracking it?Buffer and Hootsuite offer analytics to see how well your posts are doing, along with valuable information like which posts are performing the best and which times of day are best for posting. Use this information to tweak your strategy and post more of what’s working.4. Run paid adsPay-per-click (PPC) ads can be highly effective. I even have a friend who acquired over 800 new customers for a measly ad spend of $24.68.Here’s how he did it:Step 1. Build a landing page worth readingPeople often send ad clicks straight to a product page or their homepage. While this can work, a dedicated landing page is often more effective.For example, Mike created this page, which was worth reading and had a catchy title:By offering something of value, you increase the chances of conversion.Step 2. Make an offerAt the end of Mike’s article, he added a lead opt-in to get readers to join his mailing list:This could just as easily be a product offering instead of an email opt-in, but it doesn’t have to be. Email leads can be valuable too.Step 3. Build your adMike kept this part super simple and eye-catching:The yellow color makes it stand out, and the title makes it more clickable. Check out our guide to online advertising for more help with this.5. Be a guestMaking a guest appearance on other people’s blogs, podcasts, or YouTube channels is a great way to get free advertising for your own business.In fact, when I first started my SEO business, I got three of my biggest clients because they either read one of my guest posts or heard me as a guest on the EOfire podcast—neither of which cost me a penny. It was free advertising at its finest.We have a full guide to guest blogging you can check out to learn more, but the process is simple:Step 1. Identify potential places to be a guestFind blogs, podcasts, or YouTube channels that are complementary (not each other’s competition). For my SEO business, I wrote guest posts on marketing blogs like Hootsuite, Social Media Examiner, and Conversion Science. These blogs all discuss marketing but don’t offer SEO, so working together is a win-win.For this step, just head to Google and look up keywords related to your niche. If you sell coffee, for example, search “coffee,” “how to make coffee,” etc., and look at any blogs that write about coffee but don’t sell it.Use search operators to make your life easier. You can find blogs actively looking for guest writers by adding things like “write for us” (including the quotes). You can also add “podcast” to your search to find podcasts and move your search to YouTube for YouTube opportunities.Pro TipWriting guest posts and being a guest on a podcast are also great ways to build backlinks for SEO. If you get Ahrefs’ SEO Toolbar, you can see stats like DR at a glance and prioritize reaching out to sites with higher DR scores.Step 2. Reach out and askOnce you’ve found a few potential targets, head to their contact page and send them a message. You can send something like this (but it’s always good to write your own):Hey {their name},My name is {your name}. I’m reaching out because I just {read their blog post/listened to their podcast/watched their YouTube channel} and loved it!{Write something specific on what you enjoyed about their content.}I’m also into {subject}, and I was wondering if you’d be open to me {writing a guest post/being a guest on their podcast, YouTube channel, etc.}.I’d love to talk about {topic} because {why you care about that topic}. I promise to deliver something really valuable if you let me.Would {date} at {time} or {other date} at {other time} be better for you to discuss?Thanks,{Your name}If you can’t find a way to contact them on their website, you can also try looking on their Facebook page for an email. The more personal and interesting your proposal sounds, the better your shot at succeeding.Final thoughtsNow you know the five proven step-by-step methods to advertise your small business on a budget. I’ve personally had success with every one of these strategies, but they do take time and have a bit of a learning curve if you’re new to them.My advice is to pick one or two and try them for at least a few months. None of these will give you overnight success (except maybe paid advertising if you’re really good at it). But with a little time and dedication, you’ll see the money coming in before you know it.Questions? Comments? Ping me on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Keep Learning 14 Cheap & Effective Small-Business Marketing Strategies Start by making sure you're not dealing with the leaky bucket effect—and then check out more marketing strategies great for small businesses. 13 Effective (And Low-Cost) Ways to Promote a Product Promoting your product doesn't have to be expensive. Here's how to get the job done without spending a ton of money. How to Use & Reduce Customer Acquisition Cost (CAC) Customer acquisition cost (CAC) is the average amount of money you spend to acquire a single customer. The Creative Marketing Strategies That Launched These 3 Major Tech Startups Need marketing inspiration? Here are the creative marketing strategies that successfully launched these 3 major tech startups. 7 Digital Marketing Strategies That Actually Work Drive more traffic, leads, and sales to your business with these tried and tested digital marketing strategies that any business owner can use.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Advertise Your Business: 5 Proven Low-Cost Strategies"
    },
    {
      "level": "H2",
      "text": "1. Do search engine optimization"
    },
    {
      "level": "H3",
      "text": "Step 1. Find a keyword to target"
    },
    {
      "level": "H3",
      "text": "Step 2. Create optimized content"
    },
    {
      "level": "H3",
      "text": "Step 3. Build links"
    },
    {
      "level": "H2",
      "text": "2. Create (or improve) your Google Business page"
    },
    {
      "level": "H2",
      "text": "3. Post on social media"
    },
    {
      "level": "H3",
      "text": "Step 1. Choose the right social platform"
    },
    {
      "level": "H3",
      "text": "Step 2. Create a content strategy"
    },
    {
      "level": "H3",
      "text": "Step 3. Automate your posting"
    },
    {
      "level": "H3",
      "text": "Step 4. Interact with your followers"
    },
    {
      "level": "H3",
      "text": "Step 5. Track results and tweak over time"
    },
    {
      "level": "H2",
      "text": "4. Run paid ads"
    },
    {
      "level": "H3",
      "text": "Step 1. Build a landing page worth reading"
    },
    {
      "level": "H3",
      "text": "Step 2. Make an offer"
    },
    {
      "level": "H3",
      "text": "Step 3. Build your ad"
    },
    {
      "level": "H2",
      "text": "5. Be a guest"
    },
    {
      "level": "H3",
      "text": "Step 1. Identify potential places to be a guest"
    },
    {
      "level": "H3",
      "text": "Step 2. Reach out and ask"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Bill Widmer"
}