{
  "url": "https://ahrefs.com/blog/affiliate-marketing/",
  "slug": "affiliate-marketing",
  "title": "Affiliate Marketing For Beginners: What It Is + How to Succeed",
  "description": "Affiliate marketing is where you promote other companies' products to earn a commission. Learn how to get started in 7 simple steps.",
  "content": "Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents 16 min readSummarize for a quick grasp. Summarize Summary Affiliate marketing is where you promote another company’s product or service. When someone purchases through your affiliate link, you earn a commission. This is usually a percentage of the sale price or a fixed amount. Here's how to get started with affiliate marketing:Choose a niche. Think about what you're good at and link doing.Decide on a content platform. This is where you'll promote your affiliate links. Blogs, YouTube, and social media are common choices.Find affiliate programs to join. Use Google or affiliate networks like ShareASale.Create great content. Reviews, top 10 lists, whatever makes sense.Drive traffic to your affiliate links. SEO is a popular choice.Get clicks on your affiliate links. Place your links prominently in your content and use design cues to attract more attention. Tools that can help with affiliate marketing include Ahrefs, Rank Math, Google Search Console, Google Analytics, and Thirsty Affiliates.This summary is not a substitute for reading the article in full, as you may miss out on important nuances.Imagine all you needed to make money online was a website. You don’t have to create your own products or offer a service. Sounds good? Welcome to affiliate marketing.According to Statista, business spending on affiliate marketing hit $8.2 billion in the U.S in 2022 and Influencer Marketing Hub estimates that the industry will continue to grow to $15.7 billion by 2024.Start today, and you’ll be in a prime position to take advantage of that.https://www.youtube.com/watch?v=CF3Uk2jc_igWhat is affiliate marketing?Affiliate marketing is where you promote another company’s product or service. When someone purchases through your affiliate link, you earn a commission. These commissions are usually a percentage of the sale price or a fixed amount.For example, here’s a link to a book on Amazon:If you clicked and bought this product ($33.25 for the hardcover version), I’d earn $1.50 if I was the affiliate.Is affiliate marketing legit?Affiliate marketing is not a scam. It is absolutely legit.It is legal, as long as you comply with relevant laws and regulations in your country.It is ethical, as long as you disclose your relationship as an affiliate and only promote products you believe in.Learn more: Yes. Affiliate Marketing Is Legit. But Is It Worth Your Time?Why should you do affiliate marketing?Here are four reasons why you should consider affiliate marketing:1. Low-cost and low-riskStarting a business can be risky and expensive because there are upfront investments for products, employees, equipment, rent, and so on. With affiliate marketing, all you need is a website. If it doesn’t work out, you’ve only spent time and a little bit of money.2. Passive income potentialIf you have a job, you need to work hours in return for income. If you’re doing affiliate marketing, you can earn an income as long as there’s traffic to your website and they’re buying via your affiliate links. This can happen at any time of the day, even when you’re sleeping.3. Work from home or anywhere in the worldEarning passive income means you can work anytime and anywhere, as long as you have Internet and can access your affiliate website.4. Easy to scaleA typical salesperson only sells products from one company. As an affiliate marketer, you can promote products from many different companies and earn commissions from all of them.Learn more: How to Start Affiliate Marketing With No Money (5 Steps) How does affiliate marketing work?Upon joining an affiliate program, you receive a unique link containing a tracking ID. This allows the merchant to track whether you’ve referred customers to them.People who click on your link get a tiny file called a cookie stored on their device. This usually holds an expiry date, so you get paid even if they delay buying for a while. For example, here’s how it works if you’re an Amazon affiliate:Someone visits your post on the best winter jackets.They click the Amazon affiliate link for one of your recommendations.They close their browser to pick their kid up from school.They go back to Amazon the next day to check out the product again.They buy the recommended product, along with some ski gear.Thanks to the affiliate cookie stored on this person’s device, you earn a commission on the recommended product and the ski gear.How much money do affiliate marketers make?According to Authority Hacker’s affiliate marketing survey, the average affiliate marketer earns $8,038 per month.However, the average monthly income for an affiliate marketer with less than one year of experience is only $636.So, don’t expect to be successful right away. Affiliate marketing takes time. If you’re just starting out, your checks might look more like this for a while:You need to manage your expectations. You won’t earn the big bucks right off the bat, but don’t let this discourage you.The success of others tells you that with hard work, time, and the right knowledge, you too can potentially reach those levels.Learn more: Here’s How Much You Can Really Make From Affiliate MarketingHow to become an affiliate marketerAn affiliate marketer is simply a person who does affiliate marketing.So, if you follow the section below on how to get started with affiliate marketing and actually put in the work to make an affiliate website, drive traffic, and convert visitors, you will become an affiliate marketer.Learn more: How to Become an Affiliate Marketer (5 Steps)How to get started with affiliate marketingFollow these seven simple steps:Learn more: Affiliate Marketing Course for BeginnersStep 1: Choose your nicheYour niche is the category you want to talk about and promote.To stand out amongst the countless other websites today, my advice is to be specific. Instead of tackling a broad niche like food, go for something a bit narrower, like grilling. This helps you build a more focused audience and may also help with SEO.Here are four questions to ask yourself to find a good niche:What am I good at?What do I like doing?What am I curious about?What do other people tell me I’m good at?It’s hard to overstate the importance of choosing something you’re passionate about. You’ll need to create a lot of content to succeed with affiliate marketing. If you choose something you hate, you’ll find it hard to press on when the going gets tough.That’s why, when I built my first site, I chose to talk about one of my hobbies—breakdancing. And despite knowing nothing about marketing, I grew it to an estimated 2K monthly visits.Learn more: 3 Ways to Find a Great Affiliate Niche (With Examples)Step 2: Decide on a content platformYou can do affiliate marketing on any platform. This includes:WebsiteYouTubeSocial media (e.g., Instagram, TikTok)NewsletterPodcastThe method you choose will depend on your preference and occasionally, your niche’s preference. For example, people who are learning breakdance will prefer videos. So, even if you prefer writing, running a YouTube channel may be a better option.That being said, we recommend building a website and using search engine optimization (SEO) to rank your content high on Google. This allows us to generate passive search traffic consistently, which means consistent clicks on affiliate links too.TIPWhether you’re creating a website, YouTube, or something else, note that you’ll need to disclose the fact that you’re including affiliate links. The Federal Trade Commission (FTC) requires you to be transparent when receiving income from an endorsement.If you’re building a website, create a standalone page or include it in the footer of your website:If you’re doing it on YouTube, include it in your description:Step 3: Find affiliate programs to joinThere are three main types of affiliate programs to choose from:High-paying, low-volume — Niche products with fewer buyers. For example, HubSpot sells only to businesses but their affiliate program pays well (100% of first month and 15% monthly recurring commission.)Low-paying, high-volume — Products with mass appeal, e.g. PS5 games. For example, Amazon only pays up to 10% commission. But the good thing is they offer commissions off the entire value of the purchase (and not just the product you recommended.)High-paying, high-volume — Expensive products with mass appeal, e.g. credit cards. An issue is that these programs tend to attract affiliate marketers with deep expertise and pockets and willingness to black-hat tactics.Which affiliate program should you join? This depends on your niche and level of expertise.If you’re targeting consumers, go with the second model: low-paying, high-volume. If you’re targeting businesses, go for the first one: high-paying, low-volume. Popular programs include software and web hosting-related products.The best way to find these affiliate programs is with a Google search. Alternatively, enter a competing affiliate site into Ahrefs’ Site Explorer and go to the Linked domains report.For example, I know that Pat Flynn promotes a number of software products on his website, Smart Passive Income. Eyeballing the report shows that Pat links to Aweber pretty often. And if we expand the caret, we’ll see that Pat is an affiliate.It only takes a quick Google search to find an application form for this program.If there is a product you’d like to promote but they don’t have a public affiliate program, reach out to the company and ask if they would be willing to build an affiliate relationship with you.Learn more: 9 Best Affiliate Programs for Beginners (Any Niche) Step 4: Create great contentIf you want your affiliate site to succeed, you need to create high-quality content where your affiliate links fit naturally. Don’t just blindly curate products from Amazon’s best sellers. Go the extra mile and make sure your content solves your readers’ problems.For example, if you’re doing reviews, you should actually purchase the product and test it. Use it over a period of time and report your findings.That’s what Wirecutter did for all their articles, which explains their success. For example, in order to find the best air purifiers, they tested more than 50 of them:If you can collaborate with experts to review your findings, that’s even better. Again, Wirecutter goes above and beyond in this aspect, solidifying their status as the gold standard of affiliate websites:Step 5: Drive traffic to your affiliate siteYou’ve created great content. The next step is to get more people to read it, so they will click on your affiliate links.Here are three traffic strategies to consider:A. Paid trafficThis is where you pay for traffic to your site. You can do this using pay-per-click (PPC) ads.The advantage of paid traffic is that the moment you start paying, you get traffic.However, there are some downsides.First, running ads will dig into your profits. It’s quite normal for advertisers to lose money before they make it… if they ever do.You need to be realistic about how long it takes to optimize a paid traffic campaign.Secondly, once you stop paying for ads, your traffic will stop.Generally speaking, ads are a great traffic strategy if you’re part of a high-paying affiliate program and can make the numbers work.But if you’re completely new to paid marketing and have no marketing budget (or are working with lower commission programs like Amazon Associates), then it might not be such a great idea.Learn more: PPC Marketing: Beginner’s Guide to Pay-Per-Click Ads B. SEOSEO is the practice of optimizing pages to rank high in search engines like Google.For as long as you can rank high in the search engines for your target keywords, you’ll get consistent and passive traffic.On the most basic level, SEO is about:Understanding what your target customers are searching forCreating content around those topicsMaking sure Google understands clearly what your page is aboutAcquiring or earning links to push your pages higher in the search enginesEnsuring Google can find, crawl, and index your contentLearn the basics in this video or read our beginner’s guide to SEO:https://www.youtube.com/watch?v=DvwS7cV9GmQC. Build an email listEmail lists allow you to communicate with your readers anytime.Use them to tell fans about new content and keep them coming back to your site for more. This leads to more affiliate clicks and sales.You can even add affiliate links in the emails to your audience:To build an email list, you need to persuade the readers on your site to sign up. That means offering something valuable, like a free eBook, an email course, and more.Step 6: Get clicks on your affiliate linksJust because you have an amazing piece of content doesn’t mean people will click on your affiliate links.There are a few things you need to consider.A. Link placementIf all your affiliate links are at the bottom of the page where people rarely scroll, clicks will be few and far between.On the other hand, make every other word a link in your introduction, and your content will look spammy.You need to balance link placement with the other factors below.B. ContextLet’s say you were writing an article on the best kitchen knives for under $50.Your introduction probably shouldn’t look like this:Today, I’m reviewing the best chef knives.The links look out of context and spammy.This would make more sense:Today, I’m reviewing three different chef knives you can buy on Amazon for under $50. These are, product name 1, product name 2, and product name 3C. CalloutsUsing callouts like buttons, tables, and boxes can help attract your readers’ attention and make the post more skimmable.For example, the Wirecutter uses eye-catching boxes with product links anytime they share a top pick.Good Housekeeping takes a different approach and creates a table with buttons:Step 7: Convert clicks to salesIn affiliate marketing, two conversions need to take place for you to make money.The first conversion is the click to the product page.You’re 100% in control of this action. Use the tactics above to improve your chances of getting that click.The second conversion is the visitor purchasing the product. In the case of affiliate marketing, the merchant controls the checkout, and their conversion rates are out of your control.The trick is to play the game to your advantage and look for merchants with programs that convert well.Here are a few ways to find them:A. Public income reportsIf people are making decent money from an affiliate program, then it’s likely that the product converts well.How do you know if people are making money?Look at public income reports where bloggers publicly reveal how much money they’re making from their affiliate deals.You can find these reports on Google.For example, if you search for “income report amazon affiliate”, you’ll see a few blog posts showing how bloggers have made money from Amazon Affiliates.Looks like one blogger made over $47,000 from Amazon Associates:If you’re in the same space, you can also take a look at where her other affiliate income comes from, and potentially promote the same products.B. Ask questionsIf there isn’t much information available about an affiliate program you want to join, sign up and ask questions.For example, you might want to find out what their average conversion rates are, or a ballpark figure of their top earners’ monthly commissions.This can help you figure out if the affiliate program is worth promoting.C. Use your intuitionSometimes, it’s best to go with your gut feeling.If the program or product you’re checking out feels “off,” or if you would personally never recommend the product to a friend or family member, then don’t promote it.Affiliate marketing examplesHere are examples of websites that monetize via affiliate marketing:Wirecutter — Wirecutter is a well-known product review website. According to Ahrefs, it ranks for 4.5 million keywords on Google and generates around 8.9 million monthly search visits. It was so successful that the New York Times bought it for $30 million in 2016.RTINGS.com — RTINGS (or “ratings”) is another product review site similar to Wirecutter, best known for its straight-to-the-point, in-depth, and data-driven reviews. It ranks for 680,000 keywords on Google and generates around 3.9 million monthly search visits, according to Ahrefs. It started by reviewing televisions, then grew into other gadgets.Money Saving Expert — Money Saving Expert (MSE) is one of the most popular personal finance website in the UK. Visitors trust it for its independent and detailed research on the best tips on how to save money in the UK. According to Ahrefs, it ranks for 906,000 keywords on Google and generates around 5.5 million monthly search visits.Learn more: 7 Affiliate Marketing Examples & Why They Work So WellAffiliate marketing toolsTools are your friends in affiliate marketing. They help you do your job faster and easier.Here are some of our recommended affiliate marketing tools:Ahrefs — All-in-one SEO tool that’ll help you research keywords to target, audit your website, research your competitors, find content ideas, and more.Rank Math — WordPress plugin that ensures your pages have optimal on-page SEO.Google Search Console — Find and fix technical errors on your website, submit sitemaps, see structured data issues, check your Core Web Vitals, and more.Google Analytics — Provides crucial data and analytics for your affiliate website.Thirsty Affiliates — Keep track of your affiliate links, see statistics to know which links are getting the most clicks, and prevent others from easily copying your website and swapping the links with their own affiliate IDs.Learn more: 15 Best Affiliate Marketing Tools & How to Use Them FAQFrequently asked questions about affiliate marketing.What is EPC in affiliate marketing?EPC stands for earnings per click. It refers to the average amount of money you earn each time someone clicks your affiliate links. Here’s how to calculate EPC:EPC = total amount of commissions you earn / number of clicks on your affiliate linksWhat is cookie duration in affiliate marketing?The cookie duration is how long the affiliate program will attribute the purchases to your cookie. The cookie duration is usually set to 30 days. So, that means that if someone clicks on your affiliate link and buys within the 30 days window, you’ll be attributed the sale and therefore get the affiliate commission. If that person clicks on your affiliate link but buys after 30 days, you will not be attributed the sale.How do you start affiliate marketing on Amazon?All the principles above apply to Amazon affiliate marketing. For a in-depth guide on how to build an Amazon affiliate site, I recommend reading this guide.Recommended reading: How to Build a Successful Amazon Affiliate Site (Step by Step)How do I do affiliate marketing without a website?As long as you have a way to drive people to your affiliate links, you can do affiliate marketing without a website. For example, there are many people who drive clicks on their affiliate links via their Instagram, YouTube, Twitter, and more.How do you do high-ticket affiliate marketing?High-ticket affiliate marketing is the promotion of products or services with large payouts. A payout becomes “high ticket” once you get above $100 but can go as high as five figures.Read the guide below to learn how to do high-ticket affiliate marketing.Recommended reading: High-Ticket Affiliate Marketing: How to Make Big CommissionsFinal thoughtsNo affiliate marketing wheels were reinvented here. These are the fundamentals, and applying them will get you off on the right foot.Just don’t expect life-changing income or the freedom to quit your 9-5 overnight. Affiliate marketing takes time.Focus first on making your first affiliate sale. As your site grows, set new goals, and continue experimenting.This is how to build up a site that eventually generates a decent income.Got questions? Ping me on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Keep Learning 9 Best Affiliate Programs for Beginners (Any Niche) Choose from these simple and easy-to-use affiliate programs and networks that you can get up and running in just minutes. How to Start Affiliate Marketing With No Money (5 Steps) Affiliate marketing can make you money while you’re on the beach or even when you're napping. Here's how to start with (almost) no money. 11 Affiliate Marketers Share Proven Tips for 2024 I asked 11 affiliate marketers for their top affiliate marketing tips in 2024. Here's what they shared and how to do them. 15 Best Affiliate Marketing Tools & How to Use Them Affiliate marketing tools help you get more traffic and do your job faster and easier. Here are 15 of the best ones. How to Create an Affiliate Marketing Website That Converts Discover how to create an affiliate marketing website that converts and starts earning you income within a matter of months.",
  "headers": [
    {
      "level": "H1",
      "text": "Affiliate Marketing For Beginners: What It Is + How to Succeed"
    },
    {
      "level": "H2",
      "text": "What is affiliate marketing?"
    },
    {
      "level": "H2",
      "text": "Is affiliate marketing legit?"
    },
    {
      "level": "H2",
      "text": "Why should you do affiliate marketing?"
    },
    {
      "level": "H3",
      "text": "1. Low-cost and low-risk"
    },
    {
      "level": "H3",
      "text": "2. Passive income potential"
    },
    {
      "level": "H3",
      "text": "3. Work from home or anywhere in the world"
    },
    {
      "level": "H3",
      "text": "4. Easy to scale"
    },
    {
      "level": "H2",
      "text": "How does affiliate marketing work?"
    },
    {
      "level": "H2",
      "text": "How much money do affiliate marketers make?"
    },
    {
      "level": "H2",
      "text": "How to become an affiliate marketer"
    },
    {
      "level": "H2",
      "text": "How to get started with affiliate marketing"
    },
    {
      "level": "H3",
      "text": "Step 1: Choose your niche"
    },
    {
      "level": "H3",
      "text": "Step 2: Decide on a content platform"
    },
    {
      "level": "H3",
      "text": "Step 3: Find affiliate programs to join"
    },
    {
      "level": "H3",
      "text": "Step 4: Create great content"
    },
    {
      "level": "H3",
      "text": "Step 5: Drive traffic to your affiliate site"
    },
    {
      "level": "H4",
      "text": "A. Paid traffic"
    },
    {
      "level": "H4",
      "text": "B. SEO"
    },
    {
      "level": "H4",
      "text": "C. Build an email list"
    },
    {
      "level": "H3",
      "text": "Step 6: Get clicks on your affiliate links"
    },
    {
      "level": "H4",
      "text": "A. Link placement"
    },
    {
      "level": "H4",
      "text": "B. Context"
    },
    {
      "level": "H4",
      "text": "C. Callouts"
    },
    {
      "level": "H3",
      "text": "Step 7: Convert clicks to sales"
    },
    {
      "level": "H4",
      "text": "A. Public income reports"
    },
    {
      "level": "H4",
      "text": "B. Ask questions"
    },
    {
      "level": "H4",
      "text": "C. Use your intuition"
    },
    {
      "level": "H2",
      "text": "Affiliate marketing examples"
    },
    {
      "level": "H2",
      "text": "Affiliate marketing tools"
    },
    {
      "level": "H2",
      "text": "FAQ"
    },
    {
      "level": "H3",
      "text": "What is EPC in affiliate marketing?"
    },
    {
      "level": "H3",
      "text": "What is cookie duration in affiliate marketing?"
    },
    {
      "level": "H3",
      "text": "How do you start affiliate marketing on Amazon?"
    },
    {
      "level": "H3",
      "text": "How do I do affiliate marketing without a website?"
    },
    {
      "level": "H3",
      "text": "How do you do high-ticket affiliate marketing?"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Si Quan Ong"
}