{
  "url": "https://ahrefs.com/blog/affiliate-marketing-tips/",
  "slug": "affiliate-marketing-tips",
  "title": "11 Affiliate Marketers Share Proven Tips for 2024",
  "description": "I asked 11 affiliate marketers for their top affiliate marketing tips in 2024. Here's what they shared and how to do them.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents I asked 11 affiliate marketers for their top affiliate marketing tips in 2024.Here are the tips they shared and how to do them.ContentsTrack out-of-stock products and update their affiliate linksKeep a tight inventory of your affiliate links to ensure they’re working, and replace them when products go out of stock. This is like running a real retail store—you wouldn’t let your shelves go empty without noticing.Matt Giovanisci, Founder MoneyLabHow to do itDon’t try to do this manually. Use a WordPress plugin to automate it.I use Lasso (an affiliate plugin I helped develop) and Genius Link to track links.Matt Giovanisci, Founder MoneyLabNeither of these are expensive. Genius Link starts at $6 per month for up to 2,000 affiliate clicks with extra clicks costing just $2.50 per 1,000. Lasso starts from just $8 per month (annual pricing).Recouping this investment is easy if your site gets, well, pretty much any traffic whatsoever.For example, this list of the best dehumidifiers gets an estimated 4,400 monthly search visits according to Ahrefs SEO Toolbar and recommends an out-of-stock product:Since the site owner earns $10-$15 per sale, recovering just one commission would make using the plugin worthwhile.Build trust by recommending the best products, not just the ones with the highest commissionsAlways prioritize products you trust over those with the highest commissions. This builds long-term trust with your audience.Matt Giovanisci, Founder MoneyLabHow to do itI’m afraid I have bad news for those looking to make an easy buck because you need to actually test products for real. There’s no other way to know if they’re worth recommending.Here’s an anecdote from Matt showing just how powerful building this trust can be:When I was shopping for a litter box for my cat, I bought a $400 fancy one. My wife thought it was insane. So I decided to do some research and found Wirecutter recommended a $30 black plastic tub. They gave all the reasons why it was better than a fancy one. And it was the best and cheapest purchase I’ve ever made. I now skip Google and go straight to Wirecutter whenever I want to buy something.Matt Giovanisci, Founder MoneyLabDid you catch that? Matt now bypasses Google and goes straight to Wirecutter because they prioritize practicality and simplicity over commissions—unlike most affiliate sites.Even if a small fraction of their millions of monthly visitors are like Matt, they’ve likely earned thousands in commissions from people who trust them over Google’s top results.Negotiate better rates with affiliate managersEverything is negotiatable in affiliate marketing. However much a vendor is paying, they always have room to increase their rates.Mark Webster, Co-founder Authority HackerMy number 1 tip is to simply ask for more money, wherever you have leverage to do so.Jamie I.F., Founder EndorselyHow to do itPut in the work to build genuine relationships with affiliate managers.My number one tip for affiliate marketers is to pick up the phone and build relationships with the affiliate managers of the brand you promote. Or even better, meet them in real life if you can.Niche Site Lady, Founder NicheSiteLady.comIf this kind of networking sounds like your worst nightmare, try partnering with someone more extroverted who has sales experience.Are you an introvert who would rather die than pick up the phone? Then hire someone with sales skills to help on a revenue share basis. Your business can really snowball when increasing commissions is someone’s main focus.Niche Site Lady, Founder NicheSiteLady.comJamie’s point about leverage is also important. If you can show affiliate managers how much your site is growing or how much traffic you’re sending to their competitors, they’ll be more inclined to want a good relationship with you.For example, I recall Pat Flynn used to consistently recommend Bluehost back in 2013-2016. Given that his site consistently attracted 70K+ monthly search visits back then, I’d imagine the folks at Bluehost were pretty keen to maintain a strong relationship with him.Build product comparison hubs with internal linksAs an affiliate marketer running a portfolio of websites, the most powerful, but often overlooked strategy is internal linking. It’s about connecting your website’s pages in a smart way. Especially for affiliate pages, which are notoriously hard to build links for gaining external relevance and trust.James Oliver, Founder Oliver.comHow to do itJames explains it best:Start with a pillar post. This is your cornerstone content—a comprehensive “Best X” article that covers a broad topic in depth. From there, create smaller, targeted posts. These ‘smaller’ posts, often referred to as “Best X for Y” articles, should strategically link back to your pillar post.James Oliver, Founder Oliver.comFor example, if you’re in the mattress niche, you might have a pillar post targeting “best mattress” surrounded by smaller, targeted posts like “best mattress for back pain” or “best mattress for side sleepers.”If you’re not sure what keywords to target for smaller posts, plug your pillar page keyword into Ahrefs’ Keywords Explorer, go to the Matching terms report, cluster by Parent Topic, then look for ideas.James also notes that you can simply audit your existing content and create comparison hubs retrospectively.Audit your content. Identify your pillar posts and start linking them with relevant “Best X for Y” articles. Align everything with search intent. This simple strategy can set you apart in a competitive market.James Oliver, Founder Oliver.comReverse-engineer affiliate links to find proven content ideas and products to promoteReverse engineering is the best strategy in affiliate marketing. It helps you base your content and tactics on proven success. My favorite (and often overlooked) method is reverse affiliate linking.James Oliver, Founder Oliver.comHow to do itFind a competing website in your niche, plug it into Ahrefs’ Site Explorer, then go to the Outgoing links report. This shows you all the pages the website is linking to.Next, filter for links to shortened domains commonly used by affiliate networks.Here’s a quick list to get you started:Amazon: amzn.toAwin: awin1.com, tidd.lyPepperjam: pjatr.comCommission Factory: cfjump.comShareASale: shrsl.comFlexOffers: clkmg.comSidenote. Make sure to toggle “Any rule” when doing this.Not only will this reveal all the products and stores the site is promoting…… but it will also reveal low-hanging affiliate opportunities.For example, this sustainable living site gets an estimated 2.5K monthly organic visits to a product review. As the page only has links from two referring domains, it should be pretty easy to compete with.James also uses this method to find content ideas to promote specific products. He does this by plugging a specific product’s affiliate link into Ahrefs then seeing who links to it.For example, I recently bought an indoor herb garden from a company with an affiliate program. Their affiliate links have this footprint: clickandgrow.com/?sca_ref=. If I plug this into Site Explorer and go to the Backlinks report, I see over 19K pages promoting this product:If I then filter for pages with few referring domains on relatively low DR sites, I can find some low-hanging fruit affiliate content ideas. For example, this beginner’s guide to apartment gardening lives on a low DR site, has few backlinks, and gets an estimated 146 monthly visits:Don’t rely 100% on SEO; diversify your traffic sourcesIt’s clear that Google currently has a declaration of war against the content website model. This was marked by industry-wide losses in traffic in the September 2023 HCU update resulting in penalties that were never lifted by the content sites that were affected.Matt Diggity, Founder The Affiliate LabHow to do itI’d start by building an email list, and many affiliate marketers I asked agree.Focus on retaining your audience by collecting email addresses and consistently engaging them.Matt Giovanisci, Founder MoneyLabDon’t just think like an affiliate, think about the user and focus on delivering what they need, don’t be scared to grab details, come up with some type of magnet to grab email addresses as this will increase the website value if you wish to sell down the line.Karl Hudson, Founder KarlHudson.co.ukMatt does this effectively on Swim University by offering a free pool care cheat sheet in every post.According to his homepage, this has helped him to build a list of 175K email subscribers—people who he can market offers to anytime he likes.I’ve also seen people having huge success driving traffic from platforms like TikTok and Instagram…For example, Sammie Ellard-King has built a following of over 150K on Instagram for his personal finance brand, Up the Gains. He uses engaging video content to drive followers to his free “money personality” quiz in his bio, which then recommends the best content (some of which promotes affiliate products) for each person.Demonstrate a product’s value before pushing coupons and bonusesI’d say my tip for affiliate marketers is to not burn all your bullets right off the bat but actually make promotion tools feel special.Gael Breton, Co-founder Authority HackerHow to do itIf you’re promoting offers via email, it’s all about tracking and follow-ups:Promote your offer at full price via email, then track those who clicked the link and opened the email and promote the bonus/discount in a follow-up email (allowing me to promote twice, not just once).Gael Breton, Co-founder Authority HackerThis is easy to do in most email marketing software. For example, you can create a simple automation rule in ConvertKit that subscribes a user to an email sequence when they click a specific link:If you’re promoting offers on your site, Gael suggests using exit pop-ups:On a web page, that would be promoting the full price/no bonus version in the main copy of the page and adding the bonus on an exit pop up, maybe with a timer, again to emphasize that this promo is special / limited.Gael Breton, Co-founder Authority HackerYou can even go a step further and add genuine scarcity to your offers with a plugin like Thrive Ultimatum that lets you create individual time-sensitive offers. For example, you could give anyone who clicks your link 24 hours to use the discount or claim the bonus.Rank guest posts to boost commissions and SEORanking your guest posts helps you dominate page one for key terms and boosts your relevance and authority, ticking crucial EEAT signals (and yes EEAT is more than just on-page, from our tests).James Dooley, Founder JamesDooley.comHow to do itA great way to start is by offering to refresh posts with declining search traffic where linking to affiliate content or products would feel natural.For example, if you’re an affiliate for an indoor garden product, it would make perfect sense to update this guide on growing lettuce—especially since its search traffic is declining:Here’s how to find posts that fit the bill:Search for an industry term (e.g., “gardening”) in Content ExplorerFilter out posts from big sites by setting the DR filter to max 70Filter for pages with search traffic (e.g., 100+ monthly visits)Exclude homepages and subdomainsFrom there, look for posts that make sense to refresh where traffic is declining:Note that even if the site owner agrees to an update, they may not be comfortable with you including affiliate links in the post itself. If that happens, link to affiliate content (such as a product review) on your site instead. This should help to boost its rankings and traffic.Drive people to your site with digital PR, then promote affiliate offers to themI can’t believe more people aren’t using digital PR to build powerful links and drive hundreds of thousands of clicks to affiliate pages.Sacha Fournier, Founder JournoFinder.comHow to do itSacha explains it best:In a nutshell:Think of a newsworthy idea (with an affiliate angle)Build a dedicated landing page for itPitch the idea to relevant journalistsIntegrate a related affiliate offer into your contentSacha Fournier, Founder JournoFinder.comFor example, last year Sacha launched Nahbucks!, a microsite showcasing independent coffee shops on an interactive map.The site got featured in several publications including Business Insider, Yahoo, and more. This led to a huge spike in referral traffic, which is when Sacha took the opportunity to promote an affiliate offer.I deployed a subtle exit intent popup promoting a coffee subscription program. This campaign alone earned several thousand dollars in affiliate commissions within days of going live.Sacha Fournier, Founder JournoFinder.comOf course, coming up with and creating a newsworthy idea is the hardest part. If you’re struggling with that, check out the examples in my list of link building strategies. There are some real inspiring campaigns that should help get your creative juices flowing.Follow the money, not trafficFor too long people are just focusing on traffic and now we’re being attacked from left and right. It’s important to stay close to the money. By being on top of your numbers you’ll be back in control, instead of being thrown around by Google.Niels Zee, Co-founder TrafficFamily.ioHow to do itNiels says it’s about four things:Optimizing for the best converting offersGetting higher commission dealsLearning what type of content is most worth ranking forKnowing your earnings per visitor to test out paid marketing channelsTo do any of this, you need data. This is where tools like WeCanTrack come in handy, which pulls data from multiple affiliate networks into Google Analytics or Data Studio so you can make more informed decisions.I recommend [WeCanTrack] to everyone I mentor. I’m not affiliated to them or anything.Niels Zee, Co-founder TrafficFamily.ioFor example, it will estimate affiliate revenue per landing page so you can focus on ranking your most lucrative pages:It will also estimate revenue by traffic source so you can focus on channels and campaigns that drive the most affiliate revenue.Go beyond affiliate marketing and develop products for your audienceAs an affiliate, you are always going to be the person in the middle. Once you have served your purpose of connecting a buyer with a seller, neither have much need of you anymore. Consider building your own loyal audience and developing products for them. You can repeatedly deliver 10x more value this way and grow your business significantly higher.Mark Webster, Co-founder Authority HackerHow to do itDigital products have a lower barrier to entry, so I recommend starting there. If your product falls flat on its face, all you’ll lose is a big hunk of time—not thousands of dollars in development and manufacturing costs.To get started, I think Bryan Harris’s infamous product launch plan still makes a lot of sense.Come up with a product idea that might interest your audienceValidate that idea by pre-selling to a segment of your listCreate the productLaunch to everyone else on your listIf you’re more of a “just give it a go” person, you can always start with a low-cost product that’s quick to create and see what happens.For example, Matt from Swim University sells a simple pool care guide for $49:And Sammie Ellard-King from Up the Gains sells a financial planning spreadsheet for £39:Neither of these products likely took much time to create, which is ideal when you’re just starting to sell your own.Learn moreThanks to everyone who contributed to this post. If you want to learn even more about affiliate marketing, check out these posts and courses:Affiliate Marketing For Beginners: What It Is + How to SucceedAffiliate Marketing Course for Beginners Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Keep Learning 7 Successful Amazon Affiliate Websites (That You Can Learn From) Looking for inspirational Amazon affiliate sites? Here are 7 successful examples and how to replicate their success. Affiliate Marketing For Beginners: What It Is + How to Succeed Affiliate marketing is where you promote other companies' products to earn a commission. Learn how to get started in 7 simple steps. How to Do Keyword Research for Affiliate Sites Keyword research for affiliate sites is about finding high-volume keywords, where you can naturally plug product recommendations. How to Start Affiliate Marketing With No Money (5 Steps) Affiliate marketing can make you money while you’re on the beach or even when you're napping. Here's how to start with (almost) no money. Here’s How Much You Can Really Make From Affiliate Marketing Affiliate managers, business owners, freelancers. There are many ways to be involved in affiliate marketing. Find out how lucrative it is.",
  "headers": [
    {
      "level": "H1",
      "text": "11 Affiliate Marketers Share Proven Tips for 2024"
    },
    {
      "level": "H2",
      "text": "Track out-of-stock products and update their affiliate links"
    },
    {
      "level": "H3",
      "text": "How to do it"
    },
    {
      "level": "H2",
      "text": "Build trust by recommending the best products, not just the ones with the highest commissions"
    },
    {
      "level": "H3",
      "text": "How to do it"
    },
    {
      "level": "H2",
      "text": "Negotiate better rates with affiliate managers"
    },
    {
      "level": "H3",
      "text": "How to do it"
    },
    {
      "level": "H2",
      "text": "Build product comparison hubs with internal links"
    },
    {
      "level": "H3",
      "text": "How to do it"
    },
    {
      "level": "H2",
      "text": "Reverse-engineer affiliate links to find proven content ideas and products to promote"
    },
    {
      "level": "H3",
      "text": "How to do it"
    },
    {
      "level": "H2",
      "text": "Don’t rely 100% on SEO; diversify your traffic sources"
    },
    {
      "level": "H3",
      "text": "How to do it"
    },
    {
      "level": "H2",
      "text": "Demonstrate a product’s value before pushing coupons and bonuses"
    },
    {
      "level": "H3",
      "text": "How to do it"
    },
    {
      "level": "H2",
      "text": "Rank guest posts to boost commissions and SEO"
    },
    {
      "level": "H3",
      "text": "How to do it"
    },
    {
      "level": "H2",
      "text": "Drive people to your site with digital PR, then promote affiliate offers to them"
    },
    {
      "level": "H3",
      "text": "How to do it"
    },
    {
      "level": "H2",
      "text": "Follow the money, not traffic"
    },
    {
      "level": "H3",
      "text": "How to do it"
    },
    {
      "level": "H2",
      "text": "Go beyond affiliate marketing and develop products for your audience"
    },
    {
      "level": "H3",
      "text": "How to do it"
    },
    {
      "level": "H2",
      "text": "Learn more"
    }
  ],
  "author": "Joshua Hardwick"
}