{
  "url": "https://ahrefs.com/blog/ahrefs-affiliate-program/",
  "slug": "ahrefs-affiliate-program",
  "title": "Ahrefs’ Affiliate Program. We Don’t Have One (& Here’s Why)",
  "description": "We haven't had an affiliate program for at least five years. We don't have any plans to relaunch one. Here's why.",
  "content": "Tim Soulo Tim Soulo is CMO at Ahrefs. With over 15 years in the digital marketing industry, Tim is the author of many data-driven studies and actionable marketing frameworks, some of which gained industry-wide recognition. He enjoys challenging conventional marketing knowledge and optimizing for simplicity and efficiency. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents While browsing search queries in our Google Search Console, we noticed that quite a few people search for “ahrefs affiliate program” each month. And, unfortunately, the pages that rank at the top seem quite sketchy (and misleading).So let’s set things straight.Ahrefs does not have an affiliate programWe used to have one around five years ago, but we had to discontinue it for several reasons (see below).So today, in 2023, we don’t have an affiliate program. And we have no plans to relaunch it in the future.If you notice a blogger linking to our website with an affiliate link, it’s probably from an old article. Either way, that affiliate link no longer works. Why did we discontinue our affiliate program?Just in case you’re interested, there were two main reasons why we did that:It created technical debt on the billing side. As our software evolved, so did our billing. We had to move between various payment processors and introduce new packages and add-ons. Supporting all these changes with an affiliate program took a lot of work.3% of our affiliates generated 90% of leads. After a few years of running our affiliate program, we noticed that most affiliates sent us few or no leads. As for our top affiliates, we realized we could strike some personalized deals with them—which didn’t require having an affiliate program. (Interested in partnering with us? Reach out to Igor.)So there’s that! Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Tim Soulo Tim Soulo is CMO at Ahrefs. With over 15 years in the digital marketing industry, Tim is the author of many data-driven studies and actionable marketing frameworks, some of which gained industry-wide recognition. He enjoys challenging conventional marketing knowledge and optimizing for simplicity and efficiency.",
  "headers": [
    {
      "level": "H1",
      "text": "Ahrefs’ Affiliate Program. We Don’t Have One (& Here’s Why)"
    },
    {
      "level": "H2",
      "text": "Ahrefs does not have an affiliate program"
    },
    {
      "level": "H2",
      "text": "Why did we discontinue our affiliate program?"
    }
  ],
  "author": "Tim Soulo"
}