{
  "url": "https://ahrefs.com/blog/ahrefs-enterprise-new-features/",
  "slug": "ahrefs-enterprise-new-features",
  "title": "Ahrefs Enterprise: New features and highlights",
  "description": "Highlighting key new features that are unique to Enterprise plans or, while not Enterprise-specific, incredibly useful for large companies.",
  "content": "Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Ahrefs Enterprise has been around for a while now, and we’ve greatly expanded our capabilities in four core areas:Dedicated support to evaluate, purchase and integrate Ahrefs Tailoring reports to your exact needsMaking it easier to manage large numbers of users in the workspacePinpointing actions with the highest impact on your website’s performanceOn top of this, we’re fully committed to providing what we’re known and loved for: the most comprehensive and reliable data in the SEO industry.To put this data to work for you, we roll out new features consistently. Some are unique to Enterprise plans; others, while not Enterprise-specific, are still incredibly useful for large companies. These features scale well with teams, improve research and reporting capabilities, and overall empower teams to make informed decisions with ease.Today, we’re highlighting key features we launched over the past year in both areas. We’ll be covering:Enterprise featuresDedicated Enterprise supportAccess managementAudit logAPIv3SSOFeatures useful for EnterpriseOpportunities reportPortfoliosCalendar reportSite Audit advancementsTarget filter in Keywords ExplorerGSC integration in Rank TrackerLet’s get into it.Enterprise featuresDedicated Enterprise supportTo make the process of evaluating, purchasing and integrating Ahrefs as simple and seamless as possible, you’ll have a dedicated Ahrefs consultant who works directly with you to:Evaluate if Ahrefs is the right fit for your complex business requirementsProvide a tailored demo to fit your unique use casesHelp build a business caseShare what reporting would look like and how to integrate Ahrefs with your existing systemsProvide a trial for your teamNavigate purchasing AhrefsGuide your team on account set-up best practicesGuide your team on leveraging Ahrefs to get the most value as quickly as possibleTo learn more about Ahrefs Enterprise, fill out this form and our team will be in touch.Access managementFor greater control over user access in the workspace, Enterprise admins can assign Guest user roles.Guests only have access to projects and folders that have been explicitly shared with them. They also can’t create new projects.Combine this feature with folders to create project hierarchy in your workspace – for example, organize your team by region or brand by creating folders for each group, then grant access permissions at the folder level.Learn more about Access control features > Audit logThe Audit log makes it easier to track credit usage by tool or by user across your Enterprise workspace.If your workspace has more than 20 users, it will show the top 20 and group the rest into a bucket labeled “Other”.Workspace owners and admins can access the Audit log from Account Settings.APIv3Our Enterprise-exclusive APIv3 lets you pull data from your Ahrefs workspace to create custom integrations and automations, making for super flexible reporting and easy performance analysis.Currently, APIv3 allows you to pull a big range of data from the Site Explorer, Keywords Explorer and SERP Overview endpoints:Site Explorer OverviewBacklinksBroken backlinksReferring domainsBest pages by linksLinked domainsOrganic keywordsTop pagesPaid pagesKeywords Explorer Metrics for a single keyword or a list of keywordsVolume historyVolume by countryMatching termsRelated termsSearch suggestionsSERP Overview Top 100 SERP resultsMore reports and tools are coming soon.The easiest way to get started with Ahrefs APIv3 is to click on the API button in any Ahrefs report. This creates an API query for the current report, which is dynamically updated with any filters you apply.Read more about API units consumption >More recently, we’ve also added an option to limit API units usage per key, making it easier to control and manage usage in your workspace.Workspace owners and admins can do this from the API keys section in Account settings.SSOSingle sign-on (SSO) features increase the security of our platform and make it much easier to manage user access across large teams for Enterprise plans.Once enabled, workspace members will not be able to use other authentication methods to log in. The only exceptions are the workspace owner and admins, who’ll be able to log in using their email and password in the case of SSO failure.Enable SSO-only login for the workspace from Account settings.Learn more about SAML SSO configuration >Also exclusive to Enterprise plans is System for Cross-domain Identity Management (SCIM) user provisioning – another feature built for managing user access across large teams in mind.Once you enable SCIM, any user assigned to the Ahrefs application in your IdP will automatically be added to your Ahrefs workspace. If a user is unassigned from the Ahrefs application in the IdP, they will be removed from your Ahrefs workspace.Please reach out to Ahrefs’ support team to guide you through the process of enabling SCIM for your IdP.Features useful for EnterpriseOpportunities reportThe newly-launched Opportunities report shows you website opportunities that usually have the greatest impact. It’s a massive time-saver, allowing teams to focus on and prioritize actionable steps to increase website traffic and rankings.This first version shows you a set of ten “opportunities” to improve your target’s performance, ranging from updating content for low-hanging fruit keywords to highlighting critical technical issues and redirects to implement.Enter your website and click on a suggestion to load reports with the relevant filters pre-selected.Go to Opportunities report >PortfoliosThis new feature lets you group up to 1000 URLs from 10 different domains under one portfolio and see their aggregated metrics in Site Explorer. With this, your team will be able to:Track your top competitors as a single entity to gain insight into how your industry is doing as a whole in terms of search traffic, how it’s coping with major Google algorithm updates, how it compares to other industries, and so on.Combine multiple “regional” domains to track their performance as a single entity.Create author-specific portfolios if you have multiple authors publishing content on your website. This lets you see which of your authors are bringing more search traffic and backlinks, which ones have a higher publishing pace, and so on.Set up client portfolios to create focused reports showing how your portfolio of content on their website has been performing.Create sets of pages for testing on-page SEO tactics. Just set up a portfolio of the pages you’re implementing these tactics on, and track it against a second portfolio of pages in your control group.Do rank tracking on steroids – no need to manually track hundreds of keywords per page when you can create a portfolio of pages, and be shown the thousands of keywords that they rank for.Go to Portfolios >Calendar reportWith the Calendar report, your team gets an instant visual snapshot of all the improvements and changes in the last month or quarter.Switch between seeing changes for organic positions, organic pages, and referring domains, and use the filters to refine your results. For example, quickly find out which pages dropped out of the top 3 rankings for their top keyword by adding a Position filter between 1-3 for Lost pages.Go to Calendar report >Site Audit advancementsSite Audit got a bunch of useful new features in the past year, making our coverage of technical and on-page SEO issues even more comprehensive. Some highlights include:Crawling staging websitesThe HTTP authentication feature lets you crawl staging and restricted websites protected by basic or digest HTTP authentication. This means that your team is able to uncover potential SEO problems even before the website goes live.When setting up a new project, if one or more of the seed URLs entered returns a 401 status code, you’ll be prompted to provide your website credentials. After authentication, we’ll recheck seed URLs, verify ownership, crawl the website, and do a thorough audit.Structured dataThis new section in URL details shows you structured data found on the page. Validation errors are flagged based on the schema.org and Google guidelines, which helps your team optimize posts to get rich results.Plus, you can now build queries with the new fields for structured data properties and their values directly in Page Explorer. This opens up a bunch of new use cases – for example, to find all posts written by Tim Soulo, apply a filter for the author schema property, then set a property value to those containing “Tim Soulo”.Detecting changes to robots.txt and sitemapsWe started storing robots.txt and sitemaps for each Site Audit crawl earlier this year, so your team can now spot changes in Page Explorer and Link Explorer.If you click on a page in a Site Audit crawl and go to View source to view its contents, you’ll be able to use the “Compare with” dropdown to compare the current and previous snapshots of your robots.txt file and make sure nothing was disallowed or allowed by mistake.Site Audit also tells you which sitemap each URL and link is found in. For example, this “Referenced in sitemaps” field in Page Explorer points to each URL’s sitemap.Pro TipDid you know that Site Audit is 100% customizable? Click on Issue settings and you’ll be able to toggle specific issues off, either globally and for certain websites. If there’s an issue that’s irrelevant to your website, you can customize your health score this way. Learn moreYou can also create and customize your own issues from Page Explorer.Target filter in Keywords ExplorerThis filter shows you what positions your target URL is already ranking for (or not), which is a great time-saver for large companies who already rank for many keywords.With this, your team can:See keywords where you don’t rank in the top 10. This setting shows you two types of keywords: (a) keywords for which you don’t rank at all and (b) keywords for which you rank in low positionsFor the first type of keywords, you’d typically create new content. For the second type, you can improve existing content. To prioritize which pages to improve, export the keywords and sort them using the “Position” column.See keywords where you don’t rank in the top 100, letting your team avoid topics that you’ve already covered. GSC integration in Rank TrackerWith the GSC Overview report, your team can analyze your Google Search Console property and see the distribution of clicks, impressions, and CTR by position right in Rank Tracker.Pro TipDid you know that in Ahrefs, you can track Google Search Console data over 16 months old ? In Google Search Console itself, data is only kept for the last 16 months. Scrolling down, you’ll also be able to see a breakdown of your GSC performance by device and study the click-through-rate across ranking positions.Go to GSC overview >–We’re continuing to invest in new capabilities to cement ourselves as a leading Enterprise plan provider, so look out for more updates to come. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs.",
  "headers": [
    {
      "level": "H1",
      "text": "Ahrefs Enterprise: New features and highlights"
    },
    {
      "level": "H2",
      "text": "Enterprise features"
    },
    {
      "level": "H3",
      "text": "Dedicated Enterprise support"
    },
    {
      "level": "H3",
      "text": "Access management"
    },
    {
      "level": "H3",
      "text": "Audit log"
    },
    {
      "level": "H3",
      "text": "APIv3"
    },
    {
      "level": "H3",
      "text": "SSO"
    },
    {
      "level": "H2",
      "text": "Features useful for Enterprise"
    },
    {
      "level": "H3",
      "text": "Opportunities report"
    },
    {
      "level": "H3",
      "text": "Portfolios"
    },
    {
      "level": "H3",
      "text": "Calendar report"
    },
    {
      "level": "H3",
      "text": "Site Audit advancements"
    },
    {
      "level": "H4",
      "text": "Crawling staging websites"
    },
    {
      "level": "H4",
      "text": "Structured data"
    },
    {
      "level": "H4",
      "text": "Detecting changes to robots.txt and sitemaps"
    },
    {
      "level": "H3",
      "text": "Target filter in Keywords Explorer"
    },
    {
      "level": "H3",
      "text": "GSC integration in Rank Tracker"
    }
  ],
  "author": "Rebekah Bek"
}