{
  "url": "https://ahrefs.com/blog/ahrefs-for-content-marketers/",
  "slug": "ahrefs-for-content-marketers",
  "title": "My 5 Favorite Ahrefs Use Cases for Content Marketers",
  "description": "Snoop on site structure, cluster keywords into article ideas, track performance by authors, and much more.",
  "content": "Ryan Law Ryan Law is the Director of Content Marketing at Ahrefs. Ryan has 13 years experience as a writer, content strategist, team lead, marketing director, VP, CMO, and agency founder. He's helped dozens of companies improve their content marketing and SEO, including Google, Zapier, GoDaddy, Clearbit, and Algolia. He's also a novelist and the creator of two content marketing courses. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents I’ve used Ahrefs since 2016. I thought I was a power user, but since joining the team, I’ve discovered a bunch more use cases that I can’t imagine living without.Here are five of my favorite ways to use Ahrefs for content marketing:Contents1. Reverse-engineer your competitor’s entire content strategyLet’s be honest: we all snoop on our competitors to see what’s working (and isn’t). But today, a lot of the most exciting content strategies live outside of the company blog: free tools, app integrations, programmatic content, you name it.For most websites, you can use the Site structure report in Site Explorer to quickly see how the website is structured, and which parts generate the most organic traffic.In the example below, we’re looking at Copy.ai’s site structure. We might expect their blog to drive most of their organic search traffic, but according to the Site structure report, it only accounts for 4% of organic traffic. Instead, their /tools subfolder drives almost 60% of their traffic:Click deeper into the site structure, and you can see the individual pages generating the most traffic. In this case, three tools alone account for an estimated 20% of the entire website’s organic search traffic:We can even compare metrics from today to a point in the past and see how their strategy has changed. Compared to a year ago, Copy.ai has grown traffic to its /tools subfolder but removed 195 pages from its blog:Further readingHow to use the Site Structure report2. Track article performance by author, content type, or topicIt’s easy to track the performance of any blog as a whole. Add the URL into Site Explorer, and a second later, you’ll see key metrics:But for big blogs (ours has some 2.5k indexed pages), it’s harder to answer questions like:Which authors are driving the most traffic?How does link acquisition differ between SEO content and thought leadership content?Does updating our articles with an on-page SEO tool improve performance beyond just updating them normally?Enter Portfolios. Portfolios allow you to group a list of URLs together and view their aggregated metrics. I use one portfolio for tracking the performance of my articles:And another for tracking recent articles published by my team:And another still for monitoring the search performance of some of the biggest “parasite SEO” publishers (to see whether or not Google is really doing anything to combat it):In every case, you can click into your portfolio and see the same detailed metrics you’re used to from Site Explorer:Portfolios has become my default way of using Ahrefs, and there are tons of use cases:Compare articles written by freelancers, in-house terms, and (dare I say it) AI toolsSee which article topics drive the most trafficAnalyze the performance of different content types (helpful for separating out the impact of search content and thought leadership content)Monitor the performance of key competitor articlesMeasure the impact of newly updated or rewritten articlesTrack experiments (create one portfolio as a control and another for the articles you want to experiment on)Further readingHow to add your first portfolio3. Automatically generate hundreds of seed keywordsThe hardest part of keyword research (at least for me) is always generating seed keywords.When you have a few terms to explore, it’s easy to find long-tail variations, matching terms, related terms, you name it. But coming up with those first few topics? Not always easy, and it becomes even harder once you’ve exhausted obvious topics.But now, we can just use a little AI brainstorming power to turn a blank page into dozens and dozens of seed keywords. In Site Explorer, just ask our little AI friend for help:Let’s use the bog standard keyword “content marketing” as an example. Here are technical and specialized terms related to content marketing:Here are emerging trends:And now controversial and debate-generating keywords (“quality vs quantity”—going right for the meaty topics):With our big list of seed keywords, hit “Search” and we’ll see the estimated search volume, keyword difficulty, and a bunch of other data points for our ideas. Click the Matching terms or Related terms reports and our list of possibilities will grow massively:Not every idea will be a home run in terms of significant search volume, but many will—and they might be ideas you wouldn’t otherwise have considered.4. Instantly cluster keywords into article topicsIt’s pretty tricky to refine a list of 300 target keywords to a realistic selection of article ideas. Many keywords will have overlapping intent, others might be subtopics that make more sense to mention as part of another topic. Tricky!Here we’ve used AI to brainstorm seed topics and used the Matching terms report to find even more ideas. We’ve wound up with 1,622 keyword ideas in about 30 seconds of research:Great, but also totally overwhelming. But we can make life much easier by using the Cluster by Parent Topic tab.Parent topic aims to cluster keywords with similar or the same search intent, so you can target them all on one page instead of many.If we wanted to target the keywords “content marketing audit” and “content audit definition”, we could instead target the parent topic “content audit”—and also rank for “content marketing audit” and “content audit definition”.Three keyword rankings, one article.In the image below our 1,622 keywords are grouped by their parent topic. We’ve gone from 1,622 keywords to just 162 clusters—much more manageable:Just one of these clusters, content audit, contains 43 keywords. So by writing one article targeted at content audit, we stand to rank for 43 of the keywords we were interested in:Further readingHow to use the Related terms report5. See how competitors update their contentCompetitive SERPs are usually a never-ending game of content optimization and updating. Competitors publish new articles, or update their existing ones, and you have to update your content to avoid sliding down the rankings.When you formulate your plan for updating an article, it’s useful to see exactly how competitors have updated their articles.Here’s the organic traffic graph for Zapier’s most popular blog post, How to Use ChatGPT. We can see a huge increase in organic traffic starting in November 2023:This begs an obvious question: what happened in November? What caused the massive traffic increase? Is it something that we can learn from?Well, good news: we can use the Page inspect report to find out.By default, you can see the current HTML and page text for your chosen URL:But more importantly, we can use Page inspect to compare the on-page text at specific points in time: like just before and after their big traffic surge in November 2023. In a couple of clicks, we can actually see if Zapier updated the page in a way that might have triggered the traffic increase.In this case, we can see entirely new sections of text that were added to the article around the time of the traffic increase, like this collection of “how to” content:There are plenty of factors that can improve search performance, but this is a powerful way of isolating the impact of on-page changes. If we were writing an article on the same topic, or refreshing an article Zapier had dethroned, this is exactly the kind of section I would consider adding.Final thoughtsI’ve used Ahrefs for keyword research, link building, and reporting since forever, but these new-to-me workflows have made my life much easier. If you’re a content marketer, they might help you too.Got any interesting Ahrefs workflows to share? Let me know on X or LinkedIn! Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Ryan Law Ryan Law is the Director of Content Marketing at Ahrefs. Ryan has 13 years experience as a writer, content strategist, team lead, marketing director, VP, CMO, and agency founder. He's helped dozens of companies improve their content marketing and SEO, including Google, Zapier, GoDaddy, Clearbit, and Algolia. He's also a novelist and the creator of two content marketing courses. Keep Learning Content Outlines: How to Write Better Content Faster A content outline is a detailed overview of what will be in your article. It can improve your writing efficiency, content’s flow, and SEO too. We Asked 39 AI Writing Tools to Recommend Their Favorite AI Writing Tools. Here Are the Results We went meta and decided to put together a list of the top AI writing tools—recommended by AI writing tools. 23 Actual Content Metrics From Actual Marketers We asked content marketers to share the actual metrics they track. Here's what they said. 25 Types of Content You Can Use for Content Marketing In content marketing, there are heaps of options to pick from. To make it easier, we've curated 25 types for your choosing pleasure. Content Promotion: There are Only 3 Ways to Distribute Content You've published your content, now find out how to get more eyeballs on it.",
  "headers": [
    {
      "level": "H1",
      "text": "My 5 Favorite Ahrefs Use Cases for Content Marketers"
    },
    {
      "level": "H2",
      "text": "1. Reverse-engineer your competitor’s entire content strategy"
    },
    {
      "level": "H2",
      "text": "2. Track article performance by author, content type, or topic"
    },
    {
      "level": "H2",
      "text": "3. Automatically generate hundreds of seed keywords"
    },
    {
      "level": "H2",
      "text": "4. Instantly cluster keywords into article topics"
    },
    {
      "level": "H2",
      "text": "5. See how competitors update their content"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Ryan Law"
}