{
  "url": "https://ahrefs.com/blog/also-rank-for-study/",
  "slug": "also-rank-for-study",
  "title": "How many keywords can you rank for with one page? (Ahrefs’ study of 3M searches)",
  "description": "But how many keywords exactly will an average page rank for? That’s the question we wanted to answer (plus a few more), so we picked 3 million random",
  "content": "Tim Soulo Tim Soulo is CMO at Ahrefs. With over 15 years in the digital marketing industry, Tim is the author of many data-driven studies and actionable marketing frameworks, some of which gained industry-wide recognition. He enjoys challenging conventional marketing knowledge and optimizing for simplicity and efficiency. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents For anyone monitoring their traffic from Google, it’s not really a revelation that a single page can rank for hundreds (or even thousands) of relevant keywords. But how many keywords exactly will an average page rank for?That’s the question we wanted to answer (plus a few more), so we picked 3 million random search queries and looked at the top-ranking pages and how many other keywords they rank for.Let’s dive right in!New to keyword research? Check out ourBeginner’s guide to keyword researchHow many keywords do the top20 ranking pages “also rank for”?Here are the average and median numbers of keywords that we saw top20 pages “also rank for” (studied across 3 million search queries):Sidenote. By saying “also rank for,” I actually mean “also rank for in top10.” For if you’re not in the top10 search results for a given keyword, you’re hardly getting any traffic from it.It looks like the average #1 ranking page will also rank in the top10 for nearly 1,000 other relevant keywords (while the median value is more than two times smaller - around 400 keywords).And the lower ranking pages tend to rank for less keywords.We have also studied three groups of keywords separately:all keywords in our sample;keywords with search volume over 1,000 searches per month;keywords with search volume over 10,000 searches per month.We wanted to know if ranking for a more popular keyword would result in ranking for a larger number of relevant keywords. Which appeared to be exactly the case.The outliersIt’s always fun to look at outliers, right?Sidenote. Outliers are the actual reason why we study average and median numbers separately. Quite a few pages rank for an enormous amount of keywords, which drives the “average” numbers up. For the previous experiment, we removed the biggest outliers to make the data more representative, but even then, the gap between average and median values was quite substantial. So let’s see which pages rank in Google for an enormous amount of keywords.Top10 pages by the number of “also rank for in top100” keywords (across all countries):(192184) nsfw(139245) http://www.vidtomp3.com/(131597) http://www.listentoyoutube.com/(118070) http://www.youtube-mp3.org/(113957) http://convert2mp3.net/en/(113927) http://www.clipconverter.cc/(108972) https://www.google.com/(104940) http://www.pcmag.com/article2/0,2817,2476563,00.asp(100558) http://keepvid.com/(91594) https://www.pizzahut.com/Top10 pages by the number of “also rank for at #1” keywords (across all countries):(49804) https://www.google.com/(34930) https://www.google.com/gmail/(30420) https://www.facebook.com/(27851) https://www.youtube.com/(25639) http://www.youtube-mp3.org/es(24769) nsfw(22078) nsfw(21588) https://translate.google.com/?hl=es(21584) http://www.youtube-mp3.org/(20613) https://translate.google.com/You can put any of these URLs into Ahrefs’ Site Explorer tool and navigate to the “Organic keywords” report to see all the keywords they rank for.And based on these outlier URLs, it looks like downloading content from YouTube is one of the primary issues that bother humanity these days:How many high-volume keywords can you “also rank for”?There’s nothing surprising about ranking for thousands of long-tail keywords with a single page. But what about the high-volume keywords? How many of them can a single page rank for?To study this, we took all the pages from our sample that ranked #1 for a 10k+ keyword and looked at how many other 10k+ keywords these pages also ranked for (at position #1).We then replicated a similar experiment for pages that ranked #1 for 1k+ keywords.And here’s what we got:Unsurprisingly, the majority of URLs have ranked #1 for a single high-volume keyword.But the raw numbers on the above graph might seem a little bit misleading, because it’s hard to put them on the same scale.So we have calculated what % of pages in our sample ranked at the top for one keyword, two keywords, three keywords, etc. And got these cool pie charts:It turns out that ranking for 2-3 keywords with over 1,000 searches per month is quite common. While ranking for more than one 10k+ keyword with a single page is very rare.How can you rank for more keywords with your page?https://www.youtube.com/watch?v=tnXEtam6ySwAs you can probably tell by looking at the above-mentioned outliers, the best way to rank for more keywords is to choose the right topic.Certain topics tend to have a huge search demand and a ton of relevant search queries, while others simply aren’t popular enough to provide you with a variety of keyword searches.We’ve covered this in our guide to long-tail keywords, but I guess it won’t hurt to mention it again.Research traffic potentialWhen planning your content, don’t just look at the search volume of the primary keyword you’re targeting. You should pull the top-ranking pages for that keyword and see how many other keywords they also rank for and how much search traffic it brings them.I often use the keyword “I’m sorry flowers” to illustrate that.The monthly search volume of this keyword is only 250 searches per month, which may seem that it is not worth targeting.But if you look at the top-ranking pages for that keyword (which you can do with Ahrefs’ Keywords Explorer) you’ll see this:The top5 ranking pages for the keyword “I’m sorry flowers” also rank for over 50 other relevant keywords, which brings each of them around a hundred highly targeted visitors per month.Sidenote. We have a very large database of keywords at Ahrefs, but it is impossible to include all the existing search queries there. That is why Ahrefs always underestimates the amount of keywords that a page is ranking for and the amount of traffic it brings. Which means the actual search traffic to a given page will always be bigger than what we estimate. So if you stick with the old approach to keyword research, you’ll decide that it’s not worth ranking in top5 for the keyword “I’m sorry flowers.”And if you adopt this new strategy, you’ll be getting around a hundred highly targeted visitors per month from ranking anywhere in the top5 for this keyword.But apart from finding the topic with high traffic potential, what else can you do to maximize the amount of keywords that your page will rank for?Does content length help?To give you the answer to this question, we have distributed all pages in our sample size into 5 buckets by their content length and looked at the average number of keywords they “also ranked for in the top10”:Looks like longer form content tends to rank for more keywords, which is not surprising in any way.But then we went a little more granular and looked at the amount of keywords that ranked at position #1 for each bucket:And still longer form content performed better.Do backlinks help?There were quite a few studies (ours included) that showed a rather high correlation between the backlink factors of a page and its Google rankings.But I don’t think I’ve seen a study of how backlink factors correlate with the number of keywords that a page ranks for.So we created 5 buckets by URL Rating (which shows how strong the backlink profile of a given URL is) and looked at the average number of “also rank for in top10” keywords for each of them:The above graph shows a pretty strong correlation between URL Rating of a page and the number of keywords that it ranks for in the top10.We also went a little more granular and looked at the keywords ranking at position #1:And still, pages with a stronger backlink profile performed better.Sidenote. This is just a quick reminder that correlation does not imply causation. So the above research doesn’t allow us to say that backlinks help you rank for more keywords. All we can say is that pages with more backlinks tend to rank for a larger number of keywords.How unique are the “also rank for” keywords?What we wanted to study in this final experiment was how many search queries a page ranks for have:1 common word;2 common words;3 common words;4 common words, etc.Our goal was to see how many keywords that a page ranks for are unique to the point where they don’t have even a single common keyword with the rest of the group.This particular experiment was a bit tricky to study and visualise, but after playing with the data for a while, we got this:As you can tell from that graph above, the number of “unique” keywords (that don’t have even a single common word with others) is extremely low.Which even further supports the fact that ranking for a huge number of keywords is all about picking a popular topic, which people would search for with the same words but different search queries - as opposed to targeting multiple different topics with one page.The EndSo that was our (rather brief) research of the “also rank for” keywords and I hope you’ve learned something from it.Let me know in the comments which takeaway you enjoyed the most and if any of our experiments have raised further questions that you would like us to answer with some follow-up research. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Tim Soulo Tim Soulo is CMO at Ahrefs. With over 15 years in the digital marketing industry, Tim is the author of many data-driven studies and actionable marketing frameworks, some of which gained industry-wide recognition. He enjoys challenging conventional marketing knowledge and optimizing for simplicity and efficiency. Keep Learning How long does it take to rank in Google? (A study by Ahrefs) Our research will answer the most popular question in SEO world: \"How long does it take to rank in Google?\" Another number-driven study from Ahrefs. Do Links From Pages With Traffic Help You Rank Higher? [Ahrefs Study] Links are important for SEO. But what makes a good link? Should you aim to get links from pages with traffic, or does that not matter so much? Link Building Case Study: How We Built Backlinks With a ‘Stats’ Page (And Ranked #1) In this case study, you'll learn why and how we created a statistics page, how we built links to it, and our results and takeaways from the experiment. Ranking #1 on Google Is Overrated (Ahrefs’ Study of 100k Keywords) Still trying to rank #1 for your target keywords? We studied ~100k keywords and found that ranking #1 is often overrated. GSC vs. GKP: Comparing Search Volumes for 72k Keywords [A Study by Ahrefs] How well do the search volume numbers for Google Search Console and Keyword Planner align? We did a study of 72,635 keywords to find out.",
  "headers": [
    {
      "level": "H1",
      "text": "How many keywords can you rank for with one page? (Ahrefs’ study of 3M searches)"
    },
    {
      "level": "H2",
      "text": "How many keywords do the top20 ranking pages “also rank for”?"
    },
    {
      "level": "H3",
      "text": "The outliers"
    },
    {
      "level": "H2",
      "text": "How many high-volume keywords can you “also rank for”?"
    },
    {
      "level": "H2",
      "text": "How can you rank for more keywords with your page?"
    },
    {
      "level": "H3",
      "text": "Research traffic potential"
    },
    {
      "level": "H3",
      "text": "Does content length help?"
    },
    {
      "level": "H3",
      "text": "Do backlinks help?"
    },
    {
      "level": "H2",
      "text": "How unique are the “also rank for” keywords?"
    },
    {
      "level": "H2",
      "text": "The End"
    }
  ],
  "author": "Tim Soulo"
}