{
  "url": "https://ahrefs.com/blog/amazon-affiliate-websites/",
  "slug": "amazon-affiliate-websites",
  "title": "7 Successful Amazon Affiliate Websites",
  "description": "Looking for inspirational Amazon affiliate sites? Here are 7 successful examples and how to replicate their success.",
  "content": "Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Heard a lot about Amazon affiliate websites but have no idea where to start? Take inspiration from these seven examples. Amazon affiliate websites make money via commissions from their affiliate program: Amazon Associates. Here’s how this works: A person visits an Amazon affiliate site.They click on an affiliate link to buy a recommended product on Amazon.Amazon pays the site owner a commission. In this post, we’ll share some inspiring Amazon affiliate websites, why they’ve done so well, and how you can replicate their success. Let’s get things started. New to affiliate marketing?Read our beginner’s guide to affiliate marketing.1. The Prepared Key stats Domain Rating: 36 Number of referring domains: 901 Number of keywords it ranks for: 40,600 Estimated organic traffic: 31,900 Site age: 2 years Estimated revenue: Unknown Founded by John Ramey and John Adama—former advisors at the Obama White House—The Prepared is a survivalism website that publishes practical guides on preparing for emergencies ranging from potential car accidents to war.Why they’re doing so well For starters, the doomsday prepper market is huge. According to Finder.com, an estimated 160+ million Americans have either recently purchased survival gear or are already in possession of some. Of course, The Prepared is not the only website focused on survivalism. There are tons of websites in this niche. The success of this particular site falls largely down to its owners’ focus on creating content about evergreen topics. Evergreen topics are those with consistent interest and search volume over time. For example, we can see that The Prepared targets keywords like “best tarp.” According to Google Trends, this is a topic with increasing interest over time: They’re also committed to updating their content regularly to keep it evergreen. After all, a list of the best tarps won’t stay fresh forever since new products are released all the time. If they update something, they’ll mention what changed in the post: The benefits of this approach are obvious: They don’t have to worry about waning interest in their topics. People will still be searching for “best tarp” 5 years from now.They can get consistent organic traffic over time. Google tends to favor fresh results for queries like “best tarp” because old posts are out of date and no use to searchers in 2020. By publishing regular, minor updates as new products become available, the guys behind The Prepared can maintain rankings long term. What also makes them stand out is the quality of their content. For their reviews, they test every product before publishing, and they’re transparent about the testing process. Essentially, this is the Wirecutter model (we’ll talk more about them later!). The Prepared simply took the idea and focused on a single niche.How to replicate their success Focus on creating “best [x]” posts for evergreen product categories. These are things that people will still be looking to buy in years to come. For example, a list of the best dishwashers has longevity since there are always people in the market for a new appliance. That’s why Google Trends shows consistent search demand over time. Of course, some topics are seasonal such as “best tents.” This isn’t an issue because its popularity is consistent year over year. You’ll just experience more sales during certain parts of the year. What you want to avoid are non-evergreen topics with waning interest, like “best fidget spinner.” The benefit of creating content about evergreen product categories is that it has the potential to attract organic traffic long term. Just make sure your SEO strategy is sound and you keep the posts updated. Learn more about how to do this in our guide to evergreen content.2. Homegrounds Key stats Domain Rating: 63 Number of referring domains: 1,320 Number of keywords it ranks for: 136,000 Estimated organic traffic: 244,000 Site age: 3 years Estimated revenue: Unknown Homegrounds is a site that teaches “home baristas” how to brew and enjoy better quality coffee.Why they’re doing so well I reached out to the site’s founder, Alex Azoury, to find out. Here’s what he said: Firstly, we commit to publishing content that is better than our competitors. This is because the coffee brewing market are switched on, and they definitely appreciate content that actually solves their problem, rather than content built to simply target a keyword. Secondly, we reverse engineer our competitors via Ahrefs’ Site Explorer to uncover content and backlink opportunities that are working for them. If it works for them, it will most likely work for us. Finally, we dig deeper into keywords and think about search intent, rather than just looking at search volume. The topics that eventually perform the best from a financial perspective are rarely the ones that look the best on face value. Again, Ahrefs’ Keywords Explorer has been an invaluable resource for this. Alex Azoury, Founder & EditorHow to replicate their success If we distill what Alex said above, we see that what worked for the Homegrounds team is to focus on the basics:Do keyword research and find topics with traffic potential.Create content that aligns with search intent and trumps everything else on quality.Build links to the content by replicating competitors’ link building strategies. Learn how to do this in our guide to ranking on the first page of Google.3. Dog Food Advisor Key stats Domain Rating: 76 Number of referring domains: 5,890 Number of keywords it ranks for: 203,000 Estimated organic traffic: 594,000 Site age: 11 years Estimated revenue: Unknown DogFoodAdvisor is a site that helps pet owners make better decisions when buying dog food.Why they’re doing so well The pets market is enormous. It’s estimated that $75 billion was spent by pet owners in 2019, with $31 billion on pet food alone. And therein lies the key to this site’s success. Instead of writing broadly on pets or even pet food, they chose to focus solely on dog food. It also helps that the keyword “dog food” has a global search volume of 117,000 searches per month. This focus helped them to stand out in a saturated niche, and almost certainly also helped them to rank for thousands of dog food-related keywords. How to replicate their success There are plenty of things to emulate, but lets drill down on two aspects:1. Create content hubs Their page on the “best dog foods” ranks for over 1,300 keywords, sending them an estimated ~20,284 US search visits per month. Given that there are so many types of dog foods available for different breeds and for various purposes, it would be impossible to answer the question of “what is the best dog food” in a single article. Instead, what this page does is internally link to more specialized articles on the subject, allowing readers to choose the one that applies most to them. This is known as a “content hub.” Besides creating a better user experience, “hub” pages are also beneficial for SEO. This is because more “authority” is transferred to DogFoodAdvisor’s most important pages as subpages link back to hub pages and vice-versa). This is almost certainly part of the reason why this page is ranking so well. Learn more about the types of content hubs in this post.2. Create useful content that attracts links Dog food recalls are surprisingly common but also easy to miss. DogFoodAdvisor solves this problem with their up-to-date list of dog food recalls. To date, this page has links from 390 websites. Takeaway: Don’t focus solely on “best [x]” keywords. Create useful, informational content that attracts links and boosts your authority. Learn more about how to create content that attracts links.4. PCPartPicker Key stats Domain Rating: 74 Number of referring domains: 8,810 Number of keywords it ranks for: 785,000 Estimated organic traffic: 3,100,000 Site age: 9 years Estimated revenue: Unknown Many people want to build their own PC, but the process isn’t that straightforward—particularly for newbies. This is where PCPartPicker excels. Choose the parts you want for your PC, and PCPartPicker will provide compatibility guidance and up-to-date pricing. They also publish “build guides” for those who are unsure how to start building one.Why they’re doing so well PCPartPicker is interesting because it deviates from the traditional affiliate model of targeting “best [x]” keywords. Instead, it’s a tool. Knowing which components to buy is a big problem in the “build your own PC” world. PCPartPicker solves this by letting you shop for the latest PC parts based on performance and budget. It then automatically cross-references them to check for compatibility. Then, based on what you’ve configured, you can purchase directly from Amazon (with PCPartPicker’s affiliate links.) The most remarkable part about this is how much trust the site has built with its audience. A big issue with affiliate sites is they often recommend products based on the highest commissions. This “strategy” quickly erodes trust, causing many affiliate sites to fail. But PCPartPicker’s tool is unbiased. It doesn’t push any particular products. All it does is allow users to choose their own configurations, and then make commissions off those choices. Because the tool is so useful, it markets itself via word-of-mouth. Along the way, the tool page itself has picked up 835 referring domains—many of which come from authoritative, high-DR sites like The Verge, PC World, etc. How to replicate their success Not all Amazon affiliate websites must be “content sites” to do well. There are other ways to excel. Is there a big problem in your niche? Can you build a free tool or resource to help fix that problem and potentially make some affiliate income along the way? Sometimes, you have to think outside the box. Learn more about how to find these opportunities in this guide (skip to example #4)5. Equipboard Key stats Domain Rating: 58 Number of referring domains: 2,560 Number of keywords it ranks for: 722,000 Estimated organic traffic: 354,000 Site age: 5 years Estimated revenue: Unknown Equipboard is a site that showcases the gear, tools, and products used by famous musicians. Content on the site is partially user-generated. The founders (Giulio and Michael) review products and create content targeting “best” keywords, and users contribute content about the gear their favorite artists use.Why are they doing so well? As an affiliate site, Equipboard targets “best” keywords in their niche. That’s to be expected. But they also tackle the affiliate model from a unique angle. A big part of their site is the breakdown of the gear and tools that famous musicians use. That’s pretty smart. In the music world, people want to be more like their idols. They want to play the guitar like Slash, rap like Eminem, or sing like Ariana Grande. Not only that, they want to use the same gear as these people. In fact, Giulio, the co-founder, says this is how Equipboard started. As musicians ourselves, we understand how musicians search for a certain sound and shop for gear. That led us to create a site around the way people explore gear, specifically by looking up to the pro musicians they admire. Giulio Chiarenza, Co-founder This is also where Equipboard takes it to the next level. Think about it: there are thousands of musicians from every possible genre. It would take them forever to cover every single one of them. The solution? Enlist the help of their audience. On Equipboard, anyone can add content related to their favorite artists’ gear. Then, with the help of a few community moderators, the founders fact-check sources and ensure the suggestions are accurate. This allows them to scale content production at a relatively low cost. It also helps them to: Get traffic. Most of these musicians are famous, so there’s plenty of search volume for relevant terms (e.g. “jimmy page gear”.)Get affiliate link clicks. Since fans are already interested in the gear of their favorite musicians, it is likely they will click on their affiliate links.Get backlinks. Since they’re the most credible source for musicians’ tools and gear, they get tons of links from Wikipedia and other reputable sites.How to replicate their success Equipboard’s key to success is their unique selling point (USP): the breakdown of tools and instruments that famous musicians use. But here’s the cool part: you can apply this same concept to other niches. Run a golf site? There are plenty of people searching for what’s in the bags of famous golfers. Run a book review site? People want to know what books famous people recommend. The examples are endless. You just need to find them, which is where a keyword research tool like Ahrefs’ Keywords Explorer (pictured above) comes in handy.6. Territory Supply Key stats Domain Rating: 26 Number of referring domains: 275 Number of keywords it ranks for: 27,700 Estimated organic traffic: 26,600 Site age: 4 years Estimated revenue: ~4-figures per month Territory Supply helps people find hiking, camping, backpacking, and travel adventures in the US, while also showcasing the best outdoor gear they should use.Why they’re doing so well The first thing you’ll notice when you visit Territory Supply is how much it looks like an online magazine, rather than a typical affiliate site. And indeed, they do run their site like a magazine. As an affiliate site, they have articles targeting “best x” keywords. But they also cover plenty of other topics that don’t link to any products. They’re also committed to linking to the best products, even if they can’t make money from their recommendations. For example, their post on “DIY teardrop camper kits” generates an estimated 1,800 search visits per month, but has only one link to an affiliate product. Dustin Christiensen, the founder, reaffirms my thoughts. I think one reason we’ve had success with Territory Supply is that we’ve tried to provide more value than your average affiliate site. For example, a lot of our product recommendations come from small brands or retailers that don’t have an affiliate program whatsoever. But, those brands make some of the best products, so we’ve included them in our content because that’s what’s most valuable to our readers. We don’t just find five Amazon products and call it a day—we’ll put a lot of research into each product category to find unique products and brands that no one else is discussing since most sites can’t make money off of them. Secondly, we’ve invested heavily in our brand and appearance. Instead of putting up a cheap WordPress theme, I spent thousands of dollars on a custom designed website with some unique outdoor aesthetics that work well for the outdoor community. We tried to build something that didn’t look like a cheap, thin affiliate site and instead, wanted something that looked trustworthy, valuable and impactful. Last, we also do a lot of content that isn’t related to products or affiliate marketing at all - like hiking and camping guides that include the best locations to explore in different areas. These articles are research-intensive and we try to find writers who live in or explore the areas we write about so that they have real, accurate value for our readers. We do so much more than just product-based content that I think it helps find an audience that a lot of affiliate sites might miss out on. Dustin Christiensen, FounderHow to replicate their success Not every Territory Supply reader is ready to buy. Sometimes, they’re just curious. And when they read articles like “10 Stunning Hikes in Death Valley National Park”, they might be inspired to start exploring the outdoors more often. Or they might even be fired up to start hiking on the coming weekend. This will lead them to wonder about the gear they’ll need for hiking, which Territory Supply also helps with. The takeaway: just because you run an affiliate site doesn’t mean you should only cover “best” or “review” topics. You should target topics at every stage of the marketing funnel. Learn how to do this in our guide to finding and mapping keywords to the buyer’s journey.7. The Wirecutter Key stats Domain Rating: 82 Number of referring domains: 23,100 Number of keywords it ranks for: 3,700,000 Estimated organic traffic: 4,100,000 Site age: 8 years Estimated revenue: ~$10 million (2016) Founded in 2011 by Brian Lam, a former Editorial Director at Gizmodo, The Wirecutter has grown into perhaps the most famous and well-known Amazon affiliate site on the planet. Frustrated with the never-ending chase for pageviews in traditional media companies, Brian quit Gizmodo and started The Wirecutter as a small review site focused on gadgets. It was acquired by the New York Times in 2016 for $30 million.Why they’re doing so well Short story: they rank on the first page for 62,000+ “best” keywords in the U.S. alone: The longer story: they’re the absolute champion of product reviews. When it comes to “best [product category]” type posts, most affiliate sites simply curate whatever’s currently selling well on Amazon. Not The Wirecutter. For every category, they’ll thoroughly sample and test every major product. Where needed, they’ll hire professional reviewers. They’re also transparent about how they test the quality of those products. Further, to prevent bias, the staff writers are not informed about what commissions the site receives for different products. And that’s not all. The Wirecutter understands that not everyone wants to read a lengthy review. They just want a reliable and trustworthy source to tell them which product to buy. So, in the first paragraph of every post, they get straight to the point. They build your trust by telling you how they researched it, then telling you exactly what to buy. For the impatient, this is perfect. They can click through immediately and make the purchase. But even if they don’t buy right away, it’s okay. For Amazon affiliate sites, the click itself is important. After all, Amazon has a 24-hour cookie, which means that the site owner will receive commission on anything the person buys in the next 24 hours. That said, The Wirecutter doesn’t just cater to the impulse buyer. For those who are obsessed with researching every aspect of a purchase, there’s plenty of research to read. How to replicate their success Focus on creating thorough, well-researched posts for “best [category]” type keywords in your industry. That means testing the products yourself where possible, and potentially even coming up with innovative ways to do so. If you’re starting out and can’t afford to purchase every product in the category, focus on delivering in-depth research. Not only does this approach build trust with readers and entice affiliate link clicks, but it also helps to attract backlinks. That said, while the quality of content certainly plays an important role here, we also suspect that employing an inhouse SEO team doesn’t hurt matters. And that brings us to a crucial point: You shouldn’t try to replicate this model like for like on a site that reviews everything under the sun. Niche down and do things on a smaller scale. Coming full circle, that’s what The Prepared did in the preppers niche—and it worked out pretty well for them.Final thoughts Most successful Amazon affiliate sites follow roughly the same formula: They target commercial investigation keywords like “best [category]”;They create best-in-class content by actually reviewing products;They work hard to build and attract backlinks to improve rankings. None of this is rocket science. It just takes hard work, persistence, patience, and a focus on long-term over short-term results. Did I miss any good sites? Let me know in the comments or ping me on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Keep Learning How to Build a Successful Amazon Affiliate Site (Step by Step) Learn how to build a successful Amazon affiliate site and make some extra money on the side. Affiliate Marketing For Beginners: What It Is + How to Succeed Affiliate marketing is where you promote other companies' products to earn a commission. Learn how to get started in 7 simple steps. How to Do Keyword Research for Affiliate Sites Keyword research for affiliate sites is about finding high-volume keywords, where you can naturally plug product recommendations. 3 Ways to Find a Great Affiliate Niche (With Examples) Finding suitable affiliate niches to go after can be difficult. Here's how to do it easily while casually surfing the internet. 7 Affiliate Marketing Examples & Why They Work So Well What makes a good affiliate marketing website? How does it get people to visit and purchase? Let's study some success stories.",
  "headers": [
    {
      "level": "H1",
      "text": "7 Successful Amazon Affiliate Websites (That You Can Learn From)"
    },
    {
      "level": "H2",
      "text": "1. The Prepared"
    },
    {
      "level": "H3",
      "text": "Key stats"
    },
    {
      "level": "H3",
      "text": "Why they’re doing so well"
    },
    {
      "level": "H3",
      "text": "How to replicate their success"
    },
    {
      "level": "H2",
      "text": "2. Homegrounds"
    },
    {
      "level": "H3",
      "text": "Key stats"
    },
    {
      "level": "H3",
      "text": "Why they’re doing so well"
    },
    {
      "level": "H3",
      "text": "How to replicate their success"
    },
    {
      "level": "H2",
      "text": "3. Dog Food Advisor"
    },
    {
      "level": "H3",
      "text": "Key stats"
    },
    {
      "level": "H3",
      "text": "Why they’re doing so well"
    },
    {
      "level": "H3",
      "text": "How to replicate their success"
    },
    {
      "level": "H4",
      "text": "1. Create content hubs"
    },
    {
      "level": "H4",
      "text": "2. Create useful content that attracts links"
    },
    {
      "level": "H2",
      "text": "4. PCPartPicker"
    },
    {
      "level": "H3",
      "text": "Key stats"
    },
    {
      "level": "H3",
      "text": "Why they’re doing so well"
    },
    {
      "level": "H3",
      "text": "How to replicate their success"
    },
    {
      "level": "H2",
      "text": "5. Equipboard"
    },
    {
      "level": "H3",
      "text": "Key stats"
    },
    {
      "level": "H3",
      "text": "Why are they doing so well?"
    },
    {
      "level": "H3",
      "text": "How to replicate their success"
    },
    {
      "level": "H2",
      "text": "6. Territory Supply"
    },
    {
      "level": "H3",
      "text": "Key stats"
    },
    {
      "level": "H3",
      "text": "Why they’re doing so well"
    },
    {
      "level": "H3",
      "text": "How to replicate their success"
    },
    {
      "level": "H2",
      "text": "7. The Wirecutter"
    },
    {
      "level": "H3",
      "text": "Key stats"
    },
    {
      "level": "H3",
      "text": "Why they’re doing so well"
    },
    {
      "level": "H3",
      "text": "How to replicate their success"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Si Quan Ong"
}