{
  "url": "https://ahrefs.com/blog/amazon-affiliate-marketing/",
  "slug": "amazon-affiliate-marketing",
  "title": "How to Build a Successful Amazon Affiliate Site (Step by Step)",
  "description": "Learn how to build a successful Amazon affiliate site and make some extra money on the side.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Do you want to make some extra dough promoting products on Amazon? Lots of people make money with Amazon affiliate sites. But for every success story, there are plenty who never quite get there. For example, this person on the /r/juststart subreddit claims to have hit $1K/month from Amazon within just six months: Whereas this person hit just $38/month after working on a site for over two years: If you want your story to be more like that first screenshot and less like the second, this is the guide for you. Here’s everything you’ll learn:What the Amazon affiliate program isHow Amazon’s affiliate program worksHow to become an Amazon affiliateWhat an Amazon affiliate site isWhy SEO is important for Amazon affiliate sitesHow to build a successful Amazon affiliate siteNew to affiliate marketing?Read our beginner’s guide to affiliate marketing.What is the Amazon affiliate program? The Amazon affiliate program (Amazon Associates) lets people earn money by referring sales to Amazon.How Amazon’s affiliate program works When you sign up, Amazon gives you a unique tracking ID that looks something like this: yourname-20. You can add this to any Amazon product URL to create an affiliate link. Example: amazon.com/dp/B01K1C94E4 → amazon.com/dp/B01K1C94E4?tag=yourname-20 When someone clicks your link and buys something on Amazon within 24 hours, you’ll be paid a commission on the sale. Even better, they don’t have to buy the product you recommend. If you send them to a kitchen knife and they end up buying a tennis racket, you still get a commission. If they buy the kitchen knife, a tennis racket, and a bunch of other things, you earn commission on everything. This is partly why the affiliate program is so popular. Amazon sells most things, so it’s not unusual to see a good chunk of commissions come from products you’ve never even heard of.How to become an Amazon Affiliate Follow these steps:Go to the Amazon Associates homepage;Sign in with your Amazon account;Follow the on-screen instructionsDuring signup, Amazon will ask for your website address. Although you can enter a social media profile link here, you’ll want to set up an Amazon affiliate website if you’re serious about making money with Amazon Associates. What is an Amazon affiliate site? Amazon affiliate sites promote products for sale on Amazon in their content. If you’ve ever Googled something like “best [product type]” or “[product] review,” then you’ve almost certainly come across one of these sites. Just take a look at the top-ranking result for “best coffee grinder”: These folks researched the best coffee grinders, summarized their findings in a blog post, and included Amazon affiliate links for visitors to buy the recommended products. It’s a similar story for a query like “aeropress review.” Both of these types of posts are useful for readers because they make life simpler and save time. If you’re in the market for a new coffee grinder, you can’t test dozens of products yourself. You have to rely on the research and testing done by others.Why SEO is the secret to a successful Amazon affiliate site Making money from an Amazon affiliate site requires traffic (visitors). Without traffic, nobody will click your affiliate links, which means no commissions. Now, there are tons of ways to get traffic. But most who experience success with Amazon affiliate marketing get the bulk of their traffic from SEO. Here’s why: If you promote your blog on social media, or in a newsletter, you’ll get a spike in traffic. But once your audience has seen your post, traffic drops back to zero. This is known as the “spike of hope,” followed by the “flatline of nope.” SEO has the opposite effect. If you rank in Google for keywords that people are searching for month after month, your traffic will be consistent—and should improve over time. It’s possible to get the same effect using paid ads, but there are a few problems with that:It costs money (and most people have more time than money)It’s very much all or nothing. As soon as you stop spending money, your traffic drops to zero.It’s hard to turn a profit as ad spend eats into your affiliate commissions.With that in mind, let’s look at how you can build an Amazon affiliate site that makes money month after month. How to build a successful Amazon affiliate site Everyone has a different idea of success. For some, it’s a site that makes $1,000/month. For others, it might be a more ambitious goal of $10,000/month. Whatever the number, the steps to success are the same.Choose a good nicheFind profitable keywordsCreate the “right” kind of contentDrive traffic to your site through SEOGet clicks on affiliate links1. Choose a good nicheHave you heard of The Wirecutter? It’s owned by The New York Times and is perhaps the most popular Amazon affiliate website. It has reviews for everything from knife sharpeners to standing desks and gets an estimated 3.9 million monthly visits from Google alone. Sidenote. The Wirecutter has now been redirected to nytimes.com/wirecutter/. Many who are new to Amazon affiliate marketing see sites like these and try to replicate their success. Don’t make this mistake. Big sites like The Wirecutter have deep pockets and talented SEO teams. Trying to compete will be an uphill battle. Instead, you need to choose a niche to dominate. Here’s how:A. Find something you’re interested inLoss of motivation is arguably the most common reason why people fail at affiliate marketing, so it’s important to choose a niche that you find at least somewhat interesting. So, grab a pen and paper and note down a few ideas. If you’re struggling, this huge list of affiliate marketing niches might help. Alternatively, take inspiration from The Wirecutter’s categories. B. Check commission ratesAmazon’s commission rates vary by product category. Here’s the current structure:Product CategoryCommissionsLuxury Beauty, Amazon Coins10.00%Digital Music, Physical Music, Handmade, Digital Videos5.00%Physical Books, Kitchen, Automotive4.50%Amazon Fire Tablet Devices, Amazon Kindle Devices, Amazon Fashion Women’s, Men’s & Kids Private Label, Apparel, Amazon Cloud Cam Devices, Fire TV Edition Smart TVs, Amazon Fire TV Devices, Amazon Echo Devices, Ring Devices, Watches, Jewelry, Luggage, Shoes, and Handbags & Accessories4.00%All Other Categories4.00%Toys, Furniture, Home, Home Improvement, Lawn & Garden, Pets Products, Pantry, Headphones, Beauty, Musical Instruments, Business & Industrial Supplies, Outdoors, Tools, Sports, Baby Products3.00%PC, PC Components, DVD & Blu-Ray2.50%Televisions, Digital Video Games2.00%Amazon Fresh, Physical Video Games & Video Game Consoles, Grocery, Health & Personal Care1.00%Gift Cards; Wireless Service Plans; Alcoholic Beverages; Digital Kindle Products purchased as a subscription; Food prepared and delivered from a restaurant; Amazon Appstore, Prime Now, Amazon Pay Places, or Prime Wardrobe Purchases0.00% If any of your niche ideas fall in the 0% category, cross them off your list. There’s no point in promoting products for no reward. I would also rule out categories with commission rates of 2% or less because it’ll take a lot of traffic to make decent money from those.Sidenote. Amazon’s commission rates have dropped significantly over the past decade or so. The most recent cut came in early 2020, which is what prompted the belief amongst some people that Amazon affiliate sites are dead. That’s not the case. They’re just not as lucrative as they once were. C. Check product pricesGenerally speaking, you’ll make more money on expensive products. For example, if someone buys a $4,000 PC, your 2.5% cut ($100) is going to be way higher than if someone buys some new RAM for $40 ($1). But this doesn’t mean you should enter an expensive niche. People are less impulsive when it comes to high-ticket items, which means that fewer clicks will turn into sales. This is known as your conversion rate. Now, there’s a lot of talk about the sweet spot when it comes to product prices, but the consensus seems to be an average between $30-$300. Go higher, and conversions will start to suffer. Go lower, and your cut will suffer. To get a sense of prices in your niche, search for a few products on Amazon.D. Estimate traffic requirementsNow that you know a bit more about the niche you want to enter, you can use that information to estimate how much traffic to “money pages” you’ll need to hit your monthly financial goal. If you’re not familiar with the term “money pages,” these are just the pages on your site that contain affiliate links. With Amazon affiliate sites, product roundups tend to be the best “money pages.” They’re the ones that list the best products in a category like this list of the best robot vacuums from The Wirecutter: These tend to be the most lucrative pages because they recommend multiple products, and the people searching for them in Google are in buying mode. This leads to a high clickthrough rate (CTR) on affiliate links. So what’s the traffic estimation formula?Monthly goal / (Avg. product price * category commission % * average affiliate link CTR * average conversion rate)Let’s run through an example. Say you want to enter the coffee niche, and your goal is $1,000/month. Having gone through the steps above, you know that the average product price is around $40, and the commission rate for most coffee-related products is 4%. However, you don’t yet know the average clickthrough rate (the percentage of visitors that click an Amazon affiliate click) of your posts, or your Amazon conversion rate (the percentage of clicks that turn into sales). So let’s be pessimistic and assume a 10% CTR and a 7.5% conversion rate. Let’s plug everything into the calculation:1,000 / (40 * 4% * 10% * 7.5%) = 83,333Looks like we’ll need ~83k monthly visits to “money” pages to earn $1,000/month. Of course, this is far from an exact science. We used pessimistic numbers for a reason.E. Estimate traffic potentialNow that you know how much traffic you need to make the numbers work, you need to estimate whether the niche has enough search traffic potential. Here’s an easy way to do this: Install and activate Ahrefs’ SEO toolbar, then search Google for: best [product in your niche] inurl:best For example, in the coffee niche, our search might be this: If you’re wondering what the inurl:best part of that search does, it restricts the search results to pages with the word “best” in the URL. You’ll see why it’s important in the next step. From here, eyeball the search results for a niche site that gets at least the amount of traffic you need. The key word there is “niche.” You should ignore any big generic sites like Forbes, The Wirecutter, or The Guardian in the search results. Although they may have tons of traffic, they’re not what you’re looking for. If you don’t see any niche sites, try searching for a different product. Here’s one that fits the bill for our search: Sidenote. Make sure to look at the domain-level traffic here, not the page-level traffic. It gets an estimated ~210,000 monthly US search visits, and we can see from the domain name that it’s a niche site focused on coffee. However, we don’t know how much of this traffic is going to “money” pages. If most of it goes to irrelevant blog posts, that doesn’t bode well for us. Luckily, we can get a better sense of “money” page traffic using Ahrefs’ Site Explorer. Just paste in the domain, go to the Top Pages report, add the word “best” to the Include filter, and choose “URLs” from the “Any target” dropdown. You should end up with a filtered report of almost entirely product roundup posts. At the top, you’ll see the total estimated monthly search traffic to all pages in the filtered report. In our case, it’s 107,714. You’ll recall that we estimated ~83k monthly visitors to hit $1K/month, so it looks like this niche easily meets our traffic potential requirements.F. Estimate competitionThere’s no point entering a niche where you’ll struggle to hit your traffic goal for years. So you need to make sure that there are some topics you can crack without too much SEO grunt work. SEO is a complicated game. There are many ranking factors and best practices. But one of the most important is the number of high-quality backlinks to your pages. Google talks about the importance of backlinks on their page about search algorithms. We also saw a clear correlation between the number of backlinks from unique websites (referring domains) to a page and its search traffic in our study of over one billion webpages. So before you close the filtered Top pages report from the previous step, eyeball the RDs column. This shows the number of referring domains to each page. If you see pages with organic traffic that have few or no referring domains, that’s a sign of an uncompetitive topic. Looking at the report for Homegrounds, we see plenty of pages like this: If we do the same for wareable.com, we see the opposite. Almost every page has links from tens or hundreds of referring domains, which indicates that many of the topics in this niche are tough nuts to crack. You have two options in this case:Niche down further. Instead of just wearables, we might want to focus on just smartwatches or fitness trackers. And if those niches are still too broad, you can niche down even further to something like smartwatches for kids.Choose a different niche. If niching down doesn’t interest you, scrap the idea and repeat the steps above for another niche.2. Do keyword researchFinding a niche with potential was the hard part; keyword research is comparatively easy. If you’re feeling lazy, you could even just export the filtered Top Pages report from the previous step. That should give you enough profitable “product roundup” topics to keep you busy for a few months. However, if you want to be more strategic and find more keywords, do this:Go to Ahrefs’ Keywords Explorer;Enter a handful of “seed” keywords related to the niche and its products (separated by commas);Go to the “All keywords” report.Here’s what that might look like if we wanted to enter the coffee niche: You’ll most likely see hundreds of thousands of keywords in this report, but there will be a lot of irrelevant ones. So we’re going to use the inbuilt filters to find the three types of keywords we need.A. Finding product roundup keywordsJust to reiterate, product roundup keywords (e.g., “best coffee machine,” “best coffee grinder”) are usually the big money-makers with Amazon affiliate websites. So, we want to find product roundup keywords that have traffic potential and aren’t too hard to rank for. To do that, add these three filters:Include: “best”Keyword Difficulty (KD): <=10Volume: >=500Sidenote. Feel free to be more or less lenient with the volume threshold. This number is somewhat niche-dependent. You should see a list of relevant, low-difficulty keywords sorted by their monthly search volumes. Now, it’s important to note that Keyword Difficulty (KD) only gives you a rough indication of ranking difficulty. And monthly search volume only gives a rough indication of a topic’s traffic potential. So what you need to do next is sift through the report, analyze the keywords one by one, and save any good topics to a keyword list. Don’t worry if there are thousands of keywords. You don’t need to analyze all of them. You only need 20-50 good keywords to get started. So, what’s the process? Before we get to the technical stuff, it’s important to understand that you need to apply common sense when looking for keywords. If the keyword is “best coffee grinder” then that makes sense because it’s a product Amazon sells. If it’s unrelated to something you might buy on Amazon, like “best coffee in los angeles,” then you can rule that out right away. For the keywords that make sense, click the SERP button to see the current top-ranking pages in Google… … then follow this flowchart: Before we go any further, we need to briefly explain the concept of Domain Rating. Domain Rating (DR) measures a website’s authority based on its backlink profile. The scale runs from zero to a hundred. Generally speaking, the higher this number, the stronger and more authoritative the site is. This is part of our process because we’re looking for keywords that we can rank for with a new or relatively new site, which will be low “authority.” If there are already low-authority sites ranking, then that’s a good sign that we can rank. Here’s an example of a good keyword: The highlighted page has four referring domains, gets a few hundred US search visits per month, and is on a topical, low-authority (DR) website. Here’s a not so good example: While there are a couple of pages in the results with few referring domains on low-authority niche websites, none of them get more than a handful of search visits per month. Here’s how to add a keyword to a keyword list once you find a winner: Keep doing this until you have a list of 20-50 keywords.B. Find product review keywordsProduct review keywords are those like “aeropress review” and “baratza virtuoso review.” Although things vary from niche to niche, these keywords rarely have anywhere near the traffic potential of product roundup keywords. You’ll probably only find a handful worth ranking for. So why bother with them? Two main reasons:They’re often low-hanging opportunities, even if the traffic potential isn’t huge.Product reviews can help boost SEO for product roundups (more on this later)To find these keywords, add these filters to the “All keywords” report:Include: “review”KD: <=10Volume: >=200Here’s what we see for our coffee example: Not all of these are product review-type keywords, but you can spot them pretty easily. For the ones that make sense, run through the flowchart above and add winners to a new keyword list.C. Find blog keywordsMost Amazon affiliate sites don’t only publish “money” posts. They also publish blog posts and other informational content. Just look at homegrounds.co: They have an entire section of their site dedicated to helpful brewing guides. There are a couple of reasons this is helpful, and we’ll go into those later. For now, we want to find some informational keywords that we can write blog posts and guides about. To find these keywords, add these filters to the “All keywords” report:Include: who, what, when, where, why, how, guide, tutorial, ideas, tipsVolume: >=500Look for topics that are closely related to the products you’ll review in your product roundups. For example, if your niche is coffee, then topics like “how to use a french press” and “how to make coffee” make perfect sense because you’ll almost certainly be reviewing french presses and coffee machines. Don’t overthink this part. Just add 20-50 keywords to a list and keep moving.3. Create the right kind of contentAssuming that you’ve chosen a domain and put up a website, it’s time to start writing and publishing some content. In this section, we’ll talk about how to create three types of content:Product roundupsProduct reviewsBlog postsLet’s start with the important one.A. Product roundupsFollow these four steps:Figure out which products to includeFigure out what people care aboutFigure out which products are the bestWrite it up1. Figure out which products to includeProduct roundups review multiple products, but how do you know which products to review? Here are a couple of ways:Look on AmazonLet’s face it: Amazon does a pretty good job of recommending the best products. Just look at the top few results for “coffee grinder”: All of them have hundreds or thousands of reviews, and none of them are rated lower than four stars. So a good way to get some idea of products you might want to take for a spin is just to search for the type of product on Amazon.Look at the top-ranking pagesLooking at Amazon is a good starting point, but it can be overwhelming. Another good tactic is to look for common inclusions amongst the top-ranking pages. For example, three of the top results for “best coffee grinder” mention the Baratza Encore Conical Grinder as one of the best: It doesn’t take a genius to work out that this would be worth reviewing in a roundup.2. Figure out what people care aboutTo create a useful product roundup, you first need to know what product attributes matter to buyers. Here are a few ways to figure that out:Look at Amazon reviewsLook at a few of the products you’re likely to include in your post and check the reviews. You’ll soon start to get a sense of the things that matter to buyers. For example, within seconds of looking at the review below, it’s clear that grind coarseness, ease of cleaning, and portability are all important factors when choosing a manual coffee grinder: If you don’t fancy looking through every single review, check the tags in the “Read reviews that mention” section. Amazon pulls these from reviews, and they’re often indicative of the things many people care about.Look at the top-ranking pagesSkim a few of the top-ranking pages and look for commonalities. For example, both of these coffee grinder roundups talk about grind consistency: Run a content gap analysisA content gap analysis shows keywords that multiple pages rank for. By doing this for some of the top-ranking pages for your target keyword, you’ll get further insight into the kinds of things people want to know. To perform the analysis, paste a few of the top-ranking URLs into Ahrefs’ Content Gap tool. If we do this for three top-ranking pages for “best coffee grinder,” we see that they’re ranking for keywords related to coffee grinder types: burr grinder, manual coffee grinder, hand grinder, electric grinder, etc. We also see that people are searching for the best grinder based on coffee type: espresso, french press, etc. Build quality and material seem to be important too. We’ll want to take these things into account when writing our post and researching or testing products.3. Figure out which products are the bestMost people who start Amazon affiliate sites don’t test products themselves. Instead, they research the products online and pull points from other reviews. Although you can go down this path, it’s not what we recommend for a couple of reasons:Testing products helps you stand out from the crowd, establish E-A-T, and makes life easier when it comes to link building.The web is rife with “me too” affiliate posts that pull points from other articles—and they’re rarely that useful for searchers.So, if you want to create a truly useful site with longevity, and can afford to do so, it’s worth reviewing products for real. Here are a few ideas to keep costs down:Start with cheap products. It won’t be cheap to test ten $500 coffee machines yourself, but ten $30 coffee grinders might be doable. Look through your keywords list and start with the lower-cost products.Sell them once you’re done. Nobody needs ten coffee grinders. Once you’ve reviewed them, pop them on eBay. Even if you lose 25% on the purchase price, it’s a small price to pay for truly unique and useful content.Ask manufacturers for review models. Don’t hold your breath with this one—especially if you’re new to the game and have no reputation.4. Write it upProduct roundups aren’t like normal blog posts. You need to give people the information they came for right off the bat. In the case of product roundups, this is the winning product. For that reason, you should create a list post using the Inverted Pyramid format. Learn more about that here.B. Review postsMuch of the advice above for product roundups also applies to individual product reviews. You need to know what people care about and want to know, and you need to research the product thoroughly. That said, it’s usually best to write individual product reviews in conjunction with a product roundup post. Why? Because when you create a product roundup post, what you’re essentially doing is reviewing multiple products at once. It’s just that product roundups summarize each product instead of going into detail. But the point is this: you’ve got to research the products to create the product roundup, so you might as well publish that research in an individual product review. Here are a few other reasons this approach makes sense:Reviews are relative. Let’s say that you review one coffee grinder. Unless you’re researching or testing it alongside other similar products, how will you know how good or bad it really is? You could easily give the product five stars only to realize that it was quite poor compared to other similarly-priced products on the market.Possible SEO boosts. Publishing individual product reviews that tie back to a published product roundup may help SEO. (More on this in the next section)Easier to format/templatize. Researching products for a roundup will teach you what people care about. You can use this knowledge to create a template for review posts.Let’s focus on that last point. If you’ve created a product roundup about the best coffee grinders, you’ll already know that grind consistency and ease of use are attributes that people care about. Knowing that makes it easy to templatize a review style for all products in this category. Just use those things as subheadings and give each product a relative 1-5 score on each point. See these two posts, for example. Because you’re using a consistent format for each product review, and already did your research when creating the product roundup, it shouldn’t take too much time to create these posts.C. Blog postsWriting good blog posts is a whole other topic in itself. Luckily, we have plenty of guides about how to write blog posts so instead of going into this here, I’ll just link up some useful posts below: Further readingHow to Write a Blog Post in 9 Steps (That People Actually Want to Read)23 Beginner Blogging Tips to Get Better at Blogging (Fast) What is SEO Content? How to Write Content that Ranks How to Outsource Your Content to Freelance Writers (4 Steps)4. Drive traffic to your site through SEOSEO isn’t rocket science, but it’s also not something that we can summarize from start-to-finish in this post. There are just too many elements. Instead, I’m going to talk about two important aspects to focus on, then link up some SEO tutorials from the blog.A. Create content hubsContent hubs are interlinked collections of content about a similar topic. They consist of three parts:Hub page/pillar content: This is a high-level guide about a broad topic.Subpages/cluster content: These are in-depth guides about parts of the main topic.Hyperlinks: These connect the hub page and subpages. The hub page links to all the subpages, and each subpage links back to the hub. For Amazon affiliate sites, a good tactic is to create content hubs where the product roundup is the hub page, and the product reviews are the subpages. There are a couple of main benefits to these from an SEO perspective. First, they lead to more keyword-rich internal links between your “money” pages. Because Google uses internal link anchor text to help understand what pages are about, it may help boost rankings.Second, all pages in the hub benefit from each other’s backlinks because of how PageRank works. How do you build them?Choose a product roundup post;Link to individual product reviews for mentioned products;Link back to the product roundup post from those reviewsFor example, say you wanted to create a content hub around a product roundup for “best coffee grinders.” If you’ve already written reviews for some of the products mentioned on the list, just link to them from the hub page and vice-versa. Here’s a real-life example: One of the products on this list of the best coffee grinders is the Baratza Virtuoso Plus. In the brief description, there’s a link to the full review of that product. In the product review, they link back to the product roundup. If you do this for all the products in the roundup, then you have a hub.B. Build linksBacklinks are arguably the most important Google ranking factor. They’re the foundation of Google’s ranking algorithm, and multiple independent studies have found strong correlations between the number of backlinks from unique websites and a page’s organic traffic. For Amazon affiliate sites, you want to try to build links directly to “money” pages like product roundups and product reviews. There are lots of ways to do this, but here’s just one idea: Product roundups review a particular type of product. It might be coffee grinders, standing desks, WiFi routers, etc. Think about the purpose of that product and ask yourself, what does it help the people to do? Here are some examples:Coffee grinder -> helps people make better coffeeStanding desk -> helps people be healthier when working from homeWiFi router -> helps people stay more secure onlineNow you’ve established a product benefit, look for blog posts about achieving that benefit that also mention your product. You can then reach out and suggest that they link to your product roundup to help their readers choose the best product for them. Let me explain with an example. If we Google “how to stay healthy when working from home,” pretty much all of the results are blog posts with tips. But we don’t know whether they mention using a standing desk or not, so let’s use a Google search operator to include results that mention the phrase “standing desk.” 9.4 million results. Here’s just one of them: While this article recommends a particular standing desk model, readers would clearly benefit from some choice. So it would be useful if the post linked to a list of the best standing desks like this one. Therefore, it would make sense for us to pitch our comparison of the best standing desks for inclusion in this article. Here’s an example email:Hey [name], Just came across your guide to staying fit and healthy as a remote worker. Loved the tip about standing desks, and I agree that the Jarvis is a great option. However, I spent XX hours testing XX standing desks and found that the Jarvis is actually quite expensive for what it is, and that [other model] is almost as good for less money. Perhaps it might be worth including my comparison to give readers some extra choice? [link] Thanks, [name]If you send similar emails to a few dozen people, that should gain you some quality links to your product roundups. But, again, this is only one idea. Check out the posts below for more link building strategies:Further readingHow to Execute the Skyscraper Technique (and Get Results)Guest Blogging for SEO: How to Build High-quality Links at ScaleResource Page Link Building: The Only Guide You NeedA Simple (But Complete) Guide to Broken Link BuildingStruggling to build links directly to ‘money’ pages? Create blog posts and other useful content about related topics, then use the Middleman Technique to give them a boost. 5. Drive clicksDriving clicks to Amazon is the name of the game if you want to make money because of the 24-hour cookie duration. I’m not going to go into great detail here because conversion rate optimization isn’t something you should obsess over if you’re just starting out. However, you need to make sure you have the basics covered, which are:Place a recommendation table early-on. Recommendation tables list and link to the top-recommended products in product roundup posts. They should be near the top of the post because you want people to be able to find the information they came for quickly.Use prominent Amazon links. Buttons that stand out from your site design tend to be best.Give people a reason to trust you. The faster you can do this, the better. The Wirecutter’s approach is probably the gold standard here. Just take a look at any of their intros.Once you’re getting a decent amount of traffic to your site, check out the resources below to make sure you’re getting all the clicks you can. Further readingHow To Do Conversion Rate Optimization On Your Affiliate Site (Step By Step Guide)17 Strategies to Boost the Conversion Rate for Amazon Affiliate Niche and Authority SitesHow To Do Conversion Rate Optimization On Your Amazon Niche SiteFinal thoughtsBuilding an Amazon affiliate site is still a great way to get started with affiliate marketing, despite the recent commission cuts. That said, once you get a decent amount of traffic, it’s worth looking into other affiliate programs that may offer higher commissions on the same products. Although Amazon usually converts the highest, it’s still often possible to increase earnings by joining other affiliate programs thanks to higher commission rates. Got questions? Ping me on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Keep Learning 7 Successful Amazon Affiliate Websites (That You Can Learn From) Looking for inspirational Amazon affiliate sites? Here are 7 successful examples and how to replicate their success. Affiliate Marketing For Beginners: What It Is + How to Succeed Affiliate marketing is where you promote other companies' products to earn a commission. Learn how to get started in 7 simple steps. How to Become an Affiliate Marketer (5 Steps) What to know to get started? How much does it cost? How long does it take to actually make money? Find out all the answers in this guide. Here’s How Much You Can Really Make From Affiliate Marketing Affiliate managers, business owners, freelancers. There are many ways to be involved in affiliate marketing. Find out how lucrative it is. 9 Best Affiliate Programs for Beginners (Any Niche) Choose from these simple and easy-to-use affiliate programs and networks that you can get up and running in just minutes.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Build a Successful Amazon Affiliate Site (Step by Step)"
    },
    {
      "level": "H2",
      "text": "What is the Amazon affiliate program?"
    },
    {
      "level": "H2",
      "text": "How Amazon’s affiliate program works"
    },
    {
      "level": "H2",
      "text": "How to become an Amazon Affiliate"
    },
    {
      "level": "H2",
      "text": "What is an Amazon affiliate site?"
    },
    {
      "level": "H2",
      "text": "Why SEO is the secret to a successful Amazon affiliate site"
    },
    {
      "level": "H2",
      "text": "How to build a successful Amazon affiliate site"
    },
    {
      "level": "H3",
      "text": "1. Choose a good niche"
    },
    {
      "level": "H4",
      "text": "A. Find something you’re interested in"
    },
    {
      "level": "H4",
      "text": "B. Check commission rates"
    },
    {
      "level": "H4",
      "text": "C. Check product prices"
    },
    {
      "level": "H4",
      "text": ""
    },
    {
      "level": "H4",
      "text": "D. Estimate traffic requirements"
    },
    {
      "level": "H4",
      "text": "E. Estimate traffic potential"
    },
    {
      "level": "H4",
      "text": "F. Estimate competition"
    },
    {
      "level": "H3",
      "text": "2. Do keyword research"
    },
    {
      "level": "H4",
      "text": "A. Finding product roundup keywords"
    },
    {
      "level": "H4",
      "text": "B. Find product review keywords"
    },
    {
      "level": "H4",
      "text": "C. Find blog keywords"
    },
    {
      "level": "H3",
      "text": "3. Create the right kind of content"
    },
    {
      "level": "H4",
      "text": "A. Product roundups"
    },
    {
      "level": "H5",
      "text": "1. Figure out which products to include"
    },
    {
      "level": "H6",
      "text": "Look on Amazon"
    },
    {
      "level": "H6",
      "text": "Look at the top-ranking pages"
    },
    {
      "level": "H5",
      "text": "2. Figure out what people care about"
    },
    {
      "level": "H6",
      "text": "Look at Amazon reviews"
    },
    {
      "level": "H6",
      "text": "Look at the top-ranking pages"
    },
    {
      "level": "H6",
      "text": "Run a content gap analysis"
    },
    {
      "level": "H5",
      "text": "3. Figure out which products are the best"
    },
    {
      "level": "H5",
      "text": "4. Write it up"
    },
    {
      "level": "H4",
      "text": "B. Review posts"
    },
    {
      "level": "H4",
      "text": "C. Blog posts"
    },
    {
      "level": "H3",
      "text": "4. Drive traffic to your site through SEO"
    },
    {
      "level": "H4",
      "text": "A. Create content hubs"
    },
    {
      "level": "H4",
      "text": "B. Build links"
    },
    {
      "level": "H3",
      "text": "5. Drive clicks"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Joshua Hardwick"
}