{
  "url": "https://ahrefs.com/blog/awt-website-crawler/",
  "slug": "awt-website-crawler",
  "title": "A Free Website Crawler from Ahrefs",
  "description": "For smaller websites with up to a few hundred pages, you’re likely using tools like Screaming Frog, Seobility, or WebSite Auditor, with Screaming Frog",
  "content": "Nick Churick Nick is one of our Product Marketers and coincidentally he's also a pretty skilled writer. So there you have it - he's now a regular contributor to our blog. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents If you own or manage a small website and have some knowledge of SEO, you’re likely using website crawler software (aka SEO crawler) to audit and monitor your site. For smaller websites with up to a few hundred pages, you’re likely using tools like Screaming Frog, Seobility, or WebSite Auditor, with Screaming Frog being arguably the most popular.The search volume data from Ahrefs’ Keywords ExplorerSo why would you even consider an alternative?Let’s be honest: nearly every free site crawler does a pretty decent job at identifying fundamental SEO issues for small websites, such as broken links between pages, problematic titles and descriptions, or slow pages.However, if you want to detect more advanced SEO issues or need to crawl a larger website, you’d need a paid SEO audit tool.…unless you’re using the Ahrefs Webmaster Tools (aka AWT).Here’s why the Site Audit in AWT beats any other other free (and often even premium) website crawler:5,000 crawled pages per project per month (with unlimited projects)Runs in the cloud and has a web interfaceUser-friendly interfacePro-level customizability of issues and crawlsAutomated scheduled crawls with email alerts3 months of crawl historyCrawl comparisonBacklink metricsOrganic traffic metricsAnd so much more!Sidenote. There’s one important thing to note: the free Ahrefs Webmaster Tools only work for websites where you can prove ownership. You won’t be able to audit a client’s website with no access to it. You’ll need at least the Starter plan with Ahrefs to do this. Now, let me introduce the unique features of Ahrefs Webmaster Tools that you won’t find in any other free SEO checker:1. Generous crawl limitsTo my knowledge, no other free SEO crawler offers such generous limits.SEO CrawlerLimitsScreaming Frog500/crawlWebsite Auditor: 500 per crawl500/crawlSEOBility1,000/crawlAhrefs Webmaster Tools (AWT)5,000/monthYou get 5,000 crawl credits per project per month.These credits are spent on crawling HTML pages only. Redirects, images, and external URLs don’t even count.This means you can crawl a 300-page website every second day. For example, the English part of the Ahrefs Blog could be fully crawled 4 times per month with 5,000 crawl credits. 2. User-friendly reportsDespite its popularity, Screaming Frog has a bit of a learning curve. It can take quite some time to get used to their Excel-2001-styled spreadsheet reports or even to find the “Issues” report in the first place.The Site Audit in AWT has an informative Overview page. It features a clearly visible health score that indicates the number of important issues on your website and a list of the top issues.Unlike many other SEO crawlers, the Site Audit in AWT provides an explanation of the detected issue and a brief recommendation on how to fix it.3. Customizable issuesThe Site Audit in Ahrefs Webmaster Tools checks your website for over 170 potential technical and on page SEO issues that can harm your website’s performance in search results.These issues are categorized by their importance into three categories:ErrorsWarningsNoticesThis is typical for many SEO audit tools, although most of them report much fewer issues.The preview of the issues report in the OverviewOne unique feature of Ahrefs Webmaster Tools is the ability to customize the criteria that trigger issues and even create new ones based on your priorities.For instance, if you disagree with our recommended Title tag character limit, you can easily modify it to suit your preferences. The wide range of data points available for pages and links enables you to create custom issues that extend far beyond the default set.For example, I’ve set up an alert for my project that notifies me whenever someone edits a page to insert an external link. This allows me to react quickly if one of the writers adds a link to an unintended website or even if the website is hacked for the purpose of link injections. And if you find the 170+ predetermined SEO issues overwhelming, you can simply disable any of them at the project level. 4. Cloud-based crawlingScreaming Frog is a classic tool for website audits. Even its free version, limited to 500 pages per crawl, can satisfy the needs of many webmasters and SEOs.However, it must be installed on your PC or laptop, using your computer’s resources and Internet connection.Another serious drawback is that the free version doesn’t allow you to save a crawl to revisit it later. The same limitation applies to WebsiteAuditor.With Ahrefs Webmaster Tools, the crawl runs in the cloud, meaning you can start it and access the results from any location at any time – even from your smartphone. Sidenote. Seobility is the only free cloud-based SEO crawler with decent limits that I know of. However, they only show a fraction of data in their reports, hiding ~90% behind a paywall. 5. Three months of history and side-by-side crawl comparisonIn Ahrefs Webmaster Tools, SEO audit crawl data is stored on our servers for three months.The list of recent crawls for one of my projects.This allows you to access crawls anytime, from anywhere, enabling you to compare them and track which aspects of your website’s SEO have improved or declined over time. Check the Change column for significant deviations.The changes in the SEO issues between the two crawlsThis is particularly useful when you need to investigate the cause of an issue and determine when it occurred.The number of pages affected by an issue over time6. Page history and code/text comparisonOur SiteAudit bot crawls and stores each page’s HTML code and text, allowing you to see changes in a single page between two crawls.The comparison feature highlights what has been added, removed, or edited in terms of raw HTML, rendered HTML, or page text.For example, we’ve recently updated our “Top Google Searches” page on our blog to increase its chances of ranking higher. By using the comparison feature under the View source tab, I can access the older version if I want to restore it or see exactly what was changed.Viewing the changes in the page content.Sidenote. Here, I need to take a moment to remind you that we’re still talking about a 100% free tool! 7. Integrated SEO metricsIn AWT, you can view the most important SEO metrics for every URL crawled, such as:Organic search trafficThe number of raking keywordsTop keywordThe number of backlinksAnd so onThese metrics, integrated into the report tables, can help you prioritize your efforts in addressing SEO issues. Pages with the highest traffic and those ranking for the most important keywords typically require your immediate attention.We’ve also added notifications about drops in traffic and search rankings to the audit results so you can monitor content decay proactively and reverse-engineer what caused the drop in the first place.8. Internal link opportunitiesThis is one of the more advanced features and may require some explanation.Internal links can significantly influence search rankings:They boost the internal “importance” of a page on your website, which can influence the page rankings and crawl priority.With relevant anchor texts, they signal the topic of the page to Google.But let’s face it, finding relevant pages for internal linking can be quite time-consuming. Not if you’re using AWT!Our site audit analyzes the top 10 keywords for which each page on your site ranks and then searches for mentions of these exact terms on all crawled pages.Based on this data, you’ll receive automatic recommendations for internal links between the pages on your website.9. A steady flow of new helpful featuresWe’re constantly improving all our products, and the free Ahrefs Webmaster Tools are no exception.The two upcoming features we’re most excited about are:Always-on audit will allow you to monitor and recrawl selected pages of your site with no need to run a complete website crawl every time.Patches are intended to give you an opportunity to fix some on-page SEO issues straight from the Site Audit reports - no developers needed.Wrapping it upThere’s so much more Ahrefs Webmaster Tools can do for you that I didn’t cover to avoid overwhelming you, such as:SegmentationStructured data checksLocalization issuesContent duplicationBacklink analysisAnd moreWith all these incredibly useful features, AWT is 100% free, with no hidden fees, so just give it a try.Just remember, you can only use it on websites that you own or manage. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Nick Churick Nick is one of our Product Marketers and coincidentally he's also a pretty skilled writer. So there you have it - he's now a regular contributor to our blog.",
  "headers": [
    {
      "level": "H1",
      "text": "The Game-Changer in Free Website Crawlers You Need to Know About"
    },
    {
      "level": "H2",
      "text": "1. Generous crawl limits"
    },
    {
      "level": "H2",
      "text": "2. User-friendly reports"
    },
    {
      "level": "H2",
      "text": "3. Customizable issues"
    },
    {
      "level": "H2",
      "text": "4. Cloud-based crawling"
    },
    {
      "level": "H2",
      "text": "5. Three months of history and side-by-side crawl comparison"
    },
    {
      "level": "H2",
      "text": "6. Page history and code/text comparison"
    },
    {
      "level": "H2",
      "text": "7. Integrated SEO metrics"
    },
    {
      "level": "H2",
      "text": "8. Internal link opportunities"
    },
    {
      "level": "H2",
      "text": "9. A steady flow of new helpful features"
    },
    {
      "level": "H2",
      "text": "Wrapping it up"
    }
  ],
  "author": "Nick Churick"
}