{
  "url": "https://ahrefs.com/blog/best-marketing-podcasts/",
  "slug": "best-marketing-podcasts",
  "title": "12 Best Marketing Podcasts in 2024",
  "description": "From Neil Patel's Marketing School to Seth Godin's Akimbo, here's what made our list of top marketing podcasts for marketers of all levels.",
  "content": "Rebecca Liew Content marketer and writer. Addicted to words, stationery, and exploring new places on foot. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents What makes one marketing podcast better than the next?Its ability to get me thinking—and when its hosts are equal parts entertaining and knowledgeable.To choose my favorites, I unearthed some marketing podcast playlists on Spotify, then gave each of them a listen. I also tuned in to popular series, such as Neil Patel’s Marketing School, during my commutes.Here’s what made the cut, in no particular order (remember to cast your vote!):Contents1. Ahrefs PodcastHost: Tim SouloTopics: SEO, marketingFrequency: It varies 🙂Avg. episode time: 90 minsWebsite: Ahrefs PodcastListen on: Spotify, Apple Podcasts, YouTube, Amazon Music, AudibleLooking to learn from the brightest minds in online business and digital marketing? Ahrefs Podcast is for you!In each episode, Tim Soulo (Ahrefs’ CMO) interviews one smart marketer, digging into their career, philosophy, goals, and more. Season one features interviews with Rand Fishkin, Peep Laja, Dom Wells, Adam Singer, Laura Roeder, and David Fallerme. We’re obviously super biased here, but we think it’s one of the best SEO and marketing podcasts there is! 😉 2. Everyone Hates MarketersHost: Louis GrenierTopics: Marketing, branding, product marketing, marketing psychology, content marketing, CROFrequency: WeeklyWebsite: Swipe FilesListen on: Spotify, Apple PodcastsFamed entrepreneur Gary Vaynerchuk may have made a good point when he said marketers ruin everything.But marketing doesn’t deserve its bad rep, and HotJar alumnus Louis Grenier is determined to change that through Everyone Hates Marketers.His weekly episodes cover evergreen topics such as customer research, marketing strategy, and brand positioning—with the aim of teaching marketers how to generate solid results without resorting to sleazy, spammy tactics.Past guests include Joe Glover of online community The Marketing Meetup and Rand Fishkin, founder of market research tool SparkToro and co-founder of Moz. 3. Marketing SchoolHosts: Neil Patel, Eric SiuTopics: All things marketingFrequency: Daily Website: MarketingSchool.ioListen on: Spotify, Apple PodcastsIn this podcast, Neil Patel and Eric Siu—CEO of marketing agency Single Grain—tackle all manner of marketing topics.What’s impressive is that they’ve over 1,900 episodes under their belt, with each lasting roughly six minutes or less. This makes the episodes digestible and easy to listen to on the go.I particularly like how on-trend and timely the podcast is. In recent episodes, the duo discusses NFTs in relation to marketing and why Web3 is the future of marketing.It’s a great way to stay on the pulse of trends. Plus, the information learned makes for an excellent conversation starter. 4. Perpetual TrafficHosts: Ralph Burns, Kaslim AslamTopics: Paid marketing, social media, content marketing, SEOFrequency: Twice weeklyWebsite: Perpetual TrafficListen on: Spotify, Apple PodcastsAs its name suggests, Perpetual Traffic focuses on how to drive more traffic to your business. The podcast covers all things related to digital marketing, including Facebook ads and social media marketing, SEO, and how to sell high-ticket products.If you’re feeling overwhelmed by the 300+ episodes in the podcast’s repository, we recommend starting with this one. In it, Ahrefs’ Michal Pecánek discusses how the company employed SEO strategies to set up its Wikipedia page. 5. Niche PursuitsHost: Spencer HawsTopics: Affiliate marketing, SEOFrequency: Every 7-10 days Website: Niche PursuitsListen on: Spotify, Apple PodcastsIf you’re interested in learning how to earn money through niche affiliate websites, make Niche Pursuits your go-to podcast.In each episode that roughly spans 60 minutes, host Spencer Haws chats with a niche site owner about their successes, failures, and tactics.These guest speakers often have wildly similar yet unique stories (oxymoronic, we know!) about growing from 0 to 100K a month or using a job loss as fuel to become a successful affiliate marketer.Here’s one that makes for a fun starting point: 6. AkimboHost: Seth GodinTopics: Creativity, cultureFrequency: Weekly Website: AkimboListen on: Spotify, Apple Podcasts Author and marketer Seth Godin is a household name. In his soothing podcast series, he invites listeners to consider the influence of culture on their lives and how they can change things.Seth is well positioned to answer these questions too, given he’s penned a slew of popular titles, including “This Is Marketing” and “Permission Marketing.”But don’t expect to pick up marketing tips or strategies; rather, each episode challenges your beliefs and encourages you to think differently. These are important and underrated skills you can use in marketing, and you’d do well starting here: 7. The Digital Marketing PodcastHosts: Ciaran Rogers, Daniel RowlesTopics: All things digital marketingFrequency: WeeklyWebsite: Digital Marketing PodcastListen on: Spotify, Apple PodcastsThis ad-free podcast began over a decade ago, so there’s plenty of content to sift through. But first, a backgrounder: Daniel Rowles is a speaker and CEO of online learning platform Target Internet, and Ciaran Rogers is a digital marketing specialist and trainer.Collectively, their banter and insightful discussions make for an entertaining listen. Some recent topics explored include app store optimization, audience intelligence tools, and my personal favorite: the toxicity of social media, featuring a case study of global beauty brand Lush.Here’s a recent episode to get you started: 8. The Smart Marketer PodcastHosts: Molly Pittman, Ezra Firestone, John GrimshawTopics: Social media marketing, digital marketing, content marketing, email marketingFrequency: Weekly to twice weeklyWebsite: Smart MarketerListen on: Spotify, Apple PodcastsThe name of this podcast sounds like a bold claim. But thankfully, each episode always leaves me feeling a little smarter.Hosts Molly Pittman, Ezra Firestone, and John Grimshaw are veteran marketers and educators in their own right, so you can expect lots of personal sharing on how they each found success.But their conversations can get fairly technical. Past episodes have explored paid ad strategies, business book recommendations, and email marketing strategies. Hence, we think this podcast is a better fit for mid-level marketers and up. 9. Duct Tape Marketing PodcastHost: John JantschTopics: Branding, content marketing, entrepreneurship, SEOFrequency: Twice weeklyWebsite: Duct Tape Marketing PodcastListen on: Spotify, Apple PodcastsJohn Jantsch is quite the influencer, as you may know. And his podcast series is an extension of his consultancy firm, Duct Tape Marketing.Each episode spans around 15 minutes and focuses mostly on business marketing tips, tactics, and resources, such as:Building a strategic partner network.Branding with purpose.Creative ways to fuel your referral engine.These discussions, along with the slew of influential guest speakers like Seth (who made an appearance in our previous entry) and Kara Goldin, make the show worth every minute. 10. The Martech PodcastHost: Benjamin Shapiro Topics: SEO, tech SEO, content marketing, mobile app marketingFrequency: DailyWebsite: MarTechPodListen on: Spotify, Apple PodcastsBenjamin, whom we mentioned earlier, is kinda obsessed with marketing. In addition to The Martech Podcast, he also hosts Voices of Search, which we featured in our best SEO podcasts roundup.This series is useful if you’re interested in growing your general marketing knowledge. Expect to pick up tips on boosting your content production strategy through SaaS, scaling business operations, and mobile app marketing.Despite the technical nature of these topics, each episode is suitable for even “green” marketers and opens with a “Marketing Minute” segment featuring a 60-second speed chat with an industry expert.Have a listen here: 11. Marketing SpeakHost: Stephan Spencer Topics: SEO, digital marketing, content marketing, copywritingFrequency: WeeklyWebsite: Marketing SpeakListen on: Spotify, Apple Podcasts, YouTube MusicStephan Spencer is a knowledgeable SEO, author, and strategist. Naturally, his expertise is aptly displayed in his podcast.You’ll find over 250 hours’ worth of content, with each episode averaging 60 minutes. Some general topics covered include how to master content marketing, SEO strategies, and storytelling in video marketing.A roster of great guests has been featured on the show, from Eli Schwartz discussing the art of product-led SEO to growth marketer Dennis Goedegebuure’s deep dive into data-driven storytelling in marketing. 12. My First MillionHosts: Shaan Puri, Sam ParrTopics: Entrepreneurship, general marketingFrequency: Twice weeklyWebsite: MFMPodListen on: Spotify, Apple Podcasts, YouTube Music, YouTubeWhile not strictly marketing focused, we like the conversations on successful entrepreneurs in My First Million. A plus point: It’s produced by The Hustle, the well-loved business and tech newsletter (which HubSpot later acquired) founded by co-host Sam Parr. Final thoughtsAs an alternative podcast strategy, pick out an industry expert you admire and do a little sleuthing to find the podcasts they’ve guest-spoken on. This way, you can easily learn from someone you respect.Did I miss any good marketing podcasts? Ping me on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Rebecca Liew Content marketer and writer. Addicted to words, stationery, and exploring new places on foot. Keep Learning 17 Free Online Marketing Courses to Learn Digital Marketing After evaluating over 100+ free digital marketing courses, here are the 17 that made the cut. 12 Essential Marketing Analytics Tools for 2024 (Free & Paid) Twelve tools to help identify your best-performing tactics and content, and do more of what works. Marketing KPIs: 30 Metrics for Every Marketing Role Learn how to measure your performance and share your wins. Marketing 101: Marketing Basics in Simple Words Introduction to marketing for small-business owners, solopreneurs, and beginner marketers. In under 15 minutes. Organic Marketing vs. Paid Marketing: What’s the Difference? Organic marketing is attracting traffic to a website without using paid advertising by creating and distributing valuable content.",
  "headers": [
    {
      "level": "H1",
      "text": "12 Best Marketing Podcasts in 2024"
    },
    {
      "level": "H2",
      "text": "1. Ahrefs Podcast"
    },
    {
      "level": "H2",
      "text": "2. Everyone Hates Marketers"
    },
    {
      "level": "H2",
      "text": "3. Marketing School"
    },
    {
      "level": "H2",
      "text": "4. Perpetual Traffic"
    },
    {
      "level": "H2",
      "text": "5. Niche Pursuits"
    },
    {
      "level": "H2",
      "text": "6. Akimbo"
    },
    {
      "level": "H2",
      "text": "7. The Digital Marketing Podcast"
    },
    {
      "level": "H2",
      "text": "8. The Smart Marketer Podcast"
    },
    {
      "level": "H2",
      "text": "9. Duct Tape Marketing Podcast"
    },
    {
      "level": "H2",
      "text": "10. The Martech Podcast"
    },
    {
      "level": "H2",
      "text": "11. Marketing Speak"
    },
    {
      "level": "H2",
      "text": "12. My First Million"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Rebecca Liew"
}