{
  "url": "https://ahrefs.com/blog/best-new-ahrefs-features-2023/",
  "slug": "best-new-ahrefs-features-2023",
  "title": "Best new Ahrefs features & use cases (2023)",
  "description": "Here's our pick of Ahrefs' best new features of 2023 and what they can help you achieve.",
  "content": "Tim Soulo Tim Soulo is CMO at Ahrefs. With over 15 years in the digital marketing industry, Tim is the author of many data-driven studies and actionable marketing frameworks, some of which gained industry-wide recognition. He enjoys challenging conventional marketing knowledge and optimizing for simplicity and efficiency. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents 2023 was an incredibly busy year for us at Ahrefs. We’ve been hard at work upgrading our infrastructure, improving our tools, and releasing tons of new features based on your feedback – fun fact, we had 130+ product updates in the last year alone.That’s quite a number, so we thought we’d pick out some of the best (and our favorite!) new features and show you what they can help you achieve.We’ll be covering:Site Explorer’s Overview 2.0Comparison modeSite structure reportPortfoliosAdvanced backlink filtersINSTANT keyword clusteringSERP comparisonLowest DR keyword filterPage inspect toolTechnical-SEO-nerd-level Site AuditLooker Studio connectorsLet’s get into it.1. Site Explorer > Overview 2.0Overview 2.0 runs on brand new technology, both code and hardware-wise. This upgrade lets us handle large amounts of data with full confidence. That’s why:It loads a lot fasterData is more accurateWe can power new features and widgetsHere are some new capabilities:Show multiple metrics on one graph: perfect for showing correlations to your boss or clients.Compare any metric with competitors: perfect for reporting, as well as client pitches.See and chart “crawled pages”: quickly identify potential index bloat. This also instantly gives you a breakdown of the number of 404s and redirects without having to actually crawl a website.Organic pages widget: instantly get an idea of how search traffic is distributed, how many top-performing pages there are, and how many pages don’t generate any significant traffic.Top organic competitors widget: get an instant visual competitor gap analysis. See the top 5 competitors of your target and how everyone matches up against each other in terms of organic traffic, organic traffic value, and number of pages. Note: the bigger the size of the circle, the more pages a competitor has.Chart notes with Google updates: see Google algorithm updates directly on the Performance chart to cross-reference any changes in organic traffic caused by these updates.Did you know? Graphs in Ahrefs are updated daily. This is crucial because the difference in data granularity can paint a completely different picture depending on the SEO tool you use.2. Comparison modeYou can compare data between any two dates in most Site Explorer 2.0 reports. This is perfect for digging into spikes and dips in traffic or backlinks which happened at any point.3. Site structure reportWith the Site structure report, you get a super visual and intuitive way to understand how a website’s pages are organized, and see which sections of their website bring the most amount of organic search traffic.This report also has Comparison mode, which lets you dig into and uncover incredible insights into any website’s SEO and paid strategies.4. PortfoliosNow, you can group a list of up to 1000 URLs from up to 10 unique domains and track them as a single project to see their aggregated metrics in Site Explorer.“Portfolios” in @ahrefs 🥳You can use our Site Explorer tool on a CUSTOM LIST of URLs or domains!!Check out the quick vid I just recorded: pic.twitter.com/KA86Ha7xy5— Tim Soulo 🇺🇦 (@timsoulo) August 31, 2023 With this, you can:Track your top competitors as a single entity to gain insight into how your industry is doing as a whole in terms of search traffic, how it’s coping with major Google algorithm updates, how it compares to other industries, and so on.Combine multiple “regional” domains to track their performance as a single entity.Create author-specific portfolios if you have multiple authors publishing content on your website. This lets you see which authors are bringing the most search traffic and backlinks, which ones have a higher publishing pace, and so on.Set up client portfolios to create focused reports showing how your portfolio of content on their website has been performing.Create sets of pages for testing on-page SEO tactics. Just set up a portfolio of the pages you’re implementing these tactics on, and track it against a second portfolio of pages in your control group.Do rank tracking on steroids – no need to manually track hundreds of keywords per page when you can create a portfolio of pages, and be shown the thousands of keywords that they rank for.5. Advanced backlink filters + “Best links” filterSince backlink data can get very noisy, Ahrefs offers unmatched backlink data granularity with 65 data points under your control to filter out backlink noise and help you find what you need effectively.These filters are powered by a new cluster of 200k CPU cores, and was a huge change under the hood for us to implement in terms of both software and infrastructure.With these upgrades, you can filter for things like:Search traffic of linking pageTotal website traffic of linking pageKeywords in title/url/anchor/etcAuthor namePlatform & content typeThis is important because links coming from pages with traffic typically tend to be more valuable, while links coming from websites with little to no traffic are generally weak or ineffective.To give you even more control over your data, we’ve added a Best links filter in Overview 2.0 and all backlink-related 2.0 reports that lets you filter for so-called “good” links.The filter is based on a predefined set of parameters, which by default includes referring domains that have a DR of at least 30, traffic of 500 or more, and so on.“Best links” filter in @ahrefs !The backlink data is super noisy. A lot of links aren’t really worth attention, but they steal time from you when doing research and might lead you astray when making decisions.That is why we have created a CUSTOMIZABLE “Best links” filter!… pic.twitter.com/pPlHc1wKAY— Tim Soulo 🇺🇦 (@timsoulo) December 19, 2023 Since so-called “best” links will vary from SEO to SEO, you can configure your own custom settings.In Overview 2.0, this filter also affects backlink-related counts and historical charts like the Referring domains graph. This lets you filter out link noise from all widgets.6. INSTANT keyword clusteringInstantly cluster by parent topic or by terms in all keyword ideas reports in Keywords Explorer, as well as in the keyword list overview.Just one click takes you from 730k+ keyword ideas:To just 43k clusters:This makes your keyword research much faster and more efficient since you can avoid skimming through dozens of keyword variations that mean the same thing. Instead, you can now focus on overarching topics which have all relevant keywords grouped under them.Ahrefs is the only tool that does this kind of clustering instantly. In other SEO tools, you’d need to:Upload keywords in bulk;Set clustering parameters;Wait – a long time!;Pay to get each set of clustered keywords.Keyword clustering in @ahrefs is INSTANT! ⚡️You don’t need to upload the list of keywords and wait ⌛️ until they will be organised into clusters.Here at Ahrefs we’ve already done all the “clustering” on the backend! So you can put your “seed” keyword in and hundreds of… pic.twitter.com/9RkdP7wtVw— Tim Soulo 🇺🇦 (@timsoulo) October 4, 2023 7. SERP comparisonThe SERP comparison feature in Keywords Explorer lets you:See how the SERP for a given keyword has changed over time. Dig into the winners and losers in detail to figure out what Google likes or dislikes. This is especially useful when analyzing Google algorithm updates.Compare the SERPs for two relevant keywords to see how much overlap there is and if you can target both keywords with the same one page, or if you should create a dedicated page for each of the keywords.8. “Lowest DR” keyword filterThis filter in Keywords Explorer lets you find high-difficulty keywords which a “weaker” website ranks for. This indicates that even though websites with high Domain Ratings are currently ranking in the SERPs, there’s still a window of opportunity for a “smaller” website to rank.9. Page inspect toolThis tool in Site Explorer lets you see the full history of changes on a given page for both text content and HTML. Use it to analyze the on-page tactics of your competitors and see the changes they made to their existing page before it started ranking better in Google.It’s also a great way to better understand your lost links and what changed on the page that was linking to you.10. Technical-SEO-nerd-level Site Audit toolWhile we spent many years ensuring that our Site Audit is as functional and robust as any standalone solution, we’ve come to realize that many Ahrefs users don’t understand how powerful and advanced the tool really is.So here are some key highlights you may have missed out on:Internal link opportunities: Site Audit looks at what keywords your pages rank for and shows you pages that mention those terms, but don’t link to the ranking pages.Raw HTML, Rendered HTML, and Extracted Text: Site Audit shows you all three formats and makes them fully searchable and comparable.Search across the source code or text of all pages: After a crawl is completed, you can search to find internal link opportunities for new posts or posts that don’t rank, along with specific tags, text to be removed, etc.Hreflangs links graph: Site Audit shows you a hreflang links graph that helps you visualize hreflang issues. Errors with pages and links are highlighted in red, which lets you quickly spot which link is missing – or was added by mistake.Page & SERP Title don’t match: We’re more than just a tool to audit your website – we pull data from other sources like SERPs and Ahrefs data to show some interesting issues like this one. You may want to improve the page title if it’s not relevant to the page since it is a ranking factor.Core Web Vitals: Many tools only show Lighthouse data. Site Audit gives you that, along with page-level CrUX data for all metrics, as well as INP which is replacing FID – all laid out in beautiful dashboards for ease of visualization and reporting.Did you know? Site Audit can be used on a free Ahrefs Webmaster Tools account, which lets you crawl up to 5000 pages per verified website.11. Looker Studio connectorsEasily pull data from Site Explorer, Rank Tracker and Site Audit to create bespoke automated reports for your clients and management.Just follow our very detailed Looker Studio documentation.Bonus tip:Not sure what to focus on to improve your website rankings? Check out our Opportunities report.This report pulls from other Ahrefs reports to list the actions that we believe will most help improve your rankings (no more wasting time on things like rewriting 800 meta descriptions!)Click on any suggestion and get taken straight into the relevant report with all filters pre-selected.WAIT! THERE’S MORE!Interested in all the rest of the features we didn’t mention here? Check out our changelog, where you’ll find a running list of the recently added product updates at Ahrefs in a super easy-to-digest text format.Going beyond features, we also strongly believe in quality education and community building. Check out our:Ahrefs Academy: We do our best to keep product education fresh and regularly add new courses that are both relevant and actionable on different marketing-related topics.Ahrefs Insider Community: Here we host exclusive webinars, engage with users and help you to organize your own local meetups. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Tim Soulo Contributors Tim Soulo is CMO at Ahrefs. With over 15 years in the digital marketing industry, Tim is the author of many data-driven studies and actionable marketing frameworks, some of which gained industry-wide recognition. He enjoys challenging conventional marketing knowledge and optimizing for simplicity and efficiency. Contributors",
  "headers": [
    {
      "level": "H1",
      "text": "Best new Ahrefs features & use cases (2023)"
    },
    {
      "level": "H2",
      "text": "1. Site Explorer > Overview 2.0"
    },
    {
      "level": "H2",
      "text": "2. Comparison mode"
    },
    {
      "level": "H2",
      "text": "3. Site structure report"
    },
    {
      "level": "H2",
      "text": "4. Portfolios"
    },
    {
      "level": "H2",
      "text": "5. Advanced backlink filters + “Best links” filter"
    },
    {
      "level": "H2",
      "text": "6. INSTANT keyword clustering"
    },
    {
      "level": "H2",
      "text": "7. SERP comparison"
    },
    {
      "level": "H2",
      "text": "8. “Lowest DR” keyword filter"
    },
    {
      "level": "H2",
      "text": "9. Page inspect tool"
    },
    {
      "level": "H2",
      "text": "10. Technical-SEO-nerd-level Site Audit tool"
    },
    {
      "level": "H2",
      "text": "11. Looker Studio connectors"
    },
    {
      "level": "H2",
      "text": "WAIT! THERE’S MORE!"
    }
  ],
  "author": "Tim Soulo, Rebekah Bek"
}