{
  "url": "https://ahrefs.com/blog/black-hat-link-building/",
  "slug": "black-hat-link-building",
  "title": "Black Hat Link Building Services PART 2: Do They Work?",
  "description": "We tested one of the web's most popular black hat link building services to see if it actually works. Here are the results.",
  "content": "Karol K Karol K. is a freelance writer, founder of NewInternetOrder, and online business figure-outer. His work has been featured all over the web, on sites like MarketingProfs, Adobe Blog, ProBlogger, and many others. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents The first part of this surely did stir up some ****.There were not-so-pleased comment responses, a follow-up thread on BHW itself … fun stuff.But that first flow of backlash was a bit surprising to me.After all, as far as I remember, I wrote hardly anything truly negative about that awesomely named SEO service (“SHERLOCK HACKS GOOGLE” - SHG) from the BHW forum. In fact, I kind of admired the seller’s marketing ability and his skill in executing the whole thing.I mean come on, earning $250,000+ from a single forum thread?! You have to be really capable to pull that off.But let’s set all of that aside.Today, it’s not about the money.It’s about the question I asked in the first part:Do those black hat link building services work?If you believe the seller, they do.Literally every page of the main forum thread - of which there are 170+ at the time of writing - starts with the seller’s own message sharing the best testimonials.Those testimonials praise anything from mild search engine ranking improvements, to huge page 1 domination for keywords that were nowhere to be found prior to buying the SHG service.But as we all know, testimonials can be cherry-picked, so they don’t give us an objective view of the percentage of customers for whom this actually works long term.For example, to see some “nay”-stimonials all you have to do is go to the comment section of the previous post. Here’s a few:Clearly, those SEO services don’t work out for everyone who buys them.Note. Things to consider: Although the quality of the service is of course the most important factor when looking at the results it brings, we also have to keep in mind that other factors are at play too. Chief of which is that keywords are not created equal. For some, just minor SEO manipulation is enough, and you’re on page 1. For others, thousands of dollars a month won’t move the needle even a bit.So, do SEO services like this work?Like I said in the first part, I did actually buy SHG to see how things would play out for me.I pointed it to my under-performing site, hooked it up to Ahrefs, and waited to see what would happen.Since then, a couple of months have passed, so I think the time is perfect to share the results I got.The boring details:The niche. Something called “reverse phone lookup.” Basically, you take a phone number, put it through a specific search engine, and it lets you know who owns that number. All things considered, neat thing.The keywords. I tried not going only after the main “reverse phone lookup” phrase, since it’s very competitive. Instead, I selected some long tail phrases, with the main focus on the Canada phrases:The breakdown: Buying the serviceHere’s a quick overview of the buying process.In short, nothing too complicated. All you do is fill out a web form giving the seller some details about your site, and then transfer the money via PayPal.The form’s structure and content itself is clearly a result of hundreds/thousands of orders that went through it, so at this point, it basically leaves no guesswork when you’re filling it out.After that … you wait.You wait a lot. Something like 2+ weeks.Actually, on second thoughts … it’s still not that long considering how many links get built during that time (around 640 of them + Wiki links + social shares).Finally you get a report, and that’s that.The SEO reportThe one thing I have to give to the seller is that the report lists everything that has been done as part of the service in great detail.You get individual spreadsheets for things:And each spreadsheet lists every link that was built. Note - I have blurred the actual URLs in the screen shot below, so as not to giveaway any footprints that might point to other sites using the service.Something to point out, though.The sales material kind of boasts about the PR of the links that’s going to be carried over from the pages linking to you. The report clearly lists this as well:However, what you’ll quickly find out is that the PR indicated for each link is actually the PR of the domain, not the page the link is on.For example, as part of the service, you get a “PR8 link from Weebly.” Weebly.com is PR8, but the page the link is on has no actual PR. (Besides, is PR still a thing?)The quality of the links / pages linkingTL;DR: Not stunning.I mean, I guess you get what you pay for, but I still have to give it my honest opinion nevertheless.Basically, what you get is a large number of links coming from low quality pages full of spun content.And I’m not even against the idea of content spinning, as long as it’s done in a readable manner. But what you get here is content spun on autopilot. Like I shared in the first part, here’s an example of the original text:It is not easy when someone keeps calling your phone and you do not have a recollection of whom they are.And here’s the spun version:It is not interesting when someone phone calls you all enough time and you will not have their particulars and it gets annoying when they’re prank calls.On the other hand, I do understand why that’s the quality you get. After all, creating a proper spin file by hand could take easily 2 hours or more per article. Plus, it’s not like any visitor is expected to stumble upon those pages anyway. They are all created predominantly for search engine bots to read.Now, about the pages themselves. Just taking the “Web 2.0 links” category from the report, the only big domains there are tumblr.com, weebly.com, wordpress.com, livejournal.com, and blog.com (but like I said, the actual pages used have no PR). The rest is either unknown or miscategorized (more on that in a minute).Also, even the page on weebly.com wasn’t created for the purpose of my campaign. The header menu of the page I received a link from is just insane. See for yourself:Clearly, that page is being used for hundreds of customers, and it links to a whole network of SEOd websites.Footprint much?Then there’s miscategorization. For instance, a link that’s listed as a “Web 2.0 property” link - from projectwedding.com of all places - turns out to actually be a link from a forum profile created within that domain. And then, that projectwedding.com domain appears once again in the “Article Submission” section of the report. Both pages look just the same, and they include the same kind of link. Why is one “Web 2.0” and the other “Article Submission”? Beats me.That brings me to the big issue actually.A huge chunk of the links you get from this service are forum profile links. Some of them are listed in a dedicated section of the report - “High PR Profiles” - but the others are spread all over the place, in “Web 2.0,” “Article Submissions” and etc.Speaking of article submissions. You get a lot of those, I have to admit, and only a fraction turn out to be forum profiles. But they are still low quality. For instance, you won’t find EzineArticles on the list, or any other well known article directory.And like with everything, the content isn’t spun in any readable manner, so the only purpose it serves is to stuff the link in there somewhere, which, again, is expected.(I guess submitting this sort of content to Ezine wouldn’t fly anyway.)Links in other languagesThere doesn’t seem to be any consistency here when it comes to the types of sites you get links from. There are English sites, Chinese, and others … written in all languages of the world basically (well, okay, I couldn’t be bothered to check them all).The domains look quite exotic too. For example, czwlwz.chaozhou.gov.cn or serc.nc.hcc.edu.tw. In many cases, the only English phrase on the entire page is the actual link. Like here:Looks quite funny.More importantly, all of this is clearly spam for any human reviewer who ever sets out to check the link profile of your website. This sort of thing can have a huge negative impact over the long term if all you have are such links.You’d need a much bigger link profile in order to hide that kind of obvious spam. Maybe with thousands of other high-quality links, those additional spam links could stay under the radar. But even then I’m not sure you’d get away with it if a Google rep takes a closer look.Are the links still live?One thing I was wondering about is for how long the links would stay live. To be honest, I expected most of them to get swiped away by the admins quite quickly once they get a hang of what’s going on on their websites.But. This whole experiment started around two months ago, and I’m surprised to say that most of the links are still alive and well.Even though there’s a visible drop off, it’s not that brutal considering the total number of links that were built through this service. Plus, all of the ““most valuable”” (yep, those are quadruple quotes) links have remained live.That being said, I’m not sure that having such links online for the long haul is a preferable scenario. When a Google rep finally comes along and penalizes you, getting rid of those links can be really tough, and you can’t just disavow your whole link profile.My results - the stats don’t lieGetting to the most important part … did this service improve my search engine rankings with Google?I wish.(Quick “yay” for the one keyword on position 97!)In the end, no luck for me with this whole campaign. As far as I remember, there was some movement around week 2 or 3, but things came back to normal soon after.Let’s look at the other metrics. At the beginning of the experiment, the site had Domain Rating of 18, and just 13 backlinks in total coming from 6 referring domains. Right now:In the end, some work has obviously been done here, and the links have stayed online. On the other hand, a lot more links were promised than what I can see in the Ahrefs index.Now, let’s talk about something that’s even more important than actual rankings … traffic. At the end of the day, all the ranking in the world means nothing if you’re not getting any new traffic off of it.So here are the results I got:Caution! Prepare to be not impressed with my traffic stats!Before the experiment, my usual weekly traffic looked something like this:(I’m sharing weekly stats instead of daily stats just to make the trend line more visible … there’s hardly any consistency in my daily stats.)In total over the period:Right now, it looks like this:In total until today:See the difference?No?Okay, it is a fine difference, let me help you out:Referral and social traffic: 5.7 » 0.7 (sessions per week).Direct traffic: 2.2 » 2.9.Organic traffic: 1.3 » 2.Setting my referral and social traffic aside - although I’m surprised it went down so drastically - the other two metrics are on the “rise.” Hollow victory.So … was it worth it?As an experiment, hell yeah!I mean, looking at what was going on, and how the links and rankings were coming and going was cool. And I believe there’s some value here for whoever is considering buying a similar SEO service for their website.When it comes to the results though … probably not so much.Like I said at the beginning, it’s hard to blame only the service provider for the results. Setting his methods aside, I might have made a mistake selecting the keywords as well. All in all, I’m taking 50% of the blame on myself, I honestly mean it.That being said, I did expect to see at least a slight improvement for even one - just one - of my keywords. Sadly, I got nothing. Just a bunch of links that didn’t do anything.ConclusionSo … do black hat link building services from SEO forums work?I’m really really sorry that I have to end this post like that … but … it depends.On the one hand, I could tell you that it hasn’t worked for me, or that it has, and therefore it’s a good/bad service. But this would only be one case, looking at one particular service, for one website, one niche, targeting one range of keywords, going against certain competition. It would hardly be a representative conclusion across a wider range of scenarios.At the same time, I believe I provided enough details here, so that you can figure things out for yourself and decide if / to what extent this can work.Let me know your thoughts in the comments! Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Keep Learning 5 Simple E-commerce Link Building Tactics Learn how to get backlinks to your online store’s product pages, homepage, and other content using five simple tactics. 6 Link Building Services That Actually Work (+6 More to Avoid) The right link building services can help you land high-quality links in a shorter amount of time. Here's how to pick 'em. 7 Popular White Hat Link Building Techniques (That SEOs Are Still Using Today) Give these seven white hat link building techniques that are still tried and true methods among SEO professionals to this day. 12 Link Builders Share Strategies That Work in 2024 I asked 12 SEOs for the link building strategy that's working best for them right now. Here are the tactics they shared and how to do them. 3 Link Building Methods That Helped Pet Keen Grow to 3M Organic Traffic A closer look at Pet Keen's impressive organic growth, which is largely made possible by three link building methods.",
  "headers": [
    {
      "level": "H1",
      "text": "Black Hat Link Building Services PART 2: Do They Work?"
    },
    {
      "level": "H2",
      "text": "So, do SEO services like this work?"
    },
    {
      "level": "H2",
      "text": "The breakdown: Buying the service"
    },
    {
      "level": "H2",
      "text": "The SEO report"
    },
    {
      "level": "H2",
      "text": "The quality of the links / pages linking"
    },
    {
      "level": "H2",
      "text": "Links in other languages"
    },
    {
      "level": "H2",
      "text": "Are the links still live?"
    },
    {
      "level": "H2",
      "text": "My results - the stats don’t lie"
    },
    {
      "level": "H2",
      "text": "So … was it worth it?"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    }
  ],
  "author": "Karol K"
}