{
  "url": "https://ahrefs.com/blog/blog-post-length/",
  "slug": "blog-post-length",
  "title": "How Long Should Blog Posts Be? [The Real Answer]",
  "description": "Most blog posts should be at least 300 words in length. Any shorter than that, and you should probably question whether you have anything important to say.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Most blog posts should be at least 300 words in length. Any shorter than that, and you should probably question whether you have anything much to say at all.From there, hitting a certain word count shouldn’t be your aim. Your aim should be to write a thorough, engaging, and well-researched post that’s as long as it needs to be: no less and no more.However, the fact that you’re reading this means you’ve probably heard that Google ranks long posts higher than short ones.In this post, we’ll explore why this is almost certainly wrong, and what you should do instead to optimize your blog posts for search engines.Why do people think long blog posts are better for SEO?Many studies show a correlation between content length and the things that we associate with good SEO performance.However, correlation doesn’t prove causation.So let’s discuss a couple of common arguments a bit further.1. Longer content gets more backlinksBacklinks are one of the most important Google ranking factors.We know this because they’re the foundation of the PageRank algorithm. Google also talks about backlinks in the context of ranking useful pages here.If you look at the relationship between word count and backlinks, there is indeed a strong positive correlation.In this case, the data comes from analyzing a sample of around 900 million pages from the 3+ billion pages Content Explorer. That’s our content research tool for analyzing the best-performing content about a topic. However, we’re not the first to see this correlation. Many people have analyzed other data sources and found the same thing: longer content gets more backlinks than shorter content.Why might you see this correlation?Let’s start with the most obvious possibility: longer blog posts just seem more impressive, and that’s why more people link to them.Although that might seem like a reasonable claim, our data doesn’t really back it up.Take another look at the graph above and you’ll see that it cuts off at 1,000 words. For posts longer than this, we actually found a strong negative correlation between word count and backlinks. In other words, the average number of backlinks from unique websites (referring domains) starts to decrease after 1,000 words.So what’s the deal here?Our theory is that the correlation at least partly comes down to the balance between thoroughness and succinctness.Let me explain:Generally speaking, longer content tends to include more ‘link-worthy’ talking points. But it also buries those important “need to know” points among a lot of less important “nice to know” information. The result is a piece of content that fewer people read all the way through, meaning that fewer people actually come across the included ‘link-worthy’ points. And if fewer people come across them, fewer people will link to you.It’s also true that most people aren’t going to link to a blog post they haven’t read. And there will be fewer of those people if your post takes three hours to read.What should you do about it?Keep your blog posts concise and fluff-free while making sure to include important ‘link-worthy’ points.Makes sense. But how do you know what constitutes a ‘link-worthy’ point?One way is to paste the URL of a top-ranking post for your target keyword into Ahrefs’ Site Explorer. Then, head to the Backlinks report and look at the links anchors and surrounding text for trends.For example, if we do this for one of the top-ranking posts for “SEO copywriting,” we see that a disproportionate amount of links come thanks to a mention of the APP intro method.Because we know that section is responsible for so many links, we can make sure to include something similar when we write about the same topic.That’s what we did in our SEO copywriting guide. We didn’t want to copy the other post and mention the APP method, so we mentioned another useful intro formula instead.key takeawayDon’t focus on length. Focus on including all link-worthy points as succinctly as possible.2. Longer content gets more organic trafficAccording to our analysis of the pages in Content Explorer, there’s a moderate positive correlation between content length and organic traffic.But again, it’s unwise to assume causation.Why might you see this correlation?Let’s first consider the idea that Google is biased towards longer content. As a result, longer content ranks higher and gets more organic traffic.Once again, our data doesn’t really back this up.If you take another look at the graph above, you’ll notice that it cuts off at 2,000 words. That’s because we found a moderate negative correlation between word count and organic traffic for posts longer than 2,000 words. In other words, the average 10,000-word post gets less search traffic than the average 2,000-word post.Of course, it could be the case that Google favors longer content up to 2,000 words, but we don’t see much merit in that argument. It just doesn’t make any sense to penalize posts for being “too long.”Google’s John Mueller agrees. In 2019, he stated that word count isn’t a ranking factor.So let’s take a look at a few more convincing reasons why the correlation might exist.First, there’s a positive correlation (up to 1,000 words) between word count and backlinks. We already know this, and we know that backlinks are important for ranking.Second, longer content tends to be more thorough and naturally covers more subtopics. For that reason, longer content often ranks for more long-tail keywords.Just take our list of Google search operators. According to Ahrefs’ Site Explorer, it ranks for around 7,200 keywords.Many of these keywords are just other ways of searching for the same thing like “google search commands” and “google search modifiers.” But the page also ranks for related terms like “google inurl” and “google filetype operator.”This happens because our post is thorough and mentions both of these operators.If our blog post were less thorough and didn’t talk about these things, it wouldn’t rank for those keywords. We see that happening with a competing post about the same topic. It only mentions twelve search operators, so it doesn’t rank for as many related keywords.What should you do about this?Instead of writing tirelessly until there’s no possibility that you missed anything important, start by researching what’s important. That way, you can keep your posts succinct by including the important and negating the unimportant.An easy way to do this is to eyeball the top-ranking pages for commonalities.For example, both of the top-ranking pages for “keto diet” talk about what the keto diet is…… and what foods you should eat:The fact that multiple top-ranking pages are talking about these things tells you that they’re probably important points.You can also run a content gap analysis to find keywords that multiple top-ranking pages rank for, then eyeball the report for subtopics and important points. To do this, paste the URLs of a few top-ranking pages for your main keyword into Ahrefs’ Content Gap tool and leave the bottom field empty.Run the report and look for subtopics.Here, we see words and phrases like “what is the keto diet,” “keto meals,” and “keto breakfast.”Just those few keywords alone are enough to give us a rough outline for a blog post.key takeawayDon’t focus on length. Focus on covering all relevant subtopics as succinctly as possible.Why blog posts should be as succinct as possibleBesides the correlational data showing that the average blog post gets fewer backlinks and less traffic after a certain length, is there any other reason why you should keep things as succinct as possible?The simple answer is yes, because nobody wants to read any more than they have to.In the words of Tim Soulo, our CMO:Nobody likes to read. They just want the information. If they could download it to their brain, they would.Tim Soulo, CMOBut is there really any evidence for this besides the anecdotal?Absolutely. When Medium studied the correlation between post length and average reading time, they noticed that engagement starts to drop for posts with a reading time longer than seven minutes.According to The University of Chicago, most people read at approximately 250 words per minute. That puts a 7-minute blog post at around 1,750 words.Does that mean your blog posts should never be any longer or shorter than that?Of course not. It will take more than 1,750 words to tackle some topics thoroughly and less for others. That’s why our guide to YouTube SEO runs over 7,000 words, and our list of Chrome extensions for SEOs runs just 1,275. There’s more ground to cover about YouTube SEO.Screenshot from Ahrefs’ Content Explorer.That said, even if there’s a lot of ground to cover, you should still make an effort to cut unnecessary fluff from your posts.One of the tools that can help with that is Hemingway. It helps to improve your writing by letting you know about unnecessary words and fluff. In my experience, it’s easy to cut your word count down by at least 10% using this tool. But then again, it might just be that my writing style is unusually convoluted.It’s also worth getting a friend or colleague to read your blog post. Why? Because other people are usually better at spotting when a point is unnecessary and only serves to complicate the post. This is something we do for all the posts we publish.Final thoughtsIt’s time to stop the obsession with word count. Instead, focus on creating concise but thorough blog posts that engage readers and follow SEO best practices.Struggling with the engagement part? Take a look at these SEO copywriting tips.Got questions? Ping me on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Keep Learning How to Create a Winning Blog Content Strategy in 7 Steps A blog content strategy is a vision and a plan that you have for your blog. It should be aligned with your business goals and your overall content strategy 6 Simple Blog Post Templates (Download & Edit Along) Use these templates to beat writer's block, write great content faster, and stand the best chance of ranking in organic search. 15 Proven Ways to Increase Blog Traffic Learn the 15 tried and tested tactics we used to increase our blog traffic to 250,000+ monthly visitors. How to Write a Blog Post (That People Actually Want to Read) in 9 Steps Looking to write a blog post that people want to read? Learn everything you need to know in this easy guide. How to Write a Blog Post Outline (7 Simple Steps) In seven simple steps, learn how to create a blog post outline that’ll help you overcome the dreaded writer’s block.",
  "headers": [
    {
      "level": "H1",
      "text": "How Long Should Blog Posts Be? The ‘Truth’ About Content Length"
    },
    {
      "level": "H2",
      "text": "Why do people think long blog posts are better for SEO?"
    },
    {
      "level": "H3",
      "text": "1. Longer content gets more backlinks"
    },
    {
      "level": "H4",
      "text": "Why might you see this correlation?"
    },
    {
      "level": "H4",
      "text": "What should you do about it?"
    },
    {
      "level": "H3",
      "text": "2. Longer content gets more organic traffic"
    },
    {
      "level": "H4",
      "text": "Why might you see this correlation?"
    },
    {
      "level": "H4",
      "text": "What should you do about this?"
    },
    {
      "level": "H2",
      "text": "Why blog posts should be as succinct as possible"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Joshua Hardwick"
}