{
  "url": "https://ahrefs.com/blog/broken-link-building/",
  "slug": "broken-link-building",
  "title": "Broken Link Building: The Complete Guide",
  "description": "Learn what broken link building is, whether it still works, and how to get backlinks with it.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Broken link building is one of the most popular link building tactics around. It’s the fifth most widely used tactic—according to Aira’s annual state of link building report, which crowdsources opinions from over 250 digital marketing professionals.But it’s not entirely foolproof, and there’s some nuance to doing it well.In this guide, you’ll learn how to get backlinks from broken link building.But first, let’s cover the basics.What is broken link building?Does broken link building still work?How to do broken link buildingWhat is broken link building?Broken link building is a tactic that takes advantage of broken pages on the web. It involves finding a dead page and asking linkers to swap the links to a working page on your site. The idea is that they’ll do this as they don’t want to send visitors to a dead resource.Does broken link building still work?It would be fair to say that SEOs are somewhat divided when it comes to this question.In one video, Mark from Authority Hacker said:I’ve come to the conclusion that it’s an almost pointless tactic, and you shouldn’t waste your time with it.If you dig through the comments on that video, one stands out:Let’s set the record straight:Broken link building isn’t easy. Sometimes, it works well. Sometimes, it doesn’t.Is this because there’s something inherently wrong with the tactic?No. It’s because link building is hard to execute well—whatever tactic you use. The better you understand the tactic, the more likely you are to have success.How to do broken link buildingBroken link building is a four-step process.Find broken pages with backlinksVet the backlinksCreate a replacement pageDo outreach1. Find broken pages with backlinksIt’s impossible to find highly linked broken pages without SEO tools. Even if you find dead pages manually, you’ll need a backlink checker to see how many links they have. You can use Ahrefs’ free backlink checker for this, but life is much easier with full access to Ahrefs.Keep this in mind as we go through the tactics below. You’ll need Ahrefs for ¾ of them.Here are the tactics:Look for your competitors’ broken pages with backlinksLook for broken pages about a topicLook for broken links on competing websitesLook for broken links on resource pages (doable without paid Ahrefs)a) Look for your competitors’ broken pages with backlinksMany of your competitors will have at least some dead pages because everyone moves, deletes, and reorganizes content over time. If they forget to redirect old URLs when doing this, their backlinks will point to broken pages.Here’s how to find dead pages on your competitors’ websites:Go to Site ExplorerEnter a competing domainGo to the Best by links reportFilter for “404 not found” pagesSort the report by Referring domains from highest to lowestFor example, there are 134 dead pages on Content Marketing Institute’s website, and some have backlinks from over 50 referring domains.Your job is to sift through these pages for topics that make sense to create content about.For example, the first page about “what is content marketing” makes sense for us because we have an entire blog category about content marketing. It’s the kind of topic we want to build links to.If you don’t find a relevant broken page on one competitor’s website, repeat the process for others.TIPIf you’re unsure who your competitors are, enter your domain into Site Explorer and go to the Competing Domains report. This shows other websites ranking in Google for the same keywords as you.b) Look for broken pages about a topicBroken link building has traditionally always been about the method above. The disadvantage of this method is that you limit yourself to finding opportunities on a handful of sites.The ideal solution to this problem would be searching the web for broken pages with backlinks about a particular topic. The only tool we’re aware of that allows you to do this is Ahrefs’ Content Explorer, a searchable database of billions of webpages.Here’s how to use it to find broken pages about a topic:Enter a broad topicSwitch the search mode to “In title”Hit searchFilter for broken pages onlyFilter for pages with at least 20 referring domainsIn the example below, there are 188 broken pages with at least 20 backlinks about content marketing:To confirm a broken page, click the title to open it in a new tab.TIPEyeball the “Page traffic” column to find pages that are more likely to have high-quality backlinks. If the page used to have traffic, its backlinks might have been helping it to rank.If the page never had traffic, the backlinks might not be great.c) Look for broken links on competing websitesMost websites frequently link to pages on other sites, and some of these will break over time. That means your competitors are likely to link to broken pages.Here’s how to see broken pages your competitor is linking to:Go to Site ExplorerEnter a competing domainGo to the Broken Links reportFor example, robbierichards.com is linking to 32 dead pages:To see which have the most referring domains, export the report, paste the broken URLs into Ahrefs’ Batch Analysis tool, and sort by total referring domains.Here are a few potential broken link building opportunities in the screenshot above:Google’s discontinued mobile-friendly test tool: 2,654 RDsSEJ’s guide to the Google Hummingbird algorithm: 462 RDsChatmeter’s list of local SEO stats: 276 RDsd) Look for broken links on resource pagesResource pages curate and link to resources on a particular topic. They’re a good source of broken pages with backlinks for two reasons:People rarely update them, so they often link to dead resources.They list helpful resources, which often have links from many other sites.To find resource pages in your industry, use one of these Google search operators:KEYWORD intitle:resources inurl:links.htmlKEYWORD intitle:links inurl: resources.htmlKEYWORD inurl:resources intitle:resourcesFor example, here’s how we might search for resource pages about link building:Then you need to check for broken links on these pages, which you can do for free with Ahrefs’ SEO Toolbar.Visit the pageClick the toolbar iconGo to the “Links” tabClick “Check status”Filter for broken links onlyTo see the total backlinks to these pages, export the list of URLs and paste them into Ahrefs’ Batch Analysis tool.2. Vet the link prospectsMany people jump straight to creating a “similar” replacement page after finding a dead page with backlinks. This is a mistake for two reasons:Your broken page may not have any good backlinks. In which case, there’s no point pursuing the opportunity or creating a replacement page.You need to understand why people linked to the dead page to create a replacement page. This is how you keep your content and outreach in sync, which leads to higher success rates.You can figure out both things by vetting the page’s link prospects.Here’s the process in a nutshell:a) Check link qualityIf a broken link building opportunity is unlikely to lead to high-quality links, it’s pointless pursuing it. So the first step is a quick spot-check to see whether the dead page has desirable backlinks.Here’s how to see a page’s live backlinks:Go to Site ExplorerEnter the dead page’s URLGo to the Backlinks reportSet the grouping mode to “One link per domain”Set “Show history” to “Don’t show”Then you can eyeball the report to get a sense of backlink quality.You can do this by reviewing each link manually, but that’s inefficient for a spot-check. It’s quicker to filter the report for links with attributes that tend to align with quality.Everyone’s criteria will differ slightly here, but these four filters are a helpful place to start:“Dofollow” links only. This excludes most low-value links such as those from directories, forums, and blog comments.Exclude subdomains. This excludes links from places like blogspot, which are often low-quality and spammy.DR 5+. This excludes links from very low-authority websites.Domain traffic: 20+. This excludes links from websites with little to no traffic.For example, if we add these filters to the Backlinks report for the page above, the number of backlinks drops from 100 to 29:That’s because the dead page has many desirable links, such as this one from celebanswers.com:But it also has many low-quality and spammy links like this one:It’s up to you to decide whether a broken page has enough desirable links to make creating a page and doing outreach worthwhile.b) Check link reasonsUnderstanding why your broken page got links helps you add points that allow you to create compelling outreach angles. This is crucial for improving the link success rate for your campaign, so the next step is to eyeball the filtered report for link reasons.Here are the two broad types of link reasons you’ll see:General links are where people recommend the resource as a whole. You can’t see why they linked to that specific resource from the link’s context.Deep links are where people recommend a resource for a specific reason. You can see what that reason is from the link’s context.Here’s an example of a general link to a broken page about calculating your net worth:You can see that although they recommend the resource, it’s impossible to tell why from the link’s context. The anchor is “here’s an amazing post.”There’s not much you can learn about creating a “better” page from these kinds of links.You can learn more from deep links like this:This time it’s obvious why they recommended the resource: It explains how to grow your net worth.We can confirm this by looking at how the page used to look in the Wayback Machine:Identifying deep links helps you create a compelling replacement page, so note them down alongside how many people link for the same reasons. Search the Backlinks report for relevant “footprints” in the anchor or surrounding text to find this.For example, we can search this page’s backlinks for words like “increase,” “grow,” or “improve” to see if this advice led to other links.It looks like it did:Here’s what our final notes might look like for this page:IMPORTANTYou may sometimes find that people link to a dead page for reasons that would be hard to replicate. As the flowchart suggests, these opportunities probably aren’t worth pursuing.For example, here’s a page where most backlinks reference original stats and research:In this case, the page was a study where the author analyzed 1 million top-ranking pages. Unless we do the same for our replacement page, it won’t be easy to convince linkers to swap the broken link for ours.3. Create a replacement pageNow you know why people linked to the dead page, it’s time to create a suitable replacement.Let’s go through how to do that in three steps.a) Create a rough outlineAlthough you don’t want to copy the dead page word for word, you do want to create something similar. This means crafting a piece that fulfills the same purpose and talks about similar things.You can get a better sense of what the dead page discussed using the Wayback Machine.For example, this page explains how to calculate your net worth in three steps, gives a few example calculations, and has tips on how to improve your net worth over time:If you were pursuing this broken link opportunity, you’d want to use a similar outline.Here’s what that might look like:H1: Net Worth Explained: How to Calculate and Improve It Over Time H2: What Is Net Worth?H2: How to Calculate Your Net Worth H3: Step 1. Do xH3: Step 2. Do yH3: Step 3. Do zH2: Example Net Worth Calculations H3: Example 1: xH3: Example 2: yH3: Example 3: zH2: How to Track and Improve Your Net Worth H3: Tip 1: Do xH3: Tip 2: Do yH3: Tip 3: Do zb) Bake in linkable pointsRemember the work you put into vetting link prospects for deep recommendations? Now’s the time to add them to your content so that your outreach angles make sense.In this case, we covered most of these in the basic outline.TIPMake sure everything you include is accurate. For example, if a deep link references an out-of-date statistic, include a more recent statistic.c) Find other ways to improve itMost of the links to your dead page are likely to be general links. In other words, they’re people referencing the content for no clear reason.You can’t do much to tailor your content for these people because you don’t know what they liked about the original piece. But you can make overall improvements.For example, adding a template would probably improve our piece on calculating net worth.Improving the content allows you to strengthen your value proposition to general linkers by adding a “why”:Without improvement: you have a dead link > here’s a replacementWith improvement: you have a dead link > here’s a replacement > here’s why it’s a good replacementHere are a few simple ways to improve content:Simplify: Make it more accessible and easier to understandVisualize: Demonstrate concepts with graphicsTemplatize: Add a plug-and-play templateRectify: Fix issues with accuracy4. Do outreachOutreach is where you pitch your replacement resource to those linking to the dead page.This is usually done in one of two ways:Shotgun outreach. You send the same email to everyone with no personalization.Sniper outreach. You send unique, personalized emails to everyone.Both of these approaches have their pros and cons.Shotgun outreach is a pure numbers game. Conversion rates will be low, but you’ll get some links with enough prospects. It’s also risky. You can quickly burn bridges and get your domain blocked.Sniper outreach converts better but takes more time and effort. You can easily spend a whole day sending a dozen emails.Given the steps we’ve gone through so far, we recommend a hybrid approach.Here’s how this works:Instead of sending a unique or identical email to everyone, you segment prospects and create a personalized template for each group. This is why we spent some time identifying general and deep links. The way you target them should be different.Pitching deep linkersEach segment of deep linkers deserves a unique template.For example, we have three segments for the net worth page:People referencing advice on growing your net worthPeople referencing the definition of net worthPeople referencing how to calculate net worthHere’s a simple template for the first segment:Hey [Name],Just came across your post on [Topic] and saw that you recommended advice on growing net worth from [Dead page author].Looks like that page no longer works.Not sure if you’re still updating older posts, but if you are, my guide expands on that advice and gives a few extra tips.Here’s where I found the link on your page:[Screenshot]No pressure. Just thought it might be useful. 🙂JoshHere’s one for the second segment:Hey [Name],Just came across your post on [Topic] and saw that you recommended this process for calculating net worth from [Dead page author].Looks like that page no longer works.Not sure if you’re still updating older posts, but if you are, my guide has a similar process but includes more detail on how to estimate the value of your assets and debts (super important for an accurate calculation!).Here’s where I found the link on your page:[Screenshot]No pressure. Just thought it might be useful. 🙂JoshBoth of these are pretty typical and could use a bit more creativity. But hopefully, you can see how creating personalized templates like this can potentially improve the results of your broken link building campaign.Pitching general linkersAs there’s no clear reason why these people linked to the dead page, you can only send them a generic pitch. This should follow the same formula as with deep linkers. The difference is that the value proposition will be a generic one.You can use the improvements you made to the dead page for this.Here’s an example template for our page:Hey [Name],Just came across your post on [Topic] and saw you recommended this guide to calculating net worth from [Dead page author].Looks like that page no longer works.Not sure if you’re still updating older posts, but if you are, my guide explains a similar process and includes a free template to make life easier.Here’s where I found the link on your page:[Screenshot]A few other reasons why I think my guide is better (completely biased, of course):More details on estimating the value of assets and debtsExtra tips for growing net worthFlowchart to create a custom growth planNo pressure. Just thought it might be useful. 🙂JoshThis template is the best we can do for general linkers because we don’t know why they linked to the original page.Final thoughtsLink building tactics are just streamlined ways of finding link prospects with a reason for contact. In broken link building, the reason is that they have a dead link on their site. In the skyscraper technique, the reason is that you have a “better” page. In other techniques, it’s something else.No technique will work well without a strong value proposition. That’s why we recommend using custom outreach templates for different segments of prospects linking to the dead page.Got questions? Ping me on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Keep Learning How to Find and Fix Broken Links (to Reclaim Valuable “Link Juice”) Do you have broken links on your site? Then you might be wasting valuable \"link juice\" and giving your visitors a bad experience. Here's how to find and fix all broken links from (and to) your website. Resource Page Link Building: The Only Guide You Need Resource page link building is a known and popular link building tactic. This guide shows you how to do it right. How to Hire a Link Building Agency: A Step-by-Step Guide Hiring a link building agency could be the secret sauce for SEO success. We explain what to look out for to find the ideal one. Event Link Building: A Beginner’s Guide Event link building is about getting links to your website by participating in local, national, or global events. Here's how to start. Google’s “Disavow Links Tool”: The Complete Guide Do you still need to disavow links in 2018? If so, what kinds of links should you be disavowing? Here’s everything you need to know. 3 Link Building Methods That Helped Pet Keen Grow to 3M Organic Traffic A closer look at Pet Keen's impressive organic growth, which is largely made possible by three link building methods.",
  "headers": [
    {
      "level": "H1",
      "text": "Broken Link Building: The Complete Guide"
    },
    {
      "level": "H2",
      "text": "What is broken link building?"
    },
    {
      "level": "H2",
      "text": "Does broken link building still work?"
    },
    {
      "level": "H2",
      "text": "How to do broken link building"
    },
    {
      "level": "H3",
      "text": "1. Find broken pages with backlinks"
    },
    {
      "level": "H4",
      "text": "a) Look for your competitors’ broken pages with backlinks"
    },
    {
      "level": "H4",
      "text": "b) Look for broken pages about a topic"
    },
    {
      "level": "H4",
      "text": "c) Look for broken links on competing websites"
    },
    {
      "level": "H4",
      "text": "d) Look for broken links on resource pages"
    },
    {
      "level": "H3",
      "text": "2. Vet the link prospects"
    },
    {
      "level": "H4",
      "text": "a) Check link quality"
    },
    {
      "level": "H4",
      "text": "b) Check link reasons"
    },
    {
      "level": "H3",
      "text": "3. Create a replacement page"
    },
    {
      "level": "H4",
      "text": "a) Create a rough outline"
    },
    {
      "level": "H4",
      "text": "b) Bake in linkable points"
    },
    {
      "level": "H4",
      "text": "c) Find other ways to improve it"
    },
    {
      "level": "H3",
      "text": "4. Do outreach"
    },
    {
      "level": "H4",
      "text": "Pitching deep linkers"
    },
    {
      "level": "H4",
      "text": "Pitching general linkers"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Joshua Hardwick"
}