{
  "url": "https://ahrefs.com/blog/buy-backlinks/",
  "slug": "buy-backlinks",
  "title": "Should You Buy Backlinks in 2024? It Depends",
  "description": "Buying backlinks is against Google’s Webmaster Guidelines, but is it really as risky as people say it is?",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Buying backlinks in shortBuying backlinks to help rankings violates Google’s spam policies. Google may rank your site lower in results or not at all if it detects paid links.Most link builders are happy to take the risk, with 74.3% buying backlinks.Paid links cost $83 on average—but they can often cost much more.Due to how risky it is, our advice is not to buy backlinks. (Here’s how to build or earn links safely.)ContentsRisks of buying backlinksPaid backlinks carry two risks. One is more severe than the other, but neither are good. Risk 1. Google will ignore your paid links, making them a waste of moneySince the Penguin 4.0 update in 2016, Google’s algorithms are now able to ignore many spammy and paid backlinks. This means they won’t help or hurt rankings, so buying them is money down the drain. Risk 2. Google will penalize and demote your website’s rankingsGoogle has an army of human reviewers who can impose manual actions on websites. If you get one of these, some or all of your site will not be shown in Google’s search results.Sidenote. You’ll know if you have a manual action, as it’ll show up in the Manual Actions report in Google Search Console.Why people still buy backlinksThere are likely many different reasons, but in my opinion, it largely comes down to these two:Reason 1. Buying links is much easier than building or earning themMany site owners will ask for money to place a link—even if you have great content.This is the unfortunate state of SEO in 2024. People are justifiably tired of receiving link outreach emails and know that many SEOs have the budget to pay them for links. Why give links for free when someone is willing to pay?Reason 2. Paid links can help rankings… if Google doesn’t detect themPaid links often look no different to earned links, so it’s quite possible to “trick” Google and get higher rankings with paid backlinks. For example, here’s a page about the best online casinos that’s thriving in organic search: If we take a look at its backlink profile in Ahrefs’ Site Explorer, it seems extremely likely to me that many of these links were paid for:Neither of those anchors look natural or legit. As time goes by, Google gets better and better at spotting and demoting paid backlinks—but it’s never going to be perfect. They can still move the needle.Sidenote. It’s entirely possible that the (likely) paid backlinks in the screenshot above are already being ignored by Google. The page’s rankings may be due to earned backlinks or other factors entirely, such as the content itself. How much do paid links cost?Paid links cost $83 on average according to Authority Hacker’s survey of 755 link builders. Can they be had for less? Yes. Head over to Fiverr and you’ll find packages with thousands of backlinks for just a few dollars. But the reality is that these links are unlikely to improve rankings.For that reason, this isn’t how most SEOs buy backlinks. Most buy them in one of two ways:Niche edits – You ask a site owner to add a link to an existing page on their site for a fee. Paid/sponsored guest posts – You write an article that contains links to your site, then pay a site owner to publish it on their website. Private blog networks (PBNs) — You build a network of sites yourself, then link to your “money” site from all of them. (This is becoming a bit less common these days, but people still do it). A few years ago, I ran a small study to investigate the costs of the first two types of links. How much do paid niche edits cost?$361.44, on average. I arrived at this number after reaching out to 450 sites across nine competitive niches and asking to buy a link on their sites outright (these were effectively niche edits).Here’s the email I sent:Sidenote. Admittedly, this isn’t the best outreach email ever. I didn’t pitch any particular resource or linking page. I also pitched the link in either existing or new content. These things might have negatively impacted the response rate.Interestingly, only 12.6% of the sites I reached out to were willing to sell me a link.Sites in some niches also seemed more willing to sell links than others. And as you may expect, the average cost of a link correlated quite positively with the site’s Domain Rating (DR):How much do paid guest posts cost?Much less than niche edits. $77.80, on average. I arrived at this number after pitching a guest post to 180 sites across the same nine niches. Interestingly, I didn’t offer to pay for placement. Many site owners just sent their fees anyway.Here’s the email I sent: Sidenote. I only pitched to blogs that had “write for us” pages. In other words, those looking for guest posts.As with niche edits, most site owners didn’t respond. Of the 25.5% who did, roughly half of them asked for a fee to place a guest post.Sites in some niches were also more willing to sell guest posts than others:And I also noticed that the websites selling them almost all had low DR scores:Just keep in mind that although average costs for guest post placements were lower than niche edits, you have to produce content for them. This adds to your expenses.Why do paid links cost so much?Links help you rank higher, and ranking high for competitive terms can earn you a lot of money. For example, let’s take that page listing the best online casinos I showed you earlier. It currently gets an estimated 54K monthly search visits, according to Ahrefs. And many of the links on the page are affiliate links.Given that casino affiliate programs pay out generous commissions, I’d estimate that this page easily generates monthly commissions in the high five figures. So it’s easy to see why site owners are willing to pay big bucks for links that help them rank higher. Over the years, site owners have caught on to the value of links for SEOs and started demanding more and more.Unfortunately, many link buyers and sellers know next to nothing about what makes a good backlink. This has led to an industry where even low-quality site owners are able to demand high prices for mediocre links because some SEOs are willing to pay.This is why you really need to do your due diligence if you plan to buy backlinks.How to build links safelyBuying backlinks is out of the question if you want to build links in a “safe” and white-hat way. This leaves you two options:Create content that attracts links naturallyDo outreach to earn linksGiven that content can’t earn links unless people know about it, your best bet is to do both: create content that deserves to earn links, then do outreach to let potential linkers know it exists. However, you should still do your due diligence even with outreach-based link building.Let’s go through a few questions worth asking before reaching out to a website.1. Does the site look legit?Based on your first impressions of the site, does it look trustworthy? Would you stick around to read the content if you landed on it?If the answer is no, it probably isn’t worth pursuing a link from. In case you’re struggling to answer, here are a few telltale signs of a less-than-legit site:Poor designNo links in the contentNo images in the contentVague or non-existent author biosHere’s an example:Although this site could be legit, it doesn’t fill me with confidence for a few reasons:The logo looks like a Fiverr job.The only two images on the page are stock photos with no attribution.There are no links in the content.The author bio is simply “Bridget.” But Bridget who? My guess: This website is part of a private blog network or set up for the sole purpose of selling backlinks. 2. Does it get consistent search traffic?If a website gets organic traffic, Google must see it as at least a somewhat valuable resource. To check this, plug the domain into Ahrefs’ Site Explorer and go to the Overview report. However, relying solely on a website’s current organic traffic isn’t the best idea. If traffic has recently fallen off a cliff or seems to fluctuate dramatically, it may have been hit by a Google update. For that reason, it’s worth scrolling to the “Performance” graph on the Overview report in Site Explorer to see the site’s organic traffic over time. Here’s the graph for the site above:Despite still getting an estimated 4.8K monthly search visits, you can see that it used to get much more in 2018. In fact, traffic dropped by ~95% pretty much overnight. If we hit the toggle to overlay Google updates on the graph, we see that the traffic drop coincided with the Core Update in August 2018. This is the update that Barry Schwartz dubbed the “medic update” because it seemed to have the most impact on health and medical sites.To conclude, don’t bother pursuing links from sites like these—paid or otherwise.3. Has the site been selling links? (AKA is it a “link farm”?)Never pursue links from sites that are obvious link sellers because a Google penalty is probably just around the corner. At which point, the links you got from the sites will become worthless or worse.You can usually tell if a site has been selling links by checking recent posts for oddly placed links with lucrative keywords in their anchors.Here’s an example: Both of those links are quite unnatural, have exact-match anchors, and lead to commercial pages on the same website.An often faster way to do this is to check the Outgoing Link Anchors report in Ahrefs’ Site Explorer for followed external links with odd anchors. 4. Has the site been buying links?If there’s obvious evidence of a link prospect buying links, it’s yet another reason to avoid pursuing links from that site. After all, it could get penalized for buying links at any point. To check, use the Anchors report in Ahrefs’ Site Explorer to look for followed links with unnatural anchors to its homepage.Here’s an example of a site with many suspicious links:If you’re unsure whether an anchor is suspicious or not, hit the caret in the “Links to target” column to see its context:In this case, I’d say the link looks suspiciously like a paid one because of the exact-match anchor text. 5. Are you proposing a useful link?Making sure this is the case comes down to two things:Creating unique and valuable contentPitching contextually useful opportunitiesFor example, this very article contains unique data on the cost of buying backlinks. That’s valuable information for most SEOs. But this doesn’t mean we should pitch to every SEO article on the web. We need to look for contextual opportunities where our link will add value. Here’s an example:This article already advises its readers not to buy backlinks because they’re often irrelevant, of low quality, and come from scammers. But it doesn’t say anything about the high costs of buying links.In my opinion, this will be a useful addition to the page (with our post linked as the source).So, should you buy backlinks?Buying links is very risky, so it’s not something I’d recommend.This is especially true for legitimate business owners whose livelihoods rely on their Google rankings.However, if you fully understand and accept the high risks of buying backlinks, there’s no reason why you can’t. Does it arguably make the web a worse place? Definitely. Is it illegal? Not at all. Got questions? Ping me on X. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Keep Learning Link Building Case Study: How We Built Backlinks With a ‘Stats’ Page (And Ranked #1) In this case study, you'll learn why and how we created a statistics page, how we built links to it, and our results and takeaways from the experiment. How To Get Backlinks: Add, Ask, Earn, Buy There are only four ways to get backlinks: add, earn, ask, and buy. Link Reclamation: How to Find and Reclaim Lost Backlinks Building links is difficult, so it makes sense not to let the ones you've built and earned go to waste. That's where link reclamation comes in. How Many New Backlinks Do Top-ranking Pages Get Over Time [New Data by Ahrefs] Do top-ranking pages get links at a faster pace than lower-ranking pages? We analyzed 200,000 top-ranking web pages across 10,000 keywords to find out. Link Prospecting: How to Find Quality Backlinks for Your Website Link prospecting is about finding and evaluating potential sites to acquire quality links—a key part of any successful SEO campaign.",
  "headers": [
    {
      "level": "H1",
      "text": "Should You Buy Backlinks in 2024? It Depends"
    },
    {
      "level": "H2",
      "text": "Risks of buying backlinks"
    },
    {
      "level": "H3",
      "text": "Risk 1. Google will ignore your paid links, making them a waste of money"
    },
    {
      "level": "H3",
      "text": "Risk 2. Google will penalize and demote your website’s rankings"
    },
    {
      "level": "H2",
      "text": "Why people still buy backlinks"
    },
    {
      "level": "H3",
      "text": "Reason 1. Buying links is much easier than building or earning them"
    },
    {
      "level": "H3",
      "text": "Reason 2. Paid links can help rankings… if Google doesn’t detect them"
    },
    {
      "level": "H2",
      "text": "How much do paid links cost?"
    },
    {
      "level": "H3",
      "text": "How much do paid niche edits cost?"
    },
    {
      "level": "H3",
      "text": "How much do paid guest posts cost?"
    },
    {
      "level": "H2",
      "text": "Why do paid links cost so much?"
    },
    {
      "level": "H2",
      "text": "How to build links safely"
    },
    {
      "level": "H3",
      "text": "1. Does the site look legit?"
    },
    {
      "level": "H3",
      "text": "2. Does it get consistent search traffic?"
    },
    {
      "level": "H3",
      "text": "3. Has the site been selling links? (AKA is it a “link farm”?)"
    },
    {
      "level": "H3",
      "text": "4. Has the site been buying links?"
    },
    {
      "level": "H3",
      "text": "5. Are you proposing a useful link?"
    },
    {
      "level": "H2",
      "text": "So, should you buy backlinks?"
    }
  ],
  "author": "Joshua Hardwick"
}