{
  "url": "https://ahrefs.com/blog/buyer-intent-keywords/",
  "slug": "buyer-intent-keywords",
  "title": "Buyer Intent Keywords Convert Better. Here’s How to Find Them",
  "description": "Buyer intent keywords (or buyer keywords, high intent keywords) are search terms that suggest a user is ready to make a purchase in the near future. Here's the most reliable way to find them.",
  "content": "Mateusz Makosiewicz Marketing researcher and educator at Ahrefs. Mateusz has over 10 years of experience in marketing gained in agencies, SaaS and hardware businesses. When not writing, he's composing music or enjoying long walks. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Buyer intent keywords (or buyer keywords, high intent keywords) are search terms that suggest a user is ready to make a purchase in the near future. These users are not just browsing; they are looking for the final piece of information to make a buying decision.Often, buyer intent keywords include words related to buying, deals, discounts, reviews, and comparisons. These keywords can suggest looking for directions to get a product or service, too.Using buyer keywords for content optimization or advertising helps you reach people who are ready to make a purchase. They generally lead to higher conversion rates and a shorter buyer journey than other types of keywords (e.g. informational keywords).High-intent keywords are often more competitive and expensive. Therefore, SEOs and marketers typically blend these with other types of keywords in their strategies, using a combination of SEO (search engine optimization) and Google Search Ads (often referred to as PPC).For instance, some high-intent keywords have a high cost per click but a low keyword difficulty, making them more suitable for SEO than PPC.In this article, you will learn how to find buyer intent keywords, how to choose the best ones from a long list of keyword ideas, and whether you should use SEO or PPC to pursue them.ContentsTypes and examples of buyer intent keywordsTraditionally, SEOs sort buyer intent keywords into different groups. This grouping helps clarify differences between the keywords and makes organizing campaigns easier — if you’re new to the topic, this is something worth knowing.TypeExample KeywordsTransactional. Indicate that the user is ready to make a purchase or take a specific action, such as ordering or subscribing.order pizza, buy concert tickets, subscribe to fitness magazineCommercial. Used by users who are researching products or services before making a purchase decision.best running shoes, high-performance laptops, top eco-friendly carsNavigational. Used when a user is looking for a specific website or page.target weekly ad, wikipedia, prime login Location-based. Used by users looking for businesses, services, or products in a specific geographical area. dentist near me, vegan Brighton, co-working spaces in WarsawLong-tail. Get a small number of searches per month, tend to be longer and more specific. best running shoes for cross country, budget-friendly home office chairs, tips for organic gardening in small spaces How to find buyer intent keywordsThe most reliable way to find buyer-intent keywords is to use an SEO tool that allows you to filter through SERP features like ads and product carousels.These features suggest that Google recognizes the commercial intent behind a keyword and that advertisers also expect high conversion rates from these keywords. Also, you’ll be able to find keywords that don’t have the typical buyer intent modifiers.To show you how the process works, I’ll be using Ahrefs’ Keywords Explorer. Additionally to SERP featues filter, it also has a SERP lookup function with an AI powered intent identification feature and CPC data which will come in handy when double checking on keywords.Enter a few broad terms related to your business. You can ask AI for some suggestions.Go to Matching terms and set the SERP features fitler to: “On SERP”, “Top ads” or Shopping Ads (if you’re an e-commerce business). Hit Apply.Sort by ascending CPC to get keywords with a higher probability of high intent on top.Look for the most relevant keywords to your business. Save them to a keyword list to make them accessible whenever you need them.To verify the intent behind a keyword, click on the SERP button and examine the purpose of the top-ranking pages. To make this easier, use the Identify Intents feature; ideally, most traffic should be coming to pages promoting products or services.If you’re in a new niche, chances are there won’t be too many advertisers for your keywords; the SERP features filter won’t be as effective. In this case, use typical modifier keywords and double-check search intent by analyzing the top-ranking pages.Here are some of the modifier words you can use: buy, order, sale, best price, best, top, review, alternatives, near me, open now, in [city name].How to find competitors’ buyer intent keywordsYou can learn from your competitors’ strategies and attract some of their traffic by finding the high-intent keywords they rank for and bid on in Google Ads.Here’s how to do it in Ahrefs.Open Ahrefs’ Site Explorer and enter your competitor’s domain.Open Organic keywords report.Set the SERP features fitler to: “On SERP”, “Top ads” or Shopping Ads (if you’re an e-commerce business). Hit Apply.From there, you’ll be looking for the same signs of relevance and commercial intent as we did in the previous section. Sorting by CPC will again reveal keywords more likely to have buying intent.And if you want to spy on your competitors paid keywords, you can use Paid keywords report in the same tool.But this time, make sure you’re looking into the right country. Your competitors might be running ads in various markets with different keyword cost per click.How to choose the best keywords for your websiteChoosing the right buyer keywords for your website is a balancing act of four factors:Traffic potential: how many clicks can a given keyword generate.Conversion potential: how likely visitors generated from a keyword will become customers.Keyword difficulty: how many backlinks from unique websites will it take to rank in the top 10.Cost per click: how much each click will cost you.Here are some strategies you can use to solve this.Prioritize conversion potentialFocus on keywords that are most likely to convert into sales or leads, even if they have moderate traffic or high cost.Suppose you run an online store selling kitchen appliances. A keyword like “buy stainless steel blender online” may not have the highest search volume compared to more generic terms like “blenders.” However, it has a high conversion potential because users searching for this term are likely ready to make a purchase.Even if this keyword is moderately trafficked or more expensive to target, the focus on ready-to-buy customers can lead to a higher return on investment.Assign scores and choose the keywords with the highest totalsTo automate the scoring process you can use ChatGPT. It can take any keyword list with data in these categories and map the data to a scoring system.Here’s the prompt you can use:I have a list of keywords for my website, along with data on search volume, keyword difficulty, and cost per click. I’d like to score these keywords based on four categories: Traffic Potential, Conversion Potential, Keyword Difficulty, and Cost per Click.Take advantage of the long-tail keywordsTarget keywords that have high conversion potential but lower competition and cost.A travel agency could focus on long-tail keywords like “affordable family vacation packages in Europe.” This keyword is specific and less competitive than broader terms like “European vacations.” While it may attract fewer searches, the users who do search for it are likely looking for exactly what the agency offers, thus having a higher likelihood of conversion.Fill the competitive gapIdentify keywords that your competitors rank for, but you don’t. You can do this easily with a tool like Ahrefs’ Competitive Analysis. All you have to do is to plug in your and your competitors’ domain.For example, a keyword we could consider is “conversion rate optimization” since it’s in the digital marketing domain and we don’t rank for it at all.Should you target buyer intent keywords with SEO or PPC?Once you pick your keywords, you need to decide whether to target them using SEO, Google PPC, or even both.So, on one hand, you have developing SEO content and building links to rank. On the other, writing some ad copy, developing a landing page (if you don’t have one), and setting aside some budget for Google’s auction process. This table will help you choose the best strategy.Choose PPCChoose SEOYou’re promoting a limited-time offer, event, or launching a product.Keywords are too expensive.You need immediate, short-term results.Your niche is restricted. Hyper-competitive SERPs (search engine result pages) will make it hard to rank (i.e. lots of effort on content, lots of quality backlinks). You have a limited budget and prefer to invest time and resources rather than continuous ad spend. You want to reduce dependency on paid ads in the long run.You want to test different keywords, ad copies, or landing pages to gather data and insights. You’re building an affiliate site. SEO is essentially free traffic, which increases the ROI of your site. The traffic potential for the keyword doesn’t justify creating dedicated SEO content. So, you can use ads to drive traffic to similar content. You aim to establish your website as an authority in your industry through high-quality content and backlinks. That said, you can still use PPC to amplify your best content. You want to add some long-tail keywords to your SEO content. Sometimes ranking for all relevant secondary keywords takes too much effort and gives only temporary results. Can you use both at the same time? Absolutely, and it’s actually a smart strategy. This approach allows you to appear in multiple positions on the SERPs, increasing your chances of getting clicks. Additionally, it reduces the likelihood that your competitors will receive clicks.To illustrate, here are some of the keywords HubSpot ranks for organically but pays for, as well (the yellow line is paid traffic, blue is organic).Further reading4 Ways PPC and SEO Can Work Together (And When They Can’t)Final thoughtsBuyer intent keywords typically convert better, but it would be a mistake to focus solely on them in your search engine marketing strategy. Targeting early-stage searchers will help you build brand awareness, increase website traffic, and guide your audience through their decision-making process.Additionally, these keywords can sometimes lead directly to conversions, as some users may be more ready to buy than they initially appear. You can find out more about keyword research in our beginner’s guide.Got questions or comments? Ping me on LinkedIn. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Mateusz Makosiewicz Marketing researcher and educator at Ahrefs. Mateusz has over 10 years of experience in marketing gained in agencies, SaaS and hardware businesses. When not writing, he's composing music or enjoying long walks. Keep Learning Long-tail Keywords: What They Are and How to Get Search Traffic From Them Long-tail keywords are search queries that get a small number of searches per month. They tend to be longer and more specific than head keywords. Search Intent in SEO: What It Is & How to Optimize for It Search intent is the reason behind a search query. To rank well, creating content that aligns with search intent is critical. Learn how. What Are Keywords? How to Use Them for SEO Keywords are the words and phrases that people type into search engines to find what they're looking for. How to Find Low-Competition Keywords for SEO Learn how to find low-hanging keyword opportunities in a few steps, and how to make sure those keywords are truly low-competition and easy to rank for. How to Find Niche Keywords for SEO in 3 Steps Niche keywords can be an opportunity to attract highly targeted traffic in a short time. Here's how to find them in three steps.",
  "headers": [
    {
      "level": "H1",
      "text": "Buyer Intent Keywords Convert Better. Here’s How to Find Them"
    },
    {
      "level": "H2",
      "text": "Types and examples of buyer intent keywords"
    },
    {
      "level": "H2",
      "text": "How to find buyer intent keywords"
    },
    {
      "level": "H2",
      "text": "How to find competitors’ buyer intent keywords"
    },
    {
      "level": "H2",
      "text": "How to choose the best keywords for your website"
    },
    {
      "level": "H3",
      "text": "Prioritize conversion potential"
    },
    {
      "level": "H3",
      "text": "Assign scores and choose the keywords with the highest totals"
    },
    {
      "level": "H3",
      "text": "Take advantage of the long-tail keywords"
    },
    {
      "level": "H3",
      "text": "Fill the competitive gap"
    },
    {
      "level": "H2",
      "text": "Should you target buyer intent keywords with SEO or PPC?"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Mateusz Makosiewicz"
}