{
  "url": "https://ahrefs.com/blog/buying-a-website/",
  "slug": "buying-a-website",
  "title": "The Smart Investor's Guide to Buying a Website",
  "description": "Buying a website can help you reach a new audience, get a foothold in a new market, expand your business online, or earn \"passive\" income. Here's how to do it.",
  "content": "Despina Gavoyannis Despina is a Senior SEO Consultant with 8+ years of experience growing B2B, e-commerce, SaaS, and national brands. She's an optimist at heart, taking time to enjoy life's silver linings each day. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Buying a website can help you reach a new audience, get a foothold in a new market, expand your business online, or earn “passive” income.It’s a similar, yet simpler, process compared to merging or acquiring an existing business. But, just like with a business acquisition, not all website purchases come equal.In this post, we share tips on everything you need to know to buy your first website with confidence, including:Where you can find available websites to buyThe process for buying a websiteEssential due diligence tips to determine if a website is a good investmentCommon concerns and how to overcome themThere is no one-size-fits-all approach to buying a website or determining what a good investment will be. Following these steps will help you identify if a site is right for you or not.Contents1. Think of why you’re buying a website to begin withKnowing what your goals are with your website acquisition influences the entire process. Different types of websites are better suited to achieving different goals.If you’re seeking to reach a new audience, look for digital businesses with established audiences. For example, in 2021 Hubspot acquired media startup The Hustle and exposed its brand to new audiences in the startup and investing communities.If you want to expand your reach online, consider competing websites or those in adjacent spaces. For example, in 2016, a blog about car advice sold for over $35 million to an Australian news publication seeking to expand its online reach in the automotive industry, even though it already had an automotive media publication under its wing.If you’d like to earn more passive income, look for websites already earning a stable monthly income. Marketplaces and brokerages show earning reports of websites available for sale and in some cases, you can also continue to work with the existing team so there’s less work on your shoulders with managing the asset.Example of a website’s earnings over timeOverall, the best investments are the ones you have the skills to grow and manage. For instance, don’t buy a media publication if you have little experience growing a blog. Likewise, if you’ve never worked in eCommerce, don’t go all in on an online store, dropshipping or any kind of website that deals with physical products.2. Find potential websites to buyThe most common places to buy websites are website marketplaces and brokerages, though you can also do your own outreach and set up a private deal.Website marketplacesMarketplaces, like Flippa, allow individual sellers to list their websites for sale and to manage the negotiations and asset handover on their own.You can typically find very low-cost websites for sale on marketplaces, making them a great place to start for micro-acquisitions. You can buy anything from low-risk starter sites for three figures to seasoned websites earning thousands per month in passive income.However, it is entirely on your shoulders to do thorough due diligence and make sure you’re not buying a lemon since most marketplaces do very little verification on each listing.ProsConsLow-risk starter sites availableNo verification from the marketplaceMany options to choose fromLittle support availableDeal directly with the sellerNot all sellers are trustworthyBrokeragesBrokerages offer a more boutique experience when buying a website and are a great place for beginners with some extra cash saved up due to the extra support you can receive.Instead of listing every website available to buy, brokerages typically have curated lists of websites their internal teams have verified. For example, Empire Flippers and FE International are two brokerages selling different kinds of online businesses.Typically brokerages deal with larger transactions and you will be hard-pressed to find available websites for sale in the three or four-figure ranges so it’s only advisable to search here if these deals are well within your financial means.ProsConsReceive direct support from your brokerWebsites tend to be more costlyTailored experienceYou may need to pay a brokerage feeChoose from verified websitesPrivate dealsIf you have some experience with negotiating business deals, you can put those skills to work and secure private website buying deals.Arguably, the best sites to acquire are the ones people don’t want to sell. Plus, you don’t have to worry about outbidding others to acquire the site.To find such websites, enter a well-known site in your niche into Ahrefs’ Site Explorer and navigate to the Organic Competitors report. Here you’ll see up to 20 websites performing well in the niche:Alternatively, if you don’t know any sites in your niche, try this method instead:Go to Ahrefs’ Keywords ExplorerEnter a handful of keywords that represent your nicheGo to the Traffic share by domain reportThis will show you the websites getting the most estimated organic search traffic from those keywords.Either way, you can then choose sites to investigate further based on metrics like how much traffic they’re getting or how much they’ve grown over a specific time period.If you like any of them, reach out to them privately to negotiate a sale.ProsConsNo competition to outbid youRequires existing negotiating skillsFind higher quality websitesNeeds extra legwork to find great dealsNegotiate your terms more comfortably3. Audit the websites that seem interestingNo matter how you’re looking for available websites to buy, you’ll need to audit each and every one to weed out the lemons from the goldmines.Two essential checks to perform are for a website’s traffic and its backlink profile. Here’s the process in a nutshell:Enter the site in Ahrefs’ Site ExplorerCheck out the Performance graph in the “Overview” reportFilter for referring domains and organic traffic for a TL;DR viewLook for any big drops in traffic or any unnatural-looking spikes in referring domains. Both of these can signal either declining performance overall or some shady things going on in the background.For example, if you notice a lot of links added in a short period of time, the seller may have purchased links in bulk and there is a risk of the website receiving penalties from Google in future.You can then take a closer look at a site’s link profile in the Backlinks report. Exclude “Best links” to hone in on potentially problematic links.Paid links usually use the target keyword as the anchor text (the clickable part of the link) and come from poor content on low-quality sites, so look out for sites with lots of those.For example, look at this link to a page about sleep apnea:Based on this data, we can see that it:Comes from a low authority site that nobody’s ever heard ofComes from a page with zero estimated trafficHas exact-match anchor text (“sleep apnea”)If we look at the referring page itself, we can also see that the content is extremely low quality. The site is plastered in ads and although it’s not visible in the screenshot below (because of all the ads!), it has lots of suspicious outlinks too.Conclusion? This is almost certainly a paid link. If a large percentage of the links to the site you’re considering look like this, that’s a major red flag.Another of my favorite checks to do at this stage is to look at the Site Structure report to get a feel for the information architecture of the website and the traffic distribution across the content.Poorly structured websites with decent performance are my favorite kind to work on. Generally, they’re run by people who aren’t the most SEO savvy, but they have built a genuine audience who like what they’re putting out there. Implementing some quick and easy SEO best practices can often see major gains on sites like this in a relatively small timeframe.4. Evaluate the niche and broader marketTo assess the state of the market, check out Keywords Explorer for the top categories or broad terms and assess the search potential over time. Here are some common patterns you may see:Steady markets are great for consistent, recurring revenue and tend to form the bread and butter foundation of a website’s performance.Seasonal markets are great for growing your audience and short injections of new revenue but offer inconsistent income.New and growing markets typically have lower competition levels and offer a great opportunity to become the market leader.Declining markets offer a great opportunity to revolutionize an outdated way of doing things and to absorb an existing, knowledgeable audience.In short, there are opportunities in every kind of market, though the best ones for you depend on your goals.In addition to understanding the market, you’ll need to also scope out existing competitors in the space and how the website you’re looking at is positioned against them.The Organic Competitors report in Site Explorer will show you the top websites competing for similar keywords and how much bigger or smaller they are compared to the website available for sale.Having bigger competitors is not a bad thing. In fact, it could be a sign that the market is lucrative and worth investing in.However, if the website you’re looking at is currently not very competitive, it will also require more skills and technical knowledge to improve it.5. Reach out to the seller, ask questions and do due diligenceWebsite due diligence is the process of dotting your i’s and crossing your t’s when evaluating whether a website is a worthwhile investment.No matter if you’re reaching out to a seller through a marketplace or brokerage or if you’re securing a private deal, this is an essential step of the process.You can ask the seller to share access with analytics tools and some financial accounts and you can often schedule a video chat to ask more detailed questions about the website.Here are some questions to consider.Have you optimized the website for SEO?If a seller has optimized the site for SEO, it helps to know exactly what they’ve done. You can also learn a great deal about what they tried that worked wonders and what didn’t work as well.If the seller has not done any SEO, that may be ok depending on your goals. Many people don’t know where to start with optimizing a website and this presents a great opportunity for buyers with SEO know-how to take the website to the next level.You can also verify the actual SEO performance of the website using Google Search Console if the seller has set it up. If they haven’t, Ahrefs’ Site Explorer is a great alternative for estimating overall organic performance.Where does the majority of the traffic come from?Make sure you check out the different countries and channels the website receives traffic from. Both of these can be assessed in Google Analytics (or similar tools) so make sure to request access from the seller.In particular, check out the “Acquisition” reports to assess what channels users are coming from and how well SEO, ads and social campaigns may be working.You should see something like this:You should also check out the User Attributes > Demographic Details report to see what countries people are visiting the website from. It will look a little like this:Have you done any link building?Some sellers are honest about purchasing links or using private blog networks (PBNs), which opens up the opportunity for you to ask more follow-up questions about what they did.Other sellers are not so forthcoming which is why scoping out the backlink profile in Ahrefs is critical. Poor quality paid links can have very nasty consequences for websites.How was your content created and how often do you upload new content?With the latest move towards helpful content and combating the rise of AI content, it can be a big boon to know exactly how the seller went about content creation.Did they create everything themselves?Do they work with subject matter experts?Did they use AI?Content creation is the number one activity you can do from day one after you buy a website to help it reach new heights or to improve its performance if it’s a bit of a fixer-upper.If you’re comfortable creating all the content, great! If not, it really helps to know what relationships the seller had with writers, editors and subject matter experts that you can leverage.It also helps to know how frequently they were publishing content so you can maintain a similar cadence. You can increase the cadence, but be wary of going too fast too quickly. Big jumps in content production can be a sign the seller started using AI content.You can use Ahrefs to spot mass AI-generated content in the Top Pages report and verify the information the seller has shared with you about their process:Publishing 14k pages in a matter of a few weeks.How long before the “Wrath of Google” kicks in?Make your bets, ladies & gentlemen. pic.twitter.com/Nf4lQZcj9K— Tim Soulo 🇺🇦 (@timsoulo) December 14, 2023 What do you see as the low-hanging fruit for a buyer?Many sellers and website brokers will be happy to share the low-hanging fruit opportunities for continuing to grow the website. Asking questions along this line of thought will help you uncover opportunities you may not have become aware of during your research.About 90% of the time, the best opportunities will come from things like:Targeting additional keywordsUpdating contentClosing content gapsBuilding more or better linksExploring additional channels like paid or social platformsHow are traffic and profits diversified?In our book, this is the most important question to consider if the reason you’re buying a website is to establish a passive income stream.Ask the seller about the history of profit distribution across their top pages or products. You can also assess this yourself in the website’s analytics.Look at the top three pages or products and see if any are pulling in more than 20% of the traffic or profits. It could be a sign that the website is not very well diversified.Sometimes this is ok and could be used as an opportunity, but other times it may be a major risk that is a deal breaker for you.6. Negotiate the sale and migrate the assetsIf everything is looking and feeling good, it’s time to negotiate the sale and then migrate the assets into your possession.You’ll likely need to put forward an offer you think is fair for the asset. If a broker is involved in the sale, you can negotiate with them or directly with the seller until an agreement is reached.Keep in mind that many website and business sales fall down at the negotiating phase.Before you start negotiating, decide what the asset is worth to you and make an offer at around 70% of that amount. Then, negotiate with the seller to reach a deal, but don’t get too excited and exceed your personal maximum.Once you’ve secured the deal, it’s just a matter of transferring ownership of all the assets attached to the website, including:Domain nameHostingWebsite filesEmail accountsGoogle Business Profile (if any)Social media accounts (if any)Financial accounts (if possible)In some cases, you may need to migrate the website to a new hosting account and if this isn’t managed properly, it could affect the website’s performance. Check out our full website migration process to ensure this step goes smoothly for you.FAQs when buying a website for the first timeIf you’re like most first-time website buyers, you’ve probably got a few questions brewing. Here are answers to the most common ones we see.Can a website lose performance after a sale?Yes, website performance can be affected by a few things immediately after a sale:A poor migration (especially if consolidating the new website into an existing one)Inflated figures in the seller’s reportsDishonest sellers removing any fake links they used to inflate the SEO performanceYou can avoid this issue by paying close attention during the due diligence process and listening to your gut as you ask the seller various questions.It may also be worth paying for a reputable SEO professional to oversee the migration of the website and its assets after the sale so you risk minimal losses in performance.How do I know if a seller is legitimate?If you’re buying a website through a marketplace like Flippa, you’ll need to pay more attention to traffic and profit validation to make sure you’re not buying a lemon the seller has painted as a chunk of gold.Brokerages have a much more rigorous process for verifying both sellers and analytics.Overall, you’ll have to rely on the information you’re able to gather from the seller along with your intuition on whether they are being transparent and can be trusted.How do you know the website will be transferred after you pay for it?You have the option of paying through escrow for almost all website transactions that occur through a marketplace or brokerage. Escrow is a payment method designed to minimize risk for both sellers and buyers in high-value transactions.Instead of paying the seller everything upfront, you’ll pay a deposit to the escrow provider. Consider it like a legal holding account. Your funds will be kept in this account until certain conditions are met, namely all website files are transferred to you successfully.Once you’ve received the files, account access and the website is officially yours, the escrow service releases your payment to the seller. It’s the most secure way to buy a digital asset minimizing your risk substantially.Key TakeawaysOverall, buying a website can be a very rewarding experience! Whether a specific website is a good investment for you depends on your goals, skills, and resources.But if you dot your i’s and cross your t’s with due diligence, you can’t go wrong. If this is your first time buying a website and you have some decent resources to put towards this purchase, we recommend going through a brokerage like Empire Flippers if you’d like the security of carefully vetted websites.If you already have some experience up your sleeve, perhaps exploring some private deals may lead to more rewarding investments to grow your portfolio.Got any questions? Reach out on LinkedIn. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Despina Gavoyannis Despina is a Senior SEO Consultant with 8+ years of experience growing B2B, e-commerce, SaaS, and national brands. She's an optimist at heart, taking time to enjoy life's silver linings each day. Keep Learning How to Do a Basic Website Audit to Improve SEO and UX (in 10 Steps) Audit your website for SEO performance issues, things that may be costing you conversions, and user-experience issues that could be confusing visitors. How to Find Who Links to Your Website (and What to Do Next) Do you want to know who links to yours or a competitor’s website? Learn how to do that in this straightforward guide. 9 Reasons Your Website Isn’t Showing Up On Google (and How to Fix It) Not seeing your website in Google's search results? Learn why you're not in't showing up on Google and how to fix it. How to Increase Website Authority (Domain Rating) Learn what website authority is, how Domain Rating (DR) is calculated and how to increase your score the right way. SEO for a New Website: 8 Important Steps The best time to ensure your site is SEO-friendly is when you're building it. We've distilled the process into eight key steps.",
  "headers": [
    {
      "level": "H1",
      "text": "The Smart Investor’s Guide to Buying a Website"
    },
    {
      "level": "H2",
      "text": "1. Think of why you’re buying a website to begin with"
    },
    {
      "level": "H2",
      "text": "2. Find potential websites to buy"
    },
    {
      "level": "H3",
      "text": "Website marketplaces"
    },
    {
      "level": "H3",
      "text": "Brokerages"
    },
    {
      "level": "H3",
      "text": "Private deals"
    },
    {
      "level": "H2",
      "text": "3. Audit the websites that seem interesting"
    },
    {
      "level": "H2",
      "text": "4. Evaluate the niche and broader market"
    },
    {
      "level": "H2",
      "text": "5. Reach out to the seller, ask questions and do due diligence"
    },
    {
      "level": "H3",
      "text": "Have you optimized the website for SEO?"
    },
    {
      "level": "H3",
      "text": "Where does the majority of the traffic come from?"
    },
    {
      "level": "H3",
      "text": "Have you done any link building?"
    },
    {
      "level": "H3",
      "text": "How was your content created and how often do you upload new content?"
    },
    {
      "level": "H3",
      "text": "What do you see as the low-hanging fruit for a buyer?"
    },
    {
      "level": "H3",
      "text": "How are traffic and profits diversified?"
    },
    {
      "level": "H2",
      "text": "6. Negotiate the sale and migrate the assets"
    },
    {
      "level": "H2",
      "text": "FAQs when buying a website for the first time"
    },
    {
      "level": "H3",
      "text": "Can a website lose performance after a sale?"
    },
    {
      "level": "H3",
      "text": "How do I know if a seller is legitimate?"
    },
    {
      "level": "H3",
      "text": "How do you know the website will be transferred after you pay for it?"
    },
    {
      "level": "H2",
      "text": "Key Takeaways"
    }
  ],
  "author": "Despina Gavoyannis"
}