{
  "url": "https://ahrefs.com/blog/content-marketing-for-small-business/",
  "slug": "content-marketing-for-small-business",
  "title": "13 Content Marketing Ideas for Small Businesses",
  "description": "Here are 13 actionable content marketing ideas you can apply right away to your small business.",
  "content": "Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Content marketing is hot today.Look at the meteoric rise in interest over the past 20 years, according to Google Trends:Many small businesses have successfully grown using content marketing. Beardbrand, Luxy Hair, Lodge Cast Iron—the examples are endless.If you’re a small-business owner, you’re probably wondering if you should be using content marketing for your business too.In this post, I’ll run through some reasons why you should do content marketing, plus 13 ideas you can apply to your small business.Why should you do content marketing for your small business?Here are three reasons why you should consider content marketing for your business.1. Get more trafficNo matter what you sell, there are only so many people who are willing and able to buy at any given moment.So if you’re only targeting people who are directly searching for your product, your traffic will be limited.Take, for example, our own toolset. We have five main tools:Altogether, these pages account for ~10,000 monthly visits, which is only around 1% of our total search traffic.If we had simply relied on those five pages, our business wouldn’t have grown.Instead, we’ve created hundreds of pieces of content that now rank on Google for more than 140,000 keywords and generate more than 930,000 search visits per month.This is how we’ve grown our company to eight figures in annual recurring revenue (ARR).2. Improve brand awarenessAs we’ve established, most people don’t look for products and services directly. Instead, they look for solutions to problems or answers to questions.So, when you create content around these problems or questions, you can use this opportunity to introduce your brand to your potential customers. A prospect knowing your brand means you’re at least one step closer to turning them into customers.Here’s an example. Billy Blogger started a blog and is frustrated at how his blog traffic isn’t increasing. So he searches for “how to increase my blog traffic” on Google and discovers our article.From there, he learns that one method to get more traffic is to write about topics with search traffic potential. He also discovers that he can use our free tools to do that.With just one article, we’ve turned Billy Blogger from someone who didn’t know we existed to someone who now knows our brand. Repeat that at scale, and you can see how content marketing works to improve brand awareness.3. Reduce your marketing costsContent marketing can be cheaper over the long term.Take again, for example, the Ahrefs blog, which receives around 260,000 search visits per month. If we had to acquire all of that traffic from Google Ads, we would have to pay an estimated $355,000 per month or $4.2 million per year.Considering that our content marketing team isn’t paid $4 million in annual salaries, we can say that content marketing is cheaper over the long term.Recommended reading: Why Is Content Marketing Important? 5 Reasons13 content marketing ideas for small businessesConvinced that you should be doing content marketing? Here are some ideas you can consider implementing.1. Answer questions people are searching forWe’ve established this earlier: Potential customers don’t search for your products directly, but for questions they want answered.So your goal is to figure out what these questions are and create content that matches them.How do you find these questions?The easiest way is to enter a relevant keyword into our free keyword generator tool and switch the tab to Questions.If you’d like to see more questions, then you can use a professional keyword tool like Ahrefs’ Keywords Explorer.Enter a relevant keyword into Keywords ExplorerGo to the Matching terms reportSwitch the tab to Questions As you can see, there are over 260,000 potential questions you can create content for. If you want to narrow the list further, set the Keyword Difficulty (KD) filter to a maximum of 10.Eyeball the report and pick out those most relevant to your business.2. Create a statistics pageJournalists and bloggers are always looking for data to back up their claims. This is why businesses and websites publish data studies and original research—their goal is to get mentions and links from these authoritative websites.But as a small business, it can be difficult for you to publish original research. There is one way around it, and that is to curate data.That’s what we did when we published our post on SEO statistics. To date, it has accumulated a total of 2,700 backlinks from 1,300 unique websites:It also ranks #1 for the keyword “SEO statistics”:Learn how we created this page and built links to it in this video series:https://www.youtube.com/watch?v=eTF6OBwidhc&list=PLvJ_dXFSpd2u_ABxIRO6RVK3ucKyzn96Y&ab_channel=Ahrefs3. Write for other sites in your industryThere are important topics or questions you want to rank high on Google for. But some of these can be very competitive. As a small business, it can be difficult for you to compete, especially when it seems like other sites have endless budgets.But there’s one way around it: take advantage of these sites’ authority to rank.How? Most big sites are constantly looking for great content to publish. So use that opportunity to create a guest post for them and rank that page for the keyword you’re targeting.Here’s an example. A few years back, I wrote a guest post for SmartBlogger. Even though it’s been some time, that post still ranks #5 for the keyword “niche website” and generates around 250 monthly search visits:Since that post promotes our tools, we’re basically introducing our brand to more new people.Here’s how to find sites that you can potentially “guest post” for:Go to Ahrefs’ Content ExplorerSearch for your topicFor example, if we search for “keto diet,” you’ll see around 3 million pages you can target.But that’s too many pages to look through, so let’s set a few more filters to narrow down the results:Website traffic: 500+Words: 500+Language: EnglishOne page per domain – CheckedExclude homepages – CheckedExclude subdomains – CheckedLive & Broken – Only liveFilter explicit results – OnThis reduces the number of pages to ~21,000. Since you’re looking for authoritative sites to “piggyback” on, you can also set a Domain Rating (DR) filter for sites with a DR of >60.Evidently, 4,000 pages is a much more manageable list. Go through the list and pick out those sites that are likely to accept your guest post pitch.Then find the website owner’s or editor’s email, reach out, and pitch your topics to them. (Remember, it should be those you want to rank for!)Recommended reading: Guest Blogging for SEO: How to Build High-Quality Links at Scale4. Rewrite or update outdated content on other websitesRiffing on the same idea: What if, instead of pitching an entirely new guest post, you pitch to rewrite or update an older piece of content on other websites?Not only can you rewrite the article to naturally include your product (with permission from the editors, of course), you can “piggyback” on these sites to rank for the keywords you want.Our chief marketing officer, Tim Soulo, suggested this some time back:What if.. ..instead of reaching out with an offer to write a guest post for someone…..you would find their old and outdated post that dipped in search traffic and offer them to rewrite it?🤔 — Tim Soulo 🇺🇦 (@timsoulo) August 13, 2019Here’s how you can find authoritative sites that have outdated content you can offer to update:Go to Ahrefs’ Content ExplorerSearch for a relevant topicCheck Exclude homepagesCheck Exclude subdomainsToggle Filter explicit resultsSet the Language filter to English (or the language you write in)Set the Published filter to an outdated period (e.g., 2010 - 2015)Set the DR filter to something high, like 50Look through the list and see if there are any articles you can offer to rewrite. Find the website owner’s or editor’s email, reach out, and pitch to them.5. Update your contentAs you’re updating or rewriting content for other websites, don’t forget to do that for your own too.Some of your content may not rank the first time, and that’s perfectly fine. Simply rewrite and try again.The easiest way to figure out which of your content needs rewriting is to use our free WordPress SEO plugin.Then follow the guide below to learn the best way to republish your content.Recommended reading: Republishing Content: How to Update Old Blog Posts for SEO6. Partner with influencers to create content around your brandCheck out this video:https://www.youtube.com/watch?v=bSaZRXaLxBE&ab_channel=Wah%21BananaIt may look like a comedy sketch, but it’s actually a clever skit designed to promote a video projector.Content marketing doesn’t always mean creating your own content. You can also partner with others, such as influencers, to create content for your brand too.From YouTube to Instagram, TikTok to Twitter, there are many ways you can partner up with influencers to create content. For example, a restaurant that invites influencers for a tasting session can get itself featured in a review.If mega influencers are out of your reach, don’t worry. You can always work with nano or micro influencers to reach more people at lower costs.Recommended reading: Influencer Marketing: Definition, Examples, and Tactics7. Promote your contentYou can’t create content and expect people to magically find them. It doesn’t work that way. Instead, you have to put it in front of your target audience. You have to promote it.Here’s what we do every time we publish a new piece of content:Share it on all our social channels (Facebook, Twitter, LinkedIn)Include it in our weekly Ahrefs’ Digest newsletterGet each individual author to share and/or create a Twitter thread about itRun ads (Facebook, Quora, etc)You’ll have to do at least this much to get your content out there—or if you’re a small site, even more. I recommend following this checklist, which includes content promotion tactics to help you get the word out:https://www.youtube.com/watch?v=PoVYweKH4ck&feature=emb_title&ab_channel=Ahrefs8. Create a comparison pageLike it or not, your customers will compare. After all, they’ll always want the biggest bang for their buck.So what you can do is to create a “versus” page where you compare the pros and cons between your business and a competitor’s.How do you know who your customers are comparing you with? Here’s how to find out:Go to Ahrefs’ Keywords ExplorerEnter your brand nameGo to the Matching terms reportUnder the Terms menu, choose “vs” (or some other term that signifies comparison)For example, if we’re ConvertKit, we can see that people are comparing us with other email marketing services like MailChimp, Flodesk, ActiveCampaign, and more.From here, you can choose to create one page each for every comparison. That means you’ll have a page for “convertkit vs mailchimp,” another for “flodesk vs convertkit,” and so on.While that’s the most common way to do it, it’s not the only way. At Ahrefs, we decided to go counter-intuitive and create one page for all our comparisons.So far, it’s been working for us, and we’re ranking for most of the comparison-related queries:One page or many—the choice is up to you.9. Interview industry expertsNo matter how familiar you are with your industry, it’s almost impossible to know and understand every inch of your niche.Here’s an example: We wanted to tackle the topic “Google penalties” on our blog. But we are fortunate enough to have never encountered a Google manual action. So even though we have SEO experts on our team, that makes us “unqualified” to talk about the topic.So we reached out and interviewed experts:We have done this a number of times—for our posts on SEO consultants, SEO job descriptions, and more. You should do the same too.Not only does this help you cover topics that you may not know much about, but you’ll also be in a better position to improve your website’s expertise, authoritativeness, and trustworthiness (E-A-T)—which are important for ranking higher on Google.Recommended reading: What Is EAT? Why It’s Important for SEO10. Target seasonal eventsEvents like Valentine’s Day, Black Friday, Singles’ Day, and Christmas are when people are more than happy to splurge. Creating content around these events can generate awareness for your business—and potentially capture these trigger-happy customers who will spend on your products.Here’s how to find seasonal topics to create content around:Go to Ahrefs’ Keywords ExplorerEnter a few relevant keywordsGo to the Matching terms reportIn the Include box, enter a few holiday keywords (e.g., Black Friday, Father’s Day) and choose Any word.From here, eyeball the list for relevant topics you can target, then create content that ranks for them.Recommended viewing: Holiday SEO Tips to Maximize Organic Traffic11. See what people are discussing on RedditKnown as the “front page of the internet,” Reddit is a huge community with 430 million users. The beauty of Reddit is that it is neatly split into multiple sub-communities—known as subreddits—that span a variety of interests.That means that a community about your niche is likely on Reddit. If you can find out what people in your community are discussing, you can create content around those topics too.For example, let’s assume you run a site about the keto diet. If you browse through the subreddit r/keto, you’ll find a couple of cool topics you can write about.Here’s something even better: take these topics and enter them into Ahrefs’ Keywords Explorer to see if they have search traffic potential.Then create content that ranks for them.12. Create a glossaryIf your industry has a lot of specific and difficult terminologies, you can consider creating a glossary that defines and demystifies them.For example, the SEO industry has a lot of terms that people outside the industry may not fully grasp. That’s why we recently published a glossary of SEO terms that people should know.Since we published that post, its traffic has been gradually increasing:Ideally, your glossary should internally link to your own posts about those topics—just like what Wikipedia does. So if you don’t have those posts, it’s time to start creating.As you can see, the best part about creating a glossary is that it basically lists out all the topics you need to cover. With a glossary, your content calendar is practically set for the next year and beyond.13. Use Google Trends to find “out of the box” keyword ideasGoogle Trends is a great way to discover topics that are trending in your industry. You can cover these topics before other sites do. To do that, simply search for a relevant keyword and scroll to the Related queries section.For example, if we own a gym, we can search for “weight loss”:Scrolling through the list gives us a couple of good content ideas we can target, such as “mike pompeo weight loss” and “alec baldwin weight loss.”We can take the idea further. If you notice, most of the trending terms are related to X celebrity/famous person.Extrapolating this further, we can assume that beyond the current group of famous people seen on Google Trends, searchers are also looking for other famous people’s weight loss regimes.So here’s what we’ll do:Go to Ahrefs’ Keywords ExplorerSearch for the same term (e.g., “weight loss”)Set a Word count filter to four words (the length of a person’s name in the Western world + weight loss. If you’re targeting other countries, such as South Korea, you may want to extend it to five words).Lo and behold. You’ll see around 150,000 keywords, most of them about a particular celebrity’s weight loss regime. They’re not of crazy difficulty either. These are all great topics to target.Final thoughtsThe ideas above are a great way to kickstart your content marketing. But if you want to execute content marketing successfully as a marketing channel, you’ll need to have a strategy.So before you execute any of the above tactics, I recommend following the guide here to create your own content strategy.Any questions or comments? Let me know on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Keep Learning 11 Powerful Content Marketing Ideas (With Examples) Time is limited and you want to spend your content efforts wisely. Here are 11 powerful content marketing ideas you can start with today. 16 Ways to Generate Stellar Content Ideas Here are 16 strategies for content inspiration, helping you to uncover stellar topics that will bring your audience directly to your blog. Content Ideation: 8 Tips to Find Infinite Ideas Eight very different, very useful sources of inspiration for your content marketing. Why Is Content Marketing Important? 7 Reasons to Start Content Marketing Here are seven reasons why content marketing is important and deserves to be the marketing channel you should focus on. 100 Blog Post Ideas to Get Traffic Coming up with blog post ideas doesn't have to be a chore. Beat writer's block with these 100 ideas.",
  "headers": [
    {
      "level": "H1",
      "text": "13 Content Marketing Ideas for Small Businesses"
    },
    {
      "level": "H2",
      "text": "Why should you do content marketing for your small business?"
    },
    {
      "level": "H3",
      "text": "1. Get more traffic"
    },
    {
      "level": "H3",
      "text": "2. Improve brand awareness"
    },
    {
      "level": "H3",
      "text": "3. Reduce your marketing costs"
    },
    {
      "level": "H2",
      "text": "13 content marketing ideas for small businesses"
    },
    {
      "level": "H3",
      "text": "1. Answer questions people are searching for"
    },
    {
      "level": "H3",
      "text": "2. Create a statistics page"
    },
    {
      "level": "H3",
      "text": "3. Write for other sites in your industry"
    },
    {
      "level": "H3",
      "text": "4. Rewrite or update outdated content on other websites"
    },
    {
      "level": "H3",
      "text": "5. Update your content"
    },
    {
      "level": "H3",
      "text": "6. Partner with influencers to create content around your brand"
    },
    {
      "level": "H3",
      "text": "7. Promote your content"
    },
    {
      "level": "H3",
      "text": "8. Create a comparison page"
    },
    {
      "level": "H3",
      "text": "9. Interview industry experts"
    },
    {
      "level": "H3",
      "text": "10. Target seasonal events"
    },
    {
      "level": "H3",
      "text": "11. See what people are discussing on Reddit"
    },
    {
      "level": "H3",
      "text": "12. Create a glossary"
    },
    {
      "level": "H3",
      "text": "13. Use Google Trends to find “out of the box” keyword ideas"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Si Quan Ong"
}