{
  "url": "https://ahrefs.com/blog/content-marketing-strategy/",
  "slug": "content-marketing-strategy",
  "title": "How to Create a Winning Content Marketing Strategy (+ Template)",
  "description": "We share how to create a content marketing strategy to help attract your target audience and influence their buying decisions.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Not all content marketing strategies are created equal. Some help you achieve business goals, and others don’t.This guide will teach you how to create one that does the former, not the latter. But first, the basics…ContentsWhat is a content marketing strategy?A content marketing strategy is a plan for creating and distributing content to attract your target audience and influence their buying decisions. It answers questions like who you’ll create content for, what type of content you’ll create, and where you’ll distribute it. For example, say you’re creating a content marketing strategy for a shipping company:Your who might be college students (as they need to move stuff to their dorm).Your what might be useful blog posts, like the ultimate college packing list.Your where might be organic search (i.e., ranking in Google). Why do you need a content marketing strategy?Having a content marketing strategy improves your chances of content marketing success. This is according to data from CMI’s annual B2B Content Marketing report.When asked, 64% of people experiencing content marketing success said they had a documented strategy. Only 19% of those not experiencing success had one.Having a documented content strategy also:Helps content creators stay focused – If you want writers to create content that aligns with your strategy, they need to know what your strategy is.Makes it easier to onboard new content creators – Hired a new writer? Just send them your content strategy for instant onboarding.Saves you from creating pointless content – Every piece of content should contribute something to your business. You’re just wasting time, money, and effort if it doesn’t. How to create a content marketing strategyPeople seem to massively overcomplicate this process. I read a few similar guides before putting this one together, and I couldn’t follow any of them. They made it feel like the most complicated thing ever that would take an entire marketing department six months to complete.So I’m going to keep things simple and show you how to do it by answering four questions. I’ve even created a template to help, which you can download below.Download our content marketing strategy templateHere’s the Google doc. Let’s start at the top.1. Set a goal (“why am I creating content?”)SMART goals. CLEAR goals. OKRs… the list of “fun” content marketing goal-setting frameworks is seemingly endless. Which one should you use? How about none of them?Don’t get me wrong. These frameworks have their uses, but the high-level goal of content marketing is pretty simple: influence your audience’s buying decisions by showcasing how your product or service helps to solve their problems.That said, it’s fine to lean into specific benefits depending on what you’re trying to achieve.For example, if your priority is to improve customer retention, you may want to focus your efforts on content that helps them get more out of your product.Our keyword clustering guide is a good example of this. If we check Ahrefs’ Keywords Explorer, we see that this is quite a niche topic with just 500 monthly searches in the U.S.: However, it’s a task that many of our customers do all the time—and many don’t realize they can do it in Ahrefs. On the other hand, if our priority is to increase authority and establish ourselves as the industry-leading source of search data, we can focus on publishing more studies like our analysis of 3M+ keywords to see how many keywords you can rank for with one page:Since publishing, it has earned backlinks from an estimated 621 referring domains (linking websites): That’s a lot of people referencing our study.2. Know your audience (“who am I creating content for?”)Given that you created a business to serve certain audience segments, you should already know the answer to this question. For example, if you have an all-natural pet food product, you’re not targeting all pet owners because that’s too broad. You’re targeting health-conscious pet owners who care deeply about what their pets eat.To give a real example, we’re not targeting all marketers. We’re targeting people who want to drive more search traffic to their websites.Is this oversimplified? Maybe. But we’re a $100M+ ARR company, and it’s served us just fine so far. That said, you can always create a buyer persona if it helps. This is an imaginary person who represents the common characteristics of your ideal customer. Learn how in our guide to creating a buyer persona.3. Understand where your audience hangs out online (“where should I publish content?”)Given the number of places you can publish content on these days, this can be overwhelming.Here are just a few of the many options:BlogYouTubeTwitterRedditPodcastsSo which one should you choose? Simple. The one where your audience hangs out.Let’s look at a few ways to figure this out.a) Trust your instinctGiven that you created a business to serve a certain audience, you probably already have some idea where your audience hangs out. For example, we know that SEOs get most of their information from blog posts and videos because… well, we’re SEOs and this is how we learn things.b) Ask themThere are plenty of survey companies you can pay to do this for you. c) See if they’re using GoogleIt’s a pretty safe bet that your audience uses Google to discover content. In fact, according to a 2019 BrightEdge report, 53.3% of all website traffic comes from organic search.This means that publishing written content and using SEO to distribute it is a good content strategy for most brands.However, there are some niches where Google isn’t a popular way to find information, so it’s always best to double-check.Here’s how:Go to Ahrefs’ Site ExplorerEnter the domain of a popular blog in your nicheCheck its estimated organic trafficFor example, if you sell BBQ equipment, you can enter the popular grilling blog, heygrillhey.com:In this case, the blog is getting an estimated 759K monthly search visitors, so it’s obvious people are using Google to discover content about this topic.Don’t know of any popular blogs in your niche? Here’s how to find some: Go to Ahrefs’ Content ExplorerEnter a few broad topics related to your niche separated by the “OR” operatorSelect “In title” from the dropdown and run the searchFilter for websites with traffic <500K to exclude big brandsGo to the Websites tabFor example, if we search for “bbq OR grill,” we see a bunch of niche blogs with plenty of traffic:4. Choose your main content type (“what kind of content should I publish?”)Once you know where your audience discovers and consumes content online, the type of content you need to publish is usually obvious.For example, if people are searching Google, you’ll want to create blog posts and distribute them there using SEO. This is what we do, and our blog currently gets an estimated 560K monthly search visits:If, on the other hand, they hang out on TikTok or YouTube, you need to create videos.We do this too, and some of our videos have had millions of views:Are there other types of content you could create?Absolutely. But blog posts and videos tend to be the most popular.They also:Don’t require tons of resources to create – You don’t need developers, designers, or expensive tools. I’ve written blog posts in the Notes app on my phone before, and you can create decent videos with your phone camera too.Can attract consistent traffic – If you can rank them in Google or YouTube search, they’ll usually get consistent traffic month after month. The same can’t be said for platforms that rely more on “virility” like TikTok.Either way, the important part is to focus on just one content type to begin with. Once you’ve mastered that, you can move on to other types and channels. Content marketing strategy templateJust in case you missed the link at the start of the last section, here’s a simple content marketing strategy template I created to get you started.Download as Google docHere’s an example of how it looks once completed: Why am I creating content?To influence our audience’s buying decisions by showcasing how Ahrefs helps to solve their problems.Who am I creating content for?People who want to drive more search traffic to their websites (business owners, affiliate marketers, e-commerce stores, etc.).Where will I publish content?The Ahrefs Blog (because my audience uses Google to search for information).What type of content will I create?Blog posts.Beyond content strategy (things that don’t matter)If you’re thinking the strategy above misses “key” elements you’ve seen in other guides, you’re right—and it’s intentional. A content marketing strategy should be simple and focus on the big picture (who, what, why, how), not everything surrounding it.Let’s explore why these elements are undeserving of your focus at the strategy stage.Brand story/positioningA brand story summarizes how your brand came to be, talks about its purpose, mission, and values, and wraps it all in an engaging narrative (i.e., story).Here’s a great example of one from Innocent Drinks: Could having a brand story like this help to influence your content strategy? Sure. Is it absolutely key for creating a winning content strategy? Absolutely not. Competitor researchThere’s no point in creating some big, overwhelming competitor research document before working on your content strategy. It’ll just slow you down and muddle your brain. Instead, do competitor research as you go like we did above. Content calendarA content calendar tells you what you’re going to publish and when.Here’s an example of our old one: Having a content calendar has its benefits, but trying to create one at the strategy stage is like trying to plan a trip itinerary before choosing a destination. You need to plan your content first. Content distribution planIf you understand where your audience hangs out and choose a content type based on that, you’re already halfway there on the distribution front. Sure, there’s more you can do to get eyeballs on your content. That’s why I wrote an entire guide to content distribution. But I suggest focusing on planning and creating content first.Content pillars and clustersTopic clusters, otherwise known as content hubs, are interlinked collections of content about a topic. Here’s how they’re structured:Again, these make sense, but trying to figure these out at the strategy stage is like trying to organize a bookshelf before you buy any books. (Yes. I’m big on analogies. Sue me.) Content auditA content audit is where you analyze the performance of existing content to find opportunities for improvement. They’re useful, but not yet. You can’t audit content you don’t have. Business planC’mon now. If you haven’t got a business plan, I think you have bigger problems to worry about than creating a content marketing strategy. Don’t you?What next?Now you know what you’re doing, you need to plan how to do it. Learn more in our guide to content planning. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Keep Learning How to Create a Winning Blog Content Strategy in 7 Steps A blog content strategy is a vision and a plan that you have for your blog. It should be aligned with your business goals and your overall content strategy How to Create an SEO Content Strategy (Follow the Ahrefs’ Framework) This is a guide on how Ahrefs’ SEO content strategy works. Use it as inspiration for your own. Ahrefs’ Twitter Marketing Strategy: Here’s How We Do It Learn how we maintain steady growth on Twitter as a SaaS company and tips for social media managers to get more followers on Twitter. How to Create a Content Calendar That Works For You A content calendar (or \"editorial calendar\") is a system used by content and marketing practitioners to organize, manage and schedule content production. How to Create a Content Map: Traditional Way & Ahrefs’ Way Create your own content map with the help of our template. Or try an even simpler method we've been using for years.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Create a Winning Content Marketing Strategy (+ Template)"
    },
    {
      "level": "H2",
      "text": "What is a content marketing strategy?"
    },
    {
      "level": "H2",
      "text": "Why do you need a content marketing strategy?"
    },
    {
      "level": "H2",
      "text": "How to create a content marketing strategy"
    },
    {
      "level": "H3",
      "text": "1. Set a goal (“why am I creating content?”)"
    },
    {
      "level": "H3",
      "text": "2. Know your audience (“who am I creating content for?”)"
    },
    {
      "level": "H3",
      "text": "3. Understand where your audience hangs out online (“where should I publish content?”)"
    },
    {
      "level": "H4",
      "text": "a) Trust your instinct"
    },
    {
      "level": "H4",
      "text": "b) Ask them"
    },
    {
      "level": "H4",
      "text": "c) See if they’re using Google"
    },
    {
      "level": "H3",
      "text": "4. Choose your main content type (“what kind of content should I publish?”)"
    },
    {
      "level": "H2",
      "text": "Content marketing strategy template"
    },
    {
      "level": "H2",
      "text": "Beyond content strategy (things that don’t matter)"
    },
    {
      "level": "H3",
      "text": "Brand story/positioning"
    },
    {
      "level": "H3",
      "text": "Competitor research"
    },
    {
      "level": "H3",
      "text": "Content calendar"
    },
    {
      "level": "H3",
      "text": "Content distribution plan"
    },
    {
      "level": "H3",
      "text": "Content pillars and clusters"
    },
    {
      "level": "H3",
      "text": "Content audit"
    },
    {
      "level": "H3",
      "text": "Business plan"
    },
    {
      "level": "H2",
      "text": "What next?"
    }
  ],
  "author": "Joshua Hardwick"
}