{
  "url": "https://ahrefs.com/blog/content-writing/",
  "slug": "content-writing",
  "title": "Content Writing Explained + 8 Tips to Become a Better Writer",
  "description": "We show you exactly what it takes to write better content, plus give eight actionable tips that'll help you step up your game.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents I’ve written more than 150 blog posts for the Ahrefs Blog and reviewed hundreds of video scripts for our YouTube channel.In this guide, I’ll teach you everything I know about content writing so you can write better content.ContentsWhat is content writing?Content writing is the process of researching, planning, writing, and editing web content for marketing purposes. It can be a blog post, video script, social media post, or anything else that gets published online. For example, all of our YouTube videos are scripted.Here’s an example of one of the scripts:Types of contentBlog posts, videos, and social media posts are actually just a handful of the many types of content you can write. Here are a few others:BooksTemplatesWhite papersToolsCoursesCase studiesInterviewsEach has a different purpose, but the fundamentals of writing them well are similar. That’s what we’ll focus on in the rest of the guide. Content writing basicsIt might sound silly, but there’s more to writing content than putting words on a page. Laying a solid foundation is half the battle. Let’s go over the process from start to finish.1. Define your content strategyDon’t even think about putting pen to paper without a strategy. You’ll just end up writing pointless drivel with no real purpose.Here’s our content strategy in a nutshell:Why am I creating content?To influence our audience’s buying decisions by showcasing how Ahrefs helps to solve their problems.Who am I creating content for?People who want to drive more search traffic to their websites (business owners, affiliate marketers, e-commerce stores, etc.).Where will I publish content?The Ahrefs Blog (because my audience uses Google to search for information).What type of content will I create?Blog posts.(Yes, that’s really it.)It’s simple but answers four important questions:Why are you writing content?Who is it for?Where will you publish it?What kind of content will you write?Not sure how to answer these questions? Read our guide to creating a content marketing strategy. 2. Plan what topics to coverEvery niche has hundreds if not thousands of topics. You can’t write about them all, so you need to find and prioritize the best ones for you.Keyword research is a good starting point here. Even if you’re not creating content for organic search, the keywords people are searching for in Google tend to be a good representation of what people want to know.Here’s how to find popular keywords:Enter a broad topic into Ahrefs’ Keywords ExplorerGo to the Matching terms reportFor example, if we enter “smoked,” then we see 319,019 terms sorted by their estimated U.S. monthly search volume:But it’s not all about search volume. You also need to consider how easy it would be to write content about the topic that sells your product or service. Learn how in our guide to creating a content plan.3. Pick a topic and put an outline togetherYou need an outline to keep you on track and make sure your content stays aligned with your strategy. Here’s our formula for a winning one:The “What?”This is about subtopics. What broad themes will your content cover?Don’t choose these randomly. Research what people want to know about the topic by looking at similar top-performing content on your chosen channel.For example, if we were writing about “affiliate marketing” and wanted to rank in Google, we’d look at the top-ranking posts. It only takes a moment to see that all top-ranking pages have a definition of the term…… as well as information on how to get started:These are all things we should probably cover in our content.If you want to speed up this process, you can use Ahrefs’ Content Gap tool to find common keyword rankings among top-ranking pages and eyeball the list for subtopics.Here’s how:Enter your target keyword into Ahrefs’ Keywords ExplorerScroll down to the SERP overviewSelect the top-ranking pages you want to analyzeClick “Open in” then choose “Content gap”For example, if we do this for “affiliate marketing,” we see that the top-ranking pages also rank in the top 10 for:what is affiliate marketinghow to become an affiliate marketerhow to do affiliate marketingThe “How”This is largely about organization. How will you structure things and what will you say?Given how impatient people seem to be these days, my advice for structure is to use the “inverted pyramid” method and put the “need to know” before the “nice to know.” For example, if we are writing about affiliate marketing, readers are probably going to want to know what it is before learning how to do it. You should also think about the points you’ll make in each section, how you’ll construct a narrative to tie everything together, and the transition between subtopics. Bulleted notes are more than fine for this.Here’s an example for the topic of “affordable seo services”:The “Wow”This is about your content’s USP. How will it be different from what’s already out there?If you’re thinking “oh… I’ll make it longer,” please—just stop. Times have changed. Nobody wants to read 10,000 words about something you could say in 500 anymore.Instead, I recommend two things: Draw on your experience and expertiseMake it entertaining For example, I draw on my experience running an SEO business in my guide to starting one: 4. Write the contentIt’s finally time to get creative and turn your outline into a draft. This should be the easy part because it’s really just about adding the finer details. I recommend doing this in a new document with your outline open beside it.Here’s my setup: This may not work for everyone, but I find it easier to get into the “flow” of writing this way.Just remember to keep the content format in mind, as different styles work better for different formats. For example, a video will be more conversational than a blog post.5. Get feedback and edit your contentDon’t just self-edit. You’re too close to your work for that. Ask a friend or colleague to take a look and point out logical loopholes, choppy flow, unclear points, etc. Here’s an example:This is feedback that my colleague, Sam Oh, left on this very guide.Did this feel a bit disheartening to read? Yes. But he made some valid and valuable points that I think led to improvements. Content writing tipsEverything above should get you 90% of the way there. But I also want to share a few tips to help elevate your content to the next level and make the content writing process easier.Save time by using the same template for similar topicsLook at these two posts from our SEO glossary:Both of them use exactly the same template:What is x?Why is x important?Best practices for xIn fact, we used this template for all of the 200+ posts in our SEO glossary. This saved a huge amount of time, as we were able to create hundreds of pages from one outline.How can you find topics to tackle together?Look for keywords with common modifiers.Here’s how:Enter a broad topic into Ahrefs’ Keywords ExplorerGo to the Matching terms reportAdd a modifier like “best” or “how to” to the “Include” filterFor example, the keywords above are how to cook various foods sous vide, so you could easily use the same template for all of them.Get people hooked right away with the PAS intro formulaPeople have short attention spans. You need to hook them right away or they’ll leave.Here’s a great intro formula you can use to combat against this:First, describe the problem:Second, agitate the problem:Finally, reveal the solution: Just like that, we’ve shown that we understand the problem, know why it’s so frustrating, and can provide a solution. Cut fluff and jargon to make your content more accessible and shareable Did you know that 54% of Americans read below the equivalent of a sixth-grade level?This means only one of these two sentences is accessible to the average reader:Cooking steak can be extremely challenging.Cooking steak can be hard. Interestingly, however, both sentences say the same thing. It’s just that one is harder to read because it uses big words for no reason.Luckily, there are tools that can help you fix this.Hemingway is a good starting point. Paste your content in the tool, and it’ll give you a readability score and suggestions to make it clearer.Grammarly can help with clarity too.Just make sure not to obsess too much over the scores. Nothing will ever be absolutely perfect. Help people grasp important concepts with examplesExamples help drive points home. That’s why we frequently use them in our content.How frequently? According to Ahrefs’ Site Audit, there are ~520 mentions of “for example” across our blog posts:For example (sorry, I had to do it!):This comes from our post about the differences between SEO and SEM. Perhaps it’s just because I’m a visual learner, but I don’t think this clicks in the same way for me without the example. So I think this is a simple but underutilized way to level up your content writing. Boost credibility by backing up claims with sources and statisticsBoth of these statements are true:Most content gets no organic traffic from Google.90.63% of content gets no traffic from Google.But which statement do you think seems more credible?For me, it’s the second one because it quotes a specific number (90.63%).This doesn’t mean you should shoehorn statistics into content for the sake of it. That’s an annoying content trend that needs to die. But you should absolutely use them to help lend credibility to your arguments and points.Plus, a nice bonus of including statistics is that they can earn you backlinks.For example, according to Ahrefs’ Site Explorer, our guest blogging guide earned 23 backlinks because of a stat we quoted in the post: Boost credibility by showcasing your expertise and experienceEverything has been written about before, so why should people trust your content over others?Demonstrating personal experience and expertise can do the trick.I love how the Wirecutter does this. Its posts include a short “why you should trust me” section with details about the author’s experience and expertise.Maybe I’m just a shill, but this actually made me trust this guide’s recommendations.If you’re not a fan of the “in your face” approach, there are subtler things you can do like explaining how you researched or came to a conclusion.Here’s an example from our list of the best speech-to-text apps:Make your content more helpful by answering frequently asked questionsFAQ sections are something we often add to the end of blog posts.Here’s an example: They’re a smart way to answer questions that people want to know but don’t really make sense to answer earlier in the content.Here’s one way to find them:Enter your topic in Ahrefs’ Keywords ExplorerGo to the Matching terms reportToggle the “Questions” tabIt’s then just a case of skimming the questions for things that may be worth adding to an FAQ section on your page.Give your content more balance with quotes from industry expertsIf your industry is divided on something mentioned in your content, be transparent about it. For example, people in SEO are divided when it comes to whether authority or relevance matters more when building links. To showcase this in my guide to off-page SEO, I reached out to a few experts and asked for their opinion…… then I included them in the post:Here’s a simple way to find experts if you’re not sure who to reach out to:Go to Ahrefs’ Content ExplorerEnter the topic of your contentGo to the “Authors” tabThis will show you a list of authors who’ve published content about the topic.It’s then just a case of finding their contact details and reaching out to them.Content outsourcingGiven how time-consuming writing content is, it’s tempting to just outsource it to freelancers.This is something we do with some articles at Ahrefs. Our small but talented network of freelance writers often write for the blog. And they wrote most of the content in our SEO glossary.That said, outsourcing isn’t as easy as it sounds.If it’s something you’re keen to do, read our guide to outsourcing to freelance writers.What next?Getting more eyeballs on your content is the next task. Learn how in our guide to content distribution. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Keep Learning 21 Writing Tips to Become a Better Writer Fast Writing is one of the most powerful skills you can learn. Discover how to quickly become a better writer in 21 tried and tested tips. We Asked 39 AI Writing Tools to Recommend Their Favorite AI Writing Tools. Here Are the Results We went meta and decided to put together a list of the top AI writing tools—recommended by AI writing tools. How to Become a Successful Content Creator A content creator is someone who creates written, audio, video, or visual content for a digital platform. Learn how to become one. Copywriting vs. Content Writing: Differences & Similarities Copywriting and content writing are commonly heard terms in the world of business. We discuss more about them and their respective traits. B2B Content Marketing Explained: Tactics From Real Teams Discover how 3 B2B businesses close big deals with content marketing.",
  "headers": [
    {
      "level": "H1",
      "text": "Content Writing Explained + 8 Tips to Become a Better Writer"
    },
    {
      "level": "H2",
      "text": "What is content writing?"
    },
    {
      "level": "H2",
      "text": "Types of content"
    },
    {
      "level": "H2",
      "text": "Content writing basics"
    },
    {
      "level": "H3",
      "text": "1. Define your content strategy"
    },
    {
      "level": "H3",
      "text": "2. Plan what topics to cover"
    },
    {
      "level": "H3",
      "text": "3. Pick a topic and put an outline together"
    },
    {
      "level": "H4",
      "text": "The “What?”"
    },
    {
      "level": "H4",
      "text": "The “How”"
    },
    {
      "level": "H4",
      "text": "The “Wow”"
    },
    {
      "level": "H3",
      "text": "4. Write the content"
    },
    {
      "level": "H3",
      "text": "5. Get feedback and edit your content"
    },
    {
      "level": "H2",
      "text": "Content writing tips"
    },
    {
      "level": "H3",
      "text": "Save time by using the same template for similar topics"
    },
    {
      "level": "H3",
      "text": "Get people hooked right away with the PAS intro formula"
    },
    {
      "level": "H3",
      "text": "Cut fluff and jargon to make your content more accessible and shareable"
    },
    {
      "level": "H3",
      "text": "Help people grasp important concepts with examples"
    },
    {
      "level": "H3",
      "text": "Boost credibility by backing up claims with sources and statistics"
    },
    {
      "level": "H3",
      "text": "Boost credibility by showcasing your expertise and experience"
    },
    {
      "level": "H3",
      "text": "Make your content more helpful by answering frequently asked questions"
    },
    {
      "level": "H3",
      "text": "Give your content more balance with quotes from industry experts"
    },
    {
      "level": "H2",
      "text": "Content outsourcing"
    },
    {
      "level": "H2",
      "text": "What next?"
    }
  ],
  "author": "Joshua Hardwick"
}