{
  "url": "https://ahrefs.com/blog/content-changes/",
  "slug": "content-changes",
  "title": "Introducing: Content changes",
  "description": "Monitor how page-level content changes might impact your or your competitors' organic traffic using Ahrefs.",
  "content": "Andrei Țiț Showing you how to make the most out of Ahrefs. Mostly through: how-to videos, product updates, webinars, and brochures. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents What’s one of the hardest SEO problems to crack? Finding out what causes a change in organic traffic. Common causes include:Google Algorithm updatesBacklink swingsPotential change in impressionsBut page-level content changes might also impact search traffic numbers.You can now monitor these changes in various ways using Ahrefs. Here’s how.How content changes workSimilarly to WaybackMachine, our AhrefsBot crawler visits a page, parses its content, and stores a copy of its HTML and text.This allows you to compare historical changes made to a page at two different dates and uncover what exactly might have caused traffic fluctuations.You can do this across various reports.In Overview chartTo quickly see content changes on a visual chart among other SEO metrics:Enter a URL in Site ExplorerHead over to the Performance chart in OverviewTurn on the Content changes from the three ellipsesThese will be displayed as green bubbles right next to the Google Algorithm updates at the bottom. If you hover over them, you’ll see the extent of content changes made on a page (moderate/major/overhaul) and their influence on the traffic numbers.For a deeper analysis, click on View changes to open the Page Inspect tool and compare the content changes side-by-side to see exactly what changed.Let’s do a small exercise. For the website below, link insertions — and not just text additions alone — were also responsible for traffic spikes.But some cases are more obvious, like our article on “SEO consultants”, where a complete content overhaul caused a significant increase in organic visits.TIP If you prefer to zoom out and have a high-level overview of a page’s historical changes, eyeball the calendar under the Page Inspect tool.Just pick a date that went through a complete overhaul. The darker the color, the more extensive the content changes for that day. You can then see the exact adjustments compared to the previous version.In ToolbarAre you already performing an on-page analysis using our free SEO toolbar, but need additional context to understand why a page is driving its current traffic?Go to the Content tab and click on View changes. This will redirect you to the Page Inspect tool mentioned above, where you can follow the calendar for historical changes.In Top pagesSo far, we’ve analyzed content changes on an individual page-level.You can also go broad and analyze yours or your competitor’s top-performing pages via the Top Pages report at two different dates.The best part? You can check whether content changes have impacted the traffic changes under the Traffic changes column.For example, here’s Ahrefs’ blog compared to 3 months ago. From a glance, we can see that a recent overhaul of our blog article on “top Google searches” has resulted in a traffic increase of over 3,000 visits a month.NOTE These changes are computed in real-time, which means it’s not possible to filter and sort by this field, nor export it via API. TestimonialsHere’s some Internet shoutouts from SEO’s who’ve already used content changes. Some have even won new clients thanks to it: –Excited about the Content changes feature? Try it out and tag us on socials if you’ve discovered an interesting use case. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Andrei Țiț Showing you how to make the most out of Ahrefs. Mostly through: how-to videos, product updates, webinars, and brochures.",
  "headers": [
    {
      "level": "H1",
      "text": "Introducing: Content changes"
    },
    {
      "level": "H2",
      "text": "How content changes work"
    },
    {
      "level": "H3",
      "text": "In Overview chart"
    },
    {
      "level": "H3",
      "text": "In Toolbar"
    },
    {
      "level": "H3",
      "text": "In Top pages"
    },
    {
      "level": "H2",
      "text": "Testimonials"
    }
  ],
  "author": "Andrei Țiț"
}