{
  "url": "https://ahrefs.com/blog/content-marketing-roi/",
  "slug": "content-marketing-roi",
  "title": "Content Marketing ROI: How to Put a $ Value on Content",
  "description": "3 quick and easy ways to prove the value of your content.",
  "content": "Ryan Law Ryan Law is the Director of Content Marketing at Ahrefs. Ryan has 13 years experience as a writer, content strategist, team lead, marketing director, VP, CMO, and agency founder. He's helped dozens of companies improve their content marketing and SEO, including Google, Zapier, GoDaddy, Clearbit, and Algolia. He's also a novelist and the creator of two content marketing courses. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents The formula for calculating ROI is so simple that I’ll share it right here, in the article introduction: ((Return from content − cost of content) / cost of content) * 100If your content marketing generated $10,000 in sales and cost $2,000 to create, that’s an ROI of 400%:(($10,000 - $2,000) / $2,000) * 100 = 400%Although the math is simple, actually doing this exercise in real life is tricky, for a few reasons. The most important: it’s pretty hard to put a dollar value on every single benefit of your content marketing.I’ll show you 3 practical methods for quickly working out your content marketing ROI, and then explain why ROI can become a tricky concept.Contents3 practical methods for calculating ROIROI is complicated, but that shouldn’t stop you from trying to calculate it. Here are three simple methods for quickly working out how much “value” you get from your content. To work out your content ROI, just plug these numbers into the ROI formula at the start of the article.1. Conversion analysisIn a perfect world, we would know exactly how much revenue each and every blog post generated for our business. To calculate ROI this way, we can use a formula as follows:Return from content marketing = (New customers from content * ACV)To work this out, we need to calculate the number of new customers generated by our content in a given period. If you don’t know this figure, you’ll need to set up some kind of conversation tracking in software like Google Analytics, allowing you to track the number of people that complete a desired action on your blog post (like filling in a form or starting a free trial)Further readingHow to Use Google Analytics 4 for BeginnersIn most cases, visitors won’t buy directly from your blog post, so you’ll need to track:The number of conversions generated by your content (e.g. free trial signups or demo requests), andThe number of those conversions that went on to become paying customers.In the image below, we can see which pages visitors land on before purchasing a product. We can also see the conversion rate and the revenue attributed to the conversions:Next, we need to calculate ACV: average customer value. This refers to the typical amount that customers spend with our company over the course of their relationship with us.If we sell one product, and most customers buy just once, our ACV will be the price of our product. If we offer multiple products or add-ons, and customers buy regularly or set up subscriptions, then our ACV will be a lot higher.Let’s assume that our conversion analysis shows that we had 1,000 free trial signups from our content in February, and 100 of those free trials became paying customers. If our ACV is $2,000, we can plug these numbers into our formula to calculate a return from content of $200,000:(New customers from content * ACV) = 100 * $2,000 = $200,000This method is the gold standard of ROI calculations, but (because of the problems mentioned above) calculating ROI like this can be extremely complicated.2. Lifetime traffic valueAt the other end of the spectrum, here’s a quick and easy method that takes about 30 seconds using Ahrefs:Return from content marketing = (monthly traffic value * content lifetime in months)Instead of working out how much revenue we’ve generated from our content, this method estimates how much money we’ve saved by ranking organically for keywords instead of paying for advertising.In Ahrefs, you can estimate the Traffic Value of any article—the amount it would cost to generate the same traffic via Google Ads, instead of SEO.Below, we can see that it would cost an estimated ~$44k to “replace” the traffic to our list of free SEO tools using ads:If we add up the traffic value of all the pages in our blog, we have an estimated monthly traffic value of $790,000:Put another way, if we used paid advertising to get the same amount of visits from the same keywords, we’d need to spend around $790,000 on ads, each and every month.Most content is useful for longer than a single month, so we can multiply this monthly traffic value by the expected useful “lifetime” of our content. If we use two years as a starting point, that gives us a lifetime traffic value of $18,960,000:(Monthly traffic value * content lifetime) = $790,900 * 24-months = $18,960,000We have over 2,000 blog articles at Ahrefs, and we were probably never going to spend $19 million on paid advertising. But this calculation allows you to assign a dollar value to your content in a matter of seconds. It’s particularly useful if your company recently switched from a heavy reliance on paid advertising to content marketing, letting you show off the money you’ve saved from the switch.3. Signup attributionLet’s wrap up with a best-of-both-worlds approach, very similar to how we calculate ROI at Ahrefs:Return from content = (% of signups attributed to content * total signup revenue)Whenever a new customer signs up for Ahrefs, we ask them a question: Where did you hear about us? Their answer is piped into a dedicated Slack channel, #registrations, which gives us a live feed of new signups and, crucially, how they discovered Ahrefs. Sam, our VP of Marketing, regularly uses this feed to work out the percentage of total signups that can be attributed to his YouTube content.If I head to #registrations and run a search for signups that mentioned “youtube”, we can see over 34,000 people that directly attributed their discovery of Ahrefs to Sam’s video content:We can use this to estimate content marketing ROI: if 33% of all respondents in a given month attribute their signing up to YouTube, it would be fairly reasonable to assume that 33% of all signups came from YouTube, and that 33% of all new revenue should be attributed to our video content efforts.If we assume a theoretical monthly revenue of $300,000, and that 1,000 of a total 3,000 signups could be attributed to “YouTube”, we can plug these values into our formula for a return on content of $100,000:(33% of signups attributed to content * $300,000) = $100,000This method will underreport the number of signups generated (people might misspell YouTube, or say “videos” instead, or most likely, not answer the question at all). The relationship between new signups and new revenue might also be more complicated than we assume here (if you have lots of free users, for example).But it has the benefit of making it easy to compare to other marketing channels. If I search for “google” in the same #registration channel, I see 94,000 mentions—bigger than Sam’s 34,000 YouTube mentions:(Although he’s definitely catching up…)Challenges in measuring content ROIIf you want to talk convincingly about ROI to your boss or your clients, it helps to understand these three points:1. Cost can get complicatedIf all of your content marketing is outsourced from freelancers or agencies, it’s relatively easy to work out how much it costs: it’s the amount they bill you.If you have an entirely in-house team, with team members dedicating 100% of their effort to content, costs are similarly straightforward: it’s their salaries.But things can get a little complicated if you source content from multiple sources (like a combination of freelancers, agencies, and in-house team members), or if multiple people contribute to your content in relatively small ways (like a designer dedicating a third of their time to content, and two thirds to product marketing).But this is still simple compared to our next complication:2. The value of content is hard to measureThe most obvious benefit of content marketing: it attracts new customers. We can theoretically add up all the new customers who found and bought our product because of our content marketing, and work out how much money they spent (I explain how in the next section).But content has lots of other benefits that are less easy to measure. It can:Encourage upsells and expansion. By sharing product tips and new use cases, content can provide the nudge needed to turn free users into power users, or “Lite” plan customers into “Advanced” plan users—like My 5 Favorite Ahrefs Use Cases for Content Marketers.Save money on customer support. Content can help answer customer questions before they become support queries, like the many guides we’ve published to help users understand how metrics like Traffic Value are calculated, and how they can be used.Build brand recognition and affinity. Content can give your brand a voice, sharing the motivations and beliefs that underpin the products or services you sell. We generally like to buy from companies we respect, so “brand affinity” can make a real difference to the bottom line.Makes paid search advertising more effective. Sending paid search traffic to articles instead of “traditional” landing pages can reduce the cost of clicks (something we’ve done for articles like our guide to keyword research).Help other pages perform better. A page that generates a ton of backlinks but no sales (like our list of SEO statistics) can still contribute to revenue by helping other “money” pages rank better for their target keywords.Many of these benefits are virtually invisible—how do you measure support queries that content stopped from existing?—but very real. No matter how you calculate ROI, there’s a good chance you’ll be undervaluing its impact.Which brings us to our next complication:3. Attribution is trickyWorking out the role content played in a sale is called “attribution”, and it’s pretty tricky to pin down.Did someone convert because of an article or in spite of it? When they read multiple articles, which had the biggest impact? If someone buys because of an advert, should we still credit the blog post they read beforehand?Customer journeys are also rarely as straightforward as we’d hope. One person might read 50 articles and never buy anything; another might read a single article, disappear for a year, and immediately buy. What role did content play in those journeys?There are different ways of measuring attribution to help with some of this uncertainty:First-touch attribution credits the first piece of content a visitor engages with before converting.Last-touch attribution credits the last piece of content.Multi-touch attribution tries to credit every piece of content that was involved in the buying process.But in all cases, attribution is never perfect: we just can’t measure every interaction someone has with our content.ROI modeling and forecastingThe main use of content marketing ROI is for reporting. CMOs and other company leaders usually want to know that every growth strategy generates more revenue than it costs; if it doesn’t, the strategy usually needs to be cut or changed.But calculating ROI also enables you to forecast future performance, and allows you to start revenue prediction for different strategies and scenarios. For example:What would happen to your revenue if you improved your baseline conversion rate by 1%?What would happen if you shifted $10k per month away from paid media and into content marketing?Is it worth enrolling in an ad network and starting to use direct traffic monetization, or will it cause you to lose money?These questions become much easier to answer with a solid ROI model to tinker with. If you want to start building your own predictive models, check out this webinar from the content agency Omniscient Digital:https://www.youtube.com/watch?v=vIzMb0Au3KIHow to improve content marketing ROISo you’ve calculated your content ROI… and now, you want to improve it. Thinking back on our ROI formula:((Return from content − cost of content) / cost of content) * 100There can only be two core ways to generate a better ROI from your content: reduce the cost of your content, or increase the return (the traffic and sales it generates).How to reduce the cost of content marketingRepurpose your content. If you’ve gone to the effort of writing a detailed 2,000-word deep dive, why not try repurposing it into an email series, social media carousel, or webinar?Use generative AI in smart, selective ways. Generative AI can speed up boring parts of the content workflow, from keyword research to content optimization. Read our guide for more details: 14 Ways to Use AI for Better, Faster SEO.How to improve the return of content marketingCreate more evergreen content. Evergreen content is content that is timeless and always useful, needing little in the way of updates or maintenance. The more evergreen content you create, the harder your blog will continue to work for you, months and years after your content was first published.Focus on topics with high Business Value. Some topics are more likely to turn into revenue than others—we call these topics with high Business Value. For Ahrefs, these are SEO-related topics like link building or content optimization. We talk more about keyword research and business value in our guide to SEO content strategy.Work on conversion optimization. While there’s no magic bullet for getting more customers, small tweaks to your site’s calls-to-actions and signups can improve conversion rates and new customer signups.Other essential content marketing metricsContent marketing ROI is a useful metric, but there are other, often simpler metrics that can prove just as useful for guiding your content strategy.At Ahrefs, we focus our monthly content reporting on the following metrics:Content output: because we have a solid keyword strategy and editorial process, we know that the more content we publish, the better the results we’ll see. We use a content output goal (like “3 articles per writer per month”) as our North Star metric.Backlinks: we publish a good number of non-SEO articles, so traditional SEO metrics like rankings and organic traffic aren’t always helpful. For these articles, we focus more on the backlinks they acquired and the social media response they received.Keyword rankings: we use Ahrefs’ Rank Tracker to regularly check keyword rankings for our target keywords. If we struggle to break into the top three for a given keyword, we know it’s time to schedule an update.Content marketing can serve a diverse range of business goals. These aren’t always easily reflected in ROI calculations.Take goals like “increasing brand awareness”, or “increasing marketing share”, or even “reducing a competitor’s Share of Voice”. These are all valid goals that don’t necessarily add immediate revenue to your bottom line, and might unfairly distort traditional content ROI calculations.If your company uses content marketing for goals beyond SEO and lead acquisition, it’s a good idea to track and report on some extra content marketing metrics in tools like Google Analytics.Learn more about common content marketing metrics in our guide: 23 Actual Content Metrics From Actual Marketers.Final thoughtsThere are tons of ways to measure content marketing ROI, and none of them are perfect. But for practical purposes, they don’t need to be.Metrics, like content marketing ROI, are most useful as directional indicators. Instead of obsessing over perfect calculations, it’s better to choose a simple methodology, stick to it consistently, and see how it changes over time. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Ryan Law Ryan Law is the Director of Content Marketing at Ahrefs. Ryan has 13 years experience as a writer, content strategist, team lead, marketing director, VP, CMO, and agency founder. He's helped dozens of companies improve their content marketing and SEO, including Google, Zapier, GoDaddy, Clearbit, and Algolia. He's also a novelist and the creator of two content marketing courses. Keep Learning Content Marketing for SaaS: The Ahrefs Guide Learn how we at Ahrefs, a SaaS company, do our content marketing. Why Is Content Marketing Important? 7 Reasons to Start Content Marketing Here are seven reasons why content marketing is important and deserves to be the marketing channel you should focus on. 25 Types of Content You Can Use for Content Marketing In content marketing, there are heaps of options to pick from. To make it easier, we've curated 25 types for your choosing pleasure. B2B Content Marketing Explained: Tactics From Real Teams Discover how 3 B2B businesses close big deals with content marketing. Beginner’s Guide to Content Marketing Reporting Your step-by-step guide to building a world-class content report. Share your wins, dazzle your boss, and wow your clients.",
  "headers": [
    {
      "level": "H1",
      "text": "Content Marketing ROI: How to Put a $ Value on Content"
    },
    {
      "level": "H2",
      "text": "3 practical methods for calculating ROI"
    },
    {
      "level": "H3",
      "text": "1. Conversion analysis"
    },
    {
      "level": "H3",
      "text": "2. Lifetime traffic value"
    },
    {
      "level": "H3",
      "text": "3. Signup attribution"
    },
    {
      "level": "H2",
      "text": "Challenges in measuring content ROI"
    },
    {
      "level": "H3",
      "text": "1. Cost can get complicated"
    },
    {
      "level": "H3",
      "text": "2. The value of content is hard to measure"
    },
    {
      "level": "H3",
      "text": "3. Attribution is tricky"
    },
    {
      "level": "H2",
      "text": "ROI modeling and forecasting"
    },
    {
      "level": "H2",
      "text": "How to improve content marketing ROI"
    },
    {
      "level": "H3",
      "text": "How to reduce the cost of content marketing"
    },
    {
      "level": "H3",
      "text": "How to improve the return of content marketing"
    },
    {
      "level": "H2",
      "text": "Other essential content marketing metrics"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Ryan Law"
}