{
  "url": "https://ahrefs.com/blog/content-briefs/",
  "slug": "content-briefs",
  "title": "How to Create Content Briefs (with 6 Templates)",
  "description": "If you want to publish more blog content, you need to create solid content briefs. Use these templates to get started.",
  "content": "Ryan Law Ryan Law is the Director of Content Marketing at Ahrefs. Ryan has 13 years experience as a writer, content strategist, team lead, marketing director, VP, CMO, and agency founder. He's helped dozens of companies improve their content marketing and SEO, including Google, Zapier, GoDaddy, Clearbit, and Algolia. He's also a novelist and the creator of two content marketing courses. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents If you want to publish more blog content, you need to create solid content briefs.Content briefs are simple documents that tell a writer… what to write about. They provide the information and context writers need to understand the goal of each article, ensure they cover all the key points, and turn in an A-grade draft with minimal hassle.A good content brief should be simple. It should cover the essential information a writer needs without drowning them in SEO jargon or taking away their freedom to write in the way they think best.Briefs should also be brief—they are not content outlines. Spend too long writing suggested headers, recommending examples to include, and handpicking competitor articles to read, and you may as well have written the article yourself. With that in mind, here’s our straightforward content brief template, and a step-by-step guide to filling it out.TemplateClick here to save a copy of our content brief template.1. Write a working titleEvery content brief should start with a working title for your article.This doesn’t need to be a perfect, polished title. The goal of your working title is not to earn clicks or pique the reader’s interest—it’s to help the writer write. Keep it simple, and communicate the core idea of your article.Examples:How to create a content briefSharing our experience attending BrightonSEOWhy cloud architecture is overhypedKeyword clustering using AhrefsIf you’re creating SEO content, your working title should reflect the primary intent of your target keyword. In other words, it needs to give searchers what they want: whether that’s a how to, a list of tools, or a set of templates.You can check the intent of your keywords with a quick Google search, but if you’d like to see the results for different countries (and make sure the results aren’t being personalised to you), you can check intent in Ahrefs.Enter your target keyword into Keywords Explorer and scroll down to the SERP overview box. You’ll be able to see the titles of the top-ranking articles for that keyword.Here’s the SERP overview for the keyword content brief:Pay special attention to the formats used by the top-ranking content. If they all take similar angles (like, in this example, “how to”), there’s a good chance searchers are satisfied by it.(Although that shouldn’t stop you from using your best judgment and finding ways to stand out from your competitors—more on that below.)2. Explain the goalThere’s a reason you want this article written (otherwise, why spend time and money creating it?). Share your goal with the writer. Help them understand why they’re writing something and they’ll have a better chance at hitting your goal.Examples:Explain how to create an effective content brief.Document our experience as sponsors of the BrightonSEO conference.Share our CEO’s opinion on cloud architecture.Teach existing users how to use our new keyword clustering feature for keyword research.3. Describe who you’re writing forThis doesn’t need to be a complicated persona document or a deep-dive into the reader’s awareness stage and demographic data.Instead, share details that will help the writer choose the correct language and level of complexity for their article, like:The audience’s experience-level with the topic: are they beginners looking for simple tutorials, or experts looking for advanced tips and tricks?Their role: are you hoping to reach software engineers or solopreneurs? Junior content marketers or experienced CMOs?Sometimes the existing search results can help narrow down your audience. If the top-performing articles all include “for beginners” in their title, there’s a good chance you should follow suit.4. Share sub-topics to includeYou can help your writer by suggesting important sub-topics to include in the article.Common sense is a helpful guide: for an article about content briefs, you’d probably want to include a definition and a tutorial for actually creating a content brief.You can also take a more more data-driven approach to finding sub-topics. I like using Ahrefs for this.Start by putting your topic into Keywords Explorer, and heading to the Related terms report. Select the Also rank for tab, and you’ll see a list of additional keywords that top-ranking articles for your topic commonly rank for:In the example above, we’re looking at the keyword content briefs. From the results, it seems that top-performing articles also rank for keywords relating to templates and examples. For this article, the writer might want to include a section about content brief examples.(Spoiler: we did, check it out below.)5. Explain how your product fits inThe point of content marketing is help grow a business (otherwise, it’s just… writing). With that in mind, use your content brief to suggest relevant opportunities to mention your products.It can feel salesy when products are shoehorned into articles where they don’t belong. Instead, focus on topics where it would be natural to mention your product. This is something we do at Ahrefs (hence the screenshots above).If your writer isn’t already an expert with your products, help them out with by explaining how your product “fits in” to the topic at hand, and recommending product features that would be helpful to mention.Examples:We don’t offer a content briefing product, but here are three ways our data can help with the process.We spoke to tons of customers at the conference: here was their top product feedback.For this section on keyword clustering, it would be worth mentioning the new clustering tool in Keywords Explorer.We recently moved our hosting from the cloud to on-premises installation.6. Suggest ways to make the article uniqueVirtually every article has to compete for attention with similar articles covering the same topic. To help your article stand out, you can suggest unique information to include—things that competing articles don’t cover.You could recommend experts to interview, or relevant quotes to include. You could include data and statistics to reference. You could even share a few personal experiences and stories that might help the reader understand the topic.Examples:Use HARO to find people willing to share their content brief template.Let’s tell the story of how I used keyword clustering to rank for 1200-keywords with one article.Here’s some research about the costs of cloud hosting for you to reference.7. Share practical detailsLast of all, include any nitty-gritty practical details your writer would find helpful, like:Article deadlineUseful resources (like your style guide)Editors or reviewers they should communicate withInternal links to other related articles on your websiteFill out these details for every article, share your briefs with your writer, and await content goodness to appear in your inbox.Content brief templates from the expertsOur content brief template is simple, and a great starting point for most people looking to publish more posts. But there are many situations that might call for more (or less) detail in certain areas, like writing extra-technical content, or creating articles that form part of an ongoing series.I asked a handful of content leads and agency owners to share their personal content brief templates. Check out the templates below, and download any that you might find helpful.Draft.dev’s technical content templateCreator: Karl Hughes, Draft.devLink: Make a copy hereKarl Hughes runs the technical content marketing agency Draft.dev. His briefs contain a huge amount of detail to help a big team of writers cover extremely technical topics.Freshpaint’s product-focused content templateCreator: Mark Rogers, FreshpaintLink: Make a copy hereMark Rogers is the Director of Content at Freshpaint. His briefs focus on Freshpaint’s product: providing a product overview, sharing boilerplate about Freshpaint’s HIPAA compliance, and explaining how the product “fits in” to the topic at hand.Fio Dossetto’s ABCD templateCreator: Fio Dossetto, contentfolksLink: Make a copy hereFio is the creator of contentfolks and Senior Content Strategist at Float.com. Her ABCD template shares plain English information across four key areas: audience, brand, context, and details.Deel’s marketing-focused brief and editing checklistCreator: Anja Simic, DeelLink: Make a copy hereAnja Simic’s content briefs for HR platform Deel do a great job at connecting each article back to the bigger marketing strategy. The brief helps the writer to reference case studies, awards, and data from recent Deel studies.Omniscient Digital’s audience, SEO, brand, and conversion templateCreator: Alex Birkett, Omniscient DigitalLink: Make a copy hereOmniscient Digital is a content marketing agency. Their briefs provide room for their strategists to share expert guidance to writers: recommending ways to bring new information to the discussion, mention the customer’s products, and generally stand out in the SERPs.Final thoughtsI’ve written hundreds of articles and managed dozens of writers over the years. In both cases, problems with inconsistent quality and endless rewrites usually boiled down to one thing: miscommunication.A content brief is a simple, straightforward way to provide your writers with exactly the information they need to write great articles. It ensures that both you and your writer understand why and how to create every article—removing most miscommunication issues at the source.How do you build content briefs? Let me know on X or LinkedIn. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Ryan Law Ryan Law is the Director of Content Marketing at Ahrefs. Ryan has 13 years experience as a writer, content strategist, team lead, marketing director, VP, CMO, and agency founder. He's helped dozens of companies improve their content marketing and SEO, including Google, Zapier, GoDaddy, Clearbit, and Algolia. He's also a novelist and the creator of two content marketing courses. Keep Learning 6 Simple Blog Post Templates (Download & Edit Along) Use these templates to beat writer's block, write great content faster, and stand the best chance of ranking in organic search. How to Create a Content Calendar That Works For You A content calendar (or \"editorial calendar\") is a system used by content and marketing practitioners to organize, manage and schedule content production. How to Create a Winning Blog Content Strategy in 7 Steps A blog content strategy is a vision and a plan that you have for your blog. It should be aligned with your business goals and your overall content strategy How to Create a Content Map: Traditional Way & Ahrefs’ Way Create your own content map with the help of our template. Or try an even simpler method we've been using for years. How to Create an SEO Content Strategy (Follow the Ahrefs’ Framework) This is a guide on how Ahrefs’ SEO content strategy works. Use it as inspiration for your own.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Create Content Briefs (with 6 Templates)"
    },
    {
      "level": "H2",
      "text": "1. Write a working title"
    },
    {
      "level": "H2",
      "text": "2. Explain the goal"
    },
    {
      "level": "H2",
      "text": "3. Describe who you’re writing for"
    },
    {
      "level": "H2",
      "text": "4. Share sub-topics to include"
    },
    {
      "level": "H2",
      "text": "5. Explain how your product fits in"
    },
    {
      "level": "H2",
      "text": "6. Suggest ways to make the article unique"
    },
    {
      "level": "H2",
      "text": "7. Share practical details"
    },
    {
      "level": "H2",
      "text": "Content brief templates from the experts"
    },
    {
      "level": "H3",
      "text": "Draft.dev’s technical content template"
    },
    {
      "level": "H3",
      "text": "Freshpaint’s product-focused content template"
    },
    {
      "level": "H3",
      "text": "Fio Dossetto’s ABCD template"
    },
    {
      "level": "H3",
      "text": "Deel’s marketing-focused brief and editing checklist"
    },
    {
      "level": "H3",
      "text": "Omniscient Digital’s audience, SEO, brand, and conversion template"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Ryan Law"
}