{
  "url": "https://ahrefs.com/blog/content-marketing-metrics/",
  "slug": "content-marketing-metrics",
  "title": "23 Actual Content Metrics From Actual Marketers",
  "description": "We asked content marketers to share the actual metrics they track. Here's what they said.",
  "content": "Mateusz Makosiewicz Marketing researcher and educator at Ahrefs. Mateusz has over 10 years of experience in marketing gained in agencies, SaaS and hardware businesses. When not writing, he's composing music or enjoying long walks. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents There are too many content marketing metrics out there. But we know which ones are actually used (we asked on LinkedIn and X).To organize things a bit, we’ve grouped the metrics into eight categories. Just the names themselves will give you a good idea of what’s important in content marketing.Let’s get to it.Contents1. Operational metricsThis type of metric measures the efficiency of the content team.These metrics make perfect sense. Once you get a good grasp of your content strategy, you want to scale. In other words, once something starts to bring results, you want to do more of it.Two metrics you should consider here are:Publishing frequency.Meeting deadlines.The first one, pointed out by Sara Stella Lantazio, is about the number of articles, videos, social media posts, emails, etc. published in a given period.Publishing frequency takes advantage of the very nature of content marketing - the more you do it, the better the results because they compound, and the easier it is to get those results, too. It’s true, regardless of the channel you’re using.For instance, here’s a chart from Ahrefs’ Site Explorer showing how the traffic (orange) and referring domains (blue) to my article portfolio have grown proportionally to the consistent growth of new articles published (yellow).The second metric, meeting deadlines, was mentioned by Nick Jordan. This might be helpful for in-house teams, but it’s super important for agencies. It tells you everything about how realistic your estimates were and whether you can take on more work.2. KeywordsWe’ve received many responses underlining the importance of organic search traffic, and keywords are the absolute cornerstone of this channel. As you probably already know, the higher you rank for keywords, the more visible your pages are on the search engines like Google, and the more traffic you get.The metrics that marketers mentioned to us were:Impressions: how often a site appears in search results.Rankings: what pages rank for a given keyword. That’s how you know if your SEO is working and when to step in to optimize your content.Organic keyword growth: the number of keywords that a page or site ranks for. As pointed out by Goran Mirkovic and Jacob McMillen this metric is especially helpful on new content to see if Google starts to rank it.Rate of keyword acquisition: very similar to the metric above, but this time we’re interested in how fast Google ranks content. Samantha North said, “in my experience, when it picks up lots of keywords quickly, it’s going to rank well”.Share of voice: percentage of all possible organic clicks (from SERPs) for the tracked keywords landing on your website.There are two types of tools you’ll need to track these metrics:Google Search Console. The only tool that allows you to measure impressions in Google’s SERPs reliably. Tools like Ahrefs allow you to tap into that data and get some more functionality out of it, but you still need to have GSC set up.Ahrefs Rank Tracker or a similar rank tracking tool of your choice. Although GSC allows you to track rankings, it has very limited functionality with poor experience (here’s a long list of reasons why). Also, that’s where you get more refined, professional metrics like share of voice.Further readingKeyword Research: The Beginner’s Guide by Ahrefs3. BacklinksNext to keywords, backlinks are another thing content marketers use for measuring content performance. They are a measure of the impact of the content on the site’s authority.And there’s a simple reason why backlinks are so important - they are still one of the strongest ranking factors. The more backlinks a page gets, the higher its chances to rank.Moreover, the link equity you acquire this way flows throughout the entire site through internal links and increases the site’s authority.Our commentary: backlinks are increasingly hard to get. They’ve become a currency of the web between those who need backlinks and those who can provide them. So, theoretically, backlinks should be a sign that your content is so good that people want to link to it, but in reality, some sites won’t link until they get something in return.So we’d say track backlinks but only to your link bait content or if you’re doing link building.An interesting insight into this topic came from Goran Mirkovic — don’t track backlinks in the very early stages of the site. It takes time to earn them, whether naturally or by link building.TipThe quality of backlinks matters more than quantity. If you’re an Ahrefs user, you can turn on the Best links mode to see the growth of the most impactful backlinks.Further readingWhat Are Backlinks in SEO? Everything You Need to KnowLink Building for SEO: The Beginner’s Guide4. LeadsLeads measure the content’s effectiveness in converting visitors into prospects.Typically, this metric is used with either gated content that requires contact information to access or content that encourages the visitor to get in touch, for example, for free consultation.What we’ve heard from marketers is mostly pretty much the standard:MQLs (Marketing Qualified Leads): these are potential customers who have shown more interest in what you’re offering than the average visitor by leaving contact information. They might be ready to buy in the future, but they’re not quite there yet.SQLs (Sales Qualified Leads): these are a step further along than MQLs. They’ve been reviewed by both the marketing and sales teams and are considered ready for a direct sales pitch.And there was one metric I don’t see very often - high intent leads or HILs, shared by Josh Bradley. These are the people who demonstrate a clear need for a product like yours. Best if they match your ideal customer profile.The best way to track leads is with a tool that allows for lead scoring and easier handoff to sales (Hubspot and the likes).5. TrafficTraffic is the measure of content’s effectiveness in attracting clicks to your site. That’s right, not unique users, just their clicks.You want to measure traffic only for content that is actually designed to generate traffic. Some social media posts (if not most) or emails won’t fall into this category because they are meant to be digested on the spot with no clear CTA guiding to the site.The best way to measure traffic is to measure its growth. Marketers do it on a monthly, quarterly, and yearly basis. Shorter time periods are rare since content marketing takes time.But here’s a pro tip - if you want to see which content landed well, you can take the first 7-day period to identify that content.“I often measure how much traffic an article received in the first week. It’s a good indicator of how well we ‘launched’ and promoted each article, and which topics were most interesting to our audience.”Ryan Law, Director of Content Marketing AhrefsMany analytics tools track traffic, but not all of them show you growth, so here’s the formula for traffic growth:= (Traffic this period - Traffic last period) / Traffic last period * 100%You can also measure the total traffic to pieces or directories of content to compare them or show the impact of the part to its sum. Ahrefs lets you do that in two ways: through Site structure report and by manually choosing which content to group together via the Portfolio feature.Site structure report.Portfolios feature.Another reason why you’d want to measure traffic is to measure conversion (more about that in a bit). Traffic is the basis of conversion because it tells how many clicks resulted in sign-ups or sales.Let’s take a closer look at organic traffic since this type was mentioned to us the most.In terms of absolute numbers, the most accurate data will come from Google Search Console. Just open the tool and go to the Performance tab.However, SEO tools like Ahrefs will give you better functionality despite the metrics being estimations. You can:Create portfolios of pages or even whole sites to track.Instantly see how you stack up against competitors.See which pages gained and lost the most traffic in a given period.Tracking traffic is just a means to an end, and this is where SEO tools got your back too. In Ahrefs, there’s a nifty report called Opportunities which points you to pages and keywords with a good outlook for improvement.6. Audience growthAudience growth shows the demand for more content from your audience.Social media, email, and podcasts are the channels where you want to measure that.In terms of the actual metrics, these came up in our poll:Newsletter subscribers growth.LinkedIn audience growth.YouTube audience growth.No surprises here. Standard metrics, natively tracked on the respective platforms.At Ahrefs, we track some of these metrics, too. They’re especially helpful for gauging the impact of new types of content.Generally speaking, if you’re creating relevant and valuable content, the number of subscribers should be growing. But it’s worth keeping in mind that there are some nuances here:Viewer fatigue. They’ve learned what they wanted, your once-attractive format was viewed once too much; they’ve basically outgrown your channel.Decreases caused by an algorithm change on YouTube.You’ve stepped into a niche too far away from their interests.Some types of content or topics have a higher tendency to attract subscribers. For example, most subscribers on AhrefsTV come from our beginner-level content.Organic growth of subscribers to AhrefsTV7. EngagementEngagement is the measure of content’s ability to catch and keep attention.Engagement is probably the most controversial type on this list. It’s supposed to be a proxy of how interesting/entertaining your content is, but it’s not always reliable since it’s dependent on too many factors:Audience size. Algorithm changes.Time of day. Relativity of the metrics themselves. Is a long time on the page always a good thing? If you’re putting the most important information above the fold, could you blame content for not being scrolled all the way to the bottom?Content consumption trends. We were informed about the following metrics:Likes and comments on social media (a tip from Nina Cleere, JD).Email list engagement: how many people open your emails (open rate) and how many click on the links inside them (click rate). Higher than ever unsubscribe rate is also a sign that people don’t enjoy that type of email (a tip from Ryan Robinson).Time on page: how long people spend reading or interacting with a specific page on your website (a tip from Irene Malatesta).Scroll: how far down a page a visitor scrolls. In many cases, deeper scrolling should indicate the content is engaging enough to keep readers interested (a tip from Mariya Delano).One interesting metric we saw was content mentioned in conversations with sales reps. So if the content makes its way into a prospect’s hands and it’s good or helpful enough to be mentioned in a conversation, that’s huge. It’s pure word-of-mouth, comparable to recommending music or a movie to a friend (thanks again for the tip, Sara Stella Lantazio).Another interesting insight about engagement came from Rohan Hayes. He tracks engagement only for the ideal consumer profiles. Makes sense since this additional dimension of metrics takes the “vanity” out of “vanity metrics”.8. ConversionsIn other words, the direct impact of content on the bottom line.You could also define it as the content’s ability to generate the most valuable interactions because not all content says “buy”.Here are some of the metrics we’ve seen in the comments (we added one ourselves).Revenue/signups correlation with traffic. Based on the premise that as more people visit your site, you have more opportunities to convert visitors into subscribers or paying customers. It’s an elegant concept because it escapes the problems of attributing specific content to conversions (a tip from Nick Jordan).Conversion growth from the bottom of the funnel content. This type of content can significantly impact sales, as it targets users who are already considering buying and just need that final nudge (a tip from Samantha North).First page seen to paying customer. If your content is the first page a visitor has seen and then converted into a customer, that means the content works (a tip from Bojan Maric).Content downloads. This refers to the number of times visitors download something from your website, like an ebook, or a whitepaper. High download rates can signal that your audience finds your content valuable (a tip from us).TipFor detailed data insights, like linking revenue to website traffic, ChatGPT can help. Simply ask, “Analyze this data, calculate and visualize the correlation between [data points].” This straightforward request provides clear, convincing results.Final thoughtsJust one more thing before we wrap this up - not all of these metrics were tracked by all marketers.This means that content strategies differ, and it’s ok if some of these metrics don’t make sense in your strategy. Take your time and choose the ones that do.Got questions or comments? I’m on LinkedIn and X. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Mateusz Makosiewicz Marketing researcher and educator at Ahrefs. Mateusz has over 10 years of experience in marketing gained in agencies, SaaS and hardware businesses. When not writing, he's composing music or enjoying long walks. Keep Learning Content Outlines: How to Write Better Content Faster A content outline is a detailed overview of what will be in your article. It can improve your writing efficiency, content’s flow, and SEO too. My 5 Favorite Ahrefs Use Cases for Content Marketers Snoop on site structure, cluster keywords into article ideas, track performance by authors, and much more. 25 Types of Content You Can Use for Content Marketing In content marketing, there are heaps of options to pick from. To make it easier, we've curated 25 types for your choosing pleasure. Content Promotion: There are Only 3 Ways to Distribute Content You've published your content, now find out how to get more eyeballs on it. Why Is Content Marketing Important? 7 Reasons to Start Content Marketing Here are seven reasons why content marketing is important and deserves to be the marketing channel you should focus on.",
  "headers": [
    {
      "level": "H1",
      "text": "23 Actual Content Metrics From Actual Marketers"
    },
    {
      "level": "H2",
      "text": "1. Operational metrics"
    },
    {
      "level": "H2",
      "text": "2. Keywords"
    },
    {
      "level": "H2",
      "text": "3. Backlinks"
    },
    {
      "level": "H2",
      "text": "4. Leads"
    },
    {
      "level": "H2",
      "text": "5. Traffic"
    },
    {
      "level": "H2",
      "text": "6. Audience growth"
    },
    {
      "level": "H2",
      "text": "7. Engagement"
    },
    {
      "level": "H2",
      "text": "8. Conversions"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Mateusz Makosiewicz"
}