{
  "url": "https://ahrefs.com/blog/content-planning/",
  "slug": "content-planning",
  "title": "How to Create a Content Plan in 6 Easy Steps",
  "description": "If you want the content creation process to run smoothly, you need a content plan. Learn to build one with our simple guide.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents If you want the content creation process to run smoothly and to produce content that moves the needle, you need a content plan that aligns with your strategy.In this guide, you’ll learn how to create a content plan in six easy steps. But first, let’s make sure we’re on the same page…ContentsWhat is content planning?Content planning is the process of deciding what you’ll publish and when. It’s important for keeping everyone and everything on track and for prioritizing content in a way that makes sense for your content strategy. For example, there are thousands of SEO-related topics we could write blog posts about.Just look at how many Search Engine Journal has published: It’d take us years to publish this many posts, so we need to prioritize the ones that make the most sense for us. This is why we need a content plan.How to create a content planContent planning isn’t that hard and shouldn’t take long to put together. It’s really just about finding and prioritizing topics that make sense for your strategy, then scheduling and assigning them.Let’s go through the process.1. Make sure you have a clear content strategyHave you ever tried to cook something new without a recipe? Then you’ll know that although it can be fun, results vary. The same happens if you try to create a content plan without a content strategy. But what is a content strategy, anyway?In simple terms, it’s a document explaining why you’re creating content, who it’s for, what type of content you’ll create, and where you’ll publish it. Here’s an example for Ahrefs:Why am I creating content?To influence our audience’s buying decisions by showcasing how Ahrefs helps to solve their problems.Who am I creating content for?People who want to drive more search traffic to their websites (business owners, affiliate marketers, e-commerce stores, etc.).Where will I publish content?The Ahrefs Blog (because my audience uses Google to search for information).What type of content will I create?Blog posts.Note how simple this is. There are no “SMART” goals or other jargon. It’s just a few simple answers to a few simple questions.If you haven’t created yours yet, read our guide to creating a content marketing strategy. 2. Find topic ideasMost people do this by looking at what’s popular on their chosen platform or channel.For example, if you’re creating videos for TikTok or YouTube, you may search for a topic there and look at what’s getting views.The problem with this approach is that popular content might not have earned its views organically. They might have come from ads.For that reason, I recommend doing Google keyword research instead—even if you’re creating content for TikTok or YouTube. This is because people tend to search for similar things across platforms, and keyword tools for Google have the most accurate data.Here’s how to get started: Go to Ahrefs’ Site ExplorerEnter the domain of a popular industry blogGo to the Top pages reportHere, you’ll see which posts get the most traffic on popular industry blogs and the keywords driving the most traffic to them:For example, the top post on Hey Grill, Hey is about Texas-style smoked brisket. As you can tell from the URL and “Top Keyword” column, it gets most of its 60,000+ estimated monthly visits from the keyword “smoked brisket.”If you notice trends here, you can use them as “seed” keywords in a keyword research tool to find more similar topics. Here’s how:Go to Ahrefs’ Keywords ExplorerEnter a common “seed” keywordGo to the Matching terms reportFor example, many of the top posts on Hey Grill, Hey are “smoked” recipes. If we use “smoked” as our “seed” keyword as we did above, we see thousands of other popular topics that we could create content about. 3. Identify the best topicsThe best topics are those with the highest traffic and business potential. If you’re creating content to rank in Google search, there are a couple of other metrics you’ll want to take into account too.Let’s go through them.Traffic potentialTraffic potential is how much traffic a topic can potentially attract for you.If you’re creating content for SEO, you can use the Traffic Potential (TP) metric in Keywords Explorer for this. It shows the top-ranking page’s estimated monthly organic traffic, which is usually a good proxy for a topic’s TP.Sidenote. You will also see search volume in Keywords Explorer. However, Traffic Potential tends to be a more reliable estimate of how much traffic you’ll get by ranking #1.Search intentIf you’re creating content for Google search, you need to make sure searchers are actually looking for the kind of content you want to create. You can use the current top-ranking results as a proxy for this.For example, people searching for “smoked brisket” clearly want recipes and how-tos because that’s what all the top results are: But people searching for “wagyu brisket” are clearly looking to buy meat because all of the top results are from e-commerce pages.If your content strategy is to create blog posts for organic search, “smoked brisket” may be a good keyword to target with content. “Wagyu brisket” likely won’t be. Business potentialBusiness potential is how easy it is to “sell” your product or service in the content. If it’s easy to pitch your business, the score is high. If it’s near-impossible to do so, the score is low. For example, if you run a meat delivery service, “best meats to smoke” has a high business potential score because it’s easy to pitch your product. People are ready to buy; you just need to recommend the best solution.If you sell BBQs, on the other hand, that same topic has a low business potential score because searchers probably already have their equipment. There’s no useful way to pitch your product. The crucial point here is that business potential is relative. It depends on your business.Keyword difficultyKeyword difficulty is a measure of how hard it would be to rank for a topic.Many factors can affect this, like backlinks, content quality, and website authority, so it can be tricky to figure out. However, the Keyword Difficulty (KD) score in Ahrefs is a good place to start. This is because the higher this number, the more backlinks you’ll likely need to rank on the first page.For example, “smoked turkey” would be quite hard to rank for with a KD score of 45:But “smoked chicken legs” would be easy with a KD score of 9:Looking for a more accurate estimate? Learn about other factors you may want to consider in our “keyword difficulty” guide. 4. Prioritize topicsEvery good content plan needs prioritization because it’s impossible to write every piece of content at once. You need to pick your battles.People love to overcomplicate this, but all you really need is a similar color-coded spreadsheet.Here’s an example:Basically, all we did was add topics that passed our search intent criteria, along with their Traffic Potential (TP), Keyword Difficulty (KD), and business potential (BP) scores. We then color-coded all the scores (greener = better). To prioritize, we just eyeball the sheet for the “greenest” rows when choosing topics.Here’s a good one:Yes, the KD score may be on the high side (which isn’t ideal), but the high TP and BP make up for it.Here’s a not-so-good one:This is mostly red because it has low TP, low BP, and high KD.The beauty of this sheet is that it works for all content goals and priorities.For example, if your priority is to build brand awareness, just pay more attention to the TP column than the BP column. Here’s a topic that works great for attracting our audience of SEOs and marketers (high TP) but not so well for selling our product (low BP): On the other hand, if your priority is to improve customer retention, you can focus on topics with high business value. A good example for us is “low competition keywords.” Its TP is quite low, but it has a high BP score because you need Ahrefs to find them.Got similar topics? Consider clustering and prioritizing themIf you spot similar topics with potential while reviewing ideas, it may make sense to group them and work on them all together. This is what I did with these topics:5. Schedule topics on your content calendarA content calendar is just a schedule of what you’ll publish and when. Here’s an example of our old one:Building one is easy enough. Just pick some topics from your spreadsheet and add them to your project management software or a Google Calendar.6. Assign topics to writersIt’s finally time to set your plan into action and assign content to creators.This is super easy to do. Just assign the topics in your calendar, starting with those with the closest due dates. (There’s not much point in assigning topics months in advance. It’ll just overwhelm your writers.) You should also give writers instructions for assigning related tasks to keep your content workflow moving.For example, our content workflow looks a bit like this: Because editing, image design, and uploading are handled by other members of our team, writers need instructions for how to assign these tasks. We created a simple Google doc for this. Here’s an excerpt: Our content plan will fall apart without this, as pieces won’t be ready to publish on their scheduled date.Content plan templateIf you’re feeling overwhelmed by everything above, you can use my simple content plan template. It’s free to download, and you can fill it out in minutes.Download as Google docWhat next?Having a plan is one thing. Executing it well is another thing entirely. Learn how in our guide to content writing. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Keep Learning How to Create a Content Calendar That Works For You A content calendar (or \"editorial calendar\") is a system used by content and marketing practitioners to organize, manage and schedule content production. How to Create a Content Map: Traditional Way & Ahrefs’ Way Create your own content map with the help of our template. Or try an even simpler method we've been using for years. How to Create Relevant Content That Ranks Your content won't rank if it isn't relevant. Learn how to create relevant content that Google and searchers want to see. How to Create an SEO Content Strategy (Follow the Ahrefs’ Framework) This is a guide on how Ahrefs’ SEO content strategy works. Use it as inspiration for your own. How to Create a Winning Content Marketing Strategy (+ Template) We share how to create a content marketing strategy to help attract your target audience and influence their buying decisions.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Create a Content Plan in 6 Easy Steps"
    },
    {
      "level": "H2",
      "text": "What is content planning?"
    },
    {
      "level": "H2",
      "text": "How to create a content plan"
    },
    {
      "level": "H3",
      "text": "1. Make sure you have a clear content strategy"
    },
    {
      "level": "H3",
      "text": "2. Find topic ideas"
    },
    {
      "level": "H3",
      "text": "3. Identify the best topics"
    },
    {
      "level": "H4",
      "text": "Traffic potential"
    },
    {
      "level": "H4",
      "text": "Search intent"
    },
    {
      "level": "H4",
      "text": "Business potential"
    },
    {
      "level": "H4",
      "text": "Keyword difficulty"
    },
    {
      "level": "H3",
      "text": "4. Prioritize topics"
    },
    {
      "level": "H3",
      "text": "5. Schedule topics on your content calendar"
    },
    {
      "level": "H3",
      "text": "6. Assign topics to writers"
    },
    {
      "level": "H2",
      "text": "Content plan template"
    },
    {
      "level": "H2",
      "text": "What next?"
    }
  ],
  "author": "Joshua Hardwick"
}