{
  "url": "https://ahrefs.com/blog/content-marketing-kpis/",
  "slug": "content-marketing-kpis",
  "title": "2 Types of Content Marketing KPIs You Should Track (Separately)",
  "description": "It's uncommon to separate input and output KPIs. But doing so will tell you what resources to focus on and get better results.",
  "content": "Mateusz Makosiewicz Marketing researcher and educator at Ahrefs. Mateusz has over 10 years of experience in marketing gained in agencies, SaaS and hardware businesses. When not writing, he's composing music or enjoying long walks. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Separating input and output KPIs is a concept rarely used in content marketing. But when applied, it gives a better understanding of what resources to focus on in order to achieve the desired results.For this concept to work, selecting which KPIs to monitor carefully is essential. Here are a few input and output KPI ideas you can use for your content marketing.Contents1. Input KPIsThese are your resources: the content you produce and the ability to reach your audience.Quantity Obviously, content quantity is about how much you publish. And it’s important because each piece of content is a chance to reach your desired outcome: new sales, retaining customers, becoming a thought leader in your space, etc. For companies that are in the process of discovering content marketing, the quantity of content translates to the number of experiments you can make. For companies that know what kind of content their audience appreciates, content quantity is the ultimate KPI—the more you do, the more you grow. But how much content is enough? That is the question everyone asks, but it’s the wrong kind of question to ask. Marketing is a game where there is always “never enough” traffic, leads, links, likes, etc. Otherwise, multibillion-dollar companies would cease all marketing. So the right question is this: Can you make more content? Your competitors can be a good benchmark for this KPI. You can use Ahrefs’ Content Explorer to check how much new and republished content they’ve released in any period. Enter a URL and set the mode to “In URL” Set the filters: Published (date and published vs. republished) and LanguageGet the overall number or click on the graph to zoom in on a period ProportionThis KPI is about the types of content you publish. I think there are basically three types of content: Education – You solve your audience’s problems, typically featuring your product/service. Inspiration – You encourage, influence, and motivate.Entertainment – You evoke experiences. And I say this because these types correspond with the three possible goals you can directly achieve with content marketing (read my article on marketing goals for more details).But however you choose to categorize content, what’s key here is how you prioritize it. For example, at Ahrefs, we prioritize content that gets a score of 3 or 2 on our “business potential” scale. That means we focus on educational content because this type offers the best opportunity to feature our product (we call this product-led content). So for example, your KPI may be to split your content proportion into 70% educational, 20% inspirational, and 10% entertainment. Or you may use something similar to our “business potential” score and, say, publish content with scores 0–1 only once a month. The bottom line is to be aware of why you’re making more of a particular type of content than others. If a certain proportion works out for you, change it only for experimentation. Distribution power Your distribution power consists of the factors that allow you to reach your audience.It depends on the marketing channels you focus on. Here are some examples: Link profile – If you create content designed to rank, you usually need links to rank. At Ahrefs, we have a handy metric you can use to gauge the strength of your (and others’) link profile, called Domain Rating. Followers – If you publish content on social media, followers “consume” your content and help you reach other people. Email list – If you want to reach people directly through email, the number of subscribers is your distribution power. For highly competitive keywords like “best workout,” you will likely need a strong link profile to get into the top five.The main thing that will likely impact your distribution power is the quality of your content. However, there are other ways to gain and lose it, and that’s why it’s good to track it as a separate KPI. Two examples to illustrate:You can improve your link profile by doing link building. Too many emails per month can make folks want to opt out. Also, not all content will be a good fit for a newsletter (for example, we don’t send emails about each new addition to our SEO glossary). What not to track as input KPIsAnything related to cost efficiency. It’s always a good idea to keep track of your spending. But tying your performance to how much you pay for it leads to these mistakes: Modeling content based on the cost to create a single successful piece of content. Each topic has its unique potential, and it can change over time. Cutting costs just for the sake of it; pushing hard to make more with less. Just because you can create more with less doesn’t mean you should. It also doesn’t mean that more with less is a sign of good performance. 2. Output KPIsOutput KPIs are direct results of distributing content to your audience. In other words, this is the value you create through content marketing directly. This is not to be confused with outcomes of effective content marketing, such as sales. Difference? If I wanted to throw a birthday party for my son, I’d get him a birthday cake. That would be the output of my actions. Outcome: happy kid. It’s the same with content marketing and sales.Organic share of voiceShare of voice (SOV) is a metric of brand visibility compared to the visibility of competitors. Originally it was used to measure advertising, but it’s a perfect fit for SEO content too. By tracking SOV for the keywords you target, you can tell instantly who is more likely to be discovered by potential customers. To track SOV in organic search, you can use a tool like Ahrefs’ Rank Tracker. It automatically measures SOV by calculating the percentage of clicks that land on a target compared to the total number of clicks for all tracked keywords. Organic traffic Everybody wants more traffic. Yet, site traffic is practically on every list of vanity metrics. So what to make of all this? The problem with site traffic is the context: What do you expect this metric to tell you? After all, even sales can be a vanity metric if you’re looking for a number that speaks about the true worth of a business. If you’re developing SEO content, organic traffic tells you how many clicks came to your website through relevant keywords. In other words, you’re measuring the amount of qualified traffic coming to your site. To measure organic traffic coming from Google, use Google Search Console (data straight from the “horse’s mouth”). But here’s a tip: exclude branded keywords to see only keywords for topics you target with your content. Open the “Search results” report and add a new filter for queries not containing your branded keywords.You never know how much organic traffic you’re eventually going to get, but there’s a good way to estimate it. Use the Traffic Potential metric in Ahrefs’ Keywords Explorer. It shows the overall traffic the #1 ranking page gets from all of the keywords it ranks for. LeadsIf you want to capture leads with your content, you can also measure their number as an output KPI.But this only makes sense if you use gated content. It’s when the user needs to submit contact information to access the content. To make this as objective as possible, you can measure the rate between views and form completions. This way, you will make the KPI independent of how much promotion any given content piece receives. EngagementEngagement is a very needed but unfortunately imperfect metric. By engagement, we want to measure if our content was meaningful to the audience: Did they learn anything, did they find it inspiring, were they entertained, etc.? But does a like or share that takes one second to do express that?You never know because all we get are “interactions.” All you know is that it’s better to get high engagement metrics than low ones. Plus, engagement metrics are still better than mere views. So this is definitely not a set of KPIs to obsess over. Treat them rather as a way to compare two pieces of content or as a way to test out new topics, formats, or publish times on social media. Here are a few engagement metrics to keep an eye on:Comments on blog posts and social media – You can use social media management tools to track both the amount and sentiment of comments. Engagement rate on Twitter – A metric that at least tries to be independent of your follower count. Shares/retweets – Notice how this number is always lower than likes? It’s because people put their own reputation at stake when they share something. When that number gets noticeably higher, you know there was something special about that piece of content. Product usageMentioning features of your product should generate usage demand inside your product. After all, the whole point of creating content around the product is to make people feel like they want to use it. With product analytics tools (e.g., Mixpanel, Heap, etc.), you can learn what features are used, when, and for how long, among many other things. Here are a couple of product usage metrics you can consider: Usage frequency – Tells you how often customers use the features. Time spent – Users should perform tasks in a reasonable time. Neither too much nor too little time is a good sign. Probably the only exceptions are features focused on productivity or exploration. Feature flow – How people move from one task to another. For example, for a product like Ahrefs, we expect that most people use keyword filters to refine their initial keyword list. That said, there are two tricky things when using product analytics:Causation – If you see an improvement in usage frequency, you need to have a high probability that it’s been impacted by the content. For example, you can pick a time when no feature updates are expected or measure a certain workflow suggested in content. If you’re able to assign an event to content (e.g., in-app video view, a feature release note), you can also take advantage of reports like the impact report. Data privacy – Makes sure your product analytics solution is ethical and compliant with local laws. For instance, you may want to collect data in anonymized, aggregated sets rather than individually. Feedback By feedback, I mean situations when users express their opinions about your content. Some feedback may come through comments on blog posts or social media. Something that can help you automate monitoring these discussions is sentiment analysis—you can find this feature in most social media monitoring tools. Another idea is to introduce a feedback box on your blog. This can help you understand the quality of your content, but it’s not an ideal solution (prone to trolls, sensitive to where you place it on the blog). Probably, the best solution is to survey your audience regularly. For example, you can send out a survey to your email list asking specific questions about your content: “Would you like to see more of a specific topic?” or “Do you find the article easy to follow?”Another good way to measure feedback would be to use the NPS (Net Promoter Score). It’s based on a simple, quick question, “Would you recommend our blog/newsletter/etc.?” Backlinks Backlinks (or inbound links) are links to a particular webpage or resource from other webpages. They’re one of the most impactful ranking factors. So generally speaking, the more backlinks you get, the higher you can rank and the more traffic you can generate. Backlinks can be useful as a way to measure the output performance of content because people generally link to content they find useful and/or important. However, it’s best to track backlinks for content designed to get them (so-called link bait). Because not all types of content will entice people to link. You can use the Backlinks report in Ahrefs to analyze links to any page on the web and get information like DR, traffic of the linking page, when it was discovered, and more. Do keep in mind that links are quite rare. While everyone can come and comment on a blog post, not everyone runs a website or has relevant content on that website to link from. What not to track as output KPIsAnything related to sales. Sales are too complex a phenomenon to attribute to one marketing tactic, even if content marketing is your only tactic. The reason for this is consumers typically don’t make purchase decisions based on how good your content is. They weigh in many content-unrelated factors such as price, competitors, customer support, reputation, or even emotional reasons. An increase in sales can be an outcome of content marketing—but only if other purchase requirements are met. In other words, you can have great content. But if you have a product without market fit, you’ll struggle with sales (and vice versa). The same applies to content marketing ROI. Content marketing affects many aspects of marketing (the whole marketing funnel), so tracking how many sales you got from content would be shortsighted. Final thoughtsTo sum up, input KPIs are your resources and output KPIs are the value you create with your resources. When choosing KPIs in these two groups, choose the ones that you measure and impact directly. A good idea may be to start with the outputs you want to generate and match them with the inputs. Got questions or comments? Let me know on Twitter or Mastodon. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Mateusz Makosiewicz Marketing researcher and educator at Ahrefs. Mateusz has over 10 years of experience in marketing gained in agencies, SaaS and hardware businesses. When not writing, he's composing music or enjoying long walks. Keep Learning 13 Content Marketing Ideas for Small Businesses Here are 13 actionable content marketing ideas you can apply right away to your small business. 25 Types of Content You Can Use for Content Marketing In content marketing, there are heaps of options to pick from. To make it easier, we've curated 25 types for your choosing pleasure. Why Is Content Marketing Important? 7 Reasons to Start Content Marketing Here are seven reasons why content marketing is important and deserves to be the marketing channel you should focus on. 5 Popular Types of Blogs That Make Money Professional blogging can net you a decent income. To help you get there, here are five blog types that have been proven to be lucrative. How to Create a Winning Content Marketing Strategy (+ Template) We share how to create a content marketing strategy to help attract your target audience and influence their buying decisions.",
  "headers": [
    {
      "level": "H1",
      "text": "2 Types of Content Marketing KPIs You Should Track (Separately)"
    },
    {
      "level": "H2",
      "text": "1. Input KPIs"
    },
    {
      "level": "H3",
      "text": "Quantity"
    },
    {
      "level": "H3",
      "text": "Proportion"
    },
    {
      "level": "H3",
      "text": "Distribution power"
    },
    {
      "level": "H3",
      "text": "What not to track as input KPIs"
    },
    {
      "level": "H2",
      "text": "2. Output KPIs"
    },
    {
      "level": "H3",
      "text": "Organic share of voice"
    },
    {
      "level": "H3",
      "text": "Organic traffic"
    },
    {
      "level": "H3",
      "text": "Leads"
    },
    {
      "level": "H3",
      "text": "Engagement"
    },
    {
      "level": "H3",
      "text": "Product usage"
    },
    {
      "level": "H3",
      "text": "Feedback"
    },
    {
      "level": "H3",
      "text": "Backlinks"
    },
    {
      "level": "H3",
      "text": "What not to track as output KPIs"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Mateusz Makosiewicz"
}