{
  "url": "https://ahrefs.com/blog/digital-marketing-tactics/",
  "slug": "digital-marketing-tactics",
  "title": "13 Effective and Budget-Friendly Digital Marketing Tactics",
  "description": "Using these online marketing tactics, anyone can effectively promote a product or service. Even on a small budget.",
  "content": "Mateusz Makosiewicz Marketing researcher and educator at Ahrefs. Mateusz has over 10 years of experience in marketing gained in agencies, SaaS and hardware businesses. When not writing, he's composing music or enjoying long walks. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents The web is one of the best places to go if you want to promote a product or service but are on a limited marketing budget.The two main reasons are a) it offers low-cost or even free traffic and b) there are plenty of occasions to be promoted through other people’s websites and social profiles. Here are 13 digital marketing tactics that will help you tap into that potential.Contents1. Ask bloggers and magazines to review your productChances are, you will find plenty of opportunities to get your product reviewed.People look for reviews of brands they are interested in or even trust (still, they need someone else’s opinion before they buy).People look for the best in a given category. Regardless of the brand.People even ask Google the same questions as they would a real person. Aside from simply searching for similar product reviews on Google or YouTube, a good idea is to check where your competitors got their reviews. One reason is that reviewing similar products is a chance for the reviewer to demonstrate neutrality. You can find opportunities that fit the bill by analyzing backlinks: Plug in your competitor’s URL in Site ExplorerGo to the Backlinks reportSet the “Word or phrase” filter to Ref. page URL: Contains and type in “review”Hit “Apply”On the results page, change the mode to “One link per domain” to get a list of websites featuring your competitor’s productsGoing forward, the crucial part of the process is the pitch itself. Here are a few tips for sending your review pitch. You can:Send personalized messages. Tell a bit about your company.Send requests via the provided contact channel. It’s a sign that you’ve read the review guidelines and respect the reviewers. Explain who your product is for and why the reviewer’s audience will be interested. Provide a full media pack with pictures, videos, and tech specs (if applicable). What may also be effective is offering a live online demo.Show where your product has already been featured. You can also share testimonials from your customers. 2. Let affiliates do the workIn this type of marketing, you let other people (affiliates) promote your product/service for a share of profits from the sales they helped to generate.Affiliate marketing needs very little upfront investment. Most of the costs are performance-based (you pay only if you make money), so you can start practically risk-free. One of the options is to create your own program. But that may need quite a lot of work and an established brand to attract affiliates. View this post on Instagram A post shared by Kat: Chief Excel Officer (@miss.excel)So probably the easiest way to get started with this tactic is to join a network like ClickBank, ShareASale, or GiddyUp. They provide the tech and affiliates as well. You simply set up your profile, upload your product info, and you’re ready to get discovered by influencers in your niche or select the ones you’ll like to work with (depending on what your network offers).Then affiliates are ready to include your product in their content (if they think it’s worth recommending). For example, here’s an article on setting up a home recording studio by Musician on a Mission. The Focusrite 2i2 is an affiliate link. It’s a great product, by the way.According to Site Explorer, this article gets an estimated 10K organic visits (and this is probably not the only traffic source to this piece). There’s definitely potential in affiliate marketing. 3. Create blog posts that rank and convert Blog posts that rank and convert are ones that simultaneously:Rank high in search engines for things people search online – This is the part that gives you free traffic. Feature your product/service as the solution – This is the part where you can turn website visitors into customers. For example, our complete guide on keyword research was designed to explain how to solve the title problem using Ahrefs. And because it ranks high for relevant terms like “how to do keyword research” and “keyword analysis in seo,” it brings us free traffic. To get free organic traffic to your website, you need a topic with search traffic potential. You can:Go to Ahrefs’ Keywords Explorer and type words or phrases relevant to your niche. You can also choose a country where you want to rank and one of 10 search engines. Go to the Matching terms report.Get keyword ideas along with their Traffic Potential (TP).If the list is too long to manage, you can use filters like Keyword Difficulty (KD) or keywords with informational intent (“how,” “what,” “guide,” etc.). Then prioritize your keywords based on the ability to naturally feature your product. Here’s a scoring system you can use: 4. Write guest postsGuest posting is when you publish on other websites. This tactic gives you a couple of benefits:You get a boost to your website traffic.You expose your brand to a new audience. The earned link contributes to your backlink profile and can boost your SEO. You can make new connections in the industry.The other side of the deal gets free quality content for their readers. So you don’t need to feel awkward when pitching your articles. You can find guest blogging opportunities just by Googling them. You can use search operators to get more relevant results, e.g., (blockchain OR crypto) AND (“guest post” OR “guest article”). It’s easier with Ahrefs’ SEO Toolbar and any Ahrefs premium plan. You can then vet your opportunities as you Google them with the help of SEO metrics like Domain Rating (DR) or organic website traffic.Further readingGuest Blogging for SEO: How to Build High-Quality Links at Scale Blogger Outreach: How to Do It at Scale (Without Feeling Like a Jerk) 5. Pitch to podcasts and newslettersPodcasts and newsletters are natural places for businesses to be featured in. Podcasts often interview business owners, managers, and other professionals. Newsletters don’t shy away from featuring good articles coming from businesses.Some of them directly promote tried and tested products. You can find podcasts and newsletters to pitch the same way you’ll look for guest posting opportunities (see section above).Additionally, there’s a possibility someone already made a list of places where you send your pitch, so simply try Googling things like “best [your niche] podcasts”.Being featured on podcasts and newsletters usually won’t cost you anything. But oftentimes, there’s a paid option too. So depending on your budget, you can sponsor a couple of episodes, and you can do it repeatedly in different places.We’ve found out that’s an effective tactic for brand awareness that pays off in the long run—you can read about our experiences with podcast advertising in this article. 6. Answer journalist requests to get free pressHave you ever wondered where journalists get all those expert quotes? Some of them are from services like HARO, where journalists simply post requests for quotes. Sample journalist request via HARO.This tactic is your chance to earn a high DR link and even generate awareness for your business for free. All you need to do is sign up for a service like HARO, SourceBottle, or Featured. Then provide your best answer ASAP.While using these services, you’ll likely receive a lot of emails. So a nice little trick here is to use email filters.Learn more: Digital PR: The Beginner’s Guide to Making Your Brand Unmissable 7. Leverage user-generated content on social mediaSocial media is awkward for brands. Brands are like that new guy at a party who is told, “Just blend in, and you’ll be fine.” Maybe except for LinkedIn, for obvious reasons. Sure, brands can run online ads and perform customer service. But the main challenge with social media is having something to say on a consistent, day-to-day basis. One of the best solutions for that is to feature user-generated content (UGC) from customers. It’s a natural type of content for all kinds of social marketing platforms. Because social media is supposed to be about people, not businesses.You can post it regularly.It’s an effective, non-intrusive form of promotion.It amplifies word of mouth because it provides something to talk about. Authors will tell their friends they’ve been featured by a cool brand. Other users will engage in conversations with the authors.Here are some examples. Notice they all feature the product one way or another: View this post on Instagram A post shared by GoPro (@gopro)https://www.tiktok.com/@vans/video/7032145833617378565?is_from_webapp=v1&item_id=7032145833617378565https://twitter.com/Fender/status/1561382607228735490A lot of that content will happen organically. Someone will post a photo or video tagging your brand. You can then repost it or ask that person for permission to post on your channel. This way, you may even come across future brand ambassadors. But you can also encourage UGC: Run a contest – It can be a regular contest where the author of the best picture wins (likes from other users can be treated as votes). Launch an official hashtag Offer something in return – Examples: a freebie, a discount code, etc.The general rule here is that your social media content has to have a human face. So here are some alternative options. Option 1. Show the people behind the company and their work. This works great for craftsmen, artisans, and artists. View this post on Instagram A post shared by Robert Dudzic (@robertdudzic)Option 2. Give your social media account a personality. Don’t be just another boring company.https://twitter.com/Wendys/status/1554843608225927169https://twitter.com/Wendys/status/1554848371533283329https://twitter.com/Wendys/status/15548606944110264328. Rank videos in search SEO and video marketing form a powerful marketing combo—you get one of the most engaging content types with a free traffic source. Videos from YouTube ranking on the first page of Google.For this digital marketing tactic, you need video topic ideas that get search traffic from Google. Open Site Explorer and type “youtube.com”Go to the Organic keywords report; there, you’ll get keywords where videos from YouTube rank on the SERPs (search engine results pages) Use filters to find videos relevant to your website PRO TIPIf you find a topic that you already rank for, that’s even better. You can “double dip” on search demand if you manage to rank the video too. 9. Create link bait content Not to be confused with clickbait content. Link bait is content designed to attract backlinks. It’s something so valuable and interesting that bloggers and journalists want to link to it.Example: This report on side hustles in America from Zapier. It’s a 637-word research that earned 2K backlinks from 910 domains, including some very high DR ones. There are two main benefits of link bait content: The earned backlinks will help the link bait content rank higher on the SERPs (since backlinks are a key ranking factor).You can distribute some of the link authority from your link bait to other pages and help them rank higher on the SERPs too.The easiest way to identify link-worthy content is to see which pages attract the most backlinks on renowned websites in your niche.Enter your competitor’s domain into Ahrefs’ Site ExplorerGo to the Best by links reportLook for patterns like repeating types of content; you can also look for well-performing content you can recreateYou can dig even deeper and learn which parts of the content attracted the most backlinks. Enter the Anchors reportLook at the anchor that got the most referring domainsLearn more: What Is Link Bait? 7 Successful Examples 10. Repurpose your contentRepurposing content allows you to get more mileage from your content by sharing it on other marketing channels and in other formats. It’s a bit like franchising your content; a book becomes a movie, then a video game, then a series on Netflix, and so on. To illustrate, our blog post on SEO checklists gets an estimated 7.2K visits from Google each month. But we didn’t stop there. We repurposed the article into a video that gave us an additional 211K views on YouTube (not to mention likes and comments). The list of possible content “transformations” is quite long: Blog posts into Twitter threadsBlog posts into videos (and vice versa) Individual videos put together into a complete courseEbooks into email drip campaigns Ebook excerpts into guest posts And so on. We’ve got a full guide on content repurposing, where you can get some inspiration for this digital marketing tactic. PRO TIPWhen repurposing your text content into video, you can prioritize topics that get your videos search traffic from Google. Here’s how to find them:Go to Site Explorer and enter your domainGo to the Content Gap report In the first two input fields, put your domain and youtube.com; then leave the last input blankHit “Show keywords”On the result page, set the filters to two intersections; this way, result page will show keywords where you and YouTube both rank Feel free to use the filters to get a more refined list, e.g., word count from 2, volume from 500, keywords include “seo”To illustrate, the Content Gap report shows us we can potentially create a video on “how does seo work.”11. Amplify your content Making great content is only part of the job. You need to promote it too.It sounds like obvious advice. But lack of promotion (or distribution channels, for that matter) is a common problem in content marketing. Marketers tend to end up with great content nobody knows about. Amplifying content effectively relies on catering to the platform you use for promotion (i.e., sharing the type of content that people expect to see). For example, let’s say you’ve created a paid online course on photography. Here are the steps you can take to amplify that course. You can:Create a series of SEO blog posts that link to the course so that you can get free traffic from Google. For instance, “best material backgrounds” or “car photography.”Write a guest post for a photography magazine where you mention your course. Use Instagram and/or Pinterest to show samples of great pictures taken using techniques explained in the course. Use TikTok to show highlights of the course, i.e., sharing small, digestible tips that can be demonstrated in a few seconds. Reinvest some of the course revenue to buy ads on Pinterest. It’s still quite cheap to buy ads there (compared to other big social media platforms), and it’s great for visual content.Share the beginner part of your course for free on YouTube. You can then amplify that with YouTube ads. Check out the thread below for a cool pro tip for YouTube.https://twitter.com/samsgoh/status/1295086793008853003Further reading​​13 Content Promotion Tactics to Get More Eyeballs on Your ContentContent Distribution Guide: What It Is & How to Do It12. Create lead magnetsA lead magnet offers something valuable to a website visitor in exchange for their contact information. When the visitor provides that information, they become a lead.Some popular examples of lead magnets are free trials, online tools, templates, checklists, ebooks, free consultations, courses, discounts… you get the idea.Having a lead’s contact information allows you to contact them directly and “nurture” them to become customers or brand fans. It’s a staple marketing tactic for products or services where customers need more time to research their options and make a decision. Example: free legal consultation form on a law firm’s website.The first thing you need to consider is finding a topic for your lead magnet. This can be either something that shows organic traffic potential or otherwise resonates with your audience. A noteworthy benefit of the first type is that it allows you to get free traffic from search engines. You can find ideas for that with a keyword research tool by adding some common lead magnet types in the filters.To learn more about researching topics for lead magnets and how to drive traffic to them, check out 17 Lead Magnet Examples + Tips on Topics & Traffic Sources. 13. Use email marketing (but don’t overdo it)These days, one of the best ways to convince someone to join your newsletter is to promise them something like this: And the reason is obvious: Email has got a bad rep from all of those decades of spamming and pushy sales techniques.Marketers don’t want to send unwelcome emails too. Because this will hurt their “email sender” reputation and lead to lower email deliverability. They may even get banned from their email marketing program. To stay on the safe (and effective) side of email marketing, marketers should keep tabs on these metrics:Number of emails sentUnsubscribe rateSpam complaints Email bounce Engagement metrics (low open rates, replies, forwards, clicks)That’s why some of the best (yet most counterintuitive) pieces of advice on email marketing are to:Send fewer emails – Send only relevant stuff you promised to send as often as you promised. Very occasional exceptions are OK. Rarely does anyone go above sending one email per week. Delete inactive email addresses from your list – Even though you worked hard to get those emails, you risk low engagement rates and someone eventually unsubscribing.Final thoughts Some of the best places to look for digital marketing tactics that work are other websites, especially your competitors. Here are a couple of competitive intelligence tools for the job:Ahrefs – For analyzing any website’s SEO, content marketing, and Google Ads strategiesMailCharts – For email marketing analysis Brand24 – For social media analysisVisualping – For monitoring website changesPS if you want a more strategic look on digital marketing, check out our article on 7 marketing strategies that work.Got questions? Ping me on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Mateusz Makosiewicz Marketing researcher and educator at Ahrefs. Mateusz has over 10 years of experience in marketing gained in agencies, SaaS and hardware businesses. When not writing, he's composing music or enjoying long walks. Keep Learning 3 Marketing Strategy Examples You Can Use to Create Your Own A marketing strategy is a business's overall game plan for reaching consumers and turning them into customers. How to Create a Winning Marketing Strategy in 5 Steps (with Examples) A marketing strategy is your business's battle plan that guides your future marketing efforts. The Simple Guide to Building a Martech Stack No one marketing platform can handle it all. Or be the best at everything. That’s why marketers need to build martech stacks with various tools. Here’s how. 9 SaaS Marketing Strategies for Sustainable Growth Seeking to generate long-term value? Here are nine marketing strategies that will help you maintain sustainable growth. 19 Easy (But Effective) Digital Marketing Tips Implement these simple yet effective digital marketing tips to improve your business.",
  "headers": [
    {
      "level": "H1",
      "text": "13 Effective and Budget-Friendly Digital Marketing Tactics"
    },
    {
      "level": "H2",
      "text": "1. Ask bloggers and magazines to review your product"
    },
    {
      "level": "H2",
      "text": "2. Let affiliates do the work"
    },
    {
      "level": "H2",
      "text": "3. Create blog posts that rank and convert"
    },
    {
      "level": "H2",
      "text": "4. Write guest posts"
    },
    {
      "level": "H2",
      "text": "5. Pitch to podcasts and newsletters"
    },
    {
      "level": "H2",
      "text": "6. Answer journalist requests to get free press"
    },
    {
      "level": "H2",
      "text": "7. Leverage user-generated content on social media"
    },
    {
      "level": "H2",
      "text": "8. Rank videos in search"
    },
    {
      "level": "H2",
      "text": "9. Create link bait content"
    },
    {
      "level": "H2",
      "text": "10. Repurpose your content"
    },
    {
      "level": "H2",
      "text": "11. Amplify your content"
    },
    {
      "level": "H2",
      "text": "12. Create lead magnets"
    },
    {
      "level": "H2",
      "text": "13. Use email marketing (but don’t overdo it)"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Mateusz Makosiewicz"
}