{
  "url": "https://ahrefs.com/blog/earn-more-links/",
  "slug": "earn-more-links",
  "title": "How to Earn More Links: Adding Context to Content Analysis",
  "description": "Do you want to create content that earns links? Then you need to glean insights from great content instead of great websites. Learn how in this post.",
  "content": "Derek Gleason Content Lead @ CXL. Former Internal Fan Fiction Writer at @ Workshop Digital. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents This article relies on two related arguments:1. Bad content on big websites earns more links than it deserves. 2. Great content on small websites earns fewer links than it deserves.Why does this matter?Because most of us base our content strategy on the “most linked” content on a topic.Too often, that focuses attention on great websites rather than great content. Many of the “top performers” are mediocre articles that earn links solely because they’re on popular sites.What we really want to find is content that earned a disproportionately large number of links for a given site. If a post earns 20 links on a site that no one comes to regularly, can’t rank quickly, and doesn’t get any distribution support, that content likely has some great lessons.This article shows you how to identify these “overachievers.” But first, let me show you the power of context.The power of context: a brief analogySay we want to create a list of the greatest NBA players of all time. That way, we can determine the most important qualities in a player. We’ll use a simple metric: wins.That sounds reasonable, right? If we identify the NBA players (i.e., posts) with the most wins (i.e., links), that should give us a great list to work from.Based on that analysis, these are the top 10 NBA players of all time:It’s not a bad list. But there are plenty of omissions—unless you believe Michael Jordan is 32nd, Magic Johnson 37th, and Larry Bird 54th.In fact, you may already be questioning the methodology. Shouldn’t we consider how many games each player played? Couldn’t some players sneak into the top 10 simply because they played bit parts for great teams?These are the exact same shortcomings that exist with most content analysis.If we add just a bit of context—the percentage of games won—the list changes rather dramatically, and for the better:Is it perfect? No. (Jordan is still 18th.) Am I better off focusing on the qualities of Magic Johnson and Larry Bird rather than Tony Parker and Derek Fisher? Absolutely!And what about all the other bits of context that would make this list even better—points, assists, championships, etc.? That’s how you can take the simple analyses below to the next level.Why mediocre content dominates “most linked” listsQ. “Shouldn’t I just “skyscraper” the most-linked content on my topic?” A. “No, absolutely not!”Let me explain.Take a topic like “retirement planning.” A mediocre, 900-word post like this one earned backlinks from 51 referring domains for Forbes.com:Meanwhile, a comprehensive, 5,000-word post on a medium-size financial planning website earned links from 21:Based on the number of referring domains (51 and 21, respectively), the post on Forbes appears to be of higher “quality.” But consider all the advantages enjoyed by content on Forbes.com:Native audience. Millions will see anything featured on the front page, helping the content earn more views;Strong domain. Content ranks quickly, giving it the chance to become the source link for those referencing the topic;Large social media presence. With 15 million followers, every tweet earns at least a few dozen shares and likes, increasing visibility;Paid support. A network of paid distribution gives an added boost.So even though the number of links is greater, which post likely has more lessons for your strategy—especially if you work on a small-or-medium-size site?Posts on large sites aren’t inherently bad. But they should be placed in the proper context. To earn our attention, a post on Forbes.com should outperform most posts on Forbes.com.Folding this context into an analysis is remarkably simple.How to identify “overachieving” content by topicWe have a client that manages an upscale retirement community. We’re in charge of a monthly blog that seeks the attention of affluent, middle-aged people in the Chicago area.We know that “retirement planning” is a great topic. People researching retirement planning are still a few years away from retirement and have an interest in their personal finances.So which topics are best for our blog?Step 1: Generate a preliminary data set in Content ExplorerWe started by dropping “retirement planning” into Content Explorer, which gives us about 77,000 results.What’s the first thing we notice? Big sites dominate. Among the top 10 posts, three are from Forbes, two from Investopedia.com, and one each from HBR.org, CNN Money, and BankRate:The lowest Domain Rating (DR) is 77, and most sites in the top 10 enjoy a domain rating in the 90s.That doesn’t mean these posts are necessarily bad, but it makes me skeptical that they rose to the top on their own merit. (Several are generic articles of just a few hundred words.)Before we try to identify the best content from this data set—the “overachievers”—we can tailor the export from Content Explorer.Step 2: Tailor the data set in Content ExplorerBy adjusting the metrics below, I reduced my export set down to about 900 of the most relevant results:Date: Reduced to the last two years to focus on current topics;Language: English only, since the community is in the United States;Total shares: 10 and above to add a baseline of social success;Domain Rating: 15 and above to add a baseline of site quality (while not excluding smaller sites);Referring domains: 5 and above to add a baseline of backlink success;Organic traffic: 30 and above to focus on search-worthy topics.You may want to adjust the baseline figures outlined above depending on your needs and the total number of results.Sidenote. Adding a minimum “barrier to entry” with links, shares, traffic, and Domain Rating (DR) is an effective way to remove low-quality content or spammy sites from your list—it’s generally possible to “fake” one of those metrics with a PBN or Twitter botnet; it’s quite difficult to achieve all four.After creating a list you’re comfortable with, export the data to a CSV file.Step 3: Pull referring domains by site for each URLTwo tools offer quick ways to add domain-level metrics from Ahrefs to a list of individual URLs: URL Profiler and Screaming Frog.Connect either tool to the Ahrefs API and drop in your list of URLs. (Both work well, although URL Profiler is a bit quicker since it collects less data for each URL.)Ahrefs data in URL ProfilerAhrefs data in Screaming FrogStep 4: Organize your dataAdd a column to the export file from Content Explorer and use =VLOOKUP to add the domain-level data from URL Profiler or Screaming Frog.Divide the number of referring domains to each URL by the number of referring domains to the entire site.The resultant value gives you the percentage of referring domains to a site that a given URL accounts for—the larger the percentage, the more valuable that post was to the website.If we leave the list ordered by the total number of referring domains, it still highlights massive sites. The average Domain Rating of the top 15 is 90:Now, however, we can see that—as a percentage of total referring domains to the site—most posts make up only a tiny fraction, often as little as 0.03%.In other words, the “most-linked” posts are not “game changers” for these websites. (CNN Money has 413 posts that earned more links than the top post in the list above.)In fact, some perform worse than the average post on the site. To find exceptional content, we need to identify the overachievers.Step 5: Identify the overachieversIf you sort by the percentage of referring domains, you get a very different list:The average Domain Rating of the top 15 posts is just 56.These are not posts that merely leech off the success of a domain—these are posts that generate success, even though the absolute number of links earned is less than that of the top posts.As such, this data set is a far better starting point to identify the themes and characteristics that lead to successful content on this topic.For example, if I look at the most common words and phrases of the top content ordered by referring domains (the traditional approach), the analysis suggests I should create content on “how to save for retirement”:However, when I order the content by the percentage of referring domains (the overachievers), I get a list that focuses on average net worth:This is a strategic advantage: Our competitors will continue to crank out “10 Tips to Save for Retirement” while we focus on average net worth. Without identifying the overachievers, I would miss out on that key insight.But what if you’re not sure about the right topic? That’s when a competitor analysis comes in handy.How to identify “overachieving” content by competitorIf you don’t know which topic to choose, finding your competitors’ overachieving content is the best place to start.We faced this challenge when trying to generate content ideas for an ecommerce website that designed custom t-shirts. When we started researching by topic—“custom apparel,” ”custom t-shirt design”—we weren’t having much luck.The most valuable topics for attracting our target audience weren’t closely related to the company’s service.Instead, we found out, competitors were succeeding by creating content about events and activities that could be made more fun and memorable with customized shirts and gifts.But we couldn’t get to that topical data until we first identified the “overachievers” among our competitors. Here’s how we did it.Step 1: Identify competitorsWhen it comes to content marketing, “competitors” are competitors in the broadest sense: any site competing for the attention of your potential customers.This often includes a mix of direct business competitors, related businesses, and popular industry media sites.How do you find competitors? There are two easy ways in Ahrefs.Use the Competing Domains report (in Site Explorer) to quickly identify the domains that compete with your site most often in organic search:Site Explorer > enter competing domain > Competing domainsOr enter a few head or body keywords into Keywords Explorer, then check the Traffic share by domains report to see who owns the most organic real estate.Keywords Explorer > enter a few relevant keywords > Traffic share by domainsIn this instance, some of the top organic competitors weren’t doing much (or anything) in the content marketing space.Ultimately, we settled on a list of five direct competitors (Custom Ink, Spreadshirt, BlueCotton, Printful, Rush Order Tees) and two major players in a similar space (DiscountMugs, Shutterfly).Step 2: Export “Top content” data from Site Explorer for each competitorThe Top Content report does a pretty good job of removing the homepage, service pages, etc., from the report.If you know you’re interested only in the content on a subdomain or subdirectory (e.g., blog.customink.com), you can use a Prefix search to specify that in your initial data pull:Step 3: Organize your dataCombine all exports into a single sheet. Create a new column and tag each domain with the company name.Divide the number of referring domains to each post by the total number of referring domains to all posts for that site. Use the =SUMIF function to sum the links to a given site based on the company name column:=[Referring Domains to URL cell] / SUMIF(range, criteria, [sum range])=E3/SUMIF(A:A,A3,E:E)Sidenote. You can apply this same process to social share data included in the export.Again, if we look only at the “most linked” content, our list is made up almost exclusively of posts from Shutterfly since it’s a large, powerful website:Which topics would we select with this traditional analysis? Massive listicles:“The 100 Most Iconic T-Shirts of All Time”“100 Fun Family Photo Ideas for 2018”“100 Christmas Photo Ideas for 2017”“75 Graduation Party Ideas Your Grad Will Love For 2018”“85 Creative Gallery Wall Ideas and Photos for 2018”While these topics may have some useful ideas, it’s difficult (if not impossible) to know whether those posts earned links because they were great or because they were on a powerful website.Regardless, a traditional analysis wholly ignores overachieving posts on smaller sites, which almost certainly earned any links on merit alone.Step 4: Identify the overachieversOnce we sort by the percentage of referring domains (overachievers), we get a much more diverse list that includes some (relatively) big wins for smaller sites:Sidenote. You will need to adjust your baseline of absolute success depending on what you consider a “win”—5 domains? 10? 100? But remember: Just as many posts on Forbes.com don’t deserve the 100 links they earn, many posts on smaller sites deserve far more than the handful they get.The reordering to highlight overachievers shows the success of smaller listicles focused on businesses:“Eighteen Awesome Corporate Outing Ideas”“9 Fantastic Team Building Ideas, Games and Activities”“27 Creative Trade Show Ideas - Engage More People”“21 Company Team Names for Corporate Team Building”“5 reasons large companies are using dropshipping to scale their businesses”“10 Creative Small Business Ideas to Thank Clients During the Holiday Season”Corporations seem like a ripe opportunity. With this knowledge, we can return to Content Explorer to conduct topical research about corporate outings and team building.Beyond “big sites vs. small sites”A major advantage of this process is that you can compare competitors with varying link profiles at the same time.This is true even if you’re comparing several large sites. For example, the chart below shows the greatest overachievers for recipes among four major players: New York Times Cooking, Food Network, Epicurious, and Serious Eats:Again, the benefit of context is that no matter the size of the site, we:Demote average or below-average performers; andElevate above-average performers.Final thoughtsContent analysis will always have a subjective component—it’s expert analysis of meaningful data. Even the best analysis, however, fails if it relies on the wrong data set.Adding a minimum of context not only improves a data set, but it also provides a different data set than the one most competitors rely on—“overachieving” posts seldom rise to the top of lists of the “most linked” content.In other words, at least for the moment, the insights are yours to exploit. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Keep Learning 6 Linkable Asset Types (And EXACTLY How to Earn Links With Them) Linkable assets are awesome pieces of content that can be leveraged for links. But did you know that most successful linkable assets tend to be similar \"types\" of content? In this post, I'll explore six linkable asset types, and explain how you can easily earn links with them. Relationship-Based Link Building: How to Earn Trust & High-Quality Links Want high-quality links in 2023? Then you'll need to build relationships. Here's how to make it happen the right way. How to Perform a Competitor Link Analysis in 3 Steps Patrick Stox shows how to perform a basic competitor link analysis and how to take it to the next level with a scaled process using bigger data. How to Find and Fix Broken Links (to Reclaim Valuable “Link Juice”) Do you have broken links on your site? Then you might be wasting valuable \"link juice\" and giving your visitors a bad experience. Here's how to find and fix all broken links from (and to) your website. Listicle Outreach: How Hunter Built 96 Links in 3 Months (Case Study) Learn how Hunter built 96 new backlinks and 33 new mentions in listicles within three months.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Earn More Links: Adding Context to Content Analysis"
    },
    {
      "level": "H2",
      "text": "The power of context: a brief analogy"
    },
    {
      "level": "H2",
      "text": "Why mediocre content dominates “most linked” lists"
    },
    {
      "level": "H2",
      "text": "How to identify “overachieving” content by topic"
    },
    {
      "level": "H3",
      "text": "Step 1: Generate a preliminary data set in Content Explorer"
    },
    {
      "level": "H3",
      "text": "Step 2: Tailor the data set in Content Explorer"
    },
    {
      "level": "H3",
      "text": "Step 3: Pull referring domains by site for each URL"
    },
    {
      "level": "H3",
      "text": "Step 4: Organize your data"
    },
    {
      "level": "H3",
      "text": "Step 5: Identify the overachievers"
    },
    {
      "level": "H2",
      "text": "How to identify “overachieving” content by competitor"
    },
    {
      "level": "H3",
      "text": "Step 1: Identify competitors"
    },
    {
      "level": "H3",
      "text": "Step 2: Export “Top content” data from Site Explorer for each competitor"
    },
    {
      "level": "H3",
      "text": "Step 3: Organize your data"
    },
    {
      "level": "H3",
      "text": "Step 4: Identify the overachievers"
    },
    {
      "level": "H2",
      "text": "Beyond “big sites vs. small sites”"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Derek Gleason"
}