{
  "url": "https://ahrefs.com/blog/earned-media/",
  "slug": "earned-media",
  "title": "What is Earned Media? 7 Ways to Get It",
  "description": "Earned media is publicity gained organically from promotional efforts, like press coverage, social media mentions, and search engine rankings.",
  "content": "Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Earned media is publicity gained organically from promotional efforts, like press coverage, social media mentions, and search engine rankings.But why is earned media important? And how can you get more of it?In this post, we’ll explore:Earned vs. paid vs. owned mediaWhy earned media is importantExamples of earned mediaHow to get earned mediaEarned media vs. paid media vs. owned mediaIf money changes hands at any point, that’s not earned media. It’s paid media. Examples of this include TV and radio ads, billboards, sponsorships, and online advertising (Google Ads, Facebook Ads, etc.)If you have complete control over the asset or channel, that’s not earned media either. It’s owned media. Examples include anything published on your website, newsletters, etc.However, not everything is so clearly defined. When it comes to things like SEO, it becomes a little muddier.To rank on Google, you need to create content, which is owned media. But you can only influence where Google ranks that content and for what keywords it ranks for. You don’t have full control over it.For that reason, in our opinion, SEO is earned media.It’s all about control. You can control both paid and owned, but you can’t control earned media. And since you can’t fully control where you want to rank in Google (you can only influence it), it’s earned media.Why is earned media important?Earned media is what every business strives for, and there are two main reasons for that:1. Earned media is often cheaper over the long-termIn 2019, when Parachute launched its new wool mattress, the company opted for earned media over paid media. It seeded the product with editors and influencers, which resulted in tons of articles and Instagram Stories from people who tested the mattress.In total, they spent around $20,000 on PR and product gifting. According to Ariel Kaye, Parachute’s founder, they would have had to spend at least $2 million on Facebook Ads to get the same number of impressions as they did from this earned media campaign.And unlike paid media—where you have to spend more for more impressions over time—earned media is the gift that keeps on giving.Press articles often link back to the product or company, which improves their SEO. And these articles may also rank in search and send referral traffic over time.2. Earned media is great for brand buildingThe “lack of control” with earned media is a pro, not a con.Since brands can’t control the message, it’s seen as more trustworthy by consumers. Third-party reviewers can offer their unbiased opinion about a product, and people can share their honest thoughts about a company or product on social media.As finance writer Morgan Housel puts it:The information age promotes a lot of good behavior. But more powerful is its ability to reveal bad, inefficient behavior. What used to be policed by a handful of reporters and review publications is now done by billions of everyday people on the prowl for anything that doesn’t look right.In other words, if real people are singing your praises, and it’s clear that you didn’t pay or incentivize them to do so, that helps your brand stand out in the market. This is especially true for direct-to-consumer (DTC) brands.Think about it. Parachute isn’t the only mattress company selling online today. Purple, Casper, Leesa—the list goes on and on. Most consumers probably can’t tell these companies apart, even if they see their ads.Earned media is the way to be remarkable in front of potential customers.What are some examples of earned media?Here are some examples of how earned media looks like in the wild.TV segmentNewspaper/magazine featureNiche/trade publicationsTwitter mentionsReddit discussionsReview sitesInfluencersSearch enginesTV segmentThis is the most traditional form of earned media. Appear in a TV program and reach millions of viewers in their living room.Ahrefs has yet to appear in a TV show, but authors like Eckhart Tolle have sold millions of books thanks to Oprah’s recommendation.Newspaper/magazine featureLast year, Bloomberg featured our data on the most popular Google searches in a Businessweek article. We didn’t pay for this. Our ongoing promotional efforts led the author to find our content, and he decided to include it in an article.Niche/trade publicationsSince we’re based in the relatively small SEO industry, we get regular mentions in niche-focused publications like Search Engine Journal.Twitter mentionsKari recently tweeted how much she loves the Ahrefs blog. We didn’t ask her to do this. We earned her praise by relentlessly publishing and promoting industry-leading content for years on our blog.Making a habit of regularly visiting the @ahrefs blog again. Learned the basics from them back in 2015 and still consider them a go-to primer when approaching a new problem (e.g. manual content audit - which I haven’t done in years).Still super-fanning these guys — Kari Beaulieu (@SERP_queen) September 15, 2020Reddit discussionsAnother user also shared how much they loved our blog. But instead of sharing it on their social accounts, they decided to share it with a much bigger audience on Reddit:Review sitesWe also get plenty of users regularly sharing about their experience with our product on review sites like G2:If you’re a local business, then review sites like Yelp, TripAdvisor, and Google Maps are important too.InfluencersRand Fishkin is an influencer in the marketing industry with over 440,000 followers on Twitter. He decided to share one of our articles with his audience. We didn’t ask him to do that.We earned the share because we published an article with tons of unique insights, all gained from our real-world experience.Superb post on podcast advertising - the ups and downs of *real life* process from @itsrbek: https://t.co/6DHzboqU6X— Rand Fishkin (@randfish) November 21, 2018Search enginesAccording to Ahrefs’ Site Explorer, our blog receives an estimated ~558,000 monthly visits. Take note: these are all organic visits. They’re not from ads.Google ranks our content high on their search engine, thus sending traffic our way.Sidenote. If we compare the estimate in Ahrefs with real-world data from Google Search Console, we see that Ahrefs slightly underestimates our organic traffic. Our actual Google traffic is closer to 750,000 monthly visits. The reason for this is simple: although we have a vast database of keywords at Ahrefs, no tool knows about every search query. For that reason, websites and webpages will almost always get more traffic than Ahrefs estimates.How to get earned mediaJust because you cannot control earned media doesn’t mean that you cannot influence it.Here are some ways you can get more earned media for your company.Use HAROPitch to appear on podcastsRank for “source keywords”Do something newsworthyAttend trade showsSend your product for reviews SEO1. Use HAROHelp a Reporter Out (HARO) is a free service that connects journalists to sources. After you sign up, you’ll receive daily emails from the service with requests from journalists.Here’s an example of what an email from HARO would look like:After receiving the email, all you have to do is to check if you meet their requirements and reply. If they use your answer in their post, they’ll usually credit you with a mention and backlink.As these journalists will likely get plenty of responses from other people, how do you stand out and make sure your answer gets selected? Here are some tips:Provide actual expert insight. Huffington Post journalist Casey Bond says, “Whenever you call in an expert it’s because they are supposed to be providing something to you that you can’t figure out yourself or find easily.” Don’t try to give a summarized answer from an article you Googled. Provide real insight that can only come from expertise or experience.Share your credentials. Unfortunately, HARO has been abused by unscrupulous SEO professionals looking for quick links. Journalists have called them out at times and have become wary. HARO remains a great place for them to source expert quotes, but you need to prove that you’re a real expert on the topic. That means sharing your credentials, social media handles, and more.You can learn more about using HARO effectively also here (tip #6) or in this video:https://www.youtube.com/watch?v=73lj6m6Xulc2. Pitch to appear on podcastsIf you’re a subject matter expert, HARO isn’t the only way for you to gain earned media. The ubiquity of podcasts means you can also appear as a guest and share your expertise.This is a strategy we’ve used at Ahrefs.In 2019, our Chief Marketing Officer, Tim Soulo, set a goal to appear on more than 20 podcasts. He accomplished that in only four months.How do you find podcast opportunities?A straightforward way is to identify someone of a similar caliber who’s been on multiple podcasts.Let’s use Tim as an example.First, we’d paste his website (ahrefs.com) into Ahrefs’ Site Explorer, go to the Backlinks report, and type his name in the “Include” box.Second, we’d eyeball the list to see the podcasts he has been on.Third, we’d find the podcast hosts’ email and reach out to see if they’re willing to interview us.Recommended reading: 12 lessons I learned from doing 20+ podcast interviews in 4 months3. Rank for “source” keywordsIn her presentation for the 2019 Chiang Mai SEO conference, SEO consultant Stacey MacNaught said this:Journalists have no access to data or premium tools—that’s an advantage.Stacey MacNaught, SEO Consultant MacNaught DigitalWhat does she mean? Journalists often need to back up their arguments with data. And when they do, they usually mention and link to the source of that data.For example, take our mention in Bloomberg. It came as a result of us having some unique data that helped the author make his point.But here’s the thing: you can’t just create any old data, publish it wherever, and expect publicity. If you want to earn coverage from this tactic, you need two things:Interesting data. When we say interesting, we mean interesting to relevant journalists.Delivery mechanism. Having interesting data is a start, but unless you have a way to get it in front of the relevant journalists, you’ll struggle to earn coverage.There are tons of ways to do the two things above. For example, you could create or curate data about a trending topic, then use a tool like Content Explorer to find relevant journalists and pitch your resource.That’s the “traditional” route and it works, but another tactic that worked for us is to create content around so-called “source” keywords.Source keywords are the terms journalists are likely to be searching for when looking for facts and data to reference in their upcoming posts.Examples include:[topic] statistics[topic] stats[topic] facts[topic] figuresTo find these keywords, enter a few relevant keywords into Ahrefs’ Keywords Explorer, go to the Phrase match report, and use the “Include” filter to find keywords containing words like statistics, stats, facts, and figures.Look through the list for a good keyword to target.For example, if we owned a coffee site, we could potentially target either “coffee nutrition facts” or “coffee statistics.”From there, create a post by curating a list of up-to-date statistics (owned media). Then, reach out to any sites linking to competing but outdated statistics pages on the same topic to build links to your page (earned media).We did this in 2020 for the term “SEO statistics.” As a result, our page has earned links from over 350 websites and ranks #2 for its main keyword.Learn how we did this step-by-step in this post or this video:https://www.youtube.com/watch?v=gMcA-8nalL84. Do something newsworthyDo you want to be in the news? Then be the news.When done right, PR stunts can help generate tons of earned media mentions on publications and across social media. I’m sure you’ve heard of at least a few of these campaigns, from Red Bull’s stratospheric dive to Dove’s Real Beauty campaign.It doesn’t have to be crazy expensive either.For example, KFC cleverly leveraged their Twitter account to get earned media. They secretly followed 11 people and waited for someone observant enough to notice it was a play on their “secret recipe” —five spices (the five Spice Girls) and six herbs (six people named Herb)..@KFC follows 11 people.Those 11 people? 5 Spice Girls and 6 guys named Herb.11 Herbs & Spices. I need time to process this.— (@edgette22) October 19, 2017The tweet went viral and helped KFC capture a ton of earned media in marketing-focused magazines and major news publishers.Now, there is no surefire way of creating a PR campaign that will guarantee press.However, this question from Tim Ferriss might get you started on the right foot: “What if I couldn’t pitch my product directly? What if I had to sell around the product?”I’d also recommend reading Trust Me, I’m Lying, Ryan Holiday’s book on PR and media.5. Attend trade showsIn 2016, I was working for a wearable tech startup (now defunct) that was launching a massage jacket. To prepare for the launch, we decided to attend the Consumer Electronics Show (CES) in Las Vegas to show off our product.That trip resulted in a ton of mentions on top publications like Tech in Asia, Digital Trends, and Business Insider.The Tech in Asia article even got syndicated to another massive (at the time) publication: Mashable.This was an amazing return for a relatively unknown startup based in tiny Singapore.There is no doubt that trade shows work in getting earned media mentions. After all, journalists and bloggers specifically attend these trade shows to find exciting things to cover.But of course, don’t assume that you’ll get earned media just because you’re there. You still need to be newsworthy.There are hundreds, if not thousands, of potential products to talk about at a gigantic conference at CES. Journalists have to choose from these options and report on the few they think their audience will most enjoy (or at least find novel).In our case, our product positioning—the world’s first massage jacket—caught their attention. Not only had it never been done before, but we also had an actual prototype for them to test.That made it noteworthy, which resulted in our media mentions.Recommended reading: How to Dominate Any Tradeshow, and Why Even Solo Entrepreneurs Should Try6. Send your product for reviewsAnother way we got earned media was by reaching out to journalists and offering them a jacket to test.This was how we managed to secure further press mentions on publications like Engadget and Refinery29.This strategy works even if you’re an established name. For example, Tim Ferriss sent out more than 1,000 advanced copies of the 4-Hour Body, which resulted in a ton of Amazon reviews and turned the book into a bestseller.Most recently, we gave a preview of Ahrefs Webmaster Tools to journalists, which resulted in mentions on Search Engine Journal and Tech Radar:Now, if you’re an established brand, then getting these reviews should be relatively easy. But what if you’re new, like the jacket company I worked for? How do you know which publications you should reach out to?The easiest way is to figure out who has reviewed or featured products similar to yours, then reach out and offer them your product for testing.To do this, brainstorm 2-3 competing brands. For example, if you’ve created new email marketing software, your competitors would be companies like MailChimp and AWeber.Go to Ahrefs’ Content Explorer and enter a query like mailchimp AND aweberYou’ll see tons of pages that mention both competitors.You can then export the list of unlinked domains, reach out, and try to get your brand mentioned alongside your competitors.7. SEOContent creation (owned media) is the prerequisite to rank on Google. But as mentioned above, you cannot control where and how high your content ranks. (Unless you pay for it a la Google Ads, which is paid media.)For that reason, in our book, SEO is a form of “earned media.”While you cannot dictate your organic ranking position, you can influence where it ranks. This is known as Search Engine Optimization (SEO) and broadly speaking, it involves:Knowing what your customers are searching for. Do keyword research to help you figure out which topics you want to appear for in Google.Creating optimized content. Pouring your heart and soul into a piece of content doesn’t guarantee that it’ll rank. You need to bake SEO into your content right in the beginning by following a proven SEO framework.Building links. Links are an important Google ranking factor. If you’re following the strategies above, you’re likely already getting links back to your site.Sidenote. There’s more to SEO than just keyword research, creating content, and building links. You also need to have a technically sound website (technical SEO), well-optimized pages (on-page SEO, and much more). We’re focusing on the three aspects above here because they’re your bread and butter. You’ll get nowhere unless you create content about things people are searching for and build links to that content. Looking to learn more about SEO and how to do it? Follow this free training course.Final thoughtsIf there is a thread that connects all earned media and its strategies together, it would be word-of-mouth. And the easiest way to boost word-of-mouth is to delight your customers.The concept is relatively simple:Create a product or service your customers love and enjoy;Offer helpful and friendly customer service that solves their problems;Create entertaining and educational content that helps your customers with their questions or problems.If you check these boxes, your customers will naturally share your content on social media, leave positive reviews, and tell their audience about you.Did I miss any useful tips for getting earned media? Ping me on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Keep Learning 13 Free Ways to Promote Your Business Here’s a list of tactics we’ve used at Ahrefs to grow +65% year-on-year. You can use these tactics to promote your business too. How to Calculate Churn Rate + 9 Ways to Decrease It Churn rate is a proportion of customers who stop paying for a product or service during a given time period. Learn how to work with it. 16 Free & Easy Ways to Promote Your Website There are still free traffic opportunities out there. We'll show you some of the best ones and how to make good use of them. 8 Easy (But Effective) Ways to Grow Your Email List Your email list is one of your most important marketing assets. Here are tactics that helped build several lists in the tens of thousands. 13 Effective (And Low-Cost) Ways to Promote a Product Promoting your product doesn't have to be expensive. Here's how to get the job done without spending a ton of money.",
  "headers": [
    {
      "level": "H1",
      "text": "What is Earned Media? 7 Ways to Get It"
    },
    {
      "level": "H2",
      "text": "Earned media vs. paid media vs. owned media"
    },
    {
      "level": "H2",
      "text": "Why is earned media important?"
    },
    {
      "level": "H3",
      "text": "1. Earned media is often cheaper over the long-term"
    },
    {
      "level": "H3",
      "text": "2. Earned media is great for brand building"
    },
    {
      "level": "H2",
      "text": "What are some examples of earned media?"
    },
    {
      "level": "H3",
      "text": "TV segment"
    },
    {
      "level": "H3",
      "text": "Newspaper/magazine feature"
    },
    {
      "level": "H3",
      "text": "Niche/trade publications"
    },
    {
      "level": "H3",
      "text": "Twitter mentions"
    },
    {
      "level": "H3",
      "text": "Reddit discussions"
    },
    {
      "level": "H3",
      "text": "Review sites"
    },
    {
      "level": "H3",
      "text": "Influencers"
    },
    {
      "level": "H3",
      "text": "Search engines"
    },
    {
      "level": "H2",
      "text": "How to get earned media"
    },
    {
      "level": "H3",
      "text": "1. Use HARO"
    },
    {
      "level": "H3",
      "text": "2. Pitch to appear on podcasts"
    },
    {
      "level": "H3",
      "text": "3. Rank for “source” keywords"
    },
    {
      "level": "H3",
      "text": "4. Do something newsworthy"
    },
    {
      "level": "H3",
      "text": "5. Attend trade shows"
    },
    {
      "level": "H3",
      "text": "6. Send your product for reviews"
    },
    {
      "level": "H3",
      "text": "7. SEO"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Si Quan Ong"
}