{
  "url": "https://ahrefs.com/blog/education-isnt-enough/",
  "slug": "education-isnt-enough",
  "title": "“Education” Isn’t Enough: How to Market When Information is Dirt Cheap",
  "description": "In the pre-AI world, that was true. Accurate, relevant information was rare. Curating the web’s content into more accessible formats was a real value-add.",
  "content": "Ryan Law Ryan Law is the Director of Content Marketing at Ahrefs. Ryan has 13 years experience as a writer, content strategist, team lead, marketing director, VP, CMO, and agency founder. He's helped dozens of companies improve their content marketing and SEO, including Google, Zapier, GoDaddy, Clearbit, and Algolia. He's also a novelist and the creator of two content marketing courses. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Much of marketing today is built on the idea that education is enough. Provide a searcher with functional, half-decent information, and we’re halfway down the path to winning hearts and minds.In the pre-AI world, that was true. Accurate, relevant information was rare. Curating the web’s content into more accessible formats was a real value-add. Education was the engine that fuelled growth.But today, information has become impossibly cheap. Any brand can become a generalist publisher, churning out thousands of search-optimized how to guides on virtually any topic. It’s becoming easier and easier to find customized, personalized answers to even the weirdest of long-tail queries.The internet has transformed from a place of information scarcity to one of information abundance, and with it, the value of “education” as a marketing strategy has fallen off a cliff.The era of information scarcityIn my early career (some thirteen years ago), many of my published articles were the only pieces of “educational” SEO content written on a given topic.That may sound appealing today, but at the time, it was a problem. Many SERPs were a mish-mash of different content types and search intents. The onus was on the searcher to piece together their answer from a platter of partially-helpful sources.As I’ve written before:There was a time when a Google search would yield a page of only vaguely relevant search results; finding an article that addressed your specific question was rare, and incredibly welcome.The information searchers wanted usually existed, but it was locked up in hard-to-access places: obscure forum posts, esoteric PDFs, hard-to-find personal blogs.My value-add was simply finding and repurposing this information into a more accessible format—something that would appear when people searched for it. (This was the great benefit of the skyscraper approach: centralizing disparate information into one place.)This is arbitrage: taking advantage of a temporary information asymmetry to turn a profit. The information I shared already existed on the internet, but it was difficult to find—I made it easy, making it more specific and tailoring it to whatever language was used by searchers. My content was rewarded by traffic growth.Looking back, we can refer to this time as Google’s era of information scarcity:Specific, hyper-relevant information was hard to find.Content was costly to create.Simple information arbitrage was useful and appreciated.There was little competition; companies in every industry could become first-movers.The source of information mattered little; you would take information from wherever you could get it.It was easy to separate good content from bad.The era of information scarcity was characterized by a hunt for signal amongst noise. You had a specific problem; search engines helped you trawl through semi-relevant information in the hope of an answer.The era of information abundanceBut the internet is a different place today.SEO is a tablestakes strategy, used by everyone from solopreneurs to multinational enterprises. It’s too late for the first-mover advantage to apply: simple arbitrage doesn’t have the same impact, because the chances are high that another brand (or dozen brands) has already beaten you to the punch.It’s also the easiest and cheapest it’s ever been to make content. The marginal cost of content creation has plummeted to virtually zero; brands can publish fifty articles a day and have change left over from a hundred-dollar bill. The amount of “educational” SEO content is growing exponentially as more brands become generalist publishers.Even the most niche, long-tail, ultra-specific queries can benefit from extremely relevant answers because LLMs can generate them on the fly, pulling from disparate sources and changing the context to make it fit the query. Thanks to AI Overviews, Google can even do this for you.A hyper-specific query receives a hyper-specific response, courtesy of Google’s AI overviews.This AI content is at least as good as average human content (which is to say, not very good—but that has always been true of SEO content). Most questions on most topics can receive a passable answer.… or something that looks like it. The hallucinating nature of LLMs means that generated content can have the look and feel of something polished and professional—while containing garbled nonsense information. Bad content looks increasingly like good content. It’s hard to tell the difference without deeper inspection.We have entered Google’s era of information abundance:Specific, relevant information for most queries is virtually guaranteed.Content is cheap to create; there is no barrier to entry.Simple information arbitrage has become almost worthless.There is high competition; companies in every industry are very likely to be second-movers.The source of information is everything. Searchers will seek out trusted brands and people for their information.It’s much harder to separate good content from bad.The era of information abundance is characterized by the hunt for signal amongst… signal. There are dozens, even hundreds of competing sources claiming the correct answer (including Google itself). Much of this is AI slop, LLM output regurgitating LLM output, with ever-worsening resolution.This single change—information becoming impossibly cheap and plentiful—has changed how marketing functions.How to market when information is dirt cheapThe simple act of sharing simple educational content used to be enough to win the hearts and minds of your audience. In the era of AI, where educational content has become impossibly cheap and ubiquitous, we need to do more.But how?Offer new flavors of informationAssume you are limited to publishing the same information as your competitors. Can you find a way to differentiate?Yes: by offering a unique “flavor” of that information.For example: there are a hundred different ways to consume the news. There’s news for positive people. News for people with overt political leanings. News for financiers and economists. News for nerds. News for local communities.The core body of information—things happening around the world—is largely the same, but the curation, presentation and experience of that information is radically different.We can do the same for the information we share. That “ultimate guide to link building” can become “the SaaS founder’s guide to link-building”, or “how to build your first 10 high-quality links,” or a content series following you as you actually build links.The core information contained in each “flavor” of link-building guide will be largely the same, but the experience of consuming it will be radically different.There is a trade-off here: the more specific your focus, the smaller the total addressable market. But search is becoming increasingly zero-sum. For many brands, it will be better to own a low-volume topic than try to contest a highly competitive high-volume one.Create new informationThankfully, we aren’t constrained to publishing the same information as everyone else. We can create new information, and expand the pool of available data.Very few topics have a completely fixed body of knowledge. By running simple experiments, trying to solve hard problems, or exploring weird edge cases, you can probably find a way to breathe new, useful information into existence—something that can’t immediately be found on a competitor’s website or in an LLM’s output.This is generally more difficult and expensive to do, but it offers longer-lasting benefits. I wrote more about the practicalities of doing this here: How To Stand Out in an Ocean of AI Content.Move past rote informationFinally: assume that education is table stakes, that every brand offers an exhaustive resource center and certification program covering the core topics of their industry. How would you attract attention?Entertainment is one obvious answer. The majority of the media most people consume each day is not overtly educational—it’s entertaining. Big brands like Paddle and HubSpot and small brands like Wistia and AudiencePlus recognize this reality, and are willing to make big bets into entertainment strategies with no easily-calculable pay-off.Entertainment is extremely hard, but it brings many benefits:Larger TAM. The strategies mentioned above work because they hone in on specific audiences, creating ultra-specific content that resonates with a small audience. Media is the opposite, widening your total addressable market to the largest possible size.Moat to entry. There’s a reason most companies haven’t built out media brands already: entertainment is hard. It requires a far greater understanding of your target audience than simple educational content; it’s subjective and unfamiliar and risky. This makes it harder to execute well, but infinitely more valuable should you succeed.Quicker time-to-value. As I’ve shared before, “Content marketing allows companies to deliver value to consumers at an earlier stage of the buying process than they would otherwise be able to; but as content marketing becomes more commonplace, media enables this to happen at an earlier stage still.”Source: Media Strategies Aren’t as Crazy as They SeemAs HubSpot’s Kieran Flanegan put it, “the challenge with education is it’s only relevant when you need it.” Entertainment-as-marketing-strategy allows you to reach your audience at the earliest possible stage of awareness—before they are even problem aware. There are virtually no competitors at this stage of the buying cycle.Final thoughtsToday, most digital marketing is fuelled by “educational” content: simple, utilitarian information, created by jack-of-all-trades generalists and bylined by faceless brand accounts.We’ve at least progressed to a level of sophistication where most brands publish fairly accurate, fairly helpful information; but very few brands have progressed measurably past the stage of simple information arbitrage. Most marketing content is a rehash of someone else’s work.In the era of information abundance, this kind of arbitrage is worthless. Large, established brands will use their brand awareness and domain authority to eeke out a few more years of benefit from these strategies; but smaller brands looking to carve out market share will need to do something radically different. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Ryan Law Ryan Law is the Director of Content Marketing at Ahrefs. Ryan has 13 years experience as a writer, content strategist, team lead, marketing director, VP, CMO, and agency founder. He's helped dozens of companies improve their content marketing and SEO, including Google, Zapier, GoDaddy, Clearbit, and Algolia. He's also a novelist and the creator of two content marketing courses.",
  "headers": [
    {
      "level": "H1",
      "text": "“Education” Isn’t Enough: How to Market When Information is Dirt Cheap"
    },
    {
      "level": "H2",
      "text": "The era of information scarcity"
    },
    {
      "level": "H2",
      "text": "The era of information abundance"
    },
    {
      "level": "H2",
      "text": "How to market when information is dirt cheap"
    },
    {
      "level": "H3",
      "text": "Offer new flavors of information"
    },
    {
      "level": "H3",
      "text": "Create new information"
    },
    {
      "level": "H3",
      "text": "Move past rote information"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Ryan Law"
}