{
  "url": "https://ahrefs.com/blog/enterprise-technical-seo/",
  "slug": "enterprise-technical-seo",
  "title": "Enterprise Sites Are Where Technical SEO Shines",
  "description": "Just one fix can potentially be worth millions of dollars in revenue. Here's what it takes to be successful at technical SEO in an enterprise environment.",
  "content": "Patrick Stox Patrick Stox is a Product Advisor, Technical SEO, & Brand Ambassador at Ahrefs. He was the lead author for the SEO chapter of the 2021 Web Almanac and a reviewer for the 2022 SEO chapter. He also co-wrote the SEO Book For Beginners by Ahrefs and was the Technical Review Editor for The Art of SEO 4th Edition. He’s an organizer for several groups including the Raleigh SEO Meetup (the most successful SEO Meetup in the US), the Beer and SEO Meetup, the Raleigh SEO Conference, runs a Technical SEO Slack group, and is a moderator for /r/TechSEO on Reddit. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Enterprise technical SEO is the practice of optimizing a large, enterprise company’s website to help search engines find, crawl, understand, and index your pages. It helps increase visibility and rankings in search engines.Enterprise websites are where technical SEO shines. There’s so much money at stake. One mistake can keep millions of pages out of the index or remove an entire site from search results. One fix can potentially be worth millions of dollars in revenue.Let’s look at what it takes to be successful at technical SEO in an enterprise environment.ContentsThe enterprise landscapeEnterprise sites can have complex infrastructures and a lot of legacy systems in place. You’ll have to work with a lot of teams, work through a lot of issues, and work hard on getting buy-in.Working with othersYou’re going to need to coordinate with many different teams to get anything done. Strong interpersonal skills come in handy in enterprise environments, but it’s not always natural for technical SEOs and may be an area you need to improve.These teams all have their own priorities and SEO is only going to be part of their responsibility, so you’re going to be fighting for resources and attention. In my experience, you’ll get more done by being opportunistic. Be ready to help when they’re ready to do the work.You’ll want to find out how these teams work, their processes and tools, and opportunities you may have to interact with them like any project calls, team calls, or office hours you may be able to join. The more visible you are, the more likely they are to work with you.Work where they work. Learn to write tickets in their project management system that communicates the problem, expected outcomes, and the value of implementing the changes. I’ll cover more about tickets in a bit.Technical SEOs will likely work with a lot of dev teams, but you may end up working with all kinds of teams in different area like products or services, international because of hreflang, taxonomists and/or ontologists for website structure, infrastructure, CMS teams, or even security for things that get indexed but shouldn’t be.You’ll probably have to create a lot of reports for a lot of different teams and executives. Check out our guide on enterprise SEO metrics and reporting for some tips.Organizational improvementsMost enterprise SEO teams go through similar stages of progression as they evolve. This is sometimes referred to as the SEO maturity model.Many teams start off doing ad-hoc work, but eventually things start to centralize, you create standards and processes (SOPs), and eventually you start to get more buy-in by being more proactive and doing things like training other teams.A lot of this progression depends on a leader who can be successful, visible, and sell SEO in the organization. They will likely spend as much, or more time promoting successes as they will doing the work.They may have to create SEO forecasts, have lots of executive meetings to show results, train other teams, create those SOPs, send newsletters to keep others informed, etc.For technical SEOs in particular, make sure you also promote the work of the developers and teams you work with. If you can get them visibility and a promotion, you’ll have an advocate for SEO who is bought in and will be more likely to work with you on future projects.Professional developmentThere are two major paths you can take when it comes to enterprise technical SEO. The most common is an individual contributor (IC), or an individual who is part of a team. In enterprise environments, even IC roles may have a lot of autonomy because they’re considered subject matter experts (SMEs). Some people may also end up in people management.If you want to transition to people management, what I would recommend is:Be visible on projectsBe viewed as a leaderWork on skilling upHelp your team where you canUnderstand the bigger picture for the organizationBuild relationshipsCommunicate effectivelyTake advantage of any funds you’re given for SEO courses, conferences, etc. I highly recommend attending Ahrefs Evolve if you get a chance. If you want to be a manager, you may also look into managerial or leadership courses.Crawl SetupA big part of technical SEO will be setting up your crawls and monitoring for issues. While it would be great if you could get everything technically perfect, it’s rarely realistic on enterprise websites.One of the things I like about Ahrefs’ Site Audit is that you can choose to ignore issues that you don’t find important.You can also add any custom issues that you want. We have every data point for the pages and links configurable as issues, as well as changes between dates. You can even change the prioritization level for each issue.You might also want to break down issues by CMS or even by template so you know exactly which group each issue belongs to and can see when they resolve the issues. This can be done with segments in Site Audit.You can help a lot of other teams with their data needs. You will likely be asked for things like checking for scripts or outdated file versions, words you’re not supposed to mention, extracting authors, publish dates, update dates, or other useful data.In many crawlers, you’ll need to do this setup before crawling, but in Ahrefs Site Audit you can actually search within the HTML or text after the crawl has already happened.For your crawling, you have a few options.Normal crawlsThe standard crawls in enterprise companies are usually once a month, or maybe once every week or two if you’re breaking the website into multiple sections. The downside here is that things might be broken for a while before a crawler flags an issue.Catch issues before they launchThe ideal scenario is to catch issues before they launch.In some environments, you may be able to set up unit tests to have automated checks for issues before they launch.You can also use Ahrefs’ Site Audit to crawl staging and dev environments to check for any issues before they’re launched to the public.Catch any issues faster with crawl samplingYou don’t always need a full crawl of the website which can take weeks to run on an enterprise site. You just need enough to see if any important changes were made.You can run Ahrefs’ Site Audit for a custom list of pages daily and get alerted to any changes. Using a sample across different templates or systems, you can find issues faster.You could also run a smaller crawl on any section that made any new pushes to production.The fastest way to catch changes: always-on crawlingThis is a sneak peek at what we have coming that we’re calling always-on crawling.The idea is to switch from scheduled crawls, which users tend to schedule weekly or monthly, to a prioritized crawling system that’s always on and notifies users of issues faster.IndexNow is allowing us to add a real-time option, and at the same time we will be able to save resources for our users and ourselves.For sites using IndexNow and the new always-on option in Site Audit, we’ll be able to notify users of issues shortly after they make updates to their pages.This is how that will look:I can’t think of a system that would be better than this. A practically real-time monitoring and alerting system. As a technical SEO, this is a dream come true for me.Enterprise technical SEO PrioritizationWhen focusing on technical SEO projects, you’re likely to have an unlimited number of things fighting for your attention in an enterprise environment.Check out our study on technical SEO issues. We ran audits on over 1,000,000 websites to see the most common issues.You have to prioritize tasks and focus on the most significant issues. I typically use an impact / effort matrix as a visual to help others understand what I consider the most important tasks. Here’s what that looks like:You will likely have to work with any dev teams for a better effort prediction, but in my experience I’ve found they appreciate it if you take a first pass at estimating the effort involved. Then give them the opportunity to make adjustments based on how much effort they think it will take.You may have major incidents and end up in what are sometimes called fire drills or war room situations where stakeholders are gathered to work through a problem. In this case, something likely went horribly wrong and is costing the company a lot of money. This will always override any other priorities.I doubt there’s a major website that is technically perfect. If there was, I’d be concerned they were wasting resources on things that don’t matter over things that do.What’s interesting about enterprise, is that sometimes you have to make decisions that aren’t necessarily ideal. For instance, you might have some pages or sections of the site with issues that never get fixed because doing so is more expensive than the work involved. The return on investment (ROI) just isn’t there.Instead of doing what is right, sometimes you’ll have to choose the least bad option. You won’t have control of everything. Just do the best you can and when you have the opportunity, make the most future-proof decisions you can.Enterprise technical SEO ProjectsI wanted to cover some projects to help you get started with technical SEO in an enterprise. Of course you may want to start with a technical SEO audit first in order to identify the issues.Check indexingPriority - highYou probably have some pages indexed that shouldn’t be, and many pages noindexed that should be indexed. Canonicalization is another issue to check to make sure the version of a page you want indexed is the one that is indexed.First, check the Indexability report in Site Audit for “Noindex page” warnings.Google can’t index pages with this warning, so it’s worth checking they’re not pages you want indexed.You can also check the Site Structure report in Site Explorer for any pages with organic traffic that shouldn’t have traffic.Recover links with link reclamationPriority - highSites, and the web in general, are always changing. We ran a study that found that ~two-thirds of links to pages on the web disappeared in the nine-year period we looked at.In many cases, your old URLs have links from other websites. If they’re not redirected to the current pages, then those links are lost and may no longer count for your pages.It’s not too late to do these redirects, and you can quickly reclaim any lost value and help your content rank better. I normally assign a dollar amount like $400 per referring domain in order to make a business case for this.Here’s how to find those opportunities:Paste your domain into Site ExplorerGo to the Best by links reportAdd a “404 not found” HTTP response filterI usually sort this by “Referring domains.”I even created a script to help you match redirects. Don’t be scared away; you just have to download a couple of files and upload them. The Colab notebook walks you through it and takes care of the heavy lifting for you.While this script could be run periodically, if you’re constantly having to do redirects, I would recommend that you automate the implementation. You could pull data from the Ahrefs API and visits from your analytics into a system. Then create logic like >3 RDs, >5 hits in a month, etc. and flag these to be redirected, suggest redirects, or even automatically redirect them.If you had redirects in place for a year or more already, the value is likely already consolidated to the new pages. That’s what Google recommends and seemed to be true when we tested it. You could also add a flag for “was redirected” into the automation logic that checks if the page was previously redirected for a year to account for this.Add internal linksPriority - highI’ve always found internal links to be a powerful way to help pages rank higher.Even these links may be difficult to get in an enterprise environment. Sometimes different people are responsible for different sections of the website, which can make internal linking time-consuming and may require meetings and a lot of follow up to get internal linking done.On top of the political hurdles, the process for internal linking can be a bit convoluted. You either have to know the site well and read through various pages looking for link opportunities, or you can follow a process that involves a lot of scraping and crawling to find opportunities.At Ahrefs, we’ve made this simple, scalable and accessible so anyone can find these opportunities. The easiest way to see internal link opportunities is with the Internal Link Opportunities report in Site Audit. We look at what your pages are ranking for and suggest links from other pages on your site that talk about those things.Add schema markupPriority - highI’m a fan of schema markup as long as it gets you a search feature. Check out our guide to schema markup to see which ones you should be implementing. There are some cool tools now that can even suggest schema markup based on what is seen on the page.Fix Page ExperiencePriority - mediumWhile many of these aren’t necessarily going to move the needle for SEO, they are good for users and how they experience your website, so they’re worth working on.Core web vitals. This is how fast your pages load.HTTPS. You want your pages to be secure. A surprising number of sites, >6%, redirect HTTPS to HTTP.Mobile-friendliness. Are your pages usable on mobile?Interstitials. You don’t want intrusive interstitials, or those that take up a good chunk of the screen.We cover most of these in Site Audit. For example, we pull PageSpeed Insights data so you get actual Chrome User Experience Report (CrUX) metrics for Core Web Vitals as well as Lighthouse metrics in Site Audit.We also flag mobile SEO issues.General website health / maintenancePriority - lowThese may not have much impact on SEO, but can be an important consideration for user experience.Broken links. Find them and fix them.Redirect Chains. Google will follow up to 10 hops. I don’t worry until after 5 hops.Add sitemaps. I would make sure this is automated. If you are asked to manually create them, you can do it, but just know that if it’s manual these will rarely be kept up-to-date. If you’re creating them based on crawled pages, then it’s likely all search engines can crawl them anyway.You may want to check if any of the chains are too long. Look for this in the “Issues” tab in the Redirects report.Fix Hreflang issuesPriority depends on the siteHreflang helps show the right page to the right user in search. This can be crucial for enterprise companies to get right as the dropoff from bad pathing or annoying users can cost you a lot of money.We flag a number of different hreflang issues in Site Audit.There are also some nice visualizations to help you explain issues like this first-if-its-kind hreflang cluster visualization. It shows and tells you what is broken, making it much easier to explain to stakeholders than the typical spreadsheet.Optimize crawl budgetPriority depends on the siteCrawl budget can be a concern for larger sites with millions of pages or sites that are frequently updated. In general, if you have lots of pages not being crawled or updated as often as you’d like, then you may want to look into speeding up crawling.Optimize ecommerce pagesSpecialized taskEcommerce SEO would be important for any sites selling products.For enterprise sites, faceted navigation in particular can be tricky. Luckily we have a great guide on faceted navigation.Fix JavaScript SEO issuesSpecialized taskThe bigger the site, the more likely you are to run into multiple tech stacks. Some of those may be JavaScript frameworks. These are relatively newer than CMSs and less understood by SEOs, so we have a guide on JavaScript SEO that covers many of the issues you’ll face and how to troubleshoot them, as well as how the rendering process works for Google.Migrate other websitesSpecialized taskA website migration is any significant change to a website’s domain, URLs, hosting, platform, or design. Big companies like to change these things and it creates havoc. Try to write any standards to keep things consistent and minimize the impact of changes.Keep traffic during mergers and acquisitionsSpecialized taskEnterprise companies buy other companies all the time. When I worked in enterprise SEO, I felt like I was constantly doing one website merger project or another. There’s a lot that can go wrong and a lot of money on the line. Check out our guide on SEO for mergers and acquisitions for more info.Analyze log filesSpecialized taskI would typically consider this task firmly in the developer department, but it is something that technical SEOs may be asked to do at times. Logs can be expensive to store and analyze and they contain private information (PII) with IP addresses, so many companies won’t give SEOs log file access. You may be able to get access for just major search bots like Googlebot and Bingbot if you ask.The most common use case of logs is for seeing what pages to redirect, and you can usually get this from your analytics or the Crawl Stats report in Google Search Console.I’ll be honest, I don’t see much value in log file analysis for technical SEOs. Finding and linking to orphaned pages which no one bothered to link to, or trying to get more low-value pages indexed that no one put effort into making better does not excite me.I usually need them to troubleshoot an issue every couple of years or so. You might be able to make a case of getting logs for things like crawl budget or monitoring spikes in crawling which could indicate major changes on the site. In my experience, the effort and cost of log file analysis often exceeds the benefits.Pull data from APIsSpecialized taskI wouldn’t expect every technical SEO to do this, and I usually consider working with APIs a job for a developer, but many technical SEOs do have the skills to help with this kind of thing. Typical use cases are data storage, report building, etc.Machine learning tasksSpecialized taskThis definitely isn’t a requirement for technical SEOs, but there are many who take on machine learning projects and help with things like semantic analysis, redirect automation, keyword clustering, etc.Submitting TicketsWhen submitting tickets to dev teams, you want to be thorough and concise. You need enough detail that they know what to do, but for the ticket to be short enough they’ll actually read it.These are the elements I focus on:Detailed description of the problem.Acceptance criteria. What you need to see to consider this problem resolved.Any additional info. Uploads, steps to reproduce the issue, videos showing the issue.Priority and impact. How important is the issue? Try to equate any expected impact to cash if you can.Do not waste the time of developers with menial tasks. I’ve seen lots of technical SEOs burn their bridges with dev teams by submitting tickets for lots of things that are high effort and little to no impact.Enterprise technical SEO toolsThere are a lot of tools that can help you with enterprise technical SEO including:Ahrefs’ Site Audit. It really is best-in-class. Check it out! We’re the most used cloud-based site audit tool. We crawl ~700 million pages a day.Ahrefs SEO toolbar. This has replaced practically every SEO extension for me.Google Search Console. It has several useful tools to check indexing, crawling, etc.Also check out our guide to enterprise SEO tools.Final thoughtsOne final tip is that if you don’t seem to be making progress on projects, try to sell the changes you want to make as A/B testing. Many companies want to do more testing, and you can “test” your SEO changes to see the impact they have. With a measurable impact, you can argue for a more permanent fix, but in the meantime, it’s technically fixed.If you need an external SEO agency to provide you with enterprise technical SEO services, check out our SEO agencies directory. There are over 115 agencies who provide technical SEO services for enterprise companies.If you have any tips, enterprise SEO experiences you’d like to share, or questions, let me know on X or LinkedIn. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Patrick Stox Patrick Stox is a Product Advisor, Technical SEO, & Brand Ambassador at Ahrefs. He was the lead author for the SEO chapter of the 2021 Web Almanac and a reviewer for the 2022 SEO chapter. He also co-wrote the SEO Book For Beginners by Ahrefs and was the Technical Review Editor for The Art of SEO 4th Edition. He’s an organizer for several groups including the Raleigh SEO Meetup (the most successful SEO Meetup in the US), the Beer and SEO Meetup, the Raleigh SEO Conference, runs a Technical SEO Slack group, and is a moderator for /r/TechSEO on Reddit. Keep Learning How to Speed Up Your WordPress Website in 20 Minutes Pagespeed is a confirmed Google ranking factor on desktop and mobile. Learn how to speed up your WordPress website in 11 simple steps. What is an Enterprise SEO Audit & How To Do One Enterprise SEO audits are entirely different beasts to \"regular\" audits because of all the complications that come from large sites. SEO OKRs: Driving Performance & Measuring Impact Learn how to measure the success of SEO projects, teams, and individual SEOs. Duplicate, Google Chose Different Canonical Than User. What It Is, Causes, & How to Fix How you fix it will depend on the cause. It's different for every website.",
  "headers": [
    {
      "level": "H1",
      "text": "Enterprise Sites Are Where Technical SEO Shines"
    },
    {
      "level": "H2",
      "text": "The enterprise landscape"
    },
    {
      "level": "H3",
      "text": "Working with others"
    },
    {
      "level": "H3",
      "text": "Organizational improvements"
    },
    {
      "level": "H3",
      "text": "Professional development"
    },
    {
      "level": "H2",
      "text": "Crawl Setup"
    },
    {
      "level": "H3",
      "text": "Normal crawls"
    },
    {
      "level": "H3",
      "text": "Catch issues before they launch"
    },
    {
      "level": "H3",
      "text": "Catch any issues faster with crawl sampling"
    },
    {
      "level": "H3",
      "text": "The fastest way to catch changes: always-on crawling"
    },
    {
      "level": "H2",
      "text": "Enterprise technical SEO Prioritization"
    },
    {
      "level": "H2",
      "text": "Enterprise technical SEO Projects"
    },
    {
      "level": "H3",
      "text": "Check indexing"
    },
    {
      "level": "H3",
      "text": "Recover links with link reclamation"
    },
    {
      "level": "H3",
      "text": "Add internal links"
    },
    {
      "level": "H3",
      "text": "Add schema markup"
    },
    {
      "level": "H3",
      "text": "Fix Page Experience"
    },
    {
      "level": "H3",
      "text": "General website health / maintenance"
    },
    {
      "level": "H3",
      "text": "Fix Hreflang issues"
    },
    {
      "level": "H3",
      "text": "Optimize crawl budget"
    },
    {
      "level": "H3",
      "text": "Optimize ecommerce pages"
    },
    {
      "level": "H3",
      "text": "Fix JavaScript SEO issues"
    },
    {
      "level": "H3",
      "text": "Migrate other websites"
    },
    {
      "level": "H3",
      "text": "Keep traffic during mergers and acquisitions"
    },
    {
      "level": "H3",
      "text": "Analyze log files"
    },
    {
      "level": "H3",
      "text": "Pull data from APIs"
    },
    {
      "level": "H3",
      "text": "Machine learning tasks"
    },
    {
      "level": "H2",
      "text": "Submitting Tickets"
    },
    {
      "level": "H2",
      "text": "Enterprise technical SEO tools"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Patrick Stox"
}