{
  "url": "https://ahrefs.com/blog/enterprise-seo-audit/",
  "slug": "enterprise-seo-audit",
  "title": "What is an Enterprise SEO Audit & How To Do One",
  "description": "Enterprise SEO audits are entirely different beasts to \"regular\" audits because of all the complications that come from large sites.",
  "content": "Patrick Stox Patrick Stox is a Product Advisor, Technical SEO, & Brand Ambassador at Ahrefs. He was the lead author for the SEO chapter of the 2021 Web Almanac and a reviewer for the 2022 SEO chapter. He also co-wrote the SEO Book For Beginners by Ahrefs and was the Technical Review Editor for The Art of SEO 4th Edition. He’s an organizer for several groups including the Raleigh SEO Meetup (the most successful SEO Meetup in the US), the Beer and SEO Meetup, the Raleigh SEO Conference, runs a Technical SEO Slack group, and is a moderator for /r/TechSEO on Reddit. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents An enterprise SEO audit evaluates a large enterprise website to find issues and opportunities that will improve rankings and visibility on search engines.The basics are the same as any other SEO audit. Yet, an audit like this is an entirely different beast because of all the complications that come from large sites and large companies such as:All the different systems.All the different teams working to shape the audit.All the things you might need to look at.The scale of the audits due to the size of the websites.Many common SEO tools don’t work at this scale, which is why enterprise SEO tools exist. Even data analysis can be difficult for websites of this size and common spreadsheet software may not be able to handle the scale.SEO checklists are impractical at scale. It’s a waste of time to check every little thing on every page because there’s simply no ROI in doing so, and no one is going to read your 200-page SEO audit. You really need to know what to prioritize and to ignore minor things that may technically be wrong, but fixing them won’t have any impact.Let’s look at how to do this, step by step.Contents1. Find the pain pointsTalk to your client or stakeholders to figure out what they want you to look at. Ask about any specific issues or pain points. They’re likely seeking the audit for some specific reasons, and the more you can cater your audit to their specific needs, the happier they will be.2. Segment to make it easierYou may have to segment the website in order to make the audit more manageable. That might be looking at specific pages, sections of a site, different languages or regions, or a specific CMS or JavaScript framework.Our Site Structure report in Site Explorer has a breakdown of the different sections on a website, along with many metrics you may want to look at to help you segment the audit.3. Figure out what your audit includesIf you try to audit everything, an enterprise SEO audit is going to be expensive and time-consuming. A lot of that time is likely to be wasted. Focus on what your client wants and where you believe the issues are.These audits may occur every few months or yearly and can cost 10s or 100s of thousands of dollars, so you want to focus in on what’s important to keep costs down.If they approached you because of a traffic drop and you saw that it was likely related to the Reviews Update like on the site below, then a technical SEO audit isn’t where you want to start.There are a lot of different things you could look at, which means there are different types of SEO audits you may be asked to run. When people talk about SEO audits, they’re often referring to technical SEO audits, but there are many others like content audits, link audits, local SEO audits, or competitive analysis.Here are some different types of SEO audits and resources to help you put them together.General SEO auditsFor general SEO audits, one of the first things you might want to check is our Opportunities report in Site Explorer. The report covers the highest priority items that we believe will have the most impact for most websites.It includes things like creating new content, updating existing content, writing for featured snippets, implementing redirects, adding internal links, getting external links your competitors have, finding unlinked brand mentions, and more.You can use our free SEO Audit Template for this.Alternatively, check out our post on how to do an SEO audit in 11 steps. Here are the steps:Run a crawl of your websiteIdentify organic traffic drops and work out what caused themCheck for any duplicates of your websiteFind and diagnose indexability issuesEnsure your site is mobile-friendlyBenchmark your Core Web Vitals scoresReclaim authority by fixing broken pagesEnsure your sitemap doesn’t have any issuesEnsure on-page elements conform to SEO best practicesFind declining content to reclaim rankingsFind keywords competitors rank for, but you don’tContent auditsContent audits can be extremely complex and time-consuming. Here’s our content audit process (with template). Here are some of the steps:Does the page get organic traffic?Does the page get traffic from another source?Is the page mainly for organic search?Is the page useful for another purpose?Does the page have any backlinks?Is the page crawlable and indexable?Has the page had time to be successful?Is ranking the page a priority?Could the page get more organic traffic?Is another page on your site ranking for the same targeted term(s)?Is the page unique enough to also target other terms?Is your page better than the competition?Is your page optimized well for on-page SEO?Is the page internally linked where relevant?Is the page’s link profile stronger than the competition?Are there any old deleted pages that could be redirected?Do you think the page could get more conversions?Sidenote. Our SEO WordPress plugin automates and handles many of the steps in the content audit process above.And don’t forget to check for content opportunities using our Content Gap tool.Technical SEO auditsCheck out our beginner’s guide to technical SEO. It lists many technical SEO quick wins, such as:Check indexingReclaim lost linksAdd internal linksAdd schema markupAs well as additional technical SEO projects like:Page experience signalsCore Web VitalsHTTPSMobile-friendlinessInterstitialsHreflang — For multiple languagesAnd some general maintenance / website health issues you may want to look at like broken links and redirect chains. These may not have much impact on SEO, but can be an important consideration for user experience.Make sure you set up a project in Site Audit to check your website for 160+ different issues and track the progress of your fixes.We have some great visuals in there for reporting, such as this one for Core Web Vitals.There are also some nice visualizations to help you explain issues like this first-if-its-kind hreflang cluster visualization. It shows and tells you what is broken, making it much easier to explain to stakeholders than the typical spreadsheet.One thing you might want to look into is crawl sampling. You don’t always need a full crawl of the website which can take weeks to run on an enterprise site. You just need enough to see if any important changes were made.NoteDid you know you can run Ahrefs’ Site Audit for a custom list of pages daily and get alerted to any changes? Using a sample across different templates or systems, you can find issues earlier. You don’t have to wait a week or a month between crawls.Competitor analysisDoing a competitor analysis can help identify any weaknesses you have as well as discover new opportunities. Comparing against competitors also helps get projects off the ground because no one wants to lose to their competitors.The Organic Competitors report in Site Explorer is a quick and easy starting point to identify who your competitors are in the SERPs.Check out our post on how to do an SEO competitor analysis for more steps including:Identify your SEO competitorsInvestigate how they’re getting trafficFind and cover content gapsSpy on your competitors’ featured snippetsSee where your competitors’ traffic is coming fromFind backlink gapsSpot link bait opportunitiesFind your competitors’ broken pagesCheck your competitors’ Core Web VitalsSee what keywords your competitors are bidding on in paid searchLearn from your competitors’ PPC adsLink auditIn some cases, you may want to do a link audit as well—especially if you have a history of spam or have a manual action against your website. I will caution you to be very careful with the disavow file and any “toxic” links that tools may identify, as the methodologies I’ve seen are questionable. Many people end up hurting themselves by disavowing the identified links.For more details, check out our posts on how to do a basic backlink audit and how to perform a competitor link analysis for our process. Here’s a summary:Step 1. Get a high-level view of your backlink profileSee how your backlink profile compares to the competition. You can find a more in-depth version of this in our guide: How to Perform a Competitor Link Analysis in 3 StepsLook at your backlink acquisition rate over time, and compare this to the competitionIdentify negative SEO attacks by looking for link spikesLook for a disproportionate amount of links from “spammy” CTLDsLook for indications of spam in your anchor text profileStep 2. Delve (a bit) deeperFind wasted backlinks to your siteFind the best and worst sites that link to youCheck for spam in the full “anchors” reportLook for backlinks from the same C-Class IPs (advanced)Step 3. Review the full backlinks reportStart with a web page (not the entire domain)Sort by traffic (optional)Look for commonalities between backlinksInternal link analysisInternal links can have a big impact, especially for enterprise websites where you may not be allowed to build external links.The easiest way to see internal link opportunities is with our tool in Site Audit. We look at what your pages are ranking for and suggest links from other pages on your site that talk about those things.Check out our actionable guide to internal linking for our steps including:Plan your internal linking structureLink to internal pages you care aboutLink to relevant contentHow to audit your site’s internal links for issues:Fix broken internal links to reclaim authorityFix orphan pagesIdentify opportunities for new internal linksLocal SEO auditsMost of what you need to know for local SEO is covered in our complete guide to local SEO which goes into ranking factors such as:Google Business Profile (formerly Google My Business)NAP citationsReviewsLinksOn-page4. Put together your deliverables and reportsWhat people want out of an audit for deliverables and reporting varies greatly. I recommend discussing this up front with your client or stakeholders so that you’re both on the same page.Deliverables might include a presentation, document, spreadsheets, or even tickets entered into a project management system.I highly recommend focusing on a few key issues and not a massive report of everything you looked at. I’ve seen several hundred-page documents detailing everything you checked, but no one is going to read those. I’ve found reporting on 5-10 main issues or opportunities will be better received and the changes are more likely to be implemented.I’d recommend checking out our post on SEO metrics and reporting for inspiration.You should try to equate fixes to cash. This is what businesses care about. You can say I want you to redirect these 100 pages, but it’s not going to go over as well as saying I want you to redirect these 100 pages which will recover 2,500 links which would cost $1M if we had to buy them. It may take some collaboration with the in-house team to estimate these kinds of numbers, but the extra effort means the report will be better received and you’ll be more likely to have your changes implemented.Final thoughtsIf I’ve learned anything over the years, it’s that the key to enterprise SEO is doing the basics better than anyone else. You have to put in the work.Lots of people think that big brands can rank for anything and everything, but the truth is that most big brands only rank for their own branded searches. They have a lot of opportunities to gain more visibility that they don’t act on.If you have questions, message me on X. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Patrick Stox Patrick Stox is a Product Advisor, Technical SEO, & Brand Ambassador at Ahrefs. He was the lead author for the SEO chapter of the 2021 Web Almanac and a reviewer for the 2022 SEO chapter. He also co-wrote the SEO Book For Beginners by Ahrefs and was the Technical Review Editor for The Art of SEO 4th Edition. He’s an organizer for several groups including the Raleigh SEO Meetup (the most successful SEO Meetup in the US), the Beer and SEO Meetup, the Raleigh SEO Conference, runs a Technical SEO Slack group, and is a moderator for /r/TechSEO on Reddit. Keep Learning A Simple SEO Guide for Successful Event Marketing SEO is essential to marketing any event to help people find it when they search online. Use these SEO tactics to help your events rank high. How to Avoid SEO Over-Optimization Too much of a good thing can be bad. Here's how to avoid \"over-optimizing\" your SEO efforts. Enterprise Link Building & The Power Of Links There’s so much at stake in enterprise SEO and so many opportunities. Here's how to find them. SEO OKRs: Driving Performance & Measuring Impact Learn how to measure the success of SEO projects, teams, and individual SEOs. 4 Best Facebook Groups for SEOs (Most Voted For) These are the SEO Facebook groups that received the most votes from 12,200 SEOs.",
  "headers": [
    {
      "level": "H1",
      "text": "What is an Enterprise SEO Audit & How To Do One"
    },
    {
      "level": "H2",
      "text": "1. Find the pain points"
    },
    {
      "level": "H2",
      "text": "2. Segment to make it easier"
    },
    {
      "level": "H2",
      "text": "3. Figure out what your audit includes"
    },
    {
      "level": "H3",
      "text": "General SEO audits"
    },
    {
      "level": "H3",
      "text": "Content audits"
    },
    {
      "level": "H3",
      "text": "Technical SEO audits"
    },
    {
      "level": "H3",
      "text": "Competitor analysis"
    },
    {
      "level": "H3",
      "text": "Link audit"
    },
    {
      "level": "H3",
      "text": "Internal link analysis"
    },
    {
      "level": "H3",
      "text": "Local SEO audits"
    },
    {
      "level": "H2",
      "text": "4. Put together your deliverables and reports"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Patrick Stox"
}