{
  "url": "https://ahrefs.com/blog/ethical-marketing/",
  "slug": "ethical-marketing",
  "title": "Ethical Marketing: Definition, Principles, & Examples",
  "description": "Learn what ethical marketing is, its principles, how you can benefit from it, and more in our simple guide.",
  "content": "Rebecca Liew Content marketer and writer. Addicted to words, stationery, and exploring new places on foot. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Ethical marketing is when you promote a product, service, or brand in a way that aligns with your values and morals.In this guide, we’ll explore the principles it encompasses and how you can incorporate them into your business. ContentsWhat are the principles of ethical marketing?This depends on your principles and what you define as ethical—but to get more concrete answers, we spoke with some marketers and ran polls on Ahrefs’ and my personal Twitter accounts.Here are five common themes that made our list:Honesty and transparencyBeing honest and transparent means not making misleading, inflated, or untrue claims across the whole process: production and delivery of goods and/or services, employment practices, the value proposition of your product, and more.As marketing consultant Maria Soleil puts it:The principles of ethical marketing include being responsible, honest and transparent in promotional activities, prioritizing data privacy, not engaging in pressure tactics, avoiding using UX dark patterns, using inclusive language, and more.It’s also about using suppliers, partners, and platforms that align with your morals and values. For example, I no longer use Meta to promote my business, and am exploring how to help my clients be less reliant on platforms such as Facebook and Instagram.Here’s another definition that resonated with us:Ethical marketing for me is about: ✅ Seeing customers as humans✅ Not trying to bait them into buying/trying something they don’t want✅ Not exaggerating on the value proposition✅ Not making up things that are not realIn short, not marketing for blind conversions.— Anmol Ratan Sachdeva - Smallbiz Buddy (@arsachdeva) April 12, 2022 Fairness and respectThis is again subjective. At Ahrefs, our idea of respect involves *not* running ads on our competitors’ names, whether through wordplay or otherwise.Rather, we focus on converting prospective users through our educational blog posts, YouTube videos, tweets, and more. Ethical Marketing to me: - Not belittling your competitors (name-shaming) to get customers - Not lying to a potential customer about what your product can do. - Not running ads on your competitors’ brand names.— Afeez Adebayo (@za_icon) April 12, 2022 Maintaining user privacyThis is essentially a subset of the above points: honesty/transparency and fairness/respect.For instance, Ahrefs doesn’t use cookies or tracking unless necessary. We also avoid retargeting tactics in our marketing campaigns—a reflection of our business ethics.This also feeds into why we built yep.com, a privacy-first search engine that rewards content creators with 90% of ad revenue.Here are more questions to ponder, in Jamie Indigo’s words:Is it ethical to ask candidates to do hours of free labor for an opportunity to work for you? Once someone has interacted with your campaign, website, or converted, how does your business store that data? If you’re buying data, how was it obtained?AccountabilityOpen communication and taking ownership of your mistakes are two ways of maintaining accountability.Every marketer (every person infact) knows what’s the right thing to do in a given situation- that thin line between what’s right and what’s beyond. Ethical marketing to me is staying true to that feeling.— Jubin Mehta (@jub_in) April 13, 2022 When fast-fashion behemoth Shein was plagued by accusations of unethical operational practices, the e-commerce company attempted to disprove the rumors by inviting influencers to its factories.Alas, this backfired—and only amplified Shein’s refusal to take accountability for its actions.SustainabilitySustainability means that environmental and socially responsible values are embedded in your business’s products and practices.Examples of companies that engage in this include Apple, Patagonia, Market Lane Coffee, Marou Chocolate, Freitag, and more.(We delve into these real-life examples below!) Benefits of ethical marketingEthical marketing breeds trust among potential customers.For example, Apple has focused heavily on privacy in its advertising efforts in recent years:https://www.youtube.com/watch?v=1HWUjMjaBJIAnd it seems to be working—if this recent poll by my colleague is any indication.Based on gut feeling, which of these companies do you think cares most about your data privacy?— Joshua Hardwick (@JoshuaCHardwick) September 1, 2023 But “trust” isn’t the only benefit of so-called ethical marketing. It can also lead to positive publicity and backlinks.According to Ahrefs’ Site Explorer, Apple’s Environment page has backlinks from ~4,400 referring domains (linking websites):If we head to the Backlinks report and dig deeper, we find that many of these are positive mentions of Apple in well-known publications. Here’s one from the BBC about Apple’s call to ban hazardous materials from its production lines: And here’s one from an op-ed piece in The New York Times about climate change: Bottom line? Regardless of what you think about Apple (it’s drawn flak for some of its opaque practices in recent years), its commitment to ethical marketing has built consumer trust—an immensely valuable asset in such competitive markets.More examples of ethical marketingTo give you a more well-rounded overview of what ethical marketing encompasses in practice, here are four more real-life examples. AhrefsEthical marketing at Ahrefs looks a little different than Apple’s:We tell it like it isWe never oversell the utility of our toolset. If it meant forcing a product pitch into our content, we’d rather not include it at all. Giving backIn 2022, Ahrefs’ founder Dmytro Gerasymenko launched a donation-matching initiative in a show of support for Ukraine. For any amount an Ahrefs customer donated to an approved charity in Ukraine, we extended their subscription for double of that.This resonated with many subscribers and won us organic mentions on platforms like Twitter, as well as media mentions—even though it certainly hadn’t been the aim of our donation-matching campaign.That’s how empathetic businesses inspire empathy!Praying for peace across all borders!@ahrefs#supportukraine #ukraine #ahrefs #empatheticbusiness #seopeople pic.twitter.com/XDFtKz8iRi— Amruta Nadar (@NadarAmruta) February 28, 2022 While we’re humblebragging, we also funneled $200K into sponsoring podcasts, newsletters, videos, and more in December 2021. The move generated lots of positive publicity:Whoa—I just received a mystery swag box from @ahrefs (a Why We Buy sponsor)Is blogging a bit of a mystery to you? And do ya want your own mystery box?Comment 🎁 on this postI’ll send you Ahrefs’ free Blogging for Business course & you’ll be entered to win your own swag box! pic.twitter.com/sncW4vBUVF— Katelyn Bourgoin 🧠 (@KateBour) September 7, 2022 Marou ChocolateAnother tasty addition to the list is one of Asia’s most well-loved bean-to-bar brands: Marou Chocolate. The Vietnamese-based company maintains a close eye over the entire chocolate-making process, from working with Vietnamese cacao farmers through to overseeing the production line.Such is its dedication that it publishes detailed reports on its sourcing process, how it supports small cacao producers, and more.If this isn’t transparency, we don’t know what is. Have a read—it’s fascinating stuff.Patagonia Outdoor clothing label Patagonia’s mission statement is simple:We’re in business to save our home planet. Sounds unrealistic? In fact, the brand is well regarded for keeping true to its words and is a solid example of how sustainability is embedded in ethical marketing.The brand also donates 1% of its profits to nonprofit environmental organizations under its self-imposed Earth tax.These efforts are widely cited too. Check out its backlink profile in Ahrefs’ Site Explorer:Market Lane CoffeeHow could my personal favorite not make the list?Market Lane Coffee is an Australia-based specialty coffee roaster and retailer, and I’ve always been a fan of its commitment to fairness, transparency, and sustainability.It has dedicated pages on how these values are put to practice. Wordy as these are, it gives you a better sense of how it’s walking the talk:Closing thoughtsThat rounds things up!Ethical marketing is such a complex topic that condensing things proved to be a challenge, so I’d love to hear your thoughts on Twitter. FAQsWhat is ethical marketing?Ethical marketing is when you promote a product, service, or brand in a way that aligns with your values and morals. This means not making inflated claims, practicing transparency and openness, and more.What are the principles of ethical marketing?The five key principles of ethical marketing are honesty and transparency, fairness and respect, maintaining user privacy, accountability, and sustainability. It can involve other principles too, depending on what you define as ethical.What’s the difference between ethical and sustainable marketing?The difference between ethical marketing and sustainable marketing is that ethical marketing promotes a brand’s values and morals, while sustainable marketing promotes environmental and socially responsible values. Is sustainable marketing the same as ethical marketing?No, it isn’t. Ethical marketing promotes a brand’s values and morals, while sustainability is an example of a brand value. Therefore, it is a subset of ethical marketing. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Rebecca Liew Content marketer and writer. Addicted to words, stationery, and exploring new places on foot. Keep Learning Influencer Marketing: Definition, Examples, and Tactics Influencer marketing is the practice of working with influencers to promote your brand’s message, products or services. Indirect Marketing: Definition, Types, & Examples An overview of indirect marketing. Learn what it is, its pros and cons, and see examples of companies that succeeded with it. Lead Magnets Explained: Definition, Basics & 17 Examples Lead magnets need an attractive topic and effective traffic sources. Only then can they bring visitors closer to becoming your customers. 3 Marketing Strategy Examples You Can Use to Create Your Own A marketing strategy is a business's overall game plan for reaching consumers and turning them into customers. Marketing vs. Advertising: What’s the Difference? (10 Examples) For many people, marketing is synonymous with advertising. But the truth is that advertising is only a small part of marketing.",
  "headers": [
    {
      "level": "H1",
      "text": "Ethical Marketing: Definition, Principles, & Examples"
    },
    {
      "level": "H2",
      "text": "What are the principles of ethical marketing?"
    },
    {
      "level": "H3",
      "text": "Honesty and transparency"
    },
    {
      "level": "H3",
      "text": "Fairness and respect"
    },
    {
      "level": "H3",
      "text": "Maintaining user privacy"
    },
    {
      "level": "H3",
      "text": "Accountability"
    },
    {
      "level": "H3",
      "text": "Sustainability"
    },
    {
      "level": "H2",
      "text": "Benefits of ethical marketing"
    },
    {
      "level": "H2",
      "text": "More examples of ethical marketing"
    },
    {
      "level": "H3",
      "text": "Ahrefs"
    },
    {
      "level": "H4",
      "text": "We tell it like it is"
    },
    {
      "level": "H4",
      "text": "Giving back"
    },
    {
      "level": "H3",
      "text": "Marou Chocolate"
    },
    {
      "level": "H3",
      "text": "Patagonia"
    },
    {
      "level": "H3",
      "text": "Market Lane Coffee"
    },
    {
      "level": "H2",
      "text": "Closing thoughts"
    },
    {
      "level": "H2",
      "text": "FAQs"
    },
    {
      "level": "H3",
      "text": "What is ethical marketing?"
    },
    {
      "level": "H3",
      "text": "What are the principles of ethical marketing?"
    },
    {
      "level": "H3",
      "text": "What’s the difference between ethical and sustainable marketing?"
    },
    {
      "level": "H3",
      "text": "Is sustainable marketing the same as ethical marketing?"
    }
  ],
  "author": "Rebecca Liew"
}