{
  "url": "https://ahrefs.com/blog/find-websites-keywords/",
  "slug": "find-websites-keywords",
  "title": "How to Search a Website For All Kinds of Keywords",
  "description": "You can find any website’s organic and paid keywords in a few seconds using an SEO tool.",
  "content": "Mateusz Makosiewicz Marketing researcher and educator at Ahrefs. Mateusz has over 10 years of experience in marketing gained in agencies, SaaS and hardware businesses. When not writing, he's composing music or enjoying long walks. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents To search a website for the presence of keywords, as in words or phrases in text, there are a couple of quick and easy methods:If you want to search on a particular page, hit command/ctrl + F on your keyboard and type in the words you want to look for while on the page.The best way to search an entire site is to use Google search operators. Type site:example.com “the words you’re looking for” in Google’s search bar. And if you want to search only through the page titles on that site, use site:example.com intitle:“the words you’re looking for.”To find keywords a website ranks and the keywords it targets in Google search ads, you’ll need an SEO tool. The use of an SEO tool is essential because simply having keywords on a page doesn’t guarantee they will rank in Google or be used for ad bidding.In this article, I’ll explain how to find any website’s organic and paid keywords in seconds. There’s a free method for discovering keywords on your site and a paid one for finding any other website’s keywords (including your competitors’).How to find any website’s organic keywords using keyword research toolsOrganic keywords in SEO (search engine optimization) are the search terms for which a page ranks in the non-paid search results of search engines like Google. In other words, they are the terms and phrases that the content creator targets with a given page.Here’s how to find any website’s keywords in seconds with Ahrefs’ Site Explorer. You can do it for your site completely free with Ahrefs Webmaster Tools.Enter any website’s URL. Adjust the mode to see keywords for the entire domain, a path, or the exact URL. Then hit Search.Go to the Organic keywords report. And there you have it — all the keywords the website ranks for in Google.Along with the keywords, Site Explorer will show you important SEO metrics like current position on the SERPs (search engine results pages), search volume, Keyword Difficulty (KD), and even ranking history.You can also play around with filters to refine the result. For example, you can view the keywords with low difficulty or look for a specific keyword (example below).Where to go from here? Since you’ll likely discover a lot of keywords this way, it’s a good idea to learn how to choose the best ones for your website — and we’ve got a full guide on that.Want to check a website’s keywords for competitive analysis? We’ve got a full guide on that too.How to find any website’s paid keywords (for pay-per-click advertising)Paid keywords in digital marketing are the search terms for which a page ranks in the paid search results of search engines like Google. In other words, they are the terms and phrases that website owners bid on to show ads to searchers.Here’s how you can use Site Explorer to find that type of keyword.Enter any website’s URL. Again, simply adjust the mode to see keywords for the entire domain, a path, or the exact URL.Hit search.Go to the Paid keywords report.Apart from keywords, this report shows you additional data like:The cost-per-click of the keyword (CPC).Search volume (the popularity of the keyword).The estimated traffic a page gets from a given keyword.The landing page and ad for the keyword (screenshot below).And more.Quick overview of other methods (and why they fall short)Couldn’t you just look at the text to find a page’s keywords? And doesn’t Google provide that kind of keyword data for free? Here’s a more detailed answer to why you need an SEO tool to search for organic and paid keywords.Using built-in website search features and browser functions for keyword searchBuilt-in website search feature refers to the search bars you can find on most sites. Depending on how the website owner sets it up, it searches on the entire site or part of it (the blog in the case of the example below).The second method is basically hitting cmd/ctrl+F on any web page, app, or online document such as pdf. This method is restricted only to the page you’re currently at.These methods can be used to look up certain words or phrases, but you’ll never know if that website ranks for the keywords until you use an SEO tool to check rankings.In other words, the fact that a page includes a certain word doesn’t make this word a keyword in the SEO sense.What’s more, a page might rank for keywords that are not used verbatim on the page. For instance, this article ranks #3 for “how to find the keywords of a website”, which isn’t used anywhere else on the page.Using Google’s search operatorsGoogle advanced search operators are special commands and characters that filter search results.This technique will show you pages indexed in Google that contain the phrase you’re looking for verbatim, exactly how you typed it.However, just because a page appears in search results when using operators doesn’t mean it will rank the same way under normal search conditions, which is how most people use Google.You can look at it this way: to check a website’s keywords this way, you would have to look up pretty much every word in the text, and still you wouldn’t know the rankings or any SEO data related to the keyword.TipSearch operators can be used for SEO for other reasons, such as finding competing websites or link building prospects. Still, this method doesn’t give the best results compared to an SEO tool because unlike SEO tools, Google search doesn’t give you access to any of the SEO data.In this guide we’ve listed some of the ways you can use this functionality from Google and its more advanced alternatives.Using a page’s HTML codeAn old method for finding keywords was to view a page’s HTML code and look at these two parts of the code:<meta name=“keywords”> – This is where SEOs used to put their keywords back in the day to tell Google what the page is about (and hopefully rank for those terms). Hardly anybody uses that now, so you won’t find much information there.<title> – This determines the title of the page. This can be a hint as to what the page’s target keyword is as intended by the page’s creator. This means that a) the page may not rank for the keyword in the first 100 SERP results, and b) you can see only one organic keyword (without any SEO data) one page at a time.Using Google Keyword PlannerAnother method mentioned by some other guides is to use Google Keyword Planner. This solution is better but still not accurate.GKP will show you a mix of keyword ideas based on a page’s URL, where you will find:Some organic keywords that the page ranks for, but you won’t know which. And you will likely get overestimated search volumes for whole groups of keywords instead of just one (learn more in our study).Topically relevant keywords that Google suggests you could run ads for. So not organic keywords a page actually ranks for.Using Google Search ConsoleGoogle Search Console is a free tool from Google designed to help you “measure your site’s search traffic and performance, fix issues, and make your site shine in Google Search results”.You can use it to check keywords but only on the sites you own (so no competitor analysis). To do this, set up an account and go to the Performance report.This tool has some other limitations you need to be aware of. The Search Console shows only up to 1k keywords at a time (so you won’t see all the keywords you rank for), and the data is limited to 16 months (so it’s harder to keep track of performance). To bypass those limitations, you can use the free Ahrefs Webmaster Tools.FAQFrequently asked questions about keywords.What is keyword research, and why is it important?Keyword research is the process of discovering valuable search queries that your target customers type into search engines like Google to look for products, services, and information.Keyword research is important for SEO and content strategy for several reasons.Most importantly, it helps content creators understand how users search online by identifying popular words and phrases entered into search engines, giving insights into their intent. So instead of guessing what your target audience might search for, you can create content based on actual search queries.Effective keyword research also helps you evaluate the competition by looking at metrics like keyword difficulty and identifying domains already competing for specific keywords.What is keyword difficulty?Keyword difficulty is an SEO metric that estimates how hard it would be to rank on the first page of Google for a given keyword.At Ahrefs, we measure it on a scale from 0 to 100 (the hardest), and it’s based on the estimated number of websites that link to the top 10 ranking pages. The more domains link to the top 10 pages, the more backlinks you’ll need to get to rank.That’s the basics. To estimate your chances of ranking more accurately, you’ll need to consider a couple more factors, such as your website’s authority and ability to match search intent.Learn more about the topic in Keyword Difficulty: How to Estimate Your Chances to Rank.How to find good keywords for SEO?There are a few methods for that:Look up your competitors’ keywords — you can then try to rank for the same keywords or use them to find similar keywords.Use keyword research tools — keyword research tools uncover hundreds of keyword ideas, along with their SEO metrics, based on just one word or phrase.Study what topics resonate with your audience — this way, you can discover untapped keywords, topics that you didn’t know about, or topics that are just beginning to trend.Learn how to use each method in Keyword Research: The Beginner’s Guide by Ahrefs.How do I use keywords on my website?Choose one target keyword per page — this will be the topic of the page. You will still be able to rank for many other relevant keywords (no need for keyword stuffing). Then craft your content with these SEO good practices in mind:Be relevant by aligning your content with search intent (content type, format, and angle).Be thorough by including common subtopics searchers expect to see.Include the keyword in the title. Learn more about targeting keywords with content in On-Page SEO: The Beginner’s Guide.Can I use AI in keyword research?You can use AI tools like ChatGPT for keyword research, but only to some extent.AI chatbots are great for generating some keyword ideas, but the tools themselves won’t tell you if a page actually ranks for a keyword or the search volume of any given keyword. To get access to that SEO data, you need to use AI in pair with SEO tools.For example, in the screenshots below, you can see how the AI keyword suggestions feature in Ahrefs’ Keywords Explorer was used to generate seed keywords and find thousands of related keywords with their SEO data (including high-traffic keywords and long-tail keywords).Is keyword data source and accuracy important for finding keywords?Yes, and here’s why:SEO tools with large and fresh keyword indexes can find more keywords and show the most up-to-date metrics. This allows you to discover more keyword opportunities and assess them using high-quality data. You should also consider the keyword index size in the country you want to rank in, as it can typically vary. For reference, here’s Ahfefs’ keyword index size in all countries.Accurate data means less room for mistakes in your SEO and content strategy. If the tool underestimates search volume, you can miss out on some considerable organic traffic. And if it’s the other way around, you risk wasting resources on keywords with low traffic potential and setting too high expectations in content planning. That said, accuracy is a nuanced topic, and something like an ideally accurate search volume may not even exist.Keep learningInterested in learning more about SEO and keywords? Try our other guides:Further readingThe Beginner’s Guide to SEOHow to Find Low-Competition Keywords for SEOAdvanced Keyword Research: 5 Tips for Finding Untapped KeywordsGot questions? Ping me on X or LinkedIn. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Mateusz Makosiewicz Marketing researcher and educator at Ahrefs. Mateusz has over 10 years of experience in marketing gained in agencies, SaaS and hardware businesses. When not writing, he's composing music or enjoying long walks. Keep Learning Branded Search vs. Non-Branded Search: What’s the Difference? SEO isn't always about attracting strangers to a site. Some look specifically for certain brands/products. Here's how to prepare for that. Long-tail Keywords: What They Are and How to Get Search Traffic From Them Long-tail keywords are search queries that get a small number of searches per month. They tend to be longer and more specific than head keywords. How to Target Keywords With Blog Posts (& Get More Search Traffic) Learn the three-step process on how to target keywords using blog posts. Keyword Search Volume: 5 Things You Need to Know to Avoid SEO Mistakes Search volume is frequently used in SEO. But taking it at face value can lead to poor marketing decisions. Search Intent in SEO: What It Is & How to Optimize for It Search intent is the reason behind a search query. To rank well, creating content that aligns with search intent is critical. Learn how.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Search a Website For All Kinds of Keywords"
    },
    {
      "level": "H2",
      "text": "How to find any website’s organic keywords using keyword research tools"
    },
    {
      "level": "H2",
      "text": "How to find any website’s paid keywords (for pay-per-click advertising)"
    },
    {
      "level": "H2",
      "text": "Quick overview of other methods (and why they fall short)"
    },
    {
      "level": "H3",
      "text": "Using built-in website search features and browser functions for keyword search"
    },
    {
      "level": "H3",
      "text": "Using Google’s search operators"
    },
    {
      "level": "H3",
      "text": "Using a page’s HTML code"
    },
    {
      "level": "H3",
      "text": "Using Google Keyword Planner"
    },
    {
      "level": "H3",
      "text": "Using Google Search Console"
    },
    {
      "level": "H2",
      "text": "FAQ"
    },
    {
      "level": "H3",
      "text": "What is keyword research, and why is it important?"
    },
    {
      "level": "H3",
      "text": "What is keyword difficulty?"
    },
    {
      "level": "H3",
      "text": "How to find good keywords for SEO?"
    },
    {
      "level": "H3",
      "text": "How do I use keywords on my website?"
    },
    {
      "level": "H3",
      "text": "Can I use AI in keyword research?"
    },
    {
      "level": "H3",
      "text": "Is keyword data source and accuracy important for finding keywords?"
    },
    {
      "level": "H2",
      "text": "Keep learning"
    }
  ],
  "author": "Mateusz Makosiewicz"
}