{
  "url": "https://ahrefs.com/blog/free-seo-audit-tools/",
  "slug": "free-seo-audit-tools",
  "title": "The Only 2 Free SEO Audit Tools You Need",
  "description": "Can you do an SEO audit with free tools? We think you can do a pretty good one using just two.",
  "content": "Mateusz Makosiewicz Marketing researcher and educator at Ahrefs. Mateusz has over 10 years of experience in marketing gained in agencies, SaaS and hardware businesses. When not writing, he's composing music or enjoying long walks. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents An SEO audit is where you find opportunities to improve a site’s search performance.To find all of these opportunities, you need to look in different places: content, links, technical issues, and more.This is something Google Search Console and Ahrefs Webmaster Tools are designed for. And if you use both of them for what they are best at, you can do a comprehensive SEO audit without spending a dime on tools. Let’s do a quick overview of them.Contents1. Google Search Console Google Search Console (GSC) is a unique and probably irreplaceable tool in any SEO toolbox because it offers the most accurate data when it comes to Google’s search-related products, e.g., organic traffic data, click-through rates, index coverage, etc.If you don’t already have GSC set up, all you need to do is sign in with your Google account, verify the ownership of the site you want to audit, and wait for the data to come in. By the way, we also recommend submitting a sitemap via GSC as soon as possible (this helps Google discover and index your pages quicker).GSC allows you to monitor the entire website (left) or just parts of it (right).How it helpsHere’s a list of SEO checks best done with GSC.Checking organic traffic (from Google) Arguably the most common use case for GSC and one of the reasons why it’s unique—getting organic traffic, impressions, and click-through rates straight from Google. With the Performance tools in GSC, you can check for things like click trends over longer periods (up to 16 months) or pages with high rankings but low click-through rates. Checking for manual actions When Google thinks a page or an entire website is trying to manipulate search rankings, it can issue a so-called manual action. This can result in lower rankings or even exclusion from Google’s index. Google uses GSC to communicate an eventual manual action. If your website has one, you will find it there, along with directions on how to fix the problem. Checking for crawlability issuesCrawlability is a search engine’s ability to access content on a page. If a page can’t be accessed by Googlebot, searchers won’t find it on the SERPs. The Crawl Stats report in GSC is helpful for detecting potential problems with crawling your website by Google. For instance, server 5XX errors, page timeouts, or unavailable robots.txt files.Google recommends this report for advanced users with sites bigger than 1,000 pages. However, pretty much every potential error here, including sudden drops in crawl rate, can also affect smaller sites. Making sure your website is mobile-friendly Mobile-friendliness is part of Google’s Page Experience signals (has an impact on rankings). Google doesn’t want to rank high pages that are slow or hard to navigate on mobile devices, as too many people surf the web and look for local businesses using their phones (stats from Google). GSC automatically monitors your entire website for mobile usability. If there’s any action needed, you’ll see what needs fixing and where. Core Web Vitals Another part of the Page Experience signals. Core Web Vitals (CWV) is a set of metrics for a page’s load time, interactivity, and stability of the content as it loads.You can also have CWV set up in Ahrefs Webmaster Tools. And in case the CWV report shows a “not enough data” message, you can look at Ahrefs’ page speed metrics to spot slow pages. All the above reports are sitewide. But if at any point you want to audit just one page from your website, you can use the URL Inspection tool. 2. Ahrefs Webmaster Tools Ahrefs Webmaster Tools (AWT) is a tool that monitors the SEO health and SEO performance of your website. Compared to GSC, it monitors more SEO issues (explains how to fix them too) and offers more data on backlinks and keywords. You can think of it as a tool that fills the gaps of GSC. To set up AWT, create a free account. Then add and verify your websites so that the tool can start to crawl them. You will be able to use your GSC account to verify if you like. Sidenote. AWT is free for an unlimited number of verified projects, up to 5,000 pages in total. If you need more, consider a premium Ahrefs subscription with access to additional SEO tools.How it helps The tool consists of three main tools: Dashboard, Site Explorer, and Site Audit. Most of your SEO audit will be done in Site Audit and some in Site Explorer. Let’s look at some details. Site Audit (for technical and on-page SEO issues)If you know what types of SEO issues you’re looking for after the crawl is done, you can head straight to the All issues report in Site Audit. You can edit the importance of the issues and use “Importance” as the filter.For each issue, you can view details with tips on how to fix it. Otherwise, you may want to start auditing with the Indexability report. It’s a fundamental report because, without indexing, pages are invisible to search engines and can’t bring in any search traffic. If there are any canonicalization issues or misplaced “noindex” tags, this report will let you know. Click on the category of issues to view affected pages.In the Internal pages report, you will be able to spot any broken pages with 4XX or 5XX response codes. For instance, non-existing pages with the 404 code. Then you can view the number of referring domains to those pages by adding a column to the report. This report allows you also to spot pages that are using HTTP protocol instead of HTTPS. (HTTPS is a small ranking signal, as part of the Page Experience signals.) On the left, we can see the distribution of pages with errors. On the right, we can see the distribution of pages with HTTPS and HTTP protocols.Any issues with links on your website will be shown in the Links report. For instance, orphan pages, dead-end pages, or pages with links to broken external pages. Click on the corresponding card to see all broken internal or external pages. Graphs offer an at-a-glance overview of link distribution.For low-hanging, on-page optimization opportunities, go to the Content report. Some issues may directly hinder your ability to rank, such as title tag issues.The reports mentioned above are examples of 13 predefined reports available in AWT. You may find other reports helpful too, such as reports made for images, localization issues, or a special cluster report showing sets of pages with duplicate content. What’s more, you can create your own reports with four Site Audit tools: Page ExplorerLink ExplorerInternal Link Opportunities Structure ExplorerOnce you’re done with fixing issues reported in Site Audit, you can schedule regular site crawls. AWT will email you when the crawl is done so you can check for improvements, new issues, or just the general SEO health score. The tool will also keep a history of site crawls for three months. Site Explorer (for checking keywords, traffic, and backlinks)Unlike GSC, AWT has no limits on the number of reported organic keywords and backlinks. With the Organic keywords report, you can see keywords where you already rank. And based on provided SEO metrics—e.g., position, Keyword Difficulty (KD), volume—you can identify content that could need an update or an opportunity to take over a featured snippet. To see low-hanging featured snippet opportunities, you can use these filters in the Organic keywords report.With the Backlinks report, you can see all backlinks pointing from specific pages (GSC shows just domains) to your website. The data comes with some handy SEO metrics, such as Domain Rating (DR) and organic traffic to the page. (You can also sort and filter through those metrics.) Some other things you can do with AWT for your audit:See how fast you’re acquiring backlinks and keywords Assess the quality of your backlinks See which pages have a chance of moving from the second to the first SERPDiscover traffic drops that coincided with Google’s core updates Look past GSC’s 16-month organic traffic limit Spot negative SEO attacks (through spammy anchors or sudden spikes in referring domains)Use SEO data to evaluate your website’s worthFinal thoughts SEO audits can be overwhelming, so it’s good to start with a game plan. We recommend our SEO audit checklist, where we’ve pinpointed 14 places you should look for impactful SEO issues. You will be able to do 13 of the 14 points with just GSC and AWT. Feel free to play around with both tools and come up with your own game plan. You can learn more about the tools in the following: How to Use Google Search Console to Improve SEO (Beginner’s Guide)GSC Getting Started Guide AWT Overview VideoGot questions? Ping me on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Mateusz Makosiewicz Marketing researcher and educator at Ahrefs. Mateusz has over 10 years of experience in marketing gained in agencies, SaaS and hardware businesses. When not writing, he's composing music or enjoying long walks. Keep Learning How to Do a Basic Website Audit to Improve SEO and UX (in 10 Steps) Audit your website for SEO performance issues, things that may be costing you conversions, and user-experience issues that could be confusing visitors. Free SEO Audit Template (With Video Walkthrough) 100% free to download in multiple formats (Docs, Sheets, Excel, Word, PDF). Covers technical, content, and link optimization for a comprehensive SEO audit. Free Website Audit Checklist (With Video Walkthrough) Follow our website audit checklist to discover the critical issues you need to fix. We’ve cut out the fluff to focus on issues that matter. 34 Free SEO Tools for DIY SEOs Looking for free SEO tools? These are the 36 that you need. SEO Monitoring Explained: Best Free Tools to Get Started SEO monitoring helps ensure your website stays away from major technical issues and requires just two free tools to get started.",
  "headers": [
    {
      "level": "H1",
      "text": "The Only 2 Free SEO Audit Tools You Need"
    },
    {
      "level": "H2",
      "text": "1. Google Search Console"
    },
    {
      "level": "H3",
      "text": "How it helps"
    },
    {
      "level": "H4",
      "text": "Checking organic traffic (from Google)"
    },
    {
      "level": "H4",
      "text": "Checking for manual actions"
    },
    {
      "level": "H4",
      "text": "Checking for crawlability issues"
    },
    {
      "level": "H4",
      "text": "Making sure your website is mobile-friendly"
    },
    {
      "level": "H4",
      "text": "Core Web Vitals"
    },
    {
      "level": "H2",
      "text": "2. Ahrefs Webmaster Tools"
    },
    {
      "level": "H3",
      "text": "How it helps"
    },
    {
      "level": "H4",
      "text": "Site Audit (for technical and on-page SEO issues)"
    },
    {
      "level": "H4",
      "text": "Site Explorer (for checking keywords, traffic, and backlinks)"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Mateusz Makosiewicz"
}