{
  "url": "https://ahrefs.com/blog/get-traffic-from-pinterest/",
  "slug": "get-traffic-from-pinterest",
  "title": "Can You Get Good Traffic From Pinterest to Your Blog in Just 1 Month? [Case Study]",
  "description": "Is is possible to get a decent amount of traffic from Pinterest in a short run? Let's find out. [A case study by Ahrefs]",
  "content": "Nick Churick Nick is one of our Product Marketers and coincidentally he's also a pretty skilled writer. So there you have it - he's now a regular contributor to our blog. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Have you seen the guides and studies that promise a massive amount of traffic from Pinterest to any website? Inspired, I decided to get some traffic from Pinterest to Ahrefs blog. Yet, there was a tiny problem… I knew nothing about Pinterest marketing. So I asked Google “How can I get traffic from Pinterest?”Google returned about 41,400,000 results in 0.77 seconds, and I started learning. I even went to page 2 and 3 of search results!The very first lesson learnt was that there weren’t much fresh authoritative guides or studies. The best part dated back to 2014 and 2015 when Pinterest was a bit different.The second lesson learnt was that tips and tricks to drive traffic from Pinterest show little to zero variety. In fact, having filtered off some nonsense tips (as per my personal gut feeling) and very specific tactics (like the ones for e-commerce stores) I came up with a list of 8 action points:Sign up for a business account on Pinterest.Set up relevant boards with keywords in mind and fill them with cool pins.Apply for Rich Pins for your website or blog.Grow your Pinterest following.Get to the relevant group boards.Use catchy, engaging images.Pin consistently. Pin a lot.Show your best pins to the top Pinterest users in your niche.The plan was ready, and I decided to follow it for 1 month and then analyse the results.So let me show you what I did, how I did it, and what we got in the end.NOTE At the time we started our experiment, our Pinterest account was not brand new. We had a few hundreds of followers already, some boards were in place and we pinned some stuff occasionally. But we never took it seriously, and Pinterest, in return, had never been bringing Ahrefs any noticeable traffic. 1. Sign up for a business account on PinterestNearly every single Pinterest guide started with this tip.Turned out, Personal and Business accounts had different terms of service. Commercial use of Pinterest is only allowed for Business account. Plus Rich pins, promoted pins, and access to Pinterest Analytics are only available for Business accounts.Also, there were Buyable pins, but those only apply for BigCommerce, Demandware and Shopify platforms.Converting to business account or creating a new one is totally free. Confirm your websiteNext you have to confirm your website, so that you can see who is visiting it from Pinterest.Get a “Save” button for your website (skipped)The default final step in setting a Pinterest business account is to add a “Save” button to your website.This can easily be arranged with Pinterest Widget Builder.However, for the sake of the experiment integrity, I skipped this step.You see, we were not going to push our existing audience to Pinterest and back. We aimed for the brand new visitors from Pinterest, resulting from our Pinterest marketing efforts.Besides, Pinterest power users do not need a “Pin” button on a blog, as they’re using browser extensions and tools like Buffer to pin even the unpinnable.Now Ahrefs had a Business account on Pinterest and I moved on.2. Set up relevant boards with keywords in mind and fill them with cool pinsThe next thing learnt from Pinterest guides was that you have to optimize your account for Pinterest search.They say that Pinterest search is quite dumb not as smart as Google, so you can do some careful keyword stuffing.Keywords can be used in the names of your boards, in boards descriptions, in pin descriptions and even inside your Business Name.Our target audience included SEO experts and professional link builders, content marketers, and, you know, all kinds of marketers and bloggers. So I sat back and wrote a list of keywords that could help us.Based on it, Ahrefs Pinterest account got such boards as:Online Marketing ToolsContent Marketing TipsGrowth HackingEmail MarketingSEOSocial Media MarketingSearch Traffic & KeywordsLink Buildingand other similar ones…In general, 20 boards have been added and filled with 30 to 150 awesome relevant pins from various resources.That’s what the Pinterest guides taught me. And it seemed quite reasoned. That way we let Pinterest know our account is all about online marketing and blogging, and hoped to be found on Pinterest search.The boards I had created were meant for pinning other’s content, while ‘Ahrefs Blog’ and ‘Ahrefs - Best Posts’ boards were entirely for our own content.Every board got its keyword-based description. I wanted them to be more or less natural so I did almost no keyword stuffing there.Flourish your boards with cover imagesSeeking for some inspiration for the boards, I came across Blogelina’s Pinterest account where every board had its cover image. I really liked that idea and I decided to add the same.And here I’ve got an experience-based tip for you:As you add an image and make it a board cover, it will be added as the latest pin in the board as well. So the board preview is going to be like this: Pinterest does not allow you to easily permutate your pins within your board. To do that you can move certain pins to another board and then back, to make them appear in top inside. But for some reason it did not work with a cover.So just add a few NEW pins to the board after you add a board cover. That will do the trick. Show off in your ShowcaseNot so long ago Showcase feature was added by Pinterest. That rotating showcase is the first thing people see as they visit your profile, as it sits right at the top. Besides, it looks great on mobile.Sure thing, I could not leave the showcase blank and added our best boards there.Yet there were more preparations to do.3. Apply for Rich Pins for your website or blogAnother must-do for a seamless integration between your blog or website and your Pinterest account is to go for Rich Pins.As I told you before, we did not add “Pin” button on our blog. But our readers still pin our blog posts with browser extensions. So I had to make sure those pins would look as good as possible.Rich Pins are special pins that include extra information right on the Pin itself. Today Pinterest has 6 types of Rich Pins: app, movie, recipe, article, product and place.Naturally, article Rich Pins was our option.Article Pins let users know that they’re clicking on a page with original content that tells a story. They include an article headline, author and story description.With Rich Pins set up, Pinterest is able to pull all this data from your website via Open Graph and Schema.org formats for marking up.I consulted on our developer and he said that Open Graph was better for us. So I asked him to make the following ‘meta properties’ to be added to every blog post automatically and he made it in just a few minutes.Our solution was a bit custom. Otherwise Yoast SEO plugin for WordPress would be just enough for that.The last step was to make sure Rich Pins work just fine. Pinterest has a Rich Pins Validator, so you can easily verify your Rich Pins.Perfect!Now whenever somone pinned an article from Ahrefs blog, Pinterest took all the necessary data from the post directly and put it into the pin.Now I had to implement another important item on my plan.4. Grow your Pinterest followingSome case studies I read (this one for example) said that the number of followers on Pinterest does not directly affect the amount of traffic you will get. But to make your profile look established, Pinterest guides recommended getting at least one thousand followers.The principle was simple. Follow other Pinterest accounts to get attention to yours. There were two options for that. We could either use some automated software to follow and unfollow other Pinterest accounts or do that manually.Some guides recommended using a Pinterest automation tool to get more followers, like PinPinterest or PinFollow. Other authors strictly forbid automatic following/unfollowing, providing examples how they lost their accounts because of that.I did not want to risk our Pinterest account, so I went for a manual way. Every day I spent an hour or so trying to grow our Pinterest followers count. Each day I followed around 300 accounts (and unfollowed approximately the same number to keep the balance). Not the most exciting activity, I must say……and this did not work. We only got 400 new followers by the end of my experiment.But as I was reading about ways to get new Pinterest followers, I came across one nice tip. It will help you find people who pinned some content from your website, and thus interesting to connect with.Find people who pinned stuff from your websiteI found this tip in Aaron Lee’s post at Postplanner. It helped me connect with some Ahrefs fans, who have strong Pinterest profiles (more about this down the post).Put the following line into your browser and replace “YOURDOMAIN” at the end with your domain.https://www.pinterest.com/source/YOURDOMAINThere was another crucial item on my list.5. Get to the relevant group boardsThis tip was positioned as a gold mine of traffic in each and every Pinterest guide. Group boards were supposed to be the fastest way to gain reach on Pinterest.In a nutshell, a group board is a Pinterest board where more than one person can pin. And the best part is that every pinner adds his or her own followers to the total number of board’s following. This results in a massive audience of a group board, making it extremely tempting to join.You can create your own group boards and invite people to contribute to it. Click “Edit” on any of your boards and add collaborators.Each and every guide to getting traffic from Pinterest insisted on joining huge, established group boards and pin your stuff there (we’ll get to that).Naturally, you need to find those group boards first. Luckily, there are two services to help you with that: PinGroupie and group boards on BoardBooster.Finding group boards is a pretty straightforward process. But choosing a right category might be challenging. For example online marketing boards are mostly categorized as “Technology,” “Geek” or “Other” by Pinterest users. Probably because all other categories suite even less.Discovering an email address and asking to join a group board is a matter of your outreach skills.By the end of my experiment, Ahrefs’ pinterest profile has joined 33 relevant group boards of different size. The largest one had 30k followers. Did it help us? All in due time…I was almost ready to pin the content from Ahrefs blog, but I was still missing the strongest part of all pins. Visual.6. Use catchy, engaging imagesPinterest is all about visuals. Your pins need images that would stand out from thousands of other pins and draw people’s attention as a bloody magnet. That’s what I read in the guides. Actually, that made sense.If you haven’t noticed yet, we’ve got a really custom approach to the images in our blog post headers.And our readers seem to love them! Or at least that’s what they tell us.We decided not to reinvent a wheel, and went for what already worked great. We asked our designer to adapt the images created for our best blog posts for Pinterest so that we could use them when pinning.Here’s one example:If you ask me, that looked great! Besides, this image was meant to stand out from countless boring pins, consisting of a free stock background image and some text added in Canva.Finally it was time to pin!7. Pin consistently. Pin a lotEvery single Pinterest guide I read told me I should pin regularly and pin a lot. But almost nobody took it upon oneself to say how many pins should appear each day.Gael Breton in the comments to Jim Dillon’s Pinterest marketing tips recommended pinning to every group board twice a day.Kevan Lee in his Pinterest tips study, based on Buffer’s experience, said they pinned 5 to 10 times a day.And Courtney Seiter claims that up to 30 pins per day work well.I started with 7 pins per day but quickly accelerated to 30-35.This time I used the best known Pinterest automation tool, Tailwind.Pin it all with TailwindI don’t praise marketing tools often, but Tailwind is really good. For just $15 per month (or $9.99 if billed annually) you get access to an instrument that will schedule your pinning and analyse your board performance on Pinterest.As you connect your Pinterest account to Tailwind, you can manage your pinning schedule.An awesome part of Tailwind is its ability to analyze your pins performance and suggest you the most optimal times to pin.To use Tailwind at its full, you will need Tailwind Publisher extension for Chrome or Firefox. It makes the process of scheduling pins easy as a pie.I won’t talk about this undoubtedly great app for too long. There are more than enough Tailwind guides. Take this one for example.But one thing I absolutely loved about Tailwind was “Shuffle Queue” button. It’s really helpful. You don’t have to spend time moving pins in your schedule so that your pinning sequence looks natural. Just schedule a pile of pins to the relevant boards boards and shuffle them.I used Tailwind for 1 month. During this month Tailwind and I published approximately 900 pins. That does not mean these were 900 unique pins. Of course not. I scheduled one pin to all the relevant group boards. That’s where “Shuffle Queue” feature came in handy.And I did not only pin content from Ahrefs blog. Although it was a bigger part of my pinning schedule.8. Show your best pins to the top Pinterest users in your nicheThis tip was not widely covered across many Pinterest guides. But I had high hopes for it, as we do a lot of outreach here at Ahrefs.I was not going to ask to share our pins or something. All I asked for in my outreach was to check out our board with the best pins and give us some honest feedback.Here’s one of the letters I sent:And one of the insightful answers:I sent around 130 emails during my experiment.The main thing I learnt was that people on Pinterest were really nice and friendly. I had a lot of pleasant conversations and got a bunch of compliments about the style of our pins. Besides, I earned some saves for our best pins.That outreach also gave me a few important takeaways about Pinterest marketing in general and brought up some amazing examples of Pinterest success. I’ll share them with you further on.ResultsLooks like I followed all the major recommendations found in different guides to getting traffic from Pinterest. It’s time to see how it worked.I started my experiment on 06 Jan 2017 and finished it on 06 Feb 2017. Here are the stats from Pinterest Analytics.Pinterest ProfileDaily impressionsAt peak, daily impressions have been doubled from 2,000 to over 4,000 per day.Daily SavesAt the best days we were getting 3 times more saves than at the beginning. With a strange drop after 25 Jan.Clicks Clicks trebled as well.Our websitePeople reachedA steady expected growth.Views for pins from Ahrefs blogSavesAnd finally the most important stats: Visits to Ahrefs blog from Pinterest.Not too impressive, I must say. Just about 25 per day at peaks.What does Google Analytics show?Traffic growth to Ahrefs blog from Pinterest during my experiment is undeniable. But overall, it is negligible for a website like ours with over 1M visits per month.However the ROI of Pinterest marketing for a new website with little to no traffic would probably be considerably higher.As you see, this did not work so great for us.But…Should this stop you?My experiment wasn’t a sucess. But from it and from my outreach I learnt a few important things about Pinterest.1. Don’t overcomplicate your images.I got really great feedback about our images. They do stand out from myriads of other pins, but I’ve seen tons of free stock images with the text over them gathering thousands of saves. So probably the images in pins were not that much important in the end.Unless it’s an infographic. Infographics work just great for Pinterest. Here’s one I came across recently.https://www.pinterest.com/pin/59039445091761959It’s a long visualized SEO checklist from LeapFroggr by Dennis Seymour. Today this pin has almost 15k saves!I reached out to Dennis to ask about the traffic they get from Pinterest and how they got so many saves. To my surprise they did almost nothing. The pin did well on its own.Dennis told me that their single pin brings in 20-50 sessions per day organically. It sometimes bumps up to 300/day.Not bad.2. Your readers can boost your traffic from PinterestWe did not add a “Save” button to our blog, as I mentioned before. So the only way for our readers to pin our blog posts was to pin images from it (if they had a Pinterest browser extension or similar installed).Steve Scott, a personal development expert, shared a cool tip with me. He uses it at his blog, developgoodhabits.comHe puts a long (Pinterest-optimized) pinnable branded image at the end of every blog post, asking folks to share it.This tactic helps them generate 500 to 1,000 visitors a day from Pinterest alone.Quick question: What if we apply something similar on our blog?I know many of you people enjoy the custom images we usually add to the header of our blog posts. So would you pin their Pinterest-friendly versions if we put them at the bottom?Let us know in comments please. 3. It takes time and consistency to get resultsMy experiment lasted for 1 month only. But from my outreach I’ve learnt that it takes much more than 1 month today to see good results.As I was studying Pinterest guides, I came across this one from Brandon Gaille, the host of one of the most downloaded marketing podcasts in the world, The Blog Millionaire.The guide said that Brandon made Pinterest bring him 4k daily visitors from Pinterest!His guide was 1 year old, so I decided to reach out and ask about any updates or changes over the past year.I’ll just leave a screenshot of his answer here, with no comments.4. Today it’s way harder to start getting traffic from PinterestWhy?Because everyone is trying to do that. What’s worse, some use shady tactics, especially for affiliate marketing.For instance, do you ever read Pinterest notifications in your profile? I bet you don’t. There’s so much rubbish there.Let me show you where this rubbish comes from. Here’s an interesting guide I found at WarriorForum:That’s the way some people get traffic from Pinterest. 25 to 50 accounts, gosh!5. SEO is not the most visual nicheSEO is about stats, numbers and graphs. So I’d say it’s not something visually entertaining.We’ve seen many examples in different case studies and in many marketing groups on Facebook where Pinterest drove enormous traffic in more visual niches. These include cooking, travelling, and, sure thing, fashion blogs.Here’s a perfect example.Handmade Charlotte website is a goldmine of DIY projects, crafts, recipes, and design inspiration.According to SimilarWeb data, it gets around 132K visitors per month. One third comes from social channels. And 92% of social traffic comes from Pinterest.That’s around 40K visitors per month.6. There’re also Pinterest Ads that I haven’t triedI have not tested Pinterest Ads. We’re quite OK with Facebook here at the moment.But I recently came upon a Pinterest success story of Dot & Bo. After they started using Promoted Pins, the average daily clicks to their site have increased by 18000%.I wonder if you tried Pinterest Ads. Did it work for you?Over to youThat was my experience with Pinterest so far. And that was quite insightful. I’d like to go on with Pinterest and find out what will work over time.And what is your experience with Pinterest, as a source of traffic? And what did I do wrong in my experiment?Please share your thoughts in comments!P.S.Can I ask you a favor?Let’s make another experiment to see if you, as our reader, are willing to pin our posts.Here are 2 pinnable images to choose from. So… please pin 😉 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Nick Churick Nick is one of our Product Marketers and coincidentally he's also a pretty skilled writer. So there you have it - he's now a regular contributor to our blog. Keep Learning Do Links From Pages With Traffic Help You Rank Higher? [Ahrefs Study] Links are important for SEO. But what makes a good link? Should you aim to get links from pages with traffic, or does that not matter so much? 96.55% of Content Gets No Traffic From Google. Here’s How to Be in the Other 3.45% [New Research for 2023] We studied around 14 billion webpages and found that 96.55% of them get no traffic from Google. Read this post to learn how to be in the other 3.45%. How Accurate Are the Search Traffic Estimations in Ahrefs? (New Research) To answer this question, we ran a small study to quantify the accuracy of our search traffic numbers.",
  "headers": [
    {
      "level": "H1",
      "text": "Can You Get Good Traffic From Pinterest to Your Blog in a Short Run? [Case Study]"
    },
    {
      "level": "H2",
      "text": "1. Sign up for a business account on Pinterest"
    },
    {
      "level": "H3",
      "text": "Confirm your website"
    },
    {
      "level": "H3",
      "text": "Get a “Save” button for your website (skipped)"
    },
    {
      "level": "H2",
      "text": "2. Set up relevant boards with keywords in mind and fill them with cool pins"
    },
    {
      "level": "H3",
      "text": "Flourish your boards with cover images"
    },
    {
      "level": "H3",
      "text": "Show off in your Showcase"
    },
    {
      "level": "H2",
      "text": "3. Apply for Rich Pins for your website or blog"
    },
    {
      "level": "H2",
      "text": "4. Grow your Pinterest following"
    },
    {
      "level": "H3",
      "text": "Find people who pinned stuff from your website"
    },
    {
      "level": "H2",
      "text": "5. Get to the relevant group boards"
    },
    {
      "level": "H2",
      "text": "6. Use catchy, engaging images"
    },
    {
      "level": "H2",
      "text": "7. Pin consistently. Pin a lot"
    },
    {
      "level": "H3",
      "text": "Pin it all with Tailwind"
    },
    {
      "level": "H2",
      "text": "8. Show your best pins to the top Pinterest users in your niche"
    },
    {
      "level": "H2",
      "text": "Results"
    },
    {
      "level": "H3",
      "text": "Pinterest Profile"
    },
    {
      "level": "H3",
      "text": "Our website"
    },
    {
      "level": "H2",
      "text": "Should this stop you?"
    },
    {
      "level": "H3",
      "text": "1. Don’t overcomplicate your images."
    },
    {
      "level": "H3",
      "text": "2. Your readers can boost your traffic from Pinterest"
    },
    {
      "level": "H3",
      "text": "3. It takes time and consistency to get results"
    },
    {
      "level": "H3",
      "text": "4. Today it’s way harder to start getting traffic from Pinterest"
    },
    {
      "level": "H3",
      "text": "5. SEO is not the most visual niche"
    },
    {
      "level": "H3",
      "text": "6. There’re also Pinterest Ads that I haven’t tried"
    },
    {
      "level": "H2",
      "text": "Over to you"
    }
  ],
  "author": "Nick Churick"
}