{
  "url": "https://ahrefs.com/blog/get-competitors-backlinks/",
  "slug": "get-competitors-backlinks",
  "title": "How to Find Your Competitors' Backlinks (And Get Them for Yourself)",
  "description": "Understanding how your competitors got links can help inform your own link building strategy. We'll show you what to do.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents If you’re looking to build more backlinks to your website, checking how your competitors built and earned their backlinks is a good starting point.That’s because understanding how they got links can help inform your link building strategy. In this post, you’ll learn how to find, replicate, and learn from your competitors’ backlinks.ContentsHow to find your competitors’ backlinksYou need an SEO tool like Ahrefs to do this, which is consistently voted top dog in SEO industry polls. Free method (top 100 backlinks)Head over to our free backlink checker and plug in your competitor’s domain or URL. You can also try it in the tool below. Backlink CheckerCheck backlinks to any website or webpage Exact URLPathDomainSubdomains Check backlinksYou’ll see the total number of backlinks and referring domains (linking websites) and the top 100 backlinks (referring page, anchor, and target URL).Paid method (all backlinks)Sign up for Ahrefs, plug your competitor’s domain or URL into Site Explorer, then go to the Backlinks report. You’ll see all their backlinks. In this case, over 80,000 of them. If you want to hone in on specific backlinks, such as those from English pages on websites with traffic, use the filters.Not sure who your competitors are?Enter your website or webpage’s URL into Site Explorer and go to the Organic competitors report. You’ll see a list of websites or webpages that rank for the keywords as your target.How to replicate your competitors’ backlinksIt’s impossible to replicate all of your competitors’ backlinks, but there are ways to get some of them (or similar ones) for yourself:Find and copy their replicable linksFind and copy the link building tactics that are working for themFind links that you can loot from themLet’s take a closer look at how to do these three things.Finding your competitors’ replicable linksMost of your competitors’ backlinks will be extremely hard to replicate like for like, but it’s usually possible to replicate some of them. Let’s look at a few ways to do this.Find competitors’ directory linksDirectory links are far from the most powerful links, but they’re easy to replicate. Many SEOs believe they help with “map pack” rankings for local businesses too.Here’s the easiest way to find them:Enter your homepage into Site ExplorerGo to the Link Intersect reportEnter a few competitors’ homepages in blank fieldsSet the search mode for all pages to “URL”Hit “Show link opportunities”This will show you the websites linking to one or more of your competitors’ homepages, but not to yours. It’s then just a case of eyeballing the list for sites that look like niche and local directories. If you’re not sure whether a site is a directory, click the caret in one of the competing page columns to see the referring page, anchor, and backlink. You can usually tell from this.If you’re still unsure, click on the page to check manually. Replicating these links is usually as simple as signing up for an account and adding your business. Sidenote. Be aware that some directories charge a fee. Don’t be tempted to pay these for SEO purposes, as they won’t be worth it. Only pay if the directory is likely to send you customers.Find listicles where competitors are mentioned, but not youIf competitors are mentioned in listicles of the best tools/restaurants/whatever your business does, there’s a chance you may be able to get mentioned in that same listicle (and a mention usually comes with a link).These kinds of listicles are usually easy to spot in a competitor’s Backlinks report. However, the best opportunities come from listicles mentioning multiple competitors because the topic of the page is more likely to be relevant to your business.Here’s an easy way to find these:Go to Ahrefs’ Content ExplorerSearch for “competitor 1” “competitor 2” “competitor 3” -“your business name”Sidenote. Using this method, there’s no guarantee that the mentions are linked, but they usually are.It’s then just a case of sifting through the results and pitching the authors of listicles where it makes sense to add your business. Here’s what that pitch might look like for Aweber:Hey [Name],Just came across your list of the best email marketing tools and noticed Aweber wasn’t included. Is that because you didn’t like our platform or haven’t tried it?If it’s the latter, I’d love to hook you up with a free account so you can give it a shot.What do you think? [Name]Note that the email doesn’t explicitly ask the author to add anything to their list. It just asks if they’re familiar with the sender’s tool. This is intentional. It’s easier to ask for inclusion after you win folks over. Find competitors’ links from interviews and podcastsInterview and podcast links are more common in some industries than others, so you may not find any among your competitors. But as they only take a minute to search for, it’s well worth a quick check. Here’s an easy way to find them:Go to Site ExplorerEnter the Twitter profile URL of your competitor’s CEO, CMO, or whoever the most prolific marketer is within the companyGo to the Backlinks reportFilter for results where the referring page URL contains “podcast,” “episode,” or “interview”You then just need to pitch the same interviews and podcasts. Find competitors’ guest postsGuest posting is the third most popular link building tactic, according to Aira’s 2022 State of Link Building report, so it’s probably a tactic that at least some of your competitors are using. However, while you can find them in a competitor’s Backlinks report, they can be hard to spot. For example, one of the links below is from a guest post and the other isn’t. But there’s no way to tell this from the link profile itself.With that in mind, here’s an easier way to find a competitor’s guest posts:Go to Content ExplorerSearch for topic + author:“name of your competitor’s prolific marketer”Filter for one page per domainMost of the results should be guest posts by that person. Replicating them is as simple as reaching out and pitching the same websites.Finding and copying link building tactics that work for competitorsIf your competitors have lots of backlinks from directories, podcasts, interviews, or guest posts, these link building tactics are clearly working for them. So don’t limit yourself to replicating only the exact links they got. Pursue other links from these tactics too.Here are some tutorials to help: How to Find Guest Posting Opportunities on Active Websites [Video]How to Find Podcasts to Get Interviewed On [Video]How to Build Local Citations* [Blog Post]Sidenote. *Most citations come from directories, so building citation opportunities is pretty much the same thing as finding opportunities to get links from directories.However, there are two more commonly used tactics worth checking for. Check for links from journalist requestsBloggers and journalists often use services like Help A Reporter Out (HARO) and MuckRack to source quotes for upcoming stories—and they usually link to their sources.For example, here’s someone from “Martha Stewart Living” asking for a quote about how plumbing leaks occur in the home.Max Rose from Four Seasons Plumbing was one of the people to respond to this, and he received a quote and backlink from the article in return.Here’s how to check if your competitors are building backlinks this way:Go to Site ExplorerEnter a competitor’s homepageSet the search mode to “Exact URL”Go to the Backlinks reportLook for quotes in the “Anchor and target URL” columnIf you spot a few quotes from the same person, like “Max Rose” in this case, filter for that name in the anchor and surrounding text to hone in on these kinds of links.If you see a fair number of links from quotes, there’s a good chance your competitor is actively responding to journalist requests—and that it’s working. So it’s probably worth responding to requests via HARO and similar platforms yourself too.Further readingHow to Use HARO (And Alternatives) to Get Killer BacklinksCheck for passively earned links from linkable pointsLinkable points are things like facts, statistics, and unique ideas that resonate with the linkerati and attract backlinks. Even if your competitors aren’t consciously using this tactic to earn links, it could still be one of the ways they’re earning them—so it’s worth checking.Here’s how to do that:Go to Site ExplorerEnter one of the top-ranking pages for your target keywordGo to the Anchors reportLook for anchors relating to facts, figures, or unique ideasFor example, the Anchors report for a page ranking for “seo copywriting” mentions the “APP” method/formula a few times:This is a term coined by the post’s author, and it has earned him some decent links.Because of this, when we wrote our own guide to SEO copywriting, we decided to coin a similar term in an effort to earn some passive backlinks.If we check the Anchors report for our page, we can see it’s earned us a couple of links so far: This is not astonishing by any stretch of the imagination, but they’re two links we wouldn’t have unless we included proven, linkable points.We had more success with this method when creating our list of SEO statistics (we documented that process in this link building case study), which has earned links from over 1,700 referring domains in under two years.Finding links you can loot from competitorsYour competitors may have links that no longer make sense for them to have. If you can provide linkers with a better alternative, you can often take these links for yourself.Here are a few tactics that revolve around this idea:Broken link buildingBroken link building is where you find a dead page with backlinks, create your own resource on the topic, then ask linkers to link to that instead.For example, this page about SEO tips can’t be found:If we plug that URL into Ahrefs’ Site Explorer, we see it has backlinks from 177 referring domains:If we were to create our own list of SEO tips, we could reach out to these 177 websites and suggest replacing that dead link with a link to our list. But how do you find your competitors’ broken pages with backlinks in the first place?If you have a specific competitor in mind, do this:Go to Site ExplorerEnter your competitor’s domainGo to the Best by links reportAdd a “404 not found” HTTP code filterYou’ll see a list of dead pages on their website, sorted by the number of referring domains pointing to them. If you don’t have a specific competitor in mind, do this:Go to Ahrefs’ Content ExplorerSearch for a topicFilter for broken pages onlyFilter for pages with referring domains (the minimum number is up to you)You’ll see a list of broken pages related to the topic with at least the minimum set number of referring domains.Regardless of which method you use, the process from there is the same: Check what the page used to be – To do this, plug the URL into the Wayback Machine. It needs to be something you can create similar content about.Check the quality of the page’s backlinks – To do this, run a backlink audit in Site Explorer. If it doesn’t have good links, it’s not the best opportunity for a broken link building campaign.Reach out to linkers and suggest they swap the link – To do this more easily, use an outreach tool like Pitchbox or BuzzStream.Further readingBroken Link Building: The Complete Guide301 redirect link building301 redirect link building is where you look for your competitors’ irrelevant redirects, then pitch a replacement to linkers.For example, this page about the Google Penguin Update on Search Engine Land has backlinks from 1.2K referring domains:But, for some reason, it redirects to a page about “Google SEO”:This is a problem because people clicking through from those 1.2K websites will end up on a completely unrelated page. For that reason, there’s an opportunity here to pitch a link swap to linkers (same as with broken link building).But how do you find your competitors’ irrelevant 301 redirects in the first place?Go to Site ExplorerEnter a competitor’s domainGo to the Best by links reportAdd a “3XX redirect” HTTP code filterIt’s then just a case of double-checking what the page used to be in the Wayback Machine, auditing the quality of the page’s links, creating a relevant replacement, and suggesting it to linkers. Run a competitor link analysisSome of your competitors’ “lootable” links won’t fall neatly into the box of a known link building tactic. The process of finding them is quite nuanced and takes some experience, but you’ll often find unique pitches this way.For example, say we wanted to build links to our list of Google ranking factors. If we check the top-ranking results for this keyword in Ahrefs’ Keywords Explorer, we see that many of them have hundreds of (potentially “lootable”) backlinks from hundreds of domains: When I plugged one of those competing URLs into Site Explorer and checked the Backlinks report, alarm bells started to ring when I saw the anchor and surrounding text for this link:It claims that bounce rate, dwell time, and repeat visits are ranking factors.Not true.Given that this link must be based on advice from the linked (competing) page, I decided to take a look myself. What I found was a page giving lots of dangerously bad advice: The highlighted ranking factors are not ranking factors at all.I’m not sure how much linkers would care, but I think there’s an opportunity here to reach out to all worthwhile prospects, explain that they’re linking to an inaccurate post, and suggest linking to our list of ranking factors instead. Even if only a fraction of them care, we win a few links while combating misinformation. It’s a win-win. Final thoughtsFinding your competitors’ backlinks is easy. Getting the same ones to your site is less easy. But that doesn’t mean it isn’t possible. Start by replicating the easy ones, then find and copy the link building tactics that work for them, and finally take any links they no longer deserve for yourself.Got questions? Ping me on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Keep Learning How Many New Backlinks Do Top-ranking Pages Get Over Time [New Data by Ahrefs] Do top-ranking pages get links at a faster pace than lower-ranking pages? We analyzed 200,000 top-ranking web pages across 10,000 keywords to find out. How To Get Backlinks: Add, Ask, Earn, Buy There are only four ways to get backlinks: add, earn, ask, and buy. Link Prospecting: How to Find Quality Backlinks for Your Website Link prospecting is about finding and evaluating potential sites to acquire quality links—a key part of any successful SEO campaign. What Are Backlinks in SEO? Everything You Need to Know Backlinks are links from one website to another. High-quality backlinks can improve a website’s ranking in search engine results. Here's what you need to know. 4 Tactics for High-Quality Backlinks That Move the Needle [+ Examples] Many backlink techniques are outdated and don’t move the needle. Discover new ways to earn high-quality links, along with six successful examples you can emulate. Toxic Backlinks: SEO Woe or a Load of Baloney? Toxic backlinks are links that some SEO tools say could hurt your website's Google rankings. But will they really? Should you disavow them?",
  "headers": [
    {
      "level": "H1",
      "text": "How to Find Your Competitors’ Backlinks (And Get Them for Yourself)"
    },
    {
      "level": "H2",
      "text": "How to find your competitors’ backlinks"
    },
    {
      "level": "H3",
      "text": "Free method (top 100 backlinks)"
    },
    {
      "level": "H3",
      "text": "Paid method (all backlinks)"
    },
    {
      "level": "H2",
      "text": "How to replicate your competitors’ backlinks"
    },
    {
      "level": "H3",
      "text": "Finding your competitors’ replicable links"
    },
    {
      "level": "H4",
      "text": "Find competitors’ directory links"
    },
    {
      "level": "H4",
      "text": "Find listicles where competitors are mentioned, but not you"
    },
    {
      "level": "H4",
      "text": "Find competitors’ links from interviews and podcasts"
    },
    {
      "level": "H4",
      "text": "Find competitors’ guest posts"
    },
    {
      "level": "H3",
      "text": "Finding and copying link building tactics that work for competitors"
    },
    {
      "level": "H4",
      "text": "Check for links from journalist requests"
    },
    {
      "level": "H4",
      "text": "Check for passively earned links from linkable points"
    },
    {
      "level": "H3",
      "text": "Finding links you can loot from competitors"
    },
    {
      "level": "H4",
      "text": "Broken link building"
    },
    {
      "level": "H4",
      "text": "301 redirect link building"
    },
    {
      "level": "H4",
      "text": "Run a competitor link analysis"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Joshua Hardwick"
}