{
  "url": "https://ahrefs.com/blog/gonzo-content/",
  "slug": "gonzo-content",
  "title": "Gonzo Content: What Marketers Need to Learn From Hunter S. Thompson",
  "description": "We’ve passed the high-water mark of content marketing. So where do we go from here?",
  "content": "Ryan Law Ryan Law is the Director of Content Marketing at Ahrefs. Ryan has 13 years experience as a writer, content strategist, team lead, marketing director, VP, CMO, and agency founder. He's helped dozens of companies improve their content marketing and SEO, including Google, Zapier, GoDaddy, Clearbit, and Algolia. He's also a novelist and the creator of two content marketing courses. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents We’ve passed the high-water mark of content marketing—at least, content marketing in its current form.After thirteen years in content marketing, I think it’s fair to say that most of the content on company blogs was created by people with zero firsthand experience of their subject matter. We have built a profession of armchair commentators, a class of marketers who exist almost entirely in a world of theory and abstraction.I count myself among their number. I have hundreds of bylines about subfloor moisture management, information security, SaaS pricing models, agency resource management. I am an expert in none of these topics.This has been the happy reality of content marketing for over a decade, a natural consequence of the incentives created by early Google Search. Historically, being a great content marketer required precisely no subject matter expertise. It was enough to read widely and write quickly.Mountains of organic traffic have been built on the backs of armchair commentators like myself. Time spent doing deep, detailed research was, generally speaking, wasted, because 80% of the returns came from simply shuffling other people’s ideas around and slapping a few keyword-targeted H2s in the right places.But this doesn’t work today.For all of its flaws, generative AI is an excellent, truly world-class armchair commentator. If the job-to-be-done is reading a dozen articles and how-to’s and turning them into something semi-original and fairly coherent, AI really is the best tool for the job. Humans cannot out-copycat generative AI.Put another way, the role of the content marketer as a curator has been rendered obsolete. So where do we go from here?Hunter S. Thompson popularised the idea of gonzo journalism, “a style of journalism that is written without claims of objectivity, often including the reporter as part of the story using a first-person narrative.”In other words, Hunter was the story.When asked to cover the rising phenomenon of the Hell’s Angels, he became a Hell’s Angel. During his coverage of the ‘72 presidential campaign, he openly supported his preferred candidate, George McGovern, and actively disparaged Richard Nixon. His chronicle of the Kentucky Derby focused almost entirely on his own debauchery and chaos-making—a story that has outlasted any factual account of the race itself.In the same vein, content marketers today need to become their stories.It’s a content marketing truism that it’s unreasonable to expect writers to become experts. There’s a superficial level of truth to that claim—no content marketer can acquire a decade’s worth of experience in a few days or weeks—but there are great benefits awaiting any company willing to challenge that truism very, very seriously.As Thompson proved, short, intense periods of firsthand experience can yield incredible insights and stories. So what would happen if you radically reduced your content output and dedicated half of your content team’s time to research and experimentation? If their job was doing things worth writing about, instead of just writing? If skin-in-the-game, no matter how small, was a prerequisite of the role?We’re already seeing this shift.Every week, I see more companies hiring marketers who are true, bonafide subject matter experts (I include the Ahrefs content team here—for the majority of our team, “writing” is a skill secondary to a decade of hands-on search and marketing experience). They are expensive, hard to find, and in the era of AI, worth every cent.I see a growing expectation that marketers will document their experiences and experiments on social media, creating meta-content that often outperforms the “real” content. I see more companies willing to share subjective experiences and stories, and avoid competing solely on the sharing of objective, factual information. I see companies spending money to promote the personal brands of in-house creators, actively encouraging parasocial relationships as their corporate brand accounts lay dormant.These are ideas that made no sense in the old model of content marketing, but they make much more sense today. This level of effort is fast becoming the only way to gain any kind of moat, creating material that doesn’t already exist on a dozen other company blogs.In the era of information abundance, our need for information is relatively easy to sate; but we have a near-limitless hunger for entertainment, and personal interaction, and weird, pattern-interrupting experiences.Gonzo content marketing can deliver. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Ryan Law Ryan Law is the Director of Content Marketing at Ahrefs. Ryan has 13 years experience as a writer, content strategist, team lead, marketing director, VP, CMO, and agency founder. He's helped dozens of companies improve their content marketing and SEO, including Google, Zapier, GoDaddy, Clearbit, and Algolia. He's also a novelist and the creator of two content marketing courses. Keep Learning 7 Successful B2B Content Marketing Examples You Can Learn From Different companies do content marketing differently, as there is no one right way. To get you inspired, here are seven successful B2B content marketing examples. My 5 Favorite Ahrefs Use Cases for Content Marketers Snoop on site structure, cluster keywords into article ideas, track performance by authors, and much more. 23 Actual Content Metrics From Actual Marketers We asked content marketers to share the actual metrics they track. Here's what they said. Why Is Content Marketing Important? 7 Reasons to Start Content Marketing Here are seven reasons why content marketing is important and deserves to be the marketing channel you should focus on. Repurposing Content: How to Get More Mileage From Your Existing Content Making good content takes a lot of time, effort, and resources. By repurposing, you can make it go the extra mile.",
  "headers": [
    {
      "level": "H1",
      "text": "Gonzo Content: What Marketers Need to Learn From Hunter S. Thompson"
    }
  ],
  "author": "Ryan Law"
}