{
  "url": "https://ahrefs.com/blog/google-discover/",
  "slug": "google-discover",
  "title": "Google Discover: How to Rank and Drive Traffic",
  "description": "Google Discover is an automatically generated, highly personalized mobile feed that shows information and news based on your online activity.",
  "content": "Michal Pecánek SaaS SEO consultant with over 6 years of experience. Before going freelance, Michal was an SEO & Marketing Educator at Ahrefs–creating content for the blog and managing a team of guest writers. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Google Discover is an automatically generated and highly personalized mobile feed based on your online activity. It shows information and news about the topics that interest you, like SEO or golf.An example of the Google Discover feed.It’s more like a social network than a search engine, but your search activity and history is crucial for providing a relevant and timely feed.Millions of people see a personalized Google Discover feed on their mobile devices every day, and it’s become a solid source of traffic for many websites since its introduction in 2018. This is especially true for news and media outlets, many of which now get the bulk of their organic traffic from Discover.Even our humble little SEO blog got almost 150k clicks from it in the past six months:Google Discover is still a big unknown, though. And because this topic calls for expert collaboration, we asked a few SEO experts for their insights:Kevin Indig - VP of SEO & Content at G2 Suganthan Mohanadasan - Co-founder and technical SEO lead at Snippet Digital Dan Taylor - Head of SEO Research & Development at SALT.agency John Shehata - VP of Audience Development Strategy at Condé Nast & founder of NewzDashBut first…How Google Discover generates your feedTo become a great SEO, you need to know how search engines work. And we need to understand the same with Discover.According to Google, they use the following data to generate the feed:Your activity across all Google products (e.g., your search activity, watched YouTube videos, and engagement with Discover results)Location historyLocation settingsTopics you followDo you see the similarity to social networks now? The feed reflects your hobbies, current interests, and everything else in the world relevant to you. It’s so personalized that it even considers your level of expertise and how important that topic is to you.For example, half my feed is almost always about SEO since that’s the topic I interact with the most. As you can see, you can even “follow” the topic of SEO:Interestingly, you can check how Google categorizes the results in your feed. Suganthan referred me to this method discovered by Valentin Pletzer, who found out that you can access this information by clicking Send feedback > System logs > Card category:These are the card categories that Valentin came across together with what he thinks they may represent:All credit to Valentin Pletzer for providing this data and insights above.For example, we can see that being on Google News certainly helps with Discover performance as it has its own “NEWS_HEADLINES” category. If this is relevant to you, check John’s guide about Google News optimization.In general, if there’s a demand for your content and it sends the right signals to Google, you’ll be driving Discover clicks from people already interested in that. That’s a huge benefit compared to social media, where posts mostly reach a “cold” audience.How to drive Google Discover trafficFirst of all, don’t spend too much time proactively trying to chase Discover clicks unless you’re already far along with your SEO efforts. Most people will be better off prioritizing standard organic traffic. News sites are the exception, but you already know that if you work for one.Optimizing for Google Discover is an SEO topic that surpasses anything else in terms of uncertainty. The only available data is in your Google Search Console. You can’t analyze your competitors, and so the scale of your research is quite limited.It’s hard to predict how a particular piece of content will perform in Discover. Speaking from our own experience in the B2B SaaS industry, you’ll most often see 3-5 day traffic spike upon publishing:However, some evergreen content will manage to get constant traction:And sometimes it might be a combination of both patterns:However, some content might not even make it into the feed despite doing all the right things. As with almost everything in SEO, you can’t guarantee that X will do Y; it’s all about increasing your chances of a desirable outcome.Luckily, there are a few official tips on increasing the likelihood of getting your content into Discover, which I cover below together with our unique insights. But first, know that indexed content needs to adhere to content policies to be eligible to appear in Discover. Only then should you focus on the following areas to increase the likelihood of being featured:Have a mobile-friendly websiteUse unique high-quality images Align your content and metadata Publish content about popular topicsWork on your E-A-TFocus on entities Become a Knowledge Graph entity Create buzz with your content distribution Periodically refresh your content Embed your YouTube videos into articlesTry Web Stories1. Have a mobile-friendly websiteDiscover is a mobile-only feed, so your site’s mobile experience is hugely important.At the very least, you need a responsive, fast-loading website with limited or no ads, pop-ups, or interstitials. Also, be prepared for May 2021 when Core Web Vitals become a part of the ranking algorithm because Cumulative Layout Shift is not a page speed metric.If you want to go a step further, consider using AMP. John estimates that more than 60% of all Discover articles are running on AMP. Of course, this number is heavily skewed by news websites, and SEO opinions on implementing it are mixed. But the Discover trend is clear:2. Use unique high-quality imagesDiscover is yet another feed where the image gets the most attention, so you should use great high-quality images for all visual content on the page.Google recommends that your large images should be at least 1200px wide and enabled by the max-image-preview:large robots meta tag or by using AMP. That should be your default setting regardless of Discover, as it’s the best practice for image SEO. Plugins like Yoast add this automatically.You can also use the schema image property to provide more data to Google.3. Align your content and metadataTitle tags and meta descriptions should summarize the page’s content and entice users to click. Just make sure not to use clickbait or other manipulative tactics here, as Google explicitly warns against these in the Discover guidelines.An interesting thing we found out by mistake is that Google Discover takes Open Graph meta tags into account. We had a typo in one of our og:title tags and it went through to the Discover feed despite the title tag being correct. There was a missing “L” at the beginning:4. Publish content about popular topicsDiscover tends to surface lots of timely content about current events, which is why news websites dominate the feed.But it also surfaces plenty of evergreen content. Our blog is proof of that. We don’t write about trending topics, but we’re still getting tens of thousands of clicks from Discover each month.This happens because Discover is a personalized feed and shows content that is new to you, not just new to the Web. For example, let’s say that you’re about to start investing in the stock market, which requires quite a bit of research. You’ll probably encounter articles in your Discover feed about investing tips, stockbroker comparisons, and other beginner stuff that could have been published months ago.How do you target evergreen topics? It starts with keyword research. Just enter a few broad topics into a popular keyword research tool like Keywords Explorer, then look for popular topics.Sidenote. If you want to find new or trending topics, use tools like Google Trends or Exploding Topics.Just know that merely writing about popular topics is rarely enough. Google says that you should focus on good copywriting and providing unique insights if you want to show up in Discover.5. Work on your E-A-TGoogle says that they source content from websites with many pages that demonstrate expertise, authoritativeness and trustworthiness.There are multiple ways to assess and support your E-A-T. The Discover guidelines state that you should do the following:Providing clear dates, bylines, information about authors, the publication, the publisher, company or network behind it, and contact information to better build trust and transparency with visitors.On top of this, it might be worth using structured data to connect the dots.Suganthan also suggests looking at Google’s Affinity categories and looking for topics where you can become an authority. That’s because these audiences seem to be linked to “CORE” interests card categories, as shown earlier from the logs.The easiest way to find these is in the Affinity Categories report in Google Analytics.Google Analytics > Audience > Interests > Affinity CategoriesIn general, you should do everything you can to position your brand as a thought leader in your industry.6. Focus on entitiesWhen I analyzed the Discover performance of the Ahrefs blog, I managed to pinpoint topics that perform better than others. In the SEO world, it’s the entities and their connections that form specific topics.Upon receiving the insights from our contributors, it was clear that entities play a significant role here as everyone mentioned them in one way or another.There’s a Knowledge Graph layer created to map how user interests and expertise develop for any topic over time. This is known as the Topic Layer, and is built by analyzing all content tied to a certain topic and all of its subtopics, ultimately connecting all the dots.It seems that some of the dots can become Discover interests without being a Knowledge Graph entity. For example, querying “meta description” in Knowledge Graph API returns no results, but in Discover it shows as an interest that you can follow:You can’t dig into the Topic Layer, so we’ll have to focus on the higher-level entities. And that’s more than enough.Your goal should be to have authority within the scope of entities that are tied to your business. There are multiple ways to approach this when you create content:Be consistent in your categoryMost websites are about something specific. It could be coffee, laptops, SEO, or something else entirely. Whatever it is for you, try not to deviate too far when creating content. If you’re publishing about iPhones one day and cooking tips the next, that doesn’t send positive signals to your audience or Google. It just waters down your ‘authority’ across all categories.The only exception to this rule is if you work for a massive media outlet that covers everything.Find the entities that work for your brandI tried to spot topics that work best by manually going through our Discover reports. However, this method only covers main entities, and you can’t do it at scale.If you already have many pages in Discover, you’re also likely to have access to developer resources. If that’s the case, you can do what John did: run your articles through Google’s Natural Language Tool, then combine the entities based on their salience and analyze which drove the most Discover traffic for you.This is an example of what the entity analysis looks like: You can test the NLP API yourself. Just scroll down to the demo input window and paste some of your content there.Use Google Images to find associated entities and informationDan came up with an easy-to-use method to tell what other topics Google associates with a topic. Go to Google Images, search for your main keyword and then look at the related entity tags at the top:Alternatively, you can use a tool like Entity Explorer that seems to get data using this same method.Use this as inspiration for what to add to your current or upcoming content. Dan experienced increased Discover performance after incorporating related entities and information into his content. He also ranked for more keywords.7. Become a Knowledge Graph entityPeople can only follow your brand in Discover if it’s in the Knowledge Graph. You can check if this is the case by Googling your brand. If there’s a Knowledge Panel in the search results, it’s in the Knowledge Graph:Knowledge Panel for Gibson Brands, Inc.Interestingly, however, even if someone follows your brand, your content might not show up in their Discover feed. Kevin and I both tested this. I’ve been following MailChimp on Discover for a few months, and I’m yet to see any of their content in my feed.So how does being a Knowledge Graph entity help improve your visibility in Discover?Being in the Knowledge Graph is a sign that your online presence is strong enough for Google to put your brand in the right context. In other words, it understands what entities and interests are associated with your brand and may show your content to people interested in those things as a result.Recommended reading: Google’s Knowledge Graph Explained: How It Influences SEO8. Create buzz with your content distributionIt makes sense that Discover would want to showcase content with high engagement. We can confirm that posts with more Discover clicks also tend to have a comparatively high CTR in Discover.What might be more surprising is that all of us have found that there seems to be a high correlation between social media engagement and your Discover performance.John even crunched the numbers. He found the correlation coefficient between Discover performance and Twitter engagement in the US is a whopping 0.91. That’s a significantly high correlation, but as always, it doesn’t equal causation. Creating buzz with your content benefits you even if Google ignores it.John also adds that this ‘buzz factor’ might be tied to Discover performance in certain countries. While Twitter plays a significant role in the US, it might be overshadowed by other platforms elsewhere. This means that you should distribute your content to locally popular channels.At Ahrefs, we can see that this might indeed play a huge role in getting Discover clicks. We localize our blog content into five other languages. Those articles are essentially the same as our English ones that perform well, yet we only managed to get a few Discover clicks to some Spanish posts.The only difference? We don’t focus on proper content distribution in other languages yet.Again, none of this proves causation but Suganthan also brought up an experiment regarding the social engagement signal. JR Oakes made people engage with his tweet containing a deliberately rubbish article and it made it into the Discover feed:Holy crap BAM! Thanks for all the retweets. Findings: Crappy machine-generated content + a bunch of Twitter shares = Google Discover card. https://t.co/sXtoylnX9z pic.twitter.com/pudHXdwcNO— JR Oakes (@jroakes) July 2, 20199. Periodically refresh your contentJust because your page isn’t showing up in Discover now doesn’t mean it never will. Here’s an article that we first published in 2017 that never received a Discover click until we rewrote and republished it:Naturally, we didn’t update the article just to get Discover clicks. We updated it to try to improve its rankings and organic traffic from “regular” search results. The clicks from Discover were just a nice bonus.Republishing content is one of our favorite growth tactics. According to Content Explorer, we’ve updated 60 pages in the last 12 months:All of this is not just our experience. John and Suganthan confirm that often refreshing evergreen content works well for them too.10. Embed your YouTube videos into articlesYouTube videos can be seen quite often in Discover feeds:If you embed them into your content, there’s a chance that the videos will show up in Discover on their own and even outperform the content itself. And as Kevin points out, you don’t even need to use schema markup.We have some articles that got only a few hundred clicks, but their embedded videos got thousands. We cover some of our topics in both video and written form so repurposing your content seems like a good tactic to boost traffic from Discover.Just keep in mind that video clicks don’t go to your website but to YouTube instead.11. Try Web StoriesFormerly known as AMP stories, these are Google’s take on the stories we know from Instagram and other social networks.Google recently announced that they started supporting Web Stories in the Discover feed. If this type of content is something worth your time, try it out. At the time of writing, it’s only available for English content in the US.Kevin confirmed that they tried experimenting with these Web Stories, and they indeed got featured in Discover.Final thoughtsYou can leverage Google Discover traffic regardless of your business. It won’t be a priority unless you have a news website, but the optimization tips are likely nothing you wouldn’t do in your everyday SEO work anyway.Applying these tips won’t be beneficial just for Discover. That’s a by-product. They will lead to generally better SEO, content distribution, and traffic diversification.The great thing about Google Discover is that it can drive clicks even when the primary keywords have no search demand. The general topic should still reflect people’s interests, but this is another argument in favor of publishing content that doesn’t primarily focus on driving search traffic.Got any other Discover insights or questions? Ping me on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Michal Pecánek SaaS SEO consultant with over 6 years of experience. Before going freelance, Michal was an SEO & Marketing Educator at Ahrefs–creating content for the blog and managing a team of guest writers. Keep Learning How to Rank Higher on Google (10 Steps) Improve your Google rankings in 10 easy steps to get more organic traffic to your website. YouTube SEO: How to Rank Your Videos From Start to Finish Do you want to rank your videos in YouTube? Learn how we increased our YouTube search views by nearly 400% in 7 ½ months, and how you can do the same. How to Rank in ‘People Also Ask’ Boxes and If You Should The People Also Ask (PAA) box is a SERP feature that answers questions related to the user's query. But should you try to rank in them? Best Rank Trackers: Choosing the Right One for You Rank trackers are tools that automates the process of checking search engine ranking positions for certain keywords over time. White Hat SEO: How to Rank Without Breaking The Rules Discover what white hat SEO is, how it compares to black hat SEO, and how to implement a few white hat SEO tactics.",
  "headers": [
    {
      "level": "H1",
      "text": "Google Discover: How to Rank and Drive Traffic"
    },
    {
      "level": "H2",
      "text": "How Google Discover generates your feed"
    },
    {
      "level": "H2",
      "text": "How to drive Google Discover traffic"
    },
    {
      "level": "H3",
      "text": "1. Have a mobile-friendly website"
    },
    {
      "level": "H3",
      "text": "2. Use unique high-quality images"
    },
    {
      "level": "H3",
      "text": "3. Align your content and metadata"
    },
    {
      "level": "H3",
      "text": "4. Publish content about popular topics"
    },
    {
      "level": "H3",
      "text": "5. Work on your E-A-T"
    },
    {
      "level": "H3",
      "text": "6. Focus on entities"
    },
    {
      "level": "H4",
      "text": "Be consistent in your category"
    },
    {
      "level": "H4",
      "text": "Find the entities that work for your brand"
    },
    {
      "level": "H4",
      "text": "Use Google Images to find associated entities and information"
    },
    {
      "level": "H3",
      "text": "7. Become a Knowledge Graph entity"
    },
    {
      "level": "H3",
      "text": "8. Create buzz with your content distribution"
    },
    {
      "level": "H3",
      "text": "9. Periodically refresh your content"
    },
    {
      "level": "H3",
      "text": "10. Embed your YouTube videos into articles"
    },
    {
      "level": "H3",
      "text": "11. Try Web Stories"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Michal Pecánek"
}