{
  "url": "https://ahrefs.com/blog/google-search-algorithm/",
  "slug": "google-search-algorithm",
  "title": "How the Google Search Algorithm Works",
  "description": "Google’s search algorithm is easily one of the most influential technologies ever created. But what is it and how does it work?",
  "content": "Bill Widmer 8+ years as a digital nomad, Bill is on a mission to travel the world and fund it using SEO and content marketing. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Google’s search algorithm is easily one of the most influential technologies ever created. With an estimated 5.6 billion Google searches per day, it’s safe to say Google has a heavy impact on the world—and on your business.But what is the Google Search Algorithm? How does it work? And, most importantly, how can you rank higher on Google and get more traffic?This guide attempts to demystify the mysterious Google Search Algorithm:What is the Google Search Algorithm?How does the Google Search Algorithm work?What are the Google Search Algorithm ranking factors?A note on Google algorithm updatesWhere to find Google’s official updatesWhat is the Google Search Algorithm?The Google Search Algorithm refers to the process Google uses to rank content. It takes into account hundreds of factors, including keyword mentions, usability, and backlinks.Sidenote. Google has multiple search algorithms all working together to return the best results. In this article, we’ll focus mainly on Google’s ranking algorithm(s), as we believe that’s what most people are referring to when they talk about Google’s search algorithm. How does the Google Search Algorithm work?Google’s algorithm is extremely complex, and how it exactly works is not public information. It’s believed that there are well in excess of 200 ranking factors—and nobody knows them all.Even if they do, it won’t matter because the algorithm is always changing. Google releases updates to its algorithm, on average, six times per day. That’s up to 2,000 times per year.That said, Google does give hints on how you can rank well in its results.What are the Google Search Algorithm ranking factors?When you think of a “search algorithm”—as it relates to search engine optimization (SEO)—the first thing that comes to mind is probably Google’s ranking factors. In other words, what is Google looking at when deciding which pages to rank and in which order?If we look at Google’s “How Search Works” page, it directly reveals some of Google’s most prominent ranking factors:BacklinksFreshnessKeyword mentionsUser experienceTopical authorityLet’s break these down.1. BacklinksGoogle wants to display pages where “prominent websites on the subject [are] linking to the page.” In layman’s terms, it wants to see backlinks from authoritative websites (that are also topically relevant) pointing to your pages.Acquiring these links is called link building, and it is arguably one of the most important tasks you should do to get Google to trust and display your website. This has reliably been Google’s biggest deciding factor in determining a site’s trustworthiness since its inception in 1996.You can determine if links may be holding your content back from ranking by comparing your page’s backlink profile to your competitors’.First, plug the URL of the page you’re trying to rank into Ahrefs’ Site Explorer, and you’ll see how many backlinks and referring domains (linking websites) your page currently has.Next, go to Ahrefs’ Keywords Explorer and enter the main keyword you’re targeting for that page. Scroll down. You’ll find the SERP overview section, where you can see how many backlinks and referring domains your competitors have.If you notice that your competitors’ pages have more backlinks than your page does (like ours do in the example above), it means you probably need to prioritize building links to rank above them.Here are some strategies to get started on link building:Guest bloggingCreating linkable assetsBroken link buildingPRO TIPIf you want to dive deeper into understanding the backlink landscape of your target keywords and what kind of links you need in order to rank, check to see what linking domains all of your competitors share that you don’t. To do this, plug the top three ranking competitors for your target keyword into Ahrefs’ Link Intersect tool and your page into the “But doesn’t link to” box, like so:When you hit “Show link opportunities,” you’ll see all the sites that link to your competitors’ pages but not yours. These are the first sites you can approach to acquire links.2. FreshnessContent freshness refers to how “fresh,” or recent, the content on your webpage is. When was the last time it was updated?This factor matters more for some queries than others. For example, if you search for something news-related, Google will typically rank results published within the last 24 hours.However, if you search for a topic that doesn’t need to be updated as often, freshness isn’t quite as heavy of an influence. For example, the top-ranking results for “RV storage ideas” are from over two years ago:This is because good RV storage ideas today are largely the same as they were two years ago. So how recently it was published doesn’t make as much of a difference. Guides like this are what we call “evergreen content.” That is, content that will be good for years to come without needing many frequent updates.Overall, when determining the importance of freshness for the keywords you’re targeting, you should always analyze the SERP for that keyword. Is Google seemingly ranking fresh content? If so, you will need to update the piece frequently to stand any chance of staying at the top.3. Keyword mentionsOne of the things Google cares about is “the number of times your search terms appear [on the page you’re trying to rank].”In general, it’s good practice to try to include your exact keyword on the page several times in several places, including:The title.At least one subheading.The page’s URL.The intro paragraph.That said, we don’t believe you need to worry about keyword mentions beyond that. This is as you’ll naturally mention the keyword you’re targeting throughout the content as you’re writing about it.For example, our post on evergreen content mentions the words “evergreen content” 18 times—and we made zero effort to do this.Instead, pay more attention to making sure your page fulfills search intent and answers what the searcher is looking for. In other words, ensure that you’ve covered everything searchers may want to know.Google highlights the importance of this on its ‘How Search Works’ page:Just think: when you search for ‘dogs’, you likely don’t want a page with the word ‘dogs’ on it hundreds of times. With that in mind, algorithms assess if a page contains other relevant content beyond the keyword ‘dogs’ — such as pictures of dogs, videos, or even a list of breeds.One way of doing that is to use Ahrefs’ Content Gap tool to look for subtopics of a given keyword that you should mention on your page. Plug your site into Site Explorer, then click “Content gap” on the left.Next, go to Google, search for the keyword you’re targeting with your page, and pull the top three to five ranking URLs that match the intent of your page (e.g., if your page is a blog post, choose other blog posts).Once you have your competitors’ URLs, plug them into the tool as I did in the screenshot below, then click “Show keywords.”I did this for our “What Are Keywords?” guide. In the screenshot below, the result tells us we can potentially improve the article by adding a section on whether keywords are still relevant for SEO.Plus, by doing this type of content gap research, you may also find opportunities for additional articles related to the one you’re currently optimizing. I found keywords like “seo keyword best practices” and “what is keyword research” that we can potentially write content for.If you want to learn more about how to optimize a page for a keyword and where to place a keyword, check out our guide to on-page SEO.4. User experienceGoogle states that it cares about “whether the page has good user experience.” But what is considered “good user experience”?User experience (UX) encompasses a lot of different things, including the following:Page load speed (Google recommends under two seconds)No intrusive interstitials, like ads or pop-upsIntuitive navigation and internal linkingMobile-friendlinessWebsite designMeta tags (having a meta title and description that match search intent)And moreSpeed, in particular, has become more important to Google in the past few years. In the summer of 2021, Google released a major update. Because of that, it’s now more important to pass Google’s Core Web Vitals (CWV) test, which is essentially a speed test.You can check your CWV and learn how to improve your site’s performance by plugging your site into Ahrefs’ Site Audit and clicking on the “Performance Report” tab. You’ll need to enable the CWV scan in the settings. (You’ll see a notice about this at the top of the report, as shown below.)Once you’ve allowed CWV with the Google API, run a new scan on your site. When it’s done, you’ll get a report showing the pages that need improvement and the pages with errors.To see those pages, click on the number next to “Needs improvement” or “Poor.” It will show you which pages aren’t passing the Lighthouse Score or CrUX performance. (These are page speed scores that are part of the CWV report.)If you want to learn more about how to optimize your site for user experience, follow our website audit guide.5. Topical authorityGoogle wants to display “sites that many users seem to value for similar queries.” This means sites that have additional, valued content about queries relevant to the one being searched.While Google isn’t explicit about what it means by “users seem to value,” we can safely assume that topical backlinks are a part of it. So in addition to creating a lot of related content, you also need to acquire links from topically relevant sites.For example, if you want to rank for “best protein powder,” Google may be more likely to rank you if people also come to your site for content on topics such as the following:Best time of day to consume proteinCan pregnant women have protein powder?Where does protein powder come from?In addition to having content on these topics, you should also aim to acquire topically relevant backlinks to them.Having a lot of related content and contextually relevant links may show Google (and its users) that you’re an authority on that topic and may help you to rank higher in the search results. Of course, we’re assuming you are also optimizing for the other ranking factors as well.Ready to check this ranking factor off your list? Start creating content hubs for SEO.A note on Google algorithm updatesGoogle updates its algorithm nearly every day, and it releases major updates two to three times per year that can have a fairly massive impact on rankings.In other words, things change. It’s important to stay up to date on Google’s ranking factors so that you don’t get left behind on the SERPs due to a Google penalty or shift in search intent.Some of the major Google updates include these:Intrusive Interstitials UpdateShift to Mobile-First Indexing (Called “Mobilegeddon”)RankBrainPandaPenguinHummingbirdPigeonOf course, this isn’t an extensive list. See our SEO glossary for a more comprehensive list of Google algorithm updates and other common SEO terms.Where to find Google’s official updatesGoogle has several channels that release public updates about changes in its algorithm, and it has a ton of official public documentation about how its algorithm works.Here are some great sources to stay up to date on what Google is doing:Google’s explanation of how it ranks results Google’s official Twitter pageGoogle Search Central’s YouTube channelIf you’re keen to stay on the cutting edge of what Google is doing to its algorithm, it also offers regular office hours called Google Search Central. There, people like John Mueller, Google’s senior webmaster trends analyst, will answer your questions live.Final thoughtsThe Google Search Algorithm is a complex beast with a lot of moving parts, and it’s constantly changing. But its goal of returning the best results for a given search query remains the same.Despite Google’s many updates, the fundamentals of SEO haven’t changed much since search engines came to be. If you focus on the ranking factors you learned in this article, you will be able to rank on the SERPs.In essence:Create high-quality, well-formatted content that matches your keywords’ search intent.Keep your content up to date.Ensure your site has a good user experience.Build topically relevant links.These are the things the Google Search Algorithm cares about, according to Google.Ready to dive deeper? Check out these other articles on Ahrefs’ blog:How to Rank Higher on Google (6 Easy Steps)SEO Basics: Beginner’s Guide to SEO Success12 SEO Best Practices That Everyone Should Follow Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Keep Learning How to Use Google Search Console to Improve SEO (Beginner’s Guide) Learn how to use Google Search Console to improve your SEO today in 6 simple steps. How to Get to the Top of Google’s Search Results [Interactive Guide] Follow this interactive guide to learn how to appear above your competition in Google. Google Search Operators: The Complete List (44 Advanced Operators) Google advanced search operators are special commands that filter search results, making them more precise. Here are all of them. 23 Alternative Search Engines to Google Google is by far the most popular search engine, but it’s not the right choice for everyone. Here are your other options. Google Sandbox: Does Google Really Hate New Websites? The Google Sandbox refers to an alleged filter that prevents new websites from ranking in Google’s top results. But how do you avoid and/or get out of it?",
  "headers": [
    {
      "level": "H1",
      "text": "How the Google Search Algorithm Works"
    },
    {
      "level": "H2",
      "text": "What is the Google Search Algorithm?"
    },
    {
      "level": "H2",
      "text": "How does the Google Search Algorithm work?"
    },
    {
      "level": "H2",
      "text": "What are the Google Search Algorithm ranking factors?"
    },
    {
      "level": "H3",
      "text": "1. Backlinks"
    },
    {
      "level": "H3",
      "text": "2. Freshness"
    },
    {
      "level": "H3",
      "text": "3. Keyword mentions"
    },
    {
      "level": "H3",
      "text": "4. User experience"
    },
    {
      "level": "H3",
      "text": "5. Topical authority"
    },
    {
      "level": "H2",
      "text": "A note on Google algorithm updates"
    },
    {
      "level": "H2",
      "text": "Where to find Google’s official updates"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Bill Widmer"
}