{
  "url": "https://ahrefs.com/blog/growth-marketing/",
  "slug": "growth-marketing",
  "title": "What Is Growth Marketing? A Beginner's Guide",
  "description": "What is growth marketing and how does it work? Is it right for your business? Learn everything you need to know in this post.",
  "content": "Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents DropBox famously supercharged its growth by leveraging its product—it gave away storage space for each new referral to its business.This integration of product and marketing was new at the time. Sean Ellis, then DropBox’s first marketer, coined it “growth hacking.”Another marketer, Andrew Chen, followed on by calling growth hackers the “new VPs of marketing.” Coupled with the success of Facebook’s own growth team, many high-growth tech companies like Uber, Airbnb, and Pinterest started building and developing the discipline known as growth marketing.In this post, you’ll learn the following:What growth marketing isWhy it is importantHow growth marketing worksWhether growth marketing is right for your businessThe alternative if growth marketing isn’t right for youWhat is growth marketing?Growth marketing is a holistic and data-driven approach to marketing. It focuses on the entire funnel (rather than just the top of the funnel) and applies the scientific method—formulating hypotheses, testing these hypotheses, then refining or eliminating them.Originally known as growth hacking, Sean intended for the term to mean “​​creative, collaborative idea generation and problem-solving to thorny challenges.”However, subsequent growth marketers focused too heavily on the “hacking” aspect, treating it as the “silver bullet” to solve marketing issues. The term “growth marketing” was promoted to refocus the discipline.Why is growth marketing important?Traditional marketing has two main problems:Cross-collaboration between teams is (almost) non-existentMarketing teams often have no idea what’s workingLet’s look at both in more detail.1. Cross-collaboration between teams is (almost) non-existentCompanies frequently structure teams by layers of the marketing funnel.Generally speaking:The marketing team owns the top of the funnel—awareness and interest.The sales team owns revenue—consideration and conversion into a customer.The product team owns retention—loyalty and advocacy.Then, each team is given a metric that measures success at each layer of the funnel. But the problem is that the teams then optimize for their metrics… at the expense of each other.For example, a typical goal for marketing teams is the number of leads. But these leads can be low quality, which then impacts other teams (e.g., low-quality leads are harder to convert and retain).That’s just one problem. Another problem is that these teams rarely communicate and collaborate with each other. In those scenarios, for example, product teams miss an opportunity to tap into the marketing team’s expertise on how to market new features. This silo-ing of departments is one reason why DropBox’s innovative referral program would not have happened at most companies.Growth marketing solves this by putting the focus on the entire funnel.2. Marketing teams often have no idea what’s workingTraditional marketing is hard to measure. Famous American merchant John Wanamaker once quipped, “Half the money I spend on advertising is wasted; the trouble is I don’t know which half.”With hardly any idea of what worked, marketers came up with campaigns and tactics based on gut instinct and (hopefully) educated guesses. This created a desire for a rigid methodology—one that could generate experiment ideas, measure if they’re working, and redirect/eliminate resources from those that aren’t to those that are.Growth marketing is that methodology.How does growth marketing work?According to Sean’s book, “Hacking Growth,” the core elements of growth marketing are:The creation of a cross-functional team that combines marketing and product.The use of qualitative research and quantitative data analysis (to gain insight into customer behaviors).The generation and testing of ideas (and the use of metrics to evaluate if they’re working).1. Creation of a cross-functional teamSince the goal of a growth marketing team is to work on the entire funnel, the team needs more than just people with marketing skills. Sean suggests the team should comprise the following:Growth lead – Chooses core focus area (any part of the funnel), selects metrics to measure, and manages the teamProduct manager – Manages the product and its changesSoftware engineer – Works on the product and executes experimentsMarketing specialist –Understands the different marketing channels and how to execute experimentsData analyst – Designs experiments, extracts data, and provides insightsProduct designer – Works on the product and designs a better experience2. Qualitative research and quantitative dataData is key to the growth marketing process. It should be easy to access and analyze. Plus, it should be accurate.Sean writes: It’s essential that your team have data on each piece of the customer experience—well beyond just how often they visit your website and how long they stay there—so that it can be analyzed at a granular level to identify how people are actually using your product versus how you have planned for them to use it. What this means is that the marketers, data scientists, and engineers must work together to add the proper tracking to websites, mobile apps, point of sale systems, email marketing and customer databases. Once proper tracking is in place, the multiple sources of user information must be stitched together to give you a detailed and robust picture of user behaviour that your data team can analyze. What you want to create is what’s often called a data lake/data warehouse: a single location where all customer information is stored and where you can really dive in and uncover distinctive groupings of users who may be using the product differently from other groups. Sean Ellis, Growth Marketer Seanellis.me3. Generation and testing of ideasGrowth marketing teams run through what is known as the growth hacking cycle.Here’s how the process works:Analyze – The growth lead works with the data analyst to uncover areas of growth opportunities. This could be any part of the funnel they want to focus on. For example, they may look at the events or pages that cause a user to churn or leave the product.Ideate – Members of the growth marketing team (including the product manager, software engineer, etc.) contribute ideas on how to improve the focus area into an idea pipeline.Prioritize – The ideas are scored according to Impact, Confidence, and Ease of Execution (ICE).Test – The experiment is conducted, and results are analyzed after a determined period of time.The cycle then repeats.Is growth marketing right for you?There is no doubt that growth marketing works. After all, many companies have succeeded by using it. Facebook, Twitter, DropBox, and Airbnb are well-known examples.However, observe closely, and you’ll realize most of the companies that have created successful growth marketing programs typically:Are consumer-facing.Have raised a lot of money.Have products that can generate virality, i.e., more users bring in more users.For most small businesses, growth marketing is likely out of reach. Lars Lofgren, who has built multiple growth teams himself, explains why in this post. Here’s a quick tl;dr:Probability is hard to understand – Most people don’t understand probability and statistics and will end up running bad tests. Bad tests lead to bad results, which lead to a poor program.Most companies don’t have enough data – Volumes of data are needed for accurate tests, but most companies will never get that much volume.Growth teams are too expensive – The amount of money you spend on building a growth team could easily allow you to build a blog that ranks high on Google and generates tons of organic traffic.Growth teams have limited revenue potential – There is a ceiling on how high conversion rates can go. Is spending all that money on optimizing these rates worth it?If growth marketing is not right for your business, what should you do instead?The alternative: Marketing with a growth-focused mindsetIn Lars’ post, he wrote:“A properly scaled marketing channel can 10X your business. Best case for a growth team that optimizes your funnel? 3X. I’d rather spend my time on a 10X strategy than a 3X one.”That’s exactly what we did at Ahrefs.Our main customer acquisition channel is content marketing. We produce content regularly on our blog and YouTube page. Over the past few years, we have built out this channel and continued investing in it.While nothing we do here is truly unique, we did add a twist to our content marketing strategy. That is, like growth marketing, our content is full-funnel focused. Rather than having separate pieces of content tackle each stage of the marketing funnel, each piece of our content serves to:Acquire new customers.Generate interest in our products by educating customers on what our product does.Retain our customers by educating them on how to better use our product.Here’s an example. Link building is a highly searched topic. It gets around 31,000 monthly searches on Google:It’s also impossible to do link building well without a backlink research tool—which is something we offer. So, in our link building guide, we naturally talk about our product:This one piece of content hits all parts of the funnel. It:Acquires new leads and customers – By ranking for a topic that many people search for on Google, we generate traffic consistently.Generates interest in our product – Our content teaches prospects how to do link building and how to do it with our product.Retains customers – Our content also teaches existing customers how to build links with our product.How do we do this? Here’s a quick explainer of our strategy.1. Target topics with search traffic potentialTo rank on Google, you need to target topics that people are already searching for. You can find these topics using keyword research tools like Ahrefs’ Keywords Explorer.Enter a relevant keyword, and it’ll generate thousands of ideas for you.Then, narrow the list down using “business potential.”This will allow you to focus on topics that drive growth, not vanity metrics like traffic.2. Create high-quality content that deserves to rankTo rank at the top of Google, you’ll need to create content that deserves to rank. Watch this video to learn how.Further readingContent Creation: The Complete Guide for BeginnersWhat is SEO Content? How to Write Content that RanksHow to Write a Blog Post in 9 Steps (That People Actually Want to Read)3. Promote the contentSimply publishing content doesn’t mean it’ll get discovered automatically. You have to give it a push and show it to people who care. Promote your content by following this checklist.Final thoughtsThe growth marketing process can be difficult to implement. But even if you’re not doing it, elements of it are still helpful. Experimentation, tackling the full funnel—these are all ideas you can apply to your own business.If you’re interested in learning how to execute growth marketing, I’d recommend these resources:Hacking Growth (book)ReforgeGrowthHackersGrowth Marketing Handbook Did I miss out on anything about growth marketing? Let me know on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Keep Learning The Beginner’s Guide to Account-Based Marketing (ABM) Account-based marketing (ABM) is a type of B2B marketing that focuses on aligning marketing and sales to reach specific target accounts. B2B Marketing: The Beginner’s Guide B2B marketing (short for business-to-business marketing) is the process of promoting products or services to another business or organization. The Beginner’s Guide to Lifecycle Marketing Lifecycle marketing is the process of matching the type of communication a customer wants to see as they progress along their lifecycle. 9 SaaS Marketing Strategies for Sustainable Growth Seeking to generate long-term value? Here are nine marketing strategies that will help you maintain sustainable growth. Digital PR: The Beginner’s Guide to Making Your Brand Unmissable All you need to know about digital PR (including its downsides), plus top tips from someone who specializes in digital PR for SEO.",
  "headers": [
    {
      "level": "H1",
      "text": "What Is Growth Marketing? A Beginner’s Guide"
    },
    {
      "level": "H2",
      "text": "What is growth marketing?"
    },
    {
      "level": "H2",
      "text": "Why is growth marketing important?"
    },
    {
      "level": "H3",
      "text": "1. Cross-collaboration between teams is (almost) non-existent"
    },
    {
      "level": "H3",
      "text": "2. Marketing teams often have no idea what’s working"
    },
    {
      "level": "H2",
      "text": "How does growth marketing work?"
    },
    {
      "level": "H3",
      "text": "1. Creation of a cross-functional team"
    },
    {
      "level": "H3",
      "text": "2. Qualitative research and quantitative data"
    },
    {
      "level": "H3",
      "text": "3. Generation and testing of ideas"
    },
    {
      "level": "H2",
      "text": "Is growth marketing right for you?"
    },
    {
      "level": "H2",
      "text": "The alternative: Marketing with a growth-focused mindset"
    },
    {
      "level": "H3",
      "text": "1. Target topics with search traffic potential"
    },
    {
      "level": "H3",
      "text": "2. Create high-quality content that deserves to rank"
    },
    {
      "level": "H3",
      "text": "3. Promote the content"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Si Quan Ong"
}