{
  "url": "https://ahrefs.com/blog/growth-hacking/",
  "slug": "growth-hacking",
  "title": "What Is Growth Hacking? Is It Still Worth It?",
  "description": "Growth hacking is a marketing approach that involves scrappy, low-cost tactics to rapidly grow a company’s revenue.",
  "content": "Bill Widmer 8+ years as a digital nomad, Bill is on a mission to travel the world and fund it using SEO and content marketing. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Growth hacking has long been touted as a “unicorn” marketing strategy that rapidly grows a company’s sales through the roof.But does growth hacking still work after a decade since the term “growth hacker” was coined?In this guide, you will learn what growth hacking is, where it originated, and whether or not it still works today. Then I’ll share five marketing channels every company should be focusing on regardless of the “growth hacking” label.ContentsWhat is growth hacking?Growth hacking (aka growth marketing) is a marketing approach that involves scrappy, low-cost tactics to rapidly grow a company’s revenue. Sean Ellis coined the term “growth hacker” in 2010 as “a person whose true north is growth.” They are someone who uses creative means to figure out unique ways of driving growth for a company, as well as A/B tests and scales what has been proven to work by competitors.Example of growth hackingOne of the most famous examples of growth hacking is Airbnb’s use of Craigslist to advertise its services in the early days of its business.It built in the ability for its users to easily post their Airbnb listing on Craigslist to get more eyeballs on it, as Craigslist already had a massive user base. This was the kind of creative, scrappy thinking that made growth hacking so popular in the 2010s. It didn’t cost anything but had a massive boost on the bottom line.Do growth hacking tactics still work today?Short answer: sort of.Longer answer: If you are creative, you can absolutely come up with unique ways of marketing your business for little-to-no cost. It’s similar to old-school guerrilla marketing—doing things in a creative way to draw attention to your business. Like this marketing hack the team behind the movie “IT” used for the premiere:Growth hacking is nothing new; sure, the term was coined just over a decade ago. But you can see examples of these guerrilla marketing–style tactics as early as humans started creating and growing businesses.The known strategies of “growth hacking” may be outdated, but creative and growth-minded individuals can always find ways to succeed on a budget.The problem is that any growth hacks you find on the internet probably won’t work that well anymore. This is because they have already been done and have, thus, lost their effectiveness as other companies caught on and used the tactics themselves.Instead, allow yourself to think in terms of a scrappy startup and come up with creative ways to market your business at a low cost… but don’t try to copy growth hacks that have already been overdone.So what else can you do?Why you should primarily focus on brand-building instead of “quick win” tacticsThe biggest issue with growth hacking is that it’s focused on quick wins that don’t often have long-term viability.Sure, you may get a quick influx of sales from a growth hacking tactic. But if you want your business to survive and thrive in the long term, you also need to focus on building and growing a reputable brand as well.One way of doing this is by creating an integrated marketing communications (IMC) strategy. IMC is the process of unifying a brand’s messaging to make it consistent across all media that the brand uses to reach its target audience. In today’s world of digital marketing, it’s crucial for brands to market across all the channels available to them in order to reach the largest possible audience. With an IMC strategy, you can utilize all these channels while keeping your messaging consistent throughout the entire customer journey. This includes both growth hacking tactics and long-term, brand-focused marketing.The best approach we’ve seen is the 60/40 split that Les Binet and Peter Field came up with. Their research found that you should generally spend 60% of your advertising budget on brand-building and the remaining 40% on uplifting sales.The 40% spent on short-term sales growth will obviously increase your revenue in the short term more than your brand-building spend. However, over time, you will see a greater lift in sales from the branding efforts than any short-term marketing strategy.For simplicity’s sake, let’s say you have a $1,000 marketing budget. In this case, you could spend 40% ($400) on paid advertising for short-term sales and the remaining 60% ($600) on brand-building activities like sponsorships, growing a YouTube channel, or becoming a guest on well-known blogs and podcasts in your space.But how do you know which activities to put that money into? That’s where your marketing funnel comes in.A quick overview of the marketing funnelYour marketing funnel shows the four stages of your target audience as they go from being strangers to being customers. These stages are:AwarenessInterestConsiderationConversionHere’s a visual of how this works:In the next section, I will talk about five marketing channels you can use instead of growth hacking and which stages each of those channels encompasses.Five marketing channels to focus on instead of “growth hacking”If you’re ready to build a brand that can last a lifetime, the following five marketing channels are something you need to focus on—that can also give you rapid growth if implemented well.For each channel, I’ll discuss what part of the marketing funnel it is in, link off to guides on how to do it, and share a “quick win” growth hacking tactic you can try.1. Paid search marketingThe first and most obvious marketing channel for rapid growth is running Google Ads. Like all PPC advertising, however, this advertising platform may not yield the highest ROI due to the high costs of ads. But it is an almost guaranteed way to bring in sales quickly, as it focuses on the last two stages of the marketing funnel: Consideration and Conversion.You run ads to keywords people are most likely to buy from when they search them.Growth hacking PPC: One of the best ways to find instant-win PPC keywords to target is with competitive analysis, i.e., looking at the keywords your competitors are spending money on and piggybacking off them.The easiest way to see what keywords a competitor is bidding on is by plugging its site into Ahrefs’ Site Explorer and clicking the “Paid keywords” tool.Here, you’ll see all the keywords it’s bidding on, as well as the estimated traffic it receives from that keyword and the URL of its landing pages.You can then just reverse engineer the keywords and landing pages to create your own campaigns. While this doesn’t guarantee you’ll be successful, it does increase your chances and makes it so you can jump into PPC without a ton of research.2. Search engine optimizationSearch engine optimization (SEO) is not usually about rapid growth. It takes at least 12 months, on average, for a new website to start ranking on the front page of Google. For more established websites, it’s usually three to six months.However, it is a great way to acquire organic, recurring, and free customers once you have it set up. It is a crucial piece of every good marketing strategy.You can also target keywords for every part of the funnel, making it a very diverse channel.Growth hacking SEO: While SEO may take time to get going, there are some things you can do to make it work faster. One way of growth hacking SEO is to focus on your internal link structure.Link building is known to be one of the most important ranking signals to show up on Google’s first page. However, many people don’t realize just how important their own internal links are as well. It’s almost like link building that you have direct control over.You can do an internal link audit easily by plugging your site into Ahrefs’ Site Audit. From there, you can see broken internal links, internal links that point to redirects, or opportunities where you may add relevant links between your pages, as shown in the screenshot below. You can learn exactly how to do each of these (and how to fix them) by heading over to our guide to internal linking for SEO.3. Email marketingEmail is one of the last online marketing channels left that you have full control over. Unlike paid ads (which require a constant ad budget) or social media and SEO (which are out of your control and can change at any time), you are always able to send emails to your list.Depending on how you build and segment your list, email can be used at every stage of the marketing funnel. For example, you can capture emails by offering discounts, which can get people in the Conversion stage to buy. Or you can get people on your list by offering a guide on how to solve the problem they came to your website to solve, which can be from the Awareness through the Consideration stages, depending on how you set it up.Growth hacking email: One of the quickest ways to grow your email list is with targeted content upgrades. A content upgrade is a resource—and a direct upgrade to the content a reader is consuming—you offer in exchange for their email.For example, Sumo has an article about how to write a newsletter. In that article, it offers an “email swipe file” with templates to send to your list—in exchange for your email address.Ready to try this tactic? Here’s our guide.4. Paid social media marketingLet’s face it—organic social media reach is dead. Getting organic views on anything besides TikTok and LinkedIn right now is a constant uphill battle.However, paid social media advertising still works. No wonder—it’s how they make their money.These ads can be used for any part of the funnel, but they will be most effective in the Consideration and Conversion portion due to the high costs of ads.Growth hacking social media ads: Right now, video is the most effective marketing tool on social media. Short, highly engaging videos are getting more engagement and reach than any other type of content.This is equally true for paid ads. Having paid ads to a short video is one of the best ways to improve your ROI.Hunch Ads has a great guide to paid social media advertising if you want to add this channel to your marketing repertoire.5. Conversion rate optimizationFinally, one of the most immediately effective methods to quickly increase your sales is through conversion rate optimization (CRO).CRO is the practice of testing variations on your landing pages—such as call to actions (CTAs), colors, order of content, etc.—in order to increase the percentage of conversions from that page.If you already have a decent amount of traffic (at least a few thousand per month to start, typically), you can use CRO to improve your sales with minimal effort.Growth hacking CRO: The best way to quickly find opportunities to improve conversions is by looking at your top landing pages in Google Analytics, then tweaking the offers on those pages.For example, I changed a CTA box on one of my clients’ websites and was able to achieve a 31.76% increase in the conversion rate on their site—all from about 10 minutes of work!All I did was swap their original CTA box for one that looked more professional and inviting (using Canva to create it).Ready to try CRO for yourself? I recommend checking out Hotjar’s guide.Final thoughtsGrowth hacking is an outdated term, but the concept still remains useful. Using creativity to quickly grow your company with a small budget is never a bad idea.However, to stay relevant in the long term, you should mix your quick-growth efforts with brand-building and longer-term marketing channels like SEO.Itching to learn more? Check out these other guides:Marketing 101: The Basics Every Business Owner Should Know11 Internet Marketing Strategies That WorkHow to Create a Winning Marketing Strategy in 5 Steps (With Examples) Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Keep Learning What Is Growth Marketing? A Beginner’s Guide What is growth marketing and how does it work? Is it right for your business? Learn everything you need to know in this post. 9 SaaS Marketing Strategies for Sustainable Growth Seeking to generate long-term value? Here are nine marketing strategies that will help you maintain sustainable growth.",
  "headers": [
    {
      "level": "H1",
      "text": "What Is Growth Hacking? Is It Still Worth It?"
    },
    {
      "level": "H2",
      "text": "What is growth hacking?"
    },
    {
      "level": "H3",
      "text": "Example of growth hacking"
    },
    {
      "level": "H2",
      "text": "Do growth hacking tactics still work today?"
    },
    {
      "level": "H2",
      "text": "Why you should primarily focus on brand-building instead of “quick win” tactics"
    },
    {
      "level": "H3",
      "text": "A quick overview of the marketing funnel"
    },
    {
      "level": "H2",
      "text": "Five marketing channels to focus on instead of “growth hacking”"
    },
    {
      "level": "H3",
      "text": "1. Paid search marketing"
    },
    {
      "level": "H3",
      "text": "2. Search engine optimization"
    },
    {
      "level": "H3",
      "text": "3. Email marketing"
    },
    {
      "level": "H3",
      "text": "4. Paid social media marketing"
    },
    {
      "level": "H3",
      "text": "5. Conversion rate optimization"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Bill Widmer"
}