{
  "url": "https://ahrefs.com/blog/haro-alternatives/",
  "slug": "haro-alternatives",
  "title": "HARO: Is It Alternatives You’re Looking For?",
  "description": "We surveyed HARO users to find the best replacement for HARO. Here are the results.",
  "content": "Chris Haines Chris is an SEO director who has 10 years of experience in SEO, agency side. When not involved in SEO, he enjoys messing around with vintage synthesizers, walks on sandy beaches, and a good cup of tea. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents You probably clicked this result because a) you appreciate a good Lionel Ritchie pun, or b) you’ve heard that HARO is dead and want some alternatives—hopefully both.Whatever the reason, in this article, I’ll share some alternatives to HARO and a few extra ways to get expert quotes and backlinks for your website.ContentsBest HARO alternatives (as voted for by ‘new HARO’ users)Disclaimer: I am not a PR expert. I did a bit of outreach a few years ago, but I have only been an occasional user of HARO in the past year or so.So, rather than providing my opinion on the best alternatives to HARO, I thought it would be fun to ask users of the “new HARO” what they thought were the best alternatives.I wanted to give the “new HARO”—Connectively—the benefit of the doubt.Still, a few minutes after my pitch was accepted, I got two responses that appeared to be AI-generated from two “visionary directors,” both with “extensive experience.”My experience of Connectively so far mirrored Josh’s experience of old HARO: The responses were most likely automated.Although I was off to a bad start, looking through most of the responses afterward, these two were the only blatant automated pitches I could spot.These responses weren’t included in my survey, and anyone who saw my pitch would have to copy and paste the survey link to complete it—increasing the chance of genuine human responses—hopefully.So, without further ado, here are the results of the survey.Sidenote. The survey on Connectively ran for a week and received 101 votes. Respondents could vote for their top three HARO alternatives.1. Help a B2B WriterPrice: Free.Help a B2B Writer was the #1 alternative platform respondents recommended. In my survey it got 22% of the vote.Help a B2B Writer is a platform run by Superpath that is similar to HARO but focused on connecting business-to-business (B2B) journalists with industry experts and sources for their stories.2. FeaturedPrice: Free and paid plans. Paid plans start at $99 per month.Coming in joint second place, Featured was popular, scoring 18% of the vote.Featured connects journalists with experts and thought leaders. It allows experts to create profiles showcasing their expertise and helps journalists find suitable sources for their stories.3. QwotedPrice: Free and paid plans. Paid plans start at $99 per month.Qwoted is another platform that I’ve heard talked about a lot. It came in joint second place, scoring 18% of the vote.Qwoted matches journalists with expert sources, allowing them to collaborate on creating high-quality content. It streamlines the process of finding and connecting with relevant sources.4. ConnectivelyPrice: Free for ten pitches per monthDespite being the “new HARO,” Connectively came 4th on my list, scoring 12% of the vote—surprisingly, it wasn’t even the top choice for most users on its own platform.Connectively connects journalists with sources and experts. It helps journalists find relevant sources for their stories and allows experts to gain media exposure.5. SourceBottlePrice: Free and paid plans. Paid plans start at $5.95 per month.SourceBottle is an online platform that connects journalists, bloggers, and media professionals with expert sources. It allows experts to pitch their ideas and insights to journalists looking for story sources. It scored 9% of the vote in my survey.6. JournoRequestPrice: Free.JournoRequest is an X account that shares journalist requests for sources. UK-based journalists and experts often use it, but it can sometimes have international reach. It scored 7% of the vote in my survey.7. ProfNetPrice: Paid. Plans start at $1,150 per year.ProfNet connects journalists to expert sources. It helps journalists find knowledgeable sources for their articles, interviews, and other media content. It helps subject matter experts gain media exposure and share their expertise. It scored 5% of the vote in my survey.8. JustReachOutPrice: 7-day free trial and paid plans. Paid plans start at $147 per month.JustReachOut is a PR and influencer outreach platform that helps businesses find and connect with relevant journalists and influencers. It provides tools for personalized outreach and relationship management. It scored 3% of the vote in my survey.9. OnePitchPrice: 14-day free trial and paid plans. Paid plans start at $50 per month.OnePitch is a platform that simplifies the process of pitching story ideas to journalists. Businesses and PR professionals can create and send targeted pitches to relevant media outlets. It scored 3% of the vote in my survey.10. PitchRatePrice: Free.PitchRate is a free PR tool that connects journalists and highly rated experts. Useful for subject matter experts looking for free PR leads, media coverage, or publicity. Or journalists looking for credible sources. It scored 1% of the vote in my survey.11. ResponseSourcePrice: Free and paid plans. Paid plans start at ~$105 per month.A UK service that connects media professionals with expert sources, press releases, and PR contacts. It scored 1% of the vote in my survey.12. Forbes CouncilsPrice: Invitation-only platform.Forbes Councils is an invitation-only community for executives and entrepreneurs. Members can contribute expert insights and thought leadership content to Forbes.com and gain media exposure. It scored 1% of the vote in my survey.13. HERO (Help Every Reporter Out)Price: Free.Yes, you read that right.HERO was created by Peter Shankman, the original creator of HARO, who said the platform will always be free. It scored 1% of the vote in my survey.Peter set up the platform after receiving over 2,000 emails asking him to build a new version of HARO.14. MeltwaterPrice: Paid. Sign up for details.Meltwater received no votes in my survey, but I included it because I’d seen it shared on social media as a paid alternative to HARO.It’s a media intelligence and social media monitoring platform. It provides tools for tracking media coverage, analyzing sentiment, and identifying influencers and journalists for outreach.15. Expertise FinderPrice: Free.Expertise Finder also received no votes in my survey, but it was included as I saw it had been recommended as an HARO alternative on LinkedIn. It’s a platform that helps journalists find and connect with expert sources from universities.More ways to get expert quotes and backlinksHARO had a dual purpose for SEOs: it was a place to acquire links, but it also was a place to get expert quotes on topics for your next article.Here are a few more free methods outside the platforms we’ve covered that can help you get expert quotes and links.1. Follow X’s “request” hashtagsWe’ve already seen that JournoRequest is a popular X account that shares journalist requests for sources.But you can also follow hashtags on X to access even more opportunities.Here are my favorite hashtags to follow:#JournoRequest#PRrequest #BloggerRequest#HelpareporterI used to track the #journorequest hashtag to find opportunities for my clients when I worked agency-side, so I know it can work well for quotes and link acquisition.Here are two opportunities I found just checking the #journorequest hashtag:Here’s another example from the Telegraph—a DR 92 website:2. Create targeted content that naturally acquires linksCertain types of content are more likely to be shared by journalists and PRs than others.One of these types of content is statistics-based content. The reason? Journalists often use statistics to support their points.Once they have included your statistic in their post, they often add a backlink back to your post.We tested this with our SEO statistics post, and as you can see, it still ranks number one in Google.3. Use Ahrefs’ Linking authors reportAnother method is to use the Linking authors report in Ahrefs’ Site Explorer. This report shows the authors’ names who link to any website you enter.You can see which authors link to their site by entering your competitor’s domain. Some of these authors may represent outreach opportunities for your website as well.Head to Site Explorer, click on Linking authorsType in your competitor’s URLContact any authors that you think may be interested in your website and its contentTipIf you download your website’s linking authors and your competitors into a spreadsheet and put them into separate tabs, you can compare the lists to see which authors are only linking to your competitor’s website.4. Check out Jolly SEO’s top three platformsWhen I was about to wrap up this article, I was contacted by Greg Heilers of Jolly SEO on LinkedIn.He said he’d sent 200,000+ pitches over the years and wanted to share the results with me.These are his last 1,000 wins he earned. Interestingly, we can see that it’s similar to my much smaller-scale survey.Ordered by number of link placements. Average Domain Rating from Ahrefs. Average organic traffic from Ahrefs.Hopefully, the data here speaks for itself. The high-quality links and traffic from HARO alternatives is considerable.This research shows that Featured gained the most link placements in this campaign.5. Use Ahrefs’ link building resourcesWe have compiled some helpful content related to link building that you can get your teeth into. These hand-picked guides will take you from beginner to expert in no time.Here are my favorite resources on this topic:Further readingLink Building for SEO: The Beginner’s Guide9 Easy Link Building Strategies (That Anyone Can Use)How to Get Backlinks: Add, Ask, Earn, BuyResource Page Link Building: The Only Guide You NeedAdvanced Link Building Course: 14 Free Training VideosFinal thoughtsThere are many options for sourcing expert quotes and getting links for your next marketing campaigns. HARO may be dead, but its legacy lives on.My highly unscientific survey suggests that most “new HARO” users liked Help a B2B Writer the most, but for HARO purists, there really is only one choice—HERO.Give your favorites from this list a whirl, and let me know if you have any success. Got more questions? Ping me on X. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Chris Haines Chris is an SEO director who has 10 years of experience in SEO, agency side. When not involved in SEO, he enjoys messing around with vintage synthesizers, walks on sandy beaches, and a good cup of tea. Keep Learning The Best of Ahrefs’ Digest: June 2024 Discover our favourite reads from the past month.",
  "headers": [
    {
      "level": "H1",
      "text": "HARO: Is It Alternatives You’re Looking For?"
    },
    {
      "level": "H2",
      "text": "Best HARO alternatives (as voted for by ‘new HARO’ users)"
    },
    {
      "level": "H3",
      "text": "1. Help a B2B Writer"
    },
    {
      "level": "H3",
      "text": "2. Featured"
    },
    {
      "level": "H3",
      "text": "3. Qwoted"
    },
    {
      "level": "H3",
      "text": "4. Connectively"
    },
    {
      "level": "H3",
      "text": "5. SourceBottle"
    },
    {
      "level": "H3",
      "text": "6. JournoRequest"
    },
    {
      "level": "H3",
      "text": "7. ProfNet"
    },
    {
      "level": "H3",
      "text": "8. JustReachOut"
    },
    {
      "level": "H3",
      "text": "9. OnePitch"
    },
    {
      "level": "H3",
      "text": "10. PitchRate"
    },
    {
      "level": "H3",
      "text": "11. ResponseSource"
    },
    {
      "level": "H3",
      "text": "12. Forbes Councils"
    },
    {
      "level": "H3",
      "text": "13. HERO (Help Every Reporter Out)"
    },
    {
      "level": "H3",
      "text": "14. Meltwater"
    },
    {
      "level": "H3",
      "text": "15. Expertise Finder"
    },
    {
      "level": "H2",
      "text": "More ways to get expert quotes and backlinks"
    },
    {
      "level": "H3",
      "text": "1. Follow X’s “request” hashtags"
    },
    {
      "level": "H3",
      "text": "2. Create targeted content that naturally acquires links"
    },
    {
      "level": "H3",
      "text": "3. Use Ahrefs’ Linking authors report"
    },
    {
      "level": "H3",
      "text": "4. Check out Jolly SEO’s top three platforms"
    },
    {
      "level": "H3",
      "text": "5. Use Ahrefs’ link building resources"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Chris Haines"
}