{
  "url": "https://ahrefs.com/blog/healthcare-seo/",
  "slug": "healthcare-seo",
  "title": "Healthcare SEO: 7 Strategies From Medical SEO Pros",
  "description": "Healthcare SEO has unique challenges. Here's how the pros solve them.",
  "content": "Ryan Law Ryan Law is the Director of Content Marketing at Ahrefs. Ryan has 13 years experience as a writer, content strategist, team lead, marketing director, VP, CMO, and agency founder. He's helped dozens of companies improve their content marketing and SEO, including Google, Zapier, GoDaddy, Clearbit, and Algolia. He's also a novelist and the creator of two content marketing courses. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Healthcare SEO is the secret to helping your organization reach more patients and clients.SEO can help you rank for useful keywords, connect with patients in your local area, and share helpful information and advice with thousands of people.To write this guide to medical SEO, we interviewed five experienced healthcare SEOs and content creators. We asked them to share their best advice for helping healthcare businesses grow through effective, ethical SEO:Caitlin Burns, Content and SEO Lead at Dovetail (ex-HealthMatch)Geoff Meakin, The Healthcare SEOVirginia Chachati, MPharm, pharmacist and healthcare content creatorSarah Ziani, Growth Marketing Manager, SEO & Content at Hinge HealthDespina Gayovannis, Senior SEO at AhrefsContentsThe unique challenges of healthcare SEO strategyThe core principles of SEO are the same for every type of company. You need to create high-quality content, earn backlinks, and make sure your site is free of technical problems.But healthcare SEO has some unique challenges:Popular keywords are dominated by huge international brands.Many healthcare companies only serve a particular local area.Google expects medical content to be reviewed by healthcare experts.There can be strict rules and regulations governing how medical information is shared.Healthcare companies often need to market simultaneously to patients, businesses, and clinicians.In this article, we’ll show you how to solve these problems: from building .gov backlinks to medically reviewing your content.New to SEO?If you’re brand new to SEO, check out The Beginner’s Guide to SEO.1. Get your content medically reviewed (and embrace EEAT)Content creation is a core part of healthcare marketing, but most medical topics are what Google calls YMYL topics—Your Money or Your Life.For any topic that “could significantly impact the health, financial stability, or safety of people”, Google tries to prioritize content that demonstrates obvious expertise, experience, authority, and trust (also known as EEAT).In practice, that means that most top-ranking medical content is reviewed by medical experts. Here are some of the top results from the SERP (search engine results page) for osteoarthritis treatments.Healthline lists the author bios and medical reviewers for each article:Cleveland Clinic includes a “medically reviewed” badge, and links to a list of editorial standards:WebMD highlights each post’s medical reviewer:And The Mayo Clinic links to their huge list of medical editors:Medical review is so common across health-related SERPs that Caitlin adopted a simple rule for her content creation process: get every article medically reviewed—even a topic like drinking water to lose weight.If creating hundreds of articles and subjecting them to rigorous medical review sounds complicated, well… it can be. Here’s how the experts handle it:Create content with non-expertsYou might think that all medical content needs to be written by medical experts, but after talking to our experts, most articles were created by writers with no medical qualifications—or even generated with AI.For many medical topics, it’s easy to find objective, accurate information. Add in a few interviews with healthcare professionals—as Sarah asks her team of freelance writers to do—and properly cite medical references, and non-experts can write decent SEO content.For more research-heavy or cutting-edge topics, it’s necessary to do deeper research and work with specialized medical writers. Here’s how Caitlin tackled this process, dividing her content into two “buckets”:Common knowledge topics (~70% of all articles): for topics with lots of existing information, Caitlin worked with the content marketing agency Verblio. In a similar vein, Geoff uses AI to write straightforward first drafts.Cutting-edge topics (~30% of all articles): for topics that required heavy research (like the impact of CBD oil on anxiety), Caitlin worked with a specialized medical writer from the agency Writing Studio. When writing about ozempic, Sarah sought feedback from four separate professionals.Source expert medical reviewersThe SEOs I interviewed sourced their medical reviewers in two different ways:In-house experts: Sarah at Hinge Health had content reviewed by “in-house, member-facing employees”, a mixture of physical therapists, medical reviewers and clinical reviewers depending on the topic.Freelancers: Without the luxury of in-house experts, Caitlin built a network of freelance doctors on Upwork. These were generally fully licensed doctors and medical professionals, half from within the United States and half from other countries.In all cases, Caitlin notes, it’s important to ask your medical reviewers to check their indemnity insurance. In most countries, clinicians are accountable to medical regulators. Once they put their byline on an article, they are responsible for the advice it offers.Review for medical accuracyMedical reviewers should vet your content for accuracy and suggest edits where needed. That often means:Flagging errors and misinformation (like incorrect medical terminology).Adding extra context and information (like extra details about symptoms or treatments).Softening language (avoiding phrases like “best treatment” or “guaranteed to work”).Caitlin’s workflow looks like this:Learn more about Caitlin’s process in our article, 7 Content Automations used by Real Content Pros.Publish with clear author and reviewer attributionIt’s crucial to make the medical review as obvious to readers and search engines as possible. Here’s a great example from Caitlin’s previous company, HealthMatch:And another from Sarah’s company, Hinge Health:These examples highlight three best practices:Include a clear, obvious reviewer bio on every article, including their photograph, name, qualifications, and even their area of medical speciality.Link to a dedicated reviewer page, showing the author’s credentials and past experience, and linking to other relevant bylines on the web.Use relevant schema data for the authors and reviewers (but more on that later).2. Target low-competition keywords before challenging healthcare giantsEveryone I interviewed shared the same core challenge: medical SEO is dominated by a handful of internationally recognized brands, like Cleveland Clinic, Healthline, WebMD, NHS, and Mayo Clinic.With strong link profiles and brand recognition, these companies generally dominate most healthcare SERPs.A 92 DR score means these companies can be very difficult to compete against in the search results.To work around this constraint, everyone I interviewed chose to focus on low-competition long-tail keywords, before gradually targeting more competitive terms as they started to see results.You can find these terms easily with Ahrefs. To start, here’s a short-tail keyword, headache, with 121,000 monthly searches and a “Super hard” keyword difficulty:A top-three ranking would be out of reach for most companies, but we can use the Related terms report in Keywords Explorer to find less competitive variations that might be worth targeting.Here, we’ve set the keyword difficulty to a maximum of 40, and surfaced 976 keywords:To stand an even better chance of ranking, we can also filter our results with the Lowest DR filter. In the screenshot below, we’ve limited our search solely to keywords that already have low DR websites (in this case, <30) ranking in the top five.In other words, these are all keywords a fledgling website would have an excellent chance of ranking for:3. Build topic clusters for key medical conditionsThe topic cluster framework is a way to organize and link between related articles on a website. It makes it easy for both visitors and search engines to easily navigate between related content—other relevant articles are only a single click away.Caitlin explained that healthcare is “natively suited” to the topic clustering technique. Every medical condition generally has a similar set of patient questions associated with it, making it easy to use similar content templates for many different medical conditions.Geoff shared a framework he commonly uses with his healthcare clients. For most medical conditions, you can usually group your content into three topic clusters: pre-intervention, intra-intervention, and post-intervention:Pre-interventionThese are questions people ask before treatment or surgery:Diagnosis: do I need a hip replacementTreatment options: which method of hip replacement is the best?Cost: how much does a hip replacement costImages: hip replacement surgery picturesOutcomes: how long does a hip replacement lastIntra-interventionThese are questions people ask about the treatment or surgery itself:Anesthesia: are you awake during hip replacement surgeryDuration: how long does hip replacement surgery takePost-interventionThese are questions people ask after having treatment:Recovery period: how long to recover from hip replacementAnxieties: what are the symptoms of nerve damage after hip replacement“Can I do X”: how long after hip replacement can you driveYou can use Ahrefs to research these topic clusters.Start by entering a medical condition or topic into Keywords Explorer. Click the Matching terms report to see similar keywords, and then Questions to find related keywords in the form of, you guessed it, questions:Here, we’re looking at hip replacement.With this process, we’ve already found 5,163 keywords relating to hip replacements, like how long does a hip replacement last and how long after hip replacement can i tie my shoes:You can click Clusters by Parent Topic to group these keywords together into clusters, groups of keywords that can likely be targeted by the same article. Now we’ve refined our list of potential articles from 5,000 down to 270:4. Build links by showcasing your healthcare research and innovationsBacklinks are a core component of effective SEO—and that remains true in healthcare SEO.If the idea of doing “shady” outreach for a healthcare company gives you shivers, don’t worry: healthcare companies have unique strengths that make it relatively easy to build great backlinks.Many healthcare companies have strong relationships with government bodies, charitable organizations, and educational institutions, making it possible to earn links from high-DR .gov and .edu domains.Despina shared the example of HammondCare, an Australian aged care provider. A quick look at their backlink profile reveals 33 referring .gov domains:They’ve also snagged 24 referring .edu domains:Looking at their backlink profile as a whole, we can identify several easy-to-replicate strategies suitable for all types of healthcare companies:Ask your practitioners to speak at conferences, like the International Dementia Conference, and ask for a link from the organizers.Share your volunteer programs or social clubs with your local government, like Northern Beaches Council, and ask for a link promoting it.Request listings in government directories, like myagedcare.gov.au.Publish research papers to relevant journals and organizations, like Dementia Centre for Research Collaboration, and reference your company in the author information.Collaborate with other institutions, like this research report authored with the University of Sydney.As Despina pointed out, most healthcare providers are already sitting on a small goldmine of interesting research and accomplishments. Link building can be as simple as asking: what have we already done that we can use to get links?5. Find local patients by optimizing for local SEOMany healthcare organizations are local businesses with bricks-and-mortar premises. The process of attracting interest in a specific area is known as local SEO (and we have a full guide here: Local SEO: The Complete Guide).There are three local SEO strategies that are particularly crucial for healthcare companies: optimizing your Google My Business profile, building NAP citations in healthcare directories, and building local landing pages.Optimize your Google My Business profileMost local searches include a “map pack”, a collection of top local business listings in your area. To stand a chance of appearing in these results, you’ll need to claim and optimize your Google My Business (GMB) profile.Once you’ve claimed your profile (head to https://www.google.com/business/ and click “Manage now”), you’ll need to fill out as much relevant information as possible:Business or practice nameAddressPhone numberWebsiteBusiness type (the more specific, the better: orthopedic surgeon is better than surgeon or doctor)Hours of operationMedical services offeredPhotos of your practice and teamDepending on the nature of your healthcare organization, there may be other types of information you can share. Here’s the GMB profile for The Royal London Hospital, complete with hospital-specific profile information, like number of beds and parent organization:For a detailed walkthrough of setting up your GMB profile, read our guide: How to Optimize Your Google My Business Listing in 30 Minutes.Be careful when asking for reviewsEarning and responding to reviews is a key part of managing your Google My Business Profile… but there’s a catch for healthcare companies.In many countries, there are strict rules and regulations dictating how healthcare providers can (or cannot) solicit reviews from patients.So before you hand out a hundred feedback leaflets to your patients, read up on laws and regulations (like HIPPA) in your location.Build NAP citations and submit your company to healthcare directoriesNAP citations refer to mentions of your organization on relevant third-party websites (including your organization’s name, address, and phone number—hence NAP).These citations create more ways for potential customers to find you, and they can help improve your site’s overall search performance.As a starting point, get your healthcare company listed with the main data aggregators (sites that provide business listings to popular directories), like Data Axle, Localeze, and Foursquare.It’s also worth getting listed on other popular websites like Apple Maps, Yelp, Yellow Pages, Bing Places, and Facebook.Geoff shared some of the UK-specific medical directories he sees most often in local healthcare search results (in many cases, these directories have international versions too):DoctifyTop DoctorsIWantGreatCareCyclexYou can learn more about building NAP citations in our guide: How to Build Local Citations (Complete Guide).TipYou can use the Link Intersect report in Ahrefs to quickly find relevant medical directories. Enter the homepages for similar healthcare organizations and hit “Show link opportunities.” You’ll see a list of websites that link to some—or all—of these competitors.Here I’ve run the report using three private hospitals from my local area:Based on this result, I’d immediately try to secure a link from the CQC (the UK’s independent healthcare regulator) and Doctify (a review and feedback platform specifically for the healthcare industry).Create locations and services pagesDespina recommends that most healthcare organizations create location landing pages: web pages that tell visitors (and Google) where your business operates.Here’s an example from my local sports physiotherapy clinic. For each of the major locations they serve, they’ve created a dedicated website page.Here’s one focused on the town of Aylesbury, helping them to rank for keywords like “physiotherapy aylesbury”:To create great location pages, Despina shares her advice:Use a localized URL structure, like website.com/service/location.Localize your page’s title tags and page header, like Aylesbury Sport Physiotherapy | Elite Sports Expertise.Include sign-up buttons and contact forms near the start of the page (“above the fold”).Showcase social proof, reviews and images.Link between your location pages to help visitors find the best location for their needs (and improve your chances of ranking for location-specific keywords).Read Despina’s deep-dive into location landing pages: Location Landing Pages: 6 Crucial Elements Of Local Visibility.6. Use medical schema markupSchema markup is a type of code that allows search engines to better understand the contents of your page. Schema markup can sometimes make your page eligible for rich results, which can help you earn more clicks from search.Schema markup is particularly important for local businesses. After searching for family practice physician near me, the top spot in the search results is taken up by a local pack SERP feature:One of the top results is using Physician schema markup—a specific schema type designed to tell Google that the author is a doctor:Here’s the top result for private hospital near me using another type of medical schema markup, Hospital:Schema.org also lists a few other medical-specific schema types, like MedicalCondition (for information about specific medical conditions), Drug (for information about a medical drug), and MedicalWebPage (for webpages about specific medical topics).Here’s the NHS using the MedicalWebPage schema on their #2 ranking article about hip replacement:(Although the #1 ranking article from Johns Hopkins doesn’t use any schema—so although it’s useful, using relevant medical schema is obviously not essential for good search performance.)7. Get ahead by opting into medical certification schemesThe healthcare industry has largely relied on self-regulation to prevent the spread of inaccurate content and misinformation, but this is changing.We’ve already covered Google’s increasing emphasis on EEAT in search content. In a similar vein, Virginia shared that YouTube (also owned by Google) has started to verify content from medical professionals:Medical video content with a “From a licensed doctor in the UK” banner.They promote this content more heavily through their “Health shelf” feature. Here’s the YouTube results page for asthma, prominently highlighting videos “From health sources”:As YouTube explains, to be eligible for these enriched search features (and likely earn more clicks and views), content needs to be from “credible health sources”. These sources are vetted in different ways:“Vetting mechanisms include accreditation, academic journal indexing and government accountability rules.”Virginia recommends healthcare companies apply for PIF TICK certification. Created by the Patient Information Forum, the PIF TICK is the only independently assessed standard for both print and digital healthcare content creators.While it won’t guarantee improved rankings through either Google Search or YouTube search, it seems like a smart proactive move given Google’s increased emphasis on EEAT content in healthcare.Final thoughtsHealthcare SEO is competitive and involves solving unique challenges, like medical review of content, competing with industry giants, and staying compliant with tons of regulations.This guide should arm you with everything you need to connect with patients and clients and grow your healthcare business—while making the world a little smarter (and healthier) in the process.Want to ask a question? Connect with me on LinkedIn or X. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Ryan Law Ryan Law is the Director of Content Marketing at Ahrefs. Ryan has 13 years experience as a writer, content strategist, team lead, marketing director, VP, CMO, and agency founder. He's helped dozens of companies improve their content marketing and SEO, including Google, Zapier, GoDaddy, Clearbit, and Algolia. He's also a novelist and the creator of two content marketing courses. Keep Learning Enterprise SEO Strategies For Maximum Growth Enterprise SEO can be defined by the size of the company or website, the complexity of the technology or teams, or by global operations. Franchise SEO: Local and National Growth Strategies for Franchises Franchise SEO is basically local SEO multiplied by the franchise's number of locations, right? Wrong! Steal Our SEO Report Template (Inspired by SEO Experts) Not sure how to create the perfect SEO report? Steal our SEO report template and make it even better as we go through it slide by slide. How to Use Yoast SEO to Improve SEO Yoast SEO is a popular WordPress plugin that helps you optimize blog posts for SEO. Learn more about how it works and its key features. Continuous SEO: Can You “Complete” SEO? Can you really “complete” SEO, or should it be continuous? We'll answer that, plus share tips for implementing a continuous SEO strategy.",
  "headers": [
    {
      "level": "H1",
      "text": "Healthcare SEO: 7 Strategies From Medical SEO Pros"
    },
    {
      "level": "H2",
      "text": "The unique challenges of healthcare SEO strategy"
    },
    {
      "level": "H2",
      "text": "1. Get your content medically reviewed (and embrace EEAT)"
    },
    {
      "level": "H3",
      "text": "Create content with non-experts"
    },
    {
      "level": "H3",
      "text": "Source expert medical reviewers"
    },
    {
      "level": "H3",
      "text": "Review for medical accuracy"
    },
    {
      "level": "H3",
      "text": "Publish with clear author and reviewer attribution"
    },
    {
      "level": "H2",
      "text": "2. Target low-competition keywords before challenging healthcare giants"
    },
    {
      "level": "H2",
      "text": "3. Build topic clusters for key medical conditions"
    },
    {
      "level": "H3",
      "text": "Pre-intervention"
    },
    {
      "level": "H3",
      "text": "Intra-intervention"
    },
    {
      "level": "H3",
      "text": "Post-intervention"
    },
    {
      "level": "H2",
      "text": "4. Build links by showcasing your healthcare research and innovations"
    },
    {
      "level": "H2",
      "text": "5. Find local patients by optimizing for local SEO"
    },
    {
      "level": "H3",
      "text": "Optimize your Google My Business profile"
    },
    {
      "level": "H3",
      "text": "Build NAP citations and submit your company to healthcare directories"
    },
    {
      "level": "H3",
      "text": "Create locations and services pages"
    },
    {
      "level": "H2",
      "text": "6. Use medical schema markup"
    },
    {
      "level": "H2",
      "text": "7. Get ahead by opting into medical certification schemes"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Ryan Law"
}