{
  "url": "https://ahrefs.com/blog/healthline-seo-case-study/",
  "slug": "healthline-seo-case-study",
  "title": "Healthline's Content Anatomy: 5 SEO Insights to Learn From",
  "description": "Healthline is one of the biggest health niche websites. Here are valuable insights that shed light on what makes it so successful.",
  "content": "Michal Pecánek SaaS SEO consultant with over 6 years of experience. Before going freelance, Michal was an SEO & Marketing Educator at Ahrefs–creating content for the blog and managing a team of guest writers. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Healthline is one of the biggest health niche websites. We’re talking tens, if not hundreds of millions of clicks every month with fierce competition. It doesn’t get much more exciting in SEO than this.Healthline is owned by media giant company Red Ventures, which has a whole RVO Health subdivision comprising many domains in this YMYL niche. One of them is also Medical News Today that you can see among the biggest players listed in the chart above.All of these websites are SEO powerhouses we can learn from, but I found Healthline to be the most interesting one, especially its content and on-page aspects. Let’s take a look at five insights that stood out to me from many hours of analysis.Contents1. You can perfectly align with search intent using templatesIt’s hardly a surprise that you’ll find patterns after publishing tens of thousands of pieces of content. In Healthline’s case, it currently has around 34K pages in its Health and Nutrition article subfolders that drive the vast majority of its traffic:Screenshot taken from the Site structure report in Ahrefs’ Site Explorer.Certain types of content, like food item overviews, can be templated pretty heavily, as you can see from the title tags and H2s here:Screenshot taken from Page Explorer in Ahrefs’ Site Audit.But more often than not, you’ll need some more unique points and headings to align perfectly with the search intent.For example, here are three SERP snippets that use the same title tag template that tells you the focus of the article.We have crackling in ear…Followed by wrist pain…And ending with contact dermatitis.Causes, symptoms, and treatment are variables the vast majority of searchers will be interested in when looking up these health problems.But crackling in ear can be something you may be able to fix easily with home remedies:Wrist pain usually requires you to do some exercises to get better:And contact dermatitis is something you likely need to see photos of to confirm if you landed on the right health problem:All of these articles have huge structural overlaps but are still unique in one way or another, which makes them great for answering all sorts of questions a searcher may have.Healthline uses the title template of {health problem} followed by the most relevant combination of words like causes, symptoms, treatment, diagnosis, risks, preventions, pictures, etc., across the board.It sounds simple. But choosing the right combination that best aligns with the search intent results in SERP titles that are better—or at least on par with the competition:And this goes on and on throughout different content types. Here, we have a bunch of pages where people are likely most interested in the difference:While others are positioned toward picking a winner for a certain quality (better, healthier, etc.):2. Own more search results without cannibalizationNailing search intent alignment is one thing. But being able to do it with multiple pieces of content that have huge target keyword overlaps is an advanced SEO and content game.I think most people associate ranking for one keyword using multiple pieces of content with a phenomenon that hurts one or more of these pages. This is known as keyword cannibalization.But take a look at this:As someone who’s done a bit of research about creatine in the past, I can see myself clicking on both of these results. They cover the topic from different angles that don’t result in cannibalizing each other’s organic traffic. Anyway, you can’t even cannibalize your own content when you already rank at the top with one of those pages. Occupying more search results simply gets you more traffic.There are currently over 40K keywords in the U.S. where Healthline owns the top SERP position and one or more lower positions:Not all of these keywords have a mixed search intent, though.In some of these cases, Healthline likely ranks with more pieces of content that serve the same purpose just because it is a huge authority in the space. I didn’t encounter this from examining many of its SERPs. But the following data speaks for itself.What surprised me the most is the fact that out of the 1K keywords with the highest search volume here, it manages to rank for 994 of them with two or more results in the top 10 search results:Using Ahrefs’ Keywords Explorer, I exported SERPs for the first 1K keywords with the highest search volume from the previously shown Organic keywords report. Then I extracted domains from all ranking URLs and created the pivot table above that counted how many times a given domain ranked in the top 10 for each keyword. Lastly, I used the SUBTOTAL function that could count the number of rows filtered by COUNTA of Domain of two or more.Last but not least, another way of taking more SERP estate is to rank with both written content and videos. You guessed it. Healthline also has a thriving YouTube channel, and it manages to own multiple results in this manner as well:3. Don’t overlook your visitors’ engagement Two confessions: I hate the UX of most websites with display ads, and I often refer to engagement metrics like bounce rate as vanity metrics.Yet I find the experience of browsing through Healthline smooth, with many nudges to keep me engaged with it longer. And I’m sure its team does a great job of doing visitor engagement analysis and goal setting.There are three aspects worth taking a closer look at because SEO and UX are closely intertwined disciplines.Keeping ads in moderationDisplay ads, pop-ups, and interstitials are usually a nightmare for many browsing experiences without an ad blocker. (Are you really a marketer if you’re using one?)Healthline seems to have found a great balance between monetization and user experience. Especially on desktop, it doesn’t stuff ads in between paragraphs, which I highly appreciate. I don’t mind seeing the ads at the top of the content or on the side:The experience obviously gets worse on mobile, as there is no sidebar. But the ads within the content still aren’t overwhelming. It also applies to pop-ups, as I only recall getting one for an email newsletter subscription, which is totally OK from time to time.Infinite scrollingA lot of Healthline articles use an infinite scroll feature where you seamlessly “flow” into reading another article related to the one you landed on. The URL changes as you go along.For example, here’s an ending of a Beetroot 101 article that flows into the health benefits of beets with an ad in between:I got into reading some Healthline articles and sometimes didn’t even realize that I was already reading another piece of content. It nails down the relevance, making the reader stay on the page longer, which naturally results in more monetization opportunities.Chances are that it’s also a positive SEO signal, but we’re getting into speculations here. No one officially confirmed signals like dwell time to be a ranking factor.Truly related content suggestionsThe key factor in keeping readers engaged with more content is the relevance of the suggestions. We already showed an example of infinite scroll, but Healthline also employs other content suggestion methods.There’s a well-known “related reading,” or as Healthline titles it, “read this next” section. For example, these are suggestions at the end of an article with the title “Healthy Eating Is Human: Joys, Challenges, and 3 Things You Can Do”:Looks good to me. What also looks good are its “related videos” sections to provide content in different formats, like this one in between the list of the “healthiest vegetables around”:Being able to show video ads in there is just the cherry on the top.4. Revive meta keywords; they can be usefulThe great relevance of all the suggested articles and videos we just covered makes me wonder how Healthline manages to do that. It’s unlikely that it selects these manually at this scale.I encountered what seems to be a multi-level system of content tagging that could play a big role in creating this content recommendation system.Healthline uses a combination of different meta tags, like on this page about losing weight:Screenshot and HTML code taken from Ahrefs’ Site Audit crawl data.Yes, the long-dead meta keywords can still be encountered. While they don’t play any role in rankings (at least not for Google), they can come in handy for tagging the topics of each piece of content to create an internal topical hierarchy. Some advanced CMSes (like the headless ones) recommend doing it for this purpose too.The sailthru.tags is a meta tag for categorization and user interest tracking used for a personalization engine. Healthline takes catering to search intent and users’ interests very seriously.I made an assumption that it’s also serious about engagement tracking and goal setting. Well, there are lots of custom dimensions it sends to its Google Analytics, including these content tags:Screenshot taken from the dataslayer tool added to Chrome Developer Tools.5. Get inspiration from this E-E-A-T signaling masterclassIt will hardly surprise anyone that a successful website with 100% YMYL content excels in signaling E-E-A-T. But there are many aspects of this worth bringing up.Most relevant authors and reviewersIt should go without saying that your authors should be qualified to cover their assigned topics, especially in YMYL niches. Healthline does a great job here.It has a team of in-house writers and guest freelancers with various qualifications related to health and medicine. These people don’t necessarily need to be experts in a certain topic, but their backgrounds ensure that they can put together great content:Then the experts come into play in the medical review. In this example, there’s no one more qualified for the job than an ophthalmologist:Healthline’s medical team consists of four divisions that create a huge professional network with expertise for likely any medical topic you can think of:Awards, accomplishments, citations, and backlinks of authors and reviewersWe have all encountered a few doctors that left us wondering how they even finished med school. Having a diploma is simply just a prerequisite. Given that E-E-A-T is largely about backlinks and references, it’s likely a good idea to get people with a successful track record.https://twitter.com/Marie_Haynes/status/966325146968559616Everyone I clicked on on Healthline seems to have great professional backgrounds and credentials:Diving into stuff like h-index or other author-level metrics seemed like an overkill here, so I at least looked up a few authors and reviewers in Google Scholar. Almost everyone returned relevant papers and articles from the Scholar index.All of these things in academia are basically like backlinks in SEO. I won’t be surprised if all the data we’re showing here was interconnected on the entity level and that Google took it into consideration not only for enhancing the Knowledge Graph but also for rankings.Speculations aside, Healthline already has all the highly authoritative backlinks that are so needed in this niche. We all expect that. But I took a look at a few personal websites from the Healthline’s editorial team and found some nice backlink profiles that signal E-E-A-T too:Screenshot taken from the Referring domains report in Ahrefs’ Site Explorer.The takeaway is that the direct backlink profile is undoubtedly most important, but you can’t go wrong featuring great content from someone who already has a proven track record.Meticulously describing editorial processesHealthline has the most detailed and open documentation about its editorial processes, monetization, product selection, integrity, etc., that I’ve ever seen.You can access all of this from its About page with a click or two.For example, here’s an excerpt from its “product selection process” page that clearly signals the trustworthiness of its recommendations:Adding a list of sources and referencesListing your sources is a great way to show the reader that the content is based on trustworthy information. Healthline includes those at the end of articles:Keeping the history of edits and reviewsHealth is one of those niches where almost no content can be considered evergreen. New research can sometimes even flip existing findings and best practices around.Next to the Sources tab, Healthline also shows the History tab where we can see who has done what with the content and when:Anthony Machi from Healthline’s SEO team said that they already had a 50:50 split for publishing new and updating old content back in 2022.I can imagine that they already spend more time on the updates now. The number of new pieces published is significantly down recently when looking at the past five years:Screenshot taken from Ahrefs’ Content Explorer.Final thoughtsEven though I spent many hours analyzing Healthline’s website from all sorts of angles, I’m sure there are many interesting SEO insights I still haven’t uncovered.It’s a website anyone can take inspiration from to improve their own SEO and content game regardless of the niche they’re in.Got any questions or comments? Let me know on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Michal Pecánek SaaS SEO consultant with over 6 years of experience. Before going freelance, Michal was an SEO & Marketing Educator at Ahrefs–creating content for the blog and managing a team of guest writers. Keep Learning The 25 Biggest Traffic Losers in SaaS in 2024 We analyzed the organic traffic growth of 1,600 SaaS companies to discover the SEO strategies that work best (...and worst) in 2024. The Story of Blocking 2 High-Ranking Pages With Robots.txt We made the bold move of blocking two high-ranking Ahrefs articles with robots.txt. Learn the results of what happened afterward.",
  "headers": [
    {
      "level": "H1",
      "text": "Healthline’s Content Anatomy: 5 SEO Insights to Learn From"
    },
    {
      "level": "H2",
      "text": "1. You can perfectly align with search intent using templates"
    },
    {
      "level": "H2",
      "text": "2. Own more search results without cannibalization"
    },
    {
      "level": "H2",
      "text": "3. Don’t overlook your visitors’ engagement"
    },
    {
      "level": "H3",
      "text": "Keeping ads in moderation"
    },
    {
      "level": "H3",
      "text": "Infinite scrolling"
    },
    {
      "level": "H3",
      "text": "Truly related content suggestions"
    },
    {
      "level": "H2",
      "text": "4. Revive meta keywords; they can be useful"
    },
    {
      "level": "H2",
      "text": "5. Get inspiration from this E-E-A-T signaling masterclass"
    },
    {
      "level": "H3",
      "text": "Most relevant authors and reviewers"
    },
    {
      "level": "H3",
      "text": "Awards, accomplishments, citations, and backlinks of authors and reviewers"
    },
    {
      "level": "H3",
      "text": "Meticulously describing editorial processes"
    },
    {
      "level": "H3",
      "text": "Adding a list of sources and references"
    },
    {
      "level": "H3",
      "text": "Keeping the history of edits and reviews"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Michal Pecánek"
}