{
  "url": "https://ahrefs.com/blog/holiday-seo/",
  "slug": "holiday-seo",
  "title": "6 Holiday SEO Tips (To Boost Traffic During the Shopping Season)",
  "description": "Implement these six holiday SEO tips so you can rank your pages higher for the busiest seasons of the year.",
  "content": "Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Holidays are that time of the year when people spend tons of money on gifts for friends, family, and loved ones.In fact, according to the National Retail Foundation (NRF), American consumers each planned to spend ~$998 on holiday gifts in 2021.This is a fantastic opportunity for SEOs and marketers. In this post, you’ll learn six simple SEO tips to implement for the holidays so you can rank your pages higher for the busiest seasons of the year.https://www.youtube.com/watch?v=OJJXxc-9pBs1. Add internal links to your holiday pagesInternal links are links from one page on your website to another. They aid the flow of PageRank around your site, which is important because PageRank is a Google ranking factor. That means if you can add internal links from relevant pages on your website to your important holiday pages, you can actually boost their rankings on Google. Here’s how to do it. First, make a list of all your important holiday pages. Next, sign up for our free Ahrefs Webmaster Tools (AWT) and run a crawl on your site. When the crawl is done, go to the Link opportunities report in Ahrefs’ Site Audit. This report will show you relevant link opportunities on your site.To find relevant and contextual internal link opportunities, set the filter to Target page and search for your holiday pages. Look at the suggested opportunities and add internal links where relevant. We recommend doing it at least one to two months in advance so Google and other search engine crawlers have time to crawl those pages and discover the new links. Learn more: Internal Links for SEO: An Actionable Guide 2. Find seasonal topicsHoliday season means people are looking for holiday-specific keywords. For example, there’s a huge spike in Halloween-related dental queries every year:You should be creating pages to rank for these keywords.Here’s how to find them:Go to Ahrefs’ Keywords ExplorerEnter one or a few relevant keywords (e.g., if you sell consumer electronics, you can enter keywords like “air fryer,” “headphones,” “laptop,” etc)Go to the Matching terms reportUse the Include filter to search for relevant holidays (e.g., Black Friday, Christmas, etc)Note that keywords relevant to a holiday don’t necessarily have to include the actual name of the holiday. It can be related to the person whom people are buying for. For example, Mother’s Day and Father’s Day. So we can follow the above steps. But this time, in the Include box, we’ll search for “for dad” and “for mom.” If we do this for the keyword “golf,” here’s what we see:When you have a list of good holiday topics to target, follow the video below to create pages that can rank for them:https://www.youtube.com/watch?v=8BdZ0dUu7VQSidenote. Since it’ll take time to rank for these keywords, create these pages before the holiday season begins.3. Update seasonal contentWithin a single year, holidays are seasonal. But look at it from a long-term perspective, and holidays are actually evergreen. For the foreseeable future, holidays like Valentine’s Day, Black Friday, and Christmas are always going to be big shopping seasons. That means from an SEO perspective, search intent isn’t likely to change much. So rather than creating new pages every year (and deleting old ones), it’ll be much better to create an evergreen page that you’ll update one or two months before the holiday. This way, you’ll retain the link equity, continue to build authority to that one page and, hopefully, appear at the top of Google for your target query every year. For example, that’s what TechRadar does every year for its “Black Friday deals” page. You can see that it consistently maintains top rankings for that page since 2020:So even though it doesn’t get much traffic during the “off season,” it gets tons of it during the holidays:Sidenote. Even though the spike in 2020 looks small, it still received around 150K search visits. But keeping the page evergreen led it to even more traffic in the next holiday season, peaking at around 1.7M search visits.If you’ve already created seasonal pages for previous years, consider redirecting them to your evergreen page.4. Optimize your Google Business ProfileIf you have a brick-and-mortar presence, make sure you’ve claimed your Google Business Profile (GBP) and optimized everything (including adding your holiday hours).This will ensure that your business has the chance to appear on the Google Map Pack whenever someone is looking for something in their vicinity.Claiming and optimizing your GBP is a pretty straightforward process, which you can complete in 30 minutes. Just follow the guide here. Google Business Profile also allows you to share updates, offers, and events related to your business. They show up in a carousel near the bottom of your Google Business panel.Use this to share any deals and offers for the upcoming holiday season.Learn more about creating great business posts in this short guide from Google.5. Take advantage of free product listings on Google ShoppingGoogle Shopping was originally only “pay-to-play.” But in 2020, Google opened it to organic listings. With 1.2B monthly searches on Google Shopping, it means you’ll want to be here during the holiday seasons. To show your products in Google Shopping’s organic listings, you’ll need to have a Google Merchant Center (GMC) account.Then follow Google’s instructions below on how to show your products for free on Google Shopping.Learn more: Show Your Products for Free on Google6. Improve click-through rates (CTRs) for important holiday pagesMore clicks mean more visitors. And having more visitors during the holidays probably means more sales.So ideally, you’d want to optimize the titles and meta descriptions for your important holiday pages.Usually, the best way to do this is to test them using search ads. This is because Google Ads will give you click data on which title and meta description combinations work best for a particular page. The issue, however, is that holidays only run for a short period of time. This means there isn’t time to gather enough data on the combination that will work. So here’s an alternative method. We can look at how your competitors’ paid ads have performed and use them as inspiration. Here’s how to do this:Enter the URL of a competitor’s ad into Ahrefs’ Site ExplorerGo to the Ads reportHere, you’ll see their ad copy, the exact landing page they’re sending traffic to, the keywords they’re targeting, and the amount of estimated traffic each ad is generating. Use it to inspire not only your own ad copy but also your holiday paid advertising strategy!Learn more: How to Craft the Perfect SEO Title Tag (Our 4-Step Process) Final thoughtsThese are some low-hanging SEO tips for more organic traffic. But SEO takes time. So if a holiday is coming, make sure you implement them soon! Did I miss out on any holiday SEO tips? Let me know on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Keep Learning SEO for Nonprofits & Charities: 13 Tips for More Traffic Make your nonprofit organization more visible in search engines and generate consistent, passive traffic with these 13 SEO tips. How to Improve SEO: 15 Tactics to Boost Your Rankings & Traffic (That Don’t Require New Content) These tried and true tactics are ideal for improving your SEO and boosting rankings—and won't require you to create new content. 12 Best SEO Podcasts in 2024 We polled Twitter to curate 15 SEO podcasts producing quality and regular episodes that are ideal for every kind of marketer. WordPress SEO: 20 Tips and Best Practices WordPress makes it easy to use SEO best practices. Improve your site's SEO with the tips in this guide. What Do SEO Agencies Do? (And Tips for Choosing One) Learn exactly what SEO agencies do, benefits of working with one, and tips for choosing an agency that gels with your business.",
  "headers": [
    {
      "level": "H1",
      "text": "6 Holiday SEO Tips (To Boost Traffic During the Shopping Season)"
    },
    {
      "level": "H2",
      "text": "1. Add internal links to your holiday pages"
    },
    {
      "level": "H2",
      "text": "2. Find seasonal topics"
    },
    {
      "level": "H2",
      "text": "3. Update seasonal content"
    },
    {
      "level": "H2",
      "text": "4. Optimize your Google Business Profile"
    },
    {
      "level": "H2",
      "text": "5. Take advantage of free product listings on Google Shopping"
    },
    {
      "level": "H2",
      "text": "6. Improve click-through rates (CTRs) for important holiday pages"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Si Quan Ong"
}