{
  "url": "https://ahrefs.com/blog/how-to-explain-the-value-of-seo/",
  "slug": "how-to-explain-the-value-of-seo",
  "title": "How Do You Explain the Value of SEO? I Asked 100 Experts",
  "description": "Learn how the pros explain the value of SEO (and address common objections).",
  "content": "Mateusz Makosiewicz Marketing researcher and educator at Ahrefs. Mateusz has over 10 years of experience in marketing gained in agencies, SaaS and hardware businesses. When not writing, he's composing music or enjoying long walks. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents This article is for anyone who wants to convince their boss to invest in SEO, or those who want to sell SEO services.SEO is a well-known and widely used marketing tactic, but convincing your boss—or a room full of skeptics—can be tough.So, to make this easier for you, I reached out to over 100 SEO pros and asked what arguments they used and how they overcame objections. I even got some answers from entrepreneurs who shared what convinced them to use SEO.4 impossible-to-ignore SEO benefitsOut of the many good reasons to invest in SEO, based on our experience and the responses from over 100 people, I’d say these four benefits are the strongest and universal to all types of businesses.1. SEO brings targeted, evergreen, compounding trafficLet’s unpack this:Targeted means that you attract people who are likely to become your customers by targeting keywords that are relevant to the problems your business solves.Evergreen means that as long as you rank, you get traffic. Even if your content is years old.Compounding means that traffic from optimized pages (such as blog posts) adds up, creating gradual, cumulative growth.These traits are not unique to SEO, but what makes SEO truly hard to ignore is that it possesses all these characteristics simultaneously.Let’s look at an example. Below you will see the performance of a few blog articles we wrote years ago. Notice how their traffic grows over time and cumulates.Here’s the first article published in 2016 and its “humble” beginnings — only 71 monthly visits.Fast forward to 2024: not only the traffic from that same article grew to over 10K monthly visits, but other articles written along the way added over 100K visits on top that.And of course, this is not “just traffic”. These articles target keywords tightly related to our product allowing us to naturally feature our product.The more popular a niche is, the more searchers can come your way. But a less popular niche can be good too — it means less competition and higher conversion rates. Highlighting the size of this opportunity is key to getting SEO buy-in. If the opportunity is big enough (must be data-driven, of course), then the organization will move mountains to make it happen.Baptiste ‘Baba’ Hausmann, SEO Consultant, Baba SEOAccording to Daniel E. Lofaso, what helps to seal the deal are traffic forecasts: We persuade clients to invest in SEO by providing a forecasting model based on their customer lifetime value, average sale amount, or traffic and compare to competitor data using, in part, Ahrefs Top Pages report. When the forecast looks good, and the client is agreeable to the time horizon, the persuasion can be pretty strong.Daniel E. Lofaso, CEO and Founder, Digital ElevatorFinally, the longevity of SEO can create a psychological effect of reassurance that there’s a marketing tactic constantly working for you: When business owners work on SEO, it’s like starting another marketing machine running in the background. With SEO on their side, they don’t have to feel as pressured to show up on social media every single day.Jessica Freeman, Owner, Jess CreativesFurther readingEvergreen Content Explained: 2 Key Ingredients for SuccessWhat is Organic Search? Everything You Need to Know2. SEO lets you reach buyers at all stages of their journeySEO content allows for uniquely specific targeting of your audience: when they just want to be entertained, when they want to solve a problem, when they’re considering a purchase, when they’re actively comparing you to competitors, and so on.It’s all about the keywords and their search intent. Jon Morgan from Venture Smarter leverages the intent behind keywords to demonstrate how SEO can target people who are ready to make a purchase. SEO can sound complex and, frankly, expensive for a small business. But I explained it like this: imagine every time someone searches for “best pastries nearby,” their bakery pops right up on the first page of Google. That’s potential customers walking through your door!Jon Morgan, CEO & Editor-in-Chief, Venture SmarterHere’s an example from our blog. When people search for something like “keyword monitoring” they’re clearly in need of an app that tracks keywords — according to our Identify intents feature, 75% of the traffic for this keyword goes to pages about those tools.This allows us to feature our Rank Tracker in the content and promote it naturally, without any “hard selling”.SEO content lets you reach buyers for globally distributed products and local services alike. Many lawyer websites use this approach by providing basic information about common legal problems and the types of services needed to solve them, effectively capturing demand for their services.Educational SEO content on a lawyer firm’s website.Results of that content — top ten in the location where they offer the service.3. SEO increases your visibility and decreases competitor visibilityIn SEO, increasing visibility in search engines simultaneously decreases your competitor’s visibility — your gain is their loss.To illustrate, here’s a graph of organic traffic to our article and some competing articles. You can see the exact moment when updating our article resulted in a traffic increase (blue line) with a simultaneous traffic decrease of articles that used to rank above us.That said, this benefit is a double edged sword — missing out on SEO creates more space to grow for others. But you can turn it into a compelling argument by using competitor data: Pointing out specific examples of competitors’ articles that are generating significant organic traffic and ranking above the client for relevant searches makes the opportunity cost of not investing in content painfully apparent.Marshal Davis, President, Ascendly MarketingFurther readingHow to Do an SEO Competitor Analysis4. SEO reduces the cost of customer acquisitionIn the long term, SEO is cheaper than most marketing tactics. Compared to search ads, the cost of investment in creating SEO content is often lower, and you don’t need to pay for every click.Take our blog for example. If we were to “buy” this traffic with search ads, we’d have to spend $543,000 each month. Instead, SEO allows us to generate it passively, and we can spend resources to write new content and add to the traffic we’re already getting.But that’s not all — the longer a blog exists and drives traffic, the better value it becomes because it generates more revenue for the same initial investment. In other words, the customer acquisition cost (CAC) of SEO improves over time. We can clearly see this in the correlation between organic traffic to our blog and the traffic’s value.Organic search traffic and it’s value are strongly correlated - both go up and down at the same time.We got an interesting response from a “past doubter”, a CEO invested in SEO and now advises how to convince people like him: If you’re bumping heads with someone who used to be like me, connect the dots behind how SEO drives sales and increases net earnings. Money talks. Explain how it complements existing sales funnels and how it can even reduce costs and burdens on a sales staff or production itself, which are likely huge operational expenses. Drive home cost savings, and the ROI confusion will take care of itself.Roman Zrazhevskiy, Founder & CEO, MIRA SafetyAnd since SEO can reduce the cost of customer acquisition, Lee Moskowitz points out the opportunity cost of not investing in SEO. I explain that by neglecting organic traffic as a channel, you will make yourself too reliant on paid channels and other tactics that aren’t sustainable or may stop working well one day. (…) One of the most impactful ways I’ve overcome this barrier is by running competitor reports in Ahrefs and comparing website metrics to those of competitors’ websites.Lee Moskowitz, Director of Growth Marketing, SmartPass7 common objections to SEO (and how to respond)Based on our experience and feedback from other SEOs, there are at least seven common objections you might encounter. Don’t worry, though — we’ve also gathered some excellent responses to address each of them.1. Takes too longThis argument is built around the fact that it takes time to rank high on Google. And it’s true, SEO takes time to show effects; according to our poll, it takes three months on average.But that’s only one side of the coin. It’s also true, and perhaps more important, that the results SEO delivers are sustainable and have a lasting impact — we’ve already demonstrated that in the examples above.So it’s not really that SEO is slow; it’s just a long-term strategy that may seem like a worse choice compared to a faster tactic like PPC. But that’s like comparing a waterfall to a tap.Besides, some keywords will bring results faster. Generally speaking, when the top 10 pages ranking for a keyword have a weak link profile (low number of pages from unique domains), that keyword will need fewer backlinks to rank, and therefore less time to rank.You can find those keywords easily with Ahrefs’ Keyword Difficulty metric.Also, updating content where you already rank in positions 4 - 15 tends to bring results fast. In Ahrefs there’s a pre-made report that collects those keywords for you, just head on to Opportunities in Site Explorer.So let’s hear how some of our experts react to this objection: I address this by breaking it down into realistic milestones — improvements in three to four months with significant traffic increases by month six. For instance, at Kiddom, we saw webpage engagement rise by 35% within six months. This demonstrates that while SEO requires patience, the benefits compound and provide a substantial ROI.Rex Liu, Head of Sales & Marketing, GoSite We offered a grace period with our services at a discounted rate, allowing them to demonstrate the effectiveness of our work internally. In the first three months with us, they saw a 75% increase in sales from organic search compared to the same period the previous year.Juan Pineda, Managing Director, Agile Digital Agency One of the biggest things you can do is show momentum quickly with quick wins. Once a business owner sees these, you will have less of an issue bringing forward other use cases for further work.”Ryan Jones, Marketing Manager, SEOTesting2. It’s volatileThis objection to SEO is built around the sentiment that Google changes too much too often for any serious business to safely invest in a search engine as a traffic source.Google does introduce changes to their ranking systems quite often (some bigger, some smaller), but they are not drastic “revolutions” that move the search engine in to a new direction each time. They are rather coherent, incremental improvements towards the same goal — a better experience for users, harder to spam and cheat.Because of the nature of Google algorithm changes, the principles of SEO don’t really change. It’s still about quality content, quality links and having a technically healthy site — and it’s been proven many times.For instance, we once studied the impact of backlinks by removing them. Result: rankings went down, links are still important just like years ago.As for the role of content quality, this hasn’t changed either.Case in point: we regularly update old content, each time making slight improvements. We do this consistently because it yields significant results. For example, we saw an improvement from 100 to 2200 visits with just a single content update that took less than a day to complete.So when the instability objection enters the scene, you can do what Luke Hickman from Bird does: To address this issue, I’ll simplify the process and focus on the fundamentals of SEO, removing any jargon and reassuring them that, even with core changes, the core principles and benefits of SEO will stay the same.Luke Hickman, Head of Search, BirdFurther readingHow “Deep Content” Will Protect Your SEO in the AI Era3. It’s hard to measure the ROI of SEOThis is an objection I’ve heard a lot — the return on investment (ROI) in SEO is so hard to measure that it’s always going to be dubious even if someone attempts to measure it.But the thing is, I’ve heard the same about other marketing tactics. Even digital advertising has its challenges for accurately assessing ROI.Measuring ROI is a big and not entirely solved problem for marketing as a whole. The challenge lies in attribution within a multi-touch buyer journey. The pricier the product or service, the longer the journey, making it even harder to measure ROI. In other words, determining which dollar spent is wasted and which dollar generates more revenue is complex.But the good news is that there is more than one good way of proving that SEO impacts the bottom line of the business:Use Google Analytics to track the value of organic traffic conversions and assisted conversions (this guide explains how).Calculate the correlation between additional traffic from organic search and revenue/signups (ChatGPT will help you do the math).Show how much money SEO saves by calculating the lifetime traffic value (see here for the formula and details).Show testimonials from clients or marketing leaders who have seen positive results of SEO to strengthen your arguments.Further readingHow to Measure SEO ROI (Incl. 6 Challenges of Calculating It)Content Marketing ROI: How to Put a $ Value on Your Content4. Too complicatedSEO is full of jargon, and it’s all based on sophisticated algorithms that nobody in the industry has the manual for. It’s no wonder many people think SEO is too complicated to work with.That said, SEO is not as complicated as it seems when we break it down to the basics. Many clients are unfamiliar with how SEO works and its importance. I take an educational approach, explaining the fundamentals of SEO, how search engines rank websites, and the critical role of content, keywords, and backlinks. This education helps demystify SEO and builds trust.Darryl Stevens, CEO, Digitech Web DesignBut some people take a different approach — they avoid explaining too much, and shift the focus on what matters to businesses the most. Avoid overwhelming jargon, focusing instead on the high level. Highlight quick wins: apply the 80/20 rule to prioritize impactful, easy-to-achieve SEO that shows immediate value.Mark Hayes, Head of Growth Marketing, TASK5. Too expensiveOur respondents pointed out that even though SEO generates extremely cheap traffic, with an overall cost significantly lower than ads, there’s an upfront cost that may seem daunting to some.Obviously, you can explain that “it’s not a cost but an investment” and long-term SEO actually helps to save money but that may not be enough to break the psychological barrier. In this case, this advice may help: It also doesn’t need to be a yes or no situation. You can gradually carve out budget from other channels to work on low-hanging fruit SEO opportunities without taking away from those tactics.Lee Moskowitz, Director of Growth Marketing, SmartPass6. We don’t need itWhat if people tell you they don’t need SEO? Well, they may be right. I’ve seen many companies doing just fine without search engine optimization.But that doesn’t mean they couldn’t benefit from SEO — it could help them protect their market share or even help them do even better. I emphasize that even if their business is currently doing well, SEO can help maintain and improve their market position. I explain that competitors are likely investing in SEO, and staying ahead requires continuous effort. I also point out that consumer behavior is increasingly driven by online searches, and capturing a larger share of organic traffic can protect and grow their market share.Darryl Stevens, CEO, Digitech Web Design I respectfully clarify the difference between having someone “check the box” on SEO by installing a plugin versus investing in a comprehensive strategy. Auditing their current SEO efforts often reveals critical technical issues, thin content, and spammy link building tactics.Marshal Davis, President, Ascendly MarketingYour boss/client may even think that their target audience doesn’t use search. But the chances they are wrong are still quite high. Some clients, especially in B2B industries, believe their buyers only find them through word-of-mouth and existing relationships. I counter this notion by presenting data on how a growing share of their audience, especially younger generations, turn to search engines first when seeking solutions.Marshal Davis, President, Ascendly Marketing I’ve heard a lot of objections to SEO in my time. This was one of the more unusual ones: “I don’t believe the main purpose of our website is to generate new business.” I’d not come across this one before. With every objection, it’s important to understand the events or presumptions that have led to it. So, I always ask plenty of questions first to find out why they’re thinking the way they are.Hannah Millist, CEO, Twogether Digital7. We tried and it didn’t workFinally, your stakeholders, clients or even you may have had bad experiences with SEO, maybe even multiple times, and prefer to avoid it. Many small businesses fall prey to rogues, who often undercut the market so that they appear to offer good value. (.…) We are also surprised, from time to time, to see outdated methods being implemented by both big and small agencies. This generally just results in the business wasting money, since the work that is implemented does not yield any results.Michael Sanford, Account Director, SEO WorksIn cases like this, it’s crucial to identify the reason it didn’t work in the past. As our next expert says, just because you had a bad haircut… I dig into their past efforts to pinpoint why it failed — maybe it was poor strategy, black-hat techniques, or lack of persistence. I propose a revamped, ethical strategy with a transparent roadmap, saying, “Just because you had a bad haircut once doesn’t mean you stop cutting your hair. You just need a better barber.”Ilia Tretiakov, Owner and Lead Strategist, So Good DigitalA tip for agencies from Michael Sandford from SEO Works: when you hear that SEO failed before, it’s a good time to play your “reputation card” and tell a bit about how you work to earn trust. In such cases, we have to rely on our expertise and our reputation, built over many years, and start to build trust from there. As we educate clients by explaining things in their language, by being transparent about our processes, and by demonstrating progress in a consistent and accountable way, we often win such clients round.Michael Sanford, Account Director, SEO WorksFinal thoughtsInvesting in search has one final benefit, and it’s a big one: it makes people trust you more. We found persuading clients to invest in SEO often boils down to one fundamental value proposition - higher ranking websites convert better. It’s a simple equation: users inherently trust and purchase from businesses that dominate the organic search landscape. (…) When prospects are vetting potential vendors, subconsciously equating high rankings with subject matter mastery is human nature. A robust SEO footprint elevates the perception of expertise.Jason Smit, CEO, Contentellect A common objection is that businesses rely on social media and don’t see the need for SEO. I explain that ranking high on Google gives a business credibility and trust that social media cannot match. People tend to trust companies they find through Google search results more because it feels like Google has vetted them.Jason Hennessey, Founder & CEO, Hennessey DigitalOn a final note, I’d like to thank over one hundred SEO experts who answered our call to contribute to this article!Got questions or comments? Let me know on X or LinkedIn. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Mateusz Makosiewicz Marketing researcher and educator at Ahrefs. Mateusz has over 10 years of experience in marketing gained in agencies, SaaS and hardware businesses. When not writing, he's composing music or enjoying long walks. Keep Learning WordPress SEO: 20 Tips and Best Practices WordPress makes it easy to use SEO best practices. Improve your site's SEO with the tips in this guide. SEO Leads: A 6-Step Guide on How to Get SEO Clients Whether you're an established SEO agency or a freelancer just starting out, leads are the lifeblood of your business. Here's how to get them. How to Convince Your Boss to Invest in SEO To convince your boss to invest in SEO, you need to explain how SEO will make your boss more money and help them reach their business goals. Here’s How You Can Outsource SEO Easily and Effectively (+ Best Practices) Learn what SEO outsourcing is, services often outsourced, and best practices for outsourcing based on my agency experience. Accessibility for SEOs: How to Comply With ADA & WCAG Website accessibility isn't always top of mind for SEOs. But in light of some updated regulations, it's a good time to take note and comply.",
  "headers": [
    {
      "level": "H1",
      "text": "How Do You Explain the Value of SEO? I Asked 100 Experts"
    },
    {
      "level": "H2",
      "text": "4 impossible-to-ignore SEO benefits"
    },
    {
      "level": "H3",
      "text": "1. SEO brings targeted, evergreen, compounding traffic"
    },
    {
      "level": "H3",
      "text": "2. SEO lets you reach buyers at all stages of their journey"
    },
    {
      "level": "H3",
      "text": "3. SEO increases your visibility and decreases competitor visibility"
    },
    {
      "level": "H3",
      "text": "4. SEO reduces the cost of customer acquisition"
    },
    {
      "level": "H2",
      "text": "7 common objections to SEO (and how to respond)"
    },
    {
      "level": "H3",
      "text": "1. Takes too long"
    },
    {
      "level": "H3",
      "text": "2. It’s volatile"
    },
    {
      "level": "H3",
      "text": "3. It’s hard to measure the ROI of SEO"
    },
    {
      "level": "H3",
      "text": "4. Too complicated"
    },
    {
      "level": "H3",
      "text": "5. Too expensive"
    },
    {
      "level": "H3",
      "text": "6. We don’t need it"
    },
    {
      "level": "H3",
      "text": "7. We tried and it didn’t work"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Mateusz Makosiewicz"
}