{
  "url": "https://ahrefs.com/blog/how-to-make-money-with-seo/",
  "slug": "how-to-make-money-with-seo",
  "title": "How to Make Money With SEO (7 Ways + Examples)",
  "description": "Earning an income with SEO isn’t always easy—but it's possible. Discover our most tried and tested ways to make money with SEO.",
  "content": "Chris Haines Chris is an SEO director who has 10 years of experience in SEO, agency side. When not involved in SEO, he enjoys messing around with vintage synthesizers, walks on sandy beaches, and a good cup of tea. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents SEO isn’t a get-rich-quick scheme—it often takes years of hard work to make a living from it. The great thing, though, is its versatility. There are many ways to monetize SEO skills, which all suit different people.Want to know some of the best ways to monetize your SEO skills?Let me show you how.ContentsHow to make money with SEOYou can make money using SEO in a number of different ways. Here are the most common: Sell productized SEO servicesCreate contentStart a niche siteCreate an e-commerce or dropshipping storeFlip websites for profitSEO trainingSEO consulting1. Selling productized SEO servicesSelling productized SEO services or, in other words, creating standardized versions of services sold as products is a great way to make money with SEO. The advantage of this method over providing full-service SEO is that it is faster to deliver, which means you’ll generally get paid more regularly.Productized SEO services can include but are not limited to:SEO auditsKeyword researchLink buildingSo who is making money doing this?Glen Allsopp has blogged extensively about how he made six figures from providing SEO audits, which shows how lucrative this particular method can be. Another advantage of productized SEO services is that they can be sold on freelancer websites, where buyers search for specific SEO tasks rather than a fully managed SEO service. Here’s an example of a productized service for Google My Business I found on a popular freelancing site.As we can see from the description below, everyone gets the same format of audit, which means it should be relatively easy to scale.So what are the most popular forms of productized SEO services you can sell? SEO auditsIt might not look like much, but this seller below has 1,000+ sales and charges £125 (~$155) per audit. This means that he has sold ~$155,000 worth of SEO audits. SEOs have different methods for completing audits, but if you want to start providing them as a productized service, you should check out our SEO audit post first. In that post, you can see that the core elements of an SEO audit have been broken down into different checks, which you can use as a basis for your audit.They are:Check for manual actionsCheck organic trafficCheck for HTTPS-related issuesCheck that you can only browse one version of your websiteCheck for indexability issuesCheck for mobile-friendlinessCheck page speedCheck Core Web VitalsCheck for broken pagesCheck for sitemap issuesCheck basic on-page elementsCheck for declining contentCheck for content gapsCheck for other technical issuesYou may want to add further checks yourself, but this gives you a framework to start providing SEO audits as a productized service and start making money.Keyword researchAnother productized SEO service you can sell is keyword research. The basic process for creating a keyword research document is simple: You research the relevant metrics for a given keyword and then report them back to the client.There is no shortage of SEOs on freelance sites who have made decent money by providing keyword research as a productized service.We can see from the example below that if we multiply the sales by the product cost, the seller has made ~£12,000 from selling keyword research in this particular gig.To start making money with keyword research as a productized service, you must focus on what website owners want. They will most likely want to know the best keywords to target. You can provide this to them by identifying low-competition keywords.Using Ahrefs’ Keywords Explorer, you can easily find 20 low-competition keywords and charge $XX for this.RecommendationIf you want to brush up on your keyword research skills, start by watching Sam Oh’s video:https://www.youtube.com/watch?v=s7hR-i6Go4cLet’s look at how we can identify low-competition keywords related to “macbook air.”First, go to Keywords Explorer and plug in the keyword “macbook air.” The overview will show the keyword’s difficulty, search volume, traffic potential, global volume, and even popular questions around the topic.This information can help clients determine whether or not to target a particular keyword as part of their overall SEO strategy.To identify low-competition keywords in this topic, we need to click on the Matching terms report and filter by KD from 0 to 25. Once we have done this, we can see that the demand for used MacBook Air models is high—this alone may be an interesting insight you can share with your client.Now we have a list of the lowest competition keywords to target for this keyword. To download this report, click the Export button in the top right-hand corner. Then review and format the data in your template before sending it to your client.Link buildingLinks are still considered one of the most important Google ranking factors. If you can help acquire them for a client’s website through outreach or by creating content that attracts links naturally, this can be a valuable skill.Returning to our freelance site, some charge £750 (~$927) for five DR 40 guest blogs via blogger outreach.If we multiply the product price by the sales, we can see that this person has had 67 sales, meaning they have made ~$62,000.When it comes to link building, it is not the most straightforward service to productize, but you can take the following approach: Create a service along the lines of: “I will land 10 guest post placements for $1,000 for your website.” Assuming you get a ~20% hit rate, it will mean that you will have to find and pitch 50 sites for this to work—quite achievable.If you want to know the exact process of how to build links, the best way to do this is to check out our updated link building guide.Sidenote. You must know at least the SEO basics before attempting to sell productized SEO services. If you are knowledgeable about SEO and provide genuine value to your customers, you will stand a better chance of growing your business.2. Content writingIf you enjoy writing, creating content for websites may be one of the fastest ways to make money using SEO. There has always been a constant demand for high-quality content writers in SEO, and that trend looks set to continue based on the search volume trend below for the phrase “content creator.”Out of all of the methods here, this one has the lowest barrier to entry. So long as you are a reasonably good writer, you can make six figures writing content.Six figures may sound like a lot, but it is achievable. For example, Elise Dopson, a freelance content creator, managed to build a six-figure writing business from scratch, all by the age of 21.So how can you find a content writing job and start making money?To find content work, you have several different options: You can search popular freelance sites, join a content agency, or even just check out popular Reddit threads such as /r/hireawriter, /r/forhire, and /r/freelance—where you can share your content writing services.RecommendationAlways read the subreddit rules before sharing your content services. Otherwise, the mods may delete your post if you fall foul of the rules. For example, in /r/hireawriter, they have the following rules.To show you how easy it can be, I set up a basic advert on a popular freelance site to “write an engaging 500-word article on any topic.” I didn’t include any information about qualifications or include a portfolio of my work.After 177 views of my advert, I got an offer of work:And then another…Hopefully, this shows how straightforward it can be to start making money by writing content.3. Start a niche siteIf you are new to SEO, you may wonder what a “niche site” is. This phrase is SEO jargon for “a blog about a particular topic.” It’s an easy way to make money with SEO if you’re comfortable with creating your own content and monetizing it. Here are two examples of niche sites that focus on a particular topic:The Coffee Maven – A niche site focused on everything to do with coffee.Spaniel King – A niche site focused on Spaniel dog care.So how do you make money with SEO on a niche site?The first thing is to build traffic to your site. Once you have some traffic, you can start to monetize it. One of the easiest ways to do this is using Amazon Associates, but it’s worth noting that the commissions have been fairly low in recent years.The amount of money that you make with a niche site can vary from month to month. But it is clear that if you stick to it, the income can be significant in the long term.Here are two examples from Flippa of sites making decent money from their respective niches.RecommendationIf you want to get into the niche site game, you will need to develop some niche site ideas first. Once you have an idea, you can look at our guide, which shows you how to create a niche site earning four figures a month.Let’s take a look at a few niche site examples in more depth:1. Coffee DetectiveThe website offers common-sense tips, guides, and reviews to help you make coffee at home.If you can’t live without coffee, then you may find this an easy topic to write about.In terms of monetization, Coffee Detective is monetized by Mediavine and Amazon Associates.Let’s use Ahrefs’ Site Explorer to get an idea of how much organic traffic it is getting and the value of that traffic.In the overview, coffeedetective.com is getting an estimated 17,700 organic monthly traffic and has an organic monthly traffic value of ~$11,100. If we go to the Top pages report, we can see that ~18% of the traffic comes from just two articles. Using Ahrefs’ SEO Toolbar, we can see that the top page has fewer than 1,000 words of content—showing that you don’t always need thousands of words of content to rank well on Google and get traffic.Let’s take a look at another example.2. Get Busy GardeningThis site has a variety of posts on a wide range of topics related to gardening, such as growing food, garden care, and gardening techniques.If you know a bit about gardening, this can be an excellent topic to write about.In terms of monetization, Get Busy Gardening is monetized with Mediavine and Amazon Associates.In Ahrefs’ Site Explorer, let’s take a closer look at the estimated organic traffic and its value.We can see that getbusygardening.com is getting ~438,000 organic monthly traffic and has a value of ~$105,000.Let’s go to the Top pages report. We can see that 5.1% of the site’s traffic comes from a single article.These examples show that even a simple idea, such as making coffee at home or gardening tips, can provide a life-changing income. However, if we look closer at both sites, they started being active around 2016. So it has taken them at least six years to build up to these organic traffic levels. So while creating a niche site can be financially rewarding in the long term, it’s not the quickest way to make money with SEO.4. Create an e-commerce or dropshipping siteBoth e-commerce and dropshipping are well known for their six-figure case studies and are a lucrative way many people make money from SEO. A quick browse of Flippa shows us that many sites are changing hands for six figures or more.Here’s an example of an e-commerce website, Code and Quill. According to Flippa, it has a monthly profit of $2,576/mo.Here’s another example of a dropshipping site, Barbell Standard, which according to Flippa, has a monthly profit of $20,496/mo. This site is only two years old.If you want to make money with e-commerce or dropshipping, you will first need to identify at least one product you can be reasonably sure will sell online. In my opinion, the simplest way to do this is to:Find a site selling products in the category you are interested in.Plug it into Ahrefs’ Site Explorer.Check the Top pages report.Check out the example below of me doing this.Once I plugged a website into Ahrefs’ Keywords Explorer, the keyword “fidget toys” caught my attention.Let’s click on “fidget toys” and go to the overview to take a closer look at this keyword.A quick five-second check shows that this sharp peak occurred in April 2017 and again in May 2021. It’s clear from the trend graph that this is not a great product to create a store around at the moment. Recommendation It’s vital to sense-check your keywords because, sometimes, your perception of a keyword’s popularity may differ from the data.In a different example, let’s say you wanted to set up an e-commerce site selling popular variations of hoodies. You can easily find all the variations of the most searched for hoodies using Ahrefs.To do this, enter “hoodies” in the search bar of Keywords Explorer and click on the Matching terms report in the sidebar. We can now see the most popular hoodie variations, allowing us to position our e-commerce store effectively.The keyword “anime hoodies” sounds interesting—let’s take a closer look at this keyword by clicking on the link. Once you have clicked the keyword, you should see the overview screen again. We can see that this keyword’s trend varies quite a lot, but it has been relatively positive over the last few years.If you want to maximize your profits in e-commerce and dropshipping, you will need to consider the current trend of the product, its Keyword Difficulty, and Traffic Potential.5. Website flippingSo what exactly is “website flipping?”In simple terms, website flipping is the process of buying a website, improving it, and selling it for more money. Website flipping can be particularly lucrative if you have a few years of experience working in SEO already.For example, here’s a case study where a website was flipped for $136,000 in just 16 months. Here are some key points to remember when flipping websites for money:When purchasing a website, you want to look for one with good links but where the content can be improved. You can use Ahrefs’ Site Explorer to help you decide on this.According to Flippa, returns for flipping websites can be more than 50X its average monthly earnings. In other words, if a website has average earnings over the last 12 months of $1,000 per month, it can be worth ~$50,000.Once you have a rough idea of how much the site is worth, you will need to choose a broker. Empire Flippers provides such a service and is one of the most trusted platforms where you can buy and sell websites.Website flipping can be lucrative, but you must understand what to look for when purchasing a website. It also helps to have at least a basic knowledge of SEO. 6. SEO trainingOnce you have gained several years of experience in SEO, you may feel that your skills are better used to help others learn the skills you have acquired. Authority Hacker did just that to build a six-figure business. You can do this as well by creating high-quality SEO courses for in-person or online coaching. You can sell these courses and training materials through your website, Gumroad, Udemy, Teachable, or any other platform.To get set up selling your course, you will first need to decide what format it will be in. Here are a few examples of ways you can sell your course in different formats:Provide free video lessons on YouTube and monetize with adsProvide premium video lessons on a paid platform (Udemy, Teachable)Create templates or instructions for specific tasks and sell on Gumroad, e.g., site speed optimization for WordPressSet up an expert online community and charge a monthly subscription feeCreate a documented course and provide one-to-one training in person or remotelyIf you have a background in teaching, this method could be an excellent way for you to make money with your SEO knowledge.7. SEO consultingIt may not be the most exciting method to make money with SEO, but providing SEO consulting services is one of the most tried and tested approaches for making money—it’s how many SEOs make their living and can be very lucrative.It’s challenging to verify the amount SEOs are making from consultation, but our survey suggests over 25% of respondents charged ~$101–150 per hour, with some charging ~$750 per hour. If you want to get started with SEO consulting, check out our how to get a job in SEO post. It will give you a good overview of what to expect when looking for SEO jobs and following a more traditional SEO career path. If you are determined, you can get to a senior role in just a few years. Final thoughts on how to make money from SEOSEO can be extremely lucrative—but it does take time, effort, and a bucketload of determination to make the big bucks.It’s worth remembering that the people making the most money using SEO are not always the most well-versed technical SEOs. Crucially, however, they know how to leverage their skills to make money. Maybe you can too? Got questions? Ping me on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Chris Haines Chris is an SEO director who has 10 years of experience in SEO, agency side. When not involved in SEO, he enjoys messing around with vintage synthesizers, walks on sandy beaches, and a good cup of tea. Keep Learning Is SEO Worth It? The Answer Is in This Flowchart Not sure if paying for SEO or learning SEO is worth it? Here's the quickest, simplest way to get the answer. How to Get on the First Page of Google To even be seen by searchers, you'll need to rank on Google's first page. We cover five steps that'll help get you there. 10 Skills Every SEO Pro Needs for Success Curious about what it takes to become a successful SEO pro? Here are 10 skills you must master to level up into one. SEO vs. PPC: Differences, Pros, Cons, & Which to Choose SEO and PPC: Learn what both channels are, how to choose them, and how to use them in tandem. 11 Easy-to-Follow Tips to Optimize Your Blog Posts for SEO Want to send search traffic to your blog posts? Then follow these 11 tips that'll show you how to optimize blog content for SEO.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Make Money With SEO (7 Ways + Examples)"
    },
    {
      "level": "H2",
      "text": "How to make money with SEO"
    },
    {
      "level": "H2",
      "text": "1. Selling productized SEO services"
    },
    {
      "level": "H3",
      "text": "SEO audits"
    },
    {
      "level": "H3",
      "text": "Keyword research"
    },
    {
      "level": "H3",
      "text": "Link building"
    },
    {
      "level": "H2",
      "text": "2. Content writing"
    },
    {
      "level": "H2",
      "text": "3. Start a niche site"
    },
    {
      "level": "H3",
      "text": "1. Coffee Detective"
    },
    {
      "level": "H3",
      "text": "2. Get Busy Gardening"
    },
    {
      "level": "H2",
      "text": "4. Create an e-commerce or dropshipping site"
    },
    {
      "level": "H2",
      "text": "5. Website flipping"
    },
    {
      "level": "H2",
      "text": "6. SEO training"
    },
    {
      "level": "H2",
      "text": "7. SEO consulting"
    },
    {
      "level": "H2",
      "text": "Final thoughts on how to make money from SEO"
    }
  ],
  "author": "Chris Haines"
}