{
  "url": "https://ahrefs.com/blog/how-to-sell-seo-services/",
  "slug": "how-to-sell-seo-services",
  "title": "How to Sell SEO (With Expert Tips)",
  "description": "Learn how to sell your SEO services in six tried and tested steps.",
  "content": "Fraser McCulloch Traditional marketer now specializing in keyword research, SEO content plans, and content briefs. Has-been Scottish golfer. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents SEO is one of the most popular types of digital marketing services. But it’s challenging to sell because there are many types of SEO services and different service providers offering them.Follow this six-step guide to help improve your pitch, close more sales, and get your first clients (with tips from the pros.)ContentsStep 1. Show results to establish credibilityTo be taken seriously by prospects and get a foot in the door, you need to make them aware of the results of your SEO efforts.If you don’t already have proof or results, start creating them.Show traffic or links earned with screenshotsFor example, from Ahrefs, I downloaded the following chart of the organic traffic of a company I did SEO and content marketing for and added it to my website:If you worked on an effective link building campaign, enter its URL into Ahrefs’ Site Explorer, take a screenshot of the referring domains, add it to your website’s testimonials page, and describe the objectives, process, and results of the campaign.Show before and after resultsHere’s an example showing how Will improved his site speed by 718% and ended up with more than two times the traffic.In addition to outlining his process, Will shared a screenshot comparing December’s higher traffic with October’s traffic:Get client testimonialsEven better, if your customers give positive reviews about the results they got from your SEO work, you have established credibility in the eyes of potential customers.The next step is to find and qualify potential customers.Step 2. Find and qualify prospectsYou can find prospects using inbound marketing, e.g., your website, SEO, PPC, Facebook groups, communities, referrals, email marketing, and outbound techniques such as email and telephone outreach.Then you qualify prospects using the right questions regardless of your marketing channel.You can use a qualification sequence like the one below when pitching prospects.Their GoalMore clients ↓More customer sales ↓Improve site ↓Q2. How many clients? ↓Q2. How many customer sales? ↓Q2. What improvements? ↓Q3. Revenue per client ↓Q3. Average order value ↓Q4. Keywords target audience search ↓Q4. Keywords target audience search ↓Q5. What’s your budget? ↓Q5. What’s your budget? ↓What’s your budget? ↓Q6. Name, email, URL, and phoneQ6. Name, email, URL, and phoneName, email, URL, and phoneExample 1. InboundIn all, 60% of marketers say inbound marketing practices, such as SEO, are their highest quality source of leads.I’ve used this sequence to qualify new website visitors to my website:First, I ask them if they’re looking for clients, sales, or website improvements:Then I ask a couple of questions related to the first question.Then I ask if they have any budget:Then I offer a scheduled call:If they don’t have a budget, I invite them to subscribe to my newsletter, where I can pitch them services later:For example, Fiona told me she’s looking for four new clients who spend around £1,000 but indicated she doesn’t have any budget:If they have some budget, I ask for their name, email, and URL, inviting them to a discovery meeting:Your email listYou can email your subscribers asking the first question and a similar sequence to qualify prospects:In this example, Cecilia clicked the “More clients” option and indicated she’s looking for 11–20 more clients:Then she scheduled a call by completing the form you saw earlier.Example 2. OutboundIn this outbound example, I phoned Richard, a director in an insolvency practice company for whom I’d previously built a website.In previous conversations, he told me that he gets paying customers from other marketing channels and how much he pays for a qualified lead and customer.He is a qualified lead, as he told me he has a budget and needs more customers. Now it’s time to pitch to him.Step 3. Pitch outcomes in discovery sessionsIf you’ve qualified a prospect before a discovery call, you’ve already got the information you need to propose an outcome for them.(Otherwise, the call is going to use the questions in step #2.)How to pitch their outcome (more clients)With Richard’s permission, I’ve done my best to recreate our telephone conversation to give you an idea of how this can go.Me (text): Can I bounce something off on the phone?Richard (text): Call me.Me: Hi, Richard. So we’ve talked about how much you spend to get new customers. Ideally, how many new customers are you looking for each month?Richard: 20.Me: So you have a very high customer conversion rate from these other channels. But let’s say your website can generate qualified leads, and your team can convert 20% of those leads into customers.That means you’ll need about 100 qualified leads from the website a month.Richard: Correct.Me: Let’s say the website can convert 10% of its traffic into qualified leads, meaning it needs 1,000 visits a month.Richard: Yes.Me: So I checked out Google Ads for target keywords like “debt management plans” and “business insolvency,” and your customers’ search. And the cost per click was £16 a click.So you’d need to spend £16,000 a month with Google Ads to get your 1,000 website visits— based on the above calculations.Richard: I’m not spending £16,000 a month (laughs).Me: So let’s look at an alternative solution. I was looking at the website traffic of two of your competitors that generate qualified leads from their websites.One gets 5,700 visits a month; the other 7,200 visits a month from the organic results, not the paid results.So you’re a finance guy. You know it takes ongoing investment before you see a return, right?Richard: Right.Me: So to get that kind of traffic, I’d need to identify the right things people search for. I’d need to pay someone else with expertise in your industry to write the right content for those things. And I’d need to invest in earning links from authoritative websites.Richard: And we only want people looking for company liquidation, not personal liquidations solutions.Me: Exactly. So what would you invest each month instead of spending £16,000 with Google Ads to get the 1,000 visits?Richard: Well, quickly off the top of my head, probably about £2,000–£3,000 a month.Me: How did you come to that number?Richard: I’m the finance director. We can afford to invest £24,000–£36,000 in a year where we don’t need to see short-term results.A quick explanation20 clientsDivided by 20% conversionEquals 100 leadsDivided 10% traffic conversionEquals 1,000 visitsKeyword CPC equals £16£16,000 Google Ad spend to get 1,000 visitsTo calculate the CPC of the keywords your customer would target, go to Ahrefs’ Keywords Explorer, enter their target keywords, and look at the CPC column.Ending the discovery callWhen the call naturally ends, you can finish the conversation with, “So where do you think we should go from here?”There are only three outcomes of asking this question:They’re not interested.They want to see the scenario you explained to discuss with others.They want to schedule a follow-up meeting with others in their team.So I wrapped up the call with Richard and said I’d draft up the scenario we discussed.Step 4. Follow up with a one-page proposalFortunately, I’m working with the person who makes the final decisions and the one who approves payment.So the next day, I emailed Richard this one-page proposal summarizing the objective, campaign, pricing options, and competitor traffic analysis. You can create a copy of it here.Then I met up in person with Richard. After some small talk, I asked if he’d read the proposal.He asked me to explain if the competitors’ growth was achievable, which led the conversation to link building.I explained how he could ask for links from some of his industry contacts and accreditation websites, but the rest of the links would need to be earned.Then I explained the keyword research and content processes (choosing which topics to write about) and the differences between pricing option A and option B.Richard ended the conversation by stating that he was bought into the idea. But as one director needed to review, edit, and approve all content writing, he needed buy-in from all members of his team.Your prospect may loop someone else, like a sales, marketing, or web manager, into the project to join a follow-up sales meeting and discuss the following:Discuss how this SEO project will workPlan the project duration, estimate costs, how to get started, and how you will report and measure resultsReferences from other clientsStep 5. Create an SEO forecast to reassure the clientClients may get cold feet if you can’t provide reasonable assurance for their future traffic performance. But equally, SEOs can’t guarantee results. There are just too many uncertainties:Google algorithm updates can impact website performanceTechnical SEO issues can impact performanceContent can sometimes not perform as well as originally expectedCompetitors’ SEO can be improved and outperform your pagesYou need to strike a balance. That’s where the SEO forecast comes in.An SEO forecast shows the predicted organic traffic growth for the time period.Providing a forecast shows you’re confident and competent in your ability to provide SEO services, implying that you’ll be held accountable against an agreed target.5-minute SEO forecastHow to forecast trafficTo forecast traffic at a keyword level, you can use Traffic potential (TP) to provide a quick indication of potential organic traffic available for your client’s top keywords.TP shows the sum of organic traffic that the #1 ranking page for your target keyword receives from all the keywords it ranks for, which acts as a good predictor of the traffic your article could get, if it performs well.How to forecast salesIf you want to forecast sales for a particular keyword, then you’ll need to know your customer conversion rate plus your average order value.Sidenote.Average order value (AoV) = how much a typical customer would spend in your storeVisitor to customer conversion rate (CR) = how often your visitors convert to customersHere’s a simple way to do it: TP * CR * AoV Creating more detailed forecastsIf your potential client is looking for a more detailed forecast or a competitor forecast, it’s worth putting together an SEO forecast using multiple data sources.To do this, I would advise to start with Patrick Stox’s excellent post on SEO forecasting.Step 6. CloseUsing our SEO contract template proposal, complete the details of the highlighted areas:This contract includes:Responsibilities, who does what, and more.Scope of work.Duration of work.Payment terms.In addition, you may also be asked to sign an NDA (non-disclosure agreement) by the client before they share company information with you and your team.6 tips from the pros on how to get your first clientsI asked SEOs on X how they got their first clients—here’s what they said.1. Share your skills with othersDr. Marie Haynes started in SEO by sharing her SEO skills and expertise with other people: “I offered to look at one person’s analytics because they weren’t sure if Penguin hit them. Did this a few times, and people found it valuable, so I started offering an $89 report.”Dr. Marie Haynes, Founder, MHC2. Network at eventsFind clients by networking at events. Here are the events that Shane Jones recommended.https://twitter.com/shanejones/status/1724081496015634474?s=203. Share SEO case studiesSEOs told me that sharing case studies on Facebook, Linkedin, X, and Instagram is a great way to attract new clients. “I got my first SEO client (as an SEO freelancer) from a Facebook group.” Harpreet Munjal, Founder, LoudGrowthLiam Quirk found success using LinkedIn and Instagram. “I began by posting SEO case studies on LinkedIn demonstrating our results and capabilities. This not only built my personal brand but also attracted potential clients who were seeking SEO services.” Liam Quirk, Founder, Quirky Digital4. Use cold emailsCold emails don’t have the best reputation, but they are one of the ways SEOs told me that they got their first clients.https://twitter.com/SamCharlesUK/status/1724073965948170261?s=20There are ways you can approach your SEO outreach that can make it easier to get responses. “We used to search for a keyword in Google, and we’d go from page 2 to page 7 of Google, find their names and email addresses, and send them an email.”Joshua George, Founder, ClickSliceIn terms of success rate, SEOs mentioned that it would usually take ~50 emails to get a few leads.5. Get work on freelance sitesAs well as Upwork, there are other popular freelance websites you could try selling your SEO services on places, like People Per Hour or Fiverr.SEOs told me that this was one of the ways they got their first clients:https://twitter.com/Zolko007/status/1724026732603117816?s=206. Talk to business owners you already knowShawn Hill did this and managed to land work doing social media marketing and also SEO services for a local company following a hail storm.https://twitter.com/shwnhll/status/1724024796608954483?s=20Final thoughtsHere’s a quick recap. We covered how to approach selling SEO services by focusing on three key areas:Present the client’s desired outcome rather than your servicesUse psychology to pitch a higher anchor price against your priceProvide a verbal price or one-page proposal before sending a contractGot questions? Ping me on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Keep Learning Pogo-Sticking in SEO: What It Is & What to Do About It Pogo-sticking is when a searcher quickly navigates back and forth between pages in search results. So is this something to worry about? Yes and no… Crawl Me Maybe? How Website Crawlers Work If you don't grasp the basics of optimizing for web crawlers (and eventual users), your organic traffic may well pay the price. 12 AI Copywriting Tools to Improve Efficiency With AI copywriting becoming increasingly popular, we share a list of tools that can best streamline your workflow. SERP Volatility: Why Your Rankings Are in Flux Learn why SERP volatility happens, how to diagnose and monitor it, plus the best strategies for stabilizing your search traffic and rankings. SEO for Lawyers & Law Firms: The Complete Guide A guide on increasing the chances of ranking on Google Map Pack and regular organic results—tailored for lawyers, attorneys, and law firms.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Sell SEO (With Expert Tips)"
    },
    {
      "level": "H2",
      "text": "Step 1. Show results to establish credibility"
    },
    {
      "level": "H3",
      "text": "Show traffic or links earned with screenshots"
    },
    {
      "level": "H3",
      "text": "Show before and after results"
    },
    {
      "level": "H3",
      "text": "Get client testimonials"
    },
    {
      "level": "H2",
      "text": "Step 2. Find and qualify prospects"
    },
    {
      "level": "H3",
      "text": "Example 1. Inbound"
    },
    {
      "level": "H4",
      "text": "Your email list"
    },
    {
      "level": "H3",
      "text": "Example 2. Outbound"
    },
    {
      "level": "H2",
      "text": "Step 3. Pitch outcomes in discovery sessions"
    },
    {
      "level": "H3",
      "text": "How to pitch their outcome (more clients)"
    },
    {
      "level": "H3",
      "text": "A quick explanation"
    },
    {
      "level": "H3",
      "text": "Ending the discovery call"
    },
    {
      "level": "H2",
      "text": "Step 4. Follow up with a one-page proposal"
    },
    {
      "level": "H2",
      "text": "Step 5. Create an SEO forecast to reassure the client"
    },
    {
      "level": "H3",
      "text": "5-minute SEO forecast"
    },
    {
      "level": "H4",
      "text": "How to forecast traffic"
    },
    {
      "level": "H4",
      "text": "How to forecast sales"
    },
    {
      "level": "H3",
      "text": "Creating more detailed forecasts"
    },
    {
      "level": "H2",
      "text": "Step 6. Close"
    },
    {
      "level": "H2",
      "text": "6 tips from the pros on how to get your first clients"
    },
    {
      "level": "H3",
      "text": "1. Share your skills with others"
    },
    {
      "level": "H3",
      "text": "2. Network at events"
    },
    {
      "level": "H3",
      "text": "3. Share SEO case studies"
    },
    {
      "level": "H3",
      "text": "4. Use cold emails"
    },
    {
      "level": "H3",
      "text": "5. Get work on freelance sites"
    },
    {
      "level": "H3",
      "text": "6. Talk to business owners you already know"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Fraser McCulloch, Chris Haines"
}