{
  "url": "https://ahrefs.com/blog/how-to-optimize-blog-posts-for-seo/",
  "slug": "how-to-optimize-blog-posts-for-seo",
  "title": "11 Easy-to-Follow Tips to Optimize Your Blog Posts for SEO",
  "description": "Want to send search traffic to your blog posts? Then follow these 11 tips that'll show you how to optimize blog content for SEO.",
  "content": "Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents If you want your blog posts to get search traffic, optimize them for SEO.But that doesn’t mean shoehorning as many keywords as possible. Keyword stuffing doesn’t work anymore.How do you optimize your content to be search-friendly? You’ll learn how in this post.Contents1. Target a topic with search traffic potentialIf no one’s searching for your keywords, you often can’t get search traffic. So before you do any content optimization, you must first ensure you’re targeting topics people are searching for. Here’s how to find these topics:Go to Ahrefs’ Keywords ExplorerEnter one or a few relevant keywordsGo to the Matching terms reportSet the tab to QuestionsGo through the list and pick out those relevant to your site.Further readingKeyword Research: The Beginner’s Guide by Ahrefs 2. Align your blog post with search intentGoogle wants to serve its users with the most relevant content. It does this by understanding why a searcher is looking for a particular topic. This is known as search intent.If you want to rank higher on Google, you’ll need to match search intent. To identify search intent, you’ll want to analyze the three Cs by looking at the top-ranking pages for your target keyword:Content type – Are they blog posts, product pages, landing pages, or something else?Content format – Are they tutorials, listicles, how-to guides, recipes, free tools, or something else?Content angle – Is there a dominant selling point, like low prices or how easy it is?For example, let’s say we’re targeting the keyword “how to become a wedding planner”: Here are the three C’s:Content type – They’re mostly blog posts.Content format – They’re mostly how-tos.Content angle – There are a few angles here (“according to experts,” “number of steps,” “without any experience”).So if you want to rank for this topic, it’s likely you’ll have to create a how-to guide (with any of the above angles if you can create something better, or a unique one if you have something different to share).Further readingWhat Is Search Intent? A Complete Guide for Beginners How to Do a SERP Analysis3. Cover important subtopics searchers want to seeIf the top-ranking pages cover similar subtopics, they’re likely important and what searchers expect to see.We can find these subtopics by looking at the common keywords the top-ranking pages rank for. Here’s how to find them:Enter your keyword (e.g., “how to become a wedding planner”) into Ahrefs’ Keywords ExplorerScroll down to the SERP overviewSelect three to five top-ranking articles (make sure they’re similar)Click Open in and choose Content gapHere, you’ll see the keywords these pages are ranking for. Click on the Intersection dropdown and choose the highest two targets (4, 5). Then look through the results to find potential subtopics.In this example, searchers want to know:The requirements you need to become a wedding planner.Whether you need a degree to become a wedding planner.If you need a license to be a wedding planner.How long does it take to become a wedding planner.How to become a wedding planner with no experience.If you’re targeting this topic, they’re likely potential subtopics you should cover.4. Optimize for featured snippetsFeatured snippets are quick answers to search queries displayed at the top of the SERPs. Here’s an example:Ranking for a featured snippet is a “shortcut” to the top of the SERPs, and it often has the bonus of driving more traffic to your website. To optimize for featured snippets, search for your target keyword and see if there is a featured snippet. If there’s one, you’ll want to take note of what Google is displaying.In the above example, Google shows a definition for the query “skyscraper technique.” And this is why we’ve included one in our post:Sometimes, Google displays a list:In that case, you’ll want to format your content as a listicle too (with proper subheadings).Further readingGoogle’s Featured Snippets: All You Need to Know to Get Them 5. Give people a reason to link to your contentLinks are an important Google ranking factor. Generally speaking, the more people you can get to link to your content, the higher the likelihood of it performing well.How do you get more links to your post? You need to give people a reason to link to your content.Generally, people link because there’s something unique in your content—either a unique angle or you’ve added unique pieces of information. Here are some ideas on how you can make your content unique:Produce original research – For example, we ran a poll for this post on SEO pricing and did a data breakdown for this one on hidden Google Search Console terms.Use your personal experience – For example, we spent over $200K on Quora ads and wrote about it. Approach topics from a lesser-seen angle – For example, we offered a different opinion on how to measure content marketing KPIs.Interview experts – For example, we interviewed four link building experts and compiled their experiences in our post on international link building.Offer an alternative take – For example, when zero-volume keywords were all the rage in SEO, we wrote about why it shouldn’t be so hyped up. Likewise, we also offered an alternative take on Google’s AI content guidelines. 6. Make sure your post is easy to readGoogle says it uses user interaction data to assess whether search results are relevant:If your post is difficult to read and your visitors bounce—it may not be great for your SEO. So you’ll want to make sure that your content is as easy on the eye as possible:Use descriptive subheadings (H2–H6) for hierarchyUse bullet points to help with skim readingUse images and GIFs (where needed) to break up the textUse short sentences and paragraphs to avoid “walls of text”Use simple words that everyone can understandWrite like you speak to make your writing conversationalRead your copy out loud (when editing) to smooth the flow7. Get someone with expertise or experience to create the contentGoogle aims to reward pages that demonstrate E-E-A-T:Experience – Firsthand or life experience in the topic.Expertise – High level of knowledge or skill in a particular field.Authoritativeness – Reputation, particularly among other experts and influencers in the industry.Trustworthiness – Legitimacy, transparency, and accuracy of the website and its content.Put simply: Google rewards content that displays evidence of expertise or experience.Sidenote. This is especially important if you’re writing about medical, financial, or legal topics. Google calls these Your Money or Your Life (YMYL) topics and requires you to have formal expertise.For example, most of our blog content is created by our marketing team: a team built from SEOs and marketers with years of experience. For example, my colleague, Chris Haines, has 10 years of experience working in an SEO agency.Even then, when we’re covering topics where we do not have firsthand experience, we’ll reach out to experts. For example, we interviewed several SEO experts like Marie Haynes to create an article about Google penalties—a topic that she is well known to specialize in.You’ll want to do the same for your content too.It can be simple things like actually using the products you’re reviewing. Or going through a particular process or procedure—like actually experiencing intermittent fasting if you’re writing about it. Otherwise, if you do not have expertise or experience, hire someone who has it to create or review your content. Further readingWhat Is E-A-T? Why It’s Important for SEOE-E-A-T Is the New E-A-T. What the New “E” Means for SEO8. Add internal links to relevant resourcesInternal links are important for three main reasons:They help Google discover new pages.They help Google understand what your page is about via anchor text: the clickable words in the link.They pass PageRank, which is an important Google ranking factor.So not only do you want to add internal links to other relevant pages on your site, but you’ll also want to add them to your newly published posts too.The easiest way to find relevant pages to internally link to is to perform a site search. For example, if I want to add internal links to my post on the Skyscraper Technique, this is what I’ll search:Besides the first result (the actual post), the rest are potential targets I can add links from.This method is mostly manual, so a quicker way to do this is to sign up for Ahrefs Webmaster Tools and run a crawl of your site with Site Audit. Once that’s done, head to the Link opportunities report. The report will suggest potential internal links you can add.Further readingInternal Links for SEO: An Actionable Guide 9. Optimize your imagesAccording to SparkToro, Google Images is the world’s second-largest search engine. Your images can rank and send traffic your way too.Here’s how to optimize them:Compress your images – This makes file sizes smaller and helps your page speed. You can use a tool like ShortPixel to do this.Use descriptive filenames – Google says that filenames give it clues about the image’s subject matter. Be descriptive and succinct and use dashes between words.Use descriptive alt text – Google also uses this to understand the subject matter of an image. Again, be descriptive and concise. Don’t stuff keywords.Further readingImage SEO: 12 Actionable Tips (For More Organic Traffic) 10. Write a compelling title tagAfter searching for a keyword in Google, the first thing a user will see is the title tags.A good title tag can be the critical difference between a searcher choosing you or the others.Here’s how you can write one that’s click-worthy:Keep them short – Google often truncates title tags above 70 characters.Match search intent – You’ve done that in step #2, so make sure your titles reflect that.Include the keyword – Google uses the title to understand what a page is about, so try to include your target keyword.Include the year – Do this if your target topic demands fresh results.Use power words – These words elicit emotion (e.g., awe-inspiring, captivating, etc.). Don’t go overboard—one or two is fine. Use this list to find ones that match your content.Don’t clickbait – #4 won’t shock your readers. Clickbait title tags may work in the short term but will damage your brand in the long term. Treat your readers as smart people and offer them descriptive and truthful titles. Further readingHow to Craft the Perfect SEO Title Tag (Our 4-Step Process) 11. Set an SEO-friendly URLGoogle’s recommendation is to use words that are relevant to your content. The easiest way, typically, is to use your target keyword as your slug. So for a post targeting the keyword “diy seo,” the slug will simply be:Further readingHow to Create SEO-Friendly URLs (Step-by-Step) Keep learningCheck out these resources to learn more about SEO:SEO: The Complete Guide for BeginnersHow to Write a Blog Post (That People Actually Want to Read) in 9 Steps Blog SEO: The Complete Guide20 Actionable Blogging Tips for Beginners Any questions or comments? Let me know on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Keep Learning Republishing Content: How to Update Old Blog Posts for SEO In this guide, you'll learn how to republish old blog posts for more organic traffic in three easy steps. How to Target Keywords With Blog Posts (& Get More Search Traffic) Learn the three-step process on how to target keywords using blog posts. How To Optimize PDFs For SEO, But You Should Make Pages Instead Learn how Google treats PDFs, how to optimize them for SEO, and how to track PDF views. How to Create & Optimize Landing Pages for SEO (Step-by-Step Guide) Landing pages are web pages designed to convert traffic into leads. In this guide, you'll learn how to optimize and rank your landing pages. Content Refreshing: A Step-by-Step Strategy (Based on Updating 50+ Posts) Learn what content to refresh and how to do it right to increase organic traffic and ensure your site's information is updated and relevant.",
  "headers": [
    {
      "level": "H1",
      "text": "11 Easy-to-Follow Tips to Optimize Your Blog Posts for SEO"
    },
    {
      "level": "H2",
      "text": "1. Target a topic with search traffic potential"
    },
    {
      "level": "H2",
      "text": "2. Align your blog post with search intent"
    },
    {
      "level": "H2",
      "text": "3. Cover important subtopics searchers want to see"
    },
    {
      "level": "H2",
      "text": "4. Optimize for featured snippets"
    },
    {
      "level": "H2",
      "text": "5. Give people a reason to link to your content"
    },
    {
      "level": "H2",
      "text": "6. Make sure your post is easy to read"
    },
    {
      "level": "H2",
      "text": "7. Get someone with expertise or experience to create the content"
    },
    {
      "level": "H2",
      "text": "8. Add internal links to relevant resources"
    },
    {
      "level": "H2",
      "text": "9. Optimize your images"
    },
    {
      "level": "H2",
      "text": "10. Write a compelling title tag"
    },
    {
      "level": "H2",
      "text": "11. Set an SEO-friendly URL"
    },
    {
      "level": "H2",
      "text": "Keep learning"
    }
  ],
  "author": "Si Quan Ong"
}