{
  "url": "https://ahrefs.com/blog/how-to-get-a-job-in-seo/",
  "slug": "how-to-get-a-job-in-seo",
  "title": "How to Get a Job in SEO",
  "description": "In this guide, you'll learn how to get a job in SEO. We'll cover everything from finding the right opportunity to acing the interview.",
  "content": "Chris Haines Chris is an SEO director who has 10 years of experience in SEO, agency side. When not involved in SEO, he enjoys messing around with vintage synthesizers, walks on sandy beaches, and a good cup of tea. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents I’ve worked in SEO for 10 years in different agencies. And in that time, I have reviewed many different resumes as a hiring manager.I’ve also interviewed lots of exceptional candidates and some not-so-great candidates for SEO roles. So what exactly does it take to get a job in SEO? And what separates the exceptional candidates from the not-so-great candidates?In this step-by-step guide, I will give you the cheat codes to fast-track your SEO career by showing you exactly what skills you need to obtain to get the interview, get your foot in the door, and get the job.Ready to get the job? OK, let’s go!ContentsStep 1. Learn the SEO basics (No, you don’t need to go to college)You may be surprised to learn that most hiring managers aren’t looking for SEO geniuses for entry-level positions. They also aren’t expecting you to have a college education. They’re actually looking for you to be passionate and have good attention to detail, according to our own survey of hiring managers:But the reality is that without knowing at least the basics of SEO, these hiring managers won’t even give you the time of day. So what are the SEO basics you need to know?To start off, I recommend that you take a look at our SEO beginner’s video course. Or if you prefer reading to watching, make sure you check out our beginner’s guide to SEO. These resources will give you a good grounding in basic SEO principles and will mean you can talk confidently about SEO during the interview.If at any point you don’t know what some of the harder-to-decipher SEO terms mean, you can always check our SEO glossary, which provides the definitions of SEO terminology. Once you have completed the training and feel comfortable with the SEO terminology, your SEO education doesn’t stop there. You will definitely need to learn a few basic practical skills. Skill 1. Use Excel or Google Sheets confidentlyTo get a job in SEO, you don’t need to be a Microsoft Excel or Google Sheets ninja. But knowing how to use formulas and features like VLOOKUP, XLOOKUP, Power Query, CONCATENATE, text to columns, and pivot tables is definitely going to give you a head start. You will spend a lot of your SEO life in Excel or Google Sheets, so it pays to learn these skills early on—if you aren’t familiar with them already.The more time you invest in learning Excel or Google Sheets, the more efficient you will be in your job. And this is a valuable skill that hiring managers are looking for.Learn more: 10 Google Sheets Formulas Every SEO Should KnowSkill 2. Be able to use popular SEO toolsIf you haven’t realized already, SEOs use a lot of tools to collect data and you need to know how to use them. A quick look at our survey shows that hiring managers really value experience in working with SEO tools.Our survey also shows that 86.6% of hiring managers want to see experience with these four popular tools:Skill 3. Understand the principles of keyword researchMost SEO roles for entry-level positions will, at some point, get you to do keyword research, so it really pays to understand this skill early on.Luckily, this is the first thing our Academy course teaches.Step 2. Set up your own websiteIf you don’t already have a website, now is a good time to set one up. Familiarize yourself with platforms such as WordPress and try to rank for a few keywords on your site. If you don’t have any prior work experience with another SEO company, then showing that you have taken the initiative to set up a website and rank it for certain keywords is a good way to show your passion and interest in SEO.I initially got into SEO by managing my own websites, as well as helping my parents optimize their website to secure more orders for their e-commerce business. You don’t always have to start off in an agency environment to gain experience (but it definitely helps!). Assisting friends and family with their websites is a good way to gain experience early on as well.Step 3. Familiarize yourself with Google Search Essentials (formerly Webmaster Guidelines)The search market is still dominated by Google. So if you work in SEO, you need to be familiar with the rules of the game. Carefully digest the Google Search Essentials (formerly Webmaster Guidelines) and work within the guidelines. (If you suggest SEO strategies that are against Google Search Essentials guidelines, then a hiring manager will almost certainly turn you down.)Step 4. Make your SEO resume stand out from the crowdI have looked at many resumes over the course of my career and, unfortunately, many of them don’t always hit the mark. As a candidate, you put a lot of effort into crafting the perfect resume, but hiring managers don’t always have the time to read all the details. They may even be checking resumes during their lunch break in a matter of seconds. Here are my top tips to ensure your resume gets noticed:Tip 1. Stick to the point and keep the most important details on the first pageIn terms of your resume, make sure that you keep it to the point (no more than two pages). Also, ensure it is professionally presented. Don’t waste any of the hiring manager’s time and try to avoid resume cliches such as “highly motivated individual, ready to hit the ground running.” Stop. This is meaningless nonsense. Write about what makes you different from all the other applicants. If you don’t have any work experience just yet, write about how you optimized your website for its key terms.Tip 2. Use a design tool to create a professional-looking resumeIn days gone by, submitting your Microsoft Word resume would have been sufficient. But these days, tools such as Canva can help you make a professional-looking resume that looks great. (Yes, it is totally free.)Tip 3. Use a professional email addressUnfortunately, I still see many stories on social media of hiring managers rejecting resumes due to their inappropriate email addresses. Don’t be one of them!https://twitter.com/joydoreenbiira/status/1419697904302841858?s=61&t=RJA0NyXvL8M4VEiwwvuQjwTip 4. Avoid resume clichesTry to avoid using buzzwords or cliches in your resume.Step 5. Apply for a job at an SEO agencyWhy apply at an SEO agency and not in-house? Working at a small agency will give you the opportunity to gain a wide number of broad experiences very quickly, as you will typically be working with multiple clients in different industries.You can apply to SEO agencies in your location and also set up indeed.com job alerts to be notified about new jobs with your search terms so you have relevant opportunities sent to your inbox. RecommendationIf you find an agency that you like the look of but it doesn’t currently have any job openings on its website, you can use a tool such as Distill.io to track any changes on its “jobs” landing page. So in the event that the agency does update the job listings on that page in the future, you will be the first to know either through an SMS notification or by email.It’s worth noting that the naming conventions of entry-level SEO positions can vary quite a lot.On indeed.com, I found that the most relevant jobs were classed as “SEO Intern” or “SEO Graduate,” so you will need to apply for these roles. (If you are outside of the U.S., naming conventions may differ.)Some agencies also operate graduate schemes, where they operate placements for a number of months and then hire the best candidates following that. Details of these schemes will most likely be on the agencies’ websites, but you can always contact them to check whether they operate a scheme.One last bit of advice is what constitutes a red flag in terms of job listings. Sometimes, you will see “SEO” in the job listing. But if you scroll down to the description of the role, you will see that responsibilities will include SEO, website management, etc. Basically everything. These types of jobs will typically be extremely demanding, and the reality is that you will not be able to complete all of these responsibilities. So I’ll avoid such jobs. For your first role, I’ll try to look for job listings that focus specifically on the day-to-day tasks of SEO within the description.THE SEO AGENCY CAREER PATH IN A NUTSHELLYou may be wondering what is the typical career path following the SEO intern/graduate stage. Here is an example of a typical progression at an agency:SEO Intern/Graduate > SEO Executive > SEO Manager > SEO Director > Head of SEOAnd here is my suggested five-year career route to get to a senior role:Phase 1 – Join a small agency. One to two years.Phase 2 – Join a larger agency or go in-house. Two to three years.Phase 3 – Move to a senior-level role (manager, director, or head of department).Step 6. Prepare for the interview and get an offerBefore the pandemic, interviews were always in person at the company’s office. These days, however, many interviews are conducted via video conferencing.My tips for interviews are as below:Install popular video conferencing software – Download Microsoft Teams, Zoom, and Google Meet. Then familiarize yourself with the interfaces beforehand. (Avoid the “Sorry, I was on mute” scenario!) Run a test call to check your mic and webcam are working properly and that the room is well lit. If you are using wireless headphones, make sure they are suitably charged.Look professional – If you have two screens, remember to focus on the screen with the camera on it to avoid the look that you are not paying attention to what the hiring manager is saying.Be prepared to accept tasks – As algorithms can change a lot in SEO, many hiring managers are looking for experiential learners or, in simpler terms, people who can learn “by doing.” Be aware that some hiring managers may set tasks for you. Check the company’s website – A quick glance at the company’s website beforehand and checking out its latest social media posts can mean that you know exactly what its focus is.Check SEO interview questions on Google – A bit of Googling beforehand around “SEO interview questions” will also help you understand the types of questions you are likely to get in the interview.Ask questions – At the end of the interview, the hiring manager will ask if you have any more questions about the role. This is a good opportunity to ask how long it will take to hear back from them on whether you have been successful.Every interview is different. But in terms of questions that you may be asked at the interview, there are typically three sections to a standard interview:The introduction.“Please talk me through your resume.”“What would you do in terms of SEO strategy for X website?” (The website is typically the company’s own site or a client’s.)If a hiring manager is not sure about your knowledge of a certain aspect of SEO, then they may choose to ask questions around that topic. Example: “You mentioned that you optimized your website for site speed and Core Web Vitals. How exactly did you do that?” (Typically, a hiring manager at an agency will be mostly concerned with their biggest client’s market, e.g., maybe it is e-commerce.) Don’t get discouraged if you get a rejection. This is just part of the normal process and will help you learn and develop your skills. Be aware it is likely that you will not get a job on your first interview.Final thoughtsReceiving an offer for a job can be an exciting moment. But it’s important to remain calm and review all the details of the contract to ensure everything is correct and as discussed. I recommend getting a family member or friend to check over the details if you are not used to reviewing contracts. The priorities to check are obviously your name, address, pay, place of work, and hours.Getting a job in SEO can be highly competitive at first. But once you have some basic experience, you can rise through the ranks quickly. (On Google as well as in the office.)I hope you found this guide helpful and that you end up getting the job. (Let me know if you do!) Got more questions? Ping me on Twitter. 🙂 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Chris Haines Chris is an SEO director who has 10 years of experience in SEO, agency side. When not involved in SEO, he enjoys messing around with vintage synthesizers, walks on sandy beaches, and a good cup of tea. Keep Learning Steal Our SEO Specialist Job Description Template This SEO specialist job description template was created from a survey of 15 SEO hiring managers. I Analyzed 52 SEO Specialist Job Listings. Here’s What They Do and How You Can Become One SEO specialists are responsible for improving a website’s visibility in organic search results. But what exactly do they do? I Analyzed 52 SEO Manager Job Listings. Here’s What They Do and How You Can Become One SEO managers are responsible for developing the strategy to improve a website's search visibility and organic traffic. But what exactly do they do and what skills and qualifications do they need?",
  "headers": [
    {
      "level": "H1",
      "text": "How to Get a Job in SEO"
    },
    {
      "level": "H2",
      "text": "Step 1. Learn the SEO basics (No, you don’t need to go to college)"
    },
    {
      "level": "H3",
      "text": "Skill 1. Use Excel or Google Sheets confidently"
    },
    {
      "level": "H3",
      "text": "Skill 2. Be able to use popular SEO tools"
    },
    {
      "level": "H3",
      "text": "Skill 3. Understand the principles of keyword research"
    },
    {
      "level": "H2",
      "text": "Step 2. Set up your own website"
    },
    {
      "level": "H2",
      "text": "Step 3. Familiarize yourself with Google Search Essentials (formerly Webmaster Guidelines)"
    },
    {
      "level": "H2",
      "text": "Step 4. Make your SEO resume stand out from the crowd"
    },
    {
      "level": "H3",
      "text": "Tip 1. Stick to the point and keep the most important details on the first page"
    },
    {
      "level": "H3",
      "text": "Tip 2. Use a design tool to create a professional-looking resume"
    },
    {
      "level": "H3",
      "text": "Tip 3. Use a professional email address"
    },
    {
      "level": "H3",
      "text": "Tip 4. Avoid resume cliches"
    },
    {
      "level": "H2",
      "text": "Step 5. Apply for a job at an SEO agency"
    },
    {
      "level": "H2",
      "text": "Step 6. Prepare for the interview and get an offer"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Chris Haines"
}