{
  "url": "https://ahrefs.com/blog/how-to-rank-higher-on-google/",
  "slug": "how-to-rank-higher-on-google",
  "title": "How to Rank Higher on Google (10 Steps)",
  "description": "Improve your Google rankings in 10 easy steps to get more organic traffic to your website.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Hundreds of factors could improve your Google rankings. But some are more difficult to influence than others.For that reason, if you want to rank higher, you need to be methodical. Start by working on the easy things that are within your control, then move on to more challenging things if needed.Here’s the process:ContentsBefore we get started…The process in this guide works best for internal pages. If you want to rank your homepage, read our guide to homepage SEO. If you run a local business and want to rank in local search, read our guide to local SEO.1. Choose a keywordIf you already know which keyword you want to rank higher for, skip this step. Otherwise, you need to find a page that could rank higher for its target keyword. Here’s an easy way to do this:Paste your domain into Ahrefs’ Site ExplorerGo to the Organic keywords reportFilter for rankings in positions 2–10You should now see all keywords you rank for on the first page of Google, but not in position #1. All you have to do is choose one.Here’s a tip: look for your main keyword targets for the corresponding page.For example, our guide to learning SEO ranks in position #10 for “how long does it take to learn SEO.” But this isn’t the primary target keyword for the page, so it’s likely not the best one to try to improve rankings for.Recommendation If you don’t have any first-page rankings, try to rank higher for keywords on page two or three. It’s usually easier to improve rankings for pages that are already doing quite well. But if you don’t have any, improving rankings on page two or three is your best bet. 2. Match search intentSearch intent is the “why” behind the query. It’s why 90% of the top-ranking results for “air fryer” are blog posts and not sales pages. Google understands that searchers aren’t ready to buy. They want to compare products.You need to align your page with search intent to stand the best chance at ranking.We learned this the hard way when trying to rank for “backlink checker.” Here’s the page we first created: You can see that it explains how to check a site’s backlinks with Ahrefs and offers searchers a free trial. This performed OK and ranked for years in positions #6–10—but it never cracked the top five.In 2018, we realized this was a search intent issue. All the top-ranking pages for “backlink checker” were free tools. To solve this, we added a free tool to the page. Almost overnight, the page shot to #1—and it’s been there ever since.To see how well your page aligns with intent, check the top-ranking pages for the three Cs:Content type – Are they mainly blog posts, product, category, landing pages, or something else? Content format – Are they mainly tutorials, listicles, how-to guides, recipes, free tools, or something else?Content angle – Is there a dominant selling point, like low prices or how easy it is?For example, all the top-ranking pages for “pancake recipe” are blog posts with recipes. And the dominant selling point is how easy they are to make.3. Cover the topic in fullEven if your content aligns with search intent, you may not be giving searchers everything they want. There may be subtopics they’re looking for and expecting you to cover.For example, most top-ranking results for “how to write a press release” are how-to blog posts. This paints a clear picture of search intent.But if you look at these posts, most of them include a template or links to templates.Google likely knows that searchers value posts with templates more than those without, so you should probably include one if you want to rank higher for this keyword.Here are a couple of ways to find subtopics to include in your content:Eyeball the top-ranking pages for commonalities – Pay particular attention to subheadings. Find keywords top-ranking pages rank for that you don’t – These often map to subtopics. Here’s how to do the latter in Ahrefs’ Site Explorer:Paste your page into Site ExplorerGo to the Content Gap reportPaste in a few top-ranking URLsFor example, here’s what we get if we plug in our post about creating a go-to-market strategy. 4. Update the pageFreshness is a query-dependent Google ranking factor. If searchers are likely to value updated content, Google ranks fresh pages higher. For example, people value freshness when searching for “top google searches.” They want the most popular Google searches right now, not 10 years ago. That’s why rankings and traffic for our page drop when the content becomes stale and jump back up when we update the page.If you’re unsure whether Google values freshness, check the dates on top-ranking pages. For example, all top-ranking results for “best headphones” were updated recently. But many top-ranking results for “best parks in london” haven’t been updated for months or even years. This doesn’t matter because it’s not like new parks are built daily.If freshness is important for your keyword, you may rank higher by refreshing your page. 5. Improve on-page SEOMaking the purpose and relevance of your page clear to Google and searchers is the job of on-page SEO. It’s the icing on the cake that highlights the work you put into matching intent and covering the topic in full.Here are a few simple ways to improve your on-page SEO:Use H1–H6 tags to structure your content hierarchically – Google recommends this. Wrap your title in an H1, subheadings in H2s, sub-subheadings in H3s, etc.Use a short, descriptive URL – Google says simple URLs convey content information. Write a compelling title tag and meta description – This may help you get more clicks and send positive signals about your content to Google.Optimize your images – Google says to use brief but descriptive filenames and alt text. It’s also worth compressing images to improve page speed—which is a ranking factor.Polish your copy – Google says users enjoy content that’s well written and easy to follow. Use short paragraphs, good grammar, and proven copywriting techniques to keep readers engaged.Learn more: On-Page SEO: Complete Beginner’s Guide6. Add internal linksInternal links are links from one page on your website to another. They’re important because they’re how PageRank flows around your site. In other words, internal links boost a page’s authority and tell Google it’s important.Here’s an easy way to find relevant internal link opportunities:Sign up for a free Ahrefs Webmaster Tools accountCrawl your website with Site AuditGo to the Internal link opportunities toolSet the target URL to the page you want to rank higherThis tool takes all the keywords your target page ranks for in the top 100 and finds mentions of them on your site. It then suggests them as contextual internal link opportunities.For example, suppose we set our guide to building a content marketing strategy as the target page. In that case, there are 13 potential internal link opportunities. Here’s one of them:Here, it’s suggesting that we internally link the phrase “content marketing strategy” in our list of content marketing tools.Internally linking this phrase may help our post to rank higher. If you don’t see any results in this report, it’s either because:Your target page doesn’t rank in the top 100 for any keywords.You don’t mention any of the keywords it ranks for on your site.Either way, you can find opportunities in Google by searching for site:domain.com \"[keyword]\".For example, there are plenty of mentions of “content marketing strategy” on our blog.7. Merge similar pagesHaving many similar pages about the same thing is shooting yourself in the foot. That’s because backlinks get spread between pages and are a ranking factor. So you can end up with many weak pages instead of one strong enough to rank.To solve this problem, redirect weaker pages about a topic to the strongest one. This consolidates backlinks and creates a page more capable of ranking.To find pages on your site about the keyword you want to rank higher for, search Google for site:domain.com [keyword].For example, our site has two very similar pages about meta keywords. We have a blog post explaining meta keywords and a glossary page that does the same thing. Redirecting one of these to the other to consolidate backlinks may help us rank higher for this keyword. It creates one stronger page from two weaker pages.Recommendation Keep search intent in mind when doing this. If your pages fulfill different intents, redirecting may not be the best idea. This tactic is best when pages are very similar. 8. Build more backlinksBacklinks are one of Google’s most important ranking factors. Andrey Lipattsev, a search quality senior strategist at Google, confirmed this in 2016. Unfortunately, building high-quality backlinks is one of the most challenging parts of SEO. This is because it’s not something you can fully control. You have to create something worthy of earning backlinks, then convince people to link to you. This is why it’s the final step in our process. Here’s a good starting point if you’re new to link building:Paste a competing page into Site ExplorerGo to the Backlinks reportLook for backlinks you may be able to replicateFor example, let’s say we want to build links to our beginner’s guide to SEO. If we search Google for competing pages with the Ahrefs’ SEO Toolbar installed, we’ll find that one has links from over 14K referring domains.According to Ahrefs’ Site Explorer, here’s one of the pages it got a backlink from recently:Looking at the referring page, it seems the link comes from a section listing three of the best SEO guides. If we reach out to the author and introduce our beginner’s guide to SEO, there’s a chance they may add it to their page.Further readingLink Building for SEO: The Beginner’s GuideHow to Get Backlinks: 15 Proven Tactics9 Easy Link Building Strategies9. Track rankingsRank tracking is the only way to know if your efforts to rank higher on Google are working. Although you can do this for free by searching on Google, it isn’t usually reliable. This is because factors like location and search history can affect where you see a page ranking. Using a rank tracking tool like Ahrefs’ Rank Tracker is much more accurate.You can track 10K keywords in this tool, but you only usually need to track the main keyword for each page. Hit the graph caret next to any keyword in Rank Tracker to see its ranking progress over time. 10. Repeat the processRanking high on Google for one keyword is great, but ranking high for many keywords is even better. So once you’ve followed this process for one keyword, repeat it for more.You’ll rank higher for hundreds of keywords and get tons of organic traffic before you know it.Final thoughtsYou can do many things to rank higher on Google, but it makes sense to start with the easy ones that are within your control. If those don’t move the needle, invest in more challenging things like link building.Give me a shout on Twitter if you have any questions. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Keep Learning How to Outsource Your Content to Freelance Writers (4 Steps) Learn how we grew the Ahrefs blog by thousands of visitors per month with freelance writers, and how you can do the same. How To Become an SEO Expert in 4 Steps Looking to become an SEO specialist but how no clue where to start? Go from SEO newbie to SEO pro in four simple steps. The Realities of In-House SEO: What to Expect and How to Succeed Here’s what it’s like to work in an in-house role (from someone who's done it). 12 AI Copywriting Tools to Improve Efficiency With AI copywriting becoming increasingly popular, we share a list of tools that can best streamline your workflow. 7 Easy SEO Tips for Small Businesses People are searching for your business on Google. Here's how to show up.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Rank Higher on Google (10 Steps)"
    },
    {
      "level": "H2",
      "text": "1. Choose a keyword"
    },
    {
      "level": "H2",
      "text": "2. Match search intent"
    },
    {
      "level": "H2",
      "text": "3. Cover the topic in full"
    },
    {
      "level": "H2",
      "text": "4. Update the page"
    },
    {
      "level": "H2",
      "text": "5. Improve on-page SEO"
    },
    {
      "level": "H2",
      "text": "6. Add internal links"
    },
    {
      "level": "H2",
      "text": "7. Merge similar pages"
    },
    {
      "level": "H2",
      "text": "8. Build more backlinks"
    },
    {
      "level": "H2",
      "text": "9. Track rankings"
    },
    {
      "level": "H2",
      "text": "10. Repeat the process"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Joshua Hardwick"
}