{
  "url": "https://ahrefs.com/blog/how-to-increase-website-authority/",
  "slug": "how-to-increase-website-authority",
  "title": "How to Increase Website Authority (Domain Rating)",
  "description": "Learn what website authority is, how Domain Rating (DR) is calculated and how to increase your score the right way.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents If you want to rank higher in Google and get more organic traffic to your website, you might have read that increasing your website authority is the solution.However, the truth is that while increasing website authority is never a bad thing, increasing the score itself shouldn’t be your primary focus.Instead, you should focus on what causes the score to rise: that’s high-quality backlinks from authoritative websites.In this guide, you’ll learn:What website authority (Domain Rating) isHow it’s calculatedHow to increase your Domain Rating (the right way)New to link building? Check out ourBeginner’s guide to link buildinghttps://www.youtube.com/watch?v=cl1Ch9ARdQsWhat is website authority? (Domain Rating)Website authority is a metric from SEO tool providers. It measures the relative strength of a site’s backlink profile compared to every other site in their index.Pretty much every major SEO tool has this metric, but its name and the way it’s calculated differs in each one.At Ahrefs, our website authority metric is Domain Rating (DR).Like most other website authority metrics, it runs on a scale from 0-100.Sidenote. You can check your domain’s authority by plugging it into our free website authority checker.Website Authority CheckerCheck the authority of your domain Check AuthorityNow, it’s essential to understand that the scale for Domain Rating is logarithmic. That means it’s much more challenging to go from DR 69-70 than 9-10.A good way to visualize this is to think about rankings in a video game.Maybe you start as a “Scout,” and it might take you a few hours to gain your “Ranger” badge. But jumping to the next level could take months, and only truly dedicated players will ever get to “Epic” status.The logarithmic scale also means that a DR 20 site is more than twice as ‘authoritative’ as a DR 10 site.How is Domain Rating (authority) calculated?Before trying to increase your website authority, you first need to know how the Domain Rating is calculated.So let’s explore the three main things that impact Domain Rating.The number of websites linking to youThe DR score of linking domainsThe number of sites each referring domain links to1. The number of websites linking to youIn Ahrefs, we have a metric called referring domains. This is the number of websites that link to a page or website.You’ll see this for any site you analyze in Site Explorer.Some people think that the higher this number, the higher your Domain Rating. But it’s not quite that simple because we only take ‘followed’ links into account in our DR calculations. Links with UGC, sponsored, and nofollow attributes won’t improve DR.Also, subsequent links from the same website won’t improve a site’s DR since we count referring domains and not backlinks.2. The DR score of linking domainsAnyone can get thousands of links from a bunch of low-quality sites. That’s why we also take into account the DR score of the linking site when calculating DR.This means that backlinks from websites with high DR scores tend to increase your Domain Rating more than those with low DR scores.That’s an interesting point to know. It means that as the DR of a linking website increases, so can yours.For example, if you build a link from a DR 15 website today, and the owner of that website works hard to build authority and links over time, then that same link might be from a DR 40 website in a year. So even if you only ever built that one link, your DR score would likely increase over time.The takeaway here is that it pays to build links from sites that show potential, even if their DR scores are quite low at the time.How can you judge ‘potential?’First, check their content. If they’re publishing high-quality stuff, they’re more likely to attract high-quality links naturally over time.Second, check their link growth in Ahrefs’ Site Explorer. If there’s a slow and steady upward slope on the referring domains graph, chances are things will continue in that direction and their DR will grow over time.3. The number of sites each referring domain links toLet’s say that you build two ‘followed’ links: one from The Guardian and one from IMDB. Both of these sites have identical DR scores, but which link would increase your Domain Rating the most?Answer: It depends on the number of sites they each link to with at least one followed link. The more unique websites a site links to, the less so-called “DR equity” it can pass.So, let’s check the Linked Domains report for each site and filter for ‘followed’ links only.It looks like The Guardian links to around 50x more sites than IMDB (272,218 vs. 5,256). Therefore, the link from IMDB would increase your Domain Rating more than the one from The Guardian.Let’s look at how big of a difference this can make to DR.This website has one referring domain, which is IMDB. It’s DR score is 34.This website also has one referring domain, but this time it’s The Guardian. It’s DR score is 1.5.It’s crucial to note that this doesn’t make all links from IMDB more ‘authoritative’ than links from The Guardian. There are a lot of factors that contribute to a good backlink.How to increase your Domain RatingBuild more ‘followed’ links to your site and your Domain Rating will increase. It’s as simple as that. Just keep in mind that if the site you get a link from has a low DR score itself, or links out to lots of websites, the increase in Domain Rating may be negligible.It’s also important to note that building links to random pages won’t always help increase your rankings or organic traffic. As that’s almost certainly your end goal, you should focus on building links directly to the pages that you want to rank in Google. That will have a bigger impact on organic traffic and rankings than simply “increasing DR.”We know this because we studied it. The number of referring domains to a page correlates more closely with organic traffic than the DR of the ranking website.That said, building links to the page you want to rank in Google isn’t always easy.For example, it would be hard for a printing company to get people to link to a page selling business cards because there’s little incentive to do so. So, if you’re struggling…Here’s how to indirectly increase your website (domain) authority in a ‘meaningful’ way:Create content that people want to link toPitch relevant and authoritative websitesUse internal linking to improve the ‘authority’ of important pages1. Create content that people want to link toThat means something with these three attributes:Non-commercialPeople are more likely to link to pages that aren’t just about making you money. That’s why it’s so hard to get links to sales pages and affiliate reviews.HelpfulThere are two ways to create something helpful.The first is to create something with utility. Think blog posts, calculators, and free tools. Our free backlink checker is a good example of this. It has attracted backlinks from 1,850+ referring domains.The second is to create something with citability. Think stats, studies, and unique ideas that bloggers and journalists will reference when making a point.Our study showing how long it takes to rank in Google is a good example, having attracted backlinks from 880+ referring domains.Has a history of getting linksInstall Ahrefs’ SEO toolbar, search Google for the topic of your content idea, then look at the number of referring domains to the top-ranking pages.If they have a decent number of links, then that’s a sign of a link-worthy topic. Why? Because you can see that pages about the topic have a history of attracting links.That said, make sure to avoid topics that are past their sell-by date.For example, take a look at the top-ranking results for “the dress illusion”: There are indeed lots of websites linking to these pages, but that’s because it was a citable topic for a short period in 2015 when the photo went viral. If these posts were published today, they would be hard to build links to.Struggling to find a winning topic?Go to Keywords Explorer, search for a seed keyword, then check the “All keywords” report. You should see tons of potential keyword ideas based on the seed.From here, add words like who, what, when, why, how, guide, tool, calculator, stats, statistics, and study to the “Include” filter as a comma-separated list, then toggle “Any word.”This effectively filters for topics with high utility or citability.Finally, filter for keywords with a high Keyword Difficulty (KD) score, say 40+, to find topics with a history of getting links. The logic here is that because Keyword Difficulty is based on the average number of linking domains to the top-ranking results, the pages that rank for high KD keywords will have lots of backlinks.Look for a relevant and worthwhile topic in the results, then create your content in line with search intent.2. Pitch authoritative and relevant websitesHaving content that people want to link to is great, but nobody can link to content that they don’t know exists.That’s why you need to reach out and tell them about it.Now, there are tons of ways to find relevant people to contact, so here are three groups to consider to get started:People who are featured in your articlePeople who’ve written articles about similar topicsPeople who’ve linked to articles on similar topicsLearn more about how to find and pitch these people in our guide to blogger outreach.3. Use internal linking to improve the ‘authority’ of important pagesKeep running through the process above to continually increase your website authority and improve SEO. You can then use the Middleman Method to direct some of that ‘authority’ to the pages that you want to rank.Final thoughtsImproving your website authority should never be your main aim. Instead, focus on building high-quality links from relevant and authoritative websites to the pages you want to rank. Your Domain Rating will increase as a natural byproduct of this process.That said, links aren’t the only Google ranking factor. If your real goal is to rank higher on Google, follow our 6-step guide.Or, if you’re not yet ranking on the first page, read our interactive guide to first-page rankings.Got questions? Ping me on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Keep Learning Nofollow vs. Follow Links: Everything You Need to Know Nofollowed vs. followed links. What's the difference? How do they affect SEO? Learn everything you need to know in this complete guide. SEO Automation: 9 Tasks That Save You Time & Money Save time to work on your SEO strategy and execution with these nine tasks that automate repetitive SEO activities. How to Create an XML Sitemap (and Submit It to Google) Learn what a sitemap is, why you need one, how to create one, and how to submit it to Google. What Is Semantic Search? How It Impacts SEO Semantic search is an information retrieval process used by modern search engines to return the most relevant search results. Enterprise SEO Strategies For Maximum Growth Enterprise SEO can be defined by the size of the company or website, the complexity of the technology or teams, or by global operations.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Increase Website Authority (Domain Rating)"
    },
    {
      "level": "H2",
      "text": "What is website authority? (Domain Rating)"
    },
    {
      "level": "H2",
      "text": "How is Domain Rating (authority) calculated?"
    },
    {
      "level": "H3",
      "text": "1. The number of websites linking to you"
    },
    {
      "level": "H3",
      "text": "2. The DR score of linking domains"
    },
    {
      "level": "H3",
      "text": "3. The number of sites each referring domain links to"
    },
    {
      "level": "H2",
      "text": "How to increase your Domain Rating"
    },
    {
      "level": "H3",
      "text": "1. Create content that people want to link to"
    },
    {
      "level": "H4",
      "text": "Non-commercial"
    },
    {
      "level": "H4",
      "text": "Helpful"
    },
    {
      "level": "H4",
      "text": "Has a history of getting links"
    },
    {
      "level": "H3",
      "text": "2. Pitch authoritative and relevant websites"
    },
    {
      "level": "H3",
      "text": "3. Use internal linking to improve the ‘authority’ of important pages"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Joshua Hardwick"
}