{
  "url": "https://ahrefs.com/blog/how-to-become-a-better-writer/",
  "slug": "how-to-become-a-better-writer",
  "title": "How to Become a Better Writer (Beginner's Guide)",
  "description": "Becoming a better writer takes time and effort. To help you along, we'll share some great ways to achieve this goal.",
  "content": "Chris Haines Chris is an SEO director who has 10 years of experience in SEO, agency side. When not involved in SEO, he enjoys messing around with vintage synthesizers, walks on sandy beaches, and a good cup of tea. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Becoming a better writer takes time. From pitching your idea to getting published—it’s a long process. But what are the best ways to become a better writer, and how can you do it?ContentsUnderstand your audienceLet’s start with the basics: Who are you writing for? Do you know your audience?There may be a difference in who you think you are writing for vs. who your actual audience is. At Ahrefs, we post polls on social media to learn more about our audience.For example, here’s a poll that our chief marketing officer, Tim Soulo, ran to do some audience research.This poll shows that most of the Ahrefs Insider members are from in-house or affiliate marketing backgrounds, so we probably need to focus on these audiences when we write content.Holding a poll is a good way to get a snapshot of your audience. You can also try this if you have an engaged social media audience.Understand whether people want to read about your topicUnless you’re a subject matter expert, you may be wondering what topics people are actually interested in reading about.Luckily, it’s easy to find what people are searching for using a tool like Ahrefs’ Keywords Explorer. An easy way to judge whether people are searching for your topic is to look at the search volume. Here’s a quick example of a search query that has a low volume.And here’s another example with a much higher volume.Let’s say we want to build out this topic on “things to do in london.” We can use the Matching terms report to do this.First, plug in the keyword and head over to the Matching terms report. Then group “By terms” and “Show as list.”The sidebar shows matching terms you can write about:“best things to do in london”“free things to do in london”“fun things to do in london”“things to do in london with kids”From a quick search, we’ve identified a couple of different angles we can write about on this topic that people are searching for and want to read.If you want to explore even more keywords, check out the Related terms and Search suggestions reports under the “Keyword ideas” section.Using these methods ensures you write about relevant topics people are actively searching for.Consider what’s working alreadyOnce you’ve established that people want to read about your topic, it’s now a good idea to assess the competition. Let’s say you want to spy on your competitors and see what’s ranking in Google. To do this, enter your keyword in Keywords Explorer, click on “Overview,” and scroll down to the SERP overview. On this page, we can see the top-ranking results in Google for this query. Let’s click on the top result and see what the webpage looks like. According to Tripadvisor, we can see that the Tower of London, the British Museum, and the London Eye are the top three things to do in London.If we were writing about this topic, prioritizing these three attractions in our content would be a good idea.Further ViewingHow to Create Content That’s “Better” Than Your Competitor’sKeep a journal or start a blogWe are what we repeatedly do. Excellence, then, is not an act, but a habit.Will Durant, Writer, Historian, PhilosopherWhen you want to get better at something, you’ll need to keep practicing—writing is no different. Contrary to popular advice, this doesn’t mean you have to write every single day—but try to write as much as you can. The easiest way to do this is to keep a journal or start a blog. Even if you set aside half an hour a day or ~10 hours a month, it will help.Once writing becomes part of your routine, you may find it hard to stop. It may sound obvious, but the key is to take action and produce something rather than spend time talking or thinking about doing it.Tip: Eliminate DistractionsEven when you have allocated time for your writing, it can be easy to get distracted. For example, you may be tempted to check your phone when it sends a notification or “quickly” read the news or social media.That’s why it’s important to set your own rules. Here are some examples of what I do when writing:Not having a phone in the roomUsing a webpage-blocking Chrome extension to stop me from accessing distracting sites, e.g., news, social media, etcWorking in a quiet, peaceful environmentLetting others know that I don’t want to be disturbed for a set period of timeWrite an outlineAt Ahrefs, all our blog content starts its life as a blog post outline. Outlines are skeleton structures of what you intend to write about. When you write an outline, it doesn’t have to be perfect. Rather, it’s about getting your ideas out of your head and onto paper. At Ahrefs, we find it’s a useful way to start our content writing process.You can make your outline as detailed as you want, but we usually try to keep it as simple as possible.Further readingContent Outline TemplateKeep it simpleThe most valuable of all talents is that of never using two words when one will do.Thomas Jefferson, Third President of the U.S. The White HouseWhen it comes to writing, less is often more. To improve your writing, try to:Reduce unnecessary words, i.e., make every word count.Keep your ideas simple and easy to understand.Format your content in a meaningful way that’s easy to read.Reduce the amount of jargon or buzzwords in your writing.Adopt a consistent tone of voice that makes readers want to read your work.If you apply these tips when writing your draft, then you are halfway to becoming a better writer already.Further readingWhat Is Content Writing?Get a peer reviewAt the bottom of each Ahrefs article in our blog, you can see who contributed to the article. This is our peer review process in action.It allows authors at Ahrefs to get feedback about their writing. The peer review process is not always easy—you need to be open to feedback and be able to adapt your work if required. Also, finding someone willing to review your work can be another challenge.In my opinion, peer reviews are useful if you are planning to publish your work online, as it’s better to have feedback on your work before it’s published rather than have it shared on the internet with an avoidable mistake included.Use tools to improve your writingWith millions of tools claiming to help improve your writing, it can be overwhelming to know which ones to use. If you want to keep it simple (and I suggest you do), I would limit your tools to only the essentials. The tools I use for my writing are Grammarly and the Hemingway App.Here’s why:Grammarly is a great all-around grammar checker.Hemingway helps grade your work and is another way to improve your writing.It’s worth checking out other SEO writing tools, but don’t get carried away by their features. Concentrate on your writing output. Also, don’t expect a shiny new tool to act as a silver bullet because, normally, it isn’t.Pitch your articles to websitesThere’s not much point in being the greatest writer in the world if no one reads your work. So in my opinion, it’s crucial to get your work out there. The good news is that the internet has millions of websites that are willing to publish your content. Right now.But how do you find these opportunities?It’s actually easy to identify thousands of opportunities using Ahrefs’ Web Explorer. Head over to the tool and enter the following in the search bar:inurl:write-for-us Once you’ve run the query through the tool, it should look like this: In this example, we can see we have 981,823 pages that contain the phrase in the URL.Let’s narrow it down to relevant blogs about marketing.To do this, let’s change the settings to “One page per domain” and then add “marketing” as a “Page title” filter.We now have a more defined list of 3,993 link prospects that will likely accept our content. The next stage is to contact these websites and pitch your idea to them. Monitor feedbackOnce you have published a few articles, it is worth monitoring how people react to your content using alerts.You can use tools like Google Alerts and Talkwalker Alerts to monitor this, but I like to use Ahrefs Alerts.To set up an alert, click on the “Mentions” tab and then click on “+ Add alert.”Then fill out the form and enter the topic you want to be alerted about.Once you have done this, you can sit back and wait for the feedback. Here’s an example of some positive feedback I got for one of my recent posts.My general rule is that if at least one person likes a piece of content enough to comment about it, then it has likely helped them and is worth the effort. When it comes to more critical feedback, it’s a good idea to take on board what they are saying. At the same time, do accept that it’s impossible for everyone to love your writing. Even the most successful writers have their critics.If you don’t get any type of engagement or feedback, then you may need to reassess how you are creating and publishing your content. Final thoughtsImproving your writing is a gradual process—but it shouldn’t be a struggle. With discipline, dedication, and some good old-fashioned hard work, you can fast-track your progress and get your writing published. Lastly, remember to have faith in your ability, trust the process, and keep writing.Got more questions? Ping me on Twitter. 🙂 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Chris Haines Chris is an SEO director who has 10 years of experience in SEO, agency side. When not involved in SEO, he enjoys messing around with vintage synthesizers, walks on sandy beaches, and a good cup of tea. Keep Learning How to Use Google Search Console to Improve SEO (Beginner’s Guide) Learn how to use Google Search Console to improve your SEO today in 6 simple steps. SEO Visibility - The Complete Beginner’s Guide to Fixing a Search Visibility Loss Learn how SEO visibility impacts website traffic. Educate yourself to detect a search visibility loss (and learn how to fix it). 7 Easy SEO Tips for Small Businesses People are searching for your business on Google. Here's how to show up. SEO for Multiple Locations (Beginner’s Guide) Want to reach customers in different geographic locations? Then doing SEO for multiple locations is a must. Ecommerce SEO: A Beginner’s Guide Our noob-friendly guide on ecommerce SEO covers what it is, why it's important, and the steps to take to do it well.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Become a Better Writer (Beginner’s Guide)"
    },
    {
      "level": "H2",
      "text": "Understand your audience"
    },
    {
      "level": "H2",
      "text": "Understand whether people want to read about your topic"
    },
    {
      "level": "H2",
      "text": "Consider what’s working already"
    },
    {
      "level": "H2",
      "text": "Keep a journal or start a blog"
    },
    {
      "level": "H2",
      "text": "Write an outline"
    },
    {
      "level": "H2",
      "text": "Keep it simple"
    },
    {
      "level": "H2",
      "text": "Get a peer review"
    },
    {
      "level": "H2",
      "text": "Use tools to improve your writing"
    },
    {
      "level": "H2",
      "text": "Pitch your articles to websites"
    },
    {
      "level": "H2",
      "text": "Monitor feedback"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Chris Haines"
}