{
  "url": "https://ahrefs.com/blog/how-to-drive-traffic-to-your-website/",
  "slug": "how-to-drive-traffic-to-your-website",
  "title": "21 Proven Ways to Drive Traffic to Your Website",
  "description": "We've put together 21 tried and tested methods that you can implement to drive even more traffic to your website.",
  "content": "Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Overwhelmed by the infinite options for driving traffic to your website?This article doesn’t list every traffic strategy; it only lists the ones that are proven to work.Let’s get to it.Contents1. Get search traffic by targeting easy-to-rank topicsMy post on SEO statistics has generated consistent search traffic since it was published:If you can rank high on Google, you can see the same results too. However, you can’t just target any random topic—you need to write about topics people are searching for. Here’s how to find them:Go to Ahrefs’ Keywords ExplorerEnter a relevant keywordGo to the Matching terms reportMany of the keywords you see will be super competitive. So we’ll use the “Keyword Difficulty (KD)” filter to narrow the results down to those that are easy to rank for.Eyeball the results and pick out those that are relevant to your site.Further readingHow to Find Low-Competition Keywords for SEO2. Get brand exposure by appearing on podcastsFrom new ones to a top 100 business podcast, our chief marketing officer, Tim Soulo, has appeared on them all.The easiest way to find podcasts to appear on is to Google them.Look through the results and pick out those that are relevant. Then find the host’s email and pitch yourself as a guest. If you find a prolific podcast guest along the way, you can enter their site into Ahrefs’ Site Explorer and find all the podcasts they’ve been on by going to the Backlinks report and filtering for results with “episode” in the referring page title.Further readingHow to Use Podcasts for Link Building3. Rank higher by filling content gaps in existing contentIf the top-ranking pages cover similar subtopics, they’re likely important and what searchers expect to see. So if your content is “missing” them, that can be a reason why you’re not ranking as high. To find these subtopics, we can look at the common keywords the top-ranking pages rank for that we don’t. Here’s how to find these “content gaps”:Enter your target keyword into Ahrefs’ Keywords ExplorerScroll to the SERP overviewCheck up to three relevant competing pagesClick CopyThen, navigate to our Competitive Analysis tool and go to the Content Gap report. Add your existing page to the “Target” section and the three URLs into the “Competitors” section. Hit “Compare.”This opens up the Content Gap report, where we can see the common keyword rankings among these pages. Look through the report and see if there are any subtopics you can cover. For example, if we wanted to update our post on earned media, these could make good H2s:“owned media examples”“paid media examples”“earned media vs paid media”“owned vs earned media”4. “Steal” traffic from Reddit by sharing barebones postsWith >330 million monthly active users, it seems a no-brainer to promote on Reddit. Except that Reddit hates marketing.If Redditors catch even a whiff of self-promotion, they will downvote you, delete your post, or ban you from the subreddit.Yet, Tim managed to successfully “promote” his keyword research post:Reddit enjoys helpful content. Its users are only antagonistic to spammers. So if you want to promote on Reddit, replicate what Tim did.Take your best content, strip away all internal and external links, and share it to a relevant subreddit. Leave just one link back to your original blog post at the end. Make sure the post is valuable on its own, whether or not people clicked through the link.Further readingReddit Marketing: How to Self Promote on Reddit and Get More Traffic 5. Tap into other brands’ audience through collaborationsBuffer is a social media scheduling tool. It was a non-competitor and targeted the same audience. So we did a joint webinar titled “How to Build Your Website Traffic With Evergreen Content and Social Media.”https://www.youtube.com/watch?v=xn2XCFqREbUBoth brands heavily promoted the webinar on social media leading up to day zero. Post-webinar, Buffer created a blog post summarizing the presentation, while we posted the recording on YouTube and uploaded the presentation slides on SlideShare.Look for opportunities to partner with brands that solve different problems for a similar audience. That way, you can each gain access to an entirely new user base.6. Refresh outdated content to boost its rankingsI updated my post on free SEO tools, and traffic shot up:SEO is not a “set it and forget it” thing. Even if you’re ranking well for your target keyword, competitors may steal your spot or Google may lower your rankings when your content becomes outdated.So you need to keep it up to date to maintain your rankings.The easiest way to find out which content to refresh is to install our free WordPress SEO plugin and run an audit. The audit will tell you which articles you should be updating. Look at the top-ranking results and compare them to yours to see what aspects need to be refreshed. Sometimes, it can be as simple as filling content gaps and updating old parts like screenshots. Other times, search intent could have changed—in that case, you might need to do a full rewrite.Further readingRepublishing Content: How to Update Old Blog Posts for SEO 7. Reach new audiences by befriending amplifiersAmplifiers are people with a large audience. They have the ability to share your content with their audience and send tons of traffic to your site. The easiest way to find amplifiers in your niche is to use SparkToro. Simply enter your topic or niche:However, just because you’ve found them doesn’t mean you can send them an email and expect them to promote your website. They’re not obliged to do that.Your goal is to befriend them and build up the relationship. Start by featuring them or their work in your content. Then, reach out and let them know. They’ll be delighted.In this example, Amanda Natividad graciously promised to share it in her newsletter. But don’t expect it. Treat it as a bonus—if they share it, that’s great. If they don’t, it’s cool too.Focus on building the relationship, not trading one-off favors.8. Get more views by turning your content into X threadsOur head of content, Joshua Hardwick, turned his post on AI content into an X (formerly Twitter) thread and got over 40,000 views:Google couldn’t care less about AI content. 🤖(They even said it can rank high)Here are 3 reasons why 👇— Joshua Hardwick (@JoshuaCHardwick) February 23, 2023 He barely even tweets!The best thing: You don’t have to start from scratch. Take one of your blog posts, paste it into Typefully, and add your blog post at the end of the thread:Don’t publish immediately. You’ll want to make sure it grabs attention. So edit according to these principles:Here’s what you’ll learn by reading this:1. Starting with a great thread body2. Using headers and white space3. Writing a direct call-to-action4. 4 killer thread openersLet’s dive in ↓— Justin Welsh (@thejustinwelsh) December 18, 2022 9. Rank for more long-tail keywords with FAQ sectionsPeople usually have tons of related questions when researching a topic. You’ll likely answer most of them. But sometimes, there are a few that are difficult to weave naturally into your content. You can solve this by adding an FAQ section at the end of your article. That can potentially help your content rank for more long-tail keywords and get more search traffic. For example, one of the questions we answered in our guide to H1 tags helped us rank for a long-tail keyword:Here’s how to find frequently asked questions to answer:Go to Ahrefs’ Keywords ExplorerEnter your topicGo to the Matching terms reportToggle to “Questions”10. Generate consistent social traffic by building a personal brand on LinkedInOur LinkedIn posts generate tons of impressions and engagement: The “social network for professionals” is not the sexiest social platform. But don’t sleep on it—many people are rediscovering LinkedIn’s ability to send tons of traffic.It might be an unpopular opinion but I think LinkedIn is a better social than Twitter right now.I’m not talking about the content. I’m talking about the platform.- The feed has the right mix of people you follow and new ones (I’d say it’s around 80/20 on average)- There’s…— Andrea Bosoni (@theandreboso) May 21, 2023 I previously asked marketing consultant David Fallarme about how to excel on LinkedIn. This was what he said:Your first job: to find and add people who are relevant to you and your target audience. Add a few influencers in your niche, then use the “People also viewed” function to see who else LinkedIn suggests. These are typically people who post regularly, which means you’ll be exposed to a lot of content in your niche.After following ~10 - 15 influencers, you should build your LinkedIn writing muscle by commenting on their posts whenever you log on. This does a couple of things: first, it trains your brain that posting on LinkedIn is nothing to be scared of. Two, it gives you new ideas for your own content—every comment you leave is the seed for future posts. Third, when you leave thoughtful comments, and when you reply to others who have left comments, others who also follow that person will visit your profile and respond to your connection requests.All of these increase the chances that when you post something on LinkedIn, it’s relevant to your target audience and you’re not just yelling into the void. You always have new connections who are exposed to your content.David Fallarme Marketing Advisor11. Tap into the world’s fifth-largest social network by creating TikTok videosWith over 1 billion users, it’s a foregone conclusion that you need to be on TikTok, right? But most businesses haven’t, because they think it’s a platform for silly dance videos catering to Gen Z. That’s what most people thought about YouTube in the early days too… and look at where we are now. The key to TikTok is consistency. Here’s what marketer and author Nat Eliason suggests:I think you should aim for two or more videos per day for the first few weeks until you get some hits.That’s a lot of videos to make, so you’ll need to generate tons of ideas. Follow Nat’s guide to learn how:Further readingKickstarting TikTok: 55,500 Followers & 7M Views in 6 Weeks12. Rank high for “tool” keywords by creating free toolsAt Ahrefs, we offer plenty of free SEO tools.Combined, they generate an estimated 909,000 monthly search visits.As you can see, free tools can send a lot of traffic. But you have to make sure you’re creating tools that have search demand. Here’s how to find such opportunities:Go to Ahrefs’ Keywords ExplorerEnter a relevant keywordGo to the Matching terms reportIn the “Include” box, search for terms like “tool, tools, calculator, checker, template, report”Look through the list and find a relevant free tool you can create. For example, if I were an auto dealer, I could create a “car payment calculator” to help potential customers decide if they could afford a car.13. Leverage what you’ve already created by repurposing contentDon’t waste your content. Each piece you create can be reposted or repurposed on another channel. For example, we turned our video on ChatGPT for SEO into a blog post:There are many ways you could do this. For example, you could turn:Blog posts -> Reddit postsBlog posts -> X threadsX threads -> LinkedIn postsTikTok videos -> YouTube Shorts and IG ReelsTikTok videos -> X and LinkedIn postsAnd more.Further reading13 Smart Ways to Repurpose Content 14. Boost your pages’ rankings with internal linksInternal links can pass PageRank, which can help boost a page’s rankings.Here’s how to find internal link opportunities on your website with a free Ahrefs Webmaster Tools (AWT) account:Run a crawl with Site AuditGo to the Internal link opportunities reportSearch for the URL of the page you want to boostChoose “Target page” from the dropdownYou’ll see a list of internal linking opportunities. For example, here’s a suggestion to link to our post on faceted navigation from our one on duplicate content:Further readingInternal Links for SEO: An Actionable Guide 15. Build traction by “hunting” your website on Product HuntProduct Hunt (PH) is Reddit for product launches. Many household names like Zapier, Slack, and Notion got their start there. It’s not just for singular products either. If you have new tools, features, or even “content products” (e.g., a course), you can launch on Product Hunt.For example, we’ve been around since 2011. But in 2020, we launched Ahrefs Webmaster Tools and promoted it on Product Hunt:Success on Product Hunt is not “submit and pray.” The most important factor is the work you do before launching, specifically building a following of people who would advocate for your product.This is where building a social following is useful. No matter X/Twitter (#8), LinkedIn (#10), or TikTok (#11), your following can help boost your PH launch. You can also build social capital by participating in startup communities like Indie Hackers.For more tips on succeeding on PH, read the guide below.Further readingIn-depth Product Hunt Launch Guide16. Get exposure to new audiences by pitching your content to niche-relevant newslettersRecently, my article on content promotion was featured in SparkToro’s Audience Research newsletter:With over 40,000 subscribers, that’s plenty of eyeballs. You’ll want to be featured on similar newsletters in your niche too.The easiest way to find these newsletters is to look them up on a newsletter platform like Paved or Reletter. Paved’s newsletter marketplace.In my example, I was featured organically. But you can reach out to these newsletters and actively introduce your content to them. Remember: Don’t be pushy, and don’t promote every article. It’s always about the relationship with the creator, so it’s fine to not be included this time round. There are always plenty more opportunities in the future, since newsletters are sent frequently. 17. Rank for local queries by creating a Google Business ProfileIf you’re serving customers locally, you’ll want to rank for local search queries, especially the “map pack” search results.To rank for the “map pack,” you’ll need to claim and optimize your Google Business Profile (GBP). Once claimed, the information you add to your business profile can show up in Google’s web search results and in Google Maps.Learn how to optimize your GBP by following the guide below.Further readingHow to Optimize Your Google My Business Listing in 30 Minutes 18. Build an engaged audience by publishing a weekly newsletterEvery Thursday, we send a newsletter with the web’s best content (including ours):Email may be old, but it’s still the most reliable communication medium. Every social platform can limit or ban you, but your email list is yours. Nobody can take that away from you.To send a weekly newsletter, you need to build an email list. Put opt-in boxes in the right places, such as the sidebar and end of blog posts, and offer something in return for subscribing. We keep it simple at Ahrefs by telling potential subscribers they can get the week’s best content:But you can offer a carrot too. PDFs, white papers, free courses—they all work.Further reading8 Easy (But Effective) Ways to Grow Your Email List 19. Generate video views by ranking high on YouTubeSam Oh is our YouTube master. He built our channel to 425,000 subscribers in the SEO niche, a notoriously boring industry. How did he do it? He did it by ranking our videos for important keywords on YouTube:To rank high on YouTube, you need to target topics people are searching for. You can do this by installing the VidIQ Chrome Extension. Once installed, you’ll be able to see relevant data and keyword opportunities in your YouTube sidebar:Then follow the steps in the video below to learn how to create videos that rank:https://www.youtube.com/watch?v=Nh0mDbfEdVAFurther readingYouTube SEO: How to Rank Your Videos From Start to Finish 20. Get even more video views by ranking videos on GoogleYouTube videos rank on Google too.To rank your videos on Google, you need to find topics that people prefer to watch videos about. Here’s how to find them:Go to Ahrefs’ Content ExplorerRun this search: site:youtube.com inurl:watch title:topicSort the results by Page trafficThis will give you YouTube videos that currently get search traffic from Google. Look through the list to find relevant topics you can cover.Follow our resource below to create a video that’ll rank for these topics:https://www.youtube.com/watch?v=BObU_VCwnvYFurther readingVideo SEO: How to Rank YouTube Videos on Google 21. Reach untapped audiences by running ads on lesser-known platformsIf you have the budget and are willing to invest, don’t forget that you can always pay for traffic to your website. But you don’t have to limit yourself to big (and therefore) expensive platforms like Google and Facebook. Run ads on other lesser-known ad platforms like Quora, TikTok, or Reddit.For example, we ran Quora ads to promote our content:Further readingQuora Ads: Over $200K Spent. Here’s What I Learned Final thoughtsExperiment with the above traffic strategies and start generating traffic to your website.Did I miss out on any cool tactics? Let me know on Twitter or Threads. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Keep Learning Find Out How Much Traffic a Website Gets: 3 Ways Compared Three most well-known ways to estimate website's traffic compared. Plus some advice on estimating website traffic with no tools at all. 9 Fast & Proven Ways to Increase Organic Traffic Get more organic traffic fast by squeezing more juice out of the content you already have. 11 Ways to Improve E-commerce Category Pages for SEO Category pages are a common area SEO and UX experts disagree on. Here's the middle ground. How to Make Money With SEO (7 Ways + Examples) Earning an income with SEO isn’t always easy—but it's possible. Discover our most tried and tested ways to make money with SEO. How to Check Google Rankings: 4 Easy Tools Learn three ways to check your Google rankings quickly and accurately, plus discover some useful rank checking tips.",
  "headers": [
    {
      "level": "H1",
      "text": "21 Proven Ways to Drive Traffic to Your Website"
    },
    {
      "level": "H2",
      "text": "1. Get search traffic by targeting easy-to-rank topics"
    },
    {
      "level": "H2",
      "text": "2. Get brand exposure by appearing on podcasts"
    },
    {
      "level": "H2",
      "text": "3. Rank higher by filling content gaps in existing content"
    },
    {
      "level": "H2",
      "text": "4. “Steal” traffic from Reddit by sharing barebones posts"
    },
    {
      "level": "H2",
      "text": "5. Tap into other brands’ audience through collaborations"
    },
    {
      "level": "H2",
      "text": "6. Refresh outdated content to boost its rankings"
    },
    {
      "level": "H2",
      "text": "7. Reach new audiences by befriending amplifiers"
    },
    {
      "level": "H2",
      "text": "8. Get more views by turning your content into X threads"
    },
    {
      "level": "H2",
      "text": "9. Rank for more long-tail keywords with FAQ sections"
    },
    {
      "level": "H2",
      "text": "10. Generate consistent social traffic by building a personal brand on LinkedIn"
    },
    {
      "level": "H2",
      "text": "11. Tap into the world’s fifth-largest social network by creating TikTok videos"
    },
    {
      "level": "H2",
      "text": "12. Rank high for “tool” keywords by creating free tools"
    },
    {
      "level": "H2",
      "text": "13. Leverage what you’ve already created by repurposing content"
    },
    {
      "level": "H2",
      "text": "14. Boost your pages’ rankings with internal links"
    },
    {
      "level": "H2",
      "text": "15. Build traction by “hunting” your website on Product Hunt"
    },
    {
      "level": "H2",
      "text": "16. Get exposure to new audiences by pitching your content to niche-relevant newsletters"
    },
    {
      "level": "H2",
      "text": "17. Rank for local queries by creating a Google Business Profile"
    },
    {
      "level": "H2",
      "text": "18. Build an engaged audience by publishing a weekly newsletter"
    },
    {
      "level": "H2",
      "text": "19. Generate video views by ranking high on YouTube"
    },
    {
      "level": "H2",
      "text": "20. Get even more video views by ranking videos on Google"
    },
    {
      "level": "H2",
      "text": "21. Reach untapped audiences by running ads on lesser-known platforms"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Si Quan Ong"
}