{
  "url": "https://ahrefs.com/blog/how-to-increase-organic-traffic/",
  "slug": "how-to-increase-organic-traffic",
  "title": "9 Fast & Proven Ways to Increase Organic Traffic",
  "description": "Get more organic traffic fast by squeezing more juice out of the content you already have.",
  "content": "Mateusz Makosiewicz Marketing researcher and educator at Ahrefs. Mateusz has over 10 years of experience in marketing gained in agencies, SaaS and hardware businesses. When not writing, he's composing music or enjoying long walks. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Organic traffic means people visit your site because they found it naturally through a search engine like Google. They might type in something they’re looking for, see your site in the search results, and click on it. To increase organic traffic, you need to do search engine optimization (SEO). SEO is a set of techniques and good practices for improving your site’s visibility, mostly through achieving higher rankings for relevant search terms (aka keywords).In the long term, this means you need to create more content about stuff people are searching for and get quality links from other sites. The problem is that it takes time. If you want to increase organic traffic fast, you need to squeeze more juice out of what you already have. This includes: Updating outdated content to keep it relevant and accurate.Redirecting broken pages to live ones to preserve link equity.Adding internal links to improve SEO and user navigation.Optimizing for featured snippets to appear at the top of search results.Translating high-traffic pages to reach new audiences.Using schema markup to improve search visibility and attract more clicks.In this article we’re explaining nine SEO techniques to get you more organic traffic the fastest way possible. Let’s dive in. How to increase organic traffic1. Refresh pages with outdated informationIf people searching for your topic want fresh information, you’ll lose traffic and rankings if you don’t update your page. Google will simply rank pages with fresher content above you.On the bright side, this traffic is usually easy to reclaim. All you need to do is replace the old with the new and remove any stuff that is no longer relevant.For example, people searching for industry statistics don’t want facts from years ago. That’s why our curated lists of industry statistics usually get a boost in traffic when we update them. And it’s less than a day’s work to revisit the stats and replace them if needed.Here’s how to find pages with the biggest traffic drops over the last six months in Ahrefs:Open Site Explorer and enter your domain.Go to the Top pages report.Set the Traffic filter to Declined.Compare with the previous six months and sort the Traffic Change from high to low.From here, you can eyeball the list for topics where searchers would expect fresh information and update them. Our page on “top Google searches” is a good example because searchers don’t care what people searched for in 2021. They want to know what’s popular today.This is one of the easiest and quickest ways to increase SEO traffic on an existing website.2. Redirect dead pages with backlinksDead pages are pages that no longer exist on your site. If they have backlinks, this is a huge waste of link equity.Usually, backlinks are slow and hard to get. After all, they’re one of the strongest ranking factors. But with this technique, you’re in control of the backlinks—so you can give your SEO a boost fast.Go to Ahrefs’s Site Explorer and enter your domain.Go to the Best by links report.Add a 404 filter.Next, redirect these broken pages to relevant live pages on your site. If a page has been removed by accident, consider reinstating it. The whole process goes like this:Not sure how to do a redirect? Read our guide to redirects for SEO.3. Boost pages with internal linksInternal links are links from one page on the same domain to another.One of their main roles in SEO is that they aid the flow of PageRank (aka “link equity”). This means that you can use internal links to give pages on your site an SEO boost.For example, we’ve linked from our free backlink checker tool to some of our articles on link building with the aim of boosting their rankings.The key to improving organic traffic with thie technique is to link between relevant pages. Ahrefs’ Site Audit identifies these automatically:Go Site Audit and choose the site you want to work on.Open the Internal link opportunities tool.Pay particular attention to the source page, keyword context, and target page columns. These tell you which page to link from, link to, and where on the page to add the link.For example, there are a few relevant internal links we can add from our list of SEO statistics:Further readingInternal Links for SEO: An Actionable Guide4. Go after featured snippetsA featured snippet answers the searcher’s question with a short answer. Example:Since Google shows them on top of other results, this can be your shortcut to the very top. Showing up in more featured snippets will have a sizable impact on growing your organic traffic in a short timeframe.You stand the best chance of winning the snippet for keywords where you rank 2-8, and Google already shows a featured snippet. Here’s how to find them:Go to Ahrefs’ Site Explorer and enter your domain.Open the Organic keywords report.Filter for Position 2-8 and SERP features where the target doesn’t rank.Sort the results by Volume high to low for prioritization.Winning the snippet comes down to providing more helpful information than what’s already ranking: fresher data, a more accurate answer, a more comprehensive definition of a term, etc.Unfortunately, there is no silver bullet here, but you’ll find some good tips in our guide to featured snippets.5. Hire someone to translate your top-performing contentPeople want content in their native language when they search Google—even if their search is in English. Google knows this, and uses the searcher’s location and language preference to personalize results.For example, when I search for “link building,” I get Polish results. This is because Google knows I’m in Poland.Despite us having a guide to link building, Google doesn’t rank it for me because it’s in English. By translating it into other languages, we could improve its reach and earn more organic traffic.This is what we did for many of the posts on our English blog.For example, the Spanish translation of our post about affiliate marketing brings in an estimated 8K organic visits each month.If you want to follow in our footsteps and increase SEO traffic by tapping into other markets, the best way to get started is to translate your top-performing content. The idea here is that if people are searching for a topic in one language, there are probably people searching for it in other languages.Here’s how to find your top-performing pages in organic search:Enter your domain into Ahrefs’ Site ExplorerGo to the Top Pages reportYou can then ask ChatGPT how someone who speaks another language might search for the topic:From there, you can simulate a local search for the topic in Google with Ahrefs SEO Toolbar and look at the estimated traffic to the top-ranking pages. This will help you to understand roughly how much traffic potential the topic has in that language and locale.For example, the top-ranking post about free keyword research tools in French gets an estimated 714 organic monthly visits from France—so it might be worth translating:6. Write better titles for popular pages using ChatGPTIf you can make your titles more compelling to the searchers, you can get more clicks even if your rank stays the same. This technique is about improving organic traffic by focusing on conversion optimization rather than ranking improvements.With this technique, you’re going to see the biggest lift in content that already brings you traffic. You can find these pages in the Top Pages report in Ahrefs’ Site Explorer, or Google Search Console click data.For us, our list of free keyword research tools gets the most traffic:Here’s our current title for that post:The 9 Best Free Keyword Research ToolsLet’s see if ChatGPT can come up with something more interesting and enticing. Here’s the prompt I’ll use:Give me 10 ways to make this title more interesting and enticing to click: “[current title]”. Keep them under 70 characters. Mention the keyword “[target keyword]” in each one.I don’t love all of these, but “Boost SEO for Free: 9 Essential Free Keyword Research Tools” sounds like a slight improvement on our current title. It might be worth us switching it out and monitoring if there’s any increase in clicks.Further readingHow to Improve Click-Through Rate (CTR): 9 Tried & Tested Tips7. Use schema markup for more visibilitySchema markup is code that helps Google understand the information on a page, which can be used to show rich results (also known as rich snippets).As you can see above, results with schema are more visually compelling, and because of that, they can often earn more clicks.Sidenote. Schema is not a ranking factor. The idea here is to increase search traffic by getting more clicks to pages that already rank.There are basically two ways of adding schema to your pages:Use your CMS or a plugin. Just fill out some information, and it’ll add the code for you.Use a schema markup generator. There are plenty of these around. Just Google it. The benefit here is that you can probably better customize your schema than in the first option. The downside is that you have to add the code yourself.Either way, it’s always best practice to validate your code. Again, two options here:Use Google Rich Result Test or Schema Markup Validator (this one is more thorough).For a sitewide check, use Ahrefs’ Site Audit (free with an Ahrefs Webmaster Tools account). It checks for both Google and schema.org validation and shows you exactly what needs to be fixed. For example, this recipe lacks the “calories” property:Further readingSchema Markup: What It Is & How to Implement It8. Consolidate pages with the same target keyword and intentIf two or more pages target the same keyword and the same search intent, they may hurt each other’s organic performance. This scenario is called cannibalization; a bad case of multiple rankings. Technically, it’s when a search engine constantly exchanges ranking between multiple pages or when multiple pages rank simultaneously for the same keyword but are similar enough to be consolidated.If you solve any possible cannibalization issues, your content may rank higher and, as a result, you get more organic traffic. The fastest way to uncover potential cannibalization issues is to perform a sitewide check with Ahrefs’ Site Explorer. Enter your domain.Go to the Organic keywords report.Switch on the Multiple URLs only toggle.Next, click on the ranking history button.Next, click on the ranking history button. You can spot keyword cannibalization if your ranking history for a keyword resembles this pattern: For example, we noticed that swapping pattern for the keywords “seo case studies” and “seo case study”. Despite each case study having a different URL, the repeated use of “case study” in their titles and URLs seemed to cause keyword cannibalization. This issue meant that whenever we published a new case study, the older one would drop from the SERPs and be replaced by the new one. To resolve this, we created a basic pillar page that included internal links to all our case studies. That pillar page quickly reached the top 10 and remained a stable top 3 ranking. Some of the case studies even ranked as site links.Encourage customers to leave reviews (constantly)If you’re a local business, the fastest way to get more clicks on your website, clicks on the directions to your place or clicks on your business phone number is to make your Google Business Profile shine. And if you already set up your business name, category, address and all of the basic information in your Google Business Profile, the next on the list of the most impactful local SEO ranking signals is your Google Rating which is based on your reviews (according to a recent study by Whitespark). Now, if you have happy customers, the hardest part is already done. Now, all you need to do is kindly remind them to leave a review. You can put up a sign, add it to the receipt, print a QR code on your packaging, or send them a special link in email or chat. To illustrate, here’s how one of my favorite restaurants asks for reviews: a simple hand-made sign, in a place you can’t miss. And here’s how I found them in the first place. If it wasn’t for the reviews, they wouldn’t be listed in that map pack.Reviews are most powerful if they are received on a constant basis. So don’t make this a one-off review gathering campaign, encourage your customers at all times! Final thoughtsJust in case, it never hurts to run a site audit to check for any technical issues that may hinder your site’s rankings. I’d recommend it especially if your site was recently redesigned or you inherited the site’s SEO after someone else. The simplest possible solution is to use a tool like Ahrefs’ Site Audit to find serious issues. The site audit is fully automated so you can run in the background as you’re busy with other stuff. Get more tips on how to increase organic traffic in:13 SEO Techniques for More Traffic15 Easy SEO Tips for Higher RankingsGoogle Ranking Dropped Dramatically? (Here’s What to Check)Got questions or comments? Ping me on X or LinkedIn. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Mateusz Makosiewicz Marketing researcher and educator at Ahrefs. Mateusz has over 10 years of experience in marketing gained in agencies, SaaS and hardware businesses. When not writing, he's composing music or enjoying long walks. Keep Learning How to Sell SEO (With Expert Tips) Learn how to sell your SEO services in six tried and tested steps. Internal Links for SEO: An Actionable Guide Learn what internal links are, how to set up an internal linking structure, and the way to audit them to spot and troubleshoot issues. 16 Things That Only Ahrefs Can Do What makes Ahrefs stand out among the rest? Here are 16 of our unique features and functionalities you'll find helpful. SEO Automation: 9 Tasks That Save You Time & Money Save time to work on your SEO strategy and execution with these nine tasks that automate repetitive SEO activities. 13 Free and Low-Cost SEO Slack Communities You Should Join Today Discover the coolest marketing and SEO-related Slack communities to join today.",
  "headers": [
    {
      "level": "H1",
      "text": "9 Fast & Proven Ways to Increase Organic Traffic"
    },
    {
      "level": "H2",
      "text": "1. Refresh pages with outdated information"
    },
    {
      "level": "H2",
      "text": "2. Redirect dead pages with backlinks"
    },
    {
      "level": "H2",
      "text": "3. Boost pages with internal links"
    },
    {
      "level": "H2",
      "text": "4. Go after featured snippets"
    },
    {
      "level": "H2",
      "text": "5. Hire someone to translate your top-performing content"
    },
    {
      "level": "H2",
      "text": "6. Write better titles for popular pages using ChatGPT"
    },
    {
      "level": "H2",
      "text": "7. Use schema markup for more visibility"
    },
    {
      "level": "H2",
      "text": "8. Consolidate pages with the same target keyword and intent"
    },
    {
      "level": "H2",
      "text": "Encourage customers to leave reviews (constantly)"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Mateusz Makosiewicz"
}