{
  "url": "https://ahrefs.com/blog/hubspot-seo-case-study/",
  "slug": "hubspot-seo-case-study",
  "title": "9 Surprising Takeaways From Analyzing HubSpot's SEO Strategy",
  "description": "I nerded out over HubSpot's SEO. Here's everything that blew my mind.",
  "content": "Mateusz Makosiewicz Marketing researcher and educator at Ahrefs. Mateusz has over 10 years of experience in marketing gained in agencies, SaaS and hardware businesses. When not writing, he's composing music or enjoying long walks. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents HubSpot is a publicly traded company, with over $614M in annual revenue, a legendary status among marketers, and an alleged acquisition offer from Google for just enough money to send a small team of the best of us to the Moon or solve world hunger for a couple of years.They have a special place in content marketing and SEO history. They were among the early champions of inbound and content marketing and living proof that SEO is a great marketing tactic. Just copying what they do for SEO would be enough for a complete SEO playbook, especially for SaaS.I dug deep into Ahrefs data to share these nine surprising takeaways from their strategy.Contents1. HubSpot runs the biggest corporate blog… ever.We all know that the sun is big, but when you see one of those at-scale depictions of the solar system, you instantly realize that “big” is an understatement. The same is true of HubSpot’s blog.I found no bigger corporate blog than HubSpot’s. If you know one, do let me know, and I’ll be more than happy to take this back: HubSpot’s blog is the biggest corporate blog ever regarding search traffic.Their blog generates an estimated 8.2M organic visits per month, worth over $5.3M in ad money. Just a few months back, it was even larger — over 10M visits.And since this is how HubSpot’s “solar system” looks…We need to travel to another “system” to find bigger blogging stars. We need to look at blogs in general to the point where it’s unclear whether these are still blogs or news sites.So, HubSpot’s blog isn’t as big as Mashable, and Health.com, but it’s bigger than Harvard Business Review, RollingStone, Coindesk, The Verge, and comparable to Wired. And these are all businesses of their own.In case you’re wondering how big the blog is, it’s over 18K pages with 148 blog posts published in May 2024 alone.2. Most traffic comes from topics like “shrug emoji” and “famous quotes”You probably expect their best-performing posts to be about marketing or sales… and you’d be wrong.“Shrug emoji” and “famous quotes” together account for almost 10% of all blog traffic, and there are many more topics like that.Now, it’s common sense this is low-intent, unqualified traffic they won’t convert quickly, if ever. But it’s also common sense that the more traffic, the better. So which common sense wins?Naturally, this is no accident that HubSpot fights for these loosely knit keywords. If you try to outrank them, they will fight you, because they’ve been fighting with Goodreads for “famous quotes” for years.Ahrefs’ Page Inspect tool shows that they’ve been making some major changes to keep this page ranking.Why bother with these topics? Because when you’re the size of HubSpot and you share their freemium model, you’re going to need “irrelevant” traffic more than small companies. We’re explaining this phenomenon in more detail in Why Big Companies Make Bad Content.3. They rank for “product marketing” twice on the first page (with blog posts)Good luck copying this stunt:Why is this a big deal? Because it’s very, very rare to rank twice on the first page of Google with the same type of content (blog posts in this case). I wrote about this in Keyword Diversification: Cannibalization’s Good Twin (SEO Study).Is this one of those “too big not to rank” situations? Why do we need to be told what HubSpot thinks product marketing is twice? When Ahrefs ranks two times on page one, we at least give you two different things: knowledge and a tool.Maybe it means that there’s something broken with Google? If you ask me, that one SERP is a great topic for one of those panels where search engineers gather to talk about the quality of the ranking systems.Sidenote. HubSpot once discussed using an SEO strategy called surround sound, which involved being featured in multiple top rankings (through its own content and third-party content). What we just saw could be a consequence of that strategy.4. Search intent matters even for DR 93 websiteHubSpot tried to rank for “crm” (183k monthly volume and 85 KD) with a typical product page https://www.hubspot.com/products/crm (green line). They never got to that #1 spot.So, years after, they made a page in a more educational style https://www.hubspot.com/products/crm/what-is, catering to a purely information search intent and it worked (blue line).All it took was explaining on that page the definition, who should use it, when, and a bit about how they developed it. What a great lesson about search intent.Interestingly, it’s not a problem for Google that the page starts with a product pitch. Which is weird because the H1 refers to information but visually, everything leads to that sign-up button.I guess it’s good enough for Google, since the page says “sign up or learn”; Google sees the entire text, the human eye, the picture and the buttons.Actually, that dual purpose may even be an advantage — searchers don’t need to return to the SERP to search again, all their needs are served via that landing page.Another interesting thing — they didn’t link from the crm directory to what-is-crm. Once you’re on the first page, you’re not supposed to find the latter one.5. “The State of Marketing” is a backlink goldmineEvery year HubSpot publishes an industry report about the state of marketing. For this, they poll their audience about hot marketing topics and partner up with other big brands like Wistia or Litmus. I’m sure you’ve seen it at least once.Here’s why this is a backlink goldmine. Not only the landing page for this report gets tons of backlinks but also every other page they spin out of that report.To illustrate, here are their most linked pages: their homepage, legal page, and the annual State of Marketing twice. Combined, these two pages alone earned 88,892 backlinks from 21,496 domains, and there are a few more pages like that.Part of the reason why those numbers are so high is that they keep the report under the same URL, so every year a new batch of backlinks come to basically the same page. And they get some high-profile links this way:Backlinks are not the only benefit here. That report, its spin-off landing page, and articles heavily drawing from the content of the report, all get organic traffic.For example, here’s the State of Marketing ranking only #10… but that’s ok because a spin-off ranks #3.There are three things that are for sure now: death, taxes, and that HubSpot is going to publish the state of marketing report next year.6. This one-pager gets insane organic trafficHubSpot has eight free, stand-alone tools that act as lead magnets. One of them clearly stands out in SEO terms: the Email Signature Template Generator.“Email Signature Template Generator” — these four words make up nearly the entire content of the page.But it’s enough for the page to rank for 5.9K keywords, bringing in 134K of free traffic from Google each month, and it even earned 22.7K backlinks.This traffic is worth $172K in ad money that HubSpot doesn’t have to spend (instead they “only” spend an estimated $2.6K on search ads—more on that later).Why do those few words work so well? It’s surely search intent. Most people looking for help with their email signatures simply want a tool for that, not a guide.And here’s a tip for Ahrefs users. You can use the AI Identify intents feature in Keywords Explorer to see what kind of intent could get you the most traffic.7. Five huge content hubs and only 140 visits?HubSpot has 5 big content hubs which you can see right away when you look for the most internal links to pages on the site:These hub pages are all linked to from ~36,000 places on the HubSpot blog.But they’re nowhere to be found when you look for pages with the most organic search traffic. Which is a shame because their respective target keywords would bring tens of thousands monthly visits:It’s proof that you shouldn’t expect content hubs (aka topic clusters) to rank at all times. And it’s kind of ironic that it comes from a brand identified with this content marketing tactic.That said, these hubs are probably great for UX (and driving referral traffic), and could be helping other pages rank, as HubSpot’s article on the tactic suggests.8. Low-performing content gets pruned to support other contentWhile browsing through the data, I found that Hubspot has an unusual number of lost pages.I’ve cleaned the data a bit and found out that they are no stranger to pruning content. At least 84 pages have been redirected to other pages on the same or similar topics between April and June 2024.Why? I think they do it to help some more promising pages rank. I’ve seen this on some other pages, and it worked.For example, https://blog.hubspot.com/marketing/how-to-create-embed-codes-generator-infographic-content-ht, with all of its 102 backlinks from 75 domains, was redirected to https://blog.hubspot.com/marketing/how-to-add-html-embed-codes-ht.That last page actually ranks (unlike its donor).Smart. Something you may want to try, too, if you have a large content inventory.9. With so much free traffic, they still pay for keywordsI’ve recently collected opinions of 100 markers, SEOs and business owners on the value of SEO, and most of them said this: SEO is money better spent compared to search ads. And many markets do SEO instead of search ads. But not HubSpot.Despite the huge volume of free traffic, they still buy a portion of their traffic from Google. According to Ahrefs, they’re bidding on 2367 keywords, with CPC from $0.01 to $45.7.These are the types of keywords they pay for:Keywords they already rank for like “free crm”. Probably to secure even more SERP real estate. Classic.Branded keywords like “hubspot pricing”. Possibly to stop competitors from eating their lunch. Classic.Other people’s branded keywords like “less annoying crm”. Just as competitors bid on their keywords, they bid on theirs. Classic, c’est la vie.Keywords hard to catch otherwise like “website maker free”. And this is the most interesting category.So let’s take this page for example: 7 Best Free Website Builders to Check Out in 2024 [+Pros & Cons].Initially, they created the page before offering a CMS. When they introduced the CMS later in 2022, they had find a way to drive more traffic to pages that mentioned that feature.Unfortunately for them, as you can see on the organic traffic chart below, since they added that feature (arrows) the traffic has been quite volatile.The volatility is caused by keyword rankings they keep gaining and losing. The more established website builder tools get them, probably because of their authority in that area.Here’s an example: “website maker free” with 2.5K volume and 98 KD. Below you can find their ranking history.And here you can see their ads position history chart, showing the point where HubSpot probably realized buying those keywords would be a better idea.And it worked. Looks like they’re squeezing some traffic out of that keyword after all.I think it’s a smart move. Some keywords are just too hard to catch. When your SEO tricks don’t work, but the keyword is still worth it, bidding on it becomes more reasonable than wasting time devising clever tactics to rank.Final thoughtsA small bonus for Ahrefs users: if you want to earn a link from HubSpot, help them remove some of those 3080 broken external links. Head over to Site Explorer > Outgoing > Broken Links (and read our guide on broken link building).Want to share an interesting finding about HubSpot SEO strategy? Have comments? Let me know on X or LinkedIn. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Mateusz Makosiewicz Marketing researcher and educator at Ahrefs. Mateusz has over 10 years of experience in marketing gained in agencies, SaaS and hardware businesses. When not writing, he's composing music or enjoying long walks. Keep Learning A Complete B2B SEO Strategy Guide Implement an effective B2B SEO strategy to organically get your products/services in front of customers on Google. Ahrefs’ Study Of 2 Million Featured Snippets: 10 Important Takeaways How to Create an SEO Content Strategy (Follow the Ahrefs’ Framework) This is a guide on how Ahrefs’ SEO content strategy works. Use it as inspiration for your own. How to Fit SEO Into Your Marketing Strategy Making all your marketing channels work together properly is essential for long-term success. Learn how to do it with organic traffic. Grammarly’s SEO Strategy: 11 Interesting Insights Learn how Grammarly attracts over 22 million organic search visits to its website every month.",
  "headers": [
    {
      "level": "H1",
      "text": "9 Surprising Takeaways From Analyzing HubSpot’s SEO Strategy"
    },
    {
      "level": "H2",
      "text": "1. HubSpot runs the biggest corporate blog… ever."
    },
    {
      "level": "H2",
      "text": "2. Most traffic comes from topics like “shrug emoji” and “famous quotes”"
    },
    {
      "level": "H2",
      "text": "3. They rank for “product marketing” twice on the first page (with blog posts)"
    },
    {
      "level": "H2",
      "text": "4. Search intent matters even for DR 93 website"
    },
    {
      "level": "H2",
      "text": "5. “The State of Marketing” is a backlink goldmine"
    },
    {
      "level": "H2",
      "text": "6. This one-pager gets insane organic traffic"
    },
    {
      "level": "H2",
      "text": "7. Five huge content hubs and only 140 visits?"
    },
    {
      "level": "H2",
      "text": "8. Low-performing content gets pruned to support other content"
    },
    {
      "level": "H2",
      "text": "9. With so much free traffic, they still pay for keywords"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Mateusz Makosiewicz"
}