{
  "url": "https://ahrefs.com/blog/improved-rank-tracker/",
  "slug": "improved-rank-tracker",
  "title": "Ahrefs’ Rank Tracker just got even better!",
  "description": "Did you know that we’ve been silently updating and adding new features to Rank Tracker over the past 10 months? Here are all the new features and updates we've added.",
  "content": "Tim Soulo Tim Soulo is CMO at Ahrefs. With over 15 years in the digital marketing industry, Tim is the author of many data-driven studies and actionable marketing frameworks, some of which gained industry-wide recognition. He enjoys challenging conventional marketing knowledge and optimizing for simplicity and efficiency. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Back in August 2017, we released a brand new super-visual and feature-rich version of our Rank Tracker tool.We didn’t just add a few more features to our old Rank Tracker. We started from scratch and rebuilt the whole thing from the ground up, implementing many highly-requested features in the process.But the official release of this new and improved Rank Tracker in August 2017 didn’t spark the end of our development on this tool. Far from it, in fact. We’ve been silently updating and adding new features to Rank Tracker ever since. Just look at this beauty:this is a screenshot of the actual project I have in my Ahrefs accountWe now decided that it’s finally the right time to announce all those newly-added features. We also asked our talented videographer, Sam Oh, to create a brief instructional video to show you how to use them.https://www.youtube.com/watch?v=8wjvguG27tg&t=1sSo here’s what’s new in Rank Tracker (since August 2017).1. Brand new “SERP features” reportIn all honesty, we had the “SERP features” report in the original release of Rank Tracker, but it wasn’t particularly impressive.In fact, I hated it.But today I’m incredibly proud of what we have under the “SERP features” tab:The upper part of the report shows the SERP features owned by your website, plus those you could potentially steal. That’s why we use two colors: grey for all available SERP features and blue for the ones you already own.As you can tell from my screenshot, “Image pack” is the most frequently occurring SERP feature across the keywords that I’m tracking. It is present for 53% of all my tracked keywords, and our website already ranks in 30% of them.Sidenote. Yes, we only rank in one featured snippet out of the 35 “available” ones. But, in all honesty, we never bothered to optimize our articles for featured snippets, despite having an excellent process.The bottom part of this report shows the SERP features that you cannot own, but it’s still important to keep an eye on these since SERP features tend to “steal” clicks away from the rest of the search results.As you can see from my screenshot, the number of “People also ask” boxes has slightly decreased in the past few months, which means more clicks to the rest of the search results.In other words, the SERP features report is quite insightful, right?Sidenote. Technically, your website can rank in the “People also ask” box, but one will need to “click” on that box to see which page the answer comes from. None of the Rank Trackers are capable of “clicking” on anything in the search results.If you need to study which keywords have a specific SERP feature in the search results (and whether or not you rank in said feature), we have an awesome filter for that.I can’t say that I’ve tried all rank trackers available on the market today, but should you find one with better reporting of SERP features, please do let me know about it.2. Improved UI of “Competitors” tabOriginally, the “Competitors” tab was somewhat unorganized and overloaded with data. So we took a stab at simplifying this report to make it cleaner and more intuitive.On the screenshot below, you can see that we’re outperforming our competitors when it comes to “Image pack” rankings, while Moz is the leader in “Featured snippets.”3. “Share of voice” functionalityRank Tracker allows you to track your site’s performance against up to five competing websites. But sometimes the websites that you deem to be your competitors aren’t the ones stealing away your search traffic.For every keyword that you put into Rank Tracker, we pull the top100 ranking pages - this allows us to calculate the so-called “share of voice” across all pages and websites ranking in the search results for your tracked keywords.Just click on “Pages” tab under “Competitors” section:As you can tell by the colored circles, I have only two competitors in my project for ahrefs.com: Moz and Backlinko.But based on the “share of voice” for my tracked keywords, I should probably also start monitoring our ranking progress against the likes of Monitor Backlinks and Wordstream, as they seem to be getting organic search traffic from many of the same keywords as us.I like this feature a lot, but in my opinion, it’s currently a little buried in the user interface. So if you feel that this feature should be moved to a more prominent spot, please let us know.4. Ranking progress by tagsWhen reporting to your clients (or upper management), they will no doubt want to see a high-level view of ranking progress, rather than the individual movements for a few thousand keywords.That’s why we automatically group all keywords in your project by their tags and show some aggregated data on their performance.A similar report is available under “Competitors” section of Rank Tracker:5. Improved email reportNot the kind of person who checks Rank Tracker daily? You’ll love the new design of our email reports.Besides the recap of your most notable movements for your tracked keywords, you now get a sample of gained and lost SERP features and some performance data based on tags.Over to youSo that’s the state of Ahrefs’ Rank Tracker as of May 2018.We’re now planning to put it aside for a few months while we focus on releasing some fresh updates to other Ahrefs tools. But if you feel there’s a critical Rank Tracker feature that can’t wait, please submit it here and give our team (or me personally) a heads up. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Tim Soulo Tim Soulo is CMO at Ahrefs. With over 15 years in the digital marketing industry, Tim is the author of many data-driven studies and actionable marketing frameworks, some of which gained industry-wide recognition. He enjoys challenging conventional marketing knowledge and optimizing for simplicity and efficiency.",
  "headers": [
    {
      "level": "H1",
      "text": "Ahrefs’ Rank Tracker just got even better!"
    },
    {
      "level": "H2",
      "text": "1. Brand new “SERP features” report"
    },
    {
      "level": "H2",
      "text": "2. Improved UI of “Competitors” tab"
    },
    {
      "level": "H2",
      "text": "3. “Share of voice” functionality"
    },
    {
      "level": "H2",
      "text": "4. Ranking progress by tags"
    },
    {
      "level": "H2",
      "text": "5. Improved email report"
    },
    {
      "level": "H2",
      "text": "Over to you"
    }
  ],
  "author": "Tim Soulo"
}