{
  "url": "https://ahrefs.com/blog/in-house-seo/",
  "slug": "in-house-seo",
  "title": "The Realities of In-House SEO: What to Expect and How to Succeed",
  "description": "Here’s what it’s like to work in an in-house role (from someone who's done it).",
  "content": "Patrick Stox Patrick Stox is a Product Advisor, Technical SEO, & Brand Ambassador at Ahrefs. He was the lead author for the SEO chapter of the 2021 Web Almanac and a reviewer for the 2022 SEO chapter. He also co-wrote the SEO Book For Beginners by Ahrefs and was the Technical Review Editor for The Art of SEO 4th Edition. He’s an organizer for several groups including the Raleigh SEO Meetup (the most successful SEO Meetup in the US), the Beer and SEO Meetup, the Raleigh SEO Conference, runs a Technical SEO Slack group, and is a moderator for /r/TechSEO on Reddit. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents In-house SEO refers to the practice of managing and executing search engine optimization strategies using a company’s internal resources, rather than outsourcing to an external agency.There’s a long-term trend of companies bringing SEO programs and expertise in-house. Companies usually want someone who is invested in the long-term success of the company and who can collaborate closely with other teams in a way that is difficult for external agencies to do.Here’s what it’s like to work in an in-house role.ContentsIn-house SEO is not one-size-fits-allCompanies are different sizes and have different needs. They may have one dedicated SEO or a person who wears multiple hats and SEO is only part of their job. You might even be part of an entire team of SEOs.The core responsibilities of in-house SEO will be largely similar, but there are tons of different directions that you can take. I’ve been an in-house SEO at 3 different companies, and I’ve had completely different experiences at each of them.When I was at a mid-size company, I was newer in my career and wore a ton of hats. I was a mixture of developer and SEO, but later led the marketing team and sales as well.It was a pretty broad role, and an eye-opening experience to be in charge of so many different things. I handled everything from tradeshows and magazine advertising, to public relations, lead tracking and scoring, as well as the website and SEO. It was like having a crash course in traditional and modern marketing all at once and I had a lot to learn.At a larger enterprise company, I got to see and help an SEO program evolve. I’ve found that many companies go through a similar transition, where initially everything and everyone is siloed, but eventually things come together. It typically looks like this:For Ahrefs, we’re an SEO toolset and the buy-in for SEO already existed before I joined. We have some of the best SEOs around and strategies in place that are proven to be effective.It’s fairly easy for me to get buy-in for most things and I don’t have to prove that doing SEO is a good thing or justify the value of my work. At least that’s the case for most things. There are some interesting programmatic SEO projects where I still struggle with buy-in, but I know we’ll get there eventually.My biggest learning at Ahrefs is how well our product-led SEO strategy works. We combine top-of-funnel informational content with middle-of-funnel solution-aware content. Every blog and video teaches people what something is and shows how Ahrefs can help them with their tasks, or fix their problems.Here’s an example of how we incorporate this naturally into our content.Make your choice: manager or individual contributor (IC)Managers are in charge of others and help coordinate efforts and grow their team and resources. Individual contributors are the ones who do most of the work and high-level ICs may be in charge of strategy or special projects like task or process automation.I’ve been pushed into the managerial role a few times, both in-house and agency side. When I was a manager, it was less SEO work and more work trying to figure out how to support my team, their growth, and leverage them in the best way to get results and more resources. It was a similar game, but with different rules and goals.Different people prefer different paths, and it’s okay if you don’t know which is right for you. People learn and grow and their situation in life or even their wants may change over time.I generally prefer the individual contributor role and the work involved with solving challenges and creativity. However, having a great people manager that fights for the team is a powerful asset for a company. Seeing what people are good at and finding a way to use their skills to benefit the company is a super power.Making the transition in-houseThere’s more than one way to make the transition from an agency to an in-house position. People take different paths and companies look for different things.I’d say there are 3 main things you can do that might help:Shoot your shot. Apply to multiple roles and hope you get lucky.Work on skilling up. You could specialize in a certain skill, or you could go wide and know a little about a lot. Both of these are valuable for a company. I would say that keeping up-to-date with the industry is also important. These are mostly hard skills, but soft skills like communication are also extremely important for in-house roles. You need to speak the right language to be able to get buy-in and create effective reports.Network. Make friends with SEOs at other companies. Go to SEO meetups or SEO conferences. These professional connections often give you that “in”, or that break you need to make the transition in-house.Benefits of in-house SEO for people & for the companyThere are many reasons SEOs may want to work in-house instead of an agency. Some of those include:More money. Businesses can have higher margins than agencies. Services in general are rate and hour limited compared to other types of businesses.Better work-life balance. Agencies usually work people pretty hard. While working with many clients is a great way to learn, in-house roles usually have more flexibility and aren’t so reliant on hours worked and tracking time for billing.Better benefits. Companies that have more employees tend to have better benefits due to collective bargaining, competition for employees, and the higher margins I mentioned above.The company may want in-house SEOs because they’re more invested in the company. They have more time to understand the business and be able to navigate issues.Challenges of in-house SEOSome people think in-house SEO will be easier than agency work, and I’d say that is generally true, but it can also be more frustrating.Politics in particular can be frustrating and getting buy-in for SEO can be difficult. Relationships and soft skills are arguably more important than your SEO skills. If you can’t convince people why things need to be done, then they won’t get done.Early on, you may be bored at a company. However, work piles on for people who are capable. As your name gets around and people realize you’re good at what you do, you may be busier than you would be at an agency.There are a lot of teams, a lot of systems, and a lot of projects. It’s easy to get pulled in a lot of directions.How to be effectiveIn-house SEO is about getting things done. You rarely need advanced strategies. For the most part, you need to get the basics right over and over and execute.PrioritizeDo things that matter.My best recommendation is to align to company or team goals. Most companies or teams have some products they prioritize or want to improve and that’s where you’re most likely to be able to get buy-in for SEO initiatives. Someone’s bonus is likely tied to the success of these projects, and they’re willing to invest resources to make sure they hit their targets.You have to prioritize tasks and focus on the most significant issues. I typically use an impact / effort matrix as a visual to help others understand what I consider the most important tasks. Here’s what that looks like:You will likely have to work with any other teams involved for a better effort prediction, but in my experience I’ve found they appreciate it if you take a first pass at estimating the effort involved. Then give them the opportunity to make adjustments based on how much effort they think it will take.It’s not glamorous, but if you get the SEO basics right at in-house companies, you’ll likely win. It’s hard to do that at scale, but boring projects = $$$ when it comes to in-house SEO.Continuously educate and train othersInvest in regular training for the SEO team and other teams that touch on SEO like content teams or developers.The more you can empower others, the easier your life will be. Train people and find your evangelists who believe in and help promote SEO at your in-house company. It’ll help you scale your impact.TipOne of the things that I’ve used with content teams was a card-sorting exercise. I took the main terms identified during keyword research and put them on index cards. Then I asked the writers to group them in a way that made sense to them. Would each topic be part of a page or did they have enough to say for it to be a page on its own?There’s no right or wrong answer with this exercise. It simply helped writers organize the information and determine if things should be a page or part of another page. As long as they’re writing about what people are searching for, their content is likely going to be successful.Weekly meetings, office hours, networking events, and ‘lunch and learns’ are great for training and evangelism. But you can also do individual team training, group training, workshops, and internal courses that focus on different topics or tools.Look for opportunities to add an SEO session to company events, workshops, or training other teams may be hosting. There are likely to be events targeted towards marketing, development, analytics or any number of opportunities where SEO can be a relevant topic.Maybe even start an email newsletter with company and SEO industry updates people would find useful. Any chance to show your expertise will help your in-house program be successful.There are many options to bring more awareness and capabilities around SEO to an enterprise organization. For example, you might create standards, a knowledge base of best practices and standard operating procedures (SOPs) so that people know what they should be doing, why, and how to do it.You can also offer things like team training, workshops, videos, internal courses, or leverage any company-wide pushes for education like internal conference series. This will help you find those interested in SEO who can help you evangelize SEO through the organization.Foster inter-departmental collaborationMaking friends through networking and soft skills are important for being successful in-house. You need people to like you and to want to work with you. You also need to be a bit opportunistic and be ready to work with them when they’re finally ready to work with you.One way to get more buy-in is to show people the bigger picture. Communicate with other teams to integrate with them and then show everyone how that leads to more business success.For example:The paid team can expand their advertising based on assets created for organic search and would love to re-market to the people who landed on your organic pages.The social team can help promote your content.You can syndicate your core content for greater visibility.You can capture leads and nurture responses to engage them and guide them toward conversion.If you can show execs the whole picture of how teams can help each other to grow the business, then you’ll get buy-in and resources easier.Show you had an impactYou’ll create a lot of different SEO reports for a lot of different people in-house. Check out our guide on enterprise SEO reporting to see some of the reports you’ll want to create and the metrics to include in them for different people. It includes things like:How to equate SEO metrics to moneySelling SEO by comparing against competitorsDifferent SEO metrics to includeCreating status or project reportsReporting on opportunitiesFinal thoughtsYou have a lot more flexibility in-house than you do at most agencies. Your experience will often be what you make of it.If you have any tips, in-house SEO experiences you’d like to share, or questions, let me know on X or LinkedIn. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Patrick Stox Patrick Stox is a Product Advisor, Technical SEO, & Brand Ambassador at Ahrefs. He was the lead author for the SEO chapter of the 2021 Web Almanac and a reviewer for the 2022 SEO chapter. He also co-wrote the SEO Book For Beginners by Ahrefs and was the Technical Review Editor for The Art of SEO 4th Edition. He’s an organizer for several groups including the Raleigh SEO Meetup (the most successful SEO Meetup in the US), the Beer and SEO Meetup, the Raleigh SEO Conference, runs a Technical SEO Slack group, and is a moderator for /r/TechSEO on Reddit. Keep Learning Open Graph Meta Tags: Everything You Need to Know Open Graph meta tags are snippets of code that control how URLs are displayed when shared on social media. Learn how to set them up quickly in this guide. WordPress SEO: 20 Tips and Best Practices WordPress makes it easy to use SEO best practices. Improve your site's SEO with the tips in this guide. SEO Copywriting: What It Is & How to Do It SEO copywriting is creating high-quality content that appeals to search engine algorithms and human users. Learn how to do it well.",
  "headers": [
    {
      "level": "H1",
      "text": "The Realities of In-House SEO: What to Expect and How to Succeed"
    },
    {
      "level": "H2",
      "text": "In-house SEO is not one-size-fits-all"
    },
    {
      "level": "H3",
      "text": "Make your choice: manager or individual contributor (IC)"
    },
    {
      "level": "H2",
      "text": "Making the transition in-house"
    },
    {
      "level": "H2",
      "text": "Benefits of in-house SEO for people & for the company"
    },
    {
      "level": "H2",
      "text": "Challenges of in-house SEO"
    },
    {
      "level": "H2",
      "text": "How to be effective"
    },
    {
      "level": "H3",
      "text": "Prioritize"
    },
    {
      "level": "H3",
      "text": "Continuously educate and train others"
    },
    {
      "level": "H3",
      "text": "Foster inter-departmental collaboration"
    },
    {
      "level": "H3",
      "text": "Show you had an impact"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Patrick Stox"
}