{
  "url": "https://ahrefs.com/blog/indirect-marketing/",
  "slug": "indirect-marketing",
  "title": "Indirect Marketing: Definition, Types, & Examples",
  "description": "An overview of indirect marketing. Learn what it is, its pros and cons, and see examples of companies that succeeded with it.",
  "content": "Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Indirect marketing is marketing where you’re not trying to explicitly sell a product or service.Instead, it focuses on activities that generate brand awareness, build relationships with potential customers, and nurture them to eventually buy from you.Indirect marketing relies on the assumption that potential customers will not purchase your product or service immediately, but over time. And if we look at our buying behavior, that’s probably true. For example, if we need a new pair of headphones, we’ll probably first do some online research, browse forums, ask our friends, and get familiar with available brands and models—all before buying.In contrast, direct marketing is marketing where you’re explicitly trying to get potential customers to buy right now. Channels include cold email, direct mail, and ads.ContentsTypes of indirect marketingHere are some types of indirect marketing:1. Public relations (PR)PR is the practice of positively influencing a brand’s perception by managing communications with the media and the general public.Common tactics include being newsworthy, responding to media inquiries (e.g., HARO), creating press releases, building relationships with journalists, and creating PR stunts. For example, Ahrefs was featured on TechCrunch in 2022.This was possible because we had:A newsworthy event (“we’re making a search engine”).Relationships with the right people (all thanks to the hard work of my colleague, Daria Samokish).Further reading9 Great Public Relations Tactics With Campaign ExamplesDigital PR: The Beginner’s Guide to Making Your Brand Unmissable 2. Search engine optimization (SEO)SEO is the practice of optimizing your website and its pages to rank higher in search engines like Google. You’d want to make sure your important pages appear on Google for relevant keywords. For example, if someone is searching for your brand, your website should appear:But nobody will search for your brand if they do not know it exists. So beyond optimizing your homepage, you should also target keywords your customers are searching for.At Ahrefs, we create content targeting problems our potential customers have. For example, 14,000 people per month search for “link building” in the U.S. This is a problem our toolset helps with, so we created a piece of content targeting that topic.Whenever someone is searching for that keyword on Google, they’ll discover our content and, in the process, our product and brand. Repeat this ad infinitum and you’ll expose hundreds, if not thousands, of people to your brand (in our case, an estimated 3.4 million).Recommended reading: SEO: The Complete Guide for Beginners 3. Social mediaCreating valuable content that persuades people to follow you on social media platforms like Twitter and TikTok is a great way to generate brand awareness and build relationships with your audience.For example, our Twitter account has 128,000 followers, and we regularly share SEO and marketing tips with our audience:13 SEO copywriting tips to create solid content that ranks 📝We’ve grown the Ahrefs blog from ~5k to almost 320k monthly search visits—and using these tips helped us get there.👇(H/T: @siquanong) pic.twitter.com/ZQUft2hPxN— Ahrefs (@ahrefs) December 6, 2022 Indirect marketing: pros and consShould you invest in indirect marketing? Let’s look at the pros and cons.ProsHere are the advantages of indirect marketing.1. Indirect marketing builds demand and awarenessWhy is it important to build brand awareness and demand? Simple: There are only so many people who are ready to buy right now. Most of your potential customers are still unaware they have a problem, unaware of solutions, or unaware of your particular product or service. So if you’re using direct marketing, you’re only focusing on a small pool of people. Not only that, but you could actually just be reaching out to people who are already primed to buy in the first place.Eventually, you’ll still need a way to open up a pool of potential customers. And you can do that with indirect marketing tactics. 2. Indirect marketing is less intrusive and non-pushyProspects purposely seek out content that helps them solve problems. Not only that, but indirect marketing tactics also rarely involve reaching out to people. ConsHere are some downsides to indirect marketing.1. Indirect marketing takes timeYou can’t build a brand overnight. Neither can you amass 100,000 followers in one day. Relationships with journalists take time to build. And ranking on Google takes time too.Recognizing that customers need time to buy also means recognizing that nurturing the relationship takes time.2. Indirect marketing is less trackableLife gets in everyone’s way. You must have had the experience of researching for something to buy, only for you to give it up for a few years before suddenly returning to purchase it. Your customers are the same too. As a result, it can be difficult to pinpoint exactly which indirect marketing tactic contributed to the success. But it doesn’t mean that indirect marketing doesn’t work, just that it’s not attributable. Direct marketing: pros and consShould you invest in direct marketing? Here are the pros and cons.ProsWhat are some advantages of direct marketing?1. Direct marketing is measurableDirect marketing tactics are usually trackable—how many opens, how many clicks, how many conversions, and so on. You can see these metrics on ad platforms and email marketing software.2. Direct marketing is fastSince it’s intended to elicit a response or purchase, direct marketing tactics can have an immediate impact on a business’s bottom line. ConsDirect marketing is not all sunshine and roses. There are some downsides.1. Direct marketing is intrusiveDirect marketing tactics like cold email and ads are generally seen as interruptive. That is because the prospect did not request them and yet is still served a sales message.2. Direct marketing has a smaller reachAs mentioned earlier, there are only so many people who are ready and willing to buy. Direct marketing merely converts these people, but it cannot generate purchases among people who don’t even know you exist. 3. Direct marketing can be blockedCAN-SPAM, GDPR, ad-blockers—they exist to prevent unwanted sales messages from reaching consumers.Examples of successful indirect marketingLooking for successful examples of how companies have used indirect marketing? Here are three to be inspired by.1. Ahrefs – BlogThe main marketing type we use is SEO-driven content marketing. It can be summarized into one sentence:We create and maintain high-quality, search-focused content about topics with business potential, search traffic potential, and ranking potential.To break it down:We research topics our customers are searching for on Google.We filter them by checking their business potential—how easy it will be to pitch our product while tackling these keywords.We prioritize by analyzing their ranking potential—how viable it is for us to rank in the top three with our available resources.We create content targeting those topics.We update or rewrite them if they don’t rank or are out of date.This strategy means customers are always discovering us whenever they’re searching for solutions to their problems on Google. Our strategy is simple. No fancy tactics or the latest hot trend. But this deliberate simplicity makes the strategy easy to follow and is the driving force behind our eight-figure annual recurring revenue (ARR).Learn how to replicate our strategy in the guide below.Recommended reading: How to Create an SEO Content Strategy (Follow the Ahrefs’ Framework) 2. Wendy’s – TwitterWendy’s is a fast-food restaurant chain. Yet, you might not be able to tell from its tweets:Low vibration angel numbers astrology overwatch 2 house of the dragon sir this is a wendy’s Mario movie spooky season breath of the wild 2 soup-core Minecraft streaming Fortnite anime vibes aesthetic gen z Elden ring corn— Wendy’s (@Wendys) October 4, 2022 If you’re out of the loop, Wendy’s basically revolutionized how brands can use social media and communicate with their customers. Rather than post boring bureaucratic tweets in “corporatese,” it decided to do a 180° by sharing memes, roasting rival companies, and posting in a sassy tone. And it rarely has a call to action to visit a Wendy’s restaurant.But this indirect marketing works for it. In a highly competitive fast-food scene, this social media strategy puts its brand top of mind. Not only do its tweets gain attention on the network itself, but it also spreads virally across other channels. Memes, anime parodies, and YouTube videos—the list goes on. Since 2012, Wendy’s has overtaken Burger King to become the #3 U.S. fast-food chain.3. Slidebean – YouTubeSlidebean is a pitch deck design platform for startups and small businesses. It has >400,000 subscribers on YouTube. Many of its videos aren’t about pitch decks or pitch deck design; instead, they’re about startups, marketing, and business.This is deliberate. It initially started out with topics related to its product. But it found that it exhausted those topics in a short amount of time. So it decided to move up the marketing funnel into broader topics.Since we had found a “YouTube formula,” we decided to apply it to other kinds of content, and one of them was this idea of exploring failed companies. The first one was WeWork, which was just the right bridge between a startup-focused company and a widely known brand. At this stage, the series was called “Startup Forensics.”However, there were only so many tech startups to explore, so we quickly opened that up to “Company Forensics” to broaden our horizons.Jose Cayasso, CEOThis allowed Slidebean to get as many eyeballs as possible on YouTube, which puts its brand top of mind. The company hit $1.5 million in revenue with 3,000 customers in 2022. Final thoughtsThe best companies use both indirect and direct marketing. They don’t discriminate between strategies. If you want to improve your business, you should use both. Any questions? Hit me up on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Keep Learning Influencer Marketing: Definition, Examples, and Tactics Influencer marketing is the practice of working with influencers to promote your brand’s message, products or services. Ethical Marketing: Definition, Principles, & Examples Learn what ethical marketing is, its principles, how you can benefit from it, and more in our simple guide. Lead Magnets Explained: Definition, Basics & 17 Examples Lead magnets need an attractive topic and effective traffic sources. Only then can they bring visitors closer to becoming your customers. 18 Common Types of Marketing (Examples Included) Learn about the 18 different types of marketing you can use to grow your business. 9 Key Types of Marketing Campaigns and Successful Examples “Let’s do a marketing campaign!” Marketers hear that a lot, but it’s easier said than done. For starters, check out these 8 types of marketing campaigns.",
  "headers": [
    {
      "level": "H1",
      "text": "Indirect Marketing: Definition, Types, & Examples"
    },
    {
      "level": "H2",
      "text": "Types of indirect marketing"
    },
    {
      "level": "H3",
      "text": "1. Public relations (PR)"
    },
    {
      "level": "H3",
      "text": "2. Search engine optimization (SEO)"
    },
    {
      "level": "H3",
      "text": "3. Social media"
    },
    {
      "level": "H2",
      "text": "Indirect marketing: pros and cons"
    },
    {
      "level": "H3",
      "text": "Pros"
    },
    {
      "level": "H4",
      "text": "1. Indirect marketing builds demand and awareness"
    },
    {
      "level": "H4",
      "text": "2. Indirect marketing is less intrusive and non-pushy"
    },
    {
      "level": "H3",
      "text": "Cons"
    },
    {
      "level": "H4",
      "text": "1. Indirect marketing takes time"
    },
    {
      "level": "H4",
      "text": "2. Indirect marketing is less trackable"
    },
    {
      "level": "H2",
      "text": "Direct marketing: pros and cons"
    },
    {
      "level": "H3",
      "text": "Pros"
    },
    {
      "level": "H4",
      "text": "1. Direct marketing is measurable"
    },
    {
      "level": "H4",
      "text": "2. Direct marketing is fast"
    },
    {
      "level": "H3",
      "text": "Cons"
    },
    {
      "level": "H4",
      "text": "1. Direct marketing is intrusive"
    },
    {
      "level": "H4",
      "text": "2. Direct marketing has a smaller reach"
    },
    {
      "level": "H4",
      "text": "3. Direct marketing can be blocked"
    },
    {
      "level": "H2",
      "text": "Examples of successful indirect marketing"
    },
    {
      "level": "H3",
      "text": "1. Ahrefs – Blog"
    },
    {
      "level": "H3",
      "text": "2. Wendy’s – Twitter"
    },
    {
      "level": "H3",
      "text": "3. Slidebean – YouTube"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Si Quan Ong"
}