{
  "url": "https://ahrefs.com/blog/introducing-anchors-2-0/",
  "slug": "introducing-anchors-2-0",
  "title": "Introducing Anchors 2.0",
  "description": "Find Anchors in the sidebar of Site Explorer. You know the drill by now – the report’s still in early access, so we’ll be rolling out new features",
  "content": "Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Our newest revamp is the Anchors report, which shows you anchor texts from inbound backlinks pointing to your target.Find Anchors in the sidebar of Site Explorer.You know the drill by now – the report’s still in early access, so we’ll be rolling out new features gradually, beefing up the report and fixing bugs along the way. What’s new is largely the same as with the other 2.0 reports, with some notable highlights.Streamlined workflow It now takes only one click to open the nested referring domains report.We’ve also added a nested backlinks table so you can peek at the backlinks for each anchor without having to leave the report or open a new tab.Need to investigate deeper? Just click on an anchor text in Anchors 2.0 to open up Backlinks 2.0 with the anchor set as a filter. Runs much faster Anchors 2.0 uses the same new technology and database as in Backlinks 2.0 and Referring domains 2.0, so it’s way faster than the old report. More intuitive historical dataNow, you’ll always see all live anchors regardless of your Ahrefs plan.Use this date selector to select the timeframe you want to compare data for. You’ll also notice a brand new feature: this anchors status toggle. The new and lost statuses are based on new and lost backlinks – so if there are no longer any links using a particular anchor, we consider this anchor as lost. And if we find an anchor that hasn’t been used before, we report it as new.Look at the New links and Lost links columns to see how many new links were gained and how many links were lost during your selected time period at a glance. You can also use the New links and Lost links filters to zoom in on data.Anchors 2.0 shares the same historical data limits implemented across all Site Explorer 2.0 reports.So on a Lite plan, you’ll see all live backlinks and be able to explore changes over the last 6 months. The same applies if you’re on a Standard plan, except that you have historical data for the last two years. And Advanced and Agency plans get our full history. Filter lost anchors by loss reasonUse the Status filter to zoom in on lost anchors based on the reason why they were lost.Of course, you can do the same for new anchors. Exclude subdomainsUse the new Exclude subdomains toggle to filter out spammy backlinks and get cleaner data. It works the same way here as it does in Content Explorer: by filtering out links from level 3+ subdomains, for example “dfsf33q.blogspot.com”. New filters and statusesFilter by just about any metric you see in the report. Zoom in on data using new advanced text filters for referring and target URLs, titles, anchors and surrounding texts. These work with “contains/doesn’t contain” and other operators.Differentiate between links to web pages and links to all sorts of other files (jpg, pdf, css..).---That’s all for today. Liked this update? Feel free to share our Twitter thread:Introducing Anchors 2.0 by @itsrbekOur newest revamp is the Anchors report, which shows you anchor texts from inbound backlinks pointing to your target.Here are some notable highlights.https://t.co/CNxJRMQDM8— Ahrefs (@ahrefs) August 5, 2021 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs.",
  "headers": [
    {
      "level": "H1",
      "text": "Introducing Anchors 2.0"
    },
    {
      "level": "H3",
      "text": "Streamlined workflow"
    },
    {
      "level": "H3",
      "text": "Runs much faster"
    },
    {
      "level": "H3",
      "text": "More intuitive historical data"
    },
    {
      "level": "H3",
      "text": "Filter lost anchors by loss reason"
    },
    {
      "level": "H3",
      "text": "Exclude subdomains"
    },
    {
      "level": "H3",
      "text": "New filters and statuses"
    }
  ],
  "author": "Rebekah Bek"
}