{
  "url": "https://ahrefs.com/blog/introducing-referring-domains-2-0/",
  "slug": "introducing-referring-domains-2-0",
  "title": "Introducing Referring domains 2.0",
  "description": "Find Referring domains in the sidebar of Site Explorer. You know the drill by now – the report’s still in early access, so we’ll be rolling out new",
  "content": "Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents We’ve now revamped Referring domains – the report that shows you which unique websites are pointing to a domain, URL, or subdomain.Find Referring domains in the sidebar of Site Explorer.You know the drill by now – the report’s still in early access, so we’ll be rolling out new features gradually, beefing up the report and fixing bugs along the way. Here are the highlights.Runs much faster Like with Backlinks 2.0, Ref.domains 2.0 uses new technology and an entirely new database, so it’s way faster than the old report. More intuitive historical dataIn the old report, you had to switch between different backlinks indexes depending on what you wanted to see: Live, Recent or Historical. This was difficult to explain and probably equally difficult to understand.But now, everything is super simple in the new report!Just use this date selector to select the timeframe you want to compare data for. You’ll always see all live referring domains regardless of your Ahrefs plan.You can also see how many new links were gained and how many links were lost during your selected time period at a glance with the New links and Lost links columns. Plus, you can filter for these as well.A note on limits: Ref.domains 2.0 shares the same historical data limits we’ve been implementing in all Site Explorer 2.0 reports.So on a Lite plan, you’ll see all live referring domains and be able to explore changes over the last 6 months. The same applies if you’re on a Standard plan, except that you have historical data for the last two years. And Advanced and Agency plans get our full history. Filter lost ref.domains by loss reasonThis one’s a highly-requested feature – the new Status filter lets you zoom in on lost referring domains based on the reason why they were lost.And the same goes for new referring domains.Exclude subdomainsUse the new Exclude subdomains toggle to filter out spammy backlinks and get cleaner data. It works the same way here as it does in Content Explorer: by filtering out links from level 3+ subdomains, for example “dfsf33q.blogspot.com”. This was also a really popular feature request. New filters and statusesFilter by just about any metric you see in the report. Zoom in on data using new advanced text filters for referring and target URLs, titles, anchors and surrounding texts. These work with “contains/doesn’t contain” and other operators.Differentiate between links to web pages and links to all sorts of other files (jpg, pdf, css..).---That’s it for the new stuff for now. Have fun exploring, and watch our dashboard for updates! Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs.",
  "headers": [
    {
      "level": "H1",
      "text": "Introducing Referring domains 2.0"
    },
    {
      "level": "H3",
      "text": "Runs much faster"
    },
    {
      "level": "H3",
      "text": "More intuitive historical data"
    },
    {
      "level": "H3",
      "text": "Filter lost ref.domains by loss reason"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H3",
      "text": "Exclude subdomains"
    },
    {
      "level": "H3",
      "text": "New filters and statuses"
    }
  ],
  "author": "Rebekah Bek"
}