{
  "url": "https://ahrefs.com/blog/keyword-clustering-tools/",
  "slug": "keyword-clustering-tools",
  "title": "Keyword Clustering in Seconds: Save Time With Keywords Explorer Tool",
  "description": "Keyword clustering tools group keywords with the same or similar intent and tell you which keywords to target on the same page.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Keyword clustering tools group keywords with the same or similar intent. This makes it easier to take action on your keyword research because it tells you which keywords to target on the same page.Unfortunately, most keyword clustering tools aren’t exactly quick…For example, I asked a popular keyword clustering tool to group 4,703 keywords. It took 51 minutes! That’s a long time to wait!Luckily, you can cluster keywords much quicker in Keywords Explorer.ContentsHow to cluster keywords instantly in Keywords ExplorerJust enter your broad search or list of keywords and click the “Clusters by Parent Topic” tab in the Overview or a keyword ideas report:You’ll see your keywords grouped into clusters by Parent Topic and sorted by Cluster volume.To see the keywords in a cluster and their metrics, hit the caret in the Keywords column:Let’s go into more detail for a few different scenarios.To cluster an existing list of keywords…Paste in your list of up to 10,000 keywords, hit search, and click the “Clusters by Parent Topic” tab on the Overview report. That’s it!To cluster a new keyword list…Enter a few seed keywords, go to one of the keyword ideas reports (e.g., Matching terms), then hit the “Clusters by Parent Topic” tab to cluster all keyword ideas.If you want to be more selective, use the filters to refine your search and add keyword ideas you like to a keyword list.If you then select this your list of keyword lists on the left and hit the “Clusters by Parent Topic” tab, it’ll cluster your list:To cluster your competitor’s keywords…Enter a competitor’s domain into Site Explorer, go to the Organic Keywords report, and export the data.Sidenote. If your competitor ranks for over 10,000 keywords, you’ll have to use the filters to refine the report before exporting. This is because 10,000 is the maximum number of keywords you can paste into Keywords Explorer, which is the next step.Next, paste the exported keywords into Keywords Explorer, then hit the “Clusters by Parent Topic” tab on the Overview report.Looking to cluster more than 10,000 competitor keywords?It’s not yet possible to do this by Parent Topic in Ahrefs, but the Top Pages report in Site Explorer does something very similar. It shows you the top pages by estimated traffic and the keyword sending the most traffic to the page (which is often a good indicator of the overall topic).You can also see all the keywords the page ranks for by hitting the caret:If your goal is to find topic ideas from your competitors, this report is a goldmine.How instant keyword clustering works in Keywords Explorer toolInstant clustering works by grouping keywords using a proprietary metric in Ahrefs called Parent Topic. To get this metric, we take the #1 ranking page for your keyword and find the keyword responsible for sending the most traffic to that page.ExampleThe top-ranking page for “best drip coffee maker” is from Wirecutter:The same page ranks #1 for “best thermal carafe coffee maker”…… and for “best filter coffee maker”:Because of this, all three keywords have the same Parent Topic (“best drip coffee maker”) and fall under the same cluster:It’s clearly possible to rank higher for all keywords in the cluster with just one page because that’s exactly what the Wirecutter’s page does.This method of clustering is faster than many other keyword clustering tools because, unlike them, we don’t have to do much computing on the fly to group keywords. We already have Parent Topics stored.Ahrefs’ Keywords Explorer tool also has instant term clustering!Term clustering is where you group keywords by the words or phrases they contain rather than intent. It’s useful for understanding trends, finding niches, and clustering keywords into topical buckets so you can create related content in batches.To do it in Ahrefs, just hit the “Clusters by terms” tab in the Overview or a keyword ideas report.For example, if you enter “notion” as your seed keyword and cluster by terms, you’ll see that one of the term clusters is “template”:This cluster contains 5,098 keywords with a global combined search volume of 257K.If you hit the caret to reveal the keywords, you’ll see all kinds of Notion templates people are searching for, like:notion budget templatenotion calendar templatenotion project management templatenotion school templatenotion journal templatenotion workout templatenotion travel templateGiven how much search traffic potential there is here, this could be a great niche for a new website.FAQsWhy should you cluster keywords?Keyword clustering speeds up content production by turning keywords into topics that writers can immediately start working on. It also helps you produce more comprehensive content, as keywords in clusters often represent important subtopics.What is the best keyword clustering tool?Ahrefs is the best keyword clustering tool if you’re looking to cluster keywords fast. It takes just seconds, while other tools can often take more than an hour just to cluster a few thousand keywords.What is the downside of using Keywords Explorer as a keyword clustering tool?Keywords Explorer is arguably less accurate than some keyword clustering tools because it clusters by Parent Topic. This means we’re judging the similarity of keywords based on the top-ranking result, not the entire SERP (as some other tools do). But that’s also why it’s so fast!Where can I learn more about keyword clustering?Read our guide to keyword clustering. It goes deeper into how to do it and the benefits and drawbacks of clustering. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Keep Learning Keyword Competitive Analysis: How to Find Your Competitors’ Keywords Keyword competitive analysis is the process of finding relevant and valuable keywords that your competitors rank for, but you don't. How To Do Keyword Clustering the Easy Way Learn how to cluster keywords in seconds with this simple two-step process. Keyword Analysis for SEO: Deciding if (And How) to Target a Keyword You can't just depend on keywords with high search volumes—there's so much more to it than that! Let's explore. Advanced Keyword Research: 5 Tips for Finding Untapped Keywords Build search traffic and rankings by targeting the keywords your competitors haven’t found yet with these five tips. How to Do YouTube Keyword Research in 3 Easy Steps Learn the keyword approach that helped us grow our channel from 10,000 to over 200,000 monthly views in around a year.",
  "headers": [
    {
      "level": "H1",
      "text": "Keyword Clustering in Seconds: Save Time With Keywords Explorer Tool"
    },
    {
      "level": "H2",
      "text": "How to cluster keywords instantly in Keywords Explorer"
    },
    {
      "level": "H3",
      "text": "To cluster an existing list of keywords…"
    },
    {
      "level": "H3",
      "text": "To cluster a new keyword list…"
    },
    {
      "level": "H3",
      "text": "To cluster your competitor’s keywords…"
    },
    {
      "level": "H2",
      "text": "How instant keyword clustering works in Keywords Explorer tool"
    },
    {
      "level": "H3",
      "text": "Example"
    },
    {
      "level": "H2",
      "text": "Ahrefs’ Keywords Explorer tool also has instant term clustering!"
    },
    {
      "level": "H2",
      "text": "FAQs"
    },
    {
      "level": "H3",
      "text": "Why should you cluster keywords?"
    },
    {
      "level": "H3",
      "text": "What is the best keyword clustering tool?"
    },
    {
      "level": "H3",
      "text": "What is the downside of using Keywords Explorer as a keyword clustering tool?"
    },
    {
      "level": "H3",
      "text": "Where can I learn more about keyword clustering?"
    }
  ],
  "author": "Joshua Hardwick"
}