{
  "url": "https://ahrefs.com/blog/link-building-strategies/",
  "slug": "link-building-strategies",
  "title": "12 Link Builders Share Strategies That Work in 2024",
  "description": "I asked 12 SEOs for the link building strategy that's working best for them right now. Here are the tactics they shared and how to do them.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents I asked 12 SEOs for the link building strategy that’s working best for them right now. Here are the tactics they shared, how to do them, and tips for success. ContentsPitch “best of” listicles that feature multiple competitors, but not youThis has been my go-to link building strategy for quite some time now. What makes this approach very effective is that it touches multiple campaign objectives beyond just building topical authority and improving search rankings.Jason Acidre, CEO AvarisHow to do it Let’s say you were doing this for MailChimp. You might want to find listicles that feature brands like ConvertKit and Aweber but not MailChimp—like this one: To find these, run this search in Ahrefs’ Content Explorer: [competitor 1] +[competitor 2] -[your brand] title:(best OR top) For example, to find listicles that mention Aweber and ConvertKit but not MailChimp, you’d search for: convertkit +aweber -mailchimp title:(best OR top) If you spot a listicle where you feel you should be listed, find their email address and reach out to them. Here’s an example email Jason used: I don’t recommend copying Jason’s email word for word, but here’s his and Alex Tachalova’s advice on what to include: Some key pointers for emails: Briefly highlight why your product or service merits inclusion on their list.Reference other reputable lists that have already featured your product or service.Inquire about their criteria and requirements for inclusion.Offer free tool access, complimentary products for review, or case studies that they can review (if you’re providing a service).Jason Acidre, CEO Avaris Our pitches generally include: The client’s previous features in listicle posts.A suggestion to collaborate on enhancing the quality of their listicle post, given the client’s industry expertise.An analysis of top-ranking listicle posts to identify missing tools or information that could offer a competitive edge and improve their post’s rankings. Alexandra Tachalova, Founder Digital Olympus As Jason points out, this strategy has benefits beyond improving rankings for your website. It also exposes your brand to more people as you’re consistently listed as a top option in your industry. For example, Jason got his client mentioned in nearly every top-ranking listicle for “best dropshipping suppliers.” That’s a lot of extra brand exposure! Create data-led campaigns about a trending topic, then pitch journalists Apart from the selfie battle I have with Tim Soulo, this is one of the most effective link-building strategies we’re using right now. Jason Hennessey, CEO Hennessey DigitalHow to do it Start by finding a trending topic journalists care about. Google News and Google Trends are good places to start. We start by identifying current trends using tools like Google Trends and monitoring industry news. Jason Hennessey, CEO Hennessey Digital We use lots of techniques from monitoring news sources in real time to conducting research with Google News to understand the types of topics that have been previously covered at specific times of year. Amanda Walls, Head of SEO & Digital PR Cedarwood Digital You can also use the Growth metric in Ahrefs’ Keywords Explorer. For example, if I enter “vaping” and sort by the Growth column, I see lots of lung health searches breaking out in the past three months: I also see this echoed in Google News: It’s then a case of sourcing some unique data, publishing it in an easy-to-utilize format, and sending it to journalists. Matt Diggity shared a few great sources with me: For government databases you have usa.gov for the states. Data.gov is another alternative. UK Data Service is the equivalent for the UK. Eurostat is great for other countries in the EU. And Statistics Canada is for… yeah, Canada. Internationally, World Bank Open Data and United Nations Data are treasure troves. Pew Research Center is great for social issues, public opinion, and demographic trends. FBI Crime Data Explorer is great for crime stats. And the CDC is great for health data. Matt Diggity, Founder Diggity Marketing Amanda also often uses freedom of information (FOI) requests for data, as she did for her piece on the UK’s illegal vape hotspots: This campaign earned links from 72 referring domains and got featured in many online newspapers: Example feature in the Lancashire PostExample feature in the Ardrossan & Saltcoats HerandExample feature in the South Wales Guardian How do you find journalists? Here’s Jason’s advice: We start by researching those who have previously covered similar topics or industries. We use tools like Muck Rack, Cision, or even X to find journalists by searching for keywords related to our story. We look at bylines in relevant publications to see who is writing about related subjects and review their past articles to understand their interests and writing style. Jason Hennessey, CEO Hennessey DigitalBuild relationships with journalists, then have your client respond to their requests Journalists are always looking for comments, tips and advice from thought leaders. Nurture these relationships and meet request deadlines, and you position yourself as the PR expert who can help during busy periods.Eva Cheng, Digital PR Consultant Eva Cheng PRHow to do it One way is to sign up for HARO and other alternatives, but Eva recommends a more proactive approach. She builds relationships with journalists relevant to her clients so they come directly to her for tips and quotes. How can you find these people? Eva uses keyword alerts: I have Google Alerts set up for relevant keywords related to a brand or topic. For example, I have the words “vet,” “dog behaviour,” and “cat behaviour” set up for a pet insurance brand so I can see the related coverage mentioning these words. Eva Cheng, Digital PR Consultant Eva Cheng PR You can also use Ahrefs Alerts. The benefit of this over Google Alerts is that you can filter by language, traffic, Domain Rating (DR), etc. to separate the wheat from the chaff: Alternatively, use Content Explorer to find people who’ve talked about topics recently. Just search for a keyword and filter for pages published in the last 90 days. For example, if I search for “vet,” I see this recent article on a DR 83 site from Jessie Quinn: It looks like she’s written a couple of pet-related articles recently: Her profile also says she writes for many well-known sites and has a pug called Daphne: This journalist would clearly be a great person to build a relationship with! How? Eva says it all starts with a simple “hello”: Reach out and introduce yourself and your client to journalists and niche publications who cover related topics regularly. Offer them the opportunity to receive exclusive commentary when requested. After a journalist has covered your campaign or expert commentary, always drop them a note to say thank you. You never know it can also lead to another request or opportunity for your client. Eva Cheng, Digital PR Consultant Eva Cheng PR Oh, and don’t rely on AI when actually replying to requests, whether direct or via platforms like HARO. Greg explains why: AI is not yet capable of replacing a high quality writer. Simply copy/pasting their content over to a journalist outreach email is a fantastic way to earn your client a spot on a journalist or publication’s ban list. When our writers use AI, they use it for idea generation to overcome writer’s block. This is how I recommend using it. Greg Heilers, Co-founder Jolly SEOCreate map-o-graphics and pitch journalists Data-driven digital PR campaigns, like maps, are our most effective method for driving backlinks at the moment. George Driscoll, Global Digital PR Lead RemitlyHow to do it Start by brainstorming topics with map potential that make sense for your brand. Ask yourself, what would a journalist and user expect you to be an expert on? For a cocktail brand, doing a map on speakeasy bars around the world would make perfect sense, or a map on the rooftop bars with the best reviews, etc. George Driscoll, Global Digital PR Lead RemitlyIf you’re struggling for ideas, search for a topic in Content Explorer and filter for pages with lots of backlinks. These are proven ideas you know people want to link to. For example, if I search for “tax,” I see over 300 referring domains to a page listing countries where you have to pay “tourist tax”: This immediately sparks an idea: map out countries with the most and least expensive “tourist taxes.” Once you have your map, send it to journalists who might be interested in covering it. Find journalists who write about that kind of content, either literally map based data, or perhaps in the example above, they write about travel. George Driscoll, Global Digital PR Lead Remitly Darren did this for his map of which states will pay the most taxes over their lifetime… … earning links from 188 referring domains in the process: As Jason suggested earlier, tools like MuckRack, Cision, and X can be useful for finding journalists interested in your topic. But you can also just search Content Explorer for pages published about a topic in the last 90 days, and extract journalist names from there. Rank statistics pages for low-hanging “fact finder” keywords Our unique process for this has worked amazingly well for us for years now. In fact, we’ve just finished some internal research and found our assets like this generate an average of 102 referring domains. Darren Kingman, Founder Root DigitalHow to do itEnter a topic into Ahrefs’ Keywords ExplorerGo to the Matching terms reportFilter for keywords that include terms like “statistics,” “facts,” “graph,” etc. This will find keywords people search for when looking for facts and figures for their articles. Rank for these, and your page will often earn links on autopilot. Here’s Darren’s advice on what make a good keyword: The most important thing is that there isn’t just one or two top-ranking pages soaking up all the links. If there’s 3 or 4 that have 100+ and a couple with 20+ or so, that’s all good. It shows there’s a nice spread and journalists/linkers are happy to mix it up themselves. Darren Kingman, Founder Root Digital This is exactly how the SERP looks for “uk salary statistics:” In fact, Darren and his team created one of the top-ranking pages. As of today, it’s earned links from 98 referring domains: And this is without outreach! Importantly, we don’t do outreach for these campaigns. They’re designed to remove that element of time and therefore making it more affordable for clients compared to our other activities. Darren Kingman, Founder Root Digital How do you create a winning page? It’s all about picking low-hanging opportunities and beating the competition on the content front. We’re often looking for opportunities where the ranking pages aren’t properly fulfiling a user’s intention. They may not have many images to engage users, the key stats might be buried in a wall of copy, etc. So we’re utilising content marketing 101 to see where we might be able to elevate a page and make it more engaging. Darren Kingman, Founder Root DigitalFurther readingLink Building Case Study: How We Built Backlinks With a ‘Stats’ PageHost unique giveaways and promotions, then promote them to journalists From some campaigns, I’ve seen over 291 referring domains secured from media sites. The crazier the giveaway, the more chance of backlinks. James Norquay, Founder Prosperity MediaHow to do it Brainstorm trending topics with potential for a unique promotion that you can tie back to your brand. For example, Dish Network ran a promotion offering $1,000 to anyone willing to binge watch 15 hours of The Office: It earned links from 150 referring domains, including big media sites like Thrillist, Business Insider, CNET, Mental Floss, and many others. Struggling for ideas? Try asking ChatGPT: Hey ChatGPT. I found a unique promotion online where Dish Network offered to pay people $1,000 to binge watch 15 hours of The Office. My brand is [brief description]. Give me a few ideas for a similar promotion I can run. Here’s one idea it came up with for a coffee brand: Not bad! But who should you tell about your wacky campaign once you have it? Here’s a smart tip from James: It’s as simple as reaching out to the same publications and journalists who’ve covered similar things before. You can find plenty of these already online from movies and tv shows. James Norquay, Founder Prosperity Media For example, you can just export the 150 sites linking to The Office campaign via Site Explorer and reach out to them. Pitch sites linking to resources with accessibility issues I have to give credit to Russ Jones (RIP) who was one of the most switched on link builders and SEOs I have ever met for this tip he shared with me. James Norquay, Founder Prosperity MediaHow to do it Start by finding relevant pages with lots of backlinks in Ahrefs: Search for a topic in Content ExplorerFilter for pages with 100+ referring domainsFilter out subdomains, homepages, and multiple pages per domain In the example above, there are 1,952 pages about tax with links from over 100 websites. One of them is this federal income tax calculator with 1,500 referring domains: Next, run a free audit with a tool like AccessScan to check how accessible the page is for people with disabilities: In this case, the page is non-compliant. This means that over 1,500 sites are linking to a resource that isn’t accessible for users with vision, motor and cognitive impairments—including a few government and education websites: Here’s what James says to do next: You reach out to the website and say the resource on your page is not accessible to visually impaired users. This is a highly successful outreach method vs just sending emails at scale asking for guest posts. James Norquay, Founder Prosperity Media Of course, this does mean you need to create an alternative resource that is compliant. But that’s easily worth it when there’s a pool of hundreds or thousands of potential linkers. Guest posting… with the help of AI I know it might sound a bit old-school, but guest posting still delivers great results. However, the days of mass emailing generic pitches are over. The strategy is the same—offering valuable content for a link—but the execution needs a fresh approach. Bibi Lauri Raven, Founder BibiBuzzHow to do it First, you need to find sites that might be open to a guest post. To do that: Run an “In title” search for a broad industry term in Content ExplorerFilter for sites with a Domain Rating (DR) between 30-60 (this removes big sites that probably won’t accept guest posts)Go to the “Websites” tab Here you will see the top 100 sites getting the most search traffic to content about your topic. These are good sites to pitch a guest post, as they’ve already written about similar topics before. Bibi recommends using AI to help with your pitch: Ai is an awesome tool [for pitching]. It can help you create everything from catchy subject lines to compelling pitches and even eye-catching visuals. Bibi Lauri Raven, Founder BibiBuzz For example, she used AI to create Midjourney images that combined cats and dogs with her target niche. When she reached out to trucking companies, this charming approach got a lot of positive attention. If zany or “out there” isn’t really your jam, that’s fine. As Bibi says, it’s not a necessity. The point is to use AI to improve your pitches and make them more creative. You don’t always need to be funny or wild, but AI lets you create highly targeted content in formats that would typically require a whole team with specialised skills. So, even though guest posting might seem basic, the possibilities are endless with AI. Just keep experimenting with it! Bibi Lauri Raven, Founder BibiBuzzFind a page with links, make something better, pitch it as a replacement (aka the “skyscraper” technique) [/blockquote] Most people assume that “skyscraper” is dead because it worked well in 2017, then got abused until it didn’t work anymore. But we’re finding that it’s starting to open up again now.Eric Carrell, Co-founder Dofollow.comHow it works This is arguably the most famous link building technique there is, but if you’ve been hiding in a cave for the last decade, here’s how it works in a nutshell: For example, this list of best headphone recommendations has 469 referring domains… … but it hasn’t been updated since 2021: Given how fast the headphone industry moves these days, this means that hundreds of sites are linking to a completely outdated list of recommendations. To take advantage of this, you would: Publish an up-to-date list of headphone recommendations (aka. “skyscraper” content)Pitch this as a replacement to everyone linking to the outdated post. Here’s a quick tip from Eric to help maximise your results: Give people extra incentive to link by offering to share their content on your social networks. We do this when promoting our clients’ content and it still works relatively well. Eric Carrell, Co-founder Dofollow.comFurther readingHow to Execute the Skyscraper Technique (And Get Results)Keep learning Thanks to everyone who contributed to this post. If you want to learn even more about building links, check out these posts and courses: Link Building for SEO: The Beginner’s GuideAdvanced Link Building Course Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Keep Learning The Only 9 Link-Building Tools You Need in 2024 You don't need dozens of link building tools. You just need 8 of them. Here are the 8 we recommend. Black Hat Link Building Services PART 2: Do They Work? We tested one of the web's most popular black hat link building services to see if it actually works. Here are the results. 6 Link Building Services That Actually Work (+6 More to Avoid) The right link building services can help you land high-quality links in a shorter amount of time. Here's how to pick 'em. Should You Buy Backlinks in 2024? It Depends Buying backlinks is against Google’s Webmaster Guidelines, but is it really as risky as people say it is? 5 Simple E-commerce Link Building Tactics Learn how to get backlinks to your online store’s product pages, homepage, and other content using five simple tactics.",
  "headers": [
    {
      "level": "H1",
      "text": "12 Link Builders Share Strategies That Work in 2024"
    },
    {
      "level": "H2",
      "text": "Pitch “best of” listicles that feature multiple competitors, but not you"
    },
    {
      "level": "H3",
      "text": "How to do it"
    },
    {
      "level": "H2",
      "text": "Create data-led campaigns about a trending topic, then pitch journalists"
    },
    {
      "level": "H3",
      "text": "How to do it"
    },
    {
      "level": "H2",
      "text": "Build relationships with journalists, then have your client respond to their requests"
    },
    {
      "level": "H3",
      "text": "How to do it"
    },
    {
      "level": "H2",
      "text": "Create map-o-graphics and pitch journalists"
    },
    {
      "level": "H3",
      "text": "How to do it"
    },
    {
      "level": "H2",
      "text": "Rank statistics pages for low-hanging “fact finder” keywords"
    },
    {
      "level": "H3",
      "text": "How to do it"
    },
    {
      "level": "H2",
      "text": "Host unique giveaways and promotions, then promote them to journalists"
    },
    {
      "level": "H3",
      "text": "How to do it"
    },
    {
      "level": "H2",
      "text": "Pitch sites linking to resources with accessibility issues"
    },
    {
      "level": "H3",
      "text": "How to do it"
    },
    {
      "level": "H2",
      "text": "Guest posting… with the help of AI"
    },
    {
      "level": "H3",
      "text": "How to do it"
    },
    {
      "level": "H2",
      "text": "Find a page with links, make something better, pitch it as a replacement (aka the “skyscraper” technique)"
    },
    {
      "level": "H3",
      "text": "How it works"
    },
    {
      "level": "H2",
      "text": "Keep learning"
    }
  ],
  "author": "Joshua Hardwick"
}