{
  "url": "https://ahrefs.com/blog/link-building-methods/",
  "slug": "link-building-methods",
  "title": "3 Link Building Methods That Helped Pet Keen Grow to 3M Organic Traffic",
  "description": "A closer look at Pet Keen's impressive organic growth, which is largely made possible by three link building methods.",
  "content": "Simon Treulle Simon is the CEO of Pangolia, a digital media and e-commerce company seeking to improve the lives of pet families. His team works on sites like hepper.com and petkeen.com, which are visited by more than 100M readers every year. In his spare time, he loves traveling the world while exploring new places and cultures. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents In the past three years, we’ve grown Pet Keen from 0 to nearly 3 million organic visits per month.A big part of this success comes from backlinks. So in this guide, I will show you the link building methods that we used to achieve this massive growth.ContentsMethod 1. HARO (Help a Reporter Out)HARO is a free service that connects journalists and sources. Just sign up, choose the topics that interest you, and you’ll get daily emails with questions from journalists.Here’s an example of a HARO request:Having our veterinarian reply to this request earned us a link from handicappedpets.com (DR 69):Let me share a few tips that I think are responsible for our success on this platform.Tip 1. Hire industry experts to answerJournalists have a reputation to uphold, so they’re rarely interested in what a regular Joe has to say. They want expert insights.That’s why we hire veterinarians to respond to HARO requests. I don’t think we’d have half as much success with this tactic if we didn’t do this.Here are a few of my favorite ways to find industry experts:Publish a “hiring” page for experts – We get over 10 emails a week from ours.Ask existing team members for referrals – This works well because industry experts often know other experts within their fields.Post on job boards – ProBlogger has worked quite well for us, as has UpWork. Tip 2. Publish author pages for your expertsYour expert may have authority in the industry. But if you’re not showing their expertise, the journalist won’t know, and this will decrease your chances of success.To solve this, we publish expert author pages and link to them when replying to HARO queries. Here’s one of ours:Here are the most important things to include in my opinion:Photo – This gives the expert personality.Bio – This explains who they are and where they got their education.Experience – This expands on their bio to further establish their expertise.Publications – This links to notable publications where the expert has been featured. LinkedIn profile link – We always make sure this is up to date, has a proper profile picture, and has an overview of their education.Tip 3. Use HARO alternatives tooHARO is pretty saturated these days, so I highly recommend looking for alternative places to find journalists who are looking for sources.We’ve had great success on JournoLink and on Twitter with the #journorequest hashtag.Think about your industry: Where do journalists go to find sources and experts to speak with?Method 2. Industry statistics postsJournalists often search for statistics to back up their sources and claims. So if you can rank for the terms they use to find these statistics in Google, you’ll often be able to earn backlinks passively over time.For example, our post about pet industry statistics has attracted links from 164 referring domains and counting: Many of these are from highly reputable sources like chubb.com and EcoWatch too: This is (at least in part) because the page ranks in the top five for keywords like “pet industry statistics”:Here’s how we found this keyword:Enter a broad industry topic into Ahrefs’ Keywords ExplorerGo to the Matching terms reportFilter for keywords with a Keyword Difficulty (KD) score of 50 or moreAdd terms like statistics, stats, facts, figures to the “Include” filterFor example, one keyword we found was “pet industry statistics.” It has an estimated monthly search volume of 100 per month in the U.S. and a Keyword Difficulty (KD) score of 77: Because the KD score is high, we know the top-ranking pages have lots of backlinks. This indicates that journalists are probably searching for the keyword and using the top pages as sources, which is exactly what we were looking for.Editor’s NoteYou’ll sometimes need to do some manual link building to give your content a headstart and get it on the first page. This is exactly what we did with our SEO statistics post. Learn more in our link building case study.Joshua HardwickHead of ContentMethod 3. Guest blogging and case studiesGuest blogging is where you write a one-off post for another website.It’s a tactic that has been around for decades, but it still works very well if done correctly—and that means writing a good pitch.Here’s an example of a successful pitch I sent to Flippa (DR 82):Hi [name],Nice to e-meet you. 🙂My friend [FriendsName] who has been writing for Flippa recommended that I get in touch with you.I’m Simon Treulle, and I have been operating online content sites since 2014, and now I run a portfolio of sites that has a total readership of around 48 million users per year.Our biggest sites are Hepper.com (an eCommerce company making and selling cat furniture), and PetKeen.com.I had a cool idea for something that I would love to write, and that I think would be really interesting for your audience. An article about launching a blog (with Display Ads and Affiliate partnerships) on an eCommerce store.We’ve seen a lot of success by doing this, and initially we had a lot of resistance towards rolling out display ads on our eCommerce site’s blog. Because conventional wisdom says that ‘ads are annoying, and ruin your brand value.’Having rolled out this blog has allowed us to generate a solid stream of cashflow that we can reinvest into product development. This has been especially helpful since we acquired Hepper in 2021: Right in the middle of the eCommerce supply chain crisis.This made it hard to get our products manufactured and shipped to our customers. It also took time to build the relationships with manufacturers, and other partners, etc.It would be exciting to write about our learnings, wins, and reflections on this topic. Here are some of the subtopics I could go over inside the article:Using our display ads and affiliate earnings as a diversified revenue stream to reinvest into product developmentConventional wisdom says that you should not put display ads on your eCommerce store’s blog. But why did we end up doing it?A look at other eCommerce stores that have had success with launching a blogAnd you can decide not to publish it if you don’t like what I write.Btw here’s an article I wrote for Amazon: https://affiliate-program.amazon.com/resource-center/meet-an-amazon-associate-simon-treulle. Interested in hearing what you think!Also, my Flippa profile is: https://flippa.com/users/2807017. (I haven’t bought a site on Flippa YET, but have a call scheduled with a Seller this week. Have bought multiple sites on other marketplaces in the last 2 years.)Kind regards,Simon TreulleCEO at PangoliaAnd here’s the resulting guest post:Let me share a few more tips for achieving success with guest posting.Tip 1. Pitch websites you already have relationships withPeople tend to do business with those they already know, so a good starting point is to pitch posts to those you have existing relationships with.I’m not just talking about people or companies you have deep relationships with either. This isn’t always necessary. Believe it or not, just being a customer is often enough to get their attention and interest. Here are a few questions I recommend asking yourself to find places to pitch:Which software and apps do you use? These companies are often interested in hearing about how their software is helping your business succeed.Which online publications do you love? This will help you personalize your pitch.Who do you know in the industry? Maybe they can introduce you to the editor at their company?You’ll see in my pitch to Flippa that I highlighted how I had been a Flippa user for many years and that I was looking to acquire a site through it. This likely helped make it clear to the editor of Flippa an existing relationship between us.Tip 2. Pitch medium to high DR sitesYou should spend your time where you can make the biggest impact and get in front of most readers.Therefore, you should be picky about who you pitch. We use Ahrefs’ Domain Rating (DR) as a filter, as it’s an indicator of a site’s authority.I find that pitching to companies that have a DR higher than 50 is the sweet spot.Editor’s NoteI’d recommend looking at traffic estimates over DR here. It’s a better judge of the number of eyeballs a site is getting than DR. You can see this number in Site Explorer.Joshua HardwickHead of ContentTip 3. Consider pitching a case study or podcast episode instead of a guest postGuest posting has unfortunately earned a bad reputation over the years, which is why some publications will reject all pitches without question. So I recommend thinking about other types of content you can create that will provide value to their audience.We’ve had a lot of success with case studies. Here are a few we’ve published: How Cloudways Helped Pangolia & Hepper Get 3X More Traffic (DR 90)How Hepper Uses Hunter to Establish Six-Figure Partnerships (DR 81)How Pangolia Uses Mailshake for Affiliate Partnerships Success (DR 78)Case studies work well because companies love seeing how they are enabling your success. These reflect positively on the companies and serve as great education for their readers. Also, these make great content for their future marketing efforts.So try to pitch the creation of a case study if your guest posting pitch is rejected.We’ve also achieved success with guest appearances on podcasts. This way, you can provide value to their audience, and your site will often receive a link from the podcast notes.Further readingHow to Use Podcasts for Link BuildingValuable link building realizationsHere are a few tips I’ve learned from my link building experiences so far:Tip 1. Link building gets easier when your website is trustworthy and professionalJournalists and webmasters typically quality-check sources before linking to them. So if your site looks to be of low quality and is filled with display ads and pop-ups, there’s likely a good chance that they will just link to another website instead.For this reason, I highly recommend looking at your site objectively and asking yourself these questions:Does my site have a beautiful, intuitive web design that follows industry best practices for user experience?Does my site have too many intrusive elements like display ads and pop-ups?Do we have a page that shows our editorial guidelines and content integrity?Are our articles the most helpful resources out there for readers?Do we showcase our company’s industry expertise (E-E-A-T)?Here’s an example of one way we demonstrate our industry expertise on Pet Keen’s “About Us” page—by showing our veterinary review board:Tip 2. Having a great service or product can help you attract a lot of linksPeople love writing about the things that they like. So if your company has a service or product people rave about, it’s likely to attract links. This often happens in the form of top 10 lists, reviews, and recommendations.An example of this is our other site, hepper.com, which sells modern cat furniture products. These products are loved by pet families and received coverage from big media sites such as NYTimes, Latimes, and BuzzFeed.TipDon’t expect a lot of media coverage if you’re just selling a generic product that doesn’t excite people. Instead, ask yourself: What product or service can I create that people will rave about?Tip 3. Your site may attract more passive links as its traffic increasesThere’s a theory that as your site’s traffic increases, the chances of someone discovering and linking to it will also increase.This is what Ahrefs CMO Tim Soulo calls the “vicious cycle of SEO”:Unfortunately, there’s not much you can do about this other than to focus on building a brand that people love and that ranks in organic search.Tip 4. It’s better to focus on a handful of link building tactics than to try to do them allLet’s face it: There are probably hundreds of link building methods to choose from. Now imagine trying to master all of them. You’d get overwhelmed quickly and look like this:I’ve come to realize that it’s best to laser-focus on three to five “golden” link building methods than try to do them all. This is because if you try to use 100 link building methods at the same time, you’ll probably achieve mediocre results. But if you specialize in a small number of “golden” methods, you’ll likely become a master and get much better results.However, it’s impossible to say what link building methods work best for you. Some methods work well in certain industries, while others don’t.To find your “golden” link building methods, I recommend trying as many proven-to-work methods as possible and then evaluating what worked best for you.Final thoughtsGrowing your traffic and attracting links in a competitive industry takes a lot of time, elbow grease, and persistence.It can seem intimidating at first. But the process often gets easier after you get your first couple of wins and have found the link building methods that work best for your site.Once you’ve achieved that early momentum, it’s all about continuing to put in the work, scaling up your operations by hiring team members, and documenting processes.Remember: It’s meant to be hard. If it was easy, everyone would be successful with it! Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Keep Learning The Only 9 Link-Building Tools You Need in 2024 You don't need dozens of link building tools. You just need 8 of them. Here are the 8 we recommend. Black Hat Link Building Services PART 2: Do They Work? We tested one of the web's most popular black hat link building services to see if it actually works. Here are the results. 9 Easy Local Link Building Tactics If you want to rank your local business higher in Google, you need backlinks. Learn 9 ways to build local backlinks here. How to Use Podcasts for Link Building Podcast link building is where you pitch yourself as a guest on industry podcasts and receive a link from an episode page. Broken Link Building: The Complete Guide Learn what broken link building is, whether it still works, and how to get backlinks with it.",
  "headers": [
    {
      "level": "H1",
      "text": "3 Link Building Methods That Helped Pet Keen Grow to 3M Organic Traffic"
    },
    {
      "level": "H2",
      "text": "Method 1. HARO (Help a Reporter Out)"
    },
    {
      "level": "H3",
      "text": "Tip 1. Hire industry experts to answer"
    },
    {
      "level": "H3",
      "text": "Tip 2. Publish author pages for your experts"
    },
    {
      "level": "H3",
      "text": "Tip 3. Use HARO alternatives too"
    },
    {
      "level": "H2",
      "text": "Method 2. Industry statistics posts"
    },
    {
      "level": "H2",
      "text": "Method 3. Guest blogging and case studies"
    },
    {
      "level": "H3",
      "text": "Tip 1. Pitch websites you already have relationships with"
    },
    {
      "level": "H3",
      "text": "Tip 2. Pitch medium to high DR sites"
    },
    {
      "level": "H3",
      "text": "Tip 3. Consider pitching a case study or podcast episode instead of a guest post"
    },
    {
      "level": "H2",
      "text": "Valuable link building realizations"
    },
    {
      "level": "H3",
      "text": "Tip 1. Link building gets easier when your website is trustworthy and professional"
    },
    {
      "level": "H3",
      "text": "Tip 2. Having a great service or product can help you attract a lot of links"
    },
    {
      "level": "H3",
      "text": "Tip 3. Your site may attract more passive links as its traffic increases"
    },
    {
      "level": "H3",
      "text": "Tip 4. It’s better to focus on a handful of link building tactics than to try to do them all"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Simon Treulle"
}