{
  "url": "https://ahrefs.com/blog/link-bait/",
  "slug": "link-bait",
  "title": "What Is Link Bait? 7 Successful Examples",
  "description": "Link bait is content designed to attract backlinks. It’s something so valuable and interesting that bloggers and journalists want to link to it.",
  "content": "Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Not every page on your website will earn you backlinks.That is one of the many reasons why link building is hard. Pages need links to rank. Yet not all pages will earn them.But there is a certain type of page you can create that will naturally earn links better than others. In the SEO world, we call them “link bait.”Knowing why and how link bait works will help you create more “link magnets” so you can get more links to your website.But first, let’s start with the basics:What is link bait?What is the purpose of link bait?Why does link bait work?Best practices for creating link baitLink bait examplesHow to find good link bait ideasWhat is link bait?Link bait is content designed to attract backlinks. It’s something so valuable and interesting that bloggers and journalists want to link to it.What is the purpose of link bait?Link bait helps you rank higher on Google and get more organic traffic to your website.There are two reasons why this is so.First, because links are one of Google’s top three ranking factors, pages with more links tend to rank higher and get more traffic. Our study of over 1 billion pages confirms this.If you create a piece of link bait about a topic people are searching for, the links it attracts should result in more traffic to the page itself.Second, you can distribute some of the “authority” your link bait attracts to other pages on your website using internal links. This can help boost the pages’ rankings in organic search.Why does link bait work?Link bait works because it takes advantage of psychological principles that make people want to link to it. These principles are called “share triggers” and were coined by marketing professor Jonah Berger in his book “Contagious.”They are:Social currency – People share things that make them look good to others.Triggers – People share things that are top of mind.Emotion – People need to feel something to share something.Public – People tend to imitate others’ behavior if they can see or observe it.Practical value – People like to pass along practical, useful information.Stories – People don’t just share information—they share stories too.Best practices for creating link baitHere are some best practices for creating link bait that “takes advantage” of share triggers.Try to incorporate at least one or two into your link bait so it stands the highest chance of success.1. Make your link bait practicalMaking your content practical means creating something that the reader can use right away. Examples include tools, calculators, templates, checklists, and cheat sheets. For example, at Ahrefs, we created a whole bunch of free tools.Each of them has a significant number of backlinks:2. Make your link bait opinionatedAnother way to make your link bait valuable is to give the reader something new to think about. This can be done by tackling a topic from a unique angle and adding something unique to the conversation. Here’s an example: A few years ago, our chief marketing officer, Tim Soulo, published a “rant” about bad email outreach.It was incredibly opinionated and born entirely out of his own experience. But people loved it.This resulted in over 2,500 backlinks from 533 websites:3. Make sure your link bait evokes emotionIf you’re as old as me, you may remember the glorious days of Upworthy. During its peak, it was as if every single one of the site’s articles went viral. (Although I’ve not seen anyone share Upworthy’s content in recent years.)Upworthy is a website dedicated to positive stories. People kept sharing its articles because each one was engineered to make people feel awe, surprise, happiness, and a general sentiment that the world was not as bad as it seemed to be.Of course, the content worked incredibly well as link bait too:Positivity is just one aspect. There are tons of emotions you can try appealing to, such as anger, excitement, sadness, joy, etc. See if you can incorporate them in your link bait too.4. Make your link bait visualFor someone to link to a piece of content, a four-step process has to occur:See – The potential “linker” stumbles upon your link bait for the first time.Consume – They click and consume it.Enjoy – The content makes a lasting impression on their mind.Link – They take the “bait” and link to it.If your link bait isn’t visually appealing, this process gets cut off between “Consume” and “Enjoy.” This is because visuals help people to consume content quicker and easier, thereby increasing the likelihood that someone will enjoy the said content and, thus, link to it.For example, check out this post on the most popular beer in every country. Instead of a simple listicle, the information is actually conveyed in a map:With over 533 backlinks from 179 websites, it did pretty well.5. Make your link bait newsworthyIf there is one thing that is top of mind for most people, it’s the news. And journalists and bloggers are constantly on the lookout for stories to cover.For example, the biggest news story of the past two years is logically the pandemic and the resulting changes it created. In 2020, Nulab ran a series of surveys regarding remote work and published them in a post.Not only did the post earn 103 backlinks from 80 unique websites…… but it also received links from major publications like Huffington Post, Yahoo, ZDNet, Refinery29, and more:So if you want big news publications to link to you, your content will need to incorporate some newsworthy elements. Here’s a great list to look through and apply to your own content.Another strategy to make your content newsworthy is to do newsjacking. Newsjacking is about monitoring live news and spotting opportunities to put your brand in the center of conversations by reacting with expert commentary and thought leadership pieces.We interviewed Will Hobson, the PR director at Rise at Seven, to share tips on how to successfully execute newsjacking. You can read his tips in the post below.Recommended reading: 9 Great Public Relations Tactics With Campaign Examples 6. Make your link bait a storyBestselling author Yuval Noah Harari wrote:Humans think in stories rather than in facts, numbers, or equations, and the simpler the story, the better.Humans are storytelling animals. It’s how we function as a society. So it’s surprising to no one that we share and link to stories.For example, rather than bash people over the head with logic and reasoning about why debt is bad, Wealth Simple decided to go with a story angle.It earned a respectable 85 backlinks from 62 referring domains:Plenty of which came from large websites like Huffington Post, BuzzFeed, Slate, and more:Telling a good story is difficult. But if you can do so with your link bait, it may be worth a shot.7. Include what other people are already linking toIf people are linking because of certain reasons in competing pages, it is logical to assume that the particular reason is important to that topic.So before you create your link bait, you should look for common link reasons in a similar page’s backlink profile.Here’s how:Go to Ahrefs’ Keywords ExplorerSearch for a topic you’re writing aboutLook at the SERP overviewFind a similar article with lots of referring domainsClick on the number in the Backlinks columnSkim the Anchor and target URL column for commonalitiesFor example, if we do this for Greatist’s post on the perfect kettlebell swing, we see quite a few people linking because the post mentioned the benefits:If you’re writing about the same topic, mentioning benefits may give your link bait a chance to get more links.Seven successful link bait examplesHere are seven of our favorite pieces of link bait, each of which attracted tons of links, shares, and attention.We also reached out to their creator(s) and asked, “What do you think made your particular piece so successful/popular?”Their thoughts are included below.1. 13 Reasons Your Brain Craves InfographicsThis piece earned 75,300 backlinks from 1,500 referring domains.Here’s what Danny Ashton, founder of NeoMam Studios, had to say:I believe timing played a big part here; we published it when infographics were a hot topic in 2013. I think the interactive format also helped—a lot of people hadn’t seen anything like it back then.I also made sure we only used scientific studies to support each point, as most other stuff out there was a mix of pseudo-science and opinion.And the fact that we promoted the hell out of it helped too!Danny Ashton, Founder NeoMam Studios2. Inception ExplainedThis piece earned 714 backlinks from 324 referring domains.Here’s what the creator, Matt Dempsey, had to say:I think it was successful because it paired a subject matter people were interested in with a new medium people were delighted by.The site tapped into a film millions of people knew and loved but most didn’t completely understand—you just had to check the Google search trends for ‘Inception explained,’ etc., beforehand to see the demand for a succinct explanation.I also used parallax scrolling, which was a very new technique at the time. I think this was the most complicated and intricate implementation of it, so it resonated well with the tech/design community.Matt Dempsey, Creator Inception Explained3. How a Car Engine WorksThis piece earned 2,100 backlinks from 400 referring domains.Here’s what Jacob O’Neal, the CEO of Animagraffs, had to say:Personally, I think there are four main reasons the content performed well:It’s ‘evergreen’: It will stay relevant for a very, very long time.It’s a fresh new format: It’s a media format no one’s really done before that delivers learning super fast. It’s a combination of moving images and text, but not a video. Videos require audio and some wait time for things to be explained, speakers/headphones, etc. The learning process can be encumbered or a bit inefficient. With Animagraffs, text is right there if you want to read/learn what the text is pointing to, right this instant.It’s well organized: The big, bold, moving illustrations catch your attention first, then supporting illustrations, and then the fine print of a particular point that really interests you. It appeals to all age groups and all levels of interest and intelligence.We didn’t fake it: We didn’t hold back on the ‘smart, boring’ stuff. We design for the toughest crowd first. For example, if we’ve impressed seasoned auto mechanics, we’ve done the job right. No sacrificing quality for cheap views. This is in pretty stark contrast to a lot of marketing that focuses outward first and then inward. No one recommends trying to get friends by pretending to like what others like… why is marketing done this way? It’s better to lead with real, quality work, no matter how tempting it may be to invert the process for a quick buck.Jacob O’Neal, CEO Animagraffs4. 90.63% of Content Gets No Traffic From Google. And How to Be in the Other 9.37%This piece earned 6,600 backlinks from 2,600 referring domains.Here’s what our CMO, Tim, had to say:First of all, I didn’t know that it would perform better than any other study I did. Otherwise, I would only publish the studies that do well and never publish anything that flopped.As for why this particular one performed so well, in my opinion, it’s because it provided people from the SEO industry with a striking stat that helped them pitch the importance of SEO.90% of content gets no traffic from Google—that’s a killer argument to audit your own content and decide if you were investing enough in SEO for the past few years.Bottom line: People love data-backed claims. So if you can do some form of industry research, there’s a good chance people from your industry will reference your work.Tim Soulo, CMO Ahrefs5. Why Do I Procrastinate?This piece earned 201 backlinks from 52 referring domains.Here’s what the creator, Manasvini Krishna, had to say:These are some of the reasons, in my opinion:Popular subject – I think the subject (procrastination) was a common problem that many of us (and definitely our target audience!) struggle with. Knowing we should be doing something but somehow not wanting to do it, or able to do it, is a familiar feeling to most! Most of us can relate.Interactiveness and engaging – I think the fact that it was an interactive quiz designed to specifically identify and isolate your problem at that moment helped. In general, quizzes are great because everybody loves to learn a little bit about themselves. And they’re fun to take!Different take than usual – The quiz gives immediately actionable and non-judgemental suggestions on how to solve your specific problem that you diagnose with the quiz. Many of us are used to viewing procrastination with a lot of guilt and negative feelings associated with it, so a solution based on the ‘procrastination equation,’ which basically just looks at procrastination as an equation, the various parts of which can be increased or decreased to fix the procrastination problem, is refreshing and not very common. (The quiz is based on a book called ‘The Procrastination Equation.’)Manasvini Krishna, Founder Boss as a Service6. Investment CalculatorThis piece earned 1,100 backlinks from 306 referring domains.Here’s what the creator, Caleb Barclay, had to say:Here are some initial thoughts:Design as differentiator: Free-to-use tool (no email exploitation), 10X improvement from competitor sites, designer websites linked to us.Launch with controversial subject: We found a highly opinionated group that kick-started exposure (Hackernews).Usefulness made it highly shareable: We needed this tool personally and spent a lot of time designing its utility (scratch your own itch).Personalization: Users participating in generating personalized content make it more sticky.Caleb Barclay, Founder Dwellito7. The 35 Best Countries to Raise a Family in 2020This piece earned 529 backlinks from 273 referring domains.Here’s what the creator, Asher Fergusson, had to say:I think what made my research on the best countries to raise a family in 2020 so popular is that it was original research on a topic that is close to home for a lot of people. And then on top of that, with the USA not ranking so highly, it was very controversial for most Americans. This helped it get on the front page of Reddit and then it went viral in the press, which brought the study countless awesome links and 35,000 hits per day for a while. My biggest error is not updating the study for 2021, but I plan to do an update for 2022, and I imagine it will go viral again and attract a bunch more links.Asher Fergusson, Founder Asher & LyricHow to find good link bait ideasThe simplest method for finding great link bait ideas is to piggyback off what’s working for your competitors.Here’s how:Enter your competitor’s domain into Ahrefs’ Site ExplorerGo to the Best by links reportEyeball the list to see what kind of formats and topics resonate with people in your niche. For example, if we did this for the Hong Kiat blog, we’ll see that listicles are popular in the design niche.Whereas, if we analyzed our own blog, we’ll see that data studies are the most popular in the SEO space:Final thoughtsLink bait is more than just creating something unique or visually appealing.For it to attract links, you’ll need a combination of well-crafted content, a well-defined audience that has the ability to link to you, and a well-executed promotional plan.It doesn’t matter if you create the greatest piece of content in the world—you won’t get any links if people don’t know it exists.Any questions or comments? Let me know on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Keep Learning The Only 9 Link-Building Tools You Need in 2024 You don't need dozens of link building tools. You just need 8 of them. Here are the 8 we recommend. 4 Tactics for High-Quality Backlinks That Move the Needle [+ Examples] Many backlink techniques are outdated and don’t move the needle. Discover new ways to earn high-quality links, along with six successful examples you can emulate. Black Hat Link Building Services PART 2: Do They Work? We tested one of the web's most popular black hat link building services to see if it actually works. Here are the results. How to Find and Fix Broken Links (to Reclaim Valuable “Link Juice”) Do you have broken links on your site? Then you might be wasting valuable \"link juice\" and giving your visitors a bad experience. Here's how to find and fix all broken links from (and to) your website. Broken Link Building: The Complete Guide Learn what broken link building is, whether it still works, and how to get backlinks with it.",
  "headers": [
    {
      "level": "H1",
      "text": "What Is Link Bait? 7 Successful Examples"
    },
    {
      "level": "H2",
      "text": "What is link bait?"
    },
    {
      "level": "H2",
      "text": "What is the purpose of link bait?"
    },
    {
      "level": "H2",
      "text": "Why does link bait work?"
    },
    {
      "level": "H2",
      "text": "Best practices for creating link bait"
    },
    {
      "level": "H3",
      "text": "1. Make your link bait practical"
    },
    {
      "level": "H3",
      "text": "2. Make your link bait opinionated"
    },
    {
      "level": "H3",
      "text": "3. Make sure your link bait evokes emotion"
    },
    {
      "level": "H3",
      "text": "4. Make your link bait visual"
    },
    {
      "level": "H3",
      "text": "5. Make your link bait newsworthy"
    },
    {
      "level": "H3",
      "text": "6. Make your link bait a story"
    },
    {
      "level": "H3",
      "text": "7. Include what other people are already linking to"
    },
    {
      "level": "H2",
      "text": "Seven successful link bait examples"
    },
    {
      "level": "H3",
      "text": "1. 13 Reasons Your Brain Craves Infographics"
    },
    {
      "level": "H3",
      "text": "2. Inception Explained"
    },
    {
      "level": "H3",
      "text": "3. How a Car Engine Works"
    },
    {
      "level": "H3",
      "text": "4. 90.63% of Content Gets No Traffic From Google. And How to Be in the Other 9.37%"
    },
    {
      "level": "H3",
      "text": "5. Why Do I Procrastinate?"
    },
    {
      "level": "H3",
      "text": "6. Investment Calculator"
    },
    {
      "level": "H3",
      "text": "7. The 35 Best Countries to Raise a Family in 2020"
    },
    {
      "level": "H2",
      "text": "How to find good link bait ideas"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Si Quan Ong"
}