{
  "url": "https://ahrefs.com/blog/links-with-traffic-study/",
  "slug": "links-with-traffic-study",
  "title": "Do Links From Pages With Traffic Help You Rank Higher? [Ahrefs Study]",
  "description": "Links are important for SEO. But what makes a good link? Should you aim to get links from pages with traffic, or does that not matter so much?",
  "content": "Tim Soulo Tim Soulo is CMO at Ahrefs. With over 15 years in the digital marketing industry, Tim is the author of many data-driven studies and actionable marketing frameworks, some of which gained industry-wide recognition. He enjoys challenging conventional marketing knowledge and optimizing for simplicity and efficiency. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Ever since members of the the SEO community got their hands on Google’s Reasonable Surfer patent, there’s been no shortage of arguments about the value of links from pages with traffic. Some believe they’re worth more than those from pages without traffic, and others don’t.This debate is so prevalent that whenever I find myself in a group of like-minded people discussing the value of different kinds of links, I will inevitably get asked:Tim, you guys have the best link data at Ahrefs, why don’t you crunch some numbers and give us a definitive answer to this question based on hard cold data?And I started to hear that question even more after we released search traffic data for referring pages last year.Use the Backlinks report in Site Explorer to see the estimated organic traffic for each referring page.Long story short, I recently managed to carve out some time for our data science team to study this.But before I share the results, I want to be transparent about our data and its limitations.Is our data flawed?Let me first reiterate the fact that correlation does not prove causation.That’s something to keep in mind when looking at any “Google ranking factor” study as they all analyze how a particular ranking factor correlates to Google ranking position.It’s also important to note that:We only know the organic search traffic of referring pages. This study doesn’t take into account any traffic sources except for organic. That means no direct, referral, social, or paid traffic.Our search traffic numbers are estimations. Sometimes these are unbelievably accurate. Other times we can easily be off by 3-7x (read this post to learn more about how we calculate search traffic at Ahrefs).We don’t predict link clicks. As Bill Slawski states, the idea behind Google’s “reasonable surfer” model is to rank web pages “based upon a probability that a person following links at random on the web might end up upon a particular page.” However, the patent relates mostly to the position of a link on a given page. Nowhere does the patent mention traffic.Which begs the question: If the study is flawed from the start, why even bother?I see at least three reasons:Because quite a few people in the SEO community want us to do it;Because someone might later build upon this study (we’ll be glad to help you);Because we can.I’m also interested to see if our somewhat “flawed data” can still help uncover any interesting anomalies.Now with that aside, let’s see what the numbers say.Study 1: Backlinks from pages with organic traffic vs. rankingsWe took 44,589 (non-branded) keywords with monthly search volumes between 2,000 and 5,000, pulled the top 10 ranking pages for each, and studied how well the following metrics correlate (Spearman) with each page’s ranking position:Honestly, I expected the number of links from pages with traffic to have a stronger correlation than the total number of links. But that didn’t happen.Sidenote. SERPs where no pages had at least one backlink with traffic were excluded from our sample when calculating the correlation for the number of backlinks from referring pages. Here are a couple of interesting observations though:Firstly, the correlation for the number of “dofollow” backlinks is a little bit weaker than that of the total number of backlinks. This could be an indication that Google values some nofollowed links from strong pages more than followed links from weak pages. #whoknowsOr the result could merely be because we didn’t study the factor in isolation.Secondly, the sum of organic traffic to referring pages has a higher correlation than the number of referring pages with traffic. This suggests that our threshold of 100+ visits is arbitrary and that links from “powerful” referring pages (in terms of how much search traffic they get) have more weight than links from pages with “a bit” of search traffic.Interestingly, URL Rating (UR) is the strongest correlating factor of all, which indicates that the way Ahrefs calculates the “link popularity” of a page correlates nicely with the ability of that page to rank high in Google.Study 2: Backlinks from domains with organic traffic vs. rankingsAfter studying the correlation of referring pages with search traffic, we decided to do the same for referring domains with traffic.Here’s what we got:Perhaps the most striking observation here is that the number of referring domains with traffic didn’t correlate higher than the total number of referring domains. That’s quite surprising.It’s the same story when it comes to the sum of traffic to referring domains vs. the total number of referring domains. There’s virtually no difference in the correlations, so it seems that the amount of organic traffic to a referring domain has little impact on the value of a link.If you think about it, that makes total sense.I mean, which of these two links would you rather have? -A link from a page with tons of backlinks on a domain with little organic trafficA link from a page buried deep on a massive website with tons of organic trafficHopefully, you said #1.All that said, it’s important not to forget about our data limitations and caveats:Correlation ≠ causation;The threshold of 1,000 visits/month for the number of referring domains with traffic is an arbitrary one.In other words, take the observations above with a large pinch of metaphorical salt.Speaking of pinches of salt, you might be wondering:How common are “links with traffic” across the studied SERPs?The above correlations are based on a study of 44,589 SERPs.But how many of those SERPs had results with links from referring pages with traffic?It looks like “links with traffic” aren’t too common among the top-ranking pages.There were only 20 SERPs where all the top ranking pages had at least one link with traffic. That’s one in every 2,229.Furthermore, for roughly 1/5th of SERPs, none of the top-ranking pages had links with traffic.That’s interesting because it means it’s possible to rank on the first page of Google without links from pages with traffic even if other pages in the SERP have such links.Final thoughtsI think that the results of our data studies turn out to be quite interesting.But at the same time, the takeaways I’ve suggested along the way are unfortunately far from definitive. Although the research itself is reliable and the numbers are accurate, they’re merely correlations and thus, cannot confirm causation. (I know I’m repeating this a lot, but it’s a crucial point).As Albert Einstein famously said: No amount of experimentation can ever prove me right; a single experiment can prove me wrong. Albert Einstein, Super smart guy from the pastSo what can we learn from this study?The only thing we can say with absolute certainty is that no single factor is a panacea—neither the raw number of pages or domains that link to you nor the search traffic of those pages and domains.A variety of factors determine the value of a link.It’s somewhat difficult to say whether one factor is more valuable than others.However, if you want to prioritize your link building efforts, it’s worth prioritizing links from:Pages with a high URL Rating (UR)Pages on websites with lots of referring domainsThose are the two attributes that correlate most strongly with organic search traffic according to our study. You can check both of these for any web page or website in Ahrefs Site Explorer:UR metric in Ahrefs Site ExplorerDomain-level metrics in Ahrefs Site ExplorerI’d love to know what you guys think about these results.If you’re an SEO data nerd and would love to collaborate with us on a similar research study, feel free to reach out and we’ll figure something out. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Tim Soulo Tim Soulo is CMO at Ahrefs. With over 15 years in the digital marketing industry, Tim is the author of many data-driven studies and actionable marketing frameworks, some of which gained industry-wide recognition. He enjoys challenging conventional marketing knowledge and optimizing for simplicity and efficiency. Keep Learning How long does it take to rank in Google? (A study by Ahrefs) Our research will answer the most popular question in SEO world: \"How long does it take to rank in Google?\" Another number-driven study from Ahrefs. How many keywords can you rank for with one page? (Ahrefs’ study of 3M searches) But how many keywords exactly will an average page rank for? That’s the question we wanted to answer (plus a few more), so we picked 3 million random Core Web Vitals Data Study w/ CrUX & 5.2M Pages - Ahrefs We looked at all the domain-level CrUX data and 5.2M pages to do a big study on Core Web Vitals. Check out what we found. Reciprocal Links: Will They Hurt Your SEO? (A Study by Ahrefs) Reciprocal links occur when two websites exchange backlinks to each other, usually for SEO purposes. But will reciprocal links hurt your SEO? Do Links Still Matter for Rankings? A Study by Ahrefs We disavowed backlinks to three pages for a month to see if rankings dropped, then we removed the disavow to see if rankings improved.",
  "headers": [
    {
      "level": "H1",
      "text": "Do Links From Pages With Traffic Help You Rank Higher? [Ahrefs Study]"
    },
    {
      "level": "H2",
      "text": "Is our data flawed?"
    },
    {
      "level": "H2",
      "text": "Study 1: Backlinks from pages with organic traffic vs. rankings"
    },
    {
      "level": "H2",
      "text": "Study 2: Backlinks from domains with organic traffic vs. rankings"
    },
    {
      "level": "H2",
      "text": "How common are “links with traffic” across the studied SERPs?"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Tim Soulo"
}