{
  "url": "https://ahrefs.com/blog/local-seo/",
  "slug": "local-seo",
  "title": "Local SEO: The Complete Guide",
  "description": "Local SEO is improving your online presence to get more business from local searches—and it focuses on optimizing for Google users.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents What is local SEO?Local SEO is a strategy that helps Google understand where your business is, what you offer, and how trustworthy you are. This improves your ranking in local search results, benefiting any business with a physical location or that serves a local area.For example, this pizzeria ranks #1 in the local pack and “blue link” organic results:This is because it’s close to me, has exactly what I need, and has a great reputation (4.7/5 from 994 reviews).Why is local SEO important?Local SEO is important because many people use search engines to find local businesses.In fact, according to Google:30% of all mobile searches are related to location.78% of people who search for something nearby on their phones visit the business within a day.28% of searches for something nearby result in a purchase.In short, customers are searching for your business. If you’re not there, you’re leaving money on the table.How does local SEO work?Local SEO is a game of two halves because Google shows two types of search results for local searches. These are local pack results and organic “blue link” results. You can rank on both of them.Map pack resultsThe map pack (aka local pack) is a Google SERP feature that shows the top local business listings and a map. It often appears at the very top of Google’s search results for local searches.Organic search resultsThe “regular” organic search results are the “ten blue links” that we’re all familiar with. They usually appear below the map pack results.What is a good local SEO strategy?Lay a strong foundation with initial optimizations, then put systems in place to automate as much as you can going forward.For example, reviews are important but getting more of them doesn’t have to be a chore. You can do simple things to encourage customers to leave them, such as placing cards like these on tables if you run a restaurant:This is what I like to call passive local SEO. As long as you’re delighting your customers, your online reputation will grow on autopilot and rankings should improve.Keep this idea in mind as you go through the rest of this guide.How to do local SEODoing local SEO involves optimizing for the local pack and the regular “blue link” organic results. To do this, you optimize for local ranking factors.Some of these are important for both the local pack and regular results, whereas others are more important for just one of them.Let’s go through the process of local SEO from start to finish.1. Get a Google Business Profile (formerly Google My Business) and optimize itA Google Business Profile is a local listing with information about your business. It’s free and allows your business to appear in the map pack and Google Maps.36% of SEOs think your Google Business Profile is the most important ranking factor for the map pack. And 6% believe that it’s important for the “regular” organic results. That’s according to BrightLocal’s survey.This isn’t surprising, as you need a Google Business Profile to stand any chance of ranking on the map pack.Business Profile signals are increasing in their perceived importance for the map pack over time too.Beyond rankings, Google states that customers are 70% more likely to visit businesses with a complete Business Profile. They’re also 50% more likely to consider buying from them. So it’s clear that a complete and optimized Business Profile is essential if you want to attract more business.Here are a few best practices from Google:Be specific when setting your business categorySet your business hours (including holiday hours)Add your address (if you have a storefront)Set your service area (if you visit or deliver to customers and clients)Add the products or services you offerAdd photosAsk customers for reviewsFurther readingHow to Optimize Your Google My Business Listing in 30 Minutes2. Get more reviewsReviews refer to the quantity and quality of reviews on your Google Business Profile and elsewhere online.BrightLocal’s 2021 study shows that 17% of SEOs deem reviews the most important ranking factor for map pack rankings. But only 5% see them as most important for regular organic rankings.Reviews have also grown in their perceived importance for map pack rankings over the past few years.But reviews aren’t only about rankings. Getting reviews on your Google Business Profile and elsewhere builds trust with Google and customers.Here are a few best practices for getting more reviews from Google:Remind customers to leave reviews (you can create and share a review link in Google Business Manager)Focus on getting reviews on your Google Business ProfileRespond to reviews to build trust (you’ll need a verified Google Business Profile to do this)Don’t offer or accept money in exchange for reviews (it’s against Google’s terms)Don’t discourage bad reviews or request good reviews from customers (it’s against Google’s terms)3. Get listed in directories (for more NAP citations)A NAP citation mentions your business’s name, address, and phone number online. They usually appear on business directories and social media profiles.There are also NAPW citations that mention your website.BrightLocal’s 2021 study shows that 7% of SEOs think citations are the most important ranking factor. That’s true for both the map pack and regular results.In other words, they’re somewhat important—but not as important as they used to be.The perceived importance of citations among SEOs has been declining since 2014.That said, citations can still help searchers discover your business online. This is because directories often rank on the search results for local queries. So if you’re in those directories, the people who click on them in the search results may find your business.Here are a few best practices:Get listed with big data aggregators (in the U.S., these are Data Axle, Localeze, and Foursquare)Submit to other big players (in the U.S., these include Apple Maps, Yelp, Yellow Pages, Bing Places, and Facebook)Submit to other popular directories in your local area and industryKeep your citations consistent (same name, address, phone number) everywhereFurther readingHow to Build Local Citations (Complete Guide)TIPHere’s a quick way to find industry and local directories:Paste your homepage into Site ExplorerGo to Link Intersect Enter the homepages of a few competing businesses in your areaSet the search mode to “URL” for all targetsClick “Show link opportunities”This will show you sites linking to one or more of your competitors, but not you.If a website links to many competitors, it’s probably a directory where you can also add a listing.4. Do local keyword researchLocal keyword research is the process of understanding how people search for the local services you offer.It’s important because you want to optimize for what people search for.Let’s go through how to do this.a. Find service-based keywordsMost people don’t think about the different ways that others may search for what they do.For example, if you’re a plumber, some customers will find you by typing “plumber” into Google. But others will search for queries relating to specific services like “drain unblocking.”For that reason, you should begin by brainstorming and listing the services you offer. This will help you maximize your presence for queries your customers are searching for.Here’s what that can look like for a plumber:Drain unblockingBoiler repairBoiler installationBoiler servicingRadiator installationBurst pipe repairTo expand this list, use the service keywords as “seeds” to find more services people are searching for.For example, if we plug the services above into Ahrefs’ Keywords Explorer and check the Matching terms report, we see keywords like:gas boiler installationcombi boiler installationelectric boiler installationIf you offer those services, you may also want to consider targeting these keywords.Here’s another way to find “missed” keywords:Plug a competing business into Ahrefs’ Site Explorer, go to the Top pages report, and look for URLs that map to services.b. Check search volumes​​Keyword research tools show you national search volumes. If you want search volumes for your state, city, or town, you’ll have to use Google Keyword Planner.Unfortunately, Keyword Planner has its issues:It shows broad search volume ranges (e.g., 1K-10K), not absolute numbers.It groups keywords and shows a combined rounded search volume.For that reason, checking the relative popularity of keywords at the national level tends to be more productive. This is because what happens in one city is likely to be similar in the next.You can do this with a keyword research tool like Ahrefs’ Keywords Explorer.For example, the tool tells us that more people search for “boiler repair” than “boiler installation” in the U.K.:This is probably the case whichever city we’re in, so it’s an excellent way to prioritize keywords.c. Check for local intentLocal intent means that searchers want to shop nearby. If that isn’t the case for your services, it’s not a local SEO opportunity.To check a query for local intent, Google it and check the results.If there’s a map pack and/or some local “blue link” results, it has local intent.If there are no map pack and local “blue link” results, it doesn’t have local intent.You can still target keywords without local intent, but it’s not a job for local SEO.d. Assign keywords to pagesYour homepage is unlikely to rank for all your service keywords. So you’ll need to target some with separate pages.To assign keywords to URLs, think about which services they map to.If they map to very different services, such as “boiler installation” and “burst pipe repair,” assign them to separate pages.If they map to the same service, such as “drain unblocking” and “drain unclogging,” assign them to the same page.You can learn more about this process in our local keyword research guide below.Further readingHow to Do Local Keyword Research5. Get more backlinksLinks act like votes for your site from other websites.BrightLocal’s study shows that 31% of SEOs deem links the most important signal for ranking on regular organic search. 13% think the same for map pack rankings.For many, this won’t come as much of a surprise. In 2016, Google said that backlinks are one of their top three ranking factors. Plus, many studies have found a strong correlation between links and organic traffic.Links are increasing in their perceived importance for “regular” local rankings over time too. But their perceived importance for “map pack” rankings has stayed roughly the same.Here are a few best practices:Get links from other top-ranking sitesGet links your competitors have (use Ahrefs’ Link Intersect tool for this)Get local citations (these often have links)Claim unlinked mentionsReclaim lost links by redirecting old versions of your pages to new versionsFurther reading9 Easy Local Link Building Tactics6. Improve your on-page SEOOn-page SEO is where you make changes to the content of a page to help it rank higher on organic search results.BrightLocal’s study shows that 34% of SEOs think on-page signals are the most important factor for regular organic search. And 16% believe it’s the most important factor for map pack rankings.On-page signals are also growing in their perceived importance for local SEO. You can see this from the results of BrightLocal’s previous surveys.Here are a few best practices:Tailor your pages for search intentInclude your NAP information on your websiteWrite compelling meta titles and descriptionsUse descriptive, SEO-friendly URLsOptimize your imagesInternally link to and from pages where relevantInclude details that matter to searchersTIPOne way to find details that matter to searchers is to check what top-ranking pages in your area talk about. You can do this by looking at the pages. Or you can use Keywords Explorer to find keywords mentioned on the top-ranking pages.Here’s how to do that:Enter [service keyword] [location] (e.g., “boiler repair london”)Go to the Related terms reportHit the toggles for “Also talk about” and “Top 10”Here are some of the frequently mentioned keywords on the top-ranking pages for “boiler repair london” and what they likely infer:“gas safe” – Searchers probably want an engineer who’s on the Gas Safe Register, the official gas safety body in the U.K.“greater london” – Searchers probably want to know whether the business supplies this service in their area.“gas boiler” – Searchers probably want to know whether the business can repair their type of boiler.“emergency call” – Searchers probably want to know whether the business does emergency callouts.It would be worth mentioning these things on your page.Further readingOn-Page SEO: Complete Beginner’s GuideLocal SEO toolsLet’s bring things to a close with a few local SEO tools you may find useful.Google Business ManagerGoogle Business Manager, formerly Google My Business, is how you manage your Google Business Profile. Signing up for it is completely free and is something every local business owner should use.Google Search ConsoleGoogle Search Console is a free tool for monitoring your website’s search performance. It tells you how much search traffic you’re getting, where it’s going, and what keywords it’s coming from.Ahrefs’ Rank TrackerRank Tracker lets you track up to 10,000 keyword rankings for “regular” organic search by country, state, city, and even ZIP/postal code.Ahrefs Link IntersectOur Link Intersect tool lets you find websites that link to multiple competitors. This is useful for finding relevant local and industry-specific citations.Grid My BusinessGrid My Business shows map pack ranking positions for a keyword in the area around your business. It’s freemium and is useful for understanding if and where local searchers are likely to see your business.YextYext is a tool for syncing and managing business information across multiple listings. It’s useful for keeping citations consistent, although you can do this manually.Google Keyword PlannerGoogle Keyword Planner is a free keyword research tool from Google. It’s a useful source of search volume ranges at the local level.Learn more about local SEOHopefully, you now have a pretty good understanding of how local SEO works. If you want to dig deeper and continue learning, check out these resources:How to Do Local Keyword ResearchLocal SEO Solutions: 8 Tips to Boost Local RankingsHow to Build Local Citations9 Easy Local Link Building TacticsHow to Optimize Your Google My Business Listing in 30 Minutes Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Keep Learning How to Build Local Citations (Complete Guide) Local citations are a key ranking factor for local SEO. Learn what the different types of citations are and how you can get them. Local SEO Solutions: 8 Tips to Boost Local Rankings Local SEO is the process of increasing your business’s presence in local search to attract more customers or clients. Franchise SEO: Local and National Growth Strategies for Franchises Franchise SEO is basically local SEO multiplied by the franchise's number of locations, right? Wrong! How to Do Local Keyword Research Local keyword research is the process of finding keywords that people search for when looking for local products and services. 9 Easy Local Link Building Tactics If you want to rank your local business higher in Google, you need backlinks. Learn 9 ways to build local backlinks here.",
  "headers": [
    {
      "level": "H1",
      "text": "Local SEO: The Complete Guide"
    },
    {
      "level": "H2",
      "text": "What is local SEO?"
    },
    {
      "level": "H2",
      "text": "Why is local SEO important?"
    },
    {
      "level": "H2",
      "text": "How does local SEO work?"
    },
    {
      "level": "H4",
      "text": "Map pack results"
    },
    {
      "level": "H4",
      "text": "Organic search results"
    },
    {
      "level": "H2",
      "text": "What is a good local SEO strategy?"
    },
    {
      "level": "H2",
      "text": "How to do local SEO"
    },
    {
      "level": "H3",
      "text": "1. Get a Google Business Profile (formerly Google My Business) and optimize it"
    },
    {
      "level": "H3",
      "text": "2. Get more reviews"
    },
    {
      "level": "H3",
      "text": "3. Get listed in directories (for more NAP citations)"
    },
    {
      "level": "H3",
      "text": "4. Do local keyword research"
    },
    {
      "level": "H4",
      "text": "a. Find service-based keywords"
    },
    {
      "level": "H4",
      "text": "b. Check search volumes"
    },
    {
      "level": "H4",
      "text": "c. Check for local intent"
    },
    {
      "level": "H4",
      "text": "d. Assign keywords to pages"
    },
    {
      "level": "H3",
      "text": "5. Get more backlinks"
    },
    {
      "level": "H3",
      "text": "6. Improve your on-page SEO"
    },
    {
      "level": "H2",
      "text": "Local SEO tools"
    },
    {
      "level": "H3",
      "text": "Google Business Manager"
    },
    {
      "level": "H3",
      "text": "Google Search Console"
    },
    {
      "level": "H3",
      "text": "Ahrefs’ Rank Tracker"
    },
    {
      "level": "H3",
      "text": "Ahrefs Link Intersect"
    },
    {
      "level": "H3",
      "text": "Grid My Business"
    },
    {
      "level": "H3",
      "text": "Yext"
    },
    {
      "level": "H3",
      "text": "Google Keyword Planner"
    },
    {
      "level": "H2",
      "text": "Learn more about local SEO"
    }
  ],
  "author": "Joshua Hardwick"
}