{
  "url": "https://ahrefs.com/blog/marketing-skills/",
  "slug": "marketing-skills",
  "title": "7 Useful Marketing Skills (That I Used to Thrive in My Career)",
  "description": "These are the marketing skills that have helped one digital marketer thrive on his journey—six years and counting.",
  "content": "Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents There’s always a debate about what skills marketers should learn.One person says it’s copywriting; another says it’s coding. One person argues it’s branding; another argues it’s strategic thinking. Add performance marketing, data science, and soft skills like management into the mix and you’ll see that the list is endless.Is there a right or wrong answer? I don’t think so. Think about it: Career advice is autobiographical. It depends on the marketing role you’re in and what skills you picked up along the way that helped. After all, we can’t predict the future; we can only look back at our past.And that’s how I’ll approach this post.Rather than tell you what to learn, I’ll share the skills that have helped me on my journey as a digital marketer—six years and counting.CopywritingContent marketingSEOEmail outreachNetworkingWork prioritizationExperimental mindset1. CopywritingSeven years ago, I read a book called The Education of Millionaires. The book emphasized the importance of copywriting, which got me interested. Later on, I read a few books on the topic, practiced by creating my own newsletter, and eventually wrote most of the copy on my site’s blog, landing pages, and emails. And I’ve been doing that ever since, writing copy and content for the companies I work for.Working in digital marketing means it’s almost impossible to avoid writing. Whether you’re creating a blog post, a tweet, ad copy, or scripting a video, you’re writing.So, if you’re unable to capture and hold someone’s attention via your words, your marketing campaigns will always be less effective than they could be. People won’t click your Facebook ad, will abandon your blog posts, and ignore your tweets.That’s why learning how to write well is so important.Want to improve your writing skills? My unconventional advice: Skip the usual books and learn copywriting.Copywriters write with clarity and simplicity. No fluff. They get straight to the point. Strong recommend. — David Perell (@david_perell) March 28, 2019Plus, learning copywriting will equip you with the fundamentals of marketing. To write great copy, you have to know who you’re selling to. You have to do customer research—know what they want, need, and how they talk. All of these will make you a better marketer.How to get startedThe first thing is to forget what you’ve learned in school. Writing online is different from academic writing. If you write like how you did for school, your blog audience will be zero.Next, pick up a few resources that’ll teach you the basics of good copywriting. Here are some I’ve personally used:The Boron Letters (Book)The Adweek Copywriting Handbook (Book)Ogilvy on Advertising (Book)The Halbert Copywriting Method Part III (Book)Copywriting Course (Paid course)You’ll also do well to pick up a few books on psychology and persuasion, as they’re the basis of good copy:Influence (Book)Made to Stick (Book)Contagious (Book)Finally, you need to write. There’s no way around it. To learn how to write, you have to actually write. Create a site, apply for an internship, tweet—the medium you choose doesn’t matter; just start practicing.2. Content marketingBack then, I didn’t have many resources to work with. So, blogging seemed like a good way to get traffic to my website without spending a lot of money. This naturally got me into content marketing.Content marketing is hot today. Look at the meteoric rise in interest over time:According to HubSpot, 70% of marketers are actively investing in content marketing. There are tons of examples of people using content marketing to build successful businesses. Ahrefs is one. But there are others like Luxy Hair, Beardbrand, Shopify, etc.So, why is content marketing popular? A few reasons:It nurtures and converts leads. Most people don’t buy immediately. Instead, they go on a “journey”—they search around, read reviews, consume content and talk to other people. Content marketing helps you match each stage of this journey.It educates potential customers. Customers are better-positioned to buy your product if they know how to use it to fix their problems. Content marketing solves this.Recommended reading: Why is Content Marketing Important? 5 ReasonsHow to get startedWriting well is only one aspect of content marketing. You’ll also have to know the rest—strategy, topic research, creating the right type of content, content promotion, etc.Begin by reading this amazing post from Fio for a good headstart on understanding the topic.Next, watch this free course on Blogging for Business.It’s five hours long, but it’s worth it. It’ll teach you everything you need to know to generate traffic to your blog. Even experienced marketers learned a thing or two.Me, an hour ago: I guess I’ll check out @timsoulo’s blogging for business course… but I doubt I’ll learn anything.Me, right now: *eyes glued to the screen, desk covered in notes*Well played, Tim.https://t.co/k3AnL3laos via @ahrefs #seo #contentmarketing pic.twitter.com/KkXGOxCJYH — Kyle Byers (@Kyle_Byers) May 8, 2018Want to keep learning about content marketing? Here are more resources:How to Build a Winning Content Marketing Strategy (9 Steps)7 Inspiring Content Marketing Examples (And How to Replicate Them)What is B2B Content Marketing? 7 Successful ExamplesHow to Write a Blog Post in 9 Steps (That People Actually Want to Read)Content Promotion Checklist for Beginners3. Search engine optimization (SEO)After blogging for a while, I noticed there was a pattern. Most articles got traffic in the beginning but faded to nothing after some time.In contrast, the blog posts that steadily got more traffic were the ones that ranked in Google.Investigating this led me to SEO.Learning SEO has skyrocketed my understanding of content marketing. Rather than running aimlessly on the content creation hamster wheel and trying to get more traffic by publishing more, SEO taught me how to create evergreen content that gets passive traffic over time.Plus, SEO-driven content marketing is often cheaper in the long-term.For example, the Ahrefs blog ranks for ~175,000 keywords and generates an estimated 373,000 monthly search visits.If we had to acquire all that traffic via Google ads, it would cost us $965,000 per month (or $11.58M annually). Considering that we spend nowhere near that amount on producing content, it’s reasonable to say it’s cheaper than paid ads in the long run.Recommended reading: Why SEO Is Important: 8 Undeniable Facts and Case StudiesHow to get startedWatch this video to understand what SEO is all about:https://www.youtube.com/watch?v=DvwS7cV9GmQThen, from there, if you’d like to explore the different subtopics under SEO, I’d recommend going through these resources:Keyword Research: The Beginner’s Guide by AhrefsOn-Page SEO: Complete Beginner’s GuideThe Beginner’s Guide to Link BuildingWhat is Technical SEO? 11 Best PracticesSEO Training Course: Learn How to Get Organic Traffic From Search4. Email outreachEmail outreach is the foundation of most things in marketing. Partnerships, events, networking, business development, link building—they all require you to send a cold email.Needless to say, knowing how to send a good outreach email is the difference between getting what you want and being ignored.How to get startedJust because you can send an email to anyone anytime doesn’t mean your emails are always welcome. The busier or more famous a person is, the more “spam” emails they receive in their inbox. If you don’t practice good outreach skills, your email will belong to that group—straight into the trash.How do you do this? You need to think about what’s in it for the person you’re emailing. Sure, you’re reaching out because you want something… but what do they get out of it? Why should they help you?Take a moment to think about it every time you craft an email. It could be because:You’ve featured them or their work in a piece of content.You have something new, interesting, or unique to show them.You’re inviting them onto your platform, which has >X number of viewers/listeners/readers.You’ve used their advice and it worked.And so on.Learn more about how to send good outreach emails in this post or watch this video:https://www.youtube.com/watch?v=nAIWG8883uo5. NetworkingI got my job at Ahrefs via networking.I first met Tim, our Chief Marketing Officer, at an event here in Singapore. Then, later on, I:Consumed all Ahrefs content and promoted them on social media, Reddit, GrowthHackers, etc.Interviewed Tim for a guest article on another blog;Helped out with the launch of Blogging for Business by promoting it and connecting Tim with influencers.Most importantly, I did all of the above for free. Tim didn’t ask me to do it, and I didn’t ask for anything in return. And the rest is history.As the adage goes: “It’s not what you know, it’s who you know that matters.” Most people loathe to admit it, but it’s true. (Except for the first part—skills are important too.)People want to work with people they know and trust. And networking is a shortcut for that process. It’s not just about getting jobs either. With a decent network, you can:Get feedback on your product, work, or business.Get shortcuts to fix any issues you’re facing since people in your network might have encountered similar problems.Get alternative viewpoints.As Matthew Howells-Barby writes:There’s a limit to how much you can teach yourself. Not only this, but there are also some problems that you’ll likely never face yourself. This is where learning through others is imperative.Pretty much once a week for the past couple of years, I’ve met with one person that I didn’t previously know that works in a similar role to me at a different company. This could be a 15-to-20-minute call, grabbing a coffee in person or with me taking a trip over to their office. During these meetings, I ask one question:“What are the toughest problems you’ve faced and how did you solve them?”Matthew Howells-Barby, VP Marketing HubSpotHow to get startedMost people get networking wrong. They start on the wrong foot by having an ulterior motive. They want to befriend you because—and only because—you’re beneficial to them in some way. In Adam Grant’s book Give and Take, these people are called “takers.” They take and never return. And let’s be honest: we can smell these people from afar.It’s a surefire way to be horrible at networking.Instead, you should be a “giver.” You’re not doing something because you expect a favor. You’re just genuinely helpful and always giving value. These people, as Adam Grant’s research discovered, are the most successful at networking.It all starts with your mentality.If you’d like to learn more about networking, I recommend these resources:Never Eat Alone (book)How to Win Friends and Influence People (book)Six Minute Networking (Free course)6. Work prioritizationMost people mistakenly believe that productivity is doing as much work as possible within a limited time frame. But you could easily deceive yourself by creating a list of trivial tasks and checking them off fast.Is that real productivity? I don’t think so.This happens because we don’t have a clear idea of what work we should be prioritizing. We don’t plan what we want to accomplish before we enter the office/turn on our laptop and end up sucked into the emergencies of the day.So, if you want to be productive and do real work, you’ll have to learn how to prioritize.How to get startedGetting Things Done, Eisenhower Matrix, Bullet Journal—there are tons of models, books, and courses that’ll teach you how to tackle this particular skill. They all work. But it’ll be up to your personality, preference, and implementation as to whether they’ll work for you.Personally, for me, I follow a system known as the Weekly/Daily Goals. It consists of three rules:Each week, create a weekly to-do.Each night, create a daily to-do (based on the weekly to-do).Each day, focus on completing the daily to-dos.It’s incredibly simple, but that’s where the secret lies. A productivity/prioritization system has to be simple, or it’s hard to adhere to. So far, it has worked pretty well for me.Learn more about the system in this PDF here.7. Experimental mindsetDigital marketing is a constantly changing industry. What works today may not work tomorrow. What works for one company may not work for yours.Therefore, you must always be testing and figuring out what works and what doesn’t.To do this, you must think like a scientist, i.e., have an experiment mindset. Look at everything as an experiment. Failure is not failure but merely a data point. It is temporary, and what you learn will help you progress forward in learning more about your business, your customers, and your industry.How to get startedThis isn’t really a skill but a mindset shift you have to adopt. I like how Derek Sivers puts it:Ask yourself:What experiment could you try for the next 30 days?What happens if you tried doing the opposite for just 48 hours?Then test it and see what happens.How to practice and improve your marketing skillsIn Ultralearning, author Scott Young talks about a concept called directness. Basically, you should know how you’re going to use the skill you’re learning. Then, practice using that skill in that particular situation.Put simply: do the real thing.For certain activities, we understand it intuitively. To learn how to do a push-up, you have to do push-ups. Yet, when it comes to marketing, a lot of us abandon directness for fake alternatives, like spending all our time-consuming articles and convincing ourselves we’re “learning.” It’s not just you—I’m guilty of it too.Passive learning is fun and feels like learning. And while it can be helpful, it doesn’t actively improve your skills. To pick up or improve any marketing skills, you have to actually do it.Copywriting? Write. Email outreach? Send emails.If your job allows, incorporate practice into your work. For example, if you want to learn copywriting, volunteer to write a blog post for your company blog. Or perhaps you could make suggestions on how to improve a landing page’s headline. If you’re already a creator, then see if you can incorporate the new copywriting principles you’ve learned into your content.If it’s difficult to practice during work, don’t fret. Create a website on the side, then use it to practice.Now, bear in mind that I’m not discouraging reading or learning. They’re great and can uncover ideas you might want to test. But spending all your time consuming is not practice. And we can always do more of that.Further thoughts about skillsDiscussions about marketing skills eventually run up against this topic: should you be a specialist or generalist?Like the debate about which marketing skills you should acquire, I don’t believe there’s a “right” answer. It comes down to what you want out of your career.If you’re looking for monetary success, then being a specialist is probably better. As Kevin Indig argues:Increasing your value is easier as a specialist than a generalist. You can connect better and faster with people because the field is smaller. You can build out hard skills quicker from deep knowledge in one thing, compared to shallow knowledge in many things. Soft skills are necessary for both functions but more crucial for managers. Those are good reasons to aim at starting out as a specialist.Kevin Indig, Director of SEO ShopifyDevelop a circle of competence and focus on serving that circle.If you want to be in a managerial role, you might want to consider being a T-shaped marketer. This means you have broad skills/knowledge across all things marketing but excel in one particular area.You can even consider going further and excel in two (π-shaped) or three (M-shaped) areas of marketing.Lastly, another way to think about which skills to acquire is to create a unique talent stack that only you have. Scott Adams of Dilbert fame popularized this idea.He said he wasn’t the best artist, best comedian, nor best businessman in the world. But he had above-average skills in all three and combined them to create Dilbert, one of the most successful comic strips in the world.If you can master two or more skills that are rarely combined, you can create a unique niche for yourself and become more valuable as a marketer.Tim Ferriss elaborates more on the concept here:https://www.youtube.com/watch?v=wCPbPMRNnvkFinal thoughtsThere is no set of marketing skills that you “must” acquire to succeed.The skills you will need or want to learn will eventually depend on your marketing role, interests, and proclivities.The skills I shared are the ones I believed contributed to where I am today. Hopefully, they struck a chord with you and gave you an idea of where and how to proceed.Any questions? Let me know on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Keep Learning How to Start a Career in Digital Marketing (7 Steps) While you don't need to be certified, you'll need to acquire some skills to become a digital marketer. Learn how to start a career in digital marketing here. 8 Key Digital Marketing Skills (Based on 15 Years in the Industry) If you’re thinking about a career in digital marketing or want to take things to the next level, master these eight skills. 17 Free Online Marketing Courses to Learn Digital Marketing After evaluating over 100+ free digital marketing courses, here are the 17 that made the cut. Marketing 101: Marketing Basics in Simple Words Introduction to marketing for small-business owners, solopreneurs, and beginner marketers. In under 15 minutes. Organic Marketing vs. Paid Marketing: What’s the Difference? Organic marketing is attracting traffic to a website without using paid advertising by creating and distributing valuable content.",
  "headers": [
    {
      "level": "H1",
      "text": "7 Useful Marketing Skills (That I Used to Thrive in My Career)"
    },
    {
      "level": "H2",
      "text": "1. Copywriting"
    },
    {
      "level": "H3",
      "text": "How to get started"
    },
    {
      "level": "H2",
      "text": "2. Content marketing"
    },
    {
      "level": "H3",
      "text": "How to get started"
    },
    {
      "level": "H2",
      "text": "3. Search engine optimization (SEO)"
    },
    {
      "level": "H3",
      "text": "How to get started"
    },
    {
      "level": "H2",
      "text": "4. Email outreach"
    },
    {
      "level": "H3",
      "text": "How to get started"
    },
    {
      "level": "H2",
      "text": "5. Networking"
    },
    {
      "level": "H3",
      "text": "How to get started"
    },
    {
      "level": "H2",
      "text": "6. Work prioritization"
    },
    {
      "level": "H3",
      "text": "How to get started"
    },
    {
      "level": "H2",
      "text": "7. Experimental mindset"
    },
    {
      "level": "H3",
      "text": "How to get started"
    },
    {
      "level": "H2",
      "text": "How to practice and improve your marketing skills"
    },
    {
      "level": "H2",
      "text": "Further thoughts about skills"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Si Quan Ong"
}