{
  "url": "https://ahrefs.com/blog/marketing-mix/",
  "slug": "marketing-mix",
  "title": "Marketing Mix: 7 Ps, 4 Cs, & Other Things You Need to Know",
  "description": "Whether your business succeeds or fails likely depends on your marketing mix. But no need to start from scratch. Just use one of these models.",
  "content": "Mateusz Makosiewicz Marketing researcher and educator at Ahrefs. Mateusz has over 10 years of experience in marketing gained in agencies, SaaS and hardware businesses. When not writing, he's composing music or enjoying long walks. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents The marketing mix is a system of interconnected elements used to bring products or services to the market and effectively communicate them to the target audience. This concept is often equated with the four Ps of marketing. However, there are also other popular marketing mix models.You can create your custom marketing mix from scratch. But to build a sustainable business, you probably shouldn’t be reinventing the wheel in this area.In this article, we’re going to cover the following:Why is the marketing mix important?Types of marketing mixesFive tips on using the marketing mixWhy is the marketing mix important?Marketing a product or service can become overwhelming quite fast. There are just so many things to think about and no clear place to start.But marketing mix models put things in the right order. They provide a sort of template that helps to zero in on things that really matter and lay the foundations for a successful marketing strategy.Types of marketing mixesThe marketing mix and the four Ps of marketing are often used interchangeably. We need to start by noting this is not accurate. The four Ps of marketing are just a type of marketing mix (historically, it’s probably the oldest).So without further ado, here are the key types of marketing mixes with some examples.The four Ps of marketingThe four Ps of marketing is a marketing mix model proposed by Jerome McCarthy in 1960. The four components of the model are:Product – What you sell.Price – How much you sell it for.Place – Where you sell it.Promotion – How you get customers.Let’s look at how this works in practice for a SaaS product like Ahrefs:ElementExampleProduct The product or service you offer to the consumer. This category can mean anything a business offers to its clients (including ideas or experiences). Ahrefs: an all-in-one SEO toolset.Price The cost your clients pay for a product or service.Subscription-based, four tiers, starting from $99 (or $83 if paid annually). Place Where and how your customers can buy your product/service.Digital, direct distribution (SaaS).Promotion The marketing tactics and channels you use to reach your target audience.Content marketing (main marketing tactic) and word of mouth.Recommended reading: How to Implement the 4 Ps of Marketing The seven Ps and eight Ps of marketingThe seven Ps of marketing is a marketing mix model designed especially for service marketing and was proposed by Bernard Booms and Mary Bitner in 1981. The seven components of the model are: Product – What you sell.Price – How much you sell it for.Place – Where you sell it.Promotion – How you get customers.People – Who is involved in delivering your product.Process – Procedures of delivering the product.Physical evidence – Tangible elements of your service the customers will interact with.In later years, the model was expanded by some marketing theorists. This resulted in the eighth P: performance, i.e., how you will measure your success.Since the seven Ps and eight Ps of marketing are models designed for services, let’s see how a service like Uber can use this marketing mix to bring its brand to the market:ElementExampleProduct The service you offer to the consumer. Uber: ride-hailing, food delivery, and freight.Price The cost your clients pay for the service. -Rides: based on time and distance. Additional options for more comfort and riding with pets. -Delivery: service fee (typically around 15%, min. $3) and delivery fee (ranges from $0.49 to $7.99). Optional priority delivery. -Freight: based on data points like distance, day of the week, time of the day, weather, etc. Additional costs apply, e.g., layover, driver assist.Place Where and how your customers can purchase your service. Mainly through mobile apps; optionally through the website. Promotion The marketing tactics and channels you use to reach your target audience.PR, referral programs, and advertising. People People involved in delivering your product (including support). Service is largely automated. But people are critical to the attractiveness of the services, i.e., drivers (driving experience, communication skills, etc.). Uber offers extensive online training and has experimented with performance review methods. Process The procedures by which the service is delivered.Self-service through apps and cashless payments. The algorithms process data and make this available to both parties (suppliers and clients).Physical evidence Tangible elements of the offer. UX design of the apps, driver experience, the comfort of the cars, and signage of the cars. Performance (P-8) Success metrics. Some examples: app downloads, ride/delivery requests and cancellations, customer ratings, driver supply, and revenue.The seven Cs of marketing (aka the compass model)The seven Cs of marketing (also called the compass model) is a marketing mix model proposed by Koichi Shimizu in 1981. It is based on his earlier four Cs model (1973). Here are the seven components of the model:Corporation – The company, i.e., the center of all decision-making.Commodity – The product or service you’re offering.Communication – How you reach your customers and how you get feedback from them.Channel – The distribution channels of your product/service.Cost – The overall cost to the consumer.Consumer – Needs, security, education, and wants of the consumer.Circumstances – Uncontrollable external factors: national/international, economic, social, and weather.Since this is a framework that takes a lot of different physical factors into account, let’s see how the compass model can work for a hardware company like Tesla.ElementExampleCorporation In other words, the center of all decision-making. TeslaCommodity The product or service you offer to the consumer. -Electric cars -Solar panels and solar roofs -AccessoriesCommunication The marketing tactics and channels you use to reach your audience and facilitate two-way communication.-Live product launch events -Referrals -Word of mouth -PR -Strong media presence of Elon Musk -User forums -Test drive eventsChannel The distribution channels of your product/service.-Direct distribution -Self-service purchasing via the website -Tesla physical storesCost The overall cost to the consumer (all costs, including product price, shipping, using the product, etc.). -Car price before tax: $44,990 – $129,990 -Electricity costs to charge the car (superchargers are free only for a selection of cars) -Costs to supply a home with renewable electricity (solar panels, wall connectors) -Car maintenance costs (regardless of warranty) -Optional extended warranty costsConsumer Consumer needs, security, education, and wants. -Needs: less impact on the environment, the prestige of owning an EV, and “car charging” convenience -Wants: one-stop-shop for everything EV-related, car performance, high-tech features, and sleek design -Security: safety features of the products and build quality -Education: guides for EV owners, forums, etcCircumstances Uncontrollable external factors: national/international, economic, social, and weather. -National: government incentives for buying electric cars, gasoline car restrictions, etc -Economic: increasing oil prices can increase demand for Tesla products, but they can also increase prices -Social: CEO’s image can greatly influence demand (and stock value); also, trend toward green energy will increase demand -Weather: colder months increase car energy consumption; solar panels and roofs need to withstand harsh weather; solar panels will produce less energy on cloudy daysThe four Cs of marketingThe four Cs of marketing is a marketing mix model proposed by Bob Lauterborn in 1990. The four components of the model are:Consumer – The needs and wants of the consumer.Cost – The overall cost to the consumer.Convenience – How you make your offering accessible.Communication – How you establish two-way communication with the consumer.For this example, we’re going to look at Huel, the nutritionally complete meal replacement product:ElementExampleConsumer (wants and needs) The needs and wants of the consumer. Spend less time on meal prep and washing up, eat healthily, less food waste, eat more environmentally friendly and humane food, save money on eating out, simpler lifestyle, lose weight, and get fit. Cost (to satisfy) The overall cost to the consumer (all costs, including product price, shipping, using the product, etc.). The core product (powder v3.0) sets the price of a meal from $2.21. There are almost no additional costs: delivery is free; also, product has a long shelf life, doesn’t need to be refrigerated, and requires only water to prepare (bottle and measuring scoop are free). Convenience (to buy) The distribution channels of your product/service.Direct distribution through the website. Communication Ways to facilitate two-way communication with the consumer.A strong presence on social media, an online forum for users (“Hueligans”), and product marketing addressing FAQs and misconceptions. These aren’t the only marketing mix models you will stumble upon. For example, I’ve also heard about the four Es of marketing, the SAVE model, and so on. But they are all more or less extensions or alterations of the types featured above.Instead of flooding you with all of the possible marketing models, I’d like to share with you some insights on using the marketing mix.Five tips on using the marketing mixHere are five things worth keeping in mind when designing your marketing mix.1. Practice designing the marketing mix on competitors firstComing up with ideas for your marketing mix is easier if you reach out for some inspiration first. There’s hardly a better source of inspiration than other companies, especially your competitors. This way, you can learn two important things:You may likely find that other companies have similar problems. You can learn how they solve them, use the same solutions, or use your own remixed and improved solutions.This is a great exercise for understanding your competitors. After all, to win in the market, you just need to do better than them.So just take one type of marketing mix and try to fill in the blanks with as many details as you can. You can repeat that for other companies too. After a couple of those, devising your mix won’t seem so daunting.Recommended reading: How to Conduct a Competitive Analysis (Template Included) 2. Always start with the product/serviceSeeing the various elements inside the marketing mix models, you may be wondering where to start. Or in other words, what the foundation of the entire plan should be.My advice: start with the value you are planning to deliver to your customers, i.e., your product or service. Reason: the importance of product-market fit.Product-market fit is achieved by a company when it has confirmed signals that its product can satisfy an existing demand in a market with high potential. It’s arguably the single most important thing in building a sustainable business and is something that should precede any scaling up of the business.When you’re leading with your product/service in your marketing mix, you’re aligning your marketing efforts with product-market fit.This way, if you’re developing your marketing mix pre-market fit (i.e., before validating the idea of your product), the marketing mix will help you achieve product-market fit. And if you’re developing your marketing mix post-market fit, you’ll be building on the success of your product (more on this in the next section). Of course, this doesn’t mean that you can completely ignore the customers’ needs and wants and just put something on the market that fits your vision. In fact, the product-market fit is just as much about the idea for the product as it is about the people who will use it.Take Ahrefs, for example. Before becoming a robust, all-in-one SEO toolset and hiring the first-ever person for marketing, we were testing the waters with one tool built just for backlink analysis. And because the product caught on, we were able to confidently focus our marketing efforts on product marketing.In 2011, Ahrefs was a tool for one thing only. Thanks to the product-market fit of that offering, we were confident in scaling everything up. What started as a backlink database is now an eight-figure ARR business.Recommended reading: How to Achieve Product-Market Fit (5 Steps)3. Coherence is keyMost effective marketing mixes are those that create a coherent system of interlinked elements.This means that a viable strategy for devising marketing mixes is to build upon elements that are either the most certain or the strongest. This way, the consequent elements of the mix can reinforce themselves. Let me give you an example.The strongest element in Ahrefs’ marketing mix is the product. Our product is designed to help marketers and business owners rank higher on search engines and get more traffic. From that P (product), we can derive another P (promotion). There are two opportunities for us (which we, of course, took):Lots of people are searching Google for solutions to problems our product solves.By showing that we can rank our content using our very own tools, we deliver a strong message about the utility of our product and the expertise of the people who develop it.Here, you can see some of the topics we talk about on our blog. Within them, there are hundreds of subtopics that can add to the monthly Traffic Potential (TP). Data via Ahrefs’ Keywords Explorer.For us, the obvious solution to that is content marketing, namely product-led content marketing designed to rank on Google. And by choosing a marketing tactic that works well with our product, we’ve strengthened the ties between those two Ps, allowing them to reinforce one another.We decided to go even further than that. We chose to slice out portions of our products and release them for free. This way, our product becomes our promotion. It has proven to be an effective way to bring people from search engines to us:The write-ups of our free tools are some of the pages that bring us the most organic traffic. Data via Ahrefs’ Site Explorer.4. Guess and test (where needed)Market research should be the number one step to take in devising a marketing mix or any kind of marketing strategy. But this kind of research can be time-consuming and expensive.Instead, you can reach for agile market research methods. Make small bets or educated guesses based on information that is available to you and just test them. Then build upon that.For example, instead of going in circles to search for a definitive, theoretical answer on how to price your product, you can use an agile market research tool like SurveyMonkey for price testing and get feedback from real people.The same can be done for your product prototypes with the help of platforms like Loop11 or UserTesting.Making educated guesses is also not completely unheard of in the world of business. After all, this is how Amazon famously started—with a single stat that the internet is growing 2,300% per year.Founder Jeff Bezos used this information to make an educated guess that an online bookstore may likely be a viable business idea. He tested that idea, and the rest is history.Further readingWhy You Only Need to Test With 5 Users When an Educated Guess Beats Data Analysis 5. Review your marketing mix regularlyThe factors that you build upon will eventually change. Some will change a year from now, some five years later, and others even longer than that.To illustrate, here are the things that may change for the companies featured in our analyses of marketing mix types:Ahrefs – Increasing demand for all-in-one marketing platformsHuel – New studies of the detrimental effect of using sucralose (what Huel uses as a sweetener) long termUber – Outbreak of a pandemic, e.g., COVID-19Tesla – Advances in hydrogen fuel and other types of alternative energyAnd here’s an example of a company that made a game-changing switch after considering the circumstances: Netflix. Due to advancing web technology and increasing internet adoption, Netflix realized it made less and less sense to stick to renting movies on DVD by mail.Did Netflix make the right choice to enter the streaming market? Just look at the volume trend of “streaming services,” and the answer becomes obvious. Data via Ahrefs’ Keywords Explorer.Netflix in 2005 was the “best way to rent movies” (on DVD). Source: Internet Archive.By the way, here’s another highly successful transformation: Netflix’s decision to not only distribute content but also create content. That decision allowed it to triple its revenue.When changes happen, it usually means that you need to tweak your mix and adapt to changes in the environment. The trick is not to get caught by surprise. So regularly review your mix.Final thoughtsI deliberately skipped the broader historical overview of the origin of the marketing mix models. The reason is when it comes to this marketing theory, the fact that something is conceived later doesn’t make it better.In fact, some marketers argue the original marketing mix, the four Ps of marketing, is still the best one. Well, we won’t go into that too much. But now that you know the different models, you may be wondering which best suits your business.My advice: start with the four Ps. Because your success or failure is likely going to be dependent on a) the market fit of the product or service, b) the adequacy of the price in the context of market conditions and benefits of your offering, c) whether there’s inconvenient/faulty distribution, and d) whether there are wrong marketing strategies or ineffective tactics. All of those concerns are addressed in the four Ps.The basic four Ps are embedded in other types of marketing mixes. So you can treat the additional elements of other types as extensions as you move along. But in essence, what you really need to nail is the product, price, place, and promotion.Got questions or comments? Ping me on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Mateusz Makosiewicz Marketing researcher and educator at Ahrefs. Mateusz has over 10 years of experience in marketing gained in agencies, SaaS and hardware businesses. When not writing, he's composing music or enjoying long walks. Keep Learning 17 Free Online Marketing Courses to Learn Digital Marketing After evaluating over 100+ free digital marketing courses, here are the 17 that made the cut. Marketing 101: Marketing Basics in Simple Words Introduction to marketing for small-business owners, solopreneurs, and beginner marketers. In under 15 minutes. Organic Marketing vs. Paid Marketing: What’s the Difference? Organic marketing is attracting traffic to a website without using paid advertising by creating and distributing valuable content. Marketing vs. Advertising: What’s the Difference? (10 Examples) For many people, marketing is synonymous with advertising. But the truth is that advertising is only a small part of marketing. 7 Marketing Objective Examples (+ How to Set Yours Right) Setting marketing objectives is an essential part of every marketing plan. We share how to do it right with seven great examples.",
  "headers": [
    {
      "level": "H1",
      "text": "Marketing Mix: 7 Ps, 4 Cs, & Other Things You Need to Know"
    },
    {
      "level": "H2",
      "text": "Why is the marketing mix important?"
    },
    {
      "level": "H2",
      "text": "Types of marketing mixes"
    },
    {
      "level": "H3",
      "text": "The four Ps of marketing"
    },
    {
      "level": "H3",
      "text": "The seven Ps and eight Ps of marketing"
    },
    {
      "level": "H3",
      "text": "The seven Cs of marketing (aka the compass model)"
    },
    {
      "level": "H3",
      "text": "The four Cs of marketing"
    },
    {
      "level": "H2",
      "text": "Five tips on using the marketing mix"
    },
    {
      "level": "H3",
      "text": "1. Practice designing the marketing mix on competitors first"
    },
    {
      "level": "H3",
      "text": "2. Always start with the product/service"
    },
    {
      "level": "H3",
      "text": "3. Coherence is key"
    },
    {
      "level": "H3",
      "text": "4. Guess and test (where needed)"
    },
    {
      "level": "H3",
      "text": "5. Review your marketing mix regularly"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Mateusz Makosiewicz"
}