{
  "url": "https://ahrefs.com/blog/marketing-vs-advertising/",
  "slug": "marketing-vs-advertising",
  "title": "Marketing vs. Advertising: What's the Difference? (10 Examples)",
  "description": "For many people, marketing is synonymous with advertising. But the truth is that advertising is only a small part of marketing.",
  "content": "Michal Pecánek SaaS SEO consultant with over 6 years of experience. Before going freelance, Michal was an SEO & Marketing Educator at Ahrefs–creating content for the blog and managing a team of guest writers. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents For many people, marketing is synonymous with advertising. Even some marketers use both words interchangeably. But the truth is advertising is only a small part of marketing.Want to make sense of it all and learn from various examples along the way? You’re in the right place. In this article, you’ll go through the following:What marketing isWhat advertising isDifference between marketing and advertisingFive examples of marketingFive examples of advertisingLet’s dive into it.What is marketing?According to the American Marketing Association, “marketing is the activity, set of institutions, and processes for creating, communicating, delivering, and exchanging offerings that have value for customers, clients, partners, and society at large.”I kicked this off with an academic definition for a good reason. (We’re getting back to human speech now—don’t worry.)Did you notice any mention of promotion or advertising in the definition above? Me neither. From the definition, we can deduce that advertising takes place. But the point is that marketing is so much more than that.So let me put together a more digestible definition of marketing:Marketing is a process that starts with market research needed to develop a marketing strategy, which guides all communication that includes promotions and advertising.So…What is advertising?Advertising is paying for exposure to your brand. It’s a form of paid promotion. Advertising enables organizations to communicate a message to a target audience at a certain time.Unlike marketing, advertising isn’t such a vague term for many. We can clearly say, “This is advertising!” when pointing to the following image:What is the difference between marketing and advertising?Advertising is a product of marketing. It’s what the outer world often sees. That’s why many people use the terms interchangeably. But there’s so much more to marketing than just advertising.In other words, all advertising is marketing, but only a small portion of marketing activities is advertising. It’s best to wrap this up with an image:It should be all clear now. Let’s move on to the examples.Five examples of marketingWe need to kick this off with some terminology. If you ask a random person to tell you an example of marketing, they’ll most likely mention a type of marketing, a marketing channel, or a specific marketing campaign. So what do all these mean?Marketing campaign is a series of organized, strategized efforts used to achieve a marketing goal. It’s a one-off activity that starts and ends. It can be rinsed and repeated, though. Think Coca Cola truck campaigns.Marketing channel is a set of tools and platforms used to communicate with your audience. Think email or social media.Marketing type is anything that can be categorized—marketing channels, tactics, or techniques. For example, digital marketing joins all online marketing channels together. Then we also have B2B marketing that covers all channels and activities that can be used to acquire a business as a customer.Now that we’ve covered the above, we’re going to dive into examples of marketing channels and marketing types, with one exception at the end. Let’s do it.1. Inbound marketingInbound marketing is when you pull your audience in with relevant and useful content. It’s best explained in the following image that compares inbound marketing to outbound marketing.Its biggest strength is contextuality. Take this very article, for example.If you Googled the difference between marketing and advertising, clicked on this article, and are reading the article now, then this set of actions is an example of inbound marketing. (It solves your problem at the right time.)Recommended reading: What Is Inbound Marketing? A Beginner’s Guide2. Content marketingContent marketing is the process of creating and distributing content to attract and retain customers. The content can be in the form of blog posts, podcasts, videos, infographics, ebooks, etc.Yes, inbound marketing can be understood as a part of content marketing (if you’re wondering about that now). This is the main reason why content marketing is our most important marketing channel. It’s simple and effective:We create in-depth blog articles (like this one) and YouTube videos that teach potential and existing customers how to solve problems and grow website traffic using our tools. We rely primarily on search engine optimization (SEO) to drive qualified traffic to our blog, which is currently getting ~330,000 organic visits per month:Data from Overview report in Ahrefs’ Site Explorer.This and much more is a part of our content marketing strategy. It’s hard to find any downsides here other than it takes a lot of time and effort.Recommended reading: Content Marketing: A Comprehensive Guide3. Word-of-mouth marketingWord-of-mouth marketing is the process of influencing and encouraging natural discussions about a product, service, or company. If done right, it can become one of your most powerful marketing channels. It certainly is for us.Why? Research from Nielsen shows that 83% of people trust recommendations from their friends and family. It’s simply the most trustworthy and authentic marketing channel that you can’t beat, no matter how great your marketing communication is.I can list countless examples of people recommending our product or content to others. But the best proof is more than 14,000 new customers in 2020 told us they were referred to Ahrefs by their friends:The downside is the lack of control you have over this channel. There are tried and tested tactics to incentivize word-of-mouth, but it’s still one of the most difficult marketing channels to influence.Recommended reading: Word-of-Mouth Marketing: A Simple Tried & Tested Guide4. Affiliate marketingAffiliate marketing is the act of promoting another company’s product or service for a commission on generated sales. Commissions are typically a percentage of the sale price but can occasionally be a fixed amount.As a company, you can create what’s called an affiliate program. You come up with a payout structure for your affiliate partners; then, you should implement a system for partnership sign-ups and the tracking of referrals and sales. It should motivate people to recommend your products to their friends, acquaintances, and audience.Some of the biggest and most valuable websites greatly rely on affiliate income. Here’s an example of a coffee grinder recommendation full of affiliate links from Wirecutter, which is owned by The New York Times:Developing an affiliate program is a great way to get exposure for your products early on. But make sure you think it through. Adjusting commissions or discontinuing the program can easily backfire later.Recommended reading: Affiliate Marketing for Beginners: What It Is + How to Succeed5. Conducting a competitive analysisIt’s only fair to mention an example of a marketing activity unrelated to promotion. Competitive analysis is the process of identifying and researching your competitors to get the information you need to gain a competitive advantage. It should be an essential part of market research.Here’s what conducting a competitive analysis may look like:Find your competitorsGet background informationAnalyze competitors’ products and servicesFamiliarize with their targeting and positioningDiscover competitors’ distribution channelsDive into communication strategiesDo some ghost shoppingConduct a SWOT analysisThere’s much to do and information to get. Even the first step of finding your competitors isn’t that straightforward. For example, your competitors for a certain marketing channel may not be your business competitors.Here, we can see the biggest organic search competitors for Rolex aren’t watch manufacturer websites:Data and insights from Competing Domains report in Ahrefs’ Site Explorer.All of this is still a small part of the whole market research process. Do you see how complex marketing is now?Further readingHow to Conduct a Competitive Analysis (Template Included)5 Competitor Analysis Tools You Should Be UsingFive examples of advertisingSimilar to the logic applied before, all examples here are technically advertising channels. There are a lot of them. So we’ll go across the spectrum, covering examples of both new and traditional advertising.1. Pay-per-click advertisingOne of the two most prominent examples of online advertising here. In pay-per-click (PPC) advertising, advertisers pay a fee each time someone clicks on an ad.We encounter these ads all the time. The most common are search ads:There are four main reasons why PPC advertising is a major traffic driver for many companies:You can drive traffic to your website instantly – It’s possible to learn the basics of PPC marketing and start running your first ads in one day. You can’t say that about building email lists or creating content that drives constant organic traffic.You can target potential customers really well – PPC platforms provide so many targeting options that allow you to target people who are likely to buy from you. Everyone will choose what best fits their marketing objectives.You can measure it easily – Most platforms like Google Ads provide a tracking pixel—a piece of code that connects the ad click with what the user does on your website and keeps you in the loop about things like ad engagement and costs.You can easily scale it – If you want to drive more clicks from your PPC campaigns, you can just pump more money into them. Scaling up other channels generally requires much more work.The downside is the clicks can be expensive, depending on the niche that you’re in. For example, these are the CPCs in USD of our most expensive keywords for Google Search ads in the U.S.:Data from Paid Keywords report in Ahrefs’ Site Explorer.Further readingPPC Marketing: Beginner’s Guide to Pay-Per-Click AdsAll You Need to Know About Online Advertising (Done Simply)2. Display advertisingNow, let’s look at the other most common online advertising channel. Display ads appear on websites that provide their space to advertising networks, and the ads look like this:These are basically online versions of billboards or LED screen ads. The main difference is that with a display ad, you’re just one click away from visiting an advertiser’s website. The ads can be technically considered as PPC ads but are most often bought on the basis of cost-per-thousand (CPM) impressions instead.Display ads are great for increasing brand awareness and consideration among your target audience. They can also work to drive conversions when you target visitors of your website who showed interest in your products (retargeting).3. TV advertisingTV ads don’t need any introduction. They’re one of the traditional forms of advertising. Despite many people and marketers thinking that “TV is dead” nowadays, it’s quite the opposite and remains one of the biggest advertising channels:TV is arguably the most important channel for many big brands that engage in mass market targeting for their brand awareness campaigns. A great example of a TV ad that people watch (even voluntarily) is Heinz’s collaboration with Ed Sheeran, who’s a huge fan of the ketchup brand:https://www.youtube.com/watch?v=keOaQm6RpBg4. Out-of-home advertisingOut-of-home (OOH) advertising entails all ads that you encounter in the streets, shopping malls, airports, etc. It’s another example of traditional advertising channels that especially big brands use to build brand awareness.As with TV ads, the creative plays a huge role. Here’s an example of creatives turning what would’ve been your standard boring billboard into a viral campaign:5. SponsorshipsLet’s wrap this up with one of the more subtle forms of advertising: sponsorships. You can sponsor industry events:The delegate bags are ready for tomorrow (loving the design @ahrefs!) Are *you* ready? You’ll need your badge, lateral flow test confirmation email/text and enough time to get through registration #brightonSEO pic.twitter.com/Vq9L5h6yC2— brightonSEO (@brightonseo) September 8, 2021 Maybe support various creators and influencers who have a following that intersects with your target audience:Or even sponsor a whole community:See why I wrote that it’s “one of the more subtle forms of advertising” now? Sponsorships have become one of our biggest advertising spends.They help us increase brand awareness in the SEO and marketing industries, improve our public relations as we support many members of our community, and give us an opportunity to engage with the market personally when it comes to events we’re attending.Final thoughtsThere’s quite a bit of marketing terminology that’s either nonsense or often used in the wrong way. To be honest, you can just call all advertising “marketing,” and you’ll be technically correct. But that’s not the point here.So, what is?Well, you now know that advertising is just a small part of everything that marketing entails. Don’t get fooled by what it looks like on the outside. Being able to look at the bigger picture is a skill that many marketers lack these days.Got any questions? Ping me on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Michal Pecánek SaaS SEO consultant with over 6 years of experience. Before going freelance, Michal was an SEO & Marketing Educator at Ahrefs–creating content for the blog and managing a team of guest writers. Keep Learning Organic Marketing vs. Paid Marketing: What’s the Difference? Organic marketing is attracting traffic to a website without using paid advertising by creating and distributing valuable content. All You Need to Know About Online Advertising (Done Simply) Online advertising is paying for exposure or traffic on the internet. Check out this simple guide to learn everything you need to know about it. Inbound vs. Outbound Marketing: What’s the Difference? Inbound marketing is building brand awareness and interest with content. Outbound marketing is reaching out to consumers to do the same. 3 Marketing Strategy Examples You Can Use to Create Your Own A marketing strategy is a business's overall game plan for reaching consumers and turning them into customers. What Is Experiential Marketing? 22 Examples & Takeaways Experiential marketing provides prospects or customers with real-life experiences to achieve various marketing goals.",
  "headers": [
    {
      "level": "H1",
      "text": "Marketing vs. Advertising: What’s the Difference? (10 Examples)"
    },
    {
      "level": "H2",
      "text": "What is marketing?"
    },
    {
      "level": "H2",
      "text": "What is advertising?"
    },
    {
      "level": "H2",
      "text": "What is the difference between marketing and advertising?"
    },
    {
      "level": "H2",
      "text": "Five examples of marketing"
    },
    {
      "level": "H3",
      "text": "1. Inbound marketing"
    },
    {
      "level": "H3",
      "text": "2. Content marketing"
    },
    {
      "level": "H3",
      "text": "3. Word-of-mouth marketing"
    },
    {
      "level": "H3",
      "text": "4. Affiliate marketing"
    },
    {
      "level": "H3",
      "text": "5. Conducting a competitive analysis"
    },
    {
      "level": "H2",
      "text": "Five examples of advertising"
    },
    {
      "level": "H3",
      "text": "1. Pay-per-click advertising"
    },
    {
      "level": "H3",
      "text": "2. Display advertising"
    },
    {
      "level": "H3",
      "text": "3. TV advertising"
    },
    {
      "level": "H3",
      "text": "4. Out-of-home advertising"
    },
    {
      "level": "H3",
      "text": "5. Sponsorships"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Michal Pecánek"
}