{
  "url": "https://ahrefs.com/blog/marketing-objectives/",
  "slug": "marketing-objectives",
  "title": "7 Marketing Objective Examples (+ How to Set Yours Right)",
  "description": "Setting marketing objectives is an essential part of every marketing plan. We share how to do it right with seven great examples.",
  "content": "Michal Pecánek SaaS SEO consultant with over 6 years of experience. Before going freelance, Michal was an SEO & Marketing Educator at Ahrefs–creating content for the blog and managing a team of guest writers. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents The hard truth about marketing objectives is that you shouldn’t look at a few examples and choose those that seem to fit the best. The examples should only be used as inspiration.It’s on you to set specific marketing objectives because every business is different and the highest priority needs in marketing change over time. Deciding where your marketing focus should be for the year ahead is an essential part of every marketing plan.In this article, we’ll dive into examples of great marketing objectives, including ways to measure them. It’s then followed by the best practices you should apply to either adjust those examples according to your needs or come up with your own marketing objectives from scratch.But first…ContentsWhat are marketing objectives?Marketing objectives are specific and realistic outcomes that your company wants to achieve with its marketing efforts over a certain period of time. They guide what you should focus your marketing activities on, most commonly for the year ahead.Great marketing objectives provide benchmarks to evaluate your marketing performance, which is key to making changes to your marketing strategy and plans.Let’s dive into the examples.Seven examples of marketing objectives and how to measure themComing up with a good marketing objective is one thing. Being able to properly track the progress toward it is another.That’s why each point here contains a short “How to measure it” section pointing you toward metrics, KPIs, and systems you can use to follow through.1. Increase share of voice (SOV)Example objective: Increase SOV from 11% to 16% by the end of 2023.Share of voice (SOV) is traditionally a measure of your advertising share compared to competitors. However, with most brands now fighting for visibility on organic channels like social and search, we can broaden that definition to how visible your brand is in the market.This is an excellent marketing objective because there’s a strong relationship between SOV and market share. Once your SOV is higher than your market share, you create excess SOV (eSOV). Your market share should follow in the same direction in the long run.Of course, this is an undeniably tricky metric to track across all channels. The solution is to break the objective down into your most important channels. Here are a few examples:Increase organic search visibility in the U.S. from 6% to 8% by the end of 2023.Increase search ad impression share from 47% to 65% in the U.S. among Site Audit tool buyers by the end of 2023.Increase marketing podcast audience monthly reach from 300,000 to 500,000 by the end of 2023.How to measure itMeasuring SOV depends on your choice of channel. For example, for organic search, the simplest method is to track your main keywords in Ahrefs’ Rank Tracker, add your competitors’ domains, and check the SOV in the Competitors overview tab.Here’s what it looks like for keywords we target on our blog:It shows you the percentage of all clicks from tracked keywords that land on your and your competitors’ websites.This is a topic on its own, so check the following guide if you’re curious about measuring SOV across channels.2. Increase brand awarenessExample objective: Increase unaided awareness of our brand among the total market of marketers from 31% to 38% by the end of 2023.Brand awareness represents your brand’s level of familiarity among your target audience. For example, the brand that first comes to mind when you think of electric cars is probably Tesla, not Rivian. That’s because Tesla enjoys a higher level of brand awareness among consumers.There are multiple metrics that you can investigate regarding your brand awareness:Aided brand awareness – The percentage of respondents who are aware of your brand when asked explicitly.Unaided brand awareness – Also known as brand recall, this is the percentage of respondents who mention your brand on their own without any prompt.Top-of-mind awareness – The percentage of respondents who mention your brand as the first one in your niche.Brand recognition – The percentage of respondents who recognize your brand based on your logo, visual identity, or other brand assets.How to measure itMeasuring brand awareness metrics requires market research resources because you need answers from a representative sample from your market. Market research agencies specialize in this and are your only option to get comprehensive data.However, if you already measure SOV, you can use it as a rough proxy metric for brand awareness.Further reading9 Tactics to Increase Brand Awareness (Tried & Tested)3. Improve brand perceptionExample objective: Increase perception that we’re the best SEO toolset from 44% to 51% by the end of 2023.Familiarity with your brand is one thing, but do people resonate with how you want them to perceive your brand or products? In other words, does your positioning work? Is your marketing communication creating the right associations around your brand?If you get unsatisfactory answers to these questions, then this objective may be for you. You’ll also likely get other useful information regarding your brand perception. This is all a great starting point to work on your communication and positioning.How to measure itSimilar to brand awareness, this one still requires surveys and likely the help of specialized agencies. But in this case, you’re able to gather a good chunk of the data yourself by surveying your current and lost customers.You can also monitor your brand’s mentions to see how people talk about it online. Tools like Brand24 recognize the sentiment, so that may be a good starting point if you’re simply looking to improve your reputation.4. Boost sales growthExample objective: Increase annual recurring revenue (ARR) from $104 million to $120 million by the end of 2023.Boosting sales growth is the first short-term marketing objective on our list tied directly to revenue or profit. You need to know which financial metrics make the most sense to measure based on your business model and planning.Sales growth can also be tied to a specific product or service. This makes options for sales growth objectives almost limitless.How to measure itSimply get data from your Customer Relationship Management (CRM) platform, checkout systems, or other sorts of financial dashboards.On the other hand, don’t rely on the numbers in your Google Analytics for this. They’re skewed by default and may not track everything properly. 5. Acquire more users or customersExample objective: Increase monthly active users (MAU) of Ahrefs Webmaster Tools from 750,000 to 1.2 million by the end of 2023.Accelerating your user base growth doesn’t necessarily mean more profit, but it has implications that are way beyond any financial metrics.For example, we launched a free version of our SEO toolset called Ahrefs Webmaster Tools in September 2020. Increasing our word of mouth, broadening the user base, and familiarizing more people with our product lead to long-term growth.How to measure itUse numbers from your CRM. Of course, this is not a worthwhile marketing objective for physical product manufacturers selling in supermarkets.6. Generate more marketing qualified leads (MQLs)Example objective: Increase the generated number of MQLs from 5,676 in 2022 to 6,500 in 2023.A marketing qualified lead (MQL) is any lead that indicates interest in your brand and products. That can range from downloading an ebook to sending a contact form.This objective can be a great fit for any subscription-based business with sales reps who’ll be taking over those leads and trying to turn them into customers.How to measure itTracking MQLs can be quite easy these days. You need to set up a lead scoring system that automatically evaluates your incoming leads based on data points like:Estimated purchasing power of the company.User behavior and actions taken in your app or website.Trial tier and setup.Anything the lead said to your customer rep or sales team (e.g., that they’re looking for a new solution).Any other data you collect from forms or lead magnets.Some CRM platforms like HubSpot have a lead scoring functionality built in, but I suggest you consult this with a CRM analytics expert to get everything right from the start.7. Increase customer lifetime value (CLV)Example objective: Increase CLV among enterprise customers from $44,500 to $55,000 by the end of 2023.Customer lifetime value (CLV) is a metric that estimates how much money an individual customer will spend on your products or services. Increasing your average customer’s worth not only improves your financial metrics but also allows you to spend more on acquiring new customers.How to measure itThis is the most basic formula to calculate CLV:Avg. Order Value x Avg. Annual Purchase Frequency x Avg. Customer LifespanIf your AOV is $100, customers buy the product four times a year, and they stay loyal to your company for three years on average, the CLV will be 100*4*3 = $1,200.You work with three different metrics in your CLV objectives. Improve any of those metrics, and your CLV goes up. For example, here’s a whole guide I wrote about decreasing churn rate, i.e., increasing your average customer lifespan.How to set great marketing objectives for your businessYou should now have enough inspiration to come up with your own objectives, so it’s time to go through three best practices that will ensure they fit well with your marketing strategy and plans. Start from your most important marketing needsIncreasing your conversion rates is always nice. But if only 1% of your target audience is aware that your brand exists, you may want to reassess your priorities.Look, no one but your team can tell what’s your biggest marketing opportunity to tackle. This is why it’s crucial to do proper market research that feeds into your marketing strategy—you’d be playing a guessing game otherwise.Your brand diagnosis along with all the data from CRM and analytics systems have the answers. You can’t set the best marketing objectives if you don’t look at the big picture.Well, the big picture can be an actual picture. It’s called a marketing funnel, and most of the objectives we talked about here influence its “flow”:People drop off at each of those stages. Not everyone who sees your Facebook ad will click. Not everyone who clicks will sign up for your newsletter. Not everyone who signs up for your newsletter will buy… you get the idea.You need to measure where the most drop-offs occur and then take steps to rectify the issue.But keep in mind that maybe the biggest opportunity lies in feeding way more people into the funnel if we circle back to the brand awareness vs. conversions prioritization I mentioned earlier.So identify the most significant bottlenecks and choose KPIs that will track your progress toward fixing them. Here are a few ideas for each stage of the funnel:Awareness – SOV, brand awareness, traffic quantity.Interest – Email subscribers, returning visitors.Consideration – Traffic quality.Conversion – Conversion rates, sales, AOV.Of course, conversion is just the first win. Then comes the retention stage where you may want to improve metrics like NPS, churn rate, or customer lifespan.Be aligned with SMART criteriaYou probably noticed a pattern in all the examples—they align with SMART objectives, a widespread management concept that stands for:Specific – Clearly state the desirable outcome and answer “who, what, when, how much, etc.”Measurable – You must be able to track progress with KPIs.Achievable – Be bold with your goals but also be realistic; use current growth as a benchmark.Relevant – Does the objective align with your overall marketing and business strategy?Timely – Set up a time frame for achieving the goal.Each objective example from earlier was aligned with all of these criteria. Yours should too. This is best illustrated if we dissect one of our objectives: Focus on only one or two strategic objectivesYou can come up with tons of marketing objectives, but that doesn’t mean you should. As Michael Porter would say, strategy is deciding what not to do. So here are a couple of golden rules for choosing:Less is more – The fewer objectives a marketing campaign has, the more effective it is. In fact, having just one or two strategic objectives works best. This is based on analyzing campaigns that were submitted for Effies awards, a marketing version of the Oscars.Focus on both short and long term – Achieving your marketing objectives should result in improving both short- and long-term marketing KPIs. In other words, have objectives that directly translate into more profit and others that help with brand building.As a general rule, the ideal balance between marketing spend on sales uplift and brand building is roughly 40:60. It’s one of the most important marketing concepts to keep in mind.There’s a whole publication around this concept. The key takeaway is that brand building is proven to be the primary driver of long-term growth and success.So choose and balance your objectives accordingly.Final thoughtsWe’ve got the strategic objectives covered. It’s the main component for planning your marketing activities for the year ahead.While we talked about ruthless prioritization and “less is more,” remember that this applies only to the big picture. Your strategic objectives should be branched out into many smaller tactical goals, usually per each marketing channel.This is the way of strategic marketing planning.Got any questions? Ping me on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Michal Pecánek SaaS SEO consultant with over 6 years of experience. Before going freelance, Michal was an SEO & Marketing Educator at Ahrefs–creating content for the blog and managing a team of guest writers. Keep Learning Influencer Marketing: Definition, Examples, and Tactics Influencer marketing is the practice of working with influencers to promote your brand’s message, products or services. 3 Marketing Strategy Examples You Can Use to Create Your Own A marketing strategy is a business's overall game plan for reaching consumers and turning them into customers. How to Create a Winning Marketing Strategy in 5 Steps (with Examples) A marketing strategy is your business's battle plan that guides your future marketing efforts. 18 Common Types of Marketing (Examples Included) Learn about the 18 different types of marketing you can use to grow your business. Marketing vs. Advertising: What’s the Difference? (10 Examples) For many people, marketing is synonymous with advertising. But the truth is that advertising is only a small part of marketing.",
  "headers": [
    {
      "level": "H1",
      "text": "7 Marketing Objective Examples (+ How to Set Yours Right)"
    },
    {
      "level": "H2",
      "text": "What are marketing objectives?"
    },
    {
      "level": "H2",
      "text": "Seven examples of marketing objectives and how to measure them"
    },
    {
      "level": "H3",
      "text": "1. Increase share of voice (SOV)"
    },
    {
      "level": "H4",
      "text": "How to measure it"
    },
    {
      "level": "H3",
      "text": "2. Increase brand awareness"
    },
    {
      "level": "H4",
      "text": "How to measure it"
    },
    {
      "level": "H3",
      "text": "3. Improve brand perception"
    },
    {
      "level": "H4",
      "text": "How to measure it"
    },
    {
      "level": "H3",
      "text": "4. Boost sales growth"
    },
    {
      "level": "H4",
      "text": "How to measure it"
    },
    {
      "level": "H3",
      "text": "5. Acquire more users or customers"
    },
    {
      "level": "H4",
      "text": "How to measure it"
    },
    {
      "level": "H3",
      "text": "6. Generate more marketing qualified leads (MQLs)"
    },
    {
      "level": "H4",
      "text": "How to measure it"
    },
    {
      "level": "H3",
      "text": "7. Increase customer lifetime value (CLV)"
    },
    {
      "level": "H4",
      "text": "How to measure it"
    },
    {
      "level": "H2",
      "text": "How to set great marketing objectives for your business"
    },
    {
      "level": "H3",
      "text": "Start from your most important marketing needs"
    },
    {
      "level": "H3",
      "text": "Be aligned with SMART criteria"
    },
    {
      "level": "H3",
      "text": "Focus on only one or two strategic objectives"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Michal Pecánek"
}