{
  "url": "https://ahrefs.com/blog/marketing-analytics/",
  "slug": "marketing-analytics",
  "title": "Marketing Analytics: The Simple Guide",
  "description": "Marketing analytics seeks patterns and insights that can improve marketing performance. Understand marketing analytics to eliminate guesswork.",
  "content": "Mateusz Makosiewicz Marketing researcher and educator at Ahrefs. Mateusz has over 10 years of experience in marketing gained in agencies, SaaS and hardware businesses. When not writing, he's composing music or enjoying long walks. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Marketing analytics is the measurement and analysis of marketing data to seek patterns and insights that can improve marketing performance.If you’re doing digital marketing, you’re swimming in a vast pool of actionable data. But if you’re not using tools and techniques to discover, analyze, and interpret this data, then you’re swimming with your eyes closed.To help you learn what marketing analytics can do, we’ll cover the following:Why marketing analytics is importantHow to use marketing analyticsHow to start the marketing analytics processThree marketing analytics tools we use at AhrefsWhy marketing analytics is importantFirst, marketing analytics can answer questions vital to any business, no matter the size. Here are a few common questions: How are our campaigns performing? Are we spending money on the right marketing channels? How do we compare to our competitors?Knowing those things is great, but it gets even better. Measuring marketing performance opens the door to improving it. For instance, if you notice your PPC campaigns on Facebook are starting to bring less traffic, you can do something about it. You can try improving the ads or even moving your marketing budget elsewhere and then comparing results.Or maybe you’re in a situation where you need to set goals for yourself, your team, or your contractors. You can base those goals on an analysis of past performance and get a quantifiable reference point. How else will you know if, let’s say, increasing website traffic by 15% in one month is enough or even doable?Finally, data can help you get your point across because numbers are persuasive. You can use real numbers from your past marketing efforts to prove that you’re positively impacting the business. Marketing analytics can also help make well-grounded predictions that you can use to fuel your marketing strategy, e.g., securing a higher budget for the next quarter.How to use marketing analyticsLet’s take a look at some of the ways you can use marketing analytics for business growth.Report on the pastThe past is super important to marketers. It’s because the story with marketing usually goes like this: First, you use some marketing tactic. Then you give it some time to generate results. Finally, you check on those results.On that note, marketing analytics will help you answer questions such as:How much organic traffic did our content generate last quarter?How many new leads did Campaign A generate compared to Campaign B?What was the conversion rate from trial sign-ups to paid subscriptions?What was the average cart abandonment rate last year?The good news is that more often than not, marketing analytics software does the tracking and measuring of the most popular metrics automatically. But the important thing is to set up those tools as soon as possible to avoid data gaps.Analyze the presentMarketing analytics can answer some more “timely” questions too, such as things related to patterns in customer behaviors, trends, current budget spending, etc. For example:Why is organic traffic to our blog decreasing?What percentage of our customers use the [feature] of our product?What is the lifetime value of our customers?What is our current ranking for [query] in Google?And when you’ve got insights into your past performance and present state of affairs, you’re all set to take on a task that marketers are asked to do (but few can deliver) all the time: predict the future.Predict the futureEnter predictive analytics or, in other words, making data-driven assumptions about what can happen in the future. Predicting the future is why marketers are not simply reporting for reporting’s sake.For example, if a marketer is able to prove a positive return on investment of a given marketing tactic based on past performance, they can forecast the future performance quite accurately. Often, this is enough to get the marketing budget they need.Here, we also enter the realm of prescriptive analytics, the type of analytics that answers the question, “What should be done?” For example:Which type of page layout should we use? You can use an A/B testing software to test your options.What type of message should we send to a prospect to increase our chances of converting them? Marketers can build models of optimal conversion paths and then test them by setting up automated email workflows.What keywords should we target in our content? SEOs and content marketers do keyword research for that.Compare with competitorsMarketing analytics can help you turn your competitors into allies (almost). Thanks to data from various competitive analysis methods, it’s possible to learn from someone’s mistakes or emulate someone’s success.For example, to identify gaps in your content, you can run a content gap analysis using Ahrefs in just a few clicks and see what keywords your competitors rank for that you don’t.How to start the marketing analytics process (four steps)Whether you want to perform ad hoc analytics or develop a set of metrics that will appear in recurring reports, this simple four-step process will help you focus on what’s most important.1. Identify what you want to measureAs you can see in the paragraphs above, there are a lot of different things that marketing analytics software can track and measure for you. But this creates a temptation to just dive in and look for any kind of insight.While you may find some this way, it’s more effective to determine what you’ll be looking for first and leave less to chance. In other words, if your analytics tool were a person, what questions would you like them to answer?For example, let’s say you’re investing heavily in creating content designed to rank on Google Search. Since your competitors are doing the same thing, you’ll want to know this: How visible is my content on the SERPs compared to them? This is a metric known as the share of voice (SOV).So now that we have our sample research question in place, we can move on to the next step.2. Assess your capabilitiesThere are two questions to ask here:Do you have access to quality data?Do you have the skill to extract and process the data?And there is no other way to answer these than to learn more about your research question.This step may sound trivial, but it’s actually a critical one. Because if you dive headfirst into an analytics problem that is best left to someone else (e.g., a data scientist or an external consultant), chances are you will just waste time instead of better spending it on something else.And this is a common problem among marketing teams. A study revealed that only 1.9% of marketing leaders reported their companies have the right talent to leverage marketing analytics.Whatever your research question may be, just try Googling it first. It’s likely someone has already created a product or service to solve your problem. For instance, a basic query like “share of voice” could lead you to our how-to article.3. Gather data using marketing analytics toolsContinuing our example of calculating SOV, we learn (after doing some quick research online) that you can solve this problem without any special skills by using an SEO tool like Ahrefs. To illustrate, one of the methods consists of three steps:Set keywords you want to track and paste them into Ahrefs’ Rank TrackerSet competitors’ domains you want to match againstGo to the Competitors report and see your data automatically calculated and visualized in the “Visibility” tabThe Visibility report shows what percentage of all clicks for the tracked keywords land on the target websites.4. Draw conclusionsRank Tracker’s Visibility report allows you to analyze the present by making comparisons to your competitors, and it even lets you report on the past SOV. You can do even more if you try to find the reasons behind those numbers and come up with some solutions for future improvements. This is even if you’re generally outperforming your competitors at the moment.Right below the Visibility report, you can see a report of keyword positions in comparison to your competitors’. And if you sort the results by one of your competitors, you will see keywords for which they perform better than you.That knowledge is a great starting point for pinpointing underperforming content and then using SEO tactics to improve rankings. Examples:Getting more backlinksUpdating contentOptimizing page speedBoosting pages with internal linksBasically, in our four-step process, we went from an idea on what to measure to finding exact areas of improvement in our marketing efforts. And that’s the heart of marketing analytics.Three marketing analytics tools we use at AhrefsData is at the core of Ahrefs’ marketing activities. And as with most SaaS companies, our martech stack consists of many different tools. Here are some that we use for marketing analytics.1. AhrefsAhrefs is our all-in-one SEO toolset that helps millions of marketers to optimize their content to rank higher and get more traffic from search engines. And since our core marketing tactic is content marketing, Ahrefs is a tool we can’t live without. We use it mainly for:Finding topics to write about.Studying how to structure our blog posts.Choosing which articles to update.Finding outreach prospects.Studying competitors.Monitoring our performance on search engines.Finding technical SEO issues.To illustrate, let’s take a closer look at the first point from the above list.We want to help people get better at SEO and marketing, so we create educational content. We study what people want to learn, the traffic potential of those topics, and how hard it would be to rank our content on Google to get that traffic.Let’s look at an example. Here, we can see that if we write an article about B2B marketing, we will be looking at an estimated monthly organic traffic of 2K in the U.S. alone. We will also likely need links from about 81 websites to rank in the top 10 in that country. And just like that, we have found a data-driven premise to decide whether to target that keyword or not.If you’re curious about the details of the keyword research process, check out the video below:https://www.youtube.com/watch?v=OMJQPqG2UasFurther readingHow to Use Ahrefs: 11 Actionable Use Cases for Beginners2. Google Search ConsoleGoogle Search Console (GSC) is a free SEO tool designed for monitoring and troubleshooting websites’ appearances in search results.Among many features, GSC shows the exact number of visits from Google’s SERPs to a website. Since only Google can do that with this accuracy (other tools use estimates), we use GSC to mainly monitor the exact amount of organic traffic coming from Google Search to our pages.With this knowledge, we can improve pages that are decreasing in traffic or try to improve the CTRs of pages that are ranking high but don’t get clicked on as often as they should (in our opinion).Thanks to data from GSC, we can easily identify pages with high keyword rankings but low CTRs. For example, an article targeting the keyword “diy seo” could probably do better based on its position.Further readingHow to Use Google Search Console to Improve SEO3. MatomoMatomo is a web analytics tool that is often regarded as the “ethical alternative” to Google Analytics, as it takes a more progressive stance toward data ownership and privacy. This is also one of the reasons we chose this tool.Matomo has all the standard features you’ll expect to help you understand where users come from and how they interact with your website. Things like traffic sources, channel attributions, user flows, goal conversions, cohorts, etc. What’s more, it hosts some tools that you can’t find in other popular alternatives.For example, we found Matomo to be helpful in an experiment where we compared different banner placements on our website. Instead of guessing the best placement, we appended tracking parameters to some links to see the click performance and decide where would make the most sense to keep the banner.Is this a good spot to place this banner? We let our users decide.Results of our quick experiment. Conclusion: turn off the banner on the worst-performing page.Final thoughtsIn this article, I aimed for a quick, digestible introduction to the world of marketing analytics. And I hope it is enough to get you interested in learning more about this topic. After all, digital marketing is virtually impossible to do without it.As you dive deeper into marketing analytics, it will get more complicated than what we’ve discussed here. But on the other hand, it gets more interesting too. For example, there are methods where you can use machine learning for prescriptive analytics to uncover areas of improvement.Also, if you’re interested in data analysis and want to make it one of the pillars of your marketing career, here’s some good news for you: Data-driven marketing is an important trend in the industry; in my opinion, it’s most likely here to stay. So getting some kind of data analytics certification relevant to your specialization is probably a good idea.On a final note, to implement marketing analytics effectively (especially the more advanced type) in your organization, you will need the buy-in of other stakeholders. In other words, you will need a favorable company culture, aka data culture. Obviously, it’s not the data that matters the most, but what you do with it.Got questions or comments? Ping me on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Mateusz Makosiewicz Marketing researcher and educator at Ahrefs. Mateusz has over 10 years of experience in marketing gained in agencies, SaaS and hardware businesses. When not writing, he's composing music or enjoying long walks. Keep Learning What Is Growth Marketing? A Beginner’s Guide What is growth marketing and how does it work? Is it right for your business? Learn everything you need to know in this post. 10 Best Digital Marketing Facebook Groups Grow your marketing network and learn more quickly by joining some of the best Facebook marketing groups out there. All You Need to Know About Online Advertising (Done Simply) Online advertising is paying for exposure or traffic on the internet. Check out this simple guide to learn everything you need to know about it. Music Marketing: A Simple (But Complete) Guide Music marketing is creating, sharing, delivering, and exchanging music offerings that have value to customers, fans, or partners. The Insanely Simple One-Page Marketing Plan Template A marketing plan is a roadmap for executing your marketing strategy over a given period of time, usually a year.",
  "headers": [
    {
      "level": "H1",
      "text": "Marketing Analytics: The Simple Guide"
    },
    {
      "level": "H2",
      "text": "Why marketing analytics is important"
    },
    {
      "level": "H2",
      "text": "How to use marketing analytics"
    },
    {
      "level": "H3",
      "text": "Report on the past"
    },
    {
      "level": "H3",
      "text": "Analyze the present"
    },
    {
      "level": "H3",
      "text": "Predict the future"
    },
    {
      "level": "H3",
      "text": "Compare with competitors"
    },
    {
      "level": "H2",
      "text": "How to start the marketing analytics process (four steps)"
    },
    {
      "level": "H3",
      "text": "1. Identify what you want to measure"
    },
    {
      "level": "H3",
      "text": "2. Assess your capabilities"
    },
    {
      "level": "H3",
      "text": "3. Gather data using marketing analytics tools"
    },
    {
      "level": "H3",
      "text": "4. Draw conclusions"
    },
    {
      "level": "H2",
      "text": "Three marketing analytics tools we use at Ahrefs"
    },
    {
      "level": "H3",
      "text": "1. Ahrefs"
    },
    {
      "level": "H3",
      "text": "2. Google Search Console"
    },
    {
      "level": "H3",
      "text": "3. Matomo"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Mateusz Makosiewicz"
}