{
  "url": "https://ahrefs.com/blog/marketing-plan/",
  "slug": "marketing-plan",
  "title": "The Insanely Simple One-Page Marketing Plan Template",
  "description": "A marketing plan is a roadmap for executing your marketing strategy over a given period of time, usually a year.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Every business needs a marketing plan. It helps guide your marketing efforts and keeps you on track to hit your marketing objectives. The problem is that creating one can get complicated, really complicated.It’s not so bad if you’re familiar with marketing jargon and acronyms like SWOT and KPI. But if you’ve never created one before and want to hit the ground running, it can feel like you need an MBA in marketing just to get started.That’s why we created the one-page marketing plan.You’ll learn how to fill it in shortly. But first, let’s make sure we understand the basics…What is a marketing plan?Marketing plan vs. strategy vs. tactics vs. objectivesHow to create a marketing planWhat is a marketing plan?A marketing plan is a roadmap for executing your marketing strategy over a given period of time, usually a year.What’s the difference between a marketing plan, strategy, tactics, and objective?Despite many people using these terms interchangeably, they’re very different things.Here’s the simplest way to explain them:Objective: What you want to achieve.Strategy: How you’ll do it.Tactics: The methods you’ll use.Plan: Everything mapped out so you can take action.For instance, imagine that you want to get from London to Paris on a budget. Your objective, strategy, tactics, and plan might look something like this:Objective: Get from London to Paris for under $100.Strategy: Use public transportation.Tactics: Bus, tube, and Eurostar.Plan: Get the bus to the tube station, get the tube to St Pancras, get the Eurostar to Paris.You can see how it would be hard to execute your strategy without the plan because you wouldn’t know whether to get the train, tram, or metro first. The plan explains how everything fits together so you can take action.It’s the same with marketing. Your marketing plan explains how your marketing tactics fit together to execute your marketing strategy and achieve your marketing objectives.How to create a one-page marketing planStart by making a copy of the marketing plan template. You’ll see that it revolves around answering four simple questions. Let’s go through how to answer these.Question 1. Who are you targeting?If you’re creating a marketing plan, you should already have done your market research and developed your marketing strategy. And that means you should already have a pretty good idea of who you’re targeting. However, it’s helpful to reiterate this in your marketing plan to keep you focused and on track.For example, if we were putting together a marketing plan for Ahrefs, we might put:SEO professionals and website owners who want to drive more traffic to their websites.This is a very simplified version of who we’re targeting, but it’s enough to set us on the right track.Question 2. What are your objectives?You’re not creating a marketing plan for the fun of it. You’re creating one to map out how you’ll (hopefully) achieve some marketing objectives. So you need to define what those objectives are.These can be pretty much anything you like, but they should ideally be SMART.Unfortunately, this is one piece of marketing jargon we have to tackle, but it’s pretty straightforward and just means that your objectives should be:Specific. They should clearly state the desired outcome.Measurable. They should be something you can track the success of.Achievable. They should be realistic.Relevant. They should align with your overall business objectives.Timely. They should have a time frame attached to them.For example, here’s a bad marketing objective:Increase organic traffic.Here’s a good one:Increase organic search visibility in the U.S. from 3 to 6% in the next 12 months.Only the latter is SMART. The former is too vague, has no time frame attached to it, and isn’t measurable. The latter, on the other hand, is specific, has a 12-month time frame, and is easily measurable in Ahrefs’ Rank Tracker:Generally speaking, it’s best to have a few objectives but no more than a handful. Any less, and you won’t achieve much. Any more, and you’ll spread yourself too thin.If you’re struggling to think of relevant marketing objectives for your business, you might want to take inspiration from the examples in our guide to setting marketing objectives.Question 3. How will you achieve your objectives?Placing goalposts is easy, but scoring a goal is hard. That’s why you now need to get specific and think about the tactics you’ll use to achieve your marketing objectives and how much they’ll cost.Remember that your tactics should always align with your marketing strategy and objectives. Don’t just pluck them out of thin air or opt for shiny, new tactics. Consider what tactics align with your marketing strategy and go from there.For example, our marketing strategy is pretty simple at its core:Help our target audience solve their SEO and marketing problems with the help of our tools by creating informative and useful content about topics they’re searching for.Because your strategy should always dictate the tactics you use, it’s clear that any tactics we use will be content-related. This is also clear from the objective we set ourselves in the previous section:Increase organic search visibility in the U.S. from 3% to 6% in the next 12 months.So what tactics should we utilize to achieve this objective?Given the objective itself, there’s really only one thing we can do here: SEO. However, if we really want to create an actionable marketing plan for ourselves, we need to be more specific.This is where a bit of research is needed…If we scroll down to our tracked keywords in Rank Tracker and sort by estimated traffic, we can see the keywords where our search visibility is low or non-existent:To improve our organic search visibility for these keywords, there are a few tactics we could use. However, to keep things simple, let’s say that rewriting the posts that target them seems like the most viable tactic.Let’s also assume that we don’t have the manpower to rewrite all of these posts, so we’ll focus on the most low-hanging opportunities. That would probably be the posts that target high-volume keywords and currently rank OK but not great.Here’s how we can filter for these keywords in Rank Tracker:Now, it looks like a few of those keywords (“youtube tags,” “what is https,” etc.) don’t align particularly well with our target audience of website owners, so we’ll exclude those.This leaves us with around 80 keywords, and this number equates to 80 posts to rewrite.Next, we need to estimate how much all of this is going to cost us.This is a crucial step that you shouldn’t neglect, as there’s no point in creating a “pie in the sky” marketing plan. It needs to be realistic, doable, and any numbers should actually be based on something (not plucked out of thin air).Given that we do content rewrites in-house, it makes the most sense for us to base cost estimations on how much time we think all of this will take our team (and how much we pay them).To keep things simple, let’s say that the numbers look like this:Time per rewrite: 20 hours. Cost per hour: $20 Number of rewrites: 80Based on these numbers, it looks like it will cost us around $32K and 1,600 man-hours to execute this tactic. That might sound like a lot, but it’s less than one full-time employee’s yearly working hours.Repeat this process as many times as necessary to build a list of tactics you’ll use to hit your marketing objective(s).Learn more: 16 Marketing Tactics That Work in 2021IMPORTANTIf you’re working with a specific marketing budget, don’t be tempted to “make everything fit” by randomly allocating and re-allocating budget between tactics. The budget for each tactic needs to make sense. If your proposed tactics end up costing more than your allocated budget, it means that you simply don’t have enough money to achieve all of your objectives. In which case, you should cut the less important objectives until your proposed tactics and budget align.Question 4. When will you do everything?Marketing plans cover a specific period of time, so it might seem like the answer to this question is obvious. If you’re creating a 12-month marketing plan, then the tactics you outlined in the previous step need to be done in that time frame.Although this is true, simply having a list of things to do over the course of a year isn’t very actionable. It’s better to break things down into manageable chunks so you can track progress throughout the year.How much you break things down is up to you, but a quarterly plan is a good starting point.Here’s what that might look like for our tactic of rewriting 80 low-performing blog posts:Q1Q2Q3Q4Rewrite 20 low-performing blog postsRewrite 20 low-performing blog postsRewrite 20 low-performing blog postsRewrite 20 low-performing blog postsThis might seem like a small and insignificant change, but it means that we can review our progress every quarter to keep things on track. For example, if we find that only 10 posts have been rewritten after the first quarter, then we might need to intervene and optimize workflows to ensure we meet our objectives by the end of the year.Planning tactics on a quarterly basis also helps you to allocate resources more efficiently.For example, let’s say that another one of our marketing tactics was to update a bunch of blog posts in Q4 to maximize traffic from “2022” queries in the new year. Our content team would be pretty overwhelmed if they were also expected to rewrite 20 low-performing posts in the same quarter, so this would probably be a better plan:Q1Q2Q3Q4Rewrite 25 low-performing blog postsRewrite 25 low-performing blog postsRewrite 25 low-performing blog postsRewrite 5 low-performing blog postsUpdate 10 blog posts for 2022You might even want to consider color-coding your quarterly plan to show which team is responsible for which task. This will make it easier to spot when teams are likely to be overloaded and plan accordingly.Final thoughtsGiven that most marketing plans run dozens or even hundreds of pages, our one-page plan is admittedly very oversimplified. But that’s the point. It helps you get the basics down on paper as fast as possible without having to contend with endless marketing jargon and acronyms.Got questions? Ping me on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Keep Learning Marketing 101: Marketing Basics in Simple Words Introduction to marketing for small-business owners, solopreneurs, and beginner marketers. In under 15 minutes. Word-of-Mouth Marketing: A Simple Tried & Tested Guide Word-of-mouth marketing is the process of influencing and encouraging natural discussions about a product, service, or company. Learn how to leverage it. Marketing Analytics: The Simple Guide Marketing analytics seeks patterns and insights that can improve marketing performance. Understand marketing analytics to eliminate guesswork. Music Marketing: A Simple (But Complete) Guide Music marketing is creating, sharing, delivering, and exchanging music offerings that have value to customers, fans, or partners. What Is Search Engine Marketing? The Simple Guide Learn what search engine marketing is, how it works, the best practices to implement, and more in our beginner-friendly guide.",
  "headers": [
    {
      "level": "H1",
      "text": "The Insanely Simple One-Page Marketing Plan Template"
    },
    {
      "level": "H2",
      "text": "What is a marketing plan?"
    },
    {
      "level": "H2",
      "text": "What’s the difference between a marketing plan, strategy, tactics, and objective?"
    },
    {
      "level": "H2",
      "text": "How to create a one-page marketing plan"
    },
    {
      "level": "H3",
      "text": "Question 1. Who are you targeting?"
    },
    {
      "level": "H3",
      "text": "Question 2. What are your objectives?"
    },
    {
      "level": "H3",
      "text": "Question 3. How will you achieve your objectives?"
    },
    {
      "level": "H3",
      "text": "Question 4. When will you do everything?"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Joshua Hardwick"
}