{
  "url": "https://ahrefs.com/blog/marketing-kpis/",
  "slug": "marketing-kpis",
  "title": "Marketing KPIs: 30 Metrics for Every Marketing Role",
  "description": "Learn how to measure your performance and share your wins.",
  "content": "Ryan Law Ryan Law is the Director of Content Marketing at Ahrefs. Ryan has 13 years experience as a writer, content strategist, team lead, marketing director, VP, CMO, and agency founder. He's helped dozens of companies improve their content marketing and SEO, including Google, Zapier, GoDaddy, Clearbit, and Algolia. He's also a novelist and the creator of two content marketing courses. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Marketing is full of things that can be measured (known as metrics), but not all metrics make good key performance indicators.To choose the right KPIs:Tailor them to your role. Different marketing roles need different levels of detail in their KPIs. An SEO lead might care about monthly backlink growth, but a CMO will care more about the sales revenue generated across all marketing efforts.Measure what you want to improve. Don’t spend energy tracking KPIs just for the sake of tracking them. Choose KPIs specifically to better understand the areas you most want to improve.Be realistic about what you can measure. Some KPIs sound great in theory but are almost impossible to measure in practice. Before committing to a KPI, make sure you can actually get the data you need and measure it consistently.Focus on KPIs that you can influence. Your KPIs should measure something that you can influence directly. “Net Promoter Score” is a great measure of how much people love your product, but how useful is it for content marketers who don’t actually control the product?Keep it simple. You don’t need to track 37 marketing KPIs. A handful of KPIs per department is usually enough to make progress where it matters (in fact, many companies use one “north star” metric).There are an almost infinite number of KPIs, often varying in small details (like how they’re measured, or subtle differences in definition). Many KPIs also have overlapping audiences (SEOs and content marketers may track very similar things).But with those caveats, let’s talk through core marketing KPIs for common marketing roles—and how to calculate them.ContentsKPIs for CMOsThese KPIs help marketing leaders—CMOs, VPs or directors, heads of marketing—report on the efficacy of marketing as a whole. They try to measure the impact of marketing in cold, hard dollar terms.Most of these KPIs can be calculated for marketing as a whole, or for individual marketing channels (like content marketing or events). In fact, that’s the point: a big part of a marketing leader’s job is to compare the results from different marketing channels, and work out which perform best.ROMI (return on marketing investment)How much does your marketing cost compared to how much money it generates?= (revenue attributed to marketing spend - marketing spend) / marketing spendLTV (lifetime value)How much does an average customer spend with you across their whole relationship with your business?= average monthly revenue per customer / average monthly churn rateCAC (customer acquisition cost)How much do you have to spend on marketing to get one new customer?= total costs spent acquiring customers / number of customers acquiredKPIs for content marketersFor many content marketers, the best KPI is also the simplest: publishing frequency. Focus on what you can control, work to publish more content each month, and other important metrics (like traffic) will follow after.Traffic growthHow many people visit your website? And how does that change over time?= ((current month’s traffic − previous month’s traffic) / previous month’s traffic​)×100Publishing frequencyHow often do you publish blog posts, schedule social posts, or hold webinars?= total number of published pieces / time period (e.g., posts per week or month)First 30-days trafficHow many people visit a new page or post in the first 30-days since launching?= count of unique visitors to the page or post within the first 30 days of its launch.Further reading2 Types of Content Marketing KPIs You Should Track (Separately)TipHow to estimate organic traffic growthGoogle Analytics and other analytics tools will give you the data needed to measure traffic growth for websites you own. For other websites—like your competitors—you can use Ahrefs to estimate their organic traffic growth.Head to Site Explorer, enter the website URL you’re interested in (setting the view to Path, Domain, or Subdomain, depending on which part of the website you’re analyzing), and choose the Monthly view for the Performance chart. Hover over the graph and you’ll see estimated organic traffic for each month.Here, Clickup.com saw an estimated 645,000 organic pageviews in January:Hovering over the next month, February’s organic traffic was an estimated 664,000 pageviews:Using our formula for traffic growth rate, we can work out that Clickup’s organic traffic grew an estimated 3% between January and February ( (664234 - 645286) / 645286) * 100) = 2.94%).You can also use the Portfolios feature to measure traffic growth to collections of specific URLs, like this portfolio of my published articles……allowing you to measure traffic growth by author, or topic, or content type:KPIs for lead generationLead generation is all about turning anonymous visitors into recognisable, contactable leads, usually by capturing their email addresses. Most of their KPIs measure the quantity and quality of the leads they generate:SQLs (sales qualified leads)How many leads have taken an action that indicates their desire to buy?= count of leads that meet the sales-qualified criteria set by the organization.MQLs (marketing qualified leads)How many leads have interacted with your marketing but are not ready to buy?= count of leads that meet the marketing-qualified criteria set by the organization.Conversion rateHow often do your visitors buy, or request a demo, or start a free trial?= (total number of conversions / total number of visitors or leads​)×100Further readingLead Generation: The Beginner’s GuideKPIs for social media marketersMost of these KPIs can be tracked across social media as a whole, but also on a per channel basis (for Twitter, and Instagram, and Facebook, and so on).Total followersThe total number of individuals following your social media profile or page.= sum of all followers across specified social media platforms.Total impressionsThe total number of times your content was displayed to users.= sum of all views or appearances of your content across platforms, regardless of clicks or engagement.Follower growth rateThe rate at which your follower count is increasing over a specific time period.= (number of new followers gained / number of followers at the start of the period) × 100KPIs for SEOsFor search professionals, organic growth is the goal. These are some of the KPIs most commonly used to measure their progress and present their value to the rest of the company:Keyword rankingsWhere do your pages rank in the search results for their target keyword?No math needed—just use a rank tracker like Ahrefs Rank TrackerBacklink growthHow often do other websites link to your website?= (current month’s backlinks − previous month’s backlinks) / previous month’s backlinks​)×100Organic Share of VoiceHow visible are you in search results compared to your competitors?No math needed—just use Ahrefs Share of Voice report (see below)Further reading12 SEO KPIs You Should (And Shouldn’t) TracktipHow to calculate share of voice for keywordsOne of the best ways to measure organic share of voice (SOV) is to track the number of clicks your website receives from important keywords, relative to the clicks your competitors receive. To get set up, add a list of important keywords into Rank Tracker, head to the Competitors overview tab and add the URLs of your competitors’ websites.You’ll see an estimate of your site’s share of the total available clicks for your given keywords, as well your competitors’ SOV, and recent trends in performance:Further readingWhat Is Share of Voice? How to Measure It Across ChannelsKPIs for email marketersSubscriber growth is arguably the core metric of most email marketers, but growth rates and engagement metrics also help determine the quality of the list and individual campaigns:Subscriber growth rateHow fast is your email list growing?= ((subscribers at end of period - subscribers at start of period) / subscribers at start of period) x 100Open rateHow many recipients opened the email?= (emails opened / (emails sent - bounces)) * 100CTR (click-through rate)How many recipients clicked on a link within the email?= (emails clicked / (emails sent - bounces)) * 100KPIs for PRTraditional press is usually concerned with the number of press mentions generated by a campaign, but add digital PR into the mix, and backlinks become another primary goal. Daria Samokish, Ahrefs’ Head of PR, tracks KPIs like:Number of press mentionsHow many news or media outlets referenced your latest campaign?= count of distinct press or media mentions of the campaign across various platforms.Number of campaign backlinksHow many websites linked back to your latest campaign?= count of unique external web pages linking back to the campaign’s specific page or content.Traffic spikes on launch dayHow many people interact with your campaign the day it’s launched?= count of visitors, clicks, or interactions on the campaign’s launch day.TipHow to measure the impact of digital PRAhrefs’ Site Explorer makes it easy to see how a digital PR campaign translates into new links. Here’s an example from the launch of our search engine, Yep.com.The Calendar view in Site Explorer shows a spike in new referring domains on June 4th 2022—the day of the press campaign—with 219 new referring domains registered (up from a daily average of 1–2 in May).You can also use Ahrefs’ Alerts to get an automated notification whenever you gain a new link. In the example below, we’ll get a weekly notification summarising all new backlinks for ahrefs.com/blog/ from websites with a domain rating of 80 or above:KPIs for event marketersShermin Lim, our Events & Marketing Manager, cares primarily about working out the return on investment from her online and in-person events, balancing the costs of the event and the potential gain from new leads and customers. Three of her core performance indicators are:AttendeesHow many people attended the event?= count of all individuals who registered and were marked present at the event.NPS (Net Promoter Score)Would attendees recommend the event to their friends and colleagues?= % of promoters − % of detractorsNew Sales LeadsHow many attendees talked to the sales team about purchasing or upgrading?= count of attendees who initiated a conversation or inquiry about purchasing or upgrading with the sales team.KPIs for paid marketersPaid marketing is as close to science as marketing tends to get, with a very clear (and measurable) relationship between the cost of an advert and the revenue it generates. But while paid marketing KPIs can get very mathsy, very quickly, there are three core metrics underpinning it all:ROAS (return on advertising spend)How much money is this ad generating, relative to the amount that was spent on it?= total conversion value / amount spentCPC (cost per click)How much does every advert click cost us?= total cost of clicks / total number of clicksCPM (cost per impression)How much does every thousand views of this advert cost us?= (total ad spend / total impressions ) ×1000KPIs for community managersMichelle Lindner manages our customer community. Her metrics focus on the growth and engagement of community members. She shared three of the key performance indicators she measures and reports on:New membersHow many people have joined the community recently?= count of members who joined during the specified period (e.g., the last week or month).30-day active membersHow many people have logged in to the community in the past 30 days?= count of unique members who logged in and were active in the last 30 days.Total post viewsHow many times were community posts viewed and interacted with by community members?= sum of all views and interactions (like comments, likes, etc.) on community posts.Final thoughtsMarketing KPIs can help you communicate your wins to bosses and teammates, pinpoint tactics that work well (and those that don’t), and provide a clear focal point for your marketing team to rally around.But there’s a caveat to remember: don’t ignore marketing opportunities that don’t fit neatly into your KPIs.Not every great marketing campaign can be easily measured. The goal of marketing is to grow your business. Use KPIs where they help… but don’t shy away from ignoring them on the rare occasions when they don’t. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Ryan Law Ryan Law is the Director of Content Marketing at Ahrefs. Ryan has 13 years experience as a writer, content strategist, team lead, marketing director, VP, CMO, and agency founder. He's helped dozens of companies improve their content marketing and SEO, including Google, Zapier, GoDaddy, Clearbit, and Algolia. He's also a novelist and the creator of two content marketing courses. Keep Learning 25 Marketing Metrics You Should Consider Tracking Choose the right marketing metrics, manage them over time and focus on growing your business’ profits. Here are 25 metrics you should consider tracking. AARRR Pirate Metrics Framework: What It Is & How It Works AARRR metrics framework, aka pirate metrics, is a set of metrics used to track and influence critical user behavior that can lead to growth. 17 Free Online Marketing Courses to Learn Digital Marketing After evaluating over 100+ free digital marketing courses, here are the 17 that made the cut. Marketing 101: Marketing Basics in Simple Words Introduction to marketing for small-business owners, solopreneurs, and beginner marketers. In under 15 minutes. Organic Marketing vs. Paid Marketing: What’s the Difference? Organic marketing is attracting traffic to a website without using paid advertising by creating and distributing valuable content.",
  "headers": [
    {
      "level": "H1",
      "text": "Marketing KPIs: 30 Metrics for Every Marketing Role"
    },
    {
      "level": "H2",
      "text": "KPIs for CMOs"
    },
    {
      "level": "H3",
      "text": "ROMI (return on marketing investment)"
    },
    {
      "level": "H3",
      "text": "LTV (lifetime value)"
    },
    {
      "level": "H3",
      "text": "CAC (customer acquisition cost)"
    },
    {
      "level": "H2",
      "text": "KPIs for content marketers"
    },
    {
      "level": "H3",
      "text": "Traffic growth"
    },
    {
      "level": "H3",
      "text": "Publishing frequency"
    },
    {
      "level": "H3",
      "text": "First 30-days traffic"
    },
    {
      "level": "H3",
      "text": "How to estimate organic traffic growth"
    },
    {
      "level": "H2",
      "text": "KPIs for lead generation"
    },
    {
      "level": "H3",
      "text": "SQLs (sales qualified leads)"
    },
    {
      "level": "H3",
      "text": "MQLs (marketing qualified leads)"
    },
    {
      "level": "H3",
      "text": "Conversion rate"
    },
    {
      "level": "H2",
      "text": "KPIs for social media marketers"
    },
    {
      "level": "H3",
      "text": "Total followers"
    },
    {
      "level": "H3",
      "text": "Total impressions"
    },
    {
      "level": "H3",
      "text": "Follower growth rate"
    },
    {
      "level": "H2",
      "text": "KPIs for SEOs"
    },
    {
      "level": "H3",
      "text": "Keyword rankings"
    },
    {
      "level": "H3",
      "text": "Backlink growth"
    },
    {
      "level": "H3",
      "text": "Organic Share of Voice"
    },
    {
      "level": "H3",
      "text": "How to calculate share of voice for keywords"
    },
    {
      "level": "H2",
      "text": "KPIs for email marketers"
    },
    {
      "level": "H3",
      "text": "Subscriber growth rate"
    },
    {
      "level": "H3",
      "text": "Open rate"
    },
    {
      "level": "H3",
      "text": "CTR (click-through rate)"
    },
    {
      "level": "H2",
      "text": "KPIs for PR"
    },
    {
      "level": "H3",
      "text": "Number of press mentions"
    },
    {
      "level": "H3",
      "text": "Number of campaign backlinks"
    },
    {
      "level": "H3",
      "text": "Traffic spikes on launch day"
    },
    {
      "level": "H3",
      "text": "How to measure the impact of digital PR"
    },
    {
      "level": "H2",
      "text": "KPIs for event marketers"
    },
    {
      "level": "H3",
      "text": "Attendees"
    },
    {
      "level": "H3",
      "text": "NPS (Net Promoter Score)"
    },
    {
      "level": "H3",
      "text": "New Sales Leads"
    },
    {
      "level": "H2",
      "text": "KPIs for paid marketers"
    },
    {
      "level": "H3",
      "text": "ROAS (return on advertising spend)"
    },
    {
      "level": "H3",
      "text": "CPC (cost per click)"
    },
    {
      "level": "H3",
      "text": "CPM (cost per impression)"
    },
    {
      "level": "H2",
      "text": "KPIs for community managers"
    },
    {
      "level": "H3",
      "text": "New members"
    },
    {
      "level": "H3",
      "text": "30-day active members"
    },
    {
      "level": "H3",
      "text": "Total post views"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Ryan Law"
}