{
  "url": "https://ahrefs.com/blog/marketing-activities/",
  "slug": "marketing-activities",
  "title": "Top 5 Types of Marketing Activities You Need to Know",
  "description": "Five marketing activities that stand out from the rest, and five successful companies that can thank themselves for investing in them.",
  "content": "Mateusz Makosiewicz Marketing researcher and educator at Ahrefs. Mateusz has over 10 years of experience in marketing gained in agencies, SaaS and hardware businesses. When not writing, he's composing music or enjoying long walks. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Marketing activities are actions an individual or organization undertakes to develop and promote their products or services.While there are many different types of marketing activities, some seem to stand out from the rest by bringing great results for various businesses and standing the test of time. In this article, I’ll show you five types of such marketing activities and five companies that tested them in real-life conditions.Contents1. Product-market fitAchieving product-market fit (PMF) means making sure a product can satisfy an existing demand in a market with high potential. Basically, a telltale sign of achieving PMF is when people are willing to buy your product, actively use it, and recommend it to others.Why it’s important There are two reasons:Without product-market fit, it’s unlikely a company can build a great product that answers consumers’ needs and wants.Without such a product, no marketing tactics can generate sufficient demand to support the company.To illustrate, a company tries to sell a new type of hydrogen car, but there are no hydrogen stations nearby. If that’s the case, what kind of marketing can convince a customer to buy that car? That product just won’t fit the market.That is why achieving PMF matters the most. Without it, you can’t build sustainable growth, and scaling anything simply won’t make sense. You’ll just waste your time and money.In other words, a PMF is to a business what foundations are to a house. ExampleFinding product-market-fit is how Spotify started—a business valued at $54 billion today.Instead of going for a “big bang” launch with a perfect product that has all the features people dream of, Spotify creators decided to build a minimum viable product (MVP) and test it similar to how a scientist tests a hypothesis. An MVP is a “product development” phase in which you test whether the core functionality of your product can satisfy the market demand by interacting with real users. And here’s the approach they took, explained in a drawing by Henrik Kniberg (he was involved in the early stages of the company). Translation: An MVP (or the “earliest testable/usable/lovable product,” as Henrik prefers to call it) is about offering the earliest version of a product that can satisfy users’ needs and iteratively working your way up to something great.In Spotify’s case, here’s how the metaphorical skateboard looked like:This MVP was designed to test the idea of streaming music and its performance with consumer technology.The team didn’t even run complex market research to test those aspects. Initially, team members just needed some feedback from family and friends. Afterward, they took that MVP to record labels and convinced them to put music on the platform.TakeawayFind the product market before scaling any other operations. And that includes marketing.The market always wins, and you can save yourself a lot of time and money learning what it “wants” as soon as possible—just as Spotify did.2. Word-of-mouth marketingInspiring word of mouth refers to word-of-mouth marketing (WOMM), i.e., the process of influencing and encouraging discussions about a product, service, or company.To put it simply, influencing word of mouth is about giving people a reason to talk.WOMM may sound like some old-fashioned theory, but note that digital era has given us new, measurable forms of word of mouth:Conversations and shares on social mediaUser reviews on sites like G2 or, Capterra, etcUser-generated content about brands and their products (e.g., photos on Instagram with a branded hashtag)Word of mouth is a powerful marketing channel that may feel elusive . Yet it’s not entirely out of control. Because while marketers can’t control what people say about their brands, they can inspire brand-related conversations and even recommendations. It boils down to delighting users with the product and generating positive experiences.Why it’s important88% of respondents trust recommendations from people they know (Nielsen).Therefore, word-of-mouth is probably the most trustworthy and authentic marketing channel.Also, positive word of mouth is one of the signs of achieving PMF, as discussed in the section above. ExampleMany companies have used that channel to grow and sustain their business: Tesla, Github, Evernote, Uber, etc. Fortunately, we can speak from our own experience here. Ahrefs is a nine-figure ARR company, and word of mouth is one of our top three customer acquisition channels. So how do we influence word of mouth? The most important component is the product. For many people, Ahrefs is the go-to toolset for SEO. Some like it enough to say things such as: That’s why we never stop improving Ahrefs. People see that and appreciate our effort enough to recommend our tools to others:You better calm down with these 🔥 updates or I’m gonna have to recommend you more than I already do — Patrick Herbert (@PatrickHerbert0) December 1, 2021And if you’ve got a complex product like ours, you also need to put a lot of effort into educating your audience. That’s what we do with articles and videos on this blog, on our YouTube channel, and in our Academy. These types of content are also a tried-and-tested way to inspire some word of mouth:I’m making a Resources page for my site and need suggestions for others’ content on inbound marketing!I’m including links to: @annhandley’s fantastic newsletter@ahrefs’ incredible blog and free toolsThe @Hubspot Inbound Marketing/Sales coursesWhat else should I include?— Ashley Ashbee (@ashley_ashbee) November 8, 2021 This brings us to creating positive experiences via marketing.Positive experiences captivate your customers and followers and help ensure those experiences will be shared. One example of this is handing people free swag:Hey @ahrefs @maysoonhere & @timsoulo! Thanks for optimizing my Friday, my t-shirt collection and my coffee. Incredible packaging. It arrived in the cold north. Worn with pride! pic.twitter.com/Cs3QSzbZzV— Massive Kontent (@MassiveKontent) March 22, 2019 Gestures like this can later be noticed by influencers and mentioned in social media conversations:@ahrefs t-shirts. They just say tshirt on the front, but anyone who knows ahrefs will recognize it. They only way to get one is to win it, usually by being knowledgeable about their subject (SEO). Having one reps their brand *subtly* but also marks you as experienced. Brilliant. pic.twitter.com/ybMso3CV7b— Kris Roadruck (@KrisRoadruck) January 24, 2021 Also, doing something important or highly regarded by your audience can spread quite fast:We’ll be reallocating our paid traffic budget (~$200k💰) for December away from the Google/Facebook—and into sponsoring the industry’s best creators and thought leaders. — Ahrefs (@ahrefs) November 24, 2021TakeawayWord of mouth has been the key to success for many companies. And it’s not a coincidence. Recommendations from customers have their weight in gold, and the only “costs” are improving your product, educating your audience about it, and leaving a trace of positive experiences.3. Content marketingAll marketers face the same challenge: how to attract people and convert them to customers. Of course, there is no silver bullet for that.But if there’s one type of marketing that comes close, it’s content marketing.Content marketing is the process of creating and distributing content to attract and retain customers, so you can increase revenue and ultimately grow your business.Why it’s importantContent marketing is important because it simultaneously does these three things (among others):Drive the entire marketing funnelBring compounding resultsReinforce itselfLet’s unpack this using Ahrefs’ content marketing machine as an example. ExampleBy driving the entire marketing funnel, I mean that our content, in the form of blog posts, videos, cheat sheets, etc., can serve many different purposes when it comes to communicating with a target audience.For example, a blog article can generate awareness by pulling people from a SERP to Ahrefs’ blog.Another piece of content, e.g., a video, may show a step-by-step process of solving an SEO problem, thus making people more interested in Ahrefs’ product and eventually willing to try it.And it gets even better. Often, a single piece of content can serve multiple stages of the funnel:One of the most powerful things about content is its potential to pull people from search engines like Google. Here’s how that works:We create SEO content based on search demand and the business value of a particular topic.Someone searches for a solution to an SEO or marketing problem via a search engine like Google.If our content ranks high enough, they read/watch our content that shows how to solve the problem through our product.If the content is convincing, it may make them want to try our product.Search demand and business value mentioned in the first point are absolutely vital to the success of the whole operation. Without them, not enough people would find our brand through content, and wouldn’t be able to feature our product adequately.This brings us to the compounding results of content marketing.Through the systematic publishing of content, our blog articles generate an estimated 326.7K visits per month—and that’s from organic search alone.Data via Ahrefs’ Site Explorer.Every new article we publish adds to that result. And so, an article posted two weeks ago will bring new traffic, adding to the traffic generated by a blog post we published years ago.For example, this article about top Google searches was published in 2017 and still generates traffic.The third special benefit of content marketing is it has the ability to reinforce itself. Meaning, it is easier to get results the more you do it because every additional action you take adds to the momentum.Marketers call it the flywheel effect. The first push is the hardest. But as the “wheel” builds momentum, that same push will make the wheel spin a lot faster (i.e., think about how a salad spinner works).To illustrate, this is what happens when you invest in long-term content marketing:If your content is good, people will recommend it, bringing in more readers. Chances are, the same people will come back to your blog to read your next article.Each new post has a greater potential audience than the previous one because it borrows from the readership of past articles and pulls new readers from SERPs.You’re getting backlinks, which are one of the most important ranking factors. As a result, your content ranks higher on SERPs, thus bringing more visitors and building your authority on the topic (another important ranking factor).As content gains links and ranks higher, it gets even more links, as more people are willing to link to a page with a higher ranking.Now you can link from your old content to your new content, passing on link equity. Your content then ranks higher and gets more readers. Those readers will bring new readers and new links. The cycle continues, and the flywheel gains momentum. Of course, it’s easier said than done. But this is how content marketing contributed to making Ahrefs what it is today. If you want to learn more about building a content marketing machine like ours, check out these guides:How to Create a Winning Content Strategy How to Scale Content Creation 🚀🌙 TakeawayContent marketing is very powerful. It can even function as a standalone, self-sufficient marketing tactic.Content allows you to attract new customers, nurture your leads, and educate your customers—sometimes even with the same piece of content. And it works best when you do it with organic search in mind.4. Brand communityA brand community is a micro social media platform maintained by a brand where its fans and customers can come to ask questions, exchange thoughts and interact directly with the brand. Why it’s importantThe main reason why branded communities are important is activating and retaining users. This means that a community can help people learn how to effectively use a product and can thus help to decrease churn. Other benefits include:Getting valuable feedback from usersA direct marketing channel; can be used for announcing product updates, for instanceInspire conversations that go beyond the community (increased word-of-mouth)Creating added value (especially if competitors don’t offer it)Strengthening brand loyaltyGenerating brand awareness (in case of external communities open to anyone, like in our example below). ExampleIf you ever wondered how much a community built around a brand and its products could be worth to a business, Adobe answered that in 2012 by acquiring Behance for about $150 million. That is how much Adobe, the creator of Photoshop, paid to “transplant” a platform that had gathered 1 million active users and generated 90 million project views monthly. Let’s give the floor to Heidi Voltmer, Adobe’s then-product marketing director, to explain why the company was in need of a solution like Behance: We have tools, we have services, and if you’ve got all those things, you also need inspiration, you need to get that spark. … By bringing in Behance, we’re rounding out our offering and making this a one-stop destination for creative professionals.Inspiring people to use a product (i.e., activating and then retaining users) is a common problem relating to productivity tools, and Adobe’s products were no exception. Adobe had the best graphic design tools in class but still lacked something that would make people use those tools more frequently and effectively.A user community is a great solution for that. Each new project uploaded to the platform can inspire multiple people to use Adobe’s products and encourage them to upload their own work. This, in turn, enriches the platform with more user-generated content and potentially inspires another group of people. And we’re talking here about an endless stream of user-generated content: Since Adobe now owns the platform, it can insert its logo and pitch its products in strategic places. Here are a few examples, starting from the welcome email:While creating an account on Behance is free, Adobe tries to put users on a conversion path ASAP. By clicking on the link in the image above, users are directed to a landing page where they can create a portfolio page that comes free with Adobe’s Creative Cloud paid solution:Then, on the Behance platform itself, there’s a whole lot of Adobe’s branding:When we put it together with just the organic traffic this platform currently gets, we suspect that Behance is worth even more than what Adobe paid for it.Data via Ahrefs’ Site Explorer.TakeawayFor Adobe, a community connected to its brand was worth $150 million. And it’s not the only company that has invested heavily in this marketing asset.A branded community can be a source of many benefits. These include giving a company the ability to monetize traffic, get valuable feedback, and gain a new, direct marketing channel.5. Market researchMarket research is the process of gathering, analyzing, and interpreting information about a given market. This is how marketers source crucial data for their marketing strategy, e.g., insights about potential customers, the competition, and industry trends. Here are some popular market research methods: Interviews – Conduct face-to-face discussions with your users, potential customers, and other people with insight into your market (e.g., distributors). Surveys – One of the most popular and cost-effective market research methods. Often done online. Surveys involve polling on things like feature desirability and user satisfaction. Competitive analysis – By analyzing your competitors, you can quickly find out what works in your market and what doesn’t. Also, competitors make a great benchmark. Commercial data – Think market reports and industry insights. You can learn things like the size of your market, market trends, and insights from people involved in your industry.Why it’s importantMarket research is the cornerstone of a marketing strategy - the business’s overall game plan for reaching consumers and turning them into customers.It provides you with fundamental data for making the most important decisions you can make in marketing. ExampleWhen it comes to companies that owe their success to market research, LEGO is a truly noteworthy example.In one of its research studies, the company found that only 9% of its users are female. LEGO understood that it had addressed that market segment wrong for decades.But since a problem is an opportunity in disguise, LEGO set out to discover how it could approach that underserved market better.It rolled out a massive study involving 3,500 girls and their mothers to understand the girls’ playing habits. It took LEGO four years to complete the study.It found out that girls appreciate a different kind of playing experience. Namely, different kinds of scenarios (e.g., hair salons instead of police stations), more vibrant colors, and more expressive figurines than the LEGO classics. And so LEGO Friends was born in 2012.Despite some criticism for the alleged reinforcing of gender stereotypes, the new product line became an instant hit. Today, LEGO Friends remains one of the biggest LEGO successes to date.In the year the set launched, the company’s net profit rose 35%. And in the following years, Friends became one of the top five selling LEGO themes. TakeawayWhether you’re trying to fix a problem in your marketing or looking for new opportunities in the market, chances are your answers are already out there. But you won’t find them until you reach for market research methods—a lesson we can learn from LEGO.It’s worth noting that market research doesn’t have to be a huge, expensive project. It can also be done in a cost-effective, agile way.Further readingMarket Research: What It Is and How to Do ItFinal thoughtsSeeing so many companies investing in these activities with great results, I think marketers should either try them at some point or have a really well-argued case for not doing them.Naturally, these are not the only effective marketing activities out there. Here are a few more resources that feature other marketing ideas and tactics you can draw inspiration from:Demand Generation 101: 5 Strategies That Work 10 Lead Generation Tactics That Work (With Examples) 11 Creative Marketing Ideas (Suggested by 18 Marketers) 11 Common Types of Marketing (Examples Included) Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Mateusz Makosiewicz Marketing researcher and educator at Ahrefs. Mateusz has over 10 years of experience in marketing gained in agencies, SaaS and hardware businesses. When not writing, he's composing music or enjoying long walks. Keep Learning 18 Common Types of Marketing (Examples Included) Learn about the 18 different types of marketing you can use to grow your business. 9 Key Types of Marketing Campaigns and Successful Examples “Let’s do a marketing campaign!” Marketers hear that a lot, but it’s easier said than done. For starters, check out these 8 types of marketing campaigns. Indirect Marketing: Definition, Types, & Examples An overview of indirect marketing. Learn what it is, its pros and cons, and see examples of companies that succeeded with it. Top-of-the-Funnel Marketing Explained: How to Attract Customers Our actionable guide to top-of-the-funnel marketing, which helps get your brand in front of new potential customers. 10 Types of Blog Posts & How to Use Them Effectively Choosing the right type of blog post depends on the goal of the article and what your audience wants. Here are 10 popular ones.",
  "headers": [
    {
      "level": "H1",
      "text": "Top 5 Types of Marketing Activities You Need to Know"
    },
    {
      "level": "H2",
      "text": "1. Product-market fit"
    },
    {
      "level": "H3",
      "text": "Why it’s important"
    },
    {
      "level": "H3",
      "text": "Example"
    },
    {
      "level": "H3",
      "text": "Takeaway"
    },
    {
      "level": "H2",
      "text": "2. Word-of-mouth marketing"
    },
    {
      "level": "H3",
      "text": "Why it’s important"
    },
    {
      "level": "H3",
      "text": "Example"
    },
    {
      "level": "H3",
      "text": "Takeaway"
    },
    {
      "level": "H2",
      "text": "3. Content marketing"
    },
    {
      "level": "H3",
      "text": "Why it’s important"
    },
    {
      "level": "H3",
      "text": "Example"
    },
    {
      "level": "H3",
      "text": "Takeaway"
    },
    {
      "level": "H2",
      "text": "4. Brand community"
    },
    {
      "level": "H3",
      "text": "Why it’s important"
    },
    {
      "level": "H3",
      "text": "Example"
    },
    {
      "level": "H3",
      "text": "Takeaway"
    },
    {
      "level": "H2",
      "text": "5. Market research"
    },
    {
      "level": "H3",
      "text": "Why it’s important"
    },
    {
      "level": "H3",
      "text": "Example"
    },
    {
      "level": "H3",
      "text": "Takeaway"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Mateusz Makosiewicz"
}