{
  "url": "https://ahrefs.com/blog/meta-keywords/",
  "slug": "meta-keywords",
  "title": "Meta Keywords: What Are They and Should You Use Them?",
  "description": "Meta keywords are meta tags that you can use to give search engines more information about a page's content. But should you use them?",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Meta keywords are meta tags that you can use to give search engines more information about a page’s content. They’re found in a webpage’s HTML source code, and are not visible to visitors.Here’s an example of a meta keywords tag:<meta name=\"keywords\" content=\"seo, search engine optimization\"/>It’s easy to add meta keywords in most website builders and CMS’, but should you bother?Do you still need meta keywords?Other use cases for meta keywordsHow to remove meta keywordsDo you still need to use meta keywords?Google hasn’t used the meta keywords tag to help rank web pages for at least a decade. We know this because Matt Cutts, Google’s former Head of the Webspam Team, released a video in 2009 where he said:[…] we don’t use the keywords meta tag in our search rankingFast-forward to 2020, and according to a recent Twitter poll by Bill Slawski, most SEO professionals no longer use the meta keywords tag.Do you still use meta keywords tags on pages you optimize?— Bill Slawski ⚓ (@bill_slawski) May 29, 2020However, it’s important to remember that there’s more to SEO than Google, so there are a couple of reasons why you might still want to use the keywords meta tag.1. It may still be used by YandexYandex is the Internet’s largest Russian search engine, with a market share roughly equal to that of Google’s in Russia. Their official documentation states that meta keywords “Can be used when determining the page’s relevance to search queries.”Does this mean that meta keywords are a proven ranking factor in Yandex search? No. But as that page has only been live since late-2018, the information is likely still accurate.Even so, as one person mentioned on Twitter, it’s probably a low-weight factor.“Officially” they say they still do, but I think this is a very low weight factor, even for яндекс. This is the consensus among most of us who have done SEO in Russian 🙂https://t.co/RrNAmzR0Vb— orun bhuiyan (@orvn) May 29, 2020If you’re curious about other search engines, it looks like none of the major ones use meta keywords:BingIn 2014, Bing stated in a blog post that the meta keywords tag is “dead in terms of SEO value.” This was effectively confirmed in 2020 when Bing’s Head of Evangelism tweeted the same thing.The meta keyword tag is dead in terms of SEO value for @BingWMC. We exclude it and ignore it. @CoperniX @facan— Christi Olson (@ChristiJOlson) May 29, 2020However, in 2011, Bing hinted that it could be used as a spam signal to help identify low-quality pages. It’s unknown whether that’s still the case, but it’s definitely not a ranking factor.BaiduIn 2012, a Baidu engineer stated in their webmaster community that “Meta keywords have long been in the garbage heap of history, and we will ignore them directly.”However, on a page updated in April 2020, they say:Title, description and keywords are important for Baidu to evaluate page’s value.As it makes sense to trust the most recent information, it seems the keywords meta tag could be a ranking signal in Baidu.NaverAccording to Wikipedia, Naver handles 74.7% of all web searches in South Korea. And while we couldn’t find a definitive statement about their use of the meta keywords tag, there’s zero mention of meta keywords throughout their extensive documentation on optimizing your website.Given that fact, we can assume it’s either not used or is a very low-weight factor.2. It’s used for some internal site searchesMost popular CMS’ don’t use the meta keywords tag for internal site searches, but some internal search systems can, including SOLR, Algolia, and ones built on Elasticsearch.If any of these power your internal search, you might need to use the keywords meta tag.Other use cases for meta keywordsYou’ve probably realized by now that most people don’t need to use the keywords meta tag, but there are a couple of things you can use it for.1. Create an internal tagging systemMany CMS’ and website builders make it easy to add meta keywords to pages, as do many free WordPress SEO plugins. This makes it easy to ‘repurpose’ the tag for an internal keyword tagging system. Just set the tag as your target keyword on each page.For example, if our page’s target keyword was “SEO tips,” it’d look like this:<meta name=\"keywords\" content=\"seo tips\"/>If you do this on every page, it’ll be easy to check whether you’ve already targeted a keyword in the future. Just crawl your site with an auditing tool like Ahrefs’ Site Audit, then use Page Explorer to look for pages with your keyword in the meta keywords tag.There are three reasons it can be useful to do this:Help prevent keyword cannibalization. Keyword cannibalization is where a website targets the same keyword across multiple pages. It can cause all kinds of issues, like undesirable pages outranking desirable pages.Avoid overlapping work. If you work in enterprise SEO, there are probably many people and teams working on similar things. Having an internal keyword tagging system helps prevent multiple teams from targeting the same keyword.Find collaboration opportunities. If you see that you’re not ranking well for one of your keywords, you might want to collaborate with another team to improve and update your content.Just know that there’s one potential downside to using the meta keywords tag for this purpose, which we’ll talk about in the next section.2. Find ‘seed’ keywords from competitorsBill Slawski’s recent Twitter poll shows that roughly 33% of people still use the keywords meta tag. As some of those people will undoubtedly be your competitors, this can come in quite handy for finding ‘seed keywords’ during keyword research. Just look for the keywords meta tag on your competitor’s homepage.For example, here’s the keywords meta tag for the homepage of a popular toy store:It lists a bunch of toy-related keywords like toys, climbing accessories, climbing frames, games, inflatables, pre school, sandboxes, slides, etc.Paste any relevant ones into a keyword research tool like Ahrefs’ Keywords Explorer and choose a keyword ideas report. You’ll find thousands or even millions keyword ideas—complete with estimated monthly search volumes and SEO metrics.You can use the inbuilt filters to narrow your search.For example, here are all the keywords related to hand puppets with low Keyword Difficulty scores.Just know that you might need to check a few sites before you find any useful seed keywords because many fill their keywords meta tags with junk or leave them empty.How to remove meta keywordsGiven that you can use the meta keywords to ‘spy’ on your competitors’ keywords, they can also do the same for you. For that reason, unless you have a legitimate reason to use it, you might want to remove any lingering meta keywords from your website.But first, you need to find them…You can do this for free with Ahrefs Webmaster Tools. Just sign up, crawl your website with Ahrefs’ Site Audit, then use these filters in Page Explorer:You’ll see a list of all pages on your website that have a meta keywords tag.If there are no results, there are no pages with the tag.From there, all you need to do is run through and remove the tags from any offending pages.Just know that this probably isn’t worth doing if you have a big website with keywords meta tags on every page. However, if you see the same meta keywords across all pages, chances are it’s being pulled from one location in your CMS or template/theme. In which case, you can likely remove it from all pages by editing just one piece of code.That said, it’s worth noting that having meta keywords tags on your site is unlikely to have a negative SEO impact. Unless you’re overly concerned about competitors ‘stealing’ your keywords, your time is probably better spent elsewhere.Final thoughtsFor 99.9% of people, the meta keywords tag is useless, and filling it out is a waste of time. You should only use it if you have a particular reason to do so, like using it for an internal keyword tagging system or an internal site search.Other meta tags like your title and meta description deserve more attention.Got questions? Ping me on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Keep Learning Meta Tags for SEO: A Simple Guide for Beginners Meta tags are snippets of code that tell search engines important information about your web page, such as how they should display it in search results. How Often Does Google Rewrite Meta Descriptions? (New Data Study) We compared hardcoded meta descriptions with the actual Google snippets on desktop for 20,000 keywords. Here's what we found. How to Write the Perfect Meta Description The meta description is an HTML attribute that describes what a page is about. It can appear in search results as a snippet under the title. LSI Keywords: What are They and Do They Matter? People say that LSI keywords have the power to boost Google rankings. Is this true, or is it yet another SEO myth? How Many SEO Keywords Should a Page Really Target? Pick just one primary keyword and enough secondary keywords to cover a given topic in full. Here’s why and how.",
  "headers": [
    {
      "level": "H1",
      "text": "Meta Keywords: What Are They and Should You Use Them?"
    },
    {
      "level": "H2",
      "text": "Do you still need to use meta keywords?"
    },
    {
      "level": "H3",
      "text": "1. It may still be used by Yandex"
    },
    {
      "level": "H4",
      "text": "Bing"
    },
    {
      "level": "H4",
      "text": "Baidu"
    },
    {
      "level": "H4",
      "text": "Naver"
    },
    {
      "level": "H3",
      "text": "2. It’s used for some internal site searches"
    },
    {
      "level": "H2",
      "text": "Other use cases for meta keywords"
    },
    {
      "level": "H3",
      "text": "1. Create an internal tagging system"
    },
    {
      "level": "H3",
      "text": "2. Find ‘seed’ keywords from competitors"
    },
    {
      "level": "H2",
      "text": "How to remove meta keywords"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Joshua Hardwick"
}