{
  "url": "https://ahrefs.com/blog/meta-description-study/",
  "slug": "meta-description-study",
  "title": "How Often Does Google Rewrite Meta Descriptions? (New Data Study)",
  "description": "We compared hardcoded meta descriptions with the actual Google snippets on desktop for 20,000 keywords. Here's what we found.",
  "content": "Michal Pecánek SaaS SEO consultant with over 6 years of experience. Before going freelance, Michal was an SEO & Marketing Educator at Ahrefs–creating content for the blog and managing a team of guest writers. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Meta descriptions aren’t a ranking factor, but they can entice more clicks—and that leads to more traffic.That said, you’ve probably noticed that Google doesn’t always use the hardcoded meta description. It sometimes chooses a different snippet from the page.If you’ve spent time crafting an enticing meta description, this can be annoying.But how often does it happen?To find out, we compared hardcoded meta descriptions with the actual Google desktop snippets for 20,000 keywords.But first, an interesting fact…New to on-page SEO? Check out ourBeginner’s guide to on-page SEO25.02% of top-ranking pages don’t have a meta descriptionCrazy, right?!Here’s the breakdown by ranking position:For anyone wondering, the Spearman correlation here is 0.28, which is considered weak.Still, for those with descriptions, how often do they show up?Google rewrites meta descriptions 62.78% of the timeYes–Google rewrites meta descriptions for the majority of search results.This already tells us quite a lot, but it’s always more insightful to segment the data…That number drops to 59.65% for fat-head and rises to 65.62% for long-tailsWe hypothesized that Google would generate descriptions more often for long-tail keywords.This was based on the fact that the average first-page result ranks for hundreds of keywords, and the hardcoded descriptions are usually written around the primary “head” keyword.For example, our primary target keyword for this post is “youtube keyword tools”—so we wrote the meta description with that in mind.As a result, Google shows our hardcoded description in the results for the target keyword…… but not for some of the long-tail keywords the post ranks for:This happens because the hardcoded description is less relevant for the long-tails. It makes more sense for Google to choose its own snippet.But, what we found surprised us:While Google is more likely to rewrite meta descriptions for long-tail keywords, it’s only by a small margin.My guess is that the gap will grow over time as Google gets better at understanding search intent and subsequently providing the most relevant search snippets.Sidenote. Our methodology isn’t perfect here, as there’s no way to identify fat-heads and long-tails with 100% certainty. Learn more here.Google is slightly less likely to rewrite meta descriptions that truncateGoogle truncates meta descriptions that are too long.But does this affect the chance of Google rewriting them? In other words, is Google more likely to generate its own snippet when your meta description is too long?Let’s look at the data:The results here are pretty much equal. Google rewrote 61.46% of meta descriptions that were too long and 63.69% of the rest.Surprisingly, it seems that keeping your meta descriptions within limits doesn’t change the probability of Google rewriting them much.Perhaps that’s because long descriptions are surprisingly common. 40.61% of 192,656 unique pages’ descriptions we studied were too long.Should you still bother writing meta descriptions?Yes. Relevant and compelling meta descriptions entice clicks, so they’re still worth writing—even though they’re only shown only 37% of the time, on average.That said, if your site is huge, it pays to prioritize pages that:Already get organic trafficWere created to rank in GoogleAre likely to get shared on social media (where the meta description will be used for the social snippet description in the absence of OG tags)Taking this approach should have the most impact for the least amount of work.Ping me on Twitter if you have any comments. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Michal Pecánek SaaS SEO consultant with over 6 years of experience. Before going freelance, Michal was an SEO & Marketing Educator at Ahrefs–creating content for the blog and managing a team of guest writers. Keep Learning How long does it take to rank in Google? (A study by Ahrefs) Our research will answer the most popular question in SEO world: \"How long does it take to rank in Google?\" Another number-driven study from Ahrefs. Meta Tags for SEO: A Simple Guide for Beginners Meta tags are snippets of code that tell search engines important information about your web page, such as how they should display it in search results. How to Write the Perfect Meta Description The meta description is an HTML attribute that describes what a page is about. It can appear in search results as a snippet under the title. Meta Keywords: What Are They and Should You Use Them? Meta keywords are meta tags that you can use to give search engines more information about a page's content. But should you use them? SEO Pricing: How Much Does SEO Cost? 439 People Polled Did you know that 78.2% charge a monthly retainer? Learn more insights from our survey of 350 SEO professionals.",
  "headers": [
    {
      "level": "H1",
      "text": "How Often Does Google Rewrite Meta Descriptions? (New Data Study)"
    },
    {
      "level": "H2",
      "text": "25.02% of top-ranking pages don’t have a meta description"
    },
    {
      "level": "H2",
      "text": "Google rewrites meta descriptions 62.78% of the time"
    },
    {
      "level": "H2",
      "text": "That number drops to 59.65% for fat-head and rises to 65.62% for long-tails"
    },
    {
      "level": "H2",
      "text": "Google is slightly less likely to rewrite meta descriptions that truncate"
    },
    {
      "level": "H2",
      "text": "Should you still bother writing meta descriptions?"
    }
  ],
  "author": "Michal Pecánek"
}