{
  "url": "https://ahrefs.com/blog/monitor-and-track-changes-on-a-website/",
  "slug": "monitor-and-track-changes-on-a-website",
  "title": "How to Monitor and Track Changes on a Website?",
  "description": "Learn how to detect changes to the content of pages on your website.",
  "content": "Nick Churick Nick is one of our Product Marketers and coincidentally he's also a pretty skilled writer. So there you have it - he's now a regular contributor to our blog. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents There are a plethora of tools available online that can monitor various aspects of your website, such as traffic, search rankings, speed, uptime, SEO health, etc.However, finding the right tool to monitor unauthorised edits to website content, such as page titles, texts, or external outgoing links, can be much more challenging.Fortunately, if you have an active Ahrefs subscription or use the free Ahrefs Webmaster Tools, you already have access to the necessary toolset.Unlike other SEO crawlers, Ahrefs’ Site Audit is extremely flexible in every aspect.It checks your website for a large set of predefined SEO issues. However, with the hundreds of fields available in its advanced filter, and the ability to compare crawls, you can create and monitor your own custom issues. You can use them to spot changes to your website content.Of course, the first step is to set up a project in Site Audit and schedule regular crawls for your website.How monitor changes to the pages’ titlesOpen the Page explorer, access the advanced filters. There, select “Title” -> “Changed.”This will show the pages whose title tags have changed compared to the previous crawl.Then, save this filter as a custom issue: Here’s what it will look like in the Site Audit Overview, and, importantly, in email alerts.How monitor changes to the page textsThere’s a dedicated filter for that too.In the Advanced filters of the Page explorer, select “Page text” -> “Changed.”Don’t forget to save it as a new issue.You can do that for the competitor’s’ websites too to detect edits on their pages.How detect new outgoing linksHere’s a filter that makes it easy to spot if someone has edited an existing page to add a new link to an external website:How to see the changesNaturally, it’s not enough to be informed about the change. You’ll likely want to see what exactly changed on a page. Site Audit can quickly show you that.In page explorer, simply click on the URL to access its details, then navigate to ‘View source.’ From there, you can compare the current page text or source code with that of previous crawls.This is just a tiny portion of what you can achieve with the advanced filters. I encourage you to check them all out to discover many more use cases for your website.For example, did you know that you can even search through the source code of the entire website? Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Nick Churick Nick is one of our Product Marketers and coincidentally he's also a pretty skilled writer. So there you have it - he's now a regular contributor to our blog.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Monitor and Track Changes on a Website?"
    },
    {
      "level": "H2",
      "text": "How monitor changes to the pages’ titles"
    },
    {
      "level": "H2",
      "text": "How monitor changes to the page texts"
    },
    {
      "level": "H2",
      "text": "How detect new outgoing links"
    },
    {
      "level": "H2",
      "text": "How to see the changes"
    }
  ],
  "author": "Nick Churick"
}