{
  "url": "https://ahrefs.com/blog/monthly-digest-roundup/",
  "slug": "monthly-digest-roundup",
  "title": "The Best of Ahrefs’ Digest: June 2024",
  "description": "Discover our favourite reads from the past month.",
  "content": "Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Every week, we share hot SEO news, interesting reads, and new posts in our newsletter, Ahrefs’ Digest.If you’re not one of our 275,000 subscribers, you’ve missed out on some great reads!Here’s a quick summary of my personal favorites from the last month:Best of June 2024An Anonymous Source Shared Thousands of Leaked Google Search API Documents with Me; Everyone in SEO Should See ThemAuthor: Rand Fishkintl;drSomeone shared with Rand more than 2,500 pages of API documentation containing 14,014 attributes (API features) that appear to come from Google’s internal “Content API Warehouse.”My takeawayOf course, the biggest articles in June have to do with the Google leak. Here’s what I learned from the documents:Google appears to have ways to filter out clicks they don’t want to count in their ranking systems, and include ones they do. They also seem to measure the length of clicks.Google uses Chrome to generate clickstream data.Google uses whitelists for sensitive topics like travel, COVID, and politicsScores and data generated by EWOK’s quality raters may be directly involved in Google’s search system, rather than simply a training set for experiments.Google uses click data to determine how to weight links in rankings.Secrets from the Algorithm: Google Search’s Internal Engineering Documentation Has LeakedAuthor: Mike Kingtl;drRand shared the documents with Mike King and he did a deep dive into the leaked documents.My takeawayMy quick takeaways from this lengthy article (you might need a pot of coffee to finish it):Yes, Google uses clicksYes, looks like there is a Google sandbox.Google Documents Leaked & SEOs Are Making Some Wild AssumptionsAuthor: Patrick Stoxtl;drThe problem with the SEO industry—everyone will take a tiny grain of something and turn it into some larger truth. Patrick sets the record straight.My takeawayJust because something is in the leaked API docs, doesn’t mean it’s a Google ranking factor. What is more likely is that SEOs are making assumptions that favor their own opinions and biases.How Recent Google Updates Punish Good SEO: 50-Site Case StudyAuthor: Cyrus Shepardtl;drCyrus Shepard ran a study to see if recent Google updates are targeting common SEO practices.My takeawayHere’s what was found:Losing sites were far likelier to have more anchor text variations per page than winning sites.Losing sites appeared to be updating their content more frequently (yes, more!) than winning sitesOn average, losing sites used more structured data than winning sites.On Writing Better: 43 Things I Learned from My Insane 2 Years of StudyAuthor: Nat Eliasontl;drNat Eliason quit all his work commitments and went all-in to make his new book, Crypto Confidential a great one. He distilled everything he learned into this article.My takeawaySome tips I loved:Yes But, No And — A character should never get exactly what they want or what they’re trying to get in a scene. Instead, they either SHOULD get what they want BUT it has some unexpected consequence. Or they should NOT get what they want AND it should have some additional unexpected consequence.Do mini-writing projects to build specific skills, like writing emotional situations or dialogue.Before you send something off for edits from anyone, write down what you think they’ll say is wrong with it, then compare.Readers are right that something is wrong, but wrong about how to fix it (unless they’re a professional themselves.)Don’t edit the draft within the existing doc. Make a new document and start from the beginning.Best of May 2024HouseFresh Has Virtually Disappeared From Google Search Results. Now What?Author: Gisele Navarro, Danny Ashtontl;drHouseFresh’s update to their previous article on how Google is killing independent sites (featured in March).My takeawayMajor publishers are using an SEO content strategy called “keyword swarming” to drown out smaller sites. Here’s how it works:Big sites identify small sites that have cemented themselves in Google for a specific and valuable term or a specific topic.They publish 10+ articles on the same topic, across multiple portfolio sites.They crowd out the smaller site’s foothold on those topics.The TIPI FrameworkAuthor: Bryan Caseytl;drHow IBM builds and plans its content strategy.My takeawayI love the “topic bullseye” framework Bryan created to judge the relevance of topics to your product or service. The closer a query is to the bullseye, the higher the conversion rate is likely going to be.State of the SEO Job Market: Q1 2024Author: Nick LeRoytl;drSEO job listings are down -37% in Q1 of 2024 compared to 2023.My takeawayIt seems like SEO jobs are less stable than before, no thanks to AI and the looming economic uncertainty. However, this doesn’t mean that SEO is dead. As Bryan Casey writes, “Search can’t be separated from the web. It’s the operating system of the web.” Search will always exist, and therefore SEO will always exist. The form might change, and it’s up to all of us to adapt.Heat Death of the InternetAuthor: Takahētl;drShort ‘stories’ about the current Internet that will make you cry.My takeawayThis article hit me hard in the feels. I wonder if it was because I was younger and naive, but I miss the early Internet days when people were making things for fun, and not because they were trying to squeeze out as much money as possible.Best of April 2024Detailed Q3: Analysing The SEO Playbook of Digital Goliaths In-Depth, Every QuarterAuthor: Glen Allsopptl;drGlen’s third report on what the biggest players in SEO are doing.My takeawaySeems like most of the major sites are doing one or both things:Acquiring other websites to add to their portfolio or expand in other niches — for example, North Star Network acquired SportsMole for 7-figures, crypto exchange Bullish bought CoinDesk for $75 million, and Valnet acquired CarBuzz for an undisclosed amount.)Diversifying their traffic sources to rely less on GoogleWhy Ranch-Style SEO Is Your Future-Proof Content StrategyAuthor: Bernard Huangtl;drInstead of writing a lengthy, Skyscraper post that covers all angles, split them up into granular, targeted pieces of content that map to the user’s search journey.My takeawayI don’t want to rain on Bernard’s parade, and I could be just dumb, but ranch-style SEO does seem to call back to the old days of writing an article for every long-tail keyword. (Albeit with a strong focus on adding information gain, rather than gaming algorithms.)That said, from what I’ve observed, SERPs are getting more fragmented. Perhaps users are tired of having to scroll through Dostoyevsky-length novels and poor search results to get what they want, so they’re constantly refining their searches and therefore changing the intent of many queries.Marketing is really a cycle.You Are Your MoatAuthor: Amanda Natividadtl;drFive ideas on how to rise above the forgettable content created by generative AI.My takeawayAmanda’s point is this: You—your experiences, observations, triggers, and knowledge—can’t be replaced by AI. So, if you want to make content that stands out, use yourself as the lighthouse.Morgan Housel calls this “selfish writing”. YCombinator founder, Paul Graham wrote the same in his post on useful writing: “Use yourself as a proxy for the reader”.What’s beyond targeting keywords, now that generative AI (and SGE) can handle most of them? This is what I’ve been thinking a lot about—and the answer seems to just be “write something interesting.” And you can do this by simply following your nose, especially since I write for people like me too. What I find interesting will likely be interesting to others.Information GainzAuthor: Kevin Indigtl;drWe all agree we need to do better than copycat content. But most people are still creating content the exact same way. (Maybe even worse, now with generative AI.)My takeawayTo make good content that’ll rank in the future, you need to treat content like a product:Prioritize topics based on user interviews (not search volume).Hire subject matter experts to answer questions that really matter.Monitor quantitative metrics to validate qualitative research with metrics like scroll depth, heatmaps, session recordings, and time-on-site vs average read time.Best of March 2024How 16 Companies are Dominating the World’s Google Search ResultsAuthor: Glen Allsopptl;drGlen’s research reveals that just 16 companies representing 588 brands get 3.5 billion (yes, billion!) monthly clicks from Google.My takeawayGlen pointed out some really actionable ideas in this report, such as the fact that many of the brands dominating search are adding mini-author bios.This idea makes so much sense in terms of both UX and E-E-A-T. I’ve already pitched it to the team and we’re going to implement it on our blog.How Google is Killing Independent Sites Like OursAuthors: Gisele Navarro, Danny Ashtontl;drBig publications have gotten into the affiliate game, publishing “best of” lists about everything under the sun. And despite often not testing products thoroughly, they’re dominating Google rankings. The result, Gisele and Danny argue, is that genuine review sites suffer and Google is fast losing content diversity.My takeawayI have a lot of sympathy for independent sites. Some of them are trying their best, but unfortunately, they’re lumped in with thousands of others who are more than happy to spam.Estimated search traffic to Danny and Gisele’s site fell off a cliff after Google’s March updates 🙁I know it’s hard to hear, but the truth is Google benefits more from having big sites in the SERPs than from having diversity. That’s because results from big brands are likely what users actually want. By and large, people would rather shop at Walmart or ALDI than at a local store or farmer’s market.That said, I agree with most people that Forbes (with its dubious contributor model contributing to scams and poor journalism) should not be rewarded so handsomely.The Discussion Forums Dominating 10,000 Product Review Search ResultsAuthor: Glen AllsoppTl;drGlen analyzed 10,000 “product review” keywords and found that:The ‘Discussions and forums’ SERP feature was present in 7,702 of them (77%).Reddit was present in 97.5% of those.51% of Reddit’s top-ranking threads currently have spam as a top comment.My takeawayAfter Google’s heavy promotion of Reddit from last year’s Core Update, to no one’s surprise, unscrupulous SEOs and marketers have already started spamming Reddit. And as you may know, Reddit’s moderation is done by volunteers, and obviously, they can’t keep up.I’m not sure how this second-order effect completely escaped the smart minds at Google, but from the outside, it feels like Google has capitulated to some extent.I’m not one to make predictions and I have no idea what will happen next, but I agree with Glen: Google’s results are the worst I’ve seen them. We can only hope Google sorts itself out.Who Sends Traffic on the Web and How Much? New Research from Datos & SparkToroAuthor: Rand Fishkintl;dr63.41% of all U.S. web traffic referrals from the top 170 sites are initiated on Google.com.My takeawayDespite all of our complaints, Google is still the main platform to acquire traffic from. That’s why we all want Google to sort itself out and do well.But it would also be a mistake to look at this post and think Google is the only channel you should drive traffic from. As Rand’s later blog post clarifies, “be careful not to ascribe attribution or credit to Google when other investments drove the real value.”I think many affiliate marketers learned this lesson well from the past few Core Updates: Relying on one single channel to drive all of your traffic is not a good idea. You should be using other platforms to build brand awareness, interest, and demand.Want more?Each week, our team handpicks the best SEO and marketing content from around the web for our newsletter. Sign up to get them directly in your inbox. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Keep Learning SEO Trends 2024: Separating Fact From Fiction We used forecasted search volume to see which SEO trends are set to explode in 2024. Steal Our SEO Strategy for 2024 (+ Free Template) Learn a simple process for ranking higher in Google with the Orchard SEO strategy. 124 SEO Statistics for 2024 Are you curious about the state of SEO in 2023? Here's a list of the most up-to-date SEO statistics. 7 SEO Conferences to Attend in 2024 These SEO conferences are rife with networking and learning opportunities to grow your business or marketing career. 56 Google Search Statistics to Bookmark for 2024 A curated and vetted list of Google search statistics and insights for 2024. The 6 Biggest SEO Challenges That We’re Facing in 2024 Seen any stressed-out SEOs recently? If so, that’s because they’ve got their work cut out this year.",
  "headers": [
    {
      "level": "H1",
      "text": "The Best of Ahrefs’ Digest: June 2024"
    },
    {
      "level": "H2",
      "text": "Best of June 2024"
    },
    {
      "level": "H3",
      "text": "An Anonymous Source Shared Thousands of Leaked Google Search API Documents with Me; Everyone in SEO Should See Them"
    },
    {
      "level": "H4",
      "text": "tl;dr"
    },
    {
      "level": "H4",
      "text": "My takeaway"
    },
    {
      "level": "H3",
      "text": "Secrets from the Algorithm: Google Search’s Internal Engineering Documentation Has Leaked"
    },
    {
      "level": "H4",
      "text": "tl;dr"
    },
    {
      "level": "H4",
      "text": "My takeaway"
    },
    {
      "level": "H3",
      "text": "Google Documents Leaked & SEOs Are Making Some Wild Assumptions"
    },
    {
      "level": "H4",
      "text": "tl;dr"
    },
    {
      "level": "H4",
      "text": "My takeaway"
    },
    {
      "level": "H3",
      "text": "How Recent Google Updates Punish Good SEO: 50-Site Case Study"
    },
    {
      "level": "H4",
      "text": "tl;dr"
    },
    {
      "level": "H4",
      "text": "My takeaway"
    },
    {
      "level": "H3",
      "text": "On Writing Better: 43 Things I Learned from My Insane 2 Years of Study"
    },
    {
      "level": "H4",
      "text": "tl;dr"
    },
    {
      "level": "H4",
      "text": "My takeaway"
    },
    {
      "level": "H2",
      "text": "Best of May 2024"
    },
    {
      "level": "H3",
      "text": "HouseFresh Has Virtually Disappeared From Google Search Results. Now What?"
    },
    {
      "level": "H4",
      "text": "tl;dr"
    },
    {
      "level": "H4",
      "text": "My takeaway"
    },
    {
      "level": "H3",
      "text": "The TIPI Framework"
    },
    {
      "level": "H4",
      "text": "tl;dr"
    },
    {
      "level": "H4",
      "text": "My takeaway"
    },
    {
      "level": "H3",
      "text": "State of the SEO Job Market: Q1 2024"
    },
    {
      "level": "H4",
      "text": "tl;dr"
    },
    {
      "level": "H4",
      "text": "My takeaway"
    },
    {
      "level": "H3",
      "text": "Heat Death of the Internet"
    },
    {
      "level": "H4",
      "text": "tl;dr"
    },
    {
      "level": "H4",
      "text": "My takeaway"
    },
    {
      "level": "H2",
      "text": "Best of April 2024"
    },
    {
      "level": "H3",
      "text": "Detailed Q3: Analysing The SEO Playbook of Digital Goliaths In-Depth, Every Quarter"
    },
    {
      "level": "H4",
      "text": "tl;dr"
    },
    {
      "level": "H4",
      "text": "My takeaway"
    },
    {
      "level": "H3",
      "text": "Why Ranch-Style SEO Is Your Future-Proof Content Strategy"
    },
    {
      "level": "H4",
      "text": "tl;dr"
    },
    {
      "level": "H4",
      "text": "My takeaway"
    },
    {
      "level": "H3",
      "text": "You Are Your Moat"
    },
    {
      "level": "H4",
      "text": "tl;dr"
    },
    {
      "level": "H4",
      "text": "My takeaway"
    },
    {
      "level": "H3",
      "text": "Information Gainz"
    },
    {
      "level": "H4",
      "text": "tl;dr"
    },
    {
      "level": "H4",
      "text": "My takeaway"
    },
    {
      "level": "H2",
      "text": "Best of March 2024"
    },
    {
      "level": "H3",
      "text": "How 16 Companies are Dominating the World’s Google Search Results"
    },
    {
      "level": "H4",
      "text": "tl;dr"
    },
    {
      "level": "H4",
      "text": "My takeaway"
    },
    {
      "level": "H3",
      "text": "How Google is Killing Independent Sites Like Ours"
    },
    {
      "level": "H4",
      "text": "tl;dr"
    },
    {
      "level": "H4",
      "text": "My takeaway"
    },
    {
      "level": "H3",
      "text": "The Discussion Forums Dominating 10,000 Product Review Search Results"
    },
    {
      "level": "H4",
      "text": "Tl;dr"
    },
    {
      "level": "H4",
      "text": "My takeaway"
    },
    {
      "level": "H3",
      "text": "Who Sends Traffic on the Web and How Much? New Research from Datos & SparkToro"
    },
    {
      "level": "H4",
      "text": "tl;dr"
    },
    {
      "level": "H4",
      "text": "My takeaway"
    },
    {
      "level": "H2",
      "text": "Want more?"
    }
  ],
  "author": "Si Quan Ong"
}