{
  "url": "https://ahrefs.com/blog/most-searched-people/",
  "slug": "most-searched-people",
  "title": "The 100 Most Searched People on Google in 2024",
  "description": "These are the 100 most searched people on Google, along with their monthly search volumes.",
  "content": "Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents We analyzed our database of 28.7 billion keywords to identify the people most often searched for on Google.These are the 100 most searched people, along with their monthly search volumes.100 most searched people on Google in the U.S.#KeywordSearch volume1donald trump74500002taylor swift73000003travis kelce49700004matthew perry37900005kamala harris27300006joe biden24800007caitlin clark24000008olivia rodrigo21000009jd vance206000010billie eilish172000011sabrina carpenter168000012kate middleton166000013patrick mahomes157000014gypsy rose152000015jason kelce149000016mihály csíkszentmihályi146000017timothee chalamet145000018tyreek hill138000019lola beltrán135000020lebron james133000021lauren boebert131000022barry keoghan130000023brock purdy128000024drake125000025griselda blanco121000026ryan reynolds120000027zendaya118000028scottie scheffler117000029aaron rodgers117000030casimir funk117000031zach bryan115000032tom brady115000033jacob elordi114000034blake lively113000035millie bobby brown112000036margot robbie111000037luisa moreno111000038bruce willis109000039v109000040eminem105000041cillian murphy104000042anthony edwards102000043peso pluma100000044fani willis100000045etel adnan100000046dua lipa99100047jennifer aniston98600048bianca censori98300049megan fox98200050shannen doherty97700051mike tyson97300052megan thee stallion97100053ariana grande96000054james baldwin95800055britney spears95400056oj simpson94100057lainey wilson93700058dan schneider93300059emma stone93200060raoul a. cortez93000061dolly parton92600062joe burrow92500063anya taylor-joy92500064amanda bynes92400065danny masterson92000066matt rife91800067kendrick lamar91200068messi90100069bronny james90100070adam sandler89800071james earl jones89700072coco gauff89200073michael jackson88400074victor wembanyama87000075pink86500076luka doncic86100077selena gomez86100078jelly roll86100079jonathan majors84000080justin fields82400081meghan markle82100082florence pugh81900083post malone81300084jayson tatum80800085diddy80400086justin jefferson79900087sza79400088ana de armas79300089cj stroud79000090ben affleck78800091jake paul78600092zac efron78300093scarlett johansson77900094deion sanders77100095dr. victor chang76000096andrew tate75900097jason momoa75600098pedro pascal75500099bad bunny744000100christian mccaffrey735000100 most searched people on Google globally#KeywordSearch volume1taylor swift170000002trump124000003matthew perry91000004sydney sweeney85000005travis kelce75000006oppenheimer73000007messi70000008elon musk65000009sinner630000010cristiano ronaldo610000011kate middleton590000012billie eilish520000013joe biden500000014xxxtentacion500000015大谷翔平490000016virat kohli480000017jenna ortega470000018v460000019ronaldo460000020kamala harris430000021olivia rodrigo420000022griselda blanco400000023margot robbie400000024cillian murphy380000025carlos alcaraz360000026dua lipa360000027zendaya360000028djokovic350000029bianca censori350000030jude bellingham340000031alcaraz340000032millie bobby brown340000033ana de armas330000034sabrina carpenter330000035henry cavill330000036ryan reynolds320000037ice spice320000038anne hathaway310000039timothée chalamet310000040putin310000041barry keoghan300000042lana rhoades300000043michael jackson300000044peso pluma300000045ariana grande300000046jacob elordi300000047lebron james300000048blake lively290000049bruce willis290000050lamine yamal290000051emma stone290000052shubman gill290000053simone biles290000054rohit sharma290000055brad pitt290000056eminem290000057jennifer aniston280000058timothee chalamet280000059mike tyson270000060megan fox270000061lola beltrán270000062caitlin clark270000063leonardo dicaprio270000064johnny depp260000065scarlett johansson260000066selena gomez260000067drake260000068mihály csíkszentmihályi260000069anya taylor-joy250000070madonna250000071britney spears250000072max verstappen250000073jeremy allen white250000074gypsy rose250000075andrew tate250000076kylie jenner250000077travis scott240000078fabrizio romano240000079jennifer lawrence240000080meghan markle240000081hardik pandya240000082keanu reeves240000083angelina jolie240000084glen powell240000085jd vance240000086shannen doherty230000087jungkook230000088jason momoa230000089jennifer lopez230000090bellingham220000091jeffrey epstein220000092justin bieber220000093florence pugh220000094kim kardashian220000095ben affleck220000096haaland220000097zac efron220000098tyson fury220000099imane khelif2100000100adam sandler2100000How to find relevant people-oriented keywords in your nicheIn almost every industry, there are celebrities, professionals, or influencers that other people want to emulate. For example, an amateur tennis player might want to know which tennis racket Novak Djokovic uses. Or a football player might want to know the boots Trent Alexander-Arnold wears.In fact, Equipboard has taken this idea seriously and created a site around the gear used by professional musicians.You can do the same for your industry too.Here’s how:Go to Keywords ExplorerEnter the names of famous people in your nicheGo to the Matching terms reportFilter for keywords related to gears using the Include filterFor example, if I entered the names of professional tennis players (Roger Federer, Emma Radacanu, Rafael Nadal) and filtered for tennis gear keywords (e.g., shoes, racket, wristband, shorts), I see 960 potential keywords I could target. If I were a tennis site, I could create a category page for each celebrity and list out all their preferred equipment.Another way is to enter a relevant keyword into Keywords Explorer, go to the Matching terms report, and observe keyword patterns. For example, if I were a fitness site, I could enter “weight loss” into Keywords Explorer.The first thing I’ll notice is that many people are actually interested in how certain celebrities lost their weight. The second thing I notice is that the keywords all form a pattern: [first name][last name] weight loss.As such, I can use the Word count filter to look for keywords that have 4 words, which gives me a list of celebrity-related weight loss keywords:Want to do keyword research for your site? Sign up for Keywords Explorer. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Keep Learning Core Web Vitals Data Study w/ CrUX & 5.2M Pages - Ahrefs We looked at all the domain-level CrUX data and 5.2M pages to do a big study on Core Web Vitals. Check out what we found. SEO Pricing: How Much Does SEO Cost? 439 People Polled Did you know that 78.2% charge a monthly retainer? Learn more insights from our survey of 350 SEO professionals. 96.55% of Content Gets No Traffic From Google. Here’s How to Be in the Other 3.45% [New Research for 2023] We studied around 14 billion webpages and found that 96.55% of them get no traffic from Google. Read this post to learn how to be in the other 3.45%. How Many New Backlinks Do Top-ranking Pages Get Over Time [New Data by Ahrefs] Do top-ranking pages get links at a faster pace than lower-ranking pages? We analyzed 200,000 top-ranking web pages across 10,000 keywords to find out. I Disavowed “Toxic Backlinks”: Here’s What Happened Last month, I exported all \"toxic\" and \"potentially toxic\" backlinks to three of our blog posts from a well-known SEO tool. Did traffic tank?",
  "headers": [
    {
      "level": "H1",
      "text": "The 100 Most Searched People on Google in 2024"
    },
    {
      "level": "H2",
      "text": "100 most searched people on Google in the U.S."
    },
    {
      "level": "H2",
      "text": "100 most searched people on Google globally"
    },
    {
      "level": "H2",
      "text": "How to find relevant people-oriented keywords in your niche"
    }
  ],
  "author": "Si Quan Ong"
}