{
  "url": "https://ahrefs.com/blog/multilingual-seo/",
  "slug": "multilingual-seo",
  "title": "Multilingual SEO: Translation and Marketing Guide",
  "description": "With a multilingual website you can reach a wider audience. But you need to master multilingual SEO and marketing. This guide will teach you just that.",
  "content": "Martin Woods Martin Woods is one of the co-founders of Indigoextra Ltd, a company that helps English speaking companies to expand their presence in Europe via an SEO consultation service provided by an experienced team of translators and multilingual marketing and SEO experts. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents There are more than enough SEO guides on the internet. But only a few of them can be fully applied to a multilingual website, as it needs some specific approach. Reaching an international audience is an opportunity that is now available to small and medium businesses in a way that has never been possible historically. Many business owners create a website and find that they are receiving international inquiries about their services, or receiving orders from other countries. Although they expected their market would be local, or at best national.With the vastly reduced price of international communication and shipping, a logical next step is to launch a multilingual website.A number of challenges have to be successfully passed in order to create a successful multilingual site that ranks well with Google (or the dominant search engine in your target country). These include:How can you make sure you’re targeting the right country?Which CMS is best?Are separate domains, sub-domains or sub-folders best for SEO?Do you need an international host?How do you complete an SEO translation?How do you run a multilingual marketing campaign?I’ve managed multilingual SEO and website translation projects for over 17 years for both SME’s taking their first steps into international waters and existing multinationals. Let me answer all these questions, giving you a clear understanding of how to build a successful international business.How can you make sure you’re targeting the right country?Let’s take a look at the stats from a 2017 report from We Are Social and Hootsuite. With 17% of worldwide internet users, Europe, for example, is a promising market to cover.Say you have a successful business selling coats in the UK, but aren’t sure whether they would do so well in France or Spain, where it’s considerably warmer. Or perhaps you offer a fortune cookie writing service and wonder how much demand there would be for it in Germany.Rather than just speculating, you can use Ahrefs Keywords Explorer to find the international keyword search volume and keyword difficulty for target keywords. Brainstorm core keywords your clients might search for in the appropriate language and simply choose your target country to see results for that location.“manteau” (the French for “coat”) keyword gets ~29,000 searches per month in FranceAlternatively if you enter multiple keywords and scroll down the results, you will see search volume distribution among different countries for all keywords combined. This can be handy when you’re targeting more than one country (e.g. an English website targeting all English speakers internationally, regardless of whether they’re in the UK, USA, Canada or another country).Note: When doing multilingual keyword research, it’s best to use both the properly accented variant and a variant with no accents. For example, if you want to check the search volume for “référencement” (the French for SEO), you’re best off looking up “référencement” and “referencement” (with no accents), then adding the search volumes together. To illustrate how important proper keyword research is, let’s take an example.117K people search for “last minute holidays” from the UK each month. However the concept of “last minute holidays” isn’t really known in France and instead only 8.4K people search for the equivalent “Vacances dernière minute” (both with and without the accent), as you can see.If you prioritize this term equally in both languages, you will therefore get 13.9 times the results in the UK vs. France. The full keyword research will help identify this before you do your French content marketing, so you can identify alternative keywords with higher search volumes.Another useful tool to establish the strength of the target market is Google Trends, which lets you see whether interest in a particular topic or keyword is increasing or decreasing. This tool also lets you filter results by country.In countries where Google isn’t the dominant search engine, namely China (Baidu), Russia (Yandex) and South Korea (Naver), you should keep in mind that Google will show smaller search volumes.PRO tip You can discover keywords that already bring traffic to your or to your competitor’s website in different countries using the Organic Keywords report of Ahrefs Site Explorer. That’s a perfect start for your keyword research and analysis.Here’s an example for Huffingtonpost.com. It ranks for over 200K keywords in Italy alone. Which CMS is best for a multilingual website?The most popular open source CMS’s like WordPress, Drupal and Magento all provide a range of options to create websites with the best multilingual SEO structure and a shared database.Having a shared database is a huge advantage in the long run. These CMS’s all let you configure a site with separate domains, sub-domains or sub-folders (depending on your preference), all using the same database. This means that if you update one aspect of the site – whether it’s the design, adding or removing a product, updating the pricing, etc., then it will automatically update all versions of your site.In the long run this will save you a huge amount of time, as well as making it less likely that you’ll accidentally leave a product on one of your sites that you stopped selling a year ago.A shared database also allows you to link pages to the equivalent page in each language, as recommended for best SEO practice.If you’re translating an existing website, rather than creating a new one from scratch, and it’s already powered by a multilingual CMS, simply find a web developer who can make it multilingual. If your site is in a non-multilingual friendly CMS, you have 3 options (this assumes your site’s already in English, but the same logic applies regardless):Recreate the website in a multilingual CMS and replace your English site.Copy the entire code over to a new site, then translate everything.Create a new foreign language website in a different CMS (ideally a multilingual one, in case you expand into other languages in future) and keep your existing English websiteThere are pros and cons of each method and this handy multilingual CMS questionnaire will help you make the right choice.Should you go for separate domains, sub-folders or sub-domains?Each option has its merits and even top sites use different structures:Separate domainsgoogle.co.ukgoogle.frgoogle.deSubfolderswww.apple.com/ca/www.apple.com/fr/www.apple.com/de/Separate sub-domainsen-gb.facebook.comfr-fr.facebook.comde-de.facebook.comSeparate pages / URL extensionsyoutube.comyoutube.com/?hl=fr&gl=FRyoutube.com/?gl=DE&hl=deIf you have a keyword-rich domain name in English (e.g. fortune-cookie-writing-service.com) then for branding it’s better to translate this and buy the equivalent local domain name in each language. If you have a strong brand already and it’s an international domain (like .com, .net or .org) rather than a country specific domain, then any of the above options can work.There are, however, three options you should avoid, as they’re all terrible for SEO:Having all the same languages on the same page Google can only index a page once and each page can only have one Meta Title and Meta Description. Putting all the languages on one page is bad SEO and creates a bad user-experience too.Using cookies to control the language, but keeping identical URLs in each language Google doesn’t follow cookies, so if you have example.com/page1 for each language, it will only index one language of your site and ignore the others.Using anything after a # to control language The hashtag (#) in a web address directs visitors to a specific part of the same page, called an anchor, therefore this creates the same problem as above.I’m amazed at how many small businesses using custom CMS’s have one of the above structures. If you have a multilingual website, it’s worth checking carefully to be sure that one of these doesn’t apply to you.Do you need an international host?Google uses a myriad of factors to determine the location of your business – the domain extension, the language it’s written in, addresses or cities that appear in your content, Hreflang metatags, whois information, etc.Having a website hosted in the same country as your target audience therefore won’t help your local SEO.One small factor is that having a host close to your target audience will improve site speed for the majority of your visitors. If your target audience is in France, say, it’s therefore smart to find a host in Europe. But it doesn’t necessarily need to be in France, as many other factors also affect site speed.How do you complete an SEO translation?While Google Translate and other automatic translation software is improving, they’re still a long way from “good enough” for professional marketing purposes, like a website.Google might view automatically translated content as spam, so a manual translation from a qualified translator really is the only way to go.An SEO translation is essential to gain the highest possible position with Google and other search engines and it’s ideal to optimize your English website first, before starting the translation. There are then two possible approaches:1. Translate, then optimize.Translate your site without thinking about SEO, then optimize the new content by ensuring it targets the right keywords and rewriting Metatags so they’re the correct length.2. Identify target keywords and incorporate these as you translateWhen we do SEO translations, this is our preferred approach!Start by mapping 1 or 2 English keywords to each landing page on your site and if your whole site focuses on one topic, identify several keywords that are relevant to your site as a whole too.Translate these keywords into the new target language (we’ll use German in this example) and brainstorm other related German keywords and German synonyms.Use the Keywords Explorer from Ahrefs to check search volumes and identify German keywords that have relatively high search volumes and relatively low keyword difficulty.Use a spreadsheet to map these keywords to the equivalent English pages and when you complete the German translation, ensure that you include the main keyword once in the Meta Title, Meta Description, URL and h1 title and a few times, but not excessively elsewhere on the page.If it makes sense to do so, also include the site-wide keywords in a natural fashion in the content.One important point to note is that since the Google Panda and RankBrain algorithm updates, Google’s got a lot smarter at reading content. Therefore you should always prioritize good spelling and grammar and write naturally over inserting exact keywords in your content. Keyword stuffing is an old-fashioned SEO technique and luckily for both readers and SEO experts, no longer works.Translating URLs will help your SEO, but it’s best to use clean URLs with no accents. The best CMS systems (WordPress, Drupal, etc.) all have addons that convert translated URLs into clean URLs. You can also use a tool to remove accents from letters.Your content localisation also needs to be adapted to the local culture. Check that measurements (inches / cm) will be understood, references to currencies match and modify phrases where necessary to be sure that there’s no ambiguity in meaning. This is all part of translation best practice.Why is culture important for multilingual SEO?Appealing to the local culture, whether by having a good translation, using a color scheme that is meaningful to your product and your target audience, or making references that will be understood and appreciated, will all obviously help with user experience and give you an increased conversion rate. But does this all have a direct impact on your rankings in Google too?The answer is ‘yes’ - with evolving Google’s algorithms, user behavior factors like how long people spend on your website and how many pages they visit are gaining more and more importance. This is one of the crucial ways Google infers the quality of a website.Google can accurately measure these factors, either via Google Analytics or via the 59% of the internet users who have Google Chrome as a browser. Adapting to a local culture not only helps once visitors arrive at your site, but will indirectly help drive more traffic to your site too.Editor’s Note In this multilingual SEO guide, Martin did not cover the hreflang attribute. It might be very obvious for experienced SEOs and webmasters, but for the beginners, I think it must be explained.TLDR, with hreflang tags properly set on your pages, search engines will be able to show the most appropriate URL to a user based on his location and language settings.Use hreflang on your multilingual website when you want searchers to:Land on the content pages of your site, presented in their preferred language.Get content in one language but with regional variations. For example, the same product page with prices in GBP and USD for the UK and American visitors accordingly. Besides, it will solve a duplicate content problem in this case.Here are the most important advice on hreflang implementation on a multilingual website:Select only one option to place hreflang tags. It must be either in the <head> section of your HTML page, HTTP headers (say for PDFs and other non-HTML content) or in your sitemap.Every language/location variation of your page must have the exact same set of hreflang annotations. Thus, you will provide the confirmation links between these pages.Always include hreflang=\"x-default\" annotation. It will be applied to the languages/locations you haven’t specified.Make sure you’re using the proper ISO 639-1 code for languages and ISO 3166-1 Alpha 2 for locations (optional).That’s how we use it on our website at Ahrefs:<link rel=\"alternate\" hreflang=\"x-default\" href=\"https://ahrefs.com/\" /> <link rel=\"alternate\" hreflang=\"de\" href=\"https://ahrefs.com/de/\" /> <link rel=\"alternate\" hreflang=\"es\" href=\"https://ahrefs.com/es/\" /> <link rel=\"alternate\" hreflang=\"fr\" href=\"https://ahrefs.com/fr/\" /> <link rel=\"alternate\" hreflang=\"it\" href=\"https://ahrefs.com/it/\" /> <link rel=\"alternate\" hreflang=\"ja\" href=\"https://ahrefs.com/ja/\" /> <link rel=\"alternate\" hreflang=\"nl\" href=\"https://ahrefs.com/nl/\" /> <link rel=\"alternate\" hreflang=\"pl\" href=\"https://ahrefs.com/pl/\" /> <link rel=\"alternate\" hreflang=\"pt\" href=\"https://ahrefs.com/pt/\" /> <link rel=\"alternate\" hreflang=\"ru\" href=\"https://ahrefs.com/ru/\" /> <link rel=\"alternate\" hreflang=\"sv\" href=\"https://ahrefs.com/sv/\" /> <link rel=\"alternate\" hreflang=\"tr\" href=\"https://ahrefs.com/tr/\" /> <link rel=\"alternate\" hreflang=\"zh\" href=\"https://ahrefs.com/zh/\" />If hreflang code is misconfigured, search engines may interpret it incorrectly or ignore this attribute at best.You should also note that this attribute is just a signal, not a directive to a search engine.This guide from Google will tell you everything you need to know about hreflang.Nick ChurickRunning a multilingual marketing campaignIf you’ve chosen the right CMS, researched your keywords carefully and translated your content, then when you put your site live, you expect millions of visitors to flock to it. Unfortunately this isn’t the case, at least not normally. Completing your website translation is actually the first part of the process and the second part is to run a multilingual link building campaign. When determining how to rank websites Google uses 3 main factors:On-page contentIncoming linksUser experience (measured using a wide range of factors that are constantly modified by Google).An SEO translation will handle the first and last of these, but creating quality incoming links is also an essential step in the process. To look natural to Google and ensure you’re not penalised, the majority of these backlinks also need to be in the same language (e.g. German links going to your German site/sub-domain/ page).If they’re from websites targeting the same country as you are, you’ll get an extra SEO boost too.In addition to language, you should aim for links that are:RelevantAre included naturally in an article, infographic text, etc.From high authority, respected sitesPoor quality links will hinder, rather than help your SEO. The process for link building is the same in any language. And if you plan on using an SEO company for multilingual link building, then make sure you work with one who uses native speakers. Be sure to check examples of articles they’ve written and published as part of your vetting process.If you’re planning on doing link building yourself, focus on the content marketing aspect of it and before placing each link ask yourself “If search engines didn’t exist, would this link still make sense?” As Google gets smarter, if you can answer “Yes” to this question, odds are, it will also be good for SEO.And, of course, you need to track your website SEO progress across the different countries. For this you can add your website to Ahrefs Rank Tracker along with keywords and locations you’re targeting and watch the results.ConclusionIn conclusion, to succeed with a multilingual website it’s essential to:Target keywords with sufficient search volume to make it worthwhileUse a CMS and website structure that let Google easily index all the content on your siteLocalize and optimize the content as you translate itMarket your website with an international link building campaign targeting high quality unique linksThat’s all the secret behind a good multilingual SEO, which will help your business reach a bigger audience. If you have any questions, comments, or multilingual SEO tips you would like to share, just leave them below. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Keep Learning A Simple SEO Guide for Successful Event Marketing SEO is essential to marketing any event to help people find it when they search online. Use these SEO tactics to help your events rank high. SEO Leads: A 6-Step Guide on How to Get SEO Clients Whether you're an established SEO agency or a freelancer just starting out, leads are the lifeblood of your business. Here's how to get them. How to Use Google Search Console to Improve SEO (Beginner’s Guide) Learn how to use Google Search Console to improve your SEO today in 6 simple steps. SaaS SEO: The Tried & Tested Guide Here's everything you need to know about building a successful SaaS SEO strategy. SEO for Lawyers & Law Firms: The Complete Guide A guide on increasing the chances of ranking on Google Map Pack and regular organic results—tailored for lawyers, attorneys, and law firms.",
  "headers": [
    {
      "level": "H1",
      "text": "Multilingual SEO: Translation and Marketing Guide"
    },
    {
      "level": "H2",
      "text": "How can you make sure you’re targeting the right country?"
    },
    {
      "level": "H2",
      "text": "Which CMS is best for a multilingual website?"
    },
    {
      "level": "H2",
      "text": "Should you go for separate domains, sub-folders or sub-domains?"
    },
    {
      "level": "H2",
      "text": "Do you need an international host?"
    },
    {
      "level": "H2",
      "text": "How do you complete an SEO translation?"
    },
    {
      "level": "H3",
      "text": "1. Translate, then optimize."
    },
    {
      "level": "H3",
      "text": "2. Identify target keywords and incorporate these as you translate"
    },
    {
      "level": "H2",
      "text": "Why is culture important for multilingual SEO?"
    },
    {
      "level": "H2",
      "text": "Running a multilingual marketing campaign"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    }
  ],
  "author": "Martin Woods"
}