{
  "url": "https://ahrefs.com/blog/new-features-aug-2024/",
  "slug": "new-features-aug-2024",
  "title": "Compare page text changes side-by-side in Site Audit and more (Aug 2024)",
  "description": "This August, we’re introducing side-by-side page text comparison in Site Audit, no blinks mode in the Calendar report, and more.",
  "content": "Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents This month we’re introducing side-by-side page text comparison in Site Audit, no blinks mode in the Calendar report, and more. Let’s get right into it.https://www.youtube.com/watch?v=qXzCvAw6FDUSite ExplorerNo blinks mode in Calendar report We’ve added a no blinks mode in the Calendar report that reduces link noise.Just turn on this “Show domain recurrences toggle” to hide link recurrences, also known as link blinks, in your report. When hidden, only the first appearance of new domains or links is shown. Recurring disappearances are ignored, and considered lost only when the domain or link does not reappear. Keywords ExplorerCluster keywords for Japanese languageYou can now cluster keyword ideas for the Japanese language both by Parent Topic and by terms.Site AuditSee changes in page text side-by-sideBefore, how we displayed changes in page text tended to look quite messy.Now, we’ve developed our own solution to render inline changes and switched to a side-by-side view.You can now:See both old and new content at onceSee highlights for removed and added text Competitive AnalysisNew “All in top 100″ checkboxWe’ve added an “All in top 100″ checkbox in the competitors’ positions filter in Content gap. This lets you create more complex rules like “at least one competitor in top 10 and all in top 100.”GeneralMore 2FA optionsBefore, you could only use one-time passwords generated by an app.Now, we support hardware security keys like YubiKey and platform authenticators like Face ID, Touch ID, and Windows Hello. Just go to Account Settings > My account to add an authentication method like hardware security keys, your phone, or even your browser. APIv3: Batch Analysis endpointWe’ve just released the long-awaited Batch Analysis APIv3 endpoint, which lets you pull metrics for a bunch of URLs and domains in bulk.Read API documentation Teaser!Patches in Site Audit coming soonPatches are fixes for your website that you can create and make directly in Site Audit issue reports.If your pages get flagged for having too-short meta descriptions, all you have to do is click on “Patch it”, enter new meta descriptions, and hit publish to fix them on your website – no developers needed.Sounds exciting? We have plenty more details in our blog post.–That’s all for this month. Check out the Ahrefs changelog for more updates, and leave any feature requests on our Canny. Enjoy! Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs.",
  "headers": [
    {
      "level": "H1",
      "text": "Compare page text changes side-by-side in Site Audit and more (Aug 2024)"
    },
    {
      "level": "H2",
      "text": "Site Explorer"
    },
    {
      "level": "H2",
      "text": "Keywords Explorer"
    },
    {
      "level": "H2",
      "text": "Site Audit"
    },
    {
      "level": "H2",
      "text": "Competitive Analysis"
    },
    {
      "level": "H2",
      "text": "General"
    },
    {
      "level": "H2",
      "text": "Teaser!"
    }
  ],
  "author": "Rebekah Bek"
}