{
  "url": "https://ahrefs.com/blog/new-organic-traffic-graphs/",
  "slug": "new-organic-traffic-graphs",
  "title": "Organic traffic graphs now reflect monthly search volume trends for keywords",
  "description": "This affects everyone’s favorite Organic traffic graph: What’s new Everything runs faster! You can now toggle to see monthly search trends for many",
  "content": "Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents We’ve rebuilt and updated the database used in Organic Keywords 2.0, Top Pages 2.0, and the Organic search tab and metrics in your Site Explorer Overview.This affects everyone’s favorite Organic traffic graph:What’s newEverything runs faster!You can now toggle to see monthly search trends for many keywords.Let’s get into that second point.The old “Average volume” organic traffic chart was built using the average of data over the latest 12 months from an update. The benefit of this: the data looks more consistent, and it’s useful to troubleshoot things like traffic drops.On the other hand, the new “Monthly volume” organic traffic chart is built using data specific to that month. While the data looks more volatile, it takes volume trend into account and is useful for spotting search trends and monitoring seasonal traffic fluctuations.Here’s an example: dodoburd.com. They’re an online gift shop, which means that they tend to rank for seasonal keywords like this one:So dodoburd.com generally sees their traffic peaks during Christmas time. This wasn’t reflected on the old graph, but shows clearly on the new one.Old chart: Latest 12-month averageNew chart: Month-specific And another example: scribbr.nl. They’re a plagiarism checker software. Since search queries related to academic papers are used much less in the summer, the new data reflects that.Old chart: Latest 12-month averageNew chart: Month-specific NotesIf you noticed a drop in the organic traffic figures shown on your Overview in Site Explorer, this was due to a bug in the traffic metric computation that affected some sites. We’ve fixed this bug and the database was rebuilt, so the numbers are now back to what they should have been.The old Organic keywords and Top pages/subfolders/subdomains have not been affected by this change retrospectively. The data in these reports will be updated over time. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs.",
  "headers": [
    {
      "level": "H1",
      "text": "Organic traffic graphs now reflect monthly search volume trends for keywords"
    },
    {
      "level": "H3",
      "text": "What’s new"
    },
    {
      "level": "H3",
      "text": "Notes"
    }
  ],
  "author": "Rebekah Bek"
}