{
  "url": "https://ahrefs.com/blog/new-features/",
  "slug": "new-features",
  "title": "Ahrefs Changelog: Running List of New Features",
  "description": "A simple running list of all of Ahrefs' newest features for you to browse, learn about and try for yourself.",
  "content": "Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents This is the Ahrefs changelog, a simple list of all our newest features for you to browse and try out.If you prefer video, you might want to head to our product updates channel instead.-14 Sept: Ahrefs’ AI Content Helper is now in beta! This tool lets you optimize your content by giving you competitor data to inform your own writing process, instead of focusing on keyword stuffing. Content Helper will:Use AI to identify the core topics for your target keywordsScore your content and your competitors’ content against those topics as you write Show basic recommendations and ideas for titles, meta descriptions, and headingsLearn more13 Sept: You can now apply multiple filters for various use cases in Keywords Explorer in one click. 12 Sept: We’ve added a Global Traffic Potential metric in Keywords Explorer that shows you the total organic traffic that the #1 ranking page gets across all countries. This gives you a better idea of a keyword’s full traffic potential instead of basing it on page traffic from a single country.09 Sept: Report builder (beta) is now live! It lets you create your own reports using widgets from Site Explorer and Rank Tracker. You can experiment with creating all sorts of reports, from competitor analysis to brand monitoring. Learn more09 Sept: In Site Explorer’s Overview 2.0, there’s a new paid search tab where you can see charts for metrics like paid traffic, paid keywords and paid pages, all in one place.09 Sept: In the Site Structure report in Site Explorer, we now show URL metrics for paths, as well as new icons for paths and webpages to distinguish between them more easily.22 Aug: We added two new metrics to Batch Analysis v2: The top location that brings the most organic traffic to a target, and the traffic from the top location. Both columns are available in APIv3.14 Aug: You can now cluster keyword ideas for the Japanese language both by Parent Topic and by terms in Keywords Explorer.14 Aug: We now support hardware security keys like YubiKey and platform authenticators like Face ID, Touch ID, and Windows Hello. Go to Account Settings > My account to add an authentication method.12 Aug: When viewing page text changes in Site Audit, you can now see both old and new content side-by-side, along with highlights for removed and added text.6 Aug: We’ve just released the long-awaited Batch Analysis APIv3 endpoint, which lets you pull metrics for a bunch of URLs and domains in bulk. Read API documentation29 July: We’ve added an “All in top 100″ checkbox in the competitors’ positions filter in Content gap. This lets you create more complex rules like “at least one competitor in top 10 and all in top 100.”23 July: Turn on this Show domain recurrences toggle to hide link recurrences, also known as link blinks, in your Calendar report. When hidden, only the first appearance of new domains or links is shown. Recurring disappearances are ignored, and considered lost only when the domain or link does not reappear.19 July: There’s a new Growth metric in Keywords Explorer that shows you a keyword’s search volume growth rate over 3, 6, or 12 months – you can select your time period with the switcher at the top.Plus, filter for keywords that had a specific growth rate over a time period and sort results by growth.15 July: Now when you select domains in Organic Competitors, you can open them directly in the new Content gap and Link intersect reports. 12 July: In Site Explorer’s Top pages report, the new Content changes column tells you drastically content on a page changed over a period of time. Click on the magnifying glass to see actual changes in Page inspect.07 July: In Site Explorer’s Overview 2.0, enable “Content changes” in performance charts to see when content was changed and visualize if significant changes in traffic followed a change in content. The bigger the bubble, the bigger the content change. 01 July: Some Rank Tracker improvements! We’ve added customizable columns for clicks, CPC, CPS, search types & Parent Topic in Overview 2.0, plus a date picker in SERP overview.28 June: In the revamped Referring IPs report, you can now use “Best links” and other filters, see new and lost IPs for any timeframe, and see nested domains and link tables.26 June:We’ve improved Target URL filter in Backlink reports. Before, it only worked on the final destination URL in a redirect chain – but it now works on all the URLs in redirect chains.21 June: Click on a tag in any Rank Tracker report to open up that tag group in Overview 2.0. This should make it lotsss more convenient to access the keywords related to each tag.7 June: Find the SERP features history chart in the Overview, Ranking history, and Competitors Overview reports. Hover over the chart to see details and track any Ahrefs and Google updates.GeneralBatch Analysis 2.0Now you can analyze up to one thousand targets at once – Batch Analysis will generate a report with important SEO metrics. Use the country picker at the top to see data for a specific location, or export your data into a CSV file.API course for beginnersWe’ve published a free training course for Ahrefs API that’s designed for people with zero technical background. Seven short videos later, and you’ll be running requests on your own and unlocking the full potential of Ahrefs data.Take the course—Check out the Ahrefs changelog for more updates – it houses a running list of all our newest features.30 May: You can now use AI to translate a saved keyword list into various languages and dialects. Just open any saved keyword list and click on the Translate button, select a language and location, and hit translate. 30 May: Find two new charts in Site Explorer’s Overview > Competitors mode: Share of Voice, which shows your target’s organic search market share over time as compared to the competitors you’ve specified. Plus Share of Traffic Value, which shows the same but instead of traffic, it focuses on the total paid cost of that traffic.29 May: Use the IndexNow setting in Site Audit to instantly notify search engines about important content changes on your website. Just go to your Crawl settings and specify your IndexNow API key, then go to Page Explorer and filter for the URLs you want to submit and click the IndexNow button. Learn about IndexNow28 May: Analyze up to one thousand targets at once with Batch Analysis 2.0. Use the country picker at the top to see data for a specific location, or export your data into a CSV file.16 May: Find new widgets in your GSC Overview report:Top keywordsTop keyword changesLow hanging fruit keywords, which shows you the most popular keywords where your target’s ranking position is between 4 and 15Potential cannibalization, which shows you keywords with multiple ranking URLsTop pagesTop page changes3 May: There’s a new Calendar view in Page inspect that shows you the history of page changes over time. The darker the color, the more content changes were made on a page that day. Also, when comparing SERPs in Site Explorer, Keywords Explorer and Rank Tracker, you can now see the actual text of a featured snippet and compare how it changed over time.27 April: Just released: our first Rank Tracker APIv3 endpoint for Overview 2.0. As always, you can use the API button in the report itself to create request URLs for filters you’ve applied. Requests to this endpoint are free and do not consume units. Read API documentation18 April: Local keyword research in Keywords Explorer just got easier. Cluster common keyword ideas by Parent Topic for these locations:Brunei DarussalamHong KongJapanKoreaTaiwanTrinidad TobagoVietnamWe’ve also added two more use cases in Site Explorer’s Opportunities report.Potential cannibalization helps you spot opportunities to avoid targeting the same keyword with multiple pages Descriptive anchors helps you replace generic anchor textAnd our last update for the day: you can now compare between any Site Audit crawls. Before, you could only compare a crawl with its previous crawl.17 April: The Lowest DR filter is now also in Site Explorer’s Organic keywords report. It makes it easier to spot opportunities where you can rank with a low-DR website by letting you filter through high-difficulty keywords where a “weak” website ranks at the top. 4 April: This one’s for all of you who still haven’t found what you’re looking for~*~ in Rank Tracker’s GSC report, at least. Now you can just use this URL filter 😉 3 April: You can now export data directly from all Site Explorer and Keywords Explorer reports to Google Sheets. Just link your Google account and allow permissions. 1 April: Fresh out the oven on Keywords Explorer’s Overview: search type distribution! See the percentage of searches for a keyword that go to web, image, video, and news, and optimize content you create for the format that searchers prefer. 24 March: Site Explorer’s Calendar report just had its final evolution with the Backlinks tab. Watch it in action:🗓️ NEW: Backlinks calendar in Site ExplorerWant to monitor new and lost backlinks on a daily basis?Now you can, thanks to our latest backlinks calendar.Here’s a sneak peek 👀 pic.twitter.com/fbvZrnAh4D— Ahrefs (@ahrefs) April 2, 2024 22 March: We’ve got two new metrics in Keywords Explorer, and a nifty video to show them off.NEW: Keyword metrics in Keywords Explorer 🔑✅ First seen date: The date we first discovered a keyword[available on all new plans]✅ Device distribution: The amount of desktop vs. mobile searches[available on new Advanced plans and higher]See them in action! 👇😎 pic.twitter.com/mF8wzKKwRB— Ahrefs (@ahrefs) March 27, 2024 21 March: It’s an APIv3 updates kind of day. First, our keywords history endpoint now supports the select query parameter and more ranking groups (top 11-20, 21-50, and 51+.) This finer segmentation lets you do quicker updates for keywords with ranking potential.Also, you can now fetch outgoing link counts and optimize them at scale with our new Outlinks stats endpoints. This was requested only about a million times 😉 Read documentation 20 March: With Rank Tracker’s new and ~upgraded~ Tags 2.0 report, you can see historical data, sort by changes, and click on the Keywords column to view them in Overview 2.0. 11 March: We’ve added our first Site Audit APIv3 endpoint for Health Scores! You can now monitor drops and improvements in their Health Scores programmatically. Read API documentation 8 March: Announcing a couple of improvements for Rank Tracker’s GSC pages report: you can now filter by page clicks, impressions, CTR, and average position. 6 March: Pages 2.0 in Rank Tracker is live: it shows you all the URLs ranking for your tracked keywords + important metrics for them. New additions include traffic value numbers, SERP titles, historical data, and new filters to zoom in on data. Watch video 4 March: Now when you export a backlinks report in Site Explorer, you’ll see redirect chain URLs in your files. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs.",
  "headers": [
    {
      "level": "H1",
      "text": "Ahrefs Changelog: Running List of New Features"
    },
    {
      "level": "H2",
      "text": "General"
    }
  ],
  "author": "Rebekah Bek"
}