{
  "url": "https://ahrefs.com/blog/optimize360/",
  "slug": "optimize360",
  "title": "Optimize 360: \"We switched to Ahrefs and 3x'ed our organic traffic\"",
  "description": "Site Explorer Overview graph, Organic traffic and referring domains over the last year. According to the team, this growth came down to one main factor:",
  "content": "Constance Tan Constance is devoted to improving the value users get out of Ahrefs. She enjoys trying new things, and learning about the many ways software eats the world.Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents After switching from Semrush to Ahrefs, Optimize 360 grew their organic traffic more than 3x in the course of 12 months:Site Explorer Overview graph, Organic traffic and referring domains over the last year.According to the team, this growth came down to one main factor: the improved quality of Ahrefs data. Ahrefs is simply the best SEO tool on the market. The tool offering is very complete, covering many areas of SEO. I use both Semrush and Ahrefs, and I can see that Ahrefs’ data is more precise so far.Frédéric POULET, Founder & CEO, Optimize 360About Optimize 360Optimize 360 is a digital strategy and SEO agency founded in 2012, serving small and medium-sized businesses across France and Europe.Problem: Semrush data wasn’t up to parWhen Optimize 360 first started out, Semrush was their go-to SEO tool. Over the years however, they grew unhappy with it:Inadequate keyword data. They found Semrush’s keyword database to be insufficient. According to Optimize 360’s CEO,False positives from technical audits. their technical audits were frequently flagging false positive and false negative issues for both their client’s website and their own. Lots of time was wasted working with client webmasters looking for issues that did not exist.Hard to find SEO opportunities. According to their experience, Semrush also tended to be late in reporting semantic SEO data. This made it difficult for the team to discover and respond to SEO opportunities in time.Solution: switch to Ahrefs for best-in-class dataOptimize 360 decided to switch to Ahrefs. They found three main benefits from making the switch:1. More accurate technical SEO recommendationsUsing Site Audit, they finally managed to resolve technical SEO issues flagged correctly on their website. Being able to focus more on deepening their SEO expertise rather than diagnosing discrepancies previously caused by false positives was a great boost for the team’s productivity.In addition, Optimize 360 found that Ahrefs was more reliable and better than Semrush, particularly in the technical SEO analysis and semantic SEO departments.2. Larger, more accurate keyword databaseAhrefs’ larger keyword database also allowed for more in-depth semantic analysis by using Competitor Analysis reports to benchmark against their competitors. For example, Content gap was used to uncover programmatic SEO strategies their competitors were using. This inspired them to use similar strategies on their own site and saw enormous gains in both share of voice and rankings.3. Easier monitoring of keyword cannibalizationOptimize 360 also managed to identify cannibalized pages for important keywords, something they weren’t able to achieve with Semrush. They used Rank Tracker to monitor important keywords and found both their homepage and their dedicated “SEO Agency” page competing for multiple “SEO agency” related keywords with the same intent. In Semrush, we could only see the keyword position number, without being aware that we had multiple pages ranking closely for the same topic. The Positions history chart was very helpful in finding out our content cannibalism issues. Without Ahrefs, we would still be focusing primarily on competitive analysis with external websites, without realizing that the initial issue was actually an internal one.Frédéric POULET, Founder & CEO, Optimize 360Get world-class data with AhrefsTired of inaccurate data and false positives? Sign up for an Ahrefs account and get started with the tools that helped Optimize 360 3x their organic traffic:Site AuditContent Gap, Competitor AnalysisBacklinks report, Site Explorer Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Constance Tan Constance is devoted to improving the value users get out of Ahrefs. She enjoys trying new things, and learning about the many ways software eats the world.",
  "headers": [
    {
      "level": "H1",
      "text": "Optimize 360: “We switched to Ahrefs and 3x’ed our organic traffic”"
    },
    {
      "level": "H2",
      "text": "Problem: Semrush data wasn’t up to par"
    },
    {
      "level": "H2",
      "text": "Solution: switch to Ahrefs for best-in-class data"
    },
    {
      "level": "H3",
      "text": "1. More accurate technical SEO recommendations"
    },
    {
      "level": "H3",
      "text": "2. Larger, more accurate keyword database"
    },
    {
      "level": "H3",
      "text": "3. Easier monitoring of keyword cannibalization"
    },
    {
      "level": "H2",
      "text": "Get world-class data with Ahrefs"
    }
  ],
  "author": "Constance Tan"
}