{
  "url": "https://ahrefs.com/blog/orchard-seo-strategy/",
  "slug": "orchard-seo-strategy",
  "title": "Steal Our SEO Strategy for 2024 (+ Free Template)",
  "description": "Learn a simple process for ranking higher in Google with the Orchard SEO strategy.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Everyone’s SEO strategy is pretty much the same at the basic level. You find keywords people are searching for and create optimized content to rank for them.But how exactly do you do this?In this guide, I’ll show you how to get results with the Orchard SEO strategy.Looking for the Middleman Method?Don’t worry, you can click here to jump to that section or watch our YouTube video.ContentsWhat is an SEO strategy?Put simply, an SEO strategy is an action plan for improving your website’s visibility in search engines like Google. It outlines the steps you’ll take to create and optimize content to get more organic traffic.Here’s the SEO strategy I’ll walk through in this post:Follow along: Download our free SEO strategy templateGoogle Docs →Microsoft Word →How to create your SEO strategy (by filling in the template)Follow the four steps below, filling in the SEO strategy template as you go.1. Plan: Benchmark your SEO performance and set a goalThe broad goal of creating an SEO strategy is to increase traffic. But a broad goal like this is far too vague to be useful. It needs to define things like how much you aim to improve traffic by, over how long, and how you’ll measure results.In our template, we use the SMART framework for this.Here’s what the SMART version of “increase organic traffic” might look like:Specific: 10% is a cold, hard number.Measurable: You can track traffic in tools like GSC and Ahrefs.Attainable: The goal itself (10% in 6 months) is sensible and realistic.Relevant: More traffic usually leads to more customers.*Time-bound: 6 months is how long we’ve got.Sidenote. *If you’re thinking that more traffic doesn’t always lead to more revenue, you’re right! You need to attract the right kind of traffic, or it’ll be worthless. I’ll explain how to do that later. For now, know that if you have conversion tracking set up, it’s fine to set a goal like “increase sales…” instead.If you’re not sure what’s achievable for you, consider how much traffic you already get. If it’s millions of visits per month, you’ll struggle to improve that by 50%+ in a few months. But a 100+% improvement should be easy if you only get a thousand visits.Here’s how to check your organic traffic for free in Google Search Console:Head to the Search results reportSwitch the period to the last 28 daysCheck the “Total clicks” numberThis is how much organic traffic your site received from Google in the last 28 days.If you’re not set up with Google Search Console, get an estimate with our free website traffic checker.Record your SMART goal in the SEO strategy template once you’ve settled on one:2. Plant: Use “seeds” to find and target winning keywordsYou can’t grow fruit without planting trees. And you can’t get traffic from Google without targeting keywords people search for.Here’s how to do this:a) Find and record keyword ideasHead over to Ahrefs’ Keywords Explorer (or our free keyword generator) and follow these steps:Enter a few broad “seed” words or phrasesChoose your target countryGo to a keyword ideas reportFor example, let’s enter “coffee” and “espresso” as seeds and check the Matching terms report. This gets us over 1.1 million keyword ideas:Impressive as that may be, nobody can target that many keywords. So, let’s narrow down the list with a few filters:Filter for keywords with a low Keyword Difficulty (KD) score, like <20Filter for keywords with websites of similar authority to yours ranking in the top 5. You can use the “Lowest DR” filter to do this. Just add 10 to your site’s Domain Rating (DR), enter that number, and choose “In top 5”. (You can use our free website authority checker to find your site’s Domain Rating.)Click the “Clusters by Parent Topic” tab to group keywords that mean the same or similar things.From the refined list, look for keywords with traffic and business potential.You can see traffic potential in Ahrefs by checking the TP column:For business potential, here’s the scale we use at Ahrefs:Record 10-20 promising keywords in your copy of the SEO strategy template. (Don’t worry about the “Search Intent” and “Status” columns for now)b) Check search intentYou shouldn’t plant trees unless you have the right soil for them. And you shouldn’t target keywords unless you can give searchers the type of content they want. This is known in the SEO world as matching search intent.To find search intent, check the top-ranking results for your keyword. You’re looking for the most common type of content, which will usually be one of these:Blog postsInteractive toolsStore product pagesStore category pagesVideosFor example, the top results for “best espresso machine” are all blog posts. It’s obvious from the titles.You should write a blog post to stand the best chance at ranking for this keyword.Now look at the top results for “coffee table.” This time, they’re all store category pages:To stand the best chance of ranking for this keyword, you should create a store category page. That’s not going to be possible unless you have an online store.Record search intent for all your keywords in the SEO strategy template. If you can’t create the type of content searchers are looking for, tag the status as “Rejected.” Otherwise, tag it as “Not started.”Want an easier way to gauge search intent?In Ahrefs’ Keywords Explorer, click the “Identify intents” button on the SERP Overview. This will use AI to identify the most common intents among the top-ranking pages.For example, let’s click it for the keyword “best espresso machine.” It says most people are looking for detailed product reviews and comparisons. That’s going to mean writing a blog post.Further readingWhat is Search Intent? A Complete Guide for Beginnersc) Create and optimize contentHaving the right soil is a great start, but you’ll get nowhere unless you actually plant and water the seed. This means you need to create and optimize content to rank in Google.Follow our on-page SEO checklist to do that:In the SEO strategy template, tag your keywords as “In progress” when you start working on them. Switch to “Done” once complete.3. Pick: Find low-hanging fruit keywords to optimize forGiven some time, your seeds should start to grow and bear fruit. In other words, you’ll start ranking on the first page of Google for some of your target keywords.Unfortunately, you likely won’t get that much traffic unless you rank high on the first page.For example, let’s check the Traffic share by pages report for “SEO basics” in Keywords Explorer. Around two-thirds of clicks go to the top two results:Those ranking at or near the bottom of page one are lucky to get even 1% of clicks:This might seem depressing, but there’s a silver lining. If you can boost these rankings by a few positions, you’ll get way more organic search traffic.If you’re already tracking your keywords in Rank Tracker, you can find those you rank for in positions 2-10 by filtering the Overview report.If you don’t use a rank tracking tool, sign up for a free Ahrefs Webmaster Tools account and do this:Enter your website in Site ExplorerGo to the Organic Keywords reportFilter for keywords in positions 2-10Look for keywords that you’re targetingFor example, we’re ranking in position #5 for “affiliate marketing.” This keyword gets an estimated 179K monthly searches in the US. If we could boost our ranking a few spots, we’d likely get way more traffic.Record 10-20 keyword opportunities like this in the SEO strategy template. Add their ranking positions but don’t worry about the other columns for now.Remember to keep ‘business potential’ in mind when picking keywordsIt’s pointless watering a tree unless it’ll bear more fruit. And it’s pointless to optimize pages for keywords that have no value for your business. Use the “Business Potential” framework I shared earlier to estimate a keyword’s value.You could rely on conversion tracking in Google Analytics instead (if you have it set up). It’ll give you a better idea of how lucrative the extra traffic is likely to be.4. Press: Make optimizations to boost rankingsLow-hanging fruit keywords in hand, the next step is to press more juice out of them. This means figuring out why they’re not ranking higher and re-optimizing.To do this, start with the easier things within your control. If those don’t work, move on to the more challenging tasks.Here’s the process we recommend:a) Make sure your page covers the topic in fullYour content is already ranking for its target keyword, so it must be a decent match for search intent. But there could still be things you missed. It’s often possible to improve rankings by adding these to your content.Here’s a simple way to find these subtopics in Ahrefs’ Competitive Analysis tool:Select the “Keywords” tabPaste in the URL of your pageEnter the URLs of competing pages that outrank youHit “Show keyword opportunities”You should then see keywords at least one competing page ranks for but you don’t.Looking through these keywords, you can often spot subtopics you forgot to mention.For example, take the top-ranking pages for “guest blogging.” These all also rank for “guest blogging best practices.” Our page doesn’t rank anywhere in the top 100 for that keyword.This is likely because our page does not have a section about guest blogging best practices. If we added this, chances are we could rank for this keyword. Google may also rank the page higher for “guest blogging” as it’s more comprehensive.Repeat this for each keyword and fill in the “Fully covers the topic?” column in the template:For any no’s, it’s worth adding a comment to remind yourself what you need to add.b) Make sure your on-page SEO is on pointYou should have already done basic on-page SEO when you published your content. But there may still be room for improvement. This is often true when it comes to your title tag and meta description.For that reason, it’s worth having another quick look at how your page looks in the context of the SERP. Ask yourself:Does it still align well with intent?Could either the title or meta description be more compelling?Are either of them truncating?For example, let’s audit our blog with Ahrefs’ Site Audit and go to the “Issues” tab in the Content report. You can do this for free with an Ahrefs Webmaster Tools account. In our case, there are 247 pages with long titles.If we click the number to see the affected pages, we see that one is our guide to content hubs.Let’s check the top few Google results for “content hubs” and see what our competitors are doing. It looks like they all mention “examples” in their titles.Despite already having a section with examples in our post, we didn’t put this in the title. This gives us an opportunity to fix the length issue and make the title a better match for search intent. Something like this should do the trick:Content Hubs for SEO: Examples + How to Create ThemEven if this doesn’t help us rank higher, it will likely get us more clicks—which means more traffic.Repeat this for each keyword and fill in the “On-page SEO on point?” column in the template:(Again, add comments if necessary to remind yourself of what to improve.)c) Make sure your page has all relevant internal linksInternal links are links from one page on your website to another. They help visitors find their way around and pass PageRank to pages. This can help them rank higher on Google.If your page doesn’t already have all the relevant internal links it could have, adding them is a quick win.Here’s how to find missed internal linking opportunities for free:Crawl your website with Site Audit (free with Ahrefs Webmaster Tools)Go to the Internal link opportunities toolPaste the URL of the page you’re optimizing into the search box and select “Target page” from the dropdownFor example, let’s set our target page to our guide on how to get backlinks. This gives us 40 potential internal linking opportunities. Here’s one of them:It suggests linking the phrase “get backlinks” in our list of link building tools to our post.Not seeing many results in the Link Opportunities report? This can happen if the target page doesn’t rank for many keywords, so try this instead:Go to the Page explorer toolClick the advanced filterClick +Rule twiceSelect “Page text” from the first dropdownSelect “Contains” from the second dropdownEnter your target keyword in the search boxSelect “Internal outlinks” from the dropdownChange the second dropdown to “Not contains”Enter the URL of the target page in the blank fieldHit “Apply”This finds keyword mentions on pages that don’t already have internal links to the target page.For example, our list of Google search operators contains the phrase “keyword research.” But it doesn’t link to our keyword research guide:This seems like a good place to add an internal link.Repeat this for each keyword and fill in the “All relevant internal links added?” column in the template:For any no’s, add a comment with a link to the report in Site Audit. This way, you can find all missing internal link opportunities for each keyword with one click.d) Make sure its link profile is strong enoughBacklinks are links from one website to another, and they’re one of Google’s three major ranking factors. If your page has way fewer backlinks than the pages outranking it, you’ll likely struggle to rank higher.For example, our keyword research guide has links from 2.1K+ websites and ranks #6 for “keyword research.”Unfortunately, the pages outranking us have links from way more websites. Because of this, ranking higher is unlikely anytime soon.If we were closer to the competition, getting a few more good backlinks could make all the difference.For example, we rank #2 for “SEO basics” and have links from almost as many websites as the page outranking us:We could likely outrank this page by building a few more high-quality backlinks to our page.Repeat this for each keyword and fill in the “Strong enough backlink profile?” column in the template:Check out the resources below if you need more links. It’s something we’ve covered many times on the blog.Further readingLink Building for SEO: The Beginner’s Guide9 Easy Link Building StrategiesThe Only 8 Link-Building Tools You Need9 Easy Local Link Building TacticsStruggling to get backlinks? Try the Middleman MethodLink building is difficult, especially if your content has commercial value. So if you’re struggling to build quality backlinks to the page you want to rank, try the Middleman Method.Here’s how it works in a nutshell:Find or create a piece of informational content on a similar topic.Build links to that content.Internally link to your “money” page from there to boost its PageRank.Learn more in this video:https://www.youtube.com/watch?v=433XlvMl508Example SEO strategiesIf you want to see examples of other SEO strategies from real companies, check out our deep dives below:ZapierWiseRTINGSWirecutterGrammarlyCarWowHealthlineExamineBonus SEO strategy: The Middleman MethodGetting links is obviously an important part of any successful SEO strategy. But people don’t usually want to link to commercial content like sales pages. Those have little to no value for their audience.This often makes it hard to get enough backlinks to your “money” pages to rank. That’s where the “middleman” technique comes in.Here’s a neat animation of the process:Here’s how it works:You have a bunch of websites who might be interested in linking to your content. Let’s call them “linkers.”You have your money pages.Because the vast majority of these people won’t be linking to your money pages, you add a “middleman” —a relevant blog post or informational resource.The “middleman” (e.g., blog post) builds “authority,” which can then be passed onto money pages using internal links. The result? More powerful money pages that should help you rank and hopefully bank.Let’s go through how to do it.Step 1. Choose a “money” page to boostThis is the easy part. You probably already have a page in mind that you’d like to boost.If not, use this venn diagram to choose:For pages in the middle, a small SEO boost has the potential to lead to significantly more traffic—and maybe even revenue.If you’ve set up goals and conversions in Google Analytics, finding pages that fit the bill is as easy as pie. However, not everyone is an Analytics whizz, so here’s a quick hack for the rest of us:Paste your domain into Site ExplorerGo to the Organic keywords reportFilter for keyword rankings in positions 2-10PRO TIPIt also makes sense to exclude as much informational content as possible from this report. The easiest way to do that is to exclude URLs containing /blog/ (or whatever subfolder you use for the bulk of your ‘informational’ content) using the exclude feature.Looking at this report for ahrefs.com, I can see that we rank #2 for “domain authority checker.” This page is a tool and has reasonable business value for us, so it could use a rankings boost.Step 2. Find relevant “middleman” opportunitiesNow that you’ve identified a page to boost, you need to find strong relevant “middleman” pages from which to add internal links.There are three ways to do this.Use Google + Ahrefs SEO ToolbarHead over to Google and search for: site:yourwebsite.com + “topic of your ‘money page'Change the website and keyword phrase as required.If we were looking for places from which to link to our Keyword Generator landing page, we’d search for something like site:ahrefs.com/blog/ + “keyword generator”.The results are blog posts that mention the target phrase. In this case, “keyword generator.”Here’s an excerpt from one of the results:You can see that while this page mentions the phrase “keyword generator,” it doesn’t link to our Keyword Generator landing page.That’s a perfect contextual internal linking opportunity!If you see lots of opportunities in the search results, use the Ahrefs SEO Toolbar to prioritize them by URL Rating (UR):Use the Best by links report in Ahrefs’ Site ExplorerEnter in the domain or subfolder you want to analyze in Site Explorer, then head to the Best By links report.This report, as the name suggests, shows which pages on your target gave the most backlinks.All we need to do is skim this list for relevant internal linking opportunities.For example, say that the “money page” we want to boost is our Keywords Explorer landing page.Looking at the Best by links report, it doesn’t take me long to spot this page with over 1,700 referring domains:In this case, the page already has a link to Keywords Explorer. But if it didn’t, this would be a good place to add one.Use the Internal link opportunities report in Site Audit (free)Paste your target “money” page into the search field and choose “Target page” from the dropdown:Below, you will see a table with contextual internal link suggestions.For example, this suggests linking from our Academy page on how to use Site Explorer to our free backlink checker. The reason for this is that there’s a mention of “backlink checker” on the page, which is the perfect place for an internal link:Don’t have any relevant pages with ‘link authority’?No problem. Use the skyscraper technique or create a piece of linkbait to earn them. Then you can pass that authority to “money” pages with internal links.Repetition is the key to success with our SEO strategy!If you want more juice, you need to keep planting trees, picking fruit, and pressing fruit from them. The same is true with SEO. You need to keep publishing new content, finding low-hanging keywords, and re-optimizing.That said, it makes sense to put resources into the juiciest SEO opportunities—even if they’re hard to reach.In the context of SEO, the juiciest opportunities are those that:Have high traffic potential.Have high ‘business potential’.For example, if you sell blue widgets online, the keyword “blue widgets” is a juicy SEO opportunity. You’d be wise to assign plenty of resources to rank for this keyword from the very beginning.Got questions? Ping me on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Keep Learning Steal Our SEO Report Template (Inspired by SEO Experts) Not sure how to create the perfect SEO report? Steal our SEO report template and make it even better as we go through it slide by slide. Steal Our SEO Specialist Job Description Template This SEO specialist job description template was created from a survey of 15 SEO hiring managers. Steal Our SEO Specialist Resume Template Want to get a job in SEO? Let me show you how to create a resume that gets you noticed by hiring managers. The Ultimate SEO Contract Template [100% Free] Need a customizable SEO contract template for your clients? Grab a copy of our free template built for contractors and agencies. Free SEO Audit Template (With Video Walkthrough) 100% free to download in multiple formats (Docs, Sheets, Excel, Word, PDF). Covers technical, content, and link optimization for a comprehensive SEO audit.",
  "headers": [
    {
      "level": "H1",
      "text": "Steal Our SEO Strategy for 2024 (+ Free Template)"
    },
    {
      "level": "H2",
      "text": "What is an SEO strategy?"
    },
    {
      "level": "H2",
      "text": "Follow along: Download our free SEO strategy template"
    },
    {
      "level": "H2",
      "text": "How to create your SEO strategy (by filling in the template)"
    },
    {
      "level": "H3",
      "text": "1. Plan: Benchmark your SEO performance and set a goal"
    },
    {
      "level": "H3",
      "text": "2. Plant: Use “seeds” to find and target winning keywords"
    },
    {
      "level": "H4",
      "text": "a) Find and record keyword ideas"
    },
    {
      "level": "H4",
      "text": "b) Check search intent"
    },
    {
      "level": "H4",
      "text": "c) Create and optimize content"
    },
    {
      "level": "H3",
      "text": "3. Pick: Find low-hanging fruit keywords to optimize for"
    },
    {
      "level": "H3",
      "text": "4. Press: Make optimizations to boost rankings"
    },
    {
      "level": "H4",
      "text": "a) Make sure your page covers the topic in full"
    },
    {
      "level": "H4",
      "text": "b) Make sure your on-page SEO is on point"
    },
    {
      "level": "H4",
      "text": "c) Make sure your page has all relevant internal links"
    },
    {
      "level": "H4",
      "text": "d) Make sure its link profile is strong enough"
    },
    {
      "level": "H2",
      "text": "Example SEO strategies"
    },
    {
      "level": "H2",
      "text": "Bonus SEO strategy: The Middleman Method"
    },
    {
      "level": "H3",
      "text": "Step 1. Choose a “money” page to boost"
    },
    {
      "level": "H3",
      "text": "Step 2. Find relevant “middleman” opportunities"
    },
    {
      "level": "H4",
      "text": "Use Google + Ahrefs SEO Toolbar"
    },
    {
      "level": "H4",
      "text": "Use the Best by links report in Ahrefs’ Site Explorer"
    },
    {
      "level": "H4",
      "text": "Use the Internal link opportunities report in Site Audit (free)"
    },
    {
      "level": "H2",
      "text": "Repetition is the key to success with our SEO strategy!"
    }
  ],
  "author": "Joshua Hardwick"
}