{
  "url": "https://ahrefs.com/blog/outsourcing-writers/",
  "slug": "outsourcing-writers",
  "title": "How to Outsource Your Content to Freelance Writers (4 Steps)",
  "description": "Learn how we grew the Ahrefs blog by thousands of visitors per month with freelance writers, and how you can do the same.",
  "content": "Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Step 1: Post on a freelancing website. Step 2: Get 9,659,854 low-quality applications. Step 3: Give up. Continue writing the content yourself. *sigh*Outsourcing has a poor reputation thanks to a seemingly never-ending supply of flaky freelancers who do shoddy work.But that doesn’t mean you’ll always get bad results when you outsource content creation.Before 2018, we worked with freelancers to produce most of the content on the Ahrefs blog—one of whom was our very own Joshua Hardwick.We still managed to increase our blog traffic month after month:Our organic traffic growth in 2016, when we were mainly working with freelancersIn other words, when done right, outsourcing can be quite powerful.In this article, I’ll show you our proven process for finding and working with freelance writers. I’ve also tested some popular freelance websites so you don’t waste time and money on those that aren’t worthwhile.But first…When should you outsource?Here’s a fantastic flowchart from Tim Ferriss’ Four Hour Work Week to help guide your decisions:Source: Four Hour Work Week.I love this flowchart. However, there are some other good reasons to outsource content creation:You’re too busy. Finding time to create content is impossible.You hate writing. Every time you sit down to write a post, you feel physically sick. Hemingway’s quote, “There’s nothing to writing. All you do is to sit at a typewriter and bleed” resonates deeply with you.You’re in an industry that requires domain expertise. You need a subject matter expert to create articles and provide accurate advice.You have a budget. You’re already doing content marketing and can see the ROI. All you have to do is to double down and scale it up.Have you decided that outsourcing content makes sense for your business?That’s the easy part.Is hiring a team of freelance writers right for your business?Hiring a freelance writer isn’t the only option available if you’re looking to outsource content creation.You could hire a content marketing agency, or delegate the work to an in-house writer.At Ahrefs, we’ve tried all three of those options.We’ve worked with an agency, we’ve worked with freelancers, and now we’re mainly in-house.I asked our CMO Tim for his advice on which to choose.Here’s what he said:It is actually dependent on your content marketing knowledge. If you have no idea how to run or grow a blog, choose an agency. They have the expertise and can help you with your goals.However, agencies are usually contract-based and thus have higher switching costs. They also tend to have their own processes for content marketing. If you want things done a certain way, working with agencies can be difficult.If you have existing knowledge, it’s better to work with freelancers. There are no obligations. You can work with a few, then pick the best ones. The only downside is that you have to train them in the way you want.The best solution is an in-house writer. They only work with you, and you can train them on everything content-related. There are fewer worries that he/she will leave or disappear suddenly.”Tim Soulo, CMO AhrefsTim’s preference is a team of in-house writers, which explains the current makeup of the Ahrefs marketing team.However, hiring in-house writers can be difficult and expensive, so the best option for most businesses is to start by hiring freelancers because:It’s cheaper.You can hire and fire as and when you need to.You can choose to pay a fixed price per article, regardless of the time it takes the writer to complete.You can hire as many writers as you need.There’s more diversity in writing style and viewpoints.The number of writers looking for freelance writing jobs is large, so you’ll have numerous options.Of course, there are some disadvantages:Writers may disappear or be unreliable.Writers may work for multiple clients at once, and they may not be as involved with your brand as an in-house writer.It’s harder for freelancers to collaborate with other team members.To reiterate, if you’re new to outsourcing content creation, then working with freelancers is almost certainly your best bet.In fact, this is the process used by some of the most successful content marketing agencies.For example, Growth Machine is a 6-figure content marketing agency with only five full-time staff (none of them writers!) They’ve outsourced all their content creation to contractors.Source: https://www.yourgrowthmachine.com/blog/how-we-work-at-growth-machine-year-oneWith that said, how do you get started?1. Decide on the type of writer you wantNot all writers are created equal.There is a difference between a copywriter, a journalist and a technical writer. Ask a journalist to write sales copy, and your conversion rates will tank. Ask a copywriter to report on the news, and your readers will leave in droves.Before you begin looking for a writer, you need to be clear about what you want.Here are some questions to guide you:What kind of content do you need? Are you doing interview pieces or producing technical how-to guides? Do you need a new blog post, or are you only looking to update your older articles?Do you need the writer to have domain expertise? Does your writer need to be an expert, like in the medical industry? In general, the more industry knowledge you require, the more expensive the writer.What is your budget? There are writers available at any price. Your budget per article will determine the quality of content you get.Your answers will affect the entire hiring process: where you look for writers, the copy in your job listing and much more. For example, this job listing from Grow and Convert states in no uncertain terms that they need a business writer who can interview marketers and turn them into articles:Don’t rush into the hiring process.Without clarity in this step, you may end up hiring a bunch of low-quality writers (and inadvertently create more work for yourself!)2. Put together a winning job listingMore does not always mean better.The goal of hiring is not to get as many applications as possible. Looking through poor applications is a waste of time.Instead, your goal is to find only relevant and qualified people.To do that, you need to structure your job listing so that it attracts the right kinds of writers. And this is where you include a few smart “pre-qualifying” tricks.The purpose of these tricks is to:Dissuade low-quality writers from applying;Allow for quick filtering of any low-quality writers that slip through the net;Encourage experienced, confident writers to take you seriously;Dissuade those with little or no experience in your vertical from applying.a) Give clear instructions on how to applyHere’s an excerpt from one of Tim’s old ads for Ahrefs:He outlines a predefined format for applications and expects writers to answer the questions in detail in a particular order.And this is precisely what David—our ex-Editor—did in his response:David’s response to Tim’s job listing.He followed the format and gave detailed responses to each of Tim’s questions.This isn’t the only way to do this. Companies like Growth Machine ask potential writers to fill in a Typeform:Growth Machine’s Typeform.By outlining a specific structure, you instantly dissuade lazy writers from applying, and that means less work for you.PRO TIPTell potential applicants to apply with a specific subject line. This little detail allows you to quickly weed out anyone who doesn’t bother to read the full listing. It also helps filter applicants who are incapable of following simple instructions.Working with freelance writers is all about effective communication. Being able to follow instructions should be the bare minimum.If they can’t do this during the application stage, it’ll be challenging to work together in the future.b) Ask insightful questionsYou should aim to find out the answers to these questions:How knowledgeable are they about your niche?Have they written similar content before?Do they have a genuine interest in your niche? (or perhaps write about anything and everything);Do they have high attention to detail?In Tim’s job listing, he asks five specific questions:Here’s what Tim had to say when asked about his thought process:Question #1: “What are your favorite SEO/marketing blogs…?”This gives me an idea of how knowledgeable that person in my niche. I know pretty much all the blogs in my niche and based on what a person is reading I can tell if he/she is a good fit.Question #2: “Did you ever guest post on one of these blogs?…”If he/she has written for some of the best blogs in our niche, it usually gives me the ‘green light’ right away. The owner of that blog effectively did the vetting work for me when they allowed the applicant to ‘guest post’ on their site.<blockquote<Question #3: “I need links to your blog/Twitter/Quora/etc. profiles”I use this to see if the applicant is genuinely interested in the niche and what he/she is actively sharing on social media.Question #4: “What’s your first-hand experience within this niche?…”I need to know that the applicant is not just a reader/writer, but a ‘“DO’er.” My goal with the Ahrefs Blog is to publish the kind of content you won’t find anywhere else. I’m not looking for people who can research stuff and rewrite it. I’m looking for people who can DO things and write about their first‐hand experience.Question #5: “What do you think of the posts currently on the Ahrefs blog?”I like to see whether a person can be honest and critical or flatter me by saying “your content is awesome, I want to be a part of it.” In my opinion, good writers see flaws in everything, so if a person will criticize our existing content, that’s a good sign for me personally. However, criticism for the sake of criticism means nothing. It needs to make sense and align with my vision for the Ahrefs Blog.The answers to these questions help Tim quickly assess whether the applicant is a good fit. Do the same for your listing.You don’t need to use these exact questions. Craft your own around what’s important to you.c) Challenge them early onIt’s a good idea to add friction points to dissuade lazy writers from applying. One method is to exclude your email in the ad. Just give them your name and website.If they want to get in touch and apply, they’ll have to make an effort to find it.Usually, all this takes is a simple Google search.They can also use some simple tools to find your email address.You’d be amazed at how few writers are willing to make any effort whatsoever, which is a tell-tale sign that you shouldn’t work with them.d) Give high-quality applicants a reason to applyYou’ve done enough to dissuade low-quality applicants. Now, you need to give your ideal applicants the right incentive to apply.Josh, who previously freelanced for seven years, said high-quality applicants usually want to know three things:Will they get paid a decent rate?Will you give at least some level of creative freedom?Is the job likely to be boring?https://youtu.be/z7OMr3bN8WY?t=408Here’s what he recommends you include:Your rough budget (e.g. $200+/article). This instills confidence that you’re willing to pay for quality.Insight into the kind of employer you are. Saying something along the lines of “I’m happy to give a lot of flexibility and creative freedom to the right applicant” goes a long way with great writers.Insight into the kind of content you want. Talk about your niche and give examples of material you like. If the applicant has a genuine interest in your industry, they won’t find it boring.Josh also recommends not to give an exact budget if possible. It’s much better (and more logical) to let writers tell you their rate. This is a win-win scenario. More often than not, you can negotiate and get content written for less. It also ensures that writers are happy with the rate offered and aren’t compromising from the start. Joshua Hardwick, Head of Content Ahrefs3. Look for writers on job boardsYou have the job listing. Where should you post it?One method is to post on freelance websites. But are any of them actually worth your time?In our previous version of this article (published in 2016), Josh conducted an experiment whereby he crafted a job listing for a writing position for his SEO blog, The SEO Project and posted it across seven sites:UpWorkPeoplePerHour.comGuru.comProblogger Job BoardBlogExpose.comBloggingPro.comFreelanceWritersDen.comHe then evaluated those applications. Here are his results:Now, it’s 2019. Are these sites better than they were in 2016? What about the newer ones?To answer that question, I replicated Josh’s experiment using The SEO Project. Similarly, I judged the best site by looking at:# of total applicants% of applicants who followed my instructions# of applicants I’d consider hiringCost! (where applicable)Here are the results:Sidenote. Check out the full spreadsheet here.And here’s my verdict on them:ProBlogger Job BoardIn 2016, Josh observed that ProBlogger not only sent the most applications, but also that the quality of said applications were particularly high.In 2019, the results are the same.I would happily hire seven of them (with one being a definite hire).The good news is: it’s cheaper to post on ProBlogger today (Josh paid $99 for a 30-day listing, whereas I only paid $70).BloggingPro.comIn 2016, Josh only received four applications from this website.In 2019, I received eight, four of whom followed my instructions to a tee.There were also a couple of writers whom I would hire, and one I rejected because he didn’t have sufficient knowledge in this particular industry.While I would recommend ProBlogger over this site, it wouldn’t hurt to post a job listing here if you have the budget to do so.AllFreelanceWritingJosh didn’t try this website in 2016. So, I tested it out.At ~$20 for a 30-day listing, I received four applications, of which one was hirable.That roughly equates to $5/application or a $20 hiring fee.Not too shabby, but I’ll still take ProBlogger any day.AngelListAngelList is a place where you can find a startup job, invest in a startup, or raise money for one.According to my friend Benji, it’s also a great place to find freelance writers.Potential writers apply for jobs via AngelList itself. As a result, the five writers that applied were unable to follow my instructions.The cool thing about this site is that you can check out applicants’ previous experience. Compared to other platforms, applicants have more legitimate-looking resumes.Example resume from AngelList.It is up to you to decide if a writer is worth hiring based on this.I would suggest jumping on a call and chatting with them to find out more about their experience.UpworkI found it surprising that I received only two applications from Upwork. I expected to get more (Josh received five in 2016.)Nevertheless, while the applicants were great at following the instructions, they were quite poor.I wouldn’t have hired either of them.HubStaff TalentHubStaff is a time tracking and productivity monitoring app. Talent is their free resource for helping companies find remote workers.It’s free, so I gave it a shot.However, I only received two applications, of which none were hirable.PeoplePerHourFun fact: Josh started his freelance career on this website.In 2016, the roles got reversed, but Josh was disappointed at the quality of writers here. 2019 is still the same. I received fourteen applications, most of which came via the platform.Those that applied for the job via the platform disregarded my requirements and sent generic pitches. Those that emailed me did better and managed to follow the format.Though, I would still say none of them came close to being hirable.FreelancerNone of the applicants from Freelancer were hirable.Nobody followed the instructions. Everyone sent a generic pitch.I wouldn’t hire anyone from here.Guru.comI hated this website. I submitted a similar job listing I used on the other sites to Guru.They rejected it and told me to improve the job listing.However, they did not tell me what to improve but instead just insisted that I improve it.The worst part is finding a less-than-impressive listing that they previously approved.Josh noted in 2016 that the applications he got from this site were, for want of a better word: junk.I would not recommend this site.Freelance Writers Den, Freelance Writing & BlogExposeIn 2016, Freelance Writers Den & BlogExpose were all a complete waste of time.Nothing has changed.BlogExpose is gone, and Freelance Writers Den still gathers zero responses from a job ad. The same goes for Freelance Writing, a new site I tried.They’re free, so there’s nothing to lose from posting a job listing. Just don’t expect much of a response.Sidenote. I also received a lot of unsolicited outreach from SEO agencies and link builders. These were templated emails that tried to persuade me to use their services. I deleted them.4. Look for writers elsewhereJosh is a perfect example of how to find a good writer.Here’s an email Josh received from Tim a couple of years ago:He saw something Josh wrote on his blog, liked it and decided to reach out.Here’s the lesson: if you’re looking to hire good writers, hope is not a strategy. Don’t just put up a job ad and pray that world-class writers will contact you. Make it a mission to proactively reach out to those who are a good match for your business.Here’s one way to do that:Find an industry site with multiple authors. Some examples in the SEO and marketing industry are the Ahrefs blog and Social Media Examiner.Enter the domain into Ahrefs Site Explorer and go to the Top Content report.Top content report for ahrefs.com/blog on Ahrefs’ Site ExplorerFor some sites (not all!), this report shows you the author of each content piece.Look for authors that are popping up a lot. If they’re frequently writing for the same site, they may be employed on a freelance basis, or at least willing to take on freelance work outside of their job.If you see a person’s name appearing over and over again (e.g., Benjamin Brandall, who wrote a post for our blog about why SEO is important), you could go one step further and do an author search in Content Explorer to see if they’re writing for other sites.Content Explorer > author:[firstname] [lastname] > one article per domainIt looks like Benjamin has written for many different sites!From here, you can find their email, reach out, and ask if they take on freelance work.Editor’s NoteBecause I am crazy with Google Sheets, I made a sheet that’ll help you identify the most prolific writers on a website quickly and easily. Get it here.First, export the Top Content report from Ahrefs and import it into the sheet named “1. Ahrefs import.” To do that, select cell A1 then hit File > Import… > Upload > choose the CSV export from Ahrefs > replace data at selected cellThen the next sheet (labeled “2. Results”) tells you who’s published the most posts and automatically creates a link to check them out in Content Explorer.Joshua HardwickHead of ContentYou can also find promising writers on Facebook. There are plenty of content marketing and writing-related groups where you can post a job offer. When I was looking for freelance writers in my previous job, I turned to Facebook:I had plenty of freelance writers message me saying they were interested. (I worked with one writer from this group.)I also posted the same thing on LinkedIn:I eventually found two writers to work with via this post.Found a good writer?Here are some tips for hiring and working with them.a) Start with a “test article”A test article is an important stepping stone for both parties.Like a probation period, it helps you figure out how skilled and reliable the writer is, and whether they’re a good fit for your business.You will usually negotiate a test article at a slightly lower rate. However, some writers will refuse to work at this discounted rate. At that point, rely on your intuition. If the writer didn’t seem that great initially, it’s probably safe to say goodbye. If the writer seems promising, it may be worth risking the money to see if they fit the bill.Here’s Josh reflecting on his early days: When Tim initially hired me, he hired me to write a test article. He gave me 3-4 topics to choose from, and we agreed on a fixed fee for the post. I chose to write about dwell time. He explained that if all went well with the test, he would want two articles per month from me going forward. The rest is history. Joshua Hardwick, Head of Content AhrefsTake note that this stage is not for you to lowball the writer into writing a free article for you. If you don’t like the article, pay them for their time and move on.Your reputation matters. If word gets out, hiring writers will get even more difficult.b) OnboardingWith all “tests” passed, you can finally hire them “officially.”Now it’s time to communicate your business goals, company core values, target audience, and any other important marketing and business information. Send them an editorial guide to ensure that they understand how to format their posts for your blog.Give them access to your communication tools (e.g., Slack). Discuss with them how to track their hours and how payment will work. Process all administrative matters, so the work going forward is a cinch.Teach them how your product works. At Ahrefs, we use our articles to educate users on how to use our product. To do that successfully, our writers must be familiar with our toolset. Knowing the ins and outs of our product allows writers to weave use cases into content easily.c) Working togetherWorking with one writer is easy. Working with many? You’ll need a process.There is no specific way of doing this. Every company has its own. Instead of giving you the “one true way,” I’ll share the “behind the scenes” look at how Ahrefs creates content.We use this process for both our in-house and freelance writers.It starts with a list of potential topic ideas. When Josh was freelancing, Tim used to send a list of ideas to him:From this list, we’re free to choose the topics that interest us most.We then add the chosen topic(s) to our project management tool, Notion.After reviewing the SERPs and brainstorming ideas (via our copywriting process), we create a rough outline for the post.Here’s an example for this post (meta!):In the document, I describe my thought process to Josh. I’ll tell him what I think searchers are looking for (search intent), what angle we should take, suggest a few headlines and show him an outline of the subtopics we should cover.For this, we use Google Docs.Josh then comments on whether he agrees and if the outline works. If we get the go ahead, we’ll then start working on our first draft. (If not, it’s back to the drawing board.)Once the draft is complete, Josh will review and give his comments. Sometimes, Tim will also chime where relevant.Josh’s comments on the initial draft of this post.I’ll then review any comments, edit the post (sometimes multiple times) and it goes live.Without a defined process like this, efficient collaboration would be near impossible. However, we’re able to collaborate (almost) as efficiently as we would in-person, which allows us to overcome one of the main drawbacks of outsourced content creation.Yes, it takes some time and effort on your part, but it pays off in the long run.d) Keep them motivatedFreelancers are not technically employees, but the relationship is still a potentially long-term one.If you stumble upon a great writer, you need to keep them motivated so that they stay with you for as long as possible. (Josh wrote for Ahrefs for 18 months before turning full-time!)Monetary incentives are one way to do this. But, don’t neglect the softer, human approach.Make them feel part of the team.Let them know their work is important.Share company news with them.Show them performance metrics so that they know what they’re doing is working.One of the best things you can do for a freelancer is to give them an outside perspective. Offer feedback on their writing and help them improve. As Ryan Holiday says in Perennial Seller, “Nobody creates flawless first drafts. And nobody creates better second drafts without the intervention of someone else.”Who knows?They may be freelancers now. But they might eventually decide to come onboard full-time too.Final thoughtsThis entire article is based on our experience running and growing the Ahrefs blog via an outsourced team.Though we’re mostly in-house now, we wouldn’t have been able to grow the blog to where it is today without freelance writers. Even now, we still work with freelancers like Benjamin from time to time to craft articles.Now, we’d love to hear from you.Let me know in the comments if I missed out anything or if you have any thoughts to share! 🙂 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Keep Learning How to Hire Freelance Writers in 5 Steps (Ahrefs’ Process) Learn how to use the freelance funnel to vet thousands of writer applications and find the best ones. Here’s How You Can Outsource SEO Easily and Effectively (+ Best Practices) Learn what SEO outsourcing is, services often outsourced, and best practices for outsourcing based on my agency experience.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Outsource Your Content to Freelance Writers (4 Steps)"
    },
    {
      "level": "H2",
      "text": "When should you outsource?"
    },
    {
      "level": "H2",
      "text": "Is hiring a team of freelance writers right for your business?"
    },
    {
      "level": "H2",
      "text": "1. Decide on the type of writer you want"
    },
    {
      "level": "H2",
      "text": "2. Put together a winning job listing"
    },
    {
      "level": "H3",
      "text": "a) Give clear instructions on how to apply"
    },
    {
      "level": "H3",
      "text": "b) Ask insightful questions"
    },
    {
      "level": "H3",
      "text": "c) Challenge them early on"
    },
    {
      "level": "H3",
      "text": "d) Give high-quality applicants a reason to apply"
    },
    {
      "level": "H2",
      "text": "3. Look for writers on job boards"
    },
    {
      "level": "H3",
      "text": "ProBlogger Job Board"
    },
    {
      "level": "H3",
      "text": "BloggingPro.com"
    },
    {
      "level": "H3",
      "text": "AllFreelanceWriting"
    },
    {
      "level": "H3",
      "text": "AngelList"
    },
    {
      "level": "H3",
      "text": "Upwork"
    },
    {
      "level": "H3",
      "text": "HubStaff Talent"
    },
    {
      "level": "H3",
      "text": "PeoplePerHour"
    },
    {
      "level": "H3",
      "text": "Freelancer"
    },
    {
      "level": "H3",
      "text": "Guru.com"
    },
    {
      "level": "H3",
      "text": "Freelance Writers Den, Freelance Writing & BlogExpose"
    },
    {
      "level": "H2",
      "text": "4. Look for writers elsewhere"
    },
    {
      "level": "H2",
      "text": "Found a good writer?"
    },
    {
      "level": "H3",
      "text": "a) Start with a “test article”"
    },
    {
      "level": "H3",
      "text": "b) Onboarding"
    },
    {
      "level": "H3",
      "text": "c) Working together"
    },
    {
      "level": "H3",
      "text": "d) Keep them motivated"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Si Quan Ong"
}