{
  "url": "https://ahrefs.com/blog/portfolios/",
  "slug": "portfolios",
  "title": "Introducing: Portfolios",
  "description": "Ahrefs' Portfolios allow you to group URLs from 10 different domains and monitor their aggregated metrics in Site Explorer's reports.",
  "content": "Andrei Țiț Showing you how to make the most out of Ahrefs. Mostly through: how-to videos, product updates, webinars, and brochures. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents We’ve just launched a new view that’s useful for both in-house and client reporting: Portfolios.ContentsHow Portfolios workPortfolios allow you to group a list of targets (domains, subfolders, or URLs) and view their aggregated metrics in Site Explorer’s reports.From here:1. Add URLs from up to 10 different domains2. Select the preferred protocol and target mode3. Name the portfolio4. Share it with the appropriate team membersOnce saved, the portfolio will always be shown on your dashboard, along with top-level metrics.Clicking on any of the metrics will take you to the corresponding report in Site Explorer.Now that you’re familiar with the interface, let’s jump into a few use cases.Use casesDepending on the target URLs added, you can use Portfolios to track the performance of:1. Your competitorsAdd your competitors’ websites to a portfolio to get extensive competitive intelligence insights:See the top winners and losers in terms of their top pages and keywords: (Top pages report > Traffic filter: Improved)Check out the pace at which they acquire new links and referring domains: (Backlinks report > Dofollow > New backlinks > Status: Newly published)Study their paid ads and paid keywords to understand which ones resonate with your target audience: (Paid pages report > Keywords and Ads nested tables)2. Your content writers and their portfoliosIf you have an internal content team, create a portfolio for each content writer and track their performance over time.For example, our content lead, Joshua Hardwick, has written 147 articles, which rank for 46,000 keywords that generate close to 250,000 organic search visits a month.You can also go one step further and compare your content team’s portfolios. This should help you with your overall content strategy and hiring decisions.3. Your published content on your client’s websiteIf you’re an agency, create a portfolio of your published content on your customer’s website and track the percentage (%) of organic traffic and backlinks it has generated compared to the rest of the website.The ROI of your content should be more transparent this way.For example, if we were to group our free tools into a portfolio, we’d notice they generate close to 937,000 organic search traffic a month.That’s 34% of our total traffic of 2.7 million search visits.Upcoming featuresPortfolios are available for new Standard, Advanced, and Enterprise plans.At the moment, Portfolios only work with Site Explorer. In the future, they will support:More Site Explorer reports (Best by links, Linked domains, etc.).APIv3 endpoints.We’re excited to see what other use cases you’re going to find for Portfolios!If you have any feature suggestions that could enhance the tool, let us know on our Canny page or Ahrefs community. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Andrei Țiț Showing you how to make the most out of Ahrefs. Mostly through: how-to videos, product updates, webinars, and brochures.",
  "headers": [
    {
      "level": "H1",
      "text": "Introducing: Portfolios"
    },
    {
      "level": "H2",
      "text": "How Portfolios work"
    },
    {
      "level": "H2",
      "text": "Use cases"
    },
    {
      "level": "H3",
      "text": "1. Your competitors"
    },
    {
      "level": "H3",
      "text": "2. Your content writers and their portfolios"
    },
    {
      "level": "H3",
      "text": "3. Your published content on your client’s website"
    },
    {
      "level": "H2",
      "text": "Upcoming features"
    }
  ],
  "author": "Andrei Țiț"
}