{
  "url": "https://ahrefs.com/blog/ppc-marketing/",
  "slug": "ppc-marketing",
  "title": "PPC Marketing: Beginner's Guide to Pay-Per-Click Ads",
  "description": "PPC (Pay-Per-Click) marketing is a form of online advertising where advertisers pay a fee each time someone clicks their ad.",
  "content": "Michal Pecánek SaaS SEO consultant with over 6 years of experience. Before going freelance, Michal was an SEO & Marketing Educator at Ahrefs–creating content for the blog and managing a team of guest writers. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents PPC (Pay-Per-Click) marketing is a form of online advertising where advertisers pay a fee each time someone clicks their ad. We all encounter these ads daily.Search ads are the most common ad format in PPC marketing:Display ads also fall under the PPC marketing hood (although there are different ways to buy these, other than PPC):The same applies to social media ads, like these on Facebook:For us marketers, PPC ads are a great way to drive traffic and conversions. And the good news is that once you know how to run PPC ads on one platform like Google Ads, it’s pretty easy to do it on other platforms like Facebook, Twitter, or Bing too.In this article, you’ll learn:What the benefits of PPC marketing areWhat the role of PPC in marketing isHow to succeed in Google Ads (and other platforms)What are the benefits of PPC marketing?There are four main reasons why PPC is such a useful marketing channel:1. You can drive traffic to your website instantlyIt takes just a few hours from the time you start learning about PPC marketing to when your first PPC campaigns begin driving traffic to your website.Compare that to any “free” alternative like SEO, social media, or email marketing. These often take months or years to start driving any substantial traffic. You can save countless hours by paying for every visit.2. You can target potential customers really wellYou usually only want to pay for clicks from people who are likely to buy from you, and all PPC platforms allow you to do exactly that.Just take a look at our five most promoted pages in paid search:When people click through to those pages, they’re likely to sign up for a free Ahrefs Webmaster Tools account or our toolset because they’re already aware of the problems they need to solve and are looking for a solution. And we provide those solutions.As you’ll see later on, you can choose when and where your ads appear and who sees them. PPC is the only marketing channel with such precise targeting options.3. You can measure it easilyGoogle Ads and all other PPC platforms provide a tracking pixel—a piece of code that connects the ad click with what the user does on your website and keeps you in the loop about things like ad engagement and costs.Here’s what it looks like at the ad level:All in all, you won’t find a marketing channel with more precise conversion attribution than PPC. It’s about as close as you’re ever likely to get to knowing how much each conversion costs.4. You can easily scale itIf you want to drive more clicks from your PPC campaigns, you can just pump more money into them. The same can’t be said for content marketing, SEO, or other marketing channels where much more time and work is required.However, before you decide to make significant investments into your PPC marketing, you should clearly understand its role in your marketing strategy. That includes having a plan of what you’re trying to achieve and how.What is the role of PPC in marketing?PPC marketing allows you to be more visible at the most crucial parts of the customer journey. In other words, when people are ready (or almost ready) to buy.That’s a crucial point to understand because it means that PPC ads are most effective when the following criteria are met:The potential customer is already aware of your brand.You have a great product at competitive prices.Your website has a good UX (user experience).The further you are from meeting these criteria, the less effective your PPC ads will be.Let me explain.Imagine that you’re in the market for a new coffee maker. You first read a bunch of relevant articles—what makes a good coffee maker, what to pay attention to, which brands people recommend, etc. You continue to read product reviews and pick a few favorites. Then it’s time to buy one, so you start looking up specific products.The closer you are to the buying decision, the more search ads will appear in your SERPs. You’re likely not ready to buy a coffee maker when you start searching for what makes a good one. But that changes once you start looking up keywords like “best espresso machines under $1000,” “Jura WE6 piano review,” or “buy Gaggia Classic Pro.”When it comes to clicking on the ads and making the purchase, you’ll lean towards brands and websites that meet the criteria listed above. Familiarity and brand awareness are especially key here.It’s important to remember that PPC marketing isn’t an almighty savior that will suddenly make your business thrive but a wheel in executing your overall marketing strategy.Google Ads BasicsEnough theory, let’s jump straight into Google Ads (formerly Google AdWords), the biggest advertising platform and the one that’s synonymous with PPC marketing for many people.Campaign types in Google AdsThese are six campaign types that you will encounter most often in your Google Ads account:Each campaign type differs by ad format, the placement of the ads, and targeting options. Let’s go over a quick overview of what they entail.1. Search campaignsThis is the most common format and probably something Google users associate with their ads. If the user input (keyword) matches what advertisers set up (more on that later), a search ad will be triggered.The ads can even take up the top four search results:2. Display campaignsGoogle’s display ads appear in a banner format throughout the whole Google Display Network (GDN). Many websites monetize their traffic by providing space for such ads:3. Shopping campaignsIf you’re a retailer, you’ll make use of shopping campaigns that let you promote products directly in the SERPs with images. They’re also known as Product Listing Ads (PLAs).4. Video campaignsWe all know the feeling of looking forward to watching a YouTube video and getting video ads in the way.They’re arguably one of the most annoying ad formats and the main reason people install ad-blocking plugins or pay for YouTube Premium. However, they can be incredibly powerful when done right. I’m sure you’ve already seen many video ads where not only did you not immediately click on “Skip Ad,” but you enjoyed watching it on the whole.5. Smart campaignsThis campaign type doesn’t provide a new ad format but rather a different kind of campaign management where you leave a lot of the work to Google’s algorithms. You essentially provide some data input from which Google figures out who to target, what to bid on, etc.This is what Google says about Smart campaigns:Smart campaigns are Google’s efficient, easy solution for small businesses and helps your business get discovered on Google in those relevant moments. Powered by the best of Google’s advertising technology, Smart campaigns bring you results based on your campaign goal, whether that be customer calls, visits to your location, or actions on your website.6. Discovery campaignsThis is the newest campaign type in Google Ads. Discovery campaigns are focused on advertising in Google Discover, an auto-generated and highly personalized mobile feed based on your online activity. It shows information and news about the topics that interest you, like SEO or golf.How PPC campaigns work in Google AdsPPC basics are quick and easy to understand. I’ll mainly focus on search ads and throw in some information about display ads as well as these two campaign types are relevant for everyone interested in PPC. We’ll go through the followings concepts here:The auction systemCampaign - ad group - ad hierarchyKeyword match types for search adsTargeting in Google Display NetworkExcluding specific keywords and websites from targetingWithout further ado…The auction systemWhenever your ad matches the criteria for appearing in front of your target audience, you’re entering an auction. Your competitors and other businesses also want to claim that ad slot. So how does Google decide which advertisers get it?These are the criteria that Google uses to determine the auction winner:The bid – maximum amount of money each eligible advertiser is willing to pay for the click (or other action).Ad quality – determined by a metric called Quality Score (QS). Google takes into account expected clickthrough rate (CTR), ad relevance, and landing page experience.The expected impact from your ad extensions and other ad formats – things that you can add on top of the basic ad format.From this, we can conclude that the more relevant and well-written your ads are, the less money it takes to win the auction. This system is made to promote high-quality ads and websites, but it doesn’t always work, of course. Just know that money isn’t everything here.Speaking of money, remember when I mentioned that there are other ways to buy ads than paying for each click? There are actually quite a few bidding options besides CPC (cost per click).The other often used bidding option is CPM, which stands for cost per mille (per thousand impressions). You’ll likely use it for display campaign auctions.Campaign - ad group - ad hierarchyEvery ad platform has a management system that should make creating, changing, or updating ads easy and quick to do. It’s not always the case but Google Ads is understandably setting the bar high.Whenever you want to create an ad, you can’t just do it right away. Every ad needs to be in its ad group, and the ad group is a part of a campaign. Such hierarchy allows advertisers to manage the whole ad account efficiently.The scope of settings and options differ from platform to platform.Here’s what you can set up and where in Google Ads:Campaign level – campaign objective, campaign type, ad networks, audiences, budget and bidding, languages, ad extensionsAd group level – keywords (or other targeting options)Ad level – ad headlines, descriptions, URL, extensionsThe best practice is to have a campaign structure plan and stick with it. For example, some PPC experts stick to one keyword per ad group and make it clear in their naming conventions. So, if you sell coffee machines internationally, you can have a campaign called Search - [espresso maker] - US with an ad group called [espresso maker] targeting that keyword in exact-match in the United States.I jumped ahead with the exact match, so that’s what we’ll focus on next.Keyword match types for search adsSearch ads show up when the user’s search query matches with keywords that advertisers bid on. The order of the ads displayed depends on who wins the auction, who comes second, etc.You do keyword targeting by picking a keyword and its match type.Here’s the match type list and how it works:Broad match – matches anything it deems relevant regardless of word order or typosBroad match modifier (BMM) – works like broad match, but the +keyword needs to be included in the search queryPhrase match – exact match, but there can be anything before or after the keywordExact match – self-explanatory, can match singular/plural forms and very close variants and synonymsFor example, if we take the keyword “espresso machine,” here’s how the keyword match types might make it work (you can never know with 100% certainty):Needless to say that the match type is as important as the keyword itself. Only the combination of a good target keyword and suitable match type will bring you relevant traffic.Broad matches are almost never suitable unless you’re a business like Amazon that can bid on millions of search queries. Exact matches give you the most control over what you’re bidding on, but they also limit your exposure and require you to think about targeting all sorts of relevant exact-match keyword variations like [espresso machine] and [espresso coffee machine].Basic targeting in Google Display Network (GDN)Google collects tons of data about its users and turns it into targeting options for advertisers. That’s no secret or surprise to anyone. Browsing and search history can be turned into something called affinity audiences that you can target with your display ads.Here are some of the affinity categories:Sounds good so far, right? Well, unless your target market is really broad, it’s likely a waste of your ad budget—a bit like targeting keywords with the broad match.Why? Here are few interests that Google associates with me:You can find yours by logging into your Google account -> Data and privacy -> Ad settings.I haven’t been to half of those places and have no interest in most of the interests listed. I probably just searched for or clicked on something at some point that caused Google to put me into related affinity audiences. Now it shows me display ads that I’m not even remotely interested in.A much better targeting option is to create a list of specific websites that serve Google AdSense ads. You can curate only highly relevant websites this way. This is called placement targeting.Excluding specific keywords and placementsA solid chunk of PPC campaign optimization lies in narrowing down the keywords and websites you bid on. Once you have your campaigns running, you should regularly check what the auction system is actually bidding on and optimizing that.You’ll often encounter cases of bidding on less relevant or irrelevant keywords unless you strictly go for exact matches (that’s not a good idea anyway). The keywords that you exclude from your campaigns are called negative keywords.As you can see in the example from our ad account below, you also include a match type for negative keywords:The same applies to your display campaigns. If you don’t just target specific placements, your ads will appear on placements that are irrelevant to your business. Eliminating those with a lot of impressions as soon as possible can save a lot of money.How to succeed in Google AdsI still remember what it feels like to log into a PPC platform for the first time tasked with managing campaigns there. While I wouldn’t class myself as a PPC expert, I’ve learned how to efficiently manage PPC campaigns across multiple platforms quite fast. So here are my tips based on my PPC journey.Do as you learnThe best tip I’ve got for you is to apply any learnings into practice right away. Don’t endlessly consume information on all sorts of PPC topics when you don’t need it. There will always be things that you know nothing about, and that’s okay.Take some Google Ads coursesThere’s no better way to get familiar with a PPC platform than having someone give you a demo tour—what to set up first, where everything is, how it works, what to pay attention to, and so on.Luckily, there are countless great learning resources and courses on Google Ads. I’d recommend starting with the short Google Ads tour videos and the Google Ads learning hub.Note that you might be contacted by Google’s sales rep or support offering to help you. While that’s great, and I’d encourage you to take advantage of that, keep in mind that their main goal is to get you to spend more money.The great thing about PPC is the abundance of official documentation and guidance. Ads are Google and other tech giants’ main revenue generator, so they need to provide great support.Not only do you have hints and tooltips through the Google Ads interface, but you’ll also find that the Google Ads knowledgebase and guides contain the vast majority of things you’ll be looking for.Start small and on your ownIf you don’t have a Google Ads account yet, Google will likely try to nudge you into creating the Smart campaigns—where you hand over most of the control and settings to Google’s algorithms—right away. Resist this urge, as it’s better to have everything in your hands when starting out with PPC, then you can slowly integrate the “smarter” features later when you really know what you’re doing.Just ignore the Smart campaign nudge and use the “expert mode” where you set up everything yourself.I’d recommend you create your first campaigns around keywords that are relatively cheap and relevant to your product offering. Decide on a daily budget that won’t make a big dent in your overall marketing budget and start with that.Monitor and optimize your campaigns regularly. Once you start getting solid results, you can increase your budgets and include more keywords, including those with high CPC.Set up your conversions and tracking properlyYour main PPC metrics all revolve around money. The goal is to get the most out of your advertising spend, so one of your Key Performance Indicators (KPIs) should be cost per conversion.I highly recommend you properly set up conversion tracking before you even start advertising. Counting a conversion whenever your customers buy a product is the foundation here, but you’d do better if you also count the conversion value on top of that. It’s still pretty simple, but you’ll likely need some developer help. Just follow the instructions when setting up the conversions:Setting up your conversions also enables you to take advantage of Google’s machine learning algorithms that can help optimize your performance for more conversions both in volume and value. Enhanced CPC (eCPC) is a good first example that you should use.Do proper research on your targetingBe it keywords, websites, or audiences, you should always have some data to back up your targeting choices. Or even better, create your campaigns based on the data first.For search ads, you have to do keyword research. Most people associate that with SEO, but it’s also invaluable for PPC search ads. You first need to know what people search for and then how much you’ll be paying for clicks on average.You can get this data in Ahrefs’ Keywords Explorer. Just type in a few (seed) keywords that capture the nature of your business and product offering and go from there.Another often used tool for PPC keyword research is Google’s Keyword Planner. It doesn’t give you as much data as with paid SEO or PPC tools, but it naturally provides the most precise CPC numbers:As for Google Ads, that can give you some keyword suggestions when you’re creating an ad group. Just paste in your landing page, and Google will offer you some keywords to target for that landing page:As you can see, the keyword suggestions are not the best, but you can find some relevant ones there. This is basically the mechanism behind the slightly more advanced Dynamic Search Ads (DSA) format, which chooses keywords to bid on its own.Start exploring more advanced formats, features and optionsPPC marketing would be pretty easy if I managed to cover it all here. That’s not even remotely the case. So here are a few ad formats, features, and targeting options that you should consider looking at and using after you’re comfortable with the basics.1. Manual and automatic ad extensionsAd extensions are additional texts added to your ads on top of the standard headline, description, and URL.They can be set up at both the ad and account level, and they’re one of the first features I’d encourage you to use after grasping the basics. If you have a use for the automatic extensions (typically local businesses), you’ll likely need to connect your Google Ads account with your Google My Business account.2. Remarketing ad formatsAlong with conversion tracking, you can set up a tracking code that collects data about your website visitors. You can then later use this data to reach those visitors again through multiple Google Ads formats.For example, you can adjust bids and show customized search ads to our past visitors if they continue looking up relevant keywords via Remarketing Lists for Search Ads (RLSA). These ads provide a good opportunity to turn those undecided visitors into customers.But there’s much more to remarketing than RLSAs. You can do that in the display network, YouTube, or even Gmail.3. Dynamic Search Ads (DSA)The mechanism where Google Ads offers you keyword suggestions based on the provided landing page URL is the core part of DSA. You can set up search campaigns where you don’t target keywords but instead provide a list of URLs and let Google decide when a search query is relevant to your landing pages and bid for you.The broader your target market, the more useful DSAs are going to be for you. When you target just a bunch of keywords for niche product offering and audience, DSAs are likely not going to help you but rather target not-so-relevant keywords.4. Custom Intent Audiences (CIA)Another great display targeting option is to target audiences based on their search history and behavior throughout the whole GDN.Custom Intent Audiences are audiences created based on a set of searched-for keywords, visited websites, or used apps. You can basically tell Google to show your ads to people who searched for certain things or visited websites related to your business.I’ve heard many PPC specialists praising this targeting option as the best thing you can do for display campaigns, so give it a shot.Move to Google Ads EditorMany PPC specialists don’t even use the web interface much. Google provides a desktop app called Google Ads Editor that facilitates campaign management and allows you to save a huge amount of clicks and time.The user interface is different, but it’s there to make your PPC work easier. Once you get comfortable in the web platform or feel like setting up campaigns takes a lot of time already, learn to use the Google Ads Editor instead. It’s the best choice you can make for your campaign management in the long term.Final thoughtsPPC marketing is (or at least should be) a small piece in your overall marketing efforts, but there’s a lot to learn and gain from it. This guide should have provided the basics to steer your new PPC journey in the right direction.While this was heavily focused on Google Ads, you can easily use this knowledge to learn and navigate any other PPC platform. The next complex one is definitely Facebook Ads, but you can gain a lot from focusing on platforms like Twitter, Quora, or LinkedIn as well.Do you have any thoughts or questions? Ping me on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Michal Pecánek SaaS SEO consultant with over 6 years of experience. Before going freelance, Michal was an SEO & Marketing Educator at Ahrefs–creating content for the blog and managing a team of guest writers. Keep Learning SEO vs. PPC: Differences, Pros, Cons, & Which to Choose SEO and PPC: Learn what both channels are, how to choose them, and how to use them in tandem. Quora Ads: Over $200K Spent. Here’s What I Learned Discover valuable takeaways to save time and money on Quora Ads. Based on experience managing campaigns for three global brands since '17.",
  "headers": [
    {
      "level": "H1",
      "text": "PPC Marketing: Beginner’s Guide to Pay-Per-Click Ads"
    },
    {
      "level": "H2",
      "text": "What are the benefits of PPC marketing?"
    },
    {
      "level": "H3",
      "text": "1. You can drive traffic to your website instantly"
    },
    {
      "level": "H3",
      "text": "2. You can target potential customers really well"
    },
    {
      "level": "H3",
      "text": "3. You can measure it easily"
    },
    {
      "level": "H3",
      "text": "4. You can easily scale it"
    },
    {
      "level": "H2",
      "text": "What is the role of PPC in marketing?"
    },
    {
      "level": "H2",
      "text": "Google Ads Basics"
    },
    {
      "level": "H3",
      "text": "Campaign types in Google Ads"
    },
    {
      "level": "H4",
      "text": "1. Search campaigns"
    },
    {
      "level": "H4",
      "text": "2. Display campaigns"
    },
    {
      "level": "H4",
      "text": "3. Shopping campaigns"
    },
    {
      "level": "H4",
      "text": "4. Video campaigns"
    },
    {
      "level": "H4",
      "text": "5. Smart campaigns"
    },
    {
      "level": "H4",
      "text": "6. Discovery campaigns"
    },
    {
      "level": "H3",
      "text": "How PPC campaigns work in Google Ads"
    },
    {
      "level": "H4",
      "text": "The auction system"
    },
    {
      "level": "H4",
      "text": "Campaign - ad group - ad hierarchy"
    },
    {
      "level": "H4",
      "text": "Keyword match types for search ads"
    },
    {
      "level": "H4",
      "text": "Basic targeting in Google Display Network (GDN)"
    },
    {
      "level": "H4",
      "text": "Excluding specific keywords and placements"
    },
    {
      "level": "H3",
      "text": "How to succeed in Google Ads"
    },
    {
      "level": "H4",
      "text": "Do as you learn"
    },
    {
      "level": "H4",
      "text": "Take some Google Ads courses"
    },
    {
      "level": "H4",
      "text": "Start small and on your own"
    },
    {
      "level": "H4",
      "text": "Set up your conversions and tracking properly"
    },
    {
      "level": "H4",
      "text": "Do proper research on your targeting"
    },
    {
      "level": "H4",
      "text": "Start exploring more advanced formats, features and options"
    },
    {
      "level": "H5",
      "text": "1. Manual and automatic ad extensions"
    },
    {
      "level": "H5",
      "text": "2. Remarketing ad formats"
    },
    {
      "level": "H5",
      "text": "3. Dynamic Search Ads (DSA)"
    },
    {
      "level": "H5",
      "text": "4. Custom Intent Audiences (CIA)"
    },
    {
      "level": "H4",
      "text": "Move to Google Ads Editor"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Michal Pecánek"
}