{
  "url": "https://ahrefs.com/blog/prioritize-internal-linking/",
  "slug": "prioritize-internal-linking",
  "title": "Here's Why You Should Prioritize Internal Linking This Year",
  "description": "Internal linking offers many benefits, helping Google discover your new content and ensuring your pages are crawled frequently by Googlebot.",
  "content": "Jamie Grant Jamie is an in-house SEO from the U.K., having previously spent over four years working agency-side. Jamie particularly enjoys the technical side and relishes a high-scale content campaign. When taking a break from canonical tags and hreflang, he’ll most likely be obsessing over the latest football match or F1 Grand Prix. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Internal linking features in most SEO strategies, but the reality is it’s rarely prioritized highly enough.SEOs often focus on other tactics while failing to realize the true potential that internal linking offers to move the needle on keyword rankings.My view on this is that SEOs are missing a trick. After all, an effective internal linking strategy has the potential to make a difference.In this guide, you’ll learn the following:Why internal links are so valuableHow to implement internal linking effectivelyLooking to learn the basics of internal linking?Great! But before you continue, why not check out this actionable guide on internal links by Ahrefs’ head of content, Joshua Hardwick.Why internal links are so valuableEffective internal linking provides a wide range of technical benefits, from helping Google discover your new content to ensuring all of your pages are crawled frequently by Googlebot. In my opinion, the most fruitful value of internal linking is its ability to distribute PageRank. This is an attribute of internal linking that is overlooked all too often.Building a strong backlink profile is critical in directing PageRank to your website. But as SEOs, we should not stop there. The great thing about internal links is that you can control the target location of the link itself. This allows you to directly pass on that essential link equity from your pages that receive the most links to those that receive the least.One tough reality of link building is that webmasters rarely link to pages with transactional intent, such as a sales or product page. Most backlinks will typically point toward the homepage or an informational page (e.g., a report). Internal links are crucial in bridging the gap and ensuring your transactional pages gain that crucial boost in authority.Editor’s NoteHere at Ahrefs, we call this process of “bridging the gap” with internal links the Middleman Method. You can see how it works below and learn more about this SEO strategy here.Joshua HardwickHead of ContentSix tips for implementing internal links effectivelyNow that we’ve established the importance of internal linking, let’s go through a few techniques, tips, and tricks to implement it effectively.Link within the main content where relevantInternal links within the primary content of a page, in my opinion, offer the most value from a PageRank perspective.This is as Google’s behavior is likely similar to that of the users’ when it comes to prioritizing the primary content of a page. Users are typically more engaged with the main content and are, therefore, more likely to click on a link that sits within the main content.As a result, Google almost certainly applies a stronger weighting to these links, as indicated by its “Reasonable Surfer” patent.What’s more, these internal links sit in the heart of the page and are surrounded by hyper-relevant, keyword-rich content that Google will use as a signal to understand the context.Include important links within the site navigationLinks within the header navigation are also incredibly useful for passing on PageRank. They may not be as strong at passing contextual authority as links within the primary content. But they sit on every page of the site—and that makes them valuable. They also sit right at the top of the page.This means Google is more likely to prioritize these links compared to the footer navigation, for example.While not as powerful as the header navigation, the footer navigation should not be underestimated. Despite sitting in a less-attractive location, the footer navigation, again, sits on every page, making the links there worthwhile.Notably, some companies have strict approval processes. In such cases, you may find less resistance in adding internal links to the footer navigation compared to the header navigation, so this may be the perfect short-term solution for you.Utilize breadcrumbs logicallyIn my opinion, breadcrumbs are the single most underutilized form of internal linking. They not only make it extremely easy for users to navigate the site, but they are also incredibly powerful at passing on PageRank.Don’t just take it from me. Here’s a tweet from Google’s very own Gary Illyes, who says that Google likes breadcrumbs and uses them for PageRank computation.We likes them. We treat them as normal links in e.g. PageRank computation— Gary 鯨理／경리 Illyes (so official, trust me) (@methode) June 22, 2017 As we already discussed, many SEOs believe the higher up a link on a page, the heavier the weight of PageRank that gets passed via the link. Breadcrumbs typically sit right at the top of every page. Thus, it’s clear why they hold so much value in passing on authority.Furthermore, breadcrumbs also reflect the structure of the site. As a result, your most important pages, which sit high up within the site architecture, will be internally linked to very frequently via the breadcrumbs.TIPDon’t forget to implement breadcrumb Schema to ensure Google fully understands your breadcrumbs and that you’re eligible for rich results.Internally link to your most valuable contentIt’s usually hard to attract links to your most valuable content because of its commercial nature. Remember: To bridge this gap, it’s critical to link from those pages that hold strong authority to the valuable pages that drive your business revenue.You can find relevant, authoritative pages to internally link from for free using Ahrefs’ Site Explorer with a free Ahrefs Webmaster Tools account. Here’s how:Paste your domain into Site ExplorerGo to the Best by links reportLook for relevant pages to internally link fromFor example, let’s say the team at Ahrefs launched a brand-new keyword tool and wanted to boost authority to its landing page. Using this report, we can see several relevant pages with lots of referring domains that will be perfect for adding an internal link.Utilize contextually relevant anchor texts to establish topical relevanceEarlier on, I mentioned Google reads the surrounding content of a link as a signal for the context. Further to this, the anchor text of a link provides an even stronger signal for context.Anchor texts should be:DescriptiveTopically relevantKeyword-richSuccinctNaturalGeneric anchor texts, such as “click here,” provide minimal value, as they do not indicate to Google what the linked-to page is about. Keeping your anchor texts descriptive and relevant will ensure you are passing on the most PageRank. This signal also stems from Google’s “Reasonable Surfer” patent.You can find contextual internal linking opportunities that already exist on your site for free using Ahrefs’ Site Audit. Here’s how:Sign up for a free Ahrefs Webmaster Tools accountCrawl your site with Site AuditGo to the Link Opportunities toolFor example, if we do this for the Ahrefs blog, we can see a contextual internal link opportunity from our SEO glossary to our meta robots guide.Sidenote. If you provide a link via an image, Google will treat the alt text as the anchor text. Regularly audit internal links for errorsTechnical errors within your internal linking could be causing PageRank “leakage.” For example, every time you link to a URL that results in a 404 status (page not found), you could be directing some of your link equity down the drain.Google assigns a set amount of PageRank to be distributed from each page (regardless of the number of internal links). So with each link that you add to a page, you’ll be slightly reducing the value passed on via the links that already exist.But as long as you are not excessively adding links, this won’t be a major cause for concern. It’s simply another reason why minimizing technical errors remains crucial. Not only are you making sure both Google and your users are having the best experience, but your site will also become more efficient at passing on PageRank.Don’t forget to utilize Site Audit (what I showed you earlier). This tool is perfect for diagnosing a wide range of technical issues, including those related to internal links.Once set up:Head to the Link Explorer toolSelect the “Internal” drop-down filterFilter by each of the errors one at a timeFor example, if we filter for internal links “to not found” on the Ahrefs blog, we see 143 internal links to dead pages that should be removed.Final thoughtsThe best thing about this approach to internal linking is it’s not a complex theory (once you understand how PageRank works, of course). It also doesn’t take a huge amount of time to get started.Here are my key takeaways:Internally link from your most authoritative content to the pages that drive revenueBreadcrumbs are incredibly powerful and completely underestimatedWhen you think of PageRank, think about not only backlinks but also internal linksHave any questions? Will you be reshaping your approach to prioritize internal linking? Ping me on Twitter and let me know. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Keep Learning What is E-A-T? Why It’s Important for SEO E-A-T- stands for expertise, authoritativeness, and trustworthiness. Some say it's a ranking factor, but is that actually true? Internal Links for SEO: An Actionable Guide Learn what internal links are, how to set up an internal linking structure, and the way to audit them to spot and troubleshoot issues. SEO Silo Structure: Why It Makes No Sense (And What to Do Instead) Silo structure in SEO is a type of website architecture where you group, isolate, and interlink content about a topic—and it's a bad idea. Is SEO Dead? Heck NO. Here’s Why Learn why people often say that SEO is dead, and why these reasons don’t mean that it’s dead at all. Google Doesn’t Care About AI Content. Here’s Why. Google recently announced that AI isn't against its guidelines. This news may have shocked some—but it really shouldn't. We explore why.",
  "headers": [
    {
      "level": "H1",
      "text": "Here’s Why You Should Prioritize Internal Linking This Year"
    },
    {
      "level": "H2",
      "text": "Why internal links are so valuable"
    },
    {
      "level": "H2",
      "text": "Six tips for implementing internal links effectively"
    },
    {
      "level": "H3",
      "text": "Link within the main content where relevant"
    },
    {
      "level": "H3",
      "text": "Include important links within the site navigation"
    },
    {
      "level": "H3",
      "text": "Utilize breadcrumbs logically"
    },
    {
      "level": "H3",
      "text": "Internally link to your most valuable content"
    },
    {
      "level": "H3",
      "text": "Utilize contextually relevant anchor texts to establish topical relevance"
    },
    {
      "level": "H3",
      "text": "Regularly audit internal links for errors"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Jamie Grant"
}