{
  "url": "https://ahrefs.com/blog/product-descriptions-creation/",
  "slug": "product-descriptions-creation",
  "title": "6 Key Tips to Write Great Product Descriptions (With Examples)",
  "description": "A great product description tells a story of who your product is for and how it helps them get what they want. Here's how to create it.",
  "content": "Bill Widmer 8+ years as a digital nomad, Bill is on a mission to travel the world and fund it using SEO and content marketing. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents If you own an e-commerce website, your product descriptions are a low-hanging fruit to help you make more sales.A great product description tells a story—the story of who your product is for and how your product can help them get what they want.Because when it comes to sales, it’s not about what your product does. It’s about how your product helps your customers achieve the life they imagine in their heads.But what does that mean? And how do you get more people to click “Buy now” after reading your product descriptions? Let’s set the scene with a few great examples.ContentsFantastic product description examples you can learn fromOne of my favorite examples of a stellar product description is Thursday Boot Co.’s President Lace-Up Boot. Let’s take a look:There are a few key things here that make this description so good:It knows its audience: Men who want a boot that looks good, stands up to hard use, and doesn’t require constant cleaning and caring.It makes you a part of its story and mission: making the highest-quality boots that are priced fairly and ethically.It highlights the quality of the materials—Kevlar laces and USA-grown tier 1 cattle hides.Here’s another product description example from Solo Stove’s smokeless fire pit:Just like Thursday Boot Co., Solo Stove does a great job of knowing its audience. Anyone who’s sat around a fire knows what teary eyes and smelly clothes feel like.Notice how its actual “product description” is only two short sentences. It cuts straight to what the product is with zero fluff above the fold, then goes into explaining the features in more detail beneath the product images and specs.Solo Stove also does a great job of using video to enhance its product descriptions.https://www.youtube.com/watch?v=2_r5-bqOEjQLastly, let’s look at one of my favorite products of all time: chocolate.Endangered Species Chocolate is my favorite chocolate brand. The chocolate is decadent, delicious, and, best of all, the brand gives 10% of its profit to help save endangered species.Why am I telling you this? Aside from wanting to convince you to enlighten your palate, I’m hoping you’ll see these are all points that help the brand write delicious product descriptions that convert.It uses its descriptions to describe the experience you will have when you buy one of the bars. This helps you to imagine the taste in your mouth. And if you can imagine it, you’re one step closer to making that experience a reality and clicking the “buy” button.This is the power of using words to help your customers visualize themselves owning, using, or consuming your product. If they can see it in their minds, they are much more likely to buy.By studying other brands’ copywriting, you can improve your own.6 tips to write product descriptions that convertReady to start writing? Here are six tips for crafting the best product descriptions possible:1. Above all else, know your audienceConvincing someone to buy something without understanding their needs, wants, and desires is difficult, to say the least. If you want your descriptions to be as effective as possible, you need to know your audience well.Specifically, you need to know the answers to the following questions:What are the characteristics of the target segment or of an ideal customer? (Age, gender, interests, personality, life situation, etc.).What pain point does my product help them solve? What lifestyle does it help them live?If we look at the three examples I gave above, we can answer these questions. President Lace-Up Boot: Male, likely aged 25–45, cares about his appearance but also needs a boot that can function, hold up, and look good.It helps the wearer have practical footwear that looks good, feels good, and doesn’t break the bank.Solo Stove:Multiple age ranges and genders, but likely a family-oriented person aged 30–45 or possibly someone who enjoys hosting parties. I would create more than one buyer persona in this case.It helps them host wonderful gatherings around a smokeless, beautiful fire.Endangered Species Chocolate:Likely someone a bit older (30+) with more money to spend on indulgences and who cares about the planet as well as great chocolate.It helps them enjoy a delicious treat and take a moment for themselves.Notice that I didn’t say, “Gives them a good shoe to wear” or “Gives them a pit to make a fire.” There’s more to it than that—it’s about the ultimate desired outcome: Having the perfect fire to make the perfect party or the perfect boot to look good and feel good without breaking the bank.If you can figure out exactly what your audience wants and needs, then you can paint a picture with your words that can sell your product for you.If you don’t know the answers to these questions, it’s time to do some market research. Read forums, ask questions, and always try to get authentic customer feedback. Even consider sending an email asking for people’s feedback and try to get them to let you hop on a phone or video call. This insight is invaluable and can be worth giving free products or discounts to get.2. Tell a storyGood copywriting gets the reader invested. You want them to feel like they’re a part of your story or mission.In the words of world-renowned copywriter David Ogilvy, “The worst fault a salesman can commit is to be a bore.” People want to be entertained and fascinated, and your descriptions are no exception.Obviously, this is easier done with some products than others. It’s pretty difficult to tell an interesting story about something as simple as a standard phone charging cable or a roll of paper towels. But that doesn’t mean it can’t be done.One of my favorite ways a brand has done this is Squatty Potty and its slogan “Unkink Your Colon”:It combines humor with storytelling to make an extremely compelling product description. And it keeps it going all the way through its product page.The “story” is, as a species, we have evolved to poop while squatting, not sitting. The squatty potty helps you to do what humans were designed to do in the unnatural environment we call a bathroom.Not all products lend themselves so well to this type of humorous storytelling. But if you can find an interesting angle for your products, it can help you create a selling point.3. Write with SEO in mindIf you care about getting free, recurring customers, you should care about search engine optimization (SEO). That means optimizing your product pages so they can rank for keywords people search on Google and other search engines.Optimizing your product descriptions starts with knowing what keyword you want your page to rank for—which means you need to do some keyword research.The easiest way to do that is to search for your product on Ahrefs’ Keywords Explorer, look at the Related terms report, and leave it at the default view. It shows you keywords that pages ranking at the top 10 positions for the keyword on the input also rank for.For example, let’s say I want to sell a purple bikini. It brings back 38 related keywords:The keyword “purple bikini” is searched for ~3,000 times per month. But there are other keywords like “purple bathing suits,” “purple bikini set,” etc., that are also searched for.In this case, the keyword I typed in happened to be the best target keyword for the page. But that won’t always be the case. Had we typed “lavender bikini,” we would have found that “purple bikini” would be a better keyword to target due to its higher traffic potential.These related terms can help you further optimize your product page for the main target keyword.For example, we can talk about “purple swimsuit” and “purple bikini set” in our product description to increase our page’s relevancy for the keyword “purple bikini” and help our chances of ranking on Google.You can use these keywords in your page headers, the description itself, image alt text, and more. Just add them wherever it feels natural and makes sense without trying to force them in too many times. Think of it as a way of varying your word choices (which is one of my tips to become a better writer, by the way).This is part of the deeper process of on-page SEO—something every e-commerce business owner should learn. 4. Use ads to test copyEnough about SEO. Let’s talk about pay-per-click (PPC) ads and how to use them to improve your product copy.If you’re already running search ads, then use excerpts from the winning ad copies in your product descriptions. You’ve already got the data that they work.If you’re not running ads, you can still spy on competitors’ ads to see what kind of copy is working for them. Just Google your product…… and take note of any common trends among the ads. In this example, the word “Designer” sticks out to me. If I try other keywords, I can see that’s a common trend:This tells me using words like “Designer” and advertising combo pricing may be a good thing to include in your product descriptions.To make this even better and faster, you can spy on your competitors’ ads with the Ads report inside Ahrefs’ Site Explorer.This will let you see their ad copies across all of their ads, and you can check multiple competitors to see the trends and overlaps of what makes them successful. This is because ads that drive the most traffic and cost the most are likely to be optimized and tested, so you can steal what’s already been found to convert.5. Make it look goodYour product page doesn’t need to just sound good—it needs to look good too.This encompasses a lot of things:Using better words to describe your productsFormatting your description in a way that’s easy to scanBreaking up large paragraphs and cutting fluffUsing high-quality photos and videosBreaking up the page visuallyThe brand examples I gave at the beginning of this article do this really well. They don’t just have some product photos with a description and a “buy” button—their whole product page is a landing page created to convert the visitor.They break up the page into sections using a mix of beautiful product photos with brief descriptions, video overviews, and close-ups that explain the minute details. If you don’t know how to structure your website like this yourself and can’t find a template you like, it may be worth hiring a web designer to build it for you.Beyond the structure of the page, you should also focus on improving the words you use to describe your products. Instead of just saying it’s “durable” or “high quality,” take a more poetic and enticing approach.Jacob McMillen shares a great tip in his guide to copywriting that is beneficial here—use bulleted lists that describe a feature of the product, then follow that up with the added benefit while utilizing power words. For example:Enzyme washed for added softnessDye process creates variations of color, making each tee truly uniqueTees pre-shrunk, so they will fit the same foreverWords such as “unique” or “forever” are power words. Check out this list of power words for more ideas to vary your wording and keep it interesting.6. Cut the fluffHopefully at this point, you’ve meticulously brooded over every word of your descriptions. You’ve formatted them with thoughtful use of bulleted lists, sections, and media.But there’s one more thing you need to do to polish your description: Ruthlessly cut the fluff.When you’re done writing, sleep on it first, then read your product descriptions out loud the next day. By reading them out loud, it will be painfully obvious where you’ve added unnecessary, extra wording or which sentences sound strange.Some big culprits include the overuse of the word “that,” writing in passive voice instead of active voice, and using weak verbs instead of stronger, more expressive ones.Let’s take an example. Here’s a product description:Our lovely, fluffy down pillow is made by hand in a factory in Indiana by people who put a lot of care into every stitch. This pillow is sure to get rid of your insomnia and help you sleep like a baby.Good, but let’s cut the fluff and see what we can improve:Our luxurious down pillows are hand-crafted with love in every stitch. Sewn right here in Indiana, these pillows will make your insomnia a thing of the past. Sleep like a baby again.See how the second is more direct and uses stronger verbs with fewer words? That’s what you’re aiming for. Strong, expressive, and concise.Final thoughtsAs digital entrepreneurs, our website is our 24/7 sales machine. Every second we put into improving it is a second invested in an automated money machine.Learning how to perfect your product descriptions—and your product pages—is one of the ways you can get a bigger ROI from your business.Ready to learn more? Check out these other guides:21 Writing Tips to Become a Better Writer FastE-commerce SEO: The Beginner’s GuideThe Three Most Important Ecommerce Success Factors Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Keep Learning How to Write a Great Listicle Post in 10 Steps Listicles, also known as list-posts, are articles structured around lists. Each item is usually expanded with more information to keep it useful for readers. How to Write an Irresistible Headline in 3 Easy Steps A good headline will catch a reader's attention, make them click while accurately describing the content. Learn how to write an irresistible headline here. Content Outlines: How to Write Better Content Faster A content outline is a detailed overview of what will be in your article. It can improve your writing efficiency, content’s flow, and SEO too. How to Write a Blog Post (That People Actually Want to Read) in 9 Steps Looking to write a blog post that people want to read? Learn everything you need to know in this easy guide. How to Write a Blog Post Outline (7 Simple Steps) In seven simple steps, learn how to create a blog post outline that’ll help you overcome the dreaded writer’s block.",
  "headers": [
    {
      "level": "H1",
      "text": "6 Key Tips to Write Great Product Descriptions (With Examples)"
    },
    {
      "level": "H2",
      "text": "Fantastic product description examples you can learn from"
    },
    {
      "level": "H2",
      "text": "6 tips to write product descriptions that convert"
    },
    {
      "level": "H3",
      "text": "1. Above all else, know your audience"
    },
    {
      "level": "H3",
      "text": "2. Tell a story"
    },
    {
      "level": "H3",
      "text": "3. Write with SEO in mind"
    },
    {
      "level": "H3",
      "text": "4. Use ads to test copy"
    },
    {
      "level": "H3",
      "text": "5. Make it look good"
    },
    {
      "level": "H3",
      "text": "6. Cut the fluff"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Bill Widmer"
}