{
  "url": "https://ahrefs.com/blog/relationship-link-building/",
  "slug": "relationship-link-building",
  "title": "Relationship-Based Link Building: How to Earn Trust & High-Quality Links",
  "description": "Want high-quality links in 2023? Then you'll need to build relationships. Here's how to make it happen the right way.",
  "content": "Irina Maltseva Irina Maltseva is the former head of marketing at Hunter. After growing multiple martech businesses, Irina joined cybersecurity company Aura and is currently working on her mission to create a safer internet for everyone. In her spare time, Irina consults SaaS companies on inbound marketing and travels the world. To get in touch, follow her on LinkedIn. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Have you ever received an email like this from a stranger?Hey {First Name},Just came across your post about {x}.Great stuff!I just published a resource that will provide a ton of value to your readers.{Some Random URL}Might be a good fit for your post? 🙂Best regards,Spammy McSpammerson, Founder of SpamCoThese “classic” outreach emails might have worked 10 years ago, but your chances of getting a link with them now are practically zero. The rules of the game have changed. If you want to build high-quality links in 2023, you need to build relationships.ContentsWhy do relationships matter in link building?Relationships impact how people make decisions. For example, ask to borrow $100 from a random person on the street and they’ll surely say no. Ask a friend who knows and trusts you, however, and they’ll be more likely to say yes.It’s the same with link building. You can’t just “cold email” editors asking for a backlink unless they know you well or you offer to provide something valuable to them in return.Here are a few more ways relationships can help in link building: 1. Stand out in prospects’ inboxesThe inboxes of your prospects are full of spam and cold emails. And there is an apparent prioritization when it comes to answering business emails. First, they answer their colleagues and business partners. Then they answer less urgent emails from the people they know. Only after that do they decide whether to respond to the cold emails left in the inbox. People are normally picky about who to respond to, considering they receive tons of emails.That’s why you need to build relationships first to stand out from the crowd. The better your relationships, the higher your chances of having an outreach email read and answered.2. Bring repeated businessProspecting is a time-consuming procedure. If you build links transactionally and send many automated emails, you’ll need to find new prospects for your outreach repeatedly. Also, finding relevant prospects for every new outreach batch is getting harder and harder.On the other hand, relationships can help you bring repeated business. Instead of constantly looking for new prospects and running new outreach campaigns, you can simply develop relationships with existing prospects.You can build more links with the most reliable link partners by regularly mentioning each other in guest posts, helping each other with links from partners’ websites, and much more.3. Get better linksIn my experience, the best links are always built via relationships. Sure, you can get low-DR links by cold emailing without a warmup. But getting links from the highest authority websites is only possible through personal connections.For example, at Aura, this blog post on what to do if your identity is stolen has been one of the most difficult link targets for us for a long time. We had to acquire almost 200 links before it ranked on page #1. Links we acquired through relationships helped us move the needle the most.For example, we got most of our DR 90+ links through relationships: our partners, people we know well, and personalized outreach:Getting these kinds of links with a generic mass outreach wouldn’t be possible. That said, you should only make this effort for high-quality prospects. It wouldn’t be worth jumping through these hoops for a link from a DR 5 website.How to build relationships before sending a cold emailThese three tips will help you to build relationships (and high-quality backlinks):Find people to build relationships withGet on their radarPay it forward 1. Find people to build relationships withOne of the quickest and most effective ways to find targets for link building/relationship-building is to reverse engineer your competitors with Ahrefs’ Site Explorer.Here’s how:Enter your domainGo to the Link Intersect reportEnter a competitor’s domainClick “Show link opportunities”This will show you the websites that link to your competitor, but not you. From here, manually review the list for the best, most relevant domains. For example, if you represent a martech SaaS, you can aim to target only DR 50–90 domains that are operating in a marketing niche.Once you’ve got a shortlist of relevant domains, you can plug them into Ahrefs’ Batch Analysis tool to bulk-check their traffic.If they don’t have much, I’d generally recommend ruling them out.After this, you just need to identify decision-makers in these companies. Depending on the size of the company, different people can be in charge of link building:Small companies – CEO, CMO, any marketing or content-related position.Mid-size companies – People who take on marketing-related positions, with a focus on SEO and organic growth (e.g., Growth Marketing Manager, SEO Manager, Editor, etc.).Big companies and enterprises – Focus on SEO-related positions (e.g., Head of SEO, SEO Manager, Link Builder, Outreach Specialist, etc.).Your best bet is to build relationships with people who are directly involved in SEO on a day-to-day basis.2. Get on their radarThe outreach process requires a certain level of creativity, not to mention patience. I recommend you start building connections with editors on LinkedIn or Twitter instead of bombarding them with outreach emails immediately. Learn more about their interests, what kind of content they publish, and their experience. After this research, you can engage with their content regularly to get on their radar.The comments you leave must be meaningful and genuine, i.e., not just a “Great post!” comment but something that brings value to the discussion. Make an effort and try to forget about your ulterior motive of links.For example, by leaving these meaningful comments, Alexandra Tachalova was invited to Aaron Anderson’s podcast as a guest speaker (and got a link and a few nice mentions as a bonus!):3. Pay it forwardOne of the easiest ways to connect with someone and start building relationships is to do something for them without expecting anything in return.For example, you can:Include their business in your roundup article.Mention their case study in your upcoming guest post.Interview their founder for your blog.Share their social media posts with your audience.Help them with a comment and upvote on ProductHunt, etc.Steven Macdonald recently shared a fantastic tactic on how he builds links by giving first. And by giving, he means giving a backlink—for free.He uses Ahrefs to find the best opportunities for this. Here’s how:Go to Site ExplorerEnter the site you want a link fromGo to the Organic keywords reportFilter for keywords in positions #4–10What you’re seeing here are keywords that your link prospect ranks for on the first page of Google, but not in the top three. While not all of these will be keywords they’re actively trying to rank for, you can usually find ones they are targeting by eyeballing the list.For example, HubSpot clearly wants to rank for “instagram stories,” as it used this keyword as its post’s URL slug: But as it only ranks in position #5, a relevant backlink to this page is probably something it’d be super grateful for. Here’s how to find a relevant place to add the link on your website:Go to Ahrefs’ Site AuditSelect your website’s projectGo to the Page Explorer toolFilter for pages with the target keyword in the page textYou can then send just a quick email saying something like:Hey {Name},{Your Name} from {Company} here.I really liked your recent article {Topic/URL}, so I decided to link to it from my blog.Just wanted to let you know and, also, to keep up the great job! 🙂That’s it! You don’t have to ask for anything in return in your first email. Just be kind and do something for them. It’s a great way to initiate the conversation and potentially build many powerful links together in the future.How to ask for a linkRelationships take time to develop. It’s an investment. When you feel you have a strong enough connection with your prospect, it’s time to send an email.1. Do your research beforehandYou probably already know some info about your prospects after engaging with them. Still, it won’t hurt to check their social media and blog once again. And if you find anything valuable, mention it in your cold email.For example, you can congratulate them on a new project they launched, mention a result their company recently achieved, share your opinion on one of the topics they recently covered in a post on social media, etc.No need to get too personal. You’ll just sound creepy. Instead, write a quick icebreaker to show you did your homework.2. Remind how you were connectedMake your cold email warm by mentioning how you were connected with the prospect. If you did something for them before, remind them about that in your email.For example:If you previously chatted with your prospect on LinkedIn, start your email with something like, “Hey, Irina from LinkedIn here!”If you had a conversation in blog comments, mention that in your email.If someone previously introduced you to your prospect, mention your common connection.3. Don’t ask for too much with your first emailMake your first email short and easy. Don’t ask for a backlink right away, or to “jump on a quick call,” or more than 10 minutes of their time.Instead, start with a small ask or offer a win-win partnership.4. Stay human and avoid automationThe worst way to start building relationships is to automate the whole outreach process.The key priority is to stay human. Robots are so easy to detect these days.Even when it comes to follow-ups, do your job and send a friendly reminder instead of making your potential partners a part of the cold outreach sequence.It doesn’t matter what channel of communication you decide to choose. What matters is to be relevant, personal, and human with your pitches.As Gaetano DiNardi mentioned:Final thoughtsRelationships are the key to building high-quality links in 2023. I truly believe that the days of automated mass outreach are over. Got questions or comments? Ping me on LinkedIn or Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Keep Learning 6 Linkable Asset Types (And EXACTLY How to Earn Links With Them) Linkable assets are awesome pieces of content that can be leveraged for links. But did you know that most successful linkable assets tend to be similar \"types\" of content? In this post, I'll explore six linkable asset types, and explain how you can easily earn links with them. How to Get High-Quality Backlinks With the TRUST Formula [Case Study] Learn how David McSweeney used the TRUST formula to build high-quality links from USA Today, Yahoo Sports, FHM, and other top sites. 4 Tactics for High-Quality Backlinks That Move the Needle [+ Examples] Many backlink techniques are outdated and don’t move the needle. Discover new ways to earn high-quality links, along with six successful examples you can emulate. How to Earn More Links: Adding Context to Content Analysis Do you want to create content that earns links? Then you need to glean insights from great content instead of great websites. Learn how in this post. Link Prospecting: How to Find Quality Backlinks for Your Website Link prospecting is about finding and evaluating potential sites to acquire quality links—a key part of any successful SEO campaign.",
  "headers": [
    {
      "level": "H1",
      "text": "Relationship-Based Link Building: How to Earn Trust & High-Quality Links"
    },
    {
      "level": "H2",
      "text": "Why do relationships matter in link building?"
    },
    {
      "level": "H3",
      "text": "1. Stand out in prospects’ inboxes"
    },
    {
      "level": "H3",
      "text": "2. Bring repeated business"
    },
    {
      "level": "H3",
      "text": "3. Get better links"
    },
    {
      "level": "H2",
      "text": "How to build relationships before sending a cold email"
    },
    {
      "level": "H3",
      "text": "1. Find people to build relationships with"
    },
    {
      "level": "H3",
      "text": "2. Get on their radar"
    },
    {
      "level": "H3",
      "text": "3. Pay it forward"
    },
    {
      "level": "H2",
      "text": "How to ask for a link"
    },
    {
      "level": "H3",
      "text": "1. Do your research beforehand"
    },
    {
      "level": "H3",
      "text": "2. Remind how you were connected"
    },
    {
      "level": "H3",
      "text": "3. Don’t ask for too much with your first email"
    },
    {
      "level": "H3",
      "text": "4. Stay human and avoid automation"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Irina Maltseva"
}