{
  "url": "https://ahrefs.com/blog/repurposing-content/",
  "slug": "repurposing-content",
  "title": "Repurposing Content: How to Get More Mileage From Your Existing Content",
  "description": "Making good content takes a lot of time, effort, and resources. By repurposing, you can make it go the extra mile.",
  "content": "Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Making good content is tough. You have to invest a ton of time, effort, and resources.But if you repurpose it, you can make it go the extra mile.ContentsWhat is content repurposing?Content repurposing is the practice of reusing all or parts of existing content. This usually involves changing the format, such as from a blog post to a video.For example, we turned this video on holiday SEO into a blog post.Why should you repurpose content?There are two main reasons:Reach more people. People who like videos won’t consume your content if it’s a blog post. But repurpose it as a video and they might.Save money. Making new content is expensive. Repurposing your existing content requires fewer resources and is more cost-effective.How to repurpose contentFollow this process:1. Embrace the ‘zero-click’ mindsetIf you think about it, content repurposing is a form of content distribution. You’re taking bits and pieces of your existing content and dispersing them on other channels.But here’s where many people trip up. Most marketers’ concept of content promotion is to drive clicks. So, they expect that content repurposing will do the same.Doing this is a disservice to your repurposing efforts.No matter the type of content you produce, they’re ultimately vessels in service of a larger goal: sharing an important idea. For us, that idea is that Ahrefs is the best-in-class SEO tool. So, it doesn’t matter which format we use or whether we get the click.As long as the idea is lodged in the brains of our target audience, the job is done. That’s why we’re happy to make zero-click content—content that offers valuable, standalone insights without the need to click.Our brand will be top-of-mind for anyone who encounters us on multiple channels and gain value from our content. It doesn’t matter whether they clicked through. Eventually, when it comes time to purchase, we’ll likely be their number-one choice.If you want your content repurposing efforts to go well, you need to embrace zero-click content.2. Find your best-performing contentIt’s almost impossible to repurpose every single piece of content.—especially if you’re going at it alone. So, you have to prioritize.The best way to do this is to focus on content that’s already performing well.While there is no guarantee that content performing well in one channel will perform well in another, it is an indication that there are people who are looking for the topic.Finding content that’s performing well depends on the primary type of content you’re producing. For example, if you’re creating blog posts, then you’ll want to use a tool like Google Analytics to see which articles have been getting the most traffic. You can do this by going to Engagement > Pages and screens.If your primary content type is videos, then you may want to look at your most-viewed videos on YouTube:3. Start with channels that are similarYou should start by repurposing your content into formats that are most similar to your primary type of content. For example, if your primary content type is blog posts, you should focus on text-based formats, like X (formerly Twitter) and LinkedIn.I recommend this because content repurposing takes effort. Many marketers like to suggest content repurposing as an ‘easy’ tactic, but that’s not true. Someone like Gary Vaynerchuk can repurpose at scale because he has a dedicated team.So, while there are straightforward cases (e.g., reposting your entire article on X), know that most repurposing is not one-to-one.For example, say you want to turn a blog post into a video. Even if the blog post content can be adapted into the video script, you’ll still need to storyboard, record, and edit. That’s a lot of work.That’s why I suggest starting your content repurposing journey with similar channels. (Just make sure your target audience is there.)Since I write for the Ahrefs blog, I mainly repurpose my content on LinkedIn and X. Here’s an example where I repurposed one of the use cases from my article on how to use both ChatGPT and Ahrefs:It did super well, generating >25,000 impressions:4. Adapt your content for each channelEvery platform has a preferred format, unique culture, and its own algorithm. So, don’t post the same things everywhere and expect it to be a 100% hit.For example, our Chief Marketing Officer (CMO) Tim Soulo found that he got differing results when he posted the same thing on LinkedIn and X:I’m slowly losing my motivation to post anything on Twitter (X?)… 🙄Same posts on LinkedIn have 10x (100x?) the engagement with almost 2x less followers 🤷‍♂️.Twitter is clearly losing to LinkedIn.— Tim Soulo 🇺🇦 (@timsoulo) May 27, 2024 You want to adapt your content for each channel you’re posting in.For example, say you want to repurpose your YouTube video into a blog post. You can’t just publish your script verbatim. You’d want to optimize the blog post for a target channel, likely Google search.To do this, you need to make sure the article is targeting a topic people are searching for. For example, our video on affiliate marketing did well on YouTube. So, I wanted to repurpose it into a blog post. To do that, I searched for “affiliate marketing” in Keywords Explorer to see if there was search volume.There are 175,000 monthly searches for “affiliate marketing”.Next, I want to learn why people are searching for “affiliate marketing” on Google so we can provide them with a relevant blog post that answers everything they’re looking for. I did this by scrolling down to the SERP Overview and clicking Identify intents.This tells us that people searching for “affiliate marketing” on Google are looking to understand what affiliate marketing is and how to start affiliate marketing. We’d want to reformat our script to something like a beginner’s guide, covering the definitions and steps on how to start.To make our article as comprehensive as possible, we can click on the top three ranking pages, click on Open in, and choose Content gap:This opens up the Content gap report, which shows you the common keywords these three pages rank for. Some of them will be subtopics you should cover in your article.For example, looking through this report, we see potential subtopics like:What is affiliate marketingHow to do affiliate marketingHow does affiliate marketing workHow much does affiliate marketing makeAll of these made it into my repurposed blog post:Today, my article gets around 8,800 monthly visits from Google:Content repurposing examplesHere are some ideas to kick you off on your content repurposing journey:1. Turn videos into blog postsBesides affiliate marketing, we’ve also turned many videos from our YouTube channel into blog posts:ChatGPT for SEO (video | article)Ahrefs tutorial (video | article)Is SEO worth it (video | article)I repurposed the affiliate marketing video back in the good old days, so I didn’t have any access to AI. But today, you can make the process quicker with ChatGPT. For example, here’s the prompt I gave:I’m going to give you a video script about affiliate marketing. Please turn it into a blog post with these subheadings:What is affiliate marketingWhy should you do affiliate marketingHow does affiliate marketing workHow much money do affiliate marketers makeGetting started with affiliate marketingAffiliate marketing toolsHere’s the script:*script*Here’s what ChatGPT generated:Not good enough for a publishable blog post (imo), but it’s enough as an outline for you to fill in the gaps.2. Turn blog posts into videosThe reverse also works: We’ve repurposed many of our blog posts into videos.SEO checklist (article | video)Blogging tips (article | video)Blog post templates (article | video)I tried using ChatGPT for this use case, and it even gave me the images and voiceover I needed for the video:This isn’t enough if you want to make a talking-head video or even a video that’s amazing, but it could be something to work off on.3. Turn videos into a courseContent is typically published chronologically. Unfortunately, it’s not an ideal way to consume content. So, why not organize these videos in a logical order and turn them into a course?For example, our content marketing course is simply a collection of YouTube videos we’ve published about the topic:Make sure these courses have demand by entering your target keyword into Keywords Explorer and filtering for words like “courses”, “training”, etc.4. Turn individual videos into one long videoA few years ago, we released each lesson from our SEO training course one by one.Later on, we stitched all of the videos into a long (~two hours) video:https://www.youtube.com/watch?v=xsVTqzratPsNot only did we get views for each video, but the combined video also got 2.6 million views!We’ve since done that for multiple other courses, and they’ve all done well.5. Turn blog posts into a bookWhat’s the written version of an online course? Duh, a book.You can compile and organize your blog posts and turn them into a book. This can live on your site as an ebook, or go big and publish it as a hardback/paperback.We decided to go big (or go home) and turned our beginner’s guide to SEO into a beautifully designed hardcover:6. Turn videos into multiple short-form videosIf you’re producing videos, you can extract the best moments that will resonate with your target audience and turn them into short-form videos. These can then be published on multiple platforms: TikTok, Instagram Reels, YouTube Shorts, Twitter, Facebook, and more.For example, Slidebean made a video about Elon Musk. They turned a few key moments into YouTube shorts: This short was also republished on Instagram and Facebook.You can use YouTube’s built-in tool to create Shorts. Go to the YouTube app, choose your video, click Remix, then Edit into a Short.Other tools to do this include Descript and inShot.7. Turn blog posts into guest postsSome of our blog posts are so comprehensive they span chapters:Each chapter could be a post on its own. So, why not turn them into guest posts?We call this the “Splintering Technique”:Write an incredible, detailed piece of content for your blogBreak it into “splinters” and submit each one as a guest article to another blogHere’s how to find sites to pitch to:Go to Ahrefs’ Content ExplorerSearch for terms relevant to your niche (e.g., keto)Set Language filter to English (or language you write in)Set Live/Broken filter to Only liveToggle Filter explicit results onCheck One page per domain, Exclude subdomains, Exclude homepagesSince these sites cover topics similar to yours, they’re likely to accept your guest post pitch. Find the website owner’s or editor’s email, reach out, and pitch them your topics.Further readingGuest Blogging for SEO: Everything You Need to Know8. Turn blog posts or videos into social media postsEach tip, idea, use case, solution, lesson, takeaway, and custom image in your content can be extracted and repurposed as a standalone post on social media.Here’s an example where I posted one of my lessons from writing 100 blog posts for Ahrefs. Here, I simply reposted one of our custom images: What I like about doing this regularly is that you can gather ideas from the community and update your posts in the future. For example, I posted all the mistakes from my SEO mistakes post and asked if I missed anything. The comments gave me lots of mistakes that I could include in the post when I update it next time.9. Turn blog posts into Reddit postsMarketers tend to avoid Reddit because of the community’s hatred for anything promotional.But Reddit needs content to thrive. So long as your content is helpful, you’re welcome to the front page of the Internet.To do this, publish a tl;dr version of your content and strip away all internal and external links. Only at the end of your post do you leave a link back to your original piece of content.Here’s an example of how Tim does it:Final thoughtsLook at this masterclass in content repurposing:Sahil Bloom creates a podcast episode for his chosen topic (“How to Get Out of a Rut”) and distributes it to the major podcast platforms (e.g., Apple Podcasts, Spotify).He then turns the script into a newsletter for his subscribers and publishes it on his website as a blog post.The post is turned into a X (Twitter) thread.Later on, he turns it into a long-form LinkedIn post.Just because you’ve published something doesn’t mean everyone has seen it. Make your content go the extra mile by reusing, repurposing, and reformatting it for multiple platforms so more people can view your content. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Keep Learning Content Outlines: How to Write Better Content Faster A content outline is a detailed overview of what will be in your article. It can improve your writing efficiency, content’s flow, and SEO too. 25 Types of Content You Can Use for Content Marketing In content marketing, there are heaps of options to pick from. To make it easier, we've curated 25 types for your choosing pleasure. Content Promotion: There are Only 3 Ways to Distribute Content You've published your content, now find out how to get more eyeballs on it. Why Is Content Marketing Important? 7 Reasons to Start Content Marketing Here are seven reasons why content marketing is important and deserves to be the marketing channel you should focus on. Content Marketing ROI: How to Put a $ Value on Content 3 quick and easy ways to prove the value of your content.",
  "headers": [
    {
      "level": "H1",
      "text": "Repurposing Content: How to Get More Mileage From Your Existing Content"
    },
    {
      "level": "H2",
      "text": "What is content repurposing?"
    },
    {
      "level": "H2",
      "text": "Why should you repurpose content?"
    },
    {
      "level": "H2",
      "text": "How to repurpose content"
    },
    {
      "level": "H3",
      "text": "1. Embrace the ‘zero-click’ mindset"
    },
    {
      "level": "H3",
      "text": "2. Find your best-performing content"
    },
    {
      "level": "H3",
      "text": "3. Start with channels that are similar"
    },
    {
      "level": "H3",
      "text": "4. Adapt your content for each channel"
    },
    {
      "level": "H2",
      "text": "Content repurposing examples"
    },
    {
      "level": "H3",
      "text": "1. Turn videos into blog posts"
    },
    {
      "level": "H3",
      "text": "2. Turn blog posts into videos"
    },
    {
      "level": "H3",
      "text": "3. Turn videos into a course"
    },
    {
      "level": "H3",
      "text": "4. Turn individual videos into one long video"
    },
    {
      "level": "H3",
      "text": "5. Turn blog posts into a book"
    },
    {
      "level": "H3",
      "text": "6. Turn videos into multiple short-form videos"
    },
    {
      "level": "H3",
      "text": "7. Turn blog posts into guest posts"
    },
    {
      "level": "H3",
      "text": "8. Turn blog posts or videos into social media posts"
    },
    {
      "level": "H3",
      "text": "9. Turn blog posts into Reddit posts"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Si Quan Ong"
}