{
  "url": "https://ahrefs.com/blog/republishing-content/",
  "slug": "republishing-content",
  "title": "Republishing Content: How to Update Old Blog Posts for SEO",
  "description": "In this guide, you'll learn how to republish old blog posts for more organic traffic in three easy steps.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Not every blog post you publish will rank in search engines. Even if you’ve done keyword research and written great content, it’s not always possible to get things right on your first attempt.For example, we published a post about “what is SEO” in late 2018. It wasn’t a complete failure, but it never ranked higher than the bottom of page one or got more than an estimated 500 organic visits per month.So, in August 2019, we rewrote and republished the post. Traffic pretty much doubled overnight and kept climbing.Data via Ahrefs’ Site Explorer.We’ve done this several times with positive results. If you look at the number of republished posts on the blog in Ahrefs’ Content Explorer, you’ll see that we’ve republished 75 of our 200+ posts at least once.In this guide, you’ll learn how to republish old blog posts for more organic traffic in three easy steps.Find underperforming pages with content issuesRefresh the contentRepublish the posthttps://www.youtube.com/watch?v=9HWna4hK47cStep 1. Find underperforming pages with content issuesIf you want to boost organic traffic, then republishing any old post isn’t going to work. You need to find those that are underperforming because of content issues.To do that, follow the steps in this flowchart:Let’s go through each of these steps in more detail.Find underperforming pagesMake sure it’s not a new pageRule out backlink factorsMake sure it’s an ‘informational’ queryA. Find underperforming pagesIf your post ranks in the top three for its target keyword, then it’s probably not a great candidate for republishing because the risk outweighs the reward. It’s already performing well, so republishing might do more harm than good.For that reason, you need to look for posts that rank lower down for their main keyword.You can find those keywords in Google Search Console. Just head to the Search Results report, toggle the average position selector, then filter the report for keywords with an average ranking position of four or higher.Sift through the list of keywords for topics that you’re targeting with blog posts.For example, we wrote a post about guest blogging, so I know this is a keyword we’re targeting.Just know that Search Console only shows average ranking positions, so it’s usually not a particularly accurate representation of your actual ranking position. For more precise ranking data, paste your blog into Ahrefs’ Site Explorer, then head to the Top Pages report to see the posts that generate the most search traffic.It’s then just a case of sifting through the report for posts that aren’t ranking high for their primary target keyword. The best way to do this is to look at the URL, Top keyword, and Position columns.For example, if we look through the report for our blog, we see our guide to guest blogging in position four for “guest blogged.”It’s clear from the URL that our target keyword here is “guest blogging,” But as the Top keyword is something else, it’s highly unlikely that we’re ranking in the top three positions for “guest blogging.”If we hit the “Keywords” caret, we can confirm this by looking for that keyword and checking the ranking position.Note that if your post isn’t targeting a ‘meaningful’ keyword with search traffic potential, it’s probably not the best candidate for republishing. For example, our post about starting a link building campaign fast doesn’t target a specific keyword, so we wouldn’t republish that post to get more traffic from search engines.B. Make sure it’s not a new pageThere’s no point republishing posts that were published recently. It takes time for posts to attract backlinks and for Google to understand where they deserve to rank.For that reason, we don’t usually republish posts unless they’re at least twelve months old.You can quickly check a post’s age by looking at the publish date.It seems that our guest blogging guide was published over two years ago, so this one is ripe for an update.C. Rule out backlink factorsContent isn’t always the reason your posts aren’t ranking. It’s sometimes because those that outrank you have more high-quality backlinks and ‘link authority.’To check if that’s the case, search for your keyword in Keywords Explorer, scroll to the SERP overview, then look at the Domain Ratings (DR) and URL Ratings (UR) of the sites and pages that outrank you.If we do this for “guest blogging,” we see a few lower-authority pages from lower-authority sites outranking us.That tells us this is probably a content issue. If we were to refresh and republish the post, it’s highly likely that we could rank at least one or two positions higher.However, if we do the same thing for the keyword, “how to improve SEO,” we see the opposite. All the posts that outrank us have higher UR scores, indicating higher page-level authority. So, in this case, it’s probably a link authority issue, not a content issue.D. Make sure it’s an ‘informational’ queryJust because there are pages that outrank you with fewer backlinks, that doesn’t always mean there’s an opportunity to get more traffic by republishing your post. If product, category, or landing pages are outranking you, then maybe searchers aren’t looking for blog posts.For example, it’s clear from the titles and URLs that the pages outranking us for “guest blogging” are blog posts. That’s a good sign. It tells us that the type of content searchers want to see is blog posts.However, it’s an entirely different story for “website traffic.” All the pages that outrank us are landing pages with free tools.It’s unlikely that we could outrank them just by refreshing our content. Most people are looking for tools here, not blog posts.Step 2. Refresh the contentIf you’ve found a post that could use a refresh, you can’t just update it any old way and expect more organic traffic. You need to take a systematic approach.Here are the steps:Make sure your post aligns with search intentAnalyze the top-ranking pagesAnalyze your backlink profileA. Make sure your post aligns with search intentSearch intent is the reason behind a searcher’s query. We already assessed this to an extent in the previous step when checking whether the pages outranking us were blog posts or something else.But search intent goes deeper than the type of content. You also need to make sure your post aligns with the desired content format and angle.Content formatThis is the format of the pages most people are looking for. Common formats include:How-tosTutorialsList postsGuidesOpinion editorialsExpanded definitions (i.e., what is / what are type posts)If we check the SERP overview for “guest blogging,” we see two main formats: expanded definitions and guides. Ours is neither of those, which is probably part of the reason it isn’t ranking.Content angleThis is the selling point of your post. It’s basically the hook as to why someone should click and who it’s for. Common angles include:Beginners’ guidesComplete guidesTop [Number] listsIf we check the top results for “guest blogging,” they’re all aimed at beginners. Yet our post targets a more advanced audience with the angle of building links at scale.That probably isn’t very appealing or helpful for a beginner and might be preventing us from ranking higher.Of course, as there are a couple of formats and angles we could go with here, you might be wondering which should we choose? Should we republish our post as a complete guide or expanded definition? (i.e., “what is guest blogging?”) In this case, the most logical choice would be the expanded definition. Why? Because these types of posts seem to be ranking with fewer links than complete guides.That indicates that the expanded definition format may be a better match for search intent.However, if we were republishing our post, we’d probably still go for a complete guide. That’s because this angle has more business value for us. It presents more opportunities for us to showcase our product and allow us to go deeper into the topic than an expanded definition.B. Analyze the top-ranking pagesNow that you’ve decided on a format and angle, the next step is to analyze the top-ranking pages to see what they’re doing right. This involves manually visiting relevant pages and looking for key points.If we were doing this for our post about guest blogging, we’d open a few of the top-ranking complete guides as that’s the angle we settled on in the last step.The good news is that there’s no need to read through every post word for word. You just need to get an understanding of the structure and key talking points. The easiest way to do this is to look at the heading tags for commonalities.To speed up this process, install Ahrefs’ SEO toolbar and check the on-page report. Amongst other things, this pulls the heading tags from the page into a neat list.Sidenote. The on-page report is completely free. You can use this feature of the toolbar even if you’re not an Ahrefs customer. If we do this for the three guest blogging guides and paste the lists for each into a spreadsheet, we see plenty of commonalities.All three guides talk about finding guest blogging opportunities and preparing a pitch, and two of the three also talk about writing posts, tracking results, and determining goals. These are all things that would make sense to mention in our updated post.Another way to find key talking points is to do a content gap analysis. To do this, paste the URLs of a few relevant top-ranking pages into Ahrefs’ Content Gap tool. Leave the bottom field blank, then hit “Show keywords.”You should then see the keywords that one or more of these pages rank for. Many of these will often be different ways of searching for the same thing, but there are often subtopics amongst them too. For example, we see keywords like “what is guest blogging” and “does guest blogging work” above. These would be useful sections to include in our post.C. Analyze your backlink profileOne of the mistakes people often make when republishing posts is to remove important link-worthy points. For that reason, before rewriting your post, it’s best to check its backlink profile to see how it earned its existing links.Here’s how to do that:Paste the URL into Ahrefs’ Site Explorer, head to the Backlinks report, then skim for common link reasons in the “Anchor and Backlink” column.For example, it looks like a few people have linked to our guest blogging guide because of a statistic that mentions “20%.”To find out just how many others have linked to us because of this statistic, let’s filter the report for backlinks mentioning “20” in the anchor or surrounding text.It looks like 66 unique pages are linking because of this statistic, so it’s probably worth keeping that mention in the republished post.There are two reasons this is a good idea:It ensures that existing links stay contextually relevant.It may help you earn more links to the post in the future.That said, there’s no reason to keep everything you find in the Backlinks report. Just keep it in the post if it’s still relevant, valuable, and makes contextual sense. For example, if a few people are linking because of an outdated statistic, it would make more sense to replace it with an updated one or remove it altogether.Step 3. Republish the postRepublishing your post is the easy part. Just log in to your site’s CMS (e.g., WordPress), navigate to the old post, then delete the old content and replace it with the new. Keep the URL as is, but make sure to update the title and OG tags to reflect the new content.Finally, change the publish date to the current date and hit update.If you have your site set up in Google Search Console, it’s also worth requesting reindexing after republishing. To do this, paste the full URL of the post into Google Search Console’s URL Inspection tool and hit “Request reindexing” on the next screen.Note that this step is entirely optional. Google will eventually recrawl and reindex the post regardless, but we’ve found that it tends to be faster when you request reindexing.Final thoughtsRepublishing blog posts is a smart way to get more traffic to your posts. It’s been part of our blog growth strategy for a while, and we’re not planning to stop anytime soon.However, it’s worth noting that more search traffic isn’t the only reason to update or republish a post. You should also refresh posts to keep them updated and accurate.Still not ranking higher despite republishing? Read this or watch the video below.https://www.youtube.com/watch?v=Rm1MbJneLSIGot questions? Ping me on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Keep Learning How To Optimize PDFs For SEO, But You Should Make Pages Instead Learn how Google treats PDFs, how to optimize them for SEO, and how to track PDF views. I Tested Premium AI Prompts To See if They’re Worth It. They’re Not. We spent ~$80 to purchase five premium ChatGPT prompts and ran a blind test to see if they were worth it. Result? No. How to Use Google Analytics 4 for Beginners Google Analytics 4 (GA4) is a free web analytics tool from Google that lets you track and measure user traffic and behavior on your website. Free SEO Audit Template (With Video Walkthrough) 100% free to download in multiple formats (Docs, Sheets, Excel, Word, PDF). Covers technical, content, and link optimization for a comprehensive SEO audit. What is an H1 Tag? SEO Best Practices The H1 tag is an HTML heading that's most commonly used to mark up a web page title.",
  "headers": [
    {
      "level": "H1",
      "text": "Republishing Content: How to Update Old Blog Posts for SEO"
    },
    {
      "level": "H2",
      "text": "Step 1. Find underperforming pages with content issues"
    },
    {
      "level": "H3",
      "text": "A. Find underperforming pages"
    },
    {
      "level": "H3",
      "text": "B. Make sure it’s not a new page"
    },
    {
      "level": "H3",
      "text": "C. Rule out backlink factors"
    },
    {
      "level": "H3",
      "text": "D. Make sure it’s an ‘informational’ query"
    },
    {
      "level": "H2",
      "text": "Step 2. Refresh the content"
    },
    {
      "level": "H3",
      "text": "A. Make sure your post aligns with search intent"
    },
    {
      "level": "H4",
      "text": "Content format"
    },
    {
      "level": "H4",
      "text": "Content angle"
    },
    {
      "level": "H3",
      "text": "B. Analyze the top-ranking pages"
    },
    {
      "level": "H3",
      "text": "C. Analyze your backlink profile"
    },
    {
      "level": "H2",
      "text": "Step 3. Republish the post"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Joshua Hardwick"
}