{
  "url": "https://ahrefs.com/blog/seo-content-strategy/",
  "slug": "seo-content-strategy",
  "title": "How to Create an SEO Content Strategy (Follow the Ahrefs' Framework)",
  "description": "This is a guide on how Ahrefs’ SEO content strategy works. Use it as inspiration for your own.",
  "content": "Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents SEO content is content designed to rank on search engines. So an SEO content strategy is your plan on how you’ll use that content to support your business goals.Our SEO content strategy can be summarized into one sentence:We create and maintain high-quality, search-focused content about topics with business potential, search traffic potential, and ranking potential.We’ve carefully crafted this sentence. Each word has earned its way in. If you remove any one of them, everything falls apart.Let’s look at how our content strategy works.Contents1. Find topics with search traffic potentialThe goal of creating SEO content is to rank high on Google. That means you’ll need to target topics your potential customers are searching for. Here’s the quickest way to find keywords with search traffic potential:Go to Ahrefs’ Keywords ExplorerEnter a few broad keywords related to your site or niche (for e.g., we can look for keywords like marketing, seo, keyword, and keywords for our blog)Go to the Matching terms reportFilter for keywords with Traffic Potential (TP)From here, you’ll want to eyeball the report to find keywords your potential customers are searching for.Sidenote. Traffic Potential is the estimated monthly organic search traffic to the top-ranking page for a keyword. Since pages tend to rank for many keywords and not just one, Traffic Potential is a more reliable estimate than search volume.PRO TIP If your competitor is getting a lot of search traffic and it’s not from branded keywords, chances are you could target those keywords too. Here’s how to find them:Go to Ahrefs’ Site ExplorerEnter your competitor’s domainGo to the Top pages reportThis report shows you a website’s top pages by estimated organic traffic and the keyword sending the most traffic to each page. So using our blog as an example, we can potentially analyze moz.com:Learn more: Keyword Research: The Beginner’s Guide by Ahrefs 2. Check their business valueA keyword’s business value, or business potential, is how easy it will be to pitch your product while covering a given keyword.For example, if you own an online store selling coffee equipment, it’ll be much easier to pitch your own product for a topic like best coffee machines versus why does coffee make me sleepy. The keywords with higher business potential are the ones you should prioritize in your SEO content strategy. Here’s a cheat sheet for scoring the “business potential” of keywords:Scoring a keyword depends on how valuable it is for your business. So there’s no right way of scoring it—a “3” for you may be a “1” for others. 3. Analyze ranking potentialDue to a variety of reasons, some keywords are harder to rank than others. So while that doesn’t mean you completely avoid difficult keywords (especially if they have business value), you should take ranking difficulty into account when targeting them.At Ahrefs, ranking potential means it’s viable for us to rank in the top three with our available resources.But how do we know we’ll be able to rank in the top three? We do this by assessing four things.BacklinksBacklinks are one of Google’s top ranking factors. It has even said this itself. Which means that the more high-quality backlinks the current top-ranking pages have, the harder it’ll be to compete with them.To see roughly how many backlinks you’ll need to rank in the top 10 search results, check the Keyword Difficulty (KD) score in Ahrefs’ Keywords Explorer. For example, if we want to rank for the keyword how to make kimchi, it’s estimated that we’ll need backlinks from ~77 websites.For a more thorough assessment, scroll to the SERP overview and check the Domains column to see the number of linking websites to each page.These numbers, however, only tell you about the quantity of backlinks. Quality matters too. So to understand link quality, you’ll need to review each page’s backlink profile. You can do this by clicking the number in the Backlinks column.Learn more: How to Do a Basic Backlink Audit (In Under 30 Minutes) AuthorityGoogle representatives have said that Google doesn’t evaluate a site’s authority. Still, many SEOs believe that authoritative websites have an easier time ranking on Google and, thus, typically take a website authority metric—e.g., Domain Rating (DR)—into account when assessing ranking difficulty. The skepticism arises because SEOs believe that even if Google doesn’t have an internal website authority metric, website authority can still impact rankings:High-DR sites tend to have more high-authority pages (from backlinks) and, thus, internal links from those pages may help other pages rank higher.Searchers prefer seeing trusted brands for some queries.If you think this makes sense and want to evaluate website authority, then you can check the top-ranking pages’ DR scores in the SERP overview section in Keywords Explorer. If they are all much higher than your own DR, you may want to prioritize other keywords.Search intentGoogle knows why searchers are looking for a particular query and gives them what they want to see. For example, Google knows people looking for how to make kimchi want to learn how to make the Korean fermented dish. So the SERPs are—as expected—mostly how-to guides:To analyze each keyword’s search intent, Google your target keyword and analyze the SERPs for the three Cs:Content type – Are they blog posts, landing pages, product pages, or something else?Content format – Are they listicles, how-tos, recipes, tools, or something else?Content angle – Is there a dominant selling point, like how easy it is?You’ll want to make sure you’re able to fulfill the search intent for the keywords you want to target. For example, if the SERPs require you to build a free backlink tool—like backlink checker—and you don’t have the capability to do so (such as a huge links database), chances are you’re not going to be able to compete for that keyword.Learn more: What Is Search Intent? A Complete Guide for Beginners QualityIf someone is testing 47 air purifiers just to create a blog post, chances are it’s going to be hard to beat them on content quality.It’s no wonder they’re ranking #1 for a competitive query:Therefore, to beat Wirecutter, you’ll likely have to review a similar number of air purifiers or do something unique and different. That will require a ton of time and resources. So for the keywords you’re targeting, you’ll want to make sure that beating the top-ranking pages on content quality is within your realm of possibility. After reviewing your desired keywords for the four attributes, you can give them a “ranking potential” score:Learn more: Keyword Difficulty: How to Estimate Your Chances to Rank 4. Create high-quality, search-focused contentFinding keywords that have business potential, search traffic potential, and ranking potential is the core of our entire content strategy. It allows us to create content that not only ranks high on Google but also directly ties into our business goals. After all, there’s no point in generating a ton of organic traffic if people don’t buy. When we have a list of keywords that fulfill our criteria, it’s time to create content. Specifically, high-quality, search-focused content. Let’s break it down. Search-focused means content that matches search intent for its main target keyword. You would have already analyzed search intent during the process of evaluating ranking potential. All that’s left is to match it.For example, if you’re targeting the keyword how to drive traffic to your website, it’s likely you’ll have to create a listicle of the best ways to drive traffic. And that’s what we’ve done:High-quality is subjective. Everyone’s definition will be different. At Ahrefs, we value content with R-E-A-C-H:Real – Authentic and original. Brings something new to the table.Experienced – Written by someone with topical knowledge and expertise.Accurate – Facts backed up by trustworthy sources and opinions clearly expressed.Clear – Explained well without fluff or jargon. Illustrations where needed.Helpful – Truly solves the problem at hand. Not just words for the sake of words.We try, as much as possible, to make sure all content we produce matches these criteria. (Do you think this post matches R-E-A-C-H? 😄)If you’re looking for the exact step-by-step process on how we create SEO content, I recommend reading this post or watching this video:https://www.youtube.com/watch?v=8BdZ0dUu7VQLearn more: Content Creation: The Complete Guide for Beginners 5. Maintain high-quality, search-focused contentWe don’t just publish our content and forget about it. We actively maintain it. That means updating or rewriting our content often.Why do we do this? A few reasons:Your post won’t always rank on the first try.Your post may decline in rankings.For some keywords, search intent may change.Information in your content can get outdated and, thus, affect quality.The SERPs are not static, and people can one-up you. You’ll have to find out why they outrank you and beat them again. For example, we updated our post on free SEO tools recently. Look at how much the traffic spiked after we refreshed it:How do we identify which content needs updating? Every quarter, each writer on the Ahrefs content team goes through their own content and identifies two types of posts:Posts that need updating.Posts that need to be rewritten.Each writer then jumps on a call with Joshua Hardwick, our head of content, to discuss how these pieces of content can be improved. When the general direction is agreed upon, each writer goes back and rewrites their content. While this is our current process, you don’t have to do it like us. In fact, if you’re a WordPress user, the easiest way to see which content needs updating is to install our free WordPress SEO plugin. Set a target keyword for each page, and it’ll tell you if rankings start to decline.You can then investigate and see if it’s because the content needs refreshing. Learn more: Republishing Content: How to Update Old Blog Posts for SEO Final thoughtsOur SEO content strategy is not complex. In fact, I think this simplicity is deliberate. It makes it easy to follow consistently, which may help explain our success with it. Any questions or comments? Let me know on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Keep Learning How to Create a Winning Blog Content Strategy in 7 Steps A blog content strategy is a vision and a plan that you have for your blog. It should be aligned with your business goals and your overall content strategy How to Create a Winning Content Marketing Strategy (+ Template) We share how to create a content marketing strategy to help attract your target audience and influence their buying decisions. Follow My SEO Content Creation Process: How I Rank #1 on Google No secret hacks. Just a simple SEO content creation process that yields results year over year. Follow Our Content Audit Process (Template Included) We share our content audit process, which involves systematically revisiting underperforming pages and identifying ways to improve them. DIY SEO: A Basic 5-Step Guide That Anyone Can Follow Learn how to do SEO yourself with this simple, jargon-free tutorial.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Create an SEO Content Strategy (Follow the Ahrefs’ Framework)"
    },
    {
      "level": "H2",
      "text": "1. Find topics with search traffic potential"
    },
    {
      "level": "H2",
      "text": "2. Check their business value"
    },
    {
      "level": "H2",
      "text": "3. Analyze ranking potential"
    },
    {
      "level": "H4",
      "text": "Backlinks"
    },
    {
      "level": "H4",
      "text": "Authority"
    },
    {
      "level": "H4",
      "text": "Search intent"
    },
    {
      "level": "H4",
      "text": "Quality"
    },
    {
      "level": "H2",
      "text": "4. Create high-quality, search-focused content"
    },
    {
      "level": "H2",
      "text": "5. Maintain high-quality, search-focused content"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Si Quan Ong"
}