{
  "url": "https://ahrefs.com/blog/seo-techniques/",
  "slug": "seo-techniques",
  "title": "13 SEO Techniques for More Traffic",
  "description": "Want more traffic? Check out these 13 SEO techniques that can help you rank higher for keywords and get more clicks.",
  "content": "Chris Haines Chris is an SEO director who has 10 years of experience in SEO, agency side. When not involved in SEO, he enjoys messing around with vintage synthesizers, walks on sandy beaches, and a good cup of tea. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Getting more traffic to your website from organic search can be done in three ways.You can either:Rank higher for existing keywords.Rank for more keywords.Get more clicks.The SEO techniques below all help you do one or more of those things.Contents1. Spy on your competitors’ content topics to get new ideasCompetition makes life harder, but your competitors SEO strategies can also be a source of topic ideas.To find your competitors’ most trafficked pages, you can use the Top pages report in Ahrefs’ Site Explorer. For example, if we plug a competitor into Ahrefs, we see its guide to Magento SEO gets a fair amount of search traffic.We haven’t covered this topic yet, but it could be worth doing.You can also use the Competitive Analysis report to find keywords your competitors rank for that you don’t. Here’s how:Enter your domain into the Competitive Analysis reportEnter a handful of competitorsHit CompareOnce you’ve done that, you’ll be able to compare your competitors’ keywords, rankings, and traffic against your own.In this example, we can see the “Common keywords” we share with our competitors, as well as the specific keywords our competitors rank for, but Ahrefs doesn’t. This report has identified 68,711 keywords, so there are more than enough opportunities for new content topics.2. Prioritize low-difficulty topics to fast-track progress in search enginesIt’s worth prioritizing low-difficulty topics if your site is new because you may struggle to rank for competitive topics early on.You can find these with a keyword research tool like Ahrefs’ Keywords Explorer. Just search for keyword ideas, then filter for those with low Keyword Difficulty (KD) scores.If you want to find keywords that are not only low KD but also have a website with a certain DR ranking in that keyword’s SERP, then you can use the “Lowest DR” filter.In the example below, I’ve entered a DR of up to 10 appearing in the top five.Once we’ve applied the filter, we can click through the keywords and scroll down to the SERP overview to see the results. Sure enough, we can see the fifth result with DR 7 for the keyword “willowton chest of drawers.”This is a powerful SEO technique to find low KD and “weak SERPs”—where a low-DR site is ranking among much higher DR sites.3. Refresh old content to stay relevant on the SERPsOld content needs updating periodically because Google rankings don’t last forever, especially if you’re targeting time-sensitive topics.For example, here’s the estimated organic traffic to our list of top Google searches over time.Each dip occurred when the content lost its freshness. Searchers wanted an up-to-date list of the top Google searches, but ours was old. That’s why rankings tanked. Each spike occurred when we updated the content.You can find pages on your site that may be due for a refresh in Site Explorer.Here’s what to do: Plug in your siteGo to the Top pages report Set the comparison mode to Previous year Sort the report by traffic change from low to highLook for topics where freshness may be the issueIf you’re a WordPress user, you can find pages that no longer perform well by running a free content audit using the Ahrefs SEO WordPress plugin.4. Create thorough content to rank for more keywordsCovering the relevant subtopics your target audience are interested in—without keyword stuffing—often means you’ll rank for more keywords and and get more organic traffic to your most relevant blog posts and landing pages.We proved this in our study, which found that if a page ranks #1 for a keyword, it ranks for almost 1,000 more keywords in the top 10 on average. But how can you create more thorough content? It’s simple—you’ll need to fill the content gaps.Here’s how to find them:Put your main keyword into Keywords ExplorerScroll to the SERP overview and select a few top-ranking pagesClick the “Open in” dropdown and select “Content gap”Using the keyword “affiliate marketing,” we can see that the top-ranking pages also rank in the top 10 for:What is affiliate marketingHow to become an affiliate marketerHow to do affiliate marketingIf we were to cover these subtopics in a blog post about “affiliate marketing,” we would likely rank higher and get more website traffic for long tail keywords.5. Create content hubs to become an authority in search enginesContent hubs are interlinked collections of content about a topic.For example, our beginner’s guide to SEO is a content hub. It has a pillar page about SEO that links to and from subpages about how search engines work, SEO basics, keyword research, etc.The main benefit of content hubs is that link equity flows to and from all the pages in the hub via internal links. In other words, if one of your subpages gets lots of backlinks, they all get stronger and potentially rank higher in Google and other search engines.If you already have content on your website, the easiest way to create a content hub is to reorganize related pages around a new “hub” page.If you want to create a new content hub, one of the easiest ways to find topics is to look at your competitors’ top subfolders. For example, let’s plug DietDoctor into Site Explorer and go to the Site structure report. We see 30 pages under the /low-carb/keto/recipes subfolder that get an estimated 143K monthly search visits in total.If we click the number of pages, we see all the pages under that URL structure, along with their estimated traffic and top keyword.Many of these topics will make sense for a content hub.Further readingContent Hubs for SEO: How to Get More Traffic and Links With Topic Clusters6. Get high-quality backlinks to improve rankings in search engines (Long term SEO technique)Backlinks are one of Google’s top ranking factors, but getting high-quality ones is easier said than done. It’s arguably one of the most challenging parts of creating a successful SEO strategy.For that reason, before you start trying to build more backlinks to a page, it’s worth checking whether this is likely to help.For example, if you plug our guide to SEO analytics into Site Explorer, you see it has backlinks from 57 referring domains (websites):This page currently ranks #2 for its main target keyword: But if you check the top-ranking pages for that keyword in Keywords Explorer, you see that the page outranking us has significantly fewer referring domains.These numbers don’t consider backlink quality, so it could be the case that the top-ranking page outranks us because it has more high-quality backlinks. But generally speaking, it doesn’t look like a lack of backlinks is the issue.On the other hand, if you look at the SERP for “what is seo,” you see that our page has significantly fewer backlinks than those outranking us.Building more backlinks is probably the way to go here.Further readingLink Building for SEO: The Beginner’s GuideHow to Get Backlinks: 15 Proven Tactics9 Easy Link Building Strategies7. Optimize internal links to boost important pages in search enginesInternal links are links from one page on your website to another. Optimizing internal links is one of the most widely shared SEO techniques by SEOs.Like backlinks, they transfer “link equity” from page to page. Unlike backlinks, you have complete control over where and how you internally link on your website. That’s why a popular SEO technique is to point more internal links at pages that need a boost. To find these pages, plug your domain into Site Explorer, go to the Organic keywords report, and filter for keywords ranking 2–10. You can then sift through this report for your main target keywords.For example, we rank #7 for “off page seo.”To find relevant and contextual internal link opportunities for this page, we can add it to the “Target page” filter in the Link opportunities report in Ahrefs’ Site Audit. In this example, the report suggests we internally link a contextual mention of “off-page seo” in our on-page SEO guide. Further readingInternal Links for SEO: An Actionable Guide8. Reclaim backlinks by fixing broken linksBroken backlinks are a common problem because people often delete or move pages over time. Unless you redirect these pages to their new URLs, any backlinks pointing to the old ones will effectively point to nowhere. Fixing and reclaiming broken links is one of the most popular SEO techniques.Here’s how to find broken pages with backlinks on your site:Paste your domain into Site Explorer Go to the Best by links reportAdd a “404 not found” filterSort the report by referring domains from high to lowFor example, we have backlinks from 57 referring domains pointing to the old URL for our SEO Toolbar. Given that our “SEO toolbar” page still exists, we can reclaim those backlinks by redirecting the old URL to the new one.If you want to know how to deal with a broken link opportunity, use our flowchart below to help you decide.Further readingHow to Find and Fix Broken Links9. Create click-worthy search results to get more trafficRanking high on Google is only part of the battle. You also need to entice searchers to click on your result. Here are a couple of ways to do this:Write a compelling title tag and meta descriptionAdd schema markup for rich snippet eligibilitySearch engines like Google often show title tags and meta descriptions in the search results, so making them as compelling as possible without creating clickbait is important.Here are some tips: Keep it short – Ideally under 70 characters.Match search intent – Show that you have what searchers want.Be descriptive – Give them what they want.Don’t clickbait – Focus on “overdelivering.”Include your keyword – Or a close variation.You can also use schema markup to make pages eligible for rich snippets. This is where Google shows additional information below the search snippet, such as review ratings and FAQs.Given that these optimizations take time, it’s worth prioritizing pages with the most search traffic. You can find these in Google Search Console and Google Analytics, or get an estimate using the Top pages report in Ahrefs’ Site Explorer.Further readingHow to Craft the Perfect SEO Title TagHow to Write the Perfect Meta DescriptionRich Snippets: What Are They and How Do You Get Them?What Is Schema Markup? How to Use It for SEO10. Win featured snippets to build traffic quicklyFeatured snippets are short answers that show in some search results for certain search queries. Google pulls them from one of the top-ranking pages. Getting featured snippets is one of the most popular SEO techniques.By winning featured snippets, you can shortcut your way to the top of Google. But first, you need to find the best opportunities.Here’s how to do it:Enter your domain into Site ExplorerGo to the Organic keywords reportFilter for top 10 rankingsFilter for SERPs with featured snippets where you don’t rankYou should now see all the keywords you rank for in the top 10, where Google shows a featured snippet from another result. For example, we rank #2 for “google operators,” but Google pulls the featured snippet from another page.There’s no exact science to winning featured snippets, but you’re unlikely to do so unless your page has the information Google wants to see.For example, it’s clear that Google wants a short definition here, but our page doesn’t have one. While adding one to our page doesn’t guarantee Google will choose us for the featured snippet, it will improve our chances.Further readingHow to Optimize for Google’s Featured SnippetsAhrefs’ Study of 2 Million Featured Snippets: 10 Important Takeaways11. Optimize Core Web Vitals to provide a better experienceCore Web Vitals are used by Google to measure user experience. They measure a page’s load time, interactivity, and the stability of the content as it loads. Google highly recommends in its own documentation that site owners optimize them.Here are the core metrics you should benchmark against:Largest Contentful Paint (LCP)First Input Delay (will be replaced by Interaction to Next Paint in March 2024)Cumulative Layout Shift (CLS)Core Web Vitals are not a strong ranking factor but can still make a difference. You can monitor your Core Web Vitals for free by running a crawl using Ahrefs Webmaster Tools.If you’ve already run a Site Audit, just head over to the Performance report and click on “Crawl settings” on the banner.Then scroll down and follow the instructions to “Get a free API key from Google.”Once you’ve pasted in your API key, hit “Save.” Then run a “New audit” by clicking the button in the top right-hand corner.If you head back to the Performance report, you’ll see the status of your Core Web Vitals metrics visualized.Further readingA Primer on Core Web Vitals12. Get easy backlinks by curating industry statisticsCurating industry statistics is a great way to acquire backlinks. The reason is that when bloggers and journalists are looking for statistics on a topic, they will often search for them on Google. If they find your article, they usually reference it using a backlink. We’ve actually seen this ourselves with our post on SEO statistics.If we put the domain into Site Explorer, we can see that this post has been linked to a lot.And one of the highest authority links this article got was from Adobe, a DR 96 website.Creating a statistics post focused on your industry is a powerful way to acquire backlinks.13. Improve E-E-A-T by adding expert quotesE-E-A-T stands for experience, expertise, authority, and trust. Although not a direct ranking factor, Google has said it uses a “variety of signals as a proxy to tell if content seems to match E-E-A-T.” By including expert quotes in your content, you can get backlinks and improve your E-E-A-T.Here’s an example where we got a link to our hreflang tags guide simply by quoting John Mueller.You can easily recreate this by asking experts in your industry for their opinion on a certain topic.Final thoughts There are plenty of SEO techniques you can use to get more organic traffic to pages on your site from Google and other search engines. These are just a few of the main ones you can use as part of your SEO strategy.If you want more, read our list of SEO tips.Got questions? Ping me on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Chris Haines Contributors Chris is an SEO director who has 10 years of experience in SEO, agency side. When not involved in SEO, he enjoys messing around with vintage synthesizers, walks on sandy beaches, and a good cup of tea. ContributorsKeep Learning Content Hubs for SEO: How to Get More Traffic and Links With Topic Clusters Content hubs are interlinked collections of content about a similar topic. Learn why they're good for SEO and how you can create one for yourself. SEO for Nonprofits & Charities: 13 Tips for More Traffic Make your nonprofit organization more visible in search engines and generate consistent, passive traffic with these 13 SEO tips. How to Create SEO SOPs to Scale Organic Traffic Standard operating procedures make your work faster, easier, and more scalable. A lot of SEO tasks are simple and repeatable—ideal for SOPs! 6 Holiday SEO Tips (To Boost Traffic During the Shopping Season) Implement these six holiday SEO tips so you can rank your pages higher for the busiest seasons of the year. How to Improve SEO: 15 Tactics to Boost Your Rankings & Traffic (That Don’t Require New Content) These tried and true tactics are ideal for improving your SEO and boosting rankings—and won't require you to create new content.",
  "headers": [
    {
      "level": "H1",
      "text": "13 SEO Techniques for More Traffic"
    },
    {
      "level": "H2",
      "text": "1. Spy on your competitors’ content topics to get new ideas"
    },
    {
      "level": "H2",
      "text": "2. Prioritize low-difficulty topics to fast-track progress in search engines"
    },
    {
      "level": "H2",
      "text": "3. Refresh old content to stay relevant on the SERPs"
    },
    {
      "level": "H2",
      "text": "4. Create thorough content to rank for more keywords"
    },
    {
      "level": "H2",
      "text": "5. Create content hubs to become an authority in search engines"
    },
    {
      "level": "H2",
      "text": "6. Get high-quality backlinks to improve rankings in search engines (Long term SEO technique)"
    },
    {
      "level": "H2",
      "text": "7. Optimize internal links to boost important pages in search engines"
    },
    {
      "level": "H2",
      "text": "8. Reclaim backlinks by fixing broken links"
    },
    {
      "level": "H2",
      "text": "9. Create click-worthy search results to get more traffic"
    },
    {
      "level": "H2",
      "text": "10. Win featured snippets to build traffic quickly"
    },
    {
      "level": "H2",
      "text": "11. Optimize Core Web Vitals to provide a better experience"
    },
    {
      "level": "H2",
      "text": "12. Get easy backlinks by curating industry statistics"
    },
    {
      "level": "H2",
      "text": "13. Improve E-E-A-T by adding expert quotes"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Chris Haines, Joshua Hardwick"
}