{
  "url": "https://ahrefs.com/blog/seo-outsourcing/",
  "slug": "seo-outsourcing",
  "title": "Here’s How You Can Outsource SEO Easily and Effectively (+ Best Practices)",
  "description": "Learn what SEO outsourcing is, services often outsourced, and best practices for outsourcing based on my agency experience.",
  "content": "Chris Haines Chris is an SEO director who has 10 years of experience in SEO, agency side. When not involved in SEO, he enjoys messing around with vintage synthesizers, walks on sandy beaches, and a good cup of tea. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Struggling to find time for essential SEO tasks? Outsourcing SEO might be the solution.Outsourcing SEO allows you to leverage expert knowledge and free up time for other critical aspects of your business.To outsource effectively, you’ll need to hire an SEO freelancer or an SEO agency and decide what parts of your SEO campaign you want to delegate.In this beginner’s guide, I’ll explain what SEO outsourcing is, share services often outsourced, and discuss best practices based on my agency experience.ContentsWhat is SEO outsourcing, and why should you consider it?I’m guessing you clicked on this post to see if outsourcing SEO is right for your business. But what is it exactly?SEO outsourcing involves hiring an external agency or freelancers to handle SEO tasks. Whether you need a freelancer for keyword research or a full-service agency to handle every aspect of SEO, outsourcing can be tailored to your specific needs.For example, it could look like this—with a single SEO freelancer supporting your company.But, if your business needs more support, a lone freelancer may not be enough, and you may need to outsource SEO to a dedicated agency, which might look like this.And sometimes, a company may outsource parts of its SEO campaign to a mix of freelancers and agencies, as illustrated below.The reality is outsourcing SEO takes different forms and depends on your business needs.So, when should you consider outsourcing SEO? There are two main reasons:The first is urgency – If you need a project delivered within a short timeframe, outsourcing SEO is usually the best option because hiring a full-time employee takes time to hire and train themThe second is budget – Outsourcing SEO is usually more cost-effective than hiring a full-time employee because you can hire freelancers for specific tasks and not have to pay benefits or salaryThere are also more specific reasons where SEO outsourcing can be beneficial.For instance, if you:Need very specific SEO expertise – e.g., Law firm SEO, plumbing SEO, dental SEO, etc.Need to reduce the workload for in-house teams quicklyNeed speed and efficiency of deliveryHave a new client but don’t have time to hire an FTEWant a hands-off approach to SEOWant to focus on an area of SEO you’re good at rather than something you’re notIf these feel like familiar challenges, it’s worth considering outsourcing SEO.Agencies vs. freelancers – which should you choose?If you want to outsource your entire SEO strategy and don’t have much knowledge of SEO yourself, then an agency is probably the best option (assuming you’re willing to pay $1001+ per month.)Here’s why.You get access to an account manager and a team of SEO expertsYou also get access to the best tools in the business – Although agency fees are typically higher than a freelancer’s, agencies often have access to many different tools, some of which could be unaffordable for either your company or a freelancerYou get expertise – Agency SEOs don’t just work on one client. They work on many different client accounts spanning many different industries – they bring this expertise to the table in every meetingHowever, if you’re looking to outsource a specific part of your SEO strategy, such as content, keyword research, or link building, and you’re working on a tight budget, then it could be better to start talking to a freelancer.Freelancers are usually more cost-effective – They usually have fewer overheads than agencies. According to Josh’s SEO pricing study, SEO agencies charge 138% more than freelancersFreelancers are often faster to work with – Due to less paperwork and onboarding processesBoth agencies and freelancers can meet your SEO needs, but your choice depends on your desired level of involvement and budget.To summarize, SEO agencies are ideal for businesses with a hands-off approach or a larger budget. Freelancers are best for accessing specialized knowledge within a tighter budget.What SEO services can you outsource?Outsourcing allows you to delegate time-consuming or complex SEO tasks without overburdening your team.Here are some key services you can outsource in SEO.As there are at least 67 types of SEO, I can’t cover every service here, but you get the idea—almost everything in SEO can be outsourced for a price.Here are the most common outsourced SEO services based on my previous agency experience.Content creationSometimes content creation can become overwhelming, and you may need extra support. Outsourcing parts of your content creation can help ease the workload.So, what do you need to know when outsourcing content? These are the most important considerations:What it costs to outsource contentWhat to look for when outsourcing contentWhat risks are there with outsourcing contentCostThe cost of outsourcing content can vary a lot. You can pay as little as a few dollars or thousands of dollars per article. It depends on your budget.Ahrefs’ study into cheap vs expensive freelance writers revealed that the median cost of a writer was ~$0.15 per word. It may be more or less depending on what region you’re in, but this gives you a benchmark of what you can expect to pay for content.In my experience, I’ve never hired a writer for as cheap as $0.02 per word. I usually pay ~$0.20 upwards for content. The reason: I’ve learned through experience that very cheap content, although tempting, often requires a lot of editing.This, in my opinion, defeats the purpose of outsourcing SEO in the first place—as you either have to edit yourself or hire an editor. Sometimes, it’s just better to get a decent writer the first time around.What to look forHere are the key things I looked for when hiring content writers at my previous SEO agency:Understands the content brief and requires minimal “hand holding”Native-language speakerProven experience in writing about the topicResponsive to feedbackPotential risksThere are three key risks of outsourcing content:AI or automation – The cheaper your content writer is, the higher the chances they may be using automation or AI to create the content. Ask your writers how they create their content. Using AI doesn’t mean your content won’t rank in Google, but it is something to be aware of because your writer may not have even reviewed the content themselvesYawn-inducing content that sends your readers into a coma – Freelance writers are less invested in your brand, so they may not convey much personality in their writing. Counteract this by creating detailed briefs instructing the writer on your brand’s tone of voiceOver-optimized SEO content – Sometimes, writers go overboard mentioning specific keywords or having an H2 heading every three sentences: “FoR tHe SeO.” Counteract this by instructing them what the headings should be and how they should mention keywordsFinding content creatorsNeed a reliable content writer? Here’s where I usually start looking.UpworkPeople Per Hourr/HireaWriterAsk former colleaguesIf you need a longer-term commitment on a bigger scale, working with a content agency might be a better option.TipKeep a spreadsheet of your favorite freelance writers and agencies, including their rates, your review, and their specialization.Link buildingLike content, link building is often outsourced for the same reason—it’s time-consuming.So, what do you need to know when outsourcing link building? These are the most important considerations:What it costs to outsource link buildingWhat to look for when outsourcing link buildingWhat risks are there with outsourcing link buildingCostSure, you can buy links from Fiverr for five bucks, but these links won’t help you rank in Google for long—or at all.So, what’s the average cost of link building? Well, it depends…For example, it depends on your location:And the type of link building you’re doing.Sidenote.Before we proceed, it’s worth noting that Google considers buying links for ranking purposes a link spam technique — so take my advice here at your own risk.What to look forHere are the key things I looked for when hiring link builders at my previous SEO agency:Can build high-quality links that help improve rankingsHas a reputation for ranking websites in the industry I was looking forUnderstands what a high-quality backlink looks likeCreates the links themselves in-housePotential risksThe number one risk of outsourcing link building is getting low-quality links. So, how can you avoid this?Here’s what I check:Is the site a legitimate website? Does it look like a website you would trust?Is the site getting actual organic traffic? Check the Overview report in Site ExplorerDo the Ahrefs metrics align with other sites of a similar authority? Check anchor text, and referring domainsDoes the website look like it’s selling links? Look for anchor text with high commercial intent that looks suspicious, like the below exampleIn the image above, there are two examples of commercial anchor text in red that look unnatural.Finding link buildersMy go-to place for finding link builders is freelance platforms like Upwork.If you need to scale faster, an agency might be a better option. There’s no shortage of link-building agencies out there, and for a fee, they will help you get links for your website.Technical SEOWhen your site has a serious technical issue and performance has dropped, you may need to hire a technical SEO. The first indicator that something could be wrong is if you notice a significant drop in the health score of a tool like Ahrefs’ Site Audit.That may look something like this.If this is combined with a drop in organic traffic on Site Explorer’s Overview, you may need to find a technical SEO freelancer—fast.CostTechnical SEO varies in complexity and cost, making it crucial to choose an experienced partner who can quickly address issues to prevent sustained traffic loss. After looking at Upwork, you can get a freelancer for as little as $8 to $200 an hour.It’s a huge variation, so to avoid disappointment I normally stay clear of the lower end of pricing.What to look forLook for someone with:Significant proven experience in technical SEO — Check to see what level of experience they haveKnowledgeable about your area of search — Check to see if they’ve worked on similar websites beforePotential risksUnfortunately, like links and content, there are also risks associated with outsourcing technical SEO.So what are they?Bad advice – Incorrect advice could lead to more problemsWrong prioritization – The wrong issues may be prioritized, leading to prolonged loss of organic trafficCommunication breakdown – If a technical SEO leaves mid-project, it could cause further ongoing issuesFinding technical SEOsLook through LinkedIn and message technical SEOs for advice. One of the big advantages of using LinkedIn is that it’s free to message people.For example, here’s a snapshot of a LinkedIn profile from one of my former colleagues. You can see this person has solid technical SEO experience. This is what a good profile looks like—but it will cost you.With an SEO of this caliber, you only need to spend a few hours consulting with them to work out your technical SEO issues. However, if you continuously spend money at the lower end of the spectrum, you may never get your technical SEO issues resolved.Keyword researchIf you want to rank on Google, you can try guessing what keywords will bring you traffic. Or you can reverse engineer what is already working in Google using data from tools like Ahrefs Keywords Explorer.For one or two keywords, you can research using our free keyword generator. But if you need a lot of keyword research, for instance, for a new website, then it could be a good idea to outsource it.CostKeyword research on Upwork starts at ~$50, cheaper than most other SEO services mentioned here. But like many of the other SEO services mentioned here, there is good keyword research and bad keyword research.What to look forThey use a trusted keyword research tool like Ahrefs’ Keywords ExplorerThey go beyond just search volume and the keywords and look at metrics like Traffic potential and Keyword Difficulty Potential risksHere are the risks of outsourcing keyword research based on my experience:Targeting the wrong keywords – Sometimes, after you’ve written an article, you’ll find that it doesn’t get much traffic. Often, the reason is the article that you’ve written doesn’t completely fulfill the search intent for that precise keywordData is inaccurate due to using a low-quality SEO toolData is too simplistic – e.g., only keywords and search volume. In my experience, I would expect metrics like Keyword Difficulty and Traffic Potential to be included as well to help make an informed decision of whether the keyword was worth targetingFinding keyword research expertsKeyword research is usually provided as a standard part of an agency’s SEO services, but if you’re not with an agency, you can either hire a freelancer to do it or do your research using a tool like Ahrefs’ Keywords Explorer.Best practices for outsourcing SEOOver the years, I’ve spent a small fortune on freelancers. Some have been incredible, and some have been incredibly bad. Avoid the bad ones by following my hard-earned best practices.Request these things when working with outsource partnersI’ve worked with many outsourcing partners in my agency career, from freelancers to external agencies. If I want to work with them, I always request three things:An SEO proposal for the work. Ask for an SEO proposal of what they are going to do, check out my article on SEO proposals to get a rough idea of what one should look likeReferences from their recent work. Ask for references. Don’t have any? That’s an instant red flag. This is less about the references themselves and more about seeing how fast a potential outsource partner can share a glowing reference. Look for someone who has a good track record in your industry or particular nicheA video call interview. If they’ve passed the first two tests, it’s time for a quick 30-minute interview. Again, this is less about talking about what they’ve achieved but rather about seeing whether you could work with this person or group regularlyUse a Kanban board to track progress toward your goalsKanban boards are the perfect way to track tasks when outsourcing SEO, but many people overcomplicate them.When I worked in an agency, I had a simple setup like the one below.I ran and managed a ~$50k pm enterprise SEO account, several external agencies, and a development team using this exact Kanban board format.The lesson here: don’t overcomplicate things. You can use many tools, but my favorites are Notion and Trello.TipCombine a Kanban board with a tool like Slack to quickly resolve queries from external agencies and freelancers.Create standard operating procedures (SOPs)Without clear SOPs, work can be easily misinterpreted, leading to last-minute revisions. Define tasks clearly from the start to ensure desired outcomes.Create SOPs to define exactly what you want delivered. Otherwise, you will not get the desired output.For basic tasks, you can create a basic SOP for free using a tool like Google Docs, Trello, or Notion. You can even use ChatGPT to create one.Here’s an example of a prompt I used to create an SOP for Keyword Research using Ahrefs.Or, for more complicated tasks that involve multiple tools, techniques, or processes, use a tool like Scribehow—it’s useful for quickly building more detailed SOPs that involve multiple tools or processes.Set clear goals and monitor progress using AhrefsOnce you’ve hired your outsource partner, you should establish clear delivery deadlines and schedule regular check-ins to ensure your delivery date is achievable.But if you do not know SEO, how can you ensure the job has been completed well? You can use tools like Ahrefs to check.Use Site Explorer’s Overview to check organic traffic and links and correlate the impact of content changes.Use Site Audit to check technical SEO performance.Use Keywords Explorer to double-check keyword research.Use Rank Tracker to monitor important keyword rankings over time.If you have a copy of Ahrefs, you can monitor almost every aspect of what your outsource partner is doing. So, even if you aren’t doing SEO yourself but want to keep track of progress, it’s a useful tool.Final thoughtsIf you want to outsource SEO, there’s no shortage of people to fill the role, but finding your perfect outsourcing partner(s) is usually the biggest challenge.To get the right partner, vet thoroughly, create SOPs, and set clear expectations and goals, and you won’t go far wrong. If you are unsure of the quality of the work delivered, you can double-check using tools like Ahrefs to monitor their progress.Got questions? Let me know on LinkedIn. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Chris Haines Chris is an SEO director who has 10 years of experience in SEO, agency side. When not involved in SEO, he enjoys messing around with vintage synthesizers, walks on sandy beaches, and a good cup of tea. Keep Learning How to Outsource Your Content to Freelance Writers (4 Steps) Learn how we grew the Ahrefs blog by thousands of visitors per month with freelance writers, and how you can do the same. What is an H1 Tag? SEO Best Practices The H1 tag is an HTML heading that's most commonly used to mark up a web page title. WordPress SEO: 20 Tips and Best Practices WordPress makes it easy to use SEO best practices. Improve your site's SEO with the tips in this guide. 12 SEO Best Practices to Improve Rankings in 2023 Here are 12 important SEO best practices to help you rank higher in Google and improve your website’s performance. Quick SEO: 8 Ways to Accelerate SEO Results From Months to Days Think all SEO progress is slow as molasses? Think again.",
  "headers": [
    {
      "level": "H1",
      "text": "Here’s How You Can Outsource SEO Easily and Effectively (+ Best Practices)"
    },
    {
      "level": "H2",
      "text": "What is SEO outsourcing, and why should you consider it?"
    },
    {
      "level": "H2",
      "text": "Agencies vs. freelancers – which should you choose?"
    },
    {
      "level": "H2",
      "text": "What SEO services can you outsource?"
    },
    {
      "level": "H3",
      "text": "Content creation"
    },
    {
      "level": "H4",
      "text": "Cost"
    },
    {
      "level": "H4",
      "text": "What to look for"
    },
    {
      "level": "H4",
      "text": "Potential risks"
    },
    {
      "level": "H4",
      "text": "Finding content creators"
    },
    {
      "level": "H3",
      "text": "Link building"
    },
    {
      "level": "H4",
      "text": "Cost"
    },
    {
      "level": "H4",
      "text": "What to look for"
    },
    {
      "level": "H4",
      "text": "Potential risks"
    },
    {
      "level": "H4",
      "text": "Finding link builders"
    },
    {
      "level": "H3",
      "text": "Technical SEO"
    },
    {
      "level": "H4",
      "text": "Cost"
    },
    {
      "level": "H4",
      "text": "What to look for"
    },
    {
      "level": "H4",
      "text": "Potential risks"
    },
    {
      "level": "H4",
      "text": "Finding technical SEOs"
    },
    {
      "level": "H3",
      "text": "Keyword research"
    },
    {
      "level": "H4",
      "text": "Cost"
    },
    {
      "level": "H4",
      "text": "What to look for"
    },
    {
      "level": "H4",
      "text": "Potential risks"
    },
    {
      "level": "H4",
      "text": "Finding keyword research experts"
    },
    {
      "level": "H2",
      "text": "Best practices for outsourcing SEO"
    },
    {
      "level": "H3",
      "text": "Request these things when working with outsource partners"
    },
    {
      "level": "H3",
      "text": "Use a Kanban board to track progress toward your goals"
    },
    {
      "level": "H3",
      "text": "Create standard operating procedures (SOPs)"
    },
    {
      "level": "H3",
      "text": "Set clear goals and monitor progress using Ahrefs"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Chris Haines"
}