{
  "url": "https://ahrefs.com/blog/seo-for-lawyers/",
  "slug": "seo-for-lawyers",
  "title": "SEO for Lawyers & Law Firms: The Complete Guide",
  "description": "A guide on increasing the chances of ranking on Google Map Pack and regular organic results—tailored for lawyers, attorneys, and law firms.",
  "content": "Mateusz Makosiewicz Marketing researcher and educator at Ahrefs. Mateusz has over 10 years of experience in marketing gained in agencies, SaaS and hardware businesses. When not writing, he's composing music or enjoying long walks. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents SEO can help your law firm’s website rank higher in Google searches for legal assistance. A higher rank makes it easier to find your website and increases your chances of gaining new clients. ContentsSEO (Search Engine Optimization) is considered a free marketing channel because you don’t pay Google for ranking or each click that goes to your site (unlike Google Ads). You can use SEO to substitute advertising or alongside it to diversify your marketing channels. SEO’s benefits go beyond saving money. It lets you target traffic with precision by using keywords that match your firm’s services, ensuring visitors are more likely to need your help. Plus, the impact of SEO builds over time: optimized content, even from years ago, can keep bringing in traffic, creating a compounding effect that continuously boosts your site’s visibility.However, this type of marketing requires patience. According to our study, it takes between three to six months on average to start seeing results. This makes SEO a strategy for those committed to long-term growth.This is a beginner-friendly, complete SEO guide made for:Lawyers and law firm owners who want to start investing in SEO for their brand. Yes, SEO is something that can do on your own. It doesn’t require special skills, only some time to learn the basics. In fact, legal expertise gives you an edge in creating authoritative SEO content that Google favors. In-house marketers working for law firms looking for a cost-effective marketing channel or to improve organic traffic. Agencies working for law firms looking for specific SEO tactics that work in this industry. We’ll cover two main areas that will allow you target potential clients in your area while establishing expertise in your legal field:Optimizing your Google Business Profile to enhance visibility in local searches via Google Maps.Optimizing for regular organic results including finding relevant keywords with traffic potential, creating optimized content that addresses the legal questions and needs of potential clients, and building links to boost your site’s authority and increase chances of ranking for more competitive keywords. Sounds good? Let’s get started! 1. Optimize for Google Map PackThe Google Map Pack (also called Google Local Pack and Google Snack Pack) is a so-called rich result that Google shows to searchers to help them find the best result based on location, among other things. In most cases, the queries your potential clients use to find businesses like yours will trigger Google’s map pack because Google “thinks” people want to find something related to a location. As you can see, Google’s map pack is displayed on top of the organic results. And apart from the ads, it’s the first thing that searchers see. So getting your name out there dramatically increases your chances of being discovered. No one and nothing can guarantee your place in the map pack. This is because your competition will do similar things to get there. Plus, nobody except for Google itself knows how exactly local ranking works. What we do know are the three principles Google uses fluidly to determine what goes into the local pack:Relevance – How well a business profile matches the meaning of the query. Distance – The distance between the search result and the location of the searcher or location specified in the query (e.g., “lawyer mountain view”). Prominence – This counts in a number of things: popularity in the “offline” world, online reviews and rankings, links to the website and, interestingly enough, rankings in the organic search results. Based on Google’s guidelines and known local ranking factors, here are three things you should do to increase your chances of showing up in Google’s map pack. Get and optimize your Google Business ProfileGoogle’s map pack is made up of Google Business Profiles, so it’s crucial that you list all of your business locations with the service (but don’t use virtual offices). What’s more, with this profile, your business will be eligible to show up on Google Maps. And Google will be able to display a local knowledge panel for queries, including your business name. If you’re starting fresh, you will need to create your business profile. If the business already exists or someone else has claimed it, you may need to claim your profile instead. The process of filling out the details in your business profile is similar in both cases. And it’s quite straightforward—a bit like setting up a social media account. But to make sure your profile is optimized, check out tips from our guide: How to Optimize Your Google My Business Listing in 30 Minutes. Remember, the more specific information and relevant photos you share, the better. And when in doubt, check with Google’s guidelines. This is because a violation of those can lead to profile suspension. Sidenote. Some SEO guides state that information displayed in these rich results comes from schema markup. That’s not accurate. First and foremost, they come from business profiles. So while it doesn’t hurt to apply schema markup to your website, you should focus on optimizing your Google Business Profile.Get listed on local citation sites and directoriesLocal citations and directories are online mentions of your business that display your business name, address, phone number and, in most cases, your website too. You need them for three reasons: They are a ranking factor for Google Map Pack; they can help you rank higher in those results. While any local directories can help you rank higher in Google Map Pack, the ones that feature a link to your website can help you with organic search results too. They will help searchers find your business in a) search engines like Google and b) search results of those directories. “Lawyer near me” results in directories, directories, and then some more directories. But those can potentially lead to your business if you get listed.Start by getting listed with big aggregators like Foursquare. Then submit your data to popular platforms like Facebook, Yelp, and Bing Places, and go for popular directories in your local area and industry like FindLaw, Justia, or LegalMatch. Just make sure to keep your citations consistent at all times. A method that saves your time when looking for local citations manually is to use Ahrefs’ Link Intersect tool. Just open the tool, plug in your competitors’ URLs, and leave the last input blank. You will find the Link Intersect tool by clicking on More in the upper menu. Then fill out the fields as shown in the example. You can inspect up to 10 domains in one go (click “Add target”).Here are some sample results. Note that you can use the tool to find other link opportunities too. (In this case, the tool shows us almost 15K domains.) Further readingHow to Build Local Citations (Complete Guide) Local SEO Ranking Factors Encourage your clients to leave reviews According to Google, positive reviews and rankings help its algorithms understand which businesses are more prominent. You can ask your customers to leave reviews any way you like. Since we’re focusing on ranking on Google, reviews submitted there will likely be the most important ones.Things to remember: Don’t buy reviews, don’t offer something in exchange for reviews, and try to reply to reviews as often as possible. (Here are Google’s guidelines for managing reviews.)RecommendationGoogle can help with that by allowing you to create a special link you can share to request a review on Google. That’s about it for optimizing for Google Map Pack. Let’s move on to a slightly more complex topic of optimizing for organic results, i.e., the results below the map pack. 2. Optimize for organic resultsTo stand a chance of ranking in the organic search results, you need pages with content relevant to a given search query. The more useful, interesting, and well-linked that content is, the higher your chances are. That’s what we’re going to focus on going forward. List your services SEO or not, you need to provide visitors with a list of services that you offer and also share where you offer your services. Some of the services will have a considerable search demand; others potentially not. Later on, we will expand on that using keyword research.So for example, say you’re specialized in entertainment law, including a number of areas like talent contracts, music law, and publishing. The absolute minimum here is to create a page that explains your expertise in entertainment law and mentions the above specialities.However, a more effective tactic is to create a content hub where the pillar page talks about your expertise in entertainment law in general and, at the same time, links to subpages dedicated to each area of that type of law you cover. This page is an example of a content hub (aka topic cluster). We have the general information on entertainment law (there’s more of it on the page below that part) and links to relevant areas on the left. Each link leads to a page dedicated to an area.And here are some results:This content hub brings over 1K organic traffic each month.Some of the keywords that the hub ranks for. A good scenario if you’re an entertainment lawyer in N.Y.C.In short, here are some benefits of the content hub approach:More topical authority – Interlinks from related content build semantic relationships, which may be a signal of authoritativeness of the topic for Google (learn more).More link authority – Pages linked in a hub benefit from each other’s backlinks.A user-friendly way to navigate your website – Information is just a click away. More perceived value – People often see such hubs as a valuable resource on the topic (which may also increase the propensity to link to your hub).An additional idea worth considering is creating separate hubs for practice areas and industries. This way, you will increase the number of keywords you can rank for while providing a clear structure for the user. Example of listing showing both practiced law areas and served industries.Sidenote. According to JurisPage, an agency specializing in legal marketing, long-form content works best for service pages. So when building your hubs, consider filing them with informative and engaging content. List your locationsThe goal here is to help Google index your website for keywords with local search intent. Some will be explicit. It’s when the searcher uses a location modifier like “new york entertainment lawyer.” Some are implicit, i.e., when there is no location modifier, but Google still thinks there’s local search intent (“bakery” will show you bakeries in your area). So here is a tactic that will save you time spent on creating a ton of pages for each location and save you from duplicate content issues:You can create a page (for example, one called “Contact”) with at least each location’s exact address (including the state/region), phone number, and email (if the email addresses vary). Include your locations in the footer. So if you have multiple locations, you can just mention the name of the region and city and link them to the page with the locations’ details. If you want to provide more specific information related to the locations, such as practicing lawyers, you can create subpages for each location. Reminder: make sure to list all of your physical locations in Google Profile Manager. Example of locations listed on a contact page.Example of locations listed inside the footer. All of them link to pages with more information.Sidenote. To Google, N.Y.C. is the same as New York. D.C. is, in this context, the same as Washington D.C. So you don’t need to list all of the popular abbreviations of cities or regions.Do keyword researchUp to this point, we’ve got ideas on what to create content about from the lawyer’s perspective. Now let’s look at the searcher’s perspective. From the perspective of a searcher, a keyword is a word or phrase that they type in Google to find things like local products or services. This means that for us, keywords will become the topics of our content, blog posts, landing pages, etc., and/or things worth mentioning in our content. More importantly, they will be the drivers of organic search traffic. Here are some keyword research ideas for lawyers. Expand your services by analyzing other ranking pages For this, you will need a keyword research tool like Ahrefs’ Keywords Explorer. Go to the tool, type in a seed keyword like “corporate law,” and go to Related terms. The tool will show you keywords that other pages rank for and talk about while ranking for your seed keyword.You can toggle between Also rank for and Also talk about reports or show them all at once. Choose Top 10 or Top 100 to limit or broaden your search.So for example, it may be worth targeting these keywords: Look up specific competitors’ keywords Some of your competitors will already be ahead of the SEO game, targeting lucrative keywords with their content. But that shouldn’t stop you from ranking for the same keywords (and even outranking the competition). There are two methods for analyzing your competition in this scope. The first one is done by plugging in your competitor’s domain in Ahrefs’ Site Explorer set to “subdomains.” This will show all of the keywords your competitor ranks for. For a more manageable keyword list, you can also plug in a specific page’s URL (like the blog or practice areas) and/or use filters to display keywords by criteria like search volume, traffic potential, or keyword difficulty. Filtering the results to keywords ranking at 1-20 gives you a more manageable list.In the second method, you can look up a few competitors in one go. Go to the Content Gap report in Site Explorer, plug in your competitors, and leave the last input file open.This will show you keywords where at least one of your competitors ranks in the top 10. To increase the relevancy of the results, you can uncheck the “1 target” intersection.If you already have a live website, you can also insert your domain to see the keywords that your competitors rank for but you do not. For this, use the last input field for your domain. Look even further If you want to uncover more opportunities for driving organic search traffic, spend some more time in Keywords Explorer and browse through:Google autosuggestions. Common questions. Topics your competitors blog about. For example, we can take our Also rank for report and make it show only keywords with questions by including words like “why,” “how,” “when,” etc., in the Include filter.This way, we can uncover common questions related to areas of law like the one below. Note that the first five search results belong to law firms; it’s not uncommon to see law firms attracting visitors through education. An important skill in keyword research is choosing and prioritizing keywords. To see how it’s done step by step, read this: Keyword Research: The Beginner’s Guide by Ahrefs. Create optimized pages Now that we know what to create content about, it’s time to learn how to create that content. So in this section, we’ll focus on optimizing the so-called on-page SEO factors: Things that you can include on your page or inside its HTML to improve its ranking and visibility on the SERPs.Align with search intent Search intent refers to the reason behind the search. It’s one of the strongest ranking factors.The search intent of any given search query can be identified by looking at the SERPs and determining three things: Content type – Is the domination type a blog post, landing page, video, or free tool?Content format – Common formats include how-to guides, list posts, opinion pieces, definition posts, etc.Content angle – The unique selling point of the results, e.g., “in 2022” or “for beginners.” For example, judging from the top-ranking pages and the “People Also Ask” box for “emancipation in new york,” it seems that Google thinks people want to know what that is. So the best way to align with search intent is through an article that explains what emancipation is and maybe even explains the processes behind it. To become proficient in optimizing for search intent, see our guide: What Is Search Intent? A Complete Guide for Beginners. Create quality and up-to-date contentGoogle is getting better and better at understanding quality content. To give you a quick overview of its SEO guidelines, you should make your content:Easy to read – When writing about the law, you probably won’t be able to avoid jargon. But you can still explain it sufficiently and use simple sentences everyone (actually, even a 9-year-old) can understand. Clearly organized – Break text into sections with descriptive headings. Up to date – Crucial in law-related topics. Unique – You can take cues from the best-performing content but try to provide some unique value to your readers at the same time. For example, you can provide a unique content angle or include educational materials like an infographic. This is also the part where you want to consider adding link bait. Focused on providing essential information to solve a searcher’s problem – Longer content doesn’t mean that it’s of higher quality. Aligned with E-A-T guidelines – More on that in the next section. Further readingSEO Copywriting: 12 Easy Tips for Better Content and Higher Rankings How to Create Content That’s “Better” Than Your Competitor’s Demonstrate E-A-T E-A-T- stands for expertise, authoritativeness, and trustworthiness. It’s a concept taken from a guideline that Google Quality Raters (humans) use to help engineers improve Google’s algorithm. It means that Google wants to promote pages that demonstrate E-A-T, and it’s getting better at it.E-A-T bears the most importance for YMYL topics (Your Money or Your Life). Surely, law is one of them. Besides the quite obvious things like keeping your content accurate and up to date and citing your sources where necessary, flashing your credentials can be helpful too.So create an About page introducing you and other lawyers in your firm and demonstrate why people should trust you. Mention things like education, bar admissions, affiliations, awards, etc. Flashing credentials is not bragging. If you’re an accomplished lawyer, people (and Google) will find you more trustworthy.Then make sure each article that you publish mentions the author and links to their About page. Two other tactics that may help you with demonstrating your expertise, authoritativeness, and trustworthiness are:Using schema markup on pages where you introduce the lawyers – Schema markup is a simple code that helps Google better understand your content. You can learn how to apply it with this guide.Getting links from authoritative sources – I’ll explain some link building tactics later on in the article. Recommended reading: What Is EAT? Why It’s Important for SEO Optimize page titles and meta descriptions Page titles and meta descriptions are important because the searchers can see them on the SERPs, and this can impact what they click on. Additionally, page titles are considered a “small ranking factor.” Here’s what to take into account when crafting a page title: Make the title eye-catching and accurate – Write a line that piques users’ interest and accurately describes what’s unique about your content/offer. Insert the target keyword in your title – Make it sound natural to the reader. For your homepage title, make sure to include your company’s name. Fit within 60 characters And here’s what’s important for meta descriptions: Make it compelling but not clickbaity Fit within 920 px – You can use a tool like SERPSim to help you with that. Synchronize the description with the title – The description can be an extension of or support what you claim in the title.Further readingHow to Craft the Perfect SEO Title Tag (Our 4-Step Process) How to Write the Perfect Meta Description Use short and descriptive URLsURLs are another “small” ranking factor. And you should optimize the URL with the user in mind. This means:Keep it short – Don’t use an overly nested structure. URLs should be an indication of the user’s location on a website. Make it human-readable – Use a few words that describe the page. Don’t use cryptic signs. Get an SSL certificate – This will show users that the connection is secure and private; they will see “HTTPS” at the beginning of your domain as a sign of secure connection in the browser. It’s also a lightweight ranking signal.Here’s an example of a user-friendly URL that checks the above boxes. It comes from a subpage on art law—part of a content hub on entertainment law. https://www.romanolaw.com/entertainment/art-law/Recommended reading: How to Create SEO-Friendly URLs (Step-by-Step) Add internal links Internal links are the links to other pages on your website. You need them for a few reasons. They can: Provide a crawl path to target pages Boost other pages you own – This means they pass link equity. So pages that tend to get a lot of links can help other pages (where building links is harder) rank higher (see the “middleman” method).Help Google understand what the page is about – This is possible with the internal links’ anchor texts. Help users navigate your website The content creation phase is the best time to include internal links. The three places you should consider when adding internal links are:Your money pages, i.e., the pages that describe your services or help visitors contact you. But don’t force it; add them when it’s a natural next step for the user. Other relevant articles on the topic. Related articles. To find internal linking opportunities, you can use search operators in Google. Use the site: operator together with a search term in quotation marks, like this: Another way is to use the Link opportunities report in Ahrefs’ Site Audit. It focuses on the 10 best keywords for each page on your website and looks for mentions of those terms on your other pages. You can find the report in the menu on the left in Site Audit.Sample results from the Link opportunities report in Site Audit.Recommended reading: Here’s Why You Should Prioritize Internal Linking in 2022 Optimize images Optimizing images for SEO is about these three things: Compressing image file size – You can use a plugin like ShortPixel or a bulk image optimizer like Kraken. This will help your website load faster and load speed counts for SEO (as shown in this case study). Using descriptive image file namesUse descriptive alt texts – Together with file names, they help Google understand the context of your page. In addition, alt texts help visually impaired users. Using a person’s name inside the file name of their portrait—a good practice spotted at wilmerhale.com.Translate your content (for multilingual regions) International law firms and lawyers working in multilingual regions who provide services in multiple languages should consider looking into translating their content. They should do so for at least the pages they want to rank for multilingual phrases, e.g., homepage, services, locations, and contact page. Here’s why:Content in the same language as the search query is likely more relevant to that query. It helps with link building outreach in the same language. Translated content will be more accessible to the group of people speaking that language. Canadian lawyer’s website with content in English and French ranking for a keyword in French.Multilingual SEO involves many details and technicalities, so let me point you to our guide on the topic: Multilingual SEO: Translation and Marketing Guide.That concludes dealing with on-page factors. Now we can move to off-page factors, i.e., factors that occur outside the website. Build links Links from other websites are one of the most impactful ranking factors. The more good quality backlinks you have, the higher you can rank in the organic results.You can get backlinks in two ways:Earn them organically through link-worthy content on your site Build them through link building methods (what I’ll be explaining in this section of the article) Sidenote. According to some SEOs, all backlinks can help you rank both in Google’s map pack and organic results. This actually makes sense if you read into the hints that Google gives us on how it determines local ranking:Generally speaking, to improve your local rankings, prioritize those link opportunities that are at the same time contextually relevant, are locally relevant, and come from authoritative sources. With all that out of the way, let’s look at some ideas on how lawyers and law firms can build relevant backlinks. Publish press releasesFollowing an important case, it’s a good idea to issue a press release and distribute it online. Depending on the type of the case, it can gain interest from international, national, and local magazines alike. One example of this is the Johnny Depp and Amber Heard case led by Camille Vasquez and Benjamin Chew from Brown Rudnick. As you can see below, that case earned that law firm follow links from 213 quality domains. Some are local, and some are national/international. Quite frankly, that case has gained so much worldwide attention that the law firm probably doesn’t have to issue a PR note. I bet there are some unlinked mentions that can be turned into links, so that number may be even higher.Some other ideas for press releases include:New hires.Mergers.Important company statements.Look for newsjacking opportunitiesAlso called “reactive PR,” this technique is about providing reliable information on current events. This requires regular monitoring of what’s happening in the world or your local area related to your law specialization. Here are two ways to do this and remain sane. You can:Hire someone, e.g., a local PR agency. Use a web monitoring tool like Google Alerts. If you’re an Ahrefs user, you can also use the Mentions tool. This alert setup will send daily emails about new content mentioning the words “startup” and “law” in English-language websites with a DR of at least 40. As a lawyer offering law services tailored for startups, you can pitch your expert opinion when some news about this topic comes up.Link from your publications, teaching, or public speaking events Lawyers often have the opportunity to teach at universities and present lectures at conferences. Oftentimes, this will come with the possibility of including a link in the lecturer’s bio. It’s a great opportunity to earn a link from a domain with high authority (strong backlink profile) and local relevance, as in the example below. Go after guest blogging opportunitiesGuest blogging is a common link building practice. Yet the availability of opportunities varies depending on the topic. Below is an example guest post on TechCrunch about the legal issues with the startup credo “move fast and break things” that links back to the law firm of the authors. Here’s how you can find and vet guest blogging opportunities using Ahrefs’ Content Explorer. You can:Type in law AND (“guest article” OR “guest post”) in the search bar. This will search our database for the word “law” and at least one of the two phrases “guest article” or “guest post.”Set the website traffic filter to “From 500” to filter out new websites and websites with potentially low quality. Turn on the “Only live” filter to weed out broken pages. Use the “One page per domain” option because we only want a single result from any website. Here’s an example find. Note that you can instantly see metrics of each page, which can help you vet prospects. Answer journalist requestsServices like HARO, ResponseSource, and SourceBottle allow you to track journalist requests for expert commentary on legal matters (or from a legal perspective). If your commentary appears in a newspaper or magazine, you benefit twofold: You earn a link and increase awareness of your law firm. All you need to do is to sign up for their services, subscribe to topics that interest you, and wait for an email with the latest request. If something piques your interest, answer as soon as possible. Additionally, you can follow the #journorequest hashtag on Twitter.https://twitter.com/LucyInTheSky22/status/1470443283713298434?ref_src=twsrc%5EtfwIf you can, prioritize local news and magazines because those links will have local relevance that can help you rank for keywords with local intent. Local rankings Here’s the last thing on our menu: local rankings published by local magazines, blogs, or review sites.Not to be confused with local listings and directories featured at the beginning of the article. While “local rankings link building” is a sound tactic for any local business to pursue, I haven’t seen many of those opportunities in the law niche. Still, if that kind of opportunity knocks on your door, give it serious consideration. Just remember to evaluate it in terms of contextual relevance, local relevance, and authority. Local ranking of lawyers in New York.That concludes the link building section. If you want to learn more about link building, see our detailed guides: Link Building for SEO: The Beginner’s Guide 9 Easy Local Link Building Tactics How to Get Backlinks: 15 Proven Tactics Next stop: how to stay on top of technical SEO and SEO tracking. 3. Keep your site healthyThe “SEO health” of your website can impact your rankings or prevent you from showing up on Google’s. Here, we’re stepping into the territory of technical SEO: optimizing your website to help search engines find, crawl, understand, and index your pages. Fortunately, there are tools for that.Tl;dr: The easiest way to keep your website’s SEO health in shape is to get a tool like Site Audit and fix any error it reports (also available for free in Ahrefs Webmaster Tools). Looking into technical SEO issues is not something that will consume a lot of your time on a regular basis. Once you make sure your site is crawlable and indexable and fix any errors or warnings that may already be occurring on your site (e.g., broken links, slow page loading), it’s a matter of occasionally checking on the report. Example email technical SEO report from Site Audit.For a deeper dive into the subject of technical SEO, check these out:The Beginner’s Guide to Technical SEO How to Complete a Technical SEO Audit in 8 Steps 4. Track your SEO progress Tracking your progress “manually” on Google is not reliable because Google personalizes results based on factors like search history, device, and current location. Here are some tools you can use instead. Starting from Google Business Profile, Google allows you to track a set of performance metrics for free within the service. For example, you can see queries people used to find your profile, the number of direction requests, or the number of people who viewed the profile. You’ll also need a tool to track your Google Map Pack performance, e.g., the freemium Grid My Business or Local Falcon. If you want to track all of your keyword rankings, try a tool like Ahrefs’ Rank Tracker. It lets you track up to 10,000 keyword rankings for “regular” organic search by country, state, city, and even ZIP/postal code.Recommended reading: 10 SEO Metrics That Actually Matter (And 4 That Don’t) Final thoughts While SEO can bring you traffic that you don’t need to pay for, it’s worth noting that this marketing tactic takes time and effort. The more competitive the keywords you try to rank for, the more time it can take you to rank for them. The first steps will probably be the hardest, so it may not be the best idea to bet everything on SEO just yet. But once you get the process up and running, you can use the same techniques over and over again for consistent results with compounding effects. If you’re looking a specific SEO tutorial for your specialization, check out these guides:SEO for Bankruptcy LawyersSEO for Family LawSEO for Immigration LawyersSEO for Personal Injury LawyersGot questions? Ping me on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Mateusz Makosiewicz Marketing researcher and educator at Ahrefs. Mateusz has over 10 years of experience in marketing gained in agencies, SaaS and hardware businesses. When not writing, he's composing music or enjoying long walks. Keep Learning What is an H1 Tag? SEO Best Practices The H1 tag is an HTML heading that's most commonly used to mark up a web page title. SXO Explained: How to Adapt to the New Era of Search SXO focuses on making a brand discoverable along all touchpoints in modern search journeys, no matter where they start or what path they take. How Long Does SEO Take to Show Results? We polled both our Twitter and LinkedIn pages to find out. HARO: Is It Alternatives You’re Looking For? We surveyed HARO users to find the best replacement for HARO. Here are the results. How to Create Great Content for Search Great content is based on the needs of the people. It must be useful, in-depth, and created by an expert—not an SEO.",
  "headers": [
    {
      "level": "H1",
      "text": "SEO for Lawyers & Law Firms: The Complete Guide"
    },
    {
      "level": "H2",
      "text": "1. Optimize for Google Map Pack"
    },
    {
      "level": "H3",
      "text": "Get and optimize your Google Business Profile"
    },
    {
      "level": "H3",
      "text": "Get listed on local citation sites and directories"
    },
    {
      "level": "H3",
      "text": "Encourage your clients to leave reviews"
    },
    {
      "level": "H2",
      "text": "2. Optimize for organic results"
    },
    {
      "level": "H3",
      "text": "List your services"
    },
    {
      "level": "H3",
      "text": "List your locations"
    },
    {
      "level": "H3",
      "text": "Do keyword research"
    },
    {
      "level": "H4",
      "text": "Expand your services by analyzing other ranking pages"
    },
    {
      "level": "H4",
      "text": "Look up specific competitors’ keywords"
    },
    {
      "level": "H4",
      "text": "Look even further"
    },
    {
      "level": "H3",
      "text": "Create optimized pages"
    },
    {
      "level": "H4",
      "text": "Align with search intent"
    },
    {
      "level": "H4",
      "text": "Create quality and up-to-date content"
    },
    {
      "level": "H4",
      "text": "Demonstrate E-A-T"
    },
    {
      "level": "H4",
      "text": "Optimize page titles and meta descriptions"
    },
    {
      "level": "H4",
      "text": "Use short and descriptive URLs"
    },
    {
      "level": "H4",
      "text": "Add internal links"
    },
    {
      "level": "H4",
      "text": "Optimize images"
    },
    {
      "level": "H4",
      "text": "Translate your content (for multilingual regions)"
    },
    {
      "level": "H3",
      "text": "Build links"
    },
    {
      "level": "H4",
      "text": "Publish press releases"
    },
    {
      "level": "H4",
      "text": "Look for newsjacking opportunities"
    },
    {
      "level": "H4",
      "text": "Link from your publications, teaching, or public speaking events"
    },
    {
      "level": "H4",
      "text": "Go after guest blogging opportunities"
    },
    {
      "level": "H4",
      "text": "Answer journalist requests"
    },
    {
      "level": "H4",
      "text": "Local rankings"
    },
    {
      "level": "H2",
      "text": "3. Keep your site healthy"
    },
    {
      "level": "H2",
      "text": "4. Track your SEO progress"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Mateusz Makosiewicz"
}