{
  "url": "https://ahrefs.com/blog/seo-for-mergers-acquisitions/",
  "slug": "seo-for-mergers-acquisitions",
  "title": "The Role of SEO in Mergers and Acquisitions",
  "description": "SEOs have a lot to offer companies during the merger and acquisition (M&A) process. Here's how they can help.",
  "content": "Patrick Stox Patrick Stox is a Product Advisor, Technical SEO, & Brand Ambassador at Ahrefs. He was the lead author for the SEO chapter of the 2021 Web Almanac and a reviewer for the 2022 SEO chapter. He also co-wrote the SEO Book For Beginners by Ahrefs and was the Technical Review Editor for The Art of SEO 4th Edition. He’s an organizer for several groups including the Raleigh SEO Meetup (the most successful SEO Meetup in the US), the Beer and SEO Meetup, the Raleigh SEO Conference, runs a Technical SEO Slack group, and is a moderator for /r/TechSEO on Reddit. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents SEOs have a lot to offer companies during the merger and acquisition (M&A) process. They can help identify acquisition targets, do due diligence and help with valuation and risk identification, identify future opportunities, work with teams on website migrations, monitor migration progress, and train new teams in best practices.Acquisitions can have a dramatic impact on your search visibility. Long ago, one of the main competitors of an engineering company I was working with shut down. I asked about acquiring their website and managed to get it for a few hundred dollars. Needless to say, this led to a significant amount of new leads and business growth as we merged the two websites.Another time, I managed to snag the expired domain of what was the number one HVAC company in my local market. They were consolidating several service companies into one new brand and they let the domain expire. I redirected this to the website of a client who was fairly new in the market, and they saw top rankings for many of their main terms practically overnight.While this type of acquisition isn’t common for small companies, it is business as usual for larger companies. If you’ve done enterprise SEO, you might have helped with a few of these mergers and acquisitions.Large companies acquire lots of other companies. Many companies have dedicated Wikipedia pages that tell you about all their acquisitions. For example, Alphabet (Google’s parent company) has a list of 257 acquired companies.Let’s look at how SEOs can help with mergers and acquisitions.ContentsIdentifying acquisition targets SEOs can help identify acquisition targets. While companies are generally looking at the bigger picture, organic search traffic is often a main component of revenue for companies, and SEOs have the data to see the competitive landscape.If you know a main player or two in the market, you can start with the Organic Competitors report in Site Explorer. You can also compare between two dates to see how the market is evolving.If you’re not sure who the main players are, what you can do is paste a list of terms into Keywords Explorer and check out the Traffic share by domain report. This will give you an organic search share of voice for the terms you entered.The SEO team will also be able to see how the content and targeting of different acquisition targets fit in with your current content strategy. They may have targeted terms or markets they want to break into, and acquiring a property that is already ranking for those things or in that market is an easy way to rank for those things.There are checks SEOs can run before they get to the due diligence process to decide who they might want to move forward with. SEOs can look if traffic is declining or if a website has a history of issues with search engine updates. These pose substantial risks that could impact valuation. See our post on diagnosing traffic drops for more details.In addition, SEOs can forecast the future traffic performance for each of these sites to see who might have the most potential. See my post on SEO forecasting to see how to do this.You can also check the link profile of the possible acquisition targets. Good links can help you rank better, while bad links pose a risk. From a link building perspective, an acquisition can be a relatively cheap source of links. You can scan through the links to a site in the Backlinks report.Due diligence and valuationOnce you enter a period of exclusivity, where companies are now only negotiating with each other, it’s time to take a more in-depth look and do due diligence.SEOs will evaluate the target company’s online presence and SEO strategies. Many of the things we looked at before, like traffic, rankings, backlinks, forecasts, etc., will all be looked at. Any positive or negative items can be noted to help determine the value, potential, and risks of a website.One additional report you may want to look at is the Opportunities report. You can go through this to see what kind of potential a website has to rank better.Companies may have more than one domain, so you might have to check a few different websites during this process.To merge or not to mergeWhether you choose to merge domains usually comes down to whether you want more listings or one listing that potentially ranks higher. This can depend a lot on your current rankings and the resources you have available to maintain your web presence. Or you may have a company policy that says it needs to merge.Many news sites choose to run the websites on separate domains. Both sites can show in Google News and in organic search results multiple times for the same stories or affiliate content targeting the same terms.Businesses will often run the websites separately for a while but tend to merge the websites eventually. You may see this happen in several stages:The acquired company adds a tag of “a xxx company” on the current domain.The acquired domain is migrated to the main company’s domain with the same branding.The acquired company is rebranded and more integrated with the product or offering of the main company.Check out our guide on website migrations to see what it takes to migrate a site successfully.Some of the main things that can cause traffic loss during migrations are failing to do redirects and killing off content. I’ll show you how to check these in the next section.You also need to make sure that you support older branded names in some way. Sometimes these terms are still used by people in the market for many years, and you don’t want to lose this valuable search traffic to another website that may rank instead of your own!You’ll also want to make sure your TLS certificate (what allows HTTPs to work) will work across domains. If not, users may get an error and not be forwarded to the new site, even if you have a redirect in place.Post-acquisition monitoring and trainingThe easiest way to check for any major drops is to create a Portfolio with the old domain and the new path or pages on the site. Then you can use the Site Explorer Overview report to look for any major traffic drops and use the compare mode in any of the other reports, like Organic Keywords, to zero in on where traffic may have been lost.Depending on the setup, you may be able to just add the old domain as a competitor in the overview report to see how the migration went.You’ll want to check the old URLs to make sure redirects were done, and all the content was migrated successfully.To get a list of your most linked URLs, you can use the Best by links report in Site Explorer.You can upload that list as a custom list in Site Audit in the URL sources tab. Alternatively, you could just select Backlinks as the source in this tab. I would remove any other crawl sources for this use case.We’ll then crawl all the URLs with links. In Page Explorer, you can customize the table to include things like Redirect URL, Redirect status code, Final redirect URL, and Final redirect status code to get an easy view of all the redirects that are happening.Make sure your redirects are 301 or 308 rather than 302 or 307 status codes if you are doing a permanent move and want URLs indexed on the new website instead of the old one.You should monitor the renewal of the old domains as well. You wouldn’t want a competitor registering them or for the site to be repurposed into something more nefarious.SEOs can also help with the transfer of knowledge and best practices between companies. There are lots of different ways they can facilitate this. See this section for some ideas.Final thoughtsEven if you weren’t involved in the original migration process, you probably should check behind some of the main company acquisitions to see if any value was left on the table. Look for redirects not done, content not migrated, etc. In my experience, there’s a lot of value to be had cleaning up after these old acquisitions.If you have questions, message me on X or LinkedIn. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Patrick Stox Patrick Stox is a Product Advisor, Technical SEO, & Brand Ambassador at Ahrefs. He was the lead author for the SEO chapter of the 2021 Web Almanac and a reviewer for the 2022 SEO chapter. He also co-wrote the SEO Book For Beginners by Ahrefs and was the Technical Review Editor for The Art of SEO 4th Edition. He’s an organizer for several groups including the Raleigh SEO Meetup (the most successful SEO Meetup in the US), the Beer and SEO Meetup, the Raleigh SEO Conference, runs a Technical SEO Slack group, and is a moderator for /r/TechSEO on Reddit. Keep Learning Steal Our SEO Report Template (Inspired by SEO Experts) Not sure how to create the perfect SEO report? Steal our SEO report template and make it even better as we go through it slide by slide. Is Wix Good for SEO? Here’s Everything to Know About Wix SEO Whether you have a Wix site or are still deciding on a CMS, it's important to know how Wix can impact your SEO. How to Use Yoast SEO to Improve SEO Yoast SEO is a popular WordPress plugin that helps you optimize blog posts for SEO. Learn more about how it works and its key features. Continuous SEO: Can You “Complete” SEO? Can you really “complete” SEO, or should it be continuous? We'll answer that, plus share tips for implementing a continuous SEO strategy. Quick SEO: 8 Ways to Accelerate SEO Results From Months to Days Think all SEO progress is slow as molasses? Think again.",
  "headers": [
    {
      "level": "H1",
      "text": "The Role of SEO in Mergers and Acquisitions"
    },
    {
      "level": "H2",
      "text": "Identifying acquisition targets"
    },
    {
      "level": "H2",
      "text": "Due diligence and valuation"
    },
    {
      "level": "H2",
      "text": "To merge or not to merge"
    },
    {
      "level": "H2",
      "text": "Post-acquisition monitoring and training"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Patrick Stox"
}