{
  "url": "https://ahrefs.com/blog/seo-conferences-roundup/",
  "slug": "seo-conferences-roundup",
  "title": "7 SEO Conferences to Attend in 2024",
  "description": "These SEO conferences are rife with networking and learning opportunities to grow your business or marketing career.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents We’ve attended dozens of SEO conferences and some aren’t all they’re cracked up to be. Here are the ones we think are worth attending in 2024.ConferenceWhenLocationWTSFest USASep. 19, 2024Philadelphia, USBrightonSEOOct. 3 & 4, 2024Brighton, UKTech SEO ConnectOct. 17 & 18, 20224Raleigh, NC, USAAhrefs Evolve ⭐️Oct. 24 & 25SingaporeInternational Search SummitNov. 14, 2024Barcelona, SpainBrightonSEO (US edition)Nov. 19 & 20, 2024San Diego, USChiang Mai SEO ConferenceNov 22 & 23Chiang Mai, ThailandKnow a great SEO conference?Let us know about it by filling in this form. 🙂Contents1. WTSFest USA Location: Philadelphia, USPrices: From USD399Date: Sep. 19Website: WTSFest PhiladelphiaSpeakers: Krystal Taing (Uberall), Purna Virji (LinkedIn), Celeste Gonzalez (RicketyRoo)That’s right, Areej AbuAli is bringing WTSFest stateside in 2024! Same as WTSFest Berlin, you’ll be treated to talks across four tracks—analyze, advance, innovate, and empower.Some notable topics include:From Guidelines to Growth: Unleashing the Potential of E-E-A-T (Bianca Anderson)Make Inclusion the Default: Tips to Make Your Content Inclusive (Purna Virji)Unleashing Your Authentic Self to Skyrocket Your Career (Heather Hamilton)2. BrightonSEO, UKLocation: Brighton, UK. Prices: From £200 (plus VAT)Dates: Oct. 3 & 4 (UK). Website: BrightonSEOSpeakers: Miracle Inameti-Archibong (John Lewis), Sujata Ghosh (Dyson), Vayda Okpa (Eleos)It’s no surprise that BrightonSEO made our list: The biannual conference is well-loved by SEOs and marketers of all levels, ourselves included.Yesterday at brightonSEO: @timsoulo on the elusive ROI of content marketing 💥 pic.twitter.com/yklH72aLh8— Ahrefs (@ahrefs) October 7, 2022 Here are some standout topics you may like at the October event:Digital PR & link building in financial services (Shelley Appiah)From clicks to conversions: unlocking the power of faceted navigation for ecommerce success (Naomi Francis-Parker)How to use diversity of thought to grow your marketing (SEO) team (Desmond Boateng)3. Tech SEO ConnectLocation: Raleigh, NC, USAPrices: $499 USDDate: Oct. 17 & 18Website: Tech SEO ConnectSpeakers: Paul Shapiro (Uber), Aleyda Solis (Orianti), Mike King (iPullRank), Kristin Tynski (Fractl), Noah Learner (Sterling Sky), Sam Torres (Gray Dot Company), Rick Viscomi (Google), Dan Hinckley (Agital), Jori Ford (FoodBoss), Lazarina Stoy (MLforSEO)The conference made for technical SEOs, by technical SEOs. Organized by JR Oakes, Mike King, Patrick Stox, and Matthew Kay, Tech SEO Connect is a two-day event entirely dedicated to helping you learn more about technical SEO and connect with like-minded peers from across the world.4. Ahrefs Evolve ⭐️Location: SingaporePrices: From $570 USDDate: Oct. 24 & 25Website: Ahrefs EvolveSpeakers: Aleyda Solis (Orainti), Andy Chadwick (Keyword Insights), Cyrus Shepard (Zyppy), Tim Soulo (Ahrefs), Patrick Stox (Ahrefs), Sam Oh (Ahrefs)2024 marks the launch of our first ever fully-fledged SEO and digital marketing conference: Ahrefs Evolve. Taking place in Singapore in October 2024, the conference features two days of tactical talks and panel discussions from 20 speakers.There will also be expert workshops on topics ranging from technical SEO to content strategy, led by industry leaders and Ahrefs specialists.Check out our amazing venue below.https://www.youtube.com/watch?v=a-dGwMxSqMU5. International Search Summit (ISS)Location: Barcelona, SpainPrices: From €100Date: Nov. 14Website: International Search Summit (ISS)Speakers: Azeem Ahman (Azeem Digital), Crystal Carter (Wix), Kayleigh Dibble (Hotjar)Managing international websites and running global campaigns is tricky business. That’s exactly what ISS has built its conference around: how to position your brand in global markets.https://www.youtube.com/watch?v=Dramsr5OBGQ&t=47sIts 2024 agenda isn’t out yet, but if this year’s edition was any indication, you can expect talks across three tracks—international SEO, international content, and audience & paid.Tickets include networking drinks and six months’ access to Webcertain’s self-learning platform.6. BrightonSEO, USLocation: San Diego, USPrices: From USD420 (US)Dates: Nov. 19 & 20 (US)Website: BrightonSEO San DiegoSpeakers: Andy Crestodina (Orbit Media), Greg Gifford (SearchLab), Brie E Anderson (BEAST Analytics), Rand Fishkin (Sparktoro), Wil Reynolds (Seer Interactive)BrightonSEO is back for its second year in the US, and there are already some pretty impressive speakers and talks announced.Here are just a few notable ones:Link Wars: The SEO Awakens (Amanda Jordan)Topical authority in the age of Entity SEO (Felipe Bazon)Retain your brand voice with AI-generated content (Jasmine Glasheen)7. Chiang Mai SEO ConferenceLocation: Chiang Mai, ThailandPrices: From 597USDDates: Nov. 18 - 23Website: Chiang Mai SEO ConferenceSpeakers: Nick Eubanks (From The Future), Kyle Roof (Internet Marketing Gold), Georgia Tan (Prosperity Media), Tim Soulo (Ahrefs)The well-loved Chiang Mai SEO Conference is an annual gathering of over 800 SEO entrepreneurs, agency owners, and super affiliates.After a two-year hiatus, the conference returned to the idyllic Thai city in 2023, and has confirmed a 2024 edition—with three days of workshops leading up to the two-day conference.Unfortunately, tickets sold out for this one long ago! 🙁 Here’s a teaser in case you got lucky: Chiang Mai SEO Conference 2023 After-Movie98.3% of CMSEO2024 Tickets were sold instantly (without even releasing a line up).Here’s why… pic.twitter.com/U0Wo5tZ15R— Matt Diggity (@mattdiggityseo) December 4, 2023 Did we miss any SEO conferences?Let us know about it by filling in this form. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Joshua Hardwick Contributors Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). ContributorsKeep Learning WordPress SEO: 20 Tips and Best Practices WordPress makes it easy to use SEO best practices. Improve your site's SEO with the tips in this guide. Brighton SEO Live Blog Follow along for talk takeaways, tips, and try-hard witty remarks. SEO Copywriting: What It Is & How to Do It SEO copywriting is creating high-quality content that appeals to search engine algorithms and human users. Learn how to do it well.",
  "headers": [
    {
      "level": "H1",
      "text": "7 SEO Conferences to Attend in 2024"
    },
    {
      "level": "H2",
      "text": "1. WTSFest USA"
    },
    {
      "level": "H2",
      "text": "2. BrightonSEO, UK"
    },
    {
      "level": "H2",
      "text": "3. Tech SEO Connect"
    },
    {
      "level": "H2",
      "text": "4. Ahrefs Evolve ⭐️"
    },
    {
      "level": "H2",
      "text": "5. International Search Summit (ISS)"
    },
    {
      "level": "H2",
      "text": "6. BrightonSEO, US"
    },
    {
      "level": "H2",
      "text": "7. Chiang Mai SEO Conference"
    },
    {
      "level": "H2",
      "text": "Did we miss any SEO conferences?"
    }
  ],
  "author": "Joshua Hardwick, Rebecca Liew"
}