{
  "url": "https://ahrefs.com/blog/seo-marketing-strategy/",
  "slug": "seo-marketing-strategy",
  "title": "How to Fit SEO Into Your Marketing Strategy",
  "description": "Making all your marketing channels work together properly is essential for long-term success. Learn how to do it with organic traffic.",
  "content": "Jamie Grant Jamie is an in-house SEO from the U.K., having previously spent over four years working agency-side. Jamie particularly enjoys the technical side and relishes a high-scale content campaign. When taking a break from canonical tags and hreflang, he’ll most likely be obsessing over the latest football match or F1 Grand Prix. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents As digital marketing specialists, it’s easy to “have the blinkers on” and focus solely on the channel or channels nearest to your heart.In my case, this is SEO. Having worked with several businesses and top brands over the past few years, I’ve learned that some specialists and marketing generalists are:Cannibalizing efforts between channels.Undervaluing organic search as a channel.Failing to align SEO with other disciplines effectively.In this guide, I’ll explain why you should include SEO in your marketing strategy. I’ll also explain how you can align SEO with other disciplines—from PPC to brand building.ContentsHow SEO helps you achieve strategic marketing objectivesGetting the “buy-in” for SEO investment can be tricky. In some businesses, this can lead to SEO being underutilized through a lack of investment and implementation. Here are four reasons why SEO should receive the focus it deserves.You don’t have to pay per clickSEO is seen by many as an “always on” channel. It can take substantial investment to get going and some patience to see a return. However, once you build up your rankings, you’ll receive traffic essentially for “free” (no additional cost per click).With SEO, a drop in spending won’t lead to losing all your traffic overnight. Paid advertising, on the other hand, is seen as a tap because you can switch the spending (and subsequently the traffic you receive) on and off.Organic traffic is relatively sustainableIn SEO, you have to be in it for the long game. Unless you hold the brand authority of Wikipedia or Amazon, it’s hard to gain quality traffic overnight. Once you build up your rankings through a solid SEO strategy, the rewards are often here to stay without the need for continuous spending and reinvestment. This makes SEO more like a waterfall than a tap.Building a sustainable stream of high-quality organic traffic to your website could be the difference between your business surviving or not surviving economic uncertainties. In challenging financial periods such as recessions, marketing budgets often get slashed, leaving channels like PPC stranded. With solid SEO foundations, however, you’ll continue to acquire users organically, even if you decide to tighten your budget for a short while.That said, I don’t recommend making cuts to SEO budgets. Continuing your SEO efforts will ensure you are in the best position to steal an edge over your competitors.SEO is targetedResults served via organic search are inherently relevant to the query that is searched for by the user. This means you are serving your users a piece of content they want to see through organic search. The algorithm isn’t always 100% perfect, but it’s fair to say that Google does a great job ranking relevant organic search results.The keyword also tells us a lot of information about what the user is looking to find. This allows us to target potential customers looking for our product or service.Let’s say, for example, you run an online shop selling discounted football kits. Among several other search terms, you’ll be very interested in attracting potential customers searching for “cheap football kits.”From this search term alone, we know that the users who search for this keyword want what we sell. Using Ahrefs’ Keywords Explorer, we can also see that the keyword “cheap football kits” attracts 6,300 searches per month (globally).Alternative channels, on the other hand, are a lot less straightforward. In paid search, there are instances where Google may place your result for unwanted search terms.From 2018, targeting paid keywords via “exact match” means you will appear for other search terms that Google decides have the “same meaning” as the targeted term. Therefore, “exact match” targeting isn’t really an exact match anymore. And it gets worse with broader targeting options.Ability to target users at various stages in the funnelIn SEO, you’re not just limited to targeting users at one stage of the marketing funnel. The ability to target potential customers through informational blog content and transactional product/service-focused landing pages is what makes SEO both exciting and lucrative.People use Google regularly to search for:Answers to questions (informational search).Solutions to problems (informational or transactional search).Products or services (transactional search).A specific website (navigational search).SEOs can target all of the above by creating different types of content to suit the users’ needs determined by the keywords they are searching for.Let’s say, for example, I run an online store selling kayaks. Here’s how we can target customers at various funnel stages through different types of content. For keywords such as “how to store a kayak” and “what size kayak do I need,” we are best suited to rank for these queries by providing dedicated informational content. Sure, the user may not be in a position to purchase a kayak right away. But now that we’ve helped them out, they may come back to us when they are ready to make a purchase.For users searching “kayaks for sale,” we know from the search term that they are potentially looking to make a purchase right away. In this case, a product page best suits their needs, allowing users to make a swift purchase. Don’t fall into the trap of assuming the type of content based on the query alone, though. Remember that Google is a bot, and your idea of a page that meets the users’ needs and Google’s idea could be completely different.This is why you should always manually check Google’s search results to confirm the best page type (or page template) that Google likes to serve for your targeted keyword.Using Ahrefs’ Keywords Explorer, simply enter your keyword and scroll down to the “SERP overview” to see what kind of pages are ranking. This method is great for seeing the search results alongside useful backlink and keyword data. Aligning SEO with other disciplinesSpecialists can be guilty of becoming isolated from other channels. Often, you’ll hear debates about one discipline versus another, such as SEO vs. PPC. The reality is that having multiple strong-performing channels is vital for business success, and there’s often more opportunity to align than most specialists realize.SEO and brand building/traditional advertisingTraditional advertising, such as TV, radio, and billboard advertising, can create a lot of search demand. How often within a TV advert are we prompted to “search” for a brand name or a product? The SEO team can ensure you are maximizing “SERP real estate” by being an entity in the Knowledge Graph and targeting search features such as People Also Ask. Furthermore, the SEO team can ensure all applicable content is up to date and well optimized.Another area where the SEO department can help out traditional marketers is by using organic search to assist in market share calculations. Calculating market share is tricky, and the SEO team can help you calculate it through a metric called “share of search.”At the EffWorks Global 2020 event hosted by IPA (a U.K. trade body), effectiveness guru Les Binet shared how he was experimenting with “share of search” to predict market share “sometimes up to a year ahead.” Les described the metric as a fast and predictive measure for short- and long-term ad effects. This metric looks specifically at branded, organic search volume data. To calculate your “share of search,” you divide the total search volume of your brand against the total search volume of all brands in your niche (including your own).For example, I’ve taken five popular U.S. donut brands and put them into Ahrefs’ Keywords Explorer.We can see that Dunkin Donuts is by far and away the most popular, with a 69% market share across these five brands (8.3 million/12 million).Of course, there are more than five big donut brands in the U.S. The more expansive you go with your list, the more accurate your calculation will be.SEO and paid searchBoth SEO and paid search teams work with keywords a lot. This provides the perfect opportunity for sharing resources, particularly those keyword research files that often take hours to compile. But it’s not just about the keyword data. Sharing analytics data between teams is also useful, such as click-through rates, conversion rates, and other metrics.As highlighted earlier in this article, PPC is instant, whereas SEO requires more of a “runway” to achieve results. This is the exact reason that these two teams should align on strategy. Let’s say you have identified some top new keywords to target and want to gain traffic via these keywords right away. While you wait for your optimized content to be crawled by Google, to mature, and to subsequently rank, the PPC team can immediately acquire traffic for these keywords.Once you are through the “SEO runway” and generating organic traffic for these keywords, the PPC team may then consider moving the spending to alternative keywords to generate organic traffic.A common question is, “Should PPC target keywords that already perform well in SEO?” There is no right or wrong answer to this question, as all approaches have pros and cons.By targeting the same keywords through SEO and PPC, you are holding two results competing against each other. Many believe this is a good thing, as it leads to more SERP “real estate,” which ultimately leads to more clicks overall. That said, you will inevitably be paying for some clicks you would have already received for free through the organic result. This leads to a drop in organic traffic for the respective keywords.Jamie’s verdictI always review this on a case-by-case basis. More often than not, my recommendation is not to target the same keywords through both SEO and PPC. It’s impossible to rank in position #1 organically for all relevant keywords to your business. So I find it more effective to avoid the overlap and ensure PPC teams are using their budget to target keywords that are yet to rank or are underperforming in SEO. That said, if certain keywords are critical to a business, then there is certainly a business case to go for “SERP dominance” and target through both SEO and PPC.Successful PPC campaigns can also indirectly have a positive impact on SEO. Backlinks are a key ranking factor in SEO. The more visibility your content receives, the more likely people are to link to your site. In the video below, Ahrefs’ Sam Oh explains how PPC advertising can help build those all-important links.https://www.youtube.com/watch?v=Uz2bGhdnJN0SEO and UXSEOs and user experience teams have been prone to the odd fallout over strategy. In modern SEO, however, the two teams should be more aligned than ever.Shady tactics that game the algorithm and offer a poor experience no longer work in SEO. Google’s algorithm is now much more advanced and looks to reward high-quality websites that provide a good experience to their users.There are several user experience factors that influence SEO. Mobile optimization is one of the more prominent examples.Most web users now use a mobile device instead of a desktop or tablet. This is reflected in Google’s algorithm, with mobile usability being an important ranking factor. Google will also predominantly crawl the mobile version of your website.Another UX optimization, which is also a ranking signal in SEO, is page speed.Page speed, albeit more of a minor ranking signal, is used in the algorithm and is more important than ever in SEO following the introduction of Core Web Vitals as a ranking factor in 2021. Core Web Vitals focus on three key metrics that have a big impact on the experience of the user. Largest Contentful Paint (loading), First Input Delay (interactivity), and Cumulative Layout Shift (visual stability).Both Core Web Vitals and mobile friendliness fall under Google’s “Page Experience” set of ranking signals. This also includes site security via SSL certification (HTTPS over HTTP) and not displaying intrusive interstitials (pop-ups).A third key optimization used in both UX and SEO is site structure. Ensuring your content is organized and internally linked helps users and bots discover your content.Keen to hear more about the importance of site structure for both UX and SEO? Be sure to check out our Michal Pecánek’s guide to website structure.Bonus tipBreadcrumbs are great for user experience. They allow users (and bots) to navigate through the site’s structure easily.Breadcrumb linking is an aspect of internal linking that is undervalued. Breadcrumb links are highly effective at passing PageRank due to their prominent on-page location.SEO and PRPublic relations (PR) can have a significant influence on SEO performance. So much so that SEOs have formed digital PR (DPR or sometimes “SEO PR”), a spin-off of traditional PR designed to focus on the areas that benefit SEO the most. While similar to traditional PR, DPR is more focused on building backlinks and growing brand awareness through online publications.Link building is one of three key pillars in SEO. What sets DPR link building apart from the rest is that you build links from authoritative publications in a natural, “white hat,” and high-quality way.https://twitter.com/JohnMu/status/1352967238442229762SEOs, PRs, or DPRs can align with traditional PR teams by sharing media lists (often journalist contacts) and data. This allows for more efficiency as they work toward their respective goals.Bonus tipBe aware that PR experts can be territorial when it comes to outreach, but this is perfectly understandable. Let’s put ourselves in their shoes. They won’t want us to dive in and ruin relationships they have spent a lot of time building.So how can we go about this? My colleague, Charlotte Crowther, who is the digital PR manager at Kaizen, shares her top three tips to ease this situation:Remind traditional PRs of the shared interests – Although we may have slightly different KPIs, we are working toward the same goal: getting the best coverage for our business.Give them more of an understanding of our process – Being transparent about processes can help ease concerns. Despite having PR in the name, DPRs approach things quite differently from traditional PRs.Set out the rules from the very beginning – Starting the relationship with strong communication from the very beginning will help create any required workarounds, avoiding potential bumps in the road at every turn caused by a lack of communication.Here’s an example of how you can build natural, high-quality backlinks through exciting digital PR campaigns.At Kaizen, we worked with the folks at the startup, DirectlyApply. They tasked us with a link building campaign amid the COVID-19 pandemic.Enter Susan, the future of the remote worker. Susan is a shocking 3D model of a remote worker’s appearance after staying at home for 25 years.Susan was the talk of the U.K., with several media outlets talking about the physical impacts of working from home. The campaign resulted in over 200 backlinks and over 400 pieces of coverage.Image from the Overview report, via Ahrefs’ Site Explorer.Not only did this campaign generate those all-important backlinks, but it also drove huge traction on social media. Susan generated over 60,000 shares, raising brand awareness even further.SEO and social mediaYou might assume that SEO and social media teams have little in common. But there are tons of ways these teams should work together.Social media is a great way to get eyes on your site, whether it be traditional social media sites (such as Twitter, Instagram, and Facebook) or video marketing sites (such as YouTube and TikTok). Similarly to all channels, the more people we have reading our content, the more likely we will naturally build relevant backlinks.Social media is great for generating that initial “buzz” around new content and directing traffic to our pages. Rand Fishkin calls this the “spike of hope.” After a short while, however, this excitement wanes and clicks dry up, leading to the “flatline of nope.”This isn’t necessarily a bad thing. It’s how social media marketing works. You focus on one piece of content and move on to the next exciting piece of content quickly.That’s precisely why these two channels should be working together to avoid the “spike of hope, flatline of nope” scenario. The social media team is on hand to deliver that instant boost in traffic for new content. Then the SEO team is on hand to provide consistent traffic.Not all content intended for SEO will instantly be guaranteed success on socials. Campaigns led by DPRs, however, are often exciting, engaging, and shareable. Keeping DPRs involved in this relationship is beneficial for social media teams, as they can boost these campaigns through social media and reformat future content for social channels.Looking to acquire traffic through Google Discover? In Michal’s blog on this topic, he discusses the correlation between posts that get traction on social media and those that perform well on Google Discover.In a quirky social media test, JR Oakes encouraged his followers to engage in a low-quality post, receiving over 100 retweets, 50+ likes, and many replies. The result? JR’s article indeed landed in Google Discover.Correlation does not equal causation, of course. That said, there’s no harm in giving your SEO content that extra boost through social media.Final thoughtsWe’ve seen how SEO can interact and work with other marketing channels and how important strong alignment is in today’s omnichannel marketing world.It’s important to remember that all channels are working toward driving growth for your business. So working together well will bring out the best in each channel for optimal growth.Key takeaways:Align your SEO efforts with your strategic objectivesUse “share of search” as a predictive metric to calculate market shareLean on PPC and social media to generate traffic during the “SEO runway” periodSEO and UX teams have a lot more in common in modern timesEnsure traditional PR and DPR teams are on the same pageHave any questions? Ping me on Twitter and let me know. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Keep Learning B2B Marketing: The Beginner’s Guide B2B marketing (short for business-to-business marketing) is the process of promoting products or services to another business or organization. 7 Best Marketing Newsletters (Most Voted For) We asked over 20,000 marketers to vote for their favorite marketing newsletters. These are the newsletters that received the most votes. 10 Lead Generation Tactics That Work (With Examples) Learn 10 different lead generation tactics that you can use as part of your lead generation strategy. How to Rank Higher on Google (10 Steps) Improve your Google rankings in 10 easy steps to get more organic traffic to your website. Content Pruning: Why It Works, and How to Do It Featuring 3 practical content pruning case studies.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Fit SEO Into Your Marketing Strategy"
    },
    {
      "level": "H2",
      "text": "How SEO helps you achieve strategic marketing objectives"
    },
    {
      "level": "H3",
      "text": "You don’t have to pay per click"
    },
    {
      "level": "H3",
      "text": "Organic traffic is relatively sustainable"
    },
    {
      "level": "H3",
      "text": "SEO is targeted"
    },
    {
      "level": "H3",
      "text": "Ability to target users at various stages in the funnel"
    },
    {
      "level": "H2",
      "text": "Aligning SEO with other disciplines"
    },
    {
      "level": "H3",
      "text": "SEO and brand building/traditional advertising"
    },
    {
      "level": "H3",
      "text": "SEO and paid search"
    },
    {
      "level": "H3",
      "text": "SEO and UX"
    },
    {
      "level": "H3",
      "text": "SEO and PR"
    },
    {
      "level": "H3",
      "text": "SEO and social media"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Jamie Grant"
}