{
  "url": "https://ahrefs.com/blog/seo-toolbar-revamp/",
  "slug": "seo-toolbar-revamp",
  "title": "The Ahrefs SEO Toolbar (3.0.1): A big revamp",
  "description": "Now, most of the toolbar’s features live inside its own process, making it a lot more stable. Here's what changed, and what's new.",
  "content": "Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Recently, we crossed 100k users for the Ahrefs SEO Toolbar in Chrome. This was a lovely coincidence since we’d just rolled out a new version of the toolbar – it felt almost like a reward. Here’s a look at this major revamp of our browser plugin.Previously, all the features in the Ahrefs SEO Toolbar were built into the pages themselves. This caused conflicts at times – many websites have unique codes and styles, and it was impossible to account for them all.Now, most of the toolbar’s features live inside its own process, making it a lot more stable.What changedBefore, clicking on the extension icon toggled the toolbar on and off while on pages. Now, it opens a pop-up window showing available reports and settings instead. For Ahrefs subscribers, the bar on pages also now only contains SEO metrics.We added keyboard shortcuts to toggle the metrics bar on/off, as well as to open on-page reports.For MacCmd+Ctr+A – Toggles page metrics barCmd+Ctr+S – Opens the reportsFor WinAlt+A – Toggles page metrics barAlt+S – Opens the reportsYou can edit these default shortcuts by opening the extension and selecting “Edit hotkeys”.What’s newSee all outbound links found on a pageClick on “Links” to see all outgoing links on a page presented in table format. You can filter for followed, nofollowed, UGC, and sponsored links.We’ve also added an additional filter for internal and external outgoing links.Find and highlight various types of links (including broken ones)Click on “Check status” to find redirected or broken outgoing links.Once checked, you can filter for redirecting and broken links. Select “Highlight on page” to directly highlight the links on the page itself.You can also export the list of outgoing links with their attributes as a .csv file.–That’s it for today!We’re always working on improving the toolbar and adding new features, both for Ahrefs subscribers and for those who don’t have a subscription yet.Give us a follow on our product YouTube channel and Twitter to know when we next roll out updates. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs.",
  "headers": [
    {
      "level": "H1",
      "text": "The Ahrefs SEO Toolbar (3.0.1): A big revamp"
    },
    {
      "level": "H3",
      "text": "What changed"
    },
    {
      "level": "H3",
      "text": "What’s new"
    },
    {
      "level": "H4",
      "text": "See all outbound links found on a page"
    },
    {
      "level": "H4",
      "text": "Find and highlight various types of links (including broken ones)"
    }
  ],
  "author": "Rebekah Bek"
}