{
  "url": "https://ahrefs.com/blog/seo-mental-models/",
  "slug": "seo-mental-models",
  "title": "SEOs, Are You Using These 6 Mental Models?",
  "description": "People use mental models to comprehend reality, solve problems, and make decisions in everyday life. They're extremely helpful in SEO.",
  "content": "Mateusz Makosiewicz Marketing researcher and educator at Ahrefs. Mateusz has over 10 years of experience in marketing gained in agencies, SaaS and hardware businesses. When not writing, he's composing music or enjoying long walks. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents People use mental models to comprehend reality, solve problems, and make decisions in everyday life. SEO is not an exception here, yet it’s not a topic you often hear about in this industry.The thing is, you need to be careful with mental models because they’re sneaky. We tend to develop them during our lives, inherit them from our colleagues and mentors, and rely on them almost instinctively while not fully aware of their influence or the existence of better alternatives.So, let’s talk about mental models you will find helpful in your SEO work and the ones you should approach with caution.Contents3 helpful mental modelsIn the noisy, uncertain world of SEO, these will be your north star.1. First principles thinkingFirst principles thinking is a problem-solving approach that involves breaking down complex problems into their most basic elements and reassembling them from the ground up.It’s about asking oneself what is absolutely true about a situation and then reasoning up from there to create new solutions.Using first principles thinking to rearrange the same building blocks into a brand new shape. Uncertainty is a chronic condition in SEO. And it is so by design because the whole industry is based on Google’s secrets. Access to the truth is extremely limited. We got to the point that we got used to accepting speculation and theories on SEO so much that we started to crave them.This is where the first principles come in. Whenever you need a brand new solution for a problem or when you feel that you’ve gone too far into speculation, come back to the first principles — things that have the best chance to be true in this industry. For example:Conventional wisdom is that higher volume is better, but the first principle of blogging is reaching qualified people and influencing sales. So, it’s better to target specific high-intent low-volume keywords and than irrelevant high-volume keywords.The first principle of SEO content is distribution via the organic search channel. That’s why it’s so hard to promote it on other channels like social media — better to let go.Google aims to provide the best possible experience by delivering the most relevant and high-quality content. Yet, some people ignore this first principle, try to game the system, and lose everything almost overnight when the system catches up.2. Pareto principleThe Pareto Principle (aka the 80/20 rule) is about a disproportionate relationship between inputs and outputs, effort and results, or causes and effects. A small number of causes (20%) often leads to a large number of effects (80%).The 80/20 rule: 80% of results come from 20% of the projects.This concept was named after Vilfredo Pareto, an Italian economist who, in 1906, noticed that 80% of Italy’s land was owned by 20% of the population.If we use this principle as a mental model in decision-making, we’ll find it easier to prioritize work. It’s ok to ignore some things because they likely won’t matter that much. The result that you’re after will come from focusing on the things that will likely have the biggest impact, and not from spreading yourself too thin.For example, if you want to build links to your site, pitch your best content. That can be the content that has already proven to earn links in the past.Or if you need to recover some of that lost traffic, home in on the pages that lost the most traffic.The key is to treat the 80/20 as an approximation, a heuristic, and not take the numbers literally. To illustrate, roughly 80% of our site’s traffic comes from no more than 6% of pages.But on the other hand, if we try to find the top 20% pages that contribute to the traffic the most, we’ll find that they bring not 80% but 96.8% traffic. However you look at it, the idea still holds — a small amount of causes led to a large portion of effects.3. Red Queen Theory“It takes all the running you can do, to keep in the same place.”Sounds very much like SEO already, doesn’t it?This quote comes from Lewis Carroll’s “Through the Looking-Glass,” and it’s how the Red Queen explains to Alice the nature of her kingdom, where it requires constant effort just to maintain one’s current position.It was used to name an evolutionary biology theory which posits that each species must adapt and evolve not just for incremental gains but for survival, as their competitors are also evolving. Sorry, we’re in an endless race.SEO is like a road with no finish line—the race continues forever.You can probably already guess how this applies to SEO — rankings. If you want to maintain high rankings, you can’t stop improving your pages. There will always be enough competitors to challenge your position.But in our world, pressure comes from competitors and the environment. Google keeps evolving too, pushing the bar for content higher, making elements that used to give you an edge a standard.I’m sure we’ve all been there - even our top backlink-earning, top traffic-generating, most time-consuming content gets pushed down. But if you keep optimizing, you get a chance to come back to the top.This mental model is another way of saying that SEO works best as an always-on strategy without a set end date or final goal.3 mental models to watch out forIt’s not so much about avoiding them but being able to spot them when they happen or could happen.1. Local maximaA local maximum (aka local optimum) refers to a solution that is the best solution within a neighboring set of solutions, but not necessarily the best possible solution overall (global optimum).So if you’re feeling that you’re spending immense effort just to make marginal improvements, you have to be willing to assume that you’ve hit a local maxima. Then, the question to ask is: what can I do differently?Here’s an example.Until November last year, traffic to our site was a series of local optima. Our content marketing was delivering the results, but the growth was relatively slow. Obviously, we were doing the same tried and tested stuff. But then we launched two programmatic SEO projects that instantly elevated us to a level we’d have to work years for — look how fast the yellow line grew (pages) and how that corresponded with the orange line (traffic).2. Sunk cost fallacyThe sunk cost fallacy is a cognitive bias that occurs when people continue to do something as a result of previously invested resources (time, money, effort) despite new evidence suggesting that the current path will not lead to a beneficial outcome.Sunk cost in action: the more you invest in something, the more attached to it you become.We all know SEO is a long-term game, right? Strategies like these are crowded with long-term projects with big time and money investments. Sometimes, despite the investments, you just can’t go beyond a certain level of traffic, backlinks, etc.Now, this mental model, this voice in your head, will tell you to keep going down the same path no matter what. Loss aversion kicks in, acting like a defense mechanism for your past selves and actions. And the more aggressive and blind the “hustle” culture is at one’s team, the harder it is to see clearly.But, overall, it could be better for you and the company to let it go and focus on something else. You can even come back to it later with a fresh mind. But continuing something just because you’ve been doing it for some time is a losing strategy.Example. Despite several attempts and time counted in years, Ahrefs doesn’t rank for “seo”.Sad but true. And from our point of view, it’s frustrating. Almost like we’re the only ones not to get invited to the party, the only ones not to graduate from high school… you get the idea.But not ranking for “SEO” hasn’t hindered our growth, so it’s better to cut losses and deal with unfulfilled ambition than to let that goal hold us back from other projects (like that programmatic project mentioned above).3. Confirmation biasConfirmation bias is the tendency to give more attention and weight to data that support one’s own beliefs, while simultaneously dismissing or underestimating evidence that contradicts those beliefs.We’re all guilty of this. It’s human nature. And it’s not exclusively a bad thing. I mean, in some situations, this tendency can keep us on “the bright side” and help us go through tough times or keep our motivation up.So, I think that it’s not something to get out of your system completely. Just be mindful of situations where this can negatively affect your judgment:Selective evidence in ranking factors. You see a page ranking high, and you think it’s because of an aspect you strongly believe in, disregarding all of the evidence against it (e.g., long-form content, social signals).Bias in keyword selection. Your keyword selection runs along the lines of your beliefs about the audience preferences without substantial evidence to back up these beliefs.Bias in strategy development. After developing a new strategy, you encounter a talk or an article advocating a similar approach, which immediately reinforces your confidence in this strategy.Focus on confirmatory data during audits. During a content audit, you find a small piece of data that confirms your belief. As a result, you may prioritize minor findings over more significant but less personally affirming data.Overconfidence in familiar tactics. Leaning on SEO tactics that have worked in the past, you develop a sense of overconfidence in them. You resist trying anything new or the idea that a dip in performance comes from an unfamiliar factor.Keep learningIf you like what you’re reading, I think you will find other mental models fascinating:Mental Models: The Best Way to Make Intelligent Decisions (~100 Models Explained)5 Mental Models for Content Marketers5 More Mental Models for Content MarketersCorey Haines on X: “A collection of mental models, frameworks, and principles you can use for marketingWant to share models you find useful? Ping me on X or LinkedIn. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Mateusz Makosiewicz Marketing researcher and educator at Ahrefs. Mateusz has over 10 years of experience in marketing gained in agencies, SaaS and hardware businesses. When not writing, he's composing music or enjoying long walks. Keep Learning 4 Best Facebook Groups for SEOs (Most Voted For) These are the SEO Facebook groups that received the most votes from 12,200 SEOs. Google’s Quality Raters Guidelines Demystified for SEOs Google’s quality guidelines tell quality raters exactly how to evaluate a search result. 34 Free SEO Tools for DIY SEOs Looking for free SEO tools? These are the 36 that you need. Accessibility for SEOs: How to Comply With ADA & WCAG Website accessibility isn't always top of mind for SEOs. But in light of some updated regulations, it's a good time to take note and comply. How SEOs Make the Web Better SEOs catch flak for ruining the web, but they play a crucial role in the search ecosystem, and actually make the internet better for everyone.",
  "headers": [
    {
      "level": "H1",
      "text": "SEOs, Are You Using These 6 Mental Models?"
    },
    {
      "level": "H2",
      "text": "3 helpful mental models"
    },
    {
      "level": "H3",
      "text": "1. First principles thinking"
    },
    {
      "level": "H3",
      "text": "2. Pareto principle"
    },
    {
      "level": "H3",
      "text": "3. Red Queen Theory"
    },
    {
      "level": "H2",
      "text": "3 mental models to watch out for"
    },
    {
      "level": "H3",
      "text": "1. Local maxima"
    },
    {
      "level": "H3",
      "text": "2. Sunk cost fallacy"
    },
    {
      "level": "H3",
      "text": "3. Confirmation bias"
    },
    {
      "level": "H2",
      "text": "Keep learning"
    }
  ],
  "author": "Mateusz Makosiewicz"
}