{
  "url": "https://ahrefs.com/blog/seo-meetups/",
  "slug": "seo-meetups",
  "title": "12 SEO Meetups You Should Have On Your Radar",
  "description": "Discover a dozen meetups to find new friends or even land new SEO clients.",
  "content": "Chris Haines Chris is an SEO director who has 10 years of experience in SEO, agency side. When not involved in SEO, he enjoys messing around with vintage synthesizers, walks on sandy beaches, and a good cup of tea. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Want to meet other people interested in SEO offline? Give an SEO meetup a go.In my experience, it’s one of the best ways to meet like-minded people and provides a more relaxed, informal setting than a bustling SEO conference. Who knows—you could make new friends at a meetup or even land new SEO clients.But with so many events worldwide, it’s impossible to mention them all. So, here are some of the most talked-about SEO meet-ups I think you should have on your radar.ContentsSubmit your meetupWant to add your SEO meetup to this list? Add it here, or let me know on LinkedIn.1. Ahrefs MeetupsOrganizers: AhrefsLocation: London, Brighton, SingaporeNext event: Check for next eventOkay—so I may be a little biased, but I wanted to start by sharing our Ahrefs’ SEO Events. We’ve run five Beer and Snacks Meetups in Singapore. We’ve also hosted an SEO Workshop and Networking meetup the day before BrightonSEO, and we just launched our London Meetup.Tickets to the London Meetup sold out in a day and a half—it was our fastest-selling ticketed event ever.Tim Soulo, Joshua Hardwick, and Ryan Law will speak at our inaugural event, covering topics such as improving your rankings, competitor research, and content marketing. To stay informed about our next event, follow our events page.Sidenote.Missed our meetups but still want to catch up with the Ahrefs team and a host of world-class speakers? Get Ahrefs Evolve tickets ✨2. LondonSEO MeetupOrganizers: Blue ArrayLocation: London, UKCheck for the next eventThe LondonSEO Meetup hosts an evening of networking with industry peers and leading experts featuring SEO speakers like Itamar Blauer, Steph Hugman, Reina Hanada, and many more.The bigger XL event has even hosted prolific search engine news chronicler Barry Schwartz in 2023.3. Search LondonOrganizers: Jo Juliana Turnbull, Tim SheedLocation: London, UKCheck for next eventWith over 2,800 members, Search London is a popular meetup that has been around for over a decade. Events are organized every 8-12 weeks, and members are from a mixture of agency, client-side, and start-up businesses.The meet-up is open to anyone in SEO, PPC, or social media—and offers marketing professionals and first-time speakers a safe, supportive space to share their industry knowledge and experiences. Search London also has an online edition and a Barcelona edition as well.4. Search ‘n StuffOrganizers: Yagmur SimsekLocation: London, UKCheck for the next eventSearch ‘n Stuff meetups are an energetic and all-embracing community tailored to empower digital marketers, startups, in-house teams, and professionals. Expect sharings centered on strategies, campaigns, and other relevant SEO topics.5. Neurodivergents in SEOOrganizers: Sarah Chaya PreschLocation: Brighton SEO (UK and US)Check for the next eventNeurodivergents in SEO provide a safe space for neurodivergent SEOs to network and learn.The group holds in-person meetups at BrightonSEO, both in the UK and the US, and monthly pub quizzes with great prizes.If you’re an SEO or marketer and identify as neurodivergent, you’re more than welcome to join the community. You can do so by signing up here.6. Search Norwich Organizers: CandourLocation: Norwich, UKCheck for the next eventSearch Norwich launched in 2018 as a free marketing meetup event. It often features top industry speakers who share their knowledge, tips, and advice with the search marketing community. At Search Norwich there are no sales agendas, fluff, or pitches—just valuable insights.7. SEOFOMOOrganizers: Aleyda SolisLocation: VariousCheck for the next eventThe SEOFOMO meetups are run by SEO superstar Aleyda Solis, who is a well-known SEO speaker and founder of SEO consultancy Orainti. She’ll also be the headline speaker for our first Ahrefs Evolve Conference.SEOFOMO is a laid-back, free event perfect for learning, connecting, and sharing with other SEOs.8. SEO MastermindOrganizers: Jeroen Stikkelorum Location: Various (Mainly Netherlands and Belgium)Check for the next eventSEO Mastermind is a supportive, free, and friendly SEO community where you can grow your skills, meet like-minded people, and get answers to all your organic marketing questions.SEO Mastermind meets around eight times a year, mainly in the Netherlands and Belgium—but they also occasionally have meetups in other locations, for instance, at Brighton SEO and ISS Barcelona.Organizer Jeroen Stikkelorum told me that SEO Mastermind is on a mission to build the most valuable Dutch-spoken SEO and organic marketing community in The Netherlands and Belgium. So if you’re local, give it a go.9. SEO Lager FestOrganizers: Anirudh AgarwalLocation: West Bengal, IndiaCheck for the next eventSEO Lager Fest is a fun SEO meetup that (apart from drinking) enables you to network with like-minded folks in the SEO industry. They hold an SEO quiz, run case study competitions, do AMAs, and even do SEO charades.10. SEOnerdSwitzerlandOrganizers: Sara Moccand-Sayegh and Isaline MuelhauserLocation: Zurich, Switzerland, and onlineCheck for the next eventSEOnerdSwitzerland is a volunteer-run association that organizes events for SEOs in Switzerland and beyond.Dedicated to fair opportunities and diversity, they provide training and coaching for people wanting to break through as a public speaker in the SEO industry.SEOnerdSwitzerland also offers training and coaching for speakers, aiming for a diverse and inclusive panel.11. WebSchronaOrganizers: Alexander AußermayrLocation: Salzburg, AustriaCheck for the next eventWebSchrona is a free monthly meetup for SEO and online marketing professionals in Salzburg, Austria. They meet every second Thursday at 6 p.m.There’s no fixed agenda, so discussions are often unplanned and spontaneous and often involve a drink of some description.Organizer Alexander Außermayr tells me that everyone is welcome to join their SEO meetups. The aim is to provide a regular, uncomplicated meetup in an open space—often a beer garden, if the weather is good.12. SEO BeneluxOrganizers: Mathias NoyezLocation: Various: Amsterdam, Netherlands, Antwerp BelgiumCheck for the next eventSEO Benelux started in 2018 as a Facebook community for Dutch and Belgian SEO specialists. The meetup grew into the largest in the Benelux region, with more than 3,000 members.There are four meetups each year, two in Belgium (Ghent and Antwerp) and one in the Netherlands (mostly Amsterdam). Each meetup attracts 70–90 people and features three speakers.Tips for finding new SEO meetupsIf you don’t live in a big city, it may be difficult to find a good meetup, but that doesn’t mean there aren’t any in your local area.Here are my tips to help you find new meetups near you.Tip 1 – Use Google’s advanced search operators to uncover new meetupsAs new meetups pop up all the time and often without notice, it’s worth doing some digging to see what’s out there.You can just do a regular ol’ Google search, but we’re SEOs—so let’s use some advanced search operators and spice it up a bit.In this example, I searched for the phrase “meetup” in the title, plus my location and my favorite SEO tool, and it managed to uncover Tim’s tweet on our London Meetup.This is just a very basic example, and you could use any website or location, but it shows how you can uncover information about new meetups with a little research.Tip 2 - Trigger the Events SERP featureBy searching for events or events near me, you can trigger the Events SERP feature. In the example below, I found a few SEO-related events by prepending “SEO” to the search.Once you’ve triggered the feature, scroll down until you find an SEO meetup that catches your eye.Tip 3 – Use Meetup to find an SEO meetupIf you can’t find anything on Google then it’s a good idea to run a quick check on a specialist community platform.One of the most popular platforms is Meetup. It allows you to find events near your location on any topic.Over the years, I’ve attended a lot of smaller meetups through this website, and they have always been interesting and a place to make new connections.Tip 4 – No SEO meetup in your area? Start your own!I started my own mini-meetup in 2018 on WhatsApp with some former colleagues, imaginatively titled #seodrinks.It started from humble beginnings in a room in a small pub in London, and it’s still in a room in a small pub—somewhere in London. (If you want an invite, let me know on LinkedIn.)We only have semi-regular meetups in London and a small group, but every meetup has to start somewhere.If you want to start your own SEO meetup, platforms like WhatsApp and Telegram are the best free places to start, but if you want a more specialized paid option, you could try Meetup or another similar platform.Final thoughtsYou don’t always have to attend a big SEO conference to meet other amazing people in the industry. Some of the smaller meetups I’ve been to have resulted in making more contacts than the bigger conferences.As such, SEO meet-ups are one of my favorite ways to meet people who are just as interested in SEO and marketing as much as you are.Did I miss an SEO meetup? Add your SEO meetup here, or let me know on LinkedIn. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Chris Haines Chris is an SEO director who has 10 years of experience in SEO, agency side. When not involved in SEO, he enjoys messing around with vintage synthesizers, walks on sandy beaches, and a good cup of tea. Keep Learning Steal Our SEO Report Template (Inspired by SEO Experts) Not sure how to create the perfect SEO report? Steal our SEO report template and make it even better as we go through it slide by slide. Is Wix Good for SEO? Here’s Everything to Know About Wix SEO Whether you have a Wix site or are still deciding on a CMS, it's important to know how Wix can impact your SEO. How to Use Yoast SEO to Improve SEO Yoast SEO is a popular WordPress plugin that helps you optimize blog posts for SEO. Learn more about how it works and its key features. Continuous SEO: Can You “Complete” SEO? Can you really “complete” SEO, or should it be continuous? We'll answer that, plus share tips for implementing a continuous SEO strategy. Quick SEO: 8 Ways to Accelerate SEO Results From Months to Days Think all SEO progress is slow as molasses? Think again.",
  "headers": [
    {
      "level": "H1",
      "text": "12 SEO Meetups You Should Have On Your Radar"
    },
    {
      "level": "H2",
      "text": "1. Ahrefs Meetups"
    },
    {
      "level": "H2",
      "text": "2. LondonSEO Meetup"
    },
    {
      "level": "H2",
      "text": "3. Search London"
    },
    {
      "level": "H2",
      "text": "4. Search ‘n Stuff"
    },
    {
      "level": "H2",
      "text": "5. Neurodivergents in SEO"
    },
    {
      "level": "H2",
      "text": "6. Search Norwich"
    },
    {
      "level": "H2",
      "text": "7. SEOFOMO"
    },
    {
      "level": "H2",
      "text": "8. SEO Mastermind"
    },
    {
      "level": "H2",
      "text": "9. SEO Lager Fest"
    },
    {
      "level": "H2",
      "text": "10. SEOnerdSwitzerland"
    },
    {
      "level": "H2",
      "text": "11. WebSchrona"
    },
    {
      "level": "H2",
      "text": "12. SEO Benelux"
    },
    {
      "level": "H2",
      "text": "Tips for finding new SEO meetups"
    },
    {
      "level": "H3",
      "text": "Tip 1 – Use Google’s advanced search operators to uncover new meetups"
    },
    {
      "level": "H3",
      "text": "Tip 2 - Trigger the Events SERP feature"
    },
    {
      "level": "H3",
      "text": "Tip 3 – Use Meetup to find an SEO meetup"
    },
    {
      "level": "H3",
      "text": "Tip 4 – No SEO meetup in your area? Start your own!"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Chris Haines"
}