{
  "url": "https://ahrefs.com/blog/seo-agency-software/",
  "slug": "seo-agency-software",
  "title": "SEO Agency Software (My Tried and Tested Tools)",
  "description": "I spent 10 years working in SEO agencies. Here are the tools that everyone used.",
  "content": "Chris Haines Chris is an SEO director who has 10 years of experience in SEO, agency side. When not involved in SEO, he enjoys messing around with vintage synthesizers, walks on sandy beaches, and a good cup of tea. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents There’s no shortage of SEO agency software available at the moment. But with so many options to choose from, which tools do SEO agencies rely on to get the job done?In this article, I’ll use my 10 years of SEO agency experience to give you the inside scoop on the most trusted tools SEO agencies use to provide their clients with the best SEO insights.ContentsFor SEO agencies, finding the right tools for the job is often a balancing act. They need to balance the client’s needs against their own agency budget, which is usually determined by the client’s retainer fee.In an ideal situation, every agency would have access to all the best tools, but that’s often just not possible.So here are my tried and tested recommendations:ToolBest forGoogle Search ConsoleMonitoring technical issues, checking indexation in Google searchGoogle AnalyticsMonitoring total website performanceAhrefsAll-in-one SEO toolsetScreaming FrogAuditing your websiteSurfer SEOOptimizing your onsite contentBuzzstreamOutreach CRM toolGoogle TrendsIdentifying search trends in GoogleGoogle ColaboratoryRunning Python scriptsGoogle Page Speed InsightsChecking website performanceGoogle Looker StudioDashboard creation for SEO reportingChatGPTAI tool used to help automate SEO tasksYextLocal SEO optimizationBotifyTechnical analysis, auditing your website’s log filesSEO MonitorCreating SEO forecastsChrome DevToolsInspecting a website’s code1. Google Search Console (GSC)GSC is used by agency SEOs to understand the organic performance of their clients’ websites.It’s the first tool SEO agencies request access to when they start working with a new client.I used GSC in an agency setting to do the following:Viewing the search queries a client’s site shows for, and how often searchers click through from those keywordsGetting a breakdown of websites that link to a client’s siteSeeing if Google can find and crawl the siteFixing indexing problems and requesting reindexing of new or updated contentReceiving alerts when Google finds serious issues on the siteUsing the APIUsing the data to provide SEO reporting for my clientsTipWant to supercharge your GSC reporting? Link your GSC account with Ahrefs to get your GSC performance data on steroids in Ahrefs’ Rank Tracker.The advantage of doing this is that you can easily see winners and losers, low-hanging fruit keywords and potential cannibalization, performance by device, CTR by position, and much more—perfect for including in your next SEO report.Further readingHow to use Google Search Console to Improve SEO (Beginner’s guide)2. Google Analytics (GA)As well as GSC, agencies usually ask for GA access as well when they start working with a client.GA gives you the bigger picture of a client’s website and helps track conversions, leads, and traffic from other channels besides organic.At the agencies I worked at, GA was used for SEO reporting, as well as monitoring the general performance of the website and to inform strategy and direction.Here’s a quick insight into how SEOs at the big agencies are using these tools: “One of the most valuable, but often surprisingly overlooked, areas within Google Analytics is the ‘Search Terms’ report (an equivalent report can be configured in GA4).This report can be particularly valuable when collaborating with ecommerce partners managing thousands of SKUs, as it allows for the identification of rapidly rising search terms and trends at scale, even if the site itself is not ranking for them.In addition to informing SEO optimizations when combined with metrics such as the number of matching products and external demand, this information can help inform buying and merchandising activity and demonstrate the value provided beyond our immediate marketing stakeholders.”Philip Gamble, Head of Performance Experience, ZenithAlternativesAdobe Analytics – Enterprise analytics softwareGA 360 – Enterprise analytics softwareFurther readingHow to Use Google Analytics 4 For Beginners3. AhrefsAhrefs is used by some of the top agencies around the world to get incredible results for their clients. I’ve used it in my agency work from 2014 through my career for everything from backlink analysis and keyword research to technical auditing, competitor analysis, and beyond.So, why do agencies use Ahrefs? The main reason is that they know they are getting access to the best search data on the market.This makes Ahrefs the best tool for analyzing competitors, dissecting their strategies, and outperforming them. Exactly what you want if you are an agency.Here are some of the tools and features that make agencies love Ahrefs:Site ExplorerSite Explorer is a competitor analysis tool that allows you to view any website’s organic search performance over time. It’s the perfect tool to spy on your competitors.The Organic competitors report is a good way to get a bird’s-eye view of your competitors’ search performance. It is a perfect visual for including in a competitor analysis document.Keywords ExplorerKeywords Explorer is a keyword research tool. Agencies often use a tool like this to find new keyword opportunities for their clients.Rank TrackerTracking your Google rankings is a big task if you have multiple clients, so you need a serious solution.That’s where a tool like Rank Tracker can be handy. It enables you to view all of your clients’ keyword rankings all in one place.Rank Tracker can help you monitor several key performance indicators, such as:Share of voiceAverage positionOrganic trafficSERP featuresPositionsSite AuditSite Audit is a tool that audits your whole website to find SEO issues that could be impacting your performance in search engines.Agencies usually suggest starting with an SEO audit of their client’s sites, as this gives them a good idea of the website’s strengths and weaknesses.APIThe Ahrefs APIs allow agencies with more advanced or customized data needs to incorporate Ahrefs data into their reporting and tools. We have three APIs available on our enterprise plan:Ahrefs API v3Rank Tracker APIWeb Explorer API (soon to be released)4. Screaming FrogScreaming Frog is a website crawler. Many agency SEOs cut their teeth using Screaming Frog, as it’s great at providing all the data you need to perform a website audit.The first service that most clients want from an agency is an SEO audit to understand how their website is performing in Google search.I used Screaming Frog in an agency to complete the following tasks:Ad hoc crawling and auditingCustom extraction (mainly for extracting recurring text or HTML patterns)Comparing to other crawl dataProviding mini audits of smaller websitesSome agencies also run Screaming Frog in the cloud to schedule recurring crawls for SEO reporting.AlternativesSitebulb is a powerful alternative to Screaming Frog loved by many agency SEOs. It has both desktop and cloud crawling capabilities.5. Surfer SEOSurfer is one of the newer kids on the SEO software block, but it’s a powerful tool that’s been swiftly adopted by SEO agencies to analyze and improve on-page SEO.In an agency setting, I used Surfer for clients who wanted to optimize their content to make it more search-friendly quickly.AlternativesSurfer is one of the most well-known content optimization software tools, but other tools offer this functionality for enterprise-level websites.Here are my recommendations:FraseClearscopeAhrefs Content Grader (Enterprise plan only)6. BuzzstreamBuzzstream is one of the most respected outreach tools in the industry.It’s the first outreach tool I used in my agency career ten years ago.It covers link prospecting, creating custom email templates, organizing contacts, and managing the outreach process.I’ve used Buzzstream to get links on Buzzfeed, the Guardian, Independent and many hundreds of other high authority sites using just a single copy of Buzzstream.And it’s not just me who used it to acquire links for clients…AlternativesPitchbox is another all-in-one alternative to Buzzstream that agencies use for SEO outreach.7. Google TrendsGoogle Trends is used by agencies to identify seasonal trends. If an agency’s client has a business that depends on seasonal traffic, Google Trends can be a good way to identify trends for particular search terms.Here’s an example of me checking the trend data for a recent emerging popular search…When working agency-side, I used to use Google Trends to understand when people started searching for Halloween and Christmas products. When I tracked the data over multiple years I found that people were generally searching for these seasonal products earlier and earlier each year.With this knowledge, we could let the client know the most likely time for the landing page to be set live.AlternativesYou can use Ahrefs new search volume forecasting feature to spot trends for any keyword directly from Keywords Explorer.8. Google Colaboratory (Colab)Many SEO agencies won’t allow you to run Python scripts from your work computer due to security risks.But using a tool like Google Colab usually circumvents this, meaning you can create your own Python scripts to help automate some aspects of your SEO work.I used Colab to create scripts to automate specific repetitive tasks that my clients requested.There are many scripts you can run in Python. If you need inspiration, I recommend checking out the resources below.Further readingBritney Mueller’s Collab scriptsLee Foot’s Python scriptsJC Chouinard’s Python for SEOAlternativesJupyter Notebook9. Google Page Speed Insights (PSI)Google’s PageSpeed Insights tool analyzes web page performance, providing a 0-100 score and optimization recommendations based on load time, responsiveness, and visual stability metrics.Improving your pages’ load times can help boost user experience on your website. Site speed has been a hot topic for a few years now. Google estimated that for every one-second delay in mobile page load, conversions could fall up to 20%.Tip Want bulk PSI data? You can easily pull bulk PSI data into Ahrefs for your entire website using Site Audit and a PSI API key.To do so, go to Site Audit’s crawl settings for the website you’re auditing and follow the instructions.AlternativesWebpagetest.org - This tool was used by Google in demonstrations at my agencyGTmetrix - Another useful alternative with a nice user interface10. Google Looker Studio (GLS)Google Looker Studio is one of the most commonly used platforms by agencies to provide SEO reporting for their clients. It’s so popular that at Ahrefs, we even built our own connectors for it.GLS allows you to:Aggregate multiple data sets – GA, GSC, and Ahrefs data can be integrated into one dashboardCreate scheduled reports – Schedule PDF reports to be sent to them and other stakeholdersYou can also easily share Ahrefs data with other stakeholders without giving them a separate login.I used GLS extensively in agencies. I used to spend hours building my own custom dashboards, but when Ahrefs released their GLS extension, I realized that using their templates was much more time-efficient—and I haven’t looked back since.AlternativesPower BI - Enterprise data visualizationTableau - Enterprise data visualization11. ChatGPTChatGPT shouldn’t need much of an introduction. It’s been one of the most talked-about AI tools for improving and automating SEO tasks, and we’ve written a lot about it at Ahrefs.One way that agencies are using ChatGPT, apart from number crunching, is to visualize data in interesting ways.Patrick Stox wrote an excellent article on using ChatGPT to visualize data, which covers this topic in detail.AlternativesOf course, you don’t have to use only ChatGPT; you can use any other AI platform or the APIs to create this data at scale.Here are a few other alternatives:PerplexityClaude12. YextIf you need to do local SEO at scale and monitor your brand’s presence online, then you will have probably used Yext.Yext is the tool I used at my agency to monitor the online presence of brands with multiple locations.AlternativesBrightLocal is another highly recommended all-in-one alternative that you can use for local SEO. I didn’t use this at my agency, but have heard great things about it.13. BotifyBotify is a good option if you are working with enterprise SEO clients who have many technical SEO issues on their websites.One of my favorite features of Botify was the ability to analyze log files, which allowed me to see how search engine bots like GoogleBot were really interacting with my client’s websites.AlternativesIf you are working with a smaller website, Botify could be a bit overkill for your needs. If this is the case, it’s worth trying Screaming Frog Log File Analyzer to analyze the log file data.14. SEO MonitorProviding business cases for SEO improvements is never the easiest sell to clients. The best way that I found was to create an SEO forecast.The only problem is that creating an SEO forecast can take a fair amount of time and technical expertise.Tools like SEO Monitor reduce the effort required to create SEO forecasts. If your client requires a business case to make any changes to the site, this will be a good investment.Forecasting and creating business cases are regular parts of the job for agencies working with enterprise clients. Having a dedicated tool that can create forecasts quickly and easily makes life easier.AlternativesPatrick Stox has written an excellent guide on SEO forecasting using first—and third-party—data, which I would heartily recommend reading if you haven’t already.15. Chrome DevToolsFor the more technically inclined agency SEOs, Chrome DevTools is the first place they’ll check to see what’s going on “under the hood.”Understanding Chrome DevTools is a good investment for agency SEO, as it can help you see things from the developer’s perspective.AlternativesAhrefs now has an incredible Page inspect feature built into Site Explorer.Using this tool, you can track HTML changes across any website. This feature didn’t exist when I worked agency-side, but I would definitely be using it now if I were still in an agency. It’s like page inspect on ChromeDevTools but with Wayback Machine-style functionality.You can literally go back in time.And if you’re not confident looking at the code, here are the Chrome extensions I used working in an agency to get a quick view of the state of SEO on my clients’ websites:Ahrefs’ SEO Toolbar – Instant on-page SEO report, broken link checker, redirect tracer, and local search simulatorAyima Redirect Path – The OG of Chrome extensionsRobots Exclusion Checker – Sam Gipson’s Chrome extensionHreflang Tag Checker – A quick way to check your hreflang tagsDetailed – SEO extension created by Glen AllsopLinkclump – Open, copy, or bookmark links at the same timeGrammarly – Proofread and improve your writingWappalyzer – Useful for understanding the tech stack websites useFinal thoughtsSEO agencies use many different types of SEO software to provide SEO services for their clients—rarely is one tool enough.The tools agencies choose are usually determined by their clients’ demands and the agency’s budget. It’s practically impossible to have every single tool, agencies need to know which ones give the most bang for your buck.Got questions? Ping me on X. 🙂 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Chris Haines Chris is an SEO director who has 10 years of experience in SEO, agency side. When not involved in SEO, he enjoys messing around with vintage synthesizers, walks on sandy beaches, and a good cup of tea. Keep Learning 15 Best SEO Plugins for WordPress (Tried & Tested) Looking to rank your WordPress website higher in Google? Start with these 15 SEO plugins. SaaS SEO: The Tried & Tested Guide Here's everything you need to know about building a successful SaaS SEO strategy. 14 Best Free Chrome Extensions for SEOs (Tried & Tested) This handy collection of free Chrome extensions for SEO will help you with everything from keyword research to technical SEO. How to Start a Digital Marketing Agency (Advice From 100+ Founders) I asked 100+ digital marketing agency founders how they started their agencies. Here's how you can too. I Tested Premium AI Prompts To See if They’re Worth It. They’re Not. We spent ~$80 to purchase five premium ChatGPT prompts and ran a blind test to see if they were worth it. Result? No.",
  "headers": [
    {
      "level": "H1",
      "text": "SEO Agency Software (My Tried and Tested Tools)"
    },
    {
      "level": "H2",
      "text": "1. Google Search Console (GSC)"
    },
    {
      "level": "H2",
      "text": "2. Google Analytics (GA)"
    },
    {
      "level": "H3",
      "text": "Alternatives"
    },
    {
      "level": "H2",
      "text": "3. Ahrefs"
    },
    {
      "level": "H3",
      "text": "Site Explorer"
    },
    {
      "level": "H3",
      "text": "Keywords Explorer"
    },
    {
      "level": "H3",
      "text": "Rank Tracker"
    },
    {
      "level": "H3",
      "text": "Site Audit"
    },
    {
      "level": "H3",
      "text": "API"
    },
    {
      "level": "H2",
      "text": "4. Screaming Frog"
    },
    {
      "level": "H3",
      "text": "Alternatives"
    },
    {
      "level": "H2",
      "text": "5. Surfer SEO"
    },
    {
      "level": "H3",
      "text": "Alternatives"
    },
    {
      "level": "H2",
      "text": "6. Buzzstream"
    },
    {
      "level": "H3",
      "text": "Alternatives"
    },
    {
      "level": "H2",
      "text": "7. Google Trends"
    },
    {
      "level": "H3",
      "text": "Alternatives"
    },
    {
      "level": "H2",
      "text": "8. Google Colaboratory (Colab)"
    },
    {
      "level": "H3",
      "text": "Alternatives"
    },
    {
      "level": "H2",
      "text": "9. Google Page Speed Insights (PSI)"
    },
    {
      "level": "H3",
      "text": "Alternatives"
    },
    {
      "level": "H2",
      "text": "10. Google Looker Studio (GLS)"
    },
    {
      "level": "H3",
      "text": "Alternatives"
    },
    {
      "level": "H2",
      "text": "11. ChatGPT"
    },
    {
      "level": "H3",
      "text": "Alternatives"
    },
    {
      "level": "H2",
      "text": "12. Yext"
    },
    {
      "level": "H3",
      "text": "Alternatives"
    },
    {
      "level": "H2",
      "text": "13. Botify"
    },
    {
      "level": "H3",
      "text": "Alternatives"
    },
    {
      "level": "H2",
      "text": "14. SEO Monitor"
    },
    {
      "level": "H3",
      "text": "Alternatives"
    },
    {
      "level": "H2",
      "text": "15. Chrome DevTools"
    },
    {
      "level": "H3",
      "text": "Alternatives"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Chris Haines"
}