{
  "url": "https://ahrefs.com/blog/seo-writing/",
  "slug": "seo-writing",
  "title": "SEO Writing: 8 Steps to Create Search-Optimized Content",
  "description": "SEO writing is the process of writing content to rank on search engines like Google. Here's how to do it.",
  "content": "Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents SEO writing is the process of writing content to rank on search engines like Google.In this guide, you’ll learn how to create search-optimized content your readers and Google will love by following these SEO writing best practices:Find a winning keywordFigure out what searchers wantMake your content uniqueCreate your blog post outlineWrite your draftGet feedback, then edit and polish your draftWrite a compelling title and descriptionAdd internal linksContents1. Find a winning keywordIf no one is searching for the topic you’re writing about, you won’t get search traffic no matter how high you rank.So, the first step to creating SEO content is to do keyword research. Here’s how to get started:Go to Keywords ExplorerEnter a broad term from your nicheGo to Matching termsEyeball the report for keywords that actually make sense for you to target on your website. For example, if I owned an online shop that sells tea, I might target this keyword because searchers are clearly looking for tea recommendations, so I can easily “sell” my product in the content.Further readingKeyword Research: The Beginner’s Guide by Ahrefs2. Figure out what searchers wantGoogle’s goal is to serve the most relevant results. They do this by figuring out why searchers are looking and what they want to see.This has two implications for SEO content writing.Match search intentSearch intent is the why behind a search query. If you want to rank high on Google, you need to align your content with search intent.To check search intent, Google your target keyword. For example, if we search for “how to make money,” we see that most of the top-ranking pages are lists of ways to save money:Despite the term “how to,” searchers are not looking for a guide—they’re looking for a list. So, if you’re targeting this topic, you’ll likely have to follow suit and create a listicle, too.Further readingSearch Intent in SEO: What It Is & How to Optimize for ItCover everything searchers want to knowBroadly aligning your page with search intent doesn’t mean you’re giving searchers everything they want. There may be subtopics or features they expect to see.For example, pages ranking for “affiliate marketing” all include a definition:This is why Google recommends that your content provides a comprehensive description of the topic.Google’s Helpful Content guidelines specify that Google is looking for a substantial, complete, or comprehensive description of a topic.This means you need to include every subtopic searchers expect and want to see.The easiest way to discover important subtopics is to look at the common keywords the top-ranking pages rank for. Here’s how to find these common keywords:Go to Keywords ExplorerEnter your target keywordScroll down to SERP OverviewCheck three relevant top-ranking pagesClick Open in and choose Content gapThis will open the Content gap report, which shows you the common keywords these three pages are ranking for. Eyeball the report to find relevant subtopics you could cover.For example, if we were targeting the keyword “inbound marketing,” these would make good subheadings:What is inbound marketingInbound marketing examplesInbound marketing strategiesInbound marketing tools3. Figure out how to make your content uniqueGoogle wants to reward pages that bring new information to the table.Google’s Helpful Content guidelines specify that Google is looking for original, insightful, or interesting information in content.At Chiang Mai SEO 2023, SEO Cyrus Shepard shared four ways to add something new to the conversation:Make effortBe originalDemonstrate your talent or skillImprove accuracyHere are some ways to show these:Interview experts — If you’re not an expert in the industry, interview one. Even better: Interview a few, extract their wisdom, and condense their knowledge into an article.Write from experience — For example, if you’re writing about Soylent, try having only the meal replacement for 30 days and write about what happened.Run experiments, studies, and polls — Having unique data is one of the easiest ways to include something new.Do deep research — Research isn’t remixing the top-ranking pages or asking ChatGPT a few questions. It’s going beyond that: reading books, finding primary sources, listening to podcasts, diving into research papers, and more.Be opinionated — Challenge truisms, express your point of view, and back it up with evidence from your expertise or experience.Sweating already? You should be. Creating high-quality content isn’t supposed to be so easy. As Ryan Law, our Director of Content Marketing puts it:Great writing should feel hard. If you can crank out an article by opening a few browser tabs, so can everyone else. But interview someone, read a book, find an esoteric research paper, or collect some data… and your willingness to do something difficult gives you an edge.Ryan Law, Director of Content Marketing Ahrefs4. Create a blog post outlineBefore you put pen to paper, you should create an outline. Creating an outline will help you:Plan what you want to say (including the angle, headings, subheadings)Prevent writer’s blockMake the SEO writing process fasterBy matching search intent, being comprehensive, and writing from a unique angle, you already have the necessary ingredients to create an outline. All that’s left is to put them together.The easiest way to do this is with ChatGPT. Give it a prompt like:Write an outline about link building outreach. It should include sections about what link building outreach is, why it is important, how to do it, and additional tips. It should also incorporate my original data where I found that the average conversion rate for link building outreach is 1-5%.It’ll generate an outline for you:Pretty good!Further readingHow to Write a Blog Post Outline (7 Simple Steps)Content Outlines: How to Write Better Content FasterFree AI Outline Generator5. Write your draftThis stage is about free writing without worrying too much about making the words perfect. Just get it all out.I always write my drafts in Google Docs. This allows for easy communication between my colleagues, editors, and designers.If you’re easily distracted, use some of these tricks:Download a Pomodoro timer like Marinara to keep yourself focused.Use a website blocker like BlockSite to stop yourself from checking X or accessing YouTube.Put your phone on airplane mode.Unlike other types of copywriting, SEO writing will always include an element of optimization. Once you finish getting the words out, check over your draft to ensure you’ve included all the keywords you found and that the post meets the search intent of those keywords.This is how content writing for SEO is different. Without optimization, your content may not perform in search engines.6. Get feedback, then edit and polish the draftAs writers, we often have trouble seeing the wood for the trees. That’s why having a second pair of eyes is helpful.Getting someone to review your draft can help point out inaccuracies, inconsistencies, failures in logic, phrasing errors, and grammatical mistakes.You can ask team members or employees to give their feedback. If you have an audience, you can consider getting their feedback as well.At Ahrefs, each draft goes through at least one person.Here’s an example of how we improved the accuracy of our post, thanks to peer feedback:This will make the content better in Google’s eyes.Once you get the feedback, revise your writing accordingly and start polishing your article.Your goal here is to provide the best possible answer in the most efficient way.Efficient means you want to make it easy for them to consume. Here’s what you can do:Add visual elements. You’d want to think about where an image could explore more and illustrate better than words.Use bullets and lists (like what I’m doing now.)Avoid big words (where necessary). Author Morgan Housel writes: “Big words mask little thoughts. They’re an attempt to fool the reader into thinking you’re smart when you have nothing smart to say.”Use Grammarly to fix any grammatical errorsUse Hemingway to simplify your writing7. Write a compelling title and meta descriptionThe title tag and meta description are the first things a searcher sees after Googling their query:How enticing they are could mean the difference between a searcher clicking through or ignoring your page.So, you want to make sure both are compelling for your article.Here are some tips on writing an attractive title tag:Keep it short (<70 characters) to avoid truncationTell searchers you have what they want by matching search intentBe descriptive but don’t clickbaitInclude the keyword if possible, otherwise use a close variationIf you’re stuck, ask ChatGPT to brainstorm title tags for you and use them as inspiration:Here are some tips on writing a compelling meta description:Keep it under 160 characters to avoid truncationExpand on the title tag by including USPs you couldn’t fitDouble down on what searchers want by matching search intentAddress the searcher directly via an active voiceInclude your keyword if possibleAgain, you can use ChatGPT to brainstorm meta descriptions for you:Further readingWhat Are Title Tags? How To Write Them for SEOHow to Write the Perfect Meta DescriptionFree AI Title GeneratorFree AI Meta Description Generator8. Add internal linksAfter your post is published, you should always add internal links from other pages on your site to the new article.Not only does this make your site user-friendly, but it also helps Google crawl and understand what your new page is about.Here’s how to find relevant internal link opportunities:Sign up for our free Ahrefs Webmaster ToolsRun a crawl using Site AuditWhen the crawl is done, go to the Internal link opportunities reportThis report will show you the page you should link to, the page you should link from, and the keyword context where you can add an internal link.Go through the report and add your internal links.Further readingInternal Links for SEO: An Actionable GuideFAQsWhy is SEO writing important?If you can write and rank content that searchers are looking for, you’ll get passive, consistent traffic to your website.The Ahrefs blog’s organic search performance over timeFinal thoughts on how to write for SEOSEO writing boils down to creating the best possible answer to a given query presented in a way that’s easily understood and skimmable.As long as you nail that and the basic on-page SEO best practices I mentioned, you’ve mastered the content side of SEO.If you’re eager to learn more about writing and SEO, check out some of these other guides:Writing Well Handbook by Julian ShapiroSEO Copywriting: What It Is & How to Do ItContent Writing Explained + 8 Tips to Become a Better WriterHow to Write Website Content That Ranks (And People Want to Read) Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Keep Learning How to Create Great Content for Search Great content is based on the needs of the people. It must be useful, in-depth, and created by an expert—not an SEO. Product Page SEO: The Anatomy of a Well-Optimized Page Time to explore the 16 elements of a well-optimized product page. How to Create an SEO Content Strategy (Follow the Ahrefs’ Framework) This is a guide on how Ahrefs’ SEO content strategy works. Use it as inspiration for your own. SEO Writing Tools (Do You Really Need Them?) SEO writing tools are key to improving your content. However, you must know how to use them properly. Let's explore. How to Create Relevant Content That Ranks Your content won't rank if it isn't relevant. Learn how to create relevant content that Google and searchers want to see.",
  "headers": [
    {
      "level": "H1",
      "text": "SEO Writing: 8 Steps to Create Search-Optimized Content"
    },
    {
      "level": "H2",
      "text": "1. Find a winning keyword"
    },
    {
      "level": "H2",
      "text": "2. Figure out what searchers want"
    },
    {
      "level": "H3",
      "text": "Match search intent"
    },
    {
      "level": "H3",
      "text": "Cover everything searchers want to know"
    },
    {
      "level": "H2",
      "text": "3. Figure out how to make your content unique"
    },
    {
      "level": "H2",
      "text": "4. Create a blog post outline"
    },
    {
      "level": "H2",
      "text": "5. Write your draft"
    },
    {
      "level": "H2",
      "text": "6. Get feedback, then edit and polish the draft"
    },
    {
      "level": "H2",
      "text": "7. Write a compelling title and meta description"
    },
    {
      "level": "H2",
      "text": "8. Add internal links"
    },
    {
      "level": "H2",
      "text": "FAQs"
    },
    {
      "level": "H3",
      "text": "Why is SEO writing important?"
    },
    {
      "level": "H2",
      "text": "Final thoughts on how to write for SEO"
    }
  ],
  "author": "Si Quan Ong"
}