{
  "url": "https://ahrefs.com/blog/seo-competitor-analysis/",
  "slug": "seo-competitor-analysis",
  "title": "How to Do an SEO Competitor Analysis",
  "description": "Discover how to outrank your competitors by analyzing the strengths and weaknesses of their SEO strategies.",
  "content": "Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Your competitors are a goldmine of information you can use to improve your search engine optimization (SEO) strategy.In this post, you’ll learn how to find that information with an SEO competitor analysis.ContentsWhat is an SEO competitor analysis?An SEO competitor analysis is where you dig into the SEO strategies of your competitors. The aim is to find their strengths and weaknesses so you can outrank them.Why should you perform an SEO competitor analysis?Performing an SEO competitive analysis allows you to:Learn what works and what doesn’t in your industry and avoid mistakes.Capitalize on your competitors’ weaknesses.Replicate your competitors’ strengths.Understand what SEO tasks to prioritize going forward.Understand how difficult outperforming competitors is likely to be.When should you perform an SEO competitor analysis?You should perform an SEO competitor analysis when:You have a new website.You’re planning your SEO strategy.Competitors are outranking you or when your keyword rankings have dropped.How to perform an SEO competitor analysisFor this process, let’s pretend we’re a new infographic design tool. This is how your hypothetical SEO competitor analysis will look like:1. Identify your SEO competitorsYour SEO competitors are the websites competing for your desired target keywords in organic search. These may not be the same as your direct business competitors.For example, HubSpot ranks for “how to make infographics” even though it’s not a direct business competitor of any infographic design tool:Here’s how you can identify SEO competitors fast:Go to Ahrefs’ Site ExplorerEnter your domainGo to the Organic competitors reportThis report shows you competing websites that rank in the top 10 for the same keywords as your website. These are likely your SEO competitors.If your site is new, this may not give you great results. So here’s what you can do instead:Go to Ahrefs’ Keywords ExplorerEnter some keywords potential customers may use to search for your product or serviceGo to Traffic share by domainFor this example, we can see that our potential top-ranking five competitors are sites like Canva, Visme, Venngage, Piktochart, and Adobe.Pro TipCompanies like Adobe and Canva are well-known brands that typically have high Domain Rating (DR). This is an Ahrefs metric that you can use to estimate a website’s authority. This gives them a competitive advantage, so you may want to rule them out. You can check a site’s DR by plugging each competing domain into Site Explorer individually or pasting all of them into our Batch Analysis tool:So if you’re a DR 50 site, you probably can compete with sites like Visme, Venngage, and Piktochart, as opposed to Adobe and Canva.2. Investigate how they’re getting trafficYou can look at your competitor’s website architecture to understand where most of their search traffic is going. Here’s how to see your competitor’s website structure:Go to Ahrefs’ Site ExplorerEnter your competitor’s domainGo to the Site structure reportFor example, we can see that Venngage gets 260,000 estimated monthly search visits to its template subfolder, which is 9.9% of its total organic traffic.If we click one level deeper, we can see the types of templates that send it the most traffic.From this, it looks like creating brochure and infographic templates is a perfect SEO opportunity for a competing tool. Further readingHow to Structure Your Website’s Architecture for SEO 3. Find and cover content gapsContent gaps (also know as keyword gaps) are keywords that your competitors rank for, but you don’t. Here’s how to find content gaps for your site:Go to Ahrefs’ Competitive Analysis toolEnter your domain in the Target sectionEnter your competitors’ domains in the Competitors sectionHit “Compare”Click the Content Gap reportHit the Main positions only toggle to exclude your competitors’ rankings in SERP features like “Top stories” and “Image packs.”Look through the report and identify keywords that are relevant for your site.For example, “infographic examples” looks like a good keyword to target:Pro TipIf there are too many keywords to look through or they look mostly irrelevant, click the Competitors’ positions dropdown and check all competitors. This will show you the keywords that all your competitors are ranking for in the top 10.Further readingKeyword Competitive Analysis: How to Find Your Competitors’ Keywords 4. Spy on your competitors’ featured snippetsFeatured snippets are quick answers in search results that Google pulls from a page ranking in the top 10. If you can find featured snippets your competitors own where you rank in the top 10, you can potentially “steal” these featured snippets. Here’s how you can see these opportunities:Go to Ahrefs’ Competitive Analysis toolEnter a competitor’s domain in the Target sectionEnter your domain in the Competitors sectionHit “Compare”Click the Content Gap reportSet the SERP features filter to “Where target ranks” and check “Featured snippet”Set Target’s position from “No” to “Any”Look through the report to see if there are any keywords where you could optimize an existing page to grab the featured snippet.For example, Venngage owns the featured snippet for “how to make posters,” which is a list of steps:If you’re targeting this keyword, you’ll want to re-optimize your page and add clear steps in H3s.Further readingGoogle’s Featured Snippets: All You Need to Know to Get Them 5. See where your competitors’ traffic is coming fromKnowing which countries your competitors get the bulk of their organic traffic from helps you understand whether you can get more traffic by translating or creating your content in other languages.Here’s how to see this:Go to Ahrefs’ Site ExplorerEnter your competitor’s domainLook at the Traffic by country sectionWe can see that the U.S. is where Venngage gets the bulk of its traffic. So as a competitor, you’ll naturally want to focus on English-language content. However, there are opportunities for countries like Mexico, Philippines, Brazil, and India too. You could potentially translate your homepage and landing pages into Spanish, Portuguese, Tagalog, and Hindi. You could even launch a multilingual blog to maximize traffic from these countries.In fact, Venngage has done that for a number of languages, like Spanish:Further readingHow to Implement an International SEO Strategy (Step-by-Step Guide)6. Find backlink gapsLinks are an important Google ranking factor. Generally speaking, the more links you have, the higher you’ll likely rank on Google (and possibly other search engines).If you can figure out how your competitors have been acquiring links, you can potentially replicate the same strategies.Here’s how to do it:Go to Ahrefs’ Site ExplorerEnter your domainGo to the Link Intersect reportEnter your competitors’ domains in the top sectionEnter your domain in the bottom sectionHit “Show link opportunities”This report will show you the websites that are linking to your competitors, but not you. You’d want to look for easily replicable links that might have value for you. For example, clicking on the number for cnet.com reveals that your competitors are listed as to-try tools:If you’re competing with these sites, you’ll want to be added to CNET too.Further readingHow to Perform a Competitor Link Analysis in 3 StepsHow to Find Your Competitors’ Backlinks (And Get Them for Yourself) 7. Spot link bait opportunitiesLinks are important if you want to rank higher on Google. But it can be difficult to get people to link to your “money pages,” as they provide no value. You can solve this by creating link bait and then redistributing the “authority” your link bait attracts to your most important pages. This can help boost their search engine rankings.To find great link bait ideas, you analyze your competitors backlink profiles and piggyback off what’s working for them.Here’s how to find them:Go to Ahrefs’ Site ExplorerEnter your competitor’s domainGo to the Best by links reportThis report shows you which of your competitors content has the most backlinks. Eyeball the list to see what kind of formats and topics resonate with your niche.For example, we can see that statistics posts work well for Venngage:Further readingWhat Is Link Bait? 7 Successful Examples 8. Find your competitors’ broken pagesIf our competitors have broken pages with backlinks, we can:Publish working replacements.Ask everyone linking to the dead pages to link to us instead.Here’s how to find these broken pages:Go to Ahrefs’ Site ExplorerEnter your competitor’s domainGo to the Best by links reportSet the HTTP code filter to 404 not foundThis will show you all the broken pages with links on your competitor’s site. Go through the report and see if there are any relevant pages you can potentially replicate. For example, this post on Gestalt design principles seems decent and has 33 sites linking to it:Click on the caret and click on View on Archive.org. This will open up the page in Wayback Machine so you can check how it looked in the past.You can potentially improve it and get people to link to you instead. Follow the guide below to learn how to do this.Further readingBroken Link Building: The Complete Guide9. Check your competitors’ Core Web VitalsCore Web Vitals are part of Google’s Page Experience signals used to measure user experience. They’re Google ranking factors. So you’d want to see their Core Web Vitals—alongside their overall technical health—and compare them to yours.You can do this analysis by entering your competitor’s pages one by one into PageSpeed Insights.Doing that can be tiresome. So a better way is to run a crawl of your competitor’s domain using Ahrefs’ Site Audit, connect PageSpeed Insights’ API, and see your competitor’s Core Web Vitals together with other technical SEO issues.Further readingA Primer on Core Web Vitals10. See what keywords your competitors are bidding on in paid searchIf your competitors are bidding on certain keywords, then it’s likely those keywords are profitable.Here’s how to see the keywords they’re bidding on:Go to Ahrefs’ Site ExplorerEnter your competitor’s domainGo to the Paid keywords reportIn the Keywords filter, add “Doesn’t include [brand]” to filter out branded keywordsLooking through this report can help unearth low-volume, high-converting keywords that you may have missed during keyword research.For example, this seems like a good keyword to target:11. Learn from your competitors’ PPC adsGoogle rewards more relevant ads with a lower cost per click (CPC). So it’s in your competitors’ interest to make sure their ads win the click.Typically, that means better headlines and descriptions. We can use them as inspiration to write title tags and meta descriptions that increase click-throughs.Here’s how to see your competitors’ ad copy:Go to Ahrefs’ Site ExplorerEnter your competitor’s domainGo to the Paid keywords reportHover over the magnifying glass icon beside the keyword you wish to targetThis is the current ad Venngage is using to target the keyword “infographic design.” Looks like it’s using words like “customizable,” “few clicks,” and “design wiz” to attract clicks. They could be useful additions to our own title tags or meta descriptions.Further readingHow to Craft the Perfect SEO Title Tag (Our 4-Step Process) How to Improve Click-Through Rate (CTR): 9 Tried & Tested TipsHow to Write the Perfect Meta DescriptionFinal thoughtsWhen it comes to competitor analysis for SEO, everything above is merely the tip of the iceberg. There’s more you can do, but it’s good enough for you to get started. Our advice is to run through the process above and start applying the insights to your SEO strategy. Execution is important, after all.Any questions or comments? Let me know on Twitter or Threads. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Si Quan Ong Contributors Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. ContributorsKeep Learning Steal Our SEO Report Template (Inspired by SEO Experts) Not sure how to create the perfect SEO report? Steal our SEO report template and make it even better as we go through it slide by slide. How to Do a SERP Analysis Want to know how to do a SERP analysis? In this article, learn how to use SERP analysis to outrank your competitors. How to Do a Content Gap Analysis [With Template] Follow our in-depth, step-by-step guide for doing competitive content gap analysis for SEO. Easy gap analysis template included! How to Use Yoast SEO to Improve SEO Yoast SEO is a popular WordPress plugin that helps you optimize blog posts for SEO. Learn more about how it works and its key features. Quick SEO: 8 Ways to Accelerate SEO Results From Months to Days Think all SEO progress is slow as molasses? Think again.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Do an SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "What is an SEO competitor analysis?"
    },
    {
      "level": "H2",
      "text": "Why should you perform an SEO competitor analysis?"
    },
    {
      "level": "H2",
      "text": "When should you perform an SEO competitor analysis?"
    },
    {
      "level": "H2",
      "text": "How to perform an SEO competitor analysis"
    },
    {
      "level": "H3",
      "text": "1. Identify your SEO competitors"
    },
    {
      "level": "H3",
      "text": "2. Investigate how they’re getting traffic"
    },
    {
      "level": "H3",
      "text": "3. Find and cover content gaps"
    },
    {
      "level": "H3",
      "text": "4. Spy on your competitors’ featured snippets"
    },
    {
      "level": "H3",
      "text": "5. See where your competitors’ traffic is coming from"
    },
    {
      "level": "H3",
      "text": "6. Find backlink gaps"
    },
    {
      "level": "H3",
      "text": "7. Spot link bait opportunities"
    },
    {
      "level": "H3",
      "text": "8. Find your competitors’ broken pages"
    },
    {
      "level": "H3",
      "text": "9. Check your competitors’ Core Web Vitals"
    },
    {
      "level": "H3",
      "text": "10. See what keywords your competitors are bidding on in paid search"
    },
    {
      "level": "H3",
      "text": "11. Learn from your competitors’ PPC ads"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Si Quan Ong, Joshua Hardwick"
}