{
  "url": "https://ahrefs.com/blog/seo-campaign/",
  "slug": "seo-campaign",
  "title": "How to Launch an SEO Campaign in 3 Steps",
  "description": "Learn how to launch a successful SEO campaign quickly and easily.",
  "content": "Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents An SEO campaign is a coordinated effort to achieve a goal, like improving your website’s rankings in Google or other search engines. Campaigns commonly involve keyword research, content optimization, and link building.Learn how to create one in three simple steps. Contents1. Set a campaign goalAnything can be an SEO campaign goal, but here are a few common ones: Rank higher for a keyword (or keywords) Get more organic traffic to a page (or a set of pages) Build more backlinks For example, we recently had a goal to improve the rankings of our list of “blogging tips” from #7 to #1.Our article on “blogging tips” was hovering around #7 and #10 from 28 June to 25 September this year. Further readingHow to Set the Right SEO Goals with 3 Examples2. Figure out how to achieve itIf your goal is to build more backlinks, the process can be complex so I recommend reading our link building guide.If your goal is to rank higher and get more organic traffic, you’ll likely have to audit your target page(s) to understand what you can fix to achieve your goal. First, you want to make sure your target pages can be crawled and indexed by Google. In our case, our blog post is ranking #7, so it’s clear that crawlability and indexability are not issues. Beyond that, the most common issues are: No traffic potentialYou can only get search traffic if you’re targeting a topic people are searching for. So, if you’ve not been doing keyword research to find topics to target, it’s time to start. Install our SEO toolbar and search for your topic in Google. Our toolbar will show you if the top-ranking pages are getting search traffic. Our SEO toolbar shows you the search volume and traffic potential (TP) for any keyword you enter. You can also see the amount of search traffic (ST) each top-ranking page gets. In our case, we were already targeting a keyword, “blogging tips.” It had 1,000 monthly searches and a traffic potential of 800. So, this wasn’t the main issue. Further readingKeyword Research: The Beginner’s Guide by AhrefsNot enough backlinksBacklinks are an important Google ranking factor. If the pages outranking you have way more backlinks than you, it could be a reason why you’re not ranking. To check this, enter your target keyword into Keywords Explorer and scroll down to SERP Overview. Then, look at the Domains column to see if you’re in the same ballpark as the other top-ranking pages. If you have around the same number of referring domains, it’s a good thing. Otherwise, links could be the issue behind why you’re not ranking as high. For our example, backlinks weren’t a problem. We had more backlinks from more unique websites than the other top-ranking pages. These backlinks were coming from legitimate domains, too: If backlinks are an issue for your page, then you’d have to focus on building more backlinks. Check out the resources below to learn how to get more links to your target page. Further readingHow to Get Backlinks: 14 Tactics That Work in 20237 Popular White Hat Link Building Techniques (That SEOs Are Still Using Today)How to Find Your Competitors’ Backlinks (And Get Them for Yourself)Not hitting the mark in terms of contentIf you’re targeting a keyword with traffic potential, have enough backlinks, and still don’t rank high, it’s likely your content is missing something. There are three areas to focus on: Check if you’re aligned with search intentSearch intent is the why behind a search. If your content isn’t matching why people are searching, Google won’t rank it high. That’s why we never ranked for the keyword ‘backlink checker’ in the early days. We created a landing page when searchers were looking for a free tool: Our original landing page for our backlink checker The SERP Overview for the keyword backlink checker We jumped to #1 when we changed it to a free backlink checking tool instead. To check search intent, Google your target keyword and see what pages are ranking. For example, people searching for ‘blogging tips’ are beginners looking for a list of tips: In our case, we’re matching search intent, so it’s probably not the main issue. If your content is not aligned with search intent, you’ll likely have to rewrite and republish your page. Further readingSearch Intent in SEO: What It Is & How to Optimize for ItCheck if your content is comprehensiveEven if your content generally aligns with search intent, you may not be giving searchers everything they want. There may be subtopics they expect to see in your content. For example, the top-ranking pages for ‘mens sneakers’ include a size filter: This is because searchers will inevitably want to filter for shoes that fit. Here’s one way to find subtopics you should include in your content: Go to Keywords ExplorerEnter your target keyword Go to Related termsToggle Also talk aboutThis report shows you which other keywords and phrases the top-ranking pages for your target keyword frequently mention. A quick eyeball of this report already tells me that we’re missing some important subtopics in our content: Social mediaContent strategyAICheck if you can optimize for the featured snippetA featured snippet is a full or partial answer to a query directly on the SERPs. If you can win the snippet, you can jump ahead of other websites. However, to win the snippet, two things need to be true: Your target keyword shows a featured snippet Your page is already ranking in the top 10 You can check this easily in Keywords Explorer. For our example, a featured snippet exists and we rank in the top 10 positions. So, there’s a chance we could grab the snippet by carefully analyzing what Google is looking for and reworking parts of our content. Further readingFeatured Snippets: A Shortcut to the Top of Google3. Take actionYou’ve now audited your page and have an idea of what to do next. And the next step is none other than to execute on what you’ve decided on. If your page is completely misaligned with search intent or isn’t about a topic with search traffic potential, then you’ll need to go back to the drawing board and rewrite.Fortunately for us, this wasn’t the case. Our audit suggested we could reach #1 by reworking some parts of our content. In fact, there were two potential actions we could take: Fill the missing content gapsFormat the post better to win the featured snippet Since the latter was the easier way to achieve our goal, we decided to do that first. Comparatively, the featured snippet was a list of tips with clear subheadings, whereas ours was on the vague side. Our subheadings were vague and didn’t clearly communicate what the tips were about. We used ChatGPT to simplify the headings with this prompt: I’ll give you our blog content and I want you to rephrase the main tips which are heading tags so it’s clear, direct, and easy to understand at a glance.We then updated the post and asked Google to recrawl the page on Google Search Console. A few hours later, we saw a jump in our mobile rankings, landing right behind the People Also Ask (PAA) boxes. However, our desktop rankings didn’t budge, so we assumed the result was temporary. We then decided to update our post. We did this by downloading the list of keywords from the Also talk about report in Keywords Explorer, pasting it (alongside the content) into ChatGPT, and prompting it to tell us which keywords, entities, or subtopics we’ve missed. We then refreshed our content with these new tips. The next day, we captured the featured snippet in New York. Five days later, we had the snippet in all 50 U.S states. Today, even after the campaign ended, we’re still ranking #1 in the U.S. for “blogging tips”: Final thoughtsWe’ve actually documented our journey trying to boost our blogging tips blog post to the #1 position. I highly recommend watching it here:https://www.youtube.com/watch?v=zlNIHl92b3kWhether your campaign succeeds or fails, you can learn from it. If it’s a success, consider whether you can do the same with other pages. If it’s a failure, dig deeper and understand why. You’ll also want to look for other opportunities that might help you achieve your goal. Any questions or comments? Let me know on X (Twitter). Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Keep Learning Steal Our SEO Report Template (Inspired by SEO Experts) Not sure how to create the perfect SEO report? Steal our SEO report template and make it even better as we go through it slide by slide. Is Wix Good for SEO? Here’s Everything to Know About Wix SEO Whether you have a Wix site or are still deciding on a CMS, it's important to know how Wix can impact your SEO. How to Use Yoast SEO to Improve SEO Yoast SEO is a popular WordPress plugin that helps you optimize blog posts for SEO. Learn more about how it works and its key features. Continuous SEO: Can You “Complete” SEO? Can you really “complete” SEO, or should it be continuous? We'll answer that, plus share tips for implementing a continuous SEO strategy. Quick SEO: 8 Ways to Accelerate SEO Results From Months to Days Think all SEO progress is slow as molasses? Think again.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Launch an SEO Campaign in 3 Steps"
    },
    {
      "level": "H2",
      "text": "1. Set a campaign goal"
    },
    {
      "level": "H2",
      "text": "2. Figure out how to achieve it"
    },
    {
      "level": "H3",
      "text": "No traffic potential"
    },
    {
      "level": "H3",
      "text": "Not enough backlinks"
    },
    {
      "level": "H3",
      "text": "Not hitting the mark in terms of content"
    },
    {
      "level": "H4",
      "text": "Check if you’re aligned with search intent"
    },
    {
      "level": "H4",
      "text": "Check if your content is comprehensive"
    },
    {
      "level": "H4",
      "text": "Check if you can optimize for the featured snippet"
    },
    {
      "level": "H2",
      "text": "3. Take action"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Si Quan Ong"
}