{
  "url": "https://ahrefs.com/blog/seo-pricing/",
  "slug": "seo-pricing",
  "title": "SEO Pricing: How Much Does SEO Cost? 439 People Polled",
  "description": "Did you know that 78.2% charge a monthly retainer? Learn more insights from our survey of 350 SEO professionals.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Key takeawaysSEO costs $2,917 per month on average.23% of SEOs charge $500-$1,000 per month.Local SEO costs $1,557 per month on average.78.2% of SEOs charge a monthly retainer.Agencies charge 138% more than freelancers.SEOs with 2+ years of experience charge 33% more.Consultants charge $3,250 per month on average.The average hourly rate for SEO is $111.1 in 10 charge more than $150/hour.SEOs in India, Central, and South America charge the least.Sidenote. We polled 439 SEO service providers for the data in this post. We even reviewed all their websites manually to make sure they really did offer SEO services. ContentsHow much does SEO cost?SEO costs usually range from $250 to $10,000 per month, with most businesses (63%) spending between $500 and $5,000. On average, agencies charge $3,209 per month, while freelancers charge $1,348.The most common hourly rate for SEO is $100-$150, with 25% of SEOs charging this amount.How much does local SEO cost?Local SEO is more affordable, averaging $1,557 per month. Agencies typically charge $1,819, while freelancers charge around $1,150.The most common hourly rate for local SEO services is $75-$100.How much does SEO cost for small businesses?It’s likely around $1,557 per month on average, similar to local SEO costs, but for very small businesses with basic needs, it could be lower. About 42% of SEOs charge between $250 and $1,000 per month.SEO pricing models: a deeper breakdown of costsHere are the three common SEO pricing models:Monthly retainer: 78.2% charge for services this way.Hourly: 34.8% charge for services this way.Per-project: 48.9% charge for services this way.Let’s dive deeper into each pricing model.Monthly retainer pricing: How much does SEO cost per month?$501–$1,000 per month is the most popular monthly retainer rate for SEOs, with 20.4% of respondents charging this rate.42.8% of respondents charge between $501 and $2,000 per month.68.8% charge $2,000/month or less, meaning only 31.2% command retainers of $2,001+.Here’s a breakdown of monthly retainer rates by region:India is a clear outlier here, with 76% of India-based SEOs charging $1,000 or less per month. The remaining 24% charge between $2,001 and $10,000.Looking at U.S. and Canada data in isolation, 79.1% charge at least $1,001 per month—some command as much as $25,001–$50,000 per month!Do SEO agencies charge more per month than freelancers?Yes. 57.4% of SEO agencies command $1,001+/month, compared to only 32.2% of freelancers.However, consultants earn the most, with 70.6% commanding $1,001+/month.The most common monthly retainer range for SEO agencies is $500–$1,000/month. For consultants, it’s $2,501–$5,000.For freelancers, it’s $251–$500/month and $101–$500/month.If we assume all surveyed SEOs charge the upper end of their pricing tier (e.g., $1,500, from $1,001–$1,500), and then take the average monthly retainer rate for each subset (Agency, Freelance, Consultancy), here’s what we get:Agencies: $3,209/month, on average.Consultancies: $3,250/month, on average.Freelancers: $1,348.63/month, on average.By these stats, the monthly retainer range charged by SEO agencies and consultants is almost double that of SEO freelancers.Do more experienced SEOs charge a lot more per month?Yes, they do.$1,540.52 is the average retainer rate for SEOs who have been in business for two years or less.This jumps to $2,023.13 for those who’ve been in business for 2+ years. That’s around 33% more than those who’ve been in business for two years or less.But the big jump comes after five years in business. The average retainer for those in business for 5–10 years is $3,648.28—more than double the rate of those in business for two years or less. After this, things level off somewhat. In fact, we saw a decline in earnings for those who’ve been in business for 10+ years. However, this is probably due to us not having a lot of data for this subset.Do those offering services worldwide charge more per month than those serving local markets?Yes.Those offering their services locally charge $1,557.08/month, on average. Whereas those serving the worldwide market earn $3,473.74/month. That’s a significant difference of 123.1%. Hourly pricing: What rates do SEOs charge?$75–$100 per hour is the most popular hourly rate for SEOs, with 24% of respondents charging this rate.47% of respondents charge between $75 and $200 per hour.90% charge $150/hour or less, and only 4.1% command an hourly rate of $201+.Here’s a breakdown of hourly rates by region:There is one clear outlier here: India.We found 85.7% of India-based SEOs charge an hourly rate of $30 or less. The remaining 14.3% are in the $51–$60 range.Sidenote. We didn’t have much data for some regions, so take the results with a pinch of salt. Also, the reason for grouping Germany, France, Italy, Netherlands, and Spain together is that they’re the only European countries (besides the U.K.) with a GDP of 1 trillion or more. I thought it would be interesting to see if the numbers for those countries were different from the rest of Europe.Looking at U.S. and Canada data in isolation, 66.7% charge $75–200/hour—over two-thirds!Do SEO agencies charge more per hour than freelancers?Yes. 58.7% and 58.8% of SEO agencies and consultants respectively command $75+/hour, compared to only 36.6% of freelancers.However, the most common hourly rate for SEO agencies and freelancers is the same: $75–100/hour. For SEO consultants, it’s $100–150/hour.If we assume all surveyed SEOs charge the upper end of their pricing tier (e.g., $150, from $100–$150), then take the average hourly rate for each subset (Agency, Freelance, Consultancy), here’s what we get:Consultancies: $171.18/hour, on average.Agencies: $98.90/hour, on average.Freelancers: $71.59/hour, on average.By these stats, the hourly rate charged by SEO consultants is more than double that of SEO freelancers.Do more experienced SEOs earn a lot more per hour?Yes, they do.$73.05 is the average hourly rate for SEOs who have been in business for two years or less.This jumps to $97.11 for those who’ve been in business for 2–4 years, $102.03 for 5–10 years, and $118.35 for 10+ years.So it seems that experience and track record play a vital role when it comes to hourly earnings.Do those offering services worldwide charge more per hour than those serving local markets?Yes, slightly.On average, those offering their services locally earn $93.89/hour, whereas those serving the worldwide market earn $106.69/hour. That’s a difference of 13.6%. Per-project pricing: How much do one-off initiatives cost?$2,501–$5,000 is the most popular per-project fee, with 21.2% of respondents charging this rate.60.6% of respondents charge $1,001 or more.50.6% charge $2,000 or less, meaning that fewer than half of respondents command per-project fees of $2,001+.Here’s a breakdown of per-project rates by region:Yep, you guessed it—India is the outlier.93.75% of India-based SEOs charge $1,500 or less. The remaining 6.25% charge between $2,001 and $2,500.Looking at the U.S. and Canada in isolation, 83.3% charge at least $1,001. Some even charge as much as $50,001–$75,000 per project.Do SEO agencies charge more per project than freelancers?Yes. 73.3% of SEO agencies command $1,001+ per project, compared to only 64% of consultants and 40.68% of freelancers.The most common per-project fee for freelancers is $101–$250. For SEO agencies, it’s $2,501–$5,000. And for consultants, it’s $5,001–$10,000.If we assume all surveyed SEOs charge the upper end of their pricing tier (e.g., $1,500, from $1,001–1,500), and then take the average per-project rate for each subset (Agency, Freelance, Consultancy), here’s what we get:Agencies: $9,507.84/month, on average.Consultancies: $8,685.53/month, on average.Freelancers: $2,348.63/month, on average.By these stats, the per-project fee charged by SEO agencies is more than 4X that of SEO freelancers, on average.Do more experienced SEOs charge a lot more per project?Yes, they do.$1,881.73 is the average per-project fee charged by those who’ve been in business for two years or less.This jumps to $2,242.71 for those who’ve been in business for 2+ years and then to $9,087.31 for those who’ve been in business 5–10 years.Do those offering services worldwide charge more per project than those serving local markets?Yes—significantly more!On average, those offering their services locally charge $5,723.53 per project, whereas those serving the worldwide market charge $8,056.56.That’s a significant difference of 40.80%. Final thoughtsMy hope is that this data will help SEOs to stop undercharging for their services. Yes, the economic outlook may look bleak right now, but know that SEO is a valuable skill. Don’t be afraid to charge what you’re worth.Got questions? Ping me on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Keep Learning Flesch Reading Ease: Does It Matter for SEO? (Data Study) Flesch Reading Ease (FRE) is a way to score the readability of text. The scores range between 1 and 100, with higher scores deemed easier to read. Does Going Viral Help With SEO? Not Really Many people believe the key to SEO success is to go viral... not quite. Here are some examples that may give you unexpected insights. How long does it take to rank in Google? (A study by Ahrefs) Our research will answer the most popular question in SEO world: \"How long does it take to rank in Google?\" Another number-driven study from Ahrefs. How Often Does Google Rewrite Meta Descriptions? (New Data Study) We compared hardcoded meta descriptions with the actual Google snippets on desktop for 20,000 keywords. Here's what we found. Does Adding a Related Post Section Help Your Blog? We Tested It In December 2022, we added an \"related posts\" section to the Ahrefs blog. Here's what happened.",
  "headers": [
    {
      "level": "H1",
      "text": "SEO Pricing: How Much Does SEO Cost? 439 People Polled"
    },
    {
      "level": "H2",
      "text": "How much does SEO cost?"
    },
    {
      "level": "H3",
      "text": "How much does local SEO cost?"
    },
    {
      "level": "H3",
      "text": "How much does SEO cost for small businesses?"
    },
    {
      "level": "H2",
      "text": "SEO pricing models: a deeper breakdown of costs"
    },
    {
      "level": "H3",
      "text": "Monthly retainer pricing: How much does SEO cost per month?"
    },
    {
      "level": "H4",
      "text": "Do SEO agencies charge more per month than freelancers?"
    },
    {
      "level": "H4",
      "text": "Do more experienced SEOs charge a lot more per month?"
    },
    {
      "level": "H4",
      "text": "Do those offering services worldwide charge more per month than those serving local markets?"
    },
    {
      "level": "H3",
      "text": "Hourly pricing: What rates do SEOs charge?"
    },
    {
      "level": "H4",
      "text": "Do SEO agencies charge more per hour than freelancers?"
    },
    {
      "level": "H4",
      "text": "Do more experienced SEOs earn a lot more per hour?"
    },
    {
      "level": "H4",
      "text": "Do those offering services worldwide charge more per hour than those serving local markets?"
    },
    {
      "level": "H3",
      "text": "Per-project pricing: How much do one-off initiatives cost?"
    },
    {
      "level": "H4",
      "text": "Do SEO agencies charge more per project than freelancers?"
    },
    {
      "level": "H4",
      "text": "Do more experienced SEOs charge a lot more per project?"
    },
    {
      "level": "H4",
      "text": "Do those offering services worldwide charge more per project than those serving local markets?"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Joshua Hardwick"
}