{
  "url": "https://ahrefs.com/blog/seo-for-new-website/",
  "slug": "seo-for-new-website",
  "title": "SEO for a New Website: 8 Important Steps",
  "description": "The best time to ensure your site is SEO-friendly is when you're building it. We've distilled the process into eight key steps.",
  "content": "Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents There’s no better time to make sure your website is SEO-friendly than when you’re building it.Here are all the steps you should take:Contents1. Choose a domain nameIt’s easy to overcomplicate the process of choosing a domain. But choosing a branded domain that is short and memorable works better in most cases than trying to shoehorn certain keywords into your domain name.So if you already have one, go ahead with it. Or if you’re setting one up for your business, your business name works fine too.When it comes to the top-level domain (TLD), for example, .com, Google has said that the TLD makes no difference for SEO. So we treat all of the New Top-level Domains like any other generic top-level domain.John Mueller, Search AdvocateThere’s no need to rack your brain over this. .com works fine in most cases, as it’s internationally recognizable. Once you’ve decided on a domain name, head over to a domain registrar—like Google Domains or Namecheap—to see if it’s available. If it isn’t available, you will need to repeat the process until you find a name that is both available and works for your business.2. Choose a website platformWebsite platforms let you create and manage a website easily. There are two types:Hosted platforms – They host the site, give you ready-made designs, and let you add and edit content without touching code. Examples are Wix, Squarespace, and Shopify.Self-hosted platforms – These allow you to add and edit content with or without code. However, you’ll have to host and install them yourself. Examples are WordPress and Ghost. Most SEOs recommend WordPress—a self-hosted, open-source platform. SEOs prefer it because it’s customizable—you can edit the code however you like. But that doesn’t mean you have to be technical to use WordPress. There are millions of plugins you can install that do all sorts of tasks for you. These include SEO plugins too. You don’t have to know how to code in order to use WordPress.Further readingWordPress SEO: 20 Tips and Best Practices 3. Choose a hostIf you’re using a self-hosted solution, like WordPress.org, you’ll need a web host. We don’t have a particular one to recommend. But as you’re considering your options, look out for the three S’s:Security – Hosts should provide you with a free SSL/TLS certificate. Server location – It takes time for data to travel between the server and visitor. So it’s best to choose a host with servers in the same country as most of your traffic.Support – You’ll want 24/7 support. Consider checking out their reviews in forums like Reddit or test their support out before you sign up.4. Setting up for SEO successYou now have a basic website you can configure to become SEO-friendly. Here’s what you should do next:Set up Google Search Console and Ahrefs Webmaster ToolsYou’ll need GSC to do a bunch of important SEO tasks, like finding technical errors on your website, submitting sitemaps, and more.Setting it up is pretty easy. Sign in to GSC with your Google account. You should see this “welcome” screen:Choose Domain and enter your domain. You’ll then be prompted to verify your domain. Google has explicit step-by-step instructions on how to do this:Verifying domain ownership via TXT in GSC.Verifying domain ownership via CNAME in GSC.If you’re stuck or unsure, you can check out Google’s help article.Once that is done, you’ll be able to use GSC and see your search analytics. (You won’t have any data for now since it’s new.)While GSC is irreplaceable for anyone serious about SEO, it is still lacking in some areas. For example, it only offers some data about the keywords your website ranks for and the sites that link to you.To compensate for the lacking areas, you should set up Ahrefs Webmaster Tools (AWT). It’s free and allows you to:Audit your website for 100+ SEO issues (and explain how to fix them).See the websites that are linking to you.See the organic keywords your site is ranking for.See the amount of organic traffic your site is receiving.And more.To use AWT, create a free account. Then add and verify your website. You can use your GSC account to verify too.Further readingHow to Use Google Search Console to Improve SEO (Beginner’s Guide) Create a logical site structureIt should be easy for visitors and search engines to find content on your site. You’ll need a logical hierarchy for your content, which you can sketch out using a mind map:Each brand on the mind map represents an internal link, which is a link from one page on a website to another page. Internal links are crucial for your website because:This is how Google and other search engines find new pages.This is also how Google and other search engines understand what your page is about. They do this by looking at the clickable words in the link, known as anchor text.Internal links help pass PageRank, which is an important Google ranking factor.Further readingBuilding Your Website Structure for Great SEO & UX (5 Steps) Use a logical URL structureOur recommendation is to go for something that’s clear and descriptive, so something like website.com/seo-for-new-website/.Other technical considerationsA positive user experience is important for your business and Google too. You’ll want to make sure you have these things covered:Use HTTPSNobody wants their personal data leaked to hackers. You’ll want to encrypt your site with SSL/TLS. Most decent web hosts should be able to offer this service, or you should be able to enable it yourself with one click.After that, you should see the padlock on your URLs.Here’s what it looks like in Google Chrome:Make sure your site is mobile-friendlyMost people search on mobile these days. Your website should be responsive and work on all devices.You can check this easily using Developer Tools on Google Chrome:Click on the “…” dropdown in the top right corner of the browserSelect More ToolsSelect Developer ToolsClick on the mobile button in the top left cornerFrom here, you’ll be able to select the exact device you want to test for:Avoid intrusive interstitialsInterstitials are full-screen ads that appear before a webpage’s content is loaded. Nobody likes them. Neither does Google. If there’s no need for such pop-ups on your website, avoid them.Make sure your site loads fastPage speed is a Google ranking factor. So it’s definitely important to spend some time making sure your site loads quickly. You can use a tool like PageSpeed Insights to check your page’s performance.5. Start keyword researchYou can’t get organic traffic if no one’s searching for a particular topic. That’s why the first step of any SEO strategy is to find out what your target audience is searching for. This is known as keyword research. The easiest way to begin is to use a keyword research tool. Keyword tools are databases of words and phrases with SEO metrics. They show you a list of ideas based on the seed keyword idea you’ve entered. For example, you can get started with a free keyword research tool like Ahrefs’ Keyword Generator. Enter a single relevant topic and you’ll get up to a hundred keywords back:If you’re looking for more keywords, you can use a professional keyword tool like Ahrefs’ Keywords Explorer. You’ll be able to see the full range of potential topics, plus:Important keyword metrics to help you make better decisions.Filters to narrow down your search to the best, most relevant keywords.For example, using the same seed keyword as above, “coffee,” Keywords Explorer shows us over 3 million keywords.But that’s too many. So, let’s drill down by focusing on keywords that we can actually compete with. We can do this by adding a Keyword Difficulty (KD) filter. We’ll also want to make sure these keywords can send us search traffic, so we’ll want to add a Traffic Potential (TP) filter.Here’s what that looks like:From here, you’ll want to look through the list, pick out those keywords that are relevant, and add them to a keyword list that you can reference. (This can be a simple Google Sheet.)Further readingHow to Do Keyword Research for SEO6. Create pages that are optimized for searchJust like how product managers design products for their target users, we want to do the same for our content too. In this case, we want to create content that appeals to people searching for our topic.Here’s how to do it:Analyze search intentSearch intent is the why behind a search query. In other words, why is the searcher looking for that particular topic?Knowing search intent is important because:Knowing why the searcher is searching means you can create the right piece of content for them.Google also wants to know so it can serve the most relevant results.As a result, by aligning your content with search intent, you can rank higher on Google.We can identify search intent by looking at the top-ranking pages for your topic and figuring out the three Cs:Content type – Are they blog posts, product pages, landing pages, or something else?Content format – Are they tutorials, listicles, how-to guides, recipes, free tools, or something else?Content angle – Is there a dominant selling point, like low prices or how easy it is?For example, let’s say we’re targeting the keyword “how to clean coffee maker.” If we take a look at the SERP overview in Ahrefs…… we can see these:Content type – They’re mostly blog posts.Content format – They’re mostly how-to guides.Content angle – There are a few angles here: “with vinegar,” “better-tasting coffee,” “any kind,” and “in just 30 minutes.”If we want to rank for this keyword, we’ll have to create a how-to guide on cleaning a coffee maker, with a specific angle targeting a unique know-how we have.Further readingWhat Is Search Intent? A Complete Guide for Beginners Cover important subtopicsA product manager may have an idea of what their target users want to see, but they won’t want to assume that they know everything. The same goes for your content too—you won’t want to miss potential subtopics that searchers expect in a piece of content tackling that topic. In this case, we can actually find that out by looking for common keyword rankings among top-ranking pages.Here’s how:Enter your keyword (e.g., “earned media”) into Ahrefs’ Keywords ExplorerScroll down to the SERP overviewSelect three to five top-ranking articles (make sure they’re similar)Click Open in and choose Content gapThis opens up the Content Gap report, which shows all the keywords these pages are ranking for. We’ll want to select the Intersection dropdown and choose the highest two targets (in this example, 4 and 5).You can see that many of these keywords map to subtopics too. For example, searchers want to know:What earned media is. Examples of earned media.Earned media strategies.Other types like paid and owned media.Make it uniqueWhile you want to be inspired by the current top-ranking pages, your goal is not to “copy” everything that’s already on there. After all, if your content is exactly like everyone else’s, there’s no reason to consume yours particularly. So you’ll want to give your audience a reason to read, share, or link to your content. The best way to do this is to make sure your content is unique. Here’s how you can create something unique:Write about something from your personal experience – I wrote about my own journey in this post on becoming a content creator.Interview experts in your field.Crowdsource opinions, expertise, or ideas from multiple experts – We interviewed four link building experts in our post on international link building.Create original research from running studies or surveys – We surveyed 439 people for our post on SEO pricing.Offer a contrarian opinion – We did this when Joshua argued why Google doesn’t care about AI content.Make your content easy to readYour content should be an effortless reading experience for your readers. Follow these tips:Use descriptive subheadings (H2–H6) for hierarchyUse bullets to help with skimmingUse images and GIFs (where needed) to break up the textUse short sentences and paragraphs to avoid “walls of text”Use simple words that everyone can understandWrite as you speak to make things conversationalRead your copy out loud (when editing) to smooth the flowAdd your on-page SEOOn-page SEO focuses on helping Google and searchers better understand and digest your content. Follow these basics:Use the keyword in the title (if possible)Write a compelling meta description that sells your article on the SERPsAdd concise and accurate alt text to your imagesFurther readingSEO Content: The Beginner’s Guide On-Page SEO: The Beginner’s Guide7. Share your website with othersJust because you’ve created your website doesn’t mean people magically discover it. You have to tell others about your new website.Here are some starting tips for promoting your website:Don’t be shy and tell your friends and family – They’ll be supportive. 😄Start building an email list – This will come in handy in the future whenever you publish new content.Reach out to people you’ve mentioned in your content – If you’ve linked to and mentioned any resource in your article, tell the authors! Find their contact details and email or DM them.Join and participate in relevant niche communities – Whether it’s on Reddit, Slack, Circle, or Discord, become an active member in these communities and share your content when relevant (don’t spam!).The above tips look deceptively simple, but they will help to get the word out about your website. There are more ideas to try, of course, but making sure you’re actually promoting your website is more important than the shiny new tactics you can find.Further readingHow to Get Your First 100 Backlinks 13 Content Promotion Tactics to Get More Eyeballs on Your Content15 Easy (And Free) Ways to Promote Your Website8. Tracking your performanceYou’ll want to monitor your results so you can figure out what went right or wrong. The easiest way to do this is to add the keywords you’re targeting to Ahrefs’ Rank Tracker.The tool will track your website’s ranking positions for all the keywords you’ve added. This way, you can easily see how well you’re performing across multiple keywords, and whether you need to make any adjustments to your content.Final thoughts SEO isn’t a set-it-and-forget-it task. But if you follow the above process, you’ll start to get a consistent flow of organic traffic to your site.Any questions or comments? Let me know on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Keep Learning How to Do a Basic Website Audit to Improve SEO and UX (in 10 Steps) Audit your website for SEO performance issues, things that may be costing you conversions, and user-experience issues that could be confusing visitors. What is E-A-T? Why It’s Important for SEO E-A-T- stands for expertise, authoritativeness, and trustworthiness. Some say it's a ranking factor, but is that actually true? On-Page vs. Off-Page SEO: Different but Equally Important The first focuses on impacting SEO factors on a page; the latter focuses on factors outside of a page. Spoiler alert: You need both. Why SEO Is Important: 8 Reasons (And How to Get Started) Want to get into SEO but need a nudge? We share eight reasons why it's important, plus how you can kickstart your SEO journey. How to Do an SEO Audit in 11 Easy Steps (With Checklist) An SEO audit helps you find and fix SEO issues that may be holding your site back. Learn how to do it right with our nifty checklist.",
  "headers": [
    {
      "level": "H1",
      "text": "SEO for a New Website: 8 Important Steps"
    },
    {
      "level": "H2",
      "text": "1. Choose a domain name"
    },
    {
      "level": "H2",
      "text": "2. Choose a website platform"
    },
    {
      "level": "H2",
      "text": "3. Choose a host"
    },
    {
      "level": "H2",
      "text": "4. Setting up for SEO success"
    },
    {
      "level": "H3",
      "text": "Set up Google Search Console and Ahrefs Webmaster Tools"
    },
    {
      "level": "H3",
      "text": "Create a logical site structure"
    },
    {
      "level": "H3",
      "text": "Use a logical URL structure"
    },
    {
      "level": "H3",
      "text": "Other technical considerations"
    },
    {
      "level": "H4",
      "text": "Use HTTPS"
    },
    {
      "level": "H4",
      "text": "Make sure your site is mobile-friendly"
    },
    {
      "level": "H4",
      "text": "Avoid intrusive interstitials"
    },
    {
      "level": "H4",
      "text": "Make sure your site loads fast"
    },
    {
      "level": "H2",
      "text": "5. Start keyword research"
    },
    {
      "level": "H2",
      "text": "6. Create pages that are optimized for search"
    },
    {
      "level": "H3",
      "text": "Analyze search intent"
    },
    {
      "level": "H3",
      "text": "Cover important subtopics"
    },
    {
      "level": "H3",
      "text": "Make it unique"
    },
    {
      "level": "H3",
      "text": "Make your content easy to read"
    },
    {
      "level": "H3",
      "text": "Add your on-page SEO"
    },
    {
      "level": "H2",
      "text": "7. Share your website with others"
    },
    {
      "level": "H2",
      "text": "8. Tracking your performance"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Si Quan Ong"
}