{
  "url": "https://ahrefs.com/blog/seo-content-marketing/",
  "slug": "seo-content-marketing",
  "title": "How to Combine SEO and Content Marketing (The Ahrefs’ Way)",
  "description": "Here's how we combine SEO and content marketing to get hundreds of thousands of search visits each month.",
  "content": "Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents SEO and content marketing are different marketing channels. But you don’t have to choose between them. They’re complementary.In fact, you should combine them for greater effectiveness in your marketing.ContentsWhy should you combine SEO and content marketing?Two main reasons:1. Content marketing and SEO are like peanut butter and jelly—they work well togetherContent marketing is the process of creating and distributing content to attract and retain customers.Here’s how SEO helps content marketing:It tells you what your audience cares about — If you know what they’re searching on Google, you can create the type of content they want to see. This is known as keyword research, a key aspect of SEO.It creates predictable distribution — Sparktoro’s study showed that 63.41% of all US web traffic referrals come from Google. Most of our blog traffic comes from search engines too.SEO is the process of improving a website’s visibility in search engines to get more traffic.Here’s how content marketing helps SEO:It helps you get more search traffic — If you want more search traffic, you need to rank for more keywords, which requires you to make more content.It makes SEO more effective — Thought leadership content acquires backlinks, gated content generates leads, and sales enablement converts traffic into sales.2. The same amount of investment in effort, money, and time can generate results for both content marketing and SEOWe’re the perfect example. Our content ranks high on Google and generates hundreds of thousands of monthly search visitors:It also attracts links and shares on social media because we make sure each piece is unique and not just regurgitation or “AI content”.Finally, each piece of content introduces visitors to our product and educates them on how to use it to solve their problems. (Keep on reading and you’ll see it in action too!)It hits all content marketing and SEO goals at once:Acquires search traffic ✅Builds thought leadership ✅Attracts links ✅Generates sales (over the long-term) ✅How to combine SEO and content marketing (the Ahrefs’ way)How do we do what we do? Believe it or not, there’s a method to the madness. Here’s one line that summarizes our entire SEO content marketing strategy:We create and maintain high-quality, product-led, search-focused content about topics with business potential and search traffic potential.Let me break down how we combine SEO and content marketing:1. Find topics with search traffic potentialIf you want to acquire search traffic, you need to target topics that your potential customers are searching for.The easiest way to find these keywords is to use a keyword tool like Ahrefs’ Keywords Explorer:Go to Keywords ExplorerEnter a few broad keywords related to your site or nicheGo to the Matching terms reportFilter for keywords with traffic potential (TP)Sidenote.Traffic Potential is the estimated monthly organic search traffic to the top-ranking page for a keyword. Since pages tend to rank for many keywords, Traffic Potential is a more reliable estimate than search volume.Go through the report and pick out the keywords that are relevant to your site. For example, if I were an ecommerce store selling coffee equipment, this could be a potential keyword to target:Further readingKeyword Research: The Beginner’s Guide by Ahrefs2. Score each topic’s business potentialA keyword’s business potential is how easy it will be to pitch your product while covering a certain topic. It’s our ‘trade secret’—it’s why we can easily introduce our product and its features in every piece of content we create.Here’s how to score a topic’s business potential:So, taking the above example, the topic “best coffee grinder” would score a “3” (provided we sell coffee grinders) whereas a topic like “does decaf coffee have caffeine” would score a “1” or even a “0”.You should prioritize topics that score high on business potential, i.e. a “2” or a “3”.3. Create high-quality, product-led, and search-focused contentWhat does all of the jargon mean? Let’s break it down.Search-focusedPart one of being ‘search-focused’ is finding keywords that people are searching for. Part two is to figure out why they’re searching for those particular keywords. This ‘why’ is known as search intent.Given that Google’s goal is to always rank the most relevant content, we can look at the search engine results (SERPs) to uncover search intent. Take your target keyword, enter it into Keywords Explorer, scroll down to SERP Overview, and click Identify intents:So, we can see that searchers looking for the keyword “best coffee grinders” want detailed reviews and expert recommendations on the best coffee grinders. Not only that, we can also see that searchers want a list that is fresh.If we’re targeting this topic, making it search-focused means matching this search intent—we’ll need to create a list of the best coffee grinders for the current year.Further readingSearch Intent in SEO: What It Is & How to Optimize for ItProduct-ledProduct-led means ensuring you’re not just creating content for the sake of it; you’re also ‘selling’ your product. You want to be aware of which use case, feature, or service you want to weave into the narrative. Naturally, of course.Scoring a topic’s business potential would have done 90% of the work here. If you’re creating content about a topic that scored a “3”, then your product pitch would be natural. For example, we could easily add links back to our coffee equipment store after covering the best coffee grinders. Or, if we make our coffee grinders, we could pitch them as one of the best. (That’s why I say the business potential score is our secret ingredient.)The challenge comes when you’re covering topics that score a “1” or “0”. It’s not impossible, but you’ll need to be creative.For example, I recently covered the topic “SEO specialist”. It had a business potential of “1” and was tough to include a product pitch. Fortunately, I noticed that some job listings asked for experience with different SEO toolsets (including us.) It was the perfect segue to introduce our product and certification course.Further readingProduct-Led Content: What It Is, Why Use It, and How to Get StartedHigh-qualityThis is subjective. Everyone’s standards are different. But here’s how we think of quality:Accurate — No hype, no lying. Every statement we make should be as accurate as possible.Clear — No fluff—delete all unnecessary words and sentences. Use jargon only when needed. When necessary, create illustrations to expand on ideas and concepts.Helpful — Being product-led is important but the content should not just be aimed at pitching. The content should be focused primarily on helping visitors solve their problems, while creatively weaving our product into the context.Unique — One way to make your content unique is to have skin in the game—conduct experiments, run data studies, and write from personal experience. If having skin is difficult, then interview practitioners. Focus on did, not could.something i always look for when assessing the credibility of writing:could/should/did~ could: most writers talk about things you, the reader, could do. theoretical. abstract. based on no firsthand experience. should probably be disregarded. prime “content marketing”…— Ryan Law (@thinking_slow) December 6, 2023 Further readingHow To Stand Out in an Ocean of AI Content4. Maintain high-quality, product-led, search-focused contentThe deterioration of your content is inevitable:Search-focused — Your rankings may drop because of competitors. Or you didn’t even rank the first time round. Or your target topic’s search intent changed (e.g., the word corona’s search intent changed during the void years of 2020-2022.)Product-led — You may have new features, services, or use cases to introduce. Or your team has depreciated certain features or abandoned some services.High-quality — Statements may become inaccurate over time. Or your unique idea was so successful that everyone else copied you (and outranked you.) Or you might have better ways to reword sentences and paragraphs. Or just simply the ideas, screenshots, and content has become outdated.That’s why you don’t build a train track and disappear. You have to actively maintain it to keep it working. (I’m looking at you London tube.) Same goes for your content.The way to maintain your content is to conduct regular content audits. We do this every quarter—Each writer on our blog team goes through their portfolio of articles and selects at least three pieces to update. Each writer may also choose a couple to do a full rewrite.I highly recommend going through our content audit template so you can see what went wrong with your content and what to do with it next.Further readingFollow Our Content Audit Process (Template Included)Final thoughtsSEO and content marketing may be different marketing types, but that doesn’t mean you need to do one to the exclusion of the other.Both channels are highly compatible and as you see above, can be designed as an entire strategy that hits all important marketing objectives. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Keep Learning How to Combine SEO & Content Marketing for Amazing Results Learn to strategically combine the two to maximize your results, including increased traffic + conversions. Why Is Content Marketing Important? 7 Reasons to Start Content Marketing Here are seven reasons why content marketing is important and deserves to be the marketing channel you should focus on. 25 Types of Content You Can Use for Content Marketing In content marketing, there are heaps of options to pick from. To make it easier, we've curated 25 types for your choosing pleasure. Content Marketing ROI: How to Put a $ Value on Content 3 quick and easy ways to prove the value of your content. Content Marketing for SaaS: The Ahrefs Guide Learn how we at Ahrefs, a SaaS company, do our content marketing.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Combine SEO and Content Marketing (The Ahrefs’ Way)"
    },
    {
      "level": "H2",
      "text": "Why should you combine SEO and content marketing?"
    },
    {
      "level": "H3",
      "text": "1. Content marketing and SEO are like peanut butter and jelly—they work well together"
    },
    {
      "level": "H3",
      "text": "2. The same amount of investment in effort, money, and time can generate results for both content marketing and SEO"
    },
    {
      "level": "H2",
      "text": "How to combine SEO and content marketing (the Ahrefs’ way)"
    },
    {
      "level": "H3",
      "text": "1. Find topics with search traffic potential"
    },
    {
      "level": "H3",
      "text": "2. Score each topic’s business potential"
    },
    {
      "level": "H3",
      "text": "3. Create high-quality, product-led, and search-focused content"
    },
    {
      "level": "H4",
      "text": "Search-focused"
    },
    {
      "level": "H4",
      "text": "Product-led"
    },
    {
      "level": "H4",
      "text": "High-quality"
    },
    {
      "level": "H3",
      "text": "4. Maintain high-quality, product-led, search-focused content"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Si Quan Ong"
}