{
  "url": "https://ahrefs.com/blog/seo-freelancer/",
  "slug": "seo-freelancer",
  "title": "How to Become an SEO Freelancer - Lessons Learned from 10+ Years in the Industry",
  "description": "Whether you want to become an SEO freelancer full-time or pick up extra experience and cash on the side, this guide is for you.",
  "content": "Nick LeRoy Freelance SEO consultant @ Nick LeRoy Consulting. Author of the The SEO Freelancer newsletter Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Back in April 2020, when COVID-19 started claiming jobs, I received notice that my job would be eliminated in 30 days.After looking for a new job and attending six rounds of interviews, it finally dawned on me: Full-time SEO freelancing was a real option for me.The reason I say ‘full-time’ is because I’ve been freelancing part-time since 2010. From the graph below, you can see that this helped supplement my income, but only when I started freelancing full-time did my income skyrocket. While I’d rather not show exact numbers, the amount is in the five figures per month range. During my eight months freelancing full-time, I made 150% more than my old annual salary.So whether you want to go out on your own full-time or pick up extra experience (and cash), this article is for you.Why consider freelancing?I started freelancing back in 2010 to supplement my income from my regular 9-5, but there are many other reasons you might want to go out on your own. Here are the most obvious ones:More freedomIncreased incomeBetter work/life balanceExperience in industries and or platforms you may not have worked in beforeI’ve personally experienced all of those benefits, but the improved work/life balance is perhaps the most significant positive for me. You’ll notice below that my total hours since moving to full-time freelance have actually decreased. That’s because all my freelance hours are billable and not wasted in back to back meetings like in my old “9-5.”Beyond the obvious reasons above, there are a few other reasons to go freelance that rarely get talked about.Low barrier to entryNo more 9-5Infinite career growthComplete control 1. Low barrier to entryUnlike many other entrepreneurial adventures, freelancing in SEO doesn’t have to be insanely expensive. Sweat equity goes a long way in the SEO industry. In fact, the list below accounts for 90% of the tools I use in my freelancing services.Keyword research & link analysis tool – $99/mWeb crawling/diagnostics tool – I use ScreamingFrog ($193/annually)—but you could use Ahrefs’ Site Audit to save on this cost.Accounting software to track income, expenses, invoicing, etc. – I use QuickBooks for $50/m.Proposal software – I use Prospero for $8/m.Time tracking software - I use Harvest for $12/m.Google Analytics & Google Search Console - FreeFor under $200 per month, you can set yourself up with the tools it takes to crush the search results. The best part is that you don’t even need to invest this money until you already have revenue coming in the door. 2. No more 9-5When I went freelance full-time, I struggled with the idea of not working 9-5. Despite getting my work done, it felt like I was doing something wrong by not sitting at my desk. This is a habit that working 10+ years for someone else has instilled in me.If you get your work done and are available to your clients during business hours, it doesn’t matter if you’re sitting at your desk or playing golf at any hour of the day. 3. Infinite career growthI’ll never forget the conversations that I had with various leaderships about promotions and raises. It always seemed that you needed to do more, earn more revenue, train more junior employees. Only then (if they agreed) would you get rewarded with a promotion and or raise. Don’t rely on other people to advance your career and or earnings. Going freelance full-time allows you to own 100% of your growth and income. 4. Complete controlHow many times have you worked on a project you disagreed with? Have you ever sacrificed your ethics because your boss/company told you to? You get this all back freelancing full-time. Don’t get me wrong, freelancing full-time isn’t all sunshine and rainbows, but you’re in control. You decide who you will work with, for what amount of money, and what level of work you will commit to executing. This, for me, was a critical need after too many years working for others.How to become an SEO freelancerSEO freelancing is simple on the face of it. You learn SEO, find clients, and charge them money for your services. But as with all things in life, it’s the execution that matters—and this isn’t always straightforward. Below, I’ll share eight lessons learned from 10+ years in the industry to help get your freelancing business off on the right foot.Build up your networkGet your books in orderBe confident in your pricingEffective communication is keyCreate your own websiteCreate assets to support your pipelineGet found onlineKnow your role Lesson #1. Build up your networkWhen I went freelance full-time, the first thing I did was create a spreadsheet with all my contacts in the industry. I then identified ten people from this list that I might be able to call in a favor from or outright pitch my services. I sent ten emails explaining my newly minted business. This led to many phone calls and additional email strings. Some of these folks had work for me, some didn’t, but everyone had advice that was both encouraging and terrifying but equally valuable.Today a lot of my work continues to come from client referrals and people in my network. You’d be surprised how many agencies need help with their overflow work. So while I don’t suggest you go to simply any networking event available, I do highly recommend that you start to get to know people in your industry and start building relationships. Not only could it lead to business in the future, but you never know when you might be able to ping them for help yourself.Recommended Reading: 11 Slack Communities for SEOs and Digital Marketers Lesson #2. Get your books in orderI was terrified as a fledgling freelancer that I wouldn’t be able to afford an accountant. I started stressing out about my tracking of expenses and withholding the appropriate amount of taxes. I finally reached out to an accountant someone referred to me. The first thing he had me do was re-classify as an S-Corp. The tax savings from that easily paid for his services. If you’re considering full-time freelance (or even part-time), get yourself a good accountant. Lesson #3. Be confident in your pricingIn the beginning, I took work at half of my standard rate. It ended up costing me money as I had to turn away full-price work as I got busier. While you’ll naturally flex your rates up (if it’s a project you’re not super excited about) or down (if it’s something you are really excited about), I highly recommend that you not take on any work at a rate you’ll regret in the future.Not sure what your rate should be? In 2018, Ahrefs surveyed the SEO industry and found that $100-$150 is the most common hourly rate. If you’re considering pricing your services on a per-project or monthly retainer basis, check out the full SEO pricing study below.Recommended Reading: SEO Pricing: How Much Does it Cost? [industry research] Lesson #4. Effective communication is keyI like to consider my “people skills” to be one of my strengths. However, I messed up when I first went out full-time and cost myself a $10K project. I had a client read my article on the importance of web migrations and reach out for a consultation. He verbally committed to working with me on his upcoming project, fully understanding I wasn’t the cheapest option but that he wanted it done correctly. He also mentioned that he was talking to an overseas SEO firm for ongoing consultation. I bluntly shared some of my concerns with his approach and the budget he was looking to invest monthly. I offended him. Guess what? He never called me back when it came to migrating his website. While I don’t regret being transparent, I could have taken a different approach and still landed the project. Lesson Learned.Recommended Reading: Effective Communication as an underrated SEO skillset Lesson #5. Create your own website todayI highly recommend building out a website for your brand. As Tom Hirst tweeted, your personal website is your 2020+ resume. If you don’t have a website, how can people learn more about you, see the type of services you offer or even examples of the success you’ve obtained? Your personal website is your 2020 resume.— Tom Hirst (@tom_hirst) September 1, 2020Get creative with your website. While you should always work on making it better, don’t allow it to prevent you from taking action. Get something live today.Recommended Reading: Auditing your website for SEO and UX Lesson #6. Create assets to support your pipelineBack in 2016, I started writing the weekly SEO newsletter #SEOForLunch. It was always my intention to give back to the community that had given me so much. However, deep down, I also knew that it was my insurance policy. I wasn’t fulfilled by my previous agency gigs and craved the ability to go out on my own. I knew that if I built an email list that someday I could tap into it when I decided to freelance full time—and this is exactly what I did this year. Some of my best projects have come from valued readers who have been subscribers for years.Recommended Reading: 7 Digital Marketing Strategies That Actually Work Lesson #7. Be found onlineYou don’t need a high Domain Rating (DR) website or newsletter with thousands of subscribers to get work as an SEO freelancer. You do, however, need to get found online. Your service offering is to get your customers found online, and if THEY can’t find YOU online, it might be an uphill battle closing deals.You might ask yourself, “where/how can I start”? My answer to that question is by publishing on other websites. Similar to how Ahrefs is allowing me an opportunity to write this post, you can reach out to the dozens of SEO/digital websites to contribute your knowledge.This is not the time to be spammy. You are looking to provide real value and associate your knowledge with your name. Remember that site migration lead I lost that I spoke about? That came from a post published on Search Engine Land with a massive audience. I simply sent their editorial team an email with the idea that I wanted to write about. After a few drafts, I was published. Don’t overthink it. Make it easy for others to help you by providing them amazing content. It truly is a win/win for everyone involved.Recommended reading: Guest Blogging for SEO Lesson #8. Know your roleUnlike your 9-5 job, going freelance full-time will require you to wear multiple hats: Project Manager, Executioner, and Entrepreneur. You’re already used to the “executor” role from your 9-5, but are you ready to be the project manager and entrepreneur too? Admittedly freelancing on the side for ten years gave me a big head start. I was already aware of the need to be the sales guy, the bookkeeper, and the PM. Admittedly, I’m not the most organized person, and this is where I double down. If you want to be successful as a part-time or full-time freelancer, you must know what’s on your plate, establish deadlines and meet these due-dates. No exceptions.Final thoughtsWhether you are looking to add experience to your portfolio or extra dollars to your pocket, freelancing is something I recommend everyone try. As long as you provide a good service, communicate effectively and meet your deadlines, I’m confident you’ll find yourself having a lot of success. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Keep Learning I Replaced Google with AI For a Week. Here’s What I Learned Can you really replace Google with something else, like AI? I decided to find out. SEO Salary Survey 2023 [Industry Research] How much do SEOs earn? I wanted to know, so I ran a survey at Brighton SEO and asked 111 attendees what they earned. How To Become an SEO Expert in 4 Steps Looking to become an SEO specialist but how no clue where to start? Go from SEO newbie to SEO pro in four simple steps. How to Become an SEO Lead (10 Tips That Advanced My Career) Ten proven (and personal) tips to help you climb the SEO career ladder. I Analyzed 52 SEO Specialist Job Listings. Here’s What They Do and How You Can Become One SEO specialists are responsible for improving a website’s visibility in organic search results. But what exactly do they do? I Analyzed 52 SEO Manager Job Listings. Here’s What They Do and How You Can Become One SEO managers are responsible for developing the strategy to improve a website's search visibility and organic traffic. But what exactly do they do and what skills and qualifications do they need?",
  "headers": [
    {
      "level": "H1",
      "text": "How to Become an SEO Freelancer - Lessons Learned from 10+ Years in the Industry"
    },
    {
      "level": "H2",
      "text": "Why consider freelancing?"
    },
    {
      "level": "H3",
      "text": "1. Low barrier to entry"
    },
    {
      "level": "H3",
      "text": "2. No more 9-5"
    },
    {
      "level": "H3",
      "text": "3. Infinite career growth"
    },
    {
      "level": "H3",
      "text": "4. Complete control"
    },
    {
      "level": "H2",
      "text": "How to become an SEO freelancer"
    },
    {
      "level": "H3",
      "text": "Lesson #1. Build up your network"
    },
    {
      "level": "H3",
      "text": "Lesson #2. Get your books in order"
    },
    {
      "level": "H3",
      "text": "Lesson #3. Be confident in your pricing"
    },
    {
      "level": "H3",
      "text": "Lesson #4. Effective communication is key"
    },
    {
      "level": "H3",
      "text": "Lesson #5. Create your own website today"
    },
    {
      "level": "H3",
      "text": "Lesson #6. Create assets to support your pipeline"
    },
    {
      "level": "H3",
      "text": "Lesson #7. Be found online"
    },
    {
      "level": "H3",
      "text": "Lesson #8. Know your role"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Nick LeRoy"
}