{
  "url": "https://ahrefs.com/blog/seo-monitoring/",
  "slug": "seo-monitoring",
  "title": "SEO Monitoring Explained: Best Free Tools to Get Started",
  "description": "SEO monitoring helps ensure your website stays away from major technical issues and requires just two free tools to get started.",
  "content": "Mateusz Makosiewicz Marketing researcher and educator at Ahrefs. Mateusz has over 10 years of experience in marketing gained in agencies, SaaS and hardware businesses. When not writing, he's composing music or enjoying long walks. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents SEO monitoring is about regularly checking your SEO performance and making sure your website is free from major technical issues.Monitoring key aspects of SEO is important because it allows you to react to things that can impact your visibility in search engines, such as declining keyword rankings. This article will help you understand what’s worth monitoring on your site regularly and how to do it using only free tools.ContentsThe only two free tools you need The tools you will need are Google Search Console (GSC) and Ahrefs Webmaster Tools (AWT). Both tools are free for website owners. Google Search Console is one of the essential tools in SEO. It features data straight from Google, so many SEOs believe it’s the most accurate source for some metrics, such as organic traffic.While being an indispensable tool for SEO, GSC is not perfect. It shows limited data for keywords, backlinks, and SEO issues. Fortunately, AWT is a great tool to fill GSC’s data gaps.What to monitor in SEO (and how)To get started with monitoring your SEO, you’ll need to track these:Organic traffic Keyword rankings Backlinks Selected technical issues Here’s why and how. Organic search trafficOrganic traffic refers to the clicks you get from search engine results pages (SERPs) when you rank for keywords searchers use. The higher you rank, the more traffic you can get. It’s the most high-level metric in SEO; most SEO tactics aim to increase it. You need to track organic search traffic to understand whether your SEO efforts are working. How to check Use Google Search Console. Note that you need to open GSC (or create an account if you don’t have one).Go to Search results report (“Performance” section) Set a time range and make sure your data is set to Web The Clicks metric is your organic search traffic You can also see the same traffic data in AWT if you link your GSC account. The benefit here is that you will be able to see data past GSC’s 16-month limit. Pro TipSome SEOs and content marketers monitor conversions from organic traffic to see which pages have the biggest impact. It’s not something everyone does because the buyer’s journey for content can be too complex to properly attribute to a single article or even a set of articles. If you want to track conversions from organic traffic, you can do that for free using Google Analytics or its free alternatives like Matomo.Further readingHow to Increase Organic Traffic: 12 Tried & Tested Tips Keyword rankingsKeyword ranking is the position a page ranks for a given keyword on the SERP.You need to track keyword positions because when they go down, you lose traffic. You don’t need to track rankings for all of your keywords, though. You just need to track target keywords for all important pages. You also need to know when they go up because that probably means your SEO is working. How to checkYou can use GSC or AWT. Google Search Console will limit your data to 1,000 keywords (or 5,000 through API) and 16 months of data history. On the other hand, your keyword data is updated daily.Ahrefs Webmaster Tools has no limits for keywords, backlinks, or data history. It’s easier to navigate and, on top of rankings, you get access to SEO metrics related to your keywords (for example, search volume or Keyword Difficulty). Data updates depend on the popularity of the keyword and your site. If you’re using Google Search Console, you can: 1. Go to the Search results report and set up a new filter for the exact query you want to check. You will be able to see only one query at a time. 2. Enable the Average position metric. If you’re using Ahrefs Webmaster Tools: 1. Go to your Dashboard and click on the Organic keywords card.2. The tool will take you to Site Explorer where you can see your keyword rankings (“Position” column), which pages rank (“URL” column), and how fresh the data is (“Updated” column). 3. To get a list of only your most important keywords, plug them into the Keyword filter. Make sure to set “is” and “any” modes.Further readingHow to Rank Higher on Google (10 Steps)Referring domains Referring domains are the unique websites pointing to your site. Monitoring them is the best way to see whether your link profile is growing. A growing link profile means that your site is gaining authority, which can help your pages rank higher. How to check Use Ahrefs Webmaster Tools. You can:1. Go to your Dashboard.2. Access the Backlinks card, which gives you a quick insight into backlinks growth. 3. Click on the card to get more data (if you need it).4. The tool will take you to Site Explorer, where you can see all backlinks from the domains, Domain Rating (DR), and other related data. You should aim to build as many or more links than your competitors to increase your chances for ranking. Read our Link Building for SEO: The Beginner’s Guide to learn how.Technical SEO issues Technical SEO issues refer to possible problems Google may have with finding, crawling, indexing, and understanding your site. Monitoring for technical issues matters because it allows you to find and fix errors that can hurt your rankings.NoteSome issues can have a bigger impact than others (especially these nine issues). Your site may have some lesser issues (such as missing image alt text) and still rank high.How to check Use Ahrefs Webmaster Tools to monitor for serious technical issues, i.e., errors. You can:1. Open AWT and go to Site Audit. 2. Click on Errors in the “Issues distribution” card. 3. Go to the issue list, then click on the question mark next to the error and follow the instructions. To keep your site in good technical health, schedule regular crawls in AWT and fix the most pressing issues. What NOT to monitor in SEO (and why) Here are some popular metrics used in SEO that, in our opinion, are not worth regularly monitoring. That said, they may be useful in other situations. Domain rating – Refers to the relative strength of your backlink profile. It’s a useful proxy for a quick assessment of other sites (for example, for link building) but not very useful for consistent monitoring on your own site. Click-through rate – Refers to the proportion of page impressions on the SERPs that turned into clicks (available in GSC). It’s too confusing as a sitewide metric, but it can be helpful only when checked on the page level. Also, a low CTR doesn’t necessarily mean there’s something wrong with a given page (SERP features and ads can take away clicks). Engagement metrics – Especially bounce rate, engagement rate, dwell time, time on page, and session duration. They are either irrelevant to SEO or unreliable for analyzing content.Further reading12 SEO KPIs You Should (And Shouldn’t) Track Final thoughts You can do a lot with AWT and GSC. But there are some aspects of SEO monitoring that only premium SEO tools can do.Thorough rank tracking – A premium rank tracker unlocks ranking data for different locations and mobile devices. Monitoring progress is easier with access to ranking history and a special competitor report. You also get access to the share of voice functionality, which can make a more useful KPI than particular keyword rankings. Competitive analysis – With a tool like Ahrefs’ Site Explorer, you can get an insight into your competitors’ SEO strategy by seeing which keywords they rank for and how they earn backlinks. Email alerts – A feature you can also find in tools like Ahrefs that lets you set up notifications when a competitor’s site ranks for new keywords or gets new backlinks (watch short demo). You can also get notified of mentions of your brand and products.Got questions or comments? Ping me on X. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Mateusz Makosiewicz Marketing researcher and educator at Ahrefs. Mateusz has over 10 years of experience in marketing gained in agencies, SaaS and hardware businesses. When not writing, he's composing music or enjoying long walks. Keep Learning The Only 2 Free SEO Audit Tools You Need Can you do an SEO audit with free tools? We think you can do a pretty good one using just two. The Only 3 Keyword Monitoring Tools You Need We share the three keyword monitoring tools you’ll need to do SEO and work on PR and social media management. What Are the Benefits of SEO? (And How to Get Started) Having good SEO is a major asset to a business. Learn the importance of SEO and why every business should start focusing on this. Why SEO Is Important: 8 Reasons (And How to Get Started) Want to get into SEO but need a nudge? We share eight reasons why it's important, plus how you can kickstart your SEO journey. 34 Free SEO Tools for DIY SEOs Looking for free SEO tools? These are the 36 that you need.",
  "headers": [
    {
      "level": "H1",
      "text": "SEO Monitoring Explained: Best Free Tools to Get Started"
    },
    {
      "level": "H2",
      "text": "The only two free tools you need"
    },
    {
      "level": "H2",
      "text": "What to monitor in SEO (and how)"
    },
    {
      "level": "H3",
      "text": "Organic search traffic"
    },
    {
      "level": "H4",
      "text": "How to check"
    },
    {
      "level": "H3",
      "text": "Keyword rankings"
    },
    {
      "level": "H4",
      "text": "How to check"
    },
    {
      "level": "H3",
      "text": "Referring domains"
    },
    {
      "level": "H4",
      "text": "How to check"
    },
    {
      "level": "H3",
      "text": "Technical SEO issues"
    },
    {
      "level": "H4",
      "text": "How to check"
    },
    {
      "level": "H2",
      "text": "What NOT to monitor in SEO (and why)"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Mateusz Makosiewicz"
}