{
  "url": "https://ahrefs.com/blog/seo-reporting-for-agencies/",
  "slug": "seo-reporting-for-agencies",
  "title": "SEO Reporting for Agencies (With Real Report Examples)",
  "description": "How to build better reporting processes (and earn happier clients).",
  "content": "Chris Haines Chris is an SEO director who has 10 years of experience in SEO, agency side. When not involved in SEO, he enjoys messing around with vintage synthesizers, walks on sandy beaches, and a good cup of tea. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents SEO agencies obsess over their SEO reporting process. It’s their main method to share their achievements with their clients. Without it, clients could be left in the dark about their SEO progress—and trust me, you don’t want that.In this article, I’ll share the structures of some real-world agency reports that have been shared with me and how different size agencies approach SEO reporting.ContentsSEO agencies juggle multiple clients, so time spent on a fixed task like reporting can quickly add up.For example, let’s say your agency has five clients and spends two hours per month on the entire SEO reporting process.That’s over one day per month just spent on SEO reporting.For this reason, as an agency owner, you want your clients to be high-paying with standardized reporting deliverables, but this is often far from reality.And it can often look something like this:And often, the higher the budget, the more tailored your reporting becomes.Let’s face it: An enterprise client probably won’t be impressed by a basic PDF report you generated in 10 seconds using a third-party tool if they’re paying $XX,000 per month.Likewise, a client paying $1000 per month would probably not know where to start if you gave them a 60-page SEO report and hooked them up with a Tableau dashboard.So, based on this, we can say that there are two main types of client reports:Small-medium business (SMB) SEO reportsEnterprise businesses’ SEO reportsBut before we discuss the details, let’s explore the main differences between SMB and enterprise SEO reporting.ElementSmall-medium business (SMB) SEO reportingEnterprise business SEO reportingScopeUsually, one domain in one business categoryCan have multiple domains, multiple territories, and multiple business categoriesTarget audienceSite owners, marketing teamMarketing team, development team, senior stakeholders, other teamsKPIsROI, website traffic, conversions, leadsDifferent teams may have different KPIs for SEORecommendationsHigh-impact changes that are easy to implementIncremental changes that provide long-term growth1. SMB SEO reportingIn my experience, SEO reporting for SMBs usually consists of three elements:SEO dashboards – Allows the client to check their SEO performance or KPIs at any time—usually fully automatedSEO report – Periodic update on the total SEO campaign, usually monthly. Focuses on commentary and insights, and the format of the report can varyPresentation – Often, a video call with the client to run through the report and get feedback on the SEO performanceSidenote. Sometimes dashboards and SEO reports are combined, creating a hybrid format.SEO dashboardsAgencies can automate their SEO reporting easily by using a free and easy-to-use solution like Google Looker Studio (GLS).With Google Looker Studio, there are three options:OptionDifficultyTime investmentSet up your own dashboardMediumTime-consumingUse existing templatesEasyLess time-consumingUse Ahrefs GLS templatesEasiestMinimumIf you don’t want to create your own dashboards, we’ve done the hard work for you and have three Google Looker Studio connectors that pull the best bits from Ahrefs.Site Explorer connectorRank Tracker connectorSite Audit connectorIf you aren’t confident with APIs, this is one of the best ways to get data out of Ahrefs so your clients can see it without time-consuming manual reporting.SEO reportsSEO reports for SMBs are usually a document that gives a periodic update on a website’s performance.So what’s normally included in an SMB SEO report? In my experience, it can cover some or all of the following topics—depending on the focus of the client.Tip If your agency is working with an SMB, the easiest way to get started with SEO reporting is to use a simple, free template like our updated SEO report template and tweak it to your client’s exact requirements.Not sure how to tweak it? Here are some real SEO agency report structure examples you can take inspiration from.SEO agency report structure #1With this report a lot of the detail was in the organic visibility section, where it split out visibility by sector.Also interestingly, it detailed the links acquired during the month for the agency in a classic link report—at the enterprise level, this is less common as enterprise clients acquire links all the time without lifting a finger.SEO agency report structure #2This is a delivery-focused report. The “impact analysis” section is interesting as it details the impact that their landing page optimization work has had, concluding with two growth figures.This is a good way to communicate to the client the value of the work you are doing.PresentationClients like to have their say when it comes to the SEO calls—after all, they’re paying for it. For SMBs, ensuring they get a good ROI is usually top of their minds.At an SMB level, the agency should be able to provide a comprehensive assessment of the SEO status of the website and get feedback from the client.For most SMB clients, the usual format is this:Weekly status update callMonthly report call following delivery of the monthly reportIn my experience, it rarely deviates from this format.2. Enterprise SEO reportingThe first rule of enterprise SEO reporting is that there are no rules. So, generally speaking, what the client wants, the client (usually) gets.Here are a few examples of scenarios that can happen when enterprise clients come on board at your agency and start talking about SEO reporting:“We already have our own in-house report. You can use our template [sends you horrible looking template].”“Our old agency had this report, can you do something similar?”“We want dashboard reporting so we can monitor results in real-time.”“Integrate your SEO reporting with our existing tools.”“We want the SEO report to be integrated with PPC.”“We want SEO to be included in a regular performance report.”As enterprise SEO reporting is often just a chapter of the bigger performance marketing report, the SEO section has to be tailored to exactly what the client wants, with zero fluff.SEO dashboardsWhen it comes to dashboard reporting, enterprise clients will usually expect a Tableau, PowerBI, or a custom-built solution, plus some data from Google Looker Studio.Here’s a snapshot of what that can look like:I used Tableau when I was working with enterprise clients and found it hugely useful for SEO reporting.SEO reportsThe deliverables for enterprise SEO reports are broadly the same as those for SMB reports, but as always, the devil is in the details.In short, there’s usually:More personalization to the client’s businessMore tools used – Rather than having one or two trusted tools for SEO reporting, a “big six” agency will have access to most, if not all, of the best enterprise SEO tools in the marketMore reports created and shared with different teamsHere are three examples of enterprise SEO reporting for inspiration.Media agency report structure #1This report example shows that it’s mostly focused on performance and technical SEO. This agency report had a separate content report that they shared with the content team.Media agency report structure #2In this example, the client already had Tableau and Google Looker Studio dashboards set up and got most of their data from these two sources.The report was created to communicate SEO activity within the business and educate stakeholders about its value.As you can see, the focus of this report was organic performance, technical SEO, competitor performance, and dissuading clients from self-sabotage (AMP).Another thing to notice: there is no executive summary.The client just wanted to drop straight into the organic performance, and this was a screenshot directly from a Tableau dashboard with commentary.This client operated in ~20 major international markets and needed a summary of the most important movements within those markets.This report was mainly used to educate other stakeholders on SEO’s benefits and gain buy-in for further SEO improvements to the website. The “industry updates” section helped to do this.Media agency report structure #3Although reporting with a spreadsheet may seem archaic to some, it was what this enterprise SEO client had always done—and they weren’t prepared to change.In this example, the spreadsheet report was a weekly requirement, and the client also requested a monthly and quarterly report in slide format.PresentationPresenting your reports to enterprise clients is a big deal, and you’ll often present your findings to more than one team during the month.Here are three examples of the reporting presentation schedules that I had with some of my previous clients. As you can see, a single report or dashboard is rarely enough for most enterprise SEO clients.Client 1Daily performance reports on core KPIs from Adobe Analytics/GA 360 with a call if necessaryWeekly commentary update with SEO performance highlights using Ahrefs, Pi Datametrics, GSC, and other toolsWeekly performance call to discuss performance for the weekBi-weekly call with the development team to discuss priorities, notes written up using Confluence and Jira tickets submittedMonthly multi-channel performance report slides presented in person to highlight key wins and discuss strategyClient 2Weekly report with call notes taken on Trello for the marketing teamWeekly report spreadsheet, data from Adobe Analytics, discussed in callMonthly multi-channel performance report in person or video callQuarterly business review in person to discuss strategyClient 3Weekly call with notes written on Confluence and submitting JIRA tickets for development requestsMonthly report using slides and presented through video callFinal thoughtsThe type of SEO reporting an agency delivers usually depends on your client’s budget. At SMB level, it’s easier to standardize elements of SEO reporting, but at enterprise level, sometimes you have to throw your trusty templates out the window and start from scratch. As every client is different, their reporting needs will differ too.SEO reporting is an art for many SEO agencies. Do it well, and clients will give even poor-performing SEO campaigns a second chance. But do it badly, and you’ll almost certainly get the chop when it comes to contract renewal time.Got more questions? Ping me on X. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Chris Haines Chris is an SEO director who has 10 years of experience in SEO, agency side. When not involved in SEO, he enjoys messing around with vintage synthesizers, walks on sandy beaches, and a good cup of tea. Keep Learning Franchise SEO: Local and National Growth Strategies for Franchises Franchise SEO is basically local SEO multiplied by the franchise's number of locations, right? Wrong! Guaranteed SEO Services: Here’s the Only SEO Guarantee That’s Not a Scam SEO guarantees are usually scams or promise results that are achieved unethically. But there's one legit type. 26 Women and Nonbinary SEO Pros Who Inspire Me Here are the amazing women and nonbinary folks in our industry who I have learned from and who continuously inspire me in my career. Automated SEO Reporting (The Easy Way) Automate 90% of your reporting workflow without any hassle. I Analyzed 52 SEO Manager Job Listings. Here’s What They Do and How You Can Become One SEO managers are responsible for developing the strategy to improve a website's search visibility and organic traffic. But what exactly do they do and what skills and qualifications do they need? How to Do a SERP Analysis Want to know how to do a SERP analysis? In this article, learn how to use SERP analysis to outrank your competitors.",
  "headers": [
    {
      "level": "H1",
      "text": "SEO Reporting for Agencies (With Real Report Examples)"
    },
    {
      "level": "H2",
      "text": "1. SMB SEO reporting"
    },
    {
      "level": "H3",
      "text": "SEO dashboards"
    },
    {
      "level": "H3",
      "text": "SEO reports"
    },
    {
      "level": "H4",
      "text": "SEO agency report structure #1"
    },
    {
      "level": "H4",
      "text": "SEO agency report structure #2"
    },
    {
      "level": "H3",
      "text": "Presentation"
    },
    {
      "level": "H2",
      "text": "2. Enterprise SEO reporting"
    },
    {
      "level": "H3",
      "text": "SEO dashboards"
    },
    {
      "level": "H3",
      "text": "SEO reports"
    },
    {
      "level": "H4",
      "text": "Media agency report structure #1"
    },
    {
      "level": "H4",
      "text": "Media agency report structure #2"
    },
    {
      "level": "H4",
      "text": "Media agency report structure #3"
    },
    {
      "level": "H3",
      "text": "Presentation"
    },
    {
      "level": "H4",
      "text": "Client 1"
    },
    {
      "level": "H4",
      "text": "Client 2"
    },
    {
      "level": "H4",
      "text": "Client 3"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Chris Haines"
}