{
  "url": "https://ahrefs.com/blog/serps/",
  "slug": "serps",
  "title": "What are SERPs? Search Engine Results Pages Explained",
  "description": "Search Engine Results Pages (SERPs) are the pages that Google and other search engines show in response to a user's search query.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Search Engine Results Pages (SERPs) are the pages that Google and other search engines show in response to a user’s search query.They’re made up of organic and paid search results.In this guide, you’ll learn:Why SERPs matter for SEOHow to get in the SERPsWhat SERP features there are (and how you can appear in them)Why SERPs matter for SEOMost people click organic results on the first page of the SERPs and rarely visit page two.This is why everyone wants to rank on the first page of Google. If you’re on page two or beyond, you’re practically invisible.But ranking on the first page doesn’t always equate to lots of traffic for a few reasons.First, most of the organic clicks go to the first few positions.Second, paid results often push the organic rankings down in the SERP.For example, Google shows four paid ads above the organic results for “buy eyeglasses online.” Because of this, 39% of all clicks go to paid results.Third, Google sometimes shows SERP features that answer the query in the search results.Just take a look at the results for “most searched thing on Google”:Because Google answers the question in the SERP, there’s no need for searchers to click on a result.How to get in the SERPsSERPs may look different for each query, but they’re all made up of the same three building blocks. These are:Paid adsOrganic resultsSERP featuresBelow, we’ll walk through each of these in detail, and explain how you can show up there.Paid adsPaid search results appear before, and sometimes also after the organic results.Both types of results are virtually indistinguishable, the only real difference being that paid ads are marked as such.Paid ads work on a Pay-Per-Click (PPC) basis, meaning that advertisers bid on keywords and pay Google for each click. The highest bidders generally receive prime placement, although Google also takes other factors like the relevance of the ad and CTR into account.Bottomline: If you want to appear in paid ads, you’ll have to dig into your piggy bank.Organic resultsOrganic search results are pages from Google’s index.Because there are often thousands of matching results, Google sorts them using hundreds of ranking factors. As a result, the most relevant and high-quality pages generally end up on the first page of the SERPs.Nobody knows all of Google’s ranking factors, but we do know some of them.For example, we know that the number of backlinks to a page is important.In terms of how Google displays organic results, they usually show the title, URL, and a descriptive snippet.You can tell Google what to display in the SERP by setting the page’s title tag, URL slug, and meta description.However, while Google almost always shows the hardcoded title tag in the SERP, it often chooses something other than the meta description for the snippet.For pages with structured data, Google sometimes shows rich snippets alongside the regular organic results too.Bottomline: if you want to appear in the organic search results, you need to focus on creating the best and most relevant result for the query. You also need to make sure Google can index your pages, and that they’re optimized for search.SERP featuresSERP features are non-traditional results. They can be paid, organic, or pulled directly from Google’s Knowledge Graph.While the purpose of SERP features is sometimes to directly generate revenue for Google (i.e., Shopping ads), the aim is most often to provide information in the search results without the need to click a result.For this reason, SERP features have a significant effect on SEO.Recent estimates suggest that over 50% of searches now result in no clicks:Sidenote. Google hasn’t always shown SERP features in the results. They started to appear more frequently over the past few years as Google built their Knowledge Graph, and their understanding of search intent improved.However, being featured in SERP features can also increase clicks to your website.Bottomline: It’s possible to show up in some SERP features, but the way you do that depends on the type of feature.What SERP features are there?Google shows dozens of SERP features in the results, and they’re always testing new ones.Below, we’ll cover some of the most common, their sources of data, and whether it’s possible to appear in them to win more traffic to your site.Featured snippetsKnowledge cardKnowledge PanelImage PackTop storiesPeople Also Ask (PAA)Shopping resultsTweets boxesSitelinksVideosFeatured snippetsFeatured snippets show a snippet of content from one of the top-ranking web pages. They’re usually displayed at the top of the SERP, although other results sometimes appear above them.Common snippet formats include:ParagraphListTableNot all featured snippets are text. Google sometimes shows videos (often referred to as suggested clips):Can you appear in Featured Snippets?Yes. Most of the time, Google pulls the snippet from one of the top five results.If you’re already ranking in the top five for a query, and Google shows a featured snippet, it may be worth optimizing your page to try to appear there.Knowledge cardKnowledge Cards appear at the top of the SERP and offer a short, definitive answer to the query. They come in various formats.There are three main sources of data for Knowledge Cards: Google’s Knowledge Graph, data partners, and other highly-trusted sources like Wikipedia and official government bodies.Can you appear in Knowledge Cards?Unlikely. Since data is pulled exclusively from Google-owned and trusted third-party sources, appearing in a Knowledge Card isn’t possible for most websites.Knowledge PanelKnowledge Panels provide information about the main subject of the query. They usually appear near the top of the SERP on mobile, and on the right-hand side on desktop.Like Knowledge Cards, most of the data in Knowledge Panels comes from the Knowledge Graph, and trusted sources like Wikipedia and Wikidata.However, Google sometimes also links to social profiles and partners.Can you appear in the Knowledge Panel?Yes. Google shows branded Knowledge Panels for companies in the Knowledge Graph. These usually include a direct link to the company’s website and links to social profiles.Your company logo can also show up in competitors’ Knowledge Panels, although it doesn’t link to your website. It performs a Google search for the company name when clicked.Image PackImage Packs show a handful of thumbnails, and clicking on them takes you to Google Images. They often appear at the top of the SERP but can appear further down the page.Can you appear in Image Packs?Kind of. Images from your website can show up here, but the link will always take the searcher to Google Images—not your website. However, once they click through to Google Images, they’ll see a link to the image source.Top storiesTop stories carousels show recently-published articles, live blogs, and videos. Google displays a thumbnail, title, publisher name, and timestamp for each result, and they usually appear near the top of the SERP.Can you appear in Top Stories carousels?Yes. However, according to research by News Dashboard, 99.31% of results on desktop come from sites that are indexed in Google News.It’s also worth noting that most rankings here are short-lived, as the purpose of the SERP feature is generally to show new results—and pages can’t be new for long.People Also Ask (PAA)People Also Ask boxes show related questions that searchers ask Google. Each question unfolds to reveal an answer pulled from a web page displayed in a similar way to Featured Snippets.Google loads more related questions every time you click to reveal an answer.Can you appear in People Also Ask boxes?Yes. Like Featured Snippets, answers to the questions in PAA boxes come from third-parties. Having content that answers one or more of these questions means you have a chance of appearing in a PAA box.That said, it’s unlikely that showing up here will lead to a lot more traffic. PAA boxes are more useful for content research.Recommended reading: How to Rank in ‘People Also Ask’ Boxes and If You ShouldShopping resultsShopping results, officially known as Product Listing Ads (PLAs), showcase relevant products from paid advertisers. Every result features the product name, price, and retailer, and some show reviews and special offers.Most Shopping results show up for queries with transactional or commercial investigation search intent. For example, “buy protein powder” or “best protein powders.”Can you appear in Shopping results?Yes, but it costs money. There’s no way to show up here organically. Learn more here.Tweets boxesTweets boxes display recent popular tweets in a carousel. These are usually from an official Twitter account associated with the query, but they sometimes show tweets from multiple accounts.Can you appear in Tweets boxes?Yes. For brand searches (e.g., “Ahrefs”), Google usually shows recent tweets from the company’s official Twitter account. For non-branded searches, relevant tweets from your account can still show up in the Tweets box.SitelinksSitelinks are links to other pages on the ranking website or other parts of the ranking page. They’re more of an enhancement to regular organic results than a SERP feature, as they appear as ‘extra’ links below a result.The benefit of sitelinks are twofold:People can find what they’re searching for faster.People are more likely to click on your website in the SERP, which means more organic traffic.Can you appear in Sitelinks?Yes. Google usually shows sitelinks for branded queries, so it’s likely that people already see sitelinks when searching for your website.For non-branded queries, you’re more likely to ‘win’ sitelinks when your page is popular and has internal links to other relevant content—at least from my observations.VideosVideo results are organic results enhanced with a video thumbnail. Only pages with embedded videos are eligible, and Google also usually shows the upload date, duration, and the name of the uploader in the SERP.Most video results come from YouTube, but they can show up for other websites too.Can you appear in Video results?Yes. For embedded videos hosted on YouTube, Google sometimes shows thumbnails in the SERP. For embedded videos hosted elsewhere, the page needs VideoObject schema markup to be eligible for this feature. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Keep Learning Google’s Knowledge Graph Explained: How It Influences SEO Google's Knowledge Graph is a knowledge base of entities and the relationships between them. Learn how to take advantage of it to improve SEO. What is SEO? Search Engine Optimization Explained SEO stands for search engine optimization. It's the process of improving a website's visibility in search engines to get more traffic. SEO Monitoring Explained: Best Free Tools to Get Started SEO monitoring helps ensure your website stays away from major technical issues and requires just two free tools to get started. Programmatic SEO, Explained for Beginners Learn how programmatic SEO works (even if you can't write code). SEO Data. Explained in 5 Minutes, 53 Seconds There are six core types of SEO data. Learn how to get your own SEO data to get more visits to your website.",
  "headers": [
    {
      "level": "H1",
      "text": "What are SERPs? Search Engine Results Pages Explained"
    },
    {
      "level": "H2",
      "text": "Why SERPs matter for SEO"
    },
    {
      "level": "H2",
      "text": "How to get in the SERPs"
    },
    {
      "level": "H3",
      "text": "Paid ads"
    },
    {
      "level": "H3",
      "text": "Organic results"
    },
    {
      "level": "H3",
      "text": "SERP features"
    },
    {
      "level": "H2",
      "text": "What SERP features are there?"
    },
    {
      "level": "H3",
      "text": "Featured snippets"
    },
    {
      "level": "H4",
      "text": "Can you appear in Featured Snippets?"
    },
    {
      "level": "H3",
      "text": "Knowledge card"
    },
    {
      "level": "H4",
      "text": "Can you appear in Knowledge Cards?"
    },
    {
      "level": "H3",
      "text": "Knowledge Panel"
    },
    {
      "level": "H4",
      "text": "Can you appear in the Knowledge Panel?"
    },
    {
      "level": "H3",
      "text": "Image Pack"
    },
    {
      "level": "H4",
      "text": "Can you appear in Image Packs?"
    },
    {
      "level": "H3",
      "text": "Top stories"
    },
    {
      "level": "H4",
      "text": "Can you appear in Top Stories carousels?"
    },
    {
      "level": "H3",
      "text": "People Also Ask (PAA)"
    },
    {
      "level": "H4",
      "text": "Can you appear in People Also Ask boxes?"
    },
    {
      "level": "H3",
      "text": "Shopping results"
    },
    {
      "level": "H4",
      "text": "Can you appear in Shopping results?"
    },
    {
      "level": "H3",
      "text": "Tweets boxes"
    },
    {
      "level": "H4",
      "text": "Can you appear in Tweets boxes?"
    },
    {
      "level": "H3",
      "text": "Sitelinks"
    },
    {
      "level": "H4",
      "text": "Can you appear in Sitelinks?"
    },
    {
      "level": "H3",
      "text": "Videos"
    },
    {
      "level": "H4",
      "text": "Can you appear in Video results?"
    }
  ],
  "author": "Joshua Hardwick"
}