{
  "url": "https://ahrefs.com/blog/start-a-blog/",
  "slug": "start-a-blog",
  "title": "How to Start a Blog That Makes Money (With No Money)",
  "description": "Our detailed guide on creating a profitable blog, plus tips that'll help you attract free traffic from search engines.",
  "content": "Mateusz Makosiewicz Marketing researcher and educator at Ahrefs. Mateusz has over 10 years of experience in marketing gained in agencies, SaaS and hardware businesses. When not writing, he's composing music or enjoying long walks. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Starting a blog that brings in real money is totally doable, but it takes time and consistency.Welcome to your comprehensive guide for launching a profitable blog. Before we dive into the details, let’s start with a quick overview of the process. Here’s the skinny on what you need to know:The first step is to find a niche that excites you (optional but recommended) and has profit potential (you’ll find plenty of examples in the article). Next, choose a monetization method that fits your style—whether it’s through ads, affiliate marketing, or selling your own products. Setting up your blog is easier than ever and doesn’t require any technical skills. Once it’s up and running, focus on creating content that resonates with your audience and is optimized for SEO. Promote your posts through social media, email, and by connecting with other bloggers. In the world of blogging, consistency is everything, so publish regularly, track your SEO performance, and stay patient. Over time, your efforts will pay off.You might also be wondering, what are the chances of success? Well, based on the data we’ve gathered, here’s what the numbers say:31% of bloggers who make a decent side income of $6K a year.15% who make at least $30K a year. 6%–10% of bloggers who make over $10K a month. $100K a month? That’s also possible with blogging, but only the most hardworking and patient bloggers get there.So, at the very least, you’re looking at pretty high chances to make a considerable side income. And everything up from there depends on your creativity and persistence. Ready? Contents1. Find a profitable niche Here are some niches proven to be profitable: NicheTypical contentBlog exampleLast monthly income reportPageviews (from last income report)Food and cookingRecipes categorized by type of meal and diet, cookware reviews, tips and tricks, listiclesPinch of Yum$95,196 (source)4.245MHealth and wellnessFood, relationships, fitness, beauty, psychologyHot Beauty Health$9,655 (source)208.6KParentingPregnancy, child-raising advice, product reviews, food recipes, stay-at-home parent jobs, kid activities, household tipsThe Soccer Mom Blog $11,288 (source)500KNewsAnything newsworthy in one niche or multiple niches (also gossip)HuffPostAcquired by AOL in 2011 for $315M, then acquired by BuzzFeed (source). According to this source, it generates $14M/mo.5.8M (monthly organic traffic March 2023, via Ahrefs)TechSoftware and hardware reviews, exclusive deals, how to use software tools, comparisons, listicles, making money online, tech news, buying guides, gaming99signals$5,242 (source)18K (monthly organic traffic on the date of the report, via Ahrefs)Personal developmentLife hacks, financial freedom, wellness, psychology, motivation, spirituality, fitnessLet’s Reach Success$6,652 (source)115.5KPetsPet health, product reviews, activities for pets, traveling with pets, pet adoption, training, tips, listiclesYou Did What With Your Weiner$7,720 (includes income outside of the content, source)40K (monthly organic traffic on the date of the report, via Ahrefs)EntrepreneurshipMaking money online, starting a business, interviews, complete courses, how-tos, inspirationSmart Passive Income$166,559 (source)68K (monthly organic traffic on the date of the report, all blogs, via Ahrefs)FinanceInvesting, saving money, retirement, financial product reviews, buying guides, family finance, mortgages, gig economy, debt, career advice, entrepreneurship, financial freedomMillennial Money$33,473 on average (source)1.5M visits in 2017FashionOutfit ideas, home decor, beauty, style tips, gift ideas, listicles, buyer guidesChic Pursuit$11,376 (source)135.3KLifestyleAnything related to solving life’s problems and living a happier lifeAbby Organizes$41.7K (source)Over 400KTravelCity guides, listicles, traveling tips, gear and location reviews, life on the road, digital nomadismLocal Adventurer$41K (source)541.8KDIY/craftsDIY decorations, DIY weekend projects, handcraft tutorials, life hacks, product reviews, food recipes, DIY repairs, renovationsJennifer Maker$15,158 (source)125.4KIs your ideal niche not on the list? Check these things:Search for affiliate programs in your niche. A simple search like “board games affiliate program” should do it.See if there are enough products on Amazon you could recommend through an affiliate program (that are not excluded by the program).Look at other blogs in the niche and see if they run ads. If they do, check their organic traffic with our free website traffic checker. Their income will range from $0.01 to $0.25 per pageview from organic traffic per month. If they’re active on other channels, that’s additional pageviews. Go to a similar product in your preferred niche and use a tool like Ahrefs’ Site Explorer to see sponsored links—these will be the deals you could potentially get as well. You can look for affiliate programs used on any site with these four steps.But what about blogging about something you’re actually passionate about? Obviously, the best scenario is that your interests or hobbies match a profitable niche. Otherwise, it’s easy to lose interest in your blog. But you can also look at it in a different way. If you treat your blog merely as a business, you don’t need to be passionate about the niche in order to succeed. You can, for example, set up blogs in all of those niches and hire someone to create content. Further readingHow to Find the Perfect Niche for an Affiliate Marketing Site [2.2] 2. Find a unique angle There are more than 600 million blogs out there (Web Tribunal). There is likely a lot of competition for what you want to create, so a good idea is to find a way to differentiate. Here are some ideas:Write from your personal experience – For example, people could be interested in parenting product reviews from a parent with formal medical education. Cater to a specific segment – People with tight budgets, left-handed people, people with food allergies, etc. Cover complex topics in simple words – Oversimplified is a good example. Offer more thorough knowledge than others – For example, you can go really in-depth with your product reviews. Use a lot of custom visuals – Most people skim content. Infographics, videos, and original graphics can help catch readers’ attention. Fill the gap in the blogosphere – For instance, if a food blog in the no-waste spirit is what you think is missing, that could be your ticket to success. Think of the angle of your blog as a long-term investment. It will help you to establish a brand that people will want to come back to and recommend to others. 3. Choose a monetization method Below are nine ways to monetize a blog. Depending on your chosen niche, there may be additional opportunities (for instance, food blogs can develop recipes for other companies). Usually, bloggers use several methods at the same time. Keep in mind that some methods (or advertising platforms) will be available only for eligible blogs (usually, it’s about having enough traffic), and some are reserved for bloggers who have already made their name in the industry (speaking, coaching). MethodHow it worksTypical rateAdvertisingYou display ads on your blog and get paid based on the number of clicks or impressions the ads receive.$0.01–$0.25 per pageview.Affiliate programsYou promote products on your blog and receive a commission for any sales made through your unique affiliate link.5%–50% (up to 90%) per sale.Sponsored contentYou receive payment for publishing content that promotes a specific brand or product on your blog.$25–$1K per article.Selling productsYou sell physical or digital products on your blog and keep the revenue generated from sales.Depends. For example, if you’re selling books, that could be $9–$30.Online coursesYou create and sell online courses on your blog, and students pay to access your course content.Usually $400–$1K per sale. Depends on the market. If there is a lot of competition and your blog is not yet popular, you should consider a lower price tag.Subscriber-based membershipsYou offer premium content or services to subscribers who pay a monthly or annual fee to access it.Usually $20–$100 per subscription.Events and speakingYou generate income by speaking at events, conferences, or workshops related to your niche.Usually starts at around $10K and goes up to $100K for high-profile speakers.Coaching and mentoringYou offer one-on-one coaching or mentoring services to readers.The usual rate in the U.S. for an hour of coaching is between $50 and $250. Running a blog can contribute to your popularity and allow you to raise the stake.Selling the blogYou sell your blog to a buyer who is interested in acquiring your content, audience, and monetization methods.The average price of a content site is $101.4K, according to Empire Flippers.4. Come up with a nameThis is the part where you need to get creative. My advice: It’s just like choosing a name for a business, i.e., the same rules apply:Make it simpleMake it easy to remember Make it relevant Make it uniqueThink for the long term; avoid trends Now for the big question: Should you choose a “search engine optimized” name and domain? Does that even exist? Google says that there is no SEO boost for exact or “partial match” domains, so it discourages doing this (source). What this means is that you should choose a domain name for reasons other than SEO. You can use a domain with a relevant keyword, such as “bike blog,” if the content of the blog is relevant to bikes. But you can also choose a more abstract name. Google will still mostly evaluate the content quality and links. 5. Choose a blogging platform and set up the domain You basically have two choices here: Self-hosted platform – You get the hosting (a piece of your own server) and the platform separately.Hosted platform – Get everything you need to start publishing in one place. While the second option may sound like the best, there are many good reasons to go with the first option. The most popular self-hosting option is WordPress, which is run by some 40%-45% of websites globally. You get this platform for free, but you need a server, a domain, and an SSL certificate to run it. Sounds a tad technical, but it’s quite easy to set up, and you can be ready to go in less than an hour. What’s more, some hosting companies have solutions tailored for WordPress, which makes the process even easier. In my opinion, the main reasons why so many people go with WordPress are that it’s easy to use, free, customizable, and has plugins for everything, including SEO which is important if you want free traffic. Hosted platforms like Wix or Weebly offer everything under one roof, but you won’t have the same degree of customization (fewer plugins and probably fewer templates to choose from).As for the cost, I was able to get the full package needed to run WordPress for a whole year for approximately $18 with a local hosting provider. Total: $18.This includes:A server where I can have up to 50 different WordPress blogs (or any type of site as long as it is based on WordPress).No transfer limit (unlimited visits). A super easy way to set up WordPress.A domain for a year.An SSL certificate for a year (SSL is important for safety, credibility, and ranking).And I set everything up in minutes. Of course, once my visitor count reaches the threshold, I’ll need to get a more expensive plan. Let’s compare that with hosted solutions. All of them have free tiers, but let’s assume we don’t want their branding and we want our own domain. Here are the prices:Wix – Starts from $264 per year (for a comparable package).Weebly – $144 per year. WordPress – Has a hosted option too at $38.5 per year. Pro TipIf you’re going with the self-hosting option, choose a provider with servers located in the country you want the most traffic from. This will give your site a speed boost for that country.6. Design your blog Two choices: You can either have a custom-designed template or get a generic one for free (or a couple of bucks for a premium one). If you go with a custom template, you’ll get something original and tailored to your needs. On the downside, you’ll need to wait to get it done, and it’ll cost you more. You’ll also need to make sure you’ll get the support for at least a year. So what most bloggers do when starting out is use a free template or pick one from a marketplace like Envato. As long as your blog doesn’t look exactly like your competitors, you’re going to be fine. With time, you can invest in something custom to make your blog look unique. In web design, usability trumps aesthetics. So try to keep these things in mind when choosing the look of your blog: Clarity – Avoid flashy and distracting designs.Speed – Nobody likes slow websites. Architecture – For example, some templates start with a big intro header, while others go right into the latest blog posts. Responsive design – Needs to look good and work well on all devices. A place for ads – Browsing through different templates, think about where your ads can go (if you choose this monetization method). Most content management systems (CMS), such as WordPress, allow you to jump between templates with a few clicks. So do try a couple of looks and see what fits best. 7. Find topics with search potential By this time, everything is set up to start creating content. But we won’t simply start writing post after post on random topics—our approach will be strategic. We will do two things here: Find topics that can bring you free traffic from search engines like Google Find enough topics to fill an editorial calendar for months ahead Naturally, since it’s your blog, you can write about anything you want. But if you want your content to be profitable, content designed to rank is your best bet. Basically, it’s the kind of content that people are looking for in search engines. So instead of just “brainstorming” ideas, we’ll do keyword research to see what people search for, how much traffic we could get, and how hard it would be to rank. For this, you’ll need a tool like Ahrefs’ Keywords Explorer. And since our blog is new and we want to rank relatively quickly, we’ll try to find easy keywords to target. Here’s how the process works. You can: Enter seed keywords related to your niche. For a food blog, that could be as simple as “recipe” or include more ideas like “paste, pita, recipe, sauce, soup, taco, wrap, etc.”Go to the Matching terms report.Set filters: KD max. 20; Lowest DR up to 20 in top 10; Traffic Potential and volume min. 200. This way, we’ll filter out tougher keywords that may be out of our league for now but still get keywords that can bring considerable traffic. Since there are over 8K keyword ideas in that list, there’ll be plenty to fill up your editorial calendar for months. You can also make the list more manageable by increasing the minimum volume, further decreasing KD, or excluding unwanted keyword patterns (like keywords related to brands). And here are some examples of relatively easy keywords from that list:TP refers to the Traffic Potential of a keyword.You can also get keyword ideas from competitors. It’s a great technique to find the less obvious keywords. In our case, those are food and cooking-related keywords that don’t contain the word “recipe.” Here’s the process in Ahrefs. Go to Site ExplorerEnter the URL of the blog (make sure it’s set to Subdomains)Open the Organic keywords reportSet filters: position 1–20, KD max. 20, volume min. 200, Keyword doesn’t contain “recipe”Doing that research on the Pinch of Yum blog resulted in nearly 2.5K keywords. Let’s look at some examples and their Traffic Potential: An important thing to check when choosing keywords is the dominating content type. This is the key part in identifying search intent: what users expect when they search for something. If you see that the first page on Google is dominated by a content type you can’t create or one that doesn’t make sense for your website (for instance, a product page), skip that keyword because your chances of ranking will likely be low. A food blog that doesn’t offer salad bowls as a product probably shouldn’t target the keyword “salad bowl”—top results are dominated by product pages. “Salad bowl recipes” is a whole different story.Check out our in-depth guides to master keyword research: Keyword Research: The Beginner’s Guide by Ahrefs Keyword Competitive Analysis: How to Find Your Competitors’ Keywords Advanced Keyword Research: 5 Tips for Finding Untapped Keywords How to Do Keyword Research for Affiliate Sites NoteWhat about non-SEO content? Is it worth it if it likely won’t bring organic traffic? I think the answer is yes, but the decision is up to you. If you think that a given topic will be interesting to your readers, you can still distribute it on other channels (email, social). That kind of content can still generate pageviews and increase engagement on your blog.What’s more, non-search-based content can still help you with SEO. If it gets links, it can help your site increase authority and make it easier for you to rank for all your keywords.8. Create an editorial calendar A content calendar (aka editorial calendar) is a system used to organize, manage, and schedule content production.Why do you need one? By doing keyword research, you’ll come up with a lot of topic ideas. This keeps them all in one place. It helps you to stay on track of hitting your content quota goal (you should have one). It helps to organize work with contractors and guest bloggers (once you have them). As a beginner blogger, you likely won’t need a complex calendar. You can get everything organized using a free tool like Notion, Asana, Trello, or even a Google Calendar. So here are some ideas for logging in useful information in your calendar: KeywordDue dateProgress statusCategory Author (if there are multiple authors)Any tags you find useful in your workflow like “sponsored” or “outsourcing”Traffic potentialWhile we’re at it, I think Notion offers great (and free) functionality for creating content calendars. You can create a database of topics and switch between views to get the perspective you need at any given moment. 9. Create optimized blog posts Google wants to serve relevant and helpful content for any search query. So our job as bloggers is to understand what a searcher is really looking for and how to make that content stand out from the rest while still serving what is expected. That’s what content optimization is all about. We’ll look at four things here:Content format and angle, i.e., remaining parts of aligning to search intentWhat SEO can tell us about the points we could make in content What quality content means for GoogleOn-page SEO technicals: titles, meta descriptions, alt text, and moreContent format and angle Choosing the content format is basically about deciding whether any given blog post is going to be a:ListicleRecipeGuide Definition post Tutorial As for the content angle, it’s the unique selling point of a page. It should catch the attention of the searcher and indicate what is special about the page. For example: “best, free, in 2023, top, etc.”How do you come up with both of them? Just like we did with content format during content research—turn to the search engine results pages (SERPs). For example, for the keyword “how to make money online,” we can see that listicles dominate the SERPs, and some of the interesting angles already used are “at home, realistically, quickly, easy, for beginners.”What this SERP shows us is the kind of content that best serves the search intent. So if we align with search intent but still offer something unique and compelling, we likely stand a good chance of ranking. In other words, we need a listicle and an angle that hasn’t been used yet—something like “5 Tried and Tested Ways to Make Money Online.” What to include in your postThe talking points and the assets you include in a post matter not only for the reader but also for search engines. They can help make your content more relevant for the target keyword, rank for secondary keywords, and attract more links. First comes the structure of your post. You can get a good understanding of how the top content is structured by using our free SEO Toolbar. Just go to any top-ranking article for your keyword, open up the toolbar, and go to the Content report. For example, here we can see that one of the articles on “how to make money online” mentions a number of ideas that we could cover. Moreover, it offers an interesting way to categorize money-making ideas, which is something we can work with too. This is already enough to get a sense of what relevant content looks like. To go a level deeper, you can check secondary keywords the top content ranks for and the words used frequently. Open Keywords ExplorerEnter your keywordGo to the Related terms report Also rank for tab will show you secondary keywords, and Also talk about will show you frequently mentioned words (you can also set it to All to combine the tabs); make sure to set the report to Top 10 tooHere are a few examples from that list that could make good points or subtopics for an article on making money online: Naturally, this doesn’t mean you should copy articles you see ranking on Google. Despite the outcomes, Google is constantly trying to reward the best-quality, most original content and demote the copycats. So treat these reports as inspiration for creating a unique piece that brings something new to the SERPs.Besides common points, it’s a good idea to include link-worthy content (aka link bait): original research, infographics, free resources, original thoughts, inspiring stories, etc. Not only will they make your content more interesting, but they can also entice people to link to it. Links amplify the reach of your content and improve your link profile (if they’re quality backlinks). You can partly automate this process with an AI content optimization tool like Ahrefs AI Content Helper. The tool suggest topics you could talk about on a page (based on top ranking pages). Then it gives a score on how well you’ve covered the topic and an overall optimization score for the article. You can use it for new content as well as for optimizing existing content. TipIf there’s a featured snippet showing for your keyword, it’s usually a good idea to optimize for it. This could be your shortcut to the #1 result on the SERP. For example, a featured snippet might be a hint to include a definition of the target keyword or to structure your post in a certain way. Our article on standard operating procedures (SOPs) for SEO ranks with a featured snippet because we included a definition of the general term of SOPs.To learn more, check out our full guide on how to optimize for featured snippets.Create quality contentProducing quality content is the best way to engage readers and make them come back. If you have an idea of how to create better content than the competition, you should definitely try it. But besides that, you need to know what Google deems as “quality content.” After all, your content should bring you traffic from that search engine. So according to Google’s guidelines, quality content is interesting and useful, and that means it’s:Easy to read.Clearly organized.Unique and fresh.Providing essential information to solve a searcher’s problem. We already touched on that in the previous chapter. Aligned with Google’s E-E-A-T guidelines. In short, you should clearly demonstrate what makes you qualified to serve helpful content on a given topic, i.e., why should readers trust you. To learn more, check out our guide on E-A-T and the latest update to the concept. Technicals Let’s not forget about the “boring but necessary” technicals of optimizing for search engines. Here are some easy best practices worth following: Include the target keyword in the title – The easiest way to make your title relevant to the topic but still fit within 60 characters. Write a compelling meta description – Probably won’t help you rank higher but can help you attract clicks from SERPs. Use short, descriptive URLs – It’s enough to use your topic as the slug (as you can see in this very article). You’re optimizing this with the user in mind to help them understand where they’re located on the website (plus, URLs are visible on the SERPs). Add alt text to your images – Be concise and accurate. Google uses alt text (and the surrounding content) to understand images.Link to internal and external resources – Cite other pages where relevant and when you want to direct people to helpful content. Optimize for rich results – They are the special content formats found on the SERPs beyond standard blue links. For example, recipes can be displayed on top of blue links as a carousel with a large image, ratings, and prep time. Check out Google’s rich results guide to see eligible rich results for your type of content. 10. Promote your blog In this section, I want to show you a few ways you can effectively promote your blog for free. Obviously, none of the ways are about investing in ads. The reason for this is that unless you sell some high-ticket product through your blog, like a course, physical product, or community membership, you likely won’t get a positive ROI with ads. Simple math: If the average cost of the ad is higher than what you get paid for displaying ads on your blog, you lose money. Let’s dig in. Build an email listBuilding an email list sounds like a set-and-forget cliche tactic, but don’t underestimate it. Let’s hear from Abby Lawson of Abby Organizes: Our email list has become one of the biggest if not THE biggest contributor to our business’s success, and if I had started growing it earlier, it would be even bigger than it is today. Our email list allows us to keep in touch with our followers more easily and get to know them better. It has helped us to sell more products and grow our traffic. Without it, I don’t know that we would have been able to make the leap to both Donnie and I blogging full time, and we are so grateful to our subscribers for following along on our journey.Email is going to be your direct line to readers. You pay next to nothing to reach an audience that you know is interested in your blog (or actually nothing if you get a free email tool), and you can use the list to offer products or services. Do you need to reach for some hacks to get people to sign up? I doubt it; it’s a surefire way to get unengaged subscribers. The best way to get people to subscribe is to set up a sign-up form next to really good content. Sure, you can offer some kind of special deal for your subscribers, such as exclusive content. But make sure to make it relevant. By the way, let me mention an important yet counterintuitive practice. Once you get your list growing, delete contacts that haven’t opened your emails for the past couple of months. It will help you achieve better email deliverability and keep your email app costs lower.Further reading8 Easy (But Effective) Ways to Grow Your Email List Build links Since you want free traffic from Google, you’re going to need links. The more competitive the keywords you go after, the more quality links you’ll need. Why links? Links are one of the most impactful ranking factors for Google. There are two ways to build links to your content: Organic way – People link to your content because they think it’s useful and/or they link to a specific part of your blog post that carries information they want to refer to (such as data from your research). It’s why you should include link bait in the first place (as explained in the previous section). Outreach – You reach out to other websites and ask for a link. It makes sense to do so when you’re confident your link will make that piece of content more helpful. It’s actually best if you combine both tactics. This is so that when you contact people and pitch your content, you’ve got something compelling to link to. There are quite a few techniques for outreach link building. Let me show you an example: broken link building. It’s where you find broken links pointing to your competitors, then you contact a referring website and ask to include your link to relevant content instead. Open Site ExplorerInput your competitor’s URL (this can be the entire site or a particular page)Go to the Broken backlinks report and see the broken pages along with the sites that link to them To do this at scale, use Ahrefs’ Content Explorer: Type in your topic and set the mode to In titleSet filters: Only broken, preferred language, and DR min. 20 (optional, to filter out websites with lower authority)Choose a broken page from the results and click on Backlinks to learn which pages have linked and why (look at the anchor and surrounding text)Contact these websites and see if they can link to your content insteadThat’s the basics. Since we live in times when links are the currency of the web, it can be tough to earn a link. Check out our guides on link building and outreach to increase your chances (without spamming people): Link Building for SEO: The Beginner’s Guide The Only 8 Link-Building Tools You Need (Free & Paid) Should You Buy Backlinks in 2023? It Depends Repurpose your content Your target audience is dispersed across multiple channels, each with distinct outreach potential. So by repurposing, you can extend the reach of your content: Blog posts can become Twitter threads.Blog posts can become videos (and vice versa). Individual articles or videos can be put together and turned into a free course or ebook.Ebooks can become email drip campaigns. Ebook excerpts can become guest posts. Blog posts can become Quora answers.And so on. For example, you can find some of our content from the blog repurposed on our YouTube channel, and vice versa. Blog post templates—a video that got over 50K views on YouTube.Blog post templates—an article that generates an estimated 1.4K organic visits monthly.You can do that with all your content. But if you’re a team of one, you’ll likely want to prioritize. Head over to our guide on content repurposing, where we show how to estimate if your time investment will be worth it.Follow your audience Think other blogs, newsletters, podcasts—these are the places where your audience likely hangs out. And before they come to you, you need to go to them. If you are featured in those places: Your blog can earn more awareness.You can get direct traffic to your blog.You can earn a link that can help to boost your SEO (except for email-only newsletters; they can only get you links indirectly). Finding these places isn’t hard. You probably already know some good ones, and you can use Google to find more.To know which of them can give you the best link, use Ahrefs’ SEO Toolbar while searching on Google and look at the Domain Rating of the website (the higher, the better). Keep in mind: The ones with DR >80 may be harder to get into. DR is a 100-point scale.One neat hack to do in Ahrefs is to look up articles by a prolific author and exclude that author’s websites from the results. This way, you can find sites where the author has written as a guest and pitch those sites too. Open Content ExplorerUse search operators; example: author:\"Grant Sabatier\" (-site:millennialmoney.com AND -site:bankbonus.com)Sort the list by DR to get the most authoritative pages first Further readingGuest Blogging for SEO: How to Build High-Quality Links at Scale How to Use Podcasts for Link Building Other tactics Here are more free and effective blog promotion tactics you should consider: Share in communities – Communities always welcome the really good stuff, i.e., original and helpful to others in the community. Ping the people or brands you’ve mentioned – Not to be confused with ego baiting. If you found someone or some site interesting enough to mention, tell them about it. Mention them on Twitter or just write to them. This tactic will likely get more effective as your blog’s reputation grows. Answer journalist requests – By providing a quote on a topic you’re an expert on, you can get featured in relevant (or just big) media and earn a link. New to this stuff? Check out our full guide on how to use HARO for link building. Amplify your content on social media – Just like you, your audience will divide their attention among different social media platforms. Tip: cater to the platform; don’t just share links to your blog posts.Accept guest posts and do interviews – May not be the best tactic for beginners (since guest authors usually choose more seasoned blogs), but this is something you can do later on as you grow your reputation. Benefits: free pageviews, backlinks (see below) and, of course, great content for your readers. Some of the most linked content on the popular blog makingsenseofcents.com are interviews.11. Keep your blog in shapeThere are other things you need to do besides pushing new content. Monitor SEO health Ideally, you’ll want your site to be free of any SEO issues. However, it’s enough to stay away from the critical ones that can seriously impact your rankings or even prevent you from ranking.For this, you’ll need SEO tools that will monitor your site automatically, report issues, and suggest solutions. These two should be more than enough: Ahrefs Webmaster Tools (functionality also included in full Ahrefs subscription)Google Search Console Check out this short post on how to use these tools to spot and fix technical SEO issues that really matter. Update posts regularly for SEOUpdating posts can help you reclaim lost rankings and improve pages that never ranked high enough.Underperforming content can be divided into two categories:Ranking in the top 10 – These articles will likely need a smaller update, such as refreshing outdated information. Ranking below the top 10 – These articles will likely need a bigger redo. You may need to rewrite most of the content to get a higher chance of ranking. To find articles worth updating, you can use two types of tools. The first one is our free WordPress plugin. If you’re going to go with WordPress for your blog, this tool will monitor the rankings for the target keyword and, based on that, suggest the appropriate action. You can also use a rank tracking tool like Ahrefs’ Rank Tracker. Track your main keyword targets, then use the position filter to find pages ranking from 1 to 10 (for updating) and from 11 (for rewriting). NoteAccording to the SEOs we surveyed, it typically takes three to six months for SEO to show results. So give it at least three months before you make any significant changes to your posts.Once you find your underperforming blog posts, there are a few things you can do, depending on the case: Changing the format (for example, from a listicle to a guide) Adding a missing subtopicUpdating old statistics, facts, etc Adding internal links from other pages Adding more helpful resources: quotes, visuals, statistics, etc Demonstrating more first-hand experience on the topic… and more. Read our full guide to republishing old content for SEO for more tips on the topic. FAQ Frequently asked questions about starting a profitable blog. How do bloggers get paid? Here are the most popular ways of monetizing a blog: Advertisements Affiliate marketingSponsored postsFreelance writing Selling products, services, or memberships Depending on the monetization method, payment rules also differ. For example, for affiliate marketing, you can get paid even after 30 days from the purchase and only if the product hasn’t been returned. Whereas for sponsored posts, you can expect advance payment. In this article, you will find nine ways to monetize a blog (as seen in the table earlier). But depending on the niche, this number can vary (for example, there can be up to 18 ways to monetize a food blog).How to start a blog with no money? It’s possible to start a blog with absolutely no money using free blogging tools and free hosting. However, it’s not necessarily the best way to start. Blogging is competitive, and the best blogs use paid services and tools to gain an edge. Instead, try to keep your costs low if you’re tight on budget. For example, use a free blog template instead of a custom one, find cheap WordPress hosting, and use free tools where possible. Pay for tools only if you see them as a good investment. Last but not least, if you’re low on cash and you want to use blogging as your main income, this may be hard to achieve. Blogging can take time to return a considerable profit, so it’s best if you prepare to have other sources of income before that happens (don’t leave your day job just yet). How to start a blog as a beginner? If you want to start a blog that makes money, it all comes down to: Choosing a profitable niche, unique angle, and name.Planning how you’re going to monetize.Choosing a blogging platform and registering your domain.Creating content based on traffic potential and your audience’s interests.Promoting your content.You can start blogging on the very same day, and it doesn’t require any special skills such as coding. Although, you’ll need to fill in some “blanks,” such as your niche, name, and the topics you’ll write about. What kinds of blogs make money? There are essentially five types of blogs that make money:Niche blogs – Take a deep dive into a particular niche or theme. Examples of profitable niches: food and cooking, health and fitness, parenting, news, tech, entrepreneurship, finance, travel. Affiliate/review blogs – Blogs created with the purpose of recommending products and earning money via commissions from affiliate programs. Personal blogs – Blogs without any particular theme or niche other than the personal experiences and opinions of the author. Personal brand blogs – Their primary aim is to establish the author’s name in a particular industry. These blogs differ from personal blogs in that the content is more specifically targeted toward the author’s area of expertise.Business/corporate blogs – Promote products, services, and brands owned by the business.Why do most bloggers fail?Most common reasons why bloggers fail:Giving up too soonLack of consistency in publishing Writing for themselves, not taking their audience and demand for the topics into account Never monetizing their blog Failing to provide unique value Not investing in their blog Ignoring SEONot promoting their contentDo people still read blogs?In all, 77% of internet users read blogs (Social Media Today) and nearly 26% of people in the U.K. aged 5–18 are reading blogs (Statista).How many times a week should I post on my blog?Bloggers who publish two to six times per week are 50% more likely to report strong results (Orbit Media).But you can publish less and be successful. For example, Financial Samurai, one of the most prominent blogs in the financial niche, has been publishing three posts per week.Final thoughts Taking a blog into profitability can be a tedious job. But if you’re serious about committing your time to it, put these blogging tips into practice to start gaining traction to your blog. You can read about other successful blogger’s stories below.Carrie Forest started the Clean Eating Kitchen blog to help women recovering from chronic health issues after struggling with health issues herself. Her blog started to generate revenue when she started to do SEO. The blog makes $20K a month now—you can read her founder’s story here. Jennifer Marx from Jennifer Maker started her blog when she was broke. She turned it into a business that earns six figures a month in a few years. Listen to her story.Michelle Schroeder-Gardner started Making Sense of Cents in 2011 to keep track of her financial progress. Now her blog earns $40K a month, and she works just a few hours every week off of her sailboat (or wherever she’s currently at). Read her story and get some of her blogging tips.Abby and her husband made blogging a full-time family business. She explains how it happened and shares a few blogging tips in her last income report. Got questions or comments? Let me know on Twitter or Mastodon. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Mateusz Makosiewicz Marketing researcher and educator at Ahrefs. Mateusz has over 10 years of experience in marketing gained in agencies, SaaS and hardware businesses. When not writing, he's composing music or enjoying long walks. Keep Learning The Content Marketer’s Guide to Performance Reviews Insights on how to conduct performance reviews for content marketers - basic theory, results from our survey, and some tips based on our experience. How Zapier Built a Content Marketing Machine Learn how Zapier built a library of content that today brings in over 2 million readers each month. How to Create a Content Map: Traditional Way & Ahrefs’ Way Create your own content map with the help of our template. Or try an even simpler method we've been using for years. What Is Topical Authority in SEO & How to Build It Topical authority is an SEO concept where a site aims to be the go-to authority on one or more topics. Learn how to build it in four steps.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Start a Blog That Makes Money (With No Money)"
    },
    {
      "level": "H2",
      "text": "1. Find a profitable niche"
    },
    {
      "level": "H2",
      "text": "2. Find a unique angle"
    },
    {
      "level": "H2",
      "text": "3. Choose a monetization method"
    },
    {
      "level": "H2",
      "text": "4. Come up with a name"
    },
    {
      "level": "H2",
      "text": "5. Choose a blogging platform and set up the domain"
    },
    {
      "level": "H2",
      "text": "6. Design your blog"
    },
    {
      "level": "H2",
      "text": "7. Find topics with search potential"
    },
    {
      "level": "H2",
      "text": "8. Create an editorial calendar"
    },
    {
      "level": "H2",
      "text": "9. Create optimized blog posts"
    },
    {
      "level": "H3",
      "text": "Content format and angle"
    },
    {
      "level": "H3",
      "text": "What to include in your post"
    },
    {
      "level": "H3",
      "text": "Create quality content"
    },
    {
      "level": "H3",
      "text": "Technicals"
    },
    {
      "level": "H2",
      "text": "10. Promote your blog"
    },
    {
      "level": "H3",
      "text": "Build an email list"
    },
    {
      "level": "H3",
      "text": "Build links"
    },
    {
      "level": "H3",
      "text": "Repurpose your content"
    },
    {
      "level": "H3",
      "text": "Follow your audience"
    },
    {
      "level": "H3",
      "text": "Other tactics"
    },
    {
      "level": "H2",
      "text": "11. Keep your blog in shape"
    },
    {
      "level": "H3",
      "text": "Monitor SEO health"
    },
    {
      "level": "H3",
      "text": "Update posts regularly for SEO"
    },
    {
      "level": "H2",
      "text": "FAQ"
    },
    {
      "level": "H3",
      "text": "How do bloggers get paid?"
    },
    {
      "level": "H3",
      "text": "How to start a blog with no money?"
    },
    {
      "level": "H3",
      "text": "How to start a blog as a beginner?"
    },
    {
      "level": "H3",
      "text": "What kinds of blogs make money?"
    },
    {
      "level": "H3",
      "text": "Why do most bloggers fail?"
    },
    {
      "level": "H3",
      "text": "Do people still read blogs?"
    },
    {
      "level": "H3",
      "text": "How many times a week should I post on my blog?"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Mateusz Makosiewicz"
}