{
  "url": "https://ahrefs.com/blog/suso-digital/",
  "slug": "suso-digital",
  "title": "Ahrefs customer story: SUSO Digital",
  "description": "See how every department in SUSO Digital uses Ahrefs to achieve results for their customers.",
  "content": "Constance Tan Constance is devoted to improving the value users get out of Ahrefs. She enjoys trying new things, and learning about the many ways software eats the world.Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents From our content writers and account managers, to our sales staff and SEO specialists - every single member of our team uses Ahrefs every single day; it is, and has been our go to SEO tool for almost a decade. Andrew Oleksik, Managing Director SUSO DigitalAbout SUSO DigitalSUSO Digital is a team of 60+ SEO experts who partner with ambitious agencies and brands around the world, providing strategic white label SEO services.Why they switched to AhrefsBefore Ahrefs, SUSO Digital were using a number of separate platforms for tracking clients’ keywords, technical and content audits, and backlink related issues. They were looking for a single combined platform that was easy for the whole team to use together.What led SUSO Digital to choose Ahrefs over other options on the market was its extensive range of platform capabilities that are useful for every department at SUSO Digital, not just our SEOs:Ahrefs’ core tools: Site Explorer, Keywords Explorer and Rank Tracker allowed their team to develop and execute SEO strategies daily.Their link building specialists used Batch Analysis and Link Intersect to quickly and efficiently analyze hundreds of link prospects at once.Their content writers found the Content gap useful for identifying new keyword opportunities that the client websites are missing out on.Their account managers utilized the Ahrefs API to easily create bespoke reports that are extremely insightful for clients.Their sales team used Site Explorer and its domain comparison features to create preliminary reviews of prospective clients’ SEO performance and compare them to their competitors. Getting started with Ahrefs was extremely easy, thanks to the comprehensive documentation available. We used the Ahrefs Academy videos and the blog to continually learn how to use Ahrefs in new and exciting ways. Finally, the Ahrefs’ platform itself has intuitive hover hints that clarify unfamiliar terms and metrics, and provides examples of how they can be used. Andrew Oleksik, Managing Director SUSO DigitalHow they harnessed Ahrefs to achieve results for clientsOne of their key clients specialize in simultaneous translation and interpretation. This client originally came to SUSO Digital in 2017, when their website only registered 40 clicks a month, coming from 250 organic keywords ranking in Google. To make things worse, these keywords weren’t explicitly related to their service offerings.1. Realign keyword strategy for a better targeted audienceSUSO Digital checked the website’s Organic competitors report to find competing websites in the same niche and got to work targeting more relevant keywords instead, such as “legal language translation”, “simultaneous interpreting services” and “corporate translation”.2. Revamped their site structure to optimize crawl budgetIn addition, the client’s site was constructed in such a way that it routinely generated low quality pages. This affected both SEO performance and crawl budget, and it was difficult to trace how they were being formed. Site Audit helped SUSO digital narrow down the root cause of this and eliminate this issue, allowing Google to crawl the website more efficiently.3. Recovered link equity from broken backlinksAlong with this structural revamp, this website has now changed a lot over the years. By checking Ahrefs’ Broken backlinks report, the team noticed no one took care of backlinks linking to older versions of their important pages. They used this report to systematically track and restore these backlinks to regain link juice.ResultsAs of 8 February 2024, SUSO Digital’s client website now has around 21,000 clicks monthly coming from 9700 organic keywords. A more than 80x increase in organic traffic coming from keywords relevant to their business’ offerings.Switch to an SEO stack that empower all teams:Site ExplorerKeywords ExplorerBatch AnalysisCompetitor AnalysisRank TrackerAhrefs API Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Constance Tan Constance is devoted to improving the value users get out of Ahrefs. She enjoys trying new things, and learning about the many ways software eats the world.",
  "headers": [
    {
      "level": "H1",
      "text": "SUSO Digital migrates to a single SEO platform to empower both sales and marketing"
    },
    {
      "level": "H2",
      "text": "About SUSO Digital"
    },
    {
      "level": "H2",
      "text": "Why they switched to Ahrefs"
    },
    {
      "level": "H2",
      "text": "How they harnessed Ahrefs to achieve results for clients"
    },
    {
      "level": "H3",
      "text": "1. Realign keyword strategy for a better targeted audience"
    },
    {
      "level": "H3",
      "text": "2. Revamped their site structure to optimize crawl budget"
    },
    {
      "level": "H3",
      "text": "3. Recovered link equity from broken backlinks"
    },
    {
      "level": "H2",
      "text": "Results"
    },
    {
      "level": "H2",
      "text": "Switch to an SEO stack that empower all teams:"
    }
  ],
  "author": "Constance Tan"
}