{
  "url": "https://ahrefs.com/blog/sydney-seo-conference/",
  "slug": "sydney-seo-conference",
  "title": "Sydney SEO Conference: “An Absolute Belter”",
  "description": "I attended Sydney SEO Conference for the second time it's hands-down becoming one of my favorites. Here are my top takeaways.",
  "content": "Despina Gavoyannis Despina is a Senior SEO Consultant with 8+ years of experience growing B2B, e-commerce, SaaS, and national brands. She's an optimist at heart, taking time to enjoy life's silver linings each day. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents I attended Sydney SEO Conference for the second time, and I’ve got to say, it’s hands-down becoming one of my favorites. Great vibe, knock-out speakers, and perhaps best of all, awesome attendees.And it’s not just me who thinks so:There are loads of friendly folks in SEO I’m grateful to have met through this conference. Those of us who live down under don’t often get chances to connect with each other at large events like this (at least not without an insane amount of travel).Kudos to James Norquay and the Prosperity Media team for putting together such a great event. You’ll definitely be seeing me again next year.The Prosperity Media team celebrating at Sydney SEO Conference.To give you a feel for the event (and hopefully persuade you to join me next year), here are my top takeaways.ContentsThe vibe: 5-star hotel but with a laid-back atmosphereBoth times I’ve attended this conference, the Prosperity team has gone all out on hiring top-notch, five-star venues.Located in the heart of Sydney, both venues have been easy to get to and are near many attractions for interstate or international travelers to enjoy.You can also expect five-star service from the venue staff, and the food and drinks provided throughout the day exceeded my expectations. None of that undrinkable conference coffee over here.The food was also great. Apparently, the lunchtime lamb was “to die for” and I witnessed many people going back for seconds (and thirds!) Yeah, you know who you are 😉There are also a number of great sponsors (including Ahrefs, of course) supporting the event. We shared a stack of our SEO for Beginners and White-Haired SEO children’s books with attendees:Limited Ahrefs books left !! Grab one now for anyone at the Sydney SEO conference. pic.twitter.com/SqaZHT57v2— James Norquay (@connections8) March 1, 2024 Not to mention the after-party overlooking the harbor. It was a great place for people to let their hair down, enjoy some drinks on Prosperity Media’s tab, and get into deep and interesting conversations. Just what a girl needs to nerd out over knowledge graphs with Nik Ranger or Google’s helpful content updates with affiliate folks.It was a fun day all around!The crowd: You’ll meet a diverse range of super-smart peopleSome conferences have a feel about them where you know you’ll mainly be around affiliate folks, or enterprise folks, or generalist marketers. Sydney SEO Conference wasn’t like this.There were around 300 people at the event, and I was pleasantly surprised by the diverse range of skills and interests of the attendees. I met affiliate marketers, agency owners, in-house teams, and division heads from enterprise companies. There were also some non-SEO developers and WordPress specialists.If you’re anything like me then chatting to other attendees in the breaks or social events after the conference is where you learn some super interesting things! It’s honestly my favorite part of going to conferences.My best SEO-related takeaway came from Georgia Tan who shared some awesome things she’s working on with her team around “digital shelf optimization” for clients like Pepsico. It’s about going beyond Google or other search engines to optimize products for specific ecommerce, marketplace, or app platforms where people shop.I also learned some great non-SEO tips about living in Andorra and the digital-nomad residency options available. Worth checking out if you’re looking for a nomad-friendly place in Europe as your next base!The speakers: You’ll learn from big names and local experts alikeTim Soulo on-stage presenting about using Ahrefs for competitive intelligence.The speaker lineup delivered knowledge bombs for each and every attendee, no matter their role or SEO experience. It wasn’t the case that only one or two speakers were the standout favorites here.The diversity in presentation topics hit the nail on the head, and every attendee I spoke to walked away with new insights and actionable tips relevant to their role. That’s how you know a conference has nailed it with its speaker lineup.If you’re feeling a little FOMO, not to worry; here are my favorite takeaways from each speaker that you can also walk away with.SpeakerTopicTakeawaysJes ScholzFrom search to surfaces: Your guide to Google’s metamorphosisJes made a powerful case for the seismic shift that search is on the verge of in the Gemini era. Google is moving away from using schema.org and its ~1,400 defined entities for understanding content towards Gemini’s ~175 billion parameters. As a result, Google is re-training people to stop searching with only 2-5 words and rather embrace longer, conversational, context-rich searches instead.Jonas GrünfeldDigital PR trends for 2024 to get top resultsJonas shared three practical digital PR strategies.Prioritizing relevance over virality.Tailoring content for its purpose.Personalizing outreach in meaningful ways.I especially loved his take on how there are two types of linkable assets: content-based, or expertise (non-content-based).Nik RangerUnlocking the hidden power of internal links with machine learningNik’s talk was nerdy in the best way! She covered exactly how she uses machine learning to programmatically improve internal linking on websites. You can test out the model using the LinkBERT demo.Sally MillsSEO automation: Getting our time backSally shared next-level tips on how she uses AI to automate tasks like web scraping, redirect mapping, and turning keywords and intents into topical maps en masse. So many golden nuggets for making boring (yet essential) processes more efficient. Check out her free automation scripts.James NorquayAffiliate & eCommerce SEO growth: What’s working in 2024James’ talk consisted of rapid-fire tips for 30 minutes straight. Some of my favorites include:Invest in UX if you want your affiliate site to win (and even outrank authority sites).Reverse-engineer who is promoting specific affiliate offers to see how you can create better content.Use BingWMT to find hidden PBNs your competitors may be using.Ana Luna, Benjamin Cleary + Georgia Tan (Panel)Moving the Needle: Search campaigns at enterprise scaleGeorgia, Ana, and Ben answered questions relating to doing SEO at a mid-market or enterprise level. There were some great takeaways for in-house and enterprise folks seeking ideas on how to implement their strategies or to get buy-in from non-SEO executives.Tim SouloKeep your enemies close: How to do competitive intelligence with AhrefsTim shared practical use cases for using Ahrefs as a competitive intelligence tool, including 3 metrics, 3 actionable tips, and 3 tools including my favorite, the portfolio feature. You can use this to compare a segment of a competitor’s site to yours or track all your competitors as a batch so you get updated competitors’ stats anytime you need them.Greg GiffordHow to be a local SEO superheroGreg’s presentation was dynamic and full of local SEO hot tips. I especially loved Greg’s tip about getting links from churches, charities, and other hyper-local, trusted organizations in your area. Local links like this tie in with his advice to turn your blog into a local destination and a place that local folks turn to for content about the area, not just about your services.Regan McGregorTrust or bust: Winning over users and bots in SEORegan took a deep dive into all things E-E-A-T with some great examples of how to run a detailed E-E-A-T-based brand audit. My favorite tip was using Google search operators like [example.com -site:example.com] to find indexed brand mentions on sites other than your own.Aaron TaylorThe third pillar of SEO: User interactionsI’m biased towards paying extra attention to all things combining SEO and UX. So Aaron’s talk on the impact of user interactions in SEO has a soft spot in my heart of SEO hearts. My top takeaways: For low-competition SERPs, focus on query relevance.For more difficult SERPs, prioritize content quality and consider user interactions.For difficult SERPs, it’s all of the above plus your site’s authority.Dejan MladenovskiProgrammatic SEO: A winning formula for scaling growthWhat an energetic speaker to close off the day! I loved Dejan’s tips on making the most out of programmatic SEO. And it wasn’t about creating quasi-spam, mass-AI pages at scale. I loved his takeaways on using APIs, next-level programmatic internal links, and programmatically inserting hreflang. My #1 tip was to only consider a programmatic SEO campaign for keywords and topics with over 20,000 searches a month if you want to get a return on investment.Final thoughtsGood vibes, fun folks, and expert speakers. What more do you need?With some top-level speakers already secured for next year’s lineup, including Aleyda Solis, Kyle Roof, and Cyrus Shephard, I encourage you and your team to join me at Sydney SEO Conference in 2025.See how much fun these folks are having? This could be you next year.It was great to host over 300 SEOs and Digital Marketers at the 2024 Sydney SEO Conference.With 98% of attendees saying they want to attend again in 2025, tickets are available and now selling out quickly already. Thanks to all the great speakers and sponsors on the day! pic.twitter.com/6oYRbpZosL— James Norquay (@connections8) March 12, 2024 See you there 😉 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Despina Gavoyannis Despina is a Senior SEO Consultant with 8+ years of experience growing B2B, e-commerce, SaaS, and national brands. She's an optimist at heart, taking time to enjoy life's silver linings each day. Keep Learning WordPress SEO: 20 Tips and Best Practices WordPress makes it easy to use SEO best practices. Improve your site's SEO with the tips in this guide. SERP Tracking With Free Tools: A Beginner’s Toolkit Looking for a reliable way to check the SERPs without spending a dime? SEO Copywriting: What It Is & How to Do It SEO copywriting is creating high-quality content that appeals to search engine algorithms and human users. Learn how to do it well.",
  "headers": [
    {
      "level": "H1",
      "text": "Sydney SEO Conference: “An Absolute Belter”"
    },
    {
      "level": "H2",
      "text": "The vibe: 5-star hotel but with a laid-back atmosphere"
    },
    {
      "level": "H2",
      "text": "The crowd: You’ll meet a diverse range of super-smart people"
    },
    {
      "level": "H2",
      "text": "The speakers: You’ll learn from big names and local experts alike"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Despina Gavoyannis"
}