{
  "url": "https://ahrefs.com/blog/top-of-the-funnel/",
  "slug": "top-of-the-funnel",
  "title": "Top-of-the-Funnel Marketing Explained: How to Attract Customers",
  "description": "Our actionable guide to top-of-the-funnel marketing, which helps get your brand in front of new potential customers.",
  "content": "Bill Widmer 8+ years as a digital nomad, Bill is on a mission to travel the world and fund it using SEO and content marketing. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Marketing funnels are visual representations of the stages a customer goes through, from first learning about your brand to becoming a customer.Each marketing funnel is split into three stages:Top of the funnel (TOFU)Middle of the funnel (MOFU)Bottom of the funnel (BOFU)Today, we’ll be talking about top-of-the-funnel marketing.ContentsWhat is top-of-the-funnel marketing?Top-of-the-funnel marketing refers to the marketing strategies and tactics used to create awareness of your brand or product.TOFU is the content you create—be it a PPC ad or a blog article—that gets your brand in front of new potential customers. Why is top-of-the-funnel content important?TOFU content is important because it’s often the broadest marketing strategy, i.e., the more prospects at the top, the more customers at the bottom (usually). Additionally, generating awareness about your product/service helps to generate the need for it.For example, let’s say you sell wild-caught canned tuna. Your TOFU content can be a blog post about the issues with farm-raised tuna, sharing why it’s a problem and why wild-caught tuna is better for you and the environment.This blog post plants the seed in potential customers’ minds that they may want to start buying wild-caught tuna over farm-raised ones. From there, MOFU content can be a blog post discussing the different companies that catch wild tuna and their practices, and BOFU content can be a post talking about why your company has the best tuna and fixes the problems other companies create.With MOFU and BOFU content, you’re competing with other companies for the customers’ attention. But with TOFU content, you’re catching them before they’re even aware of your competitors and building trust with them before they get to the research and purchase stages, increasing your chances of capturing the final sale. That’s why TOFU content is so important—it’s the first chain in the link.Five top-of-the-funnel marketing tactics to tryReady to add TOFU to your marketing menu? Here are five TOFU marketing tactics worth implementing in your business:1. Writing blog postsI already mentioned how a blog post can be an important TOFU content piece with the tuna example. But that’s just one of many—nearly every business can benefit from writing blog posts as TOFU content.Let’s look at a real example. I run a blog called Adventures On The Rock, which makes money by reviewing and promoting overlanding and camping products. My goal is to get my readers to purchase my recommended products so I can make a commission.At the top of the funnel, I need to make people aware of what overlanding even is and why people might like to try it. So I wrote an article, explaining it all in detail:From there, that article leads to other stages of the funnel by talking about what kind of gear you need and where to buy that gear.I found this topic through keyword research. I started by researching the keyword “overlanding” on Ahrefs’ Keywords Explorer and found that most of the websites ranking for this keyword wrote an article explaining what overlanding is and how to get started.You can find TOFU article ideas in the same way. Enter a broad seed keyword into Ahrefs’ Keywords Explorer (or our free keyword generator tool) and peruse the results.2. Utilizing SEOPushing the blog post tactic a step further, you can use SEO to get your TOFU content in front of new people every month—for free and automatically.For example, I wrote a TOFU article about SEO writing on this blog. It ranks on the first page for keywords like “what is seo writing,” “writing for seo,” and over 100 others:This single article brings over 1,500 new visitors to our site every month and leads the readers toward using Ahrefs to assist them in their SEO tasks.Other examples of TOFU SEO include:Bank My Cell’s guide to resetting your iPhone without a password (15,000+ visits per month).Equifax’s guide to what a good credit score is (95,000+ visits per month).Tie.com’s guide to how to tie a necktie (36,000+ visits per month).Want to learn more? Review our SEO basics guide.3. Posting to social mediaSocial media is an obvious marketing channel for any business—and it is perfect for spreading brand awareness (i.e., TOFU content). There are a lot of social media platforms and a lot of ways to use them. I can’t possibly cover them all in one article, but I can give you a few examples.1. TacomaBeast: Instagram View this post on Instagram A post shared by tacomabeast (@tacomabeast)TacomaBeast uses Instagram (and other social platforms) extremely well. It has a highly targeted niche audience (Toyota Tacoma owners) and posts TOFU content on a near-daily basis. Its posts often appeal to the niche as a whole—people who own Tacomas and want to see cool Tacoma mods and builds in action, and those who don’t yet know the brand.These posts are shown to its existing audience but are also shown to many accounts that don’t currently follow it, building brand awareness. This is especially true with Instagram Reels and TikTok videos.2. Duolingo: TikTokhttps://www.tiktok.com/@duolingo/video/7227110985251736874Speaking of TikTok, few brands use it as well as Duolingo. It is an app that teaches you how to speak other languages—but you wouldn’t be able to tell that from its TikTok videos.It embraces the idea of virality and simply getting its brand in front of people over trying to sell its product with its videos. Because of this, its videos are seen by hundreds of thousands and even millions of people—people who could potentially become users of the app.3. The Wandering RV: PinterestThe Wandering RV gets thousands of new visitors every month from Pinterest. It has Pinterest-sized graphics on every blog post on its site and always shares them when they’re published.For example, it has posted pins about RV meal ideas. Once a person reads this article, they see links to RV cooking gear and accessories. These push them further down the funnel.You can do the same by grabbing a free Canva account and using the “Pinterest pin” template. Canva has thousands of templates you can easily modify to fit your brand.4. Running PPC adsSometimes, you need to pay to play, and running PPC ads is one of the best ways to get your brand in front of new audiences.You can run ads in many places:Search engine adsSocial media adsDisplay adsEtcOne of the easiest ways to start doing this is by copying what’s working for your competitors. Head to Ahrefs’ Site Explorer, plug in a competitor’s website, then click the Paid keywords report in the left-hand menu.You’ll often see a lot of branded keywords and MOFU/BOFU keywords in here, but sometimes you’ll come across non-branded TOFU keywords you can put a competing bid on.Better still, TOFU keywords are often very cheap to bid on, since not as many people are running ads for them.For example, we occasionally run PPC ads for keywords like “crawl a website” and “content idea,” which have virtually no competition and are TOFU queries.These also happen to have a very high Keyword Difficulty (KD), meaning they are tough to rank for organically on Google’s first page. By running ads to these keywords, we can bypass the competition without spending a lot of money. Check out our guide to PPC marketing to learn more about this tactic.5. Direct outreachLast but not least, you can use direct outreach as a TOFU marketing tactic. These include:Email outreachDirect mailPhone callsWhile direct mail and phone calls can work great to find new clients, email outreach is the most scalable for the majority of online businesses because it requires the least in terms of time and money.I use direct outreach to build links to my content, promote my articles, and find marketing partners and new customers. It’s a versatile and effective tactic.For example, I recently ran a study ranking the top states in America to go camping, then used email outreach to get journalists to publish news articles with my findings. This study resulted in over 40 new backlinks to my site, including some from MSN, Yahoo, and TimeOut Magazine.In addition to these high-powered links, the study also sent thousands of new visitors to my website. If you want to learn how you can do something similar, check out our guide to digital PR and read up on how to send a good outreach email.Final thoughtsThe top of the funnel is typically where the widest-reaching marketing tactics lie. But because it’s so far from where consumers make their final purchase, it’s not the most obvious marketing choice.However, TOFU content is where you plant the seeds that can scale your business in the future. While it shouldn’t be the first area you put time and money into, it shouldn’t be ignored either.Questions or comments? Ping me on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Keep Learning What Is Marketing Automation & How to Get Started? Marketing automation uses software, tools, etc., to automate repetitive tasks, freeing up time for important tasks or increasing efficiency. What Is Experiential Marketing? 22 Examples & Takeaways Experiential marketing provides prospects or customers with real-life experiences to achieve various marketing goals. B2B SaaS Marketing: The Ahrefs Guide Dive into what B2B SaaS marketing is, explore different tactics, and learn how things are done the Ahrefs way. I Asked 26 Marketers for Their Best Marketing Books. Here’s What They Recommend These are the best marketing books that influenced the work of actual practicing marketers. How to Use WordPress to Build a Website (Beginner’s Guide) What a beginner needs to know about building a site on WordPress summarized into nine easy-to-follow steps.",
  "headers": [
    {
      "level": "H1",
      "text": "Top-of-the-Funnel Marketing Explained: How to Attract Customers"
    },
    {
      "level": "H2",
      "text": "What is top-of-the-funnel marketing?"
    },
    {
      "level": "H2",
      "text": "Why is top-of-the-funnel content important?"
    },
    {
      "level": "H2",
      "text": "Five top-of-the-funnel marketing tactics to try"
    },
    {
      "level": "H3",
      "text": "1. Writing blog posts"
    },
    {
      "level": "H3",
      "text": "2. Utilizing SEO"
    },
    {
      "level": "H3",
      "text": "3. Posting to social media"
    },
    {
      "level": "H3",
      "text": "4. Running PPC ads"
    },
    {
      "level": "H3",
      "text": "5. Direct outreach"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Bill Widmer"
}