{
  "url": "https://ahrefs.com/blog/top-amazon-searches/",
  "slug": "top-amazon-searches",
  "title": "Top Amazon Searches",
  "description": "Do you want to know what people in the United States (and around the World) search for most on Amazon as of 2021? Here are the top 100 queries.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Are you curious as to which products get the most searches on Amazon? Today is your lucky day.In this post, I’m going to share the following new pieces of data with you:Top 100 Amazon searches (US): a list of the most popular Amazon searches in the US as of 2021.Top 100 Amazon searches (Worldwide): the same data but with searches from outside of the United States (and with global search volumes).But first, a quick suggestion for those doing Amazon keyword research:You can see Amazon search volume data for 152 million keywords in Ahrefs’ Keywords Explorer.Sidenote. Here are the top searches on Google, Bing, and YouTube—in case you missed them. Now, it’s data time!Top 100 Amazon searches in the US#KeywordSearch Volume1nintendo switch1,263,4072laptop1,099,3463airpods855,8234headphones788,3905wireless earbuds703,0936ipad697,4517game of thrones653,7498fire stick622,1729ssd610,06310fitbit591,24411kindle581,66312tv580,18813air fryer561,40114bluetooth headphones549,82715roku548,87116toilet paper519,44917external hard drive506,23818tablet495,97719instant pot494,06520micro sd card493,33521gaming chair482,49122apple watch480,14023monitor473,30024earbuds465,04925ps4454,25326alexa444,65727paper towels440,16628desk429,14429office chair407,84430ring doorbell396,56131chromebook394,53532weighted blanket393,38433water bottle386,52734gift cards for amazon384,25835backpack382,83236hdmi cable375,42437lego370,83638wireless mouse370,51239mouse pad366,86540iphone charger351,93541hydro flask350,34742bluetooth earbuds350,00643gift card340,44244echo dot339,48645gaming mouse339,34046switch337,96247printer333,91048nintendo switch games333,55349keyboard331,99750bluetooth speakers331,26851iphone324,02252coffee320,40753aa batteries317,79754ps4 controller316,22555wireless headphones315,81956mouse314,68557shower curtain313,72858the boys313,01559shoes311,62160amazon gift cards311,15161led strip lights306,38562smart watch306,35363harry potter303,50064cbd oil303,38665kindle fire302,31766pop socket298,29667sd card295,96268xbox one controller294,26069ring292,78570microwave291,45671usb c cable290,46772good omens290,43573doctor who289,73874mattress286,36675gaming laptop286,31776hbo282,18477vacuum cleaner281,17978prime video272,18279iphone xr cases271,33980protein powder265,66681computer desk265,17982socks262,24583avengers endgame259,91184echo256,23185shoe rack251,83986iphone 11 case250,70487tv stand250,23488yoga mat249,78089aaa batteries249,03490gaming headset248,14391computer monitor247,99792blender246,48993books246,44194gaming pc243,36195dash cam241,44896pokemon241,28697luggage240,84898usb hub240,65499camera240,313100projector239,730Right away, you can see that searches for gadgets dominate this list—laptops, bluetooth speakers, smartwatches, SSDs, gaming controllers and so on.So much so, that 50% of searches are for gadgets.That’s excluding searches for iPhone accessories too, of which there are many.Here are the most popular ones:#KeywordSearch Volume1iphone xr cases271,3392iphone 11 case250,704Speaking of iPhone accessories, there are ~550,000 monthly searches for “Bluetooth headphones,” which makes it the 14th most popular product search on our list. That’s no doubt down to Apple (and other phone manufacturers) removing headphone jacks in recent years.Sidenote. There are a further ~316,000 searches for “wireless headphones,” and ~350,000 for “Bluetooth earbuds.”Amazon also seems to be a popular place to purchase games consoles and games.The Nintendo Switch tops the list with 1.26M monthly searches, followed by the PS4 with ~454,000.Gaming mice and chairs are popular too, with ~822,000 combined monthly searches.But what else is popular on Amazon besides gadgets and games?Well, there are still a fair few searches for “books” (~246,000) which, of course, is what started this whole thing for Amazon back in the ’90s. But it looks as though most people prefer to do their reading on electronic devices these days as there are~582,000 searches for “kindle.”The Kindle isn’t the only one of Amazon’s branded devices that’s popular either—their Fire Stick and Echo products get hundreds of thousands of combined monthly searches.Other than that, there are lots of searches for everyday essentials and other “basic” items:#KeywordSearch Volume1toilet paper519,4492paper towels440,1663water bottle386,5274coffee320,4075aa batteries317,7976shower curtain313,728Oh, and one non-physical product made it to the list too: “prime video” (~272,000 monthly searches).Is Amazon catching up with Netflix? Maybe.Either way, one thing is for sure: Amazon is genuinely an everything store. It’s no longer just about books.Now let’s see the most popular Amazon searches in the US compared to the rest of the World.Top 100 Amazon searches globally#KeywordSearch Volume1nintendo switch3,148,9762laptop2,460,8553ssd2,301,2924ps41,769,7995kindle1,744,7156airpods1,686,0287ipad1,646,5278tablet1,435,3579alexa1,395,73210headphones1,380,82111iphone1,362,35212game of thrones1,356,41413lego1,288,88614switch1,234,68215fitbit1,153,23116tv1,116,70217harry potter1,096,50818monitor983,49419xiaomi959,21520apple watch873,77321wireless earbuds843,96022iphone 7825,89823fire stick816,57824bluetooth headphones807,50825iphone x786,57626samsung740,87927iphone xr737,52028iphone 8736,01329micro sd card718,75830gaming chair714,90331echo dot706,25932air fryer698,95133mouse695,47534smartphone672,08435smart watch668,84636star wars659,98637ps4 controller647,03438external hard drive643,12539water bottle640,88440instant pot630,70941roku624,37442keyboard624,21543chromebook622,89844pokemon615,58845huawei598,80246echo596,51947gaming mouse595,75148iphone 11583,85749backpack583,44950earbuds579,57151shoes577,30952toilet paper575,55653gaming pc571,72754playstation 4569,33855smartwatch560,87956wireless mouse557,02257desk551,68658power bank551,33959office chair550,23960notebook548,62461xbox one542,32162printer533,69763earphones531,84564mouse pad531,09065gaming laptop530,42166hdmi cable523,34767wireless headphones523,11168chromecast521,33069amazon501,58270nintendo switch games499,46371the boys497,02572drone494,57773sd card494,57374gift card494,23175xbox one controller493,40176ps4 games487,16877books486,75478camera483,90279avengers endgame479,78480ring doorbell477,03881gopro475,99882redmi note 7474,22583ipad pro474,12684ps4 pro469,93185powerbank468,82486funko pop468,28787good omens468,17088laptops467,23789windows 10465,16890lego star wars462,17591weighted blanket457,43292rtx 2060455,72393microwave454,82494anker453,85495fire tv stick453,32896bluetooth earbuds453,14497paper towels452,74998samsung galaxy s10452,25499blender441,503100projector441,020It looks like the Nintendo Switch is just as popular elsewhere as in the United States.Furthermore, “switch” is at #14 with ~1.23M monthly searches.So, I think it’s fair to say that people are lovin’ the Switch!It’s a similar story for iPhones.Here are the top iPhone searches (and their respective volumes):#KeywordSearch Volume1iphone1,362,3522iphone 7825,8983iphone x786,5764iphone xr737,5205iphone 8736,0136iphone 11583,857Interestingly, while there are hundreds of thousands of searches for older models like the iPhone 7 and 8 around the world, these phones didn’t even make it to the top 100 searches in the US.There are also lots of searches for other non-Apple smartphones on this list whereas there were no such searches on the US list.Here are just a couple of them:#KeywordSearch Volume1redmi note 7474,2252samsung galaxy s10452,254However, one of the noticeable differences with the US data is the comparable lack of searches for everyday essentials (toilet paper, paper towels, etc.)For example, although “toilet paper” does still make it into the top 100 Worldwide searches (#52), you’ll notice that the search volume is ~575,000. That’s only ~56,000 higher than the US-only volume, meaning that 90.25% of searches for “toilet paper” come from the US.Perhaps Amazon hasn’t yet made the push into this market outside the US?See more Amazon search data in Keywords ExplorerDo you want to know the number of searches for a specific query on Amazon?Go to Ahrefs’ Keywords Explorer, enter a query and select Amazon as your search engine.Let’s see how many people search for “bellroy” each month in the US.4.7K searches. That’s a lot of people with great taste in wallets!It also looks like Bellroy is popular in Japan, Germany, the UK, Canada, and Australia.But wait, there’s more!Using one of the reports on the left-hand menu, it’s possible to dig deeper and see the other queries people are making on Amazon in relation to this topic.Looks like a lot of people want to buy the note sleeve!Fancy learning more about the searches people are making on Amazon? Try our free Keyword Generator tool. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Keep Learning Top Bing Searches Do you want to know what people in the United States (and around the World) search for most on Bing as of 2021? Here are the top 100 search queries. Top YouTube Searches Here are the top 100 most popular searches on YouTube in the US and Worldwide. Top Google Searches (October 2024) Do you want to know what people in the United States (and around the world) searched for most? Here are the top 100 search queries. How many keywords can you rank for with one page? (Ahrefs’ study of 3M searches) But how many keywords exactly will an average page rank for? That’s the question we wanted to answer (plus a few more), so we picked 3 million random How Many New Backlinks Do Top-ranking Pages Get Over Time [New Data by Ahrefs] Do top-ranking pages get links at a faster pace than lower-ranking pages? We analyzed 200,000 top-ranking web pages across 10,000 keywords to find out.",
  "headers": [
    {
      "level": "H1",
      "text": "Top Amazon Searches"
    },
    {
      "level": "H2",
      "text": "Top 100 Amazon searches in the US"
    },
    {
      "level": "H2",
      "text": "Top 100 Amazon searches globally"
    },
    {
      "level": "H2",
      "text": "See more Amazon search data in Keywords Explorer"
    }
  ],
  "author": "Joshua Hardwick"
}