{
  "url": "https://ahrefs.com/blog/topical-authority/",
  "slug": "topical-authority",
  "title": "What Is Topical Authority in SEO & How to Build It",
  "description": "Topical authority is an SEO concept where a site aims to be the go-to authority on one or more topics. Learn how to build it in four steps.",
  "content": "Jake Sheridan Jake is a writer, marketer & spreadsheet wrangler @ Sheets for Marketers. He's a fan of dogs, SEO & pizza. Sometimes at the same time. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Imagine if your website (or clients) could rank for every single keyword related to a desired niche.Enter topical authority.Now imagine that you could even achieve this with no link building.If some people in the SEO world are to be believed, this is achievable by anyone willing to write content about absolutely everything within a topic.But realistically, you should still expect to build links and do a lot of other SEO activities. Topical authority is not a silver bullet.But it’s still worth your time. In this guide, you will learn everything you need to know about topical authority and how to build it for your sites.ContentsWhat is topical authority?Topical authority is an SEO concept where a website aims to become the go-to authority on one or more topics. Building topical authority is about helping search engines understand a website’s topic so that it has better potential to rank for topically related keywords.Let’s say you want to rank articles around the topic of protein powder. Writing just the one article targeting “protein powder” is probably not enough to compete in this niche.Why? Because it’s a massive topic and you can’t possibly cover everything about it in one article.To build topical authority, you need to cover everything related to protein, such as: “what is protein”“what does protein powder do”“what is the best protein powder”“how to use protein powder”“how long does protein powder last”“how to use protein powder for weight loss”Topical authority is achieved when a site fully covers a topic as a whole rather than focusing on just individual keywords. If you’ve spent any time digging into the SERPs looking for SEO opportunities (and let’s be honest, you have), you’ve probably noticed sites with low Domain Rating (DR) scores ranking well—thanks to topical authority.For example, check out the SERPs for the keyword “mountain bike gifts”:At first glance, you’d expect to see a big e-commerce store like Amazon (DR 96) at the top of the search results for a product-focused keyword like this.However, a DR 23 site is ranked in second place, well above Amazon.Why is this?Possibly because twowheeledwanderer.com is a site all about the topic of bikes. Whereas Amazon (although much stronger in terms of SEO metrics) lacks the topical authority for its domain, as it sells more general stuff.Although it should also be noted that search intent plays a big part here too. Amazon is the only page on these SERPs ranking with a product category page, whereas the rest are articles/gift guides.This is just one example where a website with topical authority has outranked more established players.Why is topical authority important (for SEO)?Google, as a search engine, works with semantic associations. This means it has to associate a website with a topic in order to rank it as a relevant resource for keywords that are part of that topic.If you have a lot of content about a certain topic, this allows for more relevant internal links, which allow Google and users to find your content more easily which, in turn, may land you more natural backlinks.If you take away nothing else from the concept of building topical authority, take this:When you create content pieces around the same subject and interlink them, your topical authority in the eyes of Google increases. This helps to show it that you’re knowledgeable, aka an authority on the topic and a trusted source.Before we go any further, let’s discuss the elephant in the room:How does topical authority work?Spoiler for this section: No one really knows.With the introduction of Google’s Hummingbird algorithm in 2013, topical authority became increasingly important. It changed the ranking system for content so that it was determined by relevance to a user’s search query. Prior to Hummingbird, keywords were the main emphasis of Google’s search algorithms. In order for Google to understand what a user was looking for, keywords were used.However, Google simply couldn’t understand the context behind user searches. A (very) brief history of Google and authorityOver the years, Google has moved more toward semantic search:2011 – Google announces “Structured Search Engine” for structuring the information on the web.2012 – Google launches Knowledge Graph for better understanding information about real-world entities.2013 – Hummingbird algorithm ranks sites based on inbound links and keywords. Google can now rank content based on relevancy to a query. 2018 – Google’s Medic update means YMYL content needs to show expertise, authority, and trustworthiness (E-A-T) in order to rank.2019 – BERT is launched. It is a model for better understanding relationships between words, concepts, and entities in human language.You can’t really talk about topical authority without mentioning E-A-T at some point.E-A-T (expertise, authority, and trustworthiness)Google’s emphasis on “expertise” and “reputable websites” can be seen in its Quality Rater Guidelines:Highest quality pages and websites have a very high level of expertise or are highly authoritative or highly trustworthy.This suggests that building a reputation for your website as a “subject matter expert” is likely to contribute to the “authority” aspect in E-A-T. While E-A-T is not a direct ranking factor, the concept helps to inform the ranking algorithms. So when Google views your website as an expert resource on a topic, it’s more likely to rank your content higher.Learn more: What Is E-A-T? Why It’s Important for SEOHow to measure topical authority The lack of clarity around the whole concept of topical authority contributes to having no definitive way to measure it.Sure, more rankings and more traffic may be a good sign. But they just as well may be a result of link building or other SEO activities.Thankfully, there are smart people like Kevin Indig, who devised a way of roughly calculating topical authority using the Traffic share by domains report in Ahrefs’ Keywords Explorer:Here’s how to calculate the proxy to topical authority in Ahrefs:Take a head term like “ecommerce” and enter it in Keywords ExplorerGo to the Matching terms report and filter for a minimum volume of 10Export all keywords and reupload them into Keywords ExplorerGo to Traffic share by domainsTraffic share = topic share aka “topical authority”How to build topical authority in four stepsSo how do you build topical authority for your site?First, you need to cover all the obvious SEO basics. Assuming you’ve got the basics covered, building topical research is pretty straightforward. In very simple terms, you need to:Do keyword research to find all the talking points within a topic.Organize that data into topic clusters.Produce content that meets the search intent of those topic keywords.Build relevant internal and external links to your content.At the risk of becoming an authority on the topic of wasting time by rambling on about things no one really knows other than Google…Let’s crack on and learn how to build some topical authority.1. Do topic-based keyword researchIt should come as no surprise that the starting point for building topical authority is keyword research. Identifying queries that users are searching for and topics of interest is the beginning of most SEO projects, and building topical authority is no different.To be considered a “topical authority” by Google, you need to find and write about all the talking points within a topic.Sidenote. Google’s main goal is to give people the most relevant answers to their search queries as quickly as possible. Your focus should be the same. Instead of thinking about an article as focused on a single keyword, think of them in terms of topics and subtopics. You’ll want to try and cover everything in your content that Google expects to see.Choosing a good seed keyword is the foundation of your topical research. Identifying a seed term that is relevant to your topic is key. Here’s how to approach picking a good seed keyword for doing topical keyword research:TopicGood seed keywordsBad seed keywordscoffee roasting processcoffee roasting coffee roasterscoffee roastingtaking care of dogsdog care dog healthanimals dogsall kinds of mountain bikingmountain bikes mountain bikersbicycles bikesWhy are they good/bad?Clearly focus on the topicToo vague/specific; potential for lots of irrelevant KWsStruggling to think of useful seed terms?Try and pick seed keywords that represent an entity in Google’s Knowledge Graph. Entities in SEO are a complex subject and far beyond the scope of this article and my soft monkey brain to tackle right now.So for the purpose of speeding up seed keyword selection, I’ll use entities straight from the horse’s mouth:Go to Google ImagesDrop in my broad topic Check out the image filters (these are the entities that Google associates with the topic)Once you have selected a seed keyword, it’s time to expand the list.For example, let’s say you want to build topical authority around the topic “project management software.” You’ll want to create content around keywords like:“project management software benefits”“project management software for students”“project management software definition and examples”“best project management software”“project management software for business”To get to this point is relatively simple, although it can be time consuming. Drop a broad seed term in Keywords Explorer. The overview acts as a good starting point for understanding the topic.Continuing with the topic of “project management,” here’s what you want to pay attention to: Top-ranking resultAs the name suggests, this is the top-ranking page for the target keyword:This is a great starting point for research. At a glance, you can see how many keywords this single page is ranking for:Given that this is the top-ranking result, the keywords here are usually key subtopics you’ll want to cover—or at least provide an indication of.Keyword ideas and questionsStill on the “Overview” panel, you can quickly see the top questions being asked around the topic:SERPsOne of the best places to get more SEO data is on the SERPs, and topical keyword research is no different.What I like to do here is expand the list to show the top 100 ranking pages (click Show more) and then cherry-pick low-DR sites that are ranking for a good number of keywords.This site stood out to me because it is DR 32 with a little over 200 keywords and ranking in a sea of DR 70+ sites. This is a good sign that this site has a good amount of topical authority for me to leverage in my own research.Traffic share by domainsIt’s also worth hopping over into the Traffic share by domains report. This report shows the domains that get the most organic traffic based on your seed keyword input:This is useful for seeing who are your major competitors, which you can use as sources of more keywords. Cherry-pick domains and drop them into the Content Gap tool to uncover more keywords.Here’s how to uncover more terms from competing domains:Run your site through Site ExplorerGo to the Content Gap toolPick suitable domains from the Traffic share by domains reportApply some filters (if you want)My preference: filter by keyword—in this example, “project management”—and some minimum volume and KD scores Now that you have a list of keywords for topics (that get searched), it’s time to make sense of the keyword data.2. Create topic clustersTopic clusters are interlinked pages about the same subject. The purpose of them is to group relevant content together so that it is easier to find by both users and Google.Armed with your keyword research, you’ll want to organize your list of terms into clusters based on search intent while also considering traffic potential. Your topics should have good traffic potential and typically be informational in intent, like this:Pick a topic for your cluster (or pillar page) that is relevant for your site to target and has enough depth that you will have subtopics to explore. Now, you’ll want to pick the most appropriate content format to create for the cluster: Guides – An evergreen content format that fully covers a specific topic. What is X – A deep-dive definition or answer to a question. How to X – A step-by-step tutorial detailing how to do a specific task.These pages should be well structured with enough content to be useful as stand-alone articles but also link to more in-depth articles within the topic. Once you have your topic pillar nailed down, you’ll want to go “more niche.”Just taking a quick look at the “how to get into project management” example, we can see more potential subtopics to target:These pages should be fairly comprehensive and link to other topic pages and cluster content. Linking between your pages is vital for topical authority. Doing so helps build a semantic relationship between those URLs, telling Google that these pages are topically related. 3. Write authority contentNow it’s time to take your keyword research and topic clusters and create some content.The way to establish topical authority that most people are familiar with is by creating in-depth content. Start with your main pillar content pieces. Generally, you will want to have a pillar page for every type of product or service you provide or the main area of the subject you want to be seen as an authority on.These focus topics should be broad enough that they have subcategories to target but also specific enough that a searcher landing on your page will find them relevant.Ahrefs’ beginner’s guide to SEO does a good job of acting as an overview of the topic, and then directing users to more specific parts of the topic (in the stand-alone chapters):Next, you’ll need to write supporting content.Instead of writing about a topic in general, be more specific. Supporting pages should match user intent and are where you can gain more content depth. You’ll typically find that these pages are the ones where you will target long-tail keywords.For each piece of content you create to help build your topical authority, you’ll want to:Write quality content that aligns with your topic and what your audience actually wants to read.Keep E-A-T in mind. Cover as many topics and subtopics as you can.Match search intent (e.g., write a how-to guide for the [how to X] keywords, a list of benefits for [benefits of X], etc.).Internally link to different relevant topics.Continually update your content as it ages.4. Build relevant linksEven the best content sometimes needs links to rank better.When it comes to link building for topical authority, you need to make sure that the websites that link to you are relevant. If you run a blog about coffee, getting a link from another bigger coffee website in your niche will be perfect. Whereas getting a link from a finance blog will be less relevant and, therefore, carry less weight. Relevance is the key.Here are a few topical backlink tactics:Guest blogging – Create useful content for topically related websites.Skyscraper Technique – Create the go-to resource on the topic.Ego bait – Mention key players in your niche and reach out to them.HARO – Get “expert quotes” for your article.Of course, it’s not just links on external sites you should be building but internal links on your own site too. In fact, these are pivotal for building topical authority.Google uses internal links to help discover new content (source):Some pages are known because Google has already crawled them before. Other pages are discovered when Google follows a link from a known page to a new page.Each pillar page should be treated as a hub for that topic. Use internal linking to connect it to every piece of supporting content. For instance, using the “mountain bike” example again, all your pages on tires, helmets, tools, etc., should link back to your pillar page on mountain bike accessories.Still have questions about building topical authority? You’ll like the final section.Topical authority FAQsHere are answers to a few common questions you may have about topical authority:What is topical relevance?Topical relevance is the relevance that the content on a website has in relation to a particular topic. Search engines use it to determine how relevant a page is to a user’s search query based on factors like content, backlinks, and keywords.What is semantic SEO?Semantic SEO is the process of building more meaning and topical depth with content. This is used by search engines to return the most relevant search results. Semantic search focuses on the meaning behind search queries instead of traditional keyword matching.Learn more: What Is Semantic Search? How It Impacts SEOWhat is website authority?Website authority is a metric created by SEO tool providers to measure the strength of a site’s backlink profile compared to other sites in their index.Learn more: How to Increase Website Authority (Domain Rating)Are there any data-backed topical authority case studies?I’m glad you asked.Topical authority is a massive subject. There’s a lot of work out there done by people smarter than me in this field. Here are some case studies you should check out:Topical Authority and Coverage (full case study)Importance of Topical Authority: A Semantic SEO Case Study (condensed case study)Growing Monthly Website Traffic By 3012% Final thoughtsAlthough it can be a powerful tool for ranking on Google, topical authority is not a magic fix for all of your SEO needs. It requires a lot of work and can take some time to kick in, but it’s worth pursuing if you want to rank for all the keywords in your niche. Just keep this in mind and you can’t go wrong:Write about everything your audience wants to know—even better if the keywords align with your product/service.Got a question on topical authority? Tweet me. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Keep Learning How to Increase Website Authority (Domain Rating) Learn what website authority is, how Domain Rating (DR) is calculated and how to increase your score the right way. Steal Our SEO Report Template (Inspired by SEO Experts) Not sure how to create the perfect SEO report? Steal our SEO report template and make it even better as we go through it slide by slide. How to Use Yoast SEO to Improve SEO Yoast SEO is a popular WordPress plugin that helps you optimize blog posts for SEO. Learn more about how it works and its key features. Continuous SEO: Can You “Complete” SEO? Can you really “complete” SEO, or should it be continuous? We'll answer that, plus share tips for implementing a continuous SEO strategy. Quick SEO: 8 Ways to Accelerate SEO Results From Months to Days Think all SEO progress is slow as molasses? Think again.",
  "headers": [
    {
      "level": "H1",
      "text": "What Is Topical Authority in SEO & How to Build It"
    },
    {
      "level": "H2",
      "text": "What is topical authority?"
    },
    {
      "level": "H2",
      "text": "Why is topical authority important (for SEO)?"
    },
    {
      "level": "H2",
      "text": "How does topical authority work?"
    },
    {
      "level": "H3",
      "text": "A (very) brief history of Google and authority"
    },
    {
      "level": "H3",
      "text": "E-A-T (expertise, authority, and trustworthiness)"
    },
    {
      "level": "H2",
      "text": "How to measure topical authority"
    },
    {
      "level": "H2",
      "text": "How to build topical authority in four steps"
    },
    {
      "level": "H3",
      "text": "1. Do topic-based keyword research"
    },
    {
      "level": "H4",
      "text": "Top-ranking result"
    },
    {
      "level": "H4",
      "text": "Keyword ideas and questions"
    },
    {
      "level": "H4",
      "text": "SERPs"
    },
    {
      "level": "H4",
      "text": "Traffic share by domains"
    },
    {
      "level": "H3",
      "text": "2. Create topic clusters"
    },
    {
      "level": "H3",
      "text": "3. Write authority content"
    },
    {
      "level": "H3",
      "text": "4. Build relevant links"
    },
    {
      "level": "H2",
      "text": "Topical authority FAQs"
    },
    {
      "level": "H3",
      "text": "What is topical relevance?"
    },
    {
      "level": "H3",
      "text": "What is semantic SEO?"
    },
    {
      "level": "H3",
      "text": "What is website authority?"
    },
    {
      "level": "H3",
      "text": "Are there any data-backed topical authority case studies?"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Jake Sheridan"
}