{
  "url": "https://ahrefs.com/blog/trending-topics/",
  "slug": "trending-topics",
  "title": "Top Trending Topics (October 2024)",
  "description": "From our database of 28. billion keywords, we’ve pulled a list of keywords that are currently trending or trended in the past three months.",
  "content": "Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Below are the top trending keywords in the U.S. from the past three months.They’re the keywords with the highest average search volume increase from our database of 28.7 billion keywords.Sidenote. Search volume is how many times a given keyword gets searched in Google per month.Top 100 trending topics in the U.S.These topics are trending or trended in the United States:#TopicSearch growth1sport climbing combined olympics+351M%2hurricane helene tracker+165M%3who shot trump+73M%4trump harris debate+37M%5new england patriots vs new york jets match player stats+37M%6chicago bears vs houston texans match player stats+36M%7trump shooter+35M%8kansas city chiefs vs atlanta falcons match player stats+34M%9tennessee titans vs chicago bears match player stats+32M%10sonya massey+31M%11carolina panthers vs las vegas raiders match player stats+30M%1249ers vs minnesota vikings match player stats+28M%13summer olympic games medals+28M%14denver broncos vs seahawks match player stats+26M%15olympics 2024 schedule and results+23M%16los angeles rams vs arizona cardinals match player stats+23M%17new york giants vs washington commanders match player stats+21M%18steelers vs denver broncos match player stats+20M%19dallas cowboys vs cleveland browns match player stats+20M%20thomas crooks+20M%213x3 basketball at the summer olympics schedule+19M%22where to watch summer olympic games+19M%23who shot donald trump+18M%24gymnastics rings olympics+18M%25argentina national football team vs colombia national football team stats+18M%26artificial sweeteners blood clots+17M%27bob newhart+16M%28harris trump debate+16M%29how to register to vote in the us+16M%30miami dolphins vs seahawks match player stats+16M%31when is google’s birthday+16M%32debby path+16M%33usa basketball men’s national team+16M%34united states at the olympics schedule and results+15M%35artistic gymnastics olympics 2024 schedule+14M%36kamala harris rally schedule+14M%37september social security checks+14M%38juegos paralímpicos tenis+14M%39eggs recalled salmonella+13M%4049ers vs los angeles rams match player stats+13M%41steelers vs atlanta falcons match player stats+13M%42manchester united f.c. vs liverpool f.c. lineups+13M%43georgia shooting shooter+13M%44spain national football team vs england national football team lineups+13M%45colorado rockies vs yankees match player stats+13M%46benjamin cranford+12M%47ligma+12M%48covid map update+12M%49artistic gymnastics schedule and results+12M%50fantasy pros+12M%51donald trump shooter+11M%52carolina panthers vs new orleans saints match player stats+11M%53die with a smile lyrics+11M%54macaroni cheese recall+11M%55seahawks vs new england patriots match player stats+11M%56how did rich homie quan die+11M%57carl bernstein news+11M%58shop sunglasses on sale+11M%59hurricane update+11M%60home run derby national anthem+10M%61very demure+10M%62trumps shooter+10M%63harris vp choice+10M%64who shot at trump+10M%65chicago bears vs buffalo bills match player stats+10M%66manchester united f.c. vs fulham f.c. lineups+10M%67olympic schedule+10M%68kamala vp pick+10M%69hurricane debby+10M%70spade toothed beaked whales+10M%71harris running mate+10M%72nova h1 earrings+10M%73cal fire map+10M%74detroit lions vs arizona cardinals match player stats+10M%75vela olimpiadas+9.9M%76baltimore orioles vs dodgers match player stats+9.9M%77south korea 2024 olympics+9.8M%78register to vote+9.8M%79did trump get shot+9.8M%80park fire chico+9.6M%81shop mini fridge on sale+9.6M%82netherlands national football team vs england national football team lineups+9.5M%83spain national football team vs england national football team stats+9.4M%84tampon tim+9.4M%85taylor swift kamala harris+9.3M%86kamala trump debate+9.2M%87national anthem home run derby+9.2M%88kamala harris vp pick+9.2M%89harris vp pick+9.1M%90sheikha mahra bint mohammed bin rashid+8.7M%91real madrid vs atalanta bc+8.7M%92thalia graves+8.6M%93current nominations for 76th primetime emmy awards+8.4M%94trump kamala debate+8.3M%95cleveland guardians vs phillies match player stats+8.3M%96spain national football team vs england national football team timeline+8.2M%97arizona cardinals vs buffalo bills match player stats+8.2M%98am i racist movie+8.2M%99rich homie quan funeral+8M%100listeria outbreak deli meats+8M%Below are the most interesting topics that caught my eye.Artificial sweeteners blood clotsMonthly search volume: 43,000Change in search volume over the past 3 months: +17M%The spike in searches for this keyword was due to a recent study that found that the artificial sweetener erythritol could increase the risk of blood clots, raising concerns for heart complications. It seems like searches for this topic has died off since then.Benjamin CranfordMonthly search volume: 43,000Change in search volume over the past 3 months: +12M%The spike in searches for this keyword was because Benjamin Cary Cranford, mayor of Thomson, Georgia, was arrested for allegedly providing inmates with alcohol while they worked in the city. Details about the arrest and incident have not been made public, but it seems like public interest in this case has already dwindled.How did rich homie quan dieMonthly search volume: 28,000Change in search volume over the past 3 months: +11M%Dequantes Devontay Lamar, also known as Rich Homie Quan was an American rapper. The spike in searches was because Rich Homie Quan was found unconscious at home and later pronounced dead on September 5, 2024. He was only 34. An autopsy has been performed, but the cause of death is currently unknown.Very demureMonthly search volume: 27,000Change in search volume over the past 3 months: +10M%The word “demure” is an adjective that means “reserved, modest, and shy.” However, this particular spike was because of TikTok creator Jools Lebon. In a video that has now more than 30 million views, Jools used the phrase “very demure, very mindful” to describe herself. It went viral and many creators on social media started replicating the catchphrase in their own content.Looking at the dip in searches, it’s likely this trend will die off soon.Spade toothed beaked whalesMonthly search volume: 26,000Change in search volume over the past 3 months: +10M%The spike in searches was because, on July 16, 2024, a whale that was found dead on a beach in New Zealand had been identified as a spade-toothed whale. This is a species so rare that it had never been seen alive. Very little is known about the spade-toothed whale.How to find trending keywords in your nicheHere’s how to find keywords that are trending in your niche:Go to Keywords ExplorerEnter a relevant keywordGo to the Matching terms reportClick on the Growth columnFor example, if you search for “coffee”, you can see that “coffee doritos” grew the most in search volume over the past 3 months.If you’d like to see keywords that have trended for longer, you can easily adjust the range between 3, 6, or 12 months:Want to do trending keyword research for your site? Sign up for Keywords Explorer. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Keep Learning How to Use Google Keyword Planner in 2024 Learn how to master Google Keyword Planner with this complete, newbie-friendly guide. The 10 Best Free Keyword Research Tools in 2024 Keyword research is a three-step process. Learn what they are and how you can achieve great results with these free tools.",
  "headers": [
    {
      "level": "H1",
      "text": "Top Trending Topics (October 2024)"
    },
    {
      "level": "H2",
      "text": "Top 100 trending topics in the U.S."
    },
    {
      "level": "H3",
      "text": "Artificial sweeteners blood clots"
    },
    {
      "level": "H3",
      "text": "Benjamin Cranford"
    },
    {
      "level": "H3",
      "text": "How did rich homie quan die"
    },
    {
      "level": "H3",
      "text": "Very demure"
    },
    {
      "level": "H3",
      "text": "Spade toothed beaked whales"
    },
    {
      "level": "H2",
      "text": "How to find trending keywords in your niche"
    }
  ],
  "author": "Si Quan Ong"
}