{
  "url": "https://ahrefs.com/blog/types-of-search/",
  "slug": "types-of-search",
  "title": "3 Types of Searches and How to Target Them",
  "description": "The three types of searches are navigational, transactional, and informational. Are they still relevant in 2021? How do you target them? Learn more in this post.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents If you’ve been in the world of SEO for a while, then you’ll almost certainly know about the three types of searches: navigational, transactional, and informational.These have been around for years, and there are hundreds of blog posts talking about them.But how relevant are these three types of searches in 2021? And how exactly do you target them?In this post, we’ll dig a little deeper into that.But first, let’s make sure we’re on the same page…What are navigational, informational, and transactional searches?Let’s begin by explaining the ‘traditional’ definitions of these search types:NavigationalNavigational searches are where someone is looking for a specific website. For example, if someone types “netflix” into Google, that’s a navigational search because they’re almost certainly looking for Netflix’s homepage.Google knows this, which is why Netflix ranks in the top spot:But navigational searches aren’t always just brand names. If someone searches for “iphone 12 amazon,” that’s also arguably a navigational search. Although the searcher is looking for a specific product, they’ve already decided where they’re going to buy it from—Amazon.Again, Google understands this. Amazon is in pole position:Here are a few more examples of navigational searches:“apple”“iphone”“tv plus”“apple education store”TransactionalTransactional searches are where someone is looking to purchase something specific, but hasn’t yet decided where to buy it from. For example, if someone searches for “buy treadmill,” that’s a transactional search. It’s clear from their language that they’re looking to make a purchase. They’re not looking for information.Looking at the search results, it’s clear once again that Google understands this because all of the top-ranking pages are category pages from ecommerce sites.Here are a few more examples of transactional searches:“buy iphone”“refurbished macbook”“macbook air charger”InformationalInformational searches are where someone wants to find information. For example, if someone searches for “what is a meta tag in SEO” then that’s an informational search because they’re obviously looking for a definition.Interestingly, for many simple informational searches like this, Google not only returns relevant results, but also shows the answer in the search results.Here are a few more examples of informational searches:“best iphone”“iphone 12 vs galaxy s20”“iphone 12 review”“how to back up iphone”How to identify each type of searchBefore we talk about how to target each type of search and whether it’s even possible, let’s first talk about how people usually identify them.Historically, SEO professionals have looked for certain words or phrases in the query to infer the type of search. These are known as keyword modifiers. For example, if a query contains modifiers like “buy” or “purchase,” that’s almost certainly a transactional query.Here’s a cheat sheet of modifiers similar to what many people use:InformationalNavigationalTransactionalwho[brand name]buywhat[product name]couponwhen[service name]orderwherepurchasewhypricehowcheapguidetutorialtipsIf you’re using a keyword research tool like Keywords Explorer, you can use these modifiers to find keywords that fall into each bucket. Just search for a topic, go to one of the keyword ideas reports, then add the keyword modifiers to the “Include” filter.Sidenote. Make sure to choose “any” not “all” when doing this. If you’re looking for informational keywords, an even quicker method is to use the Questions report, which shows keywords phrased as questions (i.e., including modifiers like “what,” “how,” “where,” “when,” etc.)Although this methodology works for identifying some of the keywords that fall into each bucket, it’s far from foolproof because some queries aren’t so obvious.For example, take a keyword like “ideal protein.” From the query alone, it’s impossible to know what the searcher is looking for. Are they looking to buy a product called Ideal Protein (transactional), information about the ideal amount of protein to consume each day (informational), or is there a company called Ideal Protein (navigational)?It’s anyone’s guess.Looking for keyword modifiers can also lead to flat-out incorrect identifications.Take a keyword like “best buy laptops.” If you decided that this was a transactional query because it contains the word “buy,” you’d be wrong. Best Buy is an American consumer electronics company, which is what searchers are looking for here.So if looking at the query itself doesn’t really help matters, what’s the solution?Some SEO professionals use the presence of SERP features to identify the type of search. For example, if there’s a featured snippet in the search results, that probably indicates an informational query.If there’s a shopping carousel in the results, it’s probably transactional.You can also filter for these in the keyword ideas reports in Keywords Explorer.But, again, these methods aren’t foolproof. In our opinion, the only way to truly understand the type of search is to look at the results for the query itself. Because Google aims to deliver relevant results to searchers, the top results are the best proxy for the search type you have at your disposal.Just look at the results for “ideal protein”:The top result is a website called idealprotein.com. So it’s clear that searchers are looking for a particular website and that this is a navigational query.It’s the same story for “best buy laptops,” where the top result is a page from BestBuy.com.However, if you search for “laptops”—another ambiguous query—the results are all product pages from ecommerce websites, which tells you it’s a transactional query.How to target each type of searchMost SEO professionals who group their keywords into navigational, informational, and transactional buckets do so to figure out the type of content to produce to target the query. That process usually goes something like:Informational = blog post.Transactional = product page.Navigational = … you’ll rank for these queries anyway.You might recall that in the introduction to this article, we asked whether the three traditional search types are still relevant or useful in 2021. Hopefully, the answer to that question is becoming obvious.The problem is that these three ‘types of search’ buckets don’t give you enough actionable information to understand how to actually target a keyword.For example, we already established that “laptops” is a transactional keyword, but that doesn’t mean we can throw up any old product page and stand a chance at ranking. We need to understand more about what the searcher is looking for.It’s a similar story for a keyword like “best laptop.”If we look at the search results, it’s clear that this is an informational keyword because all of the results are blog posts, not product pages…… but you’re unlikely to rank by writing any old blog post.Some SEO professionals try to solve this problem with additional search buckets like “commercial investigation.”Commercial investigation keywords are those where searchers have decided they want to buy a type of product but aren’t sure which one to buy. So they’re looking for reviews and comparisons.Look at the results for “best laptop” again, and you’ll see it matches that description. All of the results are blog posts reviewing and comparing laptops. So it’s clear that this is the type of blog post you’d need to write to rank for this query.The problem with this solution is that it’s still extremely limited, as you’d need to create way more than three or four search type buckets to categorize each keyword properly.Is there a better way to classify keywords?Many people in the SEO industry have already asked this very question. If you’re looking for a better way to classify keywords at scale, this post by Kane Jamison is well worth a read. He proposes using SERP features to classify keywords into nine types.But what if you just want to understand the intent behind a few keywords so you know how to target them?In this case, we think a good starting point is to analyze the search results for what we call the “3 Cs of search intent.”Content typeContent formatContent angle1. Content typeContent type refers to the overall type of content in the search result. It will usually be one of the following:Blog postProduct page (like this)Category page (like this)Landing page (like this)For example, all of the results for “speakers” are product category pages:Whereas the results for “audio engine hd3 speakers” are individual product pages:2. Content formatContent format refers to the overall format of the top-ranking pages. It applies mostly to searches where blog posts are the main content type and will usually be one of the following:Step-by-step guideListicleComparison (e.g., ahrefs vs. moz)ReviewHow-to guideFor example, most of the results for “tie a tie” are how-to guides:Whereas most results for “SEO tips” are list posts:3. Content angleContent angle refers to the main selling point of the content. It’s not quite as straightforward as type and format because it varies depending on the topic, but it helps you to understand what searchers care about and who they are.For example, the angle for “best laptops” is clearly freshness as all the results have the current year in the title.That makes sense as technology moves fast. If you’re in the market for a new laptop, a blog post written a year ago probably isn’t much use.On the other hand, the dominant angle for “golf clubs” is price:Why things aren’t always this clearContent type, format, and angle aren’t always so obvious. That’s because there’s mixed intent for some search queries, like “protein powder.”Here, there is a mix of list posts, category pages, and other content formats.In cases like these, there’s no definitive way to target the keyword. You just have to use common sense and make your best guess.How important is understanding intent?Understanding intent properly is critical. We know this from experience.In 2016, we published a blog post about on-page SEO where we studied on-page ranking factors. It was a great informative post that targeted what most would class as an informational keyword. However, it never really ranked for anything.In 2018, we decided to revisit the post to see what went wrong. After taking a closer look at the search results, we realized our mistake: people didn’t want an in-depth study; they wanted a step-by-step guide. We’d gotten the content format wrong.So we rewrote and republished the post—and traffic skyrocketed.We’ve had similar successes with other posts and pages too. You can learn more about those in our full guide to search intent.Final thoughtsAlthough there might be some merit to grouping keywords into navigational, transactional, and informational buckets as a first-pass approach when working with lots of data, you can’t possibly understand how to target a keyword without looking at the SERP and digging deeper.For that reason, we think that grouping keywords into the ‘traditional’ three buckets isn’t enough in 2021. You can’t just group keywords using “modifiers” and assume that they all fall into a specific bucket. You either need to analyze the SERP manually or build a better classification model—like Kane did.Agree? Disagree? Let me know on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Keep Learning How to Target Keywords With Blog Posts (& Get More Search Traffic) Learn the three-step process on how to target keywords using blog posts. Should You Target Zero-Volume Keywords? It Depends Many people say that searching for and targeting zero-volume keywords is a surefire way to get more traffic, but is it true? Keyword Analysis for SEO: Deciding if (And How) to Target a Keyword You can't just depend on keywords with high search volumes—there's so much more to it than that! Let's explore. 8 Most Important Types of Keywords for SEO If you want your content to rank, you must have the right keywords. These are the eight most important types.",
  "headers": [
    {
      "level": "H1",
      "text": "3 Types of Searches and How to Target Them"
    },
    {
      "level": "H2",
      "text": "What are navigational, informational, and transactional searches?"
    },
    {
      "level": "H3",
      "text": "Navigational"
    },
    {
      "level": "H3",
      "text": "Transactional"
    },
    {
      "level": "H3",
      "text": "Informational"
    },
    {
      "level": "H2",
      "text": "How to identify each type of search"
    },
    {
      "level": "H2",
      "text": "How to target each type of search"
    },
    {
      "level": "H2",
      "text": "Is there a better way to classify keywords?"
    },
    {
      "level": "H3",
      "text": "1. Content type"
    },
    {
      "level": "H3",
      "text": "2. Content format"
    },
    {
      "level": "H3",
      "text": "3. Content angle"
    },
    {
      "level": "H2",
      "text": "How important is understanding intent?"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Joshua Hardwick"
}