{
  "url": "https://ahrefs.com/blog/types-of-blog-posts/",
  "slug": "types-of-blog-posts",
  "title": "10 Types of Blog Posts & How to Use Them Effectively",
  "description": "Choosing the right type of blog post depends on the goal of the article and what your audience wants. Here are 10 popular ones.",
  "content": "Rebecca Liew Content marketer and writer. Addicted to words, stationery, and exploring new places on foot. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents When it comes to writing a blog post, there are multiple formats you can use—and it all depends on the goal of your article and what your audience is looking for.Here are some popular types of blog posts to know, along with examples of how to use them:How-to guidesContent hubsExpanded definition postsListicles, aka list postsExpanded list postsNewsData studiesCase studiesCheat sheets and checklistsTemplates1. How-to guidesA how-to post offers a series of specific, chronological steps on how to achieve a goal. It’s typically structured like so:For instance, this post is titled “How to Choose the Right Words for SEO” and shows you how to achieve that goal through a four-step process:Step 1 – Find keywords with search traffic potentialStep 2 – Create content that aligns with search intentStep 3 – Ensure the keyword has “business potential”Step 4 – Make sure you can rank for the keywordWe then elaborate on each step by showing you how to execute it.In the case of step one—finding keywords with search traffic potential—we suggested using keyword research tools such as Google Keyword Planner and Ahrefs’ Keywords Explorer and then elaborated on how each tool works.Best practicesWhen chronicling your steps in a how-to type of blog post, be as specific as possible. Consider that your reader may ask, “How? Why?” and then fill these gaps to make your how-to guide substantial.More ExamplesHow to Do a Content Audit in 2022How to Use Ahrefs: 11 Actionable Use Cases for BeginnersHow to Do Keyword Research for SEO2. Content hubsA content hub is an interlinked collection of content about a topic. The main value of this type of blog post is in its ability to link to other content on your website.Sometimes, you may have multiple blog posts on your website about a topic—let’s say SEO—but they aren’t housed in one place. That’s where a content hub comes in: It’s strategically built to boost your site structure for more traffic, links, and topical authority.In simple terms, a content hub comprises three parts:Your hub page – A high-level guide about the overarching topic (e.g., SEO). It usually includes links to subtopics that are sometimes split into chapters.Your subpages – These are in-depth guides about parts of the main topic. Each of these guides is split into yet more chapters.Hyperlinks – These connect the subpages to your hub page. The hub page links to all the subpages, and each subpage links back to the hub.It may be a little confusing, so let’s take the example of our beginner’s guide to SEO. This is our hub page:We first give the reader an overview of what SEO is. This is followed by six hyperlinked chapters (with descriptions for each). Clicking on each of these chapters brings you to their respective subpages.So if we click on chapter 1 (How Search Engines Work), the reader is taken to the subpage—which is split into yet more chapters so that you can easily hone in on a specific subtopic.Best practicesMap out a structure to ensure your content hub is well organizedIf you have a topic in mind but aren’t sure how to structure it, follow these steps:Go to Ahrefs’ Content ExplorerEnter your search term (e.g., “link building”)Look at the top results to see how other websites structure their content hubs/guidesMore ExamplesThe Beginner’s Guide to Link Building 3. Expanded definition postsExpanded definition posts are somewhat similar to how-to guides. The difference is they start by focusing on the what before the how—because sometimes, you want to understand a topic in greater depth before getting to the actionable bit (i.e., the how-to).Here’s how this type of blog post is structured:Our blog post titled “What Is a Backlink? How to Get More Backlinks” is one such example of how this structure can be put to practice:Introduction, then table of contents—bulleted summary of what you’ll learn[H2] Why backlinks are important [H3] Rankings (elaborate)[H3] Discoverability (elaborate)[H3] Referral traffic (elaborate)[H2] What makes a good backlink? Elaborate with H3s as above[H2] How to check for backlinks Elaborate with H3s as above; add screenshots where necessary[H2] How to get more backlinks Elaborate with H3s as aboveConclusion: Your final thoughtsIt’s fairly straightforward. Tell the reader what to expect, explain why the topic is important and what they can do with it, then offer some steps on how to achieve a certain goal around the topic.Best practicesTo build a more compelling piece, use the Problem-Agitate-Solve (PAS) formula More ExamplesWhat Is the Buyer’s Journey? How to Create Content for Every StageWhat Is Googlebot & How Does It Work? 4. Listicles, aka list postsListicles—also known as list posts—typically feature one tip, technique, or point per paragraph. They’re often used for non-chronological advice but, sometimes, have a poor reputation because many publications use this blog post type for clickbait stories.This BuzzFeed article accurately captures one instance of how the format is used:The descriptions below each subheading are kept short so that readers can quickly capture information in a concise manner without having to stay on a page for too long. Listicles may also be image-heavy.Despite the poor rep that list posts may carry, these types of blog posts can be useful for readers who are looking for quick answers to certain questions—as in the case of this Search Engine Journal blog post titled “21 Web Directories You’ll Still Want to Use.” This is a good example of how an SEO or marketing listicle should be written:Best practicesWe recommend not using sensationalist wording in your headline (like this BuzzFeed article). Instead, ensure your headline captures exactly what the blog post is about.You can learn more about the best practices of crafting listicles here.More Examples101 Quick & Actionable Tips to Improve Your SEO7 Best Marketing Newsletters (Most Voted For) 5. Expanded list postsAn expanded list post mimics the format of a listicle. The difference is this type of blog format is better suited to more complex topics—so each pointer on the list is beefed up to better explain a tip or idea.It’s also why we don’t publish all that many list posts on the Ahrefs blog; SEO is a complex topic to unpack when compared to “lighter” content, such as the “best cafes in Singapore.” The blog post you’re reading now is also an example of an expanded list post.Best practicesSince expanded list posts are lengthier than listicles, use images and H3s (a subsection that sits under your subheading) to break your points up. This very subsection is a H3.More Examples14 SEO Tips for More Traffic in 202212 SEO Best Practices That Everyone Should Follow10 Best Job Boards for Marketers (+ Bonus Suggestions)6. NewsNewsworthy blog posts contain time-sensitive information that’s relevant to your business and/or industry. This includes industrywide changes or trends that may affect your readers (or be of interest to them), as well as company or product updates.Naturally, the piece of news you’d like to share should be disseminated as soon as possible, and, ideally, before other publications. This is especially so if you’re covering industrywide changes.For example, let’s say Apple intends to announce the launch of its Mac Studio and Studio Display via a press release.That same press release is first shared with multiple publications and kept on embargo (i.e., not to be published until a certain date and time). Based on the information, media outlets can build a story and schedule the news for publication—in the case of “fastest fingers first.”Being quick to publish a newsworthy story also puts you in good standing with your target audience, who may over time regard your blog as a reliable and credible source of information. To achieve this, you need to be consistent in publishing accurate and timely content. Best practicesWith this type of blog post, use the inverted triangle so your most important information is up topMore ExamplesGoogle Page Experience Update - Desktop Rollout Complete7. Data studiesData studies are specific types of blog articles that are a great way to earn backlinks.At Ahrefs, we’ve run more than a fair number of data studies over the years—many of which have brought us traction on our socials.According to our study of 900 million pages, there is a moderate negative correlation between word count and organic traffic for posts longer than 2,000 words.In other words, the average 10,000-word post gets less search traffic than the average 2,000-word post. pic.twitter.com/Z1a02Epa5u— Ahrefs (@ahrefs) January 18, 2022 But don’t simply cobble data from multiple sources and claim it as yours. Instead, decide on what you want to first study.One way to do this is by recreating outdated studies, which you can find using Ahrefs’ Content Explorer:In Content Explorer, enter a search term like [industry] + “study,” [industry] + “survey,” [industry] + “research,” or [industry] + “data”Set the filter to an In title searchSet the Published filter to an older date range (e.g., 2010–2015)Sort the results by referring domainsFrom here, you can identify popular and/or outdated studies to recreate and write about as blog posts.Best practicesCreate graphs so readers have a concise overview of your findingsMore ExamplesGSC vs. GKP: Comparing Search Volumes for 72K Keywords [A Study by Ahrefs]6 Important Insights About Title Tags (953,276 Pages Studied)Anchor Text: A Data-Driven Guide (384,614 Web Pages Studied)8. Case studiesCase studies look at real-life experiments or businesses that have succeeded in using certain tactics or strategies. They’re effective because readers are more inclined to buy into information when it’s backed by proof.In this case study of fintech company Wise, we explored five reasons why its SEO strategy is so admirable:We also weaved in our product—the Ahrefs toolset—where we could.For your case study to be effective, it has to give the reader some “wins”—clear takeaways that they can apply to their business. Ideally, you should feature a business that’s either well known or has a unique enough selling proposition to entice readers to click on the blog post.Best practicesGive readers some clear takeaways (e.g., Oatly SEO Case Study: 5 Lessons You Can Learn From the Oat Drink Giant and Its IPO) so they’re more likely to read your blog postMore ExamplesLink Building Case Study: How We Built Backlinks With a ‘Stats’ Page (And Ranked #1)9. Cheat sheets and checklistsCheat sheets and checklists are essentially the same type of blog post format and may include a clear breakdown of the steps required to reach a goal.Unlike how-to guides, which may sometimes be ambiguous in explaining how something works, checklists and cheat sheets are effective because they tell you exactly what you need to achieve something.Here’s a concise SEO checklist we crafted for a blog post. We later repurposed the checklist as a tweet:Looking for a complete SEO checklist for 2021?Here’s one you can follow. pic.twitter.com/65brjXPBcg— Ahrefs (@ahrefs) August 15, 2021 In the above blog post, we shared that our SEO checklist helped grow our blog to over 640,000 monthly search visits. Then we shared that same checklist with users before going into a breakdown of each of the elements in the cheat sheet.Best practicesArrange your checklists/cheat sheets in chronological order so that the reader knows exactly how to reach a goalMore ExamplesHow to Do a Content Audit in 202210. TemplatesSimilar to what the name suggests, template blog posts include templates on how to achieve something—as in the case of this blog post on how to create a one-page marketing plan.We recommend using this format:What is [topic]?Why is [topic] important?How can I make [topic] work for me?TemplateYou can share your template at the start of the article, which is what we normally do, or at the bottom of the blog post.There are also multiple ways to let readers access your template in these types of blog posts: We usually offer them as a free, copyable template (via Google Docs), but you may decide to create a downloadable template instead.Best practicesKeep your template simple and organized, with guiding questions or tips for open-ended fieldsMore ExamplesHow to Write a Press ReleaseSteal Our SEO Report Template (Inspired by SEO Experts) Final thoughtsThese types of blog formats are not the be-all and end-all when it comes to writing a good blog post.Try to mix things up depending on what you think works best. For instance, this guide to creating SEO-friendly URLs starts with a step-by-step guide, then looks at some best practices in a listicle format.It’s all about experimenting and figuring out what your readers want, so don’t limit yourself.Have questions or comments? I’d love to hear them on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Rebecca Liew Content marketer and writer. Addicted to words, stationery, and exploring new places on foot. Keep Learning 18 Common Types of Marketing (Examples Included) Learn about the 18 different types of marketing you can use to grow your business. I Wrote 100+ Blog Posts for the Ahrefs Blog. Here’s What I Learned. I did two Ask Me Anything (AMA) sessions to see what people wanted to know. 9 Key Types of Marketing Campaigns and Successful Examples “Let’s do a marketing campaign!” Marketers hear that a lot, but it’s easier said than done. For starters, check out these 8 types of marketing campaigns. Top 5 Types of Marketing Activities You Need to Know Five marketing activities that stand out from the rest, and five successful companies that can thank themselves for investing in them. Indirect Marketing: Definition, Types, & Examples An overview of indirect marketing. Learn what it is, its pros and cons, and see examples of companies that succeeded with it.",
  "headers": [
    {
      "level": "H1",
      "text": "10 Types of Blog Posts & How to Use Them Effectively"
    },
    {
      "level": "H2",
      "text": "1. How-to guides"
    },
    {
      "level": "H3",
      "text": "Best practices"
    },
    {
      "level": "H2",
      "text": "2. Content hubs"
    },
    {
      "level": "H3",
      "text": "Best practices"
    },
    {
      "level": "H2",
      "text": "3. Expanded definition posts"
    },
    {
      "level": "H3",
      "text": "Best practices"
    },
    {
      "level": "H2",
      "text": "4. Listicles, aka list posts"
    },
    {
      "level": "H3",
      "text": "Best practices"
    },
    {
      "level": "H2",
      "text": "5. Expanded list posts"
    },
    {
      "level": "H3",
      "text": "Best practices"
    },
    {
      "level": "H2",
      "text": "6. News"
    },
    {
      "level": "H3",
      "text": "Best practices"
    },
    {
      "level": "H2",
      "text": "7. Data studies"
    },
    {
      "level": "H3",
      "text": "Best practices"
    },
    {
      "level": "H2",
      "text": "8. Case studies"
    },
    {
      "level": "H3",
      "text": "Best practices"
    },
    {
      "level": "H2",
      "text": "9. Cheat sheets and checklists"
    },
    {
      "level": "H3",
      "text": "Best practices"
    },
    {
      "level": "H2",
      "text": "10. Templates"
    },
    {
      "level": "H3",
      "text": "Best practices"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Rebecca Liew"
}