{
  "url": "https://ahrefs.com/blog/unique-features-ahrefs/",
  "slug": "unique-features-ahrefs",
  "title": "16 Things That Only Ahrefs Can Do",
  "description": "What makes Ahrefs stand out among the rest? Here are 16 of our unique features and functionalities you'll find helpful.",
  "content": "Andrei Țiț Showing you how to make the most out of Ahrefs. Mostly through: how-to videos, product updates, webinars, and brochures. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents What makes Ahrefs better than the competition?It’s a fair question but a tough one to answer because there are just so many things to compare.So instead of filling out one of those classic “us” vs. “them” comparison tables, we decided to go a different route and showcase some valuable features that you’ll only find in Ahrefs.Note These features were selected by comparing Ahrefs to other similarly priced all-in-one SEO tools. It’s quite possible that some of the lesser-known, more specialized SEO tools have one or more of these features.Contents1. Compare a website’s current and historical dataWith Ahrefs, it’s possible to pick any two dates when working with historical data. This opens up the space for a handful of actionable use cases.The first one is about comparing ranking fluctuations to certain events in the past, like an algorithm update.Let’s take a look at our blog’s performance over the past year in the “Performance” chart under Overview 2.0.Our organic traffic dipped last year on December 5, when Google launched its Helpful Content update. To further investigate how the update affected our organic traffic, I’ll open the Top pages keywords report and compare keyword rankings one month after the update’s release. I’ll also apply a “Declined” filter to see which positions have been impacted.And it looks like there may have been 1,078 pages affected by it. Our article on “free keyword research tools” took the greatest hit, going down three positions, which led to a decrease of ~45,000 organic search visits a month.Another use case is to check how a previous version of a page ranked in the past.For example, our free website traffic checker page went from 2,840 monthly organic visits to well over ~75,000 in just six months. How is this possible?We actually changed the landing page into a tool page—after aligning with the search intent for its top keyword “website traffic checker.”If we check the SERP overview under Ahrefs’ Keywords Explorer and go back in time right before the spike in traffic, we can see that most top results were “tool” pages. So we’ve followed suit and now rank at position #3.The last use case is about comparing your competitor’s output of ranking pages to see the speed at which they churn out content. Just open the Top pages report and filter for newly created pages that rank in the top 100 between any two dates.For example, our content team has created 250 pages for our blog in the past three months.2. See your competitors’ top-performing pages globallyWhile the Top pages report is not a feature exclusive to Ahrefs, what sets us apart is that we provide “top pages” data for all countries.Unlike other SEO tools that offer data for only one country or restrict additional data about countries behind a paywall, we make it easier to analyze top-ranking pages if you know which countries a website focuses on.This allows you to also monitor the progress of creating new content that ranks in a particular country.For example, judging by the “Performance” chart, it looks like we’ve been catching up with the Brazilian market just recently.3. See backlink growth or decline over time with daily granularityThanks to our continued investment in web crawling infrastructure, Ahrefs is the only tool to update “referring domains” graphs daily.This level of granularity allows you to report to clients and measure the outsourced SEO performance with more accuracy.For example, back in December 2022 we turned our “website traffic checker” landing page into a free tool to better match search intent. As a result, our organic traffic and referring domains shot up pretty much the next weeks.Noticed an unnatural or abrupt spike in referring domains? You can also use the daily granularity of this chart to spot potential spam attacks early on and stop them on the same day they occur.Who can guess what is going on here?A site has a big decline in traffic…but Ahrefs is showing many new high ranking keywords.(I’ll update with the answer this afternoon.) pic.twitter.com/uHgTqbFdVL — Marie Haynes (@Marie_Haynes) February 28, 2023 4. Inspect backlinks in the source codeEver wanted to find out what changed on a referring page after adding or removing a backlink?You can do that, thanks to the “Inspect” column available in all backlink-related reports. The feature allows you to see pages exactly as AhrefsBot sees them and compare page snapshots between one another (both HTML and page text).For example, let’s look at ahrefs.com’s backlink profile under the Backlinks report and apply a “Lost” filter to only show lost backlinks on our last recrawl.After eyeballing a few links, this one got my attention due to the link being removed in a relatively short time (less than a year).To further investigate it, I’ll click on the “Inspect” column and check the HTML status code. Then compare the current page with an older snapshot from three days ago.It looks like the publisher has indeed removed our link. This confirms that the link was there in the first place and also shows us what it looked like.5. Spot which subfolders attract the most organic traffic for your competitorsThe Site structure report helps you understand a competitor’s website structure in a tree-like format without having to run a crawl.Use it to analyze their top-level folders and see which ones generate the most organic traffic.Here are a few key things you can learn about our SEO strategy by skimming this report:Our blog is responsible for 26% of our website traffic.The free tools generate a substantial amount of traffic (+1 million) and backlinks.The localized versions of our website (Spanish, German, French, Russian) have a low share of traffic (below 5% in total).We practically don’t run any paid keyword campaigns.6. Gauge the full traffic potential for a keywordMost SEO professionals look at the search volume of their target keyword to predict a page’s organic traffic potential.Search volume alone can be misleading, though, as pages rarely rank for one keyword.A better (and more insightful) way to estimate search traffic is to use Traffic Potential, which shows you how much search traffic you’d get if you were to rank #1 for the parent keyword.Please note that the traffic is not coming from your target keyword but from all the keywords the top-ranking page is ranking for.7. Find out if you can target multiple keywords with one pageLet’s say you’ve got the following keywords on your list.All of them seem to be targeting the same topic. But how do you know whether you should target them with a single page or create separate pages for each of them?We can find this out by looking at how Google “sees” them. If Google is ranking similar pages for all of these keywords, it means they probably belong under the same topic. We can learn how Google “sees” them by using the “SERP comparison” feature under the SERP overview.You’ll be able to compare SERPs side by side for the same keyword on different dates. You could also compare them for different keywords, which is what we’re going to do.Let’s compare the search results for the keyword “whipped coffee” with “whipped coffee recipe.”The top-ranking pages for both keywords are nearly identical (8/10 common results), a thing also indicated by our SERP similarity score.This typically means that Google sees the search query “whipped coffee recipe” as a subtopic of a more general query, “whipped coffee.” Which means you can likely rank for both keywords with a single page.If we compare “whipped coffee” with “whipped coffee without sugar,” we’ll notice there’s no similarity between the SERPs.This means you’ll need to create two separate pages if you want to target both of these keywords.TIP You can also evaluate whether or not you should target similar keywords with the same page by going to the Traffic share by pages report in Ahrefs’ Keywords Explorer.This will show you how much their SERPs overlap. Not so much in our latter case, as we’ve concluded before.8. Discover low-hanging keyword opportunitiesThere are multiple ways to do keyword research. Yet most professionals are looking for “low-hanging fruits,” aka untapped keywords that can provide a lot of value while being easy to rank for.Here are two unique filters exclusive to Ahrefs: “Lowest DR” filter and “Target” filter.“Target” filterThis filter allows you to see what positions your target URL is already ranking for (or not). Thanks to this, you don’t need to constantly switch between different reports to see if you already rank for a given keyword while doing keyword research. Here are a few use cases:1. Show keywords where the target does not rank in the top 10. This setting shows you two types of keywords: (a) keywords for which you don’t rank at all and (b) keywords for which you rank low.For the first type, you’ll typically create new content. For the second type, you can improve old content (or realize that the keyword may need a separate page). To prioritize which pages to improve, just export the keywords and sort them using the “Position” column.2. Show keywords where the target doesn’t rank in the top 100. This setting lets you avoid topics you and your team have already covered. No need to check your blog or cross-check with Ahrefs’ Site Audit anymore.“Lowest DR” filterThis filter lets you see keywords where websites with a low DR rank in the top five or top 10, which should give you more confidence that you can rank with a low-DR website too.To illustrate this, let’s search for “cat food” and go to the Matching terms report.I’ll set a “Traffic potential” filter to show only keywords that get at least 500 organic search visits a month. Additionally, I’ll set “Lowest DR: Up to 20 in top 5” to show only keywords where sites with such low DR made it to the top five.From here, it’s just a matter of skimming through the list and manually checking SERPs to discover low-competition keywords. Like “vegan cat food,” which has a website ranking in the top five with a DR of 17 (and another one ranking in the top 10 with a DR of 8).9. See the ranking history of any website for a keyword (and compare with competitors)When it comes to setting up keyword tracking for your website (or your client’s website) for the first time, historical keyword rankings can work as a great baseline.To check them, do these:Open Site Explorer for your own domainGo to the Organic keywords reportChoose a keywordClick the “Position history” chartLet’s look at “affiliate marketing for beginners”:As you can notice, we were in the top position but dropped at the beginning of March 2022.Since then, we updated the page to better match search intent and popped back to the top on December 22, 2022.From here, we can add a competitor to compare our performances.You can also use this feature to spot cannibalization issues. Those are topics for which you rank several pages.Follow the same steps as before. Only this time, also toggle “Multiple URLs only” to see pages on your website that rank for the same keyword.Let’s look at the keyword “ahrefs guide to link building.”It looks like five unique pages on our website have ranked for this query in the past month, but not in the top three. This may be a keyword cannibalization issue, which can likely be solved by merging them all into a content pillar.Historical rankings for the top 10 positions of your target keyword are also available under Keywords Explorer. This is helpful in assessing the SERP stability and can give you clues about ranking difficulty and search intent.For example, if we check the keyword “backlink checker,” it looks like the top 10 positions haven’t changed much, so the search intent is quite clear. Searchers are looking for free tools through which they can check backlink profiles.But if we check the keyword “football” (has multiple meanings depending on what continent you are in), the search intent is mixed.10. See the full history of search ads for any keywordThinking of running PPC ads on a popular keyword?Our Ads position history report will show you all the websites that have advertised for this keyword in the past, along with the actual ads they were running at any point in time.To access it, search for a keyword in Keywords Explorer. Let’s go with “crm software.” Then scroll down toward the “Ads position history” chart (right under the “Position history” one).From here, you can judge the seasonality of the ads and take inspiration from the ad copy.11. Understand which competitors have the largest share of voice for a set of keywordsShare of voice (SOV) represents a website’s overall visibility in the organic search results for a set of tracked keywords.At the same time, it’s one of the few vital metrics for measuring SEO ROI.To see your website’s share of voice for a given set of keywords, first paste them in Keywords Explorer and select the Traffic share by domains/Traffic share by pages reports.The fun part: You will most likely discover organic competitors you weren’t even tracking that are sneaking up the same SERPs you’re trying to win.For example, we write mostly about SEO and marketing. But we never thought Shopify would target similar topics, since our businesses are completely different.It earns about 9% of the organic traffic for the keywords we pasted. Hence, we can research its top content and reverse engineer any low-hanging SEO wins it has.12. Analyze any page and fix all issues at onceAhrefs has the industry’s most complete URL details panel. In essence, the panel stores all the available information about any page in a crawl. So you can literally dissect and extract the following:All content fieldsAll inlinks and outlinksHreflangsDuplicatesJS resourcesStructured dataAnd so onIn parallel, when fixing an error on a particular page, you can look at what else is wrong with it and fix it all at once, thanks to the “Issues” tab.For a thorough page investigation, (1) access the source code from “View source” and (2) compare the HTML code and page text between crawls from the “Compare” dropdown. This should help technical SEOs and marketers alike: The former could pinpoint changes in code with accuracy, while the latter could cross-check text copy alterations among page versions.13. Configure advanced, flexible SEO auditsSEO crawls are crucial for monitoring your website’s SEO health over time. Yet not every website is built the same, which may require a bit of tweaking to the actual crawl settings.Ahrefs’ Site Audit has got your back, featuring editable and customizable SEO issues.At a global level, you can change the importance of an SEO issue and decide whether to apply it to existing projects or not.While at a project level, you can turn off certain SEO issues.Both settings are of great importance when calculating a website’s Health Score, as we only take into account links with errors (links with warnings and notices are not factored in). Thus, the higher the number of errors that show up, the lower the Health Score.Similarly, you can customize your own issues, which will take the specific attributes within the Page explorer report. Like a custom error where meta descriptions are longer than 160 characters.Speaking of customization, Site Audit also allows you to configure a segment, save it, and return to it in just a few clicks.This comes in handy because most website owners and SEOs want to isolate issues related to a specific section of a website, such as /blog, /store/, or perhaps a subdomain like es.ahrefs.com.To set one up, click on Configure > Configure segment.Note The segment will be applied to every report in Site Audit.14. Get internal linking suggestions Internal links are crucial to SEO. They help Google discover new content on your website and pass link equity from high-authority pages to low-authority ones.But let’s face it: Building internal links is time consuming…… but not if you’re using Ahrefs’ Site Audit.Our Internal link opportunities report identifies internal link opportunities by taking the top 10 keywords for your ranking pages—then finding mentions of them on your other pages. Including important keyword metrics and the keyword context. How cool is that?TIP: Find internal link opportunities manuallyWe won’t suggest a link if one already exists between the pages.Despite this, you can still find the pages mentioning your terms by going to the Page explorer report and searching for the keyword within the HTML feature.15. Use Content Explorer to find top-performing content in your niche and high-quality link prospectsAhrefs’ Content Explorer is a searchable database of 13.6 billion webpages, complete with these proprietary metrics:Domain Rating (of the parent website)Number of referring domainsOrganic search trafficWord countPublish dateUpdated dateLive/brokenAuthorNo close competitors for the tool exist, and there are more use cases than I have time to cover in this article. So let me share two of my favorite ways to use it.Find low-competition topics with high traffic potentialWant to get content ideas that are easy to rank for?Search for a broad topic like “backpacking” in Ahrefs’ Content Explorer and apply these two filters:Referring domains < 5Page traffic > 1,000In return, you’ll get a list of relevant pages that get lots of organic traffic and are potentially easy to rank for.From here, you can dig further into the keywords responsible for the organic traffic.Find broken link building opportunitiesSearch for pages with a relevant word or phrase in their title, filter for “Only broken pages,” then filter for results with at least 100 referring domains.Here’s a dead recipe nutrition calculator with 490 referring domains.If we had a site in this niche, we could create a similar piece of content on our site, then ask everyone linking to the dead page to link to us instead.16. Use Web Explorer to see the web like search engines doAhrefs’ Web Explorer is a one-of-a-kind tool that lets you search through our search engine’s (yep.com) entire database of 500 billion pages, domains, and links using search operators.It also allows you to see the web like search engines do and find relevant pages for your topic, including similar ones that may have been omitted on purpose by Google.How is it different from Content Explorer? Apart from the larger database, Web Explorer’s advantage lies in bringing information about pages, backlinks, and outlinks together in one place.This means you can search pages by the anchor and URLs of their backlinks and outlinks.For example, let’s say you want to build links to pages you’ve already covered.We’ve already written about how to perform a content audit that includes a template.So to find potential link prospects on this topic, we’ll use the search operator outgoinglinkanchor: followed by the words “content audit template.”This shows us pages whose outgoing link’s anchor text contains our desired keyword.This is but one of the common use cases we feature under our “Examples” tab.Further readingIntroducing Web Explorer by AhrefsThat’s obviously not everything…Ahrefs has many more unique features and data points.Perhaps I should write a follow-up article and showcase more of the unique things that only Ahrefs can do? Let me know on Twitter. 😊 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Andrei Țiț Showing you how to make the most out of Ahrefs. Mostly through: how-to videos, product updates, webinars, and brochures. Keep Learning The Official Ahrefs Tutorial: How to Use Ahrefs to Improve SEO Learn how to get more organic search traffic to your website with the help of Ahrefs' tools.",
  "headers": [
    {
      "level": "H1",
      "text": "16 Things That Only Ahrefs Can Do"
    },
    {
      "level": "H2",
      "text": "1. Compare a website’s current and historical data"
    },
    {
      "level": "H2",
      "text": "2. See your competitors’ top-performing pages globally"
    },
    {
      "level": "H2",
      "text": "3. See backlink growth or decline over time with daily granularity"
    },
    {
      "level": "H2",
      "text": "4. Inspect backlinks in the source code"
    },
    {
      "level": "H2",
      "text": "5. Spot which subfolders attract the most organic traffic for your competitors"
    },
    {
      "level": "H2",
      "text": "6. Gauge the full traffic potential for a keyword"
    },
    {
      "level": "H2",
      "text": "7. Find out if you can target multiple keywords with one page"
    },
    {
      "level": "H2",
      "text": "8. Discover low-hanging keyword opportunities"
    },
    {
      "level": "H3",
      "text": "“Target” filter"
    },
    {
      "level": "H3",
      "text": "“Lowest DR” filter"
    },
    {
      "level": "H2",
      "text": "9. See the ranking history of any website for a keyword (and compare with competitors)"
    },
    {
      "level": "H2",
      "text": "10. See the full history of search ads for any keyword"
    },
    {
      "level": "H2",
      "text": "11. Understand which competitors have the largest share of voice for a set of keywords"
    },
    {
      "level": "H2",
      "text": "12. Analyze any page and fix all issues at once"
    },
    {
      "level": "H2",
      "text": "13. Configure advanced, flexible SEO audits"
    },
    {
      "level": "H2",
      "text": "14. Get internal linking suggestions"
    },
    {
      "level": "H2",
      "text": "15. Use Content Explorer to find top-performing content in your niche and high-quality link prospects"
    },
    {
      "level": "H3",
      "text": "Find low-competition topics with high traffic potential"
    },
    {
      "level": "H3",
      "text": "Find broken link building opportunities"
    },
    {
      "level": "H2",
      "text": "16. Use Web Explorer to see the web like search engines do"
    },
    {
      "level": "H2",
      "text": "That’s obviously not everything…"
    }
  ],
  "author": "Andrei Țiț"
}