{
  "url": "https://ahrefs.com/blog/video-marketing/",
  "slug": "video-marketing",
  "title": "The Simple (But Complete) Guide to Video Marketing",
  "description": "Video marketing is using videos to promote and educate your target audience, as well as increase brand awareness and social engagement.",
  "content": "Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents We hopped onto the video bandwagon in 2015 and never looked back.Today, we have more than 300,000 subscribers and 14 million views, and that has led to thousands of new customers.For a “boring” industry like SEO, I’d like to think that’s pretty impressive.In this article, we’ll show you how to use video marketing to grow your business.What is video marketing?Why is video marketing so powerful?Types of marketing videosHow to get started with video marketingOvercoming roadblocks and strugglesHow to promote your videosVideo marketing exampleshttps://www.youtube.com/watch?v=QCgDIhvFkCMWhat is video marketing?Video marketing is using videos to promote and educate your target audience. It’s also used to increase brand awareness and social engagement, allowing you to reach new and bigger audiences.Why is video marketing so powerful?In other words, why is video marketing effective? Why should you do video marketing? Here are a few reasons:1. Video is accessibleYou watch it. I watch it. We all do. Videos are everywhere. Go to any major metropolitan area like New York or London, and you’ll see videos playing on massive billboards.Not only that, today, you can literally watch them on any device—your smartphone, tablet, PC, TV, and so on.In fact, in a 2018 study, 85% of U.S. internet users watched online video content every month. (And that’s not even the highest penetration for video content.)That’s how ubiquitous video is.2. Video allows you to demonstrate concepts faster and more clearlyWatching a video is an interactive experience. You’re using both your senses of hearing and sight. Viewers can actually see something in action, be it a product or a concept.Compare that to text-based content. Not only are you limited to just sight, but you also can’t see something in action. You have to imagine it.For example, one of my hobbies is breakdancing. So let’s say I wanted to learn the windmill and had to learn how to do it from this text-based description:We’re going to start off by kicking into our backspin. And when we get to this position, we’re going to turn onto our head and my left hand.I would have given up on my dreams of becoming a Red Bull BC One champion within seconds of starting. But everything will be clear if I watch this video:https://www.youtube.com/watch?v=swId_MFHywI3. Video allows you to create a personal connection with viewersThe same interactive elements that make it easy for you to demonstrate concepts also make it easy to create a personal connection with your viewers.Watching a video—especially a talking head one—can feel as if the speaker is having a conversation with you, even if it has been watched by millions of other people.Sam Oh, who runs our YouTube channel, is beloved by our subscribers. In fact, because he appears on screen so often, he is regarded as a mentor by many of them:Creating this effect through text is much, much harder. For example, the Ahrefs blog team has created hundreds of articles. Yet no one has ever called us “mentors.”Sometimes, people even get our authors confused. They may think that an article written by our Michal Pecánek was written by me instead. This never happens with video, as it is impossible to watch one and confuse Sam with our head of content, Joshua Hardwick, for example.4. Video allows you to reach audiences on major platforms like YouTubeYouTube has over 2 billion monthly active users. The only way to reach them is to produce videos.TikTok has over 1 billion monthly active users. The only way to reach them is to produce short videos.You get my point—there are untapped opportunities in the space, and you lose out if you don’t even try.Types of marketing videosWe mainly produce tutorial-style videos on our YouTube channel. But it’s not the only type of marketing video you can create. Here are more options you can consider:1. Product demosThis type of video shows your product in action. It can be done by yourself (e.g., a tour of your software) or done by others (e.g., an influencer unboxing your product).Here’s an example of a “tutorial-style” video we made that is basically a product demo:https://www.youtube.com/watch?v=_oU8lclN1142. Tutorials/how-tosThis type of video teaches your audience how to do something. Here’s an example from our channel where Sam teaches how to scale content creation:https://www.youtube.com/watch?v=cQmH8LH9p203. Brand videosThe purpose of brand videos is to raise awareness around your brand, products, or services. You’ve probably seen plenty—a lot of them are ads on YouTube. Here’s an example from Monday.com:https://www.youtube.com/watch?v=l-7awVpecvU4. Animated videosAs its name suggests, this style of video uses animations to explain something, be it a concept, product, or more. While we don’t do full-fledged animated videos, we do typically utilize animations in our tutorials.But here’s an example of a fully animated video:https://www.youtube.com/watch?v=iN6g2mr0p3Q5. Event videosThis type of video showcases the highlights of an event. It can also feature interesting talks, presentations, or speeches that took place at the event itself.Here’s an example from the Chiang Mai SEO conference:https://www.youtube.com/watch?v=qqisePhYD2Q6. TalksIf you (or anyone in your team) give talks regularly, the speech can be recorded and uploaded as video content too.GaryVee often does this:https://www.youtube.com/watch?v=yHHl35TBHQc7. Entertaining/storytelling videosTell a story about your product or make your videos entertaining. Here’s one from ClickUp:https://www.youtube.com/watch?v=m9JiY0mdfNo8. Expert interviewsPick the brains of the experts, thought leaders, and influencers in your industry. Get them to share their knowledge with your audience.https://www.youtube.com/watch?v=NRr-wdE0RlA9. Case studies/testimonialsGet your satisfied, loyal customers to share how your product or service helped them with their problems.https://www.youtube.com/watch?v=o2GB7avRrIE10. Webinars/livestreamThe purpose is to either share knowledge or teach an audience (usually live) how to do something. The video can later be uploaded as a form of video content.https://www.youtube.com/watch?v=xn2XCFqREbUHow to get started with video marketingReady to market your business with video? Here’s how to get started.1. Define your audienceYou can’t just create a video and hope that someone will be interested in it. You need to know who should be consuming your content so that you can create content for them.If you have an existing list of customers, start there. Define who they are, what kind of problems they face, how they found you, and why they choose you over your competitors.Don’t assume you know the answers. You should actually talk to them. Reach out to your customers and ask if they are OK with jumping on a call with you. Ask them those specific questions and get to know their business. If calls are out of the question, customer surveys work too.If you don’t have an existing list of customers, then start by thinking of who your product or service serves. Feel free to keep it broader for now.For example, as providers of SEO software, something like this makes sense for us:People who want to drive more traffic to their website(s).It’s somewhat oversimplified, but it can get us started on the right foot and prevent us from creating content around topics that don’t make sense.2. Define your primary objectiveThere are three main categories for objectives.A. Brand awarenessThe goal here is to create videos that make people aware of your existence. After watching your videos, your audience should know your brand name and have an idea of what exactly it is you do.B. EducationThe goal here is to create videos that teach your customers how to solve their problems, especially those that your products help with.This is basically what we do with our channel: We create tutorials on SEO and marketing strategies, then show our viewers how our tools make the processes easier and more effective.C. EntertainmentThis is pretty self-explanatory. If you are subscribed to Netflix or Disney+, you already know what this looks like.For example, the Red Bull YouTube channel does a great job of creating series and videos around extreme sports, effectively drawing in its target customers.3. Create the video(s)Since your audience, goals, and creative process will differ from us (and everyone else), it is almost impossible to tell you exactly what to create or how to create it.But we can discuss a few subcategories that may guide you in the right direction.A. Planning the videoBefore you begin recording or filming the video, you need to plan it out. Specifically, you need to know the topic you’re creating content about.This depends entirely on your goal.If your goal is to create a brand video, ad, or storytelling series, then it’s really up to your creativity and the concept you want to show. There’s no model answer here.If you’re creating educational content—like what we do—then you can do keyword research to see what kind of topics or questions people are searching for on YouTube.Here’s how to do it:Go to Ahrefs’ Keywords ExplorerSwitch the tab to YouTubeEnter a relevant keyword or keywordsGo to the Matching terms reportSwitch the tab to QuestionsHere, we can see over 6,700 questions we can potentially create videos about. Look through the list and pick out those that are relevant.Recommended reading: How to Do YouTube Keyword Research in 3 Easy StepsB. Video lengthThe length of your video is usually determined by your primary objective.For example, a brand awareness video can be as short as 15 seconds and usually won’t exceed a couple of minutes. Educational content is usually anywhere from five to 120 minutes. Our videos are around 7-20 minutes long, while a webinar can be up to an hour.Entertainment-style videos can also vary in duration. This can range from 10 to 180 minutes, depending on the format.C. Scripting your videoUnless you’re blessed with incredible improvisation skills like Dave Chappelle, we highly recommend that you script your video.This will make your video recording smoother, prevent bad speaking habits like “ums” and “ahs,” and so on. The last thing you want to do is to go off on a random tangent or click the wrong link in your screencast and end up losing the attention of your audience.For educational videos, we’ve found a script format that works well for us:Problem – Lead with the problem your video is solvingTeaser – Show that there’s a solution to the problem without giving it awaySolution – Teach how to solve the problemFor brand and entertaining videos, again, there’s no fixed way of doing things. It’s up to how you want to tell your story. If you’re stuck, I recommend watching this video from YouTuber Casey Neistat on his process of filmmaking:https://www.youtube.com/watch?v=nLSUrTxquyE&ab_channel=CaseyNeistatD. Recording the videoI asked Sam about a few aspects of the video-making process. Here are his tips:LocationSam recommends choosing a location where you can control the environment, specifically the amount of echo and light.An example is to not film right beside a window because the changing amount of sunlight can affect how your videos look.Sam records most of his videos at home:Whereas our very own Tim Soulo and Rebekah Bek record their videos in the Ahrefs office:CameraYou can start with any modern-day smartphone. If you’re looking for something more “advanced,” you can’t go wrong with a DSLR camera.TeleprompterAccording to Wikipedia, a teleprompter is a display device that prompts the person who is speaking with an electronic visual text of a speech or script.Use it if you’re scripting your videos.AudioIn Sam’s opinion, this is even more important than the camera equipment you’re using.While this depends on the type of videos you’re recording, here are Sam’s suggestions based on using a DSLR:Shotgun mic – Good if the subject is in one place (i.e., a “talking head” video)Lavalier mic – Works well if you have multiple subjects or you’re moving around a lotLightingSome people prefer natural lighting, but Sam finds it hard to control. He recommends a key light and a fill light.Learn how to set up lighting for your YouTube videos here:https://www.youtube.com/watch?v=IXe3rEWrDVgSoundproofingWhen recording, you’ll want to prevent additional or random sounds from affecting your video quality.For example, you can use furniture to dampen the sound. Sam uses two rugs and a couch; others may use thick moving blankets.If you have the budget, you may even opt for foam or acoustic panels.E. Editing the videoOnce you’re done with all the recording, it’s time to edit the video. Watch this video to learn how we edit our videos for high engagement:https://www.youtube.com/watch?v=j5EOWffq-gk&ab_channel=AhrefsOvercoming common roadblocks and strugglesMaking videos does not come naturally to everyone. There are many people who feel awkward in front of the camera. But these roadblocks can be overcome.Here are some common struggles and how to overcome them:1. I’m not good in front of the cameraWatch our videos, and Sam may look like a complete natural in front of the camera. But that only came after years of practice. And still, Sam feels awkward when he has to record.Don’t feel like you have to be “natural” or get it right the first time. The “trick” to making videos is actually in the editing.B-rolls like screencasts, animations, and text screens help to take the attention off Sam while creating a better educational experience.Another way to combat the jitters is to use the teleprompter. This helps you deliver information without worrying about going off on various tangents.2. I don’t have equipment or the budget to buy itYou already have one of the most powerful cameras with you. It’s right in your pocket, and it’s called your smartphone.In fact, there have been tons of movies made just from phone filmography. You’re overthinking it if you think your smartphone isn’t good enough.Plus, when we first started our YouTube channel in 2015, Tim, our chief marketing officer, recorded all his tutorials on a GoPro. No fancy cameras, no microphones, and no backdrops—but our channel grew from 0 to 2,600 subscribers in five months.3. English is not my first language/I have a strong accentTim is Ukrainian. English is not his first language. In fact, Tim was worried about this in the beginning and even asked GaryVee how to overcome it.Watch GaryVee’s advice to Tim on accents:https://www.youtube.com/watch?v=N8CiFPwLOIs&t=303s&ab_channel=GaryVeeHow to promote your videosDon’t publish your video and wait for someone to discover it. Actively promote it to your target audience.Here are some video promotion tactics you can use:1. Rank your videos on YouTube and/or GoogleOne of the best ways to promote your video is to have it rank on YouTube and Google. For as long as your video ranks, you’ll be able to get views continuously over the long term.To do this, you need to target video topics people are searching for.We’ve already shown you how to find these topics for YouTube, so let’s look at how to find these topics for Google.To rank your video on Google, you need to find topics that have “video intent.” That means that when someone is searching on Google, they will prefer to watch a video about the subject than read something.Here’s how you find these topics:Go to Ahrefs’ Content ExplorerRun this search site:youtube.com inurl:watch title:topicSort the results by Page trafficFor example, “Beginners Eye Makeup Tutorial” gets around an estimated 15,500 clicks from organic search every month. If you have a beauty channel, it may be worth creating a video on this topic.Once you have a list of topics, watch this to learn how to create a video that’ll rank:https://www.youtube.com/watch?v=NY3y0V9UDwMFurther readingYouTube SEO: How to Rank Your Videos From Start to FinishVideo SEO: How to Rank YouTube Videos on Google 2. Embed your videos on your blog or landing pagesIn the past year alone, our YouTube videos got around 275,000 views from our website:This is because we embed our videos almost everywhere—on relevant blog posts, landing pages, and even our homepage:Embedding your videos can also help you win a spot in the “Videos” tab on Google:The easiest way to begin is to use common sense. If you have a blog post and a video on the same topic, then simply embed the video in that post.Another option is to look for high-traffic pages that can drive views to your YouTube videos:Go to Ahrefs’ Site ExplorerEnter your domainGo to the Top pages report3. Share it with your audienceIf you have an existing audience, then you should share your newly published videos with them. This is what we do every time we publish a video.For example, we share it on Twitter, LinkedIn, and Facebook:Doordash’s $41M / Month Landing Page Review 💰In our latest video, @samsgoh does a teardown of the food delivery giant’s million-dollar page. Plus, learn practical takeaways to apply to your site:https://t.co/yK5tJ5pR5k— Ahrefs (@ahrefs) March 10, 2022 We also share it in Ahrefs’ Digest, our weekly newsletter:4. Repurpose your videosMaking a video is hard, hard work. So don’t let it end by just hitting the “publish” button. Make your content go the extra mile by repurposing it.For example, you can turn your video script into a blog post. We do this often at Ahrefs. In fact, this blog post you’re reading was originally a script (with some additions) from one of our videos. We’ve also done this for other videos too—this post was originally a video.You can also turn your video into multiple shorter videos. With YouTube Shorts, this can be done quite easily. Just hit “Clip” on any of your videos:You can then take this short video and repost it on TikTok, Instagram, Facebook, Twitter, and so on.If you’ve created a bunch of videos, you can consider repackaging them into a course. This is exactly what we’ve done with our “Best of AhrefsTV” course:Finally, if your video is an expert interview or a presentation, you can extract the audio and turn it into a podcast. Many popular podcasters have done this, including Tim Ferriss (YouTube channel/podcast), Peter Attia (YouTub channel/podcast), and more.Recommended reading: The Complete Guide to Content Repurposing5. Create “sequels” that keep people hookedLeave people wanting more by creating a connected series of videos. At the end of your first video, hook them in by leaving some things unsaid and get them to follow your series (or even your channel, if it’s on YouTube).For example, we did a case study on building links to a statistics page. Rather than give away the entire process in a long video—which people may not watch—we decided to create a series:https://www.youtube.com/watch?v=eTF6OBwidhc&list=PLvJ_dXFSpd2u_ABxIRO6RVK3ucKyzn96Y&index=1&ab_channel=AhrefsThen, at the end of each video, we left a call to action (CTA) to tell people to subscribe so they won’t miss out on the next video:6. Run adsIf you have the budget, the best way to get more views for your videos is to pay for them. And you can do that using YouTube ads.Here are some tips from Sam to get your ads running:If you create YT tutorials that feature your product, consider spending 💰 on ads. Doesn’t have to be a lot. In July, we spent 154.62 SGD (~112.75 USD) for 174.8 hours of watch time (10,488 minutes).That’s $0.01/min or $0.65/hour. Name a cheaper medium for relevant/focused attn— Sam Oh (@samsgoh) August 16, 2020 Further readingAll You Need to Know About Online Advertising (Done Simply)PPC Marketing: Beginner’s Guide to Pay-Per-Click Ads Video marketing examplesHere are some examples of businesses succeeding with video marketing.1. AhrefsI’ve already discussed a lot about our channel, videos, and results. We’ve used video marketing with great success and have acquired thousands of customers.Number of people who have signed up for Ahrefs and indicated that they found us via YouTube.The strategies and tactics that I’ve talked about in this post are from our experience. If you want to hear from the horse’s mouth, aka Sam, then listen to this podcast that he did on the Growth Marketing Today show.2. SlidebeanSlidebean is a pitch deck design platform for startups and small businesses. Its YouTube channel covers topics related to startups.I actually reached out to Caya, Slidebean’s CEO, two years ago to ask about the platform’s YouTube strategy. From what he told me, the strategy was twofold:A recurring video series about startups that targeted startup-related keywords.A series called “Company Forensics” focused on targeting topics higher up the marketing funnel and, therefore, generating brand awareness.3. ClickUpUnlike both Slidebean and us, ClickUp has taken an approach that is more creative. Rather than produce educational content, ClickUp has decided to go for the entertainment angle. Its videos, especially those targeting remote workers returning to the office, are like comedy skits designed for virality.And it’s working because its videos get millions of views:https://www.youtube.com/watch?v=olMlR9Mf0I0&ab_channel=ClickUpThis approach is interesting, but it may not be for everyone. ClickUp’s videos seem relatively high-budget, and the main purpose is likely to raise awareness of its brand.Its space is extremely competitive, with entrenched brands like Monday.com, Asana, Trello, and so on. So this strategy works in the sense that it puts ClickUp’s brand in the minds of its target customers.Final thoughtsI hope this guide has served as a good primer for understanding and executing video marketing. It should be a decent foundation for learning more about the topic.Did I miss out on anything important about video marketing? Let me know on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Keep Learning Video SEO: How to Rank YouTube Videos on Google Learn how to get more YouTube video views from Google with our simple 5-step process.",
  "headers": [
    {
      "level": "H1",
      "text": "The Simple (But Complete) Guide to Video Marketing"
    },
    {
      "level": "H2",
      "text": "What is video marketing?"
    },
    {
      "level": "H2",
      "text": "Why is video marketing so powerful?"
    },
    {
      "level": "H3",
      "text": "1. Video is accessible"
    },
    {
      "level": "H3",
      "text": "2. Video allows you to demonstrate concepts faster and more clearly"
    },
    {
      "level": "H3",
      "text": "3. Video allows you to create a personal connection with viewers"
    },
    {
      "level": "H3",
      "text": "4. Video allows you to reach audiences on major platforms like YouTube"
    },
    {
      "level": "H2",
      "text": "Types of marketing videos"
    },
    {
      "level": "H3",
      "text": "1. Product demos"
    },
    {
      "level": "H3",
      "text": "2. Tutorials/how-tos"
    },
    {
      "level": "H3",
      "text": "3. Brand videos"
    },
    {
      "level": "H3",
      "text": "4. Animated videos"
    },
    {
      "level": "H3",
      "text": "5. Event videos"
    },
    {
      "level": "H3",
      "text": "6. Talks"
    },
    {
      "level": "H3",
      "text": "7. Entertaining/storytelling videos"
    },
    {
      "level": "H3",
      "text": "8. Expert interviews"
    },
    {
      "level": "H3",
      "text": "9. Case studies/testimonials"
    },
    {
      "level": "H3",
      "text": "10. Webinars/livestream"
    },
    {
      "level": "H2",
      "text": "How to get started with video marketing"
    },
    {
      "level": "H3",
      "text": "1. Define your audience"
    },
    {
      "level": "H3",
      "text": "2. Define your primary objective"
    },
    {
      "level": "H4",
      "text": "A. Brand awareness"
    },
    {
      "level": "H4",
      "text": "B. Education"
    },
    {
      "level": "H4",
      "text": "C. Entertainment"
    },
    {
      "level": "H3",
      "text": "3. Create the video(s)"
    },
    {
      "level": "H4",
      "text": "A. Planning the video"
    },
    {
      "level": "H4",
      "text": "B. Video length"
    },
    {
      "level": "H4",
      "text": "C. Scripting your video"
    },
    {
      "level": "H4",
      "text": "D. Recording the video"
    },
    {
      "level": "H4",
      "text": "E. Editing the video"
    },
    {
      "level": "H2",
      "text": "Overcoming common roadblocks and struggles"
    },
    {
      "level": "H3",
      "text": "1. I’m not good in front of the camera"
    },
    {
      "level": "H3",
      "text": "2. I don’t have equipment or the budget to buy it"
    },
    {
      "level": "H3",
      "text": "3. English is not my first language/I have a strong accent"
    },
    {
      "level": "H2",
      "text": "How to promote your videos"
    },
    {
      "level": "H3",
      "text": "1. Rank your videos on YouTube and/or Google"
    },
    {
      "level": "H3",
      "text": "2. Embed your videos on your blog or landing pages"
    },
    {
      "level": "H3",
      "text": "3. Share it with your audience"
    },
    {
      "level": "H3",
      "text": "4. Repurpose your videos"
    },
    {
      "level": "H3",
      "text": "5. Create “sequels” that keep people hooked"
    },
    {
      "level": "H3",
      "text": "6. Run ads"
    },
    {
      "level": "H2",
      "text": "Video marketing examples"
    },
    {
      "level": "H3",
      "text": "1. Ahrefs"
    },
    {
      "level": "H3",
      "text": "2. Slidebean"
    },
    {
      "level": "H3",
      "text": "3. ClickUp"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Si Quan Ong"
}