{
  "url": "https://ahrefs.com/blog/viral-seo/",
  "slug": "viral-seo",
  "title": "Does Going Viral Help With SEO? Not Really",
  "description": "Many people believe the key to SEO success is to go viral... not quite. Here are some examples that may give you unexpected insights.",
  "content": "Patrick Stox Patrick Stox is a Product Advisor, Technical SEO, & Brand Ambassador at Ahrefs. He was the lead author for the SEO chapter of the 2021 Web Almanac and a reviewer for the 2022 SEO chapter. He also co-wrote the SEO Book For Beginners by Ahrefs and was the Technical Review Editor for The Art of SEO 4th Edition. He’s an organizer for several groups including the Raleigh SEO Meetup (the most successful SEO Meetup in the US), the Beer and SEO Meetup, the Raleigh SEO Conference, runs a Technical SEO Slack group, and is a moderator for /r/TechSEO on Reddit. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents I wanted to find out how going viral impacts SEO for different businesses. I thought that with all the news coverage and links these sites received that their businesses would be booming and they’d be ranking for everything.Spoiler alert: I was wrong. There has to be some merit to it though, right? Even Google’s John Mueller seems to be on board with digital PR. https://twitter.com/JohnMu/status/1352967238442229762To learn more, I looked at dozens of sites. Some are from when I judged search awards. Others are from various Slack groups. I also asked for examples on Twitter. I found that going viral helps with their rankings a bit, but not as much as you may expect. There are some examples I want to share with you. It’s also worthwhile to mention that going viral still helps with things like branding, awareness, leads, and possibly even new business opportunities. Let’s dive in.ContentsAn unbelievable eventIt’s been over two years since an infamous political press conference happened at the “wrong” Four Seasons. A presidential press conference was held at a Philadelphia landscaping company, Four Seasons Total Landscaping, instead of the Four Seasons hotel. This was a case of reality being stranger than fiction. I don’t think this event would be believable if it were in a sitcom. If you’re curious about the story itself, you can read about it. In fact, there’s even a documentary.The results look good at a glanceYou can see the crazy spike in both traffic and domains linking to the company at the time of the press conference. It got another spike of links and traffic a year later as a documentary was released about the event and a lot of news outlets wrote about the story again.The links look good—really good! The coverage of this event was amazing and generated the kind of virality digital PR folks dreamed about. Below, you can see that most major news sites covered this story.I’ve seen companies win search awards with campaigns that don’t have results this good.Most link builders would drool over these links. There are so many followed, high DR links. If you saw this kind of link profile and the increased traffic for any local service business, you’d think it had won the lottery. With numbers like that, you’d assume it ranked for and could rank for pretty much anything it wanted.But did the links actually help its SEO? There’s more to this story. Capitalizing on the fameMost of the traffic gains are for its branded terms or people looking for its merchandise. That’s right—there’s merchandise!The most brilliant move from this landscaping company was how it capitalized on its fame. It sold $1.3 million in merchandise within three weeks of the event! It turned this publicity into a win.It originally had the merchandise on the website, but then later partnered with another Philly company to sell the merchandise on a different website.It made a mistake here. It failed to redirect its merchandise pages over to the other site. The merchandise might have been even more successful if it had reclaimed these links with redirects. What about the main business? According to an article a year after the event, the newfound fame had only netted them three new clients. I’m surprised it wasn’t more with this kind of branded traffic increase. But I guess the increase was from people interested in the story and not its services.Impact on its main keywordsThe links have some impact. The company is ranking better for its commercial keywords, but they don’t help as much as you may expect for a local business that has this strong of a link profile. It hasn’t hit the first page for many of the terms that will likely bring it business.For some terms, another local business is outranking it while having no links at all. Overall, it looks like all those new links from going viral don’t have much impact on its rankings.Repeated press coverage over timeNext up is Gravity Payments. You may not know this name, but I bet you know the story of the CEO who cut his own salary so he could pay every employee $70K.The CEO was also involved with some scandals, which led to even more links. However, these links may have some negative signals attached to them.You can see at a glance that it got tons of links over the years. But that hasn’t really helped its traffic. The links are from a lot of major sites, and they look great. Again, drool-worthy links for anyone doing link building or digital PR. But the impact on its rankings is minimal. Once again, most of the traffic is branded. It gets very little traffic for its main terms or its informational content. All of those links don’t seem to have helped. An idea that took offLayoffs.fyi started during COVID to connect “laid off” people with hiring managers. It got another boost during the recent tech layoffs. At a glance, the results look great.Once again, we can see great links from great domains.Diving in further, we can also tell almost all of the traffic is to the homepage.A lot of the growth is to branded terms, but one unbranded term sticks out: “layoff.” If you look at the SERP a year ago vs. now, it seems the intent of the query has changed from “what is a layoff” to news about layoffs.It’s possible that the popularity of this site changed the intent, or it could just be the changing environment with more layoffs happening that changed the intent. Still, this is the most plausible example I can find of viral links possibly helping—and even then it’s not so cut and dry.What does it mean for SEO?I think SEOs may overvalue links from media sites. They really don’t seem to have much impact. But is digital PR dead? Are HARO links a waste of time? I doubt it. They impact awareness, branding, and leads.Final thoughtsFrom what I’ve seen, many SEOs want to skip niche and local links, which can be tedious and boring to obtain. They want to jump right into working on more interesting and creative digital PR campaigns. I don’t blame them; digital PR campaigns are more fun and interesting. I just question the effectiveness of doing this after looking at dozens of example sites.If you have examples where digital PR links have made an impact on the business, I’ll love it if you share them with me on Twitter. I really want to find an example of these working well for a company. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Patrick Stox Patrick Stox is a Product Advisor, Technical SEO, & Brand Ambassador at Ahrefs. He was the lead author for the SEO chapter of the 2021 Web Almanac and a reviewer for the 2022 SEO chapter. He also co-wrote the SEO Book For Beginners by Ahrefs and was the Technical Review Editor for The Art of SEO 4th Edition. He’s an organizer for several groups including the Raleigh SEO Meetup (the most successful SEO Meetup in the US), the Beer and SEO Meetup, the Raleigh SEO Conference, runs a Technical SEO Slack group, and is a moderator for /r/TechSEO on Reddit. Keep Learning Do Links From Pages With Traffic Help You Rank Higher? [Ahrefs Study] Links are important for SEO. But what makes a good link? Should you aim to get links from pages with traffic, or does that not matter so much? SEO Pricing: How Much Does SEO Cost? 439 People Polled Did you know that 78.2% charge a monthly retainer? Learn more insights from our survey of 350 SEO professionals. Flesch Reading Ease: Does It Matter for SEO? (Data Study) Flesch Reading Ease (FRE) is a way to score the readability of text. The scores range between 1 and 100, with higher scores deemed easier to read. How Long Does SEO Take to Show Results? We polled both our Twitter and LinkedIn pages to find out. What Does an SEO Consultant Do? Do You Need One? Discover what SEO consultants do, whether your business needs one, and the most important questions to ask before hiring them.",
  "headers": [
    {
      "level": "H1",
      "text": "Does Going Viral Help With SEO? Not Really"
    },
    {
      "level": "H2",
      "text": "An unbelievable event"
    },
    {
      "level": "H3",
      "text": "The results look good at a glance"
    },
    {
      "level": "H3",
      "text": "Capitalizing on the fame"
    },
    {
      "level": "H3",
      "text": "Impact on its main keywords"
    },
    {
      "level": "H2",
      "text": "Repeated press coverage over time"
    },
    {
      "level": "H2",
      "text": "An idea that took off"
    },
    {
      "level": "H2",
      "text": "What does it mean for SEO?"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Patrick Stox"
}