{
  "url": "https://ahrefs.com/blog/web-explorer/",
  "slug": "web-explorer",
  "title": "Introducing Web Explorer by Ahrefs",
  "description": "Ahrefs' Web Explorer lets you search through our search engine’s (Yep) entire database of pages, domains, and links.",
  "content": "Andrei Țiț Showing you how to make the most out of Ahrefs. Mostly through: how-to videos, product updates, webinars, and brochures. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Ahrefs’ toolkit just got bigger with the release of a one-of-a-kind SEO tool: Web Explorer.ContentsWhat Web Explorer doesAt its core, Web Explorer lets you search through our search engine’s (yep.com) entire database of pages, domains, and links using search operators. But there’s more to it.1. See the web like search engines see it (for real)When we say you can search through yep.com’s database of 500 billion pages, we actually mean it.No search engine lets you do this. Not even Google.The “About xxx results” number that appears at the top of Google’s first page of search results is just an estimation, since Google only fetches one page at a time from its index. This means Google doesn’t know how many results there are until it reaches the last page. Hence, the estimate might be close or way off, like in the example below:However, with Web Explorer, you get to see all relevant search queries indexed by yep.com for your topic—including similar ones that might have been omitted on purpose by Google.And also specific properties that make the page appear here, like the presence of backlinks with a certain word in the anchor, word in the title, and so on.2. Search pages by the anchor and URLs of their backlinks and outlinksWeb Explorer also makes it easy to find and access information about pages, backlinks, and outlinks in one place.Use it to quickly search a page’s anchors and URLs of their backlinks and outlinks.For example, (1) when you filter on outlink properties—such as pages with certain words in the anchor text of their outgoing links—you can (2) click on the “Matching linked pages” dropdown to see them.Similarly, (1) when you filter on inlink properties—such as pages with certain words in the anchor text of their backlinks—you can (2) click on the “Matching referring pages” dropdown to see them.This turns Web Explorer into a versatile research tool for various use cases, in particular link building–related ones. We’re going to touch on them later. But first, let’s go over the interface.How Web Explorer worksIn essence, Web Explorer is all about search and custom reports.To use it, type in a keyword and add the following advanced search operators under the “+” dropdown.Here are some advanced Web Explorer search operators:intitle: Find pages with certain words in their titles.indescription: Find pages with certain words in their meta descriptions.incontent: Find pages with certain words in their content.inh1: Find pages with certain words in their H1 tags.inh2: Find pages with certain words in their H2 tags.inurl: Find pages with certain words in their URLs.url: Limit results to those from a specific URL.site: Limit results to those from a specific website.outlinkanchor: Find pages with certain words in the anchor text of their outgoing links.outlinkcontext: Find pages with certain words in the anchor text or surrounding text of their outgoing links.outlinkurl: Find pages that link to a specific URL.outlinkdomain: Find pages that link to a specific website.backlinkanchor: Find pages with links from other websites that have certain words in their anchor text.backlinkcontext: Find pages with links from other websites that have certain words in their anchor text or surrounding text.backlinkurl: Find pages that are being linked to from a specific URL.backlinkdomain: Find pages that are being linked to from a specific website.Any of these operators can be combined. You can also use operators (AND, OR, +, –, and brackets) for nesting, much like Google search operators.For some quick ideas of how to use this tool, switch to the “Examples” tab, which contains the most common use cases as a set of predefined filters.Each use case is clickable and auto-completes itself as you type in a search input.Once you hit search, you’ll get to the results page that is split into four sections.Filters – For further drilling on the pages that are of interest to you.Number of results – Based on the applied filters.Export feature – For the filtered results.Page report table – Has metrics such as word count, DR, UR, referring domains, external links, and so on.For custom search queries like this one that you’ve taken time to build, click on “Save report” to save them:All saved reports will show up under the “My reports” tab on Web Explorer’s landing page.Now that you’ve familiarized yourself with the interface, let’s get to some unique use cases.Use casesSince Web Explorer makes it possible to search for pages by anchors and URLs of their backlinks and outlinks, we’re going to cover some link building–related use cases.1. Find pages that contain certain keywords in the anchor text of their outgoing linksA great way to build links is to search for pages that link to topics you’ve already covered. Then reach out to the site owners to include your website as an outlink.For example, we’ve already written an article about how to perform a content audit that includes a template.To find potential link prospects on this topic, let’s use the search operator outgoinglinkanchor: followed by the words “content template audit.”What this does is show us pages whose outgoing link’s anchor text contains our desired keyword.If we want to further refine our prospects, we could add a Domain Rating (DR) filter to only show pages coming from high-authority websites of, say, above DR 30. You can even specify the URL depth and language.2. Find unlinked brand mentionsAnother low-hanging fruit is to find unlinked brand mentions.And since the author has already mentioned your brand and is familiar with it, you’re already halfway to winning a link.So let’s search for “Ahrefs” first. We’ll exclude pages that already link to ahrefs.com by appending the search with -outlinkdomain:ahrefs.com, as well as those results from ahrefs.com through the search operator -site:ahrefs.com.And right away, we’ve got ~45 million pages that mention Ahrefs but don’t link back to us.It’s impossible to reach out to all of them. Also, some pages may belong to the same domain.So a better way to search meaningful domains is to click on the “Settings” dropdown and select “One page per domain,” along with the other settings. This will narrow down our list to ~300,000 more relevant and manageable prospects.3. Find resource pages in your nicheWhile you could use the Backlinks report in Site Explorer for this exact task, Web Explorer allows you to search the footprint of resource pages across domains (as opposed to a single domain).Let’s say we want to find resource pages in the marketing niche. For this, we’ll build a search query that finds pages that have “marketing” in their titles and either “resources” or “links” in both their titles and URLs.So we’ll start the search with intitle: marketing. And use the intitle: and inurl: search operators. But since “resources” or “links” need to both show up in the search results, we’ll group them using brackets and “OR” as follows:To narrow the list down, we’ll filter for resource pages coming from authoritative websites with a DR of at least 35. I’ll also add a filter on the minimum number of external links with a value of “5” to find pages that link to at least five external resources.These filters helped us narrow down our resource pages to a third of the original results. All that’s left is to reach out to the website owners and ask to be included in those pages.Sidenote. All the use cases we’ve touched on so far are available under the “Examples” tab.Upcoming featuresWeb Explorer is available for new Advanced and Enterprise plans.Please note that this is only the first release, with more features down the roadmap such as:Detecting which technologies the pages are built with (CMS, blog platforms, analytic services, advertising, etc.).Extracting mailto: and tel: data associated with a domain.Adding page traffic numbers + status codes.Identifying blog post authors and filtering by them.Reporting broken links.So go ahead and dive deep into the endless opportunities offered by Web Explorer.If you have any feature suggestions that could enhance the tool, let us know on our Canny page or Ahrefs community. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Andrei Țiț Showing you how to make the most out of Ahrefs. Mostly through: how-to videos, product updates, webinars, and brochures.",
  "headers": [
    {
      "level": "H1",
      "text": "Introducing Web Explorer by Ahrefs"
    },
    {
      "level": "H2",
      "text": "What Web Explorer does"
    },
    {
      "level": "H3",
      "text": "1. See the web like search engines see it (for real)"
    },
    {
      "level": "H3",
      "text": "2. Search pages by the anchor and URLs of their backlinks and outlinks"
    },
    {
      "level": "H2",
      "text": "How Web Explorer works"
    },
    {
      "level": "H2",
      "text": "Use cases"
    },
    {
      "level": "H3",
      "text": "1. Find pages that contain certain keywords in the anchor text of their outgoing links"
    },
    {
      "level": "H3",
      "text": "2. Find unlinked brand mentions"
    },
    {
      "level": "H3",
      "text": "3. Find resource pages in your niche"
    },
    {
      "level": "H2",
      "text": "Upcoming features"
    }
  ],
  "author": "Andrei Țiț"
}