{
  "url": "https://ahrefs.com/blog/website-audit-checklist/",
  "slug": "website-audit-checklist",
  "title": "Free Website Audit Checklist (With Video Walkthrough)",
  "description": "Follow our website audit checklist to discover the critical issues you need to fix. We’ve cut out the fluff to focus on issues that matter.",
  "content": "Despina Gavoyannis Despina is a Senior SEO Consultant with 8+ years of experience growing B2B, e-commerce, SaaS, and national brands. She's an optimist at heart, taking time to enjoy life's silver linings each day. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Have a feeling your website needs an audit but don’t know how to go about it? Trying to win new clients for your agency with a website audit?Check out our website audit checklist to discover the critical issues you need to fix.We’ve cut out the fluff and pinpointed important issues that are not only worth fixing but also move the needle for SEO and user experience.ContentsDownload the website audit checklistGoogle Docs →Google Sheets →Microsoft Excel →Microsoft Word →PDF →Sidenote. Looking for a different format? Request it here.Why you should use our checklistThere are hundreds of potential factors to look at when auditing a website. Our website audit checklist doesn’t cover all of these things. Instead, it allows you to cut through the noise and focus 80% of your time on fixing the 20% of things that matter.It’s also:Easy to follow (each step has clear instructions).Easy to outsource (just send it to an employee, freelancer, or VA).Interactive (check each item off the checklist as you go).DOING A WEBSITE AUDIT FOR A POTENTIAL NEW CLIENT?A website audit is a great way to sell marketing and web design services by helping clients fix major issues. However, it can also be overwhelming for regular business owners to digest.Instead of sending clients a report with hundreds of technical issues they don’t understand (like every other agency out there), focus on the ones that both move the needle and the business owner cares about.It’s much easier to win new business when you solve these pain points in a way the client understands and trusts.What our website audit checklist includesOur website audit checklist covers 27 critical site issues across five broad categories:SEO + performanceContentDesign + UXAccessibilityData privacy + securitySidenote. Yes, there are hundreds of things you could be looking at. Remember, our goal with this checklist is to surface the most important ones quickly so you can get to fixing the issues faster. Finding issues only gets you so far; fixing the ones that matter is what really moves the needle.How to use the checklistFollow the three simple steps below or watch the video walkthrough.https://www.youtube.com/watch?v=Twbum_-i0ZY1. Get access to analytics toolsYou will need access to some analytics tools like Google Analytics and Google Search Console. If you’re running the website audit on behalf of a client, they will need to share access to these accounts with you.It’s best to ask for permission as an “Owner” or “Full User” if possible.2. Crawl your websiteSet up a free Ahrefs Webmaster Tools (AWT) account and crawl your website with Site Audit. (Make sure to tick the “Backlinks” option under “Crawl settings,” as this is important for one of the checks in the checklist).3. Download and follow the checklistAs you complete each item, check it off the list.Next stepsWebsites are dynamic and new issues are bound to pop up over time. To stay on top of these (and fix them as soon as they arise), set up regular crawls in Ahrefs’ Site Audit.It’s also worth setting up email notifications in Google Search Console.Both tools will alert you about important issues as they happen so you can fix them well before they cause problems affecting SEO and conversions.If you’ve got any questions, reach out on LinkedIn. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Despina Gavoyannis Despina is a Senior SEO Consultant with 8+ years of experience growing B2B, e-commerce, SaaS, and national brands. She's an optimist at heart, taking time to enjoy life's silver linings each day. Keep Learning The Only 2 Free SEO Audit Tools You Need Can you do an SEO audit with free tools? We think you can do a pretty good one using just two. Free SEO Audit Template (With Video Walkthrough) 100% free to download in multiple formats (Docs, Sheets, Excel, Word, PDF). Covers technical, content, and link optimization for a comprehensive SEO audit. How to Do an SEO Audit in 11 Easy Steps (With Checklist) An SEO audit helps you find and fix SEO issues that may be holding your site back. Learn how to do it right with our nifty checklist. How to Create an SEO-Friendly Website: The Complete Checklist Technically sound, delightful to use, and search-focused. That's what an SEO-friendly website should be like. How to Do a Basic Website Audit to Improve SEO and UX (in 10 Steps) Audit your website for SEO performance issues, things that may be costing you conversions, and user-experience issues that could be confusing visitors.",
  "headers": [
    {
      "level": "H1",
      "text": "Free Website Audit Checklist (With Video Walkthrough)"
    },
    {
      "level": "H2",
      "text": "Download the website audit checklist"
    },
    {
      "level": "H2",
      "text": "Why you should use our checklist"
    },
    {
      "level": "H2",
      "text": "What our website audit checklist includes"
    },
    {
      "level": "H2",
      "text": "How to use the checklist"
    },
    {
      "level": "H3",
      "text": "1. Get access to analytics tools"
    },
    {
      "level": "H3",
      "text": "2. Crawl your website"
    },
    {
      "level": "H3",
      "text": "3. Download and follow the checklist"
    },
    {
      "level": "H2",
      "text": "Next steps"
    }
  ],
  "author": "Despina Gavoyannis"
}