{
  "url": "https://ahrefs.com/blog/website-traffic-down/",
  "slug": "website-traffic-down",
  "title": "Website Traffic Down? Maybe It's Not Your Fault",
  "description": "If your site has lost traffic, it’s natural to wonder what you’re doing wrong. But what if it’s not your fault? Here's how to respond.",
  "content": "Despina Gavoyannis Despina is a Senior SEO Consultant with 8+ years of experience growing B2B, e-commerce, SaaS, and national brands. She's an optimist at heart, taking time to enjoy life's silver linings each day. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents If your site has lost traffic, it’s natural to wonder what you’re doing wrong. But what if it’s not your fault?Let’s be real. Most of the time, it’s likely that it is your fault in some way. You may have site or content quality issues you were unaware of or low-quality links dragging down performance.However, assuming it’s always your fault can be harmful. If you try to “fix” issues that aren’t really there, it can backfire and do more harm than good. Sometimes, losing traffic is truly not your fault and is genuinely out of your control.Here are the top three reasons for traffic losses that aren’t your fault and how you can respond to them.Contents1. Google is stealing your trafficIf your top competitors are all experiencing similar traffic losses to you, then this is your first clue Google might be stealing your traffic.To see if this is happening, plug your website into Site Explorer and add your main competitors to the organic search traffic graph in the Overview report.If the graph looks like this, then Google is favoring an emerging competitor:If this is what you’re seeing, Google is not stealing your traffic. You need to do some competitive intelligence and figure out what your competitor is doing better than you.But if you see a graph like this where most, if not all, competitors’ traffic drops at the same time as yours, that’s a good sign Google is stealing your traffic:To double-check that this is the case, you need to dig a little deeper by asking these questions:Has Google changed the visibility of ads above the fold?Has Google introduced a new organic SERP feature above organic results?Has Google pushed organic results further down on mobile searches?Has Google changed the design of organic results which may affect click-throughs?If you answered yes to any of these, then Google is likely pinching your traffic.If you’re not sure if any of these may be at play, here’s how to find out. Start by entering your main keyword into Ahrefs’ Keyword Explorer. Let’s use “gardening” as the example keyword.Then, scroll to the SERP comparison view. Enter two dates to compare, ideally from a few days before the drop vs a few days after, though you can choose any timeframe that makes sense for your analysis.Here’s an example with a year-over-year comparison:Make note of any changes to the SERP features present and the order they appear in. For instance, from the above example, you can observe all of the following UI changes Google has made:Removal of the local search pack“Top stories” bumped down to position 3“People also ask” bumped down to position 4Shopping results taking up above-the-fold real estateProminence of more images in the SERPsYou can also go a little deeper here by checking the visual layout of the SERPs.For instance, you can do some sleuthing in Wayback Machine to get a feel for what the search results looked like with the local pack:Admittedly, there will be some data gaps here as not every keyword search is recorded by the Wayback Machine, but many popular, evergreen terms should have some historical snapshots.You can then compare these to the live SERPs, especially the above-the-fold region, which for the “gardening” example now looks like this:What’s even more interesting is that instead of each product tile linking off to the website it displays, Google opens up a panel in its own interface instead:If your site ranked in local results for this keyword, that’s a traffic loss you won’t be able to recover, no matter how much effort you put into it.Likewise, if you feature in the “Top stories” or “People also ask” sections, it’s likely difficult to reclaim your traffic since they’ve been bumped so much lower on the page (which correlates to a lower click-through rate).And even for the supposed “winners” in this situation—the ecommerce brands with products featured in the new SERP results—Google is inserting itself in the conversion process and directing less traffic to their product pages to keep more people on its platform.So if you’re losing traffic to Google, it’s likely to be difficult for you to reclaim this traffic because:It’s difficult to show up for every new feature Google releases.Many times, new features won’t make sense for your business model.Google is increasingly inserting itself in the middle of more conversion journeys.Rather, you may be better off looking at Google’s bigger-picture objective and aligning with that. In the gardening example, it would be a case of accepting traffic losses for this specific keyword but then finding the topics and content formats where there is new growth potential instead.To do this, you can check out the keyword forecasts for topics in Keywords Explorer and isolate content angles that are a good fit for your business.2. People’s wants and needs changeMany people use the same phrases but are looking for different things. When this happens en masse, it could trigger an intent switch where Google changes the layout and types of results returned.For example, let’s look at the topic of “conservatorship.” Before Britney Spears’ legal drama became a popular topic for gossip magazines, people mainly searched for this term looking for legal definitions and advice.The top of the SERPs looked like this:But when Britney was going through her legal drama in 2021, the top of the SERPs looked like this with the Top Stories feature taking priority:The Query Deserves Freshness (QDF) model is responsible for this. It’s a re-ranking model that changes SERPs at the last minute to deliver the most current information.In situations like this, if your site remains on the SERPs and the content is relevant to the new intent, you may see a temporary traffic spike. However, if your content is not relevant to the new intent or it’s dropped from results altogether, that’s where you may experience traffic losses.So, how do you respond if there’s an intent switch on your keywords?If you think it’s a QDF event that will pass: You could just wait it out until the rankings re-stabilize.If it’s a minor intent change or something that still aligns with your brand: You could update your content to reflect the shift.If the new intent does not align with your brand: There isn’t much action you can take. It’s best to be transparent with stakeholders about why traffic was lost and how reclaiming it is beyond your control. Instead, show where the new strategic benefits lie and how you’ll be pivoting the strategy.Here’s another reason intent switches can happen: Google’s understanding of what users want improvesThis is actually what happened in the gardening example I used above. Between both dates I checked, there’s been a predominant informational intent in the organic listings. However, Google shifted the features above the fold from prioritizing local services and gardening news to showcasing ecommerce products instead.As Google gets better at understanding what people want, it will continue to make changes like this.In this scenario, as it isn’t a QDF event that will pass, you either need to update your content to reflect the shift or admit defeat and communicate reasons for your traffic loss to stakeholders.3. People’s browsing habits are changingAs users become more tech-literate and adept at using other platforms, their search behaviors and expectations change.More people these days are bypassing Google and turning directly to other platforms like:ChatGPT for conversational searchesYouTube for video contentReddit for user-generated responsesTikTok for snackable, entertaining contentAmazon for product searchesIf Google wants to stay relevant, it needs to make changes that keep younger audiences engaged. As such, these changes can also lead to traffic declines that are beyond your control.A prevalent example of this, taking place in SERPs right now, is how Google includes user-generated content and forum sites in prime organic positions. There was an announcement in 2022 launching the “Forums and Discussions” feature, but many changes have since been made to include more UGC content in SERPs.Sites like Reddit and Quora are now pinching traffic from digital publishers and niche site owners in millions of SERPs where they were not featured before.Let’s look at Reddit’s traffic trend for the last two years in Ahrefs:Overall, Reddit has seen a:24.5% lift in organic keywords81.5% lift in organic traffic47% lift in its Top 3 keywords87.2% lift in Traffic Value (this one blew my mind)And Quora’s performance follows a similar pattern:Quora has seen a:16.7% lift in organic keywords72.3% lift in organic traffic26.7% lift in its Top 3 keywords85.5% lift in Traffic ValueUnless Google makes a change, there’s no chance that publishers and brands that lost traffic will be able to reclaim it easily.Now, it’s not always going to be the case that absolutely nothing can be done. I encourage you to think outside the box here and find creative ways to make winning content in the face of such changes.For example, many SEOs are now posting on Reddit and leveraging Reddit’s existing rankings to get more eyeballs on their content.Changes in user behavior can also often bring about opportunities for new content formats that are untapped and have very little competition. The aim of the game here is to adapt and show up where your audience is searching, even if that’s beyond Google.SEO in its purest form is platform agnostic; it’s not just about Google, and I think many SEOs have forgotten this.Final thoughtsIn general, it’s best to hold off taking action until you’re certain of the root cause of your website’s traffic loss.Tweaking your content or throwing links at a site rarely helps recover traffic you lost for any of the above reasons.But if you feel like there’s more you can be doing, check out our guide on how to recover if your traffic has dropped dramatically.If you’ve got any questions or have examples of other reasons why sites have lost organic traffic when it’s not their fault, feel free to share them with me on X or LinkedIn. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Despina Gavoyannis Despina is a Senior SEO Consultant with 8+ years of experience growing B2B, e-commerce, SaaS, and national brands. She's an optimist at heart, taking time to enjoy life's silver linings each day. Keep Learning Find Out How Much Traffic a Website Gets: 3 Ways Compared Three most well-known ways to estimate website's traffic compared. Plus some advice on estimating website traffic with no tools at all. Crawl Me Maybe? How Website Crawlers Work If you don't grasp the basics of optimizing for web crawlers (and eventual users), your organic traffic may well pay the price. 21 Proven Ways to Drive Traffic to Your Website We've put together 21 tried and tested methods that you can implement to drive even more traffic to your website. How to Submit Your Website to Search Engines Learn how to submit your website to Google, Bing and Yahoo. SEO for a New Website: 8 Important Steps The best time to ensure your site is SEO-friendly is when you're building it. We've distilled the process into eight key steps.",
  "headers": [
    {
      "level": "H1",
      "text": "Website Traffic Down? Maybe It’s Not Your Fault"
    },
    {
      "level": "H2",
      "text": "1. Google is stealing your traffic"
    },
    {
      "level": "H2",
      "text": "2. People’s wants and needs change"
    },
    {
      "level": "H2",
      "text": "3. People’s browsing habits are changing"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Despina Gavoyannis"
}