{
  "url": "https://ahrefs.com/blog/whats-new-at-ahrefs-september-2021/",
  "slug": "whats-new-at-ahrefs-september-2021",
  "title": "What's New At Ahrefs? (September 2021)",
  "description": "Let's get right into the new stuff – use the sidebar to jump straight into updates for a particular tool. Overview 2.0 Overview 2.0 is live! Click that",
  "content": "Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents This month, we released the very exciting Overview 2.0 and a few new handy features. We also moved our tools to a new URL and removed a limit on Lite plans that should make many people very happy.Let’s get right into the new stuff – use the sidebar to jump straight into updates for a particular tool.1. Site Explorer 2.0Overview 2.0Overview 2.0 is live! Click that link or find it in the sidebar of Site Explorer. As with all new report releases, there’ll be changes as we fix things and add new features.You’ll see three main filters in this report.Search volume toggle: use the first filter to switch between monthly or average search volume modes. This affects metrics like traffic and traffic values for your entire report. In general, you can use monthly volume to monitor seasonal search trends and popular topics, and use average volume to troubleshoot traffic drops.Country selector: use the second filter to see data for a specific country. By default, it’s set to “All countries” and shows you estimated global traffic metrics for your target.Changes calendar: use this to see how metrics have changed over different time periods.New history chartSo much love for this from the team. We think that this is the star of the release 😉Previously in the old Overview report, we didn’t show estimated paid traffic to your target. That’s now been added to Overview 2.0. Just make sure that these two toggles are on to see and compare paid traffic vs. organic traffic for your target.The chart also lets you compare multiple targets. Click on Compare domains, add your competitors and hit apply to add them to the chart.Use the dropdown next to Compare domains to select which metric you’d like shown: organic traffic, paid traffic, referring domains, or the number of pages in the top 100 search results.Next, this bar lets you select the timeframe you’d like to see data for. Historical data is limited according to your Ahrefs plan.Finally, this dropdown lets you switch between daily, weekly and monthly chart modes. Weekly and monthly modes display the average of all days within a time period.The history chart in Top pages 2.0 has also been updated to follow this logic. Previously, these modes showed data for the last day of each time period instead of the average which we’re using now.SERP titles toggle in Top pages 2.0Google recently introduced a new system of rewriting titles for pages in the SERP. Wordstream had their title shown in the SERP change from “Free Keyword Tool” to “Learn More About The FREE Keyword Tool.” Unsurprisingly, this made their CTR drop by 37%.Since people were wondering how their pages were affected, we came up with a new titles toggle in Top pages 2.0.Just turn this on to see changes in page titles that are shown in the SERP. You’ll be able to monitor future changes as Google makes updates.Lite plan limit removalPreviously, Lite plan users were limited to seeing only the top 20 keyword positions in Site Explorer. That limit’s now been removed, so anyone on a Lite plan can now see all top 100 keyword positions. Enjoy!2. Site AuditPSI API requests and Billed pages counterWe’ve added two things: a counter for billed pages and also a PageSpeed Insights API requests counter. Click into any crawl and head to your crawl log to find them.The billed pages counter shows you how many crawl credits you consumed during a crawl, while the PageSpeed Insights counter tells you how many requests you’ve made to retrieve Core Web Vitals metrics. This should help you to track your limits consumption and progress pulling Core Web Vitals data.For example, here you can see that both counters are even at 4821, which means that Site Audit has crawled this number of internal pages that returned a 200 response code and pulled CWV data for all of them.3. GeneralKeyword database updateThis month, we:Added 299M new keywords in 91 countriesAdded 57M new keywords in the US aloneSearch volumes now available until July 2021We managed to reverse-engineer many broad matches used by Google, making our volume much more accurate than before. If you noticed increases in search traffic estimations recently, it’s likely because of this.Tool URL changesWe recently moved all Ahrefs tools to app.ahrefs.com. Be sure to update your bookmarks, and remember you can always update an old report URL by appending “app.” to it.For example, change [https://ahrefs.com/rank-tracker/] to [https://app.ahrefs.com/rank-tracker/].There are no changes to your projects, tracked keywords, and all other account data – they remain exactly the same.—That’s all for today.Liked this update? Feel free to share our Twitter thread:Rapid-fire roundup: September 2021 by @itsrbekHere are all our product updates and changes from September 2021 👇https://t.co/j9KxXe3n1E— Ahrefs (@ahrefs) October 4, 2021 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs.",
  "headers": [
    {
      "level": "H1",
      "text": "What’s New At Ahrefs? (September 2021)"
    },
    {
      "level": "H2",
      "text": "1. Site Explorer 2.0"
    },
    {
      "level": "H4",
      "text": "Overview 2.0"
    },
    {
      "level": "H4",
      "text": "New history chart"
    },
    {
      "level": "H4",
      "text": "SERP titles toggle in Top pages 2.0"
    },
    {
      "level": "H4",
      "text": "Lite plan limit removal"
    },
    {
      "level": "H2",
      "text": "2. Site Audit"
    },
    {
      "level": "H4",
      "text": "PSI API requests and Billed pages counter"
    },
    {
      "level": "H2",
      "text": "3. General"
    },
    {
      "level": "H4",
      "text": "Keyword database update"
    },
    {
      "level": "H4",
      "text": "Tool URL changes"
    }
  ],
  "author": "Rebekah Bek"
}