{
  "url": "https://ahrefs.com/blog/whats-new-at-ahrefs-march-2022/",
  "slug": "whats-new-at-ahrefs-march-2022",
  "title": "What’s new at Ahrefs? (March 2022)",
  "description": "New reports, a huge keyword database update and much more.",
  "content": "Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents New reports, a huge keyword database update and more – we’re back after a short break from updates with some exciting announcements for you.Let’s get right into it. Use the sidebar to jump to updates for a specific tool.1. Site ExplorerNew metrics in Overview 2.0We’ve beefed up Overview 2.0 a little with a new section for Paid keywords and Pages in the stats block itself.Look a little further down the report to the history chart, which now shows both organic traffic value and paid traffic cost.Click on these metrics to toggle them on and off in the chart.New: Site structure reportNote: Site structure is available if you’re on a new Advanced plan or higher.This is a big one. Site structure shows you any website’s structure in a tree format without having to crawl it. On top of that, you’ll also see some top level metrics for each path.Use this report to quickly analyze the sections of a website that are driving the most organic traffic, referring domains, or paid traffic metrics.Don’t forget that the date picker lets you see changes over a specific time period and customize the report for your needs. New: Paid keywords 2.0Another exciting report launch – the Paid keywords report’s been revamped.We’ve added a date picker so that you can compare changes between two dates, and also improved the filters to help you sort through your data. These Position and Keyword filters previously weren’t available in Site Explorer 1.0.And that’s not all – we have three new features for you.First up is this handy new mini chart that shows the distribution of paid vs. organic clicks.In this example, we can see that Monday is advertising for their brand name, monday.com. And if we hover over the chart, we’ll see that 56% of clicks came from paid and 43% from organic.Next, you can now add keywords directly to Rank Tracker and Keywords Explorer lists by clicking on this plus icon next to them.Finally, we’ve added a new history chart for ads positions.Click on this hamburger icon to see which landing pages were advertised for a keyword in the past, and how that’s changed over time. This helps you to understand the PPC competition for that keyword.If you hover over these bars, you’ll also see actual ad copy at each point in time. With this, you can track how the ad itself changed over time.2. Keywords ExplorerAds positions history chartThe same ads positions history chart we introduced above is now also available in Keywords Explorer itself.Just enter your keyword and scroll down to see it.3. GeneralKeyword database updatesLast year, we invested a lot of time and resources on improving our keyword data.A quick summary: we refined our search volume numbers by blending data from multiple sources and finding the right balance between them. We also improved our database update frequency and introduced monthly search volume values for each keyword, with an option to export them into CSV.Read more in this blog post.This March, we added 500M new keywords across all countries, with around 40M in the US alone. Monthly search volume trends are now available until January ‘22.New filters in Mentions AlertsOpen your Alerts and head over to Mentions to see some handy new filters: Domain rating, Website traffic, Word count, and Exclude subdomains.Play around with these to really fine tune your tracking of web mentions for queries relevant to your business.Ahrefs WordPress PluginWe’re finally ready to publicly announce the Ahrefs WordPress Plugin!With this plugin, you’ll be able to automate your content audits and grow organic traffic to your WordPress website.What the plugin does is regularly audit your blog and show you how each article performs for a chosen target keyword based on Ahrefs, GA and GSC data. Then it suggests what you can do to improve their performance.Go download it and give it a try. Or, read this blog post to learn how to install the plugin and run your first audit.—That’s all for today.Liked this update? Feel free to share our Twitter thread:Ready to catch up on the latest Ahrefs’ updates with @itsrbek? 🌻Find out about our:- All-new Site Structure report- Paid Keywords report- History chart for ads positions- Keyword database update…and more! ▶️ https://t.co/nB8HaW0jDA pic.twitter.com/iiig7QWaW2— Ahrefs (@ahrefs) April 6, 2022 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs.",
  "headers": [
    {
      "level": "H1",
      "text": "What’s new at Ahrefs? (March 2022)"
    },
    {
      "level": "H2",
      "text": "1. Site Explorer"
    },
    {
      "level": "H4",
      "text": "New metrics in Overview 2.0"
    },
    {
      "level": "H4",
      "text": "New: Site structure report"
    },
    {
      "level": "H4",
      "text": "New: Paid keywords 2.0"
    },
    {
      "level": "H2",
      "text": "2. Keywords Explorer"
    },
    {
      "level": "H4",
      "text": "Ads positions history chart"
    },
    {
      "level": "H2",
      "text": "3. General"
    },
    {
      "level": "H4",
      "text": "Keyword database updates"
    },
    {
      "level": "H4",
      "text": "New filters in Mentions Alerts"
    },
    {
      "level": "H4",
      "text": "Ahrefs WordPress Plugin"
    }
  ],
  "author": "Rebekah Bek"
}