{
  "url": "https://ahrefs.com/blog/whats-new-at-ahrefs-2022/",
  "slug": "whats-new-at-ahrefs-2022",
  "title": "What's New at Ahrefs? (2022)",
  "description": "We released 60+ new features and updates in 2022, including brand-new reports, free tools, and more. Here are the most notable ones.",
  "content": "Andrei Țiț Showing you how to make the most out of Ahrefs. Mostly through: how-to videos, product updates, webinars, and brochures. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents In 2022, we released over 60 new features and updates, including brand-new reports, free tools, and API endpoints. Here’s a roundup of the most notable ones. Contents1. Site ExplorerOverview 2.0Overview 2.0 became the default view for Ahrefs’ Site Explorer.It’s faster and more reliable than the previous version, as it only contains backlinks from sites we’ve crawled in the past six months and unique keywords.It has also built the foundation for a series of new widgets. Here are some from last year:Year-over-year mode – Shows the yearly performance of your target website in terms of its traffic, backlinks, or indexed pages—making seasonal trends easy to spot.Chart notes – Features Google algorithm updates directly on the Performance chart so you can analyze changes in organic traffic and see if they could have been caused by these updates.Organic Keywords graph – Now shares the same settings as the Performance chart, which means applying certain filters changes the data in both charts.Backlink stats – Shows the most important backlink metrics of a website: the % of followed vs. nofollowed links, together with UR and DR distribution graphs.NoteOverview 2.0 is not finished! We’re improving it based on your feedback, so let us know what widgets we should add next.Available: on all plans.URL Rating (UR) 2.0We’ve also brought the popular URL Rating (UR) metric back in 2.0 reports.This is not the same UR as shown in legacy reports—but an improved one that’s calculated with new algorithms, which will evolve over time.You can even monitor the UR change over time under the Performance chart, with data available since August 2022.NoteUR 2.0 is still in beta. Known issues will be fixed soon.Available: on all plans.Site structure reportSee a website’s structure without having to run a crawl.Use the Site structure report to analyze a website’s top-level folders in terms of organic traffic, referring domains, and paid traffic metrics.In return, you will easily spot where your competitors are putting their money and efforts.Available: on new Advanced plans and higher.Calendar reportAnother long-awaited feature was the Calendar report. It features:A visual calendar for both keyword positions and pages (referring domains coming soon).Filters for every metric.Improved speed.Click on any day on the calendar to analyze daily gains and losses.Available: on all plans (only Positions tab + no calendar UI); on new Standard plans and higher, and on legacy Advanced plans and higher (for all tabs + calendar UI).Organic competitors reportThe brand-new Organic competitors report is your best ally when it comes to doing competitive research.It includes:A visual competitive map of your top five organic competitors (the bigger the circle, the more pages a competitor has).Comparison mode to see how the competitive landscape has changed over time.Competitor’s keywords to find missed keyword opportunities.Competitor’s pages to find top pages worth building.NoteThis report replaces our old Competing domains and Competing pages reports and is still in beta. We’re still working on improving a few UI and filter elements.Available: on all plans.2. Keywords ExplorerHistorical SERP checkerSpotting SERP changes just got easier with the new date picker in the SERP overview.Go back in time and see what the SERP looked like for any given query in our index. How far back you can go depends on your plan:Standard – Six months.Advanced – Two years.Enterprise – Unlimited.Available: on new Standard plans and higher.SERP comparison and SERP similarity scoreUse SERP comparison to compare a keyword by date or two completely different keywords.On top of this, we’ve also introduced a new SERP similarity score. It shows you how similar two SERPs are on a 100-point scale based on the number of results they have in common and their relative position.Quite useful when you’re not sure whether to target more than one keyword with the same page.Available: on all plans.Copy URLs in SERP overviewA lesser-known yet very practical UI element was also added to the SERP overview.Just select the position wanted and either click on Copy to copy the URLs or Open in to open them directly in the Content Gap or Link Intersect tools without having to manually copy/paste them.Available: on all plans.SERP features filtersWe’ve also added three new SERP features:Local pack – For search results with local intent.Videos – For search results with large blocks of multiple videos.Video preview – For search results with a video thumbnail next to them.This brings the total number of SERP features that Ahrefs tracks to 15.NoteLocal pack is assigned a position within a SERP (like any other SERP feature that we recognize), but we don’t differentiate if a target website is ranking in a local pack or not (due to reporting country-specific rankings).Available: on all plans.3. Site AuditImproved Hreflangs reportAfter many questions over the support chat, we decided to make the Hreflangs report more actionable.The new report comes with a few upgrades:Eye-catching error badges for hreflang issuesMultiple URL hreflangs from (or to) the same URL merged into one rowCompact lists to skim through issues more easilyWe hope all those dealing with hreflang issues on a consistent basis will find it useful.Available: on all plans.HTML comparisonTroubleshooting SEO issues also got easier even for non-technical SEOs.The URL details report (after clicking on a page with issues) now features a comparison dropdown that allows you to compare a page’s raw HTML with its rendered version.As well as the text and HTML from previous crawls to spot changes in content.Available: on all plans.HTTP authenticationAnother great addition to Site Audit is the HTTP authentication feature.This lets you crawl staging and restricted websites protected by basic or digest HTTP authentication. In short, if at least one of the seed URLs entered returns a 401 status code upon creating a new project, a “Website requires HTTP authentication” message will show up.You’ll then need to provide the website credentials so we can recheck seed URLs, verify ownership, and crawl the website.Available: on new Advanced plans and higher.Affected links reportsA bunch of predefined issues also got a new affected links report.Previously, you’d see a list of issues for a particular page. However, many issues were related to links, not pages.Now, we’ve made it convenient to just switch to the “links” tab and quickly see a list of the links related to the issue.Available: on all plans.Bulk export of issuesExporting SEO issues one by one was indeed frustrating.We’ve put an end to that by allowing you to export the entire list of issues at once.Just click on Export all issues to start preparing a zip archive with .csv files for all issues in the background. When ready, your download will be available in the export tray (upper-right corner).Available: on all plans.4. Rank TrackerShare of Voice (SOV)The Rank Tracker underwent a small change.Mainly, a renaming of the “Visibility” metric to “Share of Voice (SOV),” which is much more common in the SEO industry and should be clearer for a wider audience.As a reminder, SOV represents a website’s overall visibility in organic search results for the keywords being tracked. At the same time, it’s a vital metric for measuring SEO ROI.Available: on all plans.5. Content ExplorerNews modePR just got better with the release of “News” mode.Unlike the “All pages” mode, “News” mode shows results based on a list of preapproved news domains. It also features a much cleaner “Pages over time” graph to help you spot interesting publishing trends.Use it to follow mentions of your brand + discover media outlets to get featured.Available: on Standard plans and higher.6. GeneralGoogle Data Studio integrationYou asked, we delivered!With the launch of our Google Data Studio (now Looker) integration, you can build your own reports by blending data from three different Ahrefs connectors:Site Explorer Connector – Get search traffic, keyword, and backlink data of any page or website.Site Audit Connector – Track keyword rankings in 170+ countries and SOV.Rank Tracker Connector – Check your website against 130 predefined SEO issues.To make the best out of the GDS connectors, please consult the documentation.Available: on new Advanced plans and higher.API 3.0Our new API 3.0 allows Enterprise users to pull data from Site Explorer and Keywords Explorer.The following Site Explorer endpoints are available: Overview, Backlinks, Referring domains, Organic keywords, Top pages, and Paid pages reports. The following Keywords Explorer endpoints are available: keyword metrics for a single keyword or a list of keywords, volume history for a single keyword, and volume by country for a single keyword.The easiest way to get started with our API is to click on the API button. This will generate an API query for the current report, which is dynamically updated with any filters you apply.Read more about API units consumption in our API documentation.Available: on Enterprise plans.SSOWe’ve increased the security of our platform and the ease of managing user access across large teams by adding two powerful Single Sign-On (SSO) features:SSO enforcementIt’s now possible to enable SSO-only login for the workspace. This means that workspace members cannot use other authentication methods, except SSO, for logging in. The only exceptions are the workspace owner and admins, who’ll be able to log in using their email and password in the case of SSO failure.SCIM user provisioningSCIM allows a third-party Identity Provider, or IdP, to manage users within the Ahrefs workspace. Once SCIM is enabled, any user assigned to the Ahrefs application in the IdP will automatically be added to your Ahrefs workspace. If a user is unassigned from Ahrefs in the IdP, they will be removed from the Ahrefs workspace as well.Available: on Enterprise plans.Workspace guest role We’ve also added a new user role called Guest.Unlike other user roles, guests only have access to projects and folders explicitly shared with them and cannot create new projects. This comes in handy for controlling user access in the workspace.Available: on Enterprise plans.7. Free toolsApart from updating the design for all our free tools, we’ve also released a brand-new one: website traffic checker.The free tool shows organic monthly traffic estimates, value, and history for any website or webpage for the past six months. It also features:Traffic share by country.Top five keywords in the country with the largest traffic share.Top five pages by traffic for the same country.Exploring your competitors has never been this easy.Available: under the free tools hub.ConclusionThat’s a wrap for last year’s features. Stay tuned for more awesome ones soon to come! Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Andrei Țiț Showing you how to make the most out of Ahrefs. Mostly through: how-to videos, product updates, webinars, and brochures.",
  "headers": [
    {
      "level": "H1",
      "text": "What’s New at Ahrefs? (2022)"
    },
    {
      "level": "H2",
      "text": "1. Site Explorer"
    },
    {
      "level": "H3",
      "text": "Overview 2.0"
    },
    {
      "level": "H3",
      "text": "URL Rating (UR) 2.0"
    },
    {
      "level": "H3",
      "text": "Site structure report"
    },
    {
      "level": "H3",
      "text": "Calendar report"
    },
    {
      "level": "H3",
      "text": "Organic competitors report"
    },
    {
      "level": "H2",
      "text": "2. Keywords Explorer"
    },
    {
      "level": "H3",
      "text": "Historical SERP checker"
    },
    {
      "level": "H3",
      "text": "SERP comparison and SERP similarity score"
    },
    {
      "level": "H3",
      "text": "Copy URLs in SERP overview"
    },
    {
      "level": "H3",
      "text": "SERP features filters"
    },
    {
      "level": "H2",
      "text": "3. Site Audit"
    },
    {
      "level": "H3",
      "text": "Improved Hreflangs report"
    },
    {
      "level": "H3",
      "text": "HTML comparison"
    },
    {
      "level": "H3",
      "text": "HTTP authentication"
    },
    {
      "level": "H3",
      "text": "Affected links reports"
    },
    {
      "level": "H3",
      "text": "Bulk export of issues"
    },
    {
      "level": "H2",
      "text": "4. Rank Tracker"
    },
    {
      "level": "H3",
      "text": "Share of Voice (SOV)"
    },
    {
      "level": "H2",
      "text": "5. Content Explorer"
    },
    {
      "level": "H3",
      "text": "News mode"
    },
    {
      "level": "H2",
      "text": "6. General"
    },
    {
      "level": "H3",
      "text": "Google Data Studio integration"
    },
    {
      "level": "H3",
      "text": "API 3.0"
    },
    {
      "level": "H3",
      "text": "SSO"
    },
    {
      "level": "H3",
      "text": "Workspace guest role"
    },
    {
      "level": "H2",
      "text": "7. Free tools"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    }
  ],
  "author": "Andrei Țiț"
}