{
  "url": "https://ahrefs.com/blog/whats-new-at-ahrefs-feb-2023/",
  "slug": "whats-new-at-ahrefs-feb-2023",
  "title": "What’s new at Ahrefs? (Feb 2023)",
  "description": "Introducing Organic search view in Overview 2.0, a new treemap chart in Keywords Explorer reports, and more.",
  "content": "Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents We have some really exciting updates this month: Organic search view in Overview 2.0, a new treemap chart in Keywords Explorer reports, and more.Let’s get right into it.https://www.youtube.com/watch?v=g9xpc0KaFQc&ab_channel=AhrefsProductUpdates1. Site ExplorerOrganic search view in Overview 2.0The new organic search view in Overview 2.0 shows you details on your target’s performance in organic search like their organic traffic, keywords, and pages.Use these tabs to switch between this view and the General view.And if you want to change your default Overview 2.0 view, just click on your Site Explorer settings.The Organic search view introduces two new widgets: Top Organic keywords and Top Organic pages, which display the top 5 organic keywords or pages for your target respectively. You can switch between seeing data by traffic, by traffic change (winners and losers), or new and lost metrics.New position range groups for Organic keywords chartIn the Organic keywords chart, we used to only have position ranges for 1–3, 4–10, and 11+. We’ve now added three new groups for more granularity — 11–20, 21–50, and 51+.Just click to toggle each position group on and off.2. Keywords ExplorerTreemap chart in Keyword ideas reportsWith the new addition of the treemap chart, you can now instantly visualize the size of keyword opportunities when you enter a seed keyword in Keywords Explorer and look at its parent topics.Use the Groups filter to switch between seeing results by terms or by parent topic. You can show results as a treemap chart view, as a list view, or choose to hide both.When looking at the new treemap chart, the bigger the size of a group, the bigger that group’s search volume is when compared to the rest of the keywords in the report. For example, here, “retractable dog leash” is a much bigger opportunity based on search volume than “outdoor leash for dog”.Click on any interesting keyword to see the keywords that match that term or parent topic.Over in list view, we’ve also added a bar chart that offers the same quick visualization.Lowest DR filterThis filter lets you see keywords that have at least one ranking position in top results with a DR lower than your specified value.For example, to spot potentially low competition keyword ideas, you could apply a filter for a DR of up to 20 in the top 5 positions. This gives you a list of hundreds of keywords where low authority sites are ranking in the top 5.3. GeneralAudit log in Account settings for Enterprise plansWe’ve added a new Audit log that displays credit usage by user for all Enterprise plans. If your workspace has many users, it will show the top 20 users and group the rest into a bucket labeled “Other”.This should make it much easier to track, predict, and plan for credits usage in your workspace.How to use articles for Site Explorer 2.0We’ve updated all how-to articles for each Site Explorer 2.0 report, so you can get actionable use cases on how to best use them.Find them all in one place in Ahrefs Academy. Or, click on this How to use prompt in any Site Explorer 2.0 report and get taken there directly.—That’s all for this month. If you have any feature requests, you can leave them on our Canny. Enjoy! Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs.",
  "headers": [
    {
      "level": "H1",
      "text": "What’s new at Ahrefs? (Feb 2023)"
    },
    {
      "level": "H2",
      "text": "1. Site Explorer"
    },
    {
      "level": "H2",
      "text": "2. Keywords Explorer"
    },
    {
      "level": "H2",
      "text": "3. General"
    }
  ],
  "author": "Rebekah Bek"
}