{
  "url": "https://ahrefs.com/blog/whats-new-at-ahrefs-june-2022/",
  "slug": "whats-new-at-ahrefs-june-2022",
  "title": "What's new at Ahrefs? (June 2022)",
  "description": "We have a bunch of quality of life improvements for you this month in Site Explorer and Content Explorer.",
  "content": "Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents We have a bunch of quality of life improvements for you this month in Site Explorer and Content Explorer.Use the sidebar to jump to updates for a specific tool.1. Site ExplorerFilter for main positions only in Organic keywordsNow, you can remove ranking positions in Sitelinks, Top stories, Image packs, and Tweets from your results in the Organic keywords report.Toggle this “Main positions only” filter on to remove anything that isn’t an organic result from the main table and the list of URLs in the positions history chart.This might improve reporting for people who want to see where they rank, but don’t consider features like image packs as “ranking”.What won’t change is the behavior of SERP overview table. SERPs will always show and highlight all positions whether this filter is toggled on or not.2. Content ExplorerStreamlined filter for page publication datesBefore, there used to be three separate filters for page publication dates.We’ve now combined them into one simplified filter to improve user experience.Just click on the Publication date filter to switch between all pages, pages that have been published only once, and pages that have been republished.Streamlined filters for pagesWe’ve done the same thing with filters for pages and grouped three of them into one.Just click on the filter to apply any combination of filters for One page per domain, Exclude homepages and Exclude subdomains at one go.3. GeneralSet limits for reports consumptionIf you’re a workspace owner or admin, you can now go to Limits & Usage in Account Settings and click on “Select max limits” to set limits for individual workspace members, as well as a global limit for additional pay-as-you-go reports.Once a user hits their specified limit, they will no longer be able to pull reports.Additional confirmation for top filtersPreviously, any filter you selected was applied instantly across all Ahrefs tools.Now, you can select all your filters before clicking on “Show results” to apply them all at one go. This applies to all new Site Explorer reports, Keywords Explorer, and Content Explorer.With this change, you should notice that you’re consuming less reports than before.Previously, applying 10 filters consumed 10 reports. Now, if you apply all these filters at once, it consumes just 1 report.—That’s all for this month. See you next! Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs.",
  "headers": [
    {
      "level": "H1",
      "text": "What’s new at Ahrefs? (June 2022)"
    },
    {
      "level": "H2",
      "text": "1. Site Explorer"
    },
    {
      "level": "H4",
      "text": "Filter for main positions only in Organic keywords"
    },
    {
      "level": "H2",
      "text": "2. Content Explorer"
    },
    {
      "level": "H4",
      "text": "Streamlined filter for page publication dates"
    },
    {
      "level": "H4",
      "text": "Streamlined filters for pages"
    },
    {
      "level": "H2",
      "text": "3. General"
    },
    {
      "level": "H4",
      "text": "Set limits for reports consumption"
    },
    {
      "level": "H4",
      "text": "Additional confirmation for top filters"
    }
  ],
  "author": "Rebekah Bek"
}