{
  "url": "https://ahrefs.com/blog/whats-new-at-ahrefs-apr-2024/",
  "slug": "whats-new-at-ahrefs-apr-2024",
  "title": "What’s new at Ahrefs? (April 2024)",
  "description": "Introducing the Backlinks Calendar report, mobile vs desktop distribution stats, Tags 2.0 in Rank Tracker, and more.",
  "content": "Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents This month we’re introducing the Backlinks Calendar report, mobile vs desktop distribution stats, Tags 2.0 in Rank Tracker, and more.Let’s get right into it.https://www.youtube.com/watch?v=nv_3HzhIjfw&ab_channel=AhrefsProductUpdatesSite ExplorerBacklinks Calendar reportWe’ve released the Backlinks calendar report, which shows you all the day-to-day changes for new and lost backlinks.Since new pages are created and die all the time, you can use the best links filter to focus on links that are important for your site.This report is great for competitor link monitoring – you can check for new or lost links pointing to your competitors.Available on: new Standard plans and above + legacy Advanced plans and above.Keywords ExplorerWe have some new metrics to introduce this month:Mobile/Desktop columnThis M/D column shows you the split of searches that happen on mobile vs desktop.First seen column The “first seen” column shows you the date on which we first discovered a keyword and added it to our index. You can sort by this column to see the keywords we most recently found and discover new or trending keywords.Search type distribution statsOn the Overview report, we’ve also added search type distribution stats.This helps you understand the format searchers prefer when keying in a given query and optimize content you create for different search types.Cross-tool updateExport to Google SheetsYou can now export data directly from all Site Explorer and Keywords Explorer reports to Google Sheets.Just link your Google account and allow permissions.Rank TrackerTags 2.0 reportThe Tags 2.0 report is now live. New features include:Compare mode to see historical dataSort by change valuesClick on the Keywords column to view keywords in Overview 2.0.Filter by URL in GSC PagesUse this URL filter in the GSC pages report to find pages quicker.GeneralAPIv3: Keywords history improvementsThe keywords history endpoint in APIv3 now supports:Select query parameterMore ranking groups, which lets you find keywords with varying ranking potentialAs always, you can use the API button in reports as a query builder.Read documentationAPIv3: New outgoing link counts endpoint Next, we’ve added one of the most requested API features – outgoing link counts.This lets you fetch data for the outgoing links from your target and optimize them at scale.Read documentation–That’s all for this month. Check out the Ahrefs changelog for more updates, and leave any feature requests on our Canny. Enjoy! Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs.",
  "headers": [
    {
      "level": "H1",
      "text": "What’s new at Ahrefs? (April 2024)"
    },
    {
      "level": "H2",
      "text": "Site Explorer"
    },
    {
      "level": "H2",
      "text": "Keywords Explorer"
    },
    {
      "level": "H2",
      "text": "Cross-tool update"
    },
    {
      "level": "H2",
      "text": "Rank Tracker"
    },
    {
      "level": "H2",
      "text": "General"
    }
  ],
  "author": "Rebekah Bek"
}