{
  "url": "https://ahrefs.com/blog/whats-new-at-ahrefs-jan-2024/",
  "slug": "whats-new-at-ahrefs-jan-2024",
  "title": "What’s new at Ahrefs? (Jan 2024)",
  "description": "Introducing a new AI feature to identify search intent, “best links” in Overview 2.0, mobile usability issues in Site Audit and more.",
  "content": "Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents This month we’re introducing a new AI feature to identify search intent, the “best links” filter in Overview 2.0, mobile usability issues in Site Audit and more.Let’s get right into it.https://www.youtube.com/watch?v=aS0a5-CF-Yo&ab_channel=AhrefsProductUpdatesSite Explorer“Best links” filter in Overview 2.0The Best links filter is now also in Overview 2.0. Using the filter here affects all backlink-related counts and historical charts, which lets you filter out link noise from all widgets.For example, here we’re looking at the referring domains graph for a few competing pages on wireless earphones.Let’s hit the best links filter and select Show best links only, then Show results.Applying the filter affects the graph like so. With the filter applied, the top two results have even swapped places towards the end of 2023.This helps paint an even clearer picture of the performance over time when it comes to so-called “good links”. Remember that you can always input your own custom settings by opening the filter itself and hitting “Configure best links filter”. Site structure report available for Lite plan usersAll Lite plan users, both legacy and new, can now access the Site structure report for domain- and subdomain-level metrics.Site Structure shows you the structure of a website in a tree format, along with metrics for each path level – without having to run a crawl. This helps you understand different sections of a website and how they contribute to its SEO. Deprecated legacy reportsWe’ve deprecated a bunch of legacy backlink reports:BacklinksBroken backlinksReferring domainsNew & Lost AnchorsInternal backlinksBest by linksBest by links’ growthLinked domainsOutgoing anchorsAll reports already have a replacement in Site Explorer 2.0.Cross-tool updateIdentify search intent with AI We’ve added a new AI feature that identifies keyword search intent in the SERP overview widget in Site Explorer, Keywords Explorer and Rank Tracker.Instead of categorizing search intent into traditional models like informational, navigational or transactional, this classification is more granular – it tells you in simple terms what people searching for a keyword might want to find. This gives you multiple paths or content angles that you can use to rank.Just look for the “Identify intents” button to get started.For example, if we identify search intent for the query “best microwave”, we’d see that people searching for this keyword could be looking for product reviews and recommendations of the best-performing microwave ovens, or information on the most reliable microwave brands. New SERP feature: Discussions and forumsOur SERP overview widgets now show a new SERP feature: Discussions and forums.We take rankings in this feature into account when calculating organic traffic – traffic is distributed equally between all URLs.Rank TrackerNew filters in GSC keywords reportIn the GSC keywords report, you can now filter by clicks, impressions, CTR, and position.We’ve also added a “URLs” column which shows you the number of pages ranking for a keyword. Just click on a number to open a nested table and see all URLs.Site AuditMobile usability issuesSite Audit now reports problems with mobile usability on your site. The five issues we report on are:Viewport not setContent not sized correctlyFont size too smallTap targets are too small or too close togetherIf a document uses pluginsTo find these issues, you’ll need to:Connect to PageSpeed Insights APISelect the mobile user agent in your crawl settingsRun a new crawlGeneralEnable two-factor authenticationYou can now enable two-factor authentication, or 2FA, from Account settings > My account. This lets you improve account security with time-based passwords via mobile apps like Google Authenticator.If you’re a workspace owner or admin, you can also make 2FA mandatory for all workspace members from Account Settings > Members.Note that 2FA is tied to an account rather than a workspace. So if you’re a member of multiple workspaces and one requires 2FA, you’ll need to perform 2FA every time you sign in.New APIv3 endpoint: AnchorsYou can now fetch anchor texts at scale with the new APIv3 endpoint for our Anchors report in Site Explorer.Read API documentation As always, use the API button in the report to generate sample requests.–That’s all for this month. Check out the Ahrefs changelog for more updates, and leave any feature requests on our Canny. Enjoy! Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs.",
  "headers": [
    {
      "level": "H1",
      "text": "What’s new at Ahrefs? (Jan 2024)"
    },
    {
      "level": "H2",
      "text": "Site Explorer"
    },
    {
      "level": "H2",
      "text": "Cross-tool update"
    },
    {
      "level": "H2",
      "text": "Rank Tracker"
    },
    {
      "level": "H2",
      "text": "Site Audit"
    },
    {
      "level": "H2",
      "text": "General"
    }
  ],
  "author": "Rebekah Bek"
}