{
  "url": "https://ahrefs.com/blog/whats-new-at-ahrefs-dec-2022/",
  "slug": "whats-new-at-ahrefs-dec-2022",
  "title": "What’s new at Ahrefs? (Dec 2022)",
  "description": "Introducing Overview 2.0 upgrades, new Outgoing links reports, two powerful SSO features for Enterprise plans, and more.",
  "content": "Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents This month we’re introducing Overview 2.0 upgrades, new Outgoing links reports, two powerful SSO features for Enterprise plans, and more.Let’s get right into it.https://www.youtube.com/watch?v=tfHv1pFK0Q8&ab_channel=AhrefsProductUpdates1. Site ExplorerBacklinks and referring domains in Overview 2.0We’ve added a new widget that shows you important metrics for backlinks and referring domains. Use this to get a sense for the distribution of followed, nofollow, UGC, and sponsored links for your target.You can also see the distribution of your target’s backlinks by either URL Rating or Domain Rating. This helps you to understand the quality of the backlinks your target has, since links from high-authority websites have more weight than those from low authority websites.Outgoing links reportsWe’ve launched three Outgoing links reports – Linked domains 2.0, Outgoing anchors 2.0, and Outgoing links, which is a brand new report.Let’s start off with Linked domains 2.0, which shows you a list of the unique domains that your target is linking to.Here, we’ve added a new linked pages column that shows you a list of the actual pages on each domain that your target is linking to.For example, if you click on the number in the linked page column for Hubspot’s domain, you’ll see the number of pages we’ve linked to and how many times we’ve linked to them.We’ve also added a bunch of new filters which you can use to quickly sift through data. For example, set the DR filter to a maximum of 10 to see which low-authority websites you link to.Next, Outgoing anchors 2.0. This report shows the terms and phrases used in anchor texts for the outgoing links from your target website.We’ve added new filters here as well. Quick use case: you can now add a filter for outgoing anchors by referring page language to look at only German anchors used on the site.Or, add a filter for Linked domain name and type in a URL to see which anchors are pointing to that specific website.Lastly, the new Outgoing links report.This report shows you all the external outgoing links on your target. Like in the previous two reports, we’ve added a bunch of useful filters to help you zoom in on data.Take this Target DR filter for example. You can set it to 0-20 to all see the outgoing links on your website that are pointing to low authority domains.2. Rank TrackerVisibility renamed to Share of VoiceJust one small update here: we’ve renamed the term “Visibility” to “Share of Voice”.Share of voice is a term that’s more commonly used in the SEO and marketing worlds. It represents a website’s overall visibility in organic search results for the keywords being tracked and is a key metric for measuring SEO ROI. This should be clearer for a wider audience.3. Cross-tool updateTraffic value in SERP overview widgetIf you look at the SERP overview widget in Site Explorer or Keywords Explorer, you’ll see a new Traffic value metric that shows you the estimated value of a page’s monthly organic search traffic. This value is country-specific, like the traffic and keywords metrics.4. General“Guest” user role for Enterprise plansWe’ve added a new user role called Guest. Unlike other users, Guests cannot create new projects and only have access to projects and folders that are explicitly shared with them. This is perfect for controlling user access in the workspace.Learn more about access control features here.SSO features for Enterprise plansWe’ve added two powerful Single Sign-On (SSO) features.First, you can now enable SSO-only login for the workspace. This means that workspace members cannot use other authentication methods besides SSO to log in to Ahrefs. The exceptions are the workspace owner and admins, who’ll be able to login using their email and password in the case of SSO failure.Second, you can now enable SCIM to make it easier for your organisation’s admins to manage user access across multiple applications.SCIM allows a third-party Identity Provider, or IdP, to manage users within Ahrefs workspace. Once SCIM is enabled, any user assigned to the Ahrefs application in the IdP will automatically be added to your Ahrefs workspace. So if a user isn’t assigned to Ahrefs in the IdP, they will be removed from the Ahrefs workspace.Please reach out to our support team for help with enabling SCIM for your IdP.—That’s all for this month. If you have any feature requests, you can leave them on our Canny. Enjoy! Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs.",
  "headers": [
    {
      "level": "H1",
      "text": "What’s new at Ahrefs? (Dec 2022)"
    },
    {
      "level": "H2",
      "text": "1. Site Explorer"
    },
    {
      "level": "H4",
      "text": "Backlinks and referring domains in Overview 2.0"
    },
    {
      "level": "H4",
      "text": "Outgoing links reports"
    },
    {
      "level": "H2",
      "text": "2. Rank Tracker"
    },
    {
      "level": "H4",
      "text": "Visibility renamed to Share of Voice"
    },
    {
      "level": "H2",
      "text": "3. Cross-tool update"
    },
    {
      "level": "H4",
      "text": "Traffic value in SERP overview widget"
    },
    {
      "level": "H2",
      "text": "4. General"
    },
    {
      "level": "H4",
      "text": "“Guest” user role for Enterprise plans"
    },
    {
      "level": "H4",
      "text": "SSO features for Enterprise plans"
    }
  ],
  "author": "Rebekah Bek"
}