{
  "url": "https://ahrefs.com/blog/whats-new-ahrefs-may/",
  "slug": "whats-new-ahrefs-may",
  "title": "What's new at Ahrefs in May?",
  "description": "I'm sure you'll be glad to know that your favourite SEO tool is getting better and better every single day! Back in the days I used to write short",
  "content": "Tim Soulo Tim Soulo is CMO at Ahrefs. With over 15 years in the digital marketing industry, Tim is the author of many data-driven studies and actionable marketing frameworks, some of which gained industry-wide recognition. He enjoys challenging conventional marketing knowledge and optimizing for simplicity and efficiency. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents I’m sure you’ll be glad to know that your favourite SEO tool is getting better and better every single day!Back in the days I used to write short articles on Ahrefs blog to communicate our weekly/monthly progress, but somehow this practice slowly faded.Which might have made some of you think that we’re not moving as fast as we used to with development of new tools and features (and exploring new ways we could push the SEO industry forward).So we’re bringing these updates back!Every month I’m going to do a quick recap of what’s new in Ahrefs, so that you could immediately leverage every new feature and datapoint that we add to the platform.0. Two BIG tools are on their wayNearly 70% of all our development resources are now focused on releasing two mammoth tools: new Rank Tracker and new Site Audit.I know I teased the screenshots of both tools quite a few times, but they’re simply too awesome to not share them here again:the up and coming Site Audit tool in Ahrefsthe up and coming Rank Tracker tool in AhrefsUnfortunately there’s no exact release date on any of these tools, but (from what I can tell) the new Rank Tracker is going to be released first. Site Audit is coming right after.1. The entire Ahrefs’ link index was rebuiltCrawling and storing the link index of the entire web is an immense challenge. And there’s absolutely no way to get it right from the first go. As well as from the second or third one.From time to time we might discover some minor issues with our link index, fixing which requires us to rebuild it from the scratch.And one of such rebuilds was completed this month. *happy*One of the things that we’ve fixed this time is the “Linked domains” report for subdomains and subfolders:Previously this report was showing data for the entire domain at all times, even when you were using subdomain or subfolder as your target. But now it’s all perfect.2. Position distribution historyWe’ve added a new set of graphs to the Overview report in Site Explorer (Organic Search tab):This adds an additional layer of insight to the total number of keywords that a target website ranks for in top100.These same graphs can also be seen in “Organic Keywords” > “New” report, where you can actually filter out the new keywords in each group:3. http/https protocol pickerI’m sure many of you have noticed this new little feature without any special announcement:The thing is (even when you have all the proper redirects in place) http://url and https://url are technically two different URLs. As well as www and non-www version of that URL.This little dropdown shows you all possible combinations and shows how many backlinks are pointing at each of them.4. Word count in Content ExplorerWe have added “word count” to search results in Content Explorer. As well as the way to filter the search results by this metric:5. New filters at “Organic keywords”The “New” and “Movements” reports, which are indented under “Organic keywords”, now have 3 much awaited filtering options:Volume,Keyword Difficulty,SERP features.Overall, we think that a lot of reports under Site Explorer require some new or improved filtering options. And we do have plans to put some work there this year.6. Small improvement of Alerts UIYou may have noticed that adding a new campaign to your Ahrefs Dashboard automatically creates a set of different email alerts.And under Alerts section you can always create more of them.Well, now we have a clear differentiation between alerts that were created from Dashboard and the custom added ones:The “dashboard alerts” can only be deleted together with the parent Campaign. But you can still turn them off anytime you want.Back to youSo that’s a brief recap of our progress in May. (Not counting dozens of small bugs that we’ve found and fixed thanks to your support requests.)We might not be adding a lot of new stuff until we release those two big tools, but I highly encourage you to send all sorts of feedback and feature requests our way.We have a huge roadmap and your feedback helps us a lot in prioritising what we should do next.The best way to share your feedback is via our private Facebook group. Or you can always leave product feedback on Canny. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Tim Soulo Tim Soulo is CMO at Ahrefs. With over 15 years in the digital marketing industry, Tim is the author of many data-driven studies and actionable marketing frameworks, some of which gained industry-wide recognition. He enjoys challenging conventional marketing knowledge and optimizing for simplicity and efficiency.",
  "headers": [
    {
      "level": "H1",
      "text": "What’s new at Ahrefs in May?"
    },
    {
      "level": "H2",
      "text": "0. Two BIG tools are on their way"
    },
    {
      "level": "H2",
      "text": "1. The entire Ahrefs’ link index was rebuilt"
    },
    {
      "level": "H2",
      "text": "2. Position distribution history"
    },
    {
      "level": "H2",
      "text": "3. http/https protocol picker"
    },
    {
      "level": "H2",
      "text": "4. Word count in Content Explorer"
    },
    {
      "level": "H2",
      "text": "5. New filters at “Organic keywords”"
    },
    {
      "level": "H2",
      "text": "6. Small improvement of Alerts UI"
    },
    {
      "level": "H2",
      "text": "Back to you"
    }
  ],
  "author": "Tim Soulo"
}