{
  "url": "https://ahrefs.com/blog/whats-new-at-ahrefs-may-2022/",
  "slug": "whats-new-at-ahrefs-may-2022",
  "title": "What’s new at Ahrefs? (May 2022)",
  "description": "This month, we’re talking about our new Ads report in Site Explorer and the latest keyword database update.",
  "content": "Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents This month, we’re talking about our new Ads report in Site Explorer and the latest keyword database update.Let’s get right into it.1. Site ExplorerNew Ads reportThe Ads report finally got its revamp.Like with all new reports, use the date picker to compare changes between two dates.We’ve also improved the filters to help you sort through your data. Previously, you could only either search for keywords in the body copy of the ads, or exclude keywords and URLs from the report.But now, you can search for keywords in the ad titles or Display URLs themselves, and filter by metrics like Total traffic, URL, and much more.Plus, one new addition: we now show all the destination pages for each ad. You’ll only see one destination page most of the time, but there can be exceptions sometimes.Click on this caret to open a nested table that shows you an ad’s keywords and destination URLs.2. GeneralKeyword database updateOver the last couple of months, we’ve been working on improving our data quality and removing spikes, dips and outliers – typically, misspelled keywords with huge search volumes.With our latest release:Search volumes for most keywords are now available until March 2022Added ~350M new keywords to our database (75M+ in the US alone)—That’s all for this month. Enjoy! Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs.",
  "headers": [
    {
      "level": "H1",
      "text": "What’s new at Ahrefs? (May 2022)"
    },
    {
      "level": "H2",
      "text": "1. Site Explorer"
    },
    {
      "level": "H4",
      "text": "New Ads report"
    },
    {
      "level": "H2",
      "text": "2. General"
    }
  ],
  "author": "Rebekah Bek"
}