{
  "url": "https://ahrefs.com/blog/whats-new-at-ahrefs-oct-2022/",
  "slug": "whats-new-at-ahrefs-oct-2022",
  "title": "What’s new at Ahrefs? (Oct 2022)",
  "description": "Introducing the new side-by-side SERP comparison feature, News mode in Content Explorer, Best by links report and more.",
  "content": "Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents This month we’re introducing the new side-by-side SERP comparison feature, News mode in Content Explorer and more.Let’s get right into it.https://www.youtube.com/watch?v=wNttPgmy-E0&ab_channel=AhrefsProductUpdates1. Site ExplorerNew URL Rating (beta)You’ll see this beta version of our new URL Rating in the score card and history chart in Overview, as well as in the Backlinks report.This new UR is an entirely different metric from the old UR shown in legacy reports. It’s calculated with new algorithms, which will evolve and improve over time.Best by links reportThe new best by links report shows you which pages on your target have the most external and internal backlinks pointing to them. We’ve also added a bunch of new filters plus the historical mode feature for External backlinks.One way to use this report is to find out which of your competitors’ pages have the most links. Just set their domain as the target and click on the HTTP code filter, then set a “200 ok” filter to see only live pages.A quick look through the results will tell you the type of content that attracts links in your industry.New SERP feature: VideosBefore, we used to group Videos under Top stories in the SERP features filter. We’ve now changed this logic to correctly distinguish between these features.2. Keywords ExplorerSide-by-side SERP comparisonWe’ve added a new feature in the SERP overview widget that lets you compare two SERPs side by side.You can compare a keyword by date…Or compare SERPs for two completely different keywords.3. Site AuditHreflangs report improvementsWe’ve refined the Hreflangs report in URL details with a few improvements.Firstly, we’ve added more error badges to the hreflangs report, like this one that shows when the target’s return hreflang is not matching its self-hreflang.We’ve also started grouping hreflangs by URL, so now multiple hreflangs from or to the same URL are merged into one row. You’ll notice that this makes the list more compact.On top of that, we’ve also changed the design of the hreflangs list to a table format, which makes it easier to scan and spot issues.4. Content ExplorerNews modeWe’ve introduced a News mode alongside the existing All pages mode. The main difference between the two modes is that All pages is based on our database of billions of web pages, while News is based on pre-determined news domains.So while All pages mode can help you find the most shared and “linked-to” content on the web, News mode gives a better representation of the overall trend of a topic.Let’s take the keyword “fidget spinner” for example. In All pages mode, results are pretty distributed over time. In News mode, though, we can see that the trend really took off in 2017, and the buzz has died down since.5. GeneralKeywords by top position chart in API v3First up, we’ve added an endpoint for the Keywords by top position chart to API v3, which is the latest version of our API for Enterprise plans.Read about all the cool new features available in API v3 in our API documentation.Keyword database updateSearch volumes are now available until July 2022 for most keywords.—That’s all for this month. Enjoy! Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs.",
  "headers": [
    {
      "level": "H1",
      "text": "What’s new at Ahrefs? (Oct 2022)"
    },
    {
      "level": "H2",
      "text": "1. Site Explorer"
    },
    {
      "level": "H4",
      "text": "New URL Rating (beta)"
    },
    {
      "level": "H4",
      "text": "Best by links report"
    },
    {
      "level": "H4",
      "text": "New SERP feature: Videos"
    },
    {
      "level": "H2",
      "text": "2. Keywords Explorer"
    },
    {
      "level": "H4",
      "text": "Side-by-side SERP comparison"
    },
    {
      "level": "H2",
      "text": "3. Site Audit"
    },
    {
      "level": "H4",
      "text": "Hreflangs report improvements"
    },
    {
      "level": "H2",
      "text": "4. Content Explorer"
    },
    {
      "level": "H4",
      "text": "News mode"
    },
    {
      "level": "H2",
      "text": "5. General"
    },
    {
      "level": "H4",
      "text": "Keywords by top position chart in API v3"
    },
    {
      "level": "H4",
      "text": "Keyword database update"
    }
  ],
  "author": "Rebekah Bek"
}