{
  "url": "https://ahrefs.com/blog/whats-new-at-ahrefs-feb-2024/",
  "slug": "whats-new-at-ahrefs-feb-2024",
  "title": "What’s new at Ahrefs? (Feb 2024)",
  "description": "Introducing the new Linking authors report, comparing search intent between SERPs with the help of AI, and more.",
  "content": "Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents This month we’re introducing the new Linking authors report, comparing search intent between SERPs with the help of AI, and more.Let’s get right into it.https://www.youtube.com/watch?v=NPQSx3Vb7k8&ab_channel=AhrefsProductUpdatesSite ExplorerLinking authors reportThis new Linking authors report shows you authors who are linking to your target.You’ll see useful stats for each linking author like:Top DR, which tells you the highest DR out of all referring domainsNo. of referring pagesTotal estimated traffic from that authorNo. of linksUse this report to quickly see a list of authors who commonly link to your competitors, find journalists who commonly publish within your industry, and so on.Available on: new Standard plans and higher. Exclude up to 10K domains in Best linksYou can now exclude a list of up to 10K domains in the Best links filter.Just open up the filter from Overview or any backlink-related report, hit Configure, copy and paste your list and hit Save.From here, when you select “show Best links only”, you’ll filter out all unwanted domains from your results.Cross-tool updateCompare search intent between two SERPs with AIWe’ve made two improvements to our Identify Intents AI feature in the SERP overview widget in Site Explorer, Keywords Explorer and Rank Tracker.First up, you can now compare search intent between two SERPs.This lets you see how intent has changed from the past and work out how to best update your content. You can also use this to identify opportunities to rank multiple times with posts targeted at different intents.Also new are these estimated traffic shares for results, which lets you identify the dominance of each intent.Rank TrackerGSC pages reportThe new GSC pages report shows you your Google Search Console data for pages right in Ahrefs.We’re working on adding:Filters for clicks, impressions, CTR, and positionsExport capabilitiesKeyword columnsNested keyword tables Ranking history reportWe’ve released the Ranking history report in Rank Tracker – this was formerly known as the Grossing report.It’s now faster and has better filters, plus an improved Position history chart similar to the one in Overview 2.0.GeneralNew APIv3 endpoints for Outgoing anchorsYou can now fetch outgoing anchor texts programmatically with two new APIv3 endpoints for Site Explorer:Outgoing external anchorsOutgoing internal anchorsAs always, use the API button in the report itself to generate sample requests. Top websites improvementsWe’ve made some improvements to Top websites.What’s new:Trending up and down sections, both worldwide and per countryBadges for new websitesTraffic value metrics and a history chart on individual website pages–That’s all for this month. Check out the Ahrefs changelog for more updates, and leave any feature requests on our Canny. Enjoy! Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs.",
  "headers": [
    {
      "level": "H1",
      "text": "What’s new at Ahrefs? (Feb 2024)"
    },
    {
      "level": "H2",
      "text": "Site Explorer"
    },
    {
      "level": "H2",
      "text": "Cross-tool update"
    },
    {
      "level": "H2",
      "text": "Rank Tracker"
    },
    {
      "level": "H2",
      "text": "General"
    }
  ],
  "author": "Rebekah Bek"
}