{
  "url": "https://ahrefs.com/blog/whats-new-at-ahrefs-april-2022/",
  "slug": "whats-new-at-ahrefs-april-2022",
  "title": "What’s new at Ahrefs? (April 2022)",
  "description": "This month we’re introducing Google Data Studio integration, Google algorithm chart notes in your history charts, and more.",
  "content": "Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents This month we’re talking about Google Data Studio integration (!!!), Google algorithm chart notes in your history charts, and a couple of smaller, quality of life improvements.Use the sidebar to jump to updates for a specific tool.https://www.youtube.com/watch?v=HZxZkBny01M&ab_channel=AhrefsProductUpdates1. Site ExplorerNotes in history chartsFind these new chart notes in the history charts in your Overview, Top pages, and Paid pages reports.Hover over the icons at the bottom of your history chart to see Google algorithm and Ahrefs keyword data updates that rolled out on a specific date.Use these notes to cross-reference any changes in your target website’s organic search traffic numbers and see if it was likely caused by a major Google algorithm update. For example, in the history chart for this website, the Google Core update on April 2018 coincided with a huge drop in organic traffic.We’ve also marked out our own Ahrefs keyword database updates, since these might have an influence on the charts as well.To toggle chart notes on and off, click on this chart settings icon.Comma-separated values in text filtersAll text filters in Site Explorer 2.0 now support comma-separated values. This means that you don’t have to create a separate rule for each word or phrase anymore.For example, in Organic Keywords, you can click on the Keyword filter and enter “checker, free”.In the dropdown that appears, selecting “all values” will search for all ranking keywords that contain BOTH checker and free. And if you select “any value”, you’ll search for all ranking keywords that contain checker OR free.Before, you would have to add another rule to do this.Copy-to-clipboard featureNext up, we’ve added a handy copy-to-clipboard feature in Site Explorer.Find it in the Organic and Paid keyword reports. Just select your keywords and click on this Copy button to copy all the text.2. GeneralGoogle Data Studio integrationWe have a really exciting general update this month. This has been one of our most requested features since forever, and it’s finally here – Ahrefs now has Google Data Studio integration for Advanced plans and higher.With our new Data Studio connectors, you can build your own reports by blending data from different sources and visualizing everything in the form of reports and dashboards.Find the connectors for Site Explorer, Site Audit and Rank Tracker in the Data Studio gallery.Or, follow the links below to go straight to each connector. The team has also written some how-to guides and set up demo reports. Find those in this documentation.Direct links:Site Explorer connectorSite Audit connectorRank Tracker connector—That’s all for this month. Check out our dashboard for the latest updates! Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs.",
  "headers": [
    {
      "level": "H1",
      "text": "What’s new at Ahrefs? (April 2022)"
    },
    {
      "level": "H2",
      "text": "1. Site Explorer"
    },
    {
      "level": "H4",
      "text": "Notes in history charts"
    },
    {
      "level": "H4",
      "text": "Comma-separated values in text filters"
    },
    {
      "level": "H4",
      "text": "Copy-to-clipboard feature"
    },
    {
      "level": "H2",
      "text": "2. General"
    },
    {
      "level": "H4",
      "text": "Google Data Studio integration"
    }
  ],
  "author": "Rebekah Bek"
}