{
  "url": "https://ahrefs.com/blog/whats-new-at-ahrefs-oct-2023/",
  "slug": "whats-new-at-ahrefs-oct-2023",
  "title": "What’s new at Ahrefs? (Oct 2023)",
  "description": "Introducing standalone Internal links reports, redesigned keyword clusters in Keywords Explorer, and more.",
  "content": "Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents This month we’re introducing standalone Internal links reports, redesigned keyword clusters in Keywords Explorer, and more.Let’s get right into it.https://www.youtube.com/watch?v=VoOsP7dHlcQ&ab_channel=AhrefsProductUpdatesDashboard & Site ExplorerPopular domain autosuggestionsWe’ve added popular domain autosuggestions to both Dashboard and Site Explorer. Before, we used to show only suggestions from your search history.Just type in a keyword to see suggestions for the top 5 domains with the most traffic.Site ExplorerInternal links reportsWe’ve extracted our Internal links reports and grouped them under a new standalone Internal links section. Before, this data was a lot more hidden and spread out across other Site Explorer reports.You can now also use this new toggle to explore:Inbound links and anchors coming to a pageOutbound links and anchors from your target page.The Incoming anchors report may prove particularly useful in showing you exactly how you’re linking to pages on your website and how to optimize internal anchor texts if needed.For example, here I’m checking the anchor text we’re using to link to our Beginners’ SEO guide.Keywords ExplorerRedesigned keyword clustersWe’ve redesigned keyword clusters as two new subreports:Clusters by parent topic, which groups keywords under the parent topic they share by popularityClusters by terms, which groups keywords under a single term shared by all keywordsFind these tabs in all keyword ideas reports, as well as the keyword list overview.In the table below, you’ll see keyword metrics for the clusters themselves as well as the parent topic, which determines if you can rank for your target keyword while targeting a more general topic instead. To identify the Parent Topic, we take the #1 ranking page for your keyword and find the query responsible for sending the most search traffic to that page.Note: Our keyword clustering is instant – no need to upload a list of keywords and wait for them to be processed and organized. Just input your seed keyword and Ahrefs groups thousands of search queries containing that keyword into clusters right away.Available on: All new plans.Keyword Difficulty trend graphWe’ve added a new trend graph in Keyword Explorer’s Overview that shows Keyword Difficulty changes over time. The graph shows monthly averages starting from May 2021.This should give you a good sense for how hard it’s been to rank well for that keyword in a specific location over the years.Rank TrackerDefault device for projectsBy default, Rank Tracker displays desktop rankings – but for some projects, mobile rankings can be more important.You can now choose the default rankings (either desktop or mobile) from each project’s settings. Settings are stored per user, and not by workspace.–That’s all for this month. If you have any feature requests, you can leave them on our Canny or in our subscribers-only Ahrefs Insider community. Enjoy! Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs.",
  "headers": [
    {
      "level": "H1",
      "text": "What’s new at Ahrefs? (Oct 2023)"
    },
    {
      "level": "H2",
      "text": "Dashboard & Site Explorer"
    },
    {
      "level": "H2",
      "text": "Site Explorer"
    },
    {
      "level": "H2",
      "text": "Keywords Explorer"
    },
    {
      "level": "H2",
      "text": "Rank Tracker"
    }
  ],
  "author": "Rebekah Bek"
}