{
  "url": "https://ahrefs.com/blog/whats-new-at-ahrefs-nov-2023/",
  "slug": "whats-new-at-ahrefs-nov-2023",
  "title": "What’s new at Ahrefs? (Nov 2023)",
  "description": "Introducing Link Intersect 2.0, our first AI feature that lets you generate seed keywords in Keywords Explorer, and more.",
  "content": "Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents This month we’re introducing Link Intersect 2.0, our first AI feature that lets you generate seed keywords in Keywords Explorer, and more.Let’s get right into it.https://www.youtube.com/watch?v=6SpN0-EM4nQ&ab_channel=AhrefsProductUpdatesCompetitive AnalysisLink Intersect 2.0Meet Link Intersect 2.0, our latest release in Competitive Analysis. This tool shows you who’s linking to one or more targets, but not others.For example, to see who’s linking to competitors but not to us, select referring domains and enter our domain in the top section. Then add a few competing websites in the bottom section and hit show opportunities.This shows us over 99 thousand domains that link to one or more of our competitors, but not to us.While this was also doable in the old Link Intersect tool, we’ve added some new features and filters to unlock new use cases.Firstly, you can now see referring pages in addition to referring domains, so you can build more targeted links. Just use this report toggle at the top.Secondly, we’ve added a new heatmap at the top, which shows us the number of domains or pages that commonly link to our target website and our competitors. A darker color means a higher number of shared links.Thirdly, we’ve added advanced filters. One great use for this is to find listicles to build links from. In referring pages mode, let’s add ConvertKit in the top section, and a couple of its competitors in the bottom. This gives us a list of all the pages that are linking to ConvertKit’s competitors.From here, I’ll set a DR: from 30 filter and a Domain traffic: from 500 filter. And to make results hyper-relevant, let’s also narrow it down to websites that link to all 3 competitors.Right away, this gives us some listicles that might be great targets to reach out for a mention.Finally, we’ve also made Competitive Analysis – Content Gap 2.0 and Link intersect 2.0 – available for all legacy plans.Site ExplorerTop Organic competitors in Overview 2.0We’ve added a new widget in Overview that gives you a handy, visual competitor gap analysis. You’ll now see the top 5 competitors of your target and how everyone matches up against each other in terms of:Organic trafficOrganic traffic valueNumber of pagesThe bigger the size of the circle, the more pages a competitor has.Filters in Top pages and Paid pages reportsYou can now filter by phrase or partial match in:SERP titles in Top pagesAd titles and descriptions in Paid pagesHere’s a quick use case: search for the word “alternative” in ad titles for a competitor’s site to see comparison pages that might be worth looking into.Keywords ExplorerGenerate seed keyword suggestions with AIWe have something really exciting this month: our first AI feature!Now, you can generate seed keyword ideas with AI by choosing a preset and typing a seed keyword. Or, just type in your own prompt.For example, we can ask AI to suggest technical and specialized terms related to golf. This gives us uncommon seed keywords. Since everyone searches using the same seed, it helps us find keyword opportunities that are potentially untapped.If the response is not in your preferred language, try entering the language at the end of your prompt.For example: Suggest technical and specialized terms related to buceo (in Spanish).Available on: All new plans.Improved search suggestions reportWe’ve expanded our list of search suggestions. We now include keywords that aren’t indexed in our database, so you can easily discover emerging trends.For example, if we search for b2b saas marketing and go to the search suggestions report, we’ll see terms like b2b saas marketing org structure and b2b saas marketing tactics. There’s no data available, but these are emerging trends that you could capitalize early on.Note: These keywords will be excluded from the report if you apply a filter since we don’t have metrics attached to them.Site AuditAccess control features Before, any workspace user or guest could modify Site Audit issues for the entire workspace. This lead to a lot of back-and-forth issues where users would turn off important issues for all projects.Now, we’ve implemented access control features as follows:Guests: cannot create custom issuesMembers: can set issues for accessible projects & modify custom issues they createdWorkspace admins and owners: can adjust any project’s issues for workspaceLearn more about access control features.Rank TrackerLooker connector: Filter by exact keyword You can now reproduce the keyword positions history chart directly in Looker Studio, thanks to the new config parameter called “Keyword is”.Go ahead and enrich your SEO reports!Google Search Console keywords in Rank Tracker The new GSC keywords report is now live, showing you Google Search Console data for keywords right in Rank Tracker.This initial release provides basic filtering and shows data for the web search type only. Expect more features in the following release.GeneralUsage monitoring endpoint in APIv3We’ve added a new usage monitoring endpoint in APIv3 for Enterprise plans, so you can set up automated internal notifications and never exceed them.You can now monitor API consumption in terms of:Maximum API units consumable via a specific API keyAPI units consumed by this keyDates for usage reset and API key expirationLearn more in our API documentation.That’s all for this month. If you have any feature requests, you can leave them on our Canny or in our subscribers-only Ahrefs Insider community. Enjoy! Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs.",
  "headers": [
    {
      "level": "H1",
      "text": "What’s new at Ahrefs? (Nov 2023)"
    },
    {
      "level": "H2",
      "text": "Competitive Analysis"
    },
    {
      "level": "H2",
      "text": "Site Explorer"
    },
    {
      "level": "H2",
      "text": "Keywords Explorer"
    },
    {
      "level": "H2",
      "text": "Site Audit"
    },
    {
      "level": "H2",
      "text": "Rank Tracker"
    },
    {
      "level": "H2",
      "text": "General"
    }
  ],
  "author": "Rebekah Bek"
}