{
  "url": "https://ahrefs.com/blog/whats-new-ahrefs-march-2020/",
  "slug": "whats-new-ahrefs-march-2020",
  "title": "What's New At Ahrefs? (March 2020)",
  "description": "Here are all the new features we've shipped since May 2019.",
  "content": "Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents It’s been almost a year since our last product update.The reason why is a somewhat ironic one: we’ve been so busy working on our product that we just haven’t had time to write anything up.So, in today’s post, we’re going to go over some of the features we’ve shipped in the past 10 months.Tracking ‘rel=UGC’ and ‘rel=sponsored’Updated keyword volume calculationTotal monthly search traffic for APIImproved DashboardProjects managerAds history“How to use” tutorialsSearch improvements in Content ExplorerRanking data for massive sitesWildcards (*) in Keywords ExplorerFree toolsOther smaller updatesBy the way, this is really only the tip of the iceberg. Look forward to seeing more product update posts, especially with all the releases we’ve done for Site Audit and our SEO toolbar!1. Tracking ‘rel=UGC’ and ‘rel=sponsored’On 10 September 2019, Google shook up the SEO world by announcing two new link attributes for webmasters: “sponsored” and “UGC”.Today, we’ve announced two new link attributes - “sponsored” and “ugc” - that join “nofollow” as ways to identify the nature of links. All will now work as hints about which links Google Search should consider or exclude for ranking purposes. More details:https://t.co/V6X2xjEC5L— Google Webmasters (@googlewmc) September 10, 2019Here’s how Google explains the new attributes:rel=“sponsored”: Use the sponsored attribute to identify links on your site that were created as part of advertisements, sponsorships or other compensation agreements.rel=“ugc”: UGC stands for User Generated Content, and the ugc attribute value is recommended for links within user-generated content, such as comments and forum posts.We started tracking these just two days after Google’s announcement.This means you can now easily filter for UGC and sponsored backlinks within our Backlinks, Referring domains and Linked domains reports.2. Updated keyword volume calculationPreviously, we used a 30-month average to calculate our search volumes. However, this time period was unintuitive.So, we’ve made the switch to a 12-month average.How does this affect you?Firstly, you’ll notice changes in average monthly search volume for some keywords.Secondly, you’ll notice a sudden drop in estimated traffic for some websites. This is because the keywords they rank for are not as popular as they were a year ago.Just look at the drop for Coinbase.com:Because most bitcoin and cryptocurrency-related searches peaked in late-2017 (over 12 months ago), their “new” search volumes are lower and that has a knock-on effect on the site’s traffic estimation.For websites in more “evergreen” industries, the change should be barely noticeable.Sidenote. To address this, we’re planning on rolling out an update that will recalculate data going backward. This will fix any sudden drops. 3. Total monthly search traffic for APIThis was one of the most upvoted features in our feature request board.And yes, we finally did it. You can now see the total estimated organic traffic in our API.You can also look forward to seeing some of your favorite tools update their services with this metric. Pitchbox and Screaming Frog have already added them:Just released a small update to version 12.6 of the @screamingfrog SEO Spider - https://t.co/4quvZRJ4JU. Now includes Ahrefs keyword, traffic and value data courtesy of their updated API. Enjoy. pic.twitter.com/2r0j6aPGfT— Screaming Frog (@screamingfrog) February 3, 20204. Improved DashboardYou’ve probably noticed that our Dashboard has a new look, but what changed?First, we added organic traffic to the Dashboard, which was a highly requested feature.Second, we added trend graphs for important SEO metrics like referring domains, backlinks, and more.You can also select the timeframe you want for these trend graphs, from 30 days, 90 days and the past 12 months:Third, we added the option to rearrange your projects by drag and dropping them.5. Projects managerWe used to have separate projects for the Dashboard, Rank Tracker and Site Audit. That meant you had to set up multiple projects if you wanted to crawl a site and track your rankings.Now, we’ve combined these projects across all our tools for a single, more cohesive experience.Even better, you can now easily change the settings for any of your projects. All you have to do is click on “Settings”…… and you’ll be able to edit the project:6. Ads historyOur new Ads History report in Keywords Explorer shows you the paid search history for any keyword.With this, you can see which websites have been competing for your target keyword over time. Keywords that your competitors are bidding on consistently may be lucrative, so you might want to consider targeting them.You can also see the ad copy and landing pages that have appeared in the paid search results, which can serve as inspiration for your own ad copy and landing pages.7. “How to use” tutorialsHaving so much data at your fingertips can be overwhelming, so we added actionable tutorials to our reports to help you get the most out of them.These tutorials are available across most of our reports in Site Explorer, Keywords Explorer, Content Explorer, Rank Tracker, and Alerts.Even if you feel like you already know us inside out, take a look at these tutorials. We might surprise you with a trick or two.8. Search improvements in Content ExplorerWe’ve introduced three new ways to group search results in Content Explorer: by authors, websites, and languages.These new angles might help you come up with better tactics to rank higher on Google.For example, one SEO task this is useful for is finding guest post opportunities. Just search for a topic, then click on the total pages number for an author who’s been published on numerous websites.You’ll then see all the posts they’ve written for different sites.Most of these will be guest posts, which means the sites are probably receptive to guest post pitches.9. Ranking data for massive sitesOriginally, you couldn’t access the Organic keywords report for big sites like YouTube or Amazon.But we’ve since removed this limit.How do you make use of this change?Watch this video:https://www.youtube.com/watch?v=BObU_VCwnvY&feature=youtu.be&t=20110. Wildcards (*) in Keywords ExplorerPreviously, you couldn’t use wildcards to include or exclude ideas in Keywords Explorer.Now, you can.For example, you can add “blog*” into the “Include” box to filter for all variations, including “blogging”, “blogger”, “blogs”, etc.11. Free toolsTo encourage new people to try our toolset, we’ve also released a bunch of free tools:Backlink checker — see the top 100 backlinks to any pageKeyword generator — see up to 100 keyword ideas for search engines like Google, Bing, YouTube and AmazonWebsite authority checker — check the Domain Rating of your siteBroken link checker — check your site for broken inbound and outbound linksThis is only the tip of the iceberg. We’ll be releasing more in the future, so keep a lookout!12. OthersHere are some smaller updates we’ve made:Hide tracked keywords in Rank TrackerWe’ve added a toggle so you can easily hide keywords you’re already tracking:Keyword history in Rank TrackerKeyword history in Rank Tracker now shows all URLs that your website was ranking for since we started tracking, so you can see a complete ranking history for that target keyword. Search volume ranges for “New keywords” alertsYou can now choose your desired search volume range when setting up keyword alerts. No more notifications about keywords you aren’t interested in.What should we improve next?Got a feature request? Let us know here, and vote for your favorite feature ideas from others. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Si Quan Ong Content marketer @ Ahrefs. I've been in digital marketing for the past 6 years and have spoken at some of the industry’s largest conferences in Asia (TIECon and Digital Marketing Skill Share.) I also write about my curiosities on my Substack.",
  "headers": [
    {
      "level": "H1",
      "text": "What’s New At Ahrefs? (March 2020)"
    },
    {
      "level": "H2",
      "text": "1. Tracking ‘rel=UGC’ and ‘rel=sponsored’"
    },
    {
      "level": "H2",
      "text": "2. Updated keyword volume calculation"
    },
    {
      "level": "H2",
      "text": "3. Total monthly search traffic for API"
    },
    {
      "level": "H2",
      "text": "4. Improved Dashboard"
    },
    {
      "level": "H2",
      "text": "5. Projects manager"
    },
    {
      "level": "H2",
      "text": "6. Ads history"
    },
    {
      "level": "H2",
      "text": "7. “How to use” tutorials"
    },
    {
      "level": "H2",
      "text": "8. Search improvements in Content Explorer"
    },
    {
      "level": "H2",
      "text": "9. Ranking data for massive sites"
    },
    {
      "level": "H2",
      "text": "10. Wildcards (*) in Keywords Explorer"
    },
    {
      "level": "H2",
      "text": "11. Free tools"
    },
    {
      "level": "H2",
      "text": "12. Others"
    },
    {
      "level": "H3",
      "text": "Hide tracked keywords in Rank Tracker"
    },
    {
      "level": "H3",
      "text": "Keyword history in Rank Tracker"
    },
    {
      "level": "H3",
      "text": "Search volume ranges for “New keywords” alerts"
    },
    {
      "level": "H2",
      "text": "What should we improve next?"
    }
  ],
  "author": "Si Quan Ong"
}