{
  "url": "https://ahrefs.com/blog/whats-new-at-ahrefs-november-2021/",
  "slug": "whats-new-at-ahrefs-november-2021",
  "title": "What’s New At Ahrefs? (November 2021)",
  "description": "Let’s get right into it – use the sidebar to jump to updates for a specific tool. New Traffic Potential metric There’s an exciting new Traffic Potential",
  "content": "Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents We have lots to talk about this month, from new reports and metrics to navigation and keyword database updates.Let’s get right into it – use the sidebar to jump to updates for a specific tool.1. Keywords ExplorerNew Traffic Potential metricThere’s an exciting new Traffic Potential metric in your Overview and Keyword ideas reports.Traffic potential shows you how much organic traffic the #1 ranking page for your target keyword receives from all the keywords that it ranks for in your target country. This gives you an idea of how much traffic you could get if you were to rank first for that keyword.(In an aside, we’ve also removed the Clicks trend chart and Return rate metrics since they haven’t been updated for a long time.)2. Site AuditSearch for any HTML or text content in a crawlBig news: we now store HTML and page text in Site Audit! So after finishing a crawl, you can search for pretty much anything within the content of your pages.With most website crawlers, you have to first configure a custom search or code extraction before running a crawl – in other words, if you made a mistake in your configuration, you’d have to start a new crawl. But since we store all the data on our end in Site Audit, you can run searches without having to go through this trouble.There are lots of use cases for this: since you can find all instances of any term across a website, you can find parts of your website using an older version of a template. Or, search for tracking scripts to find all pages where they’re not present. Or do the opposite and look for all pages that have those tracking scripts.To analyze an individual page, click on a URL in Page Explorer and select HTML source. You can then search through the code for whatever it is you’re looking for.Or, run a search using this filter.3. Site ExplorerNavigation updatesWe’ve updated the navigation bar.In the sidebar menu, Site Explorer 2.0 reports are now the default. You can still find archived versions of the old Site Explorer reports at the bottom of the menu, under the “Legacy” section. The only exception is the Overview report – since Overview 2.0 is still being fleshed out, we left both reports at the top.Paid pages 2.0New release time: this month, it’s the Paid pages report.It’s basically our Top Pages report, except that it shows you a list of pages that are ranking in ads.As with Top Pages, you can click on Compare pages in the history chart to compare paid data for up to 10 pages on your target. Plus, we now show paid traffic and paid traffic cost, which we didn’t show in our paid reports before.Changes in “All countries” mode calculationIn Overview 2.0 and Top pages 2.0, we’ve changed the way we calculate the total number of keywords in All countries mode.Before, when you ranked for the same keyword in two different countries, we counted it as two keywords. But now we only count it as one. This means that you can expect to see a 30 — 40% drop in the number of keywords reported.Country comparison on history chartYou can now compare countries on the history chart in Overview 2.0.Just click on Compare countries in the chart itself to add them.You can also add countries from the Traffic share by country widget below by clicking on these “add to chart” icons. Or, click on “Compare top 5 on chart” to replace the graph above with the top 5 countries.New organic traffic widgetAlso in Overview 2.0, we’ve added a new widget that breaks down the pages on a website into buckets according to the amount of organic traffic they get. This helps you to understand how traffic is spread out across a website’s pages.There are six buckets of pages, ranging from zero traffic to 10K+. Each bucket has two bars which represent the number of pages and the total amount of search traffic these pages get. Use this toggle to see values in percentages.Here, we can see that almost half of our total blog traffic goes to only 6 pages. And over 400, or nearly 30%, of pages on our blog get zero traffic from search. You can click into either bucket for more details.Sort by changes in traffic and ranking positionsOne last update in Site Explorer – this one’s a small quality of life update for the Organic keywords report.Changes in traffic and ranking positions are now displayed in separate columns and can be sorted. With this, you can see the biggest winners or losers over a time period, whether it’s month over month or year over year. This tells you where you’re doing well and where you may need to put more focus on.4. GeneralKeyword database updateSearch volumes are now available until August 2021. For keywords in the US, we’re using a new estimation algorithm that we believe provides more accurate search volume estimates than our competitors. In the upcoming releases, we’ll be applying this algorithm to more countries.-That’s all for today. Liked this update? Feel free to share our Twitter thread:What’s New At Ahrefs? (Nov 2021) by @itsrbek Have we got a host of updates for you, from new reports and metrics to navigation and keyword updates! Check them out here:https://t.co/WA4aDt89oX— Ahrefs (@ahrefs) December 13, 2021 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs.",
  "headers": [
    {
      "level": "H1",
      "text": "What’s New At Ahrefs? (November 2021)"
    },
    {
      "level": "H2",
      "text": "1. Keywords Explorer"
    },
    {
      "level": "H4",
      "text": "New Traffic Potential metric"
    },
    {
      "level": "H2",
      "text": "2. Site Audit"
    },
    {
      "level": "H4",
      "text": "Search for any HTML or text content in a crawl"
    },
    {
      "level": "H2",
      "text": "3. Site Explorer"
    },
    {
      "level": "H4",
      "text": "Navigation updates"
    },
    {
      "level": "H4",
      "text": "Paid pages 2.0"
    },
    {
      "level": "H4",
      "text": "Changes in “All countries” mode calculation"
    },
    {
      "level": "H4",
      "text": "Country comparison on history chart"
    },
    {
      "level": "H4",
      "text": "New organic traffic widget"
    },
    {
      "level": "H4",
      "text": "Sort by changes in traffic and ranking positions"
    },
    {
      "level": "H2",
      "text": "4. General"
    },
    {
      "level": "H4",
      "text": "Keyword database update"
    }
  ],
  "author": "Rebekah Bek"
}