{
  "url": "https://ahrefs.com/blog/whats-new-at-ahrefs-may-2023/",
  "slug": "whats-new-at-ahrefs-may-2023",
  "title": "What’s new at Ahrefs? (May 2023)",
  "description": "Introducing a brand new tool: Web Explorer. Plus, a new backlink profile view in Site Explorer’s overview, keyword lists on Dashboard, and more.",
  "content": "Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents This month we’re introducing a brand new tool – Web Explorer – along with a new backlink profile view in Site Explorer’s overview, keyword lists on Dashboard, and more.Let’s get right into it.https://www.youtube.com/watch?v=oWj0vC9q0ms&ab_channel=AhrefsProductUpdates1. Web ExplorerNew Ahrefs tool: Web ExplorerWeb Explorer lets you search through Yep, our search engine’s, entire database of pages and links using search operators. Its main advantages over Content Explorer are its much bigger index of pages (500B vs. 13B), plus the ability to search for pages by attributes related to backlinks like anchor texts.Head to the Web Explorer landing page to see a list of use cases that give you a fantastic idea of how the report can be used.For example, enter “tears of the kingdom” in the search box and click on “Most quoted newly published pages about tears of the kingdom”. You’ll load the results with the appropriate search operators set in the query, and all relevant filters applied.Or, you could use the search operators to run a more advanced search.For example, you can use the outlinkurl search operator and input: outlinkurl:aweber.com outlinkurl:mailchimp.com -outlinkurl:convertkit.com to find pages linking to Aweber and Mailchimp’s homepages, but not Convertkits’.Web Explorer is available for new Advanced and Enterprise plans.There’s lots that you can do with this new tool, so have fun exploring and watch out for more announcements as we release new features.2. Site ExplorerBacklink profile view in Overview 2.0We’ve added the Backlink profile view in Site Explorer’s Overview 2.0 report. What’s brand new here is this new Top anchors section. Top anchors shows you the anchor texts of the backlinks pointing to your target, statistics for referring domains, and the number of links to your target according to the time period selected in the date picker.Calendar report improvementsWe’ve made a couple of improvements to the Calendar report: first, the Country filter. In the dropdown, we now sort countries by the total number of changes and show this count. The report also now defaults to the country with the most changes.Second, we’ve also added both Ahrefs and Google update notes. So if you notice a big change in positions, these A and G markers now tell you if it may be related to any external updates at a glance.3. GeneralKeyword lists on DashboardKeyword lists that you’ve saved in Keywords Explorer are now available on your Dashboard. You can now also organize them into folders.If you’re on an Enterprise plan, you can also share these keyword lists with other workspace members on your team. Guest users will only have access to lists that are explicitly shared with them.Improving UI for limits configurationWe’ve updated the UI for configuring limits for individual users and additional pay as you go credits.Before, you had to open a modal to configure pay-as-you-go settings from your Limits & usage. Now, you’ll see a dropdown menu right next to a user or limit. To disable additional pay-as-you-go credits completely, just toggle the pay-as-you-go option off.We’re working on more features to customize pay as you go export rows, API units, crawl credits, and more.Confirmation link for sign-ins from a new deviceTo improve account security, we’ve added a confirmation link to our new sign-in email notification.Now, whenever a user with a paid subscription signs in from a new device, they’ll need to click a confirmation link in the email. Different browsers and incognito sessions both count as a new device.Ahrefs APIv2 will stop working on March 1, 2024If you haven’t heard yet, Ahrefs’ APIv2 has been discontinued and will stop working on March 1st, 2024.But we’ve got something even better: APIv3. APIv3 has a ton more endpoints than APIv2, plus you’ll have access to:Organic and paid trafficBacklinksTop pagesKeywordsKeyword trendsSERPs…and we’re still adding additional endpoints.To access APIv3, you’ll need to have an Enterprise plan. If you’d like to upgrade to APIv3, look for the Talk to us button on our pricing page and fill out the short form. Our Enterprise team will be in touch and work with you on a custom plan that meets your specific needs.—That’s all for this month. If you have any feature requests, you can leave them on our Canny or in our subscribers-only Ahrefs Insider community. Enjoy! Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs.",
  "headers": [
    {
      "level": "H1",
      "text": "What’s new at Ahrefs? (May 2023)"
    },
    {
      "level": "H2",
      "text": "1. Web Explorer"
    },
    {
      "level": "H2",
      "text": "2. Site Explorer"
    },
    {
      "level": "H2",
      "text": "3. General"
    }
  ],
  "author": "Rebekah Bek"
}