{
  "url": "https://ahrefs.com/blog/whats-new-at-ahrefs-jan-2023/",
  "slug": "whats-new-at-ahrefs-jan-2023",
  "title": "What’s new at Ahrefs? (Jan 2023)",
  "description": "Some quick updates to introduce this month: custom dates in search-related reports, a new export mode in Keywords Explorer, and more.",
  "content": "Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents This month’s updates are quick and easy: custom dates in search-related reports, a new export mode in Keywords Explorer and more.Let’s get right into it.https://www.youtube.com/watch?v=vaZkrrM_la8&ab_channel=AhrefsProductUpdates1. Site ExplorerCustom dates in search-related reportsYou can now select exact dates when working with historical data. Just click on the date picker and select Custom date to open a calendar view.We’ve also added more presets to the date picker: yesterday, a week ago, a month ago, and so on.2. Keywords Explorer“Group by terms” export modeWhen exporting a report in Keywords Explorer, select “Group by Terms” to get a CSV file showing you all keywords grouped by terms. This is exactly like how you see them inside Keywords Explorer itself.The number of export rows spent is based on the number of keywords exported, even if a keyword is shown under multiple term groups.3. Site AuditFind new issues in All issues pageWe’ve updated the “All issues” page. If there’s a new issue that wasn’t present on a site in the previous crawl, it’ll now be labeled with this “New” badge. You can also use this New issues filter to quickly sort the report.4. Content ExplorerIncreased export for Websites tabYou can now export up to a thousand websites from the Websites tab. Before, you were limited to the top one hundred websites.—That’s all for this month. If you have any feature requests, you can leave them on our Canny. Enjoy! Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Rebekah Bek Developing content to help you understand, navigate, and love using Ahrefs.",
  "headers": [
    {
      "level": "H1",
      "text": "What’s new at Ahrefs? (Jan 2023)"
    },
    {
      "level": "H2",
      "text": "1. Site Explorer"
    },
    {
      "level": "H2",
      "text": "2. Keywords Explorer"
    },
    {
      "level": "H2",
      "text": "3. Site Audit"
    },
    {
      "level": "H2",
      "text": "4. Content Explorer"
    }
  ],
  "author": "Rebekah Bek"
}