{
  "url": "https://ahrefs.com/blog/what-does-an-seo-agency-do/",
  "slug": "what-does-an-seo-agency-do",
  "title": "What Do SEO Agencies Do? (And Tips for Choosing One)",
  "description": "Learn exactly what SEO agencies do, benefits of working with one, and tips for choosing an agency that gels with your business.",
  "content": "Chris Haines Chris is an SEO director who has 10 years of experience in SEO, agency side. When not involved in SEO, he enjoys messing around with vintage synthesizers, walks on sandy beaches, and a good cup of tea. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents I’ve worked in SEO agencies for the past 10 years. During that time, I have become familiar with how they operate. If you’re looking for the inside scoop on what SEO agencies do, keep scrolling down to find out.Let’s get started.ContentsWhat services do SEO agencies provide?The main service an SEO agency will provide is improving your website’s visibility on the search engine results pages (SERPs). More search visibility means more organic traffic will be driven to your website, sending more leads or customers to your business.Services supplied by different agencies vary, but your agency should be able to deliver the following core SEO services for your business.ServiceWhy you need itKeyword ResearchTargeting the right keywords is a fundamental part of SEO and separates the winners from the losers.Link AcquisitionLinks are still a ranking factor in Google. So unless you are a big brand, you will need to acquire links to build authority to your website.SEO ReportingReporting enables you to see how your website is performing against your KPIs.Content CreationConsistently publishing content keeps customers engaged with your brand.Technical SEOEven if you have a development team, it pays to have a technical SEO expert diagnose any SEO issues with your website.Let’s explore these services in more detail. Keyword researchKeyword research is a common starting point for most SEO campaigns. The agency will use this research to discover what keywords it needs to focus on to improve your website’s search visibility.Once your agency has completed the keyword research stage, it will usually present its findings to you. This may come with a lot of SEO jargon, but don’t worry—I’ve translated some phrases you may hear below:Search Volume – This refers to the average number of times a user searches for a query in Google each month. Often abbreviated to “SV” or “MSV” (monthly search volume).Keyword Difficulty – How difficult it is to appear in Google for the keyword.Keyword Ranking – The position within Google of a particular keyword.If you were thinking, “I could do this keyword research myself,” then you would be right. You can.Simply type a domain into Ahrefs’ Site Explorer and check the Organic keywords report.Let’s try this with ahrefs.com. By entering our domain, we can see that Ahrefs already ranks for 85,678 keywords.Clicking on the Competing domains tab, we get a list of our top competitors.If we look at the first row and click on the keywords unique to our competitor, we can get an idea of what keywords our competitor—in this case, Moz, ranks for. From this, we have 62,958 keywords we can potentially target that our competitor ranks for, but Ahrefs doesn’t. We can use this process on all our competitors’ sites, allowing us to form the basis of a keyword research document.The keyword research process isn’t technically difficult— but the interpretation of the data is where you get the value from your SEO agency. The agency’s experience across multiple verticals and business sectors means it is well positioned to advise you on your keyword strategy. Link acquisitionAcquiring links is one of the most important activities in SEO. You need to have links to rank in Google. And yes, it’s still one of the most important confirmed Google ranking factors.Agencies use different tools to identify link prospects, assess their authority, and contact other websites on your behalf.For example, they may use a tool like Ahrefs’ Site Explorer to understand the authority of any link.Their exact methods for acquiring links will depend on your website and its assets, but some agencies will propose to make a piece of content that they think will attract links naturally. Sometimes, agencies will also work in tandem with digital PR teams or directly contact journalists and websites. In my experience, digital PR teams are best at landing the big links, but they need the support of the SEO team to help manage the overall process.When it comes to link building, there is a lot of associated jargon. You may hear your agency use the following terms: Follow/Dofollow Links – These links can influence page rankings with the search engine results.Nofollow Links – These links do not influence the search engine rankings of the destination URL.Domain Rating (DR) – An SEO metric developed by Ahrefs that looks at the quality and quantity of the backlinks to a website and scores them on a scale from 0 to 100.Link Profile – Assessment of all of the links that a website has.The jargon around links doesn’t stop there, unfortunately. But if you want to get more translations, you can check out our SEO glossary.Further reading6 Link Building Services That Actually Work (+6 More to Avoid)SEO reportingPlot spoiler: SEO agencies love documentation. When you work with an agency, it will send you decks, spreadsheets, and many other documents. The documentation acts as the agency’s paper trail and shows that it is delivering the work to you. RoadmapsAs well as supplying the core services, an SEO agency will provide you with a detailed roadmap when you start working together.This will indicate what areas of SEO it will be focusing on, typically for the next three to six months.A good roadmap will prioritize resolving any technical issues first and then devote time to the other elements afterward. The reason for this is that if a website has a significant technical issue, no amount of content will be able to change that.Kick-off calls and weekly catchupsAfter you have received the SEO campaign roadmap, you will likely be invited to a “kick-off call,” and the agency will run through the SEO roadmap with you. This is your chance to confirm that you are happy with the campaign’s focus and confirm, or set, your key performance indicators (KPIs). Following the kick-off call, you’ll typically have weekly catchup calls with the SEO team. You will often be given access to an SEO performance dashboard and informed when your monthly report is delivered, allowing you to track the campaign’s performance.Monthly SEO reportsProviding SEO reports is a big focus for any agency. It is its way of communicating what happened in your SEO campaign, why it happened, and the next steps. Most agencies will supply at least a monthly report, but other agencies have been known to do weekly or even daily reports. SEO reporting makes the agency accountable and allows your business to show the wins and losses internally to key stakeholders with ease—by sharing the deck.Content creationSEO agencies will create any type of content for your website that you require. The main types of content they will help you with include but are not limited to:Blog post content.Landing page content.Meta descriptions and page titles. Let’s take a close look at these types of content:Blog post content The agency should deliver a content calendar when you start working with it. This will be your plan for the next few months in terms of blog post content.Most agencies will have someone in-house or work with an outsourced content writer to produce your content.The agency will typically recommend how many posts it thinks will be necessary per month—this is largely dependent on your budget.The agency will usually upload and format the content itself if you have given it access to the CMS.Landing page contentWith landing page content, an agency will provide recommendations on what it thinks is the best approach to take.It will write the content, and it will be written in-house or with a trusted outsourced partner.The agency should be able to upload the content itself if it has CMS access.Meta descriptions and page title contentWhen it comes to meta descriptions and page titles, these will most likely be automatically generated using formulas if you have a big website.The agency should be able to upload the content itself if it has CMS access.Technical SEOGood technical SEO skills are arguably the most lucrative skill set you can have in SEO.When you approach an SEO agency, it will showcase its technical SEO credentials and try to diagnose many of your website’s issues by conducting a technical SEO audit. Usually, it will do this by running a crawl of your website.Here are a few specific examples of typical checks it will make:Checking your website is crawlable and indexed in Google and other major search engines. Reviewing your site’s structure; check that it is logical and optimized for search engines.Reviewing your website’s performance such as site speed and Core Web Vitals.Reviewing the internal and external links of your website and share opportunities for improvement.Reviewing your canonicals and redirects to ensure they are implemented properly.Reviewing your sitemap and robots.txt files to ensure that they are implemented correctly.Reviewing your Google Search Console and Google Analytics accounts.Ensuring your images are optimized for search.This is not an exhaustive list, but it gives you an idea of what technical elements the agency will consider. It will pick up this information from running a website crawl on a tool like Ahrefs’ Site Audit.Once your agency has completed the technical SEO audit, you may think everything is complete in terms of technical SEO—but it doesn’t end there.Technical SEO is still required to maintain the site and ensure there are no significant problems with the website from a technical standpoint.Believe it or not, it is common for businesses of all sizes to make substantial technical site errors without even being aware of them.Benefits of SEO agenciesWe have run through what an SEO agency does, but what are the benefits of hiring an SEO agency?Here are a few:Fully managed SEO – Allows you to focus on your business.Access to experienced SEO specialists – You can leverage them for your business.Access to enterprise SEO tools – Gives you better insights into your website’s SEO.Achieve your business objectives – Helps your business realize its goals by creating a personalized strategy.Collaboration with your internal teams – SEOs are used to working with other channels, such as PR, PPC, and affiliates, so they can work with your internal teams if required.Learn from them – The SEO agency will be more than willing to share its knowledge with you. You can use this as a stepping stone to build your own SEO team further down the line.The bottom line is that an SEO agency is a good fit for a company that wants a hands-off approach to dealing with SEO. Hiring an SEO team can be a long process, and attracting SEO talent can be challenging. Working with an agency, though, can let you side-step these issues.Tips for choosing an SEO agencyNow you know what an SEO agency does and what the benefits are, here are a few tips on what to ask and be aware of.Be aware of the “we’re an award-winning” agency lineIf I had a dollar for every award-winning SEO agency I have encountered in my career, I would be a rich man. What I am saying here is that many SEO agencies will say they are award-winning and proudly update their page titles to prove it. The problem is that almost every reputable agency is award-winning, meaning that it is not the distinguishing factor it used to be.A quick Google of this phrase shows that there are a lot of agencies out there that describe themselves in this way.Be aware of the “we’re a Google Partner” lineIn a similar way that the award-winning agency has become a bit of a cliche, there are also some unscrupulous agencies that will add Google Partner images and badges to their websites.They do this to look more impressive. Here’s an example of someone complaining about this issue on a support thread.Sidenote. A Google Partner is an approved advertising agency or third party that manages Google Ads accounts on behalf of other brands or businesses. Google Partner status is concerned more with PPC and is not an endorsement of an agency’s SEO services.If you are unsure of an agency’s status, always check beforehand to confirm if it is legitimate using this directory.Ask what SEO tools they useThey say you can tell a lot about a person by the company they keep—in SEO, you can say the same about the tools an agency uses. It’s worth asking what SEO tools an agency has. If you choose to work with the agency, these tools will be your data sources.SEO tools can vary in price—so by asking this question, you can get an idea of how much it spends.For example, if it is using an enterprise SEO tool, then it’s probably clear from this that it is serious about SEO, and cash flow isn’t an issue for it.On the other hand, if it is using a tool you know you can use for free, or fairly cheaply, and you get the impression it lacks expertise—this could be a potential red flag.Ask about budgets When it comes to budgets, you will typically need at least a four-figure monthly budget to work with a reputable SEO agency.The reality is that if you have a smaller budget for SEO, then it may be worth working with an SEO consultant instead.The reason for this is that agencies typically prioritize their highest-paying clients—because they mean the most to their business.Ask if they outsource When I started my career over 10 years ago, outsourcing was fairly rare in agency land.But 10 years later, it’s now more common and something that even the big media agencies do to reduce costs.When you think of outsourcing, it generally has negative connotations, but it can also be positive. Outsourcing can work for everyone if an agency has the right processes and training in place. The bottom line here is to ensure that you are happy with the quality of the work.Ask to see the SEO teamAgencies usually get the sales teams to do most of the work in the pitch stages, as that’s their specialty. But as a prospective client, it’s worth remembering that the sales team won’t be the people working on the account with you. Ask to see the SEO team members, and judge whether you think they will be a good fit with your business. A good team should act as an extension of your own business.You don’t have to interrogate each member of the SEO team, asking about their experience. But you’ll probably be able to feel if the team is experienced or not just with a quick chat. Once you have established that it’s a team you want to work with, it’s worth asking how many hours of senior SEO experience you will get on the account. The agency is unlikely to refuse any of your requests early on since they will try their hardest to win you over as a client. This is the best time to ask all your questions, get answers, and learn about the necessary details added to the contract.Get testimonialsSometimes, the best way to understand what an agency is like is to talk to some of its other clients. Ask for testimonials from the agency’s other clients and, if possible, for a phone or video call. You’ll get much more information this way than from a forwarded email saying how great the agency is.Case studiesMost agencies have a bunch of case studies on their websites about how they got a 10X ROI for a client they worked with. It’s a good idea to read these carefully—these are usually the best examples of their work. It will show you what they are capable of.Final thoughtsSEO agencies are there to make your life easier, enabling you to spend more time focusing on your business. They will suit many businesses out there, but not all. If your business can’t support a four-figure monthly retainer fee, then an agency is probably not right for you.Lastly, don’t be afraid to ask lots of questions (and get answers) before you sign on the dotted line.Got more questions? Ping me on Twitter. 🙂 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Chris Haines Chris is an SEO director who has 10 years of experience in SEO, agency side. When not involved in SEO, he enjoys messing around with vintage synthesizers, walks on sandy beaches, and a good cup of tea. Keep Learning Best Rank Trackers: Choosing the Right One for You Rank trackers are tools that automates the process of checking search engine ranking positions for certain keywords over time. WordPress SEO: 20 Tips and Best Practices WordPress makes it easy to use SEO best practices. Improve your site's SEO with the tips in this guide. SEO for Nonprofits & Charities: 13 Tips for More Traffic Make your nonprofit organization more visible in search engines and generate consistent, passive traffic with these 13 SEO tips. How to Sell SEO (With Expert Tips) Learn how to sell your SEO services in six tried and tested steps. 6 Holiday SEO Tips (To Boost Traffic During the Shopping Season) Implement these six holiday SEO tips so you can rank your pages higher for the busiest seasons of the year.",
  "headers": [
    {
      "level": "H1",
      "text": "What Do SEO Agencies Do? (And Tips for Choosing One)"
    },
    {
      "level": "H2",
      "text": "What services do SEO agencies provide?"
    },
    {
      "level": "H3",
      "text": "Keyword research"
    },
    {
      "level": "H3",
      "text": "Link acquisition"
    },
    {
      "level": "H3",
      "text": "SEO reporting"
    },
    {
      "level": "H4",
      "text": "Roadmaps"
    },
    {
      "level": "H4",
      "text": "Kick-off calls and weekly catchups"
    },
    {
      "level": "H4",
      "text": "Monthly SEO reports"
    },
    {
      "level": "H3",
      "text": "Content creation"
    },
    {
      "level": "H4",
      "text": "Blog post content"
    },
    {
      "level": "H4",
      "text": "Landing page content"
    },
    {
      "level": "H4",
      "text": "Meta descriptions and page title content"
    },
    {
      "level": "H3",
      "text": "Technical SEO"
    },
    {
      "level": "H2",
      "text": "Benefits of SEO agencies"
    },
    {
      "level": "H2",
      "text": "Tips for choosing an SEO agency"
    },
    {
      "level": "H3",
      "text": "Be aware of the “we’re an award-winning” agency line"
    },
    {
      "level": "H3",
      "text": "Be aware of the “we’re a Google Partner” line"
    },
    {
      "level": "H3",
      "text": "Ask what SEO tools they use"
    },
    {
      "level": "H3",
      "text": "Ask about budgets"
    },
    {
      "level": "H3",
      "text": "Ask if they outsource"
    },
    {
      "level": "H3",
      "text": "Ask to see the SEO team"
    },
    {
      "level": "H3",
      "text": "Get testimonials"
    },
    {
      "level": "H3",
      "text": "Case studies"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Chris Haines"
}