{
  "url": "https://ahrefs.com/blog/who-links-to-my-site/",
  "slug": "who-links-to-my-site",
  "title": "How to Find Who Links to Your Website (and What to Do Next)",
  "description": "Do you want to know who links to yours or a competitor’s website? Learn how to do that in this straightforward guide.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Do you want to know who links to yours or a competitor’s website? Follow this straightforward guide.Backlinks are crucial if you want to rank in search engines.We studied almost a billion web pages to see how backlinks from unique websites correlate organic traffic.How backlinks correlate with organic trafficGenerally speaking, the more backlinks a page has from unique websites, the better it performs in search engines.Sidenote. This is a correlation study. It doesn’t prove causation. Furthermore, it’s not only the quantity of links that matters but also the quality. In this guide, I’ll show how to find who links to your website, which pages they link to, and what to do next to improve your SEO.New to link building? Check out ourBeginner’s guide to link buildingFinding LinksHere, I’ll cover two ways to find who links to you.If you’re looking to see who links to a website you don’t own, click here to skip to the second method.1. Google Search ConsoleGoogle Search Console offers the best starting point for most people as it’s free.Not signed up? Make a free account.To see who links to your website, go to:Search Console > choose your property > Links > External links > Top linking sitesThis report shows the top 1,000 websites linking to your site plus the number of:Linking pages (how many of their pages link to your website)Target pages (how many of your web pages they’re linking to)NOTE. It’s sorted by linking pages by default, but you can also sort by target pages.Click any website on the list to see the individual web pages to which they link, plus how many times they do so.Click on any of these pages to see the referring pages from which the target website links.There’s also another report in Search Console that shows your top linked pages.Search Console > choose your property > Links > External links > Top linked pages.By default, this report is sorted by Incoming links. That shows you which pages have the most backlinks.Sort by Linking sites to see which pages have the most links from unique websites.That’s much more insightful.Click any web page to see the top linking sites to said page, plus the number of backlinks from each.Click any linking site to see all the linking pages.You can download and save any of these reports. Just hit the download icon.Now let’s talk about the downsides of using Google Search Console data:All reports are limited to the top 1,000 pages. That makes them somewhat pointless if you have more than 1,000 pages on your website, or if you have links from more than 1,000 unique domains.No link context. There’s no way to see the anchor text of a specific link, the surrounding text, or whether or not it’s nofollowed, etc.No quality metrics. When Google says “top linking sites,” they’re not referring to the quality of said websites but simply the number of times they link to you. There’s no way to tell how good or bad any of the linking sites are, or whether they’re helpful or harmful when it comes to SEO.To fill in the gaps, we’ll need to resort to another tool.Sidenote. Bing Webmaster Tools also gives you some information about links to your website. It’s free to sign up. 2. Ahrefs Site ExplorerAhrefs has the world’s largest index of live backlinks.It’s updated with fresh data every 15-30 minutes as our robots tirelessly crawl and recrawl the entire web.Plug any website, subfolder or web page (even if it isn’t your own site) into Ahrefs Site Explorer to see how many backlinks and referring domains (links from unique websites) it has.Site Explorer > enter website, web page or subfolder > select mode > OverviewSidenote. Check out our free backlink checker if you’re not yet an Ahrefs user. Backlink CheckerCheck backlinks to any website or webpage Exact URLPathDomainSubdomains Check backlinksYou can see that Nerdwallet’s guide to budgeting has 1,910 backlinks from 558 referring domains, which brings me to a crucial point:You’re not limited to researching your own web properties with Site Explorer. I have no affiliation with nerdwallet.com, and yet I’m still able to see link data for it.To see every website linking to your chosen target, head over to the Referring Domains report.Site Explorer > Referring DomainsThis report is like the top linking sites report in Google Search Console… but on steroids.Like Search Console, it shows the linking websites and the number of backlinks from each. But it also shows additional SEO metrics like:Domain Rating (DR)Nofollowed vs. “dofollowed” linksEstimated organic traffic to each linking domainFirst seen (i.e., when we first saw each site linking to the target)If you want to see the actual backlinks from each linking website, hit the caret.To see a full list of backlinks from all linking sites, head over to the Backlinks report.Site Explorer > BacklinksFor each backlink in this report, we show the linking page, the surrounding link text, the target URL (i.e., the page to which the backlink points), and a bunch of other useful SEO metrics.By default, the report groups similar backlinks together, so you will only see unique backlinks.However, you can change this so that you see all backlinks or just one link per domain.As with the referring domains report, there are also tons of insightful filters in here.I’ll talk about these a little more in a moment. For now, let’s just say that they’re useful for learning more about specific backlinks and linking websites.What to do nextThe truth is that merely knowing who links to your website isn’t that useful or insightful.It’s a bit like looking at someone’s Facebook friends. You’ll get a list of hundreds or thousands of people, but that’s all. There’s no telling their real friends apart from the “friends” they’ve never met in real life. There’s a lack of context.I’m going to assume that you ended up finding and reading this article because:You heard that links matter for SEO.You wanted to know how many links you already have, and who they’re from.You ultimately want more links to boost your site’s performance in the search engines and get more traffic.If I’m way off, close this tab and go about the rest of your day. No hard feelings.Otherwise, let’s go over a few actionable ways you can use link data to improve your SEO and get more organic traffic.1. Build and nurture relationships with serial linkersPeople who link to your website time and time again are known as serial linkers.These are people with whom you likely already have good relationships. You can see who they are in Google Search Console; just go to the top linking sites report and sort the target pages from high to low.Ignore social networking sites (e.g., linkedin.com, facebook.com), forums (e.g., reddit.com), and other sites from which any links are likely to be the result of user-generated content.The trick here is to maintain and nurture your relationships with the people behind these sites because they’re likely to link to you again in future.But here’s an actionable way to take this idea even further:Find your competitors’ serial linkers, then build relationships with those people too!To do this, go to Ahrefs Site Explorer, paste in a competing domain, and head to the Referring domains report.Site Explorer > enter competing domain > Referring domains > add “dofollow” filter > sort by number of dofollow links to target (high to low)Look for links from sites you recognize or those that appear to be industry blogs.Hit the caret to see the backlinks from each website to investigate further.Found a site that fits the bill? Search for it in the referring domains report for your website and see if that site already links to you. If there are no links from that site, or only one or two, then it might be worth pursuing a relationship with them.ACTION TIPPeople link to people they know and like. Nurture relationships with yours and your competitors’ serial linkers.2. Learn from your most linked contentLink building works best when you have content people actually want to link to.But it’s not like infographics always attract more links than blog posts, or studies, or interactive quizzes, or any other type of content. Different niches tend to favor different content types.The best place to start understanding what works and what doesn’t in your niche is to look for commonalities between your most linked pages.Search Console > select property > Top linked pages > sort by Linking sitesSidenote. The reason for sorting by Linking sites as opposed to Incoming links is that two links from two unique websites are generally thought to be more valuable for SEO than two links from the same domain. If we do this for the Ahrefs blog, it’s clear that studies seem to attract a lot of links.We should run more studies. 😉Now, this is insightful and useful for sure, but wouldn’t it be cool if we could do the same thing for competitors’ websites too?That’s not possible in Google Search Console, but it is in Ahrefs Site Explorer.Site Explorer > enter a competing domain > Best by Links > add “200 ok” filterIf we run that report for nerdwallet.com, we’ll see that calculators and posts with statistics attract the most links.If we run it for a tech blog like 9to5mac.com, we’ll see that leaks and exclusive reports about upcoming Apple products are what attract links.ACTION TIPLearn what kinds of content attracts links in your niche and make more of it.3. Reclaim the value from links you already haveHave you ever clicked a broken link? It looks something like this.Broken pages are not only bad for user experience. They’re also bad for SEO.Backlinks effectively bring power to your website, some of which then flows to the other pages on your site via internal links. Because broken pages technically don’t exist, they have no internal links.Long story short, broken pages can hinder your site’s performance in search engines, so it’s best to fix them.In Google Search Console, the Coverage report alerts you to broken pages.Search Console > Coverage > Errors tab Look for 4XX errors, like the one above. To see which pages are affected, click on the error.Unfortunately, this report in Search Console doesn’t tell you if any of the affected pages have backlinks. To find that out, you have to go to the Top linked pages report and filter for the broken page.Search Console > Links > External > Top linked pages > filter > Target page contains > broken URLHowever, you will only see results from this “hack” when two things are true:The dead page is in the top 1,000 most linked pages on your site.The dead page has at least one backlink.Even then, you have to do this manually for each broken page. #hassleCan’t be bothered with that? Use our free broken link checker or the Best by Links report in Ahrefs Site Explorer.Site Explorer > enter domain or subfolder > Best by Links > add a “404 not found” filterThis report shows the dead pages on your site with the most links.Hit the caret and go to the Backlinks report to see every broken backlink to a page.There are three main ways to fix such issues:Reinstate the dead page.Redirect the dead page to a relevant working page.Ask linkers to link to a working page instead.You can also leave the page as a soft 404, assuming it has no valuable backlinks.Recommended reading: How to Find and Fix Broken Links (to Reclaim Valuable “Link Juice”)ACTION TIPFind and fix broken pages on your site with backlinks.4. Replicate competitors’ linksNo two websites or web pages have identical link profiles.You have some backlinks that your competitors don’t have, but more importantly, your competitors have some that you don’t have. In other words, if you want more backlinks, start by replicating your competitors’ links.Links occur for many reasons, and there’s some nuance to this process.So for now, let’s keep things simple and discuss two easy ways to nab competitors links, starting with ‘fixing’ their broken links.The process here is simple: Do the same thing as discussed in tactic #3, but this time for a competing website.Site Explorer > enter a competing domain > Best by Links > add “404 not found” filterIf we do this for a competitor to the Ahrefs blog, Backlinko, it looks like the first web page on the list used to be a page about preventing Google penalties, but it no longer exists.We’re fortunate enough to have a working guide already about that very topic. #lucky So we could reach out to those twenty-nine websites linking to Backlinko’s broken guide and suggest that they swap out the dead link in favor of our working one.If we didn’t already have a similar piece of content to do this with, we could always create one.Recommended reading: A Simple (But Complete) Guide to Broken Link BuildingThe second method for replicating competitors links is even simpler:Search the Backlinks report in Site Explorer for competitors’ guest posts.Site Explorer > enter competing domain > add “dofollow” filter > search for “/author/” in referring page URLsLook for backlinks where the referring URL is something like /author/blogger-name/, as those are usually author profiles.Reach out and pitch a guest post to these sites. It’s likely that they’ll say yes, as you already know two things are true:They accept guest postsThey’ve already accepted at least one post from a business like yoursRecommended reading: 7 Actionable Ways to Loot Your Competitors’ BacklinksACTION TIPFind competitors’ guest posts, and write for those same sites. Find competitors’ broken pages with backlinks, then claim those links for yourself.5. Show your content to “likely linkers”Look at the backlinks pointing to any web page, and you’ll often begin to see similarities.For example, let’s check the backlinks to our keyword research guide.Site Explorer > enter URL > BacklinksSidenote. Make sure you’re using the URL mode in Site Explorer. It only takes thirty-seconds-or-so browsing this unfiltered report to notice that we’re getting a fair few links from content marketing guides. If we search for backlinks where the phrase “content marketing” appears in the URL of the referring (linking) page, there are fourteen results.Now here’s the critical point:There are lots of other content marketing guides out there—ones from which we don’t yet have links. How many? Let’s take a look in Content Explorer.Content Explorer lets you search a database of over a billion web pages for those that mention any keyword or phrase.Let’s search for English web pages with “content marketing” in the title.There are over 52,000 results!Now let’s narrow this down to pages that also mention the phrase “keyword research” anywhere in the content. We’ll also add a filter to see only one article per domain.1,028 results.If we were to reach out to the authors of these pages and show them our content, it’s probable that they’d be at least be interested in checking it out. Some would likely even link to it.Just make sure to craft a good outreach email if you want your efforts to pay off.ACTION TIPFind commonalities in the links you already have, find similar prospects (i.e., “likely linkers”), then show them your content too.Bonus tipBacklinks correlate positively with rankings and organic traffic.However, if you’re going after a competitive topic, you may need hundreds or thousands of backlinks from unique websites to stand a chance at ranking.Take the topic of “best credit cards” for example.Nobody is likely to crack the top five without links from at least 100-200 unique websites.Sidenote. Both quantity and quality matter, so it’s not only about the sheer number of referring domains you have. There are other factors at play too. For that reason, it may make more sense to go after less competitive topics and keywords. In other words, those where you stand a chance at ranking without having hundreds of backlinks.There are a few ways to find such topics.You can search for keywords in Keywords Explorer, and then filter for keywords with a low Keyword Difficulty score.Keywords Explorer > enter seed keyword > choose a report > filter for KD < 10This isn’t foolproof. But it’s a good starting point.WHY KEYWORD DIFFICULTY?Keyword Difficulty (KD) a metric that estimates the “difficulty” of ranking for a keyword on a 100-point scale, and it’s derived solely from looking at the number of backlinks to the current top-ranking pages.For example, if the current top ranking pages for a keyword look like this:Page #1: 365 backlinks from unique websites (referring domains) Page #2: 213 backlinks from unique websites (referring domains) Page #3: 199 backlinks from unique websites (referring domains) …Then the Keyword Difficulty score for that keyword is going to be higher than if the top ranking pages looked like this:Page #1: 21 backlinks from unique websites (referring domains) Page #2: 13 backlinks from unique websites (referring domains) Page #3: 2 backlinks from unique websites (referring domains) …So, to clarify, we’re looking for keywords with a low KD score here because we’ll likely need fewer backlinks in other to rank for them.You can also search in Content Explorer for a keyword or phrase related to your site’s topic, then filter for pages with organic traffic, but few referring domains.Content Explorer > enter query > filter for fewer than 5 RDs > filter for more than 500 organic visits per monthSidenote. Those numbers are somewhat arbitrary. Feel free to adjust as necessary.The results are pages that get a good amount of organic traffic while having few links.In other words: uncompetitive topics.Hit the Details caret and navigate to the Organic keywords tab to see the keywords for which each page ranks.ACTION TIPFind and target uncompetitive topics and keywords instead of highly-competitive terms.Final ThoughtsFinding who links to your website is a useful starting point, but merely knowing this won’t improve SEO. The crucial part is understanding how you compare to your competitors and more importantly, learning from those that are winning at SEO.That’s the easiest route to better rankings for most websites.Did I miss anything from this post? Let me know in the comments, or hit me up on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Keep Learning 4 Reasons to Build More Links From the Same Website It's completely natural to have multiple links from the same website. But should you focus on getting more links from the same domain? Find out here. Google’s “Disavow Links Tool”: The Complete Guide Do you still need to disavow links in 2018? If so, what kinds of links should you be disavowing? Here’s everything you need to know. Nofollow vs. Follow Links: Everything You Need to Know Nofollowed vs. followed links. What's the difference? How do they affect SEO? Learn everything you need to know in this complete guide. 6 Linkable Asset Types (And EXACTLY How to Earn Links With Them) Linkable assets are awesome pieces of content that can be leveraged for links. But did you know that most successful linkable assets tend to be similar \"types\" of content? In this post, I'll explore six linkable asset types, and explain how you can easily earn links with them. How to Earn More Links: Adding Context to Content Analysis Do you want to create content that earns links? Then you need to glean insights from great content instead of great websites. Learn how in this post.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Find Who Links to Your Website (and What to Do Next)"
    },
    {
      "level": "H2",
      "text": "Finding Links"
    },
    {
      "level": "H3",
      "text": "1. Google Search Console"
    },
    {
      "level": "H3",
      "text": "2. Ahrefs Site Explorer"
    },
    {
      "level": "H2",
      "text": "What to do next"
    },
    {
      "level": "H3",
      "text": "1. Build and nurture relationships with serial linkers"
    },
    {
      "level": "H3",
      "text": "2. Learn from your most linked content"
    },
    {
      "level": "H3",
      "text": "3. Reclaim the value from links you already have"
    },
    {
      "level": "H3",
      "text": "4. Replicate competitors’ links"
    },
    {
      "level": "H3",
      "text": "5. Show your content to “likely linkers”"
    },
    {
      "level": "H3",
      "text": "Bonus tip"
    },
    {
      "level": "H2",
      "text": "Final Thoughts"
    }
  ],
  "author": "Joshua Hardwick"
}