{
  "url": "https://ahrefs.com/blog/wirecutter-seo-case-study/",
  "slug": "wirecutter-seo-case-study",
  "title": "Wirecutter SEO Case Study: 5 Ways to Win at Affiliate Marketing",
  "description": "Wirecutter is likely a website that affiliate marketers look up to and are inspired by. Here's what you can learn from it.",
  "content": "Michal Pecánek SaaS SEO consultant with over 6 years of experience. Before going freelance, Michal was an SEO & Marketing Educator at Ahrefs–creating content for the blog and managing a team of guest writers. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Wirecutter has to be on every short list of websites that affiliate marketers look up to and try to draw inspiration from. Its impact on product choices from its in-depth reviews is so high that there’s even a term called “Wirecutter effect,” describing recommended products selling out quickly once the review goes live.As of May 2022, the website drives almost 12 million organic search clicks in a month (spread across roughly 3,000 pages):Screenshot from Overview report in Ahrefs’ Site Explorer.The website is now part of The New York Times, which acquired Wirecutter in 2016 for about $30 million. The investment most likely paid for itself within three years, as the Times made more than $20 million from Wirecutter in 2018 alone.Wirecutter is simply a huge affiliate marketing success story that we can all learn from. We’ll go through the following five tips based on Wirecutter’s SEO efforts that you can apply regardless of your affiliate website’s size:Send great E-A-T signals throughout websiteProvide great user experienceLeverage your category pagesKeep your content up to dateHave a solid content distribution planLet’s dive in.Looking for more case studies?Head over to our list of SEO case studies.1. Send great E-A-T signals throughout the whole websiteE-A-T stands for expertise, authoritativeness, and trustworthiness. It comes from Google’s Search Quality Rater Guidelines, a 172-page document used by human quality raters to assess the quality of Google’s search results.Google’s objective is to provide the most relevant and accurate results for every search query. If you’re looking up cat memes, then it doesn’t really matter which pages show up at the top. But it’s a completely different story when you shift to serious topics like finance or health.This is where E-A-T signals come into play. It has the most impact on these YMYL (Your Money or Your Life) topics. And showing the world that you’re an authoritative and trustworthy expert source on a certain topic never hurts.Now the importance of E-A-T for affiliate websites will differ. It likely won’t be that important for, let’s say, travel websites. But Wirecutter covers a wide range of topics, including some that fall straight into the YMYL topics:So why did I bring up these E-A-T signals as the first point? Well, this is where I think Wirecutter stands out the most.Let’s take a look at its review of the best electric toothbrushes. An input from dentists and relevant researchers is certainly useful here. That’s why even though the article was written by Wirecutter staff members, they made sure to get that input anyway:The whole article is structured in a way that makes readers confident that they’re reading a highly authoritative review:Their claims aside, I still decided to put the quality of information to the ultimate test, as my partner is a dentist. Her verdict? She scored this article and the research behind it 9/10, so that’s as good as it gets for a non-professional website in my book.All of Wirecutter’s reviews are similar to this from the E-A-T perspective. This thorough coverage of one topic also allows it to rank for thousands of keywords with just one article:Screenshot from Organic keywords report in Ahrefs’ Site Explorer.But it’s not only about the content. Links and mentions from highly relevant and authoritative sources are also important:I asked Gary about E-A-T. He said it’s largely based on links and mentions on authoritative sites. i.e. if the Washington post mentions you, that’s good.He recommended reading the sections in the QRG on E-A-T as it outlines things well.@methode #Pubcon— Marie Haynes (@Marie_Haynes) February 21, 2018 I took a look at Wirecutter’s backlink profile filtered to medical websites. And as you can see, even some expert sources refer to it:Screenshot from Referring domains report in Ahrefs’ Site Explorer.Speaking of links, I also found that Wirecutter’s About page has one of the most prominent link placements across all of its pages:That’s right. Wirecutter creatively used the necessary monetization disclaimer on every page to link to its About page. This disclaimer, in addition to labeling sponsored links with the “sponsored” or “nofollow” attributes, is an obvious trustworthiness factor that every affiliate website needs to adhere to.Google recommends to label sponsored or affiliate links with the rel=“sponsored” attribute. The historically used “nofollow” attribute is also fine. Screenshot taken from Linked Domains report in Ahrefs’ Site Explorer.The About page itself is one of the best of its kind I’ve ever seen. The content and referenced articles tell both readers and search engines that Wirecutter is serious about establishing high E-A-T:We could go on and on with all the different E-A-T signals, but the ones we just went through seem most important and interesting to expand on.Is Google smart enough to take all of these signals into account when ranking pages from a particular domain? Maybe. It at least seems to be going in that direction. And does that help build trust with Wirecutter’s readers? Absolutely.Learn more: What Is E-A-T? Why It’s Important for SEO2. Provide great user experienceBesides getting commissions, most affiliate websites are also part of ad networks trying to build their email databases or sell their products. But if you combine all that together, you’re in for some bad user experience (UX):Example of monetization that leads to bad UX.Wirecutter is the opposite. Its content is pleasant to read and has great images, GIFs, and videos. Most importantly, the content doesn’t contain any interrupting elements.High-quality contextual photos with good captions in a gallery within Wirecutter’s rain jackets review.Its product recommendation boxes with affiliate links also look quite nice. Each box even has a “product saving” feature:I get it. Maximizing your monetization options is enticing and often makes sense from the business perspective. But I’m convinced that many websites are better off in the long term if they optimize and moderate these elements.Think about it this way:Better UX may make your website more popular and its pages rank better. More engaged visitors obviously lead to more commissions from affiliate links. People may also prefer to more often link to good-looking and easy-to-navigate websites.All of these factors combined will likely be worth more than what you’d make from the other monetization options.Google already uses mobile-friendliness and Core Web Vitals in its ranking algorithm. It would make perfect sense if it evaluated many other UX factors as well.3. Leverage your category pagesLet’s check the statistics of another review page:We can see that all Wirecutter reviews are placed within the /reviews subfolder. But all of its reviews are properly interlinked and categorized in the site navigation and breadcrumbs:This one is placed within the Headphones category that’s a part of its Electronics category. And as you can probably guess, these category pages also drive a solid amount of traffic:Screenshot from Site structure report in Ahrefs’ Site Explorer.Those category pages only have a bit of intro text and then it’s just a list of reviews:This is one of the best things you can do for proper internal linking, as each page has its place within a given hierarchy. Then there’s the nice bonus of the traffic potential. Similarly, you can also create content hubs (also known as topic clusters) to cover high-level topics that can drive tons of traffic.4. Keep your content up to dateNo matter which affiliate niche you’re in, the business landscape, product development, and prices are constantly evolving. And you should reflect that in your content as well because some product recommendations can get outdated quite fast.The ratio of updated vs. newly published Wirecutter reviews is almost 5:1 in the past 12 months:Screenshot from Ahrefs’ Content Explorer.This didn’t surprise me. The more you cover a certain niche, the more often you’ll come back to republish older content.Wirecutter is already a big authority across many niches, so keeping those pieces up to date can bring quicker and more valuable results as compared to creating new ones. It also doesn’t require as much effort.I dived deeper into the data and looked at year-over-year (YoY) organic traffic differences of Wirecutter reviews that were first published before May 9, 2021, and updated within a year from this date.Here’s what I found:YoY comparison of estimated monthly organic traffic on May 9, 2021, vs. May 9, 2022.That’s almost 2.8 million more traffic YoY for updated reviews alone. Of course, some of those reviews might have ranked better or retained traffic even without updates, and some could have started ranking worse than before. But overall, the benefit of republishing is clear.Updating older content is apparently so important for Wirecutter that it’s even hiring writers whose main purpose is to keep articles within their niche up to date:Taken from Wirecutter’s job post.Last but not least, I really like how Wirecutter even keeps the prices up to date and tells you how they’ve changed since the review was first published:Learn more: Republishing Content: How to Update Old Blog Posts for SEO5. Have a solid content distribution planPublishing great content can only get you so far. Even if your main traffic source is organic search, you need a solid content distribution plan to get every piece of new content in front of as many people as you can.This isn’t just about sharing the link to the new content on social media. Everyone does that, and organic reach on many platforms declines over time. Even Wirecutter doesn’t get any impressive engagement numbers from this.What I think Wirecutter does really well is its email marketing. Through that, the site shares all the new content and references relevant pieces that are older:What you can do on top of building and leveraging your newsletter is repurposing your content into formats that do better on a given platform.Examples of such content formats are threads on Twitter or short videos that are pretty much everywhere. Here’s how Wirecutter repurposed its article about replacing household essentials into a TikTok video (that can be reshared on other platforms as well).@wirecutter Here are some household essentials you should regularly replace. #cleaning #kitchen #lifehack #learnontiktok #water #germs #science #fypシ #zyxcba ♬ Lo-Fi Vibes - WachilowWhat does this have to do with SEO, you ask? The more eyes land on your content, the higher the chances you’ll naturally earn a backlink—or get any other earned media that may have an indirect impact on your SEO performance.And there’s another, albeit more speculative, benefit. Many SEOs have found there’s a high correlation between the buzz generated by new content and its traffic from Google Discover.I can imagine that Wirecutter gets a ton of traffic from Discover and has the best resources to try and optimize for that, given that it’s under the Times.Final thoughtsWirecutter also had to start somewhere. Founder Brian Lam already had great experience in publishing successful content, so his growth strategy was on point. But the thing is you wouldn’t have known that you were looking at a future affiliate marketing “unicorn” back then:Screenshot taken from the Internet Archive.It doesn’t matter if you’re just starting out or you already have a well-functioning affiliate marketing business. Applying the five tips we’ve just gone through will help you get ahead in your SEO efforts.If you want to learn more about affiliate marketing, we have a whole category of articles dedicated to this topic.Got any questions? Ping me on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Michal Pecánek SaaS SEO consultant with over 6 years of experience. Before going freelance, Michal was an SEO & Marketing Educator at Ahrefs–creating content for the blog and managing a team of guest writers. Keep Learning Wise.com SEO Case Study: 5 Reasons Why Their SEO Rocks Learn the secrets of Wise's (formerly Transferwise) successful SEO strategy that led to an estimated 6.4 million monthly organic visits. 6 Things I Love About Zapier’s SEO Strategy: A Case Study I bet not everybody would pursue SEO in Zapier's situation. But SEO seems to be working like a charm here. How RTINGS.com Dominates Product Niches (SEO Case Study) RTINGS.com has created a strong moat in a few product niches over the years. Learn how it grew its monthly organic traffic to over 9 million. An Aggregator With Integrator Strategy – Carwow SEO Case Study A look at how carwow's SEO, its strategy, the opportunities it grabbed, etc., have helped it grow its organic traffic and business. Examine SEO Case Study: 7 Lessons to 1 Million Monthly Visits Examine boasts a large number of visitors to its site every month. The kicker? It did so without having a focus on SEO. Learn its story.",
  "headers": [
    {
      "level": "H1",
      "text": "Wirecutter SEO Case Study: 5 Ways to Win at Affiliate Marketing"
    },
    {
      "level": "H2",
      "text": "1. Send great E-A-T signals throughout the whole website"
    },
    {
      "level": "H2",
      "text": "2. Provide great user experience"
    },
    {
      "level": "H2",
      "text": "3. Leverage your category pages"
    },
    {
      "level": "H2",
      "text": "4. Keep your content up to date"
    },
    {
      "level": "H2",
      "text": "5. Have a solid content distribution plan"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Michal Pecánek"
}