{
  "url": "https://ahrefs.com/blog/wise-seo-case-study/",
  "slug": "wise-seo-case-study",
  "title": "Wise.com SEO Case Study: 5 Reasons Why Their SEO Rocks",
  "description": "Learn the secrets of Wise's (formerly Transferwise) successful SEO strategy that led to an estimated 6.4 million monthly organic visits.",
  "content": "Michal Pecánek SaaS SEO consultant with over 6 years of experience. Before going freelance, Michal was an SEO & Marketing Educator at Ahrefs–creating content for the blog and managing a team of guest writers. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Few mainstream brands are as fascinating SEO-wise as Wise.Formerly known as TransferWise, this fintech company offering multi-currency accounts and quick international money transfers with fair fees currently gets an estimated 6.4 million organic visits per month:That’s especially impressive considering they moved domains in early 2021—a migration so well-executed that it made waves in the SEO community. Add to this that they have a custom CMS to scale their SEO efforts, and you have a brand whose SEO strategy deserves investigation.In this one-of-a-kind case study, we’ll explore five reasons why Wise’s SEO strategy rocks:Landing page templates that can be scaled upA custom CMS built around their SEO needsContent optimized for featured snippetsMultiple ways of attracting and acquiring linksFlawlessly migrating millions of pages with a lot of riskLooking for more case studies?Head over to our list of SEO case studies.1. Landing page templates that can be scaled upConducting keyword research is usually the easier part of creating a content strategy, so it’s no surprise that Wise reflects what their (potential) customers search for with the content they produce.The challenge comes when your keyword research tells you to make tens of thousands of landing pages. How do you create and optimize so much content to rank high in Google?Wise tries to be present in the search results throughout the whole customer journey, and there’s a lot of content to cover—especially at the top of the funnel.For example, they have nearly 12,000 landing pages about swift code combinations targeting US visitors alone:And it’s not just the swift codes subfolder that has so many landing pages. There are other subfolders with thousands of pages about things like currency converters and routing numbers:These rather top-of-the-funnel pages contribute to a vast majority of their organic traffic across multiple countries and languages. Here’s an example from their German traffic:The trick to creating so many optimized landing pages like this is to use templates—and this is what Wise did. They realized that people searching for specific SWIFT/BIC codes or routing numbers wanted very similar information. The main variable was just the code itself.From a content perspective, all they needed was one perfectly crafted landing page for a specific bank. From there, they could use the template over and over for different banks.Creating such a perfectly crafted landing page requires great copy, design, UX, and alignment with the search intent—providing all the information the visitor might need. An example of what searchers are looking for can be found in their FAQ sections (which also maximize SEO opportunities via FAQ rich snippets):All in all, Wise nailed scaling up their content creation with a focus on SEO. Their organic traffic grows with the number of indexed pages:2. A custom CMS built around their SEO needsScaling up content creation to such a degree requires developer resources. You can’t successfully produce so much content in multiple languages using your standard CMS options.In this presentation, Fabrizio Ballarini, the person in charge of Wise’s organic growth, outlines some of the most crucial SEO features of their custom CMS, Lienzo:Using templates and boilerplates to create thousands of new landing pages quicklyManaging proper internal linkingGenerating and updating meta tags and structured data at scaleHandling hreflang attributes and canonical tags generation and updatesCloning, updating, or deleting existing pages at scaleTesting changes in a local environment before pushing them to productionBuilt-in platform monitoring to detect and fix issues ASAPBuilt-in split testing capabilities for SEO experimentsSeamless integration with databases and APIsAssigning user roles, so team members have access to all the tools they needThat might be a lot to ingest, so here’s an example from its UI:While it may seem risky to push so much content from the technical point of view, Wise managed to pick up more and more interest from Googlebot over time:The more content you feed to Google bot the more it gets addicted to crawling, indexing and serving your site. Especially for brand new sites it’s so important to keep up feeding good quality pages. My favourite KPI on early stage projects is indexed pages/month pic.twitter.com/s9gZDk0OW1 — Fabrizio Ballarini - Hiring wise.jobs (@Pechnet) May 17, 2020Getting Google on their side here might have been a bit challenging. First, every single page had to be unique, valuable, and align with the search intent. Then they had to update internal links and sitemaps to ensure good crawlability and timely indexing.Lienzo seemingly does all of this much better than any out-of-the-box CMS.3. Content optimized for featured snippetsOne thing that amazed me about Wise’s SEO performance is how many featured snippets they own. But it wasn’t clear whether this is because they do a much better job than their competitors or whether it’s just the nature of finance SERPs.So, I looked at their competing domains: The Competing Domains report in Ahrefs’ Site Explorer shows websites that rank in the top 10 for the same keywords as the website you’re investigating. Then I chose a few of them with generally high organic traffic and lots of overlapping keywords. I wanted to know how many “featured snippet triggering” keywords they rank for in the top 10 and how many of those they own.Here’s how I did this in Ahrefs’ Site Explorer for each website that I wanted to investigate:Entered the domainNavigated to the Organic Keywords 2.0 reportFiltered for keywords in positions 1-10Filtered for keywords that trigger featured snippets, wrote down the number of resultsFiltered for keywords that trigger featured snippets the domain owns, wrote down the number of results (this step is pictured below)And here are the results. Wise dominates in both absolute and relative numbers:It’s clear that Wise does featured snippet optimization really well, and it drives them quite a lot of traffic. I’m rather surprised that their organic competitors don’t do a better job with such straightforward opportunities like this one, for example:You might be wondering how you can make a table stand out. It must be a lottery which table Google chooses for the featured snippet, right? Well, here’s what the table looks like on Chase’s website:They placed it within a collapsible block that’s collapsed by default. It’s not the main content on the page. Plus, the table could have better column names, and it wouldn’t hurt mentioning that those are indeed Chase routing numbers somewhere in the context of the table.Wise does all of this better, annotates the table with a clear title, and interlinks each row with its respective landing page:I’m not saying such optimization would ensure getting a featured snippet, but Wise deserves it here.Recommended reading: How to Optimize for Google’s Featured Snippets4. Multiple ways of attracting and acquiring linksEven the best on-page and technical SEO setup, processes, and execution doesn’t ensure success in the SERPs if your content lacks a solid backlink profile. Link building is the part of SEO that you can control the least, so it’s always a good idea to employ multiple link-building approaches and tactics. Wise also does an excellent job at this.Product-led companies naturally attract linksYour best link-building asset is arguably something you don’t influence much as an SEO: a truly valuable and popular product. This often comes with a strong brand. I, myself, am a satisfied Wise customer, and I knew about them long before I converted.Having the best product in the industry allows you to naturally build a strong backlink profile without actively building links via outreach. In fact, Wise didn’t have an SEO team until 2015 and they’ve managed to score great links with just some PR activities and advertising.Reaching a Domain Rating (DR) of 75 with no SEO in the team is really impressive:Use of creative PR campaignsWhen researching how Wise grew into the company it is today, I encountered many examples of them using great PR campaigns to get great coverage and links.Wise PR campaigns range from advocating what they stand for in a fairly standard way:To pure PR stunts that also strengthen their positioning:https://www.youtube.com/watch?v=ZufqOLl6ajEhttps://www.youtube.com/watch?v=mKOAZkuP6_EThese PR stunts got them some excellent links early on:It’s clear that PR and advertising helped them build a strong brand and link profile before they started taking SEO seriously:Referral & affiliate programs as main acquisition channelsWise’s incentivizes their users to invite friends with a monetary bonus, and this became one of their main acquisition channels early on:Wise also has an affiliate program that incentivizes website owners to earn commissions by sharing their affiliate links with their audience.Sure, the SEO value of referral or affiliate links is questionable at best. Wise currently has close to 9,000 affiliate-related backlinks with no link attributes, which should technically pass PageRank:If we (Ahrefs) can easily identify such links, I’m sure Google can too. They likely devalue or completely disqualify these links in terms of PageRank.But the point here is different. A by-product of people sharing referral and affiliate links is more standard links and coverage. The bigger your referral and affiliate programs are, the more you reap the benefits. There’s a snowball effect to it.5. Flawlessly migrating millions of pages with a lot of riskMigrating a large website to a new domain is a daunting task on its own. Add to that a vast customer base that relies on your service 24/7 to handle their money, and you’ve got a challenge that would stress out any SEO.Wise currently has over four million indexed URLs in Google, and the number will still be likely going up as they migrated from transferwise.com not so long ago (March 2021):They managed to successfully transfer their organic traffic without any noticeable losses to their new domain within four months of the migration. If you’re new to website migrations, this is an excellent result because many migrations end up losing a solid chunk of organic traffic.Here’s the organic traffic graph for transferwise.com:And here’s how that translated to wise.com:Sidenote. I’d attribute the latest traffic drop that you can see above to the June and July 2021 core algorithm updates. I doubt it’s anything related to the domain migration. Migrating millions of pages, keeping your service up during the process, and not losing traffic because of it is simply a success. But even if you get everything right, you can still encounter issues that are hard to explain and fix: 2 months since the @Wise domain migration, Google decided to index and rank a URL that is: 1) canonicalised 2) parameterised, 3) 301 redirects to the new domain and 4) meant for another market (en-US when we have en-GB available)🤯 Any ideas what could be wrong @JohnMu? 🙏 pic.twitter.com/uIOWuwNN4d— Lucia Lecesne (@LumiSionnain) May 4, 2021Fabrizio provided further insights about their migration preparation in this Twitter thread: As some might have noticed we didn’t redirect the entire domain on day 1 but we put https://t.co/sWmD3ONZzx live next to https://t.co/jZmGpMuK2eDuring the last week or so we then performed a bunch of tests to protect our existing customers moving to https://t.co/sWmD3ONZzx https://t.co/9Oto7KmQHC pic.twitter.com/INSrjufD44— Fabrizio Ballarini - Hiring wise.jobs (@Pechnet) March 2, 2021Two bits of advice stood out to me:Properly inform your users and audience about an upcoming domain migration. This was especially important for Wise due to the nature of their business. Suddenly landing on a new blog domain is not comparable to logging into your money account on a different domain without knowing about that in advance.Test your redirects on a smaller part of your domain and monitor server logs to understand how crawlers behave. This is definitely good practice before you 301 (redirect) the whole thing.Final thoughtsWise stands out in terms of how invested they are in SEO across teams. This highlights the importance of soft skills in SEO. You need to properly communicate the value of SEO and your needs with others in the organization to succeed.I encountered a few more aspects I could have discussed here, but the five above were the most interesting and inspiring for me. If you have any questions, ideas, or maybe even requests to analyze the SEO of other companies, feel free to ping me on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Michal Pecánek SaaS SEO consultant with over 6 years of experience. Before going freelance, Michal was an SEO & Marketing Educator at Ahrefs–creating content for the blog and managing a team of guest writers. Keep Learning Wirecutter SEO Case Study: 5 Ways to Win at Affiliate Marketing Wirecutter is likely a website that affiliate marketers look up to and are inspired by. Here's what you can learn from it. 6 Things I Love About Zapier’s SEO Strategy: A Case Study I bet not everybody would pursue SEO in Zapier's situation. But SEO seems to be working like a charm here. How RTINGS.com Dominates Product Niches (SEO Case Study) RTINGS.com has created a strong moat in a few product niches over the years. Learn how it grew its monthly organic traffic to over 9 million. An Aggregator With Integrator Strategy – Carwow SEO Case Study A look at how carwow's SEO, its strategy, the opportunities it grabbed, etc., have helped it grow its organic traffic and business. Examine SEO Case Study: 7 Lessons to 1 Million Monthly Visits Examine boasts a large number of visitors to its site every month. The kicker? It did so without having a focus on SEO. Learn its story.",
  "headers": [
    {
      "level": "H1",
      "text": "Wise.com SEO Case Study: 5 Reasons Why Their SEO Rocks"
    },
    {
      "level": "H2",
      "text": "1. Landing page templates that can be scaled up"
    },
    {
      "level": "H2",
      "text": "2. A custom CMS built around their SEO needs"
    },
    {
      "level": "H2",
      "text": "3. Content optimized for featured snippets"
    },
    {
      "level": "H2",
      "text": "4. Multiple ways of attracting and acquiring links"
    },
    {
      "level": "H3",
      "text": "Product-led companies naturally attract links"
    },
    {
      "level": "H3",
      "text": "Use of creative PR campaigns"
    },
    {
      "level": "H3",
      "text": "Referral & affiliate programs as main acquisition channels"
    },
    {
      "level": "H2",
      "text": "5. Flawlessly migrating millions of pages with a lot of risk"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Michal Pecánek"
}