{
  "url": "https://ahrefs.com/blog/women-and-nonbinary-folks-in-seo/",
  "slug": "women-and-nonbinary-folks-in-seo",
  "title": "26 Women and Nonbinary SEO Pros Who Inspire Me",
  "description": "Here are the amazing women and nonbinary folks in our industry who I have learned from and who continuously inspire me in my career.",
  "content": "Despina Gavoyannis Despina is a Senior SEO Consultant with 8+ years of experience growing B2B, e-commerce, SaaS, and national brands. She's an optimist at heart, taking time to enjoy life's silver linings each day. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents In the lead-up to International Women’s Day, I started reflecting on all the amazing women and nonbinary folks in our industry who I have learned from and who continuously inspire me in my career.Here are the top 26 whose expertise, results, and insights I greatly admire and think you will, too.Make sure you check them all out. Anyone who has seen me eat a delicious meal knows I save the best til last, and this list is no different.ContentsBut let’s also be real for a moment…I’m totally aware that many of the people who’ve inspired me are the big names you see on a lot of these sorts of lists. That’s just the nature of life.And there are obviously loads of super smart, but lesser known, women and nonbinary folks in SEO who deserve attention too… so I also asked my friends and colleagues for shoutouts on who inspires them and rounded their suggestions up in an epic MEGA list of 99+ inspiring SEO experts we think you should follow.Check it out on X →Talent transcends borders, and so does this list. Like it, share it, repost it, but above all, follow and support all the experts you see here.1. Aleyda SolísSEO Consultant @ OraintiWhat she’s known for: Technical SEO, international SEOWhere to follow her: Twitter, LinkedInMy fave takeaways: Everything. Literally everything. But if I had to pick one, it would be Aleyda’s free SEO roadmap on learningseo.io. If by some miracle you aren’t already familiar with Aleyda’s work, she freely and frequently shares a ton of knowledge bombs on all things technical SEO, enterprise-level skills and general tips for SEO professionals.2. Dr. Marie HaynesOwner @ Marie Haynes ConsultingWhat she’s known for: Google penalty recovery, how Google’s algorithm worksWhere to follow her: Twitter, LinkedInMy fave takeaways: Marie’s Google algorithm update list is so good, I check it out every time (yes, every. single. time.) I run a traffic loss audit or want additional context on the latest updates. I also love her insights on penalty recoveries and understanding Google’s Quality Rater Guidelines shared in her Search News You Can Use newsletter.3. Vanessa FoxCEO @ Keylime ToolboxWhat she’s known for: Creating Google Webmaster Central, developing search patentsWhere to follow her: Twitter, LinkedInMy fave takeaways: Vanessa is an ex-Googler and has done some seriously cool things in the SEO space that don’t get enough attention, in my opinion. Check out her patents, book, and read her speaker bio for everything else.4. Lily RayVice President of SEO Strategy & Research @ Amsive DigitalWhat she’s known for: E-E-A-T, Google core algorithm insightsWhere to follow her: Twitter, LinkedInMy fave takeaways: Firstly, I love her rockstar vibe (I mean, who doesn’t?). Professionally, Lily’s take on E-E-A-T is very insightful and aligns with what I’ve also seen with my clients. I also love the insights she shares on why Google just may not be into your site and what’s really up when it comes to core algorithm traffic losses.5. Jes ScholzIndependent Marketing ConsultantWhat she’s known for: SEO futurist, entity optimizationWhere to follow her: Twitter, LinkedInMy fave takeaways: If you ever have the chance to see Jes present live, take it. She is an absolute powerhouse, sharing a wealth of knowledge about where Google and the future of search are heading. In particular, I love her tips on owning your brand entity and optimizing it so it’s Google-friendly.6. Kristin TynskiCo-Founder @ FractlWhat she’s known for: Digital PR, SEO automation with GPT4Where to follow her: LinkedInMy fave takeaways: Kristin delivers so much value through her free scripts that automate many aspects of SEO. I recommend starting with this list of 20+ scripts. But you should also check out everything else she shares. You can thank me later.7. Jessica BowmanCEO @ SEO In HouseWhat she’s known for: Enterprise SEO, executive SEOWhere to follow her: Twitter, LinkedInMy fave takeaways: Jessica wrote the book on Executive SEO and I highly recommend it if you’re an in-house SEO or offering enterprise services. My biggest takeaway—that I often reflect on deep into the hours of sleepless nights even years after reading the book—is the concept of becoming an “SEO pacesetter.” If the organizations we work in unified all teams around SEO, imagine the pure potential that would be ripe for the picking. Jessica’s book helps make that potential a reality.8. Ann HandleyChief Content Officer @ MarketingProfsWhat she’s known for: Creating “ridiculously good content,” escaping “marketing mediocrity”Where to follow her: Twitter, LinkedInMy fave takeaways: Can you be a writer or marketer and not be at least a little in love with Ann’s philosophy? As the world’s first Chief Content Officer, we all have a lot to learn from her about creating content that truly stands out online. Ann’s been sharing great insights for years. If you’re new to her work, I recommend starting with her books Everybody Writes and Content Rules.9. Nik RangerSenior Technical Consultant @ Dejan MarketingWhat she’s known for: Technical SEO, SGE ResearchWhere to follow her: Twitter, LinkedInMy fave takeaways: I LOVED Nik’s presentation at the 2023 Singapore SEO Summit. She shared loads of search generative experience (SGE) knowledge bombs, data about how AI may change the SERPs and what that means for brand visibility from search-based channels. If you haven’t taken SGE out for a spin yet, check out Nik’s two-minute SGE guide to get you started (from anywhere in the world).10. Bibi Lauri RavenOwner + Link Builder @ BibiBuzzWhat she’s known for: Link BuildingWhere to follow her: Twitter, LinkedInMy fave takeaways: Not only is Bibi an awesome human sharing good vibes, she’s also a damn good link builder praised for her ability to share actionable, helpful information about all things link building. Check out her entire process here.11. Maria Amelie WhiteGlobal SEO Lead @ Kurt GeigerWhat she’s known for: Global SEO, Enterprise SEOWhere to follow her: Twitter, LinkedInMy fave takeaways: I’m a huge fan of cross-collaboration between SEO and non-SEO teams to achieve meaningful outcomes. So it’s no surprise why Maria’s ability to work cross-functionally in large organizations inspires me to no end. It really is not an easy feat, yet she sure makes it look effortless. There’s also a lot more to learn from her if you aspire to a leadership position in the industry as an in-house SEO like how to make better reports for your c-suite or turning data into impact.12. Kristina AzarenkoFounder @ Marketing SyrupWhat she’s known for: Technical SEO EducatorWhere to follow her: Twitter, LinkedInMy fave takeaways: If you’re looking for quality education on advanced technical SEO skills, Kristina’s content and courses are a great place to start. Prior to my career in SEO, I was an educator and have not been able to ignore the education crisis our industry experiences. There really is a lack of beginner-friendly yet expert education for skills that can be difficult to master. If you’re tired of teaching yourself every little thing about technical SEO (and constantly wondering if you’re doing it right), do yourself a favor and check out Kristina’s courses instead. You’re welcome.13. Jamie IndigoTechnical SEO Consultant @ Not a RobotWhat they’re known for: Technical SEO, JavaScript wranglingWhere to follow them: Twitter, LinkedInMy fave takeaways: If you’re into nerding out over SEO, good storytelling, and you enjoy a decent splash of snark, you’ve got to check out Jamie’s content. From their delightfully fun feature on SEO fairytales to sharing their experience wrangling messy JS or auditing large websites to bite-sized commentary in the Rich Snippets newsletter, Jamie shares a ton of golden nuggets.14. Crystal CarterHead of SEO Communications @ WixWhat she’s known for: SEO Communications, big-brand SEOWhere to follow her: Twitter, LinkedInMy fave takeaways: I love Crystal’s ability to take a technical SEO concept, like structured data, and communicate its strategic value in a way business owners can understand, like in this post. As SEO professionals, we need to do more of this if we want to increase our odds of getting buy-in for SEO initiatives.15. Olga ZarrCEO + SEO Consultant @ SEOSLYWhat she’s known for: Comprehensive technical SEO guides + templatesWhere to follow her: Twitter, LinkedInMy fave takeaways: Olga shares many comprehensive step-by-step technical SEO checklists and templates that really are a one-stop shop. If you’re new to SEO and want the confidence you’re not missing out on any vital steps during audits, or you’d like an expert’s tips on exactly how they use SEO tools in their processes, I recommend checking out Olga’s blog starting with this post on how to audit your site with Ahrefs.16. Chima MmejeSenior Content Marketing Manager @ MozWhat she’s known for: SEO content strategy, SaaS contentWhere to follow her: Twitter, LinkedInMy fave takeaways: Chima’s tips on content strategy that delivers results are a dream. I especially love it when she shares a behind-the-scenes view of her process, like in this post sharing how she tackles content briefing. I’ve learned so much from Chima over the years and am sure you will too.17. Britney MullerBusiness Consultant @ Britney Muller IncWhat she’s known for: AI + LLMs, Data Science for SEOWhere to follow her: Twitter, LinkedInMy fave takeaways: I’ve been following Britney’s work since she was a Senior SEO Scientist at Moz. Recently, her work and interests have focused on education around data science, AI, LLMs, and all these hot topics taking the SEO world by storm. I especially love her ability to explain emerging technology in a beginner-friendly way (like her post explaining Google’s ML model BERT or her website making machine learning accessible for marketers).18. Kayle LarkinHead of Marketing @ ElevarWhat she’s known for: Google Analytics, marketing attribution, data for SEOWhere to follow her: Twitter, LinkedInMy fave takeaways: If GA4 and attribution models do your head in, check out Kayle’s Analytics in Minutes YouTube channel. I also recommend checking out her guides on using GA4, SEO analytics, and the top three GA metrics worth tracking.19. Jackie ChuWeb Infrastructure + Intelligence Lead @ UberWhat she’s known for: In-house SEO, Getting buy-in for SEOWhere to follow her: Twitter, LinkedInMy fave takeaways: Jackie shares some great insights for in-house and non-in-house SEO pros alike. From tips on how to get buy-in for SEO initiatives in a large organization to how to IPO as an SEO, there’s a lot to learn here. I also love her take on how SEO is not a black box because it really isn’t, and it’s our job to educate non-SEO stakeholders about it.20. Joanna LordCMO, Board Member, Advisor & Angel InvestorWhat she’s known for: Executive SEO, angel investingWhere to follow her: Twitter, LinkedInMy fave takeaways: Joanna has held multiple executive-level marketing positions, including a stint at Moz. I love seeing how leaders like Joanna think and approach various challenges at an executive level, and if you do too, give her a follow. I especially love her hot take that what makes a great brand includes “fighting for your customer and championing something bigger than yourself.”21. Roxana StinguHead of Search & SEO @ AlamyWhat she’s known for: Technical SEO, Image SEOWhere to follow her: Twitter, LinkedInMy fave takeaways: Roxana has an incredible mind for analytics and technical, data-driven work. With a background in mathematics, she really knows her stuff when it comes to technical SEO. I recommend checking out her technical SEO tips in a free course shared with the Freelance Coalition as well as her next-level image SEO insights from her presentation at LondonSEO XL 2023.22. Samantha WhitewoodGeneral Manager of Agency Services @ EngineRoomWhat she’s known for: SEO leadership, SEO agency managementWhere to follow her: LinkedInMy fave takeaways: Sam and I have had the pleasure of working together for many years in the first female-led SEO team I’ve been a part of in any agency. We’re quite proud of this feat and have transformed our team, consisting mainly of non-SEO professionals, into an SEO powerhouse delivering super-cool results for clients. 23. Viola EvaFounder @ Flow SEOWhat she’s known for: SaaS SEOWhere to follow her: Twitter, LinkedInMy fave takeaways: I met Viola very early in my SEO journey and have enjoyed watching as her career transformed over the years. I love the philosophies she shares about issues beyond SEO that are central to the day-to-day lives of anyone working in startups and scaleups. Check out her podcast for inspiring conversations about things like finding flow, conscious leadership, and more.24. Areej AbuAliFounder @ Women in Tech SEOWhat she’s known for: Building a community for women in SEOWhere to follow her: Twitter, LinkedInMy fave takeaways: Areej is renowned for her work supporting women in SEO through her Women in Tech SEO social and Slack groups. She also runs community events, and free mentorships and promotes other women in the industry in multiple ways. For instance, you can find female speakers, founders, and freelancers on her website.25. Kari DePhillipsCEO @ The Content FactoryWhat she’s known for: Digital PR, remote workWhere to follow her: Twitter, LinkedInMy fave takeaways: Kari’s been sharing her journey on running a remote digital agency since well before the pandemic made it common practice. I always find her insights on how she’s grown a multi-million dollar remote agency very insightful. She also manages Sisters in SEO where she frequently shares fair and inclusive job opportunities along with down-to-earth SEO advice.26. Samantha PenningtonFounder @ Oree VirtualWhat they’re known for: Making the web a more inclusive spaceWhere to follow them: Samantha is no longer on social media, though you can connect via their website.My fave takeaways: As promised I’ve saved the best for last. The thing about inspiration is that it’s most powerful when someone’s content compels you to keep researching, keep digging and keep learning well beyond the message they initially shared.Samantha co-founded Sisters in SEO, the group where I first became inspired by the idea of creating an equitable, inclusive web. As content creators and web designers, we’re in the perfect position to use our skills for a noble purpose with tangible human impact. Because of Samantha, I’ve since helped clients make their websites more diverse and inclusive. I discovered initiatives like this and this among many others.I highly recommend reaching out and learning more about how you can also make the web a more inclusive space, one page at a time.Thanks for supporting all voices in SEO with usThere are so many amazing people in our industry, so we couldn’t fit them all into one list (as you can imagine). Thanks for supporting everyone listed above!Also, remember to check out other inspiring SEO experts in this X list. And if you have space for one more, I’d appreciate some social love on X and LinkedIn too 😉 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Despina Gavoyannis Despina is a Senior SEO Consultant with 8+ years of experience growing B2B, e-commerce, SaaS, and national brands. She's an optimist at heart, taking time to enjoy life's silver linings each day. Keep Learning WordPress SEO: 20 Tips and Best Practices WordPress makes it easy to use SEO best practices. Improve your site's SEO with the tips in this guide. 10 Skills Every SEO Pro Needs for Success Curious about what it takes to become a successful SEO pro? Here are 10 skills you must master to level up into one. SEO Copywriting: What It Is & How to Do It SEO copywriting is creating high-quality content that appeals to search engine algorithms and human users. Learn how to do it well.",
  "headers": [
    {
      "level": "H1",
      "text": "26 Women and Nonbinary SEO Pros Who Inspire Me"
    },
    {
      "level": "H2",
      "text": "1. Aleyda Solís"
    },
    {
      "level": "H4",
      "text": "SEO Consultant @ Orainti"
    },
    {
      "level": "H2",
      "text": "2. Dr. Marie Haynes"
    },
    {
      "level": "H4",
      "text": "Owner @ Marie Haynes Consulting"
    },
    {
      "level": "H2",
      "text": "3. Vanessa Fox"
    },
    {
      "level": "H4",
      "text": "CEO @ Keylime Toolbox"
    },
    {
      "level": "H2",
      "text": "4. Lily Ray"
    },
    {
      "level": "H4",
      "text": "Vice President of SEO Strategy & Research @ Amsive Digital"
    },
    {
      "level": "H2",
      "text": "5. Jes Scholz"
    },
    {
      "level": "H4",
      "text": "Independent Marketing Consultant"
    },
    {
      "level": "H2",
      "text": "6. Kristin Tynski"
    },
    {
      "level": "H4",
      "text": "Co-Founder @ Fractl"
    },
    {
      "level": "H2",
      "text": "7. Jessica Bowman"
    },
    {
      "level": "H4",
      "text": "CEO @ SEO In House"
    },
    {
      "level": "H2",
      "text": "8. Ann Handley"
    },
    {
      "level": "H4",
      "text": "Chief Content Officer @ MarketingProfs"
    },
    {
      "level": "H2",
      "text": "9. Nik Ranger"
    },
    {
      "level": "H4",
      "text": "Senior Technical Consultant @ Dejan Marketing"
    },
    {
      "level": "H2",
      "text": "10. Bibi Lauri Raven"
    },
    {
      "level": "H4",
      "text": "Owner + Link Builder @ BibiBuzz"
    },
    {
      "level": "H2",
      "text": "11. Maria Amelie White"
    },
    {
      "level": "H4",
      "text": "Global SEO Lead @ Kurt Geiger"
    },
    {
      "level": "H2",
      "text": "12. Kristina Azarenko"
    },
    {
      "level": "H4",
      "text": "Founder @ Marketing Syrup"
    },
    {
      "level": "H2",
      "text": "13. Jamie Indigo"
    },
    {
      "level": "H4",
      "text": "Technical SEO Consultant @ Not a Robot"
    },
    {
      "level": "H2",
      "text": "14. Crystal Carter"
    },
    {
      "level": "H4",
      "text": "Head of SEO Communications @ Wix"
    },
    {
      "level": "H2",
      "text": "15. Olga Zarr"
    },
    {
      "level": "H4",
      "text": "CEO + SEO Consultant @ SEOSLY"
    },
    {
      "level": "H2",
      "text": "16. Chima Mmeje"
    },
    {
      "level": "H4",
      "text": "Senior Content Marketing Manager @ Moz"
    },
    {
      "level": "H2",
      "text": "17. Britney Muller"
    },
    {
      "level": "H4",
      "text": "Business Consultant @ Britney Muller Inc"
    },
    {
      "level": "H2",
      "text": "18. Kayle Larkin"
    },
    {
      "level": "H4",
      "text": "Head of Marketing @ Elevar"
    },
    {
      "level": "H2",
      "text": "19. Jackie Chu"
    },
    {
      "level": "H4",
      "text": "Web Infrastructure + Intelligence Lead @ Uber"
    },
    {
      "level": "H2",
      "text": "20. Joanna Lord"
    },
    {
      "level": "H4",
      "text": "CMO, Board Member, Advisor & Angel Investor"
    },
    {
      "level": "H2",
      "text": "21. Roxana Stingu"
    },
    {
      "level": "H4",
      "text": "Head of Search & SEO @ Alamy"
    },
    {
      "level": "H2",
      "text": "22. Samantha Whitewood"
    },
    {
      "level": "H4",
      "text": "General Manager of Agency Services @ EngineRoom"
    },
    {
      "level": "H2",
      "text": "23. Viola Eva"
    },
    {
      "level": "H4",
      "text": "Founder @ Flow SEO"
    },
    {
      "level": "H2",
      "text": "24. Areej AbuAli"
    },
    {
      "level": "H4",
      "text": "Founder @ Women in Tech SEO"
    },
    {
      "level": "H2",
      "text": "25. Kari DePhillips"
    },
    {
      "level": "H4",
      "text": "CEO @ The Content Factory"
    },
    {
      "level": "H2",
      "text": "26. Samantha Pennington"
    },
    {
      "level": "H4",
      "text": "Founder @ Oree Virtual"
    },
    {
      "level": "H2",
      "text": "Thanks for supporting all voices in SEO with us"
    }
  ],
  "author": "Despina Gavoyannis"
}