{
  "url": "https://ahrefs.com/blog/word-of-mouth-marketing/",
  "slug": "word-of-mouth-marketing",
  "title": "Word-of-Mouth Marketing: A Simple Tried & Tested Guide",
  "description": "Word-of-mouth marketing is the process of influencing and encouraging natural discussions about a product, service, or company. Learn how to leverage it.",
  "content": "Michal Pecánek SaaS SEO consultant with over 6 years of experience. Before going freelance, Michal was an SEO & Marketing Educator at Ahrefs–creating content for the blog and managing a team of guest writers. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents You can’t control it, and its results depend on your overall marketing strategy and execution. If done right, it could become one of your most powerful marketing channels.Let me introduce you to this often overlooked marketing channel that has had a huge impact on our business: word-of-mouth marketing.In this article, you’ll learn the following:What word-of-mouth marketing isWhy word-of-mouth marketing is importantFlywheel principle behind word-of-mouth marketingFive tried and tested tips for word-of-mouth marketingSo follow along and replicate our success.What is word-of-mouth marketing?The terms “word of mouth” and “word-of-mouth marketing” are sometimes used interchangeably. But they’re not the same thing, and we need to define the first to understand the second.Word of mouth (WoM) is the act of telling people about a product or a brand. For the purpose of this article, we’ll only talk about positive WoM.Word-of-mouth marketing (WoMM) is the process of influencing and encouraging natural discussions about a product, service, or company. It refers to the incentivization of WoM.Why is word-of-mouth marketing important?Research from Nielsen shows that 83% of people trust recommendations from their friends and family. It’s simply the most trustworthy and authentic marketing channel that you can’t beat no matter how great your marketing communication is.The fact that 14,000 new customers in 2020 told us they were referred to Ahrefs by their friends is the best proof of the importance of WoMM.But it’s not just people you know personally who can have such an impact on your product choices. Authorities and influencers can play a similar role. For example, a well-known SEO authority, Matthew Woodward, brought us more than 500 new customers in 2020:And these numbers are lowballing the WoM impact. That’s because all of these are recalled attributions. Many people don’t remember how they found out about Ahrefs, or they just don’t tell us.Flywheel principle behind word-of-mouth marketingWoMM doesn’t become a crucial part of your marketing mix the moment you start focusing your attention and resources on it. It takes time, a lot of time, and flywheels can explain why.WoMM can be referred to as a self-reinforcing marketing channel. In the beginning, you won’t see any huge effects. But as you go along, it becomes much easier to get the results. The effects can even start compounding.You can basically use a flywheel as an analogy here. Rand Fishkin popularized the term “marketing flywheel.” You can see one of the flywheels containing WoM here:WoM flywheel via Sparktoro.Truly, the main marketing driver behind Ahrefs’ growth is the long-term compounding effect of WoMM combined with SEO and content marketing.And this brings us to the tips.Five tried and tested tips for word-of-mouth marketingEverything listed here is what has worked for us. You’ll generally do pretty well if you apply these practices to your marketing, but it’s not an exhaustive list of tactics. I’ll reference other noteworthy tips in the “final thoughts” section.Tip 1. Have a superb product offeringI’ll break it to you right away. You need a great product to incentivize WoM. All the other tips and tactics won’t make up for it if you don’t.The Ahrefs product has been at the forefront of our marketing from the start. We penetrated the SEO tools market as a backlink analysis tool back in 2010. From there, we quickly built our reputation of being the best in the market. A few years and many features later, we’ve become one of the two most used all-in-one SEO toolsets.Your product positioning, i.e., how you portray your product to potential customers, also plays a role here. The key to this is proper market research that should guide both the product roadmap and your positioning.Last but not least, if you’re in the SaaS industry as we are, it also helps to offer trials and/or a freemium version of your product.For example, introducing the free Ahrefs Webmaster Tools has helped us increase product awareness and valuable WoM for our Site Audit tool. We faced some challenges when many SEOs didn’t think of Ahrefs as a technical SEO solution.But that’s not the case anymore:Tip 2. Manage your brand properlyWoM consists of how people experience your products and how they perceive your brand. The point here is that people are unlikely to recommend a good product if they don’t like the company selling it.I can’t even remotely fit a guide to brand management here, so I just want this to be a reminder that you should always think about the bigger picture and plan for the long run.In fact, research shows that most companies would achieve the greatest marketing effectiveness if they invested around 60% into brand-building and 40% into sales-boosting campaigns:Here’s what proper branding looks like in our hands:You already know it, and many other marketers know it too—the product comes first in Ahrefs. And we don’t shy away from emphasizing this in somewhat unique ways.It’s much easier said than done, but do your best to be a likable brand. Invest in your online reputation management. The better you are at this, the more WoM you’ll get from your target audience. That group is always much larger than your customer base.Tip 3. Focus on product-led content marketingContent marketing is the process of creating and distributing content to attract and retain customers. Our content is the most important marketing asset we have because it generates around 1 million visits every month from organic search alone:What may not be so obvious is that it’s also the main driver of our WoMM. Let me show you what I mean.Check out this tweet, for example:Making a habit of regularly visiting the @ahrefs blog again. Learned the basics from them back in 2015 and still consider them a go-to primer when approaching a new problem (e.g. manual content audit - which I haven’t done in years). Still super-fanning these guys 🙃— Kari Beaulieu (@SERP_queen) September 15, 2020 Us becoming an SEO industry authority and a go-to learning resource is actually intertwined with our rapid business growth. That’s because the content we produce is product-led. Since the Ahrefs toolset can help you solve all sorts of SEO and marketing problems, it’s easy and natural for us to pitch the product in our content.Remember the flywheel principle? In our case, the more traffic our content gets, the more people are aware of how Ahrefs can help them, and the more they start recommending both our product and learning resources. That leads to more mentions, more links, and more traffic.Then the circle starts again.These are the four steps to successfully replicate this tactic:Step 1. Do keyword researchI’m sure you can come up with many problems your product can solve or help with. Some are more common than others, and keyword research will help you identify those.For example, the keyword “word of mouth marketing” is searched for approximately 11K times a month globally:Since I can create a valuable piece of content with unique information (our own experience with WoMM) and naturally pitch Ahrefs at the same time, it’s a great topic to target.Recommended reading: How to Do Keyword Research for SEOStep 2. Focus on topics with high business potentialYour keyword research will reveal tons of content ideas. You’ll need to prioritize them, so here are the criteria to assess:High business potential so that you can easily pitch your productHigh traffic potential so that you’d get a lot of organic traffic if you ranked wellLow Keyword Difficulty (KD) score so that it’s relatively easy to rank wellLet’s be real, though. You’ll almost never encounter topics that meet all three of these criteria. But out of those three, we generally prioritize high business potential. Because if your content isn’t product-led, your WoM will likely end at recommending your content, not your product.We use the following scale to classify the keywords, and I recommend you use a similar approach:Recommended reading: How to Choose the Right Keywords for SEOStep 3. Double down on proper content distributionCreating great content takes a lot of time and effort. However, clicking the “Publish” button is only half the battle.You should have a proper content distribution strategy that makes use of multiple marketing channels to gain traction on your content even before it manages to rank in the SERPs.Here’s what we generally do with our content:Share it on our company and personal social media accountsInclude it in our newsletterRepurpose it into stand-alone social media posts and/or videosPromote it with adsI’d also highlight launching an outreach campaign here. We rarely do it these days. But outreach can be essential to your success, especially when you’re not that well known in the industry yet. Getting your content in front of media and industry authorities can get you great backlinks and recognition if it’s done right.Step 4. Optimize, rinse, and repeatOf course, creating superb product-led content isn’t a panacea to your SEO and WoMM. You’ll need a lot of patience. Also, you should apply the best SEO practices on your whole website and also follow the rest of the WoMM tips here.Tip 4. Create or hire brand ambassadorsI believe that having brand ambassadors is the best approach to influencer marketing, which in turn can be a great boost to your WoMM.A brand ambassador is anyone who’s regularly in the spotlight representing a company. This is often an employee with the power to influence the community. But you can form these long-term partnerships with anyone. I’m sure you follow some influencers who’ve been promoting certain products for years.For example, we have Patrick Stox. He’s one of the most well-known technical SEOs. He often speaks at SEO events, organizes them, and even moderates a popular industry subreddit called TechSEO.In terms of paid campaigns, the best sponsorships and honest recommendations of our product come from our long-term customers:Now, keep in mind that you won’t get the WoM benefits if you run one-off or short-term campaigns. Get the influencers and brand ambassadors to promote your products regularly.You have the best chance by reaching out to people who are already your customers. Again, if you have a superb product, they may already be spreading the word for free anyway.Tip 5. Build an engaged communityHaving a large social media following doesn’t imply a significant WoM impact. To make this work, encourage members of your audience to engage with each other, talk about everything company- and product-related, and generally make them feel closer to you.Here are a few community-building tips that can amplify your WoMM.Create a group for your customersAhrefs Insider is our “customers only” Facebook group. At the time of writing, it has ~16,500 members:Over the years, we’ve shaped this into an engaged community, with members eager to share their knowledge, answer questions, and provide input on our toolset.You could make the argument that the bigger the group, the better for WoM. Yet we only let our customers in. Why? Well, there are two huge benefits that help spread WoM even better.First, anyone paying even for our cheapest monthly plan must be somehow serious about SEO and familiar with our product. This ensures that there are usually good, relevant discussions that members want to engage in.And second, once the group provides value to its members, it may create a FOMO effect for those who are not members or customers yet.Keep your audience up to date with your product developmentGot a new feature? Is it a new generation of your product? Or has something changed based on the feedback of your community? Use every distribution channel available to let them know.There’s almost never enough exposure, so make sure you use all your social media profiles, blog updates, videos, newsletters and, of course, your own group.In our case, members of Ahrefs Insider know about our product updates as soon as they come out:Rest assured, this information then gets shared on all the other distribution channels mentioned earlier.Initiate conversations in your communityThe best-case scenario for your community and WoM growth is when people engage with each other organically. This happens both inside and outside our FB group. But finding common topics and initiating those conversations amplify WoM further.For example, we often ask our members about their opinions on certain product features or SEO and marketing topics. On top of that, we run “SEO speed dating” every month:Be open, be receptive, and reflect on their feedbackMake your customers and fans feel like they’re heard (as they should be), and you’ll get closer to them as a company. This can be done via employees and brand ambassadors, making the interactions feel even more personal.Here’s an example of our CMO, Tim Soulo, asking for product feedback in a popular SEO Reddit:Needless to say, we sometimes get negative messages and feedback. That’s totally expected and natural. What may not be so common is when we say that we’ll run the feedback and suggestions by the team, we really mean that. I recommend you adopt a similar approach.Genuinely engaging with your audience is something that only has upsides anyway. This can be even in the form of a video that responds to an FAQ:https://www.youtube.com/watch?v=AYlL4ZN1zHADistribute high-quality and useful merchandiseLet’s be real. It’s likely most of the branded swag you get ends up somewhere in a drawer. But what if you produced stuff that people want to use and are even willing to pay for?I would drop a pretty penny on some ahrefs merch to be honest. @samsgoh hook it up with a hoodie.— Lazaroc.eth (@Lazaroc) January 8, 2021 Selling your merchandise can be considered over the top. But creating some scarcity definitely drives up the demand if it’s worth it. If only a few people in a community event have a cool piece of merchandise, it can definitely spark conversations.I often wear our t-shirts and hoodie to industry events. Many SEOs approached me, asking how they could get the swag for themselves. I can assure you that some of them didn’t know who I am or that I work for Ahrefs.By the way, there are multiple ways to get our merch. One of them is public giveaways.Who wants this pretty box with some Ahrefs’ swag and goodies?😜Just tell us which Ahrefs’ feature is your favourite. We’ll select 10 people at random and send them these swag boxes. 🙃 pic.twitter.com/5DQ32B6Qly— Ahrefs (@ahrefs) April 7, 2021 That being said, telling you about the other ways won’t add to the scarcity and FOMO, so let’s leave it here.Final thoughtsYou can succeed in WoMM as we did regardless of your business, especially if you already have a top-notch product.If we look beyond the tactics mentioned here, you may also want to consider assessing and improving your Net Promoter Score (NPS), encouraging customers to leave reviews across important platforms, or planning a gift-giving campaign with no strings attached.All of these tactics combined are more than enough to achieve success with WoMM.Got any questions? Ping me on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Michal Pecánek SaaS SEO consultant with over 6 years of experience. Before going freelance, Michal was an SEO & Marketing Educator at Ahrefs–creating content for the blog and managing a team of guest writers. Keep Learning Marketing Analytics: The Simple Guide Marketing analytics seeks patterns and insights that can improve marketing performance. Understand marketing analytics to eliminate guesswork. 9 Tactics to Increase Brand Awareness (Tried & Tested) From word-of-mouth marketing to running ads in mass media, learn how to get more people to the top of your funnel. The 9 Best Speech-to-Text Apps in 2023 (Tried & Tested) There are different options available for text-to-speech transcriptions, but which ones reign supreme? Let's find out. Music Marketing: A Simple (But Complete) Guide Music marketing is creating, sharing, delivering, and exchanging music offerings that have value to customers, fans, or partners. What Is Search Engine Marketing? The Simple Guide Learn what search engine marketing is, how it works, the best practices to implement, and more in our beginner-friendly guide.",
  "headers": [
    {
      "level": "H1",
      "text": "Word-of-Mouth Marketing: A Simple Tried & Tested Guide"
    },
    {
      "level": "H2",
      "text": "What is word-of-mouth marketing?"
    },
    {
      "level": "H2",
      "text": "Why is word-of-mouth marketing important?"
    },
    {
      "level": "H2",
      "text": "Flywheel principle behind word-of-mouth marketing"
    },
    {
      "level": "H2",
      "text": "Five tried and tested tips for word-of-mouth marketing"
    },
    {
      "level": "H3",
      "text": "Tip 1. Have a superb product offering"
    },
    {
      "level": "H3",
      "text": "Tip 2. Manage your brand properly"
    },
    {
      "level": "H3",
      "text": "Tip 3. Focus on product-led content marketing"
    },
    {
      "level": "H4",
      "text": "Step 1. Do keyword research"
    },
    {
      "level": "H4",
      "text": "Step 2. Focus on topics with high business potential"
    },
    {
      "level": "H4",
      "text": "Step 3. Double down on proper content distribution"
    },
    {
      "level": "H4",
      "text": "Step 4. Optimize, rinse, and repeat"
    },
    {
      "level": "H3",
      "text": "Tip 4. Create or hire brand ambassadors"
    },
    {
      "level": "H3",
      "text": "Tip 5. Build an engaged community"
    },
    {
      "level": "H4",
      "text": "Create a group for your customers"
    },
    {
      "level": "H4",
      "text": "Keep your audience up to date with your product development"
    },
    {
      "level": "H4",
      "text": "Initiate conversations in your community"
    },
    {
      "level": "H4",
      "text": "Be open, be receptive, and reflect on their feedback"
    },
    {
      "level": "H4",
      "text": "Distribute high-quality and useful merchandise"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Michal Pecánek"
}