{
  "url": "https://ahrefs.com/blog/youtube-keyword-research/",
  "slug": "youtube-keyword-research",
  "title": "How to Do YouTube Keyword Research in 3 Easy Steps",
  "description": "Learn the keyword approach that helped us grow our channel from 10,000 to over 200,000 monthly views in around a year.",
  "content": "Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Contents Looking to grow your YouTube channel and attract more views? The “trick” is to target topics with search demand.This is the approach that helped us grow our YouTube channel from ~10,000 to over 200,000 monthly views in around a year.We also gained over 50,000 new subscribers in that same period.In this post, I’ll run you through our three-step process for finding the best keywords to target on YouTube.https://www.youtube.com/watch?v=kAuM2nQb_P8Step #1: Map out a hierarchy of topicsImagine that you sell phone cases online, and you’re creating a new channel where you’ll unbox new smartphones to attract an audience of potential customers.Your first thought might be to go after broad topics with huge search volumes.The problem is that if you create videos on topics that are too broad, then you’ll attract an irrelevant audience. By the same notion, if you create videos on super-niche topics, then you won’t attract enough people.Solve this by first mapping out a hierarchy of topics to cover.If we were doing this for our unboxing channel, then “unboxing” might be at the top of the hierarchy. From there, you might list popular brands.Then under each of those, you could add specific models.Feel free to go as deep as necessary with your hierarchy.pro tipIf you’re struggling to do this process manually, one trick is to use the wildcard (*) operator with YouTube autosuggest. For example, we could search for something like Samsung Galaxy S* to find phone models.Step #2. Generate keyword ideas and find search volumesNext, use keyword research tools to find what people are searching for in relation to your list of topics.There are a lot of keyword research tools out there, but most of them only show Google search volumes and not YouTube ones. These are almost entirely useless because people search on YouTube very differently to how they search on Google.For example, Google Trends tells us that searches for “pizza dough recipe” are slowly declining in recent years on Google…… whereas they’re on the rise on YouTube.Now, you might think the solution to this is to look at the number of video views on YouTube. But this can also be quite misleading.For example, we rank on YouTube for “SEO audit,” and our video has racked up an impressive 640,000 views over the past three years.That averages out to around 18,000 views/month.But one quick look at our YouTube analytics tells you that our views are from paid YouTube ads, not organic search.With that in mind, here are three tools for finding YouTube keyword ideas and search volumes that actually work.1. Ahrefs Keywords ExplorerHead over to Ahrefs Keywords Explorer, select YouTube as the search engine, and enter a seed keyword. Let’s go for “unboxing.”You can see this keyword gets 40,000 monthly searches in the US.The problem is that this topic is way too broad, which is probably why only 32% of searches result in clicks.Think about it. If someone searches for “unboxing” on YouTube, what do they want to see you unbox? Chances are you have no idea, and they probably don’t either.Instead, head to the “Phrase match” report which shows you keyword ideas containing your seed keywords.In this case, we get ~120,000 suggestions.But there’s a problem: some ideas are unrelated to smartphones—which is the topic of our channel. We wouldn’t want to create a video where we unbox a Nintendo Switch, despite its high search demand.To solve this, look back at your hierarchy from step one, then paste some of the topics into the “Include” filter separated by commas. Switch the toggle to “Any word” to see keywords that contain any words in your list—plus your seed.You should end up with a much more manageable list of super-relevant keywords.To narrow down the list even further, filter for keywords with at least 500 monthly searches.pro tipMost keyword research tools like Keywords Explorer use rounded annual averages for search volume estimations. For that reason, it’s worth checking for declining or seasonal trends before pursuing a keyword.If you look at the keyword “iPhone 8 unboxing” in Keywords Explorer, there’s a spike followed by a downward trend.This makes sense as the spike occurs around the time the iPhone 8 was released. It becomes less popular over time as Apple and other manufacturers release new models.Long story short, declining topics like this often aren’t the best targets.2. YouTube adsWith YouTube ads, you can pay to show your video in YouTube search for any keyword.For example, if you had an iPhone X unboxing video, then you could run YouTube ads for the keyword “iPhone X unboxing.”Let your ad run for 30 days, then check the Search Terms report in Google Ads where you’ll see the number of ad impressions on a keyword by keyword basis.The number of impressions a keyword gets should be an underestimation of search volume because your ad won’t show for every search. But it should still be enough to provide a rough estimation.3. YouTube Autosuggest + Google TrendsStart typing a seed keyword into the YouTube search bar and you’ll see a list of related queries pop up. These are ‘autosuggest’ results, and they’re a great source of keyword ideas.For example, if you type “iPhone * unboxing,” then you get suggestions like “iPhone XS Max unboxing” and “iPhone 7 unboxing.”If you see any interesting suggestions, throw them into Google Trends, then change the dropdown to “YouTube search” to see their relative popularity.Here, you can see that more people search for “iPhone XS unboxing” than “iPhone 5S unboxing.”pro tipUnfortunately, combining autosuggest results with Google Trends won’t show you absolute search volumes. If you happen to know the rough search volume of just one keyword, then you can “guesstimate” the volume of others by comparing their relative popularities in Google Trends.Pair method #3 with method #2 to do that.Step #3. Check search intentFail to match search intent, and you’re dead in the water before you even start.That’s because YouTube, much like Google, tries to return results that its users actually want to see.It’s why when you search for “Apple,” YouTube shows you videos about Apple, the computer company…… as opposed to the fruit.Understanding search intent is a critical part of the keyword research process, and the easiest way to start is to ask yourself a simple question:“What would someone searching for this keyword want to see?”For some keywords, this couldn’t be more obvious.If someone searches for “Galaxy S9 unboxing,” then they want you to take the thing out of the box and show them everything that’s inside. On the other hand, if they’re searching for “iPhone apps,” then that’s more open to interpretation.Do they want to know about this year’s must-have apps? Or new app releases? Or perhaps where to buy apps on iOS and Android?The easiest way to figure this out is to head to YouTube, search for the keyword, then look at the top few search results.Here, you can see that people searching for “iPhone apps” want to watch videos about a bunch of apps. Specifically, the top apps released this year.If you wanted to rank for this keyword, then this is the style of video you’d want to create.pro tipFor best results, check the top search results on YouTube in an incognito tab. YouTube often personalizes search results based on factors like search history.Bonus tip: “Double dip” to get video traffic from GoogleHave you ever done a Google search and seen videos in the search results?No matter whether they show up as video carousels, dedicated results, featured videos, or a mixture of them all, their presence tells you something important:People searching for this topic in Google want to see videos.If you can create videos around topics that are likely to rank in Google, then you can effectively “double dip” and pull in traffic from two search engines instead of one.Here are three ways to find such topics.1. Look for keywords with video resultsTake one of the keywords from your list and paste it into Google.Look at the search results. Is there a video carousel in the results? Or perhaps a dedicated video SERP feature?If so, then there may be an opportunity to “double dip” and get traffic from both YouTube and Google.To see how much traffic the current video results are getting from Google, copy and paste the URLs into Ahrefs Site Explorer one by one.Alternatively, use this Scraper Chrome extension to scrape all video URLs in bulk, then paste them into Ahrefs Batch Analysis tool.To do that, right-click anywhere on the page, click “Scrape similar…,” then add this XPath code as the “Selector”://a[starts-with(@href,\"https://www.youtube.com/watch\")]Then this XPath code under the “Columns” section:@hrefIt should look something like this:Click “Scrape,” then “Copy to clipboard,” then paste all URLs into the Batch Analysis tool and set the mode to URL.Sort the report by the “Traffic” column from high to low.Dig into the “Organic keywords” report in Site Explorer to see which keywords they rank for, and where they’re getting most of their traffic from.It’s also worth checking the organic traffic graph in the “Overview” report to make sure the video is consistently getting traffic from Google.Some topics/keywords are highly-volatile, and so may not be worth targeting.2. Search for videos by topic in Content ExplorerContent Explorer is a searchable database of over a billion web pages, complete with SEO and social metrics.Best of all, it supports many advanced search operators. Which means you can search for things like this:site:youtube.com inurl:watch title:topicThis searches for YouTube videos with a specific word or phrase in the title.Sort the results by Organic traffic to see topics with “double dipping” potential.You can see that the first video gets ~15,100 visits from Google every single month.To see if the video has been getting consistent traffic over time, hit the “Details” button, and check the Organic traffic graph.What you want to see is this:Not this:Check the “Organic keywords” tab to see a snapshot of keywords that the video ranks for in Google, and how much traffic those keywords send.3. Find high traffic videos with YouTube and Site ExplorerFind a competing channel on YouTube, then hit the “Videos” tab to see all their uploads.Copy and paste the video URLs into Ahrefs Site Explorer one by one.You’re looking for a video with traffic.To speed up this process, use the Scraper extension again.Just right-click anywhere on the page and hit “Scrape similar…,” then add this code in the “Selector” field://h3/aThen this XPath code under the “Columns” section:concat ('https://www.youtube.com', @href)It should look something like this:Hit “Scrape” then “Copy to clipboard.”Paste the results into the Ahrefs Batch Analysis tool, select the URL mode, run the search, then sort by the “Traffic” column from high to low.To see the keywords each video ranks for, hit the caret, then “Organic keywords.”Reminder: Don’t forget to check the “Organic traffic” graph on the “Overview” report for consistent traffic over time.Final thoughtsFail to target keywords with search volume, and you won’t get views from YouTube search—it’s as simple as that.How do we know? Last year, we launched a series of product-related videos for our former Marketing with Ahrefs series. None of these are about topics with search volume, which is why they didn’t drive much traffic from YouTube search.Then we started targeting keywords.Here’s our growth since then:If your goal is to build your channel and get more views, then you need to make keyword research a priority.https://www.youtube.com/watch?v=iwkUlTl2IowLearn more about YouTube SEO here.Got questions? Ping me in the comments or on Twitter. Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: Article by Joshua Hardwick Head of Content @ Ahrefs (or, in plain English, I'm the guy responsible for ensuring that every blog post we publish is EPIC). Keep Learning 8 Best YouTube Keyword Tools (Free and Paid) Keyword research is crucial if you want to grow your YouTube channel. Here are some of the best YouTube keyword tools you can use. How to Use Google Trends for Keyword Research: 7 Effective Ways Google Trends is often underestimated when it comes to keyword research. Learn some helpful overlooked features of this tool. 6 Keyword Research Tips to Find Untapped Opportunities Keyword research is a crucial factor in the success of most websites. But the conventional process can leave a lot of keywords on the table. How to Do Keyword Research for Affiliate Sites Keyword research for affiliate sites is about finding high-volume keywords, where you can naturally plug product recommendations. Advanced Keyword Research: 5 Tips for Finding Untapped Keywords Build search traffic and rankings by targeting the keywords your competitors haven’t found yet with these five tips.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Do YouTube Keyword Research in 3 Easy Steps"
    },
    {
      "level": "H2",
      "text": "Step #1: Map out a hierarchy of topics"
    },
    {
      "level": "H2",
      "text": "Step #2. Generate keyword ideas and find search volumes"
    },
    {
      "level": "H3",
      "text": "1. Ahrefs Keywords Explorer"
    },
    {
      "level": "H3",
      "text": "2. YouTube ads"
    },
    {
      "level": "H3",
      "text": "3. YouTube Autosuggest + Google Trends"
    },
    {
      "level": "H2",
      "text": "Step #3. Check search intent"
    },
    {
      "level": "H2",
      "text": "Bonus tip: “Double dip” to get video traffic from Google"
    },
    {
      "level": "H3",
      "text": "1. Look for keywords with video results"
    },
    {
      "level": "H3",
      "text": "2. Search for videos by topic in Content Explorer"
    },
    {
      "level": "H3",
      "text": "3. Find high traffic videos with YouTube and Site Explorer"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    }
  ],
  "author": "Joshua Hardwick"
}