{
  "url": "https://www.similarweb.com/blog/investor/stock-market/10-best-stocks-2021/",
  "slug": "10-best-stocks-2021",
  "title": "10 Best Stocks for 2021 for Digital Growth | Similarweb",
  "description": "Using Similarweb's data, we pinpointed the 10 best stocks for 2021 for strong digital growth. These are the stocks you should keep an eye on in 2021.",
  "content": "HomeBlogStockStock Market10 Best Stocks for 2021 for Strong Digital Growth [Updated June] Stock Intelligence 10 Best Stocks for 2021 for Strong Digital Growth [Updated June] Get the growth report by Harriet Lefton , Investor Insights Manager 12 Min. May 30, 2021 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic The pandemic has completely changed the trajectory of stocks and sectors. Whether we like it or not, coronavirus has sped up the world’s digital transformation by months or even years. “The move to digitization has accelerated, and the benefits will be permanent,” says KPMG’s global advisory head Carl Carande. “There is no going back.” With this in mind, we decided to zero in on the top 10 investing trends for 2021, covering everything from bitcoin and cryptocurrency to IPOs and SPACs. We also put Similarweb’s powerful alternative data into action to highlight some of the best stocks for 2021 with strong digital trends. Let’s go. 1. Dividend aristocrat: McDonald’s “The only certainty is that nothing is certainty”, Pliny the Elder, Ancient Rome. Uncertainty continues to plague the market in 2Q21 leading to notably volatile trading patterns. And it doesn’t look like that’s about to change anytime soon. The market’s ‘fear gauge’ aka the VIX index surged to its highest level ever back in March 2020, and remains elevated (currently above 20). Most recently, extreme crypto moves have sent jitters through the market. The best way to deal with volatility is to be prepared. That could mean taking a long-term investing approach like Warren Buffett (and riding out the market’s lumps and bumps), or it could mean diversifying your portfolio. For instance, tech stocks can be balanced out with more defensive stocks from the utilities or household staples industry. High dividend stocks with a history of low volatility are also a savvy way to counter riskier stock plays. Key examples of relatively stable dividend stocks include McDonald’s (MCD), snack giant Mondelez (MDLZ), medical device company Medtronic (MDT), and utilities stock Exelon (EXC). Dividend aristocrat McDonald’s, for example, has now racked up an eyebrow-raising 45 years of consecutive dividend increases. Shareholders currently cash in an annualized dividend of $5.16 on a 2.24% dividend yield. Monitor the latest digital data trends for MCD here. 2. Travel boom: Southwest Airlines Thanks to the COVID-19 vaccine rollout, 2020’s worst-performing industries are enjoying a rapid rebound. With a ‘return to normalcy’ now on the horizon (or underway depending on the country), investors have been eyeing up a special class of stocks dubbed the “lockdown losers.” Could these now be the best stocks for 2021? Both transport and vacation stocks fall into this category – with a surge in demand likely once travel restrictions are lifted. “Travel is coming back, and we are laser-focused on preparing for the travel rebound,” commented Airbnb CEO Brian Chesky in the company’s earnings release in February. As well as vacation rental platforms, hotel chains and airlines also stand to benefit when this travel boom materializes. Hotel chains Marriott (MAR), Hyatt (H), and Hilton (HLT) have already rallied in 2021, as have airline stocks American Airlines (AAL), Delta (DAL) and Southwest Airlines (LUV). In fact, despite reporting a revenue miss for 1Q21, LUV is already up 32% year-to-date (YTD). Prompting the bullish sentiment: Southwest has stated that it expects its core cash flow to reach break-even, “or better”, by June. What’s more, the U.S. airline has also just cut its average core cash burn forecast by $1 million/day for Q2, as improving leisure travel demand overrides higher fuel prices. So watch this space. 3. Hybrid working: Zoom Video On the flip side of travel and restaurant stocks, we have the hotshots of 2020 i.e. the ‘work from home’ (WFH) stocks. In fact, there is even an exchange traded fund (ETF) tracking these WFH stocks. Direxion launched the Direxion Work From Home ETF in June 2020. Its top 10 holdings include stocks like Facebook (FB), cloud content management and file sharing service Box Inc (BOX), and cybersecurity company Proofpoint (PFPT). The fund is heavily weighted towards the U.S., but it does have a 4% exposure to China. However, while these stocks enjoyed the limelight during the pandemic, in 2021 the mood is notably more cautious. What will happen to companies like Zoom (ZM) when people return to the office? Luckily there is a strong indication that the online shift will not simply reverse post-pandemic. According to PwC, 54% of companies plan to make a remote work option permanent. Meanwhile, 43% of employed Americans spend at least some time working remotely. And although the risk-reward has undeniably shifted, there are still plenty of bulls out there. “We expect Zoom to deliver outsized top-line growth driven by better-than-expected renewals/retention, strong enterprise expansion and ARPU [average revenue per user] growth from cross/up-sell highlighted by Zoom Phones and Zoom Rooms,” Mizuho’s Siti Panigrahi said in a note recently. Our data shows that monthly unique visitors (MUVs) to zoom.us have stayed steady, even as on-site activity returns. Looking forward, upside could come from international and small account growth. Here you can see that the intra-quarter trend for global ex. U.S. is notably more bullish than the U.S. trend: Pro tip: Similarweb data is updated daily with only a 48-72 hour processing lag so users can immediately identify emerging players, top stocks for 2021 and key market trends. Track Zoom’s key digital data points here 4. Food delivery play: DoorDash On the same theme as WFH stocks, we have ‘stay-at-home’ stocks. As the name implies, these companies offer products or services that elevate the home experience. Think food delivery stocks, home fitness stocks, DIY home improvement stocks, activewear brands. You get the idea. As with WFH stocks, the key question here is the sustainability of growth. While U.K. rival Deliveroo’s IPO was something of a damp squib (to put it lightly), it’s worth keeping a close eye on online food delivery stock DoorDash (DASH), says Wells Fargo analyst Brian Fitzgerald. He has just upgraded the stock from hold to buy on the back of a robust first quarter performance. Shares rose 6% post-print after the company boosted its 2021 forecast for gross order value to $35 billion – $38 billion. “We think DASH’s beat and raise is large enough to offset the rotation to ‘value’ that has afflicted ‘growth’ stocks year-to-date” the Wall Street analyst commented. “Having de-rated to ~8x FY22 revenue, valuation is now sustainable in the context of our core restaurant business gross order value (GOV) CAGR of 15% through 2028, and likely cheap for investors willing to underwrite additional GOV growth from new verticals…” Although year-over-year (YoY) growth has inevitably paled due to the tough comparison to last year, our U.S. digital heatmaps show that DoorDash has by far the strongest online trends out of these food delivery websites: These heatmaps represent the YoY growth rates of websites within an industry over time. Blue cells represent a high YoY growth rate, and red cells represent a YoY reduction. Read our latest digital heat report: Digital Heat: Is Online Retail Already Out of Fashion? 5. Biden’s stimulus impact: Walmart It’s not all about COVID-19 when it comes to 2021’s top 10 investing trends. How will President Biden’s upcoming White House activity impact the stock market? So far, Biden boasts the best 100-day run for a first-term president in more than 75 years. “Biden’s first 100 days have already delivered the strongest post-election equity returns in at least 75 years, due to record fiscal stimulus and despite heavy use of Executive Orders,” cheered JPMorgan strategist John Normand in a recent note. “Not bad for some [former President Donald] Trump labeled as Sleepy Joe during the campaign” he added. In the short-term, Biden’s recent wave of $1,400 stimulus checks should bode well for retailers like American Eagle Outfitters (AEO) as well as footwear giants like Nike (NKE) and Foot Locker (FL). “Data available points to highly discretionary items, like footwear and accessories, taking share following stimulus payments,” comments KeyBanc analyst Matthew DeGulis. Looking further out, the U.S. President is likely to also focus on broader economic issues like income and wealth inequality. According to Bank of America strategist Savita Subramanian, off-price retailers and select quick-service restaurant chains are the winners here. “The current administration is focused on reinvigorating the economy and addressing social inequity rather than bolstering asset returns,” Subramanian wrote. “We recommend Discount over Luxury Retailers, supported by the potential for [minimum] wage hikes for low-income workers and tax hikes for wealthy individuals.” In particular, she singles out stocks like Walmart (WMT), Target (TGT) and Yum! Brands (YUM) (which owns KFC) as smart ways to play this trend. You can read more about Walmart and its impressive digital conversion data here. 6. Electric vehicle stocks: Ford Electric vehicle (EV) stocks are attracting more attention. According to Wedbush analyst Daniel Ives, the EV industry can grow into a $5 trillion market over the next decade. He told CNBC: “In my opinion EV stocks could be up another 40- 50% this year, given what we’re seeing in terms of a green tidal wave globally.” So how to play this investing trend? One option is to invest directly in EV stocks like Tesla (TSLA) or Chinese EV maker Nio (NIO). The second option is to invest in companies producing materials for EV batteries and EV batteries. And the third is to invest in auto giants that are also expanding into the EV space. Goldman Sachs recently highlighted several battery manufacturers that are reaping the rewards from the rapidly expanding EV market. These include more niche names like China’s Yunnan Energy, Belgian materials company Umicore, and “ultra-pure acetylene black” supplier Denka, as well as auto giants Volkswagen and Toyota. Meanwhile Similarweb’s digital heatmaps indicate notably strong share-of-market growth for Ford’s (F) website. Shares in Ford spiked on May 26 after the company revealed ambitious electric vehicle and profit plans at its investor day. Ford is targeting over $30 billion in EV investments through 2025, with electric generating 40% of sales by 2030. The news prompted an upgrade from RBC Capital’s Joseph Spak. “We believe Ford has laid out a credible plan to take 2025+ profitability higher via Ford Pro and Ford’s connected services opportunity. This should increase the upside earnings opportunity (even if we have it balanced by execution risk and some likely margin impact),” he explained. 7. Tech stock: Nvidia The tech-heavy Nasdaq index is currently up 7% on a year-to-date basis. That’s vs. 12% for the S&P 500. Partly this is due to investors rotating out of high-growth tech stocks, and returning to value stocks and cyclical names (see point 1 above). One stock bucking that trend is Nvidia (NVDA). Shares in Nvidia have surged 24% in the last month. While the company enjoyed a boost from crypto trading (with its CMP cards booking $155 million in revenue from CMP cards in its fiscal first quarter), gaming is the real star of the show. Gaming processors delivered $2.76 billion in revenue for Nvidia in FQ1, skyrocketing 106% YoY. “The gaming industry is really large, and what’s really exciting on top of that is that gaming is no longer just gaming. It’s infused into sports, e-sports… into art… into social. And so gaming has such a large cultural impact now. It’s the largest form of entertainment, and I think the experience we’re going through is going to last a while,” Nvidia CEO Jensen Huang said. The digital data reflects this bullish outlook. Looking at the top 10 traffic performers in the computer hardware industry in 2020/ 2021, Nvidia is clearly outperforming. While most of the top competitors’ share remained the same or shrunk a little, Nvidia’s traffic share nearly doubled from the end of 2019, to just over 12% in April 2021. There was a surge across marketing channels to nvidia.com in September 2020, the same month that the Nvidia RTX 3080 was released. 8. IPOs and SPACs Keep your eye out because some blockbuster IPOs are lined up for this year. And into the mix we also now have SPACs, or special purpose acquisition companies. You’re probably familiar with IPOs, but what about SPACs? “You can think of it like: an IPO is basically a company looking for money, while a SPAC is money looking for a company” explains Don Butler of Thomvest Ventures. For the ultimate guide into SPACs vs. IPOs click here. A SPAC merger enables a company to access the capital they need quickly and affordably compared to a traditional IPO. More than $30 billion was raised through SPACs in the first quarter of 2021. According to Factset, SPACs accounted for 55.7% of all IPOs in 2020; this figure jumped to 68.5% in 1Q21. Indeed, January saw the registration of several mega SPACs, including by Fifth Wall Ventures, Intel Chairman Omar Ishrak, and Gores Group. Controversial office space firm WeWork also announced a definitive merger agreement with SPAC BowX Acquisition Corp. on March 26. Once the merger completes, WeWork will become a public company, and receive $1.3 billion of cash, “to fund its growth plans into the future.” By taking the SPAC route, WeWork is effectively shielding itself from the full glare of the pre-IPO investigations. As Stanford professor Michael Klausner, told the New York Times, “There have been doubts raised about [WeWork’s] business model, and those doubts may be difficult to address in an IPO roadshow.” Luckily, we can use our datasets to track website visits from WeWork and rival companies. This is a key proxy for understanding WeWork’s demand trends. For instance, to log in to WeWork and connect to the office Wi-Fi, members must either go through the WeWork app or website. Read the full WeWork analysis, including key marketing strategy insights here IPOs On the IPO front, we’re keeping our eye on upcoming IPOs in 2021 such as Instacart, a grocery pickup and delivery service, that has retained Goldman Sachs to manage its IPO. The company experienced phenomenal growth during 2020 as global lockdowns drove home delivery demand through the roof. And of course, all eyes are on Robinhood, the hugely popular retail brokerage platform, which is expected to go this quarter. More on this below. 9. Meme stocks: Robinhood Targeting millennials, Robinhood is on a mission to “democratize finance for all.” And so far that has materialized through the rise of the infamous ‘meme stocks’ or ‘stonks.’ The online brokerage was at the epicenter of the surreal GameStop trading saga. It sparked outrage after banning, and then restricting, trades in stocks like GameStop (GME), Nokia, and BlackBerry. Right now all eyes are on theater operator AMC Entertainment (AMC), which has exploded a whopping 1,132% year-to-date. “This is not driven by institutional demand… it’s not trading on fundamentals. It’s a meme,” said Wedbush Securities analyst Michael Pachter. “It’s just silly” he added. Nonetheless, the mood is one of jubilation on the WallStreetBets Reddit chatroom, as the “AMC rocket ship” continues to surge higher (for now at least). Unsurprisingly, visitors to robinhood.com in the U.S. are growing at a tremendous rate, with almost 100 million monthly visits in February. And what’s more, users are notably more engaged than users of other retail investing platforms. Since Robinhood’s customers exclusively engage with its product online and on mobile apps, digital data provides a well-rounded picture of the company’s overall health. This is a highly anticipated IPO, and we can see why. Download the full Robinhood analysis 10. Crypto craze: Coinbase Welcome to one of 2021’s most fascinating investing trends: The rise and fall of cryptocurrencies. Bitcoin, for example, hit almost $65,000 per bitcoin in April, but then plunged all the way back down to $30,000. It’s currently trading at just over $35,000. Ethereum has suffered a similar fate. However it’s not all doom and gloom. Coinbase Global (COIN), the largest U.S. cryptocurrency brokerage, is one of the purest exposure to the crypto market for retail investors. The company makes commissions on crypto trades and has just gone public via a direct listing with a whopping $68 billion valuation. Its revenue, and therefore its value, is intrinsically linked to the volume and intensity of crypto trading. Goldman Sachs’ Will Nance has just kicked off his coverage of Coinbase with a buy rating and $306 price target. “While we believe the core business today offers an attractive growth profile with the potential to drive high levels of profitability, we see significant white space for new initiatives to drive more stable and recurring revenue streams to complement the core trading business over the longer term,” he told investors. Nance also stressed that Coinbase is not reliant on the price of bitcoin to be successful. “We believe investors are too focused on the impact of prices and less focused on the impact of volatility, which we believe is the bigger driver in the near term,” the analyst stated. We tracked Coinbase’s online performance over the last few months: Crypto sub-trends And we can’t ignore all the crypto sub-trends bubbling under the surface… We have bitcoin rival Dogecoin, which started life as a joke but is now worth billions of dollars. (“[Dogecoin] has dogs and memes, whereas the others do not,” trumpeted Tesla CEO Elon Musk on Twitter recently.) A similar Shiba Inu coin was, you guessed it, named after the Japanese dog breed Shiba Inu and is now a fierce Dogecoin rival. Other new currencies include DubaiCoin, which surged 1,000% in the 24 hours after its launch on false rumors that it was Dubai’s official digital currency. Meanwhile, SafeMoon is a decentralized finance token that charges sellers a 10% transaction fee in a bid to reduce volatility. It tells investors: “Remember, getting to the moon takes time and the longer you hold the more tokens you pick up.” Some of the most popular coinbase.com keywords are safemoon and doge. Similarweb data shows that traffic to the safemoon keyword has exploded by over 5,000% from February 2021 to April 2021. And last but not least, look out for non-fungible tokens, or NFTs. This uses blockchain tech to sell everything from digital art and memes to tweets and videos. NFTs can sell for millions of dollars; bids for Elon Musk’s NFT-themed tweet passed $1M before he canceled the sale. In case you’re wondering, this is the infamous artwork: Final thoughts To wrap things up, in the aftermath of 2020 investors must now navigate uncertain waters. There is a new President in the White House and the long-term trajectory of COVID-19 remains unknown. Given these challenging circumstances, investors can still find compelling opportunities in unexpected places. And the investing trends above reflect this. We have the rise-and-fall of cryptocurrency, while the ongoing IPO/ SPAC frenzy continues unabated. How will you find the best stocks for 2021? Let our alternative data guide you. Now it’s your turn Similarweb tracks over 100 million websites, 4.7 million apps, from 210+ industries. Use this valuable alternative dataset to generate more alpha, identify new investment opportunities, and strengthen your investment thesis. Try Similarweb for free by Harriet Lefton Investor Insights Manager Harriet, a Cambridge graduate and qualified U.K. lawyer, transitioned from metal market journalism to financial blogging, using digital data for investment insights. Related Topics: Stock Market This post is subject to Similarweb legal notices and disclaimers. Related Posts Stock Intelligence Top Tech Stocks and How to Track Their Performance Stock Market by Andrea Pash 8 Min. Feb 23, 2024 Stock Intelligence Game Changer: Alternative Data Evens the Playing Field Stock Market by Andrea Pash 3 Min. Oct 10, 2022 Stock Intelligence If You Build It: Home Depot vs. Lowes 1Q22 Pre-Earnings Insights Stock Market by Andrea Pash 3 Min. May 13, 2022 Stock Intelligence Big Tech Pre-Earnings Insights: Twitter, Apple, and Tesla? Stock Market by Andrea Pash 4 Min. Apr 22, 2022 Stock Intelligence Me and My Shadow: Up and Comers in the Online Dating Industry Stock Market by Andrea Pash 5 Min. Mar 22, 2022 Stock Intelligence And Just Like That: Peloton Pre-Earnings Insights Stock Market by Andrea Pash 3 Min. Feb 3, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "10 Best Stocks for 2021 for Strong Digital Growth [Updated June]"
    },
    {
      "level": "H2",
      "text": "1. Dividend aristocrat: McDonald’s"
    },
    {
      "level": "H2",
      "text": "2. Travel boom: Southwest Airlines"
    },
    {
      "level": "H2",
      "text": "3. Hybrid working: Zoom Video"
    },
    {
      "level": "H2",
      "text": "4. Food delivery play: DoorDash"
    },
    {
      "level": "H2",
      "text": "5. Biden’s stimulus impact: Walmart"
    },
    {
      "level": "H2",
      "text": "6. Electric vehicle stocks: Ford"
    },
    {
      "level": "H2",
      "text": "7. Tech stock: Nvidia"
    },
    {
      "level": "H2",
      "text": "8. IPOs and SPACs"
    },
    {
      "level": "H3",
      "text": "IPOs"
    },
    {
      "level": "H2",
      "text": "9. Meme stocks: Robinhood"
    },
    {
      "level": "H2",
      "text": "10. Crypto craze: Coinbase"
    },
    {
      "level": "H3",
      "text": "Crypto sub-trends"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    },
    {
      "level": "H3",
      "text": "Now it’s your turn"
    },
    {
      "level": "H3",
      "text": "Top Tech Stocks and How to Track Their Performance"
    },
    {
      "level": "H3",
      "text": "Game Changer: Alternative Data Evens the Playing Field"
    },
    {
      "level": "H3",
      "text": "If You Build It: Home Depot vs. Lowes 1Q22 Pre-Earnings Insights"
    },
    {
      "level": "H3",
      "text": "Big Tech Pre-Earnings Insights: Twitter, Apple, and Tesla?"
    },
    {
      "level": "H3",
      "text": "Me and My Shadow: Up and Comers in the Online Dating Industry"
    },
    {
      "level": "H3",
      "text": "And Just Like That: Peloton Pre-Earnings Insights"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Harriet Lefton"
}