{
  "url": "https://www.similarweb.com/blog/investor/stock-market/10-top-esg-stocks-sp-500/",
  "slug": "10-top-esg-stocks-sp-500",
  "title": "10 Top ESG Stocks In 2022 | Similarweb",
  "description": "Newsflash: ESG assets are worth trillions. And they are set to reach over $50 trillion by 2025. Here’s our pick of top ESG stocks to get you started.",
  "content": "HomeBlogStockStock Market10 Top ESG Stocks on the S&P 500 Stock Intelligence 10 Top ESG Stocks on the S&P 500 Get ESG risk report by Harriet Lefton , Investor Insights Manager 8 Min. July 25, 2021 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Newsflash: ESG assets are worth trillions and are on track to reach over $50 trillion by 2025. Bloomberg has calculated that’s a third of total global assets under management. Alternative data offers a powerful view into this fast-growing space. Here we’ll delve into ESG investing, and pinpoint ten of the most compelling ESG stocks in this fast-growing space, based on Similarweb data. ESG investing is guided by criteria that measure a company’s performance in three key areas: environmental, social, and governance. So as well as analyzing the balance sheet, you’re looking at the company’s impact on the world. Here is our list of top ESG stocks that should be on your radar now: 1. Nvidia (NVDA) In FY21, Nvidia’s philanthropic giving exceeded $25 million and supported over 5,000 nonprofits around the world. And it has pledged that 65% of its global energy use will be from renewable sources by 2025. It’s no surprise it has a stellar AAA rating from MSCI ESG Research. The ESG ranking service rates the semiconductor stock as a ‘leader’ in three separate categories (corporate governance, corporate behavior, and human capital development). It’s worth noting that NVDA is the second largest holding in the iShares ESG Advanced MSCI USA ETF. This exchange traded fund “seeks to track… U.S. companies that have a favorable environmental, social and governance rating while applying extensive screens for company involvement in controversial activities.” As you can see below, Nvidia is also achieving impressive digital growth. We can see how website visits to nvidia.com overtook intel.com in June 2020, and nvidia.com has managed to retain a considerable lead since. The gap is also widening with rival amd.com. 2. Salesforce (CRM) “We believe business is the greatest platform for social change” claims Suzanne DiBianca, Chief Impact Officer at Salesforce. And Salesforce is delivering. It already boasts net-zero emissions for its operations globally and offers customers a carbon neutral cloud. Like Nvidia, Salesforce currently holds the highest-possible ESG rating of AAA from MSCI. From a digital perspective, the CRM market leader is also worth a closer look. Its June web traffic of 107.5 million represented over 24% year-over-year (YoY) growth from last year’s 87.03 million visits. You can also track web visits to Salesforce’s developer platform (developer.salesforce.com) and login center (login.salesforce.com) for more in-depth insights. 3. Microsoft (MSFT) It may be one of the world’s biggest companies, but Microsoft has been carbon neutral globally since 2012. Its next stop? Becoming carbon negative by 2030. Impressively, Microsoft has scored a triple-A rating from MSCI for the last five years. According to MSCI, this top ESG stock is a leader in corporate governance, privacy and data security, and opportunities in clean tech. However, the company apparently remains an ‘ESG Laggard’ when it comes to corporate behavior. In terms of Microsoft’s digital outlook, its Teams video conferencing hub enjoyed notable success during the pandemic. Now Microsoft has announced Teams will be natively integrated into Windows 11 at launch – pushing its Skype offering out into the ethersphere. Teams.microsoft.com shows impressive audience engagement metrics vs. rivals zoom.us and meet.google.com. Its average visit duration comes in at over 10 minutes, while its bounce rate is relatively low. Delve deeper. See the latest digital trends for teams.microsoft.com now 4. Cisco (CSCO) Equipment maker Cisco has a dedicated ESG hub, which it describes as an expanded way to enhance ESG reporting and transparency. It also releases an annual ESG report crammed with stats and impressive sound-bites. “Now more than ever, we believe that technology can be used for good to provide an opportunity for all, make a meaningful impact, and bring about a future that is better and brighter than the reality of today,” wrote CEO Chuck Robbins in its 2020 report. Luckily CSG is putting its money where its mouth is. It has an AA rating from MSCI. We analyzed Cisco’s digital performance and found that: India is an important market for cisco.com. In May 2021, India represented almost 11% of cisco.com’s traffic share, surging 12% from the previous month. India is now second-only to the U.S. in terms of traffic share (with the U.S. delivering 34% of Cisco’s overall website traffic). That makes this a key ESG stock to keep an eye on for the long-term. Want to know what to look out for in each sector? Get our free ESG risk report. 5. Texas Instruments (TXN) Dallas-based semiconductor manufacturer Texas Instruments is a top ESG stock to watch. It’s also a lucrative dividend pick with a yield of 2.1%. According to MSCI: “Texas Instruments is a leader among 73 companies in the semiconductors & semiconductor equipment industry.” In fact, MSCI upgraded the company from AA to AAA in February 2021. Looking forward, TXN is now busy working towards an ambitious five-year goal to: Reduce absolute Scope 1 and 2 GHG emissions by 25% by the end of 2025. Reduce energy intensity by 50% by the end of 2025. Encouragingly, our data shows that visitors to rival websites are far more likely to cross-browse with the TXN website than the reverse. As you can see below, 32% of visitors to onsemi.com visited ti.com on the same day, but only 6% of ti.com visitors also visited onsemi.com. This is a bullish sign of strong brand awareness. 6. BestBuy (BBY) Triple A for BestBuy, cheers MSCI Research. The firm ranks the consumer electronics retailer as a leader in no less than five ESG categories, including supply chain labor standards. You can see below some of the measures that BestBuy has taken to improve its ESG ranking (from its 2020 annual report): From a digital angle, BestBuy is also winning over consumers. Over 40% of BestBuy’s U.S. sales came from online last year and this upward trend has continued. In the first quarter of FY22, BBY’s U.S. online revenue of $3.60 billion increased 7.6% on a comparable basis, mainly due to higher average order values and increased traffic. The chart below shows visits to bestbuy.com that ended in a sale (i.e. convert to a transaction). It is a critical indicator of online revenue. Note how the converted visits post-pandemic are considerably higher than pre-pandemic levels. BBY scored 2.007M converted visits in June 2021, up 80% from June 2019 i.e. pre-pandemic. 7. Home Depot (HD) The largest home improvement retailer in the U.S. isn’t exactly under-the-radar. But did you know Home Depot is also one of the top ESG stocks out there? The company recently revealed that more than 50% of its new hires were ethnically diverse. Meanwhile, Home Depot has pledged to reduce carbon dioxide emissions by 50% by 2035. It has also committed to eliminating expanded polystyrene (EPS) foam and polyvinyl chloride (PVC) film from its private-brand products by 2023. So watch this space. When it comes to Home Depot’s digital outlook, we can see that it holds a 36% share of market (SoM) out of the companies featured in our digital heatmap below. It also shows that the company’s SoM increased 1% YoY – in sharp contrast to rival wayfair.com, which saw its SoM decline 2.2% over the same period. 8. Teladoc Health (TDOC) As its name implies, Teladoc Health is a telemedicine and virtual healthcare company based in the U.S. TDOC benefited from the pandemic, and its share price surged accordingly. With lockdowns easing and on-site activity returning, it is aiming to stay in the limelight. In June 2020, MSCI upgraded its rating on Teladoc Health from ‘average’ to ‘leader.’ That’s thanks to its robust progress in respect of corporate behavior, and privacy and data security. But it still has room for improvement in carbon emissions and human capital development. Below you can see TDOC’s monthly visit trends over the last few months. It maintains a strong lead against rivals including doctorsondemand.com and amwell.com. As you would expect, Teladoc Health saw the most significant spike in traffic during the pandemic and at the end of 2020. And it has managed to hang on to this traffic: in June 2021 visits were up 2.5% vs. June 2020. 9. Applied Materials (AMAT) Semiconductor equipment company Applied Materials has an impressive AA rating from MSCI. It also has an ambitious goal of 100% renewable electricity use in the U.S. by 2022 and globally by 2030. To achieve this, AMAT is sourcing renewable energy with a triple-pronged attack: On-site solar power generation at its own facilities Virtual power purchase agreements and certificates for solar, wind, and other renewable energy generating projects Direct purchase of renewable energy from a utility provider At the same time, we found that visits to appliedmaterials.com in June 2021, exploded 55% YoY, and 25% from May 2021. Similarly, unique visitors are up 53% YoY. As unique visitors measures new visitors to the site (rather than returning visitors), this indicates that brand awareness and reach is quickly growing. Pro tip: Unique Visitors is defined as the number of people who visit a web location during a specific period of time. This is a key metric for understanding the exposure and reach of a website. 10. Lam Research (LRCX) Last but not least in our top ESG stocks run-through we have another semiconductor equipment name: Lam Research. Like AMAT, LRCX also scores a strong AA MSCI rating. Only last month, Lam Research closed a whopping $1.5 billion sustainability-linked credit facility, which it says demonstrates the importance of its ESG goals. Over the credit facility term, Lam will receive a pricing adjustment if the company is above or below performance targets around annual energy savings and maintaining its high standard of employee safety. According to Mizuho Securities analyst Vijay Rakesh, semiconductor equipment suppliers like Applied Materials and Lam Research are “key enablers” for the growth of the AI chip market. He says these companies will provide the parts for making next-generation AI chips. What’s more, Rakesh believes the AI chip market could grow to $70 billion, or more than 10% of total semiconductor sales, by 2025. That’s a sharp increase from $23 billion in sales in 2020, or about 5% of the broader semiconductor market. Stay ahead of the market. You can track LRCX’s Q3 online performance here. Top ESG Stocks: Key takeaways Initially, ESG investments had a reputation for generating limited returns. But that’s no longer the case. The data actually suggests there is an intrinsic relationship between a company’s ESG performance and long-term financial health. For instance, an oil spill or emissions scandal can quickly rock a company’s stock price, resulting in billions of dollars in losses. In The Journal of Applied Corporate Finance, Dan Hanson and Rohan Dhanuka write that “there seems to be clear evidence that companies with high non-financial indicators of quality seem to perform significantly better on market and accounting-based metrics.” Here we highlighted our top 10 ESG stocks with an MSCI rating of AA or AAA. It’s interesting to see a major representative of tech stocks on the list. But as with any type of investment, you’ll also want to do your research on stocks before buying. Alternative data can provide you with details that more general reports may miss. You can track the digital data of stocks you are interested in using Similarweb’s Investor Intelligence. We process billions of digital signals daily which allows us to surface insights on a 48-72 hour lag. Keep your finger on the pulse Try Similarweb for free now by Harriet Lefton Investor Insights Manager Harriet, a Cambridge graduate and qualified U.K. lawyer, transitioned from metal market journalism to financial blogging, using digital data for investment insights. Related Topics: Stock Market This post is subject to Similarweb legal notices and disclaimers. Related Posts Stock Intelligence Top Tech Stocks and How to Track Their Performance Stock Market by Andrea Pash 8 Min. Feb 23, 2024 Stock Intelligence Game Changer: Alternative Data Evens the Playing Field Stock Market by Andrea Pash 3 Min. Oct 10, 2022 Stock Intelligence If You Build It: Home Depot vs. Lowes 1Q22 Pre-Earnings Insights Stock Market by Andrea Pash 3 Min. May 13, 2022 Stock Intelligence Big Tech Pre-Earnings Insights: Twitter, Apple, and Tesla? Stock Market by Andrea Pash 4 Min. Apr 22, 2022 Stock Intelligence Me and My Shadow: Up and Comers in the Online Dating Industry Stock Market by Andrea Pash 5 Min. Mar 22, 2022 Stock Intelligence And Just Like That: Peloton Pre-Earnings Insights Stock Market by Andrea Pash 3 Min. Feb 3, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "10 Top ESG Stocks on the S&P 500"
    },
    {
      "level": "H2",
      "text": "1. Nvidia (NVDA)"
    },
    {
      "level": "H2",
      "text": "2. Salesforce (CRM)"
    },
    {
      "level": "H2",
      "text": "3. Microsoft (MSFT)"
    },
    {
      "level": "H2",
      "text": "4. Cisco (CSCO)"
    },
    {
      "level": "H2",
      "text": "5. Texas Instruments (TXN)"
    },
    {
      "level": "H2",
      "text": "6. BestBuy (BBY)"
    },
    {
      "level": "H2",
      "text": "7. Home Depot (HD)"
    },
    {
      "level": "H2",
      "text": "8. Teladoc Health (TDOC)"
    },
    {
      "level": "H2",
      "text": "9. Applied Materials (AMAT)"
    },
    {
      "level": "H2",
      "text": "10. Lam Research (LRCX)"
    },
    {
      "level": "H2",
      "text": "Top ESG Stocks: Key takeaways"
    },
    {
      "level": "H3",
      "text": "Top Tech Stocks and How to Track Their Performance"
    },
    {
      "level": "H3",
      "text": "Game Changer: Alternative Data Evens the Playing Field"
    },
    {
      "level": "H3",
      "text": "If You Build It: Home Depot vs. Lowes 1Q22 Pre-Earnings Insights"
    },
    {
      "level": "H3",
      "text": "Big Tech Pre-Earnings Insights: Twitter, Apple, and Tesla?"
    },
    {
      "level": "H3",
      "text": "Me and My Shadow: Up and Comers in the Online Dating Industry"
    },
    {
      "level": "H3",
      "text": "And Just Like That: Peloton Pre-Earnings Insights"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Harriet Lefton"
}