{
  "url": "https://www.similarweb.com/blog/investor/stock-market/buzzfeed-spac/",
  "slug": "buzzfeed-spac",
  "title": "BuzzFeed SPAC: Here’s What You Need to Know | Similarweb",
  "description": "BuzzFeed’s on track to go public in December. Here’s what you need to know ahead of the SPAC. We cover the latest news and alternative data insights. Read now.",
  "content": "HomeBlogStockStock MarketBuzzFeed SPAC: Here’s What You Need to Know Stock Intelligence BuzzFeed SPAC: Here’s What You Need to Know Get BuzzFeed data by Caroline Ido , Content Editor 4 Min. November 23, 2021 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic BuzzFeed could hit markets as early as the first week of December if all goes smoothly. The digital media giant plans to merge with blank-check company 890 5th Avenue Partners. Shareholders will convene for a vote on Dec. 2. If the BuzzFeed SPAC goes through, The New York-based publisher will also snap up the global youth network Complex Networks as part of the deal, which it claims boasts “unparalleled engagement among millennials and Gen Z.” What can you expect when BZFD begins trading on the Nasdaq? We unpack the latest news and the alternative data below. The revenue picture The most striking part of the BuzzFeed SPAC story from the initial announcement was it’s implied $1.5 billion valuation. After all, in July 2020, BuzzFeed laid off 50 employees as it struggled to replace lucrative revenue deals lost during the pandemic. However, in Q221, revenue surged 51% YoY thanks to accelerating ad growth and commerce revenues. And Q3 2021, revenue continued to climb due to display ads. CEO Jonah Peretti explained, “Our impressive Q3 results highlight the strength of our diversified, cross-platform business model. The 39% year-on-year improvement in our advertising revenue drove another quarter of significant topline growth that continues to translate into improved profitability.” The powerful growth also meant doubling of EBITDA year-over-year. Turning to Similarweb’s data, which processes billions of digital signals every day, we pulled the latest digital insights on BuzzFeed’s website performance. Ad platform popularity It comes as no surprise that there was also a clear spike in traffic to BuzzFeed’s advertiser platform, which we can monitor via the site advertise.buzzfeed.com. As the screenshot below shows, despite the pullback from July – October, visits to the site remain significantly higher than at the start of the year. The difference is particularly stark if you look further back and compare October 2021 to January 2020. Nevertheless, investors should keep a close eye on this trendline, which has been inching lower since July 2021. Other key metrics to monitor include traffic and engagement. After all, advertiser interest is determined by traffic trends, and also audience engagement. When it comes to online advertising, the greater the audience and the more engaged it is, the more valuable the ad space becomes. Tweet this Worldwide traffic trends We use monthly unique visitors (MUVs) as a powerful indication of the growth and popularity of a specific website. Note that unique visitors do not include repeat visits which enables us to assess the actual reach of a website. Here we compared the traffic to buzzfeed.com to some of its key rivals, including vice.com, vox.com, and mashable.com. Bear in mind that BuzzFeed snapped up huffpost.com from Verizon Media in February 2021. Across the entire competitive set, we see website traffic worldwide has been trending down since 2019. While traffic to buzzfeed.com has trended almost consistently lower over the last two years, despite peaks in traffic in April 2020 and the end of 2020, it hasn’t fallen as dramatically as others sites in the group. Monthly unique visitors in October 2021 were down 26% in comparison to October 2019. Huffpost.com traffic experienced an even sharper MUV plunge of -28% over this same two-year period, while vox.com saw MUVs fall -34%, vice.com -48%, and mashable.com over -44%. So while traffic is trending down worldwide, BuzzFeed is still beating its competition. U.S. traffic trends Honing in on U.S., we see that while traffic patterns still show the same downward trend. However, the degree of deceleration looks to be slowing down on a YoY basis over the past few months. In the chart below you can see that in October 2021, U.S. YoY MUVs came in at -11% YoY easily, which shows improvement from April 2021 YoY decline of -25%. Engagement metrics Here we measure up the engagement metrics for five of the key digital media companies. Encouragingly, BuzzFeed takes the crown on every single metric, except for unique visitor ratio and bounce rate where BuzzFeed’s own HuffPost takes first place. If we break this down a bit further, we can see how average visit duration (one of the most important indicators of audience engagement) tracks over time for BuzzFeed vs. rivals. Note how the average visit duration is considerably longer for both BuzzFeed and HuffPost vs. Vox, Vice, and Mashable. Bottom line What can you expect for the BuzzFeed SPAC? Keep a close eye on the industry at large to track the latest trends. Using Similarweb Investor Intelligence, you can surface powerful insights to monitor any company’s performance in near real-time and invest in stocks with greater confidence. Join our Investor Newsflash Don't miss out! Optimize your stock research with our weekly newsletter Sign me up by Caroline Ido Content Editor Caroline, with a background in investing analysis and content editing, holds degrees from Northeastern and Columbia. She enjoys cooking, coffee, and walking. Related Topics: Stock Market This post is subject to Similarweb legal notices and disclaimers. Related Posts Stock Intelligence Top Tech Stocks and How to Track Their Performance Stock Market by Andrea Pash 8 Min. Feb 23, 2024 Stock Intelligence Game Changer: Alternative Data Evens the Playing Field Stock Market by Andrea Pash 3 Min. Oct 10, 2022 Stock Intelligence If You Build It: Home Depot vs. Lowes 1Q22 Pre-Earnings Insights Stock Market by Andrea Pash 3 Min. May 13, 2022 Stock Intelligence Big Tech Pre-Earnings Insights: Twitter, Apple, and Tesla? Stock Market by Andrea Pash 4 Min. Apr 22, 2022 Stock Intelligence Me and My Shadow: Up and Comers in the Online Dating Industry Stock Market by Andrea Pash 5 Min. Mar 22, 2022 Stock Intelligence And Just Like That: Peloton Pre-Earnings Insights Stock Market by Andrea Pash 3 Min. Feb 3, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "BuzzFeed SPAC: Here’s What You Need to Know"
    },
    {
      "level": "H2",
      "text": "The revenue picture"
    },
    {
      "level": "H2",
      "text": "Ad platform popularity"
    },
    {
      "level": "H2",
      "text": "Worldwide traffic trends"
    },
    {
      "level": "H2",
      "text": "U.S. traffic trends"
    },
    {
      "level": "H2",
      "text": "Engagement metrics"
    },
    {
      "level": "H2",
      "text": "Bottom line"
    },
    {
      "level": "H3",
      "text": "Top Tech Stocks and How to Track Their Performance"
    },
    {
      "level": "H3",
      "text": "Game Changer: Alternative Data Evens the Playing Field"
    },
    {
      "level": "H3",
      "text": "If You Build It: Home Depot vs. Lowes 1Q22 Pre-Earnings Insights"
    },
    {
      "level": "H3",
      "text": "Big Tech Pre-Earnings Insights: Twitter, Apple, and Tesla?"
    },
    {
      "level": "H3",
      "text": "Me and My Shadow: Up and Comers in the Online Dating Industry"
    },
    {
      "level": "H3",
      "text": "And Just Like That: Peloton Pre-Earnings Insights"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Caroline Ido"
}