{
  "url": "https://www.similarweb.com/blog/investor/stock-market/cargurus-ipo/",
  "slug": "cargurus-ipo",
  "title": "Automotive Marketing Strategies: Behind the CarGurus IPO | Similarweb",
  "description": "CarGurus launched its IPO this week. Find out the automotive marketing strategies behind this auto information giant's success.",
  "content": "HomeBlogStockStock MarketAutomotive Marketing Strategies - Behind the CarGurus IPO Stock Intelligence Automotive Marketing Strategies – Behind the CarGurus IPO Start your free trial by Liron Hakim Bobrov , Marketing Insights Manager at Similarweb 2 Min. October 17, 2017 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Last Thursday, CarGurus made its stock market debut with an IPO that immediately raised over $150M and then saw its share price increase by 72% in the first 24 hours of trading. The site, cargurus.com, is the most popular among its competitive set, receiving 84% more traffic than second-place autotrader.com. What are the automotive marketing strategies that helped CarGurus to a successful IPO? There are several indicators that the brand targets a younger audience than its competitors, with a strong mobile presence both web-based and through its mobile app. The marketing mix of traffic sources to cargurus.com also indicates an emphasis on millennial users with improved branded search and an increasing proportion of social traffic. Traffic As a company focused on lead generation, traffic is a key indicator of brand performance. Over the past two years, cargurus.com has maintained an average of 48M monthly visits, 84% higher than that of its next competitor- autotrader.com at 26M. The upwards trend is clear – traffic to cargurus.com increased by 26.7% this September (compared to 2015), while all three of its next largest competitors – autotrader.com, edmunds.com and cars.com decreased over time. How have they managed to not only maintain but also improve their place in a declining market? It appears that cargurus.com is going after mobile-heavy millennial users. The breakdown of mobile vs. desktop traffic shows that cargurus.com receives nearly 80% of its traffic from mobile, while competitor sites all get around 60% mobile traffic. Apps While a strong mobile web presence is important, app performance is also a strong indication of brand performance and good app engagement is another sign of a younger, more engaged set of users. Below, we see that CarGurus is not only the second-most popularly installed app in its space, it also has the highest engagement ratings. Interestingly, the brand is actually battling on two fronts – while cargurus.com’s web presence is threatened by autotrader.com and edmunds.com, in apps, its main competition comes mostly from smaller sites like TrueCar: The Car Buying App – Find New & Used Cars and Cars.com – Find Cars and Trucks For Sale alongside Autotrader – Cars For Sale. As seen below, over the past two years CarGurus has overtaken both Autotrader and TrueCar‘s place in current installs and is closing in on Cars.com. Sources Finally, looking at cargurus.com’s sources reveals yet another strategy for growth. Despite being the most popular car-buying site, cargurus.com actually gets most of its website traffic from organic search – similar to edmunds.com. Unlike edmunds.com however, nearly 40% of the site’s search traffic is branded, compared to just 20% for edmunds.com. Cargurus.com, however, doesn’t rely solely on organic search and has slightly diversified its digital marketing strategy over time. Below, we see that over the past two years, the site has actually decreased the share of organic search – down 11 percentage points from 54.3% in Q3 2015 to 43.2% in Q3 2017. In this time, traffic from social media has significantly improved – up from 1.4% of the site’s traffic to 5.8% in Q3 2017. This is another indication of the site’s appeal to younger, mobile and social-savvy audience. by Liron Hakim Bobrov Marketing Insights Manager at Similarweb Liron, with over 5 years of experience and an MBA from Tel Aviv University, specializes in content management, data analysis, and industry insights. Related Topics: Stock Market This post is subject to Similarweb legal notices and disclaimers. Related Posts Stock Intelligence Top Tech Stocks and How to Track Their Performance Stock Market by Andrea Pash 8 Min. Feb 23, 2024 Stock Intelligence Game Changer: Alternative Data Evens the Playing Field Stock Market by Andrea Pash 3 Min. Oct 10, 2022 Stock Intelligence If You Build It: Home Depot vs. Lowes 1Q22 Pre-Earnings Insights Stock Market by Andrea Pash 3 Min. May 13, 2022 Stock Intelligence Big Tech Pre-Earnings Insights: Twitter, Apple, and Tesla? Stock Market by Andrea Pash 4 Min. Apr 22, 2022 Stock Intelligence Me and My Shadow: Up and Comers in the Online Dating Industry Stock Market by Andrea Pash 5 Min. Mar 22, 2022 Stock Intelligence And Just Like That: Peloton Pre-Earnings Insights Stock Market by Andrea Pash 3 Min. Feb 3, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Automotive Marketing Strategies – Behind the CarGurus IPO"
    },
    {
      "level": "H2",
      "text": "Traffic"
    },
    {
      "level": "H2",
      "text": "Apps"
    },
    {
      "level": "H2",
      "text": "Sources"
    },
    {
      "level": "H3",
      "text": "Top Tech Stocks and How to Track Their Performance"
    },
    {
      "level": "H3",
      "text": "Game Changer: Alternative Data Evens the Playing Field"
    },
    {
      "level": "H3",
      "text": "If You Build It: Home Depot vs. Lowes 1Q22 Pre-Earnings Insights"
    },
    {
      "level": "H3",
      "text": "Big Tech Pre-Earnings Insights: Twitter, Apple, and Tesla?"
    },
    {
      "level": "H3",
      "text": "Me and My Shadow: Up and Comers in the Online Dating Industry"
    },
    {
      "level": "H3",
      "text": "And Just Like That: Peloton Pre-Earnings Insights"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Liron Hakim Bobrov"
}