{
  "url": "https://www.similarweb.com/blog/investor/stock-market/deliveroo-ipo-uk/",
  "slug": "deliveroo-ipo-uk",
  "title": "Deliveroo IPO: Can it Deliver? | Similarweb",
  "description": "Deliveroo’s IPO is set to be the biggest on the London IPO in almost a decade. Find out what the digital data says about Deliveroo. Read now.",
  "content": "HomeBlogStockStock MarketDeliveroo IPO: Can It Deliver More Than Just Your Lunch? Stock Intelligence Deliveroo IPO: Can It Deliver More Than Just Your Lunch? Explore More by Liat Piazza , Investor Insights Manager 2 Min. March 22, 2021 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic The U.K.-based online food delivery company is going public at the end of the month. The Deliveroo IPO is expected to be the biggest Initial Public Offering (IPO) on the London Stock Exchange (LSE) in almost a decade. Backed by Amazon, and seeking a valuation of £8.8 billion ($12 billion), this IPO is something to get excited about. According to CNBC, Deliveroo says it will use the proceeds of the IPO to continue to invest in innovation and push deeper into on-demand grocery deliveries. With all this excitement, let’s see what our alternative data has to say about Deliveroo’s online performance. Key takeaways: Deliveroo is seeing strong year-over-year (YoY) growth in site visits (79% in 1Q21) Just-eat.co.uk has the largest online market share (SoM) in the U.K. and continues to gain share Deliveroo.co.uk has stronger brand recognition than just-eat.co.uk The U.K. food delivery market Deliveroo is capitalizing on a growing food delivery market. The sector as a whole is experiencing strong growth, largely due to the coronavirus pandemic, and all players globally are seeing the benefits. In the U.K., Deliveroo’s core market, the industry average website traffic growth to food delivery sites was 78% YoY in the week ending March 12. Deliveroo vs. the competition In the U.K. just-eat.co.uk dominates the food delivery market, with more monthly visits to its site than deliveroo.co.uk and ubereats.com combined. Deliveroo may have increased competition in the U.K., but its traffic growth looks promising. Despite flat YoY growth in Q1 20 (-0.2%), YoY growth in site visits accelerated in 2020, reaching 79% YoY in 1Q21, a 10 percentage point (ppt) increase from the previous quarter. Brand strength beating the competition Never mind the seemingly smaller SoM than just-eat.co.uk, Deliveroo’s brand is robust. Deliveroo.co.uk received more than 82% of visits directly and from organic search in the U.K. in 1Q21, indicating solid brand strength. In comparison just-eat.co.uk is more reliant on paid advertisement, receiving 15.4% of traffic from paid search in 1Q21, 4.7 ppt higher than deliveroo.co.uk. Download the Full Deliveroo Analysis by Liat Piazza Investor Insights Manager Liat creates data-driven content for the Similarweb Investor Solution, focusing on digital performance across various sectors. Related Topics: Stock Market This post is subject to Similarweb legal notices and disclaimers. Related Posts Stock Intelligence Top Tech Stocks and How to Track Their Performance Stock Market by Andrea Pash 8 Min. Feb 23, 2024 Stock Intelligence Game Changer: Alternative Data Evens the Playing Field Stock Market by Andrea Pash 3 Min. Oct 10, 2022 Stock Intelligence If You Build It: Home Depot vs. Lowes 1Q22 Pre-Earnings Insights Stock Market by Andrea Pash 3 Min. May 13, 2022 Stock Intelligence Big Tech Pre-Earnings Insights: Twitter, Apple, and Tesla? Stock Market by Andrea Pash 4 Min. Apr 22, 2022 Stock Intelligence Me and My Shadow: Up and Comers in the Online Dating Industry Stock Market by Andrea Pash 5 Min. Mar 22, 2022 Stock Intelligence And Just Like That: Peloton Pre-Earnings Insights Stock Market by Andrea Pash 3 Min. Feb 3, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Deliveroo IPO: Can It Deliver More Than Just Your Lunch?"
    },
    {
      "level": "H2",
      "text": "The U.K. food delivery market"
    },
    {
      "level": "H2",
      "text": "Deliveroo vs. the competition"
    },
    {
      "level": "H2",
      "text": "Brand strength beating the competition"
    },
    {
      "level": "H3",
      "text": "Top Tech Stocks and How to Track Their Performance"
    },
    {
      "level": "H3",
      "text": "Game Changer: Alternative Data Evens the Playing Field"
    },
    {
      "level": "H3",
      "text": "If You Build It: Home Depot vs. Lowes 1Q22 Pre-Earnings Insights"
    },
    {
      "level": "H3",
      "text": "Big Tech Pre-Earnings Insights: Twitter, Apple, and Tesla?"
    },
    {
      "level": "H3",
      "text": "Me and My Shadow: Up and Comers in the Online Dating Industry"
    },
    {
      "level": "H3",
      "text": "And Just Like That: Peloton Pre-Earnings Insights"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Liat Piazza"
}