{
  "url": "https://www.similarweb.com/blog/investor/stock-market/earnings-insights-q2-2020-nflx/",
  "slug": "earnings-insights-q2-2020-nflx",
  "title": "Earnings Insights: NFLX, JPM, DPZ, WFC, C, OCDO | Similarweb",
  "description": "Similarweb's digital earnings insights allow investors an early peek at key companies' performance ahead of their upcoming earnings report.",
  "content": "HomeBlogStockStock MarketEarnings Insights Q2 2020: NFLX, JPM, DPZ, WFC, C, OCDO Stock Intelligence Earnings Insights Q2 2020: NFLX, JPM, DPZ, WFC, C, OCDO Start your free trial by Clement Thibault , Content Marketing Manager, Similarweb 3 Min. July 12, 2020 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Earnings season is here, and so are Similarweb’s earnings insights for companies reporting in the upcoming week. Every week, we’ll publish relevant digital data points ahead of key earnings reports. This week officially opens up earnings season, with expected reports from Netflix, Dominos, JPMorgan, Citigroup, Wells Fargo, and Ocado. NFLX Earnings Insights Netflix Earnings Date: July 16, 2020 Similarweb has recently built a new backtest model using desktop page-level sign-up and cancellation page-level traffic data which shows there will be stronger YoY International growth in Q2 than there was in Q1 – the data used for this model is part of a new Similarweb data set. The engagement rate of Netflix’s US desktop users is trending up, with 18.5 visits on average per month per user in Q2, 15.9% more visits than in Q2 2019. Netflix’s US Monthly Unique Visitors (MUVs) on desktop grew 2.1% QOQ, and 0.9% YOY. DPZ Earnings Insights Dominos Earnings Date: July 16, 2020 US desktop visits to Dominos.com fell 3.1% YOY in Q2 2020 but rose 2.5% QOQ. In comparison, US desktop visits to Pizza Hut fell 13.8% YOY in Q2, indicating that while Dominos lost traffic YOY, its digital performance remained strong compared to one of its biggest competitors. Using segment analysis, we can determine that US desktop visits to Dominos URLs containing the string /confirmation/ stayed flat QOQ, with a slight decrease of 0.1%, indicating the number of desktop orders stayed consistent from the previous quarter. JPM Earnings Insights JPMorgan Chase Earnings Date: July 14, 2020 US desktop visits to autofinance.chase.com, Chase’s subdomain for auto loans and financing, fell 28.1% YOY in Q2. QOQ, visits to the subdomain fell 16.1%. US desktop visits to applynow.chase.com, Chase’s credit card application subdomain, fell 51.1% YOY, from an average of 919K monthly visits in Q2 2019 to an average of 449K monthly visits in Q2 2020. On the positive side, worldwide visits to am.jpmorgan.com – JPMorgan’s asset management subdomain – rose 57% YOY in Q2, continuing a strong growth trend from Q1 2020, when visits increased by 38.4% YOY. C Earnings Insights Citigroup Earnings Date: July 14, 2020 US monthly unique visitors (MUVs) to online.citi.com declined by 9.7% YOY in Q2 2020, as the website lost 1 million MUVs when compared to Q2 2019, Citibank’s strongest quarter in terms of MUVs. US desktop visits to citicards.com, Citibank’s URL dedicated to credit card applications fell 25.9% YOY in Q2. The number of visits in June 2020 to the URL was the lowest in at least two years. QOQ, visits to this URL fell 17.6%, after falling 10.4% in Q1. Citibank uses the unique string “open-cs-acct” in URLs to process new account applications. Using segment analysis, we can see that traffic to URLs containing this specific string is rising. In Q2, there were on average 91K monthly visits to URLs containing this string, largely due to a 27.6% MOM increase in June. WFC Earnings Insights Wells Fargo Earnings Date: July 14, 2020 US desktop visits to wellsfargo.com hit an all-time high in Q2, with an average of 85 million visits per month for the quarter. Online enrollment to Wells Fargo services followed suit, with 5 million visits to oam.wellsfargo.com, the subdomain used to sign up for online enrollment. This represents a growth of 28.8% YOY, the strongest growth in the past 4 quarters. Interest in online mortgage applications was strong in Q2. Using segment analysis, we see that US desktop visits to Wells Fargo URLs containing “mortgage” and “apply” rose 30% YOY. US desktop visits to wellsfargoadvisors.com, Wells Fargo’s dedicated advisory services URL remained high in Q2 after hitting an all-time high in Q1. The 1.26 million US desktop visits represent a drop of 4.4% QOQ but impressive growth of 20% YOY. OCDO Earnings Insights Ocado Earnings Date: July 14, 2020 Due to COVID-19, online grocery shopping worldwide experienced a surge in demand, including Ocado. UK MUVs to Ocado increased by 29.1% YOY in Q2. However, Ocado experienced a massive slowdown in demand in June, as UK MUVs increased by only 3.1% YOY for the month. The number of UK MUVs to accounts.ocado.com grew by 128.7% YOY in Q2, with on average 429K unique visitors from the UK accessing this customer login URL. Segment analysis allows us to see that UK visits to URLs containing /checkout/ rose 69.1% YOY in Q2 2020. Segment analysis also enables us to observe seasonal trends in website traffic. Over the Easter period, Ocado totaled 187K visits from the UK to URLs containing /easter/, less than the 214K visits to /easter/ URLs in 2019. Next Week’s Earnings Insights Next week, we’ll be covering SNAP, MSFT, LUV, T, TWTR, and ASOS. Have a great week! by Clement Thibault Content Marketing Manager, Similarweb Clement analyzes digital trends and provides insights using Similarweb's data, aiming to highlight the value of alternative data for investors. Related Topics: Stock Market This post is subject to Similarweb legal notices and disclaimers. Related Posts Stock Intelligence Top Tech Stocks and How to Track Their Performance Stock Market by Andrea Pash 8 Min. Feb 23, 2024 Stock Intelligence Game Changer: Alternative Data Evens the Playing Field Stock Market by Andrea Pash 3 Min. Oct 10, 2022 Stock Intelligence If You Build It: Home Depot vs. Lowes 1Q22 Pre-Earnings Insights Stock Market by Andrea Pash 3 Min. May 13, 2022 Stock Intelligence Big Tech Pre-Earnings Insights: Twitter, Apple, and Tesla? Stock Market by Andrea Pash 4 Min. Apr 22, 2022 Stock Intelligence Me and My Shadow: Up and Comers in the Online Dating Industry Stock Market by Andrea Pash 5 Min. Mar 22, 2022 Stock Intelligence And Just Like That: Peloton Pre-Earnings Insights Stock Market by Andrea Pash 3 Min. Feb 3, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Earnings Insights Q2 2020: NFLX, JPM, DPZ, WFC, C, OCDO"
    },
    {
      "level": "H2",
      "text": "NFLX Earnings Insights"
    },
    {
      "level": "H2",
      "text": "DPZ Earnings Insights"
    },
    {
      "level": "H2",
      "text": "JPM Earnings Insights"
    },
    {
      "level": "H2",
      "text": "C Earnings Insights"
    },
    {
      "level": "H2",
      "text": "WFC Earnings Insights"
    },
    {
      "level": "H2",
      "text": "OCDO Earnings Insights"
    },
    {
      "level": "H2",
      "text": "Next Week’s Earnings Insights"
    },
    {
      "level": "H3",
      "text": "Top Tech Stocks and How to Track Their Performance"
    },
    {
      "level": "H3",
      "text": "Game Changer: Alternative Data Evens the Playing Field"
    },
    {
      "level": "H3",
      "text": "If You Build It: Home Depot vs. Lowes 1Q22 Pre-Earnings Insights"
    },
    {
      "level": "H3",
      "text": "Big Tech Pre-Earnings Insights: Twitter, Apple, and Tesla?"
    },
    {
      "level": "H3",
      "text": "Me and My Shadow: Up and Comers in the Online Dating Industry"
    },
    {
      "level": "H3",
      "text": "And Just Like That: Peloton Pre-Earnings Insights"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Clement Thibault"
}