{
  "url": "https://www.similarweb.com/blog/investor/stock-market/earnings-insights-q2-2020-roku/",
  "slug": "earnings-insights-q2-2020-roku",
  "title": "Earnings Insights: ROKU, WIX, W, CVNA, BKNG, ETSY | Similarweb",
  "description": "This week's earnings insights evaluates the digital performance of Roku, Wix, Wayfair, Carvana, Booking, and Etsy. - ahead of their earnings reports.",
  "content": "HomeBlogStockStock MarketEarnings Insights Q2 2020: ROKU, WIX, W, CVNA, BKNG, ETSY Stock Intelligence Earnings Insights Q2 2020: ROKU, WIX, W, CVNA, BKNG, ETSY Start your free trial by Clement Thibault , Content Marketing Manager, Similarweb 4 Min. August 2, 2020 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Three weeks of earnings are now behind us, which means we’re officially entering the back half of this 2Q earnings season. This week, we’re highlighting Similarweb data on Roku, Wix, Wayfair, Carvana, Booking, and Etsy. The data presented below is Desktop only unless explicitly stated otherwise. ROKU Earnings Insights Roku Earnings Date: August 5 Roku’s digital growth remained strong in 2Q, with the Roku Channel taking off. US Monthly Unique Visitors (MUVs) to my.roku.com, Roku’s client subdomain where users can sign up, access their account, or link a new device, are up 14.1% YOY. 2Q was Roku’s best quarter in terms of MUVs to my.roku.com save for 4Q 2018 and 4Q 2019, which are seasonally stronger quarters due to the holidays. Likewise, US visits to Roku URLs, which include the string “signup” are up 14.3% YOY in 2Q and 16.6% QOQ. June was the strongest month of traffic to these URLs, with 256K visits. US visits to rokuchannel.roku.com, Roku’s web-based media player, surpassed 2 million quarterly visits for the first time ever. Traffic to this subdomain increased by 68.3% YOY. WIX Earnings Insights Wix Earnings Date: August 6 Wix not only had an impressive quarter of growth, but it is also closing the gap from a major US competitor. US MUVs to Wix.com reached an all-time high in 2Q, with on average 3.7 million MUVs. US MUVs to Wix.com grew 18% YOY, the strongest quarter of US growth in the past 5 quarters. Wix is slowly closing the gap from its main US competitor Squarespace. In 2Q 2019, Squarespace had 91% more US MUVs than Wix. In 2Q 2020, its MUV advantage halved to 45%. US visits to Wix URLs with the string /dashboard/, which is used as the main site management URL, grew 8.5% YOY to an all-time high in 2Q. W Earnings Insights Wayfair Earnings Date: August 5 Wayfair’s emphasis on paid traffic seems to have led to a remarkable digital quarter and strong brand awareness. US visits to Wayfair’s secure domain used for online transactions exploded in 2Q with a growth rate of 73.1% YOY. 2Q was the first quarter ever to average 2 million monthly visits to secure.wayfair.com Wayfair emphasized paid user acquisition in 2Q, as 27.6% of its traffic originated from paid sources, the highest share ever of Wayfair’s total traffic. In terms of brand strength, Wayfair is emerging as the strongest online home furnishing website. On average, 8.5% of US visitors to Wayfair.com then visited Overstock, Ikea, or Pottery Barn’s websites, whereas 33.4% of visitors to these three websites also visited Wayfair.com CVNA Earnings Insights Carvana Earnings Date: August 5 After an initial drop in visitors in April, Carvana roared back to finish the quarter, logging in its best quarter ever in terms of digital performance. Even though Carvana’s US MUVs hit a 12 month low in April 2020, monthly all-time highs in May and in June produced Carvana’s strongest quarter ever in terms of US MUVs, as MUVs increased by 41.4% YOY. Likewise, US visits to Carvana’s financing prequalification page grew 31.3% YOY in 2Q. Carvana also offers to buy used cars or trade them in for credit, and many consumers seem to have taken advantage of that offer in June, as we estimate that 416K visits included the string “sellyourcar” in Carvana’s URL, which witnessed a YOY growth of 107.3%. BKNG Earnings Insights Booking Earnings Date: August 6 Booking, like all travel-related businesses, is struggling due to the pandemic, but it ended the quarter better than it started it. Similarweb’s new travel dataset reveals that booking confirmations for the Booking Group fell 71.2% in 2Q in light of the pandemic. However, the pandemic impacts varied from month to month. While in April bookings were down 89.6% YOY, in June bookings were down only 51.2% YOY. Booking’s general market share is trending down in 2Q 2020. While in 2Q 2019 the Booking Group accounted for 49.9% of all bookings from the companies tracked, its share fell to 45.8% of all bookings in 2Q 2020. The relative weight of Booking’s top 5 markets increased to 46.3% of all of the Booking Group’s bookings in 2Q 2020, from 37.4% in 2Q 2019. The US’s share of bookings rose from 13.5% in 2Q 2019 to 18.8% in 2Q 2020. ETSY Earnings Insights Etsy Earnings Date: August 5 Etsy’s digital performance hit new all-time highs in 2Q, both from a traffic and conversion point of view. Worldwide visits to Etsy.com increased by 39.7% YOY in 2Q, its highest YOY growth rate in the past five quarters. Visits in May grew 47.6% YOY, the highest growth rate in at least 15 months. Etsy’s conversion rate (CVR) of US visits in 2Q surpassed 5% for the first time ever, according to Similarweb’s funnel analysis tool. Etsy’s CVR improved by 36.7% when compared to its 2Q 2019 CVR. 2Q also marked Etsy’s strongest quarter of traffic to new shop opening URLs. US visits to URLs including “onboarding” and “listing” increased 22.7 YOY in 2Q, as more consumers were interested in opening an online shop on Etsy. Next Week’s Earnings Insights In case you missed it, you’re welcome to check out our pre-earnings insights for the first week of earnings season which included Netflix and the banks, the second week which looked at Microsoft and Twitter among others, or last week’s article where our data correctly foresaw big gains for Shopify and PayPal. We’ll be back next week with insights on ZoomInfo, Vroom, ANGI Homeservices, Hello Fresh, Zalando, and more! Have a great week! by Clement Thibault Content Marketing Manager, Similarweb Clement analyzes digital trends and provides insights using Similarweb's data, aiming to highlight the value of alternative data for investors. Related Topics: Stock Market This post is subject to Similarweb legal notices and disclaimers. Related Posts Stock Intelligence Top Tech Stocks and How to Track Their Performance Stock Market by Andrea Pash 8 Min. Feb 23, 2024 Stock Intelligence Game Changer: Alternative Data Evens the Playing Field Stock Market by Andrea Pash 3 Min. Oct 10, 2022 Stock Intelligence If You Build It: Home Depot vs. Lowes 1Q22 Pre-Earnings Insights Stock Market by Andrea Pash 3 Min. May 13, 2022 Stock Intelligence Big Tech Pre-Earnings Insights: Twitter, Apple, and Tesla? Stock Market by Andrea Pash 4 Min. Apr 22, 2022 Stock Intelligence Me and My Shadow: Up and Comers in the Online Dating Industry Stock Market by Andrea Pash 5 Min. Mar 22, 2022 Stock Intelligence And Just Like That: Peloton Pre-Earnings Insights Stock Market by Andrea Pash 3 Min. Feb 3, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Earnings Insights Q2 2020: ROKU, WIX, W, CVNA, BKNG, ETSY"
    },
    {
      "level": "H2",
      "text": "ROKU Earnings Insights"
    },
    {
      "level": "H2",
      "text": "WIX Earnings Insights"
    },
    {
      "level": "H2",
      "text": "W Earnings Insights"
    },
    {
      "level": "H2",
      "text": "CVNA Earnings Insights"
    },
    {
      "level": "H2",
      "text": "BKNG Earnings Insights"
    },
    {
      "level": "H2",
      "text": "ETSY Earnings Insights"
    },
    {
      "level": "H2",
      "text": "Next Week’s Earnings Insights"
    },
    {
      "level": "H3",
      "text": "Top Tech Stocks and How to Track Their Performance"
    },
    {
      "level": "H3",
      "text": "Game Changer: Alternative Data Evens the Playing Field"
    },
    {
      "level": "H3",
      "text": "If You Build It: Home Depot vs. Lowes 1Q22 Pre-Earnings Insights"
    },
    {
      "level": "H3",
      "text": "Big Tech Pre-Earnings Insights: Twitter, Apple, and Tesla?"
    },
    {
      "level": "H3",
      "text": "Me and My Shadow: Up and Comers in the Online Dating Industry"
    },
    {
      "level": "H3",
      "text": "And Just Like That: Peloton Pre-Earnings Insights"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Clement Thibault"
}