{
  "url": "https://www.similarweb.com/blog/investor/stock-market/earnings-insights-q2-2020-wmt/",
  "slug": "earnings-insights-q2-2020-wmt",
  "title": "Earnings Insights: WMT, TGT, BABA, NVDA, HD, LOW | Similarweb",
  "description": "Similarweb's quarterly earnings insights for Q2 2020 gets you an early peek into WMT, TGT, BABA, NVDA, HD, LOW quarterly performance.",
  "content": "HomeBlogStockStock MarketQuarterly Earnings Insights Q2 2020: WMT, TGT, BABA, NVDA, HD, LOW Stock Intelligence Quarterly Earnings Insights Q2 2020: WMT, TGT, BABA, NVDA, HD, LOW Start your free trial by Clement Thibault , Content Marketing Manager, Similarweb 4 Min. August 17, 2020 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic In week six of earnings season, retail giants are stepping into the spotlight, and we’ve got earnings insights ahead of their reports. The six companies we’re covering today – Walmart, Target, Alibaba, Nvidia, Home Depot, and Lowe’s – have a total market capitalization of $1.8 trillion, so while the Apples and Microsofts of the world have already reported, now isn’t the time to tune off. Investors’ traditional end-of-summer vacation can wait another week. All the data mentioned below is desktop data. Walmart Earnings Insights Walmart’s efforts to provide an attractive eCommerce experience has paid off in 2Q, with the pandemic actively driving economic activity online. US Visits to Walmart.com grew 56% YOY in 2Q, as Similarweb estimates that Walmart.com added just under 200 million visits to its website over the quarter. Visits to Walmart’s online grocery section, as defined by visits to Walmart.com that included the string grocery, jumped 292% YOY in 2Q. April, May, and June 2020 all individually had more visits to the grocery sections than the entirety of 2Q 2019. Interestingly, Walmart’s estimated conversion rate (CVR) improved in 2Q despite the higher volume. Its 2Q CVR of 4.82% is the third-highest CVR recorded in the past two years, trailing only the holiday seasons. Target Earnings Insights Much like Walmart, Target was also able to take advantage of the forced transition to online retail in 2Q. US visits to Target.com were up 73.2% YOY in 2Q. In fact, April and May 2020 were the second and third strongest months of traffic ever for Target, only ever so slightly behind November 2018. US Monthly Unique Visitors (MUVs) to weeklyad.target.com, Target’s subdomain dedicated to its weekly promotions, increased by 55% YOY in 2Q, as more shoppers are bargain hunting due to the pandemic. Target’s CVR improved by 16.8% YOY and eclipsed 5% for the first time in a quarter outside of the holiday season. More shoppers are coming in, and more are buying too. Alibaba Earnings Insights It appears that the world has somewhat shunned Alibaba’s largest worldwide retail offering in 2Q, while interest in their cloud offering continues to grow. Worldwide visits to Aliexpress.com, Alibaba’s global B2C retail platform, dropped by 21.2% YOY in 2Q, following a 26.7% YOY decrease in visits in 1Q. Alibaba.com, the retail platform geared towards wholesale and B2B, actually rebounded in 2Q after an 11.1% YOY decrease in worldwide visits in 1Q. In 2Q, visits to the platform grew 5.6% YOY. Worldwide MUVs to Alibabacloud.com, the company’s cloud computing offering, jumped 73.5% YOY in 2Q, and averaged 1.25 million monthly unique visitors in 2Q, the highest number of unique visitors ever over a quarter. Nvidia Earnings Insights Visitors to Nvidia’s online assets have increased in 2Q, which could indicate stronger consumer interest in Nvidia’s products and offers. US MUVs to Nvidia.com went up 66.4% YOY in 2Q, with a particularly strong performance in June. The 1.9 million US unique visitors to Nvidia’s website was the highest it’s ever been Nvidia’s data center offering is also gathering significant attention, and visits to URLs including the string data-center increased by 72.8% YOY in 2Q. In May, visits to these URLs surpassed 50K for the first time. Nvidia also operates an online store in select countries. Worldwide visits to store.nvidia.com grew 31.4% YOY in 2Q, marking the first quarter of growth to the subdomain in 5 quarters. Home Depot Earnings Insights 2Q has been Home Depot’s best online quarter ever, according to every metric surveyed. May, June, and April – in that order – now rank numbers 1, 2, and 3 in terms of US visits to homedepot.com. These extraordinary months of traffic translated to 55.6% YOY growth in 2Q. Prior to 2Q 2020, Homedepot.com had never had a quarter with a CVR above 3%. In 2Q 2020, Home Depot managed to increase its CVR to 4%, a remarkable jump in its conversion rate. Many new Home Depot accounts were created in 2Q, as visits to URLs including createaccount increased 181.5% QOQ, to a monthly average of 471K visits in the quarter. Lowe’s Earnings Insights Lowe’s has also enjoyed online growth, though on a slightly smaller scale than Home Depot, thus widening the gap between the two. US visits to Lowes.com increased by 48.9% in 2Q. Just like Home Depot, its all-time three strongest months of traffic are now May, June, and April, in that order. Lowe’s conversion rate improved by almost 100 basis points QOQ. Lowe’s conversion rate improved by 53.6% YOY, marking the first quarter in five quarters in which its CVR improved YOY. In terms of loyalty, Lowe’s visitors are much more likely to visit Home Depot than Home Depot’s visitors are likely to check out Lowe’s as well. 49.4% of Lowe’s visitors also visited Home Depot, while only 24.3% of Home Depot’s visitors also visited Lowes. Next Week’s Earnings Most of our earnings coverage this season is behind us now, but you’re welcome to check our previous insights with the added benefit of hindsight! Week of July 13: NFLX, JPM, DPZ, WFC, C, OCDO Week of July 20: MSFT, TWTR, SNAP, LUV, T Week of July 27: AAPL, PYPL, SPOT, SHOP, EXPE, NEXT Week of August 2: ROKU, WIX, W, CVNA, BKNG, ETSY Week of August 9: ZI, VRM, HFG, ANGI, LYFT Next week, we’ll focus on Best Buy, Salesforce, Workday, and Dicks’ Sporting Goods, among others. Have a great week! by Clement Thibault Content Marketing Manager, Similarweb Clement analyzes digital trends and provides insights using Similarweb's data, aiming to highlight the value of alternative data for investors. Related Topics: Stock Market This post is subject to Similarweb legal notices and disclaimers. Related Posts Stock Intelligence Top Tech Stocks and How to Track Their Performance Stock Market by Andrea Pash 8 Min. Feb 23, 2024 Stock Intelligence Game Changer: Alternative Data Evens the Playing Field Stock Market by Andrea Pash 3 Min. Oct 10, 2022 Stock Intelligence If You Build It: Home Depot vs. Lowes 1Q22 Pre-Earnings Insights Stock Market by Andrea Pash 3 Min. May 13, 2022 Stock Intelligence Big Tech Pre-Earnings Insights: Twitter, Apple, and Tesla? Stock Market by Andrea Pash 4 Min. Apr 22, 2022 Stock Intelligence Me and My Shadow: Up and Comers in the Online Dating Industry Stock Market by Andrea Pash 5 Min. Mar 22, 2022 Stock Intelligence And Just Like That: Peloton Pre-Earnings Insights Stock Market by Andrea Pash 3 Min. Feb 3, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Quarterly Earnings Insights Q2 2020: WMT, TGT, BABA, NVDA, HD, LOW"
    },
    {
      "level": "H2",
      "text": "Walmart Earnings Insights"
    },
    {
      "level": "H2",
      "text": "Target Earnings Insights"
    },
    {
      "level": "H2",
      "text": "Alibaba Earnings Insights"
    },
    {
      "level": "H2",
      "text": "Nvidia Earnings Insights"
    },
    {
      "level": "H2",
      "text": "Home Depot Earnings Insights"
    },
    {
      "level": "H2",
      "text": "Lowe’s Earnings Insights"
    },
    {
      "level": "H2",
      "text": "Next Week’s Earnings"
    },
    {
      "level": "H3",
      "text": "Top Tech Stocks and How to Track Their Performance"
    },
    {
      "level": "H3",
      "text": "Game Changer: Alternative Data Evens the Playing Field"
    },
    {
      "level": "H3",
      "text": "If You Build It: Home Depot vs. Lowes 1Q22 Pre-Earnings Insights"
    },
    {
      "level": "H3",
      "text": "Big Tech Pre-Earnings Insights: Twitter, Apple, and Tesla?"
    },
    {
      "level": "H3",
      "text": "Me and My Shadow: Up and Comers in the Online Dating Industry"
    },
    {
      "level": "H3",
      "text": "And Just Like That: Peloton Pre-Earnings Insights"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Clement Thibault"
}