{
  "url": "https://www.similarweb.com/blog/investor/stock-market/game-changer-alt-data/",
  "slug": "game-changer-alt-data",
  "title": "Game Changer: Alternative Data Evens the Playing Field | Similarweb",
  "description": "Alternative data, specifically online traffic and engagement, provides near real-time snapshots of a company’s performance that translate into revenue streams.",
  "content": "HomeBlogStockStock MarketGame Changer: Alternative Data Evens the Playing Field Stock Intelligence Game Changer: Alternative Data Evens the Playing Field Start your free trial by Andrea Pash , Senior Content Marketing Manager 3 Min. October 10, 2022 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Alternative data. Everyone talks about it. Investors are using it. But why? One word: transparency. Digital alternative data, specifically online traffic and engagement, provides daily, weekly, and monthly snapshots of a company’s performance based on multiple metrics that translate into positive or negative revenue streams. No more waiting for quarterly earnings reports to see who exceeds, meets, or misses market expectations. This is crucial in today’s volatile economic climate. How does this work? Similarweb provides comprehensive, highly-curated datasets focused on company-specific KPIs, supplemented by detailed analyses, affording deep and granular insights into the digital performance of a company. Let’s revisit 2Q22 and see this in action. We’ll look at the earnings previews and wrap reports created by Similarweb’s investor analytics team for Amazon, Netflix, and Zoom. The previews focus on metrics that act as key indicators for a company’s quarterly performance and the wraps overlay that metric with a company’s KPI. AMZN Like the entire Retail & Ecommerce industry, Amazon struggled with supply chain backlogs, but how has this affected the company’s bottom line? In the earnings preview published July 13, 2022, key indicators for the marketplace suggested growth rates to remain relatively stable in North America, but decline internationally. This 2 percentage point deceleration is in part due to Prime Day shifting from 2Q to 3Q. When Amazon reported on July 28, 2022, they showed stabilizing retail sales growth –excluding foreign exchange (FX)– as the company saw improvements in in-stock levels, delivery speed, and consumer demand. AMZN’s key KPI flowed in tandem with Similarweb’s total monthly visit duration, our key indicator for NA marketplace sales. NFLX Netflix has steadily been losing traffic share for some time but the streaming sector has become a more competitive landscape. 1Q22 was a rough one for Netflix when the company announced its first loss of subscribers in 10 years. In the earnings preview published July 13, 2022, Netflix signups and engagement continued to slow, and churn rates increased, particularly internationally, as major blockbuster releases hit competitor platforms and as the company continued to raise subscription prices. Cancellations jumped in April following headlines around its reported Q1 subscriber loss. June performed better with the release of Stranger Things season 4. The company’s new ad-supported initiatives and pay-per-user tests in Chile and Peru continue to point to an unfavorable impact on viewership and churn rates. In the earnings wrap published July 19, NFLX reported better than expected results at a net loss of 1M vs. guidance of 2M. The midpoint of Similarweb’s net adds model was a 3.7M loss, most of which was driven by the surge in cancellations in April, as seen in the Similarweb data. Sign-up and cancellation trends improved substantially throughout the quarter with June data flipping back to implied net adds. ZM As workers march back into offices, Zoom struggles to maintain its relevancy. In our earnings preview published in July 2022, the data showed Zoom’s active client domains continuing to decline. This could be attributed to industries and companies with temporary use cases, but the company’s weakness is becoming more broad-based. Site engagement, a leading indicator of gross retention, was sharply lower to start the year. When ZM reported revenue slightly below consensus, our earnings wrap published August 22 showed this to be in line with Similarweb’s signals. The company lost enterprise customers for the second straight quarter, by historical metrics (which is how we track it). Zoom’s Revenue from customers with more than 10 employees grew 15% (vs. 22% last quarter), slightly below our models, and mostly related to the foreign exchange market, as the company prices international contracts in local currency. Looking ahead to 3Q22 AMZN continues to gain traffic share at the expense of its ecommerce and mass merchant retail competitors. Case in point, Amazon’s US conversion share reached all-time highs vs. Walmart and Target, especially with Prime Day shifting from 2Q to 3Q. NFLX still faces notable resistance in net sign-ups and engagement trends haven’t been favorable. Despite the strong summer content slate, audiences have shifted to major series releases from HBO Max (House of Dragon) and Prime Video (Power of the Rings). ZM growth in estimated active accounts declined for the 12th straight month, reflecting employees’ return to the office, and monthly visits per user are near the lowest point since the start of the pandemic. Interestingly, Zoom phone users continue to rise. Got alternative data? An alternative data source removes the incessant waiting for and surprises from quarterly earnings announcements. Online traffic and engagement data provide performance transparency in near real-time throughout the quarter. With Similarweb datasets, 2Q22 presented no real surprises as the metrics aligned with companies’ financial reports. Invest Smarter with Stock Intelligence Get the granular datasets you need to adapt to market changes and industry trends in an instant. Try Similarweb for free by Andrea Pash Senior Content Marketing Manager Andrea, with her extensive marketing background and 15+ years in finance, pulls insight and crafts content for Stock Intelligence & DaaS at Similarweb. A UC Irvine grad, she's a concert lover and avid traveler. Related Topics: Stock Market This post is subject to Similarweb legal notices and disclaimers. Related Posts Stock Intelligence Top Tech Stocks and How to Track Their Performance Stock Market by Andrea Pash 8 Min. Feb 23, 2024 Stock Intelligence If You Build It: Home Depot vs. Lowes 1Q22 Pre-Earnings Insights Stock Market by Andrea Pash 3 Min. May 13, 2022 Stock Intelligence Big Tech Pre-Earnings Insights: Twitter, Apple, and Tesla? Stock Market by Andrea Pash 4 Min. Apr 22, 2022 Stock Intelligence Me and My Shadow: Up and Comers in the Online Dating Industry Stock Market by Andrea Pash 5 Min. Mar 22, 2022 Stock Intelligence And Just Like That: Peloton Pre-Earnings Insights Stock Market by Andrea Pash 3 Min. Feb 3, 2022 Stock Intelligence Upcoming IPOs 2022: 9 Names for Your Watchlist Stock Market by Caroline Ido 8 Min. Jan 20, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Game Changer: Alternative Data Evens the Playing Field"
    },
    {
      "level": "H2",
      "text": "AMZN"
    },
    {
      "level": "H2",
      "text": "NFLX"
    },
    {
      "level": "H2",
      "text": "ZM"
    },
    {
      "level": "H2",
      "text": "Looking ahead to 3Q22"
    },
    {
      "level": "H2",
      "text": "Got alternative data?"
    },
    {
      "level": "H3",
      "text": "Top Tech Stocks and How to Track Their Performance"
    },
    {
      "level": "H3",
      "text": "If You Build It: Home Depot vs. Lowes 1Q22 Pre-Earnings Insights"
    },
    {
      "level": "H3",
      "text": "Big Tech Pre-Earnings Insights: Twitter, Apple, and Tesla?"
    },
    {
      "level": "H3",
      "text": "Me and My Shadow: Up and Comers in the Online Dating Industry"
    },
    {
      "level": "H3",
      "text": "And Just Like That: Peloton Pre-Earnings Insights"
    },
    {
      "level": "H3",
      "text": "Upcoming IPOs 2022: 9 Names for Your Watchlist"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Andrea Pash"
}