{
  "url": "https://www.similarweb.com/blog/investor/stock-market/klarna-ipo/",
  "slug": "klarna-ipo",
  "title": "Klarna IPO Digital Insights | Similarweb",
  "description": "Will Klarna, the BNPL solution, actually go public? Be prepared for the potential Klarna IPO with insights into the company’s online performance.",
  "content": "HomeBlogStockStock MarketKlarna IPO: To Be or Not to Be? Stock Intelligence Klarna IPO: To Be or Not to Be? Get the full analysis by Liat Piazza , Investor Insights Manager 2 Min. July 16, 2021 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic There has been lots of speculation around a potential initial public offering (IPO) from Klarna, which according to TechCrunch is the highest valued private fintech in Europe. The Swedish buy now pay later (BNPL) company is live in over 20 countries, and in May 2021 reported 90 million global active users, and 2 million transactions a day. So will Klarna IPO? We don’t know. But what we can tell you is that based on our web traffic alternative data the company’s online performance is looking robust. Key Takeaways The number of websites globally with BNPL solutions installed is growing Monthly visits to BNPL solution websites are also on the rise Monthly unique visitors (MUVs) to Klarna’s merchant login page is seeing strong growth Sweden accounts for most of the traffic to Klarna’s merchant login page, but most visitors are returning users, not new Get the full analysis The BNPL market Klarna operates in an expanding market, signaling high growth potential. This is a great signal ahead of a potential Klarna IPO. The number of websites globally with either Klarna or Afterpay installed, is increasing. In 2Q21 this growth represented 16.8% quarter-over-quarter (QoQ), and 65.5% year-over-year (YoY). This booming market is further supported by the improving reach of BNPL solutions, signaled by an upward traffic trend to both klarna.com and afterpay.com, globally. Accelerating merchant user growth Merchants are an important part of Klarna’s business model, with revenue coming from an initial setup fee, monthly fee, and a commission fee on transactions. The number of merchants using Klarna is on the rise, indicated by an increasing number of monthly unique visitors (MUVs) to Klarna’s merchant login page, portal.klarna.com. We also note a particularly significant uptick in 2Q21. Early adoption from Swedish merchants Leading the adoption of Klarna by merchants is Sweden, with the largest share of traffic (25%) to the merchant login page coming from its native country. Looking at new vs returning visitors to Klarna’s merchant login page in Sweden, most are returning users of Klarna. Following the early adoption in the region, the company now needs to focus its efforts on other markets in order to continue its growth trajectory. Klarna’s growth story So as we have seen, the BNPL market is growing, and Klarna’s merchant business is capitalizing on that. What about Klarna’s efforts to improve its merchant footprint outside of Sweden? And what does Klarna’s consumer business look like? Read the full analysis for the answers and more by Liat Piazza Investor Insights Manager Liat creates data-driven content for the Similarweb Investor Solution, focusing on digital performance across various sectors. Related Topics: Stock Market This post is subject to Similarweb legal notices and disclaimers. Related Posts Stock Intelligence Top Tech Stocks and How to Track Their Performance Stock Market by Andrea Pash 8 Min. Feb 23, 2024 Stock Intelligence Game Changer: Alternative Data Evens the Playing Field Stock Market by Andrea Pash 3 Min. Oct 10, 2022 Stock Intelligence If You Build It: Home Depot vs. Lowes 1Q22 Pre-Earnings Insights Stock Market by Andrea Pash 3 Min. May 13, 2022 Stock Intelligence Big Tech Pre-Earnings Insights: Twitter, Apple, and Tesla? Stock Market by Andrea Pash 4 Min. Apr 22, 2022 Stock Intelligence Me and My Shadow: Up and Comers in the Online Dating Industry Stock Market by Andrea Pash 5 Min. Mar 22, 2022 Stock Intelligence And Just Like That: Peloton Pre-Earnings Insights Stock Market by Andrea Pash 3 Min. Feb 3, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Klarna IPO: To Be or Not to Be?"
    },
    {
      "level": "H2",
      "text": "The BNPL market"
    },
    {
      "level": "H2",
      "text": "Accelerating merchant user growth"
    },
    {
      "level": "H2",
      "text": "Early adoption from Swedish merchants"
    },
    {
      "level": "H2",
      "text": "Klarna’s growth story"
    },
    {
      "level": "H3",
      "text": "Top Tech Stocks and How to Track Their Performance"
    },
    {
      "level": "H3",
      "text": "Game Changer: Alternative Data Evens the Playing Field"
    },
    {
      "level": "H3",
      "text": "If You Build It: Home Depot vs. Lowes 1Q22 Pre-Earnings Insights"
    },
    {
      "level": "H3",
      "text": "Big Tech Pre-Earnings Insights: Twitter, Apple, and Tesla?"
    },
    {
      "level": "H3",
      "text": "Me and My Shadow: Up and Comers in the Online Dating Industry"
    },
    {
      "level": "H3",
      "text": "And Just Like That: Peloton Pre-Earnings Insights"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Liat Piazza"
}