{
  "url": "https://www.similarweb.com/blog/investor/stock-market/netflix-earnings-q1-2020/",
  "slug": "netflix-earnings-q1-2020",
  "title": "Netflix Earnings: Has COVID Created Opportunity? | Similarweb",
  "description": "Coronavirus left millions of people at home, searching for entertainment. Learn how this global change is expected to affect Netflix's Q1 earnings call.",
  "content": "HomeBlogStockStock MarketNetflix Earnings: Has Coronavirus Created Opportunity? Stock Intelligence Netflix Earnings: Has Coronavirus Created Opportunity? Start your free trial by Liron Hakim Bobrov , Marketing Insights Manager at Similarweb 3 Min. April 16, 2020 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Netflix (NFLX), the pioneer of the streaming video space, has had one of its most interesting quarters yet. While the Coronavirus placed millions of people at home, providing increased opportunities for growth, the streaming space has also become far more populated, as new competition shuffled the cards in select countries, with significant projections for global growth. We used Similarweb’s alternative data to provide insight into how this streaming giant performed in Q1, right in time for Netflix earnings call. In the last two weeks, US Visits to netflix.com sign-up page have increased by more than 100% YoY. Daily Active Users for Netflix’s Android app have increased 8.5% over last quarter, the biggest increase since Q1 2019 Worldwide unique visitors to netflix.com has hit an all time high in March Developing markets fueled the growth in DAU, while established markets struggled to grow Dramatic Increase in Subscriptions The first part of understanding Netflix’s performance is trying to estimate how many new subscribers it obtained this quarter. For this, Similarweb is able to track US visits to the desktop sign-up page. While there was limited YoY growth in registrations during the months of January and February, the week ending 22nd March marked a dramatic change for Netflix, as sign-ups grew nearly 125% YoY, and remained high in the following weeks. Since Netflix only saw strong growth in the last couple of weeks of the month, as the US went into lock-down, the momentum may have happened a little too late in the quarter to substantially move the needle for domestic revenue, however, we expect to see a good positive movement in quarter-end subscriber numbers. Get a better understanding of Netflix’s subscriber growth by downloading the data below: Growth in App Usage Daily Active Users measure the volume of people actively using an app per day. We have previously shown that this figure correlates highly with Netflix’s reported number of subscribers. Given the dramatic events of this quarter, it is not surprising to see that Netflix DAU’s have increased by 8.5% over the last quarter, and 5.5% over Q3-19. In fact, this is the most dramatic quarterly increase we’ve seen for Netflix since Q1-19, which may be an indicator of good results in Netflix’s upcoming earnings call. It appears that Netflix’s growth in subscriptions, shown above, is isolated to desktop devices, as usage on mobile apps in the US has stagnated. This is to be expected, as audiences at home may be more likely to opt for larger screens. While the events of the end of this quarter have certainly impacted Netflix’s growth, it is important to mention that the increase in DAU’s began earlier, as average monthly DAU’s in January-February 2020 were 8.3% greater than the same figure for Q4-19 around the world, and 9.0% greater in March, when shelter-in-place orders were put into effect across many countries. Coronavirus Impact on Netflix Earnings As millions of people around the globe were asked to stay at home during much of the month of March in order to slow the spread of COVID-19, one might’ve expected to see huge surges in Netflix app usage during March. While we did see some increase, it only amounted to a 1.5% increase in Daily Active Users outside the US, comparing March 2020 to the average for January-February. In fact, the Coronavirus appeared to have only presented growth opportunities for Netflix outside of its most popular countries: Its top two countries, the US and Brazil, saw DAU’s decreased by -3.7%, -4.5%, and in Mexico, its third-biggest country, DAUs only increased by 0.9%. On that thread, other less in-demand geos, like India (+7.7%), Argentina (+5.9%), the Philippines (+17.2%), and Italy (+13.1%) all saw significant growth. However, given the change in people’s daily routines, we can assume that increased Netflix views were seen more on computers over phones or tablets. Indeed, when looking at unique visitors to netflix.com, we see a 17% increase this past March, compared to January-February. In fact, March 2020 came out to be the best month for Netflix in the past three years. This quarter has presented Netflix with dramatic changes in how users interact with content. From an increase in volume to a shift in device usage, the Coronavirus has presented opportunities and challenges for this media heavyweight. Understanding this company’s growth requires visibility into traffic and engagement trends across devices, and also visibility into how well it is signing up new users. All the data used to generate this report is available for download below. The data available includes 16 months of weekly US desktop conversion numbers for Netflix. by Liron Hakim Bobrov Marketing Insights Manager at Similarweb Liron, with over 5 years of experience and an MBA from Tel Aviv University, specializes in content management, data analysis, and industry insights. Related Topics: Stock Market This post is subject to Similarweb legal notices and disclaimers. Related Posts Stock Intelligence Top Tech Stocks and How to Track Their Performance Stock Market by Andrea Pash 8 Min. Feb 23, 2024 Stock Intelligence Game Changer: Alternative Data Evens the Playing Field Stock Market by Andrea Pash 3 Min. Oct 10, 2022 Stock Intelligence If You Build It: Home Depot vs. Lowes 1Q22 Pre-Earnings Insights Stock Market by Andrea Pash 3 Min. May 13, 2022 Stock Intelligence Big Tech Pre-Earnings Insights: Twitter, Apple, and Tesla? Stock Market by Andrea Pash 4 Min. Apr 22, 2022 Stock Intelligence Me and My Shadow: Up and Comers in the Online Dating Industry Stock Market by Andrea Pash 5 Min. Mar 22, 2022 Stock Intelligence And Just Like That: Peloton Pre-Earnings Insights Stock Market by Andrea Pash 3 Min. Feb 3, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Netflix Earnings: Has Coronavirus Created Opportunity?"
    },
    {
      "level": "H2",
      "text": "Dramatic Increase in Subscriptions"
    },
    {
      "level": "H2",
      "text": "Growth in App Usage"
    },
    {
      "level": "H2",
      "text": "Coronavirus Impact on Netflix Earnings"
    },
    {
      "level": "H3",
      "text": "Top Tech Stocks and How to Track Their Performance"
    },
    {
      "level": "H3",
      "text": "Game Changer: Alternative Data Evens the Playing Field"
    },
    {
      "level": "H3",
      "text": "If You Build It: Home Depot vs. Lowes 1Q22 Pre-Earnings Insights"
    },
    {
      "level": "H3",
      "text": "Big Tech Pre-Earnings Insights: Twitter, Apple, and Tesla?"
    },
    {
      "level": "H3",
      "text": "Me and My Shadow: Up and Comers in the Online Dating Industry"
    },
    {
      "level": "H3",
      "text": "And Just Like That: Peloton Pre-Earnings Insights"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Liron Hakim Bobrov"
}