{
  "url": "https://www.similarweb.com/blog/investor/stock-market/online-dating-industry/",
  "slug": "online-dating-industry",
  "title": "Up and Comers in the Online Dating Industry | Similarweb",
  "description": "The online dating industry is saturated, but newcomers are actively disrupting the market. Read on for the alternative data, which tells an interesting story.",
  "content": "HomeBlogStockStock MarketMe and My Shadow: Up and Comers in the Online Dating Industry Stock Intelligence Me and My Shadow: Up and Comers in the Online Dating Industry Get 3 years of industry data by Andrea Pash , Senior Content Marketing Manager 5 Min. March 22, 2022 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Swiping right is so 10 years ago and another Valentine’s Day has come and gone. What’s a girl to do? This one’s diving headfirst into the online dating industry – to dig up disruptors. What did you think I would do…? Keep swiping right? Match.com got its start in 1995. In 2012, Tinder changed how people date online. Between January 2020 and January 2022, 5.3 billion people visited an online dating site. That’s billion. With a B. Clearly, pandemic-mandated lockdowns and stay-at-home orders prevented no one from seeking love and companionship. Those 5.3 billion visits translate to 211 million visits per month. These monthly visits averaged just under 10 minutes and, interestingly, 36 percent of that traffic stems from the U.S. The next country on the list is Brazil at 5.3 percent. The leaders in the industry are household names. Even your mom knows to mention Tinder, Bumble, Match, and Hinge to push you to find that special someone. I hope she doesn’t have the password to your phone. If she does, I hope she at least picks your preferred dating app. The global dating industry is highly competitive. There are currently around 2,000 online dating sites to choose from, yet none of the top sites have lower than a 50% exclusivity rate. Tinder, for example, has an 86.7% exclusivity rate, meaning only 13.3% of the platform’s users utilize other sites and 10% of them only visit one other dating site. Bumble only has a 53% exclusivity rate, meaning 35% of its users visit at least one site and 9% visit at least two. What does this mean for the companies making their debut on the dating scene? Looking for love The biggest names in the online dating market had to pivot in the face of the pandemic in order to accommodate lockdowns and social distancing. The mainstream apps introduced some variations of virtual dating such as audio and visual components. But, will that be enough to compete with the new crop of apps hitting the online dating market today? Individual investors and venture capital firms are courting the alternative (data) to swiping right. Snack Gen Z is strolling onto the scene and Snack, founded in March 2020, is wooing the demographic not by unoriginally tagging itself as “not your parents dating app,” but by employing the TikTok app model – videos and endless scrolling, liking and commenting along the way. Since launching in February 2021, Snack has succeeded in attracting its target audience with Gen Z making up more than 50% of its users, and has even flirted with millennials. Snack downloads have steadily increased since April 2021 from 0 to over 104,000 and the app isn’t even available on Androids yet. The pre-seed funding round brought in $3.5 million from seven venture capital firms in February 2021. In June 2021, Tinder launched what Vice called “essentially a pivot to TikTok.” Will Snack be able to sustain Gen Z’s affection and adoration? Thursday Thursday could be considered the new anti-dating app. Its founders believe there’s more to single life than dating and that we all have better things to do than swipe left or right, so the app is only operational on, yep, you guessed it: Thursdays. The app has the same demographics as Snack, attracting more than 50% of Gen Zers searching for love, albeit only once a week, and flirting with just over 20% of millennials. Desktop and mobile web traffic has definitely had its ups and downs since its May 2021 launch. But, considering the dating pool only consists of Londoners and New Yorkers, 811,647 total visits between May 2021 and Feb. 2022 isn’t a number to swipe left on. Interestingly, recent web traffic is coming from organic or direct search. The initial seed round in June 2021 brought in £2.5 million from a cross-section of eight individual investors and venture capital firms. That said, there may be something to only spending one day a week searching for that special someone, or at least a date for Saturday night. Heart to Heart Need to put a voice to the face? Heart to Heart’s audio dating app lets its users add audio commentary to their chosen profile pics and, once matched, send audio messages rather than texts. Brand new to the online dating industry, the company received $750K from eight investors in the pre-seed round in Oct. 2021, having launched on Feb. 3, 2021. The company is currently focusing its efforts on social media, which is a logical choice as it’s only available in Los Angeles and New York City right now. But, in only a matter of weeks, over 38,000 people had downloaded Heart to Heart. Schmooze Why would anyone want to scroll through endless pictures or videos of people posturing and posing to find love when there are memes? Schmooze is a dating app that cultivates matches based on a sense of humor gauged by the memes users interact with. Investors are intrigued. Over three rounds of funding, Schmooze raised $3.3 million, the majority of that coming in its last pre-seed round in Sept. 2021. This explains the sharp jump in traffic over the last couple of months and clearly, the power of memes. A picture is worth a thousand words and it’s said that laughter is the best medicine. Put the two together and you’ve got the internet – which is exactly what Schmooze is banking on. Can’t fight that feeling In 2021, $4.2 billion was spent globally on dating apps, up 35% from the previous year as reported by CNET. Business of Apps stated that Europeans alone will spend $200 million in 1Q22. And Wired reported that the global online dating industry will increase its worth from $5.3 billion to $6.4 billion. Since June 2020, almost 100 new companies focused on stealing hearts have flooded the online dating market. 11 of those companies have raised over $11 million in funding to date. Will the next generation of dating apps challenge the online dating industry giants or be remembered as nothing but flings? Who gets a second date? Looking for love is a lucrative business. The opportunity is certainly there as these online dating industry startups look toward their next rounds of funding. With near-real-time digital alternative data on over 14 million companies, 1 billion websites and 5 million apps from 210+ industries, you get in-depth industry insights and company KPI-based digital performance of any private or public company, allowing for confident assessment and validation of investment objectives and strategies. Watch Industry Trends in Real-Time Size the market, track market share, and keep tabs on market leaders. Talk to a specialist by Andrea Pash Senior Content Marketing Manager Andrea, with her extensive marketing background and 15+ years in finance, pulls insight and crafts content for Stock Intelligence & DaaS at Similarweb. A UC Irvine grad, she's a concert lover and avid traveler. Related Topics: Stock Market This post is subject to Similarweb legal notices and disclaimers. Related Posts Stock Intelligence Top Tech Stocks and How to Track Their Performance Stock Market by Andrea Pash 8 Min. Feb 23, 2024 Stock Intelligence Game Changer: Alternative Data Evens the Playing Field Stock Market by Andrea Pash 3 Min. Oct 10, 2022 Stock Intelligence If You Build It: Home Depot vs. Lowes 1Q22 Pre-Earnings Insights Stock Market by Andrea Pash 3 Min. May 13, 2022 Stock Intelligence Big Tech Pre-Earnings Insights: Twitter, Apple, and Tesla? Stock Market by Andrea Pash 4 Min. Apr 22, 2022 Stock Intelligence And Just Like That: Peloton Pre-Earnings Insights Stock Market by Andrea Pash 3 Min. Feb 3, 2022 Stock Intelligence Upcoming IPOs 2022: 9 Names for Your Watchlist Stock Market by Caroline Ido 8 Min. Jan 20, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Me and My Shadow: Up and Comers in the Online Dating Industry"
    },
    {
      "level": "H2",
      "text": "Keep swiping right?"
    },
    {
      "level": "H2",
      "text": "Looking for love"
    },
    {
      "level": "H3",
      "text": "Snack"
    },
    {
      "level": "H3",
      "text": "Thursday"
    },
    {
      "level": "H3",
      "text": "Heart to Heart"
    },
    {
      "level": "H3",
      "text": "Schmooze"
    },
    {
      "level": "H2",
      "text": "Can’t fight that feeling"
    },
    {
      "level": "H2",
      "text": "Who gets a second date?"
    },
    {
      "level": "H3",
      "text": "Top Tech Stocks and How to Track Their Performance"
    },
    {
      "level": "H3",
      "text": "Game Changer: Alternative Data Evens the Playing Field"
    },
    {
      "level": "H3",
      "text": "If You Build It: Home Depot vs. Lowes 1Q22 Pre-Earnings Insights"
    },
    {
      "level": "H3",
      "text": "Big Tech Pre-Earnings Insights: Twitter, Apple, and Tesla?"
    },
    {
      "level": "H3",
      "text": "And Just Like That: Peloton Pre-Earnings Insights"
    },
    {
      "level": "H3",
      "text": "Upcoming IPOs 2022: 9 Names for Your Watchlist"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Andrea Pash"
}