{
  "url": "https://www.similarweb.com/blog/investor/stock-market/top-uk-stocks/",
  "slug": "top-uk-stocks",
  "title": "Top U.K. Stocks for Improved Digital Exposure | Similarweb",
  "description": "Investing in the U.K. doesn’t give much opportunity to invest in market disruptors. Use alternative data to identify some of these opportunities. Read now.",
  "content": "HomeBlogStockStock MarketTop U.K. Stocks to Give Your Portfolio Enhanced Digital Exposure Stock Intelligence Top U.K. Stocks to Give Your Portfolio Enhanced Digital Exposure Read the U.K. grocery analysis by Liat Piazza , Investor Insights Manager 3 Min. July 5, 2021 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Some may say that the trouble with the United Kingdom stock market is that it doesn’t offer much opportunity to invest in up-and-coming technologies, market disruptors, or companies with a large digital footprint. Some U.K. names that you might be looking for alternatives from include FTSE 100 constituents Barclays, Unilever, Anglo-American, Vodafone, and more. Below, we’ve used web traffic alternative data, to identify some of the top U.K. stocks if you’re looking to give your portfolio more digital exposure. 1. Tesco – yes, really Ticker: TSCO Yes, we know this is a well-known U.K. stock but we’re not wasting your time – we promise. Why have we chosen to highlight Tesco? Of all the U.K. supermarket names Tesco has the strongest digital footprint, as seen by the highest number of monthly visits to its site in the U.K. compared to the other supermarket sites. What’s interesting is that Tesco has a larger online footprint in the U.K. than Ocado, which operates exclusively online. Download our full analysis of the U.K. Grocery Market 2. Moonpig – greetings from the pandemic Ticker: MOON Following its IPO earlier this year, Moonpig shares have returned well, and the company is already a constituent of the FTSE 250 index. When compared to its main competitor in the U.K., Funky Pigeon, Moonpig better captured the opportunity presented by the coronavirus pandemic and the resulting lockdowns. Total visits to moonpig.com in the U.K. in 1Q21 (23.5 million) were not only higher than visits to funkypigeon.com (9.9 million) but also demonstrated stronger growth. Visits to moonpig.com were up 191% year-over-year (YoY) for moonpig.com in 1Q21, compared to 162% YoY for funkypigeon.com. 3. Superdry – fashion leveraging the digital transformation Ticker: SDRY After Superdry announced strong, full-year results in May 2021, its share price climbed 65% over a five-day period. This spike came after a declining share price between 2018 and 2020. Julian Dunkerton, the CEO, credits the company’s strengthened eCommerce presence with the improved revenue results. “Our strengthened eCommerce presence has helped mitigate the impact of enforced closures of our stores. We returned to revenue growth in Q4.” And this is backed up by the digital data. In the 13 weeks ending April 24, 2021, YoY growth in traffic to superdry.com globally was up 19.8%, and the upward trend continued into May. See Superdry’s key digital data points here 4. Dr. Martens – puts its best foot forward Ticker: DOCS Dr. Martens was one of 2021’s most anticipated London Stock Exchange IPOs. The popular British footwear name went public in January 2021 and its share price has shown quite a bit of volatility ever since. Turning to the digital data, we see that in the U.S., which accounts for the largest traffic share to drmartens.com, site visits that converted to a sale, surged by 86% YoY in 1Q21. 5. Just Eat Takeaway – food for thought Ticker: JET Just Eat Takeaway has been a component of the FTSE 100 since Takeaway acquired Just Eat in early 2020. In the U.K. justeat.co.uk dominates the food delivery market, with more monthly visits to its site than competitors deliveroo.co.uk and ubereats.com combined. Read more on U.K. food delivery stocks Finding digital exposure in the U.K. is possible You have to search for them but it is possible to find U.K. stocks with a strong online presence. Above we have listed just a few and Similarweb can help you find even more. With near-real-time data on over 100 million websites, and 4.7 million apps, from 210+ industries, use this alternative dataset to generate more alpha, identify new investment opportunities, and strengthen your investment thesis. Try Similarweb for free by Liat Piazza Investor Insights Manager Liat creates data-driven content for the Similarweb Investor Solution, focusing on digital performance across various sectors. Related Topics: Stock Market This post is subject to Similarweb legal notices and disclaimers. Related Posts Stock Intelligence Top Tech Stocks and How to Track Their Performance Stock Market by Andrea Pash 8 Min. Feb 23, 2024 Stock Intelligence Game Changer: Alternative Data Evens the Playing Field Stock Market by Andrea Pash 3 Min. Oct 10, 2022 Stock Intelligence If You Build It: Home Depot vs. Lowes 1Q22 Pre-Earnings Insights Stock Market by Andrea Pash 3 Min. May 13, 2022 Stock Intelligence Big Tech Pre-Earnings Insights: Twitter, Apple, and Tesla? Stock Market by Andrea Pash 4 Min. Apr 22, 2022 Stock Intelligence Me and My Shadow: Up and Comers in the Online Dating Industry Stock Market by Andrea Pash 5 Min. Mar 22, 2022 Stock Intelligence And Just Like That: Peloton Pre-Earnings Insights Stock Market by Andrea Pash 3 Min. Feb 3, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Top U.K. Stocks to Give Your Portfolio Enhanced Digital Exposure"
    },
    {
      "level": "H2",
      "text": "1. Tesco – yes, really"
    },
    {
      "level": "H2",
      "text": "2. Moonpig – greetings from the pandemic"
    },
    {
      "level": "H2",
      "text": "3. Superdry – fashion leveraging the digital transformation"
    },
    {
      "level": "H2",
      "text": "4. Dr. Martens – puts its best foot forward"
    },
    {
      "level": "H2",
      "text": "5. Just Eat Takeaway – food for thought"
    },
    {
      "level": "H2",
      "text": "Finding digital exposure in the U.K. is possible"
    },
    {
      "level": "H3",
      "text": "Top Tech Stocks and How to Track Their Performance"
    },
    {
      "level": "H3",
      "text": "Game Changer: Alternative Data Evens the Playing Field"
    },
    {
      "level": "H3",
      "text": "If You Build It: Home Depot vs. Lowes 1Q22 Pre-Earnings Insights"
    },
    {
      "level": "H3",
      "text": "Big Tech Pre-Earnings Insights: Twitter, Apple, and Tesla?"
    },
    {
      "level": "H3",
      "text": "Me and My Shadow: Up and Comers in the Online Dating Industry"
    },
    {
      "level": "H3",
      "text": "And Just Like That: Peloton Pre-Earnings Insights"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Liat Piazza"
}