{
  "url": "https://www.similarweb.com/blog/investor/stock-market/uk-food-delivery-stocks/",
  "slug": "uk-food-delivery-stocks",
  "title": "Food Delivery Stocks U.K. 2Q21 – UBER, JET, ROO | Similarweb",
  "description": "The battle for U.K. food delivery stocks is tougher than ever. Who’s peddling to the top? We dive into the data for Deliveroo, Just Eat & Uber Eats.",
  "content": "HomeBlogStockStock MarketU.K. Food Delivery Stocks 2Q21: Who’s Peddling Higher Now? Stock Intelligence U.K. Food Delivery Stocks 2Q21: Who’s Peddling Higher Now? Access 3 Years of web data by Harriet Lefton , Investor Insights Manager 5 Min. July 5, 2021 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic The U.K. food delivery industry exploded during the pandemic. But as the lockdowns ease, which food delivery stock will come out on top? Here we use our Stock Intelligence platform to dive into the key alternative data trends for three of the market’s biggest players, namely Deliveroo (ROO), Uber Eats (UBER) and Just Eat Takeaway (JET). According to Lumina Intelligence, U.K. food delivery grew by £3.7 billion in 2020 to reach £11.4 billion – double its 2015 market value. However the research firm also estimates that this number will drop by almost 8% in 2021 as restaurants get back to business (although note this is still 37% higher than the pre-pandemic numbers). At the same time, a whole host of more disruptive names are also looking for a slice of this lucrative industry. We have feisty newcomers like Turkey’s Getir facing off against German rivals Flink and Gorillas. Meanwhile U.K. supermarkets like Tesco and Sainsbury’s are experimenting with their own food delivery services (look out for Whoosh, and Chop Chop respectively). Get our report on U.K. food delivery disruptors Now let’s look at our digital heatmaps to see what they reveal about the U.K. food industry. Food delivery stocks: Online growth falters Our digital heatmaps track in near real-time year-over-year (YoY) weekly website traffic trends. If we look at the digital heatmap for the U.K., we can see that the food delivery industry begins to experience an above average decline from early May onwards. That’s in sharp contrast to the beginning of the year (during lockdown) when the industry was enjoying notably stronger website YoY visitor trends than almost all the other industries. Given that website visit growth has slightly slowed, and more players are entering the market, it’s no surprise that competition is becoming increasingly fierce. Pizza feels the pain If we zoom into the food delivery heatmap and take a closer look at some of the individual websites, we see a clear split between food delivery websites in UK and own-brand pizza delivery websites. Uber Eats, Just Eat, and Deliveroo may have seen growth slow, but they are still seeing higher YoY website visits in comparison to the pizza websites. For example, Deliveroo’s YoY website visitor growth is down to 26% in the last week tracked vs. almost 100% growth in mid-March. Uber Eats website shows the best growth, with a stellar 195% YoY increase in traffic recorded in mid April. Meanwhile, it’s Dominos UK and Pizza Hut that are suffering the most, with pizzahut.co.uk looking particularly hard hit. Just Eat takes the #1 spot Although Uber Eats shows the most robust growth, in terms of numbers, there’s a clear winner in town when it comes to food delivery stocks. Justeat.co.uk dominates the U.K. food delivery market, with almost as many monthly visits to its site than competitors deliveroo.co.uk and ubereats.com combined. In May 2021, for instance, Just Eat scored 7 million website visits (up 32% YoY), with Deliveroo at 4.3 million (+17% YoY) and Uber Eats at 3.7 million (+86% YoY). Conversions deliver as expected Again, Just Eat is head and shoulders above the competition when it comes to its conversion rate. Given that conversion plays directly into revenue (as it measures the proportion of website visits that end in a transaction) this is a firm signal in Just Eat’s favor. What’s also notable is that Just Eat has not only maintained its conversion lead, it has actually managed to widen the gap with its rivals over the last few months. In May, Just Eat’s conversion rate came in at a very impressive 52% vs. 31% for Deliveroo and 26% for Uber Eats. This sets up the company for favorable U.K. growth in the coming months, even if demand softens in the near-term. Paid search: The secret sauce? Could paid search be a factor in Just Eat’s success? Interestingly, our data shows that Just Eat received a much higher proportion of website visitors from paid search than its rivals. In May 2021, 14% of just-eat.co.uk’s visitors came from paid search, vs. 8% for Uber Eats and 11% for Deliveroo. In contrast, Uber Eats has the highest proportion of website visitors coming from organic search (28% vs. 26% for Just Eat and just 19% for Deliveroo). Meanwhile, Deliveroo has the most website visitors coming direct (64% vs. and 62% for Uber Eats just 52% for Just Eat) – indicating that brand awareness is very strong for both these brands. Just Eat plus Grubhub: Food for thought Note that Just Eat’s parent company Just Eat Takeaway has just snapped up U.S. food delivery company Grubhub in a cool $7.3 billion all-share deal. The deal gives the company a clear shot at the U.S. food delivery market and also prevents rival Uber from gobbling up Grubhub itself. “Like ridesharing, the food delivery industry will need consolidation in order to reach its full potential for consumers and restaurants,” an Uber spokesperson told TechCrunch in an emailed statement. “That doesn’t mean we are interested in doing any deal, at any price, with any player.” However, a new report by Bank of America analysts gives the deal its seal of approval. The firm points out that DoorDash, which is only 1.6 times larger than Grubhub in terms of sales, has a market value that is 10 times larger – which suggests a positive risk-reward ratio for Just Eat stock. Similarweb data shows that Grubhub received almost 30 million U.S. visits to its website in May 2021. Food delivery service stocks: Bite-size takeaways Uber Eats is seeing strong YoY growth in site visits (86% in May 2021) Out of the food delivery stocks analyzed, just-eat.co.uk has the largest online market share (SoM) in the U.K. and continues to gain share Deliveroo.co.uk and ubereats.com appear to show stronger brand recognition than just-eat.co.uk Just Eat has one of the most engaged audiences, with an average visit duration of over 7 minutes. Keep your finger on the pulse of the market Try Similarweb now – it’s free Unlock three years of web data in one click by Harriet Lefton Investor Insights Manager Harriet, a Cambridge graduate and qualified U.K. lawyer, transitioned from metal market journalism to financial blogging, using digital data for investment insights. Related Topics: Stock Market This post is subject to Similarweb legal notices and disclaimers. Related Posts Stock Intelligence Top Tech Stocks and How to Track Their Performance Stock Market by Andrea Pash 8 Min. Feb 23, 2024 Stock Intelligence Game Changer: Alternative Data Evens the Playing Field Stock Market by Andrea Pash 3 Min. Oct 10, 2022 Stock Intelligence If You Build It: Home Depot vs. Lowes 1Q22 Pre-Earnings Insights Stock Market by Andrea Pash 3 Min. May 13, 2022 Stock Intelligence Big Tech Pre-Earnings Insights: Twitter, Apple, and Tesla? Stock Market by Andrea Pash 4 Min. Apr 22, 2022 Stock Intelligence Me and My Shadow: Up and Comers in the Online Dating Industry Stock Market by Andrea Pash 5 Min. Mar 22, 2022 Stock Intelligence And Just Like That: Peloton Pre-Earnings Insights Stock Market by Andrea Pash 3 Min. Feb 3, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "U.K. Food Delivery Stocks 2Q21: Who’s Peddling Higher Now?"
    },
    {
      "level": "H2",
      "text": "Food delivery stocks: Online growth falters"
    },
    {
      "level": "H2",
      "text": "Pizza feels the pain"
    },
    {
      "level": "H2",
      "text": "Just Eat takes the #1 spot"
    },
    {
      "level": "H2",
      "text": "Conversions deliver as expected"
    },
    {
      "level": "H2",
      "text": "Paid search: The secret sauce?"
    },
    {
      "level": "H2",
      "text": "Just Eat plus Grubhub: Food for thought"
    },
    {
      "level": "H2",
      "text": "Food delivery service stocks: Bite-size takeaways"
    },
    {
      "level": "H3",
      "text": "Try Similarweb now – it’s free"
    },
    {
      "level": "H3",
      "text": "Top Tech Stocks and How to Track Their Performance"
    },
    {
      "level": "H3",
      "text": "Game Changer: Alternative Data Evens the Playing Field"
    },
    {
      "level": "H3",
      "text": "If You Build It: Home Depot vs. Lowes 1Q22 Pre-Earnings Insights"
    },
    {
      "level": "H3",
      "text": "Big Tech Pre-Earnings Insights: Twitter, Apple, and Tesla?"
    },
    {
      "level": "H3",
      "text": "Me and My Shadow: Up and Comers in the Online Dating Industry"
    },
    {
      "level": "H3",
      "text": "And Just Like That: Peloton Pre-Earnings Insights"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Harriet Lefton"
}