{
  "url": "https://www.similarweb.com/blog/investor/stock-market/zoom-earnings-insights/",
  "slug": "zoom-earnings-insights",
  "title": "Zoom Earnings: What's Next for This COVID Winner? | Similarweb",
  "description": "Zoom earnings are just a few days away. As we head into the print, we took a closer look at the key digital data trends for this video conferencing pioneer.",
  "content": "HomeBlogStockStock MarketZoom Earnings: What's Next for This COVID Winner? Stock Intelligence Zoom Earnings: What’s Next for This COVID Winner? Get 3 years of ZM data by Harriet Lefton , Investor Insights Manager 4 Min. August 23, 2021 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Zoom Video Communications (ZM) is on the cusp of its fiscal second quarter earnings report on August 30. As expected, Zoom’s momentum is fading as lockdowns ease and on-site activity returns. Shares are underperforming year-to-date, even when compared to the overall video conferencing space. That’s despite an easy FQ1 earnings beat with 191% sales growth. In short, Zoom’s risk-reward ratio has now undeniably shifted. Even though many organizations now offer a more flexible work environment, especially with the COVID resurgence, Zoom will naturally struggle to replicate its 2020 growth levels. Notably, Zoom has just snapped up Five9, a cloud contact center software provider, in an all-stock deal worth a cool $14.7 billion. Like Zoom, Five9 had been a slow burn until the pandemic reinvented its value proposition. The acquisition signals Zoom’s intent to grow increasingly cross-functional. It could also help abate investor concerns over rivals Microsoft Teams and Salesforce’s recent Slack acquisition. Assessing our digital alternative data, here’s what we found ahead of Zoom’s earnings report: Zoom earnings: Key takeaways The overarching theme for Zoom’s earnings in F1Q22 is ‘steady, but decelerating.’ In particular it is likely Zoom will see a notable pullback in healthcare clients, with the return of in-person clinician appointments, and education clients, as students return to school after the summer. Meanwhile, Zoom’s small accounts, which boosted the company’s performance throughout FY2021, did begin to slip throughout the quarter. Zoom easily takes first place when it comes to visit numbers. Its monthly unique visitors (MUVs) are over 4x meet.google.com. But teams.microsoft.com takes the crown in respect of audience engagement. Visitors to teams. Microsoft spends considerably longer on the site than they do on zoom.us – a bullish sign for Microsoft’s video meeting offering. Website traffic stays stable Similarweb web traffic data show that global MUVs to zoom.us remained relatively stable from the first quarter to the second quarter, pulling back from 1.443 billion to 1.418 billion. This translates to a drop of just 2%. Nonetheless, this is the first time we have seen a quarter-over-quarter drop. Here we use MUV numbers to indicate the popularity, performance, and growth of a website. At the same time, MUV growth decelerated from +143% year-over-year (YoY) in F1Q22 to just +8% YoY in F2Q22. That’s down from a whopping +2219% in F4Q21. This reflects the fact that in the year-ago quarter there was a huge surge in users as coronavirus spread and lockdowns began, making YoY comparisons increasingly tough. However even if we compare this quarter’s MUV growth to the pre-pandemic quarters i.e. 61% and 50% in F3Q20 and F4Q20 respectively, we still see a meaningful slowdown. U.S. vs. rest of the world International is the next leg of Zoom’s growth journey. In Q1, the company revealed that its combined APAC and EMEA revenue grew 288% YoY to become approximately 34% of revenue, up from 25% a year ago. Chief financial officer Kelly Steckelberg commented: “In recent quarters, we made significant investments in our international teams, which have already begun to pay dividends. The global opportunity remains large, and we’ll continue to empower our team to capitalize on it.” Our data shows that the gap between international and U.S. user growth is beginning to widen. The graph below compares our U.S. data to worldwide data. The intra-quarter trend for global (excluding U.S.) is notably more bullish than the U.S. trend. Zoom and Google Meet gap narrows Zooming out, we compare traffic for zoom.us to meet.google.com and teams.microsoft.com. We can see clearly the quick ascent of meet.google.com from 33 million visits in February 2020 to 1.9 billion visits in March 2021. However, like zoom.us, Google’s Meet has also experienced a downward traffic trend since March 2021. Investors will be looking to ensure that this decrease in traffic reverses in the coming months and quarters. Zoom earnings: Small accounts hang on For Zoom, small account revenue was a primary driver of outperformance all of last year. Small accounts are defined as those with 10 or fewer employees. In Q1, small accounts accounted for an impressive 37% of revenue, up from 30% in Q1 last year and stable quarter over quarter. What’s more, as CFO Kelly Steckelberg highlighted, Zoom’s “net dollar expansion rate for [small accounts] exceeded 130% for the 12th consecutive quarter as customers acquired more Zoom Meetings, Rooms, Webinars, and Phone products.” Ahead of Zoom’s earnings report, we tracked ongoing engagement on paid small accounts by measuring overall traffic on universal domains, excluding free host accounts. Overall, we found that small account growth remains exceptionally robust, but is decelerating. On a 2-year growth basis, unique users on universal domains began to slip throughout 2Q22, suggesting that churn is beginning to creep higher. Insights to your inbox Here we focused on Zoom stock earnings. You can receive all our latest earnings previews and stock insights by subscribing to our Investor Newsflash. Track thousands of stocks and identify valuable investment opportunities using digital data insights. by Harriet Lefton Investor Insights Manager Harriet, a Cambridge graduate and qualified U.K. lawyer, transitioned from metal market journalism to financial blogging, using digital data for investment insights. Related Topics: Stock Market This post is subject to Similarweb legal notices and disclaimers. Related Posts Stock Intelligence Top Tech Stocks and How to Track Their Performance Stock Market by Andrea Pash 8 Min. Feb 23, 2024 Stock Intelligence Game Changer: Alternative Data Evens the Playing Field Stock Market by Andrea Pash 3 Min. Oct 10, 2022 Stock Intelligence If You Build It: Home Depot vs. Lowes 1Q22 Pre-Earnings Insights Stock Market by Andrea Pash 3 Min. May 13, 2022 Stock Intelligence Big Tech Pre-Earnings Insights: Twitter, Apple, and Tesla? Stock Market by Andrea Pash 4 Min. Apr 22, 2022 Stock Intelligence Me and My Shadow: Up and Comers in the Online Dating Industry Stock Market by Andrea Pash 5 Min. Mar 22, 2022 Stock Intelligence And Just Like That: Peloton Pre-Earnings Insights Stock Market by Andrea Pash 3 Min. Feb 3, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Zoom Earnings: What’s Next for This COVID Winner?"
    },
    {
      "level": "H2",
      "text": "Zoom earnings: Key takeaways"
    },
    {
      "level": "H2",
      "text": "Website traffic stays stable"
    },
    {
      "level": "H2",
      "text": "U.S. vs. rest of the world"
    },
    {
      "level": "H2",
      "text": "Zoom and Google Meet gap narrows"
    },
    {
      "level": "H2",
      "text": "Zoom earnings: Small accounts hang on"
    },
    {
      "level": "H2",
      "text": "Insights to your inbox"
    },
    {
      "level": "H3",
      "text": "Top Tech Stocks and How to Track Their Performance"
    },
    {
      "level": "H3",
      "text": "Game Changer: Alternative Data Evens the Playing Field"
    },
    {
      "level": "H3",
      "text": "If You Build It: Home Depot vs. Lowes 1Q22 Pre-Earnings Insights"
    },
    {
      "level": "H3",
      "text": "Big Tech Pre-Earnings Insights: Twitter, Apple, and Tesla?"
    },
    {
      "level": "H3",
      "text": "Me and My Shadow: Up and Comers in the Online Dating Industry"
    },
    {
      "level": "H3",
      "text": "And Just Like That: Peloton Pre-Earnings Insights"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Harriet Lefton"
}