{
  "url": "https://moz.com/blog/category/marketing-industry/p10",
  "slug": "p10",
  "title": "Marketing Industry - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Cooper Hollmaier May 14, 2021 An Introduction to Accessibility and SEO [Series Part 1] Whiteboard Friday | Marketing Industry | User Experience (UX) Welcome back to Whiteboard Friday! To start us up after our break, guest host Cooper Hollmaier has put together a three-part series that shows how SEO and accessibility go hand-in-hand. In part one, he introduces us to the idea of optimizing not just for some of our audience, but all of our audience. Read this post By: Hayley Bowyer May 12, 2021 MozCon Virtual 2021 Interview Series: Wil Reynolds SEO Events | Marketing Industry | SEO Analytics Get to know this year’s amazing MozCon speakers with our interview series! First up, Wil Reynolds talks about the impact of 2020 on Seer Interactive, what challenges marketers must overcome when analyzing data, and gives us a sneak peek into his MozCon presentation. Read this post By: Amanda Milligan April 29, 2021 How to Use Surveys to Tap into Trending Conversations (and Build Links) Content Marketing | Marketing Industry | Link Building Most brands aren’t operating full newsrooms and don’t have the capacity to cover breaking news, but there are still ways to participate in relevant, newsworthy conversations — and surveys are a great option. See how you can utilize surveys to add value to conversations, and earn the interest of writers at top publications. Read this post By: Sarah Bird March 31, 2021 Women in SEO: Reflections on the Past, Present, and Future of Women in the Industry Marketing Industry As Women’s History Month draws to a close, Moz CEO Sarah Bird reflects on the contributions women have made to the SEO industry, and highlights the work we still have to do. Read this post By: Nadya Khoja March 29, 2021 6 Ways to Bring Empathy Into Your Marketing Strategy (in 2021 and Beyond) Marketing Industry | Marketing Psychology The world has changed and businesses need to adapt to the new needs of their customers if they're going to grow. The best way to do that is through empathy, but how do you take an empathetic approach to marketing? Read this post By: Christopher Long March 16, 2021 LiveBlogPosting Schema: A Powerful Tool for Top Stories Success Technical SEO | Search Engines | Marketing Industry When the team at Go Fish Digital began helping a large media company break into Google’s Top Stories for major single-day events, they discovered that one way many sites do this is through the use of a schema type called LiveBlogPosting. Here are there findings regarding what this structured data type is, how sites are using it, and what impact it might have on Top Stories visibility. Read this post By: Morgan McMurray March 9, 2021 According to the Experts: 5 Technical SEO Trends to Watch in 2021 Technical SEO | Marketing Industry To find out more about the state of technical SEO in 2021, we asked seven industry experts for their thoughts and advice. Read this post By: Stewart Fussell February 25, 2021 The Potential Impact of Gen Z on SEO Marketing Industry | Marketing Psychology Gen Z (or Zoomers, if you prefer) already makes up the largest generational cohort of America's population. How do they interact with search, and what does that mean for the future of SEO? Read this post By: Oeuyown Kim February 24, 2021 How Did US Stimulus Checks Impact On-Site Traffic and Conversions? [Case Study] Marketing Industry | SEO Analytics | SEO Reporting The team at Portent conducted a study verifying whether stimulus distributions correlated with revenue spikes in online retailers and auto industries. Dig into their results in this post, along with consumer data to use as predictive indicators through the rest of the pandemic. Read this post By: Dr. Peter J. Meyers January 19, 2021 The Best-Laid Plans: Can We Predict Anything About 2021? Marketing Industry | SEO Analytics | SEO Events How can we possibly plan for 2021 after the events of 2020? Dr. Pete reviews known Google events, what the COVID-19 timeline might look like, and how to prepare for re-opening. Read this post By: Nadya Khoja January 18, 2021 8 Unconventional Ways to Generate Qualified B2B Sales Leads Marketing Industry | SEO Events | Email Marketing It’s time to take an unconventional approach to lead generation, especially for B2B companies, because B2B is a different ballgame than B2C — and your strategies need to reflect your audience. Read this post By: Rachel Vandernick January 14, 2021 Travel SEO Trends and Pivots from 2020 (and What to Carry into 2021) Marketing Industry | SEO Analytics It’s hard to remember a time of greater collective cabin fever. Though with border closings, pre-travel testing, and business closures remaining a moving target, we can still expect that a majority of travel will happen closer to home in early 2021. Read this post By: Rob Ousbey January 13, 2021 The Evolution of SEO [Video Presentation] Marketing Industry | Advanced SEO | SEO Basics Last November, Moz VP Product, Rob Ousbey, gave a presentation at Web Con 2020 on the evolution of SEO, and we're sharing it with you today! Rob draws on his years of research experience in the industry to discuss how SEO has changed, and what that means for your strategies. Read this post By: Miriam Ellis January 11, 2021 2021 Local SEO Success: Expert Tips & Predictions Local SEO | Marketing Industry There’s never been a tougher year than 2021 for making marketing predictions, but the best local SEO takeaways often come from real-world anecdotes. You’ll find those here today from four local SEO experts, along with Miriam's predictions for the year ahead. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Marketing Industry"
    },
    {
      "level": "H2",
      "text": "An Introduction to Accessibility and SEO [Series Part 1]"
    },
    {
      "level": "H2",
      "text": "MozCon Virtual 2021 Interview Series: Wil Reynolds"
    },
    {
      "level": "H2",
      "text": "How to Use Surveys to Tap into Trending Conversations (and Build Links)"
    },
    {
      "level": "H2",
      "text": "Women in SEO: Reflections on the Past, Present, and Future of Women in the Industry"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "6 Ways to Bring Empathy Into Your Marketing Strategy (in 2021 and Beyond)"
    },
    {
      "level": "H2",
      "text": "LiveBlogPosting Schema: A Powerful Tool for Top Stories Success"
    },
    {
      "level": "H2",
      "text": "According to the Experts: 5 Technical SEO Trends to Watch in 2021"
    },
    {
      "level": "H2",
      "text": "The Potential Impact of Gen Z on SEO"
    },
    {
      "level": "H2",
      "text": "How Did US Stimulus Checks Impact On-Site Traffic and Conversions? [Case Study]"
    },
    {
      "level": "H2",
      "text": "The Best-Laid Plans: Can We Predict Anything About 2021?"
    },
    {
      "level": "H2",
      "text": "8 Unconventional Ways to Generate Qualified B2B Sales Leads"
    },
    {
      "level": "H2",
      "text": "Travel SEO Trends and Pivots from 2020 (and What to Carry into 2021)"
    },
    {
      "level": "H2",
      "text": "The Evolution of SEO [Video Presentation]"
    },
    {
      "level": "H2",
      "text": "2021 Local SEO Success: Expert Tips & Predictions"
    }
  ],
  "author": "Cooper Hollmaier\n          \n            Hayley Bowyer\n          \n            Amanda Milligan\n          \n            Sarah Bird\n          \n            Nadya Khoja\n          \n            Christopher Long\n          \n            Morgan McMurray\n          \n            Stewart Fussell\n          \n            Oeuyown Kim\n          \n            Dr. Peter J. Meyers\n          \n            Nadya Khoja\n          \n            Rachel Vandernick\n          \n            Rob Ousbey\n          \n            Miriam Ellis"
}