{
  "url": "https://moz.com/blog/category/marketing-industry/p19",
  "slug": "p19",
  "title": "Marketing Industry - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: David Mihm September 24, 2015 Announcing the 2015 Local Search Ranking Factors Results Local SEO | Marketing Industry I'm happy to announce that the results of the 2015 Local Search Ranking Factors Survey are in! Read this post By: Jennifer Sable Lopez September 18, 2015 Remembering Dana Lookadoo Marketing Industry | Moz News Today we mourn the loss of our dear friend, long-time community member, and constant shining star in the industry, Dana Lookadoo. We all have a story about Dana. I'd love to hear yours. Read this post By: Pyxl Marketing September 3, 2015 5 Content Marketing Tips for Healthcare Brands Content Marketing | Marketing Industry Privacy concerns shouldn't keep your healthcare company from diving into content marketing. The benefits far outweigh any potential pitfalls. Read this post By: Kelsey Libert September 1, 2015 Consumer Survey Reveals the Efficacy of Inbound vs. Outbound Marketing Industry With the growing resistance to interruptive marketing, it's clear that consumers are fed up with low-value, high noise marketing. But are some of these tactics and channels still an effective ingredient within a holistic marketing approach? Better yet, is inbound marketing any better in the eyes of the consumer? Read this post By: Jackelyn Magwire August 20, 2015 Is Online Marketing Gender-Diverse? Marketing Industry There's a compelling indicator of how our industry is evolving in an area that helps us become better marketers: gender equality. What's changed over time and what are we doing to improve gender diversity in the workplace? Read this post By: Amy Hebdon August 6, 2015 How to Make Paid Search Decisions that Won’t Sabotage Your Success Paid Search Marketing (PPC) | Marketing Industry | Online Advertising Whether your a PPC expert or a novice attempting to learn the nuances of the area, taking a smart-from-the-start approach is the best path to success. Read this post By: Ian Lurie August 4, 2015 Distance from Perfect Marketing Industry | SEO Basics All marketing includes some measure of distance from perfect, but no channel is more influenced by it than SEO. Are you moving your site closer to perfect? Read this post By: Dr. Peter J. Meyers July 28, 2015 ​The 2015 Online Marketing Industry Survey Marketing Industry | Moz News After sifting through more than 3,600 responses, we've painted a picture of the online marketing industry in 2015. Here's what we found. Read this post By: Kelsey Libert July 20, 2015 The Inbound Marketing Economy Marketing Industry Find out what digital marketing jobs are growing, what state you should be searching in, and where the money is with this research from Fractl and Moz. Read this post By: Mackenzie Fogelson June 17, 2015 How to Align Your Entire Company with Your Marketing Strategy Marketing Psychology | Marketing Industry | Branding Download this simple tool and follow these steps to align your entire company with 8 very important elements of your marketing strategy. Read this post S By: Serge Sokolov May 29, 2015 A Simple Guide to Overcoming Ad Blindness for Publishers Marketing Psychology | Marketing Industry | Online Advertising Ads don't do your brand much good if no one sees them. That's why it's important to understand how readers view them, which allows you to optimize the ad and the content they're a part of for greater performance. Read this post By: Andrea Lehr May 26, 2015 Exposing The Generational Content Gap: Three Ways to Reach Multiple Generations Content Marketing | Marketing Industry | Competitive Research Are you marketing content across generations? If so, there's a good bet you're missing some key opportunities, many of which are revealed in this study. Read this post By: Aaron Friedman May 19, 2015 Has Google Gone Too Far with the Bias Toward Its Own Content? Search Engines | Marketing Industry Has Google crossed the line from playing favorites to being downright deceitful? The way the search giant is handling some images in the Knowledge Graph certainly makes it a fair question. Read this post By: Benjamin Estes May 11, 2015 What Digital Marketing Managers Should Learn from the Agile Manifesto Marketing Industry The Agile movement has done a world of good for digital marketers, but we must think bigger than project management. We need to address the business culture that shapes the choices we make, and that's what the Agile Manifesto is about. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Marketing Industry"
    },
    {
      "level": "H2",
      "text": "Announcing the 2015 Local Search Ranking Factors Results"
    },
    {
      "level": "H2",
      "text": "Remembering Dana Lookadoo"
    },
    {
      "level": "H2",
      "text": "5 Content Marketing Tips for Healthcare Brands"
    },
    {
      "level": "H2",
      "text": "Consumer Survey Reveals the Efficacy of Inbound vs. Outbound"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Is Online Marketing Gender-Diverse?"
    },
    {
      "level": "H2",
      "text": "How to Make Paid Search Decisions that Won’t Sabotage Your Success"
    },
    {
      "level": "H2",
      "text": "Distance from Perfect"
    },
    {
      "level": "H2",
      "text": "​The 2015 Online Marketing Industry Survey"
    },
    {
      "level": "H2",
      "text": "The Inbound Marketing Economy"
    },
    {
      "level": "H2",
      "text": "How to Align Your Entire Company with Your Marketing Strategy"
    },
    {
      "level": "H2",
      "text": "A Simple Guide to Overcoming Ad Blindness for Publishers"
    },
    {
      "level": "H2",
      "text": "Exposing The Generational Content Gap: Three Ways to Reach Multiple Generations"
    },
    {
      "level": "H2",
      "text": "Has Google Gone Too Far with the Bias Toward Its Own Content?"
    },
    {
      "level": "H2",
      "text": "What Digital Marketing Managers Should Learn from the Agile Manifesto"
    }
  ],
  "author": "David Mihm\n          \n            Jennifer Sable Lopez\n          \n            Pyxl Marketing\n          \n            Kelsey Libert\n          \n            Jackelyn Magwire\n          \n            Amy Hebdon\n          \n            Ian Lurie\n          \n            Dr. Peter J. Meyers\n          \n            Kelsey Libert\n          \n            Mackenzie Fogelson\n          \n            Serge Sokolov\n          \n            Andrea Lehr\n          \n            Aaron Friedman\n          \n            Benjamin Estes"
}