{
  "url": "https://moz.com/blog/category/marketing-industry/p21",
  "slug": "p21",
  "title": "Marketing Industry - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Brad Shorr October 9, 2014 4 Pain Points When Creating Client Content - And Effective Cures SEO Copywriting | Marketing Industry Outsourcing your company's web copywriting can be a painful endeavor, especially when you're working with an agency that may not be aware of the processes and personalities at your business. At the end of the day, however, everyone wants the same thing: a quality product. Read this post By: Carla Dawson October 9, 2014 SEO Teaching: Should SEO Be Taught at Universities? Marketing Industry Despite the popularity and importance of SEO, the field has yet to gain significant traction at the university level other than a few courses here and there offered as part of a broader digital marketing degree. The tide could be turning, however slowly. Read this post By: Carter Bowles September 26, 2014 7 Neglected Facts Every Digital Marketer Needs to Know Marketing Industry Your business is far too important to trust to information that's of questionable authenticity, which can lead to lackluster results and lost revenue. These facts will open your mind and ensure your business decisions are based on fact, not fiction. Read this post By: Erica McGillivray September 25, 2014 The 2014 #MozCon Video Bundle Has Arrived! SEO Events | Marketing Industry | Video Get a front-row experience for all 28 sessions, plus their slide decks, with the 2014 MozCon Video Bundle. Bringing you future-focused advice and actionable recommendations from some of the industry's most innovative minds, MozCon topics range from SEO and A/B testing to analytics and content marketing. Read this post By: Jonny Artis August 21, 2014 How Google's algorithmic changes are forcing businesses to reassess their digital business model Search Engines | Marketing Industry Organic search success is no longer about having the deepest pockets; it is about doing something remarkable. Read this post By: James Agate July 16, 2014 The New Link Building Survey 2014 - Results Link Building | Marketing Industry How has the marketing industry changed its views of link building since last year? James Agate of Skyrocket SEO is back with the results of a brand new survey. Read this post By: Anne Mercogliano June 18, 2014 Three Lead Generation Card Tips from the @TwitterSmallBiz Playbook Social Media | Marketing Industry Lead Generation Cards allow businesses to collect email addresses directly from their Twitter followers. In this post, Twitter's head of SMB marketing tells us about the tricks her team has learned to get the most out of using those cards. Read this post By: Kurtis Bohrnstedt April 24, 2014 2014 Inbound Marketing Trends Marketing Industry It's no secret that 2014 holds several promising opportunities for inbound marketers, as the industry is projected to see a lot of continued growth aided by increased budgets. According to the Moz Industry Survey, there are a few shifts in demand for certain marketing activities; are you spending your time where it matters most? Read this post By: Cyrus Shepard February 11, 2014 How Your Salary Compares to Online Marketers Across the World Marketing Industry A short time ago, Moz released the 2014 Industry Survey results. We collected data from over 3700 marketers spanning over 80 countries around the globe. We were able to slice the data many different ways to gain insight into the demographics, tools and tactics of online marketers living everywhere. One popular data point we wanted to examine is the changing salaries of online marketers. Here, we present the results. Read this post By: Cyrus Shepard January 28, 2014 New Top Strategies, Salaries and Tools: Announcing the 2014 Industry Survey Results Marketing Industry Late last year we set out to discover the top tools, tactics, and trends of the online marketing world. With the help of our partners, over 3700 participated in this year's Industry Survey. Today, Moz is proud to present the results. Read this post D By: Dave Wilson November 13, 2013 Bing vs Google: 11 Issues with the Bing It On Search Survey Marketing Industry Now, like most people in the search industry who don't work for a search engine, I think strong competition in the market is not just healthy, but essential. Also, I think most people who know the search industry will be thinking that something seems not quite right about that claim, so let's take a look into this claim and see what we can turn up. Read this post By: Wil Reynolds November 5, 2013 The One Thing I Would Change as the CEO of Moz Marketing Industry Last month, Rand and I swapped roles. He moved to Philadelphia to take the helm at SEER Interactive, and I moved to Seattle to head the efforts at Moz. This is my greatest takeaway for the Moz community and employees. Read this post By: Cyrus Shepard October 23, 2013 Take the 2013 Moz Industry Survey: Share Your Voice! Marketing Industry We're very excited to announce that this year's Industry Survey is ready for you to take. The results of this survey will be used to paint a picture of our industry, including its professionals, tactics, and its future. Make sure your voice (and those of your colleagues) are included in the results, and don't forget to enter your name in our drawing for some fantastic prizes! Read this post By: Rob Ousbey October 14, 2013 Inbound Recruiting: The Tactics You Already Know Make Hiring Easier and More Fun Marketing Industry As inbound marketers, it's easy to think we don't know the first thing about recruiting exceptional candidates to our companies. In reality, though, some of the best practices in hiring mirror the inbound tactics we use every day. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Marketing Industry"
    },
    {
      "level": "H2",
      "text": "4 Pain Points When Creating Client Content - And Effective Cures"
    },
    {
      "level": "H2",
      "text": "SEO Teaching: Should SEO Be Taught at Universities?"
    },
    {
      "level": "H2",
      "text": "7 Neglected Facts Every Digital Marketer Needs to Know"
    },
    {
      "level": "H2",
      "text": "The 2014 #MozCon Video Bundle Has Arrived!"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "How Google's algorithmic changes are forcing businesses to reassess their digital business model"
    },
    {
      "level": "H2",
      "text": "The New Link Building Survey 2014 - Results"
    },
    {
      "level": "H2",
      "text": "Three Lead Generation Card Tips from the @TwitterSmallBiz Playbook"
    },
    {
      "level": "H2",
      "text": "2014 Inbound Marketing Trends"
    },
    {
      "level": "H2",
      "text": "How Your Salary Compares to Online Marketers Across the World"
    },
    {
      "level": "H2",
      "text": "New Top Strategies, Salaries and Tools: Announcing the 2014 Industry Survey Results"
    },
    {
      "level": "H2",
      "text": "Bing vs Google: 11 Issues with the Bing It On Search Survey"
    },
    {
      "level": "H2",
      "text": "The One Thing I Would Change as the CEO of Moz"
    },
    {
      "level": "H2",
      "text": "Take the 2013 Moz Industry Survey: Share Your Voice!"
    },
    {
      "level": "H2",
      "text": "Inbound Recruiting: The Tactics You Already Know Make Hiring Easier and More Fun"
    }
  ],
  "author": "Brad Shorr\n          \n            Carla Dawson\n          \n            Carter Bowles\n          \n            Erica McGillivray\n          \n            Jonny Artis\n          \n            James Agate\n          \n            Anne Mercogliano\n          \n            Kurtis Bohrnstedt\n          \n            Cyrus Shepard\n          \n            Cyrus Shepard\n          \n            Dave Wilson\n          \n            Wil Reynolds\n          \n            Cyrus Shepard\n          \n            Rob Ousbey"
}