{
  "url": "https://ahrefs.com/blog/author/tim-soulo/page/2/",
  "slug": "2",
  "title": "Tim Soulo, Author at SEO Blog by Ahrefs - Page 2 of 3",
  "description": "Tim Soulo, Author at SEO Blog by Ahrefs - Page 2 of 3 - Page 2",
  "content": "SEO General SEOKeyword ResearchOn-Page SEOLink BuildingTechnical SEOLocal SEOEnterprise SEO Marketing General MarketingContent MarketingAffiliate MarketingPaid MarketingVideo Marketing Data & Studies Product Guides SEOKeyword ResearchOn-Page SEOLink BuildingTechnical SEOLocal SEO Search Search Subscribe Menu Search SEO General SEO Keyword Research On-Page SEO Link Building Technical SEO Local SEO Enterprise SEO Marketing General Marketing Content Marketing Affiliate Marketing Paid Marketing Video Marketing Data & Studies Product Guides SEO Keyword Research On-Page SEO Link Building Technical SEO Local SEO Subscribe AuthorsTim SouloCMO at AhrefsTim Soulo is the Chief Marketing Officer and Product advisor at Ahrefs. For the past 12 years Tim has been a prolific and notable contributor to the industries of SEO and digital marketing.His data research studies were cited by thousands of online publications including Inc, Techcrunch and Venturebeat and he has spoken at some of the largest industry conferences around the globe, such as PubCon (Las Vegas, US), BrightonSEO (Brighton, UK) and Digital Marketers Australia Conference (Melbourne, AU). Best new Ahrefs features & use cases (2023) Tim Soulo January 19, 2024 96.55% of Content Gets No Traffic From Google. Here’s How to Be in the Other 3.45% [New Research for 2023] Tim Soulo December 1, 2023 Link Building for SEO: The Beginner’s Guide Tim Soulo October 9, 2023 Ahrefs’ Affiliate Program. We Don’t Have One (& Here’s Why) Tim Soulo June 12, 2023 Keyword Database & Traffic Estimations - June Update Tim Soulo June 2, 2023 How We Used a Video Course to Promote Ahrefs (And Got 500K+ Views) Tim Soulo July 6, 2022 Keyword Difficulty: How to Estimate Your Chances to Rank Tim Soulo May 9, 2022 Domain Rating: What It Is & What It’s Good For Tim Soulo May 4, 2022 How Accurate Are the Search Traffic Estimations in Ahrefs? (New Research) Tim Soulo May 3, 2022 Ahrefs’ Keyword Data: More Coverage, Accuracy, and Utility Than Ever Before Tim Soulo February 10, 2022 Keyword Search Volume: 5 Things You Need to Know to Avoid SEO Mistakes Tim Soulo December 1, 2021 Long-tail Keywords: What They Are and How to Get Search Traffic From Them Tim Soulo November 25, 2021 How to Use Ahrefs: 11 Actionable Use Cases for Beginners Tim Soulo November 18, 2021 GSC vs. GKP: Comparing Search Volumes for 72k Keywords [A Study by Ahrefs] Tim Soulo November 3, 2021 Effective Email Outreach: 5 Lessons From 111 Emails Tim Soulo August 20, 2021 How to Do Keyword Research for SEO Tim Soulo November 25, 2020 Ahrefs Content Explorer 2.0: Rebuilt From Scratch (With New Features) Tim Soulo April 4, 2019 Ranking #1 on Google Is Overrated (Ahrefs’ Study of 100k Keywords) Tim Soulo March 28, 2019 Do Links From Pages With Traffic Help You Rank Higher? [Ahrefs Study] Tim Soulo February 19, 2019 Ahrefs Keywords Explorer 3.0: Re-Built From Scratch (With More Data) Tim Soulo February 4, 2019 Reciprocal Links: Will They Hurt Your SEO? (A Study by Ahrefs) Tim Soulo January 29, 2019 How Many New Backlinks Do Top-ranking Pages Get Over Time [New Data by Ahrefs] Tim Soulo September 18, 2018 Ahrefs’ Rank Tracker just got even better! Tim Soulo June 6, 2018 Ahrefs’ backlink index just got A LOT better (hint: search traffic data) Tim Soulo April 18, 2018 How many websites are mining cryptocurrency? We analyzed 175M+ domains to find out. Tim Soulo April 3, 2018 This is the new Site Audit tool by Ahrefs Tim Soulo December 14, 2017 New in September: Traffic value, JS crawling, “delayed” links & more Tim Soulo October 5, 2017 Ahrefs crawlers are now rendering web pages and executing JavaScript Tim Soulo September 7, 2017 This is the new Rank Tracker by Ahrefs Tim Soulo August 29, 2017 New in June: Backend magic, Ahrefs Academy, Link lost reasons, etc Tim Soulo July 5, 2017 123 Search English DeutschEspañolFrançaisItalianoPortuguês中文 EnglishDeutschEspañolFrançaisItalianoPortuguês中文 © 2024 Ahrefs Pte Ltd.Pick a topic SEO General SEO Keyword Research On-Page SEO Link Building Technical SEO Local SEO Enterprise SEO Marketing General Marketing Content Marketing Affiliate Marketing Paid Marketing Video Marketing Data & Studies Product Ahrefs Tools Core Tools Site Explorer Keywords Explorer Content Explorer Site Audit Rank Tracker Free Tools Backlink Checker Website Authority Checker Keyword Rank Checker Broken Link Checker SERP Checker Close Join the Ahrefs' DigestGet the week's best marketing content in your inbox. Email Subscription Subscribe Leave this field empty if you're human: Thanks!Please check your email inbox and spam folder. We've sent you a link to verify your email. Got It",
  "headers": [
    {
      "level": "H1",
      "text": "Tim Soulo"
    },
    {
      "level": "H3",
      "text": "Best new Ahrefs features & use cases (2023)"
    },
    {
      "level": "H3",
      "text": "96.55% of Content Gets No Traffic From Google. Here’s How to Be in the Other 3.45% [New Research for 2023]"
    },
    {
      "level": "H3",
      "text": "Link Building for SEO: The Beginner’s Guide"
    },
    {
      "level": "H3",
      "text": "Ahrefs’ Affiliate Program. We Don’t Have One (& Here’s Why)"
    },
    {
      "level": "H3",
      "text": "Keyword Database & Traffic Estimations - June Update"
    },
    {
      "level": "H3",
      "text": "How We Used a Video Course to Promote Ahrefs (And Got 500K+ Views)"
    },
    {
      "level": "H3",
      "text": "Keyword Difficulty: How to Estimate Your Chances to Rank"
    },
    {
      "level": "H3",
      "text": "Domain Rating: What It Is & What It’s Good For"
    },
    {
      "level": "H3",
      "text": "How Accurate Are the Search Traffic Estimations in Ahrefs? (New Research)"
    },
    {
      "level": "H3",
      "text": "Ahrefs’ Keyword Data: More Coverage, Accuracy, and Utility Than Ever Before"
    },
    {
      "level": "H3",
      "text": "Keyword Search Volume: 5 Things You Need to Know to Avoid SEO Mistakes"
    },
    {
      "level": "H3",
      "text": "Long-tail Keywords: What They Are and How to Get Search Traffic From Them"
    },
    {
      "level": "H3",
      "text": "How to Use Ahrefs: 11 Actionable Use Cases for Beginners"
    },
    {
      "level": "H3",
      "text": "GSC vs. GKP: Comparing Search Volumes for 72k Keywords [A Study by Ahrefs]"
    },
    {
      "level": "H3",
      "text": "Effective Email Outreach: 5 Lessons From 111 Emails"
    },
    {
      "level": "H3",
      "text": "How to Do Keyword Research for SEO"
    },
    {
      "level": "H3",
      "text": "Ahrefs Content Explorer 2.0: Rebuilt From Scratch (With New Features)"
    },
    {
      "level": "H3",
      "text": "Ranking #1 on Google Is Overrated (Ahrefs’ Study of 100k Keywords)"
    },
    {
      "level": "H3",
      "text": "Do Links From Pages With Traffic Help You Rank Higher? [Ahrefs Study]"
    },
    {
      "level": "H3",
      "text": "Ahrefs Keywords Explorer 3.0: Re-Built From Scratch (With More Data)"
    },
    {
      "level": "H3",
      "text": "Reciprocal Links: Will They Hurt Your SEO? (A Study by Ahrefs)"
    },
    {
      "level": "H3",
      "text": "How Many New Backlinks Do Top-ranking Pages Get Over Time [New Data by Ahrefs]"
    },
    {
      "level": "H3",
      "text": "Ahrefs’ Rank Tracker just got even better!"
    },
    {
      "level": "H3",
      "text": "Ahrefs’ backlink index just got A LOT better (hint: search traffic data)"
    },
    {
      "level": "H3",
      "text": "How many websites are mining cryptocurrency? We analyzed 175M+ domains to find out."
    },
    {
      "level": "H3",
      "text": "This is the new Site Audit tool by Ahrefs"
    },
    {
      "level": "H3",
      "text": "New in September: Traffic value, JS crawling, “delayed” links & more"
    },
    {
      "level": "H3",
      "text": "Ahrefs crawlers are now rendering web pages and executing JavaScript"
    },
    {
      "level": "H3",
      "text": "This is the new Rank Tracker by Ahrefs"
    },
    {
      "level": "H3",
      "text": "New in June: Backend magic, Ahrefs Academy, Link lost reasons, etc"
    }
  ],
  "author": "Tim Soulo  Tim Soulo  Tim Soulo  Tim Soulo  Tim Soulo  Tim Soulo  Tim Soulo  Tim Soulo  Tim Soulo  Tim Soulo  Tim Soulo  Tim Soulo  Tim Soulo  Tim Soulo  Tim Soulo  Tim Soulo  Tim Soulo  Tim Soulo  Tim Soulo  Tim Soulo  Tim Soulo  Tim Soulo  Tim Soulo  Tim Soulo  Tim Soulo  Tim Soulo  Tim Soulo  Tim Soulo  Tim Soulo  Tim Soulo"
}