{
  "url": "https://moz.com/blog/category/search-engines/p12",
  "slug": "p12",
  "title": "Search Engines - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Dr. Peter J. Meyers May 30, 2019 Is Google's Redesign Good for Ads or Brands? Search Engines At the end of last week, Google announced a major design change for mobile search results. Does this latest change do too much to blend ads and organic results? Read this post By: Roger MozBot May 27, 2019 Analyzing Google's Desktop \"People Also Search For\" Box Search Engines | Marketing Industry | SEO Analytics We’ll take you through how the PASF has changed over the years and how you can take advantage of everything it has to offer. Read this post By: Dr. Peter J. Meyers May 22, 2019 Podcasts in SERPs: Is Audio SEO the Next Frontier? Search Engines | Advanced SEO At I/O 2019, Google announced that podcasts would soon be coming to organic SERPs. We know they've been able to transcribe audio for a while. What's next for audio SEO and how can we prepare for it? Read this post By: Roger MozBot May 15, 2019 How to Explore a SERP Feature Strategy with STAT Search Engines | Advanced SEO | Keyword Research With SERP features are taking over, here’s how you can uncover the ones that’ll work for you. Read this post By: Dr. Peter J. Meyers May 14, 2019 How Often Does Google Update Its Algorithm? Search Engines In 2018, Google reported an incredible 3,234 improvements to search. That's more than 8 times the number of updates they reported in 2009 and an average of almost 9 per day. Read this post By: Miriam Ellis May 7, 2019 I Want to Rank Beyond My Location: A Guide to How This Works Local SEO | Search Engines We’ll break rankings down into five easy-to-grasp groups, and make sense out of how Google appears to bucket rankings for different types of users and queries. Read this post By: Justin Champion May 6, 2019 Creating Quality Content in 2019 (For Search Engines and People) Content Marketing | Search Engines | SEO Copywriting Learn how to solve for searcher intent to create successful, quality content that makes people (and Google) happy. Read this post By: Lily Ray April 22, 2019 We Surveyed 1,400 Searchers About Google - Here's What We Learned Search Engines | Marketing Psychology | Marketing Industry We surveyed 1,400 respondents to better understand how they search. Here's what we learned. Read this post By: Dr. Peter J. Meyers April 11, 2019 How Bad Was Google's Deindexing Bug? Search Engines | Advanced SEO On Friday, April 5, Google confirmed a bug that was causing pages to be deindexed. Our analysis suggests that roughly 4% of stable URLs fell out of page-1 rankings on April 5, and that deindexing impacted a wide variety of websites. Read this post By: Miriam Ellis April 8, 2019 How to Find Your True Local Competitors Local SEO | Search Engines | Competitive Research Who are your clients’ true competitors if every SERP is a local SERP these days? We'll help you answer that question. Read this post By: Paola-Didone March 26, 2019 The 5 SEO Recommendations That Matter in the End SEO Basics | Search Engines | On-page SEO SEO is an ever-changing game. Here are 5 things that I consider to be evergreen SEO recommendations. Read this post By: Miriam Ellis March 19, 2019 5 Google Business Profile Tweaks To Improve Foot Traffic Local SEO | Search Engines | Branding Leverage these 5 Google Business Profile tips to increase your client's foot traffic. Read this post By: Tom Capper March 13, 2019 5 Reasons Legacy Brands Struggle With SEO (and What to Do About Them) Branding | Search Engines | Conversion Rate Optimization (CRO) Why well-known brands run into SEO difficulties and 5 recommended tactics to help remedy them. Read this post By: Dr. Peter J. Meyers March 4, 2019 March 1st Google Update: The Mysterious Case of the 19-Result SERPs Search Engines | Advanced SEO On February 28th and March 1st, we saw unusually high rankings flux. Digging into the data, we captured hundreds of SERPs with more than 10 page-one organic results, with some having as many as 19. These appeared to be similar to In-depth Articles, but they disappeared the next day. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Search Engines"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Search Engines"
    },
    {
      "level": "H2",
      "text": "Is Google's Redesign Good for Ads or Brands?"
    },
    {
      "level": "H2",
      "text": "Analyzing Google's Desktop \"People Also Search For\" Box"
    },
    {
      "level": "H2",
      "text": "Podcasts in SERPs: Is Audio SEO the Next Frontier?"
    },
    {
      "level": "H2",
      "text": "How to Explore a SERP Feature Strategy with STAT"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "How Often Does Google Update Its Algorithm?"
    },
    {
      "level": "H2",
      "text": "I Want to Rank Beyond My Location: A Guide to How This Works"
    },
    {
      "level": "H2",
      "text": "Creating Quality Content in 2019 (For Search Engines and People)"
    },
    {
      "level": "H2",
      "text": "We Surveyed 1,400 Searchers About Google - Here's What We Learned"
    },
    {
      "level": "H2",
      "text": "How Bad Was Google's Deindexing Bug?"
    },
    {
      "level": "H2",
      "text": "How to Find Your True Local Competitors"
    },
    {
      "level": "H2",
      "text": "The 5 SEO Recommendations That Matter in the End"
    },
    {
      "level": "H2",
      "text": "5 Google Business Profile Tweaks To Improve Foot Traffic"
    },
    {
      "level": "H2",
      "text": "5 Reasons Legacy Brands Struggle With SEO (and What to Do About Them)"
    },
    {
      "level": "H2",
      "text": "March 1st Google Update: The Mysterious Case of the 19-Result SERPs"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Roger MozBot\n          \n            Dr. Peter J. Meyers\n          \n            Roger MozBot\n          \n            Dr. Peter J. Meyers\n          \n            Miriam Ellis\n          \n            Justin Champion\n          \n            Lily Ray\n          \n            Dr. Peter J. Meyers\n          \n            Miriam Ellis\n          \n            Paola-Didone\n          \n            Miriam Ellis\n          \n            Tom Capper\n          \n            Dr. Peter J. Meyers"
}