{
  "url": "https://moz.com/blog/category/search-engines/p13",
  "slug": "p13",
  "title": "Search Engines - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Roger MozBot February 27, 2019 14 SEO Predictions for 2019 and Beyond, as Told by Mozzers Marketing Industry | Search Engines | Advanced SEO Better late than never, we've got fourteen predictions for SEO in the coming year—ranging from the monetization of Google to continued domination of SERP features—straight from the experts here at Moz. Read this post By: Roger MozBot February 25, 2019 We Dipped Our Toes Into Double Featured Snippets Competitive Research | Search Engines | Advanced SEO Double-snippet SERPs started trickling in last year, so we took a peek at what they’re up to. Read this post By: Will Critchlow February 22, 2019 What a Two-Tiered SERP Means for Content Strategy Content Marketing | Search Engines | Whiteboard Friday If you're a big site competing to rank for popular head terms, where's the best place to focus your content strategy? According to a hypothesis by the good folks at Distilled, the answer may lie in perfectly satisfying searcher intent. Read this post By: Roger MozBot February 21, 2019 The Influence of Voice Search on Featured Snippets Search Engines | Content Marketing | Advanced SEO We’re in the midst of a natural language renaissance. And voice search is helping lead the charge, as well as the change in snippets. Read this post By: Roger MozBot February 6, 2019 Exploring Google's New Carousel Featured Snippet SEO Analytics | Search Engines | Content Marketing In an effort to answer questions before you can even ask them, Google invented the carousel snippet. And then we ran the numbers to see what it’s all about. Read this post By: Roger MozBot January 24, 2019 Mapping the Overlap of SERP Feature Suggestions Search Engines | Advanced SEO | Competitive Research We explored the search suggestions packed into SERP features to see how much overlap might exist as a result of Google's endless topical organization. Read this post By: Barry Adams January 11, 2019 How to Get Into Google News Search Engines | Whiteboard Friday | Content Marketing How To Appear In Google News: How do you increase your chances of getting into Google News? Barry Adams shares the absolute requirements that can increase your chances of appearing in the much-coveted Google news carousel. Read this post By: Miriam Ellis January 7, 2019 Taking Local Inventory Online: An Interview with Pointy’s Mark Cummins Local SEO | Search Engines | E-Commerce SEO Getting inventory online and competing with e-commerce giants is a huge obstacle for local retailers. In this interview with former Googler Mark Cummins, we explore the workings of a new option that takes advantage of the See What's In Store feature to gain a competitive edge. Read this post By: Will Critchlow December 14, 2018 3 Big Lessons from Interviewing John Mueller at SearchLove London Search Engines | Whiteboard Friday When you've got one of Google's most helpful and empathetic voices willing to answer your most pressing SEO questions, what do you ask? Will Critchlow shares his best lessons from interviewing John Mueller, covering the concept of Domain Authority, the great subdomain versus subfolder debate, and a view into the technical workings of noindex/nofollow. Read this post By: Miriam Ellis December 12, 2018 Why Local Businesses Will Need Websites More than Ever in 2019 Local SEO | Search Engines | Link Building Even as Google makes itself the new \"homepage\" for local, it's becoming more and more important for local businesses to maintain a website. Learn how and why it's integral to put effort into both local and organic in 2019. Read this post By: Emily Potter November 14, 2018 What Do You Do When You Lose Organic Traffic to Google SERP Features? Advanced SEO | Search Engines | Content Marketing Google’s increasing dominance of their own SERPs has kicked up a lot of panic in the SEO industry. Discover smart strategies for climbing back to the top in this actionable article. Read this post By: Miriam Ellis October 23, 2018 The Ultimate Cheat Sheet for Taking Full Control of Your Google Knowledge Panels Local SEO | Search Engines Google's local Knowledge Panel is more detailed and more confusing than ever. Make sure your business is maximizing your GMB potential with this handy visual cheat sheet. Read this post By: Dr. Peter J. Meyers August 9, 2018 Google's August 1st Core Update: Week 1 Search Engines One week after the August 1st core update, it's clear that this was a big one. We dive into the impact, including winners and losers, and whether there's a connection to the health and wellness industry. Read this post By: Rand Fishkin July 20, 2018 Reputation Management SEO: How to Own Your Branded Keywords in Google Search Engines | Whiteboard Friday A searcher's first impression happens on Google's SERPs, not your website. In this Whiteboard Friday, Rand takes us through the inherent challenges of reputation management SEO and tactics for doing it effectively. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Search Engines"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Search Engines"
    },
    {
      "level": "H2",
      "text": "14 SEO Predictions for 2019 and Beyond, as Told by Mozzers"
    },
    {
      "level": "H2",
      "text": "We Dipped Our Toes Into Double Featured Snippets"
    },
    {
      "level": "H2",
      "text": "What a Two-Tiered SERP Means for Content Strategy"
    },
    {
      "level": "H2",
      "text": "The Influence of Voice Search on Featured Snippets"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Exploring Google's New Carousel Featured Snippet"
    },
    {
      "level": "H2",
      "text": "Mapping the Overlap of SERP Feature Suggestions"
    },
    {
      "level": "H2",
      "text": "How to Get Into Google News"
    },
    {
      "level": "H2",
      "text": "Taking Local Inventory Online: An Interview with Pointy’s Mark Cummins"
    },
    {
      "level": "H2",
      "text": "3 Big Lessons from Interviewing John Mueller at SearchLove London"
    },
    {
      "level": "H2",
      "text": "Why Local Businesses Will Need Websites More than Ever in 2019"
    },
    {
      "level": "H2",
      "text": "What Do You Do When You Lose Organic Traffic to Google SERP Features?"
    },
    {
      "level": "H2",
      "text": "The Ultimate Cheat Sheet for Taking Full Control of Your Google Knowledge Panels"
    },
    {
      "level": "H2",
      "text": "Google's August 1st Core Update: Week 1"
    },
    {
      "level": "H2",
      "text": "Reputation Management SEO: How to Own Your Branded Keywords in Google"
    }
  ],
  "author": "Roger MozBot\n          \n            Roger MozBot\n          \n            Will Critchlow\n          \n            Roger MozBot\n          \n            Roger MozBot\n          \n            Roger MozBot\n          \n            Barry Adams\n          \n            Miriam Ellis\n          \n            Will Critchlow\n          \n            Miriam Ellis\n          \n            Emily Potter\n          \n            Miriam Ellis\n          \n            Dr. Peter J. Meyers\n          \n            Rand Fishkin"
}