{
  "url": "https://moz.com/blog/category/search-engines/p15",
  "slug": "p15",
  "title": "Search Engines - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Lindsay Kolowich November 16, 2017 How & Why to Make Your Website More Secure Search Engines | Technical SEO Last month, Google stepped up their game when it comes to holding sites to security standards. If you're not sure whether your site's security levels make the cut or need tips on how to get started, this primer will help. Read this post By: Rand Fishkin November 10, 2017 How Google Gives Us Insight into Searcher Intent Through the Results Whiteboard Friday | Search Engines Buried inside most SERPs (especially those with more general queries) is a host of insight into Google's assumptions about searcher intent. Rand explains how you can find it. Read this post By: Bartosz Góralewicz October 16, 2017 Google Shares Details About the Technology Behind Googlebot Technical SEO | Search Engines | Advanced SEO It's been revealed that version 41 of the Google Chrome browser is the technology behind Google's crawler. What does this mean for developers, and how can you use this in your own SEO toolkit? Read this post By: Bartosz Góralewicz October 16, 2017 Does Googlebot Support HTTP/2? Challenging Google's Indexing Claims – An Experiment Technical SEO | Search Engines | Advanced SEO Googlebot can't crawl or index sites using HTTP/2 alone. Based on the results of this experiment, you may want to continue optimizing for HTTP/1.1 as well. Read this post By: Joy Hawkins October 9, 2017 Yes, Competitors Can Edit Your Listing on Google My Business Local SEO | Search Engines Google's statements about GMB spam aren't entirely accurate. Joy Hawkins busts a few myths about whether or not competitors can edit your listing without your approval. Read this post By: Brian Wood October 5, 2017 New Findings Show Google Organic Clicks Shifting to Paid E-Commerce SEO | Search Engines One large e-commerce brand noticed a startling shift in organic CTR, with paid ads now earning nearly the same percentage of clicks as organic results. What does this mean and how can sites combat the new trend? Read this post By: Everett Sizemore September 26, 2017 How and Why to Do a Mobile/Desktop Parity Audit Advanced SEO | Search Engines | Mobile SEO You should do a mobile/desktop parity audit if content is added, removed, hidden, or changed between devices without sending the user to a new URL. When two or more versions of a website are available on the same URL a parity audit will crawl each version, compare the differences, and look for errors. Read this post By: Bartosz Góralewicz August 29, 2017 Going Beyond Google: Are Search Engines Ready for JavaScript Crawling & Indexing? Advanced SEO | Search Engines We have proof via experimentation that Google doesn't index all JavaScript-rich content, but what about its competitors? Can other search engines compete? Read this post By: Rand Fishkin August 25, 2017 How to Determine if a Page is \"Low Quality\" in Google's Eyes Search Engines | Whiteboard Friday | Advanced SEO What makes a page high or low quality? How can you easily filter pages on your site to determine which pages are of high importance, which need work, and which are just plain bad? Check out the answers in this edition of Whiteboard Friday. Read this post By: Rand Fishkin July 21, 2017 Is the New, Most Powerful Ranking Factor \"Searcher Task Accomplishment?\" Search Engines | Whiteboard Friday | Advanced SEO There's a new ranking factor in town, and it's one that will affect almost every aspect of your site optimization. Check out why searcher task accomplishment is such a big deal in today's Whiteboard Friday. Read this post By: Russ Jones July 12, 2017 The Unspoken Reality of Net Neutrality Search Engines | Moz News Learn why net neutrality impacts far more than what you have been led to believe. Join us in our Day of Action. Read this post By: Alexandra Tachalova July 11, 2017 This Is What They Search For: The Most Popular US Industries & Traffic Shares Marketing Industry | Search Engines Which sites own the largest traffic share in the US? What industries benefit the most from YouTube, and where should you focus your own efforts? Find out answers to these questions and more in new research from Alexandra Tachalova. Read this post By: Dr. Peter J. Meyers May 23, 2017 Lessons from 1,000 Voice Searches (on Google Home) Search Engines | Advanced SEO I ran 1,000 searches on Google Home to find out how voice answers differ from desktop answers. Includes data on Featured Snippets and some Google Home Easter eggs. Read this post By: Dr. Peter J. Meyers April 24, 2017 Half of Page-1 Google Results Are Now HTTPS Search Engines | Technical SEO HTTPS results have topped 50% of page-1 Google rankings, according to our 10K tracking data. Dr. Pete explores the trends, major hold-outs, and what to expect in the near future. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Search Engines"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Search Engines"
    },
    {
      "level": "H2",
      "text": "How & Why to Make Your Website More Secure"
    },
    {
      "level": "H2",
      "text": "How Google Gives Us Insight into Searcher Intent Through the Results"
    },
    {
      "level": "H2",
      "text": "Google Shares Details About the Technology Behind Googlebot"
    },
    {
      "level": "H2",
      "text": "Does Googlebot Support HTTP/2? Challenging Google's Indexing Claims – An Experiment"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Yes, Competitors Can Edit Your Listing on Google My Business"
    },
    {
      "level": "H2",
      "text": "New Findings Show Google Organic Clicks Shifting to Paid"
    },
    {
      "level": "H2",
      "text": "How and Why to Do a Mobile/Desktop Parity Audit"
    },
    {
      "level": "H2",
      "text": "Going Beyond Google: Are Search Engines Ready for JavaScript Crawling & Indexing?"
    },
    {
      "level": "H2",
      "text": "How to Determine if a Page is \"Low Quality\" in Google's Eyes"
    },
    {
      "level": "H2",
      "text": "Is the New, Most Powerful Ranking Factor \"Searcher Task Accomplishment?\""
    },
    {
      "level": "H2",
      "text": "The Unspoken Reality of Net Neutrality"
    },
    {
      "level": "H2",
      "text": "This Is What They Search For: The Most Popular US Industries & Traffic Shares"
    },
    {
      "level": "H2",
      "text": "Lessons from 1,000 Voice Searches (on Google Home)"
    },
    {
      "level": "H2",
      "text": "Half of Page-1 Google Results Are Now HTTPS"
    }
  ],
  "author": "Lindsay Kolowich\n          \n            Rand Fishkin\n          \n            Bartosz Góralewicz\n          \n            Bartosz Góralewicz\n          \n            Joy Hawkins\n          \n            Brian Wood\n          \n            Everett Sizemore\n          \n            Bartosz Góralewicz\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Russ Jones\n          \n            Alexandra Tachalova\n          \n            Dr. Peter J. Meyers\n          \n            Dr. Peter J. Meyers"
}