{
  "url": "https://moz.com/blog/category/search-engines/p2",
  "slug": "p2",
  "title": "Search Engines - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Tom Capper May 24, 2024 The Top SERP Features in 2024 — Whiteboard Friday Whiteboard Friday | Search Engines In this Whiteboard Friday, Tom takes us through the top SERP features of 2024 by both presence and Share of Voice. Read this post By: Lily Ray May 20, 2024 March Core Update & Spam Updates: Four Major Trends Search Engines | Marketing Industry | Algorithm Updates Explore the aftermath of Google's March Core Update and Spam Updates and uncover four major trends shaping the search landscape. Read this post By: Dr. Peter J. Meyers May 14, 2024 Google’s Surgical Strike on Reputation Abuse Search Engines | Marketing Industry Discover the aftermath of Google's targeted crackdown on reputation abuse. Analyze significant losses, identify patterns, and investigate the impact it has had on major brands. Read this post By: Tom Capper May 3, 2024 What Is Google Clamping Down On? Spring 2024 Updates — Whiteboard Friday Whiteboard Friday | Search Engines | AI and SEO Learn about Google updates from this Spring in this Whiteboard Friday with Tom Capper. Read this post By: Tom Capper April 12, 2024 How to Appear in Position One in 2024 — Whiteboard Friday Whiteboard Friday | Search Engines | Marketing Industry Unlock the secrets of SERP dominance in 2024 with Tom Capper. Discover the evolving landscape of position one rankings and seize the opportunities amidst shifting trends in SEO. Read this post By: Dr. Peter J. Meyers March 28, 2024 Charting 10 Years of The Google Algorithm Search Engines | Marketing Industry | Algorithm Updates Explore a decade of Google's ever-evolving algorithm, revealing over 30,000 changes and a surge in updates, as we delve into the intricate dance between human-driven decisions and machine learning's influence on search rankings. Read this post By: Isa Lavahun March 22, 2024 How Inclusivity Drives Link Diversity — Whiteboard Friday Link Building | Search Engines Inclusivity makes business sense. Discover how targeting diverse audiences can enhance your backlink profile, boost trust with Google, and ultimately drive revenue. Read this post By: Julia-Carolin Zeng March 15, 2024 How the SERPs Guide Content — Whiteboard Friday Content Marketing | Search Engines From videos to featured snippets, discover how SERPs can help us with our content creation in this Whiteboard Friday with Julia-Carolin Zeng. Read this post By: Clara Soteras February 21, 2024 What Is Google Discover, and How Can You Boost Your Traffic? Search Engines | Content Marketing Explore the intricate world of Google Discover and elevate your content strategy with insights from top SEO experts. Read this post By: Miriam Ellis February 19, 2024 How to Create a Decent One-Page Local Business Site in the Face of the Google Website Shutdown Local SEO | Search Engines Nothing could be worse for a business than existing customers thinking you no longer exist. With millions of Google Business Profile websites being shut down, Miriam Ellis outlines your options for a free/cheap replacement site, with tons of tips for making a strong 1-page presence. Read this post By: Tom Capper February 16, 2024 How Volatile Are Search Results? — Whiteboard Friday Whiteboard Friday | Search Engines | Algorithm Updates How volatile are organic search rankings day to day? Tom dives into data he captured using STAT to answer this question. Read this post By: Tom Capper December 19, 2023 User Signals as a Ranking Factor & US vs. Google Search Engines | Marketing Industry Explore the debate of whether or not user signals are a ranking factor in this article with Tom Capper. Read this post By: Zach Edelstein December 12, 2023 How Will SGE Impact Your Organic Traffic? Search Engines | Marketing Industry | AI and SEO Zach discusses Google’s Search Generative Experience, including a step-by-step template that will allow you to estimate the traffic losses or gains your site may experience. Read this post By: Miriam Ellis November 16, 2023 Is the Nearby Filter Nav Actually Making Google’s SERPs More Local? Local SEO | Search Engines Is the Nearby filter navigation actually making Google’s SERPs more local? Find out more through Miriam’s research. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Search Engines"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Search Engines"
    },
    {
      "level": "H2",
      "text": "The Top SERP Features in 2024 — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "March Core Update & Spam Updates: Four Major Trends"
    },
    {
      "level": "H2",
      "text": "Google’s Surgical Strike on Reputation Abuse"
    },
    {
      "level": "H2",
      "text": "What Is Google Clamping Down On? Spring 2024 Updates — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "How to Appear in Position One in 2024 — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Charting 10 Years of The Google Algorithm"
    },
    {
      "level": "H2",
      "text": "How Inclusivity Drives Link Diversity — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "How the SERPs Guide Content — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "What Is Google Discover, and How Can You Boost Your Traffic?"
    },
    {
      "level": "H2",
      "text": "How to Create a Decent One-Page Local Business Site in the Face of the Google Website Shutdown"
    },
    {
      "level": "H2",
      "text": "How Volatile Are Search Results? — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "User Signals as a Ranking Factor & US vs. Google"
    },
    {
      "level": "H2",
      "text": "How Will SGE Impact Your Organic Traffic?"
    },
    {
      "level": "H2",
      "text": "Is the Nearby Filter Nav Actually Making Google’s SERPs More Local?"
    }
  ],
  "author": "Tom Capper\n          \n            Lily Ray\n          \n            Dr. Peter J. Meyers\n          \n            Tom Capper\n          \n            Tom Capper\n          \n            Dr. Peter J. Meyers\n          \n            Isa Lavahun\n          \n            Julia-Carolin Zeng\n          \n            Clara Soteras\n          \n            Miriam Ellis\n          \n            Tom Capper\n          \n            Tom Capper\n          \n            Zach Edelstein\n          \n            Miriam Ellis"
}