{
  "url": "https://moz.com/blog/category/search-engines/p38",
  "slug": "p38",
  "title": "Search Engines - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: AjiNIMC May 29, 2008 Solving Duplicate Content Issues with Http and Https Search Engines I just took a premium account with SEOMoz and saw the canonicalization video. It was impressive except the https part of it. It said that, for https try to redirect to http in case of bot and otherwise show the https page, as https pages are meant for users not for bot. Yeah, somehow I can agree but I still won’t recommend doing such a work ... Read this post A By: AdamDorfman May 23, 2008 Google Now Pulling Primary Link Text from Meta Descriptions Search Engines It appears that Google is using content from the meta description to populate the primary link for certain queries even if there is a <title> tag in place. Example:Site: http://www.nottawasagaresort.com/ Title: Nottawasaga ResortMeta Description: Nottawasaga Inn Convention Centre & Golf ResortDMOZ Description: A 575 acre resort offeri... Read this post G By: Gary Arndt May 23, 2008 Google Image Traffic and Flickr Search Engines I've found very little written on this subject, so I thought I'd take the time to write what I have learned and hopefully raise some questions which can be addressed by people with more SEO experience than myself. I run a very photo heavy travel blog. I have a photo which I post every day in addition to ph... Read this post By: Richard Baxter May 20, 2008 Why is Yahoo! Hiding Links from Google? Search Engines Why would Yahoo! be using UA detection (User Agent) to hide links from Google?This is a question I'd love to hear an answer to after stumbling across Yahoo's homepage with my user agent set to Googlebot. Here are the screen shots...1) Yahoo homepage with UA set to default in Firefox:... Read this post By: Rand Fishkin May 11, 2008 Does \"Query Deserves Diversity\" Algorithm Exist at Google? Search Engines Most of us in the search space are familiar with the principles of the \"query deserves diversity\" (QDF) algorithm at Google, but this is almost certainly not the only intent detection process and algo-tweaking area the engine applies. One popular theory that gets inspires a good bit of discussion around the SEO water cooler is that Google may recognize queries with the potential for mult... Read this post By: Rand Fishkin May 6, 2008 Google Spam Illuminates the Algo's Reliance on Domain Authority Search Engines Try a few searches with me... Buy Viagra Cialis Online Cheap Payday Loans ... Read this post P By: Phil Berryman May 5, 2008 Telegraph is Breaking News Before It's Happened Search Engines Here in rainy London we have a mayoral election waiting to be announced. It's quite a big deal. I just did a quick search on Google news to see if the result had been announced yet.All the usual news sites are talking about how Boris Johnson will almost certainly win.The Telegraph though came up trumps and had a headline of :Boris Johnson wins London... Read this post May 4, 2008 Building a Better Spam Detector Search Engines A couple of weeks ago the AIRWeb held it's 2008 conference. I've taken a stab at my own adversarial information retrieval tool... Read this post X By: xxclixxx May 1, 2008 Something Weird is Happening at Google Search Engines I was happily searching Google the other day, something I do quite often. Then I noticed one result that stuck out: A page on Aboutus.org was listed twice. But the second time it had a bunch of gibberish before the URL. It appears to me there was a <br&gt... Read this post By: jamersan April 30, 2008 The .com Search Result Phenomenon Search Engines Today I was trying to pull up a website when my computer had one of those hiccups. Somehow, I only managed to get .com in the address bar before I pressed enter. As it typically does when it can't find a site, my browser forwards me to Google's results for the term \".com\". The results I received were a little surprising and I would like to know the SEOMOZ Co... Read this post By: Jane Copland April 28, 2008 Google Follows Nofollowed Links in SEOmoz Comments? Search Engines I may be totally wrong on this, or maybe I've overlooked some obvious explanation as to why the content on the end of nofollowed SEOmoz comment links has been indexed and ranked. Puzzling over this by myself and with friends hasn't produced any good conclusions, so I thought I'd throw this out there to the community. Nutshell: periodically, I'll search for my own name in search engi... Read this post By: Jane Copland April 23, 2008 Google Search Results Missing from OneBox Search Engines Google has some fantastic OneBox results. We've all seen most of them: the answer to important queries such as \"number of horns on a unicorn\" and ... Read this post By: Rand Fishkin April 22, 2008 Could Google's Webmaster Tools Hurt Startup Search Engines? Search Engines For the years from 1998-2005, Google and webmasters were like nerds and dating - separated by an unwritten code that kept them far away from one another. With the exception of the occasional comment by GoogleGuy on the forums or Matt Cutts at an industry show, there was virtually no connection between the search giant and those who marketed sites and content via their medium. In the sum... Read this post By: Rebecca Kelley April 16, 2008 Is Yahoo Buying Text Links? Search Engines This was brought to my attention a few weeks ago, but I've only now been able to look into it. This site that rates schools across the nation is a useful resource for parents--it even won an award for \"Best Family & Parenting Site.\" Looking at the \"Glendale Schools\" page, at the footer I see a link that says \"Glendale Real Estate.\" ... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Search Engines"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Search Engines"
    },
    {
      "level": "H2",
      "text": "Solving Duplicate Content Issues with Http and Https"
    },
    {
      "level": "H2",
      "text": "Google Now Pulling Primary Link Text from Meta Descriptions"
    },
    {
      "level": "H2",
      "text": "Google Image Traffic and Flickr"
    },
    {
      "level": "H2",
      "text": "Why is Yahoo! Hiding Links from Google?"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Does \"Query Deserves Diversity\" Algorithm Exist at Google?"
    },
    {
      "level": "H2",
      "text": "Google Spam Illuminates the Algo's Reliance on Domain Authority"
    },
    {
      "level": "H2",
      "text": "Telegraph is Breaking News Before It's Happened"
    },
    {
      "level": "H2",
      "text": "Building a Better Spam Detector"
    },
    {
      "level": "H2",
      "text": "Something Weird is Happening at Google"
    },
    {
      "level": "H2",
      "text": "The .com Search Result Phenomenon"
    },
    {
      "level": "H2",
      "text": "Google Follows Nofollowed Links in SEOmoz Comments?"
    },
    {
      "level": "H2",
      "text": "Google Search Results Missing from OneBox"
    },
    {
      "level": "H2",
      "text": "Could Google's Webmaster Tools Hurt Startup Search Engines?"
    },
    {
      "level": "H2",
      "text": "Is Yahoo Buying Text Links?"
    }
  ],
  "author": "AjiNIMC\n          \n            AdamDorfman\n          \n            Gary Arndt\n          \n            Richard Baxter\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Phil Berryman\n          \n            xxclixxx\n          \n            jamersan\n          \n            Jane Copland\n          \n            Jane Copland\n          \n            Rand Fishkin\n          \n            Rebecca Kelley"
}