{
  "url": "https://moz.com/blog/category/search-engines/p4",
  "slug": "p4",
  "title": "Search Engines - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Shawn Huber February 24, 2023 Helping Google Navigate Your Site More Efficiently — Whiteboard Friday Whiteboard Friday | Search Engines | On-page SEO This week, Shawn talks you through the ways your site structure, your sitemaps, and Google Search Console work together to help Google crawl your site, and what you can do to approve Googlebot’s efficiency. Read this post By: Louise Persson February 8, 2023 Alternative Search Engines: Why They Matter and How to Rank on Them Search Engines | Marketing Industry While Google still holds more than 80% of the market share, ignoring search engines such as Bing, Yahoo, and DuckDuckGo can make you lose out on relevant traffic. So don’t limit yourself to Google’s algorithm as you plan the next year’s SEO strategy. Read this post By: Tom Capper February 1, 2023 SEO Recap: ChatGPT Marketing Industry | Search Engines | AI and SEO We’re back with another SEO recap with Tom Capper! As you’ve probably noticed, ChatGPT has taken the search world by storm. But does GPT-3 mean the end of SEO as we know it, or are there ways to incorporate the AI model into our daily work? Read this post By: Tom Anthony January 27, 2023 An Apple Search Engine? – Whiteboard Friday Whiteboard Friday | Search Engines In today's Whiteboard Friday, Tom digs into his research on Apple’s moves in search, specifically their recent launch of what he believes is a search engine, how it works, and how they could possibly hope to compete with Google in the future. Read this post By: Dr. Peter J. Meyers January 24, 2023 ChatGPT Won’t Replace Google Search (Yet) Marketing Industry | Search Engines | AI and SEO By now, you’ve probably seen dozens of examples of ChatGPT, using the GPT (Generative Pre-training Transformer) deep learning system. The current models are genuinely impressive, so what does all of this have to do with Google Search and our jobs as search marketers? Read this post By: Tom Capper January 20, 2023 What Is a Core Update? – Whiteboard Friday Whiteboard Friday | Search Engines Recorded at SearchLove London in October — in the wake of three Google updates — Tom presents a different take on core updates in this Whiteboard Friday. Read this post By: Miriam Ellis January 18, 2023 The Ultimate Guide for Taking Full Control of Your Google Business Profile and NMX Local SEO | Search Engines Ready for a deep dive into the 40+ features found on Google Business Profiles and the New Merchant Experience? This article will take you through the most common features of these listings, explain what you can and can’t control on them, and teach you how to manage controllable features in the NMX. Here we go! Read this post By: Tom Capper January 17, 2023 After Google: Should SEOs Jump Ship? Search Engines | AI and SEO This post is not about the health of Google search as a product, or about the implications of improving AI products for your SEO strategy right now. (Although, I know of at least one post for this blog being written on that topic!) Instead, this post is about which of these threats, if any, actually stand a chance of unseating Google’s dominance. Read this post By: Tom Capper December 20, 2022 SEO Recap: PageRank Search Engines | Marketing Industry | SEO Basics Have you ever wondered how Moz employees learn internally? Well, here’s your chance to get a sneak peek into never seen before, internal webinar footage with Tom Capper! Today’s topic: PageRank. Read this post By: Crystal Carter December 16, 2022 How to Optimize Existing Content for Featured Snippets — Whiteboard Friday Whiteboard Friday | Search Engines In today’s episode, Crystal discusses how featured snippets show up in several different parts of the SERP, giving you lots of good value for organic reach, and how to claim those opportunities for your existing content. Read this post By: Dr. Peter J. Meyers December 7, 2022 2022 YouTube and Video SERP Result Changes Video | Search Engines In mid-October, we noticed a drop in this type of video result, and that drop became dramatic by late-October. Did Google remove these video results or was our system broken? As it turns out, neither — video results have split into at least three distinct types (depending on how you count). Read this post By: Miriam Ellis November 29, 2022 Local Pack Header Specificity Vanishes while Local Packs Downtrend Local SEO | Search Engines In July of this year, Moz published a report analyzing an element of Google’s local results we termed “local pack headers”. About a month after publication, members of the local SEO community began noticing that the extraordinary diversity of headings we had captured had suddenly diminished. Today, Miriam presents a quick follow-up to the manual portion of our earlier study in an effort to quantify and illustrate this abrupt alteration. Read this post By: Lily Ray November 25, 2022 3 Important Google Updates to Understand — Whiteboard Friday Whiteboard Friday | Search Engines With recent shake-ups to the Google algorithm, Lily Ray joins us for this week’s episode to walk you through three of the most important search engine updates that can affect your SEO strategies. Read this post By: Tom Capper November 21, 2022 A Different Way of Thinking About Core Updates Search Engines | SEO Analytics | Algorithm Updates Google algorithm updates seem to come in two main flavors. There are very specific updates, like the Page Experience Update, which tend to be announced well in advance, provide detailed information on how the ranking factor will work, and eventually arrive as a slight anti-climax. This post is about the other flavor: the updates announced when they're happening or have already happened with vague guidance. The kind that can have cataclysmic results for affected sites. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Search Engines"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Search Engines"
    },
    {
      "level": "H2",
      "text": "Helping Google Navigate Your Site More Efficiently — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Alternative Search Engines: Why They Matter and How to Rank on Them"
    },
    {
      "level": "H2",
      "text": "SEO Recap: ChatGPT"
    },
    {
      "level": "H2",
      "text": "An Apple Search Engine? – Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "ChatGPT Won’t Replace Google Search (Yet)"
    },
    {
      "level": "H2",
      "text": "What Is a Core Update? – Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "The Ultimate Guide for Taking Full Control of Your Google Business Profile and NMX"
    },
    {
      "level": "H2",
      "text": "After Google: Should SEOs Jump Ship?"
    },
    {
      "level": "H2",
      "text": "SEO Recap: PageRank"
    },
    {
      "level": "H2",
      "text": "How to Optimize Existing Content for Featured Snippets — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "2022 YouTube and Video SERP Result Changes"
    },
    {
      "level": "H2",
      "text": "Local Pack Header Specificity Vanishes while Local Packs Downtrend"
    },
    {
      "level": "H2",
      "text": "3 Important Google Updates to Understand — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "A Different Way of Thinking About Core Updates"
    }
  ],
  "author": "Shawn Huber\n          \n            Louise Persson\n          \n            Tom Capper\n          \n            Tom Anthony\n          \n            Dr. Peter J. Meyers\n          \n            Tom Capper\n          \n            Miriam Ellis\n          \n            Tom Capper\n          \n            Tom Capper\n          \n            Crystal Carter\n          \n            Dr. Peter J. Meyers\n          \n            Miriam Ellis\n          \n            Lily Ray\n          \n            Tom Capper"
}