{
  "url": "https://moz.com/blog/category/search-engines/p47",
  "slug": "p47",
  "title": "Search Engines - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "E By: Ella_D December 1, 2006 Google is Losing Hundreds of Thousands of Advertising Dollars in Canada Search Engines A few months ago, I was out of my office for an appointment with a client in downtown Montreal. Since I knew (well, I thought I knew!) how Google Adwords IP geotargeting system worked, I wanted to give him a demo with a concrete example. I used, as my example, my own firm's Adwords campaign, which had the keyword “conception web” (translation: “web design”) geotarge... Read this post By: Rand Fishkin November 21, 2006 Where Does Google Draw the Data Collection Line? Search Engines Google has always attempted to collect an extraordinary amount of data about users (and webmasters in particular) - a few recent ... Read this post By: Rebecca Kelley November 9, 2006 Home Pages Disappearing from Google's UK Results Search Engines Team Fresh Egg has noticed a strange phenomenon, and it appears to be an ongoing issue from at least August 2006. It seems that home pages (and only home pages) of .com sites hosted in the UK are disappearing from Google's results when you do a site: search and filter the results to only show pages from the UK. I've played around with various sites, and while the home pages pop up under the normal... Read this post By: Rand Fishkin October 31, 2006 Links vs. Content and the Paris Hilton Law of Visibility Search Engines Michael Martinez, when he was a blogger and regular commenter here at SEOmoz, often chided me for holding the viewpoint that rankings are \"all about links.\" Recently, there's been more conversations along those lines, both here at SEOmoz and ... Read this post I By: IBrian October 27, 2006 How to beat the Google Sandbox Search Engines Introducing the problemIn setting up a ranking system based on links, it soon became clear to Google that link manipulation remained a threat to the objectivity of their search results.With patents filed in the early 2000’s such as Hilltop, ... Read this post By: Rand Fishkin October 25, 2006 A List of Web Page Quality Signals Search Engines I was inspired by Xan Porter's recent post on Evaluating Web Page Quality. Search engines have their own evaluation signals, but as they try to improve in quality, it's only natural to pursue more human metrics in order to refine to the greatest possible degree. The research she points to - ... Read this post I By: IBrian October 20, 2006 Google News for Traffic, Links, and Rankings Search Engines What Google News syndication offers is not simply a way to develop targeted traffic, but it can also serve as a powerful indirect link building method in itself. Traffic If you get syndicated by Google news, you can immediately tap into unique traffic streams. Likewise, if you can provide a genuinely useful source of news, users will bo... Read this post By: Rebecca Kelley October 17, 2006 What Google Needs To Do with YouTube to Make Me Happy Search Engines And now, a brief rant about YouTube:Call me a purist, but when I do a search for something like \"the killers mr. brightside music video,\" I don't want 29 of the 30 search results to be of some a-hole teenager lip-synching to the damn song. You may think your video is cool, Mr. A-Hole Teenager, but it's not. It doesn't have Eric Roberts in it. Only The Killers' music video doe... Read this post By: Rand Fishkin October 12, 2006 If They Did Leak the Google Algo... Search Engines Lots of bloggers are commenting about this thread at Digitalpoint on why Google's algo has never been leaked. My take on the algo - it would barely help if it was public knowledge. Yes, we'd all sit down and analyze all the cool things Google can detect about trust and gaming and spam and manipulation... and then? Then, w... Read this post M By: mozUser1469147917838 September 23, 2006 The Project: Generating AdSense Revenue From Low Traffic Site – the Sequel Search Engines It’s roughly three months since I wrote about the project site (original post), and it’s time to take a peek how the site is doing. I admit that I’m still being extremely lazy/busy, and have done lots of t... Read this post M By: mozUser1469147917838 September 14, 2006 Checking the Number of Supplemental Results for a Specific Domain Search Engines There's a new Google hack (or something I was not aware of) in town, and I'm in love with it. It allows you to see an estimate of how many pages in a specific domain are supplemental results. To see the hack in action, just type the following at Google: site:www.mydomain.ltd ***i.e. SEOmoz... Read this post By: Rand Fishkin September 6, 2006 Expedia Privileged Above All Others at Google Search Engines Google has been using \"onebox\" results for travel related searches since at least October of 2005. I'm forced to wonder if, during the entirety of that period, Google's been sending the default link to Expedia. For example: I searched for Seattle to New York and got:... Read this post By: Rand Fishkin September 1, 2006 The Culture Shift at Google Search Engines Almost everyone in the industry who's had a chance to interact one on one with a Googler in the past 6 months has probably noticed that it \"feels\" different from the interactions of the past 3 years. Robert Scoble did a good job describing it with regard to his recent visit to the 'plex... Read this post By: Rand Fishkin August 25, 2006 Dr. Garcia is Getting Tired of LSI Marketing Search Engines Although it's a bit hard to follow, Dr. Garcia (aka Orion), who operates the Miislita site and blog, has a great blog post on the Latest SEO Incoherences (a clever acronym pun on LSI). He ta... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Search Engines"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Search Engines"
    },
    {
      "level": "H2",
      "text": "Google is Losing Hundreds of Thousands of Advertising Dollars in Canada"
    },
    {
      "level": "H2",
      "text": "Where Does Google Draw the Data Collection Line?"
    },
    {
      "level": "H2",
      "text": "Home Pages Disappearing from Google's UK Results"
    },
    {
      "level": "H2",
      "text": "Links vs. Content and the Paris Hilton Law of Visibility"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "How to beat the Google Sandbox"
    },
    {
      "level": "H2",
      "text": "A List of Web Page Quality Signals"
    },
    {
      "level": "H2",
      "text": "Google News for Traffic, Links, and Rankings"
    },
    {
      "level": "H2",
      "text": "What Google Needs To Do with YouTube to Make Me Happy"
    },
    {
      "level": "H2",
      "text": "If They Did Leak the Google Algo..."
    },
    {
      "level": "H2",
      "text": "The Project: Generating AdSense Revenue From Low Traffic Site – the Sequel"
    },
    {
      "level": "H2",
      "text": "Checking the Number of Supplemental Results for a Specific Domain"
    },
    {
      "level": "H2",
      "text": "Expedia Privileged Above All Others at Google"
    },
    {
      "level": "H2",
      "text": "The Culture Shift at Google"
    },
    {
      "level": "H2",
      "text": "Dr. Garcia is Getting Tired of LSI Marketing"
    }
  ],
  "author": "Ella_D\n          \n            Rand Fishkin\n          \n            Rebecca Kelley\n          \n            Rand Fishkin\n          \n            IBrian\n          \n            Rand Fishkin\n          \n            IBrian\n          \n            Rebecca Kelley\n          \n            Rand Fishkin\n          \n            mozUser1469147917838\n          \n            mozUser1469147917838\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin"
}