{
  "url": "https://moz.com/blog/category/search-engines/p49",
  "slug": "p49",
  "title": "Search Engines - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Rand Fishkin July 19, 2006 Google Gives Chris Pirillo the No Confidence Vote Search Engines More sandboxing problems at Google with a big name brand - this time it's Chris Pirillo's TagJag site, which was 301'd several weeks ago from the Gada.be domain. Let's see what the search engines have to say about this high profile move.... Yahoo! (tagjag.com) ... Read this post M By: mozUser1469147917838 June 30, 2006 The Project: Page Rank Update Search Engines Note: If you are unaware of The Project topic, please read the previous parts The Project: pt1 , pt2, pt3I usually have a pretty good hunch of future PR updates, and it was accurate... Read this post By: Rand Fishkin June 29, 2006 A Visit to GooglePlex Irvine Search Engines A big thanks to Zachary Applegate from Plumber Surplus for contributing this blog on the subject of his team's recent visit to Google's Irvine complex. Hopefully you'll enjoy it as much as I have: While our small team from PlumberSurplus.com was excited to be able to go to the Google open house in their new Irvine California office, we were u... Read this post M By: mozUser1469147917838 June 10, 2006 The Project: Generating AdSense Revenue From Low Traffic Site (pt3) Search Engines Note: If you are unaware of The Project topic, please read the previous parts: The project: In the beginning (pt1) The project: ... there was Silence. (pt2) Pretty often I hear people complaining about how hard it is to generate revenue from low tra... Read this post By: Rand Fishkin May 25, 2006 Lord of Yahoo!'s Short Tail Search Engines Someone has Yahoo!'s number down cold. Ranking on page one for thousands of the most popular search phrases in existence, the site isn't even offering content of its own - instead, they're aggregating content from others and serving what is, in essence, duplicated content that's been scraped and re-packaged. Their business model? Serving ads... What are they ranking for? phot... Read this post By: Rand Fishkin May 23, 2006 What I Learned from Yahoo!'s Analyst Day Search Engines Some terrific charts, stats and research came out of Yahoo!'s Analyst Day PDF file (too bad it's a PDF). I thought it would be worthwhile to explore some of the trends Yahoo! is pointing to out of self-interest and expand their definition for the whole of the web industry: ... Read this post By: Rand Fishkin May 21, 2006 Top Ten Twisted Trends Search Engines I'm fairly sure this is exactly what the Google programming team had in mind when they created Trends - a list of geeky searches that produced humorous graphs. Here goes: #10 - Spending Christmas by YourselfFolks seem to be getting lonely around t... Read this post By: Rand Fishkin May 19, 2006 The Yahoo! vs. AdSense Rumor Search Engines I keep getting bugs in my ear (or little birdies) dropping hints that Yahoo!'s organic search is predisposed against websites serving AdSense. That' s not to say that many sites serving the Google ads don't rank well at Yahoo!, but rather that Yahoo! has some negative associations with AdSense serving content and won't be as friendly as they should be. I've heard this rumor two way... Read this post By: Rand Fishkin May 16, 2006 Dilbert on Google Search Engines Via an email from Joe Morin - Scott Adams takes a stab at the 'plex: ... Read this post By: Rand Fishkin May 16, 2006 Reading Between the Lines on MC's Response to Sandbox Questions Search Engines I want to send out a big, electronic hug (and possibly another bottle of scotch) to Mike Grehan (wherever he might be this week). During his hour-long interview with Matt Cutts, Mike asked some of the very best questions I've heard/seen in the search industry field. Not only that, he got some real answers. From ... Read this post By: Rand Fishkin May 12, 2006 Yahoo!'s Most Popular Search Term? Search Engines Why, it's the same as MSN's... \"Google.\" But, Yahoo! is fighting back by placing a Yahoo! search box at the top of the SERPs on a Google search: I real... Read this post E By: EGOL May 10, 2006 Google Trends is Awesome! Search Engines Hey,If you have not seen Google Trends yet, better get over there right now and sniff around. It is exactly like Zeitgeist but you can type in any term that you want and see a whole lot of really cool data.For example.... Read this post By: Rand Fishkin May 3, 2006 Google's Arrogance - A Sign of Things to Come Search Engines These search result counts threw me for a loop: \"microsoft's arrogance\" - 1,380 results \"yahoo's arrogance\" - 7,980 results \"... Read this post By: Rand Fishkin March 26, 2006 Recipe Refinement Queries at Google Search Engines I couldn't find a good recipe for Chinese Beef & Broccoli at Epicurious this weekend, so I headed to Google, where, lo and behold, they have what appears to be another new feature - query refinement via recipes. I may have just been busy when the search blogs reported on this, but I can't seem to find it in archives at SEW or SERoundtable, either, so maybe it is new. Screenshot below for &q... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Search Engines"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Search Engines"
    },
    {
      "level": "H2",
      "text": "Google Gives Chris Pirillo the No Confidence Vote"
    },
    {
      "level": "H2",
      "text": "The Project: Page Rank Update"
    },
    {
      "level": "H2",
      "text": "A Visit to GooglePlex Irvine"
    },
    {
      "level": "H2",
      "text": "The Project: Generating AdSense Revenue From Low Traffic Site  (pt3)"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Lord of Yahoo!'s Short Tail"
    },
    {
      "level": "H2",
      "text": "What I Learned from Yahoo!'s Analyst Day"
    },
    {
      "level": "H2",
      "text": "Top Ten Twisted Trends"
    },
    {
      "level": "H2",
      "text": "The Yahoo! vs. AdSense Rumor"
    },
    {
      "level": "H2",
      "text": "Dilbert on Google"
    },
    {
      "level": "H2",
      "text": "Reading Between the Lines on MC's Response to Sandbox Questions"
    },
    {
      "level": "H2",
      "text": "Yahoo!'s Most Popular Search Term?"
    },
    {
      "level": "H2",
      "text": "Google Trends is Awesome!"
    },
    {
      "level": "H2",
      "text": "Google's Arrogance - A Sign of Things to Come"
    },
    {
      "level": "H2",
      "text": "Recipe Refinement Queries at Google"
    }
  ],
  "author": "Rand Fishkin\n          \n            mozUser1469147917838\n          \n            Rand Fishkin\n          \n            mozUser1469147917838\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            EGOL\n          \n            Rand Fishkin\n          \n            Rand Fishkin"
}