{
  "url": "https://moz.com/blog/category/search-engines/p5",
  "slug": "p5",
  "title": "Search Engines - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Dr. Peter J. Meyers September 21, 2022 How Helpful Was the Helpful Content Update? Search Engines | Content Marketing | Algorithm Updates On August 25, 2022, Google started rolling out the Helpful Content Update. Our resident search scientist and MozCast wrangler, Dr. Pete, looks at the results by comparing data two weeks on either side of the latest Google algorithm update. Read this post By: Molly Ploe September 13, 2022 5 Things I Learned About E-A-T by Analyzing 647 Search Results Search Engines | SEO Analytics How can SEOs possibly prove to Google, amid all the noise and competition and other experts out there, that their clients deserve a place on Page 1? To find out, Molly compared the top results on hundreds of SERPs to determine what actually proves E-A-T. Read this post By: Lidia Infante August 31, 2022 TikTok SEO: Is TikTok Going to Replace Google? Social Media | Search Engines User behavior on TikTok has been evolving as its popularity grows. We’ve seen the app go from dancing teenagers to influencing shopping behavior across the world. Now, the next step for TikTok seems to be turning into the next big search engine. What does it mean for SEOs? Read this post By: Dominick Sorrentino August 30, 2022 Why It's Getting Harder to Rank for Some Commercial Keywords (+ What You Can Do About It) Search Engines | Keyword Research When the team at Brafton discovered they were being unseated in the SERPs for some commercial keywords by directories, they dug into the data to find out why and how it was happening. Read this post By: Christopher Long July 6, 2022 Freshness & SEO: An Underrated Concept Content Marketing | Search Engines | On-page SEO After working with a news organization and testing the learnings from that work on other sites, Chris and his team started to see the immense power that freshness updates could produce in SEO. In this post, he explains why the entire SEO community has underrated the concept of “freshness”, and how to start optimizing for it. Read this post By: Miriam Ellis July 5, 2022 Planning for a Post-Local-Pack Possibility Local SEO | Search Engines | Marketing Industry Local SEOs are accustomed to continuous change in the SERPs, but if the American Innovation Online Choice Act becomes law and prevents monopolies like Google from preferencing their own assets, we need to prepare for what could be the largest search overhaul we’ve ever seen. Read this post By: Crystal Carter June 29, 2022 SEO in Real Life: Harnessing Visual Search for Optimization Opportunities Advanced SEO | Search Engines In this sneak peek of her MozCon 2022 presentation, Crystal shows how, though SEOs have little control over which photos people take, we can optimize our brand presentation to ensure we are easily discoverable by visual search tools. Read this post By: Ann Smarty June 22, 2022 Google Autocomplete: More than a Free Keyword Research Tool Search Engines | SEO Tools | Keyword Research For years, SEOs have been using Google Autocomplete (aka Google Suggest) as a free keyword research tool. Yet there’s much more to this search feature, especially after all the updates Google has introduced, turning Google Autocomplete into a smart and predictive platform of its own. Read this post By: Maddy Osman June 13, 2022 Humans vs. Robots: Picking the Best Audience for Your SEO Content SEO Copywriting | Search Engines | Content Marketing When writing for search engines, should you create content for the algorithm or for your human readers? The answer is both. Here’s how you can do it. Read this post By: Travis McKnight June 2, 2022 How to Know When You Need a Dedicated Paid Landing Page Paid Search Marketing (PPC) | Search Engines Creating custom, campaign-specific landing pages is resource-intensive, and not every team has the necessary tools, expertise, or personnel to build the content. So, how do you know if you need a custom page, or if you can safely send paid traffic to an organic page and still achieve your KPIs? This three-step, data-driven evaluation helps answer this question. Read this post By: Adriana Stein May 24, 2022 How to Use Product Synonyms to Build Use Case Awareness & Scale SEO Keyword Research | Search Engines By expanding the ways you talk about your product, you attract more users, which in turn scales your SEO strategy by giving you more relevant keywords to rank for. Let’s find out how using synonyms in your product-led SEO strategy can slingshot your growth forward. Read this post By: Christopher Hofman Laursen April 20, 2022 How to Win Potential Consumers with Customer Journey Mapping on Google SEO Analytics | Search Engines | Marketing Psychology If your website is like most others, there is likely a mismatch between the content you provide, and what your prospective customers search for on Google. This article is about understanding those potential customers and their conversation with Google by using the customer journey mapping method to provide them with the best content. Read this post By: Dr. Peter J. Meyers April 15, 2022 Title Rewrites: 3 Patterns to Avoid Whiteboard Friday | Search Engines Google recently made updates to the way they rewrite title tags, so Dr. Pete takes you through some of the new data we’ve collected In addition, he shares three titling patterns to avoid if you don’t want them rewritten. Read this post By: Jo Cameron April 5, 2022 Core Web Vitals: Finding Common Ground Between SEOs and Developers Search Engines How do we start conversations and support initiatives that get developers and SEOs all working towards the same goal? Is Core Web Vitals the common ground we need? In this conversation with Moz Developer, Lucas Rasmussen, we explore his recent project aimed at improving our A/B testing experience and how it overlapped with Core Web Vitals. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Search Engines"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Search Engines"
    },
    {
      "level": "H2",
      "text": "How Helpful Was the Helpful Content Update?"
    },
    {
      "level": "H2",
      "text": "5 Things I Learned About E-A-T by Analyzing 647 Search Results"
    },
    {
      "level": "H2",
      "text": "TikTok SEO: Is TikTok Going to Replace Google?"
    },
    {
      "level": "H2",
      "text": "Why It's Getting Harder to Rank for Some Commercial Keywords (+ What You Can Do About It)"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Freshness & SEO: An Underrated Concept"
    },
    {
      "level": "H2",
      "text": "Planning for a Post-Local-Pack Possibility"
    },
    {
      "level": "H2",
      "text": "SEO in Real Life: Harnessing Visual Search for Optimization Opportunities"
    },
    {
      "level": "H2",
      "text": "Google Autocomplete: More than a Free Keyword Research Tool"
    },
    {
      "level": "H2",
      "text": "Humans vs. Robots: Picking the Best Audience for Your SEO Content"
    },
    {
      "level": "H2",
      "text": "How to Know When You Need a Dedicated Paid Landing Page"
    },
    {
      "level": "H2",
      "text": "How to Use Product Synonyms to Build Use Case Awareness & Scale SEO"
    },
    {
      "level": "H2",
      "text": "How to Win Potential Consumers with Customer Journey Mapping on Google"
    },
    {
      "level": "H2",
      "text": "Title Rewrites: 3 Patterns to Avoid"
    },
    {
      "level": "H2",
      "text": "Core Web Vitals: Finding Common Ground Between SEOs and Developers"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Molly Ploe\n          \n            Lidia Infante\n          \n            Dominick Sorrentino\n          \n            Christopher Long\n          \n            Miriam Ellis\n          \n            Crystal Carter\n          \n            Ann Smarty\n          \n            Maddy Osman\n          \n            Travis McKnight\n          \n            Adriana Stein\n          \n            Christopher Hofman Laursen\n          \n            Dr. Peter J. Meyers\n          \n            Jo Cameron"
}