{
  "url": "https://moz.com/blog/category/search-engines/p53",
  "slug": "p53",
  "title": "Search Engines - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Rand Fishkin March 7, 2005 Jeff Dean of Google Speaks to UW Search Engines On October 21, 2004, Jeff Dean of Google gave a taped speech to the University of Washington's Computer Science department. Lucky for us, the UW put this ~55 minute speech on some of the more technical aspe... Read this post By: Rand Fishkin February 26, 2005 Deep Insight into the Corporate Culture & Business Strategy of Google Search Engines John Heilemann, who has been writing about companies in Silicon Valley for the last ten years, has one of the most comprehensive, critical & engaging pieces on the corporat... Read this post By: Rand Fishkin February 21, 2005 The Semantic Web Search Engines An article from the Scientific American, The Semantic Web, describes several examples of how semantic understanding by computers will help to revolutionize the utility of technology in... Read this post By: Rand Fishkin February 15, 2005 Approaching the End of the PageRank Era Search Engines Even a great technological innovation like PageRank will eventually be supplanted. For a web information retreival model, PR has already had a remarkable long life, yet its downfall has been predicted across the web by some of the very best in the industry. Here'... Read this post By: Rand Fishkin February 14, 2005 A Glossary of Information Retrieval Terminology Search Engines Many times when reading through complex threads, research papers or even blogs by some of the more advanced SEOs in the industry, I get lost in the meaning of terms and an entire paragraph or document can be lost to my ignorance. Luckily, great resources like the... Read this post By: Rand Fishkin February 12, 2005 Child Inheritance at Google Search Engines An incredibly revealing post on some theories about Google's changes over the past 12 months was first noted by TW. However, the quantity and quality of information p... Read this post By: Rand Fishkin February 9, 2005 Understanding Fractal Summarization Search Engines A terrific paper by Christopher Yang & Fu Lee Wang of the Chinese University in Hong Kong that was mentioned by Orion in a threa... Read this post By: Rand Fishkin February 8, 2005 Link-Content & Link-Clustering Conjectures Search Engines In a paper titled, Lexical and Semantic Clustering by Web Links, Filippo Menczer of the Dept. of Computer Science at Indiana University, sets out... Read this post By: Rand Fishkin February 4, 2005 Back Door to Google Rankings Search Engines Google has been keeping new websites out of its top rankings positions for nearly 1 year. Sadly, this has made the results far less relevant for ordinary users. Google probably assumes (hopefully incorrectly) that their brand loyalty will never die and that the prevention of SEO t... Read this post By: Rand Fishkin February 4, 2005 Term Weight & Glasgow Weight vs. Keyword Density Search Engines For search engines, keyword density has long been held to be a reliable measure of the concentration of a particular keyword or phrase on a specific page. However, this method of mesurement has long been known in the scientific community to be a poor repres... Read this post By: Rand Fishkin February 3, 2005 Latent Semantic Analysis vs. Theming Search Engines Despite the possible duplicate content penalty, I'm going to reproduce (yes, word for word) a post I made earlier today on SEW to try to clear up some confusion about the relationship and mea... Read this post By: Rand Fishkin February 2, 2005 Understanding Google's Dancing Datacenters Search Engines Every request that comes into Google's search is sent to a specific datacenter where the results are returned. As of today, there are more than 50 unique IP addresses known to the SEO world that are returning slight variations of search results. A... Read this post By: Rand Fishkin January 28, 2005 Is PageRank Still Important? Search Engines A recent thread at SEW takes a poll asking whether anyone still cares about PageRank. The important thing for SEOs to remember, whether they are experienced or new to the optimization process is that P... Read this post By: Rand Fishkin January 28, 2005 Chart of Google's -asdf Phenomenon Search Engines SEOmoz has put together a small chart analyzing the top 20 results for two searches at Google, one a normal 2-word phrase, and the other with much discussed -asdf filter (done by appending 15 -asdf onto the back of the query). The two unique results sets have been a... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Search Engines"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Search Engines"
    },
    {
      "level": "H2",
      "text": "Jeff Dean of Google Speaks to UW"
    },
    {
      "level": "H2",
      "text": "Deep Insight into the Corporate Culture & Business Strategy of Google"
    },
    {
      "level": "H2",
      "text": "The Semantic Web"
    },
    {
      "level": "H2",
      "text": "Approaching the End of the PageRank Era"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "A Glossary of Information Retrieval Terminology"
    },
    {
      "level": "H2",
      "text": "Child Inheritance at Google"
    },
    {
      "level": "H2",
      "text": "Understanding Fractal Summarization"
    },
    {
      "level": "H2",
      "text": "Link-Content & Link-Clustering Conjectures"
    },
    {
      "level": "H2",
      "text": "Back Door to Google Rankings"
    },
    {
      "level": "H2",
      "text": "Term Weight & Glasgow Weight vs. Keyword Density"
    },
    {
      "level": "H2",
      "text": "Latent Semantic Analysis vs. Theming"
    },
    {
      "level": "H2",
      "text": "Understanding Google's Dancing Datacenters"
    },
    {
      "level": "H2",
      "text": "Is PageRank Still Important?"
    },
    {
      "level": "H2",
      "text": "Chart of Google's -asdf Phenomenon"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin"
}