{
  "url": "https://moz.com/blog/category/search-engines/p8",
  "slug": "p8",
  "title": "Search Engines - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Miriam Ellis May 3, 2021 Local Justifications Are a Big Deal and You Can Influence Them Local SEO | Search Engines Today, we’ll demonstrate the prominence of the fascinating business listing feature known as \"local justifications\", and show how they can help you to stand out from local SERP competitors in exciting ways! Read this post By: Tom Capper April 28, 2021 When & How to Disavow Backlinks in 2021 Link Building | Search Engines It’s been nearly nine years since Google rolled out its Disavow Tool. This guide covers how and when to use it, and the potential risks and benefits. Read this post By: Tom Capper April 20, 2021 Announcing the Moz Performance Metrics Beta Moz Tools | Search Engines | SEO Tools Moz’s new Performance Metrics features allow you to check Core Web Vitals and other page performance metrics for any page, thousands of URLs at a time. Read this post By: Cyrus Shepard April 7, 2021 3 Vital Click-Based Signals for SEO: First, Long, & Last Search Engines | Advanced SEO This post shows you how to optimize for click signals to improve your SEO, regardless of how Google might use them as a ranking signal. Read this post By: Brodie Clark April 6, 2021 6 Common Google SERP Feature Misconceptions in SEO Search Engines Brodie Clark teamed up with Izzi Smith to create a new SEO quiz series, testing marketers' knowledge of Google SERP features. In this post, read through the six most common misconceptions found in quiz answers, dealing with structured data, Featured Snippets, and more! Read this post By: Dr. Peter J. Meyers March 22, 2021 Featured Snippets: Not Gone, Just on Holiday (Apparently) Search Engines Three weeks after a historically huge drop in Featured Snippets, they appear to have returned. Were they just on holiday? What happened exactly? Honestly, we have no idea, but here are the numbers. Read this post By: Christopher Long March 16, 2021 LiveBlogPosting Schema: A Powerful Tool for Top Stories Success Technical SEO | Search Engines | Marketing Industry When the team at Go Fish Digital began helping a large media company break into Google’s Top Stories for major single-day events, they discovered that one way many sites do this is through the use of a schema type called LiveBlogPosting. Here are there findings regarding what this structured data type is, how sites are using it, and what impact it might have on Top Stories visibility. Read this post By: Mordy Oberstein March 10, 2021 What I Found After Experimenting with Google Discover for Two Months Search Engines | Marketing Psychology Mordy spent the better part of two months running all sorts of queries in all sorts of different ways to see how it impacted his Google Discover Feed. Here are the results. Read this post By: Dr. Peter J. Meyers March 1, 2021 Featured Snippets Drop to Historic Lows Search Engines On February 19, MozCast measured a dramatic drop (40% day-over-day) in SERPs with Featured Snippets. This is the lowest prevalence rate of Featured Snippets in our data set since summer of 2015. What's driving the losses, and who is most affected? Read this post By: Miriam Ellis February 8, 2021 Local SEO Tips for Electric Vehicle Charging Stations Local SEO | Search Engines Electric vehicle (EV) charging stations belong in local search results, but aren’t well addressed by Google’s official guidelines. What are the SEO best practices for such listings, and how can you make sure they’re discovered by potential consumers? Read this post By: Larissa Lacerda February 3, 2021 Fast & Featured: How Entities Can Help You Conquer Snippets in Less Than 4 Minutes Search Engines | Keyword Research Larissa Lacerda of Rock Content demonstrates how to win snippets quickly by focusing your strategy on search entities. Read this post By: Robin Lord December 21, 2020 Avoiding False Conversions in Google Analytics SEO Analytics | Search Engines | SEO Reporting There are a huge number of ways you can track conversions in Google Analytics, and a huge number of ways to screw it up. This post is going to focus on some of the main ways you can mess up conversions when you’re basing them on users completing a form and then landing on a thank-you page. Read this post By: Dr. Peter J. Meyers December 16, 2020 Google's December 2020 Core Update: By the Numbers Search Engines | SEO Reporting | Algorithm Updates On December 3rd, Google announced that they were rolling out the latest Core Update. Seven days out, here are the trends we've seen. Read this post By: Krystal Taing November 18, 2020 Business as Unusual: How to Communicate Your New and Updated Services with Google My Business Local SEO | Search Engines During the pandemic, almost a third of shoppers have purchased from a brand that’s new to them. In this article, we’ll explore tactics for surfacing your new or updated services digitally to guide and convert these new searchers during their decision-making process. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Search Engines"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Search Engines"
    },
    {
      "level": "H2",
      "text": "Local Justifications Are a Big Deal and You Can Influence Them"
    },
    {
      "level": "H2",
      "text": "When & How to Disavow Backlinks in 2021"
    },
    {
      "level": "H2",
      "text": "Announcing the Moz Performance Metrics Beta"
    },
    {
      "level": "H2",
      "text": "3 Vital Click-Based Signals for SEO: First, Long, & Last"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "6 Common Google SERP Feature Misconceptions in SEO"
    },
    {
      "level": "H2",
      "text": "Featured Snippets: Not Gone, Just on Holiday (Apparently)"
    },
    {
      "level": "H2",
      "text": "LiveBlogPosting Schema: A Powerful Tool for Top Stories Success"
    },
    {
      "level": "H2",
      "text": "What I Found After Experimenting with Google Discover for Two Months"
    },
    {
      "level": "H2",
      "text": "Featured Snippets Drop to Historic Lows"
    },
    {
      "level": "H2",
      "text": "Local SEO Tips for Electric Vehicle Charging Stations"
    },
    {
      "level": "H2",
      "text": "Fast & Featured: How Entities Can Help You Conquer Snippets in Less Than 4 Minutes"
    },
    {
      "level": "H2",
      "text": "Avoiding False Conversions in Google Analytics"
    },
    {
      "level": "H2",
      "text": "Google's December 2020 Core Update: By the Numbers"
    },
    {
      "level": "H2",
      "text": "Business as Unusual: How to Communicate Your New and Updated Services with Google My Business"
    }
  ],
  "author": "Miriam Ellis\n          \n            Tom Capper\n          \n            Tom Capper\n          \n            Cyrus Shepard\n          \n            Brodie Clark\n          \n            Dr. Peter J. Meyers\n          \n            Christopher Long\n          \n            Mordy Oberstein\n          \n            Dr. Peter J. Meyers\n          \n            Miriam Ellis\n          \n            Larissa Lacerda\n          \n            Robin Lord\n          \n            Dr. Peter J. Meyers\n          \n            Krystal Taing"
}