{
  "url": "https://www.similarweb.com/blog/insights/automotive-news/tesla-gas-prices/",
  "slug": "tesla-gas-prices",
  "title": "Tesla Shows Strength with Online Car Shoppers | Similarweb",
  "description": "Besides benefitting from the glowing popularity of electric cars, Tesla is seeing traffic spike in parallel with rising gas prices.",
  "content": "HomeBlogInsightsAutomotive NewsTesla Shows Strength with Online Car Shoppers Insights Tesla Shows Strength with Online Car Shoppers Start your free trial by Jim Corridore , Senior Analyst 2 Min. April 21, 2022 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Tesla, the world’s leading electric vehicle manufacturer, is well positioned to capitalize on trends like spiking gas prices in the wake of the Russia-Ukraine war, not to mention general growth in interest in sustainability and electrification. Similarweb estimates provide a unique look into the Tesla sales funnel across each car brand. The data shows increased web traffic to Tesla’s sales checkout webpage, which is a strong indicator of future sales. Key Metrics Similarweb data shows Q1 conversion in the United States is up 82% vs. the prior year (excluding Cybertruck), but down 11% vs. 2020’s Q4 March 2022 conversion was particularly strong, up 107% over February 2022, likely spurred by rising gas prices across the U.S. and increased interest in EVs overall Tesla reported better than expected revenues and EPS on April 20, 2022 Similarweb’s estimates on Tesla conversions ahead of its Q1 earnings report on April 20th appear very strong on a year-over-year (YoY) basis. Against a backdrop of already reported Q1 deliveries, which were up 68% YoY, and up less than 1% over Q4, conversion trends look similar. Using U.S. desktop data, conversions of all models (except Cybertruck) were up 82% YoY. However, they were down 11% versus Q4. We exclude Cybertruck, the electric pickup truck Tesla is developing, due to the absurdly low $100 deposit to reserve a truck, which we do not think is indicative of real demand. Also, the timing of delivery of the Cybertruck is nebulous and continually shifting. Traffic to Tesla’s Landing Page Jumps With Fuel Prices The spike in visits to Tesla’s homepage, tesla.com, has coincided with the initial spike in fuel prices. Looking at data from the U.S. Energy Information Administration, gas prices first started to spike the week of March 7, averaging $3.71 a gallon, up from $2.86 the prior week. The price increases have continued since that time, with the most recent gas prices for the week of April 4-8 averaging $3.81. We took a look at Tesla’s daily website traffic since March 7, which was the week gas prices spiked 32%. Although prices have declined somewhat since then, traffic has remained elevated. Assuming steady conversion rates (which is not a given), increased visits should drive higher sales over time. See the chart below on weekly web traffic for Q1 2022. Conclusion First-quarter conversion data looks strong for Tesla in comparison to the prior year but weakened against Q4 of last year. For more detail, including a discussion of Tesla’s supply chain problems, download the full report. The Similarweb Insights Newsroom is available to pull additional or updated data on request for the news media (journalists are invited to write to press@similarweb.com). Please link back to this post as a reference for readers. Download the Report by Jim Corridore Senior Analyst Jim provides insights across multiple sectors. With 30 years on Wall Street and numerous awards for stock-picking, he is a SUNY Albany graduate. Related Topics: Automotive News This post is subject to Similarweb legal notices and disclaimers. Related Posts Insights Australia’s Favorite Automotive Brands Revealed Automotive News by Similarweb 3 Min. May 26, 2023 Insights Tesla Misses on Q1 Revenues and Earnings – Similarweb Data Shows Why Automotive News by Jim Corridore 3 Min. Apr 20, 2023 Insights Carvana Sees 50% Web Traffic Decline in March; Down 42% in Q1 While Most Peers Grow Automotive News by Jim Corridore 4 Min. Apr 6, 2023 Insights Tesla Price Cut Drives Huge Increase In Sales Activity For Model Y and Model 3 Automotive News by Jim Corridore 3 Min. Mar 24, 2023 Insights Carvana Sees 41% Web Traffic Decline; CarGurus Leads with 39 Million Website Visits Automotive News by Jim Corridore 3 Min. Mar 10, 2023 Insights Auto Retailer Update January 2023: CarGurus leads with 41.6 million website visits, But Cars.com Growing Fastest Automotive News by Jim Corridore 3 Min. Feb 9, 2023 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Tesla Shows Strength with Online Car Shoppers"
    },
    {
      "level": "H2",
      "text": "Key Metrics"
    },
    {
      "level": "H2",
      "text": "Traffic to Tesla’s Landing Page Jumps With Fuel Prices"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H2",
      "text": "Download the Report"
    },
    {
      "level": "H3",
      "text": "Australia’s Favorite Automotive Brands Revealed"
    },
    {
      "level": "H3",
      "text": "Tesla Misses on Q1 Revenues and Earnings – Similarweb Data Shows Why"
    },
    {
      "level": "H3",
      "text": "Carvana Sees 50% Web Traffic Decline in March; Down 42% in Q1 While Most Peers Grow"
    },
    {
      "level": "H3",
      "text": "Tesla Price Cut Drives Huge Increase In Sales Activity For Model Y and Model 3"
    },
    {
      "level": "H3",
      "text": "Carvana Sees 41% Web Traffic Decline; CarGurus Leads with 39 Million Website Visits"
    },
    {
      "level": "H3",
      "text": "Auto Retailer Update January 2023: CarGurus leads with 41.6 million website visits, But Cars.com Growing Fastest"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Jim Corridore"
}