{
  "url": "https://www.similarweb.com/blog/updates/product-updates/custom-categories/",
  "slug": "custom-categories",
  "title": "New - Custom Categories in Similarweb Platform | Similarweb",
  "description": "Create custom categories with Similarweb Pro and gain insights tailored to your specific needs. Learn more about this powerful tool in our latest blog post.",
  "content": "HomeBlogNew - Custom Categories in Similarweb Platform New – Custom Categories in Similarweb Platform Start your free trial by Natalie Halimi 3 Min. June 28, 2016 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Similarweb’s Custom Categories is live! This highly anticipated feature allows you to create your own, fully customizable categories within the Industry Analysis module. Custom categories are composed entirely of the websites you choose, so you can track industries and markets that are most relevant to you and your business. With Custom Categories, just like with the over 250 existing categories already available in the Industry Analysis module, you can see the Top Websites, discover the leaders for each traffic source, and learn about the top referring sites, social networks, and the most searched keywords for the category you’ve created. How to create a custom category in Similarweb Platform To create a custom category you’ll need to be subscribed to our Ultimate plan. As an Ultimate user, you can create your own custom categories, each containing a list of up to 100 websites. Once you’ve created the category, you’ll be able to access it and edit the list of sites at any point from the Industry Analysis module in your account. Suggestions for custom categories include: Direct Competitors: Track how you fare against your unique ecosystem Blue-Chip Category: Discover how the most successful players are driving traffic Company Performance: Group different web properties belonging to a specific competitor (e.g., ebay.com, ebay.in, etc.) Partners Category: Track the performance of your suppliers, customers, or affiliates Who is this feature for? Any marketer, researcher, or prospector who needs industry-level metrics for non-traditional categories. Use Cases: 1. The business strategy team at a US-based e-commerce website wishes to expand into new markets overseas and decides to use eBay as its model. By building a custom category containing a selection of eBay’s TLDs, the team can obtain an overview of the international eBay market and discover things such as market size, key growth strategies, and users’ interests and engagement. All this can be tracked going back up to 3 months. Based on this information, the team can identify which markets it wishes to expand into, and create a market penetration strategy. 2. The marketing team for a new classroom management app wants to advertise on high-end education publishers. The team creates a custom category containing 20 different publisher sites, enabling them to identify the best-performing publishers in the group, based on traffic share and engagement, as well as understand the traffic sources and their quality for each site, and for the group as a whole. They can also identify publishers that have increased in rank from the previous month. Based on this information, the team can close in on those publishers that are worth the company’s advertising budget, improving their chances for positive ROI. Custom Categories are available for our Ultimate plan users. To create your first custom category, or to learn more about Industry Analysis, contact your Account Manager. by Natalie Halimi Natalie Halimi has over 10 years of marketing experience across B2C and B2B sectors. Related Topics: Product Updates This post is subject to Similarweb legal notices and disclaimers. Related Posts Updates Similarweb Product Updates: The September 2024 Edition Product Updates by Adelle Kehoe 2 Min. Oct 14, 2024 Updates Similarweb Product Updates: The August 2024 Edition Product Updates by Adelle Kehoe 3 Min. Sep 11, 2024 Updates Similarweb Rank Tracker Now Tracks Google’s AI Overviews Product Updates by Shay Harel 2 Min. Aug 19, 2024 Updates Similarweb Product Updates: The July 2024 Edition Product Updates by Adelle Kehoe 3 Min. Aug 12, 2024 Updates Say Hello to Similarweb’s Technical SEO Tool Product Updates by Adelle Kehoe 3 Min. Jul 18, 2024 Updates Introducing Data Exporter: Simplified Access to Similarweb Data at Scale Product Updates by Pavel Dimshiz 4 Min. Jul 11, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "New – Custom Categories in Similarweb Platform"
    },
    {
      "level": "H2",
      "text": "How to create a custom category in Similarweb Platform"
    },
    {
      "level": "H3",
      "text": "Suggestions for custom categories include:"
    },
    {
      "level": "H3",
      "text": "Use Cases:"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The September 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The August 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Similarweb Rank Tracker Now Tracks Google’s AI Overviews"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The July 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Say Hello to Similarweb’s Technical SEO Tool"
    },
    {
      "level": "H3",
      "text": "Introducing Data Exporter: Simplified Access to Similarweb Data at Scale"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Natalie Halimi"
}