{
  "url": "https://www.similarweb.com/blog/updates/product-updates/custom-marketing-api/",
  "slug": "custom-marketing-api",
  "title": "Build a Custom Dashboard using the Similarweb API | Similarweb",
  "description": "Learn to build a custom marketing dashboard with Similarweb's API. Get tips from a UK online marketing agency and streamline your data analysis. Learn more!",
  "content": "HomeBlogUpdatesProduct UpdatesBuild a Custom Marketing Dashboard using the Similarweb API - Tips from a Leading UK Online Marketing Agency Build a Custom Marketing Dashboard using the Similarweb API – Tips from a Leading UK Online Marketing Agency Start your free trial by Ariel Rosenstein 3 Min. August 20, 2014 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Recently one of the largest online advertising agencies in the UK approached us with a challenge. To take Similarweb’s competitive analytics and create client-specific data slices for their internal team to use and share with their clients. Similarweb’s APIs became that gateway for the data. The agency built client-focused dashboards which displayed the lists of websites competing for keywords, the volume of user visits to each competitor, the websites that are referring traffic to each competitor and the top paid and organic keywords that are actually driving search traffic to each competitor. These dashboards have become central to the value that this agency provides its clients – and central to the agency’s internal workflow as well. Because the entire agency has access to what’s going on with every account at all times, team members can analyze the data and provide the client with actionable advice. With all relevant information at their fingertips, the agency’s marketers can easily tap into the dashboard’s insights to make better strategic decisions for their clients, become a trusted resource for marketplace intelligence, and empower reports and communications based on facts rather than intuition. Using this solution, account managers and clients alike have real-time access to the competitive insights they need to make informed marketing decisions. The metrics that the agency leadership sees as most important appear here, without any unnecessary clutter and without any need to navigate through all of the site-specific screens of the Similarweb browser-based platform. The agency retains dozens of clients, most of which are large companies themselves, so the ability to instantly access all of the data specific to a given client’s competition is key. When it comes to digital marketing, many brands struggle to measure impact and ROI, so any mechanism that enhances transparency has the power to help agencies reduce account turnover. In the case of this marketing agency, their API-powered dashboards keep track of how each client’s site is performing compared to their competitors, allowing account managers to provide accurate reports on the cost-effectiveness of various marketing efforts. These reports then help the agency and its clients make decisions about future strategies. The Guide to a Dashboard For each client, the dashboard includes several components. First, the agency uses the Similar Websites API to generate a list of competitors. This list is added to the lists of competing websites as identified by the clients themselves. Second, the Traffic API retrieves data about how many views each competitor receives. Similarweb’s crawlers measure views using exactly the same parameters as Google Analytics, which means that when the agency evaluates competitors’ traffic alongside the client’s own metrics, the data is comparable. Third, in order to find the top ten leading referrers to a client’s competitors, the agency uses the Referrals API. These referrals can be used as prospects for link building, potential advertisers and guest posting opportunities. Fourth, the agency also uses the Keywords API to pull the top ten paid and top ten organic search terms that are driving visits to each competitor. These lists become the bases for keyword research for the client, which, in turn, informs emphases in social media activity, email marketing and branded content. Relevant keywords that none of the competitors rank for are opportunities waiting to happen. Use our APIs to Build Perfect Fit Solutions The custom dashboards allow team members at the marketing agency’s offices to catch up, at a glance, on the latest performance trends that are most important to any given account, which gives them an advantage when handling ongoing client correspondence, preparing for meetings, exporting data for reports and formulating quarterly strategy updates. They essentially know, in real-time, exactly what’s going on in each client’s niche – and can analyze the information to provide the client with actionable advice. by Ariel Rosenstein Ari is the Sr. Marketing Director at Similarweb. He has spent the last decade in ad-tech working for Kenshoo and Adquant (acquired). Related Topics: Product Updates This post is subject to Similarweb legal notices and disclaimers. Related Posts Updates Similarweb Product Updates: The September 2024 Edition Product Updates by Adelle Kehoe 2 Min. Oct 14, 2024 Updates Similarweb Product Updates: The August 2024 Edition Product Updates by Adelle Kehoe 3 Min. Sep 11, 2024 Updates Similarweb Rank Tracker Now Tracks Google’s AI Overviews Product Updates by Shay Harel 2 Min. Aug 19, 2024 Updates Similarweb Product Updates: The July 2024 Edition Product Updates by Adelle Kehoe 3 Min. Aug 12, 2024 Updates Say Hello to Similarweb’s Technical SEO Tool Product Updates by Adelle Kehoe 3 Min. Jul 18, 2024 Updates Introducing Data Exporter: Simplified Access to Similarweb Data at Scale Product Updates by Pavel Dimshiz 4 Min. Jul 11, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free!",
  "headers": [
    {
      "level": "H1",
      "text": "Build a Custom Marketing Dashboard using the Similarweb API – Tips from a Leading UK Online Marketing Agency"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The September 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The August 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Similarweb Rank Tracker Now Tracks Google’s AI Overviews"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The July 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Say Hello to Similarweb’s Technical SEO Tool"
    },
    {
      "level": "H3",
      "text": "Introducing Data Exporter: Simplified Access to Similarweb Data at Scale"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Ariel Rosenstein"
}