{
  "url": "https://www.similarweb.com/blog/updates/product-updates/dmi-news-apr/",
  "slug": "dmi-news-apr",
  "title": "New Digital Marketing Intelligence Features - April 22 | Similarweb",
  "description": "Feature release highlights for April are in. Here's how they can help you and where you can access them on Similarweb. Read on now!",
  "content": "HomeBlogUpdatesProduct Updates4 New Digital Marketing Intelligence Features You Don’t Want to Miss Updates 4 New Digital Marketing Intelligence Features You Don’t Want to Miss Start your free trial by Owen Badham , Senior Product Marketing Manager at Similarweb 3 Min. April 27, 2022 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Spring’s here, and you might have noticed lots of features popping up in the platform. Here’s a lowdown on what’s new… Ready to give your keyword research a spring clean? Then checkout the all-new Keyword Difficulty metric. We’ve also launched a new Mobile Traffic analysis tool to help you discover new mobile keyword opportunities and grow your mobile SEO strategy. To round things out, we released new PPC currencies and a major update to our Marketing Channels feature so you can see a combined mobile and desktop ‘ALL TRAFFIC’ view. Let’s dive in. Keyword Difficulty score Keyword Difficulty helps you estimate how much effort it takes to rank higher for a keyword. In other words, it’s a way of evaluating numerically how tough it might be to boost your SERP ranking. How? Great question. We apply a Keyword Difficulty score (between 0-100) so you know how easy ranking should be: 1-20 – Easy 21-80 – Moderate 81 – 100 – Difficult You can use the score to quickly qualify keyword ideas and understand how hard it would be to rank for them. It’s also incredibly handy for identifying valuable long-tail keywords. Mobile Traffic 2.0 It’s time to get better acquainted with your mobile traffic’s targeted keywords. With Mobile Traffic 2.0, our major mobile data update, you can discover new metrics and dive deep into mobile keyword analysis. This update improves our mobile keyword coverage and accuracy and adds insights too. For any keyword (or keyword list), you can now explore new metrics like mobile search visits, volume split between mobile and desktop, and much more. Check Out Mobile Traffic 2.0 PPC Spend – New currencies You can now analyze what your competitors spend, in your own currency. This feature enables you to minimize external calculations and easily get the PPC spend estimations for your competitors. We can now convert $ spend to four major currencies (£, €, A$, and ¥), and are adding even more soon. Check it out New Marketing Channels ‘All Traffic’ view Get the complete picture for your Marketing Channel insights with the All Traffic view. Now you can get a holistic and aggregated view of channel traffic from all devices. There’s no need to jump between device views any more, or perform calculations to get the full picture of your or your competitors’ traffic acquisition tactics. Now you can easily go from the complete All Traffic view to the more granular desktop and mobile views. With a combined view of desktop and mobile web traffic across all channels, you can: Understand which competitors are really honing their mobile channel strategy Create and optimize more content based on mobile keywords Build unique campaigns for your own mobile search strategy Check it out Your amazing feedback helps us prioritize which features to develop next. Have any thoughts on our latest updates or features you’d like to see? Get in touch via our onsite Live Chat, Social, or through your Account Manager. Thanks for reading. See you next month. by Owen Badham Senior Product Marketing Manager at Similarweb A product marketer with 10+ years in SaaS, specializing in product launches, GTM strategy, and collateral production. Related Topics: Product Updates SEO This post is subject to Similarweb legal notices and disclaimers. Related Posts Updates Similarweb Product Updates: The September 2024 Edition Product Updates by Adelle Kehoe 2 Min. Oct 14, 2024 Updates Similarweb Product Updates: The August 2024 Edition Product Updates by Adelle Kehoe 3 Min. Sep 11, 2024 Updates Similarweb Rank Tracker Now Tracks Google’s AI Overviews Product Updates by Shay Harel 2 Min. Aug 19, 2024 Updates Similarweb Product Updates: The July 2024 Edition Product Updates by Adelle Kehoe 3 Min. Aug 12, 2024 Updates Say Hello to Similarweb’s Technical SEO Tool Product Updates by Adelle Kehoe 3 Min. Jul 18, 2024 Updates Introducing Data Exporter: Simplified Access to Similarweb Data at Scale Product Updates by Pavel Dimshiz 4 Min. Jul 11, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "4 New Digital Marketing Intelligence Features You Don’t Want to Miss"
    },
    {
      "level": "H2",
      "text": "Keyword Difficulty score"
    },
    {
      "level": "H2",
      "text": "Mobile Traffic 2.0"
    },
    {
      "level": "H2",
      "text": "PPC Spend – New currencies"
    },
    {
      "level": "H2",
      "text": "New Marketing Channels ‘All Traffic’ view"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The September 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The August 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Similarweb Rank Tracker Now Tracks Google’s AI Overviews"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The July 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Say Hello to Similarweb’s Technical SEO Tool"
    },
    {
      "level": "H3",
      "text": "Introducing Data Exporter: Simplified Access to Similarweb Data at Scale"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Owen Badham"
}