{
  "url": "https://www.similarweb.com/blog/updates/product-updates/dmi-nov-update/",
  "slug": "dmi-nov-update",
  "title": "Serving Up Seasonal Insights – Nov 2021 Update | Similarweb",
  "description": "November’s fresh new features are live. Here’s how they can help you grow your market share and where to find them in Similarweb. Go play.",
  "content": "HomeBlogUpdatesProduct UpdatesServing Up Seasonal Insights – November 2021 Update Updates Serving Up Seasonal Insights – November 2021 Update Start your free trial by Owen Badham , Senior Product Marketing Manager at Similarweb 2 Min. November 25, 2021 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Welcome to this month’s Digital Marketing Intelligence update. 🦃 ‘Tis the season for fresh features. As marketers everywhere are wrapping up their seasonal campaigns, Similarweb is gifting you a new way to discover and share those all-important campaign insights: Get ready to go viral with the all-new Insight Sharing feature Always land on results with our Insight Suggestion tool Check out our new PPC functions walkthrough video Read on then go play! Get ready to go viral: insight sharing Now you can share the incredible insights you unearth on Similarweb – straight from the platform. Finally. No more downloading or screen-grabbing, just select the channel you want to share across – and boom! Your digital insights are on social media for the world to marvel at. Share your insights Fill in the blanks: automated insight suggestions How frustrating is that “We couldn’t find any results” screen when you’re after insights? Hopefully a little less now. Next time you are caught short, you’ll receive suggested countries or similar domains from the same industry where there are definitely results to explore. Check it out Easy PPC: paid search tools overview Looking to optimize your PPC strategy and learn what’s working (and what’s not) for your competitors’ campaigns? Then check out this video, covering everything from understanding aggregate paid traffic, to PPC spend, to bounce rate and more. You’ll be creating better-paid campaigns before you know it. Your amazing feedback helps us prioritize which features to develop next. Have any thoughts on our latest updates or features you’d like to see? Get in touch via our Live Chat, Social, or through your Account Manager. Thanks for reading. See you next month. by Owen Badham Senior Product Marketing Manager at Similarweb A product marketer with 10+ years in SaaS, specializing in product launches, GTM strategy, and collateral production. Related Topics: Product Updates SEM & PPC This post is subject to Similarweb legal notices and disclaimers. Related Posts Updates Similarweb Product Updates: The September 2024 Edition Product Updates by Adelle Kehoe 2 Min. Oct 14, 2024 Updates Similarweb Product Updates: The August 2024 Edition Product Updates by Adelle Kehoe 3 Min. Sep 11, 2024 Updates Similarweb Rank Tracker Now Tracks Google’s AI Overviews Product Updates by Shay Harel 2 Min. Aug 19, 2024 Updates Similarweb Product Updates: The July 2024 Edition Product Updates by Adelle Kehoe 3 Min. Aug 12, 2024 Updates Say Hello to Similarweb’s Technical SEO Tool Product Updates by Adelle Kehoe 3 Min. Jul 18, 2024 Updates Introducing Data Exporter: Simplified Access to Similarweb Data at Scale Product Updates by Pavel Dimshiz 4 Min. Jul 11, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Serving Up Seasonal Insights – November 2021 Update"
    },
    {
      "level": "H2",
      "text": "Get ready to go viral: insight sharing"
    },
    {
      "level": "H2",
      "text": "Fill in the blanks: automated insight suggestions"
    },
    {
      "level": "H2",
      "text": "Easy PPC: paid search tools overview"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The September 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The August 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Similarweb Rank Tracker Now Tracks Google’s AI Overviews"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The July 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Say Hello to Similarweb’s Technical SEO Tool"
    },
    {
      "level": "H3",
      "text": "Introducing Data Exporter: Simplified Access to Similarweb Data at Scale"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Owen Badham"
}