{
  "url": "https://www.similarweb.com/blog/updates/product-updates/dri-apr-update/",
  "slug": "dri-apr-update",
  "title": "New Digital Research Intelligence Features | Similarweb",
  "description": "Check out the latest features and enhancements we've added to the digital research intelligence product in April and since the start of the year.",
  "content": "HomeBlogUpdatesProduct UpdatesNew Digital Research Intelligence Feature Updates - April Updates New Digital Research Intelligence Feature Updates – April Start your free trial by Chloe Nicholls , Product Marketing Manager, Similarweb 3 Min. May 17, 2021 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Here at Similarweb we are constantly innovating and making improvements to the platform based on feedback from our customers and the needs of digital researchers. Check out the latest features and enhancements we’ve added to the Digital Research Intelligence product in April and since the start of the year. April Expand your Custom Industry analysis to up to 300 websites: Create a custom group of up to 300 websites for greater flexibility when analyzing the digital landscape across your industry or competitive set to gather personalized insights based on your unique view of your market positioning. See industry leader’s position change over time: The Market Quadrant Analysis graph in Industry Leaders now comes with additional historical data (up to the last three months) to see who are the rising players and how they change position from one quarter to the next. Automate conversion analysis insights with API: Integrate and automate your conversion analysis insights with the API to analyze funnel analytics. Export dashboard data into powerpoint presentations: Easily create PowerPoint presentations from your custom dashboards to share insights with your team plus and export data from Industry Demographics to Excel to analyze outside of the platform. March Understand audience behavior with Audience Overlap: A powerful new way to analyze market sizing opportunities, measure audience loyalty and benchmark your performance to gain a competitive edge for audience development strategies. API for Segment Analysis: Integrate segments created within the platform into your reporting and analysis workflow. Plus connect to data visualization tools like Google Looker Studio and Tableau to seamlessly centralize data sources. Expanded coverage for Segment Analysis: Build segments beyond top pages to analyze any string combination or URL across any website without any limits. February Measure website retention with New vs. Returning Users: The first time we’ve added a retention metric to the platform. This feature enables digital researchers to analyze the percent of new vs returning users when tracking audience growth and retention metrics. January Analyze which marketing channels drive traffic for Segment Analysis: See which marketing channel drives the most traffic over time for a brand, product line or topic across websites. Try out the latest features Login in now to take our latest features for a spin and stay tuned for future updates. by Chloe Nicholls Product Marketing Manager, Similarweb Chloe, with 10+ years in B2B marketing, is passionate about data-driven business decisions. Based in London, she enjoys the arts, cafes, and theatres. Related Topics: Product Updates This post is subject to Similarweb legal notices and disclaimers. Related Posts Updates Similarweb Product Updates: The September 2024 Edition Product Updates by Adelle Kehoe 2 Min. Oct 14, 2024 Updates Similarweb Product Updates: The August 2024 Edition Product Updates by Adelle Kehoe 3 Min. Sep 11, 2024 Updates Similarweb Rank Tracker Now Tracks Google’s AI Overviews Product Updates by Shay Harel 2 Min. Aug 19, 2024 Updates Similarweb Product Updates: The July 2024 Edition Product Updates by Adelle Kehoe 3 Min. Aug 12, 2024 Updates Say Hello to Similarweb’s Technical SEO Tool Product Updates by Adelle Kehoe 3 Min. Jul 18, 2024 Updates Introducing Data Exporter: Simplified Access to Similarweb Data at Scale Product Updates by Pavel Dimshiz 4 Min. Jul 11, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "New Digital Research Intelligence Feature Updates – April"
    },
    {
      "level": "H2",
      "text": "April"
    },
    {
      "level": "H2",
      "text": "March"
    },
    {
      "level": "H2",
      "text": "February"
    },
    {
      "level": "H2",
      "text": "January"
    },
    {
      "level": "H2",
      "text": "Try out the latest features"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The September 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The August 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Similarweb Rank Tracker Now Tracks Google’s AI Overviews"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The July 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Say Hello to Similarweb’s Technical SEO Tool"
    },
    {
      "level": "H3",
      "text": "Introducing Data Exporter: Simplified Access to Similarweb Data at Scale"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Chloe Nicholls"
}