{
  "url": "https://www.similarweb.com/blog/updates/product-updates/introducing-saved-searches/",
  "slug": "introducing-saved-searches",
  "title": "Spot New Prospects Instantly with Saved Searches | Similarweb",
  "description": "Learn how to use our new Saved Searches feature to find fresh leads every month and keep an eye on your market, while only setting your criteria once, here",
  "content": "HomeBlogUpdatesProduct UpdatesIntroducing Saved Searches Updates Introducing Saved Searches Explore More by Sigal Berezin , Sales Intel. Content Manager at Similarweb 1 Min. November 22, 2020 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Similarweb’s Sales Intelligence empowers you to perform best-in-class lead generation by discovering new, high-quality prospects that have a clear need for your solution. We’re excited to share that the newest addition to our Lead Generator is here! Now with our Saved Searches feature, you can keep your search criteria intact and automatically refresh your pipeline with new leads that match your ideal customer profile. Instead of running a new search each month to source new leads, your saved searches will automatically refresh every month, flagging new leads that become relevant. Here is why you’ll love it: Fresh leads every month: Using this will help you keep a close eye on your market and spot new players as they become relevant prospective buyers Setting your search criteria only once: You no longer need to choose your search criteria on a monthly bases How it works To set up a saved search, click Find Outbound Leads from the homepage and set up your lead generation criteria. Once you’re all done setting up your search criteria, click Run. Our system will generate a list of results, and you’ll have the option to save it for a monthly update. Each month, you will receive an email alerting you about new available leads that fit your criteria. From the Homepage, click Find Outbound Leads to review your existing saved searches and how many leads were added since the previous month. When viewing the list, you can choose to see only the new leads added this month and add them to your Lead List. And that’s it! by Sigal Berezin Sales Intel. Content Manager at Similarweb Sigal weaves data and insights into engaging content. She holds degrees in Communications and Security & Diplomacy and enjoys reading, traveling, and exploring Tel Aviv. Related Topics: Product Updates This post is subject to Similarweb legal notices and disclaimers. Related Posts Updates Similarweb Product Updates: The September 2024 Edition Product Updates by Adelle Kehoe 2 Min. Oct 14, 2024 Updates Similarweb Product Updates: The August 2024 Edition Product Updates by Adelle Kehoe 3 Min. Sep 11, 2024 Updates Similarweb Rank Tracker Now Tracks Google’s AI Overviews Product Updates by Shay Harel 2 Min. Aug 19, 2024 Updates Similarweb Product Updates: The July 2024 Edition Product Updates by Adelle Kehoe 3 Min. Aug 12, 2024 Updates Say Hello to Similarweb’s Technical SEO Tool Product Updates by Adelle Kehoe 3 Min. Jul 18, 2024 Updates Introducing Data Exporter: Simplified Access to Similarweb Data at Scale Product Updates by Pavel Dimshiz 4 Min. Jul 11, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Introducing Saved Searches"
    },
    {
      "level": "H2",
      "text": "How it works"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The September 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The August 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Similarweb Rank Tracker Now Tracks Google’s AI Overviews"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The July 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Say Hello to Similarweb’s Technical SEO Tool"
    },
    {
      "level": "H3",
      "text": "Introducing Data Exporter: Simplified Access to Similarweb Data at Scale"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Sigal Berezin"
}