{
  "url": "https://www.similarweb.com/blog/updates/product-updates/more-countries/",
  "slug": "more-countries",
  "title": "More Countries Added to App Engagement | Similarweb",
  "description": "App engagement data update alert: We've just added 15 additional countries to our app engagement feature on Similarweb platform. Join today to see them all!",
  "content": "HomeBlogUpdatesProduct UpdatesMore Countries Added to App Engagement on Similarweb Platform! Updates More Countries Added to App Engagement on Similarweb Platform! Start your free trial by Natalie Halimi 2 Min. July 27, 2015 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Since launching App Engagement on Similarweb platform in January, we’ve been getting amazing feedback from our users, who say that this section has now become an essential part of their competitive and market app analysis process. With features such as ‘Current Installs’, ‘Active Users’, and ‘Retention’, it’s now easier than ever to understand the true value of any mobile app, and to approach new markets and industries with the information required to succeed. Up until now, all App Engagement features were available for 3 markets – US, UK and India. We’re super excited to announce the release of 15 additional countries! App Engagement users will now be able to contact their account manager and ask for access to any of these 18 countries: Argentina Australia Austria Brazil France Germany Italy India Netherlands Philippines Poland Russia South Africa Spain Thailand Turkey United Kingdom United States The additional countries are crucial for truly understanding a market or an app, since metrics such as Active Users or Session Time, vary between countries. For instance, Pinterest performs very differently in different markets, based on App Engagement data: These stats show that among Android users, the country with the most current installs for Pinterest’s App is the US, and the one with the least is Brazil. We can also see that the percentage of users that use the app post-installation is the lowest in the UK. This might indicate that Pinterest’s acquisition strategy leads to many installs in this market, but the install sources are of a lower quality compared to installs in the US market. The usage time and sessions per user are very similar in all countries, possibly indicating that Pinterest are doing a good job when it comes to UX, especially with localizing their content. You can read about App Engagement and other App Analysis features here. by Natalie Halimi Natalie Halimi has over 10 years of marketing experience across B2C and B2B sectors. Related Topics: Product Updates This post is subject to Similarweb legal notices and disclaimers. Related Posts Updates Similarweb Product Updates: The September 2024 Edition Product Updates by Adelle Kehoe 2 Min. Oct 14, 2024 Updates Similarweb Product Updates: The August 2024 Edition Product Updates by Adelle Kehoe 3 Min. Sep 11, 2024 Updates Similarweb Rank Tracker Now Tracks Google’s AI Overviews Product Updates by Shay Harel 2 Min. Aug 19, 2024 Updates Similarweb Product Updates: The July 2024 Edition Product Updates by Adelle Kehoe 3 Min. Aug 12, 2024 Updates Say Hello to Similarweb’s Technical SEO Tool Product Updates by Adelle Kehoe 3 Min. Jul 18, 2024 Updates Introducing Data Exporter: Simplified Access to Similarweb Data at Scale Product Updates by Pavel Dimshiz 4 Min. Jul 11, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "More Countries Added to App Engagement on Similarweb Platform!"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The September 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The August 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Similarweb Rank Tracker Now Tracks Google’s AI Overviews"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The July 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Say Hello to Similarweb’s Technical SEO Tool"
    },
    {
      "level": "H3",
      "text": "Introducing Data Exporter: Simplified Access to Similarweb Data at Scale"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Natalie Halimi"
}