{
  "url": "https://www.similarweb.com/blog/updates/product-updates/new-features-2021/",
  "slug": "new-features-2021",
  "title": "Similarweb New Features - 2021 Overview | Similarweb",
  "description": "Business changes, fast. You need a platform that moves with the times. Here’s everything we released last year that’ll take your company to the next level.",
  "content": "HomeBlogUpdatesProduct UpdatesNew Similarweb Features 2021: Take Your Business To The Next Level Updates New Similarweb Features 2021: Take Your Business To The Next Level Start your free trial by Kyle Weeks , Senior Product Marketing Manager, Similarweb 16 Min. February 3, 2022 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic You need to move fast in the digital world. Because everything’s in flux. Opportunities, challenges, competitors, and even strategies. And that’s why we’re constantly evolving Similarweb. To help keep you at the forefront of your field online. Here’s how we improved the platform in 2021, and how those changes drive your results. Digital Marketing Intelligence Competitive Tracker Easily track and monitor competitors’ websites and get actionable insights. The Competitive Tracker provides updates about any website’s performance across digital channels. With it, you can track up to 10 competitors’ websites side by side – and uncover traffic trends as they break. This tool helps you: Monitor trends across channels, including organic traffic and ranking, paid performance, display, social, referrals, and direct Discover the traffic share of each competitor’s website domain and the MoM% change Receive directly to your mail and never miss another update Ranking Distribution Monitor site ranking trends on Google SERPs. Ranking Distribution is a powerful tool that provides you with a quick and thorough understanding of how well any website is ranking on Google over time. So you can easily discover the keywords for which any site ranks in the top three positions (or top 10, 20, you name it). You can even see any website’s ranking distribution to compare your performance to your competitors and compare trends. This tool can help you: Find out how high your SERP rankings are vs. your competitors Detect weak spots in your competitors’ ranking performance over time Conduct deep analysis on rank position, volume, CPC, and SERP features Discover how a site ranked in a specific month and spot website ranking trends Reveal which topics your competitors are planning to target for their future growth Explore the top domain per keyword and learn about a competitor’s content strategy SERP Feature Analysis Get insights to conquer more SERP features. SERP features are the additional elements that appear alongside classic results after a Google search, like rich snippets, images, reviews, FAQs, and more. In 2021, we added SERP feature data for any keyword. This tool can help you: Discover and analyze SERP feature opportunities that you can use to win prime real estate on SERPs and gain more traffic Find the keywords for which you or your competitors have high-visibility SERP features Zero-click Search Discover the keywords that actually drive traffic. You know how when Googling, you often get the answer to your query at the top of the search results page without needing to click on a result? This is a “zero-click” search, resulting from SERP features like Quick Answers, Knowledge Boxes, and Top Stories (news). We made the zero-click % metric available within several of our keyword research tools. This feature can help you: See the percentage of zero-clicks for keywords to figure out which keywords are worth targeting A better understanding of search intent Optimize your PPC strategy with keywords that will actually drive clicks to your site. SERP Snapshot Monitor your ranking on Google and grow your keyword list. The SERP Snapshot tool gives you a quick summary of the search engine results page for any keyword, including the top results (and changes in rank), as well as SERP features that are present. This tool can help you: Discover and qualify new keywords, including long-tail keywords Monitor your SEO performance on ranked keywords Discover new SERP feature opportunities for specific keywords Search Competitors Pages Get an understanding of who your keyword competitors really are. To provide you with an in-depth view of exactly who you’re up against for organic or paid traffic, we’ve improved our search competitors’ pages. Your competitive set may surprise you, as the list of domains may be very different from your well-known competitors, especially for a specific time period or geography. This tool can help you: Identify search competitors for both organic and paid traffic, including competitors that may have flown under your radar Drill down to specific industries, website types, or ad types and get a thorough view of the entire market map Use the Search Overlap Score to get a 1-100 score of how much you’re competing with a given domain for search traffic Keyword Gap Analyze which keywords are sending traffic to you vs. your competitors. Our Keyword Gap tool is a powerful tool for competitive keyword research. If you’re a content or PPC manager, the insights can provide you with a crystal clear understanding of which keywords to prioritize to win (or maintain) traffic share from competitors. This tool can help you: Uncover keyword wins, losses, and opportunities and optimize your PPC and SEO strategies Visualize how much traffic you’re getting vs. your competitors and discover where keywords overlap Drill down and analyze each keyword gap according to SERP features, traffic share, CPC, position, and more Organic Pages Identify the SEO strategies of the pages driving the most traffic. With the Organic Pages tool, you can discover a competitor’s most popular organic pages (by traffic) to reverse engineer their tactics and keywords. This tool can help you: Examine a page’s organic traffic share and trends by country and period Find the number of keywords driving traffic to the page and its top keywords See which newly discovered pages started winning traffic recently Analyze a page’s performance and get to grips with your competitor’s content strategy Organic Search Overview Quickly Identify SEO opportunities at a glance. The Organic Search Overview page offers a bird’s eye view of your domain’s overall organic performance against your competitors. Get familiar with any website’s search traffic, engagement, and top keywords, then explore each metric in depth. This tool can help you: Get insights about organic traffic and discover key engagement metrics, like session duration, pages per visit, and bounce rate Find the top keywords per domain and drill down for further analysis Identify potential issues through proactive insights Amazon Keyword Generator Generate thousands of high-intent keyword ideas. Finding the right keywords to drive purchases is a challenge eCommerce professionals are facing, in a constantly evolving landscape. With the Keyword Generator update, you get high visibility to top Amazon keywords, complete with monthly search volumes and traffic metrics. This tool can help you: Find and analyze specific Amazon keywords in different countries Better understanding of search behavior for specific keywords Uncover organic vs. paid clicks for different keywords Youtube Keyword Generator Grow your traffic by finding top keywords for video marketing. YouTube SEO has become an important digital strategy component. After all, it receives 8.4% of total search traffic. More searches per month than Bing, Yahoo, AOL, and Ask.com combined. So we’ve added YouTube search data to the Keyword Generator tool. Now you can easily discover which keywords to create or optimize video content for. This tool helps you: Find topics and keywords to build video content around Qualify keywords with metrics like volume, clicks, and top country Optimize existing videos by learning which keywords to include in your meta description and heading tags Hybrid Keyword Volume A new and improved way to estimate keyword volume. We’re dedicated to delivering the industry’s most reliable and accurate digital intelligence data, and in 2021 we made a massive improvement to the way we calculate keyword search volume. What’s changed? In a nutshell, we now supplement the data we receive from Google Ads API with our own behavioral and publicly captured data. We call this a “hybrid” calculation, as it’s now based on several distinct data sources, leading to greater confidence in the result. Learn about the issues we’ve tackled and how we addressed them with Hybrid Keyword Volume. PPC Spend Estimations Reveal and analyze competitive ad spend budgets for paid search. Understand competitors’ estimated ad spends, potential budgets, and how they deliver on paid search strategies with PPC Spend. This is an essential feature for PPC managers who analyze budgets for paid search and create short- and long-term strategies. This feature can help you: Plan and justify ad spend on marketing channels Understand the effectiveness of competitors’ online advertising activities Identify shifts in search ad spend and analyze advertising spend over time Evaluate investment per channel based on competitors’ ad spend Spot uptick in spending trends linked to specific campaigns Paid Landing Pages Reveal the best-performing paid campaigns driving traffic to any website. The Paid Landing page feature enables performance marketers and PPC managers to make strategic decisions that will drive maximum ROI from their own campaigns. Use this tool to find and evaluate your competitors’ top landing pages, and gain deep insights on the effectiveness of their campaign performance. This tool can help you: Find the landing pages that get the most paid traffic by country See the estimated spend attributed to each landing page and campaign Reveal the best-performing search ads and analyze the paid keywords driving traffic to each landing page Easily cluster targeted keywords for your own campaigns Review the messaging on the landing pages that have the greatest engagement and success Paid Search Overview Get a holistic view of any website’s paid search activity. The Paid Search Overview page provides a summary of key insights into the traffic paid search drives to your site and lets you compare against your competitors. PPC managers and performance marketers get the data they need to understand the budgets, keywords, and ads driving competitors’ paid search campaigns. This tool can help you: Quickly and comprehensively benchmark paid traffic against a competitor’s set, and evaluate their paid search strategies Analyze paid traffic engagement metrics like visit duration, pages per visit, and bounce rate that indicate ROI success Break down a competitor’s most recent search ads and display ads that drive paid traffic Display Overview Page Get a summarized view of your competitor’s display traffic strategy. The Display Ads Overview page gives you a holistic view of competitors in their display traffic. Quickly analyze live ad creatives and messaging to identify your competitors’ best-performing campaigns. Get high-level data, like total ad visits, number of ads, campaigns, and landing pages Analyze traffic and engagement with metrics like visit duration, pages per visit, and bounce rate Get a snapshot of the top publishers and ad networks competitors use to drive their digital ad strategy Affiliates by Industry Find high-performing affiliate partners from any industry. If you’re an affiliates or partnerships manager, hunting for new partners within your industry (or looking to branch out to potential affiliates in other markets) this is the tool for you. Get to know referral traffic at an industry level to discover relevant opportunities and top referral domains sending traffic to websites. This tool can help you: Get a high-level view of referral visits, referral leaders, and more – for any country or time period Deep dive into key metrics for any website, and analyze factors like traffic share and change in traffic Find affiliates of interest and add them to partner lists to further evaluate and qualify The Creatives tool: Added New Countries Get a detailed catalog of your competitor’s display ads. Our Creatives tool is a powerful way to get a look at your competitors’ creatives across all of their campaigns. Get insights on the ad format, brand messaging, and ad copy being used across any digital campaign. We added new countries to the mix in 2021, so now you can analyze display ad creatives from places like Brazil, Russia, Italy, Greece, and many more. Digital Research Intelligence Company Analysis Build an in-depth view of any company’s digital footprint. Company Analysis provides visibility into any business’ market size and performance. Now, you can define any company based on the multiple websites or domains it owns to reveal its digital reach. Then, easily benchmark against competitors. This tool helps you: Build your analysis and reporting at an entity level, including every existing subdomain Discover market opportunities by analyzing your competitors’ aggregated digital performance Reveal a company’s Total Audience or the number of unique visitors across all its assets Get an inside view into a company’s traffic and engagement over time, including key metrics like visits, page views, bounce rate, and more Add a filter to view a specific country, or see aggregated data worldwide Competitive Tracking Effortlessly track and monitor your digital market share. Competitive Tracking delivers an aggregated view of a company’s digital performance against direct competitors. With it, you can monitor your competitive landscape and surface insights based on changing market dynamics. This tool helps you: Benchmark any website or business segment against competitors Track and monitor market share over time Get comparative data for up to 25 players at a time Stay in the know, with monthly email updates Segment Analysis Take your competitive research deeper, with powerful enhancements that enable you to segment websites across business lines, products, or topics. We’ve added exciting new Segment Analysis tools: Marketing Channels Discover traffic sources and engagement across segments. The Marketing Channels page provides an unrivaled view into a website’s traffic sources, so you can deep dive into each segment’s traffic and engagement. Discover the leading channels generating traffic for each segment – like direct, organic search, social, email, display ads, and more. This tool helps you: Determine which channel drives the most traffic and engagement over time for a segment Compare players in each segment according to their traffic sources See which channels perform the best and find opportunities to grow your traffic share Geography Analyze market segments across regions. The Geography page enables you to view and analyze the traffic share per country for a website segment. Deep dive into the web behavior of a particular market segment, in a specific location. This tool helps you: Analyze the traffic share for a segment, distributed by country Understand performance, regional interest, and growth opportunities for any market, anywhere Identify patterns in traffic and engagement over time Explore valuable metrics like visit duration, bounce rate, and pages per visit Segment Analysis API Connect segments and conversion data to your workflow. Similarweb’s new standard API capability lets you integrate traffic and engagement metrics from Segment Analysis into your reporting workflow. Use data visualization tools like Google Data Studio and Tableau to seamlessly centralize your data sources. This tool helps you: Automate your segment creation workflow and increase productivity, removing data silos and processing data at scale Reduce time-to-insight by integrating into third-party workflows and data visualization tools Add in-depth metrics like visits, duration per visit, page views, and bounce rate in your reporting Exact URL Analyze the traffic of a specific website’s page. This feature makes it possible to isolate and measure a target URL, so you can analyze a domain’s homepage, landing page, main category page, or product page. Simply paste URLs of selected pages or folders and measure the page’s traffic, excluding traffic from subpages. Measure and isolate the traffic that arrives into a company’s business line, brand, or topic interests Understand how much traffic a specific page of a site generates over time Audience Overlap Measure the market size and audience overlap for any website. Audience Overlap enables you to analyze, compare, and gain valuable insights on unique and shared audiences across multiple websites. With this tool, you can determine the total size of an audience, then benchmark your performance to learn how much traffic you and your competitors share – and discover untapped opportunities. This tool helps you: Analyze audience loyalty and discover which website has the greatest number of exclusive visitors Get an overview of the shared unique visitors for all the sites analyzed, over time Gain insight into expansion opportunities to bring new propositions, products, or content strategies to market New vs Returning Users Analyze the retention of website visitors for competitor analysis. With this audience measurement feature, you can track the user engagement level and discover the number of new vs. returning site visitors. Use these insights to measure the success of your customer acquisition and retention strategies and benchmark against competitors. Analyze the number and percentage of new vs. returning traffic for any website Compare up to five websites and compare retention strategies for each player Explore the trends for any time period and any region worldwide Audience Loyalty for Custom Industries Analyze audience loyalty across your industry. Determine audience loyalty by measuring the proportion of monthly active users (MAUs) who visited one site versus other sites within your custom industry. Enhance your research, reporting, and audience loyalty measurement with increased flexibility. Keep a pulse on audience loyalty to benchmark your company against your custom view Identify industry leaders with the most loyal audience and which players pose a potential threat See the distribution of audience loyalty across individual sites and identify where you can win back audience share Search Trends within Industry Analysis Discover the top search trends in your industry. Search Trends provide insight into current industry trends. Use this tool to understand market demand and user search intent based on keywords. This tool helps you: Identify your audience’s search interests and the market demand for a specific category, brand, or product Find the top-searched keywords along with important metrics like traffic share, volume, and more Uncover the traffic leaders for every keyword trend Stay relevant in your industry by using newly discovered search terms that started trending this month Search Interest Analysis Expand your keyword search to gain a holistic view of the market potential. Search Interest Analysis enables you to analyze web traffic based on what people are searching for. You can start with just one keyword and take advantage of the Related Search Term filter to generate up to 100 additional search terms with the click of a button. This tool helps you: Expand your search by adding new words right as you start your analysis Discover related search terms and phrases relevant to your industry Get an overview of and understand the market potential and reach of a product, topic, or trending terms Create a custom industry based on search interests to analyze consumer and competitive trends Unique Visitors for Industry Analysis Size your market by measuring the number of people behind the visits. Size your market opportunity (Total Addressable Market) and calculate the number of people behind the aggregated traffic and engagement data. This tool helps you: Measure market share performance based on unique visitors Reveal whether your market is growing or shrinking based on real user behavior Trend out Industry Leaders See how a player’s position changes over time. The Market Quadrant Analysis graph under Industry Leaders now includes additional historical data (up to the last three months) to track rising players, and how they change position from quarter to quarter. This tool helps you: Benchmark against industry players by examining the intersection between different metrics View the industry average to understand whether specific players are over or under-indexing See which player is gaining traction over time (from one month snapshot to quarter over quarter) Sales Intelligence The new Lead Generator Our most intuitive Lead Generation experience yet. The Lead Generator provides a fast, intuitive experience for finding and qualifying relevant leads. Filter your criteria to get results in real time and find leads that match your ideal customer profile. Maximize your results with new filters, including: PPC Spend Easily target companies based on their ad spend. Find and monitor companies based on their PPC spend (say, companies that spend at least $2 million on ads). This filter is perfect for any B2B company looking to find viable prospects based on ad spend. Company Revenue Reveal a company’s revenue to help build your territories. Filter leads by annual revenue. Build and prospect your territories based on companies within a specific range of annual revenue. International Visits Find prospects who receive a significant number of international visitors. Discover companies with a traffic share outside their main geography. This new filter is useful for identifying international growth opportunities. For example, if you’re a shipping company searching for new business potential. Suppression Lists Deduplicate accounts that already exist in other lists or your CRM. Exclude irrelevant accounts based on a centralized suppression list with this filter. For example, deduplicate customers or prospects you’re already working with, to focus on net new opportunities. Employee Headcount Build your territories with the employee headcount filter. Filter by the number of employees when searching for new leads. Build and prospect your territories based on companies within a specific size of business. New sidebar Get key insights about your prospects or accounts. We’ve rebuilt the sidebar to equip sales reps with everything they need, in one place. Get full visibility into any prospect – from general company information to top-growing countries, and site trends to a full overview of their digital presence across all marketing channels. The new sidebar packs lots of powerful new features, including: Insights Generator Increase client response rates with consultative selling at scale. Easily uncover valuable insights you can share with prospects to break through the noise and grab their attention. The Insights Generator surfaces areas of opportunities where your solution can help your prospects and clients. Armed with relevant insights your prospects actually care about, you’ll be able to confidently position yourself as a strategic consultant. This gets your clients to pay attention, trust, and engage with you. This tool helps you: Stop digging for data, as our AI engine automatically surfaces insights for you Get the insights your clients care about, prioritized by the biggest areas of opportunity Share insights, including visuals, with a click Contacts Find decision-makers for sales outreach. Contact data empowers you to connect with a company’s right decision-makers. Find decision-makers based on their location, role, and department, and get direct access to their business contact information, including email, phone number, and more. Save hours of research and prioritize your focus on the right opportunities, increasing your chances of success. Salesforce Company View widget Get the best out of Similarweb Sales Intelligence, right in Salesforce The updated Company View Salesforce widget provides robust sales intelligence insights on your prospects, leads, and accounts – right in Salesforce. It’s got everything you need to see if a client is a fit, and to find the right angle to engage with them. The widget provides you with: Site info (main growth metrics, top countries, news, etc.) Technographics (technologies used/not used) Site trends (visits, uniques, bounce rates, etc.) Growth opportunities (where your solution can specifically help that client) Contact information for company decision-makers (including phone and email) The best part is, that you can easily spin up outreach emails with key insights, all from Salesforce. Shopper Intelligence Did you know the top 100 marketplaces make up 63% of global eCommerce sales? Or that marketplaces are the number one shopping destination online? That’s why we launched our first eCommerce-focused solution, Similarweb Shopper Intelligence – to deliver real shopper behavior data for the leading digital marketplaces. It enables you to react to changing consumer demand and competitive threats, grow sales, increase customer loyalty, and optimize your product portfolios. With Similarweb Shopper Intelligence, you can access comprehensive digital consumer behavior insights for five leading retailers: Amazon, Walmart, Target, Best Buy, and Chewy. Here’s a glimpse at what you can do with Similarweb Shopper Intelligence: Monitor consumer demand – Analyze monthly and daily product views, units sold, and revenues – at a category, brand, and product level – to understand consumer demand. Analyze consumer behavior – Access holistic customer journey data (including cross-shopping behavior, loyalty, retention, branded vs. unbranded clicks data, and Subscribe & Save rates) of sales and revenue for virtually every category and brand on Amazon. Optimize retail search strategies – Identify the best-performing keywords, paid vs. organic split, branded vs. non-branded searches, clicks by position, and top brands per keyword to optimize your Amazon search strategy. Benchmark category and brand – Compare brands and categories on Amazon side-by-side for easy benchmarking. Quickly identify trends and growth opportunities by comparing different brands and category combinations. by Kyle Weeks Senior Product Marketing Manager, Similarweb With experience at Apple and startups, Kyle helps SEOs grow traffic at Similarweb. He’s also a culinary school grad and Certified Sommelier. Related Topics: Product Updates This post is subject to Similarweb legal notices and disclaimers. Related Posts Updates Similarweb Product Updates: The September 2024 Edition Product Updates by Adelle Kehoe 2 Min. Oct 14, 2024 Updates Similarweb Product Updates: The August 2024 Edition Product Updates by Adelle Kehoe 3 Min. Sep 11, 2024 Updates Similarweb Rank Tracker Now Tracks Google’s AI Overviews Product Updates by Shay Harel 2 Min. Aug 19, 2024 Updates Similarweb Product Updates: The July 2024 Edition Product Updates by Adelle Kehoe 3 Min. Aug 12, 2024 Updates Say Hello to Similarweb’s Technical SEO Tool Product Updates by Adelle Kehoe 3 Min. Jul 18, 2024 Updates Introducing Data Exporter: Simplified Access to Similarweb Data at Scale Product Updates by Pavel Dimshiz 4 Min. Jul 11, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "New Similarweb Features 2021: Take Your Business To The Next Level"
    },
    {
      "level": "H2",
      "text": "Digital Marketing Intelligence"
    },
    {
      "level": "H3",
      "text": "Competitive Tracker"
    },
    {
      "level": "H3",
      "text": "Ranking Distribution"
    },
    {
      "level": "H3",
      "text": "SERP Feature Analysis"
    },
    {
      "level": "H3",
      "text": "Zero-click Search"
    },
    {
      "level": "H3",
      "text": "SERP Snapshot"
    },
    {
      "level": "H3",
      "text": "Search Competitors Pages"
    },
    {
      "level": "H3",
      "text": "Keyword Gap"
    },
    {
      "level": "H3",
      "text": "Organic Pages"
    },
    {
      "level": "H3",
      "text": "Organic Search Overview"
    },
    {
      "level": "H3",
      "text": "Amazon Keyword Generator"
    },
    {
      "level": "H3",
      "text": "Youtube Keyword Generator"
    },
    {
      "level": "H3",
      "text": "Hybrid Keyword Volume"
    },
    {
      "level": "H3",
      "text": "PPC Spend Estimations"
    },
    {
      "level": "H3",
      "text": "Paid Landing Pages"
    },
    {
      "level": "H3",
      "text": "Paid Search Overview"
    },
    {
      "level": "H3",
      "text": "Display Overview Page"
    },
    {
      "level": "H3",
      "text": "Affiliates by Industry"
    },
    {
      "level": "H3",
      "text": "The Creatives tool: Added New Countries"
    },
    {
      "level": "H2",
      "text": "Digital Research Intelligence"
    },
    {
      "level": "H3",
      "text": "Company Analysis"
    },
    {
      "level": "H3",
      "text": "Competitive Tracking"
    },
    {
      "level": "H3",
      "text": "Segment Analysis"
    },
    {
      "level": "H4",
      "text": "Marketing Channels"
    },
    {
      "level": "H4",
      "text": "Geography"
    },
    {
      "level": "H4",
      "text": "Segment Analysis API"
    },
    {
      "level": "H4",
      "text": "Exact URL"
    },
    {
      "level": "H3",
      "text": "Audience Overlap"
    },
    {
      "level": "H3",
      "text": "New vs Returning Users"
    },
    {
      "level": "H3",
      "text": "Audience Loyalty for Custom Industries"
    },
    {
      "level": "H3",
      "text": "Search Trends within Industry Analysis"
    },
    {
      "level": "H3",
      "text": "Search Interest Analysis"
    },
    {
      "level": "H3",
      "text": "Unique Visitors for Industry Analysis"
    },
    {
      "level": "H3",
      "text": "Trend out Industry Leaders"
    },
    {
      "level": "H2",
      "text": "Sales Intelligence"
    },
    {
      "level": "H3",
      "text": "The new Lead Generator"
    },
    {
      "level": "H4",
      "text": "PPC Spend"
    },
    {
      "level": "H4",
      "text": "Company Revenue"
    },
    {
      "level": "H4",
      "text": "International Visits"
    },
    {
      "level": "H4",
      "text": "Suppression Lists"
    },
    {
      "level": "H4",
      "text": "Employee Headcount"
    },
    {
      "level": "H3",
      "text": "New sidebar"
    },
    {
      "level": "H4",
      "text": "Insights Generator"
    },
    {
      "level": "H4",
      "text": "Contacts"
    },
    {
      "level": "H3",
      "text": "Salesforce Company View widget"
    },
    {
      "level": "H2",
      "text": "Shopper Intelligence"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The September 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The August 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Similarweb Rank Tracker Now Tracks Google’s AI Overviews"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The July 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Say Hello to Similarweb’s Technical SEO Tool"
    },
    {
      "level": "H3",
      "text": "Introducing Data Exporter: Simplified Access to Similarweb Data at Scale"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Kyle Weeks"
}