{
  "url": "https://www.similarweb.com/blog/updates/product-updates/new-shopper-features/",
  "slug": "new-shopper-features",
  "title": "6 New Features to Optimize eCommerce Strategy | Similarweb",
  "description": "Learn what’s new with Shopper Intelligence, part of our eCommerce solution suite, including Subscribe & Save insights, shopper overlap, and more.",
  "content": "HomeBlogUpdatesProduct UpdatesIntroducing 6 New Shopper Intelligence Features [June Update] Updates Introducing 6 New Shopper Intelligence Features [June Update] Try shopper intelligence by Anat Avshalom , Senior Product Marketing Manager at Similarweb 3 Min. June 24, 2021 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic 1. Subscribe & Save Insights Optimize your subscription strategy using Subscribe & Save Insights. Amazon’s Subscribe & Save program can be used to your advantage if you have the right data. The benefits of the program include increased customer loyalty and lower customer acquisition cost (CAC). However, disadvantages include lower profit margins. We’ve developed a feature to give you insight into how the program is impacting your business and your competitors. With our new Subscribe & Save insights, you can: Estimate how many new customers you’re losing to Amazon’s subscription program Analyze Subscribe & Save’s impact on competitor and category revenues Evaluate Subscribe & Save’s potential revenue impact on your brand 2. Shopper Overlap Understand where your customers shop so you can invest in the right channels. Endless online shopping options encourage customers to compare products on different retailers and DTC sites to find the best deal. By monitoring this cross-shopping behavior, you can invest the right resources in the right (market)places. Shopper Overlap insights allow you to: Prioritize retailers based on your customers’ cross-shopping habits Discover new channels consumers are using to find competitors’ products Track shopper overlap changes to inform your channel strategy 3. 1P vs. 3P Performance Discover 3P sellers’ impact on every category and brand. Are you selling 1P on Amazon, 3P, or a combination of both? Deciding on the right strategy requires a lot of trial and error, and we are geared up to help. With this new 1P vs. 3P feature, you can analyze the split between 1P and 3P revenues, units sold, and product views. 1P vs. 3P insights help you: Measure the impact of 3P sellers on your brand’s sales Identify categories with high/low 3P penetration to inform category strategy Optimize pricing strategies by analyzing 3P vs. 1P price levels 4. Keyword Search Results Track how your competitors’ products rank on Amazon. Amazon’s search results positions change frequently, making it difficult for brands to monitor their search performance and Amazon SEO. With our Keyword Search Results feature you can analyze the first-page search results for every keyword so you can: Monitor your brand’s first-page coverage Inform your Amazon search strategy Evaluate keywords’ market opportunity 5. Purchase Frequency Monitor changes in purchase frequency for different categories and brands. Understanding how frequently customers buy your products is the first step in improving customer loyalty. With the Purchase Frequency trend view, you can track changes in purchase frequency to identify potential loyalty issues and act in real-time. 6. Product Performance Over Time Monitor ASIN performance to optimize your product portfolio. Uncover which products perform the best during different parts of the year so you can optimize your portfolio. With Product Performance Over Time, you can: Generate new product ideas Identify product white spaces Spot product trends before the competition Want to give it a try? Still don’t have access? Reach out to your account manager or contact us for more details. by Anat Avshalom Senior Product Marketing Manager at Similarweb Anat, with 10+ years in marketing, creates data-driven products for eCommerce. Based in Tel Aviv, she enjoys Israel’s beaches, baking, and yoga. Related Topics: Product Updates Retail Insights This post is subject to Similarweb legal notices and disclaimers. Related Posts Updates Similarweb Product Updates: The September 2024 Edition Product Updates by Adelle Kehoe 2 Min. Oct 14, 2024 Updates Similarweb Product Updates: The August 2024 Edition Product Updates by Adelle Kehoe 3 Min. Sep 11, 2024 Updates Similarweb Rank Tracker Now Tracks Google’s AI Overviews Product Updates by Shay Harel 2 Min. Aug 19, 2024 Updates Similarweb Product Updates: The July 2024 Edition Product Updates by Adelle Kehoe 3 Min. Aug 12, 2024 Updates Say Hello to Similarweb’s Technical SEO Tool Product Updates by Adelle Kehoe 3 Min. Jul 18, 2024 Updates Introducing Data Exporter: Simplified Access to Similarweb Data at Scale Product Updates by Pavel Dimshiz 4 Min. Jul 11, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Introducing 6 New Shopper Intelligence Features [June Update]"
    },
    {
      "level": "H2",
      "text": "1. Subscribe & Save Insights"
    },
    {
      "level": "H2",
      "text": "2. Shopper Overlap"
    },
    {
      "level": "H2",
      "text": "3. 1P vs. 3P Performance"
    },
    {
      "level": "H2",
      "text": "4. Keyword Search Results"
    },
    {
      "level": "H2",
      "text": "5. Purchase Frequency"
    },
    {
      "level": "H2",
      "text": "6. Product Performance Over Time"
    },
    {
      "level": "H2",
      "text": "Want to give it a try?"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The September 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The August 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Similarweb Rank Tracker Now Tracks Google’s AI Overviews"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The July 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Say Hello to Similarweb’s Technical SEO Tool"
    },
    {
      "level": "H3",
      "text": "Introducing Data Exporter: Simplified Access to Similarweb Data at Scale"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Anat Avshalom"
}