{
  "url": "https://www.similarweb.com/blog/updates/product-updates/paid-pro/",
  "slug": "paid-pro",
  "title": "New Paid Keyword Analysis Feature Released | Similarweb",
  "description": "Discover the power of paid keyword analysis on Similarweb platform! Track your competitors' paid keywords and uncover opportunities for your own campaigns.",
  "content": "HomeBlogUpdatesProduct UpdatesThe New Paid Keyword Analysis Feature on Similarweb Platform Updates The New Paid Keyword Analysis Feature on Similarweb Platform Start your free trial by Natalie Halimi 2 Min. May 26, 2014 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic I’m always extra happy when I get to announce the release of cool new features on Similarweb Platform. Those features which I know I’ll use a lot in my own work. Generally, being from the online marketing industry, working on spreading the word about a platform I personally love and use on a daily basis, is an extra bonus. The last time I felt this excited was when we released the ‘Comparison’ feature and I almost cried (tears of joy), when I used it to compare things such as referring websites and referring keywords. But enough with the foreplay, let’s move on to the new feature – Deep Analysis of Paid Keywords The new feature is a small (visually) but significant one – you can now click on the newly added icon – ‘Ads’, which is located next to each keyword, in the keywords list under: Traffic Sources > Search, on Similarweb platform. This will take you to the ‘Search Ads’ tab, but instead of showing you the general ads for the analyzed domain, you’ll be able to see specific ads for search terms containing the word you’ve clicked on. How can I use this to improve my PPC campaigns? When you’re building your PPC search campaigns there are 3 content components that you need to take under account: Keywords Search Ads Landing pages Similarweb platform gives you the first two in your Basic and Advanced accounts and the 3rd in Enterprise accounts (via the feature – Popular pages). You can access those specific keywords your competitors are using in their campaigns and now, you can also see which ads they’re using these keywords on. Let’s have a look at the paid keywords of Junglee.com, a leading online shopping website in India. For this example, we’ll exclude the branded keywords by marketing the check box next to ‘Exclude branded keywords’ located just above the ‘Search terms’ table. Let’s look at the ads for ‘online mobile shopping’: Clicking on the ‘Ads’ icon will take us to the ‘Search Ads’ tab and as you can see, will give us all the ads Junglee.com are bidding for with any search term containing the words ‘online money shopping’. You can also search for ads for any given keyword or search term using the search box under the ‘Search Ads’ tab: We’re eager to hear what you have to say about this cool new feature. Tell us how it helped you in your PPC work. Send us your case studies. We promise to publish the good ones! by Natalie Halimi Natalie Halimi has over 10 years of marketing experience across B2C and B2B sectors. Related Topics: Product Updates This post is subject to Similarweb legal notices and disclaimers. Related Posts Updates Similarweb Product Updates: The September 2024 Edition Product Updates by Adelle Kehoe 2 Min. Oct 14, 2024 Updates Similarweb Product Updates: The August 2024 Edition Product Updates by Adelle Kehoe 3 Min. Sep 11, 2024 Updates Similarweb Rank Tracker Now Tracks Google’s AI Overviews Product Updates by Shay Harel 2 Min. Aug 19, 2024 Updates Similarweb Product Updates: The July 2024 Edition Product Updates by Adelle Kehoe 3 Min. Aug 12, 2024 Updates Say Hello to Similarweb’s Technical SEO Tool Product Updates by Adelle Kehoe 3 Min. Jul 18, 2024 Updates Introducing Data Exporter: Simplified Access to Similarweb Data at Scale Product Updates by Pavel Dimshiz 4 Min. Jul 11, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "The New Paid Keyword Analysis Feature on Similarweb Platform"
    },
    {
      "level": "H2",
      "text": "Deep Analysis of Paid Keywords"
    },
    {
      "level": "H3",
      "text": "How can I use this to improve my PPC campaigns?"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The September 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The August 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Similarweb Rank Tracker Now Tracks Google’s AI Overviews"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The July 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Say Hello to Similarweb’s Technical SEO Tool"
    },
    {
      "level": "H3",
      "text": "Introducing Data Exporter: Simplified Access to Similarweb Data at Scale"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Natalie Halimi"
}