{
  "url": "https://www.similarweb.com/blog/updates/product-updates/q3-features-2022/",
  "slug": "q3-features-2022",
  "title": "3 New Features: Work Smarter, Not Harder | Similarweb",
  "description": "Read the Similarweb Digital Research Intelligence quarterly round-up and see our latest feature drops that help you work smarter, not harder.",
  "content": "HomeBlogUpdatesProduct Updates3 New Digital Intelligence Features To Help You Work Smarter – Not Harder Updates 3 New Digital Intelligence Features To Help You Work Smarter – Not Harder Start your free trial by Liz March , Digital Research Specialist 3 Min. October 12, 2022 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Successful companies use digital intelligence to thrive and survive. With current market conditions presenting frequent challenges, having faster access to insights is crucial At Similarweb, we continuously enhance and develop features to keep saving you time, make your life easier, and ensure you’ve got the tools you need to succeed. Each of these three features has been designed with one common theme – to give you quick access to insights that count. Read on, to see how our latest feature drops help you find and respond to dynamic shifts faster and stay on top of your game. #1 Popular Pages – the quickest way to view page-level insights, at a glance Launched in August, Popular Pages is the fastest way to discover the highest-hitting pages in your market. With it, you can see exactly what products, content, and campaigns drive traffic and generate the most interest. Discover new, trending, and declining pages on any site Track and view your rivals’ top pages Identify micro-trends faster Measure competitor’s campaign success Deeper website analysis with page-level analytics Analyze on-site search (based on URL parameters) Helps identify markets of interest Improve website segment analysis Analyze large sites with Popular Pages data via Similarweb API Who is it for? Popular Pages is available as a premium add-in for Similarweb Research Intelligence and Digital Suite clients with Advanced or Ultimate packages. How can you get it? The fastest way to access this new feature is via your account manager. Helpful: Get more details about what Popular Pages delivers here. #2 Cross-Market Overview – a faster way to view growth trends and insights across multiple industries Launched in August, Cross-Market Overview helps you access market-level insights across any industry. Use it to find efficient growth opportunities, make decisions about which markets are ripe for entry vs. those that aren’t, and uncover industries of interest for further analysis. View and compare YoY and MoM performance of multiple industries at the same time Spot high-growth or declining industries in a market Refine your view, and get a tailored dashboard of relevant industries in any market A useful tool to quickly spot efficient growth opportunities This enhancement makes customers’ lives easier, by removing the need to analyze each industry as its own island. Bringing together the industries you care about in a single place, enables faster speed to insight; while giving a snapshot view that makes it easier to spot industry-level shifts and trends in any market of interest. Who is it for? The new Cross-Market Overview is available in the platform to existing Similarweb Digital Research Intelligence and Digital Suite clients on the Ultimate Package. How can you get it? Use the below path to reach the new cross-industry feature. Market analysis > Web Market Analysis > All Industries > Overview > Market performance #3 New Segment Builder – a more intuitive way to do website segment analysis Launched in September, the enhanced Segment Builder experience makes it easier to create more accurate website segments for faster analysis. Isolate sections of website traffic relative to topics, products, or categories Intuitively compare with similar segments from competitor websites Quickly share your saved segment analysis with fellow users in your organization View segment size, monthly, visits, and a list of all pages included in each segment Get a dynamic view of your segment as its being defined – not afterward The segment builder works intuitively, enabling the seamless creation of new or adapted website segments. It’s dynamic too, making it easy to see the impact of each filter as and when it’s applied. See it in action here: Who is it for? The new segment builder experience is already live, and available in the platform to existing Similarweb Digital Research Intelligence and Digital Suite customers on the Ultimate Package. Ideal for those who perform website and segment analysis. How can you get it? Use the below path to reach the new website segment feature. Website analysis > Website Segment Analysis If you haven’t already – log in to your Similarweb account to view the enhancements in action or get in touch with your account manager for a quick demo. We’ll see you next quarter with a round-up of the latest enhancements we’ve launched. And, as always, if you have any feedback, get in touch with the team – we love hearing your ideas. by Liz March Digital Research Specialist Liz March has 15 years of experience in content creation. She enjoys the outdoors, F1, and reading, and is pursuing a BSc in Environmental Science. Related Topics: Digital Analysis Product Updates This post is subject to Similarweb legal notices and disclaimers. Related Posts Updates Similarweb Product Updates: The September 2024 Edition Product Updates by Adelle Kehoe 2 Min. Oct 14, 2024 Updates Similarweb Product Updates: The August 2024 Edition Product Updates by Adelle Kehoe 3 Min. Sep 11, 2024 Updates Similarweb Rank Tracker Now Tracks Google’s AI Overviews Product Updates by Shay Harel 2 Min. Aug 19, 2024 Updates Similarweb Product Updates: The July 2024 Edition Product Updates by Adelle Kehoe 3 Min. Aug 12, 2024 Updates Say Hello to Similarweb’s Technical SEO Tool Product Updates by Adelle Kehoe 3 Min. Jul 18, 2024 Updates Introducing Data Exporter: Simplified Access to Similarweb Data at Scale Product Updates by Pavel Dimshiz 4 Min. Jul 11, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "3 New Digital Intelligence Features To Help You Work Smarter – Not Harder"
    },
    {
      "level": "H2",
      "text": "#1 Popular Pages – the quickest way to view page-level insights, at a glance"
    },
    {
      "level": "H2",
      "text": "#2 Cross-Market Overview – a faster way to view growth trends and insights across multiple industries"
    },
    {
      "level": "H2",
      "text": "#3 New Segment Builder – a more intuitive way to do website segment analysis"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The September 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The August 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Similarweb Rank Tracker Now Tracks Google’s AI Overviews"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The July 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Say Hello to Similarweb’s Technical SEO Tool"
    },
    {
      "level": "H3",
      "text": "Introducing Data Exporter: Simplified Access to Similarweb Data at Scale"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Liz March"
}