{
  "url": "https://www.similarweb.com/blog/sales/selling-to-ecommerce/top-ecommerce-companies-uk/",
  "slug": "top-ecommerce-companies-uk",
  "title": "Top Ecommerce Companies in UK | Similarweb",
  "description": "We reveal the top ecommerce companies in UK, plus the fastest-growing ecommerce companies. Click here to learn more & download the full lists.",
  "content": "HomeBlogSalesSelling to EcommerceTop 100 UK Ecommerce Companies: Powerhouses and Challengers Sales Intelligence Top 100 UK Ecommerce Companies: Powerhouses and Challengers Book a live demo by Keren Feldsher , Senior Content Marketing Manager 16 Min. September 1, 2024 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic The ecommerce market is booming, with new companies entering daily. For B2B sales teams, finding prospects in this crowded space can be overwhelming. But don’t worry—we’ve got you covered. Here, we present the UK’s top 100 ecommerce brands. This list is split into the top 50 ecommerce companies and the 50 fastest-growing businesses in the UK. Consider it your one-stop resource. But that’s not all! If you’re interested in more than just UK ecommerce, check out our lists of the top 50 US and top 50 global ecommerce companies, too. Let’s hand out a few awards for July 2024, highlighting the themes we noticed for the top UK ecommerce companies. 🏅 Top Traffic Driver: Mobile with 85.68% (mobile devices rule the world!) 🏅 Top Marketing Channel: Direct with 38.45% (users skipped Google and went straight to the site they wanted) 🏅 Top Ecommerce Category: Online clothes retailers 🏅 Rising Star of the Month: Online sports retailers Top UK ecommerce companies list Are you curious to know who our winners are for July 2024? Drumroll, please…. Here’s a sneak peek at the top 15 UK ecommerce companies for July 2024 (but you can download the full list of 100 websites below): # Domain Monthly Visits HQ country 1 amazon.co.uk 343,023,431 United States 2 ebay.co.uk 184,697,529 United States 3 argos.co.uk 38,909,327 United Kingdom 4 etsy.com 37,379,312 United States 5 next.co.uk 28,908,794 United Kingdom 6 hotukdeals.com 28,340,117 Ecuador 7 temu.com 27,271,636 United States 8 tesco.com 25,972,063 United Kingdom 9 boots.com 23,754,025 United Kingdom 10 sainsburys.co.uk 23,686,211 United Kingdom 11 marksandspencer.com 23,422,953 United Kingdom 12 screwfix.com 23,037,272 United Kingdom 13 samsung.com 22,481,827 Korea, Republic of 14 johnlewis.com 21,387,957 United Kingdom 15 shein.co.uk 21,026,234 Singapore The criteria used to create this top 50 list of UK ecommerce companies (so you can do it too with Similarweb Sales Intelligence) were: Geography: United Kingdom Website Type: Ecommerce Website Technologies: Only sites with Ecommerce technologies Ranked by monthly desktop & mobile visits in July 2024 Download the full list here: A deeper dive at the top 5 UK ecommerce companies The top 15 sneak peek might have satisfied your curiosity for now, but if you’re like us, you’re eager to know “why” these companies are leading. That’s where Similarweb Sales Intelligence comes in. Let’s dive deeper into the top 5 ecommerce sites to see it in action: 1. Amazon.co.uk It’s no surprise that Amazon.co.uk holds the number one spot—would you expect anything else? Let’s see where the giant stands in July. Amazon reached 343.0M total visits, which is a +9.55% Month-over-Month (MoM) increase. However, it’s interesting to note it had a -4.75% Year-over-Year (YoY) change. Amazon has nearly doubled the number of visits compared to eBay.co.uk (which holds the second spot on our list). Focusing on Amazon’s web traffic and engagement, we see positive changes in bounce rates: a 0.41% improvement on mobile devices and a 2.94% improvement on desktop devices. While there’s a direct correlation between this improvement and Prime Day (with customers browsing more pages and building their carts for the big sale), it’s worth monitoring in the coming months for further opportunities. In terms of traffic sources, direct traffic led with 59.63%. The runner-ups were organic search at 25.93% and paid search at 7.23%. Amazon.co.uk is ecommerce 👑 royalty – they hardly need to invest in search because they have such a strong household name. But for other ecommerce sites aiming to follow in Amazon’s footsteps, it’s worth investing more in their SEO strategy. So, when consumers weren’t going directly to Amazon.co.uk, what were they searching for that led them there? The short answer: entertainment. The longer answer lies in these 15 most popular non-branded organic keywords for July: prime video prime prime day the boys kindle seller central prime video uk prime day 2024 seller central uk prime video | watch movies, tv shows, live tv, and sports the boys season 4 kindle cloud reader kindle store amazonassociates send to kindle uk Amazon Prime Video and Amazon Kindle-related search terms made up 67% of the top 15. Unsurprisingly, the keyword with the most significant change was “prime day,” with an impressive 3,946.39% MoM increase, directly linked to Prime Day 2024 on July 16-17. However, one of the more intriguing keywords is “the boys” with 48.8K monthly visits. The Boys is a show about a group of vigilantes out to take down corrupt superheroes who have abused their powers. It’s almost like the superheroes have become villains, and a new set of good guys has emerged. We’ve enjoyed the show — are you ready to add it to your watch list? 2. eBay.co.uk eBay’s bread and butter is its auction-based platform, and while they’ve leaned more towards fixed-price listings like Amazon, they’ll never abandon auctions. Would you bet on ebay.co.uk securing the second spot on this list for July? We certainly would. In July, the auction site hit 184.6M total visits! eBay saw a +3.9% MoM increase, but their -9.99% YoY decrease is a bit unexpected. The YoY drop could be attributed to the competitors’ rise in traffic. We noticed decreases in direct visits, organic traffic, and referral traffic for ebay.co.uk. On a positive note, page views on desktop (up 5.1%) and mobile (up 2.9%) showed increases. This made us curious about whether pages per visit also saw a rise. While desktop did see an increase, we were surprised to find that mobile had a slight decrease (-0.03%). This could suggest that the pages viewed on mobile devices weren’t as user-friendly as those on desktop, contributing to the slight decline. Most of ebay’s July traffic came from direct visits (63.54%), followed by organic search (25.95%), and then paid search (4.59%). eBay has become so well-known that it barely needs to invest in SEO anymore. When people think of auctions or getting products at lower prices, they instinctively go straight to eBay. This strategy seems to have worked well over the years. Perhaps other sites will follow suit in the near future. Let’s see! What drove UK shoppers to ebay.co.uk? The answer: some intriguing searches. Or, to be precise, here are eBay’s 15 most popular non-branded organic keywords for July: homely_haven spider-man 3 ictv 35 mm terapeak BMW e30 70s dagger collar blouse women’s angela anaconda vhs dj tv man corrupted cameraman saucony shadow 6000 size 12 cancel bid casio oceanus ocw-s100-1ajf opaque wood finish products vintage ufc shirt 39157471 sesshomaru x inuyasha Is retro fashion the new modern trend? The keyword with the most significant change was “70s dagger collar blouse women’s,” with an increase of 236.24%. Following this long-tail keyword closely, “vintage ufc shirt” saw the next highest increase at 234.93%. It looks like vintage clothing is making a comeback in the fashion world. How would you style these shirts? We’d pair them with classic straight jeans and a pair of Samba shoes. 3. Argos.co.uk Argos.co.uk is next on our list, with 38.90M total visits in July. Did you know the site was established in 1972 and named after the Greek city of Argos? Pretty cool, right? The site saw a +9.21% MoM increase and a -13.42% YoY decrease. The YoY decrease could be linked to seasonality, as Argos and its key competitors have also experienced a similar trend. We were curious about what happened over the past year for Argos, so we checked the sales signals and found that the site had several new launches, including a Halloween Shop, Apple Watch Ultra, and a range of SIM-free phones. When it comes to Argos’s web traffic and engagement, we focused on visit duration. Both desktop and mobile saw increases of 2.29% and 1.66%, respectively. We then looked at the rest of the metrics, and, unsurprisingly, everything was in the green. Argos, keep up the great work – it’s paying off! Unlike our top two contenders, who received the most visits from direct traffic, argos.co.uk saw the most traffic from organic search (40.51%), followed by direct traffic (38.94%). The next biggest traffic driver was paid search, accounting for 13.88%. Despite being one of the top five eCommerce sites, Argos continues to find significant value in effective SEO strategies. So, what brought such high clicks to Argos.co.uk? Here are Argos’s 15 most popular non-branded organic UK keywords for July: ps5 controller ps5 office chair sofa bed treadmill fridge freezer gaming laptop microwave fan ipad shoe rack dyson fan tv ps4 controller fridge 33% of the top 15 keywords are related to household items (office chair, sofa bed, treadmill), while 20% are kitchen-related (fridge freezer, microwave, fridge). It seems that many people were sprucing up their homes. If we had the chance, we’d remodel our office room too! 4. Etsy.com Etsy.com is the go-to site for finding the perfect handmade gift, vintage or on-trend clothes, unique jewelry, and anything else your heart desires. The ecommerce site had 37.37M total visits in July, reflecting a +2.08% MoM increase and a -9.24% YoY decrease. In such a highly competitive landscape, the YoY drop might be driven by online consumers flocking to AliExpress, which saw a YoY increase and offers lower prices for mass-produced goods. Moving on to Etsy’s Traffic and Engagement metrics, we see that bounce rates improved on both desktop (5.81%) and mobile devices (3.71%), indicating high user stickiness. After further analysis, we discovered that Etsy ran targeted marketing campaigns that attracted more relevant visitors to the site, leading to longer site engagement and a reduced bounce rate. The main traffic source for etsy.com was direct, contributing 49.44%, followed by organic search at 30.25% and paid search at 11.04%. Social media also brought in 6.61% of visits. When it comes to direct traffic, mobile (49.08%) and desktop (50.92%) brought in nearly the same amount of visits. Etsy is a unique site, known as a platform where small businesses can earn income and expand their reach globally. Consumers can find just about anything within reason, which likely explains why direct traffic is so high – everyone knows Etsy. Here are Etsy’s 15 most popular non-branded organic UK keywords for July… esy taylor swift eras tour poster 70s dagger collar blouse women’s mental health coping skills diagram sparkle digital planners preppy logo designs birth flower drawings ety buy gold bar gold zeus esty tote bag sjbcrafts Florida highway patrol seal vector euros 2024 new jersey state police badge new jersey state police badge vector Within this set of keywords, we again see within the top 10 the phrase “70s dagger collar blouse women’s,” indicating a strong interest among women in adding this retro style to their wardrobes – as it’s a top keyword also on ebay.co.uk. It’s also no surprise that “taylor swift eras tour poster” holds the second spot, given that Taylor Swift’s Eras Tour is currently making its way around the world. 5. Next.co.uk The final spot on our top 5 list goes next.co.uk. It’s the destination for all the latest women’s, men’s, and children’s fashion, beauty products, homeware, and much more. The UK-based ecommerce site had 28.90M total visits in July. Next also saw a 3.69% MoM increase but experienced a 12.6% YoY decrease. As we examined next.co.uk’s sales signals, we noticed that over the last year, the site has partnered with Biscuiteers Baking Company, acquired Fat Face Ltd, hired a new executive director, and appointed a new CFO—it looks like a lot of new things – and a lot of potential growth – are on the horizon. However, this could also create a sense of uncertainty for consumers. The Traffic and Engagement metrics for Next’s July performance are showing overall growth. When we looked at page views, we saw a significant jump of 27% on desktop and 3.63% on mobile. That’s the biggest increase compared to the other top four ecommerce sites on our list! The sites aiming to break into the top 5 could learn a thing or two from next.co.uk. The channel contributing the most to next.co.uk’s July traffic was direct, accounting for around 45.39%, followed by organic search at 39.76%. The site’s user-friendly interface makes it easy for consumers to explore from their mobile devices. Whether at home, on the way to work, or at the gym, consumers can effortlessly build a shopping cart for their next shopping spree. What were consumers organically searching for that led them to next.co.uk? Primarily clothes and furniture. Here are Next’s 15 most popular non-branded organic UK keywords for July… laura ashley lipsy lipsy london curtains dining chairs dining table jobs near me cargo shorts wedding guest dresses mens jackets suit linen trousers men swim shorts cath kidston birkenstock 40% of the top 15 keywords in this dataset are related to clothing articles (“cargo shorts,” “wedding guest dresses,” “men’s jackets”). Meanwhile, 33% of the searches are for specific brands (“lipsy,” “cath kidston,” “laura ashley,” “pour moi”). Since next.co.uk owns the brands listed among the top keywords, we wonder which company might be next on their acquisition list. Top UK fastest-growing ecommerce companies list Ready to uncover our July 2024 winning up-and-comers? Here’s a quick intro to the top 100 list with the top 15 UK ecommerce companies: Rank Domain MoM Change Monthly Visits HQ country 1 michaelkors.co.uk 73.74% 1,152,905 United Kingdom 2 beaverbrooks.co.uk 52.98% 1,161,095 United Kingdom 3 joebrowns.co.uk 41.50% 1,011,367 United Kingdom 4 cotswoldoutdoor.com 39.10% 1,496,593 United Kingdom 5 levi.com 37.31% 1,365,330 United States 6 spacenk.com 30.60% 1,677,759 United Kingdom 7 thenorthface.co.uk 30.35% 1,597,020 United Kingdom 8 newbalance.co.uk 30.08% 3,513,358 United Kingdom 9 getthelabel.com 29.76% 1,147,264 United Kingdom 10 drmartens.com 28.96% 1,208,943 United States 11 sephora.co.uk 28.24% 2,775,710 United Kingdom 12 millets.co.uk 27.94% 1,203,730 United Kingdom 13 hsamuel.co.uk 26.04% 1,951,990 United Kingdom 14 samsung.com 25.40% 22,481,827 India 15 stylevana.com 25.39% 1,249,790 United States The criteria we used to create this list (so you can do it too, with Similarweb Sales Intelligence): Geography: United Kingdom Website Type: Ecommerce Website Technologies: Only sites with Ecommerce technologies Monthly Visits: Over 1 million Ranked by monthly visits increase, June 2024 vs July 2024 Download the full list here: A deeper dive into the top 5 fastest-growing UK ecommerce companies Here’s what we really found out about these up-and-comers using Similarweb Sales Intelligence: 1. Michaelkors.co.uk Michael Kors is the go-to destination for jet-set luxury, as they say. In July, the fashion site had 1.152M total visits. They experienced a +73.74% MoM increase but a -14.84% YoY decrease, which is likely attributed to fluctuations in paid search. Looking at Michael Kors’s Traffic and Engagement performance, visit duration improved on desktop by 0.82% and on mobile by 12.41%. With visit duration increasing, one might expect improvements in bounce rate, as users spend more time on the site. However, the bounce rate actually saw slight declines on desktop by 0.13% and on mobile by 1.98%. This suggests the site could benefit from optimizing its marketing efforts to attract visitors who are more likely to stay engaged—or perhaps take a page from Etsy’s campaign playbook. The largest contributors to michaelkors.co.uk’s July traffic were direct (41.62%), paid search (40.99%), and social (9.41%). Referrals also brought in 3.75%. With a nice stream of traffic coming in from social media, we wanted to investigate this a bit more. We noticed that 48.74% came from Facebook, 25.2% came from Reddit, and 18.85% came from YouTube. With a successful strategy here – it’s always worth reviving campaigns here to reach your target audience. Were you, too, curious as to what brought visitors to michaelkors.co.uk? Here are Michael Kors’ most popular organic UK keywords for July: kors micahel kors shoulder bag mini camille pave hand bags women large crossgrain leather smartphone wristlet mk t shirts women’s handbag mickeal kors discounts watches for women flap backpack in price range £1000 hand bag women sale handbag tota bag purse racer jacket men The keyword that saw the largest MoM change was “watches for women,” with a 218.75% increase, indicating a growing interest in this category. If you also sell watches, particularly for women, it might be worth ramping up your marketing efforts – and finding review sites and affiliates in the fashion space – in order to capitalize on this trend. 2. Beaverbrooks.co.uk Beaverbrooks is a luxury jewelry provider in the UK that was established in 1919. In July, the site had 1.161M total visits, a 52.98% MoM increase. We wondered if fewer visitors to the site would negatively impact Traffic and Engagement for Beaverbrooks. To our surprise, we noticed page views trending upwards on both desktop (33.07%) and mobile (106.38%). Americangolf.co.uk’s July performance is a 24.31% YoY and a 53.49% MoM change. And the site’s Traffic & Engagement performance is also on the rise! Metrics to watch for americangolf.co.uk include Visit Duration on Desktop (00:04:56, up 28.37% MoM), Pages Per Visit on Desktop (7.04, up 9.94%), and Bounce Rate on Desktop (32.43%, up 6.41%). And of course, Page Views (see image) Although organic search (33.26%) was the largest contributor to Beaverbrooks’s traffic, followed by direct (31.95%) and paid search (22.89%), direct traffic showed the largest growth compared to the previous month (+74%). This suggests that the fast-growing fashion brand has built a strong reputation. So, while overall YoY traffic may be lower, those visiting the site are engaging more because they are familiar with (and trust) the brand. Given that organic search brought in the most traffic, let’s take a look at Beaverbrooks’ top 15 organic searches for July… engagement rings jewellery mens jewellery mens wedding rings skeleton watches gold watches for men ring size 8 cm circumference bracelet watches sale sale watches watch sale bracelets for women silver necjlaces black diamond pearl necklace uk Among the top 15 keywords, 46% of the searches include the word “ring.” So, although it’s not proposal season just yet, visitors are starting to prepare for that big diamond purchase for their significant other. 3. Joebrowns.co.uk Joebrowns.co.uk, an apparel and homeware site, saw impressive growth in July with 1.011M visits—a +41.5% MoM and +3.89% YoY increase. This uptick suggests early preparations for the holiday season. In terms of Joe Browns’ web traffic and engagement, page views per visit rose on desktop (+13.65%) and mobile (+2.89%). However, while mobile visit duration increased by 11.05%, desktop duration fell by 6.79%. This indicates a need for desktop site optimization to enhance user experience. Direct traffic was the largest source in July, accounting for 40.44% of visits, followed by paid search, which was exceptionally high at 24.68%, and organic search (19.30%). Let’s dive a bit deeper into which keywords the site targeted in their paid search efforts as they outperformed their competitors… joe brown sale shoes joe brown sale uk half-sleeve sexy red ladies blouses nydj high waist denim pencil skirt, optic white tankini blue turquoise joe brownsknotted italian suede hobo bag men shirts uk coloured pin stripe linen suit with waistcoat crochet jumpers mens purple and black jumper joe brown suede hobo bag men’s long brown coats womens flared pants 80s shirts colourful cardigans for women Joe Browns is capitalizing on seasonal items like “tankini blue turquoise” and trendy pieces like the “coloured pin stripe linen suit with waistcoat.” Notably, “women’s flared pants 80s” suggests that 80’s fashion could make a comeback this fall—perhaps paired with a 70’s dagger-collared blouse. 4. Cotswoldoutdoor.com Cotswoldoutdoor.com secured the final spot on the list of the fastest-growing UK eCommerce sites, with 1.075M total visits in July, reflecting a +39.1% MoM increase and a -6.37% YoY decrease. The YoY drop can be attributed to seasonality, as consumers typically spend less on outdoor supplies by July. Despite the seasonal impact, Cotswold Outdoor’s traffic shows that users are still exploring it. Visit duration increased significantly – 26.42% on desktop and 47.31% on mobile – indicating that shoppers are already in holiday season mode. Organic search was the top traffic source, accounting for 56.79% of visits, followed by direct traffic at 29.95% and paid search at 7.23%. With half of the traffic coming from organic search, other companies could learn from Cotswold Outdoor’s effective SEO strategy. So, what organic keywords drove traffic to cotswoldoutdoor.com? The short answer: anything related to the outdoors. Here are the top 15 searches in July… outdoor and cycle concepts outdoor and cycle concepts ltd fjallraven arcteryx craghoppers heat regulating travel sock hydroflask uk camping duffel bag north face fleece two person backpacking tent hiking trousers outdoor shop cotswolds outdoors near me patagonia houdini mens v12 outdoor the north face women aphrodite 2.0 trousers scarpa walking shoes The keyword with the largest MoM change was “camping duffel bag,” which saw an 829.95% increase. We’re curious about what users are packing in those bags, as they might not be the most comfortable choice for hiking. 5. Levi.com The final spot on our top UK fastest-growing list goes to the iconic Levi.com. Levi’s web traffic showed 1.365M visits in July – a 37.31% MoM increase and a 5.98% YoY rise. This growth can be attributed to several strategic moves over the past year, including adding a new member to it’s Board of Directors, partnering with Anthropic Limited, and opening new regional offices in Asia and Canada. In terms of Traffic and Engagement, page views increased significantly on both desktop (56.39%) and mobile (13.81%). Levi’s appears to have optimized its desktop site, leading to a notable uptick in desktop visits in July, reversing the trend of mobile dominance over the past five months. While mobile is crucial for ecommerce, maintaining a strong desktop experience remains vital. Unsurprisingly, in light of its brand recognition, direct traffic was the leading traffic source, accounting for 41.88% of visits, followed by organic search (24.86%) and paid search (21.45%). Social media contributed 8.03%, showing that Levi’s is a well-established household name that attracts visitors naturally. Focusing on Levi.com’s social media traffic (on desktop), we observed steady growth from February to July. Most of their campaigns targeted Facebook, which drove 42.17% of the traffic, followed by YouTube at 22.86%. This is a strategy that other retailers might consider adopting. Go beyond the top 50 We’ve covered the top UK ecommerce companies and the fastest-growing UK ecommerce companies — but what does all this have to do with you and your sales team? At Similarweb, we understand how vital data is to every part of your sales cycle. Some of our game-changing features for B2B sales teams include: Lead Generator: Filter our database of 20.4+ million online businesses to create a list of your ideal prospects Insights Generator: Create effective outreach based on solving your prospect’s specific pain points and areas of opportunity Contacts: Reach key decision-makers with 370M+ contacts at the click of a button Account Review: Full insight into each account, including performance and technologies Sales Signals: Spot hot new leads, find upsell and cross-sell opportunities, and reduce churn with account alerts Traffic Checker: Reveal the most accurate, up-to-date traffic & engagement data to analyze your competitors’ performance and strategies If you’re itching to pull ecommerce insights like these in seconds — and we think you should be — book a demo here to see how Similarweb Sales Intelligence can help you uncover your ideal prospects, their tech setups, marketing strategies, keywords, and most pressing pain points. FAQs Which is the biggest ecommerce company in the UK? Amazon.co.uk remains the top ecommerce company in the UK, with 343.0M total visits in July 2024. Amazon is followed by ebay.co.uk, with 184.6M total website visits. How big is the UK ecommerce market? Despite its small geographic size, the United Kingdom is the seventh largest market for ecommerce, following the United States, Japan, Russia, Republic of Korea, Brazil, and Germany. by Keren Feldsher Senior Content Marketing Manager Keren is a content marketing expert with 7+ years of experience. A New Yorker with a B.Sc. in English Literature, she enjoys true crime podcasts and brunch. Sources Related Topics: Selling to Ecommerce This post is subject to Similarweb legal notices and disclaimers. Related Posts Sales Intelligence Top Ecommerce Companies in the USA: 100 Brands to Watch Right Now B2B Sales Selling to Ecommerce by Keren Feldsher 13 Min. Jul 25, 2024 Sales Intelligence Top Ecommerce Companies (and Top Fastest-Growing Companies) – The Global List Selling to Ecommerce by Keren Feldsher 16 Min. Jun 30, 2024 Sales Intelligence Lead Nurturing: The End-All Guide (Tools, Tactics, and Q&A) Consultative Selling Prospecting by Josh Rod 8 Min. Jan 6, 2022 Sales Intelligence Why Contacts Plus Context Is the Killer Combo for 2022 B2B Sales Consultative Selling by Robin Morley 3 Min. Dec 6, 2021 Ecommerce Intelligence Amazon vs. Walmart: The Race to the Top Amazon Insights Retail Insights by Emily Hunt 7 Min. Aug 23, 2021 Sales Intelligence Selling to the eCommerce Industry? Here’s How to Close More Deals Selling to Ecommerce by Josh Rod 7 Min. Jan 17, 2021 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Top 100 UK Ecommerce Companies: Powerhouses and Challengers"
    },
    {
      "level": "H2",
      "text": "Top UK ecommerce companies list"
    },
    {
      "level": "H2",
      "text": "A deeper dive at the top 5 UK ecommerce companies"
    },
    {
      "level": "H3",
      "text": "1. Amazon.co.uk"
    },
    {
      "level": "H3",
      "text": "2. eBay.co.uk"
    },
    {
      "level": "H3",
      "text": "3. Argos.co.uk"
    },
    {
      "level": "H3",
      "text": "4. Etsy.com"
    },
    {
      "level": "H3",
      "text": "5. Next.co.uk"
    },
    {
      "level": "H2",
      "text": "Top UK fastest-growing ecommerce companies list"
    },
    {
      "level": "H2",
      "text": "A deeper dive into the top 5 fastest-growing UK ecommerce companies"
    },
    {
      "level": "H3",
      "text": "1. Michaelkors.co.uk"
    },
    {
      "level": "H3",
      "text": "2. Beaverbrooks.co.uk"
    },
    {
      "level": "H3",
      "text": "3. Joebrowns.co.uk"
    },
    {
      "level": "H3",
      "text": "4. Cotswoldoutdoor.com"
    },
    {
      "level": "H3",
      "text": "5. Levi.com"
    },
    {
      "level": "H2",
      "text": "Go beyond the top 50"
    },
    {
      "level": "H2",
      "text": "FAQs"
    },
    {
      "level": "H3",
      "text": "Top Ecommerce Companies in the USA: 100 Brands to Watch Right Now"
    },
    {
      "level": "H3",
      "text": "Top Ecommerce Companies (and Top Fastest-Growing Companies) – The Global List"
    },
    {
      "level": "H3",
      "text": "Lead Nurturing: The End-All Guide (Tools, Tactics, and Q&A)"
    },
    {
      "level": "H3",
      "text": "Why Contacts Plus Context Is the Killer Combo for 2022"
    },
    {
      "level": "H3",
      "text": "Amazon vs. Walmart: The Race to the Top"
    },
    {
      "level": "H3",
      "text": "Selling to the eCommerce Industry? Here’s How to Close More Deals"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Keren Feldsher"
}