{
  "url": "https://www.similarweb.com/blog/marketing/affiliate-marketing/cj-affiliate/",
  "slug": "cj-affiliate",
  "title": "Is Affiliate Marketing Dying? | Similarweb",
  "description": "Every season brings a new crop of think pieces asking whether affiliate marketing is dying or not. For more details, enter now and learn more.",
  "content": "HomeBlogMarketingAffiliate MarketingIs Affiliate Marketing Dying? - Spotlight on CJ Affiliate Marketing Intelligence Is Affiliate Marketing Dying? – Spotlight on CJ Affiliate Start your free trial by Similarweb 2 Min. May 24, 2019 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic There are always concerns that tech changes will negatively impact the ability of digital marketers to do their jobs Analyzing one of the biggest affiliate marketing networks reveals much about the current state of play Every season brings a new crop of think pieces asking whether affiliate marketing is dying or not. There are almost as many of these kinds of posts as there are instructional videos explaining to you how to get started with affiliate marketing! There are many different opinions about why affiliate marketing may be dying. Some blame chatbots, while others credit the rise of influencer marketing, noting how this is bringing fundamental changes to the entire model. Perhaps the biggest challenge to the main model of affiliate marketing is Google’s recent announcement that it will be cracking down on third-party cookies. Third-party cookies in browsers are key for affiliate marketing as they track transactions so that publishers get the credit for referring a sale that occurs within a particular time frame. Read More: 4 Tips to Conquer a Cookieless Future CJ Affiliate Performance Over Time CJ Affiliate, formerly Commission Junction, is one of the most popular and most visited affiliate marketing networks in the US. It attracts both advertisers and publishers and matches them up. Their website, cj.com averages 625K visits per month over the past 12 months with some variation from month to month. Over 64% of traffic to cj.com comes from desktop. In terms of engagement, visits to the site lasted 5 minutes and 32 seconds and took in 5.4 pages per visit. This indicates a highly engaged audience. This is further backed up when you look at the subdomains within the site that received the lion’s share of visits. Over 51% of all pages visited at cj.com were in the subdomain members.cj.com. This shows that over half of all pages seen at the site were viewed by members logged in to their accounts whether as advertisers or publishers. Traffic to cj.com between May 2018 and April 2019 was up 3.4% over the previous 12 months with most of that increase coming from the first four months of 2019, indicating a healthy positive trajectory for the network. Traffic Sources to CJ Affiliate Looking at the sources of traffic to cj.com tells another positive story about the site’s standing in the market and prospects moving forwards. Three-quarters of the site’s traffic arrives directly to cj.com. A further 88% of search traffic to the site is branded. These stats indicate a site that is well known to its users and that is not reliant on expensive paid campaigns to drive user acquisition. Summary While there may be plenty of column inches in the death of affiliate marketing, there seems to be no sign that one of the biggest players in this space is slowing down. Smart digital marketers will continue to adapt to changes to the ways they are able to market and maintain their position moving forwards. by Similarweb Related Topics: Affiliate Marketing This post is subject to Similarweb legal notices and disclaimers. Related Posts Marketing Intelligence How to Find Your Competitors’ Affiliates Affiliate Marketing by Monique Ellis 9 Min. Jan 31, 2024 Marketing Intelligence How to Check Website Traffic: Analyzing the Digital Data Ad Intelligence Affiliate Marketing by Limor Barenholtz 14 Min. Jan 17, 2024 Marketing Intelligence Mind The Gap: A Complete Guide to Traffic Gap Analysis (+ Checklist) Ad Intelligence Affiliate Marketing by Monique Ellis 15 Min. Oct 27, 2023 Marketing Intelligence The Best Affiliate Marketing Tools in 2023 Affiliate Marketing by Georgia Brisco 10 Min. May 11, 2023 Marketing Intelligence 5 Proven Affiliate Program Management Tips For Brands Affiliate Marketing by Sarah Mehlman 7 Min. Sep 22, 2022 Marketing Intelligence How to Succeed in Affiliate Marketing: 10 Pro Tips for Getting Started Affiliate Marketing by Sarah Mehlman 6 Min. Sep 18, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Is Affiliate Marketing Dying? – Spotlight on CJ Affiliate"
    },
    {
      "level": "H2",
      "text": "CJ Affiliate Performance Over Time"
    },
    {
      "level": "H2",
      "text": "Traffic Sources to CJ Affiliate"
    },
    {
      "level": "H3",
      "text": "Summary"
    },
    {
      "level": "H3",
      "text": "How to Find Your Competitors’ Affiliates"
    },
    {
      "level": "H3",
      "text": "How to Check Website Traffic: Analyzing the Digital Data"
    },
    {
      "level": "H3",
      "text": "Mind The Gap: A Complete Guide to Traffic Gap Analysis (+ Checklist)"
    },
    {
      "level": "H3",
      "text": "The Best Affiliate Marketing Tools in 2023"
    },
    {
      "level": "H3",
      "text": "5 Proven Affiliate Program Management Tips For Brands"
    },
    {
      "level": "H3",
      "text": "How to Succeed in Affiliate Marketing: 10 Pro Tips for Getting Started"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Similarweb"
}