{
  "url": "https://www.similarweb.com/blog/marketing/marketing-strategy/competitive-analysis/",
  "slug": "competitive-analysis",
  "title": "Competitive Analysis: Your complete Guide | Similarweb",
  "description": "Your Competitive Analysis guide is here. Discover how to understand your market and build a winning marketing strategy that increases your market share.",
  "content": "HomeBlogMarketingMarketing StrategyHow to Do a Competitive Analysis: A Complete Guide Marketing Intelligence How to Do a Competitive Analysis: A Complete Guide Start analyzing your competitors by Limor Barenholtz , Director of SEO at Similarweb 18 Min. January 29, 2024 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Digitization has profoundly altered competitive markets. With increased connectivity, industries have experienced exponential growth. And, with the web at our fingertips, customer expectations are higher than ever. To succeed in these competitive markets, you must have a deep understanding of your competitive landscape. This will provide insights into: How the most successful businesses serve your prospects What works in your digital space and what doesn’t Gaps in the market you can take advantage of Competitor analysis is a powerful way to help you increase your market share in any market. In this post, I’ll give you a top-down approach to how to perform a competitor analysis. This big-picture overview is structured from the biggest fundamental aspects of your competitors down to the more granular tactical aspects. Discover how to do a competitive analysis, repeat the process regularly, and look forward to seizing opportunities by making actionable decisions that elevate your growth. What is competitive analysis? A competitive analysis is the process of finding and evaluating your market and competitors’ marketing strategies to identify their strengths and weaknesses and find new untapped opportunities. It involves gathering data on your competitors’ products, pricing, marketing strategies, and overall performance to make informed business decisions and gain a competitive edge. Why is competitor analysis crucial in market research? Business is inherently competitive, and your marketing strategies don’t exist in isolation. And be assured your competitors aren’t likely to give up a piece of the pie without a fight. So, how do you increase your market share? The key is to understand what made them successful in the first place. This means analyzing your competitors’ products and marketing strategies. The more thoroughly you understand their business, the better you’ll understand their strengths and weaknesses. You can then evaluate, based on your current business, if you should beat them at their own game or find an uncompetitive sub-niche or micro-consumer demand to play in. This is true whether you are launching a product in a new market or pursuing growth of any kind. You need a razor-sharp understanding of your competitors. Build winning marketing strategies Find gaps in your competitors' marketing strategies and hidden opportunities with our competitor analysis tools. Go to Similarweb The key benefits of competitive analysis Now that you understand why you need competitive analysis, here are some of the benefits you can expect. 1. Build smarter business strategies It never pays to reinvent the wheel. Almost any industry has tried and tested methods, and when you take a deep dive into competitor strategies and tactics, you’ll find things that you can replicate in your own space. Competitor research can impact your big-picture strategy as well as the marketing tactics you are employing to make your strategy happen. 2. Understand your target audience better Your competitors might be serving your target audience in ways you never thought possible. Looking at their products and services will not only help you to think of product ideas it’ll give you insight into what your prospects really need. The better you understand your audience, the more likely you are to serve their needs. 3. Surface competitor weak points Analyzing your competitors’ marketing strategies will help you find their weaknesses. This could be on a marketing or product level. And the better you understand their weaknesses, the more leverage you have to win market share. 4. Make informed, data-based decisions Running a business without data and analysis is like flying blind. With competitor research, you’ll be able to easily size up your competitive landscape and build a strategy that takes both your competitors and your target audience into consideration. How to do competitor analysis in 8 easy steps The first stop on the competitor research train is collecting and analyzing information about your competitors to understand what you’re up against. A methodical approach lets you understand how the different areas impact each other. You can divide your competitor research into four main areas of competition: Company: Information about company size, location, business info, and more Customer: Demographics, preferences, and characteristics of the target audience Product and pricing: Product-related data such as features, offers, or if they have a mobile app Marketing: Strategic approach, SEO tools, use of channels, and marketing campaigns In this section, we’ll show you how to analyze your competitors systematically. We’ll start off with the big-picture metrics and slowly work our way down to the specific tactical approaches your competitors are taking to achieve the results they are getting. We’ll be using a combination of data from competitor analysis tools and traditional market analysis methods. 1. Identify your competitors I always start by mapping out the companies that offer a product or service in the same category as mine. Next, I prepare a list of competitors and categorize them into different levels, using these three factors: The audience each one targets The problem they solve The products they offer When you approach this task, keep in mind there are two types of competitors: direct and indirect. Your main competitors are direct, for example, businesses that are identical to you in all three areas: They have the same target audience, offer a solution for the same problem, and are in the same product category. For example, if you sell orthopedic shoes for kids, you’ll want to look for other ecommerce sites or brands on retail sites with similar products and qualities that you want consumers to associate with your brand. The second category of competitors is indirect – that is, companies that are identical in only two of the three areas. They could be targeting the same audience and offering a solution for the same problem but with an entirely different product. Someone offering a surgical procedure to correct the same issue as your orthopedic footwear would be a good example of an indirect competitor. Focus on the direct competition, but keep data on indirect competitors as well; they may become more significant over time. Especially in the growing business-to-business (B2B) landscape, companies are always venturing into new sectors outside their original industries. Indirect competitors may pivot at any point and could introduce something like a new app to their offering seemingly overnight. The first step in finding who your competitors are is everyone’s favorite search engine. Start by Googling your keywords Possibly the most difficult process to master is finding your competitors. Start by searching for common keywords in Google and see what comes up or find search ads that target keywords that are relevant to your business. Search specifically for competitive queries. For example, below, we’ve Googled the query Apple competitors. Google will help you find competitors, but it is limited. Speak to your sales team One of your most accessible resources is your sales team. It really pays to take the time to speak to them, and they’ll give you countless insights if you just take the time. The reason is they literally speak to your customers directly, and they’ve likely heard which competitors your customers are using. Get feedback from your customers Although slightly less available than your sales team, speaking directly to your customers is your most valuable information. Simply ask them which competitors they considered before making a purchase. Use a competitor analysis tool Using a data-driven approach with a competitor analysis tool is my favorite method, and I find it far more efficient than any other method. The main advantage of using data is it’s scalable. But your data is only valuable if you can filter it to find relevant results. Let me demonstrate what this might look like. Let’s analyze foodinsight.org using Similarweb’s Website Performance tool. We’ll first look at the Similar Sites report. This is the ultimate competitor discovery power tool. The reason is it’s based on multiple data points including: Content Audience Keywords Referrals By using multiple data points, you are more likely to find closely related competitors. As you can see in the example above, the tool brings a number of clear competitors for the site I analyzed. If you find that the sites it brings are not relevant to your market, you can easily filter the results with the industry filter. Once you’ve done that, take a look at the competitors you’ve found to ensure that they are indeed direct competitors. Again, a direct competitor serves the same audience as you do, solves the same problem, and with the same products or services. At this stage, you should have a list of sites that share similar metrics in general. Let’s now get a little more granular and focus on Organic competitors and Paid Media competitors. Find your organic competitors Organic competitors are not always direct competitors, as an organic competitor is a site that targets similar keywords to your site. And you’ll find that sites in more than one industry often target the same keywords. This means you should gather organic competitor data but ensure they are in a similar market to yours. To demonstrate, I’ve entered foodinsight.org into the Similarweb Organic Competitors report. This report considers sites to be organic competitors if they target similar keywords. Below, you can see organic competitors for foodinsight.org. Looking at the results, you’ll notice that the tool shows me websites from different industries. Although this might be useful if you are building an SEO strategy, we are now looking for direct or closely related competitors for this analysis and should filter the results to find the most relevant business competitors. Since foodinsight.org is a content publishing website in the Nutrition Diets and Fitness industry, below I have used the Industry filter and the Website type filter. Find your paid competitors You should also look at the sites that are using a paid ad search strategy that targets similar keywords to your site. Below, Similarweb is displaying a list of paid search competitors for foodinsight.org. Just like the Organic Competitors report, to find direct competitors, you must find sites that are in a similar industry to you. You can use the same filters as in the Organic Competitors report. This will help you find direct competitors that are running ads. You now know which competitors you want to target. What’s next? 2. Create a company overview After you’ve identified your main competitors, it’s time to gather background information on them. It’s best to analyze three to five companies per competitive set. Make sure your company overview includes the following: Basic information such as company size, location, employee count, and year established. Information like this is easily obtainable from national business registers, official government sites, and even social networks like LinkedIn. Add financial and business information, including stock value, owners, investors, acquisitions, and mergers. You can view a company’s financial statements or find information on business review sites like Dun & Bradstreet, Hover, etc. For startups and tech companies, check sites such as Indiegogo and Kickstarter. Next, define their market position and share, level of brand awareness, range of products, and delivery methods, such as whether they have a mobile app and product categories. I recommend regularly monitoring your market position, market share, and brand awareness by creating a Custom Industry in the Similarweb Market Intelligence addon. Set it up by adding your site and your competitors. This will show you how your site is performing within a market defined by you. For instance, if we look at the market for Food Insight and its competitors, we see that Food Insight owns 8.45% of the market while Diet Doctor is the market leader with 53.46%. Looking at the Market Quadrant Analysis in the Players report, we see that Diet Doctor is clearly the market leader in terms of brand strength, but with a high level of branded search traffic, Gaps Diet is showing up as a challenger brand. Food Insight is one of the weaker brands, displaying a small amount of branded search volume and direct traffic. To get deeper insight into these brands, let’s see how their audiences respond to their businesses by looking at Loyalty and Retention. With high levels of returning visitors and exclusive visitors, we see that Diet Doctor, Gaps Diet, and Eat Right are leading the market. Once you have company overviews for your competitors, your next step is to look at their web traffic and engagement metrics. If the company you are analyzing has many online entities, it may make sense to do a digital analysis of all of the assets together using the Similarweb Company Analysis tool. For instance, we noticed that Verizon owns three domains. Verizon.com Verizon.net Myverizon.com To get big-picture Traffic & Engagement metrics, we created a separate Verizon company asset that combines all three. Below, you can see the total number of Unique Visitors for all of the properties together over a six-month period. You can also see their Traffic & Engagement over time, including: Average monthly visits Page views Pages Per Visit Visit Duration Bounce Rate Once you have a basic company overview of your top competitors, your next step is to analyze how your company fits into your market in general. 3. Perform a SWOT analysis SWOT analysis is one of my go-to competitor analysis frameworks. It’s used to assess the internal Strengths (S) and Weaknesses (W) along with external Opportunities (O) and Threats (T) of your business and your competitors. It provides a concise framework for you to gauge your competitive landscape and make informed strategic decisions that take your market into account. By doing a SWOT analysis, you’ll understand the market forces and players that affect your business. You’ll discover where you are vulnerable and where your biggest opportunities lie. To get started, break out your whiteboard, call in your team, and start to brainstorm. Break your whiteboard down into four quadrants. Label them: Strengths (S) Weaknesses (W) Opportunities (O) Threats (T) Now, get your team together and brainstorm. Fill each quadrant with as many points as you can think of. We recommend starting with opportunities and threats. The reason is these are factors that are external to your business and will give you a general understanding of your competitive landscape. Once you’ve outlined the external factors, move on to your business’s strengths and weaknesses. Since you have first outlined your external factors, you are likely to find internal factors to address them. It’s important to point out at this stage that many of the points we cover in this blog will help you ferret out details that you can add to your SWOT analysis. For instance, performing a channel analysis on your competitor sites will often reveal some hidden opportunities as well. Granular competitive analysis Find gaps in your competitors' marketing strategies and hidden opportunities with our competitor analysis tools. Go to Similarweb 4. Research your competitors’ 4 P’s The 4 P’s is a competitor analysis framework, also called the marketing mix, that refers to the fundamental elements businesses use to develop and implement marketing strategies. The 4 Ps include: Product: This refers to the actual goods or services that you offer to meet your customers’ wants and needs. It involves decisions related to product design, features, branding, quality, and packaging. A successful product either fulfills a gap in the market or offers something unique. Price: Price is the amount of money customers are willing to pay for a product or service. Price should not be too high for your customers or be too low for you to make a profit. Pricing strategies consider factors such as production costs, competitor pricing, perceived value, and overall market conditions. Place: This refers to where people can buy your product. It includes distribution channels, logistics, inventory management, and the overall strategy for ensuring the product reaches your target market. Not every place is suitable for every product. For instance, you would never sell medical equipment for hospitals in a grocery store. Promotion: Promotion includes how your business informs your audience about your product so that they make a purchase. It includes advertising, public relations, sales promotions, personal selling, and other communication strategies. Timing is a crucial element in any marketing strategy, for example, promoting back-to-school products before the start of a school year. 5. Understand your competitor’s target audience So far, we’ve looked at your competitors directly. But to get a complete picture, you must examine your customers. Starting with big-picture metrics, you must first understand your audience demographics. This is crucial and affects every aspect of your marketing, including pricing, tone, and positioning. To understand geography and demographics, we must look at a competitor analysis tool, which we’ll demonstrate with the Audience tab in Similarweb’s Website Analysis tool. Looking at the Geography report, we can see the traffic share each competitor has in each country. Now, to our target audience demographics. Below, we see that foodinsight.org and its competitors’ audience tend to be primarily female. Looking at age metrics, their audience tends to be evenly distributed between 25 and 64. Want deeper insights? You can filter the results by gender and age. Now that we have demographic information, it’s time to see what interests our competitor’s audience. You can do that by simply going to their websites and looking at what appears in their content. You’ll be surprised by how much you find by doing this. What’s more, take a look at their social media content. Check the number of followers your competitors have and the level of their engagement rate. Also, research what types of posts are popular and how followers engage. Do they like, comment, share, or post themselves? Are there any influencers that sponsor them? Now, if you want to scale this up and see the topics your audience is interested in, use a data-driven approach. With the Similarweb Audience Interests report, you can see all the topics that appear in high density in the chosen domain. The report shows you topics that are connected to all industries and if you want to see audience interest topics that are specifically for your industry, use the Industry filter. Above, you can see the audience interest in hotpot.ai, which is specifically in the Graphics Multimedia and Web Design industry. At this point, you are just looking at audience interests at a high level. This analysis will give you a general idea of the topics and themes that drive web audiences in your industry. You should also take a look at situational analysis to understand what your audience expects in different scenarios. Investigate the factors that impact a customer’s state of mind, such as their knowledge, level of attention, and ability to process information. Read customer reviews How a company presents itself and its products is one thing, but how customers view the company is another thing entirely. To get an unbiased view of your competitors’ performance, try to look through the lens of a customer: Read customer reviews and evaluate how well the two match Browse the issues and questions raised by users to uncover potential weaknesses and see if and how the company answers comments from users Look for reviews in forums and groups on sites like G2 and Trustpilot to find feedback Evaluate the feedback on their mobile app — are there any missing features, or are there common areas of complaint? What do people love or hate about their app? Depending on the industry, there may be review sites that compare your competitors’ products. Keep in mind these are usually run by affiliates (who endorse products in exchange for commissions), and they have an interest in favoring one over another. However, they test products themselves and pin features against each other; therefore, you can get facts on the competitor that it isn’t keen on sharing. Here’s an example of a review website comparing between Dyson and Shark, two leading cordless vacuums: 6. Website competitor analysis You now have an overview of your competitors. You’ve assessed their place in the market and conducted an audience comparison. Now, let’s delve into their website performance to uncover: Which channels are performing well for your competitors Which sites are your strongest competitors Which sites you can compete with to quickly gain market share Let’s start with some digital data for the Similarweb Website Analysis report. Here, I’ve created a competitor analysis example for foodinsight.com together with its key competitors. Let’s take a look together: Looking at Traffic & Engagement metrics, we see that dietdoctor.com is getting substantially more traffic than its competitors, followed by ketocycle.diet. Now, traffic is a limited metric. Let’s qualify our findings with engagement metrics. Again, we see that dietdoctor.com is a clear winner in the Nutrition Diets and Fitness category. But, when we look at visits over time, dietdoctor.com shows an obvious downward trend. Let’s move over to Channels. Above, we can see that dietdoctor.com is winning in Organic Search and Direct traffic. Direct traffic indicates that they have better brand recognition than their competitors. Moving on to other channels, look how easy it is to spot that ketocycle.diet is investing heavily in advertising, and none of its competitors are competing in this space. This might be a big opportunity for you as this space is mostly untapped. Pro tip: Keep track of your competitors with a Competitive Tracker Once you know who your competitors are, I highly recommend tracking them over time with a Similarweb Competitive Tracker. This will give you a benchmark, a plan, and the ability to track your improvement vs your competitors. The Competitive Tracker enables you to track up to 25 competitors at a time and will help you understand their marketing performance. You can use it to see how your business fits into your market by comparing your site’s performance with your industry competitors. It will show you where your competitors are gaining or declining in traffic for every marketing channel. You can also see new ad creatives they have created and discover new trending terms and topics. What’s more, your tracker will highlight note-worthy insights across all of your metrics. After you’ve completed your competitor’s website analysis, the next step is to dig into keyword strategies. 7. Analyze your competitors’ keyword and content strategy At this stage, you have already seen your competitors’ big-picture strategic and tactical approach. It’s now time to go to the Similarweb Keywords report. Looking at keywords will help you understand how your competitors are showing up in search results. This could reveal both SEO strategies and PPC keywords that they are bidding on. Since you are looking at your competitive market, it makes sense to analyze your top competitors at the same time. This will merge all the keywords your top competitors are ranking for in one table. You can filter the data from there. Above, we noticed in the Channels report that competitors were investing in SEO. To understand their SEO strategies, we are looking at the non-branded keywords. If, on the other hand, we want to understand how a brand is performing in search, we could look exclusively at branded keywords. We currently have an overwhelming number of keywords in the table. To make sense of the data, I usually filter it by topic. For instance, since we are looking at sites that are focused on diet, we can start to look at diet plan keywords. This filter is powerful, as yes, these sites are organic competitors, but not all topics are relevant to your site. The filter will allow you to quickly see the topics your site is competing on. Another way to use this is to look at what topics other sites are competing on. You might find some that are relevant to your site that you never thought of. See your competitors’ best-performing content To understand what content is bringing your competitors their best results, look at their top-performing landing pages. Below, you can see the top-performing pages for foodinsight.com. The report shows you all the keywords the page is ranking on, as well as a trend graph so that you can see how each page is performing. 8. Analyze their lead generation strategies To get a better understanding of your competitor’s strategic approach, you’ll want to research their lead generation strategies. To do this, you need to put yourself into the shoes of their audience and actually take a trip down their funnel. Read a few blog posts, sign up for whatever you can, and try out any free tools they offer. You can also hone in on top traffic referrers and discover the top sources of referrals for their site. Don’t forget to use a methodical approach to collecting any responses. This is going to save you time and provide inspiration for future improvements. Your goal here is to identify: The major pain points they address The unique solutions they offer (and how) Their key messages for customers Who is sending referrals to their site How they serve their customers (site or app) You have the data (source), now craft your winning strategy At this point, you should have a comprehensive grasp of how to analyze your competitors. We’ve covered how you can assess the broader market and dissect your competitors. We’ve also covered how you can analyze audience interests and see what assets your competitors are using to serve them. Doing this analysis will help you find untapped opportunities in your market so that you can create a strategy that capitalizes on your strengths and addresses your competitors’ shortcomings. Just remember there is one thing at the heart of competitor analysis – Comprehensive and consistent data. With Similarweb you have all the tools and information you need to analyze and conquer your market. Build winning strategies Find gaps in your competitors' marketing strategies and hidden opportunities with our competitor analysis tools. Go to Similarweb FAQs What is competitive analysis? Competitive analysis is the process of collecting and reviewing information about your competitive landscape. What should I include in a competitor analysis? In your competitor analysis, you should assess your competitors’ strengths, weaknesses, market share, pricing, marketing strategies, and customer feedback. Also, evaluate their innovation, distribution channels, and overall financial health. This will help you to identify opportunities and threats in your industry. How can I conduct a successful competition analysis? Use Similarweb to determine the demographic makeup of your customer base across both web and app sources. Identify the sites consumers are visiting, evaluate emerging or declining performers, and find industry trends and marketing strategies that you can replicate. What is a competitive analysis framework? A Competitive Analysis framework is a structured approach to compare your company’s marketing strategy to your competitors in order to inform strategic decision-making. It involves evaluating market dynamics, industry trends, and competitor performance. by Limor Barenholtz Director of SEO at Similarweb Limor brings 20 years of SEO expertise, focusing on Technical SEO, JavaScript rendering, and mobile optimization. She thrives on solving complex problems and creating scalable strategies. Related Topics: Business Benchmarking Market Research This post is subject to Similarweb legal notices and disclaimers. Related Posts Marketing Intelligence Boost Your Website Traffic With Social Media Marketing Strategy by Itay Gross 8 Min. Oct 17, 2024 Research Intelligence Competitive Benchmarking: Crack the Code to Your Competitors’ Success Business Benchmarking Marketing Strategy by Monique Ellis 9 Min. Sep 10, 2024 Marketing Intelligence Mastering Travel Competitor Analysis: A Step-by-Step Guide Marketing Strategy by Monique Ellis 8 Min. Sep 5, 2024 Marketing Intelligence What is Competitive Intelligence: Importance, Types & More Marketing Strategy by Daniel Schneider 10 Min. Sep 2, 2024 Marketing Intelligence Find Competitors of Your Company Using Smart Strategies Marketing Strategy by Monique Ellis 9 Min. Sep 2, 2024 Marketing Intelligence Finding Your Competitors’ Target Audience for a Unique Edge Marketing Strategy by Monique Ellis 7 Min. Sep 1, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "How to Do a Competitive Analysis: A Complete Guide"
    },
    {
      "level": "H2",
      "text": "What is competitive analysis?"
    },
    {
      "level": "H2",
      "text": "Why is competitor analysis crucial in market research?"
    },
    {
      "level": "H2",
      "text": "The key benefits of competitive analysis"
    },
    {
      "level": "H3",
      "text": "1. Build smarter business strategies"
    },
    {
      "level": "H3",
      "text": "2. Understand your target audience better"
    },
    {
      "level": "H3",
      "text": "3. Surface competitor weak points"
    },
    {
      "level": "H3",
      "text": "4. Make informed, data-based decisions"
    },
    {
      "level": "H2",
      "text": "How to do competitor analysis in 8 easy steps"
    },
    {
      "level": "H3",
      "text": "1. Identify your competitors"
    },
    {
      "level": "H4",
      "text": "Start by Googling your keywords"
    },
    {
      "level": "H4",
      "text": "Speak to your sales team"
    },
    {
      "level": "H4",
      "text": "Get feedback from your customers"
    },
    {
      "level": "H4",
      "text": "Use a competitor analysis tool"
    },
    {
      "level": "H4",
      "text": "Find your organic competitors"
    },
    {
      "level": "H4",
      "text": "Find your paid competitors"
    },
    {
      "level": "H3",
      "text": "2. Create a company overview"
    },
    {
      "level": "H3",
      "text": "3. Perform a SWOT analysis"
    },
    {
      "level": "H3",
      "text": "4. Research your competitors’ 4 P’s"
    },
    {
      "level": "H3",
      "text": "5. Understand your competitor’s target audience"
    },
    {
      "level": "H4",
      "text": "Read customer reviews"
    },
    {
      "level": "H3",
      "text": "6. Website competitor analysis"
    },
    {
      "level": "H4",
      "text": "Pro tip: Keep track of your competitors with a Competitive Tracker"
    },
    {
      "level": "H3",
      "text": "7. Analyze your competitors’ keyword and content strategy"
    },
    {
      "level": "H4",
      "text": "See your competitors’ best-performing content"
    },
    {
      "level": "H3",
      "text": "8. Analyze their lead generation strategies"
    },
    {
      "level": "H2",
      "text": "You have the data (source), now craft your winning strategy"
    },
    {
      "level": "H2",
      "text": "FAQs"
    },
    {
      "level": "H3",
      "text": "Boost Your Website Traffic With Social Media"
    },
    {
      "level": "H3",
      "text": "Competitive Benchmarking: Crack the Code to Your Competitors’ Success"
    },
    {
      "level": "H3",
      "text": "Mastering Travel Competitor Analysis: A Step-by-Step Guide"
    },
    {
      "level": "H3",
      "text": "What is Competitive Intelligence: Importance, Types & More"
    },
    {
      "level": "H3",
      "text": "Find Competitors of Your Company Using Smart Strategies"
    },
    {
      "level": "H3",
      "text": "Finding Your Competitors’ Target Audience for a Unique Edge"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Limor Barenholtz"
}