{
  "url": "https://www.similarweb.com/blog/marketing/marketing-strategy/confirmation-bias/",
  "slug": "confirmation-bias",
  "title": "The Pros & Cons of Confirmation Bias for Marketers | Similarweb",
  "description": "Learn how confirmation bias can both help & hurt marketers. Understand when to employ confirmation bias & when to avoid it so as to protect the consumer.",
  "content": "HomeBlogMarketingMarketing StrategyThe Pros & Cons of Confirmation Bias for Marketers Marketing Intelligence The Pros & Cons of Confirmation Bias for Marketers Start your free trial by Darrell Mordecai 6 Min. January 15, 2020 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic If you’ve logged on to any social media account recently, chances are you’ve seen confirmation bias in effect. Online political arguments with your family aside, confirmation bias is everywhere nowadays though you may not always see its effects directly. Because confirmation bias is an inherent part of the human brain, there are elements of it that can benefit marketers and consumers. However, with anything, there is a potential for it to cloud our marketing decisions and treat our potential clients poorly. Keeping confirmation bias at the forefront of our decision-making processes is critical to being both an effective and ethical marketer. What Is Confirmation Bias? Confirmation bias is the human tendency to interpret any information as a verification of your existing beliefs. Essentially, confirmation bias is the internal “yes man” who agrees that everything you think is true and all evidence proves it. For example, say you believe that all artists are carefree and whimsical. When you meet a carefree person who happens to paint, your brain will say, “Ha! I knew it. All artists are like this!” Not only does confirmation bias affect how we interpret information, but it also plays a role in how we observe and recall situations, people, places, etc. “People who support or oppose a particular issue will not only seek information to support it, they will also interpret news stories in a way that upholds their existing ideas,” says Kendra Cherry, MS, an author, educational consultant, and speaker focused on helping students learn about psychology. Confirmation bias has the potential to shape our whole worldview. How Can Marketing Benefit from Confirmation Bias? As marketers, we are in a unique position to help inform our target audience’s beliefs about our products and services and then supply the evidence that confirms those beliefs. It’s why we believe that big brands are fancier than store brand generics. It’s why even though studies prove that most vitamin supplements are useless, we still buy and take them. Find Pain Points & Highlight Your Solution In one example, Rich Harshaw points to how the Holiday Inn Express drew attention to the typically mundane showerheads in their hotels. Harshaw points out that, in any other hotel stay, he never would have noticed the showerhead–just gone in, taken a shower, and gotten ready for bed. However, because the hotel chain’s advertising sang the praises of this one, very small feature, Harshaw made sure to check out the showerhead, try out the different settings, and appreciate the shower experience even more: “They tell you their showerhead is the greatest thing since sliced bread. Then when you actually get in the shower, you not only notice the showerhead (when under normal conditions, it would go completely and utterly unnoticed), but you also interpret the evidence (large size, gourmet sounding settings, high pressure) as proof that it is indeed great.” In marketing, we’re able to address specific pain points that customers may not even know they have. Bringing to light how our product or service is the solution to this issue for them. It’s a common refrain in product development and marketing circles that no one knew they needed an iPad, but here we are now using tablets in our daily lives. Reinforce Brand Image Similarly, once we’ve achieved a level of brand awareness, we can use confirmation bias to reinforce what consumers “already know” about us. Most people associate Amazon with quick delivery of everything they need–from toothpaste to furniture and more. So even if Amazon’s shipping delays a consumer’s package by a day or two, they’ll likely still make purchases from the online retailer because confirmation bias tells them that it was a one-off or that delivery is still actually very quick–even when we could have gotten a product faster by going to a store. People Associate Themselves with a Brand If you’ve ever tried to convince a Mac user to try a PC or a PC user to switch to a Mac, you’ve likely experienced this phenomenon. Once people begin to associate their identity with a certain brand, they adopt the confirmation bias assumption that they can never switch brands. Why is this? According to Aaron Brooks, “It’s because they associate a part of themselves or the person they aspire to be with said brand.” If someone identifies as an outdoorsy person and buys shoes, jackets, and backpacks from REI (even if they haven’t gone hiking or kayaking in their lives), marketing to their ideal selves can help cement that connection–regardless of the dissonance that occurs between their actions and beliefs. These elements of confirmation bias in marketing–telling potential clients what their issues are and how we are the main solution to solve them–can be mutually beneficial. However, there are elements of confirmation bias in marketing that we should be aware of in our daily work. What Should Marketers Avoid with Confirmation Bias? While confirmation bias can work in our favor as marketers, there are elements of the phenomenon that we should always be cognizant of. Not only can it affect how well we perform our jobs, but it can stifle innovation that prevents us from growing and experimenting. Targeting the Imaginary Audience In his 2017 article “Your Brain is Lying to You,” Michael Aagaard talks about one of the easiest confirmation bias pitfalls that marketers fall into. Aagaard says that it’s a marketer’s job to truly understand their target audiences–how they feel, what they want, what their biggest pain points are, etc. However, we have to do the work to really understand what those feelings, wants, needs, and pain points are. Oftentimes, marketers assume based on their confirmation bias that certain issues matter to our target audiences–when they actually don’t. “If we aren’t careful, confirmation bias can get the best of us, and we can end up marketing to an imaginary target audience made up of our own assumptions and biases,” says Aagaard. As a result, you can miss important marketing elements that are major pain points for your consumers–based on assumptions alone. It’s crucial to actually speak to your target audiences to learn what matters to them and how they find solutions for their problems. Stifling Marketing Innovation Along with missing the mark in targeting our audiences, confirmation bias also stifles marketing creativity, innovation, and testing. According to Will Burns of Ideasicle, “Confirmation bias is the force we apply to our reality to maintain it, keep it from changing and make us feel better for it.” Confirmation bias is the small voice in the back of your head that says, “No need to A/B test this. I know which one will perform best.” Oftentimes, those tests DO prove us wrong and show us that our assumptions aren’t always true. Or the one that tells marketers to only include the positive metrics in their reporting. Those negative metrics may be trying to tell you something! By attacking confirmation bias head-on, we’ll be better marketers, reach more of our target audiences, and drive better results. How Can Confirmation Bias Harm Consumers? The recent Netflix documentary “The Great Hack” touches on how confirmation bias in social media marketing was a huge part of the 2016 election. Using people’s data-rich psychological profiles from social media, Cambridge Analytica categorized people by their beliefs and demographics and showed them ads that furthered their existing prejudices and assumptions about others. The strategy was to create a social media echo chamber that reflected people’s already established biases about their “opponents.” The result was that the strategy pushed the opposing side even further apart by preying on their confirmation bias. Not only is it critical for marketers to be aware of their own confirmation biases, but it’s important to contemplate the ethics of using confirmation bias as a harmful marketing tactic. Because confirmation bias is something innate in all of us, the only way to approach it is to openly acknowledge that it’s there. Confirming Our Conclusion “The first step in dealing with confirmation bias is to admit it’s there. All the time. And it’s likely affecting our decision-making on a daily, if not hourly basis. So being aware of it might just loosen its reigns on us,” says Will Burns. Confirmation bias is an innate function of our human brains. It helps us quickly synthesize information that may otherwise take up too much brainpower and waste time. However, this evolutionary trait mixed with the elements of modern marketing has the potential to go very right AND very wrong. It’s critical that, as marketers, we’re aware of ways that we’re using confirmation bias with our target audiences and in our daily jobs–both to positive and negative effects. Ask yourself the scary questions that challenge your perspectives or make you uncomfortable with change. By keeping confirmation at the forefront of our marketing decisions, we’ll be better marketers and drive more affinity with our target audiences. by Darrell Mordecai Darrell creates SEO content for Similarweb, drawing on his deep understanding of SEO and Google patents. Related Topics: Marketing Strategy This post is subject to Similarweb legal notices and disclaimers. Related Posts Marketing Intelligence Boost Your Website Traffic With Social Media Marketing Strategy by Itay Gross 8 Min. Oct 17, 2024 Research Intelligence Competitive Benchmarking: Crack the Code to Your Competitors’ Success Business Benchmarking Marketing Strategy by Monique Ellis 9 Min. Sep 10, 2024 Marketing Intelligence Mastering Travel Competitor Analysis: A Step-by-Step Guide Marketing Strategy by Monique Ellis 8 Min. Sep 5, 2024 Marketing Intelligence What is Competitive Intelligence: Importance, Types & More Marketing Strategy by Daniel Schneider 10 Min. Sep 2, 2024 Marketing Intelligence Find Competitors of Your Company Using Smart Strategies Marketing Strategy by Monique Ellis 9 Min. Sep 2, 2024 Marketing Intelligence Finding Your Competitors’ Target Audience for a Unique Edge Marketing Strategy by Monique Ellis 7 Min. Sep 1, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "The Pros & Cons of Confirmation Bias for Marketers"
    },
    {
      "level": "H2",
      "text": "What Is Confirmation Bias?"
    },
    {
      "level": "H2",
      "text": "How Can Marketing Benefit from Confirmation Bias?"
    },
    {
      "level": "H3",
      "text": "Find Pain Points & Highlight Your Solution"
    },
    {
      "level": "H3",
      "text": "Reinforce Brand Image"
    },
    {
      "level": "H3",
      "text": "People Associate Themselves with a Brand"
    },
    {
      "level": "H2",
      "text": "What Should Marketers Avoid with Confirmation Bias?"
    },
    {
      "level": "H3",
      "text": "Targeting the Imaginary Audience"
    },
    {
      "level": "H3",
      "text": "Stifling Marketing Innovation"
    },
    {
      "level": "H2",
      "text": "How Can Confirmation Bias Harm Consumers?"
    },
    {
      "level": "H2",
      "text": "Confirming Our Conclusion"
    },
    {
      "level": "H3",
      "text": "Boost Your Website Traffic With Social Media"
    },
    {
      "level": "H3",
      "text": "Competitive Benchmarking: Crack the Code to Your Competitors’ Success"
    },
    {
      "level": "H3",
      "text": "Mastering Travel Competitor Analysis: A Step-by-Step Guide"
    },
    {
      "level": "H3",
      "text": "What is Competitive Intelligence: Importance, Types & More"
    },
    {
      "level": "H3",
      "text": "Find Competitors of Your Company Using Smart Strategies"
    },
    {
      "level": "H3",
      "text": "Finding Your Competitors’ Target Audience for a Unique Edge"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Darrell Mordecai"
}