{
  "url": "https://www.similarweb.com/blog/marketing/marketing-strategy/direct-indirect-competitors/",
  "slug": "direct-indirect-competitors",
  "title": "Direct vs. Indirect Competition | Similarweb",
  "description": "Discover the difference between your direct and indirect competitors, and learn how to beat them with the right tools. Click here for more information.",
  "content": "HomeBlogMarketingMarketing StrategyDirect vs. Indirect Competition: How to Increase Your Market Share Marketing Intelligence Direct vs. Indirect Competition: How to Increase Your Market Share Start analyzing your competitors by Darrell Mordecai 13 Min. November 26, 2023 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic In business, you must understand your competitors. Because your competitors are after the same audience you are. This means understanding: Who your competitors are What they are doing to grow their market share What strategies you should leverage to increase your market share There are two types of competitors: direct competitors and indirect competitors. Understanding them both is crucial because different competitors compete in different ways. In this post, we’ll take a deep dive into direct vs. indirect competition. We’ll get into how to identify direct and indirect competition, how to analyze its impact on your business, and how to create winning strategies that help you quickly increase your market share. What is direct and indirect competition? Direct competition refers to competitors that offer your target market the same products or services that you offer. Indirect competition, on the other hand, refers to competitors that offer different solutions that could replace your business to satisfy your customers’ wants and needs. Now that you understand direct and indirect competition at a high level let’s explore them further. Understanding direct competitors Direct competitors are businesses that offer similar products to yours and serve the same target audience as you do. Some well-known examples of direct competitors are… FedEx and UPS directly compete in the package delivery and courier industry Nike and Adidas are direct rivals in the athletic footwear and apparel market Boeing and Airbus are major competitors in the commercial aircraft industry Consumers tend to stay loyal to a brand, but under certain circumstances, they might switch to a competitor brand. This means your direct competitors pose a direct threat to your business. They’d be more than happy to steal your clients away from you while you’re not watching. Now, before I get into ways to find direct competitors or some strategies to beat them, let’s talk about indirect competitors. Understanding indirect competitors Your indirect competitors also pose a real threat to your business because indirect competitors serve your market by solving the same customer needs that you do. They serve those customer needs differently to your business, however. This usually means offering different products or services than you do. For instance… Although someone is looking for a hotel, they might be happy to stay in a vacation rental. Although someone is looking for a broom, they might be happy to use a vacuum cleaner. Although someone is looking for fruit juices, they might be happy to drink sports drinks. I’m sure you get the picture. Now, before we move on, you must understand that there is more to indirect competitors than just the products they provide. There are more ways than one to serve your target market. Many sales funnels start by simply answering a question your prospect might have. When you do that, you are able to build a relationship with your audience. That relationship should eventually influence their buying decision when they are looking to spend money on a product or service. Your indirect competitors are lurking at every funnel stage, ready to steal the show and start a conversation with your audience. This means even your SEO and social media competitors are indirect competitors. Even if they don’t offer products or services. For example, a child psychologist might win clients by posting blog content about behavioral issues. But prospects might never see that content because bloggers or news sites might own the traffic share for that topic. Now that it seems there are competitors lurking around every corner let’s have a look at how you can find your direct and indirect competitors. Once you’ve found them, I’ll show you some ways to deal with them. Spy on your competitors Build better marketing strategies with competitor analysis tools. Go to Similarweb How to find direct competitors It’s time to try to figure out who your competitors are. And, since business tends to be complex, I recommend using more than one method. In this section, I’ll show you a few ways to find and evaluate your competitors. We’ll get into a few data-driven strategies as well as some old-fashioned ways to understand your competitors. I’ll be focusing on website traffic data. But you should also apply this thinking to how you position your products. The Similarweb Similar Sites Report My favorite way to find competitors is to use the Similar Sites report. There are two reasons I love this report. Firstly, it gives you a big-picture look at your competitive market by comparing your site to similar sites using multiple data points, including: Content Audience Keywords Referrals This means you are not relying on a single metric to find your competitors. Secondly, I love it because once you have a list of similar sites, you can filter by industry to find direct competitors or see all sites that are competing, even if they are in different industries. So, for instance, let’s take a look at the sites that are similar to parents.com. Now, although these sites have a similar audience, looking at the Industry column, you’ll see that many of them are in the general health industry. Parents.com is specifically in the Children’s Health niche, but thebump.com and whattoexpect.com are related to pregnancy and not parenting. It’s easy to understand why these sites serve a similar audience. As we saw in the initial analysis, parents.com is heavily invested in SEO, focusing on informational content that targets parents. It’s likely that thebump.com and whattoexpect.com are also competing for top-of-the-funnel organic traffic, and their top-of-the-funnel informational content is highly likely to overlap. But are they selling similar products? Are they making money the same way? If not, you can assume that they are indirect competitors (which I’ll cover later in this post.) You can easily filter out other niches by only showing sites in the Children’s Health niche. Nice. We now have a list of sites directly competing in the Children’s Health niche. Okay, you’ve seen some Similarweb data. Now, let’s see what we can learn from Google. Looking at Google’s Autosuggest To round out your understanding of your competitors, Google is your friend. Because when you sell products on your site, your customers are likely to do a little research before buying. At some point, they are likely to compare what you sell to your competitors’ products. Common searches might be: [your product] vs. [a competitor’s product]. Now, this approach will work well if your brand is recognizable and your product is competitive. For instance, I decided to see which headphones compete directly with Apple headphones. As you can see, Google shows an extensive list. What’s more, you can expand this list with your keyword research tool. For instance, I’ve searched for the seed keyword ‘apple headphones’ in the Similarweb Keyword Generator. Then, using the search filter, I only include keywords that include ‘vs.’ As you can see below, the tool brings a nice list of searches made by actual users looking to compare similar products. It’s important to understand the context here. Although these keywords might be worth targeting in an SEO campaign, we are focusing on something more significant. These keywords are surfacing brands that are directly competing on a product level. Now that you understand how to find direct competitors let’s expand your competitor list to indirect competitors. How to find your indirect competitors In this section, I’ll show you how to find indirect competitors. It’s important to remember that your indirect competitors are serving your audience at different stages of the sales funnel, even if they are not offering the same products as your business. Finding indirect competitors in different niches As I mentioned above, you can use the Similarweb Similar Sites report to find sites that are similar to yours in terms of content, audience, keywords, and referrals. We’ve also seen that to find direct competitors, you can filter out sites in different industries. To find indirect competitors, just do the opposite. For instance, since parents.com is in the Children’s Health niche, to find indirect competitors, set the filter only to show sites from the women’s health niche that share a similar audience to parents.com. As I mentioned in the direct competitors section, these sites are focused on women’s health and not specifically parenting. Another way to find indirect competitors is to look for sites that target similar keywords. Organic Competitors report The Similarweb Organic Competitors report simply finds your top organic search competitors by analyzing the degree to which their keywords and rankings overlap with yours. So, for instance, I’ve dropped nerdwallet.com into the Website Analysis tool. Looking at the Organic Competitors report, we can see a nice list of sites competing for organic traffic. This tool brings you a list of competitors that are less focused than the Similar Sites report. The reason is the tool only looks at one metric. Keyword overlap. The result is you see sites that are only competing on your keywords but are not necessarily competing on a product level. Use this data to expand your list of indirect competitors. You’ve now spent some useful time looking at the data — but don’t neglect your richest source of business intel. Customer feedback Some of your best insights will come from your current customers. Think about it. These are people who’ve gone through your sales funnels and have come out the other side. Because they use your products and services, they most likely share the same pain points your future prospects have. So, if you want to understand your competitors, ask your existing customers things like: What made them decide to use your services? Are there any product alternatives? How do the alternatives compare to your product? There are many ways to do this, including: Zoom calls Surveys Emails Whatever they say, take notes. Their answers are likely to be pure gold. Okay, so you’ve found out who your competitors are. What do you do now? How to deal with your competitors Now that you understand your competitive market, it’s time to figure out how to increase your market share. You have limited resources, so the question here is what you should focus on strategically to move your business forward with the resources you have. Since dealing with your competitors requires strategic planning, you must first understand your competitive market. This requires careful analysis as your chosen strategy should solve a specific weakness your business might have. What’s more, there are different areas of your business that you can work on at any given time, including: Traffic Engagement Conversion Once you’ve figured out what you need to improve, you can then move on to actually creating a strategy that will help your business grow. For instance, you might see that your competitors get way more traffic or social media engagement than your business. This analysis will help you see where your business is lacking and can improve. Rather than give you exact steps to follow, I’ll demonstrate how I’d go through the process of strategic analysis. After the analysis, I’ll also show you some best practices and things to think about. For these examples, I’ll focus on traffic and engagement metrics, but in reality, you could follow a similar process when looking at how you are presenting your product in the market or how you are converting prospects into paying customers. Website Performance: Analyzing your competitors At this stage, you are looking for a weakness that you can leverage in your marketing strategy. Let’s compare your site to your top competitors and see what comes up. I’ve dropped nerdwallet.com into the Similarweb Website Analysis. I’ve also added the site’s four top competitors, making sure that the competitors are all in the same industry. By doing this, I can now compare all of the top metrics to see where there are obvious opportunities. The first thing that jumps out to me is when we look at the Traffic & Engagement report. As you can see below, marketwatch.com is getting substantially more Traffic & Engagement than all of the other sites analyzed. This tells me there are traffic opportunities to be won. Let’s use the Marketing Channels Overview to dig into where marketwatch.com is getting all of that traffic from. Having this clear will help you decide if you want to go after a similar traffic source. As you can see above, marketwatch.com is getting a substantial amount of direct traffic. Another metric that stands out is referral traffic. This suggests two things about marketwatch.com’s traffic lead. The fact that they get so much direct traffic suggests they have a strong brand. I’m assuming that because direct traffic refers to visitors entering the URL, using a bookmark, or clicking a saved link. Could there be another reason? The fact that they get so much referral traffic shows me that they are successful at creating relationships with other sites. I know this because referral traffic refers to traffic coming to a site through affiliates, links, content partners, and traffic from direct media buying or news coverage. Now, before I give a strategic analysis, let’s look at one more report. The more data we see, the better we’ll understand their strategy. The Engagement report will give us a bigger insight into marketwatch.com’s traffic and why they are winning against nerdwallet.com. As you can see above, although marketwatch.com is getting more than double the Monthly Visits that nerdwallet.com is, nerdwallet.com has more Monthly Unique Visitors than marketwatch.com. How on earth does that make sense? Looking at the Visits/Unique Visitors, you’ll see that: An average user on nerdwallet.com visited the site 1.47 times over the last year An average user on marketwatch.com visited the site 3.43 times over the last year In other words, the secret to marketwatch.com’s massive traffic numbers is not because of its strong brand. It’s because’s website is more ‘sticky.’ Viewers want to come back to the site. Now, before we understand the insight, let’s first take a look at the marketwatch.com home page. Marketwatch.com is sharing share-price data right on the home page. This might explain why the site is getting so much referral traffic. Also, if you check the backlinks, even though nerdwallet.com has substantially more backlinks, marketwatch.com has links from news sites like drudgereport.com and wsj.com. And here is the insight… Marketwatch.com gets substantial traffic by presenting itself as a financial news site. The result is visitors come back regularly to check the news. What’s more, it gets its referral traffic by supplying data to news sites. Nerdwallet.com could, in theory, play the same game and present itself as a news site. This could result in more returning traffic. What’s more, presenting timely financial data (like Marketwatch.com does) could result in substantial news-site traffic. Now, is it worth it for nerdwallet.com to take that insight and go with it? I’ll leave it to their team. Another example. Finding organic competitors Back to parents.com, when we look at the big-picture metrics comparing the site to its direct competitors, the story is clear. As you can see above, kidshealth.org is getting substantially more traffic than the other competitors. And, jumping to the Channels Overview and looking at traffic, we see that the vast majority of that is Organic Traffic. Should parents.com try to go after that same traffic? Maybe. If they decide to do that, the next step would be competitive SEO analysis. There’s no space to cover that fully in this post — but here is one approach to help you get started and give you a flavor of what’s possible. Drop all of the site’s competitors into the Similarweb Keyword Gap tool and hit the Opportunities filter. This will bring you a comprehensive list of keywords your competitors are ranking on that your site is not. You could then filter those keywords to find the best short, middle, and long-term opportunities. Spy on your competitors Build better marketing strategies with competitor analysis tools. Go to Similarweb Now you’ve found a strategic insight, what do you do next? A strategic approach to dealing with competitors: You’ve discovered the strengths and weaknesses of the industry leaders. It’s now time to create a strategic plan. To help you do that, here are some strategies you can use in dealing with competitors. You might need a mix of strategies, and what you choose should be based on your analysis. I’ll break down these strategies based on direct and indirect competition. Direct competition In general, when dealing with direct competitors, your biggest challenge is finding a way to stand out in your market. Here are a few ways to do that: Product Differentiation: Focus on making your product or service stand out through unique features, quality, or niching down. Targeted Marketing: Tailor your marketing efforts to highlight what makes your offerings better than the competition’s. Competitive Pricing: Offer competitive prices or bundle services to provide added value. Customer Experience: Provide exceptional customer service and support to build loyalty. Indirect competition Market Expansion: Identify new customer segments or markets that your indirect competitors haven’t yet reached. Diversification: Expand your product or service offerings to cater to additional needs of your existing customers. Collaboration: Consider partnerships or collaborations that complement your offerings with those of your indirect competitors. Educate Customers: Educate your target audience about the unique advantages of your product over alternatives. Innovation: Invest in research and development to create new solutions that outperform indirect competitors. Looking at direct and indirect competition from 30,000 feet If you’ve made it this far, you now understand what direct and indirect competitors are and how you find them. You should also now know how to find what strategies they are using to own their corner of the market. This process is powerful and will help you create a winning strategy that will help your business stand out and win market share. The key point to understand is there are two strategic approaches you can take when dealing with both indirect and direct competitors. Do it better Do something no one else is doing Doing it better means literally rolling up your sleeves and trying to capture market share away from your competitors. To do this, your goal is to show that your business is better than your competitors. This can be achieved with: Better branding Better SEO Greater ad spend There are many options. The other option is to do something that no one else is doing. A great example of this is how marketwatch.com gets its traffic from news sites while all of its competitors are only focusing on organic traffic. Both of these are valid strategic options. The question is which approach will bring you the most sustainable value over the long run. Spy on your competitors Build better marketing strategies with competitor analysis tools. Go to Similarweb FAQs What are examples of famous direct competitors? Here are some direct competitors in various industries: 1. Ecommerce: Amazon vs. Alibaba Walmart vs. Target 2. Automobiles: Toyota vs. Honda Ford vs. General Motors 3. Airlines: Delta Air Lines vs. American Airlines Emirates vs. Qatar Airways 4. Streaming Services: Netflix vs. Hulu Amazon Prime Video vs. Disney+ What are examples of some famous companies and their indirect competitors? 1. Apple (iPhone): Direct Competitors: Samsung, Google Pixel Indirect Competitors: Canon (cameras), Nintendo (portable gaming devices) 2. Coca-Cola: Direct Competitors: PepsiCo, Dr. Pepper Snapple Group Indirect Competitors: Starbucks (beverages), bottled water brands 3. Amazon (ecommerce): Direct Competitors: Walmart, eBay Indirect Competitors: Netflix (streaming services), Shopify (e-commerce platform) 4. Nike (athletic footwear and apparel): Direct Competitors: Adidas, Puma Indirect Competitors: Lululemon (athleisure), Under Armour (sportswear) by Darrell Mordecai Darrell creates SEO content for Similarweb, drawing on his deep understanding of SEO and Google patents. Related Topics: Marketing Strategy This post is subject to Similarweb legal notices and disclaimers. Related Posts Marketing Intelligence Boost Your Website Traffic With Social Media Marketing Strategy by Itay Gross 8 Min. Oct 17, 2024 Research Intelligence Competitive Benchmarking: Crack the Code to Your Competitors’ Success Business Benchmarking Marketing Strategy by Monique Ellis 9 Min. Sep 10, 2024 Marketing Intelligence Mastering Travel Competitor Analysis: A Step-by-Step Guide Marketing Strategy by Monique Ellis 8 Min. Sep 5, 2024 Marketing Intelligence What is Competitive Intelligence: Importance, Types & More Marketing Strategy by Daniel Schneider 10 Min. Sep 2, 2024 Marketing Intelligence Find Competitors of Your Company Using Smart Strategies Marketing Strategy by Monique Ellis 9 Min. Sep 2, 2024 Marketing Intelligence Finding Your Competitors’ Target Audience for a Unique Edge Marketing Strategy by Monique Ellis 7 Min. Sep 1, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Direct vs. Indirect Competition: How to Increase Your Market Share"
    },
    {
      "level": "H2",
      "text": "What is direct and indirect competition?"
    },
    {
      "level": "H3",
      "text": "Understanding direct competitors"
    },
    {
      "level": "H3",
      "text": "Understanding indirect competitors"
    },
    {
      "level": "H2",
      "text": "How to find direct competitors"
    },
    {
      "level": "H3",
      "text": "The Similarweb Similar Sites Report"
    },
    {
      "level": "H3",
      "text": "Looking at Google’s Autosuggest"
    },
    {
      "level": "H2",
      "text": "How to find your indirect competitors"
    },
    {
      "level": "H3",
      "text": "Finding indirect competitors in different niches"
    },
    {
      "level": "H3",
      "text": "Organic Competitors report"
    },
    {
      "level": "H3",
      "text": "Customer feedback"
    },
    {
      "level": "H2",
      "text": "How to deal with your competitors"
    },
    {
      "level": "H3",
      "text": "Website Performance: Analyzing your competitors"
    },
    {
      "level": "H3",
      "text": "Finding organic competitors"
    },
    {
      "level": "H2",
      "text": "A strategic approach to dealing with competitors:"
    },
    {
      "level": "H3",
      "text": "Direct competition"
    },
    {
      "level": "H3",
      "text": "Indirect competition"
    },
    {
      "level": "H2",
      "text": "Looking at direct and indirect competition from 30,000 feet"
    },
    {
      "level": "H2",
      "text": "FAQs"
    },
    {
      "level": "H3",
      "text": "Boost Your Website Traffic With Social Media"
    },
    {
      "level": "H3",
      "text": "Competitive Benchmarking: Crack the Code to Your Competitors’ Success"
    },
    {
      "level": "H3",
      "text": "Mastering Travel Competitor Analysis: A Step-by-Step Guide"
    },
    {
      "level": "H3",
      "text": "What is Competitive Intelligence: Importance, Types & More"
    },
    {
      "level": "H3",
      "text": "Find Competitors of Your Company Using Smart Strategies"
    },
    {
      "level": "H3",
      "text": "Finding Your Competitors’ Target Audience for a Unique Edge"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Darrell Mordecai"
}