{
  "url": "https://moz.com/blog/category/whiteboard-friday/p10",
  "slug": "p10",
  "title": "Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Ola King September 10, 2021 The Three Bosses of SEO Whiteboard Friday | Marketing Industry | SEO Basics In SEO, there are three main “bosses” with different needs: your business, your searchers, and your search engines. How do you answer to all of them? Read this post By: Cyrus Shepard September 3, 2021 How to Use STAT to Find SEO Opportunities at Scale Whiteboard Friday | Moz Tools Today, Cyrus explains how powerful STAT can be when you’re trying to discover SEO opportunities on a massive scale. Read this post By: Austin Peachey August 27, 2021 Conversion Rate Optimization for B2B Conversion Rate Optimization (CRO) | Whiteboard Friday When compared to a typical B2C business, the sales cycle in B2B means that users will be visiting your site multiple times throughout their sales cycle before making a final purchase. To encourage conversion, you need to be reaching them at each different stage in their journey. Read this post By: Tom Capper August 20, 2021 SEO and Google Discover Whiteboard Friday | Search Engines | Marketing Industry In today’s episode of Whiteboard Friday, Moz’s own SEO expert, Tom Capper, talks about the untapped organic traffic opportunity that is Google Discover. Read this post By: Austin Peachey August 13, 2021 The Roadmap to B2B SEO Success Whiteboard Friday | Marketing Industry | SEO Basics It can be hard to navigate the B2B marketing landscape, so today, guest host Austin Peachey walks you through the stops on Obility’s SEO roadmap. Read this post By: Dana DiTomaso July 9, 2021 5 Ways to Measure and 3 Tips to Improve Website Engagement SEO Analytics | Whiteboard Friday Please enjoy this very special Whiteboard Friday episode from MozCon speaker Dana DiTomaso, where she walks you through the ways you can determine whether or not you need to redo your website by measuring (and improving) your website engagement. Read this post By: Carly Schoonhoven July 2, 2021 A Step-by-Step Strategy for B2B Pillar Pages Whiteboard Friday | On-page SEO | Content Marketing A great way for B2B companies to fill a top-of-funnel content gap is by creating pillar pages. To help get you started, guest host Carly Schoonhoven of Obility walks you through a simple strategy for implementing pillar pages on your website. Read this post By: Amanda Milligan June 18, 2021 How to Make Newsworthy Content Content Marketing | Whiteboard Friday | Public Relations Ahead of her MozCon Virtual 2021 presentation, Amanda Milligan shows you what it takes to make your content newsworthy, in order to attract links. Read this post By: Alex Ratynski June 11, 2021 How to Configure Google Analytics for Local Businesses SEO Analytics | Whiteboard Friday | Local SEO Google Analytics is a powerful tool for businesses of all sizes. When used properly, it generates important information that can help to make valuable business decisions in online marketing or SEO efforts. In this week’s Whiteboard Friday, guest host Alex Ratynski goes through five important steps that local businesses can take to configure Google Analytics efficiently. Read this post By: Cyrus Shepard June 4, 2021 Does Fixing Old Broken Links Still Matter to SEO? Link Building | Whiteboard Friday Fixing broken links has long stood as an SEO best practice. But if you've run into situations where you've fixed a broken link and nothing happened, you’re not alone. In today’s episode of Whiteboard Friday, SEO expert Cyrus Shepard discusses whether these fixes still matter, and takes you through steps to increase your chances of seeing the benefits. Read this post By: Cooper Hollmaier May 28, 2021 SEO and Accessibility: Technical SEO [Series Part 3] Whiteboard Friday | Technical SEO We hope you’ve enjoyed this series on SEO and accessibility. In the final installment, Cooper shows you how the technical SEO strategies you implement across your site can help make it more perceivable, operable, understandable, and robust. Read this post By: Cooper Hollmaier May 21, 2021 SEO and Accessibility: Content [Series Part 2] Whiteboard Friday | Marketing Industry | On-page SEO As SEOs, our goal when we're creating content is to provide equitable access, which means that content isn’t just available to search engines, but also to people of all abilities. In the second installment of his three-part accessibility series, Cooper shows you how to ensure that your amazing content is accessible by bots AND people. Read this post By: Cooper Hollmaier May 14, 2021 An Introduction to Accessibility and SEO [Series Part 1] Whiteboard Friday | Marketing Industry | User Experience (UX) Welcome back to Whiteboard Friday! To start us up after our break, guest host Cooper Hollmaier has put together a three-part series that shows how SEO and accessibility go hand-in-hand. In part one, he introduces us to the idea of optimizing not just for some of our audience, but all of our audience. Read this post By: Paddy Moogan April 16, 2021 What are the Makings of a High-Quality Link? Link Building | Whiteboard Friday What links are considered “high quality”? Find out from link building expert, Paddy Moogan, who talks you through link relevancy, link diversity, link authority, and the sustainability of your link building efforts. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "The Three Bosses of SEO"
    },
    {
      "level": "H2",
      "text": "How to Use STAT to Find SEO Opportunities at Scale"
    },
    {
      "level": "H2",
      "text": "Conversion Rate Optimization for B2B"
    },
    {
      "level": "H2",
      "text": "SEO and Google Discover"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "The Roadmap to B2B SEO Success"
    },
    {
      "level": "H2",
      "text": "5 Ways to Measure and 3 Tips to Improve Website Engagement"
    },
    {
      "level": "H2",
      "text": "A Step-by-Step Strategy for B2B Pillar Pages"
    },
    {
      "level": "H2",
      "text": "How to Make Newsworthy Content"
    },
    {
      "level": "H2",
      "text": "How to Configure Google Analytics for Local Businesses"
    },
    {
      "level": "H2",
      "text": "Does Fixing Old Broken Links Still Matter to SEO?"
    },
    {
      "level": "H2",
      "text": "SEO and Accessibility: Technical SEO [Series Part 3]"
    },
    {
      "level": "H2",
      "text": "SEO and Accessibility: Content [Series Part 2]"
    },
    {
      "level": "H2",
      "text": "An Introduction to Accessibility and SEO [Series Part 1]"
    },
    {
      "level": "H2",
      "text": "What are the Makings of a High-Quality Link?"
    }
  ],
  "author": "Ola King\n          \n            Cyrus Shepard\n          \n            Austin Peachey\n          \n            Tom Capper\n          \n            Austin Peachey\n          \n            Dana DiTomaso\n          \n            Carly Schoonhoven\n          \n            Amanda Milligan\n          \n            Alex Ratynski\n          \n            Cyrus Shepard\n          \n            Cooper Hollmaier\n          \n            Cooper Hollmaier\n          \n            Cooper Hollmaier\n          \n            Paddy Moogan"
}