{
  "url": "https://moz.com/blog/category/whiteboard-friday/p13",
  "slug": "p13",
  "title": "Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Dana DiTomaso August 28, 2020 Google Ads Mistakes to Avoid — Best of Whiteboard Friday Paid Search Marketing (PPC) | Search Engines | Whiteboard Friday SEO and PPC can work together for benefits all around, especially when it comes to optimizing your Google Ads. In this informative Whiteboard Friday, Dana DiTomaso explains how you can harness the power of both SEO and PPC for a better Google experience overall. Read this post By: Russ Jones August 21, 2020 Let's Make Money: 4 Tactics for Agencies Looking to Succeed – Best of Whiteboard Friday Whiteboard Friday | Advanced SEO | Digital Marketing Agencies What does it take for an agency to see success in a constantly changing industry? From confidently raising your prices to knowing when to say no, Russ Jones covers four essential tactics that'll ultimately increase your bottom line in this Whiteboard Friday. Read this post By: Dr. Peter J. Meyers August 14, 2020 Desktop, Mobile, or Voice? (D) All of the Above — Best of Whiteboard Friday Whiteboard Friday | Search Engines Since more searchers are home and not on-the-go, we're left wondering where to focus our optimization efforts. Is desktop the most important? Is mobile? What about the voice phenomenon that's now become part of our day-to-day lives? As with most things, the most important factor is to consider your audience. Read this post By: Kameron Jenkins August 7, 2020 Using the Flowchart Method for Diagnosing Ranking Drops — Best of Whiteboard Friday Whiteboard Friday | Advanced SEO In this popular Whiteboard Friday, the wonderful Kameron Jenkins shows us a structured way to diagnose ranking drops using a flowchart method and critical thinking. Read this post By: Will Critchlow July 31, 2020 What Do Dolphins Eat? Lessons from How Kids Search — Best of Whiteboard Friday Search Engines | Whiteboard Friday We're bringing back this slightly different-from-the-norm Whiteboard Friday, in which the fantastic Will Critchlow shares lessons from how kids search. Read this post By: Shannon McGuirk July 24, 2020 The Campaign Comeback: What to Do When Content Fails — Best of Whiteboard Friday Whiteboard Friday | Content Marketing Some of your campaigns are bound to fail, but that doesn't mean they're beyond help. In this popular Whiteboard Friday, MozCon speaker Shannon McGuirk provides a five-step plan for resuscitating dead content campaigns and setting them up for success. Read this post By: Cyrus Shepard July 17, 2020 Core Web Vitals: The Next Official Google Ranking Factor - Whiteboard Friday Technical SEO | Whiteboard Friday | Advanced SEO There's a new ranking factor in town: Core Web Vitals. Expected in 2021, this Google-announced algorithm change has a few details you should be aware of. Cyrus Shepard dives in this week on Whiteboard Friday. Read this post By: Britney Muller July 10, 2020 SEO Negotiation: How to Ace the Business Side of SEO — Best of Whiteboard Friday Marketing Industry | Whiteboard Friday Britney Muller walks us through a bevy of smart tips and considerations that will strengthen your SEO negotiation skills, whether you're a seasoned pro or a newbie to the practice. Read this post By: Britney Muller July 3, 2020 Page Speed Optimization: Metrics, Tools, and How to Improve — Best of Whiteboard Friday Technical SEO | Whiteboard Friday Page speed has always been a crucial part of SEO work, and as more companies make the shift to online operations, optimization becomes more important than ever. However, it's a complex subject that tends to be very technical. What are the most crucial things to understand about your site's page speed, and how can you begin to improve? To help you answer these questions, we're sharing this popular episode of Whiteboard Friday where Britney Muller goes over what you need to know to get started. Read this post By: Britney Muller June 26, 2020 How to Get Backlinks in 2020 [Series] - Whiteboard Friday Whiteboard Friday | Link Building A little creativity and smart tactics can uncover high-quality link building opportunities. This week, Britney Muller kicks off a new Whiteboard Friday series on modern link building. Read this post By: Cyrus Shepard June 19, 2020 Is Google E-A-T Actually a Ranking Factor? - Whiteboard Friday Advanced SEO | Search Engines | Whiteboard Friday Showing expertise, authority, and trustworthiness in your site content is important to ranking well. But why is that, exactly? Cyrus Shepard explores whether E-A-T is a true ranking factor, making your E-A-T goals SMART, and how to communicate it all to curious stakeholders. Read this post By: Britney Muller June 12, 2020 Understanding & Fulfilling Search Intent Content Marketing | Search Engines | Whiteboard Friday Understanding what your target audience is searching and why is more important than ever. Britney Muller shares everything you need to begin understanding and fulfilling search intent, plus a free Google Sheets checklist download to help you analyze the SERPs you care about most. Read this post By: Britney Muller May 29, 2020 Crisis Adaptation Local SEO | Whiteboard Friday Businesses all over the globe are struggling with new challenges as a direct result of the COVID-19 pandemic. Britney Muller outlines a checklist that businesses can use to meet the changing needs of consumers and improve visibility for local searches. Read this post By: Kameron Jenkins May 22, 2020 5 Common Objections to SEO (& How to Respond) - Best of Whiteboard Friday SEO Reporting | Whiteboard Friday | SEO Consulting With marketing budgets taking a hit under the economic strain of COVID-19, advocating for the value SEO can bring to a struggling business is a new take on an old battle. This popular Whiteboard Friday episode by Kameron Jenkins covers five common objections you'll hear to SEO and how to counter them with smart, researched, fact-based responses — an important skill to brush up on now more than ever. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Google Ads Mistakes to Avoid — Best of Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Let's Make Money: 4 Tactics for Agencies Looking to Succeed – Best of Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Desktop, Mobile, or Voice? (D) All of the Above — Best of Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Using the Flowchart Method for Diagnosing Ranking Drops — Best of Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "What Do Dolphins Eat? Lessons from How Kids Search — Best of Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "The Campaign Comeback: What to Do When Content Fails — Best of Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Core Web Vitals: The Next Official Google Ranking Factor - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "SEO Negotiation: How to Ace the Business Side of SEO — Best of Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Page Speed Optimization: Metrics, Tools, and How to Improve — Best of Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "How to Get Backlinks in 2020 [Series] - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Is Google E-A-T Actually a Ranking Factor? - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Understanding & Fulfilling Search Intent"
    },
    {
      "level": "H2",
      "text": "Crisis Adaptation"
    },
    {
      "level": "H2",
      "text": "5 Common Objections to SEO (& How to Respond) - Best of Whiteboard Friday"
    }
  ],
  "author": "Dana DiTomaso\n          \n            Russ Jones\n          \n            Dr. Peter J. Meyers\n          \n            Kameron Jenkins\n          \n            Will Critchlow\n          \n            Shannon McGuirk\n          \n            Cyrus Shepard\n          \n            Britney Muller\n          \n            Britney Muller\n          \n            Britney Muller\n          \n            Cyrus Shepard\n          \n            Britney Muller\n          \n            Britney Muller\n          \n            Kameron Jenkins"
}