{
  "url": "https://moz.com/blog/category/whiteboard-friday/p34",
  "slug": "p34",
  "title": "Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Cyrus Shepard May 2, 2014 How Google Knows What Sites You Control And Why it Matters Whiteboard Friday How much does Google really know about you and the sites you control? In today's Whiteboard Friday, Cyrus talks us through some of the ways our administrative relationships with our sites can either help or hurt our rankings. Read this post By: Rand Fishkin April 25, 2014 The Greatest Misconception in Content Marketing Whiteboard Friday Great content certainly helps business, but it isn't as simple as \"publish, share, convert new customers.\" In today's Whiteboard Friday, Rand explains what's really going on. Read this post By: Rand Fishkin April 18, 2014 6 Changes We Always Thought Google Would Make to SEO that They Haven't Yet Whiteboard Friday Sometimes it seems clear that Google is headed in a certain direction, but we never really see a move materialize. In today's Whiteboard Friday, Rand explores six of these areas, and we're looking forward to your thoughts in the comments. Read this post By: Rand Fishkin April 11, 2014 Getting Branded Searches Right Whiteboard Friday When people search for our brands, they're often looking for something specific, and it's on us to make sure they can find it as easily as possible. In today's Whiteboard Friday, Rand explains four steps we can take to be sure we're sending searchers in the right direction. Read this post By: Rand Fishkin March 28, 2014 Surviving the SEO \"Slog\" Whiteboard Friday Expectations of returns can be high for SEO work, despite the fact that it can take several months to really get best practices ingrained. In today's Whiteboard Friday, Rand shows us four ways to mitigate the gap between expectations and effort. Read this post By: Rand Fishkin March 21, 2014 How Can Mobile SEO Help my Non-Mobile or Local Business? Whiteboard Friday We're often hearing about how mobile search volume is catching up to (or even overtaking) desktop search volume, so what do we do? The answer is more nuanced than you might think, and in today's Whiteboard Friday, Rand shows us a few ways forward. Read this post By: Rand Fishkin March 14, 2014 Keyword Targeting and Density Whiteboard Friday Enough has changed about keyword targeting that it's high time we offered a refresher. In today's Whiteboard Friday, Rand lays out best practices for targeting, and clears the air about density and cannibalization in today's world of search. Read this post By: John Doherty March 7, 2014 5 Things I Wish I Knew as an Agency Marketer Whiteboard Friday Working as an agency marketer is tough. I did it for a bit over two years and learned a lot of lessons. Along the way and since I have reflected about what would make me more successful as an agency marketer, and now that I am in-house at HotPads.com, I've come up with five things I wish I had known as an agency marketer. Never fear though, as there are some tidbits in there for the in-house crew as well! Read this post By: Rand Fishkin February 28, 2014 Are Links Losing Value in Google's Algorithm? Whiteboard Friday The value of links in Google's algorithm has been the subject of much debate. In today's Whiteboard Friday, Rand clarifies two of the most compelling arguments and offers SEOs his advice on how to treat links as we move forward. Read this post By: Rand Fishkin February 21, 2014 6 Ways to Earn Higher Rankings Without Investing in Content Creation and Marketing Whiteboard Friday Content is certainly important, but we have to remember all the other tools we have for improving our rankings. In today's Whiteboard Friday, Rand covers six great methods that don't even involve content marketing. Read this post By: Rand Fishkin February 14, 2014 The Best Way to Suck at Marketing Whiteboard Friday Customers are people, not transactions, and we should all treat them accordingly. In today's Whiteboard Friday, Rand details the problem and what we can do to solve it. Read this post By: Rand Fishkin January 31, 2014 Handling User-Generated & Manufacturer-Required Duplicate Content Across Large Numbers of URLs Whiteboard Friday Some marketers, especially those working with e-commerce sites, are forced to deal with content like product descriptions and reviews; things that aren't unique. In today's Whiteboard Friday, Rand offers tips for those marketers to avoid being penalized for their work. Read this post By: Rand Fishkin January 24, 2014 How to Earn the Amplification of Influencers Whiteboard Friday Influencers can afford marketers the ability to reach huge audiences they wouldn't otherwise have been able to, but they're very picky about what they choose to share. In today's Whiteboard Friday, Rand shares a simple equation to help you win them over. Read this post By: Rand Fishkin January 17, 2014 Why Guest Posting and Blogging is a Slippery Slope Whiteboard Friday It takes quite a bit of effort to create genuinely high-quality guest posts, and many marketers are tempted to find ways to automate the process. In today's Whiteboard Friday, Rand clears up some misconceptions that can lead marketers down that slippery slope. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "How Google Knows What Sites You Control And Why it Matters"
    },
    {
      "level": "H2",
      "text": "The Greatest Misconception in Content Marketing"
    },
    {
      "level": "H2",
      "text": "6 Changes We Always Thought Google Would Make to SEO that They Haven't Yet"
    },
    {
      "level": "H2",
      "text": "Getting Branded Searches Right"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Surviving the SEO \"Slog\""
    },
    {
      "level": "H2",
      "text": "How Can Mobile SEO Help my Non-Mobile or Local Business?"
    },
    {
      "level": "H2",
      "text": "Keyword Targeting and Density"
    },
    {
      "level": "H2",
      "text": "5 Things I Wish I Knew as an Agency Marketer"
    },
    {
      "level": "H2",
      "text": "Are Links Losing Value in Google's Algorithm?"
    },
    {
      "level": "H2",
      "text": "6 Ways to Earn Higher Rankings Without Investing in Content Creation and Marketing"
    },
    {
      "level": "H2",
      "text": "The Best Way to Suck at Marketing"
    },
    {
      "level": "H2",
      "text": "Handling User-Generated & Manufacturer-Required Duplicate Content Across Large Numbers of URLs"
    },
    {
      "level": "H2",
      "text": "How to Earn the Amplification of Influencers"
    },
    {
      "level": "H2",
      "text": "Why Guest Posting and Blogging is a Slippery Slope"
    }
  ],
  "author": "Cyrus Shepard\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            John Doherty\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin"
}