{
  "url": "https://moz.com/blog/category/whiteboard-friday/p37",
  "slug": "p37",
  "title": "Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Rand Fishkin July 5, 2013 How Should Marketers React When Google's Search Results Have Dramatic Changes? Whiteboard Friday When Google updates its algorithm, our first reaction as web marketers is often one of panic and confusion. In today's Whiteboard Friday, Rand shares his tips for investigating and adapting to the changes. Read this post By: Danny Sullivan June 28, 2013 The Evolution of Search Whiteboard Friday Search has been around for long enough that some of us don't remember its humble beginnings. In today's Whiteboard Friday, Danny Sullivan leads us on a tour through the history of search, from those beginnings to what he calls \"Search 5.0\" and beyond. Read this post By: Rand Fishkin June 21, 2013 The Top 4 Ways to Use Social Media to Earn Links Whiteboard Friday Social media can be a great source of quality links, but earning them takes some social skills. In today's Whiteboard Friday, Rand covers four of his favorite tactics for link-builders using social media. Read this post By: Rand Fishkin June 13, 2013 How Processing Fluency Impacts Web Marketing Whiteboard Friday Things which are easier for us to digest are more credible, and more likely to induce action. In today's Whiteboard Friday, Rand dives into how processing fluency impacts web marketing and customer decisions. Read this post By: David Mihm June 6, 2013 How Business Listings Are Made Whiteboard Friday As a local business owner, it's important for your business to be listed correctly in Google's search results. In this week's edition of Local Whiteboard Friday, David Mihm sheds some light on the complicated process that Google uses to create its business listings. Read this post By: Rand Fishkin May 30, 2013 Building a Marketing Flywheel Whiteboard Friday By building up quality content and visitor loyalty on your website, you're adding energy to a marketing flywheel. In today's Whiteboard Friday, Rand shares insights on how to add energy and when to release it Read this post By: Rand Fishkin May 23, 2013 Conducting Market Research Before Investing in Tactical Execution Whiteboard Friday Before you start investing in tactics, it's important to do your market research. In today's Whiteboard Friday, Rand discusses why building out a research-based roadmap before you start building out tactics like SEO, content, and social will help boost your success! Read this post By: Rand Fishkin May 16, 2013 How to Move Rankings Up On Older, Existing Content Whiteboard Friday If you're ranking number four for a keyword, there's no doubt you want to move up to that coveted number one spot. So how do you boost your rankings for the old keyword you've been targeting? In today's Whiteboard Friday, Rand explains how adjusting your existing content can be used to help bump your site up in the SERPs! Read this post By: Ron Garrett May 9, 2013 Positioning Your Business for the Future of SEO Whiteboard Friday As an agency or business owner, you need a checklist to help make sure you're staying competitive, focusing on the right tactics, and building your business in the right direction. In today's Whiteboard Friday, learn how to position your business for whatever the future of SEO may bring. Read this post By: Rand Fishkin May 2, 2013 Why We Can't Just Be SEOs Anymore Whiteboard Friday There's a movement happening in our industry where many SEOs are changing their titles and practices to \"inbound marketing.\" Where did this shift originate, and how is it shaping our industry at large? In today's Whiteboard Friday, Rand shares his thoughts on why we can't just be SEOs anymore if we're aiming for the bigger picture. Read this post By: Rand Fishkin April 26, 2013 Fixing the Broken Culture of SEO Metrics Whiteboard Friday SEO is evolving, and the metrics we currently use to gauge success are broken when it comes to the broader ideals of inbound marketing. In today's Whiteboard Friday, Rand talks about what we can do to offer a more holistic and strategic approach to success metrics that our clients can get behind. Read this post By: Ruth Burr Reedy April 19, 2013 Keyword-Driven Personas Whiteboard Friday As inbound marketing continues to gain traction, it's time to start building your keywords into the bones of your site, rather than adding them once your site is already completely mapped out. Our Lead SEO, Ruth Burr, talks about using keywords to drive personas and, ultimately, your site mapping process. Read this post By: Rand Fishkin April 12, 2013 Remove Unnecessary Steps & Win More Links, Shares, and Conversions Whiteboard Friday The more you simplify your user experience, the more likely users are to accomplish the goals you've set for the product, website, or communication at hand. In this week's Whiteboard Friday, Rand walks us through user experience and the actions that we can remove from our processes in order to drive more conversions, earn more links, get more social shares. Read this post By: David Mihm April 5, 2013 Evolution of the Local Algorithm Whiteboard Friday We've come a long way since the early 2000's, and local SEO has changed tremendously since the beginning of online search. In today's post, David Mihm discusses what factors affect ranking of local businesses, and how local algorithms within Google have evolved throughout the years. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "How Should Marketers React When Google's Search Results Have Dramatic Changes?"
    },
    {
      "level": "H2",
      "text": "The Evolution of Search"
    },
    {
      "level": "H2",
      "text": "The Top 4 Ways to Use Social Media to Earn Links"
    },
    {
      "level": "H2",
      "text": "How Processing Fluency Impacts Web Marketing"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "How Business Listings Are Made"
    },
    {
      "level": "H2",
      "text": "Building a Marketing Flywheel"
    },
    {
      "level": "H2",
      "text": "Conducting Market Research Before Investing in Tactical Execution"
    },
    {
      "level": "H2",
      "text": "How to Move Rankings Up On Older, Existing Content"
    },
    {
      "level": "H2",
      "text": "Positioning Your Business for the Future of SEO"
    },
    {
      "level": "H2",
      "text": "Why We Can't Just Be SEOs Anymore"
    },
    {
      "level": "H2",
      "text": "Fixing the Broken Culture of SEO Metrics"
    },
    {
      "level": "H2",
      "text": "Keyword-Driven Personas"
    },
    {
      "level": "H2",
      "text": "Remove Unnecessary Steps & Win More Links, Shares, and Conversions"
    },
    {
      "level": "H2",
      "text": "Evolution of the Local Algorithm"
    }
  ],
  "author": "Rand Fishkin\n          \n            Danny Sullivan\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            David Mihm\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Ron Garrett\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Ruth Burr Reedy\n          \n            Rand Fishkin\n          \n            David Mihm"
}