{
  "url": "https://moz.com/blog/category/whiteboard-friday/p40",
  "slug": "p40",
  "title": "Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "D By: DanaLookadoo September 14, 2012 Structured Social Sharing Formula Whiteboard Friday Sharing content via social media is simply the next step after hitting the \"Publish\" button. Today's Whiteboard Friday outlines steps to take to ensure your shares on Facebook, Google+, and Twitter are optimized for success. Read this post By: Rand Fishkin September 7, 2012 Using Followerwonk to Grow Your Twitter Account Whiteboard Friday | Moz Tools In this week's Whiteboard Friday, Rand speaks about using our Followerwonk tool to grow your Twitter account. Read this post By: Nick Sayers September 3, 2012 Tips for Filming Whiteboard Presentations Whiteboard Friday Want to learn how Moz shoots Whiteboard Friday? Pick up some awesome tips on shooting, lighting, and editing whiteboard presentations. In this guide to filming whiteboard content you, will learn how we use lights to remove shadows, why you need a zebra for your camera, and the importance of recording isolated sound. Let’s see what you got, kid. Read this post By: Dan Shure August 31, 2012 Ten Painless Tactics To Earn Attention On Twitter Whiteboard Friday Twitter is similar to passing signs at full speed on the highway. How do you get your signs (tweets) noticed and read? How can your profile stand out from the rest? For many, Twitter can be a fun and exciting, yet illusive and challenging social media platform. This Whiteboard Friday (to be followed by a Whiteboard Plus and Moz YouTube post) includes ten Twitter tactics for you to put to good use. Read this post By: Aleyda Solis August 24, 2012 4 Tips For Your Mobile SEO Strategy Whiteboard Friday In this Whiteboard Friday, I share four fundamental questions that will help you assess the best alternatives to start taking mobile search into consideration for your site. Google has recently published a set of official developers resources and ... Read this post By: Paddy Moogan August 17, 2012 8 Link Building Tips Whiteboard Friday For today's Whiteboard Friday, I'll be covering eight tips to help you build more links. This follows on from my talk at MozCon which covered 35 ways to get links in around 35 minutes. At MozCon, I explained how link building is hard, it takes time and can be very tough for most of us. Unfortunately for most of us, it isn't as simple as just producing content which aut... Read this post By: Jonathon Colman August 10, 2012 Agile Marketing Whiteboard Friday In today's video, we'll explore the nifty, nefarious world on Agile Marketing, which Jonathon Colman talked about at MozCon a few weeks ago. We'll take a look at four key principles of Agile Marketing and talk about how you can use them to hack your organization to deliver more value to your customers more often by breaking down barriers and removing impediments to your progress. Read this post By: Jeff McRitchie August 3, 2012 YouTube Ranking Factors Whiteboard Friday This week for Whiteboard Friday we are taking a look at how to get a video to rank on YouTube. Each month YouTube receives over 800 million unique visitors who watch more than 3 billion hours of video, traffic we can't afford to ignore. So how do you get videos to rank for competitive terms on YouTube? By paying close attention to these 12 important ranking factors. Do you agr... Read this post By: John Doherty July 27, 2012 Smarter Internal Linking Whiteboard Friday Hey there SEOmoz readers! This week we are talking about what I like to call \"Smarter Internal Linking\". Rand mentioned internal linking a few months ago before Penguin even hit, back when we were still calling it the \"over-optimization penalty\". A few months later, we can see the potential effects that Penguin has had and the factors causing them. Read this post By: Rand Fishkin July 20, 2012 Improving Social & Subscription Calls to Action Whiteboard Friday In this week's Whiteboard Friday, we'll be discussing ways that you can improve your social and email calls to action to make them more effective. Often times, when wandering the web, you'll find web pages that are filled from head to toe with all the possible calls to action that are available. By limiting your usage of these calls to action and by placing them purposefully, you... Read this post By: Rand Fishkin July 13, 2012 8 Rules for Exceptional Slide Presentations Whiteboard Friday In last week's Whiteboard Friday, we talked about how you can leverage the power slide decks to boost your SEO. This week, we are going to be following up on that same theme with, 8 rules that you can use to make exceptional slide decks. Here you will... Read this post By: Rand Fishkin July 6, 2012 Leveraging the Power of Slide Decks to Boost your SEO, Social + Content Marketing Whiteboard Friday In this week's Whiteboard Firday, we are going to be discussing how you can use slide decks for web marketing. I've been leveraging the power of slide decks for quite some time now and would like to share a little bit about what I have learned. Read this post By: Eric Enge June 29, 2012 Getting Started with Guest Posting Whiteboard Friday In this week's Whiteboard Friday, I am going to be walking through how to get started guest blogging. There are plenty of articles all over the web that go into the finer details of guest blogging, but let's step back for a second and really talk about how to get started. From getting into the guest blogging mindset to building up your list of guest blogging opportunities,... Read this post M By: Michael King June 21, 2012 8 Ways to Find Old URLs After a Failed Site Migration Whiteboard Friday In this week's Whiteboard Friday, we are going to be going through some different ways you can track down old URLs after a site migration. These tactics can be incredibly useful for new clients that have just performed a redesign with less than ideal preparation. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Structured Social Sharing Formula"
    },
    {
      "level": "H2",
      "text": "Using Followerwonk to Grow Your Twitter Account"
    },
    {
      "level": "H2",
      "text": "Tips for Filming Whiteboard Presentations"
    },
    {
      "level": "H2",
      "text": "Ten Painless Tactics To Earn Attention On Twitter"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "4 Tips For Your Mobile SEO Strategy"
    },
    {
      "level": "H2",
      "text": "8 Link Building Tips"
    },
    {
      "level": "H2",
      "text": "Agile Marketing"
    },
    {
      "level": "H2",
      "text": "YouTube Ranking Factors"
    },
    {
      "level": "H2",
      "text": "Smarter Internal Linking"
    },
    {
      "level": "H2",
      "text": "Improving Social & Subscription Calls to Action"
    },
    {
      "level": "H2",
      "text": "8 Rules for Exceptional Slide Presentations"
    },
    {
      "level": "H2",
      "text": "Leveraging the Power of Slide Decks to Boost your SEO, Social + Content Marketing"
    },
    {
      "level": "H2",
      "text": "Getting Started with Guest Posting"
    },
    {
      "level": "H2",
      "text": "8 Ways to Find Old URLs After a Failed Site Migration"
    }
  ],
  "author": "DanaLookadoo\n          \n            Rand Fishkin\n          \n            Nick Sayers\n          \n            Dan Shure\n          \n            Aleyda Solis\n          \n            Paddy Moogan\n          \n            Jonathon Colman\n          \n            Jeff McRitchie\n          \n            John Doherty\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Eric Enge\n          \n            Michael King"
}