{
  "url": "https://moz.com/blog/category/whiteboard-friday/p41",
  "slug": "p41",
  "title": "Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Rhea Drysdale June 14, 2012 The Difference Between Vendors and Consultants Whiteboard Friday In this week's Whiteboard Friday, we are going to be discussing the differences between vendors and consultants. We are very excited to have Rhea Drysdale in the studio to present on this very insightful topic. Rhea is one of the leaders in SEO consulting services, but she hasn't always been. Nope, she used ... Read this post By: Rand Fishkin June 12, 2012 Interview with Danny Sullivan - Whiteboard Friday-ish Whiteboard Friday In this week's Whiteboard Friday Wednesday, we have something different in store for you. Last week, during SMX, I had the extreme pleasure in having Danny Sullivan come into the MozPlex Studio for an interview. Luckily he let me ask him all kinds of fun questions. I should warn you, this is another long one,... Read this post By: Rand Fishkin June 7, 2012 Phoenix Rising: Bing's New Webmaster Tools Whiteboard Friday In this week's Whiteboard Friday, Bing's very own Duane Forrester will be joining us in the Moz studio to personally walk us through the newly released Bing Webmaster Tools. Let us know how you feel about these Webmaster Tools in the comments below. Duane will be keeping an eye on them as well so let him know what you think. Read this post By: Rand Fishkin May 24, 2012 10 Myths That Scare SEOs But Shouldn't Whiteboard Friday In this week's Whiteboard Friday, we'll be tackling some SEO myths that might scare you but shouldn't. From keyword density to reciprocal linking, lets set the record straight about some of the myths out there. Read this post By: Rand Fishkin May 17, 2012 Ways to Win Customers and Influence Rankings Whiteboard Friday Starting up your own consulting agency can be quite a difficult process and often times the most challenging step to your endeavour will be finding new customers or clients. In this week's Whiteboard Friday we will be covering some tips and tactics that you can use to get referrals and win customers. Don't forget to leave your own advice in the comments below. Read this post By: Rob Kerry May 10, 2012 The Penguin Update Whiteboard Friday SEOmoz and I don't always see eye to eye on industry issues, but I still have a lot of respect for the company. In fact SEOmoz is still the website that I send people to, when they want to learn about SEO or get into our industry. Rand kindly invited me to the SEOmoz office when I was in Seattle this week, for a chat and the opportunity to present a Whiteboard Friday. Read this post By: Marshall Simmonds May 3, 2012 Convincing Upper Management aka Justifying your Existence Whiteboard Friday Today we have special guest Marshall Simmonds joining us in the Moz studio to present this week's Whiteboard Friday. Marshall is the Founder and CEO of Define Media Group. He is also a pioneer in the field of SEO, and we are all too pleased to have him present a topic he knows all to well. Having worked for some of the largest online brands, Marshall... Read this post By: Rand Fishkin April 26, 2012 Negative SEO: Myths, Realities, and Precautions Whiteboard Friday This week we will be covering a topic not often discussed on Whiteboard Friday. We are going to be talking about negative SEO tactics and how these practices function. Negative SEO is definitely not something we condone here at SEOmoz but education around these techniques can be a helpful, precautionary method that could prevent you from being the subject of malicious intent. ... Read this post By: Rand Fishkin April 19, 2012 6 Changes Every SEO Should Make BEFORE the Over-Optimization Penalty Hits Whiteboard Friday Having overly optimized web pages could soon get your websites in some hot water with Google and their search results. It has recently been announced that Google will start to penalize websites that engage in over-optimization practices. In this week's Whiteboard Friday, we will be covering some changes that you should be making to your SEO practices in order to avoid this type o... Read this post By: Rand Fishkin April 12, 2012 Overcoming Your Winter of Dis-Content Whiteboard Friday Are you and your content suffering from the blues after this long Winter? Well have no fear, warmer weather is here and it's time to overcome that winter of dis-\"content\". Today we will be talking about 5 ways to overcome the content fatigue you may be experiencing. After watching the videos, please share the ways you help keep your content fresh, unique, and successful. Read this post By: Cyrus Shepard April 5, 2012 How to Stop Over Optimizing and Start Creating for SEO Whiteboard Friday Is your website hurting because of over optimization? It's a question every SEO faces at one time or another. Over optimization penalties have been around for awhile, but how do you know when you've gone to far? In this week's Whiteboard Friday, we explore what happens when certain SEO techniques stop delivering value, and when you should switch your strategy to more productive activities. Read this post By: Joanna Lord March 29, 2012 The New On-Page Optimization Whiteboard Friday In this week's Whiteboard Friday, we are covering some advanced techniques that you can use to optimize your landing pages. The typical web user has evolved and it's important for web marketers to evolve with them. By taking a look at how the web has changed we can make more informed decisions on how to optimize our pages and maximize their impact. Read this post By: Rand Fishkin March 22, 2012 Tools and Tactics to Test Your Product/Marketing Before You Launch Whiteboard Friday It takes a lot of time to put together a marketing plan, a landing page, or even a full web app. Wouldn't it be nice to know if what you are building is going to be successful? In this week's Whiteboard Friday, we will be covering the tools and tactics that you can use to test your product before it launches. Please leave your own methods and feedback in the comments below! ... Read this post By: Rand Fishkin March 15, 2012 How Google's \"Search Suggest\" (Instant) Works Whiteboard Friday Google's Search Suggest automatically recommends popular searches as you type your query into the search field. Does anyone watch Whiteboard Friday? Let's examine how Google determines these results and why they are important. In this week's Whiteboard Friday, Rand suggests how you can use these instant recommendations to leverage your brand, or business. Please leave you... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "The Difference Between Vendors and Consultants"
    },
    {
      "level": "H2",
      "text": "Interview with Danny Sullivan - Whiteboard Friday-ish"
    },
    {
      "level": "H2",
      "text": "Phoenix Rising: Bing's New Webmaster Tools"
    },
    {
      "level": "H2",
      "text": "10 Myths That Scare SEOs But Shouldn't"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Ways to Win Customers and Influence Rankings"
    },
    {
      "level": "H2",
      "text": "The Penguin Update"
    },
    {
      "level": "H2",
      "text": "Convincing Upper Management aka Justifying your Existence"
    },
    {
      "level": "H2",
      "text": "Negative SEO: Myths, Realities, and Precautions"
    },
    {
      "level": "H2",
      "text": "6 Changes Every SEO Should Make BEFORE the Over-Optimization Penalty Hits"
    },
    {
      "level": "H2",
      "text": "Overcoming Your Winter of Dis-Content"
    },
    {
      "level": "H2",
      "text": "How to Stop Over Optimizing and Start Creating for SEO"
    },
    {
      "level": "H2",
      "text": "The New On-Page Optimization"
    },
    {
      "level": "H2",
      "text": "Tools and Tactics to Test Your Product/Marketing Before You Launch"
    },
    {
      "level": "H2",
      "text": "How Google's \"Search Suggest\" (Instant) Works"
    }
  ],
  "author": "Rhea Drysdale\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rob Kerry\n          \n            Marshall Simmonds\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Cyrus Shepard\n          \n            Joanna Lord\n          \n            Rand Fishkin\n          \n            Rand Fishkin"
}