{
  "url": "https://moz.com/blog/category/whiteboard-friday/p43",
  "slug": "p43",
  "title": "Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Casey Henry December 1, 2011 Using CRO to Make Great Content Whiteboard Friday This week we are joined by Carlos del Rio from Agillian, who is based here in Seattle, WA. Carlos will discusses a method that will help you make great content by following 3 easy steps. After watching the video dive into the comments and discuss what your thoughts are on using CRO to make great content. Read this post By: Kenneth Martin November 24, 2011 Using Emails to Build Links Whiteboard Friday It's not so common to think about email marketing as a potential link building opportunity, but it's actually a wonderful tactic that you can use. Leveraging those finely crafted email lists with an SEO strategy can be highly advantageous. In this weeks Whiteboard Friday, Rand shows off some useful and creative tips on how to utilize an email marketing strategy that will help you build links. Read this post By: Kenneth Martin November 17, 2011 Mapping Keywords to Content for Maximum Impact Whiteboard Friday When keyword targeting is approached separately from a content creation strategy, the concocted results can often leave us scratching our heads and pointing fingers at the malformed \"Frankenpages.\" By fostering a more cohesive relationship between these traditionally detached endeavors, we can greatly enhance our results and deliver considerable value to our audience. ... Read this post By: Casey Henry November 10, 2011 Scalable Link Building Using Social Media Whiteboard Friday This week we are thrilled to have Mike King join us again for another amazing Whiteboard Friday. As marketers and SEOs we all have asked our selves at one time or another how we can use Social Media to build links. Mike lays out a very scalable way to build links for just about any business. Read this post By: Casey Henry November 3, 2011 Google's \"Freshness\" Update Whiteboard Friday Yesterday, Google announced that they released a new update that impacts roughly 35 percent of searches and can better determine when to give you more up-to-date relevant results. What does that mean for you as a search marketer? Rand with special guest Mike King (@iPullRank) dive into what this mean for you and your clients. Read this post By: Aaron Wheeler October 27, 2011 How Big is Your Long Tail? Whiteboard Friday Choosing keywords to optimize for is a tricky business, made all the more tricky as keyphrases grow longer than a couple of words. As Google has said, up to 20% of search queries in any given day are unique. Should you try to optimize your tauntaun sleeping bags product page for \"tauntaun sleeping ba... Read this post By: Aaron Wheeler October 21, 2011 Google Hides Search Referral Data with New SSL Implementation - Emergency Whiteboard Friday Whiteboard Friday On Tuesday, Google announced that signed-in users will, by default, be routed to the SSL version of Google (https://www.google.com). Before Tuesday, most users used non-SSL Google for their searches. In this emergency Whiteboard Friday, Rand will go over the changes Google has made, why it happened (and why it really might have happened), and what you can do to stay calm and fight back. Read this post By: Casey Henry October 20, 2011 Pump Up The Bing Whiteboard Friday This week Rand is joined by Duane Forester of Bing to talk about all thing Bing. Rand and Duane will be talking about the shut down of Yahoo Site Explorer, early stages of social search, the return of the meta keyword tag as a spam signal, and some new features in Bing Webmaster Tools. Read this post By: Aaron Wheeler October 13, 2011 5 Tips for Running a Successful Retargeting Campaign Whiteboard Friday You've already got a lot of visitors coming to your site through your SEO efforts, but how many of those visitors convert on their first visit? If your site is like most sites, less than 5%. Those visitors that don't convert the first time around might come back to your site, but why not make the decision easier for them? Use retargeting! There are a lot of great reasons to imple... Read this post By: Aaron Wheeler October 6, 2011 Local SEO Checklist for New Sites Whiteboard Friday A couple of weeks ago, Rand went over his general SEO checklist for new websites. It's a great resource to reference and help give your site that initial advantage other new sites don't have. Keep in mind, though, that there are other factors at play when trying to rank in the local results specifically... Read this post By: Aaron Wheeler September 29, 2011 Title Tags - Is 70 Characters the Best Practice? Whiteboard Friday It's often pretty difficult to make a short title for a webpage that offers a lot of varied or super-specific information. At SEOmoz, we say that the best practice for title tag length is to keep titles under 70 characters. That's pretty pithy considering that the title also includes your site or brand name, spaces, and other nondescript characters. So, does it matter if you go over 70... Read this post By: Aaron Wheeler September 22, 2011 An SEO Checklist for New Sites Whiteboard Friday Over 160,000 new top-level domains were registered yesterday. 160,000! This huge volume of new sites being birthed wasn't unique to yesterday; this happens every day (you can check out today's progress at DailyChanges.com). The sites that start out pre-optimized and that continue optimizing immediately after publishing will be at an incredible ad... Read this post By: Aaron Wheeler September 15, 2011 Keyword Metrics for SEO (And Driving Actions from Data) Whiteboard Friday We all have access to a lot of great metrics surrounding keywords we research and target, including data from search engines themselves, analytics suites, and other third-party companies (ourselves included). It's one thing to gather and parse this data, but it's a whole 'nother thing to actually act on that data to drive traffic. On this week's Whiteboard Friday, Rand illustrates some wa... Read this post By: Cyrus Shepard September 8, 2011 Beyond Exact Match Anchor Text To Next Generation Link Signals Whiteboard Friday We love exact match anchor text! It's the holy grail of links that make our rankings soar. Or does it? Many SEOs predict Google will continue to devalue exact match anchors as their algorithm evolves in the age of Panda. We've seen evidence of this phenomenon over the past year and expect to see the value of exact anchors drop even further. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Using CRO to Make Great Content"
    },
    {
      "level": "H2",
      "text": "Using Emails to Build Links"
    },
    {
      "level": "H2",
      "text": "Mapping Keywords to Content for Maximum Impact"
    },
    {
      "level": "H2",
      "text": "Scalable Link Building Using Social Media"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Google's \"Freshness\" Update"
    },
    {
      "level": "H2",
      "text": "How Big is Your Long Tail?"
    },
    {
      "level": "H2",
      "text": "Google Hides Search Referral Data with New SSL Implementation - Emergency Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Pump Up The Bing"
    },
    {
      "level": "H2",
      "text": "5 Tips for Running a Successful Retargeting Campaign"
    },
    {
      "level": "H2",
      "text": "Local SEO Checklist for New Sites"
    },
    {
      "level": "H2",
      "text": "Title Tags - Is 70 Characters the Best Practice?"
    },
    {
      "level": "H2",
      "text": "An SEO Checklist for New Sites"
    },
    {
      "level": "H2",
      "text": "Keyword Metrics for SEO (And Driving Actions from Data)"
    },
    {
      "level": "H2",
      "text": "Beyond Exact Match Anchor Text To Next Generation Link Signals"
    }
  ],
  "author": "Casey Henry\n          \n            Kenneth Martin\n          \n            Kenneth Martin\n          \n            Casey Henry\n          \n            Casey Henry\n          \n            Aaron Wheeler\n          \n            Aaron Wheeler\n          \n            Casey Henry\n          \n            Aaron Wheeler\n          \n            Aaron Wheeler\n          \n            Aaron Wheeler\n          \n            Aaron Wheeler\n          \n            Aaron Wheeler\n          \n            Cyrus Shepard"
}