{
  "url": "https://moz.com/blog/category/whiteboard-friday/p45",
  "slug": "p45",
  "title": "Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Aaron Wheeler June 2, 2011 Project Management Tips for Marketing Teams Whiteboard Friday Time management is one of the toughest parts of any job, but in web marketing, it's impossible to do your job if you can't manage your projects. Since web marketers are wearers of many hats, it's helpful to collaborate, regroup, and organize often enough to keep on top of things. In th... Read this post By: Casey Henry May 26, 2011 Competitive Link Analysis Tips Using Open Site Explorer- Whiteboard Friday Whiteboard Friday We all want to build up the reputation and authority of our websites and this week Rand discusses some competitive link analysis tips using Open Site Explorer. He talks about how to avoid some common pitfalls when trying to get similar links that your competitors have and give you a few good ideas on how you should be doing it. If you have any tips that you can share with the community on how you do competitive link analysis, please feel free to share those in the comments. Read this post By: Aaron Wheeler May 19, 2011 Mobile SEO Tips For Everyone - Filmed on an iPad 2 Whiteboard Friday On this week's Whiteboard Friday, Cyrus from SEOmoz's very own SEO team gives some pointers on how to keep sites optimized for cells and tablets without breaking the bank or the brain. Read this post By: Casey Henry May 12, 2011 SEOmoz Google Analytics Setup Whiteboard Friday This week Tom Critchlow from Distilled talks about the suggestions he has given to SEOmoz to improve our Google Analytics setup. These suggestions are as easy as adding events to specific user actions or as complex as adding all your domains into one Google Analytics account. Tom discusses why he thinks that these improvements will help SEOmoz and why you should be thinking about using some of these improvements in your setup. Below the video you will find some code snippets that we used to setup our Google Analytics account that should help you in your setup. Read this post By: Casey Henry May 5, 2011 Cross-Domain Canonical The New 301? Whiteboard Friday About a year ago Google announced the release of the canonical tag to the SEO world. The canonical tag helps in solving issues with duplicate content by letting Google know that pages with the tag are copies of the original page. Now we can do this across different domains to let Google know where the original content originated from and give credit to the original content owner. Read this post By: Aaron Wheeler April 28, 2011 Correlation Data for SEO and Social Media Analysis - Part 2 Whiteboard Friday Last week, Rand discussed the importance of correlation data in general and how you can use it for SEO research. It's a lot easier to get things done if you know which tasks are high priority and which are low, and correlation data can help. This week, Rand finishes... Read this post By: Aaron Wheeler April 21, 2011 Correlation Data for SEO and Social Media Analysis - Part 1 Whiteboard Friday One of the most helpful aids in doing SEO is knowing what factors actually affect your rankings. It seems obvious on its face, but not everyone prioritizes their SEO work with the knowledge of how changes to a site and link profile actually affect the SERPs. It's important to at least have some heuristics to use in pursuit of higher rankings, and while it's not always easy, it is possi... Read this post By: Aaron Wheeler April 14, 2011 How to Make SEO Happen Whiteboard Friday Sure, you know SEO like you know the back of your hand. You know how to linkbuild, and you know how to do keyword research. Of course you've got a lot of SEO knowledge - you've been watching these Whiteboard Fridays every week, right? Well, now it's time to get crackin'! Unfortunately, it feels like you never have enough time to get done all the things you know you should do. Maybe the... Read this post By: Aaron Wheeler April 7, 2011 SEO Link Analysis Pitfalls Whiteboard Friday Over the past couple of weeks Rand has been discussing the metrics available for link research and how to use them appropriately for different research situations. This week, he discusses some potential pitfalls in link... Read this post By: Aaron Wheeler March 31, 2011 Which Link Metrics Should I Use? Part 2 of 2 Whiteboard Friday We all know that, at first, it can be really difficult to decide what the most valuable link metrics are and when to use them. Last week, Rand outlined and defined a variety of metrics that are used to assess the respective values of domains, pages, and links between them. This week, he's back with the stunning conclusion: how to actually use these link metrics in your research and... Read this post By: Aaron Wheeler March 24, 2011 Which Link Metrics Should I Use? Part 1 of 2 Whiteboard Friday For both personal knowledge and client satisfaction, it's really important to be able to track SEO progress quantitatively as well as qualitatively. In a two part series beginning today, Rand is going to go over the definitions of some of the most popular metrics available right now, as well as the best ways to use metrics in your SEO analysis. Read this post By: Aaron Wheeler March 17, 2011 Top 5 SEO Questions from Customers Whiteboard Friday On this week's Whiteboard Friday, two members of the SEOmoz Help Team will walk you through some solutions to 5 of the most common SEO problems we see on the Help Team. They'll also let you know how to change your profile picture. Read this post By: Aaron Wheeler March 10, 2011 Preventing Link-Based Penalties Whiteboard Friday At the end of February, Google announced that it was updating its search algorithm to serve higher-quality results to searchers. The update has since been dubbed the \"Farmer Update\" due to the algorithm's new bias against what Google considers \"sites which are low-value add for user... Read this post By: Aaron Wheeler March 3, 2011 Bing's Duane Forrester on Webmaster Tools, Metrics, and Sitemap Quality Thresholds Whiteboard Friday This week we are thrilled to have a special guest joining us for Whiteboard Friday: Duane Forrester, a top-of-the-line SEO who went over to the other side of the fence and now works at Bing's Webmaster Project as the Senior Project Manager. Duane discusses Webmaster Tools, metrics, and some important and exciting news about sitemap quality thresholds... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Project Management Tips for Marketing Teams"
    },
    {
      "level": "H2",
      "text": "Competitive Link Analysis Tips Using Open Site Explorer- Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Mobile SEO Tips For Everyone - Filmed on an iPad 2"
    },
    {
      "level": "H2",
      "text": "SEOmoz Google Analytics Setup"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Cross-Domain Canonical The New 301?"
    },
    {
      "level": "H2",
      "text": "Correlation Data for SEO and Social Media Analysis - Part 2"
    },
    {
      "level": "H2",
      "text": "Correlation Data for SEO and Social Media Analysis - Part 1"
    },
    {
      "level": "H2",
      "text": "How to Make SEO Happen"
    },
    {
      "level": "H2",
      "text": "SEO Link Analysis Pitfalls"
    },
    {
      "level": "H2",
      "text": "Which Link Metrics Should I Use? Part 2 of 2"
    },
    {
      "level": "H2",
      "text": "Which Link Metrics Should I Use? Part 1 of 2"
    },
    {
      "level": "H2",
      "text": "Top 5 SEO Questions from Customers"
    },
    {
      "level": "H2",
      "text": "Preventing Link-Based Penalties"
    },
    {
      "level": "H2",
      "text": "Bing's Duane Forrester on Webmaster Tools, Metrics, and Sitemap Quality Thresholds"
    }
  ],
  "author": "Aaron Wheeler\n          \n            Casey Henry\n          \n            Aaron Wheeler\n          \n            Casey Henry\n          \n            Casey Henry\n          \n            Aaron Wheeler\n          \n            Aaron Wheeler\n          \n            Aaron Wheeler\n          \n            Aaron Wheeler\n          \n            Aaron Wheeler\n          \n            Aaron Wheeler\n          \n            Aaron Wheeler\n          \n            Aaron Wheeler\n          \n            Aaron Wheeler"
}