{
  "url": "https://moz.com/blog/category/whiteboard-friday/p9",
  "slug": "p9",
  "title": "Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Dr. Peter J. Meyers April 15, 2022 Title Rewrites: 3 Patterns to Avoid Whiteboard Friday | Search Engines Google recently made updates to the way they rewrite title tags, so Dr. Pete takes you through some of the new data we’ve collected In addition, he shares three titling patterns to avoid if you don’t want them rewritten. Read this post By: Tom Capper February 18, 2022 Core Web Vitals: What Next? Whiteboard Friday | Search Engines | SEO Analytics The promised page experience updates from Google that caused such a stir last year are far from being done, so Tom takes a look at where we are now and what happens next for the algorithm’s infamous Core Web Vitals. Read this post By: Zoe Pegler February 4, 2022 How to Use STAT to Discover Extra Value in Your Keyword Data Whiteboard Friday | Moz Tools Maximizing the value in your keyword data is essential when you're a brand trying to rank on the forever-changing SERPs. With that in mind, Moz Learning and Development Specialist Zoe Pegler walks you through the key features in STAT that will help you glean extra (and important) insights from that data. Read this post By: Andy Crestodina January 21, 2022 Influencer Marketing for SEO and Authority Whiteboard Friday | Public Relations Please welcome back guest host, Andy Crestodina, for an episode all about the connection between people, relationships, and SEO outcomes. Specifically, how influencer marketing can drive SEO and authority. Read this post By: Cyrus Shepard January 7, 2022 22 Smart Google SEO Tips for 2022 Whiteboard Friday | Advanced SEO We're back with a brand new season of Whiteboard Friday episodes for your viewing pleasure. First up: SEO expert Cyrus Shepard shares his top 22 tips for successful Google SEO in 2022. Watch to find out what to prioritize and what to look out for in the year ahead! Read this post By: Cyrus Shepard December 17, 2021 Best of Whiteboard Friday 2021: 21 Smart Google SEO Tips Advanced SEO | Marketing Industry | Whiteboard Friday Our top Whiteboard Friday episode of the year was originally published all the way back at the beginning of January! So much has happened in the marketing industry since then, but Cyrus’s 21 SEO tips for the year are still definitely smart. Read this post By: Andy Crestodina December 10, 2021 Best of Whiteboard Friday 2021: How to Explain Domain Authority to a Non-SEO SEO Basics | Whiteboard Friday Do you ever have to explain the importance of Domain Authority to clients or co-workers who have little or no SEO experience? If so, this week’s Whiteboard Friday host — Andy Crestodina — walks through how to get your message across successfully. Read this post By: Amanda Milligan November 12, 2021 How to Make Newsworthy Content: Part 2 Whiteboard Friday | Content Marketing | Public Relations Content marketing expert Amanda Milligan is back with three more ways to make your content more newsworthy. Read this post By: Cyrus Shepard November 5, 2021 5 Simple Tips for SEO + Email Marketing Flywheels Email Marketing | Whiteboard Friday In today’s episode of Whiteboard Friday, Cyrus explains how to use the complementary powers of SEO and email marketing over and over again so that each strategy becomes bigger and more powerful the more you do it. Read this post By: Kavi Kardos October 15, 2021 The ROI of SEO Whiteboard Friday | Marketing Industry Search marketers can't get our important work implemented if we can't prove that it's worth the investment to our higher-ups. With that in mind, Moz’s own SEO Manager, Kavi Kardos, is going to give you the numbers and the talking points you need to justify the return on investment of your SEO work. Read this post By: Ola King October 8, 2021 Prioritizing Technical SEO Fixes Whiteboard Friday | Technical SEO Today, Ola takes you through the technical SEO fixes that should be at the top of your SEO audit list. Read this post By: Britney Muller October 1, 2021 Intro to Python [Part 2] Whiteboard Friday | Technical SEO | Advanced SEO Britney is back (with her special co-host, Pumpkin!) to give you more tips on how to get started using the programming language Python. Read this post By: Tom Capper September 24, 2021 Crawl Budget Whiteboard Friday | Technical SEO | Advanced SEO Google has a finite amount of time it's willing to spend crawling your site, so if you’re having issues with indexation, you might want to look into your crawl budget. Read this post By: Tom Capper September 17, 2021 Cannibalization Whiteboard Friday | Technical SEO | SEO Basics In today's episode of Whiteboard Friday, Moz SEO expert Tom Capper walks you through cannibalization: what it is, how to identify it, and how to fix it. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Title Rewrites: 3 Patterns to Avoid"
    },
    {
      "level": "H2",
      "text": "Core Web Vitals: What Next?"
    },
    {
      "level": "H2",
      "text": "How to Use STAT to Discover Extra Value in Your Keyword Data"
    },
    {
      "level": "H2",
      "text": "Influencer Marketing for SEO and Authority"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "22 Smart Google SEO Tips for 2022"
    },
    {
      "level": "H2",
      "text": "Best of Whiteboard Friday 2021: 21 Smart Google SEO Tips"
    },
    {
      "level": "H2",
      "text": "Best of Whiteboard Friday 2021: How to Explain Domain Authority to a Non-SEO"
    },
    {
      "level": "H2",
      "text": "How to Make Newsworthy Content: Part 2"
    },
    {
      "level": "H2",
      "text": "5 Simple Tips for SEO + Email Marketing Flywheels"
    },
    {
      "level": "H2",
      "text": "The ROI of SEO"
    },
    {
      "level": "H2",
      "text": "Prioritizing Technical SEO Fixes"
    },
    {
      "level": "H2",
      "text": "Intro to Python [Part 2]"
    },
    {
      "level": "H2",
      "text": "Crawl Budget"
    },
    {
      "level": "H2",
      "text": "Cannibalization"
    }
  ],
  "author": "Dr. Peter J. Meyers\n          \n            Tom Capper\n          \n            Zoe Pegler\n          \n            Andy Crestodina\n          \n            Cyrus Shepard\n          \n            Cyrus Shepard\n          \n            Andy Crestodina\n          \n            Amanda Milligan\n          \n            Cyrus Shepard\n          \n            Kavi Kardos\n          \n            Ola King\n          \n            Britney Muller\n          \n            Tom Capper\n          \n            Tom Capper"
}