{
  "url": "https://www.similarweb.com/blog/updates/announcements/",
  "slug": "announcements",
  "title": "Company News & Product Announcements | Similarweb",
  "description": "Discover the latest company announcements and updates from Similarweb including new partnerships, new office locations, and insights from our corporate team.",
  "content": "HomeBlogUpdatesAnnouncements 63 Articles Announcements Discover the latest company announcements and updates from Similarweb Editor's Picks Updates Introducing Similarweb Google Looker Studio Connectors: Easy Access to Data at Scale Announcements by Pavel Dimshiz 6 Min. October 1, 2024 Updates Acquiring 42matters Cements Similarweb as the Leader in App Intelligence Announcements by Or Offer 2 Min. July 1, 2024 Updates Similarweb Named Leader in Snowflake’s 2023 Modern Marketing Data Stack Report Announcements by Pavel Dimshiz 3 Min. September 13, 2023 Updates Introducing Similarweb Google Looker Studio Connectors: Easy Access to Data at Scale Announcements by Pavel Dimshiz 6 Min. Oct 1, 2024 Updates New Data Version: The Best Digital Data Just Got Better Announcements by Ron Asher 4 Min. Sep 24, 2024 Updates Acquiring 42matters Cements Similarweb as the Leader in App Intelligence Announcements by Or Offer 2 Min. Jul 1, 2024 Updates Meet SAM: The AI-Powered Assistant Changing the Sales Game Announcements Product Updates by Or Offer 2 Min. Apr 18, 2024 Updates Welcome, Admetricks, and Hello, Similarweb Ad Intelligence Announcements by Or Offer 2 Min. Mar 4, 2024 Updates Year in Review 2023: Finding the Competitive Edge Announcements by Or Offer 6 Min. Dec 20, 2023 Updates What to Expect From Our New Search Monitoring Tools Announcements Product Updates by Adelle Kehoe 4 Min. Sep 28, 2023 Updates Similarweb Named Leader in Snowflake’s 2023 Modern Marketing Data Stack Report Announcements by Pavel Dimshiz 3 Min. Sep 13, 2023 Updates Similarweb 3.0: It’s Time to Unlock More Growth Announcements Product Updates by Or Offer 7 Min. Sep 6, 2023 Updates Similarweb Unveils AI Assistant for Faster Access to Insights Announcements by Or Offer 3 Min. Aug 1, 2023 Updates Expanding Our Reach: Similarweb Launches Official WeChat Account Announcements by Similarweb 2 Min. May 17, 2023 Updates Similarweb in APAC: Introducing South Korea Country Filter and First-Ever Digital 100 India Announcements by Molly Winik 5 Min. Mar 19, 2023 Show more Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Announcements"
    },
    {
      "level": "H2",
      "text": "Editor's Picks"
    },
    {
      "level": "H3",
      "text": "Introducing Similarweb Google Looker Studio Connectors: Easy Access to Data at Scale"
    },
    {
      "level": "H3",
      "text": "Acquiring 42matters Cements Similarweb as the Leader in App Intelligence"
    },
    {
      "level": "H3",
      "text": "Similarweb Named Leader in Snowflake’s 2023 Modern Marketing Data Stack Report"
    },
    {
      "level": "H3",
      "text": "Introducing Similarweb Google Looker Studio Connectors: Easy Access to Data at Scale"
    },
    {
      "level": "H3",
      "text": "New Data Version: The Best Digital Data Just Got Better"
    },
    {
      "level": "H3",
      "text": "Acquiring 42matters Cements Similarweb as the Leader in App Intelligence"
    },
    {
      "level": "H3",
      "text": "Meet SAM: The AI-Powered Assistant Changing the Sales Game"
    },
    {
      "level": "H3",
      "text": "Welcome, Admetricks, and Hello, Similarweb Ad Intelligence"
    },
    {
      "level": "H3",
      "text": "Year in Review 2023: Finding the Competitive Edge"
    },
    {
      "level": "H3",
      "text": "What to Expect From Our New Search Monitoring Tools"
    },
    {
      "level": "H3",
      "text": "Similarweb Named Leader in Snowflake’s 2023 Modern Marketing Data Stack Report"
    },
    {
      "level": "H3",
      "text": "Similarweb 3.0: It’s Time to Unlock More Growth"
    },
    {
      "level": "H3",
      "text": "Similarweb Unveils AI Assistant for Faster Access to Insights"
    },
    {
      "level": "H3",
      "text": "Expanding Our Reach: Similarweb Launches Official WeChat Account"
    },
    {
      "level": "H3",
      "text": "Similarweb in APAC: Introducing South Korea Country Filter and First-Ever Digital 100 India"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": ""
}