{
  "url": "https://backlinko.com/hub/content/calendar",
  "slug": "calendar",
  "title": "What Is a Content Calendar? How to Build One + Free Template",
  "description": "This is a complete guide to content calendars, including what it is, how they work, and examples.",
  "content": "Creating a Content CalendarWritten by Brian DeanLast updated Nov. 15, 2023What Is a Content Calendar? A content calendar (also known as an “editorial calendar”) is a written schedule of when and where you plan to publish upcoming content. Content calendars typically include upcoming pieces, status updates, planned promotional activity, partnerships, and updates to existing content. Download the Backlinko Content Calendar Template Why Are Content Calendars Important? If your blog is a hobby that you use to publish an occasional post, then you probably don’t need a content calendar. But if you’re using content marketing to grow your online business, then staying organized is key. Here are three ways that content calendars help your content marketing strategy: First, a content calendar ensures that all of your content-related tasks are actually happening. If you’re disorganized with your content production schedule, you’ll forget things. Or publish less often. Or neglect to update old articles. Put another way: a calendar ensures that nothing falls between the cracks. Second, a calendar makes it easier to collaborate with your team (and outside partners). If you’re a single-person blog, you may not even need a content calendar in the first place. But if employees and contractors contribute to your content, then you need something that keeps everyone on the same page. Today, our content calendar is more of a project management than an actual calendar (we use Notion). Third, a content calendar gives you a big picture overview of your upcoming stuff. As an example, we use our calendar to make sure that we don’t publish a bunch of case studies all at once. Or two guides that cover the same topic. That way, we can see our entire marketing strategy for the next few months on a single screen. Pretty cool. Best Practices Understand the Key Elements of a Content Calendar Yes, there are content calendar tools out there. And I’ll cover them later in this guide. But the fact is: content calendars don’t have to be complicated. After all, their job is to make things easier for you and your team. This means you can start off with a simple content calendar using Google Sheets. Here are the four items that every content calendar needs to have: Editorial The most important piece of your content calendar is Editorial. These are the pieces of content you’ll be publishing, whether on your own blog, on a podcast, or on social media. The main goal of your content calendar is to get your editorial pieces scheduled well in advance. That way, you can stay organized and consistent with your publishing schedule. Some companies have planned out their editorial content a full year in advance. Some independent bloggers might not know what they’re publishing next week. There’s no perfect amount of time that you need to have your content planned out in advance. I try to schedule things 6 months ahead. But I leave some room for flexibility since things can change quickly in the digital marketing world. As long as you have a single place that shows you what’s coming up, you’re good. Platform The platform is where your content calendar is hosted. Solo content creators have the most flexibility in choosing a tool, from pen and paper to Google Calendar to a simple spreadsheet. The most important thing is that it works for you. In fact, when I was a solo blogger, my editorial calendar was a simple Google Sheet with notes that only I could understand. But it’s a different story for content marketing teams. When you create content with a team, you can have 5, 10 or even 20 people that touch a piece of content before it goes live. So it’s critical that everyone can see the status of each post. Otherwise, you’re going to get overloaded with emails from people asking: “What’s that status on this video?” or “Are the visuals finished for this Facebook post yet?”. In fact, our last calendar in Google Sheets was designed specifically for collaboration. And this kind of thing isn’t just helpful for content marketing and SEO departments. It’s also a way to send new content that you’re working on to other people in your organization. And if you’re an agency or freelancer, you can link to your content calendar from Basecamp, Asana and Trello so that clients can keep tabs on what you’re working on. Promotional The next most important piece of your content calendar is Promotional. Promotional items are what they sound like: how you plan to promote your content. When will you be sharing it on Facebook? Do you have an upcoming podcast interview or Reddit AMA? Are you going to send a newsletter to your email subscribers? Those would be promotional activities for your content calendar. Promotional activities don’t necessarily need to be in a completely separate calendar from your editorial items. But it’s a good idea to title them differently or color-code them so you can easily tell them apart. Future Ideas This is a list of future content ideas that you’re not actively working on yet. For example, this could be a random topic that you thought of on your drive to work. Or something that came up during a brainstorming session. These ideas don’t usually show up in the calendar itself because they’re not scheduled yet. But you do need to do a “brain dump” of these ideas so you don’t lose them (or let them distract you from content that’s almost ready to go). Use a Content Calendar Tool There are tools out there that exist specifically for creating, managing, and collaborating on your content calendar. Depending on how much content you publish and how big your team is, you may want to invest in content calendar software. Here are some great options to try. Notion:the all-in-one workspace for your notes, tasks, wikis, and databases. Google Sheets: probably the most popular option for most individuals and small teams. Free and good for collaboration, but takes work to setup. Microsoft Excel: Microsoft has made their spreadsheets more collaboration-friendly than before. Google Calendar: if you’re a one-person operation, Google Calendar alone might be enough for you. Coschedule: plans range from an editorial calendar with 1-person access to a fully featured marketing suite for large enterprises. Recommended. Loomly: includes interactive guides for creating blog posts, automated social media posts, and more. Editorial Calendar plugin for WordPress: simple, drag-and-drop, and free. However, relies on when you have posts actually scheduled in WordPress — which may not be right for everyone. Basecamp, Trello, Slack, and Asana: designed as project management and communication tools rather than for content calendars, any of these three can be used either for task-management purposes. And with a little creativity, you can also use them as content calendars. Add Items to Your Calendar This is where the rubber meets the road. Actually creating a content calendar may seem daunting if you’ve never done it before. But once you have things organized for the first time, you’ll see just how helpful an editorial calendar can be. Here’s how to create a content calendar on any platform: Step #1: Make a list of your content ideas. If you write about a variety of topics, it may help to categorize them as you go. But you can just list them out. Step #2: Decide on a publication frequency. This frequency depends on your specific content strategy. If you’re creating more of a social media calendar, you might publish multiple posts per day. But if it’s for a blog, you may only publish 3-4 posts per month. (If you’re using a spreadsheet, you can have different levels of detail on different tabs for “monthly vs weekly” or “blog vs. LinkedIn”) Step #3: Use your list of content ideas to fill in your dates, according to the frequency you just established. Here’s a content calendar template you can refer to and use. Schedule Every Part of the Creation Process Most content calendars only include the title of the post and the date that it’s going live. Which is fine for simple content pieces (like case studies). But you publish larger or more complex projects, you might want to schedule out all of the steps of the content creation process in your calendar. In other words, instead of a calendar that looks like this: It will look more like this: For example, we’ve been publishing more and more research-focused content on our blog lately. And unlike a list post, research-based content requires a lot of work from lots of people. And in some cases, the work needs to be done in “assembly-line style”. In other words: one element can’t start until the previous one is 100% complete. To give you an example, we design lots of visuals and charts for our research posts. We obviously can’t make these charts until the data comes in. So “data collection and analysis” needs to be scheduled before design. This is especially important if you’re working with a team. With a team, you have different people responsible for different parts of a single piece of content. Scheduling out the important dates for each step in advance can help you stay on track. Here’s how to do it: Step #1: Write down a list of every type of content you publish. Most of the time you might publish short opinion articles, but when you publish larger case studies the workflow might be completely different. If you dabble in different formats (like video and podcasts) I recommend jotting that down too. Step #2: Break out each of those content types into the steps it takes to create it. For example, my typical blog post creation process consists of four steps: keyword research, outlining, writing the content itself, and design. While for my videos, the process is: find a topic, write a script, film the video, edit the content and add graphics. Step #3: Add each step to your calendar. If you have a team, include the name of the person who is responsible for completing it next to each step. Include More than Just New Blog Posts Content calendars can be used for much more than just scheduling different types of content. Here are a few things you should include in your content calendar to make it more robust and useful: Content updates. It’s important to keep your content fresh. So for pieces that are easy to edit (like blog posts) you should include future updates in your calendar. Site-wide content audits. Sometimes older content can do more harm than good. Britney Muller found that de-indexing 75% of Moz’s content actually increased their overall search traffic. Schedule and promote your off-site work, too. Whenever you do a guest post, podcast interview, live talk, or any other kind of off-site promo, include that in your content calendar too. Learn More Smartsheet’s Marketing and Content Calendar Templates for Excel: A list of high-quality content calendar templates that you can download and use for different content types. How to Create a Content Calendar: Video that shows you how Hootsuite goes about setting up their social media content calendar. Behind the Scenes—My Editorial Calendar and the Tools I Use: A real-life case study of how one blogger (Pat Flynn) uses an editorial calendar to help his social media marketing and blogging stay on track.",
  "headers": [
    {
      "level": "H3",
      "text": "Semrush helps you:"
    },
    {
      "level": "H3",
      "text": "Backlinko readers get:"
    },
    {
      "level": "H2",
      "text": "Grow your online visibility.\r\nOn all key channels.\r\nFrom just one platform."
    },
    {
      "level": "H1",
      "text": "Creating a Content Calendar"
    },
    {
      "level": "H3",
      "text": "What Is a Content Calendar?"
    },
    {
      "level": "H3",
      "text": "Why Are Content Calendars Important?"
    },
    {
      "level": "H3",
      "text": "Best Practices"
    },
    {
      "level": "H4",
      "text": "Understand the Key Elements of a Content Calendar"
    },
    {
      "level": "H4",
      "text": "Use a Content Calendar Tool"
    },
    {
      "level": "H4",
      "text": "Add Items to Your Calendar"
    },
    {
      "level": "H4",
      "text": "Schedule Every Part of the Creation Process"
    },
    {
      "level": "H4",
      "text": "Include More than Just New Blog Posts"
    },
    {
      "level": "H4",
      "text": "Learn"
    },
    {
      "level": "H4",
      "text": "Company"
    },
    {
      "level": "H4",
      "text": "Connect"
    }
  ],
  "author": ""
}