{
  "url": "https://backlinko.com/hub/content/google-trends",
  "slug": "google-trends",
  "title": "Google Trends: What Is It & How to Use It for SEO",
  "description": "Learn how to use Google Trends for keyword research, on-page SEO and more.",
  "content": "Google TrendsWritten by Brian DeanLast updated Sep. 20, 2024What Is Google Trends? Google Trends is a free tool from Google that provides data and graphs on the popularity of specific searches in Google and YouTube. Google first launched Google Trends in 2006. The most recent version of Google Trends was released in March 2023. How to Use Google Trends for SEO 1. Find Search Volume Trends This is the keyword research feature that we all know and love. Type a keyword into Google Trends… …and see that keyword’s trend over the last year. This feature is SUPER helpful. Why? Two reasons: First, you can easily find keywords that are becoming super popular. That way, you can create content around keywords that more and more people are searching for. For example, check out the trend for the term: “solar eclipse”. (Fun Fact: The Apr 8, 2024 total solar eclipse will be the first in the continental U.S. in 7 years.) As you can see, this keyword is blowing up right now. But if you only used a traditional keyword research tool, you wouldn’t see the trend. Just the raw search volume number. In fact, Semrush says that this keyword gets 201k search per month. That’s probably true, for most of the year. But thanks to Google Trends, we know that this 201k number is only going up and to the right. Which makes this an excellent keyword to get in on right now. Second, Google Trends can help you AVOID keywords that are becoming less popular. For example, let’s say you wanted to create a post about “business dashboards”. Well, according to Google Trends, that keyword is fading fast. So you probably want to go with another keyword. Pro Tip: Expand the timeframe to the last 2-3 years. By default, Google Trends data is from the last 12 months. But it’s hard to tell the difference between trends and fads. This is why I recommend looking at the trend over the last 2-3 years instead. Expanding the date range also helps you avoid seasonal keywords. If you only look at the last 12 months, seasonal keywords can look like legit, trending terms. But when you expand the timeline, you can spot keywords that have yearly seasonality spikes. 2. Find Related Keywords This is actually my favorite feature inside of Google Trends. Sure, it’s nice to see how a keyword is trending. But you can get pretty much the same data from the Google Keyword Planner. What makes Google Trends REALLY powerful is the fact that it bubbles up new, trending keywords. Here’s how to do it: First, run a Google Trends search just like you normally would. Then, scroll down to the “Related queries” table: This is Google’s list of keywords that they consider closely related to what you just typed in. But these aren’t just any old search terms. They’re trending keywords. In fact, Google will show you the exact % search volume increase for the related searches on the list. Nice. 3. Find “Breakout” Keywords You might have noticed that Google sometimes replaces a % growth with the word “breakout”. What the heck is that? According to Google, “breakout” means that Google doesn’t have enough search volume data for a meaningful “before” and “after” % difference. So for any search term that’s growing more than 5000%, they mark it as “breakout” instead of noting the exact percentage. In my experience, these “breakout” keywords are some of the best keywords out there. Why? Because they’re not competitive yet! This means you can get a foothold on Google’s first page before the keyword goes mainstream. For example, look at the breakout search term “how to add hashtags to YouTube videos”. Even though this search term is already super popular, it only has a keyword difficulty score of 1. Which means that you can rank high on Google for this keyword without a ton of backlinks. Then, when the keyword goes mainstream, you’ll be sitting pretty at the top of Google’s search results. The downside of this approach is that some of these breakout keywords are fads. They’ll grow for a few months… and completely die off. So I don’t recommend centering your entire business around a breakout keyword. But if you create a single blog post or YouTube video around a breakout keyword that ultimately dies off? Oh well. You at least got a few months of traffic from that content. And if a breakout keyword continues to rise, you have an SEO first-mover advantage that’s going to make it tough for anyone else to come in and outrank you. 4. Uncover Related Topics for Blog and Video Content I just showed you how to use Google trends to find related search queries. But you can also use it to find related topics. I’ll explain… Google has a table next to “Related queries” called “Related topics”. This is the same idea as “Related queries”. But instead of focusing on specific searches, this shows you which broad topics people are searching for. For example, let’s look at the “Related Topics” results for OMAD. These are all topics that Google considers closely related to the term you just typed in. And you can create an entire series of blog posts, videos or social media posts on these related topics. Of course, you still need to drill down for each of these topics to find specific keywords. But the topics help you find related topics that are hard to come up with on your own. Pro Tip: Toggle “Rising” to “Top”. “Top” will bring up topics that aren’t necessarily growing. But they consistently get a large number of monthly searches. 5. Find Keywords for YouTube Videos Most people use Google Trends to find keywords that people use in Google’s search engine. But Google Trends is also GREAT for YouTube keyword research. To use Google Trends for video keyword research, type in a keyword that you optimize a video around. Then, use the dropdown menu to switch from “Web Search” to “YouTube Search”. And just like that, you can see whether or not this keyword is trending on YouTube. Pretty cool. 6. Uncover Local Search Trends If you run a local business that serves a specific area in the United States, then you definitely want to check out “Interest by subregion”. This feature shows you that keyword’s trend in different states, cities and subregions. Why is this important? Well, let’s say that you run a restaurant. And you’re considering a new line of keto diet desserts. Well, as you can see in Google Trends, Google search volume for this keyword varies A LOT between different states. And regions: This feature can also help you find keywords to target for local SEO. As an example, if you’re considering optimizing your local site around the term “office yoga”, you’d definitely want to check out the search interest in your city first. If you notice that more people are searching for this service in your city, then you probably want to sprinkle that keyword onto your site and your GMB profile. 7. Discover Completely New Keyword Ideas You can use Google Trends for SEO without having to search for a specific keyword. I’m talking about “Trending Searches”. This feature shows you real-time data for searches that have spiked over the last 24 hours. The downside of using this feature for keyword research is that most of these keywords are very short-term fads. In most cases, it’s not even worth creating a blog post around. But once and a while you’ll come across a keyword or topic that’s not a 24-hour fad. For example, a few years ago I found the term “iPhone 11”: This keyword had real staying power. And because the keyword was brand new, it was a term that would be hard to find in any traditional keyword tool. Pro Tip: Use the “category” drop-down menu to find trending searches in your industry. In my experience, this tends to weed out a lot of the news-focused keywords that don’t last. 8. Tap Into LSI Keywords Google Trends can also help you with your on-page SEO. How? By showing you LSI keywords. For example, let’s say that you just wrote a post about Nitro coffee. Well, you can use the “Related queries” and “Related Topics” sections to find terms that Google considers closely tied to your target keyword. And all you need to do is add these terms to your content where it makes sense. Learn More How to use Google Trends to Find Sizzling Hot Topic Ideas: A video tutorial that shows you how to use Google Trends for keyword research and content marketing. Advanced Keyword Research Tutorial: Learn how to find keywords using forums, popular tools, and more.",
  "headers": [
    {
      "level": "H3",
      "text": "Semrush helps you:"
    },
    {
      "level": "H3",
      "text": "Backlinko readers get:"
    },
    {
      "level": "H2",
      "text": "Grow your online visibility.\r\nOn all key channels.\r\nFrom just one platform."
    },
    {
      "level": "H1",
      "text": "Google Trends"
    },
    {
      "level": "H3",
      "text": "What Is Google Trends?"
    },
    {
      "level": "H3",
      "text": "How to Use Google Trends for SEO"
    },
    {
      "level": "H4",
      "text": "1. Find Search Volume Trends"
    },
    {
      "level": "H4",
      "text": "2. Find Related Keywords"
    },
    {
      "level": "H4",
      "text": "3. Find “Breakout” Keywords"
    },
    {
      "level": "H4",
      "text": "4. Uncover Related Topics for Blog and Video Content"
    },
    {
      "level": "H4",
      "text": "5. Find Keywords for YouTube Videos"
    },
    {
      "level": "H4",
      "text": "6. Uncover Local Search Trends"
    },
    {
      "level": "H4",
      "text": "7. Discover Completely New Keyword Ideas"
    },
    {
      "level": "H4",
      "text": "8. Tap Into LSI Keywords"
    },
    {
      "level": "H4",
      "text": "Learn"
    },
    {
      "level": "H4",
      "text": "Company"
    },
    {
      "level": "H4",
      "text": "Connect"
    }
  ],
  "author": ""
}