{
  "url": "https://backlinko.com/hub/content/listicles",
  "slug": "listicles",
  "title": "How to Write a Great Listicle Post",
  "description": "Everything you need to know about writing Listicles that get traffic and social shares.",
  "content": "ListiclesWritten by Brian DeanLast updated Jun. 21, 2024What Are Listicles? Listicles (also known as “list posts”) are articles that are written in a list-based format. The most common form of listicle is a short list of 10 to 20 items that are based on a specific theme. However, modern listicles are often enhanced with additional information around each item to make them more useful. Why Do Listicles Work So Well? Here’s why listicles remain such a popular blog post format: People Are in a Hurry The same way bullet points can help people quickly scan the most important pieces of information, a listicle is easy to scan and consume. Which makes them perfect for folks with short attention spans. Easy to Write From the perspective of content creators, listicles are super easy to write (especially compared to other blog post formats, like ultimate guides and case studies). All you need to do is list 10 to 20 items, fill in a few blanks, and you’re done. And depending on the list, sometimes you’re just curating stuff that’s already out there. Easy to Preview There’s a reason magazine covers use numbered lists in their copy. A specific number helps readers understand what they’re in for before they click. And a list post title like “15 Ways to Grow Your Blog” has a preview built right into it. Comprehensive Not all list posts are short and sweet. It’s possible to create listicles that put everything someone needs to know about something on a single page. For example, take a look at my list of Google’s 200+ ranking factors. With a list like that, you’re aiming to create THE single authoritative collection of items. Here’s another example of a comprehensive listicle from our blog. And this “Complete Listicle” can work in just about any niche. For example, a fitness instructor could create a list of every keto-friendly food and its nutritional values. Or a dog trainer could create a list of every U.S.-based dog toy brand. You get the idea. Best Practices for Creating High-Performing Listicles Choose a Format For Your Listicle Listicles can take many forms. So, your first step is to figure out what format you’re going to use. Here are a few different types of listicles. The Simple List The simple list is just like it sounds: It’s a short-and-sweet list of travel destinations, artwork, DSLR cameras, content marketing strategies, or just about any topic you can think of. Simple lists are what sites like Buzzfeed specialize in. Unfortunately, Buzzfeed’s content sometimes goes into clickbait territory (which is why, to some people, the term “listicle” has a negative connotation). But there’s no reason your list post can’t underpromise and overdeliver. Because the content on simple lists tends to be pretty thin, they’re not great for SEO. But they tend to do really well on social media. The Expanded List Post The expanded list post is like a regular list post with a twist. You see, most listicles go from item #1 to item #2 to item #3 without a whole lot of detail for each one. But with an expanded list post, you add more meat to each tip, strategy, or tool on your list. That way, your readers will have the information they need to take action on one of the items immediately. Expanded list posts are best for practical, how-to style content. For example, this list of ways to get more traffic contains lots of detail underneath each subheading on your list. That way, there’s no guesswork or extra research required. You can literally have this post open in one tab while you execute the technique in another tab. “Best of” List Posts “Best of” List Posts are a super-effective form of “ego bait”. With a “Best of” list post, you list out the best people, bloggers, quotes or resources on a given subject. Then, let people know that they’ve been featured. For example, some time ago Ahrefs listed their favorite SEO blogs. And because I was one of the bloggers that they featured, Ahrefs reached out to me. I was flattered to be on the list. So I shared their post all over the place. You can even “gamify” your list by asking people to vote on their favorite. In fact, that’s what Ahrefs did with their list. How about another example? When I published a list of the best SEO tools, I contacted the people behind each tool. And because I featured them and their tool, many of them happily shared my content on social media. Choose a Topic Now that you have a format for your listicle, it’s time to find a topic. Like any piece of content, choosing the right topic is super important for your listicle. That’s because listicles only really work with certain topics. Specifically, listicles work best for topics that lend themselves to being featured in a “collection.” For example, some time ago, we published a guide to writing a blog post. The topic “writing a blog post” doesn’t really make sense for a list post. So, we created a guide instead. On the other hand, we recently published this list post with 11 strategies for promoting your ecommerce site. This topic was PERFECT for a list article because it allowed us to list simple tips people could easily use and try out. Here are some ways to find topics for your listicles. Use BuzzSumo BuzzSumo makes it easy to find topics that are getting lots of shares. In fact, you can even sort the results to only show list posts. Very cool. Your Own Expertise: What topics could you EASILY create a listicle around? For example, I’ve spent a lot of time building up my YouTube channel. Along the way, I’ve picked up dozens of little tips and hacks that have helped me. And I share those little bite-sized lessons in listicle form. Keywords: Do keyword research to figure out what people are already searching for. And zero in on keywords that would be ideal for a listicle. For example, take a keyword like “link building.” If you look at the search results for that keyword in Google, you can see that there are no list posts to be found. This means that this keyword probably isn’t a good fit for a list post (at least when it comes to SEO). On the other hand, check our the SERPs for “SEO tips”. It’s almost all list posts. This means that a high-quality listicle around this keyword has a good chance of ranking highly on Google. Create a Roundup With Influencers This is similar to the “Best of” listicle format that we covered earlier. The difference here is that, instead of curating what’s already out there, you collect new quotes from influencers and experts in your industry. Here’s an example: This technique can be used to create a standalone list of quotes, pieces of advice, favorite tools, or to add quotes to a list you’ve already created. The idea here is that you’re teaming up with people who know what they’re talking about. Which gives your post instant credibility. Now you might be wondering: “Why would an influencer want to contribute to my roundup?.” Exposure. Traffic. And a link to their blog. That’s not to say that you’ll get a 100% response rate. But if your email outreach makes the benefits of contributing super clear, you have a good chance of getting a response. Then, once they contribute, let them know that your post is live so they’ll share it. Pro Tip: Use Click to Tweet to provide each influencer a pre-populated Tweet link. Give Your Listicle Extra Detail Most listicles don’t include very much detail. That’s not always a bad thing. Sometimes people just want to quickly scan a short list. But if you want your listicle to stand out, get attention, and rank in Google, I highly recommend adding some content underneath each item on your list. For example, the Expanded List Post that I mentioned earlier is not quite as easy to scan… but it includes much more detail than a regular list post. So, when you add detailed content to each item, your content has the best of both worlds: it presents different tips or pieces of information in a single article. And is typically more useful to readers than a basic, short list post. The exact type of detail you add depends on your topic. But here are a few details you can add to your listicle items to beef them up a little bit. Actionable steps Screenshots Extra context Examples Visualizations Video tutorials Infographics Listicle Tips and Advanced Strategies Make Your Listicle 10x Better than the Competition Do what you can to make your listicle a piece of “10x Content”. Make it longer and more comprehensive than the competition, give it all the extra details I mentioned above, and give it a pro design. There’s no reason a listicle can’t blow people away. Add Filters Add filters to your listicles to make it easy for someone to find what they’re looking for. For example, this excellent list of infographics from Siege Media categorizes all 100 infographics on their list. Include the Number of Items in Your Headline Whenever it makes sense, include the number of list items in your blog post title. That way, potential readers have a solid idea of what your list post will look like. Audit Your Competitors’ Backlinks Once your list is live, use a tool like Semrush’s Backlink Gap to see who links to your competitors’ content but not to yours. Then, contact them to tell them about your listicle. Note: A free Semrush account gives you up to 10 credits per day with this tool. Or you can use this link to access a 14-day trial on a Semrush Pro subscription. Create an Outreach Campaign Reach out to people who you mentioned or linked to in your list post. This doesn’t guarantee they’ll share it. But it gets your content in front of people in a non-pushy way. Experiment with Content Formats Listicles are a great way to engage your audience. But it’s important to experiment with various content formats to attract readers at every stage of the customer journey. Learn different types of content marketing that will help you engage, convert, and retain your audience. From videos to white papers. Learn More Viral Content: As Buzzfeed discovered, listicles have a good chance of going viral. And the techniques in this guide may help your list post get more social shares. The Definitive Guide to Copywriting: When it comes to writing a listicle, your copy needs to be short and snappy. This guide will help you write listicles that people actually want to read. 17 Ways to Improve SEO Rankings: A good example of the Expanded List Post that we talked about in this guide.",
  "headers": [
    {
      "level": "H3",
      "text": "Semrush helps you:"
    },
    {
      "level": "H3",
      "text": "Backlinko readers get:"
    },
    {
      "level": "H2",
      "text": "Grow your online visibility.\r\nOn all key channels.\r\nFrom just one platform."
    },
    {
      "level": "H1",
      "text": "Listicles"
    },
    {
      "level": "H3",
      "text": "What Are Listicles?"
    },
    {
      "level": "H3",
      "text": "Why Do Listicles Work So Well?"
    },
    {
      "level": "H4",
      "text": "People Are in a Hurry"
    },
    {
      "level": "H4",
      "text": "Easy to Write"
    },
    {
      "level": "H4",
      "text": "Easy to Preview"
    },
    {
      "level": "H4",
      "text": "Comprehensive"
    },
    {
      "level": "H3",
      "text": "Best Practices for Creating High-Performing Listicles"
    },
    {
      "level": "H4",
      "text": "Choose a Format For Your Listicle"
    },
    {
      "level": "H4",
      "text": "Choose a Topic"
    },
    {
      "level": "H4",
      "text": "Create a Roundup With Influencers"
    },
    {
      "level": "H4",
      "text": "Give Your Listicle Extra Detail"
    },
    {
      "level": "H3",
      "text": "Listicle Tips and Advanced Strategies"
    },
    {
      "level": "H4",
      "text": "Make Your Listicle 10x Better than the Competition"
    },
    {
      "level": "H4",
      "text": "Add Filters"
    },
    {
      "level": "H4",
      "text": "Include the Number of Items in Your Headline"
    },
    {
      "level": "H4",
      "text": "Audit Your Competitors’ Backlinks"
    },
    {
      "level": "H4",
      "text": "Create an Outreach Campaign"
    },
    {
      "level": "H3",
      "text": "Experiment with Content Formats"
    },
    {
      "level": "H4",
      "text": "Learn"
    },
    {
      "level": "H4",
      "text": "Company"
    },
    {
      "level": "H4",
      "text": "Connect"
    }
  ],
  "author": ""
}