{
  "url": "https://backlinko.com/hub/content/written-content",
  "slug": "written-content",
  "title": "Blogging and Written Content",
  "description": "This is a library of expert-written resources to help you create blog content that people want to share and link to.",
  "content": "OverviewWith the growth of podcasting and video, it might seem like blogging might be dying. Fortunately, that’s far from the case. In fact, according to HubSpot, 60% of digital marketers consider their blog a “top priority”. But with millions of blogs already out there, how do you create blog content that people will actually read? To do that, you need to create and promote epic blog posts that blow people’s minds. Easier said than done? Sure. But the resources in this section can help you get there. This page contains a library of resources to help you publish blog content that drives traffic, shares and leads to your site.Fundamentals of Web CopywritingThis is a complete guide to web copywriting, including tips, examples, helpful strategies, and more. Explore this Resource10x ContentLearn everything you need to know about 10x content right here, including lots of examples. Explore this ResourceListiclesEverything you need to know about writing Listicles that get traffic and social shares. Explore this ResourceContent CurationEverything you need to know about content curation, including what is is and why it can help you get more traffic from your content marketing. Explore this ResourceLead MagnetsLearn how to use Lead Magnets to build your email list in record time. Explore this Resource",
  "headers": [
    {
      "level": "H3",
      "text": "Semrush helps you:"
    },
    {
      "level": "H3",
      "text": "Backlinko readers get:"
    },
    {
      "level": "H2",
      "text": "Grow your online visibility.\r\nOn all key channels.\r\nFrom just one platform."
    },
    {
      "level": "H1",
      "text": "Blogging and Written Content"
    },
    {
      "level": "H4",
      "text": "Learn"
    },
    {
      "level": "H4",
      "text": "Company"
    },
    {
      "level": "H4",
      "text": "Connect"
    }
  ],
  "author": ""
}