{
  "url": "https://www.semrush.com/blog/amazon-pricing-study/",
  "title": "Amazon Pricing Strategies Study",
  "content": "As the world’s largest ecommerce company, Amazon often dictates the rules within the industry, whether it’s the site design, delivery terms, or even pricing.\n\nWith other e-tailers following its lead, Amazon serves as the golden standard within ecommerce. This means that when it comes to one of the most crucial aspects of any e-business—setting prices to a product—any online retailer should know Amazon’s pricing patterns and strategies inside out.\n\nThat’s why we decided to go all data-driven and use Semrush and its tools for Amazon to explore the general pricing landscape of the marketplace, as well as specific strategies and tactics. \n\nAmazon Pricing Study: Key Highlights\n\nJust as Amazon vendors entice you to buy their products with lower prices, seasonal discounts, and other tricks, we’ll unwrap some of the most interesting findings before you get into the full study:\n\nAs it turns out, some of those impressive discounts we saw during the hottest sales seasons aren’t that real: some vendors artificially spike the original price quoted, just to show a more staggering discount.\nIn general (with some exceptions, of course), goods have the biggest discounts during the Black Friday sales have higher-than-average prices during the Christmas sales—and vice versa.\nThe biggest sales seasons—Black Friday and Christmas—actually don’t come with significant price drops. It may simply be the classical supply and demand driving the prices up, but that’s contrary to what is usually expected in the season. Supply chain issues we were seeing for the past two years, however, could have exacerbated this.\nWhile the average price of all the analyzed products did drop during Black Friday (by a low 4% margin), it actually grew by the very same 4% during Christmas.\n\nThese are just some of the discoveries, so read on as we’ve kept some of the biggest gems for last.\n\nAbout the Amazon Pricing Study\n\nWith more than 12 million products on Amazon, it’s near to impossible to analyze every single product.\n\nWe established the 700 most popular products on Amazon (based on Amazon keyword* search volume numbers from Keyword Wizard for Amazon) and placed them into 10 categories to determine both product- and category-specific pricing patterns.\n\nEach product search returned from 20 to 70 results**, which we analyzed in great detail—all to get a realistic overview of the pricing landscape of each product and category.\n\n*We analyzed Amazon’s search results for the top keywords, but further on, we’ll be using the term “product” to either refer to specific products or product types.\n\n**The search results were collected every hour from November 18, 2021 to January 11, 2022.\n\nEverything You Wanted to Know About Amazon’s Pricing Patterns\n\nOur Amazon pricing study reveals answers to some of the hottest questions about the top pricing strategies in the marketplace—based on the pricing patterns of the most in-demand products and product categories:\n\nWhat’s the average product/category price and how does it change over time (if at all)?\nWhich products are more volatile in terms of pricing?\nAre there any high- or low-price days on Amazon?\nWhat’s the price difference between ‘normal’ days and the hottest sales seasons (e.g. Black Friday, pre-Christmas, January sales, etc.)?\nIs there a difference between the original price mentioned and the actual price of a discounted product?\nAre there any specific pricing patterns for the highest-price hours and/or weekdays?\nWhat are the most popular coupons or deals, and are they category specific?\n\nCurious to see the answers? Read on.\n\nIs It Okay to Sell Higher-Priced Items on Amazon?\nAverage Prices for the Most Popular Amazon Products\n\nOur study showed that the average product price across all categories is $142.74. But while Amazon is often loved for its lower-priced goods, our list of most popular products also features items that are on the high-price end of the spectrum.\n\n15 Most Expensive Amazon Items (among the most popular products list)\n\nProduct / Product type\n\n\t\n\nAverage price\n\n\n\n\nrtx 3080\n\n\t\n\n$2,414\n\n\n\n\ngaming pc\n\n\t\n\n$1,586\n\n\n\n\nrtx 3070\n\n\t\n\n$1,543\n\n\n\n\npc gaming\n\n\t\n\n$1,253\n\n\n\n\ngaming laptop\n\n\t\n\n$1,242\n\n\n\n\nsamsung tv\n\n\t\n\n$1,144\n\n\n\n\npc\n\n\t\n\n$1,060\n\n\n\n\ngraphics card\n\n\t\n\n$1,006\n\n\n\n\nmacbook pro\n\n\t\n\n$979\n\n\n\n\n65 inch tv\n\n\t\n\n$966\n\n\n\n\ntv\n\n\t\n\n$889\n\n\n\n\nlenovo laptop\n\n\t\n\n$817\n\n\n\n\n4k tv\n\n\t\n\n$814\n\n\n\n\namazon gift card\n\n\t\n\n$812\n\n\n\n\ntelevision\n\n\t\n\n$795\n\nApart from the Amazon gift card, all the products within the most expensive category are tech-related, with gaming products dominating the list.\n\nAs the past year has been marked by growing prices for computer components, the top 15 features three types of graphics cards.\n\nIf you want a more nuanced look, here’s a list of the most expensive products on an ASIN (aka product listing) level:\n\nASIN\n\n\t\n\nTitle\n\n\t\n\nAverage Price***\n\n\n\n\nB091G92D34\n\n\t\n\nSony VW1025ES 4K HDR Laser Home Theater Video Projector VPL-VW1025ES\n\n\t\n\n$39,998\n\n\n\n\nB08NXGZXTL\n\n\t\n\nFly YUTING Boss Office Chair Game Cockpit,Gaming Chair Ergonomic Office Chair PC Chair with Massage Lumbar Support, PU Leather High Back with Footrest,C\n\n\t\n\n$39,000\n\n\n\n\nB097BS9QHH\n\n\t\n\nJFF Game Cockpit,Office Chair Gaming Chair Ergonomic Office Chair PC Chair with Massage Lumbar Support, PU Leather High Back with Footrest, White\n\n\t\n\n$38,100\n\n\n\n\nB097BQLMQN\n\n\t\n\nJFF Game Cockpit,Office Chair Gaming Chair Ergonomic Office Chair PC Chair with Massage Lumbar Support, PU Leather High Back with Footrest, Gray\n\n\t\n\n$38,100\n\n\n\n\nB08NXF5KB4\n\n\t\n\nFly YUTING Boss Office Chair Game Cockpit, Gaming Chair Ergonomic Office Chair PC Chair with Massage Lumbar Support, PU Leather High Back with Footrest, B\n\n\t\n\n$36,000\n\n\n\n\nB09N1CMTWB\n\n\t\n\nEcobot Intelligent Automatic Cleaning Robot for Commercial Smart Vacuum Robot Cleaner\n\n\t\n\n$35,999\n\n\n\n\nB07GM3J6SH\n\n\t\n\nSony 4K HDR Laser Home Theater Video Projector (VPLVW995ES)\n\n\t\n\n$28,673\n\n\n\n\nB091YBSWF1\n\n\t\n\nTOPESEL 256GB Micro SD Card SDHC Memory Cards UHS-I TF Card Class 10 for Camera/Phone/Nintendo-Switch/Galaxy/Drone/Dash Cam/GOPRO/Tablet/PC/Computer(C10 U1 256GB)\n\n\t\n\n$28,000\n\n\n\n\nB09J49CN7X\n\n\t\n\nMZDJDM Gaming Chair, Zero-Gravity Scorpio Computer Cockpit, Gaming Lounge Chair, Integrated Gaming Table and Chair Space Capsule with Footrest Ergonomic Office Computer Black\n\n\t\n\n$27,154\n\n\n\n\nB09J48VMM2\n\n\t\n\nMZDJDM Ergonomic Gaming Chair High Back Computer Chair PU Leather Gaming Cabin with Adjustable Armrest Footrest with Headrest and Massage Lumbar Pillow (Black)\n\n\t\n\n$26,808\n\n\n\n\nB01MYWH09J\n\n\t\n\nPanasonic PT-RS11KU 12 000Lm/ Sxga/ 3-Chip DLP Laser Projector\n\n\t\n\n$24,999\n\n\n\n\nB074Z53X99\n\n\t\n\nSony VPLVW885ES 4K HDR Laser Home Theater Video Projector\n\n\t\n\n$24,998\n\n\n\n\nB07YP9CPF5\n\n\t\n\nLG SIGNATURE OLED88Z9PUA Alexa Built-in Z9 88\" 8K Ultra HD Smart OLED TV (2019)\n\n\t\n\n$24,330\n\n\n\n\nB09KH3292D\n\n\t\n\nWLGQ Gaming Chair, Zero-Gravity Scorpio Computer Cockpit, Gaming Lounge Chair, Integrated Gaming Table and Chair Space Capsule with Footrest Ergonomic Office Computer Black\n\n\t\n\n$24,154\n\n***The table above features pricing for specific products. The average pricing implies that we might have spotted a different price level over various time periods. \n\nOnce again, we can see that the most expensive products are all gaming related, with video projectors and gaming chairs topping the list.\n\nAmazon’s Most Expensive Product Categories\n\nWhile we’ve established that tech/digital products, and gaming especially, make up the most expensive category, what about the rest?\n\nSports goods are the second most expensive category, followed by Home & Garden. \n\nThe real decline in pricing occurs after the fourth priciest category—Entertainment. In fact, tech and digital products typically cost more than the products within the five cheapest categories combined. \n\nDoes the Product Price Change All That Often?\n\nWe analyzed product prices every single day over three months. This helped us pinpoint some daily pricing change patterns.\n\nWith the average product price being at $142.74, we did see some variations throughout the months. \n\nOn December 2, 2021, the average price went down to $132.84. On January 2, 2022, it jumped to $157.22.\n\nAlthough certain days in December did feature somewhat lower prices for the analyzed products, the graph above shows that there was no notable price drop during Black Friday or the winter holiday season (we’ll get to that a bit later).\n\nDoes Amazon Have Any Happy Hours / Happy Days?\n\nWhile the pricing volatility doesn’t look dramatic, day-to-day and hour-to-hour stats can reflect more significant shifts.\n\nA happy hour/day on Amazon would look different to sellers and buyers—the former would need to know when the pricing hits its peak, while the latter would love to find out the “cheapest” options.\n\nWe analyzed the pricing for all the products and managed to pinpoint certain days and hours that repeatedly feature the highest and lowest prices—all to understand whether there are any set pricing patterns. \n\n5 pm–2 am Sales Bring in the Most Cash\n\nIf you want to sell your product at the highest price, try to encourage post-New Year sales.\n\nOur analysis showed that the most ‘expensive’ days for the majority of products were between January 1 and January 10, with January 4 featuring the highest prices.\n\nAnd if you manage to drive evening sales—anywhere between 5 pm and 2 am—you’d be in for the biggest win.\n\nMorning Sales Come With Lower Pricing \n\nAs we’ve unwrapped the most favorable days for Amazon sellers, we can also reveal the worst.\n\nDays around Black Friday (November 26)—especially a few days before (November 21–23) and a few days after (November 28–29)—came with the lowest prices across the board. \n\nA curious note: our analysis shows that the two days that preceded Black Friday, November 24–25, didn’t make it to the list of the cheapest days.\n\nTime-wise, we spotted that morning sales aren’t the best as the lowest product prices typically occur between 4 am and 12 pm.\n\nIf you want something more specific than time ranges, check the graph below.\n\nWhen we averaged the price over all of the products for each hour of the day, we spotted that the highest price occurs at 6 pm EDT and the lowest at midnight.\n\nThe Most ‘Expensive’ Days on Amazon for Various Product Categories\n\nThe data above reflects the best shopping and sales time across various Amazon products. Now, are there any patterns specific to each category?\n\n5% of the products saw peaking prices on January 1–2 and January 11, making them the most ‘expensive’ days across the analyzed period.\n\nThe ‘cheapest’ days were November 18 (9.4% of the products had the lowest average price), November 30 (5%), and November 29 (4%).\n\nOverall, the majority of categories seem to have the lowest prices around Black Friday. The top prices typically occur after the winter holidays.\n\nBrowse through the table below for a more granular view of the most expensive and cheapest days for each category.\n\nThe Most & Least Expensive Pricing Days Across Various Amazon Product Categories\n\nProduct Category\n\n\t\n\nHighest price\n\n\t\n\nLowest price\n\n\n\n\nbeauty & health\n\n\t\n\nJanuary 10, 2022\n\n\t\n\nNovember 30, 2021\n\n\n\n\nchristmas\n\n\t\n\nJanuary 3, 2022\n\n\t\n\nNovember 30, 2021\n\n\n\n\nentertainment\n\n\t\n\nNovember 29, 2021\n\n\t\n\nNovember 22, 2021\n\n\n\n\nfashion\n\n\t\n\nJanuary 11, 2022\n\n\t\n\nNovember 28, 2021\n\n\n\n\nfood\n\n\t\n\nDecember 29, 2021\n\n\t\n\nDecember 12, 2021\n\n\n\n\nhome & garden\n\n\t\n\nDecember 28, 2021\n\n\t\n\nDecember 6, 2021\n\n\n\n\nkids\n\n\t\n\nJanuary 2, 2022\n\n\t\n\nNovember 29, 2021\n\n\n\n\npets\n\n\t\n\nJanuary 5, 2022\n\n\t\n\nNovember 18, 2021\n\n\n\n\nsport\n\n\t\n\nJanuary 2, 2022\n\n\t\n\nDecember 1, 2021\n\n\n\n\ntech / digital\n\n\t\n\nJanuary 2, 2022\n\n\t\n\nDecember 2, 2021\n\n“I tend to find that lower-priced products sell better on Tuesdays whereas the high-priced sell better on Friday evenings or Sundays. Evening time—when most people have just got home from work—is a second screening time at home, so we can expect higher demand during these hours as well as a rise in prices.”\n\nWhich Amazon Products’ Prices Are More Volatile?\n\nWe answered the “when” side of pricing volatility, so now it’s time to address the “what.” \n\nTo discover the most price-volatile products on Amazon, we’ve calculated a variation coefficient that reflects the extent of price dispersion around each product’s mean price.\n\nFrom a quick look at the table below, you can immediately spot that it’s gaming products once again that dominate the list.\n\nProduct / Product type\n\n\t\n\nCoefficient of variation\n\n\n\n\nswitch games\n\n\t\n\n145%\n\n\n\n\nnintendo switch games\n\n\t\n\n132%\n\n\n\n\ngaming chair\n\n\t\n\n118%\n\n\n\n\nps5 playstation 5\n\n\t\n\n113%\n\n\n\n\nanimal crossing nintendo switch\n\n\t\n\n86%\n\n\n\n\nrings\n\n\t\n\n83%\n\n\n\n\nvinyl records\n\n\t\n\n75%\n\n\n\n\nxbox\n\n\t\n\n73%\n\n\n\n\nxbox controller\n\n\t\n\n71%\n\n\n\n\nxbox series x\n\n\t\n\n71%\n\n\n\n\nmasks disposable\n\n\t\n\n68%\n\n\n\n\nps5\n\n\t\n\n64%\n\n\n\n\nled lights for bedroom\n\n\t\n\n63%\n\n\n\n\nroku\n\n\t\n\n62%\n\n\n\n\nps5 console\n\n\t\n\n60%\n\nThe products you see in this table reflect expected supply and demand changes. \n\nAt the time, these items were out of stock in stores and that increased demand drove up the prices. As items come back in stock, the prices would drop quickly to match the retail pricing.\n\nThe graph below depicts the fluctuation of the pricing of the 10 most price-turbulent products: \n\nAre Holiday/Special Deals Just a Myth, and Does the Price Really Go Down During Hot Sale Seasons?\n\nNow that we understand some typical pricing patterns, it’s time to unveil what happens during the hottest sale seasons.\n\nAs customers see prices with strikethroughs and “special deal” labels, it’s intuitive to assume that the largest discounts take place during special occasions. \n\nBut does the price really drop all that much during the biggest discount dates? We looked at the pricing shifts during Black Friday and Christmas to find the answer.\n\nCan You Really Strike a Bargain During Black Friday?\n\nOur analysis shows that it doesn’t seem like the price drops a lot for hot sale seasons.\n\nLet’s consider pricing differences for Black Friday. We looked at the prices one week before one of the biggest discount days (19–25 November) and compared them against the prices in the following week (27 November–3 December).\n\nThe average product on Black Friday costs $137.46. This is only 4% lower than the average price overall ($142.74). \n\nAlso, compared to the week right before Black Friday, the Black Friday prices are only 0.5% lower, and then they seem to drop a little bit more (1.5% for the next 7 days).\n\nHere’s a depiction of the average pricing trend during the entire Black Friday period (19 November–3 December):\n\nAs you can see, there is no significant price drop even on the day of the biggest sales, Black Friday itself (November 26).\n\nProducts That Saw the Biggest Discounts During Black Friday\n\nLooking at specific products, the following had the largest price drops during the Black Friday period:\n\nProduct / Product type\n\n\t\n\nBF/overall Drop\n\n\n\n\nmicro sd card\n\n\t\n\n−76%\n\n\n\n\nwalkie talkies\n\n\t\n\n−70%\n\n\n\n\nalexa\n\n\t\n\n−65%\n\n\n\n\nprojector\n\n\t\n\n−57%\n\n\n\n\nalexa devices\n\n\t\n\n−54%\n\n\n\n\nrings\n\n\t\n\n−53%\n\n\n\n\nbooks for 3 year olds\n\n\t\n\n−53%\n\n\n\n\nbinoculars\n\n\t\n\n−40%\n\n\n\n\nminecraft\n\n\t\n\n−40%\n\n\n\n\nbathroom organizer\n\n\t\n\n−38%\n\n\n\n\nanimal crossing\n\n\t\n\n−37%\n\n\n\n\nwhole foods\n\n\t\n\n−37%\n\n\n\n\nearrings\n\n\t\n\n−37%\n\n\n\n\nnintendo switch games\n\n\t\n\n−35%\n\n\n\n\nhair dryer\n\n\t\n\n−34%\n\nAs you can see, this set is now filled with fewer tech/digital products, with more everyday items topping the list—walkie-talkies, books, binoculars, bathroom organizers, etc.\n\nDo the Prices Go Back Up Immediately After Black Friday Is Over?\n\nAs the graph above indicates, if the product has a significant price drop during Black Friday, it doesn’t go back up right after it.\n\nProducts You Shouldn’t Buy on Black Friday\n\nBlack Friday’s shopping craze allows some products to capitalize on this by simply increasing the pricing.\n\nWe can’t be sure whether vendors think a shopping-busy customer won’t notice the increase, but these products’ prices were actually higher on Black Friday than during the rest of the analyzed period:\n\nProduct / Product type\n\n\t\n\nBF/overall Growth\n\n\n\n\nvideo games\n\n\t\n\n118%\n\n\n\n\nhdmi cable\n\n\t\n\n76%\n\n\n\n\nps4\n\n\t\n\n58%\n\n\n\n\napple watch bands 40mm\n\n\t\n\n54%\n\n\n\n\nplaystation 4\n\n\t\n\n47%\n\n\n\n\napple\n\n\t\n\n44%\n\n\n\n\necho\n\n\t\n\n43%\n\n\n\n\nyeti\n\n\t\n\n42%\n\n\n\n\nchristmas decorations indoor\n\n\t\n\n40%\n\n\n\n\ntires\n\n\t\n\n38%\n\n\n\n\noculus quest 2\n\n\t\n\n38%\n\nIf you were waiting for Black Friday sales to buy a PS4 or Amazon Echo, our data says that was a bad idea. \n\nSome products do come with BF-inspired discounts (one week before) but actually increase the price on the day itself:\n\nProduct / Product type\n\n\t\n\nBF/before BF Growth\n\n\n\n\nvideo games\n\n\t\n\n107%\n\n\n\n\nxbox one games\n\n\t\n\n69%\n\n\n\n\nswitch games\n\n\t\n\n59%\n\n\n\n\nyeti\n\n\t\n\n57%\n\n\n\n\napple watch bands 40mm\n\n\t\n\n56%\n\n\n\n\ncinderella\n\n\t\n\n47%\n\n\n\n\nled lights for bedroom\n\n\t\n\n46%\n\n\n\n\nstar trek\n\n\t\n\n44%\n\n\n\n\nroblox\n\n\t\n\n43%\n\n\n\n\namazonbasics\n\n\t\n\n33%\n\n\n\n\nbathroom decor\n\n\t\n\n28%\n\nIf you were looking for some of the products in the table above, you should have considered purchasing them one week before Black Friday.\n\nThe graph below shows products that saw peaking prices on Black Friday if we compare the pricing one week before and after November 26. This implies that these vendors might have artificially increased the prices just for Black Friday: \n\nAll in all, anything gaming typically comes at a higher price around the Black Friday period, so don’t expect a good bargain there.\n\nIn the majority of cases, sellers have been taking Black Friday as an opportunity to win new customers, gain visibility, and achieve sales velocity without much focus on earning money.\nSome sellers, however, are using strategies that also help to capitalize on sales— they raise the prices of products 30 or 45 days before Black Friday and then apply high discounts. We can see this in the historical price movements of Keepa or CamelCamelCamel, for example.\nBut at least for the sellers I know and the products I have in pricing tracking, I think that Black Friday is still not seen as a period to bill a lot or make money, but as an opportunity to get more visibility.\n\nSome products saw peaking prices during Black Friday, but lowered the price straight after that:\n\nProduct / Product type\n\n\t\n\nAfter BF/BF Change\n\n\n\n\nvideo games\n\n\t\n\n−47%\n\n\n\n\nhdmi cable\n\n\t\n\n−41%\n\n\n\n\nyeti\n\n\t\n\n−41%\n\n\n\n\nchristmas\n\n\t\n\n−39%\n\n\n\n\nmasks disposable\n\n\t\n\n−34%\n\n\n\n\nxbox one games\n\n\t\n\n−34%\n\n\n\n\napple watch bands 40mm\n\n\t\n\n−33%\n\n\n\n\necho\n\n\t\n\n−32%\n\n\n\n\nchristmas decorations clearance\n\n\t\n\n−31%\n\n\n\n\ndog\n\n\t\n\n−30%\n\n\n\n\nps4\n\n\t\n\n−30%\n\n\n\n\nbathroom decor\n\n\t\n\n−29%\n\nDo Christmas Sales Come with Better Bargains?\n\nIf Black Friday at least came with some price drops—4% to be precise—Christmas sales led to even deeper disappointment from a customer perspective. \n\nTo our surprise, our data showed that…the average product price only increased during Christmas—by a whopping 4%—jumping to $148.57. \n\nOn Christmas itself, prices were 4.7% higher than during the week before and 2% higher than during the week after.\n\nHere’s an average product pricing trend during the Christmas period (17 December–2 January):\n\nOnly the following products came with a more or less notable price drop (comparing 24–26 December prices to the entire analyzed period):\n\nProduct / Product type\n\n\t\n\nChristmas / overall Drop\n\n\n\n\nalexa\n\n\t\n\n−46%\n\n\n\n\nps4 games\n\n\t\n\n−44%\n\n\n\n\nplaystation 4\n\n\t\n\n−42%\n\n\n\n\nplaystation 5 console\n\n\t\n\n−39%\n\n\n\n\napple watch series 3\n\n\t\n\n−32%\n\n\n\n\nps4\n\n\t\n\n−31%\n\n\n\n\nchristmas decorations clearance\n\n\t\n\n−29%\n\n\n\n\nmasks\n\n\t\n\n−27%\n\n\n\n\nhdmi cable\n\n\t\n\n−27%\n\n\n\n\nchristmas decorations\n\n\t\n\n−25%\n\n\n\n\nchristmas stockings\n\n\t\n\n−20%\n\n\n\n\noculus quest 2\n\n\t\n\n−19%\n\n\n\n\nxbox one controller\n\n\t\n\n−17%\n\n\n\n\nled christmas lights\n\n\t\n\n−16%\n\n\n\n\noutdoor christmas decorations\n\n\t\n\n−15%\n\nUnlike Black Friday, Christmas sales seem like a good time for anything PlayStation as well as Christmas-related goods (mainly decorations that won’t typically sell at any other time before the next holiday). \n\nFor a last-minute bargain, here’s a list of products that saw more significant price drops during Christmas itself compared to the average price from a week before:\n\nProduct / Product type\n\n\t\n\nChristmas/before\n\n\n\n\nps4 games\n\n\t\n\n−47%\n\n\n\n\nprojector\n\n\t\n\n−39%\n\n\n\n\ncovid 19 test kit at home\n\n\t\n\n−35%\n\n\n\n\nharry potter\n\n\t\n\n−31%\n\n\n\n\nplaystation 5 console\n\n\t\n\n−30%\n\n\n\n\nchristmas decorations outdoor\n\n\t\n\n−28%\n\n\n\n\nxbox series s\n\n\t\n\n−27%\n\n\n\n\nnintendo switch console\n\n\t\n\n−23%\n\n\n\n\nxbox controller\n\n\t\n\n−19%\n\n\n\n\nplaystation 4\n\n\t\n\n−18%\n\n\n\n\nxbox series x\n\n\t\n\n−18%\n\nHere are the products that came with the lowest price decrease during Christmas if we compare the pricing just a week before and after Christmas:\n\nAll in all, unlike Black Friday, Christmas looks like the best time to purchase gaming products.\n\nProducts That Saw the Biggest Price Growth During Christmas\n\nJust as with Black Friday, some products’ prices even grew throughout the winter holidays.\n\nHere’s a list of items that saw peaking prices over Christmas compared to the entire analyzed period: ​​\n\nProduct / Product type\n\n\t\n\nChristmas/overall Growth\n\n\n\n\nswitch games\n\n\t\n\n214%\n\n\n\n\nbathroom decor\n\n\t\n\n102%\n\n\n\n\nmasks disposable\n\n\t\n\n95%\n\n\n\n\nwalkie talkies\n\n\t\n\n68%\n\n\n\n\nmicro sd card\n\n\t\n\n61%\n\n\n\n\nbooks for 3 year olds\n\n\t\n\n55%\n\n\n\n\ncocomelon\n\n\t\n\n52%\n\n\n\n\nkitchen gadgets\n\n\t\n\n52%\n\n\n\n\ntelescope\n\n\t\n\n52%\n\n\n\n\nbinoculars\n\n\t\n\n51%\n\n\n\n\nbluetooth headphones\n\n\t\n\n51%\n\n\n\n\npens\n\n\t\n\n49%\n\n\n\n\ngaming chair\n\n\t\n\n45%\n\n\n\n\nxbox one games\n\n\t\n\n42%\n\nIf everyday products saw the largest price drops during Black Friday, over Christmas, they came with higher costs. \n\nFor instance, the very same binoculars that were discounted by more than 50% on Black Friday came with a 50% higher price on Christmas. The same with books for 3-year-olds, walkie-talkies, and some other products.\n\nThis means that we can see a counter-pattern: products that see the largest discounts on Black Friday typically cost more than usual at Christmas, and vice versa.\n\nAnother curious note is that if PlayStation products saw the biggest price drops at Christmas, Nintendo doesn’t follow its competitor’s footsteps. “Switch games” showed the biggest price growth.\n\nWhat Happens to Prices After Christmas?\n\nWe noted that some of the Christmas staples remain affordable throughout the holiday as some prices of typical Christmas products go up straight after the holidays are over.\n\nProduct / Product type\n\n\t\n\nChristmas/after\n\n\n\n\nalexa\n\n\t\n\n179%\n\n\n\n\nchristmas decorations clearance\n\n\t\n\n77%\n\n\n\n\nps4 games\n\n\t\n\n72%\n\n\n\n\nmasks\n\n\t\n\n65%\n\n\n\n\napple watch series 3\n\n\t\n\n59%\n\n\n\n\nalexa devices\n\n\t\n\n56%\n\n\n\n\nplaystation 5 console\n\n\t\n\n49%\n\n\n\n\nplaystation 4\n\n\t\n\n48%\n\n\n\n\nps4\n\n\t\n\n43%\n\n\n\n\nrings\n\n\t\n\n42%\n\nBut there are a few dates when buying Christmas-related goods would be a big no as we spotted two price peaks right before Christmas—December 22 at 3 pm; and December 27 at 4 am.\n\nA More Detailed Take on Black Friday Prices\n\nAs Black Friday came with more notable price drops, we decided to take a more nuanced look in terms of product pricing—to pinpoint products that come with the best bargains.\n\nAs it turned out, only 1.6% of all the analyzed products feature the lowest prices on November 26 itself.\n\nApparently, the best things to buy on Black Friday are popsockets and women’s lingerie. \n\nThe table below shows product categories with the biggest price drops on November 26: \n\nProduct / Product type\n\n\t\n\nAverage price\n\n\t\n\nPrice on BF\n\n\t\n\n% change\n\n\n\n\nair fryers best seller prime\n\n\t\n\n$111\n\n\t\n\n$102\n\n\t\n\n−8%\n\n\n\n\nbaby alive\n\n\t\n\n$28\n\n\t\n\n$23\n\n\t\n\n−18%\n\n\n\n\nbluetooth earbuds\n\n\t\n\n$72\n\n\t\n\n$58\n\n\t\n\n−19%\n\n\n\n\njeans for women\n\n\t\n\n$43\n\n\t\n\n$37\n\n\t\n\n−14%\n\n\n\n\nlingerie\n\n\t\n\n$20\n\n\t\n\n$17\n\n\t\n\n−15%\n\n\n\n\nlingerie for women\n\n\t\n\n$21\n\n\t\n\n$17\n\n\t\n\n−19%\n\n\n\n\nmassager\n\n\t\n\n$91\n\n\t\n\n$77\n\n\t\n\n−15%\n\n\n\n\nmens sweatpants\n\n\t\n\n$32\n\n\t\n\n$29\n\n\t\n\n−9%\n\n\n\n\npopsocket\n\n\t\n\n$13\n\n\t\n\n$10\n\n\t\n\n−23%\n\n\n\n\nshark vacuum\n\n\t\n\n$229\n\n\t\n\n$197\n\n\t\n\n−14%\n\n\n\n\numbrella\n\n\t\n\n$28\n\n\t\n\n$26\n\n\t\n\n−7%\n\nAre the Discounts Even Real?\n\nAs for specific products (aka product listings), customers rely a lot on notions like “best value”—a label that shows how much a product was worth before the lowered price. \n\nHere’s a run through of the most discounted products customers were seeing this Black Friday:\n\nASIN\n\n\t\n\nTitle\n\n\t\n\nBase value\n\n\t\n\nActual price (on Black Friday)\n\n\t\n\n% difference\n\n\t\n\ndifference\n\n\n\n\nB08YGY223S\n\n\t\n\nSAMSUNG 75-Inch Class Terrace Full Sun Outdoor QLED 4K Smart TV with Alexa Built-in (QN75LST9TAFXZA, 2021 Model)\n\n\t\n\n$12,999.99\n\n\t\n\n$9,997.99\n\n\t\n\n−23.09%\n\n\t\n\n$3,002.00\n\n\n\n\nB08V3B227H\n\n\t\n\nSAMSUNG 85-Inch Class Neo QLED QN90A Series–4K UHD Quantum HDR 32x Smart TV with Alexa Built-in (QN85QN90AAFXZA, 2021 Model), TITAN Black\n\n\t\n\n$4,999.99\n\n\t\n\n$3,747.99\n\n\t\n\n−25.04%\n\n\t\n\n$1,252.00\n\n\n\n\nB088HL666V\n\n\t\n\nSAMSUNG 75-inch Class QLED The Terrace Outdoor TV–4K UHD Direct Full Array 16X Quantum HDR 32X Smart TV with Alexa Built-in (QN75LST7TAFXZA, 2020 Model)\n\n\t\n\n$6,497.99\n\n\t\n\n$4,997.99\n\n\t\n\n−23.08%\n\n\t\n\n$1,500.00\n\n\n\n\nB08FLWMWSF\n\n\t\n\nBowflex Treadmill Series\n\n\t\n\n$3,599.00\n\n\t\n\n$2,199.98\n\n\t\n\n−38.87%\n\n\t\n\n$1,399.02\n\n\n\n\nB08B2Q3S85\n\n\t\n\nMatterport Pro2 3D Camera for Creating Professional 3D Virtual Experiences with 360 Views and 4K Photography\n\n\t\n\n$3,395.00\n\n\t\n\n$2,195.00\n\n\t\n\n−35.35%\n\n\t\n\n$1,200.00\n\n\n\n\nB01GS1SC54\n\n\t\n\nSAFAVIEH Evoke Collection EVK256D Oriental Distressed Non-Shedding Living Room Bedroom Dining Home Office Area Rug, 10' x 14', Grey / Ivory\n\n\t\n\n$1,400.00\n\n\t\n\n$369.02\n\n\t\n\n−73.64%\n\n\t\n\n$1,030.98\n\n\n\n\nB08FM19JF7\n\n\t\n\nBowflex Treadmill Series\n\n\t\n\n$2,399.00\n\n\t\n\n$1,499.00\n\n\t\n\n−37.52%\n\n\t\n\n$900.00\n\n\n\n\nB07F8D54BN\n\n\t\n\nSAFAVIEH Monaco Collection MNC255M Boho Chic Oriental Distressed Non-Shedding Living Room Bedroom Dining Home Office Area Rug, 9' x 12', Blue / Light Grey\n\n\t\n\n$1,296.00\n\n\t\n\n$323.01\n\n\t\n\n−75.08%\n\n\t\n\n$972.99\n\n\n\n\nB086MHT6LB\n\n\t\n\nRazer Blade 15 Advanced Gaming Laptop 2020: Intel Core i7-10875H 8-Core, NVIDIA GeForce RTX 2080 Super Max-Q, 15.6” FHD 300Hz, 16GB RAM, 1TB SSD, CNC Aluminum, Chroma RGB Lighting, Thunderbolt 3\n\n\t\n\n$2,999.99\n\n\t\n\n$1,599.99\n\n\t\n\n−46.67%\n\n\t\n\n$1,400.00\n\n\n\n\nB07HBJH9JB\n\n\t\n\nSafavieh Reflection Collection RFT665D Vintage Distressed Area Rug, 9' x 12', Cream / Ivory\n\n\t\n\n$1,296.00\n\n\t\n\n$355.33\n\n\t\n\n−72.58%\n\n\t\n\n$940.67\n\nA $3,000 discount for a Samsung TV seems like the biggest bargain. But…our data indicates that you should be wary of such ‘deals’.\n\nIn reality, some of the “base values” are not real—the average pricing for some of the products was much lower than the original price indicators during the discount.\n\nLet’s follow up on our Samsung TV example:\n\nThe average price of this product on Black Friday was $9,997.99, and the sellers quoted $12,999.99 as the base price before the sale. Our dataset shows that the average price of a Samsung TV over the analyzed period was actually $10,015.53, with $10,997,99 as the highest price (on January 2nd at 8 pm).\n\nIn reality, some of the “base values” are not real—the average pricing for some of the products was much lower than the original price indicators during the discount.\n\nLet’s follow up on our Samsung TV example. \n\nAnother good example is the second product, a Samsung TV. The average price during BF is $3,747.99, but the sellers claim that before discounts it was $4,999.99. In our database it seems like the average price overtime was $3,453.15 (even lower than during BF) and the highest price was $4,197.99.\n\nWe have a similar case with Matterport Pro2 3D Camera (asin: B08B2Q3S85). The average price during BF is $2,195.00, but the sellers claim that before discounts it was $3,3950. In our database the average price overtime was $2,320.08 (slightly higher than during BF) and the highest price was $2,795.\n\nAgain, similarly with the sixth product in our table (asin: B01GS1SC54). The average price during BF is $369.02, but the sellers claim that before discounts it was $1,400. In our database it seems like the average price overtime was $364.96 (even lower than during BF) and the highest price was $369.02\n\nHere’s what the actual pricing picture for the seemingly most discounted products on Black Friday looks like:\n\nASIN\n\n\t\n\nTitle\n\n\t\n\nBase value (on Black Friday)\n\n\t\n\nAverage price (on Black Friday)\n\n\t\n\nAverage price (overall)\n\n\t\n\nAvg price overall–avg price on BF\n\n\t\n\nAvg price overall–base value\n\n\n\n\nB08YGY223S\n\n\t\n\nSAMSUNG 75-Inch Class Terrace Full Sun Outdoor QLED 4K Smart TV with Alexa Built-in (QN75LST9TAFXZA, 2021 Model)\n\n\t\n\n$12,999.99\n\n\t\n\n$9,997.99\n\n\t\n\n$10,015.53\n\n\t\n\n−$17.54\n\n\t\n\n−$2,984.46\n\n\n\n\nB08V3B227H\n\n\t\n\nSAMSUNG 85-Inch Class Neo QLED QN90A Series–4K UHD Quantum HDR 32x Smart TV with Alexa Built-in (QN85QN90AAFXZA, 2021 Model), TITAN Black\n\n\t\n\n$4,999.99\n\n\t\n\n$3,747.99\n\n\t\n\n$3,453.15\n\n\t\n\n$294.84\n\n\t\n\n−$1,546.84\n\n\n\n\nB088HL666V\n\n\t\n\nSAMSUNG 75-inch Class QLED The Terrace Outdoor TV–4K UHD Direct Full Array 16X Quantum HDR 32X Smart TV with Alexa Built-in (QN75LST7TAFXZA, 2020 Model)\n\n\t\n\n$6,497.99\n\n\t\n\n$4,997.99\n\n\t\n\n$5,286.45\n\n\t\n\n−$288.46\n\n\t\n\n−$1,211.54\n\n\n\n\nB08FLWMWSF\n\n\t\n\nBowflex Treadmill Series\n\n\t\n\n$3,599.00\n\n\t\n\n$2,199.98\n\n\t\n\n$2,415.40\n\n\t\n\n−$215.42\n\n\t\n\n−$1,183.60\n\n\n\n\nB08B2Q3S85\n\n\t\n\nMatterport Pro2 3D Camera for Creating Professional 3D Virtual Experiences with 360 Views and 4K Photography\n\n\t\n\n$3,395.00\n\n\t\n\n$2,195.00\n\n\t\n\n$2,320.08\n\n\t\n\n−$125.08\n\n\t\n\n−$1,074.92\n\n\n\n\nB01GS1SC54\n\n\t\n\nSAFAVIEH Evoke Collection EVK256D Oriental Distressed Non-Shedding Living Room Bedroom Dining Home Office Area Rug, 10' x 14', Grey / Ivory\n\n\t\n\n$1,400.00\n\n\t\n\n$369.02\n\n\t\n\n$364.96\n\n\t\n\n$4.06\n\n\t\n\n−$1,035.04\n\n\n\n\nB08FM19JF7\n\n\t\n\nBowflex Treadmill Series\n\n\t\n\n$2,399.00\n\n\t\n\n$1,499.00\n\n\t\n\n$1,378.65\n\n\t\n\n$120.35\n\n\t\n\n−$1,020.35\n\n\n\n\nB07F8D54BN\n\n\t\n\nSAFAVIEH Monaco Collection MNC255M Boho Chic Oriental Distressed Non-Shedding Living Room Bedroom Dining Home Office Area Rug, 9' x 12', Blue / Light Grey\n\n\t\n\n$1,296.00\n\n\t\n\n$323.01\n\n\t\n\n$318.35\n\n\t\n\n$4.66\n\n\t\n\n−$977.65\n\n\n\n\nB086MHT6LB\n\n\t\n\nRazer Blade 15 Advanced Gaming Laptop 2020: Intel Core i7-10875H 8-Core, NVIDIA GeForce RTX 2080 Super Max-Q, 15.6” FHD 300Hz, 16GB RAM, 1TB SSD, CNC Aluminum, Chroma RGB Lighting, Thunderbolt 3\n\n\t\n\n$2,999.99\n\n\t\n\n$1,599.99\n\n\t\n\n$2,030.58\n\n\t\n\n-$430.59\n\n\t\n\n−$969.41\n\n\n\n\nB07HBJH9JB\n\n\t\n\nSafavieh Reflection Collection RFT665D Vintage Distressed Area Rug, 9' x 12', Cream / Ivory\n\n\t\n\n$1,296.00\n\n\t\n\n$355.33\n\n\t\n\n$340.45\n\n\t\n\n$14.88\n\n\t\n\n−$955.55\n\nPricing on Amazon is primarily affected by supply and demand much more so than seasonality.\nOften prices on Amazon can go well above or below MSRP (manufacturer’s suggested retail price). Typically, Amazon will suppress items whose pricing goes significantly beyond what can be found on other large sites, but it will do nothing to stop falling prices. But last year, so much inventory was in short supply that we saw even more prices above MSRP. However, it’s a more common pattern across the most popular and trending items.\n\n[BONUS] For Sellers Only: The Most Popular Deals and Labels on Amazon\n\nAmazon product listings often feature special deal badges or some additional labels. \n\nOne product can even have one deal, but several labels.\n\nWhile most of them can be managed through Seller Central, some can’t unless Amazon itself chooses to award you with a special badge (e.g. Best Seller).\n\nOur analysis showed that the most popular deals are:\n\nCoupon\n\n\t\n\nShare of products with the coupon\n\n\n\n\nLimited time deal\n\n\t\n\n3.28%\n\n\n\n\nCyber Monday Deal\n\n\t\n\n0.37%\n\n\n\n\nBlack Friday Deal\n\n\t\n\n0.23%\n\n\n\n\nSave 20%\n\n\t\n\n0.15%\n\n\n\n\nSave 25%\n\n\t\n\n0.13%\n\n\n\n\nSave 6%\n\n\t\n\n0.12%\n\n\n\n\nSave 10%\n\n\t\n\n0.11%\n\n\n\n\nSave 5%\n\n\t\n\n0.11%\n\n\n\n\nSave 13%\n\n\t\n\n0.11%\n\n\n\n\nSave 7%\n\n\t\n\n0.10%\n\n\n\n\nSave 11%\n\n\t\n\n0.10%\n\n\n\n\nSave 9%\n\n\t\n\n0.10%\n\n\n\n\nSave 17%\n\n\t\n\n0.10%\n\n\n\n\nSave 15%\n\n\t\n\n0.09%\n\nThe most popular labels are:\n\nLabel\n\n\t\n\nShare of products with the label\n\n\n\n\nPrime\n\n\t\n\n78.58%\n\n\n\n\nBest Seller\n\n\t\n\n4.05%\n\n\n\n\nSave 5%\n\n\t\n\n3.78%\n\n\n\n\nLimited time deal\n\n\t\n\n3.51%\n\n\n\n\nLowest price in 30 days\n\n\t\n\n2.50%\n\n\n\n\nSave 10%\n\n\t\n\n2.44%\n\n\n\n\nSave 20%\n\n\t\n\n1.18%\n\n\n\n\nHoliday Toy List\n\n\t\n\n0.86%\n\n\n\n\nHoliday Gift Guide\n\n\t\n\n0.85%\n\n\n\n\nAmazon’s Choice\n\n\t\n\n0.75%\n\n\n\n\nSave $10.00\n\n\t\n\n0.72%\n\n\n\n\nSave 15%\n\n\t\n\n0.68%\n\n\n\n\nSave $2.00\n\n\t\n\n0.50%\n\n\n\n\nSave $5.00\n\n\t\n\n0.50%\n\n\n\n\nSave $3.00\n\n\t\n\n0.45%\n\nIt’s not surprising to see that an overwhelming majority of sellers have the Amazon prime label—as it means free and fast shipping, the two things Amazon customers appreciate the most.\n\nThe “prime” label becomes even more crucial during the hottest sales seasons as delivery becomes more challenging.\n\nLabel\n\n\t\n\nShare of products with the label on November 26th\n\n\n\n\nPrime\n\n\t\n\n78.44%\n\n\n\n\nBlack Friday Deal\n\n\t\n\n7.93%\n\n\n\n\nBest Seller\n\n\t\n\n3.61%\n\n\n\n\nSave 5%\n\n\t\n\n3.17%\n\n\n\n\nLowest price in 30 days\n\n\t\n\n2.85%\n\n\n\n\nSave 20%\n\n\t\n\n2.09%\n\n\n\n\nSave 10%\n\n\t\n\n1.93%\n\n\n\n\nHoliday Toy List\n\n\t\n\n1.60%\n\n\n\n\nHoliday Gift Guide\n\n\t\n\n1.12%\n\n\n\n\nAmazon’s Choice\n\n\t\n\n0.72%\n\n\n\n\nSave 15%\n\n\t\n\n0.62%\n\n\n\n\nSave $10.00\n\n\t\n\n0.50%\n\n\n\n\nSave 25%\n\n\t\n\n0.42%\n\n\n\n\nSave $2.00\n\n\t\n\n0.41%\n\n\n\n\nSave 30%\n\n\t\n\n0.39%\n\nWe found out that during Black Friday, the “prime” label was assigned to 79% of all the products. “Black Friday Deal” and “Best Seller” badges were the second and third-most popular labels on November 26.\n\nThe Amazon Prime Badge is unquestionably the most beneficial for sellers. Not only because it helps with click-thru and conversion rates, but also because so many Prime members actually filter by Free 2 Day Shipping. Coupons and Discounts can also help with CTR and conversion increase, but we need more data to be analyzed to understand not only the impact on the bottom line but also the long-term impact on ROI.\n\nAmazon Expert, Speaker, Avenue7Media\n\nAmazon Pricing Study: Most Crucial Insights for Both Sellers and Shoppers\n\nWe’ve managed to unwrap a lot of different pricing patterns across Amazon, and most of them are of interest to both sellers and buyers.\n\nBut we know that this is a lot of information to digest, so to wrap up, we want to mention the key discoveries you should be taking note of—both as a seller and as a shopper.\n\nKey Takeaways for Sellers\n\nIf you’re an Amazon seller, or want to just get started with your very first ecommerce gig, knowing about the general pricing patterns on Amazon could be just what you need to succeed.\n\nWhile we encourage you to take in all the insights we’ve shared in this study, here are the key things to keep in mind:\n\nDon’t be afraid to sell higher-priced items\n\nWhile the average product price (among the most in-demand goods) is $142,74, we saw a lot of higher-priced items within the list of the most popular Amazon products.\n\nThis is especially true for tech/digital goods that typically come at much higher prices than products in other categories.\n\nEncourage post-New Year evening sales\n\nProduct prices go up after the end of winter holidays and in the evenings (5 pm–2 am), so whenever you’re running promotions or are investing in increasing your sales, consider the best days/times for higher prices.\n\nBe smart about discounting your pricing during the hottest discount seasons\n\nAs it turned out, the prices don’t drop all that much, even during the biggest sales periods. If Black Friday prices fell by 4%, the Christmas period prices grew by the same margin. \n\nWhile it might not sound too customer-centric, don’t rush into discounting your pricing by large margins because, as our research showed, it’s not what sellers really do during the hottest sales seasons.\n\nWhen it comes to Black Friday or other similar sale seasons, make sure your price drop is significant. Over the last few years, BFCM has become less and less impactful because buyers know that that’s not when they’re likely to get the best price. Customers are getting savvier and savvier and track prices more than most people realize. If you’re going to drop your price, make sure it’s significant enough to get buyers’ attention but not too much to make your product unprofitable.\n\nDan Saunders eCommerce Channel Manager at Stanley Black & Decker\n\nFrom a brand perspective, it’s generally a good time to run a promotion during holidays or other key periods as Amazon shoppers are looking for deals during these busy periods. The rising cost of advertising and increased cost on Amazon make it difficult to offer rock bottom pricing during busy shopping periods. Something else to keep in mind is how relevant the holiday is to the product. Black Friday/Cyber Monday is going to be great for gift-able items. Not as great for general products like Cleaning Supplies, Pet Food, or other consumable/everyday products. The Toy category is another example where you can expect to find better discounts during Prime Day or Q1/2 as sellers may be liquidating unsellable inventory from the holidays.\n\nKey Takeaways for Shoppers\n\nWhile some of our findings (and advice) might seem cynical and not very customer-friendly, as a shopper, you should also be aware of the top pricing strategies of sellers. This will help you strike a real bargain rather than fall for a myriad of marketing tricks.\n\nHere are the top things you should keep in mind when doing your Amazon shopping:\n\nShop in late November–late December between 4 am and 12 pm. \n\nThis period features the lowest prices for the majority of products.\n\nGaming products’ pricing is very volatile.\n\nIf you’re into gaming, you have a higher chance of getting a real bargain, because gaming price changes are more notable than those of other products. \n\nIf you’re in for a PlayStation, set your shopping aside for Christmas time—because, during Black Friday, the prices skyrocket.\n\nDon’t expect to see the lowest-ever prices during Black Friday.\n\nOnly 1.6% of the most popular Amazon products have the lowest prices on Black Friday. So unless you’re shopping for popsockets or women’s lingerie, pay closer attention to the pricing throughout different time periods.\n\nTools like Keepa can help you keep track of the pricing for products and even set up price drop alerts.\n\nDon’t believe the price strikethroughs.\n\nYou may fall for a large discount featured on a given product listing, but it’s best to review the original price labels on similar products to double-check if the seller is exaggerating the price just to entice you to buy the product. Although Amazon has been trying to crack down on such practices, they may still come up.\n\nGet timely updates on changes in Buy Box and prices\n\nwith Listing Alerts for Amazon\n\nTry for Free →",
  "headers": {
    "h1": "Amazon Pricing Study: The Most Expensive Products, Category Volatility, and Seasonal Price Shifts",
    "h2": [
      "Amazon Pricing Study: Key Highlights",
      "About the Amazon Pricing Study",
      "Everything You Wanted to Know About Amazon’s Pricing Patterns",
      "Is It Okay to Sell Higher-Priced Items on Amazon?",
      "Does the Product Price Change All That Often?",
      "The Most & Least Expensive Pricing Days Across Various Amazon Product Categories",
      "Which Amazon Products’ Prices Are More Volatile?",
      "Are Holiday/Special Deals Just a Myth, and Does the Price Really Go Down During Hot Sale Seasons?",
      "A More Detailed Take on Black Friday Prices",
      "[BONUS] For Sellers Only: The Most Popular Deals and Labels on Amazon",
      "Amazon Pricing Study: Most Crucial Insights for Both Sellers and Shoppers"
    ]
  },
  "images": [
    {
      "src": "https://static.semrush.com/blog/uploads/media/8e/8b/8e8b66c34c7e131bebc6311ed371bc06/amazon-pricing-study.svg",
      "alt": "Amazon Pricing Study: The Most Expensive Products, Category Volatility, and Seasonal Price Shifts"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ce/fa/cefacac016e5c2a72167159391505c97/iirQoNA7Xr-ad8OgoOHI1iQfxVzT3PdK9Jbz6z1ljvuuSZFxZbE3lOi_6tGKtdI91Jm6IUTDKXYdNLF07Gja_3P9V3KkX6URqPdeYdRdXlPT0O74TVOHhigRkBlpWF0wy4vOhAcm.png",
      "alt": "iirQoNA7Xr-ad8OgoOHI1iQfxVzT3PdK9Jbz6z1ljvuuSZFxZbE3lOi_6tGKtdI91Jm6IUTDKXYdNLF07Gja_3P9V3KkX6URqPdeYdRdXlPT0O74TVOHhigRkBlpWF0wy4vOhAcm"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/7e/26/7e26fdaebc577906b41bb43f7ae5ce0d/iigo51e9B6kiTC_j5MknPDrreGi3GJGRqczHimz7-bY_AWAFi_SUY2Nqwi9BAHei1RSAbqaieH_taVqhEe7qhheB4N-ehpWbk0FdcL0dufvP8ntg0-BYgLcMGEQp5oeT0AFT2IwF.png",
      "alt": "iigo51e9B6kiTC_j5MknPDrreGi3GJGRqczHimz7-bY_AWAFi_SUY2Nqwi9BAHei1RSAbqaieH_taVqhEe7qhheB4N-ehpWbk0FdcL0dufvP8ntg0-BYgLcMGEQp5oeT0AFT2IwF"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/0a/64/0a64681bfbf3e78a10b6f1263c64c06a/DfmWbejMcQqEEM3-1qNAgBtNsiNfoA3--mPIhYS8Taitp671afkva2Io6wIEPp1lxM8xDr81Nyv9CUoQIgJtiQ_TQKoQ2U3Lh6euCtSUyEY70IH7x66ns_ntPH3MeNUhOLAmn1OS.png",
      "alt": "DfmWbejMcQqEEM3-1qNAgBtNsiNfoA3--mPIhYS8Taitp671afkva2Io6wIEPp1lxM8xDr81Nyv9CUoQIgJtiQ_TQKoQ2U3Lh6euCtSUyEY70IH7x66ns_ntPH3MeNUhOLAmn1OS"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/b6/e4/b6e412e3543ccbefc5341a087a20ea8c/iJp-04P_GAoFroFnyvdIIBp81ctWqtnI_S909eIhUqK5yEieNGYMPs_aAAmXgvjkaMxusX_fLldcKKGGHZargPVNLF0GpJuK2kBiFTImNaqsS_z0Q8yaG3z5HgCCLwkDCl5nNzCJ.png",
      "alt": "iJp-04P_GAoFroFnyvdIIBp81ctWqtnI_S909eIhUqK5yEieNGYMPs_aAAmXgvjkaMxusX_fLldcKKGGHZargPVNLF0GpJuK2kBiFTImNaqsS_z0Q8yaG3z5HgCCLwkDCl5nNzCJ"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e1/8f/e18f5d2bd0214a1726044d60e310b63c/IHqgoMxtA_LfuvKFVyLR0XXMS5Q4Xdrg-mJWGmRT_F17-gGPkq7drqO_itSUcZow0VVSo4_vqY30ef3zgmLazR3gCuYfU4OB1GGrpO6SP10BD4u4Guv4RuOSUAIByyqOBm4YZtgO.png",
      "alt": "IHqgoMxtA_LfuvKFVyLR0XXMS5Q4Xdrg-mJWGmRT_F17-gGPkq7drqO_itSUcZow0VVSo4_vqY30ef3zgmLazR3gCuYfU4OB1GGrpO6SP10BD4u4Guv4RuOSUAIByyqOBm4YZtgO"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/f1/b3/f1b30ffffb9740952b306eb1c2c6e265/CwEgArjmU6oae9f_mQ3iQ51V8NhnlVUH3pxj3utQDN_FC15C1PrleW27s6OZwPwHnnCnTkjF1pox8FVwz6KDoZ_4T8Kckb3mI3OFuNeDTwP1aXv7Di3ZpQ6nv4YGU7LNassfWRGy.png",
      "alt": "CwEgArjmU6oae9f_mQ3iQ51V8NhnlVUH3pxj3utQDN_FC15C1PrleW27s6OZwPwHnnCnTkjF1pox8FVwz6KDoZ_4T8Kckb3mI3OFuNeDTwP1aXv7Di3ZpQ6nv4YGU7LNassfWRGy"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/f9/a4/f9a4975d43e902006f5b96fcbc39e230/5O1jxI0-FEK7slAgs92zlXutnIYdCYYzJSA1FKdmoJmTm6OnmbTLJWo17KVtxPXGdhs7B1XJm9iwVmswwTqtrA2t6nawQrH1GYzhfzWazi_tFhsIt4Q3qJcCLPcu99Al_J2ejUqE.png",
      "alt": "5O1jxI0-FEK7slAgs92zlXutnIYdCYYzJSA1FKdmoJmTm6OnmbTLJWo17KVtxPXGdhs7B1XJm9iwVmswwTqtrA2t6nawQrH1GYzhfzWazi_tFhsIt4Q3qJcCLPcu99Al_J2ejUqE"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/30/36/3036ab1eb77651a376221097cc75a1ec/8yzrnbZU0SRglHLEWNT9UNdnwuGcsO9xF5vO_4mqODbDNEvE1junUE0e-N_PmfpoDbo8sApxGzC8K1OX9PJK31STsur8wpAyCF6hMmLDA_iWl1KWVrODTlpkNRdUw9dGWF_1ZsJR.png",
      "alt": "8yzrnbZU0SRglHLEWNT9UNdnwuGcsO9xF5vO_4mqODbDNEvE1junUE0e-N_PmfpoDbo8sApxGzC8K1OX9PJK31STsur8wpAyCF6hMmLDA_iWl1KWVrODTlpkNRdUw9dGWF_1ZsJR"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/9d/ce/9dcee97ddae3ef300a0354af39b1645f/Dan-Saunders-Quote.png",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/23/62/2362a3dce2f40d1b127f066b5dab7bf9/IUf48i87KOWsL8i0feniMIc-iD096x9qvOGAD5H1T-1c07ysmUJ7NV8u0U2irko3ZTcqysiL3o17pZvcadNIxsL90J6iIHNBRAvOQCk_loDWRgduMZRvhJt8PGePv4r1ZepesNFz.png",
      "alt": "IUf48i87KOWsL8i0feniMIc-iD096x9qvOGAD5H1T-1c07ysmUJ7NV8u0U2irko3ZTcqysiL3o17pZvcadNIxsL90J6iIHNBRAvOQCk_loDWRgduMZRvhJt8PGePv4r1ZepesNFz"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/aa/42/aa42373eb3f9669783fd3d2f49c3b610/BuPkJ_7M5W_7lYbBwIjEeniHzHdbByIz4byq8YWigeKvojxWxXKkjl0-3LPkurpSD-Uzr9BBknv4SB0GXmaXXjfKpSfZJlfWP_-jO4oboPR5diouod5Fl62zeYPzswGbiEUTcuqg.png",
      "alt": "BuPkJ_7M5W_7lYbBwIjEeniHzHdbByIz4byq8YWigeKvojxWxXKkjl0-3LPkurpSD-Uzr9BBknv4SB0GXmaXXjfKpSfZJlfWP_-jO4oboPR5diouod5Fl62zeYPzswGbiEUTcuqg"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/0c/b6/0cb6ea3182d1390631ac05dcf78a690d/0pO5N3dvzFD4WiyeI850wpLfu_qGm1dcqc4Tgdxnc8ztWKRzJEo9AWdksOLyAT39eyxyzcqD6f5RwGjUDPLLLUwZN8fFvqVWYpyYA0pQWOD03bxsqxBkJF90RMimhD3YPvOb0Ogj.png",
      "alt": "0pO5N3dvzFD4WiyeI850wpLfu_qGm1dcqc4Tgdxnc8ztWKRzJEo9AWdksOLyAT39eyxyzcqD6f5RwGjUDPLLLUwZN8fFvqVWYpyYA0pQWOD03bxsqxBkJF90RMimhD3YPvOb0Ogj"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e6/dd/e6dda34bc6b8efedfd0ed933dd006d67/sJbCjYIPJhSg6Ss43gDH41I85_Tifh-k5HmDb2LWDG5FHf6k0UWo18DGpK6XiHTFej01P6chp25tU1UTRfcpe8sJI35ArnKHfL9etMig8wSpPN6i8bCg3qxAQTA3i_bmzCFOwWLK.png",
      "alt": "sJbCjYIPJhSg6Ss43gDH41I85_Tifh-k5HmDb2LWDG5FHf6k0UWo18DGpK6XiHTFej01P6chp25tU1UTRfcpe8sJI35ArnKHfL9etMig8wSpPN6i8bCg3qxAQTA3i_bmzCFOwWLK"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/67/3a/673a5809ec6e24c484470f6434ced2de/Jordi-Ordonez-Quote.png",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ec/d8/ecd8ed36020947c5e4b343089d7b17e2/41B1ZCNq3fg-VwpEypCchkY8Xs3eUO66zhVV8zRHgwJM1p2RtsrTgzGjzvLdQ21nTvPPKpC-2YapTp02CvT-6bK2cAnDokRhSvRdegqb42MTECtSXE1_ixnPfrOfMW3YrskpH1jo.png",
      "alt": "41B1ZCNq3fg-VwpEypCchkY8Xs3eUO66zhVV8zRHgwJM1p2RtsrTgzGjzvLdQ21nTvPPKpC-2YapTp02CvT-6bK2cAnDokRhSvRdegqb42MTECtSXE1_ixnPfrOfMW3YrskpH1jo"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/5c/07/5c07b3d5cd350fe80465330d0e6b12a4/HSuH0hDkcVppe5dZYhyxxy0Za9tEXQTxIplyn7S6ljPjfTdyxkorSyPSqeyf35C67p9IHAKR78UG5im2Yu_4OvlMCM8eQtDgKCJ9FSgdBr_A0NmycacFc_E-WG0zOWcRt6E4kkz8.png",
      "alt": "HSuH0hDkcVppe5dZYhyxxy0Za9tEXQTxIplyn7S6ljPjfTdyxkorSyPSqeyf35C67p9IHAKR78UG5im2Yu_4OvlMCM8eQtDgKCJ9FSgdBr_A0NmycacFc_E-WG0zOWcRt6E4kkz8"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/db/cb/dbcbe0c1de04cb93a052d5c11054460a/6C6Nrv5mkSidIux38Hu1Iq3ON8yczg0baUCOyn_OzRqClhZeLTa5Cb87MHqQhM6b2etlrEBtxgqogB5QNkLLlkKQljWwAe6Fd0-Ov_J3mu5_zGLqYzJ_jzHqk6QAMPGIPIi-vqZ5.png",
      "alt": "6C6Nrv5mkSidIux38Hu1Iq3ON8yczg0baUCOyn_OzRqClhZeLTa5Cb87MHqQhM6b2etlrEBtxgqogB5QNkLLlkKQljWwAe6Fd0-Ov_J3mu5_zGLqYzJ_jzHqk6QAMPGIPIi-vqZ5"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/00/cf/00cff0d86b0f68fdae29175cc769777a/Robyn-Johnson-Quote.png",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/2f/21/2f2106537261fe9157b910945665592a/zZQybcDSDtLaxivGI1jHIDfI8snMmySH_zoVhEmfgEu8HufniYgG-SahmaY76fNNwJV6nh_7e_tHcqVaYjehuzUojHbeqLuUSSYSD3Ji48K-_kwb_KP0Zstyn-MFMJnInq5KDE17.png",
      "alt": "zZQybcDSDtLaxivGI1jHIDfI8snMmySH_zoVhEmfgEu8HufniYgG-SahmaY76fNNwJV6nh_7e_tHcqVaYjehuzUojHbeqLuUSSYSD3Ji48K-_kwb_KP0Zstyn-MFMJnInq5KDE17"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/1f/5e/1f5eddd50840e42b757570c9fec30ebb/Shannon-Roddy-Quote.png",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/b8/38/b8385929a53439bd706acfd95d01c61b/Will-Haire-Quote.png",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/0f/c2/0fc260a7dc3cc616629607dab6163023/amazon-pricing-study.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/semblog-next-static/banners/trial-gift.png",
      "alt": "Trial Semrush banner"
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&d=Mon%2C%2021%20Oct%202024%2014%3A24%3A30%20GMT&n=4d&b=Amazon%20Pricing%20Strategies%20Study&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Famazon-pricing-study%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&b=Amazon%20Pricing%20Strategies%20Study&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Famazon-pricing-study%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://bat.bing.com/action/0?ti=5128787&tm=gtm002&Ver=2&mid=daf1e52f-24f4-437e-ab91-8f68767b89cd&bo=1&sid=261ed1508fb811efba4e99f5951e6f6e&vid=261f1a208fb811efae422368dbcde7c5&vids=0&msclkid=N&uach=pv%3D14.0.0&pi=0&lg=en-US&sw=1920&sh=1080&sc=24&tl=Amazon%20Pricing%20Strategies%20Study&p=https%3A%2F%2Fwww.semrush.com%2Fblog%2Famazon-pricing-study%2F&r=&lt=1152&mtp=10&evt=pageLoad&sv=1&cdb=ARoR&rn=501404",
      "alt": ""
    }
  ],
  "publication_date": null
}