{
  "url": "https://www.semrush.com/blog/best-crm-for-small-business/",
  "title": "Best CRM solutions for small business 2024 - Semrush",
  "content": "For many small businesses, the biggest initial challenge is being able to find your first few customers. However, once that first wave of customers comes rushing in, it can become difficult and cumbersome trying to take care of your existing clients while guiding new customers through your funnel. Some small businesses don’t even have funnels yet, simply because they’re too busy scrambling to meet deadlines and client expectations.\n\nThat’s where CRMs come in. Small business CRM software helps organizations straighten out their sales systems and scale up their customer base. \n\nIn this article, we’ll take a closer look at why every small business should use a CRM, what makes for a great CRM solution, and which software is right for your business needs.\n\nWhat Is Small Business CRM Software?\n\nLet’s start off with what a CRM is. CRM stands for “customer relationship management,” which specifically refers to the process of keeping track of your customers, especially as they pertain to your sales cycle.\n\nCRM software is a type of digital platform that companies use to help them manage relationships with their customers, as well as other business functions related to sales, customer service, marketing, and even operations. \n\nHowever, not every CRM software is the same. Some CRMs are made for large enterprises, while others are designed to be CRM software for small businesses. That’s because even the best CRM out there may cater to a corporation and not necessarily be the easiest CRM system for a small business to use (or pay for). \n\nWhy Do Growing Businesses Need to Use a CRM?\n\nNowadays, it’s hard for any business to operate without having some sort of digital system in place to look after their data. These digital systems and tools, like CRMs or any small business sales software, help growing companies and small businesses alike to not only catch up with technologically advanced customers but also gain a competitive advantage.\n\nThat said, some small businesses continue to rely on manually keeping track of their customers with spreadsheets or even in a spiral notebook. And while these “minimalistic” CRM systems can be a good starting point for any small business, eventually, if you plan on increasing your business levels, you’ll need a customer management software that can scale with your customer base.\n\nWhat Are the Benefits of a CRM System?\n\nThere are many advantages to using CRM tools in a small business, all of which help you to streamline your day-to-day operations and grow your business faster. Here are a few of the ways in which even a simple SMB CRM can help a small business expand:\n\n1. Stronger Customer Relationships\n\nBeing able to share your customer data with all your team members from one location means you can deliver a consistently positive experience for your customers, no matter who they’re talking to you at your business. That way, you can build stronger relationships with your existing customers while nurturing your leads, all from the same place.\n\n2. Keeps Your Teams Connected\n\nMany of the best small business CRMs offer project management features that help individuals across your organization keep each other updated on specific tasks without needing to leave the platform. This helps to minimize any errors or mishaps that often result from delayed or fragmented communication between teams. \n\n3. Better Understanding of Your Business’ Performance\n\nAs the saying goes, “what gets measured, gets managed.” And when it comes to growing a small business, not having concrete data to analyze your business’ performance is often a limiting factor. Tools like CRMs give small businesses the capacity to service more customers at higher business levels by providing sales forecasts and detailed analytics.\n\n4. Centralized Database of Information\n\nHaving a CRM gives small businesses a place to store all their customer-related data and information in one centralized location. As opposed to fragmented systems where team members have to scavenge for information across multiple incompatible systems, CRMs make it easy to pull up any relevant details about any customer at a moment’s notice. \n\n5. Improved Customer Segmentation\n\nBecause of all the data that CRMs collect on your customers, you’re better able to sort and segment your customer base into categories along different types of dimensions. For example, in addition to basic filtering criteria like demographics, you can use a CRM to group your customers according to more insightful information such as their average purchase size or frequency of purchases.\n\n6. Saves Time and Money\n\nOne of the lesser known features of customer relationship or client management software is the ability to automate different parts of your business. From one-on-one messaging with your customers to administrative tasks and overall operations management, CRM solutions help small businesses make more efficient use of their time, which leads to better profitability.\n\nOf course, a lot of this depends on which CRM platform your small business ends up using.\n\nWhat Makes a Great Small Business CRM?\n\nFrom a purely subjective standpoint, some small business CRMs may work better than others simply based on what you need and prefer. In general though, there are many features that are commonly sought-after among SMBs and startups.\n\n1. Multiple Integrations\n\nIf you’re a small business that’s already using several platforms to communicate with your customers—whether through marketing, sales, or customer support—you’ll likely want a CRM that’s compatible with those platforms. However, the best CRM for your small business is the one that seamlessly integrates with all of your platforms, essentially creating a fully digital system to run your business.\n\nSome of the more common types of integrations that small businesses look for in CRMs include:\n\nPhone system\nLivechat/Chatbot program\nEmail client\nDigital marketing platforms (e.g. Google Analytics, Facebook Ads)\nPersonal/Business calendars\nInvoicing software\nPoint-of-sale (POS) systems\n2. On-the-Go & Cloud-Based Functionality\n\nSmall businesses are beginning to rely largely on digital tools and platforms to conduct their day-to-day activities. Consequently, many of the more popular and preferred small business CRMs are designed as cloud-based softwares. Several of these cloud-based CRMs offer their own smartphone app version of their software as well, which lets small business owners and employees manage customer interactions from anywhere.\n\nThis is particularly useful for retail businesses or any company that uses tablets, phones, and other mobile devices to engage with their customers.\n\nSmall business CRM solutions that offer native iOS and Android app versions (as opposed to browser-based apps) also allow users to share data and capabilities with other mobile applications. The best mobile CRMs are designed from scratch, which typically makes for a more user-friendly experience.\n\n3. Organizes, Aligns, and Enhances Your Funnel\n\nA big challenge for many small businesses is figuring out how to set up and structure their sales funnel from top-to-bottom.\n\nThat’s why the better options for small business CRM software don’t just help you collect and manage your data but also leverage it to tweak and optimize your funnel.\n\nCross-platform integrations also make sure all your teams across business functions are working together and using the same information throughout the customer journey. This prevents things like messaging and support tickets from getting mixed up.\n\nWhat Other Criteria Should You Look for in Choosing the CRM for Your Business?\n\nRather than compare small business CRMs side-by-side based on their features, it’s best to start looking for a CRM by clarifying your particular business needs.\n\nYou and your team will need to consider several evaluative factors, such as:\n\nWhat kind of customers are you serving?\nWhat added benefits do you want from your CRM?\nWhat software do you use that would need to integrate with your CRM system?\nWhat are your current business levels like now, and what do you expect them to be in the future?\nWho is going to use your CRM?\nHow much are you willing to spend on a CRM?\n\nIt’s important that you spend as much time as you need to discuss these questions in depth with your team. Setting up a CRM for your small business can be an expensive investment, so you want to be sure that you’re picking the right solution for your situation.\n\nOnce you’ve come to an agreement on these evaluative factors, you’ll need to take some additional steps to help narrow down your options.\n\nSmall Business CRM Features to Look for\n\nHere are some of the key features to look out for when shopping for a small business CRM:\n\n1. User-Friendly Interface\n\nUser experience might not be the first feature that comes to mind when you’re thinking of criteria for your CRM. And often that’s because user-friendly CRMs are intuitive and easy to use. On the other hand, CRMs that are clunky and difficult to navigate can end up causing lots of frustration. Even the most sophisticated capabilities are useless if they’re hard to use.\n\n2. Industry Specialization\n\nNowadays, you can find CRMs built for specific industries or types of businesses. Whether you’re a marketing agency or a realtor, you’ll likely come across CRM platforms custom-fit for the unique needs of your business. You may find that an industry-specific CRM works best for the kind of product or service you deliver and comes with nuanced features that generic CRMs don’t have. \n\n3. Customizability\n\nOn a more individual level, it’s good to use a CRM that gives you full control over feature activation and user privileges. Even if you’re working with a small business CRM system that’s made for your industry, your business’ needs are probably different from others. Having the ability to customize your organization’s CRM means you can get rid of any features you don’t need and keep the experience clean and simple.\n\n4. Automation\n\nWith smart technologies on the rise, we’ve started to see an increasing number of CRMs incorporate AI- and ML-based elements and tools into their software. These added capabilities go a long way to helping your business run on its own and staying in touch with your customers, even while you’re asleep. \n\n5. Affordability\n\nOf course, one of the top criteria to keep in mind while evaluating any CRM is how much it costs. Especially for small businesses that are just starting out or bootstrapping, you’ll want to focus on CRMs that are both cost-efficient and fit within your budget.\n\n6. Scalability\n\nWhile you may be tempted to pick out a CRM that you can afford right now, also be sure to think about whether the CRM you’re leaning toward will be able to scale with you as your business grows. Free or low-cost CRMs may seem like a viable option for your current situation, but you also need to determine whether the CRM you choose today will be able to manage tomorrow’s business levels.\n\n7. Easy to set up and use\n\nAnother key factor to consider when reviewing CRMs is how easy it is to use and set up for your business. Lots of CRMs look great on paper and contain impressive and powerful features, but you may find that some CRMs feel better simply because they deliver a user-friendly experience. \n\nHow Much Is a CRM for a Small Business?\n\nThe total cost of a small business CRM will depend on three main factors — the package/tier, the price, and the number of users.\n\nThe best and most popular CRM platforms typically offer different plans or packages depending on your needs. If you’re just looking for essential features like contact and deals management, you’ll likely opt for a basic plan that’s also affordably-priced. On the other end of the spectrum, you’ll find full-blown CRM packages that provide large-scale sales automation and other advanced features. \n\nIn general, CRMs are priced monthly by the number of system users in your organization. That means the total cost of a CRM per month will be equivalent to the platform’s base cost multiplied by the number of team members who are using it.\n\nWhen considering the number of users for your CRM, make sure you’re only including members on your team who actually need access to your CRM to perform their tasks. While most customer-facing roles will require CRM privileges, the majority of employees focused on production and operations probably won’t have much use for this type of software. \n\nPaid plans typically start from as low as $7 per user and can run as high as $99 per user.\n\nIs There a Completely Free CRM?\n\nThere are many CRMs that offer free plans for new users. While these are often pared-down versions of full-featured CRMs, they provide all the basic functions that every small business needs for effective customer relationship management.\n\nHowever, some businesses may find these “freemium” CRMs to be a bit restrictive, as free versions are often limited in terms of features and usage capacities. \n\nAs a result, if you’re looking for a CRM for your small business that’s completely free, your best bet is to search for a solution that gives you all the sales tools you need without trying to get you to upgrade to a paid plan. Try to stick to platforms that give you full access to all their sales and marketing features at no additional cost. In some cases, you may even be able to find a small business CRM that specifically serves your goals and needs, like Semrush CRM, which is a free CRM solution for digital marketing agencies.\n\nWant to see how Semrush CRM can help your business scale?\n\nGet started with Semrush CRM for free →\nThe 10 Best Small Business CRM Solutions\n\nIf you do a quick Google search, you’ll find hundreds of different CRMs available all over the web, each with their own unique features and capabilities.\n\nSo to help you find your way through the sea of CRMs, we’ve put together a list of the top small business CRMs in 2022:\n\n(Disclaimer: Prices below are valid as of May 2022)\n\n1. Semrush CRM\n\nKey Features:\n\nFrom the same people who brought you one of the top SEO and digital marketing platforms, Semrush CRM is a free customer relationship management software made for agencies and marketing teams. This CRM allows you to integrate your sales pipeline and funnel with data from your client projects, making it an ideal option for growing agencies that want to manage all their client data from one platform. \n\nPros:\n\nFree\nEnriched client and prospect data\nEasy collaboration across teams and with clients\n\nCons:\n\nMade specifically for agencies\n\nWho is it best for:\n\nDigital agencies and any businesses that use an agency model\n\nPricing:\n\nFree\n\nGet started with Semrush CRM free today →\n\n2. Hubspot CRM\n\nKey Features:\n\nAs one of the more well-known customer relationship management platforms, Hubspot’s free CRM offers users a robust set of essential features, such as contact management for up to a million contacts and even email marketing capabilities. For small businesses that rely heavily on email for one-on-one communications with leads and clients, Hubspot also helps you track whether your recipients open your emails and when. \n\nPros:\n\nUnlimited data storage\nFree plan is free forever\nLots of integrations with popular productivity apps\n\nCons:\n\nVery limited automation in free version\n\nWho is it best for:\n\nMost small businesses, particularly any that rely heavily on other cloud-based platforms and tools\n\nPricing:\n\nHubspot’s CRM itself is completely free\nVarious “Hub” add-ons available starting at $50 each per month\n3. Pipedrive\n\nKey Features:\n\nIf you’re looking for a sleek and highly intuitive user experience, Pipedrive is definitely worth considering. On top of helping you automatically organize your day-to-day correspondences across devices, this CRM stands out in particular for allowing users to visualize the entire sales process from the start of a deal to closing. \n\nPros:\n\nEasy-to-use interface\n24/7 email and live chat support\nOver 275 apps and integrations\n\nCons:\n\nNo free version available; only a 14-day free trial\nSecurity features only included with Enterprise plan\n\nWho is it best for: \n\nSmall businesses that want a clean and simple user interface with all the core features of a solid CRM\n\nPricing:\n\nEssential plan starts at $12.50 per user per month\n4. Insightly\n\nKey Features:\n\nInsightly’s main value proposition revolves around its Business Intelligence (BI) features, which, as the name suggests, gives small businesses useful insights into their sales data and performance. This CRM also comes with a sidebar Chrome extension that makes it easier to input customer data into your CRM on the fly. \n\nPros:\n\nComprehensive project management platform built-in\nLead routing and management with milestone tracking\nMulti-step workflow automation\n\nCons:\n\nNo free version available\nAdvanced features not included in basic plan\n\nWho is it best for:\n\nSmall businesses that want to be able to manage both projects and their sales pipeline using the same platform\n\nPricing:\n\nPlus plan (their cheapest option) costs $29 per user per month, billed annually\n5. Keap\n\nKey Features:\n\nKnown in particular for its email and marketing automations, Keap is another all-in-one CRM solution that’s built to scale with your business. Preset templates and customizable workflow automations help your business to run on autopilot and can save your team 10 hours a week on average. \n\nPros:\n\nAutomated sales cadences and follow-up sequences\nUser-friendly interface\nComprehensive contact management\n\nCons:\n\nLead-scoring only available in Keap Pro\nAdvanced functionalities take some time to learn\nBasic plan is on the pricier side\n\nWho is it best for:\n\nAny small businesses that regularly send email updates to their customers\n\nPricing:\n\nLite plan starts at $79 per month for 1 user, billed monthly\n6. EngageBay\n\nKey Features:\n\nFrom solopreneurs to established companies, EngageBay offers one of the most comprehensive CRMs at a relatively affordable price. Equipped with plenty of marketing tools like landing page builders and lead generation forms, this is the perfect CRM software for businesses that want to manage their sales and marketing efforts from one interface.\n\nPros:\n\nAll-in-one platform that supports a variety of business needs\nBuilt-in communication hub\nFast and helpful customer service\n\nCons:\n\nNot the most intuitive user interface\nLess than ideal training documentation for new users\n\nWho is it best for:\n\nSmall businesses and startups looking for a CRM with powerful marketing automation\n\nPricing:\n\nFree plan available\nBasic plan starts at $14.99 per user per month, billed monthly\n7. Salesforce\n\nKey Features:\n\nAs one of the top CRMs overall, Salesforce is one of the most advanced customer relationship management softwares available for small businesses. That’s because Salesforce comprises a network of features and platforms built to address all aspects of the customer journey, from SMS messaging to email marketing and digital advertising.\n\nPros:\n\nFully cloud-based platform\nAble to connect with other powerful Salesforce tools and platforms\n\nCons:\n\nSteep learning curve\nNo free version\nSetup may take longer than other CRMs\n\nWho is it best for:\n\nGrowing businesses that are looking for a full-fledged CRM with limitless scalability\n\nPricing:\n\nEssentials plan starts at $25 per user per month when paid annually\n8. Bigin by Zoho CRM\n\nKey Features: \n\nBigin is a pipeline-based CRM solution from Zoho CRM that’s tailored entirely to small businesses. Designed to be lightweight and straightforward for users, Bigin offers all the bare essentials for setting up a solid CRM system and leaves out the complex functionalities and steep learning curve that come with heavy-duty CRMs.\n\nPros:\n\nNative mobile version available\nBuilt-in telephony\nCustomizable dashboards\n\nCons:\n\nCertain mobile integrations only available on iOS and not Android\nMinimalist interface may take some getting used to for traditional CRM users\n\nWho is it best for:\n\nBigin is perfect for small businesses that want a simple CRM that’s accessible on both PCs and mobile devices\n\nPricing: \n\nFree plan available\nExpress plan starts at $9 per user per month\n9. Capsule\n\nKey Features:\n\nFor any businesses that rely primarily on cloud-based platforms for working and collaborating, Capsule provides a sleek online approach to customer relationship management. Trusted by thousands of businesses around the world, this small business CRM system offers loads of customizable features, from user permissions to custom filters and views for sales pipelines. The extensive customization makes Capsule the perfect CRM for small businesses that are looking to transition from an overly-simplistic solution to something that offers more advanced capabilities.\n\nPros:\n\nContact re-engagement reminders\nWide range of integrations specific to SMB tools and platforms\nClean and straightforward interface\n\nCons:\n\nLackluster analytics\nLimited scalability for growing businesses\n\nWho is it best for:\n\nSmall businesses looking for a CRM that makes cross-team collaboration easy\n\nPricing:\n\nFree plan\nProfessional version starts at $18 per user per month, billed monthly\n10. Agile CRM\n\nKey Features:\n\nAgile CRM markets itself as an all-in-one small business platform equipped with Fortune 500 functionalities. This includes features such as sales gamification and even a built-in wireframe tool for prototyping your digital assets and products. Their one-click plugins and integrations also make it easy to sync your CRM with all the third-party apps and services you currently use to conduct business.\n\nPros:\n\nVery affordable\nAutomated sales pipeline system\n\nCons:\n\nNot the most integratable CRM\nSubpar reporting\n\nWho is it best for:\n\nSmall to medium-sized businesses that want sales, marketing, and service automation all in one CRM platform\n\nPricing:\n\nFree version available\nStarter plan starts at $14.99 per user per month, billed monthly\n\nThese are just a few of the many CRM systems available for small businesses. This is why it’s worth setting aside a reasonable amount of time to filter through the different small business CRMs on the market to make sure you don’t leave out any compatible platforms.\n\nHowever, even the best overall CRM for small businesses may not be the best CRM for your small business. Here’s how to land on the right solution for your needs.\n\nThe Best CRM System for Marketing Teams and Agencies\n\nWhile there are many CRMs aimed specifically at marketing agencies, only a handful offer the advanced functions that marketers use on a daily basis to fulfill tasks and projects for their clients.\n\nSome full-fledged CRMs like Hubspot and Keap do provide marketing automation tools, but these services typically cost extra. In addition, most CRMs are built as all-purpose platforms intended to serve a variety of industries and business types.\n\nFor agencies that are looking for a CRM solution that cleanly connects with their day-to-day marketing activities, Semrush offers its own free CRM.\n\nHow to Use Semrush CRM?\n\nSemrush CRM is a client relationship management platform made specifically for online marketing agencies. Built on top of Semrush’s suite of digital marketing tools, the Semrush CRM is dedicated to helping agencies generate new business more efficiently while keeping existing clients happy.\n\nWhat You Can Do with Semrush CRM\n\nUnlike other CRMs that are geared toward agencies, Semrush CRM is built from the ground up as an extension of an existing marketing platform. This offers several benefits specific to growing marketing agencies:\n\nConvenient organized storage of all your client data in one place, from contact information and details to quick notes, project files, and client assets\nEnriched data about your leads and clients, including the specific marketing and development tools they use and instant access to their social media profiles\nStraightforward task management that gives everyone on your team the ability to create, edit, and prioritize tasks across multiple projects\nThe ability to create client portals, which allow your team to share custom-branded reports with your client and request approval for required tasks\n\nThese are just a few of the key features included with Semrush CRM. To find out more about what Semrush CRM can do, visit the main page.\n\nHow to Get Started with Semrush CRM\n\nGetting started on Semrush CRM is as simple as signing up and adding your clients to your contact database.\n\nOnce you’ve created your account, you’ll be able to manage and monitor your entire customer workflow, from onboarding to project fulfillment. For every client you add to your CRM, you’ll be able to connect data from other Semrush marketing tools to your client’s profile.\n\nFor more info on how to make the most of Semrush CRM for your business, please refer to this article.\n\nConclusion\n\nAs digital technologies become a bigger part of customer journeys, businesses of all sizes need to leverage CRMs and other sales-based platforms to keep up with consumers, especially small businesses.\n\nNot only do CRM systems allow small businesses to store all their customer data in one spot, but many platforms also provide additional capabilities such as collaborative project management and advanced marketing automations.\n\nWhile there are many popular and well-known CRMs available on the market, some CRMs work better than others depending on the type of small business you’re running. Much of the deciding criteria will revolve around your particular needs and the other kinds of software you’re currently using. \n\nMarketing teams and agencies in particular need a CRM that’s able to integrate with specialized marketing tools while also keeping track of ongoing client projects.\n\nFor digital agencies that are looking to expand their client portfolio, Semrush CRM offers a powerful solution that connects to other Semrush tools and is completely free.\n\nWant to see how Semrush CRM can help your business scale?\n\nGet started with Semrush CRM for free →",
  "headers": {
    "h1": "The Top 10 CRM Tools for Small Businesses in 2024",
    "h2": [
      "What Is Small Business CRM Software?",
      "Why Do Growing Businesses Need to Use a CRM?",
      "What Are the Benefits of a CRM System?",
      "What Makes a Great Small Business CRM?",
      "Small Business CRM Features to Look for",
      "How Much Is a CRM for a Small Business?",
      "Is There a Completely Free CRM?",
      "The 10 Best Small Business CRM Solutions",
      "The Best CRM System for Marketing Teams and Agencies",
      "How to Use Semrush CRM?",
      "Conclusion"
    ]
  },
  "images": [
    {
      "src": "https://static.semrush.com/blog/uploads/media/0c/95/0c954e48783a9f32d9a9caa96461a4aa/crm-for-small-business_(1).svg",
      "alt": "q"
    },
    {
      "src": "https://i.ytimg.com/vi/l8kvQL9VuiU/hq720.jpg",
      "alt": "Youtube video thumbnail"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/7d/a2/7da2e21e418c0032919c779e4c8fcef6/1crm-for-small-business.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ca/c6/cac6888355ec7c599c65fe9fbe2f5790/%D0%A1%D0%BD%D0%B8%D0%BC%D0%BE%D0%BA%20%D1%8D%D0%BA%D1%80%D0%B0%D0%BD%D0%B0%202022-05-24%20%D0%B2%2017.20.40.png",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e4/49/e449a0c35b01d4498e1ec9d485b18a94/image.png",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/06/ea/06ea4e3b53dddda8aae97a17ffc4e2b9/image.png",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/8c/45/8c45fc8e5a4a0c49123dbf148fed6e39/image.png",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/bb/98/bb989898fe6b4250f907878221f6d9ac/image.png",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/3d/7d/3d7d8a3e2e802a26a5e4c61ccca1e642/image.png",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e8/4b/e84be12bc56db23d54256b85de2a62f7/image.png",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/41/b7/41b75907ed2d46de7c02c895a135a18e/image.png",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/1b/cc/1bcc009b532c8ae2f4373648f4a444e4/image.png",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/a3/fe/a3fef3f89843b06fced9f8a3c155eeb1/image.png",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/27/55/2755a69b81754977863945ab0115684d/%D0%A1%D0%BD%D0%B8%D0%BC%D0%BE%D0%BA%20%D1%8D%D0%BA%D1%80%D0%B0%D0%BD%D0%B0%202022-05-24%20%D0%B2%2018.52.25.png",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/7d/a2/7da2e21e418c0032919c779e4c8fcef6/1crm-for-small-business.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/semblog-next-static/banners/trial-gift.png",
      "alt": "Trial Semrush banner"
    }
  ],
  "publication_date": null
}