{
  "url": "https://www.semrush.com/blog/biggest-seo-mistakes/",
  "title": "SEO Mistakes: Common SEO Issues & How to Fix Them",
  "content": "SEO mistakes—whether they’re technical SEO issues or on-page SEO missteps—can hurt your ability to rank on Google. \n\nAs you can see in the graph below, click-through rate (CTR) drastically decreases as you move away from the first position in Google’s organic search results.\n\nSo, anything that hurts your ability to claim that top spot can lead to a huge loss in user engagement and profits. \n\nThe bad news is that SEO mistakes are incredibly common. And you may not even realize they’re plaguing your site. \n\nBut the good news is that most SEO issues are entirely avoidable and fixable. \n\nHere’s how to fix common SEO issues that may be keeping your webpages from ranking No. 1 on Google. \n\nTechnical SEO Issues to Avoid\n\nTechnical SEO is the process of optimizing your website to rank on Google through non-user-facing techniques. Like optimizing site speed, sitemaps, and other backend features. \n\nThis side of SEO is necessary if you want to rank at the top of Google. But technical SEO issues can be easy to miss—and hugely detrimental. \n\nHere are some common technical SEO issues and how to stop them from damaging your site’s performance. \n\nDuplicate Content\n\nDuplicate content refers to a page on your website with the same content as another page. This may mean it’s an exact copy. Or shares most of the same content with some variations. \n\nThink of templated pages with a few words changed. Or a U.S. and a U.K. version of the same page.\n\nHaving duplicate content is an SEO issue. Not handling it correctly can have negative consequences, like:\n\nCausing the wrong version of a page to show up in the search engine results pages (SERPs)\nCreating issues with the indexing of your website\nPoor or chaotic page rankings\n\nThese are all serious problems that can lead to huge losses in traffic. \n\nHow to Fix Duplicate Content\n\nThe first step to fixing duplicate content is finding it. \n\nTo find duplicate content on your site, open Semrush’s Site Audit tool and enter your domain.\n\nConfigure your settings and click “Start Site Audit.”\n\nOnce your audit is complete, click on the “Issues” tab. \n\nEnter “duplicate content” in the search bar in the upper left. \n\nHere, you’ll see an error message alerting you to duplicate content issues on your site. To learn more about the problem, click “Why and how to fix it.”\n\nPossible solutions to your duplicate content issues include:\n\nAdding unique content to one of the duplicate pages\nAdding a rel=\"canonical\" link to one of your duplicate pages to tell search engines which page to show in the SERP \nUsing a 301 redirect from a duplicate page to the original one\n\nFor a more detailed breakdown of when and how to address duplicate content issues, read our duplicate content guide.\n\nFind and Fix Duplicate Content\n\nwith the Site Audit Tool\n\nTry for Free →\nUnder-Optimized Meta Tags\n\nMeta tags are snippets of HTML code that give users and search engine crawlers more information about your website. Under-optimized meta tags are missed opportunities to improve your site’s performance. And can affect the way Google or a potential user interprets your page. \n\nTwo common examples of these tags are title tags and meta description tags. \n\nNote\n\nTitle tags are not technically meta tags. But they serve a similar function. \n\nTitle tags help establish how the title of a webpage shows up in the SERP and on a browser tab. Like this:\n\nMeta description tags can influence the brief description displayed below a page’s title and URL in the SERP (although Google has said it most often does not use the meta description to determine this snippet).\n\nThese two tags can help Google connect your page to a relevant search a user makes. And then help a user decide whether your page is worth clicking on when they’re browsing the search results. \n\nAlong with the title tags and meta description tags, you can—and should—optimize other tags, like H1 tags (which serve as a kind of on-page title of a webpage) and alt text (which details the content of images for screen readers and crawlers). \n\nCommon causes of meta tag under-optimization include:\n\nMissing tags \nTags that are too long or too short\nDuplicate tags\nHow to Fix Under-Optimized Meta Tags\n\nTo find whether you have missing or duplicate tags, go back to Site Audit and open your report. \n\nClick on the “Issues” tab and search for the term “tag.”\n\nIf you have missing or duplicate tags, you can easily fix the problem by adding tags where needed or altering duplicates to be original. \n\nTo avoid common meta tag issues, optimize them from the beginning. For example, a page’s title tag and meta description should:\n\nContain the target keyword \nBe unique to that page\nSummarize what a user can expect to find on the page\nBe relevant to the intent behind the target keyword\nImage Issues \n\nOptimizing images on your site can help you rank on Google Images, improve your site’s accessibility, and enhance the user experience (UX). On the other hand, having image issues can hurt the user experience, slow down your site, and lower your ability to rank.\n\nCommon SEO image issues include:\n\nLack of alt text: Alt text tags are attached to an image and explain what the picture is showing. These tags allow screen reading software to tell users who may be unable to see the image what the image depicts. And provide additional image context for search engine crawlers.\nOversized images: Oversized images can slow down your site’s page speed—a proven Google ranking factor \nBroken images: Broken images are images on your site that can’t be displayed because the image no longer exists, the URL is missing or incorrect, or the file path is invalid. Broken images severely undermine the user experience and signal a poor-quality webpage.\nHow to Fix Image Issues\n\nLet’s break down how to fix or avoid each of the most common SEO image issues:\n\nLack of Alt Text\n\nThis one’s easy. Just like fixing other meta tag issues, use Site Audit to find missing or duplicate alt text tags. Then, add or replace those tags.\n\nMoving forward, assign alt text to every image you publish on your site. Best practices for alt text include being descriptive, unique, and natural (that is, don’t try to stuff in keywords). \n\nOversized Images\n\nTo optimize image size for SEO, you want to get your image file size as small as possible without compromising the image’s quality. \n\nOne effective way to do this is by compressing your images. Start by resizing your image using a free tool like PicResize. \n\nThen, you can use a tool like ImageOptim, or the WordPress plugin Smush, to further shrink your image without sacrificing its quality. \n\nBroken Images\n\nTo find broken images on your site, go back to the “Issues” tab in your Site Audit report. Search “image” to find notices about broken images.\n\nOnce you’ve found the broken images, there are a few ways you can fix them, such as:\n\nChanging the image URL\nReplacing the image\nSimply removing it from the page\nSlow Load Speed\n\nLoad speed (also called “page speed”) measures how quickly your webpage’s content loads. It’s a confirmed Google ranking factor.\n\nAlong with being a ranking factor, page speed affects how likely a user is to engage with your site. \n\nUsers are much more likely to bounce from a page (i.e., click back to the SERPs quickly) that takes a long time to load. \n\nEven if a user doesn’t bounce from your page, slow page speed creates a frustrating user experience. And can lower your ability to rank well on Google. \n\nHow to Fix Slow Load Speed\n\nTo fix your load speed, open your Site Audit report. \n\nScroll down to “Thematic Reports.” Locate the “Site Performance” box. And click on “View details.” \n\nThis report will highlight issues with your website’s load speed and performance. \n\nPrioritize fixing anything listed as an “Error.” Then, focus on “Warnings” and “Notices.”\n\nSome common solutions for resolving slow load speed include:\n\nCompressing your images\nOptimizing your HTML code \nMoving to a different hosting service (if the problem is coming from your web server)\nMinimizing your files or code through minification\nEnabling browser caching \n\nAs always, you can find more information about fixing your load speed issues directly in your Site Audit report. \n\nPoor Crawlability \n\nBefore serving up a webpage in the search results, Google first has to crawl and index that page. \n\nIf Google bots are unable to crawl your webpages, they can’t be indexed. And they can’t be displayed in the search results. Meaning the page is losing out on valuable traffic. \n\nBad crawlability can be the result of different SEO issues, including:\n\nPages blocked in a robots.txt file\nLink issues (like broken links, nofollow links, and lack of internal links)\nUnindexed pages\nRedirect loops (when Page A redirects to Page B, which redirects back to Page A, and so on)\n4xx errors (a page cannot be accessed)\n5xx errors (a server cannot perform a request)\nPoor site architecture \nHow to Fix Poor Crawlability\n\nCrawlability issues are some of the easiest to miss. But they can be the most harmful, as they block search engine crawlers from properly accessing your pages.\n\nGo to your Site Audit report and scroll down to “Thematic Reports.” Here, you’ll see your site’s “Crawlability” score. Click on “View details” under your score. \n\nThis report shows your site’s indexability. And where crawl budget is being wasted.\n\nYou can also click over to the “Issues” tab to see a breakdown of errors affecting your site. Many site errors will, in turn, affect your website’s crawlability. \n\nUsually, these problems are easy to fix. And you can prevent them going forward by implementing best practices. Like maintaining sitemaps, optimizing your site architecture, and embracing an internal linking strategy.\n\nLack of Mobile Optimization\n\nThe majority of Google searches are made on mobile. And Google prioritizes mobile pages. \n\nSo, failing to optimize your website for the mobile experience can be a huge SEO mistake. \n\nThere are three primary methods of making a site mobile-friendly: \n\nResponsive design: This allows you to serve the same page to a desktop or mobile user. The link stays the same, but the page displays differently depending on the device.\nDynamic serving: The URL stays the same, but the HTML changes based on the device\nSeparate URLs: Or you can have different URLs for your desktop and mobile sites (generally not recommended) \n\nNote\n\nGoogle recommends against using the separate URLs method. It creates duplicate content that can be a hassle to clean up. \n\nHow to Fix a Lack of Mobile Optimization\n\nFirst, you’ll need to establish a mobile-friendly site using one of the methods mentioned above. \n\nBut your mobile efforts shouldn’t end there. \n\nAs the mobile experience is so important—to users and Google alike—optimizing your site for mobile can improve your search rankings and the user experience. \n\nTo identify technical issues with your site’s mobile performance, open your Site Audit report and click on the “Issues” tab. \n\nThen, do a search for the term “mobile.”\n\nHere, you’ll find issues relating to mobile performance, like problems concerning Accelerated Mobile Pages (AMP).\n\nThere are also non-technical ways to optimize your mobile site. Like:\n\nWriting shorter paragraphs (for enhanced mobile readability)\nUsing white space\nAvoiding intrusive pop-ups\nOptimizing title tags and meta descriptions for mobile search\nCommon On-Page SEO Mistakes \n\nOn-page SEO is the process of optimizing the user-facing elements of a webpage to rank higher on Google. It addresses components like your content structure, internal links, and keywords. \n\nMaking mistakes with your on-page SEO can lead to a poor user experience. Which can, in turn, lead to bad search rankings. \n\nTo keep your site’s on-page content SEO-friendly, avoid or fix these common issues. \n\nLow-Quality Content\n\nSearch algorithms are designed to deliver the best content to users. So naturally, low-quality content is unlikely to rank well on Google.\n\nPlus, it can lead to poor user engagement, bad conversion rates, and diminished brand reputation. Making low-quality content an all-around gut punch to your SEO efforts.\n\nYou may have published low-quality content intentionally by cutting corners to save time and money. Like using AI writing software and not editing or fact-checking the results. \n\nOr you may have unintentionally published low-quality content. \n\nLike pages with outdated information and grammatical errors. Or pages that don’t match the user’s intent for the search query that led them to your page. \n\nIt’s also possible that your once high-quality content is now considered low-quality because it doesn’t meet new E-E-A-T and YMYL standards.\n\nE-E-A-T stands for Experience, Expertise, Authoritativeness,and Trustworthiness. \n\nIt’s especially important in pages discussing “Your Money or Your Life” (YMYL) topics, which have the power to impact a person’s livelihood.\n\nLike other aspects of SEO, what’s considered high-quality content is constantly changing based on evolving search algorithms and user needs. \n\nNote\n\nE-E-A-T is not a direct ranking factor. Rather, it’s a way of understanding the quality standards Google is looking for.\n\nHow to Fix Low-Quality Content\n\nThe obvious solution to low-quality content is to produce high-quality content instead. High-quality content is:\n\nAccurate\nRelevant\nReadable\nUseful\nGrammatically correct\nCredible (has strong E-E-A-T)\n\nMost importantly, high-quality content matches users’ search intent. Meaning it gives searchers what they intended to find when they Googled the keyword your webpage is ranking for (or hoping to rank for).\n\nTo uncover optimization opportunities for your on-page efforts, go to Semrush’s On Page SEO Checker and start a new project.\n\nEnter your website’s URL and click “Get ideas.”\n\nSelect your target location and click “Continue.”\n\nYou can manually add pages you want to optimize, upload a CSV file, or connect Google Search Console. Or you can stay on the “Auto Import” option to have the tool collect your 50 highest-ranking pages. \n\nThen, click “Collect ideas” to generate your on-page SEO report. \n\nThis report shows you ideas for improving your on-page SEO through strategy, content, backlinks, SERP features, and more. \n\nOptimize Your Pages to Rank Better\n\nwith the On Page SEO Checker\n\nTry for Free →\nKeyword Stuffing\n\nKeyword stuffing is the practice of using keywords unnaturally in your content. The idea is to rank higher for those keywords. But instead, it makes your content difficult to read and can send negative signals to Google.\n\nIt can even result in a Google penalty. Meaning some or all of your webpages can be removed from search results.\n\nLike other practices that Google penalizes, it’s seen as an attempt to manipulate the search algorithm.\n\nSo, jamming a target keyword into a page over and over again won’t help you improve your website rankings. It can even hurt them. \n\nHow to Fix Keyword Stuffing\n\nUse keywords naturally. \n\nOptimizing a page for keywords should never mean sacrificing naturalness in an effort to play the search algorithm. Instead, focus on choosing the right keywords, how you use them, and how it all contributes to the user experience.\n\nFor example, your target keyword should appear in your page’s:\n\nTitle\nMeta description\nOpening paragraph\nBody (when it naturally comes up)\nAlt tags\nHeaders (some, not all)\n\nIf your target keyword doesn’t sound natural in the body of your content, don’t be afraid to use a variation. \n\nFor example, the keyword “how to bake a cake gluten free” doesn’t make sense exactly as-is in a paragraph. But something like “How to bake a gluten-free cake …” sounds natural and still conveys the meaning of the target keyword.\n\nKeyword Cannibalization\n\nKeyword cannibalization (or “SEO cannibalization”) is when you have a page on your website targeting the same keyword as another page. \n\nAs multiple pages are competing for the same keywords, both of their rankings suffer.\n\nKeyword cannibalization can happen when you have duplicate content. Or if you’ve published similar content over time. It can even be caused by subcategory pages that aren’t distinct enough from their parent pages. \n\nNote\n\nKeyword cannibalization happens when you target keywords with the same search intent. You can create distinct pages for two very similar keywords if they have different intents. For example, “best grilled cheese” and “best cheese for grilled cheese” are similar keywords. But they bring up different results in Google. So you can create non-cannibalizing pages for both keywords. \n\nHow to Fix Keyword Cannibalization\n\nAvoid keyword cannibalization by researching the search intent behind keywords you choose to target. Create unique content that serves a distinct purpose. Or follow best practices for handling duplicate content (if that’s the source of the problem). \n\nTo uncover keyword cannibalization you may not know exists on your site, go to Semrush’s Position Tracking tool. Enter your domain and click “Set up tracking.”\n\nEnter your target location, then click “Continue To Keywords.”\n\nNext, manually enter keywords you’re worried about. Or import keywords from Google Analytics. \n\nAfter you add keywords, click “Start Tracking.”\n\nWhen your report is ready, click over to the “Cannibalization” tab to view a report of pages and keywords that are possibly being cannibalized. \n\nIf the report reveals pages that are competing for keywords with the same intent, choose a page to favor. From here, you can use redirects or canonical tags to indicate the “true” page for that keyword. Or you can opt for content creation or optimization to satisfy unique keyword opportunities. \n\nTrack Your Rankings with Ease\n\nwith the Position Tracking Tool\n\nTry for Free →\nOver-Optimized Anchor Text\n\nAnchor text is the clickable text that links to another webpage. \n\nLike this:\n\nOptimized anchor text can help your SEO efforts. And improve a user’s experience on your page. \n\nHowever, over-optimized anchor text can hurt your efforts. And even be seen as a malicious attempt to manipulate the Google search algorithm. \n\nHere’s an example of over-optimized anchor text directly from Google:\n\nThis anchor text over-optimization is done in an attempt to associate that page with that keyword, thus ranking higher for it on Google. \n\nThe issue is that this is at the expense of the user experience. These rich anchor texts aren’t descriptive enough. Meaning users aren’t clear what the page on the other side of the anchor text is about. And Google doesn’t like that.\n\nHow to Fix Over-Optimized Anchor Text\n\nYou’ll naturally avoid over-optimized anchor text if you follow anchor text best practices, like being:\n\nNatural \nDescriptive\nConcise\n\nIn its guidelines on best linking practices, Google says:\n\nTry reading only the anchor text (out of context) and check if it's specific enough to make sense by itself. If you don't know what the page could be about, you need more descriptive anchor text.\n\nKeep in mind that Google tries to reward websites that prioritize the user experience. So always consider how your users will read and interpret anchor text. Rather than how a search engine crawler will. \n\nDon’t Let SEO Issues Slow You Down\n\nSo now you’ve fixed your technical SEO issues. Or taken steps to avoid common on-page SEO mistakes. \n\nBut the thing about SEO problems is that there are always more. \n\nYour website is constantly changing. So are search engines. With every evolution, there’s room to improve. \n\nAnd room to mess up. \n\nEven the best websites on the internet will face SEO issues (ones they may not even know exist) and fail to embrace SEO best practices 100% of the time.\n\nTo check for SEO issues—and keep small problems from turning into big ones—use Site Audit to regularly audit your website and fix problems before they spiral out of control. \n\nFind and Fix SEO Issues\n\nwith the Site Audit Tool\n\nTry for Free →",
  "headers": {
    "h1": "SEO Mistakes: Common SEO Issues & How to Fix Them",
    "h2": [
      "Technical SEO Issues to Avoid",
      "Duplicate Content",
      "Under-Optimized Meta Tags",
      "Image Issues ",
      "Slow Load Speed",
      "Poor Crawlability ",
      "Lack of Mobile Optimization",
      "Common On-Page SEO Mistakes ",
      "Low-Quality Content",
      "Keyword Stuffing",
      "Keyword Cannibalization",
      "Over-Optimized Anchor Text",
      "Don’t Let SEO Issues Slow You Down"
    ]
  },
  "images": [
    {
      "src": "https://static.semrush.com/blog/uploads/media/28/3d/283d7c8ca05ec29e99a4305198d5c85b/biggest-seo-mistakes.svg",
      "alt": "SEO Mistakes Damaging Websites"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/5d/77/5d776972c3abacb3c1baaf605e08857c/04d8931b1c1a80357176f761a912c9b8/QbV3ylEPMasf_MFZOR4Wg734HTXpk-Zto-a1mhNVKcTRcgR4VqJInqEsE4yBzElSkDuN4BwgXLusS870MWIs264KLnZwJgcwEeXMyC8oZLTYfsD3kaEYP0_vdxVzfYAVvEQaKQrliKBBVVm5M9Z6gQ0.jpeg",
      "alt": "Google organic CTR breakdown by position"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/7f/de/7fde07734c4a3bab3e4032863e2bf026/e2bf8a7a14d2545b793c4b1eeb4f4751/vY7LyhslOSwQ4d39sBwGg_z655mDGc-B9p8fq4dFwe-obQLnsl8-HtoYsYPYGGEHPsXgNmtacLUfhKpFkfmIaDjgrSEo3PKVxQif7w_nem93G6FBlYFFn0ymQOy-P17KAyf_UR7MgSuiZRD_dsAwxGo.png",
      "alt": "Site Audit tool search bar"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e9/8f/e98fcee30f4fac3fc5cb0d740dda1d4f/00b121a380023bcbbb831b525194e53c/cd5U-Mj-P_YV7nhCR-DSIPUvM2NNSeKlZ0fSfNfF_QU5o4LEA8SO2NH9abMLTvy1JdLIF3tBpcJ1IcQwHIKXInBb25JvCGVHEMbr3M-R-zEEWjWiCuOh7WKeLzyRBhxFBGeJpwj7aQK5LtGO1WpTPIw.png",
      "alt": "\"Site Audit Settings\" window"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ea/8a/ea8aa704d0a678f17a70e0a9af2abacc/a232b0e1697605e624bf1a0a8994a4c7/Cv_xDQ3AAe0Y7OLR5TM50xRmsyXjgZLOpILkUvwGyP1I5StP6Ui1_nZeBMLGV62k7spCOd8Ckh8cISe_8TudoBYPnRo-VnfBGaqNSh90F7cEXF-EIsw7Easn4UiiVQ4i_5vYwsiQh5qIxSPt26cufU0.png",
      "alt": "\"Issues\" report in Site Audit tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/7a/2c/7a2c928bea0ae2bc4f8d0e3d466dd6a1/d71610acf7931989c6e98aef289a536f/nC0mjVeSuj6ckySyy-n5sH05mW0n2cxT-TyGvLkwHgo2Q2sjeBRCRy4OvXBo4km2U-1Gx19UAWOwQN0gMEt5eAJTEJs731360JeY_R7uzFScogVvyBr4wFa8FjDUlkKiVN1rwItZKhJykDNsHZrZtLU.png",
      "alt": "Searching for \"duplicate content\" under \"Issues\" tab"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/14/11/1411e147053a8e2521a3574d85d5fd84/c80d1e33863774656880743b350b238e/ETo5bg0GPrnztdWgI9_2upwKpEnXNUiYNIA-J01pOZc3dP_iku0x7zgNdbxo8eBOdImnXCc7oVIgIYrcf_c67OdYNjEMpcfu5IQRU_vS6pWZnMrtVwIiiTYrh6WgTCGQxjGnYLuyA82eqtaQ66MBsII.png",
      "alt": "\"Why and how to fix it\" window opened for \"2 pages have duplicate content issues\" result"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/b6/c1/b6c1a0e80a8756e7eab4229ed33537bd/c0cc1a385a5eb7b32fcfd1a0c6b1196f/0qb2GqmF1DzwFvoHdHPV_vuCLxeTPk3GqVzmbmGfiHZ3GlLLQ-IkRmItY6ly6cEesDs1EV6StmhdfcKx-fBovSckOfYXSlbPPdobzJ_6r9xeiIsffYSOPl8b_8SegZdzH14X3PHzH2tI-zORsiJKC9o.png",
      "alt": "Title tag on the SERP that reads \"5-Minute Homemade Latte (No Fancy Equipment)\""
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/a9/e4/a9e44b6df4c7e6456baa282662901b9f/99757fbeee69e80473e961aeda43aee6/j1XahBKO3hlWIzUgmZjr1TPlWDeUsEEtUt7BeoqNzHO1v4DL_5tgnNU3_1kmrVueQd-wKpOqJ6HlrHWSlvdKlMYsyJxpxUES3AMChucx4tnxVpopLjIpLKG8wTqOUnVwtTVEYJHClJaBCwaZN-WnCvQ.png",
      "alt": "Meta description highlighted under the title tag on the SERP"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/c6/58/c6583b43c015a1e5aab9587f9c83768f/3eebc2ca31f625c34bf92c75fc2bbb8c/uAfivISBScXWxQLH6ku14FvNpZ0DW8qyKHEJ_sdxRNoohpbu2sdlWmUGNgCOxDWfgpnH-6IJAOqzrGrLMgdw9bG53za5bW8wzul8evRA_VLvJVSgUo2K-VCcZ34MLJrnktPlM1bi4QTWxnfz8y71wdE.png",
      "alt": "alt text that reads \"Up close side view of latte in mug.\""
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/d3/37/d33775ed74481924e76c9c8df1f5bd69/1d478fa0d7b1bb53ca38944feb4c14f1/ESWmmpKuKPt4ZeMe4dr0JlhnYCIsLP8GU0FLSz9Xhxrw49B4acUE1aCqSDoawwh0Xs6sehHXqL-LejzOguZzYeGc9Rrcl_iIg71n6t8iILaZFu3p9QuIk-_VrsKLlqNKhEUYGHy1PgJqIgZvV7ovdJs.png",
      "alt": "Searching for \"tag\" under \"Issues\" tab"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/10/65/1065b84bc895e3587b8276a146cf5645/afca312b58b4c0edb1ab3771a37ec15d/good-alt-text-example.jpg",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/9d/c1/9dc11098e00f21a8288e532252e9f9b5/048b50152b7fe732cc831abfccc8fbe7/picresize-oversized-images.png",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/a2/ee/a2eec73bcd6d6e78e6db7794899acb96/d54034d07ed6a6afc525e5053ab9a107/WzbEYzZQQB_lVFy_3G0jrYsfyfeRLCS7QA7Y5yUvR-eWIdpEFDUzXt6PTn2UGqCcNAac3QEkZXmr2JuPJsdACuA7qsLmbDxKuJAip2WRKIbRatAuN8BxoCNzPRsQe9EmaR6BTwtQNOmyWwEt5oMPgXM.png",
      "alt": "Searching for \"image\" under \"Issues\" tab"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/d1/2f/d12f758c9a87e0f0e3fe6105b82f2b68/e79390202865d62afcf5b8c217635a4e/de0HN6HHqoqmuDyUpfw_QEzfu__sWhBTVj9wKvdkH0XXIJbqLstib613EST1TD1EuNi2SLWYYjfgA7iENZ2ESzuwmd_2v6-ci7sLHdqGgQLwQfisEXkl8-dxwz70yKgIPid-gxa3weTKmSne-KSEXPo.png",
      "alt": "\"Site Performance\" widget highlighted in the Site Audit's overview dashboard"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/91/1c/911c01d0b55100365a8e0b89fec0464e/20a533244d17a6b6011a4ecc66ea6173/sRSjDffRQQ9IWoM3zZrUMtl-B7yK9rgrTG2HPe52L5DX7ezUMQuq2A9xV3fYZIqyz4Mhy5dBzzg6Z78KrL-WV85iul3P_CquZUg_yXI9w4CZYLSBJIH5Xvqk4nb0-Kxqgqcypez0_dm5oop06OI44aY.png",
      "alt": "\"Performance Issues\" report in Site Audit tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/f1/06/f1060ab8253cac27d2b3acb41c70f15f/a331639e1df8b631528f1a178e572453/3KL_jBkR9bznuC7Q-VmryztmV2-n8fzblsHsV9qvqF2JrLPXLsFQy8zPEVuYFOXNM1UGePDFTZnIdJ4-EyTNRmpWKwjlFv9ZDpJ7y96wDDhXn2brTCeUBs0vbqQU9n6QwDqOkAQ8ApDD4FsD1uHINN4.jpeg",
      "alt": "How search engines work"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/37/20/3720b0604b0549914b33844624a92943/5f6ed24d3301a3b5c05c0535b5a011b2/wzHfPaYC-eiKMqp8tLn1j4x-7gMheScjYp8IQt-a6iywsAgxSsm1d3PecMQTslpXL7mWxeccSyjCUxjMF548ifVsWD0xzPIiKYa1RZtB8UfYpaJKsnK8BrMb69uWifY27IVGZ2KoBSODfMes08vFUnI.png",
      "alt": "\"Crawlability\" widget highlighted in the Site Audit's overview dashboard"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/32/cd/32cded2232b43b7c970e588009ca75d6/8671834f4ea779abf423bbcaa47d1784/DQujmY0Aib6U8rbcLlrBsZ2bPPFGu8DiBQ2PYIqmal2dFaESorGRq2Kp8SUVgSqzOxkhkLbPAfICRoGJy1iFgnyW3S7TcLyofbIKE-OEbwQf3JSwwGgl50CJdmyEkIPoajmDscA4wQYkOla1s8fFG-8.png",
      "alt": "\"Crawlability\" dashboard in Site Audit tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/77/be/77beb24ad204827dc052eb817988fa4d/5144bfbb58805dddc05f0311c03b074b/YWrtAnTAZFt-WKbtPUJ_kGPfKvQe1ufBxKqQpb6Oy6NcQ5BpBA_B5qzyKYrUz2Q3sCeRr5obGJW38SSv8uz1gUHaauMG5aaYjoFkD_zdvkvnLyfNqaPmSACXjY4TQM_na0fSAD-IVMNm-kgjtMdmLIk.png",
      "alt": "Site Audit's errors list that affect crawlability"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/5b/7e/5b7eb85a731f6e37e76e1758aa75963a/c98935c6d544d266539333067a413275/Ipe2nF2xEaIRzefukts20IYe2aPU3ITt8OETGnq95wh8chXBnJbwyfdNgKn77CfpSnU6XUu0Art_Ts_5asOpF1ssZ9Q9RL4X2aWN1Z9dk2-569yC15TTGIPhhyXyBvRwZBS3cPonPYwsjo-Rfw4_O00.jpeg",
      "alt": "How responsive design works on mobile and desktop screens"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/22/54/2254d516bd29dd0cca976282bcf23be0/a02aeb32a4a38a990a891a034d82aee4/Wt74ufZEqoCxp0zUof7w3oLu8ltcxiOFECrfZDuK_TCxCpiMxAJV9So3l42Mtc4ypjb3gMjUvAgaxz6PWi-hEO0JAj9qDWbQ8BBe-vwJxTS7Nj-692mK0g8XANTfISMjGlPpG1tGqrApzvsvYXiJYCQ.jpeg",
      "alt": "How dynamic serving works"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/5b/a2/5ba2ea0a324e61d31209ed5d5c5f8340/e89f1aa19fc0ec48882c41ac6cd3b349/hOtV7C6vPXeZsBi87IPKVrBkjG1JDXG8BcP4iOy45q-IkKztyGWusYNoVaylA6wMISu2MNOurH7KSLml-7IkQAuTb-gln7iWI4FVQJoBnJGp5q3E1q0HqsPopjLShCTT5cB2odLEREp49Ll8AzuXncc.jpeg",
      "alt": "Separate URLs on mobile and desktop screens"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/13/52/135289736b0306d0db61de560feb4e88/9fe6f3606a7a7585176e688119f0706e/RKv1hzIxAtwuK-pObMFUtjstKqle9c4NCNrOZmXxMxt6jzwCmQsRff4tH51LoUAtDlgLoO_PuGTPGHxpIPaPl2x8fgykn5tMAyUtKd8oT9RSmSGhP2e47dguXWb8mPKlbzSgeQgiSHgjy932lEABE5U.png",
      "alt": "Issues related to mobile performance in Site Audit tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/23/23/232346ed94d4b5ca7631595edd379b78/c34b26d51d99632f10e13e16f810b8eb/U66MWSVMvXeqjd9yYmgCItxu6sfAEkVQl734mYZgbYJeBKADIHQLJpliBFAI9r7Mui9VxOnIqpwVTAkCqvAuQ8y5nZF5403tXioVQ38tcbS1oKtWVPWuzGGY7T94wsFrjQEN5HxEMs03IwB_ZuDujnA.png",
      "alt": "What E-E-A-T and YMYL stand for"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/f9/4b/f94b99f9bd094c05922fd30d99a77bfd/062b8829be4bfed7350dcd2435d47499/k9akYpQWLMtRJBQ6OVi79KKGZWYVD4azvteOfXe62OHgI9hDKchFIBRWnsg47Kb-8QDElR2MzCrQ2bX8GzXYbkFH932V-_DEumu6JyhQ_Epcul3wOMxqRzS85pFdekSuZyNRinii13ghn4wFbFhQMtQ.png",
      "alt": "On Page SEO Checker search bar"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/d6/6f/d66fb19b8e987be7a8bda0ff3bd668d0/3f35c21e16e41d13aa72366471cc47ae/Q5mUIWT_idqMXVgBKcibYBr-jWQQf0-zwqVL9uF58a5XtpUtoNLgMIddBQ5JWf00v4eB-szFgah_onmTEcUP-4PaYj3n7JwZvXXTs3E4pOp2eyKZIC4kgOcs6VUyzEZaQiodsQAiaqvWjGvFT70161M.png",
      "alt": "\"Select target location\" window in On Page SEO Checker settings"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/d9/25/d9255047cbe0dea99a3fda476a5cbda8/6845b158cfca12f5b2d2331af551b4b0/7YKxbEiCuI-M4pescLJtRNQrQKpKeKk4Teif09v7tCe55U16GArg0qxwl3OwEh_uU-6TSAdPuU6g1r8xRg9Vcui71EIJB6v6oMbuHcE7a0aCHm-7fOFmPOoAq2LBh8XSwfAJ5iB0Udw3wKR9HZekuYI.png",
      "alt": "\"Add pages to optimize\" window in On Page SEO Checker settings"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/d5/ec/d5ec046a2b8d27672bd76439e2771de6/1642d8b172d1f3d76339b86804b022f4/AFCHrcC4LUfcLUcaxbfLdpwmbNeIdC5lr22afhllYRmE3sQ-qOUC9EM6kZ0H6PBBkmrd48WeTLFWpNASqk7bDwam-LLu2DtlBz4p_XqEVWASjlqNAnlwexerzZ-ThPlcpWa2uoywNb-BnRGpS2W6Dw8.png",
      "alt": "On Page SEO Checker's overview summary"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/39/1f/391f2657b921e8401d9cacdc3481e3eb/71a9a7382d41e8496fd6760743d447c3/WuHctZT-J6BvYge6yA-I2ONT19vrzVkq1fZIhXIeLsmIJcQeshKwOD772D_rHx5ePmCVdZb4J4n47rStGLBabChVkGbJIvXMAaE-9uEXqmS3ZyNf3l-RtEki18xDUPd_Bjh44uyt1YXYdUuJ7Qy8x_s.png",
      "alt": "Position Tracking tool search bar"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/0c/66/0c6608e68bac5bbd83b4cb9999b67f2f/8b42b5b08e85f7d688e519aedb731722/D8DUwZEyJD52FFoJluhfh-ARxVav84vXy4adZshWtV9OmfuCjlbk6R40TONR2SOj0mxZJWyUsUXqd3WPoONsbnA-T1pXhnHy_31z3b7Z3kgbCjw-HrNiRHDQ2STh5LM7In6EBGdI75gIHPevTbu8V1E.png",
      "alt": "\"Targeting\" window in Position Tracking tool settings"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/c3/66/c3665659ec9063499ca6710c4761f744/c8feef7ce39431d1493df4822200ccef/6G7v0bJHLkHqJNagSrEVosb4GSLejl8z0OXOkAfOvozlVPzZd5fmg6XBoVwAN8aGEUewUtz7-HqtyzsN9w86NlQB7oRUXNBUrItfV1PvsZ7UP9cZE7bDolF9esZBauX7YMEEHeZffcTnqrOh-zV9vCQ.png",
      "alt": "\"Keywords\" window in Position Tracking tool settings"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/fc/c6/fcc611c421d788bce795993fbda1ecfa/3faabe9e7976110ee3fc19f25bd54013/ChAA4bBTufGF8M3hG6cFHltsawB_F0bUVEz14BeVtMx2-iJ9EQW3nIDUryHDZ32wF9XFfcm-zDmRSEgJ-Sda9OpoldS9amm0urcRzM095tJNfa50XYugbFoBV2Xc4DPHZL7j8imYYJELUTVCOQG_zY8.png",
      "alt": "“Cannibalization” report in Position Tracking tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/96/ec/96ecf8988afa6ad48469e5df9bc845d9/5c0c55e7e7b1461d1b2acd24339cdaf3/L-va9yUaRlN4iI10Dw0cr9vw5__BSaF-W5ct98u0a6jRsrbSp8_LO5K8RKZesY1LLbN9JSJKNrKshViR92K2Epf9-6Xn0ugyyZ5mheOXcUUg5f3bywDCmQl2dtgNMhpl3wM2SG-T9-ysfnUB97ZPLZo.png",
      "alt": "Anchor text that reads \"chocolate syrup\""
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/d2/77/d277497986afa550d19b9f514100c18c/26f8c4938d1af31f51c95870a0c71a45/jf8PX3cSvlMotPJAnMYLGkQHkHtJY8-SOFGXY3IcYmwm2HsNvJlQGhIqW6RjbFlXWLBNxFQbDo057zNVaeEGvaBX4bXYi2wKqSfep6zbEu0-oYg14Rbg6p3SOr2cSRcuY_4V7YnZVwXCtJd3ddTlhmE.png",
      "alt": "Over-optimized anchor text example from Google"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/semblog-next-static/banners/trial-gift.png",
      "alt": "Trial Semrush banner"
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&d=Mon%2C%2021%20Oct%202024%2014%3A14%3A03%20GMT&n=4d&b=SEO%20Mistakes%3A%20Common%20SEO%20Issues%20%26%20How%20to%20Fix%20Them&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fbiggest-seo-mistakes%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&b=SEO%20Mistakes%3A%20Common%20SEO%20Issues%20%26%20How%20to%20Fix%20Them&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fbiggest-seo-mistakes%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://bat.bing.com/action/0?ti=5128787&tm=gtm002&Ver=2&mid=caf21974-1755-42f7-a31a-e73cfd9d5505&bo=1&sid=ac5716d08fb611efb7cbfb7f8a2c116b&vid=ac59baf08fb611efb9227d593de37ea3&vids=0&msclkid=N&uach=pv%3D10.0.0&pi=0&lg=en-US&sw=1920&sh=1080&sc=24&tl=SEO%20Mistakes%3A%20Common%20SEO%20Issues%20%26%20How%20to%20Fix%20Them&p=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fbiggest-seo-mistakes%2F&r=&lt=1510&evt=pageLoad&sv=1&cdb=ARoR&rn=920080",
      "alt": ""
    }
  ],
  "publication_date": null
}