{
  "url": "https://www.semrush.com/blog/cold-email-templates/",
  "title": "11 Cold Email Templates Sure to Attract Hot Leads",
  "content": "Cold emailing can feel intimidating. And if you're not hearing back from recipients, the effort may not feel worthwhile. \n\nIt doesn’t have to be that way.\n\nWe put together 11 cold email templates that will save you time and help attract the leads your business wants most.\n\nHow to Write a Cold Email That Actually Gets Responses\n\nBefore we dive into the pre-written cold email templates, let’s first understand what makes a great cold email. \n\nThis way, you’ll know how to customize each template to ensure you get the best possible response.\n\n1. Research Your Recipient’s Pain Points\n\nBefore crafting your cold email, thoroughly research your recipient’s pain points. Understand their unique challenges and struggles. \n\nWhy?\n\nBecause then you can include content that answers them.\n\nDive into social media posts, explore relevant online forums, and stay up to date with industry news. \n\nPersonalize your message in a way that resonates with their needs.\n\n2. Write a Short Introduction\n\nYour email recipient is busy. So keep your intros short.\n\nIntroduce who you are and what you do. Then, dive straight into the meat of your cold email.\n\n3. Personalize Your Pitch\n\nYour recipient shouldn’t feel like they’re one of many people to get a cookie-cutter email. \n\nTake the below email: \n\nThe recipient isn’t addressed by name, there’s no personal reference, and worst of all, the pitch isn’t relevant to the business.\n\nMake sure every email you send is unique. Customizing each one might take a few extra minutes, but it’s worth the effort.\n\n4. Define a Clear Value Proposition\n\nYour value proposition—how your offer benefits the email recipient—is crucial.\n\nClearly state what the recipient gains from accepting your pitch. You’ll be most effective when you tie your value proposition to their pain points.\n\nFor example: Let’s say you want a backlink from a blogger. \n\nThat blogger’s biggest pain point might be driving traffic to their blog posts. A value proposition you include in your email could be an offer to share their blog post in your next newsletter. They’ll get more traffic in exchange for your ask. \n\nBottom line: Help your recipient understand how they’ll benefit by helping you.\n\n5. Include a Strong Call to Action (CTA)\n\nBy the time your recipient is done reading your email, it should be super clear what you need from them.\n\nShould they click a link? Book a time to meet? Email you back?\n\nSpell it out with a clear call to action (CTA).\n\nIt helps if you include just one CTA. \n\nAnd make it super easy and simple for the recipient to do. If you want them to visit a landing page, provide just one link, not three. If you want to schedule a meeting, suggest a time and ask them to simply email back yes or no. \n\nThis email asks the recipient to respond if they change a link:\n\nMake it as easy as possible for them to do what you ask.\n\n6. Finish With a Professional Email Signature\n\nA well-designed email signature adds a professional touch to your cold email. \n\nIt can also help you build trust and a human connection with the recipient. Increasing the chance of response.\n\nInclude the following elements:\n\nSocial media links\nHeadshot\nName and job title\nBusiness information and logo\nContact details\n\nTo generate an email signature like this:\n\n7. Write a Compelling Subject Line\n\nYou want people to open your email. For that, you need a clear and compelling subject line.\n\nHere are a few tips:\n\nKeep your subject lines accurate (clickbait will irritate your recipient and might get your message marked as junk)\nUse around 45 characters—or less—to avoid truncation on mobile (this happens when the subject line is shortened due to space limitations)\nMake it personal by adding a name or referring to the industry your recipient works in\nAvoid spammy tactics like capitalized words or excessive exclamation points\n8. Review Your Email’s Format\n\nMake sure your email is readable.\n\nLong paragraphs and large walls of text are overwhelming to read. \n\nIntroduce white space by breaking up paragraphs and trimming long sentences. It makes emails feel more approachable and makes it easier for recipients to scan.\n\n11 Powerful Cold Email Templates You Can Use Today\n\nNow that you know how to write a compelling cold email, let’s dive into our cold email templates. With the above tips, you’ll know how to customize each template to meet your needs.\n\n1. Guest Post Outreach Email Template\n\nThis template is for: Landing guest blog posts.\n\nSubject: I can help you rank for [keyword]\n\nBody:\n\nHi [name],\n\nI'm [name], the [job role] at [company].\n\nI want to discuss writing a guest post for your blog. \n\nI noticed you aren’t ranking for [a keyword they aren’t ranking for but should], but [the name of their competitor] is. \n\nThis keyword gets [number of searches per month]. Ranking for it will [explain why it’s important they rank for this keyword].\n\nI wrote an in-depth piece about [the keyword]. I’ve optimized it with my SEO tools, and it’s ready for you to publish if you’d like. All I ask is you attribute the article to me.\n\nYou can see examples of my other work here: [link].\n\nLet me know if you’re interested in moving forward.\n\nBest,\n\n[Email signature]\n\nDownload this template:\n\nCreate a Guest Post Outreach Email\n\nUse Template →\nTips for Guest Post Pitches\n\nCheck the publication’s website to see if there’s any information about whether they accept guest posts. You don’t want to appear poorly prepared or set up your email to be marked as spam.\n\nTo find which keywords your prospects aren’t ranking for, use Semrush’s Keyword Gap tool. \n\nEnter your prospect’s domain along with the domains of up to four competitors. Keyword Gap will make competitor suggestions if you aren’t sure who their competitors are:\n\nScroll down and click into the “Untapped” tab. This shows you which keywords your prospect doesn’t rank for but at least one of their competitors do.\n\nFind a suitable keyword, click “>>,” and jot down one to two related keywords:\n\nUse what you learn from the keyword analysis to create content that will be valuable to your prospect. \n\nOne easy way to get started is with the SEO Writing Assistant. \n\nClick “+ Analyze new text.”\n\nClick “Set a new goal” and enter your keyword and the related keyword(s) from earlier. \n\nChoose whether your target audience is on desktop or mobile. Then click “Get recommendations.”\n\nPaste your content in or write in the editor directly. The tool will analyze your text and give you tips to rank high in the search results. \n\n2. Press Outreach Email Template\n\nThis template is for: Convincing a journalist to cover something newsworthy in your business.\n\n(In our example template, our newsworthy item is a research report. You can switch up the structure for other campaign formats.)\n\nSubject: Surprising research about [your topic]\n\nBody:\n\nHi [name],\n\nI’m [name], a [job position] at [your company].\n\nI loved the article you posted about [topic]. It was [list reasons why you liked it]. \n\nGiven that you regularly write about [topic], I thought you might be interested in an exciting research report from my company.\n\nIn recently conducted research, we found that [X is the most popular city in the world for Y].\n\nWe studied a number of factors, including [factor 1, 2, and 3] to reveal insights about [cities around the world where Y is the most popular].\n\nYou can find the full research report here: [Link].\n\nThis could make a great story for your readers because [briefly explain why their readers will love your piece and why it's unique].\n\nI’m available to provide additional insight or quotes alongside the research if you’d like. \n\nLet me know if this is something you’d like to feature.\n\n[Email signature]\n\nDownload this template:\n\nCreate a Press Outreach Email\n\nUse Template →\nTips for Pitching the Press\n\nSending your media pitch to the wrong person can lead to missed opportunities. \n\nTo find who to pitch (and how to contact them), use a tool like Prowly. \n\nProwly offers a media database that helps you get in touch with relevant reporters. This way, you don’t need to scour the web to find contacts. Plus, you’ll be confident you're emailing the right person every time.\n\n3. Link Building Email Template\n\nThis template is for: An outreach campaign to build links to a resource you wrote. Link building helps with your site’s SEO.\n\nSubject: Can I share your article with my audience?\n\nBody:\n\nHi [name],\n\nI loved your article about [insert topic]. I found it especially interesting the way you discussed [insert specific part of the article].\n\nMy name is [your name] and I recently published an article on [relevant topic].\n\nI noticed you link to other great resources in your article, and I thought my article could be a great addition too. \n\nWould you be willing to add a link in your article to [your hyperlinked article title]? \n\nIf you do, I’d be happy to share your article with our audience of [describe your reach, i.e., X subscribers, X followers].\n\nLet me know.\n\n[Email signature]\n\nDownload this template:\n\nCreate a Link Building Email\n\nUse Template →\nTips for Link Building Pitches\nCrafting Your Value Proposition\n\nFor a lot of prospects, a link back to your content can be a big ask. To make it worth their while, ensure you have a good value prop to offer back to them.\n\nDon’t have a big audience or fair trade to make with them? Share the more human side of your story. Include details about what you admire in them. Sometimes the chance to help someone it matters to is a value prop all in itself.\n\nIdentifying Link Building Opportunities \n\nThe fastest way to find link building opportunities is with Semrush’s Link Building Tool. \n\nStart by clicking “+ Create project.”\n\nEnter your domain. Then give your project a name. Click “Create project.”\n\nSemrush automatically inputs keywords relevant to your business (below). You can remove or add to them. \n\nMake sure you add branded keywords—keywords that mention your brand name or a variation of it—and other keywords you want to rank for. \n\nWhen you’re done adding keywords, click “Competitors.”\n\nNext, Semrush will populate your competitors. \n\nLike the keywords page, you can remove or add to this list. \n\nWhen you’re done, click the green “Start Link Building” button.\n\nThe report will populate with opportunities for backlinks. \n\nGo through the sites in the “Prospects” tab. \n\nWhen you find a site you’d like a backlink from, click “To In Progress.”\n\nAfter selecting all suitable sites, click the “In Progress” tab to view the sites you saved earlier.\n\nTime to send your cold email. \n\nClick the “Contact” button.\n\nSelect who to send the email to, change the subject, and paste your cold email. Click “Send and proceed to next.” \n\nSemrush will prompt you to connect your email:\n\nYou can keep track of each cold email you send in the “Status” column. \n\nThis column tells you whether your email was sent, received, opened, or replied to. \n\n4. Influencer Collaboration Email Template\n\nThis template is for: Finding influencers for your next influencer campaign.\n\nSubject: Let’s work together, [name]\n\nBody:\n\nHi [name],\n\nI'm [name], the [job role] at [company].\n\n[Brief info about your company.]\n\nWe really liked [example post/collaboration] that you worked on with [other brand] and would love to do something similar. \n\nWe can offer you [discuss what you can offer the other party, i.e., payment, free product].\n\nAre you interested?\n\n[Email signature]\n\nDownload this template:\n\nCreate an Influencer Collaboration Email\n\nUse Template →\nTips for Influencer Collaborations\n\nMake sure the influencers you contact are in your niche. This way, you can be sure their audience will care about your offerings.\n\nTools like Influencer Analytics were made specifically for finding influencers. Use its influencer database to find an influencer to partner with:\n\nOr, you can Google “[your niche]” + “this post is sponsored” to find sponsored blog posts: \n\n5. Cold Sales Email Template\n\nThis template is for: Generating new business through cold emails.\n\nSubject: We’ll help you [a relevant pain point your product or service can help with]\n\nBody:\n\nHi [Name],\n\nI’m [name] at [your company]. Based upon my experience working with other businesses in the [sector] industry, is it fair to say you struggle with [pain point]?\n\nI’ve been working in the [industry] to overcome [above pain point] for the past [X] years. \n\nRecently, our team at [your company] put together a free guide on how to [overcome pain point].\n\nYou can find the guide here: [link].\n\nI thought you might look it over and see how our approach compares to what you are currently doing. \n\nPlease let me know if you think our approach might work for you. If so, we can arrange a call to talk more.\n\n[Email signature]\n\nDownload this template:\n\nCreate a Cold Sales Email\n\nUse Template →\nTips for Sales Pitches\n\nWhen sending your resource to a prospect, make sure it’s relevant and addresses their pain points. \n\nIf it’s not, the recipient won’t see the value in working with you or buying your product. \n\nHere are some examples:\n\nHighly detailed case studies that show an improvement a past client of yours received as a result of your work \nA personalized video message of you sharing what you can help with and how you’d improve a specific pain point for them\nInteractive tools or calculators they can use to improve something they do day-to-day (the tool should complement the services you’re pitching; not replace them)\nA guide with relevant insights they can use to improve areas of their business that showcases your expertise\n\nJust make sure what you send is easy to digest. \n\nAs founder Ali Schwanke notes, the appeal of something free becomes unappealing when it feels like a chore to consume:\n\nImage source\n\n6. Do Me a Favor Email Template\n\nThis template is for: Asking someone for a favor.\n\n(In our example below, we ask someone to be a guest on a podcast. You can switch up the structure for other favors.)\n\nSubject: [Name], can we feature you?\n\nBody:\n\nHi [Name],\n\nI am [Name], the host of [podcast].\n\nI have followed your work for [X] years. Your first caught my attention when [discuss what turned you into a fan]. \n\nBeing that you're a leader on [topic], I think you could add real value to our podcast.\n\nEvery week, we interview industry experts and talk to them for 30 minutes to get their take on [topic]. I’d love to have you as a guest. \n\nHere’s an episode of ours where we interviewed [name of your most well-known guest]: [Link].\n\nAll we need is 30 minutes of your time over [Skype / Zoom / Hangouts]. You can pick a day/time that works well for you from a list of available options and I'd send the discussion points the week before.\n\nIn exchange for your time, you’ll get [list what they get in return, i.e., a link to their website, promotion with your X subscribers, etc.]. \n\nAre you interested?\n\n[Email signature]\n\nDownload this template:\n\nCreate a Do Me a Favor Email\n\nUse Template →\nTips for Favor Pitches\n\nClearly outline what your prospect gets in return for helping you out. The more enticing, the better. \n\nWhen thinking about what they might like, recall their pain points.\n\nFor example, a well-known blogger might understand the value of—and appreciate—a backlink. Whereas someone popular on social media might want social shares and mentions. \n\n7. Link Reclamation Email Template\n\nThis template is for: Asking someone who’s mentioned our brand to also link to it—or for work you’ve done to be linked to its source.\n\nSubject: Thanks for featuring us, [their company name]!\n\nBody: \n\nHi [Name],\n\nI’m getting in touch regarding this article: [link]. \n\nIt was fantastic to see you mention our [product / company / research]. Thank you for the coverage. It’s really appreciated.\n\nIs it possible to add a link to the page where our [product / company / research] is mentioned?\n\nThis would enable your readers to [demonstrate the editorial value] and view the suggestion in more depth. As well as provide full credit to us for our work.\n\nYou could link to our [product / company / research] here: [provide a sentence or title as anchor text].\n\nIf you have any questions or I can help in any way, please feel free to get in touch.\n\n[Email signature]\n\nDownload this template:\n\nCreate a Link Reclamation Email\n\nUse Template →\nTips for Link Reclamation Pitches\n\nWhen asking for links, make it as easy as possible for the recipient to add your link to their piece.\n\nRather than expect them to write additional copy to add your link, give them existing text they can use as anchor text—the text for the link. \n\nAnd reiterate why it’s important to add your link in. For example, if they’re a company who values their readers, mention how adding the link will improve user experience. \n\n8. Testimonial Request Email Template\n\nThis template is for: Asking past customers/clients for reviews and testimonials.\n\nSubject: Can you help with this, [Name]?\n\nBody:\n\nHi [Name],\n\nI hope you're having a fantastic day. \n\nWe've had the pleasure of serving your business through our [product/service], and we hope we’ve exceeded your expectations.\n\nWe are currently gathering testimonials from customers and would be honored if you could briefly share your experience with our [product/service]. \n\nYour testimonial would not only help us improve, but assist other businesses looking for solutions like ours.\n\nFeel free to write as much or as little as you’d like (a few sentences is typically enough). You can either free-write your testimonial or use these guiding questions [link to a document with three to five questions your recipient can answer].\n\nWhen your testimonial is ready [tell them how they can submit their review, i.e., reply to this email, submit it via Google My Business, etc.].\n\nIs this something you can help with?\n\n[Email signature]\n\nDownload this template:\n\nCreate a Testimonial Request Email\n\nUse Template →\nTips for Testimonial Pitches\n\nAsking for reviews and testimonials can help grow your business.\n\nBut your customers and clients are busy. Make it easy for them to write a testimonial by giving them questions to answer or letting them free write. \n\nThen, tell them exactly how to submit your testimonial/review. Should they reply to your email? Submit it to Google? Make the submission process clear, simple, and easy to do. \n\n9. Collaboration Email Template\n\nThis template is for: Collaborating with other businesses in adjacent niches.\n\nSubject: Want to collaborate, [name]?\n\nBody:\n\nHi [Name],\n\nI've been a fan of your business for some [period of time]. I admire how you [mention something specific about what you like].\n\nI’d love to find a chance for us to collaborate.\n\nI recently worked with [business] to [content produced]. They received [list what they received as a direct result of the collaboration i.e., X backlinks, X sales, etc.] as a result of our work together.\n\nI have a few ideas for us:\n\n[Idea 1]\n[Idea 2]\n[Idea 3]\n\nI’d also love to hear what you think would be best for your business.\n\nAre you available for a brief call this week?\n\n[Email signature]\n\nDownload this template:\n\nCreate a Collaboration Email\n\nUse Template →\nTips for Collaboration Pitches\n\nMake sure to pitch businesses adjacent to yours. This way, you both benefit from the collaboration.\n\nNext, mention your past collaborations and how they’ve performed. If this is your first collaboration, find a case study from other businesses in your niche that have collaborated and experienced tangible results.\n\nThis gives your recipient the incentive—and confidence—they need to move forward.\n\n10. Customer Referral Program Email Template\n\nThis template is for: Asking past customers for referrals.\n\nSubject: Exclusive: Earn rewards for each referral\n\nBody:\n\nHi [Recipient's name],\n\nWe're launching a referral program for a select group of our top customers. For every referral you send us, you receive [mention the rewards or incentives for successful referrals].\n\nYou can read details on the program here: [link].\n\nIf you're interested in joining our referral program or have any questions, reply to this email, and we'll set you up right away.\n\n[Email signature]\n\nDownload this template:\n\nCreate a Customer Referral Email\n\nUse Template →\nTips for Customer Referral Pitches\n\nSince your customers are the beating heart of your referral program, you need to figure out what they want before putting the program together.\n\nTake time speaking with your customers to see what incentive is most meaningful to them. \n\nHere are some ideas:\n\nDiscounts and coupons\nCash\nLoyalty points\nDonations\nVIP events\n11. Follow-up Email Template\n\nThis template is for: When you’ve sent an outreach email but haven’t heard back.\n\nSubject: Re: [Your original subject line]\n\nBody:\n\nHi [Name],\n\nI was wondering whether you had a chance to think about my email below.\n\nI know you’re busy, so I wanted to bring it to the top of your inbox once more. This is a great opportunity to [briefly explain benefits].\n\nIf now’s not a good time, I understand. Just let me know when I should reach back out.\n\n[Email signature]\n\nDownload this template:\n\nCreate a Follow-up Email\n\nUse Template →\nTips for Follow-Up Emails\n\nTrack each cold email you send so you can follow up at an appropriate time. \n\nThe number of follow-up emails you should send varies. We advise waiting three to five business days between messages. And we suggest stopping at three (i.e., first follow-up, second follow-up, final follow-up). With only three, you can avoid irritating the recipient.\n\nMake sure to modify your message each time you send one. It might help if your emails get shorter each time. The recipient can always scroll down to earlier messages for additional information. Your goal is to capture their attention.\n\nTaking Your Cold Email Outreach to the Next Level\n\nYou don’t need to worry about low response rates with our expert-crafted cold templates. \n\nEach template is flexible enough to personalize and make it your own.\n\nWith the right strategy, cold emailing can be a big help in attracting quality leads for your business. ",
  "headers": {
    "h1": "11 Cold Email Templates Sure to Attract Hot Leads",
    "h2": [
      "How to Write a Cold Email That Actually Gets Responses",
      "11 Powerful Cold Email Templates You Can Use Today",
      "Taking Your Cold Email Outreach to the Next Level"
    ]
  },
  "images": [
    {
      "src": "https://static.semrush.com/blog/uploads/media/e2/54/e25419d5faac0fdd1ab665c60d7d251a/cold-email-templates.svg",
      "alt": "Cold Email Outreach Templates"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/bc/26/bc263565129115b1a911a4f711d598d5/dC5paYrsrky4d5bmvITnmndu3yydhcVvKv6ARbds1VNGMq5n0W2nsagZ3pJ2HS_Y0JhlucwWPOPZ1MpQv24v3MV7_9J3joJwH1_gp11sCMPkoJXbtUsJ0J9cxQc_DUyGsGqbgAqGctIvjrHGKxo2v3w.png",
      "alt": "An example of a non-personalized cold email outreach"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/75/e2/75e2b37396d5e44b9551f8d92f936f53/VUwLZ-dsxf1hAk0nflnli04O_S3lLmz3ND-pmX6mQ96SXTfcIxuZ_nXFyEdQegQn-Sc6Xr5VHvKjCEDlsgQMkKE32GIB40VRdDunyPECrXaWEvxuaN_jraeeLj4ECkK0tQ50gookEjKMDn2ssZK7zTU.png",
      "alt": "An email with a clear CTA at the end"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/a4/d9/a4d9a9bb995222fdcd36757bc50c7e18/f10f872035ac98f6331ab8cfd1dcc7cd/Email%20Signature%20Generator%20-%20Example%20Signature.png",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/a9/e6/a9e6d6559a96979c85ffee63c730cb86/wZzBc611v_HxGe1G7EXidqJqw8szcGRJayoXoD4lv9QA87wg37ZBwGQKh8vH-aQPfx6mqBtkteQ6eZRZaFXwqY93oXc4nGfE8LsKu3egXtAUCLzjfEC4oazaA7-BGCgT6nBiXvfxNWBoqGeFobCdJQ8.png",
      "alt": "An image of an email subject line"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/02/7f/027f451ac5e18df3e0a59a685e2c9970/P86ymuWG_a26NpRSOf-EhrsTEy8idbHudgFYGP-J_kooUbNIJEAJqADIs4TUt53UdoM_BxiYEdYjXVcHkzLYD6UnY_VZ4zJiaBXR_k-OzISjTUX8FN3G0Lfti4ixB8hwFgQt08MVQicUHFkdrVuizLk.png",
      "alt": "An infographic showing two email templates: difficult to read (left) and easier to read (right)"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/52/09/5209519e4af2b3c69ffa220620a6bc86/fWdWoAptEww_EUMce3d3ZPbJMQ2a6FHobpRulEF1PNo2p5ZV_Go4DERLF8Vot-J4-Nzd3mMB44jI4G9RoofEVGeKUAzeDZngJ7E1ymF8lc7DhEF2dPejyzumSeHedrP3vO0hRNe3I00zVZkFQaLVMWM.jpeg",
      "alt": "Guest Post Outreach Email Template"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/9b/1f/9b1f614b8c9408861a9fb7fe1d75b71a/XF9KW5WgVOGIeumymUMFptmtfRIK7gEvefqNuLunbHL5kJVM0r6TJRO4HKe1OZHyqsHLRKdSndKm1uvHdOGwhoNkgXqCg2dcZ8fuEUlwBLCvco8Kiv7uHL0Q5j1zIQMEoI8aPFwMZKEONI3oT4s1nL8.png",
      "alt": "Keyword Gap tool search bar"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e5/e2/e5e22de8e2525bdb3dc3c27477836b9a/bo8jcWRHS5GZPT70oIQfSgeqCAhaL8TQA8Bvja86riPaAt8RX8IWOlewMl9meapsoVOUvH6cDyVOlaHAOvTdFXOKnkk9KcOp7RuVaLgqWjZGWL7nve3ZKewRsQBiwOYboucvrXijyXIEnfOkLLwyH9I.jpeg",
      "alt": "“Untapped” tab in Keyword Gap tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/15/27/152733654a1c1044f43638e610313c86/5F7HLyiQeuHp-3kpEuEwHdISEh6BjxfMlNxGKZg7ZTLqwAZ5NVy9_LwMx5Mk5plvx82proiA4t5Ww6AsbjeCjDN-bTvUm3IeiecDbYRVjDOVI1h9mpJaTiYIu9rHaroDe04SSy8jRwNAMlMiHrZvBwY.png",
      "alt": "results for \"how to go live on instagram\" selected keyword"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e0/72/e072066e2164ca013786dce3aa047a0e/6k70K3p4ugXAgvMK3XMKLbX6pJUXxOl5-wkFk2G9LAI0S3KtcHUQaQre69SwFqacOYfGKztaXQkZhz1D3lgQho0moixQ8Vaur0GhApR9tWUfvDkbixSio54mb0t9RXlSs8qeUS7YQyJgX9ONlwsoSn4.jpeg",
      "alt": "“+ Analyze new text” button highlighted in SEO Writing Assistant"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/aa/77/aa7727ceda70fb174db0cb345990da3d/O9BUhqcFm3UsBmylFw0zUlvp443HiPseESKDkaI2ju5w5Xc6Rx0vcmQmbBZYi1coVLRn7JM8DxNs1fL5EoqJDELdgw47EvxDUOvMt8Zid9HzNBvIaiUeEMgj1UhkouCcHteffFJcDUBS5cMi1oWM588.png",
      "alt": "SEO Writing Assistant editor page with menu on the right"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/49/7d/497d2785af5fdf92a8a788eb6d7988ea/35uKwaVN4BPnVuqRiH24-Mp9Zbu8CisFqDFe0xqJlIkeIjrY30EHEsq5YEwG0P_Msf1XMZJUVVpf_vKeXK7spq8zERR3sWUWXjaLF4SPC6feRw0lfkNvkT1MQ3zxAxO0jYN_qUQBPgjosMOLC4_vzVw.jpeg",
      "alt": "Press Outreach Email Template"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/f5/1a/f51a01fed7a480d5d7c551ab00ab8dfe/fsyTKT2pCYwIBhsbDFAOWuJ7XUvA5wlEWpHoFYKd7KPeDwHIDkHzGR1fyYP22jl0AjTJqpEJMuf8wkkWYPohUeVdKmsOzJnPEVoWyRdpvo0dQE78HDlx5_kgN_eJCA0Sgrr40Ebj2tSIVeFOWPehKyQ.png",
      "alt": "Prowly homepage"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/f0/50/f050cc8b67d6c0659df460e822458410/WckrSfnwYihZbNF0lLWwSYAD3a9WPzAtopTrcZRq2iwcY6ODZsY7sH-rSAzNdu3qJSGQsijc1fvUtr6yAL05REYR_F4SwFtFeeByiU7pwRX3Tx4PJtMfTXJw4AAUnrJygAqqhOCjtg28HiYro3Lz6wA.png",
      "alt": "Link Building Email Template"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/9c/f0/9cf0e5bed204e43e08c4d311552c6147/ekLVN71wLquZMiqzTpGUrY3lPSlfOqbmxeoge5kbkS9TzTZ7YdDAuYU1KdgJKKk5pcU0_XtRm2BsN39TP5ppTzJ4f5LzT-M1iuqGBrN6Sb36YR8Go5ilK4ox1bAF1tFWXEp1GzqPVOfQiY3PfDDfECM.png",
      "alt": "“+ Create project” button highlighted in Link Building Tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/82/79/8279e25e4c7769c13a47182a2029f27c/0-1UTH1DZECk-AXCOELZmRiYS1O2Rph9eQ8a16YcZ5oRmu4iKafCZlRDz9aBIuNbgZutudL4XZaZ9SfSvWI0RB1NIoY7fymL-0BaMCJ5ds-aKmreObMoD9R5a5ZBtSWH09xZemA3KN3LVNU0ldrd7w8.png",
      "alt": "\"Create project\" popup window in Link Building Tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/6a/cc/6accab901e730a06e87559d003b01dc2/NFHIl-vdyGivrgmEI_7xrwL7wMXhHEYn7ETfdeyEBm4saehwgMAYAp6st1yFAou6q_4vSUI7wjgfqdqNuIsNVHuV6PHyXoOxm_4Ms0u3d_xR9pVyXdxfMePikEawUITBK8mXKFmNjpn0JTTiuIiSI_4.png",
      "alt": "\"Add your keywords\" window in Link Building Tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/43/4a/434ab5df589a711b25da0194c827222f/OLXo1YjmcvRTYzmfiPyZ8KXPr_SNRPiRJGvsOoGrGvPwVb6jSyyA52nzmpEiS5qsB57Quwdf-QZFQEZcPR82fMsaHqV1gujsB_HIJV3hdgo4TxeXQ4qfYIeQrOqmIJpasunUth5CLWNhdq5-H_d05iQ.png",
      "alt": "\"Add your competitors\" window in Link Building Tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/91/a4/91a4fb103665c9c4a1bd4dcd2d99e5f2/tCTq75EMI4Dt37Q3eG2oQL9zZBkfI0BZHHQiSlVLZozbv9n5Ae0pAh3dm9lCQWYZw4tJq6ecxMQuYHFaiGJXL-g6VEeukkY82xJUetIfeICggq5kNk0c2-2jVR-uIN2OfhFDrIWCs64tjloAESVFsWc.jpeg",
      "alt": "Link Building Tool's \"Prospects\" tab"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/79/e7/79e7fcf49c6e4a3aebe73b76c6e2ed69/kpoR6B_JhdQwubT8oNmH45431vHc4aPX9g9-hJTccYSSlbVemueB-nJ8qFrwQzspBZIXAEotgsIKLdhXVZOGzwrR4aixXOUKDEIlfP_IHRyvPd4aGpH6zwh7BZGuWvYbzWA9eQNo5X7MmeN26qZwru4.png",
      "alt": "Link Building Tool's “In Progress” tab"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/30/b5/30b55775b934b91d0f58219a17341a62/f6GAcpiud3K6p2zQ43D4OFhm2MhaDoBLOVlvYqv-oSnWO3DyuHw9fr94NGAVuVo1pBGtGlmEe4wE0DIhKgGDa-73H9l0fKTHfktXhlkfpZBTGwCFe11j5-xr4fHzahJiIH_Swm-KupJoYAFiRCOdrWA.jpeg",
      "alt": "\"Contact\" button highlighted from “In Progress” tab"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/33/7b/337bb41b4a98f64beb49410583bcc391/CWq7BpQ7034wC1WEAmwMkj64MIfly-VdraV9Iis76mGHdiJScmoNjl-9PwaSqnPHfAF2WkTQD5TPjfnYgTuVT7riY1C4eXK4JwTo9hVAjz0ARR5uX81EaN3H84qlGtcAXDfDmMCZzpsVlf8GSEUey44.png",
      "alt": "\"First email message\" window"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/5e/19/5e1905b0c668498fd0243066f963fb7c/vorhoB9gpmsdKwIiOApefcCkIKvYoxvHYp4l4djrXLtHPwJ4x0ST5gVW8X6j-zaqMpOyMYMq6_2ljBh36kChcIgb2C_xWamK5SpfwcrVnaG75_zpbJPM3Gci2oqNxSMKLsMAClA3KkfJXd1zbnfrNjI.png",
      "alt": "\"Add mailbox\" popup window"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/69/35/6935e51556dbebf3a26be5fd33fd8a1d/SGBj5dQUY82QEQcf5sQ5501aJe4aqZZhtzWNhVrDawGR2ijLVldUhQM7v3ZQm3KGKpGHM9hWsD8npjkIOjGjARngqa0khlthme9UPXpcKhQ7heEkQK1HYkgvekVM8boubCopiOJo7o3IlZ8-IqGYGts.jpeg",
      "alt": "“Status” column highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e0/7e/e07e562808997464c603611e8c634a1a/qhXuj2p4qSkDapTIUifBLxBqzRcRT94jziSrgrvs5dvJ4qG5ArOhLok1-rge9qoxDA-f6w8cPzqOk6XI-v7xkHarYpDeGINXNAYC3QEpAUyi0Qi00fhs0hl1Ewl0HNiTbwGTAhzdGDYFL2s4OW4ZQtg.png",
      "alt": "Influencer Collaboration Email Template"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/5e/9d/5e9dc2f3b3b26e0f7cfeff3f65518350/f576c42ee827a7f21c73bfe30096a4a7/image.png",
      "alt": ""
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/68/5a/685aec2196b2e10b74dd365cc3a9c831/hF8L6kLw0Y3BuLSSKODEh1dv1FFGmNj4-ECKoHSb-i5HvxQKaNcBeBej8u4SpgHXX34CDyQsHH5WdQjvBFCz1AcFyQDIAAN0LwFFZTBz_aMWCqvI-cpIdoRI5B9xBuiNQ3N-TUNtd4l7kxTd6C4RSFM.jpeg",
      "alt": "Google SERP for “woodwick candles” AND “this post is sponsored”"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/d5/5d/d55d269df5c91611f9a66b6e685a1a00/wL_nifBweaUKGc--ZX-kH2qY2RZfqUQYDvB-SXGMLDFEQvqs7lV87CVIKJ2CcmK92PeQh3ZGv1124KTqPSpty42mcWjTq-IktXTDWmmF6dPA-jtm6O-OUVzYUFab2_rq-br5x5LwV5UYpR1MhSQink4.jpeg",
      "alt": "Cold Sales Email Template"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/9a/22/9a222814c50e65abd165741f1d6e0801/AMhWt8yJLzxPY3dnlLDKV3VPUDG87xHVj4svbmKif4W_8WXcAnXvyqgcr-nBXrevEnbbnslekwQfj5Ig4tpmJzPEjlrOf6BYy1sspT6Q05kt8fRhkZ1iaeLhyco3htp1mq_I66B7aZEdAH18dcnWDUU.png",
      "alt": "Ali Schwanke's post about a contact offering to send a 78-page PDF covering their AI outbound & operations strategy"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/3a/e0/3ae08f252273c84faecbe7bfe56d5a77/3nwM7n-DTyykRh9kOv9qrLGTZZcRUJ5RHnTVQuDnQnmzVEMDmDghxukZ2zdhg0dtXUKQk6kuc_LFrdj-KZNTUAioGMFyqAOSqzg4hz7gkmUy6EEhXpgekbXGlrDC7EHpF9sSOE2PY5iGYTJemWh78d8.jpeg",
      "alt": "Do Me a Favor Email Template"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/bf/60/bf607e743278d32bdedd9b860431c6c3/ykGKedJKlEOBivXRN7Zou4_fPs71xfjja5fRTu4nAbZgITOwhYmzghZuaYZHq_VrY-mCrWxEAh_XDbH1EdtKk4XjjidRz6w4w9vEOCOtoorOPFWQaNn56FJJNPcQT24pvldF-WrTGhyJRSP95TdyUjA.jpeg",
      "alt": "Link Reclamation Email Template"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ed/9f/ed9f412d38e70e058db7576831d7f9f1/JzHPPeb7t15VhFuZKH1OVny6Anvp3sqjq6iccHd4iDvZHagW-1Kuwgnwzkymn_skL3Q7u6yc5mAX9hCCozM1H1B8F2DBk88uaQ3WOqhMldLc7dln3zMLl9gKCiwhQ7YYGBXEoihjFnHW0nSHKLeDNkc.png",
      "alt": "Testimonial Request Email Template"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/61/ab/61abd66358b285aa70b2287c72e79c4f/INy7dDt1_M_qK75liCfMDN1CmrNfWf5-GCF49BrAGayAaDYYVbMZLsrsgPTaXLQtqVOC6EMG_GxAAlbZCuSSkIorBhtKBjebSyEn50x5AeLxyMqgxsboClSd8jxsIoakbI3wFR1m22dwfuZJhlvKpZI.jpeg",
      "alt": "Collaboration Email Template"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/42/15/421583586bb151aa9447020ca353d7df/nMmcY7VqkpdLOQVeHEGKAvSvcFfCGB0GxX-hPOLXJNbIHv_Qq2Cn5aLlZrs4cGtkE-R2498VAa58O9k4Ej58TKwwjlvTbjSaITdCodosK1xdBzKqbU-B68knhChXoCsOkA-nbdqr6beKhIegiesWhiw.jpeg",
      "alt": "Customer Referral Program Email Template"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/1a/9f/1a9f3be944cc9bfe04b5466ea0dfce35/VFEpKWlr5YI98q-8yLu3aPnxrmQ75IcMwdHstLlaK1m6uPLBugv6TY7qTMo7EKfXfbedJ0_ZTDuarxQOPaZcQI1K3ArtMfzFE59aD4pkWplcBfVLuTkoYZCwwlmsGx5J4E87IKNEWfauWWlWoJxisX4.jpeg",
      "alt": "Follow-up Email Template"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/semblog-next-static/banners/trial-gift.png",
      "alt": "Trial Semrush banner"
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&d=Mon%2C%2021%20Oct%202024%2014%3A15%3A09%20GMT&n=4d&b=11%20Cold%20Email%20Templates%20Sure%20to%20Attract%20Hot%20Leads&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fcold-email-templates%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&b=11%20Cold%20Email%20Templates%20Sure%20to%20Attract%20Hot%20Leads&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fcold-email-templates%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://bat.bing.com/action/0?ti=5128787&tm=gtm002&Ver=2&mid=06acfdf7-0d6d-45ef-b04d-5d56b0434c5f&bo=1&sid=d2d473208fb611eface42b40020ac977&vid=d2d4d4108fb611ef94a28799788b2718&vids=0&msclkid=N&uach=pv%3D15.0.0&pi=0&lg=en-US&sw=1920&sh=1080&sc=24&tl=11%20Cold%20Email%20Templates%20Sure%20to%20Attract%20Hot%20Leads&p=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fcold-email-templates%2F&r=&lt=738&evt=pageLoad&sv=1&cdb=ARoR&rn=510376",
      "alt": ""
    }
  ],
  "publication_date": null
}