{
  "url": "https://www.semrush.com/blog/content-marketing-for-small-businesses/",
  "title": "Content Marketing for Small Businesses: 9 Essential Tips",
  "content": "Are you looking to build a powerful content strategy for your small business?\n\nIn this guide, we’ll take a look at how to create and distribute effective content—based on industry research and insights. We’ll also hear from various content marketing experts working with small businesses. \n\nAfter reading it, you'll learn how to use content to grow your small business organically and boost your brand awareness. \n\nDoes Your Small Business Need Content Marketing? \n\nWhether your CEO or CMO has posed the question, or you are wondering it yourself, it’s important to remember that quality content and strong thought leadership can help your business stand out. \n\nDale Bertrand, Founder and President at Fire&Spark says:\n\nSometimes content marketing is the best way for small business owners to compete against others with larger budgets for online advertising and PR. Be sure to leverage your unique viewpoint on your industry to get noticed.\n\nDale Bertrand, Founder and President at Fire&Spark\n\nIn other words, organic content brings marketers more long-term benefits than ads, which stop attracting leads as soon as you turn them off. \n\nOn top of this—and somewhat counterintuitively—it’s not just online businesses that can benefit from content marketing. Offline businesses, too, can see the return on investment.\n\nAccording to our State of Content Marketing 2023 Global Report, 99% of online and offline businesses with 11-50 employees generate positive results with content marketing.\n\nAt the same time, 66% of them have a fairly developed or advanced content strategy.\n\nBenefits of Content Marketing for Small Business\n\nBesides fuelling your marketing efforts, there are a number of clear benefits of content marketing for small businesses. Here’s how they break down. \n\nDifferentiate your business. It can be hard to stand out online. But your content can take the lead by showing your brand values, giving your audience useful information, and building a community around your brand.\nDevelop a brand. Whether you’re providing a product or a service, it’s your brand that makes a lasting impression on your audience. With a strong social and organic presence, you can get people talking about your business. \nConnect with customers. Your blog, social media, and newsletter campaigns provide multiple touch points for your audience and offer more opportunities to connect with your customers directly and generate leads. \nAttract organic website visitors. Optimized website and blog content can bring in targeted, long-term organic traffic for years after publishing. Marketers can find themselves at the mercy of social media ad platforms and fluctuating prices. Get longer-term value from high-performing organic content and become less reliant on ads. \n\nFor example, Sugar Geek Show, an online cake decorating learning platform, turned their free blog into the biggest revenue driver.\n\nBy focusing on SEO and using Semrush, they managed to boost organic traffic by 269% from 2019 to 2021. The increase in income followed, and in 2021 the blog was generating 60% of Sugar Geek Show's revenue.\n\nWhen and How Should Small Businesses Start with Content Marketing?\n\nNow, let's find out when and how should your small business start with content marketing. Dale Bertrand says:\n\nStart yesterday! The slow and steady approach works for content marketing as long as you are adding value and servicing your customers with your content. So start now and build a library of content that attracts organic traffic.\n\nDale Bertrand, Founder and President at Fire&Spark\n\nDale makes a good point: It’s never too early and never too late to start content marketing. In fact, if you are just about to create your company, it’s a good idea to start right away.\n\nBuilding your reputation as a thought leader is a great way to create buzz and enter the industry. \n\nPratik Dholakiya, Founder of Growfusely, adds that consistency should be your key focus: \n\nWe have worked with quite a few SaaS brands (small businesses) to help them with their content marketing efforts, and what’s worked for most of them is consistency in their content marketing plan and execution. Even if the campaign is planned at a small scale, they should focus on consistency and the rest can be planned based on their goals and objectives. Content marketing definitely works for small businesses if they keep long-term goals and consistency at the forefront.\n\nPratik Dholakiya, Founder of Growfusely\n\nWhat Are the Key Questions to Ask Before Engaging in Content Marketing?\n\nIf other companies are blogging or running a YouTube channel, it doesn't mean you have to opt for the same content formats.\n\nTo find the right focus for your content marketing, you need to answer three core questions: \n\nWhat is my key expertise? Sharing authentic content driven by real-life experience is one of the best ways to succeed in content marketing. Think about areas where you can provide unique opinions and advice.\nHow can I make my content interesting and useful for my target audience? Researching your target audience's specific interests and preferences will help you understand their content needs. At the same time, competitive research will be useful to assess what's trending in your sector.\nOn which channels will this content be most effective? Content will only bring you the desired results if you share it where your customers hang out. Make sure to run quantitative (e.g., surveys and website analytics) and qualitative (e.g., interviews) research to identify the most effective distribution channels.\n\nRemember that content marketing takes time and effort. So, do not get discouraged if you don’t see immediate results.\n\nInstead, focus on making your effort consistent and creating a sustainable model for attracting customers organically.\n\nIf you’re excited about jumping into the world of content marketing, but still feeling slightly overwhelmed, we’ve spoken with a few content experts and put together a number of tips. Here is what they have to say:\n\n1. Work On Your Foundations Before Rushing into Content Creation\n\nContent is just one piece of your bigger marketing strategy, and it will only work when other elements are functioning correctly.\n\nBefore scaling your content marketing efforts, you’ll need to have all the assets and resources ready in place. That includes:\n\nYour website—optimized for users and search engines\nDesign and copywriting capabilities\nFollow-up and conversion strategies, such as email marketing for downloadable content and CTA (call to action) buttons in your blog posts\nAnalytics (e.g., event tracking in Google Analytics) to help you assess your progress \n\nSophie Joelle, Senior Content LeadSenior Content Lead at Flaunt Digital, says:\n\nFocus on creating a highly optimized homepage and your key category page copy, using supporting editorial content such as blogs and guides as an internal linking opportunity. For small businesses, knowing your unique selling proposition and having a strong brand tone of voice will help to differentiate you from the competition, with keyword optimization providing the technical back-up your business needs to grow.\n\nSophie Joelle, Senior Content LeadSenior Content Lead at Flaunt Digital\n\n2. Document Your Content Strategy and Plan from the Start\n\nIt’s never too early to build and document your content marketing strategy. Instead of taking a scattergun approach and chaotically creating a lot of content with zero results, it’s smarter to be strategic from day one. \n\nIn fact, 80% of companies that were highly successful in content marketing have a documented content strategy. \n\nAt the same time, 52% of unsuccessful companies don’t define their strategy.\n\nBefore jumping to writing blog posts and filming tik-toks, define and document the primary elements of your strategy: \n\nYour audience\nGoals and metrics\nContent topics\nContent formats\nContent distribution channels\n\nBased on our research, 67% of companies with 11-50 employees document their content marketing efforts, leaving 33% of those yet to follow this trend.\n\n3. Put Stories at the Heart of Your Content Marketing Strategy\n\nBrand storytelling helps you translate your company mission, background, and unique identity using narrative structures. It can become the foundation for your content marketing strategy, differentiating you from the competition.\n\nStories are the perfect medium to connect with your audience in terms that they understand. They also help you engage people with emotion and tend to present information in a more memorable way.\n\nBrian Moran, Founder and CEO at SmallBusinessEdge says:\n\nSmall business owners can capture the attention of their target audience by telling good stories through content marketing. You can use your mission and their unique backgrounds to fuel these stories.\n\nBrian Moran, Founder and CEO at SmallBusinessEdge\n\nIn other words, stories help make your content marketing more purpose-driven. Let's look at one example.\n\niFixit is an eCommerce website offering repair kits for fixing your smartphone or computer at home. However, they get their organic traffic by talking about a topic they see as fundamental for their brand story: the Right to Repair.\n\nThey believe that consumer electronics companies should release more information about their software and hardware so that people can fix their devices themselves. \n\niFixit's team is creating content related to this issue and is using it to generate authority and build relationships with other organizations that share their values.\n\nAnd as you can see, this strategy seems to bring numerous benefits in the form of organic traffic and rankings:\n\nTo map out your own story, focus on what makes you and your company stand out and how you hope to change the world with your offerings and content. \n\nCheck out the infographics below to explore the key attributes of a powerful brand story: a realistic approach, authenticity, a focus on your customers, relevancy, and others.\n\nFor step-by-step instructions on how to document your brand story, use this free Brand Storytelling Template.\n\nGail Gardner, BizSugar Community Manager, shares another example: \n\n“Major attention goes to those who create crazy videos. Check out the Rhett & Link commercials on YouTube as examples of videos that border on the insane. Humor works, but it can be tricky to get it just right. A safer, but equally effective way to go is storytelling. Who doesn’t like a good story, right?”\n\nHere's one of Rhett & Link's videos that caught our eye:\n\n4. Organize Your Content Production: Resources, Creators, and Calendar\n\nNext, it’s important to organize your content production processes to maximize efficiency and minimize costs. Think about the following:\n\nYour resources and budget\n\nThese will determine how much content you can produce and on what timeline. \n\nThe resources you might need for content creation include:\n\nHuman resources: e.g., content strategy and management, copywriting, design, social media management and video production\nContent marketing tools: e.g., tools for SEO, content planning, content writing and a Content Management System (CMS). \n\nAccording to our survey, 49% of small businesses spend between $1,000 and $5,000 on content marketing every month. At the same time, 26% spend less than $1,000.\n\nHowever, content marketing seems to play an increasingly important role for small businesses around the globe.\n\nWe found that 62% spend from 10% to 50% of their marketing budget on content. 74% of small businesses also plan to increase their content marketing spending in 2023.\n\nBelow you can find some details on how small businesses define their content marketing budgets.\n\nFinally, marketing tools and technology can help you save time and resources and make your efforts more effective. So, involve some of them in your production process from the start.\n\nThe most popular technologies used by small businesses are website analytics, SEO, and social media posting tools. 16% of them also use AI content tools (compared to 6% in 2022).\n\nWho will create content\n\nContent creation is time-consuming and often highly skilled. It’s important to consider whether you can take this on in-house or whether you should outsource to freelancers or an agency. \n\nThere are potential benefits of either of those approaches. Having in-house writers will benefit you in the long run as these people will develop a deep understanding of your product, your audience, and your brand. \n\nHowever, working with agencies could help you get some expertise and guidance if you are just about to start creating content.\n\nFinally, you could also choose to develop long-term relationships with several freelance copywriters. This can work for brands operating in niche industries - for example, those looking for writers with experience in healthcare or legal sectors.\n\nAccording to our research, 62% of small businesses have in-house writers, while 18% of them work with digital marketing or content marketing agencies.\n\nAnother survey we have recently conducted has found that more than 50% of businesses use internal subject matter experts (SMEs) to help them write content.\n\nA further 44% have internal subject matter experts guide copywriters as they produce the content. \n\nThe subject matter experts (SMEs) in your company could be anyone from the product and business managers to sales and customer support specialists.\n\nThink about your employees who have experience in your field and encourage them to share their thoughts.\n\nFor small businesses, in particular, the first option can often be the most cost-effective and scalable. At the same time, this expert content provides value to the audience and helps you become a thought leader in your niche.\n\nIt’s also a good idea to work with external experts and influencers to add value to your content and reach new audiences.\n\nNext, you can use those insights to create content with your internal or outsourced writers. Dale Bertrand says:\n\nYour content should answer your customers' most pressing questions and make sure it's opinionated. If you demonstrate your unique point of view on your products or service/industry, then you will find like-minded influencers, organizations or trade groups who will help you promote your content.\n\nDale Bertrand, Founder and President at Fire&Spark\n\nHow to organize your content calendar\n\nMapping out your editorial strategy will help you achieve your goals and plan more effectively. A comprehensive content calendar is essential to avoid chaos in your content production.\n\nYour content calendar will include the following items:\n\nContent topics and keywords\nContent formats\nRelated audience\nTimeline\nTeams and employees involved\nContent funnel stage\n\nJoseph Saunders, Content Writer at INFUSEmedia, suggests analyzing content performance based on your plan to ensure you’re on the right track. “Building a solid foundation with a content marketing plan will allow you to create a launchpad for experimentation and optimization that will lead to further success and competitive positioning,” he adds.\n\nFor step-by-step guidance on how to build a content calendar, download our free Content Calendar Template.\n\n5. Develop a Customer-Centric Approach to Content and Focus on Your Niche\n\nIt’s important to think about targeting topics that will resonate with your target audience and make sense for your business goals. \n\nDale Bertrand says:\n\nThe key is to craft targeted content for a niche customer base and develop valuable content that helps them make a buying decision. Ask yourself if your content is adding anything new that will help your customers make a buying decision or if your content is similar to what's already been published by other businesses.\n\nDale Bertrand, Founder and President at Fire&Spark\n\nMichelle Buck, Marketing Coordinator at Crystal D, says to think through content ideas and opportunities and make sure it is something your customer can gain value from:\n\n“Does it solve a problem? Is it helping them through a pain point? We can do a lot of things as marketers, but we will wear ourselves out! Be intentional about your marketing plans and build a strategy around it with the focus on your customer.”\n\nHow can you do this?\n\nFirst things first, you should always rely on extensive audience research and data when making content marketing decisions. It’s key to shift your perspective when deciding what to create and evaluating the content that has already been produced. \n\nTry putting yourself in your customer’s shoes and asking yourself whether your content is:\n\nRelevant\nPractical and actionable \nEnjoyable to explore and easy to understand\n\nThere are some tools that can help you add automation to this process. For example, the Topic Research tool allows you to align your content plan with your audience’s interests and bring targeted traffic to your website. \n\nFirst, type in a basic idea that relates to your business or your buyers in the location you are targeting. This could also be a high-volume keyword. \n\nIn the example below, we went for the \"ecommerce\" topic and the U.S.-based audience. \n\nIf one subtopicsa strikes you as interesting—perhaps it has a high volume of searches or seems very relevant to your audience—click to expand.\n\nLet's say you've clicked on the 'Credit Card' subtopic.\n\nYou’ll be presented with headlines from existing articles on this topic. You can click on these to be taken to the connected blog. Also explore common questions, which can be filtered into what, why, is and how questions.\n\nIf you’re still exploring, you can dig in further to find related searches.\n\nThe Topic Research Tool in Action\n\nThe Barbauld Agency used Topic Research to generate content ideas that helped their client increase organic traffic by 133%.\n\nIn one case, they used the tool to find an idea for one of the most successful blog posts—a guide to correctly placing letterman jacket patches and pins. \n\nThis post now ranks #1 in search. They discovered the idea by tying in the “chenille patches” keyword and exploring related questions. \n\nAlternatively, you can use one-stop content writing tools like ContentShake. Enter any topic or keyword related to your business and get a list of high-potential content ideas.\n\nNext, you’ll need to map out the structure of your content. \n\nMake sure that each piece covers the topic in-depth and tackles all possible questions the reader might have.\n\nContentShake can also automate this step for you. \n\nOnce you’ve selected a topic, hit “Start writing” and get a ready-to-use outline generated by AI.\n\nYou will also get suggestions for titles, introductions, images, data, and keywords to include in your piece.\n\n6. Be Experimental and Avoid Creating Generic Content\n\nDon’t be afraid to shout your brand from the rooftops. On this front, Sandip Acharyya, Founder of MarTech Sprout, offers some key tips, explaining that as a small business:\n\n1. You are small, so you have limited reach\n\n2. The content topic/subject you are using is already covered by \"bigger\" companies.\n\nIf you write generic content, it is unlikely to cause even a ripple in the vast ocean of content already published. There is already an information overload & content fatigue in the industry.\n\nSandip Acharyya, Founder of MarTech Sprout\n\nSandip goes on to say:\n\nBe bold and experimental. Use anything that sets you apart. For example, you can use memes, satire, and pop culture comparisons to attract your audience. They provide a much-needed break from repetitive blog posts flooding the intent.\nShare your opinion. Your audience already knows “the best strategies” or “10 trends to follow” in your domain. Rather than following the herd, share your opinions. Tell your audience where you stand on the topic.\nBe visually attractive. A unique headline, a colorful cover image, and the use of other visual elements can make a difference.\n\nTake, for example, Seed - an innovative brand offering probiotics. They developed a unique approach to their content and social media marketing from day one.\n\nFollowing their mission of promoting a scientific approach to probiotics and health in general, they are not afraid to tackle any topic and consistently share exciting educational content. They also developed a unique visual identity and tone of voice, which helps them stand out from any competitors.\n\n7. Diversify and Repurpose Content that Hits the KPIs\n\nGot content that’s crushing your KPIs? You rock. It’s time to diversify it to suit your target channels. \n\nThat means taking your high-performing content and repurposing it for different mediums—so you can connect with customers in lots of different places. \n\nFor example, a blog can become a series of Instagram stories, a report can become a webinar, and survey results can be turned into an infographic. \n\nBelow are some of the most popular content formats small businesses opt for in 2023. Video, short-form articles, success stories, and blog posts top the list.\n\nAnastasia Chechkova, Growth Analyst at OnePageCRM, says:\n\nAs a small business, you don't have as many resources as large companies do so you need to make the most of each piece of content. Repurpose your content: This means that you can get a high engagement or reach without creating brand-new content. In other words—when it comes to content marketing in a small business—do things that scale.\n\nAnastasia Chechkova, Growth Analyst at OnePageCRM\n\nExamples of Content Marketing Ideas for Small Businesses\n\nBeyond writing great blog posts there are many content types to consider. Here are some top content marketing ideas for small businesses:\n\nPodcasts: Top-performing blog content can easily become the topic for an interview or deep dive on a podcast. At the same time, you’ll develop relationships with industry players, lift the “corporate veil” and share opinions, information and advice with your listeners. More to the point, podcasts are popular: 41% of Americans listen to podcasts monthly.\n\nPodcasts can be free or very cheap to produce. Simply invite people from your own company and record it on a basic Zoom, using a microphone to improve audio quality.\n\nCheck out The Yogi Show, a podcast by Pedro and Bryan, two Yoga Instructors who have taken podcasting to the next level and also have a popular Instagram account. \n\nVideos: Grab your target audience’s attention with videos on any number of platforms, including Instagram, Tik Tok and YouTube, amongst others. Videos offer a great way to personify your brand and build trust with your viewers. \n\nExplore SquareSpace’s “All you need to Launch…” series for inspiration! \n\nAs a small business, you can still create videos on a budget. Enlist your team to help create short Instagram and Tik Tok videos.\n\nCheck out ThinkGeek for a great example. It’s a small ecommerce business that has grown to over 214,000 subscribers on YouTube. It sells “geeky” items for sci-fi, fantasy and gaming super fans.\n\nBlogs: Articles are a great way to drive organic traffic to your web. Once you’ve got a range of topic ideas and have done keyword research, you’ll be ready to produce content that people are really interested in and searching for. \n\nEgoditor is a small business that did just that, getting over 20,000 visits per month after just six months of blogging. To do this, the company used the Topic Research tool to gather hundreds of ideas and used the Semrush Writing Assistant to optimize their posts. \n\nNewsletters: Sending content straight to a subscriber’s email could be an effective means of connecting with your audience. In fact, we’ve found email to be the best-performing content types for small businesses. Share snippets of your best content and get more eyes on your best performers. \n\nFor inspiration and some great food content, check out pastry chef and recipe developer Nicola Lamb’s newsletter—Kitchen Projects. It often gets cited as one of the best food newsletters around. She goes into great detail, including her reasoning behind the recipe development process.\n\n8. Be Selective with Your Content Distribution Channels\n\nDon’t boil the ocean. It’s easy to try and create content everywhere—but it’s not necessary. Focus on where your most valued customers are, which will differ from business to business.\n\nTurn to your customer research insights and analytics to identify the optimal platforms for sharing your content.\n\nNicole Wolfe Content Strategy Manager at TopSpot Internet Marketing, says it’s important to choose your channels carefully, too:\n\nAre your customers on social media? Do they watch videos, and if so, where? Do they look at photo galleries, specs, or other data? Once you have identified the best outlets for your customers, creating content that can be repurposed is an efficient way to generate more with less.\n\nNicole Wolfe, content Strategy Manager at TopSpot Internet Marketing\n\nWhere Do Small Businesses Distribute Their Content?\n\nAccording to our research, most small businesses (78%) say they distribute over social media (organic), email channels (59%), and paid social (56%).\n\nMany also engage in search engine optimization (30%) and sponsorships.\n\nWhen it comes to choosing social media platforms, the top three options for small businesses include Instagram, Facebook, and YouTube.\n\n9. Keep an Eye on Your Metrics to Improve Performance\n\nIt’s essential to track your success against the goals and KPIs you’ve set for your content marketing efforts. Try creating a systematic approach to measuring your progress: for instance, by committing to generating bi-weekly reports.\n\nSome of the top content marketing metrics to analyze are:\n\nUser behavior metrics: page views, average time on page, bounce rate, traffic sources, top-performing pages (data source: Google Analytics)\nEngagement metrics: comments, likes, shares, mentions (data sources: social media analytics, media monitoring tools like Prowly) \nSEO outcomes: organic traffic, backlinks, keyword rankings (data sources: Google Analytics, Position Tracking, On-Page SEO Checker)\nImpact on the bottom line: number of conversions and leads, cost per acquisition, content marketing ROI (data sources: CRM tools like SalesForce, content analytics tools like ImpactHero)\n\nFor more information on how to improve your content to achieve such KPIs, check out our in-depth guide on content optimization.\n\nFinal Thoughts \n\nWith over 97% of businesses including content in their marketing strategy, it’s time for your company to jump on this trend and build a foundation for attracting customers organically. Be sure to focus on providing valuable and high-quality content and document your strategy.\n\nTo make your efforts more organized and data-driven, try the Semrush Content Marketing Platform. It will help you improve your online visibility, reach new customers, and grow your business with content.\n\nEasily Create Unique Content that Clicks with Your Customers\n\nUse ContentShake to combine your business expertise with AI and competitive data. Create content 10x faster and grow your small business organically.\n\nTry it Now for Free →",
  "headers": {
    "h1": "Content Marketing for Small Businesses: 9 Essential Tips",
    "h2": [
      "Does Your Small Business Need Content Marketing? ",
      "When and How Should Small Businesses Start with Content Marketing?",
      "1. Work On Your Foundations Before Rushing into Content Creation",
      "2. Document Your Content Strategy and Plan from the Start",
      "3. Put Stories at the Heart of Your Content Marketing Strategy",
      "4. Organize Your Content Production: Resources, Creators, and Calendar",
      "5. Develop a Customer-Centric Approach to Content and Focus on Your Niche",
      "6. Be Experimental and Avoid Creating Generic Content",
      "7. Diversify and Repurpose Content that Hits the KPIs",
      "8. Be Selective with Your Content Distribution Channels",
      "9. Keep an Eye on Your Metrics to Improve Performance",
      "Final Thoughts "
    ]
  },
  "images": [
    {
      "src": "https://static.semrush.com/blog/uploads/media/b9/55/b955052aa6f367ccc28616111c0a363b/content-marketing-for-small-businesses.svg",
      "alt": "content marketing for small business"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/32/f5/32f527ffc2d43b8dee003e8dae03fed4/EN-Content-Marketing-in-Small-Businesses.png",
      "alt": "Small business content marketing - 2023 statistics"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/76/12/76120a61f3ff7834b300fab07ce55b96/Sugar%20Geek%20Show.png",
      "alt": "Sugar Geek Show organic traffic"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/84/49/8449d7b91a481e67e384b6d6809ec886/EN-Why-Do-You-Need%20a-Documented-Content-Marketing-Strategy-1.png",
      "alt": "Having a documetned content strategy - statistics"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e1/f2/e1f205196eb1a9fdcc8207dacfdc341e/EN-Do-You-Have%20a-Documented-Content-Marketing-Strategy-2.png",
      "alt": "Do small businesses document their content strategy?"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/83/a5/83a560b4f0825e28f2eb3d49785f9873/iFixit%20repair%20revolution.png",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/fa/eb/faeb8f78e76394d05eebb84047541792/iFixit%20traffic.png",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/08/ff/08ff95ef4fd44d8137de21c339a99d9e/image2.png",
      "alt": "How to create a powerful brand story"
    },
    {
      "src": "https://i.ytimg.com/vi/RiLQLIaZy4A/hq720.jpg",
      "alt": "Youtube video thumbnail"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e3/14/e31422c9c7e6b20b3bf9ec53acde9abf/EN-Whats-Your-Average-Monthly-Budget-for-Content-Marketing.png",
      "alt": "Small business content marketing budget in 2023"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/51/54/515421553a520d7ef06df1e521af1621/EN-Content-Marketing-Budget.png",
      "alt": "Small business content marketing budget plans in 2023"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/74/fb/74fbcf6f8d21da10a5d1fe90b66d5623/EN-Which-Technologies-Does-Your-Team-Use-to-Leverage-Your-Content-Marketing-Efforts.png",
      "alt": "Content marketing technology used by small businesses"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/01/45/0145ff5eec903a567b99b3e798406850/image13.png",
      "alt": "content marketing for small business statistics - content marketing creation process"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/25/4b/254b23052fd59a3e7bb02d157ac2b88a/image15.png",
      "alt": "Topic Research for idea generation: screen two"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/84/5d/845d9158eb8f869f904bdae8033e45f1/image6.png",
      "alt": "Topic Research for idea generation: screen three"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/4d/d4/4dd415ccf3631e0430f67cc101aac58d/image24.png",
      "alt": "Topic Research for idea generation: screen four"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/0a/0d/0a0d2bb23c4e0b2a1aa558671567c95d/image7.png",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/79/d7/79d7b7bedf8733ab41949aabe1e011cc/Screenshot%202023-05-25%20at%2015.01.19.png",
      "alt": "ContentShake tool for small business content writing"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/da/2e/da2e731f3c14ea92f88e50c0b6cedf61/Screenshot%202023-05-25%20at%2015.14.09.png",
      "alt": "ContentShake tool for small business content writing"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/36/3e/363e0255ea86b7542b91ace6e71a2a01/Screenshot%202023-05-25%20at%2015.16.42.png",
      "alt": "ContentShake tool for small business content writing"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e3/e3/e3e3780b4706e1bfd17699b4d90a831a/Screenshot%20at%20May%2020%2015-32-15.png",
      "alt": "Seed - content marketing example"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/40/f6/40f653fff2e41f434c5efd2db4ff26db/EN-Which-Content-Formats-Bring-Your-Company-the-Best-Results.png",
      "alt": "Top-performing content formats for small business"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/dd/cd/ddcd4b2b94a8a71737c6a76d2273bbb0/image23.png",
      "alt": "content marketing for small business - content marketing examples: podcast"
    },
    {
      "src": "https://i.ytimg.com/vi/iBxZdL340_g/hq720.jpg",
      "alt": "Youtube video thumbnail"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/be/f1/bef1e257fedc51d5258fb41260732624/image22.png",
      "alt": "content marketing for small business - content marketing examples: blog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e0/fe/e0fe1c52102183da047a134b61ac46e0/image12.png",
      "alt": "small business content marketing example"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/79/12/7912fb8dc122a47c30a3c86bbebcc9fc/EN-Which-Channels-Do-You-Use-to-Promote-Your-Content.png",
      "alt": "Top small business content distribution channels"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ac/6f/ac6f2f54846046951196f643a69c69d4/EN-Which-Social-Media-Platforms-Are-the-Most-Effective-for-Sharing-Your-Content.png",
      "alt": "Top social media platforms for small business content"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/semblog-next-static/banners/trial-gift.png",
      "alt": "Trial Semrush banner"
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&d=Mon%2C%2021%20Oct%202024%2014%3A24%3A07%20GMT&n=4d&b=Content%20Marketing%20for%20Small%20Businesses%3A%209%20Essential%20Tips&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fcontent-marketing-for-small-businesses%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&b=Content%20Marketing%20for%20Small%20Businesses%3A%209%20Essential%20Tips&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fcontent-marketing-for-small-businesses%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://bat.bing.com/action/0?ti=5128787&tm=gtm002&Ver=2&mid=8c0e8f54-4d48-4202-adab-5d0bde32346e&bo=1&sid=135f6fb08fb811ef8112f1a30ba32655&vid=135fbec08fb811efa244e19d3a173e3a&vids=0&msclkid=N&uach=pv%3D15.0.0&pi=0&lg=en-US&sw=1360&sh=768&sc=24&tl=Content%20Marketing%20for%20Small%20Businesses%3A%209%20Essential%20Tips&p=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fcontent-marketing-for-small-businesses%2F&r=&lt=636&evt=pageLoad&sv=1&cdb=ARoR&rn=366207",
      "alt": ""
    }
  ],
  "publication_date": null
}