{
  "url": "https://www.semrush.com/blog/creator-marketing-campaign/#step-five:-reach-out-and-make-contact",
  "title": "How to Launch a Successful Creator Marketing Campaign",
  "content": "Want to tap into the power that is creator marketing? With 75% of brands clued into this force, it’s a golden strategy to reach new audiences, increase exposure, and build brand credibility all in one.\n\nCreator marketing is nuanced and disruptive, making it challenging for many marketers to break into. Here we’ll share some crucial industry details to help you get started, such as:\n\nHow to find and qualify content creators who align with your brand\nThe difference between nano, micro, macro, and mega influencers\nPricing rates for influencers based on post types, channels, and tiers\nImportant campaign metrics to track\nA letter template for creator outreach\n\nPlus, a downloadable 8-step infographic taking you through the process of building, launching, and measuring a successful creator campaign. \n\nStep One: Competitor Research\n\nChecking out the competition is a great place to begin. It will be a guiding star and help provide some industry benchmarks.\n\nOne way to begin is to make a list of your top competitors and document all of their social media profiles on a spreadsheet or Excel file. Next, create a column noting the number of followers they have. Third, spend some time analyzing their posts, and link to the ones with the most comments, likes, views, or engagements.\n\nWhile this process is laborious and time-intensive, it’ll help you understand what resonates and engages their following, and gauge what works and what doesn’t in your industry. This will also help you decide on your key performance indicators (KPIs) when you review your results later on.\n\nResearch Your Competitors with the Influencer Analytics App\n\nFor a less manual approach to competitor research, try the Influencer Analytics App. It’s an influencer discovery tool that reveals insights into your competitors’ influencer budgets and performance stats.\n\nResearch your competitors by dropping in their website from the Competitor Analysis tab. It pulls historical data from YouTube and Twitch, showing the total number of influencers, brand mentions, views, and budgets.\n\nThe app also provides insights that paint the picture of your ideal influencers, such as the categories and topics they promote, the average price per creator, and the size of their following. \n\nIn the Video tab, you’ll see their top influencers alongside their performance stats and price:\n\nYou can see all their content (both organic and sponsored), dive into their profiles, and save them to a list for future reference.\n\nNow that you have some industry-specific competitor groundwork laid, your next step should focus on your metrics for campaign success.\n\nStep Two: Define Your Campaign Goals and KPIs\n\nAnything you do for the first time is a learning experience. And breaking into influencer marketing is no different. \n\nRemember that creator marketing builds trust through relationships, which don’t happen overnight. There’s a learning curve involved. You want to create partnerships with influencers who align with your brand values and whose audience matches your target.\n\nFor this reason, we suggest you focus on brand awareness and engagement first. Rather than measuring your first campaign based on the sales outcome and your return on investment (ROI), a number of other important metrics demonstrate success in a creator marketing campaign. \n\nMeasuring Brand Awareness in Influencer Campaigns\n\nMetrics for measuring brand awareness include increased traffic to your website and new followers on your social channels. You should also monitor any new backlinks and brand mentions (both positive and negative) to see the impact of your campaign.\n\nMeasuring Engagement in Influencer Campaigns\n\nEngagement metrics paint a crystal clear picture of how well your campaign messaging is received by the target audience. \n\nMetrics to track include likes and comments, shares, views and plays, and an increase in followers and reach. \n\nLead Generation Metrics for Influencer Campaigns\n\nTracking lead generation and conversions helps you gauge the success of a creator marketing campaign from the budgeting perspective. But, as previously mentioned, this should be the secondary thought at this stage. \n\nHere you can set goals for the number of leads you’d like your campaign to gain, keeping note of the lead conversion rate and cost per lead (CPL).\n\nConversion Metrics for Influencer Campaigns\n\nEstablish metrics such as your desired click-through rate (CTR), your cost per conversion (CPC), and the new visitor conversion rate. Many times, creators will provide case studies and past performance metrics to set your expectations.\n\nPro Tip: Use Urchin Traffic Monitor codes (UTMs) on your promoted links to make performance tracking and attribution easier. Check out this guide on how to set them up.\n\nSetting up these target goals will arm you with the intel to fine-tune your future influencer campaigns. To reach them, you’ll want to ensure that your brand message is conveyed in a way that positively impacts the audience and can strengthen your brand image. You’ll also want to ensure you’re working with a group of influencers who meet your expectations and budget. \n\nRelated reading: How to Measure Influencer Marketing Success & Return on Investment\n\nStep Three: Set Your Budget and Promotion Plan\n\nHow much does it cost to tap into influencer marketing?\n\nIt depends.\n\nYou should first define your core message, identify what product or service you’re promoting, and on what channel(s) and to what audience.\n\nIt also depends on the influencers you collaborate with, and how many posts you will sponsor. While there’s no formal pricing schedule or formula, most creators will expect fair compensation based on their audience size and engagement rate. \n\nThe terminology varies, but here are four general categories of influencers to help you gauge the cost:\n\nLet’s imagine that you want to use Instagram to promote a new line of soccer shoes. You’d like to target up-and-coming athletes with an inspiring message. \n\nA mega influencer like the legendary Cristiano Ronaldo (491M followers) might make a great partnership, but with the price tag of $890K per post, it might be entirely out of your budget.\n\nHow Much Do Creators Charge Per Post?\n\nA series of global studies show the trends in rates by platform and influencer tiers on different channels. Here are some of their findings you can bookmark for reference:\n\nInfluencer Rates on Instagram\n\nType of content / Influencer Tier\n\n\t\n\nNano (500-5k followers)\n\n\t\n\nMicro (5k-30k followers)\n\n\t\n\nPower (30k-500k)\n\n\t\n\nCelebrity (500k+ followers)\n\n\n\n\nInstagram Post\n\n\t\n\n$100\n\n\t\n\n$172\n\n\t\n\n$507\n\n\t\n\n$2,085\n\n\n\n\nInstagram Video\n\n\t\n\n$114\n\n\t\n\n$219\n\n\t\n\n$775\n\n\t\n\n$3,138\n\n\n\n\nInstagram Story\n\n\t\n\n$43\n\n\t\n\n$73\n\n\t\n\n$210\n\n\t\n\n$721\n\nInfluencer Rates on YouTube:\n\nType of content / Influencer Tier\n\n\t\n\nNano (500-5k followers)\n\n\t\n\nMicro (5k-30k followers)\n\n\t\n\nPower (30k-500k)\n\n\t\n\nCelebrity (500k+ followers)\n\n\n\n\nYouTube Video\n\n\t\n\n$315\n\n\t\n\n$908\n\n\t\n\n$782\n\n\t\n\n$3,857\n\nInfluencer Rates on Facebook:\n\nTier\n\n\t\n\nNano Influencer (1K-10K followers)\n\n\t\n\nMicro Influencer (10K-50K followers)\n\n\t\n\nMid-tier (50K-500K followers)\n\n\t\n\nMacro- Influencer (500K-1M followers)\n\n\t\n\nMega Influencer (1M+ followers)\n\n\n\n\nPrice\n\n\t\n\n$25-250\n\n\t\n\n$250-$1.25K\n\n\t\n\n$1.25K-$12.5K\n\n\t\n\n$12.5K-$25K\n\n\t\n\n$25K+\n\nInfluencer Rates on Snapchat \n\nFor Snapchat, research from the Business of Apps published the following rates based on the number of views:\n\nViews (Followers Equivalent)\n\n\t\n\nPrice Range\n\n\n\n\n1K-5K\n\n\t\n\n$500\n\n\n\n\n5K-10K\n\n\t\n\n$1K-$3K\n\n\n\n\n10K-20K\n\n\t\n\n$3K-$5K\n\n\n\n\n30K-50K\n\n\t\n\n$5K-$10K\n\n\n\n\n50K-100K\n\n\t\n\n$10K-$30K\n\nInfluencer Rates for TikTok\n\nAccording to InfluencerMarketingHub, their research indicates the following rates for TikTok content creators:\n\nTier\n\n\t\n\nNano Influencer (1K-10K followers)\n\n\t\n\nMicro Influencer (10K-50K followers)\n\n\t\n\nMid-tier (50K-500K followers)\n\n\t\n\nMacro- Influencer (500K-1M followers)\n\n\t\n\nMega Influencer (1M+ followers)\n\n\n\n\nPrice\n\n\t\n\n$5-$25\n\n\t\n\n$25-$125\n\n\t\n\n$125-$1.25K\n\n\t\n\n$1.25K-$2.5K\n\n\t\n\n$2.5K+\n\nThese prices are not set in stone—they are guidelines to help you budget your promotion and assess what channels make the most sense for your brand. \n\nHow Many Influencers Should You Work With?\n\nRather than putting all of your eggs in one basket, plan to work with at least five influencers for your first campaign. This will give you a better understanding of how and where your messaging and targeting work best. \n\nRemember that content creators reach different audiences on their channels, which can greatly impact your campaign outcome.\n\nNow let’s explain how to find the best influencers for your brand.\n\nStep Four: Find the Best Influencers for your Campaign\n\nIf you partake in social listening as an ongoing activity in your social media tasks, you probably know who the biggest players are in your industry or niche.\n\nBut if you don’t know where to start, refer to these research methods to find promising content creators.\n\nCompetitor Research\n\nLet’s revisit our first step (researching your competitors). Add a column in your spreadsheet dedicated to tracking posts from their collaborators, noting their engagement metrics.\n\nIt’s possible that the same influencer might be open to working with your brand or product if they’ve worked with your competitor. \n\nBuild the list until you have at least 20-30 names, including their handles, contact information, and the number of followers in your spreadsheet.\n\nAsk Google\n\nYou can also try Googling a keyword related to your industry to discover influencers. Let’s imagine you want to promote a beauty product and need to identify influencers. Just put in your target keywords and evaluate the search results.\n\nMost of these lists will already have vital information such as the number of followers, and past examples of high-performing content. Remember that audience size isn’t everything. Evaluate their posts, read the comments, and be mindful that they should align with your brand.\n\nLook at Hashtags\n\nHashtags based on topics or keywords can help you spot potential creators, and you can also filter them by geography if location is essential to your campaign.\n\nHere we found a content creator focused on travel using the hashtag discovery tool on Instagram. Repeat this process until you have a healthy list to start your outreach with.\n\nDiscover Influencers with Influencer Analytics\n\nThe Influencer Analytics App has two dedicated tools for influencer discovery.\n\nYou can find content creators with the filters tool, allowing you to search for an individual and filter them through more than 30 data point breakdowns, including:\n\nCountry or language\nDemographics, engagement rate, likes, and subscribers\nPrice and views\nTheir last content published\n\nThe second tool leverages keywords to find content creators. Just enter your relevant keywords and find influencers who have mentioned those keywords in their videos, streams, or posts. \n\nThese two tools can help you narrow your search more quickly, allowing you also to estimate and forecast advertising budgets, and share your influencer lists with your colleagues or team members.\n\nHow to Evaluate Influencers\n\nNow that you have a list of content creators, it’s time to focus on qualifying and vetting them. Here are a few key considerations:\n\nMessaging: Take a deep dive into their posts and evaluate the tone, message, and overall philosophy. \n\nDoes their viewpoint match or align with your brand voice? Do they support a controversial topic you want to avoid? \n\nGetting in front of a new audience to grow your brand awareness isn’t just about the numbers. It’s about getting the right brand message out there. \n\nAudience: Unfortunately, there are a lot of fake profiles out there, including those that impersonate others. Users may do this to piggyback onto trending content and write comments that are seen by all the influencers’ followers. \n\nThis is a deceitful practice and can even contribute to social harm. Evaluate the tone and content of the comments section closely. You wouldn’t want your business to be affiliated with these negative tactics. \n\nA creator who doesn’t align with your values or engages in controversial topics could damage your brand on an epic scale, so be sure to do your homework!\n\nOrganic vs. Sponsored Content: Users can sniff out when a content creator is promoting another product or service. That’s why having back-to-back sponsored posts should be avoided as they can negatively impact engagement rates. \n\nMake sure your creator predominantly publishes their own content with just a few sponsored posts in between to maximize engagement.\n\nDiscover the perfect influencer for your business\n\nwith Influencer Analytics\n\nTry for Free →\nStep Five: Reach Out and Make Contact\n\nNow that you have a list of content creators you want to work with, you’ll need a strategy for outreach and agreeing on the terms of your engagement.\n\nInfluencers receive a high number of solicitations, so it’s important to formulate an outreach message that’s respectful, relevant, and shows you’ve done your research. \n\nDon’t be pushy, don’t be starstruck, and don’t talk about price in your first communication. \n\nInstead, be professional, be sincere, be brief, and be prepared to follow-up. In fact, the average open rate is 50%, and the reply rate is 20% or less in influencer outreach. So don’t hang up the towel right away if you don’t receive a response.\n\nAside from the monetary gain, influencers are motivated by other, more personal factors. They want to make sure the brand aligns with their values and messaging. They want to create content with resonance that engages their audience. \n\nAfter all, it’s their personal brand that they worked hard to create. They won’t want to lose trust, confidence, or followers by promoting something they don’t believe in.\n\nExample of an Influencer Outreach Message\n\nThat said, here’s a generic but effective template you can tailor for your industry-specific outreach letter. \n\nTry to use specific examples, and speak the language of the influencer you want to work with.\n\nHey/ Hello [influencer name]. My name is [your name] and I’m with [brand/business name]. \n\nI’ve been following your [posts/profile] on [platform or channel] and loved your post [about topic] because [add your personal reason that adds the human element].\n\nLike you, our [brand/business] is focused on [describe what your company and the post have in common]. If you’re interested in collaborating together, I would love to send you [a free sample/ more details/ the product].\n\nThanks so much, hope to hear from you!\n\n[Your name]\n\nHere’s how that might look in the real world:\n\nHey Amanda! My name is Lucy, and I’m with a company called AngelHair. \n\nI’ve been following your story on TikTok and was inspired by your fundraiser for chemo patients. Sharing your personal story means a lot, and has helped so many going through the same journey.\n\nNot sure if you’ve heard of us, but we’re a nonprofit dedicated to providing 100% no-cost wigs to cancer and chemo patients. If you’re interested in a collaboration, I would love to send you more details.\n\nThanks so much, hope to hear from you!\n\nLucy\n\nOnce you start getting positive responses from influencers, you’ll want to define the agreement, deliverables, and cost.\n\nStep Six: Agree on Deliverables and Execution\n\nSome collaborators might come back to you with a pricing schedule right away, while others might want to ask you what your budget is first and then try to negotiate.\n\nMany brands don’t even pay for the collaboration but offer something in kind, such as mention on their social media, or a generous supply of that product or service free of cost.\n\nThis could be harmful to your brand, especially when first starting, so be sensitive and listen to the creator’s prices with respect. They’re giving you their time and expertise and deserve to be fairly compensated.\n\nIf you cannot agree on a price or if it’s far beyond your budget, don’t keep going back and forth to negotiate. This will come off as bartering and is frowned upon in the industry.\n\nFor the campaign itself, you’ll need to agree on the following:\n\nHow many posts and which channel(s) they’ll be published on\nWhat type(s) of post(s), such as videos, stories, photos, takeovers, live broadcast\nPublishing frequency (such as once a month per quarter, once a week, once every two weeks)\nCampaign duration\nThe approved message and creative that aligns with your brand\nMetrics to track (engagement rate, reach and impressions, and how the influencer will share these results with you)\nTracking in place, with UTMs or branded hashtags\nHow and when the creator will receive payment\n\nContent creators are very talented individuals, and that’s why you’ve decided to work with them. At the same time, you’ll want to have all the tasks, creative, deliverables, and execution for the timeline set in stone.\n\nYou can ask for the influencer to put together the project scope or create your own agreement and send it over with your terms and conditions. Both parties must agree and sign it before commencing the work.\n\nStep Seven: Launch and Monitor Your Influencer Marketing Campaign\n\nAfter you’ve decided on all the creative elements, timelines, and have agreements and retainers taken care of—it’s time to launch your campaign!\n\nIf it’s your first time working with a content creator of significant influence, expect a big influx of activity after they hit publish.\n\nYou might not be accustomed to this, so ensure your team is monitoring the situation. You should let your customer specialist teams know that more support could be needed. A rapid surge in new users will likely need more help with your product or service than established customers.\n\nFurthermore, expect an influx of activity on your social media channels, all of which deserve your immediate attention.\n\nTo monitor and respond to social media comments and messages in real-time, use the Social Media Inbox tool from Semrush. You can add all your owned media channels and answer comments, questions, and any direct messages you receive.\n\nThis helps you gauge the audience’s reaction to your campaign, letting you see immediately if it’s making a positive impact or if a negative response arises.\n\nThat takes us to the final step in our creator marketing checklist: reporting and analysis.\n\nStep Eight: Analyze Campaign Results\n\nIf your campaign results met or exceeded your expectations, congratulations! You now have a solid baseline to compare your future influencer marketing success.\n\nPull the plug and hold the campaign if your efforts start generating a negative buzz. You don’t want it to damage your business’s reputation.\n\nAlso, if you’re not seeing growth in new followers, traffic to your website, or engagement—use this information to reshape your future approach.\n\nBe sure to request all metrics from your collaborators and to have a wrap-up discussion reviewing what worked best, what didn’t work at all, and what recommendations they can provide.\n\nInfluencers are masters of their craft and most likely can provide helpful feedback and suggestions to improve your results. They may also want to partner with you long-term and collaborate on seasonal, topical, or industry-themed campaigns. Be professional, authentic, and open to future partnerships. \n\nLeverage the Power of Influencer Marketing to Build Your Brand\n\nFrom sourcing, budgeting, and qualifying content creators—we’ve discussed everything you need to know to get your first influencer marketing campaign off the ground.\n\nYou also have the most important metrics and KPIs to track, enabling you to fine-tune your future campaigns and optimize the process the next time around.\n\nWith social media being a perpetual shapeshifter, what works today might look very different from a strategy five years from now. \n\nInfluencer marketing is certainly here to stay, so we hope you seize the opportunity to enhance your business with the social proof that content marketing brings.\n\nLevel up your content creators strategy\n\nwith Influencer Analytics\n\nTry for Free →",
  "headers": {
    "h1": "The 8-Step Checklist for Launching a Creator Marketing Campaign",
    "h2": [
      "Step One: Competitor Research",
      "Step Two: Define Your Campaign Goals and KPIs",
      "Step Three: Set Your Budget and Promotion Plan",
      "Step Four: Find the Best Influencers for your Campaign",
      "Step Five: Reach Out and Make Contact",
      "Step Six: Agree on Deliverables and Execution",
      "Step Seven: Launch and Monitor Your Influencer Marketing Campaign",
      "Step Eight: Analyze Campaign Results",
      "Leverage the Power of Influencer Marketing to Build Your Brand"
    ]
  },
  "images": [
    {
      "src": "https://static.semrush.com/blog/uploads/media/2c/1a/2c1a69a687c64d5736c8ae4d57436779/launching-a-creator-marketing-campaign.svg",
      "alt": "Astronaut holds a checklist before a pencil-shaped spaceship"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/4e/4b/4e4b2e39fd16d00325fef599c10522f4/EN-Influencer-Marketing-Checklist.png",
      "alt": ""
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/da/e6/dae638a7b1aea2c47fe61a287156ff3d/BuzzGuru_Competitor_Analysis.png",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/52/5e/525e991aa2b07decfdcb5b59ce93f5d2/BuzzGuru_Competitor_Analysis_AllVideos.png",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/d9/9c/d99c28402bbb9059f866fc3bd93a6db2/Creator-Marketing-Metrics.png",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/a9/e4/a9e4c4dfd27453c9a08fdbc5a3bc7047/Types-of-Influencers.png",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/6b/e2/6be23174454bbfe854004ea2711a8567/google-beauty-influencer.png",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/81/e5/81e59c05460f1aaecc623ec52b3e35bd/hashtag%20influencer.png",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/c9/82/c982a14308c0419d7ecc84fb5460afd7/1a1ab6b3dcb7b7505cefc0ca2ea73030/image.png",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/63/a6/63a609368a0dbdfed4e315d6e4096aff/advanced_seo_techniques.png",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/fe/ed/feed5607c3e6eec91d25745505e3643b/semrush_socialmedia_free_tool_inbox.png",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/34/e0/34e03e2d1e0c83b064b32ee9d6ebe5d4/frame_8.png",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/semblog-next-static/banners/trial-gift.png",
      "alt": "Trial Semrush banner"
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&d=Mon%2C%2021%20Oct%202024%2014%3A25%3A13%20GMT&n=4d&b=How%20to%20Launch%20a%20Successful%20Creator%20Marketing%20Campaign&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fcreator-marketing-campaign%2F%23step-five%3A-reach-out-and-make-contact&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&b=How%20to%20Launch%20a%20Successful%20Creator%20Marketing%20Campaign&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fcreator-marketing-campaign%2F%23step-five%3A-reach-out-and-make-contact&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://bat.bing.com/action/0?ti=5128787&tm=gtm002&Ver=2&mid=44e8d138-c82b-46e3-8397-8ee0d4f8b049&bo=1&sid=3d5c62908fb811ef80185dfa74ec9eb6&vid=3d5ce8808fb811ef87cb2fe9471b7ba0&vids=0&msclkid=N&uach=pv%3D10.0.0&pi=0&lg=en-US&sw=1536&sh=864&sc=24&tl=How%20to%20Launch%20a%20Successful%20Creator%20Marketing%20Campaign&p=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fcreator-marketing-campaign%2F%23step-five%3A-reach-out-and-make-contact&r=&lt=749&evt=pageLoad&sv=1&cdb=ARoR&rn=620858",
      "alt": ""
    }
  ],
  "publication_date": null
}