{
  "url": "https://www.semrush.com/blog/ecommerce-website-optimization/",
  "title": "Ecommerce Website Optimization: 12 Strategies to Increase Sales",
  "content": "Ecommerce website optimization is about one goal: increasing revenue. \n\nLuckily, there are many paths to revenue, from high-quality traffic and conversion rate optimization (CRO) to average order value (AOV). \n\nIn this guide, we’ll explore 12 strategies for optimizing your site to grow your ecommerce business. Combined, these strategies will help you generate more traffic, conversions, revenue, and profit. \n\n1. Conduct Keyword Research & Develop a Keyword Strategy\n\nKeyword research is the process of uncovering how people search online for the products you offer.\n\nUsing this information, you can optimize your website to rank higher in search engines and generate more traffic. (This is called “search engine optimization” or SEO.)\n\nWhether you’ve just set up your online shop or you’ve been at it for a few years, understanding how to optimize ecommerce website SEO should be take priority.\n\nHowever, before you can optimize your website for SEO, you need to determine which keywords (search terms and queries) you should target. Then, you can apply best practices to rank higher for those terms. \n\nFor example, let’s say you run an ecommerce store that sells tennis rackets. People might search for all kinds of variations of the term, including “tennis rackets,” “kids tennis rackets,” “left-handed tennis rackets for kids,” etc.\n\nBut how do you know which keywords people use most and which ones to target?\n\nEnter: Keyword research tools.\n\nThese are specialized tools used in the SEO process to uncover keyword suggestions and information about potential keywords that allow you to evaluate them. \n\nYou can begin the process using a tool like Google Keyword Planner.\n\nIt’s free and fairly simple to use.\n\nOpen Keyword Planner and click “Discover new keywords.”\n\nType a keyword into the box to get started. Click “Get results.”\n\nNext, you’ll see a “Keyword Plan” page. This page recommends keywords based on the original term you provided. It includes options to filter within the suggestions and find keywords that make sense for your business to target.\n\nIt also includes data on average monthly search volume and competition. \n\nNote: Metrics shown in Google Keyword Planner are based on data for Google Ads and don’t necessarily reflect the organic results.\n\nIf you want a more comprehensive approach, consider the Semrush Keyword Magic Tool.\n\nBased on a single keyword, you can uncover thousands of keyword suggestions and easily group them into a logical structure.\n\nLet’s continue the example from above. \n\nYou run an ecommerce site that sells tennis rackets. \n\nStart by navigating to the “Keyword Magic Tool” from the left-hand menu in the Semrush platform.\n\nThen, type a keyword into the search box. Click “Search.”\n\nThe Keyword Magic Tool uses your keyword as a starting point. (This is called a “seed keyword.”) From there, it generates a list of thousands of keyword suggestions. \n\nYou can review these suggestions to find relevant keywords for your ecommerce business. \n\nBut how do you decide which keywords are a good fit?\n\nGreat question. \n\nFrom the Keyword Magic Tool, you’ll see that many data points are provided with each keyword.\n\nYou’ll want to focus on three key factors:\n\nSearch intent (“Intent”)\nSearch volume (“Volume”)\nKeyword difficulty (“KD %”)\nSearch Intent\n\nWhenever someone types a term into Google, they are expecting a specific type of result. This is called search intent.\n\nThere are four main types of search intent: \n\nNavigational: The user is looking for a specific site or sites\nInformational: The user wants a question answered or information about something\nCommercial: The user is researching services or products before buying\nTransactional: The user wants to complete an action from a specific brand, like purchasing a product online\n\nFor example, if you type “buy Wilson tennis rackets” into a search engine, the intention of your search is likely to buy a tennis racket. You’re expecting products to appear in the search results. This would fall under “transactional” search intent. \n\nBut if you had searched “best tennis rackets,” that would be “commercial” search intent since you wanted to explore options before making a purchase. \n\nUnderstanding the search intent of any keyword you want to target is an important part of your ecommerce SEO strategy. \n\nThis is because you’ll want to match the keyword’s search intent with the content of the page on your site.\n\nFor example, “left-handed tennis rackets” reveals lists of products or product category pages.\n\nThis means it has commercial (or “commercial investigation”) search intent.\n\nCompare that to results for “left-handed tennis.”\n\nThe results here are articles and information about left-handed tennis players. This query has informational intent. \n\nHow does this affect your ecommerce website optimization strategy?\n\nIn order to capitalize on potential search traffic, it’s crucial for content to match search intent. Put another way, the content should match the expectations of the searcher—are they going to find what they’re looking for?\n\nLet’s say you’re planning to choose a keyword to target for your product category page full of left-handed tennis rackets. \n\nYou’d want to choose a keyword with commercial intent. Why? Because a list of products is commercial content. \n\nTo help with this task, use Keyword Intent Filter, a Keyword Magic Tool feature that lets you quickly filter your list of keywords based on search intent.\n\nYou’ll see a column for each keyword showing “Intent.” It has letters that represent the categories of search intent for that particular keyword (e.g., “N” = “Navigational”).\n\nUse the filter to find keywords that have search intent that aligns with your ecommerce site and the specific pages you want to optimize.\n\nClick the “Intent” filter drop down at the top of the keyword list. Then check the box next to the intent(s) you want to target. Click “Apply.”\n\nNot sure which type of search intent to focus on?\n\nHere is a general guide with specific examples based on this search example:\n\nProduct pages = Transactional (“Wilson left-handed tennis racket”)\nCategory pages = Commercial (“best left-handed tennis rackets”)\nBlogs or articles = Informational (“left-handed tennis techniques”)\nKeyword Difficulty and Search Volume\n\nThe other factors you’ll want to consider when choosing a target keyword are keyword difficulty and search volume. \n\nMost likely, you’ll want to focus on what’s known as “long-tail keywords.”\n\nLong-tail keywords are search terms with lower search volume (less popular). But they also tend to have lower difficulty (they’re less competitive). \n\nBut if they’re less popular, why would you want to spend time on them?\n\nThis combination means you’ll have a better chance of ranking for these types of keywords. \n\nYou may not be able to rank for a keyword like “tennis rackets” because it will be dominated by major brands like Amazon, DICK’s Sporting Goods, and other behemoths. \n\nBut if we look at a long-tail keyword like “beginners tennis rackets,” we see the keyword difficulty is much lower. \n\nThis would make this a much better keyword to target. This is especially true if your website is fairly new or does not have a lot of backlinks from other websites. In this situation, choosing lower-difficulty keywords can give you a huge advantage. \n\nGet Keyword Suggestions\n\nwith the Keyword Magic Tool, the Biggest Keyword Database on the Market\n\nTry for Free →\nEcommerce Keyword Analysis\n\nAnother great way to start the keyword research process is to see what’s working for successful businesses selling the same products. \n\nBut how do you uncover this information? Luckily, there’s an app for that. \n\nEcommerce Keyword Analytics is a unique keyword research app that offers valuable information about ecommerce keywords being searched on leading retailers' domains (like amazon.com and target.com). \n\nWith this app, you can peek at the top-performing keywords being searched on these retail sites and use them to strengthen your own online business strategy.\n\nUsing clickstream data, the app estimates how often specific keywords lead to clicks and sales on these retail sites. If you find a keyword with a high conversion rate on these sites, you can assume it comes with high buying intent and could be valuable for your campaign, too.\n\nBy focusing on the relationship between keywords and shopper patterns, this app brings you another perspective to evaluate keywords, especially for ecommerce. \n\nAt $19.99 per month for Semrush users (also available as a free 7-day trial), you might not find a more valuable tool for your online business. \n\n2. Implement On-Page SEO Optimization\n\nIf you want to optimize an ecommerce website for SEO, on-page tactics, like using keywords in strategic spots, will be essential. \n\nIdentify a primary keyword for each page and use it in the following places:\n\nTitle: The main title of your page, which appears in the SERP and the browser window, should include your target keyword\nHeading: Your page’s main heading (H1) and subheads (H2, H3, etc.) should include the target keywords\nMeta description: The meta description for your page should include the target keyword\nBody copy or product description: The main text on your page (e.g., body copy, article body, or product description) should include the target keyword\n\nFor example, if you’re targeting “women’s tennis rackets,” you’d add this keyword in the places noted above to this page on your site. \n\nIf you want to generate converting meta and product descriptions with the help of AI, try the Ecommerce Booster app. It also helps you identify target keywords, write alt texts, and improve image quality.\n\nBut this is just the start.\n\nYou’ll also want to implement more advanced on-page and technical SEO best practices. And you’ll need to go beyond optimizing each individual page. \n\nA comprehensive SEO strategy involves many other factors like:\n\nWebsite structure and hierarchy\nTechnical SEO\nContent marketing\nLink building to increase site authority\n\nRead our full guide for a comprehensive walkthrough on how to optimize your ecommerce website for SEO.\n\n3. Optimize Product Page Layout\n\nIncreasing conversion rates will drive additional revenue from customers visiting your website. One critical way to increase conversion rates is to optimize your individual product pages.\n\nLet’s say your product pages currently convert at 10% and receive 1,000 visitors per week. If you’re able to increase that conversion rate to 12%, that’s 20 additional sales every week. Impressive, right?\n\nFollow this guide to implement a structure that follows conventional page layout best practices:\n\nThis simple product page layout provides a familiar structure and flow. Plus, it includes all of the relevant details a shopper may want to know, like price, features, and other notable details, before making a purchase. \n\n4. A/B Test Product Pages\n\nA/B testing lets you test two different versions of the same page to see which one performs better. \n\nImplement an A/B testing strategy to improve your product pages' flow and conversion rate by testing different text, layouts, and colors.\n\nWhile there are clear page layout best practices for product pages, which we discussed above, each business is unique. Even small tweaks can have a huge impact on sales, which is where an A/B test can help.\n\nFor example, you might send 50% of your traffic to a page with a call to action that says “Buy Now,” and 50% of your traffic to a page that says “Add to Cart.”\n\nWhich one will perform the best at driving conversions?\n\nWhich one will lead to a lower bounce rate?\n\nYou won’t know until you test. \n\nTo implement A/B testing, you’ll need a few tools and systems in place. Read our full guide on running an A/B test from start to finish.\n\n5. Create Urgency\n\nAn easy way to supercharge ecommerce website optimization is through urgency.\n\nOne case study found a 400% increase in conversion rate with a single email meant to induce urgency. It coincided with a Black Friday sale and reminded the shopper the deal would expire in four hours.\n\nSo, how can you use this tactic to your advantage? \n\nAdd messages that communicate urgency to pages throughout your website. This can include the homepage, product pages, and even your checkout or cart pages. \n\nUrgency can take many forms:\n\nLimited-time offers\nFlash sales\nExpiring coupons\nCountdown timers\nLow-stock indicators\n\nThere are a few tools you can implement, depending on the platform you use: \n\nShopify: Urgency Pack Ultimate, Stock Sheep, Urgency\nWordPress: OptinMonster, Thrive Ultimatum, Countdown Timer Widget\nWooCommerce: Sales Countdown Timer, Product Availability Slots\n\nYou can also add urgency to your other digital marketing efforts—like emails, ads, or retargeting campaigns. \n\n6. Capitalize on Social Proof\n\nUse social proof to build trust and convince potential customers to make a purchase. \n\nSocial proof includes things like:\n\nCustomer reviews\nTestimonials\nQuotes\nData or case studies\nSocial media endorsements\n\nThese anecdotes help reinforce your marketing messages.\n\nAdd these page elements to your homepage, category pages, and product pages to help persuade shoppers that your claims are valid and backed up by your customers.\n\n7. Optimize Product Categories or Listing Pages\n\nImprove your site navigation and customer experience by optimizing your product categories or listing pages. \n\nThese pages are one of the main ways users browse and find products on your ecommerce site. \n\nThey also serve as landing pages. Shoppers looking for a specific type or category of product might discover your website after searching for a general term like “beginners tennis rackets.”\n\nThis means these pages are vital for making a first impression on potential customers. And increasing the conversion rate could drive a big boost in revenue.\n\nImprove the experience with these optimization tips:\n\nAdd unique content: A description and overview of the product category helps users navigate your site, and it’s beneficial for SEO to have additional content on the page\nInclude product comparisons: If applicable, show comparison content between specific products or types of products within the category\nLink to product subcategories: If the category contains subcategories, allow users to quickly drill down into those groups to further refine their search\nUse breadcrumbs: Help users (and search engine robots) understand your site architecture with breadcrumb links\nInclude sorting and filtering: Allow users to quickly find the right products for them by filtering and sorting within the broader category\n8. Identify Issues in the Checkout Process\n\nAnalyze your purchase and checkout process to identify points of friction or confusion that hurt sales. This is a critical part of conversion optimization for ecommerce websites.\n\nGenerally, you would assess the checkout flow by analyzing cart abandonment rate. But the cart abandonment metric is actually driven by each step in the checkout process and the drop-off rate between each of those steps. \n\nFor example, Let’s say users go through the following four-step checkout flow:\n\nShopping cart page\nShipping details page\nCheckout page with payment\nConfirmation\n\nBetween each page, there will be a drop-off.\n\nThe drop-off is the percentage of potential customers who reach a page but never complete the step in order to move to the next page (e.g., they make it to the shipping page but then drop off before getting to the checkout page).\n\nThis can be caused by any number of factors.\n\nOnline shoppers may get confused or have technical issues that prevent them from moving forward. The checkout process itself could be too complex and drive them away as well. \n\nSo, how do you find (and fix) these problems?\n\nLook at the analytics for your ecommerce store and track how users move from one step to the next.\n\nHere’s how to do this using Google Analytics:\n\nFrom the Google Analytics 4 (GA4) dashboard, click “Reports.” Then click “Monetization” > \"User purchase journey.”\n\nFrom this screen, you’ll be able to see each step in the checkout process. In this case, it starts with “View product” and flows through to “Purchase.”\n\nFor each step, GA4 automatically calculates an abandonment rate. \n\nNote: If you’re not seeing the report as shown above, you may need to configure it within Google Analytics. Refer to our guide, Getting Started with GA4.\n\nWith the abandonment rate in hand, you can investigate further. \n\nIdentify the steps that are creating the biggest drop-off. Then, you’ll need to explore ways to solve the problem. \n\nYou could start with A/B testing the pages to improve your ecommerce website optimization strategy.\n\nOr consider using a session recording software like Hotjar that lets you replay an individual user’s session and see where they may be getting stuck. \n\n9. Use an Upsell\n\nUpsells allow you to improve AOV by selling more products to each customer who completes a purchase. \n\nThe idea is simple: Based on the customer's purchase, you can automatically recommend targeted or complementary products they may also be interested in buying. \n\nFor example, you could encourage customers who buy protein powder to purchase a shaker for mixing the protein with water. \n\nDepending on the price of the products, this simple nudge could increase the value of each order by a significant amount. \n\nHow do you implement upsells? \n\nThe most basic version of an upsell is a related products widget.\n\nThese widgets automatically show products related to viewed items or those added to cart.\n\nThey usually work based on tags or categories applied to items in your store. Or, in some cases, they analyze user shopping behavior to make suggestions programmatically. \n\nMany plugins and modules like the following allow you to easily add this functionality to product pages or key pages during the checkout process: \n\nShopify: Bold Upsell, SellUp\nWordPress/WooCommerce: Best Upsell, One Click Upsell Funnel\n10. Prioritize the Mobile Shopping Experience\n\nOptimize the usability and functionality of your website for shoppers on mobile devices. \n\nDepending on the nature of your ecommerce business and your target audience, this change alone could dramatically improve site-wide conversion rates and revenue. \n\nGiven that more people are shopping on their phones, knowing how to optimize your ecommerce website for mobile is no longer optional—it’s a necessity.\n\nIn fact, one study from SaleCycle found that mobile users make up as much as 75% of visits to retail and ecommerce websites. The mobile user experience can have a significant impact on your site’s success. \n\nBut how do you optimize for mobile? Start by using Google’s Mobile-Friendly Test tool.\n\nThis tool will help you understand how your site looks and functions from the perspective of a mobile shopper. \n\nIf your site is not mobile-friendly, you’ll receive a report that says, “Page isn’t usable on mobile,” along with specific issues.\n\nFollow the suggested action items to resolve. \n\nKeep in mind that the easiest way to remedy mobile UX problems is a responsive website design that allows your site to work on all devices.\n\n11. Personalize the Shopping Experience\n\nProduct recommendations increase conversions by 8%, according to a case study from Monetate. Personalize the shopping experience to drive higher conversion rates and increased revenue. \n\nPersonalization includes a broad range of tactics, including:\n\nTargeted deals, offers, and coupons\nProduct recommendations based on past purchasing behavior\nCustomer loyalty programs\nPop-up messages based on shopper behavior\n\nTo implement personalization for your ecommerce website optimization strategy, start with the basics:\n\nUse a tool like Exit Pop to target potential customers who are about to leave with a special message and offer\nRun a retargeting ad campaign for customers who viewed specific products\nConfigure personalized abandoned cart emails for customers who don’t complete their purchase\n\nOnce you have the basics in place, you can look into a comprehensive approach. \n\n12. Improve Site Speed and Page Load Time\n\nWebsite speed (how quickly pages load and display information) is a Google ranking factor.\n\nIt’s also a conversion factor. \n\nDigital marketing agency Portent found that a site that loads in 1 second has a 3x higher conversion rate than a site that loads in 5 seconds.\n\nIn other words, a slow website site can hurt your rankings, traffic, and conversions. \n\nMany factors impact your page speed.\n\nTo test and improve your site performance, start by using the PageSpeed Insights tool from Google. \n\nSimply type your website’s URL into the box and click “Analyze.”\n\nThe tool will analyze your website’s load speed and a variety of performance metrics.\n\nIt will recommend specific action items you can complete to reduce load times and improve site performance.\n\nThese recommendations will include reducing the file size of your web pages, removing unused code, and adjusting how your page loads to improve performance.\n\nIf your site’s performance isn’t great, work your way through the list according to the recommendations.\n\nFurther reading: Google PageSpeed Insights: What It Is & How to Boost Your Score\n\nOptimize and Refine Your Ecommerce Site\n\nWhile this isn’t a comprehensive list of everything involved in ecommerce website optimization, it’s a fantastic place to start. \n\nHowever, new tactics emerge every day that will help you improve user experience, drive more sales, and boost your profit margin. \n\nIt’s crucial to know the trends shaping consumer behavior today—and what it means for your ecommerce business in the coming year. \n\nExplore our 2023 report: The Future of Ecommerce Is Now to stay one step ahead of the competition at all times. \n\nAccess Everything You Need\n\nin One Platform with Semrush\n\nGet a FREE Trial →",
  "headers": {
    "h1": "Ecommerce Website Optimization: 12 Strategies to Increase Sales",
    "h2": [
      "1. Conduct Keyword Research & Develop a Keyword Strategy",
      "2. Implement On-Page SEO Optimization",
      "3. Optimize Product Page Layout",
      "4. A/B Test Product Pages",
      "5. Create Urgency",
      "6. Capitalize on Social Proof",
      "7. Optimize Product Categories or Listing Pages",
      "8. Identify Issues in the Checkout Process",
      "9. Use an Upsell",
      "10. Prioritize the Mobile Shopping Experience",
      "11. Personalize the Shopping Experience",
      "12. Improve Site Speed and Page Load Time",
      "Optimize and Refine Your Ecommerce Site"
    ]
  },
  "images": [
    {
      "src": "https://static.semrush.com/blog/uploads/media/77/56/77564ae1979f81f8133028e0d8b09d8e/4750a18d44d9fc38384f4da300c68648/ecommerc-website-optimization.svg",
      "alt": "Ecommerce Website Optimization: 12 Strategies to Increase Sales"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ff/1c/ff1cb09889979c746a34daf689196a77/y75YY3DBJwHpQ7B9xbsKlR_E_ZTJAJjdapoKd0n12owkjqaXh2iS_hG_2eSqmOADNyXIfbL4f_3B8CtfRsW6LEt-DSF0mfTkJTnIOj_N3IAJVM_m0cIDJ6D79OXkNtfNC2aMiobzKEKoXP2bRsZKq8M.jpeg",
      "alt": "“Discover new keywords” highlighted in Keyword Planner"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/31/d0/31d063cb20ac5bbdf1f38e3bf02791a3/FwgDBE205MmsPKW7TnU8WqZ1_l_sq1XKZEuF5peKIPFMMgEQxp2YC-qVEQbDKF-cdDuCcvpMxjWpSu-EPJJyo4n4VxgCw4kD3SOsGVY_8FVUQmr52Yva_ZcLHO3CsQQixlyjir-s-Zlg5qdPZfs9zAA.jpeg",
      "alt": "\"Discover new keywords\" pop-up window"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/65/16/6516cae9d1a1afe87ab163dbf9b232ce/0ZdYw2XcnQEHmssDer9RLFUjo3kjxQK6RZnsBD3O7ybig2B1XkwXzxzeNEyBmemIC4y8zN-Iw2iYw2ZSKnMuyLe073fMOZhHf-z9tTow_Z1PTOG7vSKcxK35GrEUKGWxPSj7hdoKxg1r8RqJY7TrGuI.jpeg",
      "alt": "“Keyword Plan” page"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/04/4a/044a8885b751e7598bd4fa967b559468/_AOaVmx5NP_Pc3Cx3os1OvpjQB4ruAHagBMbOuBq4WlEMsWD8KBk_K72a_uR8SUoMlSarzMdLxrPxbS4UUBuMhj41Kxp5V3A3FAWrYkzxMymYGkQQBXv9Z3KWDXf93XsIJbGVU4pZOmLXM_pOwORFHM.jpeg",
      "alt": "“Keyword Magic Tool” highlighted in Semrush platform menu"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/49/c1/49c1569222dfb6f51d4024406b9e4699/0XcJTCStE3dIQQ8EKFSt1SFm7YUfbsfx7eQ2bkCKcaIYxaljNksDJnLwKzvGnkmQrw1sTAy-Q_9CyW0E1wpnf0s1ThlTrD9MuOV9Pp0iuaPaGUfhX5-yogK1xXS1b8ZrXhQ-mbCZYeVJjFj82kHs14g.jpeg",
      "alt": "\"tennis racket\" entered in Keyword Magic Tool search bar"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/68/e7/68e7961c274e4d8ab7f54994a362d04d/kTpG9tFyAA73X0kn7oc94WoTHHX4PZEH9rit5Fta-2UExg7HckpojSMEuENjFZA6_pTBAFNhVCXtnZPTJT0glS1nLWu_Mh4dA2jiz04yp04xLVE6v6YxOWHwNjfY-W1ySdhsnMF0D19ImUe2AZxiJ5o.jpeg",
      "alt": "Keyword suggestion for \"tennis racket\" search in Keyword Magic Tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/20/c1/20c10562d20f446470abf2e65f2511c0/CZUj1cKkPJLzm-0lwHtQR-N91seSqf37sIBaIKVe40UrwXP35fcqyR41xXNKUxotuHrkF3FZR1hxRpRbDYt2NMbEyW3Z7rMrPKkWDJg0ARhRhyeBOdbmIA9r5DyCR5UnZxzAV5I51Ux-5Vo-c8IwTYM.jpeg",
      "alt": "“Intent” “Volume” and “KD %” metrics highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/f6/1f/f61f8e21af1d049a9439a83e3c467c2b/xt-TKjz02UZEoQtn_4ZlbXlop_Ya6Zwpg5lWaeA4Sgyg4sygsa58L7_2oLAfv8OHDnTvqyQuzsBnI5eiII1U3iZfdUoe3h1I2PvB7QFMR5T8op9CqreHglTguTdpnpNBvwGQoIxxiwa-vgC7xSts9HM.jpeg",
      "alt": "An image with search intent types explanations"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/96/4f/964f76b6483950926ce8bc4748be53a7/GuFPZuo08ZJhaBFcro0zqzEUeg7pVrFG8qdXbW03HJPvt89YSPhxbeIejXYQjr3bFs5bL8oNpTqZ5EuZjVLq0hKM9BSoUIqoSD74c82EFGP0FF5z6CBBHFYU3Ti3jS3qW5Zazcwweq2kRdUB7lljay4.jpeg",
      "alt": "Google search for “left-handed tennis rackets”"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/c5/22/c522e95c200deb8758e80e59f117d879/xU2D_1_6JUkWhq8ntFHqQ-iujS6XiMm2NdLObQt0ba6h4h6q-6-k-ux4ShZBL3BSXa1ERtM59_ek466YKIU2hz6wQulI884GloSe8VpvVvkqrre7qlAKpGhKif8h-eseuwIyqNFysMYvbCm8t_q2dSw.jpeg",
      "alt": "Google search for \"left-handed tennis\""
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/b1/15/b115ed6a839121a812c1421c97c9b542/oCMNSsxNvYJhssshpI-LHeejRyJKs8dfiL5EAJ545g1eQRcbNRERsaRHp7Fya06P4DIdpLFUnmqWHs4jCHIhScgCh9ZJGiqeK6Vp43FmYIt1iyHgmASvA-btvPt3m4UqJhJ59kE0x3K2FbGx-BVALTw.jpeg",
      "alt": "Keyword Intent column highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/93/4f/934f34d3cbd835d8ea86488f67d8b18f/VhmotmvQEYQD5dkwa6Xe8dTkS7fL5C30pi-DqmwdkzXEADt565IxS_DTvKcSun96WBb55UbKWiBl8vxtmO8EAFOB-qdS1wMvn2jekBUuhYmvIxDoda9wEwFXgR9VseUzOVRd9D7VK1XRzFm5GDw1ql8.jpeg",
      "alt": "“Intent” filter drop down menu"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/74/b7/74b7fb33c13e1a48e21b273c078a968e/e9Va9kQFd6nWXvcUkkTrT5ymMcMRi1nc3DnYd6MOlMy6aF-9N_NArDPhNsInuYDTmS8PZbzeELMH5_iP2AiIgs9CAkO8Xavw27wxhUCKNqTDiwK0IMFkHGcUHODEJW5pWtZIHqgPyICvE6M3TAHbHjY.jpeg",
      "alt": "An infographic on \"keyword searches in Google\""
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/19/63/1963f7a7a01b3ccbe0032c3c5fa31153/zR5gNWvFVTUvqoWdFKz_DrmxTHtJIUTybzQJxLYQ49MaoOi-R3iuhNbJl7gGl2up9XfmvXSP8zmX3xcAt_PmXMO-BUGO0pfD2t1zWlnQxqBu4-INiPfLGsiJzyhGsZyhDlAIydFO68SBOlKdt_IKZXY.jpeg",
      "alt": "Volume (90.5k) and keyword difficulty (70%) metrics for “tennis rackets”"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/61/66/6166792d86485e31573b7d655c9a45fd/FmRt2sYx87bfRqL3bc6QcgF32aszV9L4lhh96MV82zY_0j8yNJjxGfpu02FWfdbGT6rSuwkbKD66aCwL5Z52ELWfF8d_UcudJjon_vp-Jron-OqNfwyyccB2Wk425vM_Q4HCa5xWb4OP5f2FsTwlo0I.jpeg",
      "alt": "Volume (1.0k) and keyword difficulty (25%) metrics for “beginners tennis rackets”"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/b5/5d/b55d501c2d09ce283c30d25a1c7aefdf/90e4b2ac7c9a4e705740245eefe33f77/hoEATPv5m7x-h0uncJAL5d7uZgSYmWIqpUc9mA8Fq27M8hKVx7niNbX2IsCkN-TvU1u7LzEGcri3SLK7vhhyWFotoE7J7pVdEOOqimMucBh8Dxn6h1s6SK11fxFM9lohwlchHgT02Nu_Mf4tnMTYCjs.png",
      "alt": "hoEATPv5m7x-h0uncJAL5d7uZgSYmWIqpUc9mA8Fq27M8hKVx7niNbX2IsCkN-TvU1u7LzEGcri3SLK7vhhyWFotoE7J7pVdEOOqimMucBh8Dxn6h1s6SK11fxFM9lohwlchHgT02Nu_Mf4tnMTYCjs"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/31/ff/31fff42502f60c36467133262093039c/5b92bf55ea5fcf4a1045bc048cd9030e/KupE05tk8btEzx852HaG9LVZyw49cXka866lmCf26STetQw8yLjVabbVMtwVbLgYJ_VBDBk2CbvoOkEcNnvJHDDfI13MP8IdHI6FcF8B5mQxeuqMDWYbC5OQgeMMqdVC9eWwViyAWItScGsh2YV933U.png",
      "alt": "KupE05tk8btEzx852HaG9LVZyw49cXka866lmCf26STetQw8yLjVabbVMtwVbLgYJ_VBDBk2CbvoOkEcNnvJHDDfI13MP8IdHI6FcF8B5mQxeuqMDWYbC5OQgeMMqdVC9eWwViyAWItScGsh2YV933U"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/74/15/7415a19d5500d1d888e85b7e14b847e0/a3dfe77d3f3bff7064a72f72f2d66c11/A97UnWCacMYDZO-3bn4C3BvsAcDA3UCPJBCvBTeKdyeSIBfL6VgxOpWUddyYs8xZtBlkHZpwC9-0e5t-FuimRalh1KHxfaBOkIBIztjYRh16XT2XpNEkztf8HXbENCaEgSzUhEJBaL5hQ3sL5sEPaqk.png",
      "alt": "A97UnWCacMYDZO-3bn4C3BvsAcDA3UCPJBCvBTeKdyeSIBfL6VgxOpWUddyYs8xZtBlkHZpwC9-0e5t-FuimRalh1KHxfaBOkIBIztjYRh16XT2XpNEkztf8HXbENCaEgSzUhEJBaL5hQ3sL5sEPaqk"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e3/cc/e3ccf69d226de5239a4ca3e2bf1d3252/KDWdSb2MhnkIzIIFJ2-Jw6kP1FYLG7sJ0Hojo9UmvI-QMm0qz2N2kpV49YOs2cjkg62l5GRwkvJsxO7NrHHbmTNyne9wXrAt67swe3i8Bt3zXEil_jr0fZikj9fadWcGo7V0VTjIvbcoT244tTkCCSM.png",
      "alt": "Product page template"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/47/b1/47b1e2bc81a5a24e077a89a8dfd28803/w5KztCQHYOObVb6m5fSJlMTkHJDf5TXhfyUaWE3mZ0r_PAuhMRSth82YwUaXnMxnNwecMm0JCOmhRmr2dy56pnVYgMKBd9FgTXamcL93wpq53j6IYdDtjnAdf_5MNJsG-JnrhOkpetdPXHAxDCYK1Es.png",
      "alt": "An infographic on conducting an A/B test"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/16/60/166098b6be7eab463eb0275aafc0d1be/Si3joqqfnC1SChAGxrBoq9ujTW86nrM8H_6yN8h4VOOaPNoPfCV5gdzThQwdvQDzC8-PdVK2zWV426loEO-SDFdjNinKlkwnD1fCiuXCHEeF5Mt0mD3WYt1jWr4LGsdHT09M0HX_OHT5iltKrgw-9jw.jpeg",
      "alt": "An example of creating urgency from \"yankee candle\" website"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/67/d0/67d001ed4190229128f09f45a3002c9c/nv3homWHOGgNZNz0oEuKm3MDw9SSGGwNZ43Ry8RbatmF5e9ZkaYmJfgT7R2uxqfaJE5sWCCplULoSHEy2t1mrvoP36-pb6k4JBi1P1qbgQG86v_lGKVv_ctgj0i--OY7mezdcC4K62jxFk2xuAFAFtg.jpeg",
      "alt": "An example of using reviews on a webpage as a social proof"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/40/a4/40a4d54ea4befa4e49060097cc207014/QTiUHZngRq-jaoMJV9kEG9sWceqHgkp4WlDuGKuX4r_eNDKLebMSL2qP-WcalXMFkw3RMbv2WYQTIWwZj_LMiuvUmVAh2rw28RYnZBLwsL9vv45h_zwAZWxINH8QObHlZcNWXUc7qjq-1XxbP5bkFfs.jpeg",
      "alt": "An example of optimized product categories on Dick’s website"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/80/3c/803c54ca8013c891704fc00f354675c0/QIreEBEm7-3q4ehGsH5meA8j9dpL_p9u4A3kcvDXDk9Gfd3o9jXGtvSUtobMavA0-zHlF1xV822IAGprn1trNXUCii27-7zpLwnAA3xs_wvliE6jAmu5agl5nZShbcmgDKE8DteL7cM-MJiR5lZaHnU.jpeg",
      "alt": "Navigating to \"User purchase journey” in GA4 menu"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/04/b7/04b7266e0830cd5f5504879118923287/CIBACUe93S5tbk4P8RgF5zLPyEb70KFvrDm06KUWsN3Kx_IP_Jpflgrow-JmL0_hwgyP6aQEGMLX13v9Xqm2l7IUFuXRloV67FOyi_yCGfCAOxtXcCzhcvu7i8mmmrYNiIt5Z5QGMuSq-LarUezyVv4.jpeg",
      "alt": "Abandonment rate for each step shows in GA4"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/d5/20/d52018b4dd7edfa05600202c1362493e/CJyI0gUvzKvH-Cz_xTYspcbDCcOmZonO4PDFQ-boiiE8EP-jw_wQiVC7JrkoRuh6tN2o-XriL6ept0K37yaCW5MeFqILkLLhqW74g4Z3QzD_O93RIv2ScSGbPZuTFqXLM8D4IujqNaO65EtfAcVgspk.jpeg",
      "alt": "GNC website recommending a shaker to a user who purchases a protein powder"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/26/e0/26e057f053b02911f98a8191a9cf130a/oRNT6Xg8o_CEz6vWQtSsgyiDClwQnUBKWik2e5CPa8oNE4gwvKpeTPMhBfIPMeCcP-2s4kz4mjYBGcTrA6A9gfQHICBLoh7CVeBV0_Y0YqTWA6E9axrGEkULwrrEIeoFaPiXm0iEdDGyO3Aq9QSDdrQ.jpeg",
      "alt": "\"You may also like\" product section"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/dd/2a/dd2a4f44b1e8e6807d8f5007a68d2a75/9DzAvkASkkUrA3YcCfDhPiFQCwj5Bk9iIpWX0UgXRSGQWdjRtsagWc_DHqGDipX724C9cnPLdmJPJY5_uhe5urmTEv3dSEiAUtZBpl7f40mzEWAhtVurViFzSrc3o8jyvJRWlXPV6XqDjK_QxwtcF3s.png",
      "alt": "Mobile-Friendly Test landing page"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/8c/1a/8c1a1ae7e48f27634472f4f0120b8012/ce3TUflhb4PwfZAKdG89nU9ue0BcMEbGOnVIE9diR68blFniDcOYvB9N2faMoCnvLSp3y8c81U7YV1w7qaJfUThCdtEJjAA6lsVGTZKV0auw85P692gzXSaPt2BdvaUgXJWqhaBCRiwQdHyRxot0lJI.jpeg",
      "alt": "PageSpeed Insights landing page"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/84/7d/847dcd3be78a82526d0092744b47558e/ZUKuUjChzbkUiABS-uTMJqXSnnD3INnU3TGbS7UpAVx7M0H1WpeOJpyS1_wM6RF9sI1B9bLrjQ06o02b0ABbBTt2Bs0aOuLWpWBwe1-v23ro6Y3YJ1fSWJv3_KXCSlbKR8dR60iwjPu7jVqq-ACwJQ0.jpeg",
      "alt": "PageSpeed Insights results page"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/semblog-next-static/banners/trial-gift.png",
      "alt": "Trial Semrush banner"
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&d=Mon%2C%2021%20Oct%202024%2014%3A24%3A46%20GMT&n=4d&b=Ecommerce%20Website%20Optimization%3A%2012%20Strategies%20to%20Increase%20Sales&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fecommerce-website-optimization%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&b=Ecommerce%20Website%20Optimization%3A%2012%20Strategies%20to%20Increase%20Sales&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fecommerce-website-optimization%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://bat.bing.com/action/0?ti=5128787&tm=gtm002&Ver=2&mid=bddb9be3-ad19-4629-95b6-7d2c706fea88&bo=1&sid=261ed1508fb811efba4e99f5951e6f6e&vid=261f1a208fb811efae422368dbcde7c5&vids=0&msclkid=N&uach=pv%3D14.0.0&pi=0&lg=en-US&sw=1920&sh=1080&sc=24&tl=Ecommerce%20Website%20Optimization%3A%2012%20Strategies%20to%20Increase%20Sales&p=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fecommerce-website-optimization%2F&r=&lt=879&mtp=10&evt=pageLoad&sv=1&cdb=ARoR&rn=371512",
      "alt": ""
    }
  ],
  "publication_date": null
}