{
  "url": "https://www.semrush.com/blog/ecommerce-website-audit/",
  "title": "How to Perform a Full Ecommerce Website Audit",
  "content": "Once your online store is up and running, you'll want to see how it performs in search results. You also need to know whether it's secure and user-friendly. And how it measures against the competition.\n\nYou can start with an ecommerce website audit. An audit can uncover valuable insights into your SEO performance and other factors affecting the user experience (UX). It's also an opportunity to determine what you do well and what you could do better.\n\nWhat Is an Ecommerce Website Audit?\n\nA website audit reviews your site's performance, functionality, and content. It’s like a health checkup for your blog, business website, or online store.\n\nSo, if you run an online shop, you'll conduct an ecommerce website audit. \n\nYou'll look at factors like:\n\nPage load speed\nMobile-friendliness\nWebsite navigation\nOrganic rankings \nKeyword usage\nContent quality\nInternal linking\nSecurity\nAccessibility\n\nThese aspects may impact your search engine rankings and the user experience. Analyzing them helps you spot potential issues and identify improvement opportunities.\n\nPro tip\n\nUse Semrush's Site Audit for a complete SEO analysis. Our tool can identify old security protocols, broken links, duplicate content, and other issues affecting your site—and show you how to fix them.\n\nWhy You Should Perform a Website Audit\n\nA website audit can uncover potential vulnerabilities, errors, and performance issues. It may also reveal opportunities to optimize your content, pages, and overall site structure for higher visibility in search results.\n\nThese insights can help you improve your SEO strategy and deliver a better user experience (UX). \n\nOther potential benefits include:\n\nDetect potential issues early on: Detect technical problems before they escalate. For example, you may realize a particular plugin or code is slowing down your site and causing visitors to leave.\nOptimize your conversion rates: In a 2022 survey, 37% of buyers said they would leave an ecommerce site that's difficult to navigate or has a poor layout. Another 33% would do the same if a website took too long to load. Regular audits allow you to identify and fix these issues to keep visitors on your site longer. This may result in a better user experience and increased sales.\nUncover growth opportunities: An ecommerce site audit can reveal your top-performing pages and user behavior trends and patterns. Use these insights to craft better content and personalize the customer experience.\nPrevent data breaches: The best SEO audit tools can uncover security issues that could lead to data breaches. Such vulnerabilities may include outdated plugins, malicious code, weak passwords, and old security protocols. \n\nJust like your car needs regular checkups, your website requires ongoing maintenance. From broken links to non-secure pages, many things could go wrong. \n\nYou can use the following checklist to work through a website audit. \n\nFurther reading: Website Health: A Guide to Optimal Online Performance\n\n5 Key Areas for an Ecommerce Website Audit\n\nA comprehensive audit isn't limited to website performance, security, and SEO. It also accounts for factors like UX and accessibility, which can directly impact sales.\n\nFor example, failure to meet accessibility standards can negatively affect the customer experience and lead to hefty fines. Over the years, several consumers sued Netflix, Amazon, DoorDash, and other top brands for being inaccessible to users with disabilities.\n\nThe same happened to Nike. Consumers accused it of using empty text links and failing to use alt text on its site. These blunders made its content inaccessible to screen readers.\n\nThis ecommerce website audit checklist covers your five main focus areas.\n\n1. Website Performance\n\nWebsite performance refers to page load speed and other factors that impact a site's functionality.\n\nIt also measures time to first byte (TTFB). This term describes how long a user's browser takes to get the first piece of information (byte) from a server after accessing a web page. \n\nA good TTFB is 0.8 seconds or less. The lower this number, the faster a web page will load. That means users will wait less time to see the content they want, which can improve their experience. And a better UX can contribute to higher search engine rankings. \n\nPage load speed and other web performance metrics can affect UX. They matter from an SEO perspective, too.\n\nAccording to Deloitte, even a 0.1-second improvement in site speed can boost conversions and cause retail consumers to spend around 10% more. It may also increase session duration, engagement rates, and page views. \n\nHow to Audit Your Website’s Performance \n\nTo check a website's performance, access Site Audit from your Semrush dashboard. You'll find it under \"SEO\" > \"ON PAGE & TECH SEO\" on the left side of the page.\n\nIf you’ve never created a project or audit in Semrush enter your domain name in the “Enter Domain” text box. Then, click “Start Audit.”\n\nIf you have created projects or site audits, click \"Create project\" on the right side of the page. \n\nEnter your domain name and click \"Create project.\" You will not see this screen if you’ve never created a project or site audit. \n\nSemrush will open a pop-up window with several options for setting up the tool. \n\nChoose whether you want to audit your entire website, a subdomain, or a subfolder. \n\nSelect a crawl source, such as your website or a sitemap. You can also limit the number of checked pages per audit. \n\nThe checkbox to “Send an email every time an audit is complete” is automatically checked. You can choose to uncheck this option if you don’t want periodic audit updates emailed to you. \n\nWhen finished, click \"Start Site Audit.\" Our tool will analyze your site and return the results within 24 hours.\n\nThe auditing process can take up to 24 hours, depending on site size and other factors. \n\nOnce the auditing process is complete, check out the \"Site Performance\" block in the Site Audit Dashboard’s “Thematic Reports” section. You'll see a performance score (0-100%). The higher the number, the better.\n\nClick \"View details\" for further insights.\n\nThe Site Audit tool will take you to a page where you can see your average page load speed and other performance issues, such as large page sizes and long redirect chains.\n\nClick \"Why and how to fix it\" next to each error on your dashboard. Semrush will detail how that issue affects your website's performance. And what to do about it.\n\nThe tool may also issue warnings. These are less severe performance issues, but you should still address them at some point.\n\nCheck the \"Avg. Page (HTML) Load Speed\" section. Here, you’ll see the average load time for your site’s pages.\n\nIn the above example, the average page loading time is 0.58 seconds. That's good, considering Deloitte's recommended page load time is one second or less.\n\nAddress other performance issues Semrush's Site Audit tool flags as they arise. See our guide to improving page speed for further recommendations. \n\nPro tip\n\nCheck your website’s speed on desktop and mobile devices with Google PageSpeed Insights. This free tool generates a 0 to 100 performance score, with the highest values (90 to 100) indicating a fast-loading site. Combine Google PageSpeed Insights and the Site Audit tool to monitor, analyze, and improve your page loading time.\n\n2. User Experience (UX)\n\nUX is how users feel when interacting with a website, product, or service.\n\nFor example, a Baymard Institute survey of 1,012 U.S. consumers in 2024 looked at the most common reasons for cart abandonment. Of the respondents, 17% said they abandoned their shopping carts over the past three months because the website had errors or crashed.\n\nAnother 22% of respondents said they left without buying because the checkout process was too long or complicated.\n\nEnsure your website delivers a seamless shopping experience. Otherwise, you could miss out on potential customers and sales.\n\nUX and SEO go hand in hand. Optimizing your pages for search engines can improve the user experience. But first, you must audit your site to identify usability issues and other problems affecting the customer journey.\n\nHow to Perform a UX Audit\n\nA UX audit involves collecting and analyzing qualitative (e.g., customer feedback) and quantitative data. The latter may include:\n\nOrganic traffic: The number of users who arrive on your website from organic (unpaid) search results\nClick-through rate (CTR): The percentage of users who click on a link divided by the number of visitors who saw the link\nBounce rate: The percentage of sessions that last 10 seconds or less, don’t trigger any key event (e.g., clicking a button), or include fewer than two page views or screen views\nDwell time: How long someone spends on a web page from the moment they click on it in search engine results until they leave it and return to the search results\nSession duration: The amount of time a user spends on your website during a single visit\nPage views: The number of times users have loaded a web page in a browser\nConversion rate: The percentage of visitors who took the desired action (e.g., buying a product)\n\nFor example, the average bounce rate across most industries was 44.82% in August 2023, according to a Databox report. If your numbers are significantly higher, you may need to revamp your website design and other factors affecting UX.\n\nYou can track these metrics with Semrush’s Organic Traffic Insights or a combination of Google Analytics 4 (GA4) and Google Search Console (GSC).\n\nGA4 and GSC are web analytics tools. Organic Traffic Insights lets you view data from Semrush and both Google tools on a single dashboard. Simply connect Organic Traffic Insights with your Google accounts. \n\nOur tool will show you where your visitors come from and how long they spend on your site. It can also measure your conversion rate, bounce rate, average engagement time, and other valuable metrics.\n\nLeverage this data to see where you stand against the competition and identify UX friction points.\n\nLet’s say you check your site with the Organic Traffic Insights tool and realize most users are leaving a particular page. Use Semrush's Site Audit tool to check for potential technical issues. \n\nIf everything looks right, review the page copy and design. Make changes as needed. You may also conduct A/B testing to compare two versions of the page. \n\nFor instance, one version could have a different title, copy, or lead image. Change only one element (e.g., page title) at a time and test the new version against the original version to see which performs better. \n\nWith this approach, you’ll know exactly what element impacted the results.\n\nPro tip\n\nThe best time to conduct a UX audit is after launching your ecommerce business or whenever you experience a significant drop in conversions, traffic, or user engagement. It's also a good idea to audit your website before and after launching new features.\n\n3. Technical & On-Page SEO\n\nTechnical SEO improves your website's structure and code to help boost its visibility in search results.\n\nOn-page SEO involves optimizing your copy, internal links, and other on-page elements.\n\nA technical and on-page SEO audit can help you identify broken external links, missing alt attributes, pages with low word count, and more. These issues can affect your search engine rankings and conversion rates if left unaddressed.\n\nFor instance, broken links—whether internal or external—can negatively impact UX. These hyperlinks point to pages that no longer exist.\n\nWhen users encounter broken links, the server returns a 4xx status code, such as a 404 error. Here's an example from Lego:\n\nVisitors cannot access the content they seek. This can lead to frustration, high bounce rates, and missed sales.\n\nHow to Perform a Technical and On-Page SEO Audit\n\nUse the Site Audit tool to review technical aspects and on-page elements potentially hindering your SEO efforts.\n\nFind and Fix Website Issues\n\nwith the Site Audit Tool\n\nSign up Now →\n\nLet's say you want to start with a technical audit. Log in to your Semrush account, select the Site Audit tool, and set up a project (as described earlier in this guide).\n\nNext, click \"Issues\" in the top navigation menu.\n\nCheck the list for any technical errors, such as:\n\nBroken links\n4xx status codes\nXML sitemap errors\nBroken internal JavaScript and CSS files\nSitemap.xml not found\nLinks with no anchor text\nInvalid structured data items\n\nYou can scroll down the page and find a list of warnings and notices. These are less severe issues, but you should still fix them for optimal search performance.\n\nClick on an error, warning, or notice to see which pages or website elements require attention.\n\nNext, click \"Why and how to fix it\" to get more information.\n\nMoving forward, follow our recommendations to solve these technical issues.\n\nYou can also use our ecommerce website audit tool for on-page SEO audits. Check your site for on-page errors, such as:\n\nMissing or duplicate title tags\nPages with too many links\nPages with missing meta descriptions\nPages with a low text-HTML ratio\n\nIn the example below, the website has 50 pages with missing meta descriptions.\n\nA meta description is a text snippet that summarizes a web page's content. Its role is to summarize a webpage for users and search engines.\n\nIf you see this error, click on it. Semrush will list the pages where you should add meta descriptions.\n\nPro tip\n\nUse Semrush's On-Page SEO Checker for your ecommerce audit. This tool will analyze your pages and generate a list of optimization ideas. For example, it may recommend expanding your blog posts, writing in a less formal language, or improving your backlink profile. Backlinks are incoming links from other websites. They can contribute to higher search engine rankings. \n\nGet Optimization Ideas\n\nwith the On Page SEO Checker\n\nSign up Now →\n4. Accessibility\n\nWeb accessibility involves making your site usable to everyone, including consumers with disabilities.\n\nCenters for Disease Control and Prevention reports 27% of U.S. adults have some sort of disability. For example, 6.1% live with deafness or have difficulty hearing. Another 4.8% are blind or have vision problems.\n\nThese people could be potential customers. But you risk losing sales and revenue if they can't access your web pages, blog posts, and product descriptions. Your reputation may suffer, too.\n\nA 2024 study of one million homepages detected 56,791,260accessibility errors, from missing alt text to empty buttons. Here’s what the researchers found:\n\n81% of homepages had low-contrast text\n54.5% were missing image alt text\n44.6% had empty links\n48.6% didn’t have form input labels\n37.9% skipped heading levels (e.g., jumping from H2 to H4)\n28.2% had empty buttons\n13.2% used ambiguous anchor text (the clickable text in a link)\n\nImage alt text, for instance, describes the content of a picture for screen readers.\n\nYour product images may not be accessible to visually impaired users if they lack alt text. This can result in higher bounce rates, lost revenue, and dissatisfied customers.\n\nHow to Run an Accessibility Audit\n\nWeb accessibility audits help you identify the issues listed above, such as missing alt text and improper heading tags.\n\nHeading tags range from H1 to H6. The H1 tag is the main title of a web page. These elements can improve website navigation and make your content accessible to screen readers.\n\nCheck your site with Semrush's Site Audit tool. Again, head to your dashboard and click \"Issues\" from the top navigation menu.\n\nNext, look for accessibility issues like:\n\nMissing title tags\nMissing H1 tags\nMissing anchor text \nLinks with non-descriptive anchor text\nPages with more than one H1 tag\nPages without meta descriptions\nImages without ALT text\n\nYou can click on each error, warning, or notice to see what you need to change. For example, if some of your pages don't have a title tag, manually add these elements.\n\nIf you use WordPress for your online business, install Yoast SEO, Rank Math, or the All in One SEO (AIOSEO) plugin. Enter the desired title tag (H1) into the designated plugin field for each page you want to optimize.\n\nWordPress and other content management systems allow you to type the title tag in the text editor. Here’s what the H1 tag looks like:\n\nAlso, optimize your videos, product categories, buttons, and copy.\n\nFor example, add captions to videos. Captions ensure your content is accessible to users with hearing impairments.\n\nUse descriptive and meaningful anchor text if your blog posts link to product categories or individual products. This text helps search engine bots understand your site structure and provides context to people using screen readers. \n\nDon't just say, \"Click here to find out more.\" A better option is \"Browse our selection of winter jackets\" or \"This winter jacket was designed to [...].\"\n\nFor further insights, see our guide on how to check website accessibility in 2024. \n\n5. Security\n\nWeb security helps safeguard your website against cyberattacks. \n\nBaymard Institute reports 25% of 1,012 online shoppers surveyed in 2024 abandoned their carts over the past three months. \n\nWhy? \n\nBecause they felt uncomfortable sharing their credit card information with the vendor.\n\nCart abandonment and lost sales are only part of the problem. A poorly secured website is also vulnerable to data breaches and other cyber threats that could:\n\nErode customer trust\nCompromise customers' data\nResult in lawsuits and hefty fines\nDamage your reputation\nLead to revenue loss and bankruptcy\nAffect your SEO and marketing efforts \n\nA 2023 IBM report states data breaches cost companies with fewer than 500 employees an average of $3.31 million. Unsurprisingly, many small business owners never recover from a cyberattack.\n\nHow to Perform a Website Security Audit\n\nWebsite security audits help detect potential vulnerabilities cybercriminals could exploit. These may include but are not limited to:\n\nMissing HTTPS (hypertext transfer protocol secure)\nExpired SSL (Secure Sockets Layer) certificates\nOutdated themes or plugins\nImproperly configured permissions\nInactive user accounts\nWeak passwords\n\nFor example, HTTPS encrypts data transferred between websites and browsers.\n\nHTTPS tells consumers your site is secure and can help with SEO. HTTPS is a confirmed ranking signal and can impact your website’s position in search results.\n\nTo start the audit, access your Semrush dashboard and click “Site Audit\" from the left-side menu. Next, click \"Issues\" from the top navigation bar. Then, select \"Security & HTTPS\" from the drop-down menu under \"Category.\"\n\nOur tool will display your site's most critical security errors and a list of warnings and notices.\n\nClick on each error, warning, or notice to see which areas of your site were compromised. You can also click \"Why and how to fix it\" to better understand the problem you're dealing with and how to solve it.\n\nRun a security scan with Sucuri SiteCheck, Metasploit, or the Website Vulnerability Scanner from Pentest Tools for additional insights.\n\nSucuri SiteCheck is easier to use but more basic than the Website Vulnerability Scanner and Metasploit. It shows whether or not your site is blacklisted and can detect common issues, like:\n\nInternal server errors\nInjected spam\nMalware\nMissing security headers\nMissing firewalls\n\nUse these findings to determine the steps needed to secure your site.\n\nFor example, you could redirect HTTP to HTTPS and set up multifactor authentication (MFA) to add an extra layer of security. Be sure to remove inactive customer accounts, which could become entry points for hackers.\n\nFurther reading: What Is HTTPS & How Does It Work? [Explained]\n\nAudit Your Website with Semrush for Actionable Insights\n\nAn ecommerce website audit can uncover critical aspects of your site's performance, security, and other key areas. Depending on the tools used, it may also reveal source code vulnerabilities, content gaps, or accessibility issues.\n\nSemrush's Site Audit covers all these aspects, offering actionable insights and recommendations. It also serves as an ecommerce website audit template by pinpointing the areas you should focus on.\n\nInstead of using one tool for technical SEO audits, another tool for content audits, and so on, register for a free Semrush account to get everything you need in one place. The Site Audit tool can perform over 140 on-page and technical SEO checks. It also helps you make sense of the data.\n\nAccess 55+ Tools\n\nwith a Free Semrush Account\n\nSign up Now →",
  "headers": {
    "h1": "How to Perform a Full Ecommerce Website Audit",
    "h2": [
      "What Is an Ecommerce Website Audit?",
      "Why You Should Perform a Website Audit",
      "5 Key Areas for an Ecommerce Website Audit",
      "Audit Your Website with Semrush for Actionable Insights"
    ]
  },
  "images": [
    {
      "src": "https://static.semrush.com/blog/uploads/media/3a/9e/3a9e7c1abf1c08cf95777cf5569b628e/920b1d9083b20c6c3f98740c4b5c4419/ecommerce-website-audit.svg",
      "alt": "Ecommerce Website Audit"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/1a/37/1a37f1fc2bfadbfb1714aae733c62a17/1a080febd527fbc5bcaa4213efe49f5f/N1jA3lVZQvyJrgkrzbB6Ytukela6lb4UV5owp0yr-XDz7HyPBhfyh8rbj9tpPXL5dsMOLagHS6NPXxkqZs9V6bv8XerZWQ3yp97q9IbhfUBb72o2e64Bzuxg7slyDRcLgpu6zkuHAKJJtbpz5q0W38g.png",
      "alt": "step by step website audit checklist includes identifying type of website audit, accessing relevant auditing tool, configuring the audit, running the audit, prioritizing issues, then assign and schedule fixes"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/15/94/159417b543114be7af9867ff47c7dee8/bb046d9b1a19e3931cd7736429f60ac5/1sJYJZxyDKkRaodnTbLwxBnHdk5mtQXGAbeS09EG79qX6mw1SG6MHoRovVWMnrmiS1L4qVYM2x7mS_hYnjoIbvdhhEDB_vjZ9n8IlF5Fu9VQHRQtokycLO_WxikcdSyM-kMK5NsjksmdC5_RcyfReDg.png",
      "alt": "Site Audit tool highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/40/7a/407a39a5f9c5d2eb4f6703159c972aa2/61ec328bf3aedd9ff28e06e2e70582b9/dzQBPXiUx4BwdYYS_QkVV5yTdT6CnT7Vr3FaQv-yGJyDPhSpgwbwQtZfb3ULNRcXqeL3tVg8gE_7leXcWkI0CFO0vV0ElrhoCKtYcgQcS-qYd3HtrsP2nyg3UnzEGeZ07SWRSGxWz2-vHXoIjDvnyXk.png",
      "alt": "yourdomain.com entered into Site Audit tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/2d/48/2d481d28cfa207a00daafe61e19370b0/1a569efe500eb6e62b7f08c11ddebc8b/3LcYwu-fnNu8DMuOtDJSNxrJbyX8ppmpoHLAIkDZF_cY3DQxJxpu_Eya7mAGFXwl0KlGzqdYUWZt0AXV3zblqbBLHdbbgtvc_dWS6WDeNgNVGpmvvhOTQAZB-QkeDEcG0QlUEnXoeBzwti-vRhC9SEE.png",
      "alt": "create project button highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/51/72/51723ac7c4dfd609e99f9ecab31c8765/aabca95eefb3a9a52bd1661709036ec5/1XgjluJjMtoLcbHY9kXqWQweE0hi5eADTtRcaDYbxP-eJMbzaPSqfzMHYtZ8dHGXfM_5XQkS6LNy3dFUjW-fmQma4oG7vb-S-kDQRtM_322oqRPAh7ncpji9fmig2jOmtbilwMMW8pYe7KX7VWgKsQU.png",
      "alt": "domain entered into project field"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/26/11/2611c36988fc98699b6de8ee16d16998/508a3be0841a8e701709eab164d166b2/4oPSZbDw8-4eXU7IW5QZVh_9U30ywhLOJjwGCT0McXuAroPzbaE5qe9xcsQ-hMhk5vtggFjCIB0eZ3Ajb1KeMoW3yD78F2F_yZk_X2_MKLVo_NPZWG7ziFP_FmltwESQ3TzFodyRgrQgqGF7ZwcvicA.png",
      "alt": "site audit settings popup with crawl scope, number of checked pages, and crawl source"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/b7/6a/b76ad3a4ae7a363eecefccfa7e13d225/da8422d91daa0f0832125ac454834c6c/8PN2pIpUSxK9vkHXdZ_mCqwOKhRqJ1QUTNYCCjq0lp6XMDiATFVXco3RJRQb5n0Ozy9b2MU6X372n49bEsoOVZbk9pdMe2O_BXyKI4imoO0O8OL7CPZlkQRaPJIaLYNXsaKSAgMhtj_nyZo8keE6fjk.png",
      "alt": "site audit dashboard with site performance report option highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/bb/5e/bb5ee4e792ba29cb4be1e299cd370ef4/21c66bf3ff9eb609902c64182159e0e4/DCzfueuJtVEPVXn2Wqn-j50b43VyiJ375ofxOUSWP3ZUvJ8EM-_MFDMwTI6Zi7-GPNrDejWNDjp-F_ABg4MOvU3-jPHV4sD5eksC2d7PVaX4vLUs6rAOmGr1ioT9FlzVEkBPmVq6imIgYtkvK_TyD_0.png",
      "alt": "average page load speed widget and performance issues highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/78/f1/78f19f7b9dc815342b92033af77caad2/e8f31ae29e19e649f493fa70a2cc860c/Scunzpyl-uOmG3YJUt8U1MiYk4daH-nrQl3iPPNKMUBbFkpKsVYyqHnjD9Jpu4De826c5CbYBwEQhPyjTb_aG-DxGqAaWTcxKv0GXz-qxxhvgwW2Yb0uL8woLTgGAdq4iuCFJzuHhAwGTucnfnRl_6k.png",
      "alt": "why and how to fix it button explains slow page load speed issues and how to fix it"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/80/22/80228f1afad263b2c06e773009a84ec8/9c990c9b99b7ddf180569f31d1a04cd5/4e5LTBCJaSozlc3wMDoiQV-BUlO0uBbyvwobd62SYJ6ka4VUOCLQ0wzMySqfPb8bQIki9DhuVh5RcdSyFoy-C27LPAaqRauCzrW2n_JBOOKyv54zXw_y2NHiXDr_oKT6O-nQXjWIbZNu5Ao4uHeh0lE.png",
      "alt": "site performance warnings highlighted, such as uncompressed pages, uncached files, and unminified files"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/0a/fd/0afd7a83a6cbfacae5c01dcfe06bde23/2a08c829dfc3b2924b926b47827999b2/55rKn62RLfsouVd6aVySE5hRX_zIEYltzpOG4GcrFshyoEC69PS_i30D-G88-AIoDFsXizs3M2PLeFCbS8Zp0ztIjIUqr3yWSVatfc7R2iTBML2hehBgK_VntvHGkkfrE63Dc-kohLkAIn0W9wRgbG0.png",
      "alt": "average page load speed is .12 sec for this domain"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e5/84/e5845d291ca9c860e6ef953aaf92e6ac/4e8f2fb3a37a4fc30879ae49a3147523/xIsfgiNDwqbFoPYs8QpvPUD-8jzweP3xqIpEvBo2HF1IN11I6_2vyXBWLO8dIfOZr3p97w5SCRr2o5Y88Fjxwgp-rZidMF4zOq3g4LHClMWcuenemNjRQdc64hbHJ0qQCQ8sHnKvOaP8voNoQMuNTgE.png",
      "alt": "organic traffic insights tool dashboard"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/34/47/34478dc80576194d4ad34c568f278f7e/29680ed7b8dfbc931a7d1f3786355d89/iN-J2CPCtneu7UJFvzjbLKkuSHxDqZx3s7HaV__z-TULAePdHpF0MmjCpGklEGGosNZ3JpQ--TrPC1eu13nDBpd2ATxbxRtTldB5OaF33S2vdxeOLnkCTQ8LXUxdchYR7McXVkcrpUSpyj4mFP1R6eY.jpeg",
      "alt": "Lego's 404 error page with lego man running with scared face"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/cb/c2/cbc2417e35babcd2184753e5169b0785/9dd2b388efca67276106ebd5fcf1df6f/vuiVrXpws1al4e6iPIt_CVqUTERtn0MEfYj49G_OvYOxrAt9PPEHn7Q73xD5yhN2uIHhiwM4j7-SKo6MNzkVMXlpx1nF2fq_NebhApeYeKhqjSB4Qx5yrrFwWNA0ONwtXCw-RfW-zFyYwqvx_Ch1HaQ.png",
      "alt": "issues tab in site audit tool highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e9/7c/e97ca909a7e739c646d1314b1e70179f/124b7fa76f8cb25a003b40e7254dd6d2/bduEsvjsW7aVTe6jSAVxwxxq1fOqS7L4DjE6Ea4ZM3B2guvF-wqUSkxpWBGTxnAK4GGF2kLqzKHfr47g31ETy4ca9Mpm0LsyiGU1tU898jOnf3Y56MS6aYa2ph5V7nleqtzAIXf2EKegxhektF1a3Ps.png",
      "alt": "warnings list in site audit tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/d3/76/d376a752b1bc0b8ab4f9790fa4cb9487/5a7df580a94e830c6b529f3ed9e1591a/ROQAUABNMsUUN1fNtQ_LZ59LzykxcUdz_0YOzP9z3eMkGgOTWsIXPNvxnM9e5JMF6ipB6VyhEbYpXuA1GFklJ_lBG3HfbpkBbA9-nUAgpg9_kYt4ajWkp3up_kQyFY6brpGEKWxSjHoMF5zzICUDjD8.png",
      "alt": "30 pages listed with issue of 'structured data items are invalid'"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/5c/49/5c49362bc0687bad8228b29cf0c34366/80b801a3c096dd34d6b86c550f0e850d/v8T-TLzp3_xps-vBo3EtkWpx-mYMqACPTedBVT8j-1ycLlc2Qtjou8RUlZbD7tkq8_IkXQ582wfpi9gCZQ_uGwyptq9GE4aQ-KqlmTy6CbM6TqRse9V1OAGhlKM1FilTSL13qURcGU823W6AqqQThYA.png",
      "alt": "why and how to fix it link expanded to show more about the issue and how to fix it"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/a3/30/a330d0e6d18295aeafeeb756c19c023b/40c9d2df3931a76faa88877084b9771a/XjctmmWfV023lOsPfmFm3aFvndC-_8WT0usbGeVOwXrthC3BJkK-ylWHOu8acF43cHelN5GBd0octoANmpqUIPZHW25sPrM63fvlFp9gwS75gDgQ0Y6rbcuQ_3YT2MU7FZ1rvq7yHxdEB3YIXm50hno.png",
      "alt": "warning highlighted in the issues report"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/95/71/9571a3ffff5b324995cb887ae281e4dc/9e27c79c9542c6025c21772f1606b7f2/SZs9BNpqIDEaLCJ9Kd5AOIP5MLF0yjR7bCfVsBWnt3oH_eA8RymH8Ib9fRc4u_jgV_C_-Yhskah-2oGjpbu74TNMybuLcdCo9kar-PQH6vlFE0GY_tluUYt72w2BjrXd2KsKmjLp_BAdybrOFdX1kVE.png",
      "alt": "page urls of those without meta descriptions"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/d6/f4/d6f4303940f7cf1735f7426c87676217/39f1c66d9bf9c3b9f94b82c1a461b084/p5EzFmFnoG4vJmVcmJQMcemOM_1jyulrfiRe5w5u_arpQW5uYYQGogpnAt2MkK2w3QxqNoHm8Qia9zxlONzE2GrT6xK6S4fyl5r-2rnMx6fLedh4I22zi4KU5Cq3IBx2tOPN2IA9EOAlVfu3AxGPpPM.png",
      "alt": "site audit tool issues list"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/2c/cd/2ccdae54c1375659e41e2d949eee8715/edfb39e03a09272816a8eb969264520f/iZxrKRV8wgmG_2csCJvcnmPWbldNZ-5I3tl9JXgGtzbJh4zzrms4DVSkbNBdjoazPEP1Fr3p2Pv-Q5E6_oUN989PhfGnPqTQ7cubt-weIt-fVUanGaWgNGXphiBC1DV_9ex_KyTu3iGZuAn3HKd5SIw.png",
      "alt": "8 pages don't have title tags error"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/0a/41/0a41c91368c0000fd134a31b03740a73/53a190bedbf89d68b8cf3571c1386c0e/w452lhfM2PssYW9zFH869ycLLyt3_y-d2ZmgXgIMdPMbF8iWIOvwNi3WYycykhC7eNNlXkwnurexqRvKR-_iU2T7OhtvORxFcodrue3W_E9MjJoPhIVZ89kHrDnB61DPdZXAzfHKZtbWF_fceQAhrcM.png",
      "alt": "on the left is html code for the h1 tag and on the right is how the h1 tag appears on the webpage as seen by a user"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/85/5b/855b96919a37eaf68a6cdfe294468dc0/6456dc74b338cfb946c5a7d8de58a085/N9zsiTmPT4sYAjz-v1smlIoksb6uDEsFHUVslUnKOekmhhjY7_7I_ybsgKs28W-X10JYs5HzlhLRJBdCv0sGngopcsaBYE6_XVTJmLK-taMVJyeX8B5mIcsH7jvuxajyvMvKbDLVs2ilzD4AHE7q9ws.png",
      "alt": "Category filter in site audit with security & https option highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/6a/71/6a712b618756d9ab163f6c83077a3bbf/e5cbe2b7e13ca76cef2f0b9f22cf7b75/go6o24RkxyCs1nUrkN6OBLzIctkY5DHPv6Lvv5NB-z9wvB8MJZB89Mn-Chxj_3qmCeXsZd6jnStif34XuX21uCbGszE5HEWQvRr59FSz2HerzZ70Ut-ud3rVthuuuDhtfaHOZaLYW9EYq1pwuvdxZHs.png",
      "alt": "security and https issues list"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/d4/fa/d4fae1b7fa7e3a6c3b2dc171b318487e/abcc78c8cea595165ee0f8593d3f811a/KM5KiXEDV_zQjgAHItedV11tbts1nlPdj8ALMSx_OW0R0taWplTXdsN3DnP5nqtSzsbqtL3n9yPsn41vcQ_4bxS-xD2fjRuPrs2vVrgX2HHnptk8b0Cx9FjNxwa9GqxUGIKv6J4JCzuoJlljOkGFVBE.png",
      "alt": "pop up shows more about the https issue and how to fix it"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&d=Mon%2C%2021%20Oct%202024%2014%3A09%3A57%20GMT&n=4d&b=How%20to%20Perform%20a%20Full%20Ecommerce%20Website%20Audit&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fecommerce-website-audit%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&b=How%20to%20Perform%20a%20Full%20Ecommerce%20Website%20Audit&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fecommerce-website-audit%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://bat.bing.com/action/0?ti=5128787&tm=gtm002&Ver=2&mid=6622948a-c7e7-4ef6-8041-5ee9dbd0b557&bo=1&sid=22686d408fb611ef811d7faedf58f631&vid=22713d808fb611efb055ede466cb64e2&vids=0&msclkid=N&uach=pv%3D10.0.0&pi=0&lg=en-US&sw=1536&sh=864&sc=24&tl=How%20to%20Perform%20a%20Full%20Ecommerce%20Website%20Audit&p=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fecommerce-website-audit%2F&r=&lt=1149&evt=pageLoad&sv=1&cdb=ARoR&rn=588013",
      "alt": ""
    }
  ],
  "publication_date": null
}