{
  "url": "https://www.semrush.com/blog/ecommerce-architecture/",
  "title": "Ecommerce Architecture: Definition, Importance, & Best Practices",
  "content": "Online store visitors are expecting quick and seamless shopping experiences.\n\nPages need to load fast. Checkout processes must be efficient. And products are expected to arrive in a matter of days.\n\nDelivering on these expectations can be challenging. But a strong technical foundation and optimized ecommerce architecture make it possible to satisfy shoppers and grow your business.\n\nWhat Is Ecommerce Architecture? \n\nEcommerce architecture refers to the way brands structure various technical components of their ecommerce systems. And how these components interact with each other.\n\nThese components may include product pages, mobile apps, payment processing, databases, and other frontend and backend functions. \n\nTypes of Ecommerce Architecture \n\nEcommerce architecture components can be organized in various ways. There are simpler setups—like monolithic or two-tier—more suited to brands that have limited ecommerce needs. There is less code to maintain, so it’s cheaper and easier to work with.\n\nBut brands with more demanding ecommerce needs may opt for microservice, three-tier, and other complex ecommerce structure setups. These offer more functionality. But they can also be costly and more difficult to maintain.\n\nLet’s cover some of the most important ecommerce architectures.\n\nMonolithic Ecommerce Architecture\n\nMonolithic ecommerce architecture refers to the setup in which the user interface, business logic, and data access layers are combined in a single codebase.\n\nThis approach has several advantages:\n\nSimplicity: Easier to develop, deploy, and manage due to its single-tier structure\nReliability: Since all components are tightly integrated, issues can be more predictable and managed uniformly\n\nBut there are also several disadvantages:\n\nScalability issues: It can be difficult to scale a specific part of the application without scaling the entire system\nRigidity: Making changes can be risky and time-consuming, affecting the entire system\n\nSmaller brands may particularly prefer a monolithic architecture. A small retailer, for instance, may choose this easy-to-maintain architecture if it has no plans to scale its limited product and customer base. \n\nMicroservice Ecommerce Architecture\n\nMicroservice architecture is a setup in which various ecommerce systems and business functions (i.e., inventory management) operate independently. They talk to each other through application programming interfaces (APIs). \n\nMicroservice structure offers a few advantages:\n\nScalability: Services can be scaled independently based on demand for specific features\nFlexibility: Easier to update and maintain since changes to one service don’t directly impact others\n\n But there are also some challenges:\n\nComplexity: Requires sophisticated coordination and management of various services\nResource-intensive: Each microservice might need separate databases and other resources, which can increase overhead\n\nLarge electronic retailers, for instance, may use microservice architecture to manage diverse product categories. This setup enables them to scale particular categories, like mobile devices, without impacting other home appliances or personal computers categories.\n\nTwo-Tier Ecommerce Architecture \n\nTwo-tier architecture contains two main layers:\n\nThe interface layer: The user interface that’s usually in the form of a website or mobile app\nThe data layer: Servers where all the data storage, processing, and retrieval is performed\n\nShoppers communicate directly with the server to retrieve data (like product prices and images) and perform business operations (like adding items to a cart). \n\nThis approach has several benefits:\n\nPerformance: Can enhance performance by distributing tasks between server and client\nEasily manageable: Simplifies server-side management by separating business logic from client interface\n\nBut there are also some drawbacks:\n\nLimited scalability: The client-server model can become a bottleneck if the user base grows significantly\nSecurity risks: More exposure points, as data has to travel between two distinct layers\n\nBoth smaller and larger brands may use two-tier ecommerce architecture. A boutique luxury shop, for example, may use this architecture to provide a rich client-side experience through an interactive website. And its robust backend server handles all business transactions and inventory management. \n\nThree-Tier Ecommerce Architecture \n\nIn three-tier architecture, an application layer is introduced between the interface and the data layers. This middle tier gathers and processes data, making changes to the data layer.\n\nThe application layer can perform more advanced functions. For example, it can track and save user payment, product, and shipping preferences. So that next time, users don’t have to enter payment or shipping methods and are served personalized product recommendations. \n\nThere are various benefits to the three-tier approach:\n\nScalability: Each layer can be scaled independently, enhancing overall application performance\nFlexibility: Easier to modify or replace individual tiers without affecting others\n\nAnd there are some drawbacks as well:\n\nComplexity: More complex to manage and maintain due to the increased number of components\nCost: Potentially higher operational costs due to more sophisticated infrastructure needs\n\nAn online bookstore, for instance, can adopt a three-tier architecture to manage user interactions, business processing, and data storage separately. This allows them to offer book recommendations on the client side, process transactions in the middle tier, and manage an inventory database.\n\nHeadless Ecommerce Architecture\n\nHeadless ecommerce architecture decouples the frontend layer (website or a mobile app) from the backend. Developers can then use any technology to build the frontend experience. And the communication with a standard backend is achieved through a headless API layer. \n\nThis approach offers several benefits:\n\nFlexibility: Enables the use of various frontends for different devices or platforms without modifying the backend\nEnhanced user experience: Allows for faster deployments and updates to the user interface without backend interference\n\nBut there are also some disadvantages:\n\nComplexity: Requires advanced development skills to manage separate systems effectively\nIntegration challenges: Integrating multiple frontends with a common backend can be complex\n\nHeadless approach may work well for some companies. For instance, a fashion retailer may opt for a headless architecture to provide a seamless shopping experience across mobile apps, desktop websites, and even wearable devices. And all of these experiences are managed through a single backend.\n\nSaaS Ecommerce Architecture\n\nSoftware as a Service (SaaS) ecommerce architecture is a web-based, out-of-the-box solution where ecommerce functionalities are managed by a third-party provider. The provider—Shopify, for example— is responsible for maintaining, hosting, and upgrading existing settings.\n\nThere are several benefits of this model:\n\nCost-effective: Reduces the need for initial capital investment in hardware and software\nMaintenance-free: The SaaS provider manages updates, security, and infrastructure\n\nThere are some drawbacks, too:\n\nLess control: Businesses have limited control over the platform and depend heavily on the provider\nCustomization limits: May offer limited customization options compared to other architectures\n\nThis architecture is especially attractive to startups. They can use a SaaS ecommerce platform to launch their online store quickly without the need for significant upfront investment in IT infrastructure. This allows them to focus on product development and marketing instead.\n\nBenefits of a Clear Ecommerce Website Architecture\n\nAn optimized ecommerce architecture is important because it benefits businesses in various ways.\n\nFor example, it delivers SEO benefits, including: \n\nImproved crawlability: A well-structured site structure allows search engine bots to easily crawl and index the entire site. New product pages then appear in search results faster.\nEnhanced site authority: Effective architecture helps distribute page authority throughout the site. Backlinks to the homepage or main category pages pass authority to subpages, helping them rank for more keywords.\n\nA clear ecommerce site architecture also provides user experience benefits. Such as:\n\nEase of navigation: Users find what they are looking for with minimal effort and enjoy a satisfying browsing experience \nImproved accessibility: A clear structure is easier to navigate using assistive technologies and thus more friendly to users with disabilities\n\nThere are also various marketing and sales benefits a clear ecommerce structure delivers:\n\nIncreased conversion rates: A clear path from landing pages to checkout reduces user frustration and abandonment rates, directly enhancing conversion rates and sales\nBetter customer retention: A site that is easy to navigate encourages customers to return, boosting retention rates\n\nAll of these and other benefits make it important to create and maintain an optimized ecommerce architecture.\n\nEcommerce Architecture Components\n\nEcommerce architecture can get fairly complex. Dozens, if not hundreds, of different ecommerce components interact with each other to deliver a seamless shopping experience. \n\nLet’s go over some of the most important components used to create the best architecture for an ecommerce site. \n\nFrontend Components\n\nThe frontend of an ecommerce site is what the customers interact with directly, such as a website or an app. It’s supposed to be user-friendly and visually appealing. This interface layer includes components like: \n\nMenu: A navigation tool that displays the various categories and services available on the website\nCategory pages: Webpages that aggregate products under specific categories\nProduct pages: Pages that provide details about each product, including descriptions, prices, and images\nAbout us page: A page that offers insights into the company’s history, mission, and values\nSearch bar: A feature that allows users to type in keywords to find products or information on the site quickly\nFooter: A section at the bottom of each page that typically includes links to important information such as contact details, FAQs, and policies\nCustomer reviews: Feedback from buyers about their product experiences\nPromotions and banners: Visual elements highlighting special offers, discounts, or new products to engage users\nMiddleware Components\n\nThis middleware layer serves as a bridge between the frontend and the backend. It may also be called the application layer, handling all the data flow and processing between the front and backends. It includes components like: \n\nShopping cart: A virtual cart that allows users to collect and adjust their intended purchases before checkout\nPayment gateway: A system that processes and secures payment information and transactions\nUser authentication: A security measure that verifies the identities of users logging into the platform\nInventory management: Software that tracks product availability and updates stock levels in real time\nAPIs: Tools that enable integration and communication between different software applications\nSession management: Technology that maintains a user's interactions across webpages for the duration of their visit\nAnalytics: Systems used to assess user behaviors and preferences to optimize the shopping experience\nSecurity protocols: Standards and technologies designed to protect the site and user data from cyber threats\nBackend Components \n\nThe backend layer consists of the database and server-side components that store and manage data. This server layer supports the frontend through smooth data management and service functionality. Key components include:\n\nDatabase management system: This software stores and organizes all essential data. Such as user profiles, product information, and transactions.\nOrder management system: Software that manages the processing and fulfillment of customer orders\nContent management system: Tools that allow non-technical administrators to update website content\nData backup systems: Technologies that save copies of the site’s data to prevent loss in case of a failure\nEmail services: Functions that automate sending emails related to marketing, confirmations, and support\nUser management systems: Controls that manage access levels and permissions for different users of the platform\nServer management system: Infrastructure that ensures the website operates smoothly, managing server resources effectively\nEcommerce Architecture Best Practices\n\nVarious ecommerce brands may have different needs from their site structure. \n\nFor instance, the U.S. ecommerce giant Amazon may prioritize the speed and scalability of their ecommerce architecture. While one-person ecommerce brands may value the ease of inventory management and shipping.\n\nBut there are certain ecommerce architecture best practices that nearly any company would benefit from implementing. \n\nChoose the Architecture Best Fit for Your Business Needs\n\nYour ecommerce architecture should be able to follow your evolving business needs. \n\nHere are several factors to consider to arrive at the right ecommerce structure:\n\nTraffic growth: Consider the size of your online store now and how big it might get. If you are going after a large audience and expect high traffic volume, then your ecommerce setup should be able to accommodate such growth. Scalable microservices architecture could be one option to consider.\nProduct variety: You may have only a few products now but plan to add many more in the future. If so, your site structure should make it easy to scale your offering by adding new products, pages, and features. In this instance, going after features-friendly, three-tier architecture could be a viable option.\nBudget constraints: Your budget dictates the type of ecommerce architecture you can build and maintain. You may like certain architectures. But if they are out of your budget, it’s better to compromise with less sophisticated but reliable alternatives such as monolithic architecture. \nTechnical resources: If you have an in-house IT team, you may feel confident deploying a more customizable and complex ecommerce structure (like a microservices structure). Otherwise, deploying a user-friendly but less flexible platform with the help of third-party developers might be a less risky option. \nMap Out Your Ecommerce Structure \n\nIf you’re preparing to build or revamp your ecommerce structure, take some time to map out your desired architecture first. Don’t jump directly into building it. \n\nMap your architecture either electronically or by hand. Include all the pages you plan to build, like product pages or the contact page. And visualize how they all link to each other. Add notes on which features and components different pages will have.\n\nThis exercise helps you understand what the typical shopper journey on your site will look like. And whether it’s too complicated.\n\nMapping out your ecommerce architecture in advance also helps you avoid costly redesigns. Because you already know the site structure. And which technologies, integrations, and frameworks you will deploy. \n\nDevelop an Intuitive Website Navigation \n\nAn ecommerce site navigation should be intuitive and logical. Category, subcategory, and product pages should be labeled with familiar terms, not industry jargon. \n\nFor instance, here’s how Etsy labels its product categories. All of these terms are easy to understand and you instantly know what to expect. \n\nAnd when you open a subcategory, Etsy already displays all the information you may need to decide if you want to purchase a product. You can get from a homepage to a checkout page intuitively in just three clicks.\n\nThere are several other ways to create an intuitive website navigation: \n\nKeep essential links like “Home” or “Products” accessible from any page\nUse consistent design across different types of pages for a cohesive experience\nA search bar should be placed at the top of each page\nUse breadcrumb navigation to inform users of their location on the website\nSimplify the navigation for mobile shoppers using solutions like hamburger menus\n\nHere’s what a hamburger menu looks like in practice:\n\nEnable users to find what they want quickly, and they are more likely to make a purchase.\n\nMake Your Ecommerce Structure Mobile-Friendly\n\nYour ecommerce architecture’s components should be optimized for mobile users. Here are several tactics to achieve that goal:\n\nUse a responsive design that adjusts the layout based on the device's screen size\nKeep the menu items limited to essential categories to avoid overcrowding\nUse optimized images with smaller file sizes that look good and load quickly\nUse larger button sizes, easy-to-select links, and adequate spacing to prevent accidental clicks\nMinimize the use of heavy scripts and animations to optimize site speed\nStreamline the checkout for mobile users by requiring fewer steps to make a purchase\n\nThe Chinese ecommerce behemoth AliExpress is a great ecommerce architecture example. Its desktop and mobile versions are different.\n\nIts desktop version, for instance, has 24 distinct product categories.\n\nBut on its mobile version, the company only lists the nine most popular categories on its homepage.\n\nLess clutter on mobile versions helps visitors find their way to a desired product.\n\nMaking your ecommerce architecture design mobile-friendly can go a long way in helping visitors enjoy your site. And, eventually, convincing them to purchase one or more products.\n\nOptimize Your Ecommerce Architecture for SEO\n\nThere are several ways to optimize your category and product pages to help drive organic traffic.\n\nFor starters, your homepage should link to category pages. Then, category pages should link to their respective individual product pages. \n\nLike this:\n\nThis helps pass page authority from the homepage to other pages. And in return, those pages may end up ranking higher for their target keywords. \n\nYou should also link to your product pages from your blog posts. This and other internal linking best practices helps your site become SEO-optimized and easier to navigate.\n\nYou should also identify various product-related keywords to name your category and product pages.\n\nUse Semrush’s Keyword Magic Tool to find relevant keywords that can help optimize your page titles and content for better search engine visibility.\n\nHere’s how:\n\nHead to the tool, type in your category name, and click “Search.” \n\nNext, you’ll get a list of various keywords that contain your category name. \n\nYou’ll see various data points for each keyword, including monthly search volume, search intent, keyword difficulty (KD%), and more.\n\nThe tool allows you to sort the list by any of these and other data points.\n\nThis provides you with specific keywords that your audience types in search engines. Use these same phrases when naming your product pages to help your site show up in search results. \n\nYou should also optimize each page. For example, include target keywords in main titles, headings, content, and URLs. \n\nFind Product-Related Ecommerce Keywords\n\nwith the Keyword Magic Tool\n\nTry for Free →\nContinuously Audit & Improve Your Ecommerce Website \n\nEcommerce websites continuously add and remove products and offerings. New pages are constantly being launched, and the site structure is ever-changing. \n\nIt’s important to monitor your site for any issues. For instance, checking that new pages are interlinked with other pages. So that Google crawlers can crawl and index every page on the site. Or that pages load fast with no security vulnerabilities. \n\nUse Semrush’s Site Audit tool to monitor your ecommerce website for any technical issues.\n\nHere’s how:\n\nOpen the tool, enter your domain, and click “Start Audit.” \n\nThen, configure your basic settings by specifying whether you want subdomains to be audited as well. Set the limit of checked pages and the crawl source. \n\nIf your ecommerce site is massive, you may want to schedule weekly or even daily audits. Set this in the “Schedule” tab. \n\nCheck the box “Send an email every time an audit is complete” to receive an email following an audit. Next, click “Start Site Audit.” \n\nOnce the audit is complete, navigate to the “Overview” report. This is a high-level view of your site’s overall health. \n\nFind your “Site Health” score in the upper left corner. The score is calculated based on the scale of errors and issues found on your ecommerce site. The higher the score, the better. \n\nHead to the “Issues” tab to find all the problems your site faces. \n\nStart solving “Errors” first, which are the issues of the highest severity. Then, move on to “Warnings.” “Notices” don’t affect the health score. \n\nClick “Why and how to fix it” to get additional information on how to address given issues. \n\nFind and Fix Ecommerce Website Issues\n\nwith the Site Audit Tool\n\nSign Up Now →\nFortify Your Ecommerce Architecture with Semrush\n\nEcommerce architecture continuously evolves as new technologies and features are rolled out. \n\nBeing mindful of the best practices in this field is important.\n\nOtherwise, brands risk being left behind by competitors with more user-friendly site structures.\n\nUse Semrush’s suite of tools to empower your ecommerce venture. The Keyword Magic Tool can help you identify relevant keywords, while Site Audit will help you monitor technical issues on your site. \n\nSign up for free today to get started.\n\nFortify Your Ecommerce Architecture\n\nwith a Free Semrush Account\n\nSign Up Now →",
  "headers": {
    "h1": "Ecommerce Architecture: Definition, Importance, & Best Practices",
    "h2": [
      "What Is Ecommerce Architecture? ",
      "Types of Ecommerce Architecture ",
      "Benefits of a Clear Ecommerce Website Architecture",
      "Ecommerce Architecture Components",
      "Ecommerce Architecture Best Practices",
      "Fortify Your Ecommerce Architecture with Semrush"
    ]
  },
  "images": [
    {
      "src": "https://static.semrush.com/blog/uploads/media/f6/ac/f6aca3def70004f8f806e2a24d31a05b/1d966689d9db7b43cdf523ac68f69816/ecommerce-architecture.svg",
      "alt": "Ecommerce Architecture"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/78/8b/788b13b5ebefc3e8b8c783145d5f8e05/0b4670326c03c469684c731ae0b7a74c/AD_4nXdNzEl0TgK6X_hqlKAwMujLrIf7F2_RJT8ys0VVrwO3EY203x9y1pywAe-D5R_pkztEVw6ipA4p62xSyU-LLql8w19vwhSFT1TRxqKF0EO3KN6e4_pZWszhaDsI7KbQcZPRe0mPDXvlqQyiRFqHjLZOKS5w.png",
      "alt": "A conceptual diagram of monolithic ecommerce architecture, consisting of three main layers: the user interface layer, the business logic layer, and the data access layer."
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/cd/4b/cd4b18823344d72bbb149c8ac5a51f13/ea7740d9a4c34de4041f8192106cfb21/AD_4nXd90MzAUjboQjsW8S1H2yH9t7-nV-esKTyb61StpjGdeL9O_noInZI7KXKehm46yMaM5qRiu7a0eKDcubmd5opqpopmUBRmn5nJ5ZXIxU2H_Psvv_hk9q2HDjA1fnsipXKdmESQEeh8xBx78Thece5_f3k.png",
      "alt": "A detailed microservices ecommerce architecture consisting of four main columns: user interface layer, routing layer, microservices layer, and data storage."
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e6/13/e613b8c90f6333071b14157f601bbfa5/b12c3f8e4351edf34a486da25c81684d/AD_4nXf9nbHebB-CcBsJSW6KCUxaZOosluFlWF-gCGzUBOSEjgiQxWuz3Vf6y1qgdKxo_A5X9wQ5on5yfb5nj1IW1IByXiyOBYgCKHTirxWTkcuxlPFFgt3LbvTNYsMX27BiX-QUv_l4XxVpJujtAou3F1bE8x8.png",
      "alt": "A diagram of two-tier ecommerce architecture, featuring two primary layers: the interface layer and the data layer."
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/47/f0/47f0079a5de3c040a0b6b8ccf9ca7912/3d0cb6c9386c93eb108897a421a33392/AD_4nXdEC6WHgDenv8jOHNJmXFDP3Uy0j8AHpELro0919ybANWtxwEDy1aaOablGyj7mvyptovBUi1LHB-r3daMsN-R0R70XhaewZ7mM_9Ac7PF3Zk13Y89j40Ugf_3HM-2T-l_dQlvYlpjxnmhDhgNwj6ziEBqP.png",
      "alt": "A diagram of three-tier ecommerce architecture, featuring three primary layers: the interface layer, the application layer, and the data layer."
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/33/84/3384e172011ac5d8ac5288797237cecd/64c5e8e19d1c1ac9edb9c46dd2f4275f/AD_4nXflTFFc2VzLGe_Gj2CpmaSdZpSlbwDbNLqxyQfrFK_DcTSMa8ECOzS8K95yUm08e4LTewN3DcwVpCMvN32bAI_O_oZrdDdt4LOAFgUX5dN6jbK-iSNpuZDIukS-qRQjVRsskbtGdK2OkDcIsqT2_GPbFkNq.png",
      "alt": "A diagram of headless ecommerce architecture, featuring several layers: the front end layer, the headless API layer, and the backend layer."
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/24/d8/24d803574403bbd14e53e2f32c5e1649/3e6a282fa160341aae7fceb20748789b/AD_4nXduyDaRh49tv0WFywX4ez8sIOwsFQ3NSok0f_y5bMzacYDVMxSX2wiYzN0DaM4M2KkmoQFgRtQmnaSK2owVOp9KEL8BlnQUNboiNSJwleAzhMYwK0VNJq8d3hxLG6HQLBeaLUFQuKhyu2GBjkqEs_6UCPGZ.png",
      "alt": "A listicle graphic depicting various benefits of optimized ecommerce architecture."
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/09/cf/09cf2f8f2bbd3801b68bb4399d69eafe/2e08fbd6b6bf8bee68732f16c9edea35/AD_4nXf4YBKooi72EvPxZBao2b_QEgynl_gLApQmz4AGGsAQnjVGZzuw57z9TXPGhceUy6AbISemwBhkjWXQF3K1cNz6duqYz3odXDetuSAB1LDeDlYCtGuiLtpuLSHgqzrG-_55_brRkrU862PyKBVLsnNuaaA.png",
      "alt": "A listicle graphic depicting ecommerce architecture components grouped into front-end, back-end, and middleware."
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/97/83/97834b28c479a9e9e2c87924a057b49e/ffbc1a9d4d74fb8b769bcb7867224f9a/AD_4nXdfvTrLYeqz1Qytzjz3VVqHJwdSR7VYdF2PQG_gg62jE0V8u7ozHgtz_6QFsh5fTLPePNgTjcu15kkkT4lU4h8HOqOv12vjLvBr6AmZwzsxlYuPbU9J_UvIGsuiZdZHSvOd7-sG-JpQMgSG2YWxwN6ab3s.jpeg",
      "alt": "Easy-to-understand product categories on the \"Etsy\" website."
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/eb/60/eb60a192d4b8c8d049e3db3b9c357beb/7eb4a49c674cf6c1aa924d6d10a313e4/AD_4nXdDPCCbSEf2-Y_SBWFoOLSIl1XOjoXwLp25jFBNmbGTh2zIBvu0VKEhzPlFUrJP0K0Wz7JSeiYWx21DtxnQxt6Y4e_VJSm3ngKyzTm2cUlBROIijpWfQRfwNPl-3QjmDnws_7exvKqLP-lLc2izMM3zGvU.jpeg",
      "alt": "Product listings page on \"Etsy\" showing accessories along with their star rating, price, and manufacturer."
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/bf/f3/bff338b4eb47bf816ce315b8194ac71b/eda9d280f2ddb45e624445eb2a8f4971/AD_4nXfy_kHkGf5GGwxvLNJzMdy0jc8SLlr5RxqfJ8AoG1lJvHMq9AAKcRjAV_Sq-r4LBR0lYeUQg_7FxT5Ns66CABGI3215ZqGjYkgr8ULe2Q0ZLUwXxVog5QHc8aLslCFTIb6-_27m2adDp10jvbqxJOfc3hcg.jpeg",
      "alt": "A hamburger menu on the mobile version of an ecommerce website making navigation easier for shoppers."
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e1/51/e151c4aaac5f7261039d1a8b0d2f025b/c966e544bf90d207cc8f9ab2d4f1c1ac/AD_4nXdCCzw5mGX_rTyR69-_h7WFRV6WtaytlPDpACV4h9qCfKIQ9i-FNGFpdORoL8G8c_AB7r3B_y1ZobYh1tM94bvpSLKxtgsQJLUTYGvUxjqcPSTj7IdlbKQKSWFihTB2izaoFeFfptLNCjauOeazlat6q4Px.jpeg",
      "alt": "A complete list of 24 product categories on the desktop version of the \"AliExpress\" website."
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/06/44/0644b58108f12b133ef03284d579f9b8/996371bb8fd17ceb47e02903eb0afbbf/AD_4nXdEWIxgh5FpAwahp95VcbXkMq3V4otKuTPSkmcAZ87RCJ7KMR9sL3MncyUwuOWK9KV2D1cUGDEgpcwFwa7uJ1m95lVD9uGi48VYMsQYVsPNRs7MpnT8jqOJjB3NzvKPZEYNyv-LP9bG-pmom1Nb6-l26Ur4.jpeg",
      "alt": "A shortened list of product categories on the mobile version of the \"AliExpress\" website."
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/05/19/0519d2dbefd34c4206e5a7d8c52aabc8/f1aa2db1db82584da14cc6ef470973ec/AD_4nXdz5VKfa0OoKVh6HMHbfOj-My-K_x-aBGxvCNvHGdpiEHslCmKNwHwIWu_JiyUvICEqXu0KVkUK_2XfCdwGNSYMvbuPTW4hjaC5SEFpr7MX3yq-Sw6MutA0SVyoLw35pCHra9nl0Yg816Hs7_QgxjyC01-r.png",
      "alt": "SEO-friendly site architecture with a top-level \"Home\" page, followed by \"Category Pages,\" and multiple \"Individual Pages\"."
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/75/a5/75a55fbbef42626ae222deae323a82ee/a18f7cefa38647a71e97bdb59b5a564b/AD_4nXcwylqUmaVGG23SHrjKh61DcCRRCB4LaxHpCJVlQD0rg5L2vyYFcQXIHodNyrog4spA_DSnexrk2bsQT4OJLnAxnVf0wtzpt88MhvNL6uocyfmjPFAfuaM9T4B68ZRPvQ7B2TUj3jiXNeprhTEkRAcWmY6q.jpeg",
      "alt": "Keyword Magic Tool start with \"dry dog food\" entered and the \"Search\" button clicked."
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/40/5c/405cb3e6cb968843098ba7b865d7a769/d170fbfaf99077c72b9d27afbddd272a/AD_4nXfSvP9qfBvSSveovOvZiHV5mzeg-IquUV8VS_Q0anBWt7yrAGRuocRO8HNtIfaGQeap5XhxoplbVSI0l1Mk3_1yPkK9QC5za5Y9ljBiweYpkemBuvmzfl8yO8eSlazcYYNE0dcAHBsyKx0CD26_Whgx2_Fa.jpeg",
      "alt": "Keyword ideas containing the product category name, \"dry dog food\", along with their volume, intent and difficulty."
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/72/ee/72ee1e62da8aaa89f9e13a8ea52e8017/b7c38cb9d392ed009d8d8dc140f52284/AD_4nXc6yeGk5jrUEAa7QeP6DPA51LpAvrMa3Vqb6MiM6kZDZAIR8GcNiTMNtcQ8QT8zBqY97uJA4VFCnDvo0BsD9tXeNJ_yObhf3iYnHU_HZiU4Gw19g90ddY4JdcBai_XDUA-rMq1dxbbNdRiOSJoCJyL34hRU.jpeg",
      "alt": "Site Audit tool start with a domain entered and the \"Start Audit\" button clicked."
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/66/6f/666f48ffa49b0173dcaea8facdd7afa6/ccff53a50ea98d4432e5fc1ab1b668b4/AD_4nXeJfb9hT-fr-CwRVO9XaYPHBFWe0Aazxu1aH1vSV3ChMqhcYkFky7ZGPv_PvLBYKZskw4br0yo-niuVGt9kBSp0EVUMn0qXs1KG2S4nZIX80xXPXd0eDJJA1VpcuxD0hmaIwFYw3bPKXbDc-mdixLvikMUl.jpeg",
      "alt": "Site Audit settings page to select crawl scope, crawl source, and limit of checked pages."
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/f9/92/f992fcc3aad6a13a869a459bb75d7b8d/81bd9902a103fab77bd8ce87e45fcafc/AD_4nXe9jL3_SpzG7hLbb2n8yVC_EjMQlTNb8-UV60UShMueNLm9t_SMBfdPn1j-7psaaGejY_6LHg1bukttKO_lz794jAfQG74T0iPLfN7Yo6FqRuve65V0LzYRE3b0PbMg1WpBjFQFF8VVug2dEvocnjF6qbc.jpeg",
      "alt": "\"Schedule\" tab on Site Audit settings with the frequency drop-down opened and the \"Start Site Audit\" button clicked."
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/bf/bd/bfbd41d3720d79a45cc4421c68506591/f02af8d28082bc76fc1a010af9d52364/AD_4nXcNvDmIsVPwBTtXNBN6j4u76-gxhzbnpKG-2Vh3HvGnR6m3HLYUPJrd3Yp-V9mNF4nU-AXqGvscbZ7VkexVK3OREtzXDFA91vPeEB3R1Wge8ZZ1m0fMoDrNzRum7W-LUVXlRJFzL-pnfgaQ73YpYcKL7dI.jpeg",
      "alt": "Site Audit overview showing the \"Site Health\" section highlighted."
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/5f/57/5f57680e7ff506c8e8da77767402aca1/8efdf96b5880441a9287b1d184a455a0/AD_4nXd-ZqDGaFKOZ2c8lrm3MhFD3dLByGVowO0cxEloKGPMO3bV-pgxGbWGh4CB5ennZx0tjUb0QrG285j61CNU3T1h2De0wRClOBTQyPvoPkRL030_bE3zusq7U3oErHLMrGrB7iH08_1eaEtnxHXyoPBeHBs.jpeg",
      "alt": "The issues tab of Site Audit showing errors like hreflang conflicts, incorrect pages, broken internal links, etc."
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/df/85/df85ec22f282dddc089e95f1d29696cb/a32f033cc900eee5f1b139b2842891c9/AD_4nXfxWssz5ApAIe09Xcs9J-CS23LsqZxREN-uH8x8MVkZRGiii6uEuHfJI6xp0ZfBgFDiT4VYN6ilZghYm1obsFKmhMmXeJp0bYqSkfNrXHMrWSYDGvkuSywzTRgs1TnswEJWTfat6E3euJ8ZFjPGN0o_shcA.jpeg",
      "alt": "\"Why and how to fix it\" clicked on the Issues tab of Site Audit which shows additional information on how to address the given issue."
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/semblog-next-static/banners/trial-gift.png",
      "alt": "Trial Semrush banner"
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&d=Mon%2C%2021%20Oct%202024%2014%3A09%3A52%20GMT&n=4d&b=Ecommerce%20Architecture%3A%20Definition%2C%20Importance%2C%20%26%20Best%20Practices&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fecommerce-architecture%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&b=Ecommerce%20Architecture%3A%20Definition%2C%20Importance%2C%20%26%20Best%20Practices&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fecommerce-architecture%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://bat.bing.com/action/0?ti=5128787&tm=gtm002&Ver=2&mid=ab6c891d-2810-4c53-8714-641e2c4780d2&bo=1&sid=22686d408fb611ef811d7faedf58f631&vid=22713d808fb611efb055ede466cb64e2&vids=0&msclkid=N&uach=pv%3D10.0.0&pi=0&lg=en-US&sw=1536&sh=864&sc=24&tl=Ecommerce%20Architecture%3A%20Definition,%20Importance,%20%26%20Best%20Practices&p=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fecommerce-architecture%2F&r=&lt=874&evt=pageLoad&sv=1&cdb=ARoR&rn=55072",
      "alt": ""
    }
  ],
  "publication_date": null
}