{
  "url": "https://www.semrush.com/blog/email-content/",
  "title": "How to Win People Over with Compelling Email Content",
  "content": "Email is an affordable and accessible way to reach your audience with an ROI (return on investment) other marketing channels can only dream of. \n\nIn this article, we'll show you how to make the most of your email content. You'll learn the types of emails to send and how to create content to increase conversions and boost customer loyalty.\n\nWhat Is Email Content and Why Does It Matter?\n\nEmail content is any message you send to customers, potential customers, or subscribers to increase brand awareness, generate leads, promote engagement, or make a sale.\n\nEmail marketing gives you a captive audience. When a person joins your email list or checks the opt-in box at checkout, they want to hear from you.\n\nThis is a great first step in building a relationship with your customers.\n\nBut the actual content of your emails can heavily influence how this relationship goes. Why? \n\nBecause what you say in an email headline is what entices a person to open it. And how you grab and hold the reader’s attention within the email is what encourages them to take action. \n\nHow you engage your target audience is what ultimately determines how well emails perform.\nLet’s look at the numbers. \n\nHere are just a few stats that show the effectiveness of email as a content marketing tactic:\n\nEmail marketing has an average click-through rate of 2.62% compared to 1.21% for social media advertising\nEmail marketing has an average ROI of 3,800% or $38 for every $1 invested\nEmail marketing accounts for an average of 19% of sales\n18% of companies achieve ROI greater than $70 per $1 invested\nEmail marketing revenue is predicted to hit almost $18 billion by 2027\n\nOur own research shows that over half of successful marketers use email as a marketing channel.\n\nImpressive figures. But they’re only possible with great email marketing content. If the message falls flat, so do the clicks. \n\nB2C Email Content vs. B2B Email Content\n\nDepending on your business, the type of email content you create will fall into one of two categories:\n\nBusiness-to-consumer (B2C) email content. Promoting your brand and products or services to consumers.\nBusiness-to-business (B2B) email content. Informing buyers of how your products or services can benefit their business.\n\nThe big difference between the two is the target audience. \n\nIn B2C, your content is aimed squarely at the person buying your product. \n\nIn B2B, you might be marketing to a group of decision-makers in what is typically a longer buying process. \n\nThe decision-making process of the two audiences influences your content. \n\nB2C communications can focus on impulses and emotions. You can play on status and urgency to get people to click on a link or make a purchase. \n\nTake this email by Bose promoting its Black Friday deals. \n\nThe content is designed to get immediate sales. \n\nThe headline lets the reader know that if they buy today, they can make a huge saving \nA five-star review adds social proof. It gives the reader confidence that this is a great speaker.\nThe saving is highlighted and the retail price is crossed out to reinforce the promise made in the headline\nA “Shop Now” button prompts immediate action. It’s telling the reader: “Act now so you don’t miss out.”\n\nThese tactics can work in B2B email content (reviews are a great tool whatever you’re selling). \n\nBut unless you’re selling to a freelancer or company of one, a B2B buyer can’t act in the moment and hit the “Shop Now” button in the same way a consumer can. \n\nIn B2B, the stakes are often higher. \n\nIf a key decision maker purchases a five-figure software product and gets it wrong, it hurts the business. \n\nBuying groups exist to ensure every purchase is right for the business based on all the evidence they have. This makes the buyer’s journey longer. \n\nB2B content has to be more rational and fact-based. \n\nIt should help buyers make confident decisions. Not only for the future of the company, but also for their careers and status. \n\nThis email from DocuSign, for example, focuses on an important question for its audience: “Are Electronic Signatures Safe For My Business?”\n\nBy educating the reader, Docusign establishes authority. It’s telling buyers: “We know our stuff. You can trust us.”\n\nIn another email, they focus on features and benefits: \n\nThis one tells buyers: “Now that you trust us, here’s what our product can do for you.”\n\nAdding a “Learn More” button to each benefit lets buyers dig deeper and gather more knowledge to make rational low-risk decisions.\n\nB2C and B2B Aren’t So Different\n\nThe difference between the two audiences often leads to stereotypes about how you should speak to them.\n\nMany people assume that B2C can always be fun, emotive, and energetic. And that B2B has to be formal, serious, and dry.\n\nBut this isn’t always the case.\nBecause you’re always talking to humans. The fact that they might be at work reading your emails doesn’t change what they like or enjoy. \n\nB2B content can be as casual and entertaining as B2C content. It all depends on the brand.\n\nTake this email by messaging platform Flock:\n\nFlock is a B2B software product, but its tone of voice is friendly and relaxed. \n\nWhether you’re targeting B2C or B2B audiences, there’s always a person opening your email and reading your email marketing content. \n\nThe tone of voice you choose should match the experience you want the end user to have. \n\nTypes of Email Content to Send to Your Audience\n\nSuccessful email content is about balance. You need to vary the types of content you send. \n\nIt’s okay to sell to people now and then. Especially if you’re promoting an offer. But if that’s all you send emails about, it’s going to turn people off.\n\nMailchimp, for example, sends its audience a monthly newsletter with links to interesting articles and upcoming events: \n\nIt also sends out customer success stories, special offers, and product updates:\n\nThis range of messaging keeps content fresh and engaging. It ensures email subscribers never feel like they’re being bombarded with too much of the same thing.\n\nTo strike the right balance with your email marketing, create content for several types of emails. \n\nHere are some common options to consider:\n\nWelcome emails. An introduction to your brand and product/services. This can be a one-off or series of emails. But it should be a teaser of what’s to come.\nLead nurturing emails. A series of related content sent when a lead takes a specific action on your site. For example, you could send a reminder email when people leave items in their cart. And even follow up with a discount code and a list of related products they might like.\nEmail newsletters. A weekly or monthly roundup of blog content, upcoming events, and interesting updates to engage subscribers.\nTransactional emails. Practical emails triggered by customer actions. For example, purchase confirmations, login reminders, webinar registration confirmations, etc.\nOnboarding emails. A series of emails to educate new users on your product and help them realize its value. For example, step-by-step instructions for common tasks.\nPost-purchase emails. Similar to onboarding emails but designed to help customers make the most of their purchase. For example, set-up instructions or best-use tips.\nProduct updates. A look at new features and how they can benefit the customer. For example, what the product is, how customers can get it, and how they can use it.\nSeasonal and promotional emails. Special offers and discount codes for dedicated sales periods. For example, holidays like Thanksgiving, Black Friday, etc.\nInvite emails. Invitations to upcoming events or webinars. Let people know what the event is, when it takes place, what attendees get from it, and how they can register\nRe-engagement emails. A reason to re-engage people who haven’t opened recent emails. For example, updates, an offer, or the chance to provide feedback or unsubscribe.\nFeedback emails. A request for feedback to improve your content. If you’re asking customers to complete a survey, consider adding an incentive. For example, entry into a prize drawing or a discount code.\nHow to Create Engaging Email Content\n\nEmail content has to appeal to the needs of the reader. It also needs to help you achieve your goal. \n\nBefore you put pen to paper (or fingers to keyboard), think about what you’re trying to achieve. \n\nWhy are you sending this email? Do you want to raise awareness for a new product? Gain new customers? Create brand loyalty? Drive traffic to your website?\nWhat problem are you solving? How are you helping your audience overcome pain points? For example, improve workflows, feel healthier, learn better, etc.\nWhat do you want the reader to do? What action do you want them to take? For example, click through to your website, register for a webinar, or purchase a product.\nHow do you want them to feel? Do you want them to feel inspired or motivated? Educated, entertained, or informed?\n\nYour goals will differ depending on whether you’re talking to a B2B or B2C audience and where the reader is in the buyer’s journey. \n\nWhat doesn't change are the essential elements of a successful email. Regardless of audience or type, email marketing content has to be eye-catching, inspire clicks, and leave the reader fulfilled. \n\nHere are nine best practices to follow to do just that. \n\n1. Use Your Name to Create Trust\n\nReal people drive real connections. Using your name as the “from” name in emails helps break down the barrier between company and customer. \n\nIt lets readers know from the start that the content is written by a human and isn’t a generic email message. \n\nIt can also help you increase email deliverability so your content lands in a subscriber's inbox and not the spam folder.\n\nTake Copyhackers. Rather than coming from the brand, emails are sent by its founder Joanna Wiebe: \n\nJoanna also signs off as herself. This adds to the feeling that these are emails from a friend or colleague rather than a company:\n\nFor regular newsletters, announcements, and upcoming offers or events, using your name helps create familiarity. \n\nBut when emailing new subscribers or customers, you might want to include your brand name. \n\nThe B2B Bite’s Jason Bradwell, for example, introduces himself as “Jason from The B2B Bite:”\n\nThis immediately puts people at ease. They might not know Jason, but they'll remember signing up for The B2B Bite newsletter.\n\n2. Come up With a Snappy Subject Line\n\nThe email subject line is your headline. It’s what will make people open your email (or not).\n\nDon’t settle on the first name you come up with. Write down 15, 20, or 50 ideas. \n\nAs you do this, focus on the main benefit of your email and talk to the audience in their language. \n\nA good headline should give readers a peek at what’s inside to entice a click. \n\nTake this email subject line from copywriter Lenny Rachitsky:\n\n“10 lessons on bootstrapping a $200m business | Patrick Campbell (ProfitWell)”\n\nThe subject line uses an impressive stat: “$200m business.” Which immediately tells readers that they should definitely open the email to get those useful 10 lessons.\n\nMore straightforward headlines can work just as well. Like this one from the New York Times:\n\n“Today is the Deadline Sale. Tomorrow it’s over.”\n\nIt’s simple. But it’s urgent. It lets the reader know that they have to act fast. They have to open the email and claim the offer. \n\nBoth examples encourage action. They invite readers in. \n\nFor inspiration, look at your own inbox. \n\nWhich headlines grab your attention? \nWhat words do they use? \nDo they include numbers and emojis?\n\nYou can also let data guide you. Analysis of 115 million emails by Yesware found common themes in the subject lines of emails with higher open rates:\n\nSubject lines with numbers have a 45% higher open rate\nOpen rates peak at between one and five words\nUsing FOMO (fear of missing out) increases clicks\nQuestions pique curiosity and have about 10% higher open rates\nCommon, tired phrases (e.g., “trying to connect,” or “something of interest?”) lead to lower open rates\n\nUse these points to inspire your brainstorming sessions. \n\nOnce you have a good list of subject lines, narrow it down. Choose two of the strongest options and A/B test them with your audience.\n\nLook at which performs better and use that formula in future content. \n\n3. Personalize Emails to the Reader \n\nIncluding the reader’s name makes emails feel more like a conversation. \n\nIt turns email content into a one-to-one interaction. \n\nFor instance, using the reader’s name makes this welcome email from AllTrails feel like a personal invite: \n\nIt makes it easier for the reader to place themselves in the story. AllTrails promotes this by talking to the reader. Using words like “you” makes content about the audience, not the brand. \n\nPersonalized emails aren’t limited to the use of names and second-person copy. You can also tailor them to the reader’s needs. \n\nEmail marketing platforms like ActiveCampaign and Klaviyo let you segment your audience into smaller groups based on shared characteristics. \n\nYou can segment subscribers by: \n\nGeography (e.g., country, city, or state)\nDemographics (e.g., age, gender, income, or education)\nPsychographics (e.g., lifestyle, interests, or hobbies)\nBehavior (e.g., buyer journey stage brand loyalty traits or purchasing style)\nMedia (e.g., preferred social media or TV channels)\nBenefit (e.g., what the customer values most, like customer service or quality)\n\nFor example, if you’re promoting an upcoming event in your city, you might create content specifically for people in the area. \n\nSegmentation ensures your audience sees relevant content. And it’s a proven tactic. Mailchimp research found that segmented campaigns get 101% more clicks. \n\nCheck out our guide to market segmentation to learn more about how it works and ways to use it to engage subscribers. \n\n4. Get to the Point\n\nThere are many studies about what the ideal length of an email should be. The consensus based on click-through rates is 20 lines of text or around 200 words..\n\nThe key is to keep your message brief and to the point.\n\nDon’t say in 100 words what you can say in 10. People spend an average of 10 seconds reading brand emails. That’s how long you have to deliver your message.\n\nHere’s a good example of an email that gets right to the point from business coach Ed Gandia: \n\nEd keeps it short and sweet at only 18 words (excluding names). But two questions get the message across: If you’re interested in white papers, you’ll like this.\n\nFigure out what your message is and deliver it concisely. Save more detailed content for your website. \n\n5. Make Your Content Skimmable\n\nYour emails should flow in a way that lets readers easily digest information. Why? \n\nBecause people rarely read all the content. \n\nAn eye-tracking study by the Nielsen Norman Group shows that the majority of people skim-read. Which means they don’t read completely or linearly. \n\nWhen a recipient opens an email they tend to read the headline and first line or two. They then scroll through content to find the following: \n\nHeadlines\nBullet point lists\nLinks\n\nWrite your content in a way that appeals to this behavior:\n\nLimit paragraphs to three sentences\nWrite in short, concise sentences\nUse numbered or bulleted lists for three or more items to make information easy to process \nBreak up sections with headings and subheadings\nLeave space between paragraphs and sections to avoid content becoming cluttered\n\nThe below welcome email from journal brand Passion Planner is a great example of skimmable content: \n\nThe quicker your readers can understand the value in your email, the less likely they are to lose interest and leave without taking action. \n\n6. Let Visuals Do Some Heavy Lifting\n\nSupport your copy with strong visual email design. As engaging as quality email copy is, sometimes it's better to say less and show more. \n\nIf you're telling your audience about a new product, let them see it. \n\nFor example, in the below email, shoe brand 8000Kicks does a great job of announcing the Kickstarter launch of their new waterproof boot: \n\nBut words alone aren’t enough to sell shoes. The audience wants to know how they look. \n\n8000Kicks answers this question with a great image of their new boot in the wild.\n\nVisuals grab attention and help readers understand information. For example, Google uses graphics to complement its email copy: \n\nThis makes the email visually engaging. It also appeals to skimmers who are scrolling in search of the key benefits. \n\nUse images, videos, GIFs, and graphics wherever they make sense. But make sure to always include alt text (HTML code that describes images) to explain what visuals show. \n\nThis will ensure people who use screen reading software or have image loading disabled still get value from your content.\n\n7. Keep Your Content Consistent\n\nWhen readers get to know and trust you, they’ll open your emails expecting a certain tone and style. A drastic move away from this risks alienating them. \n\nWhile the content, look, and format of your emails will change over time (and should change for different types of emails), stay true to your brand. \n\nDesign should match your brand guidelines. Copy should fit with the tone of voice you use on your website and other marketing channels. \n\nTake a look at this snapshot of a series of emails from copywriter Lenny Rachitsky: \n\nRachitsky does a great job of maintaining consistency by using an email template. Each email shares the same: \n\nColor palette\nHeadline font and size\nImage and graphic style\nCall to action (CTA) button color\n\nConsistent doesn’t mean boring. You should always aim to surprise and excite readers with your content. \n\nBut do it while delivering on what people have come to know, love, and expect.\n\n8. Skip the Industry Jargon\n\nJargon refers to specific vocabulary and expressions that make communication easier for people who share the same knowledge. \n\nFor anyone who doesn’t share that knowledge, jargon is a foreign language that sucks the life out of content.\n\nAs a general rule, unless you’re targeting people you know understand your industry speak, stay clear of jargon. \n\nIf you have to use acronyms, write out their full meaning the first time they’re used. For example, “CMS (content management system).” \n\nIf a jargon word has a universally understood alternative, use it. \n\nVimeo Create’s introductory email is a good example of how to keep things simple. \n\nThere are all kinds of video production terms the brand could use when talking about the product. But many of these would make no sense to new users.\n\nVimeo knows this and focuses on friendly, clear language:\n\nWith four clear steps to getting started, users can click the CTA button with confidence. \n\nIf you’re unsure whether a word or phrase should be there, get a second opinion. Show your email to someone who doesn't know your industry lingo. \n\nIf they don’t understand it, neither will your audience. \n\n9. Make the Call to Action Loud and Clear\n\nYou’ve hooked people and given them value. Now you need them to act. \n\nYour CTA is the part of the email that tells people what you want them to do (e.g., read an article, enter a giveaway, make a purchase, etc.). \n\nIt’s both an instruction and a persuasion tool. Which means it needs to be simple and bold. \n\nClearly explain the action you want readers to take.\n\nWix, for example, wants its audience to start creating a website. Their email CTA promotes this action: “Start Now”\n\nMacPaw wants its audience to take advantage of its special offer. Their CTA provides a clear instruction along with the benefit of the action: “Get CleanMyMac X at 30% Off”\n\nIn both examples, the CTA is a clickable button that stands out from the rest of the content. It’s easy to spot. You’re unlikely to scroll past it unnoticed as you might a text link. \n\nCTA buttons are a crucial part of email content—they improve click-through rates by 127%. \n\nHowever, it’s best to avoid filling emails with multiple CTAs. You don’t want to bombard your audience with so many options that they become confused or turned off. \n\nInstead, stick to one goal per email. Focus your content on a single idea with one or two clear CTA buttons. \n\nFor example, the below email by brand hub platform Niice introduces its Autumn feature updates. The goal is to get users to check them out. \n\nThe CTA in the header section points users to a landing page: “See what’s new”\n\nNiice includes a second CTA at the bottom of the email to tempt users who have decided to read the content rather than click the first button: “See all updates”\n\nDifferent copy, same goal. It also gives Niice two buttons to test to see which copy and placement resonates with users. \n\nWith every email you send, you should establish your goal and build your CTAs around it.\nHere are some common types of CTAs to experiment with: \n\nFor promotional emails:\n\nShop now\nGet in touch\nGet X% off\nBook now\nClaim your offer\nContact us\nGet started now\nEnroll\n\nFor lead nurturing and onboarding emails:\n\nLearn more\nFind out more\nDiscover\nExplore\n\nFor raising brand awareness:\n\nLike and share\nEnter to win\nFollow us\n\nOnce you check all the boxes to perfect your email content, it’s necessary to make sure it gets to the right audience at the right time. If you already have a list of contacts on your hands, it won’t hurt to check how fresh and up-to-date they are, as well as avoid any duplicated items or email bounces, using an email verifier.\n\nMake Content Part of a Winning Email Marketing Strategy\n\nYou know what works. Now it’s time to put it into practice. \n\nIf you want help getting started, check out our six-step guide to getting started with email marketing.\n\nThis will help you set up email marketing campaigns for your content to win over your audience. And get results.",
  "headers": {
    "h1": "How to Win People Over with Compelling Email Content",
    "h2": [
      "What Is Email Content and Why Does It Matter?",
      "B2C Email Content vs. B2B Email Content",
      "Types of Email Content to Send to Your Audience",
      "How to Create Engaging Email Content",
      "Make Content Part of a Winning Email Marketing Strategy"
    ]
  },
  "images": [
    {
      "src": "https://static.semrush.com/blog/uploads/media/1a/f3/1af3bd98e3eb274f776b9e136d4741c7/email-content.svg",
      "alt": "Compelling Email Content"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/69/f3/69f3591148cf2d1e412751b1a797c6b5/HYACUeB2bY_GvTwbvheBh8eeJgbj5V9L_ZutnyTbKvRq44znPyplj0uXTDHWo737_YW9mdze8Natv9RzcPnCBW1ExYqkwlJ4g6EBQw4xixZqhRMGmI3ZNKJpFbBEqxnhE7ERowqhfmVGm9EVmSyg3sg.png",
      "alt": "Bose Black Friday deals email"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/6f/1c/6f1c9efab72c6a93c91f645e88137d9b/Modern-Online-Buyers-Journey.png",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/aa/38/aa38f02bfc31516d2dd19c3a40db9bc5/W71MOdhCBeaGcYoe8WOsbPWRlKnn7YFh1iENGCTrkLrNThtcB7QyhIQhsaiF_7Yy3sSSsMiGrb5TEKiWjwwGaO39yGTkhJnsYg92MZyT5F2qVWvFsDflD0AK72uw5STHETKGSdc0KPT0JfkNAtS6Rks.png",
      "alt": "email from DocuSign"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/4d/89/4d8985bf1cff39b2b0a0dc417293572b/RqRt9yZFgiQsrgRfTt4UmkndXC9OFLQcBu6BtjBaA8Qj9Asw1iVKGrj5c_jtggs3qjTj9SqYrd2QJBbV0lsDmGEDgxJJ6cxAlCKHpUJ9pHfWqW-5ICQ4hAxXGuVRTnbf_Rhzf-GEQVDtQUyN_qqeDe4.png",
      "alt": "email from DocuSign about features and benefits"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/4d/59/4d59c8831cee1084133589813ec25495/RZtgAKwg3Awlc23fMdJWXE3J2aSDGRpioLpIaAZcZJxFMdA9n4sS5ynKfTdWcRqlpi_eHZrbZX3KfA5oAFrqLX98LFgmYUQPagfYZ8dGUWzAZKOLkBDdtWeKmACEXEzeczXtl2g02bQRbp38MBsC3rg.png",
      "alt": "welcome to Flock email"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/10/70/107049c814de749aa59650be54af9b7c/5hIwTRs01slxVQL51a2XGj8MS8HRgzhDtnzA4mo3pgqMoHOAzKOpHsw7jDIU84Jl61P2nQjErhnV9Nz78CkaRQf1axSvOya2xNgqgtzPp6XBmr_Obx7jKA4VRxOZBkRC_syXY1MuJtuYq0X3ffT0A2A.png",
      "alt": "Mailchimp monthly newsletter"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/1b/3d/1b3d6b1e319b66d4261d9eca1229f6fe/SZkd7D_RQWchIZhRor7d_mbZtFftZU-2-RgEh2r9bLh6fvRs5jgR75VUhyohMirn_M5sTPQ9rNxpYGZCI1idvp1AOFCy5wn9antUDSQLIy_bARrU9Ya4GewBUvsEDIehODxTd0Fe_0lOrAHTsj8l1-s.png",
      "alt": "Mailchimp special offers email"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/6e/52/6e52fdb00eb14aaf03bb25febd5561bf/0m7q-X6VJSnNNImgShXv9ij_a9Z7hW2npr7ZAJ1q3z_7Nutb7rv456de_nHrxarprjvu9kLCSRj32qwtoS2t1WqF5ZFx6XXuaIcTadXqrtm8bfF33oQ__WvwKTsQ_6IXy2uoGWccomnLvv9js0lof0s.png",
      "alt": "Copyhackers email example"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/20/07/2007c8cc8ea68d418f4143562a4daa44/s1MGB2KMcBKAYW__HY_0LlCAPzr0ZV6cS8LoSEDS_E02pl6hRLNzS62MZYy2LTtG3b_1RD9ZXbEwJKikCiRMZvUx8AVmA8AmMGK-N1Vg4G8telqurdOnmUBW8pkzT1a0CCxYnX3HWZ5f-q82FHUUlXg.png",
      "alt": "Copyhackers email signed by Joanna Wiebe"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/fe/31/fe31a87ff642f757f4c59b9d7d12d600/BXaJ-X9UTlY7J37-aVEPAopxpZeRX5NSBx7tjpePlD8kV0koUKnrY8NpLcHmnc0RYwr4Z4Z47DrT6yiECHXITMhWbl8kfE4CQI9zh_0AEt2I6uWCBpz6YjfEAKb3lpVy9QO7OfIYTKJwSzm9HP7Wv7c.png",
      "alt": "Jason from The B2B Bite"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/fa/b0/fab01db4b50e30d55fc40b70efd48742/lW02-FrFNyfUJCB3ajE1nHUwWGRGAgnwRii_VutK2pJENk4bfZ22OzP7Khrzfya2u4uKVBGk66JrQqohcRJOVc5XElvJ-6N0E-JX7i6fY4-JKL1xng1qutSOPWlG17bcb_wlr2bprjga0KY1pX1Hayc.png",
      "alt": "using the reader’s name in welcome email"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/b0/7c/b07c3798ccf6e39671c11093dc13e93f/EN-6-market-analysis-steps-9.png",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e4/fc/e4fc97517025df0637247e88d6fdea2f/XOiL8-C0Ul6uwC1xKNfoAsUGlcfe3cEUcuylbBKGAtsvBKWJDrl0nZi4aCRdwJM6V0c4GbzDNg4CGv7_e8BqZq68nGf9_RWV46AkI58uAzbpvwpON7CX3dAzIHpx17CufC9UN_P5bj9kh3CEAFw4HYU.png",
      "alt": "Ed Gandia right to the point email"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/a5/07/a50774fbd84d3636dfbbd7168afd4cc2/rphrvzwFdKzU-wSYm6GETeEyPrcia9R4APzn9Bk4SsAFMlniTzHAjFSTDIeuwcnN-x6SN5hplQjh00sxbOxoiUKw245d2CBh1HQ1rOmPWZzAM_B7EAD3ZvTFgyss_YxVFg_Uf-tiXWGIx94CMUZd6Ec.png",
      "alt": "welcome email from journal brand Passion Planner"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/60/01/6001f19d701da773b487068b5c9cb7b7/dGL57VQpYWHSGbN6wMu4nG1-Du-Scjvh9NYZqiu_x7BaujgT4X9VoJZ4A6wMXNZ0Rdl85ZlKOvtoty8WJ4-pg_w7V7Dez2S_akK2gOnqjHgCKRjcjyvJxb4TRmf_CQAujO8_fuPccr_Iuc5-hd_aVj4.png",
      "alt": "strong visual email design by 8000Kicks"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/a2/16/a216243c02a90ca6621a06e7e48fc902/Usa5yTPuaF8zazamjrjHfOMjDluP07I3wUDzu5hQ28yhb4Bmg0ilaR-lOuT59nZJenYFC-VdrwttfI2azgxYlmg5qwPEvYbYm3RF-m8c9aHWih0rYbsjmc8hszrSKrFRX5C9blXvARfC7a8vdafxv_k.png",
      "alt": "graphics to complement email copy by google"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/2c/06/2c0654abd69d4e5d41e41a32d84e82aa/xShsMj2t28qw8lXW1JNXWXRNiRfmAuokGJ0tACgXhDBaTt95-eF34oge0GKnBkFr8O5L0dGZe2nfgrZWEt5t02MEe7ERsFw8-8Y9cBAp6GiUjeYJKoDZLaE_hCD_3qMGRHb2fVSJVALhmZj-ph55-wU.png",
      "alt": "Lenny Rachitsky series of emails"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/01/c2/01c27cc8f3a29eef92c801f37b225595/joZAoar3pN85w48Glg9qQubBVzzW15OQaqx-4EpP3m73lMYgT2HDRBv_Rbb8L_m48RnO47Zo1KI0FYY5J_5Xc8NnuWIlbeqAgNLHf6GZU3HQhR4nmgPyTruKSyJtTgT8I7EJ-w6hOuXIGoN78fVR2Os.png",
      "alt": "friendly, clear language in Vimeo email"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/a8/c1/a8c19aa8fbfe687fe5b5c6decc34bd1c/bsOdxdLOJI1gnpc7SQApfIRlY8qH_FoL72F9Z0MaWu_PWAXSJm4WY_nVcNRQ8xopD36utD9fHt6z5_rucTE8jsCsatH9lnRbXp2phBOWZMraGem561nk4zbMbt2fMpnvkTI5C0bI13yjYEfmlFVoBBo.png",
      "alt": "CTA in Wix email"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e5/b4/e5b40212008d56bc27a2488801ceafbe/Oa2_eEZ4OaHMeM7h0ETMcIdMaLcgoMX8e2mF8VcvkdRgqo4ZZlcyzuRfMGbIrZBg0C0-7wp_xeVKPmhee_o7DTCC8fUxAV8h9FlG8dBUekUmbuiSRVP1KUV8M4qyhwf0GNTp-AHv3doJz1h0-ZKDAz0.png",
      "alt": "CTA in MacPaw email"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/f7/b1/f7b1b25749e3151655013d0089fcffdc/I7OMcoOM5aEHGqaDWq708E1zJaqE1G1DDmguVYrC6NRNZ9MB5SMm_aL-t5ZY19ogkww0s-Jzn_JbrwT7GUivb2GjPS2it4kKU5fLgN6fjQ_HdbQPNGs2ubRcFNmwbYLvEEpiQ8mvPoY2MIPoY1JTASY.png",
      "alt": "CTA in Niice email"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/75/d3/75d3a485e81a34a5186322298f0cc857/ShkbdauwaTn9el-kKuTETkAjcC2JZ0QwrWJSx0U3bxLteI1ZAUneveA71qb8mFLsoaMJBpQG0Row57yoAijoluFsuGarvOLleRGmTqDEFYBYySKwCLw2UcpAj8sWqwWqahxdt6PqmaUKCypodhd5GCY.png",
      "alt": "second CTA in Niice email"
    },
    {
      "src": "https://static.semrush.com/semblog-next-static/banners/trial-gift.png",
      "alt": "Trial Semrush banner"
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&d=Mon%2C%2021%20Oct%202024%2014%3A15%3A10%20GMT&n=4d&b=How%20to%20Win%20People%20Over%20with%20Compelling%20Email%20Content&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Femail-content%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&b=How%20to%20Win%20People%20Over%20with%20Compelling%20Email%20Content&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Femail-content%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://bat.bing.com/action/0?ti=5128787&tm=gtm002&Ver=2&mid=b83d8806-bf9d-4748-a9ee-8d98a51b8e0e&bo=1&sid=d2d473208fb611eface42b40020ac977&vid=d2d4d4108fb611ef94a28799788b2718&vids=0&msclkid=N&uach=pv%3D15.0.0&pi=0&lg=en-US&sw=1920&sh=1080&sc=24&tl=How%20to%20Win%20People%20Over%20with%20Compelling%20Email%20Content&p=https%3A%2F%2Fwww.semrush.com%2Fblog%2Femail-content%2F&r=&lt=766&evt=pageLoad&sv=1&cdb=ARoR&rn=295323",
      "alt": ""
    }
  ],
  "publication_date": null
}