{
  "url": "https://www.semrush.com/blog/evolution-of-link-building/",
  "title": "The Ongoing Evolution of Link Building",
  "content": "Link building, that ever-important practice of getting inbound links to your webpages via external publishers, has had a storied history filled with some funny chapters and exciting developments. \n\nHere, we will give you a “Brief History of (Link Building) Time” and a peek into newer, better ways of finding high-quality links for your website. By the end of this article, you’ll get a true appreciation for just how much simpler (and much more authentic) link building is today. Let’s dive in. \n\nWhat Is Link Building? \n\nLink building is a search engine optimization (SEO) strategy that focuses on building inbound links to pages on your website. \n\nBy building these high-quality links, you are signaling authority and trust to search engines, making them more likely to rank your content higher in the search engine results pages (SERPs). \n\nIf you're Avon, you're thrilled when your dark spot corrector makes it to Good Housekeeping's \"best of\" list—even if it is an affiliate link.\n\nLink building as a practice has been around almost as long as SEO itself. Some of the earliest iterations of link building started as far back as 1995. But, like most things you’ll find in the natural world, link building has gone through multiple evolutions—some more perplexing than others. \n\nThe Origins of Link Building\n\nNot all link building was created equally. Some iterations of the practice were nefarious and shady in ways that would never pass Google’s rigorous standards today. \n\nOther versions of the strategy, while aboveboard, were tedious and time-consuming to execute. Fortunately, today you have a much easier way to gain mentions across the web, which we will get to later on. For now, let’s take a fond look back to see how far we have come. \n\nWeb Rings and Link Farms\n\nConsidered the grandfather of link building, web rings describe the practice of website owners publishing links to related websites on their own properties. These loops of web content, or rings of web content, created a linear path through a decidedly non-linear internet. \n\nBut this strategy was popularized in the mid-1990s when the web was new and the competition for audiences’ attention was much lower than it is today. Web rings are still used, but far less often than in the early heyday of the web. \n\nIf you think this is a surprisingly charitable marketing practice, you’d be correct. Back then, search engines were rudimentary, confusing places for searchers and digital marketers alike. A camaraderie formed between businesses and publishers that were working toward a common goal: get web readers’ attention. \n\nWhile it might look comically simple today, the earliest web rings like the one above made it simple for users to navigate the web. If you were a postcard collector in 1995, you could join the “Postcard Collecting” web ring to find practically everything available on the internet that you’d want to know about postcards. (Image courtesy of Bisray.com) \n\nIt might be even harder to picture, but there weren’t really any below-board, spammy links back then. \n\nFor example, if a web user in 1995 was looking for information on how to build a bicycle, they might visit one informative website and be very pleasantly surprised to find that what they selected linked to another dozen websites that also gave a detailed description and step-by-step instructions on how to build a bike. \n\nIn today’s world, that same searcher might plug “how to build a bike” into Google and find 8 million organic search results that give them what they are looking for, but they also might find results that have spammy outbound links taking them to completely unrelated websites. \n\nShortly after web rings became mainstream, link farms started to crop up. A link farm is exactly what it sounds like—a group of websites that hyperlink between one another for the purpose of boosting visibility in early search engines. \n\nThis strategy wouldn’t have been possible without the Inktomi search engine. Inktomi was the Google of the late 1990s. Inktomi relied on link popularity to form its search engine rankings and it maintained two indexes. The main Inktomi index kept a limited number of listings (in the millions). So, if websites failed to maintain a certain number of inbound links to their content, they fell out of the main index. \n\nTo solve this nail-biting problem, early adopters of SEO began creating circles of websites that could “farm” links to and from one another. This kept the number of inbound links consistent between these sites and provided a kind of security net—it was safety in numbers. \n\nInktomi’s index results also fed up-and-coming search engines like Yahoo!. So, if your website did well in Inktomi, chances were that it would be pretty popular in Yahoo!, too. This, plus the reliance on link popularity, made it easy for early online businesses to successfully maintain their place in the search engine indexes, simply by sticking together. \n\nYou could say that Inktomi provided the perfect acreage and fertile soil for these link farms.\n\nWhile the early search engines were bewildering, the World Wide Web in 2022 is essentially infinite. This is a benefit that can also cause frustration for searchers. To reduce confusion and head-scratching on the part of today’s internet searchers, it is vital that your backlink profile is chock-full of relevant, authoritative links. \n\nWeb rings and link farms were straightforward solutions to a complex problem for digital marketers. In fact, they gave rise to the next generation of link-building strategies: link exchange. \n\nLink Exchange \n\nLink exchange, or reciprocal linking, might sound identical to web rings, but there are some important differences between the two. \n\nWhere web rings simply built microcosms of related content on the web by linking from one related website to another, link exchange provided a directory of these links. Links were categorized and organized so that the process of reciprocating links became much easier for digital marketers of that era. \n\nNot only did this build on the existing web ring strategy, but the process also became automated via several digital tools and companies. In 1996, Tony Hsieh invented one of the most popular link exchange tools, the program known as LinkExchange. \n\nImage description: An early LinkExchange banner ad promises to help you advertise your website for free. LinkExchange creator Tony Hsieh would later go on to become the CEO of Zappos. (Image courtesy of Wikipedia). \n\nLinkExchange took the tedious human components out of link building. The software would alert one web owner when another had linked to their website and asked for a reciprocal link in return. It would also check that the links had truly been shared, as promised.\n\nThe catch with link exchange as a strategy was that basically anyone could build a reciprocal relationship. Bike websites could reciprocate links with model plane websites, for example. While it might have been a more organized system, it was much messier and far less helpful to users than traditional web rings were. \n\nImagine going to a website because you need to quickly learn how to fix a flat bike tire, and on that website you find links on how to build a model Wright 1905 Flyer airplane. Talk about confusing!\n\nBut you can’t necessarily fault these early link builders. They were pioneers just trying to get the word out about their websites. There are still SEO strategists who continue to pitch link exchanges, but this is not a common industry standard today. \n\nWhat came next automated the process even further through the power of email.\n\nEarly Email Outreach and Website Directories \n\nIf you’re familiar with the term “email outreach,” you probably picture an outreach specialist contacting highly relevant publishers via email to promote and garner links to their website. While this definition might be true today, email outreach meant something different in the mid-1990s. \n\nSeeing an opportunity to make life that much easier on marketers, web developers began building on the automation that tools like LinkExchange brought to web rings. After all, it was still pretty tedious to have to fill out a web form for every single reciprocal link you sought. \n\nEnter: email outreach. Email outreach in this period made requesting links from authoritative websites as simple as sending out a single mass email. While far less targeted than the email outreach of today, this was revolutionary for web owners who were tired of having to do so much typing and clicking just to receive one reciprocal link to their site. \n\nAround this time, website directories also became popular. Website owners could request that their site be listed on directories like Yahoo! Directory, DMOZ, and AOL’s directory (to name a few). \n\nAdding an additional element of complexity, some companies like Yahoo! ran both a directory and a search engine in the mid-1990s. Many of these combination directories/search engines were bundled up into one service. \n\nSome of these directories were free for marketers and site owners, and others like Yahoo! Directory charged a fee to review the website requesting placement in the directory. \n\nDMOZ was a massively popular, non-profit directory that grew to prominence around 1996. It offered site owners a free way to get authoritative inbound links, and it offered searchers an organized directory of relevant web sources. \n\nThink of link building during this time as the untamed wilderness. While it's true that regulation was starting to take shape in the form of some directories vetting websites before they listed them, countless directories started to crop up across the web. \n\nFor searchers, it was hard to know which directories to trust. Imagine going to a directory for information on gardening in 1996. You might be excited to finally see some structure to web searches. You click on the directory’s “Nature” category and then navigate to the “Gardening” category. \n\nBut, depending on which directory you chose, you could have wildly different experiences. If you picked a non-profit organization like DMOZ, you’d likely find a huge breadth of authoritative links to gardening sites. \n\nIf you picked one of the thousands of other directories that cropped up during this time, you might find that it was much more difficult to get what you were looking for, as many of these directories didn’t have oversight or vetting. \n\nThis more than likely benefited many website owners and digital marketers, but it certainly wasn’t always a user-friendly environment. \n\nThe web was quickly evolving from 1996-1997, and marketers were struggling to catch up. With so many websites generated hourly, it was becoming more and more difficult to fight through the crowds. \n\nDigital marketers had to join the new era of link building. \n\nLink Building in the 21st Century \n\nThe version of the internet that saw publishers helping one another out via link building didn’t last long. By the early 2000s, you could pose virtually any question to a search engine and you’d find hundreds, if not thousands, of results. \n\nOften, this led to an incredibly varied experience on the web. You might search for “best running shoes” and find yourself on an authoritative site with loads of helpful outbound links to other sites. Or, you could end up down a rabbit hole by clicking a link on a running shoe webpage that took you to a site that focused on the history of the Boston Red Sox. \n\nSearchers, by trial and error, became more tech-savvy and developed higher expectations. This is probably why Ask Jeeves was such a popular search engine up until 2006, when the company dissolved. After all, who doesn’t love the idea of having an internet butler serve you all the answers to your most burning questions? \n\nAsk Jeeves was a very popular, early search engine created in 1996. A friendly butler encouraged you to ask a question in the search bar, rather than stumble through a directory to find what you were looking for, giving users a more personalized experience. \n\nSo, digital marketers and early adopters of SEO needed to update their strategies for building links to meet the standards of both search engines and the people using them. The days of easy web conversions via link building were coming to an end. The competition was fierce, and Google had even begun to implement their own content guidelines and regulations via its algorithm updates and Google Webmaster Guidelines. \n\nWhat came after this was the period of link building that brought us up to today. Some of the tactics below have been around a long time. But their staying power signals that they are significant strategies you’ll want to consider. \n\nPaid Links\n\nPaid links emerged as a response to an increasingly loud, crowded internet. With thousands of directories and dozens of search engines for users to choose from, getting the attention of prospective readers and customers became a gargantuan task for marketers.\n\nPaying for links was an easy way for website owners to get an assured placement on high-ranking websites.\n\nPaid links are still around, though some SEO experts shy away from using them. Like any other attempt to build links, it technically breaks with Google’s Webmaster Guidelines. Today, it’s a bit of a gamble not to disclose a paid relationship between your site and another business. While it may work for a while to fly under the radar with paid links, if Google’s site crawlers identify a paid link on your site, you could end up having your site removed from its index.\n\nAlthough paid links worked really well in Google’s early days, the writing was on the wall for SEO experts. Things were changing. \n\nBy this point, website owners were no longer solely focused on providing informative websites for readers. The utilitarian origins of the web had expanded to include marketing and selling. Searchers caught on pretty quickly to this shift. Gimmicky sites with gimmicky links weren’t going to convert users for long. \n\nThis gave rise to the guest blog. \n\nGuest Blogs \n\nGuest blogging has been around for eons, at least as far as the internet is concerned, and it is a great way to inform and engage prospective customers/searchers without succumbing to cheap marketing tactics. \n\nGuest blogging is exactly what it sounds like—authoring a blog on someone’s site and linking back to your own. It’s a form of thought leadership that signals authority and trust. Plus, since its inception, it’s been an incredibly open-ended strategy. You, as the guest blogger, can usually choose where you place your links and how you formulate the piece you are submitting to the publisher. \n\nSure, many reputable publishers have writing standards that must be met before publication. But that is also a trust signal to searchers that what you’re saying comes from a place of experience and authority. Essentially, your work has been vetted by the publisher—if it was bad, they wouldn’t risk putting it on their website. \n\nThese guest blogs were and continue to be beneficial to the sites publishing them. It’s often a big lift to always be coming up with new content, in-house. Outsourcing this work via guest writers has historically been a great way to reduce spending and get fresh, engaging content out to your followers. \n\nGuest blogging can reduce your workload and bring fresh perspectives to your website.\n\nAnd guess what? Guest blogs continue to be an MVP strategy for SEO specialists. Guest blogs are the giant redwood trees in the SEO forest: they have yet to be uprooted after all these years. \n\nThat’s not to say that guest blogging is free of drawbacks—guest blog pitches range from good to, frankly, astonishingly bad. It really does take the Midas Touch to get a pitch right. And, in today’s world, it’s not a skill many seem to possess. \n\nThe Broken Link Method\n\nAs link building moved into the 21st century, it took with it only a few of the practices used during the early days of the web, like guest blogging. By the early aughts, the methodology and pedagogy of link building became technical and highly organized. \n\nSEO experts began to ask, “Why focus solely on building new links? Why not improve on what already exists?” This ultimately led to the creation of the broken link method.\n\nWhy fix what isn’t broken? How about why not fix what is broken? This is the function and purpose behind the broken link method.\n\nBuilding new links takes time. You have to build a relationship with the publisher, do lots of cold outreach, and maybe even buy a few links. \n\nFinding broken inbound links and reaching out to the publisher to correct the link generally takes less time, and it’s usually free. \n\nThe premise is simple: you find dead links on reputable, relevant websites and contact the website’s owner to offer a working replacement link to your website. \n\nMultiple tactics can be used to find these broken links, but a lot of SEO specialists choose to look at websites where their competitors are linked, and then they look for opportunities to switch out this broken competitor link with one of their own. \n\nHowever, SEO experts realized that this tactic could work well in tandem with other, stickier link-building strategies, like the Barnacle Method. \n\nThe Barnacle Method \n\nWill Scott, an early champion of directories back in the 1990s, introduced what he called “The Barnacle Method” in 2011. Picture a barnacle attached to a big rock in the ocean. This small sea creature waits until the nutrients it needs come floating by via the ocean current. \n\nDoing things this way, the barnacle exerts less energy to get what it needs. Now, to translate this analogy into SEO terms, you have to think like a small business owner. \n\nA small business owner in 2022 probably knows about keywords, and SEO-savvy business owners will probably know what their ranking industry terms are as well as what other local businesses and competitors are ranking for those keywords in the SERPs.\n\nSo, a small business owner might act like a barnacle by planting a link on bigger sites that relate to this industry. These sites tend to rank well in the SERPs for certain industry keywords. This is the small business’s big rock. The ocean current is the customers who have come to trust the sites that include the small business link. The conversions that come from users clicking these links are the nutrients that fuel the business. That’s what the Barnacle Method is in the simplest terms.\n\nIn a real-world application, it’s a lot more complicated. \n\nYou might hear this kind of strategy described as “parasitic SEO,” but that’s a little misleading (and sounds kind of gross). Whatever you’re offering when you link your website on these larger sites had better be relevant and add something to the site you’re connecting to. \n\nIn other words, you can’t spam links to these bigger businesses’ websites. Your focus needs to be on adding to the user experience of these other sites. Drawbacks to the barnacle strategy include: \n\nIt’s research-heavy \nIt’s time-consuming \nIt’s now a strategy that refers more to local businesses who do lots of customer management on large third-party review sites like Yelp and focuses less on link building for individual sites\nResults can take a long, long time \n\nSo, the Barnacle Method isn’t for everyone—but those who do utilize it have the option of deploying additional tactics, like the Skyscraper Method. \n\nThe Skyscraper Method \n\nBrian Dean coined the Skyscraper Method in 2014. To utilize the Skyscraper Method, you have to look at your competitor’s content, read it thoroughly, and then craft content that is more relevant and thorough than theirs. \n\nThis doesn’t mean you just change a few words around and then copy and paste your competitors’ content into your own website. You have to find your own unique content angle that builds on whatever your competitor has written. \n\nSo, how does this relate to link building? Simple. You find competitor content, write a better piece, and then reach out to publishers with a new link to replace that article from your competitor. You give a friendly pitch as to why your link has better and more complete content than that of your competitor. \n\nHere’s an example of a Skyscraper Method-friendly message that a strategist might send to a publisher: \n\nHi there, \n\nI saw that you recently published an insightful piece titled “The 30 Best Places To Take Your Motorcycle.” I particularly liked your tips about motorcycle-friendly stops on the Pacific Coast Highway. I’ll definitely be saving this piece for my next trip on the open road.\n\nI noticed that you linked to a blog about motorcycle helmet tips by MotorcyleAmerica. I just wanted to pass along that we at AmericanMotorcycleFans have also written a piece about helmet tips and we even included a free measuring guide and a handy list of links to suppliers who are running summer sales events. \n\nIf this interests you, we would be honored to be included in your piece moving forward. Here’s the link. Thank you, as always, for writing excellent content for the motorcycle community! \n\nAll the best, \n\nYour Name \n\nIt might already be clear, but it’s worth noting that this strategy takes time and a personalized touch. You are essentially asking someone to remove one link and replace it with yours, which they are under no obligation to do. \n\nThis is a form of cold outreach/link building that also has some additional drawbacks: \n\nPublishers get a lot of emails from people claiming to have a better link—the competition is heavy \nCompetitors might also be using this practice, which means you could end up just replacing links you have lost to competitors and never quite getting ahead \nIf this is the main facet of your link-building strategy, you will need plenty of outreach staff or the help of an agency to get the job done \nYou’ll need a team of skilled and talented writers \nYour content will likely need frequent updates to keep your links relevant and at the top of the skyscraper \n\nMuch like the Barnacle Method, this strategy isn’t for every link builder. Smaller businesses might struggle to find the human power and resources to do the kind of outreach this requires. \n\nThe good news? In 2022, there is an easier way for virtually every business to build relevant, qualified links to their site. \n\nLet’s talk about it. \n\nHow To Easily Build Valuable Backlinks Today \n\nWe’ve made it to the end of the evolutionary tour of link building! If the history of link-building methods could be summed up in one sentence, it would be: “It’s complicated.” \n\nLink building, up until now, has involved a lot of work, expertise, and time. But the world of link building has shifted rapidly in the last few years. Now, tools are available that automate many of the tedious aspects of outreach, opportunity research, and monitoring of your business’s mentions across the web. \n\nTry Semrush's link building tools for free:\n\nSecure Valuable Backlinks\n\nwith the Link Building Tool\n\nSign up Now →",
  "headers": {
    "h1": "The Ongoing Evolution of Link Building",
    "h2": [
      "What Is Link Building? ",
      "The Origins of Link Building",
      "Link Building in the 21st Century ",
      "How To Easily Build Valuable Backlinks Today "
    ]
  },
  "images": [
    {
      "src": "https://static.semrush.com/blog/uploads/media/35/1b/351be780677e51306cdbcd215df89229/evolution-of-link-building.svg",
      "alt": "Orange background showing the \"evolution\" of a link from primate to modern."
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/b4/dd/b4dd561d3a5e6fc39c52c8569a60f52f/M5i5dtjRCs8XeZOSG2KmROnvY36_G7syjvzerXWa96BrXa9o3ENOvyOXBmenDUhRYOjHq3nAQTSbOuRpg28uqCd2txKroKJjM9h7oz7djXm5MA0Y1WkfIPFeto5QitTzFiyM9-t3osn_uCkfIZ_F9Ao.png",
      "alt": "Avon's product in a Good Housekeeping \"best of\" list"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/5e/95/5e95e9bf01145c6b35c52c3a5ff4e187/PnF0I2OOcWfPVaJ77pQmOtGX4g0xfgrpEYTntFyM4zoez6f-oMpxYqw64zRX3fFi9QRxiGJJTeWbg1CPdAu1ni1b2SsIrFMZHIESbJqvmq0CbYy4lZNM87wodlmjEGcQ0VFlCnFUltTe80t3eNjhoMc.jpeg",
      "alt": "Screenshot of an early link ring with topics from \"Optical illusions\" to \"Royal Navy\" featuring ugly thumbnail images and lots of 90s blue text."
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/80/fb/80fb3588ae4a93f8b7df9b431a95b49f/gX3fFrkLXN6lnsWkv2fojP5L3TD0Dj2Xv3dBUhkJzH_oHPIidsZzuYAcq9AGP3D8r3oYUgyFlBcpGy-2bDek-mHfSZT4LwTaFUJmEDeU_cVtTjddfJgAS_EHNvAAvTWWmKORVVuWI_3fCIBU1ZVIsls.png",
      "alt": "DMOZ directory with topics from Arts to World - again with the 90s blue"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/4e/3f/4e3f6df921046f55dee01aaf6c17df4f/njLDNLLWO82pXOkfBEn0F6t1jn26osF-GHa7e_iDOZ13r-PD6w9L7hNy_sR8M0qefWjsEuAydRqoRQdjLAcYG6Vrivh0OopnDImtanGiXq6toTM5iWalMUfK92JM9o9x7Z6t6iSbrREHRwu8kxDwLPE.jpeg",
      "alt": "Screenshot of Ask Jeeves, which was a very popular, early search engine created in 1996. A friendly butler encouraged you to ask a question in the search bar, rather than stumble through a directory to find what you were looking for, giving users a more personalized experience. "
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/f2/50/f250b69ea7846fe68f37bb4f369d71a5/X6TG49dNAUJlRYbNkdU8tSu88PXGSj7qT5JS3l3NlTFnCzKZQ4MXz6pc-4D0Zt41QHDe-yhDqlCLGG2VdeknHeWyjwNVy3aBECyZCrj1ag3cNpfQhwu0f3Xp0aWPQGR40b6NA3urFC4cqF6-BJVuuRM.png",
      "alt": "Lady popping through a webpage on a pinkish background"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/1b/c7/1bc71dbd8ee9fac1a3f78e15a68791a3/MGdquxUjpFyk57Ft5VXP0fkkm5eo4dazxghC4-_E37pGeKjj_UIjHKlXHiWAHY78d84h_T-FuJi2XwKA0i3BI6fFYniGrzK753uZoFukWkShgIN868rBp_YsoomvUT9qq2tgGiVyuC2-pgTsFUi00L8.png",
      "alt": "MGdquxUjpFyk57Ft5VXP0fkkm5eo4dazxghC4-_E37pGeKjj_UIjHKlXHiWAHY78d84h_T-FuJi2XwKA0i3BI6fFYniGrzK753uZoFukWkShgIN868rBp_YsoomvUT9qq2tgGiVyuC2-pgTsFUi00L8"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/semblog-next-static/banners/trial-gift.png",
      "alt": "Trial Semrush banner"
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://bat.bing.com/action/0?ti=5128787&tm=gtm002&Ver=2&mid=e0c7da1e-5342-45e0-8943-d7e8c58c4208&bo=1&sid=d17452d08fb711efa3b23f6af2d59a2e&vid=d17577208fb711efa1326bae6c95ad88&vids=1&msclkid=N&uach=pv%3D15.0.0&pi=0&lg=en-US&sw=2752&sh=1152&sc=24&tl=The%20Ongoing%20Evolution%20of%20Link%20Building&p=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fevolution-of-link-building%2F&r=&lt=1160&evt=pageLoad&sv=1&cdb=ARoR&rn=964686",
      "alt": ""
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&d=Mon%2C%2021%20Oct%202024%2014%3A21%3A53%20GMT&n=4d&b=The%20Ongoing%20Evolution%20of%20Link%20Building&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fevolution-of-link-building%2F&enc=UTF-8&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&b=The%20Ongoing%20Evolution%20of%20Link%20Building&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fevolution-of-link-building%2F&enc=UTF-8&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    }
  ],
  "publication_date": null
}