{
  "url": "https://www.semrush.com/blog/google-algorithm-update/",
  "title": "Google Algorithm Updates Timeline [2024-2009]",
  "content": "What Is a Google Algorithm Update? \n\nA Google algorithm update is a change to Google’s search ranking systems. These updates are designed to improve the quality of search results for users.\n\nFor example, an update might seek to promote sites with helpful content. Or penalize pages with slow load times.\n\nGoogle confirms the most important ranking updates through its Search Status Dashboard:\n\nBut Google makes smaller updates every day.\n\nSee how much search results are changing in your country and category with the Semrush Sensor:\n\nAnd monitor your keyword rankings with the Position Tracking tool:\n\nThat way, you can stay on top of Google updates. And adapt your search engine optimization (SEO) strategy.\n\nTrack Your Rankings\n\nwith the Position Tracking Tool\n\nTry for Free →\nHow Can You Recover from Google Algorithm Updates? \n\nIf your organic traffic is suffering because of a Google algorithm update, it’s important to understand what changes Google made. Look at any Google guidance, as well as industry commentary.\n\nConduct an SEO competitor analysis on rival sites, too. To see whether they experienced a similar decline in performance. Or to identify factors that contributed to their success.\n\nYou can then take corrective action and, if necessary, adjust your SEO strategy. \n\nBut don’t fall into the trap of taking action too soon. Or making changes based on gut instinct, rather than hard evidence. Otherwise, you can do more harm than good.\n\nAlso, bear in mind that it takes time to recover your rankings—even if you take all the right steps. You might even have to wait for the next algorithm update.\n\n2024 Updates \n\nHere’s a quick overview of the latest Google algorithm updates.\n\nAugust 2024 Core Update\n\nThe August 2024 core update was designed to improve the quality of content found in search results. Based in part on feedback provided by creators and users.\n\nIt aimed to further demote sites that rely on outdated SEO practices. Or produce low-quality content.\n\nIf your site was affected by this update, focus on creating quality content. And improving any content that doesn’t put the user first.\n\nAnnounced: August 15, 2024\nStarted: August 15, 2024\nCompleted: September 3, 2024\nDuration: 19 days, 4 hours\n\nJune 2024 Spam Update \n\nThe June 2024 spam update was designed to make Google better at identifying sites or pages that violate its spam policies. So that it can demote them in search results (or remove them altogether).\n\nHere are some examples of spammy practices to avoid:\n\nCloaking: Presenting different content to Google and users\nKeyword stuffing: Unnaturally forcing keywords into content\nScraping content: Plagiarizing content from other sites\n\nSites that violate Google’s spam policies may receive a Google penalty. Which harms the site’s visibility in search results.\n\nAnnounced: June 20, 2024\nStarted: June 20, 2024\nCompleted: June 27, 2024\nDuration: Seven days, one hour\n\nMarch 2024 Spam Update \n\nThe March 2024 spam update was designed to improve Google’s spam detection abilities.\n\nOn the day the update was launched, Google announced three new spam policies concerning:\n\nExpired domain abuse: Exploiting an expired domain's SEO authority for manipulation or spam\nScaled content abuse: Publishing large volumes of low-quality or unoriginal content\nSite reputation abuse: Hosting third-party content with little to no editorial oversight\n\n So, it’s likely that the update targeted these bad practices.\n\nAnnounced: March 5, 2024\nStarted: March 5, 2024\nCompleted: March 20, 2024\nDuration: 14 days, 21 hours\n\nTip\n\nSemrush’s Position Tracking tool makes it easy to see if Google algorithm updates correlate with changes in your search visibility.\n \n\nMarch 2024 Core Update \n\nGoogle described the March 2024 core update as a “complex update” that “marks an evolution in how we identify the helpfulness of content.”\n\nBefore this update, Google used a single system to identify helpful content. Now, it uses a variety of signals and systems.\n\nThe goal is to promote content that people find useful. And demote unsatisfactory content.\n\nIf your site is negatively affected by a core update, it doesn’t necessarily mean you’ve violated any Google guidelines. It could just mean that your competitors have beaten you. \n\nGoogle advises against trying to “fix” anything if a core update has affected your site. Instead, focus on creating quality content.\n\nAnnounced: March 5, 2024\nStarted: March 5, 2024\nCompleted: April 26, 2024\nDuration: 45 days\n\n2023 Updates \n\nThese are all the confirmed Google search algorithm updates from 2023:\n\nNovember 2023 Reviews Update \n\nThe November 2023 reviews update promotes original, well-researched reviews that help people make good decisions. \n\nGoogle’s best practices for reviews include:\n\nEvaluating from the user’s perspective\nProviding evidence of experience with the review subject\nExplaining what sets something apart from its competitors\n\nGoogle said this would be the last reviews update to appear on the Search Status Dashboard. Because its reviews system would now be improved at a “regular and ongoing pace.”\n\nAnnounced: November 8, 2023\nStarted: November 8, 2023\nCompleted: December 7, 2023\nDuration: 29 days\n\nNovember 2023 Core Update \n\nThe November 2023 core update aimed to improve the overall quality and relevance of search results.\n\nIf your keyword ranking drops after a core update, it’s likely because Google thinks a competitor’s (or multiple competitors’) content is better.\n\nYou can see who’s outranking you in the Keyword Overview tool.\n\nJust enter your keyword and country.\n\nThen, scroll down to the “SERP Analysis” section to see the top-ranking results.\n\nYou can view useful metrics and click through to competitors’ pages.\n\nAnnounced: November 2, 2023\nStarted: November 2, 2023\nCompleted: November 28, 2023\nDuration: 25 days, 21 hours\n\nOctober 2023 Core Update \n\nThe October 2023 core update was designed to improve the overall quality of Google search results.\n\nIt rolled out from October 5 to October 19, with SERP volatility peaking on October 10. According to the Semrush Sensor:\n\nAnnounced: October 5, 2023\nStarted: October 5, 2023\nCompleted: October 19, 2023\nDuration: 13 days, 23 hours\n\nOctober 2023 Spam Update \n\nThe October 2023 spam update aimed to reduce spam reported by the Google Search Central Help Community.\n\nThis included cloaked, hacked, auto-generated, and scraped content. In Turkish, Vietnamese, Indonesian, Hindi, Chinese, and other languages.\n\nAnnounced: October 4, 2023\nStarted: October 4, 2023\nCompleted: October 19, 2023\nDuration: 15 days, 12 hours\n\nSeptember 2023 Helpful Content Update \n\nThe September 2023 Helpful Content Update aimed to promote quality content in search results. And demote content created purely for ranking purposes.\n\nTo avoid being hit by updates like this, try to create content that:\n\nDemonstrates Experience, Expertise, Authoritativeness, Trustworthiness (E-E-A-T)\nIs created for people first and search engines second\nProvides comprehensive, original, and reliable information\n\nAnnounced: September 14, 2023\nStarted: September 14, 2023\nCompleted: September 28, 2023\nDuration: 13 days, 11 hours\n\nAugust 2023 Core Update \n\nThe August 2023 core update was designed to make organic search results better for users.\n\nOut of results that made the top 10, around 10.85% had ranked outside the top 20 prior to the update. On average, websites gained/lost three positions. \n\nThis shows the huge potential for traffic gains following a core update.\n\nAnnounced: August 22, 2023\nStarted: August 22, 2023\nCompleted: September 7, 2023\nDuration: 16 days, three hours\n\nApril 2023 Reviews Update\n\nThe April 2023 reviews update aimed to reward reviews “that share in-depth research, rather than thin content that simply summarizes a bunch of products, services or other things.”\n\nIt affected reviews of products, services, destinations, games, movies, and more. Previously, Google’s review updates focused on product reviews. \n\nAnnounced: April 12, 2023\nStarted: April 12, 2023\nCompleted: April 25, 2023\nDuration: 13 days\n\nMarch 2023 Core Update\n\nThe March 2023 core update was designed to make Google better at identifying quality content. And therefore improve search results for users. (Just like other core updates.)\n\nThe update led to “Very High” SERP volatility, according to the Semrush Sensor. This means that Google’s search engine results pages (SERPs) changed around much more than normal.\n\nIn the U.S., desktop SERP volatility peaked the day after the update began:\n\nAlmost two weeks later, mobile SERP volatility peaked even higher. Suggesting that the March 2023 core update had a more dramatic impact on mobile rankings. \n\n(Desktop and mobile SERPs are often different. Because Google wants users to have the best experience on each device.) \n\nAnnounced: March 15, 2023\nStarted: March 15, 2023\nCompleted: March 28, 2023\nDuration: 13 days, seven hours\n\nFebruary 2023 Product Reviews Update\n\nThe February 2023 product reviews update aimed to reward in-depth, high-quality product reviews. So, it affected sites that publish this type of content.\n\nSERP volatility peaked in the “Very High” range on March 1, 2023.\n\nAs part of this product reviews update, Google published two new recommendations:\n\nProvide evidence of your experience with the product\nInclude links to multiple sellers\n\nAnnounced: February 21, 2023\nStarted: February 21, 2023\nCompleted: March 7, 2023\nDuration: 14 days\n\n2022 Updates\n\nHere are all the confirmed Google algorithm changes from 2022:\n\nDecember 2022 Link Spam Update\n\nThe December 2022 link spam update enhanced Google’s ability to identify sites that buy and sell links for SEO purposes. It was an improvement to SpamBrain, Google’s AI spam-detection system. \n\nGoogle neutralizes the spammy links it finds through this update. Meaning sites previously benefiting from these backlinks may have dropped in the rankings.\n\nAnnounced: December 14, 2022\nStarted: December 14, 2022\nCompleted: January 12, 2023\nDuration: 29 days\n\nDecember 2022 Helpful Content Update\n\nThe December 2022 helpful content update aimed to demote sites that create content primarily for SEO purposes—rather than for people.\n\nDuring the rollout, Google changed its E-A-T (Expertise, Authoritativeness, Trustworthiness) guidelines into E-E-A-T guidelines. Adding in an extra “E” for “Experience.”\n\nThe goal was to reward content creators who demonstrate firsthand experience with the subject matter.\n\nAnnounced: Dec. 6, 2022\nStarted: Dec. 5, 2022\nCompleted: Jan. 12, 2023\nDuration: 38 days\n\nOctober 2022 Spam Update\n\nThe October 2022 spam update was designed to make Google better at detecting spam. Sites found to engage in spammy practices (i.e., violate Google’s spam policies) may have seen rankings drop.\n\nSERP volatility nudged into the High range on the day after the rollout.\n\nAnnounced: October 19, 2022\nStarted: October 19, 2022\nCompleted: October 21, 2022\nDuration: Two days\n\nSeptember 2022 Product Reviews Update\n\nThe September 2022 product reviews update aimed to reward comprehensive, high-quality product reviews. And applied to English-language content only.\n\nAnnounced: August 18, 2022\nStarted: September 20, 2022\nCompleted: September 26, 2022\nDuration: Six days\n\nSeptember 2022 Core Update \n\nThe September 2022 core update overlapped with the September 2022 product reviews update (above). Despite this, SERP volatility remained below 6/10. Lower than we might expect for a core update.\n\nHere’s how volatility compared to the previous core update in May 2022:\n\nAnnounced: September 12, 2022\nStarted: September 12, 2022\nCompleted: September 26, 2022\nDuration: 14 days\n\nTrack Your Rankings\n\nwith the Position Tracking Tool\n\nTry for Free →\nAugust 2022 Helpful Content Update\n\nThe August 2022 helpful content update was the first Google algorithm update of its kind. It was designed to ensure searchers “see more original, helpful content written by people, for people.”\n\nAfter a couple of calm weeks, the change led to high volatility in the SERPs.\n\nIn a supporting blog post, Google said users should create content primarily for humans—not search engines. But still follow SEO best practices.\n\nAnnounced: August 18, 2022\nStarted: August 25, 2022\nCompleted: September 9, 2022\nDuration: 15 days\n\nJuly 2022 Product Reviews Update\n\nThe July 2022 product reviews update was designed to help high-quality product reviews rank higher. And demote low-quality product review pages that offer little value to the reader.\n\nThis Google algorithm update only took six days to roll out, rather than the 14 to 21 days expected. And it was far less volatile than the March 2022 product reviews update.\n\nAnnounced: July 27, 2022\nStarted: July 27, 2022\nCompleted: August 2, 2022\nDuration: Six days\n\nMay 2022 Core Update\n\nThe May 2022 core update followed a volatile few weeks in Google’s SERPs. Many site owners witnessed significant fluctuations in their search rankings.\n\nHowever, Google reminded users that “there's nothing in a core update that targets specific pages or sites. Instead, the changes are about improving how our systems assess content overall.”\n\nAnnounced: May 25, 2022\nStarted: May 24, 2022\nCompleted: June 9, 2022\nDuration: 15 days\n\nMarch 2022 Product Reviews Update \n\nThe March 2022 product reviews update enhanced Google’s ability to identify high-quality product review pages. But was less impactful than the December 2021 product reviews update.\n\nIn a blog post about this algorithm update, Google shared the following information:\n\nProduct reviews updates also apply to ranked lists and comparison reviews\nRecommendations for the “best” products should be justified\nSeparate reviews for products in ranked lists can prove beneficial\n\nAnnounced: March 23, 2022 \nStarted: March 23, 2022\nCompleted: April 6, 2022\nDuration: 14 days\n\nPage Experience Update for Desktop \n\nThe page experience update for desktop made Core Web Vitals a desktop ranking factor. This meant desktop rankings were affected by the following metrics:\n\nLargest Contentful Paint (LCP): The time it takes for the main content of the page to appear\nFirst Input Delay (FID): The response time to the user’s first interaction (Note: Interaction to Next Paint—INP—replaced FID on March 12, 2024.)\nCumulative Layout Shift (CLS): A measure of layout movements that occur during loading\n\nNote\n\nGoogle completed the page experience update for Mobile in September 2021.\n\nPrior to this algorithm update, Google released a Search Console report allowing site owners to review their desktop Core Web Vitals.\n\nAnnounced: November 4, 2021\nStarted: February 22, 2022\nCompleted: March 3, 2022\nDuration: Nine days\n\nTip\n\nCheck your Core Web Vitals and get tips for improving them in Semrush’s Site Audit tool.\n\n2021 Updates\n\nThese are the confirmed Google search engine algorithm updates from 2021:\n\nDecember 2021 Product Reviews Update\n\nThe December 2021 product reviews update aimed to reward sites with rich, in-depth reviews. As opposed to thin, low-quality reviews.\n\nThis Google algorithm update took almost three weeks to roll out. SERP volatility remained High to Very High throughout. And for a few days after.\n\nGoogle introduced two best practices in its blog post about the update:\n\nProvide evidence of your experience with the product\nConsider including links to multiple sellers\n\nAnnounced: December 1, 2021\nStarted: December 1, 2021\nCompleted: December 21, 2021\nDuration: 20 days\n\nNovember 2021 Core Update\n\nThe November 2021 core update impacted the health industry the most. And hit almost every vertical harder than the previous core update.\n\nAnnounced: November 17, 2021\nStarted: November 17, 2021\nCompleted: November 30, 2021\nDuration: 13 days\n\nNovember 2021 Spam Update\n\nThe November 2021 spam update was designed to improve Google’s spam-detection abilities. \n\nWhen announcing the update on Twitter, Google Search Liaison referred site owners to the best practices for search.\n\nAnnounced: November 3, 2021\nStarted: November 3, 2021\nCompleted: November 11, 2021\nDuration: Eight days, one hour\n\nJuly 2021 Link Spam Update\n\nThe July 2021 link spam update made Google “more effective at identifying and nullifying link spam more broadly, across multiple languages.”\n\nIn a blog post about the algorithm update, Google emphasized the importance of qualifying outbound links. In other words, applying rel attributes to:\n\nAffiliate links\nSponsored links\nGuest post links\n\nRead our guide on nofollow links to learn more.\n\nAnnounced: July 26, 2021\nStarted: July 26, 2021\nCompleted: August 24, 2021\nDuration: 29 days\n\nJuly 2021 Core Update\n\nThe July 2021 core update was originally intended as part of the June 2021 core update. But Google wasn’t ready to release everything at once.\n\nThe Google Search Liaison account tweeted: “Most sites won’t notice either of these updates, as is typical with any core updates.”\n\nAnnounced: June 2, 2021\nStarted: July 1, 2021\nCompleted: July 12, 2021\nDuration: 11 days \n\nTrack Your Rankings\n\nwith the Position Tracking Tool\n\nTry for Free →\nJune 2021 Spam Update (Part Two)\n\nGoogle released the second part of the June 2021 spam update on June 28, 2021. (Google released the first part on June 23, 2021.) To further enhance its spam-prevention algorithms.\n\nAnnounced: June 23, 2021\nStarted: June 28, 2021\nCompleted: June 28, 2021\nDuration: 23 hours, 59 minutes\n\nJune 2021 Spam Update (Part One)\n\nGoogle released the first part of the June 2021 spam update on June 23, 2021. (Google released the second part on June 28, 2021.) Both updates were efforts to fight web spam.\n\nAnnounced: June 23, 2021\nStarted: June 23, 2021\nCompleted: June 23, 2021\nDuration: 23 hours, 59 minutes\n\nPage Experience Update for Mobile\n\nThe page experience update for mobile made Core Web Vitals a mobile ranking factor. This meant mobile rankings were affected by the following metrics:\n\nLargest Contentful Paint (LCP): The time it takes for the main content of the page to appear\nFirst Input Delay (FID): The response time to the user’s first interaction\nCumulative Layout Shift (CLS): A measure of layout movements that occur during loading\n\nIn a blog post about this algorithm change, Google explained it would do the following:\n\nAdd a Page Experience report to Search Console\nRemove the AMP requirement for the Top Stories carousel on Google Search\nRetire the AMP badge icon\nSupport signed exchanges (SXG) on Google Search\n\nAnnounced: May 28, 2020\nStarted: June 15, 2021\nCompleted: September 2, 2021\nDuration: 79 days\n\nNote\n\nGoogle completed the page experience update for desktops in March 2022.\n\nJune 2021 Core Update\n\nThe June 2021 core update was the first core update in 2021. Google couldn’t fit many of the planned improvements in, so the improvements spilled over to the July 2021 core update.\n\nFollowing this Google algorithm update, Loc8nearme, Foursquare, MoovitApp, and BusinessyAB saw the biggest average position spikes in the U.S. Perhaps as local businesses were beginning to reopen following COVID-19 restrictions.\n\nAnnounced: June 2, 2021\nStarted: June 2, 2021\nCompleted: June 12, 2021\nDuration: 10 days\n\nTip\n\nCheck out our Google Maps marketing guide to learn more about promoting your local business.\n\nApril 2021 Product Reviews Update\n\nThe April 2021 product reviews update was the first update of its kind. The idea was to reward expert product reviews “rather than thin content that simply summarizes a bunch of products,” according to Google.\n\nGoogle shared these product review recommendations (among others) in a blog post about the update:\n\nProvide insightful analysis and original research\nHave reviews written by topical experts or enthusiasts\nExplain what sets a product apart from its competitors\nDiscuss product benefits and drawbacks\nIdentify and address key decision-making factors\nDescribe how a product has evolved\n\nAnnounced: April 8, 2021\nStarted: April 8, 2021\nCompleted: April 22, 2021\nDuration: 14 days\n\n2020 Updates\n\nAccording to the Search Status Dashboard, there were only three confirmed Google algo updates in 2020. All core updates. \n\nLet’s explore them:\n\nDecember 2020 Core Update\n\nThe December 2020 core update was released before the holiday season. Which raised some eyebrows in the SEO community.\n\nHowever, there are losers and winners with every Google algorithm update. While some sites got less holiday traffic than expected, others benefited from higher rankings.\n\nFor example, eBay gained 44 positions after the first day of the update.\n\nAnnounced: December 3, 2020\nStarted: December 3, 2020\nCompleted: December 16, 2020\nDuration: 13 days\n\nTrack Your Rankings\n\nwith the Position Tracking Tool\n\nTry for Free →\nMay 2020 Core Update\n\nGoogle released the May 2020 core update shortly after the COVID-19 outbreak. Many commenters believed this algorithm update tackled health misinformation in the SERPs.\n\nHealth is a YMYL (Your Money or Your Life) topic. This means that E-E-A-T (just E-A-T at the time) plays an even bigger role in creating quality content.\n\nAnnounced: May 4, 2020 \nStarted: May 4, 2020 \nCompleted: May 18, 2020\nDuration: 14 days\n\nJanuary 2020 Core Update\n\nThe January 2020 core update rolled out in just three days. \n\nGoogle’s Danny Sullivan pointed users to a previous blog post for guidance. This blog post advises site owners to self-assess their content using the Search Quality Rater Guidelines.\n\nAnnounced: January 13, 2020\nStarted: January 13, 2020\nCompleted: January 16, 2020\nDuration: Three days\n\nPre-2020 Major Updates\n\nThese are the most important Google algorithm updates announced before 2020:\n\nBERT Update, October 2019: BERT is a natural language processing (NLP) algorithm that helps Google understand the nuances of users’ search queries. And therefore deliver more relevant results. For example, Google could better understand the difference between “brazil to usa” and “usa to brazil.”\nMedic Update, August 2018: The August 2018 core update was colloquially known as the Medic update because it seemed to target medical sites. Particularly those that didn’t comply with Google’s E-A-T (now E-E-A-T) guidelines. For example, sites making medical claims without substantiating them.\nRankBrain Update, October 2015: RankBrain was Google’s first AI system and deep learning model. It helps Google identify related words and concepts. Google began using RankBrain in April 2015 to better understand new queries (which accounted for around 15% of searches).\nMobilegeddon, February 2015: The Mobile-Friendly Update, more commonly known as “mobilegeddon,” boosted the rankings of mobile-friendly pages in mobile search results. This meant that mobile SEO became extremely important.\nHummingbird Update, September 2013: With the Hummingbird update, Google moved away from matching all words in a query to words on a page. It began to ignore words that weren’t hugely relevant to the searcher’s meaning. This meant Google could better deal with natural language (conversational) queries. \nPenguin Update, April 2012: Penguin penalized sites engaging in webspam tactics—i.e., sites attempting to manipulate search rankings with SEO tactics that violate Google’s guidelines. It made it harder to influence rankings through keyword stuffing and link schemes.\nPanda Update, February 2011: The Google Panda algorithm update was designed to reduce rankings for low-quality sites (with unoriginal, unhelpful content). And improve rankings for high-quality sites (with useful, original content).\nCaffeine Update, August 2009: The Caffeine update made Google quicker at discovering and indexing new content. So searchers could find the latest information more quickly. The update was a change to Google’s indexing system rather than its ranking algorithm.\nPrepare for the Next Google Update\n\nTo prepare for the next Google algorithm update, audit your site and look for opportunities to improve. Semrush has all the SEO tools you need, including:\n\nPosition Tracking: Monitor your rankings for target keywords\nSemrush Sensor: Track volatility in Google’s search results\nSite Audit: Find technical and on-page SEO issues on your site\nBacklink Analytics: Check the quality of your backlink profile\nOn Page SEO Checker: Get optimization ideas for your site\n\nPrepare for Google Updates\n\nwith the Semrush Toolkit\n\nSign Up Free →",
  "headers": {
    "h1": "Google Algorithm Updates Timeline [2024-2009]",
    "h2": [
      "What Is a Google Algorithm Update? ",
      "How Can You Recover from Google Algorithm Updates? ",
      "2024 Updates ",
      "2023 Updates ",
      "2022 Updates",
      "2021 Updates",
      "2020 Updates",
      "Pre-2020 Major Updates",
      "Prepare for the Next Google Update"
    ]
  },
  "images": [
    {
      "src": "https://static.semrush.com/blog/uploads/media/2c/72/2c72c124906f2845c7a2ca078972a70d/google-algorithm-updates.svg",
      "alt": "Google Algorithm Updates"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/fa/84/fa844c619c6f0303249f1c842fa99587/1dab635113541282be983bb1fd5ae31e/AD_4nXcKHxHw-c_sLKsQ3rA3Z-2kJ3KydlVCVF6Knhh0mIAU_NTAO444zC8iSxME7r8fKU8qdDAPKGHCiKIXBhsTBU6DmIn4-45O8sD7xHPe18xk5fqa6lk9z38eR_kPcqBb9QDlwoEpV45_epVNga_a1uclKuY_.png",
      "alt": "Google Search Status Dashboard lists all incidents reported for ranking"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/5b/7c/5b7cb633c89f0db3706db28631b29120/61dc4f8a48c7f271b0bd8ac37475e77e/AD_4nXdAxUFG8oYnU7j3hR-gU8LDSw6XRBPTtHPIsH_MuvTr1EailhhJ-FZNvvFKG3UI2tX2bgsw0-pCwo3unzVChxsxIWSBz2fG6EXSXyAGW3zSO__vVE1PPVKPWyJtQAv4f58-rIjK4OO06s3JqPUddbmSourd.png",
      "alt": "Semrush SERP volatility graph shows very high volatility in the last 30 days"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/4c/54/4c546963512006501ebb0b0367013432/178d43a391a566512a629704a89da837/AD_4nXfkrWC32rSsqZAwXdJ27lUct4kYy1f-vegznUH-yxsevRQjNQRU-e1RzuVtjY5PYPykn5axwCs4Hog9sqV_GrQYABUpSaCwpsj9W91CgS2sZ8FFZzOFHjWmu51u3Ate8Xbj_3pKXD3Z1iZY_AmPq_oDOHwa.png",
      "alt": "Position Tracking visibility graph shows spikes and drops in keyword rankings over the week"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e9/bb/e9bb9dacbeafdb42164ef9329ec7b6f5/8095f7946f19299ac7a14e81604ea529/AD_4nXdgjXXqMNtFuBalZzpy5nkjHJ0eOhVQSuGwmi6jzTPvQyJv1hjm2LUe3SDv_lhfWZOK6ZBzZpGzDnsp6cnCZXZmuI2NT7Rv0ylJ1vgnDLQhQxGmvp0RDJo79mUCDd7DpiLDTv3fzkMXf15yNeP-5UZTAMzF.png",
      "alt": "Google update marked on visibility graph with pop up explanation box describing the Google algorithm update"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/d1/0d/d10d2965bec2df41a16a60c33d8ad0f4/28ffa2a7772e987b903bc1ee5312c85c/AD_4nXecsyPwGtjoWOYR5lWYGfsS45xX7OK6hD5cQ08Kbj0H4pBiDc87S6R9fqYkrT7gikc0DBzY8SduhXCK6E24KHJdDkSo0NxFx2aBoBYB8lo8ZV6dTMSEf4oqjWvGhhWat_2A7xAPoTD5b8n5ckRj0Y51QXpE.png",
      "alt": "search for keyword in Keyword Overview tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/61/d7/61d720c88e7de26ab510437203471e02/f82b31f515fd020341a502e276b075ef/AD_4nXf4LuXE2r2BUq9DmXEFQLoQe_jKY8-yM9mEwh06a_pZnFp70uCu89Df0WkZBwzC9KQ5is8yqZX6Vj59HQfBl_qk-T-OcgOk-01RI2Rv7BA8zZho-kHRBfkFOlTOfLKcxoSsNkj15hcTJ1DS24rXY4dBCS4O.png",
      "alt": "SERP analysis section shows top urls for the keyword and their data"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/1d/7a/1d7a0050a21459cf3ca69da15ec021c3/9cee1a0a47a910f89beccc99630598ef/AD_4nXcew5iUs9X9Iiu_jf8_WbvoE4aB9s99T4pJxa0w8zXwINfx10VQC4pehMGYdaza6838E_2uSdtM-4qbyhQJUnwa_VKuweGhzgmG06RlfQrPlx-kTJ_bxMCOk8VTYz1iMKtao0JMVnlpm-cqHZetd1n9dnxP.png",
      "alt": "SERP volatility graph for the October 2023 Google Core Update shows a normal range"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/a4/4d/a44d33acb9b1777e99147a5c51a33382/5115a75e3472a4c7555126a47d818367/AD_4nXd-vUWcOIOB9lAyhAlF7tcUdbylCYkOmgEH8N4ujluOPV2TzP_W9ijfdiMKJufbVNHMCvPMMGYbv3t238qAudjG_Y-GvfcpUJ12gacSwdS0SMTKWMimSUWl_Cp149PMuM8phRBYX2QZc3yClWenivADCvE.png",
      "alt": "SERP volatility graph for the March 2023 Google Core Update shows a very high range"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/3f/39/3f396716fe0fce103edc90c944662452/5457283f4859800a6b136e9151ac2c51/AD_4nXeFX6KL3w34D2rFQ-muzheiILFsQOkyI0Tnyne1BEuHHKc-d_FHNwT9JbEjjP6h3cL9kSjHoMwkiquvGmhy-Rp4L5rUBm0l4FDNZV9eNTKiWnTzq-CLvzKpar8UbKlTCEijp440FuoPJCxEGKOHflYLVGri.png",
      "alt": "SERP volatility graph for the March 2023 Google Core Update in Mobile shows a very high range, higher than desktop"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/a6/83/a6836f4aef5d19b94f3f5699aaad105e/1a1f47246dbd42ab4099d47b7d9596e5/AD_4nXd9eaAGJvUeZ_b7BEkp_aku1tZb3_44QEPtHMJt0wcfqO6PsxGOuJJLnXnYa4kTNGz9OtVCJiRgpv65wOGngwp8nWVOv8LETzgrPr3Zd84C0SuHSTEEsxy0Fofl147GAkyrtwCJ9-q7KxuMNrBHphnUhJlI.png",
      "alt": "SERP volatility graph for the February 2023 Product Reviews Update shows a peak in the very high range"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/14/89/148990b87088200bfbd3e3b4375c9a01/256772bf891a79cb254c2faafdcd0848/AD_4nXciOprz461IER2cYYlgauLobfzTbqk3QbQDztqnO8XJ1FwUjb7jIGBSOj2l9uJqz4SMIy1KTkjG-_PCemRqBfLlc54uyPwbVFulJS7lqOTwGb9zCe88eW0R2UiOol1WiXBCrFauUUHyZQiGN0-qLEM4o-gU.png",
      "alt": "SERP volatility graph for the October 2022 Google Spam Update shows a normal range for the last 30 days with a spike"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/f3/d3/f3d384d11685f7201778aa0ee5cd5467/e6ec38d280a08e10a1f31551ce23759f/AD_4nXdpra1mbMMrkREORB_UrdpN7VAjQ60C3dU-gds6yIp01uIWCCrMO-SNBs8YYf9qsfJkoxh_b-Vj0_DzLL2feyuG8dAudO2EnS1pLeH9oVj7uvWcUjnLtEt5hYF5Wiap6eercZukUzkeNDCeAOZqYBvMHAM.png",
      "alt": "Volatility Trends Comparison graph shows the May update is more volatile than the September Google Algorithm Update"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ca/c8/cac8e44e2283b74852bab375fc330a64/69e931c059eb626460e5e5ebeb2bf913/AD_4nXcr_O6OPA9mBJK26iKgTlVfM4fDtdL3APciCNWQe_VK_jigM4lK1UGuV1Zgr_YAFQS2gr0YDP8CkD7p5gEyYtYkMy5V5XFac2wxvPSe0pNE_KJxTuPgMLiqanwCFBLhc34_tsShsjcs9NF8jECAB2-a_BHL.png",
      "alt": "SERP volatility graph shows spike into very high range"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/31/32/31321cb2bfca69f6c5fb2ad7a0fb3d4e/9e00783766431290b72272fdc1a0f4f0/AD_4nXdTwd9dRGrqsODQ6hvv-BOrBHsP-o6k_4FgxTL2jE6bCePAaKMRYAi6aAbUR-9GkpSfpthLVyW_5_UmkrjrWwaxHfClnt1rCP3kPuo9FrxZ-Ln_onE5CKsaKKx1lhtSYliBpSA-8fkhHL3-ODpLK9MuRFgP.png",
      "alt": "Rank volatility change comparison bar graph shows the March 2022 product reviews update is more volatile than the July update"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/04/34/04347a59c8235409205bfa8b2065f595/5fdd818a38ca23c483224833a9077107/AD_4nXfpbjW5Xi9PZNA1B0ck0zIAgLJx7HcDie7BPLp0EjghGLWrhuVyyXR16QmGtkWa-cBEgwk9_bHqeG5JGZqXRHGdF1g6YBcobtvdehT1pk-0ogxcKVy048d45bDlrIhdSFZ_dnp3m2y9eHkQm8WwXZMZkiXM.png",
      "alt": "SERP volatility graph shows waves of spikes during the Google algorithm update"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/b1/cc/b1cc3e91e5d268145dad5e3fb87afd2c/f41353c1d091da0bf008c1a951abce58/AD_4nXclU6I339D9U4ZVvi3Wzn-mmq6i-tx7ozxAlkeu2ZOANwIKCJOQzkvecDHCr5zRDdpjEL5ieqXpjSX5LUjoAghRYT-SQw80ae5FCBVX7-FvqZv51owKyWCbUeKYjJGL-tWSOYGDJBWw3XY8164Yr8eSPrfQ.png",
      "alt": "Peak volatility comparison bar graph shows the December 2021 reviews update had greater peak volatility in many business categories"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/fc/bf/fcbfc83a3c7cd4adf9d54c13b88f1b69/50a939e1ecc7700377c0e82c0495f533/AD_4nXdGNeDHdtQ9uLFjEyj4FxInpOdrBYUZGDjx-OUAum8LebaJuzAyRIVTKNIIutgumJtIGtziVyiBhqL2Pdc8e12hetnMFPOVvbyvWd9di2dT3c3P8DpyKDGVep2PW9p6MrC1377mGU5EPdp0Q3FHRa-DT4P2.png",
      "alt": "SERP volatility graph follows the December 2021 google algorithm update with a stretch of high volatility"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/7e/52/7e52314c2ccafa8ade745752f7e4bb6c/3dfd89a64a306f3efc8e31bd4755112b/AD_4nXdbf35wreZ638kadtcbFe7pFFeBsLHC5R-0-tpjWm3tCKFGM3c_Kh2NYt6PDOlo-rrQFkolgAx-wpXLqAAlomJ6Tz7JHY8MHidiIoWZet2Ei37JQUxmu-vq_oWZ7VaMEUQknzpi9jSWJ0m_4F3P-FVNP5g.png",
      "alt": "rank volatility increase comparison graph shows the July vs November 2021 core updates effect per business category"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/59/96/5996c0d17427c17f6916a41db480a98e/d3db443410f39915231911a9175585a6/AD_4nXdyF0eu4KTbS4eLjzm96Jx4-sA-nA04QD4_Q0MolVmBh4KYMhrszwPQoZlRXs6lEyJZAGc4ZUZO0BCCjmi9K6D082PQyrgfDo4hOow8Zl3WuDs2Q__5-kpYPiLJ7ZbC1KQ_wom1aceh70W455rnj1kRCnw.png",
      "alt": "Twitter post says \"As part of our regular work to improve results, we've released a spam update to our systems. This November 2021 spam update should be fully rolled out within a week. We encourage sites to follow our best practices for Search.\" And it links to Google Search Essentials guide."
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/c3/49/c34909ea968e5e1569d4af1786709de4/952fe7f6b8c8c6c6f461a7ea51c5d391/AD_4nXe8Om3WrQEuZk2bdsXSBDBKb2MMh-c9izmPcSLhefBEG-gnml41mZFKyyEf8MejyWCgEEnHPM4s0-6PRvIkrbIDPskxLMypaKy4jfN4R9khU8aqNjs3_zs8vSVlODZ7lIKUm3hJhdalsfrG62GXGtqOVNLO.png",
      "alt": "Organic Research tool overview shows estimated traffic trend for Loc8nearme, which is a slow rise in traffic following the update"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/20/d4/20d4a9c4ae8dc02ae341d2c06b567bba/94e226bf40293878a8757d298d141d7a/AD_4nXduUc2Ipye5Zzd-DVmQqOeUwTtQfYsEhS-KSH7IfRfJOkFzsqNJY4_CfwlhTb9TMLe40-O3jYfcgQe_jPZfRliHXabxWbzxTMHpwepfTc8PE459H5h5J_WapjLF9Ub8ovjNL-vuF5XD7QCSdMmakp5qn5fz.png",
      "alt": "Tweet from Dr. Marie Haynes says \"This didn't age well.\" in response to another tweet stating \"Actually, we try to minimize major updates right before the holidays.\""
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/semblog-next-static/banners/trial-gift.png",
      "alt": "Trial Semrush banner"
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&d=Mon%2C%2021%20Oct%202024%2014%3A20%3A35%20GMT&n=4d&b=Google%20Algorithm%20Updates%20Timeline%20%5B2024-2009%5D&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fgoogle-algorithm-update%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&b=Google%20Algorithm%20Updates%20Timeline%20%5B2024-2009%5D&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fgoogle-algorithm-update%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://bat.bing.com/action/0?ti=5128787&tm=gtm002&Ver=2&mid=90abdee7-b6fb-4122-a25f-bd02458e2904&bo=1&sid=92c55f308fb711efabf7572a21c9ed33&vid=92ca80908fb711efbe81fd699949e7a7&vids=0&msclkid=N&uach=pv%3D10.0.0&pi=0&lg=en-US&sw=1680&sh=1050&sc=24&tl=Google%20Algorithm%20Updates%20Timeline%20%5B2024-2009%5D&p=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fgoogle-algorithm-update%2F&r=&lt=775&evt=pageLoad&sv=1&cdb=ARoR&rn=504040",
      "alt": ""
    }
  ],
  "publication_date": null
}