{
  "url": "https://www.semrush.com/blog/google-analytics-4-ecommerce/#how-to-set-up-google-analytics-4-with-ecommerce-tracking",
  "title": "Data to Dollars: Ecommerce Analytics with Google Analytics 4",
  "content": "Google Analytics 4 (GA4) was built with ecommerce in mind. \n\nUsing website analytics data, you can better understand user behavior—and make more strategic decisions to increase sales.\n\nGA4 ecommerce analytics can help answer questions like:\n\nWhich products do users view most? \nWhich pages drive the most conversions?\nWhat percentage of users complete a purchase from the check-out page?\n\nLet’s take a look at why you should be using GA4 and how you can successfully use it to track, analyze, and improve your ecommerce performance.\n\nWhat is Ecommerce Tracking in Google Analytics 4?\n\nGA4 is an analytics platform that allows business owners and marketers to measure, monitor, and analyze traffic and performance on websites and within mobile apps. \n\nEcommerce tracking is a specific implementation of GA4 for online stores. \n\nGA4 uses event-based tracking. This means that each user interaction—from a page view to a button click—is logged in GA as an “event.”\n\nGA4 ecommerce tracking relies on “ecommerce events.” When you define an ecommerce event, you enter event-level parameters and item-level parameters (though these are optional).\n\nHere’s an example of a purchase journey report from the Google Merch Shop demo account:\n\nWith GA4 ecommerce events, you can track when users:\n\nAdd payment info\nAdd shipping info\nAdd to cart\nAdd to wishlist\nBegin checkout\nPurchase\nRefund\nRemove from cart\nSelect item\nSelect promotion\nView cart\nView item\nView item list\nView promotion\n\nThis will allow you to monitor and analyze a specific range of interactions that occur before, during, and after the transactions made on your ecommerce platform.\n\nFor example, you can find out which products your users view, whether they add them to their shopping cart, and if they proceed to make a purchase.\n\nAlternatively, you may want to know information about your customers' average transaction value or the average number of items purchased per transaction.\n\nWith so many different metrics to track and analyze, ecommerce tracking in GA4 is a vital tool for any ecommerce business looking to grow.\n\nWhy Should You Use GA4 Ecommerce Tracking?\n\nBy measuring and analyzing your ecommerce website performance, you can make data-driven decisions that will positively influence your sales, revenue, and profit.\n\nWith data, you can identify elements of your online shopping experience that need improvement.\n\nLet’s say your data shows that 30% of your potential customers begin the checkout process but never complete a purchase. \n\nIn this case, you may discover that people tend to drop off at a certain place, like the payment page. Based on that information, you could then test ways to reduce drop-offs and improve conversions on that specific page. \n\nFor example, you may try adding a new payment method. Or you might try offering free shipping. \n\nThen measure the results by monitoring performance after the change has been implemented. \n\nDid the conversion rate improve?\n\nIf so, that’s great. On to the next improvement opportunity. Or you might try additional tweaks to improve performance even more.\n\nIf the test wasn’t successful (it didn’t improve conversions or made them worse), then you’d want to try testing another change. \n\nRepeat the process with the insights you uncovered in your ecommerce analytics to create a system for testing and improving store performance and revenue. \n\nGA4 vs. Universal Analytics: Understanding Changes to Ecommerce Tracking\n\nCompared to the previous version of Google Analytics (Universal Analytics), GA4 offers more advanced tracking capabilities for ecommerce businesses. \n\nStarting July 2023, GA4 completely replaced Universal Analytics (UA) as Google’s analytics product offering. All customers using UA will lose access to the web interface and API on July 1, 2024.\n\nAccording to data collected by Datanyze, Google’s Analytics products (including Global Site Tag, GA, and UA) are used on about 70% of websites.\n\nGA4 uses a more advanced and user-centric approach to website and app analytics.\n\nUA focused on tracking sessions and pageviews. GA4 tracks individual users across devices and platforms and provides greater insights into the customer journey.\n\nIn addition, GA4’s event-based tracking allows businesses to define and track custom events that are important to their unique goals. Events can include clicks, form submissions, video views, and more.\n\nThe enhanced ecommerce tracking features provide detailed insights into shopping behavior, product performance, and checkout funnel analysis.\n\nUA can no longer be implemented for website analytics tracking, but it is still possible to view historic data until the cut-off date (July 1, 2024).\n\nHow to Set Up Google Analytics 4 with Ecommerce Tracking\n\nBefore you can track any ecommerce events, you need to set up GA4.\n\nTo complete the steps below, you will need access to your Google Analytics account and your website source code.\n\nThe following steps are detailed in Google’s instructions to set up Analytics for a website and/or app.\n\nGo to Google Analytics and click “Get started today.” If you don’t already have an account, you’ll need to take a few minutes to set one up. \n\nIf you already have an account, you’ll be redirected to Google Analytics or prompted to sign in.\n\nOnce you reach the Google Analytics homepage, click the gear icon in the lower left corner.\n\nWhen you see the following screen, click on “Create.” Then, select “Property” to create a new GA4 property.\n\nStarting with the following screen, fill in your business and website details until you get to “Data Collection.”\n\nYou should see the following options to start collecting data. Choose the platform that you wish to start collecting data from. (e.g., if you’re tracking a website, choose “Web.”)\n\nNote\n\nIt’s possible to implement data collection on multiple platforms. You will need to follow the below steps for one platform first before repeating the process.\n\nThis will bring you to setting up a new data stream. Input your website URL in the box. Then assign a “Stream name.” This is just an internal name used to identify the data and reports. It’s fine to just put the name of your business or website.\n\nFinally, click “Create stream.”\n\nYou will then be taken to the “Stream details” page, which includes your “Measurement ID.” Measurement ID is your unique code that’s used to connect your website to the GA account. Click “View tag instructions.”\n\nClick the “Copy” button and follow the instructions to manually install the tracking code on your website.\n\nSetting Up Ecommerce Tracking\n\nWith GA4 installed on your site, you’ll need to add code to send data to GA about the ecommerce events that take place on your website.\n\nThis involves two steps:\n\nAdding the event script\nAdding the event listener to trigger the script\n\nLet’s go step by step through the process.\n\nStep 1: Add the Event Script\n\nThe first step is to pass information to gtag (the Google tag used for GA4) about the event that took place or might take place on a given page. \n\nTo do this, you’ll add the event tag and items array (code that includes details about the items involved) as a script on the page. \n\nIt looks like this:\n\nThis code communicates that an event happened. \n\nLet’s break down how it works: \n\nIn this case, the event name is “purchase.”\n\nThen it includes details about the event, also known as the event parameters. Things like the value of the purchase (“value”) and the transaction id (“transaction_id”).\n\nFinally, it also includes what’s known as the items array. This bit of code contains details about each item or product involved in the event. Such as the item’s name (“item_name”) and the item’s brand (“item_brand”). \n\nThe event configuration tag will need to be added to your website or template code. The variables like product names and prices will need to be dynamically generated. \n\nDynamically generating the event configuration tag means that the details will automatically be filled in when the page loads or the event is triggered. It will fill in the specific details like the value of the order based on the order that the user placed. \n\nImplementing these tags will likely require a developer. But refer to the GA4 ecommerce documentation for details on where and how to add this code to your website. \n\nAdding the code as shown would automatically fire the event each time this page loads. This works when adding code specifically to a page that indicates an action is completed (for example, on the order confirmation page). \n\nBut if you want to trigger the event when the user takes a specific action like clicking a button, then you’ll need to wrap this code in a listener. \n\nStep 2: Add the Listener\n\nAdd an event listener to the page to fire an ecommerce event only when a user takes a specific action. For example, if you want to fire an “add to cart” event when a user clicks a button to add an item to their cart.\n\nEvent listeners are pieces of code that “listen” for an action to take place on your website. When that action happens, it can then run specific code in response, such as sending an event tracking code to GA4.\n\nHere’s an example of the above code modified with an event listener:\n\nNow, instead of firing whenever the page is loaded, this code would only be executed when someone clicks on the “Purchase” button. \n\nNote\n\nIf you prefer or if your website is not using gtag.js for Google Analytics, you can use Google Tag Manager (GTM) and data layer variables to implement ecommerce tracking. Read our guide to Google Tag Manager for details.\n\nOnce you’ve added these two pieces of code, you can now test the implementation. Visit your website and perform the action associated with the event (e.g., clicking “Add to cart”). Monitor your GA4 real-time report to see if the event appears in your analytics data. \n\nFrom there, you’ll need to add similar code to handle each of the events that you want to track in GA4. \n\nGoogle Analytics documentation provides extensive examples and code snippets for this can be implemented to track different actions across your site. \n\nBut first, you should decide which actions you want to track.\n\nKey Ecommerce Events to Track in GA4\nProduct Impressions\n\nBy measuring product impressions, you can understand how many people are viewing a specific product. This can indicate how popular an item is—and how visible it is compared to other products.\n\nProduct impressions refer to the total number of times that a product listing is displayed to a user via your website or mobile app.\n\nFor example, each time that a product appears in the viewport of the device they are using, it will count as an impression. Looking at Amazon, this screen would generate four separate Product Impressions (one for each product shown):\n\nIt is typical for a user to generate impressions on multiple products in a single visit.\n\nProduct Clicks\n\nMeasuring Product Clicks indicates how interested a user is in learning more about a product after their initial view. \n\nProduct Clicks refer to the total number of times that a product listing is clicked on by a user.\n\nA user must first view the product—a Product Impression—before clicking on the listing to view the individual product page.\n\nCombined with impression data, it is possible to calculate the click-through rate (CTR) and gauge which products attract the most attention from website visitors.\n\nProduct Page Views\n\nTracking Product Page Views (or product views) tells you how many visitors landed on a page dedicated to a specific product. These pages are also known as the product detail page (PDP). \n\nLike this page for the Amazon Kindle Paperwhite:\n\nAlthough a Product Click will result in a Product Page View under normal circumstances, this isn’t always the case.\n\nA user may click on a product, but not end up on the product page. This could be due to loading errors, a drop in internet connection, or they exit the page before it loads.\n\nYou can use Product Page View and Product Click data to identify potential issues with site navigation or usability.\n\nAdd to Cart\n\nTrack which products are being added to user carts. This data will help you capture the purchase journey and identify steps where users drop off before completing a purchase. \n\nAdd to cart refers to each time a user progresses from a product page view to adding the product to their shopping bag.\n\nThis action reflects a positive intention towards a user completing a purchase.\n\nHowever, it doesn’t guarantee that a transaction will be made.\n\nResearch from Baymard shows that the average cart abandonment rate is 70.19%.\n\nUnderstanding which factors influence users to complete—or abandon—their purchase is extremely useful for optimizing the checkout process.\n\nRemove From Cart\n\n“Remove from cart” is when a user decides to remove an item that they have previously added to their shopping cart or basket.\n\nBy monitoring this ecommerce event, you can identify products that are frequently removed from carts. From there, you can explore reasons that users may change their mind about making those purchases.\n\nThis action is often initiated by clicking a \"Remove\" or \"Delete\" button or icon associated with the specific item within the shopping cart interface.\n\nReasons users remove an item could include friction associated with usability, limited payment methods, shipping costs, or delivery options.\n\nPromotion Impressions\n\nBy analyzing promotion impressions, you can determine how many views a promotion gets. And by pairing it with Promotion Clicks data, you can calculate the click-through rate. This is an indicator of how successful that particular promotion might be.\n\nPromotion Impressions are the number of times a specific promotion was viewed.\n\nPromotions can include any type of promotional message or offer. Discount codes, coupons, email sign-up forms, and product banners could all be promotions. \n\nPromotion Clicks\n\nA Promotion Click refers to the number of times that a specific promotion was clicked by users.\n\nBy using the number of clicks combined with impressions, you can calculate CTR: (Clicks / Impressions) * 100.\n\nThis tells you which promotions trigger the highest rate of engagement.\n\nThen you can use this data to create new promotions designed to boost user interaction. \n\nFor example, say you discover that a promotion offer for a 25% discount seems to generate more clicks than one offering “Buy One, Get One 50% Off.” You may use that data to shape your future promotions and overall marketing strategy. \n\nCheckout Page Views\n\nUsing GA4 ecommerce tracking, it’s possible to understand how many users initiate the checkout process and how far into the checkout process they make it. Use this information to identify barriers or friction points in the checkout process that lead to cart abandonment.\n\nOne key event to track is the number of Checkout Page Views.\n\nCheckout Page Views refer to each time a user views the checkout page. \n\nThis page is typically where customers review their items, enter shipping and payment information, and complete the final steps of the purchase process.\n\nPurchases Completed\n\nTracking the number of Purchases Completed is a fundamental metric. It represents the number of customers who have successfully bought products or services from the website.\n\nImage Source: ReferralRock\n\nYou can use the total number of purchase events as a standalone metric. Or use it to calculate additional metrics such as checkout conversion rate and cart abandonment.\n\nRefunds Processed\n\nMeasuring the number of Refunds Processed can be useful to understand customer satisfaction with the shipping and post-sales support.\n\nRefunds processed refers to the completion of a refund transaction.\n\nThis occurs when a customer returns a product or requests a refund for a purchase they previously made. \n\nThis information can be used to understand issues such as product quality, shipping issues, or discrepancies versus a product description.\n\nAdditionally, measuring refunds processed can also assist with financial tracking and inventory management.\n\nExamples of GA4 Ecommerce Tracking Reports\n\nOnce your GA4 ecommerce events are in place, then you can open your GA4 property and begin tracking ecommerce purchases and other website performance metrics. \n\nUsing your ecommerce data, GA4 provides a broad range of analytics.\n\nFor example, you can track the path to purchase and how many shoppers complete each step in the purchase journey.\n\nAccess this report from within GA4 by clicking “Reports” > “Monetization” > “Purchase journey.”\n\nYou can also track first-time purchases versus returning customers.\n\nThis report lives under “Reports” > “Monetization” > “Overview.”\n\nYou can track which items were viewed versus how many times they were purchased. This can help you quickly spot outliers like products that are converting at a higher or lower rate than other products.\n\nAccess this report: “Reports” > “Monetization” > “Ecommerce purchases.”\n\nZoom in on each step of your checkout process to see where customers abandon their purchases. Then identify ways you can optimize that specific step to improve overall conversion rates.\n\nFind it: “Reports” > “Monetization” > “Checkout journey.”\n\nCompare which devices people use to browse your ecommerce store and the conversion rate for each step in the checkout process.\n\nAccess this report: “Reports” > “Monetization” > “Purchase journey.”\n\nEcommerce KPIs and Metrics to Track\n\nUsing the events mentioned above, you can use the data to better measure and understand key ecommerce KPIs and metrics.\n\nPurchases\n\nBy analyzing purchase data, your business can make data-driven decisions to improve the overall user experience that leads to increased conversions and revenue. \n\nPurchases refer to completed transactions.\n\nTracking purchases provides insights into sales performance, revenue generation, and customer behavior. \n\nRevenue\n\nRevenue is a crucial financial metric for ecommerce businesses and is central to understanding the financial health and performance of an online store.\n\nRevenue refers to the total income generated by your ecommerce store, calculated by the sale of products during a specific period. \n\nTo calculate revenue, you sum up the individual purchase amounts from all completed transactions within a defined time frame.\n\nConsistent revenue growth is often a primary goal for ecommerce businesses. Analyzing trends and declines in revenue can prove essential for strategic decision-making.\n\nIt can be used to calculate additional metrics.\n\nWhere revenue represents the total income generated, it is used to calculate profit.\n\nProfit is the income left after subtracting all expenses, including the cost of goods sold (COGS), labor, marketing costs, and other operating expenses.\n\nAverage Order Value\n\nMeasuring average order value (AOV) provides valuable insights into customer purchasing behavior and the performance of an online store. It can be useful in optimizing pricing, marketing, and sales strategies to maximize revenue and profitability.\n\nIt’s the average amount of money spent by a customer during a single transaction or order. \n\nIt is calculated by dividing the total revenue generated from all orders by the number of purchases within a specific time period. \n\nAOV = Total revenue / Total purchases\n\nIf you have a high volume of orders, even marginal differences in AOV can have a significant impact on your total revenue.\n\nConversion Rate\n\nThis metric measures the percentage of website visitors who take a desired action—or \"convert\"—out of the total number of visitors. It’s also useful for understanding the percentage of people who go from one step in a process to the next step. \n\nThe total conversion rate (or site-wide conversion rate) is the number of conversions divided by the total number of visitors, multiplied by 100.\n\nThis tells you, on average, what percentage of your total website visitors convert or make a purchase. \n\nBut you can also analyze the conversion rate between any two steps within your customer journey.\n\nUnderstanding the conversion rate between each step of the journey allows you to identify areas that are doing well and others that need improvement.\n\nFor instance, in the above example, the conversion rate between viewing a product and adding the item to a cart is about 24%. That means approximately one in four people who view an item will end up adding something to their cart.\n\nWhen determining what is a “good” or “bad” conversion rate, you can compare your ecommerce business to industry benchmarks.\n\nFor example, the graph below shows drastic differences in ecommerce sales conversion rates between Germany and Italy.\n\nImage Source: Nosto\n\nIn addition to country, conversion rates also vary widely per industry.\n\nThe graph below shows the vast differences between “Baby & Child” and “Arts & Crafts,” for example.\n\nImage Source: Smart Insights\n\nFor more ecommerce industry-specific stats, request a copy of our “State of Ecommerce”report.\n\nShopping Cart Abandonment\n\nTrack this metric to understand how many would-be customers leave after adding items to their cart but before completing a purchase. \n\nUnderstanding the reasons behind cart abandonment and taking proactive steps to address them is crucial for optimizing the checkout process and improving conversion rates.\n\nTo calculate your shopping cart abandonment rate:\n\nFirst, calculate your rate of successful sales. Divide the total number of completed transactions by the number of shopping carts created. This gives you the success rate.\nThen, subtract that number from 1 to calculate the abandonment rate. \nFinally, multiply by 100 to create a percentage. \n\nCart Abandonment Rate = (1 - (Total Transactions / Shopping Carts Created) * 100\n\nThere are many reasons for cart abandonment:\n\nPrice concerns may cause users to reconsider their purchase\nProblems with payment methods or concerns about payment security\nHigh shipping fees or added taxes\n\nSometimes, external distractions like receiving a phone call or navigating away from the site can interrupt the checkout process. \n\nWhile shopping cart abandonment is a common challenge in ecommerce, addressing it presents an opportunity for businesses to potentially recover lost sales.\n\nFAQ\nWhat is the Data Layer? Why is it important for ecommerce tracking in GA4?\n\nThe Data Layer is a JavaScript code that stores structured information about a website's user interactions and events. \n\nIn GA4, the data layer provides the ability to structure, customize, and transmit data from your website to GA4 in a way that allows for detailed analysis of user interactions. This includes details like the product name, price, and size. Advanced users can also configure custom dimensions to further segment and customize shopping behavior. \n\nWhich events should I track with GA4 ecommerce tracking?\n\nThe events you should track with GA4 ecommerce tracking depend on your business objectives and the user interactions that are most critical to your success. \n\nMost commonly, you’ll want to track Product Page Views, Add to Cart events, Checkout Page Views, and Purchases Completed. These metrics will give you a general idea of the shopper journey and data to analyze and improve site performance.\n\nBut be careful to strike a balance between tracking enough events to gain meaningful insights without overwhelming your analytics with irrelevant data. The tracking data you generate should be used to optimize the user experience for better performance and revenue growth.\n\nHow do I improve ecommerce metrics?\n\nTo improve your ecommerce metrics, you first need data to act as a baseline. Pick the metrics that matter to you, and ensure that you are correctly measuring them via ecommerce tracking in GA4.\n\nOnce you have this data, you should understand how your metrics compare to others in your industry. This generally involves using industry benchmark reports. These numbers help you evaluate your site’s performance relative to competitors and other sites.\n\nWith that data in hand, you can prioritize the metrics where your performance is lower than industry standards. Then, create a plan to test and optimize different parts of your website targeting those specific metrics. \n\nRead our guide on Ecommerce Website Optimization for specific tactics and strategies to help you improve sales, revenue, and profitability.",
  "headers": {
    "h1": "The Ultimate Guide to Using Google Analytics 4 for Ecommerce",
    "h2": [
      "What is Ecommerce Tracking in Google Analytics 4?",
      "Why Should You Use GA4 Ecommerce Tracking?",
      "GA4 vs. Universal Analytics: Understanding Changes to Ecommerce Tracking",
      "How to Set Up Google Analytics 4 with Ecommerce Tracking",
      "Setting Up Ecommerce Tracking",
      "Key Ecommerce Events to Track in GA4",
      "Examples of GA4 Ecommerce Tracking Reports",
      "Ecommerce KPIs and Metrics to Track",
      "FAQ"
    ]
  },
  "images": [
    {
      "src": "https://static.semrush.com/blog/uploads/media/3a/e4/3ae4b57de1d4b5a8c09e6ec36590f7e8/666f6fd3584c76ab9d054ed4f9628379/google-analytics-4-ecommerce.svg",
      "alt": "Ecommerce Analytics"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/47/82/478206d94c591321f4ffe87062c39e83/7e1d46519ae682f96986152657b8fcef/UTC-Gz1XMTZe9PgaxN91pXhKL-r1UJFm9RVpsONkFlfbXibA9TUlyhPfBsNN3Z4jRU2q12NdVid282GD4ZfPh-rllK1yZkNsRPCP4UVAmcNHzD3XXxAX-5_cUG58ds7ep7anvwfen7GZFRBmds3XzUE.jpeg",
      "alt": "A purchase journey report from the Google Merch Shop demo account"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/b8/50/b8501ef6b23ddeb0834ff8349fa0adb5/d391ae126f263a8c1a818c7a8ec33b2c/jFREHUQW7_DZJbldVCZUNoOXB2jX4TL0JGtksubnqFsxBtu1JsnGaAlX3BDiF54VGojkDImQPX8mle4ptbxclNmU1eBe593Hp81gCBSgv5OrVUi7_t8Sa2qOJGd6RHjzve9kkkuc4cbw5ajHjR9QZcI.jpeg",
      "alt": "A table comparing hit type in Universal Analytics property and measurement in GA4 property"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/15/f3/15f33ff49d7659cbbbfd3ab24dcda2ff/75e97fdca56516b7354de62cfa8b8d47/L8OPGAxEfgX2ZAavUc9nUJcwFIeuCe8j3EgtQhN9xWGsPtVA3l6Y8TYjkWlA16v2XxyiSlGseVs-TxSH1jxa61V0sUhQoLdNg5qWEEqS8pS18S49bqmDM5OxbwV2KG_NxIvLkqA5iRy0-RPm_PoqYdM.jpeg",
      "alt": "The gear icon in the lower left corner of Google Analytics homepage"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/3e/c7/3ec7e666675c8c0e42702beae3e4eaeb/849777024db12538c2b9658a59a773a4/wlRV_QR3T7BkFR4ABsAVWt0M76VHQtagPoOUUjNdeQftH-u61afJn4n34y2SHZbNK5_aOGbg1xOvUPfIphjAVDGe0UKHVeTmC9QTv3aRORi95tyYrXvnB4W5_1Y5V0NwhWL-YC2gOTd9hgQnbfNs4zw.jpeg",
      "alt": "\"Create\" and \"Property\" buttons selected"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/2a/b4/2ab4df72a0a2379cc05409e552ce88d8/688d14500f1e84a5aca196338655b80b/d30Ht990lGEnj11aqldR8zhbR0LgBTHvAoouKKuZY6_6aVtRqaMa21Mkwl5Kp5nFR7U5EMqPI3N-90QBQQ8tq2DqgFl223xElxBDqWyt9MrOHG2a0zEBQqXqQGxCGIDAy8H8fKuyNjvMdbiShMzfboQ.jpeg",
      "alt": "\"Create a property\" step one in setting up Google Analytics"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/d7/24/d7246330062f14fd92b90ac2f0de6cb2/5de1efc19fa383e46efd9325a5e59cac/HjHk4D4pjEuSZgoybSdDX4HjRgFoThIpG55cEmKKDAKlwy9M3WwBnlO6TK1fPFel6g-AgBnulNxBx0nk8PDpHEpOBCbkJP9PO6btDDmqdsTpyG48plSPpdeq0dnvGSdxtEECtzXyTC59S4-xFcue-xk.jpeg",
      "alt": "\"Web\" selected under \"Choose a platform\" section"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/c9/8c/c98cce18b81bcca899470359695ffb73/887bb04af68fe800865cf3069e4e3874/JNqngMCsSnMTvk97Kqv7uteE_8rPTpO3dkzuh5tWNJ6clo69kCyH8mJ7DFkXzB4Jvbd9iWVMUVvbSch873mHHfS5BVDj9LTgfy74GtbZVaSEKgj2zYHb7GpNHnhEe02IYz4l5xJmZxCxVn0uZa0VnqY.jpeg",
      "alt": "\"Set up your web stream\" section in setting up Google Analytics"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/83/9d/839da5cb9c0ce4c7e06016c0fdae368e/a711fa5f55f8a97cefc0d032922008d4/in-HRIu9c6MnZwJuxUOv6ML8sNVPn9OUvOG34zxm12-Dbz3Ze9yMgUjQ7jpTLSWouonVOOcLOqrWZ2rY2THHAr-zLZ_MNKBVwMwY7xu4GiBV_9fhu2DKGmZ4_vmP72cTeeRrK70qoFiN7T66xk5-fkg.jpeg",
      "alt": "“Stream details” page with “Measurement ID\" highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/10/e7/10e719d3b5ff58d01779de1360b2f5d1/46cd848680a7c7f90f36594d53dd528d/lUtC82F3EkPgzu25Xfayw1FZL81Ki1jFbOnDds6tE_-MfzbybEfD_65JN0g72OolMJFLnboSEQdVDLNeYfiInzCOEkVcj34L4KgU69OzAL0MjqU9Jvx0tT419zUa0rSEB1NH6MncHLMvSZmI_WhXCW4.jpeg",
      "alt": "\"Install manually\" window with the tracking code and copy button highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/b4/f8/b4f8bc4635e2e278e808e52b21419543/29c53dcc152bcb807f17fd020c965afa/tqmgeqnwF8fldFEOV4FfHXLw0dWRl0xdavScUK5cvp8r8Jlco533lzS3_RLa4D0uugAV2fc0EA_uhvMXo_ex8rism0O9zopuYfJo2YCtg268cPI3WwzJYNTDihmSoniJ6G37RGlFBygYQygdkM4miQA.jpeg",
      "alt": "An example of a page script"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/8b/ab/8bab627dc9e6b7a167f882bc5c09f34d/b8f461abd28f8987b6ab8c88f45881cd/7Lge4UHtxeuMr9SVHMSLwtOPcR0jZ1QJiymJLyX2TLtId3VXRAvdbIYxs09SmjXWwY6DmHihWunTy-nBSlre97NUnOngVkdwCXIJ9DlFOnTj3WO1XwPDaiSLHKYmbI_K2eK-LW10gjGUEC_av2h-aEY.jpeg",
      "alt": "\"Event tag, \" \"event parameters,\" and \"items array\" sections highlighted in the code"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/f3/0b/f30bfb05541ab4f6db2c393d194ca953/a6aa0610159859c9afaa1a525e07e773/OP3Z-Zi4-8YfwpbqcMYw_wEc6CcxOte5xflCMdHGkjDHZzyUJ3MXXVJCyo43-cVJ7G9QxIwTXVsYqL-SErlLYabD5kNJQ-S7tt3QxJwZfzlg9ycnM2A8K2pg78dwq6JSnk8qFlgaNa8GZXTcEq0tJsQ.jpeg",
      "alt": "A code modified by an event listener"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/72/16/7216a977f2f859ea06ed98c90748f036/af642f263e8c0755689b457e6a9820fc/yZVi62x8dksS1y6G79GNVHIpQvTANDwhiY8mkvzJF_YYtJ9uvu5j68EQu6oKFbOKq8p1BzsChfNt8Jk1EARiaZNkFXaVFLv_Rejm_e7jCQRC4YTjXqCCPK7buO5LcJM8nPdGDrwY-Vyl1ZWw8SX7tlc.png",
      "alt": "Amazon's page with four product listings highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/71/a5/71a57d0fa6a834a67ba578f9eb696c6d/c4ae228b03fea519efb97f16e331732c/05BgSqZof50BAbZ0tNT4S_L0tGkRYt8_nWVX93aKGSg9fYF52uLLFLNVyDrbawhEDeHfkWXfYZ7z8hXAO0-E7kl4xW68SRIyAVE-2W0TnErtvfuqnE-J2Evy-7EqNF-zQshNqNd6IvAgP_Ktb986Zac.jpeg",
      "alt": "A page for the Amazon Kindle Paperwhite"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/42/0e/420e56660bb1e693e673007510c57676/f0dab5408077bd7cf53a96cd971f0b05/X5hlJF3oj_2__T6tN9hqZicJM9kAj_NcUnsomSn_ed-cv8OlQkuc9shHGNVieqT_PUXvIU6gdGIzfDmggYNNf2Vr-52zGCGsk63wmVCsyrMikqNl_wNaEUa-kuvLV4wL8g2djJXyWK4Iaz6hwXJsDUw.jpeg",
      "alt": "A screenshot of a Shopping bag containing one product"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/77/08/7708870e58680047dce3b853a8bdf899/10e22578828aaf1992507f2dca38b4b7/qNoH9i4mlvl0Jqi32Xxbr86Xa3wftIvSvSGVLnTGiBXiIsjS_tJofyNZrYBmeritEnHpmv4s4qAcPP-fHelBsG6QinO5q3c0N_rXKKBWChS2UdC0fBHxTPKV7byNhbpaQt0GHxaJVm8cM7gWZdyLJsM.jpeg",
      "alt": "\"Delete\" button highlighted under a product in a Shopping Cart"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/0b/ff/0bff1dd28041401c502ffa5b8ae32c30/37f24919b751a7651537ab309c098c11/GXwlERxsPVU3kDryjbCj2e5YcsMLk5Tpik73kkvZhoGxWUl8iZjvCZwP64rBDkAEDTE3khc8A2YjlaBdKWQNu1uEI-b2DymfdLT_q6Gel8jyKN8XYC5lmpnW8RSAW7tzdal3uV4jcmGK9ZWlLB1IEMA.jpeg",
      "alt": "\"Sign in to receive the coupons below\" pop up window"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/dd/3f/dd3f96d383ad220ebfb7826219bc7c22/d9b721c3eac18a0d4cb869ea7c677880/4aq-Z7Bx76F6f3F8CzP8nHdgT3EwB4KQkRSaphf63sqX25RZuSm9tsijke25ivID4o-R4JeQWIxT1CB1Zcv8nbdTMu7zVKivNC6-MZqGXWEbP9TTUYNWM8ba-6WhsvLyYT1TFcuODL48fyn8qxV40gY.jpeg",
      "alt": "\"Deals & Promotions\" section of the page"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/65/95/65951997135ce404beafe611368c1b53/7cf502003a1d8ee1d9b9c3c81a56db99/sYUe05ygfojKHcm4UOOxR1NjzvaAZ1vPCMG1UhyHEn0uz6NWnDE7zPBH-pY8kwUr4AZs0-yXiIelZdJinwdIFQtrUNBefsHdC9PbSB2mhud4-m0YCJvcpvpAS5s34L80htxKGie0VdIvjit2pFSRilo.jpeg",
      "alt": "\"Customer Information\" form at the checkout page"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/d8/fa/d8fab2b635999548d8d1500063c4c494/99d92e3915fb29cffb9122831541a3c4/NHt9DQ8e3WvVYmk9DX6FxlbMjnpmn0Z_YbkbdRmT66RAWOrxm1jX6lmUAhKteAzSnNGtwZ40XygHQzD-YYdTfp5uGb6es8JFK1XtitKqpPwpk0jVlkPQsFVH0h0bxGv4RiSgRlpz02EyXtfsaekG3Cw.jpeg",
      "alt": "\"Thank you\" message page for a customer who completed a purchase"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/25/9f/259fb72617fa252ae51cf3052ea55744/0efd689cace2134868bbde4d74cc1239/NbheK1CYYmn7DbBoz4EkTGMDlID1oOMlfZAjKWaqN79Ni1YW4f7UKXemQ2dvWzbEAfkJ9GUsnyntoOaBHihwevQDG7m6BSkUCKblDFiGfZwL_MeTADgFUh28SXR5bCi8zSwZ4BdZ8zR9CZRCeZ_Lr-8.jpeg",
      "alt": "A chart showing the path to purchase in Google Analytics from how many users start a session to how many make a purchase"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/c2/50/c250670569d63527c85041457e3f0bdc/1da4909ef83daf75d22e1528bb5df80b/ZDiO4Xfl6Pi_vYOXQzQHpnF1R-0vIolfUNK1T9sBi9kgRKSl7c2BSfdKOBODtzHFKlJm2k605Hh8_6brrMsbIPGQHFDbetT6TuuOG9EaIz57AYQMHf9HvCnFRxlXkgWwWyCo6rnKfBIuZTPgUKb5uiY.jpeg",
      "alt": "A graph tracking first-time purchases versus returning customers in Google Analytics"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e9/26/e926e97ed4fe02cd5843b0ba1ccb480f/b1bccc513dbda899329db6c81051a9ca/znIET--bXeWv4BTU1lJfYQJQgvmXw1l7N-REf52epy23NkEpHMtgzs_wjxYCHfGc59__IKt1PcnZ9XYCWqcqPAhhgQpPIjEDqceqv11iIp7xhIqxnENdPaRYsgr1I2KlRI8veOn90y4U1RRo3vepuSE.jpeg",
      "alt": "\"Items viewed and items added to cart by item name\" data in Google Analytics"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/dc/ef/dcef201a65ca15cb2bbf7c37fab38249/d84b54d79e5489a9b4022f832fd6094f/cB_kylWYvl6Jivj2IVG-wDc9GzKskE13-pbrCg8nTcSRewfECLTqBkjjg4LwTBKQ7KOyyYTYQtMho05W_eQljsVFf7u-IGhgtRn0biMJrv9NgsIaX_fWwZMuxRhTAqydV4hZVmrEFGZ_nAWCU6kbFdk.jpeg",
      "alt": "A chart showing the path to purchase from how many users start a session to how many make a purchase, with an abandonment rate highlighted for each stage"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/94/bd/94bd7e4a48f2fcc80db165c765bd9705/06e05d3d56f18b3577de1311ab3c048f/c0kr8hEE59Z-PSeWtSylZn-ZK5B3aGHrhd6Q-3SLE1qMIWFaHrRE8tHQSyNuuf_-_jlZpIhjN5VaSWBIBSXilkdwy4YQW8UoEeV05lg51Ecdc-HVDuguUOIvcVT7IX2if9ROUCULCFQxEW6xJE7Kg44.jpeg",
      "alt": "A table showing devices people use to browse a store and the conversion rate for each step in the checkout process"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/bb/73/bb73d2fcbd800bda6162ec9173860347/7914475aa81be9beed6373f5a60ff679/1YKUHSOSo3LVLUerEOwi54W2BxLt0oWYMT58JDwWpDf4ssYEZWsAgilmFhORP2q1j8tkbgOCYO6gsjH7LKLNmWAH4ht3ej7pUiiuGr9myNGnjVbUINcfn-VnKy6MDntSyntZI5CeavdOk6Ss1uLnuvw.jpeg",
      "alt": "\"4. Purchase (User count)\" column highlighted in the table"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/7a/d8/7ad8327d83abbad33b966f2eee5144f0/c65da650e239aa57c874401cd08bd8d3/w4TN6P5W8e4RwtAzEOiNGaFoZnwWJQ6kjEVZku1AAJKb6tTFq5tz33d-81k3aBSM-0OUdspJ-jVkIb2ejPp3jgu5Pojeyb0dchRuye4iCYVMaKBFcuAwYHFtZib8qKbj3LYeETGaJlou_uUKusKewXo.jpeg",
      "alt": "\"Item revenue\" column highlighted in GA4 items table"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/8a/d3/8ad3f3857b76e4fee7823a2077f4c8a3/cfd301e3c07674db51a03e04daae6e9b/cB_kylWYvl6Jivj2IVG-wDc9GzKskE13-pbrCg8nTcSRewfECLTqBkjjg4LwTBKQ7KOyyYTYQtMho05W_eQljsVFf7u-IGhgtRn0biMJrv9NgsIaX_fWwZMuxRhTAqydV4hZVmrEFGZ_nAWCU6kbFdk.jpeg",
      "alt": "A chart showing the path to purchase from how many users start a session to how many make a purchase, with an conversion rate highlighted for each stage"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/71/e6/71e6dc098e6e3c96232e23dc32661ad2/e8602a8c9122bf4b466feca22872943a/cICQuqpdXBBrNybd6tI8S9Inw6-pOvwAClSZ2lb7LDYhHmv1VUN3fx0TUHLoFlUCYMr-YKnhxOTMv-7mKTjDe3dmYlHv05GR83DSQjVtzEKvGCQM6une7p3jxGJq_PzVrcjNUoTo4zzn07F7L1qL0sQ.jpeg",
      "alt": "A graph showing ecommerce conversion rates by country"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/f9/ea/f9eab37c562a84c08ba88e4f0ffd25d5/fdafa35a85109ed8e58898a34bdd3669/yBDNJL8VWtVG7gQ5yJkKliGdOnTDze5XGd818ZIBSVRIJ6A_Z__OjuXlVHEeIEyU4JQjB82mCCKnqe7iF6AFTCxtW_hgNF-CEGFxWBcgI8LJNQt1seAF7Y9k6UMZBW4a9GdVdtiFFp5hPI3J5D3UXpk.jpeg",
      "alt": "A graph showing ecommerce conversion rate by industry"
    },
    {
      "src": "https://static.semrush.com/semblog-next-static/banners/trial-gift.png",
      "alt": "Trial Semrush banner"
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&d=Mon%2C%2021%20Oct%202024%2014%3A24%3A34%20GMT&n=4d&b=Data%20to%20Dollars%3A%20Ecommerce%20Analytics%20with%20Google%20Analytics%204&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fgoogle-analytics-4-ecommerce%2F%23how-to-set-up-google-analytics-4-with-ecommerce-tracking&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&b=Data%20to%20Dollars%3A%20Ecommerce%20Analytics%20with%20Google%20Analytics%204&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fgoogle-analytics-4-ecommerce%2F%23how-to-set-up-google-analytics-4-with-ecommerce-tracking&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://bat.bing.com/action/0?ti=5128787&tm=gtm002&Ver=2&mid=7fd3f8b1-5441-4530-af69-b515349be875&bo=1&sid=261ed1508fb811efba4e99f5951e6f6e&vid=261f1a208fb811efae422368dbcde7c5&vids=0&msclkid=N&uach=pv%3D14.0.0&pi=0&lg=en-US&sw=1920&sh=1080&sc=24&tl=Data%20to%20Dollars%3A%20Ecommerce%20Analytics%20with%20Google%20Analytics%204&p=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fgoogle-analytics-4-ecommerce%2F%23how-to-set-up-google-analytics-4-with-ecommerce-tracking&r=&lt=891&mtp=10&evt=pageLoad&sv=1&cdb=ARoR&rn=305722",
      "alt": ""
    }
  ],
  "publication_date": null
}