{
  "url": "https://www.semrush.com/blog/google-ads-best-practices/",
  "title": "8 Google Ads Best Practices to Maximize Return on Ad Spend",
  "content": "Google Ads is a marketing and advertising staple for a wide range of online and brick-and-mortar businesses. But a lot of Google Ads advertising spend goes to waste due to poorly managed campaigns, suboptimal ads, and various other issues you can easily avoid.\n\nIn this guide, we go over the top Google Ads best practices you should follow to ensure you get a positive return on your ad spend.\n\n1. Install Conversion Tracking\n\nHow will you know if your ad campaigns are turning a profit if you don’t track conversions? Installing Google Ads conversion tracking helps you get a better understanding of your return on ad spend (ROAS) and allows you to further optimize your campaigns.\n\nNote\n\nIf you’re unfamiliar with the platform, we recommend reading our Google Ads guide first.\n\nHere’s how to set up conversion tracking:\n\nFirst, you need to create a conversion action (e.g., a purchase, form submission, or phone call). From your Google Ads account, go to “Goals” > “Conversions” > “Summary.”\n\nClick the blue “New conversion action” button in the middle of the screen.\n\nOn the next screen, select the “Website” option.\n\nEnter your website’s URL and click “Scan.”\n\nNext, click “Add a conversion action manually.”\n\nHere, you’ll need to enter some additional details and customize a few settings:\n\nGoal and action optimization: The goal category for your conversion action (e.g., purchase, add to cart, subscribe, submit lead form, etc.)\nConversion name: A descriptive name for your conversion action\nValue: The value of the conversion action. You can use the same value for each conversion or set up dynamic conversion values.\nCount: How many conversions Google Ads should track per click or interaction\nClick-through conversion window: Visitors will sometimes convert several days after interacting with your ad. Here, you can select the maximum number of days that can pass between an interaction and a conversion for Google Ads to associate the conversion with your ad. Note that the best number to use here will depend on your specific business and industry.\nEngaged-view conversion window: How many days after a user interacts with your video ad should their conversion be attributed to the ad?\nView-through conversion window: Visitors can also see your ad but not interact with it (called an impression), and then convert later. This is known as a view-through conversion. Here, you can set the maximum number of days that can pass between a user viewing your ad and their conversion for it to count as a view-through conversion.\nAttribution: The attribution model you’d like Google Ads to use for conversion tracking. The two available options include data-driven and last-click attribution.\n\nThen, click “Done” at the bottom of this window. Finally, click on “Agree and continue” on the next screen.\n\nYou’ll then need to add a Google tag so you can start measuring conversions.\n\nTo do this, click “Set up” on the next screen.\n\nYou’ll then get a snippet of code that you’ll need to add to your website. (You may also get an option to use a Google tag detected on your website, meaning you won’t need to make changes to your site’s code.)\n\nOnce you add the code to your website, go back and click the “Test installation” button.\n\nIf Google Ads detects the code on your website, you’ve successfully set up conversion tracking.\n\nNote\n\nYou can also use Google Tag Manager to add a Google tag to your website.\n\n2. Organize Your Google Ads Account\n\nTo manage and optimize your ad campaigns efficiently, you need to keep your Google Ads account organized.\n\nFollow these guidelines when structuring your account:\n\nCampaigns: Organize your campaigns by business goals, product or service lines, or location. Add a descriptive name for all your campaigns and use a consistent naming structure.\nAd groups: Create ad groups based on themes (e.g., specific keywords, audience segments, intent, or promotions). Try not to go over 10 ad groups per campaign to keep things tidy.\nAds: Use at least three ads per ad group so you can test out different variations of ad copy\n\nStructuring your account using the tips above will allow you to review your Google Ads performance at a glance. It will also help you find specific ad groups and ads quickly so you can modify them for improved performance.\n\nTip\n\nUse AI Narratives for Google Ads to get automated summaries of key performance metrics.\n \n\nThese summaries let you quickly identify which elements of your campaigns are successful. And which areas need improvement.\n \n\nWhich will help you make more efficient strategic adjustments.\n \n\n3. Analyze the Competition\n\nAnalyzing your competitors’ ads and landing pages can give you inspiration for your own ad campaigns. It can also help you understand what kind of ads work best for your target audience.\n\nHere’s how to do a quick analysis of your competitors’ Google Ads:\n\nIdentify Competitors\n\nThe first step is to identify your main Google Ads competitors.\n\nStart by listing all your known competitors—you can probably name five to 10 competitors yourself. Then, type in a few of your main keywords into Google and check out the ad sections to see which companies are advertising there.\n\nYou can use Semrush’s Advertising Research tool to find and learn more about your Google Ads competitors. Simply type in your domain and click “Search.”\n\nThen, click on the “Competitors” tab on the next screen.\n\nScroll down to the “Paid Competitors” section. Here, you’ll be able to see:\n\nThe websites you’re competing with for Google Ads placements\nHow much they’re spending on paid ads\nWhat kind of traffic they generate from paid advertising\n\nStay on this page. We’ll use it in the next step.\n\nFind Out Which Keywords Your Competitors Are Bidding on\n\nNext, you’ll want to find out which keywords your competitors are bidding on. If they’re bidding on specific keywords consistently, it’s likely that those keywords are resulting in profitable ad campaigns.\n\nThe Advertising Research tool can also show you exactly which keywords your competition is bidding on. From the “Paid Competitors” section, click on the domain name of a competitor.\n\nNext, scroll down to the “Paid Search Positions” section (staying on the “Positions” tab).\n\nHere, you’ll be able to see all the keywords they’re bidding on and the average cost per click (CPC) for each keyword.\n\nFrom here, you can export all the keywords by clicking the “Export” button.\n\nReview Ad Copy and Landing Pages\n\nApart from analyzing the keywords competitors are bidding on, you’ll also want to have a look at their ad copy and landing pages. This can provide insights you can use to improve your own ads and landing pages (which we’ll cover in the next two sections).\n\nThe Advertising Research tool can help here as well. After clicking on a competing domain from the “Paid Competitors section,” go to the “Ads Copies” tab.\n\nHere, you’ll be able to see the ad copy that a specific competitor uses for their ads. It’ll also show you the number of keywords that trigger those ads in search results.\n\nYou can also export the copy for all their ads by clicking the “Export” button.\n\nIf you’d like to take a look at the landing pages for the ads, simply click on the “Pages” tab.\n\nHere, you’ll see a list of all the landing pages they use for their ads. Along with estimated traffic, the number of keywords each one ranks for in paid search results, and more. \n\nYou can then examine these one by one or export them as a list of URLs.\n\nUncover Your Competitors’ Search Ads\n\nwith the Advertising Research Tool\n\nTry for Free →\n4. Improve Your Ad Copy\n\nYour ad copy can have a huge impact on how your ads will perform. Follow these Google ad copy best practices to get better results from your ads:\n\nBe Specific\n\nYour ad copy should be specific to the search query.\n\nFor example, let’s say you run an online clothing store. And, you want to create an ad targeting women looking to buy summer dresses.\n\nIn this case, you want your ad copy to focus on summer dresses specifically. Don’t use generic copy that says you sell a variety of women’s clothing or mention other types of products you also sell (e.g., accessories).\n\nThis will help to show shoppers that you sell exactly what they’re looking for, making it more likely that they will click on your ad.\n\nInclude Keywords\n\nInclude keywords searchers are likely using within your ad copy. This will make your ads seem more relevant to searchers and will increase the chances of your ads getting clicks. Like the Upwork ad below, which is clearly targeting those looking to hire freelancers:\n\nImage Source: Google Ads Transparency\n\nMake sure not to overdo it, though. Adding one to two keywords to the ad copy should be more than enough. \n\nThe goal here is to show prospective customers that your ad is relevant. Don’t stuff keywords into your copy in an unnatural way.\n\nAdd a Clear Call to Action\n\nRemember to add a call to action (CTA) to your ad copy to entice users to take action.\n\nYour CTA should tell searchers what you’d like them to do after seeing your ad (like make a purchase, start a free trial, or book a consultation).\n\nImage Source: Google Ads Transparency Center\n\nHere are a few examples of CTAs you can use in your ad copy:\n\nBuy now\nSign up\nCall now\nLearn more\nGet a quote\nMake Sure Your Ad Copy Is Error-Free\n\nThis one may seem obvious, but it’s worth stating:\n\nYou need to make sure your ad is free of grammatical and spelling errors.\n\nSeems easy enough, but you’d be surprised by how many ads out there fail to follow one of the simplest Google Ads best practices.\n\nAds with grammatical and spelling errors can seem spammy to searchers and make them feel uneasy about clicking on them. Avoid this by double-checking your ad copy for any errors.\n\n5. Optimize Your Landing Pages\n\nYou can have the best ads in the world, but you won’t generate any conversions if your landing pages are of poor quality.\n\nAlso, providing a poor landing page experience can reduce your ad’s Quality Score. This, in turn, can result in poorer ad performance and higher costs.\n\nHere are a few tips you can use to optimize your landing pages for conversions:\n\nMatch Your Landing Pages to Your Ads\n\nPerhaps the most important thing you need to do to improve your landing pages is make sure they match your ads.\n\nThe offer and the messaging you use need to be consistent across your ads and landing pages. If you promise something in your ad (like a discount), you must deliver on that promise on the landing page.\n\nOtherwise, you’ll get people clicking on your ads, but they’ll likely never convert.\n\nFocus Your CTAs on a Single Goal\n\nDo you have multiple CTAs on your landing page?\n\nDon’t worry—that’s fine. \n\nBut you need to make sure they all ask visitors to do the same thing.\n\nImagine seeing multiple CTAs on a page, with one asking you to buy a product, another one asking you to sign up for a newsletter, and a third one requesting that you call to get in touch.\n\nYou’d be confused. And you wouldn’t know where to focus your attention. Right?\n\nThe same is true for your website visitors.\n\nSo, if you want to have multiple CTAs on your landing page, first decide on the main thing you’d like visitors to do (e.g., make a purchase or book a call). Then, make sure all your CTAs are focused on pushing visitors toward that goal.\n\nHere’s a good example, showing the consistency of CTAs as you scroll down the landing page:\n\nUse Trust Signals\n\nA lack of trust is one of the main reasons people don’t convert on a landing page.\n\nIf it’s their first time visiting your website, they might feel uneasy about entering their personal information or trusting you with their credit card details.\n\nHere are a few different types of trust signals you can consider adding to your landing page:\n\nReviews and testimonials: Seeing satisfied customers post about how happy they are with your company can make visitors feel much more confident about making a purchase\nGuarantees: Offering a satisfaction or money-back guarantee can also help make visitors feel at ease when entering their personal or payment details on your landing page\nMembership logos: Is your company a member of a reputable organization, such as the Better Business Bureau (BBB)? Try displaying the organization’s logo on your landing page to signal to visitors that your company can be trusted.\nImprove Page Speed\n\nPeople typically won’t wait more than a couple of seconds for a website to load. The longer it takes, the higher the chances of them leaving without engaging with your content (known as a bounce).\n\nIf you want your landing pages to convert, you need to make sure they load fast.\n\nHere are a few things you can do to speed up your landing pages:\n\nUpgrade your web hosting: Are you still using shared hosting? Upgrade to dedicated server hosting or use a better hosting provider to help speed up your website.\nUse a CDN: With a content delivery network (CDN), your website content is served to visitors from the servers that are physically closest to them. This can result in significant increases in page load speed.\nCompress images: Images can be slow to load, especially if they have a high resolution (and high file size). Use a web-friendly image format like WebP to get images to load faster, and you can compress your JPEG and PNG images with tools like Optimizilla or Kraken.\nMinify JavaScript and CSS files: JavaScript and CSS files can be bloated with comments, line breaks, and unnecessary spaces, which increases their size. You can use a tool like Minifier to optimize your JavaScript and CSS files.\nRemove any unnecessary scripts: Check if you have any unnecessary scripts running on your website (e.g., an unused tracking code snippet). Remove any scripts you don’t absolutely need so that they don’t slow down your website.\n\nFurther reading: What Is Page Speed & How to Improve It\n\n6. Maintain a Negative Keyword List\n\nGoogle Ads gives you a way to prevent your ads from showing for irrelevant searches by allowing you to add negative keywords. These are keywords you don’t want your ads to show up for.\n\nIf you’re running Google Ads campaigns, using negative keywords is a must.\n\nBy adding negative keywords to your campaign settings, you can improve your ads’ click-through rates and reduce your overall advertising costs.\n\nTo add negative keywords, go to “Campaigns” > “Audiences, keywords, and content” > “Search keywords.” Then click on the “Negative search keywords” tab.\n\nFrom here, click the “+ Negative keywords” button.\n\nChoose whether you want the negative keywords to apply to an entire campaign or just a single ad group. And then enter or paste your negative keywords.\n\nClick the “Save” button at the bottom once you’ve added all the keywords.\n\nNot sure which keywords to exclude? Check out the “Search terms” report by going to “Campaigns” > “Insights and reports” > “Search terms.”\n\nHere, you’ll want to look for two types of keywords:\n\nAny keywords that aren’t relevant to your business\nRelevant keywords with a lot of clicks but no conversions\n\nTake note of any keywords that fit into the above categories and add them to your negative keyword list to reduce wasted ad spend.\n\nApart from adding negative keywords to individual campaigns and ad groups, you can also create an account-level negative keyword list that will apply across all your campaigns.\n\nHere’s how:\n\nFrom your Google Ads dashboard, go to “Admin” > “Account settings” > “Negative keywords.”\n\nClick the “+” button.\n\nAdd your negative keywords and click “Save.”\n\n7. Take Advantage of Ad Assets\n\nGoogle Ads offers different assets (formerly known as ad extensions) you can attach to your ads. These help provide more information about your offer or company.\n\nThey can also increase your visibility in the search engine results pages (SERPs) by taking up more visual real estate. This, in turn, can improve your ad click-through rate and lower your cost per click.\n\nConsider taking advantage of these types of Google Ads assets:\n\nLocation\n\nThe location asset lets you list your business’ address on a separate line in search results. It looks like this:\n\nThis is a very useful ad asset if you run a brick-and-mortar business that relies on in-person visits. Because it helps people find your physical location more easily. Users can simply click on the address and get directions on how to reach it.\n\nSitelinks\n\nThe sitelink asset lets you specify other pages you’d like to direct users to apart from your main landing page.\n\nImage Source: Google Ads Transparency Center\n\nYou can use this as an opportunity to link to category pages, an FAQ page, pages with reviews or testimonials, or any other page you’d like potential customers to see.\n\nSeller Ratings\n\nWith the seller ratings asset, you get the option to display a rating for your business based on reviews Google gathers from various online sources.\n\nImage Source: Google Ads Transparency Center\n\nThis can be a great way to show visitors that your business is trustworthy.\n\nCallouts\n\nYou can use the callout asset to highlight important information, such as your best-selling products, a free shipping offer, or your unique selling point (USP).\n\nThey’re added after your description text, and it’s a useful way to add important information you couldn’t fit within the description character limit. \n\nHere’s what an ad with a callout asset looks like:\n\nImage Source: Google Ads Transparency Center\n\nCalls\n\nIf your business relies on customers making a phone call to book an appointment or ask for a quote, you can use the calls asset to make it easy for them to get in touch with you.\n\nThis way, potential customers will be able to call your business directly from the ad:\n\n8. Test Location Targeting and Ad Scheduling\n\nBefore we wrap up, we need to go over two more tactics that can help you get better results with your Google Ads campaigns: location targeting and ad scheduling.\n\nKeep in mind that these tactics won’t always result in improved performance—you need to test and see if they produce results for your business.\n\nLocation Targeting\n\nGoogle gives you the option to target specific locations with your ads. If you use location targeting, your ads will only be shown to people in locations you specify.\n\nThis can be useful for a number of situations:\n\nIf you own a physical business, such as a hardware store, you may want to only advertise to people in your area\nEcommerce businesses that only ship to specific locations might want to avoid advertising to users in other locations to reduce ad spend\nIf you sell any type of high-end or luxury products or services, you might want to focus on advertising to people in more affluent areas\n\nTo set up location targeting for a campaign, go to the “Campaigns” section in your Google Ads dashboard and click on the cog icon next to the campaign name to access the campaign settings.\n\nIn the “Settings” pop-up, click on the “Locations” drop-down and enter the location you’d like to target in the search box. You can target countries, cities, regions, or ZIP/postal codes. Once you add all the locations you want to target, click “Save.”\n\nThat’s it. Your ads will now be shown only to people in the locations you specified.\n\nAd Scheduling\n\nWith Google Ads, you have the option to schedule ads to only run on specific days or during certain times of the day. This is sometimes referred to as dayparting.\n\nAd scheduling isn’t necessarily useful for every type of business. As a rule of thumb, if you see that your cost per conversion is relatively even across different days of the week or times of the day, there may be no need for you to use ad scheduling.\n\nBut if your business experiences peak times or days where you usually experience spikes in clicks or conversions, you should consider ad scheduling.\n\nFor example, imagine you operate a kayak rental business. You notice that the number of ad clicks and bookings usually increases on Thursdays and Fridays (perhaps because people are looking to rent a kayak for the weekend).\n\nIn this case, it would be wise to set up an ad schedule to have your ads run on Thursdays and Fridays only, since these days are when your click-through rate and conversion rate are the highest. \n\nOr you could set up bid adjustments to increase your bids during those two days of the week.\n\nHere’s how to set up ad scheduling in Google Ads:\n\nFrom your Google Ads account, go to “Campaigns” > “Audiences, keywords, and content” > “Ad schedule.”\n\nClick on the pencil icon and select the campaign for which you’d like to create a schedule.\n\nThen, select when you’d like your ads to run and click “Save.”\n\nThat’s it. You’ve created your ad schedule. You can also test out different ad schedules and see which ones yield the best results.\n\nMaximize Your Return on Ad Spend with These Google Ads Best Practices\n\nWhen done right, Google Ads campaigns can consistently drive customers and revenue for your business.\n\nFollow the best practices for Google Ads we outlined above to ensure your campaigns are a success.\n\nYou can also use Semrush’s tools to make things easier:\n\nAdvertising Research can help you find out which keywords your competitors are bidding on and show you the ad copy and landing pages they’re using for their campaigns\nKeyword Magic Tool shows you keyword metrics like CPC and level of competition\nEyeOn allows you to monitor your competitors’ ad activity \nPPC Keyword Tool makes it easy to plan and organize your Google Ads campaigns\n\nYou can access each of these tools and more with a free trial.\n\nAccess Everything You Need\n\nin One Platform with Semrush\n\nGet a FREE Trial →",
  "headers": {
    "h1": "8 Google Ads Best Practices to Maximize Return on Ad Spend",
    "h2": [
      "1. Install Conversion Tracking",
      "2. Organize Your Google Ads Account",
      "3. Analyze the Competition",
      "4. Improve Your Ad Copy",
      "5. Optimize Your Landing Pages",
      "6. Maintain a Negative Keyword List",
      "7. Take Advantage of Ad Assets",
      "8. Test Location Targeting and Ad Scheduling",
      "Maximize Your Return on Ad Spend with These Google Ads Best Practices"
    ]
  },
  "images": [
    {
      "src": "https://static.semrush.com/blog/uploads/media/1a/be/1abe0260cee290b75cedfca0d752c04c/0fdc2c6b0e3fe3667af16a286316722f/google-ads-best-practices.svg",
      "alt": "Google Ads Best Practices"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/2a/ba/2aba5769b14ddfe3aa0f34592925d11c/e80d167b7443c1536b5e1a5b5d270cb3/cy5q0HQxHfC1jzse0TfFZE4kzyIx81fh75z6wSoY9e4w3oAUesUHaAOL6ZTMLaxJpjrnesF7jJSVjLV2HX2qoPDhYZKps4f4dZXfNeuvT1Y2oqJcyH_F9ry40MTmQVANTQSP7SwvDaMWsNVVDZCJXK4.png",
      "alt": "Navigating to \"Goals,\" \"Conversions,\" \"Summary\" in Google Ads account"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/4d/b9/4db9df9c68bf59ac81203fc6296028cd/8f8541a791d7e07139896b2747ca6dc7/jWROxBk9-C2OwjcQPMCG3ppJm1yRgUW8GFygdIatB7wGEvPyup11gFWUa-_usuwR7S3Cn8xt1Cj-oDrO6wFdjjSZXA-tmpy5M3WygTfUKaeFnLkTvpSdAMs-6diuAKtePEuIk6Arxaq8CE7HSjymJo0.png",
      "alt": "“New conversion action” button"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/82/ee/82ee42acaa7d1b8aff54c5e7ffda7c6f/429c228319f0f363fdb9de7f75c7dcca/nO6paRGdeYgidFLqEX71U7vLecS1aP4riGvkl-U_UhwUjISCtlSYOsS7XKV4KjgdB9RoybBgKG5H4jVXBh9rW4Wg4kfIJSTKc4sVN-sJYYmpVLgKYALQKzzJ3Dfs6Z8WhBVbVK0kcqM3SV_C1FM33r0.png",
      "alt": "“Website” chosen under the type of conversion to track"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/30/cc/30cc320ffb23f9784c1491f3e2dc63e2/0f76c7a77149b809e3f86f126848ee2b/Gel2ZYz6Nl_QnCTV4cn21eyCXOrZ3aVWRE-c9NeKWKd5VH-8Elp-oilE9jOFc8DymVVCk4lDkjQZ_pQ4b-ziBl27UqYKxzlh1SxZ9wSd2QI-gAt_jRVbg-SvW3YbjWQeA73nJKA186hnZFqYZYljywc.png",
      "alt": "Enter the URL for the website where you want to measure conversions"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/51/ca/51cad922ccf8f9a466d1b75274630a7e/ac3de8773c6ceee19ff54f2209fdb910/kg0E4mpHQiwHbGHQ_5DjOFuckiVX3s2CvqIquY_xRuKIz7clw7yVXqGT2AF03h0pPC7mdg75o88K3i5owSVRuGeHON-g1QiqKFNYxv3XVthxWFk_NFO9-OwL-4Elin6mHLJVoRZEZNoUP_ITF-BlLMQ.png",
      "alt": "“Add a conversion action manually\" button highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/a3/b0/a3b00283147508ef878c32077f5bbba5/cee105788dd221d222c597d9e5d6c91f/qgu4pR2uDph0eUYdb8d2PkKoGiAubvmFD1nwoK2KMUCLUD5eHklG2sqw2hzkK8pWOMbkLit7mi_Smjx6eIiSrCQ0Q746BxdD1MfbtkK9uRrAcaVj_tapQ_i16qL4jVCYVSobmv7H4CdTpKi9Yk8WkpY.png",
      "alt": "“Set up with a Google tag” tab"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/5c/e1/5ce1f1bd3192be6c4ad2003a1b5cc382/cff58203d889facd6729e2a17b41b334/r1lHV4MWqMaAo_DM651njXqk6N3nTy_xraZPuqpAaxntrwxbn1EB7rcCdLE8X8S7tcnlc4u41xATGl_LUribAUZ2mspag8KkPx2DkmQbDcJrcLKBBKmxzWbOUNcDAFbJqVCtuSpXGXCqGb1G6GLPkpM.png",
      "alt": "\"Install manually\" option selected under \"Choose how to set up a Google tag\" window"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/87/15/8715da4829db4f0e368ef58ac6a737ef/835425ca1242c7a990343460fc5667e2/AD_4nXcamhD_2ZNgDnrZCZm_QqbfKOt_E4pmNfQ2ueXzEWwdIU1x2nvmwDYj6QcaqAzK3SbnpStGGgl8yeE4yjNDdYPAf8lY_j2h2GBrjdb89hjRT34EoSgq0yjDjvwHRaQT9Kh9BGrcf1rYOSpBorfhtCgcaM8g.png",
      "alt": "AD_4nXcamhD_2ZNgDnrZCZm_QqbfKOt_E4pmNfQ2ueXzEWwdIU1x2nvmwDYj6QcaqAzK3SbnpStGGgl8yeE4yjNDdYPAf8lY_j2h2GBrjdb89hjRT34EoSgq0yjDjvwHRaQT9Kh9BGrcf1rYOSpBorfhtCgcaM8g?key=GnPo32qUfYf5IqfCEG-mYg"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/83/c2/83c2cbb488ca63d72a3453c42380e125/6f109613702ca6019f77ceef3a6e9926/-4iFUYVcJ2RfzGViv7Mp9zrcBOBsSMzdOmEZYJROUc492db4KIkI1GtxSy3bsM9zScWOXmnx1Qx0eaOK1j4Q9eIphqJVTrZoct7180cVi06QDXAHK0J1bfj5uSduarnUqqepQ38AFF4wxeVZiPzUwBU.png",
      "alt": "Advertising Research tool search bar"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/31/60/316003215f472003bad52e72297e1b45/dcc0f1ae864eb3394df7619c1dd2f856/8hbKBhuO4wd3jpUUWaQCa020DF0aBvO2XWElkX7Idvn4I_eBC-SzRQSeVeqgJmrZ8wtvIhwkMf1Otu9yULadAJiGFC5iTq3yGT3p6eHyjBJkXeIXosazZ4tyCTvEI81Mf5EpjB0jP1jr8zVbO774Vz4.png",
      "alt": "\"Competitors\" tab highlighted in Advertising Research tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/0c/4f/0c4fc668c7c5f2f45e3ca3b6bc4d8682/9b738eb555dc5306c8f1121ede885928/Wq9wNN717wOaoRq-uwFNqqkhwPHHEdgtH0JYlM_TAeuudBE3CeCte3OtrVbEszJu1tZhyZ6-UCY10M1z4skP_gXPETZxj9cIOIyJ9glRs9r1o_l17Dwx0VORLi06WCSeUu2w6hZ6Ea19JuWmReaJslE.png",
      "alt": "\"Paid Competitors\" table in Advertising Research tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/a5/93/a593b83809ab317051b7de25ce744eca/f276ab3cf70635518d954d0c88920df9/wrL4cW-hul1w72Azh6VpFV5UdxErpVi7uiPllVm04NjeuyqD5nFbBddialh-6mjqlaveajqUXAKj_3OUyhkTjmoEA6bGfn-uiCK6NprEIFCPw30n6HzUHIqCrpr3OS0etyrOIzVuyBJgJCbWSEhNVgY.png",
      "alt": "\"clarks.com\" domain selected from the \"Paid Competitors\" table"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/a8/f7/a8f7349f753798cdcc81a94ce5852e4d/751a523bb85ffc7dbb9d5618efaa44c2/eZI5AVbsIo4MvpJtLRA3favM-gd62Y757k3GCsjlFTn8AD450MkVDxBV95bBsQbC1kN07B_thTjJYRGv0E1yOPpsz_GN_P6S-0TdNI-KuNxHsctshA7hDEmSmgdlYx1tUDgN3HFxL9hiMgS5-IfXQPk.png",
      "alt": "\"Paid Search Positions\" table, with \"Keyword,\" and \"CPC\" columns highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/95/c4/95c45bafb42347753faea047a04e35d7/47bb28cdd29253fea1d85a5d063e7b63/jd4oIBqEAbdXflku3qJAZZELNDqUfNHu6XkqAU_mdewluE05sDCqWpqejdqVoHsBxFHc4FiXU_uKPSyAEFCc-Si2ZlWqZGDYWBLsuvcSYGW862zk957eB_ie2rayJYOKLXgfnhymvmIrcnYmKAfbzvk.png",
      "alt": "\"Export\" button highlighted next to \"Paid Search Positions\" table"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/aa/92/aa9284108d2cfd0a193da0cd9d12ede9/b105e7c4fcc226423c1a121992f6bbed/APAP-zO5tLYlDVnTZBI5yyi9nvBfq7Q54O_CxxrSwVPzhaxzz___GMKFf2Tnr9tbSZo4vSbt3ilISSMHH41YPdJyYN13MaSAWnqVD7ASRz2ulA15ncQq6XqXnSi9sovBFq4TvsBOkdK8bAzEVK2BqcU.png",
      "alt": "\"Ads Copies\" tab highlighted in Advertising Research tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/2d/dc/2ddc3f6a013fd2be25c7c3f30628ccd2/df9935e48f5d37da1af2c0f6495ca910/GVqIh0SOy8BzRNBZB3yTfesSL7yAOI4e2EPbHxfcIj6pxAt4ErlWkxMgpRgeyFRlf375vxtYTPl7T5Z7Pgno0GxIWClxtx6NyVONRtV4DhE1TSieUnrlImMp3ZPgJ7nNL4wbXDcFp_vwbw1_dCyAnQI.png",
      "alt": "Competitors's ad copies, with the number of keywords that trigger each ad"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/79/16/7916c2322e11767f4cab5a424491f5d6/b81f1875e86762f8cf93b737a971e1d7/9QiDES04vVmIFUhHhpVDPBcI8SsOx0f6Lt9W5-pGn-ifuJo_y4i2o1YkFLc3pB0w0WLMuRySzKaJvMiglrSweBHfy3d05OqxlcguzkNE8JhD_Hw2MAoK80JufJoomBPH8z4dIwUFWYl2Hx-jRHK24oY.jpeg",
      "alt": "\"Export\" button highlighted in \"Ads Copies\" tab"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/6c/af/6cafdc078379cf4d083eaa134233cdc5/6881a67a5b9f65ee75389e21e2d1af63/iEeixFUyYqhx3vVS5F9SibAms5kzpS9TM_9ULZQKpOvTBws5dI9TsTLExCbhU6-g23tMd4IEXW4lV-2Q9MDI98tFq0sAHblP1gJ22QudZXvSulXXK3XW9G57SfjPpoQKXfRYgoGosY41UCKLks7y4Hs.png",
      "alt": "\"Pages\" tab highlighted in Advertising Research tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/de/cb/decb7c54c21ab3f4e81fda53023be41c/6e7413398bed0a49ac1afa5b880beff4/vQnnSa7m_uIVmFMpOxpHySilzNnt49B29dRqIl_tI-EcfHTy2Ubvh8YysR4yS4GBAz1EyTNbZlAEOHT05OigReYdNBxM-dGN7l7fJe6HnXRzkbS9pJwvhIPBc8LSz53hLkc8r37WDu-TJ8lhDRqiKpQ.png",
      "alt": "\"Paid Pages\" table, with \"Traffic,\" and \"Keywords\" columns highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/4c/4b/4c4b062b3641ffe8616cac4a9120da18/4fe4c6b3f3af504868a35da7c3aa206b/7-x52Muvr5ka7V6c4Gj8L_kOWodQtYeE96-H3FxWmw5UbtNgpcn46n4GECGdjvaBrg8ejjkLy3OihcP6iUze7MTnbgthy_nFER_Rsxo5HDv2R4x2Ks4FmcpCdehYmPFz5D72XiaCF6UDGMMh5qxOwHk.png",
      "alt": "An ad from Upwork, with \"hire,\" and \"freelancers\" keywords highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/97/a3/97a32461a636d113df3c090077da70f6/3d3679d40b8caeb4d3a2c2d76c7257c9/j_PEzJ_ff2GG6I42wTAQA9dOnND7ylhnv5yEd3H4ZUDdAWpj24CsWc1HEoClL4o8dDvLzNIiktHJmzkvfkCms4UQOiD7ll9M3gWABYja2nvWV1RYORXtt27WD8xwbQwG31V3nbGelxDVR-5UwoCOlHo.png",
      "alt": "A CTA that reads \"Start a Free Trial Now!\" highlighted under Shopify's ad"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/37/44/3744088cafe31df31b84bb02024aa669/c08ce1b37975e1b7e6e226e856e7dc52/4VNqNwuGxN3TLa4_oCDTWj6rHAFzISb-SLXj5c_5bqbSxZvmD7UIaGMHTybYWkGCzcoHNxxp8RUNuDlpIAZ8bLqVt2gn1Let7YPsTvutqEy2fj66wLblzOwVbTPkLVTOfamAIDnZqqi45vkqzc1AL1s.jpeg",
      "alt": "wishpond's landing page with multiple \"Book a Demo\" CTAs"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/93/88/9388a26155fc71c8edbdecc37edbe318/c3289efa58ed3ec5525aecd6692fcc24/SQ_0PaXx8uwglkSy1qucmlRiMpHM3r-8oCa1cJPvR7bXTbTYu9OEvnpVPeWepbfK_xMjOYGUXmY2eD4Z7OaONvCovt2aJ1O1o2hSaYsMM2B1U0Q8U7XrNsFB_wSgepoHXenzY18uzda0t2CO0g4QKuw.png",
      "alt": "Types of trust signals illustrated"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/9f/51/9f51b747516215c570a331a2aab62040/49d26ee41227846a0d8ef20b3357c7bd/lBNPzezxdezYCIiqa2e-pUfxfHgkQpSEZ7McqFz1ljetUYvIuKu1mnXUTeYy1x9oyck4gIQR8H51ArVNBbpKZFbG7g-Nkmt2Pxtlhfv5gWX-u5MTkpACY-7YKPbvBeUy6TvtzQKw0xAyH8P62d48Y4M.png",
      "alt": "How slow page load times increase bounce rate"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/54/60/5460d5fc853a518cdd99d9c914265dcc/64a6fb971f329e1e30d2973202a1d917/J5VrOpuGtLvBKokxVdPT5OxWJVoRNGNAudfrPvdZzbVE1GVRnUXTPwlJgLBVtjmD4iZTU0oX2abG5FgPPD7WSfrRo0yXDFkxhIV5EeNLqNR4nFLwhtE_MMRz8kI7CK77aPw6A2pxXsG1Tob1cpMOSTU.png",
      "alt": "Navigating to “Negative search keywords” tab in Google Ads"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/7d/8d/7d8de35662e5e6f55d81a003e8326173/dac01b04e0f34d9cab3db033d9f9ef64/XLm_KuMU_eyY7qbR8L3pFsesptQ7mCbfIuNgtXNfoA7V5N37eSLfCxbkTv_6XNvLhV6rUj75V3GptXp1l8K9ATzdDHfOFNJHzNgzJUFfxcjy-Nbsr8kMBFpP6JZvGuczkArAVHekSwQnUoMj2wqOlMo.png",
      "alt": "“+ Negative keywords” button"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/9c/2f/9c2f7a199beaeb0c13529624526571cb/74976b882698a11a055cb4c552324528/sGkihuHi-40rEmQyvqj5olE1yUaf5SlK4n9vnhFUM8h3T0hueKASP-rnWZ5xJCqaQiuh6RZB7A3ZVWu4ZFrgBN5ZZ7hm2r8OiRD6GqKOYnZUHOEth1jtBWYhMuNXT65ca3SDK65Uc2XcK6N6zOGF69s.png",
      "alt": "Enter or paste your negative keywords box"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/aa/13/aa1354cf6aaf2f9440e603fd22ffdd5b/9d331ee2e9c8e64521cda32404d1c886/OhclKNRLBEQe1gfo7D6lNIlEPj4du1UNxbg6XDyvd4OsRJPOcaQyD-WOk51bfiE-DkzV5NaEUksApil0xMjNh0Z5U52scE9j-TkPTzawJLy9h6McyYtvdHimkUaoM27B6G_II8V9r6QnLYFgw_80nHs.png",
      "alt": "A section of “Search terms” report"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/37/57/3757007ac2ba5c3ce1591b1273762024/73726628a2a7c0d5bffd487f8671cd80/YP-fu8b8L9rxJhanCLvpifYbUy5-iLc1u3QfG9944DnZaBC2qhNjTiLrkbZb5jKa9pK-I9O2xKdRSljq_kJx70ciAYZVNk074-KmifeKBejvT5r4yDtBoHbT9KFtGWkHTPoeqwSMzuBans4LU4O7X8M.png",
      "alt": "“Negative keywords\" section in Google Ads"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/5c/4b/5c4bb3e1ecd59acd0a51cac7984d5055/67ae61fc2751fb32c2f96bdb02953a18/SRj1_M38MbTulzDm7cloHHNySQL6-2nLNZFZVuAxcxPziUhxxhHzWRT9bTWhFAuIjwuPwSgij_zrSU9z8XAC6C8mcu5Tw5yeNO3rF0RorzqaSk4tZbvxdkwHEdplcRKVmol_Vp0vlrCYf5Gnex1L-mU.png",
      "alt": "\"Add negative keywords\" empty box"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/17/b9/17b9eeeb109c776402d0a0068eac1688/4f754e5f5a324d0ecb9bd52365d91206/w7G2n5pKYVMSYmEvab9F5NcP6J-vAqZ5aYqA5QAT9vF_W-ySX1qAYCoRNHWcEpiW15tUiTSEP7N120YA1c55kEiQchcNZze_PGEhXUWHKg8quYEtIaJxuQ4vpQpXqCDkEUbwtxIhQ46xRhVhY9eyV_0.png",
      "alt": "GoliniPainting.com ad on Google SERP with the address listed"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/76/db/76db17c2fc0858bfec90ea099d6a0bf5/cf24e27b8dfbc1afc9ca1929596de435/G3k2sQzHpxnStpH-xuoNT47L_KV2nP-5O2h4leuTWP7hHDZwGqJClgTO6_eJQIEBxlFRBpjNz80ha9bEQHMuhurzOXtFIrZ5h8HSAuklX5p6VBOuhWHVL0VSvcYJjRDarhjrJjuvJwrUGRSA-16eMNQ.png",
      "alt": "Cars.com' ad on Google SERP with multiple sitelink assets"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/a1/51/a151e27c5dca2152b94e65355cebde4e/a2eff0bc1d757c0e845d97af35ecb885/XO4mdHnltC00N1B4SGEXjtpefrL2LPoxIiZHzpk1BIksNebN__Wk_R10mD2RqEGSHl7c9jV2X4hBOplUqghrAvVipF0RI1ELL4bHxkYKn5iD280basqW3W8_SV67Gk_-pH3P1SA3sBUrol9ApKCdHn4.png",
      "alt": "Amazon.com' ad on Google SERP with rating of 4.6 displayed"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/c3/f0/c3f04a20222610e77c1e2a33a5b24417/375b75255d60b69a1a4c5810d4815112/naVTw-NaeBeTy63Mrc2zZ_wy7ho57xswjzVZgAfpNBeGlD63jzMKvnRl9szZ_bYTCYFeOyWTSxsobnfpWOWI3hW9_3Lsh4pYTz3ZsqbNx1360WUxe74M7BZ48TQ8cb_N2aDONZvbHHkMk47xJXUynZY.png",
      "alt": "DoorDash's ad on Google SERP with a callout asset"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/58/8a/588aacd210c184885f6457e55e8bf047/c150a36b626b9d30cf9f4e002451edef/mySc23YQQi1UjFuyRG0ZgpFVkWarBRhaTSRj11K0D5OYthPF2CUZs4tsXMHgho0U8GP9EIiKpro4vtiFVXWUm5ULNfP_W2vOnxrxaWuqiujQ37oXZSbGznypsYD1piXABR4VL9MPOC3cQQuQQ7UFPO8.png",
      "alt": "An ad on Google SERP with a \"Call us\" button link displayed"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/34/b2/34b230e114a6be4000b218eebaaf98ac/00db673f142787cdb74d28cb1d1ccfe2/KlsMuA7pjMl47NVnV7JvNAUJvS2IZPnfJp1pGxBck_z_JFisX-7fAGeatt2E1zgOHiCbnIgI1_eDQHq12y2ypPmcc0q88mZa4m1NLhaid0aN6BKXIP8-s8yuDtwzhmY6nmCnCp6BfbHbTrXHhTsbJ7c.png",
      "alt": "“Campaigns” section in Google Ads dashboard"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/33/e7/33e7232553c4309698a28879bad23947/e719a1e1d7d04537d4f74be5da6a15c8/UqZFw3wFHpK1moiZY5jb_oJRb3kFcOPvuoOlo8LrNao9Uvq_DW1VjPuF0PzWseJp0SQyFwK76zeCA014gI97oe9EwlRyzLaAbSWAjhfgVVuiI6eWkk6VJnuSP6garthj47FDvT68XsgGixPDmj0_9Yg.png",
      "alt": "“Locations” section in Google Ads settings"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/2a/c4/2ac46a70f73e8cb35eddfea65b56fdf0/debfb5c30df401be4abdca293ea2205a/zeOuTupPFkA3Y-AuoICPBOood33t9eP75xH4_clhwkeukCLLHuDAnsRYLEH6wlTJnTOrRiUV9eggZtAbkNL2uRdqOlP2ty75urfQ1A7bbsuWjdgvXLjjXuS1TWKP0RJ2TFaF4_d2BhVuNm4CAfzIZxo.png",
      "alt": "Navigating to “Ad schedule\" in Google Ads"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/9b/48/9b484955074aec5189d45f4c24ae5def/c64e479174a491de9c9e9bfef8633162/OIe8FcF3uncXMti3xTb0GabocZ8bROo0_9SGROHPIv7WjLQWLmBV4l67SmxSxmEdeuzEyTv5beQidVtjpAATrdkn4L54obMG9Kmf9Gs4XFqRg0uyEc_ZdQNfpyxnRYqhreag-E3pHxdyFqyWFOh0Hxo.png",
      "alt": "Edit your campaign schedule and click \"Save\""
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&d=Mon%2C%2021%20Oct%202024%2014%3A17%3A11%20GMT&n=4d&b=8%20Google%20Ads%20Best%20Practices%20to%20Maximize%20Return%20on%20Ad%20Spend&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fgoogle-ads-best-practices%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&b=8%20Google%20Ads%20Best%20Practices%20to%20Maximize%20Return%20on%20Ad%20Spend&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fgoogle-ads-best-practices%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://bat.bing.com/action/0?ti=5128787&tm=gtm002&Ver=2&mid=d984d3fb-439b-4f01-ab27-5e7db529829a&bo=1&sid=27ecf1008fb711efa587cdeb1e779687&vid=27ed57b08fb711ef9060b51e9ad25c3d&vids=0&msclkid=N&uach=pv%3D10.0.0&pi=0&lg=en-US&sw=1600&sh=900&sc=24&tl=8%20Google%20Ads%20Best%20Practices%20to%20Maximize%20Return%20on%20Ad%20Spend&p=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fgoogle-ads-best-practices%2F&r=&lt=1290&evt=pageLoad&sv=1&cdb=ARoR&rn=245751",
      "alt": ""
    }
  ],
  "publication_date": null
}