{
  "url": "https://www.semrush.com/blog/google-shopping-ads/",
  "title": "Google Shopping Ads: Everything You Need to Know",
  "content": "Looking to drive more sales for your ecommerce business through Google Shopping ads?\n\nRead our guide to learn how Google Shopping ads work and how to set up your first campaign. Plus, find out our top strategies for improving your Google Shopping ads campaigns for optimal results. \n\nWhat Are Google Shopping Ads?\n\nGoogle Shopping ads are ads for product-related keywords that are usually displayed at the top of Google’s search results.\n\nThese ads can also be seen in Google’s Shopping tab, YouTube, the Google Display Network, and Gmail.\n\nHere’s a Google Shopping ads example you might have seen before:\n\nHow Google Shopping Ads Work\n\nWith traditional search ads, you bid on keywords (search terms) that you want your ads to appear for.\n\nWith Google Shopping ads, you upload a spreadsheet containing all your product information. Then, Google displays your ads for searches where it deems your products to be relevant.\n\nGoogle Shopping ads uses a cost-per-click (CPC) bidding system. Which means you’re charged only when a user clicks on your ad.\n\nGoogle Shopping Ads vs. Google Search Ads\n\nThere are three main differences between Google Shopping ads and regular Google Search ads:\n\nTargeting: With Google Search ads, advertisers can bid on specific keywords. This isn’t possible with Google Shopping ads.\nOffer: You can promote both products and services with search ads. Google Shopping ads are designed for product promotion only.\nAppearance: Google Search ads are displayed as links accompanied by text. Google Shopping ads are more visually appealing because they include an image of the product.\n\nWhich of these two ad formats is best for your needs?\n\nTo put it simply, both Google Search ads and Google Shopping ads are suitable for promoting physical products.\n\nIf you’re an ecommerce business selling physical products, experiment with both ad formats to see where you’re able to get better results. Keep in mind that Google Search ads and Google Shopping ads can be displayed at the same time for a search query.\n\nIf you sell something other than physical products (e.g., professional services, digital products, etc.), you’ll need to go with Google Search ads since your offering isn’t eligible for advertisement through Google Shopping ads.\n\nWhat Are the Benefits of Google Shopping Ads?\n\nYou might be asking yourself—are Google Shopping ads worth it?\n\nThey certainly can be. Using Google Shopping ads can help you:\n\nReach the top of the SERPs: With Google Shopping ads, you don’t have to work hard to outrank your competition in organic search results—your products can be displayed at the very top of the search results page by default.\nGet a better return on your advertising spend: Google Shopping ads tend to get better click-through rates and conversion rates compared to other types of ads.\nReach a broader range of customers: Google Shopping ads are displayed in other places compared to regular ads (e.g., on search results pages, the Shopping tab, YouTube, and the Google Display Network). This allows you to promote your products to a broader range of customers.\nHow to Set Up Google Shopping Ads\n\nIn this section, we’re going to go over the process of creating and launching a Google Shopping ads campaign.\n\nStep 1: Create a Google Merchant Center Account\n\nYou’ll need a Google Merchant Center account to create a Google Shopping ads campaign. If you don’t have one already, you can create one here.\n\nStart the process by clicking the “Sign up for free” button. You’ll then need to answer a few questions about your business.\n\nOn the next page, click on “Continue to Merchant Center.”\n\nEnter your business’ name and the country where it’s registered.\n\nClick on “Continue to Merchant Center.”\n\nThat’s it—you’ve created your Merchant Center account. You’ll need to do a few more things, though.\n\nThese include:\n\nAdding your business address\nVerifying your phone number\nConfirming the online store of your business\nAdding details to show how you ship products\nSetting up sales tax\nStep 2: Create a Product Feed\n\nNext, you’ll need to create a product feed to upload to the Merchant Center. A product feed is essentially a spreadsheet that contains all your product data.\n\nMost ecommerce platforms offer a way to automate the process of creating a product feed through tools, apps, or plug-ins. \n\nHere are a few options for some of the most popular platforms:\n\nShopify: Google & YouTube app\nWooCommerce: Google Product Feed extension\nAdobe Commerce: Google Shopping extension\nBigCommerce: Google Shopping Feed & Ads app\n\nFor those looking to create a product feed manually, you can use the product data specification provided by Google.\n\nStep 3: Upload Your Product Feed to Google Merchant Center\n\nOnce you’ve created your product feed, it’s time to upload it to the Google Merchant Center. \n\nIn the Google Merchant Center, click on the “Products” menu item in the left-hand menu and then on the “Add products” button.\n\nOn the next screen, choose the “Add products from file” option and then click “Continue.”\n\nYou can choose the country and language you’d like your product ads to be shown in.\n\nThen, either enter the URL of your product feed file or upload it from your computer.\n\nChoose an option, add your product feed file, and then hit “Done.”\n\nYour products will then be added to the Google Merchant Center automatically.\n\nEnsure your products are optimized for Google Shopping ads by using Semrush’s Product Feed Health Checker. The tool will analyze your product listings’ titles, descriptions, keywords, and more.\n\nThen, it will give you a list of things you can do to optimize your product listings.\n\nHere’s how to use it: \n\nGo to the Product Feed Health Checker page, click on “Check your Google Shopping feed,” and then either upload your product feed file or connect your Google Merchant Center account.\n\nThe tool will then analyze your product feed and provide you with a report showing how well your product listings are optimized for Google Shopping.\n\nClick on each product to see more details about issues you might need to fix.\n\nClick on the “Keywords ideas” tab to see a list of recommended keywords you should include in your product title or description.\n\nOptimize Product Listings\n\nWith Product Feed Health Checker\n\nStart Today →\n\nStep 4: Create and Launch Your Google Shopping Ads Campaign\n\nNow that you’ve uploaded your products to the Google Merchant Center, you can move on to creating your Google Shopping ads campaign.\n\nTo do this, you’ll need a Google Ads account. If you don’t have one, you can create it here.\n\nOnce you create an account and log in for the first time, you’ll be presented with Google Ads’ default onboarding flow. To speed things up, click on the “Switch to Expert Mode” link.\n\nOn the next page, select “Sales” as the campaign objective.\n\nGoogle Ads will then prompt you to choose a campaign type. Click on the “Shopping” option.\n\nDirectly below the \"Select a campaign type\" module, select your Google Merchant Center account.\n\nYou’ll then need to choose between the two available campaign subtypes:\n\nStandard Shopping: Allows advertisers to promote their products across Search, the Shopping tab, Google Images, Maps, and Google Search Partner websites\nPerformance Max: Uses Smart Bidding to help advertisers drive more conversions across Search, YouTube, Gmail, and more\n\nIn our case, let’s go with a Standard Shopping campaign. Finally, add a name for your campaign and hit “Continue.”\n\nOn the next page, you’ll need to tweak a few additional settings.\n\nFirst, choose a bid strategy. The ones you have available at this point include “Manual CPC,” “Target ROAS,” and “Maximize clicks.”\n\nNext, set a daily budget for your campaign.\n\nGoogle Ads also gives you the option to prioritize specific campaigns by selecting a campaign priority. This can be useful if you have multiple campaigns running that include the same product.\n\nYou can also select:\n\nWhere you want the ads to appear\nWhich devices they should appear on\nThe locations you want to target\nThe start and end date for your campaign\n\nEnter a name for your ad group. If you’ve selected the “Manual CPC” bidding strategy, you’ll also need to set your CPC bid.\n\nFinally, click the “Create Campaign” button.\n\nGoogle Shopping Ads Bidding Strategies\n\nThe two main types of bidding strategies available to you in Google Shopping ads are manual and automated bidding.\n\nManual Bidding\n\nWith manual bidding, you specify the maximum amount you’re willing to pay for each click on your ad. This is the most basic type of bidding strategy available on the platform.\n\nWhile manual bidding is great for controlling costs, it often results in inferior results for inexperienced advertisers due to a lack of expertise with PPC (pay-per-click) campaigns and no data on which to base manual bids.\n\nIf you’re just starting out with Google Shopping ads, you’re better off going with an automated bidding strategy.\n\nAutomated Bidding\n\nAutomated bidding is just what it sounds like—Google sets your bids automatically to help you reach a specific goal. \n\nThere are a few different automated bidding strategies currently available on the platform:\n\nMaximize clicks: Helps you get the most clicks possible out of your budget\nEnhanced cost-per-click: Adjusts your manual bid automatically based on the likelihood of a click resulting in a conversion\nTarget return on ad spend: Designed to get you the most conversions possible while staying within your target return on ad spend (ROAS)\n6 Google Shopping Ads Strategies to Maximize Your Revenue\n\nNow that you understand the basics of Google Shopping ads, let’s look at a few strategies you can use to get better results from your campaigns.\n\n1. Analyze Your Competition\n\nA good first step to making sure you get the most out of your Google Shopping ads is to analyze your competition’s ads.\n\nYou’ll want to analyze competitors’ listings to find out:\n\nWhich keywords they use\nWhat kind of product titles and descriptions they use\nHow they’re pricing their products\n\nSemrush’s PLA Research tool can be of great help here. You can use it to research competitor ads, see the number of search queries that trigger their ads, and more.\n\nHere’s how to use it:\n\nOn the PLA Research tool page, enter your competitor’s domain and hit the green “Search” button.\n\nYou’ll then be presented with a detailed report outlining your competitor’s advertising activity.\n\nThe “Positions” tab shows you the total number of keywords your competitor’s ads show up for, as well as the total number of ads they’re running.\n\nReview the specific keywords that trigger their ads and the associated product listings.\n\nCheck out the “Competitors” tab to discover more competitors you should potentially analyze.\n\nFinally, you can use the “PLA Copies” tab to see your competitors’ best-performing ads.\n\nCarefully review all the provided information and then take advantage of it to improve your own ads.\n\nResearch Competitors’ Ads\n\nWith the PLA Research Tool\n\nTry It Today →\n\n2. Optimize Your Product Titles\n\nThe product titles you use for your Google Shopping ads have a big impact on your click-through rate. With a poorly optimized product title, your ad might get very little or no clicks at all.\n\nFollow these guidelines to ensure your product titles attract clicks:\n\nUse a descriptive title. The product title needs to clearly describe your product (e.g., “Organic Cotton Men’s T-Shirt - Red - L”). There shouldn’t be any confusion about what the product is.\nInclude relevant keywords. Google uses keywords to understand whether your ad is relevant for a particular search. Make sure to add a relevant keyword to your product title.\nFrontload the most important information. Google gives you the option to include up to 150 characters in your product title, but anything over 70-100 characters will get cut off and not displayed in the ad. This makes it crucial that you include the most important information (and keywords) at the beginning of the product title.\nAvoid using all caps. The official product title guidelines for Google Shopping ads state that you shouldn’t use all caps in your product titles. Since using all caps is often associated with spam and untrustworthy ads, it might make searchers less likely to click on your ad.\nDon’t add promotional information. It’s against Google’s guidelines to add promotional information, such as price, shipping costs, or delivery dates, to your product titles.\n3. Choose the Best Images\n\nThe product image is often the first thing people will notice about your ad. Because of this, you need to make sure your product images are compelling and high quality.\n\nAlso, Google will block your campaign from running if your images are low quality.\n\nGoogle also offers guidelines you should follow to make sure your product images are on point:\n\nUse the right image size. At least 100x100px for non-apparel images and 250x250px for apparel images. Images shouldn’t be larger than 64 megapixels or 16 MB.\nShow the entire product. The image should display the entire product and include minimal to no staging.\nUse a white or transparent background. Opt for a white or transparent background to ensure your image works well with existing Google Shopping ads design elements.\nDon’t use images of anything other than the product. Avoid using placeholders, generic images, or illustrations.\nDon’t include promotional elements. You’re not allowed to include shipping information, discount offers, and warranty details in the image.\nSubmit a unique image for each product variant. If your product has multiple variants (e.g., for different colors), make sure to submit a unique image for each variant.\nShow the correct variant in your product image. Each product image should also show the correct variant.\n4. Use Negative Keywords\n\nWhen you use Google Shopping ads, sometimes, your ads will show up for irrelevant searches. To prevent this, you need to add negative keywords to your campaign.\n\nNegative keywords are search terms you don’t want your ads to show up for. For example, if you’re selling high-end furniture, you might not want your ads to appear for queries like “cheap couches” or “used leather sofas.”\n\nUsing negative keywords effectively can improve your ads’ click-through rates. And help you reduce advertising costs. \n\nThe best way to apply negative keywords to your Google Shopping ads campaigns is to create a negative keyword list.\n\nBut how do you know which keywords to add to your negative keywords list? This is where the search terms report comes in.\n\nThe search terms report shows you which search terms have triggered your ads.\n\nTo access the search terms report, log in to your Google Ads account and then go to “Campaigns” > “Insights and reports” > “Search terms.”\n\nHere, you’ll want to look for any terms that are irrelevant to your offering (e.g., search terms for products you don’t sell) and add them as negative keywords.\n\nKeep an eye on relevant search terms that are getting a lot of clicks but aren’t generating any conversions. You should add these as negative keywords to reduce wasted ad spend.\n\nTo add a search term as a negative keyword, check the box next to it and then click on “Add as negative keyword.” You can also select multiple keywords and add them to a list in bulk.\n\n5. Add Product Ratings to Your Ads\n\nReviews and ratings are some of the most important factors that impact purchasing decisions for consumers. Also, 77% of consumers stated in a survey that they considered a product’s average star rating when reading reviews.\n\nHaving a large number of positive reviews and high product ratings can help improve both the click-through rate and the conversion rate on your ads.\n\nNote that your ads won’t display product ratings by default. You need to request ratings to be added to your ads—and it’s up to Google to approve or reject your request.\n\nThere’s also a minimum requirement of having 50 reviews before becoming eligible for getting product ratings on your ads.\n\nTo make a request for ratings to be included in your ads, fill out this interest form.\n\n6. Make Sure Your Landing Pages Are on Point\n\nWhile the quality of your ad impacts how many clicks you get, it’s your landing page that’s going to have the biggest impact on how many sales you’re able to generate from those clicks.\n\nKeep Your CTA High on the Page\n\nAccording to a Norman Nielsen Group study, website visitors spent 57% of their time viewing the upper half of the website (also known as “above the fold”). Because of this, you should keep the most important elements of your landing page as high on the page as possible.\n\nThis includes your call-to-action (CTA) button (e.g., “Add to Cart” or “Buy Now”).\n\nThink about it—if visitors end up on your ecommerce website and can’t find the “Buy” button, they’re likely to leave without making a purchase.\n\nAdd Social Proof\n\nWhen it comes to online shopping, there’s always a degree of uncertainty involved. A shopper might be thinking:\n\nAre the products this website sells of high quality?\nAre the product description and images an accurate representation of the actual product I’m going to get?\nCan I trust this website with my credit card information?\n\nYou can ease shoppers’ uncertainty by including social proof on your landing page.\n\nSocial proof is a phenomenon where people copy the actions of others when determining how to behave in a specific situation. For a landing page, the most effective form of social proof are positive reviews and testimonials.\n\nIf shoppers see there are plenty of customers who are happy with your product, they’ll be much more likely to purchase it themselves.\n\nThis makes it crucial that you work on getting as many positive reviews for your products as you can. Here are a few tips that can help:\n\nAutomate review requests. Customers will forget to leave a review, even if they end up loving the product. Remind them to leave a review by sending an automated review request email.\nRequest reviews at the right time. When sending review request emails, be mindful of timing. Ensure customers have received the product before sending a review request—asking them for a review while they’re still waiting for the product to arrive can only cause confusion or frustration.\nProvide an incentive. Most people won’t bother leaving a review, even if you ask for it. A good way to encourage customers to leave a review is to offer an incentive, such as a discount or free shipping on their next order.\nImprove Page Load Speed\n\nBlazing-fast websites are the norm. If your page doesn’t load in a few seconds, many users won’t stick around—they’ll just close the tab and move on.\n\nSo, it’s not surprising that a website that loads in 1 second has a 300% higher conversion rate compared to a website that loads in 5 seconds. \n\nHere’s what you can do to improve the load speed for your landing page:\n\nUse image compression. Images, especially high-definition ones, can take a while to load. To speed things up, compress images using tools like Kraken or opt for more web-friendly image formats such as WebP.\nRemove unnecessary scripts. Another website element that’s notorious for decreasing load speed are scripts. Review the scripts you have running on your website and remove any you don’t absolutely need.\nUse a CDN. Use a content delivery network (CDN) like Cloudflare to deliver website content to visitors from servers that are physically closest to them.\nDrive Revenue Through Google Shopping Ads\n\nGoogle Shopping ads are a great way to drive more sales and revenue for your ecommerce business. \n\nBut this is only true if you know how to create profitable Google Shopping ads campaigns.\n\nFollow the tips we outlined above to inform your Google Shopping ads strategy and make sure you get a positive return on your ad spend.\n\nAnd remember to use Semrush’s Product Feed Health Checker and PLA Research tools to make your job easier.\n\nBoost Google Shopping Ads Performance\n\nWith the PLA Research Tool\n\nTry It Today →",
  "headers": {
    "h1": "Google Shopping Ads: Everything You Need to Know",
    "h2": [
      "What Are Google Shopping Ads?",
      "What Are the Benefits of Google Shopping Ads?",
      "How to Set Up Google Shopping Ads",
      "Google Shopping Ads Bidding Strategies",
      "6 Google Shopping Ads Strategies to Maximize Your Revenue",
      "Drive Revenue Through Google Shopping Ads"
    ]
  },
  "images": [
    {
      "src": "https://static.semrush.com/blog/uploads/media/4a/b1/4ab1fe848da964f8b97ecdde4d8a312e/google-shopping-ads.svg",
      "alt": "Google Shopping Ads"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/a3/e4/a3e47edd21c93481bd88062133b3327d/ec5f8e741c9ab7444818a58c46a21c95/AFLyAVtIpMFxdvmbfHT2vgfrqKxqQAWnkG5F9OXYfpkGVGrRWlbLEZZu5OFxdniLFaO7y_pmoC-GslgUO5eoZeGfhv5MbNmuY9NpROqdRtzoKb66FH1Gk1lZPRiW2OnhuDZt8NkdKRVuGkIuGEFd64w.png",
      "alt": "Google Shopping ads for \"headphones\""
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/6b/80/6b808858cc728ca114c3166ca7a06a6a/0ac50bed558ee79db21a627ca79cf332/LwTT8mNA6bvRhcrZuNegEpDycMZpvgW0h54hdytyvXb4XW8E7RR4ZSCroFJXnqXGwO7m2FCxr3JXxy6JDP-ottJ2VejMfQ2B1qHi7PuZX_50Pneii__4SutPwK8w85AM853x4y_QjM_bjTUYSHbaS3c.png",
      "alt": "\"Tell Google about your business\" window in Google Merchant Center"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ac/f2/acf29235c6b75851f54837f48d63bd8c/84de59ddec4c1eb722213e1604d17c0a/9FE5mzvbiXkMoVs_cAWPbWmiC56uCV724Vg83dXyCyHkuE1MUUZoVuiTh4HB3nlPk0D1xz65ewXfJBvTz8YBI828V3YCLgKHCE_luqCZmqn4mDod7kLkNOv8R6deVkT9_E7tRG3nzWy_qwNyDwSZ5zE.png",
      "alt": "\"What you need\" window with \"Continue to Merchant Center\" button highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/2a/1a/2a1a63a371c41d36e526ce7968b803c6/b927b06c43a3bbefca64af8fc0a89dfd/stGtqv_OZWWOzaSIVoqQ_I0HkTm24PX55N3XPvBfwImQPG10GNqaxDTeK39cRAnuuOvausLW1hp023Z3IguQO6AccfPA_JWZguDqdXBQay1fE5iBr5YSDVpJDvzq0f8QYJv4f0jgJhUSdV91yDSbD3Y.png",
      "alt": "\"Enter your business info\" window"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/00/c1/00c1691e60abb1f3807c58d23531fda5/5b1f9d99600636f52a2c3782c1278289/zunayF4tSDo9Hk5N2xv4vivjMgaEr6AO7GOtPNrDaPsyBM1eFOKaq6xJGk5AmwrycnEschsV-kiO210Xe3RUT4tLiNQDj1R-2lAKUBb-mNvsHIc_AB1fjhCzTSQkWmoQfU8iAUUg7AzK8vCmrNbTBX0.png",
      "alt": "\"Products\" selected for the Google Merchant Center menu"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/fe/97/fe972b69be65f7d218ee3c95dc84b17d/ab4b586c63f79a8f75a080eb39a8f0eb/qH_8ia1ag2exwkoBZSwaC16h3lUwav8frwXdxRbWO8PfAtag8lbtTMPyQ23QN7pTBbJUONJ-_j1B0R01xXaS4dGydGzjW2fFoJeaJyV35pb-HMoxuyZbTmXVzzSwCSqC7v16vE1dO2PEYl8bpQxjHgk.png",
      "alt": "“Add products from file” option selected under \"Add products to Google\""
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/c8/5d/c85d1552ad044f521cbfd57ae6323a7f/67eee75959b1a26101d3706a11bc6a68/JisZc4YAAx5thknj8XHgzEzemFg-gCtFkCj7a57t2RcIXUXoi6GRh8AkXrx7HFw9gR0xP_mGxLj1IQKbpWLegI7hEdPT_Cb5aj6EHDNAxSL47SUDWCMnqeYV2N6x99hEtk-XXwH-DR2HygTOwRQAYgI.png",
      "alt": "A\"Your products will show in United States in English\" message with editable country and language"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e5/12/e512c057ac17ce06e8d988745e3d2da7/4a74ed03838054ea8096c9076304691f/ljV5QHV-H0xG77OfxWNTjFQjjEshzv9kmnnrf6qmvQ-pTCxGaPwKJwAiTFZi6aOo4IQJoULyk_KV3aEq_tncFnGSuVXdnFVlUnM-pUnUz_UvAuCXF-LTjONxmcPrngEWfygwYUyMYmWG-hyXmqWrv4Y.png",
      "alt": "\"Enter a URL or upload a file\" window"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/69/ab/69ab8a28df7d0335c477d6792295460d/2ecdd6823d7883e6fb1e0ce1a66f57aa/kLWMl2imlPq5c-xAvE4qWJK7pG_Y2ncarZ2Yu895RCmLcxxCGSpAyqdQrPFEPlrUBFbc57QKYykUnCVSrHEQom-wGp8U6DO_rKnQS3ChNV2BDDvH3L_DvnPMLgb1CqZ_aFZdMIpL5zfEajIF6sF5SdM.png",
      "alt": "Product Feed Health Checker landing page"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/54/ff/54ffca0d2bc181bceb71b7947c8c520e/461a1cb0659aa241a00e245445eee7e7/mq9cJEh6zlv2aWJ37R70gObHgdKrNKKTiPEUskz4XzHdypAd1m3vaRRKzd-JobpO_9ToSgLHKvlzO_PqQ2XuOM49Z5-JZZVQPDisYYG5H2EUsLKK4dysqoHCqeITdvQywnD3hQMcm8sPj6DK3GOsvNg.jpeg",
      "alt": "Product Feed Health Checker's results for \"Yanko Everyday Store\""
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/7d/e3/7de3d222fae7e2893b248b13dff85e01/1a183a109795b0b16e18e55f66515d1e/2YPk9Mpb0Mq2UyhpXq0sQXw-KKFL4Zd2Tk66WvcNzrCHfJK8TxR5dVjZkAOE4WQRjqOo-hgKUtCzk2untBZBKNIplt1xkCwXkaXdmrgjOY1Kmzb45UFVfrqs3PLLgw6yYLE39k9_jpUlWJdpfJb4Hyc.jpeg",
      "alt": "\"Sunshine Serenade: Radiant Citrus Elixir\" product selected"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/54/34/5434d0d86dfe02c6c29704bc616df646/2bd8eb123e366e9cdfa207744ff9d7b5/UUWkGvA93CuXOFUvn93mYSy0LFV-KuG_By_zcbNs45EUdHoVKE-WjvdU7fPHqG_D1bXI3wwyMlmm6Fl8BAOnHae1qZwJooT61rjnKFsDK2MGqSpf3xGIH3d5LYSygBosTmzHlrMs3BhJ0dAPRZdrNuc.jpeg",
      "alt": "“Keywords ideas” for \"Sunshine Serenade: Radiant Citrus Elixir\" product"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/b2/c6/b2c6ea9b842cc79ea491441504f6a72c/206f21ae528fe14ed874563f3c881342/qe7zMLcDSxUHWX_2yL89ThyyILc-c3TJGf8oIVEniY0T6IVc35vGWWjYn6jYSFX7adXRNsGQY1epne1qtJ8mDuFUw0Ns4riLN24l6Eey85mQhnTt3CF3wvuIgwTQDT1qA3OkG95LMdAbWnUoqYS2T2o.png",
      "alt": "\"Let's get started! Set up your campaign quickly by linking accounts\" window in Google Ads"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/3d/c8/3dc83edfdbdc1a5a9ef78e0daf409ca5/37677ae93a1a71cdd7525735da762f53/9VnVUUWD4UKVcBpv7grsbOhvA5traKP05zrXUCpDwQg8YqX8RJvyoENWG_E4PSqEE4jsTCWaUY5M3ED-rqyznhGH4TIIskW5GNe1LLYpHS8eKo02CWlbI81tFIsia4dCtsGgVm9RbpYtUToc2oqsVxM.png",
      "alt": "\"Sales\" selected under \"Choose your objective\" section"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/a7/e7/a7e7cb160cb938924efad62d2b333ceb/442d0458c225fac371a289a7d5a263a1/dCEHeOXHvNAprd7nA8Vqubf86KkUxJvbH4tHl6qkXhbh-0hUFHOmZFGDjjHQZymKlzxWpXRd9Y5nHxykyZIIGao4VFUsOQTQh2Hb8NbHNcS9kHuq7YI7V2SOnHuJjU1aohL_uWUAYQcQ2EilGbZ510A.png",
      "alt": "\"Shopping\" selected under \"Select a campaign type\" section"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/80/4c/804c10436f039f22ca7613d545edcf50/897dd731c8d37d4ab2389d4d1bdfbee8/l1HkpzMGwR97b83QTdiro5fCV_Mdu1XPwjnQgNoACvdMMShw73NAxo8ASNX4Aa8muYPrkvHfoyERCGNzLJSIj4qPgCMFc4h2RLms7Sh20Gkh6NSIxns46_-qPpKDsL7dDruX9R9zUNQZSOSlq5_JwG8.png",
      "alt": "Google Merchant Center account selected"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/26/c5/26c567e948dcac270ea91e0e6eb1ca96/6515a4c524fde9ed15e33ee8ceb7dd35/9Bkmfznq6QqG_dpBACXnSWEnFT_i4vaTXtp1pd-NB_aLPARRPpmm4oFl1Zbh-u1ASBlARGRKmR8fMUYIXUNzHP691_ERvAUXbB6WULdpA6MAXfbid-V3mQnoCj8cpBiyZPMXuu5YnEX-of3B-hhTGVw.png",
      "alt": "\"Standard Shopping campaign\" selected"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/6d/03/6d03d44da856cda4dfa16a3ba0d973d2/f7fcfcb1a8b78bc307483cfb908e5a9b/sfGFrHWswCHmfllQmX5c4XQh8XSmf9knhUpdOGBJ2WP8DjJ-dZDnF_dN0R1j5rnE7jU-f9eVmJitLv_Gey_oBq4bywHAQjdZNhXZ34s9V9WtTBFUEXwRX1xpznREpsQKJ49JoIB6KeVxFODWVYcshOs.png",
      "alt": "\"Google Shopping Campaign\" added under \"Campaign name\""
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/46/5d/465d19893d51b436660130a35095045f/4f0e69f42d90c397941d1a5e6d923d8a/2FqD0Z_k8PzmqLunaduUaBoIGnc3YJJy_S35AnusG64J63IuDtEDX0LTD29UNxV3Ce5oNwAq1MGROwDC9aRaXXIH59MTk8UMno3sqUaH3LdgrvOOHG0eJtfUXdkBYifzrjlPTv8smFLh0PjB73VM1Hk.png",
      "alt": "\"Bidding\" section in setting up Google Ads"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/42/1f/421faf52b4d4870a494c02ccb755507d/ca60ec4267d153ed7edbfe6e79888f32/aXwdoVzYAGiDDk9HC032w3-m-xH9YNXb8tq486347pyFSVyf9Pvivdq4LBe1wb77Cv3xae9KuDEPU4InKlBymyCTianhZj_PxjhMetMMkCBw0t-ZMFnlVfQGuyNEcAkmARsNFKlxd0xr_A0BJ-fscr4.png",
      "alt": "\"Budget\" section in setting up Google Ads"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/1a/11/1a113d6727d85b76574f65b7234af69b/bf445670689f580e32293debc76ced07/QNnAEe0B1qtf8Lv2ajK8lgFBTKe1pQtIfNHyjayHrxwkj7OlN-O4zPah454BiaWctsk4chMlzmtIgWdqP5E-qDCTgfRpQIG43BZgFljkqttSHRXc-WAHCOyEcVFcALwtRk2sSJClnc2-6AZmWG0R9zE.png",
      "alt": "\"Campaign priority\" section in setting up Google Ads"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/47/ed/47ed4dd52b99ecd22adf2d981dc7e359/0406d7eb7d407cdc4b7d20b6a935588f/oZhOyyNhQCHxLrCiVs8nFOsDRzvYVZ6It8RRJOJBs_Gdc6gMajyqOpke0Zy8j4nLhmSFl51Nv2YqKuiRjkC-BRq2eIYSQE5hhgYDjWH6FEciXEojWibpNMLHZOgk0-Dw1yVBAyp4pJTGFF8FCP4LXW4.png",
      "alt": "\"Networks,\" \"Devices,\" \"Locations,\" and \"Start and end dates\" sections"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/37/a9/37a927487eb10a05e29a49d6351f1c0a/37c653f8d93052bf6cb245c9360f0f23/image.png",
      "alt": "\"Create your ad group\" section in setting up Google Ads"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/7c/64/7c640a0661bff0bddb61a8af30a15bac/11c98a5b0dac74e95d27553938be538f/z3wuqpvylCUpuAW7VkN3CUIb37ulr5GheqsvxaMehyBByUDB1C2Rg48h8sruUbO5l1lxdNs_fDWkh7Tzla95EE4P7Wus2DQt02ZR9jxoEdpku_lFRsPhgbMGqqk8jFGv29dBtFCLpH1VeEib4T0o840.png",
      "alt": "PLA Research tool search bar"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/a6/59/a659482cefe1cb9a22d32bfb0bd50643/27b80181104e14b2a6f0c333bd949acb/image.png",
      "alt": "“Positions” tab selected in PLA Research tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/b1/19/b119e6fd949fce2a364ac7b9d7b4f1b9/fd483c075a8dd57b61aaa36bec1ab858/image.png",
      "alt": "PLA Positions report"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/3b/98/3b98156e0803e97a9f5d636fde4fb3b6/76352d5e2f346145187ea3d96fcb079b/h6g1g1ClYDNZwLQr3AmC3QmXuuwxds6N2Myo4yd0tD6S061jNiawciRQpWsAhFJfeWjNtSsZMRqbLQyN3b0WU0Lue__ELJpfNvX2OH6fXNS8J7pMId4arnvVMkyxIExCl-pp3uJ4mSQqFWuUKW_5x1w.png",
      "alt": "“Competitors” tab selected in PLA Research tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/70/73/7073c9a6204d2aa0962d349862b0e451/e7f301a2c31ed440e95da11fbe26c467/DRRxhPyFU5pVJhcL0n_fJH4DU5ulMajRcGwwFw0ivsKpqMBGqPua7D3Obm6jgyY1M2NQlCcl-TBvhkrk593rGGyS5hJeFcsVclxJRB4r1Q6sWNAt0I4hSkVkTCCwgrOfaL2vgvkM41W_JZvxUZXl5vA.png",
      "alt": "“PLA Copies” tab selected in PLA Research tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/52/1a/521a057444cba9637aff30964f13269c/f6d8c9c1375e4257e3e02564fe110e68/image.png",
      "alt": "Google Shopping ads on SERP for red men T-shirts"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/1c/0b/1c0b6fc1dc252f26563ec85a0410a964/d3ddd7dd181a4ac50f82496ae0b72461/image.png",
      "alt": "\"Images\" for Amazon headphones listing"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/8f/f8/8ff8a4b2d66fc547a0de5f630f2f29af/a1e5a28e2325ac6d8f3466911a72b268/nKfO2zK-UlswwbvD3br7V7vZBFSybdTsciVNvD4VRiSxz9HFH3D7R1vcShtbwt3E4AVFB0_0j6bC25KXqziYLRPP9cl7ldxRRGaAgaayuMHStD9r8dn5LXt0LKkU4j0greplFBMLRJAFqo968QYOUZo.png",
      "alt": "Google Shopping ads search terms report"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/90/88/9088c55f5eaec7f43411f775edb250d0/3ac8f4115c50dc69f760b03ab10e101a/image.png",
      "alt": "Google Shopping ads for women's coats with ratings highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/cb/ff/cbffb1b30bcbe4383dca61a40299782b/70186b656dd0c1dda6b0293c24ed60c2/9oHduRZEB7Z_p2OLXi89dytDyLgNOwYqd4J9ecc-DZ0zSa26bvdpFxXxjAMyvGSMpF-fiNEei7tWyVOGQ_QjQUqTDzMCi8sIX_OO22EKVZnXzAmKrK7tyQyT12YnTMINTpHxpvqaBSSBw-HdubmmmaM.png",
      "alt": "Pull&Bear's product landing page with \"Add to my cart\" CTA highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/9d/fc/9dfc15e5cad91e0fbe9c6c5b2008b04a/0200fe485dd761dcdfd0206bd0d93aa1/fRmDrSc82agmW_8z-gNFeyPUi5Mqhrx8PXCV3i-YeIz_kryvzjrIJgfdVZBd4TThU2EwGvBSAoNbQxnpno9epgBRTZC0TAb1ls-JaWuXIjdJP5Y_GzeptqgFu7suXtCnrTQc3vtlvhZ95FoOQIhg2xw.png",
      "alt": "An example of an user review for men boots"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ac/d2/acd2a78fcd5e87a01a09c0619aa593fe/168300f2f62d5d4b0695012f3b536969/VrIWCJ3pqNOXPmmh4Dl3PMu8JAel6nUFHbSwnCKhtKmgH_wRHR76jlV1sFH9tnh_pEf94KnV-lYKieaNkbalbXVGPde8nRyxB_Mv-ZbadqCqpGdbQjZEtD6ukVNoT7rBOTEmWM6L3yxVLp3aUWJz3h4.png",
      "alt": "A graph showing that slow page load times increase bounce rate"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/semblog-next-static/banners/trial-gift.png",
      "alt": "Trial Semrush banner"
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&d=Mon%2C%2021%20Oct%202024%2014%3A17%3A04%20GMT&n=4d&b=Google%20Shopping%20Ads%3A%20Everything%20You%20Need%20to%20Know&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fgoogle-shopping-ads%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&b=Google%20Shopping%20Ads%3A%20Everything%20You%20Need%20to%20Know&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fgoogle-shopping-ads%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://bat.bing.com/action/0?ti=5128787&tm=gtm002&Ver=2&mid=71e99c81-2fc5-406e-8ebd-d4e81f2789bf&bo=1&sid=12a523d08fb711ef884ccb1036880927&vid=12a67be08fb711ef9b610bc8a0d2890d&vids=0&msclkid=N&uach=pv%3D10.0.0&pi=0&lg=en-US&sw=1366&sh=768&sc=24&tl=Google%20Shopping%20Ads%3A%20Everything%20You%20Need%20to%20Know&p=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fgoogle-shopping-ads%2F&r=&lt=845&evt=pageLoad&sv=1&cdb=ARoR&rn=207475",
      "alt": ""
    }
  ],
  "publication_date": null
}