{
  "url": "https://www.semrush.com/blog/google-search-algorithm/",
  "title": "How the Google Search Algorithm Works: A Zero-Fluff Guide",
  "content": "What Is the Google Search Algorithm?\n\nThe Google Search algorithm is a complex system Google uses to decide how pages will rank in the search results. \n\nThe algorithm is believed to consider hundreds of factors. \n\nContent relevance, quality, and the user experience (UX) are among the most important ones (more on each of these below).\n\nSide note\n\nThere’s more than one Google algorithm related to search. For the purposes of this article, we’re going to focus on those that affect rankings. And refer to potentially multiple algorithms as a singular algorithm for ease of understanding.\n\nHow Does Google’s Search Algorithm Work?\n\nThe exact details of how the algorithm works aren’t public information. So, trying too hard to understand it completely likely isn’t worthwhile.\n\nInstead, you’ll probably find it more useful to focus on:\n\nThe broader ranking process\nThe ranking factors that go into the algorithm\nGoogle’s Ranking Process\n\nHere’s a simple overview of what Google says about their process:\n\nGoogle crawls pages. That means Google discovers the page exists (e.g., by following a link from a known page to a new page or reading a sitemap).\nGoogle indexes pages. Google determines what the page is about and whether or not it is unique and high quality. Not every page will be indexed.\nIndexed pages are then served to users when they conduct a search. This is where the search ranking algorithm comes in. Pages are ordered by which ones Google thinks are most relevant and helpful.\n\nFurther reading: How to Get Your Website Indexed by Google\n\nLet’s focus on the last step. Which ranking factors matter most? And which factors aren’t part of the algorithm at all?\n\nWhat Are the Key Google Search Algorithm Ranking Factors?\n\nMany people in the SEO industry believe that 200+ signals (usually referred to as “ranking factors”) help determine ranking positions in Google. And they’re constantly changing as the algorithm is updated.\n\nThat might feel pretty overwhelming. In reality, though, just a handful of key areas cover some of the most important aspects of the Google Search algorithm.\n\n1. Content Relevance\n\nIf you want to rank for a target keyword, you first need to understand what the person is looking for. Then, create useful content that provides the relevant information.\n\nBefore you start trying to rank for a keyword, see which pages are currently ranking well. This will give you hints about what people are looking for.\n\nTake note of the format and type of content that is currently ranking. For example, do top pages display a list of products, or are the pages mostly informational? How is the information structured?\n\nHere’s an example. This is the results page for “fish oil.”\n\nIn this case, the top results are about health benefits. That means users are likely looking for these types of articles. Rather than the best fish oil products, for example.\n\nAdditionally, it’s good practice to include the keywords you’d like to rank for on your page. Include the keyword naturally in your:\n\nTitle tag\nURL\nH1\nMeta description\nBody text\n\nBut remember to keep it natural.\n\nAnd keep in mind that Google’s search algorithm aims to serve pages that are the best fit. Not just the pages that mention keywords the most times or in particular places.\n\n2. Content Quality\n\nGoogle wants to reward content that is people-first, not search engine-first. That means content that is helpful, trustworthy, and full of useful information that the searcher is looking for.\n\nOne way to improve content quality is to ensure you can demonstrate E-E-A-T (Expertise, Experience, Authoritativeness, and Trustworthiness). \n\nE-E-A-T isn’t a ranking factor, but it is an indication of quality content. And content quality does affect rankings.\n\nSo, how do you demonstrate E-E-A-T?\n\nFirst, implement some basics:\n\nPublish useful information that satisfies what the searcher will be looking for\nAdd value—don’t just regurgitate information that already exists elsewhere\nClearly cite any sources you use (and make sure they’re credible)\nBe consistent. Over time, readers will perceive your brand as a quality content source.\n\nBeyond those basics, if you have the means, consider utilizing authors who have subject matter expertise.\n\nShow off the authors’ credentials. And prove to the reader why this is a legitimate source of information.\n\nIf you can’t use expert authors, consider trying to source experts simply as contributors or reviewers. And once again, make sure that’s visible on the page.\n\nHere’s how Healthline reassures its readers that medical advice is reviewed by a qualified professional:\n\nLastly—if it’s relevant, be sure to demonstrate first-hand experience. It’s not the same as expertise, and a lot of readers will value it. \n\nLet’s take an example of a car review article. Some people might like to read the opinion of an automotive expert, while others might prefer to hear directly from someone who actually owns the car and uses it daily.\n\nFurther reading: What Is Quality Content & How to Create It\n\n3. User Experience\n\nGoogle wants to reward pages that deliver a great user experience. Which can mean:\n\nFast page load speeds\nA mobile-friendly design\nNo frustrating pop-ups or excessive ads\nClear navigation and website structure\nSecurity (HTTPS)\n\nPage load speed and Core Web Vitals (metrics that reflect the user experience) are definitely worth your attention.\n\nTo measure them, start by using Google’s free PageSpeed Insights tool. It generates a Core Web Vitals report, as well as suggestions on how to improve load speed.\n\nTo give you a starting point, here are some quick wins you can look out for in this report:\n\nOptimize your images. Make the dimensions only as big as necessary. And compress the file size.\nReduce unused JavaScript. Look out for code snippets that are no longer needed.\nReduce Cumulative Layout Shift (CLS) by ensuring images have specified dimensions\n\nTo go even deeper into your website’s user experience performance, try using Semrush’s Site Audit tool. \n\nHere’s how:\n\nGo to Site Audit, enter your website URL, and click “Start Audit.”\n\nWhen you create your first project, you’ll have a few settings to configure.\n\nIn most cases, the default settings work fine. But you may want to increase the limit of checked pages for larger sites.\n\nOnce you’re happy with the settings, click “Start Site Audit.”\n\nWhen the audit is complete, scroll to “Site Performance” or “Core Web Vitals” to get ideas for improving load speed and user experience. For instance, compressing images or removing unused JavaScript.\n\nFor high-competition topics with lots of relevant and helpful information, an excellent page experience could give you the edge in rankings.\n\nFurther reading: SEO Web Design: 10+ Tips to Build a Better Website\n\nImprove User Experience\n\nwith the Site Audit Tool\n\nTry for Free →\n4. Backlinks\n\nIf various other websites in an industry are linking to a webpage, that’s a good indication that the page is helpful and relevant. And Google wants to deliver helpful and relevant pages to searchers.\n\nThese links are known as backlinks. They’ve been a part of the ranking systems from the very beginning. \n\nAnd they’re still important today.\n\nIf reputable websites in your niche link to your content, that’s a positive sign that your content is helpful.\n\nTypically, the more popular a keyword is, the more competitive it is to rank and the more backlinks you’ll need to win the top spots.\n\nOne way you can figure out if backlinks (or a lack of them) might be preventing your content from ranking is by using a keyword research tool like Semrush’s Keyword Overview.\n\nIn addition to monthly search volume, the tool gives you a Keyword Difficulty (KD) estimate (higher = harder).\n\nType in your target keyword, choose a location, and click “Search.”\n\nIn the dashboard, you’ll see the KD with an estimated number of referring domains required to rank.\n\nTo take an even closer look at the impact of backlinks in any SERP, you can take a look at the top-ranking pages for that keyword. Check how many backlinks and unique referring domains they have.\n\n(You can see this by scrolling further down on the same page in Keyword Overview.)\n\nIn this case, there’s a clear gap in the number of backlinks between the #1 and the #2 results (Dogtime.com). \n\nAfter ensuring the content is as helpful as it can be, Dogtime.com could prioritize link building to try to close the gap.\n\nOn the other hand, here are the top results for “vanilla bean tea,” a lower competition query with 180 searches per month and a KD score of 5%:\n\nSince the top results have zero or very few backlinks, you might have a higher chance of competing with only high-quality content and topical authority (though external backlinks will still be beneficial).\n\nRun a Full Keyword Analysis\n\nwith the Keyword Overview Tool\n\nTry for Free →\n5. Topical Authority\n\nTo have “topical authority” for any topic, your site needs to cover it comprehensively. Over time, consistently publishing quality content around specific subjects builds credibility.\n\nGoogle doesn’t explicitly talk about topical authority as an algorithm factor (outside of Google News). Rather, it is a term coined by the SEO community. The concept is widely known, though, and there are lots of examples that may support it.\n\nHere’s one: Shopify and Amazon have topical authority on ecommerce. Google appears to trust their information and ranks them before other sites for many ecommerce searches.\n\nShopify is also more likely to attract backlinks on ecommerce topics, because authors are familiar with their brand and trust their expertise on that subject. Which, in turn, is likely to increase traffic and rankings for their ecommerce pages.\n\nYou can get started with building topical authority by creating topic clusters. These are groups of pages on similar topics, usually internally linked together.\n\nFor example, if you want to rank for “fish oil,” you’ll increase your chances of success by also publishing content on topics like:\n\nFish oil health benefits\nFish oil side effects\nThe best fish oil products\nDifferent types of fish oil\nFish oil vs. omega 3\n\nYou can use Semrush’s Topic Research tool to help generate data-driven ideas for developing clusters like this. \n\nContinuing with the “fish oil” theme, here’s what that would look like:\n\nFirst, add a topic. Then, choose your target country and click “Get content ideas.”\n\nThis gives you content ideas to build your topic cluster.\n\nStart by looking at those labeled “Topic Efficiency: High.” This means the keyword search volumes are high relative to the difficulty.\n\nClick “Show more” on any content idea to see questions, related searches, and more.\n\nIn this case, you might dive deeper into each benefit/side effect related to fish oil (e.g., high blood pressure). \n\nOr you could start creating content to answer long-tail questions like “Is cod liver oil bad for you?”\n\nThe key takeaway here is focus.\n\nIf you’re limited on resources, pick one topic cluster and cover it comprehensively. When you’re focused on one topic, it’s much easier to prove that you’re a trustworthy source of information.\n\nFind Out What Ranks\n\nwith the Topic Research Tool\n\nTry for Free →\n6. Context\n\nAlthough you can’t control it, it’s worth knowing that Google’s search algorithm also uses context as a ranking factor. For example, a search result can be personalized based on your search history or location.\n\nDisputed Ranking Factors\n\nIn the SEO community, some “ranking factors” are widely accepted by many, even though Google denies their significance as actual ranking factors.\n\nTo help you avoid wasting time on things that don’t affect the algorithm, here are three common ones.\n\n1. Domain Age\n\nNaturally, the longer your domain has been around, the more time it has to build authority and acquire backlinks. The age alone isn’t inherently an algorithm factor, though. \n\nSource: JohnMu on X (formerly Twitter).\n\nA single Tweet from a Google employee isn’t always definitive evidence to disprove a ranking factor entirely. That said, domain age (and the two factors below) have strong arguments against them.\n\n2. Bounce Rate\n\nGoogle says it doesn’t use any Google Analytics data in the ranking algorithm, and bounce rate is no exception.\n\nBounce rate is simply the percentage of sessions that were not engaged. The definition of an “engaged session” is one that either lasts longer than 10 seconds, has a conversion event, or has fewer than two page views.\n\nIt would be problematic to use bounce rate as a ranking factor. Because it doesn’t always indicate how helpful a page is. \n\nIt’s possible for someone to click on your page, get the answer they need quickly, and leave within a few seconds. That would be recorded as a bounce, even though the content was helpful and the user got the information they needed.\n\n3. Domain Authority\n\nDomain Authority (like Domain Rating and Authority Score) is a third-party metric that Google has repeatedly confirmed Google does not use in any way. For example, this statement by JohnMu posted on X (formerly Twitter) in 2018.\n\nA Brief History of Google Algorithm Updates\n\nThere are thousands of algorithm updates every year to improve the quality and relevance of results and prevent spam tactics.\n\nLet’s look at five significant updates through Google’s algorithm history.\n\nImpactful Algorithm Updates Through History\n\nName and Date\n\n\t\n\nDescription\n\n\t\n\nLearn More\n\n\n\n\nRankBrain, Oct 2015\n\n\t\n\nGoogle’s first deep learning model which helped to better understand new queries.\n\n\t\n\nRankbrain update\n\n\n\n\nHummingbird, Sep 2013\n\n\t\n\nAn improvement to how Google could understand the meaning of search queries and match them to relevant results.\n\n\t\n\nHummingbird update\n\n\n\n\nPenguin, Apr 2012\n\n\t\n\nAn update intended to penalize sites engaging in web spam SEO tactics like keyword stuffing.\n\n\t\n\nPenguin update\n\n\n\n\nPanda, Feb 2011\n\n\t\n\nAn update intended to reduce rankings for low-quality sites and content that isn’t very useful.\n\n\t\n\nPanda update\n\n\n\n\nFlorida, Nov 2003\n\n\t\n\nAn update to prevent simple manipulations of the algorithm, such as keyword stuffing.\n\n\t\n\nFlorida update\n\nFurther reading: A Complete List of Google Algorithm Updates\n\nThe Effect of Algorithm Updates\n\nGoogle algorithm updates can shift what is considered a ranking factor. And the importance of ranking factors. \n\nFor example, meta keywords previously affected rankings. But, after webmasters abused them by stuffing meta keywords on pages, Google released algorithm updates that diminished the importance. And, eventually, removed their impact entirely.\n\nAnd in recent years, algorithm updates like September’s helpful content update are increasing the importance of content quality and factors related to E-E-A-T.\n\nTo keep up, the best thing you can do is create high-quality content that is as helpful as possible, while following known SEO best practices. But be prepared to keep up with algorithm changes, and adjust those best practices accordingly (more on this soon).\n\nWhat to Do if Your Website Was Affected by an Algorithm Update\n\nIf you suspect you’re being negatively impacted by an algorithm update, here’s what you can do:\n\n1. Confirm There Was an Update\n\nFirst, you can follow Google’s official channels for announcements:\n\nThe Search Status Dashboard contains a list of all major updates\nGoogle Search Central provides regular news and updates on X (formerly Twitter)\n\nYou can also use Semrush Sensor, which reports on volatility in search results. It measures daily fluctuations for both mobile and desktop SERPs, broken down by industries and countries.\n\nIt also has a Personal Score, which lets you understand if/how updates are directly affecting your sites.\n\nTip\n\nClick “Subscribe to notifications” to get notified of significant fluctuations via either email or browser push notifications.\n\nIf there appears to be an update, move to the next step.\n\nHowever, say you’re seeing a drop in organic traffic or conversions, but there doesn’t seem to be an algorithm update. Here are some other things to consider checking:\n\nA competitor may have outranked you (check if they’ve updated or added content or gained new links)\nTracking errors (make sure your Google Analytics or other tools are working properly)\nSearch volumes could have dropped (e.g., due to seasonality or trends)\nUX issues on your website (e.g., broken links)\n\nFurther reading: 5 Things Holding Your Website Rankings Back\n\nDetect Google Algorithm Updates\n\nwith the Semrush Sensor\n\nTry for Free →\n2. Research the Update\n\nOK, so there was an update.\n\nNext, you need to figure out what Google is trying to improve. Which specific factors does the update seem to target?\n\nSometimes, Google will tell you directly. \n\nFor example, in April 2023, Google published a page explaining their product reviews update. It tells webmasters how the system works and what type of review content they aim to reward.\n\nOther times, you can learn from the speculation on X (formerly Twitter). And other online communities.\n\nAnd sometimes, you may need to dig deeper yourself. Take a look at some of the affected SERPs in your niche.\n\nWhat changed? Who is winning? Who is losing? \n\nNote what you’re seeing and any common patterns. (You’ll utilize this in a later step.)\n\n3. Understand Which Pages Were Affected\n\nTo finish gathering information and to make a plan of action, you need to know:\n\nWhich page rankings declined\nWhich page rankings (if any) improved\n\nIf you’re using Semrush’s Position Tracking tool, this step will be straightforward.\n\nSimply open the tool, click “Pages,” and look for the “Average position” column.\n\nCheck for any pages with significant declines in average position.\n\nIf you’re not using a rank-tracking tool, check your Google Search Console data. It might not give you the data you’re after as quickly as a dedicated rank tracker, but you’ll start to spot the trends after a few days if there’s a significant impact.\n\nTo find your traffic data, go to Google Search Console and click “Search results” in the left sidebar (or “Full report”).\n\nNext, click “Date: Last 3 months.”\n\nThen click “Compare” and choose a date range. \n\nTrack Your Rankings with Ease\n\nwith the Position Tracking Tool\n\nTry for Free →\n4. Make an Action Plan\n\nNow that you understand the goal of the update and which of your pages were affected, you can start to figure out a course of action.\n\nBefore you start making changes, though, wait for the dust to settle. Rankings tend to be more volatile in the early stages of a new update. So, reacting too quickly might lead to unnecessary work.\n\nWait until the ranking positions of your affected pages have been steady for a while. There’s no hard and fast rule for how long exactly to wait, but take into account all of the signals you have available to you. Semrush Sensor, your own websites, and community chatter.\n\nWhen it’s time to make changes, start by taking your list of pages and find a way to prioritize which are the most important. \n\nFor example, by traffic or conversions.\n\nOne by one, take a look at the SERPs. If you were previously ranking well but competitors have overtaken you, take a look at the newly ranked content.\n\nWhat’s different compared to yours?\n\nThe angle? The length? The structure?\n\nBy analyzing the top-ranking pages and comparing them to your own, you’re likely to spot patterns. Things that competitors have (and Google wants to reward) that you lack.\n\nFor example, you might notice that all the pages ranking above you offer helpful downloadable templates. Or that they provide long, in-depth answers while your content is more concise.\n\nFrom there, you can start working through your list. Update content accordingly. Make the changes you believe will make your content even more helpful than those currently ranking above you.\n\nFurther reading: How to Survive Google Updates: A Step-by-Step Guide\n\nGet Ahead of Google Algorithm Updates\n\nThe core purpose of Google’s updates is almost always the same—to make it easier for searchers to find the most useful content for their search query. \n\nIf you’re creating great content and focusing on helping users, you increase your chances of being rewarded by algorithm updates.\n\nOn top of that, here are two things you can do to get ahead of algorithm updates:\n\nFirst, subscribe to Semrush Sensor notifications to get the biggest possible head start on any changes.\n\nThen, set up rank tracking using Semrush’s Position Tracking to get quick data on the specific pages that gain and lose keyword rankings during future updates.\n\nTrack Your Rankings with Ease\n\nwith the Position Tracking Tool\n\nTry for Free →",
  "headers": {
    "h1": "How the Google Search Algorithm Works: A Zero-Fluff Guide",
    "h2": [
      "What Is the Google Search Algorithm?",
      "How Does Google’s Search Algorithm Work?",
      "What Are the Key Google Search Algorithm Ranking Factors?",
      "Disputed Ranking Factors",
      "A Brief History of Google Algorithm Updates",
      "What to Do if Your Website Was Affected by an Algorithm Update",
      "Get Ahead of Google Algorithm Updates"
    ]
  },
  "images": [
    {
      "src": "https://static.semrush.com/blog/uploads/media/8c/ee/8cee609a0acc68d6b4884cd95ab2daaf/google-algorithm.svg",
      "alt": "cartoon man writing about the Google Algorithm on a yellow chalkboard"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/46/f8/46f819d0f482880885bb5e9a63440b3a/b22b0dc2596a3c7b63d4c76beabc77f7/yCZ_4LRb22__iDwR2ub8VwGtwdMxF8jR1KyFn9TkQzo5lQlQjUVxX9hgmiHWkOJMcZJt8Bd5SgajhM0r3FlLsZ3Yx4LcL2yikWJPehXAFl9F4C9i5fyfSNxqswSTWf1pBNDdPJYHqzQyMXNW7OGbo94.jpeg",
      "alt": "Google's SERP for “fish oil\" query"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/a6/c5/a6c528f4a1e69070a72898c957cdfff7/e31a93aab9c95f3e32fa68acc7e27dcc/hZdlHsWLYzvbOY-DM90pFLDDttJOg6KIhUSNvH-_Z5trhMQ-ReadhIAh_u4Pr1n3FUXFEgO644x6xokVT8foON-pH8yDSOZjKPLaM98FdmaeBssJEzYfluf0h3olHPcnZsZarkD7Bd5vVFS9g9Azy0M.jpeg",
      "alt": "An example of Healthline's article \"medically reviewed\" by an healthcare professional"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/eb/64/eb64787ee4d781e8ade1a556f893d037/39e971c5981960f6e6d659ab0983e439/d3zSzHlNg425De6u4td_ggy1qjphgWDx84F63NfSDbFN1k99zRYWZiIPp8Ec_r8vDdJfMJFWsAIltQTaXv7QlD0VgWh3qqzi77rwNIry-VTgDn-546i7e7KiJ1IjM05unQz-WteJyJSFReuZyITXSN0.jpeg",
      "alt": "PageSpeed Insights's Core Web Vitals assessment report"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ee/30/ee3017c9325d1bbbe1b67a7898744ae4/319128e1798f7641a6737a08f5b3bd3b/t0FWYHDK50qeEyIsuKP15ofz35xSXjX50xtiqVwpPjHZnSX1LLjx2zt2YNFGQNHw1HHDyqv-j_lET19vAvQGVQawhfwVcSFpCqB33tnHDcwSFwXO6wt2eAXXhCm8hXuDBHZ5OP_RN88EBD41Rdm6BNM.jpeg",
      "alt": "Site Audit tool search bar"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/84/7b/847b8aefe51fce55e0fbd5de6383b30b/7fdc5a22204f7285c6098dbfe5b79c7a/Emi-QNWwkioYyjd3t_NY8N1eUbikl2h1RYGvYG2vu2FD_PVdSoIdSSXi4B2U-mh1iEtfoc6jllkMLLjHLu5nOi6MPPkzrPrr4WKHWIaT66N7Vw3fBP3GgntQsGy0h4zRih_Qytc1syOhVmziuMDiIJ0.jpeg",
      "alt": "\"Site Audit Settings\" window"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/75/ce/75ced1e61e857e6e6e8f3d209be36e26/b2d3db47f568e61aa37306fe961e1bfc/gz6jNi1bQmvmJGxtN06r-w8IU794dY5c_z2kDBBwaLkm-HWDfUFygBvMwkj3MMcLzlgj9Xfy26_VmUtLGti-bkM8tXEvKFcXdbBdQjSAbAY4Frcn2P5il-0FUAeEgHmUWEHWiBIferjN0SIU2QoybeQ.jpeg",
      "alt": "“Site Performance” and “Core Web Vitals” widgets highlighted in the Site Audit overview dashboard"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/9d/c0/9dc0659335dc2e9fb6db359e74782e3b/409b00e5dce423e7cf58bfc34b06ea59/8nJuH19xK-dtlqT1tlM1l0pAFyDBGNqeoN9EQawJ8Hh6PrbKSIhqKYV85Dmc57oL37ZI-7HKylOmNTKn6EHp1011cGi1RPc-bMKffLL2d5fSxmNMuvf8e12c2bhQJAsqx6BZiyHnfCuC900VKRsv5q4.jpeg",
      "alt": "\"dog breed\" entered into Keyword Overview search bar"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ac/49/ac4905f33039e41529b2b93e4b32c61a/e3003f39e8141e05a54745f11b5b9f0d/K6mS9DUDyZCmfaBpQBfUzvmIuQedyghADxJhly4rVb6sZjeVp_YwPfZp6kqa5qbkZXhrFElxHdsiRUUvEakl1yP3ijWVJ5oXcGHQSETfzmosj9Fv-J4xsBByaQvzt87o7PjTt3C5sF81vfeA-QAaxEE.jpeg",
      "alt": "\"Keyword Difficulty\" metric shows \"82%\" for \"dog breed\" keyword"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/17/a0/17a09c9115b38f1ddc48fd6dbc030f3e/aa3268f5ec0f7c2bc816547e20b4563e/HrXJCr96jOqO9kGjAhOeZanQ6tLbguOrdH8qRSFoB3vWC5gMidUGiYPRTlg4wiN1aeESTDujwlce_Eirg-zAOPSreEYW0ppyP0V-vtf6V59k2lZdBgy4M1qSoWTaZLerrM8YohDTvXLfR4i73oIQfyw.jpeg",
      "alt": "\"SERP Analysis\" section of Keyword Overview report"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/a7/0b/a70b7cd8052b9b889fb1d7372300e9ed/4c94db5ecc9aa6021b5451ddfaf8f2dc/PPN7VmiRfp6DXeZGkPGaAp2d_XzCcaisJkw3oQh1xJ17aqAPSXGvbLo5QPYaLs3nKP837VoEVJukRppGRThTnMsvvEMnmo2fY0D4B_hVHbkWEIKfuJVinAQWw_0sojqCUTxuK16KBDtPx5E386rRTVM.jpeg",
      "alt": "\"SERP Analysis\" section of Keyword Overview report for \"vanilla bean tea\""
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/7f/1f/7f1f00f504b6fec73e35f95953f1dd8c/076ee8caf972507886d5454ff74067c9/YkOUHWHbfKQWAeV47t6lOc_cJQrSrpLdLrmhUDV08DsObFhfT8G3oMDtuSMIccz20EAo2Rua02zF94tumNv8_M8CKtYuN_G4L3wZ9oHH4wYzHRjDBf4IIlUif5B-H2MLD3M6b-zDlNIcQz-pKVNhG-Y.png",
      "alt": "Google results for Shopify and Amazon highlighted under \"ecommerce\" query"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/66/20/6620dd7d3c5e75ff9e38b8c87b4a730d/c32abb4b02a7a6929522691a910805b9/-bOttk8l9yx6uGp9qeoVfGDfrq5tMO4IYjZJIjJn_baFOAAjW5ad7bwxXyzrz2PZ4XdSorkvEWRt3UBeVncEtRz7J2GmX0okO2uz8-qVEfEsHlp13gYNK2Ud4_XZ_N3ZRBcRf_d23ZUQtnAgX0VcyeI.jpeg",
      "alt": "\"fish oil\" entered into Topic Research tool search bar"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/59/3d/593d3f0a6a73e6303e20d961210da228/1c7688b6ea629d16f6d24d3051306a88/XeHqDn2f7WiFMUdVFcTcXgu0LttkqW7lyHgFrdxGcYhfsquQBxfAfewIdLYUpSFIE29NTqFPtPIC2viT1OIk-PQJNaGH-KzS9vEuMxTa7omN6vePKcI3hSrwn7AN9QipXreIZ_h5u_HMAgetnwuec_w.jpeg",
      "alt": "Results with “Topic Efficiency: High\" label highlighted under \"Content Ideas\" tab in Topic Research tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/b1/92/b1921cf53dab20e723360ab77ac2dccf/ca01fda921abc62d6a215088b5bd3acf/aSgvXFloh5dHay6Ez8tRYUPNbcxBOz9h6l-Tde17IOfmpWK-JGagt892cLkG-_RgSRT4xKVUblKvucukLDUlju-L4EPI1O-uM-babMnMeTZ4akN3R3xwXLG5vSGZzUwYj9oZYCB-fLeNBom0fX-Tak0.jpeg",
      "alt": "\"Headlines,\" and \"Questions\" sections opened under \"Cod Liver Oil\" content idea"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ff/b7/ffb7d3ce793dcc7232e3343b334f649a/33c0b4273471a87338f744f68096de90/cTm5Vk1h9LhigJnGhinaiJBhHhpv3pmBm9XWesavEi1U0D3nUz2NfaQeVxH64QtfYsI6g4CE5NRHnDWg1TiYVSiL72oj9Nwe1SFmHSqfZ6Qy2-1mNgdaN9OiUnDKcJ1oafO_765CWsgYMPsuI54iDGA.jpeg",
      "alt": "JohnMu's post on X saying \"No, domain age helps nothing.\"\""
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/3f/85/3f855bfc69b4ed983fbb272ab1b248ea/770672ce6a3dea9768124e495be164c2/SJOLVK-_wdS3hrvfugWGRwscSWIBNrLozct1mJPjiCJ4ge2bL2k0kzuDZboDvu3bmzE-AiuCIizfeHS3dcIdD7D28PNhsUxsj0hrlZiJCcL1z2Ya9EMrqqcYPfqHunH_SG6VYmVnPQxL0gNEWOTWv7k.jpeg",
      "alt": "@methode's post on X saying \"We don't use anything from Google analytics in the algo.\""
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/59/bb/59bbbd07e4c12eff7f671a7215a8f43f/88b07b9bdc05e84daf699bd5777c36e5/zgTGD5Audl7vYC-UqpbNT0_5i22iUYMYFp-YhKq1WwvBSh1O_ySG8kWpmMuG2lxj_mBVAXG61LJv_xW3Nv9VgtUoO_620xreZHA57i7byyimXkU6Tu9CV55Gu44HuIhHiol9_X5xRytzinS41Fb2-d0.jpeg",
      "alt": "JohnMu's post on X saying \"Google doesn't use domain authority.\""
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/25/67/25676411b8e86d5dd6cfd0d207896a05/eb5b0ebf127616d5a8ac52337aca6a7f/rJsWV-NcgRbtH5I3n5XJf2rCKHtgaFx78tesT6c-Qgv7mJO50O1Zbo9OMY669mHAcg99TgL3YtCqC4YnsywDgNmh-L8BCD3H3qoMUjMa3ty1bTyADNEjtV5nVwI71buwn8TujxDeTMnxFBZKGgnEAdM.jpeg",
      "alt": "An overview dashboard in Semrush Sensor"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/5a/1d/5a1d73904ea1f268540db6f063af48c6/239f8efdb9d4a0f3ffd5019aee329228/hXP72pbJrlezIwZ93kjkpNK9AvK5moY4VDFO6EwEoaFt47JI-WMpLdrJs3z7Cu_ipbs_JYdvIOCN0udewR8z1wrSHRu9g2t5GqsNjkbnnReOGqxkwQfEY-h-jXLpZBErTBGaaKwfWCG-ZWur4GOn3qc.jpeg",
      "alt": "hXP72pbJrlezIwZ93kjkpNK9AvK5moY4VDFO6EwEoaFt47JI-WMpLdrJs3z7Cu_ipbs_JYdvIOCN0udewR8z1wrSHRu9g2t5GqsNjkbnnReOGqxkwQfEY-h-jXLpZBErTBGaaKwfWCG-ZWur4GOn3qc"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/80/ab/80ab8d338ad3f16e6417fb422a694842/da4d57521cf57344653d4132a31f73a8/6-NTxFU6EV80U2tvJ7kCSgQVx9nyn-4HOszqZtJi96CZwBeGlBD6EGSvnExozlLbefTc24BSD7e79aHNnVLAuYK8PZ40wYyHNqQlGqFyf5J5H-hVr2fk-segEQ1Mr5oh0CTVgCABvlwQ1eE_9sJD98U.jpeg",
      "alt": "“Average position” column highlighted in the \"Pages\" table in Position Tracking tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e1/44/e144356007463946c4142b1318453d80/ab707e2886f4300ab260f6da5b6e237e/VZmtnGwSIj_U3NOoiZGTHa8ekZbhaz3TdpSrfwc0nm0kUhlAmHucDTcBgUIjO9IoonZrnPK56XKdU_7_f3ybhhGlF08M09XE1eIDkMKbIIthKIeRLkwY6g4j_x1blCg07GEfRAx63DgrF8aQQUmxmUQ.jpeg",
      "alt": "\"Full report\" button selected next to \"Performance\" graph in Google Search Console"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/64/3c/643c75dc060b30e54c394b5d3e306f91/21c5d25efa1ccdde97e1c0c441ae18c9/3YMnhZPVJDsBHQK-ssiDK_ApcgcylNwTXRInoUepmJgiBv1X_9KZxgHtQ6wJFwR9o5MNTxiUMA_MEAzFG1twBxmQBxgfThfJrMJYV1XUBkLez5JDQbwiRioJjgvlhpC1wFhURSEhJgJWN3OaZYFizlk.jpeg",
      "alt": "“Date: Last 3 months\" button selected in GSC's \"Performance on Search results\" page"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/47/fb/47fb270443f3e782532bdb7136829e1b/8bd4ec87acccc2a4eeaea9c9e4de6608/n7hcvuMzoDq1T68rGLmzepZCpjJMrAmoni11FnZhIjQpN900935mV68p95yjrJRzFHtsIvvWshvvTl00EZgfpWz9jd3cOmDbR3kVJ583_dG_RHOfUxNmDz5seKAT6JLADhYkYzE-X69PS6CPHAC6kn4.jpeg",
      "alt": "\"Compare last 28 days to previous period\" option selected under \"COMPARE\" window in GSC"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/semblog-next-static/banners/trial-gift.png",
      "alt": "Trial Semrush banner"
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&d=Mon%2C%2021%20Oct%202024%2014%3A13%3A23%20GMT&n=4d&b=How%20the%20Google%20Search%20Algorithm%20Works%3A%20A%20Zero-Fluff%20Guide&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fgoogle-search-algorithm%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&b=How%20the%20Google%20Search%20Algorithm%20Works%3A%20A%20Zero-Fluff%20Guide&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fgoogle-search-algorithm%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://bat.bing.com/action/0?ti=5128787&tm=gtm002&Ver=2&mid=59c1cf8b-4a31-4a52-9ca1-d4309f2c661e&bo=1&sid=9657ccf08fb611efa42075de9bdaae3c&vid=965849208fb611efa79e29b28a4a2f9c&vids=0&msclkid=N&uach=pv%3D10.0.0&pi=0&lg=en-US&sw=2560&sh=1440&sc=24&tl=How%20the%20Google%20Search%20Algorithm%20Works%3A%20A%20Zero-Fluff%20Guide&p=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fgoogle-search-algorithm%2F&r=&lt=855&evt=pageLoad&sv=1&cdb=ARoR&rn=178224",
      "alt": ""
    }
  ],
  "publication_date": null
}