{
  "url": "https://www.semrush.com/blog/google-ads-bid-strategy/",
  "title": "The Ultimate Guide to Google Ads Bid Strategy (with Examples)",
  "content": "What Is a Google Ads Bid?\n\nA Google Ads bid is the amount you’re willing to pay for a click on your ad.\n\nThis bid plays a crucial role in determining where your ad appears on the page (also known as its placement).\n\nBetter ad placement can significantly influence how your ad performs. This can mean more clicks, more visitors to your website, and more opportunities for your business to increase its ROI.\n\nHow Google Ads Bidding Works\n\nFor every ad space Google has available—whether on a search engine results page (SERP) or within the Google Display Network (GDN)—Google Ads runs an auction where marketers can bid on the ad space.\n\nThe higher your bid, the better your chances of winning and getting your ad placed in the available space. \n\nBut it's not just about the highest bidder.\n\nGoogle Ads considers several factors when choosing who wins each auction, including:\n\nMax cost per click (CPC): The maximum amount you’re willing to pay for a click on your ad\nQuality score: This metric evaluates the quality and relevance of your ad based on the expected click-through rate (CTR), ad relevance, and landing page experience\nAd Rank thresholds: Google Ads sets minimum quality thresholds for ads to ensure users see high-quality advertisements. Your ad must meet these thresholds for it to appear.\nAuction competitiveness: The closer the ad ranks of two competing ads, the more evenly they compete for the same spot. For example, a larger gap in Ad Rank increases the likelihood of the higher-ranked ad winning but at a potentially higher CPC due to the certainty of its placement.\nSearch context: Google Ads considers the searcher's context, including factors like their search terms, location, device type, and time of search, to deliver the most relevant ads\nAd assets and formats impact: Adding ad assets like phone numbers or additional links can enhance your ad's effectiveness. Google Ads predicts how these assets and formats will influence your ad's performance, aiming to improve visibility and engagement.\n\nThe above factors, including your industry’s competitiveness, determine your Ad Rank.\n\nA higher Ad Rank can mean a more prominent placement on Google’s SERPs or GDN, even if your bid is lower than others.\n\nThat's why it's important to both design quality ads and develop a successful Google Ads bidding strategy. Winning high-quality ad placements can get your ads more clicks and conversions, increasing the ROI on your Google Ads spend.\n\nHere’s a summary of how Google Ads bidding works:\n\nChoose a Google Ads bid strategy: Decide how you want to bid. Google offers several strategies. For instance, you can bid to get more clicks to your website, more visibility for your brand, or more conversions, like sales or signups.\nSet your bid: Let’s say you choose to bid for clicks. You tell Google, “I’m willing to pay up to 50 cents for each person who clicks on my ad.” That’s your bid.\nEnter the auction: Every time someone searches on Google, the auction starts. Google checks if your ad matches what the person is searching for. If it does, you enter the auction with other advertisers bidding for the same keyword(s).\nWin the auction: Google looks at how much you bid and how relevant your ad is to the searcher. It’s like being in a farmers market where you're trying to sell the best apples. If your apples (ad) are exactly what a buyer (searcher) is looking for, and your price (bid) is right, you're more likely to make the sale. Just as the quality of your apples and how much you ask for them determines your success at the market, in Google Ads, the relevance of your ad and your bid amount determine your ad's visibility.\nPay for the ad: You only pay what’s needed to outbid the next advertiser. If you bid 50 cents, but the next highest bid is 30 cents, you might only pay 31 cents for that click.\n\nNote\n\nYou can set a budget to control your daily spending. Once you reach your budget, your ads stop showing for that day.\n\nTypes of Google Ads Bid Strategies\nManual Cost-per-Click (CPC) Bidding\n\nManual CPC bidding allows you to set and adjust your bids at the keyword or ad group level. Simply specify the highest amount you’re willing to pay for a click on your ad for each keyword.\n\nThis hands-on approach is ideal if you prefer direct control and have the time to manage your campaigns actively. However, it requires much attention and consistent oversight to maximize its effectiveness.\n\nAutomated Bidding\n\nAutomated bidding strategies in Google Ads use algorithms to optimize bids for your ads. These algorithms focus on performance goals to maximize the likelihood of clicks or conversions. \n\nThis type of strategy is an excellent example of PPC automation that saves time while optimizing your ad campaigns for better ROI.\n\nAutomated bidding is ideal to reduce the time spent on bid management without harming ad performance.\n\nSmart Bidding\n\nSmart bidding is a subset of automated bidding strategies for Google Ads, focusing on optimizing for conversions or conversion value in real time. \n\nThis type of bidding strategy uses Google’s AI at each auction—known as “auction-time bidding”—and considers several auction-time signals like device, location, and time of day to increase each bid’s precision.\n\nSmart Bidding is ideal if you want to use AI for enhanced bidding efficiency, especially in cases where conversion optimization is your primary goal.\n\nHow to Choose a Bidding Strategy Aligned with Campaign Goals\n\nMatch your Google Ads bidding approach with your specific advertising objectives. Whether your focus is on clicks, impressions, views, or conversions, the right strategy can significantly impact your campaign’s success.\n\nFor example, a campaign aiming for immediate sales might benefit more from conversion-focused bidding. While one looking to build brand recognition may prioritize impression-based bidding.\n\nConsider these five basic types of goals to choose the bidding strategy that fits best:\n\nFor direct actions and conversions: Smart Bidding can optimize bids for each auction based on the likelihood of conversion if you want to drive direct actions on your site, like purchases or signups\nGenerating website traffic: CPC bidding allows you to pay only for the clicks your ads receive, making it a cost-effective approach if increasing site visits is your goal\nBoosting brand awareness: Cost-per-thousand-viewable-impressions (vCPM) bidding is beneficial when you want your message to reach a large target audience, paying for every thousand times your ad is displayed\nIncreasing video ad views and interactions: Cost-per-view (CPV) or cost-per-thousand-impressions (CPM) bidding is suitable for video campaigns if you want to boost views or interactions with your ads\nProduct or brand consideration through video ads: CPV is effective for campaigns to increase interest in your product or brand through video content\nGoogle Ads Bidding Strategies Explained\n\nUnderstanding each bidding strategy is vital to achieving your search engine marketing (SEM) objectives, like generating leads and boosting sales. \n\nLet’s explore each Google Ads bidding strategy in detail, with insights into when and why to use them and their advantages and limitations.\n\nManual Cost-per-Click (CPC) Bidding\n\nThis strategy is ideal for campaigns that generate website traffic because it allows for precise budget control. Its primary goal is to drive traffic while you maintain control over each cost per click. Choose it if you prefer a direct handle on your campaign costs.\n\nHow Manual CPC Bidding Works\nDecide the maximum amount you're willing to pay for a click on your ad\nManually adjust bids to manage spending and meet your advertising budget\nFrequently monitor and change bids to optimize ad performance\n\nFor example, a business selling high-value items like electronics might use Manual CPC to control costs while targeting high-intent buyers.\n\nAnother example is a local service provider, such as a plumber, who could set bids for specific services to maximize ROI.\n\nManual CPC bidding is available for both the Search and Display Networks.\n\nAdvantages of Manual CPC Bidding\nRespond quickly to market changes or campaign data\nAllows for detailed management of bids at the keyword or ad group level\nAdjust bids for high-performing keywords or placements to allocate budget effectively\nLimitations of Manual CPC Bidding\nConsumes a lot of time\nDemands constant oversight and regular adjustments\nPotential risk of over or underbidding due to manual handling\nEnhanced CPC (ECPC) Bidding\n\nEnhanced CPC (ECPC) bidding is a semi-automated strategy that modifies your manual bids to increase the chances of conversions. It’s ideal if you want to balance manual control and automation efficiency.\n\nHow Enhanced CPC Bidding Works\nAdjust your manual bids for each auction based on the likelihood of a click leading to a conversion\nUse auction-time signals like browser, location, and time of day for bid optimization\n\nWhile ECPC aims to keep the average CPC under your maximum set bid, it can exceed this max CPC temporarily for high-potential opportunities that can lead to conversions.\n\nFor example, if you’re selling cakes and set your max CPC to $1, ECPC might increase your bid to $1.70 for an auction likely to lead to a store visit. But reduce it to $0.30 for one more likely to lead to a website visit without a conversion.\n\nECPC is available on the Search Network and Display Network (except for app install campaigns).\n\nAdvantages of Enhanced CPC Bidding\nBalances between manual control and automated efficiency\nCan adapt bids for higher value conversions, prioritizing more profitable clicks\nOffers more manual control compared to fully automated Smart Bidding strategies like target cost per action (tCPA) and target return on ad spend (tROAS)\nWorks alongside your campaign settings, adjusting bids within the confines of your max CPC\nDoes not require setting explicit targets for CPA or ROAS\nLimitations of Enhanced CPC Bidding\nOptimal performance with ECPC depends on implementing conversion tracking to guide bid adjustments\nECPC can temporarily increase your average CPC to exceed the maximum CPC bid for opportunities deemed likely to result in conversions\nCost-per-Thousand Impressions (CPM) Bidding\n\nCPM bidding prioritizes visibility and brand awareness over direct clicks or conversions. This strategy allows you to bid and pay for every thousand impressions your ad receives, making it ideal for campaigns where exposure is the main objective.\n\nHow CPM Bidding Works\n\nYou implement it based on these use cases:\n\nBrand awareness campaigns: For increasing brand visibility and recall\nVideo ad campaigns: For campaigns aiming to boost views or interactions with video content\nGoogle Display Network: For display ads where the focus is on how many times the ad appears\n\nFor example, let’s say a company is launching a new product line. \n\nThey can use CPM bidding to increase the likelihood that their promotional ads reach a vast audience across the GDN to promote product visibility and brand recognition.\n\nAnother variation of CPM is viewable CPM (vCPM), which enables you only to pay when users can see your ads.\n\nAdvantages of CPM Bidding\nBroadens your ad's reach for increased brand exposure\nProvides control over impression costs, effective for managing budgets in awareness campaigns\nLimitations of CPM Bidding\nPrioritizes ad exposure over engagement, potentially leading to spending on ads that don’t result in clicks or conversions\nTarget Cost-per-Action (CPA) Bidding\n\nTarget CPA bidding helps you optimize for conversions while sticking to an average cost per action. This automated bid strategy is ideal when you have a clear ROI target and want each conversion to bring similar value to your business.\n\nHow Target CPA Bidding Works\nGoogle Ads sets bids to achieve as many conversions as possible at your targeted CPA\nGoogle Ads uses your campaign’s historical information and real-time contextual signals at auction time\nWhile some conversions may cost more than your target, others may cost less. Google aims to balance these to align with your set target CPA.\n\nLet’s say you set a target CPA of $5. Google Ads will then aim to secure as many conversions as possible at this average rate, employing auction-time adjustments based on various signals to enhance the bid’s effectiveness.\n\nSome conversions may be above $5, but some may be below $5. However, the average will equal approximately $5.\n\nAdvantages of Target CPA Bidding\nAdjusts bids using real-time signals such as device, location, and time of day\nHelps in achieving a specific return on investment by maintaining a consistent cost per action\nLimitations of Target CPA Bidding\nDespite targeting a consistent CPA, actual CPA may fluctuate due to external influences such as changes to the website or shifts in market competition\nTarget CPA bidding requires historical conversion data which may be unavailable for new campaigns or those with low conversion volumes\nTo maintain CPA targets, Google Ads might limit ad exposure in more competitive or expensive auctions, potentially reducing overall visibility\nTarget Return on Ad Spend (tROAS) Bidding\n\nTarget ROAS bidding is a Smart Bidding strategy that allows you to optimize your campaigns for conversion value relative to your ad spend. This strategy is ideal when you have specific ROI targets and different conversions have varying values.\n\nHow Target ROAS Bidding Works\nUses Google’s AI to predict the value of a potential conversion at the time of a user’s search\nAdjusts bids in real time to maximize conversion value while aiming to achieve your specified ROAS\n\nFor instance, let’s say you run an online mug store. \n\nYou aim to make $13 in sales for every $10 spent on advertising, setting your target ROAS at 130%. Google Ads will adjust your bids to increase the value of conversions while trying to maintain your ROAS at 130%.\n\nAssigning accurate values to the conversions you’re tracking will help you better understand your campaign’s ROAS and optimize your marketing efforts for maximum effectiveness.\n\nAdvantages of Target ROAS Bidding\nIt’s available for use in both standard and portfolio strategies (strategies that use Google AI to set bids to help you reach your performance goals) across multiple campaigns, including Search and Shopping ads\nIt factors in real-time signals like device and location for bid adjustments\nLimitations of Target ROAS Bidding\nMost campaign types need at least 15 conversions in the last 30 days to use this strategy effectively. This data provides a reliable foundation for the algorithm to predict future performance.\nGoogle AI needs a substantial history of conversions to make more accurate predictions and adjustments, ensuring that your target ROAS is based on solid, real-world data\nMaximize Conversions Bidding\n\nMaximize conversions bidding uses your entire budget to secure the most conversions. This Google ads bid strategy is ideal if your primary goal is to use up the budget without targeting a specific ROI or CPA.\n\nHow Maximize Conversions Bidding Works\nAnalyzes your campaign’s past performance and considers real-time contextual signals during each auction\nAdjusts bids dynamically to secure the most cost-effective conversions within your budget\nTailors bids for each auction to increase the chances of winning valuable ad placements\n\nFor example, a retailer looking to clear seasonal inventory could use a maximize conversions bid strategy to ensure Google Ads uses their entire advertising budget. This approach maximizes exposure and potential sales without targeting a specific cost per sale.\n\nAdvantages of Maximize Conversions Bidding\nAims to fully use your daily budget to get as many conversions as possible\nAdjust bids for each auction in real time to maximize conversions within your budget\nQuickly adapts to search behavior and competition changes for more competitive bids\nLimitations of Maximize Conversions Bidding\nIt aims to spend your entire budget, which might lead to increased spending if your current expenditure is below your set budget\nIt’s not ideal for campaigns with specific ROI goals like target CPA or ROAS\nIt requires monitoring after implementation to ensure it aligns with your campaign goals and doesn’t overshoot your budget\nMaximize Conversion Value Bidding\n\nMaximize conversion value bidding is designed for campaigns that aim to optimize for the highest possible conversion value within a given budget. This strategy is ideal when conversions hold varying degrees of value for your business and you’re not targeting a specific ROAS.\n\nHow Maximize Conversions Value Bidding Works\nUtilizes AI to set bids at auction time and aims to maximize the total value of conversions, like sales revenue or profit margins\nTends to use your specified budget to optimize for the highest conversion value\nConsiders real-time signals and historical data to determine optimal bids for each auction\n\nUse maximize conversion value bidding if specific conversions (like selling a high-end product) are more valuable than others. Or, for campaigns with varied conversion goals. Such as different product categories or services with varying profit margins.\n\nAdvantages of Maximize Conversions Value Bidding\nFocuses on maximizing the total conversion value within your budget, which is ideal for ROI-driven campaigns\nAdapts to real-time market changes and search behavior, potentially increasing conversion value under varying conditions\nLimitations of Maximize Conversions Value Bidding\nPerformance is heavily influenced by the set advertising budget, which can limit its effectiveness if the budget is too low\nDepends on accurate conversion tracking and value assignment to gauge performance effectively\nOffers less control over targeting specific types of conversions, focusing instead on overall value\nWhile aiming to maximize value, it may also lead to higher costs per conversion in competitive markets.\nTarget Impression Share Bidding\n\nTarget impression share bidding helps you to maximize your ad’s visibility in Google’s SERPs. This strategy focuses on placing your ad at the top of the page—either at the very top, among the top positions, or anywhere else on the search results page, depending on your settings.\n\nHow Target Impression Share Bidding Works\nYou set the desired percentage of ad impressions your campaign receives. It’s effective for campaigns prioritizing brand visibility, especially when targeting specific brand terms.\n\nFor example, let’s say you run a local grocery store competing with bigger stores. \n\nA target impression share strategy can help ensure your brand remains visible in crucial searches. If you want your ad to appear 100% of the time for searches related to your brand, setting the target impression share to 100% aims to achieve this visibility.\n\nAdvantages of Target Impression Share Bidding\nIt aims to increase the likelihood of your ad appearing in the desired position, thereby boosting brand presence\nIt allows you to implement precise targeting based on where you want your ads to show up in the search results\nLimitations of Target Impression Share Bidding\nThis strategy may not align with every campaign’s goals, especially those not focused on brand visibility\nMay lead to higher costs in competitive markets to maintain desired impression share, impacting budget efficiency\nMaximize Clicks Bidding\n\nMaximize clicks is an automated Google Ads bid strategy that tries to get as many clicks as possible within a specified budget. This strategy is ideal if your primary goal is driving traffic to a website.\n\nHow Maximize Clicks Bidding Works\n\nWhen you select maximize click bidding, Google Ads automatically sets your bids to attract the highest possible clicks within your average daily budget.\n\nFor example, if you have a seasonal promotion, using maximize clicks can help drive substantial traffic to your offer page without exceeding your budget.\n\nAdvantages of Maximize Clicks Bidding\nEfficiently uses your budget to increase the total number of visits to your website\nOffers the option to set a maximum CPC bid limit to prevent overspending on a per-click basis\nIdeal for campaigns with the primary goal of driving traffic, requiring less hands-on adjustment and oversight\nLimitations of Maximize Clicks Bidding\nPrioritizes increasing click volume potentially at the expense of click quality, which may not align with specific conversion value or goals\nMay attract clicks from less relevant audiences, leading to lower conversion rates\nWithout setting a maximum CPC bid limit, you might pay more per click than intended, affecting cost efficiency\nCost-per-View (CPV) Bidding\n\nCPV bidding is ideal for video ad campaigns where engagement, such as views or interactions, is the primary goal. It’s especially effective for campaigns that increase product or brand consideration through video content.\n\nIn CPV bidding, you pay for video views and interactions, like clicks on call-to-action (CTA) overlays, cards, and companion banners.\n\nFor this bid strategy, Google Ads counts a view when someone watches 30 seconds of your video ad (or its entire duration if it’s shorter than 30 seconds) or interacts with the ad. This method allows you to set the maximum price you’re willing to pay for a view when setting up your video campaign.\n\nHow CPV Bidding Works\nYou decide to advertise on a platform like YouTube, where CPV bidding is commonly used\nYou target your ad to local viewers who have shown interest in your product or service. Let’s say it’s baking, cooking shows, or cake decoration.\nYou set a CPV bid, which means you’ll pay each time someone watches a significant portion of your video\nSince your video is engaging and showcases the quality and artistry of your cakes, viewers who watch it are more likely to be interested in visiting your bakery\nYou only pay when someone watches your video for 30 seconds or interacts with the video, making it a cost-effective way to ensure potential customers see your ad\nAdvantages of CPV Bidding\nIdeal for campaigns where video interaction is more valuable than clicks to a website\nHelps you manage your budget effectively as you set the maximum amount you’re willing to pay per view or interaction\nProvides video ad reporting with data on how viewers engage with your content\nLimitations of CPV Bidding\nLess suited for campaigns where the main objective is to drive traffic to a website rather than engage with video content\nTips for Google Ads Bidding\n\nAdjust your bids and test automated strategies to improve your Google Ads. Here are some practical methods and tools for better campaign targeting and efficiency.\n\nUse Bid Adjustments\n\nA bid adjustment is a percentage change applied to your bids, giving you the flexibility to bid more or less in certain situations. \n\nBid adjustments enable you to modify your bidding strategy based on specific factors like device type, location, and time of day. This customization enables you to allocate your budget more effectively by increasing bids in scenarios where your ads perform best.\n\nFor example, let’s say you’re running a campaign for a coffee shop. \n\nYou notice that your ads get more clicks during early morning hours. You could set a bid adjustment to increase your bids by 30% from 6-10 a.m., enhancing your ad’s chances of appearing during this prime time.\n\nThe types of bid adjustments include:\n\nDevice: Adjust bids for different devices like computers, tablets, or mobile devices\nLocation: Modify bids for ads served in specific geographic areas\nAd scheduling: Change bids for campaigns during certain days or hours\nTargeting methods: Apply adjustments for topics, placements, and other targeting methods on the Display and Search Networks\nRemarketing lists for Search Ads: Adjust bids for users on specific lists to optimize remarketing campaigns\nInteractions (call adjustments): Increase bids for mobile devices to enhance the frequency of call interaction ads\nDemographics: Modify bids based on gender, age, and household income demographics\n\nTo add a bid adjustment, click “Campaigns” > “Audiences, keywords and content” in your Google Ads account.\n\nSelect the element you want to modify from the drop-down menu. Here, we chose “Locations.”\n\nClick the pencil icon under the “Bid adj.” column to edit the bid adjustment.\n\nSet a percentage increase or decrease and click “Save.”\n\nExperiment with Automated Bidding\n\nTesting automated bidding helps you focus on maximizing conversions or conversion value. This method saves you time and spots opportunities (like optimal bid amounts and valuable audience segments) that you might overlook with manual bidding.\n\nHere are some Semrush PPC tools and tips to improve your automated bidding in Google Ads:\n\nUse Advertising Research reports to identify keywords where competitors are changing positions and analyze their ad copies for insights into their strategies\nUse the Ads History tool to examine the performance history of specific keywords in paid campaigns. This tool provides valuable data on how competitors adapt their keywords to seasonal trends, offering guidance for your bidding strategies.\nUse the PLA (Product Listing Ads) Research tool to get insights into display campaign performance, helping to inform your bidding choices in similar contexts\nIdentify and include keywords with lower competition in your campaigns. These keywords can offer a more cost-effective way to reach your audience, enhancing the efficiency of your automated bidding.\nBid on branded keywords (keywords that include your brand name) to control your brand narrative in search results. This helps with visibility for searches directly related to your business, which can improve click-through rates and conversions.\nUse AI Narratives for Google Ads to generate easy-to-understand reports from your Google Ads campaigns. This tool makes campaign management easier with detailed insights into ad performance and alerts on any abnormalities in your campaign metrics.\nSet Up Negative Keywords\n\nNegative keywords are words or phrases you exclude so your ads don’t appear for those search queries. \n\nThey help prevent your ads from appearing for non-relevant search queries. Which can improve the efficiency of your ad spend.\n\nManage your negative keywords with the Keyword Magic Tool.\n\nSimply enter your keyword in the search bar. And press “Search.”\n\nThe tool will display a list of related keywords, including important data like search intent, search volume and CPC.\n\nUsing specific negative keywords narrows your ad’s reach, aligning it with targeted searches. Broad negative keywords expand the filter, preventing your ads from appearing in a larger array of searches.\n\nFor example, suppose you’re advertising for an Italian restaurant. \n\nYou might use “fast food” as a broad negative keyword to avoid irrelevant searches. A specific negative keyword could be “pizza delivery” if your restaurant doesn’t offer this service.\n\nUse campaign-level negative keywords for broad exclusions across your entire campaign. For more precise control within certain ad groups, apply group-level negatives. \n\nThis approach is particularly effective when different ad groups cater to varied aspects of your offerings and need distinct keyword strategies.\n\nAfter organizing your keywords, upload the negative keyword list to your Google Ads to implement them in your campaign.\n\nUse Google Ads Scripts\n\nGoogle Ads scripts are an advanced yet highly effective tool for automating and optimizing your bidding strategy. \n\nThese scripts are snippets of JavaScript that you can set up within Google Ads to automate various aspects of your campaigns based on specific criteria. Such as time intervals or performance metrics.\n\nGoogle Ads scripts enable you to:\n\nHandle repetitive tasks, like bid adjustments, freeing up your time for more strategic activities\nDeploy sophisticated bidding strategies that would be too complex or time-consuming to manage manually\nAdjust bids in response to real-time market conditions, ensuring your campaigns remain competitive and efficient\n\nScripts require some technical expertise in JavaScript, so you might need a developer to assist you. Implementing Google Ads scripts involves:\n\nDetermining what aspects of your campaigns you want to automate or optimize using scripts\nDeveloping a custom script or finding pre-written scripts that suit your needs\nTesting the script in a controlled environment to ensure it works as expected, then implementing it in your live campaigns\n\nCheck Google’s developers page to get started with your first Google Ads script.\n\nMastering Google Ads Bidding for Success\n\nUnderstanding and applying bid strategies can help you align your campaigns with your specific goals, manage budgets more efficiently, and significantly boost your ad performance.\n\nAs you implement a Google Ads bid strategy, monitor results continuously to learn from feedback about how it impacts your campaign goals and adapt accordingly. This approach enables you to improve campaign performance and ROI.\n\nSemrush offers PPC tools like Ads History and Advertising Research that can bolster your bidding strategy to streamline your campaign management and optimization. \n\nThese tools provide insights into competitive strategies, keyword analysis, and performance tracking, making it easier to refine your Google Ads campaigns for optimal results.\n\nSign up for a free Semrush trial to explore resources and tools tailored to enhance your PPC campaigns. So you’re not just running ads but creating success stories with every click.\n\nElevate Your Digital Strategy\n\nwith a Semrush Subscription\n\nStart Free Trial →\nFAQs\nWhat Is Bid Strategy in Google Ads?\n\nA bid strategy in Google Ads refers to the method you use to determine how much you’re willing to pay for each click on your ads. It’s a crucial aspect of your ad campaign as it influences your ad’s visibility and the likelihood of achieving your advertising goals. \n\nHow Are Bid Strategies Used in Google Ads?\n\nBid strategies can be classified into manual and automated types.\n\nManual bidding gives you control over bid amounts for different ad groups or keywords. Automated strategies use Google’s algorithms to optimize bids in real time for the best results.\n\nFor example, maximizing clicks aims to get the most clicks within your budget. In contrast, targeting CPA focuses on getting as many conversions as possible at or below your target CPA.\n\nHow Do I Change Bidding Strategy in Google Ads?\n\nHere’s how to change bidding strategy in Google Ads:\n\nNavigate to “Campaigns” in your Google Ads account.\n\nClick the “Settings” icon next to the campaign you’d like to change.\n\nClick “Bidding” from the settings menu.\n\nClick “Change bid strategy.”\n\nSelect your desired strategy.\n\nClick “Save” to apply your changes.",
  "headers": {
    "h1": "The Ultimate Guide to Google Ads Bid Strategy (with Examples)",
    "h2": [
      "What Is a Google Ads Bid?",
      "How Google Ads Bidding Works",
      "Types of Google Ads Bid Strategies",
      "How to Choose a Bidding Strategy Aligned with Campaign Goals",
      "Google Ads Bidding Strategies Explained",
      "Tips for Google Ads Bidding",
      "Mastering Google Ads Bidding for Success",
      "FAQs"
    ]
  },
  "images": [
    {
      "src": "https://static.semrush.com/blog/uploads/media/13/53/135399f415c94061603653ce6dcd1043/3d2005a3d4f6b37c71d6821899f68ff6/google-ads-bid-strategy.svg",
      "alt": "Google Ads Bid Strategy"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/1f/db/1fdbbe89e46da9ce3e6f713eb38f0785/288b0ec0c10c941cbcebb14d68295f82/7_cA_kWnkb2gr_u_L0LJ97qbO8FN2gZolbbqjd6ZUhKl4FLqJxDmvLHTASDGy2aFjq7LDDGMAMNll1x3_75WtNFUkSn6CsNeVj9M6sNcJvDPcih6DxHPFuxJKhHazzpCRPYJ7MXvPZgXDdhIusegdNs.png",
      "alt": "How Google Ads bidding works"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/57/c2/57c20f8115cb1665ffb77f8effcba982/cd146fe3d0fe41a58653e18db2a5c39a/KiQbtj6RgXiUAnCLIXd3XPXX7FD54Qs9oXHkiqEBktGKnJ6dRKrRxufWh7_MeUePhX0ijv5rL9nZ-0E1laY_w-5CwpgvOLaYb7qipz3OQPh4hWUarPCsVh4EmgXzF0o8FM-qFhqZ5oS05E-AccmSNps.png",
      "alt": "Google Ads: manual vs automated bidding"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/93/1d/931d021f49907b31d582b906efff4987/ca13ece1036bb59eef325c0a4d6acb1d/5NaR66W31V9foErnOB8Qwcv-MGsEwymxUdowvvIlFFWt7gYqbntRmfull17Bma-MJPNNZDfkKhpn6CrGuRNcAvPN1EkFAfXxUugC53dSZuHIbSDsNr_Fdl83L5AH56fUqVAxT0x7Fb0W0gIJ6QJCFrY.png",
      "alt": "Manual Cost-per-Click (CPC) Bidding"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/84/83/8483dfec5e59dcb520a66250bf866d49/8395905eee302e367ae2708fa1a712f1/AGIMURhw_Y2s75CLfWwlCagBfqgIXyFpE_c4ObBrkNob_t_L9c8AlXxpT28ap27sxxwIAC8j1y034JEf7wMAL76fNitOytPFs40Y-8AT59368OqNt8zOyIW8OU6M471wxKsqhwjx3TrkqO47WWWtFrc.png",
      "alt": "Enhanced CPC (ECPC) Bidding"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/36/b5/36b5e80817bc421c73dc61d8b8cdb54e/79e7fc1684401dab3ac3d5ccff412206/kOnv5ffqvQB4gdpoT2wFqucfISVI_7eL65OurO-8MNtkYzReJ0SxrtEvp0Ss6TZrXFkoA5W0Oe6iSmAEwu7OV9dFEONLFuda0WF1ayZZFfYQ8Nq6_cpM8A_nTSekfCTRhER3Tlokcoa-NS_oPuAcVAw.png",
      "alt": "Cost-per-Thousand Impressions (CPM) Bidding"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/18/e6/18e68919cbfd745df9ede8f061323b4f/bf9e51f84de043e79e84a5d7c8049e31/jvb-kS1eF-fowQ3dyieP_H64EDjSEzIa2jsLhHy_9cRq77cqvWiIIveWMp2ocZ9WTwXskkmkCZnz4nBktHxjwZEd4h6q5JMmyU4osNSdiLGpTIFks6WLRBEvvcqGL3GVRkkx37vUukU-QmheMc6gru4.png",
      "alt": "Target Cost-per-Action (CPA) Bidding"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/f8/e3/f8e3c7eba57a4567fc70b9412122e8eb/924aab954a84345977feb9d78e8f1ac4/uQJ7CIQKpaKZeaCh-L1pHoPPzEamkwmk6Ff85-r2bk6aDhEeu-5RnG9zhuDJR_uDyEspq1u6ThS-bidw-Hoiq22nENPexGVy36r-3PMZ_jM3NXd-UxvwdWG24w6Xol8LUtOuprNOmt2BBMsF-tNQaPI.png",
      "alt": "Target Return on Ad Spend (tROAS) Bidding"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/78/b2/78b2ae7933be65643d8016cf42715843/e627ab03f680d9037fc4ec87fe7141ec/u-gkKXAw7fOZKHDYQmkmdrLMb6pUAldKSB7Tdb-8T_LtEAL5hasXcUhI257Cf9LwCSQSmklxz62AV752SmQiJfDTLQ3pYd9e9CM67l-XbHOurNiAV_aLG9iaLmH8fKWZ5vdXOmrqaDSRDrrbBxhZT_8.png",
      "alt": "Maximize Conversions Bidding"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/32/11/32112335303134a6a09522c23bcf1eb7/b6b6dd177118d633fe0ca0dca9736fda/0Jv1cB5Pfu9L23V8ZtuuIYaW9ggnXjDG5hPejMAvgpz8DJk7czMoQFNR81pxB1KxaS2CmlyiOwyGuE9t5Zm8Ta0BUv8t82Jd7ddbpTgzBwLA1GNtGG2L-INJpKRY066koaM66JKcT0Nv0xofVTZ7ToA.png",
      "alt": "Maximize Conversion Value Bidding"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e4/02/e40269d54efcfd18425745e4f4de5f91/156f987ec735d0325e6190215c60284c/bs6-wTpLmzLqlHN_cUR0dSSzpSMxzQM-VSJitDBTGNjovJOdd6VCEdMBUDarrGDWoFU1BLibxzdv2tzVIvEAtUZ50KrGplUrsWFqK6VN1IdI77znsrouqEtWMlss2ypdqMlN9l1P5cGUw7ORS2myx-E.png",
      "alt": "Target Impression Share Bidding"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/38/da/38dad3785f794381e6daa631020350ca/5693b44c5ae696e94293843acb97b29e/y34dgKY7app9y5EwmkgoCzmvfq_eBvDlH5qFylxsgEm2joMkf6JJDe0BSgjqvLyG9VUZbgvzfG-iueTLotrAxILZDnVapmXnBYKOGDiaHZWgG5hSq3LzhRpM_7ScmxsZkOQURa40Q12ziJUib2yzRZQ.png",
      "alt": "Maximize Clicks Bidding"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/1b/69/1b6911f6dfa196944be36bc008a7b014/9e813d82e697a35d9dc38c356023d4c6/OZR724pzFWzoLOb5KotecD1YXErxyFajh9B8zsDh9A_MgX7yqiervSBE_W9csyihkFK8kbnR8ezcO5DJfEE0mLok-GgYBCZoY6O7qetkvJevOhqQKkjC8jN_brTUphSXY4xX0MoFGT3aNVMmm9a6mLs.png",
      "alt": "Cost-per-View (CPV) Bidding"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/02/b3/02b3d7e8a7564ebd52c183036be2c929/2d29ee2a3ca6371809962ef7a9d9d85a/cbK28RBQryUP_XZw9jomN4qXpbjjwjw4c8Jkvlapqus7voJOO88dV7qs4fKh-JleS2SW8ROpIzt1o6O-Lca_GmqYD4SpXvrCjDn7v18fFWaT93wg4rVjSYjcpU8ULTu7887vfJdcrA_9areBDy88Ezg.png",
      "alt": "Navigating to “Campaigns” > “Audiences, keywords and content” in Google Ads"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/90/9b/909beb707988c72d2fad335dd6b59bc1/ac32011d0b5dc8eabe975bce99425cd4/uZRMIjW_HCPUt0lwCEwM_A6ddv25Y6XONNplHXXRnRGxL4UvDYO5Bg6o4JnED1UQFxvS0JnjjnH_gFrEEIRWOQ2CjbudJRAIxmP_UdfAzyfV2shST9iFjXDeozoFTrXhiEjKiPNTFvyXIn8ozPIDSl4.png",
      "alt": "\"Locations\" selected from the Google Ads menu"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/85/fa/85fa7c5ef9808add9e4d08481666b845/9bdf9b2686d0e239c1e4662c7592faae/hBGWJ_H_pt5gzKdiQwzZ-rcr1TqmuDh0ejTZQ5AZxnayzCFXtcBvNuVN8kOXj6_65D1TjRrjUglAKRGNmxAuAxkSOhEU_-BifE5ADy9IVFu4hNuZfNOBa3DDEV4hWJSJ_VatizCCjGSt48K30upkmDw.png",
      "alt": "Pencil icon under the \"Bid adj.\" column highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e8/9e/e89e1b11be22a73aefafda408a8eead5/b77b9552451a63e5df7d097b5bb5d82f/irP97Gtccm4X6tt8-z-8avFWkRO66aF4uMctDGtG5Tsdfjsl1mJCznG46pvnDr1zbVL3XOckwE6spaxNi5QDs14e3Mslg2VtjyW8MTieFDEz1o0AqIAsXEqQyPwyugFQZ7SYR4fraBdP_XEgvymDkco.png",
      "alt": "Bid adjustment set to \"Increase 50%\""
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/26/64/266430536131ad2f35c2d5e7fd14500e/16e388530bd033011020de51d93f104c/AD_4nXc5pONvTdhRTuqiB45f-XfuvK6-f63mP_9xdFUXJ4wuLEIZyP44M4u8zBz03HE2fJ3jrvXzlvapwrWAdVMvUspfQejUXezZ-QkNiZCXY8UF8Ll-uuYYr2YCGlbKuMhWr6uRrS6jU1EuyZatA-Wtf2NAngAv.png",
      "alt": "AD_4nXc5pONvTdhRTuqiB45f-XfuvK6-f63mP_9xdFUXJ4wuLEIZyP44M4u8zBz03HE2fJ3jrvXzlvapwrWAdVMvUspfQejUXezZ-QkNiZCXY8UF8Ll-uuYYr2YCGlbKuMhWr6uRrS6jU1EuyZatA-Wtf2NAngAv?key=cLPRBPl1eG6kDqwFia0mNg"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/4e/96/4e96660470c1ee4025036bb94942ad01/4aa58e4acee11251a3ff9551a21a81b1/AD_4nXe8U0tp9pU_63ql7wAh38Jtsl8SKtXzHdEBLSDxKchLtpSChdLulVtqmaOOXrin3uU10V22FHhLqMIGsoWb4mVxpPDj1CYvqTmmTqE6QqDb6EnFbtZoaYDzKoCt_fQtWQcDEK2T05PYM3fv306XNsdQ6inx.png",
      "alt": "AD_4nXe8U0tp9pU_63ql7wAh38Jtsl8SKtXzHdEBLSDxKchLtpSChdLulVtqmaOOXrin3uU10V22FHhLqMIGsoWb4mVxpPDj1CYvqTmmTqE6QqDb6EnFbtZoaYDzKoCt_fQtWQcDEK2T05PYM3fv306XNsdQ6inx?key=cLPRBPl1eG6kDqwFia0mNg"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/fb/4f/fb4fdd1c4423445a5ac1986b460b9d1c/0fc189197b8b90e01a9a99999c46ea8c/a7hQUzgSIUT84vtO_P4o0CFtZoXiC-fbl25TXF1kR5DfrERdgXSPPBM9p8qp9hfghamij6VU6Lucc7uwvm9O4pRT7EX327PvnpSGzvbA9SbVtoTCtPerXdd3z4qxDWWx7cKqZI6f-J80cgqmo9uSs34.png",
      "alt": "“Campaigns” in Google Ads account"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/c2/83/c2839f0a07176ec5075d48c151ccb3e6/4c80ab0b138243c6492f9277d899922f/86whzQJVZrZJJfMB_3YIQYe5yrqfI68Umd1Pi7q475x2VY2SOUVFmdLjX2bd9H1nqWHVUwkTM5V155Ux_XYuUJTK7soSEWIpwxt5mQhUgwidGqw1TWV8ZLAm7sTab168gwYUM8Wf7TkbcwhtPA36W1A.png",
      "alt": "Settings icon next to a campaign in Google Ads"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/47/d1/47d108a41d78cc9d22a60d848b215afe/31b6dbc801826e3b4cd6fa75000cee2a/bY99h3QbYDyzaB_2gIFJh1e337V9eqpdfVY0oIXcrcpqbPRB3Y49_i0mZvV8AL0Q5xDf22hUo6R48myZI4uRK3ToBklW5fbSThZA29LX7nqN9vi8kuArm_2T8PvbgKSRvcpz4kdJ3GnFTZvpB887Yrk.png",
      "alt": "\"Bidding\" highlighted under Google Ads \"Settings\" menu"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/23/07/230726d4a56dc3a50e63451779184929/df4fef37336cc11ff81aeed32e7d8379/M6TsMZ5I0iy8zmmYfMaehfvjYHiA8mrvhg0PCH83PJtnQsU-3SlrZ2o8HPoiWP2X79gcWoNO-aH1y0cbyyCuwB_n3J-CnoE5KFuZ2Ty21TpK29mXhaXZI28HVeGiG4mFzbYbvJi6BSDrAv25dn41tsI.png",
      "alt": "“Change bid strategy\" link"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/04/4e/044eb2b83e64fa0b28b14d18c56b900f/b0dce98a1d26745bc7f8f462c94043e8/OCv30WWVc34IVJu5YdjV58jEkoTmvBotBe6d49gpYk0RxrAiEN483cuCVF19621rU16hgvWtPT7Hq_RMD_EwVsF8oDfdzR-1FWHKFDiV2WyImKWnGfAkAgtmLHAFQqnUuAt6Lz411hrlN691QEZPxFg.png",
      "alt": "\"Conversion value\" selected under desired strategy drop-down"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/36/d3/36d3ec43432bf451a9f1e04b893a70b1/ae776b20a6e8c02f941ce86ff132e002/LFbwpK8E0LA7nAKKHxj-v7J0pQ44YgT0NrlqtrxMRtl9Cj_AA_xKRSW6DqxnsN2n26IPj42PJc2Ck7nGNaoedoOTalCZ-r05PkOo7eOX961iYSF1I3i2qykgCE-W4sK1u5hYJFQWFGRAvBge6Q_46Co.png",
      "alt": "Save your changes in Google Ads"
    },
    {
      "src": "https://static.semrush.com/semblog-next-static/banners/trial-gift.png",
      "alt": "Trial Semrush banner"
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&d=Mon%2C%2021%20Oct%202024%2014%3A25%3A22%20GMT&n=4d&b=The%20Ultimate%20Guide%20to%20Google%20Ads%20Bid%20Strategy%20(with%20Examples)&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fgoogle-ads-bid-strategy%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&b=The%20Ultimate%20Guide%20to%20Google%20Ads%20Bid%20Strategy%20(with%20Examples)&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fgoogle-ads-bid-strategy%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://bat.bing.com/action/0?ti=5128787&tm=gtm002&Ver=2&mid=33655cd7-07cc-45d2-9733-ca0411e98402&bo=1&sid=3d5c62908fb811ef80185dfa74ec9eb6&vid=3d5ce8808fb811ef87cb2fe9471b7ba0&vids=0&msclkid=N&uach=pv%3D10.0.0&pi=0&lg=en-US&sw=1536&sh=864&sc=24&tl=The%20Ultimate%20Guide%20to%20Google%20Ads%20Bid%20Strategy%20(with%20Examples)&p=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fgoogle-ads-bid-strategy%2F&r=&lt=747&evt=pageLoad&sv=1&cdb=ARoR&rn=927905",
      "alt": ""
    }
  ],
  "publication_date": null
}