{
  "url": "https://www.semrush.com/blog/google-ads-keywords/",
  "title": "Google Ads Keywords Explained: Boost Your PPC Performance",
  "content": "What Are Google Ads Keywords?\n\nGoogle Ads keywords are words or phrases used to match your ads with the terms your potential customers are searching for. \n\nChoosing relevant keywords can help you reach the right users when they’re searching for businesses like yours. \n\nLet’s say you own a hair salon. And want to attract more clients. \n\nYou would likely target certain keywords with your ads. Like \"haircut near me,” “best hair salon,” or “hair stylist.” To connect with potential clients seeking your services.\n\nBut targeting keywords like “hair salon jobs” or “how to color your own hair” might attract the wrong crowd. \n\nBecause they don’t align with your services. And don’t match what the user is trying to find (also known as search intent).\n\nThe keywords you select are just one of the ways to control who sees your ads. And when. \n\nHow Do Google Ads Keywords Work?\n\nWhen someone enters a search query like “haircut near me” on Google, an automated auction starts in the background. \n\nThe Google Ads auction determines which ads get displayed. And in which order. Using an algorithm called Ad Rank.\n\nAd rank considers several factors, including:\n\nBid amount: How much you’re willing to pay\nQuality and relevance: Things like expected click-through rates, ad relevance, and landing page experience\nAd rank thresholds: The minimum price required to show your ad\nCompetitiveness: How many other businesses are bidding on the same keywords\nSearch context: The searcher’s location, device, time of search, other search results displayed on the page, and user signals\n\nThis ranking system helps ensure the most relevant ad is shown for any given query. At any time. The rank of any ad can change whenever it is eligible to appear.\n\nUsing the earlier example, even if you bid less than your competitors on the keyword “best hair salon,” you could still rank in a higher position. \n\nIf your ad is higher quality. And more relevant to the search. \n\nPro tip\n\nFor a more comprehensive explanation of Google Ads, check out our guide: What Is Google Ads & How Does It Work?\n\nUnderstanding Key Google Ads Keywords Metrics\n\nClick-through rates (CTR) and quality scores are important metrics in evaluating keyword performance.\n\nCTR is the percentage of people who click on an ad compared to the total number of people who see it (aka impressions).\n\nUse this metric to determine if you’re targeting the right searchers with the right keywords.\n\nQuality Scores are used to gauge ad quality compared to other advertisers. Or competitors. Each ad is scored on a scale from one to 10. \n\nGoogle uses three factors to calculate quality score:\n\nExpected click-through rate: Estimates how often people who search your keyword will click on your ad\nAd relevance: How closely your ad’s target keyword and content align with what users are searching for\nLanding page experience: The quality of the page users land on after clicking your ad.\n\nYour ad is then rated by comparing it to other ads bidding on the same keyword. Using \"below average,\" \"average,\" or \"above average\" across each of the three quality factors. \n\nHigher quality scores typically mean your ad is relevant, helpful, and matches what someone is looking for. \n\nBut benchmarks for quality scores depend on the keyword you’re targeting. \n\nBranded keywords specific to your brand name or your named products should aim for a score of 9+\nCommercial intent keywords, or keywords indicating a user is likely to purchase or convert, should target the 8+ range \nLow-intent keywords, or keywords where users are looking for information and not intending to take action, should score within the 6+ range\nWhat Makes a Good Google Ads Keyword?\n\nA \"good\" Google Ads keyword should bridge the gap between what you offer and what your potential customer is searching for. Accounting for things like search intent. And user behaviors. \n\nLet’s continue our example from above. \n\nKeywords like “haircuts” or “hair salon near me” are basic but relevant. And align with your business. And what you offer. \n\nBut these keywords are broad. And may not reach your target market. Or niche. \n\nAdding highly specific keywords like “haircuts for curly hair” or “best hair salon for textured hair” helps direct your ads to potential customers more likely to convert. \n\nThese are called long-tail keywords.\n\nLong tail keywords generally have lower search volumes and keyword difficulty. Meaning they’re often easier to rank for. Because they tend to have lower competition. And lower CPCs. Helping to maximize the ROI of your ad campaigns. \n\nWhy Are Google Ads Keywords Important?\n\nGoogle Ads keywords are the key to connecting your ads with your potential customers. \n\nSelecting the right keywords for your ad campaigns can help you:\n\nTarget the right audience based on their search queries. And interest in businesses like yours.\nImprove ad relevance by using targeted keywords in ad copy. And on landing pages.\nOptimize spend by showing ads to potential customers who are more likely to click on them. While avoiding showing ads to users who may be looking for something else.\nImprove user experience by ensuring potential customers find what they’re looking for. When they click on your ad. \n\nChoosing the “right” keywords can improve your return on investment (ROI). By leading to better ad positions, higher engagement and conversion rates, and lower costs-per-click (CPC).\n\nHow to Research and Select the Right Google Ads Keywords\n\nThe best way to select keywords is to start thinking like your customer. Brainstorm phrases potential customers would search to find your business. \n\nFor example, if you own a landscaping business, your initial list may look something like this:\n\nLandscaping \nYard work \nLawn care\nYard maintenance services\nLandscaping services in [location] \n\nThis list serves as a starting point for keyword research. But you’ll need to dig deeper to create a high-performing Google Ads campaign. \n\nConduct Keyword Research\n\nUse a keyword tool to discover what customers search for. It’s the best way to analyze which keywords will perform best for you in the long run.\n\nSemrush \n\nOur Keyword Magic Tool can help you identify the terms your target audiences uses to find businesses like yours. \n\nHere’s how: \n\nOpen the tool in Semrush. In the left-hand navigation, go to “Advertising” > “Keyword Magic Tool.” \n\nStart by entering a primary keyword from your list. Select your target country. And click \"Search.\" \n\nThe tool will generate a list of related terms. \n\nSort by Competitive Density. To see how many advertisers bid on a keyword. \n\nTo add Competitive Density (frequently denoted as “Com.”) to the columns in your report, click the gear icon in the top right. And select “Competitive Density.” \n\nContinue until you have a list of keywords to target with ads. \n\nPerform Google Ads Keyword Research\n\nwith the Keyword Magic Tool\n\nTry for Free →\n\nThen, use our Advertising Research tool to identify the keywords your competitors bid on. \n\nTo start, open Advertising Research under “Advertising” in the left-hand navigation. Enter a competitor's domain, and click “Search.\"\n\nYou will see the following dashboard. There are multiple tabs at the top, but for now, we'll focus on the \"Positions\" tab.\n\nScroll down to see a list of keywords your competitor's ads are ranking for under “Paid Search Positions.”\n\nThese keywords show you the words or phrases your potential customers use to find products or services like yours. Include these terms in your campaigns. \n\nAnalyze Competitors’ Ads\n\nwith the Advertising Research Tool\n\nTry for Free →\nGoogle Keyword Planner \n\nGoogle Keyword Planner is a free tool that helps you research keywords for Google Ads campaigns. \n\nSearch for new keywords, get ideas for keyword variants, and add or update keywords in your Ads campaigns.\n\nBecause Keyword Planner is a tool within Google Ads, you'll need to create a free Google Ads account before you can access it. \n\nTo learn how to add keywords to Google Ads Keyword Planner, go to Google Ads. Click \"Start now\" and sign in with your Google account credentials. \n\nThen, click on the link that says \"Skip campaign creation.\"This will allow you to set up your account. Without creating an ad campaign. \n\nNext, confirm your account settings. Like country, time zone, and currency. And click \"Submit.\"\n\nOnce you reach the confirmation page, click \"Explore your account.\"\n\nYour Google Ads setup is now complete.\n\nFrom the menu bar on the left, click \"Tools.\" Then, click \"Keyword Planner” under “Planning.” \n\nThis is where you'll find potential keywords for your Google ads. \n\nFor example, let’s say you’re running a “New Customer” campaign for your landscaping business.\n\nThe “Discover new keywords” option in Google Keyword Planner can help you build on your keyword list. \n\nStart by selecting \"Discover new keywords.\"\n\nYou'll see three options for keyword discovery: \n\nStart with keywords: Enter a phrase or keyword. Like “lawn maintenance in [location].”\nStart with a website: Enter your website or a competitor's site to generate a list of keywords relevant to the domain \nStart with both: Enter keywords and a website's URL to generate a list of relevant keywords.\n\nWe’ll focus on “Start with keywords” for now. \n\nEnter your selected keywords. Like:\n\n”Lawn maintenance” \n“Yard care” \n“Landscaping” \n“Yard maintenance”\n\nEnter your selected keyword in the search bar. And click \"Get results.\"\n\nPro tip\n\nEntering your site's URL in the \"filter unrelated keywords\" box will help Google remove any services, products, or brands you don't offer. \n\nThe resulting page will display words and phrases related to \"landscaping service.\" With details on search volume (the average amount of monthly searches). And competitor bids. \n\nTypes of Keywords in Google Ads\n\nTo best match ads with the terms people are searching for, Google uses keyword match types.\n\nMatch types help Google determine the scope of search queries that could trigger your ads.\n\nThe match type you choose for any given keyword directly impacts the reach, visibility, and relevance of your ad. \n\nThree types of keyword match types exist in Google Ads: Broad Match, Phrase Match, and Exact Match.\n\nWhat Are Broad Match Keywords?\n\nBroad match keywords can trigger your ad when potential customers use your keyword, similar words, or related phrases (as determined by Google's AI). They target the broadest, or widest range, of potential customer searches. \n\nWhen you choose broad match as the keyword match type, potential customers may see your ad when they search other related keywords.\n\nNote\n\nBroad match is the default match type for Google Ads keywords. \n\nFor example, let's use the keyword \"women's hats.” \n\nIf you bid on “women's hats,” your ad should appear for searches like “women’s accessories.” And “women’s fashion trends.” These searches are related topics. Or broad match keywords.\n\nIt could also show for “women’s clothing.” Or even “women’s scarves.” These may be related searches. Or close variations of the keyword.\n\nYour ads should not show for any searches that are vague. Or irrelevant to the keyword. Like “men’s clothing store.”\n\nThis means your ad can reach more people looking for women's hats in various ways. Helping to increase brand awareness. And attract more visitors. In the early stages of advertising your business, broad match keywords can be a great tool. \n\nThey help you gather data and insights into how potential customers are searching for you. \n\nBut when you target a broader audience, you also risk your ads showing for less relevant queries that are still broadly related. Like “women’s scarves.’\n\nIf you don’t sell scarves, but your ads drive clicks from “women’s scarves.” your return on ad spend (ROAS) will likely suffer. You’ll be paying for irrelevant clicks that don’t result in conversions. \n\nWhat Are Phrase Match Keywords?\n\nPhrase match keywords show your ads to potential customers using an exact phrase. Or close variations of your phrase. These queries can include additional words before or after the selected phrase, too. But the meaning—or intent—must remain the same.\n\nPut your keyword in quotation marks to indicate phrase match keywords in Google Ads..\n\nLet’s use the same example as above. If you bid on \"women's hats,\" your ad may show for searches like \"cheap women's hats\" or \"where is the best place to buy women’s hats.\" \n\nThe phrase and meaning of \"women's hats\" are still included. \n\nAds will show fewer queries than broad matches. Which means your ads may have less reach.\n\nBut they'll show on SERPs that are more closely related to your business. Which could improve ROAS. And lower costs per conversion. \n\nTip\n\nDesign and optimize your Google Ads campaigns with Semrush’s PPC Keyword Tool. Easily plan keyword match types, remove duplicate keywords, and more.\n \n\nWhat Are Exact Match Keywords?\n\nExact match keywords only show your ads to potential customers when their search query has the same meaning as your keyword. They are the opposite of broad match keywords.\n\nThese keywords are denoted with [square brackets] in Google Ads. \n\nIf you bid on [women's hats], your ad could show for searches that are the exact term. Or very close variations of the keyword, like \"women's hat\" or \"hats for a woman.\" These have the same meaning or intent as your keyword.\n\nBut your ads shouldn't show for any searches that change the meaning of the search. Like \"derby hats for ladies” or \"buy men’s hats.”\n\nThe terms are related. But they don't align closely enough. And the search intent likely differs. \n\nExact match keywords are a great strategy for maximizing the relevance of your ads to your potential customers. Especially when you're targeting a highly specific audience.\n\nThey're also beneficial when your campaigns have limited budgets. They ensure every searcher has a high potential to convert.\n\nPro tip\n\nDig deeper into match types for both Google Ads and SEO in our Keyword Match Types guide.\n\nWhat Are Negative Keywords in Google Ads?\n\nAdd negative keywords in Google Ads to prevent your ads from showing for specific searches.\n\nNegative keywordshelp filter out potential customers you don't want to target with your ads. Giving you more control over ad visibility. And often reducing wasted spend by eliminating irrelevant searches. \n\nNegative keywords use the same match types as above, but they work differently:\n\nNegative broad match keyword: Exclude your ads from showing for queries containing your negative keyword. For example, adding “casual” will ensure your ads don't show for queries like \"casual accessories\" or \"casual headwear.\" \nNegative phrase match: Keywords exclude ads from showing if the query contains your keyword or phrase in the exact order. For example, adding “cheap women’s hats” will prevent your ads from showing for “buy cheap women’s hats” or “cheap women’s hats online.”\nNegative exact match: Keywords exclude your ads from showing if the query is identical to your keyword. But it will still show for similar keywords. If your negative keyword is “cowboy hats” for example, your ad won’t show for searches for “cowboy hats.” But it might show for “women’s cowboy hats.” \nStrategies for Google Ads Keyword Optimization\n\nKeyword optimization is the strategy of using ad performance data to make changes to keywords.\n\nLet's say you identified several keywords and negative keywords for your \"women's hats\" ad campaign.\n\nFor the first month or two, those keywords were top performers that led to clicks and sales. \n\nBut in the third month, you notice the keywords are driving up your cost per click. They’re using up more of your budget than before. \n\nWhat do you do? \n\nOptimize and adjust.\n\nBalance Keyword Relevance and Competition\n\nThe keywords (and negative keywords) you add to your campaigns have the potential to drive a lot of traffic to your business. \n\nBut the competition for those keywords in the Ad Auction can make it difficult for your ads to rank. \n\nHighly competitive keywords often have a higher CPC. This means you could be spending more of your budget than necessary to reach your potential customers. Even if your ad is considered relevantfor that keyword.\n\nIf you only bid on popular keywords, you may not reach all your potential customers. This can result in less reach and fewer conversions. \n\nOrganize Keywords in Ad Groups\n\nAd groups consist of ads that have a common set of keywords. And target the same audience.\n\nBy grouping related ads together, it becomes easier to serve relevant ads to your potential customers. \n\nOne of the easiest ways to organize ad groups is by referencing your website architecture.\n\nFor example, say you have collections like \"skin care\" and \"makeup\" on your website. You can create a \"skin care\" ad group that contains all the skin care-related ads. Like ads for \"moisturizers\" and \"serums.\"\n\nGrouping similar ads and keywords allows your ads to be displayed to potential customers searching for similar things.\n\nGoogle doesn't provide direct guidance on how many keywords to use per ad group. But it's generally considered best practice to keep your ad groups to less than 20 or 30 keywords per group.\n\nPro tip\n\nSemrush's PPC Keyword Tool can help you optimize your Google Ads keywords. After you import your keyword list, the tool will automatically make recommendations to improve your ad campaigns' performance. It can even create automatic groups based on similar keywords. \n\nAvoid Keyword Stuffing \n\nUsing too many keywords (or irrelevant keywords) can negatively affect ad performance. \n\nGoogle's main goal is to show the best, most relevant ad to the user for any given query. The keywords you use are one of the main indicators of what is considered the \"best\" option of ads to serve.\n\nKeyword stuffing can lead to low-quality ads (and lower Ad Rank). And it violates Google's spam policies. This means the potential risks far outweigh any short-term gains you may see.\n\nImagine a potential customer searches for \"women's hats\" and sees this ad.\n\nThe overuse of the \"women's hats\" is unnatural. And would likely discourage users from clicking. \n\nAvoid this by using AI Ad Copy Generator. Our tool can help you generate engaging headlines and descriptions for your ads. Simply enter your URL to start.\n\nThen, enter your keyword list for your ad group. These should be keywords related to your theme. Like “women’s hats.” Click “Generate ads.”\n\nThe app will then generate ad copy you can easily export and integrate with your ads account. \n\nA more engaging, quality ad for “women’s hats” would look something like this:\n\nHow to Check for Keyword Stuffing\n\nCheck for keyword stuffing with the SEO Writing Assistant. It calculates keyword density (the percentage of words that are keywords). \n\nAnd notifies you if you’re using your target keyword too many times. \n\nIt also suggests semantic keywords (related words or phrases to your keyword). These keywords can help your ad read more naturally. Which can help you tailor your ad copy and keyword usage to the way potential customers search for your business. \n\nReview Ad Copy in Real Time\n\nwith the SEO Writing Assistant\n\nSign up Now →\nUse Smart Bidding\n\nSmart Bidding is an automated bidding strategy that uses AI and machine learning to optimize your bids for conversions or conversion value. It adjusts bids in real time based on user and device signals. \n\nGoogle recommends using broad match keywords in conjunction with Smart Bidding to adjust your bids based on expected conversions. \n\nMake Data-Driven Optimization\n\nUse Position Tracking to measure the impact of your keyword optimizations. And identify what adjustments need to be made to your keywords. Or ad groups. \n\nMonitor changes in ad positions. And compare the top paid SERP results for any of your keywords.\n\nCompare your paid keyword performance amongst your competitors by selecting \"Google Ads\" in the top right settings. \n\nRegularly monitoring fluctuations in ad positions can give insight into how user engagement and conversion rates are impacted by your keyword optimizations.\n\nDive deeper into engagement and behavior changes by reviewing ad performance in Google Ads. \n\nOptimize Your Ads\n\nwith the Position Tracking Tool\n\nTry for Free →\nMeasuring Keyword Performance in Google Ads\n\nGoogle Ads reports on various key metrics to help you interpret how well your keywords are performing. \n\nPages lacking in engagement are often strong indicators of where optimizations should be focused. Metrics like bounce rate, average session duration, and pages per session can provide insight into how customers engage with your site. \n\nTo view your keywords' performance, log in to Google Ads and click \"Campaigns.\" Then, click \"Search keywords\" under \"Audiences, keywords, and content.\"\n\nThis is where you'll find all of the performance data for your added keywords. Like click-through rates, conversion rates, costs-per-click, and Quality Score.\n\nMaximize Your ROI with Smart Keyword Choices\n\nThe right keywords can make or break your Google Ads campaigns. But it’s not hard to identify the ideal terms. \n\nYou just need to understand which keywords your target audience searches for—and your competitors’ bidding strategies. \n\nUse Keyword Magic Tool and Advertising Research to create a more effective Google Ads keywords strategy today. \n\nElevate Your Google Ads Keywords Strategy\n\nwith a Semrush Subscription\n\nStart Free Trial →",
  "headers": {
    "h1": "Google Ads Keywords Explained: Boost Your PPC Performance",
    "h2": [
      "What Are Google Ads Keywords?",
      "How Do Google Ads Keywords Work?",
      "Why Are Google Ads Keywords Important?",
      "How to Research and Select the Right Google Ads Keywords",
      "Conduct Keyword Research",
      "Types of Keywords in Google Ads",
      "Strategies for Google Ads Keyword Optimization",
      "Measuring Keyword Performance in Google Ads",
      "Maximize Your ROI with Smart Keyword Choices"
    ]
  },
  "images": [
    {
      "src": "https://static.semrush.com/blog/uploads/media/88/28/88280c07e0cff534db4de6914ee7422e/5a1ae3ee29e2de63ffa91ab48790b127/google-ads-keywords.svg",
      "alt": "Google Ads Keywords"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/c8/15/c8159c89c4759b992f0c7a60335694fb/92e66fbde9363158f44d5cf6ca15d712/IKdwkt4lsTDiodBDXISHbd1M3pk6PV3BGqqR9-MOrHydtMPoZ77k5PlXg-TrfJSWCAYQQfP-aFGHxHgTVa4LpVBHbZi3tmwMbfa2Rs5r-AtWMIjlU6zf2TtcoJm_Ad47oNtU54Vmt0SJf4fJVaRaeRg.png",
      "alt": "\"Sponsored\" results on Google SERP for a best hair salon"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/b6/bb/b6bb759f575de1281fab11c46c400689/ebe8485f51b4530c87509b1aece130da/Tzye46QPS50dUb15I0waR21LgRmDHcz1j-qs4GLdb-D8jdkxQqTkOGXBAVu3j5vpaIUmnt_QWrp68_yMKg6xnZVzP6qQhXdLx_r33_ZK8HGunip7Y6MofPPtRA9CmTHOje7nD-FcGniidDaukKvpIkk.png",
      "alt": "Search engine results page has google search ads at the top and bottom, sandwiching organic results."
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/03/9b/039b11de6deb551ec6b33d4b77e62edb/32f36d0c52d5b8db983087c972a0ac6a/IWizCr-Kk_Ols5CMiCuQ-DS15y1nxMYAtgQfeJg9JW0ZKUsysl_8gBbi3oyhz0REqDVT2Jlok0-hrOaGWuxLvvkDfrtC9je1wdOSRvu3g__BnaKeb6GNgcS--mV-pCMCSFiCmZxTs0e-dFiXZnXnP0U.png",
      "alt": "Google Ads works by user interacting with Google, advertisers bid for ad placement, Google evaluates the ad, Google determines ad rank, then the ad is displayed."
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/dc/8f/dc8f0880f8537bd4337386eedcb28407/e43a57026d6052b51d5a2c0be8b4fdf0/HqIxwB-pfs9mzGyetoP-FXMXAfssKZCtS4G9EO6pyi27hzrA1upcy0FuA0lnWon40ywG-dUQZaXjBaeQelBEwqAeYUlIoGjG9crhlbPfLQJACPFIm7g8o8Haul6cWhp7zi0_NGThRPo7y5R7c9IMP1U.png",
      "alt": "Click-through rate is calculated by diving number of clicks with number of impressions, multiplied by 100"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/74/4a/744a41bf7f7d94427171404edb637bc5/1693c12deed8fb6aff4764611ab13250/jS3jaAMGJFGiohFqHsOgflZ20ESI_0ofQRGWma9zh0pDx1lm6nJpKXPs0-tlM8emvBpqDaTZoaYVhOrJTmoE5zPR-cidoLZ-12OslwNe2iYV7F8Qle-5IGOjL046y1YeUF9T_53lRu3G-nd_SEcdq9A.png",
      "alt": "Quality Score equals expected click through rate plus ad relevance plus landing page relevance"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e4/4c/e44c4323888d7acdaecfa8b42159703c/bf0ec139af882d33c4834f18cffb072d/2FoeWkbuslAUX0IV4g4FVH3l4TN_WgSGSHWyVuNhSqlzdJ3wfx1zbZkpz_ZCNAK7h8ow951KtPvtYoGTv9n5gsghNnW38ypAWlPtolkmvieHtpqEb5uF0_CYI_rxcvJa3Uvs7Qh0CbQVuaWxnHXe2X0.png",
      "alt": "a table showing ad rates based on the quality factors: landing page relevance, expected CTR, and ad relevance"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/50/7c/507ce411c72695719e66c0acd1210283/45387581e691d29e68e0d1ea61021c74/zqob4HLhrGaO_uv_He-mSz-ZBtjx1nlZDtRg7W8u3aFeLtnpMcGR1kD7EhDq_ofmUb3YHFDrge35lcBqrz-ShOh6mkr3vXUV1p76-w_UCTnr8FmZoCznKUz76l4n4L80hUns2SL5RFWHr303oUGDtqo.png",
      "alt": "\"landscaping\" entered into the Keyword Magic Tool search bar"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/c5/d3/c5d3bdacaf21f7da52ca4631b0088137/1733d8cded32732e42a103eff220868b/WGDQya2-5MOUpOJqKBPBs-qELOjJujIHQfXs60p_DeoDPLVyIq54sZddoCH4cntAZ9Jn4k0KkBdqjICW-URjceV8XSIRHma2C6vULV_mif3ubVgkJhmKljtC-1b-YqlQbtActFFGIFSnpNXdCMZxDJE.png",
      "alt": "Keyword Magic Tool results for \"landscaping\""
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/d9/0d/d90dab5b25bdca12a07f1c1f0e88c28a/89745bcf2b5d50f0d8be85c4e9c1713d/59wbulQvnToT068TLBMACSCoafgT3iz2JwFFGbwHhcn_IKmA_RxuuJNrQTrZrfiy8l9vNNfiCm58RovLYpcta4F9bhJS0182I0O4ZMVPgWAXcy6pFUFgeEuGwdkFCMiFGbXT3G91PxHXlfqoBifPzWQ.png",
      "alt": "adding competitive density metrics to Keyword Magic Tool results"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/33/e4/33e4c772fd68a6b7986cfdbd5971fb3e/30ab46deff20aab3c335be6877ed5f45/bpBhp4s1WOpnHZrF2riCtHg81Us2rK1j4SzCaPaCgr1XojnTPTSb-drCETHjOwuWj6nNCaukSqBRCOmvfBYxUZevnvRAUJDQ3xmqYZaoM_FkqrUCz-8z_ft61flL2wWXe9U3lH_jn9pEp6lCQUK6CB4.png",
      "alt": "\"nike.com\" entered into the Advertising Research tool search bar"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/00/e6/00e61b0b48be926d4705faf211f8fd41/6e51db50187260d8647ce538142860d1/NfIVEMCdC2tOvIdBXiuVtX3h9g_nyN-ZJa5T8zTjP22hOEJMD1F4HdEfbGxVgiPwk5DWWbFyVb6L_RBlNZNmMHH_ddvKgnX-vFPgHGgDeSBkgZnfI95mp8WOTRHrG1zit_bAx0iqknnHL8_92stITWY.png",
      "alt": "\"Positions\" tab in the Advertising Research tool, showing number of keywords, traffic, traffic cost, paid search trends and positions data"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/fa/ee/faeefa6a166322f0aa741cabdf4555c1/acc7193dc9df87df351a2e8ea13819db/lQFtRet4OSaV7_V_uDAVbXGAXETfrMCfAYOp5_OE15m9NcU7gOM4EeQUIJb1PbD1lWCw32UFciLkwvFqH6Hp-ywV-PXks3MZdZ9SWrjVl-SjHOribCrXvDSw1A3pyndldldnPjoY3Qak5i6vUKid0PI.png",
      "alt": "Paid search positions table in Advertising Research shoes a list of keywords your competitor's ads are ranking for"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/a4/54/a454661f3a376641098fe36560be8edd/43940b3af602e62fb5e3b320a532042f/4ydwKYIoimxjDpO0Fc8pWQyuzTcI9F6XkZZUPahAY9jYerehDWFiBTeiO8QQvkzeaPtDvFMrBEn4Zx43OpSqnAFT3vM5EFP7X26AemYsYgHT4PXTosUu1OtokC4WQ2TlP9UE59VmSMJfBFJh7vvF5dU.png",
      "alt": "confirm your account settings window in Google Ads"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/5f/dd/5fdd4eb7b0679a40b01055ccc8aef638/657681305621a007fec1d1a1a336d0dd/LMpL7ygQYpusIse_vuN7lbQOHwb5nqWhczpP6JqB6DA0yJP0X8AGdVL2WJZ0OWTk_kk6SF9pTqvD2iwUQ8l1T3aZkWqdlu59mimaIZPmYFt3Fvgz02PVAV3drWHqYNWBpc2K7FVrIf0_NAfpnO14thc.png",
      "alt": "Navigating to \"Keyword Planner\" from the menu"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/7d/a6/7da63390586797d14f3687bc9d2f0d6a/d27e489a47510ef69ab5224fd8ea8c90/BjaF65611H_ua-w0LDoLU523GYPLRNoxt61qrzlfc20wuH1KJYRpiJ-7eoR6iSOginqEUi0nYZVMQRMUhGr6oXx9823YmU1kK7cCy7xcmEiVbgxPQaBjJcGDjrnoGzrUPPZTi70LI-JvLOcgjjwv6Ic.png",
      "alt": "\"Discover new keywords\" option selected in the Google Keyword Planner"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/2d/75/2d75baa03591c3a99c8fcafd33f3563a/dbb47e1d1f2e8af589491dd417308fcb/y_eFSDJ71bkmOfZtf73WERxU1yDJUwmkhkAAM9i_bjVYWjoeLiHJMEDoM8nBtR88POLAYXMY2d4RiLwiRUF3XMDn9IiC4X9Xr3JlS1LN5fmOmXdxJjHKxBxu3Cf3tQCuTrPu4FoepjzhOJvdPinUaXg.png",
      "alt": "\"landscaping service\" keyword entered in Google Keyword Planner"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/3e/a4/3ea40efef664382a28b575c9a2ae7cf4/9d19f31a9d0548e5fa6646141e4e7ca3/mre1CSXz6ZKDuCahYNfbntkVyLrjTjpoSB2RvdKcyAdex0bLM0xCR2LGtrZf4E5QPbtlhPlf1W5RGqETGOXr0M1tyCufrUfzumlFpQdWtlo6a4OqFIMEVj45Mw6Dzr_OkPs34Hwz3CTJu_J4mAqcQ5k.png",
      "alt": "a table showing words and phrases related to \"landscaping service\" with their metrics"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/95/73/957360f28744238db5405ad079826c83/9444346a0eca4e7db727f61e02cd9421/eQ1UBhToobfv0Zvz4tz8N9pIE_RGhGrvkCcpAeBtMULrFRKsWf5OTkI7Ce72wcTCqVhCaNBgtaLf2i1ylvdLAszWwPReGcY2ia0l8Qxd3-GaBJkfJACRtshiRupi4HelrYrHNAHiruLSmDHrIK4SQo8.png",
      "alt": "Keyword match types on Google Ads from highest to lowest reach and lowest relevance to highest relevance: Broad Match, Phrase Match, and Exact Match."
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/3a/11/3a11eaaa4ffa763a700811f3817bc8f2/1ac285f6cd880047835ae4e540604ef5/_aMW9hAa6PDyIt6MiTpQXpb16THKdt1Axux_2tITPjLfATC1ZvWJIjXJJjbQf8V1G1QYYkgAZCMaCGal-GGZoTZE5gLgGOMgJGhERHPTnzpkwmwEgp9tJFUXehYnH8a1Sq5WsM30rkHrDjCader6CJc.png",
      "alt": "Semrush’s PPC Keyword Tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/6a/77/6a77e545cb0a75b17958d1ba7ea1c29d/47f800f4774d6e07b31018fdc395486a/1gP7Omqg9-a8ppbvmtA1c5isJeqzGHA-YnhfV4sf0QCkVi3oR_T-M8eEGyG9nINgKoCDY8sg56-4Kt5IULRNhCGlaO6F4bypGoObfZLwfSl0YR1oWQhxU5x6XC1L6YEzTSeKtFiiC7O1aypBQX23Ztg.png",
      "alt": "Keyword match types example for the keyword interior paint. Broad match are sherwin-williams, lavender paint, and interior design. Phrase match are paint for living room, buy interior paint, and white wall paint. Exact match are interior paint, room paint, and paint for interior."
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/60/2c/602c2a45f2939acc918b84033f23cb30/8536a38120f48cef76a8b0124d0d63f6/pWkjvPRGd6dvBWiJa1NMxAzbUVpaZAE-q9Qavt6nIUgqoEO4ZxZSOgy31v7VPuxgmBYQ-a5NkpXCYwg3Y13gShjORpYL4wCmr0CFl-M8dz78IAnkOMkReTd1Z6ZZZIZXlQcpD6AYzqaq1kt7YC3_9n0.png",
      "alt": "Negative keyword example for mountain bikes. Show ad for exact match queries like bike for kids, mountain bike, trek mountain bikes. Don't show an ad for the exact match keyword mountain bikes."
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/d8/cd/d8cd495a2a000f66e8d06b1e8d12c141/6aa25e662d9916c52974bf8a1a0fd806/5yIdSSddtgCQeiklRp5zBm5iaU8rCo01eA07ir4GStpiyEd-ZekgYS0uzsB0udU3ZyQVUoGhayOb2OkZaoWYfD-Xi2M5d0RUNK2-ACl-dJ39TfmOJoPFw27nqvizkc0-jvqRpGafR8uB4B5GjrxO9PY.png",
      "alt": "Ad groups separated into three categories: trekking shoes, climbing shoes, and mountain boots."
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/07/50/07503d7d0d0b5e7fca392975035d93c4/dbb9a6dbc8fd91108c8225530cc9bf49/KFZSbD9bSwFhuEKnQ4wxKjxFXu9cnSZth9PSQfeG1X2Ew6NMbwFr6UO8OrXLaWnULld2IhZ0Zs29_udVcDJ20ihPS-6LG5iCTFvjvjnKGdd2q9orwfQvMoTn4JVMiVg6gG7BqCdYpWbN9nwDczbExow.png",
      "alt": "A PPC ad mockup for \"women's hats\" showing keyword stuffing"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/6d/3f/6d3f8a0683d047e9463d12114c292545/a29ca151cf148d79437478bb702ef9bb/OnTYJQQKY8qUvU3P44JMzLiLCB2nSrfdsjCU0vHz6X0zha7Si6eZ8fJhyvm8l9pJkWcfngoCEFOUHp8Asgrl4DbjmLB16BPqld0VfdCZVNCVIejmcG7fWJ-4NsxcwYVASuwfPUstVdglkH6jocUENvo.png",
      "alt": "\"nothing.com/womens-hats\" entered into the AI Ad Copy Generator search bar"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/d9/c7/d9c75f5740435c357aeea01d6e057e62/822051abc9b1ff04e712982c2fea131f/EVGp9pzR4ycx9aMliKf6QDYHTyX597jfLIr46_SbxdQY08JLgrcWH-hhs2euXGcJEa6gG-wFFDHHVsEJk4wIlTX_7WComkBgZS2apCbIfYwkJIJMFrGigsw3CXq6kF6wpydiV6qp-5NC1Jz3YJlcwrE.png",
      "alt": "Keywords like women's hards, designer women's hards, women's winter hats, etc. entered into the AI Ad Copy Generator"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e1/46/e146a7dfc78dfc7032956dc1f4175879/ce75ec88b1e45cc87545fbd0822a73a2/Hlki22HwmF2E7BqC_Jqf0bFx7c2ySMGs_ttmgLZ3jUACa8NUVtlrFgWr-W5Uaa-tBG2__cLfD2HJ7QtNlnXt4kL4bG0HuMQ-HjurqzV8h2mkH7rMrZcYoRUbaAwkgUz5d8_Gl6iQYU32V8d34zrbGJs.png",
      "alt": "an ad copy for \"women's hards\" generated by AI Ad Copy Generator"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/04/16/0416483f260662ce3eea3e598b0bca32/4304cb13474ded3ec5ecb2206b1969f3/mG0M3bpxE4xpsAXTpzAwZAqGsLdx27LKirjBDAa5n7nrpv0wB8njU8CoWYYWWLC_vcIgflUYH5DuMsRXtALrunpN40ewS2VvDBc_ptt9jFGUKuhcZDyJWbsxpc_sPNyDz9rzPm5edgPoO4TcdVKgbWo.png",
      "alt": "a draft text in SEO Writing Assistant, with \"bag\" keyword flagged by the tool as overused"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/dd/7d/dd7de613a513eb83d7dfd11f9243b65e/c4db344e9e36773e24b68f59f83d47f1/1OCrbuefyuee-XvUMv0x2nG-QBm0mnvO7jM_D2NbJ-0zhRrUNkvRdYITl-V-gaLoNA40ZkKCsG5GNT0JZyy8G5xfW_iHq2Q_6pPctAmbINCJwRLV14N748i7fuFBAdnP7T-5Ru44n_U-IZTSJzUWcHw.png",
      "alt": "\"Google Ads\" selected from the drop-down in Position Tracking tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ca/c4/cac42b6e85678512dbf8f50125e41f23/02e9c52865892433c0b292a8ee0061c5/4OYLkSnOzYjELm3KgcLVBHAH2TY4CmYe4d3Bna1OSnnLfBQOMj4CTrwrGbVjp6hVhWUY1i5jmgiwfW0InxRJIbq0eCRtRJK4sL7wQ356VwZ4QLRHRocj5MfYZNQXBzUdNr7kCTYN8uI0ExtZCasaNs0.png",
      "alt": "Navigating to \"Audiences, keywords, and content\" in Google Ads"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/semblog-next-static/banners/trial-gift.png",
      "alt": "Trial Semrush banner"
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&d=Mon%2C%2021%20Oct%202024%2014%3A23%3A39%20GMT&n=4d&b=Google%20Ads%20Keywords%20Explained%3A%20Boost%20Your%20PPC%20Performance&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fgoogle-ads-keywords%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&b=Google%20Ads%20Keywords%20Explained%3A%20Boost%20Your%20PPC%20Performance&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fgoogle-ads-keywords%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://bat.bing.com/action/0?ti=5128787&tm=gtm002&Ver=2&mid=495bb40d-e934-47d2-a791-694005581ec2&bo=1&sid=ff2bacc08fb711efb44d311d3abb0ae7&vid=ff2c03008fb711efb2e37f1b0b73d2ee&vids=0&msclkid=N&uach=pv%3D15.0.0&pi=0&lg=en-US&sw=1366&sh=768&sc=24&tl=Google%20Ads%20Keywords%20Explained%3A%20Boost%20Your%20PPC%20Performance&p=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fgoogle-ads-keywords%2F&r=&lt=807&mtp=10&evt=pageLoad&sv=1&cdb=ARoR&rn=358514",
      "alt": ""
    }
  ],
  "publication_date": null
}