{
  "url": "https://www.semrush.com/blog/google-ads-campaigns/",
  "title": "Google Ads Campaign: Definition, Types, & Best Practices",
  "content": "What Is a Google Ads Campaign?\n\nA Google Ads campaign is a way to advertise your business on Google's advertising network to achieve your marketing goals.\n\nFor each campaign, you'll select a campaign type, add keywords (if applicable), create ad copy, target locations, schedule ads, and more.\n\nGoogle Ads offers a variety of campaign types to help marketers effectively reach their target audience (people who are likely to buy their products or services). \n\nSearch\n\nSearch campaigns target users who search for specific keywords related to your business.\n\nFor example, a bridal shop could use a search campaign to appear in search engine results pages (SERPs) when someone searches for “bridal shop near me.” \n\nDisplay\n\nDisplay campaigns use visual ads across Google's network of websites. And are effective for visually driven brands. \n\nFor example, a jewelry brand could use display ads to showcase its latest collection on popular relevant blogs and websites.\n\nVideo\n\nVideo campaigns in Google Ads work by placing advertisements before, during, and after a particular video on YouTube.\n\nThis type of campaign is effective for brand and product storytelling. \n\nFor example, a tech company could launch a video ad campaign to showcase its products’ features and benefits.\n\nThis approach allows you to explain complex products in an accessible way. Potentially increasing customer interest and sales.\n\nShopping\n\nShopping campaigns allow e-commerce businesses to showcase their products directly in Google's search results.\n\nFor instance, an online store could use shopping ads to promote its products to people searching for related categories.\n\nDiscovery\n\nDiscovery campaigns help brands reach potential customers as they explore interests across various Google properties. This includes:\n\nGmail\nYouTube\nGoogle Discover feed\n\nFor example, a travel company could use discovery campaigns to showcase enticing vacation destinations to users who have previously shown interest in travel-related content. \n\nThis type of campaign uses Google’s machine-learning algorithms to optimize ad placement and performance. \n\nApp\n\nApp campaigns promote mobile apps across various Google platforms. Including Search, Google Play, YouTube, and the Google Display Network.\n\nFor instance, a gaming company could use an app campaign to boost downloads of its latest game.\n\nSmart\n\nSmart campaigns are designed specifically for small businesses with limited time and advertising experience.\n\nFor instance, a new cafe might use smart campaigns to boost foot traffic. With little setup required, the cafe can attract local customers. Even without deep advertising expertise.\n\nSmart campaigns use machine learning technology to automatically:\n\nOptimize your ads across Google's entire network (Search, Display, YouTube, Gmail, Maps)\nTarget relevant audiences likely to convert\nCreate different ad versions and find top performers\nAdjust bids and budgets in real time\nPerformance Max\n\nPerformance max uses Google’s machine-learning capabilities to optimize ad performance across all Google networks.\n\nThis campaign is designed for businesses of all shapes and sizes. And it helps them achieve their specific advertising goals, such as online sales, store visits, or lead generation. By automatically adjusting bids and budgets in real time.\n\nFor instance, an e-commerce business could use performance max campaigns to maximize their online sales by reaching potential customers across all Google networks.\n\nThe campaign would automatically optimize ad placements and bidding strategies to reach users who are most likely to make a purchase.\n\nWhy Should You Use a Google Ads Campaign?\n\nGoogle advertising campaigns offer several benefits that can significantly enhance your online marketing efforts.\n\nIncreased visibility: With Google’s vast network, you can reach a wide audience that is interested in your products and services. Which means more engagement and potential sales. \nImmediate traffic: Unlike organic SEO strategies, which can take months to drive traffic, Google Ads starts directing relevant visitors to your website immediately. \nTargeted advertising: Target ads based on geographic location, time of day, device, interests, previous website visits, and other factors. So you reach the right audience at the right time. And optimizes your advertising budget and conversion rates. \nMeasurable ROI: Track a variety of metrics, such as impressions (how many times your ad was shown), clicks (how many times people clicked on it), and conversions (how many desired actions are completed). So you can understand your campaign’s return on investment (ROI). \nHow to Set Up a Google Ads Campaign\n\nBelow, we’ll cover how to set up a Google Ads campaign step by step. So you can learn how to advertise on Google.\n\n1. Create a Google Ads Account\n\nThis account will house all of your Google campaigns and data. And it's easy to set up.\n\nLog in to your Google account in your browser. Then go to ads.google.com and click \"Start now.\"\n\nIn the pop-up window, click “Create your first campaign.” \n\n2. Add Business Information\n\nFill out your business name, website URL, phone number, and app listing page (if applicable).\n\nThen, click “Next.”\n\nThe next screen offers the option to link other accounts: YouTube channel, Google Business Profile, etc.\n\nClick “Next” to continue the Google Ads configuration process.\n\n3. Select Your Campaign Goals\n\nSome of the main goal options include:\n\nPhone call leads: Best for businesses offering services or consultations\nPurchases: For driving direct sales through your website—an ideal option for e-commerce stores\nSubmit lead form: Great for generating qualified leads for your sales team to follow up on\nPage views: Ideal for driving more traffic and eyeballs to your website content\nBrand awareness: A broad, top-of-funnel goal to increase visibility and exposure for your brand's product or service\n\nIn this example, we’ll select “Brand awareness” as our goal and click “Next.”\n\n4. Select Your Campaign Type\n\nThe next step is to select the campaign type. Depending on your goal, Google will suggest one for you automatically:\n\nGo with the suggested option or select a different campaign type based on your specific advertising needs and objectives.\n\nThe campaign type determines how and where your ads will be shown. \n\nIf you select “Video,” your ads will run on YouTube. If you select “Display,” your ads will run across partner websites. For “Search,” your ads will appear in Google search results.\n\nFor this example, we’ll select “Search” and click “Next.”\n\n5. Adjust Your Campaign Settings\n\nOn the next screen, you’ll need to adjust a few settings to decide your campaign’s targeting.\n\nFirst, enter all the relevant keywords for which you want your ads to show.\n\nFill out the remaining options, including:\n\nLocation: Select the geographic areas you want to target like countries, states/regions, cities, or radius around a location\nLanguages: Choose which languages your ads should be displayed in based on your target audience\nAudiences: Optionally, define specific audience targeting parameters beyond just keywords and locations. This allows you to further refine who sees your ads based on demographics, interests, education level, etc.\nNetworks: Choose whether you want your ads to show across the entire Google network, including Google Display Network, or just Google Search and Search Partners\n\nAfter finalizing your campaign settings, click “Next.”\n\n6. Create Your Ad Copy\n\nFor search campaigns, you'll create text ads. These are comprised of three main elements:\n\nHeadlines: These are the first lines people see in your ad. You have 30 characters for each headline. Make them catchy and relevant to the keywords you’re targeting.\nDescriptions: Your descriptions are limited to 90 characters each. Use this space to highlight the unique selling points of your product or service, and to include a call to action. \nFinal URL: This is the landing page where you’ll send people who click on your ad\n\nAs you edit your ad copy, you'll see a preview of how the final ad will look on Google’s search results.\n\nOnce you’re satisfied with the final version, click “Next.”\n\n7. Set a Bidding Strategy\n\nYour bidding strategy determines how your advertising budget will be spent.\n\nGoogle Ads provides several automated bidding options that utilize machine learning to optimize your bids in real time based on your goals: \n\nClicks: Google's systems will prioritize getting you as many clicks to your website as possible from relevant audiences within your set budget\nImpression share: This option allows you to set a target for how often you'd like your ads to be displayed from the total number of available impressions. Google will adjust your bids to maintain your desired level of ad visibility.\nConversions: This strategy aims to get as many conversions (like sales or form submissions) as possible within your budget\nConversion value: This strategy focuses on maximizing the total conversion value of your campaign within your specified budget. It’s ideal when the value of your conversions varies and you want to maximize the total value rather than the number of conversions.\n\nSelect your desired bidding strategy and click \"Next.\"\n\nNext, decide how much money you want to spend on your campaign per day.\n\nGoogle will recommend an average daily budget based on your campaign settings, but you can also set up a custom budget.\n\nSet your budget, click \"Next.\"\n\n8. Enter Payment Details\n\nGoogle Ads accepts a variety of payment methods. Including credit cards, debit cards, net banking, and bank transfers.\n\nEnter your payment method and choose your payment settings:\n\nAutomatic payment: You’re automatically charged after your ads run\nManual payment: Prepay Google Ads and have your payments deducted from the prepaid amount\nMonthly invoicing: Google extends a line of credit to you for your advertising costs and you receive an invoice each month\n\nScroll down and select “Yes” if you want to receive phone calls or messages from Google experts. To receive personalized recommendations for your campaign. Otherwise, select “No.”\n\nClick \"Submit\" to complete the campaign setup process.\n\nYou’ve now set up your Google Ads campaign. Your ad will start running as soon as Google approves it. \n\nThis process usually takes about one business day, but it can take longer. Google will notify you via email and the campaign platform once your ad is approved and live.\n\nBest Practices for an Effective Google Ads Campaign\n\nBelow, we’ll cover some best practices. So you’ll learn how to launch Google ads in a way that maximizes your campaign performance.\n\nTarget the Right Keywords\n\nKeywords are the words or phrases that users type into Google. Your ads will be displayed to people searching for those terms (if you’re running a Google paid search campaign). \n\nChoosing the right keywords is essential because it determines whether your ads will be shown to the right audience—people who are actually interested in your products or services.\n\nFor example, if you sell car insurance packages, relevant keywords could be “car insurance,” “car insurance quotes,” and “best car insurance.”\n\nUse Semrush’s Keyword Magic Tool to find your target keywords. \n\nInput a broad, relevant search term into the tool and click “Search.”\n\nThe tool will present a list of relevant keywords along with important metrics like:\n\nSearch volume: The number of times a keyword is searched\nKeyword difficulty: How difficult it will be to target the keyword compared with competitors\nSearch intent: The motivation behind the search\nCost per click (CPC): Estimated amount you’ll pay for each click on your selected keywords \n\nLook for keywords with high enough search volume to reach a wide audience, low enough keyword difficulty to optimize your spend, the right intent to serve your business needs, and a CPC that fits within your advertising budget. \n\nFor example, if brand awareness is your focus, target keywords that have “Transactional (T)” or “Commercial Investigation (C)” search intent. These signify that a user is looking to find relevant companies rather than just gather information. \n\nRegularly review and update your keyword list based on the performance of your campaign. Test variations to ensure you get maximum value out of your campaigns.\n\nFind the Right Keywords for Your Google Ads Campaign\n\nwith the Keyword Magic Tool\n\nTry for Free →\nOptimize Ad Copy\n\nYour ads should grab the attention of potential customers. \n\nStart with your headline—the first thing users see. Include strong calls-to-action (CTAs) like “Buy Now” “Sign Up,” or “Get a Free Quote” to encourage an immediate response. \n\nIn the description, highlight the benefits of your product or service. Use words that evoke emotion, speak directly to your target buyer, and keep it simple. \n\nThe user should be able to quickly and easily understand what the ad is about and what action they should take next.\n\nFor example, take a look at the auto insurance ad below. It starts with the direct headline \"Get Auto Insurance Quotes,\" which motivates users to take quick action. Below the headline, there is a description that provides a clear incentive for users to engage with the ad.\n\nTest different versions of your ad copy to see which lead to more clicks and conversions. Focus on varying one element at a time, such as the headline or description.\n\nStructure Your Campaigns\n\nGroup your campaigns based on your products or services. For example, if you sell insurance, create a separate campaign for “car insurance,” “health insurance,” and “travel insurance.”\n\nWithin each campaign, set up different ad groups for each product or service within that category.\n\nFor instance, under the “car insurance” campaign, you could have ad groups for “comprehensive car insurance,” “collision coverage car insurance,” and “new car replacement coverage.”\n\nEach ad group will contain a set of closely related keywords. For example, the “comprehensive car insurance” ad group could include keywords like:\n\nComprehensive car insurance quotes \nBest comprehensive car insurance \nAffordable comprehensive car insurance\n\nThis ad group structure allows you to create hyper-relevant ad copy and landing page content tailored to each product.\n\nThis logical campaign → ad group → keywords → ad copy structure is key to driving qualified traffic and maximizing ROI from your Google Ads campaigns.\n\nOptimize Landing Pages for Conversions\n\nYour landing pages (where the ads drive users to) are where the conversion action takes place—whether it's a purchase, lead form submission, or another valuable event. \n\nFollow these best practices to optimize landing pages for maximum conversions:\n\nEnsure consistency with ad copy. Your landing page should reflect the message and offers in your ad copy. So users know they’re in the right place. \nSimplify the design. A cluttered page can distract users from taking your desired action. Use a clean, straightforward design with ample white space to focus attention on the important elements, like the call to action and the benefits of your product or service.\nOptimize page speed. Slow-loading pages can lead to high bounce rates. Ensure your landing pages load quickly by optimizing images, reducing server response times, and minimizing the use of heavy scripts that can slow down the page.\nUse high-quality visuals. Incorporate relevant images or videos that complement your message and enhance the visitor's experience. Visuals should be purposeful, helping to illustrate product benefits or demonstrate how a service works.\nInclude trust signals. Add elements that build trust, such as testimonials, customer reviews, case studies, or trust badges (like security certifications). These can reassure visitors and enhance your credibility.\nMinimize form fields. If your landing page has a form, keep it as short as possible. Request only the essential information you need from visitors to reduce friction and increase the likelihood of completion.\nLeverage Negative Keywords\n\nNegative keywords are words or phrases you choose to prevent your ads from being triggered by queries unrelated to your business.\n\nSaving you money by reducing irrelevant clicks that will never convert. In our car insurance example, “boat insurance” and “RV insurance” could be ideal negative keywords if you don’t offer those services. \n\nTo add negative keywords, sign in to your Google Ads account.\n\nThen navigate to Campaigns > Insights and reports > Search terms report.\n\nThis will show you every search query that triggered your ads, along with metrics like impressions, clicks, costs, etc.\n\nCarefully scan the list of search queries to find and capture irrelevant terms.\n\nNow, go inside the relevant ad group and click on the “Negative search keywords” tab.\n\nClick the plus button and add your keywords.\n\nRegularly review your search terms report to ensure your negative keywords list is optimized. To save you money. And increase your campaign’s ROI. \n\nResearch Competitor Ad Strategies\n\nCompetitor research should be a key part of your Google Ads campaign strategy. Because you can see what’s working for them (or not) and use that info to outpace them. \n\nSemrush's Advertising Research tool is perfect for this task. \n\nOpen the tool, enter your competitor’s website, and click “Search.”\n\nYou’ll see a lot of information here. Including number of keywords, target keywords list, total traffic from those paid keywords, and CPC. \n\nAnalyze the report to see if you’re missing any important keywords. And add them to your campaign.\n\nNow, go to the “Ads Copies” tab to view the actual ads your competitor is running. \n\nReview the messaging and CTAs to identify areas for your ads to improve. \n\nClick on the headline to view their landing page.\n\nAnalyze the design, layout, and content for ideas for your landing pages. \n\nAnalyze Competitors’ Ad Strategies\n\nwith the Advertising Research Tool\n\nTry for Free →\nLeverage A/B Testing\n\nA/B testing, also known as split testing, involves comparing two versions of an element (like an ad) to see which one performs better. \n\nIt’s a powerful strategy that can help improve the performance of your Google PPC campaigns. Here’s how to leverage it for your campaign:\n\nFirst, identify the specific element you want to test. Like the headline, call-to-action, or description. Your goal is to prove a hypothesis, such as “longer headlines work better than shorter headlines for my product.”\n\nCreate two versions of your ad—one with the original element (A) and one with the changed element (B). Focus on changing just one element to either prove or disprove your hypothesis.\n\nThen, run both versions of your ad simultaneously. Google Ads will randomly show one of the two ads to your target audience.\n\nAnalyze the results. Look at key metrics like click-through rate (CTR), conversion rate, and cost per conversion.\n\nIf version B performs better than version A, consider making B your new default ad. Or vice versa.\n\nBy leveraging A/B testing, you can make data-driven decisions and continuously improve the effectiveness of your Google Ads campaign.\n\nLaunch Your First Google Ads Campaign Today\n\nYou now have enough understanding of how to run a successful campaign in Google ads.\n\nThis is your chance to apply what you’ve learned. And leverage the Keyword Magic Tool and Advertising Research tool to help you save money and increase conversions. Start today for free. \n\nOptimize Your Google Ads Campaign\n\nwith a Free Semrush Account\n\nSign Up Now →",
  "headers": {
    "h1": "Google Ads Campaign: Definition, Types, & Best Practices",
    "h2": [
      "What Is a Google Ads Campaign?",
      "Why Should You Use a Google Ads Campaign?",
      "How to Set Up a Google Ads Campaign",
      "Best Practices for an Effective Google Ads Campaign",
      "Launch Your First Google Ads Campaign Today"
    ]
  },
  "images": [
    {
      "src": "https://static.semrush.com/blog/uploads/media/33/d7/33d72f7c3a5ec755198f6c598d6f4720/c9ae7e0504c1e6078dc662b304b6ca67/google-ads-campaign.svg",
      "alt": "Google Ads Campaign"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/eb/4d/eb4d18035392435bb751c75e2e2fa073/a2d9244442a1362708424bd50788a521/AD_4nXeEbL-2naQJ0hNeopc8GPKzcutIh_hQyDDempH5HAwToeZfhwZtf_Ii52FCyL6EPim0HyME_FB2O-ASWXXg3431LXqx4VkEZfVK6R4ePr_87ZMqQhqkQ7e41vSid3cLQTQ1-ZJvqIWcsJDhslxrKONjLALz.png",
      "alt": "search for bridal shop near me shows a sponsored search ad for a local bridal shop"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/a1/06/a106a0cdaa0d87c318c132580b29446e/3330ced2d0b7542af9b653dbcf97301b/AD_4nXfxNb_qHHJ8iHfLVj2E53DsAaPdHzU9Go14E0CJlBHwLFjH_FBHsCcBhyG99eSQzfZknUtjs7gTB6AapAAg-AyGurLddo6OI1SOq8CPaMfQFxm3Aw0PofB6I1lmgwzbam3COsiyWh26T5MBJDkJgmN2Zy0.png",
      "alt": "Cartier has a display ad near the top of a marie claire magazine webpage"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/b1/e9/b1e90805f350ea9c894e5c21ee1da482/a9a293e7b6022db7643e061a43421f14/AD_4nXcplEAWGZ9yCW-Dv_rlFd1f-FZc9WKu-lFLWxh_rsxk5Z8Al-_vIo_q6MbZWX_-28J0K0o5eMUSaLjaFMlUlBrgavv-0Njs_zdO6_PZAbRT1rU_tfYbb9GjHL769taL21Nu6lbRMKCMBbZvfZ24v9-nzyfm.png",
      "alt": "a seo on wix ad plays before an seo for beginners video on youtube"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ca/f4/caf4a00da867e71c28c096983831f997/227c26e9b6fa5890bf324d873cce49c8/AD_4nXfz1NYA1M79y4HLAo0d3UnjWjYLAGffCG7rthNA_MT90hypHbpEdi6CMKKcQix0VYi30hgfjkAE50YT4Yo8Guqy_Ljmc1D4Y65TV-tg1Cm5ay-A8EJYoBMoxJpuhbhMscVg36VXP5CIgeTogycIECanltVq.png",
      "alt": "shopping ads for smartphone appear at the top of the serp showing different models from different retailers"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/bd/d1/bdd119c1280eefd364f207558b5ef699/f85882db155af3e67081f0f7ae11c8c6/AD_4nXeDNUnqn_Hq4v1UxgIgNmebneemvjbUnxJDof1WKAJMU3DOQw3gtDYl9ypYNmssqJhEK6aUNbJrnhymX-gNvM_VVE3-v7UvkRMuFE7QokZEdFHMCCNd8N9wQSopmOBjiatGdTPXMJxpzwodJlJ5tjCI_lud.jpeg",
      "alt": "google discover ad shows a retargeting ad after searching for iceland trip details"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/53/2a/532ac986670eaf62ffff813e2dc689dc/a2534e5a7c59d63686be138958175961/AD_4nXfIL6hwiZYrlk86oM0QyLa5TAN-VKuCyHO24ODniyOMct3JsvT1AMWU_Ih3BvExauRlKnw_jQ8UyrGs2iKy2ZM0enSkhTmmes-HiXI1yI1wQhSyuNd1ez3J6dV-muwvsOU5Kn53kHuzFQVfQRVaXGvdejCR.png",
      "alt": "sponsored app section shows three phone games suggested for you"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/42/12/421273204f0f32600b818210965b1752/6fbd01a4eea4b50664079a3675592109/AD_4nXfR88XXik5OuXXkc2Bn3psSwTLo5qO_m1QSOX9Dl6FI59UQDThiTvTv6JMoQhky0LzgbuU16j5v5CMyPaoOTMWb7OpY8Jx2gq0aOP0OofpoPuZh4RSk7l91Uht_YN205F2UiwByko-KlfZlmSLauRHadUgf.png",
      "alt": "google ads landing page"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ed/eb/edeb742bd53abc012097db8f66ab2c38/d117d1f6dcdf0ac71914e609323a4bc8/AD_4nXfi_SLDKwKE5Mf8C4Ae4RK-kLHTvq1iXw6AYi9GQjAyz07h-vgmpi42Fc9QNsns_7jYandvicgD0dUqTajL2swDZiZz4k9p6loMcvoOVLYzLdIDWHblGAV7KIrfBTbHVl1l1wf_4qnOiS3Q-afhlHPSSaq_.png",
      "alt": "create your first campaign popup"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/30/2f/302fc9d7d3415dac4515192eae756366/970bd767675fd2c6bb7c36032284ae89/AD_4nXcqPsr5b_m0aKx4zSaVqgpDfZY61uXf4FX1KB2wY0w8RBjH1I3dDOBf-uGMfr9Rzl2R8rM4cpRLW15Fj7oIfMnH6P7ufdnAu0aaTcsDtpX9HRbrWfeZJFDFWQeYtF0XKkgRDTfEpzdbdP6ahF5rqqvmH7Y.png",
      "alt": "tell us about your business page"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/16/4c/164c31b566db0f4521a3410b73bea1d6/af3e46fb509dab24b004379a6e400f41/AD_4nXeVWnGrkzfHfYyqhKefBR4JPrEK1Jebj9yi58Mt32lhiQVe9luuL1SLkz6BpxCDUY2956NT3OWSYP_gcyXyU6J9AV1_Tm59yNxdKBi3I805LieVFYgthyMhMhv5ZchWm8Y7qRWZa_Ra6uxXaaaNDp1cOFU9.png",
      "alt": "linked accounts page"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ab/cd/abcd078c43df9564e9675962492b467b/d9a85920ae915a7d3ccd22d9b4286dd7/AD_4nXdNlISpdACZeluEu7DlInWxAXTmD0uDU0wsXaSki3uzWLz2DevKHNTbpg9kzQsQOVxB2K1gVdK5t_IphYDuA62JXAp9Zgct_oZ78Nxcu1RlgJxFmj5q8lm87NEsFdGlEJiP5zwlNb_Bf1ykRke9rw3lRw-n.png",
      "alt": "google ads campaign options"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/be/d0/bed05755db785dc4905affb7b4d8ea77/f853bb0561ab459fe433a24ff66b4c5b/AD_4nXdwzX_fjOexLuBJaosOeOYigHvfigyTZ2NKCwdQvO9pWfAFvN8uS935ygRDMkx0EdnoaR1BJlFLuk5xZPFcfsS7ZXBJGmewMBrpPGxw9DOLjp4QpkyO2to7fUxBPO40wawxXFhXEZfTPwMSBh_wTpwB60EU.png",
      "alt": "google ads campaign type options"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/04/db/04db6cc34af88834dfb5f50d48110f3d/9a1b227f1ae509ae7f188493e0363da7/AD_4nXerPablvIWL6N-Rq9qaY0_2liFH_QmJ8DO2LL91X-tJyQathpOvEXZKZ94ZREdAHSG9cm1xjfP-ePkpuN9DH-a7wD826_ZTi2eI-zDbViDNQTvYtorB2ecIISZBe1y3iyBTR3y8oVbaUZfEHWD5wPDb5ww.png",
      "alt": "enter keywords that will show your ads"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/66/7f/667fc3015e72f9d3f2bcabf9c2fb9e81/5f2eccfc488b743357a2bdef0e5d5085/AD_4nXf_6pARn4cDvmZ-tzHxmlaqpa8qUTMTpbTJa1IfRyJJP8barE2DWP-tLQ7r2nyypMiNalmSrP6Ppiz_IC6w-B40tW-Tr73TbQrXd6MGgxDsa3Hg98ud4YigCq5Tz57Nn6qeNBSCgYXJgnNX2Hh91EEYhJhW.png",
      "alt": "more settings section of the setup process"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/89/6d/896d716faec058acd64a1c4c63006544/087b7e23560f1e85d78e8d91e07ca874/AD_4nXcrOyNN6zoC8XKXve6MZYLwmcn8c7DKovGaStyK4YuyrdHdUbmWUhTpmx0n5Pk55aAmF7C-sFf-vSvX_hfh5nw956pmDxD1pKPL1jRim-1WENVH21YYG4QpxRTpy4aSFz0-rXZB84kozxeqdkNQR1Ys6gQ.png",
      "alt": "create an ad page"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/41/00/410095593f327d7fbfa2309e95e3d6da/c21aa9e34a87215e40441995523a8c24/AD_4nXdPWMaoRjmoJmFcDrjfPKsjD6470QQCLPGf14yMtL_Y_1DOmJF4bAXj65-FA7IyqIP4Sxqymr7_JAvz8FST-i8Y1GjocUI25RDr3iM51KY3_Vlz5mFwcPYBgeefkxgSS15_zzhQC8zVEppT1M4yhFpk5TiP.png",
      "alt": "set a bid strategy page"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/3e/17/3e174bbcc414bb590018ddfa290a3407/9df2e6b56d9c0045ddbfd894d53f6fff/AD_4nXdmrw26a7qG63NeBHg8QYIIJ586mRQXeKLr781o8pTClH0DiiaM8YQrzOeCXHc1apKYVPfXUfG0IugRh5qtoA-EmtC5AKUzJmP9URjmJE554wIXIP7_eTr1OBcogDhSOLwqrZsnW00sIAEHHtiqDehHkk01.png",
      "alt": "how much do you want to spend per day page shows amounts and recommended average daily budget"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ef/17/ef178ee766560c48bd585ee1577fad30/c311da9d2f6cbb0121ebef7cbd049dc5/AD_4nXeHlPArQ99_doIZSh99c45gLsQXqtUEA3RwZCwy3hlg7qvnRr80ldT91_69gJFkk2ccWVJ7lt4BXzw1hQh7g9HANth1SSGB_-Axbkhbg9OIAtkypKs7ezwUbJC3Lvdmr9h6n5dPGvpG7jl-ZJM_fkY0_VA.png",
      "alt": "payments profile setup page"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/76/b5/76b513c6821e8b9a2a24e15424bd305f/e8a0edd27f1a132fb3264499c1ae9bca/AD_4nXeZ3khDaAfWU3GXxzaNguKRFIui0FRkvOn037bJEb7k5Kum6_Sq1dNV2iinG7j5HE-ENpLSctbMqEHgrEru8rG-Jukz_-kyZxD19Fm7FSZi1d4GDQl_ZmeuoSAAocgObkBooZYeq068gW6ZPraJOG7u7o7b.png",
      "alt": "no option chosen to receive personalized guidance from google"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/1a/28/1a28f0c5610e4a50ef0a90f0c838da45/bded2f173bd7a488336906328121f4a3/AD_4nXdvBuEUc8gNn2_bsgHrq6GyoQBw96Qnxkm8Rf-_1_jqzX9hI-93FR9pZhc6nkz8lKX8oIhCcSUs_M9ejxrOJZDjrY1t5JKxrGrS9eJHHIpP-w0jdse16kUipcgozdKTzx5OZYwCC5KMNZImlPsZe6uT9uMn.png",
      "alt": "search for car insurance in keyword magic tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/8e/54/8e54e4cc8492081bd2e1d1ce3729a8e5/e954cafda9bfa28de123f724f0f8233d/AD_4nXcvVgbn8IdgBeH6rq4M7QAlf0fagjYSqEVG6SOSAysimTT8KsQ24MM80gDvOszaPrjsXiKTaLBbvdIWRwBIE1vyB5MpXV4O7UvyRBIkSzpzmNe46jOAILqz2EqdSQmJxirGK3I2LGAyuOwdEu5fqvdToF40.png",
      "alt": "keyword list and data"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/3a/8c/3a8cce0337f14e3ec446916427237ba7/f59bd0b33e836e8cf2320982a8ab18e5/AD_4nXe3bwd52sViB3V9Fbn70MRA6k_faB0pE-GguoiHk5BHC6oLDUF6aSoTetPcGqgbFpEB5FnuRQw354ewbvFmsAhuDI6MYm2fgBNS4ANI1bkON4xSLyywzuIu3KOnJWu6D0ZFKJJbCyGuwsQh7ZqS9B3qXjs.png",
      "alt": "for example what is a dog bone is informational intent, petco dog bones is navigational, best dog bones is commercial, and buy dog bones is transactional"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/11/01/1101de5cfc641ea62573723c81ee460f/bc2822d4021ef2d7f20903af03b72f0f/AD_4nXc39mxcpPV2F6Y_c-MeOGteyCukPzbJasvIhgn1_No0rPTypQvn3alyWU9bmTlphKbdsO-4x38I9hWxgBK_VV-9_GUUvq5bHDDW06MBjO_dA3AXXE_a8bT-msXCdlt1RFmkpDDfFXnWj5TSsr67_k6XFNvt.png",
      "alt": "google search ad copy says get auto insurance quotes with sitelinks"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/2d/77/2d776c2857f352edb42ce4b7cf6e84fa/7646ccd86663cccf1cd71a9bfb049eae/AD_4nXeJtGBwxA4GcnabDSfxuWMPc23SPDTGqQvZ-TY9QfegxzHiZuSRkx9vUQn--CWWU5GR-Vc_JDrBqaQ1v7Bhkqw3dypeCyeX0WgxfOch-UbgalCvrOnH31nukJpqCb0PkW4Rfxlly8kEtcesJLNSAq_H5qCE.png",
      "alt": "google ads campaign structure"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/3d/2b/3d2b94015d4d1abab4f1595bc8f11d6f/946192d6049d78fbb3be5c137d286e89/AD_4nXdKdfx3rxqjumWbEc3qBlBuFRkOp0pw_fLz5Uw6mEBWepLyxHJk2c2DDgUPL9Z7XaLaHODqedxyhDlS8KsotUtDNlJIJ8Nel2RD44uRwRo64eaNXIzjC1o0RtH0GdMvofCNfxM_vmrHfuafIRVbD49_w04v.png",
      "alt": "search terms report highlighted in navigation"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/50/32/5032c7732949f5b154321f779fd09665/1a9834f62aae55a97c81fbd327e9f489/AD_4nXc-KElVaBJ9amUa166xGAVtavUhxeq_iT1j5Fqall36wUEhkoJFXIfV7SoMJHYyky1qzH1CnnRvnEmjHZPsXMhqdGZu6V_3UyZsOWxheoBmR3_4k6KQ6i5S4UlBiqv-2qemSd4uyytcWpUkqbc8fHyzrjHZ.png",
      "alt": "google ads search term report"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/16/ac/16ace428433f7d642741bc1891188544/b86b1980ff951a57d3e531bcedfcb14a/AD_4nXdDPAFWPVVLJymgD4YRjvnwnNHUHamQ7Rka1rlbJeccJ70AXDJpgr5VhOca2662heFZgcRSlaHz8_-GS22cC18f1I442mXA_Vp0E4xTnMx3xCIWCnC_COEbbDrUfmjj0HD2G8AltWTGEgmxQXejFNO5iuPr.png",
      "alt": "plus button highlighted to enter negative keywords"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/51/d9/51d94a40a48f195f2239dbbfde4f85d7/683683712504873b472041ef5e4fcedb/AD_4nXcsAL3Rm0ONU7cB0ONSw9V4brqzI9oX-3O-EDZyR12A9RHOzFLeBKGvaGNJQqSSZD-EHarBlaiZR7tfkMR-AmQMTfwIp1lTFN6IaZ1Wj_3Zcw4OFGpaGjlbfvD31rDML-eCqR9MnntS8aoULMuFxzP6PxI.png",
      "alt": "geico.com entered into advertising research tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/76/6b/766ba35a0e1a75a238e008e9015961e3/7a65fddb022724f8a898987e6a9d8aed/AD_4nXfpVD_9m7ri8ltIQ0HdmTauZFH0b7EZxLXLFKvlYIQaKsg9AILW8jf1PWpEd06eqtq2au2-CFvJFOmNYFpdaepMsoL-oA30MmcEOaUArqGPu13AXFQ8kC-s0E_-TwGr7KLy_O3GSkxiZLX9PZ61wpOf_w_S.png",
      "alt": "advertising research positions report"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/2a/84/2a846607bcf5f0cea13d28e46481663a/3f76bc18ea033099b3bdf7cf53316c96/AD_4nXe5TXXG0z1k0Bxf9dcCoybXdW1SGdnxWcRVlZTnZB4zzANt80uCbOGkRX3ZGh4GTrFtUiav90cNvTD8POb9YPl1a_JZhsONGzsIK8vozlOF8V_HJi5LwVPoF6zdRMCUvlaxBqqsxCFKCOnnd1-_vTHXlaw.png",
      "alt": "advertising research ads copies report"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/d4/03/d403427b89e51154803160fb1ec87b14/284a8b190f3687b35e5efc7b3a839f1a/AD_4nXdu7ShQvlk_VasT0iMzW3c02IrgbV_Zx1GGedO3P-iiAg727QhKLGYv7fJMh_uMo5o_BzawKcSsCInlOa9VkaGsBiDrkxxtQmNnVupadWzzmvkd33zbxLg711yZ3g5AzXNxZgBQ4-VvlRTxUe3YEI0C3Xa4.png",
      "alt": "avoid testing too many variables at once. test either swapping the image or the headline but not both at the same time"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/semblog-next-static/banners/trial-gift.png",
      "alt": "Trial Semrush banner"
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&d=Mon%2C%2021%20Oct%202024%2014%3A25%3A26%20GMT&n=4d&b=Google%20Ads%20Campaign%3A%20Definition%2C%20Types%2C%20%26%20Best%20Practices&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fgoogle-ads-campaigns%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&b=Google%20Ads%20Campaign%3A%20Definition%2C%20Types%2C%20%26%20Best%20Practices&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fgoogle-ads-campaigns%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://bat.bing.com/action/0?ti=5128787&tm=gtm002&Ver=2&mid=c3c80066-91d3-42f6-99d2-8a235b29a144&bo=1&sid=3d5c62908fb811ef80185dfa74ec9eb6&vid=3d5ce8808fb811ef87cb2fe9471b7ba0&vids=0&msclkid=N&uach=pv%3D10.0.0&pi=0&lg=en-US&sw=1536&sh=864&sc=24&tl=Google%20Ads%20Campaign%3A%20Definition,%20Types,%20%26%20Best%20Practices&p=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fgoogle-ads-campaigns%2F&r=&lt=754&evt=pageLoad&sv=1&cdb=ARoR&rn=989623",
      "alt": ""
    }
  ],
  "publication_date": null
}