{
  "url": "https://www.semrush.com/blog/grow-ecommerce-business/",
  "title": "How To Grow Ecommerce in 2023",
  "content": "According to a report by Statista and eMarketer, online retail sales are projected to reach $6.51 trillion by 2023. That same report also says that ecommerce websites will claim around 22.3% of all retail sales. \n\nSo, if you weren’t planning on investing in your ecommerce strategy this year, you should. Here, we’ll talk about the different elements of a smart ecommerce strategy. You’ll get familiar with: \n\nTrends in product strategy \nSupply chain management in 2023 \nSEO and online visibility \nReputation management \nInfluencer and affiliate marketing \nBig data analytics\nLocal SEO \nCustomer nurturing strategy \n\nNot only that, we have included some sage advice and tips from industry experts on the emerging trends you can expect to encounter in 2023. \n\nData and search are pretty much the big topics I see everyone talking about. What I’ve noticed with a lot of people (clients and a lot of agencies) is that by not knowing what to do with their data, it’s costing the company a small fortune, not just loss of potential new revenue/customers but also lost revenue on acquiring data and not understanding what they should be doing with it.\n\n— Dan Saunders, Head of Performance Marketing | International Keynote Speaker & Judge\n\nOther experts who have shared their wisdom in this article include: \n\nLiran Hirschkorn — CEO and Founder at Incrementum Digital\nFernando Angulo — Senior Market Research Manager at Semrush\nKevin Indig — Growth Advisor\nHimani Kankaria — Founder at Missive Digital\nPavel Beinia — CEO & Founder at Influencer Analytics\nColby Almond — Digital Marketing Speaker and Leader with Expertise in Amazon and Ecommerce\nWill Haire — CEO & Founder at BellaVix\n\nWithout further delay, let’s jump into it! \n\nFind Products That Will Sell in 2023 \n\nFinding the right products to sell is key to success in ecommerce. You can no longer create commodity or ‘me too’ products and expect success. Instead ask yourself ‘what problem is my product going to solve’ and ‘why would someone buy my product’ as opposed to all the others out there. Use data from Amazon reviews and forums to understand how to make better products and improve the customer experience. That along with understanding keyword demand on Amazon will allow everything to flow more easily as you launch and market your product. [This will be especially popular in 2023] because ecommerce has gotten more competitive and old strategies I mentioned no longer work.\n\n— Liran Hirschkorn, CEO and Founder at Incrementum Digital\n\nArguably the first and most important thing you should focus on is what products to sell. \n\nWhile inflation is expected to fall from 8.8% to 6.5% in 2023—meaning consumers will have more purchasing power in the next 12 months—you still need to be highly selective about which products you plan to offer in this economy. \n\nYou can take several approaches to fine-tune your product offerings: \n\nLook at the previous year’s sales, cut the lowest performing product, and invest that cashflow back into sourcing more products that have been selling well \nThink about a problem you have that a product could solve, and research to see if others have the same issue\nConsider what unique pain points your customers will be facing in 2023—COVID-19 restrictions, inflation, recession, and a digital-forward culture will all impact consumer buying decisions\nDo keyword research to determine what customers are searching for \n\nLet’s flesh out that last bullet with an example. Keyword research offers a fantastic way to get a sense of what problems customers are facing and trying to solve in the new year. \n\nOne way to figure out what customers want is by looking at search engine results. Keyword Magic Tool gives you data on both exact and broad match keywords, meaning you can see what else people are searching for in addition to the keywords you have selected.\n\nBut even if you have a brilliant, keyword-focused product strategy lined up for 2023, you will still need to learn how to work the current global supply chain. \n\nTools that can help: \nEcommerce Booster—Audit all three main areas of page performance:  UX, visual content, and text content. Get an action plan to increase traffic and improve conversions\nShopify Finder—Get insights on 50+ million Shopify products and 100+ million AliExpress products that cover 40+ countries (AliExpress data is available with a Pro plan) \nKeyword Wizard for Amazon—Get access to a huge database of 200+ million keywords and smart filters, and find high-volume/low-competition terms to help you win in Amazon search \nEcommerce Keyword Analytics—Learn the top-performing keywords for major retailers, find keywords that convert, and evaluate product potential \nDataHawk—Access fully customizable KPIs and dashboards that expand your ecommerce reporting and data management/workflows\nSellvia—Gain access to a 250+ million audience of U.S.-based digital buyers; let Sellvia handle storage, delivery, and returns to the U.S.; and discover new business opportunities\nEcomhunt—Get a curation of the best new products every day with detailed analytics on profits, engagement, links, ads, targeting, and price \nKlevu—Uncover shopper intent and help your products get discovered \nTackle Current/Future Supply Chain Issues with Data \n\nIn terms of next year, I think Supply Chain will be a major emphasis for most retailers. 2023 will mark the first year since COVID hit where we will not have a set of YOY sales data skewed by COVID. Retailers should have more accurate data to forecast and plan for inventory so they're not running out or overly stocked of products.\n\n— Colby Almond, Digital Marketing Speaker and Leader with Expertise in Amazon and Ecommerce\n\nGlobal shortages of items like children’s pain relievers, computer chips, garage doors, and even a beloved hot sauce have created a stressed consumer base. \n\nA number of compounding factors caused these shortages, including the novel COVID-19 virus, unemployment, a reduction in raw materials, and global unrest. \n\nUnfortunately, these issues are not projected to improve in 2023. But you don’t have to panic just yet. \n\nKnowledge is power, and with the help of free apps like ImportYeti, you can use competitive market research to source suppliers and keep products on your shelves. Your inventory might not be as robust as it was pre-2020, but you don’t have to live in supply-chain limbo. \n\nImportYeti shows you over 70 million U.S. customs sea shipment records. This is invaluable data on where your competitors get their products shipped from. \n\nLet’s say you run a video game ecommerce business. Your top competitor might be GameStop. If that’s the case, enter “GameStop” into ImportYeti to see what its inventory looks like and where it sources its products. \n\nYou can filter your results by the supplier’s country of origin, the date range of their shipments, the total number of shipments, and even the product descriptions (which also has a keyword search feature so you can really narrow down your research). \n\nNot only that, ImportYeti also provides a matrix of the top relationships your competitors have with suppliers, and what other businesses those suppliers have relationships with. \n\nUsing this information, you can reach out to these suppliers to see if they’d be interested in building a relationship with your business. \n\nKnowing where you can source your products is just one part of competitive research needed to grow your business in 2023. Additionally, competitive analysis should be another focus of your ecommerce strategy this year. \n\nTools that can help: \nImportYeti—Find any company’s suppliers \nVeeqo—Pack and ship your own orders with smart automations and inventory tools \nInventorySource—A wholesale and dropship supplier directory \nSellbrite—A tool to help brands and retailers list and sell their products on online marketplaces \nShoppingfeed—Creates a bespoke, game-plan specific business model to help you achieve your ecommerce goals \nCogsy—Offers total visibility into your retail operations (replenishment needs, incoming orders, promotions, etc.) \nSoStocked by Carbon6—Customizable Amazon inventory management and forecasting software \nDo Competitor Analysis—Small Business Is Booming \n\nTo grow your business on marketplaces, you will need to consider tactics outside of advertising to get a real competitive advantage. Consider programs like editorial recommendations, search ads, social media, and email marketing strategies to expand your reach at a reasonable cost per acquisition.\n\n— Will Haire, CEO & Founder at BellaVix\n\n2022 saw a number of new seller tools and improvements from Amazon. I believe that in order to stay ahead of the competition in 2023, brands will have to stay on top of these tools and become first movers in their categories.\n\n— Colby Almond, Digital Marketing Speaker and Leader with Expertise in Amazon and Ecommerce\n\nInstead of only looking at the direct competitors, look at the indirect or even the market leaders of other segments to understand what works for them. Sometimes, even your competitors might have excellent website traffic but might face conversion issues. So don’t blindly look at the direct competition that you decide on. Look at their approach if it’s as per the consumer perspectives, the market situation, and customer expectations for your industry and decide which competitor to pick up and what level of research can take you closer to your goals.\n\n— Himani Kankaria, Founder at Missive Digital\n\nThe best way to grow your business is to outperform your competitors; be the website or brand your customers think of first when they have a problem. \n\nBut you can’t know if you’re beating the competition without doing extensive competitor analysis and research. \n\nEcommerce business is projected to soar. Online retail sales are expected to exceed $6.5 trillion by 2023. That means competition amongst small ecommerce businesses will likely be fierce over the next 12 months. \n\nWith so many emerging and growing small ecommerce businesses vying for the same customer base, competitor research becomes absolutely vital to the success of your business. \n\nFortunately, several tools and templates are available that make this research a simple, straightforward process. \n\nFirst, make a list of your competitors. You can source this by looking at: \n\nOrganic search results \nPaid search results \nGoogling your niche/industry with the phrase “near me” \n\nOnce you have your list compiled, focus on these top three things: \n\nPrice: What do their products cost? \nProduct: What exactly are they selling? \nAdvertising: How are they reaching their customers? \n\nThen head to your competitors’ websites and take notes on each of these focus points. \n\nYou can keep track of what you find with this handy free template we have created. \n\nWhen looking at the price of your competitors’ products, are they comparable? For example, take a look at these two websites, B&H and Adorama, that sell camera equipment. Both businesses sell a Nikon Z5 camera. \n\nYou’ll notice that both prices are identical, down to the cent. \n\nNow, Nikon might control or set the price for retailers selling their cameras, but Adorama and B&H both offer packages, kits, and bundles that allow them to set unique price points. \n\nThis also benefits customers who need more than just a camera body to get started on their photography hobby. \n\nWhen setting the prices for your own ecommerce business, consider packages and other special offers that will set you apart from your competitors. \n\nThis is especially important if your margins are tight and you don’t have much wiggle room on the base price of your items.\n\nAbove, Adorama has created a Nikon Z5 package that includes an SD card, camera bag, and more, at the same price point that just the Nikon Z5 body sells for on other photography sites. \n\nSo, take note of any promotional packages, bundles, or other specials your competitors are offering. \n\nDiscover Your Market Potential\n\nWith Fernando Angulo, Senior Market Research Manager at Semrush\n\nTo scale your online business, you need to know what’s in your online market and be aware of other companies, products, or services that may threaten your expectations.\n\nWhy do market research?\n\nBrands need real-time information about what’s happening in their industry. And they need to know what position they have in the market, how to expand their share, and what returns they can expect.\n\nHaving data from your industry can help you develop an effective marketing strategy (an example from the Market Explorer tool is featured below). \n\nWhat aspects should be considered during the process?\n\nThe depth of your market research is up to you, but you should consider some key concepts such as:\n\nDigital market share: The place your business occupies compared to the total market \nLevel of competition: The ease of competition in a given market is key to estimating the resources needed\nKey players: The number and size of key players helps you know who you’re competing against and create innovative strategies\nMarket size: It’s not the same to have a potential market of 1,000 people as it is to have a million; the size of the market is key to defining its potential\n\nWhen we focus on the growth of our brand as compared with competitors, such as in the graphic above showing examples of The North Face, Patagonia, and Columbia, we must look at the reasons for such rapid growth and turn to a deeper analysis.\n\nAny tool or strategy designed to analyze large amounts of data in order to produce useful information is simply referred to as an “electronic commerce analysis.” Ecommerce produces complex and complete data sets, particularly those that are related to audience analysis, because it operates in a nearly entirely virtual environment.\n\nEcommerce competitive research evolves to keep pace with customer experiences and track purchases across all touchpoints: mobile, social, web, and retail store. \n\nPaid and Organic Search Analysis of Competitors \n\nDon’t overlook how your competitors are reaching their customers. What is their share of voice? Where do their ads appear in search, and how many high-value keywords are they ranking for in organic search? \n\nThese are all questions you’ll want to ask as you do your analysis. Thankfully, competitor analysis tools can help you do most of the heavy lifting. \n\nFor information on a breakdown of how your competitors get their traffic (paid vs. organic), go to the Benchmarking report in the Market Explorer tool. \n\nTools that can help: \n.Trends—A competitive intelligence solution that is available with paid Semrush subscriptions (includes Traffic Analytics, Market Explorer, and EyeOn) \nEyeOn—Monitor your competitors’ online sales and marketing strategies 24/7 \nAdClarity—Unwrap competitors’ digital ads, ad spend, and impressions \nAudience Intelligence—Discover in-depth consumer segmentation and cultural insights \nKlevu—Uncover shopper intent and help get your products discovered \nKoala Inspector Online ShopSpy app provides real-time tracking of your Shopify competitors, identifies top-performing apps, and offers insights into effective themes, enabling you to make data-driven decisions.\nCommerce Inspector—Free Chrome extension that allows you to track any Shopify store’s product launches, best sellers, traffic, sales, ad campaigns, apps, and more \nMaximize Your Traffic Performance\n\nWith Dan Saunders, Head of Performance Marketing | International Keynote Speaker & Judge\n\nAdobe recently reported that 55 percent of marketers see data-driven marketing as their most important business opportunity, while 42 percent saw improving customer intelligence as a key priority. If your marketing initiatives are backed by data, you’re likely to see a much higher ROI—and there are a few ways you can use it to drive conversions:\n\nKeep customers moving through their buying journey: Is your data showing traffic flowing to your site but only a few are converting? Using data, you can view a user’s journey through your website including where they came from, how they interacted with your site, and where you lost them—all of which can inform future campaigns. CRO techniques can be used to maximize these conversion opportunities and help reduce barriers to conversion by interpreting data to inform onsite improvements.\nRe-engage inactive customers: Many brands believe if they have a great product or service, customer retention will naturally follow. While this may be the case in some instances, it is not an effective long-term strategy. Earning customer loyalty requires an ongoing, consistent effort. Do you have customers that haven’t converted with you in a while? Re-engage them! You’ve already established trust, inspired confidence, and even have data on their previous interactions, making it easier to identify their needs. By re-engaging your customers in a relevant and positive way, you can raise brand awareness and strengthen loyalty.\nIdentify what’s trending: Data allows you to track real-time changes. If you can interpret the trends of your audience before they even begin, you can apply them to your business to create a competitive edge. Combining data from ads, social media, customer habits and even the economy, informed predictions can be made on what your audience might want next. The ability to forecast upcoming behavior allows you to improve business operations, product developments, future-proof technology, and ensure your marketing strategy is always relevant.\n\n— Dan Saunders, Head of Performance Marketing | International Keynote Speaker & Judge\n\nThis report from Market Explorer allows you to generate a list of your competitors and see, side-by-side, just how and from where they get their traffic. At the top of the page (see the blue box in this screenshot) you can filter by channel to see their traffic patterns on a more granular level. \n\nAnother competitor analysis tool you can leverage is the Advertising Research tool. \n\nThe Advertising Research tool allows you to keep tabs on what Adwords your competitors are bidding on. The tool offers tons of data points and filtering. \n\nFor example, you can track Adwords that your competitors have gained and lost over time. Just click on “Position Changes” to get a report detailing their gains and losses. \n\nThis is a fantastic way to assess the paid advertising gap in your industry. Maybe you can pick up Adwords that your competitors have lost and gain new traffic. \n\nWhile paid advertising is essential for both you and your competition, search engine optimization (SEO), at both the local level and beyond, can help you get a better ROI on your marketing efforts. \n\nTools that can help: \nOptiMonk—Create customized pop-ups\nReConvert—A Shopify upselling app to help you sell more and optimize the customer journey \nPickFu—Run polls to get in-depth feedback from real people in minutes \nMailchimp—Bolster your traffic wins by reaching customers/searchers through engaging email marketing \nLimeSpot—Leverage your traffic through AI-driven personalization and customized merchandising solutions \nInvest in Your SEO (Content, Technical, Local) \n\nSEO lends itself very well to ecommerce, especially for sites with a larger inventory, because it’s a scalable, low-cost sales channel.\nIn 2022, Google started to invest heavily in shopping Search and changed the SERP design significantly. Ecommerce webmasters can now impact their product snippets with shipping times, refund policy, and discounts through Google Business—every online store should look at this!\n\n— Kevin Indig, Growth Advisor\n\nToday, most brand awareness occurs on Instagram, Facebook, or TikTok. As per the study by KPMG, two-thirds of consumers plan to reduce their non-essential spending in 2023. So if a consumer needs to buy non-essential things, they would have more layers of research before spending. In that case, being present on search engines become unavoidable. Repurpose the content you create for social media marketing, put it on the website as a blog and video, optimize the site for a powerful user experience, and be present at local events to build the brand’s authority and visibility. Being seen works far better than being virtual.\n\n— Himani Kankaria, Founder at Missive Digital\n\nGreat SEO can help grow your business exponentially. Bad SEO can sink your website to the bottom of the search engine results pages (SERPs). That’s why it is vital to have a multi-prong, careful approach to your website’s SEO. \n\nThis is especially important in the world of ecommerce where sites tend to be large and feature tons of product pages and item listings. Keeping your website tidy and user-friendly will help you maintain your current customer base and grow your following. \n\nNot to mention, the global recession is putting huge pressures on paid channels—CAC continues to rise, straining paid advertising budgets and marketing strategies. \n\nOrganic SEO not only brings the cost of CAC down, it also works well in partnership with your paid ad strategies.\n\nIf you haven’t already begun investing in organic growth, now is the time to get started.\n\nWe have a comprehensive guide to SEO for ecommerce here and some handy tips on building an ecommerce content marketing strategy here. But, just to give you a broad-strokes idea of what this investment will entail, here are some tactics that successful ecommerce websites use: \n\nEliminate website bloat: Consider building content pillars to consolidate information about groups of products you offer. This helps improve the customer experience. For example, if you sell shoes, you might want to create a pillar page around running shoes and another pillar page around sandals.\nMonitor your desktop and mobile performance: According to Outer Box Design, nearly 80 percent of smartphone users will make a purchase from their mobile device in the next six months. Make sure your website performs just as well on mobile as it does on desktop devices. \nCreate unique, compelling, keyword-driven content: This one is a little more nebulous, but as a rule of thumb you want your content to offer something to your customers beyond just a sales pitch. This not only helps you rank better in the search engines but also shows your customers you are an authority in your industry. For example, if you sell cameras, you might want to write articles about how to get started in astrophotography. \nConsider adding schema: This is a big one for ecommerce sites. Schema is a markup language. It exists to help your site stand out in the SERPs. There are different types of schema you can utilize to get traffic to your website. We have a guide that will show you how to start. \nKeep tabs on offline business: Whether or not you run a brick and mortar business in addition to your ecommerce website, you will want to know how your local competitors are appearing in search. If you do have a brick and mortar location, make sure that your local SEO is set up correctly. \n\nThis is by no means an exhaustive list—just small pointers to offer you a little SEO inspiration heading into 2023. SEO has a major influence on ecommerce growth, but there is an emerging trend in the world of marketing: influencer and affiliate marketing. \n\nTools that can help: \nSemrush Local—Rank higher locally by optimizing listings, reviews, maps, etc. \nOn Page SEO Checker—Offers a complete and structured list of things you can do to improve the ranking of pages on your website \nSite Audit—Get a holistic view of how your website is performing and monitor tech SEO errors that can hold your site back (especially important for large ecommerce sites) \nSEO Content Template—Generate actionable briefs for SEO-friendly content \nKeyword Magic Tool—Get millions of keyword suggestions for your SEO strategy \nInfluencer & Affiliate Marketing Are Crucial\n\nModern consumers tend to choose shopping online: 63% of every purchase begins with online shopping. More than 2 billion people are digital buyers—this means that over 27% of the world’s entire population buy things online. And almost all of them have at least one account on a social media platform, following some influencers there, as there already are more than 4.5 billion social media users on the planet. Sounds like a huge audience to reach!\nConsumers trust influencers, their opinions and recommendations. This makes influencers perfect providers for ecommerce brands that wish to win consumers’ hearts and increase sales. Influencer Analytics' global influencer marketing research shows that 92% of consumers trust influencers’ native ads more than traditional advertising. People are more willing to listen to the influencers than brands themselves: the research also shows that 61% of consumers trust influencer recommendations and only 38% trust branded content.\nAll these make influencers one of the most valuable sources of traffic for brands, including ecommerce ones. Marketing experts admit it. Also, the ROI of influencer marketing is reported to be 11 times greater than that of more traditional types like banner advertisement.\nSo it’s no surprise that influencer marketing is becoming more and more popular. Ecommerce brands strive to use the most effective marketing channels, and influencer marketing has already proven to be one of those.\n\n– Pavel Beinia, CEO and founder at Influencer Analytics\n\nInfluencer and affiliate marketing has become huge in the last five or so years. If you haven’t delved into this world, it is a sales tactic that employs the use of popular influencers, third-party sites, and other brands to market your products for you. \n\nA great recent example of influencer marketing that led to increased conversions (in this case downloading an app) was the partnership between Dunkin’ Donuts and influencer Charli D’Amelio. \n\nD’Amelio became very popular on TikTok, and when Dunkin’ Donuts realized there could be a lucrative partnership potential, they created the custom Charli iced coffee drink. \n\nThis influencer partnership resulted in an over 56% percent increase in downloads of the Dunkin’ Donuts app. \n\nThe vast majority of influencer marketing now happens across social media networks like Facebook, Instagram, Twitter, and LinkedIn. \n\nThe benefits of influencer/affiliate marketing are numerous: \n\nAccess to an established, new acquisition channel via the brand or individual you choose to partner with \nPotentially cheap advertisement—sometimes affiliate marketing relies on a quid pro quo system where a brand/influencer will write a review in return for free products or advertising their product/service on your social media accounts \nInfluencers are typically seen as trustworthy by their followers, so no need to spend a ton of money or time building up organic authority through your website \nA network of affiliate partnerships, which opens your business to an evergreen channel of marketing opportunities \n\nIn particular, ecommerce brands can benefit from establishing strong relationships with influencers. Any time you release a new product, you can have a select group of influencers at the ready to test the product and provide an honest review on their social media pages. \n\nIf you’re in the market to build some new influencer connections, try an app like Influencer Analytics to help you: \n\nFind influencers on social media looking to connect with business partners\nMake strategic decisions based on influencers’ metrics\nGet reports on an influencer/affiliate campaign’s performance\nCreate and deploy campaigns with social media influencers\n\nWith the Influencer Analytics app, you can filter influencers by channel or name to get the most relevant results. \n\nTools that can help: \nInfluencer Analytics—Run, monitor, and analyze your influencer marketing campaigns all in one place \nSocial Tracker—Lets you track the social media accounts of your closest competitors and compare their growth and engagement levels to yours \nSocial Analytics—See your internal analytics metrics for your social media channels \nCaptiv8—Find the best content creators to get your message out, execute campaigns, and analyze campaign performance \nReferralCandy—Reward customers for referrals and grow your sales by word-of-mouth marketing \nPlan Seasonal Sales and Promotions Wisely in 2023\n\nPrime Day, Prime Early Access & Turkey Five (Thanksgiving-Cyber Monday) will continue to be the most significant ecommerce sales events of the year. Expect more retailers to jump on the bandwagon and run their version of these sales to entice shoppers. Walmart ran ‘Deals for Days Sale’ and Target ran ‘Target’s Deal Days’ in July during Prime Day.\n\n— Will Haire, CEO & Founder at BellaVix\n\nWhile it would be nice for customers if you could run a sale or big promotion weekly, that’s probably not realistic in 2023. Between supply chain issues, saturated markets, and customers fatigued by gimmicky and aggressive sales tactics, you might not get the response you’re looking for if you advertise a markdown every week. \n\nSo, it’s really important to be thoughtful about the timing around seasonal sales and promotions. \n\nTwo of the biggest sales events of the year are Amazon Prime Days and Black Friday. These events cover only a few days but can have a massive positive impact on your visibility. \n\nAccording to Digital Commerce 360, over 300 million items were sold on Amazon during the 2022 Prime Days event. \n\nConsumers broke records on Black Friday 2022, according to Adobe Analytics, by spending an incredible $9.12 billion on online purchases. \n\nIt’s a safe bet that these two events will be lucrative in 2023 as well. Prepare by planning out now which items you want to advertise and mark down for these events. \n\nAmazon Pricing Trends \n\nAn Amazon Price Study conducted by Semrush came to some very interesting conclusions about what products sold best on/around Black Friday 2022: women’s lingerie and PopSockets for phones. So, you may want to think outside the box about what items you mark down for seasonal promotions. \n\nWhile you should be selective about what types of promotions you run, offering seasonal promotions is prudent, especially if you sell seasonal products. \n\nIf you run a bathing suit company, you’ll likely want to start marketing your new line of suits in the winter because customers in cold climates will love nothing more than thinking about lounging by a pool. Consider offering them a promotion on purchasing multiple suits. \n\nAt the end of the summer season, you can again offer a discount rate on your suits since people will be focused more on buying coats and cold-weather attire. \n\nREI does a fantastic job timing its promotional sales with seasonal changes and upgraded product offerings hitting the marketplace. \n\nWhile it almost always has some sort of promotion on its website (or through its co-op program), not every item is discounted. \n\nFor example, it is not uncommon for REI to promote and slash prices on running shoes mid-winter, or around the first of the year. That’s because many customers will be making resolutions to get fit or spend more time outside. \n\nBy running these well-timed sales events, REI also signals that they know and understand customers’ wants and needs. \n\nAnother way to support your customers through the ecommerce sales process—and by extension, grow your loyal following—is by building a comprehensive resource hub or network to answer customer questions and concerns. \n\nTools that can help: \nKeepa—Easily track Amazon competitor prices \nCogsy—Predictable inventory management for Shopify merchants and Amazon sellers \nPrivy—Grow your email and SMS lists faster, incentivize new customers, interactive spin-to-wins, and more \nOptiMonk—Generate smart welcome popups, conversational popups, lucky wheel popups, and ebook popups \nReConvert—Mmake it easier to optimize your post-purchase journey \nBuild a Responsive Customer Support Network \n\nIt is virtually inevitable when running an ecommerce business that you will encounter customer questions or concerns. Even the most conscientious, thoughtful businesses need to be ready to address these comments. \n\nBuilding or growing a customer support arm of your ecommerce business should absolutely be a top priority in the coming year. \n\nWhile it is great to have foundational solutions like chat support services, a customer care email address, and in some cases a call center, the competition for best customer service is going to be fierce in 2023.\n\nThat’s why some ecommerce businesses have opted to go above and beyond to retain and keep their customers happy. \n\nTake CVS, for example. The large pharmaceutical company also operates an ecommerce site that sells everything from COVID-19 tests to supplements. \n\nRecognizing its own huge product offering and that often these products are in the health and wellness space (which can be confusing to navigate), CVS set up a site full of educational resources. \n\nWithout scrolling far, customers can get support with a number of medication and medical-related questions and concerns. \n\nCVS uses its website to provide multiple touch points for customers who might have questions about a prescription, or who maybe had an issue with a delivery and need to talk with someone about it. \n\nCVS also encourages feedback with a dynamic tab that follows you as you scroll down the page. \n\nIn other words, CVS makes every effort to make it easy for customers to find what they are looking for and to contact a CVS representative should they encounter a problem. \n\nAnother often overlooked aspect of customer relationship management is third-party review sites like Yelp and Google. Customers who cannot easily reach your business might be inclined to vent their frustrations on aggregated review sites like these.\n\nIt is important to have a response strategy in place. Don’t let positive or negative comments languish. If a customer takes the time to leave positive feedback, thank them for doing business with you. \n\nIf a customer has a complaint, regardless of whether or not it is entirely fair to your business, it’s best to remain cordial, non-argumentative, and offer to speak with them via a more private venue to address the issue. \n\nDoing right by your customers helps you retain them (which is cheaper than building new acquisitions), and it is likely to bring better reviews—the digital era’s version of word-of-mouth referrals.\n\nDon’t wait until you are inundated with bad PR to begin building or improving your customer and online reputation strategy. A great time to start is before you have a problem. \n\nTools that can help: \neDesk—An all-in-one help desk for ecommerce businesses; unify queries, orders, and customer info into a single view \nSendinblue—Leverage live chat capabilities and chatbots to help customers solve problems quickly \nGorgias—An ecommerce help desk that centralizes all support tickets into one convenient place \nZendesk—A SaaS that helps you streamline your customer support process and handle tickets more efficiently \nMake 2023 the Best Year Yet for Your Ecommerce Business \n\nThere are many reasons to be excited about the future of ecommerce business in 2023. Hopefully this article has illustrated that you as a marketer or business owner have virtually endless tools, tactics, and strategies at your disposal to make this your most successful year of business yet. \n\nReady to start the year off right? Get free trial access to our suite of Solutions for Ecommerce businesses. Save yourself time and guesswork by letting Semrush’s data-driven apps help you develop a winning strategy that works for your business. \n\nTools that can help:\nThe Apps for Ecommerce Businesses suite ",
  "headers": {
    "h1": "How to Grow Your Ecommerce Business in 2023",
    "h2": [
      "Find Products That Will Sell in 2023 ",
      "Tackle Current/Future Supply Chain Issues with Data ",
      "Do Competitor Analysis—Small Business Is Booming ",
      "Discover Your Market Potential",
      "Paid and Organic Search Analysis of Competitors ",
      "Maximize Your Traffic Performance",
      "Invest in Your SEO (Content, Technical, Local) ",
      "Influencer & Affiliate Marketing Are Crucial",
      "Plan Seasonal Sales and Promotions Wisely in 2023",
      "Build a Responsive Customer Support Network ",
      "Make 2023 the Best Year Yet for Your Ecommerce Business "
    ]
  },
  "images": [
    {
      "src": "https://static.semrush.com/blog/uploads/media/04/0e/040e1deae19084c5e5de7cb7cb04a178/how-to-grow-your-ecom-business-in-2023.svg",
      "alt": "How to Grow Your Ecommerce Business in 2023"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/40/30/403042c8166a6a152831a390e524b2e0/TW-9-Ecommerce-Trends-to-Follow-in-2023.png",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/96/a9/96a9051e72b6861d9a0e949fa4ff58f5/Screen%20Shot%202023-01-04%20at%201.29.34%20PM.png",
      "alt": "A screenshot of the Keyword Magic Tool report shows the broad match search results for the keyword “Camera equipment.” "
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/8c/61/8c61ae2decbb69e3f598df1cdcd49154/Screen%20Shot%202023-01-04%20at%201.52.42%20PM.png",
      "alt": "A screenshot of ImportYeti’s report on Gamestop’s suppliers shows what companies supply their products. "
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/71/29/7129edd72ee0480e41f9e767bec52286/Gamestop%20-%20625%20Westport%20Parkway%20-%20company%20Report%20-%20Import%20Yeti.png",
      "alt": "A screenshot of ImportYeti’s matrix feature shows the top supplier relationships of Gamestop’s competitors. "
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/21/14/211417c341c7a9428fbf7abea0d77593/PhotoFunia-1672863789.jpg",
      "alt": "A screenshot comparison of the Nikon Z5 camera for sale on B&H and Adorama shows that the two websites offer an identical price point for this particular product. "
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/56/30/5630f4a139b47a99edcdb7a1452ef29c/Screen%20Shot%202023-01-04%20at%203.25.48%20PM.png",
      "alt": "A screenshot of Adorama’s website shows that the company has created a unique selling point for the Nikon Z5 camera by bundling it with other products a first time camera user might need—an SD card, camera bag, and PC photo editing software. This package sells for the same price as just the Nikon Z5 body on other websites."
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/4b/4f/4b4fb961c5fb90d0e57c16d048e65ac3/image6.png",
      "alt": "A screenshot of the Market Explorer tool from Semrush shows key competitor demographics—such as market size, traffic, market cost, and key players—for a premium clothing retailer."
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/9f/fb/9ffbd8350f31bc4b62b06f330b88db90/ZtTVXi8uvnyUkSFAsa3dj13zDr3IfMJZEot7Hm2PA2Lq3L_VZK8ETLDYB6OPEyAPRLrNuNZJkgcPixLB2LKHWWVEYZyLAwxeN7OYENyKmhgZf03fRwuCE2PPyyCgIyP7We4-V1oSfR5W2c2QUFamTrM.png",
      "alt": "The Market Explorer tool’s Growth Quadrant feature shows a colorful 4-quadrant graphic of “Game Changers” in the industry—a metric that showcases brands with high growth potential. Some of the featured brands in this example include The North Face, Patagonia, Columbia, and REI."
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/bc/1a/bc1a0a65e1f9bff932ca7a6856938185/image1.png",
      "alt": "The Market Explorer Audience Summary feature shows an example clothing retailer’s market demographics—such as age, sex, socioeconomic factors, and behavior. "
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/44/8d/448d926814aa4f1a648de1d2045ee4d4/adorama.com_%20Benchmarking%2C%20Market%20Explorer.png",
      "alt": "A screenshot of the Market Explorer report shows several graphs with data about traffic distribution, traffic generation strategy, market share by channel, and social media distribution strategy (in addition to other metrics). "
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/4d/12/4d121a9d2c865fddf6f10b6ae9921712/Screen%20Shot%202023-01-04%20at%203.46.40%20PM.png",
      "alt": "The Advertising Research tool has a graphic depicting paid search trends over time (in addition to other metrics). "
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/6d/7c/6d7c1c0451d7863410f23f9bd0b539cd/Screen%20Shot%202023-01-04%20at%203.50.35%20PM.png",
      "alt": "A screenshot of the Advertising Research report also shows a competitor’s new and lost keywords. "
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/0b/fd/0bfdb69dd562f562b4071ab625648085/Charli-1-2000-9d12458c17664bdbb19a16f23e52c235.jpg",
      "alt": "A young woman with long brown hair is pictured wearing a white winter coat and sipping from a large Dunkin’ Donuts iced coffee. "
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/5f/9b/5f9b746a2afd80538b09729e5e407745/fe3dfa5ee70930e9699403a45d78e60c/image.png",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/9d/a4/9da44b3054713e626ce62b4f96b14bbd/Screen%20Shot%202023-01-04%20at%205.11.24%20PM.png",
      "alt": "A screenshot of REI.com shows their current discounts on New Balance sneakers. There is an image of three New Balance sneakers, side-by-side—a red sneaker, a gray sneaker, and a mult-colored black and gray sneaker. "
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/52/65/5265b1c57b0506ef4640e67d19255029/Screen%20Shot%202023-01-04%20at%205.18.29%20PM.png",
      "alt": "CVS.com has a very engaging website design. Here, a screenshot features just a few of the service pages they offer—a chat feature that connects patients with a medical provider, a page on prescription delivery, and a page on shopping for daily vitamins. A woman with curly red hair is pictured wearing a birthday hat, holding a white dog who is also wearing a birthday hat. Confetti is sprinkled throughout the image. There is a feedback button to the right of the screen. "
    },
    {
      "src": "https://static.semrush.com/semblog-next-static/banners/trial-gift.png",
      "alt": "Trial Semrush banner"
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&d=Mon%2C%2021%20Oct%202024%2014%3A25%3A06%20GMT&n=4d&b=How%20To%20Grow%20Ecommerce%20in%202023&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fgrow-ecommerce-business%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&b=How%20To%20Grow%20Ecommerce%20in%202023&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fgrow-ecommerce-business%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://bat.bing.com/action/0?ti=5128787&tm=gtm002&Ver=2&mid=d563a75b-0c58-43a2-8a78-329b5a8e6ec9&bo=1&sid=3d5c62908fb811ef80185dfa74ec9eb6&vid=3d5ce8808fb811ef87cb2fe9471b7ba0&vids=0&msclkid=N&uach=pv%3D10.0.0&pi=0&lg=en-US&sw=1536&sh=864&sc=24&tl=How%20To%20Grow%20Ecommerce%20in%202023&p=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fgrow-ecommerce-business%2F&r=&lt=928&evt=pageLoad&sv=1&cdb=ARoR&rn=796241",
      "alt": ""
    }
  ],
  "publication_date": null
}