{
  "url": "https://www.semrush.com/blog/how-to-use-semrush-keyword-research/",
  "title": "How to Use Semrush for Keyword Research",
  "content": "Keyword research is an integral part of any digital marketing strategy, and its importance will never fade away. Here’s a guide to help out.\n\nThis guide answers the following questions: \n\nWhat is keyword research?\nWhat keyword research terms and metrics do I need to know? \nHow do I find hot topics for content?\nHow do I find the best keywords for organic traffic?\nHow do I find the most cost-effective keywords for a PPC campaign?\nHow do I track my website’s performance for specific keywords?\nWhat are some advanced keyword research tactics?\nHow can I use AI to make the process easier?\n\nGet Started Today\n\nwith a free 7-day trial of Semrush\n\nTry for Free →\nWhat Is Keyword Research?\n\nKeywords are the terms that people enter into search engines to find information. Keyword research is the study of these search terms to find out where the search traffic in your market comes from, and determine which keywords your website can target with marketing.\n\nKeyword research helps you:\n\nUnderstand and reach your audience \nFind new relevant topics to cover on your site\nGet qualified leads \nIncrease sales\nImprove ad campaigns, get clicks and impressions \nBuild awareness of your brand\nWhy You Should Do Keyword Research On a Regular Basis\nKeywords change—there will always be multiple ways to say the same thing and trends often change the queries people search for online. \nYour audience grows and evolves, and the way people use search engines changes. \nSearch engines evolve too; algorithms get more advanced to better understand content and also match users’ intent. \nYou need to keep upgrading your content for it to be relevant.\nKeyword Research Basics\n\nThe Semrush toolkit offers you several ways to gather the best keywords; good basics never fail, and traditional keyword research is where you should start. \n\nSteps to take:\n\nGet a Quick Analysis\nBuild a Main Keyword List\nFind Your Competitive Edge\n\nGet a team account\n\nTo save on Semrush subscription\n\nLearn more →\nKeyword Overview: Get a Quick Analysis\n\nKeyword Overview is the easiest way to get a quick analysis of your keywords. A comprehensive summary of all major keyword metrics — volume, CPC, competition in paid search, top-ranking pages, ad copy, and more. \n\nLaunch the report, enter your keyword in the search field, and start analyzing.\n\nNeed an even more personalized analysis? Use the location filter to select your preferred locale.\n\nThen, the report will automatically update with geo-specific versions of your most important keyword metrics:\n\nAnd you can use it to analyze local search results, to find out what’s ranking at the city level:\n\nTry it for yourself and identify your top local search competitors!\n\nKeyword Magic Tool: Build a Keyword List\n\nKeyword Magic Tool is a powerful solution for in-depth keyword analysis and for building lists. Explore your niche, and find semantically related long-tail keywords broken down into topic-specific subgroups.\n\nStart with a single seed keyword:\n\nHit Search and get to work:\n\nExplore the suggested groups and subgroups of related topics to find niche long-tails and ideas for your PPC ad groups.\n\nSort groups by:\n\n volume \nnumber of keywords\n\nThen, exclude groups that you don’t need with an eye icon. Bear in mind that all advanced filters you have applied will also apply to the list of topics.\n\nPay attention to the Match Modifiers, allowing you to broaden or narrow down the keyword selection to your liking. \n\nMake use of the Questions Filter; this neat feature will sort out question-based keywords. These keywords drive tons of quality traffic and often trigger featured snippets, which can serve as a shortcut to the top of SERP.\n\nUse flexible Advanced filters to further specify the scope of your key phrases with: \n\nthe range of word counts\nsearch volume\nkeyword difficulty\nCPC\ncompetitive density\nthe number of results in SERP\n\nInclude or exclude keywords with broad or exact matches, and pick SERP features to show the words that trigger them (some words can trigger multiple features).\n\nHere’s a quick video walkthrough of how you can use this tool in combination with Topic Research to map out your content strategy to align with search. It’ll cover how to: \n\nSee all of the domains that bid on the given keyword and had a PPC ad over the last 12 months.\nLook at the cross-section to see the paid position in a given month\nSee the amount of ad traffic, ad traffic price, and the total number of ads for a keyword\nKeyword Strategy Builder:  Automatically Cluster Keywords\n\nUse Keyword Strategy Builder to quickly cluster keywords and align them with your content strategy as topics.\n\nMapping out your keyword strategy is important because ranking for relevant keywords leads to ranking for your defining keywords. And that’ll attract your target audience. \n\nKeyword Strategy Builder can do that for you with a click. \n\nHere’s how:  \n\nTake a seed keyword (or keywords). \n\nKeyword Strategy Builder will find hundreds or thousands of related keywords and group them into clusters of similarity. \n\nThen, explore each cluster to build a strong list of pillar topics and supporting topics. \n\nYou can send a cluster of keywords to the SEO Writing Assistant to start writing content or send it off to a writer. \n\nFor more on how to use Keyword Strategy Builder for clustering, read this article.\n\nKeyword Difficulty: Find aCompetitive Edge\n\nAs you probably know, you won’t be able to rank highly for every keyword in your main list right away. You need to choose wisely where to put your efforts first. \n\nHence, the Keyword Difficulty metric.\n\nThis metric index is a percentage (1–100%). The higher it is, the harder it would be to outrank your competitors in organic search results.\n\nKeyword Difficulty will estimate how hard it will be to organically outrank your competitors for a given keyword. You’ll find this metric as a column in nearly every Semrush report listing keywords as KD %.\n\nTo analyze keyword difficulty in bulk, you can enter up to 100 keywords at a time in the Keyword Overview report.\n\nBesides difficulty, this report shows the monthly volume of a keyword, the number of URLs in organic results, and SERP features. You can also see the SERP’s snapshot and the trends of a keyword’s popularity over the previous 12 months.\n\nWith this knowledge, you can locate the best low-competition keywords you can realistically target in organic search and which you shouldn’t waste your SEO resources on, and maybe turn to PPC instead.\n\nFinding keywords with low competition levels takes patience, but it pays off as you will not waste time and energy striving for unrealistic ranking goals.\n\nSemrush Copilot: Collect AI-Powered Keyword Ideas\n\nNow that you have a roadmap of keyword research basics, if you set up a project in Semrush, you can use Semrush Copilot as an overview from your dashboard.\n\nCopilot uses AI to automatically check your website for the newest keyword opportunities and preview what topics you could look into next, all from your Projects page.\n\nKeyword-related insights will include:\n\nNew keyword opportunities\nCompetitor rankings\nDeclined keywords\nKeyword gap\nVisibility drops\n\nTo follow up on these suggestions, all you need to do is click the box and you’ll be directed to the corresponding tools. \n\nRun a Full Keyword Analysis\n\nwith the Keyword Overview Tool\n\nTry for Free →\nCompetitor-Based Keyword Research\n\nCompetitor-based keyword research is another approach; this method uses websites that are already on the SERP as a jumping-off point.\n\nInstead of seed keywords, you gather seed websites to start the research.\n\nSteps to take:\n\nDiscover Your Organic Competitors\nPinpoint Your Rivals in Paid Search\nCompare Keyword Portfolios\nOrganic Research: Discover Your Organic Competitors\n\nWith Organic Research, you can find your organic search competitors, see the keywords they rank for, and examine the recent ups and downs of their pages in search results.\n\nTo start, go to Organic Research, enter your domain in the search bar, select the Competitors tab, and scroll down to the table:\n\nNow you have a list of your competitors; these will serve as your seed domains. The list is sorted by the Competition Level — this metric shows how close of a competitor the website is to the one you have entered; it is based on the total number of keywords the competitor is ranked for and the percentage of keywords they share with the given website. \n\nSort the list of domains by the Competition Level or by the number of Common Keywords. Click the arrow icon to open the website in a new tab, or click the domain name to reassemble the report for it.\n\nHow to Get Your Competitors’ Keywords\n\nNext stop is the Positions report of the Organic Research for your seed domain.\n\nHere you can see all of the keywords that a given domain is ranked for in the top 100 search results. Each keyword a domain ranks for is accompanied by the URL of the corresponding landing page and some metrics to guide your research process.\n\nThe list you will get will probably be too long, so you can add some filtering options by clicking on the Advanced Filters button.\n\nFor example, we can find keywords with KD less than 60 that include the words “cat food.”\n\nTry other filtering options in different combinations to get the most relevant data.\n\nFind Opportunities\n\nThere is an easy way to find potential quick wins — you need to keep an eye on your competitors’ ranking changes.\n\nGo to the Position Changes tab, and take a look at the lists of Lost and Declined keywords.\n\nDeclined — The domain’s positions for these keywords dropped, but it still ranks in the top 100.\n\nLost — The domain is no longer ranking in the top 100 for these keywords.\n\nTry adding different filtering options, and with some luck, you may find keywords to capitalize on. \n\nIf you have projects set up, check out Semrush Copilot on your Projects page for a quick overview of your competitor’s rankings through Organic Research. \n\nCopilot automatically monitors your competitors and reveals opportunities for you by tracking shifts in visibility for both you and your competition. This ensures you'll always have a head start on insights and keyword research.\n\nAdvertising Research: Pinpoint Your Rivals in Paid Search\n\nFinding paid competition for any domain is also a piece of cake with Advertising Research. Your workflow here will be similar to Organic Research.\n\nStart the report, type in your domain, and switch to the Competitors tab.\n\nAt the top of the report, you can see a Competitive Positioning Map. This visualization is based on the domain’s Paid Search Traffic and the Number of Paid Keywords, so it gives a nice overview of a paid search competition landscape.\n\nBelow you will see a table listing Paid Competitors of the analyzed domain.\n\nThe table is by default sorted by the Competition Level in the same manner as in Organic Research, except it uses paid keywords for the calculation.\n\nHere you can easily pick up your seed domains from your top competitors.\n\nClick the arrow icon to open the website in a new tab, or click the domain name to reassemble the report for it.\n\nAnalyze Your Competitors’ Paid Keywords\n\nTo collect and analyze the keywords your competitors are bidding on, go to the Positionsreport of Advertising Research.\n\nTo make the most out of this report, use Advanced filters (e.g., Include Volume Greater than 1000, and Exclude Keywords with your competitor’s brand name.)\n\nTry different filter combinations to narrow down the list, and find low-cost and low-competition keywords for your PPC campaign.\n\nAd History Report: Look at Past PPC Advertisers\n\nThe Ad History report lets you identify advertising trends, and understand if the keyword was previously actively used in paid search.\n\nSee all of the domains that bid on the given keyword and had a PPC ad over the last 12 months.\n\nThe number in the cross-section shows the paid position that the ad occupied in the given month. Note that this position isn’t necessarily the location of the ad on the search results page. Even if you are the highest bidder, your ad can appear under the organic search results.\n\nYou can also see the amount of ad traffic, ad traffic price, and the total number of ads for that keyword.\n\nKeyword Gap: Compare Keyword Portfolios\n\nThe Keyword Gap tool allows you to compare multiple domains’ keyword profiles side by side. It’s a great way to visualize exactly where and how much you’re being outperformed in search rankings. Then, you can drill down on specific opportunities to optimize your site for. \n\nHere’s a quick walkthrough of how it works:\n\nKeywords in Content Marketing\n\nSome might say that content is just a tool of SEO, which is partly true—content marketing and SEO go hand in hand and overlap a lot. The success of each one is in large part, determined by the quality of the other. \n\nSEO can be thought of as technical, while content marketing is broader and more about the messaging. Keyword research for content marketing comes down to finding out what interests your audience and what’s trending.\n\nSo, before learning the nuts and bolts of keyword research for SEO and PPC, let’s start with a more casual approach.\n\nTopic Research\n\nWith the Topic Research tool, you can find hot topics, and generate content ideas and catchy headlines without digging deep into big data.\n\nTopic Research is a simple yet effective tool for generating resonating topics, subtopics, and ideas to include in your content. \n\nJust think of anything you might want to cover on your website and enter it in the search bar.\n\nYou can specify the location down to the city level to target your search for ideas. \n\nFor your convenience, you can switch the view from Cards to:\n\nExplorer—if you prefer working with tables.\nOverview—if you want a condensed version of the report.\nMindmap—if you like a more visual representation of your topic cards. \n\nWhichever view you choose, you will be presented with the top: \n\nHeadlines—The most resonant titles prioritized by the number of backlinks the pages have. \nQuestions—The most common questions people are asking on the topic. Answering these in your content will bring more value to it, and give you a chance to appear in the Featured Snippet on SERP. \nRelated Searches—The terms that are frequently queried along with the analyzed topic in Google search. Use them to understand the user’s intent better and enrich your content accordingly. Click on one to regenerate the Topic Research for it. \n\nAdd Headlines and Questions to the list of Favorite Ideas, and use it to shape up your content plan and create the most engaging pieces.\n\nTracking Keyword Performance \nPosition Tracking\n\nAfter you’ve found the best keywords, bid on the most cost-effective ones and created new content for the low-competition ones, it's time to track how well you’re doing.\n\nTo do this, set up Position Tracking from the Project page. Simply click “Create Project” to get started.\n\nFrom here, enter the URL of the site you want to see keyword rankings for, select the device and location, and add your keywords. \n\nYou can simultaneously target multiple device types and geographic locations, down to ZIP code level, find SERP features opportunities and your local competitors.\n\nFor a quick overview of your Position Tracking activity, you can refer to Copilot on your Projects page. \n\nCopilot automatically tracks changes and informs you of any drops in your visibility or gains in your competitors without navigating to the Position Tracking tool\n\nAdvanced Keyword Research Solutions\n\nSemrush has solutions for both beginner and advanced keyword research workflows. Let’s look at some advanced solutions you can use on Semrush.\n\nFind (Not Provided) Keywords—Organic Traffic Insights\n\nOrganic Traffic Insights will help you analyze your website’s organic search performance by combining your Google Analytics, Google Search Console, and Semrush data within a single dashboard.\n\nThis integration of three data sources ensures that you are getting the most accurate and complete keyword data (including the ‘not-provided’ keywords from Google Analytics).\n\nAnalyze your keywords’ search intent metric\n\nOnce you’ve identified your keywords, you’ll want to take a look at their search intent. In other words: what are users looking for when they type in these terms? The search intent filter helps you identify and bucket your keywords into several categories: \n\nInformational — Searches that look for an answer to a specific question or general information about a topic.\nNavigational — Searches that look for a specific site or page. \nCommercial — Searches investigating a service, product, or specific brand. These keywords are generally used when a searcher has the intention of making a purchase at a future time. \nTransactional — Searches looking to make a purchase or perform or perform some other type of action. \n\nBy knowing the search intent behind all of your keywords, you can create a content strategy that targets searchers at the exact right step of their search or purchase journey. \n\nTake a look at the example below. Here, the search intent filter reveals some very helpful insights about what people are looking for when they search “cat food.” \n\nThe tool has identified “cat food” as a commercial keyword. This means that searchers are looking to explore different cat food brands when they type in “cat food.”\n\nThe keyword “Blue Buffalo cat food” is, on the other hand, transactional. Searchers are likely further along in the purchasing process and would like to buy this specific brand of cat food. \n\nSo, if you’re a retailer that sells cat food and you’re targeting “cat food” keywords, you might want to build out web or blog “cat food” content that explores different types and brands of cat food so that searchers can make an informed decision on their purchase. \n\nInstantly discover your audience's search intent\n\nwith Semrush keyword intent analysis\n\nTry It Free →\nOptimize Your Ad Groups—PPC Keyword Tool\n\nUse the PPC Keyword Tool to organize your target keywords into ad groups and optimized campaigns for Google Ads.\n\nYou will be able to plan out ad groups, automatically generate cross-group negative keywords for your campaign and export the plan to a file for seamless integration with Google Ads.\n\nAnother important feature is its ability to provide keyword CPC and search volume on a local level for a specific city or region.\n\nTrack SERP Changes—Sensor\n\nOur Sensor can measure volatility in search results for your keywords to help you catch up and react to any sudden fluctuations. Whether it is a result of Google’s algorithm or something happening in your industry, you will know first. \n\nKeyword Research Glossary\n\nHere are the keyword research terms you need to know:\n\nAd keyword—The query that triggers paid results.\n\nClick Potential—A metric used to gauge the predicted chance of getting a click through to your website if your search result occupied the top position of the SERP. Click Potential depends on the presence of SERP Features that would hinder searchers from clicking on an organic website results.\n\nCommon Keywords—Keywords for which multiple domains rank among the top Google search results.\n\nCTR (Click-Through-Rate)—The percentage of people who clicked on an ad or a link in search results out of all those who saw it.\n\nCross Group Negatives—A method of optimizing a Google Ads campaign via implementing one ad group’s keywords as another ad group’s negative keywords. This prevents your ads in separate ad groups from competing against each other and harming click-through rate / quality score.\n\nFeatured Snippet—The most prominent SERP feature that appears on top of search results and provides the most relevant answer to a query.\n\nKeyword (search term, query)—A word or phrase used in an online search.\n\nKeyword Cluster — A group of similar keywords based on search intent (what the searcher’s end goal is).\n\nKeyword difficulty (level of competition)—An estimation of how hard it would be to rank high for a keyword in organic search or how pricey it would be to appear in ads. You need to analyze the difficulty level to choose your battles wisely.\n\nLocal Pack—SERP feature that appears for queries with local intent or includes a geographical name (e.g. ‘pizza near me,’ ‘best pizza in Philly’). Semrush Local's Map Rank Tracker is a tool that helps you monitor your ranking in Google Maps. This another at times overlooked part of optimizing your presence locally as a business. \n\nLong tail keyword—A long tail keyword is a search query that falls within the “long tail” of the search demand curve. These are keywords with low monthly search volume, but usually have a more specific searcher intent and a higher probability of conversion through SEO or PPC. You can find long tail keywords in Semrush by using the Keyword Magic Tool and adding filters for number of words, keyword difficulty, volume, and more.\n\nNegative Keywords— Keywords that allow you to choose what not to target with a Google Ads campaign. Just like regular keywords in an ad campaign, negative keywords can be set with match types such as exact match, phrase match, and broad match. When you add a negative keyword to your campaign, your ads will not appear in the search results for that search. This practice helps advertisers save budget and maximize ROI.\n\nPPC (Pay per Click)—An internet advertising model used to bring traffic to the website through the means of paid ads (Google Ads). Choosing the right keywords is essential for the success of a PPC campaign. There are three forms of payment:\n\nCPC (Cost per click)—Advertisers only pay when the ad is clicked.\nCPM(Cost per impressions)—Advertisers pay for the number of times an ad is shown.\nCPA (Cost per acquisition)—Advertisers pay when users have fulfilled the determined objective.\n\nSearch intent—There is a specific intention behind every search query, and competent keyword research should not only answer what people are looking for but also why they do it. Of course, the intent behind a keyword is not always crystal clear, but usually, it falls into one of four distinct categories:\n\nInformational—Searches for the specific information, whether it is a simple answer to a question or detailed coverage of a topic.\n(e.g., ’how to cook eggs for cats’) \nNavigational—These searches aim to locate a specific webpage or site; usually includes the name of a brand, product, or service.\n(e.g., ’facebook’)\nCommercial—This type of query is conducted by people who consider a purchase and want to investigate their options.\n(e.g., ‘best cat toys’) \nTransactional—Searcher is looking to purchase something.\n(e.g., ‘buy cat toys’)\n\nSEO (Search Engine Optimization)—The process of growing a website’s traffic income via the organic search engine results.\n\nSERP (Search Engine Results Page)—The list of web pages provided by a search engine for a query.\n\nSERP feature—An added layer of information or context on top of a regular search engine result. There is a great variety of SERP features, triggered by all kinds of keywords.\n\nVolume—A fundamental keyword metric, it shows the number of searches for a particular keyword in a given timeframe (usually per month). Bear in mind that keyword popularity can be affected by seasonality (e.g., ‘black friday deals’).\n\nWeb traffic—Simply put, this is the flow of visitors coming to your website. The quality and quantity of traffic define the success of a website or a page. There are different ways people can get to the pages of your website, but we will focus on the two main traffic sources that require keyword research:\n\nOrganic search traffic—Visitors who came from an unpaid search engine result; this kind of traffic is crucial for the long-term success of a website. \nPaid traffic—Visitors who came from paid sources (advertising).\n\nRun a Full Keyword Analysis\n\nwith the Keyword Overview Tool\n\nTry for Free →",
  "headers": {
    "h1": "How to Use Semrush for Keyword Research",
    "h2": [
      "What Is Keyword Research?",
      "Why You Should Do Keyword Research On a Regular Basis",
      "Keyword Research Basics",
      "Competitor-Based Keyword Research",
      "Keywords in Content Marketing",
      "Tracking Keyword Performance ",
      "Advanced Keyword Research Solutions"
    ]
  },
  "images": [
    {
      "src": "https://static.semrush.com/blog/uploads/media/d5/dd/d5dd7e6e4377dcf8711abf6af9e5d64f/keywords-research.svg",
      "alt": "How to Use Semrush for Keyword Research"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/5f/92/5f92f635b38af3ca21b2b79736a8f286/DaZnupgzAWMqdr9g2yNbJm1TEdCKYAOqHQxdIKnhS5Z9vc0CNqSyCbxPO0gsXn15O5AwxSoGmydoLoDOeepRA8m4S6qJ-ISSbrLpc9e7Zs5F0-xyTDXIdzm-AvukHoVzYcZZboZkq7P81yqw4zgeSPc.png",
      "alt": "DaZnupgzAWMqdr9g2yNbJm1TEdCKYAOqHQxdIKnhS5Z9vc0CNqSyCbxPO0gsXn15O5AwxSoGmydoLoDOeepRA8m4S6qJ-ISSbrLpc9e7Zs5F0-xyTDXIdzm-AvukHoVzYcZZboZkq7P81yqw4zgeSPc"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/32/35/323521dc29e48b1867ddbe97947bb6b7/collaboration.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/74/c5/74c5add0a1a1174a8df50d3a5dbf8c79/419a72c0918188fe85125bb94671a647/image.png",
      "alt": "keyword overview"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e9/c9/e9c9b547f5c7c6e035596845bbb5b1ef/199a865cddf8e5d97ec94d41aed94197/GXd18aDnO7DkQoUvN4oJv1QAB24PZpxFdw_MGu57faFzKuN8tR0nSz3JpnhbsB_NAMSSiYgzd07tYdIvocxdy3YCkGUjtO31Yvib6a3LxcgjCox7s9UUEhf98DWiFtVKVjNFHP9PvxmarFhctQCN3HQ.png",
      "alt": "GXd18aDnO7DkQoUvN4oJv1QAB24PZpxFdw_MGu57faFzKuN8tR0nSz3JpnhbsB_NAMSSiYgzd07tYdIvocxdy3YCkGUjtO31Yvib6a3LxcgjCox7s9UUEhf98DWiFtVKVjNFHP9PvxmarFhctQCN3HQ"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ac/1c/ac1c81b0500a232fb4446bdcb393409a/10ebe32daa2808c46d317b44f98c4e78/7hHU2F_e2MbTUTJOKWGHH98KOQZu9HaAehBz_u87lARhfUxW99DtA2rOGq7FeicJTws6cNynoBqgn6G-RuTiuJGVFB3cZ9Mb7ARcHxAWQw_5rwc16p58YZqxHBUmoeoKkJCPsvr4vtTqEPZM6s2UgZs.png",
      "alt": "7hHU2F_e2MbTUTJOKWGHH98KOQZu9HaAehBz_u87lARhfUxW99DtA2rOGq7FeicJTws6cNynoBqgn6G-RuTiuJGVFB3cZ9Mb7ARcHxAWQw_5rwc16p58YZqxHBUmoeoKkJCPsvr4vtTqEPZM6s2UgZs"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/5e/f8/5ef8aa5f203509565a622b0a985b476d/17418a6c375aaf8faaa7ea1fc3f48401/XD8kWmSJAos-JkkpHzhqgTaXVDtx_G7NguqGzQUIAN6-iAhSJGOVqLt1ZpOIDBC-oRbKiLur-BfShuMfKdD9qU-e2PY2Ec_3iz1m97AkokfLKfAtI2XeQoTEBlqm1aX0d9GorHlNdwDWBsSgZirIcDU.png",
      "alt": "XD8kWmSJAos-JkkpHzhqgTaXVDtx_G7NguqGzQUIAN6-iAhSJGOVqLt1ZpOIDBC-oRbKiLur-BfShuMfKdD9qU-e2PY2Ec_3iz1m97AkokfLKfAtI2XeQoTEBlqm1aX0d9GorHlNdwDWBsSgZirIcDU"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e2/e0/e2e01c62d0f3cdae99ed272e739e8f67/BZVM4gEbrx-UQQQPpqfohZSK7xYETfQTAz9uhQNoODsWS_u4VKRlorHNVd2bxpkZ8f51WlCzsRAyoboo8B7tnls8__5DajEy7dceEK_sX6OZzvYW1mfncqDyjxFRCpwbS_pIK4aO427QjOgvJugvBUc.png",
      "alt": "BZVM4gEbrx-UQQQPpqfohZSK7xYETfQTAz9uhQNoODsWS_u4VKRlorHNVd2bxpkZ8f51WlCzsRAyoboo8B7tnls8__5DajEy7dceEK_sX6OZzvYW1mfncqDyjxFRCpwbS_pIK4aO427QjOgvJugvBUc"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/3f/51/3f51d0dc15cee03355f005c6c5b19b92/08d8c821fa1a92a920e6431ff669a41b/image.png",
      "alt": "keyword magic tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/c7/73/c77379b32857a79c31eedaaeb89c591a/7hP9-tyE-KDX-d79Lyed5nugDKeUV7eV4Ao7BUobG6XuXGI19nJau_IWjn_tOKOjp7q0UQCp8c4to32p2YJJyHcbjxIQqXRNqluRaktjZel35XIbgStgNHGccMEpPcNkwj9Q5g0dAPuY-QSyyvjnlbs.png",
      "alt": "7hP9-tyE-KDX-d79Lyed5nugDKeUV7eV4Ao7BUobG6XuXGI19nJau_IWjn_tOKOjp7q0UQCp8c4to32p2YJJyHcbjxIQqXRNqluRaktjZel35XIbgStgNHGccMEpPcNkwj9Q5g0dAPuY-QSyyvjnlbs"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e1/ef/e1ef7e2899b11a69a264921547b9a709/A6hcq8PvtP9zWWeJelk1VyIcld5vhvfl1Xn8jaj4yJyTQGAMJyviMw1giCHXvh4755zWhuTE_Ko56JqxxJlwxG-7pP07VPgNt8-_ahoDYgUBaW1FYHkBiE2cAjHjusEGHx-BYabVhFHzgCR7MIbBvhk.png",
      "alt": "A6hcq8PvtP9zWWeJelk1VyIcld5vhvfl1Xn8jaj4yJyTQGAMJyviMw1giCHXvh4755zWhuTE_Ko56JqxxJlwxG-7pP07VPgNt8-_ahoDYgUBaW1FYHkBiE2cAjHjusEGHx-BYabVhFHzgCR7MIbBvhk"
    },
    {
      "src": "https://i.ytimg.com/vi/1Ol7UMxo2zY/hq720.jpg",
      "alt": "Youtube video thumbnail"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/af/d2/afd2cff47ee085cb5636d1e7d7b41226/1d635b19a79a386247538fce24a63e50/image.png",
      "alt": "list of seed words"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/18/ac/18ac69c6a33c338ad2082ba0ee028781/9486d1dd149ddd7efeb16201dcb4cfb7/image.png",
      "alt": "topics and pages"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/04/b4/04b43c7d4833041727d049a3cc6fcdd6/c6d42a2e1d12621a7de1a657e7d771ca/image.png",
      "alt": "keyword overview list"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ee/1f/ee1f89e3c06b5930f81753959c1efb97/8Q5-OT6BLpJdvTvs5LpgvDx3DcRfS10Lxi_o-ekA3QFmMNQEaRkzbBr3H3pd5a-EvDjGdoIR6NSMWQ187b5Jocz80MrPM6lorQ30ZNBXiT-I7Oxz-dy6e_OlVFkjgY0Qb-cgkcyZ8GY3zJ5QOYpoZTY.png",
      "alt": "8Q5-OT6BLpJdvTvs5LpgvDx3DcRfS10Lxi_o-ekA3QFmMNQEaRkzbBr3H3pd5a-EvDjGdoIR6NSMWQ187b5Jocz80MrPM6lorQ30ZNBXiT-I7Oxz-dy6e_OlVFkjgY0Qb-cgkcyZ8GY3zJ5QOYpoZTY"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/41/81/4181842e911a7698d014941eee6bc3c1/f7b2fe1953ca19f14a0ecc5dbb2624a6/3NYey0l5kJtnTmk-CxeoVWsUFdbSKE3Y3qw6EWkVxG-6PdjLI9fpqe_z7nSankDY2xaGyLquaG9iR8heWPy86mLFYZzmjlKNOCCXeymiblc5n_i2qbVsUMSOMoDQgkPXgwKLnoEmX8OpQt210ZH-0TQ.png",
      "alt": "3NYey0l5kJtnTmk-CxeoVWsUFdbSKE3Y3qw6EWkVxG-6PdjLI9fpqe_z7nSankDY2xaGyLquaG9iR8heWPy86mLFYZzmjlKNOCCXeymiblc5n_i2qbVsUMSOMoDQgkPXgwKLnoEmX8OpQt210ZH-0TQ"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/f8/77/f877016ea048a84ccce9d07a641e7745/i3DV7tfiaCCkgo3F9GtGOrZsqARyG6Yc9T7p9_P2ane6v4Gct0Lr1yXmyGfgTbukd00qXrfgrx1GkHWuc6NLkkibn_YSwOnTxMIPPwDK9FHp5JBoJwIAYDTa25pLbTgw0H8WgyA_p65cjCTIsTX_IW0.png",
      "alt": "i3DV7tfiaCCkgo3F9GtGOrZsqARyG6Yc9T7p9_P2ane6v4Gct0Lr1yXmyGfgTbukd00qXrfgrx1GkHWuc6NLkkibn_YSwOnTxMIPPwDK9FHp5JBoJwIAYDTa25pLbTgw0H8WgyA_p65cjCTIsTX_IW0"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/70/d1/70d135965d8537db6b612001ab6be2cb/FtK6pe1gM6r0gtAmE_vJ_BFm_qf33Fh3M7yzUWW-VPD1Qau4HoxKWhYLedMdp0rhqDlHmHIVNZBj6Vpf8wktPO0o94xZfwXkNH2Rs8CU6ZxeFyO1M32K5rqPULo4ZkvnptYMQ1XEy0NYL-17afJkU_0.png",
      "alt": "FtK6pe1gM6r0gtAmE_vJ_BFm_qf33Fh3M7yzUWW-VPD1Qau4HoxKWhYLedMdp0rhqDlHmHIVNZBj6Vpf8wktPO0o94xZfwXkNH2Rs8CU6ZxeFyO1M32K5rqPULo4ZkvnptYMQ1XEy0NYL-17afJkU_0"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e5/52/e55244eb5d2bf5406358b13bbf57f56d/H4uRL8_y9_Q9sa951SGonW0Tsb4RZ5TBeE_DMFrD6evjZyQjojnItbZ4d0a7tsUsfJG8K7Z_44hIXAKrpyIIrcWUxVF_XdIx8y5cVXSQXRsZgePbBFJASiMI-HDC_jepsUoiI1YOUbqqR5PxSKGweiM.png",
      "alt": "H4uRL8_y9_Q9sa951SGonW0Tsb4RZ5TBeE_DMFrD6evjZyQjojnItbZ4d0a7tsUsfJG8K7Z_44hIXAKrpyIIrcWUxVF_XdIx8y5cVXSQXRsZgePbBFJASiMI-HDC_jepsUoiI1YOUbqqR5PxSKGweiM"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/30/93/3093299c883e728a535a105940822358/8ff1bcc646d4481be2b11ceb703ffc96/Pw4pihca4HHaiHynmz549CeSw9reQYHgQpuZHOV_Syi2Ly1Ikx0A_SzN63Z0AkOLe69o6m8ajGiNE5y6OAr0G1sS0laPF6K5wNupDfdavxvrAy55w9qVlBzg6XhaZX0plfaZZUyYiMTNiFTV7BVDQzs.png",
      "alt": "Pw4pihca4HHaiHynmz549CeSw9reQYHgQpuZHOV_Syi2Ly1Ikx0A_SzN63Z0AkOLe69o6m8ajGiNE5y6OAr0G1sS0laPF6K5wNupDfdavxvrAy55w9qVlBzg6XhaZX0plfaZZUyYiMTNiFTV7BVDQzs"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/21/6a/216a54dc427bc2a1d7801abecfac6b6d/gyflVFN3_t14mlYEeCiHJ2qUlwjAImzM4yATVUrnH_NY8qwp9RT3lG1x96p3QS61ZKsWS8dP4GFjLp17ob2QX7Xk_2KHTZ5hEZH9_Bc4QJNb__63LsSp2AJTwpfzeWroFnpRav2OBPftQzhh0CEgtKw.png",
      "alt": "gyflVFN3_t14mlYEeCiHJ2qUlwjAImzM4yATVUrnH_NY8qwp9RT3lG1x96p3QS61ZKsWS8dP4GFjLp17ob2QX7Xk_2KHTZ5hEZH9_Bc4QJNb__63LsSp2AJTwpfzeWroFnpRav2OBPftQzhh0CEgtKw"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/d2/b2/d2b2e38a05aa491187dd801be4fe929b/mbiKGo5uH5Zc6bj5JoDCeRuvUlgtpciMQTzXWyduy_VhAqYsLpeU1gA-5KCyKVTsg3i5RlwPTriz_kENgyccIrP0VbZRy5v2ORBMYEV4EEYn-Vo3NeArWrfO5G0U8lECgTRAZVK4xH_FdndjIT-fbNg.png",
      "alt": "mbiKGo5uH5Zc6bj5JoDCeRuvUlgtpciMQTzXWyduy_VhAqYsLpeU1gA-5KCyKVTsg3i5RlwPTriz_kENgyccIrP0VbZRy5v2ORBMYEV4EEYn-Vo3NeArWrfO5G0U8lECgTRAZVK4xH_FdndjIT-fbNg"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/f8/aa/f8aa2c8f1acf80b4c24bb751d3654a35/-XeIIYEcEozuaRtWLc8V6IKzi_vr55v070jK2oTkgkyLr1tCPOZ4GwSWETvfwm3NGhAhtXUa2oJx_RwLOyS4FJ9O81b3CfuYex5oiark_FhgWCGRuf4B96eSI7MfW_j63P8BkeIGL-BcPnTUqqizazA.png",
      "alt": "-XeIIYEcEozuaRtWLc8V6IKzi_vr55v070jK2oTkgkyLr1tCPOZ4GwSWETvfwm3NGhAhtXUa2oJx_RwLOyS4FJ9O81b3CfuYex5oiark_FhgWCGRuf4B96eSI7MfW_j63P8BkeIGL-BcPnTUqqizazA"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/73/cf/73cfdd278567ac7573f78d9ddb02cf2d/YuVSjgRDTPIfVlBNz21KKzt8sJSMWXpuMFS2Y_BLQf1M3NkUsVtvN6-CSdsqx0nwXFZJGtZxbWUBIg8K35LtE2lrNP1YmUnne8UiZd6QrfTO3kVCayhmGP-Y0cq2WQl33zgggiD4RNp83LEqL-r_ELo.png",
      "alt": "YuVSjgRDTPIfVlBNz21KKzt8sJSMWXpuMFS2Y_BLQf1M3NkUsVtvN6-CSdsqx0nwXFZJGtZxbWUBIg8K35LtE2lrNP1YmUnne8UiZd6QrfTO3kVCayhmGP-Y0cq2WQl33zgggiD4RNp83LEqL-r_ELo"
    },
    {
      "src": "https://i.ytimg.com/vi/2fVtjfPHqTk/hq720.jpg",
      "alt": "Youtube video thumbnail"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/52/f4/52f44f6dde1346ca09d6252484020e4e/KTKYUiPsCLOHvytRENVGMR7RzuKzLP6O8MY9V6LmoTPX4_m6x_nWZhymi-FkorvzoR860osONls3Y7tQxYO7xtYoGyFm51kFIJXXp-LCQLm2bW_TiD_1uT8lkMNBEJWg8puShm-6DGcsgmS2gUInkdE.png",
      "alt": "KTKYUiPsCLOHvytRENVGMR7RzuKzLP6O8MY9V6LmoTPX4_m6x_nWZhymi-FkorvzoR860osONls3Y7tQxYO7xtYoGyFm51kFIJXXp-LCQLm2bW_TiD_1uT8lkMNBEJWg8puShm-6DGcsgmS2gUInkdE"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/9e/00/9e00f970b8863f4dfef3626ea5c5ed1d/nVt00DX1QZ9_Ym7u9aTMXPchE7EUiaxnUwaDyjB313hJB3w95Y8rEnGZeb4VSeODFBCvUkCkgUM97eeHBrb5JRI9hbkTXkCnyV4Mvi-GCW5V0GNW9sOeTQXEuVY0jFcB0JJbNjFgGxRGiDlSHT6Wdp4.png",
      "alt": "nVt00DX1QZ9_Ym7u9aTMXPchE7EUiaxnUwaDyjB313hJB3w95Y8rEnGZeb4VSeODFBCvUkCkgUM97eeHBrb5JRI9hbkTXkCnyV4Mvi-GCW5V0GNW9sOeTQXEuVY0jFcB0JJbNjFgGxRGiDlSHT6Wdp4"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/37/39/3739be2d2480ac6daa97056be5fbe193/KcVlYLFXQUD41K_GEau4o1NO4gfK-t_RrLucAOdcwWzrYuAvRn7bL9Pqlt3UZPzQzmha8ejCZJGq1852Lz1Dms7Nrs2TIcb2-0HOjx0UFADmxF_Y3HaI_C4OEsM-pyY8uikvFF26YKDcbu7KcOcglvg.png",
      "alt": "KcVlYLFXQUD41K_GEau4o1NO4gfK-t_RrLucAOdcwWzrYuAvRn7bL9Pqlt3UZPzQzmha8ejCZJGq1852Lz1Dms7Nrs2TIcb2-0HOjx0UFADmxF_Y3HaI_C4OEsM-pyY8uikvFF26YKDcbu7KcOcglvg"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/52/97/5297f1ad254d2729626a3fda99bdde5c/ce05ed8354f309844451f7477161e07e/xAnzpK5CE80yU5VwvRnS-OoBjBaWkoO6KX3AjwA3n2MacXGwfUAQ0uxugeecuDXeM7PSzWAYjCfqqlAI7IP2kwZ4xlOXC5CUOMfCKBEoLmEOXip3RWXmoiGeWocrKpbBbHgke2M0E987ihs5-teIQw0.png",
      "alt": "xAnzpK5CE80yU5VwvRnS-OoBjBaWkoO6KX3AjwA3n2MacXGwfUAQ0uxugeecuDXeM7PSzWAYjCfqqlAI7IP2kwZ4xlOXC5CUOMfCKBEoLmEOXip3RWXmoiGeWocrKpbBbHgke2M0E987ihs5-teIQw0"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/68/d1/68d157b544d3bc97d523b3e967604885/jGi3KjkL2DrYMhOIGtuM5ues6GZNbT4_QePikw3T4HKA881JqYEfTa6io8HDSVp2Hfqg0HUhPjJQ_vV9dXWvSnHXw562c4jRebplM0syyRq2QXpkWnIHzhMl30ToRtLTuUTzy11LZmrSBeKUiuf2ksU.png",
      "alt": "jGi3KjkL2DrYMhOIGtuM5ues6GZNbT4_QePikw3T4HKA881JqYEfTa6io8HDSVp2Hfqg0HUhPjJQ_vV9dXWvSnHXw562c4jRebplM0syyRq2QXpkWnIHzhMl30ToRtLTuUTzy11LZmrSBeKUiuf2ksU"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/de/3c/de3cef1272d847ab02fc6c050227fb47/MtpnGT8xucephOj-pE7VCTjWaBWh91sZz1-MKZ-H5nr6FmB6hbRmpJm780JmuuGBw9QO7YmtuFXuMusCCkek-8BbOOLh4UJGqplArV7ooJyejq-LH2GmRNJKlZcMgyF5SIZrMAVp-cgx70hmMSpLFPs.png",
      "alt": "MtpnGT8xucephOj-pE7VCTjWaBWh91sZz1-MKZ-H5nr6FmB6hbRmpJm780JmuuGBw9QO7YmtuFXuMusCCkek-8BbOOLh4UJGqplArV7ooJyejq-LH2GmRNJKlZcMgyF5SIZrMAVp-cgx70hmMSpLFPs"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/5e/b9/5eb9132a1bb2128a10cfe918dc13f9ec/qT0_Ig6nn07Sch42Z1F1BMEuFYSTfaFcxJUkR-mn1yF0oyMY0T-nT-pU3oD409dX9EEIrr5FqwqhyRhwzL8H79cEKTAE8SvUFSxRPrONt2KSVsYyxDVnLA3TP8Cd677TI-74bzbscI4UjUp2bN2OLz0.png",
      "alt": "OrbuYwo49JWKm-vgdfBG_eSvdRkjvitipiONWXKuzohTAmfLODXrnfnin6QTag_K1J99lgA9gyw_HIXqfZ_7EhEY43yU-S_AKh1FSujOCGtHIBOJuo9Dy8s08eZYAGtuLEiyimkO"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/2b/12/2b1201559f907893c37c8f3896b2cf3b/2analyze-search-intent-instantly.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/eb/4d/eb4d885e261a73fe613ecdf515126128/Phx8rPE9lQPbhKzcr-XyIWkBQDN84PDw6y5y6Oo-iE03-RMTCunD5ys7Vq45boGWmaFjS1d7Bi2i697c8QlRbExAHOQetZPY7NaAFg-yAVvcf9rSX2rUbWRebZYyAQ25tOBVzq-1qYBoXVfaJ3hYFE4.png",
      "alt": "Phx8rPE9lQPbhKzcr-XyIWkBQDN84PDw6y5y6Oo-iE03-RMTCunD5ys7Vq45boGWmaFjS1d7Bi2i697c8QlRbExAHOQetZPY7NaAFg-yAVvcf9rSX2rUbWRebZYyAQ25tOBVzq-1qYBoXVfaJ3hYFE4"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&d=Mon%2C%2021%20Oct%202024%2014%3A11%3A15%20GMT&n=4d&b=How%20to%20Use%20Semrush%20for%20Keyword%20Research&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fhow-to-use-semrush-keyword-research%2F&enc=UTF-8&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&b=How%20to%20Use%20Semrush%20for%20Keyword%20Research&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fhow-to-use-semrush-keyword-research%2F&enc=UTF-8&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://bat.bing.com/action/0?ti=5128787&tm=gtm002&Ver=2&mid=51dcce85-2bb2-4e4a-a16b-a83951ba98ab&bo=1&sid=4e5ad9508fb611ef9ac2017867259182&vid=4e5b34e08fb611ef8a9f33cf84103a6e&vids=0&msclkid=N&uach=pv%3D3.0.0&pi=0&lg=en-US&sw=1280&sh=720&sc=24&tl=How%20to%20Use%20Semrush%20for%20Keyword%20Research&p=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fhow-to-use-semrush-keyword-research%2F&r=&lt=1096&mtp=10&evt=pageLoad&sv=1&cdb=ARoR&rn=769502",
      "alt": ""
    }
  ],
  "publication_date": null
}