{
  "url": "https://www.semrush.com/blog/how-to-write-brief/",
  "title": "How to Write a Brief: Complete Guide + Free Template",
  "content": "A good brief is the starting point of a new project, outlining key elements for stakeholders and teams. Its goal is to help everyone involved understand what's needed and why. \n\nBut there’s a fine line between providing enough information to encourage creativity and bogging a team down in details that restrict their freedom.\n\nA well-planned brief saves time because there will be less back-and-forth between you and the agency or team completing the project. It also documents roles and responsibilities, which clarifies accountability for the deliverable. \n\nA brief can include high-level details on: \n\nCompany history\nProject goals\nTarget audience\nBrand positioning\nCreative requirements\nKey messaging and assets (e.g., tone of voice guidelines, logo usage, image formats, etc.)\nDeliverables (e.g., ad campaign, ebook, video, webinar, etc.)\nExpectations (i.e., who is accountable for different parts of a project)\n\nA brief should help teams complete work efficiently and deliver the expected results. Without overwhelming them with details.\n\nIn this post, you’ll learn how to write a brief that’s clear and complete. We’ll also cover real-world examples and give you a free creative brief template.\n\nFree Creative Brief Template\n\nA brief template can help you organize your thoughts and outline project requirements. Putting the details in writing ensures your team has all the data they need to do their best work.\n\nDownload our free template here to create an easy-to-read brief based on the essential elements we discuss below. Fill it out as you read.\n\nTypes of Briefs\n\nIn a marketing, design, or advertising context, there are two types of briefs: \n\nProject brief. An overview of the key technical elements of a project, such as deliverables, audience, and timeline\nCreative brief. Specific details to guide creative work (like an ad campaign or other marketing or design projects) including challenges, audience, messaging and tone, and formatting\n\nIf you’re managing a project with creative work, you’ll likely need to create both types of briefs. \n\nFor example, if you’re creating an app for your business, a project brief will outline the project in broad strokes: \n\nDescription of the app\nOverview of the organization\nProject goals (e.g., to improve the shopping experience to increase sales)\nTarget audience\nProject timeline and key milestones\n\nA creative brief provides direction on the creative aspects of the project. An advertising campaign to promote the app, for instance, will need a creative brief to help teams create ads that grab attention. \n\nProject Brief vs. Project Plan\n\nA brief is essentially a shorter version of a project plan. A project plan is a formal document that details the following in depth:\n\nProject goals\nProject phases\nActivities and tasks in each phase\nBudget\nStakeholders and team roles\nStart and end dates\nDeliverables\nMilestones\n\nA project brief condenses the essential information from your project plan into one or two pages so key stakeholders and team members can quickly understand what’s required. \n\n10 Essential Elements of a Great Brief\n\nThough each brief is unique in purpose, all should have the same types of basic information to inform the final product. \n\nFor the purposes of this article, we’ll focus on how to write a creative brief. But regardless of type, all briefs should include the following 10 foundational elements:\n\n1. Project Name\n\nEvery project needs a title. The name keeps everything organized and eliminates confusion when talking about the project. \n\nSo, create a name that’s simple and clear. \n\nThis brief from Pantone, for example, named its project after the creative challenge they were running: \n\n“Reimagine Your Hometown Through the Language of Colour.”\n\n2. Background Information\n\nThe company background section introduces the brand and focuses on key features or benefits that relate to the project. \n\nFor example, here’s how AmazonFresh describes its service in a brief outlining how they’d create a new brand identity: \n\nThis introductory paragraph avoids a general history and instead focuses on what sets their brand apart.\n\nAnd the bullet points help readers easily process important details that are relevant to the work.\n\nFrom this, teams understand who they’re working for and why. \n\nBackground details might seem obvious for in-house projects, but don’t discount the power of including thorough background information. Providing this information to internal teams helps them maintain focus. \n\nIt also helps new hires or freelancers get up to speed without needing a detailed brand history. \n\n3. Project or Content Goal\n\nProject goals drive the brief. They set out exactly what the client wants to achieve. \n\nTake this sample PayPal brief, created and shared by Maggie Wang and Alan Arguelles. It sums up the goal of the company. But then adds a specific project goal in a single line: \n\n“Clarify the misconceptions surrounding the brand and reiterate what PayPal is all about: A virtual wallet where the user’s in control.”\n\nThe task is clear and helps content creators know exactly what they have to do (clarify misconceptions and reiterate the core purpose of the product). It also includes the central message content needs to get across with a clear callout (“Receive money whenever, wherever).\n\nFor external teams, it’s helpful to pair a goal with a problem or desire. This gives a team context for why they’re doing the work. \n\nThe following Netflix brief, shared by designer Laura Ferrari, does this by linking the purpose of its project to key challenges: \n\nThe company could have used this brief to plan a pandemic-era media strategy. The strategy would be targeted at gaining more subscribers, keeping existing customers, and increasing brand awareness. \n\nThe goal of the communication was to address these particular challenges by promoting exclusive content, showing how staying home to watch Netflix could stop the spread of COVID-19, and launching new plans. \n\nYour brief might have one goal or several. But each should tie in with an opportunity or challenge you’re facing.\n\n4. Target Audience\n\nA project can only be successful if it grabs attention and encourages action from the right audience. \n\nIn a brief, a target audience section lets teams know who they need to appeal to. Information is based on your buyer personas or key audience demographics (i.e., the group of people your product or services are aimed at).\nYou can often narrow down your target audience using the data you have on your customers in analytics platforms or your customer relationship management (CRM) software. \n\nDefining your audience in the brief ensures work is based around what you know your audience likes, rather than what you guess they might like. \n\nFor example, the Netflix sample brief uses demographics to help creative teams visualize the audience: \n\nAnd this brief from Burger King includes behavioral traits to give creatives a picture of who they need to win over: \n\nThe more specific the target audience details, the better chance your campaign has of cutting through the noise and grabbing the right people’s attention. \n\n5. Key Messaging and Tone of Voice\n\nMessaging establishes the personality and attitude you want to portray. And how you want your audience to react. \n\nIt covers what people should:\n\nThink\nFeel\nWant\nDo\n\nTake this mock-up brief for Gray’s Cookies prepared by Graham Robertson, which centers its message on the brand’s “guilt-free” positioning: \n\nIn the brief scenario, Gray’s wants to tempt consumers into trying its cookies. And it plans to do that by telling consumers that Gray’s allows them to “do what they want” and “stop feeling guilty” about eating a cookie. \n\nThe ad campaign doesn’t need to repeat this message verbatim. But it should convey to users that they don’t need to feel guilty about eating cookies in the brand’s tone of voice:\n\n“A safe choice, honest and down-to-earth.”\n\nInformation about desired messaging and tone is crucial if you’re planning to give your brief to an external team. According to one study about outsourced content writing, companies that outsource their content creation cite lack of understanding of brand voice or business values as the biggest bottleneck to a successful deliverable.\n\nIf you have brand guidelines or successful examples of your message and tone from previous campaigns, link to them in your brief. \n\nThe more reference material a creative team has, the easier it is for them to replicate your message. \n\nFor written content, your brief should also include keywords or phrases you want in the final copy. \n\nIf you’re unsure what words people are using to find your brand, Semrush’s keyword tools can help.\n\nLearn how in our guide to using Semrush for keyword research. \n\n6. Competitor Analysis\n\nInclude information about your closest competitors in your brief.\nIn her brief template, copywriter Caroline Gibson asks clients two important questions: \n\nWho are your competitors?\nWhat makes you unique or different from them?\n\nWith this information, she’s able to: \n\nUnderstand how other brands approach the same problem\nCome up with ideas to differentiate the client’s copy\nSteer the direction of the project\n\nKnowing what others are doing puts you in a position of power. It helps you improve on what they do well and highlight what you do better.\n\nYour competitor analysis doesn’t need to be too in-depth. Stick to the following:\n\nA list of three or four names\nLinks to websites or marketing assets (e.g., blogs, social media profiles, landing pages, etc.)\nThings you have in common\nQualities that make you stand out\n\nPro Tip: Semrush can make your competitor analysis easier with Market Explorer.\n\n7. Project Deliverables\n\nYour brief should detail what assets will be produced—including specifications like format, sizing, etc. For example, if the brief is to design a new brand logo, the deliverable asset would be the actual logo. \n\nBe clear on rules and formats to ensure the final deliverables fit with your branding and internal style guides. \n\nThis brief for a Holiday Inn campaign, for instance, includes details on accepted image formats: \n\nThe specific list of format types eliminates confusion and keeps work consistent. It also ensures delivered work maintains the style the client’s audience is familiar with. \n\n8. Stakeholder Details\n\nCreative projects are often collaborative efforts. Several individuals may be working on different things at the same time. \n\nFor example, a website redesign will involve designers, developers, and marketers. \n\nIdentifying stakeholders ensures each team member knows their role and responsibilities. It also lets people know who to contact to discuss specific aspects of the project. \n\nList each department and team member involved in the work. For instance:\n\nProject Manager: Kate\nDesign team: Paul (web design), Jen (development)\nCopywriter: Stephen\nMarketing team: Ed (marketing manager), Joe (SEO), Steph (email marketing campaign)\n9. Project Deadlines and Milestones\n\nList all deadlines with specific dates so individuals can plan accordingly and keep the project running smoothly. \n\nDeadlines often depend on a series of milestones. Break these down into the most basic tasks to keep everything on track. For instance, blog content needs to be written, edited, and proofread before it can be published, so add each task to the timeline.\n\nThis design brief example from Slider Revolution features a timeline for each part of the project:\n\nThe specific dates give the design team clarity. They know what they have to do and how long they have to complete each task.\n\n10. Distribution Details\n\nFor creative assets, include details about how completed work will be distributed (e.g., through Facebook, Google Ads, email, etc.). \n\nWhile it’s important to have a distribution strategy that outlines how and when you share assets, the brief only needs to outline what channels you’ll use. This information will influence the design and style of content. \n\nA press release, for example, would look and sound different from a social post, so you want your creative team to be crystal clear on where the final content will be shared.\n\nDistribution details might look like this in a creative brief: \n\nDistribution. Copy to be published on company news blogs and PR Newswire.\nHow to Write a Brief\n\nHere’s how to write a brief, step by step:\n\n1. Set Goals Using the SMART Framework\n\nAs you set the project or content goal, think about your ultimate business goal. This is bigger than the goal of the brief. \n\nFor example, the goal of a Burger King brief may be to make more young people aware of its flame-grilled burgers. \n\nThis might contribute to a bigger business objective of increasing sales or lowering the average age of its customer base. Burger King will have other campaigns (e.g., content marketing or social media marketing) that also contribute to its broader goal. \n\nYour main objective doesn’t have to feature in your brief, but you should consider it as you write your brief.\n\nWhen defining your ultimate goal, get specific. Rather than setting a goal to “get more customers,” aim to “get 300 more clients by the end of November.” \n\nThis gives you something concrete to work toward and helps you make your brief more targeted. \n\nUse the SMART framework to make goals: \n\nSpecific\nMeasurable\nActionable\nRelevant\nTime-bound \n2. Identify the Problem or Opportunity You’re Addressing\n\nThe “why” of your project provides the background context and reason for the brief. Teams need to know the problem, challenge, or opportunity they’re addressing. \n\nTo get this information across, answer the following questions: \n\nWhat got you to where you are now?\nWhat’s stopping you from moving forward? \nHow will completing this brief help you improve? \n\nTake this snippet on the “why” of a creative brief from WWF: \n\nIn three paragraphs, the brief defines the problem and challenge. Readers can quickly understand:\n\nHow WWF got to where they are now. WWF is inspired by a commitment to the natural world. It exists to protect habitats and animals.\nThe problem stopping them from moving forward. It can’t rely on governments or NGOs. It needs everyone to work together to continue its work.\nHow solving the brief will help. Inspiring a new generation to understand that we all have an impact on the planet will get more people to take up the cause.\n\nTry to answer each question in two or three sentences. This will help you focus on what’s important and deliver your “why” concisely. \n\n3. Define Your Target Audience\n\nThe team working on your brief should be able to visualize your audience so they can appeal to their wants and needs. \n\nAt a minimum, your brief should answer your target audience’s: \n\nGender\nAge\nAverage salary\nLocation (if the project is location dependent)\nInterests\n\nHere’s how the sample PayPal brief describes the customer it wants to target:\n\nReading this helps paint a picture. This campaign is aimed at teenagers who are becoming more independent and want more control over their money.\n\nIf you use Google Analytics for your website, you’ll find audience demographics under “User” in “Reports.”\n\nSupplement this information with Semrush’s “Audience” report from its Market Explorer to get a breakdown of demographics for your industry.\n\nIf you have an established website that ranks well for a significant number of keywords in Google, enter your website domain to get an overview of your industry. If you run a newer website that doesn’t rank well yet, use the website of a well-known player in your market.\n\nIn either case, you’ll see the Market Audience Summary after you enter a domain in the tool. Here, you’ll find characteristics for the largest segments of your audience, including the following:\n\nDemographics (age and gender)\nSocioeconomics (employment status, income, education, and household size)\nBehavior (interests and favorite social media sites)\n\nUse this to build an accurate representation of your visitors and the people you want to target. \n\n4. Research Your Key Competitors\n\nYour main competitors should feature at the top of the list in your brief’s competitor analysis.\n\nOther key players might be less obvious. But including them in your brief is important to help teams get a clear picture of the landscape. \n\nUse Market Explorer to quickly find competitors. Semrush will show you top rivals based on market share and website traffic. All you have to do is enter your website into the tool. (Or, if your site isn’t yet performing well in search engines, enter the website of a well-known player in your industry.)\n\nIn this example, we can see that Booking.com’s top competitors are Tripadvisor and Expedia:\n\nThe Growth Quadrant also reveals Kayak and AAA as Niche Players (newer or low-growth companies relative to the rest of the market) that are developing into Game Changers.\n\nNiche Players make for good research material. Their need to stand out from established rivals means they often come up with fresh ideas and strategies. These tactics can serve as fuel for creative teams. \n\nVisit the websites of each competitor featured in Market Explorer and note the following:\n\nWhat they offer\nWhat they do well\nWhat you do differently\n\nInclude these details in your brief’s competitor analysis to steer research.\n\n5. Fully Describe Your Creative Vision\n\nA good brief brings your vision to life with a clear description of the end results. As you work to describe this vision in your project deliverables section, break it down. Rather than attempting a brain dump of information, get specific on individual aspects of the end result.\n\nCharity & Biscuits’ client copywriting brief does this well. \n\nRather than asking broad questions, such as “what is your project?” or “what content do you need?” Charity & Biscuits gets specific to gather essential information. \n\nHere are the project, content, and tone of voice questions the brief asks: \n\nYour Project\nBriefly describe the overall project that the copy will be a part of\nIn what format will the copy appear?\nWhat do you want the piece of communication to achieve (e.g., inspire people to donate)?\nYour Content\nWhat are the key messages that the copy needs to communicate (provide specific detail)?\nWhat is your call to action (e.g., visit your website or sign up for email newsletters)?\nWhat is your ideal word count or maximum word limit?\nWhat is the single most important point that the copy must communicate? If the audience were to remember one thing after reading, what would you want it to be?\nAre there any pre-agreed straplines or sentences that you want the copy to include?\nDo you have imagery to accompany the copy?\nYour Tone of Voice\nOutline your brand’s tone of voice (e.g., warm and friendly but not overly familiar)\n\nThese questions help Charity & Biscuits’ clients clarify their thoughts and give answers that contribute directly to the project and content. They simplify the vision, making it easier for copywriters to produce work that meets expectations.\n\n6. Set a Deadline for Every Milestone\n\nThink through the key requirements of your project as you set deadlines and milestones in your brief. \n\nFor example, you set a brief to create an advertising campaign. This campaign is part of a wider strategy to achieve your goal of getting 300 more clients by the end of November. \n\nEstablish how soon you need your project or asset published to contribute to the goal. Advertising campaigns run for around three months, on average. This gives you a deadline of Aug. 31.\n\nWork backward from your deadline to create a timeline that covers the following: \n\nStart date\nDelivery of the final version\nMilestones\nDeadlines for subtasks (e.g., designing, writing, editing, etc.)\n\nHere’s how that roadmap might look:\n\nProject duration: July 1st to Aug. 31st\nJuly 1: Kickoff meeting\nJuly 20: Ad copy draft is delivered\nJuly 25: Ad copy approved\nAug. 4: Initial ad designs are delivered\nAug. 13: Ad designs approved\nAug. 20: Ads sent to the publisher\nAug. 25: Ads uploaded to Google Adwords and Facebook Ads\nAug. 31: Ads go live\n\nIf your brief is for an internal team, include a full timeline so team members can view the workflow and communicate with each other to ensure everything runs smoothly. \n\nIf you’re creating a brief for a freelancer or agency, stick to key dates for their tasks. A copywriter, for instance, only needs to know when the copy is due.\n\n7. Review Your Brief and Gather Feedback\n\nOnce you’ve drafted your brief, give it another review to see where it could be better. Share it with your team and gather feedback. \n\nAsk the following:\n\nDoes the brief clarify what’s needed?\nIs it easy to understand?\nIs there any unnecessary jargon?\nAre industry terms and acronyms properly explained?\nIs all of the information relevant?\nWhat else could we add? \n\nYour brief is a living document. Until work starts, be open to ideas and edits. The best way to spot things you might have missed is to get a fresh perspective.\n\nWrite a Brief That Inspires Great Work\n\nA good brief guides and inspires project teams. Your job is to provide direction without restricting creativity. \n\nWriting a brief with a clear strategy in place will ensure your final deliverables meet your vision. Complete your brief using the template provided to help creators hit the ground running and make sure you reach your goals.",
  "headers": {
    "h1": "How to Write a Brief: Complete Guide + Free Template",
    "h2": [
      "Free Creative Brief Template",
      "Types of Briefs",
      "10 Essential Elements of a Great Brief",
      "How to Write a Brief",
      "Write a Brief That Inspires Great Work"
    ]
  },
  "images": [
    {
      "src": "https://static.semrush.com/blog/uploads/media/83/27/8327c9b52925bc7f8728f9a89d739425/how-to-write-a-brief.svg",
      "alt": "How to Write a Brief"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/5f/0b/5f0bed13b4346f0bfc1d4435f0e3ccdf/iE41z6Qyz_DME9LOvico601LcpRY9oH2j-HzkZT-LIBUgkZNna65xkgUzhYd3TANRVe5Bm8EtBrwze6gGcsErbTksQmfu72UiG64HMxVvclKGGReOJ5g1ltEW3Uf6SJwx8x8EuQBdYyOcuQJcodEa-E.png",
      "alt": "Reimagine Your Hometown Through the Language of Colour brief name"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ee/b8/eeb8d91405902def9c8f42696171eec1/XoRpFDm-p4DVBoqo9NQN9mgsgWd9XB7yXMXE7lQ0MIDhlOKE_WvjnFQ62R9OBxib_E6tq3zkYpULEsvNhUEGpQb7KD_9GykL9zqMGAkhzcGrhrWzaxb2kM45ki9WlvR6J8hAMjAhAlNCS3C-8A51onY.png",
      "alt": "AmazonFresh background information"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e9/6d/e96d6c011840ed451abcf0e66a4007c7/N6gPQq9BaO42DFh4JWx8LjCNb5GwQ6griVoI74MWhgxlgHktdl_tMZ1bkxdR3ORJ85dOC5khZ9PpowxV2N1gDnxa81mnU5tOemT42MQXRiMWPa94CuZx4Tva_4XoYy4RIZ5mPGlXqD_ProSFjwgxbH8.png",
      "alt": "PayPal creative brief"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/27/83/278306c55d446188912a18ddae42c561/MeqCRh10ijA56RXjQLoSmIZgsFXoIvSDh0QGJaPaaoGDsj2eGtEese3aPELPd-PlwJZGPFBA3uI63B3_fdAabmRwPaU7X6VlrXkjwDS92DWOOCg1ndbGqPxgaXFQoff8wj3bNMnftK-F6NkEi0j7tzY.png",
      "alt": "Netflix brief"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/f8/91/f8911d31792ef9f064e126201de52336/fL6t3kFckmWZgwRgnUIilQnPO_H9gpn5JKVRW9mGBJqkeotUTGy-h4SqhmdoI8fjIGzil3NTwoXioWj9bDawVwXf4GZ_-v2KjSZhU6yRLVfw-u3aHb0AQVR6EpuOO9uqwESLP7ccj4aSEVJlSAI1O5I.png",
      "alt": "Netflix brief demographics"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/6e/92/6e92ab622d6fb790292fdd22e361faaf/wS4A0-Yh8QW6EBGlQy0GZ-jf1pT_fJ-49iGqpP9LGqi-RqOu7LU2oKB_NeedOH5GcXP1hUYG5IkHdyLnLdpmQ3kat7BELdUzgrL0260hrtE91jVyMDxuNg2VYJ2RzFA1MD9W-HsqmphQfLmdMY3S5_8.png",
      "alt": "Burger King brief"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/8b/df/8bdfdda2236eb887bd3f034029c61c74/EKve-lmQWlOSWD9PY6Muvv4vdJhNiH3mA8sJxu9JETqbojq1pk_AJ7BW3OePH5nbPS7QBWL0tqkxlQxxdrUDI0IVYohaHhlTH59ieRXLKtv5guTTpju8_HsaPNATa8OTMXgIVowrhjfivhzE-dbRe1c.png",
      "alt": "Gray’s Cookies brief"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/f4/2d/f42dbc73f16c26f83e14ab47ede852f6/Keyword-Research-Solutions%E2%80%A8on-Semrush.png",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/93/1e/931e8e45c1e584d45cbbb3dcbd617518/oF90FEyo6gw2p73YFWJ1Hxiwq7yp1vz52bAQnzrYvpjMZa-5ZYqBqFysLpzvlasOPyy8fXMm_qE8HoKlABgL1vijqySLS2B9AbnRHC0E7uOkd8tFxJRjs5psZiu8MWVWFyEzO9KKssNuNXj482ce9-M.png",
      "alt": "Holiday Inn campaign brief"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/4e/97/4e97082b1226432bbb8982e6d5405664/KelR78GoCXhX1o4u42hVSe2XpEPJZYTUqfLgpWwGdZy5BKmbubstLtyXTz3jTRTlqC_urVKN0tvjAKjEQ6jx0C9RQE8aGkrAYQ5lYkDcdcjfbkwdUnmXl4AJHRNnOZZJvZNPbER6c59ZE0PLPotPREY.png",
      "alt": "design brief example from Slider Revolution"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/68/cb/68cbd4675c56507b0e4076b4dd539e67/SMART-Marketing-Objectives.png",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ce/fe/cefe82f3b0d803bd7bc6728017d94318/qvZfgw85vp3u8dmOOhi7jD949ZoNZcpnL2lhhksIJh8FCr-hfByAJF9BcaUkp54ZP15zLU8YCBEbCmTWwduTw-lbY2dgxTsgUZuOM6uLnUOU4jYNTPfrMPv1BMez-up15fB0fQJQL9V6LayUj9i3jKM.png",
      "alt": "creative brief from WWF"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/5a/4a/5a4ae8219495452dc9f5f1e084a2d281/nVqB2NibuX-zUwzQRRTzCYOruJVEYOMlvTiOf_MDEGqZsqsUH8-sNOGDE9AbGkBiw5CKN06rlcG5b40qhDcHweCkykqaWHA6q0VSyFx1Yjwy1_96ZWmtOtctSLPAJ3Au4pc8T3FOAxL1txX4__oFjYo.jpeg",
      "alt": "PayPal brief on potential customer"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/68/76/68768284a8d394bb359aa9f59ca827ac/VmlSE2VR4vmL00_l-OXN_vk_leYGByXxj_SB3ADpJdJDoDJ1C-cs5JnKgsGsGDmsi4xwajFiXZ7Mt6FSlt-lwy0HX_Rk77YuVqwlNRMVW1Sd2fzcNAm2CIKqnWpc-aAmHnouugHe_TRNkJxN5Eaoll8.jpeg",
      "alt": "Google Analytics audience demographics"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/aa/1d/aa1d79242a23f6727fe95da635dc31f0/9yhWqwNl8W_enzF_Pc-wEazoTjaeh8dhasNaUcN8emKmyZIyhf-qdPvXL60xS8dBY8AYBCODeWqnsJ8NyM7oKeL2ZEv2B6XiUfLzu-8RB_T4FkrW4NTpgeJsP8nsXXoCZ-CbIYCBfm6-0HV9c5KvkWY.jpeg",
      "alt": "Market Explorer demographics data"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/51/c1/51c11abea2ac2858ede10e8531fb9c60/su1kzPUCGyaX_5x5KfPJ2poQ4x-rheaIh-lWd1cCQgIs6BC5qsUQJbDq0RmHHHO9Wt_rb2y-LVANHWNxTQiAq6AjYXiULl55FLJPvVrdXev9gZUDK-hyt6GPPi2mg3QIQrNuj0zYTsG1WG2kktMJhVM.jpeg",
      "alt": "find competitors with Market Explorer"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/57/06/57068e6353efc107a2e43112cee60b87/GtN2KZq8ToCh30xOzVs8EpB2g48Wjh8haQA1W3QuMdv9J1QEBdj6frCRJIggKRl1NKkuyh31lg84j54_Q5G5yk5zA06ElHS_Ww0ZL38RqrlD3vtgshhOkPpIaePRKOzpDir3dCw9Kt2WbJaUTm0sT8c.jpeg",
      "alt": "The Growth Quadrant"
    },
    {
      "src": "https://static.semrush.com/semblog-next-static/banners/trial-gift.png",
      "alt": "Trial Semrush banner"
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&d=Mon%2C%2021%20Oct%202024%2014%3A23%3A09%20GMT&n=4d&b=How%20to%20Write%20a%20Brief%3A%20Complete%20Guide%20%2B%20Free%20Template&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fhow-to-write-brief%2F&enc=UTF-8&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://bat.bing.com/action/0?ti=5128787&tm=gtm002&Ver=2&mid=0a2fb1be-ef0a-4a3f-b764-e26d838c4ea3&bo=1&sid=ff2bacc08fb711efb44d311d3abb0ae7&vid=ff2c03008fb711efb2e37f1b0b73d2ee&vids=1&msclkid=N&uach=pv%3D15.0.0&pi=0&lg=en-US&sw=1366&sh=768&sc=24&tl=How%20to%20Write%20a%20Brief%3A%20Complete%20Guide%20%2B%20Free%20Template&p=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fhow-to-write-brief%2F&r=&lt=1052&mtp=10&evt=pageLoad&sv=1&cdb=ARoR&rn=235806",
      "alt": ""
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&b=How%20to%20Write%20a%20Brief%3A%20Complete%20Guide%20%2B%20Free%20Template&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fhow-to-write-brief%2F&enc=UTF-8&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    }
  ],
  "publication_date": null
}