{
  "url": "https://www.semrush.com/blog/internal-links/",
  "title": "Internal Links: Ultimate Guide + Strategies",
  "content": "What Are Internal Links?\n\nInternal links are hyperlinks that point to different pages on the same website.\n\nThese differ from external links, which link to pages on other websites.\n\nHere’s what an internal link looks like on a live page:\n\nAnd here’s a sample of what its code looks like on the backend of a website:\n\n<a href=\"https://www.example-site.com/\">fixing crawlability issues</a>\n\nBelow, we’ll cover why internal links are important for SEO, how to build a successful internal linking strategy, and how to fix common internal linking issues.\n\nWhy Internal Links Are Important for SEO\n\nInternal links are a crucial part of SEO for three main reasons:\n\nThey help search engines understand your site’s structure\nThey pass authority\nThey help users navigate your site\n\nLet’s dive into the details.\n\n1. They Help Search Engines Understand Your Site’s Structure\n\nWhen you use internal links strategically, you signal that page A is related to page B. This helps Google understand the context of your pages and how different pages relate to each other.\n\nA solid internal linking structure also helps search engines crawl (discover) and index (store in its database) the pages on your site. \n\nAs Google states in its guide on how search works: “Some pages are known because Google has already crawled them before. Other pages are discovered when Google follows a link from a known page to a new page.”\n\nHere’s a visual representation of how this works:\n\nAdditionally, internal links can help demonstrate the contextual relationship between two pages.\n\n2. They Pass Authority\n\nInternal linking helps pass authority (or PageRank) to other pages on your site. PageRank is an algorithm Google uses to measure a webpage’s importance when it comes to ranking.\n\nLet’s say page A has lots of external links pointing to it. This means page A likely has more authority via PageRank. This authority can then be passed to page C and other connected pages by way of internal links.\n\nLike this:\n\nIdentifying these pages can help you make the most of the authority coming into your site to improve rankings.\n\n3. They Help Users to Navigate Between Relevant Pages\n\nInternal linking also improves your site’s user experience (UX) by helping visitors find related content.\n\nLet’s say a user lands on an article on your site about “how to build a PC.”\n\nYou can include internal links to relevant product pages with PC parts or to related content like an article about “how to fix a PC fan.”\n\nYour goal should be to keep users on your site so they complete your desired action, like making a purchase, filling out a form, buying a product, etc.\n\nShowing users relevant, useful content on the right pages is the perfect way to do that.\n\nUnderstanding the Different Types of Internal Links\n\nThere are a few different types of internal links: navigational, footer, contextual, and sidebar links.\n\nHere’s how they appear on your site.\n\nNavigational Links\n\nNavigational links are the most important internal links because they live permanently on your main menu. They also make up your site’s main navigational structure.\n\nNavigational links often live on the top menu or sidebar and cover product categories, services, or main content topics.\n\nHere’s an example of what they look like:\n\nThey are often implemented site-wide and serve the primary purpose of helping users find what they want.\n\nFooter Links\n\nFooter links are a type of navigation link. They appear on every page of your site, but at the bottom of the page instead of the top:\n\nThese links should point to other pages on your site that the user may want to visit. \n\nSome common footer links are your contact us, about us, FAQ, and other reference pages.\n\nSidebar Links\n\nSidebar links are another type of navigational link that some sites use to direct users to related content.\n\nMany news or recipe websites feature these kinds of links to encourage visitors to navigate to related pages on the same site.\n\nContextual Links\n\nContextual links (or in-text links) are usually placed in the main body content of a page.\n\nRather than directing users to larger navigational pages, these types of links direct them to other related content.\n\nA company’s about page, for example, might include links like this:\n\nThe links are often placed within descriptive anchor text (i.e. “Fossil Free Media”). \n\nBlog posts often feature contextual links to point readers to related, relevant content and to help Google understand how your site pages relate to each other.\n\nHow to Build Your Internal Linking Strategy\n\nNow that you know the basics, it’s time to build your strategy.\n\nHere are five steps to get started + a template so that you can follow along:\n\n1: Identify Your Site’s Pillar Pages\n\nStart by making a list of pillar pages—i.e., central pages about a broad topic that link to related, more specific pages.\n\nYour pillar pages will help you build out topic clusters which are groups of content about specific topics. Coming up with pillar pages and topic clusters will help you build out the architecture of your site.\n\nPillar pages should target broad keywords with high search volumes rather than more specific long-tail keywords.\n\nThink of your pillar page as the top of your marketing funnel—customers are curious and only looking for general details.\n\nHere are a few examples of pillar pages:\n\nThe Home Depot has a whole page that links to different types of washing machines. Because the keyword “washing machines” gets 18,100 searches per month.\n\nEach section contains types of washing machines that link out to more specific product categories. And those product categories link out to even more specific product pages.\n\nJust be careful not to fall into the trap of identifying pillar pages that are too niche. Otherwise, you won’t have enough content (clusters pages) to house under your pillar page.\n\n2: Create Topic Clusters Using Internal Links\n\nNow that you’ve identified your pillars pages, it’s time to develop more specific topic clusters for each of them.\n\nThink of your pillar as the main topic and clusters as supporting, more specific topics.\n\nSo if your pillar page was about “copywriting,” your clusters might include “What Is Copywriting?” and “Copywriting Tools.”\n\nYou can even create more clusters for your clusters. For example, support your “email copywriting” cluster with pages about subject lines and call-to-actions (CTAs).\n\nThese pages need to internally link back to the pillar page to showcase topical relevance and indicate that the pillar page is the main page.\n\nTo start, map out your topic clusters and build ideas for relevant supporting pages.\n\nA simple way to do this is to fill out a spreadsheet for each topic cluster:\n\nIf you aren’t sure how to come up with topic clusters or supporting pages, use a keyword generator like Semrush’sKeyword Magic Tool.\n\nPlug in a general keyword like “copywriting:”\n\nYou can search through the results or use the left-hand column to find groups of related keywords.\n\nIn this example, see different topics related to copywriting like “course” and “email.”\n\nClick on “course” or “email” in the left-hand column to find more specific related keywords.\n\nUse supporting pages to target those hyper-specific keywords. Just like topic clusters should interlink with pillar pages, supporting content should do the same. \n\nFor more in-depth instructions, read our Ultimate Guide to Keyword Research.\n\nFind Keywords to Build Topic Clusters\n\nwith the Keyword Magic Tool, the Biggest Keyword Database on the Market\n\nTry for Free →\n3: Choose the Right Anchor Text\n\nAnchor text is the clickable text that appears in a hyperlink, like this:\n\nYou have full control over the anchor text on your own site. \n\nGet strategic about what words and phrases you use so that they clearly indicate their target page topics.\n\nQuality anchor text helps both users and search engines determine what a page is about before they click on it.\n\nComing up with relevant anchor text also allows Google to better understand your site’s structure—which provides it with more context about how pages are related to each other.\n\nSEO-friendly anchor text is:\n\nBrief: Keep anchor text brief so that it’s clear to users and search engines what the page's topic is about. We recommend keeping anchor text to five words or less.\nRelevant: Avoid vague, clickbait anchor text like “click here” or “this weird life hack will help you lose 10 pounds a week.” Neither option tells Google what the linked page is actually about.\nOptimized: It’s not likely that you’ll be penalized for using exact-match anchor text for internal links as long as the anchor text is relevant to the linked page. And you aren’t trying to over-optimize by keyword stuffing.\n\nBe careful when it comes to external links, though—manipulating external anchor text is a violation of Google’s webmaster guidelines.\n\nKeeping all those best practices in mind, assign anchor text suggestions to your pillar and cluster content based on keyword research.\n\nFor example, you can use the Keyword Magic Tool to look for keywords related to “email copywriting” for your topic cluster.\n\nChoose a couple of appropriate, related keywords and add them to your strategy document.\n\n4: Identify Your Site’s Authority Pages\n\nYour most authoritative pages have high-quality backlinks (i.e., links from external pages) pointing to them.\n\nGoogle sees backlinks as a vote of confidence. So if a page has a lot of votes—i.e., backlinks—some of that authority can be passed on.\n\nThe goal is to strategically pass this authority (or link equity) to other pages via internal links.\n\nTo do that, find your site’s most authoritative pages with Semrush's Backlink Analytics tool.\n\nType in your domain and click “Analyze.”\n\nNext, click the “Indexed Pages” tab.\n\nThis report will show a list of your website pages, which are (by default) sorted by number of referring domains.\n\nNow these are your most powerful pages.\n\nExport your results as .csv or .xls files.\n\nThen, paste at least ten of your high-authority pages into your strategy doc.\n\nUse these pages to link to less authoritative content to help improve rankings.\n\nIdentify Your Site’s Authority Pages\n\nwith the Backlink Analytics Tool\n\nTry for Free →\n5: Support Your New Pages\n\nA strong internal linking structure is especially important if you haven’t earned many authoritative backlinks yet.\n\nTo start, choose a new piece of content or a page that you’d like to perform better. Then, identify opportunities for relevant interlinking.\n\nUse Google’s “site:” search operator to find related pages on your site that mention this page’s target keyword.\n\nFor example, we might search for “site:semrush.com internal links” to find articles related to this guide and add links.\n\nNow, go through the search results and look for all the pages related to this.\n\nThen, paste those links into your strategy document.\n\nAfter you compile your list, add links from each of the identified pages. Check the links off as you go.\n\nThis way, you’re passing authority to your new page via internal links.\n\nPro tip\n\nAim to point to at least two or three internal links to every new piece of content.\n\nBonus Step: Maximize the Impact of Digital PR Campaigns with Internal Links\n\nDigital PR is a public relations tactic used to earn backlinks. \n\nBut you can use this strategy to improve your internal linking as well.\n\nDigital PR campaigns will often be tied to landing pages, like this one:\n\nConsider how you can use your campaign landing pages to pass authority to other related pages on your site.\n\nThis might include basic navigational links or contextual links within the landing page’s body copy to improve SEO and user experience.\n\nSee how the above example links to Semrush’s Site Audit tool?\n\nThe page that’s linked to provides further context for users who land on the campaign landing page. And if the campaign landing page earns backlinks, it will pass on that authority via internal links.\n\nA win-win situation.\n\nFor even more tips, check out our video on advanced internal linking techniques.\n\nAuditing Your Site’s Existing Internal Links \n\nUnless you’re working on a completely new website, you probably already have some internal linking in place.\n\nAnd to create a solid internal linking strategy, you must first understand your current internal linking structure.\n\nPerforming an internal link audit will help you with this.\n\nTo start, head to the Semrush Site Audit tool. Then enter your website name and click “Start Audit.”\n\nThe tool will ask you to configure your audit settings. Once you do that, the audit will initiate. \n\nAfter it is complete, you’ll find your Internal Linking score (under Thematic Reports). Click “View details” to get the full report.\n\nThis report delivers five insights you need to audit your current linking structure:\n\n1. Pages Crawl Depth tells you how many clicks it takes to reach your website pages. Use that info to increase accessibility to your deeper pages.\n\n​​​​2. Internal Links tells you how many internal links you have across your pages. Clicking on the bars will tell you which pages have how many links. That way, you can plan to add links where necessary.\n\n3. Internal Link Distribution shows you percentage of internal links to your pages. And classifies them by strongest to weakest based on authority.\n\n4. Internal Link Issues list out problems with your internal links.\n\n5. Pages Passing Most Internal LinkRank (authority) tells you which pages are your strongest pages. Use those pages to distribute link juice across your site.\n\nNow let’s cover some common internal linking issues you can identify in Site Audit. Plus how to fix them.\n\nAudit Your Internal Linking Structure\n\nwith the Site Audit Tool\n\nTry for Free →\nCommon Internal Link Problems & How to Fix Them\n1. Broken Internal Links\n\nThe problem: Broken internal links send both users and search engine crawlers to pages that don’t exist. Broken links might happen because of deleted pages and mistyped links, for example.\n\nThis can result in 404 errors, which don’tpass authority.\n\nHow to fix it: Find broken links under the “Errors” section of your Internal Linking report. Then, either remove or replace the link with one that points to a live page.\n\nFind and Fix Your Broken Links\n\nwith the Site Audit Tool\n\nTry for Free →\n2. Too Many Internal Links\n\nThe problem: Too many links on a page can confuse Google’s crawlers.\n\nAdditionally, hundreds or thousands of links on a page make it hard for users (and search engines) to identify which links are important.\n\nHow to fix: As a general rule, try not to force links on any page. When it comes to internal linking, less is more—you don’t want to create a poor user experience.\n\nWhich is why the Site Audit report will flag pages that have way too many links. Check the “Warnings” section of your Internal Linking report.\n\nReview any pages that have a surplus of links and remove ones that aren’t necessary.\n\nFind Pages with Too Many Internal Links\n\nwith the Site Audit Tool\n\nTry for Free →\n3. Nofollow Attributes in Internal Links\n\nThe problem: Nofollow links use the rel=“nofollow”attribute to communicate to Google that the authority should not be passed to the linked page.\n\nSEOs will often use the nofollow attribute for outbound links to pages that they don’t want to “vote” for, but you’ll want to leave most internal links as “followed” links.\n\nHere is what a “followed” link looks like:\n\n<a href=\"https://example.com\">Anchor Text Goes Here</a>\n\nFollow links don’t technically have an attribute added to them—they’re just plain links—and do pass SEO value to other pages.\n\nHere is what a nofollow link looks like:\n\n<a href=\"https://example.com\" rel=\"nofollow\">Anchor Text</a>\n\nHow to fix: Find links with the rel=”nofollow” attribute under the “Warnings” section in your Internal Linking report.\n\nThen, remove the rel=“nofollow” attribute from them.\n\nDetect Internal Links That Are Nofollowed\n\nwith the Site Audit Tool\n\nTry for Free →\n4. Orphaned Pages\n\nThe problem: An orphaned page is a page with no links from any of your other pages. Because Google crawls (i.e., finds) pages via links, it usually has a tougher time finding orphaned pages.\n\nAnd if Google can’t find your orphaned page, the page won’t be indexed—which means it won’t appear in search results.\n\nSee how the orphaned pages in this illustration are off floating on their own:\n\nHow to fix: To find orphaned pages, look for the “Orphaned sitemap pages” error under the “Warnings” section of your Internal Linking report.\n\nThen, link to it from another page (just make sure that page also isn’t an orphaned page, or the issue will persist).\n\nFind and Fix Orphan Pages\n\nwith the Site Audit Tool\n\nTry for Free →\n5. Pages With Only One Incoming Internal Link\n\nThe problem: Internal links tell search engines which pages are important. So the more incoming internal links a page has, the easier it is for search engines to find that page and then rank it.\n\nOrphaned pages and pages with only one internal link pointing to them are more difficult to find. And search engines will probably see them as less important.\n\nHow to fix: The Site Audit tool helps to find pages with only one internal link.\n\nGo to your Internal Linking report and look for the error “Pages with only one internal link” under the “Notices” section.\n\nFind related pages on your site, then add links to pages with few internal links. \n\nFind Pages That Need More Internal Links\n\nwith the Site Audit Tool\n\nTry for Free →\n6. Crawl Depth of More Than Three Clicks\n\nThe problem: Crawl depth refers to the number of clicks it takes to get to a page on your site from the homepage.\n\nIf it takes several clicks to get to a page, search engines may determine that the page isn’t very important.\n\nAccording to Google, pages with less crawl depth tend to rank better in search results.\n\nHow to fix: Pages deeper than three clicks will show up on your Site Audit’s Internal Linking report.\n\nFind them by clicking on the “#issues” button beside the notice that says, “Page Crawl Depth more than 3 clicks.”\n\nThen, add links to these pages (ideally from other pages that are only one-click away from your homepage). That way, visitors and search engines can access them more easily.\n\nFind Your Deep Pages\n\nwith the Site Audit Tool\n\nTry for Free →\n7. Internal Redirects\n\nThe problem: Passing internal links through permanent redirects can reduce your crawl budget, especially for larger sites. (Crawl budget is the number of pages Google will crawl on your site within a given timeframe)\n\nSay you redirect an old page to a new one. Other pages on your site may still link to the old page. Users will click on your old link, then get redirected to the new location.\n\nThis extra redirect isn’t necessary.\n\nHere’s what it looks like:\n\nInternal redirects also slow page load time, which negatively impacts user experience (and PageSpeed).\n\nHow to fix: Update internal links to send users and search engines directly to the new page.\n\nTo find internal redirects, head to your Site Audit tool and go to your “Crawled Pages” tab.\n\nThen, search for your old URL in the search bar.\n\nClick on the URL in the table below the search bar. Then, click the “# URLs” that appears under “Incoming Internal Links.”\n\nThe list of links that appear are pages that still link to your old URL.\n\nChange the links on those pages so that they link to your new page instead of your old, redirected one.\n\nHere’s what the corrected version looks like:\n\nFind and Fix Internal Redirects\n\nwith the Site Audit Tool\n\nTry for Free →\n8. Redirect Chains & Loops\n\nThe problem: A redirect chain occurs when more than one redirect exists between the original URL and the final URL. This is common during website migrations.\n\nFor example: URL A’s slug was previously /our-mission/. Later, it was moved to /about-us/ (URL B). If you launched a new site and updated URL B to /about/ (enter URL C), you would create a redirect chain.\n\nSo instead of reaching a page directly, the user is bounced to another page first.\n\nHere’s what it looks like:\n\nA redirect loop happens when the destination can’t be reached. Say you want to redirect from URL X to URL Y, but URL Y also redirects to URL X.\n\nEssentially, the pages redirect each other, so the user never lands on a page.\n\nLike this:\n\nRedirect chains and loops make pages harder to crawl and provide a poor user experience.\n\nHow to fix: Search for “redirect chains and loops” in the Site Audit Issues report:\n\nYou’ll find a list of pages. Along with the redirect type and the number of related redirects.\n\nCorrected redirect chains will look like this—one final destination vs. a circle of redirects:\n\nAnd corrected redirect loops will have one primary page that doesn’t redirect back to the initial page. In this case, you’d delete the redirect from your primary page back to the other page.\n\nFind and Fix Redirect Chains and Loops\n\nwith the Site Audit Tool\n\nTry for Free →\n9. Links on HTTPS Pages Lead to HTTP pages\n\nThe problem: Google recommends securing your site with HTTPS. If you switch from HTTP to HTTPS, you may have some pages that still mistakenly point to old HTTP pages. \n\nThis creates unnecessary redirects, as the links should point to the secure HTTPS versions of those pages.\n\nHow to fix: To quickly find this error, go to your Site Audit report and click the “View Details” button under “HTTPS” section.\n\nThen, scroll down to find the “X link(s) on HTTPS pages leads to HTTP page” error.\n\nClick on the number to see which pages have the error.\n\nThen update those HTTP links to point to HTTPS pages instead.\n\nFind Pages with HTTP Internal Links\n\nwith the Site Audit Tool\n\nTry for Free →\nFix Internal Linking Issues With Site Audit\n\nEven after you start implementing your new internal linking strategy, it’s important to check for problems routinely.\n\nBe sure to run your Site Audit every month or so and check the Internal Linking Report for issues. This is the best way to keep tabs on your site health and make improvements as needed.",
  "headers": {
    "h1": "Internal Links: Ultimate Guide + Strategies",
    "h2": [
      "What Are Internal Links?",
      "Why Internal Links Are Important for SEO",
      "Understanding the Different Types of Internal Links",
      "How to Build Your Internal Linking Strategy",
      "Auditing Your Site’s Existing Internal Links ",
      "Fix Internal Linking Issues With Site Audit"
    ]
  },
  "images": [
    {
      "src": "https://static.semrush.com/blog/uploads/media/05/29/052996e01758856e816d57bd223e0af4/internal-links-guide-to-building-strategy.svg",
      "alt": "Internal Links Guide"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/b9/a3/b9a3945bb119721c2f4a7fd57b83e986/internal-link-example.jpg",
      "alt": "internal link example"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e2/a7/e2a73f6efdb75dc6040af959d05eb842/google-discovers-pages.png",
      "alt": "how Google discovers pages"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/4d/d1/4dd196a003e15aec062a371e7931814e/pagerank.png",
      "alt": "how PageRank is passed down"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ae/39/ae39a6d99114478cf11300d40fb5201a/navigation-links.jpg",
      "alt": "navigational link example"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/b6/34/b634da083a268ffca24575fcb56228fe/footer-links.jpg",
      "alt": "footer link examples"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/6f/cd/6fcd411a43c3e3352747c2ac1b3f19d2/sidebar-links.jpg",
      "alt": "sidebar link examples"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/31/6f/316f99a65248d1e7238b98bc71a97f23/internal-links-in-text.jpg",
      "alt": "internal link context"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/b8/b8/b8b8a1c46f12951734e453ceebb4b3b9/topic-clusters.jpg",
      "alt": "topic cluster model"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/b9/67/b96778c45147749a59953cd94d814a4e/3d8f730a664415fde80e58e9dc8dd1ff/vPfmFk5h50I5YS_1KwU2YOln6DKAPffB5HdR1orqLmPbArd0k85S8kG9V1WM0BEdqX8lI7d2l-UqZwqZwmUfhv-oJcBTL2dbmOy_oqlTEwp5sPC1VvusPyUJqFVTX37T1lNzyGUMTUmWNZtERN1PVDc.png",
      "alt": "Keyword overview volume for \"washing machines\""
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/49/f2/49f2b70a3390e60b187290448b7a8a8d/washing-machines.jpg",
      "alt": "washing machine pillar page"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/5b/90/5b90d9cb8963378d1e4353c321202dca/topic-cluster-model.png",
      "alt": "topic cluster model for copywriting"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e9/14/e91445e6ab79e01b3874d16e75d474c4/topic-cluster-strategy-template.jpg",
      "alt": "topic cluster strategy template"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/2e/e4/2ee45daaa9f92784fcfc3c89fd15cb88/keyword-magic-tool.jpg",
      "alt": "Keyword Magic Tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/8e/5d/8e5d542e39a827ea0bb4c30b2d562482/keyword-magic-tool-research.jpg",
      "alt": "keyword research for \"copywriting\""
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/f1/a4/f1a4a7507d7471b4ac7d219b328c2889/copywriting-courses-keyword-research.jpg",
      "alt": "copywriting courses research"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/40/5b/405bb4fc1ef35828d7b6d387e03a4581/d58575e319d37fd40fa6089d6a9c8599/Oo18Z7JOXW0kd_M8WObA1Ac8CmNTTirL-e5exmMMEHLs1BsLruiB9V2xV0JhtjIaYm_Nu1rBr4ENJlL4D6aooZN2nx1iTgOKnq302s36WeGTiMZuV3XWaM__kuz0DbCVerIf56_8qrfzXx4Cq0D5R2U.png",
      "alt": "Anchor text that reads \"chocolate syrup\""
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/09/59/095957236f2bd0ce99887e4b4705c956/email-copywriting-keyword-research.jpg",
      "alt": "email copywriting keyword research"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/be/3c/be3cc7de4552949e957bc736941976d4/recommended-anchor-text.jpg",
      "alt": "recommended anchor text"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/2d/ae/2dae23dcdf48ff361a2bd1a60df5640b/backlink-analytics.jpg",
      "alt": "Backlink Analytics"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ec/c4/ecc4a7a79f6d774e5d432d28d103137e/indexed-pages-report.jpg",
      "alt": "Indexed pages report"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/36/f1/36f19734b1efdc5065554001a50290fb/indexed-pages-domains.jpg",
      "alt": "Indexed pages domains"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/1f/13/1f13581ab1171ad68c39430b6fc291fb/export.jpg",
      "alt": "export"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/a3/f9/a3f97ab673362250313e597cb6f2c221/authority-pages.jpg",
      "alt": "List of authority pages"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/56/1c/561cb61afe866d3dc6756385bc5498b5/semrush-internal-links-search.jpg",
      "alt": "searching Google for Semrush pages about internal links"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/b9/8d/b98ddaf7021eae6a232933ecc6258cb3/semrush-internal-links.jpg",
      "alt": "Google results for Semrush pages about internal links"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/28/85/2885ee18979947a704d068b0ffadb144/918f478047c708f0949d40ccd75bcdd1/Gb5KegNxUlhi7l0BxahsgyGIynyUIqUcz0kelkp0VL5pdhoYLbckLcTt56JbfIn7J-VePb6C6cb1a0ENN1N55PAjwntGLIqfcg8lCD2pcdNFnEt3EbQ2k-b6IwwMuJj9xLPB654o-HwSajkoLCXhDLk.png",
      "alt": "Links pasted into the strategy document."
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/3d/51/3d517ed2ea22bb56a55d031d9a43fa36/41998aa24b9bbcd6a8d92b1dbc30810a/8XkUWVmixvMN4veZ_NM94OuSxIPkPz8eGeJ7muTL8VQ4qyaR2zqbVB5vPjIpPsyCL9N9SN_8OO6OCa0aUtYpEyGttCqu56BE-IcCTUN4AShox9c5UdLUWAWUtQ2H5hYaNzcqDeQHZHRfaXJFthB8NEU.png",
      "alt": "Check the box when you've added links"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/de/6a/de6a292acf371d9400aa23b1858e2fb1/check-site-health.jpg",
      "alt": "site health landing page"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ee/55/ee555f27f7a49796cf42e585d7d49d4f/check-site-health-internal-link.jpg",
      "alt": "site health landing page internal link"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/cd/e8/cde88330eb2e75afc9e6e8f7073b4db0/site-audit.jpg",
      "alt": "Site Audit"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/db/64/db64ef665b582fccbcf2abd778eebd04/internal-linking-report.jpg",
      "alt": "Internal linking report"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/15/c3/15c37ea393c00e276af0a29a6c00d021/page-crawl-depth.jpg",
      "alt": "page crawl depth"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/9c/9b/9c9b25a543f058d5e074843739e466df/incoming-internal-link-graph.jpg",
      "alt": "incoming internal links graph"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/7a/61/7a61d1f33aa47c0fca838db4cc3bc767/internal-link-distribution.jpg",
      "alt": "internal link distribution"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/d9/f0/d9f0097cc80d230593ebb3160e7ce964/internal-link-issues.jpg",
      "alt": "Internal link issues"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/48/b4/48b428ab561c3f91f875cfb90247a18f/pages-passing-internal-linkrank.jpg",
      "alt": "Pages passing most internal link rank"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/3a/27/3a27621e8e7d679085c541f79cc72492/broken-internal-links.jpg",
      "alt": "Broken internal links"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e3/fd/e3fd23a854dc517578129aa075fc4835/too-many-links.jpg",
      "alt": "too many internal links"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/28/56/28566dcb2d6fecb69f3bee66f79e4331/nofollow.jpg",
      "alt": "nofollow internal links"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/31/b3/31b30497831a77ce697af67eb00bf952/orphan-pages.png",
      "alt": "orphan pages"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/b1/a5/b1a58c3fbe64cc8b73b9ffdee6aa7ed3/orphaned-sitemap-pages.jpg",
      "alt": "Orphaned sitemap pages"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/74/ac/74acb913750a7d47f877a22df02bd4e1/one-internal-link.jpg",
      "alt": "pages with only one internal link"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/5b/ea/5bea81cdec886e4b0c61281fe69ae38c/crawl-depth-issue.jpg",
      "alt": "crawl depth issue"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/79/4f/794f0da9db594edf0501ea897728d1a4/internal-redirect.jpg",
      "alt": "internal redirect"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/bc/76/bc76b0560c60fa7d9d6e99734ae430a3/crawled-pages-report.jpg",
      "alt": "crawled pages report"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/f0/b4/f0b4573c6f1453efb029c83fa9c0e584/search-crawled-pages.jpg",
      "alt": "search crawled pages"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/8f/3f/8f3f46f1ee0d47a8425fd7af9b0499a6/incoming-internal-links.jpg",
      "alt": "incoming internal links"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/46/b5/46b55d316aca41ffa1a9ac16766255ab/correct-internal-linking.jpg",
      "alt": "correct internal redirect"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/b4/07/b4077c6f1d1dc492b080eed824f43eab/redirect-chain.jpg",
      "alt": "redirect chain"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e2/51/e251a3c2b74bb2f86fc9d9f43e0c39bd/redirect-loop.jpg",
      "alt": "redirect loop"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/5f/33/5f336e5809fe73d598fc45fdb32bbd25/redirect-chains-and-loops-error.jpeg",
      "alt": "redirect chains and loops"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/98/f5/98f54b973fdf10a6d2a5399d787e5f50/redirect-chains-loops.jpg",
      "alt": "list of redirect chains and loops"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/9f/5c/9f5cd305afcb5c1f33c0f55c4af0cd5d/redirects.jpg",
      "alt": "corrected redirect chains"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ae/c4/aec4867c8b6e974fb061f2a7f76312e1/https-report.jpg",
      "alt": "HTTPS report"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/84/88/8488dd356d6e99a23180fdd0d8ac5a9b/https-http.jpg",
      "alt": "HTTPS issue"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e0/94/e094a5309ecaf307afc1bd0ac77546d7/identify-http-https-issue.jpg",
      "alt": "identifying HTTPS issue"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/semblog-next-static/banners/trial-gift.png",
      "alt": "Trial Semrush banner"
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&d=Mon%2C%2021%20Oct%202024%2014%3A07%3A51%20GMT&n=4d&b=Internal%20Links%3A%20Ultimate%20Guide%20%2B%20Strategies&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Finternal-links%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&b=Internal%20Links%3A%20Ultimate%20Guide%20%2B%20Strategies&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Finternal-links%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://bat.bing.com/action/0?ti=5128787&tm=gtm002&Ver=2&mid=33081f3d-422c-45bc-9a13-e345c5cfd76f&bo=1&sid=c6fcc3908fb511ef9bf06d187c857784&vid=c6fd14508fb511ef94512fc635717275&vids=0&msclkid=N&uach=pv%3D10.0.0&pi=0&lg=en-US&sw=1920&sh=1080&sc=24&tl=Internal%20Links%3A%20Ultimate%20Guide%20%2B%20Strategies&p=https%3A%2F%2Fwww.semrush.com%2Fblog%2Finternal-links%2F&r=&lt=1239&evt=pageLoad&sv=1&cdb=ARoR&rn=627253",
      "alt": ""
    }
  ],
  "publication_date": null
}