{
  "url": "https://www.semrush.com/blog/marketing-budget/",
  "title": "How to Create a Marketing Budget in 9 Steps (+ Free Template)",
  "content": "What Is a Marketing Budget?\n\nA marketing budget outlines the expenses a business plans to allocate toward marketing in a specific time frame. Budgets are typically established on an annual or quarterly basis. \n\nThe expenses detailed in a marketing budget may include the following: \n\nMarketing team salaries\nSoftware costs\nWeb hosting\nAd placement\nPress relations expenses\nOutsourcing costs\n\nHow much you should spend on marketing depends on a range of factors, including:\n\nIndustry size\nGrowth stage\nAnnual revenue\nLocation\nCustomer base\nOverall business strategy\n\nDownload our free marketing budget template\n\nHow to Determine Your Marketing Budget\n\nCommon approaches include:\n\nSpending a fixed percentage of your revenue or overall budget on marketing\nBasing your marketing budget on industry benchmarks\nAllowing your business goals to determine your marketing expenditure \n\nLet’s consider each method. \n\nMarketing Budget as a Percentage of Revenue or Overall Budget\n\nIn this method, you allocate a set percentage of your total revenue or overall budget to marketing expenses. \n\nIn 2023, the average marketing budget was 9.1%of total revenue, according to Gartner’s CMO Spend and Strategy Survey. \n\n2023 Marketing Budget as a Percent of Total Revenue (2019-2023)\n\nImage Source: Gartner\n\nYour marketing budget will be influenced by various factors. Like your company’s growth stage. And industry. \n\nFor example, consumer packaged goods companies allocated an average of 22.61% of their overall budgets to marketing in 2023. For mining and construction companies, that percentage dropped to 3.75%.\n\nThis Statista graph shows various industries’ average marketing expenses as a percentage of overall budget: \n\nImage Source: Statista\n\nMarketing Budget Informed by Industry Benchmarks\n\nIn this method, you research what other businesses in your industry or niche spend on marketing. This information informs your marketing budget allocation. \n\nEvery industry has marketing norms. And benchmarks. Some industries dedicate a larger portion of their overall budget to marketing than others. Similarly, the distribution of marketing budgets across various channels will vary from industry to industry. \n\nThe data in the table below shows the average marketing budget by industry, based on CMO Survey data.\n\nUseful industry benchmarks include:\n\nThe average total amount spent on marketing \nWhich channels are favored by companies in your industry\nHow much companies in your niche typically spend on each channel\nHow effective businesses similar to yours find individual marketing channels\n\nWhere can you find this information? \n\nFind recent industry averages in marketing or industry research reports. For instance, The CMO Survey regularly conducts surveys of chief marketing officers. And publishes the results for free. \nSites like Statista publish benchmarking data. But often require a membership to access it.\nIndustry associations, LinkedIn groups, forums, and industry newsletters are good places to learn about marketing norms. And trends in your industry. \nSemrush’s Advertising Research tool lets you explore and analyze competitors’ paid search ad history. Allowing you to see what they spend on pay-per-click (PPC) marketing. \n\nAnalyze Competitors’ Ad Budgets\n\nwith the Advertising Research Tool\n\nTry for Free →\nMarketing Budget Driven by Business Goals\n\nStart with the business outcomes you want to achieve through marketing. And work backwards from there.\n\nFor example: \n\nYou set a goal to acquire 100 new customers using a specific channel. To calculate how much you need to budget for marketing to reach this goal, you first need to know how much it costs to acquire one new customer. \n\nThen, multiply that number by the number of new customers (100). And add fixed marketing costs. Like payroll and software. \n\nIf your customer acquisition cost is $250 per customer, and your fixed marketing costs amount to $13,000, the equation would look like this:\n\n($250 x 100) + $13,000 = $38,000\n\nTo reach your customer acquisition goal, you’d budget $38,000 for this marketing campaign. \n\nRepeat this process for each marketing goal. Whether you want to grow your following on social media, increase organic traffic to your website, or drive product demo signups.\n\nThis is only a guideline. To establish your marketing budget, consider your business numbers and goals.\n\nMarketing Budget Examples\n\nSometimes, the fastest way to learn is by example. \n\nSample Marketing Budget for a Small Business \nCompany: FreshBite Catering\nIndustry: Food & beverage\nOffering: Catering services for corporate events, weddings, and special occasions\nAnnual revenue: $500,000\nMarketing budget as a percentage of revenue: 10% ($50,000)\nTarget customer: Corporations, event planners, engaged couples, and individuals hosting events\nMarketing goals: Increase brand awareness, boost catering bookings, and expand client base\nSample Startup Marketing Budget \nCompany name: SmartSavings App\nIndustry: Financial technology (Fintech)\nOffering: Mobile application for personal finance management, budgeting, and savings\nAnnual revenue: $500,000 (post-funding)\nMarketing budget as a percentage of revenue: 15% ($75,000)\nTarget customer: Millennials and young professionals seeking to improve their financial habits\nMarketing goals: Increase app downloads, user engagement, and brand recognition through targeted digital advertising, influencer partnerships, and app store optimization\nSample B2B Marketing Budget\nCompany name: DataInsight Analytics\nIndustry: B2B software as a service (SaaS)\nOffering: Business intelligence and analytics platform for data-driven decision-making.\nAnnual revenue: $8,000,000\nMarketing budget as a percentage of revenue: 12% ($960,000)\nTarget customer: Mid-sized to large enterprises across various industries seeking to leverage data for strategic insights.\nMarketing goals: Strengthen brand authority through thought leadership content, nurture leads with targeted email campaigns and webinars, and expand reach through strategic partnerships with industry influencers and consulting firms\nCommon Marketing Costs\n\nMarketing costs refer to all the expenses involved in promoting a brand, product(s), or service(s), such as the following: \n\nWeb development\nSEO\nAds\nSoftware\nSalaries\nFreelance help\nEvent venue rental\nMarketing agency fees\n\nBasically, it's all the money you spend to get the word out about your business. And attract new customers. \n\nThe key to staying within your budget is paying attention to the details. It’s also a good idea to build some flexibility into your budget. To account for unexpected expenses. \n\nPaid Advertising\n\nPaid advertising costs include the expenses associated with advertising.\n\nPaid media accounted for 25.6% of marketing budgets in 2023, according to Gartner’s report.\n\nPaid advertising includes traditional advertising media. And online paid advertising opportunities.\n\nExamples include: \n\nAds in print media \nTV commercials \nRadio spots\nBillboards and other physical displays\nSearch engine ads \nDisplay ads \nRetargeting campaigns \nAffiliate marketing commissions \nSocial media marketing\n\nPaid advertising costs are not just placement fees. Factor in the costs of creating content, managing the campaigns, and budgeting for ads that vary by engagement. Such as cost-per-click (CPC) and pay-per-click (PPC) models. \n\nPayroll and New Employees\n\nLabor typically accounts for 24.6% of a CMO’s budget. Agencies and services make up 23.3%, according to the Gartner CMO survey. \n\nImage Source: Gartner\n\nMarketing talent costs include payroll. And benefits like raises and bonuses for marketing staff. And recruitment costs involved in hiring new employees. \n\nMarketing talent includes: \n\nCreative directors \nArtists/creatives\nCopy editors\nSEO strategists \nWriters\nMarketing managers \nData analysts \nPhotographers \nVideographers\nPPC specialists \nCopywriters\nContent managers \nGraphic designers \nContent creators \nVideo editors\nSound engineers\nSocial media marketers\n\nNew marketing hires come with additional costs. Like recruiting, onboarding, and training. And equipment and software licenses or “seats.”\n\nFreelancers and Agencies\n\nIn-house, agency partner, or freelancer? This is a question you’ll likely face when establishing and updating your marketing budget. \n\nCurrently, 20.2% of marketing tasks are outsourced. This number is expected to increase by 5% within the next year. \n\nImage Source: The CMO Survey\n\nMany marketers hire outside help. Like freelancers, agencies, and other vendors. Outsourcing has its pros and cons. Some of which we’ve listed below.\n\nPros:\n\nFreelancers and agencies extend your in-house capacity \nOutsourcing avoids many costs associated with permanent staff\nYou can hire on-demand experts who would otherwise command high salaries\nHiring an agency is often more efficient than doing the work in house\nIf you lack the skills, resources, or equipment to execute a project in house, outsourcing can bridge these gaps\nPaying hourly or per-project gives you greater budget flexibility \n\nCons:\n\nExperienced freelancers and vendors with specialized skills are expensive\nFinding talented, reliable freelancers can be difficult and time-consuming\nOutsourcing can involve a lot of feedback and back-and-forth to get on the same page\nAgencies and freelancers require active management to ensure you’re getting your money’s worth.\nOutsourcing involves more ongoing admin than hiring full-time staff. Like managing contracts and invoices.\nMarketing Software\n\nMarketing software covers a wide range of tools. To plan, create, manage, and track marketing campaigns. \n\nTo name a few:\n\nAnalytics software: Try a tool like Google Analytics to track campaign performance \nSEO reporting tools: Use tools like Keyword Magic to conduct keyword research. And Site Audit to track the performance of your website.\nCMS platforms: For managing and publishing content\nEmail marketing software: For managing contact lists\nSMS marketing tools: For mass communication \nProject management software: To streamline collaboration. And keep teams on track.\nMarketing automation software: For streamlining marketing workflows\nSocial media scheduling tools: Look for tools like Social Poster that let you easily schedule posts. And analyze results. \nImage and video editing software: For creating brand assets\nLead prospecting and CRM tools: For managing sales and customer relationships\n\nBefore you invest in any marketing software, learn about each tool's features. And read reviews and customer testimonials.\n\nContent Creation\n\nContent creation costs overlap considerably with talent, outsourcing, and even software costs. And content creation is often the most expensive part. \n\nAside from the cost of hiring professional creatives, content costs include all the materials, tools, equipment, software, resources, and other incidental expenses involved in creating marketing collateral. \n\nTo give you an idea of content marketing costs, here are some statistics:\n\n$112,000 was the average annual salary for a full-time U.S.-based content marketer in 2023. \n69% of marketers allocate more than 10% of their marketing budget to content\n20% of marketers spend $3,000–$5,000 on content per month\nWhere Are Marketers Focusing Their Marketing Spend?\n\nIn 2023, CMOs planned to increase investments in the following categories: \n\nSocial advertising: 53%\nDigital video advertising: 51%\nInfluencer marketing: 49%\nDigital display advertising: 46%\nSEO: 46%\n\nChange in Investments for Digital Channels in 2023 (Percentage of Respondents)\n\nImage Source: Gartner\n\nIncreasing investment in social media, digital video, and influencer marketing makes sense. Considering the popularity of video-based social channels like TikTok, YouTube, and Instagram Reels. \n\nYou might not shift your budget to new channels right away. But it can help steer your marketing strategy in the long term. And help you choose where to start experimenting.\n\nDownload our free marketing budget template \n\nHow to Develop a Marketing Budget\n1. Define Your Marketing Goals\n\nWith clearly defined objectives, you can identify which channels and tactics to prioritize. \n\nFrom there, it’s much easier to calculate the costs involved. And estimate your return on investment (ROI). So you can allocate funds where they’ll have the most impact.\n\nThe SMART goals framework offers a simple approach to creating clear, achievable goals. \n\nSpecific: Be clear and precise about what you want to achieve.\nMeasurable: Set metrics and criteria to track progress and evaluate performance. Like the number of email signups or conversion rate.\nActionable: Set goals that are realistic. And achievable. With the available resources and time. \nRelevant: Set goals that align with broader business objectives. Like increasing sales and improving brand awareness.\nTime-bound: Establish clear time frames and deadlines. And schedule milestones to measure progress.\n\nFor example, say your goal is to increase website traffic. \n\nHere’s how to turn that into a SMART goal: \n\nSpecific: Improve organic website traffic \nMeasurable: Improve organic website traffic by 20%\nActionable: Hire an SEO agency to write optimized blog posts. To improve organic website traffic by 20%.\nRelevant: Hire an SEO agency to write optimized blog posts to improve organic website traffic by 20%. To increase brand awareness. And generate leads.\nTime-bound: Hire an SEO agency to write optimized blog posts. To improve organic website traffic by 20% by year-end to increase brand awareness. And generate leads.\n\nSMART goals help you budget because you know exactly what you want to achieve. And when. They keep you focused. And ensure you're not just going through the motions. But making real progress.\n\n2. Understand Your Audience \n\nSuccessful marketing hinges on knowing your ideal customers inside out. And targeting them with laser-like focus. \n\nUnderstand your target audience by creating detailed buyer personas. The more you know about your ideal buyer, the less guesswork marketing involves. And the more efficiently you can allocate your marketing budget. \n\nA buyer persona is a hypothetical customer profile that represents a segment of your audience. Buyer personas reflect your target customers’ behavior, motivations, preferences, and problems. And how your business solves them. \n\nTo create your buyer personas, start by gathering data about your current and prospective customers. Use surveys, interviews, and data from Google Analytics. And other platforms.\n\nLook for patterns that reveal their motivations. And pain points. It’s a lot easier to sell a product when you know exactly who you’re talking to. And which of their needs your offer addresses. \n\nOnce you have useful insights, create three-to-five personas. If you try to cast the net too wide, your messaging will not be specific enough to be relatable. \n\nNext, add demographic and psychographic data. \n\nInclude the following: \n\nAge\nSex\nJob role\nIncome level\nGeographic location\n\nPrefer to use a template? Use the Semrush Persona tool for free. \n\nSelect a person who looks like one of your (potential) customers. Click “More Photos” below the images if none of the initial options feel right. \n\nOnce you select a photo, choose one of three templates: \n\nDefault template: A general template for creating a buyer persona. Adjustable to your specific needs.\nB2B template: Designed for business-to-business scenarios, this template can be altered to fit your particular business requirements\nUser persona template: Specifically for detailing the characteristics of current or potential users of your product or service\n\nClick on the template you’d like to use. \n\nFill out the template with details describing your hypothetical customer. \n\nNext, add demographic information. Like age, location, education level, and income level. Complete the sections in any order. \n\nUpload a different photo if you prefer. Here’s an example of a completed persona:\n\nRemember, the more specific your customer personas, the easier it is to connect with your audience. And help ensure you use your marketing budget effectively. \n\n3. Determine Monthly Expenses\n\nIt’s a good idea to understand how much you spend just to operate the business. Before you decide how much money to allocate to future marketing projects.\n\nReview your historic monthly marketing spend. Taking into account ongoing expenses like:\n\nPayroll\nSoftware subscriptions \nWebsite hosting fees \nWebsite maintenance\nMonthly advertising costs\nIncidental expenses that vary month-to-month. Like outsourcing to freelancers.\n\nThe idea is to arrive at a baseline. That can serve as your minimum monthly budget for marketing. Don’t forget to build in a buffer for unexpected costs. Or opportunities. \n\n4. Research the Competition \n\nTaking inspiration from your competitors’ marketing efforts can help guide your own marketing strategy. And budget. \n\nLearn from their successful campaigns. And identify gaps in their strategy. \n\nUse the following tools to analyze your competitors’ marketing tactics. And expenditures.\n\nTraffic Analytics: See how much traffic your competitors get\nOrganic Research: Find keyword opportunities. By comparing your site’s ranking keywords to those of competitors’ sites.\nAdvertising Research: Research your competitors’ ad strategies\nSocial Tracker: Audit your competitors’ social media strategies\n\nFor example, use Organic Research to view details about your competitors' ranking keywords, website traffic, traffic cost, and more. \n\nDrill down into the data to discover exactly which keywords they’re ranking for (and which in positions). Identify their top pages, track position changes, and explore which SERP Features are boosting their search visibility. \n\nAnalyze Competitors’ SEO Results\n\nwith the Organic Research Tool\n\nTry for Free →\n5. Audit Past Marketing Performance\n\nAnalyze data from previous marketing campaigns to identify which channels, tactics, and campaigns were most (and least) cost-effective. At feeding your sales funnel. \n\nHere are some marketing metrics to explore:\n\nRevenue/sales growth: Increase in sales in a specific time frame\nNumber of impressions or views: How many users viewed your content or ad\nClick-through rate: How many users clicked on your content or ad\nConversion rate: What percentage of users completed a desired action. Like submitting a form, subscribing to your newsletter, downloading a file, or completing a purchase.\nReturn on investment: Revenue growth minus advertising costs\nCost per conversion: Average cost of a completed action (number of conversions divided by campaign cost)\nOrganic traffic: Traffic resulting from content marketing\nDirect traffic: Traffic resulting from branded searches. This can signal brand awareness.\n\nThe more you drill down into your marketing data, the more insight you’ll gain into precisely why a specific tactic worked. This, in turn, makes it easier to create successful campaigns in the future.\n\nFurther reading: Top 50 Marketing KPIs for Businesses and Agencies\n\n6. Use a Marketing Budget Template \n\nStart with a budget template that provides guidelines by dividing your potential marketing expenses into categories. \n\nTo better understand the types of expenses to anticipate. And budget for. Plus, it’s much easier and faster to fill out a template than start with a blank spreadsheet.\n\nFree Marketing Budget Template \n\nUse our free, comprehensive marketing budget template as a starting point. And customize to meet your needs. \n\nGet our free marketing budget template here.\n\nEach budget sheet is divided into subsections so you can organize your expenses by category. Like “software,” “content creation,” and “distribution.” \n\nGet as granular as you want when planning your budget. \n\nEach line item includes a field for “Projected Spend” and “Actual Spend.” So you can easily monitor your budget at a glance. \n\nThe template includes a built-in marketing budget calculator that automatically adds up your totals as you input numbers. And make updates.\n\nOur template also features separate tabs you can use for individual channels, categories, or campaigns. For example, you might use the template to create a “master budget” for video advertising as a channel. \n\nAnd use additional tabs to create production and promotion budgets. For each individual video.\n\n7. Allocate Your Marketing Spend\n\nA common way to distribute marketing spend is by following the 70-20-10 rule. \n\nThis means allocating:\n\n70% toward proven marketing efforts that have been known to yield good results. Like blogs that drive organic traffic. Or high-conversion Instagram ads.\n20% to newer or less established strategies that have gained some traction and show promise. Like scaling up your video-based marketing.\n10% of the budget for “moonshot” marketing experiments. These are new and unproven channels or initiatives. That could potentially offer impressive results. Like testing a new social media platform\n\nFor example, your digital marketing budget might account for 70% of your spending. While 20% goes to traditional advertising channels. \n\nThe final 10% might be allocated to something like ordering custom company swag (merchandise).\n\n8. Choose Your Marketing Channels Wisely \n\nPrioritizing the right channels is a key part of your marketing budget. When we say “channel,” we mean every medium that can be used to create an audience touchpoint. Not just different social media platforms.\n\nExamples of marketing channels include\n\nBillboards\nPrinted materials\nEmails\nSMS\nPush notifications\nBlogs\nSearch ads\nDisplay ads\nVideos\nAffiliate programs\nWebinars\nOffline activities and events\nVarious social media platforms \nBroadcast media\n\nHow much of your marketing budget should you allocate to each channel? \n\nIt depends on which channels offer the best potential ROI. For your particular business. \n\nSome factors to consider include\n\nYour business model: Some channels are more effective for some business models than others. For example, the best channel for a restaurant likely wouldn’t work for a B2B software company.\nYour target audience: Different channels appeal to different demographics. For teenagers, you might prioritize TikTok. Whereas traditional advertising media may be more effective if you’re targeting older consumers\nYour marketing strategy: Depending on your marketing goals and past data, prioritize two or three proven channels. And allocate a smaller amount to trying out a new channel. \nYour marketing objectives: Some channels are better suited to meeting certain objectives than others. If you aim to improve your conversion rate by 20%, you might prioritize your website. And email copy. \nYour budget: Depending on the size of your budget,certain marketing channels may simply be too expensive. For instance, broadcast ads may be too expensive for your current budget. Or the CPC may be too high to sustain a paid ads campaign. \n9. Measure Performance and Calculate ROI\n\nTo find out whether your marketing is successful, track performance. And calculate the ROI. \n\nKnowing which channels, tactics, and campaigns offer the highest ROI enables you to fine-tune your budget allocations.\n\nIt’s easier to calculate ROI from some channels and campaigns than others. For instance, paid search advertising with a clear cost-per-click makes it easy to compare campaign costs to total sales revenue. \n\nOn the other hand, it can be a challenge to calculate marketing ROI when you can’t always attribute sales or conversions to an individual campaign. Or touchpoint. \n\nHowever, there are a couple of formulas you can use. To get an estimate of your marketing ROI. \n\nSimple Marketing ROI Calculation \n\nThis formula assumes that all revenue growth is the result of marketing investment. \n\n((Revenue growth - marketing costs) / Marketing costs) x 100 = ROI %\n\nExample: A company spends $5,000 on marketing. And sees $20,000 in revenue growth. \n\n(($20,000 revenue growth - $5,000 marketing costs) / $5,000) x 100 = 300% ROI\n\nThis method is unlikely to give you an accurate idea of your marketing ROI. Unless marketing is directly responsible forall of your revenue growth. \n\nThis is rare but could apply to you if your business is brand new. Or your business model relies entirely on paid advertising. And all your sales are directly attributable to ad spend (e.g., dropshipping). \n\nROI Calculation Accounting for Organic Revenue Growth\n\nThis formula aims to get a more accurate ROI by first subtracting your average organic revenue growth from total revenue growth. This average growth average is calculated based on the existing sales trend in the months leading up to a new marketing campaign.\n\n((Revenue growth - average organic revenue growth - campaign cost) / Marketing costs) x 100 = ROI %\n\nExample: A company with a historic average organic revenue growth of 6% launches a $5,000 ad campaign. And sees $20,000 in revenue growth. \n\n(($20,000 revenue growth - 6% of $20,000 - $5,000 campaign cost) / $5,000) x 100 = 276% ROI\n\nThis method offers a more accurate ROI than the first formula. \n\nAs you can imagine, such calculations become much more complex when you account for multiple campaigns. And channels. \n\nNot to mention the long-term returns resulting from investments in evergreen content and SEO. \n\nFurther reading: Learn more about calculating content marketing ROI or SEO ROI. \n\nStretch Your Marketing Dollars with Semrush\n\nSetting a realistic and effective marketing budget starts with knowing your goals. And understanding your audience. \n\nOnce you’ve completed these steps, download our free marketing budget template. To allocate marketing spend. And measure performance throughout the year. \n\nUse Semrush’s tools, like Keyword Magic and Advertising Research, to get maximum mileage out of your marketing budget. And make your marketing strategy a success. \n\nWhether it’s market research, SEO strategy, content marketing, paid advertising, or social media management, our tools deliver results. And stretch your marketing dollars further.\n\nStretch Your Marketing Budget\n\nwith a Semrush Subscription\n\nStart Free Trial →\n ",
  "headers": {
    "h1": "How to Create a Marketing Budget in 9 Steps (+ Free Template)",
    "h2": [
      "What Is a Marketing Budget?",
      "How to Determine Your Marketing Budget",
      "Common Marketing Costs",
      "Where Are Marketers Focusing Their Marketing Spend?",
      "How to Develop a Marketing Budget",
      "1. Define Your Marketing Goals",
      "2. Understand Your Audience ",
      "3. Determine Monthly Expenses",
      "4. Research the Competition ",
      "5. Audit Past Marketing Performance",
      "6. Use a Marketing Budget Template ",
      "7. Allocate Your Marketing Spend",
      "8. Choose Your Marketing Channels Wisely ",
      "9. Measure Performance and Calculate ROI",
      "Stretch Your Marketing Dollars with Semrush"
    ]
  },
  "images": [
    {
      "src": "https://static.semrush.com/blog/uploads/media/b9/14/b914659913ee17e235f49e2898045379/150ae1ae2f8f84994ed780e33b8611fa/marketing-budget.svg",
      "alt": "Marketing Budget"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/84/9b/849b8f037e3ce73bacec7db008401fce/fc5ca869bc344040d733f5cae1ae9d86/lTOkJ3nimPb3mg-XVY1KNSYGd70MtUci_aIzI2puBJQBdubIII1QozWignXs_kSr6pEmgZarlC6axdC_-2D0LqZG64GwlMXGCrf1zC2j3yWCyaDqCLviA0OgBrd__M9MAcdWVM5lv8uOz5FBAN1Dc94.png",
      "alt": "2023 Marketing Budget as a Percent of Total Revenue (2019-2023)"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/53/84/5384569f9c0664a83966843c439ce5ab/94d8748747f345620aa195cce7c0dd88/z4cqgm7fpxY9PYB9bcMWcCjrewxbaLnHVS-HsQwkjHRyFc4lsprAAUZFF4M0PaTOLIBSYvRS6IgbNgySkgNFZF27g0bPeVgi_nSVG4KjrMrPTE-T0UknjpKYG9_4b3a7bCLUQGC0Mog6zrQ8UiK9SW8.png",
      "alt": "Statista graph showing various industries’ average marketing expenses as a percentage of overall budget"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/93/6f/936f900bc988f7f556c8003a4ef8ca80/5833176eec7ed66f32e6fd8cfd82fa04/E6uD1U0eq4ac_YbGsFY9gtCnAIO3CmR_wVRcdbRWETlY4aw_9Jo1vJMaYmMcfg4S1kVKDSIUpUvUYtHe36bwT8rSa7QkUZArd-eJAGuFhtpd0Lqeu6gELPy7mDNdUIB7Jfom4hWMVFLdTcXmhX7QPZQ.png",
      "alt": "Average marketing budget, as percentage of company revenue, by industry: banking, finance, insurance, and real estate is 8%; communications media is 10%, consumer packaged goods 9%, consumer services 6%, education 3%, energy 1%, healthcare 18%, manufacturing 13%, mining and construction 3%, retail wholesale, 14%, service consulting 21%, technology 21%, transportation 6%."
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/c6/ff/c6ff0401b8dff5ec257865ccfacf6d1b/b7f54694b056b1b2f193526c4f02080e/Npq3O5kTVyVdcHJ8D6brIMhR9v8WPAgRpkT7i6C0J_8WN_h-WfWnQte3aedVNxlGQLIsXlz7qhvviWxCoyb-T-rkWHtQuVK3bHX7I9ym_z6LWNZym2jv5aBIpYtPHSx4h9qDEgW0ERP5R3ICrskgiks.png",
      "alt": "Common marketing costs are seo, software, freelancers, branding, research, gifts, automation, social media, sales collateral, design, influencers, affiliates, public relations, travel, events, agencies, website, communications, content, video, and advertising"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/61/20/6120d3280e066a9b194d0055d6c196c2/f42f091fbe5ac9f1f128dbc05e5b3eab/0hlVaRijo-49t-aoeGUgcm94caDO-FtdM9sVP8n4xCFbxao3Z6Ys9pkglFEe1kKkDiKxcwSicWU9LuCA9U_P4oseBQiuvaWuxafoGe76tn133CoC3Xw0TIFQTdlIjwM4oUROstPE6iDAK6sJvamqm-8.png",
      "alt": "Gartner CMO survey data showing investments in marketing's major resource areas"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/bc/28/bc287a258d16eb71a852a18842774207/58091a657dc42c97d7a6fd51ed2a189f/p-4G_BgL8m9X3uqPBb0s1c7ynoMCKzt-oDOuFShD_4MCRTLfz7b1lWwvnnlDF-miCTseNqWzyZKgbt-tv66NZvN5IZ5lcZRgm1gn3lvVIvFH9KqO5Y5VYPBXgYfjDe32lOgxg0ayuysDQ-yb2bkusI8.jpeg",
      "alt": "CMO Survey data showing statistics for companies that are outsourcing marketing activities to outside agencies, vendors, and partners"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/a7/93/a793ad5cfa73ecda1d0aabb8051ce7c8/34492949f2fbeae2614a51665ffc7bfd/rURrSS4dyWy3AQGq5wKHZVAMKxPcdzqR_GLA-2TnRzb-J2UpqAkzKEsy1yT7N7RsvtlAe6_eiV8qpG_8Di7XtFXoYlwP89Oe3hUZ2h1X1KJmnxxNVgbznrduMvz2UgLDMlJmFf6-tGnQQgS5T25elBk.jpeg",
      "alt": "Survey data showing how much of total marketing budget companies spend on content marketing"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/45/c7/45c7511ebaa96ef9d4dd2a65b188ed84/1867e017df9dc7987c26b5b11a0ddecb/cEBMyhJV4KxkB0nw3VCmWERaINpPaP4KhQm3pp_QYnrT3x3BJ2oaJSfr3mRicTEFVaqHo8P7pskesCon1Iz9fZklTZJ5d4PBjOZASS2CwsyGLUc3Q0MJvlQwdXtcc7F5BYrUIk5e6m0pA7NjhOSVf54.jpeg",
      "alt": "Change in Investments for Digital Channels in 2023 (Percentage of Respondents)"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/63/bf/63bffc6f2e1e0d442a3d24963d41c1b2/d6dc50acbb8949a9e80b31471901850a/AbwKau91S0t1h78JiqexdH47NWarEHm608iwXZgdOI9UCtCKG3wcgPxBhtHqUvzUKOTpCAT4j2_a-qXFcgad8JCEHQ3ysiFw-sCM6na-ooHYJHNjlQ5_e8-HLJRpAQBkZIZq4rt9KaldyZXF-KFm2FI.jpeg",
      "alt": "SMART Goal Setting Objectives"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e8/6a/e86a64dd715abf7cc19eec6a86d84757/7d87c0738a19868a836c6af7119313c8/A4m2g5iEepapGBvFTrGXmHrSZYz6BDmMO_jhUf2cLU84a0cOX17Hhn-8DF33NkSlWFyvYJRZn9ZsX6Yn69uJ4l8sQPU5a6DTCHQ_blvbViajVEWKtUuEew2dXqk_Re3CJ7_Q4PAf0-ve49NSN2NGKDY.jpeg",
      "alt": "Personas templates in Semrush Persona tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/39/bb/39bbddcf1277b7275ba4b3c094ced49e/cc6742148c378270c384aab91746c987/9xnoPgdnkN4QNoSnByN5nKaaQAuRkVfymw0LKL06B-VrnBEW8oxgcq7DLbwEbTSZOKaeR3AdYrnI81ZlbrcvChNmMYqZYaoxRzxk7UDcLoV8KUFVnKXwdMTvydPaljIpbtmNKHkX4nvtTXJ3lwbavsA.jpeg",
      "alt": "\"User persona template\" selected in Semrush Persona tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/a5/aa/a5aa00947c58590e0c30b989c63d2631/7b46976c111a7084b20ced76d3184533/VaZ17O0l5_d-4Abc3LuZevAG6B-c1SBY7od2aRhXTR9lioyi_FHme0_94MY0-SSQ_McMJDGJ0BAao1K7joML02jz97Dl3qt9LwEKJsKVaUOE0I2kMRXyYjL8VPjkN85j-RFk4s5Jzy8nsYP2G6-GQNA.jpeg",
      "alt": "Empty user persona template in Semrush Persona tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/de/16/de16b2ff1be6a232d81ba8bb235cc1f4/dd71537e7d62e3bdb2b9ec586daa7731/dkxe4p5Yr35vFqASCAVw0_Zet5SUX0jS8-L3H71t3g_VCP5cFyHcJv1uIEC0W-R4b2lTj6YXw60iYDaURXaNbZUM2Uq0iDmnIhZR4IlZpeGYoBz2nBPhvQdTILAZBzNSC99-ySjLSETxqAU3xDzPiKA.jpeg",
      "alt": "Completed user persona template in Semrush Persona tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ce/db/cedb35ebbf7437e3bdc80bf093dd05cc/966492f557f77a2daa8fe78776923e57/irSUzCjiu8jqYqf-2hC8RzeuKuYuY_54DEdd48s8Dxp8TJJDqFJDItpdMziexYKBzA3N-EwDvFqdyabWY1IsPTsIkQt898tJ_M-V12C9dnC-O8gpL3yCvieiND4OHUsp-Wtrr27XbXoqByebxtXyDw4.jpeg",
      "alt": "Organic Research tool showing data for competitors' ranking keywords, website traffic, traffic cost, and more"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/39/df/39df996db4d448f746f9f66c7724662e/7d3445cdf05d826dbb334f75f8e6478f/LKZJoutF3s2n9AGs--qH7ocs4d0eYyp7myvc-_7cFqb7JP65G18GKKyHXFpgSGIOUM5wxmVy534_UQvLpVvpTIhUoQAYMG_azqYHtk4H95FA_rgVx1vtBCGxecI07bBEn74lH1-I68d-Z_cX9aqFyus.jpeg",
      "alt": "Organic Research tool showing data for competitors' top keywords, keywords by intent, position changes, and position changes in SERP features"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/1d/2e/1d2ebbcb082613fecce63280b8c9bfe1/9212dbeaa95a091f61a9f47a0899e9a5/zTTB6yUoNhZultytcv8jR4S5ubNsMzh8qPdCrb-WUQes2r1SYcyJt5Hx-yMyI4CnEyG7bRUQIfrH9ccHnlZxAtxTIjKgkeyg3H0NVuwv_AJ4OVkiRDcdj2Ak3LjIU5zFdNguaJ1eoKRdkCd6e3m4NkQ.jpeg",
      "alt": "Semrush's free marketing budget template"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/7c/46/7c467e6271b0cf8cd502bba5ac3857a8/d8534fbf5fbe40b99642ef86a9bc19d6/f6vcPSSs7N_6TBvdHI5ZCb92Y80QY16LooR8pTnC7u2oHLgNv8HwO8jUmGJDqq4vg0917dCkLHAEp7hwlJI_mGdKXdVWxwONKoWSHjOCk1Jc0GblvM1G555DC0M1Z6M4hjjXc26dYqFLtiak1ugBPgQ.png",
      "alt": "Channel budget distribution visualisation, following the 70-20-10 rule."
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/semblog-next-static/banners/trial-gift.png",
      "alt": "Trial Semrush banner"
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&d=Mon%2C%2021%20Oct%202024%2014%3A17%3A50%20GMT&n=4d&b=How%20to%20Create%20a%20Marketing%20Budget%20in%209%20Steps%20(%2B%20Free%20Template)&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fmarketing-budget%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&b=How%20to%20Create%20a%20Marketing%20Budget%20in%209%20Steps%20(%2B%20Free%20Template)&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fmarketing-budget%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://bat.bing.com/action/0?ti=5128787&tm=gtm002&Ver=2&mid=c365b186-b368-492a-8a53-23438abd61c1&bo=1&sid=3dfa42408fb711efafd8870fff463c26&vid=3dfa8e408fb711efadd04d380e321041&vids=0&msclkid=N&uach=pv%3D10.0.0&pi=0&lg=en-US&sw=1536&sh=864&sc=24&tl=How%20to%20Create%20a%20Marketing%20Budget%20in%209%20Steps%20(%2B%20Free%20Template)&p=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fmarketing-budget%2F&r=&lt=1263&evt=pageLoad&sv=1&cdb=ARoR&rn=927402",
      "alt": ""
    }
  ],
  "publication_date": null
}