{
  "url": "https://www.semrush.com/blog/marketing-tactics/",
  "title": "12 Marketing Tactics: Definition, Examples, & Choosing Your Own",
  "content": "What Are Marketing Tactics?\n\nMarketing tactics are specific tasks designed to execute on your strategy and accomplish your marketing goals.\n\nFor example, publishing an infographic as part of your content marketing strategy to increase brand awareness:\n\nMarketing tactics help you appeal to your target audience, maximize sales, and stay competitive. Tactics differ depending on your business niche, budget, and age.\n\nFor example, both new and long-standing businesses post on social media to build awareness.\n\nBut big brands with more resources might also sponsor an expensive giveaway to encourage advocacy.\n\nNote that marketing tactics differ from marketing strategies or goals. Let’s explore how.\n\nMarketing Tactics vs. Marketing Strategies vs. Marketing Goals\n\nLet’s say your marketing goal is one floor up. In that case, your strategy is the staircase and each tactic is a step.\n\nYour marketing goal is a specific outcome designed to help you achieve broader business objectives. For example, increasing website traffic or boosting sales.\n\nBut you need a high-level plan (your marketing strategy) to make that happen.\n\nIf your goal is to increase organic traffic, your strategy may be improving your Google rankings using SEO. One tactic could be optimizing your existing content.\n\nDocumenting your strategy keeps those involved focused on a core goal. It also prevents you from trying too many random tactics at once, which makes it hard to track what works and what doesn’t.\n\nSplit your marketing strategy into several branches to achieve your goals. Break down complex processes into more manageable chunks. So you can track more easily and accurately. \n\nExamples of marketing strategies you could implement include:\n\nDigital marketing \nPhysical marketing \nSocial media marketing \nEmail marketing \nContent marketing \nSEO \n\nMarketing tactics refer to the activities that fall under one of these strategies. \n\nFor content marketing, you might write keyword-optimized articles or design linkable infographics.\n\nYou could even narrow these down to target specific groups. For example, current or potential customers.\n\nPeople often use marketing strategies and tactics as interchangeable terms. And although they have different definitions, they both make up the same staircase to reach your goals.\n\nThese 12 tactics can help you do just that.\n\n12 Marketing Tactics Examples for Every Small Business\n\nThis isn’t an exhaustive list. But you can start on some of these low-effort tactics right now to see results soon:\n\n1. Optimize Your Site for Organic Search\n\nYour website is the base of your online marketing efforts. So make sure it works correctly and optimize it for users.\n\nA Deloitte study discovered that a 0.1s difference in load time impacts every step of the user journey.\n\nImproving load speed can increase conversions for retail sites by an average of 8% and by 10% on average for travel sites.\n\nIf your site is too slow, users who find you via search engines may leave quickly.\n\nWhen that happens often, it increases your bounce rate. This signals to search engines your content might not be worth ranking highly.\n\nSo how do you find out how well your site works right now? Semrush’s Site Audit tool makes this process easy.\n\nFirst, create a project.\n\nRead our guide on configuring your site audit to walk through the steps in detail.\n\nOnce you’ve set up your project, head to the Site Audit tool. Then click “Start Site Audit.”\n\nYou’ll see a dashboard like this:\n\nThe “Site Health” score rates your SEO health. You can see any issues the site has and their importance.\n\nThe tool prioritizes these by category:\n\nErrors are the most urgent\nWarnings need your attention next\nNotices can wait until last\n\nClick the “Issues” tab for a complete list.\n\nYou may find technical SEO issues here, such as:\n\nSlow-loading pages\nMissing title tags\nOutdated security certificates\nBroken internal links\nRedirect loops and chains \n\nClick “Why and how to fix it” next to each issue for a walkthrough of what to do.\n\nOnce you’ve been through the list, you’ll have a fast, optimized site that’s more discoverable to search engine users.\n\n2. Create High-Quality Content Marketing Assets\n\nMarketing assets are pieces of digital content you create that help you improve lead generation and sales.\n\nAll the articles on our blog (including this one) are content marketing assets. Each one targets a different search term. Like “types of content marketing” or “quality content”:\n\nIf a site finds your content marketing resource useful, it may give it a backlink. These external links are like votes of confidence from one site to another.\n\nThe more backlinks you get, the higher you’re likely to rank.\n\nOther content types you can create include:\n\nWebinars\nPodcasts\nInfographics\nWhite papers\nTemplates\nCase studies\nVideo content\n\nSay you want to start with blog content. All you need is writing software (like Google Docs) and a website (like WordPress). Both are free.\n\nIf you’re struggling to create an idea or outline, try Semrush’s all-in-one writing platform, ContentShake.\n\nLet’s say you’re a wedding photographer.\n\nType in “wedding photography package.” Then, hit “Start for free.”\n\nThe tool will generate three ideas for content titles.\n\nClick “Start writing” next to the best-fit option.\n\nArtificial intelligence will draft an outline of your article on the dashboard. Along with suggestions for keywords, images, and data.\n\nYou can use it as much as you like. Then, customize your article to fit your company specifics, brand voice, and audience.\n\nTip: Semrush’s Topic Research tool can generate relevant ideas for engaging content. Then, use the Keyword Magic Tool to target the right keywords.\n\n3. Give Out Free Gifts with Your Products\n\nOne of the oldest marketing tricks is to include free gifts with orders.\n\nThis strategy uses a psychological tactic known as reciprocity, in which we exchange things with others for mutual benefit.\n\nFor example, SourceBMX gives out free stickers with every order:\n\nThis low-cost marketing tactic is targeted to its audience. Cyclists love stickers for their bikes to make them more eye-catching and identifiable.\n\nThe more you spend with SourceBMX, the higher-quality gift you get. From bike accessories to valve caps and clothing.\n\nWhen you offer value upfront, people tend to give something back. If you give out a free sample of a new product with an order, customers may feel more obliged to buy it.\n\nEven if they don’t purchase right away, you still begin building positive relationships with prospects. \n\nAnd long-term loyalty and advocacy can set you apart in today’s competitive marketplace.\n\nSome examples of free branded gifts you could offer include:\n\nStickers\nTote bags\nT-shirts\nCandy\nMugs\nCoasters\nStress balls\nMagnets\n4. Encourage User-Generated Content\n\nUser-generated content (UGC) is content that customers—not brands—create. In marketing, it usually refers to social posts people share about your company without you paying them.\n\nWhy is it such an effective marketing tactic?\n\nBecause people trust other people’s opinions more than brands.\n\nAnd for people to buy from you, they have to trust you.\n\nThis free book we sent out to #SemrushChat contributors became user-generated content:\n\nIt allowed us to thank a dedicated segment of our audience. And gave us some extra visibility on X (formerly Twitter) when they thanked us back.\n\nThe type of user-generated content will impact how much it costs and how long it takes, but in some cases, it can be low-effort and low-cost. \n\nIn others, it can be time- and cost-intensive. So you have to decide what type of user-generated content could work for you and your budget.\n\nAlthough you might not have the resources to print hundreds of books, that’s not your only option.\n\nHere are some free ways you can encourage people to create content about your brand:\n\nUse modern design or packaging that customers want to show off\nShowcase different use cases for your product on social media that others will copy\nStart a branded hashtag campaign and include it in your bio\nLook at your existing UGC and find trends you can double down on\nHost a UGC-focused giveaway or competition\nOffer discount codes for anyone who takes part\nFeature your favorite photos on your site or social media platforms to generate awareness\n\nThe more visibility you get, the more user-generated content you’ll acquire naturally. Offering aesthetically pleasing products will give you a good head start.\n\nPro tip: Keep up with any company mentions and find UGC in real time with Semrush’s Brand Monitoring tool.\n\n5. Use Paid Digital Marketing Channels\n\nPay-per-click (PPC) advertising is a digital marketing tactic where companies pay platforms to host their ads. Each time a user clicks on the ad, the company pays a fee.\n\nYou can use these ads in addition to organic content to increase your rankings in search engine results pages (SERPs) and get more traffic to your site.\n\nGoogle Ads (previously Google AdWords) is the most well-known and popular PPC platform.\n\nThe results you see on top of the SERPs with “Sponsored” next to them are PPC ads:\n\nThe tech giant relies on these for much of its revenue. In Q2 2023, the platform made $74.6 billion—$58.1 billion from Google advertising.\n\nYou can use PPC advertising to target important keywords in your niche. Or as a unique way to stand out from your competition.\n\nFor example, when Londoners search for competitor gyms, they see a cheeky PPC ad from Gymbox:\n\nThese one-liners are a clever way to increase the gym’s brand awareness within its local target audience. \n\nGoogle isn’t your only option, however. Here are some more PPC platforms:\n\nBing Ads\nFacebook Ads\nLinkedIn Ads\nTwitter Ads \nBidVertiser\nRevContent\n\nThe platform you choose will depend on where your target audience is. If your target demographic is teenagers, LinkedIn is not likely your top choice.\n\nOnce you know your audience, you can target them with the right ad in the right place.\n\nPro tip: Check out our PPC Toolkit to help you plan, analyze, and optimize your Google ad campaigns.\n\n6. Launch a Referral Program\n\nA referral program encourages customers to promote your business in exchange for rewards. These rewards could be money or merchandise.\n\nWhy is it such an effective tactic?\n\nBecause happy customers and positive word-of-mouth marketing are your biggest assets.\n\nNielsen’s Trust in Advertising latest report confirmed that 88% of respondents trust recommendations from people they know the most.\n\nIf customers share great experiences, they want their loved ones to experience them, too.\n\nOf course, they will also share any negative experiences so others can avoid their frustration.\n\nEco-friendly cleaning brand Branch Basics teamed up with ReferralCandy to create a referral program that generated more than $1.5 million in sales.\n\nThe team used a simple formula:\n\nNew customers get $10 off their first order\nReturning customers get $10 off their next order if they refer a friend\n\nOver two years, the campaign drove over 21,000 social shares and 63,000 store visits. Both of which helped increase sales and grow the brand.\n\nYour referral program should offer something truly valuable:\n\nPoints for rewards\nDiscount codes\nA free month’s subscription\nCash payments\nAccount credit\n\nWhatever makes the most sense for your business.\n\nAlready have a referral program that no one knows about? Create a popup on your site or share it in a newsletter.\n\n7. Reward Your Loyal Customers\n\nEncourage retention by recognizing and rewarding those responsible for repeat purchases. Unlike a referral program, you don’t ask for anything in return with this marketing tactic.\n\nIn a 2022 PwC survey, one-third of respondents said human interaction was a crucial element of loyalty to a company. For many types of businesses, that number increased to over 50%.\n\nA reward system adds a human element that proves there’s a person behind your business who appreciates their customers.\n\nFor instance, Good Pair Days is a wine subscription service that offers multiple benefits and rewards for loyalty.\n\nFor every box you buy, you collect points that lead to limited edition merchandise and special pre-release bottles.\n\nIn addition, participants get free samples, birthday wine, and anniversary bottles. Your points remain if you pause or cancel your subscription.\n\nThese bonuses are some of the reasons customers rate Good Pair Days as 4.9 out of 5 on Trustpilot.\n\nThat type of system may not suit your setup. But there are plenty of ways to reward loyal customers:\n\nLaunch an exclusive beta or early access service\nSend out new products for them to test\nOffer discounts for multiple purchases\nCreate a loyalty card program\nBuild an invite-only community of fans and ask for feedback\nArrange an in-person event\n\nFirst, determine what makes your product or service valuable to customers. Then, work your rewards around that.\n\nIf it’s for a long-term subscription business, offer a free month. If you have impressive branding, give away cool merchandise.\n\nIf you’re not sure what will resonate with your customers, ask them. \n\n8. Use Social Media Trends and Challenges\n\nSocial media trends and challenges are sound clips, dance routines, or video formats that encourage user participation. You can use them to attract younger audiences and show off your brand’s personality.\n\nBecause so many people get involved, they often go viral. Viral content increases brand awareness and allows you to identify new customers. \n\nThe TikTok challenge “Flip the Switch” involves two people switching outfits to Drake’s song “Nonstop.”\n\nWhile the song plays in the background, one person turns off the lights to the lyrics, “I just flipped the switch.”\n\nWhen the lights come back on a second later, the duo have swapped clothes.\n\nThe more entertaining and funny social media content is, the better. People like to make other people laugh. Which is why this trend works so well.\n\nYour brand can get involved in popular challenges and trends such as these.\n\nIs there a song or audio clip that would make sense for your business to use?\n\nLet’s say you’re a florist. You could create a video using the trending TikTok song “Flowers” by Miley Cyrus.\n\nYou may not go mega-viral. But you’ll likely get more views and engagement than you would if you didn’t take part.\n\nCan’t find a suitable trend or challenge? Create your own, as Chipotle did.\n\nThe fast food chain pushed the hashtag #GuacDance. Then challenged its followers to dance for free guacamole using a sound clip from YouTube children’s entertainer Dr. Jean:\n\nOver six days, the chain received over 250,000 video submissions. Thanks to the promotion, Chipotle served more than 800,000 sides of the condiment alongside orders in one day.\n\nChipotle is a huge brand. But it uses an accessible idea: an annual event or day that relates to your business.\n\nThere are plenty of them out there you could use for inspiration.\n\nFor example:\n\nFestival of Sleep Day (January) \nWorld Compliment Day (March)\nEat What You Want Day (May)\nWorld Emoji Day (July)\nWorld Tourism Day (September)\nSmall Business Saturday (November)\n\nBrowse through viral brand trends, songs, and events to see where it makes sense to get involved.\n\nThen, break down what makes your product, service, or audience unique and create a trend or challenge around that element.\n\n9. Partner with Other Brands\n\nA marketing partnership is when two or more brands collaborate strategically to achieve a goal. To be successful, both companies must have a target audience segment that overlaps.\n\nFor example, female skate collective GRLSWIRL recently collaborated with female sports brand Roxy.\n\nThey created an ecommerce campaign for co-branded products:\n\nAnd the partnership extended to a relevant content marketing series called “Skate Diaries”:\n\nThe goal of these retail products was to increase Roxy’s physical sales. (GRLSWIRL may get a commission.)\n\nBut the smaller brand’s campaign goal was likely to increase traffic and brand awareness through its partnership with Roxy.\n\nBecause both brands focus on female-led sports and apparel, they were a perfect marketing match.\n\nAre you a solo business owner? \n\nPartnering with another brand can temporarily expand your marketing team. You get all the resources and experience of another company without paying for it.\n\nBut don’t work with direct competitors because you risk losing business.\n\nInstead, choose another company in a related niche that shares your marketing goal. For example, building your Instagram follower count to increase website visitors.\n\nFor a drinks brand, choose a complementary food brand. If you run a marketing automation platform, team up with a behavior analytics tool such as HubSpot or CrazyEgg.\n\nPro tip: Considering partnering with another brand? Here are our tips to find partners to improve your marketing strategy using One2Target.\n\n10. Host a Contest\n\nRun a contest for increased brand awareness, engagement, and leads. You could have one or several winners.\n\nFor example, Brisbane City aimed to raise awareness to encourage tourism. The online resource ran a Christmas competition to win one of 12 unique stays.\n\nThe team expected around 1,500 entries. They collected 7,285 leads. And the Brisbane City Instagram account gained more than 2,500 new followers.\n\nWhy are competitions like these so successful?\n\nBecause winning alters the chemistry in our brains. It triggers the release of the feel-good chemical dopamine. And when we experience it, we want more.\n\nWinning contests satisfies this need. Plus, we get something for free.\n\nThe Zero Price Effect is a psychological principle that dictates that we magnify the benefit of free things. The lower the effort, the greater the temptation. Sharing a brand’s story on Instagram is a low-effort example.\n\nYou’re already a step ahead if you can offer a great prize. You could also partner with another brand to double your resources and boost both your visibilities.\n\nHere are some of the contests your brand could run:\n\nIncrease social media follows: Tag a friend and follow your page to increase social media followers\nSign-up with contact details on landing pages to gather lead information\nCreate hashtag challenges on TikTok or Instagram to improve brand engagement\nEncourage user-generated content to showcase unique product use-cases \nSocial media trends or challenges to raise brand awareness\nCustomer giveaways to drive conversion rates and sales\nQuizzes or trivia to gain user insights about brand knowledge\n\nUse the type of contest to glean something from your audience. Whether that’s contact details or social media content.\n\nIt’s also an opportunity to present yourself in a fresh, creative way. Plus, gain new customers and reconnect with existing ones.\n\n11. Leverage Influencer Marketing\n\nInfluencer marketing is when businesses collaborate with individuals who have a substantial social media following.\n\nPeople use their influence (hence the name) to promote branded products and services.\n\nHave you ever come across a person’s post on Instagram that says “paid partnership” or “#Ad?” That’s influencer marketing.\n\nThe Influencer Marketing Benchmark Report 2023 estimates influencer marketing to be worth $21.1 billion by the end of 2023.\n\nHere’s an example from Rheal Superfoods and influencer Nicole Robinson:\n\nNicole’s followers can get 20% off Rheal products using this unique code.\n\nBrands offer influencers some kind of incentive to work with them. It’s usually financial but could also be free products.\n\nIn exchange, you get to win your customers’ trust and expand your audience. That only works if you choose someone whose persona matches your brand values.\n\nFinding the perfect influencer can be tricky.\n\nYou need to analyze your competitors’ accounts and hashtags to see who they work with. Then, try a dedicated tool to compare performance metrics and outreach tactics.\n\nSome of our favorites include: \n\nUpfluence\nTraackr\nInfluencer Analytics\n\nYou can narrow down your best choice from Influencer Analytics' database of over 29 million YouTube, Instagram TikTok, and Twitch influencers.\n\nLet’s take YouTube.\n\nHead to “Influencer Discovery” and select “YouTube.”\n\nClick “Filters” on the top right of the dashboard.\n\nChoose your filters, such as ideal subscriber count, category, and pricing.\n\nInfluencer Analytics then returns a list of results based on those filters.\n\nClick on each influencer profile for extra facts and contact information.\n\nFound your perfect match? Send them an email or direct message with your proposal.\n\nHere’s an example:\n\nPro tip: New to influencer marketing? Check out our full guide to email outreach. (The tactics can work for social media DMs too.)\n\n12. Go Against the Grain\n\nGuerrilla marketing campaigns rely on unique and unconventional displays to drive publicity. Brands use this marketing tactic to raise brand awareness with a large audience.\n\nFor example, to promote its crime drama “The Sopranos,” HBO drove taxis around the city with a fake arm hanging out of the trunk alongside an ad.\n\nThis spooky tactic might have caused a few 911 calls, but it cost next to nothing and created a lot of buzz.\n\nIn more recent times, rapper Childish Gambino’s team marketed his new EP “Summertime Magic” with free ice cream.\n\nAs New Yorkers lined up for free treats, the team blasted songs from the EP on a loudspeaker.\n\nAlthough this wasn’t as shocking as an arm hanging out of a taxi, people didn’t expect it. So it stood out against their daily activities.\n\nBoth of these examples are from big brands. But the only major cost was Childish Gambino’s ice cream bill. Apart from that, they’re low-cost and accessible.\n\nYou need a strong value proposition for a guerilla marketing campaign to work. That means a unique reason why customers should choose you over your competitors.\n\nFor example:\n\nThe Sopranos series is shocking and unexpected at every turn\nChildish Gambino’s ice cream lets you hold “Summertime Magic” in your hand\n\nOnce you pinpoint your own, you can work out a way to stop people in their tracks. Interrupt their day without frustrating them and you’ve nailed it.\n\nYou could:\n\nHand out sample products\nPlace empty packaging around town to catch people’s eye with your striking branding\nHold a popup shop in the street somewhere unusual (with the right permissions!)\nGet a local statue to wear a branded product (again, with the right permissions)\nHow to Choose the Right Marketing Tactics for Your Business\n\nThe right marketing tactics for your business depend on multiple factors, including your industry, budget, and audience demographic.\n\nHere’s how to pick the best-fit tactics to complement your strategy and goals:\n\nNarrow Down Tactics That Fit Your Strategy\n\nYour marketing tactics will depend on several factors. Use these to narrow your focus:\n\nYour time frame\nYour budget and resources\nYour target audience\nYour applicable marketing channels\n\nThen, create a list of general marketing tactics that fit your focus. This could include sending an email newsletter, arranging a competition, or creating free samples to include with orders.\n\nWe’ll narrow these down in the next section.\n\nChoose SMART Tactics That Fit Your Niche and Product\n\nUse the SMART methodology to consider your niche and product. It stands for:\n\nSpecific: Narrow down “arrange a competition” to “arrange a latte art competition over TikTok with a $100 prize”\nMeasurable: Make sure you can track progress accurately and know when you’ve succeeded\nAttainable: Choose achievable tactics that you have the resources to pull off confidently\nRelevant: Choose tactics that highlight your unique offer and help you achieve your strategy\nTime-bound: Ensure you have a deadline to stay motivated and know which tactics to prioritize\n\nDefine your marketing strategy and tactics with the SMART methodology to create your focused list.\n\nLet’s say you’re a realtor. \n\nIn this case, viewing hundreds of relevant LinkedIn profiles to get contact requests and build your network will likely work.\n\nThis tactic won’t have the same impact for a business-to-consumer (B2C) brand. But a public stunt for attention (with the right product targeted at the right place, such as in the above examples) could.\n\nIn the case of business-to-business (B2B) brands, you need initiatives that cater to a longer buying cycle.\n\nCreating SMART marketing tactics helps keep your strategy on track. And a successful strategy means you meet—maybe even exceed—your marketing goals.\n\nAll Marketing Starts with a Credible Website\n\nYour website is your digital marketing strategy’s most critical tool.\n\nStart with a Site Audit to make sure it’s in tip-top shape. Then, move on to creating keyword-optimized content using the Keyword Magic Tool.\n\nAs a bonus, the relevant terms it reveals can inspire ideas for the other marketing tactics on this list.",
  "headers": {
    "h1": "12 Marketing Tactics: Definition, Examples, & Choosing Your Own",
    "h2": [
      "What Are Marketing Tactics?",
      "12 Marketing Tactics Examples for Every Small Business",
      "How to Choose the Right Marketing Tactics for Your Business",
      "All Marketing Starts with a Credible Website"
    ]
  },
  "images": [
    {
      "src": "https://static.semrush.com/blog/uploads/media/ac/50/ac50e5b00606572ad11dd4b4188554ab/12d3fac7f4fdd19db1943446ca6909bf/marketing-tactics.svg",
      "alt": "12 Marketing Tactics: Definition, Examples, & Choosing Your Own"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/a3/ae/a3aeb6f4ba8e8bdad9e268d38b2e1aa7/cb93041a2312cf1f0ed4142a298668d8/SEO-Copywriting-Infographic.png",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ed/3e/ed3e26290b72bfda97663fc9e400a9de/qfj0P8W5KL05I-C4HmxFsC1c5SE_29SH5gOziX06BcolrqqxhishTn4MXt0BgiboECtt1340tVz28mngZuNayUAQbyE2OVtegTmXd43Zz-Vh_fZxK8XiGkIF2qHhS1y3hQCoOGNS4vb7RgeTqIOb5D0.png",
      "alt": "an infographic showing what marketing strategy is"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/66/e6/66e6695c61c9b6f291f167e3bf7679b0/nhBaMi9hNfPaW7dnmXvyMRr7Aw3T_ZWQIB0_6sZTfPw6KpFDrs4V3YoSa95em31id6axJDjHB_zLYE2Yo7M_KXWiGcp9Aw_FZHk0lpCCcjjx_PqJ7v5jiMMMbqxlJz2_Mee-vkjdQ9a6vv62-64b3no.png",
      "alt": "\"Create project\" button in Site Audit tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/74/42/7442da0570c59b2125fd549b2a24993d/QSU_isrN29udTj0nX_XhYFIrf7Jo2zV9E7nGvLPXLnuxyxwTD_qdypdUYR48spCEHjKdeXsDxOm4VQS0vJ4yqibd3JFNZggaTe6Aiqq26ObXJXhCm_f9KtKHpqMqaMVmgM4KUS_AjhGqm39SKqIzb8U.jpeg",
      "alt": "Site Audit Settings pop-up window"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/b6/fd/b6fd4269eef0e97abd7d78e6a88625e8/Jyt1jK4bbBhxtk3F4OzTd7lUvs39jJ9Nz3IrEp0BLbAHAJ8MxtQo_NeA3CmTjDXkw9JILN9c4tFkzjKGDzciJot38qUv_7cSreyJnvUDobskjWtNjEElQIdNMSFNBOnyl2CwDtca_a79r8QkH484hY8.jpeg",
      "alt": "Site Audit dashboard"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/62/33/6233eae1a19d559138f3328ae985808d/UIk7z7NvCXPMvIH06oVV2pRdODh4H9H6U1E_4rRL_oHvmkWtSorbEyvDJvuquPdd9RMLTlrR9Fg6rgUPEanAT6Rz-vLHssfkYhrp44BHjZ9hG8QGPRnD7COLjmseI3By0mq93OU-FiVSwcbCjVAvkaw.jpeg",
      "alt": "\"Errors,\" \"Warnings\" and \"Notices\" scores highlighted in Site Audit dashboard"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/38/ec/38ece5aeae72281afbdea1a2653d4307/PsaN8qmEpELEbBEjq_6u_4WE7RsHVnvJADM5BO0JockNk0FjaAKLbR4C7LwhXqzpAkiyYD_px1ZFLXPKran5PMew0-hDt6P1Ms6-kJj4Qfx9B8NNtdKvswpndOPZ0aqEbIplahKrarbnebMHtV76-ps.jpeg",
      "alt": "\"Issues\" tab highlighted in Site Audit"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/b0/a7/b0a702eeb9706324ecb4dafb3c367055/WRSaBvEk3h3GwbRrqh44UAJ8U2k7_HyNlgdI1taaj2dIqjUSphz3BcOoiAHreqcMA9odjbrIo1uLH0Jy7usA2kcjCp1yYhdBN8YYqtubtPS5uOOmfZYdIrivrUT_fY9xUQhzhxKoyJIS2aHgSYc321U.jpeg",
      "alt": "An example of “Why and how to fix it” section"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/cf/33/cf3325f246348b6770134e4f88a674a3/Md8lGIVAo0ofOqCHbyzdQF6ntHLxPGYuC5IiKJmzAz4zGTmaTqfOSRjeffHVsBKxjpTIlshotISAEig-mnS9EY_ZBVdXizVyFtvy-0Daum6X_pV4KnvfGG2XrH5_YlhiOFpWIKv-vHlnxvNZogsINO8.png",
      "alt": "A screenshot of two articles on the Semrush Blog page"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/0c/58/0c5828449225eca7782b015894b576df/j8UCsyI7qQGtbNitaldQDnXwrRYgh8NfCTumY05F9YVax2bqtMHbJzwZjim7jOW7JO_V62iYaYiupyEFR6RalJTZKRQASKtDY0yz4znAJ5-PRAIjl_y9nGlnL2jWs-v7JgYpKEYC0bH7wNqsBSHFjIE.png",
      "alt": "“wedding photography package” entered in ContentShake search bar"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/30/52/305283a1153e6436f6df7d70c323e8b5/TOSLEGagPjPHmSrp-XNGufm8BYoNYv84vTOeIGZEhPttAT_Y1O61D8ON2Gm6TyiCS8CPU2Vi2j_ChJ-H8B79Rbd0RVGJwZtTuQty8AGt12q_8Rs0sbNheiMkEWRHP96CNqoDxlJsdVjGspKv3yXqjAg.png",
      "alt": "Title ideas in ContentShake"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/21/a0/21a0d370e8d70c6a654450663d9d49b1/6EAcMYWFY6vG5jkSqLJEbsDQdXcBTaYEDlymvTL-3LpLt5fAWIJuZwwpUqyXF_UHLQlplsKUmf6eb7AZqGxtSEbHPWMusN6CiVAxHnTxs-cjA8w4d9tUOsKtdGoh1Uur5mR29JBqZlDh7-KmHMyfWUA.jpeg",
      "alt": "An outline of the article for a chosen title"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/86/db/86db0300e6474a3b6cf185d7c64bb2f7/0rTVQnwjTxPMKy7-1L6k0rHt00bFBgrnllHXlRMXrSYHV3bl2upw_e9SPvXOHzJSdEBuZJHxNI7izf-WJmH4Hq2TbvV2WXR5uGwdudapXaplJ0VS9vFwp1hR7dY3zLvZ5lz2PSkQvwKuLm-FB8FUERo.jpeg",
      "alt": "SourceBMX gives out free stickers with every order"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/70/b3/70b34b5cb6111adeea0c41827aeca7ca/9lXa3h_NWn8EeRDhvnUklTjq83fksaJxXLMW6d4IYtUd_vLmzmWNHEuSuqIP22ilJ1uPCjkADPZxAekzVbwMOd5-rvOXTFKZEspjD7mleLltRgPXnNnnfWMCiISs5-cDNpkhDup5jp2vWw7wH98cDJA.jpeg",
      "alt": "A post from the user \"Mellisa Fach\" thanking Semrush for the book she won"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ef/a9/efa92ccff54a18fc34a9339bfdf62e4e/hTnK4dq59lEwmdJLnKBEAymNxZ96jqQrBT8SFGb8K8sBRzKMdiEgMNSOakkZg1IYrEbI5bmiBE81bjX3daL2B0C1lW45FyUg33kOdjquc4Zj9CR2kzpLv39veqhvpTSOrV2BEpbmLmTJShhpSxIPAJw.png",
      "alt": "Google SERP for \"mid century modern lamp\" search with \"sponsored\" posts highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/8d/ea/8deaf34ce080c47129ab11a9b4995e71/5oF6rLYcZssRlWAiALWJSsBwtx9n1nv--vcXc5bAGGnFQheuI-laDQa5h6Vri5klskWEkKdC1au5zwVGA-iXUk-zeR1Yt2GEOlX1Co5QaA25GqrZXJ5ZEnLA3jokU7DQGyyj8AFMpZbLDGgvuJhQlLo.jpeg",
      "alt": "Google SERP for \"third space gym\" search shows Gymbox PPC ad as the first result"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/5e/e0/5ee0e55ec04aa23ffaeb2a60c7a0417a/e3QRKhi5mFD4wSU-Ehhhjcuy-i8QZFGTPM2BhbseMD_zB748X2I2wKtM_IgzwBjvZRlwPXHvaBGOhQhi0IlkKeFQXHqmhFFXcCzh7t1p6clJGYH4iYbfkQyyunqzgqB2mtmdnlCK2PeyjIA4vwt2i4I.png",
      "alt": "Branch Basics referral program page"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/11/2d/112d02542f0b6f0c2aa890c46f36b751/Lquwdc-upG2moY1hCKLfu8FG6cRiJa31QfAIvhe0bAO-gijwrQCCN9AKVOKCPcdc-sOiuHtKOaLOvqUsZu3iz-Ozy1n7yLwbGVopJwKB4jK4onP_h5eI3uyC53ScxKIskWaG-UGKFkaf5PPSOmLbWw8.jpeg",
      "alt": "Good Pair Days’ merchandise page"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/09/e9/09e90b92a05ecaae6eaece13c9780af3/rPniYq-F6V-hlRqddoHpCRb8_iYp-xWY7KD1ROJC4_H9nlv5PN2imDXOQzgBoCaqLYDBpwISIAy21TotPpYbb92seT6GqfzvklEaJpHO86ceR_NZfNVhh1-ZdEeeuBlNFYA7UMICDx-Zsyifecr_JiU.png",
      "alt": "Good Pair Days’ rating on Trustpilot"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/00/fb/00fbb7cf798b7e210005f33471aa60df/TeoqwOcrBZ49DOYUkmTRouq0uZaT_RGQwODnWa_M8XHkAs3H2RE0Y5OY0e4DPSz-HAPl3qlyTiNiO5anTiFqPzZwbyRhMAF_UVTyBkCxbw5Zp76dHzHT6Z6C704kP5SFgRRxhoo_cP0uzNqscmCV-MQ.jpeg",
      "alt": "Two people in the TikTok challenge “Flip the Switch” in one outfit"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/d6/87/d6871e853c5897ac32fbcc8b33a97899/KFYIUyfmxHDrQXE4q3dIZdMetwQm-e41A8b-pVDEKr5T3m6G3LfPs8p4wTGDX5vdf9IKm3T3BsXbto-XBtABO1DItsC64fN_RGgpsieejzcuUhKLVAzI9CjGuHzKHX98MGGm3V5jS7gjSK5jPJJfJRU.jpeg",
      "alt": "Two people in the TikTok challenge “Flip the Switch” in a changed outfit"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ca/94/ca941d2e2292d8b273ca9f94c0316a82/hxA9pUehGqzUa7S8DREZvI2fuJTntt6A6LXJnRxiNpSN0iJ_ZbPsxNNleyQOjpN_t2TWA80_nMc2ab90mrr9bWRHx3NTNANfVeuDu6zlrNRPMqUvwkJ-3JJFpaklEIYrUDIHIwcct-xMUYxorLAHJOA.jpeg",
      "alt": "Chipotle’s #GuacDance challenge"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/28/0d/280da6114f5a035e1aaf154846acf3d5/3EUx2o7W8Sng_uJGGFF0oJbIQFTykrbdOYoM1InA8EyLUhgcQseYwAf2Rh3oe0YF-pUd8yzLb0TpL_jjHyPmxu_j4QejYgEAB_4zq76geVvraeKVtwz1D3FDZ5fyDPL-u7La2oW-Eb8lzDBoBqblM38.jpeg",
      "alt": "GRLSWIRL and Roxy ecommerce campaign"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/2d/7d/2d7d41a87b5ebf76ed3f379780b11197/9_lMlceRfIwMBicMpqVDXk408UoCrRlXao2fVfq0C8kfz5LWnj3Bez0u8jQOx0o3E_LQEFZSGNS1Fuc1YmndIs0hhLnt171tR2nhsEN4z5rDY7d1D2tKHlDs2ToJZKCqARhcBd8kYj6KferKN18qoL0.jpeg",
      "alt": "Roxy & GRLSWIRL \"Skate Diaries\" YouTube thumbnail"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/f5/0b/f50b004e60d29066bef2e7c25c638768/E8SNn0n6QyE29jYH86T9Whuun_fkkGDHEADkSbCW4QX_Ycj8T6pCuyFYFWIEQlsTWOKm8j7Pd7q1BTj34souLBdA1CAy7gghebf0ka3RY44isWePicK3mcHkrBPGh4qgN0Kso2e7TTGoAPzDhOEXKZg.png",
      "alt": "Brisbane City’s Christmas competition page"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/8a/8e/8a8e86e7554b9ea74d0c3f3e07e2921e/DyUultw1a5DGBjulsE-yyKuVIXSuojQoLP9bi5MTA9eq2JN0pvQbWn2uv9zkw-DXTTqsSILBROr-qHeQu_rQ6RhCSUdZnpUmHT18BjXpG_n-bAzzp5Tq2VF8ooRN0RRjBkFtBHUni-HOeuOg39DFH8A.jpeg",
      "alt": "Rheal Superfoods’s sponsored Instagram post with Nicole Robinson"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e0/2a/e02a18453ce344164efa6775700dfe1d/0d0c96dd57555587697eb591d9078701/image.png",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/8d/da/8dda61fd0c8902fb3796b4079caeeb7f/937a01afef5cdb233d9cb1cc1d05ca37/image.png",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ae/0a/ae0ac46cd378660575c04bf5f675f079/500451cf090de2909854e91ed1a15025/image.png",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ce/78/ce78e7d42a8d66290d79f05184c4fe1b/WM1OeUfo7CrJl2l23DO-xT8ZfeoL3rC0aQpUH66tUUvTXaU6CQHyq0s71IYj5qnF0umnH_NJmJTFWEJZkx-MuetfqjYPIihBGK-KUdkU933RRTOv1-Ril1jxOuIVwKatkuIAmcGaUkyh9Lf21tmUFVI.png",
      "alt": "An example of an email reaching out to an influencer"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/77/45/7745f466c852e816c46189a0aaaf5c7e/6v0GoO9dIQRDP-89JrZwiDyL1BuBKp0NF0E3fuGi_BpMZkriHABd8YguRd9bJi3huF_X1QVgmcb6czkqOLbEyRdxPDel-3DF4Jrg2FS2n4uIANBselefTichwPZ_CTMkKbVwPphEzmGegdcZLNCH66E.jpeg",
      "alt": "A taxi with a fake arm hanging out of the trunk and an ad for \"The Sopranos\""
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/f3/2f/f32f3d0540eb30a8780c8d5d54096d55/U_Z6sQej7rr474-bcOw_9Fy0SnKzQYGUokTbNXsxc88WPYIspesJVRCinDb9kweBkiByTWbVBdLHfLUp5yIbjrsNL0PiwvjYmBYZAPUJeGJj1LcsDPgHYi-8PRSjMMsvPZNN3m3GTDpKSPUeAD3NOdQ.jpeg",
      "alt": "An Instagram post of “Summertime Magic” with ice cream"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/3c/73/3c734271eda14ff06f5d1b523f8f27fe/vQME25RBtuCZgiuCD9NGGU-eP4hotC-KTrtqmHWzYcR5xZHj_3j8nNoybzggEakF2qmswdKjJ1WsAcNo56wuiFFQ8AswumAZPMdUHiGlx91-ddMH7LmMFvaqMm-oSNmaxA0A4oPCheaoJNAIkYR7ygc.png",
      "alt": "An infographic explaining \"SMART\" marketing objectives"
    },
    {
      "src": "https://static.semrush.com/semblog-next-static/banners/trial-gift.png",
      "alt": "Trial Semrush banner"
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&d=Mon%2C%2021%20Oct%202024%2014%3A10%3A23%20GMT&n=4d&b=12%20Marketing%20Tactics%3A%20Definition%2C%20Examples%2C%20%26%20Choosing%20Your%20Own&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fmarketing-tactics%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&b=12%20Marketing%20Tactics%3A%20Definition%2C%20Examples%2C%20%26%20Choosing%20Your%20Own&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fmarketing-tactics%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://bat.bing.com/action/0?ti=5128787&tm=gtm002&Ver=2&mid=5cba0320-93c0-4b5c-ae7c-3aeaa13ec24f&bo=1&sid=22686d408fb611ef811d7faedf58f631&vid=22713d808fb611efb055ede466cb64e2&vids=0&msclkid=N&uach=pv%3D10.0.0&pi=0&lg=en-US&sw=1536&sh=864&sc=24&tl=12%20Marketing%20Tactics%3A%20Definition,%20Examples,%20%26%20Choosing%20Your%20Own&p=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fmarketing-tactics%2F&r=&lt=877&evt=pageLoad&sv=1&cdb=ARoR&rn=387057",
      "alt": ""
    }
  ],
  "publication_date": null
}