{
  "url": "https://www.semrush.com/blog/marketing-plan/",
  "title": "What Is a Marketing Plan? (How to Create One + Examples)",
  "content": "What Is a Marketing Plan?\n\nA marketing plan is a comprehensive document that outlines the marketing strategies and tactics a business uses to promote its products, services, or brand to its target audience. It also includes information like target market, value proposition, proposed marketing campaigns, and success metrics. \n\nTo create a successful marketing plan, you need to conduct thorough market research.\n\nThis helps you understand your market, target audience, competitors, and industry trends. With these insights, you can create customer-focused marketing campaigns that get results. \n\nAs you create a marketing plan, the Semrush .Trends toolkit can speed up your market research process. It features multiple market intelligence tools like:\n\nMarket Explorer: Get an instant overview of your market\nOne2Target: Understand your target audience and how they engage online\nEyeOn: Track your competitors’ online marketing activities\nTraffic Analytics: Analyze your competitors’ traffic sources, stats, and growth strategies\n\nWe’ll talk more about using tools for market research later in the article. For now, let’s discuss why marketing plans are important for businesses.\n\nAnalyze Your Market\n\nwith Semrush .Trends\n\nSign up Now →\nWhy Do You Need a Marketing Plan?\n\nAn effective marketing plan leads to more targeted marketing efforts. This can result in increased sales and greater brand visibility in your target market. \n\nHere are some more reasons why you need a marketing plan for your business: \n\nProvides clear direction: A marketing plan provides guidelines for your marketing activities. For example, it outlines the goals, strategies, and tactics you need to implement to achieve specific objectives. This helps your marketing team understand what they need to do and why. \nEnsures alignment with business goals: A well-developed marketing plan ensures that marketing goals align with the overall business objectives. \nAllows efficient resource allocation: A marketing plan helps allocate resources—financial, human, and time—effectively. For instance, you can allocate more resources to strategies and activities that maximize return on investment. \nEnables targeted marketing approach: To create an effective marketing plan, you need to define your target audience. And understand their needs, preferences, and pain points. This way, you can create more targeted and personalized marketing campaigns that resonate with your ideal customers. \nHelps with performance measurement: An ideal marketing plan also defines benchmark metrics and key performance indicators (KPIs) to measure the success of your marketing activities. It helps you identify what's working well. And what needs improvement.\nEnsures a consistent brand message: You can maintain consistency in your brand’s voice across different channels—like email, social media, website, and podcasts—by providing the marketing plan to your different marketing teams.\nMarketing Plan vs. Marketing Strategy vs. Business Plan\n\nA marketing plan is often confused with a marketing strategy. Or a business plan. \n\nBut they're not the same. \n\nEach one plays a different role in the overall success of a business. \n\nLet's consider the differences between the three.\n\n \t\n\nBusiness Plan\n\n\t\n\nMarketing Strategy\n\n\t\n\nMarketing Plan\n\n\n\n\nWhat It Is\n\n\t\n\nA comprehensive document outlining the overall business strategy, goals, and action plan\n\n\t\n\nA document detailing how a business engages its audience, conveys value, and drives sales\n\n\t\n\nA tactical document outlining marketing tasks, schedules, and resources to achieve marketing goals\n\n\n\n\nKey Elements\n\n\t\n\nBusiness goals, financial projections, market analysis, and strategic planning\n\n\t\n\nTarget market analysis, brand positioning, competitive differentiators\n\n\t\n\nCampaigns, budgets, timelines, specific marketing channels, and success metrics\n\n\n\n\nPurpose\n\n\t\n\nTo guide overall business strategy, including financial planning and operational strategy\n\n\t\n\nTo set the direction and goals for marketing efforts, informing resource focus\n\n\t\n\nTo implement the overarching marketing strategy with actionable steps\n\nHere’s an example to help make the differences clearer: \n\nA pet supplies startup aims to become a leader in eco-friendly pet products. \n\nTheir business plan highlights the startup’s mission to cater to eco-conscious pet owners. By offering sustainable products like biodegradable toys and organic pet food. \n\nIt also includes financial projections, market analysis, and competitive analysis.\n\nTheir marketing strategy focuses on establishing the brand as eco-friendly and health-conscious. The strategy is to:\n\nTarget ​​environmentally conscious pet owners\nPosition the brand as a provider of high-quality, sustainable pet supplies \nBuild awareness through green partnerships and educational content on sustainable pet care\n\nTo implement this strategy, their marketing plan includes:\n\nSocial media campaigns: Regularly showcasing products and sustainable pet care tips on platforms like Instagram and Facebook\nContent marketing: Weekly blog posts on their website covering topics like “Eco-friendly Pet Care”\nEmail marketing: Newsletters to an email list of eco-conscious pet owners—featuring product updates and pet care tips\nCommunity engagement: Participating in local eco-friendly pet events and partnerships with influencers\nPaid advertising: Google Ads and social media ads targeting eco-conscious pet owners\n\nTip\n\nYou can use the AI Marketing Strategy app to access frameworks with proven marketing tactics for every step of the marketing funnel. Plus, execute a strategy with AI that creates copy, graphics, and more.\n\nTypes of Marketing Plans\n\nYou can tailor marketing plans based on your goals, channels, and strategies.\n\nFor example: \n\nA small business that uses only one or two marketing channels may only need one marketing plan. But if you have complex marketing needs, you may require multiple plans. \n\nLet’s go over some of the most common types of marketing plans.\n\nType of Marketing Plan\n\n\t\n\nKey Aspects\n\n\n\n\nQuarterly or Annual Marketing Plan\n\n\t\nAligns with fiscal quarters or yearly business objectives \nIdeal for setting and tracking short-term goals and adjusting strategies as needed\n\n\n\nContent Marketing Plan\n\n\t\nIncludes blog posts, videos, and infographics aimed at attracting and engaging a specific target audience \nCrucial for building brand authority and customer relationships\n\n\n\nSocial Media Marketing Plan\n\n\t\nInvolves creating and sharing content on social media platforms to engage the audience \nEffective for brand awareness and customer engagement\n\n\n\nProduct Launch Marketing Plan\n\n\t\nOutlines a detailed roadmap for launching a new product \nUseful for creating a buzz in the market, educating potential customers, and driving initial sales\n\n\n\nGrowth Marketing Plan\n\n\t\nInvolves aggressive marketing techniques and data-driven strategies to quickly scale business growth\nIdeal for startups and businesses in competitive markets\nQuarterly or Annual Marketing Plans\n\nA quarterly or annual marketing plan is a high-level plan highlighting the marketing activities for the upcoming quarter or year. \n\nIt’s the simplest and most popular type. Especially for giving an overview of the proposed marketing plan to stakeholders. \n\nYou can also briefly mention your channel-specific marketing plans in your quarterly or annual plan.\n\nQuarterly plans revolve around your short-term business goals. And the annual marketing plan caters to your medium and long-term goals. \n\nFor example, if you are a clothing retailer, your quarterly marketing plan may include strategies such as:\n\nLaunching new product lines \nRunning promotional campaigns\nLeveraging social media influencers\n\nAnd so on …\n\nThese high-level plans ensure your marketing efforts are cohesive. And aligned with your overall business goals.\n\nContent Marketing Plans\n\nContent marketing is about leveraging content to reach your target audience. And achieve your business goals. \n\nA content marketing plan highlights the specific channels and audiences you want to target with your content. It also includes different strategies, campaigns, or tactics you’ll use to attract and engage customers.\n\nYou can also add a content calendar. This outlines the topics, formats, and distribution channels for your content. \n\nIt helps you effectively manage your content production and publishing schedule. This way, your content efforts stay aligned with your content strategy and overall marketing objectives.\n\nFurther reading: 15 Effective Content Marketing Tips to Skyrocket Your Results\n\nSocial Media Marketing Plans\n\nA social media marketing plan communicates how you’ll achieve your marketing goals with social media specifically.\n\nIt typically includes: \n\nYour social media marketing goals and KPIs (increase brand awareness, grow your follower count, lead generation, etc.) \nYour social content strategy, including types of content, posting frequency, and content repurposing guidelines \nThe social media platforms you intend to use for marketing\nEngagement plan (tactics to make your audience engage more with your content)\nSocial media marketing budget \nDetails of social media team (names, responsibilities, and deliverables) \n\nTip\n\nAnalyze your competitors’ social media strategies, drive engagement, manage your social calendar, and amplify your brand’s reach with Semrush’s Social Media Toolkit.\n\nStreamline Social Media Management\n\nwith a Semrush Social Subscription\n\nStart Free Trial →\nProduct Launch Marketing Plans\n\nThese plans are specifically tailored for introducing a new product to the market. They guide the positioning, pricing, and promotion of a new product or service. \n\nHere, the key is to create a sense of excitement and urgency. This ensures your product makes a significant impact upon its release.\n\nYou can achieve this by: \n\nDetermining the right channels for reaching the intended audience\nGenerating buzz and anticipation before the launch\nCreating targeted messaging to highlight the product’s unique value proposition \nLeveraging a mix of public relations, social media campaigns, influencer partnerships, and event marketing\n\nFurther reading: 15 Creative Product Launch Ideas to Ignite Your Brand’s Growth\n\nGrowth Marketing Plans\n\nA growth marketing plan takes a broad approach that targets the entire marketing funnel. Growth marketing plans rely heavily on experiments and data analysis to drive growth. \n\nHere, the main focus is identifying optimization opportunities at all customer touchpoints. \n\nHere is an example of how you could use a growth marketing plan:\n\nIf paid search is your top-performing channel, you may want to A/B test different versions of your ad copy. To find out which one gets more clicks. You can then scale your ad spend on the copy that yields the greatest return on your investment.\n\nYou can conduct similar experiments with all the other channels and campaigns in your marketing plan. And optimize their performance. \n\nWith that, we’re done with the basics. Now, let’s learn how to write a marketing plan.\n\nHow to Create a Marketing Plan\n\nTo make it easy for you to follow along with our guide, we’ve created a brief quarterly marketing plan for a hypothetical business: Your Dream Home Consulting. \n\nNote\n\nWe’ll stick to this example throughout this section.\n\nYou can download this sample plan and follow along. \n\nLet’s go over each step in detail. \n\n1. Write a Brief Executive Summary\n\nStart with an executive summary that outlines the main points of your marketing plan. (If you’re writing a very detailed plan, you may want to add a table of contents at the very beginning for easy navigation.)\n\nYour executive summary should provide a quick overview of your goals, target market, main strategies, and expected outcomes.\n\nHere’s a concise executive summary of our example plan: \n\nIf you’re writing a detailed marketing plan, your executive summary may also include details like: \n\nCompany mission statement \nIndustry and market analysis\nLeadership team\nValue proposition\nFinancial plan\n\nFurther reading: Unique Value Proposition: What It Is & How to Create One\n\n2. Set Your Marketing Goals and KPIs \n\nMake sure your goals and KPIs align with your overall business objectives. The idea is to communicate what success looks like for your marketing plan. \n\nUse the SMART framework for setting useful goals. It’s a great way to check whether your marketing goals are Specific, Measurable, Actionable, Relevant, and Time-bound (SMART). \n\nThis infographic explains how SMART marketing objectives relate to your overall business goals: \n\nHere are some examples of SMART marketing goals:\n\nIncrease social media engagement by 30% within six months \nGenerating an extra 500 leads per month compared to last year\nAchieving a 10% increase in revenue in the next quarter\n\nWell-defined goals will provide a clear direction for your marketing efforts.\n\nOnce you have determined your goals, establish marketing key performance indicators that tie back to your marketing goals. \n\nSimply put, KPIs are quantifiable metrics that track the progress and effectiveness of your marketing activities. \n\nSome common marketing KPIs include: \n\nUnique website visitors\nLead generation rates \nConversion rates \nCustomer acquisition cost \nCustomer lifetime value \n\nAnd more. \n\nHere are the Q4 marketing goals and KPIs of our example business, Your Dream Home Consulting. \n\nBy setting specific KPIs, you can monitor the performance of your marketing campaigns. And make data-driven decisions.\n\nFurther reading: 16 Marketing KPIs You Need to Monitor in 2024\n\n3. Research Your Target Market and Build Buyer Personas\n\nFor your marketing plan to be effective, you must understand your target market very well. It helps you understand your target audience and create campaigns that resonate with them.\n\nTo do this, conduct thorough market research. And get answers to these questions: \n\nWhat are the demographics (like age, gender, education, and occupation) of your target audience?\nWhat are their interests and buying habits?\nWhat is their opinion of your business or industry?\nWhat problems can you solve for them?\nHow can you best engage with them?\n\nHere are some key market research insights for our example.\n\nSemrush’s Market Explorer tool makes your market research process quick and easy. \n\nHere’s how:\n\nLet’s say you want to analyze the furniture market in the U.S.\n\nFirst, open the tool and click “Analyze Category.” \n\nThen choose the location and business category. And click the “Research a market” button. \n\nYou’ll be taken to the “Overview” report. \n\nHere, you’ll see a market summary, which provides insights like:\n\nMarket Consolidation: The distribution of market share among companies in the market\nKey Players: Main competitors\nMarket Domains: Number of websites in your market\nMarket Traffic: Total monthly traffic for these domains\nMarket Traffic Cost: The sum of the estimated costs of all domains in the market to rank for organic keywords over a selected period \nMarket Size: A measure of the demand within your target market \n\nNow, click the “Audience” tab. You’ll see the “Market Audience Summary.” \n\nIt gives you a high-level overview of your target audience. And their unique attributes. \n\nMoving further down this page, you can analyze the demographics and socioeconomic attributes of your target audience in more detail. \n\nThis information can give you a better understanding of your ideal customers. Which can help you create a more effective marketing plan.\n\nSimilarly, you’ll also see their interests and the social media platforms they visit most often. \n\nFor instance, YouTube, Facebook, and Instagram are the top three social media platforms for this target audience. \n\nThis data can help you choose relevant content distribution and advertising platforms. \n\nOnce you have all these insights, create your ideal customer profile (also known as a buyer persona). So you can create relevant and personalized marketing campaigns for them. \n\nYou can use our free buyer persona templates to fill in your audience research insights that you find with Market Explorer. And create customized customer profiles. \n\nLearn About Your Target Audience\n\nwith the Market Explorer Tool\n\nTry for Free →\n4. Analyze Your Competitors\n\nCompetitor analysis is a crucial part of market planning. It helps you:\n\nUnderstand your competitors’ strengths and weaknesses\nPosition your business with a better value proposition \nIdentify gaps in the market and opportunities to differentiate your brand\n\nSo, you need to identify your main competitors. And analyze their marketing strategies, positioning, pricing, and messaging. \n\nFor this example, let’s say you want to find competitors for your website that sells men’s shaving products.\n\nTo get a quick overview of the competitive landscape, open the Market Explorer tool again. \n\nThen click the “Find Competitors” tab. Enter your location and domain name. \n\nAnd click on “Research a market.” \n\nYou’ll see the “Market Summary” and insights that we discussed in the previous section. \n\nScroll to the “Growth Quadrant” widget to visualize the competitive landscape in your market. \n\nThe Growth Quadrant consists of four sections:\n\nGame Changers: Comparatively small, but rapidly growing companies\nLeaders: Large, well-known companies with high growth rate\nNiche Players: Companies with smaller (and often very specific) audience \nEstablished Players: Big, popular, stable brands\n\nAnalyze where your key competitors stand. And how their traffic and audience engagement are growing compared to your site. \n\nRead our detailed guide to competitive analysis to learn the entire process.\n\nOnce you gather information about your competitors, perform a SWOT analysis (Strengths, Weaknesses, Opportunities, and Threats) for your business. To compare how you stand in the competitive landscape. \n\nHere are some questions you may want to consider for your SWOT analysis: \n\nAnd here’s the brief competitive and SWOT analysis for our real estate consulting business example: \n\nAs you implement your marketing plan, you also need to keep tabs on your competitors’ marketing efforts. \n\nYou can automate this task with Semrush’s EyeOn tool. \n\nIt monitors your competitors’ online marketing activities 24/7. And sends you weekly emails about their newly published pages, blog posts, paid ads, and more.\n\nYou can use this information to keep track of your main competitors and to inform your own marketing plans going forward. You can access the EyeOn tool as part of the .Trends toolkit.\n\nTrack Competitors’ Marketing Activities\n\nwith the EyeOn Tool\n\nStart Free Monitoring →\n5. Present Your Marketing Strategy Overview\n\nIn this step, you need to outline the key tactics and channels you will use to achieve your marketing goals.\n\nConsider the various marketing channels available. Such as social media, content marketing, email marketing, search engine optimization (SEO), and paid advertising. \n\nBased on your findings from the audience research stage (Step 3), determine which channels are most effective for reaching your target audience. And allocate resources accordingly.\n\nThen create channel-specific campaigns to reach your audience.\n\nFor instance, this is how you could run the marketing campaigns for Your Dream Home Consulting. To achieve its goals in Q4. \n\nTip\n\nEnsure your messaging is consistent across all channels and resonates with your target audience. Tailor your content and communication to address their pain points, needs, and desires.\n\n6. Define Your Marketing Budget\n\nA well-defined marketing budget:\n\nEnsures your financial resources are allocated efficiently across different marketing initiatives—you’ll want to prioritize campaigns that offer the best return on investment (ROI)\nRequires you to set realistic and achievable marketing goals—based on the available financial resources\nHelps you protect profitability by preventing overspending on marketing campaigns that don’t yield results\n\nSo, how do you allocate your budget effectively?\n\nFirst, consider the costs associated with various marketing channels, campaigns, and initiatives.\n\nThen compare the costs to the expected ROI for each of them. Allocate more budget to the campaign with the highest ROI. Followed by the campaign with the second-highest ROI and so on. \n\nHowever, this is a nuanced topic. \n\nIn some cases, it’s wise to assign a significant budget to a specific channel. Even if it doesn’t pay off immediately but provides high returns in the long run. \n\nCase in point: SEO. \n\nWhile pay-per-click (PPC) campaigns can generate nearly instant traffic, SEO takes time. But it builds a foundation for sustainable organic (unpaid) growth. \n\nOver time, a strong SEO strategy can lead to consistent and long-term organic traffic. But PPC ads stop driving traffic once you stop paying for them. So it’s worth considering long-term ROI along with short-term returns.\n\nWith that, here’s the budget allocation breakdown for our example business. \n\nMake sure you stay flexible and adjust your budget allocation based on the performance of different channels and campaigns.\n\nFurther reading: SEO vs. PPC: What the Differences Are & When to Use Each\n\n7. Identify Your Key Contributors\n\nBesides the “what” and the “how,” your marketing plan should also communicate “who” will execute the plan.\n\nThis helps you:\n\nGet buy-in from stakeholders\nEnsure smooth execution of the plan\nAlign your marketing team to work toward the shared goal\n\nFor brief marketing plans, you can just highlight different teams and leaders in charge of specific campaigns.\n\nLike this:\n\nAnd if you’re creating a more complex marketing plan, you can include additional details like:\n\nCampaign/project details and timelines \nDeliverables or KPIs for each team\nDetailed overview of each team member’s responsibilities \n8. Establish Performance Tracking Guidelines\n\nConclude your marketing plan with a section about performance tracking or reporting guidelines. \n\nJust like other sections, you can keep it concise or in-depth. Depending on how brief or detailed your marketing plan is. \n\nHowever, it’s important to set some straightforward tracking criteria.\n\nAt a minimum, you should include:\n\nThe metrics or KPIs you’re planning to track\nYour tracking approach\nTracking frequency\n\nFor instance, here’s a simple performance tracking plan in our example: \n\nRegularly review these metrics, analyze trends, and make adjustments to your marketing strategies as needed.\n\nYou can automate your performance tracking using Semrush’s My Reports tool. \n\nHere’s how: \n\nSay you want to create a KPI report for tracking the progress of your goal to grow your organic traffic.\n\nSelect one of the ready-to-use templates. Or click “Create report” to build a custom report. \n\nWe’ll go ahead with a custom report. \n\nNote\n\nIf you already have an account, you will see a different screen. You'll click \"Start from scratch\" near the top of the page instead of \"Create report.\"\n\nYou’ll see a list of widgets on the left panel. \n\nGo to “Domain Analytics” > “Organic research.”\n\nDrag and drop the relevant metrics into the report on the right. \n\nLike this:\n\nDrag and drop all the metrics you want to track. And set your goals or thresholds. \n\nThat’s it. Your automated KPI tracker is ready.\n\nAutomate Your Performance Tracking\n\nwith My Reports\n\nSign Up Now →\nMarketing Plan Outline\n\nIn the last section, we learned how to create a brief marketing plan. \n\nHowever, you may want to add more information to make it easier for key players in your business to follow your marketing plan.\n\nIf you want to create a comprehensive and detailed marketing plan, follow this outline: \n\nExecutive summary: One or two-page summary giving an overview of your marketing plan\nBusiness information: Key points about your brand, mission statement, and business goals \nKey marketing goals: Detailed discussion of your marketing goals and how they align with overall business objectives\nCompetitor analysis: Main findings of your competitive research (Step 4 above)—their marketing channels, traffic sources, successful products, top webpages, paid ads, etc.\nSWOT analysis: Detailed SWOT analysis of your business\nTarget market overview: Market size, opportunities, limitations, and market consolidation—you can use the Market Explorer tool for this \nCustomer journey map: Analysis of the customer journey in your sales funnel, including the sources/channels of lead generation\nUnique selling proposition (USP): What sets your brand apart from your competitors?\nBranding: How is your brand currently perceived? How would you like it to be perceived?\nMarketing channels: The platforms you’re planning to use—have goals and action items for each of them\nMeasurements and KPIs: How will you track the performance of your marketing plan?\nMarketing strategy and tactics: Tactics and techniques you’ll use to achieve your marketing goals\nMarketing budget: Budget allocation by channel—include reasons if you’re investing more in specific channels\nMarketing team: Details like key people, responsibilities, and deliverables\nConclusion: Summary of the plan and reiteration of the main objectives\n\nLet’s look at some examples of marketing plans to see all of this in action. \n\n3 Great Marketing Plan Examples\n1. University of Illinois\n\nIn 2021, the University of Illinois created an in-depth marketing plan to boost its undergraduate admissions. \n\nThis plan is made up of three main sections:\n\nSection 1: Explains overall context, admission funnel, target segments, and student demographics\nSection 2: Mainly talks about the market and audience research process\nSection 3: Details strategies/tactics for achieving goals and success metrics\n\nImage Source: University of Illinois\n\nWhy This Is a Good Example\nDemonstrates a thorough understanding of different audience segments. Such as prospects, inquiries, applicants, and admitted students. This helps in creating tailored marketing campaigns for maximum impact.\nClearly outlines objectives, tactics, and metrics for each marketing channel. Such as content marketing, digital ads, direct mail, and email. This clarity helps in the efficient execution and monitoring of the marketing plan.\nEmphasizes building brand awareness and trust. Which are crucial for long-term engagement and reputation management (especially for a university).\n2. The City of West Chicago\n\nTo reinvent its identity, the City of West Chicago created a strategic marketing plan.\n\nIt’s a good marketing plan example to follow if you’re planning to rebrand your business.\n\nImage Source: The City of West Chicago\n\nWhy This Is a Good Example\nAcknowledges both challenges (like an outdated reputation) and opportunities (increasing diversity). As a result, they set realistic goals.\nIncludes research on successful marketing strategies and best practices of other cities\nComprehensive SWOT analysis\nIdentifies key demographic segments such as the Latino and Caucasian populations. And outlines tailored communication strategies for each.\n3. Safe Haven Family Shelter\n\nCheck this 2022 Marketing Plan from non-profit organization: Safe Haven Family Shelter.\n\nIt’s comprehensive and well-organized. And there is a lot you could apply to your own business’s marketing plan. \n\nImage Source: Safe Haven Family Shelter\n\nWhy This Is a Good Example\nUses a simple and easy-to-follow structure, with tables and bullet points\nClearly communicates four main goals: building industry authority, brand awareness, brand loyalty in established audiences, and event & fundraising campaign brands\nFor each objective, the plan outlines detailed action items. And assigns specific staff or board members to monitor these tasks. Such in-depth planning ensures accountability and effective execution.\nAlso talks about longer-term objectives. This indicates a commitment to sustained growth and development.\nCreate a Research-Driven Marketing Plan for Long-Term Success\n\nMarketing plans are not meant to be set in stone. Keep them flexible and adaptable based on your goals and marketing platforms. \n\nAnd keep fine-tuning your marketing plan as the dynamics of your business change.\n\nThe success of your marketing plan depends on how well you understand your market. And potential customers. \n\nUse Semrush’s Market Explorer tool to get valuable insights about your industry, target audience, and competitors. And create a well-researched, effective marketing plan for your business. \n\nGet Useful Insights for Your Marketing Plan\n\nwith the Market Explorer Tool\n\nTry for Free →",
  "headers": {
    "h1": "What Is a Marketing Plan? (How to Create One + Examples)",
    "h2": [
      "What Is a Marketing Plan?",
      "Why Do You Need a Marketing Plan?",
      "Marketing Plan vs. Marketing Strategy vs. Business Plan",
      "Types of Marketing Plans",
      "How to Create a Marketing Plan",
      "Marketing Plan Outline",
      "3 Great Marketing Plan Examples",
      "Create a Research-Driven Marketing Plan for Long-Term Success"
    ]
  },
  "images": [
    {
      "src": "https://static.semrush.com/blog/uploads/media/04/e6/04e6d56729a6da015f97e08cef2de1ad/marketing-plan-for-agencies.svg",
      "alt": "Marketing Plan"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/d8/e3/d8e3c5f14dbd4530a754b41a571c8446/c74e196f9af5c1a12a38a362619fc940/dekcPmI9naLgSkuitp6qjeF0-XAPLEZLyvzgGaf2ZiyhXUWaSAcO3uBm9KfMycZtdxXeyAAvl7l7HYTSKtEFMBTfjjWfOMMyApCHTVH5_mxUG5ULHnYdlR3ZALdcEEu-EOzJk7bDvVo2Ytj0eZz7DGo.png",
      "alt": "dekcPmI9naLgSkuitp6qjeF0-XAPLEZLyvzgGaf2ZiyhXUWaSAcO3uBm9KfMycZtdxXeyAAvl7l7HYTSKtEFMBTfjjWfOMMyApCHTVH5_mxUG5ULHnYdlR3ZALdcEEu-EOzJk7bDvVo2Ytj0eZz7DGo"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/c6/b7/c6b7493cca516de6b22aaf96b5f753a5/cecdc34b22d2e9258ced016d03a91339/tkTzqqQtlgR9FtqOxjroffQra3cmjzu1Cpi9RNXh6HnGr3v0BXtbcWlGv3ZT8mQtDDlkjXIa8dF7qMmTgr-_x_EZjJB3JflmpuUfRZ0N-TuXbY31Sf-uV0Kfxxp65KGtSmsvuqXG4-VXHD3iKJciwJA.jpeg",
      "alt": "Content calendar example"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/f8/e2/f8e283ab54e3e2b7c77fe4a05c1ace58/62bc73a1f234747c3738b5041cddf39a/uM__YgIxTG59M5NBv4AMt55XtbKdg8mEZSD7yEhUH9-x0_LMcIXrru4JtnbsSHa3LwAx5Yjv8sgtRVjULJPa-jyq5sXkH-kfk2idR60iGFjwdJkHCS6_3OGRmrNibDHnX0Sck-_-hgLXcNHl2R_kBn4.png",
      "alt": "An illustration summarizing growth marketing process"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e4/aa/e4aaf0317bb5d017f66be8f7e6cffe8b/99d9035fa0171ff44d9f1a7251db4bf0/xdtf01A9Vx-Ao8gpChjMVDSbABMVwAv6s9q-zD4DeJrzmoJ4kF0qCCPsXYGLnJ2tvqcViZlCWOAYHUms08jrD_up7sH-w-upiAk2MuyOZ78iLDVGqU5YUS9UxYKvEazm83JcXG6RLumuasoH-pt7Dic.png",
      "alt": "An executive summary of marketing plan"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/fa/0a/fa0a2d671aea8dd6fda9ab441d6e4c82/8fff06dca8594ab052a9608bf67b16d0/wZNkQrgKtbNACLJhTQI6aQzgXxq1nHN-WZ5xWgq14Oe3W5o2xuTRDtT8wol73Pl4t6a-9eTAnFqRe9cCR_BcjOYgjwiepGLdBZxmgsyPP6Nb0lbJV65YtXjC4HPY20kGjgZPt80_jBQ4t3cZrzC-ugw.jpeg",
      "alt": "SMART goalsetting objectives explained"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e0/f3/e0f3d592addd99d23c32b8c28d0975c9/86471494232ef386ee4a03b9e19e54b6/Y2nib6ozUPaN-7-YXtyxutS_rQ3ZGlan2O3HBXQ5trqURB31OFauShP1g58x7WCLJcCHa4PYlAQkTIw53-h3hBUFwLNVYyokNub96PmfqlRXHugYSmu4EGgCBDiqQH6iouxlYtY6tEuUw93TXPVJymw.png",
      "alt": "The Q4 marketing goals and KPIs of an example business from the marketing plan template"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/f0/6d/f06d4b16e411e367674c9125e8f1ccd3/1dbb915278487edfcb2f5a739a5a7633/IMS83p4tNcxGhUrubDYXcXmWbnCwFHdFIXpHvjoL7eB3_Znz6NXFIx94VcZUOxUtFXVAFaaAkqZdwCtTo5kXxhwA-ytrnRV3ZKkcbfZoVUC-Gg2_vIPdLfjrfpew6-NU4Xg6HdQi7sdzh9Kl6yRZMyY.png",
      "alt": "Key target audience insights from the marketing plan sample"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/60/af/60af44eaa61145755ccbbed527d79015/1ac609a1fd736b05d91c56ef568dc57c/gY_9QBtRG4U8fUXS3GTmdSpFuPPhir7zJgJ3hJOo8LkyjSNQiZyCL6k52FQCrHiLkpNqlZCTQ5HzT5VV4XzHDXeq6NovFLA3Ecl6iMDvuQstmylu9lFUagmxglKHgY3sll2_bNH9_94JswRYGu8WMfU.jpeg",
      "alt": "\"Real Estate\" business category selected in Market Explorer tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/13/8a/138a4e50293b57802ef701dc52f8ebb1/435c176464ec29ec3d4e3dc09d4d8b60/4m2E8MOXmfQzam6yZRXDzdDnuDv1tXNanJMtc0zPEvjzEVutmR1YNJO_7dKYHwkUt7T_EQ3iu0BDd3kA-dPhkHT5JYq7rwv1y1-AxiXyd7qnwx3yA43NESP4KoqOMy8iPeKvOvjTD2Frazj7LYboJGw.jpeg",
      "alt": "\"Market Summary\" dashboard in Market Explorer tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/82/51/82513bc23e4833cec400326e86ec5c70/c8663b112fc8f4d3dd32ef84c51dafda/LSAKqrrpwAl8Jnjm_e-o0_Tx6abyx3G3wGn9Xo5r1iSih7FhP-Ow7QDq8EdIhhV0CEmxenyvBM1mB_J_PXsTGASMJDApgXKmYVPvAS8CXQLdLzERL_7KTbjAE9odtHfCVaG15o1TOYZHGDx7FKUBiC0.jpeg",
      "alt": "\"Market Audience Summary\" section of the Audience report in Market Explorer tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/0c/0c/0c0c1b774d20735739f1ae013e89b42c/7f502a40f167db8eec3acd8178a85cb4/CPVVlgHAdfE_z8JYmatHNfy9Bg6dJq4qg9g_afzfFFRBfhBSUbebbq_I-eKG-vNPfsgXr6qtE_EpLTDW8CALfAgfabRuIuclVOvaEPD903AeCl2bPnKcpNdzpDjR4XOG21c__wvBnCFhd_83iIL0nM4.jpeg",
      "alt": "\"Demographics,\" and \"Socioeconomics\" sections of the Audience report in Market Explorer tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/f1/0c/f10ca37a4a8cd2f491a0d0da228457c4/2a695cb2c6f3947bd30534fff6c1aee5/q5UJDAiRPE088JHALsyxq08fzUbzo9_keQErCB-655JHiApoJpxfLnWaWkOS3DvbJePv8g4F7AKZ9tmfOq488pkLUawWj0cl6vwGbXZUTt40hU5KW_hcmy5T0zdebOFh1OwVvVtIZ1MUOuyWRzlZ4xo.jpeg",
      "alt": "\"Interests,\" and \"Social Media\" sections of the Audience report in Market Explorer tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/c7/25/c7254428289a9cbf1c50d02e23a42442/5a38c2cef7c8d35619022fe21082cc0e/-IcRMy3u-nYMuFqAAuw0SaeUIbz0qPeKMxUzt3rQ5hIm_527IPy89oFKNYV7XULgNe7G72sW6Ci82bXC7lVgEBJgFpPBM4xC8Kthu3o7XS9031XnnmaAjDvTwK9u9ED_FCK_IK-SCwEkM4Cn7ovmhQU.jpeg",
      "alt": "Searching for \"dollarshaveclub.com\" in the \"United States\" location in Market Explorer tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/13/87/1387cd3158ab037cc03dd0917a9b9dca/b9e51d9168aeaf57eef2c6a64bd3faf4/cZtmZK0ZMLoTVAj6DCjcv4sPBA2yz-VCYZM-RZFJAfxqOpIlbbsSkgHiiOJQ_rFd_w0sfSgI8R8Wd5QG7JS5tsVR396VLV4rM3n2cgztHPdDTmFTb-9aeh17hw3gpy9uHU16nxguQ9N_0zRgnjcJBxY.jpeg",
      "alt": "\"Growth Quadrant\" widget shown for \"dollarshaveclub.com\" in Market Explorer tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/4c/ae/4cae67d832a57cd24d7117838ab0abfd/564404b9163b55b35d191af59a460a68/QjinQvx2oLIC549xznZsMsNpyEEkSMW3PUxAAjgVGHVjcShl0vtAQOXuWBfZEBBQy97pMW-rsHS9YF7KY0-4OQn3YVzcBf89Wb0wadLQIlkWMaiiCt43LxLSzhisrs1huPsET3LJbaN6t9cxb0Ru610.jpeg",
      "alt": "How to do a SWOT analysis infographic"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/97/95/9795a6319574b74fee9e44e7268cd92b/2b7f6e31aee72a9c85fb16c09ac65517/IX-396652OsPhzzCAIuglYIYevChI7UYflCFFi1ePZxty993IRGzKSQaFmfnmE8T0y02RY-3WD35ZKrL2qTAiNcdwRZbZFetbyrjIK6YOndNcXGwQzO62SiELbAIm7oL_zWQQzrb0XOS43J4dC0Cke4.png",
      "alt": "A competitive and SWOT analysis for the real estate consulting business from the marketing plan sample"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/a6/60/a660299767288989c739f70da9bc67fb/e9b36208a9a38d22e4296a86d02c4b4d/vbPHhIo23ysWB5K37b85Y-sgrwUPOZGM6L8PiwN6l46JuhI1JIOJevle5q1J-8Lq3-GMv6-hjPMoW1UZrj4lP9FiPjvXiBt9gnGbXM26_TVeXuy-Nd5HDHL1U5SqF1xbTziQzUyoP7ggAO39fn1NTEI.jpeg",
      "alt": "\"Top Competitors\" report in EyeOn tool, showing data for Google search ads, blog posts, new pages and trends"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/b7/7b/b77bf2845c47c24f70e5b3500aafc9fc/042078cc25056dd938581aeb8f50489c/vm0EC0xItheZOhHMLRJwuBOd2VoIAVrzf5_78qkyiy31bRHId0vNfV3WyMt00C9uvQORECeOmB4UpFBXVflAECxJ_i8sjpOKtmNifIeP9NFwwZDwrXCc1BEBWInZ8pQjsbZdEz5wArPIWyra2aY6WEI.png",
      "alt": "Marketing strategy overview section of the marketing plan sample from above"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/5d/db/5ddb19eec18e81c6390493243b851e84/f7cd5c8d7069162155b45bb707764fb7/ugDPbg4lDl_IPjZJOY7o0-S5U7sQg87-F_CetvtbYbY69uS5av9aObwLO-Okb4kNIp23TCi4f7nx6Bnk9jXcOyCJLwcoAYIF9iRbeZvYpcDQciS81YIO-GYxuhClP5Z9BxQzQq6tY9hd5valRrzv3as.png",
      "alt": "Budget allocation breakdown for the example business from the marketing plan sample"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/db/74/db74643c45653b672b5ea6f7b3935152/5beb556d299f0cf95e2c9f34e0866367/SPaZUU_Fc--JaB46eU1_htDBsyLfjbwNK0Y3emngqL0MwoWQvh7xzJdUlj3OLJCC72qn51jGeeYNr2x5iHYzMr1PkvtWkMvIVgNvmBdTZ-lnj8UPZkDKEobX24kBIqC1Ul8gpChGieswjsT3dtq32B8.png",
      "alt": "A section of the marketing plan sample, showing the marketing team's leaders"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ae/90/ae90822a4c865434ea82fc38d2ea3491/1738c4136ac985d0cc2ff581ec9eb94b/sk9J-xjFd8VToJBBm3i3uQzpsFLvpdU3UzvJTx1x-KxLUtx9zCRVW9-6_E9gUBnYg2AdFvz2UYylEau9N0psQc52YjbU_fFxMXOvdovH-xW114vPj61UefyzsDcyyCpIvpkG493DfQ9rFdsXv_s6mE4.png",
      "alt": "A performance tracking guidelines outlined in the marketing plan sample"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/17/bd/17bd07db3c22cb97b26259af9f73d933/125feb72e87d91ce7f3ddff6a6e7d7d6/mKAML_8XVcZip6baXh90yWEJV-fmNlMqsPzhsrEA_PNjyUrg9OtDWfQBtwz2j79oOZUfDja12fYiUxe-Zi7inUf6xybcALXk9pNp6gLhQIYZUsmDuRMqhI3uH555qQd8Y1WuOeXh53P7bYGQECcUQn8.jpeg",
      "alt": "Semrush’s My Reports tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/10/3e/103e0d94caad76f2f44701b1f1854fb1/5199cce9c8cbcc2d0a589c5cf2531ae7/OmIq-MlDLOerx0zFIkmJO08RiSwbl-HfTmSbinSgx2B6oz1JXMTPUTSHZg_OiSI_zXKk44c36NxJegZaW-J_ga5D85QP_DVpUa5AMwWR7G67VB81AnKEQY9pQrZYq2jeZNQPggctmWFYsAirh4b9nXw.png",
      "alt": "A list of widgets in Semrush’s My Reports tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/25/b5/25b557a2cf896e6b86f345d4da81c97c/7630aff894ced185e857496641e0b015/c-FAHSehZQJjyzFB3f0Z84ivW58g3Cz64-AtgwZutRj262SRBQwpEWofvneXZcnZxQqgRiIZ1zr9omfShIBE5ta79ZIosa7nZ5ZelQ-WKkM1cCh_ZyTZ-SElkn0VZB7NwcFuDiyyY8Fbchtke61rKBI.jpeg",
      "alt": "Creating a report titled \"Traffic: Organic vs Paid\" in the My Reports tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/70/0f/700f11141db097c4c4096b09586d2d42/9686d3b1c89bde0318c02ab2f109f935/ObEpFKPqB9zHZXtEgZ5SRhvkK7GtLF7Vvcne4OAnar0DAUCUztPnM3uD3_NmDwCzQfPcHt2p2WkmEMtE4v_ymdZE1Oja85pqESp4_Fn3XNiD4UPI47jwXST6acf6A8syzGZ71zDCs5JeYmhTM2Kf8go.png",
      "alt": "What to include in a marketing plan"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/33/1c/331c76c1612e6588b58bf23af179fc88/c1e05222cff4e42e19ce7e11ea6169b3/JhCHOOGpxFudRvbqrW2w3EQc74eQu9nB4whHvh0yO-lx-rl-HAKU_KkuvM-EpN8b_8a9_4qLRusOpeXwc64GRerEmU5_mPK1A-An-SLnhH6lWr2R9g2E5BSQe75D1nZcH5gqb6S2_XyJJ0gjeLMgQAY.jpeg",
      "alt": "Summary of the University of Illinois's marketing plan"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/07/ec/07ec1f895e3500ffee321cd062d2e82e/20ab1458634a1a1508d99713b131fb5b/6e9IIUx9Tfd8oowdmUT8G3i66a88fUeplBaQkyLZUvcna_C0ZJAf1F91Yuu6mde2HvSGNyeWjxM6wDSGI0DbJekXj4vPmEyXwEt8nkXR8W9tbS98RwORIh1socfCqmfZFp5HjRob--kc8g0tBoNj5rE.jpeg",
      "alt": "An image from the City of West Chicago's marketing plan"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/3d/c3/3dc34c318e0824a68f1ccb2f63264c4e/4a66b230bdc59490bb580c1612496af8/mVSlXpgYMqIpdsZFMXxF__Xk8YC4B1CLa5A78Dap9T45w6IRSTTMjJ05JKdsu4lzaKhz3YZM30iqFBzdg6tHPCso2Gbgs8bGqf_BpRWTM5i1CCM5EgjxYHe36s0gkx5dAloT0fvUw_x1iX6guGVXBQs.jpeg",
      "alt": "An overview of the Safe Haven Family Shelter's 2022 marketing plan"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&d=Mon%2C%2021%20Oct%202024%2014%3A10%3A30%20GMT&n=4d&b=What%20Is%20a%20Marketing%20Plan%3F%20(How%20to%20Create%20One%20%2B%20Examples)&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fmarketing-plan%2F&enc=UTF-8&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://bat.bing.com/action/0?ti=5128787&tm=gtm002&Ver=2&mid=c8ea7bdf-f01a-4fde-9628-679c2f93e500&bo=1&sid=3a93d8308fb611efacd5df716a6efc47&vid=3a9401508fb611efbbb3571455a34c1e&vids=0&msclkid=N&uach=pv%3D15.0.0&pi=0&lg=en-US&sw=1536&sh=864&sc=24&tl=What%20Is%20a%20Marketing%20Plan%3F%20(How%20to%20Create%20One%20%2B%20Examples)&p=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fmarketing-plan%2F&r=&lt=911&evt=pageLoad&sv=1&cdb=ARoR&rn=201852",
      "alt": ""
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&b=What%20Is%20a%20Marketing%20Plan%3F%20(How%20to%20Create%20One%20%2B%20Examples)&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fmarketing-plan%2F&enc=UTF-8&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    }
  ],
  "publication_date": null
}