{
  "url": "https://www.semrush.com/blog/off-page-seo-checklist/",
  "title": "Off-Page SEO Checklist: Our Top 8 Tips",
  "content": "What Is Off-Page SEO?\n\nOff-page SEO refers to the actions taken outside a website to improve its search engine rankings. These can include link building, local SEO, influencer marketing, and more.\n\nIn contrast, on-page SEO involves optimizing elements on a website to get more search engine traffic. This includes improving on-page content, internal links, page speed, and other aspects.\n\nOff-Page SEO Checklist\n\nOff-page SEO techniques can provide you with an edge over your competition. Your site gets to be more authoritative by acquiring more backlinks and mentions around the web. All of which can result in more organic traffic. \n\nThat’s why we created an eight-step off-page SEO checklist. \n\nFollow these steps to get the most from your off-page SEO efforts. \n\n1. Audit Your Backlink Profile\n\nA backlink profile refers to the collection of backlinks that point to your website. \n\nGoogle considers backlinks an important factor when ranking content. So, you want to maintain a healthy backlink profile that consists of high-quality backlinks from reputable sites.\n\nConduct a backlink audit to understand how strong your backlink profile is. One way to do that is to use Semrush’s Backlinks Analytics.\n\nHere’s how: \n\nHead to the tool, enter the domain or URL, and press “Analyze.” \n\nYou’ll reach a dashboard that contains a variety of data points. \n\nHere’s what those data points tell you about your backlink profile:\n\nReferring Domains and Backlinks figures: Generally, higher numbers indicate a stronger backlink profile, assuming backlinks are from reputable sites \nReferring Domains and Backlinks time charts: Ideally, you want your site to grow domains and backlinks gradually and consistently over time \nAuthority Score: Semrush’s proprietary metric that measures the domain’s reputability. A higher number indicates a better domain quality. \nReferring Domains by Authority Score: The more domains with a high Authority Score that point to your site, the better \nAnchor Text: The visible, clickable text in a hyperlink that leads to your domain. You want to maintain a natural variety of anchor texts over excessive use of the same anchor text. You’ll find this data in the lower part of the dashboard. \nLink Attributes: Show the division between follow and nofollow backlinks. “Follow” links endorse your site and pass authority. So, you want to prioritize growing them. \n\nA backlink analysis will help you uncover strengths and weaknesses in your backlink profile.\n\nFor instance, you may notice a decline in the number of referring domains. \n\nMaybe the sites that linked to you removed those links or link to other pages instead. You can then deploy link building strategies to reverse this trend. (We’ll cover this later.) \n\nAudit Your Backlink Profile\n\nwith the Backlink Analytics Tool\n\nTry for Free →\n2. Analyze Your Competitors' Link Profiles\n\nYour site competes against other sites that cover similar topics and keywords. Identify and analyze these competitors’ link profiles to discover websites that link to them but not you. \n\nThen, you can reach out to these sites and offer them to link to your high-quality content instead.\n\nOne way to do this is to use Semrush’s Organic Research to discover content competitors.\n\nHead to the tool, enter your domain, and press “Search.” \n\nOnce on the main dashboard, head to the “Competitors” tab. \n\nMake a note of your top four organic competitors. \n\nNow, head to the Backlink Gap tool. Enter your domain, up to four competing sites, and press “Find prospects.” \n\nOnce on the dashboard, click the “Charts” drop-down. To see how your Authority Score and referring domains compare to your competitors over the past 12 months. \n\nFor instance, your competitors might have a significantly higher Authority Score than you. This might be partially explained by them getting backlinks from more reputable domains.\n\nBelow that is the “Prospects for” section. \n\nClick “Best” (while making sure your domain is selected) to list the domains that link to competing sites but not yours. \n\nClick on figures in competitor columns to see which pages attract backlinks from a specific domain. \n\nLike this: \n\nYou can also check the boxes next to each domain. Then, click “Export” to download the data. \n\nOr press the “+ Start outreach” button to move referring domains to the Link Building Tool.\n\nYou can now analyze competitor pages to understand why other sites link to them. And this can inform your link-building efforts.\n\nFor instance, you might produce a better piece of content than your competitors and ask those sites to link to your page instead.\n\nDiscover Backlink Opportunities\n\nwith the Backlink Gap Tool\n\nTry for Free →\n3. Build High-Quality Links\n\nDiscovering your competitors’ backlinks might have already provided you with link building ideas. \n\nBut there are various link building strategies to consider when working through your off-page SEO checklist.\n\nHere are some of the strategies to explore:\n\nGuest posting: Write a useful piece of content for a reputable site in your niche. This can result in a backlink to your site. \nReclaiming broken links: Find broken external links on target websites and offer an alternative page with relevant content from your site \nSkyscraper technique: Identify competitive content other websites link to, craft an improved version, and encourage those websites to link to your content instead \nUnlinked brand mentions: Find websites that mention your brand name without linking to your website and ask them to add a link \nLinkable assets: Create a type of content that grows backlinks naturally—such as original research, studies, infographics, free tools, in-depth guides, and more \nExpert advice: Share your expert advice through interviews, podcasts, and Help a Reporter Out (HARO) media requests so writers and journalists add a link to your website when they cite you\n\nPrioritize strategies you have the expertise for that can bring results faster. \n\nFor instance, if your brand is well-known and is mentioned throughout the web, then pursuing the “unlinked brand mentions” strategy makes sense. \n\nOr, if your company employs leading industry experts, then sharing their expertise with writers and journalists is a sensible approach for acquiring backlinks. \n\nSemrush’s Link Building Tool can help you implement these strategies.\n\nFirst, head to the tool and add your domain. \n\nThen, click “Start Link Building” to set up your campaign where you’ll add your competitors and the keywords you want to rank for. \n\nOnce on the main dashboard, go to the “Prospects” tab. \n\nHere, you’ll find a list of websites sending the most links to your competitors.\n\nYou may want to prioritize websites with a high Authority Score, as listed in the “AS” column. Because these reputable sites can pass more authority to you.\n\nOnce you determine the link building approach for a particular website, select it and click the drop-down menu next to the “To In Progress” field. \n\nClick on an individual outreach strategy to send that prospect to the “In Progress” tab. \n\nClick “Contact” if you want to email the prospect from within Semrush’s tool. Available emails will be automatically added.\n\nOnce you acquire a backlink from a prospect, move that website to the “Monitor” tab. This way, you can track if you lose that backlink or if a referring domain is no longer live. \n\nFurther reading: Email outreach is a vital part of link building. Read more about it in this guide.\n\nBuild High-Quality Links\n\nwith the Link Building Tool\n\nTry for Free →\n4. Optimize for Local SEO\n\nIf yours is a local business, optimize your local SEO efforts to improve your online presence. Local SEO is the process of improving your digital footprint to better reach people in your geographical area via search engines.\n\nIt is vital for brands that serve specific places or have a physical location. It helps you show up on Google Maps and search results for keywords with local search intent.\n\nLike “hairdresser Brooklyn Heights”:\n\nThese search results display reviews, opening times, and other useful information. These are known as the “local pack” results. \n\nYour local SEO efforts should start with signing up for Google Business Profile (GBP), a free business listing by Google. \n\nIt’s a simple process:\n\nCreate an account\nSelect attributes that describe your company\nSet open hours for your branch(es)\nConsistently upload images and videos\nRespond to customer comments in the review section\n\nBut don’t stop there. Try to get your business listed in other directories. \n\nYelp is one option. But you can also look for relevant local directories. Like Brooklyn Business Directory, which lists companies from the New York City borough.\n\nEncourage customers to leave online reviews. These can improve your online reputation, provide social proof, and show Google your site is trustworthy. \n\nGoogle encourages businesses to reply to both positive and negative reviews. \n\nYou can respond to Google reviews using your Google Business Profile account. \n\nOr use Semrush’s Review Management tool to respond to Google reviews. And get notified about reviews on other directories. \n\nHead to the tool, find your business, and sign up for a service. \n\nOnce on the main dashboard, click “Review Management.”\n\nThen, check the reviews and start replying. You can even use AI-generated responses for inspiration. \n\nPress “Reply” once you’re ready to post your comment.\n\nFurther reading: Beginner’s Guide to Online Reputation Management\n\n5. Earn Brand Mentions \n\nBrand mentions across the web help your company maintain brand visibility.\n\nHere are some of the campaigns and activities you can carry out to earn brand mentions:\n\nInfluencer collaborations: Partner with influencers in your industry to create content that showcases your brand. This can be product reviews, unboxings, tutorials, or any content relevant to your business. \n\nLike in this example where influencer @ellenbrockygirl holds her cat and talks about a specific cat food brand:\n\nUser-generated content (UGC) campaigns: Encourage your customers to share their experiences with your products/services on their social media platforms. Offer incentives such as contests, giveaways, or features on your official channels to motivate them.\nPress releases: Whenever you have something newsworthy, like a new product launch or company milestone, draft a press release and distribute it to media outlets\nPodcast & webinar appearances: Either host your own or be a guest on popular industry podcasts or webinars\nAffiliate marketing: Start an affiliate program where bloggers, influencers, and websites can promote your brand and earn a commission on sales\nFree education: Offer free workshops, seminars, or courses related to your industry, positioning your brand as an authority\n\nYou also want a way to monitor whether these efforts are increasing your brand mentions. This is where Semrush’s Brand Monitoring app can help.\n\nHead to the app, configure it, and enter the main dashboard. \n\nYou’ll then see a report that lists various mentions of your brand name. Like here:\n\nYou can also get daily, weekly, or monthly email updates on new brand mentions. Or set up custom alerts on unusual brand mention spikes. \n\nFor instance, maybe a popular site or influencer recommended your brand. You can then work on further boosting this mention and reach out to form a partnership.\n\nFor each brand mention, the app offers details on sentiment, backlinks, country, language, and more. \n\nFurther reading: How to Measure Brand Awareness\n\n6. Share Content on Social Media\n\nShare and promote your content on social media to increase its reach and engagement. You’ll also drive traffic and enable more people to discover and link to your content.\n\nHere are several tips on how to do it effectively:\n\nChoose the right platform. Evaluate your target audience, product, and marketing strategy to decide which social media platforms to focus on. For instance, you may be a home decor expert. So, Instagram and Pinterest might be the right choice since they focus on high-quality visuals.\nCreate platform-specific content. Tailor your content creation to suit the unique characteristics of each platform. A long-form video might work best on YouTube, while a short, catchy clip or image might get more traction on TikTok.\nFocus on quality over quantity. Create high-quality content that resonates with your audience. Instead of frequently posting mediocre content.\nEngage with your audience: Respond to comments, ask questions, and encourage interaction. Users who see a brand actively engaging are more likely to interact and share the content themselves. \n\nLike in this example:\n\nOptimize for mobile. Ensure your content looks good and loads quickly on mobile devices. Since a significant portion of social media users access platforms via mobile. \nInvest in social media advertising. Allocate a budget for promoting high-performing posts. Even a small budget can boost reach significantly on platforms like Facebook and Instagram.\n\nBut how do these efforts help your off-page SEO?\n\nFor one, social engagement in itself doesn’t impact Google search rankings. But it does drive traffic and makes it more likely that someone will discover and link to your content. \n\nAnd some social media pages can get served in search results. \n\nLike in this example for Andreessen Horowitz’s newsletter:\n\nSocial media engagement can also build brand awareness. Which can translate into branded organic traffic.\n\nPlanning and posting content across platforms takes time, though. Semrush’s Social Poster tool can make things easier.\n\nIt allows you to schedule and publish posts across different platforms.\n\nIt also gives you an interactive calendar you can use to plan months of social content in advance. \n\nSchedule Posts Across Multiple Platforms\n\nwith the Social Poster Tool\n\nSign up Now →\n7. Collaborate with Influencers\n\nPartner with individuals who have a large and engaged online following. These influencers can promote your products and services to their audience. But also provide backlinks from their sites.\n\nHere are some broad steps to follow when considering to collaborate with influencers:\n\nDetermine your goals. Decide whether you want to increase brand awareness, make sales, grow backlinks, or something else. \nResearch influencers. Find influencers in your niche with sizable and engaged followers while being mindful of influencer marketing costs and your budget.\nReach out. Send a personalized pitch that communicates your objectives and what you’re offering to an influencer.\n\nHere’s a template email:\n\nSubject: Let’s Collaborate?\n\nHey [Influencer’s Name],\n\nI hope this finds you well. I’m [Your Name] over at [Your Brand Name]. I’ve been genuinely enjoying your content on [Platform—e.g., Instagram/YouTube/Blog], especially your take on [specific topic or post that caught your attention]. You have a knack for connecting with your audience in a real and genuine way.\n\nI’m reaching out because I think we could create something cool together. Here’s a quick overview:\n\nOur Goal: [Brief description of the collaboration’s purpose. For example, \"We’re looking to introduce our new eco-friendly range and feel your voice could make a real difference.\"]\n\nFor You: [Describe what they get in return. For example, \"In appreciation, we’d love to offer you some exclusive samples and a commission on any sales.\"]\n\nLet me know your thoughts and if this sounds interesting to you. I’m looking forward to potentially teaming up!\n\nBest,\n\n[Your Name]\n\nMeasure performance. Once you collaborate with an influencer, track sales, website traffic, backlink acquisition, engagement metrics, and anything else relevant. To assess the success and ROI of that project.\n\nFinding the right influencers for your brand takes some effort. But tools like Influencer Analytics can make this process much easier.\n\nHead to the tool and set up an account. Let’s assume you are looking for YouTube influencers.\n\nGo to “Influence Discovery” and select “YouTube.” \n\nClick “Filters” in the top-right corner. \n\nYou can then set your preferences for country, subscriber count, price, and more. \n\nThe tool will provide a list of influencers based on your criteria. \n\nClick on an individual influencer’s profile to get contact information and additional information.\n\nWork through the list and click “Add to lists” for each influencer that fits your criteria. \n\nOnce you identify enough influencers, review their social pages more thoroughly. \n\nLook for top-performing content and audience comments. To better understand what campaigns may generate engagement and help you achieve your goals. And whether it’s worth partnering with specific influencers. \n\n8. Be Active in Forums\n\nContribute to relevant forums and online communities with valuable comments.\n\nEngage in relevant threads for which you have expertise. And try to respond to other comments to form a deeper connection with your audience. \n\nLike in this case on Warrior Forum where a user replies to a question from another user and shares helpful SEO resources:\n\nYour forum or community profile may contain a link to your website. But avoid posting overly promotional links about your product or brand unless it adds real value to the topic. \n\nAlso, posting on forums in itself won’t skyrocket your search rankings. But it’s part of a holistic off-page SEO strategy that can amplify your online visibility, authority, and organic search performance.\n\nYou get to boost brand awareness. And other people may visit your site and explore your product or services. \n\nPosting high-value comments establishes your authority in your field. Not to mention that reviewing forum users’ questions provides you with topics you can write about and rank for. \n\nTracking Off-Page SEO Success\n\nUse an off-page SEO audit checklist to monitor various metrics and ensure your efforts are delivering results. \n\nBacklinks: Watch the total number of backlinks, referring domains, and the authority score of referring domains \nBrand searches: Monitor the volume of brand search queries over time, the regions where the searches are prevalent, and any seasonality or event-driven spikes \nSocial engagement: Keep an eye on likes, shares, comments, and mentions. These metrics not only indicate engagement but also the virality of your content.\nLocal rankings: Track your position in local packs, user reviews, and search queries leading to your business listing \n\nYou can track backlinks using Semrush’s Backlink Analytics tool. \n\nHead to the tool, add your domain, and click “Analyze.” \n\nOnce on the “Overview” dashboard, scroll down to get a historical view of your backlinks and referring domain data. \n\nYour domains and backlinks may have been growing steadily. In which case, your off-page SEO efforts are paying off. \n\nOr you might notice a drop in the number of referring domains and backlinks. \n\nIn this case, you can analyze your backlink profile to get to the root of this problem. \n\nThe dashboard also contains useful details on authority scores of referring domains. \n\nIdeally, you want to have referring domains whose authority score is higher than your site’s. Which can help improve your own site’s authority score.\n\nImprove Your Off-Page SEO Today\n\nRobust data and advanced tools are vital for your off-page SEO success. \n\nSign up for Semrush to access all the data and tools you need to execute this off-page SEO checklist. \n\nThen, use Backlink Analytics, Organic Research, and the Link Building Tool to take your off-page SEO to the next level. \n\nAccess Everything You Need for Off-Page Success\n\nin One Platform with Semrush\n\nGet a FREE Trial →",
  "headers": {
    "h1": "Off-Page SEO Checklist: Our Top 8 Tips",
    "h2": [
      "What Is Off-Page SEO?",
      "Off-Page SEO Checklist",
      "1. Audit Your Backlink Profile",
      "2. Analyze Your Competitors' Link Profiles",
      "3. Build High-Quality Links",
      "4. Optimize for Local SEO",
      "5. Earn Brand Mentions ",
      "6. Share Content on Social Media",
      "7. Collaborate with Influencers",
      "8. Be Active in Forums",
      "Tracking Off-Page SEO Success",
      "Improve Your Off-Page SEO Today"
    ]
  },
  "images": [
    {
      "src": "https://static.semrush.com/blog/uploads/media/c0/d7/c0d724efae3efda7ed282e75186b1b8f/61f38f306cf132eaf960145084e8d9e7/off-page-seo-checklist_(1).svg",
      "alt": "Off-Page SEO Checklist"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/fa/9e/fa9ef49ee7b826f9c7992c4282f680b9/1a3956cd481a1e412726315d3be9fc47/0pCAYPC87dfM5g8ODaECUF3lZr4KgdrTWHcj0ZT9EQ83fuPifb9nh17Eo1hY_-XFlDUp1B-NySpmw1aqTiImG0nZfYGTudyH9tUZmBd054EQZRpf1t2i4d9Dzs6Bq-BJaHPyyCApgbpUYfvqTXeD_3c.png",
      "alt": "A comparison of On-Page and Off-Page SEO"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/da/a8/daa8f3b033ad79180be4be374fe44271/f20109c627fe3748d13b63ae10184461/ufVBN-8Q_Xp21AwH78oK28OysXpDobdvOCwo1BzXRsVQdfj401eNfjZy9LHQyF03yzcMoja-yPbwC-7lDhYrpqyl3ZUS9ZCOHCYbCl1R_rslyZOOd_QYdQ-l6UT22XiytgTcFHaOy-493zRq6j4sAEQ.png",
      "alt": "Off-Page SEO checklist"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/a5/76/a5764174350bd8a9eedd22bfb78f2e32/81e08e58bc71ee1b3d800a0c8a9bcf33/zFr755oKxBk24nqmw8GncCMIEs4Ny4hXayQlEp00QcTeTh5M-mD_HJdu9BJrmExGK4u48DZmLkUilEiNCRCeF31R7U97ZCLhfhXmbsK2_RL15557i0PLs8V0nl3CuXVcxRQxL60E7hC_49YL0uW4ZdQ.png",
      "alt": "Backlinks Analytics tool search bar"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/3f/01/3f016c248124dd3a291504549229329c/d11edc7f9e539b8813aff76603e63f44/UegVYcnrpFdZEq7xdRjLIQ5RlcB88WmQNMZN2sts5ozdvUOH9SpLrNT0IFqq9zTa0nG6EiruxJ0zj7gNpXVKBatPXsA053htHmq-uZg9LmZTd6RW_a5XxmpLtxKsD81k9JQF8qcXy2cug7Xr8waVcO8.png",
      "alt": "Backlinks Analytics overview dashboard with \"Authority Score,\" \"Referring Domains,\" and \"Backlinks\" sections highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/3b/58/3b58a15920cd53efc42df89f4fdb398f/99991246512efbd2b6d0df560a5b0f70/f5-n68UlXAIY9Z34udXtq3DXMYclulxALhceMWaMIko0xoFeIWsX9hyKrSQngpGHLRIcInCz3lGe0cZ27fW1MT6oF_GEaLJNB7wJlDb2YOqjqfdtJyDNYtYOtY05Uq4xmG2BQnTSvcU2OT1A-B7e8lo.png",
      "alt": "\"Referring Domains by Authority Score\" section of the report"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/75/7a/757a338b458cfa4d44f03fe725a7eb79/44fc5be52df7e1a00c47aa176750eacb/HUx_hJR-FpBuDSl6UEHaS06P78E7sekTa19GBKWQm6sG0u6_cwsQLZNomy_gHF3x_DOO8ljyXiyV_fiamaTfJ_GMXJ_Y7EpiIMax8RfPHAgsHiSJhlxEN6aYopPzI83hhv1z_VFU7rvH0b91iNaqoGg.png",
      "alt": "\"Link Attributes\" section of the report"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/fd/67/fd6736f958e89c55722ebb4c03937081/a6f0df27e57bb3d456d1725d214a7d97/UtRTe-BHKia6YNam5S5V2izwpir47dEzVYdmW5ROGMsJWUmfBI8LJ5SSts1cci8Zow-R3pJs4sCU2mnn1Lde1lRZTtdwF3YEtWb6Z8vR1zFzF9bk4OLtMXVKEWbVm6mOeQlawroB-VaTzb-NT0FMxlw.png",
      "alt": "Organic Research tool search bar"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/5c/c4/5cc44a53ccd7a06d4fe31385242aad56/9a982128d7889707cea24bd2474ea267/cwjicoIeKp_FjEf2przctHJ3W-l8pbd2WLgx_27kJIvyMUhafuy077li93c6g43fA92HY1KWtD1_qkWLsmtfHsP1QpoJ0HGyjkGjOrBuzWc3Ee59STSK3FkBKh_rWNJ1r40Rcr8Q2pikJZVrW53Ja8k.png",
      "alt": "A table with \"Organic Competitors\" in Organic Research tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/01/e0/01e04d3c0bd82fddfcc11d4dd4ae2ab2/08c0a9da38ab60870a2c33cce4781a41/DUm1M6C9kk5PrbSmzS3EuR6_v7685j7stAXSYoJacAZtbXecwMnFNR6CA3QvUujXQMK0gJVY45yqkrgsjy9f0EX6htZpGOIK_Kh5mrMHSwRHu3opiUgzk8jfRQ0Kglgeg_nH6zd9RI2cDTaqB4wGPTY.png",
      "alt": "Backlink Gap tool search bar"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/cc/a3/cca30626b293dbbdffc6291b2a663967/681abc21a3317292854938e300fa4456/-iHQ4Mt473NZqwG-d0P73okjFIlT2M9qMXLUosEeGSX5LMI2ABV8FKCKtAnyloNUQlIUQGeMF8wqOsKuYki5_0GErhObB8YfMSIdLEPUV_7mWDy-jt36azbs97XSBC_pob5BZ48qlszW0ex-B96cdEE.png",
      "alt": "\"Authority Score,\" and \"Referring Domains\" charts on Backlink Gap dashboard"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e8/1b/e81b2f21431f1f88781d3f287d0a3282/e0975ebb241f7b5684a020990201336a/skz9sD8VYuIzJLLr_n7xBYCisu_xXGnMWRnOiU07PyJL7k31o4NogfGIwQtigMasIFsS5XYLl9urb-Bh-n1B934vJWKC0zWI1zJ3oS-cbp2KeTDwnimsqoDfbvgFm5WdY25QVLPhtYhMZiNhxYLwLrM.png",
      "alt": "A competitor's row in the \"Prospects\" table highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/89/00/89000ef329ba6bd2bd54ec5eafe83dd3/2a9be874536979e19c63e9d6210b39ab/Nsvd62Drnd2zDR263qs8ISx926Iek2D53y37i9nVuzzuPwGMX8MO61gJgnSaaGEUJKQL87Tsxu5MFYgUS7CXPozS0VDLpE-A12GjBga7WEMkQc4YxX4KbA6fSyfyXA1MR0dMWh5Stb13olX6cRf6y4I.png",
      "alt": "“+ Start outreach” and \"Export\" buttons highlighted in the upper right corner"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/12/cd/12cdc8413b463af726c8f6399a3c4910/af1b55d3f1ed7a5f8caab94c8c80bf47/o-TN8Mv4u6GmNRPTjW-2WiZtOtn5ARb9VWIFtFJwjSyfA8KBIAbUycnF7mqPwTsf-SJAbzsrnK_2ID5G5zL0rT07MTnHVldk0qacLOmYPzIkW88CokxY924qbG98N-X7SMQ0dNnC_GxrEpbLgTIAgxY.png",
      "alt": "A visual listing the six link building strategies"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/4f/98/4f98565878d712ed127cc4a442c84deb/cd828de1a7e66ffd83c401e6a69d7697/ZqjUL-RXLH0pj8ZK6_AUJmynFdYIA8_CNcnP74M32T_pkJbz_ERrMSSa6jkwwuKaE-PArL3uaDvMWKZunVFAmobT_OrMORTa6hEqDVbPcpX_kkr7oMGV-xj8A_O7wreliu8awhothCPcWGPvPKkXjfY.png",
      "alt": "Link Building Tool search bar"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/a4/16/a41658584002183c2fbf41403d7a607f/fe3ecd438eac89ae870684c0562efff4/Ze0hJ4p_Ys0roTqslJihNiSnzKt37Jn5W6jsFsRDtRhQGicy72rJ8Kr87F8CZZbUIzil06arJ2AFFUFQisPz5uHLwlU6D6DUODUwp14nay2QxAipsa8FfajDaVr58joN-L8InU4GjtuLnl7Bj7G0t-Q.png",
      "alt": "\"Prospects\" tab selected in the Link Building Tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/bf/87/bf877cf6476270f5519a507d5ff8e417/c1f9e679f8bd487e1a117f572d4bee5c/veeTMYxCw2dMSdJ-mggVoSaKcl36MBPmeW2f0CjBvAtw-KucaHC4ND4dXIRKZWiRY3YGofON5mfdaNoqMpmRLv2AHOVuP4TkPqYrBtlTFM-d7fotdUhzOjJg797DA0_6G4T-rg8uT1a740zj9ewCV6k.png",
      "alt": "\"To In Progress\" drop-down menu"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/c3/35/c335ea8a65211adbf617a1189a053c03/f495447281f96c73983f7ca6c3a1fdf0/Ock0Jp8iPEu_Sg08lsWGoYp6bb9s_5s5XetBGds2jj22UnyX74pKzYx-Ruyz9JDagBDVIWHRhmBDBqhhE-FIVf7__AqQq4Ne1KaVT99_cBXMnZUktiM3dqM-InAxfapFO6SQ3FIr5N9u9JzdrWJzAMU.png",
      "alt": "\"In Progress\" tab in the Link Building Tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/78/16/781647fc3b17e80d8d0d0809799a7774/1e4ac0f961a31d4fd545eed9a4d5d5cb/IevIY0saAfPogm3JDK71x_xFk9YgNFBAWMkBi_ts7QZ5bM5AQPufkbsZB9M_3g9FD3ySFnvt9RxqvTI6VE-hU11LlSvipymErTiGW7XVAW6t4KfOWHz8fmtKblF1tHYAv7PdbLTNs3xUw6LgKalKvBA.png",
      "alt": "Google local pack results for “hairdresser Brooklyn Heights” query"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/d2/3d/d23d700973ac01216552c77a6c3441ca/01a1361bb9c18e6034d67b9e0a3e210f/SIQV8RO5POzfUwmO1xyeJHJQovJPAOUqSWA5yNt1Zdtb9AhfOBTNAA__dJoquLuArDATTnS4Ej3x2NSxuFJQA5wGQCENJvzemBv-JEezMq-aOdz8ZHV7WG_jtLy3PQ69hecFG-QgwAieRRf57HxWSPU.png",
      "alt": "An example of a positive customer review on Google"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/c4/f0/c4f00544949293df5e1d8550da4a7f7d/b9e6da0049cc34436ef0555556db7587/66DQIkrB0qpLFbfbOljP7qSyw7WMQF3_8Kw6O4wXeFk8G9Os6iVPcFFnoZyVVdROL8mfjC7fjkZNBFAKoPlmqsJmsdVzP-GDvfipMt5Q0YCOSfT48PX_cRvDDLvTwYOSNkKJm_XARIEIHi8uBrM8ro4.png",
      "alt": "“Review Management\" selected from the Semrush main dashboard"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/97/20/9720ce58debeca7f71568d78ffd23128/a98e4ef0f55731e6e35f7f1b85ea3d34/9mI13_ePEiz5lZJ0MzDTkzdyyeJdurMx5blZghtG9rO1PAhvTrIU-49pLc6Ba5AgK6MPbKxe552A-uAy0Z8wZJnksBImxyHczCSnQpaZO8v3wpfezTCL2O_7ZY6A_ddM2exMpvscDOOKMNj_3UpXZ9Q.png",
      "alt": "Replying directly to a review from the \"Reviews\" section"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/85/61/8561f4265dcbca973e826c4c38f63fc0/b7f3bd9bfff81ca6a2acec1df4c28241/oJyrtkNHKT6VyFNkRQQU5bpXjqw02z_pAl9vXeF_DZYFWszCzBPtWkHg4RSNbo8zAIAy7lozf2UvmGbsJ9oMqTJUQUZmTlP7xD2BPWH4ZHeO5kr3JRRz-SGbI7KEhc5L_C8URJpTS1lgIM4VNWfGvk0.png",
      "alt": "A visual listing six ways to earn brand mentions"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/23/dd/23ddd351f007500949a2865c6f5ef4ae/383ab1a800d257dbd1aae098a6614410/wgvNFV5j89GeFVUzTgm4pBvKRLUy-mCxLZ8mPg__IzLJ6SNHi2LHHbIYinbF9-RwJzE5ag8T4yc2zCIdV13L-P_Tj3BwYxsmAiVa8xbvr94s2_-84iCP1GzZ8-hau77hB54XcRIW4rlE5E2tJVAjIRs.jpeg",
      "alt": "An Instagram post by @ellenbrockygirl with a cat, talking about Purina cat food"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/7d/85/7d85b159cba7e2aa09d157583508785d/f4407d3423422476e6fd3f83f92d4450/_7QizO4KNKD8kMXralKPcn2QNvnm3p9ZatpLoIao_iXlifQRdn_HfI3C4KcAQncqHEWTv1u857BseldNIXU7Frcz1MiarjET7xBXk9d9sTH9mGe-eSphqtrWYVJjPrlpvPDZtBCNLOxMgO74dwbUi2w.png",
      "alt": "\"Mentions\" tab in the Brand Monitoring app"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/0f/04/0f045747ddbdc8c3ce6a9858887aa697/f421c7e993f993e40ff601902f7a8760/lYwB1sz2afEs1BIXzmHr0SxjdYcsc7uvSbA5hZerSFM13BClHk9xjPW8o91BLkR5AM0UsTI10WjGHhLLZKCGQsjBYowcqdhJAEaj8Rd0fFVXrD_ePo0zAdChplxSRWkyUZWGw6Hd0YLT-heVxVtzf4Y.png",
      "alt": "Semrush responding to a comment under its LinkedIn post"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e7/9d/e79dfbc583ff9d712830d95f9e40be2d/b3123e885a3f4e9d418e52b3f41299e3/-frVS4l3DRzNpD2VLcmDz2rg-7WJFhukSo29ym0kgjxKq7Sel_FKvRM3UMYE2VGigyWk6TMiS3qf-H5q-vbCI7i6zeAKXD_8OaCCM_4kJ62ORXewI29IPclIL91MkR2EsYLCeQeUGB2IrHTmdVdClqk.png",
      "alt": "Andreessen Horowitz’s newsletter:on Google SERP"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/18/02/180279409f26018fd031a2e016e7bd23/c2669deac19ef42e59f0fa6889d1f39a/L7tG_AYlscwIE2_-qrITsnIOmCUz9RYkXrJUd3_afuV-RuqdjfAeyHCh5MjpkMxNhZh0DKmWMuthATZtRa9f1bc842j8zASIRKS73Xu72sBdeuG-ocEbUxuw9yMSkEUA7gpWJYIb89b2Ah2I9Xp6AEA.png",
      "alt": "Social media profiles highlighted in the Social Poster tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/60/ae/60ae99ad6481326f34350abca45b96ad/f75be91a2934c89ca1a05306bb231328/mq1lvU2MUoFysvTFsUFRtm-W0Yd6s3DHAU3v6RPclWgvPFvRiiYL2mDuyg--Id-oheJ5l5e5hYeGJ7IKIEmF8L7ShpCQh0T7IgPfbLrAy0YfNFnhI0MeZHP_uEJ4BFTtbuJrA7Xpy5d1uwDbI-ulL_Y.png",
      "alt": "A social media calendar in the Social Poster tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/f0/22/f0225bf25b6c89ce1765b6529a918069/368f32a430a7e63f43a5e1421160cfb2/How-Much-Does-Influencer-Marketing-Cost.png",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/76/dd/76ddd5e92e823987ec3a7be5f21e0579/a847282f9da96ddcb621aacb660c6500/3ahDQDZbf3y4SXGSO9eTbjwbAa2oh2SBcAaFu35utHWtEWKTtdPjYFBxJ9m5uiH52hvUF6ScIUETftg_h_TCMP19II5qVOmtuSRfQ_g9KHiV00RLYKncXIlAXcPqueXhtN6IyhWICSUQAOHwRUTvO9w.png",
      "alt": "“YouTube\" selected under \"Influence Discovery” drop-down menu"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/d5/c7/d5c75bec343741dd9017ac8b976fa5a6/ded7197954e44271cbdcf1ae305eeefd/enw3C-IRZch6A6dSs3-H3E0Q4nHhNTV_1_urtJDZVrUiORZWsd0jq6AEgML4h9_j5ttx7ob8uYfmKBFkA93FcDoXXOYZmvqw8pOW6bdn-brF5-QP5sxIZSK9YvXwgJ0XRj5QauNldrGtj8DToCcujmM.png",
      "alt": "\"Filters\" button highlighted in the top-right corner"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/68/1f/681fb7e33fad260593513818fcf5faaa/da034a79b9f880cb35c1f663e6d070e8/J6C1VkTVfVZDzt2SQ2CAgmCSgdkyYv4NqnCB0-syj9e26WinB2dG-G3dn35ivUmZ1OGSnfGfjSFXajOxuJTLhjlTFJSETL7XTeQrGbpoF0ytubrwKLqUCSITgGvO5aCflpo9rWt97VYqpkTJ6iJ5oyg.png",
      "alt": "Setting up filters in Influencer Analytics tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/29/30/2930cbc758d86c8f9839ba0195c4c6dd/04c75cdb2f743114d2434db57573b4e6/vALwA1C-sNoavML9DKJ5JnghUG-YyUhZaJbPfvflzUYbqKv2pKv2UJSe_0MsicXi15yaeS8HA0lvKmbeuC9dJE0kjwG_nMuFyC-8O3Zjsc6vKm_DkU8QxpsAFdj-My3K0Gc3AH3vmRO9wSoSjCILDik.png",
      "alt": "A list of influencers based on the set filters in Influencer Analytics"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/01/77/0177cb66814d897f909c3060397e8265/b0c57f51d31de31235aa2b06e3f6f7b1/-1HhZjaE3D1E0LmEGBUtJDZGGBTZnkbtyQEzO4ex-HAtbFhX--QexxmO4syJ4U5pqyCoFaIAAUcxtRBJRWZBf5otjnKKgGFYYm3vIK6VYgirJ7GBl-12qWGKKuXpdumPQvnMG0NtiyYBmsOwCW88d3s.png",
      "alt": "Carli Bybel's individual influencer’s profile"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/32/75/3275d826f2810c72b5b173541c056697/6ec4301576dff242b38e96292923a98e/WRPV5f-o9r9Z0IFxDnaqrIv-zo5h0YMiKxxy4nwGm2M2BWootyLqvXvwg0tZoLxLKbtEX-6lJHljAsRyZ9gocOyuXGLO75hKZNi1bkUvdQcDwPsaVMpP506HC53UGQvMM_4-IIyPaFtoJnELHqRM-1o.png",
      "alt": "“Add to lists” highlighted next to Carli Bybel's influencer’s profile"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/38/64/3864a4e3e49853f8ac7bcfecea67f6ea/c3b50c2ff0b0a3f561935d92a50a1cc8/zuzm0DusqF7TWLt2QfM7WdkRyqd1pXT41YiHSzI31ekEBCuky3e9DFr1iwyzMqej0jpd71oFmHlrcanyxORGgn1kTtFH0RatLkxxGK2kGMbgxDo1fy3nCZRs0OyMYNMxjL2vcKyR6vMhfizkNyLQe7U.png",
      "alt": "A question about SEO on Warrior Forum"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/2d/8c/2d8cecc43cadc5455e09511bec6ceffa/2f4db87688c2657f40ccb1436a82202f/bD4Aek6vOQQgo8hQtgqe5lmg8FPDCYkvmONY2na86ltBbtsmT-OoklSHdlrQGmbHv38DNjNuSVRQIuk4jASLuLOQOXBtpIMc6cip24VhWja4LHovT-I5o_ZwjJoOEay1J7v-G9lQsY0cVRJWEAdjVQs.png",
      "alt": "A visual listing the benefits of being active in online forums and communities"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/b0/8c/b08c4a82246a68ce454c43f5c6a8aa86/2f294263c7501a5bc3646b7e564ab0d1/jlcW7mbgVxIw6LHBCMTd9b5CUW_qhIB2ADo8oqPLpikenYHZM8GQcD6n81TWeTbwBbDROj_fi9GIyP4VzpcYUPs0G_V6sCHxg0zcGc5ddfjjPqmKLHcu-vzCC12fgn5725cqLCn143ZqxjPa9ovGlsM.png",
      "alt": "Backlink Analytics tool search bar"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/af/31/af31283917b5375aa1f8eed41815aae4/ac40a799aa9fb4541a2b2f63580e74f8/7gV_zfozpjRgHvMILP-5oHj_q5NS9poUO4HgR4pZqDd8Txc9WO93LXroUsD_CbjI6u26nPio8ftEEIcmcIOPeT9mRaLP5MjWI6o4B_k_AoA3J-62eE2w6MDZGzlfGG5iLePhTB-Wg4Kvj3qhcXSmYoM.png",
      "alt": "Backlink Analytics's overview dashboard"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/6a/62/6a6261f337f3e6a2f6468d635cb6f1ce/bd66d58b638f77a612b922397b543bd4/v1H6WfjDnA7EiHcmbmSxRODacBvflnCIkJ_cYz8XXTRY0IUcMwpSE0vQjS6T9GX_c9__c-g78GLRi8Z-tf3RnkMSOZ0IimoSkj7iwxhsjmqiHXkH_ByTV6GRR11rm2aAxZQpBlaF3-SWnbwsGwW_EgI.png",
      "alt": "\"Referring Domains by Authority Score\" section of the report"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/semblog-next-static/banners/trial-gift.png",
      "alt": "Trial Semrush banner"
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&d=Mon%2C%2021%20Oct%202024%2014%3A13%3A36%20GMT&n=4d&b=Off-Page%20SEO%20Checklist%3A%20Our%20Top%208%20Tips&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Foff-page-seo-checklist%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&b=Off-Page%20SEO%20Checklist%3A%20Our%20Top%208%20Tips&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Foff-page-seo-checklist%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://bat.bing.com/action/0?ti=5128787&tm=gtm002&Ver=2&mid=5ea42792-b094-4017-881f-9bc23dea8235&bo=1&sid=9657ccf08fb611efa42075de9bdaae3c&vid=965849208fb611efa79e29b28a4a2f9c&vids=0&msclkid=N&uach=pv%3D10.0.0&pi=0&lg=en-US&sw=2560&sh=1440&sc=24&tl=Off-Page%20SEO%20Checklist%3A%20Our%20Top%208%20Tips&p=https%3A%2F%2Fwww.semrush.com%2Fblog%2Foff-page-seo-checklist%2F&r=&lt=1903&evt=pageLoad&sv=1&cdb=ARoR&rn=334624",
      "alt": ""
    }
  ],
  "publication_date": null
}