{
  "url": "https://www.semrush.com/blog/paid-advertising/",
  "title": "Paid Advertising 101: A Beginner‘s Guide",
  "content": "What Is Paid Advertising?\n\nPaid advertising is a marketing model where brands pay to show ads to their target audiences. \n\nAnd while paid advertising can also refer to TV or radio ads, most people use this term to describe internet-based ads. \n\nPaid advertisements mostly work on an auction system.\n\nAdvertisers bid against each other for ad space on platforms like Google Ads or Meta ads. The platforms’ algorithms determine whose ads are shown and when. \n\nEvery ad platform has a unique bidding algorithm. But most consider factors such as the bid amount, ad quality, and user engagement to determine which ads are chosen.\n\nThis means if two advertisers have equal budgets, the one with more relevant and engaging ads will be shown more. \n\nPaid ads help businesses tell people what they offer. They’re a vital part of a comprehensive marketing strategy. \n\nBenefits of Paid Advertising\n\nPaid ads offer benefits to small and large businesses, including:\n\nInstant traffic: Traffic can roll in as soon as your ads go live \nAdvanced targeting: Brands can target specific demographics, interests, and behaviors \nPerformance measurement: Ad platforms offer detailed analytics that advertisers can mine for insights \nAffordability: Even brands with small budgets can launch ads to reach their target audience.\n\nPaid ads enable even small businesses with no brand recognition to reach new audiences. And there are a variety of ads to pick from. \n\nTypes of Paid Ads\n\nPaid ads are categorized based on the ad format and channels they’re displayed in. Let’s cover five main types.\n\nSearch Engine Advertising \n\nSearch engine advertising is the practice of placing ads in the search engine result pages (SERP) of Google, Bing, and other search engines. These ads are displayed when users enter a search query. \n\nHere’s a search ad that shows up when users search for “best ai tool”:\n\nThere are many benefits of paid search advertising. \n\nFor one, it allows granular targeting. Companies can target people in different stages of the marketing funnel. From those who aren’t even aware of a problem to those comparing solutions.\n\nAnd searchers will see your brand name even if they don’t click on an ad. This enhances your brand visibility.\n\nYou can set up search ads using advertising platforms like Google Ads or Microsoft Advertising. You bid on keywords related to your business and pay for the clicks you get. \n\nBidding on some types of keywords is more expensive than others. For instance, keywords like “where to buy a laptop” indicate searchers are close to buying a product. More advertisers will bid on this keyword to get a sale, which drives up the cost of the ad.\n\nOne way to ensure you’re spending wisely is to analyze competitors. Semrush’s Advertising Research tool makes it easy to analyze competitors’ Google ad strategies. \n\nType in a competitor’s domain and press “Search.” \n\nThe “Positions” tab shows you how many paid keywords bring users to their site, estimated monthly traffic, and their estimated monthly cost. \n\nBelow that is the “Paid Search Positions” box. This contains the list of all the keywords your competitor is bidding on. You can click “Export” to download this list and look for keywords that would make sense for your business to bid on.\n\n“Ads copies” is also a useful tab to look into. It contains actual ad copies your competitor is using and details on which keywords each ad is targeting. \n\nYou can change dates at the top of the tab to see ads shown in the past. \n\nInspect the ad copy and the landing page it leads to. And what sort of messaging your competitors use to convert visitors. \n\nUncover Your Competitors’ Search Ads\n\nwith the Advertising Research Tool\n\nTry for Free →\nDisplay Advertising\n\nDisplay advertising is the practice of placing ads on websites, mobile apps, and social media channels. \n\nThese ads come in various formats, including images, graphics, animations, and videos. They’re sometimes referred to as “banner ads.”\n\nHere’s an example of a static display ad on a website:\n\nYou can use display ad networks to publish display ads. These networks have several sites that publish display ads. \n\nSome well-known display ad networks include Meta’s Audience Network, Google Display Network, Yahoo Advertising, and Taboola.\n\nDisplay ads offer several benefits. \n\nYou can use them to retarget people who already visited your website. Retargeting works across websites, social media, search, and other channels. \n\nDisplay ads can also be contextual. For instance, an ad promoting a trendy new handbag may appear on a fashion blog. \n\nSuccess in display ads requires uncovering competitors’ ad strategies, budgets, and performance. \n\nAdClarity provides insights into your competitors’ display, social, and video advertising. \n\nYou can use AdClarity to learn competitors’:\n\nTotal advertising spend\nCampaign performance stats\nPopular ad copy and visuals\nMost valuable platforms and traffic sources\nMost-advertised products and offerings\nAnd much more\n\nUse these insights to optimize your display ads by focusing on channels, ad copy, and products that are more likely to gain traction. \n\nSocial Media Advertising\n\nPaid social media advertising is the practice of placing ads on social media platforms like Facebook or TikTok. \n\nThese platforms collect user data such as location, age, and interests. Advertisers can then use this data to target specific audiences. \n\nFor instance, they may target Facebook users who like workout pages with ads that sell home gym equipment. Like this one: \n\nSocial media platforms are also extremely versatile. Both in their audience and the ad formats they support. \n\nLinkedIn, for instance, focuses on business professionals and B2B ads.\n\nOn the other hand, TikTok ads lean toward younger audiences and short engaging content. Like this one:\n\nYou can launch paid social advertising using relevant advertising platforms such as Meta ads, LinkedIn Ads, and TikTok for Business.\n\nVideo Advertising\n\nVideo advertising is the use of video content to promote a product, service, or brand. \n\nVideo ads appear within content on platforms such as TV, social media, and streaming services. They can be placed before, during, or after the main video content. \n\nVideo ads can also exist in a standalone player within a webpage or social media feed. \n\nHere’s an example of a video ad on YouTube:\n\nVideo ads are highly effective. In fact, over 90% of marketers claim that video ads have helped them increase brand awareness, traffic, and sales. \n\nVideo ads can be placed using video advertising platforms. Use YouTube Advertising to launch ads on this channel. Or Meta ads (and other social ad platforms) if you want to publish video ads across social media. \n\nNative Advertising\n\nNative advertising is where ads appear as a seamless or “native” part of the surrounding content. \n\nNative ads can get 53% more consumer views than display ads. They also tend to increase purchase intent.\n\nNative ads are labeled as sponsored to ensure transparency. The exact label might vary, but common terms are “Sponsored,” “Promoted,” “Paid,” or “Ad.” Like in this example:\n\nThese ads offer a number of benefits. Because they fit seamlessly within content, they’re less disruptive and less likely to be ignored. And this may lead to higher engagement and conversion rates.\n\nNative ads come in various forms depending on the platform on which they are displayed. \n\nThey can appear as recommended articles on news sites. Here’s what they look like on CNN’s website:\n\nAnother way to place native content ads is through content recommendation platforms like Outbrain and Taboola. \n\nYou provide these platforms with ad elements, such as an image, description text, a headline, and a link to your piece of content. You can also share details about your target audience and its interests.\n\nThe platforms will then place your content links on relevant websites.\n\nGetting Started with Paid Advertising\n\nPaid advertising enables companies to instantly get their ads in front of highly specific audiences. Ad platforms also offer rich insights and analytics. All of which helps brands acquire customers and grow revenue. \n\nYou can also start with paid advertising by going through the steps outlined below. \n\n1. Set Clear Advertising Goals\n\nYour goals will define what ads you should use. They also shape what metrics you’ll monitor and optimize your ads for.\n\nFor instance, let’s say your goal is to raise awareness about a new product. You’ll want your ads to achieve a wide reach. If you use social media ads, you can measure reach through impressions and clicks.\n\nBut if your goal is to sell products, you’ll want to optimize your ads for online sales or lead generation. A lead could be someone who clicked a search ad to your site then entered their email to download an ebook. Now they’re part of your email marketing funnel.\n\nRegardless of which goals you pursue, they should be SMART: specific, measurable, actionable, relevant, and time-bound. \n\nSMART goals can be measured and optimized so you can assess whether you achieved them or need to adjust your strategy. \n\nHere are a few examples of clear and unclear goals.\n\n2. Identify and Understand Your Target Audience\n\nUnderstanding your potential customers helps you speak to their needs. In a language they understand. \n\nUse market research to learn about your audience. This process involves collecting and analyzing data about your target market. \n\nLearn how your audience makes purchase decisions and which pain points they struggle with. Know their age, demographics, and location. Explore what’s the best way to connect with them and what they think about your industry. \n\nUsing these insights, you can then create a buyer persona, or a fictional profile of your ideal customer. \n\nYou can use these free buyer persona templates from Semrush to kick-start the process. \n\nThere are different ways to collect data for buyer personas. You can interview customers or have them fill out surveys. \n\nYou can also use Semrush’s Market Explorer tool to learn about your audience.\n\nTo start out with general market information, choose your business category and press “Research a market.”\n\nThen head to the “Audience” tab to find details about your target audience.\n\nThe “Market Audience Summary” contains details on your audience demographics, socioeconomics, and behavior. Click “View details” in individual boxes to get more information.\n\nFurther down, the “Social Media” section shows data on the social platforms the audience in this category prefers.\n\nYou can see YouTube is a dominant platform in the “Travel & Tourism” sector. If you’re in this industry, consider YouTube ads as part of your strategy. \n\nKnowing your audience and where they spend time online helps direct your paid advertising efforts. Including which advertising platforms you should focus on. \n\nLearn About Your Traffic Statistics\n\nwith the Market Explorer Tool\n\nTry for Free →\n3. Select the Right Advertising Platforms\n\nConsider a range of factors when choosing an advertising platform, whether it’s display ads or video. \n\nEach platform has unique advantages. These questions can help you choose:\n\nIs your audience spending time on the platform?\nAre your competitors advertising there?\nCan it help you achieve your advertising goals?\nDoes the platform offer data to help you analyze your ads’ performance?\nDo you have the skills or support needed to use the platform effectively?\n\nLooking at online communities is one way to learn where your audience spends time. For instance, check if there are popular social media pages, niche forums, or influencers that your audience follows. Platforms that host these communities are the ones you might place paid ads on. \n\nIf your competition is focusing their ads on a specific platform, it could be a sign your audience is there. Ads on that platform likely bring positive ROI to your competitors. \n\nGoogle’s Ads Transparency Center and Meta’s Ad Library section provide details on ads run by your competitors on their platforms.\n\nSome advertising platforms may require more effort than others. For example, creating video for YouTube ads likely takes more time than selecting an image and writing a headline for a simple Facebook ad. \n\nAnd if Google Ads are your choice, you might benefit from taking the Semrush course on PPC fundamentals.\n\nFor easy setup of Search campaigns, you can use the Ads Launch Assistant app. The app lets you manage Google Ads campaigns from start to finish with AI and Semrush data.\n\nJust insert your URL, language, and location to get keyword suggestions and AI-generated ad copy. Confirm your campaign, select your budget, and start your Google Ads campaign.\n\nAds Launch Assistant: Quick, intuitive, traffic boosting\n\nSeamlessly manage Google Search ads with AI. Try Semrush's intuitive ad creator today!\n\nTry now! →\n4. Create Compelling Ad Copy and Creative\n\nCreating effective ads requires refining various ad elements. Including copy, visuals, calls to action, and more. \n\nHere are some tips for crafting effective ad copy: \n\nUse concise and simple language\nUse language your audience understands\nUse emotional appeals to connect with your audience\nUse persuasive calls to action to encourage readers to act\n\nAlso, make sure messaging is consistent between your ads and landing pages. This reinforces key selling points and nudges visitors toward a desired action. Such as purchasing a product or signing up for a service.\n\nAd visuals and videos should follow the same principles. They need to be consistent and on brand, with high-quality imagery and an effective message.\n\nTip\n\nAI-powered tools like AdCreative.ai can do the leg work for you if you're short on time or resources for design work. This app instantly generates your ad design and copy, ensuring professional-looking visuals that align with your brand.\n\nLike this ad from Colgate:\n\nThe AI Writing Assistant app can help you write compelling ad copy. \n\nFrom the dashboard, click on “All Tools” and then select “Social Media & Ads.” \n\nPick a tool relevant to your needs. For instance, select “Google Ads Description” if you are working on search ads. \n\nInsert details such as product description and product name. The tool will then provide multiple ads descriptions that you can use in your campaigns. \n\nFurther reading: Copywriting 101: The Ultimate Guide to Creating Effective Copy\n\n5. Set a Budget and Bid Strategy\n\nYour advertising budget can be determined in different ways. \n\nYour budget might be fixed. For example, a company may have budgeted $5,000 per month for paid advertising. And you get to use only this amount for online ads.\n\nAnother way is to set a budget based on your goals and desired return on investment (ROI). \n\nFor example, your goal might be to acquire 50 product trial leads. Based on the past ad performance, you know that 10 out of 50 leads convert into paying customers. And you profit $1,000 on each customer.\n\n50 leads -> 10 customers -> $1,000 in profit per customer = $10,000 in profit\n\nThis means your ad budget for acquiring 50 leads should be no higher than $10,000. The lower you can push it, the more profit you make.\n\nBut you’ll never get the real picture until you actually launch an ad. \n\nWhy? Because you’re bidding against other advertisers who want to show ads to the same audience. \n\nAd auction dynamics are shaped by various bidding strategies advertisers use, including: \n\nTarget cost per acquisition (CPA) bidding: get the most conversions for a set dollar amount\nMaximize clicks bidding: get as many clicks as possible for your budget\nMaximize conversions bidding: get as many conversions as possible for your budget\nMaximum cost per view bidding: get as many views as possible for your budget\n\nBut bidding is not just about the amount of money you have. The quality and relevance of your ad play crucial roles in whether your ad is shown.\n\nGoogle, for instance, uses the Quality Score (QS) metric measured on a scale from 1 to 10. It’s influenced by click-through rates, ad relevance, and landing page relevance.\n\nA higher QS means your Google ads and landing pages are more relevant to your audience. This means Google will likely display them more prominently.\n\nChoose the bidding strategy that aligns with your marketing goals. For instance, conversion-focused ad campaigns should be optimized for conversion bidding. But brand awareness campaigns would likely benefit from bidding to get as many views as possible.\n\nIn either case, your ads have to resonate with your audience. Monitoring and optimizing your ads is vital for these efforts.\n\n6. Monitor and Optimize Your Campaigns\n\nMost advertising platforms have analytics capabilities you can use to analyze ad performance.\n\nThey help monitor your paid campaign performance to identify profitable ads and rework or discard ineffective ones.\n\nMeta’s Ads Manager shows you how your Facebook and Instagram ads perform. You can see how many people viewed or clicked on your ad. Or how it performed across different demographics. \n\nYou can use other tools to monitor campaigns. Semrush’s Position Tracking, for instance, enables you to track your search rankings for the keywords you bid on. \n\nGo to the tool, configure the settings, and click “Start Tracking.” \n\nThen, click on your project name to access the tracking data. \n\nYou’ll now be in the “Landscape” report. You’ll see several data points, including those in the “Ranking Distribution” and “Keywords” fields. \n\nClick on figures in the “Keywords” box to access specific keywords you rank for in specific spots. You can also click on the “New” and “Lost” figures to access keywords for which your rankings either improved or dropped. \n\nThe next step is to optimize your ads. Ads can be optimized automatically and manually. \n\nSome advertising platforms optimize campaigns automatically. For example, if Google identifies a keyword driving lots of conversions for your ad, it may display your ad more often for this keyword. \n\nBut you can also do manual campaign optimization. \n\nOne way is to identify ad elements that are underperforming. For instance, your social media ads might get lots of clicks but no sales. This could indicate your ad copy resonates with the target audience. But maybe the landing page is unconvincing and needs to be improved.\n\nTo help you figure out what isn’t working, you can do A/B testing. Test one change in your ads at a time, whether it’s a headline, image, call to action (CTA), or something else. And keep other elements unchanged. Like here:\n\nWait and see which version performs better. And then refine your ads using elements that work the best.\n\n7. Measure ROI and Performance\n\nCalculating your ROI requires tracking the performance of your ads. There are certain metrics that can help you do this:\n\nClick-through rate (CTR): the percentage of people who click on your ad after seeing it\nConversion rate: the percentage of users who take a desired action after clicking on your ad, like making a purchase or signing up for a newsletter\nCost per click (CPC): the average amount you pay every time someone clicks on your ad\nCost per conversion (or cost per acquisition, CPA): the average cost for each successful conversion or acquisition\nLifetime value (LTV): refers to the projected revenue from a customer over the entire future relationship \n\nA simple way to measure ROI is to see if the LTV is significantly higher than the CPA. If it is, it indicates a healthy ROI.\n\nAnother way is to use the following ROI formula:\n\nWhere: \n\nAmount gained: the revenue generated from the campaign \nAmount spent: the total amount spent on the campaign\n\nFor instance, if you spent $1,000 on an advertising campaign that generated $5,000 in revenue, then the ROI calculation would be:\n\nROI = ($5,000-$1,000) / $1,000 X 100 = 400%\n\nThis means you made a return of 400% on your initial advertising investment.\n\nROI is not only about the revenue. But also about understanding the user behavior and developing a brand that drives long-term value. A good ROI can also be increased reach, engagement, brand awareness, customer feedback, and more. \n\nLaunch Your Paid Advertising Campaign\n\nPaid advertising enables you to reach your audience quickly. And generate leads and grow revenue even with smaller ad budgets.\n\nTo run your first campaign, select a platform relevant to your business and follow the steps we outlined above. Practice is the best way to learn and excel at paid ads.\n\nBetter yet—use the Semrush tools we mentioned to help you along the way. \n\nReady to get started? Sign up for a free trial today!\n\nAccess Everything You Need\n\nin One Platform with Semrush\n\nGet a FREE Trial →",
  "headers": {
    "h1": "Paid Advertising 101: A Beginner’s Guide",
    "h2": [
      "What Is Paid Advertising?",
      "Benefits of Paid Advertising",
      "Types of Paid Ads",
      "Getting Started with Paid Advertising",
      "Launch Your Paid Advertising Campaign"
    ]
  },
  "images": [
    {
      "src": "https://static.semrush.com/blog/uploads/media/a9/52/a952bcbdfdf15815f9d53c50e9734d25/paid-advertising-mistakes.svg",
      "alt": "Man with his head in hands surrounded by crumpled papers"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/b2/6e/b26ebe74d160f65276466f2464b90e49/39000e74327c491c7438526fdb5cbec6/IHxa3y2fYxeS1DoWVpaVOHVTJOgZenSTc8rzsMclppzKDeBPQerdbGC-gus5DWz2Y2M5VI1r55tlS8IEol8dG8dcrJo7cJ94Y9ul5mmYErNDu9ym0Jm0ZOpY_zejyMlagAged5XT-i9SwWzEyAHzgIcjhS2wf6mUwWS947DuHz6dwjzJXX-CIh9BRcpjYg.png",
      "alt": "Factors that impact the reach of paid ads include bid amount, ad quality and user engagement"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/f9/d6/f9d6e7fe7dbf66b22d08ba1b6ee9cbcf/4457075f890937c98b985f6db4cda78f/CVNgSLO2WHkVJf42L1vB0i2V7jx6DT5qJyqGr7qq1HucXfS7P6ggrohAC5S8rZAMf0xtilP5QznV17UHg9PMtvQooF9mE2C2UiJ4NcFtDw9ax__qcaKk3bKkErxNY55xYlEV9HM4OEsWM4e8yZa57dPAoQeNyS_YW77lKMlsZMZ4_jq683-pwQpA3-QJGw.png",
      "alt": "A Google search ad from AppSumo showing up for “best ai tool” query"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/42/43/4243a1d25a31d75f8e141f8815e887dd/efd2f8bb2921a3672a4cc450992eef66/JjodSebGQ66I4HqaggCo2l63796bZPeZhSjXbQaEOfYDrTmVeHai-xsnyio3IGy-4LMo3lqaKFC961sIBHDsqvXeCSjdb-ALx3ZYfAS_DT6ey0x9YVv9jJ8JykaFHrwB4kev5HRgR-0aOXCGEII-zVlfjFmVS4RkfL_O5NJfT7lqR4fgCNpv-3eaTxi9TA.png",
      "alt": "\"nike.com\" entered into Advertising Research tool search bar"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/70/5b/705b689061c0b39c03c1e4a800301cb4/56dda0147f6bcf205a36a40c03e464d5/JvK2rH7R_HXMEBEufPxIWmuGBtpH-IWf46N-WYobbKNqq-CGIu1Sqa9yU59idUiyGQcRKbabHPPVPsRUtEI-K_CxW0omqFuTRT4a7jw0RzbefkVKo-aLIJzrWdMxZ-9BDUuoFgH0AE62RaeXKIMak9cEwaVEaXrzuceYSkEEiGgiOcFoSUbuzIN0LBJcBg.jpeg",
      "alt": "\"Positions\" dashboard for \"nike.com\" in Advertising Research tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/41/d1/41d1b0182c8c06c3dda45a0485d57855/8f4803eda40d6d342499bfd18c10a9af/xONNp95dUXe8QhgiEp9LR1EAXpmGKnBL1qYWTwrSbfyXVYn8nN4kgmw7VW_KX5F_R8OvAmntmo1ai9mKq5ry_vyYbs7GeWBHHYisk_KiOZ0Yd-Van9WWgkXmz6b1tovlDZBUki5oVxurMCmzruydi5dZNPc_yecgC-D8NCgdYIY8-j2GG8Jhnb-h0Aw0ug.jpeg",
      "alt": "“Paid Search Positions” table in Advertising Research tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/82/ac/82ac41dc6e50a736688c4e4869021a6d/2794f6e1c9ec6b33799242ce526dce7b/LGopBlMkJn3idOZPG6Z-HXxmnWn_DdhrzuD7fMykyQJ7koAkHwDqvlt_pgEchuTkzdHZ8yuBhoK1XrpVy-ThCjmOAGMvPSCTY6D0Yc6yLxua44iRO4T5DtU8GnqIMI36591sPY0E3sNjzYUqoQsLp4LNCCz5oSTtZ4UvsW7hqDu1XkIEMiL6VLbgJeEfwQ.jpeg",
      "alt": "“Ads Copies” dashboard in Advertising Research tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/bb/9a/bb9aea3d55e3a91bb344c825f5dad2d6/e4a0fa4b7ff9920b1f5f6087e09b300f/48Ru-MMaZITenJT7bX8L2er87UEOp8rr31diVeuiy2Sa3qLC3yMf3tSx1QV_NDoxiZllbnPQ0DhMSnlqldwzKbas_gcu_hEv6nKObFYIx9B-mJZGuIw4yzKmAYvWZsEiieSohU4QW8ETeBrZpNhi1iRLvtC47qEOLNVISkcNnwgqoXo0B79WvrM80nrECw.png",
      "alt": "A static display ad on a website"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/6a/6f/6a6fb5bc09d06639f424313d080dc631/d82c5484c7d197c13b776dde92ed1f66/MB07pHs0na7zy5Jdm562h_ahjcrB7_DgFZF3jQW-xGrOfHNssLiZ4y8m5WMouTKXSeS0vWpUPy4VaMfp4blrMl9jjfBl4wZU6LE1vHh-KQ6uurv80-S-Cvjy3iQe0dnwv4U3xsYEyOVeHvia_MpkYJ3i9UOiEc_XNUpnQDoZzlkribm29BU8_zh1NSCuQQ.jpeg",
      "alt": "AdClarity's \"Top ads\" page"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ca/5e/ca5efdc5215948cb789e16fc9cdf19b9/5456d07bb4ee4b244d8f5bd947141706/M1V87_ZO8AGjBU2W37EbS4v_Cqjl9-JtKKDvDAaE8MrPrx1gmv2KWBOew7lYu_PrXjgx8lOn5liHXB-eRzo2iZE1IGwaJ7ZTT1-a1YHGg61Df9BJxek9N-2tWNwDZgrrIbjCM5zfb5lR8zZhQqO_i-zfu9JM-kVOPSMvFHfi2opBkMfYyHqC8bMH1wibEA.png",
      "alt": "A Facebook ad for workout enhancement equipment from Kewlioo.com"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/1e/f9/1ef9f4c63944a95c962ff8829415c6f0/7a55e38c43a1a796c0d7c72fdecd6840/cQS28a22wxrDvRkS6l-JT4hFhb7cDibvIdPMVceOaTipoGMfUNOApDMwjGszte6Xai23eusX2EmCpEhhShJM8HhKefxmyVOnndijCo-SDHYS2SA2dAkDAugE2kOQMmogATFKJL1snoQQgFFhex8rRRB4OaZr7pPWUAwkXBF5fffMUIYZsFkMAAlSLTBVsA.jpeg",
      "alt": "A TikTok ad from @streetracer"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/14/78/147897d42bd1108ff49f1156391db96a/d522ff7edb91736d343ab64f9b978dd5/esjwLAatcCCTtqhWF9HaS33yPQDsxRiX15GGiahpBwFdUBciTObIRpx4P-57tBE4gEb-PaSB07aXDp6jcAkifG5hxEK3BEJ-ohjCdpgaFS_uQktS-H8XNkCCkzYfvj7z8_Pq7SnpWfa8pY8q3ZoyKbBF-Y7E0k5pNmhaKr5CXR8Z38ylV5nMyGKDRwjjOg.jpeg",
      "alt": "Shopify's video ad on YouTube"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e8/75/e875562f4bbbb07a5a56c2a7f3913b06/91c9afc65d345a02f9552d045aec3f88/ApyInypXp2I48JTRQnzq8frutmW0nNxStl1OHKuiUgGEl0_H5x8qlavgQwR6524OAM-sk-_63FncqDZvB2gZeAuBiHjwS-HVtNB7ajwiR6uoeJRIih-my8kxH6rpt60Hcwff9jFv-8_JTmzPWdUyvmOqaLkYNDVVtTLoHlvha_hQ9Zd0ix13MFpnN21V-Q.jpeg",
      "alt": "An example of three articles on a page, with an “Sponsored” label highlighted under the first one"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/43/87/4387465d294bd27ff264fb822297cc53/91a3968e7fe28d3b71337a1a7a4603b4/mogO1tX5_3SZ4UXFKmZNpUpWPeAAtyScAMjHMwCdZm7QJvyKg65Cazw7Wj8_imUEs40PMsNP54B_KJHMyIfJvvdytP1YQJ4zLnc5-Or86ERGVRK9KycpydqmYPycM3KjkT9uMkpcNxZKuePgrUIjxfPbxJwXAxgGC_FLrNWQf-aLnXErucYjYd-gqXldmw.jpeg",
      "alt": "\"Paid Content\" section on CNN’s website"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/41/af/41afde08636201dbb5791b39eb4b4ad4/52bc84d344038aab6a63f1a98feb39fd/KLrI4iGL-CemMqhDA7QzqkBGsBTZGBmTPwwnmVnWr8oYvuE3LtL9gSq577IBI57NRjOo5omtkANuowAgXa_MWavhfbbQipb52s_aM7McoUbLJE36DFR7xsYKIgXrf_3PBmVBUsHVuWjIokuQrFlhreGYlvzgMoPeA4sxJQwUSqQa9IUOfwCzkqaRCIWzLA.png",
      "alt": "A table showing examples of clear and unclear advertising goals"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ff/19/ff19c31a0877a230488ec0c2efa572a9/98ac4ce6f9183a1424088c955297eaf0/886oOkMYuYB_964laXshRqtnp-2iTRm17nJts9NOqUJ0bR1S5JHZMIxbh9s0ubMspdvMhQhwy-skeClMLDWsPHi8uZI0hmi40M4SINE_Jzto_BCdmDqMi-x_GOdlYFarqZhEY67iHdYOnw3Ice59e0aFcnOtv-y4J3MLR4s5hQ84T4jfebYMMPpHje24dg.jpeg",
      "alt": "An example of a buyer persona build in Semrush Persona Tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ae/1a/ae1adfcb6a8d7df598b40e759dfc312c/5ab505cdaccc79fa8536b02546f4dc47/uWSH6XiSyjajPWeMxexP9sM0MlC5KVmYk2GYDHsGCZh4m5RztIo815_3kHNXGHrN-7S1j__5l7w8z7CILjSF6WEXAr6v2kYzXYhcdBs1h8UlaWRsqT-st6ilEx2eggrgaHbRlkqlQkGKcCiWgREhPCKUt7ggtPn6yFyQDLva9SLtY8Rq829xnIrvNmxH7Q.png",
      "alt": "Semrush’s Market Explorer tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/29/aa/29aa452889e13037c16555f0a4b763c4/aa4c041b312253294b5bb45a49324209/i25c7740HZivUJ8AxPTfqku6mix72UiVRfdu4TpqEWLKYEolzGWoVaYjfjZ4C-BgT4868aGMI6IhqVfkl_kErvcyopAGVBQEs6NE0qz5hV00Ozfwea5eePSTkN7Bw3Q6mUTBlv0rr-CYQhRAGTaMMcWzBiWHV_grbdiJwzo78vJEbKhtQOxpRJPuC9jRAg.jpeg",
      "alt": "“Market Audience Summary” section for \"Travel & Tourism\" industry in Market Explorer tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/26/67/2667a0837e86bb46e17add49440aef1b/14d1ad0d5371423df81605a6785ed5dc/JI_plp2QNR5M8pz5NMqZD2oHtsW8uIYaFg1PWvaAbedoSlDcuosM2073DIEYo77MUzZ5g6LbbX4y6Mi8kcqT9hFF260EoF4u148jA4X_cLDPYQa-O9P7Th2zIgEQYoSuQ6r-8YMKTpvgQCuNc6CUynO0EI0hUOYwaUh6u1PdXANQdSAUI9S19gOUW2EDjA.jpeg",
      "alt": "\"Social Media\" section in Market Explorer tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/bc/96/bc96da38ad0f59414dfb87c4d2a15db3/03f317e4eabb7e08b3768a9556aedd25/oCktMwtTGtOfQgOTdrAyNI1BfpzKgQDo524hgirIl3ynfmC2e1rNuZA-IKj9yZWVCSFGL4gASTJFiuKuAwKN46lcfFwo5WcXGhLU4I_o6gvUpg-25E4Lek3tpC7zNy7gC5X5yDAF9Irc5plVU8cFmubLV2Z828C7U-c_f2GCSJjoAt3PoNhPyq2npCKUtg.jpeg",
      "alt": "Google’s Ads Transparency Center homepage"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/4d/b4/4db41c32e24da533b3e307a8a48ccf27/ca954d790db4a0a338de5ef7fde5ae0a/PREVIEW_LP%20Ads%20Launch%20Assistant.gif",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/52/07/520771bb108b3ce6472eb093444da523/b721f13dc349d5f7f4779625841f22aa/fKcSdmnj-QxC4FoVyfEL3eHr4ld4u747FfeIjBhJvlZWFvshqfJ8vyl1pA6AMjm523gjGId95Qmc_lxOsT3dbZwpXisDzFXyq7svrGJu572nf8I87L9hG7gQwZe4h48XBfmr15WQJW973ifigeV3lvY.png",
      "alt": "fKcSdmnj-QxC4FoVyfEL3eHr4ld4u747FfeIjBhJvlZWFvshqfJ8vyl1pA6AMjm523gjGId95Qmc_lxOsT3dbZwpXisDzFXyq7svrGJu572nf8I87L9hG7gQwZe4h48XBfmr15WQJW973ifigeV3lvY"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/a2/d8/a2d810ceb4caaddeb6aa031230b642fd/4b107991ee31fe3a039a4ca63bc8279f/u8AyD-hrGJkIRPz3PNRQLjC01bY5W1oUyROsHd-nzjw5Tr51R0I-rsnmuuKsDylBihzt25065mHvQg2KUZRKA2QlJ5akTXI4saHz-cUE-7uEqcT43jb5QLlH74H-YoWF1MJXFDN6bcTmOUSi7Ewu-74PaE4rO7OMvBMNGVk_yG1Su9tgzWbUMeBNQx-vVQ.jpeg",
      "alt": "Ad ad from Colgate with \"Wedding Guest Outfit Guides: Formal Wedding\" copy"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/39/1b/391b70257ab88d7da04a08ae544018bd/f6366587ee7749d2f27bbd3764f477b6/-tnZ4aWuf0AKHqgZtSAAjX5A0rHkoajD3LivBiAw50BCXKsA5isRy8ymY10iRFKcvkkvK9Qi3Sk8zr0CpVfhUmVWqd_q0D0lMsNm3ttn54LdNh_RAKm3aXSeWdWEPygOUHMqJYdQ52gdnkoCsgXJ_hRmFcJrBOpMRCpNpDP4RT06Q7ITfaaQZxTE4ZuNAA.jpeg",
      "alt": "Navigating to “Social Media & Ads\" in the AI Writing Assistant app"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/b7/01/b7017f7e7a0e18e09d6b41d76219f8cb/d17b245a5b809213f8231da659968bce/pzHYoLV25T_tJFPj4nEIAx0gK3San-oii783m2LqyOmuchjQ0MgKd03LXNOE71rCehk0DFE_nLXOVcmRb1z8v3_QAdFyu3ocByMBAJ5dlJAXWOJfjt8jlbUczDNxWac2bmLM-d_9ftsXAdCsVWySPKVYtJXSJYY1foh8nyM3FNxj7a1Ny39-lXhcq0C6wA.jpeg",
      "alt": "“Google Ads Description” tool in AI Writing Assistant app"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/a5/ce/a5ce7fe212d56927a21b4889b8c74d13/78c51ca5e3da481b1ef61e0149711aca/Expected-CTR-Ad-Relevance.png",
      "alt": "img-semblog"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/0d/c3/0dc3fb18980fbb9867fb640bbc0d5a7a/8727aa47293f33a11a2f0aa8fcb38085/BNHnjIscn76jySGArnVAkkdTHYbPmx1B8ZYwCGuJgO_51VHR_8JsgpF1wqKQfOupSIND9Qpzp8X9LEwqwmtYZotyoi0AehieVICk1rnpZv36ZN8Tg_OWXvM7XOcGonJX84a2bqIqXoOI00nwLTwSep1nLvMXX2MvvBrpcYRmVXwlphoPKR73r13ktPY1Bw.jpeg",
      "alt": "New Position Tracking Campaign settings"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/08/f7/08f79980a13a8cbb931857463c74adcb/53fa566603bca0b48dc136c6ec186c1d/position-tracking-project-name.png",
      "alt": "\"nike.com\" project in Position Tracking tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/48/e9/48e951f093c7e9b0716f7d54774cbb3f/8f69177220dbcb36ea7a9e17af3be09f/tfSSiWAx8jhi3YObCU9UlicXWxrik2yLblLNRQ6yAuda55kaQ9qjZPAhbueU-N7tazcIXc6YipTCBYXUujHeiWbx47wOw3PiPYaUK1iOvCHziTWdMxaB8lXs3wWrvP5w9y8tDVDcACSj84CbvUDM5ekoidZr2wJI6qXUuEI2B-s3ywOjdjBROLIlZdIDEA.jpeg",
      "alt": "“Ranking Distribution” and “Keywords” sections of Position Tracking report"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/fd/9f/fd9f6feebede2a294ec04339c4007a7d/545695115194a3809eac296ac81c5bb5/oNBhV-OGKHsZhOUtwEpFWnCtXV-HQl-dt3g8IeFGpkxXbkr-a34wVZK2wc4gkyRzE7gRpvflDc9LZ4LSLk9ADRalh2jNz0D2AOsa3JanV4gNUVwdQetmDW9yIbew7tLsBIIVnWW9QpMvkPBtcfnLBPVeoR56UQP3VSKhKBr16U6sZdtQLGtWAJz_kT2KBA.png",
      "alt": "A visual showing two versions (A and B) for the same ad copy, with different images"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ae/ee/aeee0027c5ef24d9f51699c304951dc6/94fd6dc25e815f398f080c4b60f53acb/hJQaPHbhfS0lY-_XYNZUiIj0S85PW4g7BuSvLd9stSIqtWrSzX1kx91zJvMJopVON0Ng6AwPUeDkxg8_8PLNtBHM4gU9R-tCALSTgpenxNFLeE-0X7j1zYptlA4U5gHeop-BjrpQiQDhfsg4QIGWZQUJ-ktZ4NHCqSg3fT_9MtGudzwj934B1QlEYz13Yg.png",
      "alt": "A visual showing the ROI formula"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/semblog-next-static/banners/trial-gift.png",
      "alt": "Trial Semrush banner"
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&d=Mon%2C%2021%20Oct%202024%2014%3A05%3A08%20GMT&n=4d&b=Paid%20Advertising%20101%3A%20A%20Beginner%E2%80%98s%20Guide&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fpaid-advertising%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&b=Paid%20Advertising%20101%3A%20A%20Beginner%E2%80%98s%20Guide&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fpaid-advertising%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://bat.bing.com/action/0?ti=5128787&tm=gtm002&Ver=2&mid=f766eb54-58c2-4c86-b91b-7b221b001acc&bo=1&sid=7701b0708fb511efbebc8b0aefdf8d24&vid=770215908fb511efa46daf191b5821ec&vids=0&msclkid=N&uach=pv%3D10.0.0&pi=0&lg=en-US&sw=1536&sh=864&sc=24&tl=Paid%20Advertising%20101%3A%20A%20Beginner%E2%80%98s%20Guide&p=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fpaid-advertising%2F&r=&lt=628&evt=pageLoad&sv=1&cdb=ARoR&rn=301953",
      "alt": ""
    }
  ],
  "publication_date": null
}