{
  "url": "https://www.semrush.com/blog/psychographic-marketing/",
  "title": "Psychographics in Marketing: How to Use It + 7 Examples",
  "content": "Understanding your target customer is the foundation of an effective marketing strategy. Segmenting customers by their psychographic characteristics—such as lifestyle, personality, and beliefs—helps you create more personalized messaging. One that speaks directly to buyer wants, needs, and expectations.\n\nIn this article, we’ll cover the ins and outs of psychographic market segmentation and explore different ways to apply it to your marketing strategies. \n\nWhat Is Psychographics in Marketing?\n\nPsychographics is a methodology for classifying the psychological factors that influence people’s choices and behavior. \n\nThis psychographics definition within a marketing context entails understanding what motivates customers to make purchases, stay loyal to a brand, switch to competitors, and engage in other consumer-related behaviors. \n\nWhy is psychographics important?\n\nPsychographic analysis involves building an accurate picture of customer lifestyles, values, beliefs, and personalities to help you create more resonant, more successful marketing campaigns.\n\nPsychographics often gets a mention alongside demographics. While the former looks at people’s psychological motives, the latter focuses on statistical regularities among groups—such as age, gender, and location. \n\nLater in this post, we’ll look at how combining both of these analytical methodologies can help marketers better understand their target audiences.\n\nWhat Is Psychographic Market Segmentation?\n\nPsychographics in marketing segmentation is the process of dividing a market based on the psychological factors that impact consumer behavior and decision-making.\n\nBy segmenting your target market into distinct psychographic profiles or audiences, you’ll be able to develop deeper explanations for the following:\n\nWhy customers buy a particular product or service\nWhy customers form loyalty towards a particular brand\nWhat type of messaging resonates most with customers\nWhat product benefits and features customers value most\nHow social influences impact customer buying decisions\nHow personal belief systems influence customer behavior\nWhat leads customers to switch brands\n\nFurther reading: Target Market 101: Definition, How to Identify It + Campaign Tips\n\nThe Benefits of Psychographic Segmentation in Marketing\n\nHaving a nuanced understanding of your customers’ underlying motivations can enhance your marketing efforts in several ways. \n\nHere are some desired results you can achieve through psychographic marketing segmentation:\n\nBuild a 360-view of your target audience. Your target market isn’t one homogeneous group. Psychographic segmentation reveals the unique preferences and behaviors of different sections of your customer base. \nFor instance, a fitness wear brand might find that its audience mainly consists of those who mainly exercise for social reasons and those driven by personal health goals.\nTailor your offer. Design offers that resonate more deeply with different customer profiles.\nConsider a gourmet food delivery service whose customer base includes a significant portion that’s passionate about culinary exploration. So it decides to launch a “Chef’s Adventure Box” subscription. Offering monthly delivery of exotic ingredients, recipes from top chefs around the world, and access to an online community for sharing culinary creations with like-minded cooking enthusiasts.\nDeliver personalized messaging. Craft more relevant, engaging marketing messages that directly address your customers’ specific emotions, concerns, and aspirations.\nFor example, a luxury travel company might identify that many of its customers value exclusive, once-in-a-lifetime experiences. In response, the company creates email campaigns focused on bespoke travel packages, with private tours and unique local activities not available to the general public.\nPrioritize the proper channels. Understanding the online preferences and habits of different customer segments lets you capitalize on the communication channels they use the most.\nSay a fitness supplements brand discovers that much of its audience frequently engages with influencer content and visual media. The brand then adapts to this preference by allocating more of its budget to platforms like YouTube and Instagram.\nImprove product development. It’s easier to design products and services that align with your customers’ expectations and desires when you know what they truly care about.\nImagine a mid-sized, US-based clothing company that manufactures its products in Vietnam. The company’s psychographic research reveals that a large segment of its customer base values domestic manufacturing and supports local economies. As a result, the brand launches a “Made in the USA” clothing line, emphasizing the use of locally sourced materials and American craftsmanship. \nIncrease customer retention. When customers sense a brand is on their wavelength, it fosters a stronger emotional connection—leading to greater customer loyalty.\nFor example, a skincare brand might learn that many of its customers would appreciate personalized skincare advice. Therefore, the brand introduces a virtual consultation service where customers can receive tailored skincare tips and product recommendations from experts.\n7 Key Psychographic Examples\n\nWhen segmenting customers according to their shared psychological characteristics, market researchers typically consider the following psychographic dimensions.\n\nLifestyle Insights: Decoding Consumer Habits\n\nLifestyle refers to customers’ daily habits and covers things like work commitments, social engagements, housing arrangements, parental duties, relationship status, and leisure activities.\n\nKnowing what factors influence the day-to-day decisions of your chosen target audience allows you to tailor your content strategy and messaging to the specific needs of different lifestyle segments.\n\nExample: A meal kit delivery brand might develop a targeted marketing campaign for health-conscious working parents. The campaign could emphasize convenience alongside the nutritional aspect of the items provided.\n\nPersonality Profiles: Understanding Individual Traits\n\nPersonality encompasses the unique characteristics of a person’s behavior and way of thinking. Including the “Big Five” personality traits: openness, conscientiousness, extraversion, agreeableness, and neuroticism.\n\nBy analyzing personality types, your marketing team can create campaigns that resonate with different customers’ inherent tendencies. \n\nExample: A streaming service could target introverted users with a campaign highlighting the joy of spending a quiet evening of movie watching at home.\n\nAttitudes and Belief Systems: Gauging Consumer Mindsets\n\nAttitudes and beliefs are mental stances and convictions that influence how consumers view the world and make decisions. \n\nUnderstanding them can help marketers align their campaigns with consumer ideologies.\n\nExample: Let’s take a campaign by a sustainable fashion brand as a use case. Highlighting the brand’s use of biodegradable packaging and commitment to ethical sourcing to appeal to consumers who support minimizing waste.\n\nActivities and Interests: Identifying Consumer Preferences\n\nActivities and interests refer to how consumers like to spend their time, including their hobbies and media consumption habits.\n\nKnowing what consumers are passionate about helps your business develop products and marketing strategies that cater to their preferences.\n\nExample: A sports equipment brand might target outdoor enthusiasts with a campaign centered around mountain biking adventures. Showcasing the durability of its biking gear for rugged terrains.\n\nSocial Status Dynamics: Impact on Consumer Choices\n\nSocial status plays a crucial role in consumer choices as individuals often make purchases to reinforce or enhance how others perceive them in society. \n\nMarketers often capitalize on the gap between a consumer’s current social standing and where they aspire to be. \n\nExample: Luxury car brands might market their more accessible models to those with middle incomes. That way, they position these vehicles as gateways to higher status.\n\nCore Values: Unveiling Consumer Ethics and Morals\n\nCore values are the fundamental beliefs that guide people’s decision-making. If your brand aligns with core values, you stand to build stronger connections with your audience. Those that conflict with these values risk alienating their customer base. \n\nTake a cosmetics brand that strictly adheres to cruelty-free and vegan product standards. It could launch a campaign emphasizing its no-animal-testing policy and use of plant-based ingredients. \n\nLifecycle Stages: Adapting to Consumer Evolution\n\nLifecycle stages refer to the progression of a consumer’s relationship with your brand, from initial awareness through to loyalty and advocacy.\n\nUnderstand where consumers fall within this spectrum to tailor your strategies to the evolving needs of buyers at each stage.\n\nFor example, a fitness app might offer free workout guides to new users to spark interest. Followed by a subscription deal on personalized fitness plans for those who engage regularly. Plus discounts on premium features to foster loyalty and encourage referrals from committed users.\n\nNow we’ve identified seven different types of psychographic data that can support your marketing efforts, let’s look at how to gather this information.\n\nMethods for Collecting Psychographic Data\n\nWe recommend the following effective techniques for conducting psychographic audience research.\n\nUse Audience Research Tools\n\nOne way to gather psychographic data is through market research tools with audience analysis features, such as Semrush’s Market Explorer.\n\nThe tool gives you a quick snapshot of the general interests and media consumption habits of consumers within your market. Plus information about market size, your market share, and top competitors in your niche.\n\nAnalyze Your Market\n\nwith the Market Explorer Tool\n\nSign up Now →\n\nThere are three ways to research your market landscape in Market Explorer.\n\nSelect “Create List” if you already know which industry players you want to analyze. Enter up to 100 competitor domains, name your list, select a desired location, and click “Create and analyze.”\n\nClick “Find Competitors” to learn who your competitors are. Enter your domain into the search bar, select a location, and click “Research a market.”\n\nOr pick “Analyze Category” for a bird’s-eye view of a specific industry. Choose your business category, select a location, and hit “Research a market.”\n\nMarket Explorer will then generate four reports for your chosen market: “Overview,” “Audience,” “Benchmarking,” and “All Domains.” \n\nYou’ll find psychographic insights in the “Audience” report.\n\nTo illustrate, we researched UK-based sustainable clothing company Rapanui. We used the “Find Competitors” option to analyze the market for the brand’s top competitors.\n\nHere, we see a range of insights about the market’s demographic breakdown, socioeconomic characteristics, and psychographic information relating to audience interests and social media preferences.\n\nIn our example, the audience’s top interests are retail, education, and computer software and development. Their preferred social media channels are YouTube, Facebook, and Instagram.\n\nMarket Explorer is great for understanding the broader market. But what if you want to dive deeper into your audience and see how it compares to a handful of your biggest competitors?\n\nFor that, you can use Semrush’s One2Target.\n\nThis tool also groups audience data into four reports, this time: “Demographics,” “Socioeconomics,” “Behavior,” and “Audience Overlap.”\n\nEach report contains several metrics to help you understand your competitors’ audience—and your intended target audience—on a deeper level. Including data related to household sizes, employment status, interests, and preferred social media channels.\n\nUsing One2Target is simple. First, you’ll need to define your audience. \n\nHow?\n\nAdd one competitor’s domain at a time, or up to five simultaneously, using the “Check Competitors” option. \n\nOr import a list of up to 100 domains for broader market insights and click “Create List.”\n\nHere’s what that looks like, sticking to our example of Rapanui.\n\nNext, select a location for your market audience. In our example, we set the location to “Worldwide.”\n\nFinally, hit “Analyze” to generate your reports. \n\nFirst, you’ll see the “Demographics” report.\n\nWhich shows various demographic insights about your audience, segmented by age, sex, and geographical distribution. \n\nNote\n\nCombining demographics and psychographics is key to forming a complete picture of your target market. We’ll cover this in more detail later.\n\nNext, you’ll see the “Socioeconomics” report:\n\nWhat could the data indicate about our target audience’s psychographic makeup? \n\nAs full-time workers, we might infer that they’re likely to seek out activities that help them unwind and disconnect from work—like yoga, meditation, or outdoor pursuits. \n\nTheir high education levels could imply an interest in continuous learning, personal development, and sustainability. \n\nAnd a low-to-medium income could suggest a preference for affordability when making buying decisions.\n\nNow let’s see what the “Behavior” report can tell us about audience preferences.\n\nThe majority use their mobile to access channels like YouTube, Facebook, and Reddit—the three most popular social platforms in this case.\n\nWe also checked out Patagonia, an outdoor wear brand committed to environmental sustainability. \n\nHere’s what Patagonia’s “Socioeconomic” report looks like:\n\nAnd this is its “Behavior” data:\n\nWhat we see above consolidates the data from Rapanui’s audience breakdown. Most of Patagonia’s target customers are also college-educated, full-time workers with a low-to-middle income. They share the same preferred social channels, too. Showing a consistent target market across competitors. \n\nThis competitor analysis helps you gain key insights into your potential customer base and who you’re up against. \n\nPro tip\n\nUse the Semrush suite alongside other tools to gain accurate insights into your target market and audiences. Our comprehensive review of market research tools examines the best market analysis tools to help you conduct in-depth research.\n\nStreamline Audience Research\n\nwith the One2Target Tool\n\nLearn More →\n\nAccess even more granular psychographic data with Semrush’s Audience Intelligence app.\n\nThe tool classifies your audience by personality types, online habits, media affinities, and top influencers. As well as providing demographic and socioeconomic insights.\n\nEnter your brand’s X (formerly Twitter) handle to create a report.\n\nNote\n\nA paid subscription to the Audience Intelligence app lets you generate one report per month. You can buy additional reports within the app.\n\nThe main report dashboard gives you an overview of your audience’s demographics, top brands, influencers, and content sources. Together with a visualization of your main audience segments.\n\nHere’s what the report looks like for sportswear brand Lululemon. Click “See all segments” to explore your audience in more detail.\n\nThe interactive graph on the left clusters people into segments based on shared affinities and interests. By grouping followers of similar online accounts.\n\nOn the right, you’ll find additional audience data. Including a breakdown of top keywords found in their bios, a summary of their top influencers and content sources, and a list of the top hashtags they use.\n\nScroll down to see the segment cards—giving you a top-level overview of each segment’s unique characteristics. Click on any card to compare that segment with your broader audience. \n\nThis takes you to the “Audience Breakdown” dashboard, featuring nine sections of in-depth data including “Interests,” “Media affinity,” and \"Buying mindset.”\n\nLet’s look at the “Buying mindset” for Lululemon’s “Family & Lifestyle” segment.\n\nCompared to Lululemon’s broader audience, the “Family & Lifestyle” segment is more likely influenced by social media, online ads, friends, and family. It’s also more inclined to make spur-of-the-moment buying decisions.\n\nWith these insights, Lululemon could target the segment with Instagram ads promoting limited-time offers on selected items.\n\nPro tip\n\nWatch the video below to learn more about using Audience Intelligence to develop your psychographic personas and adapt your marketing strategy accordingly. \n\nReview Your Website Analytics\n\nAn analytics platform like Google Analytics 4 (GA4) doesn’t provide direct psychographic data about your website visitors. Still, you can sometimes infer user preferences by observing their online engagement patterns. \n\nImagine you own a cosmetics company, and you’re considering whether to expand your eco-friendly product ranges. \n\nHere’s some context.\n\nWhile your customers don’t explicitly express interest in eco-friendly cosmetics, you notice that many of them consistently purchase your sustainable options and spend time reading your brand’s environmental policies. \n\nThen it’s safe to assume they prefer “green” options. \n\nThe Google Analytics Audiences feature lets you group visitors based on their shared attributes, including how they interact with your site. Which results in creating a custom audience. \n\nWhen you share an audience with Google Ads, you can retarget that specific group of users with a more personalized ad campaign.\n\nNote\n\nProvided you’ve linked your Google Analytics to Google Ads, your custom audience will automatically become available in Google Ads. \n\nImagine you create a custom audience of all users who have viewed your site’s sustainability section but haven’t made a purchase. You label this audience “Eco-conscious non-buyers.”\n\nFrom there, you could run retargeting ad campaigns for that specific audience, highlighting your brand’s range of eco-friendly products.\n\nConduct Digital Surveys and Questionnaires\n\nSurveys and questionnaires are a relatively quick and inexpensive way to collect psychographic data from a large sample of your target market. \n\nThere are tons of high-quality digital survey platforms to choose from, such as Qualtrics, SurveyMonkey, and Google Forms (below).\n\nThe key is to design your surveys and questionnaires with clear, targeted questions that directly address the psychographic dimensions you’re interested in exploring. \n\nFor example: \n\nHow do you typically spend your free time? (Options: reading, outdoor activities, socializing with friends, going to the gym, etc.)\nHow do you feel about the use of artificial intelligence in everyday life? (Options: excited, concerned, indifferent, etc.)\nTo what extent do you agree with the statement: “It’s important for me to contribute to environmental conservation”? (Scale from ‘strongly agree’ to ‘strongly disagree’)\nWhat do you care about most when buying [product category]? (Options: quality, price, brand reputation, social status, etc.)\n\nImportant: Lengthy surveys with multiple open-ended questions could result in lower completion rates. Keep them as brief as possible and focus on yes/no and multiple-choice answers.\n\nYou’ll also need a big enough sample size to ensure statistically significant results. \n\nPro tip\n\nAs a rule, aim for around 100 respondents. Run the survey past other team members first to prevent biases.\n\nIf you’re having trouble securing enough responses, consider incentivizing participants with free products, gift cards, or discount codes.\n\nInterview Customers for Deep Psychographic Profiling\n\nConduct non-scripted, one-on-one interviews with a few existing customers to uncover hidden insights into their preferences and motivations.\n\nThe goal here is to let participants provide deep, unguided responses that reveal the nuances of their wants, needs, and how they relate to your brand. \n\nIt’s a good idea to start with broad questions about participants’ values and experiences. Gradually nudge the conversation to a discussion about your products or services. \n\nThis approach lets you place customers’ opinions about your brand within the broader context of their lifestyle and beliefs.\n\nRun Focus Groups for Broad Psychographic Perspectives\n\nA focus group involves having a group discussion between you and members of your target market. These can be conducted in person or online.\n\nAs with one-to-one interviews, you aim to encourage all participants to openly share their perspectives and experiences. Diving deeper into relevant topics as they come up.\n\nFocus groups often reveal a wide range of psychographic perspectives. \n\nFor example, some members may bring up how they consider a brand’s social impact before doing business with them. Or express a strong preference for brands that are upfront and transparent in their communication. \n\nOthers may indicate a preference for experiences over physical possessions. \n\nSince strong personalities can easily dominate group discussions, your moderator must ensure everyone feels free to express their views. \n\nCollaborate With Your Sales and Customer Service Teams\n\nPromoting closer collaboration between customer-facing teams helps you compile valuable customer data that would otherwise remain compartmentalized within your business. \n\nUnderstanding how customers think doesn’t only concern marketers. \n\nSales teams spend their days overcoming objections and discovering what makes customers tick. They can: \n\nIdentify which aspects of your offering are most important to your customers\nReveal common preconceptions about your brand that make prospects think twice before doing business with you\n\nMeanwhile, customer service teams are the first to hear about your customers’ concerns and criticisms. They’re in a prime position to point out where your product or service excels or falls short of expectations. \n\nFor example, customers often give feedback on features they feel should be added or improved—shedding light on their underlying needs and desires.\n\nHow to Use Psychographics in Marketing Strategies\n\nNow that we’ve covered the basic components of psychographic research, let’s consider two core applications of psychographic marketing. \n\nIdentify Target Audiences and Personas with Psychographics\n\nYour next step once you’ve collected psychographic insights from various sources is to consolidate and analyze the data. This helps you identify any distinct psychographic profiles that make up your target audience.\n\nPool all your collected data into a centralized database or customer relationship management (CRM) system. Categorize each data point based on the psychographic criteria we mentioned earlier—like lifestyle, personality, and interests.\n\nNow, you’ll need to conduct data analysis to see where these criteria overlap among your audience. For this step, we strongly recommend seeking the support of an experienced data analyst. This could be an existing in-house team member, a new hire, or a part-time contractor. \n\nGoing back to our eco-friendly cosmetics brand example, you might find that a significant portion of your audience not only values sustainability, but also leads a physically active lifestyle.\n\nOnce you’ve identified these overlapping criteria, start defining distinct audience segments or buyer personas. To target different parts of your audience with offers and messaging that resonate with them most.\n\nFurther reading: How to Create Your Buyer Personas: the What, the Why, and the How\n\nEach persona represents a group within your target market that shares specific psychographic characteristics. Develop detailed personas for each segment, highlighting how their psychographic characteristics influence their purchasing decisions, media consumption, and engagement with brands.\n\nHere’s what you might want to base a buyer persona named “Eco-Conscious Consumer” on:\n\nTailor Marketing Messages Based on Psychographic Data\n\nAfter defining and developing your psychographic personas, start adjusting your messaging and personalizing content for each customer type (assuming you have more than one).\n\nFurther reading: Content Personalization: What It Is & How to Do It\n\nThe ideal outcome would be to tailor all forms of communication—web copy, email copy, landing pages, ads, sales scripts, blog posts—to resonate with each distinct psychographic segment. \n\nBut a more practical approach is to prioritize your efforts on the channels and content types most likely to influence the purchasing decisions of each persona. Think:\n\nKey landing pages: Develop customized landing pages to appeal to the core values and interests of different personas. Pair your landing page copy with aspirational images, customer testimonials, and calls-to-action (CTAs) that speak directly to the motivations and desires of each customer type. \nEmail campaigns: Segment your email list according to your specific psychographic profiles, ensuring your messages address the unique priorities and preferences of each group. Personalize your subject lines and share content and promotions specific to individual personas’ tastes.\nSegment-specific ads: Create targeted ad campaigns for each audience segment, featuring copy and imagery that caters to their distinct pain points, wants, and needs\nExamples of Psychographic Marketing in Action\n\nIn this section, we look at what psychographic marketing looks like in the real world.\n\nNike’s ‘Dream Crazier’ Campaign\n\nIn 2019, Nike launched the “Dream Crazier” campaign as part of its broader “Just Do It” series.\n\nThe brand highlighted the challenges, stereotypes, and double standards women face in sports. Encouraging women to break barriers without fear of judgment—and redefining what’s possible. \n\nAt the heart of the initiative were real stories of female athletes who overcame significant challenges to achieve greatness in their sports. \n\n“Dream Crazier” targeted a specific psychographic segment of Nike’s audience: female sports enthusiasts seeking empowerment through athletic endeavors despite societal pressures.\n\nThe campaign not only celebrated women’s sporting achievements, but also positioned Nike as a promoter of gender equality. \n\nAirbnb’s ‘Live There’ Campaign\n\nIn 2016, Airbnb launched its “Live There” campaign. The goal was to differentiate the service from traditional hotel options by offering travelers a more authentic, local living experience. \n\nThe campaign featured a series of ads encouraging travelers to immerse themselves in local cultures and communities. \n\nImage Source: Dexigner\n\nIt highlighted Airbnb’s unique value proposition: providing access to local homes and neighborhoods so travelers can live like locals, rather than tourists.\n\nThe “Live There” campaign targeted a distinct psychographic segment of travelers who prefer real cultural discoveries instead of what regular hotels offer.\n\nBy catering to these psychographic characteristics of its target market, Airbnb successfully positioned itself not only as an accommodation platform, but also as a gateway to authentic travel experiences.\n\nCombining Psychographics with Demographics\n\nBringing together both psychographic and demographic insights to segment your audience will likely provide a more complete picture of who your consumers are. And what drives their buying decisions.\n\nHow so?\n\nIf you only factor in your audience’s demographic factors, you’ll struggle to pinpoint the “why” behind their consumer choices. If you only consider their psychographic characteristics, it can be difficult to accurately predict the size and viability of your market.\n\nConsider a high-end organic grocery service that wants to attract consumers who value sustainable, organic products. \n\nThe business builds its entire targeting strategy on this psychographic profile without accounting for demographic factors—like location and income levels. The prices are at a premium and products are only available in certain cities. \n\nThen, it turns out that most consumers live in rural areas and don’t have much disposable income. \n\nThe result? The grocery service fails to acquire many new customers.\n\nThis scenario shows the importance of a holistic approach to audience segmentation. Blending psychographics with demographics gives marketers a more nuanced understanding of the customers they want to target.\n\nConvert More Customers with Psychographic Insights\n\nResearching what makes consumers gravitate toward certain brands, buy their products, and stick around as loyal customers can greatly boost your marketing team’s efforts.\n\nPsychographic research is the art of discovering what makes your audience tick. Customer interviews, sales team feedback, and research tools like Market Explorer, One2Target, and Audience Intelligence can all provide invaluable insights into the pains, needs, interests, and desires of your ideal customers.\n\nWhen combining these insights with demographic data, you’ll be able to craft better offers, more persuasive campaigns, and, ultimately, grow your business.\n\nElevate your digital strategy with free access to audience insights tools and more from Semrush.\n\nAccess 55+ Tools\n\nwith a Free Semrush Account\n\nSign up Now →",
  "headers": {
    "h1": "Psychographics in Marketing: How to Use It + 7 Examples",
    "h2": [
      "What Is Psychographics in Marketing?",
      "7 Key Psychographic Examples",
      "Methods for Collecting Psychographic Data",
      "How to Use Psychographics in Marketing Strategies",
      "Examples of Psychographic Marketing in Action",
      "Combining Psychographics with Demographics",
      "Convert More Customers with Psychographic Insights"
    ]
  },
  "images": [
    {
      "src": "https://static.semrush.com/blog/uploads/media/02/2c/022ce9ade6b5a32801933e6c11d05597/26d1301af93f969eb6319d7dee6e510b/psychographic-marketing.svg",
      "alt": "Psychographic Marketing"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/32/0d/320d74d6b012854d9bdc4aac9162040d/c621dd992585201842dcd4f4c31b5756/9LeCSr_nusUKtHU6o1dwdLZVfU08scr7H4Tq_Co5pRQO8b655BRwYGFr5ejU1FlXY3_b23IMcdtt5YacH5XWc5QSCTQw7Y-0MiAq-Labz4ogqJIGtTmVNFyF1xLKb0d6vI46AZe0z7BSKtJW8X69D8w.png",
      "alt": "Psychographics vs demographics factors examples"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/1f/72/1f7211712d449d85fb0e0c8318dd39f5/540b18608d17b4a9ab8926dd4e6e8e3b/QYYa6b6_WoXgquKRKTc6rRC_VRckTzLgfaIJXM1arwU7kgYB_yw-ZNWk5yF_Vdwe5jFZg2ioCeVo2vt7er5kG4haknoUZL8f8wWIiQoGiOHxdfnP_vAbc0hzXDlSs9w2t2CabYCER1mQAmP_peVPwB4.png",
      "alt": "Examples of customers’ daily habits"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/6b/8f/6b8f6587c59f291dac532ee0b7e7d7cf/07aa1d4fabe3a1d9f8b4b2028edb2932/DiB9edrXmAXsz66b2jtsyHMVbaCeezNUpfvlBLwFytvSnqGAAJ2uBeaaF81qOnmMDlK3ejLqVFAtLPOBkMk4cxRrFVC3BtZQ4O_EtyuOilpIQHVDTYAkaS3CI0kMEk7BCBDkq5bdKBgQqVc6UWvz3OI.png",
      "alt": "“Big Five” personality traits: openness, conscientiousness, extraversion, agreeableness, and neuroticism"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/93/3f/933f7cd5e45ded402d7022432c07726f/29a7be9181cc6b2fb2d02ed91cff2f3d/CqDmmpidSO98GFe987xKfP0x1KBybwkhgsQoxYzZmbzR0dJyaLaoZ43t6EAShoRzCNvEoy_gbf3mly0WzCPqxwt_wIzP8RYflAc4aTFZnXf_48bUU8fziL76mJEgoMa9CSjd4eJUqL_keS8q2BnyYL0.png",
      "alt": "Examples of consumer preferences, including listening to podcasts, playing video games, short-form video content (like TikTok), and others"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/66/df/66df39a6c42aec17bec99f26b96da8a1/667983eae41b820f6a5b8b7d5233b7f1/lq_UPNF5Q9fu-dao7A4OTqYkEKVsld-FGy_MH5Ky4xH1ETVklyLwNUpt-hFhgBKVjbitzG3NDN4W_ApT8zw25KQZ1OPSjhjsgjG55SGywhtLM-I2vg4rBvQEd3C8ZHXNHMpMRI9SyEfO_hfT64JihAk.png",
      "alt": "Customer lifecycle stages: discovery, dedication, evaluation, purchase, loyalty, and advocacy"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/55/7b/557ba3b8c0ddab710a77214dea7dc51d/1c579d80bbf15aec813bcaa46399959f/CXkuD5MNwDa4DICAnnRY4TjiRSmsd4G5GFZs_qvb3pQUHCja8xWhqchqHjEnzmXsTl28266G_zpNY_DBqPY5Qm5fdFf5nxhJew9Cv_k084g6YAU_BaNG9pkJRPeCrzLh8XUx0X-mKy3aZ5q0bpQAB1k.jpeg",
      "alt": "Market Explorer tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/63/07/630795a47ccd2dac238d18bbc49b1fc8/cf56c9f072f0eee6a30650039e9ed1a5/ft0f_Fxg22kf3IRvyY9DxFelI3vklBiEqPjXnL74NWgPbLSKOkFn-Y_l9pg77TtoRSAD1tI1OXVjARtdrFa5P_1ahs2MZ2ApRyJW5Dw49DYwpEusDChNT1TmQq7zHgCiqC84YdM--lzAPw0Q4QWADnM.jpeg",
      "alt": "\"Find Competitors\" option in Market Explorer tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/6f/63/6f635bca882d59b31313e53a57132772/3483b15e64d2a53372b8557e4e019343/oChk_bTtImUDLaq9uLobbIf_0J73U9LClEoqLE1hbEmW5gZlJCOmtAV_3c8CmGTE8DFkGM_oc-GWVWkOQqI465JzGPyoJJpQxeoKTbZ8Y1knP2LFK440lZMejivLrLMqC1XluWxtry0QQNUaq633Psc.jpeg",
      "alt": "\"Analyze Category\" option in Market Explorer tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/9a/85/9a856c4e676221c3ce172e6746ccde54/c75f7e68b8b7a4429ebb383b5c92536e/QBZ7bTleWfm-XvTsjNeXzDqbRKYuoojFOb6xMgeEJLNQhIkhh34XpmqEc7o57zXFheOuKzqgESoCsdYr4dhT-yUwN-ro-0H6_v9lLJ_827o2HCpu2trbKgHVJfje7bQNj0KuWLNSvBC12WJCsxEN85Q.jpeg",
      "alt": "Market audience summary, demographics, and socioeconomics data shown for Rapanui in Market Explorer tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/47/ca/47cae2053b8232f0960dfca852fc9b7e/72247d9cefbd38821d9537b3b3f3091c/bOFV4VsrWYz14ZtFdhye1C-jqw6dcRnUOKqNi7HmYeLTjMSK83PHnOGW0sqdoOEoAksGvsThdf-Ta5rZxIgp3eh-c7pG8k4iBAKM8UkExEaLbwQuf1XJmkVg78lHGNudkkxpXPeCyhS3lKaytDIbH9M.jpeg",
      "alt": "Audience’s top interests and social media channels data shown in Market Explorer tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/d3/3c/d33c5a0183bccfed1ac1b72daeef9d5e/aa0a7644b5935e9fd4d3fe5215117ee7/_4y5dNpiUzHmrd0NYumHuBSfQ0ueGtjQlkpgyfeO9bxqyrkbV44IdPqMwrJrxlD5HgbIccXrnPO3gwYG2nqyblQjdZ1975owdMTAd0VYytrJmCpUKQoVpgPldmEeExbfqe1lTReOKhlJ_UwvEfv22Og.jpeg",
      "alt": "\"rapanuiclothing.com\" entered into One2Target tool search bar"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/4b/1f/4b1f52842f6079b0a93bdd8a73f7014a/97fa1cdef1cfbc60f7abed283e15c368/1y9QEfSPN-1bRLcdFLw_WJ9X4mBb547C7wzqnlZikvpMuDNiEBz2iJr_ccr3XOJnNcFIodvpc4aQjvTOGneE6JymcV6dO4oYKj5CU1nQoj9oIe_jMGida6Oxf59u0Twx67Km47K9_G4m7tJi58QokhI.jpeg",
      "alt": "\"Demographics\" report in One2Target tool for Rapanui, showing audience breakdown, unique visitors, and distribution by country"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/00/51/00514ea78e6f93816c28a06b108acae8/2075e50db47d763cee6554bddae1f98a/tTxLVAmrtPp9jwXI4Yj6UGW8vOi0mkoMfhmiqRsDschNO2fUwlHCoWG2fpzaL3kPOcwF8JyTkFiE8kafdOpOcZM6vLIm_sRhA786WtDqOySe_iG5dHf5mpnYieIw8yCbR4PXO2aqoDiWHW4NbG2NroQ.jpeg",
      "alt": "\"Socioeconomics\" report in One2Target tool for Rapanui, showing audience's households, income level, employment status, and education level"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/9f/e7/9fe77d85a4c3c151327745100e88fecb/c85f0ff0e9a2b8fae249952bca51c3d1/Gk024f8VrwAmM5VdGltyAr1GMHPsrovQZ5vWva-gm3-9pqts5KAXpIo5RyH-znoF88f7kGkGMA005ajfVSd9_MZWGrhOvkdHGGXrNqzy4RQSxC8PNXFMoQYIHtMib25bDEgCSCDcHRliGPz5siJ2RoA.jpeg",
      "alt": "\"Behavior\" report in One2Target tool for Rapanui, showing audience's interests, devices, and social media usage"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/58/2c/582cea0453ccd3554b9a655a65130190/7cf1b1986a419e2e9672e101848f00ac/M8n49K_QB36dgQzwJFp4Fh1x23B9adOHeVwHkqJmnq8WlLXABpotiCwXLK5sSYcYj8qevjZcrDCy1rTrYPPYHUx7hu9fZUgDw7dt13IrrXRuHjmXiyeMBlerAk5m1a8BaYtyEV_Xry8l4wtT9scMR5w.jpeg",
      "alt": "Patagonia’s “Socioeconomic” report in One2Target tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/f6/5c/f65cb76c5f7534ab3f3caf8a3e1a9a92/184fb9f23dc69b7bc5c840d3b42b3410/-hoh1kgt6RmJn5cu_FeVpyzF_ZE8xSVdmm-4GGBFiIkGpbsLBbwgGEaEpoy1O1bGud3n3FNfNV8OHP1SayK1Ur3ySzoxZF5-CYTkrT03gpAGnVR9-0cmsD9JlbRFzwVGQ1fhBDy3ZY4Fx-PMzFrQNQY.jpeg",
      "alt": "Patagonia’s “Behavior” report in One2Target tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/9c/89/9c894d2bc21eca1761c708a210e164cd/328ce338214a3c09783a037906b097f1/UHr2gh8J0PkroTY7ulQMfWZ5hzO53g5Jcw8tN5Wa2aA7TENrHc_9kPkHrfDMOKiuy8urPWOXdNeadHe67uXM6LyY6GJs8bSnlS3M748e-NgIiwsXrks4hD9b5M-mdjONcsysLbLGkm6n-gBfYlwWJhc.jpeg",
      "alt": "\"Create new report\" window in Audience Intelligence app"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/b9/28/b92831ebab0cd397539a292e1b18ddc8/92f1ff0dae4b73486ab92f52544e7507/jRXWn9zshMqggJCUprMALNi46YqAlreYpRSBBilpbqsm_ryfjVHu7PtpOI96juSANRxVJ2Lhzkne2sHXRyH5-LdJmH7M3TqBERIoQoZLjXbIc7slClwY0g3y30575rx9ThCzX2FUSvwV8zmJwK1roNY.jpeg",
      "alt": "Full audience report for Lululemon in Audience Intelligence app"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ce/6c/ce6c8c3845626c7d12a885b197a774c3/d6d13b8df75367ea783ef122301db205/pg1MyryxN63MjJ-ctFAxu10C7Qu5sKFQm0Cjwpsm4rrP0V_xnLwYLClHQVz7T0ldUs41sHnaSt1uJw6gagr_5Nb1ikrC2h-kJAzjSelmzqHN3_Zge30pMoabmGSzEQHTiC8uWcrYkqyrzZd74N7WBr0.jpeg",
      "alt": "Segments distribution, top bio keywords, distinctive affinities, and top hashtags data shown in Audience Intelligence app"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/27/9d/279d12b5e6e0aedbd5254aa451330a55/cd2021d8bea3be8d20213ee733c4230f/dXIpJGTv1cxufJ8yo5__DYX8OpsDpqvvKIj3yeBp3WFstlxLuiE5Xxz_bIvKk18V6fsePntZagbcNn0auqN_nlFTUDQlCHPVjnBTQvrEqpXZNeNNFR0y70y_y3V0qaKKtsqzxBxvAVSSZXxp2n7bs-s.jpeg",
      "alt": "Segments cards section of Audience Intelligence report"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/fb/f4/fbf4fdaa433d67a88d0d714615615db1/bb5dcd91a591e06e9467e9ae9622af92/4wiXuYVkwqsPCe0wtvHW6iaO77pxfirt6ZofLNhfb-BUAPAYuO-MYFc430e0KwIILtudQo7RAHwxOpUPdqBJlpbQmm2eTEOLtc1bRvLYa8EaF55eHHGX4ZCmSN07pRR0fb7uU_1hZi6L-kOtCM-etiw.jpeg",
      "alt": "“Buying mindset” dashboard for Lululemon’s “Family & Lifestyle” segment in Audience Intelligence app"
    },
    {
      "src": "https://i.ytimg.com/vi/7W1TdwSFMCk/hq720.jpg",
      "alt": "Youtube video thumbnail"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ed/fc/edfcc255ada87b80d42f08ba72694307/595e802d8e993dd019ca85f88bbd7049/VRWzo5QcRB0keoBOx5gnmDovsK9bF1xJ3AloA7bJUZIl63aH3uj1QgMia4zQgfpemFKx_dxGnS__EfrQeRl0vaPOzk6wClwWc7tyzkPuOPphZnpvF98OAp6DMfj7LvzkH3wL4xBfHF11NkHv1k2oWaE.jpeg",
      "alt": "“Eco-conscious non-buyers\" custom audience overview"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/1b/f8/1bf8669f9429dca1f688871ae26726b9/97e4440cb1cc21aa58d8cc28debe19a7/wv3oVcTrLgO5qFS61yV6lsAz-my0yzHiAF7LUe3TVIFm9l28sO1IPpUB68onpd1L2DJAiiQPIzXYMU-RkHZD-R5ccz0cegqVO7R3InYdGhupHrh-9m_9rvUmOkqEuZULrh2g1q3H6mqwtqVT1OGErsw.jpeg",
      "alt": "A survey created in Google Forms"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/b8/64/b864311ba2e891e1f7f2a41e59585bf9/651c78f8af7378c21244965df9ef30d0/ZJMarMoU9ycpsXdif2iW5PFzhUSSmUKQxkPzJxpyaDvTAJIGLAn3BPYtFydKE3wGD3gTQRpOD1XPrP3f_FxVtzwDHY1oaY6wLgGc_87ZzeqnUClx8x91GSoCyJVJBaeDLQT1Qmj19W7YkNLAkkQ2mMg.png",
      "alt": "An overview of interests, values, lifestyle, and attitudes of “Eco-Conscious Consumer” buyer persona"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/20/35/20350cb0fb476a5072fc4fd7c6d12c72/ef48122ab699d38057c27b97925f3f3e/U3ZgUVMqThN8uCreBJviWeGVDKypdNDKQ-BtU7Ac_mecQHDrzjEPwE7wSbiItDIK-RTCo7yqwQ4HG_92H8k6Bs8nahlSGHqe4XqKm2Ehdz7j0kJ_-bXng-2-jw1BhVo3XOL3tLPY1olZAlJI6rQPqes.png",
      "alt": "\"It's only crazy until you do it\" slogan from Nike's “Dream Crazier” campaign"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/de/2d/de2dc54b93b3ef73e144d38db5aa99cd/fcf27fd51f1a28fca40fdf58e9f105e0/yZiXcmkd7NAfgQ4fFuFr09j_8qbAuDSqqf5ztfJIlkPUB3qDx3jMYYgltKtoh8WPgrI5omhSfj5NQqQCGXqHPQQkPTqwEI_UC_eDKzwZsBNgX84wmB_2k7W_WqHuqZ-gYuIwxxfyd3p1IA7InUbacZQ.jpeg",
      "alt": "An ad from Airbnb's “Live There” campaign"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&d=Mon%2C%2021%20Oct%202024%2014%3A17%3A45%20GMT&n=4d&b=Psychographics%20in%20Marketing%3A%20How%20to%20Use%20It%20%2B%207%20Examples&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fpsychographic-marketing%2F&enc=UTF-8&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://bat.bing.com/action/0?ti=5128787&tm=gtm002&Ver=2&mid=dfc6d1bd-2049-44b0-8dca-719466d996d5&bo=1&sid=3dfa42408fb711efafd8870fff463c26&vid=3dfa8e408fb711efadd04d380e321041&vids=1&msclkid=N&uach=pv%3D10.0.0&pi=0&lg=en-US&sw=1536&sh=864&sc=24&tl=Psychographics%20in%20Marketing%3A%20How%20to%20Use%20It%20%2B%207%20Examples&p=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fpsychographic-marketing%2F&r=&lt=788&evt=pageLoad&sv=1&cdb=ARoR&rn=168049",
      "alt": ""
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&b=Psychographics%20in%20Marketing%3A%20How%20to%20Use%20It%20%2B%207%20Examples&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fpsychographic-marketing%2F&enc=UTF-8&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    }
  ],
  "publication_date": null
}