{
  "url": "https://www.semrush.com/blog/redirects/",
  "title": "Redirects: What They Are & How to Use Them",
  "content": "What Is a Redirect?\n\nA URL redirect (sometimes called “URL forwarding”) is a way to send users and search engines to a different URL than the one they requested.\n\nRedirects are used to move a webpage to a new address, ensuring that visitors and search engines are automatically taken to the correct page.\n\nCommon redirect types include 301 (moved permanently), 302 (moved temporarily), and meta refresh. \n\nPro tip\n\nFind redirect issues on your site with Site Audit.\n \n\nWhy Are Redirects Important?\n\nRedirects are important for a few main reasons:\n\nRedirects Ensure a Good User Experience\n\nRedirects ensure visitors don’t land on broken or duplicate pages on your site. \n\nHere’s an example: \n\nLet’s say you wrote a blog post about the best golf courses in Michigan in 2024. And the URL was “yourgreatsite.com/blog/best-golf-courses-in-michigan-2024.”\n\nIf you decide to update the post in 2025, you probably want to delete the year and publish the updated post under “yourgreatsite.com/blog/best-golf-courses-in-michigan.”\n\nThis makes the old URL no longer accessible.\n\nBut people who read it before the change might have the old URL saved in their bookmarks. Or they might have shared it somewhere on social media. And that old URL might still show up on search engine result pages (SERPs) for a while.\n\nIf users try to click on that URL and it hasn’t been redirected to the new one, they’ll receive a 404 error response from the server.\n\nLike this:\n\nThis isn’t great for the user’s experience—those visitors are likely to leave. Which is why you should use redirects to avoid the issue.\n\nThat said, consider whether the previous page truly has an equivalent that’s worth redirecting your users to. If there’s no relevant replacement, then it’s better to set up an informative 404 page. \n\nRedirects Can Preserve Search Performance\n\nRedirects can transfer ranking authority from an old page to the newer version (or help it remain in place when the move is temporary). To maintain rankings and traffic.\n\nUsing the same example from above, let’s say your original article (“yourgreatsite.com/blog/best-golf-courses-in-michigan-2024”) had acquired hundreds of backlinks and was driving thousands of visits from search results each month.\n\nBy using a redirect, that value can be transferred to the updated version.\n\nWhen to Use Redirects\n\nSites typically redirects in these situations:\n\nMoving the URL of a webpage (from URL A to URL B)\nDeleting a page\nAdding category tags or parent pages that affect URLs\nMigrating a website to a new domain\nTweaking URL naming conventions\nMerging two or more duplicate webpages\nSwitching a site from HTTP to HTTPS\n\nYou can apply a web redirect to a single URL, to a group of URLs, or an entire domain.\n\nTypes of Redirects\n\nThere are two main types of redirects: permanent and temporary. \n\nUsers won’t be able to tell the difference, but the distinction is important for search engines. \n\nPermanent redirects are for when you don’t expect to display the old page again. (e.g., if you combine duplicate pages). Permanent redirects tell search engines it’s OK to remove the old URL from search results and start displaying the new one\n\nTemporary redirects are for when you need to redirect a webpage for a limited amount of time. (e.g., you’re performing website maintenance and want to display a message telling users to check back later). \n\nNow, let’s look at the main redirect types:\n\nHTTP Redirects\n\nHTTP redirects use a special code in the HTTP response to tell the browser to go to a different webpage. \n\nHere’s how this process works: \n\nThe user’s browser requests the old (redirected) URL. And the server automatically displays the webpage for the new URL (the redirect target).\n\nFrom the user’s point of view, HTTP redirects are completely seamless.\n\nIn technical terms, these are called server-side redirects. Because your web server (where your website is hosted) takes care of it before your website even loads.\n\nIt does that by responding with a 3xx HTTP code when it receives the request for the redirected URL.\n\nThose 3xx codes are like instructions for your browser. They indicate that the requested URL has been redirected. And reveal where to find the new webpage (the redirect target).\n\nHere are the most common types of 3xx codes:\n\n301 Redirects (Moved Permanently)\n\n301 redirects tell search engines like Google that the move from one URL to another is permanent. \n\nThey’re also considered the best way to pass link equity if you need to redirect a page. That’s because they pass ranking strength from the old URL to the new one.\n\nFor example, let’s say your site has two pages about dog toys. There’s no need for two pages about the same topic. And one of the pages is outdated.\n\nIn this case, it’s best to delete the older, outdated page and 301 redirect it to the new page’s URL.\n\n302 Redirects (Found & Moved Temporarily)\n\n302 redirects tell Google that the redirect from one URL to another is temporary. \n\nUse a 302 redirect when you:\n\nTemporarily move your page to a new URL\nNeed to take a page offline for a short while to perform maintenance\nWant to A/B test new website design or copy\n\nGoogle will continue to index the redirected page. And none of its ranking strength will transfer to the new page.\n\nWhich means:\n\nUsing temporary redirects by mistake could damage your search engine rankings. \n\nCheck for issues by running a quick site audit with Site Audit. \n\nHead to the “Issues” tab and type “redirect” into the search bar. You’ll see the number of URLs with temporary redirects. \n\nGo through the affected URLs to verify that they should be temporary redirects. \n\nYou should only use a 302 if you plan to bring back the original URL at some point.\n\nThat means you’ll want to address any accidental 302 redirects. By making them permanent redirects.\n\nFind Accidental 302 Redirects\n\nwith the Site Audit Tool\n\nTry for Free →\nOther HTTP Redirects\n\nAs far as server-side redirects go, you usually only need to use 301 and 302 redirects. \n\nBut there also are some rarer types of HTTP redirects:\n\n303 redirect (see other): Sends users to another relevant page when the old one isn’t available (most often when users have already submitted a form and cannot resubmit) \n307 redirect (moved temporarily) and 308 redirect (moved permanently): Similar to both 302 and 301 redirects in function, these redirects were important for technical reasons when browsers like Netscape Navigator and previous versions of Internet Explorer were popular. \nMeta Refresh Redirects\n\nMeta refreshes are redirects that happen at the page level (client side) rather than the server level. Unlike HTTP requests. \n\nIf you need to implement redirects, HTTP redirects are typically better than meta refreshes for SEO. \n\nBecause meta refreshes are slower, potentially hurting your user experience. And they could lead to search engines indexing the wrong page.\n\nGoogle only recommends meta refresh redirects if you can’t use a server-side redirect. \n\nThere are two types of meta refresh redirects: \n\nInstant Meta Refresh Redirects\n\nInstant meta refresh redirects trigger as soon as the browser loads the page. Google interprets them as permanent redirects.\n\nThey look like this:\n\n<meta http-equiv=\"refresh\" content=\"0; url=https://www.semrush.com/\">\nDelayed meta refresh redirects \n\nDelayed meta refresh redirects trigger after a number of seconds you choose. Google interprets delayed meta refresh redirects as temporary redirects.\n\nHere’s an example that triggers after five seconds:\n\n<meta http-equiv=\"refresh\" content=\"5; url=https://www.semrush.com/\">\nJavaScript Redirects\n\nAnother type of client-side redirects are JavaScript redirects are another type of client-side redirect. They aren’t recommended for SEO because Google might not render the JavaScript on your page—or run into errors when it does.\n\nIf that happens, Google doesn’t even notice your redirect and indexes the redirected page as usual. Which could make an outdated URL show up in search results or cause a drop in your search rankings.\n\nThat’s why Google explicitly advises against JavaScript redirects:\n\nHere’s an example of a JavaScript redirect in your HTML code:\n\nwindow.location.replace(\"https://example.com\");\nHow to Implement Redirects\n\nYou can set up HTTP redirects in a number of ways. Let’s go over the main ones:\n\nUse WordPress Plugins \n\nYou can use plugins like Yoast to set up redirects on WordPress.\n\nNote\n\nThis is only available with Yoast SEO Premium subscription.\n\nTo start the process, first download the Yoast plugin from the WordPress store and activate it. \n\nNext, select “Redirects” under the Yoast menu:\n\nChoose the type of redirect you want to set up.\n\nEnter the slug (the end portion of the URL) of the old redirect URL and the new URL you wish to redirect to.\n\nMake sure the slugs are spelled correctly. Otherwise, the redirect may not work.\n\nClick “Add Redirect” and your redirect will be live.\n\nUse Wix\n\nIf you use Wix, you can set up redirects directly in the CMS.\n\nScroll down to the bottom of your website control panel. And click on “SEO” under “Website & SEO.”\n\nScroll down and click “Go to URL Redirect Manager” under the “URL Redirect Manager” option.\n\nThen, hit “+ Create New Redirect” at the top.\n\nA pop-up will appear. Select your type of redirect, add the old URL you wish to redirect from, and add the URL you want to redirect to.\n\nFinish by clicking “Save” or “Save & Add Another.”\n\nUse an .htaccess File\n\nYou can also perform redirects manually. With a file called .htaccess.\n\nNote\n\nThis option is only for experts. If you make a mistake, it can cause serious problems for your website.\n\nIt’s in plain text and looks like this:\n\nApache servers use the .htaccess file. (But these can be found on other types of servers, too). \n\nStart by locating the RewriteEngine (which can be found in the mod_rewrite module in Apache).\n\nThis module should already be in Apache by default. But you can also add it using this code:\n\n<IfModule mod_rewrite.c>\nRewriteEngine On\n</IfModule>\n\nNow, we’ll add our rules directly below “RewriteEngine On.”\n\nRedirect a Single URL\n\nTo redirect one URL, use the code below. Specify the type of redirect and replace “/oldpage/” and “/newpage/” with the actual page slugs.\n\nRedirect 301 /oldpage/ https://www.example.com/newpage/\nRedirect a Single Folder\n\nTo redirect a folder, use the following code and replace “folder” with the folder you’d like to redirect and “location” with where you’d like to redirect the folder.\n\nRewriteRule ^folder/(.*)$ /location/$1 [R=301,NC,L]\nRedirect to Another Domain\n\nTo redirect to a new domain, add the following code:\n\nRewriteRule ^(.*)$ http://www.example.com/$1 [R=301,L]\nRedirect Non-WWW to WWW\n\nIf users (or search engines) try to reach URLs without the “www” subdomain, you can redirect them to the URL that does include it.\n\nNote\n\nGoogle views www and non-www versions of the same URL as different entities. \n\nChoosing one “correct” subdomain helps Google understand which one should be considered canonical.\n\nAdd this code to redirect a non-www URL to a www URL:\n\nRewriteCond %{HTTP_HOST} !^www\\. [NC]\nRewriteRule ^(.*)$ http://www.%{HTTP_HOST}/$1 [R=301,L]\nRedirect WWW to Non-WWW\n\nThis is essentially the opposite of the above scenario. If you don’t want users to access the “www” subdomain, you can add this code:\n\nRewriteCond %{HTTP_HOST} ^www\\.(.*)$ [NC]\nRewriteRule ^(.*)$ http://%1/$1 [R=301,L]\n\nNon-www URLs can be useful for direct traffic, as people usually enter in URLs without adding “www.” But keep in mind that you have less control over cookies with the non-www subdomain.\n\nRedirect HTTP to HTTPS\n\nIf you’re looking to redirect HTTP pages to HTTPS pages, use this code:\n\nRewriteCond %{https} off\nRewriteRule ^(.*)$ https://www.example.com/$1 [R=301,L]\n\nKeep in mind that you’ll need to purchase and implement a secure sockets layer (SSL) certificate before redirecting to HTTPS.\n\n5 Redirect Best Practices\n\nWe’ve covered how to set up various kinds of redirects. So, let’s go over some best practices:\n\n1. Redirect to Content That’s a Close Match\n\nWhen you set up a redirect, make sure the new page’s content closely matches the old page’s content. And satisfies the same user intent.\n\nOtherwise, you’re better off using a 404 page.\n\nHere’s what Google’s John Mueller says on the topic:\n\nIf the user clicked on your site in search of a knife, they would be frustrated to only see spoons. It's a terrible user-experience, and doesn't help in search.\n\nNot following this guideline can lead to Google treating a page as soft 404.\n\nA soft 404 normally happens when the server sends the http status code “200 OK.” And the page contains a message such as “webpage not found.. \n\nBut Google can treat a page as a soft 404 if it’s redirected to an irrelevant page. Like in the example Mueller gave above.\n\nYou can find soft 404s with Google Search Console.\n\nHead over to the “Pages” tab under “Indexing.”\n\nScroll down until you see the “Why pages aren’t indexed” section. And search for “Soft 404” in the “Reason” column.\n\nOnce you find the soft 404 errors, fix them. \n\nFor any soft 404 related to redirects, update the redirect so that it points to the most relevant page available.\n\n2. Avoid Redirect Chains & Loops\n\nA redirect chain is when more than one URL redirect exists between the original URL and the final URL.\n\nLet’s say that a page’s URL was previously “www.yoursite.com/about-the-company/” before it was redirected to “www.yoursite.com/about-us/.” \n\nIf you later redirect the newer URL to “www.yoursite.com/about/,” that would create a redirect chain.\n\nBecause now the first URL redirects to the second URL. And the second URL redirects to the third URL.\n\nLike this:\n\nGoogle can follow up to 10 redirect “hops” without issues. But be careful of making things too complex.\n\nRedirect chains that are too long can delay crawling, cause losses in link equity, and increase page load time.\n\nWhich can hurt your SEO and frustrate users.\n\nTo fix the issue, redirect straight from the first URL to the final one. Without including additional redirects in between.\n\nThis is what a corrected redirect chain looks like:\n\nA redirect loop occurs when a URL redirects to another URL. And that second URL redirects back to the original URL. This creates an infinite circle of redirects.\n\nLike this:\n\nThis redirection is broken and won’t actually forward visitors or search engines to the intended destination. \n\nFix redirect loops by choosing the “correct” page and ensuring the other page redirects to it. Then delete the other redirect causing the loop.\n\nYou can use Site Audit to check for redirect chains and loops.\n\nRun an audit and go to the “Issues” tab and type “redirect chain” into the search bar.\n\nClick on the “# redirect chains and loops” issue to get a full report of pages with redirect chain or loop errors.\n\nThe report contains a list of pages, their redirect type, and the number of redirects.\n\nLog into your CMS and fix each one. \n\nTo sum up, you can:\n\nFix redirect chains by redirecting the old URL directly to the new URL. Delete any unnecessary redirects in between. \nFix redirect loops by choosing the “correct” page. Redirect to the correct page from the other page. Then delete any other unnecessary redirects causing the loop.\n\nFind and Fix Redirect Issues\n\nwith the Site Audit Tool\n\nTry now →\n3. Avoid Linking to Redirected Pages\n\nLet’s say you redirect an old page to a new page. You might have other pages on your site that still link to your old page’s URL.\n\nIf so, users will be sent to your old link. And then be redirected to the new URL. \n\nUsers probably won’t notice this. But that extra redirect can contribute to a redirect chain over time if you don’t remember to maintain it. \n\nHere’s what the issue looks like:\n\nSo, it’s best to change old internal links to your new page’s URL. \n\nWhich looks like this:\n\nBut how do you find links on your website that point to redirects?\n\nIt’s simple:\n\nOpen Site Audit and head to the “Crawled Pages” tab.\n\nThen, add your old (redirected) URL into the search bar and click the search icon.\n\nThen, you’ll see a report for your specified URL.\n\nClick on it.\n\nYou’ll then be able to see a list of internal links pointing to your old URL under the “Incoming Internal Links” section.\n\nNow, all you have to do is swap the old link for the new link. \n\n4. Redirect to Avoid Duplicate Content\n\nIt’s not uncommon to find that a site exists on more than one subdomain. \n\nFor example, “http://example.com” and “https://example.com” point to the same domain. \n\nSearch engines view them as separate sites. But this can cause duplicate content issues if you aren’t careful.\n\nEssentially, you could split traffic and compete with yourself if Google isn’t sure which version of your site to direct users to.\n\nYou can easily resolve this issue by 301 redirecting all variants of a page to a single URL. This will direct Google to your preferred page (the redirect target).\n\nUse redirects to prevent duplicate content in the following instances:\n\nNon-www and www URLs\nHTTP and HTTPS URLs\nTrailing-slash (/) and non-trailing-slash URLs\nCapitalized and lower-case URLs\n\nYou can find duplicate content on your site in the “Issues” tab of the Site Audit tool.\n\nType “duplicate”into the search bar to get a list of relevant errors. \n\nNow click on the “# pages have duplicate content issues” error to get a full report.\n\nThis will bring up a list of pages that you may need to redirect. Along with how many duplicate pages exist.\n\nClick on the drop-down arrow on the right side of each listing to see the duplicate pages.\n\nAnd redirect each duplicate page as needed.\n\n5. Fix 404s to Regain Lost Link Authority\n\nGoogle ignores backlinks that point to a 404 page. And that’s a problem because backlinks are an incredibly important ranking factor.\n\nIn other words, you’re not getting any credit from Google for those backlinks pointing to 404 pages.\n\nHere’s a quick fix:\n\nUse Backlink Analytics to uncover 404 pages that have links pointing to them. \n\nHead to the “Indexed Pages.” And tick the box beside “Broken Pages.”\n\nYou’ll get a list of missing URLs that have links pointing to them.\n\nReclaim some of that lost authority by 301 redirecting those pages to relevant pages that are close matches.\n\nRedirect FAQs\nDo Redirects Pass Page Authority?\n\nPermanent redirects pass authority from the old page to the new page. If there’s a close match between each page’s content.\n\nBut keep in mind that redirects may not necessarily pass 100% of the original page’s authority.\n\nIf you have a legitimate reason to redirect a page, it’s best practice to implement the redirect.\n\nAre Redirects Bad for SEO?\n\nNo, redirects aren’t inherently bad for SEO.\n\nBut Google’s guideline is: \n\nIf a page is gone and has no suitable replacement, don’t redirect\nIf a page only moves to a new location, a redirect makes sense and is encouraged\n\nIf you serve a spoon page where users previously were offered a knife (the example Mueller used), a redirect would be a bad idea. And Google might treat the new page like a 404 page.\n\nHow Long Should You Keep Redirects in Place?\n\nFor Google, you should keep 301 redirects in place for at least a year.\n\nHere’s the quote by John Mueller from Google inside a video from Google Search Central.\n\nWhen a URL changes, our systems need to see the change in the form of a redirect for at least a few times in order to record that change.To be certain that a redirect has been seen a few times, we recommend keeping the redirect in place for at least one year.\n\nFor users, you ideally keep them in place indefinitely. So people don’t encounter errors on your site and leave it.\n\nHow Do I Test Redirects?\n\nCopy the old URL and paste it into your browser. If it directs you to the new URL after you hit enter, your redirect works.\n\nIf not, see if there is a typo in the redirect you set up.\n\nAccess 55+ Tools\n\nwith a Free Semrush Account\n\nSign Up Now →",
  "headers": {
    "h1": "Redirects: What They Are & How to Use Them",
    "h2": [
      "What Is a Redirect?",
      "Why Are Redirects Important?",
      "When to Use Redirects",
      "Types of Redirects",
      "How to Implement Redirects",
      "5 Redirect Best Practices",
      "Redirect FAQs"
    ]
  },
  "images": [
    {
      "src": "https://static.semrush.com/blog/uploads/media/6e/11/6e11091f512fc8b351f95fa3e91dabe9/redirects.svg",
      "alt": "redirects"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ff/94/ff941459cfdf023d1c7b4cf2656c6d12/e450cb82fa2d277d2cc6cdac73f3aacd/AD_4nXdjp8Q7SL8IlcPz97GMhbfU2ujDjMHbt54OXH2iQFLnpGeC45yD6aPTgqnogi2zy3G8ej4i9sLX4X_t92EsxLW-rL3nA8VhgUllOMFpz3DlyV7Cbn2qpi3DFjkKQn6VjZqwlyn9zEKuAQ1fJe8lIzcCBVxR.png",
      "alt": "Site health score and number of crawled pages with redirects highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/77/70/7770cbbb7cf03b160df1971ba1e855a1/b34c300908e28b005c6c865500d5bee2/AD_4nXe3C80e98aRJg-KUhKhlyvq0TNnvNLKNhTdG140Xn9Gmp7ZDpGzMpCV5k7KmSptnUYR72REPO3R4Dumm4lAF6s-uKYaUtZA4narcnsh_M2jWVHW9cDBavyoa6KniJNw0-cgqAAsfr7K7NvQbcJQhXSb4Y14.png",
      "alt": "A browser with the url “yourgreatsite.com/blog/best-golf-courses-in-michigan-2023” in the browser bar and “Whoops! 404” displayed on the webpage"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/d6/d0/d6d0747654fb5b085de36f380fabdc10/0ce108e1c7c9b363a0fb0d0f98bc4788/AD_4nXdCeFIlRda69bySDK5juiEBQjqedNf88GilnZYwT32ADCNfS32VChBmQt9_FlNc8-PVwLSesWto0TFwO9728m26hYZlJcnMpWzEs2KqgJbHraJux990u1Z8q1UvWxO_ytwpD6shvw51owoUYblV3nsCAUdo.png",
      "alt": "old page redirects to new page at different url"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/d4/fd/d4fd28d92884962bd5d61960d8d6dfcd/42df01fd7700491061891a4d00e9965a/AD_4nXezWm-PUdY73LL2czqkPXOOTWPRjdN0s2Wphpabj_zY9z1IIJ0mC_rFijcUkd-87JbBdJoCqt0lQ5PxST8iFLi6VCVUYtNePQ3HhkxNcLd8sTl3VoL43CAvJUvfOHVsshPVYiOphWlKX6J3rquZArqkzs5k.png",
      "alt": "Results for \"redirect\" under the \"Issues” tab in Site Audit"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/66/45/6645dc8b43f80387a1b1f5d927f09da3/21ece4879788aaf95243e92488eced17/AD_4nXdrYTSh0NPUa9LIaRx5_G-Gn31q-EUa7zYmHxayQZ418Ma--N_HnHFay5aXRelYdkZwoQ0ydZjfwcgSoSgEtFNRxl4y3op3K7kVhlqDbAoT1byqjCHkAAPXOYych2wsLiL5XCZoMkQyQLIcR2ZPV3FkO-dW.png",
      "alt": "Google says \"only use javascript redirects if you can't do server-side or meta refresh redirects. while google attempts to render every url googlebot crawled, rendering may fail for various reasons. this means that if you set a javascript redirect, google might never see it if rendering of the content failed."
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/84/41/844174c8193a475789e1fd16e1da6ec4/4e73598b1a4f33af3104e58246744e0d/AD_4nXdktBoQmKXtgDYjww-GqOeBSD2JUYmSn6eq9vKRLoqLLRgZ96XmvHzX6JjyaModTOitvnLbhmkpaRl6U0sMS_f7i_pxWqDzFxI_pNNLVosCss94TtAY_6or-2ifxAHHl4NLcT4fWEzSbg-QLSXdNrv4WKZJ.png",
      "alt": "Yoast SEO in WordPress toolbar and Redirects highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/63/b9/63b9005a74fa5817b466e0ede218446b/dec45be69b2d1a9309a12659c996aa9b/AD_4nXcW2AE2JKhO9ipufUTm36de4eVZ5AJxPSYb6TP9WHmc0V1Jv28RjugIVJ4fhbA86CLF-OOHWO6QJRT7wpOIYwTjhI157uQ2uEC1TW9t-7WGs2-iSnyBdNK6BhvyZ0R8Rb7-rM0tnVhqctJVqJG6c9pm0Jnl.png",
      "alt": "Wix SEO in navigation"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/5e/ff/5effb3d88d0414dec9914267e9793871/86e223b0d3dc2b6f3d7ed96c724c2df3/AD_4nXe4NWe6X9a4AeOMAVe3Nae2ow1SIYrLeeVchi58mmkKtm6ICHnzog-cewKQMY_kqBYZ7r8Ji1g-cBpJB_LFPdKPoNbebScS1R0ZvygIhYUN8A5CBQSwp0_K7DHiXnDu-rKkNtGAVV3QMl8dBJHNsimhNZmU.png",
      "alt": "URL Redirect Manager highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/92/c0/92c0c284e4f9e1de4308bff295497322/2588ed5055202984887dac35f5006f6b/AD_4nXcqhAxWclDBmS1Vuqo_vf10x_JpmK7IwTppnzn9ghzoMwxaSSbF29-W7FR0QZg21mF8Jd5g096rAdSPMbda9Xty9ZR5oIHZJwnOtJDWhJDLRymM7xxJBud-g5aXnqVtRoCEimUPHZxC7C6kVXD-rTAhCOyw.png",
      "alt": "Wix add redirect pop up"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/75/49/7549200e6e49be4a865192e9b3a06327/89d7329fb3b58f83bb3bcb304ee42245/AD_4nXfJu0DhfRkx1kOoXyuvPqmTW9i1p5Ux_8Cy63SvD984IkW0D6rjYcsEhka2fVPzfGxdjJ1uc85qmR47upRJcvaSfxrEyoHWqZmztt5CmiXIV5b96l8HAqe__-AwC0PitJAecXdydYXvO3Krg_h1ajiIqqXt.jpeg",
      "alt": ".htaccess file example"
    },
    {
      "src": "https://i.ytimg.com/vi/Fj42gKDQxYI/hq720.jpg",
      "alt": "Youtube video thumbnail"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/1e/81/1e81fc835f6e246d1198b5c8cc2d0195/3a8003bc970994091ae73d516f6b85c9/AD_4nXdCzcfU__LjRIhYxrXCTGC1gZ3C6TaGN5wzI3UMJURnO7M6PeUYJj3B67bX4wIa6Xj5wr6yjB7CPnpUS0WIA8sacTuYvgmkU9UAJ1ahMdzPe6t_LpGszsp7oMLHKypJiX-Y7wynm1Tg5s-TjOKamI85urYc.png",
      "alt": "Google Search Console Pages report"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/d3/86/d3868249af29b6ec06ed8fdc32199885/633cff8f245413fc838f97e86d5d7bee/AD_4nXcD-rIJuLad-UdyTfmi8TLlVsPz2nPo9OBqrgLi2kAXlWm31JJaO-J4qJa93-Se8wnjjM9F72cxRT3dsGrRa6wDq4XAvuFHtnVBEJmFWmptlyk9szWCoX2dYvNcpC0wxv1_DV8DiAjVk8v0Eh5Sh6SK3iOf.png",
      "alt": "soft 404 error highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/3b/45/3b4545d91fcde6e68fa3af0774760d5b/bc38a2c0b255b5dbb5a18f8d1e078a8c/AD_4nXfIldeto4xxnsZtfA0sF7X8tFcVLkOZt4hIjWlG_cH54ToSmLcg7eClz-4wdHxql8BQEaRqZ10PjwFECVGgCiCjxKI4N1t1yX_J13-w4tkm2M60FNuElljl-qX-08ztG2NDFBS2qbUhPXUlTBZ1KL2gzDE.jpeg",
      "alt": "a redirect chain example shows url a redirects to url b which redirects to url c"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ed/16/ed169fae5880346330ecc6a158fa9be1/e626891e636a8bf32dfa1a04d40ea094/AD_4nXeSkeOvOzS1tvancPHndb_IIoA-7_kTmUyMYa2Zc_5Zh24vraCj0NCoW-cMKi7nIFP2386FOVwRlwnYjglPBfJrzPoO5DJEUUlPnZT0n_FEKedcLDZaay7_v4FOBo3SU0x2ht3AOQA5b-B-2zVsPw9aV0Eo.jpeg",
      "alt": "Corrected redirect chain with both url a and url b redirecting to url c"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/a3/1a/a31a922128bdccec761580bceefe54ee/5c1ab97a39c511b10a985f8be015acdd/AD_4nXd4voihJv4ZwZuK0d40yZzBmXm_e0pM0DuvbNeCJ4590rml2zWZgm-at9BovaLIMV7Ink5FREC04z66d8XewX7GNNxFopJGSv4AlWPh3Tw392wGzkLaD8xoHIfdolsWEWWS-SK1qPm4qYLt47DMs59-oEXn.jpeg",
      "alt": "Redirect loop shows url x redirects to url y which redirects to url x"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/b5/1b/b51bae2be89ce3b6800971a22e402bce/d64d6caf577fe20b6509d092596c52c8/AD_4nXfEljp280gbJJJlT3zeHw4qeyPIeFFG2K4FRJ88P2NJdJVtg-X_p80wapW1_o2bLEeMKH6hAM9elg4vsfTSkWqx5aJXqgyp0Ix75LB329v_OTlBVVNJR56a5ThZ5P481dSIEJTuMPSjoyafJiZYz6_8TUvY.jpeg",
      "alt": "Redirect chains and loops in Site Audit"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/84/c1/84c1e60bf742658a959234e99ca3ff7b/fd6f91fdff4eb42e47cebbe6442057cb/AD_4nXdxhzB7zjQYiLrDq_q4R0L05LvzbY2RBmGFZchzuwScRX8467SWNWWx3kZrK4uKCZRvMHRnGlzZGdRswmWRZvtEklMVt6yfRGvzA4JhVqIBNFyyVwoQtV_RHed-jDjOhuBIeDDeMGep2MCK-TydgKHZnYE.jpeg",
      "alt": "List of page urls with redirect link in Site Audit"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/86/c8/86c86c7352248238c7d9da3edb801dc8/4b5d26b9f65235326b130fe3996517f8/AD_4nXcx3ULbGxK1_lbhG2jOYhhxGip2b9KV4n62vYBfIUyNlQrlvPRU_8U8KsI0aFSDyHVwTJodPdalxoaiVJP9W2cZm04Z7YLYPl-ZjPku45iWkJr5yzq-QwCGVW4Vsmx5A6W6t69an2zJ2rkFvhGFB7zJHa2y.jpeg",
      "alt": "Linking to a page with a redirect shows blog post linking internally to an old page which redirects to the new page"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/3b/a7/3ba79846b47590afea6e8f215f62ce4e/04a04cf2e433718f4071597ed3d0cce1/AD_4nXcSE1y3jbixm6Xxu2VIkhQzFAwoZDglbXAtoLKk67Jqr87OavDJ_pRFkt7Z5aZ6d7CTR7Ottbw6FjJ4U-AGs0v8oKsursQnYFE0oJPt4tfkNgCLMIsyTCCONsvyhAgNR5aR_ZvHa2xA8Rurq78QIkmwpkWm.jpeg",
      "alt": "Avoid linking to a page that redirects to another. the blog post links internally to the new page"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/d6/1b/d61baadb13aa0f1b0d8b758c87865234/e7695b9c3b4be12d8471df23219eefed/AD_4nXdWFAW10uA301go_cP6HdoHB4OH_9EoznLsggh5V31Qk_TSEokaAoTmRmXJoqiqzlp9TLvo3QF0rdyZmB_hI8xyv__bnikv9EFZRFB19nPwHDe_BT82HZfceXZG07GEuwNOBAhO0qRnbkp2M1-J-XUemu6U.png",
      "alt": "Site Audit Crawled Pages report"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e0/99/e0991b7baea7449edfbc2ebf394256a6/b857acb7640a41f97ec1fb0d5d92f411/AD_4nXdteKwgrhxzPcZu3vC39ZlGG1UZ5EaZ8gLolQOoPYvkvMrsWUTG1w4cHZvUSNyuVONwmzwvt82syPq6uFbkGfhlJHeI7VGlkCbDbnkh7zPxT8L1mQwhfdMIKGe3Mrz4gtD7GzAsPqsCJ_Ew73YARhSOSjXv.png",
      "alt": "Add your page to Crawled Pages search bar"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/1c/ee/1cee12c5b202316a54869cbdeaf2c9d3/dfcd7ef1b50ca3c002d99691ac4c9947/AD_4nXcw-1Xy5QIjbFUxSeOgAdou2qT85xq0NDguTO43J0dbUEO1oqDqjopVOJcDxZgwTLJ59e8tbX306Jl3KVkTwHEbZl-1L8XZUmT2OQyaDhhG4yLe-sb0N6E_cbBA2IBynFmc9HjFlihh6XpJw3Lcg0HTSqWT.png",
      "alt": "Crawled Pages report for one redirected URL"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/9f/93/9f933f13621193e751010152c6546b92/35a40c565a4dabea75321c0e2bb5cd27/AD_4nXcr2Ye3eYCPRiyVyxVjUNdHvXJ-USQCCdu3bCxfuAriOBO5AulcWafMSxem3vxZSDygtS8fcH8NsaHpTvyw1ER6o0p7Zrt42FyM9qXfcFSkJts7ET5OQbiFZkuJeNQ8q1SP06KZESa2bpG3jqHA.jpeg",
      "alt": "Pages with duplicate content issues"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/a0/2e/a02ebe47f34c04a284898fcea11c182f/e03f8f589356fa2d3006248532c29f5b/AD_4nXcAxz4_uU7HSZGoQF01m04O-MMee5FR0Vz83YeX5e7qhWhv4ST8ntbMvIRbDQszyfHuyHLObolFApfIiNZRbcYUnkJiIuAEqYtwO5VG8bIyudKTB-JE1InfI4NTofsTY6JVkWUCxZf792Dg8eVimMg_h3-y.jpeg",
      "alt": "Page URLs with duplicate content issues in Site Audit"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/aa/2f/aa2ff7b094f9af7ef6fc3822264e04b3/7d0c81e40f285d859a65e5ddcd0bd7bb/AD_4nXdDCjbQLCowpXSRUtT7yU3cL0GxWSoJ-_njSwiKSTCRZRLZUq0_ts-v33YM2dDLPgcnE7HomE_sBW9iJk5kbvrCT9VO6P0AVGv5Ecmb_ugn7GLk9oqYoLZBYa2QNnMqjfSmJN7R0wwAyzpGiuaH2NPiDIvf.jpeg",
      "alt": "Examples of pages with duplicate content"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/7f/01/7f01bf5a05fc3fb02699da7f35a91fb2/cfbdfbcc4e04e77c02a5d778e07b7fbd/AD_4nXdxGAmiWe61l28AfdTDgu5fcMiISpXykYm7g4X8hWg7qflY9ck32hBIlXmOBeH4z8Fs8L5bSGs_U1Nvtbxja9nm7-ka5WTjPeu1XxjVTtLrYH41guQkTY3aTJ7ryZnQMl8wUXGjJLh29kpTE3_b-VaL5mne.png",
      "alt": "Broken Pages in Backlink Analytic's indexed pages report"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/50/c0/50c0d1b4d7d7577de20a258c48db10bb/25119a4bb76c657a851ab839ca980f35/AD_4nXfLGX65Ui5c_AaiTRRlvbK9vt3yqI_u5dFKlyvL0PPVKNamJx_F4vNViewFjWKTJvl5UAffW5cw-1azysJUpzgBo6gkkOZri411DBQbDuwvRDTVt5hQPaFM3C9Ch9X0p7eFsLJXbCDWdPFi7CPD_lIzfmHT.png",
      "alt": "redirect errors in broken indexed pages with internal links noted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/semblog-next-static/banners/trial-gift.png",
      "alt": "Trial Semrush banner"
    }
  ],
  "publication_date": null
}