{
  "url": "https://www.semrush.com/blog/responsive-search-ads/",
  "title": "Responsive Search Ads: The Ultimate Guide for Beginners",
  "content": "What Are Responsive Search Ads?\n\nResponsive search ads (RSAs) are a type of advertising format in Google Ads that automatically changes headlines, descriptions, and layout to match the user's context. Google doesn't create the content; it selects the best-performing combinations to match the user's inputs.\n\nFor example, imagine you're a coffee shop owner wanting to advertise your new seasonal blend. With responsive search ads, you can input various headlines like \"Fresh Autumn Blend,\" \"Warm Up with Our Coffee,\" or \"New Seasonal Flavors.\"\n\nSimilarly, you can add multiple descriptions about the coffee’s unique taste, special offers, or your shop's cozy atmosphere. \n\nGoogle Ads then experiments with these headline and description combinations, showing your potential customers the most relevant messages based on their search queries.\n\nHow Do Responsive Search Ads Work?\n\nResponsive search ads use Google's AI to automatically select and combine the headlines and descriptions you provide, creating highly relevant ads for each user's search query.\n\nGoogle's AI technology examines each search query’s context and uses real-time signals to determine which combination of headlines and descriptions would be most effective. The goal is to deliver the right ad to the right person at the right time.\n\nHow does Google Ads generate responsive search ads?\n\nAccording to Google’s Responsive Search Ads guide:\n\nGoogle's system begins by understanding each search query and keywords\nThe system assembles various combinations from your pool of headlines and descriptions, focusing on relevance and expected performance for each query\nThe system then eliminates duplicate or redundant combinations and scores the remaining ones to determine their effectiveness\nThe best-scoring combinations are sent to the auction, where they compete for ad space based on their quality and relevance\n\nTypically, Google Ads selects a minimum of three headlines and two descriptions to appear in various combinations and orders. Part of your ad text may appear in bold if it closely matches a user’s search query based on relevance.\n\nFor responsive search ads, Google Ads fine-tunes its understanding over time, testing the most promising ad combinations and learning which are most effective for different queries.\n\nFurther reading: Paid Advertising 101: A Beginner’s Guide\n\nWhy Use Responsive Search Ads?\n\nGoogle responsive search ads give you the flexibility to reach a wider audience with messages that resonate. They adapt to users’ search intent, device types, and preferences.\n\nSome people confuse responsive and dynamic search ads, but they are distinctly different. \n\nWhile responsive search ads rely on multiple headlines and descriptions provided by advertisers, dynamic search ads automatically generate ad content based on your website content. \n\nHere’s an example: \n\nDynamic search ads use your website content to target your ads to searches. For this type of ad campaign, Google's algorithm generates a headline and chooses a landing page from your website that aligns with the searcher's intent.\n\nHere’s a table comparison of dynamic search ads versus responsive search ads.\n\nFeature\n\n\t\n\nResponsive Search Ads\n\n\t\n\nDynamic Search Ads\n\n\n\n\nAd content\n\n\t\n\nYou provide multiple headlines and descriptions\n\n\t\n\nAutomatically generated from your website content\n\n\n\n\nControl\n\n\t\n\nHigh control over ad text\n\n\t\n\nLess control, as content is auto-generated\n\n\n\n\nTargeting\n\n\t\n\nBased on provided headlines/descriptions and keyword targeting\n\n\t\n\nBased on website content and user search queries\n\n\n\n\nFlexibility\n\n\t\n\nAdapt to different queries with varied combinations\n\n\t\n\nAutomatically align with relevant website content\n\n\n\n\nSuitability\n\n\t\n\nIdeal for testing different messages and optimizing\n\n\t\n\nBest for extensive websites with a range of products/services\n\nWhat are responsive search ads good for?\n\nUse them to:\n\nCreate ads that adapt to various device screen sizes, giving you enough space to communicate your message\nOffer multiple headline and description options to ensure Google Ads displays the ideal combinations to your audience\nAdjust your headlines and descriptions based on your customers’ locations\nProvide numerous ad headline and description options to compete in more auctions and align with more search queries\n\nSearch trends constantly evolve, making it challenging to predict exactly how people will look for your product or service. Responsive search ads address this challenge by continuously learning which combinations work best for different queries.\n\nPro tip\n\nAnalyze your competitors’ ad strategies to identify their strengths and weaknesses to improve your campaign’s results with the Advertising Research tool. \n\nWhat Are the Character Counts for Responsive Search Ads?\n\nGoogle responsive search ads consist of several components, each with its character limit, playing a unique role in your ad’s effectiveness:\n\nHeadline length: Up to 30 characters. The headline is your ad’s main attention-grabber, briefly summarizing your offer or message.\nDisplay URL: Taken from your ad’s final URL. The webpage address shown in the ad gives users an idea of where they'll land after clicking.\nDisplay URL path fields: Up to two fields, each 15 characters long (optional). These fields provide additional context about the landing page, like \"/Sale\" or \"/NewProducts.\"\nDescription length: Up to 90 characters. Descriptions offer more details about your product or service, elaborating on what was introduced in the headline.\nTotal maximum length: 300 characters across all components. This total ensures your message is concise enough for readers to understand it quickly yet informative enough to be compelling.\n\nThe character limits in responsive search ads are designed to encourage you to create ads that are straightforward and to the point. \n\nWhile it might seem challenging to convey your message within these limits, it's an exercise in clarity and focus. Choose words that resonate with your audience and clearly articulate the value of your offerings.\n\nFor example, a headline for a cake business could be “Elegant Cakes for Special Occasions.”\n\nThe target customers are looking for high-quality, special occasion cakes. The headline \"Elegant Cakes for Special Occasions\" shows a sense of sophistication and exclusivity. \n\n\"Elegant\" hints at high quality, while \"Special Occasions\" suggests these cakes are perfect for important events, offering a personal touch and relevance for celebrations.\n\nYou can apply ad extensions to responsive search ads.\n\nExtensions expand your ad’s presence on the search engine results page (SERP), allowing you to include additional information like contact details, extra links, or product highlights.\n\nHow Many Headlines and Descriptions Do Responsive Search Ads Show?\n\nGoogle Ads’ responsive search ads can show a maximum of three headlines and two descriptions.\n\nYour responsive search ad might show fewer components on smaller screens like mobile devices or in SERPs packed with information. Regardless of the device or SERP density, your ad will display at least two headlines and one description.\n\nFor example, imagine you're promoting an online baking class. Your responsive search ad might typically show headlines like \"Master Baking at Home,\" \"Easy Online Baking Classes,\" and \"Sign Up & Start Today,\" with descriptions that detail the course features and special offers.\n\nHowever, the ad might display only the first two headlines and one description on a mobile search due to space constraints.\n\nHow to Create Responsive Search Ads in Google Ads\n\nHere's a step-by-step guide to get you started:\n\nFrom your Google Ads account, click the “Campaigns” icon on the left sidebar that looks like a megaphone. Then, navigate to “Ads” under the “Campaigns” drop-down menu.\n\nClick on the “+” sign at the top left of the “Ads” table to create your responsive search ad.\n\nSelect “+ Responsive search ad” from the drop-down menu.\n\nSelect the campaign and ad group where you want this ad to run.\n\nEnter your final URL and display path.\n\nAs mentioned, your final URL is the web address users land on after clicking your ad. It should be the specific page on your website that best matches your ad content and the user's search intent. For example, if your ad is about a specific service, the final URL should lead directly to that service's page.\n\nYour display path is part of your ad's URL that shows users where they'll land when they click on the ad. It gives the user an expectation of what they will find, such as dog care appointments. \n\nFor example, if your final URL is “https://yourdomain.com/services/dog-care” your display path could be something like “yourdomain.com/dog-care/appointments.”\n\nThen, proceed to enter your headlines and descriptions.\n\nYou can enter three to 15 headlines and two to four descriptions.\n\nYou can also add site links (additional links in your ad that direct people to specific webpages) and ad assets (like your business phone number) to improve your ad’s performance.\n\nClick the blue “Save ad” button at the end to save your new responsive search ad.\n\nYou’ll see ad previews on the right of the page while specifying your settings. The preview is a rough representation and may not show all possible combinations of your ad. Google might shorten some elements depending on the ad format.\n\nBased on the previews, here is a responsive search ad example:\n\nHow many responsive search ads does Google Ads permit?\n\nGoogle Ads permits up to three responsive search ads per ad group. This limit allows Google's machine learning algorithms to test different ad combinations within each ad group, ensuring optimal performance and efficient learning.\n\nPro tip\n\nGet an in-depth view of your competitors' ad strategies, including how much they’re spending and how many impressions their ads get, with AdClarity, an advertising intelligence tool. \n\nHow Do Google’s Responsive Search Ads Perform?\n\nGoogle highlights that many businesses have boosted their clicks and conversions with responsive search ads. \n\nNotable results include:\n\n61% more conversions\n96% increase in click-through rates (CTRs) \n5% higher CTRs than expanded text ads\n\nResponsive search ad performance can vary based on how well you optimize your ads and your specific industry and target audience. With the right tips and practices, you can use responsive ads to get more clicks, better conversion rates, and cost-effective results.\n\n10 Responsive Search Ad Tips and Best Practices\n\nReady to create your first responsive search ad? First, check out some responsive search ad best practices.\n\n1. Provide Multiple Relevant Headlines and Descriptions\n\nThe more options you give Google Ads to work with for your responsive search ads, the better. Providing a diverse range of headlines and descriptions allows the system to test and discover your target audience's most effective ad combinations.\n\nYou have up to 15 headlines and four descriptions. Use all of them if you can but aim to have at least eight to 10 and three descriptions.\n\nEach headline and description is a chance to closely match your ad with potential customers' varied search queries. This relevance is crucial to enhancing your ad's performance. Google's system uses these multiple assets to create ads that are not just numerous but also finely tuned to user searches.\n\nAlso, write your headlines so they make sense regardless of the order in which they appear. Google will mix and match the headlines you provide in different combinations and orders. Each headline should be coherent and effective on its own because it could appear in any position within the ad.\n\nHowever, write your first three headlines as if they’ll appear together in your ad because Google Ads often displays these together.\n\nPro tip\n\nHaving trouble coming up with headlines for your responsive ads? Use our free title generator for inspiration. \n\n2. Highlight Something Different in Each Headline and Description\n\nProviding a variety of headlines and descriptions increases the chance of matching with different search queries. \n\nIt also helps the ads highlight multiple aspects (like features, benefits, and promotions) of your product or service.\n\nHere are some tips for crafting diverse headlines for responsive search ads:\n\nEach headline should highlight a different benefit or feature of your offering. Consider what sets your product or service apart and how it solves specific customer problems.\nExperiment with different versions of a similar message. For example, if you have a headline about a discount offer, create another one that frames it in terms of savings or exclusive access.\nCover various aspects of your business, such as product quality, customer service, or ease of use. This ensures that you connect with different customer priorities.\nVary your calls to action (CTAs) across headlines. While one might encourage immediate purchase (\"Buy Now\"), another could focus on learning more (\"Discover Our Range\").\nInclude headlines that directly mention discounts or special offers, emphasizing the value and savings you provide\nTo stand out, highlight a unique feature competitors don’t offer\n\nVary headline and description lengths to make your ads more adaptable and appealing in diverse search contexts.\n\nHere’s a responsive search ads example:\n\nA short headline could be \"Summer Sale,\" while a longer version might be \"Save Big on Summer Discounts!\" \n\nA brief description can be a quick call to action, like \"Shop Now,\" and a longer one could provide more context, such as \"Discover our exclusive range of summer wear with up to 50% off this season.\"\n\nPro tip\n\nUse Semrush’s Keyword Magic Tool to find relevant keywords for your responsive search ads’ headlines and descriptions.\n\n3. Don’t Include Keywords in All Headlines\n\nKeywords are vital in responsive search ads, but not every headline needs to be keyword-focused. The primary goal is to connect with your audience via benefits, features, or CTAs.\n\nOverloading your headlines with keywords can make your ad copy feel mechanical and less user-friendly.\n\nInstead, focus on creating a balance between keyword usage and customer-centric messaging.\n\nHere are some tips:\n\nCommunicate the value: For instance, a headline like “Save Time with Fast Delivery” focuses on a critical benefit rather than just a keyword\nHighlight a feature: A headline like “Waterproof Up to 50 Meters” for a watch tells a compelling story without relying on search terms\nEncourage action with clear directives: “Shop for Exclusive Discounts” is an example where the CTA is the focus, guiding users on what to do next\nWrite headlines that speak directly to the user’s needs or concerns: “Get Your Personalized Diet Plan Today” appeals to users seeking customized solutions without overemphasizing keywords\n4. Use Top-Performing Static Ads to Come up with RSA Assets\n\nYour best static ads can provide valuable insights about what resonates with your audience. Use this data in your responsive search ads.\n\nHere’s how you can use successful static ads for your RSA strategy:\n\nExamine past static ads to identify which ones performed the best. Look for high click-through rates, conversions, or other key performance indicators relevant to your goals.\nIdentify what made these ads successful. It could be compelling calls to action, effective headlines, or engaging descriptions.\nFrom these top ads, extract the core messages, phrases, or value propositions you believe contributed to their success\nUse these elements to create headlines and descriptions in your RSAs. This might involve rephrasing for variety while keeping the core message intact.\nFor each successful element, create variants to increase the number of your RSA assets. This could include using synonyms, altering the sentence structure, or changing the focus slightly while maintaining the underlying message.\nAfter incorporating these elements into your RSAs, monitor their performance. Use the insights gained from their performance to refine and optimize further.\n\nThe same approach can also help you change expanded text ads to responsive search ads. Google disabled advertisers from creating or editing expanded text ads, but you can also leverage your successful expanded text ads to create new responsive ads. \n\nApply these RSA recommendations to improve your Google Ads campaigns' performance and efficiency. Check out the video below to see how.\n\n5. Pin Headlines and Descriptions to Specific Positions\n\nPin certain information (like disclaimers or unique selling propositions) that you want Google Ads to display consistently.\n\nPinning specific headlines and descriptions in your responsive search ads ensures they consistently appear in your ads, which is crucial for meeting specific messaging or compliance needs.\n\nFor example, you might want to pin your ad if it needs a disclaimer or a specific feature highlighted in every impression. Pin your disclaimer text to a specific headline position to ensure it always appears in your ad.\n\nLet’s say you're advertising a vegan restaurant that wants to emphasize that they exclusively serve vegan food, with no meat or animal products used. \n\nYou could create a headline in your RSA like \"Purely Plant: 100% Vegan Menu\" and pin it as the first headline. By pinning it, you ensure this headline always appears in every ad impression, regardless of how Google's algorithm rotates other headlines and descriptions.\n\nHere’s how to pin your headline and description in responsive search ads:\n\nWhile creating your ad, click the pin icon next to your headline or description.\n\nChoose the position where you want to pin that specific headline or description.\n\nFor the headline:\n\nFor the description:\n\nSave your changes when you’re done.\n\nConsider these points while pinning your headline and descriptions:\n\n“Showing this headline in any unpinned position” will ensure that the message always shows, but it may appear in headline position 1, 2, or 3\nHeadlines 3 and Description 2 won’t always show, so pinned messages in those positions won’t always be part of the responsive search ad. So, pin headlines to positions like Headline position 1 or 2, and descriptions to Description 1 to ensure visibility.\nTry pinning two or three headlines or descriptions to each position. This increases the number of possible combinations to avoid losing performance and provides more flexibility to determine which headlines or descriptions perform better.\nAltering or removing pinned headlines and descriptions can change your ad's appearance and potentially affect its performance.\n6. Pin Sparingly\n\nPinning headlines or descriptions in your responsive search ads restricts Google's AI's ability to experiment with different combinations. This limitation can affect the optimization process, potentially leading to decreased ad performance.\n\nUse these guidelines on how often to pin your headlines and descriptions:\n\nReserve pinning for critical elements like disclaimers, unique selling propositions, or offers that must be consistently visible in your ads. For example, if a headline contains a limited-time offer or an important product feature that sets you apart from competitors, pin it.\nUse the Ad strength indicator that helps you evaluate the impact of pinned elements. If you notice a decrease in ad strength or performance metrics, it might be a sign you’re overusing pinning.\nExperiment with different combinations of pinned and unpinned content, then adjust based on the performance data. For instance, if you're not achieving the desired click-through rate or conversion rate, you might be overusing pinning and limiting the ad's ability to dynamically match various user queries.\n7. Use the Combinations Report\n\nThe combinations report shows how different ad combinations resonate with your audience.\n\nAnalyzing the most common asset combinations helps you understand which headlines and descriptions work best together.\n\nWhile this report shows which combinations get more impressions, don’t rely on pinning headlines or descriptions based on this data alone. Responsive search ads work when they can adapt to real-time signals like search queries and user preferences.\n\nFrom your “Ads” table, find the specific responsive search ad you want to analyze. Then, click on “View assets details” under your chosen RSA's name.\n\nClick the “Combinations” tab to see the report in the asset details.\n\nTo improve your ads, change or adjust headlines or descriptions that aren’t working.\n\n8. Assess Responsive Search Ads with Ad Strength\n\nAd strength provides feedback on your responsive search ads’ effectiveness. It helps you optimize your ads for better performance.\n\nAd strength offers forward-looking insights, showing how well your ad aligns with attributes correlated with increased performance. Ad strength can range from “Poor” to “Excellent,\" a gauge of your ad's effectiveness based on various factors.\n\nThere are three components of Ad strength:\n\nRating: Indicates the quality of your RSA, categorized as “Poor,” “Average,” “Good,” or “Excellent”\nCategories: Includes factors Google uses to measure Ad strength, such as the number of headlines, the uniqueness of headlines, the relevance of keywords in headlines and descriptions, and the uniqueness of the descriptions\nAction Item Ticker: Provides specific suggestions for improving your RSA, helping you prioritize changes that could significantly impact your Ad strength\n\nUse Ad strength as a guide to make informed adjustments to your responsive search ads. Use this data to make your ads well-positioned to capture your audience’s attention and drive performance.\n\nWe recommend aiming for “Good” or “Excellent.” You can follow the prompts to improve your Ad strength like this:\n\nClick “View Ideas” next to a factor on Ad strength to see recommendations.\n\nChoose from any of the recommendations to improve your Ad strength.\n\n9. Combine Smart Bidding and Broad Match with RSAs\n\nCombining responsive search ads with Smart Bidding and broad match in Google Ads means using automation and broad targeting to improve your search campaign’s performance.\n\nSmart Bidding is a subset of automated bid strategies that use machine learning to optimize for conversions or conversion value in each auction. It considers a wide range of signals, such as device, location, time of day, language, and operating system to determine the optimal bid.\nBroad match is the default match type that allows your ad to show on searches that include misspellings, synonyms, related searches, and other relevant variations. It’s the widest net you can cast using keywords.\n\nThis combination helps you because:\n\nRSAs can appear for many relevant searches with broad matches, increasing your ad's reach. Smart Bidding ensures your ads are competitive in auctions that are most likely to result in conversions.\nSmart Bidding optimizes your bids automatically for each auction, adapting to real-time data. This aligns with RSAs’ adaptive nature, which adjusts headlines and descriptions based on searchers’ queries.\nThis approach saves time and resources. Instead of manually adjusting bids and keywords, Smart Bidding and broad match together allow you to focus on other aspects of your campaign strategy.\n\nUsing Google’s AI and machine learning capabilities through Smart Bidding and the flexibility of broad match provides a more dynamic and responsive advertising approach. This approach is more likely to lead to better performance and return on investment (ROI).\n\n10. Track Crucial Metrics to Judge Responsive Search Ads’ Success\n\nDifferent campaigns may have varying objectives, such as brand awareness, lead generation, or direct sales. Choose the metrics that directly reflect these objectives.\n\nHere are some metrics to evaluate your responsive search ads’ performance:\n\nCTR: Measures the effectiveness of your ad to attract clicks. A higher CTR indicates your ad is relevant and engaging to your audience.\nConversion rate: Tracks the percentage of clicks that result in a desired action, like a sale or signup. This metric is typically the most important as it helps you understand your ad's ability to drive intended results.\nCost per conversion (CPC): Helps you evaluate your RSA's cost-effectiveness. CPC is especially important when your campaign goal is conversions.\nReturn on ad spend (ROAS): Measures the financial return on your ad spend\nEngagement metrics: Includes metrics like average session duration and pages per session on your website, which can be particularly insightful for brand awareness and engagement-focused campaigns.\n\nFurther reading: 8 Google Ads Best Practices to Maximize Return on Ad Spend\n\nGet Started with Responsive Search Ads\n\nResponsive search ads offer a practical approach to Google Ads, adapting to user searches for better engagement.\n\nThese ads are just the starting point. You can use Semrush’s suite of tools to boost your paid advertising strategies to outperform competitors and drive better ROI.\n\nUse the Advertising Research tool to identify and evaluate your competitors' strategies, including their targeted keywords and ad copies. \n\nUnderstanding these insights helps you refine your RSA strategies to stay ahead of the competition.\n\nThe PPC Keyword Tool helps you plan and optimize your Google Ads campaigns more effectively. Use this tool to organize campaigns and set up negative keywords, refining your RSA targeting for better results.\n\nAds History provides insights into competitors' ad strategies for specific keywords, including their historical ad copy. Use this information to fine-tune your RSAs, making them more competitive and relevant.\n\nSign up for a free Semrush trial today to access the tools you need for enhanced ad performance, deeper insights, and a competitive edge.\n\nElevate Your Responsive Ad Strategy\n\nwith a Semrush Subscription\n\nStart Free Trial →",
  "headers": {
    "h1": "Responsive Search Ads: The Ultimate Guide for Beginners",
    "h2": [
      "What Are Responsive Search Ads?",
      "How Do Responsive Search Ads Work?",
      "Why Use Responsive Search Ads?",
      "What Are the Character Counts for Responsive Search Ads?",
      "How Many Headlines and Descriptions Do Responsive Search Ads Show?",
      "How to Create Responsive Search Ads in Google Ads",
      "How Do Google’s Responsive Search Ads Perform?",
      "10 Responsive Search Ad Tips and Best Practices",
      "Get Started with Responsive Search Ads"
    ]
  },
  "images": [
    {
      "src": "https://static.semrush.com/blog/uploads/media/39/56/395617d4ee0de1194f0f03b15eb62008/35824d79c524671fa83c15981663c7c0/responsive-search-ads.svg",
      "alt": "Responsive Search Ads"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/44/d6/44d6165afba524eacaaa342a785d40d7/888f294703bd1a0ecdc9952bbfced7ae/VGFaqAdaWJeXITE96ZELoWobyWufwTRz017Xpx146RnqVDvIVqnhris1ZQGN_LMDp4VgsSVeAdMy9qL_IIbgaIXTiFWfhCi9RAE_zZz8wquW1kpUQxWsKyM6zSd22q1BNBCtp0nGYuqUqBiMO8FAc6M.png",
      "alt": "How responsive search ads work"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e4/0a/e40a43128e8ed2534e58c3d23a3a3710/afb4e6e6b59da9f237bb79d7627fab5b/EuX3q1NV3nrwgy4KWwQv4xbOmC6YRfF46w_gcDU3kKBubx7bmaBauC9qJfbT2ivYF48YymcfqKDrtvmXEM8S5YSiLyMukWUzgk7Ryiw7y42G17EyxSkyDajomIuoG4XGOKGCuYSooo5ClyEum71uPuk.jpeg",
      "alt": "Navigating to \"Campaigns\" > \"Ads\" in Google Ads account"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/70/a1/70a1e642200b0eae375d46e88cc46f6a/1c415bc84531cb4ffb3401f42f674290/Qujhe5gxEN-6mId8pRAMqigIUw4oyNXMOiespfo47irv07VtGol3SPI1FAGJRyS1aX-SSzQN8XIC0B-Qrns43mAcF3qE3hiW1WDi0c0G7dymjd_H8b0-RbogchkIFo31uHmniKMeDToZoOb0zeyMAVI.jpeg",
      "alt": "Press \"+\" at the top of the \"Ads\" table in Google Ads account"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/d0/7b/d07b67845a0a86d388723589f7f07c8d/473e62087e8d0fd35f00035c093bbfe6/qt3rjk6b86Yyfm-KwLDG3DG9oY1WmygSmmIodIMin_ZPUST1b5LHBliiofJYGigxwhOe_Qo6FZgjo3Onx8gQVY4yUVtdm5P7v2Hmifu7UnGGZEu9lZ18eYeOrZ23owiWddqTogCxYAgstQA3KuDkcs8.jpeg",
      "alt": "“+ Responsive search ad” selected from the drop-down menu"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/d3/a0/d3a038efb54eb2bd4e05da02b518bfe1/1e702613c40359120cb25622b484f6bc/x268vpBuXRR3lYAHiDP5HAT52t5lhWPu7qnMbeB1BS0TBc1TZ77TZPcgrE_8eUHlhT-fQDOpzdgOcPMPpyK3F86VdkZWek9Zm9aQ9ynXe_kmvXfQf3NA5pXxJ5QNvAVFDomiYk-rq9AJohOezPJ_D9s.jpeg",
      "alt": "\"Select an ad group\" window in Google Ads"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/99/28/99284355781d752074ec0a4cbed01c10/0b1473f76deb4e2416e350a23213cf86/zZ746p7MwHeD-SjNfNxVNiaUOWw5fSfTQJ_ipjYR4GyCU86JlMBgmCNS4mE-gz8ZleSRyEWOr32Xuapof0G4NTiovH2XBwpQXyqm1xLDkyU2Xo4_knEJbaE7R32B6xfE2N-2_cKAIz0t_8sb0UxbLqw.jpeg",
      "alt": "Adding the final URL and display path to Google Ads"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/fa/ef/faefd87c5f5b04c03a86cf3be19d44d0/18955e6dfb2c343bb72cc3d1ee394276/PiuRRyUj6ziqrDKiNw54jHNC0yD6cbGU1LpJH5NUm5Tz99nTFRzClSMT3IECj8Rx7iZUmAUnJ_VXwKygGu-sFOtD-74LuWsE-R5_NNytwJ_ET-PmqEUYCtGD1hDW2D3SwKBZXtyim-twIzfTebR51-8.jpeg",
      "alt": "Enter ads' headlines and descriptions"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/bb/6a/bb6a152c316d53a0da1eec4646cdb144/e6655fb8d543d0e9e41955786e21479b/MssfZbXABcYWs4eCBwDSq-YazUKt_gYzswqOx53RdNiEBhVYUGTpiISgYZWCcoOP-d4FL_Wm-wTh436l67xcKqOhqA6uuq7_sNoXCKjINjblKqR9fwBWPacRXn4YZrNUZ1cS6lXzaipJ1FHLDCQKAsU.jpeg",
      "alt": "“Save ad” button at the bottom of the form"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/64/b6/64b604989a3ed598f15476243b2ea96e/7019029fbb87152d26f289c9a6605725/bv-FaN3-IxuPXuFB5xJZM5YQ2llMK0A4y0Utdsm_O6DqM8IoH-ruTulyoylyuBVX2AUDyWJT3tMTxZ4sNi5Vf5Atj9B6RyMPOTTtNhCbzWYZlMwyFfHV9hR-Bu1JHKrDr7Mled9G1jA1GrlP7acVK3E.jpeg",
      "alt": "A responsive search ad example"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/09/fb/09fbc71a396a5be5fc5a429c8f30ce53/fc3289b4608c23e394f71cdb343f7d20/p7VXY-MRnucKI7GGQsYfWm7RSsbxiu6BSSDOAh7U9IdiOrjzXuQUANQyRJTAXTxABk3UhA_0rrgz3EAXJqO7C88WMZ6aAAjZIk1sJBNP9Nyued9IovG0ABWaNROtf1780MaR1TV77Lt02SS4omtO7mg.png",
      "alt": "Keyword-focused headline vs non-keyword-focused headline"
    },
    {
      "src": "https://i.ytimg.com/vi/lt9PsxI17VU/hq720.jpg",
      "alt": "Youtube video thumbnail"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/f9/c3/f9c31c8d1b41a35762dc273660133015/781ce6a0568887dfe81e5bdb30ffe1a7/H7Pu-PigI6SG6P6S_X-X09DfgzBxWm0IIx4StrwKMHQcJ7fFYJ-z9NkW2hmt5BOqFrCCVq7_NghPe0gg5cAfV6Ee8fqjO6_RFlXPcfzoBfKn_0ZIxOCAzObiHBcMVlU1S7JhiM85xFiri_-7xyqewJc.jpeg",
      "alt": "A pin icon highlighted next to headline in Google Ads form"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/dc/db/dcdb4d5908331ea2f896e046024b7a84/937daced948403a8beacbd2fa9300f5b/cOTMO0ujQHqaHkawV8IfDdoyUGGFZrXT_nl1xnrHmA8QCg5KPPQRUfj7w2Ee-uymbAKBa5ItZF9eX6FX03qlNbYmOvlzmU8aOBzGrPDMLI_oUxv1w6XMoOx1s9fv10PfrhDiljYHqcOtr0mD8XiCQnA.jpeg",
      "alt": "Choose the position under the \"Pin this headline\" window"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/c6/83/c683e944453081d64fb320d09626325d/412e0c1b6d261de42242b50316d416e4/SHAyUh56Mx2Ml3ZK9a7Vflcn9vZL3jL0IxRoveu6pfG9StTvU8mDesN6YCxRPWNS2E6EPlRzVhSnNzNyCTQshwyCP-k5Wi9Ata2cnrxEtdQPDa6XGZ7wuhU1Q7GZkioOKqP_qsD5vtohDQ47-9ajMtU.jpeg",
      "alt": "Choose the position under the \"Pin this description\" window"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/59/32/5932d2d4db71aea28f72ac5132d9955d/0cf36c497b9597057468220923704e18/fGB8VR04yUt0fAgFy6xfpaTtKe7ttAUjRdhB8ojY2DM44NNyRsBO3CkR55CwnWGK6ztLVubr7eKA-0iA6fv8oGI0Vw6_1A25gXIBBmFo3H_lSk28wWBG95i1W_v7q2v6fuSWMhjjgSl5AS6J8DsZGO0.jpeg",
      "alt": "“View assets details” link highlighted under the \"Ads\" table"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/af/02/af0228a867377b6429cde4b31b33787c/0f9731a5b875d3fac3466441c68a5281/VctrmpEp0aTmm4I9P62RGFWGEr044HgeZC5VPGj-pl_DGGr0wD7mvQN7EtW791itIf8e8aKAGP0k9YTxBoT--4PoWQ3tCwus10uU_HP_0V7UXP46YqkQ4H-wiCGAzgm8HnWmZidVDhqnJjwXlJHcjzo.jpeg",
      "alt": "“Combinations” tab under responsive search ad"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/d3/38/d338e8a11882ca00ec3a07eb0076ed4d/b769ffcb51f3abd6dd5142a23a518252/wd1aZF7Ojy_wx_t24DNdu2MOgy3RRaNCFYez3f1XWLlTiuad7qfRC3VnyZFiDwetwwHV3SlRjtXYl8XfgdgVH6kWwkIiKUo8fG1Hs194e6ehiNS3whbrJWnO7l5yf4KjJ4lY62Dh7bogMELIA7CeVPg.jpeg",
      "alt": "Ad strength feedback for a responsive search ad"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/21/fd/21fd1ba2e831290021089ff3232e801b/f7d3761212660a290f2bd8897dd135a0/hfL05BsW2MoaDkCLQlnN39bHgKd5E5EhP9Jh-UUCFOVyS1yZOG37e2Ic0RAqzvmThdCDMcp8KV8O-5YXQoQwoQCEFVmv1SsZMTRvi2yZJkLOJbkOmZ1LHKCo9KAm3kgSm6kydMlZj7wdsQYm0r11kiE.jpeg",
      "alt": "\"View ideas\" links highlighted under the \"Ad strength\" section"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/8e/0e/8e0eae1fb799a0bd2c21c1ebf70308dc/f001558b5c13d3299eb7129dbc1a201a/tQ7ZCDX3akTromom-Pq4XLobHOc5Q5YGC78L4O_XBufLJw8YvTuTrvO2YtJ5ke1iJxjKl4iK3Uf4GFb2EPjMesWEJeM9ZKFI7judWPUp08IaMc5Ctvr0xg23pQmH04RFlTa8n-JoTEJOrgTIPHcbmI8.jpeg",
      "alt": "Ad strength dashboard"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/1e/a5/1ea54de971a9ca11db758999c83d190c/b197deca42a7b3c20693d34ce6c17807/xdTMV1i2ajPDEHr10Dc-CBO3TD7HyFQkjwikVDPRRBmJGJxS_APDgL1aTZimkjIY1Cg7b3NKCQkq0wixJ5dtov7ktxuGWpkg93ZobuGnMVNs24T8r1R5npGmL4yR3rafzbd9yZXWRUSVFyu23R-a3IU.jpeg",
      "alt": "Positions dashboard in Advertising Research tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/9d/36/9d36b45cf55d5b6cde4212ce992bca88/1177c6f6d1e734a38f11b47f09349c0c/WWJ6s2YjICyOCwK73bbmWbpdhwfCBAtNKsjzRzAkIZnXulfzZ4fGwhAGJtB_AoEbvo61fTofqPLrHRwAVLpL3518gpGnXNSKrZgbkYSmyPRWG25V65-GPCw-XxTvZON1NbRPDniE-ndeTkbwrtYu0OU.jpeg",
      "alt": "Keywords table overview in PPC Keyword Tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/b7/dc/b7dc0f64fcc649c000f5224c9b6f335b/7770e9e7877db0b860264bb674c25e49/wkBrVxY4m-HmGYvv8eBZbNSqiZhT5bzf7imUEAoW0Uh-d1DlZzVS3sVzZ47iPXYbNFWNc03ZTM6evVLKcczfl71-NtLjEQDbuGpDc4h7CoKVJhcRaPCnbiRyIpbVym6mIN9z60BY5Y72lCSMhKMaB2c.jpeg",
      "alt": "Keyword ads history table for \"dog vet\" in Ads History tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&d=Mon%2C%2021%20Oct%202024%2014%3A16%3A52%20GMT&n=4d&b=Responsive%20Search%20Ads%3A%20The%20Ultimate%20Guide%20for%20Beginners&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fresponsive-search-ads%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&b=Responsive%20Search%20Ads%3A%20The%20Ultimate%20Guide%20for%20Beginners&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fresponsive-search-ads%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://bat.bing.com/action/0?ti=5128787&tm=gtm002&Ver=2&mid=d145258c-f15a-4509-a8b5-e66c1e9d87ed&bo=1&sid=12a523d08fb711ef884ccb1036880927&vid=12a67be08fb711ef9b610bc8a0d2890d&vids=0&msclkid=N&uach=pv%3D10.0.0&pi=0&lg=en-US&sw=1366&sh=768&sc=24&tl=Responsive%20Search%20Ads%3A%20The%20Ultimate%20Guide%20for%20Beginners&p=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fresponsive-search-ads%2F&r=&lt=1682&evt=pageLoad&sv=1&cdb=ARoR&rn=701392",
      "alt": ""
    }
  ],
  "publication_date": null
}