{
  "url": "https://www.semrush.com/blog/social-media-ads/",
  "title": "The Beginner’s Guide to Social Media Advertising in 2024",
  "content": "What Is Social Media Advertising?\n\nSocial media advertising is digital advertising that uses social media channels (including Facebook, Instagram, TikTok, and LinkedIn) to show ads to your target audiences. \n\nAdvertising on social media helps you connect with the audiences you want to reach, whether that’s new customers or existing ones.\n\nSometimes known as paid social, social media advertising works well for any type of business. Because it can help you increase brand awareness, gain new customers, and drive revenue.\n\nPaid Social vs. Organic Social: What’s the Difference? \n\nPaid social is advertising on social media that a business pays for. \n\nThat includes sponsored posts, video ads, and display ads. \n\nHere’s an example of a Facebook ad from Nom Nom: \n\nIn contrast, organic social is the typical, unpaid content a business shares on its social media feeds. \n\nLike text-based posts, videos, images, and memes. \n\nHere’s an example of an organic post on Instagram from furniture company Article:\n\nSource:\nArticle | Instagram\n\nWhen you post organic content on social media, it will likely be seen by: \n\nYour followers\nYour followers’ followers (if they share or like your posts)\nPeople searching for hashtags you’ve used in your posts\n\nBut with so many people and businesses competing for attention on social media, organic content doesn’t reach as many people as it used to. Which makes paid advertising on social media more appealing.\n\nSocial media advertising (just one of a few types of online advertising) allows you to share content with a targeted audience to help drive your specific goals.\n\nLet’s look at a Facebook ad from clothing brand Reigning Champ. \n\nWe know this is an ad because the image says “Sponsored” in the top left corner: \n\n5 Key Benefits of Social Media Advertising\n\nThere are many advantages to running social ads. Here are a few:\n\n1. Targeting Specific Audiences\n\nA target audience is a group of people likely to be interested in your products or services. And who share certain characteristics.\n\nRunning paid ads on social media for a target audience ensures your ads are shown to people you expect to be interested in your posts. \n\nThis helps increase the likelihood that they’ll engage with or take notice of your ad. No more crossing your fingers and hoping your organic post gets seen by the right people.\n\nAnd social media platforms let you target an audience based on specific details.\n\nFor example, on Facebook, you can target an ad based on location, age, gender, demographics, interests, behaviors, and languages. \n\nThis detailed targeting is useful for every type of business.\n\nLet’s say you have a hardware store and are planning a summer ad campaign. \n\nYou’re running a discount on several grills and smokers. And you’d like to promote the sale on social media.\n\nYour target audience might be men from age 35-55 who live in a sunny, suburban area near Phoenix with a modest income. And are interested in cooking, grilling, and smoking. \n\nIn this case, your Facebook audience targeting would look something like this:\n\n2. Measuring Your Results to Gauge Performance\n\nAnalyzing your social advertising efforts helps you understand which ads perform best. So you can focus more of your efforts on repeating this success. \n\nLet’s use the same hardware store example—your goal for the summer grill campaign is to sell 5,000 units. You run an ad campaign on Facebook that helps you sell this volume. \n\nYou know this ad iteration was successful. So, you’ll want to replicate it in the future.\n\nGood news:\n\nMost social media platforms come with built-in analytics to help you find out which ads performed well (and which ones didn’t quite make the grade).\n\nFor example, on Facebook, you can analyze how much engagement your ad received, the amount spent on the ad, and the cost per result.\n\n3. Getting More from Your Organic Social Content\n\nAnalyzing your organic social content makes your social media budget go even further because you already understand the type and format of posts that perform well.\n\nInstead of spending time figuring out which paid ad campaigns drive results and burning through your ad budget, look for winning organic posts. \n\nThen, repurpose them into paid ads. \n\nFor example, let’s say the organic video below from the cycling brand Rapha gets great engagement. And it’s one of their highest-performing posts of the month. \n\nSource:\nRapha | Instagram\n\nWhat’s stopping them from getting further mileage from this post by putting some ad dollars behind it? \n\nYou can find insights on which organic social posts work well for you with the Semrush Social Analytics tool.  Which lets you track your Facebook, Instagram, and LinkedIn channels.\n\nOpen the tool and click “+ Add profile.”\n\nThen, follow the prompts to connect your Facebook channel. Like this:\n\nRepeat that step to connect your remaining social channels.\n\nThen, open the tool to the “Overview” tab. To see a high-level look at metrics across each of your social channels:\n\nTo look at the performance of individual Facebook posts, go to the “Facebook” tab and select “Posts.\n\nHere, you can see which posts had the best engagement.\n\nYou can use this information to help determine which posts you might want to repurpose into ads. \n\nTrack Your Social Profiles\n\nWith Semrush Social\n\nGet Started →\n4. Reaching New Audiences and Markets\n\nAdvertising your products or services on social media can expose your business to new audiences. And helps increase your customer base. \n\nRunning ads on social means you can adjust your targeting to run campaigns for audiences in different age groups or locations you’ve identified as opportunities. \n\nFor example, let’s say you’ve run your summer grill campaign in Phoenix. And achieved good results. \n\nTo reach a promising new audience in Tucson, Arizona, you could adjust your location targeting. And run a similar campaign for that audience. \n\nYour targeting would look like this:\n\n5. Building Long-Term Relationships with Your Current Customers\n\nSocial media advertising can improve brand loyalty with your current customer base.\n\nFor example, you can run ads for new products or services, special promotions, discounts, and popular items that are back in stock. To influence upsells (persuading customers to buy a more expensive product or service), drive repeat purchases, and help grow your revenue faster.\n\nHere’s an ad from PillowtalkDerm enticing customers with the return of a popular mask:\n\n7 Popular Channels for Running Social Media Ads\nFacebook\n\nFacebook ads allow you to set various campaign objectives, including: \n\nIncreasing brand awareness\nSending traffic to your website or landing page\nDriving engagement for your business \nCollecting leads and signups \nPromoting your app\nAcquiring sales and driving revenue\n\nYou can set your ad to appear in various locations across Facebook, including feeds, Stories, Messenger, and Marketplace. \n\nHere’s an example of a Facebook carousel ad by Canadian outdoor company MEC: \n\nInstagram\n\nInstagram is the second most popular social media channel for running ad campaigns. And it allows businesses to set the same ad campaign objectives as Facebook.\n\nA key difference of Instagram is that it favors more immersive, eye-catching ad experiences.\n\nFor example, visually appealing ads like images and Instagram Stories are prominently displayed and easily shared. \n\nHere’s an example of a striking Instagram ad from The London Sock Exchange highlighting its collaboration with the rock band Queen:\n\nTikTok\n\nTikTok can be a significant driver of sales. \n\nIt’s true.\n\nMore than 60% of TikTok users agree the platform has helped them decide what to buy. And 67% agree that TikTok has inspired them to purchase when they weren’t looking to shop.\n\nBusinesses can run ads like video ads, Spark Ads, image ads, Playable Ads, Shopping Ads, and carousel ads. \n\nTypically, TikTok ads are used to sell a product or service, engage in influencer marketing, or generate awareness for a brand. \n\nHere’s an example of an engaging ad from Airbnb. \n\nSource: Airbnb | Tiktok\nTwitter\n\nTwitter lets you display ad campaigns to targeted audiences through various formats, including Promoted Ads, Follower Ads, Dynamic Ads, Twitter Amplify, Twitter Takeover, and Twitter Live.\n\nThe channel allows you to target ads based on demographics, interests, behaviors, keywords, and specific events or conversations. And engage with an audience in real-time. \n\nDepending on your social media goals (growing brand awareness, increasing app installs, etc.), you might want to explore Twitter as an ad channel to connect with a highly active audience. \n\nHere’s an example of a Twitter ad from Expedia:\n\nLinkedIn\n\nRunning LinkedIn ads opens your business to an audience of more than 900 million professionals. This makes it a good platform for running ad campaigns that target knowledge workers, business leaders, industry experts, and companies. \n\nLinkedIn is commonly used by business-to-business (B2B) companies to run LinkedIn ads like sponsored messages and content, dynamic ads, and text ads. \n\nThe platform also allows you to create ad campaigns using specific objectives: awareness, consideration, and conversion. And features solid audience targeting based on demographics, job titles, job functions, company size, industries, and more.\n\nHere’s an example from Mastercard:\n\nSource: Mastercard | LinkedIn\n\nAnd if your business is looking to position itself as a thought leader, you can use LinkedIn ads to create sponsored posts. To build credibility and increase awareness by sharing your organic posts to audiences beyond your followers.\n\nSnapchat\n\nSnapchat offers businesses a wide range of advertising formats, including images, videos, Collection Ads, and Story Ads.\n\nSnapchat ads are designed to capture audience attention and encourage engagement. The channel is well-known for its interactive and immersive ad capabilities, such as augmented reality experiences that appear as you're filming.\n\nUsers frequently engage with friends and family through personal messaging and sharing Snaps. So, businesses can tap into a personal environment by advertising on Snapchat. To build connections with audiences in a way that feels genuine and relatable.\n\nIt’s also good to keep in mind that 90% of Snapchat’s audience of 375 million users is between the ages of 13 and 24.\n\nSo, if you’re looking to create ad campaigns for a younger demographic, Snapchat is a great channel. \n\nPinterest\n\nRunning ads on Pinterest allows you to showcase your products or services through image ads, video ads, carousel ads, collections, and shopping ads.\n\nBecause Pinterest is highly visual, audiences use the platform to generate inspiration for future purchases. \n\nFor example, searching Pinterest for home decor ideas. And then making a purchase decision based on the content they see. \n\nHere’s an example of a few ads on Pinterest:\n\nPinterest provides targeting options based on demographics, interests, keywords, and even specific categories or boards they follow.\n\nHow to Create Effective Social Media Ad Campaigns\n\nGet started with social media advertising by following these key steps:\n\nSet Up Your Budget and Ad Spend\n\nBudgeting your social media advertising efforts helps anticipate costs and expenses. And means you can be more intentional about the scale of your ad campaigns.\n\nLet’s go over budgeting as a whole and how to apply it toward your ad campaigns:\n\nSocial Media Budget\n\nA social media budget is the amount of money allocated to cover all the costs associated with social media marketing activities.\n\nFor example, running ad campaigns, content creation and production, engaging in influencer marketing and partnerships, paying for social media tools, and hiring a team to manage the social content calendar (like the one below).\n\nThe size of your company’s social media budget will depend on factors like overarching business goals, the size of your target audience, which platform(s) you run campaigns on, your social content strategy, your competition, and market dynamics.\n\nWork with your team and all relevant stakeholders to determine your budget and what type of budget it is.\n\nTypically, a social media budget will fall under one of two categories: \n\nFixed\n\nA fixed social media budget refers to a predetermined amount allocated specifically for social media marketing activities. \n\nWith a fixed budget, businesses set a cap on the amount they’re willing to spend on social media initiatives over a specific time period. For example, a month or a quarter. \n\nFlexible\n\nA flexible social media budget allocates funds for social media marketing activities that can be adjusted or reallocated based on evolving business needs, opportunities, and performance. \n\nUnlike a fixed budget, a flexible budget allows for changes in spending levels, providing greater adaptability for social media campaigns.\n\nAd Spend\n\nA portion of your social media budget will go toward ad spend. Which is how much your business spends on ad campaigns for social media.\n\nThe image below shows that most companies reserve 15%-25% of their digital marketing budget for social media:\n\nHow much money you allocate from your social budget to running ads will depend on a few crucial factors.\n\nFor example, how your audience buys and what channels they use, how many people are on your social team, campaign duration, and channel competitiveness. \n\nWe recommend starting with a smaller budget that aligns with your advertising goals and helps you test your campaigns' effectiveness. Then, scale campaigns that meet your goals.\n\nIt doesn’t matter whether you have $100 or $1,000,000 a month to spend on social media ads. It matters that you spend money wisely on campaigns that are most likely to help you meet your goals.\n\nTip\n\nGet a clearer picture of your competitors' ad spend across various social channels with AdClarity – Advertising Intelligence. \n \n\nJust enter your competitors’ domains into the tool and choose your parameters.\n\nThe tool will generate a report. That you can use to review ad spend estimates by social media channel and understand your competitors’ budgeting strategies.  \n \n\nDefine Your Social Ad Goals\n\nTo run effective ads on social media, you need to define what you want to achieve. \n\nAnd remember that every business is different. \n\nFor example, some smaller companies might need to get their business noticed by new customers. So, they might focus their small business social media efforts on building brand awareness. \n\nOthers might set a conversion-based goal to increase revenue. And some might need to drive more traffic to a landing page or website. \n\nSetting social media ad goals can be complex, but using the SMART framework can help:\n\nSpecific: What detailed outcome do you want to achieve? \n\nMeasurable: Can you track and report on specific ad campaign metrics? \n\nAchievable: Is the goal realistically attainable in your specified timeframe? \n\nRelevant: How does this goal support business needs and priorities?\n\nTime-bound: What is the definitive timeline for the campaign?\n\nUnderstand Your Target Audience\n\nTo run effective social ad campaigns, it’s essential to understand your target audience. \n\nHaving insight into who your customers are will help with:\n\nCreating highly targeted ads that resonate with your audience\nManaging your ad budget effectively and optimizing your ad spend (more on that below)\nIncreasing click-through rate (CTR)—the number of clicks your ad receives out of the number of times it was displayed\nLowering your cost per click (CPC)— how much you pay each time a user clicks on your ad\nLowering your cost per acquisition (CPA)—the total amount of money it costs to acquire a customer\nKnowing the best social media platforms to run campaigns on\n\nTo learn more about your audience, tap into resources like customer surveys and your social media performance.\n\nYou can also learn more about your current audience in Google Analytics.\n\nOpen Google Analytics and go to “Reports.”\n\nThen, go to “User,” “User attributes,” and “Overview.\n\nThis will help you gain insight into who’s engaging with your business. And help you construct audience segments to target. \n\nYou can even use our persona tool to compile all the information you’ve gathered into well-defined audience personas.\n\nCreate Eye-Catching and Mobile-Optimized Ads\n\nEngaging social media ads stick in audiences’ minds and help drive results.\n\nAds need to be on brand (colors, voice, tone, etc.), catch your intended audience's attention, convey a message, and encourage clicks on your call to action (CTA)—the action you want them to take. \n\nHere are a few pointers to help. \n\nUse high-resolution images or videos\nWrite persuasive copy that conveys your message succinctly\nDon’t be afraid to experiment with different ideas and formats \nLeverage the power of user-generated content for additional credibility\nInclude a clear CTA\n\nHere’s an example of an ad from Zapier that incorporates a few of these tactics:\n\nAnd remember, Meta says the higher the quality of your ad, the better chance it has of performing well. \n\nYour ads also need to be optimized for mobile.\n\nWhy?\n\nBecause using smartphones for social media continues to rise. By 2027, 5.85 billion people will use social media on a smartphone.\n\nFinally, upload your ads and push them live. Which will be different for every platform.\n\nTip\n\nUse AdCreative.ai to quickly generate display ads that can capture your audience’s attention.\n \n\nThis app leverages AI to help you create conversion-focused, visually appealing ads and copy tailored to your brand.\n \n\nFurther reading: Facebook Ad Design: 6 Best Practices for Driving More Clicks.\n\nMeasure Your Results\n\nUnderstanding how your ads performed is crucial for evaluating whether to put more or less ad spend into your social media marketing. \n\nIf you’re seeing big returns that meet your goals, find out whether you can add more money into the ad budget to continue scaling.\n\nMeasuring performance is pretty simple, too. Because major social media platforms include campaign analytics. \n\nFor example, Facebook has a visual representation of how your ad performed. And lets you dive deep into metrics like clicks, CTR, CPC, and more.\n\nTo access Facebook analytics, open Meta Ads Manager by clicking “Ads Manager” at the top left corner of your business’s page.\n\nNavigate to your Campaigns dashboard by clicking on the campaigns icon on the left side of the screen.\n\nHere, you’ll see all your ad campaigns for all Meta apps, including Facebook. \n\nTo dive deeper into analytics, hover over a campaign and click “View charts.”\n\nHere’s what your performance report will look like:\n\nYou can also customize which metrics are visible by clicking “Customize metrics” in the top right corner of the report.\n\nAnd selecting up to three metrics that align with your campaign goals.\n\nOne of the best forms of measurement is return on advertising spend (ROAS). This metric tells you how much revenue your ads generate for each dollar you spend. \n\nAnalyzing your ROAS will help you assess the effectiveness of your advertising campaigns and allow you to make data-driven decisions to optimize your campaigns for further growth.\n\nHow to Calculate ROAS\n\nROAS is calculated by dividing the revenue generated from the ad campaign by the amount spent. So, ROAS = Revenue / Ad Spend.\n\nFor example, let’s say you spend $10,000 on a social media ad campaign and generate $25,000 in revenue. The ROAS would be 2.5.\n\nThis means for every dollar you spent, you earned $2.50.\n\nTest Your Ads for Performance Optimization\n\nSocial media ads are perfect for testing to find content that truly resonates with your target audiences and helps reach your goals faster. \n\nA/B testing (sometimes called split testing or bucket testing) is used to compare two different versions of an ad that are shown to a split audience. \n\nFor example, ad “A” (the control) is shown to 50% of your target audience. And ad “B” (the variation) is shown to the other 50%. \n\nLike this:\n\nThe goal is to measure which ad version performs better. You can then use this information to replicate the successful ad.\n\nYou can A/B test pretty much any element of an ad you’d like to. For example, copy, color usage, images vs. videos, video thumbnails, ad format, CTAs, and hashtags. \n\nTip\n\nWe recommend focusing on creating engaging ads that perform well before jumping into any testing.\n\nSocial Media Ads: Frequently Asked Questions\nHow Much Does It Cost to Advertise on Social Media? \n\nThe cost of social media advertising varies depending on factors like the platform, your target audiences, ad format, campaign duration, and your competition.\n\nBut it’s good to know that the average CPC for social ads ranges from $0.38 (on Twitter) to $5.26 (on LinkedIn).\n\nYou can also control costs by establishing your budget ahead of time.\n\nIs Social Media Advertising Effective?\n\nSocial media advertising is an effective way to get your products or services seen by target audiences when they’re spending time on their favorite platforms. And helps generate engagement, create conversation, and boost revenue.\n\nWhen Is the Best Time to Advertise on Social Media?\n\nThe best time to post on social media varies depending on your audience, the platform, and your time zone. \n\nBut you can use Social Tracker to learn more about a competitor’s posting cadence and when their audience tends to engage.\n\nTo see this information for your competitors on Facebook, open the tool and click the “Facebook” tab.\n\nNext, click the “Activity” button.\n\nYou’ll see a general overview of their post types and engagement.\n\nScroll down, and you’ll see graphs that show when the competitor publishes posts and when their audience engages with posts.\n\nTrack Your Competitor’s Social Media\n\nWith Semrush Social\n\nGet started →",
  "headers": {
    "h1": "The Beginner’s Guide to Social Media Advertising in 2024",
    "h2": [
      "What Is Social Media Advertising?",
      "5 Key Benefits of Social Media Advertising",
      "7 Popular Channels for Running Social Media Ads",
      "How to Create Effective Social Media Ad Campaigns",
      "Social Media Ads: Frequently Asked Questions"
    ]
  },
  "images": [
    {
      "src": "https://static.semrush.com/blog/uploads/media/3b/1c/3b1c0ca3c9501eb49602f786f2745f32/social-media-ads.svg",
      "alt": "social media ads"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/c2/87/c28771aa3d50cc3df992eac99029038c/bFqe3L-Ya9pJVU-k--l15g8eLWbEL-Ni1g2oF4PXChqD9Jo-l3RgZI5PKUdvlAM0F6XTuSksi_X6jmOXURj0f8rQg0H9oE_Djx6_dL4oEXC124_PMKnusrmZbkVvcqjbWjPn4n8w7WQZzQ4SOZgqXnE.png",
      "alt": "an example of a Facebook ad from Nom Nom"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/b8/0c/b80cf51a4ab8a590f8a7476cec92e1ff/iERxkBMiNVQ2jha09xDOzRnDWBRwU6NJktkRzquinFwlYfh98dNQUBh9ltNUKmkazsjOVO3d0JJkRITbXZzBLkcWCkohPAEpkWsJTjcisY5MMuPCrwYw_St4xU5kZ6Py9NZ5F5X-v4Ukmih9fkxNeKg.jpeg",
      "alt": "an example of an organic Instagram post from Article"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/4b/52/4b52e873340ac85dc35a579cd2f9c96e/Urpb1mGBHvy_7Pc0VKK3fHk5ocZ02Ij0Tq_cuGOfDouQzqeC1pkyGLT272_-q-lNnRxd3fzrDP4-hk-avtA_qqzIujM3_XROoI-t4AIy3uB0DqaZl6dpwezMn5FWO0A5DOKSZvltXxITwxM2nHaK_eY.jpeg",
      "alt": "an example of a Facebook ad from Reigning Champ with \"Sponsored\" mark highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/f9/fe/f9fef2b9ed954b38aab2dc04484026f9/yEo8XNl-26AeJyOv_5KCe3cR5qTxwYGGsUWGqrvI5wDNutaYFv0Z6CzUz3nYgNVhlvMM0nuRmOGLqBTVHdzDrpZVpg-bZ1TgHLVt5mv5eDKwgcJTWTw7rNm7J4gg63SJ-JEgWmueJ1IGUxaVEMo5Q8o.png",
      "alt": "\"Create new audience\" section in Facebook ads"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/b6/eb/b6eb1ae14e2816265eb1fd38010cfc27/48VENJHCVo168gfpmW6rZ3Sjq2anKypTdOQ6h82M_lWZ1Yau2ZAxQ8U6sTRGWh28iYujvTur2PbFM4Mt2E4hpCdeNMBT7CXbcXnt2uyXpq0ku8roVx5k4FBOIZh9xP-rHnk4Xj0txVOzkYuAJuQr_zw.png",
      "alt": "an example of filling-in Facebook ads audience section"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/cc/d4/ccd4d4ed9e19c4eca88a5866d3261e3f/T_FqZOzmN1A1HnFagQNzGeCN4Dm-vVt9wtl7zapoWOvfagMDaVx0rSfJFeg4SqR1StyGYz8oJ1cLudNdW2ZlIHIYiLoDiKINHdkM0mBv6s7-SiDQ_xGyg6qNuBnCZoka9zTqd2LqIxK_dwOZSutyq5k.png",
      "alt": "an example of Facebook ad metrics"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/2d/dd/2ddd4099ddbc2b4c6cd3ffccd0083b14/vpc75b5QNeJ1frsDWapIL117sz8IUea7ipp-_aNOZR35rcQ-wFEdIxiLK57BSlV1mhFP_bL25TbtUKbCx3YuJ22atI0ScRleVXxbpWNlupJC5wkLBG_Wto0H3jLvO5bGsVQMa7i6f8FkW3lfKhOLIeY.png",
      "alt": "an example of an organic Instagram post from cycling brand Rapha with likes and comments section"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/df/63/df6376a144765fc91a44ca0942d7cd9c/reNpcDi3I3-t2X3mM5M3VrqRD0PwChrNun0zCx82t7QmDopmfPLR49aRPmUkk6E0Ovef4gnVw9yjwQQXhEvPVZNLa3HHCH-GqU24IMjm0I1NLk9AeVS-KPYkM7OGr35IZly3rkiFES-vtTzBDZ8TPz8.png",
      "alt": "Social Analytics tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/1b/39/1b39e1c4315290934e5c5e385b9ed64e/jFma0lCxGjPB-hk2yTbKYrZy29lBo49Pgj4nniH0Hr7xpgVtpkn9AQu8GCfHYZfuupkBL7EZkjfDvC__eG47-sDRhXRY4z7-7-kBwAPW-UeaL58m5k57EfSD0fgYsqxim5GRqyDsHIk3J8mxG-y79ro.png",
      "alt": "connect your Facebook channel to Social Analytics tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/6d/8d/6d8d70a477b74bd26b3d73e5319a3259/vJQdfZkhiwg2JhU3-02z0Tt3vz70pwrFtY77PGOF0egiJPnP4XH7RIVckt9TWCUCd9YL_isuBQgc3sI0MeTECq0UQMT9rKd_dpvvHkabhJjHtphwZAU7nTs3L8wLPvFIONE_4g5Zj7K2z8cqECPBe1E.png",
      "alt": "“Overview” tab in Social Analytics tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/88/fa/88fa1a642606825d28f152077cb87890/1t7MdwMNzrcmaDTNgocMByM4g6xjAruoKV6lwr67JACI9ehjhg0hzovxaeLddwCcPptglAQj1xL26QoT5Hl_8jinEbIQIlZTAkIFL14Z4a446w14gAtZUyDQLxVeIXMi3ONMaDmSTX3wm-AFCEZQ5oA.png",
      "alt": "example of audience metrics for Facebook posts including location, sex, age and top activity time"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/23/da/23da5bee0ab5eb756b99f6f6361c5fdf/5kh3d0oIidzMrJx3A8VLQFH5opPMrSMHs47Kc_HqHbzCOwf1tTx3AmkJEm7TsPr3u2H-yN7Wwuy_M63ssIAI5A2opG673UeZE92FHRQma2sUBA5hLsmlU_WO3KN0oSV6YZrtNqHaJos60RTtsxoAnqU.jpeg",
      "alt": "\"Top posts\" section by engagement rate"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/78/25/7825339382b31a016d4aaa2c4c41f91a/5dzbVz0GjSkOunz64cksyUb2m41CYZOv2isQN0FMyZvdXcJuwKp6P8mWR7IvD0o4dOUnpTxeMZmA6QokalvUPYImtFgArkJIjpajo9laiWQvtv64kzKeFMClbzLUDj-Rng_JHV310xleu4PXCVVkcXA.png",
      "alt": "example of setting audience targeting in Tucson, Arizona"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/50/69/50693cd0a38d3b7b31796f64bd7e2107/kOKzLHQvjDEo-NIYKiSujEsndZNBV21kOqtNsMkElV5cXYUUcSSY9oycte4Byj79d-hBns_bmGff6AgfMD7qfyccZS7g0sEmPmXnSFsQPA4lgXypA4pPusvMPnqEgAfhWKslUEtRIg4O6Nti-hhamVo.jpeg",
      "alt": "an example of an ad for a mask from PillowtalkDerm"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/9c/e8/9ce899457d9f4330d7cc3f47ac58094c/4vsXLLakDon2TbaKp0RmoEBK0wkBIJH24_NP9Ev3idKMYn5dyE7oYSQ_URp8i70bVZ9TRvLHTTcFY5njhrl28dyXdJOWs4yKdStYwrpwy1mpm4GOf97yJ1JCluPVjPdncX6dxW_S4P63z9GdKn8kHLQ.png",
      "alt": "an example of a Facebook carousel ad by Canadian outdoor company MEC"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/99/e6/99e6cc852b56c01256e068d54e4d855b/Gl2wihCdWm8vrFjci8fU_3P2qFPlaiw8irHjp0W-MTb1PghTJVPQUTKfNQLj8VzH9DtAeYDuxNaA055Wbq5ok4AOc3bpc7Qcf2Z_rPyMFGnmjK1RtZT9edsRuaUs8wsMlulGIUM3U7_HShXDew0UmNc.jpeg",
      "alt": "an example of Instagram ad from The London Sock Exchange"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/76/04/7604dfc8f85698d579c0f189f563f244/WyWmiNW72k8X7GtCinuhHCmTYR7lSvYumFP4hPcnPPaHmWx2o8K5DB5BrlC5K8ckK3n5Y12D-PBcak2d15uBnHGlVyjiipWOGoRcbW8B1lXoFSkrSkbMm19DlX2MrBb0kF90VT1tA3gQRrkOfUM5cKg.jpeg",
      "alt": "an example of a TikTok ad from Airbnb"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/f5/39/f539d67e05eb1a659d37f9372b6b032f/YcOyHfgAQmvOtd7nmYSt_JXOGEz8Xu1DWBt4cr59EDkQ2T4C59PDelltGC0VrJMIbXJp9bz-YicHXLWekOsfvGG6ct1ap1PLdigcghNg1EIkiIvdtTKQ45HkXl-VmD09uwWtlFL4pDbeOwCgGz-zymo.jpeg",
      "alt": "an example of a Twitter ad from Expedia"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/2c/91/2c9120e9aa651aec589223d13b881cd8/Bh6ToF-oz3CWjqzTEozb2FE9Dw26TCx6Fju8ZliJ-i-LqVKFB5h5kotl-RzIe2xaO59dy-0OAznQnh0_Wh9GhttjffLGvn1J88xDkL1SAVfGDnpVJQ6XCWtcr2b13C5JMdl0dj3dlUfMM9Fvq5-pvCc.png",
      "alt": "an example of a LinkedIn ad from Mastercard"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/39/1a/391af9820a2d41d28535b32c3a36417c/q8tO7TqMMblRqKVPGoj5HB4h2GBrfxlIPe57M1Ta2ugBER-xrrYW4yrop1MFuknvF3Nhjp6DBfIszx6WXpcLqlLgB4D_BmM62A9OinXNvHc-16lPsxXY4jrLAXfoMorlqRLezWlKbr803OZNAbPJDWA.jpeg",
      "alt": "an example of a few Pinterest ads"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/08/84/0884fc45b3ae80f895d16437b26f9806/3i3dmHKLT_XJXfHdpgV_6Ze9Cyt5p1Sw3vmOolkmdJOnwYcGzqcBWlRiyiCQEiB8sscfjqu5ivdzJcogjjrNBMPxMC0uVXTixTblAW03OTya-F1HbH6ZXb3nCJfxJnNjfsrrHh5880LHLRfofmn1ch0.jpeg",
      "alt": "social content calendar template by Semrush"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/8f/80/8f80969f2bb2c08f0e5c54986e7d9cdb/C0PharO4y1SQ0j6p2VU12TIDQeEX0LaCT3J6oak-r-hC5U6D0Tz9ajZK07yuW0mP1Xv7PWkBF27q5V85Uv1kx-tY6XZfhmeUAFKamd01AZa1SCbJIM6lbENRTy-aUjZtvzLJfIOq1vKx0YmGjYLbuaY.png",
      "alt": "an image showing companies’ spend on marketing, digital marketing and social media"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/63/8d/638dbdd9dfccfd656fddc4fa76a18971/cdbb87cde6c68dd025b9bce7249f4a53/AD_4nXdGgBtJAk4G63IiGtUAzud58UXq8oyVPpD_wxx1bX_3u7DXc8SGl51rM6wVgvHlKC4_f2duKS2S2LFjabOlBa3hTuJcGKU_ZADE2Ks277S6-gSYSaVwynK6oyf3em5izhf_rFSsZ85zSVAQOVBTYiej0HYo.png",
      "alt": "AD_4nXdGgBtJAk4G63IiGtUAzud58UXq8oyVPpD_wxx1bX_3u7DXc8SGl51rM6wVgvHlKC4_f2duKS2S2LFjabOlBa3hTuJcGKU_ZADE2Ks277S6-gSYSaVwynK6oyf3em5izhf_rFSsZ85zSVAQOVBTYiej0HYo?key=ypqqqLMklZ-7f7gCJfowHw"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/9a/60/9a60f8a4aa6e35e47d03d9f709242aea/ytDI2J7jme1G818kNOaGC6_pSkVq_d4aKxqCOZeEGczBNhF_dqvKpnpnmltgF1jfiDXI8UaSW8QqrEPIungk7dXvwhD4TqlSlwRLJnfAqR98J76m1vFEA5Kka465UYsUCBXSrosh33FRnVQ4xpuZ2fo.png",
      "alt": "an image explaining SMART Marketing Objectives by Semrush"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/88/f7/88f7c2a1c190a1d11482ffd9e5746f8c/UpB510x-tua4xrkrKql4Mjc0xpJtv4zd96lg6ZK9SIMz6zSqupIZE6Dkc_C5TEemXkPzsakgkuww1-MFay9TBFRDvRZwDxNGJvy291lOaViq2XbtqVZk8C0i6FzQKTigMMfhZ7o0u7Yx-ugHiwYBPno.jpeg",
      "alt": "“Reports” section in Google Analytics"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ce/78/ce783dcff8006ffaeda87876eea014d1/nsvnGzv0Mwqoe0gu_e8KJ_J5Ahbi5n07CynkFhNNnJsC_7GvvrWH7yXjDdcOofQChGnA832XJRKogaA_6NDMBbt9T_a9fG83KriTs8ZmYUJM6bE43_YaSrgjgDycPxj6ID2oIwLzI0_I93qFCimFUj8.png",
      "alt": "“User attributes overview” section in Google Analytics"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/6c/16/6c165f79b059f11a577dbdc036813778/DzQXfvvlzr8uGeYJ4zvsScQaioF3mFiUEsmIdzjKLtXRD-3ULkBiGorrwVYY4aIpdO2x1CuNRocuNQoy0N70An4QLCok1CNwRhUuXfcGVC1SCsrIDFv_JbIE-zWQR0TXT4k_kuQ9LoWHhZ7DHUFmybg.jpeg",
      "alt": "an example of buyer persona built in Semrush Persona tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/b9/e0/b9e025bbe094bcb131e795ce90ced923/p8eIxf2qrJzeq2ppVIdFG6-SUCV3jVAvAjZzFo-jpvmf_aJszPbRA1ZygbFOQuB4-h2CldXo5n4uWZKSOzf9mUmyhxCTMSrpJZpKLw7fucJzQ7SNsHhtu4wu9K0oo7po2JTIROp5JtgYe2wYfbRJpeU.jpeg",
      "alt": "an example of an ad from Zapier on unlocking the full potential of AI"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/70/64/70644ebaf01b5da23324d50122df64ee/5dfd76b83671fd670b568ed65e9856d2/AD_4nXdSTugQq-vO9B3eMagWP2njLtCun9Sep0jY0FnveOpFmfoaqs1Pyk3_iZUPikuASuSpDBpUZyFwJBVrMC3gXp58i0X1ywAde-ZbqUnXgXVPZDaMDz9beca54EpXYcVOPmUN5zONx3sFW1sDBhPS---qA4P4.png",
      "alt": "AD_4nXdSTugQq-vO9B3eMagWP2njLtCun9Sep0jY0FnveOpFmfoaqs1Pyk3_iZUPikuASuSpDBpUZyFwJBVrMC3gXp58i0X1ywAde-ZbqUnXgXVPZDaMDz9beca54EpXYcVOPmUN5zONx3sFW1sDBhPS---qA4P4?key=ypqqqLMklZ-7f7gCJfowHw"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/4f/24/4f2441afa0528763f7a141a0a23f33f3/n5Ie47ybaFuRyCyLTkAQOWgEkT3RMPLIK92exMcfprqULsLQLqp9Zgw4Qx3keqgbSmMF1kVNhJOT9oNOncfuB00NQWy2Bg9502SognEY8niyEw91zkMpVKUE4w3jhD33-Hjdr5VSDcqL_HvqE4DxaKY.png",
      "alt": "“Ads Manager” button highlighted in Facebook analytics"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/1a/e1/1ae1be6831eb1ae0dd6840d51b496d15/wLKpaOLxTChMR4D4p0Y7Rg_wzcEoWWr5LAj8yvtXaeV7LQlcnQd7rnNRkc05bFpwTFQWJfaqj2Tb4TYq2E_wS4Vbhdx0Q-cna4b_pC3qeGTNwGL76rN90YBJQ5gDU24rkU2XwupX5q9v1Pe2UXQZlT0.png",
      "alt": "campaigns icon highlighted on the left side of the screen."
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/30/93/3093455257fafe40a61a543436c59124/VGn0OTyxRXhMdtIWMBiEPTwg4ZYC8rY5tDfSUCMQS1vYRBHNONlhjs_RP6mLGDzqmDC7i3SWDNPddDu1InCXUsRtBLyrUY52jCNp72M9O2cP2m-8WcUx6e7w61qYnSoe5PvOuUUCF44liJ1Kr6bCfb0.png",
      "alt": "navigating to “View charts” button under \"Campaign 1\""
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/be/f2/bef2f11765d4575090e8162d441af1b9/A3UY6x-HEDqL7DIBZ__nPMYdFeRcrHDQRhDZPnSt12c8rQF4gSDkcV4m2_XeBgrB-c5nErUlcWi0V1eI1_MIic2zzRQ4CTStmiblIG6Sd3PQp4O-pOvffd0p1jS0QNOv2mJnV1mn2RFFjWWInFE823Y.png",
      "alt": "\"Performance overview\" report in Meta Ads Manager"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/13/e8/13e8e9b0160df4cb1eb6823c27565ac5/dAyka61ZIttguPJmZ3oZsae9hWoLenjiSmnGw-a6iAUIuf2o8YgYezlvA1yxXDg7xdGyLIZ23wRjITjTcRWJ398QZUEZFkiIrlBdw2nV8jhAfcBLvVbwVzvMxCtjs74-Ho9gTLV2_biz8VFyTggZ4Rw.png",
      "alt": "“Customize metrics” button in the top right corner of \"Performance overview\" report"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/44/b6/44b6ec49ecf63ac6e4bb06d4bf98637e/VChOsivTvwVf4DTkisePfK2DIc4Szakkyce208tauTB0Gwj6xlE55hcOMFcfZk_avszOTHGvFz2aMvtxSApe8_Hf4SbV8PbDDfJ6_IaA4Ul-3o8TX-v6MvREvho4_aqXcH5pR3KjBb7pPboDCvWgQ_Q.png",
      "alt": "“Customize metrics” section"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/11/a5/11a530c9c99f3a10334b3b2306e3e5bb/uZMB8XO6ZgN7ATZYxz9cxVS71jJr5X0Dnt-l7G9RW015-iLTAiSuzCj-L17WnebZwx8ea6auEOlG8mmw6bZ7agH251_pEl7BnnMh9agIJlvN1y1bllG0KIWnf3OsEVT6YrGCAsy7x05eKHiMpkaclHI.png",
      "alt": "an image showing ROAS formula: ROAS = Revenue / Ad Spend"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/d8/f8/d8f85339bc5bcbb42953b8da59ddf4ab/y-_UoLYLqaxDO6wpdTqZC3KVwBdAcVuB24Cjr8NsOE4YCRmiPizmuOCeE94Z50-BokRaUfIhZoQd1ToMGiQqtDKYEm875MnmnuGhENzObTFzsJycF8zFVezFu3Ex_d9Vec95ykNJy1zmqeia7w-ww3s.jpeg",
      "alt": "an illustration of how A/B testing works"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/19/df/19dfbefe31e7bc9cea95217ac826e989/ikp5k52OdjHBQEHds3xDCMAkkZONeeXhgRdyEWrA6t8bTv8X9J7JmVxQUCSeoqQfYBy0Rk_lmo0kDHNpgrGAmqMYlfvXPDic0TlIU3faYnGndYEw6g5ca_umAl2oRb0pamr11BAA_-VKXMtd-xTPsyg.png",
      "alt": "“Facebook” tab in Semrush’s Social Tracker tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/c4/b1/c4b145b8507178317a7933d2c42ab1a6/8P3ygK2Q9b0Er4EpMRbqXcCvWpVXFEpM5jmECCAzn06G5nEN7cJ6x6wbOlqSN2hV04vVnv2T6wHSiLBthAdzgrQcsDuoJtwY-SgXNxj6TS0cpK1pVOOJhH2A2qZhDe_K_neyHTFr14W2j9pAhjP-21s.jpeg",
      "alt": "“Activity” button highlighted in Social Tracker tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/af/53/af538c1a081ac7910a85751282077598/KMi9NEs4jSzLtMC94Oyy6e7Z0P4SBFHfDPxIjYUM1X1363UIwDLAAeLvDzJfvswTHFbwIDlnO0_VQ0P5vGnkSMEs04hPzP2Nw197jTQ6UAXP7RMeuTHKvi4JtmGisx9KtkqimlTq6Wm8cChs2UJzuqA.png",
      "alt": "an example of graphs showing when the competitor publishes posts and when their audience engages with posts"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/semblog-next-static/banners/trial-gift.png",
      "alt": "Trial Semrush banner"
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&d=Mon%2C%2021%20Oct%202024%2014%3A11%3A30%20GMT&n=4d&b=The%20Beginner%E2%80%99s%20Guide%20to%20Social%20Media%20Advertising%20in%202024&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fsocial-media-ads%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&b=The%20Beginner%E2%80%99s%20Guide%20to%20Social%20Media%20Advertising%20in%202024&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fsocial-media-ads%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://bat.bing.com/action/0?ti=5128787&tm=gtm002&Ver=2&mid=83fe8c5d-baac-456c-a37b-80e68292a1c6&bo=1&sid=4e5ad9508fb611ef9ac2017867259182&vid=4e5b34e08fb611ef8a9f33cf84103a6e&vids=0&msclkid=N&uach=pv%3D3.0.0&pi=0&lg=en-US&sw=1280&sh=720&sc=24&tl=The%20Beginner%E2%80%99s%20Guide%20to%20Social%20Media%20Advertising%20in%202024&p=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fsocial-media-ads%2F&r=&lt=925&mtp=10&evt=pageLoad&sv=1&cdb=ARoR&rn=157531",
      "alt": ""
    }
  ],
  "publication_date": null
}