{
  "url": "https://www.semrush.com/blog/website-metrics/",
  "title": "The Top 24 Website Metrics to Track in 2024",
  "content": "Running a website without tracking its performance is like flying a plane without a navigation system. You won’t know if you’re headed in the right direction. Or where you should course-correct.\n\nThe right set of website metrics provides consistent feedback on what’s working and what isn't. So you can adapt. And hit your marketing goals.\n\nTrack these 24 website performance metrics to understand how well your website attracts, engages, and converts visitors. \n\nWhat Are Website Metrics?\n\nWebsite metrics are objective, data-based, numerical measurements of your website performance. \n\nThese metrics show how well your website attracts visitors, engages them with content, and converts them into customers. Some metrics measure technical aspects related to search engine optimization (SEO), page load time, and more.\n\nThe Importance of Website Metrics\n\nTracking website metrics helps you identify what works well. \n\nFor example, it can show you which sources bring in the most website traffic. Or what type of content converts. So you can do more of what works for your brand.\n\nWebsite metrics also give you an unbiased view of how visitors and users interact with your website. For instance, a landing page with a high bounce rate could indicate that the content, experience, or design doesn’t resonate with users.\n\nLastly, website metrics offer an opportunity to understand your ideal users. They help you categorize website visitors based on geolocation, traffic source, and device. This can help you target more of them later on.\n\nHere’s an example of data from Google Analytics showing users by device:\n\nFrom multiple data points, you could learn that most of your ideal users are from the U.S., arrive on your website organically via Google.com, and use a mobile phone. From there, you can fine-tune your website content and design to serve this target audience better.\n\nEvolution of Website Metrics in the Digital Age\n\nIn the 1990s, websites were scrappy, hyperlink-based sites. And their efficacy was measured by two metrics introduced in the mid-90s: page views and visits. That’s all.\n\nToday’s websites are highly personalized, interactive, lead-generating assets—central to our marketing efforts. \n\nThey have advanced to:\n\nCompete with other online offerings\nServe more users (global online users grew from .05% in 1990 to 66.2% today)\nInteract with users via 3D elements, animations, chatbots, motion sensors, search features, social media, videos, virtual reality (VR) and augmented reality (AR)\n\nIf the early websites were comparable to a Ford Model T, today’s websites are akin to self-driving cars that run on better roads, at higher speeds, with more features. \n\nThey must be measured differently. We need a range of detailed website metrics to help us identify our opportunities to stand out from the competition.\n\nHow to Check Website Metrics\n\nTools like Google Analytics and Semrush provide you with comprehensive website analytics metrics. \n\nFor example:\n\nGoogle Analytics reveals how users interact with your website, how long they stay, and which pages they visit. \n\nSemrush’s Traffic Analytics tool does that too, while Domain Overview tracks a site’s performance over time, Organic Traffic Insights reveals engagement by keyword, and Site Audit reports on the technical performance of your site.\n\nBelow, we’ll consider seven categories of website metrics. And within each one, recommend specific metrics to measure.\n\nWebsite Traffic Metrics\n\nWebsite traffic metrics have to do with the visitors who use your website. \n\nThe following four website traffic metrics can help you understand how many visitors you get each month, where they come from, and what content they consume.\n\n1. Total Number of Visits\n\nThis metric tells you the total number of times your website was visited during a specified period: monthly, quarterly, or annually.\n\nThe ideal number of website visits will vary depending on your offering, industry, and target audience. For instance, an online B2C (business-to-consumer) brand may view 1 million monthly visits as inadequate because it’s focused on high-volume sales. But for a niche B2B (business-to-business) SaaS product, even 10,000 monthly visitors can be valuable because it focuses on lower-volume but higher-quality leads.\n\n2. Total Unique Visitors\n\nLet’s say two users, A and B, visited your website in the last hour. User A visits your website once. But user B visits your website twice. In this case, the total number of visits is three, but the unique visitors count is two. \n\nUnique visitors are the actual number of people you reached. Use the following formula to find the average number of visits per unique visitor.\n\nIf your website received 15,000 total visits and 10,000 unique visitors last month, your average visits per unique visitor is 1.5.\n\n3. Traffic Sources\n\nTraffic sources reveal how visitors arrive on your website. \n\nFor example, see if site visitors came from search, a link in an email, a referral link, paid ads, or social media.\n\nIdentifying your site’s top traffic sources helps you focus your marketing and sales efforts on channels that bring in the most visitors. \n\n4. Page Views\n\nThis metric shows the total number of times any of your webpages loaded in a browser. So, even repeated page loads by the same user are counted. \n\nAdvanced tools may also show a unique page view metric that counts only unique user page views.\n\nTrack the above four website traffic metrics with a free Google Analytics account. Or, use Semrush Traffic Analytics to go one step further. It compares your traffic metrics with your competitors’. And gives suggestions on how to attract more traffic.\n\nTo start, log in to Traffic Analytics. \n\nAnd enter the domains of up to five competitors. \n\nSelect a location from the drop-down. Then, click “Analyze.” \n\nIn this example, we’re using Nike and Adidas as competitors for our fictional shoe brand. \n\nYou’ll see a dashboard similar to the one shown below. \n\nThe “Overview” tab shows three of the four traffic-related metrics:\n\nTotal number of visits\nUnique visitors\nPage views per visit\n\nTo find details on the fourth metric, traffic sources, click “Traffic Journey.” \n\nYou’ll see Traffic Channels.\n\nBelow that, you’ll see “Traffic Journey.” \n\nWith this information, identify opportunities to replicate and improve on your competitors’ success. \n\nIn our example, both Nike and Adidas have traffic from Facebook. Facebook may be a good place to advertise and reach the target audience.\n\nAnalyze Competitors’ Traffic\n\nwith the Traffic Analytics Tool\n\nTry for Free →\nEngagement Metrics\n\nEngagement metrics reveal how users interact with your site. \n\nFour to review are:\n\n5. Average Session Duration\n\nThis metric tells you the average time visitors spend across your website before their session ends.\n\nA longer average session is more desirable. But your metrics will vary depending on your industry. The average session duration for B2C websites is 92.33 seconds. For B2B, it’s slightly lower at 77.61 seconds.\n\nIf your average is above that, your site is doing well.\n\n6. Pages Per Session\n\nThis metric tells you the average number of webpages visitors view during a session. For more context, this metric is often shown alongside the average session duration metric.\n\n“The median number of pages per session for B2B companies is 1.89” according to Databox. So, two or more pages per session is highly desirable. If your pages per session metric is less than two, revisit your content strategy, website design, and ideal customer profile. \n\n7. Bounce Rate\n\nBounce rate measures the number of sessions that lasted fewer than 10 seconds, led to no conversions, and had fewer than two page views.\n\nIt’s reported as a percentage of all visitor sessions. The following formula helps you calculate your bounce rate:\n\nLet’s say your total number of monthly sessions is 50,000. In 20,000 of those sessions, visitors exit your website without viewing another webpage, completing a conversion, or staying for at least 10 seconds. Your bounce rate would be (100 X 20,000) divided by 50,000 = 40%. A bounce rate of under 40% is good.\n\n8. User Behavior Flow\n\nThe user behavior flow is shown as a sankey chart. This chart shows how visitors navigate to other pages on your website.\n\nThis chart helps you visualize the order visitors go in as they move between your various webpages. It also identifies the pages where visitors commonly drop off. \n\nUse this information to improve your site design or create more engaging content.\n\nTrack these four website engagement metrics with a free Google Analytics account. Or use Semrush’s Organic Traffic Insights for a more detailed analysis.\n\nLog in to Organic Traffic Insights. \n\nEnter your domain and click “Get Insights.” \n\nNote\n\nIf you already have projects in the tool, click the “+ Create project” button in the upper-right corner to add a new domain to your dashboard. \n\nOnce you set up a project, click the project name to see metrics about its keywords, users, and sessions.\n\nCombine GA, GSC, and Semrush Data\n\nwith the Organic Traffic Insights Tool\n\nTry for Free →\nConversion Metrics\n\nConversion metrics help you understand how well your site is driving action. \n\nCalculate the effectiveness of your conversion and sales funnels with these three conversion metrics.\n\n9. Conversion Rate\n\nThis metric tells you what percentage of visitors performed a predefined conversion action, such as subscribing to your blog, downloading a PDF, or purchasing your product. \n\nDefine the most appropriate conversion action to measure based on your website goals. For example, if you’re running marketing campaigns designed to generate leads, measure the conversion rate on your form submissions.\n\nWhatever you’re measuring, the conversion rate formula is:\n\nIf 10,000 total visitors view your landing page and 5,000 submit the form, your conversion rate will be 5,000 form submissions divided by 10,000 visitors (= 0.5) multiplied by 100 (= 50). That’s a 50% conversion rate.\n\n10. Cost Per Conversion\n\nThis metric shows how much it costs a company, on average, to convince a user to perform the conversion action. \n\nTo calculate this metric, divide the total conversion campaign cost by the number of users who performed the conversion action.\n\nFor example, if you paid $10,000 (total campaign cost) to create social media assets and ads, and you get 50,000 visitors who perform the conversion action (submitting a form), your cost per conversion will be $10,000 divided by 50,000 conversions = 20 cents per conversion.\n\n11. Lead-to-Customer Ratio\n\nThis metric tells you how many leads you need, on average, to earn one paying customer. \n\nTo calculate this metric, divide your total number of leads by your total customers. Set parameters based on the question you want to answer.\n\nFor example, you could calculate leads and customers from:\n\nA certain time period\nA specific campaign\nA particular sales region\n\nFor example, if a marketing campaign generated 1,000 leads and 200 became paying customers within 90 days of its deployment, your lead-to-conversion ratio for that campaign would be 1,000 leads divided by 200 customers = five leads per customer.\n\nBusinesses with long sales cycles and large average purchases may substitute leads with qualified leads. A qualified lead is a person or company that fits the business’s ideal customer profile (ICP) and has intent to purchase.\n\nSo, the above example of 1,000 leads will undergo another qualification step. Let’s say that only 500 of these leads meet the qualifying criteria. In this case, the lead-to-customer ratio would be 2.5 leads per customer.\n\nA free tool like Google Analytics can help you track these conversion metrics. Or use Semrush’s AI feature to analyze competitor purchase conversion trends. This helps you identify effective conversion strategies from your competitors.\n\nAnalyze Your Market\n\nwith the Market Explorer Tool\n\nSign up Now →\nSEO Metrics\n\nSEO metrics measure how visible your site is likely to be in organic search results. \n\nUse the following four SEO metrics to understand your website’s performance in search. And how to improve its online presence.\n\n12. Keyword Rankings\n\nWhen someone conducts an internet search using terms that are relevant to your business, where your URL appears in the search engine results pages (SERPS) is your keyword ranking for that term. \n\nFor example, if your website is in the third position on Google’s search results page for a particular keyword, your keyword ranking is three. \n\nYou’ll have different keyword rankings for each keyword. Ideally, you’d want to rank highly for as many relevant keywords as possible.\n\nFor example, if your website sells CRM software, you’ll want to rank highly for several high-value keywords such as “what is a CRM,” “CRM pricing,” and “salesforce alternatives.”\n\n13. Organic Traffic\n\nSearch results can include both paid and unpaid results. Organic results and ads. \n\nThe organic traffic metric tells you the number of visitors who arrive on your site specifically from unpaid or unpromoted search results. It accounts for all the free traffic you attract by creating relevant and insightful content for your target audience.\n\nVisitors that come from paid search ads don’t count as organic traffic.\n\n14. Backlinks\n\nBacklinks (or inbound links) are links on other websites that point to your website. \n\nLet’s say a customer leaves a positive review of your SaaS product on a product review site like Trustpilot or G2. And that review contains a link to your homepage. That counts as a backlink.\n\nIdeally, you’d want to encourage as many backlinks as possible by asking your customers, partners, and vendors for public reviews and testimonials. You also earn backlinks by creating free offerings, original research, and remarkable user experiences that experts and influencers in your industry want to talk about.\n\n15. Click-Through Rate (CTR)\n\nThis metric tells you what percentage of people clicked on your link out of everyone who saw it. It can help you determine how many impressions you need to earn a click. \n\nCalculate the CTR using this formula:\n\nLet’s say you run an ad campaign highlighting an original research statistic from your company data. If 10,000 users saw this ad and 1,000 clicked the CTA button, your CTR is 1,000 clicks divided by 10,000 impressions (= 0.1) x 100 (= 10). Your CTR is 10%.\n\nEasily track the above four SEO metrics with a free Google Analytics account. And use Semrush’s Domain Overview to find hidden keyword opportunities. Adding those to your content can attract even more organic traffic.\n\nTo start, open Domain Overview.\n\nEnter a domain that you want insights for. Select a location from the drop-down. Then, click “Search.”\n\nThe tool will analyze that domain’s competitors and provide a detailed analysis of their traffic sources, backlinks, and ad performance. Use this information to capitalize on your competitors’ weaknesses.\n\nGet Insights into Competitors & Clients\n\nwith the Domain Overview Tool\n\nTry for Free →\nContent Performance Metrics\n\nThe following three metrics, along with other content marketing metrics can help you determine how effective your content is.\n\n16. Top Performing Pages\n\nThis metric lists the webpages on your site that attract the most traffic. \n\nIn Google Analytics, navigate to “Reports” > “Engagement” > “Pages and Screens.” You’ll find a list of all your webpages ranked in descending order in terms of page views. \n\n17. Average Engagement Time\n\nThis metric tells you how long, on average, visitors keep your website in focus in a browser or in the foreground of a mobile app.\n\nCalculate the average engagement time metric using the below formula:\n\nLet’s say that three users, A, B, and C, visited your website in the past hour. User A views your home and the pricing pages for a combined total of five minutes. User B views your home and about us pages for a combined total of three minutes. And user C keeps your website in the foreground on a mobile device for four minutes.\n\nIn this scenario, the total engagement time is 5 + 3 + 4 = 12 minutes. Divide this total by the three active viewers. 12 minutes divided by three viewers = four minutes average engagement time.\n\nIn Google Analytics, navigate to “Reports” > “Engagement” > “Engagement Overview” to see the average engagement time for your site.\n\n18. Social Shares\n\nThis metric tells you how many times your social media posts were shared over a specified period of time.\n\nLet’s say you launched two posts over the past 24 hours. One post was shared 10 times while the other had zero shares. Your total social shares over the past 24 hours is 10 shares.\n\nBecause Google Analytics tracks only your website performance, there is no straightforward way to measure social shares on the GA4 platform. Instead, use the Semrush Social Tracker to see a report of how users engage with your social media posts. \n\nOnce you log in to your Semrush account, find this tool under the “Social Media” menu. \n\nThe tool provides a detailed daily report of total engaged users, reactions, comments, and shares. \n\nHere’s an example:\n\nSocial Tracker also gives you information on your competitors’ social media efforts. You can switch between profiles using the dropdown menu on the dashboard.\n\nStreamline Social Media Management\n\nwith a Semrush Social Subscription\n\nStart Free Trial →\nTechnical Performance Metrics\n\nTechnical performance metrics provide an understanding of your website health.\n\nThe following three metrics give a good overview.\n\n19. Page Load Speed\n\nPage load speed measures how many seconds it takes, on average, to display your entire webpage in a browser window. \n\nPage load speeds will vary based on users’ network speed. But it also varies based on internal factors like how many resources the page needs to load. Ideally, you want page load speed under 2 seconds.\n\nBecause faster page load speeds improve user experience. \n\n“The probability of bounce increases 32% as page load time goes from 1 second to 3 seconds,” according to Google.\n\nFaster load times can be good for your ranking in search engine results pages, too. Because Google prioritizes pages with good user experiences higher in the results. \n\nFind your website’s average page (HTML) load speed via Site Audit. \n\nFrom your project dashboard, locate the “Site Performance” panel under “Thematic Reports.” \n\nClick the “View details” button.\n\nThis report displays data Site Audit got when it crawled your site. It also creates a color-coded, page load speed graph for your webpages.\n\n20. Crawlability\n\nCrawlability refers to how easy it is for search engines to find and index your webpages. This is important because search engines have to index your webpages before they can appear in organic search results.\n\nInternal links, a logical structure, and an XML sitemap improve the crawlability of your site.\n\nFind crawlability information by navigating to “Settings” > “Crawl stats on your free Google Search Console.” Or you could use the Thematic Report in Site Audit to see an overview of the elements affecting your site’s crawlability. And the crawlability issues you can explore and fix.\n\n21. Internal Linking\n\nThis metric tells you the number of internal links that point to webpages on your website. Similar to external links, internal links also boost a webpage's authority.\n\nPage authority is a score that reflects how likely a page is to rank in search results. A higher page authority reflects a higher likelihood of ranking at the top of search results. More internal links can lead to a higher authority score. \n\nSite Audit offers a far detailed report of your internal links. This tool’s “Thematic Reports” section includes information on crawl depth, internal link distribution, and internal link errors.\n\nIn addition to showing detailed load speed, crawlability, and internal linking reports, Site Audit also scans your website for over 140 technical site health and SEO issues. \n\nThe “Overview” report provides an overall site health score based on the number of website errors and warnings. Use this information to address these technical issues.\n\nFind and Fix Website Issues\n\nwith the Site Audit Tool\n\nSign up Now →\nCustomer Satisfaction Metrics\n\nThe following three metrics measure your user satisfaction levels.\n\n22. Exit Rate\n\nThis metric tells you the percentage of sessions that ended on a particular page. For each webpage, calculate the exit rate as follows:\n\nIt’s helpful to know which pages most often result in an exit. You can use this information to identify and fix pages that cause most visitors to leave.\n\n23. Customer Satisfaction Score (CSAT)\n\nThis metric gives you the percentage of users who self-report feeling satisfied with the interaction they had with your website. Consider using an in-app survey tool like Userpilot or Survicate to collect CSAT from your users.\n\n24. Customer Lifetime Value (CLV)\n\nThis business metric measures the average revenue you can expect for each active customer. Calculate CLV using the below formula:\n\nYou’ll need information about the total revenue, total number of active customers, and the average customer lifespan from your CRM or accounting software. \n\nEffortlessly Track the Website Metrics That Matter\n\nTracking these website metrics manually can feel laborious. \n\nBut monitoring website metrics is crucial for understanding and optimizing website performance.\n\nSemrush provides a straightforward way to access key website metrics all in one dashboard. Get over 55 different tools, including the ones mentioned in this article, under one Semrush account. \n\nAccess 55+ Tools\n\nwith a Free Semrush Account\n\nSign up Now →",
  "headers": {
    "h1": "The Top 24 Website Metrics to Track in 2024",
    "h2": [
      "What Are Website Metrics?",
      "Website Traffic Metrics",
      "Engagement Metrics",
      "Conversion Metrics",
      "SEO Metrics",
      "Content Performance Metrics",
      "Technical Performance Metrics",
      "Customer Satisfaction Metrics",
      "Effortlessly Track the Website Metrics That Matter"
    ]
  },
  "images": [
    {
      "src": "https://static.semrush.com/blog/uploads/media/59/60/59608072afa5af619cbfda1c9c7356fa/114eef6321537dc04e433fa8d2984edf/website-metrics.svg",
      "alt": "Website Metrics"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/a3/26/a326257faf1829a86db9dd4f38df8cdf/2e9f40e9ea2caff559f5d74d7da4bd94/vYQeosWmYbcwc9c6yVQ-nqBaabzyQdxHanQGwyWB0HiciEci1gDr9VVABhjFgij3mCBItKBdS-lcY2Oj7OfWX4SB5_VZRE4cFIWZTvN3iTrR6mhLxOrDSaTqc92B8paVC5gQDrpvLLJ-PfAdTpEzL3k.png",
      "alt": "Users by device data shown in Google Analytics"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/60/38/60381a03012f636429f60fe87757c471/4d8c37b6e47be922c7c08d49d62e7878/lTeH3Kj8M6YkbifDI2Zp1J3l4JgNyhjWvzODIb8c3PQSN4aHiQRcznUWeOwGp2s1mj3qNmMp_3GrAPJGR8h1EDuj7CTu2PzK6NAbK8jOhbRI9Fs4nyz3P0nWLywmBNeRi7PJTAYdyvXA5_2_hmfsfP4.png",
      "alt": "Average visits per unique visitor formula"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/1c/c3/1cc31ebd921794e860cee6d546779aed/4209524e73df0dfec6584bd22067d651/kSfNyPS2DcrAbC1u1VZ6e_NPKfh5Qdqw4OL7wbH4oV82nnMBJ7gjwu0ozKinOowToX5tair0-_kHp3l3mCBvPq_M_yWml4yN3F_2iv4JPMz1IsQS46iicS0wd1-L_dyhJGkiGXgUcrBy653ySLObA7E.png",
      "alt": "Traffic Analytics tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/45/c9/45c9c1397e7a54950b51efd149a7b369/1886f5fb0e436ace4f98731a5f22a07c/2p84ELKKVGHHsATtfjCEQa09EEliv2ZlAkPMQnPVqBLXNH7aTUKquY3lBPwy_aOjtLLJtsLs2VN3rwyFUcDLU9QOHbehNnsMReOSHTBUqKU9MAK3MiOn2avJdBn1PJEcGzPBrdb2ELDYJ6Y6OO97zvk.png",
      "alt": "\"nike.com,\" and \"adidas.com\" entered into the Traffic Analytics tool search bar"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/10/8f/108f34024ad35ab26dbaa4a0bcdc146e/8031e0d1fa4d6787159ab3a8cce4153f/u2pW6lOsZXJJFvzsPUWS-z8DB1X5xu81Jo-I5LVJzTq5ZV4PTswWAvX5lEORR_2-tGL-jRjmyaqyTgWj_lEyUNtRKlyF80ESe4If3db2mi2KoS1kJQ0qNDw-tvxgnGvUm_g4SnJl4PepulakC3l6UN8.png",
      "alt": "An \"Overview\" dashboard for Nike and Adidas in Traffic Analytics tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/b3/e2/b3e223cb5cec0fe5c96ab5410551e1dc/534f6e55c72987bf46af4d32a8b2c627/0gZAGGRlAjYiWOreilQiQxyVNhy_3rWz3U4WNjdIgRcupkt6jNA197cMeCM_EaG8Wc9wFZMLKxWKc9N9lEo6m4B7P68zapWgfiz7SQcrB9vjMzafhDXyJG_6jDd4ewoL3Ukqu7VTp3ZGxz-zioRuduc.png",
      "alt": "Visits, unique visitors, and page views per visit metrics highlighted in Traffic Analytics tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/47/a5/47a5954690029a6e2e62919804714e39/3f0e112fcb686ca7fef1934757221f81/yiXpIc6DJiEVWZPIh050bfKv0FG8bXsy406mAXKmzYw4caxhq8gkyHzb9C0dabpJCg9PvemtHimd2ijgbwgui5aDEi-bmO1wKlYoJh2w8e4wHfy-V2MoSqQimpnDnAJqWjM9dIWGPzXySgOyoj5fm1c.png",
      "alt": "\"Traffic Journey\" tab highlighted in Traffic Analytics tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/9c/59/9c59147b9682828e8d6877b1807b8df1/477d406cf23f9df0d7c523a56e6b7073/_Eb5FY3659EY28ceK_5oJJWFJqtc0Jkd0XIPkOh0L7Q6K4WjDiPBH22KRhHpaLxLa-IrFqAXvH2ggWcPn3yAwiym2dEkzvUwM6nqlnJkJSyxM87B7iINrnMLu-XlHp05XDfivwmHQXpMkpYDinOxYNg.png",
      "alt": "\"Traffic Channels\" data shown in Traffic Analytics tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/7b/0d/7b0d69bca392331a7a454c4ad56961be/8a800f066a14b8545f91c8563a645d5e/Y0l5j_CiTdG2SJemdVdhHaWMdXDy7MPHGWGtaA01miVQVRHiSMMtzBuRWv8BXgKaIQwdzSWpQ7z2XaOaqUnmHaBH_0MA8WSTZ-FcX6757_DflBN4PbmHyp-6UyjqfP7iarzr5Rq5c1pioSxHIHoegdk.png",
      "alt": "\"Traffic Journey\" visualization in Traffic Analytics tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/4b/ec/4bec02b8168d1add51f5b7a83a5df9bd/a393f8110d2125c72b2bdf6214479c26/PkRNDGEkFmUwPu2YMQcFvC69oXceZwarhfxAkzl9wa6YvGnGHuoMoW51I69lNHrzISy8QlebJDENJ3Mb03DDei7K1h15-E_d1HhhHNOHJeVS14tDlnAoKBydGewzLc1dSM8ufyuIxpVK09muZP_lVAQ.png",
      "alt": "Bounce rate formula with an example"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/34/34/3434f67e9870348c942c74b6679da9fe/ab2e2b35c4ae28c66efdb26f7cbbcc58/Ej-8A9pqfRHEnivo1QSu4WmLki-QnaXoBue5dqPwZRBfgsbRv_oknKngTekmLtUuzIrPp_UdgqJPRkw9j6weBGv05x7d0ZCWXym0hJbt_N9WdniA96uqNKO319ZZI5xHXwrI9fx2Rkf1uNifDJ5Bkp4.png",
      "alt": "The user behavior flow chart shows how visitors navigate to other pages on your website"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/aa/72/aa7229f15daf86a2f9d5f42aa1e16034/ccf8eb109c0264137e49af2de7f8f79e/YSroYsZ2JH8-H8ayJGO4-PGO8KVE0a3ZtvZv5xrF7wgFvJJanhHp_u-XrDtybz17V09_-5QOeWvcHTEAAt2ZBFKxql0kmW_xpyC_XfYVh3yX8r1urduQNwUNNV7LbZor2LUtOqDg0uljZQMC3tvfiQ8.png",
      "alt": "Organic Traffic Insights tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/b2/a4/b2a454647c2fecec029ae13e3f9a6b31/126efacf185cff0b2a3838e819dde506/R3DUzgMhJ5fD4lco1HRLpc7u5qhkkYJtUX2Ihvx4Ac2BWskPzXvW7wYUBGlWu8YbJI4sY9XU71ninPPyGs5DkdYtdPpcOoc5mUrP3CHdW85M9FnL9ItNhM4F7OMCKcsP4MKrkHgOEgAWh8woqzVuQ_E.png",
      "alt": "\"Create project\" pop-up window in Organic Traffic Insights"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/f4/b6/f4b6dc86edb1e1e2b96d855ab41b0e21/670dd49161aa37b5fec96ca3fbc89361/aqB0jhcVJT9WWX5hop2LWibITSwPt4sjQQdqSs7v4TyFIQs7JlA2-zihazSaIl468nmEy5SQyxKMnDazgj48g8Xhq7JA54_mjWm05YrPOXixG57Eucbb01XV-vy80-KN1a1D-7CUDjQbE6d-rkFBw1g.png",
      "alt": "Organic search traffic report, with keywords, users, and sessions metrics highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/1d/af/1daf14ba226066153181f51ea6a6305c/dd149d45c8f36afb3b6c0189e363a729/mcAm4cY311FPoYObpyjleeOz1343g1GjINpB8U-m1w2Sd8wWSGi8mg0YXxCMO-sJ4s9Dch402BxsBhYjZRLTpaNWBKRZVkJxYHE0J5fpmr7CPa-mXQmB_6j7-i45Uve8IoabqUi0CIWybM6r_I2bhlE.png",
      "alt": "Conversion rate formula"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/86/74/8674e4a55a17335a50da73541b70918b/d92b96c88d671847e4dec1b2b59f8aa2/BnglAUyrVNp08zDUtmnYYtdel-TzeTxSOY3JSsHgoyFa8e1ljQQRZLuZytAtSTGl41Citac-AOZf4-kXpGk103GBRwhzmwS6FsqTb0COwoneAf2Kd0pCrdtE4c1ZA-gcMKz8D5PlYA6y_kT_26JaCM0.png",
      "alt": "Cost per conversion formula"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/61/6a/616aebb0f9aad10bfb41434d8cefa0cd/7fc1708f0a91e314b5804a9fb8af4dfa/FuW5rwrRRKeuwQuLZI2Em_iDgJ4xwdFmrkb8yVi89RDY6izraeMj4sbHLzLiPbU1wTqHiiPJacWXDOJCASPMKQHhJ5jnzfAEXVgfewmJQtGzpUKw031he8qEi0o3D9D9bleSqZSi4Y0Ud7Rw_fzE7yM.png",
      "alt": "Lead-to-customer ratio formula"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/b7/dd/b7dd4ea9ccb90e1ce03b2f6dd04fc8fb/bf44b1df50f7c467f17997e21ceacdd8/uMgy6hCbqdYtn6qaGQ5eOdcr5KAINLG4QgCk0Cp1An5gpdHN1Kk6_B0AfKDpaCzMCwWR_UfWlB615yiuM6aDfPdXl-Tc-V-t6e94ohso7bIehpByUKVDFQveJYHzSwawMwEtYaDXV4n1nGVfJrX7Jrg.png",
      "alt": "\"Growth Quadrant\" widget in Market Explorer tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/16/54/165403be72f41bda155f9ed4fe8e3d5c/7b90a6da5a51be0c3f5696da9cd52cf9/YUlASOmptXMw6kgDMk6pycLINNlIc0JnADZM2hR0fbBTENtWU_GSMnUYlL3c0CReNaOSGgLAcunG7bWI8osLto69DjM-sqN997j11bF-aZ7JUpDTXV0ZfoWZQU8uxBbOHC8G7V4V9bcz14tY-NO5XRw.png",
      "alt": "Click-through rate (CTR) formula"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/08/1d/081d9f5bd1ada24924604d1d320ef3d2/96d883a179bd0c43c6fb1bd71fc530f3/Ta7IOs3DThF_TWnuXqgknsXWcDdgMjB3HedrbfsgdrVb3LHTcACZT2Puv292YKWYAG6e2LJhNqp77z7hu0OHbIMfcUGty0zmV5WER3g3e1oXEh_if1vMgunSqyJr9ztUliZzUGKCYZRhA2mJg6GnT3s.png",
      "alt": "\"hotels.com\" domain entered into the Domain Overview too search bar"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ec/3a/ec3a43b117b9ceb54d891bcc5a24fd36/960eb371356a3b1922b2c3fca53c76e5/seRFd0QIXpMV9ddwcYsVPiMqcU657OnS3jAmRFBG1DcgnERZIF4hE_a3FF_aNn5YfTZw-8yvMWfyf2C4x6euEIu--dnvOoeOxckDO8nqajJhEUXhSNrSCm80yR9XviJMS13JhMuf2Kco3SLhrnjRaNs.png",
      "alt": "Authority score, organic search traffic, paid search traffic, and backlinks data shown for \"hotels.com\" in Domain Overview tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/00/b9/00b9a8e6f1a62d08d6b290c2531e3679/9cbf571a316293b220251a96d6afcb22/3JMH2aRB6GcOsuTuvSU1XNwVHGKCmKs5lEwI0V09pndPxzb36fDsn42kpssG6qqc_u2AlD08MGCfhynI7jtqRvMRKWE4ZeOq37toJCV7VZZ4ic8xjWb3f_veRCOwgPnsgMBu1PyC81mYTLNM9IW6lEY.png",
      "alt": "Average engagement time formula"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/98/70/9870be9433bd7e421b44738bb88fc79e/665474e382a665d1ab409f637b753c09/pHHyG4gYAWqeDMaYRuMNbAmtkYo8z7bJI2o4ZE5_4LZrp0-qyADo7AFvO1-jID7g8JTEShYjXO-5obb-bq6t7fTzdx3WxHE23tjLEhQ3uJ-5F55Ow2VISnYTDc-cWlBLLK0OmNKMbayxRgdsyK591zA.png",
      "alt": "Social Tracker tool showing data for days of the week when post are published, and days of the week when people engage with posts"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/07/92/07923382281df491f96e395dcf010427/a3d0feb2a9676d819982fb580546179c/IQC2Qu9Vs-_bKbBPvWTP5LSukh9Xnospe7Hws80n2hqUdCOzZaJGqjutEXCtvpbNkVilHpM_953qylzPu5cgPrdVKs-cS5rWuxQ0tfUskVRxG5-AMhEWAfPYsHqVZz6VZ8VP-2KLOpLryeD9fM91x4M.png",
      "alt": "“Site Performance” widget highlighted under “Thematic Reports\" section in Site Audit tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/5b/ed/5bed4102c8df2ba750044f5505ef5585/a920cec6ca51ca40e55e988cc8752c83/zXpnCoU2n8zQkAp6aSKJg2R9KZJg6UX79z7A9qUFU5TjdN2sJrk8kRzu-tblAYbtPsAAu4vlobBIhK_vAZQkjku5CRojkMltV0AS-DMWIg1lYSSN01Nu59rXZDKYTke9GjIovtUuzRUlNt_xFpgbAlQ.png",
      "alt": "\"Site Performance\" report in the Site Audit tool"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/fd/d9/fdd94037758a27aa1be16138824a9a8b/d8804a0c9f41095b955a6e8c5733a494/nqfX4Yt5wtHQm7ZNP_GRv01CAAWgveMTs64b6mV_aADEurwNfImPmYuj9FT67kLHVs8uMth2wuDlE7_zGj-kC6CANq7jYVbolFku2OzgVeLLwyx5kazTZX3VFBFcn4EgInNUnN7daSXWY2FFmCNUzNQ.png",
      "alt": "Site Audit tool's “Thematic Reports” section"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/fc/72/fc72b11198b5b0cde36f082891e46a16/0e21ca68bc4df3631381d0117efe9ec6/45yQ_zFX88lvANZpjTbnbRKD17CMLrdp9ygjmSVH7JHopVq-lBCt7RGgMj8RjRMwh5lhggpolbTFIdsPZpeMMOgSqash4XbEIgWqUTsI1t0MI3MzFtt5YChTxSz91FNRKYdXt2NsWTRp0xw-fyO_Cgk.png",
      "alt": "Exit rate formula"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/74/4f/744f803bf5420d07baad75667c568f7f/b22b3f3755996f6d75d8a478f35c1afa/61p5SklGOftLV8WZ39l9eHpGVxIx1yed9hlBi5zOC5Ql3f9UzcSA3-DMnM5r6799nmqZT-hep2uX4atROaRQVHVgT_qsy4XwPQVc-kdF15XGc6bz8k24A87kX37E12l0RU0v5V_ulQGQwV1qujbN8Lg.png",
      "alt": "Customer lifetime value (CLV) formula"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/semblog-next-static/banners/trial-gift.png",
      "alt": "Trial Semrush banner"
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&d=Mon%2C%2021%20Oct%202024%2014%3A23%3A33%20GMT&n=4d&b=The%20Top%2024%20Website%20Metrics%20to%20Track%20in%202024&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fwebsite-metrics%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&b=The%20Top%2024%20Website%20Metrics%20to%20Track%20in%202024&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fwebsite-metrics%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://bat.bing.com/action/0?ti=5128787&tm=gtm002&Ver=2&mid=7adc1a39-5844-427b-a799-ec0c7e31c69d&bo=1&sid=ff2bacc08fb711efb44d311d3abb0ae7&vid=ff2c03008fb711efb2e37f1b0b73d2ee&vids=0&msclkid=N&uach=pv%3D15.0.0&pi=0&lg=en-US&sw=1366&sh=768&sc=24&tl=The%20Top%2024%20Website%20Metrics%20to%20Track%20in%202024&p=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fwebsite-metrics%2F&r=&lt=735&mtp=10&evt=pageLoad&sv=1&cdb=ARoR&rn=182227",
      "alt": ""
    }
  ],
  "publication_date": null
}