{
  "url": "https://www.semrush.com/blog/wordpress-seo/",
  "title": "The Ultimate Guide to WordPress SEO",
  "content": "If you want your WordPress website to rank well in organic search results, you need to optimize it effectively for search engines.\n\nIn this comprehensive guide, we’ll go over 23 key WordPress SEO tips that will help your site get to the top search listings.\n\nWhat Is SEO?\n\nSearch engine optimization (SEO) is a set of practices with the goal of increasing a website’s chances of ranking highly on search engine results pages (SERPs).\n\nSEO can involve tweaking your site’s structure, fixing technical issues, and targeting specific keywords throughout your content.\n\nWhy Is SEO Important?\n\nSEO is crucial for:\n\nImproving a website’s visibility in search results: Optimizing a website increases its chances of ranking at the top of search results. Which boosts the site’s visibility—ensuring more people are exposed to its pages and content.\nGenerating organic traffic: The top three results on a Google SERP get the most clicks. With proper search engine optimization tactics, you can get your website in one of the top three spots and drive valuable organic traffic.\nDriving conversions: On average, organic traffic tends to convert at a higher rate than other traffic sources. Which is why you should prioritize SEO in your marketing strategy.\n\nFurther reading: Conversion Rate Optimization: 9 Tactics That Work\n\nWhat Is the Relationship Between WordPress and SEO?\n\nWordPress (WP) is a popular content management system (CMS). It allows users to create both simple and complex websites with the help of thousands of website templates built by the WordPress community.\n\nWhile WordPress offers built-in SEO functionality (such as custom titles and meta descriptions), there are also many plugins you can use to enhance the platform’s existing optimization capabilities. And give your website the best chance of winning the SERPs.\n\nWordPress Posts vs. Pages\n\nWordPress allows users to create two main types of content: posts and pages.\n\nThe post format is meant for blog posts, articles, and news-type content. By default, they appear in reverse chronological order—with your latest posts at the top.\n\nUse the page format for static or evergreen pages on your site that will rarely change. Such as the “About Us” or “Contact Us” page.\n\nImportant: From an SEO standpoint, there’s no difference between a WP post and a WP page. Search engines see both as simply webpages. \n\nThe below tips apply to both WordPress posts and pages unless otherwise stated. We’ll mainly provide workflow examples of WP posts.\n\n23 Top WordPress SEO Tips for 2024\n\nFollow these tips to help you improve your SEO on WordPress:\n\n1. Make Sure Your Website Is Indexable\n\nBefore being able to display your website in search results, search engines like Google first need to crawl and index your website pages. So you need to check that your site is indexable.\n\nCrawling is the process by which Google finds pages on your website.\n\nOnce it discovers a page, Google’s crawler (a piece of software designed to uncover website pages) adds the site to the search engine’s index (a database where Google stores information about webpages).\n\nBy default, Google should be able to crawl and index your website without any issues. \n\nYou can check whether your site is indexable by clicking on “Settings” and then on “Reading” on the WP dashboard. \n\nOn the “Reading Settings” page, make sure the “Discourage search engines from indexing this site” option under the “Search engine visibility” section is unchecked.\n\nIf the option is checked, uncheck it and click “Save Changes.”\n\n2. Set Up an SSL Certificate\n\nYou’ll need a Secure Sockets Layer (SSL) certificate. This helps to authenticate a website and the individual or organization behind it.\n\nAn SSL certificate includes information such as:\n\nThe domain name (and any associated subdomains) requiring the certificate\nThe individual or organization who earned the certificate\nThe name and digital signature of the certification authority\nThe certificate’s issue and expiration date\nThe public key associated with the certificate\n\nSSL enables websites to use Hypertext Transfer Protocol Secure (HTTPS), a protocol that allows the secure transfer of data between a website and a user’s web browser.\n\nEnsuring a secure web browsing experience has been a priority for Google for years. It recommends that all websites use SSL and HTTPS.\n\nIn fact, Google’s web browser, Google Chrome, will warn you before loading a website that doesn’t use SSL.\n\nTo set up an SSL certificate for your WordPress site, you first need to purchase it from a certificate provider such as SSLs or ComodoCA.\n\nOnce you’ve purchased an SSL certificate, add it to your WordPress website by using a plugin like Really Simple SSL. \n\nHere’s how:\n\nFrom the WordPress dashboard, go to “Plugins” > “Add New Plugin.”\n\nType in “Really Simple SSL” in the search box and hit “Enter.” Click the “Install Now” button next to the first result.\n\nOnce the plugin installs, click “Activate.”\n\nYou’ll then be directed to the plugin’s main page, where you’ll select your hosting provider. Find it in the drop-down list and click “Activate SSL.”\n\nThe plugin will then ask if you’d like to activate additional features. You can click “Skip” for now, and then on “Install” to finally install the SSL certificate.\n\nThat’s it—your domain now has an active SSL certificate.\n\n3. Pick Your Preferred Site Address Format\n\nIt’s important to stick to a consistent site address format throughout your entire website.\n\nFor example, choose between:\n\nhttps://www.domain.com, or\nhttps://domain.com\n\nFrom an SEO perspective, either www or non-www is fine. But it’s important to decide on one or the other. \n\nWhy?\n\nBecause Google treats them as separate websites. Which can be a problem for a couple of reasons. \n\nFirst, you’ll have pages from both versions of your website competing for SERP positions. Which might make it harder for either page to rank.\n\nThis is known as keyword cannibalization.\n\nAnother problem is you’ll dilute your website’s authority and link value.\n\nHow?\n\nBy having some websites link to one version of your site, and others to the second version.\n\nSo, instead of having one highly authoritative site with plenty of quality backlinks, you’ll have two sites splitting domain authority and backlinks between them. This makes it harder for both versions to rank in organic search results.\n\nThankfully, WordPress makes it easy to show search engines which site address you’d like considered as the “official” version of your website.\n\nGo to “Settings” > “General.” Add your preferred website address in the “WordPress Address (URL)” and “Site Address (URL)” fields.\n\nDoing this will ensure that search engines crawl and index the right version of your site. And that users will land on the appropriate version—regardless of what they type into their web browser’s address bar.\n\n4. Enable SEO-Friendly Permalinks\n\nPermalinks are permanent URLs for pages on your WordPress website. They serve to create a logical URL structure that’s easy to understand and navigate for both users and search engines.\n\nBy default, WordPress uses a less-than-ideal permalink structure for posts. Depending on your WordPress installation, your URL might look like this:\n\nhttps://domain.com/?p=462465\n\nor:\n\nhttps://domain.com/post-title-june-15-2024\n\nThe first example makes it very hard to understand what the page is about.\n\nThe second can be problematic if you ever decide to update the post—since the URL would include the old date.\n\nA much cleaner, easier-to-understand URL structure would simply include the post name. Like this:\n\nhttps://domain.com/post-name\n\nYou can instruct WordPress to use the above structure by going to “Settings” > “Permalinks.”\n\nHere, select the “Post name” option in the “Permalink structure” section. \n\nThen click “Save Changes.” Now, all your existing and new posts will use the above URL structure.\n\nNote\n\nWordPress will automatically redirect your old URLs to the corresponding new ones. So there’s no need for you to set up redirects yourself.\n\n5. Install and Configure a WordPress SEO Plugin\n\nWhile WordPress does offer some SEO-friendly features out of the box, WordPress SEO plugins like Yoast SEO can help you improve your website’s search engine visibility even further.\n\nHere’s how to boost and streamline SEO for WP sites using Yoast:\n\nInstall Yoast SEO\n\nTo install Yoast SEO, go to “Plugins” > “Add New Plugin.” Type “Yoast SEO” in the search box and hit “Enter.”\n\nHit the “Install Now” button next to the first result.\n\nOnce the plugin finishes installing, click “Activate.”\n\nConfigure Yoast SEO\n\nFollowing installation, you’ll be redirected to the confirmation page. From here, click the “Start first-time configuration” button.\n\nOn the next page, click “Start SEO data optimization” to have Yoast scan your website and create a database.\n\nNow, click “Continue.”\n\nMove on to the “Site representation” section. Here, you’ll need to add more information about your website as follows:\n\nSelect whether your website represents an organization or a person\nEnter the name of your website and organization\nUpload the logo of your organization (if any)\n\nOnce done, click “Save and continue.”\n\nIn the “Social Profiles” section, add links to your website’s social media profiles (if any). Click the “Save and continue” button. \n\nYou can skip the “Personal preferences” section.\n\nThat’s it—you’ve completed the first-time configuration. \n\nNow, go to “Yoast SEO” > “Settings.” Select the “Posts” menu item under the “Content types” section.\n\nHere, you can set up a template you’d like Yoast to use for your posts’ title tags and meta descriptions.\n\nDo the same for your homepage and category and tag pages.\n\nUse Yoast SEO\n\nApart from creating templates for title tags and meta descriptions, you can use Yoast to add both of these manually to individual posts and pages.\n\nHere’s how.\n\nCreate a new post or edit an existing one. Next, scroll down to the “Yoast SEO” section.\n\nAdd a focus keyphrase (your target keyword for the post). And enter a custom title, URL slug, and meta description.\n\nPro tip\n\nWith a premium Yoast SEO subscription, you get access to related keyword suggestions to include throughout your post—thanks to the Semrush integration.\n\n6. Submit Your Sitemap to Google Search Console\n\nA sitemap is a file that contains information about all your website’s pages and content. Search engines use it to crawl and understand your site.\n\nWordPress will create an XML sitemap for your website automatically. You’lll usually locate it in your website’s root folder as “sitemap.xml.” For a hypothetical “example.com” domain, the sitemap would be:\n\nhttps://example.com/sitemap.xml\n\nNote\n\nIf you use the Yoast SEO plugin, it will automatically generate a sitemap that will replace the default WordPress sitemap. In that case, your sitemap will be located at https://example.com/sitemap_index.html.\n\nOnce you’ve found your sitemap URL, submit it to Google Search Console (GSC) to help Google crawl and index your website more efficiently.\n\nLog in to your GSC account and click “Sitemaps” in the left-hand menu.\n\nPaste your sitemap URL into the “Add a new sitemap” box and hit “Submit.”\n\nGoogle will then fetch your sitemap. It might not necessarily crawl your pages immediately—they’ll most likely be in a crawl queue.\n\n7. Optimize Indexing Protocols\n\nBy default, WordPress generates quite a few additional pages on your website that you might not want search engines to index.\n\nFor example, it will create separate pages for every blog category and tag. Plus an archive of your posts, with separate pages for specific dates and post formats.\n\nHaving these types of pages displayed in search results isn’t very useful to users. So we recommend that you prevent search engines from indexing them.\n\nThis is fairly easy to do with the Yoast SEO plugin. \n\nLet’s say you want to prevent the indexing of category pages. Go to “Yoast SEO” > “Settings” and select the “Categories” menu item.\n\nMake sure the “Show categories in search results” option is disabled.\n\nRepeat the process for all the other page types you don’t want indexed.\n\n8. Plan Your Site Structure\n\nHaving a logical and intuitive website structure will help search engines crawl and index your website more efficiently.\n\nAnd allow them to understand the relationships between different pages on your website.\n\nIt will also help users navigate your site more easily. And find what they’re looking for more quickly.\n\nHere’s what to keep in mind when planning your site structure:\n\nSimplify Your Top-Level Menu\n\nYour website’s top-level menu will be the main way most users will navigate your website. Build a menu that’s simple to use and understand.\n\nThink about the most important sections of your website you’d like visitors to be able to access at all times. Then, make sure to create menu items for each of those sections.\n\nUse short, descriptive phrases for individual menu items to ensure visitors understand which part of your website each menu item represents.\n\nHave a look at the top-level menu on the Semrush website for inspiration.\n\nThe menu includes links to all the most important information visitors might be interested in. Including software features, pricing, and company information.\n\nUse a Hierarchical Website Structure\n\nA hierarchical website structure consists of a parent page (i.e., the homepage) and its child pages (category and subcategory pages).\n\nHere’s a visual representation:\n\nUsing a hierarchical structure offers two main benefits:\n\nIt makes it easy for search engines to crawl, index, and understand your website\nIt simplifies navigation, making it easier for users to find the content they need on your site\n\nContrast this with a more disorganized website structure, where the connection between individual pages and topics is less clear. Making it harder for users to navigate your site.\n\nImplement Topic Clusters\n\nTopic clusters are groups of pages related to one overarching topic. They consist of a pillar page (a page covering the topic in extensive detail) and cluster pages (individual pages covering one subtopic each). Ideal for structuring your blog content.\n\nHere’s an example:\n\nIn the above example, the overarching topic (covered by the pillar page) is planning a trip to Disney World. The cluster pages each focus on one specific aspect of Disney World trip planning.\n\nIn a topic cluster, the pillar page links to each individual cluster page. And the cluster pages all link back to the pillar page.\n\nThis makes it very clear to search engines that the pages are related to each other. And signals that the website contains extensive information about the topic. Which also indicates the site as an authority on the topic.\n\nTopic clusters also help you create content with minimal risk of keyword cannibalization. So you avoid targeting the same keyword across multiple pages.\n\nFurther reading: What Is Topical Authority? (+ How to Build It)\n\nAvoid Orphan Pages\n\nOrphan pages are pages that aren’t linked to from any other page on your website.\n\nYou should avoid having any orphan pages on your website for three main reasons:\n\nThey might not get indexed. Search engines discover pages on your website by following links from previously indexed pages. If none of your indexed pages link to a specific page, it’s possible that it won’t get indexed at all.\nIt’s harder to rank them. Internal links pass link equity—or link authority. The more link authority a page has, the higher its ranking potential in search results. Since orphan pages get no links, they don’t get any link equity. Which makes it more difficult to rank.\nVisitors might never discover them. If you don’t link to a page from anywhere on your site, the only way visitors can reach it is by typing in the page’s URL directly into their browser’s address bar. So they’ll likely never find it.\n9. Use Post Categories Correctly\n\nWordPress categories provide a way to organize your blog posts. They help visitors navigate your website and discover related content they might be interested in.\n\nThe default category in WordPress is called “Uncategorized.” If you don’t assign a category to a post, WordPress will automatically mark it as “Uncategorized.”\n\nTo create a new category in WordPress, go to “Posts” > “Categories.”\n\nEnter a name, URL slug, and description for your category. If you’re creating a subcategory, make sure to also assign a parent category.\n\nClick “Add New Category.”\n\nYou can assign a post to a category from the “Categories” drop-down in the WordPress post editor.\n\nUse a Reasonable Number of Categories\n\nWhile you should assign relevant categories to all your WordPress posts, it’s important not to create too many categories.\n\nWhy?\n\nBecause having a lot of categories can make it hard for search engines to understand what your website is about. It can also make it more difficult for visitors to find the information they’re looking for on your website.\n\nWhen deciding which categories to use on your WordPress website, think about what your website’s core topics are. And which topics you specialize in and want to be known for.\n\nThen, create a category for each topic.\n\nFor most websites, four to five parent categories will be more than enough. You can further categorize your content using subcategories.\n\nOptimize Category Pages\n\nWordPress creates a dedicated page for each of your categories.\n\nSince these pages are indexable by default, they’ll show up in search engine results. Do the following to give category pages a better chance of ranking well:\n\nInclude your target keyword. Aim to rank category pages for specific keywords. And include your target keyword in the category name for added visibility.\nAdd a description. Include a description for each category that makes it clear what the category is about.\nUse an SEO-friendly slug. Add a short, descriptive URL slug for the category. In most cases, this should be the same as the category name for consistency.\n10. Enable Breadcrumbs\n\nBreadcrumbs are navigational elements that make it easy for website visitors to jump to different pages on your website.\n\nThey look like this:\n\nBreadcrumbs can speed up navigation. They encourage visitors to explore different parts of your website. And they’re useful for helping search engines understand and crawl your website.\n\nThe easiest way to add breadcrumb navigation to your WordPress website is by using a plugin.\n\nIf you already use Yoast SEO, you can enable breadcrumbs by going to “Settings” > “Advanced” > “Breadcrumbs.” Scroll down to the “How to insert breadcrumbs in your theme” section and toggle the “Enable breadcrumbs for your theme” option on.\n\n11. Do Keyword Research\n\nKeyword research involves finding the right search terms (or keywords) you should optimize your website content for.\n\nWhen analyzing keywords, pay attention to:\n\nSearch volume: How many searches does the keyword get per month?\nKeyword difficulty: How difficult is it going to be to rank for a specific keyword?\nSearch intent or keyword intent: What’s the reason or purpose behind a keyword search (e.g., are users looking for information, comparing different products, or ready to make a purchase)?\n\nHere are three ways to find relevant keywords for your WordPress website:\n\nUse the Keyword Magic Tool\n\nSemrush’s Keyword Magic Tool can generate thousands of keyword suggestions based on a single initial keyword. \n\nHere’s how to use it:\n\nEnter a seed keyword. You can also input your domain (for a personalized keyword difficulty score) and your target location. Click “Search.”\n\nThe tool will generate a list of related keywords.\n\nYou can filter the keywords by search volume (“Volume”), keyword difficulty (“KD%”), search intent (“Intent”), and more. \n\nThere’s also the option to filter keywords based on Personal Keyword Difficulty (“PKD%”)—an AI-powered estimate of how difficult it would be for your website to rank for a specific keyword.\n\nExport your list to an Excel or CSV file by clicking the “Export” button.\n\nPerform Keyword Research\n\nwith the Keyword Magic Tool\n\nTry for Free →\nAnalyze Competitors’ Keywords\n\nAnalyzing your competitors’ keyword rankings is another great way to uncover valuable keyword ideas.\n\nHere’s how to do it with Semrush’s Organic Research tool:\n\nType in a competitor’s domain, choose your target location, and hit “Search.”\n\nThe tool will generate a detailed report on your competitor’s keyword rankings.\n\nIn the “Overview” tab, you’ll see the total number of keywords the competing domain ranks for. And the total traffic it generates from organic search.\n\nTo see a list of all the keywords your market rival ranks for, navigate to the “Positions” tab.\n\nHere you can see all their keyword rankings. Along with the search volume, total amount of traffic generated, and difficulty for each keyword.\n\nYou can filter the keywords by volume, intent, difficulty, and more using the drop-down filters.\n\nOnce you’re happy with the list, add the keywords to a list in Semrush using the “+ Add to keyword list” button. Or click “Export” to send them to an Excel or CSV file.\n\nAnalyze Competitors’ SEO Results\n\nwith the Organic Research Tool\n\nTry for Free →\nPerform Keyword Gap Analysis\n\nA keyword gap analysis involves analyzing the keyword rankings of competing domains to uncover keywords multiple competitors rank for but you don’t.\n\nHere’s how to do this competitive analysis using Semrush’s Keyword Gap:\n\nEnter your domain and up to four competing domains. Click “Compare.”\n\nThe tool will analyze the keyword rankings of all the domains, presenting you with a report containing the following types of keywords:\n\nShared: Keywords all the domains have in common\nMissing: Keywords all competing domains rank for, but yours doesn’t\nWeak: Keywords your domain ranks lower for compared to all competing domains\nStrong: Keywords your domain has higher rankings for compared to all competing domains\nUntapped: Keywords your domain doesn’t rank for, but at least one competing domain does\nUnique: Related keywords that none of the domains (including yours) rank for\n\nFrom here, click on the “Untapped” tab. This will provide you with the biggest list of keywords that you should likely aim to rank for.\n\nYou can filter the keywords further by position, search volume, intent, keyword difficulty, and more. This way:\n\nWhen you’ve narrowed down the list to your liking, click “+ Add to keyword list” or the “Export” button.\n\nOnce you’ve created a keyword list using any of the above three methods, start creating new posts, pages, and categories targeting specific keywords. \n\nOr add relevant keywords to existing content on your site as secondary keywords.\n\nCompare Your Rankings with Competitors’\n\nwith the Keyword Gap Tool\n\nTry for Free →\n12. Create Great Content\n\nYou can optimize various technical details of your WordPress website, improve navigation, and perform keyword research. But none of this will help you rank if your content is of poor quality to begin with.\n\nHere’s how to ensure that you create quality content for your site:\n\nMeet Search Intent\n\nTo rank, the most important thing your content needs to do is answer the searcher’s query. And help them solve the problem they’re dealing with.\n\nWhen it comes to online searches, there are four main types of intent:\n\nNavigational: Typed in by searchers looking for a specific website or page \nInformational: To find information about a particular topic \nCommercial: When researching before buying a product or service \nTransactional: Used by searchers who are ready to make a purchase \n\nBut how do you recognize the search intent behind a keyword?\n\nSometimes, as in the examples above, the intent is fairly obvious.\n\nOther times, you’ll need to analyze the top-ranking pages in the search results to understand what search intent they’re optimized for. Google must rank them higher because it likely considers their content to address the user’s search query effectively.\n\nThe easiest way to identify search intent is with Semrush’s Keyword Overview. \n\nType your keyword into the tool and hit “Search.”\n\nThe tool will generate a detailed report on your keyword. Showing you its search intent and other useful data.\n\nCollect Keyword Metrics\n\nwith the Keyword Overview Tool\n\nTry for Free →\nProvide Reliable Information\n\nOnce you understand search intent, your next step is to provide reliable, high-quality information on the topic.\n\nDo extensive research on the topic before you even start writing. Here’s how:\n\nRead through relevant online articles and blog posts \nListen to podcasts related to the topic\nWatch videos or online courses\nRead what people are saying about the subject on platforms like Reddit and Quora\nReach out to industry experts and ask for their opinion\n\nCompile all your research, extract the most valuable insights, and turn them into an engaging and valuable piece of content. \n\nBack up all your claims with relevant links to reliable research and studies. And remember to cite all your sources.\n\nFinally, make sure all your information is accurate and up to date. \n\nGoogle wants to reward quality content that shows topical expertise (E-E-A-T content) with higher search rankings. \n\nOptimize for Readers\n\nOptimize content for your audience to provide a great reading experience.\n\nHere are a few ways to achieve this:\n\nUse simple language. Avoid jargon and complex expressions. Instead, write in simple language that everyone can understand.\nMake it easy to read. Don’t make your content look like a wall of text. Take advantage of white space. And use lists and tables to break up large chunks of text. \nAdd plenty of examples. Help readers understand the points you’re trying to make by using many examples—make sure they’re relevant to your audience. \nMake it visually appealing. Use images and infographics to demonstrate concepts and enrich your content. Visuals will also make your content easier on the eyes.\n\nTip\n\nUse Semrush’s SEO Writing Assistant to learn more about your content’s readability and get recommendations to improve its SEO ranking potential.\n\n13. Write SEO-Friendly URLs\n\nSEO-friendly URLs help both search engines and users understand what a page is about at a glance.\n\nGoogle offers a helpful resource for understanding how to create SEO-friendly URLs.\n\nIn short, here’s what you should do:\n\nKeep your URLs simple, short, and descriptive\nUse your target keyword as the URL slug (the last segment of the URL)\nAvoid non-ASCII characters and underscores\nDon’t include dates or years\n\nTo change a URL slug in WordPress, open the page or post in the built-in editor and click the URL field.\n\nEnter your desired URL slug in the input field and click “x.”\n\n14. Use Headings Correctly\n\nHeadings serve to structure your content and make it easier to read and navigate. Like this:\n\nIt’s important to add heading tags (HTML tags that indicate headings and subheadings on a page) in a hierarchical order. So your content follows a logical, easy-to-understand structure.\n\nThe H1 heading goes first, followed by the H2 heading, then the H3 heading, and so on.\n\nKeep in mind that every page should only have one H1 heading tag. But you can add multiple lower-level ones (H2, H3, H4, etc.).\n\nAim to include relevant keywords in your heading tags. \n\nFor example, make sure to use your primary keyword in the H1 heading. You can also add it to one or more lower-level headings, along with primary keyword variations and secondary keywords.\n\nDon’t overdo it—the point isn’t to stuff keywords in your headings.\n\nYour goal? \n\nInclude a few keywords throughout your headings to show search engines and users what your page is about.\n\nTo add headings in WordPress, type “/” in the post editor and select the “Heading” option.\n\nChoose the heading level you need (e.g., H2, H3, etc.) by clicking on the H2 icon.\n\n15. Write Optimized Title Tags\n\nThe title tag tells Google how you want your page title to appear in search results.\n\nTitle tags are important for two main reasons:\n\nThey signal to Google that your page is relevant for a specific query\nThey’re the first thing users notice about your page in search results, so they have the power to entice users to click (or not)\n\nIf you use Yoast SEO, you can change a post’s title tag by scrolling down to the “SEO title” section in the post editor.\n\nBy default, Yoast SEO will generate a title tag for your post—using the template outlined in the “SEO title” section under “Settings” > “Content types” > “Posts.”\n\nYou can modify this template to your liking. Or modify title tags for individual posts in the WordPress editor. \n\nFollow these tips to create optimized title tags for your pages:\n\nMake it descriptive: Your title tag needs to make it clear what your page is about\nKeep it under 70 characters: Title tags that are longer than 70 characters might appear truncated in search results, so make sure to limit your title tags to 70 characters or less\nInclude your primary keyword: Always include your primary keyword in the title tag, ideally at the very beginning of the tag\n16. Craft Unique Meta Descriptions\n\nThe meta description can appear below the page title on SERPs and provides information about your page.\n\nWhile meta descriptions aren’t a Google ranking factor, they can direct users to click on your page in the search results—driving traffic to your site and indirectly boosting your page rankings. \n\nSo, put in the effort to write attractive and relevant meta descriptions with your target audience in mind.\n\nHere are a few tips:\n\nKeep it under 160 characters. As with title tags, meta descriptions can also appear truncated in search results. Keep them within the character limit to reduce the chances of this happening.\nUse action verbs. Use action verbs like “build,” “discover,” and “achieve” to engage users and encourage them to click your page listing\nAdd a call to action. Include a call to action (CTA), such as “read our guide to learn more” or “buy now,” to entice users to take action\n\nYoast SEO makes it easy to modify the meta description for a post or page. \n\nScroll down to the “Meta description” section in the editor and enter your description. Yoast will warn you if it’s too long.\n\nTip\n\nUse Semrush’s On Page SEO Checker to get recommendations to optimize your content’s title, meta description, and other on-page SEO elements.\n\n17. Link Internally\n\nInternal links are links pointing from one page to another on the same website. They’re useful for both search engines and users.\n\nSearch engines use internal links to discover new pages and understand the relationships between different pages on your site. Internal links also help pass link authority.\n\nUsers find internal links helpful because they can find relevant content on your site more easily.\n\nFollow these tips for effective internal linking:\n\nFocus on your most important pages. While each page should include links to other relevant pages, the focus of your internal linking strategy should be to build internal links to your most important pages. This will likely be your homepage and your top product or service pages.\nUse relevant anchor text. The clickable part of a link (or anchor text) should be descriptive and relevant to the page it links to.\nConsider the context. Include most of your internal links within the main content of a page (as opposed to the header or footer)—and only where they make sense. Don’t add internal links just for the sake of it—they must be helpful and relevant.\nCreate Internal Links\n\nTo create an internal link in WordPress, highlight a word, phrase, or sentence in the page or post editor, and then click the link icon.\n\nPaste in the URL you’d like to link to in the box that pops up. Hit “Enter.”\n\nAudit Your Internal Links\n\nCheck your website for broken internal links and other linking issues with Semrush’s Site Audit tool. \n\nHere’s how:\n\nType in your domain and hit the “Start Audit” button.\n\nThe tool lets you customize a number of settings for the audit. Including how many pages to audit, and which user agent to use when crawling your website. \n\nFor our example, we’ll go with the default settings. \n\nClick “Start Site Audit” next.\n\nThe tool will audit your website and provide a detailed report. Click “View details” under “Internal Linking” in the “Thematic Reports” section.\n\nHere, you’ll be able to see all internal linking issues on your website.\n\nClick the “x issues” button next to a specific issue to see all the pages containing that issue. Or click “Why and how to fix it” to learn more about each issue.\n\nFind and Fix Website Issues\n\nwith the Site Audit Tool\n\nSign Up Now →\n18. Write Descriptive Image Alt Text\n\nImage alt text (or alt tags) helps search engines understand what an image is about.\n\nScreen reader software uses it to guide visually impaired users around desktop and mobile devices.\n\nBy adding alt text to images, you help both search engines and users understand what those images contain.\n\nTo add alt text to an image in WordPress, select the image in the editor. Type in the alt text into the “Alternative text” box on the right-hand side of the screen.\n\nWhen writing your alt text, simply describe the image. Only if relevant, include a keyword to increase the chances of your image ranking in Google’s image search results.\n\nTo check your website images for missing alt text, use Site Audit. \n\nVisit the “Issues” tab of the Site Audit report. Type “alt attributes” into the search box.\n\nThe tool will then show you how many of your images don’t have alt text.\n\nClick the highlighted part of the issue to see a list of pages where you can find these images. Like this one:\n\nEdit these pages in WordPress to add the missing alt text.\n\n19. Approve Comments Manually\n\nYou should approve comments on your WordPress posts manually to avoid getting spammed.\n\nIn the early days of SEO, commenting on other people’s blogs was a popular way to build links. Which led to the creation of software to automate the process.\n\nNote\n\nLink building involves getting other websites to create backlinks to your site. To show search engines that your website has relevance and authority on a specific topic.\n\nUnfortunately, this resulted in spam comments overtaking the comment sections of most blogs.\n\nIn an attempt to address the issue, WordPress made all links in comments “nofollow” by default—which means these links no longer carry any link equity. That makes them much less valuable for SEO purposes.\n\nHowever, some people still use software that automates blog commenting. Which puts your WordPress website at risk of comment spam.\n\nTo prevent getting overwhelmed with spam comments, enable WP’s “Comment must be manually approved” option under “Settings” > “Discussion.”\n\n20. Speed Up Your Website\n\nGoogle prioritizes fast websites for both desktop and mobile searches. In fact, it’s a confirmed ranking factor.\n\nIt’s easy to understand why.\n\nFast websites provide a better user experience and allow you to find the information you’re looking for faster.\n\nFollow these tips to speed up your WordPress website.\n\nUpgrade Your Web Hosting\n\nThe web hosting provider you use and the hosting plan you choose have a big impact on your website’s page speed.\n\nMake sure to go for a reputable web hosting provider. Ideally, it should either offer a dedicated WordPress hosting plan or specialize in hosting WordPress websites.\n\nWhen it comes to your hosting plan, try to avoid shared hosting—where the same server hosts multiple websites. And you can’t really choose which other websites will be on the server alongside yours.\n\nThe main issue with shared hosting is you might end up on a server with resource-intensive websites. Which can result in reduced performance for your site.\n\nIf your budget allows for it, opt for dedicated hosting. Your website will get its own dedicated server for optimal performance.\n\nUse a CDN\n\nA content delivery network (CDN) can speed up your website by serving your website content from servers that are physically the closest to a visitor’s location.\n\nWhich can result in a significant improvement in page load speed.\n\nSome popular CDN providers include Cloudflare, KeyCDN, and Fastly.\n\nInstall a Caching Plugin\n\nCaching is the process of preloading website files so you can access them quickly the next time.\n\nThree commonly used types of caching are:\n\nPage caching: Involves storing fully rendered versions of webpages on the website’s server so they load faster when the user’s browser requests them\nBrowser caching: Stores a website’s assets in the user’s browser locally, which helps the website load faster on subsequent visits\nObject caching: Reduces the number of database requests needed to load a website by caching commonly used files, such as theme and plugin files\n\nYou can set up caching for your WordPress website fairly easily with plugins like W3 Total Cache and WP Super Cache.\n\nMinify HTML, JavaScript, and CSS files\n\nMinification involves reducing the size of HTML, JavaScript, and CSS files by removing line breaks, comments, and unnecessary white space.\n\nBy making these files smaller, you help them load faster. Which leads to a faster website.\n\nYou can use the following tools to minify your website files:\n\nMinifier\nMinify JS Online\nToptal JavaScript Minifier & Compressor\n\nOr install WordPress plugins like Autoptimize or Fast Velocity Minify.\n\nOptimize images\n\nHaving a lot of high-definition images can slow down your website considerably. While you shouldn’t avoid using images on your website, you should optimize them for performance.\n\nHere are a few things you can do:\n\nCompress images. Images can contain unnecessary bits of data you can remove to reduce file size with no negative impact on quality. You can compress images using online platforms like Kraken.io or WP plugins like Smush.\nOpt for web-friendly formats. While JPEG and PNG are very popular image formats, consider switching to more performance-friendly formats like WebP. These offer superior compression with minimal loss in image quality.\nUse lazy loading. You can improve page load speed further by using lazy loading—a technique that involves delaying image loading until it’s absolutely needed.\n21. Mark Up Your Pages with Schema\n\nSchema markup (or structured data) is a type of code that helps search engines understand the content on a webpage.\n\nAdding schema markup to your WordPress website will make it eligible for “rich results.”\n\nNote\n\nRich results are a type of Google search result that aims to be more engaging by including information such as ratings, reviews, and images.\n\nThe easiest way to add schema markup in WordPress is through a plugin like Yoast SEO. It will automatically add structured data to your website, but you can change the schema type on individual pages or posts in the WP editor.\n\nClick on the “Schema” tab, then use the “Page type” and “Article type” drop-downs to select the right schema type.\n\n22. Secure Your WordPress Website\n\nNot securing your WordPress website properly can make it susceptible to cyber attacks. And result in your website hosting various types of malware.\n\nSearch engines and web browsers may in turn flag it as a dangerous and spammy website.\n\nThis will obviously negatively impact your website’s ability to rank in search results. And even if it does rank, users will be wary of visiting it after seeing a warning like this:\n\nHere’s what you can do to protect your website.\n\nUse a Security Plugin\n\nThere are a number of WordPress security plugins you can use to make your website less vulnerable to security threats. They include features like:\n\nSecurity requirements for user credentials: Prevent users from creating accounts using weak, easy-to-guess passwords\nTwo-factor authentication: A security process that requires users to verify their identity using two factors (e.g., a password and an SMS code)\nBrute force protection: Prevents malicious actors from hacking your website using brute force attacks—a hacking method that relies on trial-and-error to guess passwords or encryption keys\nAutomatic vulnerability scans: Scanning your website for vulnerabilities and malware at predefined intervals (e.g., daily, weekly, or monthly)\n\nPopular WordPress security plugins include All-In-One Security, Wordfence Security, and Jetpack.\n\nInstall Trusted Plugins Only\n\nAnother way to protect your website is to only install plugins from the official WordPress plugin directory.\n\nFor any plugin you install, make sure it has a high rating and many positive reviews. And that it’s compatible with your version of WordPress.\n\nAvoid plugins that haven’t received updates in a long time. Outdated plugins can have security vulnerabilities. Or even break your site.\n\nUpdate Regularly\n\nWordPress frequently releases updates. Sometimes, these updates fix security threats.\n\nSo, it’s important to update WordPress regularly. Both the core WordPress CMS and your WordPress theme and plugins.\n\nWordPress makes it easy to stay on top of updates by visiting “Dashboard” > “Updates.” Where you get a list of all available updates.\n\nFrom here, it takes a single click to initiate an update.\n\nUse a Backup Plugin\n\nIn case your site breaks or gets compromised for any reason, have a backup you can use to restore it.\n\nThere are a number of dedicated backup plugins for WordPress that offer features like automated backups, backing up your website to the cloud, and more.\n\nA couple of popular ones you can use are UpdraftPlus and Duplicator.\n\n23. Use ‘Last Updated’ Dates\n\nGoogle favors fresh, regularly updated content.\n\nOnce you update a blog post in WordPress, add a “Last updated” date to show both search engines and users that the content update is recent.\n\nYou can do this by manually changing the publication date in the WordPress post editor. Simply hit the “Publish” field in the right-hand menu to choose a date and time.\n\nYou can also install a plugin like WP Last Modified Info, which will automatically add a “Last modified” date to your posts.\n\nIs WordPress Good for SEO?\n\nYes, WordPress is good for SEO. Out of the box, the platform offers a nice set of SEO-friendly features, including:\n\nCustom titles and meta descriptions\nCustom URL structure\nImage alt text\n\nAnd, as already mentioned throughout this guide, there are plenty of plugins you can use to enhance WordPress’s SEO capabilities even further.\n\nYoast SEO, Smush, and Autoptimize can help you implement schema markup, add breadcrumb navigation, optimize your images and coding scripts, and more.\n\nImprove Your WordPress SEO\n\nUse the above 23 tips when doing SEO for WordPress to give your site the best chance of ranking among the top search engine results listings.\n\nAnd take advantage of Semrush tools like Site Audit to regularly check your website for SEO issues that might be holding you back from hitting higher SERP rankings.\n\nAccess 55+ Tools\n\nwith a Free Semrush Account\n\nSign Up Now →",
  "headers": {
    "h1": "The Ultimate Guide to WordPress SEO",
    "h2": [
      "What Is SEO?",
      "Why Is SEO Important?",
      "What Is the Relationship Between WordPress and SEO?",
      "23 Top WordPress SEO Tips for 2024",
      "Is WordPress Good for SEO?",
      "Improve Your WordPress SEO"
    ]
  },
  "images": [
    {
      "src": "https://static.semrush.com/blog/uploads/media/7b/8c/7b8c9ece7995993780cf69349d5f9ee5/wordpress-seo.svg",
      "alt": "Wordpress SEO"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/6c/61/6c61befb938a01cbef14aabaf70c0148/ab930f4b1ab35de2d4e84ea7f0b54900/AD_4nXc0HHKfnKTsQty-ErN-jxU594XVbQDod7l3y-Jt4NylA8TaCZxbW1NpSZCyYyaqWgYnvuTfTI0cNhAhr5g7tKQyJJVy18GKT7YKyc_xLPeXdctJpDMsNiqpdBPOITq-pE4IOettvU9qPNLh_h8lKZo6cjqc.png",
      "alt": "Arrow from Settings to Reading in WordPress admin menu with \"Search engine visibility\" setting highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/d5/fa/d5fa244284bb0a66bf4155a369c117af/ce8cb377a4081b8f9e23443b22e71050/AD_4nXedLSwiva4jyYdZ_MJruVgX0EYurm8ypZ41ILWZF3rjY3yLs8vsGPOnzGpj6HMaEaQxks4ROkU5gD1GWlBCx5BxOpkOf2bwm0VE2F72dv8ScR5XwgJRGNfCVMZ7_iaPQeh0wzG6DL-JkXIeS8o9ByjlR0B3.png",
      "alt": "\"Your connection is not private\" error page in Google Chrome"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/df/36/df360e0099f64bc74ea0a7901695c372/bf3ce3a2f38c0983c404500b51a723e5/AD_4nXfTnsMzB3yAo__9yms1VHpsMW7STYrMZMmnCjX_hcK5PpUmSzy3IUwPmoaWldOHcfcvxF2XfcR33zDdgwm6uDnMmrsAYn0-mvTdOPMxrVgSMXVehTPyQgtbXr2fyMnWph6suucvSxk1bkfQFb7A5h0i2Ifh.png",
      "alt": "Arrow pointing from Plugins to Add New Plugin menu item in WordPress admin navigation"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/25/08/250812820183dc6d5db16c293397c101/56391a4cf7a59b61ca742e506f1a662e/AD_4nXcbY40dXxD7HC7cba4pGqzlhOG1EfDeNkSUBBVhEspoH00bWlNH8aywYItYCZUP3OeTuviCmdv2hBAK7NJ7uV9_YQdQ8qTwRdFszRVrlhOdcL-jyeykHzvczTVSumyp-ftMdeamEWD-I6ChGrEoyYLlelb7.png",
      "alt": "Add Plugins page with 'Really Simple SSL' in search bar and 'Install Now' button highlighted in plugin results"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/8f/e2/8fe2882bfc0f681b1969a5ebd6417da1/34e362d8fbe7c4d3345d621862d3899c/AD_4nXcy89199SJ5MMBmd-pxtK0g-zpvqAo5yFEDLNkFKpjhZqGsZwd0qa-m_0o9dKNgPGFjyaruqHG0wAWo1DRMvmMDvlYBH04eMGzE4xDMjtPupkl1hMN7URJIqiWcJVbS_g_lSG1df443nbSCdCP5BzM56NSI.png",
      "alt": "Really Simple SSL & Security popup with Hosting provider dropdown and Activate SSL button highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/fc/b8/fcb8a6c235810b47947e7b2666b3f4e8/c399f0ee552f0d6f958fafcf620c7123/AD_4nXe6UKyh4-TYBMUVF4jcqTy0ib-pQHoVbcCP0-LyIWCm8Tu3WWzwFU8K1_HUXkv97MsZl3rXDJ59OAm_jPp_sw5VfyNEq0r7LPqmlyZm1qWbPP7_ENTjB3cVN4PEf5Ju-WZAVZrqNeOoDe5HV0FuBCA3ix8f.png",
      "alt": "General sub menu item and WordPress Address and Site Address input fields highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/45/73/4573d1adaa2ce929ed1f91b944d22878/308febe308f803bcfc41a4ed7f096708/AD_4nXep3BBE2GYe40hR4ReHeTznFSpvvmuHHDolN77-ztRxyWGolvKnXNrVgxbbSeuRiKRtBGaFPg3eC7EPebnhO0u6XBtEYCHB6DLLFrR0EGzno4P1GYNNq92oai5NCeBwgkhRDZzF6e9F_0-6z6LtWufHr9cw.png",
      "alt": "Arrow from Settings to Permalinks in WordPress admin navigation with \"Post name\" structure option highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/61/1f/611fd907b6dcb6c0aeefa3abb284ccc4/21a78b6fedf973032c6af2e8a8b43ebb/AD_4nXeC5mdvgd_G4AWrtMuGngWequS9IRRYYYQbCE8N5xZ0VZgtNpqOhfI7K4cxSILX114GDMN2fOEcL_h678K6vu-9iUhsxm3geEEjabSQPPCdi2dTDZSuE52AqRzMcJOOz3tuZ7_DhddoynYC1CD42MoQsc8.png",
      "alt": "Add Plugins page with 'Yoast SEO' in search bar and Install Now button highlighted in plugin results"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/d0/b8/d0b81feccc621eb98a5ef51439da9783/f1a502caed7b65cb499e526f738f1820/AD_4nXeYYTlw6dcp02GirzQ7mpx6pMWxGk-heeMSejubN7Av6oNnxYr4dx6MZM1t09yKDr_HXqdtMzSLgBc6da2WqE41gwNCF0AmY9K2zWIzb2wMVFJ_VYVcnZ-3wrTeFNYGxea9aNm7gkdP5bC7eGGlUdov7SMw.png",
      "alt": "Arrow pointing to 'Start first-time configuration' button for Yoast SEO"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/76/22/7622ff2af2b759d182120f1095dfa83f/60797330788e2ccbc062aafc36a5c78a/AD_4nXcrKxLTMDt-IUrb6nguJ2nYnVDrkiADyYNTeDd5lvcr9eQ0q9gQmMtiNAi0nrthDMmDuptynf8PlOkRFiIjayB-3WAPX61f8x2d9-h_cGEejCeeA0kQQ4SrucAyggEe75g5tj7OqXaKCjQzafLPvZ_kr91m.png",
      "alt": "Yoast configuration page, with the 'Start SEO data optimization' button highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/c1/72/c172cd6424281563e6ef5c69c8c837b8/a5f9b6c181c43a9fddd4d73e01b75c4e/AD_4nXcd_y9srxIfCRuxvWLmvNJUZxX4r5fRslHSRJvX027KIAmRB0xHJ2d5dNT-9AVsSs7JpWsKS-CAxJxRBvSjjxHsQ812CmHJSqttn5FFv9WO98iuENooC1G0dOLZfGjUGXf9l5R6O6o7wlrk-rTuxnz9p3E.png",
      "alt": "Yoast configuration page, with social profile URLs entered and 'Save and continue' button highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/8f/50/8f50b65beb94039ce7c51edcbf2bf858/9e67200884112a325a1a053f71aeaea7/AD_4nXfKgfG1NEFyf6tsDqCg6yCkS2hYvaEVpHCjWIdp7raFI3i2tRKqqPBPjAdbks3v2zEWiG5o1wbkQUFX82kP_p-BZlMXDH0UbzDwSPJ4Ga3pVFYMKtE0bCtGMBf1IdLaUm6v61Ro6ZVxUo5jOHtSFwRO6uFQ.png",
      "alt": "Yoast SEO Settings page in WordPress with arrow pointing from 'Content types' to 'Posts' sub-menu item"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/fb/01/fb0193f786c5a8713f97886de46a2590/4782d7e6f68c19f29cc18d84267b7d5c/AD_4nXd98WaI6T378qEAmgu6vzhZQTIJAhvpeLUntn3vYddPt3L7Pl5VzMhcwsgoN44gzsZneRhW8hf8qfySpwQOFTQTIfTrnKo-7m12bCJj5nw3M0Ee1rTkLrDn7Vx-G9sV0DLkgw152_prBefPxY-sLaSpO2FE.png",
      "alt": "Yoast SEO 'Posts' settings page with SEO title and meta description configuration areas highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/5f/a1/5fa1519ed421e0baee4fc49aa4f1815b/21e7eb960ee26b646fc05cb2e65e21e2/AD_4nXcnTG8Ra2tAnK2QfBHYHMolzrL31ELwkQSjbqsFE2Uv6F3CoH5XAXUKlkkjRPiAXJ9c52K8LxQe0_MZxcES_u2QZDJjhurdp867mzp1P1uqZwOnZeaX57pJu9dw00Ac4-XkPWhlwRFpdvGY3rBrc7uV7M5M.png",
      "alt": "Yoast SEO section with the focus keyphrase, title, URL slug, and meta description fields highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/46/49/4649cd19ca53547928ef9b111c3f8076/ff67a29d81c59215bec40bf43d5e89e3/AD_4nXdMLWL8tVbuRPYTg1ZaClGn4bsM2FQmqNQSjJmT0WrJvgtLclVhL5ieEhoz9QshquXT9EgpLqDZPjvjF-9pnP26Z36ZB086m-uM1ZCky7gmd5SCBsXAw3MVQV3PJ99qWDtAZn9YkULgwi6ZqkroFnroKlsf.png",
      "alt": "Left-hand menu in Google Search Console, with the “Sitemaps” menu item highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/dd/da/ddda9a6f04fc3970296ec9960414ddcc/1a7f1b02fcfce204b486ac2cb5eb51e5/AD_4nXd62VdIJwRubk1HRE0RMIHQ6sOw3YlhcW6vYItdrXdkDCaUhAWFreyOcvQkwsG2bkNG09Cv2_iMYtEF0xAu6-_RR4V6C7Gw-VZq-1D4Nv1ySSTeKBRiN1bU3JPsiZn66IMWE-UlwuZaXuTJHC6KX9zi7w82.png",
      "alt": "“Categories” page in Yoast, with the “Show categories in search results” option highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/42/52/4252348fcff8287683756893f590e242/a65954fc1ae38f48ec35224e71641ab6/AD_4nXc_IK-Am4VyaA5aXEsRcscW10R_3lwyqckbbhUJDQ7Fc7fPyhOoTyExzVPjiKvwTs1vIccCgl3QHpsXJ8UEE_8YKuCEY5vPd40tRaI3EDhYsDtgmVQdkU9rPh-5_7kwC8I0_JHi2PHwM2b82zp44qYG5_S9.png",
      "alt": "Top-level menu on the Semrush.com homepage"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/11/3d/113df2aac90242405fe59fef46ee3795/3ca8fa6ac591d9dd7e3fc4d605f62a1f/AD_4nXd_JlP09D1cU8qGqdKauZdVOWUtGUHKtk8whOumS-H-OoW86PBrGlqLRPf5sqENix9MO6aEr87NiTPYKvvA5rbRt-4xU-rRoDIBrqGwm1Pk119Me010hDcxZmWgykSXpi2fovV-FMM26v0LJ4nFUPYGPN8.png",
      "alt": "Infographic showing website architecture example with home, category, subcategory, and subcategory pages"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/6b/c3/6bc35a33e993c8435483823c4ba73300/0e0965844465f154741af06d9ef5f24a/AD_4nXdvu5c1yrLtJZkNTUJ2jdCGKBYsNlmJNoZoQmzFuHB1wvvvYX6V5EkdBaIOusqc2FbCBcx033LgAjBPdrVj5iqZV5w5R09VvfY7mTbCkfIKOg4b_eettSeO9LozBuQFoUlmgKRA9qpa6kQxMAZrDLBtG4g.png",
      "alt": "Disorganized site architecture infographic"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/71/4d/714d04ff7df4012765fa2f8398d2e69d/732bdfb71187e070190824957b18b7c9/AD_4nXcaWG9kpwEC2w2JI-9HTB4l0PTwtctHyASI-76jPas22B24tp4fRJPEIDE9LHZrvDaO80uAn6qr_-TQx8hXmKB6dXF72T9M52VcC4DY4w10_GUF75pB7JV_kEhFZOaEAYROb9Ovh-U9512mmpuDJvpqGheW.png",
      "alt": "Topic cluster example with 'Disney World Planning' in the middle and arrows pointing to and from other cluster pages"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/b7/13/b713d40d076caa265398dee6a63aaed3/ccd0b50cd9974263c72e5d02860d9dac/AD_4nXdfRQTF0U2bF4PuQz1xxZektlte7n_eNzXWQYjDrfJYqx60mmztr28lmf8rEcjGzZE4sR3ljErlBHXkoHSM8yUk8eTe096fx9MFwySJZZeG5Ae70nQhmWAEf8UYcRC7IGf8HYmQ69JEKjuVvY4oGsNVrcbB.png",
      "alt": "Infographic showing orphan pages without any internal links pointing to the pages"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/bd/55/bd5500f0d47cf2552dc67f8992fbb3ff/f338577684d1afbc893d74c62d7ab039/AD_4nXcT7mvWShf_ZXu1A_VK0ljLIWlnaEMG4PZaC8cWlIWbE27vaahCF70hmb-l9xzrw67erm-pSTLl-iH2kKevqbuPTJP0bV-zJyBJjz-R-AIKcokrXOr8OIZhvYOiCyM-KR7zzUkRxWkEFVR4lG_H-1Zp1rhA.png",
      "alt": "New category creation screen in WordPress, with arrow pointing from Posts to Categories in sidebar menu"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/8d/9d/8d9dc8f35fb43f8ce330ee19c6e7c8c1/e19884fd944167deb6421a8a801f2e12/AD_4nXdUMGTgrOu-z_uNKj4AecLF06wTTRn3zOfglcbBmiLqceZIV2h_wcecy13zdlXAMcPkhiERQt3EI2xeZTW6pczxFJZN4najWMlHK-7eHFeRYb4sbBC_ptwOeztHTlpZcVgM8LeEjw43BwSexyp06eAbFy9p.png",
      "alt": "Categories drop-down in the WordPress post editor"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/84/7b/847bd7742d3075a8fb2bcfb04fe49a08/f6f90b9522bd16f61f8374b4b4db928b/AD_4nXeQVW-AoluM-juOMZ6E-5iNLe1XgWxlgTcNfR_7MNgO2EDEpAilECCCfgQ39Azo378EcYyHd7xcVl6LlUPsowv_Z9U2HaUK3xYA1SwXjjgi4cHQwQBqOKtEjVs_qNeJIB58pwViNcjjZRMNFuaLmQl6D6w.png",
      "alt": "Nordstrom website page with site breadcrumbs highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/41/1d/411db94b7c9095eba80e1bb500722d48/7a4b588c00a97240e1619c42cb4a3615/AD_4nXcVuk2TwFZ9SzfDO6kI15yADf7KwGqXRRvn0CJNIvLWMYVaNBqy0u7QsKnxhMDpo38ZHapQkqxiPfoE_Tn_-ZrgtII-TM3TRWbRanXoldRfR3qa2lRgE3riRxxg08x8HUMeTdAsX-5NiHCHJhe81U8xVAc.png",
      "alt": "Breadcrumbs settings page in Yoast SEO, with the “Enable breadcrumbs for your theme” option highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/fd/a1/fda1b350da0a0da100aa566b240d3536/8e294ce77f7d6b6b7c1af0bc5a1be319/AD_4nXdy0YwfHne5VFGtjtEThujl596cvJqzNIHmlL5AMPdYPld5hkZkIK63o7mqe7Z8DXPcr01HjWT7VLMqzOiLFEga74sms-X9Eb906w9uwSB9B3WDSqbi8rsdGa14s9Dps5sirCODl9Vwmcfnrq-alTTsjJ2g.png",
      "alt": "Semrush Keyword Magic Tool start page with keyword and domain entered and Search button highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/7e/79/7e79f2b46801478741f691dbb584a197/6c85ed1abc74dc81ac3499f1384f0e3a/AD_4nXeyEXkECah6nSA6PoyGDj1clMjZn9Ln52bvsTYTtCJDlB_-ywi3_EjP8Y0n72fto__8m-yKEchO06nvlg5ov_CN_ucCHgn-qbDanqM1MVcDEKvNHeHGAy5Qe4fAJ_5uU9CKUgqRpQdtYIWJbR6lbFfBEv7x.png",
      "alt": "Semrush Keyword Magic Tool results with filter options and 'Export' button highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ff/d1/ffd1ee5036d3d75aa79a73320354b288/7d39b70483b87f98dee270de425cc3f4/AD_4nXf28zhyP0B2oEHZ-zQk4odCql9YJs8WtM1K-h_lrd-TzBf1qgDJylSMNhN3oxyBgdCXZ8Ici_T0wFNnJLMQUrmQaUICLKB5LiZoloog4xCWGlrU4u7WXnYAtHkmE3ueRMRrN4nf_vogqCD5pAMPnW6uTg89.png",
      "alt": "Semrush Organic Research tool start with domain entered and Search button highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/5e/ae/5eae24fb50d840e3d09d55eccfa69fe5/f2d46568950a80450372c315b0ae3c20/AD_4nXfvPoNkomskSLO4nmii4a1QLt4rlorp3SJsMZs20GUn-eoHrt1GhBM7FpZ9DWtywR3-g5wWGwntBUJiPyvUkaya05hpKjv-GfWFYQKfPNBNPkcFdTsDEncyDWKKyVI4PK5kenH-_Rg-XGP7ky0B9KGGre_-.png",
      "alt": "Organic Research overview report with Keywords and Traffic sections highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/f7/80/f7809bae341733c13ca7aee91f370192/257da3dbf6ce6718d6587ed12a4df88b/AD_4nXdKKx7iwAZS3MScA0XIl-xbpIWuMg6LZwL1BcJtgR4J_Ysx7iNmn6Izm2lV_l7hS5qsxsavACUEt9Cxu7ekzT_ZWmb-gTHkJlefWKIVBWtaHdJyALcuGmw-rXjc7Xjkpxn7iZnjJdVX72_DqQDPYPytZBwy.png",
      "alt": "Positions tab selected and Traffic, Volume, and KD% columns highlighted in Organic Search Positions table"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/de/ba/deba6bc954a3ce54d15641dd7be211d5/f396dcdc2ca0b2b68e619d35653a285b/AD_4nXfaujF41kvQWPdtJcO_jAe0tgFnjmp2sY4WmsKpa4CINyPooZ0aJagIhWJBbpVMsr_rUOt6ELlDTOm_8xI_vy528MiWEfsfsgjwtBiHe7nW0Z37kIv4GMMPIL4ujO_biUq7s_qg7JVaquDPxOvB23ZSbFCd.png",
      "alt": "Positions tab filter options and Add to keyword list and Export buttons highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/78/4d/784de020d19e12f631e1b03fef46c850/94955d6964962b2e7d848a6cf9f93985/AD_4nXe5TM3p4N-NcceBsHLqYHdIJ8tgh5vPk1hI9f0AGnYXIf4cmKg5J93IPaCV1_jRC9uNQMcgbqH6-fReJympRKIdHjIXUSD1G-iIVSSHwP8YKy2Ab8QHSM3w9d_XOMyL_ygSIiOB4cl7mileTDvEDuxGOiD6.png",
      "alt": "Semrush Keyword Gap tool start with five domains entered and 'Compare' button highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/df/92/df920a7c62fd3228ea6c77e9b94d93dc/fe0fa5ddf83805a057ee3e3a3bce8333/AD_4nXc8g_IO2ZwOBuILkbX3U6B4ebV2doTpSEb97_pae-HMkAknA6pa2kc2oe_2NlYp6DbHptMVSVJzVmD48tiHdLVFWNSvYkSABq3EcGStwBVvQagKa3Sude4Awe3Mne6rFMj3ijJq05CcTvOms0vqXIx4lx9o.png",
      "alt": "Keyword Gap filter options highlighted in the \"Untapped\" keywords tab"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ff/7e/ff7e3761a874a0bf426bb61637055a7d/b704e34751ecc0e3383b1edb731a9b32/AD_4nXc7PzyylH4Ek7vMwCf2v134iDGtP7EaEx6JFntuYHCNx7ZEM8vAdPKesMYQReg4nah0usTTIfsRZvTFVvDS6ujMxUIQMthS-Xgn7GF5kLAkHgXN4VXPVUiuFMpQk15RCP4PKz7ygSkV5Et2yugpGbSiRH4.png",
      "alt": "Infographic showing the four types of search intent with examples"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/57/e7/57e7847b51e0c68c509460d34117a51d/ef30728d9be27d743dafcfedda75c5e8/AD_4nXdFL67uxsd7ahk-ihmde83AFDRK-KNDR1RcRawBeUCrzepI-MHxZWI2CL9GWAfG3PXLZonIHyFtqn3MKi_Y_P9zrqiHVVsJkimyNVDydEIoPoTNxRehvmSLjAdbBlIDjlySy4tUxVTc4XQy3zh-ZJ_XFno.png",
      "alt": "Semrush Keyword Overview tool start with keyword and domain entered and 'Search' button highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/b3/f0/b3f0cd2d631d38379251d7e8d121e192/2e7c9d866fe63356c6fdbdf3fa57e4db/AD_4nXcyRiMFaNBjWvfEVuuezY9mrAqsTC1UFSNuEhLVTJQOXm67THPVNdITsqk4g_mFCaPo3-kk5JcD2qFCc5r6O0ze7TD32Pokdlaooyu88j3zCy2WixOy9iD0GVHeDgTX79Ppe3CsUH2-fK0lGCbcLEAqUlw.png",
      "alt": "Keyword Overview tool overview report with 'Intent' box highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/07/28/0728ca13a53a924761deb1b080fded31/3fea66090627a362a60ee063634b995f/AD_4nXcA8PSK90JNJvzTZg0dA_XsnKVTLbEnE5GP0vEL7qYassucEvws1Yso0WO8hxpYpWPd2ejMu-pg4zgC1weuNIlriZlzNVoeJk30aCSO38fEVv3Ar0ecab7iW0vKw97ua4odW8vqFnFZjyzCyd6HVOiEJp0h.png",
      "alt": "URL hyperlink in WordPress Post settings clicked and highlighted to reveal URL configuration popup with URL slug highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/f7/64/f764c73bad5fe323833671b921f3305b/7b6a7e2977896c7e1aa7746c8089ae8a/AD_4nXewpZbtLUX0dktGgL2VjTviiqNYEkVvXPTOp2MEbcGgugm0jtO7i1Cy1bFS6gdbF0xtMQKDdbWe4D0xNfAawl585zUkiM2IJKZ1gAwfddMCeD6Tc2rS86K4o_21h_DX-e8rFJ7T-yaHGOTQM3rqeUxWXvIA.png",
      "alt": "Infographic showing heading structure with H1, H2, and H3 headings"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/71/61/7161dcf553149d731b21b5d3215a7282/e42c1a637becf6ed960be6188a629d79/AD_4nXdVbzPwaYanNycLxmp-9nEGVWj1OHcmZZnGKnPtKdjlTg-xVupaRjZKKiOiJp_wySg2PwMrPGDaldk3cFwbS4eZqkB_OFiGgCaS7P6nlP6h-aJTZevVo9n-VUkkGaylPr3yTNLT-5EhK_AJvt5YdNKJGSh-.png",
      "alt": "Block menu in WordPress with 'Heading' block option highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/11/40/11400e9f05d42ce15b7ddc7ca9140894/66d5ee0368d3df687c6184b9bb07a1a9/AD_4nXff9bGbByYS2lYgdvevJPRuw5eOWTVR2-VHkiTPqOMlqDVSZ63NLCDcMHiGPXICK3rEPRCua9WbpEAT8QKD6BvwcM3K81KoIbnGpY7pNJo_7lfm5MUYvq4G3U0--wm-sikepYu0rmuim7QbRZ4jK3IEmSNi.png",
      "alt": "Heading icon in WordPress editor clicked to reveal heading options and H2 heading option highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/73/69/73695f6b21650f25d11803eabc6d22b3/a6214a0e73fac3bd9c29fdb2db8b71a0/AD_4nXcJAq2VtO5QNPjAwDla6zy2kvrci2fAW-Mktqy0xx6U9x828ECtihcqLcl9j_pKEQ21qmu7YHFnsaHGg547Lp6nSGJbwefiUwdMhdWel7BME3KlQwHT12eSoPQdhAetn7UpJlQp-IitstTlzPqD2AZcrMis.png",
      "alt": "Title for organic search result highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/6d/22/6d225f8a06ea79194b1e7e5826d00fa6/2b6207a1e1aaf511cbd1b14d872355f9/AD_4nXdSOOdk1JqvUNE0bMzbgcugHnA93MYDkpaXTBH3ydbHKvc06ksMgRrBgCTs0-ijOKOGUUesJ3_M5iYEEX9LYwU8Y6ENnYSPk7ecHqHHt2PhNf1kFvkkNXNo6_lqhBZDXfgQTlc2XG59g0CVPVl-OgBxWo8.png",
      "alt": "Meta description of organic search result highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/88/13/8813e2baea2d89d4e35d08feb5832dee/c1d4ea078284a1a3331b67ced5c2fab4/AD_4nXde-ugj_f0i_erF12vKl85BdJu3KaL8kpPQBZsrGofsxIegShy4N4m8dmhOrbYMdpM9_HfTjqqrw6RRwQJ95PSRyZLd9vWqrZBgFar5nIbqKx-hfiMSs-AvDhL9ltGVlsEdmSBpwK9-qv0Bgdks49QkV0nj.png",
      "alt": "WordPress tool popup with link icon selected to reveal URL field"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/5a/38/5a380721299cc9d3b0475132657a2572/e0e389236bc04258041f19cf7eb24188/AD_4nXepacsU7PvDa60IoDSNwGqzUIPv2fY6Clb_4UiKu1D-SaSTHjIBfw68IK2gkkWcxHfX6gUAUvuKkRq5jxPyFs7og3tgokzLXOk8Lw83K5dfpSQuZ0JOjclmmcm-rgc_GJs31Kz0_VvYxXa7hYTojfWNhYvE.png",
      "alt": "Semrush Site Audit start page, with the domain input box and “Start Audit” button highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/60/87/6087949c7a3bb743c9a364e50ad71c59/59be5e0fd398c0d5d0901107bf8b0ee4/AD_4nXc_5g8hRSML58iw1Il7iYUozpPBrshV8hA-InUfYQ7po3tgIhI-IffwlNlhOOWXoMDb7_zJrNEBcTH3R8KlfTZLAxcysw-mHKlVXfvAzPwoftoa1R8U3eXAePSulPt-NJb5hbfpHU1qE0Jt6oOLw5AAHXtP.png",
      "alt": "Site Audit settings window, with the “Start Site Audit” button highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/d9/9a/d99a6457075684d53c14472f1e0e2ccd/f54694e6df65a30ed03b2558b5d15c86/AD_4nXdqn3JhMB3QKnw9H7-nvPjMJ5hz06ZGeZ8wRdtubJ2B-RFib0UsLFqZ8DVSrBc-NuF5NBrgBSqqX0rGMaOtzFYyfodjP9WS_fam8yBbSCAI2wac264_hswizV4WacQoguiMcBV_Nw2dsLEtD7JZE7SxNwZo.png",
      "alt": "Internal Linking section and \"View details\" button under “Thematic Reports” in Semrush Site Audit report highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/18/95/189528405d6d0b69e3bcb9b2ecdbceac/4d599ff23151b18900b5e3f8a4a90a2e/AD_4nXcNnaDW412zGh2_vdChOY0Cp7P2PLqUNFbEz_Lugc2JqigT1oEwAd8q_MgutaNUtI3XUi-7i5t-jmvgEvy7ptPX3qVm9wfin5rLb4A84mz937SmTWirVpTcuUGIRLipjcHBSvHyqymBMmsbYFjIz5oYQ8k.png",
      "alt": "465 issues button highlighted with arrow pointing from 'Why and how to fix it hyperlink' to popup"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/99/77/997763663a1f1348471e042dbee34db0/d0e9d7abe6c19bf502fa80954dc85838/AD_4nXftDM0XvH5IRKkNnmavBZDy3rjCuBCmjegou4m8yThV4JVT33K-VMzsVw531786UFz0ilCjRCCJMbOOYz4ErZKqk-Uqpxwt0hRT5pmy-3iKsUs5WQ60zMNkmoE6fE_HsWpMb7QtMnseKO9-C95vjOJfQstO.jpeg",
      "alt": "“Alternative text” input box in the WordPress post editor highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/b3/69/b369a6d5bcb86ad26ae8af2b5a8dade1/0920128fdef9fb8e8f9384266783d095/AD_4nXc6vJkqfRsLGbxiDHYhp89Ys7wspv3U4H60N_SgeFqsHYpf0xsr_drIkJKxIAOGlYq2qxBnVLAPPc0qahdOVVnYdj46I5kSJbi4CpyoLWgiZ8LsjIWcslw5c7iBDUbWRbmaLejzKHn1d7-cD6sX_Ttjk0nb.png",
      "alt": "Semrush Site Audit Issues tab with “alt attributes” typed in the search box"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/60/65/60653804daa4e13342415a3e018ecc16/dd747a95c7031e0d814b01293f199912/AD_4nXe6oXNR8EcBoSjN2UhWFCk4zYY0_Y-FMN_uaMnKgTJQW0X6kuIwqTZ2Bw3TgeFi4tKM3wxfGism-lDFv61uuBmy6IYxnQeYuZTBYjf_t2MhS4ud6tMPXM_PiyWH8mQRK_dtjiSCgcYsuuBDqnIc4mSj5QRO.png",
      "alt": "List of pages containing the missing alt text issue"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/77/ae/77aee7d44d2786ff26e62ca0f6172fbe/ed33a1d7422ea056c5f90ed4f9a8b6be/AD_4nXdtRuu2BXuD6cn7RWZavPyr9B0yyUhCBHooUEH_ZjUGDbMeYVOJI5YIDRX9KVn_7-x1cHRpfQ0w3gSXorEe6k0JJwLSMO6WGjorlXokoFCEuPN4Oa91CW3AQl9F1k9g6pvHjamOLMc7oAt70gTH6uDGAog.png",
      "alt": "WordPress Discussion settings page with 'Comments must be manually approved' option checked and highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/c6/e5/c6e5dc95cd071bb9096d96ad195c4498/d0873a3bf7e9a083910a05f61c007668/AD_4nXcKbtV_CbaaZNR4Z1NAxWHtoRU1Yu-s5T7f6vK36PuT44ykYTeYS6ZHn1ymynsyGCD_oyoElismTWhtUddH83TCZOV8MNejj0Rr986MBWp8tP_lGnuEi7llKya4XhfeiLctrQSegl7LUwveOz8CX15KSLPB.png",
      "alt": "Infographic showing gray world map with origin server based in the US, CDN locations all over the map, and user in Australia"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/fd/8c/fd8c0602adff2d4ecfaaa52a10bf596f/8832ff8084458168b42e52d3d63a4370/AD_4nXetRUnSbq1SglttcGYSy4HjOWpoWGSZ1aM9uizPkLAeOlFXPA_bViIrO6q1kZTJa3hQE5UD8DI33rygL5WT9PzxfYFwBiEvbanav5_-2KfqWUKBuQws6c-cM17drei6JPjt8_fq6XyWQo0s0ROc3Zys0bpJ.png",
      "alt": "“Schema” tab and “Page type” and “Article type” drop-downs in the Yoast section in WordPress’s post editor"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/ac/26/ac2654c828f0889e5576cc12170a5107/0d459390fa2e0d64e99f822056a8c60d/AD_4nXfs22NhlteFNoWF7xNc24iH3n1BCpT8HeNY_K003Bne2icqSd0XBg97E7CPC55dCPvCp3D-y6hgXGuFzApCX516UUYmAmeUsjT16NoLvBM3_434dteFyG9w6OmYF2_vOhQ_qB4ZTBOpGC0G_8L9TYfwx8o.png",
      "alt": "Google Chrome Malware error page"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/15/a8/15a87b4583721c56e400d1065b4fe008/c5447a58eef90f535312054b91aa0dff/AD_4nXe_Ls6N7g3Fl_8a07K4dt987x5GCHm-jtKq5zQDTMsbbuVxedY2smbEHXP8Nwd1bOcDakbZptddyPG7wh6Y1UsctB4bCGA9i1shSxw7y_g6oqIlc8SszGWffCzfOIDuDBqSJPeysu2HaVGMcwneENhVgO7x.png",
      "alt": "Screenshot of the WordPress “Updates” page showing updates available for site"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/c3/cb/c3cb65393a55c0710bb985ebb0cda605/1a9b8e6fdb0a220ae27316f525b82d7c/AD_4nXfVnwt9mP640py5hA9WrOThcRbK3eFvuQyhWrAEpPfMF7ByV8sNewyRLUVSWTzldTonws1CwQDTk-uOKHBI2cHyauDKN6joLLuTGNHOg4s_m1zC8n0fjCNUNtEAc5V4tQxZTx-fqxvAOYift65VHQzAeBU.png",
      "alt": "The published date of an article on the Semrush blog highlighted"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/media/e5/9a/e59ab7f4fabbb796d6e87a29f7c4af75/ded25f8f5a81093864a003af45dd019b/AD_4nXfzvgddWgkjQoRHWuJqtJZHlLFIxMxqvKOM2xqIFy1ANGjUtfjVspKQvf_MycmK2K2cXP5TXROhhRtdzGXaD-Cazpfqjz7Rw77GrPOi_11XXT7s-2juVlXlWiJsJB58W2ZrBdK5_c-rjPFZOrYgwVuo8sc.png",
      "alt": "Publish date hyperlink in WordPress editor clicked to reveal popup to set Publish date and time"
    },
    {
      "src": "https://static.semrush.com/blog/uploads/files/e3/c1/e3c11aed0d9bffb525e8f7552d6b7fa1/illustration-ads-banner-205x170.svg",
      "alt": "ADS illustration"
    },
    {
      "src": "https://static.semrush.com/semblog-next-static/banners/trial-gift.png",
      "alt": "Trial Semrush banner"
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://data.adxcel-ec2.com/pixel/?ad_log=referer&action=content&pixid=1bc0716b-4a34-4511-bf3a-c999ecddd356",
      "alt": ""
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&d=Mon%2C%2021%20Oct%202024%2014%3A11%3A53%20GMT&n=4d&b=The%20Ultimate%20Guide%20to%20WordPress%20SEO&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fwordpress-seo%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://sp.analytics.yahoo.com/sp.pl?a=10000&b=The%20Ultimate%20Guide%20to%20WordPress%20SEO&.yp=10160379&f=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fwordpress-seo%2F&enc=UTF-8&us_privacy=1yn-&yv=1.16.5&tagmgr=gtm",
      "alt": "dot image pixel"
    },
    {
      "src": "https://bat.bing.com/action/0?ti=5128787&tm=gtm002&Ver=2&mid=91dd9c4c-330d-452d-821e-1e86497f2e13&bo=1&sid=674088f08fb611ef9174dd2419d69afb&vid=6742a2a08fb611efa1725382817f3f1a&vids=0&msclkid=N&uach=pv%3D10.0.0&pi=0&lg=en-US&sw=1366&sh=768&sc=24&tl=The%20Ultimate%20Guide%20to%20WordPress%20SEO&p=https%3A%2F%2Fwww.semrush.com%2Fblog%2Fwordpress-seo%2F&r=&lt=2448&mtp=10&evt=pageLoad&sv=1&cdb=ARoR&rn=636761",
      "alt": ""
    }
  ],
  "publication_date": null
}