{
  "url": "https://www.similarweb.com/blog/investor/asset-research/uk-grocery/",
  "slug": "uk-grocery",
  "title": "Key Takeaways for the U.K. Online Grocery Market | Similarweb",
  "description": "Online traffic remains high in the UK grocery market, even with the vaccine rollout. Discover which big name is leading the digital transformation inside.",
  "content": "HomeBlogStockAsset ResearchU.K. Grocery Market: 3 Key Takeaways Stock Intelligence U.K. Grocery Market: 3 Key Takeaways Download the Full Analysis by Liat Piazza , Investor Insights Manager 2 Min. June 25, 2021 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic As we approach the end of H1, and the roll out of the coronavirus vaccine in the U.K. is well under way, we decided to analyze some of the biggest players in the U.K. supermarket business, namely: Tesco (TSCO), Morrisons (MRW), Ocado (OCDO), Asda (owned by Walmart, WMT), and Sainsbury’s (SBRY). There’s no doubt that the U.K. grocery market is changing at a rapid pace. The pandemic has accelerated the shift to online, with IGD predicting that by 2022, online is expected to take £1 in every £11 spent on groceries in the U.K. In fact, they estimate that the online U.K. food and groceries market will surge £7 billion (59.2%) between 2019-2022. Using our powerful digital alternative data, we set out to measure the extent of this e-shopping transformation – and uncover the industry’s winners (and losers). Key takeaways: Online traffic remains higher than pre-covid levels Tesco is leading the pack of U.K. supermarkets in the online digital transformation Growth is slowing year-over-year (YoY) Sainsbury’s increased its investment in paid advertising in Q2 Download the full U.K. grocery analysis 1. Online traffic remains elevated As expected monthly website visits to all U.K. grocery sites spiked significantly in March 2020 when the coronavirus pandemic first hit and the U.K. began its first lockdown. Over a year later, with the U.K. now out of lockdown for the time being, we see web traffic levels to still be higher than pre-COVID levels. In 2019 tesco.com was neck-and-neck with asda.com traffic share for the most monthly visits. However, during the pandemic, the situation changed. We can see that Tesco was more successful at capturing the opportunity the shift in consumer behavior brought. Morrisons also successfully upped its digital game when the pandemic hit, and significantly increased the gap in monthly visits to its grocery site compared to ocado.com which has historically been chasing its tail. 2. Growth is slowing Despite elevated traffic levels to top U.K. grocery sites compared to pre-pandemic levels, since the beginning of 2021 YoY traffic growth to all U.K. grocery sites we explored has been declining. This is likely a result of the fact that the first half of 2020 was the beginning of the pandemic for the U.K. and compared to 2021, consumers were much more likely to order online in 2020 when many were still afraid to leave their homes. While Tesco has the largest online market share (as measured by monthly site visits), sainsburys.co.uk is showing strength. Compared to other grocery sites in the competitive set, sainsburys.co.uk saw the least significant YoY decline in site visits in H1 2021, stealing the reigns from groceries.morrisons.com who was the growth winner in 2020. *2Q21 YoY growth data is for April and May only (vs. April and May 2020) 3. Investing in paid advertising What’s behind Sainsbury’s relative online strength? One factor could be increased investment in paid advertising since the beginning of the second quarter of the year. Our data shows a significant uptick in the traffic share to sainsburys.co.uk from paid search, meaning that it now has a higher share of traffic from paid search than any of the other names we explored. We saw this same trend in the second quarter of 2020 as well. For more on the U.K. grocery space including disruptors and converted visits, download our full analysis. by Liat Piazza Investor Insights Manager Liat creates data-driven content for the Similarweb Investor Solution, focusing on digital performance across various sectors. Related Topics: Asset Research Retail Insights This post is subject to Similarweb legal notices and disclaimers. Related Posts Stock Intelligence Earnings Season: How to Leverage Stock Intelligence for Alpha Asset Research by Andrea Pash 7 Min. Oct 23, 2024 Stock Intelligence Ticker Mapping: Unlocking Alpha with Alternative Data Asset Research by Andrea Pash 5 Min. Sep 23, 2024 Stock Intelligence Customer Growth: Tracking Company Success Asset Research SaaS Research by Andrea Pash 6 Min. Aug 15, 2024 Stock Intelligence Subscription Business Metrics that Define Performance Asset Research by Andrea Pash 5 Min. May 1, 2024 Stock Intelligence What is Alternative Data and How to Use It Asset Research by Andrea Pash 7 Min. Jan 25, 2024 Stock Intelligence Private Equity Data Analytics in Sync: A Case Study Asset Research by Phil Westcott 4 Min. Aug 23, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "U.K. Grocery Market: 3 Key Takeaways"
    },
    {
      "level": "H2",
      "text": "1. Online traffic remains elevated"
    },
    {
      "level": "H2",
      "text": "2. Growth is slowing"
    },
    {
      "level": "H2",
      "text": "3. Investing in paid advertising"
    },
    {
      "level": "H3",
      "text": "Earnings Season: How to Leverage Stock Intelligence for Alpha"
    },
    {
      "level": "H3",
      "text": "Ticker Mapping: Unlocking Alpha with Alternative Data"
    },
    {
      "level": "H3",
      "text": "Customer Growth: Tracking Company Success"
    },
    {
      "level": "H3",
      "text": "Subscription Business Metrics that Define Performance"
    },
    {
      "level": "H3",
      "text": "What is Alternative Data and How to Use It"
    },
    {
      "level": "H3",
      "text": "Private Equity Data Analytics in Sync: A Case Study"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Liat Piazza"
}