{
  "url": "https://www.similarweb.com/blog/investor/asset-research/what-is-alternative-data/",
  "slug": "what-is-alternative-data",
  "title": "What is Alternative Data? A Guide For Investors | Similarweb",
  "description": "What is alternative data, and how does it support investment strategies? Get examples of alternative data sets and see how they support investment strategies.",
  "content": "HomeBlogStockAsset ResearchWhat is Alternative Data and How to Use It Stock Intelligence What is Alternative Data and How to Use It Start using alternative data by Andrea Pash , Senior Content Marketing Manager 7 Min. January 25, 2024 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic There are so many buzzwords in a constant swirl around the technology space. But let’s focus on alternative data and what it means for investors. So, without further adieu, the answer to the question at the forefront of everyone’s minds. What is alternative data? Alternative data is gathered from nontraditional sources, like credit card transaction data, web traffic and engagement data, and geolocation data. It allows investors to look past traditional data sources like readily available public financial data and SEC filings to surface signals and curate unique insights to generate alpha and strengthen investment strategies. What are the different types of alternative data sets? While any data set an investor uses that doesn’t stem from traditional sources can be considered alternative data, certain alternative data sets are used more readily than others. 1. Transactional Data Commonly referred to as credit card data, transactional data is data captured from Point of Sale (POS) or Point of Purchase (POP) terminals when a consumer uses a credit card to make a purchase. This data is then aggregated and delivered as an alternative data set, allowing investors to gauge sales and curate insights into a company’s performance. Email receipts are another data set that captures transactional data. Some alternative data providers that focus on transactional data are Facteus, FableData, Measurable AI, and Envestnet/Yodlee globally. 2. Website and App Traffic Data Website and app traffic and engagement data, like what you get with Similarweb, allows investors to track and benchmark macro trends and company performance, as well as understand consumer behavior and sentiment for any company with a digital footprint, Investors can utilize this data to support investment strategies and determine new investment opportunities. Take tesla.com, for example. Throughout 2023, investors can track the traffic of each car model to gauge consumer interest. In the US alone, the Model Y reached 1.35M visits in October 2023. Investors can then take that analysis one step further to look closely at performance. The conversion rate (the number of visits that ended on the Thank You page divided by the number of visits) in the US for the Model Y was 1.1% in the same month. 3. Social Sentiment Social sentiment involves collecting and analyzing data from various social media platforms, online forums, and traditional media outlets to gauge consumer sentiment and attitudes toward a particular company, product, or brand. Social sentiment analysis provides insights into how customers perceive and interact with a brand across social media and online communities. Some alternative data providers that focus on social sentiment include Hootsuite, Sprout Social, and Sprinklr. 4. Geolocation Data Geolocation data is the physical equivalent of online traffic, which comes from GPS data generated across cellular networks, revealing consumer movement trends. This allows investors to monitor foot traffic at a company’s brick-and-mortar locations. Satellite data provides geospatial imaging derived from satellite imagery and can track whether parking lots are full or empty. Alternative data providers that focus on geolocation data include Placer.ai, Zartico, and BigDataCloud. The public market investor alternative data use case Public market investors no longer have to rely solely on traditional data sources, like company financials, earnings reports, and regulatory filings with the SEC. They can now leverage alternative data to understand a company’s performance throughout the quarter before any financials are publicly released. Hedge funds and asset managers also use alternative data to validate management messaging and increase conviction in investment theses. Systematic Quantitative (Quant) funds integrate these alternative data sets into their existing workflows to find real-time digital inflection points and monitor companies’ digital health and competitive positioning in the market. How does this work? Because this is Similarweb, let’s look at how web traffic and engagement data benefit public market investors with Similarweb Stock Intelligence. The SaaS sector is as dynamic as the alternative data space. For every application in use on your work computer, there are numerous competitors providing the same service. One of those might be Monday.com, a workflow SaaS company. You can check the company’s web traffic and engagement data in a few ways. First, there are total visits to the company website. Monday.com’s total visits, peaking at 32.6M in Aug. 2023, show the company’s brand strength with continued growth over the last 2 years. To go a step further, analyzing unique visits to any website shows how many individual consumers visited the website in a given month. As seen above, year-over-year (YoY), unique visits to Monday.com have grown from 3.5M in Dec. 2022 to 3.9M in Dec. 2023. But, web traffic and engagement data can take your analysis even further, especially with a SaaS company, because you can look at subdomain data. This data allows you to analyze client growth, churn, and how many active users are engaged with the customer subdomain. Monday.com total subdomains, representing its customer base, experienced steady YoY growth from 67.1% in FQ1 2022 and 29.1% in FQ1 2023. YoY growth declined in FQ4 2023 but was down only 2.7%. New Domains had a similar YoY growth trajectory, starting the year strong with 32.7% YoY growth and ending the year up 7.9% YoY. This data can also be viewed month by month, ensuring that investors have constant insight into companies within their investment portfolio or looking to add to their portfolio, especially during unreported periods, without having to rely solely on traditional data streams. Similarweb Stock Intelligence, the #1 alternative data source for public investors Access premium data sets with actionable, backtested insights Talk to an expert The private investor alternative data use case Private equity, venture capital firms, and investment banks need as many additional data streams as they can get because information about private, unlisted companies isn’t readily available. Alternative data sources allow these private investors to enhance their due diligence, which is the process of appraising a company’s current state of affairs and its commercial potential, enrich their sourcing, the process of finding potential investment opportunities, or grow their portfolio companies, steering them through a transition of rapid performance improvement to sell them. Web traffic and engagement data is a perfect way to determine how a private company is performing on its own, against competitors, and within its category and sector. The mattress industry is a good place to gain perspective on how this data can benefit these private investors. The mattress-in-a-box trend disrupted the mattress industry with the launch of Casper back in 2014. But, over the past 10 years, Casper and the companies that sprouted up in its wake have struggled, swinging from private to public and back to private when purchased by private equity firms. How are they doing now? Comparing monthly traffic to the websites of four of the bigger names in the category is a clear indicator of performance. Nectarsleep.com won traffic share in 2023, staying ahead of the competition ten out of 12 months with 2.82M visits. Casper.com came in second with 2.38M and purple.com with 2.05M. (Note: Purple is a publicly traded company but represents a solid industry benchmark.) Understanding each company’s marketing strategy provides additional insight into the company’s performance as well as strength of brand. While casper.com is winning the organic search traffic race with 16M monthly visits, nectarsleep.com’s paid search strategy is performing significantly better, bringing in 10.2M visits, 7.1M more than casper.com, 4.9M more than purple.com, and 6.9M more than simbasleep.com. Private investors can better understand a company’s paid search strategy by delving into keywords and how much is spent. The number one keyword for this category is, obviously, “mattress.” It drives 2.9% of the traffic to casper.com, nectarsleep.com, purple.com, and simbasleep.com. But, nectarsleep.com is receiving 67% of that traffic vs. its competitors, who get 10.3%, 11%, and 11.8%, respectively, even though the cost per click (CPC) is $3.06 across the board. Looking at the #2 keyword phrase, “emma mattress,” it is obvious that simbasleep.com needs to fine-tune its paid search strategy because the company is paying $1.35 per click on a search term that provides 100% of the resulting traffic. That money might be better spent directed at “mattress” to take traffic share from its top competitor. Each of these data points allows a private investor to determine what the better investment opportunity is without trying to rely on financial data that a private company isn’t expected to disclose publicly. Need clarity on an investment opp? Get in-depth performance insights into any company with a digital footprint. Talk to an expert Implementing alternative data into investment strategies Alternative data isn’t meant to replace traditional data but to complement it. It surfaces additional signals that help curate insights around industry trends and a specific company’s performance. Each investor must investigate the different types of alternative data to understand how it can leveraged and implemented into their investment strategies to help them generate signals and insights. If you are an institutional investor, public or private, and would like to learn more about alternative data options with Similarweb Stock Intelligence and Similarweb Digital Suite and how you can integrate that data into your investment strategies, contact us, and a Similarweb expert will walk you through the alternative data sets that will best support your research needs. FAQs What is the meaning of alternative data? Alternative data is non-financial data culled from non-traditional sources and used by investors to build up investment strategies. What are alternative data sets examples? Many different types of alternative data sets exist, including transaction data, web and app traffic and engagement data, social sentiment, and geolocation data. What is the difference between alternative data and traditional data? Traditional data comes from standard sources such as financial statements, earnings calls, and SEC filings. Alternative data is culled from non-traditional sources such as email and credit card receipts, web and app traffic and engagement data, and GPS data from cellular networks, for example. How is alternative data collected? Alternative data is collected in numerous ways depending on the alternative data source. This includes web scraping, social media commentary, satellite imagery, and credit card receipts, to name a few. by Andrea Pash Senior Content Marketing Manager Andrea, with her extensive marketing background and 15+ years in finance, pulls insight and crafts content for Stock Intelligence & DaaS at Similarweb. A UC Irvine grad, she's a concert lover and avid traveler. Related Topics: Asset Research This post is subject to Similarweb legal notices and disclaimers. Related Posts Stock Intelligence Earnings Season: How to Leverage Stock Intelligence for Alpha Asset Research by Andrea Pash 7 Min. Oct 23, 2024 Stock Intelligence Ticker Mapping: Unlocking Alpha with Alternative Data Asset Research by Andrea Pash 5 Min. Sep 23, 2024 Stock Intelligence Customer Growth: Tracking Company Success Asset Research SaaS Research by Andrea Pash 6 Min. Aug 15, 2024 Stock Intelligence Subscription Business Metrics that Define Performance Asset Research by Andrea Pash 5 Min. May 1, 2024 Stock Intelligence Private Equity Data Analytics in Sync: A Case Study Asset Research by Phil Westcott 4 Min. Aug 23, 2022 Stock Intelligence You Don’t Need X-Ray Vision with Similarweb, the Must-Have Alternative Data Provider Asset Research by Fabiana D'Addario 4 Min. Jun 28, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "What is Alternative Data and How to Use It"
    },
    {
      "level": "H2",
      "text": "What is alternative data?"
    },
    {
      "level": "H2",
      "text": "What are the different types of alternative data sets?"
    },
    {
      "level": "H2",
      "text": "The public market investor alternative data use case"
    },
    {
      "level": "H2",
      "text": "The private investor alternative data use case"
    },
    {
      "level": "H2",
      "text": "Implementing alternative data into investment strategies"
    },
    {
      "level": "H2",
      "text": "FAQs"
    },
    {
      "level": "H3",
      "text": "Earnings Season: How to Leverage Stock Intelligence for Alpha"
    },
    {
      "level": "H3",
      "text": "Ticker Mapping: Unlocking Alpha with Alternative Data"
    },
    {
      "level": "H3",
      "text": "Customer Growth: Tracking Company Success"
    },
    {
      "level": "H3",
      "text": "Subscription Business Metrics that Define Performance"
    },
    {
      "level": "H3",
      "text": "Private Equity Data Analytics in Sync: A Case Study"
    },
    {
      "level": "H3",
      "text": "You Don’t Need X-Ray Vision with Similarweb, the Must-Have Alternative Data Provider"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Andrea Pash"
}