{
  "url": "https://ahrefs.com/blog/zh/301-redirects/",
  "slug": "301-redirects",
  "title": "SEO 的 301 重定向：你需要知道的一切",
  "description": "了解什么是 301 重定向，它会如何影响 SEO，如何实施 301 重定向，最重要的，如何利用 301 重定向来增长网站流量。",
  "content": "Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。 内容 想要了解关于 301 重定向的一切？包括如何使用它来增加你的自然搜索流量？那么你来对地方了。301 重定向其实非常简单。他们可以将一个网页重定向到另外一个网页。但是理解他们和 SEO 的关系就会复杂得多。通过这篇指引，你将了解到：301 重定向是什么；如何实施 301 重定向；301 重定向会如何影响 SEO；如何修复由 301 重定向导致的 SEO 问题；如何使用 301 重定向来增加流量（为增加流量做铺垫）我们从头开始。301 重定向是什么？301 重定向表示网页由一个地址永久地移动到了另外一个地址。这里中的 301 是被重定向网页的 HTTP 状态代码。例如：blog.ahrefs.com 重定向到了 ahrefs.com/blog简单来说，301 重定向是在告诉浏览器：“这个页面已经永久迁移了。这个是新的地址，我们不打算把它移回去啦。”这时，浏览器会回复：“没问题！我现在（开始）就把用户引向这里！”这就是为什么访问 blog.ahrefs.com 已经不可能了。你最后会去到的网页是 ahrefs.com/blog。如何实施 301 重定向实现 301 重定向的方法很多，但是最常用的是编辑你网站的 .htaccess 文件。你可以在网站的根目标找到这个文件：没有找到这个文件？有以下两种可能：你的网站没有 .htaccess 文件。你可以使用 Notepad（在 Windows 平台）或 TextEdit（Mac 平台）创建该文件。只需要新建一个文件并将其保存为 .htaccess 即可。记得要移除标准的 .txt 文件扩展名。你的网站并非运行在 Apache 网站服务器上。这有点技术性，但是网站服务器有许多种。Apache，Windows/IIS 和 Nginx 是最常见的几种。这其中只有 Apache 服务器使用 .htaccess 文件。若要检查网站是否运行在 Apache 服务器上，请询问你的主机托管。这里有一些在 .htaccess 文件中实现 301 重定向的代码片段：重要提示。这些指引仅仅适用于 Apache 网站服务器。如果你的网站运行在 Nginx 环境，可以看看这里，如果是 Windows/IIS，请点击此处。将旧页面重定向到新页面Redirect 301 /old-page.html /new-page.html 在使用 WordPress？使用免费的 Redirection 插件就可以不用编辑 .htaccess 文件啦。使用这款插件，添加一个 301 重定向会非常简单，就像下图这样： 将旧域名指向新域名 RewriteEngine on RewriteCond %{HTTP_HOST} ^oldsite.com [NC,OR] RewriteCond %{HTTP_HOST} ^www.oldsite.com [NC] RewriteRule ^(.*)$ https://newsite.com/\\ [L,R=301,NC] 小提示. 实现 301 重定向的方法有很多，我决计不是 Apache 服务器和 htaccess 文件方面的专家。这里展示的代码都是我屡试不爽的。在向你的网站实装这些代码前，一定要记得测试。重要提示！ 如果你的 .htaccess 已经包含了RewriteEngine on代码片段，那就不要重复了。只需要复制粘贴剩下的代码即可。当然在 Cpanel 中也可以执行这样的操作，这种做法可能更受欢迎。将整个域名由不包含 www 的版本（non-www）重定向到带 www 的版本（www）从 non-www 到 www：RewriteEngine on RewriteCond %{HTTP_HOST} ^example.com [NC] RewriteRule ^(.*)$ http://www.example.com/\\ [L,R=301,NC] 从 www 到 non-www：RewriteEngine on RewriteCond %{HTTP_HOST} ^www.example.com [NC] RewriteRule ^(.*)$ http://example.com/\\ [L,R=301,NC] 重要提示！.htaccess 文件中的代码布局和顺序同样会有影响。当多个（向浏览器发出的）指令的排列顺序“错误”（如：重定向链等）时，你可能会遭遇副作用。如果你打算在 htaccess 文件中实现多个 301 重定向，不妨深入研究一下 .htaccess 文件。将网站域名由 HTTP 重定向到 HTTPSRewriteEngine On RewriteCond %{HTTPS} off RewriteRule ^(.*)$ https://%{HTTP_HOST}%{REQUEST_URI} [L,R=301] 重要提示！要实现上述重定向，你的网站必须已经装有 SSL 证书，否则你会收到“不安全”（”Not secure”）证书的信息。将网站域名由 HTTP 重定向到 HTTPS，将网站的 non-www 版本重定向到 www 版本RewriteEngine On RewriteCond %{HTTP_HOST} !^www\\. [NC] RewriteRule ^ https://www.%{HTTP_HOST}%{REQUEST_URI} [L,R=301] RewriteCond %{HTTP:X-Forwarded-Proto} !https RewriteCond %{HTTPS} off RewriteRule ^ https://%{HTTP_HOST}%{REQUEST_URI} [L,R=301]301 重向定会影响 SEO 吗？许多 SEO 专业人士习惯在将焦点放置在 301 重定向和佩奇指数上。不熟悉佩奇指数？Google 创建了这种公式及算法来根据链接的数量和质量评定网页的价值（”Value of a page”）。当然，佩奇指数并不是唯一的排名因素，但是人们普遍认为，佩奇指数越大，网站的排名就越高。这么说可有证据？是的，去年 Google 已经（再次）确认了佩奇指数是一个排名因素。DYK that after 18 years we’re still using PageRank (and 100s of other signals) in ranking?Wanna know how it works?https://t.co/CfOlxGauGF pic.twitter.com/3YJeNbXLml— Gary “鯨理” Illyes (@methode) February 9, 2017Ahrefs 的网址评分（URL Rating）——与佩奇指数的工作方式类似——和网页获得的自然搜索流量也呈现了正相关的关系： 小提示. 我讨论网址评分（URL Rating, UR）而非佩奇指数的原因是 Google 从 2016 年开始已经不再公开展示佩奇指数，现在已经无从知晓某个页面的具体佩奇指数。在任何情况下我都不会把 UR 与佩奇指数等同，但这是我们能取得的最接近的指标。这些和 301 重定向的关系是什么呢？2016 年前，如果你使用 301 重定向把网站把网站的某一个页面重定向到另外一个页面，中途肯定会丢失一部分佩奇指数。具体会丢失多少呢？这还有待商榷，但是 15% 似乎是被普遍接受的数字。Google 前反垃圾主管 Matt Cutts 在 2013 的一则视频中也暗示了这一范围：https://www.youtube.com/watch?v=Filv4pP-1nw小提示. Matt 并没有直说 301 重定向会带来 15% 的佩奇指数丢失。这个数字只是他举的一个例子。然而，许多 SEO 专业人士多年来一直使用这个数字。同时 15% 这个数字也和佩奇指数原始专利中的“阻尼因素”相关。为了进行论证，我们假设这个数字就是 15%。于是事情会这样发展：Simple 301 redirect: domain.com/page‑1 → domain.com/page‑2 = 15% loss of PageRank301 redirect chain: domain.com/page‑1 → domain.com/page‑2 → domain.com/page‑3 → domain.com/page‑4 = 38% loss of PageRank!但是，2016 年 Google 官方改变了对这件事的态度：30x redirects don’t lose PageRank anymore.— Gary “鯨理” Illyes (@methode) July 26, 2016因此，在 2019 年，如果你将 domain.com/page1 重定向到 domain.com/page2，目标页面和原始页面的功效（Power）是一样的。这项改动的意义重大，这也是为什么 301 重定向对于促进自然搜索流量如此重要的部分原因。（后面我们深入讨论！）但是 301 重定向会带来许多与 SEO 相关的问题，这些问题是平时较少涉及的。如何修复网站上已有的 301 重定向问题你可能通过以下方法找出并修复已有的与 301 相关的问题。1. 确保网站的 HTTP 版本被重定向到了 HTTPS 版本任何一个网站都应该使用 HTTPS 版本。HTTPS 不仅可以为网站访客提供额外的安全性，它还是 Google 采纳的一种排名信号。考虑到你可以通过 Let’s Encrypt 这样的服务来获得免费的 SSL 证书，2019 年你实在是没有理由不使用 HTTPS 了。但是使用 SSL 证书仅仅将任务进行了一半……你还必须确保用户访问的是网站的 HTTPS 版本，这时你就需要借助 301 重定向将 HTTP 版本重定向到 HTTPS 版本了。访问网站的首页并查看链接栏，你就可以知道该重定向是否生效。（如果生效的话）你应该可以看到 https://[www].yourwebsite.com，以及一个锁的图标。将这个链接修改成 http://（注意不是 https://）并敲击回车键。HTTP 版本会自动重定向到 HTTPS 版本。如果事情和以上描述的情况符合，基本上一切就都准备就绪了。但是可能还会有其他的问题，如：HTTP 向 HTTPS 的重向定可以并没有被应用到网站的所有页面（如：子域名）。HTTPS 版本被重定向到了 HTTP 版本。你可以使用 Ahrefs 的网站诊断来执行一次网站爬行，确保没有这些问题。https://www.youtube.com/watch?v=LjinWqfGyVE前往内部页面报告查找以下问题：注意. 如果你看到某个页面的 HTTP 版本出现了 HTTP 至 HTTPS 的警告，而这个页面是爬行起始时的页面，那么这里就没有问题。你可以为这些页面应用恰当的 HTTP 版本到 HTTPS 版本的 301 重定向来解决这些问题。2. 从网站地址中移除带有 301 状态代码的页面Google 会检查网站地图来确认需要爬行和索引的页面。因为带有 301 状态代码的页面从技术上来说已经不存在了，那么自然就无需再要求 Google 来索引他们。如果这些页面还存在于网站地图中，Google 可能在每次重新爬行你网站的时候都会再次访问他们。这样是没有必要的，也是对爬行预算的一种浪费。这里提供一种方法来找到这些页面：找到你网站地图的链接（网站地图通常会存在在 yourdomain.com/sitemap.xml，但也不总是这样）。使用这个工具来下载所有的链接。将下载下来的链接列表复制和粘贴到这个免费的 HTTP 状态代码检查工具中（注意：一次限制 100 个链接）从页面列表中过滤出包含 301 状态代码的页面。有没有更简单的办法呢？可以使用 Ahrefs 的网站诊断（Site Audit）功能来抓取你的网站，然后前往概览报告过滤出那些“网站地图中的 3XX”错误。点击这个功能，你会看到网站地图中所有带有 301 状态代码的页面。接着你可以从网站地图中删除这些 URL，并将他们替换成转发目标 URL（如果还没有的话）。3. 修复重定向链的问题当起点 URL 和 终点 URL 之前存在着两个或更多个重定向时，就会出现重定向链。以下是 Google 官方的相关说明：尽管 Google 爬虫和浏览器可以循着多个重定向（如：页面1 > 页面2 > 页面3）的“链条”一路向下搜寻，我们还是建议（将起始页面直接）重定向到终点页面。如果做不到这样，你应该尽可能控制链条中重定向的数量，理想的情况是跳转数量不多于 3 个，最多不能超过 5 个。重定向链条不但不会给网站带来任何益处，还会影响用户体验和网页的加载速度，作为网站管理员，你应该尽可能地规避。你可以使用这款 HTTP 状态代码检查器一次性检查 100 个链接的重定向链条状态。找出那些重定向了至少两次的页面。如果你想一次性检查 100 个以上页面，可以使用 Ahrefs 的网站诊断工具中的内部页面报告来查看“重定向链条”错误。这样你可以看到链条中的所有链接，包括终点页面的链接。有两种方法可以修复这些问题：将重定向链条替换成一个 301 重定向。比如一个重定向（链条）为 第1页 > 第2页 > 第3页 > 第4页，你需要将其修改为 第1页 > 第4页。将指向重定向页面的内部链接替换成直接指向终点页面的。这样可以阻止 Google 和其他机器人抓取重定向链条。更重要的是，这样可以使真正的用户（你懂的，那些可能在你网站下单的人）在点击链接后免受慢吞吞的多重跳转的折磨。在条件允许的时候，第二种解决方案是最好的。为此，你需要将重定向链条列表的“内部链接数量”一栏按从高到低排列。然后点击内部链接数量查看所有指向重定向页面的内部链接。 将指向受影响的重定向页面的内链换成直接指向终点 URL 的链接。4. 修复重定向循环当重定向链条中的一个链接被重定向至另外一个链接时，就会发生重定向循环的现象。这样就会发生重定向的无限循环，给搜索引擎和用户都带来了困扰。例子：第1页 > 第2页 > 第3页 > 第2页 > 第3页> 第2页 > 第3页 […]类似这样的重定向循环对用户体验来说是致命的，而此时浏览器通常会做出以下这种反应： 你可以像之前那样使用 HTTP 状态代码检查器一次性查看 100 个链接的状态代码。此时你需要寻找的是“超过最大重定向次数”（Exceeded maximum number of redirects）错误。如果你要一次性查看 100 个以上页面的情况，可以使用 Ahrefs 的网站诊断报告，查看“重定向循环”错误。点击这个选项可以查看所有出现重定向循环问题的页面，接着你可以使用以下两种方法（中的一种）来修复这些页面。若这个链接不应该有重定向，那么可以把它的 HTTPS 返回代码修改成 200。若这个页面链接应该重定向，那么你需要修复终点 URL，同时删除这个循环。另外，你应该删除或将所有指向终点页面的移除或替换所有指向终点 URL 的全部内页。5. 修复损坏的重定向如果重定向指向了无效的页面（即：返回了 4XX 或 5XX 错误的页面），那么该重定向即告损坏。例如：第1页（301）> 第2页（404）这时访客和搜索引擎都无法访问最终的 URL，所以这种情况是很不好的。访客会离开你的网站，而大多数搜索引擎也会放弃对网站内容的抓取。你可以使用 HTTP 状态代码检查器一次性检查多达 100 个链接的错误情况。如果你想要查看更多页面，可以使用 Ahrefs 的网站诊断板块中的内页报告来查看“失效的重定向”。修复这些问题有两种方法：如果是不小心删除了原页面，将其恢复即可；删除指向该 URL 的内部链接。6. 404 重定向页面返回 404 错误代码的页面是无效页面，浏览器会返回一个类似下图的页面：有时，用户应该看到这样的页面。例如，当用户输入进浏览器的 URL 有误时，这个页面就可以告诉他/她输入是有误的。在上图中，你会发现返回一个 404 错误页面是完全合理的。话虽如此，404 错误的页面依然会是个问题，特别是出现以下情况的时候：这些页面是可以被抓取的。可以被抓取通常意味着可以被点击。如果他们是可以被点击的，一些用户在点击内部链接后就会去到这个页面。这样对用户体验是很不好的。他们保有外链。因为 404 页面是无法被访问的，这样任何指向 404 页面的外链就相当于被浪费掉了。要解决第一个问题，可以在 Ahrefs 的网站诊断板块的内部链接报告中查看“404 页面”的错误。点击此处可以查看爬虫在抓取网站时遇到的所有 404 错误页面。接着，点击“管理栏目”按钮，添加“dofollow 外链数量”一栏，点击“应用”，然后将此栏按数量“从多到少”排列。在 Ahrefs 网站分析板块的外链报告中寻找可能拥有1个或多个Dofollow外链的页面。这些外链有可能是有价值的。如果是这样的话，你可以需要将他们 301 重定向到网站上另外相关的资源。重要将 404 页面重定向到相关的内容是这里的关键。Google 对 301 和 404 重定向等量齐观，因此，除非你将他们指向相似或者相关的页面，否则单纯的重定向不会带来什么好处。来自 Google 的 John Mueller 在这则视频中解释了更多细节。https://youtu.be/nIDZmac_rMI?t=76如果没有相似或者相关的页面，而你网站上的某个 404 页面又拥有大量的高质量外链，老实说，这就值得你把这个页面的内容重新发布在完全相同的位置了。你可以这样想：如果这个无效页面的价值很大，一开始就吸引了众多高质量的外链，那么就值得去考虑为什么它会不复存在。这显然是人们感兴趣的话题。至于那些没有 dofollow 外链的页面，可以试着用以下方式修复：把无效页面恢复到指定的 URL把无效页面 301 重定向到另外一个相关页面移除或替换所有指向无效页面的内部链接重要提示。如果你使用第 3 种方法，记得不仅要替换内部链接，如有必要还需要替换锚文本和周围的文字。7. 将 302 或元更新重定向替换成 301 重定向永远不要使用 302 或者元更新（meta refresh）重定向来做永久重定向。302 重定向是为了临时移动，而 Google 也建议如果有可能的话，在任何时候都不要使用元更新重定向。因此，当你的网站上有这两种重定向中的任何一种时，你应该想办法将他们移除，或者用 301 重定向替代。你可以在 Ahrefs 网站诊断板块的内面页面报告中查看带有这些“元更新重定向”和“302 重定向”问题的页面。值得庆幸的是，这两个问题可以用同样的方法解决：如果重定向是永久的，就用 301 重定向替代。如果重定向不是永远的，就将他们移除。你还应该将指向重定向页面的内部链接移除或替换，特别是当他们会给点击的用户带来困扰的时候。8. 找出那些拥有自然搜索流量的（301）重定向页面带有 HTTP 301 状态代码的页面不应该获得自然流量，因为他们不应该存在于 Google 的索引中。如果这些页面获得了流量，意味着 Google 还没有侦测到这些重定向。你可以在 Ahrefs 网站诊断板块的概览报告中查询“获得自然搜索流量的 3XX 页面”来找到这些错误。如果你从其他地方（比如某个 HTTP 状态代码检查器）获得了 3XX 页面列表，可以一次性最多将其中 200 个粘贴进入 Ahrefs 批量分析工具中，查看每一个页面所获得的自然搜索流量。提示。你还可以在 Google 分析或者 Google 站长工具中查看页面的自然搜索流量。如果你最近已经加上了 301 重定向，这可能不会是个问题。Google 在下次抓取网站的时候应该可以侦测到这些重定向，并且从索引中将原本的网页移除。你可以将 URL 复制进 Google 站长工具的 URL 检视工具中，并点击“请求索引”来加速这个过程。你还能将这些页面从网站地图（参见第2章）中移除，并重新向 Google 站长工具提交。9. 寻找“不良的”外部 301 重定向大多数网站都会链接到外部相关的第三方网站及资源。这没有什么问题，除非这些链接被重定向到了其他地方。假设你链向了外部一个有用的资源。12 个月之后，那个域名过期了，一个过期域名猎头获得了这个域名，删除了这个资源，然后将其链接到了他们的“赚钱”网站。这时你便无意地链向了某些无关（可能甚至是有害）的资源，你的访客也会受到影响。基于这个原因，不时地检查“不良的”外部 301 重定向是很重要的。为此，你可以前往 Ahrefs 网站诊断板块的外部页面报告查找“外部 301 重定向”警告。 点击此处，你可以查看所有重定向到外部链接的列表，以及终点 URL。页面太多？因为 nofollow 外链经常是类似博客评论的东西，你可以将他们移除以获得更工整的列表。只需要在报告中加入“dofollow 内部链接数量 > 0”过滤条件即可。这样做可以帮助区分出事项的优先级。接着，浏览报告的 URL 和 重定向 URL 栏目。寻找那些看起来不对的重定向。换句话说，你需要无视 HTTP 版本到 HTTPS 版本的重定向，以及 blog.domain.com/page 到 domain.com/blog/page 这样的重定向。你要找的是指向不同网站或者页面的重定向。以下是我在抓取 Backlinko 网站内容时的一个例子：这里的问题并不是某个页面被重定向到了另外一个页面。熟悉 Neil Patel 的人都知道，今年早先时候他将 blog.kissmetrics.com 与 neilpatel.com 合并了。不，这里的问题是重定向到的页面是另外一篇完全不同的文章。原始文章标题：巧用定性数据提高 SaaS 转化率（Using the Magic of Qualitative Data to Increase SaaS Conversions）重定向文章标题：理解你的客户将如何帮助你创建叫座的内容（How Understanding Your Customer Will Help You Create Copy That Sells）出现这些情况时，最好能够移除所有指向重定向页面的内部链接。为次，你可以点击“内链数量”一栏的数字来查看所有包含指向重定向页面内链的链接。快进入到你的内容管理系统里面把他们移除吧。如何使用 301 重定向来增加网站的自然搜索流量至此，你的网站应该已经规避了所有与 301 重定向相关的问题。是时候严肃地讨论一下应该如何使用重定向来大幅度增加网站自然搜索流量了。方法有以下两种。“鸡尾酒”技术你有一杯可乐。嗯。你有一杯朗姆酒。好棒！这两种饮料本身都是不错的存在。但是，你把两者一结合，就会去到全新的境界。你好哟，朗姆可乐！但是这和 301 重定向有什么关系？把这两种饮料想象成你网站上两个话题相关的页面。每个页面的表现都还可以。他们各自有着一些像样的外链。他们拥有一些自然流量。一些都还不错。但是我们为什么不把两者整合到一起，生成更优质的内容呢？如果我们这样做的话，就有可能把这两个本来表现平平的页面转化成一个表现卓越的页面，就像那美味至极的鸡尾酒。我们最近就对 Ahrefs 博客上的两篇文章这么做了：https://ahrefs.com/blog/skyscraper-technique/https://ahrefs.com/blog/skyscraper-technique-fail/这两篇文章都在慢慢过时，我们决定把他们合成成这样一篇新的指引。接着我们在 ahrefs.com/blog/skyscraper-technique/ 上重新发布了这篇新文章，并把另外一个链接重定向到了这里。结果会自己说话：那么为什么会这样呢？原因有以下两点：巩固“权威度”：还记得吗？现今的 301 重定向不会再“泄露”佩奇指数了。当我们把一篇文章重定向到另外一篇时，我们也将两篇文章的“权威度”整合到了一处。当然，如果页面本身是无关的话，这样做是没有用的，因为 Google 将这样的重定向视作 404。今是昨非因为我们例子中的两个页面是相似的，这样就收到了奇效。诞生了更优质的内容：这两篇文章的质量都不错。他们只是开始显现出了一点老态而已。我们将两篇文章中最好的部分提取出来进行整合，就产生了更优质的内容，它值得更大的流量。现在，唯一的问题就剩下我们应该如何复制这样的策略，对吗？下面我来介绍一下。第一步：找到具有关键词同质化问题的页面（拥有一定数量的外链）当两个或多个页面标的完全一样的关键词且之于这些关键词有排名时，就会出现关键词同质化问题。找到这些问题，是识别机会的好办法。现在我们开始第一步，复制这个 Google 表格。接着，将网站粘贴进入 Ahrefs 网站分析工具，去到热门页面报告，并将其导出为 CSV 文件。 将 CSV 导入到 Google 表格的第一个标签页。依次进入：文件 > 导入… > 上传 > 选择刚刚导出的 CSV 文件 > 按照提示，选择“附加到当前表格”（Apend to current sheet）功能。就是这么简单。去到“结果”标签页，你就可能看到清晰的结果了。第二步：找到相关机会接着，你需要把目光放在潜在的重定向机会上。以下是 Hubspot 博客一个较好的例子：这两个页面之于“user generated content”分别排名第 5 和第 6 。他们两者：话题非常接近；拥有来自唯一网站（合计 467 个指入域名！）的大量外链；获得了不少自然搜索流量。因此，让我们在 Ahrefs 关键词分析报告中看一下之于关键词“user generated content”排名靠前的页面。当前排名第一的结果中有两点值得注意：它所获得的流量是 Hubspot 两篇文章合计流量的两倍！它拥有 192 个指入域名，不及 Hubspot 两篇文章合起来 467 个指入域名数量的一半。因此，如果 Hubspot 将两篇文章合为一篇，同时汇合所有的链接权重，那么我认为他们很有可能拿下这个关键词第一的宝座。这可是他们现在流量的两倍哦。第三步：重写并合并页面现在是时候把每个页面最好的内容提取出来再合到一起了。例如，如果我们要对上述 Hubspot 的两篇文章采取行动，我们可能会保留其中一篇文章的标题，即：“如何开展‘用户生成内容’活动”（How to Run Your Own User Generated Content Campaign）。…同时保留另外一篇文章中解释“为什么要做用户生成内容？”的部分。为了尽可能保证新页面的相关度，同时中合 Google 将 301 重定向视作 404 的风险，我们还可以在网站分析板块的锚文本报告中检查每个页面的情况：它可以提示人们链接到这个页面的初衷。例如，我发现数量相当的人在链接向这个页面的时候引用了数据，因此要我们翻新的博文中保留这些数据是有意义的。专业提示你应该将重写/合并两个页面视作是更好地迎合搜索意图的机会，更好地向搜索者展示他们想要的内容。如果有许多“10 大”之于这个关键词有排名，你翻新的文章也应该是“10大”云云。如果有许多“如何做”的指引，好吧……你应该知道怎么做了。注意。这跟 301 重定向没有什么关系，但是如果你想最大化产出，这件事值得去做。第四步： 发布你翻新的页面，并施行 301 重定向现在终于是时候发布你翻新后的文章了。如果旧的 URL 里面有任何一个与新的博文匹配，那么大可以继续将其沿用到翻新的文章中。接着你可以删除另外一篇博文/一个页面，并通过 301 重定向将它指向新的博文。你可能会联想到这正是我们对摩天楼技术那篇文章的处理办法。我们复用了 /skyscraper-technique/ 这个 URL。如果旧有的两个 URL 都不适用于新的博文，那么你大可以把这两个链接都通过 301 重定向指向这个全新的 URL。例如，如果我们要把 Hubspot 的这篇文章合并成一篇新的指引：……那么这两个旧的 URL 显然并不适合。一个较为合适链接可以应该是类似 blog.hubspot.com/marketing/user-generated-content/ 这样的。于是，于是就可以这么干，用 301 重定向将另外两个页面指向那个 URL。就是这么简单。提示想要更进一步？不妨来做一次内容诊断，找出那些拥有外链，却没有自然搜索流量或者关键词排名的页面吧。如果这些页面对你的业务来说并不重要，可以把他们删除，或者重定向到更有意义的页面。合并方法（The Merger Method）以下是使用合并方法后，某个站点自然搜索流量的变化。12 个月之内，自然搜索流量增长了 ~116%！简单来说，该方法的流程如下：收购你行业中的另外一个公司或者网站。使用 301 重定向将其与你的网站合并。Backlinko 的 Brian Dean 去年这么做了一次。他买下了另外一个 SEO 博客 Point Blank SEO —— 并将它重定向到了 Backlinko。实际上，上面截图中展示的正是 Brian Dean 这次合并后取得的效果。但是在你即将买下手边的每一个网站之前，你需要理解以下内容：这种方法即使奏效了，它和你直接买下一个网站并使用 301 重定向将所有页面都指向首页相比，还是要复杂一些的。这是一种偷懒的方法，2019 年如果还使用这种方法可以就不起作用了。你需要针对每个页面来做 301 重定向。下面我会教你如果一步步地做好（以上）步骤。1. 重新设计和制作主页，并对内容进行重定向网站的最大自然搜索流量源可以来自首页改版和内容重定向。BrainDean 对 pointblankSEO 的某些页面执行了以上步骤，包括 John 那篇关于外链建设策略的著名列表也收录在此报告中。你知道的，该页面的外链档案如下图所示： 原始的 URL 为：pointblankseo.com/link-building-strategies新的（重定向后的）URL 为：backlinko.com/link-building-strategies因为 Brian 使用了 301 重定向将博文从旧的域名指向了新的域名，这样一来所有的链接都指向了 backlinko.com 域名下的同一个页面。这个页面实际上搬迁到了新家。当满足以下所有条件时，对内容进行域名迁移及重定向最好的选择：内容拥有自然搜索流量内容的话题与您的业务相关内容是高质量的注意最后一点你是可以在迁移或重定向后对内容进行更新或者重写来实现的。Brain 就对这个链接建设的列表执行了这个策略，而这个列表从 2012 年以来就没有更新过了。2. 删除内容或者重定向到不同的页面当页面符合以下条件时，就没有必要保留或者迁移域名了：这些页面几乎或者完全没有潜在自然搜索流量。网站上已经有其他页面覆盖了这些话题。比如，在合并的时候没有必要保留“关于我们”页面，否则你就有两个“关于我们”的页面了，这说不通。类似的情况还有你的网站包含标的了相同关键词的其他页面。对这些内容进行域名迁移将会导致关键词同质化问题。相似地，如果你的页面几乎或者完全没有潜在流量，那么你也可以删除它们，或者将它们重定向到别处。Brian 对 pointblankseo.com 上的不少文章使用了这种策略，比如这篇关于外展平台的博文：这篇文章已经不存在了。Brain 将它重定向到了他的一篇关于链接建设工具的博文上。原始的 URL 为：pointblankseo.com/outreach-platforms新的（重定向）URL 为：backlinko.com/link-building-tools他这么做是因为“outreach platforms”（“外展平台”）这个关键词既没有搜索量，也没有流量潜力。这不是一个值得标的的话题。因此将这篇文章重定向到另外一篇具备流量潜力的博文更有意义。3. 删除并重定向到首页如果不存在与待重定向的页面相关的内容，移动该页面或将其迁移至新的域名又没有意义，那么最后的办法是将这个页面重定向到你网站的首页。这也是 Brain 对原先 pointblankseo.com 上大部分页面的处理办法，比如下面这篇“自负诱饵”指引：原始的 URL 是：pointblankseo.com/egobait-guide新的（重定向）URL：backlinko.com/blog为什么这是最后的手段？好吧，记得我们在上文说过 Google 将 301 重定向和 404 重定向等量齐观吧？当我们把博文和页面重定向时，就会有可能发生这种情况。但事情是这样的，如果你不对这些页面做重定向，Google 100% 会将他们视作是 404 页面。所以基于这个原因，你也会（选择）做重定向。但是这么做有一个注意点，你不应为带有低质量外链的页面做重定向。这样做会害多利少，因此在进行重定向操作前，你应该为每个页面查看网站分析板块中的外链报告。如果你的外链档案是这样的……你最好就把这个页面删除了，让它 404 去吧。或者，如果真的觉得有必要重定向某个页面，那么在这么做之前你可以否定这些糟糕的链接。不过，这很可能得不偿失。结语当提到 SEO 时，301 重定向有很多用途。有策略地使用它，可以为网站带来很多自然搜索流量。但是，首先你需要确保网站已经没有301 重定向问题，因为他们会使你当前或者未来对SEO的 投入打折。这篇指引错过了什么内容吗？请在评论区或者通过 Twitter 告诉我。译者，Alex Wang，Not Soup Yet 创始人 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。",
  "headers": [
    {
      "level": "H1",
      "text": "SEO 的 301 重定向：你需要知道的一切"
    },
    {
      "level": "H2",
      "text": "301 重定向是什么？"
    },
    {
      "level": "H2",
      "text": "如何实施 301 重定向"
    },
    {
      "level": "H3",
      "text": "将旧页面重定向到新页面"
    },
    {
      "level": "H3",
      "text": "将旧域名指向新域名"
    },
    {
      "level": "H3",
      "text": "将整个域名由不包含 www 的版本（non-www）重定向到带 www 的版本（www）"
    },
    {
      "level": "H3",
      "text": "将网站域名由 HTTP 重定向到 HTTPS"
    },
    {
      "level": "H3",
      "text": "将网站域名由 HTTP 重定向到 HTTPS，将网站的 non-www 版本重定向到 www 版本"
    },
    {
      "level": "H2",
      "text": "301 重向定会影响 SEO 吗？"
    },
    {
      "level": "H2",
      "text": "如何修复网站上已有的 301 重定向问题"
    },
    {
      "level": "H3",
      "text": "1. 确保网站的 HTTP 版本被重定向到了 HTTPS 版本"
    },
    {
      "level": "H3",
      "text": "2. 从网站地址中移除带有 301 状态代码的页面"
    },
    {
      "level": "H3",
      "text": "3. 修复重定向链的问题"
    },
    {
      "level": "H3",
      "text": "4. 修复重定向循环"
    },
    {
      "level": "H3",
      "text": "5. 修复损坏的重定向"
    },
    {
      "level": "H3",
      "text": "6. 404 重定向页面"
    },
    {
      "level": "H3",
      "text": "7. 将 302 或元更新重定向替换成 301 重定向"
    },
    {
      "level": "H3",
      "text": "8. 找出那些拥有自然搜索流量的（301）重定向页面"
    },
    {
      "level": "H3",
      "text": "9. 寻找“不良的”外部 301 重定向"
    },
    {
      "level": "H2",
      "text": "如何使用 301 重定向来增加网站的自然搜索流量"
    },
    {
      "level": "H3",
      "text": "“鸡尾酒”技术"
    },
    {
      "level": "H4",
      "text": "第一步：找到具有关键词同质化问题的页面（拥有一定数量的外链）"
    },
    {
      "level": "H4",
      "text": "第二步：找到相关机会"
    },
    {
      "level": "H4",
      "text": "第三步：重写并合并页面"
    },
    {
      "level": "H4",
      "text": "第四步： 发布你翻新的页面，并施行 301 重定向"
    },
    {
      "level": "H3",
      "text": "合并方法（The Merger Method）"
    },
    {
      "level": "H4",
      "text": "1. 重新设计和制作主页，并对内容进行重定向"
    },
    {
      "level": "H4",
      "text": "2. 删除内容或者重定向到不同的页面"
    },
    {
      "level": "H4",
      "text": "3. 删除并重定向到首页"
    },
    {
      "level": "H2",
      "text": "结语"
    }
  ],
  "author": "Joshua Hardwick"
}