{
  "url": "https://ahrefs.com/blog/zh/affiliate-keyword-research/",
  "slug": "affiliate-keyword-research",
  "title": "如何做分销网站的关键词研究",
  "description": "分销类网站的关键词研究就是寻找那些有搜索量、同时可以自然其中插入产品的关键词。",
  "content": "Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。 内容 大多数人会错误地进行分销网站的关键词研究。他们会寻找低竞争力的关键词，写博客文章，然后在尽可能的塞入各种分销链接。这种方法可以给你带来很多流量，但是没有点击、没有转化、从而导致没有收入。幸运的是，有一个简单的解决方案：找到你能够参与排名的、同时具有搜索量的关键词。然后这些搜索词的对应的页面中你都可以自然插入相关产品的推荐。这里有个很重要的点就是搜索意图。例如，有人在搜索 “best protein powder（最佳蛋白粉）”，但他们想在购买之前权衡每种选择的利弊。因此，他们很有可能在你的页面中点击分销链接并购买相关产品。但是，当有人搜索 “what is protein powder（什么是蛋白粉）” 的时候，他们不太可能很快的做决定。他们可能只是研究、或者想知道粉末类型之间的区别。他们不太可能点击分销链接，并进行购买。在本文中，你将了解四种主要的分销类关键词形式。一般对比品牌对比产品评测T&A 关键词https://youtu.be/s5VZaXi7RF41. 一般对比如果你看过 The Wirecutter，你就应该指导一般对比类的关键词是什么样的。它们基本上是 “best [产品名]” 的格式。下面是一些例子：best strollersbest carriersbest baby bottles在这些类型的内容中推荐产品非常容易，因为用户的目的就是比较产品，它们基本都是希望尽快购买该类型的产品。而你只需要帮助他们决定购买哪个就可以。为了找到这些关键词，你只需要在 Keywords Explorer（关键词分析）中输入一两个大词。比如，如果你的网站是关于婴儿产品评测的，那么你就可以放入 “baby” 以及 “toddler”。然后，进入 Phrase match（部分匹配词汇）报告查看包含一个或多个词的关键词建议。然后使用 “Include（包含）” 筛选功能，找到包含 “best” 的关键词建议。这样你就可以获得海量的关键词建议。如果数量过多，你可以通过 Keyword Difficulty（关键词难度）进行筛选。比如，筛选出关键词难度低于10的关键词：你需要知道的是，不应该只关注低KD的关键词。因为很多词例如 “baby bathtubs”、“baby lotions”、“baby wraps” 你能从中获得的价值相对较低。所以，你还需要找一些产生价格较高的关键词，比如 婴儿用的 “car seats”等。当然，价格较高商品的关键词通常更具竞争力，但是你可以通过寻找针对特定人员或需求的关键词来找到相对低竞争的关键词。通常遵循这样的格式 “best [产品名] for [用户]”：best car seat for small carbest carrier for newbornbest stroller for travel为了找到这些词，在 Keywords Explorer（关键词分析）中输入一些价格较高的词。比如你是做婴儿产品的，那么就可以输入 “car seat”、“stroller”、“crib“等。然后进入 Phrase match（部分词匹配）报告，并使用 “Include（包含）“筛选，输入 “best” 和 “for”，你只需要确认 “all words” 选项是选中的，那么同时包含这两个词的关键词建议就会被筛选出来。这时，你就会看到所有包含 “best” 和 “for” 的关键词建议。其中至少能找到一个高价格的产品词。但是，这些关键词并不是所有都是低KD值的。比如 “best car seat for 3 year old” KD值是22。但是如果你点击 SERP 按钮，你会看到它的搜索结果其中有混合的内容。比如，一些页面是精准的对比三岁婴儿用的座椅，而其它一部分内容则是很宽泛的比较。同时，你会发现，那些更精确详细的内容并没有太高的权重，以及 referring domains（反链域名）。相反，更宽泛的内容页面权重和referring domains（反链域名）会更多。所以，如果我们精准的针对三岁婴儿用的座椅进行内容的制作会是一个不错的选择。2. 品牌对比品牌对比指的是那些用户会搜索并对比两个品牌产品的关键词，比如：beats studio wireless vs bose qc35airpods vs airpods progalaxy buds vs airpods这些关键词通常具搜索量低，但是转化很好。因为搜索者已经将他们的购买决定范围缩小到仅两种产品。最简单的方法是将品牌词放入像 Keywords Explorer（关键词分析）这样的关键词工具中。然后查看 Phrase match（部分词匹配）报告，并通过 “Include（包含）“筛选功能，筛选出包含 “vs” 的关键词。比如，如果我们想找婴儿车类的品牌对比词，就输入一些品牌，比如：Bugaboo、City Select、 Uppababy等。如果你一时想不到有什么品牌，那么就在一些相关的在线商城中查看对应的品类。比如这里我们就可以查看 buybuybaby.com的导航。在它的 “Shop by brand” 的分类中就可以看到一系列的知名品牌列表：从 Keywords Explorer（关键词分析）的结果来看， “uppababy cruz vs vista” 看起来是一个不错的话题。这些产品的单价有 $500 到 $1,000。如果我们查看SERP，可以发现排名靠前的网站大多数DR比较低，同时 referring domains（反链域名）数量也不多。所以相对排名会比较容易。小提示. 如果你输入的品牌生产多种类型的产品，例如汽车座椅和奶瓶，那么最好使用诸如 “uppababy cruz” 以及 “uppababy vista”之类的型号名称作为你的种子关键词。 3. 产品评测产品评测指的是用户在寻找特定产品详细评价的关键词，比如：bugaboo buffalo reviewuppababy vista reviewbabyjogger city select review这类关键词是最好的分销类词。因为用户已经非常接近购买状态了。因为他们已经进行了研究，某个特定型号引得到了他们的认同。现在他们只想在做决策之前深入的了解该产品的评价。但是，相比于品牌对比，产品评测类的关键词搜索量会更小。所以，如果你准备购买产品并进行评测，那么最好是针对那些用户肯定会搜索的产品。为了找到这些词，你只需要在 Keywords Explorer（关键词分析）中输入一些品牌词。然后进入 Phrase match（部分词匹配）报告，然后使用 “Include” 筛选功能，筛选出包含 “review” 的关键词建议：剩下要做的就是评估这些词的排名难度并选择你认为可以排名的词。4. T&A 关键词如果你希望在谷歌中参与排名，那么你需要你的页面拥有 权重，也就是 backlinks（外链）。但是，我们之前讨论的关键词几乎都是商业词，很难获得外链的机会。解决的办法就针对 T&A 关键词。就是 Trust（信任）Authority（权威）。这些关键词是针对商业类话题，而是用来教育，并启发用户的。以下是针对这些关键词的好处：与你的用户建立信任. 如果你可以展示和主题相关的专业知识，那么人们更可能会信任你推荐的产品。通过链接获得权重. 相比于链接到广告页面，人们通常愿意链接到非广告，并且有价值的内容页面上。为了找到 T&A 关键词，你只需要在 Keywords Explorer（关键词分析）中输入一些种子关键词，并且进入 Questions（问题）报告查看相关话题。如果我们做的是婴儿相关的网站，你可以输入例如 parenting、toddler、以及 newborn 等词。然后，通过通过筛选找到 Keyword Difficulty（关键词难度）40以上的词：之所以这么做是因为 Ahrefs Keyword Difficulty（关键词难度）指标是根据排名前十页面获得的链接数量来决定的。所以越高的数值意味着获取链接的潜力越强。最后，挑选出那些你认为用户能够收益的话题。同时产看它们的 SERP，并查看那些排名靠前页面的外链数据。虽然这些页面的访客不会直接购买产品，但是对于你的品牌的宣传还是至关重要的。同时你还可以使用 中间人方法 在T&A的页面中加入你的分销页面的内链。在这个视频中学习如何操作：https://www.youtube.com/watch?v=433XlvMl508最后以上这些应该可以提供非常多的关键词建议，帮助你填充网站的内容。找到这些关键词只是第一步，你还需要学习如何评估排名难度，以便于为你的网站找到最佳的关键词建议。在这篇关键词难度完美指南中学习如何操作、或者是观看这个视频：https://www.youtube.com/watch?v=jSOq3ysvBk8有问题？在 Twitter上找我吧。译者，Park Cheng，魔贝课凡联合创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。",
  "headers": [
    {
      "level": "H1",
      "text": "如何做分销网站的关键词研究"
    },
    {
      "level": "H2",
      "text": "1. 一般对比"
    },
    {
      "level": "H2",
      "text": "2. 品牌对比"
    },
    {
      "level": "H2",
      "text": "3. 产品评测"
    },
    {
      "level": "H2",
      "text": "4. T&A 关键词"
    },
    {
      "level": "H2",
      "text": "最后"
    }
  ],
  "author": "Joshua Hardwick"
}