{
  "url": "https://ahrefs.com/blog/zh/ahrefs-hacks/",
  "slug": "ahrefs-hacks",
  "title": "18个鲜为人知（但强大的）Ahrefs 使用技巧",
  "description": "看看这18个鲜为人知的使用示例，帮助你从 Ahrefs 中获得数据，从而增强你的 SEO 工作",
  "content": "Andrei Țiț Andrei Țiț 是 Ahrefs 的一名产品营销人员。他在不同的 SaaS 公司从事产品营销超过6年，专门从事内容营销和短视频的工作。 内容 即使你熟悉 Ahrefs，你可能每天都在使用其中的一个或两个工具。但是，依然有很多你可能会错过的实用的技巧。为了帮助你最大限度地利用 Ahrefs，我们把 18 个鲜为人知的使用示例放在一起，可以立即增强你的 SEO 工作。内容1. 浏览每个国家最受欢迎的搜索词你是否想知道全世界的人在搜索什么？在 Ahrefs Keywords Explorer（关键词分析）中运行一个空的搜索，可以获得 200 多个国家和地区的 192 亿个关键词。仅美国的关键词数据库就有约 45 亿个关键词（是整个行业中最大的一个）。从这里，你可以使用几个过滤器，在几秒钟内找到高流量、低竞争的关键词。例如，让我们用以下过滤器这些来搜索话题：Keyword Difficulty（关键词难度）：最大 20Search volume（搜索量）：每月 5000 到 1,0000 之间，Word count（单词计数）：最多 3 个单词一旦我们这样做了，我们的名单就会缩小到 ~19,8000 个有利可图的关键词。你可以对你的目标国家进行重复的操作。2. 了解你是否可以用一个页面锁定多个关键词比方说，你有以下关键词：它们似乎是同一个主题。但你怎么知道你是应该用一个页面来针对它们，还是分别创建单独的页面？我们可以通过检查谷歌是否对类似的搜索结果进行排名来了解。有两个简单的方法可以看到他们的 SERP 的重叠情况：A. 把关键词放在 Keywords Explorer（关键词分析）中，然后转到 Traffic share by pages（按页面划分的流量份额）报告。B. 使用 SERP overview（SERP概览）下的 SERP comparison（SERP 比较）工具。看起来，这两个关键词的排名靠前的页面几乎是相同的（7/10 的共同结果）。我们的 SERP similarity score（SERP 相似度得分）也表明了这一点。这可能意味着，谷歌将 “whipped coffee recipe” 是 “whipped coffee” 的一个子话题。这意味着你有可能在一个页面上可以同时获得两个关键词的排名。3. 监测你的竞争对手发布内容的速度如果你的竞争对手经常发布大量的内容，你可能很难与他们竞争。你可以通过使用 Site Explorer（网站分析）中的 Top pages（热门页面）报告来了解情况，该报告显示了在前 100 名中至少有一个关键词排名的页面。首先，（1）过滤出新创建的页面，然后（2）使用比较模式，将当前的排名页面与三个月前的页面进行比较。通过遵循以上步骤，看起来我们的内容作家在过去三个月中为 Ahrefs 博客创建了200多个页面。你也可以考虑以此为论据，要求提高预算，建立一个更大的内容团队。4. 寻找高质量的反向链接如果你是一个链接建设者，你的主要战略之一可能是对你的竞争对手的链接建设策略进行反向分析。与其翻阅你的竞争对手的每一个反向链接，你可以通过按域名流量过滤反向链接来获得更快的效果。这会让你得到更高质量的反向链接。例如，有 760 个链接指向关键词 “seo tools” 的第一名结果 HubSpot：我们有一个针对同一主题的页面，排名第 3。如果我们想在谷歌上获得更高的排名，我们可以优先考虑我们的链接建设工作，只与每月至少有 5000 次搜索访问的网站联系。这给了我们一个有 90 个网站的名单列表。5. 寻找可作为嘉宾的播客播客是在你的行业中获取性反向链接、并建立权威性的一个好方法。要寻找潜在的可接受采访的播客，请输入你所在行业的熟知播客采访者的 Twitter 网址。我们使用 Twitter 资料，因为主人通常会链接到客人的社交账户。例如，Rand Fishkin 是一位受欢迎的营销人员和企业家，他曾在许多播客中出现过。因此，我将他的Twitter 个人资料 URL 粘贴到 Site Explorer（网站分析）中，然后前往 Backlinks（反向链接）报告。要缩小只针对播客的范围，可以设置一个过滤器，以显示包含 “episode” 或 “podcast” 等词的 referring page titles（引用页面标题）。于是，我们找到了 160 多个播客！对你所在行业的其他定期播客采访者重复这一做法，并找到大量的播客来推销自己。6. 寻找资源页面由于其简单性和可扩展性，资源页链接建设仍然是最受欢迎的链接建设策略之一。该策略就是找到有用的行业资源的网页，并从中获得反向链接。还有什么比看看你的竞争对手有哪些资源页面的链接更好的方法来找到它们呢？例如，让我们在 Backlinks（反向链接）报告中检查 moz.com 的反向链接情况。但这一次，我将过滤出包含 “resources.html “和 “resources.php” 的 referring page URLs（引用页面 URL）。在这里，我们找到了 250 个链接；我们有可能与他们的网站所有者联系，要求他们将 Ahrefs 也作为一种资源。延伸阅读资源链接建设： 你唯一需要的指南7. 发现你的竞争对手的大部分搜索流量来自哪里你可以知道哪些页面（产品、类别、工具等）为你的竞争对手带来最多的自然流量。使用 Overview 2.0（概览 2.0） 下的 “Organic pages by traffic（按流量划分的自然网页） ” 来查看按自然搜索流量分布的网页。例如，有六个页面几乎占了来到 Ahrefs 博客的 25% 的流量。如果你是一个直接的竞争对手，你有可能与我们竞争这些页面的排名。8. 寻找高流量潜力、低竞争话题具有高流量潜力、低竞争话题是每个内容营销者的梦想（特别是那些在饱和市场的内容营销者）。但你如何才能发现这种机会呢？只要打开 Ahrefs Content Explorer（内容分析），搜索一个广泛的主题，如 “backpacking”，并应用这两个过滤器：Referring domains（引用域）: 最大为 5Page traffic（页面流量）：至少 1000这给了我一个相关页面的列表，这些页面获得了大量的自然流量，并且容易获得排名。从这里，你可以进一步挖掘可以驱动自然流量的关键词，并填补你未来几个月的内容计划。Tip 你也可以通过进入 Site Explorer（网站分析）的 Top pages（热门页面）报告，并将最大 KD 过滤器设置为 20，来找到具有高流量潜力、低竞争的关键词。9. 寻找可以谷歌上的排名视频类话题为了让你的视频获得更多的浏览量，并提高其在谷歌上的排名，关键是要瞄准有视频意图的话题。如果谷歌为某个特定的搜索结果中显示视频，这意味着搜索者更喜欢观看视频而不是阅读。要找到这样的主题，请打开 Content Explorer（内容分析）并粘贴以下搜索：site:youtube.com inurl:watch title:[你的话题]我们用 “makeup” 来进行演示。按照 Page traffic（页面流量）对页面进行排序，找到具有流量潜力的视频话题。小提示 密切关注页面流量数字，因为其中一些数字可能被缓存了。在这种情况下，请查看自然流量趋势，以检查流量在较长时期（6个月以上）的一致性。剩下的就是检查该页面参与排名的关键词，以获得页面和视频优化的灵感。10. 获得内部链接建议大多数 SEO 人员都会忽略内部链接，没有意识到这是一个多么有价值的策略。也许，在众多的好处中，它最明显的好处——帮助谷歌发现你的网页、到传递链接权重——这些都是你自己可以控制的。寻找潜在的内部链接机会是很耗时的。如果能自动获得内部链接建议，那不是很好吗？所以，你可以通过 Ahrefs Site Audit（网站诊断）来实现。运行网站抓取，在 Internal link opportunities（内部链接机会）报告将通过获取你的排名页面的前 10 个关键词来确定内部链接机会——然后在你的其他页面上找到这些关键词的提及。报告中会包含重要的关键词指标和关键词背景。如果页面之间已经存在链接，我们将不会建议建立链接。延伸阅读SEO的内部链接： 一个可操作的指南为什么你应该优先考虑内部链接建设11. 发现本地的引用机会改善你的地域 SEO 的一个好做法是获得本地网站的引用。例如在热门的目录网站中提到你的企业名称、地址或电话号码，帮助搜索者快速在网上找到你的企业。要找到它们，可以通过你的竞争对手网站来找到这些本地目录网站。假设我们在多伦多拥有一家水暖公司。如果你已经知道你的竞争对手（如果不知道，请在谷歌上搜索你的利基市场，然后是你居住的城市），进入 Site Explorer（网站分析），打开 Link Intersect（交集外链分析）报告。将你的竞争对手的网站粘贴在顶部，你的网站粘贴在底部。接下来将目标模式设置为 URL 模式，因为引用链接通常是指向主页的。这将向你展示所有链接到你的竞争对手址，但没有链接到你的网址的网站。通常情况下，链接到的目标越多，就越有可能是一个商业目录。正如 website.ca 的情况一样。之后，你就可以主动联系它们了。延伸阅读如何获取本地网站引用机会（完整指南）地域SEO： 完整指南12. 寻找错过的关键词机会错过的关键词机会是指那些你的竞争对手有排名，但你没有的关键词。为了增加你在搜索结果中排名靠前的机会，你需要缩小你和排名靠前的网页（也就是你的自然搜索竞争对手）之间的这种内容差距。要做到这一点，打开Ahrefs Keywords Explorer（关键词分析），搜索一个你知道你没有排在前三名的关键词。对我们来说，就是 “affiliate marketing”，正如下面的 SERP overview（SERP 概览）中所看到的。接下来，选择所有与你的网页相关的排名靠前的网页（意味着它们服务于相同的搜索意图），并将它们放入 Content Gap tool（内容差距机会）工具中。这应该会给你一个关键词列表，你的网站应该在这些关键词中获得排名。而我们知道了约 1550 个关键词，可以在我们的联盟营销文章中进行定位13. 分析哪些目录带来了最多的自然流量Site Explorer（网站分析）下的 Site structure（网站结构）报告将一个网站的结构分解成树状格式，以帮助你获得有用的发现。例如，我们的三个翻译博客（意大利语、德语、西班牙语）产生的流量几乎与我们的顶级英语博客文章一样多。你可以更进一步，选择 Columns（列）的下拉菜单，选择某些特定指标，如付费指标，可以让你进一步的了解更多的数据。让我们 monday.com 来进行演示。如果我们将付费指标与三个月前的指标进行比较，我们实际上可以监测每个目录的广告支出随时间的变化。看起来大部分的广告支出都流向了博客，特别是 “task management” 目录。14. 寻找精选摘要的机会在不建立反向链接的情况下，走捷径到达谷歌顶部位置的最好方法是寻找获取精选摘要的机会。为了增加你对它们的排名机会，打开 Site Explorer（网站分析）下的 Organic keywords（自然关键词）报告，过滤排名 2–8 位的自然关键词。然后应用过滤器 “SERP features（SERP特征）：where target doesn’t rank for（目标没有排名）”。对于Ahrefs 博客来说，有 4803 个关键词有很高的机会获得精选摘要的排名——相比于直接排名第一，精选摘要的位置似乎更加容易获取。延伸阅读谷歌精选摘要： 为了获取它们你需要知道所有信息15. 揭示一个产品的分销信息如果你正在寻找分销联盟，这是为你准备的。当你知道一个产品的分销联盟网址时，这个方法效果最好。大多数分销链接都有一个”？”，后面是供应商的ID，可能是也可能是不重复的。如果你已经知道了，（1）在将其 URL 重复部分粘贴到 Site Explorer（网站分析）中，（2）进入Backlinks（反向链接）报告，（3）按 Page traffic（页面流量）排序。作为回报，你会得到某个产品的顶级 SEO 分销商。如果你是这个产品的竞争者，你可能会通过与他们合作来增加你的影响力。16. 找到几乎没有引用域的页面参与排名的关键词如果你能发现那些排名在前五名或前十名的异常关键词，而这个页面的引用域却很少，那该怎么办？这意味着，如果你已经有一个权威性较高的网站，你可以（在理论上）轻易地超过他们的排名。要找到这样的链接，请在 Keywords Explorer（关键词分析）中搜索一个具有高商业潜力的关键词，然后打开 Matching terms（有相同的词的）报告。这里我选择 “affiliate marketing” 进行演示。过滤器最低 DR 设置为：“前 5 名中最大为50”通过这些过滤器，我们专门寻找那些在网站权重较低的情况下仍在竞争性关键词上排名的异常网页。例如，我们发现 breezy.io 的一篇列表文章在 “affiliate marketing” 方面排名第一，但只有 11 个引用域，DR 只有 38。17. 用图像建立链接如果你为你的网站创建了独特的图像（图表、图形、信息图表），人们有可能会链接到它们，而不是链接到它们最初出现的页面。要找这些图片链接的引用，请将您的网站放入 Site Explorer（网站分析），然后前往 Backlinks（反向链接）报告。然后在 “Target URL（目标URL）” 过滤器中搜索 .PNG 或 .JPG。延伸阅读图片SEO： 12个可操作的技巧（获取更多自然流量）18. 寻找失效的链接建设机会失效链接建设包括找到一个有大量反向链接的死页面，并要求那些链接到该页面的人将链接换到你网站的另外一个页面。要把这一战术付诸实施：检查 Site Explorer（网站分析）下的 Best by links（按反链数量排序）报告，查看你的竞争对手的网站将 “HTTP代码” 过滤器设置为 404未找到按 Referring domains（引用域）数量进行排序例如，如果你是 Canva（设计工具）的竞争对手，你有可能为 “zoom virtual backgrounds” 或 “resumes” 创建一个更好的资源。在你创建了内容之后，你可以要求失效页面的链接者转而链接到你的页面。延伸阅读失效链接建设： 完整指南最后毫无疑问，你可以用 Ahrefs 做到更多事情。本文中提及的使用案例应该可以帮助你以更少的精力完成你的 SEO 任务。你有更多的 Ahrefs 使用技巧吗？可以在 Twitter 上告诉我 。😊译者，Park Cheng，歪猫出海创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Andrei Țiț Andrei Țiț 是 Ahrefs 的一名产品营销人员。他在不同的 SaaS 公司从事产品营销超过6年，专门从事内容营销和短视频的工作。",
  "headers": [
    {
      "level": "H1",
      "text": "18个鲜为人知（但强大的）Ahrefs 使用技巧"
    },
    {
      "level": "H2",
      "text": "1. 浏览每个国家最受欢迎的搜索词"
    },
    {
      "level": "H2",
      "text": "2. 了解你是否可以用一个页面锁定多个关键词"
    },
    {
      "level": "H2",
      "text": "3. 监测你的竞争对手发布内容的速度"
    },
    {
      "level": "H2",
      "text": "4. 寻找高质量的反向链接"
    },
    {
      "level": "H2",
      "text": "5. 寻找可作为嘉宾的播客"
    },
    {
      "level": "H2",
      "text": "6. 寻找资源页面"
    },
    {
      "level": "H2",
      "text": "7. 发现你的竞争对手的大部分搜索流量来自哪里"
    },
    {
      "level": "H2",
      "text": "8. 寻找高流量潜力、低竞争话题"
    },
    {
      "level": "H2",
      "text": "9. 寻找可以谷歌上的排名视频类话题"
    },
    {
      "level": "H2",
      "text": "10. 获得内部链接建议"
    },
    {
      "level": "H2",
      "text": "11. 发现本地的引用机会"
    },
    {
      "level": "H2",
      "text": "12. 寻找错过的关键词机会"
    },
    {
      "level": "H2",
      "text": "13. 分析哪些目录带来了最多的自然流量"
    },
    {
      "level": "H2",
      "text": "14. 寻找精选摘要的机会"
    },
    {
      "level": "H2",
      "text": "15. 揭示一个产品的分销信息"
    },
    {
      "level": "H2",
      "text": "16. 找到几乎没有引用域的页面参与排名的关键词"
    },
    {
      "level": "H2",
      "text": "17. 用图像建立链接"
    },
    {
      "level": "H2",
      "text": "18. 寻找失效的链接建设机会"
    },
    {
      "level": "H2",
      "text": "最后"
    }
  ],
  "author": "Andrei Țiț"
}