{
  "url": "https://ahrefs.com/blog/zh/best-job-boards-for-marketers/",
  "slug": "best-job-boards-for-marketers",
  "title": "10个最适合营销人员的工作公告板(+ 奖金建议)",
  "description": "哪些招聘板真的值得你花时间？不用担心，我们已经挑出了最好的市场营销招聘广告版的总结。",
  "content": "Rebecca Liew 内容营销人员和作家。 沉迷于文字、文具和步行探索新地方。 内容 市场营销工作公告板有很多，但哪些是值得你花时间的？为了回答这个问题，我们向Twitter征求了一些建议，并将我们个人使用过的添加到其中，并花了一些时间对每个建议进行了调查。以下是我们在最佳市场营销职位招聘网站的总结中得出的结论:Hey MarketersDGMG JobsRemotiveDynamite JobsAngelListWe Work Remotely (WWR)JobspressoDemand CurveRemotersProblogger1. Hey Marketers谁是受众：远程营销人员网站：https://heymarketers.com/ 每篇帖子发布花费：99美金/月Hey Marketers专注于永久性的远程营销角色ーー我们可以保证它的可靠性，因为我们已经在这里列出了我们自己的工作。在最近的一次统计中，我们估计平台上有超过1300个空缺职位。在营销类别中，你可以找到包括数字营销、内容策略、活动管理以及文案等方面的角色。也许这个网站最大的优点就是列表的质量，其中许多来自已经建立和正在崛起的科技公司，如 HubSpot，Skillshare，MailChimp，Zoom，Clubhouse，当然还有 Ahrefs。在 Hey Markers上，列出一份工作是一个轻松的过程。与你的电子邮件一起分享一个现有招聘信息的 URL，支付你的费用，这个地方在30天内属于你，当然，这需要得到管理员的批准。没有必要创建一个新的帖子，因为所有的信息将从您提供的链接中提取出来。2. DGMG Jobs谁是受众：B2B营销人员网站：https://dgmgjobs.com/ (为雇主)列出职位的费用: 常规的$50 30天; 特色的$150 30天DGMG 工作为所有经验层面的B2B营销人员，提供全日制和远程角色的混合。它背后的大脑是Dave Gerhardt，经验丰富的营销人员背后的经验丰富的营销集团（DGMG）。该集团将在线大学、 Facebook 付费社区和播客系列整合在一起。在撰写本文时，主要来自大多数美国公司（包括Shopify和Bain＆Company！）跨越产品营销，需求生成和客户关系管理营销的50多个开放的角色。我们也推荐关注 Gerhardt 的 Twitter，以获得关于 DGMG Jobs 的频繁更新。Job hunting this weekend? Find a new marketing role via my job board DGMG Jobs. There were 10 new featured jobs posted last week alone and 70+ open roles from the last 30 days. View them all (and recruiters can post jobs too) at https://t.co/wfLpl5K0iW pic.twitter.com/t9mU8bWmgI— Dave Gerhardt (@davegerhardt) September 4, 2021 推文译：这个周末找工作? 通过我的工作板，找到一个新的市场营销角色。仅上周一周就有10个新的特色工作，过去30天有70多个开放角色。所有这些都可以在 http://dgmgjobs.com 招聘网站上，查看(招聘人员也可以发布招聘信息)我们发现最有趣的是，工作委员会开始作为一个陷入困境，每周汇编谷歌文档中的手册列表 — Gerhardt在Gerhardt看到的机会，并作为DGMG工作重新启动。列出一项工作可以通过四个简单的步骤来完成: 选择您的计划(常规的或升级的) ，创建您的列表，为其支付费用，并选择是否将其升级为额外的100美元。如果你这么做了，它将会在30天内出现在你的主页上，并且会在DGMG的社交媒体账号上，在它的新闻通讯上，在它的 Facebook 社区上收到推广。3. Remotive谁是受众：远程营销人员和技术专家网站：https://remotive.io/remote-jobs每篇工作帖子发布花费：398美金/月当创始人鲁道夫•杜特尔(Rodolphe dutel)——曾在 Buffer.com 和谷歌(google)任职——担任全职的远程角色时，他试图通过创建 Remotive 来简化求职过程。虽然它不是一个以市场营销为主的求职板，但是你可以通过15个功能来筛选你的搜索结果，包括市场营销、产品、销售、设计和软件开发。每个招聘信息都会预先显示出应聘者的首选地点，并可以选择隐藏只在美国招聘的职位，这样你就不必点击列表查看更多细节了。不过，我们确实希望有一个过滤器可以根据位置进行搜索。除了工作公告板，还有一个付费Slack 社区，你可以随时了解最新趋势。对于那些希望创建一个工作列表，只需填写你的公司和工作描述的细节，然后支付。还有一些选择可以提高你的广告价格(从每份广告49美元起) ，如果你迫切需要一个跨多个类别的角色，这可能是个好主意，因为上次检查中有将近2000份广告。另外，如果 y Combinator、 Gitbook 和 Square 这样的公司正在使用这个软件，那么他们肯定是在做正确的事。4. Dynamite Jobs 谁是受众：远程营销人员网站：https://www.dynamitejobs.com/ 每篇工作帖子发布花费：99美金/月成立于2017年，Dynamite的重点是完全远程的角色，有很多过滤器，以缩小你的选择，包括工资范围，时区，经验，行业和类别。发布招聘信息相当简单: 建立一个包含基本信息的账户，包括你的公司名称和电子邮件地址，然后开始你的第一份工作列表。作为一个雇主，你也可以访问Dynamite超过30000名候选人的数据库，并邀请他们申请开放的职位。另外，如果你创建了一个可选的用户档案，你就有机会在每周的新闻简报中列出你的工作清单，突出介绍本周十大工作。5. AngelList谁是受众：营销人员或者任何想要加入创业公司的人网站：https://angel.co/jobs每篇工作帖子发布花费：免费AngelList 是一家总部位于美国的网站，致力于从天使投资者和有兴趣为这些创业公司工作的求职者那里筹集资金。这一领域的关注使得就业板如此独特ーー也足以吸引像 Twitch、 Stripe 和 Spotify 这样的知名公司上市。有趣的是，这是我们名单上唯一要求雇主预先说明薪资和股权范围的面板。它还允许求职者根据投资阶段(种子期、 a 轮等)以及他们是否能够担保签证为公司过滤。要申请列出的大约13万个职位中的一部分，你首先必须建立你的个人资料，包括你目前的职位描述和简历。对于那些可能只是浏览或者路过的用户来说，这是一种威慑，但是可以说这是值得去访问黑板的。请记住，AngelList 的竞争尤其激烈; 超过200万名候选人在该网站注册了账户。6. We Work Remotely (WWR)谁是受众：远程营销人员网站：https://weworkremotely.com/每篇工作帖子发布花费：299美金/月我们将远程（WWR）声称回到世界上最大的遥控工作社区。虽然我们不能保证这一点，但工作板已被科技巨头使用，包括Basecamp，Amazon，Google和Invision。求职者可以通过标题，关键字，位置，公司或工作类别缩小搜索。当我们被销售和营销搜查时，结果跨越内容营销，绩效营销，社交媒体，电子邮件外联和SEO的类别。您还可以选择订阅浏览器中的作业通知。然而，有关更及时的警报，我们建议加入Slack社区，这是近9,000名成员。有价值的两个频道是＃12-wwr-new-jobs和＃13-resume审查，虽然前者不是按类别排序。对于雇主来说，列出一份工作是一个简单的三步过程: 填写工作和公司描述，预览你的列表，然后付款。7. Jobspresso谁是受众：远程营销人员以及任何技术人员网站：https://jobspresso.co/remote-marketing-jobs/每篇工作帖子发布花费：299美金/90天超过10万的远程工作者使用 jobspresso—- 为了进一步强调其可信度，该网站还登上了《公司》、《福布斯》和《商业内幕。虽然平台上的大多数工作都是远程的，但许多列表显示候选人的首选地点，通常是在美国或加拿大。最后，我们发现了300多个营销职位，涵盖了数字营销、绩效营销和社区管理。每日更新的工作信息也会发布在 Twitter 上，不过这些信息没有分类，所以你必须用敏锐的眼光来看待。在招聘方面，我们喜欢 Jobspresso 鼓励雇主，首先考虑他们公司的文化是否支持员工远程工作的能力。如果你对所提供的服务不满意，你甚至可以在第一次招聘后的30天内得到退款保证。这对我们来说是一个主要的优势。8. Demand Curve谁是受众：增长营销人员（远程和现职）网站：https://www.demandcurve.com/jobs每篇工作帖子发布花费：199美金/月我们最近将这家 y combinator 支持的公司列入了我们最佳在线营销社区的总结中，不过，对于其招聘板块来说，Demand Curve 也值得一试。专门为成长型营销人员创建，你会发现包括 SimilarWeb，Ahrefs (是的，我们!)在内的科技公司的列表，以及许多其他。角色跨越数字营销、成长、 PPC 和 SEO，以及用户体验写作。有相当多的过滤器可以缩小你的搜索范围: 职位名称、职能、公司地点、公司规模等等。如果你只是随便看看而不是实际上去找工作，那么可以考虑加入需求曲线的免费私人 Slack 组织，该组织的 #就业 渠道每天都会更新。从雇主的角度来看，我们发现添加工作列表是一种无痛苦的体验，不超过十分钟。只要创建你的列表，支付，你的职位将被添加到工作公告板的顶部，并通过每周的工作通讯发出，只要它仍然活跃。我们还喜欢的是，你可以取消订阅，或者在付费期间将已发布的工作列表与其他角色交换——只需用电子邮件发送请求即可。9. Remoters谁是受众: 远程营销人员，撰稿人和SEO专家 Website: https://remoters.net/jobs/每篇工作帖子发布花费: 免费在 Twitter 上拥有超过10000个追随者，在其平台上拥有大约70000个用户，Remoters 通过专注于将远程工作者与各类工作联系起来，建立了一批追随者，这些工作包括搜索引擎优化、内容和文案、数字和产。“工作技能”筛选器是一个简单的选择ーー你可以根据具体技能(如项目管理和内容策略)对工作进行分类。甚至还有一个专门针对 Ahrefs 的复选框，尽管我们建议你从浏览一个工作类别开始。从概览页面，你能够收集到一个角色所需的预期技能、薪资范围和申请截止日期。这些都是小而精的技巧，对候选人来说会有很大的不同。 作为一个雇主，发布一份工作是免费的，就像在 AngelList 和 LinkedIn 上一样(后者获得了荣誉推荐)。然而，它需要48小时来审查提交的文件，并且不能保证发表。然而，作为对 Remoters 有利的信心投票，Shopify、 HubSpot 和 Forbes 等网站都在使用这个平台。10. ProBlogger谁是受众: 远程文案、博客和 SEO 作者网站: https://problogger.com/jobs/每篇工作帖子发布花费: 75美金/15天(标准计划)；150美金/15天 (特征计划)Problogger的职位板块，是另一个我们可以使用的工具。我们团队的一名成员（Sam，你可能从 Ahrefs 的 YouTube 频道认出他）已经使用了六年多。在我们最近的职位发布中，我们收到了超过280个质量的应用程序，这可能与每个工作列表分享到Twitter上的超过220k粉丝。NEW BLOGGER JOB: Long-term Freelance Writers Wanted for a Home Improvement Website https://t.co/i1VkUkPTLg #Writers #Bloggers #Job #Jobs #Hiring— Darren Rowse (@problogger) September 19, 2021推文译：新的博主工作：长期自由作家想要一个家庭改进网站。对于通才和专家来说，这也是一个很好的平台。例如，我们发现一些帖子呼吁那些专长于技术、金融技术和个人理财的作家，还有一些帖子呼吁内容作家从事更广泛的生活方式话题，从健康和美容到电子商务产品列表。要在 Problogger 上发布一个工作列表，用一些基本信息(公司名称、地点和电子邮件地址)建立你的个人资料，然后继续创建你的第一个职位。这是一个无缝的过程，通常需要我们不到五分钟。额外奖励: 荣誉奖以下也制作了候选名单。虽然有用的虽然有用的，但这些尊贵的提及不是官方工作面板，受到位置的限制，或者没有足够的营销。LinkedIn如果我们不把 LinkedIn 包括在这个综述中，那就太失职了。该平台提供几乎所有你能想到的公司的职位空缺，是少数几家(与 AngelList 并列)提供免费招聘信息的公司之一。如果你已经在另一个网站上找到了工作列表，你可以通过分享网址直接链接它，就像 Hey marketter 一样。CultJobs 这个工作板主要包括实习或初级职位横跨市场和公关，设计和用户体验，以及客户服务。对于应届毕业生来说，这是一个很好的起点，尽管所有职位都在新加坡。最后的想法除了寻找工作面板或者进一步你的专业领域，考虑获得的技能，这个真实Ahrefs的Si Quan做的，在他的营销生涯中茁壮成长的技能。对于招聘者来说，记住有一个技巧可以起草一份扎实的工作描述。我们正好有一个你需要的 SEO 专家的模板ーー它的框架是多功能的，可以适用于各种工作列表。不要忘记: 你不仅仅是在招聘。你希望吸引人才加入你的公司，同时对这个职位的期望和要求保持透明。有问题？在Twitter上联系我。译者：John Zhao, 西品东来创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Rebecca Liew 内容营销人员和作家。 沉迷于文字、文具和步行探索新地方。",
  "headers": [
    {
      "level": "H1",
      "text": "10个最适合营销人员的工作公告板(+ 奖金建议)"
    },
    {
      "level": "H2",
      "text": "1. Hey Marketers"
    },
    {
      "level": "H2",
      "text": "2. DGMG Jobs"
    },
    {
      "level": "H2",
      "text": "3. Remotive"
    },
    {
      "level": "H2",
      "text": "4. Dynamite Jobs"
    },
    {
      "level": "H2",
      "text": "5. AngelList"
    },
    {
      "level": "H2",
      "text": "6. We Work Remotely (WWR)"
    },
    {
      "level": "H2",
      "text": "7. Jobspresso"
    },
    {
      "level": "H2",
      "text": "8. Demand Curve"
    },
    {
      "level": "H2",
      "text": "9. Remoters"
    },
    {
      "level": "H2",
      "text": "10. ProBlogger"
    },
    {
      "level": "H2",
      "text": "额外奖励: 荣誉奖"
    },
    {
      "level": "H3",
      "text": "LinkedIn"
    },
    {
      "level": "H3",
      "text": "CultJobs"
    },
    {
      "level": "H2",
      "text": "最后的想法"
    }
  ],
  "author": "Rebecca Liew"
}