{
  "url": "https://ahrefs.com/blog/zh/black-hat-seo-tactics/",
  "slug": "black-hat-seo-tactics",
  "title": "2021年要避免的 6 种危险的黑帽 SEO 策略（及白帽的替代方案）",
  "description": "黑帽 SEO 策略不值得冒险。远离这六种黑帽 SEO 策略，尝试使用他们的白帽替代方案。",
  "content": "Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。 内容 SEO是一场激烈的零和博弈。这就是为什么一些企业主会采用黑帽策略从 SERP 顶部去推翻竞争对手的排名。虽然有一些黑帽 SEO 策略你显然不应该使用，例如黑客攻击（因为这是非法的）。但其他策略似乎风险较小。 尽管如此，即使这些策略看上去有些价值，但是，对于合法企业来说也绝不是一个好主意——所以你应该不惜一切代价避免它们。在本文中，我们将介绍六种常见的黑帽 SEO 策略以及其白帽的替代方法： 购买链接关键词堆砌垃圾博客评论内容机器转义负面 SEO垃圾富文本标记1. 购买链接购买链接意味着支付另一个网站的费用，来链接到你的网站。这个费用可以是金钱、商品或服务。购买链接在很多层面上都是不好的： 这违反了 Google 的网站管理员指南。 谷歌在这里解释了这一点。 这可能会导致 Google 的惩罚。 如果 Google 发现你售卖或购买链接，它有可能会惩罚你的网站。 一些 SEO 人员可能会质疑谷歌是否能够识别链接，但事实是他们在这方面做得越来越好。 虽然 Google 可能无法识别所有链接，但是购买链接不会有任何效果，甚至有可能导致网站被降权。 付费链接非常贵。 根据我们 2018 年的案例研究，平均为 361.44 美元。小提示.购买链接并不违法。许多人也会说这也并非是不道德的。因此，尽管我们不建议合法企业这样做，但如果您了解并愿意承担相关风险，则可以尝试这样做。应该怎么做？链接外展。在这里你可以创建有价值的资源，然后联系你想要链接的网站的所有者，并为给他们提供一个不得不链接到你网站的理由。如果这听起来很容易，事实并非如此。从链接外展中获得成果还是比较困难的。只有当你拥有丰富的资源、广阔的前景和出色的外展电子邮件时，它才有可能发挥作用。一个比较好的方法是使用锦上添花的技巧：创建一个有价值的资源。找到你的资源可以作为补充的页面。向网站所有者推销你的资源。让我们看一个例子……假设你已经创建了一份精选的简历模板列表。 这是一种宝贵的资源，因此下一步是找到可以将你的资源作为补充的页面。 在这种情况下，这可能是关于 “如何写简历” 的文章。 毕竟，一份写简历的指南很好，但能提供一份简历模板的内容可以说更好。你可以在 Content Explorer（内容分析） 中轻松找到这些页面。这是一个可搜索的、并包含数十亿网页的数据库。 方法如下：进入 Content Explorer（内容分析）搜索 title:“话题”-“你的页面是关于什么的”打开 One page per domain（一个域名一个页面）选项例如，如果你搜索 title:“how to write a resume” -“templates”，你会看到 2000 多篇关于写简历的帖子，但没有提到任何关于模板的内容：你可以直接访问这些网站并解释：你看到了他们写简历的指南。你注意到他们没有包含任何让人们直接使用的模板。你最近整理了一份网络上最好的简历模板的列表。你的资源很有价值，可以加入到他们的网站。虽然不是每个人都会链接到你，但有大部分人会（只要你推销的有意义）。2. 关键词堆砌关键词堆砌是在你的内容中重复相同的关键词（或类似的短语）以操纵排名的做法。早在 90 年代，这种策略曾经奏效。 但是现在不再有效。关键词堆砌是一种非常糟糕的 SEO 做法，因为： 这让你的页面看起来不自然。 在你的内容中塞入尽可能多的关键词会使你的写作听起来既机械又荒谬。 用户可能会直接关闭你的站点。 这可能会导致 Google 处罚。Google表示 “用关键词或数字填充页面 […] 会损害你网站的排名”，所以除非你希望排名下降，否则不要这么做。应该怎么做？关键词堆砌的替代方案是更全面的内容。 你可以通过两种方式创建它。首先，精心撰写能涵盖话题的深入内容。 你会很自然的使用该话题的大多数表达方式和长尾关键词。其次，尝试涵盖搜索者可能想要和期望看到的子话题。这两件事都有助于你的内容排名更高，因为 Google 不仅仅根据提及关键词的次数来判断内容好坏。 它还查看页面是否包含其他相关内容和关键词：有很多方法可以找到要涵盖的潜在子话题，例如：在目标关键词的排名靠前的页面中寻找常见的副标题。与你的团队集思广益，收集相关话题。查看 SERP 上的 “people also ask” 部分。但这些方法是需要消耗人力的。最简单、最有效的方法是对你的页面进行 content gap（内容差距机会）分析。 它显示了排名靠前的页面参与排名的关键词，其中一些往往代表了它们涉及的子话题。这里是怎么做：在 Site Explorer（网站分析）输入你的 URL.在左侧菜单中，点击 Content Gap（内容差距机会）。在输入字段中放入 2–3 个关键词排名靠前的 URL。运行搜索，并查找能够代表子话题的关键词。例如，如果我们针对我们的作客博客指南这么操作，我们会看到几个与 “guidelines” 相关的关键词： 如果我们查看其中一个排名靠前的页面，我们很快就会发现这些关键词都是有关于网站的作客博客须知的：我们在文章中省略了这一点。 因此，可能值得添加这一部分的内容，这样就可以做出更全面的文章。3. 垃圾博客评论博客垃圾评论是指你在博客帖子上发布不相关评论的地方，其唯一目标是获得返回你网站的链接。即使我们忽略这对接收端的站长来说有多烦人，同时这也对 SEO 也不利，因为博客评论链接几乎是 nofollow 的。 这意味着这些链接极不可能帮助你排名。 应该怎么做？在高流量的内容上写有用的博客评论。这样不会给你带来很多链接的权重，因为它们仍然是 nofollow 的。 但是，人们更有可能阅读有价值、且有用的评论，并点击进入你的网站。 这不会带来直接的 SEO 收益，但人们可能会分享你的内容并最终链接到你——因此它可以带来间接的 SEO 提升。 下面就是利用 Content Explorer（内容分析） 找到适合评论的页面：输入相关话题。将搜索模式切换到 In title（标题中包含）。点击搜索添加 Page traffic（页面流量）筛选，并设置为最小 100。 打开 Exclude homepages（排除首页）选项。在结果中查找带有评论部分的博客文章，并在其中添加有价值的评论。例如，假设你是 dropshipping 专家。 你可以在 Content Explorer（内容分析）中搜索 “make money online” 并查看以下结果：高亮显示的内容有大量的自然流量和许多评论：这篇文章就是非常适合用来做评论的，因为它可以为你的网站带来流量。4. 内容机器转义内容机器转义是你获取一段内容并重写它以创建许多“新”内容的地方。使用这种方法的站长是很少在他们的博客上使用的。 相反，他们会用它来创建许多 “独特” 的作客博客的内容，以在多个站点上发布并快速轻松地构建外链资源。内容机器转义对 SEO 不利，因为： 机器转义的内容通常听起来不自然。因此只有低质量的网站才有可能发布机器转义的内容。 只会获得低质量的外链。 因为只有低质量的网站才会发布此类内容，所以你从非原创文章中获得的 SEO 链接价值极少。应该怎么做？站在不同的角度，创建独特的变体内容。例如，假设你写了一篇题为 “The future of link building” (未来链接建设) 的内容。你可以轻松更改该内容的视角，以创建多个独特且有价值的内容： 这需要消耗很多时间么？当然。但是因为你在原始内容上做了大部分的研究和工作，所以相比原有的内容来说，做拓展和衍生还是比较轻松的。更好的是，改变视角可以帮助你从更广泛的网站获得更多的外链。想一想：“The future of link building for startups” 几乎不会吸引中小企业的网站的链接，但一篇关于 “the future of link building for small businesses” 的内容就可以吸引他们的注意力。你也可以从相反的角度处理同一话题。 例如，假设你写了一篇关于 “X Benefits Of Link Building For Startups” 的文章。 你可以修改脚本并为另一个网站写一篇题为 “X Link Building Mistakes Startups Make” 的内容。学更多: 作客博客SEO5. 负面 SEO负面 SEO 是一种企图破坏竞争对手网站或网页排名的不正当手段。负面SEO 不好，因为： 这是不道德的，甚至是非法的。 诸如留下负面评论或使用低质量外链轰炸竞争对手的策略是非常不道德的。黑客攻击和其他形式的网络攻击则就是犯罪行为。 几乎是无效的。 常见的负面 SEO 攻击类型几乎无效：例如将低质量的外链指向竞争网站或网页。 谷歌非常擅长识别和排除这些链接。 这只是一个短期的解决方案。 即使负面的 SEO 有效，另一个页面也会很快出现并超过你的低质量页面。应该怎么做？创建真正值得排名的内容，并向 Google 展示这一事实。这说起来容易做起来难，通常有两个关键要素：符合搜索意图获取链接先说搜索意图…搜索意图是搜索背后的原因。 除非你的页面符合搜索意图并为搜索者提供他们正在寻找的内容，否则你获得排名的机会微乎其微。你可以通过分析排名靠前的页面的搜索意图3C来确定关键词背后的意图： Content type（内容类型）。大多数排名靠前的结果是博客文章、产品页面、类别页面还是其他内容？跟随主流类型。 Content format（内容格式）。大多数排名靠前的结果是列表、操作方法、教程、意见文章还是其他内容？跟随主流格式。 Content angle（内容角度）。 排名靠前的结果是否有共同的角度，例如 “适合初学者” 或“2021年”？跟随主流的角度。至于外链，你需要它们——如果你想对任何有竞争的内容进行排名时都需要它。我们知道这一点是因为谷歌说链接是排名前三的因素之一。 我们对超过 10 亿页的研究发现，排名和外链之间也存在明显的正相关性：查看下面的资源，了解有关构建页面链接的更多信息。延伸阅读链接建设初学者入门指南9 个简单的链接构建策略（任何人都可以使用）外链建设案例研究：我们是如何用一则“数据”帖文建设外链的6. 垃圾富文本标记垃圾富文本标记是指你滥用结构化数据来（试图）在 SERP 中获得优势。 垃圾富文本标不好是因为： 这可能会导致 Google 处罚。 谷歌表示，违反其结构化数据指南的页面或网站 “可能会获得较差的排名”。 他们还会对发现包含 “垃圾结构化数据” 的页面进行手动降权操作。 它可能导致富文本标记无效。 富文本标记通常会提高 SERP 中的点击率。 这就是人们想要它们的原因，也是为什么有人会做垃圾富文本标记的原因。 但谷歌表示，如果你违反了他们的结构化标记指南，你的页面或网站可能会被标记为 “不符合谷歌规则的富媒体搜索结果”。 它很少起作用。 如今，谷歌非常擅长发现垃圾内容、以及不相关的结构化数据（与几年前不同）。 因此，你不太可能在 Google 搜索结果中看到基于不相关、或垃圾的富文本标记内容。应该怎么做？遵循 Google 的结构化数据指南，在相关的网页上包含准确的结构化数据。谷歌表示，这有助于他们 “理解页面内容”。遵守规则还会增加你被包含在特殊搜索结果中的机会。查看以下资源，了解有关实施结构化数据、以及赢得富文本标记的更多信息。延伸阅读富文本标记：是什么以及如何获取它？什么是结构化数据？ 为什么要使用它？什么是结构标记？ 如何将其用于 SEO最后黑帽 SEO 策略不值得你去冒险尝试，所以请远离它们。他们可能会让你的网站受到处罚，并损害你的品牌声誉。你最好专注于可行的白帽替代方案。 诚然，我在本指南中建议的战术比黑帽的做法要付出更多的努力。 但好消息是它们肯定会起作用，并能带来持久的效果。有问题吗？在 Twitter 上找我吧。译者，Park Cheng，歪猫出海创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。",
  "headers": [
    {
      "level": "H1",
      "text": "2021年要避免的 6 种危险的黑帽 SEO 策略（及白帽的替代方案)"
    },
    {
      "level": "H2",
      "text": "1. 购买链接"
    },
    {
      "level": "H3",
      "text": "应该怎么做？"
    },
    {
      "level": "H2",
      "text": "2. 关键词堆砌"
    },
    {
      "level": "H3",
      "text": "应该怎么做？"
    },
    {
      "level": "H2",
      "text": "3. 垃圾博客评论"
    },
    {
      "level": "H3",
      "text": "应该怎么做？"
    },
    {
      "level": "H2",
      "text": "4. 内容机器转义"
    },
    {
      "level": "H3",
      "text": "应该怎么做？"
    },
    {
      "level": "H2",
      "text": "5. 负面 SEO"
    },
    {
      "level": "H3",
      "text": "应该怎么做？"
    },
    {
      "level": "H2",
      "text": "6. 垃圾富文本标记"
    },
    {
      "level": "H3",
      "text": "应该怎么做？"
    },
    {
      "level": "H2",
      "text": "最后"
    }
  ],
  "author": "Joshua Hardwick"
}