{
  "url": "https://ahrefs.com/blog/zh/blog-content-strategy/",
  "slug": "blog-content-strategy",
  "title": "7个步骤创建一个成功的博客内容策略",
  "description": "博客内容策略是你对你博客的一个愿景和计划，它应该与你的业务目标和整体内容策略保持一致。",
  "content": "Katy Mrvova Slido 内容主管。狂热的作家和书呆子。在这两者之间，我可能正在学习一门新的语言，或者沉迷于一些与90年代的氛围有关的东西。 内容 除其他事项外，一个好的博客可以:为你的企业带来流量。提高你的品牌和产品的知名度。用你的方式带来新的客户。教育和培养你的客户和潜在客户。帮助你成为你所在领域的思想领袖。我们之所以说“可以”，是因为你首先需要一个无懈可击的博客内容策略来满足所有这些条件。这就是我们今天要讨论的内容。以下是我们将要讨论的内容:什么是博客内容策略？为什么你需要一个博客内容策略？如何创建博客内容策略什么是博客内容策略？博客内容策略是一个你对你博客的愿景和计划。就像商业策略一样，博客策略会为你的博客指明正确的方向，引导你通过博客内容达到你想要的目标。你的博客内容策略应该与你的商业目标和整体 内容策略保持一致。你的商业目标应该是你内容的主要驱动力。为了更好地了解你的博客策略在整体中的位置，这里有一个简单的图表:为什么你需要一个博客内容策略？每天有 超过700万篇博文发表。在我们的研究中，我们发现大多数(90.63%)的网页没有每月的自然流量。完全没有。如果没有一个明确的策略，你可能最终只是为了创造内容而创造博客内容ーー而没有获得任何流量，对你的业务增长也没有任何好处。一个可靠的博客策略将帮助你达到9.37% 的目标。现在，让我们开始创建一个。如何创建博客内容策略这里有一个逐步的指南，帮助你建立一个博客战略，这将帮助你获得更多的流量，你的业务和带来新的客户你的方式。明确你的“为什么”调查你的竞争对手进行全面的关键词研究建立一个内容计划创建你的博客的身份追踪你的成功1.明确你的“为什么”暂时忘记衡量标准，想想大局。你写博客的目的是什么？为什么你的博客要存在？你对这些问题的回答构成了你博客内容策略的本质，所以试着用一句话来表达，让它引导你所有的博客努力。例如，在Slido，我们的首要目标是成为那些希望运行更好会议的人的头号资源。如果你正在努力寻找你的博客的目的，这个简单的“帮助‑按”框架(灵感来自于广告的“获取‑按”模型)可能会帮助你。填补空白。我的博客的目的是帮助[有特殊问题的观众][通过手段]达到[期望的结果]。在 Ahrefs，我们的援助策略可以如下:通过发布深入的教程和操作指南，帮助营销人员和网站所有者更好地进行 SEO，为他们的网站带来更多的流量。如果你正在为你的在线瑜伽配件商店建立一个博客，你的博客的目的可能是:通过向人们提供最好的练习方法和设备的最佳提示，帮助他们开始练习瑜伽，以达到成功。立即设置你的“为什么”，这是至关重要的，因为它有助于保持你的博客内容策略的其他方面在正轨上。2. 调查你的竞争对手竞争性研究是你的博客内容的无价的灵感来源。它揭示了哪些关键词为他们带来流量，什么类型的内容适合他们，他们做得好，以及他们在哪里落后。你应该研究两种类型的竞争者:商业竞争者内容竞争者商业竞争者商业竞争者是那些提供与你相似(或相同)产品或服务的公司/品牌。它们相对容易识别，因为你可能从事业的一开始就知道它们。例如，如果你在销售瑜伽垫，那么 liforme 就是你的商业竞争对手。你可以使用 Ahrefs 的 网站分析查看你的竞争对手在有机搜索中表现最好的内容:输入他们的域名或博客转到Top Pages (热门页面）报告Liforme.com的热门博客文章预估的每月搜索流量在这里，你可以看到 liforme.com 网站上有很多关于坐式瑜伽姿势和瑜伽柔韧体式的帖子。这两个关键词在 Google 上的排名也都是第一，你可以从“Top Keyword” （热门关键词）和“ Position” (位置）栏中看到。这个报告对于快速找到一些可能值得写的初始主题和关键词非常有用。如果你需要更多，只要为更多的商业竞争者重复这个过程。内容竞争对手内容竞争对手是你在自然搜索领域与之竞争的网站，但它们不一定会在商业意义上与你竞争。例如，我们的一个内容竞争对手是 backlinko.com，因为它竞争许多相同的关键词。但这不是我们的商业竞争对手，因为我们销售的东西不同。你可以通过关键词分析轻松找到内容竞争对手:输入你在分析商业竞争对手时发现的关键词访问Traffic Share by Domains (按域划分的流量份额)报告这份报告显示了，根据你输入的关键词估计流量最多的网站:通过 Site Explorer 运行这些站点，就像你和你的商业竞争对手一样，来找到更多的主题点子。3. 进行全面的关键词研究现在你知道了你的竞争对手写了什么，他们的流量来自哪里，是时候进行关键词研究，探索人们在你的利基中搜索什么了。首先，确定你的种子关键词。种子关键词基本上是你将要在你的博客上写的关键主题。最简单的方法是写下主要的词语来定义你的业务是什么或者你卖什么。例如，如果你正在为你的咖啡店开一个博客，它们可能看起来像这样:咖啡意式浓缩咖啡卡布奇诺拿铁Aeropress咖啡豆如果你把它们插入关键词分析，进入Matching terms（词汇匹配）报告，然后将匹配类型切换到“问题”(Questions)，你会看到成百上千个以问题为中心的关键词创意:这些人中的大多数都是适合发表博客文章的候选人，因为他们是问题。如果你需要更多的关键词创意，请阅读我们关键词研究的完整指南。4. 建立一个内容计划现在你已经为你的博客准备了大量的点子，是时候优先化和建立你的内容计划了。要做到这一点，你应该考虑以下三个指标: 流量潜力 – 在谷歌一个月有多少次关键词搜索？ 排名难度 – 有多难是排名在有机搜索结果的关键词？ 业务价值 – 你的产品与主题有多大的相关性？最好的话题是那些具有高流量潜力、商业价值和低竞争力的话题: 你如何判断呢？在关键词分析，你可以得到一个粗略的流量潜力，看关键词的每月搜索量。不过，我们建议更多地关注排名靠前的页面的估计流量ーー因为大多数页面的流量来自多个关键词。例如，“如何制作法式咖啡”的搜索量是每月20000，但排名最靠前的网页的流量增加了60% 左右:至于评估排名难度，我们的 关键词难度(KD) 度量是一个很好的选择。它将关键词的相对排名难度按0–100分(更高 = 更难)进行排名:这就是说，因为不可能提取排名难度为一个单一的数字，我们建议你检查一些其他的事情之前，目标关键词。你可以在我们的指南中了解更多关于寻找低竞争关键词的信息。最后，当涉及到商业价值/潜力时，我们建议根据你的产品/服务对解决手头问题的重要程度，为每个主题分配0–3四个值。综上所述，很明显，如果你在网上销售高品质的咖啡豆，那么像“如何制作冰咖啡”这样的关键词应该出现在你的雷达上，因为它: 具有高流量潜力-排名最高的网页每月获得约46k 的搜索访问。 是低竞争-其 KD 分数相对较低(28) ，而且一些排名最高的网页是来自相对较小的网站。 具有很高的商业价值-你的咖啡豆可以帮助搜索更好的一杯冰咖啡。一旦你找到了一大堆相关的主题，下一步就是对你的主题进行分组，并分批处理它们，也就是所谓的“集群”。例如，在做关键词研究时，你可能会注意到许多人正在寻找制作不同类型咖啡的方法，比如:怎么做冰咖啡怎么做冰滴咖啡怎么做法式压榨咖啡怎么煮生奶泡咖啡怎么做抹茶拿铁因此，将这些问题归为一个“集群”并同时处理它们可能是有意义的。您甚至可以对组中的所有主题使用相同的模板/大纲，这将显著提高内容创建工作的效率。你也可以把这些帖子互相链接起来，创建所谓的内容中心，有些人认为这样可以帮助每个帖子在谷歌中获得更高的排名:5. 创建你的博客的身份想想你的博客，就像想想你的品牌一样。它和其他类似的博客有什么不同？你的博客独特的声音、语调和风格是什么？整理出一套编辑指南来定义你的博客风格。你的博客指导方针最重要的方面是:视觉指引语音语调写作规则视觉指引视觉指南是用来创建博客文章图像的质量和风格的一致性。这很重要，因为你的博客是你品牌的延伸，所以你不应该低估视觉的一面。这里通常有很多需要考虑的因素，所以一个好的起点是找到一种方法使你的标题插图与众不同并且易于识别。例如，在 Ahrefs 的博客上，每个帖子都有一个独特视觉风格的自定义插图:语音语调语音和语调指南定义了你的博客的个性和价值观。例如，如果你不得不用你描述一个人时通常使用的形容词来描述你的博客，他们会是什么？简单又聪明？友好而活泼？谦逊而乐于助人？如果你已经有了一个强大的品牌标识，你的博客的语气和语气很可能就来源于此。然而，请记住你的博客是一个独立的实体。定义它听起来怎么样，它代表什么，以及你希望文章唤起什么样的情感。具体说明书中的术语，正式/非正式，奇怪的程度，幽默的使用等等。写作规则虽然语音和语调指南更多的是关于你的博客的“灵魂”，写作规则定义了你的博客内容的“框架结构”。其中包括拼写(例如，British vs. American)、格式、段落长度、大小写、标题格式等。有了这些指导方针，你就可以更容易地，在所有博客文章和新作者身上拥有同样的质量水平。专业提示把你所有的博客规则和指导方针写成一个连贯的文档。它将作为你博客的说明书，你可以与你的贡献作者分享，并在你需要发展你的博客策略时回来(我希望有人早点告诉我这一点)。6. 追踪你的成功拥有一个博客内容策略固然不错，但是你也需要一个关键绩效指标(KPI)，来跟踪你的策略在不同时间的工作情况。如果你的老板对你博客的表现很好奇，你也可以把这个给他看。如果你是从博客开始的，那么流量可能是最可行的关键绩效指标(KPI) ，你可以使用谷歌分析(Google Analytics)进行跟踪。这可能听起来很简单，但是你只需要在早期阶段写出内容，传播它，并获得吸引力。一旦你到了这个阶段，明智的做法是转而衡量一个更强大的 KPI，就像你的自然声音份额。这会告诉你 ，你的品牌在自然搜索中相对于竞争对手的可见度。你可以通过使用Rank Track (排名监控)了解你的自然声音份额:添加你想要排名的关键词增加你的竞争对手进入Competitors Overview （竞争对手概况）报告检查你的可见性相对于你的竞争对手，你希望这个数字随着时间的推移而增加。最后的想法建立一个成功的博客内容策略需要时间和精力，但它是值得的。如果你开始写博客，你应该长期坚持下去。你不会马上看到结果，但在 Ahrefs 和本教程的帮助下，你将建立一个高质量的博客，它将以更多的眼球和用户的方式结出果实。附言: 如果你听到人们说: “人们还在阅读吗?”？博客不是死了吗?”别听他的。只要人们还在搜索引擎上搜索信息，博客就不会消亡。译者：John Zhao, 西品东来创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human:",
  "headers": [
    {
      "level": "H1",
      "text": "7个步骤创建一个成功的博客内容策略"
    },
    {
      "level": "H2",
      "text": "什么是博客内容策略？"
    },
    {
      "level": "H2",
      "text": "为什么你需要一个博客内容策略？"
    },
    {
      "level": "H2",
      "text": "如何创建博客内容策略"
    },
    {
      "level": "H3",
      "text": "1.明确你的“为什么”"
    },
    {
      "level": "H3",
      "text": "2. 调查你的竞争对手"
    },
    {
      "level": "H4",
      "text": "商业竞争者"
    },
    {
      "level": "H4",
      "text": "内容竞争对手"
    },
    {
      "level": "H3",
      "text": "3. 进行全面的关键词研究"
    },
    {
      "level": "H3",
      "text": "4.  建立一个内容计划"
    },
    {
      "level": "H3",
      "text": "5. 创建你的博客的身份"
    },
    {
      "level": "H4",
      "text": "视觉指引"
    },
    {
      "level": "H4",
      "text": "语音语调"
    },
    {
      "level": "H4",
      "text": "写作规则"
    },
    {
      "level": "H3",
      "text": "6. 追踪你的成功"
    },
    {
      "level": "H2",
      "text": "最后的想法"
    }
  ],
  "author": "Katy Mrvova"
}