{
  "url": "https://ahrefs.com/blog/zh/branded-search/",
  "slug": "branded-search",
  "title": "品牌搜索与非品牌搜索：有什么区别？",
  "description": "搜索引擎优化并不总是吸引陌生人访问网站，有些人专门寻找某些品牌/产品，以下是为此做准备的方法。",
  "content": "Mateusz Makosiewicz Ahrefs 的营销研究员和教育家。 Mateusz 在推广代理、SaaS 和硬件业务领域拥有超过 10 年的营销经验。平时喜欢创作音乐或享受长距离的散步。 内容 大多数搜索引擎优化的建议,都是关于优化那些没有提到你的品牌的关键词，因为这样你就可以吸引完全陌生的人来你的公司。但是那些提到你的品牌的搜索查询呢？换句话说，如何吸引那些正在寻找你的生意的人呢？当然，你也可以针对这些类型的查询优化你的网站。在本指南中，我将解释如何做到这一点。我们将报道以下内容:品牌搜索与非品牌搜索的区别为什么要优化非品牌搜索为什么要优化品牌搜索如何优化品牌搜索品牌搜索与非品牌搜索的区别品牌搜索和非品牌搜索的区别在于，品牌搜索包含你的公司、服务或产品名称，而非品牌搜索则不包含。这同样适用于自然结果和搜索广告。为什么要优化非品牌搜索非品牌关键词排名可以吸引那些正在搜索与你的业务相关的产品或服务，但可能不一定知道你的品牌的人。因此，这是一个吸引新客户的好方法。关于我们的搜索引擎优化清单的博客文章，吸引那些不一定知道我们的产品人搜索。数据来着Ahrefs的网站分析。我们有一个完整的搜索引擎优化课程，重点是优化非品牌关键词。因此，在本文中，我们将重点关注品牌搜索引擎优化。为什么要优化品牌搜索品牌关键词排名可以吸引那些专门搜索贵公司信息的人。他们已经知道你的品牌，但想了解更多关于你做什么。例如，他们可能会寻找评论，与其他品牌的比较，或者特定的信息，如技术数据或媒体资产。因此，通过品牌搜索，根据查询的目的，你的目标人群是:接近从你这里购买——人们可能会特别关注你的品牌，或者寻找你和你的竞争对手之间的比较。你可以回答任何反对意见，回答问题，或者向他们保证你是正确的选择。你现在的客户——让你现在的客户知道你的情况是让他们高兴的直接途径。媒体——这里的目标是成为第一信息来源。品牌粉丝和其他人只是对你所做的感兴趣我们的着陆页将我们的产品与竞争对手进行比较，吸引了搜索者，他们通过 Ahrefs 的网站分析搜索包含我们品牌名称和“ vs”数据的谷歌查询。如何优化品牌搜索这个过程基本上有四个步骤。在本指南中，我将以金融科技公司 Revolut 为例(但这可以是任何公司)。找到与你的品牌、公司或产品相关的关键词你需要创建两个关键词列表，以便对你的品牌搜索领域有一个完整的概述:找到你排名的关键词找到你不排名的关键词这里需要记住的一点是，我们在这本指南中要做的每件事都是针对具体国家的。你需要为每一个你想为其关键词排名的国家重复这个过程。找到你排名的关键词当你有一个像Ahrefs这样的搜索引擎优化工具，找到你排名的关键词是小菜一碟。你所需要做的就是插入你的域名，进入自然关键词报告，然后在过滤器中输入表示你的品牌或产品的单词/短语。提示: 不要担心关键词的拼写错误。一旦你创建了对这些关键词进行排名的内容，谷歌的算法可能会用正确的拼写来解决这个问题。导出关键词列表并将其导入到电子表格编辑器中，我将使用谷歌表格。我们的第一份名单到此结束，现在开始下一份。找到你不排名的关键词为了创建一个你不排名的关键词列表，你需要组合并比较两个列表: 你排名的品牌关键词列表(这是我们刚刚创建的)和你公司的所有品牌关键词列表。这就是我们要做的。在你的关键词工具ーー我将使用 Ahrefs 的 关键词分析工具 ，插入你在第一个列表中使用的相同品牌关键词，选择与之前相同的国家，然后点击“回车”然后转到短语词汇报告，你将获得所有品牌关键词的列表。现在我们需要比较你的排名的关键词与所有的关键词，以便得到品牌关键词你不排名。因此，应该这样做:导出列表将列表导入到与第一个列表位于同一电子表格中的新表中在新导入的列表中创建一个附加列，并将该列命名为“ Do we rank?”将此数组公式插入该列的第一个单元格:=ArrayFormula(COUNTIF(Ranking!A2:A, B2:B)=1)其中“排名”是包含你排名的关键词的工作表的名称，单元格范围是包含你的关键词的列。如果你已经为给定的关键词排名，这个公式将自动填充整个列“ true”，如果没有，则填充“ false”。机会是你不会得到太多的“假”在这里，但问题是，你永远不会知道，直到你检查。这样，我们就创建了这个过程所需的两个关键词列表。现在让我们看看如何使用它们。2. 选择值得关注的关键词下面是我们将如何分类值得瞄准的品牌关键词:表现不佳的关键词——因为如果你提高他们的排名，你可以从搜索结果页面(搜索引擎结果页面)获得更多的流量意图不匹配的页面——因为不匹配的搜索意图不会给人们他们想要的东西有价值的新关键词——因为你可以得到更多的流量通过针对新的关键词表现不佳的关键词表现不佳的品牌关键词基本上是排名第一的关键词。离1号还有多远？这取决于搜索查询和竞争。如果你认为有一个合理的机会，一个关键词排名高于目前的位置，你应该尝试它。一般来说，对于某些查询，排名前三是成功的。但对于那些竞争非常激烈(比如用于比较的搜索查询)的公司来说，排名前10是一种成功。打开第一个列表，点击“当前职位”列，从 Z 到 A 排序。这里任何不是排名第一的都是你的机会。看看每个关键词。如果它是你可能创造更好的内容的东西，标记它。标记关键词的一个很酷的技巧是创建一个单元格内的下拉列表。此外，查看“流量”列，以确定该关键词是否在你选择的国家获得任何搜索需求。意图不匹配的页面现在让我们为第二类选择关键词: 不匹配的意图。既然你已经浏览过排名第一的关键词，现在是时候仔细看看那些排名第一的关键词了。如果你想保险一点，你可以把搜索范围扩大到前三名，甚至前十名。下面是一个搜索意图不匹配的页面示例。寻找 Revolut 标志的人可能想要一个可下载的官方高质量图像。但是在美国排名第一的网页上，Revolut 并没有提供这种服务。因此这个关键词可以突出显示为“不匹配的意图”。让我们转到最后一个类别: 有价值的新关键词。新关键词为此，我们将打开所有品牌关键词的第二张表。为了只显示那些你在选择的国家排名不靠前的，过滤“我们排名吗?”只显示「虚假」结果:在我们开始研究特定的关键词之前，我建议按照搜索量对它们进行排序，以便首先获得最具潜在价值的关键词。现在我们可以看看这些关键词中是否有吸引我们眼球的。这里有一个例子: 将 Revolut 与另一家金融科技公司进行比较:3. 优化现有内容或创建新内容现在我们需要给搜索引擎一些他们可以排序的东西。这意味着要么优化现有页面上的内容，要么创建新内容。在前一步中创建的关键词列表将告诉我们是需要执行第一步还是第二步。所以:标记为“表现不佳”或“意图不匹配”的关键词将需要优化内容。为了这个，我们会罩着你的。这里有一个关于如何优化搜索引擎内容的详细指南。新的关键词，你还没有排名将最有可能需要新的内容。我说“可能”是因为你可能需要重新考虑，有时候，在现有页面中包含一些主题比将它们放在单独的页面中更好。这里有一个完整的内容创建指南，旨在排名在搜索引擎。4. 添加内部链接我们优化品牌搜索过程的最后一步是增加内部链接。除了帮助用户浏览你的网站，内部链接在搜索引擎优化中发挥重要作用。首先，搜索引擎使用它们来发现、(重新)爬行和索引页面。此外，它们还帮助谷歌了解你的页面是关于什么的。最后但并非最不重要的，他们通过链路权益。由于这是一个相当直接的提示，我就长话短说了。你的网站上基本上有三个地方，你可能需要添加内部链接到针对品牌关键词的内容:网站导航——这意味着顶部导航和/或页脚。重要的页面——如果你想让你的内容容易而快速地被发现，在获得最多流量的页面(如主页)或最相关的页面(如功能)上添加链接。提到关键词的页面——例如，如果 Revolut 在其网站的某个地方提到“用 Revolut 购买股票”，它可以链接到专门讨论这个话题的博客文章或登陆页面。关于最后一点，你可以使用 Ahrefs 简化流程(你也可以使用 Ahrefs 站长工具免费完成这项工作)。进入 Ahrefs 网站诊断 并打开链接机会报告。在高级筛选器部分，使用条件设置一个新的筛选器: 关键词上下文包含[你的关键词或短语]。这样，你可以找到相关的链接机会，甚至还没有发表的网页。推荐阅读: 以下是2022年你应该优先考虑内部链接的原因最后的想法一个公司发展得越快，通过品牌搜索引导到公司的道路就越多(81% 的中小企业搜索，58% 的全球品牌搜索)。但无论公司规模大小，搜索结果页面似乎都扮演着公司名片的角色ーー人们向搜索引擎提出各种各样的问题，他们找到的东西就变成了他们知道的东西。因此，拥有自己的品牌查询是件好事。最后，如果你决定为品牌搜索优化你的网站，重要的是要知道，你所做的改变可能不会在一夜之间生效。记住，搜索引擎优化需要时间。如果你的搜索引擎优化软件附带排名监控，使用它来节省你的时间和精力ー而不是手动检查你的排名进度，这无论如何都不能准确地完成。下一步: 你可以利用 Google 的知识图表 进一步优化品牌搜索。有问题吗，发推特给我。译者，John Zhao，西品东来创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Mateusz Makosiewicz Ahrefs 的营销研究员和教育家。 Mateusz 在推广代理、SaaS 和硬件业务领域拥有超过 10 年的营销经验。平时喜欢创作音乐或享受长距离的散步。",
  "headers": [
    {
      "level": "H1",
      "text": "品牌搜索与非品牌搜索: 有什么区别？"
    },
    {
      "level": "H2",
      "text": "品牌搜索与非品牌搜索的区别"
    },
    {
      "level": "H2",
      "text": "为什么要优化非品牌搜索"
    },
    {
      "level": "H2",
      "text": "为什么要优化品牌搜索"
    },
    {
      "level": "H2",
      "text": "如何优化品牌搜索"
    },
    {
      "level": "H3",
      "text": "找到与你的品牌、公司或产品相关的关键词"
    },
    {
      "level": "H4",
      "text": "找到你排名的关键词"
    },
    {
      "level": "H4",
      "text": "找到你不排名的关键词"
    },
    {
      "level": "H3",
      "text": "2. 选择值得关注的关键词"
    },
    {
      "level": "H4",
      "text": "表现不佳的关键词"
    },
    {
      "level": "H4",
      "text": "意图不匹配的页面"
    },
    {
      "level": "H4",
      "text": "新关键词"
    },
    {
      "level": "H3",
      "text": "3. 优化现有内容或创建新内容"
    },
    {
      "level": "H3",
      "text": "4. 添加内部链接"
    },
    {
      "level": "H2",
      "text": "最后的想法"
    }
  ],
  "author": "Mateusz Makosiewicz"
}