{
  "url": "https://ahrefs.com/blog/zh/build-links-with-images/",
  "slug": "build-links-with-images",
  "title": "3种简单的图片外链建设法",
  "description": "图片提供了一种强大的方式来建设外链，因为它们是可嵌入的，而且它们的可视化性质也使其更容易解释复杂的主题。这就是为什么信息图可以如此有效的原因。",
  "content": "Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。 内容 俗话说得好，一张图片胜过千言万语，但对外链建设而言，一张图片确实可以胜过一千条外链。拿xkcd上的一个简单的漫画作为例子：译者注：经过20多年的努力，我们已经养成使用密码的习惯。尽管人们往往很难记住自己的密码，但是对于机器而言，推测密码轻而易举。根据Ahrefs的网站分析，这幅漫画有来自7,000多个反链域名的链接：虽然复制这种水平的成功案例可能很困难，但是我们可以用简单的方法来进行图片外链建设。在今天的指南中，我们将介绍三种最有效的策略。但首先，我们来介绍一些基本知识。为什么图片会吸引链接？什么样的图片吸引链接？如何用图片来建设外链？为什么图片会吸引链接？图片是可嵌入的。 当人们把图片嵌入他们的内容时，图片通常会链回源头。举个例子，这是在Wired.co.uk网站的帖子中嵌入《密码的好处》漫画：译者注：Wired.co.uk这个网站上有篇帖子引用了《密码的好处》这个漫画，点击密码的好处文字锚点可以链回xkcd网站。同时漫画的下方标注了创作者的姓名。在图片下方，作者标注了漫画创作者并且附上图片来源链接。什么样的图片吸引链接?从图片中获取链接是一个战略性的过程。你不能只是给你的猫拍张照片，然后期待着“链接如潮”。你需要有人们真正想要嵌入的图片。以下是一些常见的能够吸引链接的图片类型:信息图 图表照片地图产品图片信息图人们出于各种各样的原因喜欢信息图。这就可以解释为什么“信息图外链建设”已经流行了十多年。虽然这方法已经不像以前那么受欢迎了，主要是因为几年前人们过度使用它们，但有趣且设计精良的信息图仍然可以吸引大量外链。看看这个来自于 Wine Folly 的信息图：译者注：Wine Folly 利用简单清晰的信息图来展示葡萄酒的几大类型，方便读者快速而不费力气地理解酒的种类。根据Ahrefs的网站分析，它拥有来自153个网站（反链域名）的链接。图表看看这张图表：译者注：带有精选摘要的搜索查询量占总的查询量的12.3%，查询数量达1400万。根据谷歌的数据，这张图表被收录在150个网页上。这可能是该帖子是我们链接最多的帖子的原因之一。译者注：精选摘要分布占比信息图的来源帖子有多达1366条反链域名。照片然而，你在Instagram上的午餐的照不会成为你外链建设的救命稻草。 但是，如果你拍摄的恰好是人们正想找的图片，这些图片会疯狂地吸引链接。例如，这100多组来自Unsplash的自然图片有349个反链域名:译者注：这100组自然照片有1070个外链，349个反链域名。地图看下面这张地图：译者注：地图的创作者将国家直译名称标注在地图上，并且配上生动的图画，整张图妙趣横生。这张地图所在的页面有来自278个反链域名的外链，其中包括BBC、Lonely Planet、Vice、Gizmodo等。译者注：直译国家名这张地图所在的帖子有多达770条外链，278条反链域名。产品图片如果你正为你的线上店铺拍摄热卖产品的照片，毋庸置疑人们会在未经许可的情况下使用你的照片。举个例子，FireBox为他们销售的啤酒酿造套装拍摄了自己的产品照片。译者注：FireBox拍摄了十分精美的啤酒自酿套装的产品图片。然而，他们并不是唯一一家出售该产品的网站，其他网站似乎在未经允许的情况下使用了他们的照片:译者注：其他线上卖家盗用FireBox拍摄的啤酒自酿套装产品图片作为他们自己的产品图片。用图片建设外链的3种方法话不多说，我们开始建设外链吧。发现错误的链接归属，重新索回链接索回未经授权使用的链接使用 “TRUST“公式1. 发现错误的链接归属，重新索回链接假使你已经创作了上面提到的一些图片类型，然后别人可能已经嵌入了你这些图片。如下，这是我们的关键词长度分布图被嵌入在其他网站上：如果你看图片下面，会发现Mention已经给我们标注了来源链接。然而，这条链接指向的是实际的图片文件本身，而不是它的源帖子。这并不理想，因为图片链接对于页面排名来说是个死胡同，可能对我们的页面在Google排名没有帮助。下面是如何找到这种类型的图片链接并要回正确的归属的方法:a)找到错误的链接归属将你的网站粘贴到Ahrefs的网站分析中，进入外链报告，然后在外链的URLS中搜索png或者jpg:译者注：讲网页粘贴到网站分析中，然后进入外链报告，选中外链URL这个选项，搜索png 或者jpg。接下来，过滤报告，只显示来自唯一域的“dofollow”链接。译者注：限定外链报告的搜索范围为外链URL里面包括的png 或者jpg的外链。你可以看到Ahrefs博客有497个网站直接链接到图片文件。现在只需要对报告进行筛选，并在电子表格中记录下我们想要索回的链接。译者注：我们把筛选之后的链接记录到表格里，方便我们去索回正确的归属。在联系之前一定要先检查页面的源代码，因为有时候他们会把链接给到图片所在的页面。在这种情况下，你没有必要去联系了。b) 联系并索回正确的归属找到网站关联人员的电子邮件地址，然后像下面这样快速发送电子邮件要求更改链接：嘿, 约翰,看到你在关于[话题]的帖子中引用了我们的一个图表。你可以把它链接到它的源帖子，而不是图片文件本身吗?祝快乐,杰克就是这么简单。最难的部分是找到正确的联系方式，但这个视频可以帮你加快进程:https://www.youtube.com/watch?v=HA5tLHG80jsc)让所有事情都自动化如果你成功地运用了这个技巧，那么对监测以后的错误的链接归属也同样有用。为此，你可以在Ahrefs提醒中设置一个新的外链提醒，然后使用以下设置:域或URL：https://你的网站.com/wp-content/uploads/模式：前缀获得：新反向链接请注意，这只适用于在WordPress上运行的网站。如果你使用其他CMS，你需要找出你的图片上传的位置，然后使用该位置作为URL。或者，如果你使用的是CDN，你需要监测域名位置。如果一切设置正确，现在只要有人直接链接到你网站上的图片，你就会收到电子邮件提醒。译者注：设置好外链提醒功能之后，每当有新的外链直接链接到网站上的图片时，我们就会收到外链报告邮件。然后你可以筛选链接，如果你想要回任何一个链接，可以给他们发邮件。2. 索回未经授权使用的链接大多数使用你图片的人都会给你标注来源链接，但不是所有人都会。举个例子，下图是我们的图片被其他网站使用了，但是根据源代码，根本没有指向我们的链接：译者注：查看源代码，发现并没有指向我们网站的链接。下面是如何发现和索回未经授权使用的链接：a) 发现未经许可使用的图片最简单的方法是用谷歌反向图片搜索。只需上传你的图片或粘贴在URL中，谷歌就会给你甩出用了该图片的网页。译者注：上传我们的图片到谷歌图片搜索，谷歌会帮我们筛选出那些使用了我们图片的网页。然后你只需要过滤结果来确保:你的图片确实在页面上他们没有给你提供来源链接你需要这个网站的链接如果以上所有条件均成立，请在电子表格中记下该页面。b) 联系并索回归属找到正确的电子邮件地址，发一个简单的邮件，如下:嘿，约翰看到你在关于[主题]的帖子中使用了我们的一张图。你可以添加一个我们的来源链接？祝快乐。乔希c）自动检测未经授权的图片使用行为使用谷歌进行反向图片搜索是完全免费的，但是如果有很多图片需要检查，则会非常耗时。此外，如果你想监测未经授权的图片使用，你必须每隔几个月重复这个过程。解决办法是使用一个付费的工具，如Image Raider。只要每月付费，这个工具就可以监测网络上多达1万张的嵌入图片。只需注册，创建一个列表，然后添加你想要监测的图片。译者注：把你需要监测的图片放到 Image Raider上面，设置好，那么它就会帮你自动监测未经允许使用的图片。你可以在几秒钟内轻松地将网站上的所有图片添加到Image Raider。 只需使用Ahrefs的网站诊断来抓取你的网站，进入“图片”报告，单击已抓取的图片，导出图片资源，然后将图片URL列表粘贴到Image Raider中：译者注：使用Ahrefs的网站诊断，在页面分析点进入“图片”报告，点击已抓取的图片，然后将图片的url 链接导出来到表格中。译者注：导出抓取到的图片的URL,再粘贴到 Image Raider上面，就可以开始监测你的图片了。然而，虽然听起来不错，但你不可能想监测所有图片。更好的办法可能是过滤出你最受欢迎的网页，然后把你想监测的图片的URL复制到Image Raider中。译者注：首先找到我们比较受欢迎的网页，在里面提取我们想要检测的图片的url 链接，然后粘贴到 Image Raider上面。无论哪种方式，Image Raider都会自动监测你的图片看看是否有新的发现。你只需要每月登录一次，看看新的 “侵权行为”。你可以通过 “结果发现日期 “来过滤报告。要知道，Image Raider所说的侵权行为，可能未必是侵权行为。这是因为该工具并没有检查这些网页是否链接到你。你可以导出Image Raider中的URLs列表，并在Screaming Frog中运行自定义搜索来批量检查页面上的链接，从而解决这个问题。只要进入Configuration > Custom > Search (配置 > 自定义 > 搜索)，选择“Does not contain” (“不包含 ”) 选项，然后粘贴这个正则表达式(regex)。<a [^>]*bhrefs*=s*”([^”]*ahrefs.com[^”]*)请注意，你需要将ahrefs.com替换为你的网站。在Screaming Frog那里，选择 “Custom “（ “自定义 “）选项卡，从下拉菜单中选择 “Does not contain”（“不包含”）。这将显示所有非你网页的网页。然后，你可以将这些URL粘贴回 Screaming Frog 中，并使用Ahrefs API连接来获取诸如域名评分、URL评分等指标。然后，只需要筛选导出结果，然后选择要联系的网站。以上听起来很繁琐，但是一旦你掌握了这些知识，每月只需花费15–20分钟。 即使仅从其中获得一个或两个链接，也不错。3. 使用 “TRUST“公式你只能从已有的图片中索回外链。之后，你需要创建更多的图片来吸引外链。有几种方法可以做到，但有一个久经考验的TRUST公式。下面简单介绍一下流程：Trending topic （挖掘热门话题）Research and analysis （研究和分析话题数据）Unique (unusual, or unexpected) takeaway 整理独特的（不寻常的，或意想不到的）干货Simple visual （创作简单的视觉效果）Tactical promotion （战略化地推广你的图片）大卫·麦克斯威尼（David McSweeney）在这里精确地解释了如何执行此策略，以及他如何成功地从Yahoo Sports和FHM这些权威网站获得外链。 但是现在，让我们捋一下基础知识。a) 寻找热门话题如果记者和博主已经在撰写有关某个话题的文章，那么向他们推荐关于类似话题的新内容会更容易。谷歌新闻是寻找热门话题的最佳方式之一。只需搜索你网站的相关的内容，然后盯住热门话题的结果。译者注：搜索高尔夫球，谷歌会推荐最热门话题出来，如泰格·伍兹将推出迷你高尔夫课程。在大卫的案例中，他发现很多网站都在写泰格·伍兹，所以他选择了这个作为主题。b) 寻找与你的主题相关的有趣的数据寻找数据，分析它，并提取独特的见解。(这里有一些资源供你开始)。在大卫的案例，他利用维基百科(Wikipedia)的数据来了解泰格·伍兹(Tiger Woods)整个职业生涯在每个州赚了多少钱。译者注：利用维基百科的数据，将泰格·伍兹(Tiger Woods)在各个洲的收入和美国的收入占比整理成一个表格。他的想法是用这些数据绘制一张地图。c)写标题接下来，你需要一两行简单的要点或标题，用于推广你的文章。如果你还没想好，你可以使用这种格式。我们算出了{X}.你知道{Y}吗?看看大卫是怎么处理这个公式的：我们计算了泰格·伍兹在美国各州赚了多少钱。你知道他在几乎半个美国赚了钱吗？<d) 制作图象有两种方式: 使用Visme或Easel这样的工具制作一张简单的图片或者定制。大卫选择了第二种，然后做出下图：然后，他在自己的网站上发布了这张图，并做了简单的报道。译者注：大卫就热门话题写了一篇关于泰格.伍兹在各个州的收入这篇文章，并拿了在维基百科收集到的数据做了一个美国各州收入分布地图。e) 推广作品这个过程的关键是给已经讨论过你的话题的记者和博主发送邮件进行outreach（外联）。你可以在谷歌新闻（Google News ）或Ahrefs的内容分析中找到这些内容。在内容分析中，搜索你的主题，然后过滤过去七天内发布的英文页面。译者注：在Ahrefs内容分析中搜索泰格.伍兹，过滤七天内发布的英文页面，你就会得到最新的关于泰格.伍兹的话题和撰写人的信息，得到信息后就可以进行邮件outreach（外联）了。然后就是筛选结果，确定你想要链接的网站，找到他们的联系信息，然后投递邮件。下面是大卫发送的邮件：译者注：大卫在内容分析找到想联系的目标之后，发送邮件，对作者进行简单寒暄之后，问他是否有兴趣看自己关于泰格.伍兹在全美各州的收入分布地图，并附上了图片来源链接和地图。请在这篇文章中了解更多关于大卫的成果，并在这篇文章中了解更多关于用地图来进行外链建设的信息。文末寄语图片提供了一种强大的方式来建设外链，因为它们是可嵌入的，而且它们的可视化性质也使其更容易解释复杂的主题。这就是为什么信息图可以如此有效的原因。不过要谨记，并非所有的东西都要做成图片才有意义。你不应该只是为了建设外链硬生生地把你的内容变成图片。这是行不通的。很多信息图正是因为这样而惨遭失败。有什么问题或者不理解的，欢迎到推特和我聊聊。译者，Charli Liu, 慢慢来文案策划 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。",
  "headers": [
    {
      "level": "H1",
      "text": "3种简单的图片外链建设法"
    },
    {
      "level": "H2",
      "text": "为什么图片会吸引链接？"
    },
    {
      "level": "H2",
      "text": "什么样的图片吸引链接?"
    },
    {
      "level": "H3",
      "text": "信息图"
    },
    {
      "level": "H3",
      "text": "图表"
    },
    {
      "level": "H3",
      "text": "照片"
    },
    {
      "level": "H3",
      "text": "地图"
    },
    {
      "level": "H3",
      "text": "产品图片"
    },
    {
      "level": "H2",
      "text": "用图片建设外链的3种方法"
    },
    {
      "level": "H3",
      "text": "1. 发现错误的链接归属，重新索回链接"
    },
    {
      "level": "H4",
      "text": "a)找到错误的链接归属"
    },
    {
      "level": "H4",
      "text": "b) 联系并索回正确的归属"
    },
    {
      "level": "H4",
      "text": "c)让所有事情都自动化"
    },
    {
      "level": "H3",
      "text": "2. 索回未经授权使用的链接"
    },
    {
      "level": "H4",
      "text": "a) 发现未经许可使用的图片"
    },
    {
      "level": "H4",
      "text": "b) 联系并索回归属"
    },
    {
      "level": "H4",
      "text": "c）自动检测未经授权的图片使用行为"
    },
    {
      "level": "H3",
      "text": "3. 使用 “TRUST“公式"
    },
    {
      "level": "H4",
      "text": "a) 寻找热门话题"
    },
    {
      "level": "H4",
      "text": "b) 寻找与你的主题相关的有趣的数据"
    },
    {
      "level": "H4",
      "text": "c)写标题"
    },
    {
      "level": "H4",
      "text": "d) 制作图象"
    },
    {
      "level": "H4",
      "text": "e) 推广作品"
    },
    {
      "level": "H2",
      "text": "文末寄语"
    }
  ],
  "author": "Joshua Hardwick"
}