{
  "url": "https://ahrefs.com/blog/zh/buy-backlinks/",
  "slug": "buy-backlinks",
  "title": "你应该在2022年购买外链吗？看情况",
  "description": "购买外链违反了谷歌站长守则，但真如传说中的那么有风险吗？",
  "content": "Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。 内容 链接建设是困难的，耗时的，而且经常摧毁灵魂。这就是为什么，许多人转向购买外链。但是，如果你已经购买了外链，你应该这样做吗？它值这个价钱吗？还是浪费钱？让我们看看事实。内容为什么购买外链有风险谷歌认为，购买通过 PageRank 的链接，是违反了其站长准则的链接方案。如果你不熟悉 PageRank，那就很复杂了ーー但大多数购买的链接都会通过 PageRank。如果谷歌认为是付费链接到你的网站，两件事情中的一件将会发生:谷歌会对链接进行打折——它们不会帮助或阻碍你的搜索引擎排名。谷歌的算法会给它们打折扣，就好像它们不存在一样。谷歌会惩罚你——谷歌有一支可以对网站进行人工操作的人工审查队伍。如果你得到其中一个，你的部分或全部网站将不会显示在谷歌的搜索结果中。小提示. 你将知道是否有手动操作，因为它将显示在Google搜索控制台的手动操作报告中。这两种情况都不理想。要么你的付费外链不会对你的排名产生影响，要么对排名产生负面影响。为什么人们还在购买外链即使你有很好的内容和个性化的外联邮件，许多网站所有者仍然会要求金钱来放置链接。这使得建立基于价值的联系变得极其困难，因此许多SEO宁愿购买它们也是完全可以理解的谷歌也不会给你基于链接的惩罚或降级，除非它认为你有付费链接。考虑到付费链接通常看起来与自然链接没有什么不同，许多SEO相信，他们可以通过购买链接而逃脱惩罚，而且很多人都这样做了。例如，这里有一个关于，在自然搜索中蓬勃发展的最佳在线赌场的页面：如果我们在Ahrefs的网站分析中查看其外链配置文件，在我看来，这些链接中的许多链接，极有可能是被购买的：这些锚文本看起来既不自然也不合法。链接费用是多少？如果你前往 Fiverr，你会发现只需几美元就可以打包数千个外链。但现实是，这些链接不太可能提高排名。出于这个原因，这不是大多数 SEO 购买外链的方式。大多数人通过以下两种方式购买:利基编辑–你要求网站所有者付费向其网站上的现有页面添加链接。付费访客帖子——你写一篇文章，其中包含到你的网站的链接，然后付钱给网站所有者，让他们在他们的网站上发布。几年前，我开展了一项小型研究，调查这些类型链接的成本。利基编辑的成本是多少？平均361.44美元。我在接触了九个竞争对手的450个网站，并要求在他们的网站上直接购买链接（这些实际上是利基编辑）后，得出了这个数字。这是我发送的电子邮件：小提示. 不得不承认，这不是最好的推广邮件。我没有推销任何特定的资源或链接页面。我还在现有内容或新内容中加入了这个链接。这些事情可能会对响应率产生负面影响。有趣的是，只有12.6% 的网站愿意卖给我一个链接。有些网站似乎比其他网站更愿意出售链接。正如你所料，链接的平均成本与网站的域名评分(DR)呈正相关:付费访客帖子的费用是多少？比小众编辑少得多，平均77.80美元。我在相同的九个利基市场的180个网站上，发布了一篇客座文章，之后得出了这个数字。有趣的是，我没有提出支付费用；不管怎样，许多网站所有者都只是发了他们的费用。这是我发送的电子邮件：小提示. 我只向那些有“为我们写作”页面的博客投稿，换句话说，就是那些寻找客座文章的博客。与利基编辑一样，大多数网站所有者没有做出回应。在这25.5% 的受访者中，大约一半的人要求为发布客座文章收取费用。一些利基市场的网站，也比其他网站更愿意出售客座博客:我还注意到，几乎所有销售这些产品的网站的 DR 都很低:请记住，尽管访客发帖的平均成本低于利基编辑，但你必须为他们制作内容。这会增加你的开支。为什么链接要花这么多钱？竞争条件排名靠前是一项有利可图的业务例如，让我们看一下，我之前展示给你的最佳在线赌场页面。据Ahrefs报道，目前该网站每月的搜索访问量估计为5400次。页面上的许多链接都是附属链接。考虑到赌场联盟计划支付丰厚的佣金，我估计这个页面很容易产生高达五位数的月度佣金。因此，很容易理解，为什么网站所有者愿意为帮助他们排名更高的链接，支付大笔费用多年来，网站所有者已经意识到链接对SEO的价值，并开始要求越来越多。不幸的是，许多链接买家和卖家几乎不知道什么是好的外链。这导致了一个行业，即使是低质量的网站所有者，也可以为平庸的链接要求高价，因为一些做SEO的人愿意付费。这就是为什么，如果你计划购买外链，你真的需要做你的尽职调查。如何安全地建立链接购买外链是不可能的，如果你想建立一个“安全”和白帽子的方式链接。这给了你两个选择:创建自然吸引链接的内容做外联获取链接鉴于内容无法获得链接，除非人们知道它，你最好的选择是两者都做：创建值得获得链接的内容，然后进行外联，让潜在链接者知道它的存在然而，即使是基于外联的链接建设，你仍应尽自己的职责。在访问网站之前，让我们先了解几个值得问的问题。1. 网站看起来合法吗？根据你对网站的第一印象，它看起来可信吗？如果你找到了内容，你会留下来阅读吗？如果答案是否定的，那么很可能不值得寻找链接如果你很难回答，这里有几个不太合法网站的迹象：设计不佳内容中没有链接内容中没有图像作者简介模糊或不存在下面是一个示例：虽然这个网站可能是合法的，但它并没有让我充满信心，原因如下：徽标看起来像一个Fiverr工作。页面上仅有的两张图片是没有署名的库存照片。内容中没有链接。作者简介只是“布里奇特”。但布里奇特是谁？ 我的猜测是: 这个网站是一个私人博客网络的一部分，或建立的唯一目的是出售外链。2. 搜索流量稳定吗？如果一个网站获得自然流量，谷歌必须至少将其视为一种有价值的资源。要检查这一点，将域插入 Ahrefs 的网站分析并转到 Overview 报告。然而，仅仅依靠网站当前的自然流量，并不是最好的主意如果流量最近下降到了悬崖上或似乎大幅波动，那么它可能受到了谷歌更新的影响。因此，值得在网站分析中，滚动到“概述”报告中的“表现”图，以查看站点随时间推移的自然流量下面是上面站点的图表：尽管每月的搜索访问量估计仍有4.8万次，但你可以看到，2018年的访问量曾经大大增加。事实上，一夜之间流量下降了95% 。如果我们在图表上，点击切换来覆盖谷歌更新，我们可以看到，流量下降与2018年8月的核心算法更新同时发生。这是 Barry Schwartz 称之为“医疗更新”的更新，因为它似乎对健康和医疗网站影响最大。总而言之，不要费心从这样的网站寻找链接ーー不管是付费的还是其他的。3.网站是否一直在出售链接？永远不要追求那些明显是链接卖家的网站的链接，因为谷歌的惩罚可能指日可待。在这一点上，你从网站上获得的链接，将变得毫无价值或更糟。你通常可以通过查看最近的帖子，来判断一个网站是否在出售链接，这些帖子中有位置奇怪的链接，而这些链接中有利润丰厚的关键词。下面是一个示例：这两个链接都非常不自然，有精确的锚文本，并链接到同一网站上的商业页面。一种通常更快的方法是，检查Ahrefs网站分析中的Outgoing Link Anchors报告，以查找带有奇数锚的外部链接。4.网站是否一直在购买链接？如果有明显的证据表明潜在链接购买链接，这是避免从该网站获取链接的另一个原因。毕竟，它在任何时候都可能因为购买链接而受到惩罚要进行检查，请使用Ahrefs网站分析中的锚报告，来查找其主页上带有非自然锚的链接。下面是一个带有许多可疑链接的网站的示例：如果你不确定锚是否可疑，请单击“链接到目标”列中的插入符号，以查看其上下文：在这种情况下，我会说，由于完全匹配锚文本，链接看起来可疑地像付费链接。5.你是否提出了一个有用的链接？确保这一点归结为两件事：创建独特且有价值的内容提供与环境相关的有用机会例如，这篇文章包含关于购买外链成本的独特数据。这对大多数SEO来说都是宝贵的信息。但这并不意味着，我们应该在网络上推广每一篇SEO文章。我们需要寻找我们的链接将增加价值的上下文机会下面是一个示例：这篇文章已经建议读者不要购买外链，因为它们往往是不相关的、质量低下的，而且来自骗子。但它没有提到购买链接的高成本。在我看来，这将是页面的一个有用的补充（以我们的帖子链接为源）。最后的想法购买链接有风险，而且风险很大除非你完全理解并接受链接购买的风险，否则这种SEO策略甚至不应该成为考虑因素。对于那些依靠谷歌排名维持生计的合法企业主来说，这肯定不是我要推荐的。有问题吗？在Twitter上联系我。译者，John Zhao，西品东来创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。",
  "headers": [
    {
      "level": "H1",
      "text": "你应该在2023年购买外链吗？不一定"
    },
    {
      "level": "H2",
      "text": "为什么购买外链有风险"
    },
    {
      "level": "H2",
      "text": "为什么人们还在购买外链"
    },
    {
      "level": "H2",
      "text": "链接费用是多少？"
    },
    {
      "level": "H3",
      "text": "利基编辑的成本是多少？"
    },
    {
      "level": "H3",
      "text": "付费访客帖子的费用是多少？"
    },
    {
      "level": "H2",
      "text": "为什么链接要花这么多钱？"
    },
    {
      "level": "H2",
      "text": "如何安全地建立链接"
    },
    {
      "level": "H3",
      "text": "1. 网站看起来合法吗？"
    },
    {
      "level": "H2",
      "text": "2. 搜索流量稳定吗？"
    },
    {
      "level": "H3",
      "text": "3.网站是否一直在出售链接？"
    },
    {
      "level": "H3",
      "text": "4.网站是否一直在购买链接？"
    },
    {
      "level": "H3",
      "text": "5.你是否提出了一个有用的链接？"
    },
    {
      "level": "H2",
      "text": "最后的想法"
    }
  ],
  "author": "Joshua Hardwick"
}