{
  "url": "https://ahrefs.com/blog/zh/carwow-seo-case-study/",
  "slug": "carwow-seo-case-study",
  "title": "信息汇集网站的聚合策略 - Carwow SEO 案例研究",
  "description": "看看 carwow 的 SEO 策略、它抓住的机会等，是如何帮助它增长自然流量和业务的。",
  "content": "Mateusz Makosiewicz Ahrefs 的营销研究员和教育家。 Mateusz 在推广代理、SaaS 和硬件业务领域拥有超过 10 年的营销经验。平时喜欢创作音乐或享受长距离的散步。 内容 信息汇集是指一个收集和重新编排已有的商品的业务，它向客户提供了额外的价值。信息收集方通常不创造内容，因为内容是通过其他创造者提供给他们的。想想谷歌、Facebook、YouTube 或 Spotify。内容方则站在另一边。他们会创造新商品（产品、服务、内容等）以满足市场现有需求、或产生新需求的企业。本案例研究的对象是一个信息汇集方。但与典型的聚合类网站不同，虽然它自身不产出内容，但页遵循了典型的网站的推广策略：定期创建用于 SEO 的内容。其结果也是相当令人印象深刻。让我们看看它采取了什么样的 SEO 策略，以及它是如何运用的，从而每月产生这么多的流量。内容carwow – 概览 如果你没有听说过 carwow，它是一个购车比较平台，你指定你想买的汽车种类，它会提供各个经销商准备的报价。用户可以创建一个免费账户，无需讨价还价就能获得体验良好的交易。如果你想卖掉一辆车，它的工作方式也一样。基本上，carwow 将为你联系最佳报价的汽车经销商。你还可以查看新车和二手车的现有库存。但大多数人可能是通过其原创的汽车评测视频知道 carwow 的。它实际上是世界上最大的汽车 YouTube 频道之一（773万订阅者，可以算是最大的汽车频道了）。因此，carwow 的集合策略就是它从市场的一方获取汽车交易信息并将其提供给另一方。carwow 的内容方就是那些为他提供原创内容的部分：汽车评测、新闻、指南、免费工具等。carwow 的特别之处还在于，它是最早将这种购车体验引入英国市场的公司之一（卫报）。这项服务对消费者是免费的，但汽车经销商确实为他们通过 carwow 获得的线索付费。如果我没看错的话，一个新车询价导致的购买，经销商需要支付 38 英镑（约合 46 美元），而经销商从该平台购买一辆二手车至少需要支付99英镑（约合 120.6 美元）。这个系统能够成立是因为：消费者不需要访问多个经销商、并讨价还价。消费者可以从值得信赖的经销商那里获得更好的价格。一些经销商通过这种方式获得更多的客户（但 CEO 承认，一些经销商并不太喜欢 carwow 的存在）。汽车制造商可以得到关于汽车经销商提供的服务质量的反馈。制造商可以提高品牌忠诚度（如果买家对服务不满意，可以选择另一家经销商，而不是更换品牌）。好了，现在我们知道这项业务是如何运作的，让我们专注于它的 SEO 上。关键 SEO 策略重要的是，当涉及到自然流量时，carwow 是其类别中最大的网站之一；当涉及到自然流量价值时，它是最大的。它仅从英国就获得了令人印象深刻的 260 万月度自然流量（价值相当于 350 万美元的广告），使它在其利基市场中排名第二。如果我们将流量按产生流量的页面来划分，carwow 将是最 “有效” 的网站。有趣的是，引用域的数量与自然流量的情况完全不同。只有一个网站的引用域数量比 carwow 少。carwow SEO 的关键是什么？该公司成为一个整合者（即内容创造者），从而成为一个成功的信息汇集者。SEO 可能是关键原因之一。为了理解这家公司为什么要定期创建原创内容，让我们看看它成功锁定的一些关键词（通过 Ahrefs’ Keywords Explorer（关键词分析）获得的数据）。关键词类别例子搜索量 (UK)carwow 的排名 （UK）新车上市Kia ev 6115K4二手车二手车交易5.9K2车品牌Skoda98K7车型混合动力汽车38K1宣布的汽车Ferrari suv22K3工具Tesla超级充电站地图33K3指导内容更改驾驶执照上的地址85K5另外还有大量关于汽车和驾驶员相关的关键词，这些关键词可以做成不错的博客文章，例如：如果你的汽车淹水了，该怎么办？无钥匙汽车盗窃案：你需要知道的事情 如果你把这个数字乘以可用的关键词（市场上的汽车，与汽车有关的问题等），再加上 YouTube 上的搜索需求，你就会得到一个巨大的自然流量机会。该公司把这个机会付诸于行动。如果你看一下其网站的结构分解，你可以清楚地看到是 carwow 提供的信息驱动了最多的自然流量，而不是商业方面本身。或者，用 SEO 术语来说，是信息类的关键词，而不是商业类的。carwow的网站结构的示例，按自然流量排序。虽然 “博客” 和 “指南” 排在在上面。但大多数自然流量来自评价，而这些评价是按照汽车品牌分组的。carwow 如何做 SEO 内容的让我们从策略开始，深入了解它的内容类型。策略从本质上讲，carwow 的受众由以下方向组成的：有可能在不久的将来买车的人 — 自然，品牌希望在时机到来时成为人们的首选。在市场上购买二手车或新车的人车主 — 他们有一天会想更换他们的汽车。汽车爱好者 — 我的意思是，还有谁会关注一辆旧的雷克萨斯或宝马在没有发动机油的情况下是否会运行得更久（180万次浏览）？这群人对任何想在汽车行业建立顶级品牌的人来说都很重要。汽车是一种特殊的产品。很多车主也是汽车发烧友。有了这样的受众，carwow 不能只是定目标在 “当场” 转化的高意向关键词，如 “car leasing” 或 “buy car online”。相反，它需要不同类型的内容，在客户的旅程中的不同阶段提供 “协助”。因此，它的内容就有：纯粹的娱乐性内容 — 汽车对碰比赛，例如 “which car will die first” 等奇怪实验的视频。旨在教育的内容 — 这就是文字和视频的汽车评测（它们也很有娱乐性）和各种指南，例如，如何为你的汽车融资。旨在参与的内容 — 在这里，我们会发现大部分工具：配置器、计算器、比较器、交易浏览器等。有趣的是，carwow 也关注汽车的最新消息。当任何特定的汽车出现在新闻中时，它就开始写，接着是新车交易的评测，最后是二手车交易。因此，例如，在大众 ID.5 上市之前，carwow 在新闻栏目中写到了它。然后，当ID.5在市场上出现时，它失去了排名 — 因为搜索意图改变了。但后来，它对该车进行了评测，并以新的内容再次符合搜索意图，对该关键词进行了排名。这个排名历史图表告诉我们整个故事。网站结构carwow 拥有的两个最重要的资产是汽车交易和汽车评评测。这些资产有其独特的 SEO 机会，如果网站结构不优化（如有门槛的的内容、或无用的内容类别），这些机会将被浪费掉。carwow 向用户 “提供” 这些资产的过程，其实就是 SEO 与可用性的结合。问题是，同样的内容可以提供给寻找不同东西的不同用户。这一切都取决于你如何提供内容。因此，不仅是这些资产可以获得自然流量，而且这些资产的类别也能获得自然流量。顺便说一下，这正是为什么 SEO 人员应该对网站的外观和工作方式有自己的发言权。同样的 “重新包装 “内容的想法可以在各种综述文章中观察到，如 “Safest Cars of 2023″（每月2.4万次自然浏览）或 “10 most fun cars to drive”（3.9万次浏览），其中包含了汽车交易和评测。汽车交易在进入汽车评测之前，我们先来看看汽车交易。这里有趣的是，carwow 不需要显示实际的交易，就可以在与汽车交易相关的关键词中获得排名。它可以从搜索引擎获得免费流量，而不需要透露用户保留的信息。对这些页面来说，似乎可以做到的是：一堆车的规格。一个建议的价格。一些融资细节。用户不会看到直接来自搜索引擎的实际报价。汽车评测汽车评测是这个网站的特色。毕竟，这是为该网站带来最多自然流量的地方。我将为你省去标准的 SEO 内容，而专注于那些突出的东西。首先，它的汽车评测不只是试驾汽车后写下的印象；它们不是传统意义上的评测。它们更像是小型的内容中心内容，只以评测为基础。在实践中，它们与购买汽车一样，都是关于学习汽车的。当然，对于这种业务来说，这种特殊的组合是很自然的。但有趣的是，这也是谷歌认可的一种特定的搜索意图。更多的时候，正是这种页面最有机会排在汽车型号的前10位（除了那些来自汽车制造商和维基百科的页面）。在比较传统的评测，如 Wired 和 carwow 的评测时，你可以看到区别。就像任何内容中心一样，carwow 的评测并不只是一个单一的页面。它们还有关于汽车的某些特征的子页面，如内饰、规格或颜色。我认为这种策略有助于 carwow 掌握搜索意图。例如，由于关键词 “volvo xc40” 可能意味着与汽车有关的不同事情，这使得以内容中心的形式提供内容非常有意义。当你看一下 carwow 的竞争对手，他们也在做同样的事情。与所有的内容中心一样，通过做一个关于汽车的评测，它的排名不仅包括支柱页面所针对的关键词，而且还包括集群内容（子页面）所针对的关键词。另外，值得一提的用户体验。至少在我看来，用这种分页方式浏览评测，要比滚动浏览一个包含所有内容的页面要容易得多（这是它过去的做法）。至于内容本身，carwow 赌的是由内部团队制作的原创内容。这是一个有趣的转折，因为在它成为我们今天所知的 carwow 之前，它是一个汽车评测合集网站。毫无疑问，原创汽车评测使其作为买方和卖方之间的中介企业更值得信赖。但与此同时，它向谷歌发出了一个强大的 E‑E-A‑T 信号，因为搜索巨头更喜欢由对该主题有第一手经验的人创建的原创内容——即真实使用者的评价。同时，其内容平易近人，易于消化，甚至具有娱乐性——非常像其视频评测。它是用每个人都能理解的语言写的，它涵盖了购买和拥有汽车的所有主要方面。听起来完全就是谷歌想要的内容类型。正如你所看到的，这是一种非常实用、并对消费者友好的风格。一旦 carwow 明确了它的制胜策略，它就一直在重复这一策略，始终在汽车评测方面排名前十。免费的工具从商业角度来看，信息收集方不必为检查英国的堵车费这样的事情创建一个工具。但这是一个获得免费自然流量的好机会，也是一个帮助司机的机会。像 carwow 这样的品牌在任何时候都应该这样做。如果 ULEZ 查询工具、和堵车费查询工具实际上是相同的工具，那又如何？谷歌并不介意，我打赌用户也不会介意。如果谷歌认为这些是两个不同的事情，这意味着这是一个机会，可以通过一个几乎相同的解决方案来解决这两种搜索需求。Two practically identical tools tap into separate pools of search demand.At the same time, these two tools pose an excellent business opportunity. The tools work by showing data based on registration plates, and entering a registration plate is a few steps away from getting a deal on your car. 不错的转化路径。这就把我们带到了下一个问题。转化SEO 更多的是为网站带来流量，还是之后的事情？好吧，可能是两者都有。毕竟，最好的流量是能带来潜在客户的流量，对吗？我想，看看一个生产各种内容的网站是如何实现访客转化的。看着这个网站，你不能不感觉到它是经过精心设计的，以最大限度地榨取流量。我们可以知道：突出优惠，把评测推到后面。粘性横幅。页脚横幅。文本中的文字提示。工具（汽车测验和汽车估价器）。这似乎是一个很大的问题。但我们要记住，价格和交易才是用户最终追求的东西，尽管他们是为了评测而来。但是在这种情况下，可以多做一步处理，比如在评测的页面上突出优惠。这个页面应该主要是关于评测的，但评测在视觉上被推到了后面（只是一个蓝色的链接，而不是一个大按钮）。其他见解除了内容，carwow 在其他几个方面显示了他们 SEO 的专长。主题权威性carwow 是如何在新车评测中立即排名的？而为什么像 Wired 这样的知名杂志对起亚 EV6 的评测会落在carwow 这样的网站后面？我认为这是因为主题的权威性。专题权威是一个 SEO 概念，一个网站的目标是成为一个或多个主题上的权威网站。举例来说，Wired 不是一个专门讨论汽车的网站，而 carwow 是。因此，即使 Wired 对起亚EV6做了评测，它的目标也不是要成为汽车方面的权威。不像carwow。该公司广泛而经常地写关于汽车和汽车相关的主题。这使它能够实现两件事：密集的相互链接和获得大量的反向链接机会。而这些有助于在谷歌眼中建立主题权威性。而当你成为谷歌眼中的汽车权威时，你可以立即获得与汽车有关的关键词排名。我认为在 carwow 的情况下，主题权威性是一个必须具备的策略，因为所有和汽车相关的都是他的竞争对手。所以，在 carwow 的市场中，投资于 SEO 就是所有方向都投入。内部链接保持你的重要页面与你的主页链接，这是一个相当常见的 SEO 做法。这通常是通过将这些页面在菜单中相互内链来实现的。然而，这并不总是最好的解决方案。你可能有太多的重要页面要包含在菜单中，有些页面可能对搜索引擎优化很重要，但不是浏览网站的最佳方式。这就是 carwow 的情况。上层菜单只包含最重要的导航页面。所有其他重要的页面，从搜索引擎优化的角度来看，都在网站的下面。这是一个简单的解决方案，在处理大型网站时值得借鉴。重要的导航页面放在了上方的菜单中。没有进入菜单，但重要的 SEO 页面链接被放在了底部。收购 Wizzle 的 SEO2021年6月，carwow 收购了 Wizzle，一个二手车购买平台。这样一来，carwow 不仅成为新车的首选之地，也成为二手车的首选之地。carwow 在 SEO 方面处理收购的方式也是值得参考的。只要看一眼 Ahrefs’ Linked Domains（链接域名）报告，就会发现一切都很清楚：首先，主页。我们可以看到，Wizzle 的主页已经被永久重定向 — 但没有重定向到 carwow 的主页。该公司做出了正确的举动，使链接权重流动起来。重定向已被转到 carwow.co.uk 的部分，其目的与被重定向的页面相同（销售二手车）。我们还可以看到，同样的逻辑也被应用于 Wizzle 的某些页面。关于汽油价格、堵车费、和 ULEZ 的页面已经被重定向到 carwow 的相应页面。汽车新闻被重定向到汽车评测还记得 carwow 如何在任何时候都能抓住汽车型号的搜索意图吗？首先，它在新闻部分写了关于一辆汽车的报道。而当该车在市场上出现时，它就会做一个评测。这里引起我注意的是，当新闻变得过时时，它并不保留。相当一部分的新闻文章被重新定向到评测。我可以看到这样做的两个主要好处。首先，链接权重可以从新闻页面流向评测页面。而一些新闻文章已经从维基百科获得了链接。另一个是摆脱表现不佳的内容，为更多最新的和符合搜索意图的内容让路。谷歌认为表现不佳的内容是内容质量差的标志，这并不是什么秘密。最后要把握住一个 SEO 的机会，说起来容易做起来难。对于 carwow 来说，抓住机会意味也需要做信息汇集，在经营 “常规” 业务的同时经营一家媒体公司。成本虽然很高。但是，如果你的业务是销售汽车，而谷歌将你列在真正制造汽车的公司旁边，这肯定是有价值的。但是，如果你非常擅长制作内容，以至于人们忘记了你的业务怎么办？这是内容营销中一个典型的陷阱，在专业的人员上会发生，它也可能发生在 Carwow 身上。出于这个原因，Carwow 在其网站上使转化是明确可见的，这并不令我感到惊讶。它甚至发明了一个搜索词，叫做 “Help me carwow”，它在每条评测中都推广。我相信这应该是为了使从观看视频评测到使用该平台的转换路径更短。https://youtu.be/t6KoEJWLe78?t=141有问题吗？在 Twitter 或者 Mastodon 上找我吧。译者，Park Cheng，歪猫出海创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Mateusz Makosiewicz Ahrefs 的营销研究员和教育家。 Mateusz 在推广代理、SaaS 和硬件业务领域拥有超过 10 年的营销经验。平时喜欢创作音乐或享受长距离的散步。",
  "headers": [
    {
      "level": "H1",
      "text": "信息汇集网站的聚合策略 — Carwow SEO 案例研究"
    },
    {
      "level": "H2",
      "text": "carwow – 概览"
    },
    {
      "level": "H3",
      "text": "关键 SEO 策略"
    },
    {
      "level": "H2",
      "text": "carwow SEO 的关键是什么？"
    },
    {
      "level": "H2",
      "text": "carwow 如何做 SEO 内容的"
    },
    {
      "level": "H3",
      "text": "策略"
    },
    {
      "level": "H3",
      "text": "网站结构"
    },
    {
      "level": "H3",
      "text": "汽车交易"
    },
    {
      "level": "H3",
      "text": "汽车评测"
    },
    {
      "level": "H3",
      "text": "免费的工具"
    },
    {
      "level": "H3",
      "text": "转化"
    },
    {
      "level": "H2",
      "text": "其他见解"
    },
    {
      "level": "H3",
      "text": "主题权威性"
    },
    {
      "level": "H3",
      "text": "内部链接"
    },
    {
      "level": "H3",
      "text": "收购 Wizzle 的 SEO"
    },
    {
      "level": "H3",
      "text": "汽车新闻被重定向到汽车评测"
    },
    {
      "level": "H2",
      "text": "最后"
    }
  ],
  "author": "Mateusz Makosiewicz"
}