{
  "url": "https://ahrefs.com/blog/zh/content-strategy/",
  "slug": "content-strategy",
  "title": "如何创建成功的内容策略",
  "description": "内容策略可帮助您回答诸如创建内容的原因和方式、内容面向谁、以及您将如何利用内容来提升业务等问题。",
  "content": "Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。 内容 我们在 Ahrefs 的内容策略很简单。简而言之，我们：创建人们在 Google 和 YouTube 上搜索的相关主题的博客和视频。在 Twitter 和我们的订阅中用有用的内容培养和教育这些人。在我们的帮助中心、学院和我们的工具中使用以产品为中心的教程来留住客户并建立品牌忠诚度。这个策略对我们来说非常成功。我们的博客每月从 Google 获得 500K+ 次访问，在我们的邮件列表中有 100K+ 人，在 YouTube 上有 200K+ 订阅者。更重要的是，它帮助我们的年度收入多年来一直保持增长。但是，虽然你可以盲目复制我们的内容策略，但这不一定是明智的，因为对我们有用的方法可能对你不起作用。这就是我们编写本指南的原因 — 向你展示如何创建对你的业务有意义的内容策略。这是你将学到的一切：什么是内容策略为什么制定内容策略很重要？如何制定内容策略什么是内容策略内容策略侧重于内容的目标和计划。在这里包括诸如创建内容的原因和方式、内容的用途、以及最终如何利用内容来营销你的业务等问题。内容策略和内容营销有什么区别？内容营销是为营销目的而创建、编辑和推广内容的过程。它可能是博客文章、视频、产品文档——任何有助于你吸引、培养和留住客户的东西。换句话说，内容营销是进一步执行内容策略的方法。如果你创建内容策略和内容营销的维恩图，则交叉点就是你的内容营销策略。内容营销策略本身与你的内容营销工作的规划和编排有关。它涉及定义你的品牌和风格、内容构思、创建内容日历、设置和衡量目标等等方向。为什么制定内容策略很重要？内容策略就是确保你创建的每个内容都有其目的。它会并阻止你在对你的业务没有任何作用的随机内容上投入资金。它还有助于确保你以正确的格式、为正确的频道、为正确的受众用户创建内容。如何制定内容策略创建内容策略可能是一个相当艰巨的过程，因此我们创建了一个简单的框架来使事情变得更容易，称为内容策略画布：内容策略画布的目的是通过回答五个简单的问题来帮助你创建基本的内容策略：你在为谁创作内容？你为什么要创造内容？你将创建什么类型的内容？你将在哪里发布内容？你将如何创建内容？让我们来看看如何回答这些问题。问题 1: 你在为谁创作内容 将你想要接触的人用文字表述出来是第一步，也是最关键的一步。它将作为你所有内容创建工作的指路明灯，并帮助你走上正轨。如果你已经完成了市场调查并创建了客户角色，这应该很容易。你已经对要联系的人有了明确的认识。例如，如果你是佛罗里达州的抵押贷款经纪人，则可能类似于下面这样：佛罗里达州的千禧一代夫妇（25–30 岁）渴望拥有他们的第一个家。他们是时间紧迫的工作专业人士，并且对房产的复杂性感到沮丧。如果你不太了解你的目标对象，请随意扩大范围。例如，作为 SEO 软件的提供商，会像下面这样写：想要为他们的网站带来更多流量的人。它有点过于简单化，但足以帮助我们避免创建无效主题的内容。例如，以 “reverse image search” 之类的主题为例。从表面上看，这听起来像是一个与 SEO 相关的话题，它在美国的每月搜索量估计为 160 万次…………但现实情况是，大多数搜索此内容的人可能甚至没有网站。他们可能只是想确认图片的来源而已。到目前为止，这是我们的内容策略画布：问题 2. 你为什么要创造内容？ 每个内容都应该有一个目的。广义上讲，有四种： 提高品牌知名度并将你的品牌介绍给潜在客户。通过教潜在客户更多关于他们的问题，以及你的产品或服务如何解决这些问题，来创造兴趣和愿望。通过进一步教育潜在客户有关你的产品或服务，以及为什么它是最适合用户的解决方案，来培养兴趣并吸引购买。通过教育客户如何充分利用你的产品或服务，并清楚地展示其价值，留住客户并建立品牌忠诚度。如果你熟悉营销漏斗，你会注意到这四个 “目的” 与购买过程的各个阶段大体一致。无论哪种方式，你都会看到这些 “为什么” 已预先填写在内容策略画布上，因为你需要为所有目的创建内容。毕竟，如果没有人向你购买任何东西，那么拥有知名品牌就毫无意义，如果你无法留住客户，那么努力吸引客户也毫无意义。但是，在我们继续之前了解一件事很重要：每条内容都可以用于多种用途。我们的许多博客文章都在实践中提供了示例。例如，以 “如何找到低竞争关键词” 这样的主题为例。这篇文章可以说在不同程度上服务于营销漏斗的所有阶段。当然，其它的一些内容将更专注于解决一个问题。例如，以我们的 “Ahrefs vs.” 页面为例。本页解释了与我们的竞争对手相比，业界对 Ahrefs 的看法，并展示了我们的一些独特功能。以下是根据我的估计，解决和没有解决的问题：根据你在内容营销旅程中所处的位置，你可能需要更多地关注这些 “目的” 之一而不是另一个。这是内容审核可以派上用场的地方，但这是另外一个话题。问题 3: 你将在哪里发布内容？知道为什么要创建内容是一个好的开始，但你还需要知道在哪里发布内容以吸引客户和潜在客户。鉴于如今有无数的可发布的选项，这个过程可能会让人不知所措。以下是可以发布内容的几个地方：博客/网站YouTube社交媒体邮件Slideshare作客博客 (或是别人的网站上)播客Q&A 网站 (例如 Quora)那么你应该选择哪个？首先，不要尝试为每个可以想象的频道创建内容。这些都可行的选择，但你无法做所有事情 — 特别是当你刚刚开始内容创作时。 其次，不要随意选择。你应该选择一两个对你的业务最有意义的渠道，并且你应该根据对两个问题的回答来选择这些渠道：哪些渠道可以解决你的“为什么”？你的客户如何以及在哪里在线获取信息？让我们从回答第一个问题开始.…..每个好的内容策略都涉及为旅程的每个阶段（从品牌知名度到客户保留）创建内容，但并非所有营销渠道都适合解决所有问题。例如，发布电子邮件通讯对建立品牌知名度毫无用处，因为那些不了解你品牌的人不会订阅。同样，播客也不太可能帮助你留住客户并建立品牌忠诚度。你需要选择一个适合所有阶段的通道或多个互补通道。以下是最受欢迎的渠道备忘单，可为你提供一些帮助：你怎么知道选择哪两个频道？这是第二个问题派上用场的地方：你的客户如何以及在哪里在线获取信息？你的市场调查应该已经找到了这个问题的答案，但如果你不确定，请考虑直接询问或调查你的客户。或者，如果你正在考虑将你的博客/网站或 YouTube 频道作为你的营销媒介之一，请使用关键词研究工具，如 Ahrefs Keywords Explorer（关键词分析），来查看人们是否正在搜索与你的业务相关的主题。例如，我们看到每个月都有成千上万的人在 Google 和 YouTube 上搜索与 SEO 相关的主题：这告诉我们在这些频道上发布内容对我们来说很有意义。我们也知道我们可以使用社交媒体和电子邮件营销来培养和留住客户，因此我们也会为这些渠道创建内容。问题 4. 你将创建什么类型的内容？如果你打算在 YouTube 上发布内容，很明显你将发布视频，因为这是你可以发布的唯一内容类型。但对于许多其他营销渠道，事情并不总是那么明显。以你的网站为例。你可以发布多种类型的内容，包括：博客帖子白皮书落地页Wiki类内容交互类工具视频教程没有人拥有无限的资源来创建内容，因此值得考虑你要关注的内容类型。例如，在我们的网站上，我们主要专注于创建三种类型的内容：博客文章Wiki类内容交互类工具目前，我们有 906 篇博客文章，根据 Ahrefs Site Explorer（网站分析）中的 Top subfolders（热门目录）报告，我们的博客每月估计有 253K 次搜索访问。小提示. 这些博客文章中有许多是翻译的；我们只有大约 300 个英文帖子。 我们有 10 个免费工具，估计每月有 301,000 次搜索访问。我们有 267 篇 Wiki/帮助类文章，估计每个月的搜索访问次数为 2.3K。与我们的博客和免费工具相比，对我们 Wiki 文章的 2.3K 访问量似乎可以忽略不计，但这些内容的目的并不是为了增加大量流量。其目的是通过回答有关我们工具集的常见问题来教育和留住客户。在 Twitter 上，我们主要专注于创建和分享产品的更新……NEW: The “Organic traffic” graph now accounts for seasonal fluctuations of search volume!This data will show in Organic keywords 2.0, Top Pages 2.0, and the Organic search tab and metrics in your Site Explorer Overview.pic.twitter.com/eLmZrzygZB— Ahrefs (@ahrefs) May 6, 2021 推特译：新：“自然流量” 图表现在加入了搜索量的季节性波动！此数据将显示在 Organic keywords 2.0、Top Pages 2.0 以及 Site Explorer 概览中的选项卡和指标中。…以及从我们的博客文章中提取的知识信息：If you have custom illustrations or infographics on your site, it’s highly likely that others will use them in their content.For example, here’s a graph from our post about long-tail keywords on another blog:pic.twitter.com/6q32eEbB9G— Ahrefs (@ahrefs) December 29, 2020推特译：如果你的网站上有自定义插图或信息图表，其他人很可能会在他们的内容中使用它们。例如，这是我们在关于长尾关键词的文章中的图表：在填写内容策略画布的这一部分时，不要想太多。只需记下旅程中每一步的相关内容类型即可。在有意义的多个阶段使用相同类型的内容也很好。例如，我们将博客文章用于从提高品牌知名度到培养客户的所有方面，因此我们在画布中的所有阶段都列出了该内容类型。但我们只在客户留存阶段列出维基/帮助文章类型。问题 5. 你将如何创建内容？创建内容策略不仅仅是计划要做什么。你还需要考虑如何执行你的计划。换句话说，你需要问问自己：“我需要什么资源？”你可以将这些资源分为两类： 人。你需要雇佣谁，需要什么技能？ 产品和服务。你需要什么工具或服务？例如，假设我们想为一个新品牌创建博客内容和 YouTube 视频，我们可能至少会接触以下人员：内容创作者编码师博客编辑者摄像师剪辑师设计师虚拟助理 (VA)我们还需要一些产品和服务，包括： Ahrefs 用于研究主题 Wordable 用于上传博客文章 Grammarly 用于编辑内容 Adobe Premiere Pro 用于编辑视频 Adobe Photoshop 用于设计博客文章图片相机、三脚架、镜头、麦克风和其他录音设备这是我们完整的画布：最后拥有内容策略对于保持你的内容创建工作正常进行，并确保你创建的内容目标明确是十分重要的。毕竟，人们经常会陷入为了内容而制作内容的困境中。如果你已经创建了内容策略，下一步是创建内容营销策略并开始创建内容。 有问题？Twitter 上找我吧。译者，Park Cheng，歪猫出海创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。",
  "headers": [
    {
      "level": "H1",
      "text": "如何创建成功的内容策略"
    },
    {
      "level": "H2",
      "text": "什么是内容策略"
    },
    {
      "level": "H3",
      "text": "内容策略和内容营销有什么区别？"
    },
    {
      "level": "H2",
      "text": "为什么制定内容策略很重要？"
    },
    {
      "level": "H2",
      "text": "如何制定内容策略"
    },
    {
      "level": "H3",
      "text": "问题 1: 你在为谁创作内容"
    },
    {
      "level": "H3",
      "text": "问题 2. 你为什么要创造内容？"
    },
    {
      "level": "H3",
      "text": "问题 3: 你将在哪里发布内容？"
    },
    {
      "level": "H3",
      "text": "问题 4. 你将创建什么类型的内容？"
    },
    {
      "level": "H3",
      "text": "问题 5. 你将如何创建内容？"
    },
    {
      "level": "H2",
      "text": "最后"
    }
  ],
  "author": "Joshua Hardwick"
}