{
  "url": "https://ahrefs.com/blog/zh/content-marketing-tools/",
  "slug": "content-marketing-tools",
  "title": "19 种促进增长的内容营销工具",
  "description": "我们精心挑选了终极内容营销的 19 种工具，并详细说明了我们喜爱的功能。",
  "content": "Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。 内容 我从事内容营销工作已有十多年（包括在 Ahrefs 担任内容主管的 5 年多时间）。在此期间，我尝试过很多内容营销工具。我强力地推荐以下这些内容营销工具：ChatGPT 用于创建内容大纲。Google Docs 用于撰写内容。Grammarly + Hemingway 用于编辑内容。WordPress + Wordable 用于发布内容。Bannerbear + Snagit + Storyblocks 用于创建内容视觉效果。Buffer 用于在社交媒体上推广内容。Mailchimp 用于向电子邮件订阅者推广内容。BuzzStream + Hunter 用于通过电子邮件进行外展的工作。Ahrefs 使你的内容在谷歌中排名靠前。Google Search Console 用于衡量自然搜索性能。Basecamp + Slack + Zapier 用于管理内容创建流程。让我们来详细了解一下这些工具，以及我推荐它们的原因。Ahrefs它是做什么的：帮助你提高内容在谷歌中的排名。我为什么喜欢它：如果没有 Ahrefs，做 SEO 就……很费劲。它可以帮助进行关键词研究、链接建设、技术SEO，等需要做的一切事情，它可以让你的内容在谷歌上排名靠前，获得更多流量。不，我并不是因为在这家公司工作才对它大加赞赏。在我任职之前，我已经使用 Ahrefs 多年。事实上，我之所以加入这家公司，是因为我太喜欢这个工具了，这是我无法拒绝的邀请。价格：每月 99 美元以上（提供免费工具）。WordPress它是做什么的：轻松建立和管理网站或博客。我为什么喜欢它： 它简单易用，SEO 友好。它完美吗？这并不重要，因为你可以使用成千上万的插件来扩展它的功能。例如，Yoast、WP Rocket 等插件以及我们自己的免费 SEO 插件都可以通过点击几下来扩展 CMS 的 SEO 功能。价格：免费。Google Search Console它是做什么的：帮助你衡量和改进内容在自然搜索中的表现。我为什么喜欢它：没有比它更容易找到需要更新的内容了。只需进入 “性能报告”，比较过去六个月与前六个月的情况，点击 “页面”，然后按 “点击量差异” 从低到高对表格进行排序。它会告诉你哪些内容在此期间流量损失最大，这样你就可以考虑对它们进行内容更新了。价格：免费。Google Docs它是做什么的：帮助你协同创建和编辑内容。我为什么喜欢它：它可以在每次按键后自动保存（不会再因为 Word 崩溃而丢失草稿），可以在浏览器中运行（无需安装），而且是围绕协作而构建的（评论、轻松共享）。考虑到我们的团队分散在全球各地，我认为如果没有它，我们的工作效率将大打折扣。价格：免费。Zapier它是做什么的： 将应用程序连接在一起，实现工作流程自动化。我为什么喜欢它：它能将你从枯燥重复的工作中解放出来。例如，我最近用它来自动回复客座博客的投稿。将它们全部拉入谷歌工作表后，我使用 Zapier 根据我在谷歌工作表的下拉菜单中选择的内容自动发送批准或拒绝邮件。这意味着我可以通过一张电子表格管理我们的整个客座博客的发布计划（目前已暂停）。无需反复登录 Gmail。价格：提供免费计划；付费计划每月 19.99 美元起。Grammarly它是做什么的：帮助你提高写作水平。我为什么喜欢它：Grammarly 不仅能修正基本语法错误。它还会建议如何提高写作的清晰度和沟通效率。如果你像我一样有冲动、和撰写不必要的冗长句子的倾向，那么这就是一个改变游戏规则的工具。如果你安装了免费的浏览器插件，它还可以直接与 Google 文档配合使用。价格：提供免费计划，付费计划每月 12 美元起。Hemingway它是做什么的：有助于提高内容的可读性。我为什么喜欢它：我的工作是教人们如何做复杂的事情，所以我一直在努力避免写作中出现专业术语和冗长的文字。Hemingway 可以帮助我用更简单的替代方法突出难读的句子和短语。但请记住，要慎重对待 Hemingway 的建议，不要执着于这些建议。这个游戏不是为了获得 “满分”。而是为了提高文章的整体可读性。价格：在浏览器中免费使用；桌面应用程序售价 19.99 美元。Basecamp它是做什么的：帮助你管理和协作内容项目。我为什么喜欢它：与其他大多数项目管理工具相比，它更简单、更省事。例如，它甚至没有为看板添加自定义字段的选项。刚开始使用时，我觉得这是一个很大的缺点，但后来我意识到，缺少这样的功能实际上有助于简化工作。它鼓励你创建更简单、更不复杂的工作流程。价格：每个用户每月 15 美元。Slack它是做什么的：帮助你与内容团队实时沟通。我为什么喜欢它：Google Docs 有其局限性。有时，你只需要实时地讨论问题。Slack 就非常适合这种情况。如果不是 Sam Oh（负责 YouTube 频道）和我经常就彼此的草稿讨论反馈意见，我想我们的博客文章或视频不会有现在一半的质量。如果我们用电子邮件来做这件事，每次回复都要等上三个小时。价格：提供免费计划；付费计划每位用户每月 7.25 美元起。Mailchimp它是做什么的：向电子邮件订阅者分发内容。我为什么（有点）喜欢它：它易于使用，每月可免费向 500 名联系人发送多达 1,000 封电子邮件。它是最好的吗？老实说，我也说不好。ConvertKit 有一个免费计划，可以让你管理多达 1,000 个订阅者，所以对某些人来说可能更好？但是我选择的是 Mailchimp 是因为我一直在用它，它也能完成我需要的工作。价格：最多可免费订阅 500 个用户，之后每月 13 美元起。Bannerbear它是做什么的：自动创建社交媒体效果图。我为什么喜欢它：每个人都对 Canva 制作社交媒体图片赞不绝口，但这仍然是一个手动过程，并不理想。Bannerbear 可根据模板自动生成社交媒体视觉图片，让生活变得更轻松。它还与 WordPress 集成。我们使用它已经有六个月了，它极大地简化了我们的内容制作流程。价格：每月 49 美元起。BuzzStream它是做什么的：帮助你通过电子邮件推广进行外展活动。我为什么喜欢它：BuzzStream 鼓励以关系为基础的内容推广方式，而不是许多其他类似工具所采用的 “群发、等待” 的方式。它本质上是一个推广工具和客户关系管理（CRM）的结合体。不过不用担心。它仍然具备所有常用功能，如自动跟进和提醒，让你的工作更轻松。价格：每月 24 美元起。Hunter它是做什么的：查找电子邮件地址。我为什么喜欢它：通过免费的 Google Sheets 附加组件，批量检查电子邮件地址变得超级简单。你只需输入联系人的名字、姓氏和工作网站就可以实现批量查询。此外，还有一个 API 和 Zapier 集成，可将其构建到你的工作流中。几年前，我们在推广 SEO 统计列表时就是这么做的（请参阅我们的链接建设案例研究）。价格：提供免费计划；付费计划每月 49 美元起。Storyblocks它是做什么的：为你提供无限量的图片库、视频和音频。我为什么（有点）喜欢它：视频不是我的强项，所以我问我的同事 George Dolgikh（他负责我们的 YouTube 频道）为什么喜欢这个工具。他说，在一个地方就能找到素材、音乐和 SFX，而且它的内容库也很不错。不过，他更喜欢 Shutterstock 提供的照片，认为 Storyblocks 提供的照片 “一般”。价格：15 美元/月起。Google Trends它是做什么的：显示谷歌搜索的长期趋势。我为什么喜欢它：数据可追溯到 2004 年，因此很容易看出人们对某个话题的兴趣是在增长还是在减弱。你还可以用它来查找相关的、热度突然上升的话题。例如，搜索 “ai”，你会看到一堆与 ChatGPT 相关的话题。然后，你就可以抢在竞争对手之前创建与这些话题相关的内容。Price: Free.Buffer它是做什么的：帮助你安排社交媒体的发布。我为什么喜欢它：Buffer 基本上可以为你管理社交媒体。它还会告诉你哪些类型的内容最容易引起人们的参与，这样你就可以在未来发布更多这样的内容。我只在 Twitter 上使用它，但它几乎可以整合所有社交网络（包括 Mastodon）。价格：提供免费计划（足够大多数人使用）；付费计划每月 5 美元起。Wordable它是做什么的：一键将 Google docs上传到 WordPress。我为什么喜欢它：从 Google Docs 中获取内容转移到 WordPress 完全是一场噩梦。如果你复制粘贴，它就会添加一堆流氓代码和格式，你必须手动删除。更糟糕的是，它不会将粘贴的图片上传到 WordPress（图片源会保留在 Google 的服务器上，这并不理想）。Wordable 可以解决所有这些问题。它甚至还能为图片添加 alt 文本。价格：提供免费计划（每月五次导出）；付费计划每月 50 美元起。ChatGPT它是做什么的：帮助你创建大纲和校对内容。我为什么喜欢它：乍一看，ChatGPT 可能并不像一个有用的内容营销工具，但它可以在很多方面为你提供帮助。让它校对和改进你的内容，它就会这么做。让它为一篇文章创建大纲或内容简介，它也会这么做。让它为你的内容建议一个更有创意的标题，或为元描述提供几个选项，它也会这么做。使用这一工具来提高内容质量的方法几乎不胜枚举。价格：有限访问免费；付费计划（ChatGPT Plus）每月 20 美元。Snagit它是做什么的：捕捉屏幕截图和屏幕录像。我为什么喜欢它：我们发布的几乎所有内容都包含屏幕截图，因此多年来我们测试了很多屏幕截图应用程序。Snagit 是我们的首选，因为它有大量的注释选项、主题（我们用它们来保持整个团队的注释风格一致）和屏幕录制功能（我用它来分享对大纲和草稿的 “实时” 反馈）。虽然我不能代表我们团队的其他成员，但我每天都在使用它。价格：62.99 美元起。继续阅读查看这些文章，了解更多有助于内容创作和写作的工具：简化工作流程的 30 多种内容创作工具提高效率的 12 种 AI 文案撰写工具译者，Park Cheng，歪猫出海创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。",
  "headers": [
    {
      "level": "H1",
      "text": "19 种促进增长的内容营销工具"
    },
    {
      "level": "H2",
      "text": "Ahrefs"
    },
    {
      "level": "H2",
      "text": "WordPress"
    },
    {
      "level": "H2",
      "text": "Google Search Console"
    },
    {
      "level": "H2",
      "text": "Google Docs"
    },
    {
      "level": "H2",
      "text": "Zapier"
    },
    {
      "level": "H2",
      "text": "Grammarly"
    },
    {
      "level": "H2",
      "text": "Hemingway"
    },
    {
      "level": "H2",
      "text": "Basecamp"
    },
    {
      "level": "H2",
      "text": "Slack"
    },
    {
      "level": "H2",
      "text": "Mailchimp"
    },
    {
      "level": "H2",
      "text": "Bannerbear"
    },
    {
      "level": "H2",
      "text": "BuzzStream"
    },
    {
      "level": "H2",
      "text": "Hunter"
    },
    {
      "level": "H2",
      "text": "Storyblocks"
    },
    {
      "level": "H2",
      "text": "Google Trends"
    },
    {
      "level": "H2",
      "text": "Buffer"
    },
    {
      "level": "H2",
      "text": "Wordable"
    },
    {
      "level": "H2",
      "text": "ChatGPT"
    },
    {
      "level": "H2",
      "text": "Snagit"
    },
    {
      "level": "H2",
      "text": "继续阅读"
    }
  ],
  "author": "Joshua Hardwick"
}