{
  "url": "https://ahrefs.com/blog/zh/digital-marketing-tools/",
  "slug": "digital-marketing-tools",
  "title": "13个顶级数字营销工具（包括使用技巧）",
  "description": "这些是我多年来使用过并喜欢的13种久经考验的数字营销工具。了解我是如何使用它们的，并立即学习使用。",
  "content": "Michal Pecánek Ahrefs的营销专家和内容创作者。 沉迷于SEO，航空，香氛，寿司和墨西哥玉米卷。 内容 您可以花费无数个小时来了解当今数字营销工具的所有选项和评测结论。在我的职业生涯中，我已经尝试了太多的工具。在这篇文章中，我们将介绍我多年来使用过并喜欢的 13 个久经考验的数字营销工具：AhrefsHunterMailchimpSparkToroBrand24SmartlookVisualpingGoogleGoogle FormsGoogle AnalyticsGoogle Search ConsoleGoogle SheetsGoogle Data Studio我还将为每种工具提供我最喜欢的使用案例，以便您可以立即使用。1. Ahrefs大多数公司认为自然和付费搜索流量是其最重要的流量来源。在这一领域拥有可靠且有洞察力的数据至关重要——而这正是 Ahrefs 发挥作用的地方。Ahrefs是一款集所有功能于一身的 SEO 工具包，用于优化您自己的网站、分析竞争对手、进行关键字研究、获取内容创意、建立链接等。最喜欢的应用案例： 寻找您与竞争对手之间的内容差距该工具集的使用案例数不胜数，所以我只想解释一下我最喜欢的功能之一：Ahrefs Site Explorer（网站分析）中的 Content Gap （内容差距机会）工具。它显示了你的竞争对手排名靠前而你网站却没有参与排名的关键词。这些内容空白可以迅速为您的内容规划提供许多新思路。在 Site Explorer（网站分析）中，输入您自己的域名，然后点击 “Content Gap （内容差距机会）”。您的域名将自动预填在 “But the following target doesn’t rank for（但以下目标没有排名）” 的栏目中。现在只需列出几个您的自然流量竞争对手的域名：点击 “Show keywords（显示关键词）”:您将得到一个庞大的关键词列表。您还可以使用过滤器来整理这个列表。为了提高相关性，让我们选择至少有两个竞争对手网站参与排名的关键词。您可以在交叉过滤器中选择该选项。然后，通过设置最小搜索量和相对较低的 KD 得分来筛选最佳关键词机会：我相信您会通过这种方式找到一些很好的关键词机会。价格订阅一年的月费计划从 83 美元起。Ahrefs Webmaster Tools（Ahrefs 站长工具）可以免费的用于已验证的网站。2. Hunter作为营销人员，您有时不得不发送冷邮件。如果您从事公关或链接建设，这将是您工作的重要组成部分。但许多人并不愿意与公众分享他们的电子邮件地址，而且垃圾邮件已经够多了。寻找正确的电子邮件地址可能需要花费相当长的时间，而且您还经常需要尝试和猜测。Hunter是一款 “电子邮件地址查找” 工具，它能让您更轻松地找到电子邮件地址。最喜欢的用例： 在 Google Sheets 中查找和验证电子邮件地址如果您经常做外链的外展工作，您需要一个比逐个查找电子邮件地址更具扩展性的解决方案。使用 Hunter的 Sheet 插件，您只需点击一下就可以对所有潜在客户进行电子邮件搜索：这不会为每个潜在客户找到匹配的电子邮件地址，但通常会为相当比例的潜在客户找到匹配的电子邮件地址。然后，您可以将这些潜在客户作为您的初始名单，以测试推广活动的可行性。如果成功，您可以使用其他方法继续寻找剩余的电子邮件地址。价格订阅一年的月费计划从 34 美元起。还有一个免费计划，允许您每月进行 25 次搜索。3. MailchimpMailchimp 是一个营销平台，拥有大量的产品和功能——从受众管理到自动化营销。但它最出名的是在电子邮件营销方面，这也是我一直使用它的原因。最喜欢的应用案例： 通过细分实现个性化电子邮件营销如果您正在撰写平日的通知邮件，那么您应该知道，并不是您发送的每封电子邮件都会受到欢迎。有时，人们会抱怨、退订、不采取您希望他们采取的行动，甚至根本不打开邮件。对此有两种解决方案：更好的电子邮件和目标定位。前者主要取决于您自己；后者则是 Mailchimp 通过受众细分提供的巨大帮助。想象一下，您正在进行促销活动，但您只想让特定的客户群知道这件事。没问题。从您的 CRM 中获取客户的电子邮件地址，在您的 Mailchimp 帐户中对其进行标记，然后选择该标记作为 “销售” 电子邮件的接收方即可。来源：Mailchimp.价格月费计划从 11 美元起。还有一个免费计划，允许您每月发送 10,000 封电子邮件。4. SparkToro进行市场调研以了解受众是营销成功的关键。进行市场调研的方法有很多。虽然我喜欢通过调查、访谈等传统方式收集数据，但我也强烈推荐使用像 SparkToro 这样的在线受众研究工具。SparkToro 提供任何受众阅读、观看、收听和关注的信息。这些洞察可以根据关键词、社交媒体账户、网站或标签进行检索。所有这些输入都可以用来更好地了解您的受众。最喜欢的应用案例： 发现竞争对手受众的痛点SparkToro 易于使用和浏览。让我们通过插入公司的 Twitter 个人资料对 SparkToro 的受众做一个实例分析：该工具将返回大量有关受众人口统计的数据。但在本例中，我们将重点关注受众关注点、以及关注的社交媒体账户、网站、播客和 YouTube 频道。以下是过滤粉丝数少于 50K 的个人社交媒体账户后的报告示例：有了这样的数据，您就可以在许多不同的渠道上轻松发现新的广告和赞助机会。您只需将竞争对手的社交资料、网站、关键字和任何 “自有” 标签插入其中，即可获得所有洞察信息。价格订阅一年的月费计划从 38 美元起。还有一个免费计划，允许您每月进行五次搜索。5. Brand24Brand24 会跟踪您希望监测的关键词在整个网络上的提及情况，重点关注社交媒体。您可以使用它来识别和分析围绕您和竞争对手的品牌和产品在互联网上被提及的情况。最喜欢的应用案例： 监视竞争对手的品牌被提及的情况Brand24 围绕您希望跟踪的关键字建立项目。然后可以对这些关键字进行细分、过滤和分析，以获得可操作的见解。所有这些关键词都应该是您利基市场中的品牌、产品、或标签。等下我会告诉您为什么要对竞争对手也这样做。因此，请用竞争品牌和/或产品的名称建立一个（或多个）单独的项目。您会遇到具有其他含义的关键词。您可以将其排除在外，或者使用必填和排除关键字过滤器，将不相关的关键字排除在报告之外：该竞争对手提及监测功能使您能够：根据您所在行业调整您的沟通方式。根据人们对竞争对手产品开发的反应，获得产品洞察力。通过情感分析评估人们如何看待您的品牌和竞争对手的品牌。将您的媒体覆盖率和话声音份额与竞争对手进行对比。我相信还有更多的使用案例。下面是一个来自汇总仪表盘的数据示例：价格订阅一年的月费计划从 49 美元起。没有免费计划，但您可以申请注册 14 天免费试用。6. SmartlookSmartlook是一款用户行为分析工具，如果您还没有研究过此类工具，它的功能可能会让您大吃一惊。它可以向您显示网站访客在您网站上的操作记录、或他们点击最多的热力图。是的，它遵守 GDPR 等数据保护和隐私法规。最喜欢的应用案例： 分析营销漏斗中的漏洞营销漏斗是一个旨在吸引和转化客户（或顾客）的流程系统。如上图所示，越往下越窄。这就是漏斗。在市场营销中，这意味着您在漏斗开始阶段所投入的资源（了解您品牌的人）总是比您在漏斗结束阶段所获得的资源（客户）要大得多。许多营销目标都围绕着最大限度地减少漏斗不同阶段之间的流失。Smartlook 可以帮助您在网站上实现这一点。它可以跟踪每个访客的转化过程，并向您显示在此过程中流失的访客记录：来源：Smartlook您可以分析流失的访客的记录，寻找规律，并在此基础上优化您的网站。价格月租计划从 39 美元起。免费计划允许您每月录制 1,500 个会话。7. Visualping网站设计和文案写作传递着大量信息。它们也在不断发展、测试和变化。无论您承认与否，每个网站都会从竞争对手和业内其他网站获得一些（或很多）灵感。因此，您需要了解这方面的情况。Visualping是一款跟踪任何网页变化的工具。您只需输入竞争对手的 URL，设置警报，任何网站变动都会及时更新。最喜欢的应用案例： 从竞争对手网站的用户体验和 CRO 调整中获得灵感我根据网站监测做出了很多决定。一般来说，对于任何营销人员来说，最常见的使用案例就是从您的竞争对手如何努力从其网站的每位访客身上榨取更多的灵感。换句话说，我们正在寻找用户体验（UX）和转换率优化（CRO）方面的调整，我们可以在网站上采用这些调整，而无需进行所有的研究和A/B测试。您只需设置对竞争对手网站的跟踪，只要有任何值得注意的变化，您就会收到提醒。为此，只需将检查频率设置为每天甚至每周一次即可。您也可以选择 “any change 任何改动 “或 “tiny changes 微小改动”，因为这些调整的范围可以从文案的微小改动到 CTA 按钮位置和颜色的改变：请记住，不要盲目照搬竞争对手的做法，应始终对创意的修改进行审核。价格订阅一年的月费计划从 10 美元起。免费计划允许您每月执行 150 次检查。8. Google这不需要任何介绍。我们每天都在使用谷歌。它拥有地球上最大的网页索引库，拥有最好的搜索算法。但是营销人员在日常工作中并不经常利用它的潜力。它是一个寻找链接建设机会的好工具，但对于最大限度地发挥网站内部链接的力量来说，它的作用则更大。最喜欢的使用案例： 发布新内容后寻找内部链接机会每个网站都有内部链接（一个页面指向同一域名上的另一个页面），但许多网站忽视了它们对搜索引擎优化的作用和影响。为您新发布的内容添加内部链接可以使谷歌更快地发现和索引这些内容，更重要的是，可以使其在 SERP 中排名靠前。要在谷歌的帮助下做到这一点，我们必须使用搜索运算符，帮助您完善和过滤搜索引擎结果的命令。这很简单。我们只需要 site: 运算符和 “search term（搜索词）” 就可以了。site:运算符只显示某个域（或其一部分）的结果，而 “search term（搜索词）” 则显示与查询完全匹配的结果。如果我正在更新指向这篇文章的内部链接，情况会是这样：如您所见，我通过这种方式获得了三个结果。我相信还有比这些更多的机会，因为我在这里只使用了目标关键词的精确匹配。我们还可以使用 OR 搜索运算符扩大搜索结果：这样好多了。我们只需决定何时链接到哪篇文章，因为我们过去也写过一篇 “online marketing tools” 的文章。这是一个类似的主题，所以预计会有重叠。价格它 “只” 花费您的数据。 哦，还有一件事。由于文章的其余部分都集中在免费的 Google 产品上，所以从现在开始我将不再讨论 “价格” 部分。9. Google FormsGoogle Forms 是一款十分有用的免费工具，可用于创建调查问题以及分发和分析调查结果。最喜欢的应用案例： 进行简单的市场调查Google Forms 在市场营销中可能没有其他用例。但是，考虑到市场调研的重要性，它确实是一个非常方便的工具。要使其发挥作用，您需要有相当数量的受众可以向其分发调查问卷。理想情况下，您可以通过电子邮件发送调查问卷，但也可以使用社交媒体。创建能够提供您所需数据的良好调查有时会很棘手，但您不应该事情复杂化。以下是我们最近发送给电子邮件订阅者的调查示例：结果就像下方这样：这清楚地告诉了我们关于通知邮件是否有用的问题。10. Google AnalyticsGoogle Analytics (GA)是一款免费的强大工具，您可以在其中找到大量有关网站流量、转化率、受众等方面的洞察力和信息。然而，要正确使用它并知道您应该从它那里得到什么，需要相当多的知识和经验。如果您还没有使用过 GA，好消息是新版本 Google Analytics 4 (GA4) 即将取代目前大多数营销人员所熟悉的旧版 GA。您将从头开始。(附注：我最近试图学习 GA4 的使用方法，同时我认位相比旧版，它确实更有优势。）最喜欢的应用案例： 分析转换路径了解哪些营销渠道促成了您的客户转化是非常有价值的。GA4 在解释和显示数据的方式上向前迈进了一大步（请点击这里了解更多信息），下面是如何获得这些数据的方法。进入 “广告” > “归因” > “转化路径”，选择您要分析的转化事件，并检查您所选择的流量来源的影响。以下是自然搜索流量的一些详细信息：延伸阅读初学者如何使用 Google Analytics 4如何使用Google Analytics 提高 SEO 效果13 个 Google Analytics 跟踪错误（以及如何纠正它们）11. Google Search ConsoleGoogle Search Console（GSC）是最强大的免费 SEO 工具之一。这也难怪，因为它直接从谷歌提供了有关您的网站和搜索流量的最准确数据。每个拥有网站的人都应该拥有一个 GSC 账户。您可以使用它查找和修复技术错误、提交网站地图、查看您的排名、了解您的网页获得了多少流量等等。最喜欢的使用案例： 通过 URL Inspection 工具了解谷歌如何看待你的页面诊断 SEO 技术问题有时很棘手。URL Inspection工具提供了有关谷歌如何看待您网站上特定页面的信息。您可以使用 GSC 界面顶部的搜索栏查找您的任何页面：您可以点击所有选项卡。以下是您从覆盖率报告中可以获得的信息截图：专家建议一旦您掌握了 GSC 的使用方法，安装 Search Analytics for Sheets 插件，就可以轻松地将数据导出到Google Sheets 中。GSC 本身并不适合进行任何深入分析，而且有各种限制。因此，该插件是一个很好的变通方法，无需直接使用 GSC API。推荐阅读： 如何使用Google Search Console改进搜索引擎优化（初级指南）12. Google Sheets电子表格是许多营销人员的日常工具。Google Sheets 是我的首选，因为它基于云端、并与其他谷歌应用程序集成。我一直喜欢用它挖掘数据并对其进行解读，但我猜大多数同事并不赞同我的观点。不管怎么说.…最喜欢的使用案例： 从数据透视表中获得数据洞察力数据透视表的官方帮助页面对其进行了完美解释： 数据透视表可以帮助您总结数据、发现模式并重新组织信息。当数据集较大时，数据透视表尤其有用。要创建数据透视表，请单击 “插入”>“数据透视表”，选择要基于数据透视表的数据，然后按照自己的喜好重新组织数据。例如，这是我最近在 Wirecutter SEO 案例研究中使用的数据透视表。我需要对一个更大的数据集进行简化查看，并在其中应用一些过滤器：13. Google Data Studio创建报表是一项重复且耗时的任务。这就需要自动化，而 Google Data Studio (GDS) 可以在这方面提供帮助。在 GDS 中创建报表的基础是通过数据源的连接器获取数据。在撰写本文时，共有 610 种不同的连接器，因此报告功能非常强大。最喜欢的应用案例： 结合多种数据源主要用例也是我最喜欢的用例。您可以将来自大多数（甚至所有）营销平台的数据整合到一份整洁的报告中，并根据最新数据（或您选择的任何时间框架）进行更新。下面是我将 GSC 和 Ahrefs Rank Tracker（排名监控）的数据整合到一份报告中的例子：这些是 GDS 的基础知识。一旦您能够自如地创建此类报告，您就可以尝试做更花哨的事情，如混合不同来源的数据或其他任何满足您报告愿望和需求的事情。最后这是数字营销所需的全部工具清单？当然不是。但它可以满足你很大一部分的需求。尽管如此，有些数字营销领域我从未涉足过，比如自然社交媒体或任何与设计相关的领域。因此，基于我同事和朋友的经验，我只能推荐使用 MeetEdgar 作为社交媒体日程安排工具，以及 Canva 作为万无一失的设计工具。有问题么？在 Twitter 上找我吧。译者，Park Cheng，歪猫出海创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Michal Pecánek 贡献者 Ahrefs的营销专家和内容创作者。 沉迷于SEO，航空，香氛，寿司和墨西哥玉米卷。 贡献者",
  "headers": [
    {
      "level": "H1",
      "text": "13个顶级数字营销工具（包括使用技巧）"
    },
    {
      "level": "H2",
      "text": "1. Ahrefs"
    },
    {
      "level": "H3",
      "text": "最喜欢的应用案例： 寻找您与竞争对手之间的内容差距"
    },
    {
      "level": "H3",
      "text": "价格"
    },
    {
      "level": "H2",
      "text": "2. Hunter"
    },
    {
      "level": "H3",
      "text": "最喜欢的用例： 在 Google Sheets 中查找和验证电子邮件地址"
    },
    {
      "level": "H3",
      "text": "价格"
    },
    {
      "level": "H2",
      "text": "3. Mailchimp"
    },
    {
      "level": "H3",
      "text": "最喜欢的应用案例： 通过细分实现个性化电子邮件营销"
    },
    {
      "level": "H3",
      "text": "价格"
    },
    {
      "level": "H2",
      "text": "4. SparkToro"
    },
    {
      "level": "H3",
      "text": "最喜欢的应用案例： 发现竞争对手受众的痛点"
    },
    {
      "level": "H3",
      "text": "价格"
    },
    {
      "level": "H2",
      "text": "5. Brand24"
    },
    {
      "level": "H3",
      "text": "最喜欢的应用案例： 监视竞争对手的品牌被提及的情况"
    },
    {
      "level": "H3",
      "text": "价格"
    },
    {
      "level": "H2",
      "text": "6. Smartlook"
    },
    {
      "level": "H3",
      "text": "最喜欢的应用案例： 分析营销漏斗中的漏洞"
    },
    {
      "level": "H3",
      "text": "价格"
    },
    {
      "level": "H2",
      "text": "7. Visualping"
    },
    {
      "level": "H3",
      "text": "最喜欢的应用案例： 从竞争对手网站的用户体验和 CRO 调整中获得灵感"
    },
    {
      "level": "H3",
      "text": "价格"
    },
    {
      "level": "H2",
      "text": "8. Google"
    },
    {
      "level": "H3",
      "text": "最喜欢的使用案例： 发布新内容后寻找内部链接机会"
    },
    {
      "level": "H3",
      "text": "价格"
    },
    {
      "level": "H2",
      "text": "9. Google Forms"
    },
    {
      "level": "H3",
      "text": "最喜欢的应用案例： 进行简单的市场调查"
    },
    {
      "level": "H2",
      "text": "10. Google Analytics"
    },
    {
      "level": "H3",
      "text": "最喜欢的应用案例： 分析转换路径"
    },
    {
      "level": "H2",
      "text": "11. Google Search Console"
    },
    {
      "level": "H3",
      "text": "最喜欢的使用案例： 通过 URL Inspection 工具了解谷歌如何看待你的页面"
    },
    {
      "level": "H2",
      "text": "12. Google Sheets"
    },
    {
      "level": "H3",
      "text": "最喜欢的使用案例： 从数据透视表中获得数据洞察力"
    },
    {
      "level": "H2",
      "text": "13. Google Data Studio"
    },
    {
      "level": "H3",
      "text": "最喜欢的应用案例： 结合多种数据源"
    },
    {
      "level": "H2",
      "text": "最后"
    }
  ],
  "author": "Michal Pecánek, Mateusz Makosiewicz"
}