{
  "url": "https://ahrefs.com/blog/zh/digital-marketing-trends/",
  "slug": "digital-marketing-trends",
  "title": "2022 年将持续的 8 个数字营销趋势",
  "description": "这里有八种趋势，它们不仅是行业时尚，而且是 2022 年及以后市场营销的总体方向。",
  "content": "Mateusz Makosiewicz Ahrefs 的营销研究员和教育家。 Mateusz 在推广代理、SaaS 和硬件业务领域拥有超过 10 年的营销经验。平时喜欢创作音乐或享受长距离的散步。 内容 营销的变化比以往任何时候都快，那些想成为 T 型营销人员或管理整个营销部门的人最清楚这一点。追逐最新的营销时还可能会看到一些短期的结果，但营销策略不能依赖于此。对于长期的营销计划，需要坚实的基础：这样的战略和战术在过去已显示出良好的效果并且将来也可能如此。毕竟营销活动在迭代中蓬勃发展，你在某件事上投入的时间越多，就越擅长它。这就是为什么在这一系列数字营销趋势中，我们专注于这八个趋势，这些趋势不仅是行业时尚，而且是营销在 2022 年及之后的总体方向。在本文中，我们将讨论以下内容：搜索意图为王口碑依旧是趋势隐私因素将影响数字广告全渠道营销是必须的视频是必不可少的营销渠道数据永远地改变了营销无摩擦体验是客户的理想选择远程工作将持续存在1. 搜索意图为王搜索意图是指搜索背后的原因，谷歌试图理解我们的搜索查询的含义以及我们试图查找的信息类别。举例来说，对于 “how to tune a guitar.” 等信息意图查询，Google 将指南排名最高。另一方面，对于像 “amazon” 这样的交易查询，谷歌知道用户正在尝试导航到与其位置最相关的电子商务网站 (而不是查找有关亚马逊河的信息)。谷歌相信为了人优化而不是为了算法，事实上，谷歌引入了一些复杂的机器学习算法，如 BERT 或 MUM，以便使搜索引擎 “更人性化”。也就是说，搜索引擎应该像人类一样理解信息。搜索引擎优化有许多公认的趋势，但搜索意图可能仍是王者，毕竟它是谷歌业务的核心。该怎么办在考虑搜索意图的情况下设计和优化内容，这归结为查看特定查询的搜索结果页并确定搜索意图的三个 C： 内容类型 — 内容的整体类型是什么？它是博客文章、产品页面还是视频？举例来说，这篇文章就是一篇博客文章。 内容格式 — 一些常见的格式包括操作指南、列表帖子、评论、比较等，你现在正在阅读的文章是列表帖子。 内容角度 — 内容的独特卖点。举例来说，“最佳”、“最便宜”和“新鲜度”，你能猜出这篇文章的角度是什么吗？一旦确定了搜索意图的三个 C，你应该对 Google 向其用户 “推荐” 特定搜索查询的内容类型有一个很好的了解。推荐阅读：什么是搜索意图？初学者完整指南2. 口碑依旧是趋势口碑 (WOM) 是许多品牌成功背后的“无形力量”，也是将潜在客户转化为客户的无名英雄，这里有一些数据可以说明我的观点：来自 60 个地区 83% 朋友和家人的受访者信任推荐，66% 的受访者信任在线推荐 (Nielsen)。74% 的购买者 (汽车、美妆和智能手机类别)认为口碑是影响购买决策的主要因素 (Google, TNS 及 Ogilvy)。在 Ahrefs，我们发现这是真的，并且最近将口碑列为三大获客渠道之一。多亏了在线媒体，使得口碑的 “无形力量”(否则更难以注意到和衡量)变得得以衡量，我们可以通过以下方式见证： 社交媒体 - 在对话和内容的分享中都可以看见口碑。 用户生成关于品牌及其产品的内容 - 在 Instagram 上发布的客户评论、拆箱或粉丝图片就是很好的例子。 网红营销的普及 — 虽然网红营销本身就是一种营销类型，但效果如此之好是基于与口碑相同的机制：人们更信任他人而不是品牌。该怎么办首先，创造一个伟大的产品或服务，如果没有的话很难走的远。你应该有一些超出预期的东西，让它更好地改变用户的生活。如果人们真的喜欢你的产品，他们就会开始表达喜欢。可以通过一些营销策略潜在影响该过程的速度和规模，例如：鼓励用户在指定的标签下分享你产品的图片或短视频。 创建一个理由，吸引人们在社交媒体上分享的内容。分享有关你的业务的正面评价 (但不要吹牛)。分享你的产品评论。参与对话。 甚至启动它们。警告：这可能有一定的风险，你对这种情况可能几乎没有控制权，但勇于尝试并保持透明度在营销这个世界会大有帮助。此外，还可以从收到的反馈中学到很多东西。每两年的同一天，我们的首席营销官都会问 Reddit 的优秀同仁同样的问题：“你喜欢我们的工作吗？”延伸阅读 研究揭示了社交分享的秘密 2021年影响者营销：定义、示例和策略3. 隐私因素将影响数字广告事实 1，默认情况下，Safari 和 Firefox 浏览器已经阻止第三方 cookie。如果想知道，第三方 cookie 是由你访问网站以外的网站设置的小型文本文件，主要用于在网站之间跟踪用户 (例如显示再营销广告)。事实2，谷歌原订计划到 2022 年停止在 Chrome 中支持第三方 cookie，目前将其推迟到 2023 年。事实#3，从 iOS 14 开始，Apple 开始要求其用户选择是否自愿加入广告商识别 (IDFA)。白话来说：除非明确授予他们许可，否则 Facebook 等公司不会“跨应用程序和网站跟踪你”。来源：Apple Insider如果这还不够：全球 42.7% 的互联网用户使用广告拦截器 (Hootsuite)。由于隐私问题，一半的美国人决定不使用产品或服务 (Pew Research).考虑到安全性和隐私性的产品越来越多，旨在将你从数据收集垄断的企业中“拯救”出来。像是 DuckDuckGo、Brave、Signal、ProtonMail 和区块链智能手机。所有这些信息都描绘了一个相当清晰的画面，理论上，互联网用户在浏览网页时将拥有更多隐私。随之而来的结果，营销人员将拥有更少的数据点。大多数营销人员都在预测谷歌和苹果的举措将产生重大影响：来源：Epsilon.该怎么办数字广告不会因为“饼干末日”而消失，原因如下：我们不要忘记谷歌主要依赖广告收入。事实上它已经在开发一种新的基于浏览器的跟踪标准，称为联合队列学习 (FLoC)，因此如果我们接受 Adroll 的建议 (广告技术业务中最大的公司之一)，在 cookie 末日来临之前，一切照旧。大型出版商正在远离第三方广告解决方案，转而使用自己的数据聚合和广告销售，例如 Insider 的 SAGA 平台。我们甚至可能会看到统一 ID 2.0 (由 The Trade Desk 和 IAB 技术实验室开发)的广泛采用，它看起来类似于第三方 cookie。当 Facebook 在 IDFA 后受到打击时，苹果自己的广告解决方案突然变得更具吸引力，看起来一方的损失是另一方的收获。因此想要在 2023 年之后使用在线广告的品牌似乎仍然有很多选择，唯一的障碍是他们必须适应新标准和不同形式的广告 (比如直接从发布商那里购买广告)。然而一些品牌已经受到隐私因素的影响，例如广告点击量下降和 Facebook 广告支出回报率下降。其他人则像聪明的投资者一样，已经在采取措施使营销渠道多样化。无论是否采取隐私措施，投资全渠道营销都是一个好主意，我们将在下一节中看到。那么这里有什么替代方案呢？ 如果想了解如何利用其他营销渠道和最低付费流量来实现增长，请阅读下面的文章。推荐阅读：2022 年 8 个有效的营销渠道 (以及我们如何使用它们)4. 全渠道营销是必须的全渠道营销是让客户或潜在客户在所有渠道、平台和设备上访问你的产品、优惠和支持服务。这种趋势在商业中很容易观察到。 例如宜家允许通过在线商店、移动应用程序、电话或访问当地商店进行订购。此外，宜家提供所有可能的联系方式，包括与聊天机器人的实时聊天。但让我们看看更大的愿景：全渠道活动的购买率比单渠道活动高 287%。 (Omnisend)客户与渠道无关，他们希望企业可以在任何方便他们的渠道上使用。 (Gartner)你的频道组合越多越好，更多渠道意味着为客户提供更多便利，更多的前景意味着更多的投资回报率，至少这就是我们可以从对 6,000 个 Effie 获奖活动的分析中学到的。该怎么办你可以在三个关键领域提供全渠道体验。第一个是产品 (或服务)。举例来说，Ahrefs 主要是一个 SaaS 平台，但我们也将一些产品功能扩展到插件，例如我们在 Chrome 和 Firefox 提供的 SEO工具栏，以及我们的免费 SEO WordPress 插件。通过这种方式，我们可以更有脉络性的提供数据，并使用户更加方便。Ahrefs 的 SEO 工具栏 允许直接在搜索引擎结果页面上查看 SEO 相关数据。Ahrefs 的 WordPress 插件结合来自 Google Analytics 和 Ahrefs 的数据执行自动审核内容。第二个领域是客户支持。考虑扩展可用于接触你业务的渠道，不要责怪客户使用“错误”的支持渠道。相反的，请为所有渠道上的任何问题做好准备。对话式营销解决方案，举例来说，实时聊天是越来越多的公司投资的东西，如果查看数据，会发现这非常有意义：82% 的消费者希望立即回复销售或营销问题 (Hubspot).79% 的公司表示，实时聊天对客户忠诚度、销售和收入产生了正向影响。 (Kayako).公司和客户在 Facebook Messenger 中的对话比再營銷广告的转化率高 30%。 (Facebook).第三个领域是推广。 就像前面提到的 Effie 研究证明的那样，渠道越多越好。例如，我们通过多种渠道推广 Ahrefs 站长工具：Twitter、YouTube、Google Ads、各种赞助等等，我们也尽可能尝试新的渠道。 (最近，我们使用了 Brave Ads 和 Quora Ads)。这是视频广告的示例。5. 视频是必不可少的营销渠道无论在哪里看，都可以发现相同的模式：79% 的人表示，他们在观看视频后被说服购买、下载软件或应用程序。 (Wyzowl)YouTube 是美国自然访问量排名第二的网站。 (Ahrefs)91% 的营销人员认为大流行病使视频对品牌而言更加重要。 (Wyzowl)视频是 2021 年创建的主要营销媒体形式，其次是博客(超过一半的营销团队使用)和信息图表。 (Hubspot)视频被证明对用户和企业非常有用，真的很难找到不投资视频营销的合理理由。如果你的产品在视频中的展示效果比在书面内容中的解释更好，则尤需如此。该怎么办如果你正处于视频营销之旅的开始阶段，下面的视频将解释如何在此类营销中取得成功，即使缺乏专业设备、英语水平或镜头前的经验。https://www.youtube.com/watch?v=QCgDIhvFkCM&list=PLvJ_dXFSpd2tsn8vwEmhFM0McBH4PhEty需要更多资讯？请务必查看我们关于该主题的播放列表，我们将展示如何充分利用 YouTube 广告并进行视频搜索引擎优化和 YouTube 搜索引擎优化，以向你的视频发送持续且免费的流量。6. 数据永远地改变了营销据哈佛商业评论称，数据科学是“21世纪最性感的工作”，还补充说：如果公司因缺乏人才而置身于这一趋势的早期阶段，那么随着竞争对手和渠道的合作伙伴获得强大的优势，那公司就有可能落后。 那篇文章来自 2012 ，大约 10 年后，数据科学家在 Glassdoor 的 2021 年美国 50 个最佳工作报告中排名第二。排名第一的是 Java 开发人员，有相当的工作满意度，但基本工资中位数低约 2 万美元。数据科学趋势的影响力如此之大，以至于它在营销上留下了自己的印记。Altimeter 的这项研究表明，在 11 项技能中，数据分析是数字营销人员最需要的技能。来源：Prophet.当我们查看一些数据分析课程时，我们可以看到它们已经在为营销人员定制：这些课程涵盖了许多方面，从高级电子表格技能到 Python 和 R 编程。只要看看这些课程，我们就会发现数据分析可以帮助解决的复杂营销问题：客户流失、多方面的客户数据、情绪分析、活动绩效等等。该怎么办第一步是连接到优质数据源，每个营销渠道都有一个专门的分析工具。举例来说，如果想利用自然搜索，你将需要像 Ahrefs 这样的高级 SEO 工具，这样的工具是进入庞大的全球搜索需求和反向链接数据池所需的门票。使用正确的 SEO 工具，还可以查看竞争对手的数据并查看可以改进的地方。在众多功能中，Ahrefs 的内容差距机会工具进行内容差距分析，并查看竞争对手有哪些有排名但你的网站没有的关键字。第二步是学习数据分析技能。基本技能包括掌握相关的电子表格公式、理解统计数据以及了解如何收集数据。如果你认为可以从更高级的技能中受益，请投资学习 SQL、Python 或 R。也就是说，营销分析软件已经可以为你执行大量数据清理、分析和可视化，特别是最新的营销自动化技术已经变得相当引人注目。Blueshift 或 Bloomreach 等解决方案可以获取你所有的客户数据点，将它们合并到一个数据库中，然后允许你设计基于客户特征、行为甚至 AI 预测触发的全渠道通信工作流。7. 无摩擦体验：“成败”时刻你能否指出某个时刻在线购买商品像今天一样简单、快速且基本上没有摩擦？ 很明显：当公司为他们提供便利时，客户更有可能进行购买。让我们再看一些例子：如今可以 100% 在线购买新车和二手车。电子杂货公司宣布交货最快为 15 分钟。如今，借助 Robinhood 或 eToro 等应用程序，投资股票市场变得轻而易举。Klarna 的标语是“购物的捷径”，即使你当时没有钱，也可以在线购买东西。最后但同样重要的是，想想如果 SaaS 产品没有免费试用或某种形式的“免费”元素，你会在 2022 年感到非常失望。 该怎么办减少你希望用户采取的任何形式的转换操作所造成的摩擦，无论是注册时事通讯、注册试用版，还是进行购买。正如你在上面看到的，当企业让资金流动更容易时，他们可以赚更多的钱。但在你这样做之前，花点时间想想你是否可能需要某种 “摩擦”，举些例子来说：从潜在客户生成的角度来看摩擦 — 举例来说，你可能会发现有一定门槛的内容会产生更多合格的潜在客户，并提供更多可用数据点。摩擦作为一种安全措施 — 举例来说，在我从亚马逊截取这张截图之前，我需要通过两步验证过程才能登录我的账户。8. 远程工作将持续存在大流行病已经过去两年了，我们都生活在“新常态”中。也就是说，有理由怀疑远程工作是否应该永远存在。好吧，根据最近全球远程工作现象的一些统计数据，似乎向家庭办公室的过渡大多都是成功的。Source: PWC.更重要的是，远程工作被证明有其好处。根据斯坦福大学在 9 个月内对 16,000 名员工进行的一项研究，在家工作将生产力提高了 13%。理由是：更方便的工作环境、更少的休息和病假。还有一些好处，像是： 这里还有一些好处：降低就业成本更好的心理健康获得更好的工作选择更多的员工忠诚度降低通勤成本（并节省更多移动的时间）如果你在远程工作，我相信你有自己的优点和缺点。不过总体而言，员工仍渴望继续远程或半远程工作。根据 FlexJobs 在 2021 年 7 月至 8 月期间进行的第 10 次年度调查，惊人的发现 97% 的员工渴望某种形式的远程工作 — 无论是完全远程的还是混合的。根据另一项研究，超过一半的员工希望每周至少远程工作三天。因此，远程工作似乎将继续存在。该怎么办总体共识似乎是为了适应这种情况，公司将采用混合模式：员工将在办公室呆几天，在家呆几天。来源：PWC.Mercer 的另一项研究证实了这种观点：70% 的公司表示他们计划采用混合模式。在上述统计数据中，营销人员也不例外。谁知道呢？也许营销人员更有可能采用远程模式。毕竟，我们并不经常遇到面向客户的情况。即使我们遇到了，这些也可以在线处理。另外，我猜我们用于工作的大多数工具都是基于云的。因此，亲爱的营销人员，你可能会在未来几年看到自己远程或半远程工作。这里也给雇主一个预告：如果与你一起工作的人期望某种远程工作，请不要感到惊讶。总结一下，让我还根据我迄今为止看到的研究分享一些关于如何充分利用远程工作的技巧： 避免永远在线的心态 — 这是对雇主和雇员的建议，许多人报告说，在家工作时他们觉得自己一直在工作。这最终会导致生产力降低、满意度降低和职业倦怠。 使用正确的工具 — 举例来说，在 Ahrefs 中我们中的一些人是来自世界各地的纯远程工作人员，而有些人则在新加坡办事处工作 (但有时会远程工作)。所以我们的工作模式在某种程度上是混合的，但是我们使用的所有工具都是远程工作友好的，我们的员工可以随时随地登录。考虑为新员工和缺乏经验的员工提供更多的办公室时间，他们可能需要支持和体验公司氛围。87% 的员工表示办公室对于与团队成员合作和建立关系很重要。(PWC) — 没错，在工作中有朋友是很重要的，我们只需要习惯于通过互联网而不是亲自与人聊天。最后的想法未来总是不确定的，营销人员很少能负担得起等待事情结束的奢望。因此，应对不确定性的唯一选择就是开始采取行动，希望你的成功之路会随着你的前进而变得更加光明。我希望上面的数字营销趋势列表能够为你在不久的将来，在营销中的聪明举措提供一些洞见。如果对 2022 年的营销有任何疑问或答案 (甚至更好的)，请在 Twitter 上告诉我。译者，李元魁，SEO 分解茶博客创始人 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Mateusz Makosiewicz Ahrefs 的营销研究员和教育家。 Mateusz 在推广代理、SaaS 和硬件业务领域拥有超过 10 年的营销经验。平时喜欢创作音乐或享受长距离的散步。",
  "headers": [
    {
      "level": "H1",
      "text": "2022 年将持续的 8 个数字营销趋势"
    },
    {
      "level": "H2",
      "text": "1. 搜索意图为王"
    },
    {
      "level": "H3",
      "text": "该怎么办"
    },
    {
      "level": "H2",
      "text": "2. 口碑依旧是趋势"
    },
    {
      "level": "H3",
      "text": "该怎么办"
    },
    {
      "level": "H2",
      "text": "3. 隐私因素将影响数字广告"
    },
    {
      "level": "H3",
      "text": "该怎么办"
    },
    {
      "level": "H2",
      "text": "4. 全渠道营销是必须的"
    },
    {
      "level": "H3",
      "text": "该怎么办"
    },
    {
      "level": "H2",
      "text": "5. 视频是必不可少的营销渠道"
    },
    {
      "level": "H3",
      "text": "该怎么办"
    },
    {
      "level": "H2",
      "text": "6. 数据永远地改变了营销"
    },
    {
      "level": "H3",
      "text": "该怎么办"
    },
    {
      "level": "H2",
      "text": "7. 无摩擦体验：“成败”时刻"
    },
    {
      "level": "H3",
      "text": "该怎么办"
    },
    {
      "level": "H2",
      "text": "8. 远程工作将持续存在"
    },
    {
      "level": "H3",
      "text": "该怎么办"
    },
    {
      "level": "H2",
      "text": "最后的想法"
    }
  ],
  "author": "Mateusz Makosiewicz"
}