{
  "url": "https://ahrefs.com/blog/zh/diy-seo/",
  "slug": "diy-seo",
  "title": "DIY SEO：任何人都可以遵循的基本5步指南",
  "description": "通过这个简单、通俗易懂的教程，了解如何自己进行 SEO。",
  "content": "Si Quan Ong 营销@Ahrefs。 我爱阅读，爱跳霹雳舞，爱尝试随机的生活实验。 内容 几年前，我在一家没有营销预算的初创公司工作。也没有人有任何营销经验。作为唯一一个读过几本市场营销书籍的人，我被安排负责市场营销策略。在没有任何专业知识或营销资金的情况下，我阅读了一些 SEO 博客，并尝试实施他们的策略。而且成功了。小提示. 由于业务挑战，该公司已不复存在，这解释了流量突然下降的原因。有了正确的指导，任何人都可以自己做 SEO。你只需要知道如何开始。这就是本指南的目的。我们开始吧。内容1. 让你的技术SEO井然有序如果谷歌找不到、抓取和索引你的页面，你拿出任何SEO策略都无法让你的页面排名。因此，第一步是确保谷歌能够为你的网站完成上述所有工作。查看是否有任何问题阻碍谷歌的最简单方法是审核你的网站。你可以通过注册我们的免费Ahrefs站长工具（AWT）并使用网站诊断对你的网站进行爬网来做到这一点。当爬行完成后，你将看到困扰你站点的所有顶级问题。单击“Crawled”列中的数字以查看这些URL。你还可以单击问题本身，了解问题的原因以及解决方法。延伸阅读初学者技术SEO指南一个简单（但有效的）14步SEO诊断和清单如何在8个步骤完成的技术SEO诊断2. 做关键词研究为了获得搜索流量，你需要针对潜在客户正在搜索的单词和短语。你可以通过做关键词研究来找到这些是什么这是最简单的入门方法。你可以：转到Ahrefs的关键词分析。输入一个或几个与你的网站相关的关键词（例如，如果我是按摩治疗师，我可能会输入按摩疗法、背痛、背痛缓解、肩部疼痛缓解等）。转到匹配项报告。在这里，你将看到超过40万个潜在话题。但是太多了。因此，你需要将列表减少到可管理的程度。具体来说，你希望针对的关键词可能会给你带来巨大的流量，但不具有竞争力。我们通过使用两个过滤器来实现这一点：流量潜力(TP) — 如果你对某个主题的排名为 # 1，那么它就是你可能获得的搜索流量的估计值。我们可以将其设置为至少100，以找到主题，实际发送流量到你的网站。关键词难度(KD) – KD估计了在某个关键词的前10个搜索结果中排名的难度。数字越低，就越“容易”。虽然这取决于网站的“权威”，但你可以从20这样的合理数字开始。这个列表更可行。确保你手动审阅每个关键词，以查看其是否与你的业务相关。了解更多：关键词研究：Ahrefs的初学者指南3. 创建针对搜索进行优化的页面创建搜索优化页面不再是为了填充尽可能多的目标关键词。关键词填充在十多年前就消失了。今天，谷歌可以很容易地理解同义词和语义相关的单词那么，如何创建针对搜索优化的页面？以下是方法。匹配搜索意图谷歌希望其用户快乐。对它来说，这意味着找出搜索者搜索的原因，即搜索意图，然后向他们显示最相关的结果。因此，如果你想在谷歌上排名靠前，你必须匹配搜索意图。幸运的是，找出搜索意图相对简单。由于谷歌已经致力于提供最相关的结果，我们可以查看当前排名靠前的页面来了解搜索意图。具体来说，我们要分析搜索意图的三个C：内容类型 – 主要的内容类型是博客文章、产品页面、视频、登陆页面还是其他什么？内容格式 – 主要格式是指南、列表、评论、观点、新闻或其他内容吗？内容角度 – 是否有一个主要的角度，如当前的一年或内容针对初学者？例如，假设你想讨论“如何省钱”主题：以下是我们在分析SERP时将学到的内容：内容类型–所有排名靠前的页面都是博客文章。内容格式–令人惊讶的是，人们实际上是在寻找技巧，而不是指南。内容角度–简单/容易，证明，快速是潜在的角度。因此，我们可能会写一篇题为“XX行之有效的省钱方法”的文章了解更多：什么是搜索意图？初学者完整指南完整地覆盖这个主题大多数查询的最佳结果，通常涵盖搜索者想要了解的关于该主题的所有信息查找搜索者希望看到的子主题和要点的一个简单方法是运行内容差距机会：转到Ahrefs的关键词分析输入目标关键词向下滚动至SERP概述查看一些排名靠前的页面单击“Open in”并选择“Content gap”在本例中，我们的目标是关键词入站营销。你可以看到，这些关键词中的许多都映射到潜在的子主题：这些子主题…什么是入站营销入站营销示例入站营销策略…可以为我们的博客文章制作完美的H2。让你的内容独一无二你应该完整地讨论这个话题。但这并没有给你复制粘贴顶级页面上已有内容的余地。毕竟，山寨内容既不能脱颖而出，也不能激励人们链接到你（链接是一个重要的排名因素）。因此，你需要确保你的内容是唯一的。以下是关于如何做到这一点的一些想法：个人经历 – 如果你成功地实施了某件事，就写下它。专家访谈 – 接触并采访你所在领域的专家，或请他们对你的文章发表意见。群享 – 让多人分享他们的意见、专业知识和想法。原创研究 – 将数据添加到帖子中。你可以通过进行研究、调查或投票来做到这一点。反对者 – 成为魔鬼的拥护者。考虑相反的观点。使内容简单易读难以阅读的内容不仅对SEO不利，而且对商业也不利。如果你的副本甚至无法理解，你如何说服别人购买你的产品？保持你的副本整洁。使用以下提示：避免说大话。当你可以说错的时候，不要说错。始终使用简单的语言。如果有疑问，请使用Hemingway检查你的副本。使用粗体、斜体和列表等格式将副本分成多个部分。包括图像、视频和GIF等多媒体，以说明你的观点并打破文本墙为你的网页搜索引擎优化锦上添花这是锦上添花，让谷歌和搜索者更加清楚地知道你的页面是相关的。遵循以下最佳做法：在标题中使用关键词 – 这通常已包含在标题中。但如果你还没有，看看你能不能用它。一个类似的变体也适用。写一篇引人注目的元描述 – 虽然不是谷歌排名因素，但它有助于在搜索结果中销售你的文章。使用简短的描述性URL – 这样的URL使搜索者很容易理解你的帖子内容。最简单的方法是让这个词成为你的话题将alt文本添加到图像中 – Google使用alt文本来理解图像。为你使用的每个图像创建一个简洁但准确的图像。了解更多：页面SEO：初学者指南延伸阅读内容创作：初学者的完整指南SEO内容：初学者指南SEO写作：创建搜索优化内容的7个步骤如何用9个步骤写一篇博客文章（人们实际上想读）4. 建立链接链接是谷歌排名的一个重要因素。你可能需要他们排名更高。内部连接说到链接，很多人忽略了内部链接。但它们实际上很重要，不仅因为它们在你的页面之间传递权限，而且还帮助谷歌发现和理解页面。查找相关内部链接机会的最简单方法是使用网站诊断中的链接机会报告。你已经在步骤#1中运行了一个爬网，所以剩下的就是查看报告建议你添加哪些内部链接。网站诊断建议，我们可以在有关将网站提交搜索引擎的帖子中，添加到Google URL检查工具文章的内部链接上。了解更多：SEO内部链接：可操作指南HAROHaro（帮助记者出去）是一项免费服务，将记者与新闻工作者的资源和资源联系起来。如果你是利基市场的专家，则可以轻松地提供报价，记者可以链接到你的网站。入门很简单，你只需注册成为网站上的一个来源。然后，你将收到来自为各种出版物工作的记者的询问电子邮件。然而，大多数查询可能与你无关，因此我们建议设置Gmail过滤器：单击搜索选项筛选器将“发件人”字段设置为[email protected]将“主题”设置为“[HARO]”将“有词”设置为要监视的关键词（使用OR运算符在此处列出多个关键词）为了获得最佳结果，只能回应你拥有相关专业知识的查询。复制竞争对手的外链如果有人链接到你的竞争对手，机会是他们也会链接到你。所以你只需要找出谁在链接他们，而不是你，然后找到复制这些链接的方法。方法如下:将你的域名输入Ahrefs的关键词分析将其设置为Exact URL）转到交集外链分析在空字段中添加一些竞争的主页（将它们设置为ExactURL）查看结果，看看是否有任何链接可以复制。例如，下面的网站链接到我们的两个竞争对手。仔细查看这些链接，我们发现它们都是播客访谈：鉴于主持人已经采访了我们的两个竞争对手，他们可能也有兴趣采访我们。延伸阅读SEO链接构建：初学者指南如何获得外链链接：15个经验证的策略9个简单的链接建立策略（任何人都可以使用）5. 跟踪和衡量你的成功最后，你需要跟踪一些指标，以了解你是否走上了正确的道路你需要跟踪的确切指标取决于你的目标，但最常见的指标有：自然流量 – 搜索引擎的所有非付费点击。如果它呈上升趋势，这可能表明你的SEO努力正在得到回报。你可以使用的工具：谷歌站长工具和Ahrefs关键词分析（AWT免费）。关键词排名 – 搜索结果中你所针对的关键词的自然排名位置。你可以使用Ahrefs的排名监控来跟踪这一点。引用域 – 链接到站点的网站数量。我们早些时候已经确定，外链链接是谷歌排名的一个重要因素。因此，你会希望你的网站随着时间的推移获得更多的信息。你可以在站点资源管理器中查看站点有多少引用域。搜索可见性 – 你的品牌在市场上的可见性。你可以通过在排名跟踪器中粘贴对你重要的关键词来跟踪这一点。然后转到竞争对手概览 (Competitors overview)选项卡并选中可见性 (Visibility)列。延伸阅读10个真正重要的SEO指标（4个不重要）你应该（也不应该）跟踪的12个SEO KPI最后的想法这个简单的 DIY 搜索引擎优化指南涵盖了搜索引擎优化的基本原理。你可以一遍又一遍地按照本指南优化你的网站和排名，以获得有意义的和相关的关键词。然后，当你经历更多的成功，你甚至可以考虑聘请一个机构，把事情带到下一个水平。或者，如果你更喜欢继续 DIY 的路线，你可以在我们的博客，YouTube 频道和学院学到更多。有任何问题或评论吗? 请在 Twitter 上告诉我。译者，John Zhao，西品东来创始人 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Si Quan Ong 营销@Ahrefs。 我爱阅读，爱跳霹雳舞，爱尝试随机的生活实验。",
  "headers": [
    {
      "level": "H1",
      "text": "DIY SEO：任何人都可以遵循的基本5步指南"
    },
    {
      "level": "H2",
      "text": "1. 让你的技术SEO井然有序"
    },
    {
      "level": "H2",
      "text": "2. 做关键词研究"
    },
    {
      "level": "H2",
      "text": "3. 创建针对搜索进行优化的页面"
    },
    {
      "level": "H3",
      "text": "匹配搜索意图"
    },
    {
      "level": "H3",
      "text": "完整地覆盖这个主题"
    },
    {
      "level": "H3",
      "text": "让你的内容独一无二"
    },
    {
      "level": "H3",
      "text": "使内容简单易读"
    },
    {
      "level": "H3",
      "text": "为你的网页搜索引擎优化锦上添花"
    },
    {
      "level": "H2",
      "text": "4. 建立链接"
    },
    {
      "level": "H3",
      "text": "内部连接"
    },
    {
      "level": "H3",
      "text": "HARO"
    },
    {
      "level": "H3",
      "text": "复制竞争对手的外链"
    },
    {
      "level": "H2",
      "text": "5. 跟踪和衡量你的成功"
    },
    {
      "level": "H2",
      "text": "最后的想法"
    }
  ],
  "author": "Si Quan Ong"
}