{
  "url": "https://ahrefs.com/blog/zh/ecommerce-out-of-stock-products/",
  "slug": "ecommerce-out-of-stock-products",
  "title": "如何处理缺货的产品页面",
  "description": "在 SEO 和用户体验方面，有许多情境决策都需要权衡取舍。 你需要做出合理的选择。",
  "content": "Patrick Stox Patrick Stox 是 Ahrefs 的产品顾问，技术 SEO 和品牌大使。他是罗利（美国城市）SEO 聚会、SEO 大会、啤酒和 SEO 聚会和 Finadability 大会的组织者之一，同时也是 /r/TechSEO 的版主。 内容 如何处理电子商务网站上的缺货产品页面？在 SEO 社区是算是个笑话，因为答案是 “取决于具体情况”。 在 SEO 和用户体验方面，有许多决策其实都是取决于实际的情况，所以，每个决策都需要权衡取舍。许多内容管理系统都有用于处理缺货产品页面的内置规则，但这种逻辑通常可以更改。 有些设置可能根本没有内置逻辑。 在这些情况下，你可以制定规则并与开发人员合作以实现你想要的效果。让我们看看不同的场景应该如何设置。永久缺货对于永久缺货的产品，你知道产品已经消失并且不会再回来。 这是否意味着你应该摆脱这些页面？ 并不是，你在这里有几个选择。选项 1. 重定向页面如果你有类似的产品想要推动人们购买，你可能希望通过 301 跳转，将旧产品重定向到新产品。 如果页面足够相似，这也会保留原有链接的权重。 如果页面不够相似，或者你重定向到分类页面或你的主页，则这些页面可能会被视为软 404，并且可能不会保留原有页面的权重。 如果这些位置是你希望用户去的地方，那么无论如何都要进行重定向。 那么链接仍有可能传递权重。由于大多数网站过去都删除了许多产品，你可能想看看是否有机会将旧页面重定向到相关的当前页面，并从中回收权重。以下是如何找到这些机会：将你的域名粘贴到 Ahrefs Site Explorer（网站分析），你也可以在 Ahrefs Webmaster Tools（Ahrefs 站长工具）中免费访问转到 Best by links（按反链数量排序）报告使用响应代码过滤器并检查 “404 not found” 和 “410 gone” 问题我通常按 “Referring domains（引用域）” 或 “UR（页面评分）” 对其进行排序，以寻找最佳机会。Best by links（按反链数量排序）报告重定向页面时，许多系统会自动从类别、分面导航、站点地图和内部搜索页面中删除内部链接。 在某些系统中，你可能需要手动删除这些链接，或者你可能希望删除博客页面或其他地方的其他链接。要查找这些链接，请查看 Ahrefs Site Audit（网站分析）中的链接报告。如果你注册了 Ahrefs Webmaster Tools（Ahrefs 站长工具），那么该报告也是免费的。 单击内部链接上标记为 “重定向” 的区域，以获取重定向链接和具有这些链接的页面的列表。重定向的内部链接。选项 2. 删除页面如果你要删除一个页面，并且当前没有对应的相关产品，你可能只想删除该页面并返回 404 或 410 状态。正如我们在第一个选项中提到的，你还需要确保删除指向这些页面的内部链接。 对于页面的许多链接（但可能不是全部），这种删除通常会自动发生，因此请通过抓取你的网站来检查是否有遗漏的链接。要查找这些链接，请查看 Ahrefs Site Audit（网站分析）中的链接报告。并查找 “失效的” 内部链接。你可以单击此图表以获取失效链接的列表，以及链接到它们的页面。失效的内部链接。选项 3. 保留页面该产品已经消失，大多数人都希望通过删除、或重定向来摆脱该页面。 但是有很多正当的理由会让你保留该页面。 它可能依然有一些有用的资源，例如文档等。这可以减轻支持团队的一些负担。也许，该页面仍然可以获得相当数量的搜索流量，你希望将这些流量汇集到你提供的其他产品中。 你可以使用 Ahrefs Site Explorer（网站分析）来检查页面的自然搜索流量。如果你现在要让页面保持活动状态，我不建议你像在其他选项中那样删除内部链接。 删除链接可能会损害你的排名。当然，这也是潜在的 SEO 优势与用户体验发生冲突的时候。 从内部搜索或类别页面登陆一个没有什么可买的页面，对于用户来说都不是很好的体验。你可能想要添加一个过滤器，以便用户可以排除掉缺货的产品。 或者你可能希望在任何列表中最后显示这些产品。 但是，像这样降低页面的优先级意味着可能会降低它们的排名，但我通常推荐这么做。最终，你可能会认为这些页面不再有用，因此可能需要重定向或删除它们。暂时缺货，可能很快会入库你想保留这些页面。 如果是这样，你可以在系统中采取或自动化一些有用的操作。有些功能可能对你和你的客户都非常有用。例如预估产品何时重新有货、等待名单、或注册以在产品补货时收到通知的方式。 一些商店甚至会为那些在他们有库存时购买商品的用户提供彩票。例如下面的 Newegg shuffle 项目。暂时缺货，可能不会再入库有时，你的产品只是不知道何时或是否会再次入库。 这种情况，我都会让产品在网站上的可见度降低，这样用户就不太可能看到它们。选项 1. 保持在线正如我之前提到的，你可能希望保留页面的原因有多种，包括捕获搜索流量，以将人们吸引到其他产品；或将页面用于支持、或文档目的。在这种情况下不要删除内部链接。 最终，当你意识到相关产品不会回来、或页面不再有用时，你可能希望重定向、或删除这些页面。选项 2. Noindex我会说使用 noindex 不是我最喜欢的选项，我通常不推荐它。 因为它会切断 PageRank 的传递。我之所以提到它，是因为在某些系统中，noindex 被用作阻止产品向用户展示的触发器。 当然，从好的方面来说，标记为 noindex 的产品会在 Google 重新抓取页面后，很快出现在搜索结果中。选项 3. 将其保留一段时间并稍后删除或重定向在某些时候，你可能只想决定将此产品视为不会再回来，并删除或重定向它。 何时执行取决于你自己，但很多人会根据实际，放一段时间再操作。 在短期内，我会保持内部链接处于活动状态——但以后会想要清理它们。如何查找缺货产品你应该从内容管理系统后端的数据源中获得缺货产品列表。 如果你没有该列表，你可能需要使用 Ahrefs Site Audit（网站诊断）来抓取该网站，并搜索 HTML 代码以查找包含你的缺货信息的页面。寻找缺货的页面。最后如你所见，在缺货产品页面上，你有很多选择。 我通常建议你设置一些你觉得舒服的规则，然后顺其自然。 你使用的逻辑完全取决于你。 最终，解决方案取决于实际情况。如果你有任何问题，请在 Twitter 上给我留言。译者，Park Cheng，歪猫出海创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Patrick Stox Patrick Stox 是 Ahrefs 的产品顾问，技术 SEO 和品牌大使。他是罗利（美国城市）SEO 聚会、SEO 大会、啤酒和 SEO 聚会和 Finadability 大会的组织者之一，同时也是 /r/TechSEO 的版主。",
  "headers": [
    {
      "level": "H1",
      "text": "如何处理缺货的产品页面"
    },
    {
      "level": "H2",
      "text": "永久缺货"
    },
    {
      "level": "H3",
      "text": "选项 1. 重定向页面"
    },
    {
      "level": "H3",
      "text": "选项 2. 删除页面"
    },
    {
      "level": "H3",
      "text": "选项 3. 保留页面"
    },
    {
      "level": "H2",
      "text": "暂时缺货，可能很快会入库"
    },
    {
      "level": "H2",
      "text": "暂时缺货，可能不会再入库"
    },
    {
      "level": "H3",
      "text": "选项 1. 保持在线"
    },
    {
      "level": "H3",
      "text": "选项 2. Noindex"
    },
    {
      "level": "H3",
      "text": "选项 3. 将其保留一段时间并稍后删除或重定向"
    },
    {
      "level": "H2",
      "text": "如何查找缺货产品"
    },
    {
      "level": "H2",
      "text": "最后"
    }
  ],
  "author": "Patrick Stox"
}