{
  "url": "https://ahrefs.com/blog/zh/find-websites-keywords/",
  "slug": "find-websites-keywords",
  "title": "如何找到一个网站的关键词（自然和付费）",
  "description": "你可以使用 SEO 工具在几秒钟内找到任何网站的自然和付费关键词。",
  "content": "Mateusz Makosiewicz Ahrefs 的营销研究员和教育家。 Mateusz 在推广代理、SaaS 和硬件业务领域拥有超过 10 年的营销经验。平时喜欢创作音乐或享受长距离的散步。 内容 与网上的一些建议相反，你不许要通过查看网站的 HTML 代码或使用 “查找” 功能找到网站的关键词。你只需要一个 SEO 工具来做这件事。深入研究，看看如何真正地找到网站的自然关键词（在谷歌排名的关键词），甚至付费关键词（用于在谷歌广告上出价的关键词）。 如何找到任意网站的自然关键词（包括竞争对手或任意网站）如上所述，你需要一个 SEO 工具来完成这项工作。下面是如何用 Ahrefs Site Explorer（网站分析） 在几秒钟内找到任意网站的关键词：输入任何网站的 URL。其中搜索模式有域名模式、路径模式、或精准匹配 URL 模式。点击搜索转到 Organic keywords（自然关键词）报告。你就有了——该网站在谷歌排名的所有关键词。 除了关键词，Site Explorer（网站分析）会显示很多重要的 SEO 指标，如当前在 SERP（搜索引擎结果页）上的位置、搜索量、关键词难度（KD），甚至是排名历史。你也可以使用过滤器来限制数据的范围。例如，你可以查看难度低的关键词，或者寻找包含特定词组的关键词。 后续做什么？因为在这里你会发现非常多的关键词，所以学习如何为你的网站选择最好的关键词是非常有必要的——我们这里有一个完整的指南。那些无法找全网站关键词的方法以下的这些会告诉你，为什么你需要一个高级的SEO工具。寻找关键词的一个过时的方法是查看页面的 HTML 代码，并查看代码的这两个部分：<meta name=”keywords”> – 这是过去 SEO 们用来放关键词的地方，以告诉 Google 这个页面是关于什么的（并希望能在这些词上获得排名）。现在几乎没有人使用，所以你不会在那里找到有用的信息。<title> – 这决定了页面的标题。这可以暗示该页面的目标关键词是什么，正如该页面的创建者所想的那样。这意味着：a）该页面可能不会在 SERP 的前 100 个结果中出现该关键词的排名；b）你一次只能看到一个自然关键词（没有任何SEO数据）。另一种方法是使用 Google Keyword Planner。这种解决方案更好，但仍然不准确。 GKP会根据一个页面的 URL 向你展示一个混合的关键词创意，在这里你会看到：一些页面排名的自然关键词，但你不会知道是哪些。而且你很可能会得到整组关键词的的搜索量，而不是单一的一个（你可以在我们的研究中了解更多）。与主题相关的关键词，谷歌会建议你使用这些词做广告。所以得到的并不是一个页面实际参与排名的自然关键词。我们关于关键词研究的文章在这些关键词中大多数都没有排名。同时你可能会注意到 GKP 报告的每个关键词的搜索量范围都是相同的。谈到搜索广告的关键词，你也可以通过工具来找到它们。 如何找到任何网站的付费关键词 一些 SEO 工具允许你看到付费关键词（又称 Google Ads 关键词或 Google AdWords）。以下是你如何使用 Site Explorer（网站分析）来实现这一点：输入任何网站的 URL。同样，设置模式：域名模式、路径模式、或精准匹配 URL 模式。点击搜索。进入 Paid keywords（付费关键词）报告。 除了关键词之外，这份报告还向你展示了其他的数据，例如：关键字的成本（CPC）搜索量一个页面从一个特定的关键词得到的估计流量关键词的落地页关键词的广告等等。FAQ如何为 SEO 找到好的关键词？ 有几种方法可以做到这一点：查找竞争对手的关键词——然后你可以尝试在相同的关键词上进行排名，或者利用它们来寻找类似的关键词。 使用关键词研究工具——关键词研究工具仅根据一个词或短语，就能发现数百个关键词的建议，以及它们的 SEO 指标。 研究哪些话题能引起受众的共鸣——这样，你可以发现许多未开发的关键词、你不知道的话题、或刚开始流行的话题。 了解如何使用每一种方法——Ahrefs 的关键词研究：初学者指南。 什么是 Keyword Difficulty（关键词难度）? Keyword Difficulty（关键词难度）是一个SEO指标，它估算出将一个给定的关键词排在谷歌第一页的难易程度。 在 Ahrefs，我们用从 0 到 100（最难）的尺度来衡量，数值的计算是基于链接到排名前 10 网页的链接网站数量的。链接到前 10 名网页的网站越多，你为了获得排名，需要的反向链接就越多。 这就是基本情况。如果你想更准确地估计你的排名机会，你需要再算上几个因素，例如你的网站权重和你是否有能力匹配搜索意图。 了解更多，请阅读 Keyword Difficulty（关键词难度）：如何预估你的排名机会。我如何在我的网站上使用关键词？ 尽量每页选择一个目标关键词——这将是该页的主题。你仍然能够获得许多其他相关关键词的排名（不需要堆砌关键词）。然后，在制作你的内容时考虑到以下这些： 相关：让你的内容与搜索意图（内容类型、格式、和角度）保持一致。全面：内容中包含用户期望看到的常见的副标题。标题中出现关键词在 《On-Page SEO：初学者指南》 中了解更多关于用内容锁定关键词的信息。深入阅读有兴趣了解更多关于 SEO 和关键词的知识吗？试试这些指南：SEO：初学者完整指南种子关键词：是什么以及七个有效的寻找方式 长尾关键词：是什么以及如何通过它们获取流量 SEO 如何寻找低竞争力的关键词键词 高级关键词研究：寻找未开发关键词的 5 个技巧 有问题吗？在 Twitter 上找我吧。译者，Park Cheng，歪猫出海创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Mateusz Makosiewicz Ahrefs 的营销研究员和教育家。 Mateusz 在推广代理、SaaS 和硬件业务领域拥有超过 10 年的营销经验。平时喜欢创作音乐或享受长距离的散步。",
  "headers": [
    {
      "level": "H1",
      "text": "如何找到一个网站的关键词（自然和付费）"
    },
    {
      "level": "H2",
      "text": "如何找到任意网站的自然关键词（包括竞争对手或任意网站）"
    },
    {
      "level": "H3",
      "text": "那些无法找全网站关键词的方法"
    },
    {
      "level": "H2",
      "text": "如何找到任何网站的付费关键词"
    },
    {
      "level": "H2",
      "text": "FAQ"
    },
    {
      "level": "H3",
      "text": "如何为 SEO 找到好的关键词？"
    },
    {
      "level": "H3",
      "text": "什么是 Keyword Difficulty（关键词难度）?"
    },
    {
      "level": "H3",
      "text": "我如何在我的网站上使用关键词？"
    },
    {
      "level": "H2",
      "text": "深入阅读"
    }
  ],
  "author": "Mateusz Makosiewicz"
}