{
  "url": "https://ahrefs.com/blog/zh/flesch-reading-ease/",
  "slug": "flesch-reading-ease",
  "title": "易读性指数：它对 SEO 有影响吗？ （数据研究）",
  "description": "易读性指数 (FRE) 是一种对文本可读性进行评分的方法。分数范围在 1 到 100 之间，分数越高被认为更容易阅读。",
  "content": "Michal Pecánek Ahrefs的营销专家和内容创作者。 沉迷于SEO，航空，香氛，寿司和墨西哥玉米卷。 内容 许多 SEO 和内容工具都会提供与 Flesch Reading Ease（易读性指数）类似的可读性建议。但是你应该注意多少呢？它到底有什么用？更好的可读性分数可以帮助你获得更好的排名吗？在本文中，你将通过我们对 15,000 个关键词的小型研究来了解这些问题的答案。但在深入讲解之前，确保我们都了解了基础的知识。什么是易读性指数？易读性指数会影响 Google 的排名吗？你是否应该根据易读性指数来优化你的内容吗？方法中值得注意的东西什么是易读性指数？易读性指数 (FRE) 是一种对文本可读性进行评分的方法。分数范围在 1 到 100 之间，分数越高被认为更容易阅读。这是易读性指数评分公式：你可能永远不需要自己计算它，但请记住它的两个变量：句子和单词的长度。你的单词和句子平均越长，你的 FRE 分数就越低。易读性指数会影响 Google 的排名吗？2018 年，来自 Google 的 John Mueller 表示，他不知道有任何使用易读性指数的算法。而且由于 FRE指标非常基础，只有两个变量在起作用，因此使用它并没有多大意义。所以不，像 FRE指标这样的易读性指数不会直接影响排名。我们对 15,000 个关键词的研究也证实了这一点。研究表明排名和 FRE 指标之间的相关性几乎为零。 那么，为什么这么多 SEO 和内容工具会显示这个分数呢？是因为 FRE 指标代表可读性，而可读性显然很重要。它可以影响用户体验——这些年来，这在 SEO 中变得越来越重要。如果搜索者发现你的内容难以阅读和理解，他们可能会离开。这会导致负面的用户体验信号，例如停留时间短、跳出率高，这可能会向 Google 表明你的网页效果不佳。 更糟糕的是，由于实际最终观看内容的访问者较少，因此链接到内容的人也较少——而且我们知道外链是最重要的排名因素之一。你是否应该根据易读性指数来优化你的内容吗？鉴于可读性很重要，如果你的 FRE 分数太低，你就应该优化你的内容，对吗？不完全是，因为这却决于你的话题。例如，考虑一个就像现在这样，你正在阅读一个技术相关的主题。如果不使用一些复杂的词，就无法谈论易读性指数和 SEO。如果我们试图通过用简单的词替换复杂的词来“优化”这篇文章的可读性，我们只会让事情变得更难理解。也没有理由这样做，因为这也不是针对大众的文章。我们的目标关键词是“flesch reading ease”，在美国每月有 4,900 次搜索：你现在已经阅读到了这里，很明显你的阅读理解水平高于平均水平，并且对出现的几个 “大词” 并不反感。也就是说，如果你正在撰写一个更大众的主题，可能会吸引具有不同阅读理解水平的人，那么争取更高的 FRE 分数可能是一个好主意。但事情是这样的：如果你正在编写煎饼食谱，则不太可能使用长而复杂的单词和句子。正如我们在小型研究中发现的那样，这可能就是为什么 Google 前 10 个结果的平均 FRE 分会因为主题的不同而产生差异：你可以看到平均 FRE 分数根据主题的复杂性而降低：食物 (简单话题): 平局 69.7 分，即相当容易阅读营销 (中等难度话题): 平均 60.2 分，即标准阅读水平工程（复杂的话题）: 平均 49.6 分，即难以阅读很明显，与那些谈论工程的人相比，撰写与食品相关主题的人并没有 “优化” 他们的可读性。只是食物是一个相对更简单的话题。这一切在实践中意味着什么？这项研究的结果证实，没有适用于所有类型内容的可读性分数阈值。我们天生就会根据主题和目标受众使用不同的词汇。话虽如此，这里有6个与易读性分数相关的 SEO 和内容创作技巧：不要盲目追求 SEO 和内容工具中的“满分”。了解你的用户并为他们创作内容。保持良好的创作习惯。使用简短的句子，但也不要害怕在这里和那里插入复杂的句子。不要让事情变得比他们需要的更复杂。编辑时大声朗读。它有助于发现你通常会忽略的问题。让其他人校对你的文本并提供反馈。总结一下：只要你坚持扎实的创作习惯，易读性分数对 SEO 来说并没有那么重要。真正重要的是有价值的内容。你不要总是遵循工具仅根据分数为你提供的建议。只有易读性分数与通常的分数有显着不同时，我才建议你查看它。方法中值得注意的东西我选择了几个专注于工程、营销和食品主题的大型网站的样本。使用 Ahrefs Site Explorer（网站分析） 中的 Organic Keywords （自然关键词）报告。我导出了搜索量范围不同的关键词样本，其中每个都排在前 10 名。这仅适用于美国的英语关键词：这份自然关键词报告显示了 ahrefs.com 美国每月至少有 1,000 次搜索，并且排名前 10 的 500 个关键词。我使用了不同的搜索量范围来确保样本在每个类别中都包含热门和长尾关键词。这些关键词是独一无二的，并且删除了任何明显的品牌关键词。我们最终在每个类别中得到了 5,000 个关键词，这意味着我们总共分析了 15,000 个关键词和 SERP。其中有一些页面（工程 19%，营销 9%，食品 10%）被排除在研究之外，因为内容过少无法可靠地计算它们的易读性分数。有问题吗? 在 Twitter 上找我吧。译者，Park Cheng，歪猫出海创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Michal Pecánek Ahrefs的营销专家和内容创作者。 沉迷于SEO，航空，香氛，寿司和墨西哥玉米卷。",
  "headers": [
    {
      "level": "H1",
      "text": "Flesch易读性指数: 它对 SEO 有影响吗? (数据研究)"
    },
    {
      "level": "H2",
      "text": "什么是易读性指数？"
    },
    {
      "level": "H2",
      "text": "易读性指数会影响 Google 的排名吗？"
    },
    {
      "level": "H2",
      "text": "你是否应该根据易读性指数来优化你的内容吗？"
    },
    {
      "level": "H2",
      "text": "这一切在实践中意味着什么？"
    },
    {
      "level": "H2",
      "text": "方法中值得注意的东西"
    }
  ],
  "author": "Michal Pecánek"
}