{
  "url": "https://ahrefs.com/blog/zh/free-online-marketing-courses/",
  "slug": "free-online-marketing-courses",
  "title": "17个免费的在线营销课程，学习数字营销",
  "description": "17个免费的在线营销课程，学习数字营销",
  "content": "Rebecca Liew 内容营销人员和作家。 沉迷于文字、文具和步行探索新地方。 内容 我们让 Twitter 用户推荐他们最喜欢的免费数字营销课程，收到了超过100条回复:Is there a good FREE digital marketing course that you can recommend?— Tim Soulo 🇺🇦 (@timsoulo) August 17, 2021 课程有来自Google’s Digital Garage, HubSpot Academy, and Ahrefs Academy 等所有的课都在投票范围中，但是还有什么符合标准呢？为了缩小我们的研究，我主要看这几个方面：课程的指导文件评分和评价对学生(初级，中级，专家)要求的经验水平。课程材料在当今营销领域的相关性。以下是入围的免费数字营销课程:How to Use TikTok for Business by Later.comContext is Key: Social Media Strategy in a Noisy Online WorldInstagram for Business: Build an Engaged Community Blogging for Business by AhrefsSEO Training Course by AhrefsDigital Skills: Digital Marketing by AccentureContent Marketing Certification Course by HubSpotIntroduction to Social Media Advertising by BufferDigital & Social by Twitter Flight SchoolGoogle Ads by SkillshopSEO Training Course by HubSpotHow to Use Instagram Stories (IGS) for Business by Later.comMicrosoft Advertising CertificationEmail Marketing Certification by HubSpotPPC University by WordstreamGoogle Primer: Marketing & MeasurementGoogle Digital Garage: Fundamentals of Digital MarketingBonus: LearningSEO1. How to Use TikTok for Business by Later.com导师: Taylor Loren主题: 社交媒体营销级别: 初学者证书: 没有时间: 35分钟 可用: Later.comTaylor Loren, Later网站内容营销的前主管, 主要根据她在流行的社交媒体平台上的经验来指导这个简短的在线课程。她在 TikTok 上有超过26000名粉丝，她提供了一些你可能不知道的有用建议，比如使用热门音频剪辑或视频编辑效果可以增加你登陆 For You 页面的机会。需要注意的是: 这个35分钟的视频课程本质上是对完全新手的 TikTok Business 世界的入门。我自己也用过这个短视频平台，我发现它相当直观。不过，如果你想充分利用这个算法，通过吸引眼球的内容和 TikTok 广告来扩大你的影响力，泰勒的建议还是特别有用的。2. Context is Key: Social Media Strategy in a Noisy Online World导师: Gary Vaynerchuk主题: 社交媒体营销级别: 初学者证书: 没有 时间: 1小时31分钟可用: SkillshareGary Vaynerchuk 是数字社交媒体机构 Vaynermedia 的首席执行官兼联合创始人，他在 Twitter 上的 240 万粉丝可以证明他的成功。因此，超过50,000名学生完成了这个 Skillshare 课程也就不足为奇了，其中81% 的学生表示这个课程要么超出了他们的预期，要么达到了他们的预期。本课程涵盖了23个视频课程，着眼于如何为社交媒体平台，包括 Twitter、 Facebook 和 Instagram，制定适合自己的策略，以及如何建立一个可靠的品牌叙事的技巧。尽管我们认为 Pinterest 和 Tumblr 上的案例研究在今天并不特别重要，但这门课程仍然值得一试。你会学到一些 Gary 曾经用来发展主要品牌的策略，比如General Electric (通用电气)和Pepsico (百事可乐)。还有一个可选项目，涉及到为你选择的品牌创建一个特定渠道的社交媒体策略，尽管这更多是为了练习，因为它没有分级。小提示. Skillshare 试用可免费听课。3. Instagram for Business: Build an Engaged Community导师: Tyler McCall主题: 社交媒体营销级别: 初学者证书: 没有时间: 1小时31分钟 可用: Skillshare作为一名自由 Instagram 营销营销战略师，Tyler McCall 对这个平台了如指掌。在这个13课的课程中，他邀请营销人员和企业主重新审视建立一个有参与度的社区的基础知识。虽然这个课程是和 Iconosquare 联合开发的，但是你不需要使用社会媒体分析工具来学习这些课程。除了分享如何定义你的观众和设定正确的目标，泰勒还探讨了如何制作吸引注意力的视觉效果，通过 Iconosquare 衡量成功与否，以及如何利用评论和标签来建立一个社区。在利用Instagram故事中还有一个奖励课程，以将粉丝转换为您的网站或通讯，以及可选的实践分配的类工作表。超过22,000名学生完成了课程。在那些评分它的人中，96％的人表示超过或满足了他们的期望。泰勒也走了谈话：他在Instagram上接近50,000名粉丝。小提示. Skillshare 试用可免费听课。4. Blogging for Business by Ahrefs导师: Tim Soulo主题: 社交媒体营销级别: 初学者证书: 没有时间：4小时50分钟 可用: Ahrefs Academy我们是如何将 Ahrefs 博客发展到每月访问量数十万的？ 这就是本课程旨在教授观众的内容。 它是 Ahrefs Academy 的一部分，我们的在线学校提供四门详细课程，可帮助您使用 Ahrefs 工具集改进内容营销人员。在 Ahrefs 的 CMO Tim Soulo 的领导下，Blogging for Business 分为 11 个模块和 40 个课程。 其中包括基础视频，例如要了解的关键客户获取渠道和增长策略、创意生成技巧以及优化和推广内容以实现进一步增长的技巧。还有奖励视频，包括与 Noah Kagan 的深入聊天，他是每日交易平台 Appsumo 的幕后推手。 最好的一点：这个免费课程不需要注册。5. SEO Training Course by Ahrefs导师: Sam Oh主题: SEO级别: 初学者证书: 没有时间：2小时 可用: Ahrefs Academy本课程将帮助你掌握 SEO 基础知识，包括关键词研究、页面 SEO 和链接建设策略，以帮助你在搜索引擎中获得更高的排名。在如何通过搜索引擎优化实现 Ahrefs 复合增长的指导下，课程分为四个模块和14个课程。本文最后介绍了技术 SEO 的重要性以及需要了解的最佳实践。6. Digital Skills: Digital Marketing by Accenture创作者: Harry Hurst导师: Saikat Sengupta, Rita Bruni主题: 数字营销级别: 初学者证书: 有时间：~4小时 可用: Futurelearn.com好奇不同的数字营销策略，你可以用来发展你的业务或职业生涯？这门入门课程可以引导你走向正确的方向。20多万学生完成了这门评价很高的课程，这证明了一切。在大约两周内，19课的课程视频课程涵盖了以下基础：数字营销展示和点击付费广告SEO电子邮件营销在最后的课程中，你将学习如何将这些技巧应用到你的工作中。这个基础课程包括验证你的学习的测试，以及完成后的 PDF 成就证书(由 CDP 认证服务认可)。7. Content Marketing Certification Course by HubSpot创作者: Justin Champion, Guillaume Delloue, Abigael Donahue, AJ Beltis, Matthew Howells-Barby, Corey Braccialini, Lindsay Thibeault主题: 内容营销级别: 初学者证书: 有时间: 6.2小时 可用: HubSpot Academy这个人在 Tim 的 Twitter 帖子里收到了多条 shout。要访问免费内容营销课程，你需要建立 HubSpot 帐户。但是，这是值得你的时间。我在几分钟内通过链接我的Google帐户并回答一些简单的问题。本课程以内容营销的基本原理和讲故事的技巧为开始，然后是12节关于开发内容创建框架和衡量内容效果的课程。该课程由各行各业的专业人士领导，其中大多数人来自 HubSpot 的营销团队，课程包括多个测试，以测试你对所涉及的主题的知识。最后，你可以选择参加三小时的考试。它包括60道多项选择题，其中你需要45/60的分数才能及格。8. Introduction to Social Media Advertising by Buffer导师: Brian Peters主题: 社交媒体广告级别: 初学者证书: 没有时间: 53分钟 可用: SkillshareBrian Peters在Buffer的数字和社交媒体经理，他向初学者介绍了付费社交广告的潜力，以及如何从零开始创建社交媒体广告活动。这个10课的课程着眼于要知道的关键术语，营销渠道，目标和预算设定，以及为长期成功而优化的活动。到目前为止，已经有超过21500名学生完成了这门课程，近50% 的评论表明这门课程超出了预期，这要感谢布莱恩的精彩教学和所使用的有益例子。小提示. Skillshare 试用可免费听课。9. Digital & Social by Twitter Flight School导师: N/A主题: 社交媒体广告级别: 进阶者证书: 有 (只适用于 Twitter 视频徽章课程)时间: 5.2小时 可用: Twitter Flight School 想知道如何利用 Twitter 作为一个广告平台吗？让本课程向您展示13个模块，进一步细化成易于理解的文章，每个模块都以多项选择知识检查停止。鉴于本课程是为有经验的成长型营销人员开设的，主题涵盖了从 Twitter 广告经理介绍到在移动应用程序和网站上发起和衡量广告成功率。虽然我们通常喜欢视频课程，但是通过短文章列出的信息可以让你更快地检查覆盖的指针。开始的时候，登录你的 Twitter 账号，一切就绪。如果你更大的目标是在你的 Twitter 和 LinkedIn 个人资料上展示一个徽章，试试 # twitterflightschool Video Badge 课程。它涵盖了社交媒体平台上的视频广告。10. Google Ads by Skillshop导师: N/A主题: SEM （搜索引擎营销）级别: 初级到中级证书: 有 (谷歌广告证书) 时间: 取决于你的承诺可用: SkillshareSkillshop by Google 是一个在线学院，提供一些主要工具的课程，包括:谷歌广告分析学院谷歌广告经理谷歌营销平台谷歌我的业务Skillshop提供的一些认证.虽然谷歌广告标榜自己是初学者的理想选择，但我们认为你至少需要一些 SEM 的工作知识，才能轻松地理解这些课程。它们的格式很像 Twitter Flight School的课程，只是更深入一些。先做一个预先的自我评估，然后检查每个主题，其中一些包括可选的视频，以加深你的知识。我们喜欢自主学习。但是公正的警告: 课程(和主题)的数量太多可能会让你感到不知所措，所以在投入到一个主题之前，花点时间仔细阅读课程。11. SEO Training Course by HubSpot导师: Rachel Sheldon主题: SEO 级别: 初级到中级证书: 有时间: 2小时21分钟可用: HubSpot由Hubspot Academy的入站教授Rachel Sheldon领导，这课程到SEO介绍了您所期望的所有基础知识。这些包括网站优化，页面和技术SEO和关键词研究。还有工作表和三个问题测验，其次是三小时的考试来测试您的知识。与此列表中的其他Hubspot Academy课程一样，你将被认证，您应至少参加45/60。12. How to Use Instagram Stories (IGS) for Business by Later.com导师: Lexie Carbone, Taylor Loren 主题: 社交媒体营销级别: 初学者证书: 没有 时间: ~60分钟可用: Later.comTaylor-他也是上述关于使用 TikTok 进行商业活动的课程的学员-这个长达一个小时的课程是和稍后的营销活动经理 Lexie Carbone 一起主办的。虽然本课程是在2019年开发的，但由于大多数视频已被一系列11篇文章所取代，因此内容仍然是最新的。通过这些，你将学习如何利用IGS在社交媒体平台上发展您的业务。该课程分为三条轨道：设计，增长和策略，所有这些都在捕获和保留Instagram用户的兴趣中起着至关重要的作用。我们发现增长轨道特别有用;课程解释了IGS分析以及如何了解每个指标，以改善您的故事策略。13. Microsoft Advertising Certification导师: N/A主题: SEM级别: 中级认证：是（Microsoft广告认证的专业徽章和可打印证书）时间: 取决于你的承诺可用: Microsoft.com在这个以230页的学习指南为特色的课程中，你将会做比看更多的阅读。不过，我们认为，如果你打算把这个徽章添加到你的社交媒体平台上，包括 LinkedIn，是值得的。免费下载包括一个认证主题清单，其中包括:微软广告的基础知识以及按点击付费广告是如何运作的点击付费竞价、流量估算和点击成本策略预算和账单目标人群为了避免纯文本的单调乏味，研究指南补充了必应广告的截图，以及虚构案例研究的图表。14. Email Marketing Certification by HubSpot导师: Courtney Sembler 主题: 邮件营销级别: 初级到中级证书: 是的 时间: 3小时18分钟可用: Later.com 平淡无奇的非个人感情的电子邮件是过分的和无效的。那么，为什么人们仍然依赖它们呢？本课程通过9个主题和28个带有测验的视频来挑战你重新思考陈旧的电子邮件营销策略，以保持你在正轨上。由 HubSpot 的高级经理 Courtney Sembler 主持，你将学习如何“人性化”你的副本，通过培养关系发展，并应用这些经验教训使用该软件公司的免费电子邮件营销工具。与 HubSpot 的所有课程一样，你有三个小时的时间完成60道题的考试，并有机会获得电子邮件营销证书。15. PPC University by Wordstream导师: N/A 主题: SEM级别: 初学者证书: 无时间: 取决于你的承诺可用: Wordstream对 PPC 模式好奇吗？然后让 Wordstream 成为你的向导。它的 PPC 大学有三个引导课程，可以帮助你进行关键词研究，参与谷歌关键词竞价，以及优化谷歌广告活动。作为一个初学者，我发现PPC 101有用：有11个文章解释了基础知识，例如点击率和每个操作的成本，以及设置Google广告帐户的逐步指南。如果您想更深入，还有一个32页PPC 101指南，可以使用 — 并在注册时免费下载。16. Google Primer: Marketing & Measurement导师: N/A主题: 市场营销 (通识课)级别: 初阶到高阶证书: 无时间: N/A可用: YourPrimer.com Google Primer 是一个面向企业主和营销人员的免费应用程序，提供五分钟的课程，涵盖数字营销、测量、社交媒体、分析等等。有三个关键轨道为您的选择: 业务和运营，品牌和身份，以及市场营销和测量。后者是特别全面和相关的，有10个总体主题为初学者和经验丰富的营销人员。一些有趣的经验教训包括众包你的用户测试，充分利用一个创造性的机构，并通过一个应用程序活动到达正确的受众。很少有课程提供像谷歌入门这样易于理解的课程形式，所以我们强烈推荐它。17. Google Digital Garage: Fundamentals of Digital Marketing导师: N/A主题: 市场营销（通识课）级别: 初学者证书: 有时间: 40小时 可用: Google Digital Garage要深入了解数字营销的基础知识，可以从这门由Interactive Advertising Bureau Europe and The Open University认可的课程开始。你将被介绍到数字车库，并被教导建立和发展你的在线商业战略超过26个模块。该课程还深入研究了搜SEO和SEM (搜索引擎营销)，移动广告，甚至建立一个电子商务业务。考虑到你能学到多少东西，一个40小时的课程其实并不是一个沉重的负担ーー尤其是当你在视频教程和实践练习的指导下可以自由调整自己的节奏时。为了获得在 LinkedIn 和简历中使用的认证，你需要通过最后的40道题的考试。Google Digital Garage也是在我们的 Twitter 帖子中被提到最多的网站之一，如果我们可以补充的话。18. Bonus: LearningSEO学习SEO不是一个课程。相反，它是一个广泛的(并定期更新)资源库，任何人希望提高他们的SEO知识。我喜欢它的详细性和组织性: 有根据你的经验水平分类的外部指南、课程和视频。它涵盖了 SEO 基础知识(衡量和报告SEO) ，甚至讨论抓取预算优化和发展SEO合同的技术细节。 你甚至可以制作一份(可分享的) SEO 列表，它带有一个用颜色编码的电子表格中的复选框。最后的想法完成一门课程需要承诺(我应该知道!)。所以，如果你感到不知所措，首先考虑什么让你兴奋。如果是内容营销，那就从这里开始。然后，在你想要改进的更多技术领域取得进展，比如开发和测量广告活动。这里的所有课程都是自定进度的，所以你需要花费所有的时间来完全掌握每一个主题。拥有一个坚实的基础是数字营销做得更好的关键。有问题吗? 在推特上给我发消息。译者：John Zhao, 西品东来创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Rebecca Liew 内容营销人员和作家。 沉迷于文字、文具和步行探索新地方。",
  "headers": [
    {
      "level": "H1",
      "text": "17门学习数字营销的免费网络营销课程"
    },
    {
      "level": "H2",
      "text": "1. How to Use TikTok for Business by Later.com"
    },
    {
      "level": "H2",
      "text": "2. Context is Key: Social Media Strategy in a Noisy Online World"
    },
    {
      "level": "H2",
      "text": "3. Instagram for Business: Build an Engaged Community"
    },
    {
      "level": "H2",
      "text": "4. Blogging for Business by Ahrefs"
    },
    {
      "level": "H2",
      "text": "5. SEO Training Course by Ahrefs"
    },
    {
      "level": "H2",
      "text": "6. Digital Skills: Digital Marketing by Accenture"
    },
    {
      "level": "H2",
      "text": "7. Content Marketing Certification Course by HubSpot"
    },
    {
      "level": "H2",
      "text": "8. Introduction to Social Media Advertising by Buffer"
    },
    {
      "level": "H2",
      "text": "9. Digital & Social by Twitter Flight School"
    },
    {
      "level": "H2",
      "text": "10. Google Ads by Skillshop"
    },
    {
      "level": "H2",
      "text": "11. SEO Training Course by HubSpot"
    },
    {
      "level": "H2",
      "text": "12. How to Use Instagram Stories (IGS) for Business by Later.com"
    },
    {
      "level": "H2",
      "text": "13. Microsoft Advertising Certification"
    },
    {
      "level": "H2",
      "text": "14. Email Marketing Certification by HubSpot"
    },
    {
      "level": "H2",
      "text": "15. PPC University by Wordstream"
    },
    {
      "level": "H2",
      "text": "16. Google Primer: Marketing & Measurement"
    },
    {
      "level": "H2",
      "text": "17. Google Digital Garage: Fundamentals of Digital Marketing"
    },
    {
      "level": "H2",
      "text": "18. Bonus: LearningSEO"
    },
    {
      "level": "H2",
      "text": "最后的想法"
    }
  ],
  "author": "Rebecca Liew"
}