{
  "url": "https://ahrefs.com/blog/zh/google-keyword-planner/",
  "slug": "google-keyword-planner",
  "title": "如何使用谷歌关键词规划师2019最新",
  "description": "通过这篇完整的、小白友好教程，学习如何精通谷歌关键词规划师。",
  "content": "Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。 内容 你想从Google搜索引擎获得更多流量吗？首先你要做的是关键词研究，了解用户会搜索的关键词。值得庆幸的是，Google給了一个免费的工具- Google Keywords Planner关键词规划师。（曾经叫做 Google Keyword Tool）Google在升级这个工具的时候使了一个坏，在过去的关键词工具中，你能详细看到准确的月度搜索量。（monthly search volume）而现在，你只能看到关键词大致的一个搜索量范围。Google关键词规划师 “best protein powder” 关键词的月度搜索量虽然，你依然可以获取到精准的关键词搜索量，但是这就需要你开通 Google Adwords 服务。当然，这个是需要收费的。不过，不需要担心，Google Keywords Planner 的功能足够的强大，依然可以满足我们的研究需求。比如说，他的关键词推荐功能依然十分的有效，是任何一个工具都无法媲美的。https://www.youtube.com/watch?v=y‑abxi0Pclc当然，问题就是很多的SEO从业人员并不知道如何完美的提取这些有用的数据。在这篇文中，我会展示如何通过 Google Keywords Planner 提取对于SEO人员有价值的数据，说不准，我们还能通过一些特殊手段去获取准确的关键词搜索量呢。首先让我们从一些基础开始做起。如何免费获得Google Keywords Planner的使用权？Google 关键词规划师是100%免费的，你不需要为了使用工具而充值它的Google Adwords服务。小提示.如果你没有Google 账号，可以点击这里获取。但是当你登入账号之后，可能会出现如下的界面。工具会提醒你开启一个Adwords的广告项目。Google非常重视这一点，看起来好像Google强制性的在让你付费，才能够顺利使用Keyowords Planner（谷歌关键词规划师）服务。但是，我有一个小技巧。让你可以免费的使用关键词规划师工具，而不需要花一分钱。下面是免费使用工具的方法：访问这个页面，点击 “Start using keyword planner” (开始使用关键词工具)开始使用关键词工具小提示.你可能需要重新输入账号密码登录下面是最重要的步骤：当你看到登录页面的时候，不要直接填写信息，而是选择 “Skip the guided setup”（跳过向导教程）然后，输入你的邮箱，国家，时区，货币。这些填写好之后，点击 “Save and continue” （保存并继续）最后，点开你的导航菜单，选择“Tools > Planning > Keyword Planner” （工具 > 计划 > 关键词规划师）。选择 工具 > 计划 > 关键词规划师这时，你已经可以成功的使用关键词规划师工具，不需在Adwords上花一分钱。小提示.这种方法适用于个人Google账号。但是在使用Google APP统一账号的时候似乎无法使用。我建议如果要使用这个工具，先去申请一个个人的账号。如何使用谷歌关键词规划师工具？谷歌关键词规划师工具给了你两种使用的方法：查找关键词：获取实用的关键字提示，以便更好地覆盖对您的产品或服务感兴趣的用户。获取搜索量和预测数据：查看关键字的搜索量及其他历史指标，以及关键字未来效果的预测数据两个选项都会带你进入关键字计划页面，但是你所看到的将根据你的选择而略有不同。这不是两个独立的工具。让我们一起来看一下这两个功能分别如何使用。“查找关键词” 功能你想发现新的关键词吗？从这里开始。根据Google的说明，只要 “输入与您的业务相关的单词、短语或URL”，Google就会回馈一些关键词建议。下面是Google给予 “SEO” 这个关键词的建议：Google给予 “SEO” 关键词的建议这里一共整理了有1,016个关键词。在这些关键词建议中，你从中能够获得如下数据：每月搜索量；竞争力度；页面顶部竞价（低范围）；页面顶部竞价（高范围）当然，输入的内容你不局限于单个单词，同样，短语也可以使用。你可以一次输入三个种子关键词或是短语，然后让工具给予你相关的建议。同时，你可以使用URL作为你的种子词汇，进行关键词建议搜索。或者你可以同时输入3个种子关键字和一个URL，进行关键词建议搜索。但是无论你怎么做，谷歌也只会显示1000到2000关键词建议。即使，当我输入最多的三个种子关键词（“SEO”、“Link Building” 和 “keyword research”），我只得到了1,693个关键词建议。和其他的关键词挖掘工具想比，这个功能简直弱爆了。比如说Ahrefs的关键词工具，依然是基于相同的三个种子关键词，Ahrefs能够帮你找到232,252个关键词建议，……相当于 Google关键词规划师的137倍。“获取搜索量和预测数据” 功能你是否已经有一个你希望看到的关键词列表？从这里开始。只要复制到输入框当中，点击 “Start”，它就会进入到到关键词预测部分。这里没有关键字建议。但是，它显示了在接下来的30天里，如果你决定在Google AdWords上为你选择的关键词做广告，你能可能可以获得多少点击和展现。同时，你也会看到Cost（预估成本），CTR（点击通过率）以及CPC（单次点击成本）成本。这些数据大部分是针对AdWords广告商的。但这里有一个很快的技巧：转到 “Historical Metrics”（历史度量）标签，你会看到搜索关键词的12个月平均搜索量。这些数据和你直接从”查找关键词” 功能是一样的。这样的数据，你依然没有看到SEO的价值？没关系，继续阅读。我会用一种特殊技巧来获取关键词精确的搜索量。7个谷歌关键词规划师使用特殊技巧（一般SEO人员都不知道）当我在Facebook当中，针对谷歌关键词规划师使用上，问到一些行业的朋友，发现很多人已经停止使用Google关键词规划师工具，他们给我的反馈是这样的：关键词规划师工具 使用者反馈所以我深入研究了一下，试图理解为什么会出现这种情况。他不使用google关键词规划师的理由合理的观点，找不到有用的信息，人们自然不会使用。但是谷歌关键词规划师能够提供的价值不仅仅是在搜索量上。下面我会介绍7个特殊的使用技巧，让你最大限度地利用关键词词规划师工具，我从大家期待的第一点开始讲…….1. 解锁并获取精准搜索量谷歌不愿展示准确的搜索量是确实令人很头疼。这就是为什么许多SEO根本不再使用工具的原因。例如，看这两个关键字都具有10K-100K范围的月度搜索量：但是我知道，实际上，这些关键词中，一个比另一个搜索肯定会更多。这里有我提供两种方法，让你可以免费的得到一些确切的数字。方法 #1 查看关键词最大CPC时的展现开始在你的计划中增加一些关键词。你可以通过在 “Get search volumes and metrics”（获取搜索量和预测数据） 工具中手动输入关键字，来实现这一点。或者，在 “查找关键词” 功能中，找到一些关键字，并将它们添加到计划中。但是在选择时，请确保选择 “exact match”（精确匹配）选项。在点击进入关键词详细数据页面。你可在在上面看到一个像这样的页面：点击它的下拉菜单，确保CPC设置为最大。你可以通过点击图表的最高点来实现，像下方这样：现在注意 “展现” 这个栏目。这个数据告诉你，你的广告在接下来的30天内，会从你的目标关键词中得到多少词展现的次数。展现因为你将最大CPC价格设置得非常高，所以，这个展现数值，应该非常接近于该关键字的实际月度搜索量。现在，让我们使用Ahrefs关键词工具，来查看这些关键词得数据。还好，相差不是很大。方法 #2 安装使用 Keywords Everywhere工具Keywords Everywhere是一个免费的Chrome扩展工具，它会在你使用的Google、YouTube、Amazon网站中，将搜索量和CPC数据添加在如下的位置上：小提示.Firefox火狐浏览器也可以使用很多人不知道的是，它也给谷歌关键词规划者带来了更多搜索量。不相信？看下方的这个结果。非常棒对吧？当然，问题也来了，就是如何批量导出这些关键词数据。用一些 XPath代码 和 一些 抓取用的Chrome扩展 “Scraper Chrome extension”，批量获取数据是可以实现的。但是不管你使用什么”特殊技巧”，请对得出的数据保持一定的质疑态度。为什么？请在下面的进一步阅读 Tim（Soulo）的两篇文章。更多阅读：流量评估 为什么你不能盲目信任关键字搜索量关键词搜索量：你不知道的东西你就是不知道2. 获得超过3个种子关键词衍生的做法如果你试图在谷歌关键词规划器中添加三个以上的种子关键词，那么会发生如下的情况：不好意思，没有办法这样搜索。但有办法绕过这一点。一次只输入一个关键词。然后通过点击列表左侧的复选框，并且选择所有种子关键词，点击 “Add to Plan”（添加至计划），将它们添加到您的计划中。补充：如果你想获得1000个种子关键词的关键词建议？为什么不试一试Ahrefs的关键词工具呢？让我们针对743个 “SEO” 的关键词建议，来尝试做一次。现在，我们对如下种子关键词进行相同的处理：“Link Building”、“Keyword research”、“guest posting” 和“get more traffic”。如果我们选择关键字下面的历史数据选项，我们会看到所有我们添加的关键字。最重要的是，这个列表已经被自动去重处理过，所以不会出现重复的关键字。默认情况下，它们按字母顺序显示。但是你可以通过搜索量，竞争，任何你喜欢的顺序进行排列。3. 从竞争对手网站 “偷取” 关键词谷歌关键词规划师是可以从URL生成关键词建议的。你现在知道我要做什么吗？你可以窥探你的竞争对手，并 “窃取” 他们的关键词。只需抓取其中一个URL，复制进搜搜索框内，然后从下拉菜单中选择 “Entire site”。一共整理出了 2,274个关键词建议。如果你看到很多与竞争品牌相关的关键词，就像下方，我们可以使用过滤器功能来排除它们。步骤：Filter > keyword text > brand name （过滤器>关键字文本>品牌名称）不断重复这个操作，更多的竞争对手的网站可以给你提供源源不断的关键词建议。专业建议如果你想寻找一个特定的网页或博客帖子的关键词？选择“This page only”选项即可。让我们来针对 “谷歌关键词规划师页面” 来做个竞争对手分析把！一共有652个结果。中间包含了一些非常好的关键词建议。我会在我的教程中放一些，看看你能不能找到这些关键词对应的文章段落。4. 找到用户经常问的问题类关键词知道你的听众可能会问什么问题，对于提高内容想法以及质量是非常有帮助的。这可能就是，为什像 “Answer The Public” 这样免费的问题研究工具如此受欢迎。但是，针对问题你不需要使用单独的工具。稍加点 “特殊手段”，你就可以在关键词规划师中做到这一点。步骤：Filter > Keyword text > contains > （过滤器>关键字文本>包含>）下列选择任意一词：who, what, why, when, where, how.过滤器>关键字文本>包含>下列选择任意一词：who, what, why, when, where, how.然后重复针对其他的5个词汇进行相同的操作，当你完成的时候应该看起来像这样：结果：一共有211个问题类关键词建议。这里有一些很不错的问题类关键词推荐，比如说：what is link buildingwhat is search engine optimizationwhat is the best seo tool等等。想挖掘更多关键词类的问题么?20,125个问题关键词听起来怎么样？这就是Ahrefs的问题类挖掘工具，整理出针对 “SEO” 这个词的结果数量。通过 Ahrefs Keywords Explorer 工具导出的 SEO 相关的 20,125个问题类关键词同时，你可能注意到这些问题关键词，都有精确的搜索量。用不同的种子关键词不断重复这个过程，用来建立一个基于核心词的问题类查询列表。只需确保每次都进行问题的过滤。你甚至可以为这些设置一个特别的广告组。这样可以方便你后期导出，或者是整理这些问题类关键词。5. 通过 Suggested bid 功能 寻找商业价值高的关键词“Keywords Suggestions” （关键建议功能）非常的好用，但是这些词汇能给你的业务带来多少商业价值呢？当然你可以手动取筛选这些词汇，但是这样就太繁琐了，假设你有几百个几千个关键词呢？我的建议？我建议参考 “Top of page bid (high range)”（页首出价高位区间）栏目这里是Google官方对于 “页首出价高位区间” 的定义：“页首出价（高位）”根据您指定的地理位置和搜索网络设置显示广告客户以往针对某一关键字给出的页首出价的高位区间值。各关键字的平均每次点击费用可能会有所不同。”可能看到你会觉得：”这不是給Adwords用的么？对SEO有什么帮助呢？”简单，如果人们愿意大量竞价这个关键字，那么可以认定这个词有着极高的商业价值。那么这个词很可能是值得SEO去做排名的。如果你需要按 “页首出价高位区间” 进行排序，只需单击单列标题即可。确保它的是从高到低进行排列的。这样，就可以然最有商业价值的关键词显示在上方。这么去操作，十之八九可以获得一些商业价值高的词汇。专家建议你想把这些建议词汇作为你的关键词吗？记住在做之前检查一下这里的商业广告。你可以通过搜索这个词，并且参看页面顶部广告来做到这一点。这些广告主和你一样，在销售同样的产品或服务吗？如果是的话，这可能是一个很不错的关键词选择。这里是额外的一个小知识：如果你把 “页首出价高价位区间” 按照从低到高进行排列的话，你可能会获取到一些可以用于写博客文章的主题。6. 查看精确到城市的关键词搜索量大多数关键词研究工具都无法能告诉你在特定州、城市和其他局部地区有多少人在搜索一个关键词。他们只能展示整个国家的大致搜索量。但是，对于本地需要做SEO的企业来说，这个数据没有太多用处。假设你是一个修理管道的工人，使用我再 方法#1中提到的方法查看 “plumber” （水管工）这个词的搜索量。大概在未来的30天内，预计这个词大约有286k的搜索量。但是作为修理管道的人来说，不可能面向的是全国的客户。谷歌关键词规划师中有一个很酷的地方，就是，你可以看到更多的本地化区域的预估展现量。甚至可以针对特定的某个城市。只需在顶部的过滤器中输入一个地点即可。我们使用洛杉矶（城市）试试吧。选择 城现在我们看到 “plumber” （水管工）每月只有12K的曝光量。相当便利，对吧？当然，这并不仅仅对当地的企业有用。你也可以使用它来了解一个关键词比较热门地点在哪里。你只需要把你指定的关键词加入到你的计划当中，这里我们用 “hendersons relish”（亨德森调味品）来试试。现在点击进入 “Plan Overview” (计划总览)，在 “位置过滤器” 中选择 “All locations” （所有位置），并向下滚动到 “Locations” （位置）板块。你会看到一个按照不同国家不同搜索量排序的一张表。小提示.使用之前记得先把过滤器中城市的选项先去掉。你可以看到，对于“hendersons relish” （亨德森调味品），94.5%的搜索来自英国（注释①）。不足为奇，因为它是英国的调味品。当让，你可以更深入的进行研究。虽然知道大多数搜索来自英国，我们可以将英国 设置成为在过滤器中。这时，位置板块将显示更多的局部区域的搜索量情况。93.1%的搜索都在英格兰。让我们使用下拉并把它进一步缩小到州。17.1 %在南约克郡，8.7 %在大伦敦（注释②）。说明在大伦敦这个产品搜索的人还是比较多的。让我们再来看看城市。8%在谢菲尔德。这并不奇怪，因为”hendersons relish”（亨德森调味品）是在谢菲尔德制造的。（注释① England是英格兰,只是英国的一部分.威尔士、苏格兰、英格兰合称 Great Britain 就是常说的大不列颠Great Britain再加上北爱就是 United Kingdom 即大不列颠即北爱尔兰联合王国－英国注释②大伦敦（Greater London）位于英国英格兰东南部，是英格兰下属的一级行政区划之一，范围大致包含英国首都伦敦与其周围的卫星城镇所组成的都会区。行政上，该区域是在1965年时设置，其下包含了伦敦市（City of London）与32个伦敦自治市（London Boroughs），共33个次级行政区。）专家建议你可以使用这个特殊功能，来帮助你确定你的客户目标。例如，这个词 “luxury car rental”（豪华车租赁）3.9%的搜索来自洛杉矶市。如果你经营一家豪华汽车租赁公司，你可以提供符合洛杉矶人的内容……即使这个内容可能不完全与汽车相关。这将是一个很好的方法来了解并吸引潜在客户。比如下面这家 Rentalcars.com 公司这样：小提示：没有給 Rentalcars.com 打广告的意思，这只是个例子。推荐阅读：本地SEO：一个简单（但完整）SEO指南7. 查看关键词搜索设备（需要优化PC端还是手机端？）人们使用多种类型的设备进行网站的浏览。比如：智能手机、笔记本电脑和平板电脑。每一个设备都有非常不同的屏幕大小，这意味着你可能很难完美地展现你的网站。为了阐明概念，我提供了两个不同设备展示的效果图。下面是移动端的展示效果：虽然手机上的文本是完全可读的，但是屏幕截图中的一些数字却很难阅读。这并不能达到最好的用户体验。但事情是这样的：我知道大多数阅读这篇文章的人，使用的是PC端设备。为什么？因为我用谷歌关键词规划师查看过对应的数据。要做到这一点，添加一个关键词到关键词规划师的计划中，并点击进入“Plan Overview” （计划概述）。看看设备板块，它会告诉你每个设备上分别占有多少搜索量。你可以看到，对于关键字 “free keyword researh tools”（免费关键词研究工具）这个词，92%的展现是来自于PC端设备的。因此，优先考虑桌面用户体验是才是正确的。对于一些关键词，恰恰相反。以 “best restaurants near me” （我附近最好的餐馆）为例：91.4%的搜索展现来自于移动设备。这还是有一定道理的。用户最有可能在户外，寻找餐馆时，使用移动设备进行搜索。最后的总结谷歌关键词规划师显然是一个非常强大的工具。我建议把在你做关键词研究的时候充分利用好这个工具。它有很多数据，是其他关键词工具无法媲美的。但同时，它也有诸多限制，没有精准的搜索量数据就是其中一点。幸运的是，这可以用其他关键词研究工具来解决，例如Ahrefs的Ahrefs Keywords explorer（关键字资源管理器）。这个工具可以将Google关键词规划师的数据，以及与点击流数据结合起来，生成准确的搜索量报告。当然，还有可以生成更多有价值的报告。Ahrefs的关键字工具数据点击这里，你可以尝试使用 7天的 Ahrefs Keywords explorer工具。或者点击这里，获取更多关键词研究指导。译者，Park Cheng，魔贝课凡联合创始人 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。",
  "headers": [
    {
      "level": "H1",
      "text": "如何使用谷歌关键词规划师2019最新"
    },
    {
      "level": "H2",
      "text": "如何免费获得Google Keywords Planner的使用权？"
    },
    {
      "level": "H2",
      "text": "如何使用谷歌关键词规划师工具？"
    },
    {
      "level": "H3",
      "text": "“查找关键词” 功能"
    },
    {
      "level": "H3",
      "text": "“获取搜索量和预测数据” 功能"
    },
    {
      "level": "H2",
      "text": "7个谷歌关键词规划师使用特殊技巧（一般SEO人员都不知道）"
    },
    {
      "level": "H3",
      "text": "1. 解锁并获取精准搜索量"
    },
    {
      "level": "H4",
      "text": "方法 #1 查看关键词最大CPC时的展现"
    },
    {
      "level": "H4",
      "text": "方法 #2 安装使用 Keywords Everywhere工具"
    },
    {
      "level": "H3",
      "text": "2. 获得超过3个种子关键词衍生的做法"
    },
    {
      "level": "H3",
      "text": "3. 从竞争对手网站 “偷取” 关键词"
    },
    {
      "level": "H3",
      "text": "4. 找到用户经常问的问题类关键词"
    },
    {
      "level": "H3",
      "text": "5. 通过 Suggested bid 功能 寻找商业价值高的关键词"
    },
    {
      "level": "H3",
      "text": "6. 查看精确到城市的关键词搜索量"
    },
    {
      "level": "H3",
      "text": "7. 查看关键词搜索设备（需要优化PC端还是手机端？）"
    },
    {
      "level": "H2",
      "text": "最后的总结"
    }
  ],
  "author": "Joshua Hardwick"
}