{
  "url": "https://ahrefs.com/blog/zh/google-ranking-dropped-dramatically/",
  "slug": "google-ranking-dropped-dramatically",
  "title": "Google 排名大幅下降？这些是你需要检查的",
  "description": "当您的谷歌排名大幅下降时，您可能会感到恐慌。但在在此之前，请先检查本文中的这些事项。",
  "content": "Chris Haines Chris 是一名 SEO 总监，在 SEO 代理方面拥有 10 年的经验。 不参与 SEO 时，他喜欢摆弄老式合成器、在沙滩上散步和喝杯好茶。 内容 如果您的网站在谷歌的排名突然下降，这可能会令人担忧。但在进行任何更改之前，首先要检查某些事项。内容1. 检查谷歌算法更新谷歌算法更新是网站排名受到负面影响的最常见方式之一。谷歌不喜欢低质量或误导性的结果出现在其自然搜索结果的顶部，因此它会定期进行算法更新，以保持其索引页面的质量。更新会在 Google 的状态页面上公布。因此，你应该检查是否有任何日期与您的网站排名下降相吻合。将这些日期与自然流量数据进行比对需要时间，因此使用 Ahrefs 等工具是更快了解影响的方法。要做到这一点，请前往 Ahrefs Site Explorer（网站分析），输入您的域名，然后在 Overview 2.0（概览 2.0）的自然流量图表底部的找到 Ⓖ 图标。突出显示的 Ⓖ 符号表示在这些点上都有谷歌更新。将鼠标悬停在Ⓖ 符号上，可以获得有关更新的更多详细信息。2. 在 Ahrefs Site Explorer（网站分析）中查看自然流量一旦确定谷歌进行了更新，您就需要根据自然流量总量检查更新日期，看看是否同时出现了流量下降。您可以在 Site Explorer（网站分析） 中查看自然流量：输入你的域名，并向下滚动到 Overview 2.0（概述 2.0）图表。取消选中 “Avg. organic traffic（平均自然流量 ）” 以外的所有选项。将时间线设置为“全部” 和“每周”。这有助于您查看自然流量的完整时间轴，从而更好地了解流量下降的幅度。我已经标注出了了该网站最近的流量下降情况。让我们来看看为什么会出现这种情况。让我们放大并将时间轴更改为“1Y”，将光标悬停在流量下降的时间点上。2023 年 3 月的核心更新与此大致吻合。这可能是流量损失的原因之一，但我们也可以看到，有自然量下降的确切日期与此次更新的发布日期并不一致。因此，我们不能说是算法更新导致了流量下降。在这种情况下，最好还是继续调查。如果您网站的自然流量下降与更新完全一致，那么谷歌更新很可能对您产生了影响。3. 检查流量最大的关键词一旦确定自然流量大幅下降，您就会想知道网站的哪些关键词失去了排名。为此，请前往 Site Explorer（网站分析）中的 Organic keywords（自然关键词）报告。我喜欢逐年（YoY）比较关键字，因此让我们添加一个逐年“比较”的过滤器。我们可以看到，在“Change（变化）”一栏中，该网站的首要关键词 “yamaha motorcycles”出现了大幅下降。让我们访问 Ahrefs Keywords Explorer（关键词分析），点击关键词 “yamaha motorcycles”。向下滚动到 SERP 概览，我们可以看到如果进行同比（YoY）比较，会发生什么情况。Google 已将 /motorcycle 页面排名切换为了首页。因此，/motorcycle 页面可能存在问题。作为参考，在 Site Explorer（网站分析）中，我们可以看到确切的页面下架日期是 3 月 14 日。让我们移除比较，将此日期放入 Keywords Explorer（关键词分析）的 SERP overview（SERP 概览）中。通过 SERP 概述，我们可以看到该页面在该日期中是一个 404 页面。如果将日期改为 2023 年 3 月 16 日，我们可以看到该页面已经从 SERP 中消失了。由于日期吻合，这很可能是该网站流量大幅下降的原因。结合使用 Site Explorer（网站分析） 和 Keywords Explorer（关键词分析） 是诊断排名下降原因的好方法。4. 检查网站近期技术上的变化技术问题会影响您的 Google 排名。您需要进行网站抓取来确定这些问题。在我看来，识别网站技术问题的最简单方法是使用 Ahrefs Site Audit（网站诊断）进行抓取。要设置一个项目，请前往 Site Audit（网站诊断），点击 “+ New project”，然后按提示操作。完成抓取后，你会看到一个类似下面截图的“概览“ 部分。该页面可以让你了解网站大部分的技术问题，并监控网站的健康评分。点击特定问题后，点击 “Why and how to fix（为什么以及如何解决）”。然后会出现一个侧边栏，解释问题和如何解决——这些信息对于帮助您解决技术问题至关重要。如果网站抓取显示您有很多技术问题，那么你值得花时间逐一解决，直到您的整体健康得分提高。一旦做到这一点，您就能消除任何技术问题影响网站谷歌排名的可能性。Tip 技术问题随时可能发生，但通常发生在网站迁移期间。在迁移前后分别进行 Site Audit（网站诊断），可以比较并查看迁移前后技术问题是否增加。现在我们知道了如何设置和进行 Site Audit（网站诊断），让我们来看看一些经常导致排名和自然流量损失的具体技术问题。4XX 页面4XX 页面是错误页面。你可能对经典的 “404 page not found“最为熟悉。出现这类页面时，可能会导致流量损失。如果我们在 Keywords Explorer（关键词分析）中返回到之前的网站（/motorcycle 页面）示例，并向下滚动到 SERP 概览，我们可以看到这是一个 404 页面。但是，这个网站上还有其他 404 页面吗？让我们回到 Organic keywords（自然关键字）报告，点击其他热门关键字，如 “r7” 和 “yamaha r1”。如果我们点击关键词 “r7” 进入Keywords Explorer（关键词分析），滚动到 SERP 概览，并将日期设置为 2023 年 3 月 14 日，我们可以看到该关键词也有一个 404 状态代码。使用 “yamaha r1” 关键词重复该过程，我们可以看到该页面在 2023 年 3 月 14 日也是一个 404 页面。似乎可以得出这样的结论：该网站流量最大的网页是一个打不开的网页。虽然我们使用 Keywords Explorer（关键词分析） 和 Site Explorer（网站分析） 快速找到了这些信息，但使用 Site Audit（网站诊断）也能找到同样的信息。下面就是抓取完成后的结果，您可以在报告中识别 404 或 4XX 页面。Canonicals（规范化）缺乏规范标签或规范标签实施不当是另一个可能给网站带来问题的技术问题。要识别它们，可以使用 Ahrefs 的 SEO Toolbar（SEO工具栏）栏逐页抽查，也可以通过 Site Audit（网站诊断）抓取来全面查看。我在下文中标出了概览报告给出的规范化相关的问题类型。如需了解更多技巧，请查看我们的 “规范标签“ 新手指南。跳转（重定向）忘记添加重定向或重定向实施不当，是导致排名和自然流量下降的最常见原因之一。重定向有几个简单的要点需要记住：使用 301 重定向将一个网页重定向到另一个网页尽量避免重定向链和重定向循环检测这些重定向问题的最佳方法是使用 Ahrefs Site Audit（网站诊断）。只需对您的网站进行分析，然后查看重定向报告，即可了解问题所在。查看我们的SEO优化重定向指南，了解更多信息。Robots.txt更改网站的 robots.txt 文件也会影响 Google 抓取网站的方式。有时，您或其他利益相关者可能会不小心屏蔽一些重要页面。如果使用 Ahrefs 的 Site Audit（网站诊断）对网站进行定期抓取，就可以跟踪 robots.txt 文件的更改。每次抓取时，Page Explorer（网页分析） 都会存储 robots.txt 文件的详细信息，便于了解是否对该文件进行了可能对网站产生负面影响的更改。如果您在迁移网站时发现排名下降，不妨查看一下您的 robots.txt 文件，看看是否阻止了搜索引擎抓取，或屏蔽了网站重要的页面。查看我们的 robots.txt 入门指南，了解更多信息。5. 查看竞争对手的排名如果您确信自己网站的 SEO 技术没有问题，那么不妨检查一下竞争对手是否在某些关键词上超过了您的网站。这听起来可能很明显，但这是网站失去排名的另一个常见原因。不幸的是，有时你的竞争对手比你更擅长搜索引擎优化。监控竞争对手排名的最快方法是在 Site Explorer（网站分析） 中插入其域名，然后进入 Organic keywords（自然关键词）报告。在本例中，我输入了 Backlinko 的域名。在这里，你以看到竞争对手网站的排名以及每周、每月或任何其他自定义日期的表现比较。对照他们的关键词来检查你在跟踪的关键词另一种查看竞争对手近期活动的方法是使用 Ahrefs Rank Tracker（排名监控）。该工具的最大优点是可以并排比较竞争对手和自己网站的排名。下面是我查看三个不同竞争对手关键词排名的示例。一旦你确定了竞争对手在特定关键词上的表现比您好，你可能想进一步了解他们的总体策略。你可以查看我们的关键词竞争对手分析指南，了解更多相关信息。6. 检查你的链接由于链接是 Google 已确认的排名要素（是的，它们仍然很重要），以下是你应该检查的内容：检查失效链接跟踪所有指向您网站的失效的链接是一项耗时的任务。许多网站很少检查指向它们的失效链接。使用 Site Explorer（网站分析），我们可以通过插入一个域并转到 Broken backlinks（失效外链）报告来查看任何已失效的链接。下面是我们之前看到的网站失效外链示例。在这里，我们可以修复 3442 组 follow 链接。如果您的网站还存在其他问题，那么查看这份报告将是一个很好的开始。报告显示，该网站失去了三个来自知名网站的高 Domain Rating (域名评分、DR) 的链接。进行外链诊断（如有必要，应取消链接）检查完失效的链接后，如果您认为网站链接的整体质量存在问题，最好对网站进行外链诊断。在某些情况下，您可能会看到指向您网站的非自然链接，这可能会影响您的排名。以下是 Google 可能将其归类为”不良链接“的一些示例：付费链接私人博客网络（PBN）链接低质量目录垃圾评论和论坛被黑客攻击的网站如果您认为有一些链接对您的网站产生了负面影响，您可以考虑使用 Google Search Console 的取消链接工具。但切记要谨慎使用这个 “撤销” 工具：我们说过很多次，撤销工具需要谨慎使用。如果你不知道自己在做什么，你有可能会带来反作用。Gary Illyes, Webmaster Trends Analyst Google7. 检查你的内容如果您的网站有大量低质量内容，并且在以内容为重点的 Google 更新中失去了排名，那么您就需要对其进行改进。但究竟如何才能改进内容呢？第一步是对网站内容进行诊断。以下是我们在 Ahrefs 进行内容诊断的流程直观示意图。Google 同样也提供了一些自我评估问题，你可以利用这些问题进一步诊断和改进您的内容：内容是否提供了原创信息、报道、研究或分析？内容是否对主题进行了实质性的、完整的或全面的描述？内容是否提供了具有洞察力的分析或有趣的信息？如果内容借鉴了其他资料来源，是否避免了简单的复制或改写，而是提供了实质性的附加价值和原创性？主标题或页面标题是否对内容进行了描述性的、有用的概括？主标题或页面标题是否避免了夸大或令人震惊的性质？这是你想收藏、与朋友分享或推荐的页面吗？你是否希望在印刷杂志、百科全书或书籍中看到或参考这些内容？与搜索结果中的其他页面相比，该内容是否具有实质性价值？虽然不能保证改进内容会立即影响排名，但你最好还是确保你的内容对访客来说是最友好的。延伸阅读如何为搜索创建优秀内容如何撰写排名靠前（人们愿意阅读）的网站内容内容创作： 初学者完整指南8. 检查 SERPGoogle 的 SERP 是在不断变化的。这是另一个会影响网站排名和自然流量的因素——您几乎无法控制。为了解释这一概念，让我们通过在 Keywords Explorer（关键词分析）中输入关键词 “corona”，看看 SERP 意向发生巨大转变的示例。我们将日期设定为 2020 年 3 月 31 日，并与病毒大流行前 2020 年 1 月 3 日的 SERP 进行比较。在这个例子中，我们可以看到左侧与 “Corona” 啤酒相关的网站在几个月内被报道 COVID-19 和 “热门新闻”的网站所取代。如果我们把日期设置得更近一些，就会发现 “Corona” 啤酒重新夺回了第一的宝座。为什么呢？因为搜索意图发生了变化。如果您认为 SERP 意向的转变可能对您的网站产生了影响，那么不妨使用 Keywords Explorer（关键词分析）中的 “SERP overview（SERP 概览）”工具来查看历史 SERP 的变化情况。9. 检查 Google Search Console 是否有人工处置措施如果您的网站失去了所有的自然搜索流量，您应该查看 Google Search Console 的 “人工处置措施” 报告。为此，请单击左侧的选项卡中的：如果没有问题，您将在 Google Search Console 中看到“No issues detected（未检测到任何问题）”通知，如下所示：如果有问题，就会出现类似下方的情况。例如“Pure spam（纯垃圾）”的人工处置措施。如果您的网站被人工处置，谷歌的人工审核员就会认为您严重违反了搜索质量指南。谷歌一般会将您的网站及其页面从搜索索引中删除。下面列出了你可能会收到的不同类型的人工处置措施：网站被第三方垃圾信息滥用用户生成的垃圾信息充斥垃圾信息的免费主机结构化数据问题指向您网站的非自然链接来自您网站的非自然链接内容单薄，几乎没有附加价值伪装和/或隐蔽的重定向纯粹的垃圾信息伪装图片隐藏文本和/或关键词堆砌AMP 内容不匹配隐蔽的移动重定向违反新闻和发现政策有关如何解决此类问题，请点击此处查看 Google 提供的指导。收到人工处置措施通常很少见，但也不是没有。要想保持在谷歌的正确一方，请记得参加我们的搜索引擎优化培训课程，并遵守谷歌搜索要点。最后找出网站排名大幅下降的原因绝非易事。这需要进行调查、分析并找到可以作为决策依据的数据。Ahrefs 等工具能帮上忙，因为它们能让你看到数据背后的信息。有问题么？Twitter 上找我吧 🙂。译者，Park Cheng，歪猫出海创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Chris Haines Chris 是一名 SEO 总监，在 SEO 代理方面拥有 10 年的经验。 不参与 SEO 时，他喜欢摆弄老式合成器、在沙滩上散步和喝杯好茶。",
  "headers": [
    {
      "level": "H1",
      "text": "Google 排名大幅下降？这些是你需要检查的"
    },
    {
      "level": "H2",
      "text": "1. 检查谷歌算法更新"
    },
    {
      "level": "H2",
      "text": "2. 在 Ahrefs Site Explorer（网站分析）中查看自然流量"
    },
    {
      "level": "H2",
      "text": "3. 检查流量最大的关键词"
    },
    {
      "level": "H2",
      "text": "4. 检查网站近期技术上的变化"
    },
    {
      "level": "H3",
      "text": "4XX 页面"
    },
    {
      "level": "H3",
      "text": "Canonicals（规范化）"
    },
    {
      "level": "H3",
      "text": "跳转（重定向）"
    },
    {
      "level": "H3",
      "text": "Robots.txt"
    },
    {
      "level": "H2",
      "text": "5. 查看竞争对手的排名"
    },
    {
      "level": "H3",
      "text": "对照他们的关键词来检查你在跟踪的关键词"
    },
    {
      "level": "H2",
      "text": "6. 检查你的链接"
    },
    {
      "level": "H3",
      "text": "检查失效链接"
    },
    {
      "level": "H3",
      "text": "进行外链诊断（如有必要，应取消链接）"
    },
    {
      "level": "H2",
      "text": "7. 检查你的内容"
    },
    {
      "level": "H2",
      "text": "8. 检查 SERP"
    },
    {
      "level": "H2",
      "text": "9. 检查 Google Search Console 是否有人工处置措施"
    },
    {
      "level": "H2",
      "text": "最后"
    }
  ],
  "author": "Chris Haines"
}