{
  "url": "https://ahrefs.com/blog/zh/google-discover/",
  "slug": "google-discover",
  "title": "Google 发现：如何提高排名并获得流量",
  "description": "Google 发现是自动生成且高度个性化的移动端信息流，它根据你的在线活动展示信息和新闻资讯。",
  "content": "Michal Pecánek Ahrefs的营销专家和内容创作者。 沉迷于SEO，航空，香氛，寿司和墨西哥玉米卷。 内容 Google 发现（Google Discover）是一个根据你的线上活动自动生成并且高度个性化的移动端信息流。它展示了你可能更兴趣的信息和新闻话题，像搜索引擎优化或者是高尔夫。比起搜索引擎，它更像是个社交网络，但是你的搜索活动和搜索历史对于提供相关且即时的信息流是至关重要的。数以百万计的用户每天在他们的移动设备上看到个性化的 Google 搜索信息流，而它自 2018 年推出以来，已经成为许多网站的稳定流量来源。对于新闻和媒体出版物来说更是如此，Google 搜索为这类网站输送了大量自然流量。即使是我们这样不起眼的小型 SEO 博客过去 6 个月内也从中 Google 发现获得了差不多 15 万次点击：不过，Google 发现依然是一片未知领域。同时，因为这个话题需要专业协作，我们询问了一些专家的意见。Kevin Indig — G2 的 SEO 和内容副总裁Suganthan Mohanadasan — Snippet Digital 的联合创始人及 SEO 部门主管Dan Taylor — SALT.agency 的 SEO 研发主管John Shehata — Condé Nast 的客户发展策略副总裁及 NewzDash 创始人但是首先……Google 如何生成你的信息流为了成为一名优秀的 SEO 从业人员，你需要知道搜索引擎的工作原理。按照 Google 的说法，他们使用以下信息来生成信息流：你使用所有 Google 产品的活动（如：你执行过的搜索、观看过的 YouTube 视频以及与 Google 发现结果的互动）位置历史信息位置设置你关注的话题你现在看到它和社交网络的相似之处了吗？这个信息流反映了你的爱好、当前的兴趣以及世界上所有与你相关的东西。它非常的个性化以致会将你的专业程度和信息对你的重要程度考虑在内。例如，我的信息流总有一半的内容是关于 SEO 的，因为我与这个话题的交互最多。如你所见，你甚至可以“关注” SEO 这个话题：有趣的是，你可以查看 Google 是如何对你信息流中的结果进行分类的。Suganthan 向我推荐了 Valentin Pletzer 发现的方法。他发现用户可以点击 提交反馈 > 系统记录 > 卡片类别 来访问这些信息。以下是 Valentin 发现的卡片类目，以及他认为这些类目代表的东西。以上所有数据和洞见都归功于 Valentin Pletzer。例如，我们可以看见 Google 新闻上的呈现确实有助于 Google 发现的表现，因为 Google 新闻有自己的 “NEWS_HEADLINES” 类别。如果这些内容与你相关，可以查看 John 关于 Google 新闻优化的指引。一般来说，如果有人需要你的内容，并且向 Google 发送了正确的信号，你可以从已经对这些内容感兴趣的人群那里获得发现点击。与社交媒体相比，这是一个巨大的优势，因为大多数社媒帖文只能触及“冷漠的”受众。如何从 Google 发现获得流量首先，除非你已经在 SEO 领域做得很好了，否则没有必须花费太多时间去追求发现点击。大多数人可能更适合优先获得标准的自然搜索流量。新闻网站是例外，但是如果你已经在为他们工作，你就已经知道这一点了。为 Google 发现进行优化的不确定性超越其他任何 SEO 话题。唯一可用的数据在你的 Google 站长工具后台。你无法分析竞争对手，因此调研的范围是很有限的。要预测某一则特定内容在 Google 发现中的表现是困难的。从我们自己在 SaaS B2B 行业的经验来说，你可以在内容发布 3 到 5 天内看到流量峰值：然而，一些常青内容能够对流量产生持续的推动力。而有时会出现两种模式的组合：然而，尽管你做对了所有事情，有些内容还是没有办法进入信息流。和 SEO 的所有事情一些，你没有办法保证做了 X 就一定能获得 Y；你所做的只是在提高获得理想结果的机会。幸运的是，有一些官方的建议可以增加你的内容进入 Google 发现的可能性，在接下来的章节中，我们将带着独特的见解来一起讨论这些建议。但是首先，你要知道索引的内容需要符合内容政策才有资格出现在 Google 发现中。只有到了这时你才应该专注于以下方面来增加内容被推荐的机率：有一个对移动端友好的网站使用独特的高质量的图片将内容与元数据对应发布与热门话题相关的内容多在 E‑A-T 上下功夫专注于实体成为一个知识图谱实体通过内容分发来制造轰动效应 定期更新你的内容在文章中嵌入 YouTube 视频尝试网络故事 1. 有一个对移动端友好的网站Google 发现是移动端仅有的信息流，因此你站点的移动端体验至关重要。至少，你需要一个加载迅速的响应式网站，只带有有限的（或者没有）广告、弹窗或者插页广告。另外，你需要为 2021 年 5 月做好准备，那时核心网页指标（Core Web Vitals）将会成为排名算法的一部分，因为累计布局偏移（Cumulative Layout Shift）不是一个网页速度指标。如果你想要更进一步，那么就考虑使用 AMP 吧。根据 John 的估计，所有 Google 发现文章中有 60% 都使用 AMP。当然，这个数字被新闻网站严重扭曲了，而关于实现 AMP 的 SEO 观点也多种多样。但是 Google 发现的趋势很清晰： 2. 使用独特的高质量的图片Google 发现又是一处图片可以获得大部分注意力的信息流，因此你应该对页面的所有视觉内容使用高质量图片。Google 建议大型图片的宽度至少应为 1200px，且启用了 robots 元标签的 max-image-preview:large 或者使用了 AMP。这些都是图片 SEO 的最优实践，因此无论是否为了 Google 发现，默认设置都应如此。你还可以使用模式图片属性来向 Google 提供更多数据。 3. 将内容与元数据对应标题标签和元描述标签应该总结页面内容并鼓励用户点击。只需要确保不使用点击诱饵或者其他操纵策略，因为 Google 在发现指南中明确警告了这些行为。我们意外地发现了一件有趣的事情，Google 发现将开放图谱元标签纳入了考量。我们在 og:title 标签中有一处拼写错误，尽管标题标签是正确的，它还是进入到了 Google 发现的信息流中。开头少了一个“L”： 4. 发布与热门话题相关的内容Google 发现倾向于展示关于当前活动的大量即时内容，这也是为什么新闻网站可以主导该信息流。但是它同样也会展示大量常青内容。我们的博客就展示了这一点。我们不会为热门话题撰写内容，但是每个月依然可以从 Google 发现获得数以千计的点击。出现这种情况是因为作为个性化的信息流，Google 发现展示的是对你来说较新的内容，而不是对你来说较新的内容。例如，假设你将要开始投资股票市场，做了许多市场调研。你可能会在 Google 发现信息流中看到关于若干月前发布的投资技巧、股票经纪人比较以及其他与投资初学者相关的文章。你应该如何标的常青话题呢？应该从关键词调研开始。只需要在像关键词分析这样的关键词调研工具中键入几个广泛的话题关键词，然后寻找热门话题即可。小提示. 如果你想要找到较新或者热门的话题，只需要使用像 Google 趋势（Google Trends）或者爆炸话题（Exploding Topics）这样的工具。仅仅知道围绕热门话题撰写内容是远远不够的。Google 提到如果你想在发现信息流中亮相，就需要专注优质的文案，并提供独特的见解。 5. 多在 E‑A-T 上下功夫Google 提到他们愿意从可以展示专业度、权威度和可信度（E‑A-T）的网站抓取内容。评估和支持 E‑A-T 的办法有许多种。Google 发现指南指出你应该进行如下操作： 提供清晰的关于作者、出版物、出版商、公司及其背后的网络的日期、署名和相关信息和联系方式以与访客建立更好的信任及透明度。除此之外，还值得使用结构化数据将这些点联结起来。Suganthan 还建议查看 Google 的各兴趣相似类别，并找出你可以成为权威的话题所在。因为这些受众似乎与“核心”的兴趣卡片类目相连，像之前记录所展示的那样。最简单的找出这些类目的方法是在 Google Analytics（分析）中查看兴趣相似类别。Google Analytics（分析）> 受众群体 > 兴趣 > 兴趣相似类别通常来说，你应该竭尽所能将品位定位为其所处领域的意见领袖。 6. 专注于实体当我分析 Ahrefs 博客在 Google 发现中的表现时，我成功地定位出了表现较好的话题。在 SEO 世界，实体和他们之间的联结形成了特定的话题。从我们的写作者那里了解到，很明显，实体在这里扮演着重要的角色，因为每个人都以这样或那样的方式提到了它们。这里的一个知识图谱层描绘了用户的兴趣和专业知识是如何随着时间而进化的。这被称为主题层，它通过分析所有与某一特定话题及其子话题相连的内容而创建，最终将所有零散的点联结在一起。其中的一些点似乎无需是一个知识图谱实体也能成为 Google 发现的兴趣。假如，在知识图谱应用程序接口（Knowledge Graph API）中搜索 “meta description”（“元描述”）没有返回结果，但是在 Google 发展中却显示为你可以关注的一个兴趣：你无法深挖信息层，因此我们应该关注较高层级的实体。这就足够了。你的目标应该是在与你业务相连的实体范围内获得权威度。在创建内容时你有若干种办法来达成这一目标。在你所属的类别保持一致性大多数网站都有某个特定话题。它可以是咖啡、膝上电脑、SEO 或者其他任何话题。不管对你来说是什么，在创建内容时都不要偏离太远。如果一天你发布了与 iPhone 相关的内容，第二天又开始讨论烹饪诀窍，就无法向你的受众及 Google 发送积极的信号。这样做会稀释你在所有类别中的“权威度”。这个规则的唯一例外是你供职于一家涵盖所有内容的大型媒体机构。找到对你品牌有效的实体我尝试通过手动筛选 Google 发现报告来找到最有效的话题。然后，这种方法只包含了主要的实体，你没有办法将其规模化。如果你已经在 Google 发现中拥有许多页面的内容，你可能已经有了开发者资源。如果情况是这样的话，你可以像 John 那样：在 Google 自然语言工具（Natural Language Tool）中运行你的文章，然后根据他们的显著性组合实体，并分析哪些带给了你最多的发现流量。这是实体分析的一个示例：你可以自己测试 NLP 的 API。只需要滚动到演示输入窗口的底部，粘贴进自己部分内容即可。使用 Google 图片搜索找到相关的实体及信息Dan 想出了一个简单易用的方法来发现 Google 眼中与某一话题相关的其他话题。去到 Google 图片搜索，查询你的主要关键词，接着查看页面顶部的实体标签：另外，你也可以使用像 Entity Explorer 这样的工具，它似乎使用了同样的方法来获得数据。以此为灵感，找到加入你当前或者未来内容的东西。在将相关实体和信息整合进他的内容之后，Dan 感受到了 Google 发现表现的提高，同时他的内容也之于更多的关键词有了排名。 7. 成为一个知识图谱实体只有当你的品牌存在于知识图谱中时，人们才能关注它。你可以通过在 Google 中搜索你的品牌来确认是否是这种情况。如果搜索结果中存在信息面板，那么他就存在于知识图谱：然而，有趣的是，即使有人关注了你的品牌，你的内容可能依然不会显示在他们的 Google 发现信息流中。Kevin 和我都进行了测试。我在 Google 发现中关注 MailChimp 已经有几个月时间了，可是我还没有在信息流中看到任何他们的内容。那么成为知识图谱实体可以如何帮助改善在 Google 发现中的可见度呢？被知识图谱收录标志着你的网络存在感已经足够强大，以致 Google 可以将你的品牌放置于正确的上下文中。换句话说，Google 已经了解哪些实体与兴趣与你的品牌有关，于是可以将你的内容展示给那些可能对他们感兴趣的人们。推荐阅读：Google 知识图谱解释：它如何影响 SEO 8. 通过内容分发来制造轰动效应Google 想要在发现板块展示高互动的内容有它的道理。我们可以证实获得较高发现点击数的文通常也具有较高的点击率。更令人惊讶的是，我们发现了社媒参与度和发现信息流表现之间似乎存在着较高的关联。John 甚至估算了数字。他发现在美国，发现表现和 Twitter 参与度的相关系数高达 0.91。这是非常显著的相关度，但是一如既往，这并不等于因果关系。创作内容来引起轰动效应对你是有好处的，即使 Google 无视它。John 还补充到这个“轰动因素”与发现表现的关系可能因国家而异。尽管 Twitter 在美国扮演着重要角色，但在其他国家它可能被其他平台掩盖。这意味着你应该将内容分发到当地的热门平台中。在 Ahrefs，我们可以看到它在获得 Google 发现点击方面的重要作用。我们将博客内容翻译成发其他五种语言。这些文章与我们表现优秀的英文版内容基本是一模一样的，但是只有西班牙语的版本获得了一些 Google 发现的点击流量。唯一的区别是什么呢？我们还没有专注适合其他语言的内容分发渠道。同样，这些都无法证明因果关系。但是 Suganthan 还提出了一项与社交参与度信号相关的实验。JR Oakes 故意在 Twitter 发布了一篇垃圾文章，要求人们与之互动，最终这篇文章进入了 Google 发现信息流：Holy crap BAM! Thanks for all the retweets. Findings: Crappy machine-generated content + a bunch of Twitter shares = Google Discover card. https://t.co/sXtoylnX9z pic.twitter.com/pudHXdwcNO — JR Oakes (@jroakes) July 2, 20199. 定期更新你的内容你的页面现在没有在 Google 发现中展示，并不意味着它永远不会。这是我们在 2017 年发布的一篇文章，它从未获得 Google 发现的点击流量，直到我们重写并将其重新发布：当然，我们更新文章并不是为了获得发现点击。我们是为了提高它的排名，并从“常规”搜索结果中获得更多的自然搜索流量。而来自 Google 发现的点击流量是一个不错的奖励。重新发布内容是我们最喜欢的增长策略之一。根据内容分析的数据，我们在过去 12 个月内更新了 60 个页面的内容。所有这些都不只是我们自己的经验，John 和 Suganthan 也证实了经常翻新常青内容对他们也是有益的。 10. 在文章中嵌入 YouTube 视频Google 发现信息流中经常能见到 YouTube 视频：如果你将这些视频嵌入到你的内容中，有可能这些视频会独立地展示在 Google 发现信息流中，表现甚至超过内容本身。同时，像 Kevin 指出的那样，你甚至都不需要使用结构化标记。我们有一些文章只获得了几百个点击流量，但是他们内嵌的视频却获得了几千个。我们在视频和文字版内容中都涵盖了一些话题，因此重新使用你的内容似乎是一个很好的策略，这样可以提高来自 Google 发现的点击流量。记住，点击视频并不会跳转到你的网站，而是转到 YouTube 视频。 11. 尝试网络故事过去被称作 AMP 故事，这些内容是 Instagram 和其他社交网络故事的 Google 版本。Google 最近宣布他们已经开始在发现信息流中支持网页故事。如果这类内容值得你花时间创作，不妨一试。在写作这篇文章之时，他在美国还只支持英语内容。Kevin 证实他们对网页故事进行了实验，并确实在 Google 发现信息流中被推荐了。结语无论从事何种行业，你都可以利用 Google 发现流量。除非你有一个新闻网站，否则它的优先级不会很高，但是无论如何，你每天的 SEO 工作可能都会用到这些优化方法。应用这些技巧不仅对 Google 发现有用。它只是一个副产品。这些实践可以带来更好的 SEO 表现、内容分发及流量多样化。Google 发现的伟大之处在于当主要关键词没有搜索需求的时候，它依然能够带去点击流量。总体上，话题应该还是要反映人们的兴趣，但那是另外一个发布主要目的并非为了获得自然搜索流量的内容的讨论了。有任何其他关于 Google 发现的见解或者问题吗？在 Twitter 上告诉我吧。译者，Alex Wang，Not Soup Yet 创始人 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Michal Pecánek Ahrefs的营销专家和内容创作者。 沉迷于SEO，航空，香氛，寿司和墨西哥玉米卷。",
  "headers": [
    {
      "level": "H1",
      "text": "Google 发现：如何提高排名并获得流量"
    },
    {
      "level": "H2",
      "text": "Google 如何生成你的信息流"
    },
    {
      "level": "H2",
      "text": "如何从 Google 发现获得流量"
    },
    {
      "level": "H3",
      "text": "1. 有一个对移动端友好的网站"
    },
    {
      "level": "H3",
      "text": "2. 使用独特的高质量的图片"
    },
    {
      "level": "H3",
      "text": "3. 将内容与元数据对应"
    },
    {
      "level": "H3",
      "text": "4. 发布与热门话题相关的内容"
    },
    {
      "level": "H3",
      "text": "5. 多在 E‑A-T 上下功夫"
    },
    {
      "level": "H3",
      "text": "6. 专注于实体"
    },
    {
      "level": "H4",
      "text": "在你所属的类别保持一致性"
    },
    {
      "level": "H4",
      "text": "找到对你品牌有效的实体"
    },
    {
      "level": "H4",
      "text": "使用 Google 图片搜索找到相关的实体及信息"
    },
    {
      "level": "H3",
      "text": "7. 成为一个知识图谱实体"
    },
    {
      "level": "H3",
      "text": "8. 通过内容分发来制造轰动效应"
    },
    {
      "level": "H3",
      "text": "9. 定期更新你的内容"
    },
    {
      "level": "H3",
      "text": "10. 在文章中嵌入 YouTube 视频"
    },
    {
      "level": "H3",
      "text": "11. 尝试网络故事"
    },
    {
      "level": "H2",
      "text": "结语"
    }
  ],
  "author": "Michal Pecánek"
}