{
  "url": "https://ahrefs.com/blog/zh/google-analytics-metrics/",
  "slug": "google-analytics-metrics",
  "title": "你唯一需要跟踪的3个谷歌分析指标",
  "description": "在谷歌分析中，指标是定量的测量，告诉你你网站的某些方面是如何运作的。",
  "content": "Kayle Larkin 数据驱动的 SEM 战略家。致力于让所有企业主都能轻松理解和掌握分析方法。 内容 谷歌分析收集了大量关于用户流量和网站行为的数据，范围从获取到转换。虽然你能得到的数据量是惊人的，但是你不需要追踪每一件事情。试图这样做只会让你掉进兔子洞，没有任何实际结果。随着时间的推移，只需要三个指标来跟踪增长。但是首先，让我们确保我们对于度量标准的理解是一致的。什么是谷歌分析的度量标准？量度是定量的测量，告诉你你网站的某些方面是如何运作的。例如，一个特定页面被浏览的次数或者某个视频被播放的次数。需要注意的是，度量标准与维度是不同的。维度就是你的度量标准所衡量的对象。这意味着你可以通过通道(维度)来度量用户(度量) ，而不仅仅是度量用户。你应该跟踪的三个谷歌分析指标在 Google Analytics (GA)中有超过100个不同的指标可用，但是只有三个指标可用于跟踪随时间推移的增长。1. 用户在最基本的层面上，你需要知道营销努力是否导致了网站的增长。用户会告诉你这一点。GA 中的 users (用户)指标告诉我们一个网站在一段时间内有多少独立访问者，并提供了一个高层次的观点，即营销努力是否导致了网站的增长。要按流量来源查看所有用户，请打开 Life Cycle (生命周期) > Acquisition (获取) > Traffic acquisition report (流量获取报告) 并设置所需的日期范围。报告将自动显示会话默认通道分组。Default channel grouping (默认渠道分组) 是由 GA 定义的营销渠道，用于新用户和返回用户到达你的网站或应用程序。例如，下面的截图显示我们在2021年第四季度从自然搜索获得了3666个用户:要找到流量的来源，我们可以通过点击 Session default channel grouping (默认通道分组) 旁边的蓝色“ plus”标志并选择 Session Acquisition > Session source 来添加一个二级维度。要查看百分比的变化，我们可以添加一个比较周期。在右上角，点击日期范围下拉箭头，并选择一个自定义的日期范围 Q4 > Compare (比较) > 前期(比赛日的周)来比较性能。你应该选择什么样的比较周期取决于各种因素，比如 GA 账户的历史，季节性是否在业务中发挥作用，或者该公司是否刚刚开始投资营销渠道。我们之所以选择这个例子的前一个时期，是因为该网站去年没有建立 GA，而且季节性并没有发挥主要作用。下面的截图显示，2021年第四季度用户总体下降了18.95% ，但与2021年第三季度相比，谷歌/自然搜索增加了24.75% 。2. 用户参与度现在我们知道了用户来自哪里，我们需要了解他们参与了哪些内容，以及哪些内容没有赢得他们的注意力。Average engagement time (平均参与时间)告诉我们网站在用户浏览器中聚焦的平均时间长度。(这意味着用户很可能在看它。)通过查看我们网站上不同页面的这个指标，我们可以了解哪些文章需要更多地撰写(那些具有最高参与时间的文章) ，哪些文章需要进一步分析(参与时间较短)。要按流量来源查看所有用户，请打开 Life Cycle (生命周期) > Engagement (参与) > Pages and screens report (页面和屏幕报告) 并设置所需的日期范围。现在我们需要将这些数据分割成我们正在分析的流量源。以谷歌为例。我们可以通过点击左上角的 Add comparison (添加比较项) 来添加一个维度，添加“ session/source medium” 维度，添加 “google/organic” 维度值，并通过将鼠标悬停在文本上点击“ x” 来删除 “All Users”可以使用下拉箭头更改数据在表中的显示方式。如果你希望看到页面标题，请选择“Page title (页面标题)”或者，如果你想知道的网址，选择Page path (页面路径) + query string and screen class (查询字符串和屏幕类)。最后，单击平均参与时间列，将表从最高到最低排序。在下面的例子中，谷歌自然搜索用户对修复 ga4缺失或无效 ID 错误感兴趣。创建更多关于修复 GA 错误的内容可能会有所帮助。现在你已经知道哪些话题最能引起读者的共鸣，把它们输入到 Ahrefs 的关键词分析中，就可以找到人们正在搜索的类似话题。3. 转化最重要的指标是转化率。转化率是用户的活动，有助于你的业务成功。GA4中的 Conversion (转化) 相当于我们所知道的通用分析 Universal Analytics (UA)中的 Goal (目标)。要查看 GA4中的转换报告，请打开 Life Cycle (生命周期) > Engagement (参与) > Conversions report (转化报告)。你将看到自动标记为转换的收集事件以及手动标记为转换的任何事件。上面的图片显示了2021年第四季度与2020年第四季度(每周对应的一天)的转换率。你可以通过单击蓝色文本，例如单击 purchase (购买）, 深入到特定的转换。现在我们可以看到购买来源的营销渠道。小提示. 跨通道数据驱动属性(DDA)于2021年11月1日推出. 仅从2021年11月1日开始提供。超越基本指标上面的三个指标对于跟踪你的网站随时间的增长是非常好的，但是除此之外它们并没有告诉你更多。如果你想知道更多关于谁访问了你的网站，他们是如何与网站互动的，以及你可以做些什么来提高性能，你需要在你试图达到的上下文中分析其他指标。让我们来看看其中的一些指标，以及它们是如何发挥作用的。1. 新访客及回访访客通过查看新用户和返回用户，你可以了解哪些渠道带来了最忙碌的用户，以及你的客户是否更有可能在他们的第一次访问或返回访问转换。新用户是指第一次访问你网站的用户。GA 通过查看某人是否拥有网站/应用程序的用户 ID 或设备 ID 来跟踪这个问题。如果他们不这样做，他们就会被算作新用户。分析 new users (新用户) 很重要，因为知道他们从哪里来可以帮助提高搜索引擎优化的努力和转化渠道。观察 returning users (返回的用户) 是很重要的，因为它可以帮助你更好地理解哪些产品或内容页面带回了你的客户。要查看新用户和返回用户，请在 GA4中打开 Life cycle (生命周期) > Retention report (保留报告)，并设置比较日期范围。该报告将自动显示新用户，你可以切换到查看返回的用户。在上面的例子中，我们可以看到 New Users (新用户) 比前一时期增加了181.7% 。为了得到一个更加健壮的报告，我们需要在 UA 打开 Audience (受众) > Behavior (行为) > New vs Returning 报告。UA 报告将根据用户类型显示获取、行为和转换指标: 新访问者和返回访问者。在上面的报告中，我们看到更多的转化来自于新的访问者，但是回头的访问者转化率更高。从这里，我们可以分割到 Organic Traffic (自然流量) 和添加第二个维度: landing page (着陆页面)。这将允许我们看到哪些自然登陆页面的新用户正在转换。我们可以在内容中找到将页面转换为 A/B 测试 CTA (对操作的调用)的模式。2. 事件事件提供了用户在站点上做什么的洞察力。这些信息可以用来更好地通知 a/b 测试。要查看用户事件指标，请在 GA4中打开 Life Cycle (生命周期) > Engagement (参与) > Events report (事件报告)。该报告将显示自动收集的事件和你添加的任何增强的度量事件。目前，GA4中提供的信息是有限的。我们可以单击事件名称来查看按国家、会话和页面位置分列的事件计数。但是我们不能打开 Page Location 瓷砖从数据中得到任何有用的信息。要获得更强大的报告，请使用 UA。UA 报告可以通过事件标签显示收入、交易和电子商务转换率数据。以下是如何做到这一点。打开 UA。点击 Behavior (行为) > Events (事件) > Top events report (事件报告)。你将看到一个包含所有事件类别的表。事件类别将取决于如何在 googletagmanager (GTM)中设置事件桶。对于本例，我们将选择 Enhanced Ecommerce 事件类别。现在我们看到事件动作。事件动作将告诉我们用户做了什么。在这个例子中，我们将点击“ Quickview Click”，因为我们想知道用户选择的所有不同的产品作为“快速查看”再进一步，找到事件图上方和 All Users (全部用户)下方的标签 Explorer (资源管理器)，然后单击 Ecommerce (电子商务)。现在，我们的表拉入了触发“快速查看”事件的产品页面，并显示了这些特定产品页面的电子商务转换率。这就是分析真正开始的地方。我们可以开始了解用户行为是如何帮助或损害转换的，并最终定义一些 A/B 测试。3. 页面浏览量页面浏览量告诉我们一个特定网页被浏览的次数，这本身并没有多大帮助。但是当被一个营销渠道分割时，它可以告诉我们如何提高业绩。要查看页面浏览量，请打开 Life Cycle (生命周期) > Engagement (参与) > (Pages and screens report (页面和屏幕报告)。通过单击“添加比较”并选择一个值为 google/organic 的会话源/媒体维度，将报告过滤到源/媒体，比如 google/organic。向下滚动，查看页面标题表。你将看到视图和参与度指标，如平均参与时间和唯一用户滚动在这里。如果有很多的页面浏览量，但是平均的浏览时间或者滚动深度很低，那么这可能不是人们所期望的内容。试着重写这些文章中的介绍，以吸引读者的注意力。在 google/organic 的例子中，你可能需要调查高页面浏览量的页面在目标关键词的自然搜索中表现如何。如果他们的排名在2–10之间，你可以通过提高几个位置来获得更多的流量，所以这可能是一个很好的关注点。当然，你可以通过将网址插入 Ahrefs 的排名监控来检查排名位置。最后的想法由于有这么多数字和技术术语，Ga很快就会变得混乱。但是为了跟踪成功，你只需要专注于本文中共享的少数重要指标：用户，参与和转换。有问题吗？来 Twitter 上找我。译者，John Zhao，西品东来创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human:",
  "headers": [
    {
      "level": "H1",
      "text": "你唯一需要跟踪的3个谷歌分析指标"
    },
    {
      "level": "H2",
      "text": "什么是谷歌分析的度量标准？"
    },
    {
      "level": "H2",
      "text": "你应该跟踪的三个谷歌分析指标"
    },
    {
      "level": "H3",
      "text": "2. 用户参与度"
    },
    {
      "level": "H3",
      "text": "3. 转化"
    },
    {
      "level": "H2",
      "text": "超越基本指标"
    },
    {
      "level": "H3",
      "text": "1. 新访客及回访访客"
    },
    {
      "level": "H3",
      "text": "2. 事件"
    },
    {
      "level": "H3",
      "text": "3. 页面浏览量"
    },
    {
      "level": "H2",
      "text": "最后的想法"
    }
  ],
  "author": "Kayle Larkin"
}