{
  "url": "https://ahrefs.com/blog/zh/google-search-algorithm/",
  "slug": "google-search-algorithm",
  "title": "谷歌搜索算法是如何工作的",
  "description": "谷歌的搜索算法无疑是有史以来最有影响力的技术之一。但是它是什么，它又是如何工作的呢？",
  "content": "Bill Widmer 8 年多的数字游牧生涯，Bill 的使命是环游世界并使用 SEO 和内容营销为其提供资金。 内容 谷歌的搜索算法无疑是有史以来最有影响力的技术之一。据估计，谷歌每天的搜索量为56亿次，可以肯定地说，谷歌对世界和你的业务产生了重大影响。但是什么是 Google 搜索算法呢？它是如何工作的？而且，最重要的是，你怎样才能在谷歌上排名更高并获得更多的流量呢？本指南试图揭开神秘的谷歌搜索算法的神秘面纱:什么是谷歌搜索算法？谷歌搜索算法是如何工作的？什么是谷歌搜索算法的排名因素？关于谷歌算法更新的一个说明在哪里可以找到谷歌的官方更新什么是谷歌搜索算法？谷歌搜索算法指的是，谷歌用来对内容进行排名的过程。它考虑了数以百计的因素，包括关键词提及、可用性和外链。小提示. 谷歌有多种搜索算法，所有这些算法一起工作可以得到最好的结果。在本文中，我们将主要关注谷歌的排名算法，因为我们相信，这是大多数人在谈论谷歌的搜索算法时所指的。谷歌搜索算法是如何工作的？谷歌的算法是极其复杂的，它究竟是如何工作的并不是公共信息。人们认为，排名因素远远超过200个，而且没有人知道所有这些因素。即使他们这样做了，也没关系，因为算法总是在变化。谷歌平均每天发布6次算法更新。每年高达2000次。也就是说，谷歌确实给出了一些提示，告诉你如何在搜索结果中获得好的排名。什么是谷歌搜索算法的排名因素？当你想到一个“搜索算法”ーー因为它与搜索引擎优化(SEO)有关ーー你首先想到的可能是谷歌的排名因素。换句话说，谷歌在决定哪些页面排名和排序时看的是什么？如果我们看看谷歌的“搜索是如何工作的”页面，它直接揭示了谷歌一些最突出的排名因素:外链新鲜度关键词提及用户体验专题权威我们来分析一下。1. 外链谷歌希望显示“主题知名网站链接到该页面的页面”，用外行的话来说，它希望看到权威网站(也是局部相关的)的外链指向你的网页。获得这些链接被称为链接建设，这可以说是你应该做的最重要的任务之一，以获得谷歌的信任和展示你的网站。自1996年网站成立以来，这一直是谷歌决定一个网站是否值得信赖的最大决定因素。你可以通过比较页面的外链和竞争对手的外链，来判断链接是否会阻碍你的内容排名。首先，将你试图排名的网页的 URL 插入 Ahrefs 的网站分析，你就会看到你的网页当前有多少外链和引用域名(链接网站)。接下来，进入 Ahrefs 的关键词分析，并输入主要关键词你的目标页面。向下滚动。你会找到 SERP 概述部分，在那里你可以看到有多少外链和引用域你的竞争对手。如果你注意到，你的竞争对手的页面，比你的页面有更多的外链(就像我们在上面的例子中所做的那样) ，这意味着，你可能需要优先建立链接来排在他们之上。下面是一些开始链接建设的策略:客户博客创建可链接资产失效链接建设专业提示如果你想更深入地了解你的目标关键词的外链，以及你需要什么样的链接来排名，检查一下，看看你的竞争对手有哪些链接域名是你没有的。要做到这一点，把你的目标关键词排名前三的竞争对手插入 Ahrefs 的交集外链分析和你的网页，到“但不链接”框，如下所示:当你点击“ 显示链接机会”时，你会看到所有链接到竞争对手页面的网站，但不包括你的。这些是你可以获得链接的第一个网站。2.新鲜度内容新鲜度指的是你网页上的内容有多“新鲜”。最后一次更新是什么时候？这个因素对于某些查询比其他查询更重要。例如，如果你搜索与新闻相关的内容，谷歌通常会对过去24小时内发布的结果进行排名。然而，如果你搜索的话题不需要经常更新，新鲜度就不会有那么大的影响力。例如，“ RV 储存想法”排名前列的结果是两年前的:这是因为现在好的 RV 储存方法和两年前大体上是一样的。所以最近出版的时间并没有太大的不同。这样的指南就是我们所说的“常青内容”也就是说，不需要经常更新的内容，在未来几年都会很好。总的来说，当确定你的目标关键词的新鲜度的重要性时，你应该始终分析该关键词的 SERP。谷歌看起来是在给新鲜内容排名吗？如果是这样的话，你需要经常更新这篇文章，以便自然会站在顶端。3. 关键词提及谷歌关心的事情之一是，“你的搜索关键词(在你试图排名的页面上)出现的次数”一般来说，最好的做法是，在页面上的几个地方多次显示你的关键词，包括:标题。至少有一个副标题。网页的网址。引言段落。也就是说，我们不认为你需要担心关键词提及以外的事情。这是因为当你写关于它的文章时，你会自然而然地在整个内容中提到你的目标关键词。例如，我们在常青内容上的帖子提到了“常青内容”这个词18次ーー我们没有为此付出任何努力。相反，要更加注意确保你的页面符合搜索意图，并回答搜索者正在寻找的内容。换句话说，确保你已经涵盖了搜索者可能想知道的一切。谷歌在其“搜索如何工作”页面上强调了这一点的重要性:试想一下: 当你搜索‘ 狗’时，你可能不想要一个上百次出现‘ 狗’这个词的页面。考虑到这一点，算法会评估一个页面除了关键词“狗”之外，是否还包含其他相关内容，比如狗的照片、视频，甚至是品种列表。一种方法是使用 Ahrefs 的内容差距机会工具，来查找给定关键词的副主题，这些关键词你应该在你的页面上提及。将你的网站插入网站分析，然后单击左侧的“ 内容差距机会”。接下来，去谷歌在你的页面中搜索你要定位的关键词，然后找出与你的页面意图相匹配的第三到第五的 url (例如，如果你的页面是一篇博客文章，选择其他的博客文章)。一旦你有了竞争对手的网址，就像我在下面的截图中所做的那样，把它们插入到工具中，然后点击“显示关键词”。我这样做是为了我们的“什么是关键词”指南。在下面的截图中，结果告诉我们，我们可以通过添加一个，关于关键词是否仍然与搜索引擎优化相关的部分，来提高文章的质量。另外，通过这种类型的内容差距研究，你也可以找到更多的机会，相关的文章，你目前正在优化。我发现像“ seo 关键词最佳实践”和“什么是关键词研究”这样的关键词，我们可以潜在地为其写作内容。如果你想了解更多，关于如何优化页面的关键词和在哪里放置关键词，请查看我们的页面搜索引擎优化指南。4. 用户体验谷歌表示，它关心“页面是否具有良好的用户体验”，但什么是“良好的用户体验”？用户体验(User experience，UX)包含许多不同的东西，包括以下内容: 页面加载速度 (谷歌建议在两秒以内)没有插入式的插入式广告或弹出窗口直观的导航和内部链接移动端友好性网站设计 元标签 (具有与搜索意图相匹配的元标题和描述)还有更多在过去的几年里，速度对谷歌来说变得尤为重要。2021年夏天，谷歌发布了一个重大更新。正因为如此，现在更重要的是通过谷歌的核心页面指标 (CWV) 测试，这本质上是一个速度测试。你可以检查你的 CWV，并了解如何提高你的网站的性能，把你的网站到 Ahrefs 的网站诊断和点击“性能报告”标签。你需要在设置中启用 CWV 扫描。(你将在报告的顶部看到一个关于此的通知，如下所示。)使用Google API允许CWV后，请在你的网站上运行新的扫描。完成后，你将得到一个报告，显示需要改进的页面和有错误的页面。要查看这些页面，请单击“需要改进”或“差”旁边的数字，它将显示哪些页面没有通过 Lighthouse 得分或 CrUX 性能。(这些页面速度得分是 CWV 报告的一部分。)如果你想了解更多关于如何优化你的网站的用户体验，可以参考我们的网站检测指南。5. 专题权威谷歌希望显示“许多用户似乎对类似查询有价值的网站”，这意味着网站有额外的有价值的内容，关于查询相关的一个被搜索。虽然谷歌没有明确说明“用户似乎重视”是什么意思，但我们可以有把握地假设，主题外链是其中的一部分。因此，除了创建大量相关内容之外，你还需要从相关主题网站获取链接。例如，如果你想给“最好的蛋白质粉”排名，如果人们也到你的网站上搜索下列主题的内容，谷歌可能更有可能给你排名:一天中摄取蛋白质的最佳时间孕妇可以吃蛋白粉吗？蛋白质粉来自哪里？除了这些主题的内容，你还应该争取获得与这些主题相关的主题外链。拥有大量相关的内容和与上下文相关的链接，可能会让谷歌(及其用户)知道你是这方面的权威，并且可能帮助你在搜索结果中获得更高的排名。当然，我们假设你也在优化其他排名因素。准备检查列表的此排名因素了吗？开始为SEO创建内容中心。关于谷歌算法更新的一个说明谷歌几乎每天都会更新它的算法，而且它每年都会发布两到三次主要的更新，这会对排名产生相当大的影响。换句话说，事情变了。关注 Google 的排名因素是很重要的，这样你就不会因为谷歌的惩罚或者搜索意图的改变，而落在搜索结果页面上。谷歌的一些主要更新包括: Intrusive Interstitials Update (侵入性间隙更新)转向移动优先索引 (称为“ Mobilegeddon”) RankBrain Panda (熊猫) Penguin (企鹅) Hummingbird (蜂鸟) Pigeon (鸽子)当然，这不是一个广泛的清单。有关Google算法更新和其他常见的SEO术语，请参见我们的SEO词汇表，以获取更全面的列表。在哪里可以找到谷歌的官方更新Google有多个渠道，可以发布有关其算法变化的公开更新，并且有关其算法如何工作的大量官方公共文档。以下是一些很好的来源，可以在Google所做的事情上保持最新状态：关于谷歌搜索算法如何工作的文章官方 Twitter 页面谷歌搜索中心 YouTube 频道如果你热衷于保持谷歌在算法方面的前沿技术，它还提供了常规的办公时间，称为谷歌搜索中心。在那里，像约翰 · 米勒，谷歌的高级网站管理员趋势分析师，会现场回答你的问题。最后的想法谷歌搜索算法是一个复杂的庞然大物，有许多移动部件，而且它是不断变化的。但是它为给定的搜索查询返回最佳结果的目标是一样的。尽管谷歌进行了很多更新，但自从搜索引擎出现以来，SEO 的基本原理并没有太大改变。如果你关注本文中学到的排名因素，那么你将能够在 serp 上排名。实质上:创建高质量、格式良好的内容，以匹配你的关键词的搜索意图。保持你的内容是最新的。确保你的网站有良好的用户体验。建立主题相关的链接。根据 Google 的说法，这些都是 Google 搜索算法所关心的事情。准备好深入探究了吗? 请查看 Ahrefs 博客上的其他文章:如何在谷歌上排名更高(6个简单步骤)SEO 基础: 初学者 SEO 成功指南每个人都应该遵循的12个 SEO 最佳实践译者，John Zhao，西品东来创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human:",
  "headers": [
    {
      "level": "H1",
      "text": "谷歌搜索算法是如何工作的"
    },
    {
      "level": "H2",
      "text": "什么是谷歌搜索算法？"
    },
    {
      "level": "H2",
      "text": "谷歌搜索算法是如何工作的？"
    },
    {
      "level": "H2",
      "text": "什么是谷歌搜索算法的排名因素？"
    },
    {
      "level": "H3",
      "text": "1. 外链"
    },
    {
      "level": "H3",
      "text": "2.新鲜度"
    },
    {
      "level": "H3",
      "text": "3. 关键词提及"
    },
    {
      "level": "H3",
      "text": "4. 用户体验"
    },
    {
      "level": "H3",
      "text": "5. 专题权威"
    },
    {
      "level": "H2",
      "text": "关于谷歌算法更新的一个说明"
    },
    {
      "level": "H2",
      "text": "在哪里可以找到谷歌的官方更新"
    },
    {
      "level": "H2",
      "text": "最后的想法"
    }
  ],
  "author": "Bill Widmer"
}