{
  "url": "https://ahrefs.com/blog/zh/grow-online-business/",
  "slug": "grow-online-business",
  "title": "如何选择企业SEO7个简单的步骤来发展你的在线业务",
  "description": "学习这种久经考验的方法。",
  "content": "Bill Widmer 8 年多的数字游牧生涯，Bill 的使命是环游世界并使用 SEO 和内容营销为其提供资金。 内容 经营在线业务就好比是自己当老板、按自己的期望的时间和条件进行工作。这个是赚钱的最佳方式。但是，发展线上业务可能是一个挑战。他有一个学习过程，并且人们与数字世界互动的方式也在不断变化。在过去10年中，我个人发展了三个独立的，价值六位数的网上业务。我学到了很多关于如何赚取更多收入的知识。我把我所学到的关于发展网上业务的所有知识提炼成以下七个步骤。内容第一步、弄清楚你最好的客户在哪里在你开始投资广告或花费无数时间试图发展一个社交媒体账户之前，你应该做一些市场调查，以找到关于你的市场和受众的有价值的信息——其中最重要的是你的潜在客户会去哪里获取信息。例如，你可以在 Instagram 上发布任何东西。但如果购买你的产品的人不使用 Instagram，这些时间和努力就会被浪费。我不喜欢浪费精力，所以这里有三种方法可以找出你应该把时间花在哪里：1. 在论坛上研究你的利基市场Reddit 等论坛是消费者研究的信息绝佳的地方。几乎任何你可以想象的话题都有一个 Reddit，人们在那里分享各种信息。例如，假设我想开始销售越野车零件。我可以在 Reddit 上键入 “dirt bikes”，并立即找到 r/Dirtbikes 的子reddit，那里有很多越野车车主和爱好者。当我滚动浏览这些帖子时，首先映入我眼帘的是帖子中大量的 YouTube 链接和视频。这告诉我，越野车社区的用户可能会看很多 YouTube 视频。因此，这可能是我的一个潜在营销渠道，因为我的客户经常会用到。2. 检查社交媒体，看看什么样的内容做得好显然，越野车是一个相当受欢迎的爱好，几乎每个主要平台上都会有很多关于它的内容。但是，如果我检查 Instagram、TikTok 和 Facebook 群组，我可以看到每个地方都在推广什么样的内容，并将其与我个人想要创建的内容进行比较。例如，Instagram 上往往有很多女性骑越野车的照片和视频。这不是我想创作的内容，所以我会跳过这个平台。但如果我查看YouTube，我可以看到教程视频和骑行视频有数百万的浏览量：既然我想卖零件，我肯定可以在 YouTube 上做骑行和零件更换教程的视频来推广我的品牌。我还注意到，TikTok 有很多很酷的视频，我可以利用我已经为 YouTube 制作的视频，同样也可以在 TikTok 上创造内容。你也可以使用像 SparkToro 这样的工具来节省这个过程中的时间。这是一个客户研究工具，让你了解人们关注的内容，包括社交媒体账户、网站、播客、YouTube频道等等。你只需键入一个你的听众会感兴趣的关键词……它会显示你的目标受众的数量以及社交信息。你可以免费获得五次搜索机会，但要获得完整信息，你可能需要付费。所以现在我们已经涵盖了论坛、社交媒体和消费者研究工具。但我把最好的留到了最后…3. 做一些关键词研究，看看你是否参与谷歌排名。如果你拥有一个在线业务，同时你有客户在谷歌上搜索你的产品或服务，那么你的机会就来了。我坚信，每个在线业务都可以从搜索引擎优化（SEO）中受益。这是我最喜欢的营销渠道，因为它可以自动带来高度针对性的相关流量……而不需要不断花钱做广告。然而，有些利基市场竞争非常激烈，虽然你仍然应该长期使用搜索引擎，但它可能不会为你带来短期效益。弄清楚这个问题的最好办法是进行一些关键词研究。前往 Ahrefs Keywords Explorer（关键词分析），并插入一些能说明你的利基的关键词。例如，我可以搜索像 “dirt bikes” 或 “dirt bike parts” 这样的东西来开始。你会得到关于一个关键词的一些信息，例如每个月有多少人搜索它（数量），以及这个关键词可能有多难排名（关键词难度）。 但更重要的是这些统计数字下面的关键词建议。如果你点击左侧菜单上关键词建议下的任何内容，你会被带到与你搜索的关键词匹配或相关的关键词。在这里，你可以根据搜索量、关键词难度（KD）、流量潜力（TP）等因素过滤这个列表。但你在寻找什么呢？如果大多数关键词的 KD 值<40，这可能意味着你有很大的机会在内容足够好的情况下将这些关键词排到谷歌的第一页。然而，请记住，这只是一个粗略的指标——像这样的量化指标永远不可能是完美的。但只要有足够的努力，你任然可以参与高 KD 的关键词排名。现在，你可能想知道，你应该活跃在哪些社交媒体平台上，以及 SEO 是否可能是你真正想关注的东西。接下来，让我们确保你的企业实际上已经为增长做好了准备。第二步、创造一个坚实的用户体验太多的企业忽视了他们网站的可用性和外观。如果你的网站看起来过时了，加载缓慢，或者难以浏览，那么无论你的营销有多好，你都会错过销售机会。 这里是如何确保你的客户在你的网站上有一流的体验：1. 确保你的网站能快速加载你的网页最多应该在两到三秒内加载完毕（更快总是更好）。如果人们花了太长时间等待页面加载，他们会离开并去别的地方。你可以用 PageSpeed Insights 这样的工具免费检查你网站的加载速度。 你还会看到你的网站是否通过了谷歌的 Core Web Vitals（核心网页指标）测试，这是谷歌的众多排名因素之一。如果这对你来说是个问题，请点击这里阅读我们的网站速度优化指南。如果这超出了你的能力，而且你没有时间学习，可以考虑雇用一个开发人员。2. 改善你的网站结构你的网站结构对你的用户和搜索引擎爬行者都很重要。这是建立一个强大的在线业务的一个重要步骤。问问自己：用户浏览你的网站有多容易？ 他们能否在你网站的任何页面上，通过三次或更少的点击找到他们要找的页面？ 导航菜单是否能让客户轻松地在你的漏斗中流动？我发现改善你的网站结构的最好方法是为你的网站上的所有页面创建一个脑图，以及它们如何相互连接。你可以使用像 XMind 这样的工具来做到这一点。下面是我们在 Ahrefs 的使用的：你的目标应该是创建一个尽可能扁平的网站结构——也就是说，你的任何一个页面都不能超过几次点击就能到达的程度。这里有一个视觉效果。你应该专注于围绕关键词研究建立你的类别，并适当使用内部链接，以保持所有的东西都联系在一起。3. 使用高质量的媒体告诉我，哪个看起来更好？这个…来源：Pixabay 的一个免费的图片。… 或者是这个？来源：Canva 的一张付费图片。前者是免费的图片库；后者是付费的。 库存照片和视频可能看起来很俗气，不专业。投资几块钱购买更高质量的图片资源是值得的，比如Shutterstock 或者 Canva Pro。你还可以在 Unsplash 上找到大量真正高质量的免费和付费照片。为了改善你的网站，甚至值得投资于摄影师或录像师，或自己学习这些技能。这些媒体资源是客户访问你的网站时首先看到的东西；这些印象很重要。除了这三点之外，速度、结构、和媒体，还有其他一些需要注意的事情：使用的字体颜色方案整体主题/布局移动友好性等等如果你遵循我们的指南来创建一个对搜索引擎友好的网站，你就会在所有这些点上打下基础，并拥有一个优化过的网站。如果网站设计不是你的强项，可能值得考虑雇用一个开发人员来帮助你。第三步、决定两到三个关键的营销渠道社会媒体、搜索引擎、付费广告、内容营销…作为企业家，我们往往给自己施加很大的压力，让自己做所有的事情。而这只是营销方面，只是我们为建立和发展一个成功的企业而需要关注的许多事情中的一件。为了避免倦怠和分散自己的精力，我强烈建议至少在开始时只关注两到三个主要的营销渠道。当你赚到足够多的钱（和学到足够多的知识）来雇用人担任这些角色时，你可以扩大规模。其中一些选择包括：SEOYouTube付费广告社交媒体播客我个人最喜欢的营销渠道是 SEO。 然而，你决定首先追求的渠道应该始终是你认为对你的业务最有效的渠道。最好的方法是混合渠道，针对用户购买旅程中不同部分的受众：在第一步中，你应该已经做了一些基本的关键词研究，看看你是否有可能在谷歌上获得高排名。如果你发现关键词相对容易排名，并且与你的产品或服务相关，我建议你学习并实施 SEO。事实上，SEO 关注的是整个客户旅程，这使得它更有说服力。除此之外，你还应该对你的受众关心哪些社交媒体平台或播客，以及你喜欢创作什么样的内容有一个大致的概念。从这些渠道中挑选一个与 SEO 结合起来使用。最后，你可以使用付费广告。然而，如果你不知道自己在做什么，在付费广告上损失的风险更大。只有当你已经有了一些经验，或者有能力聘请别人时，我才会考虑。否则，就学习其中一个免费渠道，一旦你的业务已经赚钱，就可以进入付费广告的分支。第四步、创建高质量，相关的内容无论你决定采用哪种营销渠道，有一样东西你永远需要：高质量的内容。无论是 TikTok 或 YouTube 的视频、Instagram 的照片、SEO 的博客文章，还是其他媒介，你的内容需要在网上平庸的海量内容中脱颖而出。但 “创造高质量的内容” 是什么意思？这意味着你的内容需要：有参与性相关独一无二内容丰富这意味着它是你的受众所关心的东西，并以一种有趣的方式放在一起，吸引他们的注意力。做到这一点的方式根据你的受众和你的营销平台而有所不同。例如，在谷歌第一页的排名要求你的内容是准确的、格式良好的、独特的、有权威的。 另一方面，为 TikTok 制作高质量的内容，需要采取不同的方法。根据这项研究，TikTok 的观众最看重的是能让他们高兴或惊喜的东西。这意味着什么是 “优质内容” 的概念很难定义，而且取决于平台。重点是，你需要在创造和继续改进你的内容方面投入大量的精力。 只要你自己继续保持专注和改进，质量会随着时间的推移而得到提高，因为你会了解你的受众喜欢什么，以及如何成为一个更好的作家、摄像师、摄影师或播客。尽可能多地学习关于你的利基和你的业务，并利用你所学到的东西在下一篇内容中做得更好，不管那是什么。这里有一些指南，可以帮助你磨练你的技艺：21个写作技巧，快速成为更好的作家视频营销：简单（但完整）指南改善你的社交媒体摄影的6个技巧创建有吸引力的播客内容的13个技巧第五步、发展强大的伙伴关系你了解了你的客户，你的网站也做得非常棒。你选择了你的营销渠道，同时你已经开始了你的内容。接下来，是时候在你的行业这个更大的游戏中成为参与者了。一个好的伙伴关系可以使你的在线业务和你的品牌飞速发展。我能够将我的一个博客发展到年收入50万的水平，仅仅是因为我花时间与他们联系，并想出了相互促进的想法。伙伴关系可以帮助你为 SEO 获取更多链接，推销你的内容，甚至直接通过联盟营销将更多的钱放入你的口袋。这不是你应该忽视的事情。但你如何找到品牌合作伙伴？简单。想一想你已经使用和喜爱的产品，并联系这些品牌。给他们发一封电子邮件。或者更好的是，拿起电话。告诉他们你的流量和你的能力，以帮助促进他们和他们的业务。主动向你的电子邮件列表和你的社交媒体粉丝推广他们。将他们的产品添加到你的网站上的博客文章中。例如，这里有一个你可以使用的电子邮件模板。Hey [name],My name is [your name]. I run [your business], and we [explain what your business is about in a few words]. I’m reaching out because I’ve been using [their product(s)] for a few years now and absolutely love it (them). In fact, [personal story about using their product].Our website/social media accounts gets/get [number of visitors] people every month looking for information on [their product]. I would love to work something out where we can promote you to our audience. Can we hop on a quick phone call to discuss?I’m free X time on X date or Y time on Y date.Looking forward to meeting you!Cheers,你好，[姓名]。我的名字是 [你的名字]。我经营 [你的企业]，我们 [用几句话解释你的企业是什么]。 我联系你是因为我已经使用 [他们的产品] 好几年了，并且绝对喜欢它（他们）。事实上，[关于使用他们产品的个人故事]。我们的网站/社会媒体账户每个月都有/得到 [访问人数] 的人在寻找 [他们的产品] 的信息。我很想在我们可以向观众推广你的地方工作。我们能不能快速打电话讨论一下？我在X日期的X时间、或Y日期的Y时间有空。期待与你讨论。如果你想不出任何你喜欢的品牌，那么接下来要做的事情就是开始在谷歌上搜索你的利基市场的产品或服务。寻找拥有相当数量的社交媒体粉丝的网站，但不要太大，以至于你可能会被忽视。我发现有 10,000 至100,000 粉丝的品牌可能刚刚好。你可以在做常规的关键词研究时找到可以合作的品牌。例如，在查找我可能想要使用的关键词的搜索结果时，我发现了本地网站 “RideNow Chandler”。如果我们检查它的 Instagram，我们可以看到它有大约 3500 名追随者。比我喜欢的要低一点，但仍可能值得尝试。由于它是一个本地团体，我可能会在数字活动的基础上与它合作举办本地活动。因此，即使它没有庞大的在线受众，它仍然可以成为一个高价值的合作伙伴。最后一个提示：拿起电话，给合适的人寄一封手写的信，甚至在活动中与人见面，是进入别人视野的最快方式。不要害怕建立联系。第六步、自动化，委托，删除现在是时候停止像独行侠那样思考了。在这一点上，你需要像管理人员一样思考。像苹果或微软这样的巨头公司的高管们有一个无限的待办事项清单。他们总是有一些事情可以做。对你来说也是如此。与其疯狂地增加待办事项清单，你应该尽可能地删除许多任务，这样你就可以只关注最重要的事情。要做到这一点，首先要进行一次头脑风暴。写下你需要做的每一项任务，包括你做了不止一次的任务。例如这样的：为 SEO 做研究关键词概述、撰写、编辑和发布博客内容在 Facebook、Twitter 和我的电子邮件列表中分享这些内容与联盟伙伴进行沟通寄送发票发送外联电子邮件以建立链接大纲，创作，编辑，并发送客座播客以及一百万件其他事情现在，让我们看一下这些任务。其中一些是相当简单和重复的，例如将一篇文章上传到我的博客。其他的则需要特定的技能，如关键词研究和文章的大纲。我想弄清楚的是，哪些任务需要由我来做，哪些可以用软件或设置自动完成，哪些可以委托给自由职业者或雇员，哪些根本不需要做。例如：如果我每个月向客户收取相同的金额，我可以设置自动开票，这样我就不必每次都去创建一个。我可以使用像 Wordable 这样的工具，将我的文章从 Google Docs 上传到 WordPress，完全省去上传的任务。与其自己写内容，也许我可以雇用一个自由职业者或内容创作机构来为我做。我可以雇佣一个相对便宜的在线助理，为我在社交媒体和电子邮件上发布我的文章。通过这个练习，你可以在根本不需要自己做的任务上为自己节省大量的时间、精力和金钱。这是成功的人和企业的秘诀之一。第七步、扩大你的努力最后，是时候把你所学到的一切拿出来扩大规模了。一旦你搞清楚了如何在网上获利，你就可以砍掉没有用的东西，把有用的东西加倍。在这一步骤中，你要更多地关注把自己从尽可能多的任务中解脱出来，专注于整体业务战略而不是日常运营。这意味着雇用人员来做所有不直接需要你做的业务任务。但要做到这一点，你需要创建标准操作程序（SOP），详细列出如何完成每项任务。例如，这里是我们在 Ahrefs 用于博客文章的 SOP 的一部分。这里有一些指南，你可以学习如何扩大你的在线业务。如何创建SEO SOP来扩大自然流量如何建立（和组织）一个SEO团队如何用5个步骤雇佣自由撰稿人（Ahrefs的流程）最后学习如何发展网上业务需要时间。如果你的成果没有马上得到回报，也不要灰心。你正在学习的这些技能将在未来的一生中继续得到回报。我个人开始并 “失败” 了五个不同的项目，然后才找到我喜欢的业务。我把 “失败” 加了引号，因为我不认为它们是失败。相反，我把它们看作是学习经验。 如果我没有 “失败” 五次，我就不会成功地建立我所经营的以下三项业务。像其他事情一样，持续的努力和偶尔的 “失败” 是你掌握发展网上业务的技能所需要的。译者，Park Cheng，歪猫出海创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human:",
  "headers": [
    {
      "level": "H1",
      "text": "7个简单的步骤来发展你的在线业务"
    },
    {
      "level": "H2",
      "text": "第一步、弄清楚你最好的客户在哪里"
    },
    {
      "level": "H3",
      "text": "1. 在论坛上研究你的利基市场"
    },
    {
      "level": "H3",
      "text": "2. 检查社交媒体，看看什么样的内容做得好"
    },
    {
      "level": "H3",
      "text": "3. 做一些关键词研究，看看你是否参与谷歌排名。"
    },
    {
      "level": "H2",
      "text": "第二步、创造一个坚实的用户体验"
    },
    {
      "level": "H3",
      "text": "1. 确保你的网站能快速加载"
    },
    {
      "level": "H3",
      "text": "2. 改善你的网站结构"
    },
    {
      "level": "H3",
      "text": "3. 使用高质量的媒体"
    },
    {
      "level": "H2",
      "text": "第三步、决定两到三个关键的营销渠道"
    },
    {
      "level": "H2",
      "text": "第四步、创建高质量，相关的内容"
    },
    {
      "level": "H2",
      "text": "第五步、发展强大的伙伴关系"
    },
    {
      "level": "H2",
      "text": "第六步、自动化，委托，删除"
    },
    {
      "level": "H2",
      "text": "第七步、扩大你的努力"
    },
    {
      "level": "H2",
      "text": "最后"
    }
  ],
  "author": "Bill Widmer"
}