{
  "url": "https://ahrefs.com/blog/zh/growth-marketing/",
  "slug": "growth-marketing",
  "title": "什么是增长营销？初学者指南",
  "description": "什么是增长营销，它是如何运作的？ 它适合你的业务吗？ 在这篇文章中学习你需要知道的一切。",
  "content": "Si Quan Ong 营销@Ahrefs。 我爱阅读，爱跳霹雳舞，爱尝试随机的生活实验。 内容 众所周知，DropBox 利用自己的产品为自己的增长提供了超强的动力ーー它为每一个新的业务推荐都提供了存储空间。这种产品和营销的整合在当时是全新的。当时 DropBox 的第一位营销人员Sean Ellis称之为“增长黑客”(growth hacking)。另一位营销人员，安德鲁 · 陈(Andrew Chen) ，随后称增长黑客为“营销的新副总裁”伴随着 Facebook 自身增长团队的成功，许多高增长的科技公司，如 Uber、 Airbnb 和 Pinterest，开始建立和发展被称为增长型营销的规则。在这篇文章中，你将学到以下内容:什么是增长营销为什么增长营销很重要增长营销如何运作增长营销是否适合你如果增长营销不适合你，另一种方案什么是增长营销?增长营销是一种全面的、数据驱动的营销方法。它聚焦于整个漏斗(而不仅仅是漏斗的顶端) ，并应用科学方法ーー提出假说，检验这些假说，然后精炼或消除它们。肖恩最初被称为“增长黑客”(growth hacking) ，他的本意是指“创造性的、协作式的创意生成以及解决棘手问题的能力”。然而，随后的增长营销人员过于关注“黑客”方面，将其视为解决营销问题的“银弹”。“增长营销”这个术语的提出是为了重新聚焦这个学科。为什么增长营销很重要?传统营销有两个主要问题：团队之间几乎不存在交叉协作营销团队通常不知道什么是有效的让我们更详细地看看两者。1. 团队之间几乎不存在交叉协作公司经常按营销漏斗的层次来组织团队。一般而言:市场营销团队占据了渠道的顶端ーー意识和兴趣。销售团队拥有收入ーー考虑和转化为客户。产品团队拥有留住员工的能力ーー忠诚度和拥护度。然后，每个团队都有一个衡量成功的指标，在每一层的漏斗。但问题是团队为了他们的指标而进行优化… 以彼此为代价。例如，市场营销团队的一个典型目标就是客户的数量。但是这些潜在客户可能是低质量的，这会影响到其他团队(例如，低质量的客户更难转化和留住)。这只是一个问题。另一个问题是，这些团队很少相互沟通和协作。例如，在这些场景中，产品团队错过了一个利用营销团队关于如何推销新功能的专业知识的机会。这种部门间的孤立，是为什么 DropBox 的创新推荐计划，在大多数公司不会发生的原因之一。增长营销通过把重点放在整个漏斗上来解决这个问题。2. 营销团队通常不知道什么是有效的传统的市场营销很难衡量。著名的美国商人约翰 · 瓦纳马克曾经打趣说: “我花在广告上的钱有一半是浪费的，问题是我不知道是哪一半。”由于几乎不知道什么是有效的，营销人员基于直觉和(希望是)有根据的猜测，想出了营销活动和策略。这引发了人们对一种严格方法论的渴望——这种方法论可以产生实验想法，衡量它们是否有效，并将资源从无效的方法转移到有效的方法上。增长营销就是这种方法论。增长营销如何运作?根据肖恩的书《黑客增长》 ，增长型营销的核心要素是:创建一个结合市场营销和产品的跨职能团队。使用质性研究分析和定量数据分析 (以获得对客户行为的洞察力)。创意的生成和测试 (以及使用度量标准来评估它们是否有效)。1. 创建一个跨职能团队由于增长营销团队的目标是在整个漏斗中工作，因此该团队需要不仅仅是具有营销技巧的人。Sean表明该团队应包括以下内容： 增长负责人-选择核心重点领域(漏斗的任何部分) ，选择度量标准，并管理团队 产品经理-管理产品及其变更 软件工程师-负责产品的开发和实验 市场专家-了解不同的市场渠道和如何执行实验 数据分析-设计实验，提取数据，并提供见解 产品设计师-工作在产品和设计一个更好的经验2. 定性研究和定量数据数据是增长营销过程的关键。它应该易于访问和分析。另外，它应该是准确的。肖恩写道:至关重要的是，你的团队必须掌握客户体验的每一部分的数据——远远超出他们访问你网站的频率和在那里停留的时间——这样才能对数据进行粒度级别的分析，以确定人们实际上是如何使用你的产品的，以及你计划让他们如何使用这些产品。这意味着，营销人员、数据科学家和工程师必须共同努力，为网站、移动应用程序、销售点系统、电子邮件营销和客户数据库添加适当的跟踪。一旦正确的跟踪到位，必须将用户信息的多个来源整合在一起，以便为你的数据团队可以分析的用户行为提供一个详细而可靠的图像。你想要创建的是通常所说的数据湖/数据仓库: 一个存储所有客户信息的单一位置，在这里你可以真正深入了解并发现使用该产品的用户可能与其他群体不同的独特分组。Sean Ellis, 增长营销人员 Seanellis.me3. 创意的生成和测试增长营销团队经历了所谓的增长黑客周期。这个过程是这样的: 分析-增长负责人与数据分析师合作，发现增长机会的领域。这可能是他们想要关注的漏斗的任何部分。例如，他们可能会查看导致用户改变或离开产品的事件或页面。 想法-增长型营销团队的成员(包括产品经理、软件工程师等)就如何改进重点领域提出想法。 优先级-想法是根据影响，信心和执行的难易程度(ICE)得分的。 试验-进行试验，经过一段时间后对试验结果进行分析。然后循环往复。增长营销是否适合你？毫无疑问，增长型营销是有效的。毕竟，许多公司都是通过使用它而成功的。Facebook、 Twitter、 DropBox 和 Airbnb 就是众所周知的例子。然而，仔细观察，你会发现大多数创造了成功的增长型营销项目的公司通常:面向消费者。已经筹集了很多钱。拥有能够生成病毒性的产品，也就是说，更多的用户带来更多的用户。对于大多数小企业来说，增长型营销可能是遥不可及的。Lars Lofgren，自己建立了多个增长型团队，在这篇文章中解释了其中的原因。这里有一个快速的摘要: 概率是很难理解的-大多数人不理解概率和统计学，最终会进行糟糕的测试。糟糕的测试会导致糟糕的结果，从而导致糟糕的程序。 大多数公司没有足够的数据-准确的测试需要大量的数据，但大多数公司永远不会有那么大的数据量。 增长型团队太昂贵了-你花在增长型团队建设上的钱很容易让你建立一个在谷歌上排名靠前并且产生大量有机流量的博客。 增长型团队的收入潜力有限-转化率有一个上限。花那么多钱优化这些利率值得吗？如果增长营销不适合你的企业，你应该做什么？另一种选择: 以增长为导向的营销在Lars的帖子中，他写道：“一个规模适当的营销渠道可以让你的业务增长10倍。最好的情况是一个增长团队优化你的漏斗？3 x.我宁愿把时间花在10倍战略上，也不愿花在3倍战略上。”我们在 Ahrefs 就是这么做的。我们的主要客户获取渠道是内容营销。我们定期在我们的博客和 YouTube 页面上制作内容。在过去的几年里，我们已经建立了这个渠道并继续投资。虽然我们在这里做的任何事情都不是真正独一无二的，但我们确实为我们的内容营销策略增加了一个转折点。也就是说，像增长营销一样，我们的内容是全漏斗式的。而不是有单独的内容片段解决每个阶段的营销渠道，我们的每一块内容服务:获得新客户。通过教育客户了解我们的产品是做什么的，从而产生对我们产品的兴趣。通过教育客户如何更好地使用我们的产品来留住他们。下面是一个例子，链接建设是一个高度搜索的话题，每个月在谷歌上大约有31,000次搜索:如果没有我们提供的反向链接研究工具，也不可能做好链接建设。因此，在我们的链接建设指南中，我们自然而然地谈论我们的产品:这一块内容覆盖了漏斗的所有部分，它: 获得新的领导和客户-通过排名的话题，许多人在谷歌上搜索，我们产生的流量一贯。 对我们的产品产生兴趣-我们的内容教导用户如何做链接建设，以及如何用我们的产品做到 保留客户-我们的内容也教现有客户，如何用我们的产品建立链接。我们如何做到这一点呢? 这里有一个关于我们策略的快速解释。1. 针对具有搜索流量潜力的主题在谷歌上排名，你需要针对人们已经搜索的主题。你可以使用像Ahrefs的关键词分析这样的研究工具找到这些主题。输入一个相关的关键词，它会为你产生成千上万的想法。然后，使用“业务潜力”缩小列表。这样你就可以专注于推动增长的话题，而不是像流量这样虚荣的指标。2. 创建高质量的值得排名的内容要想在谷歌上排名第一，你需要创建值得排名的内容。观看这个视频来了解如何。延伸阅读内容创作:初学者的完整指南什么是搜索引擎优化内容? 如何编写排名内容 如何在9个步骤中撰写博客文章（人们实际上想要阅读） 3. 推广内容简单地发布内容并不意味着它会自动被发现。你必须给它一个推动力，并把它展示给关心它的人。按照这个清单来宣传你的内容。最后的想法增长型营销过程可能难以实施。但是即使你没有这样做，它的一些元素仍然是有用的。尝试，解决整个漏斗ーー这些都是你可以应用到自己事业中的想法。如果你有兴趣学习如何执行增长营销，我推荐以下资源: Hacking Growth (书籍)ReforgeGrowthHackersGrowth Marketing Handbook 我有没有错过关于增长营销的任何事情？让我知道Twitter。译者，John Zhao，西品东来创始人 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Si Quan Ong 营销@Ahrefs。 我爱阅读，爱跳霹雳舞，爱尝试随机的生活实验。",
  "headers": [
    {
      "level": "H1",
      "text": "什么是增长营销？初学者指南"
    },
    {
      "level": "H2",
      "text": "什么是增长营销?"
    },
    {
      "level": "H2",
      "text": "为什么增长营销很重要?"
    },
    {
      "level": "H3",
      "text": "1. 团队之间几乎不存在交叉协作"
    },
    {
      "level": "H3",
      "text": "2. 营销团队通常不知道什么是有效的"
    },
    {
      "level": "H2",
      "text": "增长营销如何运作?"
    },
    {
      "level": "H3",
      "text": "1. 创建一个跨职能团队"
    },
    {
      "level": "H3",
      "text": "2. 定性研究和定量数据"
    },
    {
      "level": "H3",
      "text": "3. 创意的生成和测试"
    },
    {
      "level": "H2",
      "text": "增长营销是否适合你？"
    },
    {
      "level": "H2",
      "text": "另一种选择: 以增长为导向的营销"
    },
    {
      "level": "H3",
      "text": "1. 针对具有搜索流量潜力的主题"
    },
    {
      "level": "H3",
      "text": "2.  创建高质量的值得排名的内容"
    },
    {
      "level": "H3",
      "text": "3. 推广内容"
    },
    {
      "level": "H2",
      "text": "最后的想法"
    }
  ],
  "author": "Si Quan Ong"
}