{
  "url": "https://ahrefs.com/blog/zh/hiring-freelance-writers/",
  "slug": "hiring-freelance-writers",
  "title": "如何通过5个步骤雇佣自由撰稿人（Ahrefs流程）",
  "description": "了解如何使用自由撰稿人漏斗来审查成千上万的作者应用程序，并找到最好的应用程序。",
  "content": "Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。 内容 如果你曾经尝试过雇佣自由撰稿人，你可能会收到成千上万的申请。这通常会导致你问自己两个问题:我该怎么选择最好的呢？我怎么会有时间过滤那么多的申请呢？在这篇文章中，你将学习如何建立一个过程来回答这些问题。内容第一步: 创建申请表大多数招聘信息都告诉求职者，要给招聘经理发送求职信和简历。这种方法在寻找全职雇员时效果很好，但对自由职业者来说就不行了，因为他们通常会吸引成百上千的申请者。你不可能看完那么多简历而不弄丢。因此，合适的申请者经常会从网上溜走，你会错过非常棒的作者。解决这个问题的一个方法是，让所有的申请人通过谷歌表格进行申请。以下是这种做法合理的两个原因:它帮助你快速有效地审查申请人 — 谷歌表格漏斗申请人到谷歌工作表，这样你就可以审查所有申请人，而不是通过电子邮件筛选。它允许你测试作家的技能和知识的规模 — 你可以很容易地提出问题，旨在判断申请人的知识，技能和经验的主题。至于你应该问申请人什么问题，我建议你混合使用多项选择题和简答题。多项选择题有助于衡量知识和经验，而“简短回答”问题可以让你判断写作能力。下面是我们的选择题之一:这个问题的答案是我们希望最有经验的 SEO 知道的东西。但这可能会让那些经验较少的人栽跟头。小提示.这个问题还是有点“视情况而定”的意味。但总的来说，有一个明确和正确的答案，我认为大多数知识丰富的搜索引擎优化会选择。下面是一个“简短回答”问题的例子:我们设计这个问题是为了帮助我们判断申请人简洁而准确地解释事情的能力。如果你对我们的申请表感兴趣，这就是。这些问题中只有少数用于审查目的; 其余的用于获取基本细节，如他们的姓名、电子邮件地址、 Twitter 用户名等。询问这些细节是非常必要的，因为这是申请人不通过电子邮件申请时，获得这些细节的唯一途径。第二步: 发布你的工作现在你需要吸引应聘者到你的申请表，你可以通过创建一个职位列表，并发布在任何地方，你可以做到这一点。以下是你需要解释的四件事:你想要什么-简短一点。告诉应聘者这个职位需要什么。你需要什么技能-列出所有你希望申请人具备的技能。你是谁-给出一些关于你公司的细节。(长话短说，不要让别人感到厌烦。)如何申请-发送人到您的申请表格。你可以在很多求职公告板上提交你的招聘信息。我们发布到Problogger，Swipe Files Job Board(前身Hey Marketers) ，我们的求职页面，和其他一些平台。我们也在一些 Slack 和 Facebook 小组里发帖。鉴于每个申请人都经历了同样的过程，你可以张贴的职位名单越多越好。第三步: 审查申请人审查过程的每个方面都在谷歌工作表中进行。这让整个过程变得超级简单，因为所有东西都在一个地方。我建议将这个过程分为自动审查和人工审查，以使事情尽可能快速和有效。自动审查在这里，我们的想法是取消不符合条件的申请者的资格，给其余的初步评分，并清理表格，使人工审查尽可能快。以下是如何做到这一点的三个步骤。A. 取消资格没有必要浪费时间审查那些不能遵守基本规则，或不符合基本标准的人的申请上，所以自动取消他们的资格是值得的。谷歌工作表的美妙之处在于，你可以通过过滤器和公式轻松实现这一点。你们应该还记得，我们要求所有的申请人在50个单词以内定义两个术语。因为我们希望取消那些超过允许字数的列的资格，所以我们添加了两个额外的列，其中包含计算每个定义中的字数的公式。然后我们过滤以排除定义超过50个单词的行。然后，我们筛选出另外几个标准:每1000字的费用 — 我们排除了没有写10–1000字的人。(这主要是为了排除那些不能按照要求操作并给出单词价格的申请者。)多年的 SEO 经验 — 我们排除任何“ < 1”年的经验。你以前用过 Ahrefs 吗? — 我们排除了那些回答“没有”的人B. 得分接下来，您希望给每个申请人一个初步分数，以便一目了然地更好地了解他们的知识和经验。为了做到这一点，我们创建了一个公式，检查他们的答案，我们的多项选择问题，他们的 Ahref 的经验，以及他们是否仍然有一个活跃的 Ahref 订阅。结果得分在0到5之间。C. 简化即使有过滤器和分数，你的工作表也将不堪重负，因为它包含了很多数据。因此，隐藏申请人的姓名和电子邮件地址等审查过程中不需要的栏目是值得的。这也有助于消除潜在的偏见。对于我们来说，我们在初步分数中增加了条件格式，以便更容易地观察每个申请者的质量。下面是我们的结果:人工审查我们浏览了申请者的初步分数和定义，以决定他们是否应该进入下一阶段的过程。每个申请者只需要几秒钟，这样我们每小时就可以审查100多个申请者。例如，它只需要一秒钟决定不继续与这个申请人，因为他们定义搜索引擎营销而不是搜索引擎优化。另一方面，对于下面的申请者，我们可以很快地告诉他们，值得给他们一个机会。他们的定义都很准确，写得很好，而且在我们的选择题上得分很高:为了跟踪我们对每个申请人的决定，我们增加了最后一栏:第四步: 测试申请人大多数人通过让作者从内容摘要中写一篇测试文章来测试他们。我们也这样做，但不会给每个申请人发送独特的案情摘要。我们给他们都发了同样的简报。以下是我们建议这样做的三个理由:给他们的作品打分更容易 — 你可以创建一个清单，根据相同的标准给作者打分。它更快 — 你不必为每个作者创建一个新的内容摘要。它可以自动化 — 你可以设置系统发送简报时，他们达到这个阶段的作家。让我们来看看，如何确保测试顺利且高效地运行。A. 解释这笔交易，了解他们的详细情况对于通过我们最初的审查过程的申请人，我们需要解释的交易为测试文章，并得到他们的详细信息。我们在 Gmail 中为此创建了一个模板。它解释了我们:想给他们提供一个付费试用品。支付一个统一的费用，每个测试项目(和多少)。向每个申请人发送相同的简介，并且他们的文章不会被发表。拥有他们为我们生产的所有产品。月底支付发票。这可能看起来有点信息超载，但最好确保每个人从一开始就意见一致。我们的电子邮件以一个谷歌表单的链接结束，询问他们的发票电子邮件地址(这通常与他们每天使用的不同)以及他们希望如何支付。B. 发送测试的内容摘要当申请人在前一步中提交 GoogleForm 时，我们将显示一条确认消息。它将它们链接到一个带有测试文章内容摘要的 GoogleDoc。看起来是这样的:该文件还载有指示，告诉申请人:复印一份文件。他们想写多少就写多少(没有字数限制)。把测试用品电邮给我们，完成后给我们开发票。在他们开始写作之前阅读我们的内容指南。我建议大家在与自由撰稿人合作时制定内容指南。我们在文件中连接到了我们的。它解释了我们对风格和内容的期望。以下是一些摘录:C. 查看他们的内容考虑到你将要测试一些作者，你需要一种公平和一致的方式来判断他们的相对质量。为此，我们创建了一个检查表，以快速审查和评分他们的努力。以下是我们清单的摘录：您可以看到，我们将整篇文章作为一个整体来检查一些基础知识，然后更深入地检查每个部分。例如，下面是我们对定义的一些标准:它的格式是否正确(根据我们的指导方针) ？准确吗？写得好吗？我们的清单上总共有30件事情。每个人等于一分，所以我们给每个申请人打30分。第五步: 雇佣应聘者招聘是最简单的部分。如果一个申请者在他们的测试文章中得分很高，我们会给他们一个实际的文章。如果进展顺利，我们会给他们更多。以下是与自由职业者合作时需要注意的一些事情:质量恶化-自由职业者有时会变得懒惰，甚至开始分包工作。这两种情况都会导致质量下降。可靠性问题-生活偶尔会阻碍每个人，但要注意始终如一的不可靠性。沟通问题-不管出于什么原因，从地球表面消失是令人惊讶的常见现象。如果你面临这些问题，不要犹豫放弃这些作者。继续和他们一起工作会耗费你的时间和精力。出于同样的原因，当你遇到可靠的自由职业者，他们始终产生高质量的工作，对他们好一点。优秀的作者价值连城，所以请继续给他们工作，并定期评估他们的价格。最后的想法如果你有一个合适的系统，雇佣自由撰稿人是很容易的。您甚至可以使用诸如 Zapier 之类的工具自动执行许多步骤。例如，我们有大纲请求、记录详细信息和发送付款请求到我们的办公室经理的快捷键。有问题吗，发推特给我。译者，John Zhao，西品东来创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。",
  "headers": [
    {
      "level": "H1",
      "text": "如何通过5个步骤雇佣自由撰稿人（Ahrefs流程）"
    },
    {
      "level": "H2",
      "text": "第一步: 创建申请表"
    },
    {
      "level": "H2",
      "text": "第二步: 发布你的工作"
    },
    {
      "level": "H2",
      "text": "第三步: 审查申请人"
    },
    {
      "level": "H3",
      "text": "自动审查"
    },
    {
      "level": "H4",
      "text": "A. 取消资格"
    },
    {
      "level": "H4",
      "text": "B. 得分"
    },
    {
      "level": "H4",
      "text": "C. 简化"
    },
    {
      "level": "H3",
      "text": "人工审查"
    },
    {
      "level": "H2",
      "text": "第四步: 测试申请人"
    },
    {
      "level": "H3",
      "text": "A. 解释这笔交易，了解他们的详细情况"
    },
    {
      "level": "H3",
      "text": "B. 发送测试的内容摘要"
    },
    {
      "level": "H3",
      "text": "C. 查看他们的内容"
    },
    {
      "level": "H2",
      "text": "第五步: 雇佣应聘者"
    },
    {
      "level": "H2",
      "text": "最后的想法"
    }
  ],
  "author": "Joshua Hardwick"
}