{
  "url": "https://ahrefs.com/blog/zh/how-to-get-a-job-in-seo/",
  "slug": "how-to-get-a-job-in-seo",
  "title": "如何找到一份SEO工作",
  "description": "在本指南中，你将学习如何在 SEO 中找到一份工作。 我们将涵盖从寻找合适的机会到面试的所有内容。",
  "content": "Chris Haines Chris 是一名 SEO 总监，在 SEO 代理方面拥有 10 年的经验。 不参与 SEO 时，他喜欢摆弄老式合成器、在沙滩上散步和喝杯好茶。 内容 我在不同的机构做了10年的SEO工作。在那段时间里，我作为招聘经理审阅了许多不同的简历。我还采访了很多优秀的候选人，还有一些不太适合担任SEO职位的候选人。那么，在搜索引擎优化领域找工作到底需要什么呢？是什么将优秀的候选人与不太优秀的候选人区分开来？在这个循序渐进的指南中，我将告诉你一些作弊代码，通过向你展示你需要获得什么样的技能才能得到面试机会，才能踏进大门，才能得到这份工作，从而加快你的搜索引擎优化事业的发展。准备好工作了吗? 好了，我们继续！内容步骤1. 学习SEO基础知识（不，你不需要上大学）你可能会惊讶地发现，大多数招聘经理并没有为入门级职位寻找SEO天才他们也不希望你接受大学教育。根据我们自己对招聘经理的调查，他们实际上希望你富有激情，并且对细节有很好的关注：但现实是，如果不知道搜索引擎优化的基本知识，这些招聘经理甚至不会给你一天的时间。那么你需要了解的 SEO 基础知识是什么呢？首先，我建议你看看我们的搜索引擎优化初学者的视频课程。或者如果你更喜欢阅读而不是观看，请务必查看我们的搜索引擎优化初学者指南。这些资源将给你一个良好的基础，在基本的搜索引擎优化原则，将意味着你可以谈论搜索引擎优化在面试期间自信。如果在任何时候你不知道一些难以破译的 SEO 术语是什么意思，你可以随时查看我们的 SEO 术语表，它提供了 SEO 术语的定义。一旦你完成了培训，并感到舒适的搜索引擎优化术语，你的搜索引擎优化教育不会停止。你肯定需要学习一些基本的实用技能。技能1. 自信使用Excel或Google表要在搜索引擎优化领域找到一份工作，你不需要成为微软的 Excel 或谷歌表格的忍者。但是知道如何使用公式和特性，比如 VLOOKUP，xLOOKUP，Power Query，CONCATENATE，文本到列，以及 pivot 表，肯定会让你领先一步。你将在 Excel 或 Google Sheets 中花费大量的 SEO 时间，所以尽早学习这些技能是值得的ーー如果你还不熟悉它们的话。你在学习 Excel 或 Google Sheets 上投入的时间越多，你的工作效率就越高。而这也是招聘经理需要的一项宝贵技能。了解更多：每个SEO应该知道的10个Google表单公式技能2. 能够使用流行的SEO工具如果你还没有意识到，SEO 使用很多工具来收集数据，你需要知道如何使用它们。快速浏览一下我们的调查就会发现，招聘经理真的很看重使用搜索引擎优化工具的经验。我们的调查还显示，86.6% 的招聘经理希望看到以下四种流行工具的使用经验:技能3. 了解关键词研究的原理大多数入门级职位的搜索引擎优化角色，在某种程度上，会让你做关键词研究，所以它真的值得了解这一技能的早期。幸运的是，这是我们学院课程教的第一件事。步骤2. 建立自己的网站如果你还没有网站，现在是建立网站的好时机。熟悉WordPress等平台，并尝试在网站上排名几个关键词如果你之前没有在其他SEO公司工作的经验，那么表明你已经主动建立了一个网站，并对其进行了某些关键词的排名，这是一个很好的方式来显示你对SEO的热情和兴趣。最初，我通过管理自己的网站，以及帮助我的父母优化他们的网站，为他们的电子商务业务获得更多订单，从而进入了SEO你不必总是在代理环境中开始获得经验（但这绝对有帮助！）。帮助朋友和家人访问他们的网站也是尽早获得经验的好方法。步骤3. 熟悉Google搜索必需品（以前是网站管理员指南）搜索市场仍由谷歌主导。因此，如果你在 SEO 工作，你需要熟悉的游戏规则。仔细阅读谷歌搜索要点（原网站管理员指南），并在指南范围内工作。（如果你建议的搜索引擎优化策略违反了谷歌搜索基本指南，那么招聘经理几乎肯定会拒绝你。）步骤4. 让你的SEO简历从人群中脱颖而出在我的职业生涯中，我看过很多简历，不幸的是，很多简历并不总是符合要求作为应聘者，你花了很多精力来制作完美的简历，但招聘经理并不总是有时间阅读所有细节。他们甚至可能在几秒钟内的午休时间查看简历以下是确保你的简历受到关注的最佳建议：提示1. 坚持要点，并将最重要的细节保留在第一页上就你的简历而言，确保你能切中要害（不超过两页）。此外，确保它是专业呈现的不要浪费招聘经理的任何时间，并尽量避免简历中的陈词滥调，如“积极主动的个人，随时准备开始工作”停止这是毫无意义的废话写下你与其他申请人的不同之处。如果你还没有任何工作经验，写下你是如何优化网站的关键条款的。提示2. 使用设计工具创建专业的简历在过去的日子里，提交你的 MicrosoftWord 简历就足够了。但是现在，像 Canva 这样的工具可以帮助你制作一份看起来很专业的简历。(是的，完全免费。)提示3. 使用专业电子邮件地址不幸的是，我仍然在社交媒体上看到很多关于招聘经理因为不恰当的电子邮件地址而拒绝简历的故事。不要成为他们中的一员！When the email address costs you an opportunity 👇🏽 pic.twitter.com/R0qfY3XbgK— Joy Doreen BIIRA (@JoyDoreenBiira) July 26, 2021 提示4. 避免简历陈词滥调尽量避免在简历中使用流行语或陈词滥调。步骤5. 在SEO机构申请工作为什么要在搜索引擎优化机构而不是内部申请？在一家小型机构工作会让你有机会很快获得广泛的经验，因为你通常会与不同行业的多个客户合作。你可以向所在位置的搜索引擎优化机构申请，也可以设置indeed.com职位提醒，以便通过你的搜索条件获得新职位的通知，从而将相关机会发送到你的收件箱专家提示 如果你找到一家你喜欢的机构，但它的网站上目前没有任何职位空缺，你可以使用Distill.io等工具在其“职位”登录页面上跟踪任何变化。因此，如果该机构将来确实更新了该页面上的职位列表，你将是第一个通过短信通知或电子邮件知道的人。值得注意的是，入门级SEO职位的命名惯例可能有很大差异。在inded.com上，我发现最相关的工作被归类为“SEO实习生”或“SEO毕业生”，所以你需要申请这些职位。（如果你不在美国，命名约定可能会有所不同。）一些机构还开办毕业生计划，在那里他们会安排几个月的实习，然后雇佣最好的候选人。这些计划的细节很可能会出现在机构的网站上，但你可以随时联系他们，以检查他们是否实施了计划。最后一点建议是，在工作清单方面，什么构成了危险信号。有时，你会在工作列表中看到“SEO”。但如果你向下滚动到角色描述，你会发现职责包括SEO、网站管理等。这些类型的工作通常要求极高，现实情况是你无法完成所有这些职责。所以我会避免这样的工作。对于你的第一个角色，我将尝试在描述中查找专门关注SEO日常任务的职位列表。简而言之，SEO代理的职业道路你可能想知道SEO实习生/研究生阶段之后的典型职业道路是什么以下是机构的典型进展示例：SEO实习生/毕业生>SEO高管>SEO经理>SEO总监>SEO主管下面是我建议的进入高级职位的五年职业道路：第1阶段 — 加入一家小机构。一到两年。第2阶段 — 加入一家更大的机构或进入内部。两到三年。第3阶段 — 晋升到高级职位（经理、主管或部门主管）。步骤6. 准备面试并获得邀请在疫情爆发之前，采访总是在公司办公室进行。然而，如今许多采访都是通过视频会议进行的。我的面试技巧如下：安装流行的视频会议软件 –下载Microsoft Teams、Zoom和Google Meet。然后提前熟悉界面。（避免出现“对不起，我当时处于静音状态”的情况！）运行测试通话，检查麦克风和网络摄像头是否正常工作，房间是否光线充足。如果你使用的是无线耳机，请确保它们已正确充电。看起来很专业 – 如果你有两个屏幕，记得把相机放在屏幕上，以避免看起来你没有注意到招聘经理在说什么。做好接受任务的准备 – 由于搜索引擎优化中的算法可能会发生很大变化，许多招聘经理都在寻找经验型学习者，或者更简单地说，寻找能够“通过实践”学习的人。请注意，一些招聘经理可能会为你设置任务查看公司的网站 – 事先快速浏览公司的网站并查看其最新的社交媒体帖子，这意味着你知道公司的重点是什么。在谷歌上查看SEO面试问题 – 事先在谷歌上搜索一下“SEO面试问题”也可以帮助你了解面试中可能遇到的问题类型。提问 – 面试结束时，招聘经理会问你是否还有关于该职位的问题。这是一个很好的机会，可以问你需要多长时间才能收到他们关于你是否成功的反馈。每次面试都不一样。但就面试中可能会问到的问题而言，标准面试通常有三个部分介绍。“请告诉我你的简历”“在 X 网站的搜索引擎优化策略方面，你会怎么做?”(该网站通常是公司自己的网站或客户的网站。)如果招聘经理不确定你对SEO某方面的知识，那么他们可能会选择围绕这个主题提问。例如:“你提到你优化了网站的网站速度和核心网页指标”。你是怎么做到的？”如果你被拒绝，不要气馁。这只是正常过程的一部分，将帮助你2学习和发展技能。要知道，你很可能在第一次面试时就找不到工作。最后的想法收到一份工作邀请可能是一个令人兴奋的时刻。但重要的是要保持冷静，审查合同的所有细节，以确保一切都是正确的和讨论。如果你不习惯审查合同，我建议你找一位家庭成员或朋友来检查一下细节。要优先检查的显然是你的姓名、地址、薪水、工作地点和工作时间。在搜索引擎优化的工作可以高度竞争在第一。但是一旦你有了一些基本的经验，你就可以很快地晋升。(不仅在办公室里，在谷歌上也是如此。)我希望这本指南对你有所帮助，最终你能得到这份工作。(如果你知道就告诉我!)还有问题吗？在推特上给我发消息。🙂译者，John Zhao，西品东来创始人 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Chris Haines Chris 是一名 SEO 总监，在 SEO 代理方面拥有 10 年的经验。 不参与 SEO 时，他喜欢摆弄老式合成器、在沙滩上散步和喝杯好茶。",
  "headers": [
    {
      "level": "H1",
      "text": "如何找到一份SEO工作"
    },
    {
      "level": "H2",
      "text": "步骤1. 学习SEO基础知识（不，你不需要上大学）"
    },
    {
      "level": "H3",
      "text": "技能1. 自信使用Excel或Google表"
    },
    {
      "level": "H3",
      "text": "技能2. 能够使用流行的SEO工具"
    },
    {
      "level": "H3",
      "text": "技能3. 了解关键词研究的原理"
    },
    {
      "level": "H2",
      "text": "步骤2. 建立自己的网站"
    },
    {
      "level": "H2",
      "text": "步骤3. 熟悉Google搜索必需品（以前是网站管理员指南）"
    },
    {
      "level": "H2",
      "text": "步骤4. 让你的SEO简历从人群中脱颖而出"
    },
    {
      "level": "H3",
      "text": "提示1. 坚持要点，并将最重要的细节保留在第一页上"
    },
    {
      "level": "H3",
      "text": "提示2. 使用设计工具创建专业的简历"
    },
    {
      "level": "H3",
      "text": "提示3. 使用专业电子邮件地址"
    },
    {
      "level": "H3",
      "text": "提示4. 避免简历陈词滥调"
    },
    {
      "level": "H2",
      "text": "步骤5. 在SEO机构申请工作"
    },
    {
      "level": "H2",
      "text": "步骤6. 准备面试并获得邀请"
    },
    {
      "level": "H2",
      "text": "最后的想法"
    }
  ],
  "author": "Chris Haines"
}