{
  "url": "https://ahrefs.com/blog/zh/how-many-seo-keywords/",
  "slug": "how-many-seo-keywords",
  "title": "一个页面应该真正定位多少个 SEO 关键字？",
  "description": "只选择一个主要关键字和足够的次要关键字来完整涵盖给定主题, 这是原因和方法。",
  "content": "Mateusz Makosiewicz Ahrefs 的营销研究员和教育家。 Mateusz 在推广代理、SaaS 和硬件业务领域拥有超过 10 年的营销经验。平时喜欢创作音乐或享受长距离的散步。 内容 下面是我们的建议: 只选择一个主要关键词和足够的次要关键词来完全覆盖给定的主题。在本文的其余部分，我将解释原因和方法。内容主要关键词与次要关键词接下来，我们将区分两种关键词。主要关键词(也称为 target 关键词)是页面的主题。它也是优化页面的唯一关键词。次要关键词是与你的页面所针对的主要关键词密切相关的任何关键词。同义词、副主题和长尾关键词变体可以被认为是次要关键词。但是 SEO 中次要关键词的最佳用法是作为相关的子主题ーー这就是我将在本文中关注的内容。因此，总结差异，如果主要关键词是书的主题，你可以使用次要关键词作为子主题。为什么一个主要关键词就足够了至少有三个原因。原因1: 任何页面都需要一个明确定义的主题听起来很明显，但是对这个想法的一个令人满意的解释很快就会变得复杂。我们最好从用户体验的角度来看待这个问题。既然人们在网上寻找特定的东西，那么让他们在关于多个东西甚至更糟的东西，在所有东西的网页上寻找这些东西就不是一个好主意了。因此，针对多个主题的单个页面将不那么有用。由于谷歌的存在是为了帮助人们找到特定的东西，它可能会显示一个有特定焦点的页面，也就是最相关的那个，而不是一个试图同时对多个不同主题进行排名的页面。维基百科是一个包含所有内容的网站，但这仅仅是因为每个页面都是关于特定内容的。想象一下，如果看到的是它的主页，而不是这个查询“table football”的页面，那将是多么的无益原因2: 谷歌善于捕捉相近的变体和拼写错误你有没有注意到当你在谷歌上拼错了什么东西会发生什么？谷歌会像语法老师一样纠正你，因为你在输入搜索词的时候可能想到了别的东西。但是近义词和同义词呢？一样。谷歌将排名你的网页的关键词具有相同的意义和意图，而不必你有意识地针对每一个单一的变化。它知道人们用不同的方式寻找同样的东西。为了说明这一点，让我们比较一下“向搜索引擎提交网站”和“向搜索引擎提交网站Ahrefs关键词分析”中的 SERP 比较告诉我们，这两个关键词的结果几乎相同。理由3: 如果你优化了一个关键词，你就可以对数百个关键词进行排名根据我们的研究，平均排名第一的网页也将排在前10位的近1000个其他相关的关键词。这不仅仅适用于大容量的关键词，即使是不太流行的关键词，模式也是一样的。一个恰当的例子: 我们关于seo basics (SEO基础)文章针对单个关键词进行了优化，每月有1,400次搜索。这篇文章现在有463个关键词，其中156个进入了前10名。其中一些关键词一开始听起来并不像是近似的变体:“seo basics”“how to use seo” “beginner’s guide to seo”“getting started with seo”“search engine optimization how to”“seo knowledge”“seo fundamentals”然而，在谷歌眼中，它们可以通过相同或类似的页面“服务”。这里最好的部分是，所有的关键词带来的流量独立。因此，这篇文章针对一个在美国每月搜索量为1400次的关键词进行了优化，估计每月产生8600次访问量。因此，虽然不是针对多个，而是针对一个主要关键词，但如果你合并多个次要关键词，你将获得最佳结果。为什么需要次要关键词简而言之，要完整地覆盖一个主题，你需要相关的副主题。找到相关副主题的最佳方法之一是通过次要关键词。想象一下，谷歌是一家大型书店，你走进去就可以得到最好的园艺初学者指南。如果售货员给你看一份指南，用外行人的语言解释所有其他人似乎满意的基本知识，你肯定会感激不尽。你为什么要看其他的导游呢？用一个过于简单的比喻来说，这就是谷歌的工作方式。系统理解搜索者可能在寻找什么，并试图在保留其他选项的同时提供最有用的结果。如何找到主关键词和次关键词让我们来看看一些实际的方法，以找到大规模的主要关键词和次要关键词。如何找到主要关键词使用这些方法可以找到内容的主题。方法1. 使用关键词研究工具找到一个好的目标关键词的最好方法之一是使用关键词研究工具。一个不仅揭示关键词的想法，而且还提供可操作的搜索引擎优化指标。以下是如何找到一个良好的主要关键词与 Ahrefs 的关键词分析。比方说，你运行一个网站与宠物用品，你认为狗玩具可能是一个很好的话题，你的访问者。你可以:输入种子关键词（“dog toys”）。也可以使用多个种子关键词。转到Matching terms（有相同的词）报告浏览左侧的Parent Topics (父主题)。当你发现一个有趣的主题时，点击它查看属于同一个关键词组的关键词选择关键词，同时权衡 Keyword Difficulty（KD）(关键词难度) 、 Traffic Potential（TP）(流量潜力) 以及对你的网站最有意义的内容（你可以在这个指南中了解有关选择正确关键词的更多信息）。方法2. 在任何利基中查找常见主题使用内容差距机会工具，如Ahrefs的内容差距机会工具，查找某个利基中经常涉及的主题。如果你正在进入一个你不太了解的领域，这是一个很有用的技巧。下面是我们应该做的:转到Ahrefs 的网站分析打开内容差距机会工具输入内容相似的网站的网址，并确保最后一个输入栏清晰点击显示关键词你还可以使用筛选器来优化列表。例如，只显示最常见的关键词(Intersect filter) ，最小流量为100，最大关键词难度(KD)为20。方法3. 分析竞争对手的关键词此方法将显示你的竞争对手排名的关键词(或你希望分析的任何其他网站)。在此基础上，你也可以选择适合你网站的关键词。下面是使用“网站分析”的流程简介：输入竞争对手的网站地址。转到自然关键词报告。细化关键词列表，使其符合你的心意。例如，你可能希望发现包含特定单词或短语的关键词。如何找到次要关键词使用这些方法查找内容的相关子主题。方法1. 查找顶级页面的次关键词一旦你发现了排名靠前的内容的次要关键词，你就会对你的内容中包含的副主题有一个很好的概念。以下是如何在关键词分析中找到它们:输入要分析的主题，最好是要针对的主关键词转到Related terms（有相关词的）报告将切换设置为 Also rank for（同时有排名的）和 Top 10 （前10名）查看结果并为页面选择听起来不错的子主题的关键词专家提示谷歌试图避免对没有任何新意的内容进行排名。因此，明智地使用竞争对手的分析。了解满足搜索者期望所必需的信息类型，但一定要添加一些独特的东西(你自己的研究、独特的视角、更新的数据等等)。方法2. 使用内容差距查找缺少的关键词最后一种方法应该用于提升现有内容。它可以让你通过发现你不喜欢的相关关键词来找到你可能错过的子主题。我们将再次使用Ahrefs的内容差距机会工具。但这次，我们将在最后一个输入中插入一个页面，以与其他页面进行比较。例如，比较关于与狗玩耍的页面，我们可以看到比较页面的作者可以考虑添加一个关于与小狗玩耍的游戏的部分。如何优化关键词的内容如果你想要有效地针对 SEO 的关键词，那么了解如何在内容中使用主关键词和次关键词是非常重要的。这里有一个简短的概述。最重要的是你的主要关键词应该决定搜索意图，这是搜索引擎优化的一个基本方面。为了获得正确的搜索意图，将你的主要关键词插入到 Google 中，查看排名最高的页面，然后确定:主导内容类型–流行类型：视频、文章、登录页、产品页主导内容格式–流行格式：评论、比较、列表、操作指南和基于观点的文章相关内容角度——这是指顶级页面的独特卖点。例如，“最佳”、“免费”、“5分钟内”、“2023年”等。通过分析“学钢琴”的搜索结果页面，我们发现主要的类型是文章，格式是指南，有用的角度是: 对于初学者，最好的方式，2022年，对于成年人。接下来，如前所述，你需要完整地覆盖你选择的主题。这里有一个快速提醒: 你的主要关键词是主题，而你的子主题可以来自相关的次要关键词。但是并不是所有相关的副主题都会被关键词研究所揭示。查看排名靠前的页面的结构，从而了解搜索者可能在寻找什么，这总是一个好主意。为了使工作更加容易，得到我们的Ahrefs SEO工具栏，让它为你工作的结构。当我们在内容中使用关键词时，让我们解决几个“不要”：不要用关键词填充你的内容 — 你不需要尽可能多地提及你的关键词，也不需要以某种关键词密度或统计重要性得分为目标不要试图“强行输入”同义词和密切相关的关键词（也称为LSI关键词）- 谷歌不会因为你用了比其他页面更多的词来描述同一件事就把你的内容排得更高。最后，这是一个好主意:在标题中插入你的目标关键词 – 标题标签有助于谷歌了解内容内容将H1标记与标题对齐 – 这里最简单的做法是使H1和标题标记相同在H2–H6标题中使用次要关键词 – 但前提是它对正文很自然。这可以帮助谷歌了解你的页面内容在URL中使用主关键词 — 这不是要求，只是帮助谷歌和搜索者了解页面上下文的最简单方法。这些是最基本的。如果你有兴趣学习更多，看看如何做 SEO 的关键词优化(3个步骤)。最后的想法让我们用一个方便的应该做和不应该做的列表来概括这篇文章。有问题吗？在Twitter或Mastodon上Ping我。译者，John Zhao，西品东来创始人 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Mateusz Makosiewicz Ahrefs 的营销研究员和教育家。 Mateusz 在推广代理、SaaS 和硬件业务领域拥有超过 10 年的营销经验。平时喜欢创作音乐或享受长距离的散步。",
  "headers": [
    {
      "level": "H1",
      "text": "一个页面应该针对多少个 SEO 关键词？"
    },
    {
      "level": "H2",
      "text": "主要关键词与次要关键词"
    },
    {
      "level": "H2",
      "text": "为什么一个主要关键词就足够了"
    },
    {
      "level": "H3",
      "text": "原因1: 任何页面都需要一个明确定义的主题"
    },
    {
      "level": "H3",
      "text": "原因2: 谷歌善于捕捉相近的变体和拼写错误"
    },
    {
      "level": "H3",
      "text": "理由3: 如果你优化了一个关键词，你就可以对数百个关键词进行排名"
    },
    {
      "level": "H2",
      "text": "为什么需要次要关键词"
    },
    {
      "level": "H2",
      "text": "如何找到主关键词和次关键词"
    },
    {
      "level": "H3",
      "text": "如何找到主要关键词"
    },
    {
      "level": "H4",
      "text": "方法1. 使用关键词研究工具"
    },
    {
      "level": "H4",
      "text": "方法2. 在任何利基中查找常见主题"
    },
    {
      "level": "H4",
      "text": "方法3. 分析竞争对手的关键词"
    },
    {
      "level": "H3",
      "text": "如何找到次要关键词"
    },
    {
      "level": "H4",
      "text": "方法1. 查找顶级页面的次关键词"
    },
    {
      "level": "H4",
      "text": "方法2. 使用内容差距查找缺少的关键词"
    },
    {
      "level": "H2",
      "text": "如何优化关键词的内容"
    },
    {
      "level": "H2",
      "text": "最后的想法"
    }
  ],
  "author": "Mateusz Makosiewicz"
}