{
  "url": "https://ahrefs.com/blog/zh/how-to-use-ahrefs/",
  "slug": "how-to-use-ahrefs",
  "title": "如何使用 Ahrefs：11 个适用于初学者的使用示例",
  "description": "想知道如何使用 Ahrefs 来改善您的 SEO？查看这 11 个简单但可操作的示例。",
  "content": "Tim Soulo Tim是Ahrefs的CMO以及产品顾问，同时他也是该公司最狂热的粉丝和最忠诚的传播者。 内容 Ahrefs 中有许多工具和功能可以帮助提高你的 SEO/营销工作。 但对于一个纯新手来说，我们的 SEO 平台可能需要时间适应。因此，如果你缺乏使用 Ahrefs 等 SEO 工具的经验，我选择了 11 个简单且超级可操作的用例，你可以立即尝试并从中获得价值。如下：查看你的竞争对手获得了多少搜索流量了解哪些页面为你的竞争对手带来了搜索流量研究人们在 Google 中搜索的内容衡量一个主题的完整搜索流量潜力查找影响你网站在 Google 中的性能的关键 SEO 问题预估任意关键词的排名难度找出你的竞争对手从哪里获得外链发现竞争对手的“可链接资产”监控数千个关键词的排名进度找出内容策略中的差距在几秒钟内找到数百个优质链接潜在客户1. 查看你的竞争对手获得了多少搜索流量每个企业主都想知道他们的竞争对手的表现。他们的流量比我多吗？他们的流量是在增长，还是达到了瓶颈期？我会以目前的增长率击败他们，还是应该更努力地工作？Ahrefs Site Explorer（网站分析）通过向你展示你的竞争对手获得了多少搜索流量，并允许你根据自己的搜索流量进行基准测试，来帮助你回答这些问题。从上面的屏幕截图中可以看出，我们自己的网站 (ahrefs.com) 每月从 Google 搜索中获得超过 100 万次访问。 回到 2019 年，我们在自然搜索流量方面超过了我们的主要竞争对手之一 (moz.com)。但是，有两个重点：Ahrefs 只报告网站的搜索流量。 它不考虑直接流量、推荐流量、或来自社交网络的流量等。Ahrefs 中的流量数字是预估值。 这些预估通常与你在 Google Search Console 中看到的实际数字有很大差异。 但是这种差异应该在一个利基中的所有网站上保持一致。让我举一个例子来更好地解释第二点。根据 Google Search Console，假设 Ahrefs 显示的搜索流量比真实的少 20%。 这意味着你的竞争对手的流量也是少 20%。你知道吗？在 AuthorityHacker 人员最近的一项研究中，Ahrefs 的流量预估是所有主要 SEO 平台中最准确和最一致的。2. 了解哪些页面为你的竞争对手带来了搜索流量在确定竞争对手获得了多少搜索流量后，下一步是研究他们的哪些页面占了大部分流量。Ahrefs Site Explorer（网站分析）可以立即为你解答。 只需打开 Top pages（热门页面）报告，你就会看到一个按竞争对手获得的搜索流量排序的页面列表。例如，这个博客的所有搜索流量的 33.3% 来自五篇文章：通过研究表现最佳的页面，你可以深入了解竞争对手的营销和业务策略：哪些页面带来了大部分搜索流量？与其他页面相比，他们的主页有多少搜索流量？他们的产品页面获得了多少搜索流量？他们的页面针对购买漏斗的哪些阶段？研究什么对你的竞争对手有用，将帮助你在规划自己的策略时做出更好的营销决策。3. 研究人们在 Google 中搜索的内容增加来自 Google 的流量的关键之一是研究你所在行业的热门搜索。 这是为了确保你将创建有关大多数人正在搜索的内容。 在 SEO 中，我们称之为关键词研究。Ahrefs Keywords Explorer（关键词分析）可让你衡量任何搜索词的受欢迎程度，并帮助你发现数千个你可能想要定位的相关关键词。例如，仅在美国，关键词 “bitcoin” 每月平均获得 650 万次 Google 搜索。 其全球搜索量为每月 2500 万次。如果你在加密货币领域拥有一个网站，我相信你不会梦想在关键词 “bitcoin” 上进行排名。毕竟竞争太激烈，几乎不可能为该关键词排名。但是，有大量搜索词中包含 “bitcoin” 一词，即使是一个全新的网站也可能对其进行排名。Keywords Explorer（关键词分析）中的 Matching terms（匹配词）报告为你提供了多达 558,968 个包含 “bitcoin” 的关键词，这些关键词按其每月搜索量排序：你知道吗？Ahrefs 拥有最大的美国搜索词数据库。 截至 2021 年 10 月，它包含超过 40 亿个关键词（每月增加数百万个新搜索词）。你可能还想查看 Keywords Explorer（关键词分析）中的 Related terms（相关词）报告，该报告向你显示与 “bitcoin” 一词相关的关键词，但不一定包含该词：4. 衡量一个主题的完整搜索流量潜力在选择要定位的关键词时，我们倾向于将其每月搜索量视为它们可能为我们带来多少搜索流量的指标。但是单个关键词的搜索量可能会产生误导。 这是因为网页永远不会仅针对一个关键词进行排名。根据我们自己的研究，在某些关键词上排名第一的页面也会在大约一千个其他类似关键词上获得排名，并从这些关键词中获得流量。例如，让我们看一下关键词 “submit website to search engines”。根据 Keywords Explorer（关键词分析）的数据，它在美国每月只有 450 次搜索。但是如果我们向下滚动到 SERP overview（SERP 概览）报告，我们会看到这个关键词的排名第一的页面（恰好来自这个博客）仅在美国就获得了 5,893 次访问，并且总共有 1,224 个关键词的排名。以下是它排名第一并从中获得流量的一些 “额外” 关键词：如你所知，“submit website to search engines” 只是不同措辞的众多方式之一。 如果你的页面碰巧在此搜索查询中排名靠前，那么同样也会在类似关键词中排名靠前，并且也会从所有这些变体中获得搜索流量。这就是为什么，你不要仅根据单个关键词的搜索量来做 SEO 决策。你应该养成检查排名靠前的页面，并查看它们从该搜索词的所有变体中获得的总搜索流量。在 Ahrefs Keywords Explorer（关键词分析）中，我们实际上有一个方便的指标，称为 Traffic potential（流量潜力）。该指标显示目标关键词排名第一的页面总共获得了多少流量，这通常比该关键词的搜索量更具洞察力和可操作性。5. 查找影响你网站在 Google 中的性能的关键 SEO 问题谷歌有一个令人生畏的建议清单，网站管理员必须遵循这些建议才能让他们的网站吸引 Google 的注意。 如果你心爱的网站，及其所有有用的信息由于一堆讨厌的技术性 SEO 问题而没有获得应有的搜索流量，那就太遗憾了。Ahrefs Site Audit（网站诊断）将有助于确保不会发生这种情况。 它将扫描你的网站以查找 120 多个常见的 SEO 问题，并提供有关如何解决这些问题的详细建议。你还可以设置定期网站审核，并随着时间的推移，监控你的 SEO Health score（健康评分）。 当你的公司中有很多人可以对你的网站进行更改并且在这样做时可能会意外破坏某些内容时，这尤其有用。6. 预估任意关键词的排名难度有些关键词非常容易排名，而其他关键词则几乎无法获得排名——即使对于大型、权威的网站也是如此。 但是你怎么知道哪个是哪个？在 Ahrefs Keywords Explorer（关键词分析）中，我们有一个方便的指标，称为 Keyword Difficulty（关键词难度 KD）分数。 它按照从 0 到 100 的等级对每个关键词进行评分，后者是最难排名的。正如你在上面的屏幕截图中看到的，关键词 “marketing” 的 KD 得分为 79，这被认为是“超级难”。还有一个简短的解释，就在这个数字的正下方：我们估计你需要来自大约 329 个网站的外链才能在参与关键词的前 10 的排名。让我们逐句分解它，因为它解释了我们的 KD 指标的工作原理。 “我们估计”——我们的 KD 指标只是一个预估值。 Google 使用数百种不同的排名因素，这些因素因搜索词而异。 没有任何工具可以 100% 准确地预测关键词的排名难度。 “你需要来自大约 329 个网站的外链”——我们知道来自其他网站的外链是谷歌最重要的排名信号之一。 除非你获得与它们一样多（或更高质量）的外链，否则你的排名不太可能超过排名靠前的页面。 “排名进入前 10 名”——我们无法预测你的某个关键词是否一定是排名第一。 但进入前 10 名的排名更容易预测。话虽如此，我们不建议客户仅根据这个简单的两位数来做出重要的 SEO 决策。 关键词的真正排名难度比这复杂得多。Ahrefs 的 KD 指标在过滤数千个关键词创意并找到所谓的 “简单的” 关键词时非常有用。例如，Ahrefs 的数据库中有近 200 万条搜索词包含 “marketing”。 但其中只有 29,000 词的 KD 分数低于 5（即很容易排名）。但是不要太迷恋低 KD 的关键词。 如果某些关键词的 KD 分数很高，这并不意味着你不应该为它排名。 这只是意味着需要大量工作才能对其进行排名。 毕竟，你越早开始努力，你就会越早到达那里。7. 找出你的竞争对手从哪里获得外链SEO 专业人员最常见的工作之一是，找出排名靠前的页面是从哪里获得外链的（以及如何为自己的页面获得相同的外链）。在这种情况下，Ahrefs Site Explorer（网站分析）绝对是必不可少的工具。 只需获取你想要的关键词排名第一的页面，将其 URL 插入工具，然后转到 Backlinks（外链）报告。例如，有 526 个页面（来自独特的网站）通过以下链接链接到关键词 “SEO training course” Google 排名第一的结果：我们在 Ahrefs 有自己的 “SEO Training Course”，我们真的希望它在相应的搜索词中在 Google 中排名靠前。 因此，能够找到所有链接到我们的 SEO 竞争对手的页面是非常有价值的。然后，我们需要联系这些页面的所有者，并提出理由将我们的 SEO 培训课程包含在他们已经提到的课程旁边。 如果我们设法从他们的页面获取链接，它将帮助我们在该关键词上排名更高。你知道吗Ahrefs 拥有最大的实时链接数据库。 我们付出了很多努力，经常重新抓取我们的整个外链索引，以便我们的数据始终保持最新。 此外，我们不会报告不再存在的链接。8. 发现竞争对手的“可链接资产”如果你想提高你网站在 Google 眼中的权威性，你必须发布其他人想要从他们自己的网站进行链接的内容。但是，你如何知道你所在行业的人可能会与哪些人建立联系？简单！ 只需研究排名最靠前的竞争对手的网站，看看他们的哪些页面吸引了最多的链接。 你可以通过将他们的网站插入 Site Explorer（网站分析）并访问 Best by links（按反链数量排序） 报告来做到这一点。例如，以下是此博客上链接最多的页面：如你所见，Ahrefs 博客（不包括我们的博客主页）上链接最多的前 5 篇文章中有 3 篇是数据研究。 这表明数据研究是吸引数字营销和搜索引擎优化行业人们加入链接的原因。在你的排名靠前的竞争对手的网站上尝试一下，我相信你会发现一些吸引你所在行业外链的页面（或资源）类型的模式。你知道吗Ahrefs 拥有活跃度仅次于 Google 的网络爬虫，这使我们能够比任何其他 SEO 工具更快地发现新的外链并将其添加到我们的数据库中。9. 监控数千个关键词的排名进度即使是新站，你的网站也很有可能在 Google 中针对一堆关键词进行排名。 它可能不一定排在首页，但它可能在其他页面上。Site Explorer（网站分析） 中的 Organic keywords（自然关键词）报告将向你显示网站在 Google 中排名的几乎所有关键词。例如，即使是我废弃已久的个人博客仍然在一堆关键词中排名第一：如果我单击 “Position history” 按钮，我可以轻松查看这些关键词中的任何一个的整个排名历史记录：以类似的方式，你可以将竞争对手的网站插入Site Explorer（网站分析），并查看他们排名的关键词，以及他们的排名历史。如果你有想要密切关注的最重要关键词列表，你可以将它们添加到 Ahrefs Rank Tracker（排名监控）中。10. 找出内容策略中的差距内容策略中的 “差距(gap)” 是指，你的竞争对手都在为给他们带来大量有价值流量的重要关键词进行排名，而你自己的网站没有任何针对这些关键词的页面。为了帮助你解决这个问题，我们在 Site Explorer（网站分析） 中有一个名为 “Content Gap（内容差距机会）”的报告。 它寻找所有竞争对手都排名、但你没有的关键词。以下是在我们自己的博客和我们竞争对手的三个博客之间运行报告的结果：正如你所看到的，我们的两三个竞争对手中的有相当多的高搜索量关键词，而我们自己的博客却没有。尝试对自己的一些竞争对手做一些检测，看看你是否可以找到一些你希望在自己的网站上定位的重要话题。11. 在几秒钟内找到数百个优质链接的潜在客户假设你正在为一个作业辅助APP进行 SEO。 获取内容中体积 “productivity app” 一词的所有网站的列表对你来说岂不是很有用？ 你可以联系他们，并尝试协商并从他们的网站获取链接，对吗？嗯，这正是 Ahrefs Content Explorer（内容分析）可以为你提供的帮助。 只需搜索 “productivity app”，你就会获得超过 78,000 个页面的列表，这些页面在其内容的某处提到了这个短语。但你可能不需要那么多。 不用担心。 你可以在Content Explorer（内容分析）中使用一堆过滤器将该列表修剪为仅最佳的结果：Domain rating（引用域）: 40 到 90网站流量: 1k 起语言: English排除子域名排除首页一个域名一个链接过滤显式结果这些过滤后 78,000 页，只剩下 3,000 页。 如果你需要进一步缩小链接潜在客户列表，你可以随时进一步加强过滤。最后以上，是针对 SEO 新手选择的 Ahrefs 的 11 个最简单和最可操作的示例列表。大多数示例都是基础操作，但这并不意味着它们是无效的。 如果你将它们付诸行动，你会发现自己可以走很远。有任何问题吗？ 请随时在 Twitter 上 ping 我们。译者，Park Cheng，歪猫出海创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Tim Soulo Tim是Ahrefs的CMO以及产品顾问，同时他也是该公司最狂热的粉丝和最忠诚的传播者。",
  "headers": [
    {
      "level": "H1",
      "text": "如何使用 Ahrefs：11 个适用于初学者的使用示例"
    },
    {
      "level": "H2",
      "text": "1. 查看你的竞争对手获得了多少搜索流量"
    },
    {
      "level": "H2",
      "text": "2. 了解哪些页面为你的竞争对手带来了搜索流量"
    },
    {
      "level": "H2",
      "text": "3. 研究人们在 Google 中搜索的内容"
    },
    {
      "level": "H2",
      "text": "4. 衡量一个主题的完整搜索流量潜力"
    },
    {
      "level": "H2",
      "text": "5. 查找影响你网站在 Google 中的性能的关键 SEO 问题"
    },
    {
      "level": "H2",
      "text": "6. 预估任意关键词的排名难度"
    },
    {
      "level": "H2",
      "text": "7. 找出你的竞争对手从哪里获得外链"
    },
    {
      "level": "H2",
      "text": "8. 发现竞争对手的“可链接资产”"
    },
    {
      "level": "H2",
      "text": "9. 监控数千个关键词的排名进度"
    },
    {
      "level": "H2",
      "text": "10. 找出内容策略中的差距"
    },
    {
      "level": "H2",
      "text": "11. 在几秒钟内找到数百个优质链接的潜在客户"
    },
    {
      "level": "H2",
      "text": "最后"
    }
  ],
  "author": "Tim Soulo"
}