{
  "url": "https://ahrefs.com/blog/zh/how-to-increase-website-authority/",
  "slug": "how-to-increase-website-authority",
  "title": "如何提升网站权威性（域名评分）",
  "description": "了解什么是网站权威性，如何计算域名评分（DR）以及如何以正确的方式增加该分数。",
  "content": "Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。 内容 如果你想在谷歌中排名更高，并获得更多的网站自然流量，那么你可能已经知道提高网站权威性就是最好的解决方案。事实是，虽然增加网站权威性从来不是一件坏事，但提高分数本身不应该成为你工作的重点。相反，你应该关注是什么让得分上升的：来自权威网站的高质量的外链。在本指南中会学到：什么是网站权威性（域名评分）它是如何计算的如何提高域名评分（正确的方式）https://www.youtube.com/watch?v=cl1Ch9ARdQs什么是网站权威性（域名评分）网站权威性是SEO工具常用的指标。它是用来衡量一个网站的外链相对于其它网站的外链的强度的指标。几乎每个热门的SEO工具都有此指标，但是每个指标的名称和计算方式都不同。在Ahrefs，我们将网站权威性指标叫做 Domain Rating （域名评分）。和其它工具的指标类似，它是一个0–100的数值。小提示. 你可以通过我们的免费的 website authority checker（网站权威检查）来查看。 现在，你必须了解是DR是对数指标。DR 69–70 要比 9–10 更据有挑战性。你可以把这个想像成一个电子游戏。最开始你可能是 “青铜”，你可能需要花费几个小时才能到 “白银”。但是再往上，你可能需要消耗数月的时间。最后，只有极少数的玩家才能达到 “最强王者”。同时，对数指标还意味着 DR 20 站点的 “权威性” 是 DR 10 站点的两倍以上。Domain Rating （域名评分；权威性）是如何计算的在尝试增加网站权威性之前，你需要知道权威性是如何计算的。先让我们来看下影响 Domain Rating（域名评分）的三大要素：有多少个网站指向了你的站点指向你的网站的DR（域名评分）反链域名网站指向其它网站的数量1. 有多少个网站指向了你的站点在 Ahrefs 中，我们有一个叫做 referring domains（反链域名）的指标。记录的是有多少个网站指向了你的网站 / 页面。只要你使用 Site Explorer（网站分析）就可以看到这个数据。很多人都会认为这个数值越高，Domain Rating（域名评分）就会越高。但是并非如此。因为在计算DR时，我们只会计算 Dofollow链接。UGC、赞助、或是 nofollow 链接并不会提高DR。同样，如果有很多链接来自同一个网站，也不会提升DR，应为我们计算的是 referring domains（反链域名）数量而不是外链数量。2. 指向你网站的网站DR任何人都可以从大量的低质量网站中获取成百上千个链接。这就是为什么我们也会将这些来源网站的 DR（域名评分）纳入计算。这意味着，来自高DR网站的外链比来自低DR网站的外链可以更好的提升你网站的 Domain Rating（域名评分）。这个很有意思，因为随着来源站点的DR分数的提高，你的网站DR也会随之提高。比如，你从 DR 15 的网站获得了外链。然后这个来源站的站长也在优化、不停的获取优质的链接。在一年内，将 DR 提升到了40。尽管你只从他的网站获得过1条外链，但是你的DR也会随之提升。这里的重点是，只要是有潜力的网站，即使最开始DR比较低也是值得获取链接的。如何评判“潜力”呢？首先，检查其内容。如果对方发布了高质量的内容，那么随着时间的推移，他们更有可能自然地吸引高质量的外链。其次，在 Ahrefs Site Explorer（网站分析）中查看对方网站的数据趋势。如果对方的 referring domains（反链域名）是随着时间一点点增长的，那么很可能接下来也会不断增长。3. 反链域名网站指向其它网站的数量假设现在你获得了两个 “dofollow”的外链，分别来自 The Guardian 和 IMDB。 两个站点都拥有相近的DR分数，那么哪个网站可以更好的提升你网站的 Domain Rating（域名评分）呢？译者注： The Guardian 是英国的全国性综合内容日报、也称《卫报》。IMDb，互联网电影资料库（Internet Movie Database）是一个关于电影演员、电影、电视节目、电视明星和电影制作的在线数据库。答：这是是根据它们所链接其它网站的数量决定的（至少有一条 dofollow链接）。链接不同的网站越多，每个网站平均分得的DR加成就越少。所以这里我们需要查看 Linked Domains（链接域名）报告，并且只筛选 “dofollow“链接：看上去 The Guardian 比 IMDB 链接到了更多的网站 (272,218 比 5,256)。因此，来自 IMDB 的链接可以更好的提升你网站的 Domain Rating（域名评分）。我们可以看一下这个影响有多大。这个网站只有1个 referring domain（反链域名）来自 IMDB，它的 DR 分数是 34。下面这个网站也有1个 referring domain（反链域名）来自 The Guardian，但是 DR 分数只有 1.5。换句话说，这并不是意味来自 IMDB 的链接比来自 The Guardian 的链接更加权威。一个外链是否优质有很多因素会影响。如何提高 Domain Rating（域名评分）为你的网站获取更多 “Dofollow” 链接，那么你的网站 Domain Rating（域名评分）就会上升，就这么简单。你只需要记住：如果外链网站 DR 偏低、或者它们链接的网站太多，这些都会导致你网站DR分数提升效果不明显。同时，你还需要知道，给随机的页面获取外链并不会一定提升你的排名或是流量。你还是应该针对需要在谷歌参与页面制作外链。这样对提升排名和流量更有帮助，而不是为了提升DR分数而提升。我们之所以知道，是因为我们做过研究。和自然流量最相关的是页面的 referring domains（反链域名）数量，而不是网站的 DR。虽然这么说，但是针对需要排名的页面获取链接并非那么容易。比方说，对于印刷公司，很难使人们链接到它们销售名片印刷的页面，因为用户一般不会这么做。如果你再为此而挣扎……下面是一些可以”值得尝试”的增加网站权威性的方法：创建人们愿意链接的内容和相关、权威的网站建立联系利用内链提升重要页面的权威性1. 创建人们愿意链接的内容这意味着内容需要具有以下三个属性：非广告性质通常人们不会链接到广告页面。这就是为什么营销页或者是分销页很难获得链接的原因。对用户有帮助有两种方法可以创建对用户有帮助的内容。首先，就是创建有效用的的内容。比如博客、计算器、免费工具等等。我们的免费外链检查工具就是一个不错的例子，它已经从1850个 referring domains（反链域名）上获取了外链。其次，创建有引用价值的内容。比如数据表、研究报告、独特的观点等、这些在博主或者是记者在阐述观点时会进行引用。我们的一篇研究 参与谷歌排名需要多久就是不错的例子。它从880多个 referring domains（反向域名）中获得了外链。有获取链接的历史安装 Ahrefs SEO toolbar（Ahrefs SEO工具栏），然后在谷歌中搜索内容话题，然后查看产看排名靠前的 referring domains（反链域名）数量。如果它们有不错的数量，这就意味着这可能是可以能够获取链接的话题。为什么？因为这代表这个话题内容是有获取链接的历史的。虽然这么说，你依然要注意话题的时效性。比如，我们可以看下这个词 “the dress illusion” 排名靠前的页面：首页的这些页面有很多反链域名，但是这个话题是 2015年时一个短期的热门话题。但是如果你现在发布这个话题的内容，可能就很难获得链接。不知道如何寻有效的话题？进入 Keywords Explorer（关键词分析），搜索一个词根，并查看 “All keywords（全关键词）”报告。你可以看到很多根据词根找到的潜在关键词。同时，你还可以在 “Include（包含）”筛选框中加入像 who, what, when, why, how, guide, tool, calculator, stats, statistics, study 这样的词，并选择 “Any word（任意词）“选项：这样你就可以找到很多有效用、有引用价值的话题。最后，通过 Keyword Difficulty（关键词难度）筛选出数值高于40的结果，这样就可以找到有获取链接历史的话题。这里的逻辑是，因为 Keyword Difficulty（关键词难度）是用来衡量关键词首页页面反链域名的平均值，所以 KD 高的关键词意味着它有很多外链。然后在结果中寻找相关、有价值的话题，并且更具搜索意图创建你的内容。2. 和相关、权威的网站建立联系拥有人们愿意建立链接的内容还不够，人们不会链接一个它们不知道的内容。这就是为什么你需要建立联系，并且告知这些人。现在，有很多方法可以找到相关的联系人。这里有三个方向可以开始：你内容中提到的人写过类似话题的人链接到类似话题的人在我们的寻找外推博主指南中学习更多何其它网站建立联系的方法。3. 利用内链提升重要页面的权威性你可以使用上面的方法增加网站的权威性并且改善网站的SEO.。然后你可以使用中间人方法将一些权重导向你想要的页面。最后你不需要为了提升网站权威性去提升。你不如把更多的注意力放在如何从相关高权威网站上获取高质量的链接。. 这时你的 Domain Rating（域名评分）会像植物一样自然成长。虽然这么说，链接并不是唯一的谷歌排名要素。如果你现在目标是在谷歌中排名更高，可以看我们的6步指南.或者，你还没有在第一页排名，可以看如何让网站排名进入谷歌首页 (互动指南).有问题？在 Twitter上找我吧。译者，Park Cheng，魔贝课凡联合创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。",
  "headers": [
    {
      "level": "H1",
      "text": "如何提升网站权威性（域名评分）"
    },
    {
      "level": "H2",
      "text": "什么是网站权威性（域名评分）"
    },
    {
      "level": "H2",
      "text": "Domain Rating （域名评分；权威性）是如何计算的"
    },
    {
      "level": "H3",
      "text": "1. 有多少个网站指向了你的站点"
    },
    {
      "level": "H3",
      "text": "2. 指向你网站的网站DR"
    },
    {
      "level": "H3",
      "text": "3. 反链域名网站指向其它网站的数量"
    },
    {
      "level": "H2",
      "text": "如何提高 Domain Rating（域名评分）"
    },
    {
      "level": "H3",
      "text": "1. 创建人们愿意链接的内容"
    },
    {
      "level": "H4",
      "text": "非广告性质"
    },
    {
      "level": "H4",
      "text": "对用户有帮助"
    },
    {
      "level": "H4",
      "text": "有获取链接的历史"
    },
    {
      "level": "H3",
      "text": "2. 和相关、权威的网站建立联系"
    },
    {
      "level": "H3",
      "text": "3. 利用内链提升重要页面的权威性"
    },
    {
      "level": "H2",
      "text": "最后"
    }
  ],
  "author": "Joshua Hardwick"
}