{
  "url": "https://ahrefs.com/blog/zh/how-to-get-backlinks/",
  "slug": "how-to-get-backlinks",
  "title": "如何获得外链：15种经过验证的策略",
  "description": "链接建设并不是火箭科学。没有什么秘密。任何人都可以做到这一点。",
  "content": "Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。 内容 链接建设并不是火箭科学。没有什么秘密。任何人都可以做到这一点。但是，如果没有经过考验的策略作为依靠，对于新手可能会比较困难。这里有15种经过验证的获得反向链接的方法：摩天楼技术反向摩天楼技术资源页链接建设失效链接建设301重定向链接建设‘Best X in Y’ 列表文章HARO客座博客播客采访未连接的提及寻找链接差距机会获取经销商链接利用现有的会员资源寻找链接合集内部反向链接1. 摩天楼技术摩天楼技术是指你找到有大量反向链接的内容，创造出更好的内容，然后要求所有者链接到你所改进的内容。如何做你首先需要找到有大量反向链接的网页。首先，在 Ahrefs Content Explorer（内容分析）搜索一个与你的主题相关的短语，并将 “referring domains（引用域） “过滤器设置为至少 50 个。这将显示有来自至少 50 多个网站的反向链接的页面。然后就是简单地分析内容，思考如何改进它。这里有一些改进内容的最佳方法。纠正不准确的或误导性的说法。这可以说是改进内容的最佳方式，因为没有人愿意链接到具有误导性的内容。更加深入。如果有关的内容只是略过了主题的表面，那就更深入，更详细地解释事情。解释得更清楚。使用图形、视频或任何你需要的东西可以帮助读者更容易地理解事情。例如，Neil Patel 关于长尾关键词的页面有来自 1.1K 个推荐域的反向链接：但它对长尾关键词的定义是不准确的（而且难以阅读）。提供一个有意义的定义是我们可以改进这个内容的一个简单方法。推荐阅读：如何执行摩天楼策略2. 反向摩天楼技术反向的摩天楼技术是指，你选择已经在你的网站上的一个很好的内容，找到类似的有很多反向链接的低质量的网页，然后请求所有者链接到你的页面。它与 “常规 “摩天楼技术的工作原理相同。其好处是，你不必创建新的内容。如何做为了找到这种策略的最佳机会，把你发表过的行业领先的内容的几个关键词插入 Ahrefs Keywords Explorer（关键词分析），然后按关键词难度（KD）从高到低对结果进行排序。小提示. 关键词难度（KD）是基于当前排名靠前的网页的引用域的数量来计算的。这意味着KD分数高的关键词排名页面很可能有很多反向链接。接下来，点击SERP按钮，寻找有大量反向链接的类似网页。最后，访问这些网页，寻找令人信服的理由，说明你的内容比他们的内容好。如果你找到了，就把你的链接作为替代页面推销给那些链接到该网页的人。你可以使用 Ahrefs Site Explorer（网站分析）中的反向链接报告找到这些人。3. 资源页面链接建设资源页链接建设是指你从策划某一特定主题资源的网页上获得反向链接。这是一个久经考验的策略，因为这些网页的唯一目的是链接到有价值的资源。如何做要找到资源页面，请在谷歌中运行这些搜索，并添加一个与你的主题相关的短语：intitle:resources inurl:resources.htmlintitle:resources inurl:links.html例如，如果你想建立链接到一个关于减肥的资源，你可以搜索intitle:resources inurl:resources.html weight loss.你还可以使用 Ahrefs SEO Toolbar（Ahrefs SEO工具栏）来导出结果及其SEO指标，这样你就可以根据 Domain Rating（DR，域名评分）和估计的搜索流量来确定机会的优先次序。然后，只需访问每个页面，以确保它是一个资源页面，并链接到外部资源。如果它符合要求，找到负责人的电子邮件地址，并推荐你的页面。推荐阅读：资源页链接建设：你唯一需要的指南4. 失效的链接建设失效链接建设是指你在一个页面上找到一个失效链接，就该主题创建你自己的页面，并要求所有链接到该失效资源的人链接到你的页面。它之所以有效，是因为关心自己网站的人不希望把访问者送到失效页面的。如何做有许多方法可以找到有反向链接的失效页面。最简单的方法之一是在 Ahrefs Content Explorer（内容分析）中搜索一个主题，过滤失效的网页，然后设置一个最小值为 10 的 referring domains（引用域）过滤器。这将显示至少有十个网站的反向链接的失效页面。如果你想进一步调查一个页面，请点击圆点，然后点击链接，在 archive.org 上查看它。这将向你展示这个失效页面在消失之前的内容。如果你创建类似的东西是有意义的，回到 Content Explorer（内容分析），点击圆点，并点击进入反向链接报告。你会看到所有链接到失效页面的网站，一旦你的内容上线，你可以把你的替代页面推荐给这些网站的所有者。推荐阅读：失效链接建设简单（但完整）的指南5. 301重定向链接建设301 重定向链接建设是指你找到不相关的 301重定向，并向所有者提供一个合适的替代页面。它的工作原理与失效链接建设的工作原理相同；网站所有者不想把他们的访问者送到失效的页面上。如何做要找到不相关的301重定向，进入 Site Explorer（网站分析），将模式改为 “https”，进入一个利基网站，进入 Best by links（最佳链接）报告，并添加一个 “301重定向” 过滤器：仔细观察 URL，看是否有不相关的重定向。例如，上面的第一个 UR L看起来像是一个关于搜索引擎历史的文章，现在却重定向到一个关于搜索引擎营销的文章。我们可以通过 archive.org 查看该页面历史来确认这一点。这是一个与它现在重定向到的页面完全不同的主题，所以这是一个不相关的重定向，有 698 个 referring domains（引用域）。6. ‘Best X in Y’ 列表文章‘best X in Y’ 列表文章是列出某一特定地区或行业的最佳企业。找到并投递到那些你还没有被介绍的文章，这样可以赢得更多的曝光和反向链接。如何做你可以用这个公式在谷歌上搜索，找到相关的列表： Best BUSINESS TYPE in LOCATION -\"YOUR BUSINESS NAME\".这里有一份伦敦最好的咖啡店名单：根据我们的搜索，有一家企业没有入选，那就是 Omotesando Koffee — 根据谷歌的评价，这是一家顶级的商店。如果你是这个地方的创始人，也许值得联系作者，看看他们是否愿意添加你。这样做时，要记住两件事。你的宣传需要有意义。在第一封邮件中邀请添加链接并不总是有意义的。例如，Omotesando Koffee 不在这个名单上，可能意味着作者从来没有去过他们的店。在这种情况下，他们不太可能因为被要求就把他们加到名单上。你首先需要建立一种关系。以下是我在这种情况下联系作者的方法：Hey [Name],Just came across your list of the best coffee shops in town and noticed my shop, Omotesando Koffee, wasn’t included. Is that because you didn’t like our coffee or haven’t tasted it?If it’s the latter, I’d love to invite you down to taste our stuff (don’t worry, it’s on the house).Are you in the area any time soon?Let me know. [Name]你好 [姓名]。刚刚看到你列出的镇上最好的咖啡店名单，发现我的店 — Omotesando Koffee，没有被包括在内。这是因为你不喜欢我们的咖啡还是没有品尝过？如果是后者，我很乐意邀请你来品尝我们的东西（别担心，我们请客）。你很快会在这个地区吗？期待你的回信。 [姓名]请注意，这封电子邮件并没有要求添加链接；它只是邀请作者品尝我们的产品。在我们赢得他们的支持后，再要求他们加入就容易多了。7. HAROHARO (Help A Reporter Out) 是一项免费服务，将记者与消息来源联系起来。这是一个赚取高质量反向链接的简单方法，因为记者是在向你寻求资源或信息。如何做注册成为信息来源，你就会开始收到各种出版物记者的询问邮件。这将包括来自 Business Insider 和 New York Times 等大型知名网站的咨询。问题是，大多数咨询都是不相关的，所以值得设置一个 Gmail 过滤器来进行梳理。下面如何做：设置搜索过滤器设置 “From” 为 [email protected].设置 “Subject” 为 “[HARO]”设置 “Has the words” 为你要监控的关键词（你可以使用OR运算符在此列出多个关键词）。点击搜索并检查几封电子邮件，以确保你得到相关的结果。如果一切看起来不错，就可以点击 “创建过滤器”。现在是时候开始回应相关咨询了。要知道，并不是所有的记者都会因为你的回答而引用和链接到你。为了获得最好的结果，你应该只在你有相关的专业知识时才回应咨询。如果记者正在寻找多个专家，也值得优先考虑。例如，下面来自 Business Insider 的请求明确指出，他们正在寻找来自多个精英幼儿园的消息。因此，如果你在一家精英幼儿园工作，你可能有很大的机会通过回复这个咨询而得到报道。8. 客座博客客座博客是指你为另一个网站写一篇博文，通常会收到一个返回你的网站的链接作为回报。如何做要找到可能接受客座文章的网站，请到 Content Explorer（内容分析）输入一个与你的利基市场相关的关键词，并将下拉菜单改为 “In title”。这将搜索数十亿页的匹配内容。然后，你可以应用过滤器来缩小结果，并找到要投稿的网站。这些过滤器是一个很好的起点：Domain Rating（域名评分）: 30+. 这可以剔除权重较低的网站。网站流量：5000+ 这就剔除了流量小或没有流量的网站。已发布: 过去的 90 天。这可以剔除那些最近没有发布内容的网站，这些网站可能对投稿没兴趣。你还想切换 “One page per domain（每个域名一个页面）“的方框，因为多次联系同一个网站是没有意义的。如果有太多的网站需要投稿，可以去查看按流量排名前 100 的网站。要特别注意有多个作者的网站，因为这些网站更有可能接受客座文章。例如，Moz 有 182 个关于 SEO 的页面，由 28 个不同的作者撰写，所以有可能其中一些是客座博主。9. 播客采访播客采访是指你作为专家在播客中被介绍，并由主持人提问。每个播客只需花费你一个小时左右的时间，如果你明智地选择它们，基本可以保证会获得反向链接。这是因为大多数播客在他们的网站上都有提及，这些页面几乎总是链接到嘉宾的网站和社交页面。如何做你首先需要找到合适的播客，这可以通过在谷歌上搜索顶级行业播客来实现。大多数结果将是列表式的，而且谷歌也倾向于在搜索结果中显示一个播客轮播。在投稿前，请检查播客的页面，以确保他们与嘉宾的链接。如果你在浏览时发现一个多产的播客采访者（比如我们自己的 Tim Soulo），把他们的主页粘贴到 Ahrefs Site Explorer（网站分析）中，选择 “Exact URL” 搜索模式，进入反向链接报告，过滤参考页面标题中带有 “episode” 的结果，并在结果中筛选出相关的播客来投稿。你可以确信，你用这种方法发现的任何播客都会链接到他们邀请的客人。10. 未连接的提及无链接提及是指人们在网上引用你的品牌（或与你的品牌相关的任何东西）而没有链接到你的网站。他们是链接建设中最容易获取的方法，因为你已经成功了一半。这个人已经熟悉你的品牌，所以要求他们在提到你的时候添加一个链接，往往就足以赢得链接。如何做要找到未链接的提及，请在 Content Explorer（内容分析）中搜索您的品牌并添加-site:yourwebsite.com 以排除来自你网站上的结果。接下来，使用 “突出显示未链接的域名（highlight unlinked domains）” 功能，突出显示没有链接到你的网站的页面，然后导出结果（确保勾选 “Only pages with highlighted domains（只有突出显示域名的页面）”）。在Excel或谷歌表格中筛查结果，并在有意义的地方进行联系。推荐阅读：将（无链接的）品牌提及变成链接的简单指南11. 寻找链接差距机会链接差距分析揭示了链接到多个竞争对手的网站，但不是你。复制这些链接往往很容易，因为如果有人链接到多个竞争对手，他们也可能会链接到你。如何做要进行链接差距分析，将你的主页插入Site Explorer（网站分析）（使用 “Exact URL“模式），进入 Link Intersect（交集链接分析）报告，并在空白区域添加一些竞争性的页面（将这些也设置为 “URL“模式）。仔细查看结果，寻找潜在的可复制链接。例如，下面的网站链接到我们的两个竞争对手。看一下这些链接，我们发现它们都来自于播客的采访。鉴于该主持人已经采访过了我们的两个竞争对手，他们可能也有兴趣采访我们。建议密切关注常见的链接页面类型，因为这可以帮助你找到更多的链接机会。例如，如果你的竞争对手有许多来自播客的链接，就搜索更多的播客并投其所好。12. 获取经销售的链接经销商链接是指来自销售你产品的公司的链接。如果你的产品出现在其网站商，那么这些链接就很容易得到。如何做要找到相关的存货商网页，请找到所有你存货的公司的网站，然后对每个公司进行这样的谷歌搜索：site:brand.com intitle:\"stockists\" OR intitle:\"where to buy\". 如果他们有一个经销商页面，你应该在搜索结果中看到它。下面是该页面的样子：然后，只需联系并要求他们添加你的链接就可以了。13. 利用现有的会员资源你已经加入的组织、社区和俱乐部可以说是链接建设中最容易实现的目标。 这是因为他们通常有团队或顾问委员会页面，如果你提出要求，他们会很乐意提及与给予链接。如何做为了寻找机会，把你参加的所有组织、社区和俱乐部列一个清单。这可以是任何东西，从学校家长咨询委员、再会到当地慈善机构、或法律协会。接下来，找到他们的网站，对每个网站进行谷歌搜索： site:theirwebsite.com intitle:team OR advisory。如果他们有相关的页面，应该会显示出来。在有意义的情况下，联系并要求提供链接。14. 寻找链接合集机会链接合集是一个行业中最好的新内容的清单，通常是过去一周或一个月的内容。这些文章的作者一直在寻找优质新鲜的内容，所以它们是建立新内容链接的一个简单方法。如何做要找到此类文章，请在谷歌上搜索你的话题，然后使用intitle:2022 intitle:\"roundup\" OR intitle:\"round up\".由于没有必要找那先不更新的合集，所以要过滤出三个月内没有更新的搜索结果（工具 > 任何时间 > 自定义范围 > 选择日历上的最后三个月）。最后，查看结果，并选择相关的内容进行联系。15. 内部反向链接内部反向链接是来自同一网站上其他页面的链接。许多 SEO 忽略了内部链接，这是一个很大的错误，因为它们是将 “权重” 输送到需要它的页面的最有力的方式。你还可以完全控制它们 — 毕竟与外部的反向链接不同。如何做要找到那些最能从提升中受益的网页，请寻找那些在目标关键词中排名第 2–4 位的网页。你可以使用 Ahrefs Site Explorer（网站分析）中做到这点。只要插入你的网站，进入 Organic Keywords（自然关键词）报告，然后按排名进行过滤。接下来，在 Site Audit（网站诊断）中进入你的项目，点击 Link Opportunities（链接机会）报告，将你的页面的 URL 粘贴到搜索框中，并将下拉菜单切换到 “目标页面”。小提示. 你需要先建立一个项目，并使用 Site Audit（网站诊断）抓取你的网站。现在你应该看到你的网站上有相关的地方可以添加内部链接到你的页面。推荐阅读：SEO的内部链接：一个可操作的指南最后这些策略中的大多数并不新鲜或令人兴奋，但它们是有效的，这才是最重要的。只是不要试图一下子把它们全部做完。从一个开始，从中学习，完善你的方法，并从那里建立。如果你有任何问题，请 Twitter 上联系我。译者，Park Cheng，歪猫出海创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。",
  "headers": [
    {
      "level": "H1",
      "text": "如何获得外链：15种经过验证的策略"
    },
    {
      "level": "H2",
      "text": "1. 摩天楼技术"
    },
    {
      "level": "H3",
      "text": "如何做"
    },
    {
      "level": "H2",
      "text": "2. 反向摩天楼技术"
    },
    {
      "level": "H3",
      "text": "如何做"
    },
    {
      "level": "H2",
      "text": "3. 资源页面链接建设"
    },
    {
      "level": "H3",
      "text": "如何做"
    },
    {
      "level": "H2",
      "text": "4. 失效的链接建设"
    },
    {
      "level": "H3",
      "text": "如何做"
    },
    {
      "level": "H2",
      "text": "5. 301重定向链接建设"
    },
    {
      "level": "H3",
      "text": "如何做"
    },
    {
      "level": "H2",
      "text": "6. ‘Best X in Y’ 列表文章"
    },
    {
      "level": "H3",
      "text": "如何做"
    },
    {
      "level": "H2",
      "text": "7. HARO"
    },
    {
      "level": "H3",
      "text": "如何做"
    },
    {
      "level": "H2",
      "text": "8. 客座博客"
    },
    {
      "level": "H3",
      "text": "如何做"
    },
    {
      "level": "H2",
      "text": "9. 播客采访"
    },
    {
      "level": "H3",
      "text": "如何做"
    },
    {
      "level": "H2",
      "text": "10. 未连接的提及"
    },
    {
      "level": "H3",
      "text": "如何做"
    },
    {
      "level": "H2",
      "text": "11. 寻找链接差距机会"
    },
    {
      "level": "H3",
      "text": "如何做"
    },
    {
      "level": "H2",
      "text": "12. 获取经销售的链接"
    },
    {
      "level": "H3",
      "text": "如何做"
    },
    {
      "level": "H2",
      "text": "13. 利用现有的会员资源"
    },
    {
      "level": "H3",
      "text": "如何做"
    },
    {
      "level": "H2",
      "text": "14. 寻找链接合集机会"
    },
    {
      "level": "H3",
      "text": "如何做"
    },
    {
      "level": "H2",
      "text": "15. 内部反向链接"
    },
    {
      "level": "H3",
      "text": "如何做"
    },
    {
      "level": "H2",
      "text": "最后"
    }
  ],
  "author": "Joshua Hardwick"
}