{
  "url": "https://ahrefs.com/blog/zh/how-to-improve-seo/",
  "slug": "how-to-improve-seo",
  "title": "如何改进 SEO：提高排名和流量的 15 种策略（不需要新内容）",
  "description": "这些经过考验的真实策略非常适合改善您的搜索引擎优化和提高排名，并且不需要你创建新内容。",
  "content": "Si Quan Ong 营销@Ahrefs。 我爱阅读，爱跳霹雳舞，爱尝试随机的生活实验。 内容 SEO 是一个长期的游戏但这并不意味着没有任何改善搜索引擎优化的机会。 以下策略不仅可以提高你的排名，而且不需要你去创建新内容。让我们来看看它们。内容1. 在排名靠前的页面上获得更多点击标题标签是搜索者最先看到的东西之一:使其具有吸引力可以吸引他们选择你的网页，而不是其他的搜索结果页面。然而，优化搜索者看不到的页面的标题标签是没有意义的。 因此，我们希望重点关注排名已经较高的页面，特别是排名#2–5 的页面。以下是找到它们的方法:转到 Ahrefs 的网站分析输入你的域名转到热门页面报告将排名过滤器设置为2–5然后我们可以使用 ChatGPT 作为灵感来创建引人注目的标题标签。例如，让我们要求它为这篇博客文章创建10个值得点击的标题。为了得到最好的效果，我会给它一个工作标题，并要求它将这些标题限制在最多60个字符(因为谷歌删除了标题标签以外的字符)。相当不错。 使用下面文章中的策略，我们可以让它变得更好。延伸阅读如何制作完美的搜索引擎优化标题标签(我们的4步过程)如何提高点击率: 9个尝试和测试过的技巧2. 随着流量的减少而刷新内容在 Ahrefs，我们每季度都会进行一次内容审核。 在一项此类审计中，我发现我们关于免费 SEO 工具的帖子的自然流量正在下降。所以我更新了它。 然后流量猛增。找到值得更新的内容的最简单方法是安装我们的免费 WordPress SEO 插件并运行内容审计。这将告诉你要更新哪些文章。然后按照下面资源中的步骤更新这些文章。延伸阅读重新发布内容: 如何更新旧博客文章的搜索引擎优化3. 填充现有内容中的内容空白如果排名靠前的页面包含类似的副主题，那么它们可能很重要，也是搜索者希望看到的内容。我们可以通过查看排名最高的网页的常见关键词来找到这些副主题。以下是如何找到这些“内容差距”的方法:在 Ahrefs 的关键词分析中输入你的目标关键词滚动到 SERP 概述检查多达五个相关的竞争网页单击“打开”并选择“内容差距机会”打开内容差距报告，你将在看到这些页面中的常见关键词排名。查看结果，看看是否有什么副主题你可以涵盖。例如，如果我们想要更新我们在免费媒体上的帖子，我们可能会考虑包括这样的副主题:媒体的例子付费媒体的例子付费媒体 vs 免费媒体4. 用内部链接提升重要页面内部链接是从同一域名的一个页面链接到另一个页面的链接。内部链接有助于 PageRank 在你的网站周围的流动(这是一个确认的谷歌排名因素)。如果使用得当，它们可以提高你在谷歌网页的性能。以下是如何查找要添加内部链接的页面:注册免费 Ahrefs 站长工具(AWT)使用 Ahrefs 的网站诊断运行抓取爬网完成后，转到内部链接机会报告这份报告向你展示了你网站上相关的内部链接机会。通过将过滤器设置为“ 目标页面”来搜索你的“钱”页面。浏览推荐的建议。在相关的地方，添加你的内部链接。延伸阅读搜索引擎优化的内部链接: 一个可操作的指南5. 修复到站点的外链由于网站经常删除或重定向页面，自然会出现断开的外链。但是，如果你有许多网站链接到损坏的页面，你就失去了潜在的推荐流量和“链接平等”下面是如何找到这些页面:转到 Ahrefs 的网站分析输入你的域名转到最佳链接报告将“ HTTP 代码”过滤器设置为未找到404通过引用域对结果进行排序然后按照下面的流程图来决定如何“修复”它们:延伸阅读如何发现和修复断开的链接(回收有价值的“链接果汁”)6. 追踪精选摘要谷歌经常直接在 SERP 上显示查询的完整或部分答案。这就是众所周知的精选摘要，通过抓取它，通常可以抢先于其他人。但是你怎样才能赢得摘要呢？首先，据我们所知，你应该已经在第一页上排名了。这意味着要优化精选摘要，你必须找到关键词:有精选摘要。你在前十名里排名第几。流量潜力状况良好。以下是找到它们的方法:转到 Ahrefs 的网站分析输入你的域名转到自然搜索关键词报告将排名过滤器设置为2–10使用 SERP 特性过滤器查找触发精选摘要的关键词“目标不排名”仔细检查列表，看看是否有机会可以抓住这个摘要。例如，我们目前排名第三的“搜索引擎优化内容策略”:看起来这个摘要需要“搜索引擎优化策略”的定义，而我们的页面上没有这个定义。我们可以包含这个定义，希望我们自己能够赢得这个摘要。延伸阅读谷歌的特色摘要：获取它们所需了解的一切7. 包括常见问题部分常见问题解答部分回答关于一个主题的热门问题。将它们添加到页面中可以帮助你提高长尾关键词的排名。因为我们回答了一个与 H1标签有关的常见问题ーー长度ーー所以当人们搜索这个答案时，我们现在在谷歌上排名第一:以下是查找常见问题解答的方法：去关键词分析输入你的主题去词组匹配报告切换到“问题8. 声明未链接的提及未链接的提及是指在线提到的品牌或产品没有链接到你的网站。例如，这个页面提到了我们，但没有链接回去:以下是如何为你的品牌寻找未链接的提及:进入 Ahrefs 的网络分析使用以下参数进行搜索: [ brand ]-outlinkdomain: yourdomain.com-site: yourdomain.com 在这个示例中，有数百万页面需要查看，因此值得通过域名评分（DR）或引用域来过滤报告，以排除“低价值”的机会 下面是一个我们发现的与我们品牌无关的例子:不要只是伸手要求作者添加一个链接或使链接“可点击”，而是要考虑如何帮助改进内容，使其对作者有益。在我们的例子中，因为这是一个产品评论，而且没有提到我们的免费 SEO 工具或 AWT，我们可以联系并让作者知道。延伸阅读将(未链接的)品牌提及转化为链接的简单指南9. 改善你的核心页面指标作为谷歌网页体验信号的一部分，核心网页重要信息(CWV)包括以下内容:最大的内容绘制(LCP)累积布局偏移(CLS)第一输入延迟(FID)它们是谷歌的排名因素。你可以使用 页面加载速度 检查你的 CWV 数据，这是一个由谷歌提供的免费工具，可以分析网页的性能，并提供改善网页速度和用户体验的建议。你也可以将 PageSpeed Insights 的 API 连接到网站诊断，查看你的核心网络重要信息以及其他 SEO 技术问题:延伸阅读核心速度指标入门面向 SEO 和开发人员的最大内容绘制 (LCP)面向 SEO 和开发人员的累积布局转变 (CLS)SEO 和开发人员的首次输入延迟 (FID)10. 优化你的图片谷歌使用替代文本(替代文本)来理解图像的主题。它们还可以帮助你的图片在谷歌图片中排名，并获得流量。使用网站诊断(通过 Ahrefs 站长工具)进行抓取，找到站点上没有替代文本的图片:然后只需浏览它们并添加替代文本即可。保持它的描述性和简洁，但不填充关键词(例如，“黑猫”)。延伸阅读图片搜索引擎优化: 12个可操作的提示(更多自然流量)11. 将现有内容重新利用为多种格式如果你已经创建了一段内容，那么你可以通过将其重新利用为不同的格式来进行额外的工作。例如，我们把我们的 SEO 清单变成了一个视频:https://www.youtube.com/watch?v=taU9P98zfjk我还把我写的关于摩天大楼技术的帖子变成了一个 Twitter 帖子:Does the Skyscraper Technique still work?We asked our followers this question and received 1,242 votes. Here are the results: pic.twitter.com/l8qadplDAF— Si Quan Ong 王思权/思權 (@siquanong) March 6, 2023 摩天大楼技术还有用吗？我们问了粉丝这个问题，得到了1242票，结果如下: pic.twitter.com/l8qadpldaf但是，如果你的目标是提高你的谷歌排名，为什么要这样做呢？YouTube 视频在谷歌搜索结果中也有排名:谷歌还在2023年推出了透视图。这是 SERP 上的一个选项卡，允许用户查看来自 TikTok、 YouTube、 Quora、 Reddit、 Tweets 等的结果。Heads-up! Perspectives rolled out on 6/12 and officially last week, but now I’m seeing the sister SERP feature that Google said would show up in the 10 blue links. It’s also labeled “Perspectives”, provides cards for discussions, social, etc. & links to the Perspectives filter: pic.twitter.com/0NBEEPI31a— Glenn Gabe (@glenngabe) June 29, 2023 小心！透视图在6月12日和上周正式推出，但现在我看到了姐妹搜索结果页面(SERP)功能，谷歌说这个功能将出现在10个蓝色链接中。它也被标记为“视角”，提供了讨论、社交等的卡片和视角过滤器的链接: pic.twitter.com/0nbeepi31a- Glenn Gabe (@glenngabe)2023年6月29日从本质上讲，谷歌也将开始显示来自其他渠道的搜索结果，而不仅仅是网站。因此，未来“改善搜索引擎优化”可能也意味着在其他渠道上创建内容。延伸阅读重新利用内容的13种聪明方法12. Grab sitelinks抓取网站链接附加链接是指出现在某些谷歌搜索结果下的其他页面(或页面的某些部分)的链接。它们可以提高搜索结果页面的可视性。站点链接通常是页面上的跳转链接：因此，影响它们的一个好方法是为页面创建一个目录。这就是我们为每一篇博客文章所做的:如果你正在使用 WordPress，你可以通过一个插件来做到这一点，如简易目录。延伸阅读什么是附加链接？ 如何影响他们？13.关注本地搜索引擎优化如果你是一家为本地客户提供服务的企业，你也会希望出现在本地“地图包”搜索结果中。提升你的本地排名最简单的方法就是声称并优化你的谷歌商业档案(GBP)。一旦声称，你添加到你的业务配置文件的信息可以显示在谷歌的网络搜索结果和谷歌地图。按照下面的指南来学习如何优化你的 GBP。延伸阅读如何在30分钟内优化你的 Google 我的商家列表14. 复制竞争对手的目录链接本地引用是在线提到你的企业的名称、地址和电话号码(NAP)。总之，7% 的 SEO 认为这些引用是最重要的排名因素。建立这些引用的最简单的方法是通过目录:转到 Ahrefs 的网站分析输入你的域名转到交集外链分析报告将你的竞争对手添加到顶部部分点击显示链接机会这将向你显示链接到一个或多个竞争对手主页的网站，但不链接到你的主页。 浏览列表以查找利基网站和本地目录。如果不确定网站是否为目录，请单击其中一个竞争页面列中的插入符号，查看引用页面、锚文本和外链。通常这些都很明显:延伸阅读如何建立本地引文(完整指南)15. 确保你的页面可以被谷歌索引如果谷歌不能索引你的页面，你就完全不能在搜索结果中排名。通过网站诊断和Ahrefs 站长工具来确保这种情况不会发生。如果你的任何一个页面有 noindex 标签ーー这会阻止谷歌索引该页面ーー它就会显示为一个问题:除非它们是故意插入的，否则你最好把这些标签去掉。延伸阅读10种方法让谷歌索引你的网站最后的想法这些策略有可能提高你在搜索引擎中的排名，但是不要指望你的排名会在一夜之间飙升。我们的研究表明，只有5.7% 的新发布的网页能在一年内访问到谷歌的第一页。这不奇怪，SEO 是一个长期的过程。因此，尽管实施这些“低挂果实”策略是有意义的，但它们并不能替代长期的 SEO 策略。有问题或评论吗? 请在 Twitter 或 Threads 上告诉我。译者，John Zhao，西品东来创始人 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Si Quan Ong 营销@Ahrefs。 我爱阅读，爱跳霹雳舞，爱尝试随机的生活实验。",
  "headers": [
    {
      "level": "H1",
      "text": "如何改进 SEO：提高排名和流量的 15 种策略（不需要新内容）"
    },
    {
      "level": "H2",
      "text": "1. 在排名靠前的页面上获得更多点击"
    },
    {
      "level": "H2",
      "text": "2. 随着流量的减少而刷新内容"
    },
    {
      "level": "H2",
      "text": "3. 填充现有内容中的内容空白"
    },
    {
      "level": "H2",
      "text": "4. 用内部链接提升重要页面"
    },
    {
      "level": "H2",
      "text": "5. 修复到站点的外链"
    },
    {
      "level": "H2",
      "text": "6. 追踪精选摘要"
    },
    {
      "level": "H2",
      "text": "7. 包括常见问题部分"
    },
    {
      "level": "H2",
      "text": "8. 声明未链接的提及"
    },
    {
      "level": "H2",
      "text": "9. 改善你的核心页面指标"
    },
    {
      "level": "H2",
      "text": "10. 优化你的图片"
    },
    {
      "level": "H2",
      "text": "11. 将现有内容重新利用为多种格式"
    },
    {
      "level": "H2",
      "text": "12. Grab sitelinks抓取网站链接"
    },
    {
      "level": "H2",
      "text": "13.关注本地搜索引擎优化"
    },
    {
      "level": "H2",
      "text": "14. 复制竞争对手的目录链接"
    },
    {
      "level": "H2",
      "text": "15. 确保你的页面可以被谷歌索引"
    },
    {
      "level": "H2",
      "text": "最后的想法"
    }
  ],
  "author": "Si Quan Ong"
}