{
  "url": "https://ahrefs.com/blog/zh/how-to-make-money-with-seo/",
  "slug": "how-to-make-money-with-seo",
  "title": "如何通过 SEO 赚钱",
  "description": "通过SEO赚取收入并不容易，但这是可能的。发现我们最久经考验的SEO赚钱方法。",
  "content": "Chris Haines Chris 是一名 SEO 总监，在 SEO 代理方面拥有 10 年的经验。 不参与 SEO 时，他喜欢摆弄老式合成器、在沙滩上散步和喝杯好茶。 内容 搜索引擎优化并不会让你快速致富，它往往需要多年的努力工作才能从中谋生。不过，最重要的是它的多功能性。有许多方法可以利用 SEO 技能来赚钱，这些方法都适合不同的人。想知道一些使你的SEO技能变现的最佳方法吗？让我们来看一看。内容1. 销售产品化的SEO服务销售产品化的 SEO 服务，或者换句话说，创造标准化的服务版本作为产品出售，是一个利用 SEO 赚钱的好方法。 与提供全面的SEO服务相比，这种方法的好处是，它的交付速度更快，这意味着你一般会更频繁地得到报酬。产品化的 SEO 服务可以包括但不限于以下内容。SEO 诊断关键词调研链接建设那么，谁在做这件事时赚了钱？Glen Allsopp 在博客中广泛介绍了他是如何通过提供 SEO 诊断赚取六位数的。这已经表明了这种特殊的方法是多么有利可图。 产品化的 SEO 服务的另一个优势是，它们可以在自由职业者网站上出售，买家在那里搜索具体的 SEO 任务，而不是一个完全管理的SEO服务。 下面是我在一个流行的自由职业者网站上发现的一个 Google My Business 产品化服务的例子。从下面的描述中我们可以看到，每个人都能得到相同格式的诊断结果，这意味着它应该是相对容易扩展的。那么，你可以销售的最流行的产品化 SEO 服务形式是什么？ SEO 诊断它可能看起来不多，但下面这个卖家有销售了 1,000 多单，每次诊断收费 125 英镑（约155美元）。这意味着他已经卖出了价值约 155,000 美元的 SEO 诊断服务。 SEO 有不同的方法来完成诊断，但如果你想开始将 SEO 诊断作为一种产品化的服务，你应该先看看我们关于 SEO 诊断文章。 在那篇文章中，你可以看到，SEO诊断的核心要素已经被分解成不同的单项检查，你可以将其作为诊断的基础。其中有：检查手动操作检查自然流量检查 HTTPS 相关问题检查你是否只能浏览你的网站的一个版本检查可索引性问题检查移动友好性检查页面速度检查 Core Web Vitals检查是否有失效的页面检查网站地图问题检查页面上的基本元素检查内容是否减少检查内容的缺失检查其他技术问题你可能想自己增加进一步的检查，但这给了你一个框架，让你开始提供SEO审计作为一种产品化的服务，并开始赚钱。关键词研究你可以出售的另一项产品化 SEO 服务是关键词研究。创建一个关键词研究文件的过程很简单。你研究某一特定关键词的相关指标，然后将其反馈给客户。自由职业者网站上不乏通过提供关键词研究这一产品化服务而赚取体面收入的人。我们可以从下面的例子中看到，如果我们将销售额乘以产品成本，卖家在这个特定的附中中通过销售关键词研究赚了近 £12,000 英镑。要想通过关键词研究这一产品化服务开始赚钱，你必须专注于网站所有者的需求。 他们很可能想知道最佳的目标关键词。你可以通过确定低竞争力的关键词来为他们提供这些信息。使用 Ahrefs Keywords Explorer（关键词分析），你可以很容易地找到 20 个低竞争的关键词，并为此收取XX 美元。专家提示 如果你想提高你的关键词研究技能，可以从观看 Sam Oh 的视频开始：https://www.youtube.com/watch?v=s7hR-i6Go4c让我们看看如何识别与 “macbook air” 相关的低竞争性关键词。首先，进入 Keywords Explorer（关键词分析），插入关键词 “macbook air”。概览将显示该关键词的难度、搜索量、流量潜力、全球流量，甚至围绕该主题的热门问题。这些信息可以帮助客户确定是否将某一特定关键词作为其SEO 策略的一部分。为了识别这个主题中的低竞争关键词，我们需要点击 Matching terms（有相同的词）报告，并按 KD 从 0 到 25 进行过滤。 一旦我们做到这一点，我们可以看到，用户对二 手MacBook Air 机型的需求很高，仅这一点就可能是一个有趣的见解，你可以与你的客户分享。现在，我们有了一个针对这个关键词的竞争最低的关键词列表。要下载这份报告，请点击右上角的导出按钮。然后，在发送给你的客户之前，在你的模板中检查、并格式化这些数据。链接建设链接仍然被认为是最重要的谷歌排名要素之一。如果你能通过外展或通过创造能自然吸引链接的内容来帮助客户的网站获得这些链接，这可能是一个不错的选择。回到我们的自由职业者网站，有些人通过博主推广，对 5 个DR 40个客座博客收取750英镑（约927美元）的费用。如果我们用产品价格乘以销售额，我们可以看到这个人已经有 67 笔销售，这意味着他们已经赚了~6.2万美元。谈到链接建设，它不是最直接的服务产品化，但你可以采取以下方法：创建一个服务，大致如下。“我将以 1000 美元的价格为您的网站提供10个客座博客文章。” 假设你能得到 20% 通过率，这将意味着你必须找到并推销到 50 个网站，这才有可能实现。如果你想知道如何建立链接的确切过程，最好的办法是查看我们更新的链接建设指南。小提示. 在尝试销售产品化的 SEO 服务之前，你必须至少了解 SEO 的基本知识。如果你对SEO有一定的了解，并为客户提供真正的价值，你将有更好的机会发展你的业务。2. 内容创作如果你喜欢写作，为网站创建内容可能是最快的赚钱方式之一。在搜索引擎优化中，对高质量的内容写手一直有持续的需求，根据下面 “content creator” 这一短语的搜索量趋势，这一趋势看起来将继续下去。在这里的所有方法中，这个方法的准入门槛最低。只要你有不错的写作水品，你就可以通过写内容赚到六位数。六位数可能听起来很多，但它是可以实现的。例如，Elise Dopson，一个自由职业的内容创作者，设法从零开始建立一个六位数的写作业务，所有这些都是在 21 岁之前完成的。那么，如何才能找到一份内容写作工作并开始赚钱呢？要找到内容工作，你有几个不同的选择。 你可以搜索流行的自由职业网站，加入一个内容机构，甚至只是查看流行的 Reddit 帖子，如 /r/hireawriter、/r/forhire 和 /r/freelance —— 在那里你可以分享你的内容写作服务。专家提示 在分享你的内容服务之前，一定要阅读子版块的规则。否则，如果你触犯了规则，版主可能会删除你的帖子。例如，在 /r/hireawriter，他们有这些规则。为了向你展示它有多容易，我在一个流行的自由职业网站上设置了一个基本的广告，“就任何主题写一篇吸引人的 500 字的文章”。其中我没有写任何有关资格的信息，也没有包括我的作品集。在我的广告被浏览了 177 次后，我收到了一份工作邀请：然后是另一个…希望这能说明通过写内容开始赚钱是多么的简单明了。3. 开始做一个利基网站如果你是SEO的新手，你可能想知道什么是 “利基网站”。这个短语是 SEO 的行话，意思是 “关于一个特定主题的博客”。 这里有两个专注于某一主题的利基网站的例子：The Coffee Maven – 一个专注于与咖啡有关的一切的小众网站。Spaniel King – 一个专注于史宾格犬护理的小众网站。那么，你如何通过利基网站赚钱呢？第一件事是为你的网站建立流量。一旦你有了一些流量，你就可以开始变现了。最简单的方法之一是使用 Amazon Associates，但值得注意的是，近年来的佣金已经相当低了。你通过利基网站赚取的钱，每个月都会有所不同。但很明显，如果你坚持下去，从长远来看，收入会很可观。这里有两个来自 Flippa 的例子，这些网站从各自的利基市场赚取了体面的钱。专家提示 如果你想进入利基网站的行业，你将需要先找到一些利基网站的想法。一旦你有了想法，你可以看看我们的指南，它告诉你如何创建一个每月赚取四位数的利基网站。让我们更深入地看一下几个利基网站的示例：1. Coffee Detective该网站提供常识性的提示、指南和评论，帮助你在家里制作咖啡。如果你的生活离不开咖啡，那么你可能会发现这是一个容易写的话题。在变现方面， Coffee Detective 用的是 Mediavine 和 Amazon Associates。让我们使用 Ahrefs Site Explorer（网站分析）来了解它获得了多少自然流量以及这些流量的价值：在概览中，coffeedetective.com 每月获得约 17,700 个自然流量，其自然月流量值约为 11,100 美元。 如果我们去看 Top pages（热门页面）报告，我们可以看到，~18% 的流量来自于这两篇文章：使用 Ahrefs SEO Toolbar（SEO 工具栏），我们可以看到首页的内容少于 1,000 字——表明你并不总是需要数千字的内容才能在谷歌上获得好的排名和流量。让我们看一下另一个例子：2. Get Busy Gardening这个网站有各种各样的帖子，涉及与园艺有关的各种主题，如种植食物、花园护理和园艺技术。如果你对园艺有一定了解，这可以是一个很好的写作主题。在变现方面，Get Busy Gardening 是通过 Mediavine 和 Amazon Associates 来变现的。让我们使用 Ahrefs Site Explorer（网站分析）来了解它获得了多少自然流量以及这些流量的价值：我们可以看到，getbusygardening.com 每月获得约 438,000 个自然流量，价值约为 105,000 美元。让我们去看看 Top pages（热门页面）的报告。我们可以看到，该网站的 5.1% 的流量来自于一篇文章。这些例子表明，即使是一个简单的想法，如在家里制作咖啡或园艺技巧，也能为你提供额外的收入。然而，如果我们仔细观察这两个网站，它们在 2016 年左右开始活跃。因此，他们至少花了六年时间才达到当前的自然流量水平。 因此，虽然创建一个利基网站从长远来看可以获得经济上的回报，但这并不是利用 SEO 赚钱的最快方法。4. 创建一个电子商务或 dropshipping 网站电子商务和 dropshipping 都以其六位数的案例而闻名。快速浏览一下 Flippa 就会发现，许多网站正以六位数或更高的价格易手。这里有一个电子商务网站的例子，Code and Quill。根据 Flippa 的数据，它的月利润为 2,576 美元/月。这里有另一个 dropshipping 网站的例子，Barbell Standard，根据 Flippa 的数据，该网站的月利润为20,496美元/月。这个网站只有两年的历史。如果你想通过电子商务或 dropshipping 赚钱，你首先需要选择至少一种你可以在网上销售的产品。 在我看来，最简单的方法是：找到一个在你感兴趣的类别中正在销售产品的网站。把它放入 Ahrefs Site Explorer（网站分析）。查看 Top pages（热门页面）报告。请看下面的示例，我是这样做的：有一次，我把一个网站放入 Ahrefs Keywords Explorer（关键词分析），关键词 “fidget toys “引起了我的注意。让我们点击 “fidget toys”，进入概览，仔细看看这个关键词。五秒钟的快速检查显示，这个急剧的高峰发生在 2017 年 4 月，并在 2021 年 5 月再次出现。从趋势图中可以看出，可能不太适合做电子商务网站。 专家提示 对你的关键词进行主观判断是至关重要的，因为有时候，你对一个关键词的受欢迎程度的看法可能与数据不同。在一个不同的例子中，假设你想建立一个电子商务网站，销售流行的连帽衫。你可以使用 Ahrefs 轻松地找到搜索量最大的 “hoodies” 相关的所有词。要做到这一点，可以在 Keywords Explorer（关键词分析）中输入 “hoodies”，然后点击侧边栏中 Matching terms（有相同的词）报告。 我们现在可以看到最受欢迎的 “hoodies” 变体词，使我们能够有效定位我们的电子商务商店。关键词 “anime hoodies” 听起来很有趣——让我们通过点击链接来仔细看看这个关键词。 一旦你点击了这个关键词，你应该再次看到概览屏幕。我们可以看到，这个关键词的趋势变化相当大，但在过去几年里，它一直是相对积极的。如果你想在电子商务和 dropshipping 中实现利润最大化，你需要考虑产品的当前趋势，其 Keyword Difficulty（关键词难度）和 Traffic Potential（流量潜力）。5. 网站翻新那么究竟什么是 “网站翻新”？简单地说，网站翻新是购买一个网站，改进它，然后以更多的钱出售的过程。 如果你已经有了几年的SEO工作经验，那么网站翻新就会特别有利可图。例如，这里有一个研究案例，一个网站在短短 16个 月内以 136,000 美元的价格被翻新转手。 以下是网站翻新转手时要记住的一些关键点。当购买一个网站时，你想寻找一个有良好链接但内容可以改进的网站。你可以使用 Ahrefs Site Explorer（网站分析）来帮助你决定这一点。根据 Flippa 的说法，翻新转手网站的回报可以超过其平均月收入的 50 倍。换句话说，如果一个网站在过去 12 个月的平均收入为每月 1000 美元，那么它的价值可以达到约 5 万美元。一旦你对网站的价值有一个大致的概念，你将需要选择一个经纪人。Empire Flippers 提供这样的服务，是最值得信赖的平台之一，你可以在这里购买和出售网站。翻新转手网站是有利可图的，但你必须了解购买网站时要注意什么。所以拥有 SEO 的基本知识是绝对必要的。 6. SEO 培训一旦你在SEO方面获得了几年的经验，你可能会觉得你的技能更好地用于帮助别人学习你所获得的技能。 Authority Hacker 就是这样做的，建立了一个六位数的业务。 你也可以通过创建高质量的 SEO 课程进行面授或在线辅导来做到这一点。你可以通过你的网站、Gumroad、Udemy、Teachable或任何其他平台销售这些课程和培训材料。要准备好销售你的课程，你首先需要决定它将采用什么格式。 下面是几个例子，你可以用不同的形式销售你的课程：在 YouTube 上提供免费视频课程并通过广告盈利在付费平台上提供优质视频课程（Udemy，Teachable）为特定任务创建模板或说明，并在 Gumroad 上销售，例如，WordPress 的网站速度优化。建立一个专家在线社区，并收取每月订阅费。创建一个文件化的课程，提供一对一的个人或远程指导如果你有教学背景，这种方法可能是你赚钱的绝佳途径。7. SEO 顾问这可能不是最令人兴奋的SEO赚钱方法，但提供 SEO 咨询服务是最经得起考验的赚钱方法之一，这也是许多 SEO 人员的谋生方式。调研 SEO 人员从咨询中赚取的金额是比较复杂，但我们的根据调查表明，超过 25% 的受访者每小时收费约 101–150 美元，有些人每小时收费约 750 美元。 如果你想开始做 SEO 顾问，请查看我们的如何在 SEO 领域获得工作机会的文章。它将给你一个很好的概述，告诉你在寻找 SEO 工作和遵循更传统的 SEO 职业道路时应该注意什么。如果你有决心，你可以在短短几年内达到一个高级职位。 最后搜索引擎优化可以是非常有利可图的，但它确实需要时间、努力和大量的决心，才能赚大钱。值得记住的是，在 SEO 中挣钱最多的人并不总是最精通技术的 SEO。然而，至关重要的是，他们知道如何利用他们的技能来赚钱。 获取你可以做到？有问题吗？在 Twitter 上找我吧。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Chris Haines Chris 是一名 SEO 总监，在 SEO 代理方面拥有 10 年的经验。 不参与 SEO 时，他喜欢摆弄老式合成器、在沙滩上散步和喝杯好茶。",
  "headers": [
    {
      "level": "H1",
      "text": "如何通过 SEO 赚钱"
    },
    {
      "level": "H2",
      "text": "1. 销售产品化的SEO服务"
    },
    {
      "level": "H3",
      "text": "SEO 诊断"
    },
    {
      "level": "H3",
      "text": "关键词研究"
    },
    {
      "level": "H3",
      "text": "链接建设"
    },
    {
      "level": "H2",
      "text": "2. 内容创作"
    },
    {
      "level": "H2",
      "text": "3. 开始做一个利基网站"
    },
    {
      "level": "H3",
      "text": "1. Coffee Detective"
    },
    {
      "level": "H3",
      "text": "2. Get Busy Gardening"
    },
    {
      "level": "H2",
      "text": "4. 创建一个电子商务或 dropshipping 网站"
    },
    {
      "level": "H2",
      "text": "5. 网站翻新"
    },
    {
      "level": "H2",
      "text": "6. SEO 培训"
    },
    {
      "level": "H2",
      "text": "7. SEO 顾问"
    },
    {
      "level": "H2",
      "text": "最后"
    }
  ],
  "author": "Chris Haines"
}