{
  "url": "https://ahrefs.com/blog/zh/how-to-write-a-headline/",
  "slug": "how-to-write-a-headline",
  "title": "如何三步写出引人入胜的标题",
  "description": "一个好的标题会吸引读者的注意力，准确描述内容之后，让读者想要点击。在这里学习如何写一个让人无法抗拒的标题。",
  "content": "Brett Friedman 数据驱动的创造力、茶的爱好者、文字书呆子以及我称之为家的互联网地址 BrettGFriedman.com 的所有者。 内容 即使你写了世界上最好的博客文章，没有一个吸引人的标题，没有人会去读它。为什么？因为你必须获得点击，这就是标题的作用。在这篇文章中，你将学习如何写一个不可抗拒的标题，吸引点击，而不是成为标题党。但首先…什么是标题？为什么标题很重要？如何三步写出标题？标题写作的4个技巧什么是标题？标题是一个题目，一个名称。一个好的标题有三个作用：吸引读者的注意力引发读者好奇去点击准确描述内容如果你能在一句话中做到这三点，你会赢得所有你想要的读者。为什么标题很重要？一个好的标题会引导人们看你的文章。事实上，在大多数情况下，你的标题将是人们用来决定你的文章是否值得阅读的唯一因素。根据不同的平台，新闻标题以不同的方式吸引人们的注意力。在社交媒体上你的文章被无数的警示性新闻、你的读者最喜欢的人发布的帖子、以及专门针对他们从浏览到购买的广告所包围。现在记住，人们的注意力持续时间越来越有限。你的标题需要与所有这些训练有素的竞争者竞争并取胜。在电子邮件主题行中办公室员工平均每天收到121封电子邮件。即使其中只有10% 是带有博客链接的时事通讯，大多数人也不会每天阅读12篇博文。他们会根据标题选择少数几个最引人注目的。在搜索结果中平均每个网站有 2/3的流量来自谷歌。一个好的标题，会增加搜索者点击你的页面的可能性，而不是其他搜索结果。如何三步写出标题？写一个标题并不难。你可以通过一个简单的三步系统来掌握基本知识。在你解决这个问题的时候，请记住以下几点: 你应该为谷歌搜索者写你的标题，因为，很可能，如前所述，你的大部分流量来自于搜索。 通常最好是在写博客之前先写标题，所以这个系统就采用了这个方法。也就是说，你仍然可以使用每个步骤来精炼一个特别的标题。在执行这些步骤时，应该考虑到文章的真实内容，从而避免成为“标题党”。通常在你写完文章后再写标题，会导致你过多地承诺读者会从文章中得到什么。如果这篇文章没有提供，那这就是标题党。但是你会做到的。因为你有Rebekah Bek的专家指导 😉 现在让我们来写这个标题吧！选择一种格式增加一个吸引人的角度使之人性化1. 选择一种格式假设你正在写一篇关于最好的蛋白质粉的文章，任何一种标题形式都可以: 清单:2021年锻炼肌肉的10种最佳蛋白粉 如何: 如何选择最适合你的蛋白粉 教程:最佳蛋白粉:6步选择最佳蛋白粉 评论文章:真的有最好的蛋白粉吗? 科学说没有 测评: Optimum Nutrition金段测评:最佳蛋白粉 比较: Optimum Nutrition 对比 MyProtein: 哪种是最好的蛋白质粉？但是请记住，对于大多数网站来说，流量最重要的来源是谷歌。所以，你不应该只选择听起来最好的标题格式。你应该选择搜索者实际上正在寻找的，这样你就有最好的机会排名。你怎样能做到呢?在谷歌中查看你的目标关键词的当前排名靠前的页面，并检查主导角度。你可以看到前三名“最好的蛋白粉都是清单。不过要注意，谷歌的搜索结果是根据你的位置和搜索历史等因素个性化的。为了解决这个问题，在隐身标签中使用Ahrefs SEO 工具栏 ，可以模拟你的目标国家和语言的搜索。记住，最有效的标题类型取决于你的主题。虽然关于最佳蛋白粉的文章最适合用清单式的标题，但“如何使用”的标题更适合你正在阅读的文章。你的主题可能需要一篇评论。这完全取决于搜索数据。专业提示如果你写的标题与搜索结果中的内容角度不匹配，考虑一下你是否可以通过细小的编辑来改变角度。例如，你可以通过改变几个单词来快速地将一个教程变成一个清单:写出你最好的标题: 六个步骤→写好标题的6种方法2. 增加一个吸引人的角度现在你已经有了格式，你需要找到排名靠前的角度。使用与上一步相同的文章，寻找有区别的单词。例如，当看清单时，大多数文章都以#最佳蛋白粉开头，然后是角度。在最佳蛋白粉的情况下，性别是主导的角度。即，对男性或女性。但是在SERP中也有其他的选择，比如:”为了更好的营养”“每种饮食””给你的”在选择你的角度时，你需要平衡搜索者想要什么和你能写什么。如果你是个专家，知道某个角度比另一个角度更有意义，你应该从这个角度出发。如果没有明显的主导角度，就要关注一个明显的好处，一个产品/服务的差异化因素，或者仅仅是一些还没有被关注的东西，只要它是你的读者想要知道的。比如:“减肥”“锻炼肌肉”“增肥”一旦你掌握了标题的基本部分，比如格式和角度，你只需要再做一件事…3. 使之人性化为了真正打动读者，你需要让你的标题人性化。如果你是人类，这应该很容易。用形容词或修辞格向你最好的朋友随意描述这篇文章。因此，与“10种最佳减肥蛋白粉”不同，你可能需要：“10种最好的蛋白粉，轻松减肥”“10种最好的减肥蛋白粉””十大最佳蛋白粉减肥”为了让这个过程更简单，请使用读者的语言。在每个行业，都有行话，有俚语，有熟悉行业的人谈论他们最喜欢的东西的私人方式。如果你有时间，尽可能多地阅读与你的主题相关的文章。你也可以在社交媒体上浏览你的话题。Reddit、Twitter和LinkedIn是寻找小众短语和特定社区语言的好地方。一些reddit甚至带有Wiki和Glossary来定义关键词。Wiki 关于健身利用这些信息，你可以选择一个标题，如“17蛋白粉，帮助你实现你的宏量营养目标”或“14蛋白粉，快速，便携，准备和食用。标题写作的4个技巧选择一个正确的格式，角度，并使它人性化，对于如何写一个成功的标题的基本步骤是足够的。也就是说，在写了这么多年的标题之后，我们有四个技巧给你。1. 增加具体性标题越具体，越容易阅读。它越容易阅读，人们就会越喜欢它。人们越喜欢它，就越有可能点击它。就这么简单，而具体性来自于有形的、真实的东西。例如，不要用“蛋白粉增重”来代替“15种美味的蛋白粉可以帮助你每周增加1磅的肌肉”。2. 惊喜和快乐如果你的目标是从其他地方获得流量，而不是有机搜索，比如社交媒体，匹配搜索意图可能就不那么重要了。你可以通过说一些有趣的和不寻常的东西来让人们停下来点击，从而产生更大的影响。这个问题没有一个真正的公式; 它依赖于了解你的听众，他们使用的语言，以及什么可能与他们产生共鸣。3. 制造好奇心差距把你的信息告诉每个人，除了你想让他们好奇的那个人，例如: “除了你，每个人都在做 x!”只要确保你在你的文章中支持这个主张，这样它就不只是又一个标题党文章了。4. 测试标题的变体当你在社交媒体平台上发表文章时，你可以选择不同的标题。测试主主题的变体，看看一个标题是否获得更多的点击、喜欢、评论和分享。然后把它作为你的主要文章标题。最后的想法制作一个成功的标题不是火箭科学。这是营销科学。这显然更容易。事实上，如果你使用上面详述的三步系统，你将能够跟上你所在行业中最好的作家。一旦你准备好成为最好的标题作者，可以看看经典文案。他们都有自己的基于证据的标题公式和理论来支持他们。以下是我最受益的五本书： Claude Hopkins的《科学广告》。 通过详细了解1923年直接响应营销中使用的最有效的头条新闻来介绍“复制测试”的概念。 John Caples的《测试广告法》。克劳德 · 霍普金斯的方法又经过了十年的改进。包括最成功的标题公式仍然在近一个世纪后仍然有点击。 Eugene Schwartz的《突破广告》。尤金·施瓦茨介绍了品牌意识的概念以及如何向各个层次的消费者进行营销。 Roy Williams的《广告奇才》。这是一本更现代、个人最喜欢的书，采用了一种最独特的文案方法。 Michael Masterson的《伟大的领导》。只关注如何写文案的第一行，以最大程度地影响你的读者。 一旦你成为了一个真正的标题写作专家，就可以用Si Quan的SEO 文案指南来优化你文章的其余部分。你可以在 推特上联系我，让我给你一条[标题]!译者，赵子荣，SEOZZR博客创始人 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human:",
  "headers": [
    {
      "level": "H1",
      "text": "怎样3步写出引人入胜的标题"
    },
    {
      "level": "H2",
      "text": "什么是标题？"
    },
    {
      "level": "H2",
      "text": "为什么标题很重要？"
    },
    {
      "level": "H2",
      "text": ""
    },
    {
      "level": "H3",
      "text": "在社交媒体上"
    },
    {
      "level": "H3",
      "text": "在电子邮件主题行中"
    },
    {
      "level": "H3",
      "text": "在搜索结果中"
    },
    {
      "level": "H2",
      "text": "如何三步写出标题？"
    },
    {
      "level": "H3",
      "text": "1. 选择一种格式"
    },
    {
      "level": "H3",
      "text": "2. 增加一个吸引人的角度"
    },
    {
      "level": "H3",
      "text": "3. 使之人性化"
    },
    {
      "level": "H2",
      "text": "标题写作的4个技巧"
    },
    {
      "level": "H3",
      "text": "1. 增加具体性"
    },
    {
      "level": "H3",
      "text": "2. 惊喜和快乐"
    },
    {
      "level": "H3",
      "text": "3. 制造好奇心差距"
    },
    {
      "level": "H3",
      "text": "4. 测试标题的变体"
    },
    {
      "level": "H2",
      "text": "最后的想法"
    }
  ],
  "author": "Brett Friedman"
}