{
  "url": "https://ahrefs.com/blog/zh/implementing-the-4-ps-of-marketing/",
  "slug": "implementing-the-4-ps-of-marketing",
  "title": "如何实施市场营销的四个要素",
  "description": "在这篇文章中，你将学习到，如何将4个要素中的每一个都运用到一个连贯的策略中，从而有效地推广和销售你的产品或服务。",
  "content": "Mateusz Makosiewicz Ahrefs 的营销研究员和教育家。 Mateusz 在推广代理、SaaS 和硬件业务领域拥有超过 10 年的营销经验。平时喜欢创作音乐或享受长距离的散步。 内容 营销的四个要素（4p）是企业用来控制和优化营销产品或服务的要素的模型。模型的四个组成部分是产品(你卖什么)、价格(你卖多少钱)、地点(你在哪里卖)和促销(你如何获得客户)。 杰里米 · 麦卡蒂在他1960年出版的《基础营销: 管理方法》一书中最初提出了这种营销组合从那时起，这种模式被广泛的市场营销人员采用，并且一直沿用至今。在这篇文章中，你将学习如何将四个要素中的每一个，都联系到一个连贯的策略中，从而有效地推广和销售你的产品或服务，下面分为四个步骤: 了解你正在使用的产品 决定一个价格 选择一个地点销售你的产品 制定一个推广策略1. 了解你正在使用的产品你们中的大多数人可能已经有了一个产品或服务的想法，或者至少已经有了一个想法。毕竟，这是营销组合的第一步。但在你进入下一步之前，花点时间仔细检查一下你是否在正确的轨道上。至少，你应该能够回答这些基本问题:谁是目标市场？市场有多大？市场需求和价值的特征是什么？你的产品与竞争对手有什么不同？了解这些问题的答案是市场调查的工作，你可以在这里了解更多。如果你现在没有时间做这些(这可能会非常耗时) ，写下你最好的猜测，这样你就有事可做了。你总是可以在以后对它进行改进。以下是我们的产品可能会出现的情况:2. 确定价格价格是你的客户将为产品或服务支付的成本，它需要与你提供的真实价值和感知价值联系起来。在决定价格的时候，这里有几个问题要问你自己:你需要考虑哪些成本? (供应成本，员工，分配等)这足以让你盈利吗？你的目标客户能负担得起这个产品吗？价格相对于它的好处和你的竞争对手会有怎样的感知？你需要解决的主要问题是如何将你的业务成本与你的客户认为的价值联系起来。我们产品的答案是: 数据。数据是我们的客户需要的，同时，数据也是我们的成本来源。因此，我们决定将 Ahrefs 的价格与数据限制和数据更新频率挂钩。然后我们决定将价格划分为四个层次(外加一个定制的企业计划)。最便宜的计划是适合基本的搜索引擎优化需求和较小的营销部门，而最昂贵的计划反映了搜索引擎优化机构和大的营销部门的需求。为了让事情变得更简单，甚至更有利于我们的客户，每一个付费客户都得到了 Ahrefs 提供的所有功能。你可能会感到惊讶的是，我们有一个付费试用。毕竟，这是一个相当不寻常的做法。让我请我们的首席营销官解释一下原因。也许它也适合你的生意？https://www.youtube.com/watch?v=09avD7Y4xpc让我们也谈谈可支付能力问题。换句话说，你如何确保你的产品对目标市场来说是负担得起的？其中一个方法就是直接问。你可以调查或者采访你的目标受众。例如，你可以使用 Van Westendorp 模型来确定最优价格点。该模型基于以下问题:什么样的价格会如此之低，以至于你开始质疑这个产品的质量？你认为这种产品在什么价位上开始便宜了？这种产品什么时候开始显得贵了？这种产品在什么价位上太贵了？或者你可以听听人们在社交媒体上对类似产品的评论。但是要小心。很难找到人谁公开表示满意的东西的价格，除非他们得到了一个讨价还价。你更容易看到人们抱怨。然而，如果你幸运的话，你会偶然发现关于产品类别定价的热烈讨论。这里有 一个很好的例子(注意它包含一些强烈的语言) :https://www.youtube.com/watch?v=zvPkAYT6B1Q做基准测试也是一个好主意。我们在为Ahrefs定价时也是这么做的。采用与我们当时盈利能力极高的竞争对手Moz相似的定价，降低了我们在一开始就犯下巨大定价错误的可能性。3. 选择一个地点销售你的产品这个地点是关于客户在哪里以及如何购买你的产品或服务。从商店的类型、云计算与可下载、员工需求以及可能向中介机构收取的费用等方面进行考虑。这部分流程需要涉及的关键问题包括:你的潜在客户的购物习惯是什么？你们的竞争对手在哪里销售产品？客户在哪里可以得到最好的购买体验和售后支持？你需要销售代表还是自助服务？你需要放弃多少收入来通过一个特定的分销渠道提供产品？我最近写了 一篇关于创建一个市场化战略的文章，在文中我详细地解释了分销模式以及如何选择正确的分销模式。所以，如果你想了解更多关于这方面的信息，请查看以下内容。下面是一个概括分布模型的表格:Salesforce 是一个很好的例子，说明一家公司在产品和地点之间建立了很强的联系。刚开始时，他们认为自己的产品与市场上的任何产品都不同ーー SaaS CRM 是以订阅方式销售的。这一选择巩固了他们的分销模式，并使他们的营销组合的地点方面，他们的品牌差异。这个决定不仅使 Salesforce 成为今天的公司，而且也为那些后来进入市场的人塑造了这个行业。现在每个 CRM 都是一个 SaaS CRM。Salesforce 更进一步，在产品和促销之间建立了强有力的联系(另一个“ p”)。他们把他们的产品架构“翻译”成一个叫做“软件终结”的促销活动，这个活动攻击了传统的软件分销模式。Salesforce 的“软件终结”运动正在进行中。资料来源: 商业内幕这里的要点是，正确的分销模式在很大程度上受到产品类型的影响。当你看到不止一个地点可以卖你的产品时，考虑一下成本和收益。也许你会像 Salesforce 一样发现一座金矿。4. 制定一个推广策略推广是指你需要使用的策略，以达到目标市场与你的信息。想想广告、博客、社交媒体、公关等等。你的推广策略需要回答:你要找谁？你的竞争对手是如何接触到他们的客户的？你的潜在客户典型的购买旅程是什么？你需要什么样的预算和员工？你可以用什么样的策略来填补营销漏斗？让我向你展示，我们 Ahrefs 如何在我们的促销策略中，回答其中的一些问题。我们推广策略的基石是内容营销。 我们选择这种营销方式有几个原因。首先，很多人在 Google 上搜索我们的产品解决的问题的解决方案。例如，在美国，估计每月有 450 次“如何在 Google 上排名更高”的搜索：数据来自 Ahrefs 的关键词分析。所以我们写了一篇博客 来解释如何用 Ahrefs 来解决这个问题，Ahrefs 在这个关键词上排名第三:数据来自 Ahrefs 的关键词分析。我们已经对数百个其他有搜索需求的相关话题做了完全相同的事情。因此，我们的博客现在每个月都有成千上万的访问量来自自然搜索。其次，由于 Ahrefs 是一个 SEO 工具，还有什么比我们自己为每一个 SEO 相关话题排名更好的推销手段呢？通过展示我们可以使用我们自己的工具对我们的内容进行排名，我们在我们的4 p 模式中在产品和促销之间建立了强有力的联系。这种强大的联系使我们有理由相信我们产品的价值，并且给我们提供了大量的案例研究来在我们的博客上报道。最后，让我们考虑一下我们的分布模型。由于我们的产品是自助服务的，我们只通过我们的网站销售，我们需要一个机制，把我们的目标市场给我们。内容营销解决了这个问题。让我们更详细地来看看我们内容营销策略的三个核心要素。免费工具我们目前有14个免费工具，展示我们的核心付费工具的功能。这使我们能够连接 p 和使用我们的产品作为促进工具，以:通过相关搜索排名提高品牌知名度，比如“免费反向链接检查器”通过允许潜在客户在购买前尝试来减少摩擦。如果你想知道我们的免费工具给我们带来了多少流量，可以看看 Ahrefs 的网站分析中关于我们域名的热门页面报告。这里有一个先睹为快:博客我们的博客也给我们带来了大量有针对性的自然流量:这是因为我们保持博客的商业导向。你不会发现我们在博客上谈论公司的休养、办公狗，或者如何从图片中删除背景。前两个主题没有搜索需求，后一个主题也没有“商业潜力”“商业潜力”是我们用来衡量读者通过某一特定主题的文章发现我们产品的可能性。我们以四分制对其进行评判：因此，尽管一篇解释如何从图像中删除背景的文章可能会给我们带来大量的自然流量，但我们写这篇文章毫无意义，因为它没有任何“商业潜力”。对“如何去除图片背景”排名靠前的结果的每月自然搜索流量的估计。数据来自 Ahrefs 的网站分析。相反，我们主要写那些在我们的“商业潜力”量表上得到两到三分的话题。其中一个例子就是“ SEO 诊断”，这是我们多年来一直保持的排名:我们对“SEO审计”的历史排名”, 数据来自 Ahrefs 的网站分析。如果你想了解更多关于商业博客的知识，我们这里有一个免费的五小时课程。YouTube我们的 YouTube 频道是我们内容营销策略的另一个核心元素。我们定期制作视频已经有三年了(当 Sam 加入我们的时候)。在此期间，我们已经发布了181个视频——如果没有这个营销渠道的专职人员，这一壮举是不可能实现的。我们如何处理我们的 YouTube 频道和我们的博客非常相似。我们保持它的业务导向，与每个视频分享我们的专业知识，如何 Ahrefs 可以解决常见的搜索引擎优化和营销问题。你可以在这个视频中了解更多关于我们的 YouTube 关键词研究和排名策略:https://www.youtube.com/watch?v=NY3y0V9UDwM延伸阅读如何创建一个成功的内容策略2021年有效的16种营销策略10种有效的潜在客户开发策略（附示例）每个初创公司都需要知道的增长黑客策略我们在 Ahrefs SaaS Marketing Vlog 上的营销幕后报道最后的想法营销的4P有点像SWOT。两者都非常简洁，触及业务的基本原理，可用于多种用途。以下是使用营销的4个P的几种方法： 制定你的营销策略。一旦你得到了正确的产品、价格、地点和促销，你就为你的整个营销工作打下了基础。 举办营销研讨会。营销的4P是每个人都能理解的。此外，每个人都可以对其组件有有趣的想法或见解。 审核营销策略。当你需要审核或剖析现有的（可能是竞争性的）营销战略时，4个P将使你专注于重要的内容。有问题吗? 在推特联系我。译者：John Zhao, 西品东来创始人 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Mateusz Makosiewicz Ahrefs 的营销研究员和教育家。 Mateusz 在推广代理、SaaS 和硬件业务领域拥有超过 10 年的营销经验。平时喜欢创作音乐或享受长距离的散步。",
  "headers": [
    {
      "level": "H1",
      "text": "如何实施市场营销的四个要素"
    },
    {
      "level": "H2",
      "text": "1. 了解你正在使用的产品"
    },
    {
      "level": "H2",
      "text": "2. 确定价格"
    },
    {
      "level": "H2",
      "text": "3. 选择一个地点销售你的产品"
    },
    {
      "level": "H2",
      "text": "4. 制定一个推广策略"
    },
    {
      "level": "H3",
      "text": "免费工具"
    },
    {
      "level": "H3",
      "text": "博客"
    },
    {
      "level": "H3",
      "text": "YouTube"
    },
    {
      "level": "H2",
      "text": "最后的想法"
    }
  ],
  "author": "Mateusz Makosiewicz"
}