{
  "url": "https://ahrefs.com/blog/zh/inbound-vs-outbound-marketing/",
  "slug": "inbound-vs-outbound-marketing",
  "title": "入站与出站营销：有什么区别？",
  "description": "入站营销正在建立品牌知名度和内容的兴趣。出站营销正在与消费者伸出援手做同样的事情。",
  "content": "Si Quan Ong 营销@Ahrefs。 我爱阅读，爱跳霹雳舞，爱尝试随机的生活实验。 内容 入站营销是你通过内容，建立品牌知名度和兴趣的地方。出站营销是你接触消费者做同样事情的地方。在这篇文章中，你将学习如何决定哪一个对你的生意更好。让我们从最基本的开始。内容什么是入站营销？入站营销是一种营销策略，旨在通过相关和有用的内容“吸引客户”这个词是由SaaS公司HubSpot的创始人Brian Halligan，和Dharmesh Shah创造的。根据他们的说法，这通常涉及三个阶段：吸引–吸引合适的人。参与–帮助他们解决难点和目标。喜悦–帮助他们在你的产品或服务中获得成功。1. 吸引这个阶段是关于，用有用的内容吸引潜在客户到你的网站。一种方法是为目标客户正在搜索的主题创建内容。你可以使用关键词研究工具(如 Ahrefs 的关键词分析)找到这些主题。例如，下面是我们如何找到一家销售咖啡产品的网上商店的主题:输入谷歌潜在客户可能头脑风暴的单词和短语将它们输入关键词分析去词组匹配报告将选项卡切换到“问题”了解更多: 关键词研究: Ahrefs 的初学者指南2. 参与一些访问你的网站的人会马上购买。但很多人不会。那是因为他们需要时间ーー时间来思考他们的问题，考虑他们的处境，并评估解决方案。即使他们现在不买，你也会希望在那里继续与他们接触。这样的话，你的品牌就会成为购买时的首选。一种方法是建立一个电子邮件列表。鼓励你的网站访问者注册，然后定期向他们发送更新。例如，我们每周发送一份简报，其中包括我们最新的内容和来自网络各地的建议。3. 喜悦每个快乐的顾客都可以在他们的朋友和家人之间传播好消息，从而把更多的顾客介绍给你。但是你如何“取悦”你的顾客呢？做到这一点的最好方法是拥有一个伟大的产品。如果你的产品不能帮助你的客户解决他们的问题，那么无论你实施多少策略都无济于事。你还需要引导客户充分利用你的产品或服务。例如，在 Ahrefs，我们有大量的深入课程，涵盖了使用我们的工具的各个角落和缝隙。入站营销示例入站营销主要是创建和发布内容。因此，入站营销的示例通常归结为你可以创建的不同类型的内容，包括：博客文章，例如此博客。视频，例如我们的YouTube频道。播客，例如“永久流量”播客。网络研讨会，例如ConvertKit的网络研讨会。社交媒体内容，例如我们的Twitter帐户。还有更多。入站营销：利弊你是否应该投资入站营销？让我们来看看利弊。利：以下是入站营销的优势：不中断–潜在客户在自己的时间和意愿中找到你目标明确–只有当潜在客户感兴趣或遇到问题时，他们才会搜索你的内容。这使得向他们销售更容易。保持实力–只要你的内容在谷歌排名靠前、与内部链接或作为内容存档的一部分存在（例如YouTube频道），潜在客户就可以继续发现你的内容。这将向你的网站发送一致的流量，而无需“主动”维护从长远来看，可能更具成本效益——我们的博客每月搜索访问量估计为573000次。如果我们通过搜索广告购买流量，估计每个月将花费79.5万美元（或每年950万美元）。考虑到我们的内容团队不到10人，而且我们每人的工资也不到数百万，我们可以合理地说，从长远来看，入境营销更便宜。弊以下是入站营销的一些缺点：工作需要时间-你需要时间来创建高质量的内容。你也需要时间谷歌发现和排名你的内容。事实上，搜索引擎优化需要大约三到六个月的时间。做好工作很有挑战性——现在的内容实在太多了。如果你想脱颖而出，你需要创造高质量的内容，人们喜欢阅读。如果你缺乏资源，这可能是一个苛刻的要求。什么是出站营销？出站营销是一种营销策略，公司会积极向潜在客户推广有关产品的信息。尽管出站营销构成了完全不同的策略，从陌生电话到社交媒体广告，但我们可以粗略地将其分为以下几个“阶段”:受众定位-决定谁应该看到你的信息。消息推送-积极推出消息。跟进-跟进目标受众(如果没有回应)。1. 受众定位受众定位是你决定谁应该看到你的信息的地方。例如，如果你在时代广场上登广告牌，你就决定以纽约市人民为目标即使是冷电话和冷电子邮件这样的策略也不是随机的。公司通常会获取相关的号码或电子邮件列表（例如，X公司的客户）来推送他们的消息。2.消息推送这是你创建和推送希望目标受众看到的消息的地方。对于社交媒体广告，它看起来像这样：打电话和发邮件，这将是你的重点。3. 跟进如果你的初始消息没有得到响应，你可能需要考虑跟进。例如，这是我发送的一封后续邮件，用来检查是否有人对某篇文章感兴趣:对于社交媒体广告，可以通过重定向来进行跟踪。出站营销示例以下是一些出站营销的常见示例：电话推销冷电子邮件直接邮件广告牌打印广告电视广告社交媒体广告，例如Instagram广告YouTube广告出站营销：优点和缺点你应该投资出站营销吗？这是利弊。优点出站营销有哪些优势？更快的结果——一般来说，出站营销策略更容易设置和运行。因此，你实际上可以更快地得到结果。更容易追踪“成功”——例如，你可以很容易地测量打开或回复冷电子邮件的次数，社交媒体广告的印象和点击次数，甚至冷电话的积极回应次数。(也有例外，比如在时代广场(Times Square)放一个巨大的广告牌。)缺点出站营销也有缺点：干扰性–潜在客户不一定在寻找你的产品或服务，因此你基本上是在打乱他们的日常日程，以显示你的信息。对于冷电话和冷电子邮件这样的策略，如果你发送垃圾邮件，长期来看，你可能会“损害”你的品牌盲目——人们倾向于忽视或忽视冷电话、电子邮件和广告。他们还可以并且越来越多地使用广告拦截工具和Gated等电子邮件解决方案，来拦截广告和未经请求的电子邮件。入站与出站营销：两全其美尽管风格相反，但入站和出站营销并不是相互排斥的。实际上，最好的公司一起使用它们。这是你可以结合站内和站外营销的方法：1. 使用入站方式获取线索，并使用出站方式跟踪想象一下: 如果你可以通过站外营销来接触那些已经表示了兴趣的人，那会怎么样？这样不是更容易卖吗？你可以的。正在搜索你或你的内容的人，已经表明了他们对你的产品或你解决的问题的兴趣。因此，与其用电子邮件或广告“轰炸”每个人，不如这样做:做关键词研究，找到你的潜在客户正在谷歌上搜索的主题创建搜索引擎优化内容，为这样的主题排名高当他们访问你的网站时，获取他们的联系信息跟进最有希望的线索，例如，那些测试过你的免费试用版，访问过你的比较页面，完成了你的免费课程的人这里有一个例子说明它是如何工作的。一个潜在客户想要学习如何审计他们的网站搜索引擎优化问题。因此，他们搜索“如何执行搜索引擎优化审计”，并发现我们的博客帖子。在博客文章中，他们了解到他们可以注册一个免费的 Ahrefs 站长工具(AWT)帐户，并对他们的网站进行审计。确实如此。通过注册Ahrefs 站长工具，他们有资格对我们这样的SEO工具感兴趣。因此，如果我们有一个销售团队，我们可以很容易地通过电子邮件联系他们，看看他们是否有兴趣升级到付费帐户这只是一篇博客文章。你可以看到，我们在博客和YouTube频道上创建的数百条内容中，这是如何轻松扩展的，从而产生了数百条潜在的线索事实上，这是许多SaaS公司的核心战略。通过入站产生合格的潜在客户，然后通过他们的销售团队达成销售了解更多：潜在客户开发：初学者指南2. 利用内容建立品牌知名度想象一下，从Hubspot代表那里收到一封冷电子邮件。即使它是普遍的，你是否会花几分钟的时间来看看他们必须说些什么？我敢打赌你会的。那是因为它是Hubspot。这是一个庞大的品牌。你相信该电子邮件（即使没有被填写）也包含一些重要的东西。我的观点是：出站营销受益于拥有知名品牌。人们将根据你的品牌选择是阅读你的电子邮件，还是收听广告。建立品牌的一种方法是为潜在客户创建相关和有用的内容。如果你的潜在客户不断看到你的SERP，并且你的内容确实可以帮助他们解决问题，那么你的品牌将成为最重要的。这只能有助于提高你的出站营销工作。3. 重新利用入站营销的入站内容出站营销并不总是只关于推销，也不是直到有人购买才“发送垃圾邮件”。提前提供价值有助于将潜在客户转化为顾客。例如，这里有一封来自布莱恩 · 哈里斯(Bryan Harris)发给 HubSpot 的冷电子邮件:布莱恩没有在第一封邮件中推销自己的服务，而是提供了价值。他为 HubSpot 制作了一个演示视频来展示它的外观。他也没有要求任何回报ーー他想要的只是评估它的兴趣。而且成功了ーー布莱恩得到了与 HubSpot 合作的合同。在本例中，Bryan 从头创建了演示视频。但你不必这么做。如果你已经在创建内容，那么你可以轻松地将其转换为新的格式，以便为潜在客户提供服务。例如，你可以从你发表的博客文章中整理出一本电子书。当然，你应该创建的确切内容取决于你要联系的对象。但重点是ーー如果你在做搜索引擎优化，你可以简单地为你的海外营销工作重新设计内容。不断学习查看以下资源，了解更多关于入站和出站营销的信息:什么是入站营销？初学者指南SEO：初学者的完整指南内容营销：全面指南视频营销的简单（但完整）指南PPC营销：点击付费广告入门指南基于客户的营销入门指南（ABM）博客外联：如何在规模上做到这一点（不要感觉自己像个疯子）有什么问题或意见吗？在Twitter上告诉我。译者，John Zhao，西品东来创始人 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Si Quan Ong 营销@Ahrefs。 我爱阅读，爱跳霹雳舞，爱尝试随机的生活实验。",
  "headers": [
    {
      "level": "H1",
      "text": "入站与出站营销：有什么区别？"
    },
    {
      "level": "H2",
      "text": "什么是入站营销？"
    },
    {
      "level": "H3",
      "text": "1. 吸引"
    },
    {
      "level": "H3",
      "text": "2. 参与"
    },
    {
      "level": "H3",
      "text": "3. 喜悦"
    },
    {
      "level": "H2",
      "text": "入站营销示例"
    },
    {
      "level": "H2",
      "text": "入站营销：利弊"
    },
    {
      "level": "H3",
      "text": "利："
    },
    {
      "level": "H3",
      "text": "弊"
    },
    {
      "level": "H2",
      "text": "什么是出站营销？"
    },
    {
      "level": "H3",
      "text": "1. 受众定位"
    },
    {
      "level": "H3",
      "text": "2.消息推送"
    },
    {
      "level": "H3",
      "text": "3. 跟进"
    },
    {
      "level": "H2",
      "text": "出站营销示例"
    },
    {
      "level": "H2",
      "text": "出站营销：优点和缺点"
    },
    {
      "level": "H3",
      "text": "优点"
    },
    {
      "level": "H3",
      "text": "缺点"
    },
    {
      "level": "H2",
      "text": "入站与出站营销：两全其美"
    },
    {
      "level": "H3",
      "text": "1. 使用入站方式获取线索，并使用出站方式跟踪"
    },
    {
      "level": "H3",
      "text": "2. 利用内容建立品牌知名度"
    },
    {
      "level": "H3",
      "text": "3. 重新利用入站营销的入站内容"
    },
    {
      "level": "H2",
      "text": "不断学习"
    }
  ],
  "author": "Si Quan Ong"
}