{
  "url": "https://ahrefs.com/blog/zh/inbound-marketing/",
  "slug": "inbound-marketing",
  "title": "什么是入站营销？ 新手指南",
  "description": "入站营销是一种营销策略，旨在通过相关且有用的内容吸引客户。",
  "content": "Si Quan Ong 营销@Ahrefs。 我爱阅读，爱跳霹雳舞，爱尝试随机的生活实验。 内容 入站营销是一种营销策略，旨在通过相关且有用的内容吸引客户。由HubSpot的创始人Brian Halligan和Dharmesh Shah创造（他们注意到互联网时代需要一种新的营销范式），入站营销的目标是被潜在客户发现，同时和他们建立很好的关系。在这篇文章中，我们将了解到:入站营销与出站营销有何不同搜索引擎优化是如何工作的如何开始入站营销入站营销与出站营销出站营销是一种阻断式营销，你可以通过电话、电子邮件、直接邮件等方式将信息或产品推送给潜在客户。入站营销是相反的，你给那些需要的用户创建了有用的内容。入站营销如何运作根据HubSpot的说法，入站营销包含三个步骤： 吸引。引进合适的人才。 参与。帮助这些人了解他们的痛处和目标，这样他们就更有可能从你这里购买。 愉悦。为他们做更多的事情。帮助他们在你的产品上获得成功。它们一起配合，就像一个飞轮，天衣无缝。你为你的公司吸引了潜在客户。这些人参与你的内容，并最终被说服购买，把他们变成客户。在你的产品取得了卓越的成绩，加上令人惊叹的客户服务之后，他们就成了“大使”，把你推荐给他们的朋友。它类似于一个营销漏斗，只不过它不会在最后阶段停止。相反，最后一级推动第一级，推动第二级，以此类推——也就是飞轮。如何开始入站营销你已经看到了搜索引擎优化在理论上是如何工作的，但是在现实中又是如何执行的呢？好吧，搜索引擎优化是我们在 Ahrefs 的整个营销策略。我们花了很大一部分资源来创建有用的内容，教会我们的客户搜索引擎优化和数字营销，同时推广我们的产品ーー就像你现在正在阅读的这篇文章。我们的博客每月有超过60万的访问量，而这仅仅是来自 Google。我们的YouTube频道拥有约209,000名订阅者，每月获得约355,000次观看。与我们的客户喜爱的行业领先的产品一起，搜索引擎优化帮助我们成长为市场上最流行的搜索引擎优化工具之一。以下是我们如何在Ahrefs使用入站营销。1. 吸引如果人们不知道你的存在，他们就不能购买你的产品。所以，第一步是吸引潜在客户。对于搜索引擎优化来说，这主要是通过创建和发布内容，也就是内容营销来实现的。搜索引擎优化在Ahrefs，我们的收购策略以SEO驱动的内容营销为中心，即旨在在搜索引擎上排名靠前的内容。为什么是SEO驱动的？虽然你可以发布任何内容，只要你的读者感兴趣，但这些文章中的大多数不会得到长期的流量。当第一次发布时，他们可能会得到一个最初的流量激增（“希望的尖峰”），但当人们不再感兴趣时，人们的兴趣就会减弱（“没有希望的平坦线”）然而，如果你围绕人们在谷歌上不断搜索的主题创建内容，那么肯定会有持续的兴趣。只要你的文章在谷歌上排名靠前，你就会得到一致的、被动的自然搜索流量。这就是为什么我们的流量年复一年地持续增长:以下是我们在Ahrefs上创建SEO内容的方法：查找具有搜索流量潜力的主题我们在 Ahrefs 博客上发布的每一篇文章都针对一个具有搜索流量潜力的词。 17个针对小型企业的创意营销点子->“营销创意”（每月2500次搜索） 网站结构：如何建立网站的SEO基础ー > “网站结构”(每月800次搜索) 什么是SEO写作？ 如何成为一名更好的SEO作家—>“ seo写作”（每月2900次搜索）要查找这些主题，请使用关键词工具。例如，假设你拥有一个关于古饮食（the paleo diet）的网站。在一个免费的关键词研究工具（关键词生成器）里输入一个相关的话题，比如“Paleo (旧石器时代)”，它会提供关键词研究的想法，并告诉你这些话题有多受欢迎。滚动列表，看看有没有适合你网站的好话题。推荐阅读： 关键词研究: 初学者指南作者Ahrefs优化你的页面一旦你确定了一个你想要关注的话题，你就需要创建一些值得排名的内容。这意味着你的内容需要通过四个“检查”: 相关性。将你的内容与搜索意图匹配，即搜索查询背后的“为什么”。了解如何匹配本指南中的搜索意图。 彻底。覆盖所有搜索者期望和希望看到的东西。分析搜索意图会给你一个基本的概念，但是你也应该分析相关的排名最高的网页来获得线索。 独特性。如果你的内容和任何其他排名文章一样，那么没有人会点击并阅读它。你必须给带来新的东西。 清晰。让你的内容清晰易读。按照这里的提示来提高你的内容的可读性。完成此操作后，就可以进行“技术上的”优化，例如将关键词放在标题标签中。阅读下面的文章，获得一个关于优化搜索引擎页面优化的完整指南。推荐阅读: 页内搜索引擎优化: 初学者指南建立链接谷歌的 Andrey Lipattsev 说链接是谷歌三大排名因素之一。所以，如果你想在搜索有竞争力的东西时排名靠前，你几乎肯定需要链接。例如，我们最近做了一个链接建设活动，我们建立了链接到我们的网页搜索引擎优化统计数据。我们从32个独特的网站获得了36个链接。这将我们的页面推到了第一名，从那时起我们一直保持着最高的位置。想要学习如何开始链接建设吗? 观看这个视频:https://www.youtube.com/watch?v=C5ddo63kHHI推荐阅读: SEO 链接建设: 初学者指南(2021)视频营销内容营销不仅仅是书面文字。还有视频内容。是世界上第二受欢迎的搜索引擎。下面是我们如何做视频营销。寻找具有搜索流量潜力的视频主题像谷歌一样，要在 YouTube 上排名，你必须针对人们正在搜索的主题。要找到这些话题，请使用我们的 YouTube 关键词生成器。输入一个相关的关键词，然后滚动列表查看是否有任何相关的主题。创建优化的视频你只有30秒时间。如果到那时你还没有抓住他们的注意力，观众就会离开。所以，除非你可以像戴夫查普利（Dave Chappelle）一样即兴演奏，并且仍然保持人们的兴趣，否则我们建议你编写你的视频脚本。这样，你的视频就会简明扼要，而且不会让你跑题。然后，一旦记录下来，进行策略性的编辑，使它们变得有趣并继续吸引注意力。https://www.youtube.com/watch?v=j5EOWffq-gk&feature=emb_title推荐阅读： YouTube SEO: 视频排名从入门到精通推广你的视频在 YouTube 上排名并不是你获得更多视频点击量的唯一途径。阅读这篇文章或者观看这个视频获得更多的技巧:https://www.youtube.com/watch?v=iwkUlTl2Iow&feature=emb_title播客我们已经介绍了文字和视频。 当然，我们不能遗漏音频。 最受欢迎的格式是播客。这很有趣。 即使我们从未创建过自己的播客，但还是收到了大量的注册请求。这为什么会发生? 很简单: 因为我们出现在博客主的节目中。因为有大量的播客，而且他们需要客人，我们认为使用现有的播客比自己制作更容易。所以我们是这样做的。寻找播客机会当然，最简单的方法就是在谷歌上搜索你所在领域的播客。但是，如果你刚刚开始出现在他们的节目中，那么很可能蒂姆 · 费里斯（Tim Ferriss）表演不会是你的第一站。因此，另一种方法是在你所在的行业中找到一个同样水平的人，他曾在多个播客上做过嘉宾。例如，在个人发展领域，斯科特 · 杨（Scott Young）是相对知名的。因此，我们将进入他的网站进入 Ahrefs 的网站分析，到外链报告，并输入他的名字在“包括”框。我们还将只过滤“引用页面的标题”正如你所注意到的，“推荐页面”栏目中的链接大多是播客采访。推销你自己作为一个客人找到播客主持人的电子邮件，联系他们，让他们知道你有兴趣成为客人。推荐阅读: 我在4个月内做了20多次播客采访，学到的12个教训2. 参与仅仅是因为人们现在正在访问你的网站，并不意味着他们会自动购买。 这只是进入“参与”‘阶段的地方。你必须了解他们的痛处和目标。然后，你必须提出帮助他们解决问题的见解和解决方案。下面是我们在 Ahrefs 如何做的一个例子。搜索者想知道如何找到谁链接到他们的网站。 他们在Google上搜索该查询并找到我们的内容。 你猜怎么着？ 我们的产品-网站分析-解决了这个问题。 因此，我们将其作为他们可以在本文中使用的潜在工具。我们的工具集基本上就是为了解决这个问题而创建的，所以，这是故事的一部分。当你把精力集中在以下主题上:具备搜索流量潜力;是你的客户想要解决的问题;是你的产品解决的问题你同时满足以上的两个部分。你的内容不仅会在谷歌上排名，会获得新的潜在客户，同时你也会立刻吸引他们。但这不是我们做的唯一一件事。以下是我们在入站营销策略中使用的其他一些让用户参与的策略。电子邮件营销不是每个人都会在读过你的内容之后买你的东西。有时，他们需要更多的时间来评估。或许他们正处于买家旅程的另一个阶段ーー也许他们只是发现自己有问题。不管是什么原因，你都需要一个方法去接触他们，这样你才能继续参与。最好的方法是建立一个电子邮件列表。在 Ahrefs，我们通过在文章旁边显示一个电子邮件注册框来保持简单。这当然不是唯一的办法。你也可以为注册提供奖励ー免费的电子书、工作表、 PDF 版本的文章等等。一旦他们注册了，就不要让他们继续下去。保持这种关系。对于我们来说，我们发送一封欢迎邮件，展示博客上最好的文章:你不必照搬我们的做法。世界是你的。你可以测试不同的电子邮件，看看哪些最适合你的读者。免费工具在阅读了我们的内容之后，有些人想要试用我们的工具集。他们想看看它是如何为自己工作的。所以，我们帮助他们。他们可以注册 Ahrefs站长工具，这个工具可以让他们免费访问自己网站的网站分析和网站诊断:或者他们可以使用我们的任何免费SEO工具：最精彩的部分？每个工具的目标都是一个具有搜索流量潜力的关键词。就像我们的博客文章一样，它们是为“获取”和“参与”阶段而设计的。一石二鸟。是否想学习如何将免费工具用作入站营销策略？ 阅读这篇文章（跳转到＃4）。课程我们的首席营销官 Tim Soulo 曾经告诉我:我的理论是，人们不会注册你的工具，然后学习如何使用它。我的理论是，人们首先学会如何使用你的工具，他们注册是因为他们知道如何使用你的工具。Tim Soulo, 首席市场总监 Ahrefs我们的博客教他们如何使用我们的工具集，去解决搜索引擎优化和数字营销问题。如果他们想更进一步，我们有一个学院，潜在客户可以在那里观看我们的两个免费课程中的任何一个:这些课程让潜在客户有信心。就像 Tim 说的那样ーー当他们注册我们的产品时，他们已经知道如何从我们的内容中使用 Ahrefs。但它不仅仅适用于与潜在客户交流。它也“渗入”到下一个阶段ーー喜悦。现有客户可能需要进一步的产品培训，可以随时参考这些培训计划。这有助于留住它们，因为它们总是在学习如何使用我们的工具集做更多的事情。双赢。3. 喜悦当一个潜在客户变成一个客户后，这并不是结束。记住：它是一个飞轮。每一个高兴的顾客都可以向他们的朋友和家人传播这个信息。这反过来会让你得到更多的客户，他们可以推荐更多的人。循环可能是无限的。但只有当你在这个阶段表现出色，取悦顾客时，飞轮才会转动。最好的办法就是拥有一个好的产品。正如谚语所说：“你不能给猪涂口红。”如果你的产品不起作用，或者不能帮助你的顾客解决他们的问题，那么任何“快乐策略”都不会让你的顾客高兴。所以，这是你应该做的第一件事。一旦你奠定了基础，你可以考虑应用以下任何策略，以上是我们使用的：在线聊天如果我们的客户遇到我们软件的问题，或者他们不确定如何做某些事情，他们可以通过在线聊天随时联系我们。这样可以减少挫折感，因为他们几乎可以立即得到帮助。“如何使用 “教程在很大程度上，我们为客户提供了超越一切的服务，那就是不断对他们进行两方面的教育： 如何做 SEO;如何使用 Ahrefs 做 SEO我们通过我们的博客、 YouTube 频道和课程来做到这一点。但是，我们知道并不是每个人都有时间检查我们的内容，以弄清楚我们的报告是如何工作的。因此，我们决定在工具集本身中构建教程。点击他们，它将向您展示使用报告的所有不同方式如果用户卡住了，他们可以遍历本教程并弄清楚该怎么做。要点：确定如何将教程嵌入产品中，以教客户如何使用某些功能。客户专属社区邀请每位新的Ahrefs客户加入我们的纯客户社区Ahrefs Insider。使之成为客户至上，使集团保持高品质。每个成员都知道，每个人都与这个游戏有关ーー他们订阅了这个产品，并且对搜索引擎优化非常认真。这带来了高质量的讨论，加上会员们非常乐意互相帮助解决数字营销问题。他们也被允许对产品的开发提供反馈和投入，并且通常会首先看到新的特性。这巩固了我们和客户之间的关系，也表明我们愿意倾听。想知道我们是如何建立起这个拥有14000名成员的强大团队的吗? 请看:https://www.youtube.com/watch?v=48C-KNdzDeU最后的想法HubSpot的创始人创造了这个术语，它的入站营销方式大不相同。 尽管他们执行了与我们类似的策略，但他们拥有销售团队。 这意味着他们的重点是为他们的销售团队提供足够的流量和合格的销售线索。Ahrefs主要是自助服务，没有销售团队，因此我们选择了这种方式来执行我们的入站营销策略。你的公司将会有所不同。毕竟，你可能在一个不同的行业，针对不同的客户，建立不同和有区别的资源。这意味着你将使用不同的策略。但是搜索引擎优化的原则是一样的: 吸引—- 参与—- 愉悦。我是不是错过了一些关于入站营销的重要信息。让我在Twitter上知道。译者，赵子荣，SEOZZR博客创始人 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Si Quan Ong 营销@Ahrefs。 我爱阅读，爱跳霹雳舞，爱尝试随机的生活实验。",
  "headers": [
    {
      "level": "H1",
      "text": "什么是入站营销？ 新手指南"
    },
    {
      "level": "H2",
      "text": "入站营销与出站营销"
    },
    {
      "level": "H2",
      "text": "入站营销如何运作"
    },
    {
      "level": "H2",
      "text": "如何开始入站营销"
    },
    {
      "level": "H3",
      "text": "1. 吸引"
    },
    {
      "level": "H4",
      "text": "搜索引擎优化"
    },
    {
      "level": "H5",
      "text": "查找具有搜索流量潜力的主题"
    },
    {
      "level": "H5",
      "text": "优化你的页面"
    },
    {
      "level": "H5",
      "text": "建立链接"
    },
    {
      "level": "H4",
      "text": "视频营销"
    },
    {
      "level": "H5",
      "text": "创建优化的视频"
    },
    {
      "level": "H5",
      "text": "推广你的视频"
    },
    {
      "level": "H4",
      "text": "播客"
    },
    {
      "level": "H5",
      "text": "寻找播客机会"
    },
    {
      "level": "H5",
      "text": "推销你自己作为一个客人"
    },
    {
      "level": "H3",
      "text": "2. 参与"
    },
    {
      "level": "H4",
      "text": "电子邮件营销"
    },
    {
      "level": "H4",
      "text": "免费工具"
    },
    {
      "level": "H4",
      "text": "课程"
    },
    {
      "level": "H3",
      "text": "3. 喜悦"
    },
    {
      "level": "H4",
      "text": "在线聊天"
    },
    {
      "level": "H4",
      "text": "“如何使用 “教程"
    },
    {
      "level": "H4",
      "text": "客户专属社区"
    },
    {
      "level": "H2",
      "text": "最后的想法"
    }
  ],
  "author": "Si Quan Ong"
}