{
  "url": "https://ahrefs.com/blog/zh/keyword-search-volume/",
  "slug": "keyword-search-volume",
  "title": "关键字搜索量：你需要知道的 5 件事 规避常见 SEO 错误",
  "description": "搜索量经常用于 SEO。 但如果你只看表面，看可能让你做出糟糕的营销决策。",
  "content": "Tim Soulo Tim是Ahrefs的CMO以及产品顾问，同时他也是该公司最狂热的粉丝和最忠诚的传播者。 内容 搜索量可能是 SEO 中最常用的指标。 它可以帮助我们衡量各种关键词的受欢迎程度，并且我们可以预测从它们的排名中能获得的搜索流量。但很多时候，缺乏经验的 SEO 人员只看到了关键词搜索量指标的表面，这会导致它们做出糟糕的营销决策、浪费了宝贵的业务资源。在这篇文章中，我们将仔细研究搜索量指标，解释它是什么，它来自哪里，以及它如何会让你误入歧途。什么是关键词搜索量？关键词搜索量是一个 SEO 指标，它告诉你平均每月在特定地区搜索某个关键词的次数。 搜索量通常是指谷歌的搜索次数，但这个指标也可以用于其他的搜索引擎。需要指出的一个重要区别是，搜索量反映了关键词的实际搜索次数，而不是搜索该关键词的唯一人数。因此，如果某个关键词的每月搜索量为 100，则这些搜索可能由 100 个不同的人执行，或者可能只有 10 个人平均进行了 10 次搜索。这个现象只是冰山一角，人们在分析关键词的搜索量经常不会考虑到这一点。因此，让我们讨论你需要了解的五件事，以便更好地利用此指标。1. 搜索量数字是年度平均值大多数 SEO 工具报告中的搜索量是年度的平均值。 对于全年搜索需求相对一致的搜索词来说，这并不是什么大问题。但这对于季节性搜索词、或热门的趋势词可能会产生很大的误导。下面我们来对比一下 “content marketing” 和 “NFT” 这两个关键词的搜索量趋势。一年中，“content marketing” 这个关键词每月的搜索量一直在 12k 到 17k 之间徘徊。 因此，它的年均 16k 的搜索量是一个合理的预测。不过，对于关键词 “NFT” 来说，情况就完全不同了。 在一年的时间里，它从几乎一无所有到 3 月份的搜索量高达 230 万次。 然后它在 6 月下降到 374k，并在 8 月上升到 952k。换句话说，很难预测其搜索量在未来几个月将如何波动，以及一旦 NFT 的热潮消退后最终将稳定在哪里。我想用这两个例子来说明搜索量可能是非常不稳定的。 并且 SEO 工具报告的 12 个月的平均搜索量可能与你为该关键词排名时发现的每月搜索量是不完全匹配的。 2. 并非所有搜索都会产生点击人们搜索某些东西时并不一定会点击任何搜索结果。事实上，谷歌的目标是立即满足其用户，然后不让他们 “浪费时间” 点击任何搜索结果。 根据最近的一项研究，在 2020 年，三分之二的谷歌搜索没有点击就结束了。2020 年，三分之二的谷歌搜索没有点击就结束了。 例如，关键词 “elon musk age” 每月（平均）获得 37,000 次搜索。 但搜索结果的点击次数（根据 Ahrefs）仅为 6.3k。发生这种情况是因为，谷歌对这个问题给出了即时答案，用户是不需要点击任何搜索结果的：因此，如果一个搜索词的搜索量很大，并不一定意味着它会给你带来大量的搜索流量。 谷歌可能会直接在其搜索结果中显示答案。3. 广告商可能会 “窃取” 你的点击次数还有一件事可能会 “窃取” 这些宝贵的点击：Google Ads。截至今天，谷歌在自然搜索结果上方显示多达四个付费搜索列表。 如果你了解过这些付费展示位置的历史，很明显谷歌正试图缩小这些广告与自然搜索结果d额区别。它还倾向于用图片和附加链接来美化这些广告，以最大限度地利用它们占据的空间，并将自然搜索结果推到下方。换句话说，某些热门关键词的排名不再保证你会从中获得大量点击。Ranking Top3 in Google in 2021:#AD1-Link-Link-Link-Link#AD2 (+🖼️)- links- button#AD3 (+🖼️)#1 Organic result- links#PeopleAlsoAsk-Q1-Q2-Q3-Q4#KnowledgePanel (for a related term)- 🖼️🖼️- text- link- link- link- link#PeopleAlsoSearchFor🖼️🖼️🖼️ pic.twitter.com/BbAfwwwjVk— Tim Soulo 🇺🇦 (@timsoulo) June 29, 2021即使你查看要为其排名的关键词的搜索结果中没有广告，也不能保证将来不会出现广告。 实际上，通过在关键词中排名靠前，你将竞争对手的页面推到下方，让他们没有搜索流量； 这很可能会激起他们开始投放广告。4. 搜索量不是很准确谷歌关键词规划师被广泛认为是关键词搜索量数据的最佳来源，因为它直接来自谷歌本身。 绝大多数 SEO 工具都会从 GKP 中提取关键词搜索量，这已经不是什么秘密了。但是 GKP 中的搜索量数字有多准确？好吧，就搜索量而言，有一个数据来源被普遍认为是 “单一事实来源”：Google Search Console。如果你的网站始终在某个关键词的谷歌排名中名列前茅，那么你的网页为该关键词获得的 “展示次数” 将是其实际搜索量。这意味着如果我们将搜索量与来自 GSC 的相同关键词的实际印象进行比较，我们可以轻松地研究 GKP 中搜索量的准确性。这正是我们在最近的实验中所做的。事实证明，GKP 中的搜索量仅在 45% 的情况下 “大致准确”。 在其余情况下，GKP 搜索量与 GSC 展示量相差很大。换句话说，将 GKP 中的搜索量称为 “准确” 是相当牵强的。 我们甚至不能为此批评 GKP，因为它是广告商的工具，而不是 SEO。GKP 倾向于将具有相似含义的搜索查询混合在一个组中，而无需选择查看每个查询的不同搜索量。 这对于广告商来说非常方便，但对于 SEO 来说可能是一个真正令人头疼的问题。例如，以下六个关键词将全部融合为一个：pc games free downloadfree pc games downloadfree games download for pcdownload free games for pcfree pc game downloadsdownload pc games freefree games to download for pc大多数 SEO 工具都会模仿这种行为，因为它们是从 GKP 获取搜索量。 因此，他们将为这些关键词变体中的每一个显示相同的搜索量。但是在 Ahrefs，我们将其他一些数据源混合到我们的搜索量数据中（包括几年的历史点击流数据），这使我们能够 “取消” 许多这样的关键词集群，并为每个集群的个别关键词显示不同的搜索量 ：这样就可以组 Ahrefs 的搜索量比 GKP 的搜索量更准确。 然而，我们的搜索量仍然只是预估值，而不是许多用户希望看到的确切值。5. 更高的关键词搜索量 ≠ 更多的流量SEO中关键词搜索量指标的主要用例是估计你的页面在为关键词排名时可能获得的潜在自然搜索流量，对吗？好吧，让我们看看以下两个关键词：如果我们比较他们的全球的搜索量，关键词 “local SEO” 似乎比关键词 “submit website to search engines” 流行 27 倍。那么这是否意味着 “local SEO” 排名第一的页面应该比 “submit website to search engines” 排名第一的页面获得更多的搜索流量？ 让我们在 Ahrefs Site Explorer（网站分析） 中检查一下：事实证明，我们的假设是完全错误的。 理论上流量小的页面，似乎获得了两倍的搜索流量。为什么会这样？好吧，这是因为页面不仅仅会针对单个关键词进行排名。 如果你仔细查看上面的两个屏幕截图，你会发现 “local SEO” 排名靠前的页面在 Google 中参与 311 个关键词的排名（在自然关键词那一栏），其中 8 个词排名在前 3 位。至于 “submit website to search engines” 排名第一的页面，它在谷歌中总共有 1400 个关键词排名，其中 201 个词排名前 3 位。以下是其中一些关键词：无论你想到什么搜索词，不同的人都会用不同的方式表达它。 但谷歌足够聪明，可以理解所有这些人基本上都在寻找相同的东西。 因此，这些搜索词变体的搜索结果都是几乎相同的页面排名。我们立即研究了这种“现象”，结果发现平均排名靠前的页面也会对大约一千个相似的关键词进行排名。这意味着在估算其搜索流量潜力时，你不能盲目依赖单个关键词的搜索量。 相反，你需要做的是检查排名靠前的页面，看看他们从他们排名的所有关键词中总共获得了多少搜索流量。在 Ahrefs，我们非常迷恋这个概念，因此我们创建了一个独特的指标，称为 Traffic potential（流量潜力）：对于你在 Keywords Explorer（关键词分析）中看到的任何关键词，我们都会拉出排名最高的页面，并查看它从在能从 Google 各种关键词变体中获得的总搜索流量。 这个数值就是该关键词的Traffic potential（流量潜力）。在 Ahrefs 的内容营销团队中，多年来我们一直在手动进行这项工作，这对我们选择正确的目标话题有很大的帮助。 现在这个指标已经被添加到 Keywords Explorer（关键词分析）中，供大家使用。最后以上，是新手 SEO 人员在处理关键词搜索量指标时经常忽略的五件事。既然你已经掌握了这些知识，我相信你将不再从表面上看待搜索量指标，这将大大提高你的 SEO 决策的质量。同时，我想提最后一件事。 把它放在这篇文章的正文中似乎有点太明显了，但没有它会感觉有点不完整：切勿仅根据搜索量来选择关键词。当然，关键词研究不仅仅是寻找搜索量最大的关键词。以下是需要考虑的其他一些问题：这个关键词会为我的业务带来价值吗？这个关键词会带来任何销售的增长吗？我能否击败该关键词的排名靠前的页面？为这个关键词排名需要什么？在选择要使用的关键词时，请始终牢记这些问题。译者，Park Cheng，歪猫出海创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Tim Soulo Tim是Ahrefs的CMO以及产品顾问，同时他也是该公司最狂热的粉丝和最忠诚的传播者。",
  "headers": [
    {
      "level": "H1",
      "text": "关键词搜索量：你需要知道的 5 件事规避常见 SEO 错误"
    },
    {
      "level": "H2",
      "text": "什么是关键词搜索量？"
    },
    {
      "level": "H2",
      "text": "1. 搜索量数字是年度平均值"
    },
    {
      "level": "H2",
      "text": "2. 并非所有搜索都会产生点击"
    },
    {
      "level": "H2",
      "text": "3. 广告商可能会 “窃取” 你的点击次数"
    },
    {
      "level": "H2",
      "text": "4. 搜索量不是很准确"
    },
    {
      "level": "H2",
      "text": "5. 更高的关键词搜索量 ≠ 更多的流量"
    },
    {
      "level": "H2",
      "text": "最后"
    }
  ],
  "author": "Tim Soulo"
}