{
  "url": "https://ahrefs.com/blog/zh/keyword-strategy/",
  "slug": "keyword-strategy",
  "title": "如何构建关键词策略[免费模板]",
  "description": "建立关键词策略是决定在自然搜索中定位和优先考虑哪些关键字的过程。 这篇文章讲告诉你如何做到的。",
  "content": "Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。 内容 构建关键词策略是决定自然搜索中，针对哪些关键词并确定优先顺序的过程。有很多方法可以做到这一点，但是所有的方法都可以归结为找到以下关键词:潜在客户正在寻找。对你的生意有价值。都在你的能力范围之内。让我们用四个简单的步骤来演示如何做到这一点。专家提示 使用我们的免费关键词策略模板，从这篇文章中获取更多信息。你将在步骤4中学习如何完成它。内容1. 查找具有流量潜力的关键词针对那些没有人输入谷歌的关键词是没有意义的，因为即使你排名第一，他们也不会给你发送流量。所以第一步是找到潜在客户正在搜索的关键词。让我们看看实现这一点的几种方法。A. 查看竞争对手的哪些页面获得最多流量如果你的竞争对手在一个页面上获得了大量的自然流量，那么他们所针对的关键词必须有潜在的流量。因为它们是竞争对手，所以这些关键词可能也是你的客户正在搜索的。下面是如何找到你的竞争对手的网页获得最多的搜索流量: 转到 Ahrefs 的网站分析输入竞争对手的域名转到 Top pages 报告例如，如果你正在为一家在线电脑零件店寻找关键词，你可以输入newegg.com。在报告中，你将通过估计的自然流量和向每个页面发送最多流量的关键词来查看其热门页面。专家提示 如果你在“Top keyword”一栏中看到很多品牌提及，过滤掉包含这些词的关键词。记下你的客户可能正在搜索的任何内容以下是我们假设的计算机零件商店的一些信息：请注意，我们没有突出显示“gaming desk”或“gaming pc”，因为我们的商店销售的是电脑零件，而不是配件或现成电脑。针对这些关键词没有意义，因为搜索这些关键词的人不是我们的客户。B. 使用关键词研究工具关键词研究工具是可以搜索和过滤的大型关键词数据库这是使用我们的关键词工具查找具有流量潜力的关键词的方法：转到Ahrefs的关键词分析输入一些与你的网站相关的关键词（这些被称为“种子关键词”）转到匹配项报告筛选具有潜在流量（TP）的关键词例如，对于计算机零件商店，你可以输入种子关键词，如pc、computer、computers、motherboard、mother board、amd和intel。然后，你将在匹配项报告中筛选具有流量潜力的关键词。专家提示 流量潜力是一个关键词排名靠前页面的每月自然搜索流量的预估。与搜索量相比，它往往是对关键词的真实流量潜力更可靠的估计，因为页面倾向于对许多关键词进行排名，而不仅仅是一个关键词。在这里了解更多。现在，这只是一个目测潜在客户正在搜索的关键词报告的例子。2. 检查它们对你的业务的价值潜在客户正在搜索的每个关键词对你的业务都有一定的价值。但有些人比其他人更有价值。以这三个关键词为例:“graphics card”-搜索者正在四处购物。他们还没有准备好购买。“ b550 vs x570 motherboard”-搜索者已经做了一些购物，并缩小了他们的选择范围。他们马上就要买了。“ amd ryzen 5 3600”-搜索者已经决定了他们想要什么。他们已经准备好购买。考虑到这些搜索者中的一些人比其他人更接近于购买计算机部件，一些关键词可以说对计算机部件商店更有“商业潜力”。这些是你在关键词策略中应该优先考虑的内容。下面是一个快速的备忘单，用于对关键词的“业务潜力”进行评分：小提示. 这是基于我们在评估博客关键词时提出的评分系统。在我们的关键词研究指南中阅读更多关于这方面的内容。记住，你给关键词打分的方式可能和别人给关键词打分的方式不同。这取决于它对你的生意有多大价值。例如，如果你不出售“ amd ryzen 53600”，那个关键词的“商业潜力”得分为0，而不是3。3. 检查排名难度关键词的排序难度因多种原因而不同。这并不意味着你应该避免那些比其他人更难排名的关键词，但在制定关键词策略时，考虑排名难度是很重要的。下面是我们建议你在评估排名难度时要注意的四点:外链外链是谷歌排名最靠前的因素之一。当前排名靠前的页面拥有的高质量外链越多，就越难与之竞争。要大致了解你需要多少个外链才能破解前10名，请查看Ahrefs的关键词分析中的关键词难度（KD）得分。这是基于排名靠前页面的链接数。要进行更彻底的评估，请滚动到SERP概述，并查看“Domains”列，以查看链接到每个页面的网站的数量。请记住，这些数词只能告诉你每个页面的链接数量。为了理解链接质量，你必须检查每个页面的外链配置文件。你可以通过点击“Backlinks”列中的数字来得到这个结果。了解更多: 如何进行基本的外链审计权威许多SEO认为受欢迎网站在谷歌上的排名更容易。因此，大多数人在评估关键词的排名难度时，会考虑网站权威指标，如域名评分（DR）。Do you pay attention to Domain Rating (or any other “website authority” metric) when analysing your chances to rank for a given keyword?— Tim Soulo 🇺🇦 (@timsoulo) April 27, 2022 谷歌代表曾多次表示，谷歌不会评估网站的权威性。但是，网站的所谓权威性可以通过几种方式间接地对排名做出贡献。内部链接-高 DR 网站往往有更多的高权威网页，从这些网页的内部链接可能有助于其他网页的排名更高。熟悉的品牌-搜索者可能希望看到一些家喻户晓的查询名称。如果那不是你，你的排名可能会更难。如果你认为 Google 把站点权威考虑在内，或者只是为了安全起见而犯错，那么在关键词分析中查看排名靠前的网页的 DR 得分。如果它们都比你的网站的 DR 高得多，你可能需要优先考虑其他关键词。专家提示 要查找你的网站的 DR 评分，请在网站分析中输入你的域名。搜索意图人们在搜索的时候都在寻找特定的东西。这就是他们的搜索意图。由于谷歌希望给予搜索者他们想要的东西，除非你能创建与意图相一致的内容，否则你将很难获得关键词的排名。例如，搜索“backlink checker”的人显然是在寻找一个免费的工具。我们知道这一点是因为所有排名靠前的结果都是免费的工具。为了获得这个关键词的几乎任何排名机会，你需要创建一个免费的工具。除非你有我们这样的外链数据库否则几乎不可能。因此，我们建议分析三个搜索意图的排名靠前页面，以找出关键词的排名难度内容类型-他们是博客文章，登陆页面，产品页面，或其他东西？内容格式——它们是列表、操作指南、食谱、工具还是其他什么？内容角度-是否有一个主要的卖点，比如有多容易？了解更多: 什么是搜索意图? 初学者完整指南质量如果你的关键词排名最高的网页是高质量的，这将需要更多的时间和努力来竞争。例如，在“best air purifier”排名第一的人们在八年中测试了47个空气净化器，以提出他们的建议。要在内容质量上进行竞争，需要花费大量的时间、精力和金钱。将此结果与许多其他查询的顶部结果进行比较，这些查询没有关于如何选择建议的背景信息。在内容质量上击败这些公司可能比前者容易得多根据你对上述四个属性的评估，你可以给关键词一个“排名潜力”得分，如下所示：4. 把它们放在一起从这个过程中创建关键词策略意味着将所有内容合并到一个文档中。你可以使用我们的免费模板。这是一个简单的电子表格，包含以下数据点和条件格式：关键词流量潜力（TP）业务潜力（BP）排名潜力（RP）这个策略文档让你一眼就能看到最有前途的关键词。例如，如果我们为假设的计算机零件商店评估几个关键词，关键词“amd ryzen 5 3600”具有高TP、BP和RP。因此，该行全部为绿色On the other hand, “how to install ram on pc” has high TP but low BP and RP. So the row is mostly red. 从这里开始，你的关键词策略很简单：优先选择流量、业务和排名潜力最大的关键词。继续学习如果你想了解更多关于查找、优先排序和关键词排名的知识，请阅读以下内容:关键词研究: 初学者指南高级关键词研究: 查找未开发关键词的5个技巧关键词难度: 如何评估你的排名机会如何为搜索引擎优化选择正确的关键词译者，John Zhao，西品东来创始人 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。",
  "headers": [
    {
      "level": "H1",
      "text": "如何构建关键词策略[免费模板]￼"
    },
    {
      "level": "H2",
      "text": "1. 查找具有流量潜力的关键词"
    },
    {
      "level": "H3",
      "text": "A. 查看竞争对手的哪些页面获得最多流量"
    },
    {
      "level": "H3",
      "text": "B. 使用关键词研究工具"
    },
    {
      "level": "H2",
      "text": "2. 检查它们对你的业务的价值"
    },
    {
      "level": "H2",
      "text": "3. 检查排名难度"
    },
    {
      "level": "H3",
      "text": "外链"
    },
    {
      "level": "H3",
      "text": "权威"
    },
    {
      "level": "H3",
      "text": "搜索意图"
    },
    {
      "level": "H3",
      "text": "质量"
    },
    {
      "level": "H2",
      "text": "4. 把它们放在一起"
    },
    {
      "level": "H2",
      "text": "继续学习"
    }
  ],
  "author": "Joshua Hardwick"
}