{
  "url": "https://ahrefs.com/blog/zh/keyword-mapping/",
  "slug": "keyword-mapping",
  "title": "关键词映射，好奇者实用指南",
  "description": "了解关键词映射和此方法的两个级别：一个更快，另一个更彻底但耗时。",
  "content": "Mateusz Makosiewicz Ahrefs 的营销研究员和教育家。 Mateusz 在推广代理、SaaS 和硬件业务领域拥有超过 10 年的营销经验。平时喜欢创作音乐或享受长距离的散步。 内容 决定一个关键词是应该被一个单独的页面作为目标，还是与其他关键词聚集在一起，是SEO中的一个常见问题。关键词映射是一个旨在解决此问题的过程。关键词映射通常被定义为将关键词分配给页面。但是，真正需要解决的问题是将主题分配给内容类型在本文中，我将解释这种方法的好处，更重要的是，我将向你展示这个过程。不需要模板。内容关键词映射的好处（另一种方式）事实1。谷歌可能会把看似不同的关键词看作同一个话题。例如，我们将这些关键词排在前10位，只有一个页面:“搜索引擎优化基础”“如何使用搜索引擎优化”“初学者搜索引擎优化指南”“从搜索引擎优化开始”“ SEO 知识”事实2。相反，谷歌可能会看到看似相似的关键词作为不同的主题。例如，让我们比较“数字营销”和“在线营销”我得说这两个关键词非常接近。谷歌反对。无论你往哪里看，都是一样的故事。排名靠前的页面和我们的SERP相似性得分（100分制；越多，相似性越高）表明，从SEO角度来看，这些是完全不同的主题。以上两个事实，也是仅仅依靠关键词进行关键词映射，不是最佳方式的原因。你不会知道你是在浪费时间，用不同的关键词针对同一个话题，还是只是“混淆”了谷歌。但是，为什么是内容类型而不是页面甚至URL呢？因为在决定使用哪个页面来定位关键词之前，你需要确定关键词的搜索意图。一个很好的起点是，识别谷歌第一页上占主导地位的内容类型。总之，使用主题和内容类型进行关键词映射的好处是：以谷歌相同的方式看待关键词：作为主题和子主题将搜索意图纳入流程保持主题的有序列表，这也有助于防止内容重复。注意关键词映射不能替代关键词研究。虽然关键词映射基本上是组织关键词的一种形式，但关键词研究为你提供了关键词和信心你的关键词具有流量潜力。你可以匹配关键词后面的搜索意图。你的关键词会带来有价值的流量。你可以根据这些关键词排名。通过我们的完整指南了解如何选择正确的关键词。更进一步，我们将研究使用这种方法的两个层次: 快车道和更彻底的一个。了解更多: 什么是语义搜索? 它如何影响搜索引擎优化第一级 — 快速，合理的工作你将需要一个关键词研究工具，可以根据 SERP 上的内容进行关键词分组，比如 Ahrefs 的关键词分析。就这个工具而言:输入你的关键词打开词组匹配报告转到“父主题”选项卡如果单击“父主题”，你将发现从关键词“提取”的单独主题。例如，你会看到像“婴儿会不会得冠状病毒疾病”和“婴儿和冠状病毒疾病”这样的关键词，被放在同一个主题下。小提示. 如果单击“父主题”，你将发现从关键词“提取”的单独主题。例如，你会看到像“婴儿会不会得冠状病毒疾病”和“婴儿和冠状病毒疾病”这样的关键词被放在同一个主题下。在这个级别的关键词映射中，你的目标关键词是父主题（而不是该父主题中的关键词）。下一步是确定内容类型。最简单的方法是，看看什么样的内容，在谷歌的前三到五个结果中占主导地位。典型的内容类型有：文章视频产品页面产品类别页着陆页例如，“出牙症状”的主要内容类型是文章。因此，将主题分配给内容类型，将为你提供一个超级简单但高度可操作的数据库。话题内容类型Teething symptoms (出牙症状)文章When do babies roll over (婴儿什么时候翻身)文章Baby formula (婴儿配方奶粉)混合（产品页面在顶部）When can babies have water (婴儿什么时候可以喝水)文章小提示. 次要关键词或辅助关键词呢？我们建议在内容创建阶段，选择它们作为完整覆盖主题所需的子主题。学习一些方法，你可以在这里找到它们。这是最快的方法。它的伟大之处在于，它通过使用真实的 SERP 数据(而不仅仅是语义)，来自动化关键词分组。然而，它也有不利的一面。有时，它会“隐藏”不太受欢迎的主题，这些主题可能会成为单独页面的目标。这就是原因。父关键词派生自 SERP 上的顶级页面。如果谷歌认为最好的答案是，在一个针对更广泛主题的页面上找到的，它仍然会使用它。这可能会导致像下面这样令人困惑的搜索结果页面:最上面的结果是，从一个主题更广泛的页面上截取了一个特色片段。因此，Ahrefs中的父主题（此处被视为“Top关键词”）。但SERP上几乎所有其他页面都直接针对关键词。这种情况可能不会经常发生。但是，如果你想从关键词映射过程中挤出所有内容，你需要进入第2级。第二级 — 全面但耗时在第二级，我们将仔细查看父主题，看看其中有什么内容首先，你应该选择一个父主题。按KD（关键词难度）对主题内的关键词进行排序。KD的巨大差异将表明SERP上有一组不同的页面。如果你看到一个关键词难度与父主题明显不同，请单击SERP按钮。查看排名靠前的页面（不包括第一个结果）是否谈论关键词而不是父主题。你可以使用 Compare With (比较与)功能快速了解情况。SERP similarity (SERP相似性)得分越低，你看到两个不同主题的概率就越高。我们来看几个例子。在第一个例子中，我们得到了一个 KD 得分比 Parent Topic 高20分的关键词。经过研究，我们发现我们可能正在处理两个独立的主题: SERP 相似性相当低。此外，只有一个共同的结果，而其他网页的目标直接关键词。下一个例子。这里我们有“出牙症状”(KD 65)和“婴儿什么时候长臼齿”(KD 28)。查看 SERP 的相似性，我们发现这可能是两个主题的情况。但还有更多。只有底部的结果直接针对关键词。其他人谈论的是初期的时间线、阶段、图表等等。这是另一种关键词排名方法的提示。一般来说，当你看到自己正在处理一个“伪装”的独立话题时，你的决定可以归结为:无论如何都要以父主题为目标。例如，如果最重要的结果是一个精选摘要，那么你可以通过一个相关的更广泛主题的页面来赢得它将关键词标记为单独的主题，并使用单独的页面直接将其作为目标。在这种情况下，将该关键词添加为目标主题，并记下内容类型在更困难的情况下转向SERP分析（如我们上面的例子）。最后的想法你可以自定义流程并添加自己的数据点。如果你想更进一步，分配 URL、网站文件夹，或者引入某种优先级(例如，业务潜力) ，这不会有什么坏处。然而，请记住，关键词映射不是一个很好的方式来设计你的整个网站结构。大多数情况下，网站上的所有页面都不应该是基于搜索的。关键词映射之后的下一步是什么？将主题组织到内容日历中开始创建用于排名的内容有什么评论或问题吗？在推特或Mastodon上Ping我。译者，John Zhao，西品东来创始人 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Mateusz Makosiewicz Ahrefs 的营销研究员和教育家。 Mateusz 在推广代理、SaaS 和硬件业务领域拥有超过 10 年的营销经验。平时喜欢创作音乐或享受长距离的散步。",
  "headers": [
    {
      "level": "H1",
      "text": "关键词映射: 好奇者实用指南"
    },
    {
      "level": "H2",
      "text": "关键词映射的好处（另一种方式）"
    },
    {
      "level": "H2",
      "text": "第一级 — 快速，合理的工作"
    },
    {
      "level": "H2",
      "text": "第二级 — 全面但耗时"
    },
    {
      "level": "H2",
      "text": "最后的想法"
    }
  ],
  "author": "Mateusz Makosiewicz"
}