{
  "url": "https://ahrefs.com/blog/zh/keyword-research-tips/",
  "slug": "keyword-research-tips",
  "title": "6个寻找潜在话题的关键词研究技巧",
  "description": "关键词研究是大多数网站成功的关键因素。但是常规过程可能会让你忽略了很多有用的关键词。",
  "content": "Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。 内容 对于大部分网站来说，做好关键词研究是成功的关键因素。但是常规的关键词研究的方法可能你会让你忽略掉很多不错的关键词。比如下面这个词:当我们用常规的方法：将种子关键词放入 Keywords Explorer（关键词分析），选择一个合适的报告，并使用筛选功能查看关键词建议——其实是无法发现上方这样的词的。但是，依然我们针对这个词写了一篇文章。现在这个词我们排名在第一，并且这个页面每个月可以为我提供700+的访问量。在本指南中，你将学到我们是如何找到这样的关键词的。以及其他五种方法来让你在几分钟内找到一些潜在的机会。针对竞争对手最热门的页面进行反向分析使用内容差距机会分析找到有流量但是外链很少的页面找到论坛参与排名的关键词通过Google Search Console找到新的关键词找到有流量潜力分销类关键词https://www.youtube.com/watch?v=b7PzHO40bOU1. 针对竞争对手最热门的页面进行反向分析每个人研究关键词的方式都不一样，这就是为什么有时竞争对手会参与一些你从未考虑过的关键词排名。这并不是一件坏事。你可以针对竞争对最受欢迎的页面进行反向的分析，有效地利用他们的辛苦制作的内容寻找有流量潜力的关键词和话题。下面是如何做。将一个竞争对手的页面放入 Ahrefs Site Explorer（网站分析），然后进入 Top Pages（热门页面）报告。这里会显示对手网站中的哪些页面能获得最多的自然搜索流量。不知道自然搜索流量的竞争对手是哪一个？将你的域名输入Site Explorer（网站分析），然后进入 Competing domains（竞争域名）报告。点击第一个话题相近的网站的下拉图标，确保对手网站有不错的自然搜索流量，并将对手域名放入 Site Explorer（网站分析）中进行分析。如果你的网站尚未参与关键词排名，那么你可能在 Competing domains（竞争域名）报告中找不到任何好的建议。这是因为此报告是基于你参与排名的关键词。下面是另外一种找竞争对手网站的方法：在谷歌中搜索你希望参与排名的关键词；将排名靠前的网站放入 Ahrefs Site Explorer（网站分析）中;查看流量是否正常；继续你的分析。因为我们对全球的流量感兴趣，所以我们将过滤器切换成所有国家（不仅是美国）的流量数据。现在我们来看Top keyword（热门关键词）栏目中的URL以及其关键词，我们会发现有一些话题我们已经写过了。但是依然有一些此我们没有做，比如“content writing（内容创作）”——这个话题每个月给 Backlinko.com 提供10,500的访问量。对于词 “bounce rate（跳出率）“也是一样的：由于这些话题的流量潜力比较大，我们可能会在Ahrefs的博客中制作这些话题的内容。如果你通过Competing domains（竞争域名）找到了有流量潜力的话题，先别停下，继续寻找竞争对手的对手域名，同时分析他们的热门页面数据。你可以根据需求，多次重复此过程，以获得更多的关键词建议。2. 使用内容差距机会分析如果你看到多个竞争对手都参与了某个词的排名，那么你也值得参与这个词的排名。比如，三个邮件营销工具——Active Campaign、Campaign Monitor、以及 Get Response——参与了这个词 “newsletter ideas（邮件通知创意）“前五的排名。…但是，另外一个邮件工具 Convert Kit 以及其它的工具都没有参与这个词的排名：为了更快的找到这些关键词，最好的方法是进行 Content Gap（内容差距机会）分析。将你的域名放入 Ahrefs Site Explorer（网站分析），并进入 Content Gap（内容差距机会）报告，并在栏目中输入一些竞争对手的域名。对于 Convert Kit 工具来说，对手域名应该是activecampaign.com、getresponse.com、以及 campaignmonitor.com。分析后，我们会发现 Get Response 以及 Campaign Monitor 都参与了 “email marketing tips（邮件营销技巧）“这个词的排名，但是 Convert Kit 并没有参与：如果报告中的关键词都不太相关，那么你可以把筛选框中的 “intersections（交集）”设置为“3”。然后你就可以找到三个网站都参与排名的关键词。这里需要注意的是，虽然 content gap（内容差距机会）报告可以展示关键词的月搜索量，但是这并不是判断话题搜索流量潜力最好的方法。为了更好的评估，你需要点击“SERP”按钮，然后查看排名靠前页面的流量潜力。3. 找到有流量但是外链很少的页面根据我们针对10亿页面的研究，我们发现页面的 referring domains （反链域名）数量和自然搜索流量有非常强的相关性。但是，这并不意味着没有外链就不能参与关键词的排名。你通常会发现一些没有外链，但是能获得不错的自然搜索流量的页面。举个例子，比如下方这个关于 “能驱逐蚊子的植物” 的页面，尽管只有一条外链，但是每月却可以获得5,200的访问量。如果你有一个卖植物种子的网站，那么你可以针对这个话题写一个页面。因为它和你的主题相关，并且竞争力度很低。你只需要很少的外链、甚至是不需要，就能参与谷歌的排名。那么如何找到这些页面呢？首先，进入 Ahrefs Content Explorer（内容分析工具），然后搜索相关的话题。如果你有一个关于健身的网站，那么词应该是“weight loss（减肥）”或者是“build muscle（增肌）”。然后通过筛选功能，找到那些月流量大于500，但是没有外链或者外链很少的页面。小提示. 你最好针对现存的数据以及你的目标语言进行筛选，这样可以将一些不必需要页面信息给过滤掉。观察这些结果，找到你觉得合适的，并点击“Details（详细）”按钮。查看自然关键词栏目中的月搜索量、关键词难度、以及有流量的关键词的排名。如果页面在一个高搜索量关键词排名第一位置，那么这个话题可能有流量潜力，应该是一个不错的选择。如果页面并没有排名在第一—比如例子中的这个 “losing weight while breastfeeding（哺乳期减肥）”—将关键词放入 Keywords Explorer（关键词分析），然后在SERP overview（SERP概览）中查看排名靠前页面的流量。在这里，我们看到一些排名较高的页面获得了较多的访问量，并且它们只有很少的外链：小技巧当你在使用 Content Explorer（内容分析）时，注意自然流量趋势数据。如果你发现近期页面流量飙升，那么它很可能是被加入了SERP feature（SERP特性）的Top Stories（热门新闻）板块。这对于长期获取流量来说，可能并不是一个理想的话题。相反，你应该去找那些流量曲线在6个月或者以上的时间相对比较平稳的页面。这些页面所参与排名的关键词就有长期获取流量的潜力。4. 查找论坛参与排名的关键词谷歌通常不会对用户生成的内容（UGC）进行排名，因为它的质量通常较低、且编写得很差。因此，如果你看到有相关论坛或帖子排在前10名，则通常表明该话题没有竞争力。举个例子，Quora中有个关于 “difference between ddr3 and ddr4（ddr3和dd4的区别）“帖子排名在第一，每月可以获得5,400的访问量。根据 Keywords Explorer（关键词分析）的数据，这个词 Keyword Difficulty（关键词难度）很低，只有11。同时参与该词排名的其它页面外链也不多、每月也能获得上百次的访问量。为了找到这样的关键词，你需要安装一个 Ahrefs SEO toolbar（Ahrefs SEO工具栏）插件，并在谷歌中搜索一个与话题相关的论坛。并查看那些有搜索流量的结果。将其中一个论坛放入 Ahrefs Site Explorer（网站分析）中，并查看 Top Pages（热门页面）报告。小提示. 如果论坛是在一个二级域名上，那么将二级域名放入Ahrefs即可（比如 forums.tomshardware.com、而不是 tomshardware.com）；如果论坛以及帖子都在一个二级目录中，你只需要将二级目录地址放入Ahrefs即可（例如 pcpartpicker.com/forums/，而不是 pcpartpicker.com）你可能会注意到很多参与排名的关键词都包含有品牌词。你可以使用筛选框中的 “Exclude（排除）” 功能，将这些词用逗号隔开放入其中进行排除设置。用上面的例子就是 “pcpartpicker” 以及 “pc part picker” 这样的词，同时选择排除关键词，而不是URL。在列表结果中查找那些有搜索量的页面、以及对应的你可能要需要定位的关键词。如果你找到了不错的话题，将相关词放入 Keywords Explorer（关键词分析）中，并查看 Phrase match（部分匹配词汇）报告，并通过 “Include（包含）“筛选功能找到更多的相似的关键词。例如，上方有很多 “[cpu型号] vs [cpu 型号]“这种类型的关键词。为了在 Keywords Explorer（关键词分析）中找到更多的对比类关键词，你只需要在 “Include（包含）“筛选框中将 “vs”放入筛选就可以：5. 通过Google Search Console找到新的关键词如果你之前使用过 Google Search Console，那么你就知道其中的“效果”报告会反馈给你参与排名的关键词。大部分的词你已经有针对性的内容了，但是并不是所有词都是这样。下面是一个简单发现新话题的方法：找到那些有很高展示量，但是你不记得有针对性的做过内容的关键词。比如，对于我们来说，有一个词 “amazon affiliate（amazon分销）” 有着不错的展示量：我并不记得我们写过这个话题，所以我们筛选了这个关键词，并查看是哪个页面参与的排名：看起来是我们的一个关于成功的Amazon分销网站列表内容.我们通过 Keywords Explorer（关键词分析）查看目前排名靠前的页面，我们看到没有结果是关于分销网站列表的。基本都是如何通过Amazon分销赚钱的教程。由于这些文章都获得了非常多的流量，而我们的工具可以帮助用户制作一个有价值的Amazon分销网站，所以我们可以针对这个话题去创作内容。这样创作出的内容更加符合搜索意图，让词排名更高、从而增加我们博客的流量。这里使用Google Search Console虽然没什么问题，但是它有个最大的缺点：最多只能显示1000行数据。如果对于你来说这是个问题，那么你可以使用 Ahrefs Site Explorer（网站分析）中的Organic Keywords（自然关键词）报告。它可以从我们4.9亿关键词的数据库中找到你排名在前100的关键词。例如，我们可以看到 Ahrefs博客在美国参与了 73,000个关键词的排名：如果数据过于极端或者你要处理的关键词非常多，你可以设置搜索量范围进行数据的筛选。6. 找到有流量潜力的分销类关键词利用 Keywords Explorer（关键词分析）工具去找分销类的关键词非常的简单。只需要放入一些相关的关键词，然后查看任意报告，并将这样的词 “best”、“review”、“top“加入 “包含” 筛选框中即可。举个例子，假如你的网站是关于厨房设备的，你可以像下方这样：小提示. 确保在进行该操作时，这些词使用逗号隔开，并选择 “Any word（任意词）“选项。尽管这个很管用，你依然可能会忽略掉一些关键词。比如你简单的过滤了搜索量低的词，但是很可能这些词对应的话题是可以带来很多流量的。例如 “best carbon steel pans（最好的碳钢锅）“只有100的月搜索量，看起来并不是一个特别好的词。但是如果你查看排名靠前的页面，你会发现它们获得了非常多的流量。由于挨个手动查看SERP结果的会消耗很多时间，下面是一个快捷的方法帮助你找到有流量潜力的分销类关键词：将竞品的分销网站放入Site Explorer（网站分析）;进入 Top pages（热门页面）报告;将这些词“best”、“review“以及“top“逗号分开放入“包含”筛选框中。查看 “best [产品类型]” 此类词对应得页面及其流量。最后关键词研究可以通过多个方法进行。你可以选择通过传统得方法，将种子关键词放入工具进行衍生。但同时也不要忽略其它的方式。想找更多的潜在关键词机会？阅读这篇文章。想找到有效的关键词研究步骤？看这里。有问题？在 Twitter 上找我吧。译者，Park Cheng，魔贝课凡联合创始人 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。",
  "headers": [
    {
      "level": "H1",
      "text": "6个寻找潜在话题的关键词研究技巧"
    },
    {
      "level": "H2",
      "text": "1. 针对竞争对手最热门的页面进行反向分析"
    },
    {
      "level": "H2",
      "text": "2. 使用内容差距机会分析"
    },
    {
      "level": "H2",
      "text": "3. 找到有流量但是外链很少的页面"
    },
    {
      "level": "H2",
      "text": "4. 查找论坛参与排名的关键词"
    },
    {
      "level": "H2",
      "text": "5. 通过Google Search Console找到新的关键词"
    },
    {
      "level": "H2",
      "text": "6. 找到有流量潜力的分销类关键词"
    },
    {
      "level": "H2",
      "text": "最后"
    }
  ],
  "author": "Joshua Hardwick"
}