{
  "url": "https://ahrefs.com/blog/zh/listicle-outreach/",
  "slug": "listicle-outreach",
  "title": "列举文章外联: Hunter如何在3个月内建立96个链接(案例研究)",
  "description": "了解 Hunter 如何在三个月内在列表中建立 96 个新反向链接和 33 个新提及。",
  "content": "Irina Maltseva Irina Maltseva 是 Hunter 的前营销主管。 在发展多个营销业务后，Irina 加入了网络安全公司 Aura，目前正在致力于为每个人创造一个更安全的互联网。 在业余时间，Irina 为 SaaS 公司提供入站营销方面的咨询，并周游世界。 要取得联系，请在 LinkedIn 上关注她。 内容 每一家企业都希望成为顶级行业名单中的一员。这可以让你从网站获得更多的反向链接和可见性，这些网站的关键词排名很好，如“最佳 X 工具”或“ X 的顶级产品”。问题是这种扩展是相当复杂的。你需要确定正确的列表，以及推销你的业务。你的电子邮件应该提供价值和说服力。此外，你的外联成功与否在很大程度上取决于你所使用的谈判策略。当我为Hunter工作的时候，链接建设策略给我们带来了最好的结果。例如，在我们上一次活动中，我们在不到三个月的时间里取得了这些成果，只有一个人参与了这一进程:来自54个域名的96个新链接在产品清单中有33次新的提及其他名单上的17个更新职位在本指南中，我将解释如何使用这种技术，以获得数十个链接和提到您的网站在任何时间。我也会分享一些提高你成功几率的技巧。内容第一步: 找到相关的列表Listicle外联过程的第一步是定义你的目标。有三种关键类型的清单可以很好的运用这种战术。你可以选择一个最适合你的，或者同时面向多个类别(没有严格的规则) :最佳选择-由单个主题联合起来的产品、服务或企业列表。它可以是最好的搜索引擎优化工具列表，顶级软件招聘人员，等等。替代选项 — 比较列表集中在特定行业，主题或问题上。Aura在Top Lifelock竞争对手上的Listicle就是一个很好的例子。包含列表文章的指南-人们经常在指南中包含列表。例如，Ahrefs 的查找电子邮件地址指南包括查找电子邮件的提示。其中一个技巧是使用电子邮件查找服务，作者 Nick Churick 分享了一个他测试过的最佳工具列表。一旦你选择了一个(或多个)类别，头脑风暴关键字和主题，你可以用来找到你的产品或服务适合的清单。然后将它们与所谓的修饰语(列表中常用的单词)结合起来。我注意到大多数列表的标题中都存在这些修饰符：best, top, review, list, tools, free.下面是一些可行的查询示例:最佳选择清单: 最好的电子邮件查找器，最好的搜索引擎优化工具，顶级餐厅在纽约等。替代选项列表：最佳Hunter替代方案，最佳Ahrefs替代品等。接下来，在 Google 中搜索这些关键词，并使用 Ahrefs 的 SEO 工具栏导出结果。对列表中的其他关键字重复该过程，然后将所有 CSV 合并为一个。如果愿意，可以使用Ahrefs的关键词分析加快此过程。只需输入关键字，点击“导出”，然后选择“包括SERP”的选项。第二步 清理和细分潜在客户在这个阶段，您的主 CSV 中可能有数百甚至数千页。所以你需要清理这个列表，这样你就可以把注意力集中在最相关和最有价值的列表上。你可以从基本清洁开始：批量删除重复项，然后删除Low DR的所有网站。在我的中，我总是删除DR 30及以下的所有网站。由于来自 Ahrefs 的导出文件包含这些数据，所以在 Excel 或谷歌表格中做起来很容易。然后，手动检查剩下的内容: 删除不是列表的页面，也删除不符合您要求的列表。您可以选择删除流量较低的列表(同样，Ahref 的导出包含此数据)。一旦清理了列表，就可以进行细分了。我建议在你的 CSV 中添加以下标签来分割潜在客户:没有提到你的产品或服务的列表。提到了你的生意，但是没有链接。你已经提到了，但在您的竞争对手下方。下面是我的文件分割后的样子:译者注如果您想加快和自动化此过程，请考虑使用Google搜索运算符在找潜在客户阶段进行细分。例如，在搜索中添加“产品名称”将查找已经提到你的产品的列表。并添加-“产品名称”将发现那些没有提到你的产品。Joshua Hardwick内容主管第三步: 查找联系信息现在是时候找到你收集的 URL 背后的决策者了。因为竞选的成功取决于你联系的人，所以在这个过程中投入足够的时间是非常重要的。“在正确的时间，用正确的报价，联系正确的人”的方式仍然有效。“人”在这里扮演着重要的角色。在发送了数百份Listicle宣传电子邮件后，我注意到我从博客编辑和内容经理那里获得了最佳答复率。通常，这些是创建特定列表的作家。因此，使这些位置成为关键目标。首先，在 LinkedIn 上找到你的潜在客户的全名，并将他们添加到你的文档中。例如，如果我联系 Ahref，我可能会联系它的内容主管 Joshua Hardwick。在此之后，如果你使用谷歌表，你可以使用Hunter的谷歌表格插件，以自动化电子邮件查找过程。你所要做的就是把你潜在客户的姓名、域名和公司名输入到列中，然后它就会完成剩下的工作。您不使用Google表，您可以使用批量电子邮件查找器进行电子邮件。你需要上传一个 CSV 到应用程序中，然后你就可以导出结果了。专家提示 为了简化过程并仅查找列表文章作者的电子邮件地址，你可以在同一附加组件或应用中使用作者查找器。您需要找到Listicle作者的电子邮件地址所需的只是Listicle的URL。第四步: 准备电子邮件文案让我猜猜: 你希望在文章中提到你的潜在客户，让他们对你有更多的了解，最重要的是，还有一个外部链接。请记住，要索要很多，而没有任何回报会减少您获得任何东西的机会。在写诸如“嘿！我有一个很好的工具可以添加到您的列表中。你能以反向链接给我提及吗？”想想他们中有什么。你应该带来价值。无值=没有俯仰。这些是Listicle宣传游戏的规则。让我给你们看两个例子，以及我所说的提供价值是什么意思。案例 #1这是其中一个模板，帮助我生成了几十个提及。有什么秘诀吗？我没有关注我的工具有多么出色，也没有详细描述所有的特性，而是关注它的价值。简单来说ーー博客编辑在介绍我的产品后会得到什么。我在我的推销中包括了三个关键的好处:如果编辑接受我的提议，他们将自动成为我们的联盟计划的一部分，并从这次提及获得经常性收入。我向博客们提供了一大堆hunter的免费请求，他们可以用来开展冷战外联活动。我主动提出帮助提供关于这个列表的信息。(事实上，许多博客作者都很忙，而且经常有固定的内容更新时间表。如果你不想为下一次更新等上一年，那就主动提供帮助。)Example #2我将这个模板发送给博客编辑，他的网站发布了一个关于电子邮件查找的深入指南。他们提到我们的工具没有反向链接。而且，那篇文章中的信息有点过时了。在这篇文章中，我的关键信息是帮助更新指南，因为最近有机流量有所下降。我用一张 Ahrefs 的截图证实了我的观点。这个提议的价值在于帮助他们获得更好的排名。我建议花相当多的时间在个性化的邮件上，而不是做一般的推广。你在电子邮件副本上投入的精力越多，你就能获得更好的结果。在这次活动中，我们采用了两种不同的方法:完全手动和个性化-有时候，写一封电子邮件需要30分钟。是的，这很费时间，但我发现回复率高得令人难以置信(超过50%)。自动化与个人联系-我们自动化的一些电子邮件批次与Hunter活动，一个免费的工具，冷外展自动化。在细分潜在客户时，您会注意到列表之间有许多相似之处。你可以使用自定义属性和打破僵局的方法来个性化大规模的复制。另外，不要忘记发送后续信息，它们有助于提高回复率。让你的后续工作简短，直奔主题。不要给一个潜在客户发送两个以上的后续信息。这会让你看起来不那么绝望和烦人。您可以安排提醒发送后续行动 X 天直接在您的 Gmail 或设置自动化后续行动与工具的外联自动化。第五步: 积极主动地进行谈判在一个完美的世界里，你发送你的冷邮件，立即收到：“听起来不错，我刚更新了我的文章!”在现实世界中，事情的运作方式是不同的。当冷电子邮件做链接建设，客座博客，或列表位置替换，记住，你往往会被要求提供一个相同的价值，甚至更多的回报。一些网站编辑甚至可能要求付费:我不推荐花钱买这种外链，原因有以下几点:如果编辑仅接受付款的提交，他们就不在乎列出的产品的质量。他们所关心的只是很快的钱。如果您的产品已经列出，并且要添加反向链接，则可能会冒险。Google明确警告说，它考虑了购买链接链接方案。如果您要100％遵守Google的准则，则不应购买链接。通常，网站反复要求付款。这意味着它们可以在有限的时间内在列表中在列表中配备您的产品或服务。如果您想延长放置的时间，则需要继续付款。谈判是最复杂的部分之一，明确的延伸。你在研究、勘探和层序准备上投入了大量的时间。但是一个错误的词语或者谈判中缺乏灵活性都会让你失去一个潜在客户。下面是一些帮助我完成最困难的谈判的技巧(例如 HubSpot，它有相当高的编辑标准) :要灵活-不要马上说不，总是试图找到一个中间立场。提供快速反应-如果你立即或至少在同一天对你的潜在客户做出回应，你就有很大的机会出现在清单上。别等太久。为他们做点什么-帮助传播更新的文章，分享你专业领域的建议，提供你即将发表的客座文章的反向链接，等等。总是跟进-人们很忙，他们可以忘记你-没关系。如果他们对你的提议感兴趣，不要犹豫，提醒他们想起你。最后的想法List文章外联不难。考虑到文章中的提示数量，看起来似乎是这样难懂。但是一旦你掌握了窍门，通常一切都会井井有条。我不是说你不费吹灰之力就能做到。你仍然需要做大量的工作来收集高质量的潜在客户，找到决策者，准备一个有价值的推广序列，等等。但这并不像许多人认为的那样是不可能完成的任务。如果您的广告系列顺利进行，则可以通过使用Ahrefs提醒新列表文章，来使其成为常青活动。这是一个示例警报，该警报监视“最佳电子邮件查找器”在DR 30+网站上，且每月有1,000多个网站上新列表。有问题吗？在领英上给我发信息。译者，John Zhao，西品东来创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human:",
  "headers": [
    {
      "level": "H1",
      "text": "列举文章外联: Hunter如何在3个月内建立96个链接(案例研究)"
    },
    {
      "level": "H2",
      "text": "第一步: 找到相关的列表"
    },
    {
      "level": "H2",
      "text": "第二步 清理和细分潜在客户"
    },
    {
      "level": "H2",
      "text": "第三步: 查找联系信息"
    },
    {
      "level": "H2",
      "text": "第四步: 准备电子邮件文案"
    },
    {
      "level": "H3",
      "text": "案例 #1"
    },
    {
      "level": "H3",
      "text": "Example #2"
    },
    {
      "level": "H2",
      "text": "第五步: 积极主动地进行谈判"
    },
    {
      "level": "H2",
      "text": "最后的想法"
    }
  ],
  "author": "Irina Maltseva"
}