{
  "url": "https://ahrefs.com/blog/zh/long-tail-keywords/",
  "slug": "long-tail-keywords",
  "title": "长尾关键词：它们是什么以及如何从中获取搜索流量",
  "description": "长尾关键词是每月获得少量搜索的搜索词。 它们往往比头部关键字更长、更具体。",
  "content": "Tim Soulo Tim是Ahrefs的CMO以及产品顾问，同时他也是该公司最狂热的粉丝和最忠诚的传播者。 内容 人们经常说长尾关键词更容易排名、并且转换更好。 但这真的是真的吗？因情况而异。有两种不同类型的长尾关键词，其中一些并不比它们的短尾关键词更容易排名。在本文中，你将了解这两种类型的长尾关键词之间的区别以及如何找到它们。但首先，让我们深入了解我们将介绍的关键内容：什么是长尾关键词？为什么叫长尾关键词？是什么让长尾关键词如此知名？如何找到长尾关键词？两种类型的长尾关键词什么是长尾关键词？长尾关键词是每月搜索量较少的搜索词。 它们往往比“头部”词更长、更具体，因此通常具有更高的转化率。例如，关键词 “meditation” 是一个 “头部” 关键词，因为它每月获得 21万次搜索。 关键词 “can meditation make you smarter” 是一个长尾关键词，因为它每月只能获得 50 次搜索。为什么它们被称为“长尾”关键词？长尾关键词的名字来源于它们在“搜索需求”曲线上的位置。 如果我们绘制人们在一个月内在 Google 中执行的所有搜索词并按搜索量排序，它看起来有点像这样：在曲线的“头部”，我们有少量搜索量超高的关键词，而“尾部”则包含数十亿个搜索量非常低的关键词。准确地说，在 Ahrefs 的美国地区数据库（顺便说一下，这是业内最大的）中，每月搜索量超过 10 万次的关键词只有 31,000 个； 另一方面，每月搜索不到 10 次的关键词有 38 亿个。这是饼图中的样子：如你所知，每月搜索次数少于 10 次的关键词占我们美国关键词数据库的近 95%。 这并不令人感到意外，因为每天约 15% 的 Google 搜索是新的并且以前从未被搜索过。美国 95% 的搜索词每月获得的搜索量少于 10 次。但是要符合“长尾”的条件，关键词不一定必须每月获得少于 10 次搜索。 并且没有特定的搜索量阈值，它将关键词定义为“长尾”。 它主要取决于你要与之比较的 “头部” 关键词。然而，一个大误区是用词的长度来定义长尾关键词。问题是，有许多单字关键词每月搜索不到 100 次。 还有关键词五个字长（或更多），每月搜索数十万。因此，使它成为长尾的不是关键词的长度。 这是该关键词的搜索量。是什么让长尾关键词如此知名？以下是你应该考虑将长尾关键词作为 SEO 策略不可或缺的一部分的三个原因。原因 1. 长尾关键词（通常）竞争力要小得多假设你刚刚发布了一个关于加密货币的博客。 有许多搜索量很高的热门关键词可能会为你的博客带来大量流量：这些关键词很容易成为目标。 但现实是，你的博客快速为其中任何一个排名的机会有多大？以上所有关键词都具有较高的 Keyword Difficulty (关键词难度) 分数。 这意味着他们中的任何一个都很难进入谷歌的第一页。 而且，如果你的网站是全新的，那么几乎短期内是不可能的。现在让我们看一下有关比特币主题的一些不太流行的搜索词：正如你所看到的，这一次，他们的 KD 分数很低。 这意味着即使是新网站也有机会在前 10 名搜索结果中排名，并从这些关键词中获得一些流量。原因 2. 长尾关键词（通常）更容易处理让我们继续比较上面的两组关键词。“How to buy bitcoin” 似乎是一个相当简单的问题。 但是，如果你查看该搜索词的排名第一的页面，它实际上有 3,400 个字。相反，“how to cash out large amounts of bitcoin” 排名第一的页面只有 1000 个字。问题是，搜索词越通用，你在处理它时必须包含的详细信息就越多。 但是，如果搜索词是特定的，你通常可以相当简短地回答它，并且仍然可以满足搜索者的要求。换句话说，为长尾关键词创建内容通常需要较少的工作。除此之外，你实际上可以寻找相似的长尾搜索词组，并使用只有一些差异的页面来解决它们。例如，查看以下一组关键词：相同的网站程序可能适合治疗师、也适合教师、或演员。 这意味着你可以使用具有 80% 相似内容的页面来定位所有这些不同的搜索，而剩余的 20% 将针对每个话题进行定制。换句话说，你可以在一天内轻松创建十几个页面来解决那些类似的长尾搜索。原因 3. 它们数量很多是的，每个单独的长尾关键词都不会打开你网站的流量大门。 但是随着你处理越来越多的问题，搜索流量最终会变得相当可观。而且由于几乎每个行业都有很多长尾关键词，因此你不太可能遭受它们短缺的困扰。回到我的 “best website builder for __” 关键词示例。 在 Ahrefs Keywords Explorer（关键词分析）中搜索会返回一千多个结果：如何找到长尾关键词你可以使用多种方法来查找长尾关键词。 有些比其他更乏味，有些有点“非常规”，有些则完全不正确。让我们从一个不正确的开始。1. 使用 Google 自动建议（不正确的示范）一些 SEO 专家建议你通过输入目标关键词后跟不同的字母来从 Google 自动建议中获取长尾关键词。好吧，Google Autosuggest 是一项旨在让你快速访问热门搜索词的功能。 因此，如果我们检查上面屏幕截图中关键词的搜索量，其中大多数都会有相当多的搜索量。换句话说，Google 自动建议更有可能为你提供非常受欢迎的搜索词，而不是长尾搜索。Answer The Public 或 Soovle 等在线工具也是如此，它们会抓取自动建议生成关键词列表。 他们的大量关键词建议将其实是相当受欢迎、并且有竞争力的。2. 使用 Ahrefs Keywords Explorer（关键词分析）与前一种不同，这种方法不需要任何繁琐的手工工作。 只需在 Keywords Explorer（关键词分析）中搜索定义你的利基的任何单词，然后使用搜索量过滤器即可立即查看数以千计的长尾关键词。如果你的网站是全新的并且几乎没有任何 “权重”，那么我建议你使用 KD 过滤器，它可以帮助你找到竞争力最低的关键词。另外，请务必尝试 “Questions（问题）” 报告。 它通常会返回一些很酷的长尾搜索词，这些词大多是问题类的：3.查看你的竞争对手有哪些关键词排名长尾关键词的另一个重要来源来自你的竞争对手。 Ahrefs Site Explorer（网站分析）将帮助你查看他们为哪些长尾关键词排名。只需将属于你的竞争对手的网站插入 Site Explorer（网站分析），然后转到 Organic keywords（自然关键词）报告，即可查看哪些长尾关键词为他们的网站带来了流量：对 5–10 个竞争对手的网站重复此操作，你将挖掘出足够多的长尾关键词创意。4. 浏览 Reddit、Quora 和小众论坛每当人们访问谷歌并没有找到问题的好答案时，他们就会在 Quora 和 Reddit 等地方提出问题。例如，我在 Quora 上浏览 “marketing” 主题时，看到了这篇文章：在 Keywords Explorer（关键词分析）中的快速检查显示，“marketing manipulation” 实际上是一个 KD 分数较低的长尾关键词。这种方法的好处是那些论坛帖子可能有一些很好的内容，这对你在创建关于该主题的内容时很有用。缺点是从论坛中挖掘长尾关键词是一个相当乏味的过程。 而且你仍然必须使用 Keywords Explorer（关键词分析）之类的 SEO 工具来检查关键词的搜索量和 KD。但问题是，通过 Keywords Explorer（关键词分析）轻松发现相同类型的关键词：两种类型的长尾关键词并非所有长尾关键词都是相同的。 其中一些代表一个独特的搜索词，而另一些只是更流行的搜索词的一个不太流行的变体。我们称前者为 “主题型长尾关键词”，后者为 “支持型长尾关键词”。支持型长尾关键词让我用一个例子来解释它。 “Best healthy treats for dogs” 绝对是一个长尾关键词，因为它每月只有 100 次搜索：但是还有一些其他搜索词具有相同的含义，同时具有更大的搜索量：如果你在 Google 中搜索它们中的每一个，你会发现相同的页面在这些关键词中的每一个都排名在顶部。谷歌足够聪明，可以理解不同的人在寻找完全相同的东西时会以不同的方式表达他们的搜索。 因此，它为所有这些关键词变体会用一组页面进行排名。这意味着，如果你的页面开始为 “healthy dog treats”（6.8k 搜索）等热门搜索词排名，它将自动为所有词的长尾变体排名。 因此，你无需为每个长尾变体创建单独的页面。 相反，你应该用一个页面来定位它们。但是你怎么知道你正在查看的长尾关键词是否属于更广泛的主题？好吧，在 Ahrefs，我们为此开发了一个独特的功能。叫做 Parent Topic（父主题）每当你在 Keywords Explorer（关键词分析）中输入关键词时，我们都会检查该关键词的排名靠前的页面，并查看该页面是否有更受欢迎的搜索词排名。例如 “best healthy treats for dogs”：正如你在上面的屏幕截图中所见，这个长尾关键词有一个更受欢迎的变体：“healthiest dog treats”（2.5k 次搜索）。 如果你设法为该搜索词排名，你也会自动为其支持型长尾关键词排名。主题型长尾关键词现在让我们看看另一种长尾关键词：“fly bites on dogs ears”。这一次，父主题与原始关键词相同。 这意味着我们的关键词实际上是搜索这个东西的最流行的方式。 你可以使用专门的页面安全地定位这个长尾关键词。一旦你设法为这个主题长尾关键词排名，你将自动为所有不太受欢迎的支持类搜索词变体排名：但不幸的是，事情并不总是那么简单。让我们检查最后一个搜索词：“natural sleep aid for dogs”。父主题表明这个长尾关键词只是搜索词 “sleep aid for dogs”（1.6k 搜索）的变体。但我认为原始关键词中的 “natural” 一词实际上使其与建议的父主题不同。 寻找它的人似乎正在寻找一种天然的替代常规药物的选择。如果我们查看该长尾关键词的热门搜索结果，似乎没有一个是在谈论 “natural sleep aid” 。 相反，它都在谈论的是 “sleep aids”：所以我认为创建一个专门的内容来定位关键词 “natural sleep aid for dogs” 确实是有意义的。 在没有涵盖该特定主题的任何其他文章的情况下，它很有可能实际上在该查询中排名第一。换句话说，你不应该总是盲目地相信父主题告诉你的任何内容。 它只是一种计算机算法，有其缺陷和局限性。 所以你需要分析关键词的排名靠前的页面、并确定你的搜索词是代表一个不同的主题还是更广泛主题的一部分。最后这就是我要说的关于长尾关键词以及它们如此之棒的原因。希望本文能帮助到你制定 SEO 策略并加速你网站的搜索流量增长。如果你有更多问题，可以在 Twitter 上找我。 译者，Park Cheng，歪猫出海创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Tim Soulo Tim是Ahrefs的CMO以及产品顾问，同时他也是该公司最狂热的粉丝和最忠诚的传播者。",
  "headers": [
    {
      "level": "H1",
      "text": "长尾关键词：它们是什么以及如何从中获取搜索流量"
    },
    {
      "level": "H2",
      "text": "什么是长尾关键词？"
    },
    {
      "level": "H2",
      "text": "为什么它们被称为“长尾”关键词？"
    },
    {
      "level": "H2",
      "text": "是什么让长尾关键词如此知名？"
    },
    {
      "level": "H3",
      "text": "原因 1. 长尾关键词（通常）竞争力要小得多"
    },
    {
      "level": "H3",
      "text": "原因 2. 长尾关键词（通常）更容易处理"
    },
    {
      "level": "H3",
      "text": "原因 3. 它们数量很多"
    },
    {
      "level": "H2",
      "text": "如何找到长尾关键词"
    },
    {
      "level": "H3",
      "text": "1. 使用 Google 自动建议（不正确的示范）"
    },
    {
      "level": "H3",
      "text": "2. 使用 Ahrefs Keywords Explorer（关键词分析）"
    },
    {
      "level": "H3",
      "text": "3.查看你的竞争对手有哪些关键词排名"
    },
    {
      "level": "H3",
      "text": "4. 浏览 Reddit、Quora 和小众论坛"
    },
    {
      "level": "H2",
      "text": "两种类型的长尾关键词"
    },
    {
      "level": "H3",
      "text": "支持型长尾关键词"
    },
    {
      "level": "H3",
      "text": "主题型长尾关键词"
    },
    {
      "level": "H2",
      "text": "最后"
    }
  ],
  "author": "Tim Soulo"
}