{
  "url": "https://ahrefs.com/blog/zh/low-competition-keywords/",
  "slug": "low-competition-keywords",
  "title": "如何为SEO查找低竞争性关键字",
  "description": "了解如何通过几个步骤找到低竞争的关键字机会，以及如何确保这些关键字的竞争程度不高且易于排名。",
  "content": "Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。 内容 每个人都想为有竞争力的关键词排名，但这在短期内几乎是不可能的（尤其是如果你的网站是新的或相对不知名的）。这是否意味着你不应该针对有竞争力的关键词？不是的。但这确实意味着你应该在短期内追求低竞争关键词。在这篇文章中，你将学习如何通过几个简单的步骤找到低挂关键词的机会，以及如何确保这些关键词是真正的低竞争和容易的排名。https://youtu.be/s7hR-i6Go4c如何找到低竞争性的关键词遵循以下三个步骤，可以快速找到成千上万个“低竞争”关键词。1. 头脑风暴主题想想你的目标用户可能在谷歌上搜索什么，然后记下你的想法。在这里，你不需要试图猜测确切的短语，只需要记下宽泛的主题即可。例如，如果你在网上销售电脑和零部件，这些可能是:计算机笔记本电脑苹果笔记本Imac硬盘不要想太多，只要把你想到的写下来。一旦你有了5–10个想法，就开始第二步。2. 用关键词研究工具拓展思路将你的主题想法插入一个关键词研究工具，比如 Ahrefs 的关键词分析，然后进入部分匹配词汇报告。你会看到关键词的想法，包括一个或多个单词和短语，你输入，完成每月的搜索量和其他搜索引擎优化指标。3. 过滤低“难”关键词许多关键词研究工具都有难度分数。 我们将其称为关键词难度（KD），它以数字形式表示要在Google的搜索查询中排名前10位的难度。在部分匹配词汇报告中，过滤KD得分在0到10之间的关键词，以找到“低竞争”关键词。您可以在上面看到，我们仅从五个“种子”主题中找到了167,000个关键词。 如果要缩小列表范围，只需添加最低每月搜索量过滤器。寻找低竞争的关键词真的这么简单吗？是也不是。谷歌使用了数百个排名信号，所以任何第三方搜索引擎优化工具都不可能解密它们并计算出一个“准确”的关键词难度度量。这是不现实的，几乎是不可能的，尤其是当你考虑到许多这些“排名因素”只是推测，从来没有得到谷歌的证实。同样重要的是要了解每个 SEO 工具，对于他们的关键词难度分数都使用了一个独特的公式，这就是为什么不同的工具得分往往大相径庭:在Ahrefs，我们的关键词难度得分计算非常简单：我们对指向前10页的引荐域（链接网站）的数量进行加权平均。 这意味着高KD关键词的排名靠前的页面具有许多外链，而低KD关键词的排名靠前的页面具有很少的外链。小提示. 如果你使用的是关键词研究工具而不是 Ahrefs，那么请他们提供支持，并询问他们是如何计算关键词难度得分的。除非你知道它的工作原理，否则你不可能真正有效地使用它。鉴于外链可以说是最重要的排名因素，我们的关键词难度评分通常是排名难度的一个不错的代表。如果一个关键词在 Ahrefs 的 KD 分值很低，那就是“低竞争”，也就是说你可能不需要建立或获得很多外链来参与竞争。但是你不应该仅仅根据这个指标来评判竞争。在确定关键词之前，还有其他一些因素需要考虑。让我们来看看其中最重要的三个。搜索意图网站权重高质量外链搜索意图即使一个关键词的难度非常低，如果没有创建搜索者需要的那种内容，你也很难对它进行排名。因此，在进行关键词研究时，有必要寻找对你想要创建的内容类型有意义的关键词。四种宽泛的关键词类型： 信息性。搜索者正在寻找关于某个主题的信息。 导航。搜索者正在寻找一个特定的网站。 商业调查。搜索者想要购买一个特定的产品或服务，但是还没有完全决定买哪一个。 交易性。搜索者正在寻找购买的东西。通过查找查询中的关键词修饰语，您通常可以知道您的关键词属于哪个类型。如果它包含诸如“买入”或“便宜”之类的词，那么它很可能是一个交易性查询。如果它包含诸如“how”、“waht”或“where”这样的词，那么它可能是一种信息。这里有一个快速的关键词修饰语工作表：在 Ahrefs 的关键词分析中，你可以通过“ Include”过滤器找到这些桶中的任何一个关键词想法。例如，如果你正在寻找低竞争的交易性关键词，下面是你如何做的:输入您的种子关键词选择“Phrase match”关键词想法报告过滤器低竞争的关键词与 KD 过滤器(KD < 10)在“Include”过滤器中添加“Buy”和“Cheap”等词切换“Any word”开关如果你在为博客寻找低竞争性的信息关键词，你可以用信息修饰词做同样的事情。但更快捷的方法是使用问题报告(Questions report)，该报告显示了短语问题的关键词提示。要知道，虽然通过关键词修饰词进行过滤是有效的，但这远非万无一失，因为带修饰词的关键词并不总是与预期的搜索类型（Search Type）一致。想想“ best buy coffee makers”这样的关键词尽管包含了 transactional“ buy”修饰符，但它不是 transactional（交易） 关键词。这是一种导航方式，因为人们正在寻找来自百思买(Best buy)的搜索结果。百思买是北美一家颇受欢迎的电子产品商店。这进一步强调了搜索意图是如何影响关键词竞争的。虽然这个查询的关键词难度得分为1，但是它并不是低竞争，因为它是一个导航关键词。不管你做什么，你永远都不可能超过Best Buy，因为他们在谷歌首页的所有10个位置上都排名靠前。网站权重域名评分（DR）根据其外链信息，从零到一百的范围去衡量网站的权限。许多SEO专业人员认为，谷歌在其排名算法中使用了某种网站权威性度量标准，但谷歌的约翰·穆勒（John Mueller）公开表示，在很多情况下并非如此We don’t use domain authority at all in our algorithms.— 🍌 John 🍌 (@JohnMu) February 24, 2020 推文译：我们在算法中，完全不使用域名权重。正是由于这个原因，我们的关键词难度指标没有考虑到网站权重。因此，如果你认为谷歌在网站权重方面不完全真实，请记住这一点。无论哪种方式，你会注意到，对于一些似乎低竞争的关键词与低 KD 分数，所有的排名最高的网页来自非常高的 DR 网站。举个例子，“黑色凉鞋”:尽管关键词难度得分仅为1，但结果首页的平均域名评分为86，我们看到的最低 DR 为76。这是否证明网站权重是一个排名因素？不一定。可以说，这更多的是关于品牌资产而不是网站权威。大品牌很可能主导 SERP，因为大多数人都想在那里购物。不幸的是，如果你有一个“较弱”的网站和品牌，你就不能对此做太多。在品牌资产似乎起着重要作用的关键词中，你可能很难排名。这就引出了一个重要的问题:排名难度是相对的。如果你是 Target，“黑色凉鞋”是一个低竞争关键词，因为你具有排名的权威和品牌资产。如果您是一家小型鞋店，那么“黑色凉鞋”就是一个高竞争性关键词，因为您与主导SERP的大品牌不在同一领域。这是否意味着，不权威和不知名的品牌就不可能超过大品牌？不是的。这将只是更难，所以这是在寻找低竞争关键词，要记住的东西时。高质量外链关键词难度考虑了指向排名靠前的页面的外链的数量，但没有考虑其质量。 您需要考虑很多因素来评估链接的质量，包括：链接网站和页面的相关性链接网站和页面的权重页面上的链接位置链接的锚文本Follow和nofollow情况这是几乎不可能考虑所有这些事情和更多的时候，制定一个关键词的难度分数考虑，所以我们保持简单和一致的事情，只看平均数量的引用域（链接网站）指向前10名 页。因此，手动检查排名靠前的页面的外链配置文件总是值得的，因为数量并不是一切。为了说明这一点，让我们看一看两个KD分数同样低的关键词在排名靠前的页面上引用域的数量：乍一看，第二个关键词似乎更容易排名，因为你的竞争对手的网页有较少的链接。但真正重要的是链接的质量。对于具有14个RD的页面，有94％的Followed(传递权重)外链，其中大部分来自相关且权威的页面和网站。 他们也有大多数相关的锚文本。对于有92个 RDs 的页面，96% 的外链是 nofollowed（不传递权重），其中大多数来自低权威优惠券代码网站的页面。他们也有大部分裸链。小提示. Nofollow告诉谷歌该链接不应该影响排名，但他们可能会选择忽略这个暗示。在这里了解更多。事实上，可以说只有两个“好”的外链指向92个RDs的页面。而大多数指向只有14个RDs的页面的链接是相关的和高质量的。总之，在其他条件相同的情况下，使用92个 RDs 的页面可能比使用14个 RDs 的页面更容易超过页面。因此，尽管 KD 分数相同，“best coffee for cold brew”可以说是一个竞争力不如“best fly fishing combo for beginners”的关键词你是否应该避免高竞争关键词？许多人坚持使用低竞争性关键词，因为他们认为自己无法为其他任何关键词排名。 即使从短期来看这是正确的，但出于各种原因，高竞争关键词也可能是机遇。请记住，Ahrefs的关键词难度得分是基于外链的。 这意味着，平均而言，高KD关键词的排名最高的网页具有大量的外链。换句话说，竞争激烈的关键词通常是链接诱饵的主题，链接诱饵是专门为吸引链接而设计的内容。要找到这些主题，请与您之前做的相反。 除了过滤KD分数较低的关键词之外，还可以过滤KD分数较高的关键词。例如，如果你有一个关于简历的网站，你会:进入关键词分析输入相关的核心关键词 (例如, “resume”)然后去问题报告过滤出关键词难度高的关键词 (例如., 50+)如果检查SERP概述中的任何关键词，您应该发现许多排名靠前的页面都有很多外链。在这种情况下，如果你创建了在网上写简历的最佳指南，那么链接到这些现有网页的人会有很好的链接前景。你只需要找到一个令人信服的理由让他们链接到你。获得足够多的高质量外链到你的页面，你就有可能获得排名——即使你缺乏权威性和品牌资产。不管怎样，瞄准竞争激烈的关键词还有两个好处(即使你没有排名) : 你可以增加网站的权威性。品牌资产和权威不是凭空出现的。它们主要是链接的副产品。 你可以把这个权限传递给重要的页面。使用来自权威链接诱饵的内部链接，来提升针对低竞争关键词的相关页面。第二个好处就是我们喜欢称之为中间人技术。这是一个聪明的方式来提高无聊页面的权威性，因为这些页面很难获得链接。推荐阅读: 一个简单的 SEO 策略(“中间人”方法)最后的想法关键词竞争是相对的。因为没有关键词难度得分考虑到所有影响竞争的因素，所以在创建内容之前，您应该始终手动查看排名最高的页面。如果做不到这一点，你可能最终追求的关键词不是真正的低竞争。虽然这没有什么错，但这些关键词应该是中期或长期目标，而不是短期目标。有问题吗? 在推特上给我发消息。译者，赵子荣，SEOZZR博客创始人 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。",
  "headers": [
    {
      "level": "H1",
      "text": "如何为SEO查找低竞争性关键词"
    },
    {
      "level": "H2",
      "text": "如何找到低竞争性的关键词"
    },
    {
      "level": "H3",
      "text": "1. 头脑风暴主题"
    },
    {
      "level": "H3",
      "text": "2. 用关键词研究工具拓展思路"
    },
    {
      "level": "H3",
      "text": "3. 过滤低“难”关键词"
    },
    {
      "level": "H2",
      "text": "寻找低竞争的关键词真的这么简单吗？"
    },
    {
      "level": "H3",
      "text": "搜索意图"
    },
    {
      "level": "H3",
      "text": "网站权重"
    },
    {
      "level": "H3",
      "text": "高质量外链"
    },
    {
      "level": "H2",
      "text": "你是否应该避免高竞争关键词？"
    },
    {
      "level": "H2",
      "text": "最后的想法"
    }
  ],
  "author": "Joshua Hardwick"
}