{
  "url": "https://ahrefs.com/blog/zh/market-research/",
  "slug": "market-research",
  "title": "市场研究：是什么又如何做？",
  "description": "市场研究是收集、分析和解释特定市场信息的过程。",
  "content": "Mateusz Makosiewicz Ahrefs 的营销研究员和教育家。 Mateusz 在推广代理、SaaS 和硬件业务领域拥有超过 10 年的营销经验。平时喜欢创作音乐或享受长距离的散步。 内容 市场研究是收集、分析和解释特定市场信息的过程。它考虑了过去、当前和潜在客户的地理、人口统计和心理数据，以及竞争分析来评估产品报价的可行性。换句话说，这是了解你的企业针对谁的过程，以便你可以更好地定位你的营销策略。通过本指南你将学到：市场研究在营销策略中的作用何时进行市场调查市场调查的类型市场研究方法及其好处如何进行市场调查（包括示例）市场研究工具和资源市场研究在营销策略中的作用是什么？营销策略是企业接触消费者并将其转变为客户的整体计划。上述定义中的关键是 “计划”。产品进入市场就像开始一个新游戏。由于你是新手，你不知道规则，也不知道你在与谁比赛。这正是市场研究的用武之地。市场研究使你可以通过了解目标受众来发现营销游戏的规则。此外，它可以让你通过评估竞争对手的优势和劣势来了解你的对手是谁。研究是营销人为规划他们的行动，并超越竞争对手所做的工作。这也是营销专家用来确定自己营销策略的优势和劣势的方法。 但市场研究是最终的商业预测吗？并不是。即使是专门从事市场研究的公司也承认这一点——这是其中一家公司的引述：(…)不能认位市场研究绝对精确的，因为期望市场研究人员对新概念的精确预测是不现实和不合理的，因为有许多变量会影响市场研究人员的判断.这就是为什么具有所有意义的市场研究“只是”营销的一部分，并且“只是”一个实验。是否进行实验以及何时结束由你决定。 例如，Crystal Pepsi 在市场调研阶段看起来很有前途，但上市时却失败了（New Coke 也发生了类似的事情）。Xerox 关于商用复印机的想法在研究分析师看来是行不通的。但 Xerox 做到了，剩下的就是历史。什么时候应该进行市场调查？Paul N. Hauge 和 Peter Jackson 在他们的 “Do Your Own Market Research”一书中指出了市场研究真正有用的三种特定情况： 设定目标。了解市场规模或定义潜在客户等信息可以帮助你设定销售目标。 解决问题。销量低？盈利能力低？市场研究将帮助你了解你的问题是内部问题（如低质量产品）还是外部问题（如激烈竞争）。 支持公司成长。了解消费者如何以及为何决定使用产品，这将有助于你决定将哪些产品推向市场。什么时候做取决于你需要做出的决定的重要性。你处理的营销问题越重要，市场研究就越有用。比如，新车上市是一件大事，对吧？因此，如果他们进行了适当的研究，也许 Ford 可以避免因 Ford Edsel 而损失 3.5 亿美元。我的意思是，有了正确的方法，预测出消费者会认为汽车价格过高、外观丑陋不应该很难。也就是说，市场研究并不总是一个庞大而复杂的项目。快捷的市场研究相对较新的趋势可以让你能够定期的进行有效的市场分析，并得到有益的回报。在这里，你可以采用小规模、迭代和进化的方法来应对快速变化的环境并适应未知的市场领域。此外，如果你在创业环境中工作，尤其是在开发创新产品时，你可能会对客户开发感兴趣。在这种方法中，市场研究就处于“最迅速的”状态，并且与产品开发过程紧密结合。以 Ahrefs 为例。我们相信任何人都可以掌握的快捷的市场研究技巧。正如你将在本文后面看到的，我们使用简单（但有效）的东西，例如社交媒体民意调查、众包、内部竞争分析，或者只是跟踪我们竞争对手的定价。举个例子，就在最近，我们在 Twitter 上询问了我们的营销人员，他们是如何研究市场的。似乎市场研究有各种形式和规模：Have you ever performed “market research?”?What was it for?— Tim Soulo (@timsoulo) May 3, 2021 推文译：你做过市场调查吗？是为了什么？市场调查的类型仅仅因为有人以某种方式进行市场研究并不意味着你需要复制它。但是它们是研究的不同类型的市场，你应该要知道你的选择。 初步研究无论何时，由你或代表你的人进行研究，并且你需要创建数据来解决指定的问题，这称为初级市场研究。示例：小组、访谈、调查（更多相关内容在本文后面）。主要优势：它特定于你的品牌和产品或服务，你可以控制数据的质量。次要研究每当你使用现有数据（例如其他企业和组织汇总的数据）时，你就是在进行次要市场研究。示例：第二方和第三方来源，如文章、白皮书、报告、行业统计数据，已收集的内部数据。主要优势：从宏观角度了解你的市场，因为次要研究包括市场中的其他参与者，并且很可能使用比你的主要来源更大的数据集。 初步研究 VS 次要研究 初步研究和次要市场研究是不同的，但绝不是相反的。实际上建议两者都使用。初步研究会让你对你的业务有一个集中的、微观的视角，次要研究会告诉你其他企业的表现以及你的研究结果与更大的研究样本量相比是如何的。 市场研究子类型为所有营销极客提供更多理论。专业市场研究人员区分以下一级和二级市场研究子类型： 定性研究。想想采访、开放式问题、用文字而不是数字和图表表达的结果。这种类型的研究用于了解潜在的原因、观点和动机。 定量研究。想想调查、民意调查、通常是封闭式问题、以数字和统计数据表示的结果。这种类型的研究用于通过量化定义的变量（例如意见或行为）并概括来自更大数据样本的结果来测试或确认假设或假设。 市场研究方法概述让我们回顾一些你可以自己使用和/或外包的市场研究方法。内部数据分析你已经在公司收集的数据是非常宝贵的二级研究数据源。你从事业务的时间越长，你手上的数据就越多。你的内部数据最好的地方在于它已经在现实生活中的市场条件下付诸实践，所以你只需要找到模式并得出结论。以下是你可以利用的一些内部数据源：网站数据（如 Google Analytics）CRM 数据过去的广告系列效果数据员工内部访谈采访访谈也可以是面对面的讨论，非常适合探索性的定性研究。在非规则化的访谈中，你可以就一组给定的主题进行非正式的、自由流畅的对话。在规范化的访谈中，你准备一份详细、严格的访谈协议，其中列出了你想问的每一个问题，并且你不能从这些问题中转移注意力。你还可以选择 “中间的方式”，即围绕预定义的主题或问题进行半规范化访谈，并允许进行开放式讨论。建议你始终保持中立和公正，即使在非规范化的访谈中也是如此。此外，对访谈进行试点测试以快速发现协议的一些缺陷也很有帮助。如果你打算记录采访内容可能会影响答案，因此请明智地使用它。焦点小组焦点小组是 5 到 10 名具有共同特征的人与主持人进行互动讨论。他们习惯于了解特定群体如何看待给定问题或提供有关产品的反馈。你可能知道 Steve Jobs 以讨厌焦点小组而闻名。他在记录中说：通过焦点小组来设计产品真的很难。很多时候，人们不知道他们想要什么，直到你向他们展示。如果你正在尝试创建像 iPhone 这样的跨越式产品，那么此声明可能有一定的道理。但我们大多数企业并非如此。我们只想知道客户是否会喜欢提议的新功能。为此，焦点小组非常有用。调查问卷调查涉及对你的受众进行投票。它们通常会以在线的形式进行客户满意度和忠诚度研究，并且是最受欢迎和最具成本效益的市场研究方法之一。经常被使用的在线调研案例如下：产品功能的可取性用户满意度反馈某些问题发生的定量分析识别客户购买过程中的摩擦点发现转换或取消服务的原因在产品入门期间创建客户档案（以及营销自动化关于最近进行的更改的意见调查市场的一个有趣例子是众包。这就是 Ahrefs 所做的，用来了解要构建的功能、它们的重要性以及客户对它们的期望。众包的独特之处在于它允许用户添加自己的想法，并对现有想法进行投票或评论，而不是回答预定的问题，因此这种方法的误差不会太多。你改善了业务，用户获得了更好的产品——每个人都有收获。我们如何在 Ahrefs 众包创意社交媒体是另一个调查市场的好地方。How many of you have disavowed links in GSC this year?— Tim Soulo (@timsoulo) October 8, 2020推文译：今年你们中有多少人通过 GSC 进行链接的排除？市场细分市场细分是根据特定标准将市场分类为同质组的做法，也称为细分变量（如年龄、性别、公司规模、国家等）。如果你认为你正在为每个人构建产品，请再想一想。不是每个人都想向你购买。聪明的公司会仔细挑选目标受众。他们确定可能成为企业有价值客户的人群或组织。通过这种方式，他们还可以发现自己的非理想客户，并制定计划以逐步吸引客户群。有没有想过为什么 P&G 创造了这么多、经常是相互竞争的品牌？你猜对了：市场细分。P&G 只是分而治之。不同的人有不同的需求，因此他们需要不同的产品（可能还有品牌）。来源: https://us.pg.com/brands/竞争分析另一种强大但经常被忽视的市场研究方法是了解市场环境。说真的，如果你只能做一件事来了解你的市场中哪些有效，哪些无效，那就是竞争分析。“每当我们讨论构建某个功能时，我们肯定会研究我们的竞争对手，看看他们是如何做到的。”Tim Soulo, CMO你会惊讶于你可以从竞争对手中学到多少知识，以及其中有多少可以在线完成。对于此类研究，有一些久经考验的技术、技巧和工具，你可以在本指南中找到它们。分析商业数据次要市场研究数据相对实惠、获取速度快、使用方便。想想市场报告、行业见解、以及已经收集和分析的大量研究数据，你不必自己重新去做。最著名的来源是 Gartner、Forrester 和 Pew。除此之外，请务必检查是否有特定于你的利基市场，并值得信赖的商业数据源。G2、Capterra 和 Trust Pilot 等网站也很重要。它们不仅为你提供了行业概览，而且你还可以在用户评论和竞争对手的评论中找到一些有用的信息。 Ahrefs 在内部和外部定期使用该数据源，例如我们 Ahrefs、Semrush 与 Moz 落地页的这一部分：市场研究的好处 — 对比让我们通过它们的主要优势快速总结上述 7 种不同的市场研究方法。 如何通过 5 个关键步骤进行市场调查所以现在我们知道什么是市场研究，为什么以及何时进行，并且我们已经了解了所有重要的类型和方法。 让我们看看我们如何使用这些知识分 5 个步骤进行任何类型的市场研究。作为市场研究的一个例子，我会告诉你我过去在一家 3D 打印公司的一些经历。 确定市场研究问题选择样本和研究方法收集数据分析数据解释和提出结论1. 确定市场研究问题这是每个研究项目开始的地方。你还会发现市场研究通常遵循科学方法。首先，你需要确定你正在研究的内容。你有关于业务的问题想要问吗？也许你在市场上看到了某些机会。或者，你对产品使用感到好奇并且有一个想要验证的假设？阐述它，就是市场研究过程的第一步。让我分享一个例子。过去，我为几家公司做营销，其中一家是 3D 打印机制造商。早些时候，我偶然发现了该公司的两个问题。第一：我们的一个细分市场已经饱和了，市场上有价格明显更低的类似质量的产品（经典问题）。第二：越来越多的 3D 打印制造商似乎正在远离业余爱好领域，以更昂贵的产品来应对专业领域，但我们仍然停留在业余爱好/DIY 领域。我们的产品对业余爱好者来说太贵了，但对于买得起我们的客户来说又太业余了。我想验证的假设是，如果市场显示出向更专业的 3D 打印用例发展的趋势，我们公司应该遵循这一趋势。换句话说，我想检查将品牌定位转移到专业/高级领域的可行性。2. 选择样本和研究方法我们已经介绍了市场研究的主要类型和方法。你应该已经很好地了解了初级和次要研究之间的差异，或者定性或定量方法是否最适合你的需求。至于你的研究样本，应该是你目标来源的一部分。例如，如果你想在你的客户中开展一项调查，样本需要能够代表你的用户群体。有几种样本的选项可以选择： 使用整个数据源。显然，它本身并不是一个样本。尽管如此，如果向所有客户发送调查是可行的（且合理的），那么这是一个非常好的选择。 选择随机样本。系统抽样是选择随机样本的最简单方法。这是你为样本选择每个第 x/n 个个体的地方，其中 x 是总体，n 是样本。例如，如果你希望从 1000 人的总体中抽取 100 人的样本量，请选择每 1000/100 = 第 10 个成员 使用非随机抽样（最有偏差的）。 便利抽样：选择可用且愿意参与调查的受访者。 目的抽样：选择你认为具有代表性或具有对研究很重要的其他特征的受访者。 配额抽样：选择一些任意配额的受访者，例如10 个非付费客户、10 个付费小公司和 10 个付费大公司。回到我们的例子。作为验证我的假设的一种方法，我选择了以下组合：初步数据： 调查发送给我们所有的经销商。因为他们遇到客户群体最多，我们想看看他们是否也看到了市场的转。我们还想知道他们对这种趋势的持久性的看法，以及他们是否可能对我们产品的更高级版本感兴趣。 我们的销售团队通过电话与我们的经销商进行了深入访谈。我们在这里使用了有目的的抽样。我们的样本包括与我们关系最好的经销商（我们知道他们会更愿意分享）。 竞争分析。我们最感兴趣的是试图渗透到专业/工业领域的市场参与者，所以这是我们的样本（目的性抽样）。我们对诸如以下内容感兴趣：他们在 3D 打印机中关注哪些功能、他们的品牌定位是什么、他们的定价是什么、他们用来与目标受众交流的语言等。次要数据: Wohler 的行业报告、Gartner 的 3D 打印行业报告、3D 打印服务提供商的报告，以及基本上我们能找到的所有重要数据（便利抽样）。 内部数据：客户满意度调研，以及基于 Google Analytics 和 Facebook 的用户数据。3. 收集数据一旦确定了问题、方法和样本，你所需要做的就是收集数据。这是你发送调查、进行采访或获取行业见解的步骤。一个忠告，谨慎选择你的市场研究工具；它将极大地影响你分析数据的工作量。例如，Google Forms 会自动用可量化的数据制作图表（而且它是免费的）。以下是我们为 3D 打印公司收集的数据：初步数据：经销商调查数据（定量和定性数据）。经销商访谈数据（定性数据）。客户满意度数据（通过所有客户支持渠道收集的定性数据，我们分析了大约 200 个问题和请求）。竞争分析数据（来自大约 10 个竞争对手）。次要数据：我们设法收集了 3 份全面、独立的行业报告、其他 3D 打印公司制作的一些较小的报告，以及其他数十份数据，如统计数据和值得注意的见解。我们提取了以下数据：3D 打印机制造商的市场份额、市场及时增长、市场细分、关键的 3D 打印应用、按地区划分的 3D 打印采用率、主要参与者的销售数据等。 我们可以在内部数据中找到有关客户和网站访问者的人数统计、社会学和心理数据。4. 分析数据既然你已经收集了数据，下一步就是寻找模式、趋势、概念或经常重复的词——这一切都取决于你的方法是定性的还是定量的（或两者兼而有之）。对小样本进行的简单研究相对容易分析，甚至可以自动分析，就像前面提到的 Google Forms 一样。有时，你将不得不使用昂贵且更难掌握的软件，例如 Tableau、NVivo、PowerBI、或者是 SPSS。或者你可以使用 Python 或 R 进行数据分析（如果你有数据分析师、数据工程师那是最好的）。继续这个例子：由于定量数据是自动计算的，Google Forms 让我们很容易发现调查中的模式。最耗时的部分是通读所有回复，并手动寻找（当时我不知道有任何工具可以完成这项工作）。销售和营销团队都致力于分析一些定性数据，以获得多个参考点。在研究竞争对手时，提出某种数据结构会使工作更加全面（更合理）。我们将竞争对手的数据放在特定类别中，例如产品和服务（包括价格）、目标市场、优势、价值和品牌信息。我们还使用了一种叫做品牌定位图的东西，它看起来像这样：来源: http://inboundrocket.co分析次要数据可能是最简单的部分，因为我们需要的数据已经准备好随时可用的图表、统计数据和见解。我们只需要筛选内容即可寻找问题的答案。 5. 解释和得出结论仅分析数据是不够的。你需要以可交流的、可操作的方式为决策者解释数据。一个好的做法是在你的报告中包括：你的所有信息、你的研究过程的描述、结果、结论和建议。就 3D 打印行业的例子，我判断我们的市场正在经历重大转变，公司应该遵循这一趋势。我们所做的研究积极验证了该判断：我们的经销商对专业/工业用例和机器的询问越来越多。可以想象，这类客户的预算明显高于业余爱好者。 我们的经销商表示，这种现象将继续存在。此外，他们还宣布对一款新的 3D 打印机感兴趣，以满足其更苛刻的客户的需求。我们的客户已经超出了他们早期的习惯，他们想要一些更易于使用、即插即用、运行可靠的产品。修复打印机只有铁杆制造商才感兴趣的事情。我们关注的公司已经开始通过他们的报价和巧妙的营销传播来适应专业/高级市场。我们还发现了大量其他有趣的数据，我们稍后会使用这些数据。例如，我们发现除了工程师和设计师之外，一个同样有趣的用户是教育机构。我们最初的市场调查持续了大约两个月。每当我们有机会（或必要）时，我们也会重新审视，看看我们是否在正确的规划上。它值得吗？让我告诉你：它拯救了公司。我们的研究表明，这是重新定位品牌和产品的最后一招。我们最初的目标细分市场逐渐被我们无法与之竞争的公司所主导。我们花了一些时间来获得主要利益相关者的认可，并在整个公司内实施（最终，我们做对了）。结果，我们增加了销售额，提高了客户满意度，并使自己走上了更有利可图的增长轨道——对每个人来说都是双赢的。我们甚至与另一家制造商合并，以快速进入最佳市场。回想起来，我们的竞争对手中没有人幸存下来。他们不像我们那样适应，我们把一切都归功于市场研究。专家建议无论你做什么，都要避免这些常见的市场研究错误： 错误的抽样。模棱两可的问题。引导性或负载性问题（有偏见或包含有争议的假设或问题）。研究目标不明确或过多。混合相关性与因果关系。忽略竞争分析。允许偏见影响你的研究（认知偏差可以说是最常见和最危险的）没有不定期的跟踪数据。在线市场研究工具和资源市场研究可以追溯到 1930 年代，它的根源可能甚至比 20 世纪“更久远”。有了这些在线工具和资源，你可以做的一切现在都可以做得更好、更快、更便宜。 SEO 工具 — 使用 Ahrefs 研究市场我总结了 3 个可以快速帮助你进行市场研究的方法——这只是你可以用 Ahrefs 做的事情的一部分.1. 品牌意识在 20 世纪初期，你必须聘请市场研究人员花费数天甚至数周的时间来询问人们“你是否听说过 X 品牌”。今天，你可以简单地查找该品牌的搜索量。假设你经营一个无人机制造品牌，并且想了解竞争对手在法国的品牌知名度。前往 Ahrefs Keywords Explorer（关键词分析），输入品牌名称，选择 “法国” 作为你的市场，一瞬间你得到：品牌关键词搜索量表示该品牌在特定市场中的品牌知名度。你还可以通过定期执行此搜索来跟踪该数据，以查看随着时间的推移是否有重大变化（例如，受近期活动的影响）。2. 功能需求电动汽车的下一个改变游戏规则的功能将涉及电池、充电时间和充电成本（而不是自动驾驶仪）。我怎么知道？好吧，我打开 Ahrefs Keywords Explorer（关键词分析），输入“electric cars”，然后转到问题报告以了解人们搜索的内容。这让我了解了电动车车主有哪些问题（以及潜在车主担心的问题）。你可以轻松地为你的利基市场进行类似的研究。3. 了解你所在市场的“文字”Gerald Zaltman 在他的畅销书《How Customers Think》中提出了这样一种观点，即营销的主要错误假设之一是消费者思考和使用的“文字”是一致的。另一方面，当消费者使用谷歌搜索某些东西时，他们必须用“文字”来表述。当我们向这些消费者推销时，我们也必须用“文字”来表述。问题是：哪些“文字”？假设你想进入美国的一个新的创新市场，例如合成发酵乳制品行业，也称为无动物乳制品。对你来说，“animal-free dairy”这组词可能是你业务和营销工作的核心。但是让我们看看其他人是怎么想的。让我们使用 Ahrefs Keywords Explorer（关键词分析）来看看有多少人在美国搜索这个词：看起来你的产品名称的知名度低得令人失望。这是否意味着你注定失败？并非如此。让我们试试其他词。含义不同但仍与你的新产品密切相关。发现问题了。人们更频繁地搜索 “vegan dairy” 和 “lactose free dairy”。词不一样，但密切相关。搜索还是有差异的。文字不同但是目的很类似。谷歌也是知道这一点的。你能够将所有这三个短语放在同一个桶中的唯一原因是你知道这些词之间的联系。问题是你的目标受众可能不知道这种联系；他们甚至可能不知道存在这种产品。这种对搜索量的快速分析表明你可以通过内容营销来建立这种联系。如果你围绕相关的搜索量更高的关键词创建内容，与仅仅关注指定产品类别的关键词相比，你可能会获得更多的自然流量。即使你可能认为你的无动物产品的主要好处与乳糖无关，例如无残忍生产，你可能希望通过解决乳糖不耐症的问题，以吸引患有这种疾病的人。但这还不是全部。你可能已经注意到右边的 “low lactose cheese”。这是指 Ahrefs Keywords Explorer（关键词分析）中称为“父主题”的功能。父主题表示，给定关键词是该父主题词的更广泛搜索的一部分。如果我们点击这个父主题，我们会发现更多的搜索需求：我们可以看到，在美国，“low lactose cheese” 主题的搜索量超过了 “vegan dairy” 的近 300%。此外，发现父主题为我们提供了 879 个潜在的关键词创意（其中一些具有更高的搜索量，例如“lactose free cheese”）。 想要发现更多主题关联吗？没问题。你可以使用 Ahrefs Keywords Explorer（关键词分析）的其他功能更深入地研究这项研究。例如，Also rank for（同时有排名的词）报告允许你查看目标关键词的前 100 个排名页面也为哪些其他关键词（和主题）排名。这种快速的市场研究可以应用到更广泛的关键词上。如果你想发现更多关键词建议并学习如何分析它们，请阅读我们的关键词研究指南。CRM来源： https://hubspot.com客户关系管理软件用于管理和跟踪公司与其客户和潜在客户之间的互动。通常，它与销售或营销自动化软件协同工作。如果使用得当，它是真正的市场洞察利器。正如我之前指出的，它是你可以用来发现客户行为或特征的主要数据源之一。通常的选择是 Hubspot、Salesforce、Intercom。因为有大量 CRM 软件，因此建议通过例如 G2 查看软件的比较，看看什么最适合你的需求。用户反馈工具这种类型的工具允许你在线执行我们上述的调查研究。使用 Google Forms, SurveyMonkey, Typeform, 或 Qualaroo。 等工具创建有针对性的、针对特定用户的调查，并分析结果。发送带有调查的电子邮件并不是唯一的选择，例如使用 Qualaroo 你可以在这些地方进行调查：在你的数字产品中在你的 SaaS 产品中在你的网络应用程序中在你的移动应用程序中在你的网站上在你的移动网站上在你的原型产品上。在大多数公共 URL 上。甚至是竞争对手的网站需要更多？没问题，请查看 SurveyMonkey 的市场研究解决方案。它利用了我们讨论过的快捷市场研究模型。他们有 14 种在线解决方案，可帮助你保持领先地位，包括客户细分、监控市场动态、品牌、创意分析、功能重要性、为你的产品找到合适的价格等等。所以你认为你有一个艰难的商业挑战？不妨试试上述的方法。网站/应用分析跟踪你的网站或应用流量是绝对的营销基础。看看谷歌分析提供的一些数据维度：人数统计地域行为设备渠道听起来很熟悉？是的，这听起来像是很好的市场细分。这是最好的部分：它是免费的、基于你的主要数据、并且执行速度快。如果你从未深入研究过 Google Analytics 或类似的分析软件（例如 Matomo, Woopra），下面就是这些工具可以帮助你解决的问题： 人们访问我的网站后会搜索什么？已购买的客户与未购买的客户有何区别？我的收入最高的国家有哪些？我最畅销的产品是什么？如果你已经在使用 Google Analytics，请查看你是否出现过这些 Google Analytics 跟踪错误。用户体验研究工具来源：Mozilla用户体验设计师常用，请听听这些工具的评价：“看到和听到真实的人使用你的网站、在线商店或应用程序的过程。” (https://userpeek.com/)“实时反馈。来自真实客户。无论你在哪里工作。因此，你可以创建，并获得真实的结果。” (https://www.usertesting.com/)“可扩展和定制的用户研究” (https://www.userlytics.com/)“录制用户的视频和音频，以便你看到和听到他们对你的产品的确切体验。” (https://www.loop11.com/)同样，听起来很像我们的市场研究方法，对吗？这不是开玩笑，成千上万的公司使用这些工具。用户体验研究工具可让你获得关于你的产品、原型、网站和应用程序的用户反馈和见解。测试基于你的执行的任务。你可以使用自己的用户群，也可以使用他们的服务定义的自定义群。你将获得书面报告甚至录制的视频，你可以将其纳入你的市场研究，并确保你正确利用了该市场机会。广告规划工具没错——你用于投放广告的 Facebook、LinkedIn 和 Twitter 广告规划器可以让你深入了解你感兴趣的细分市场背后的数据。比如，30岁以上受过高等教育的男性对科技产品感兴趣？还是来自欧洲的女性高管决策者？答案都在那里。人口普查数据此类数据的可用性可能因你的目标市场而异。例如，在美国，人口普查局提供免费资源来搜索该国的人口普查数据。你可以按主题、年份、地理、调查或行业代码过滤数据。你还可以访问预制的交互式表格（你也可以下载）或使用他们的地图探索该国的某些地区。商业智能工具来源：Marissa-anna — Own work, CC BY-SA 4.0借助 Tableau, Looker 或 Sisense 等商业智能工具，你可以连接到任何数据源，以执行数据清理、统计操作和数据可视化。它们旨在让你深入了解数据，并与利益相关者进行有效沟通。这就像 SQL 与 R 的结合，但你不需要编码技能，并且你将获得一个用户友好的界面。由于这些工具功能丰富，而且通常价格昂贵，因此对于具有市场研究需求的小公司来说不太适合。通常，你会发现你用于研究的工具带有一些数据分析和可视化功能。如果没有，你始终可以将数据导入 Excel 或 Google Docs，并使用 Google Data Studio 进行可共享的交互式演示。其他值得关注的工具和服务StatistaNielsen IQThink with GoogleLiving FactsDisplayr最后市场调查绝非易事。如果你被它吓到了，你不是唯一一个。但不要回避它。进行零星的市场研究可以为你的业务带来你无法忽视的好处。你不会在一夜之间成为市场研究专家，你也不需要这样。你可以采用一些快速的方法（如 Ahrefs），使用负担得起的自助在线工具和资源，甚至可以将研究外包。只要你将营销游戏计划建立在有效数据的基础上，你就可以显着提高成功的机会。有问题？Twitter 找我吧。译者，Park Cheng，歪猫出海创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Mateusz Makosiewicz Ahrefs 的营销研究员和教育家。 Mateusz 在推广代理、SaaS 和硬件业务领域拥有超过 10 年的营销经验。平时喜欢创作音乐或享受长距离的散步。",
  "headers": [
    {
      "level": "H1",
      "text": "市场研究：是什么又如何做？"
    },
    {
      "level": "H2",
      "text": "市场研究在营销策略中的作用是什么？"
    },
    {
      "level": "H2",
      "text": "什么时候应该进行市场调查？"
    },
    {
      "level": "H2",
      "text": "市场调查的类型"
    },
    {
      "level": "H3",
      "text": "初步研究"
    },
    {
      "level": "H3",
      "text": "次要研究"
    },
    {
      "level": "H3",
      "text": "初步研究 VS 次要研究"
    },
    {
      "level": "H3",
      "text": "市场研究子类型"
    },
    {
      "level": "H2",
      "text": "市场研究方法概述"
    },
    {
      "level": "H3",
      "text": "内部数据分析"
    },
    {
      "level": "H3",
      "text": "采访"
    },
    {
      "level": "H3",
      "text": "焦点小组"
    },
    {
      "level": "H3",
      "text": "调查问卷"
    },
    {
      "level": "H3",
      "text": "市场细分"
    },
    {
      "level": "H3",
      "text": "竞争分析"
    },
    {
      "level": "H3",
      "text": "分析商业数据"
    },
    {
      "level": "H2",
      "text": "市场研究的好处 — 对比"
    },
    {
      "level": "H2",
      "text": "如何通过 5 个关键步骤进行市场调查"
    },
    {
      "level": "H3",
      "text": "1. 确定市场研究问题"
    },
    {
      "level": "H3",
      "text": "2. 选择样本和研究方法"
    },
    {
      "level": "H3",
      "text": "3. 收集数据"
    },
    {
      "level": "H3",
      "text": "4. 分析数据"
    },
    {
      "level": "H3",
      "text": "5. 解释和得出结论"
    },
    {
      "level": "H2",
      "text": "在线市场研究工具和资源"
    },
    {
      "level": "H3",
      "text": "SEO 工具 — 使用 Ahrefs 研究市场"
    },
    {
      "level": "H4",
      "text": "1. 品牌意识"
    },
    {
      "level": "H4",
      "text": "2. 功能需求"
    },
    {
      "level": "H4",
      "text": "3. 了解你所在市场的“文字”"
    },
    {
      "level": "H3",
      "text": "CRM"
    },
    {
      "level": "H3",
      "text": "用户反馈工具"
    },
    {
      "level": "H3",
      "text": "网站/应用分析"
    },
    {
      "level": "H3",
      "text": "用户体验研究工具"
    },
    {
      "level": "H3",
      "text": "广告规划工具"
    },
    {
      "level": "H3",
      "text": "人口普查数据"
    },
    {
      "level": "H3",
      "text": "商业智能工具"
    },
    {
      "level": "H3",
      "text": "其他值得关注的工具和服务"
    },
    {
      "level": "H2",
      "text": "最后"
    }
  ],
  "author": "Mateusz Makosiewicz"
}