{
  "url": "https://ahrefs.com/blog/zh/marketing-tactics/",
  "slug": "marketing-tactics",
  "title": "2021年最有效的16种营销策略",
  "description": "营销策略是指帮助你实现营销目标的方向与方法。本文会教你如何执行你的营销策略，以取得成功。",
  "content": "Michal Pecánek Ahrefs的营销专家和内容创作者。 沉迷于SEO，航空，香氛，寿司和墨西哥玉米卷。 内容 营销策略是指帮助你实现营销目标的方向与方法。本文会教你如何执行你的营销策略，以取得成功。选择最合适的营销策略取决于你的营销目标、预算以及你的目标受众是谁、以及在哪里。记住这一点，并阅读下方这16个营销策略：尽可能多地宣传你的内容重新调整内容用途定期更新内容针对 Google Discover 优化你的内容参与有价值的关键词排名 针对精选摘要进行优化经常优化的你的内链提升排名使用“中间人”策略向转化页传递权重监控并反馈 HARO 请求通过新闻劫持获取权重和链接为相关方提供作客博客建立流水式电子邮件营销利用廉价且未充分利用的营销渠道参与赞助活动创建分销计划使用品牌特征提高独特性1. 尽可能多地宣传你的内容你是否定期在博客上发表文章、或是在Youtube上创建视频、或是录制播客？产生一流的内容虽然很重要，将它分发给你的听众同样也很重要。可以说，内容营销的第二部分比内容创作本身更为关键和具有挑战性。.你可以通过多种方式分发内容：在社交媒体上分享在相关论坛中发布添加在邮件通知中把它发给你所在行业有影响力的人为它投放广告不过，并不是所有的内容都相同的做法。把你所有东西都发送给有影响力的人是没有意义的。你应该把最有价值和最有趣的内容发给他们。广告也是如此，因为你不会想花钱去推广那些对你的业务几乎没有价值的内容。你还应该在对你的业务最有意义的平台上加倍努力。对一些人来说，可能是 Twitter、LinkedIn 和相关论坛。对于其他人来说可能是 Instagram 或 Pinterest。这里的好处就是你可以在社交媒体上不断的分享你的内容、或者不断的投放广告。推荐阅读: 内容营销：2021年全面指南2. 重新调整内容用途人们会观看各种形式的内容。那么，为什么不把你的博客文章改成视频，反之亦然呢？比如我们就经常这么操作。例如，我们的 关于 Youtube SEO 的视频拥有20万次以上的浏览：同时我们也把他做成了文章，它每月給我们带来了大约 1万4千多次点击：数据来自Ahrefs Site Explorer（网站分析）.通过两种格式的内容，我们可以在 SERP 中占据两个位置：没有时间、金钱或技术来制作视频吗？你也可以通过将文章重新调整为社交媒体类的推文。我之前写了一篇 关于跳出率的文章，然后一个月后，我从中挑出了最出彩的一段做成了推特的推文：Bounce Rate One of the most misunderstood Google Analytics metrics.9 things you might not have known.🦘//THREAD//— Michal Pecánek (@michalpecanek) December 2, 2020 这是我最受欢迎的推特，吸引了很多邮件订阅。其实当时我们单独分享这篇文章时，并没有引起太大的轰动。3. 定期更新内容你的大部分文章不会永远保持新鲜。有些甚至在几个月后就过时了。这是一个问题，因为至少对于某些搜索词来说，内容新鲜度是一个重要因素。可以看下面这些结果：在2021年的头几周，大多数排名靠前的页面都更新了一遍。因此，如果你注意到你的一些文章的自然流量下降，这可能是一个信号，是时候需要更新它们，并恢复你在SERP中的排名。这也是我们博客发展战略的一部分，也应该是你的一部分。如你所见，我们有三分之一的文章至少更新了一次：数据来自 Ahrefs Content Explorer（内容分析）重新更新内容通常会导致自然流量的增加，正如你可以在我们的一个帖子中看到的：推荐阅读: 重新发布内容：如何针对SEO更新旧的博客文章4. 针对 Google Discover 优化你的内容Google Discover是一个全新的无需搜索的 feed 流渠道，它可以根据你的兴趣生成内容：针对 Google Discover 优化内容重点在于发布热门的话题。但是你也需要做到些其他的一些事情：拥有一个移动端友好的网站使用独特的、高质量的图片匹配你的内容和 meta 标签在 E‑A‑T 上下功夫即使你的网站或内容不太可能从 Google Discover 获得太多的流量。但从长远来看，以上的操作也会对你的 SEO 产生积极的影响。 推荐阅读: Google Discover：如何排名以及如何获取流量5. 参与有价值的关键词排名每个月，我们的网站仅从谷歌过来的点击量就超过100万次：事实上，使用 SEO 来参与价值的关键词排名是我们营销战略的核心。但是什么是有价值的关键词呢？两件事：a) 流量潜力通常我们会看每月的搜索量，你可以在 Ahrefs Keywords Explorer（关键词分析）中查看：但由于单一的搜索量可能会产生误导，你也应该向下滚动，并查看排名靠前的页面每月可以获得多少流量。参考这个数字可能会更好，因为它还计算了其他关键词带来的自然流量。b) 商业潜力商业潜力代表该话题对你的业务的价值。毕竟，创建对业务没有价值的话题内容是没有意义的。一下是我们自己对话题进行的商业潜力评分：3: 我们的产品对解决问题是绝对必要的；2: 我们的可以帮助解决问题，但是不是最关键的；1: 我们的产品只可以被提及；0: 无法提及我们的产品。我们主要针对的话题不是 “2” 就是 “3”。这篇文章就是证明。它不仅具有巨大的流量潜力，而且我们可以很自然地向你展示 Ahrefs 如何帮助你执行这些营销策略的。推荐阅读: 什么是SEO内容？如何编写可排名的内容专家建议在优化某个话题时你也应该注意其他 SEO 指标。优先主题。其中一个指标是 Keyword Difficulty (关键词难度) 。这将根据前排名前十页面的 referring domains（反链域名）数量来判断难度分数。由于反向链接是一个最重要的排名因素，KD 值可以大致告诉你你的竞争对手是什么样的。应该给你一个想法，你面对的是什么在SERP。当然，你的最佳机会在于有高流量和商业潜力、并且 KD 较低的关键词。但这种情况并不经常发生。通常情况会恰恰相反，KD 会随着流量和商业潜力的增长而增长。你可以通过瞄准低 KD 的关键词开始在你的领域建立权威性，然后随着你的成长，把你的重心转移到更具竞争力的关键词上。6. 针对精选摘要进行优化精选摘要通常出现在谷歌搜索结果顶部。它们通过从排名靠前的页面中提取相关内容来为搜索者提供最直接的答案。他们最大的优点是他们提供了一条通往最顶部排名的捷径。某一天，你的某个关键词排在第 7 位，如果谷歌认为你的内容适合这个精选摘要，你可以直接跳到第 1 位。你可以使用 Ahrefs Site Explorer（网站分析）中的 Organic Keywords（自然关键词）报告找到包含精选摘要的搜索词。 通过筛选功能，显示当前你有排名但未获得精选摘要位置的词：优化特色代码段可能很复杂，但简而言之，你需要将你当前的内容与当前精选摘要中的内容匹配才可以：例如，关键词 “backlinks” 的当前精选摘要中显示了一个定义：这可能时大多数搜索者正在寻找的一个答案。我们可以通过在页面上提供更好的 “backlinks” 定义来增加接管该精选摘要的机会。推荐阅读: 如何优化谷歌精选摘要7. 经常优化的你的内链来提升排名内部链接是同一域中从一个页面到另一个页面的链接。优化内部链接可能是 SEO 中最未充分利用的最佳机会之一。因为将更多相关的内部链接指向重要页面通常会帮助他们排名更高，主要原因有两个： 增加页面权重。谷歌使用一种叫做 PageRank 的方法来对网页进行排名。它会从内部和外部反向链接判断网页的权重。 提升相关性。内部链接使用相关的锚文本可以更好帮助谷歌了解你的网页内容、更好的参与排序。因此，链接到网站上的相关页面对你的访问者和你的 SEO 工作来说都非常有利。在Ahrefs Site Audit （网站诊断）中，你可以很容易地找到内部链接机会。在你创建了一个项目并且我们的机器人在你的网站上抓取之后，进入 Link Opportunities （链接机会）报告并在适当的地方更新你的内部链接：https://www.youtube.com/watch?v=HWBBqJ0a2U4推荐阅读: 内部链接优化：一个可操作的指南8. 使用“中间人”策略向转化页传递权重直接为你的转化页面获取链接可能会比较困难。中间人模式就是一个很好的解决方案，他也是最有效的链接获取技术之一。具体是这样的：创建链接诱饵将该页面的内容中添加链接到你的转化页面什么类型的内容最有效，主要取决于你的利基。在我们的案例中，我们通常会用数据研究类的内容，正如你在 Best by links（按外链数量排序） 报告中所看到的：因此，这些文章中指向我们其他页面的链接传递了大量 PageRank。推荐阅读：一个简单的 SEO 优化策略（中间人方法）9. 监控并反馈 HARO 请求HARO 是 Help A Reporter Out 的缩写。这里汇集了记者、博主、以及其他作家的需求反馈，他们需要为他们正在研究的作品提供信息。你可以是信息的来源。只要注册电子邮件通知，监控属于你行业的的请求。并在适当的话题上尽可能快地为对方提供有价值的信息。这是一个不错的链接建设和建立权重的机会。尤其是在项目的开始阶段，因为重要的是你提供的信息，而不是你实际的网站或内容。以下是我在HARO的一些经验： 检查出版物。避免那些不权威或过分依赖HARO的人。 记得挑选。只有在你能真正提供大量信息的情况下才回应请求。 尽快作出反应。很多人都在和你一样监控某个些类目的请求。 找人帮忙。如果同事更有资格回答，就不要犹豫地让他们帮助你。 符合要求。不要偏离作者要求的格式。以下是一篇通过 HARO 在一家权威网站上发表的一篇关于 CDN77（我过去曾为这家公司工作） 正在做什么的综述文章。我得到了前同事的帮助，因为我没有资格为 “best tools for system administrators” 提供答案：推荐阅读: 如何建立反链和以及如何通过HARO获取新闻媒体资源10. 通过新闻劫持获取权重和链接新闻劫持是一种被动的公关技术，它依赖于尽快向媒体提供有关时事的有价值的信息。与之前的 HARO 策略不同，这需要监控世界上发生的与你的利基相关的事情，并在新闻发布任何消息之前向它们投稿。这是一个更先进的战术，结果也可能是惊人的：Building links on top tier domains in the financial/medical space builds trust and authority with GoogleIn 6 months, we drove a 329% increase in organic traffic for a forex trading client of ours and 53% increase in organic conversions. A thread on how… pic.twitter.com/jHJNZcjGu0— Carrie Rose (@CarrieRosePR) January 18, 202111. 为相关方提供作客博客作客博客 是指为另一个网站创建和发布的内容。你为其他网站发帖的三个主要目标是：建立知名度获取流量参与有竞争力的词排名第三个目标需要解释一下。如果在你的利基中你还不算权威，那么很难参与一些具有挑战性的关键词排名。因此，当你专注于你网站上的一些低难度的词时，也可以利用别人的大网站，去竞争一些高难度的词。当然，你在别人的网站发布内容并不属于你，但是同时满足作客博客三个目标也是非常值得你去尝试的。推荐阅读: 作客博客 SEO12. 建立流水式电子邮件营销众所周知，你应该尽早开始你的电子邮件营销列表。但是然后呢？很明显，你可以定期发送电子邮件。但有一种策略没有得到充分利用，就是流水式电子邮件营销。流水式电子邮件营销是一系列的电子邮件在指定的时间间隔、或用户完成一个特定的行动后自动触发的。有些时候这个很简单，比如我们的就是在订阅完邮件后就会单独发一封邮件给你：我们发送给新博客订户的电子邮件但在将用户转换为付费用户时，你可能需要按固定顺序发送更多电子邮件：上面的例子虽然我不太喜欢，但是，我最后还是买了它们的产品。所以，想想你希望通过电子邮件实现的目标，并制定一个电子邮件序列来实现这些目标。比如，当用户在某一时间内没有查看购物车时、为首次购买提供折扣优惠券等。13. 利用廉价且未充分利用的营销渠道每个人都知道在谷歌和 Facebook 上做广告。这些渠道可以用，但如果你的观众使用的是一些不饱和的平台，那么你就可以用更少的钱去获取客户。这些平台可以是特定于你所在地区的频道、一些可以替代搜索引擎的平台、甚至是 Quora 或Brave Ads 等不太知名的全球广告平台。我在这两个平台上都做过广告，它们的表现大大超过了谷歌和 FB 广告。如果不做广告，即使通过自然流量也能获得不错的效果。看看我的同事 SQ 是如何从他的 Quora答案中获得超过160万的浏览量的：推荐阅读: Quora 营销：100万次浏览 如何复制我们的成功14. 参与赞助活动我们的营销预算中有很大一部分用于赞助播客、活动和新闻稿。这就是我们花费大部分品牌建设预算的方式。是的，品牌建设。不管你赞助什么，都不太可能带来很多直接的销售。但是，反复地在你的观众面前传达一个关键的信息，也可以创造奇迹。我们赞助一个新闻稿的营销示例你甚至可以用更传统的方法。这完全取决于你的产品、定位和受众。汇丰银行（HSBC）这样的品牌在许多机场中都有自己的标志；或者你在体育赛事的计时员旁边可以看到 Omega 的标志，这都是有原因的。推荐阅读: 我们在播客广告中花费 51975 美元学到的东西15. 创建分销计划一个分销计划可以允许任何人把新客户介绍给你的同时赚取佣金。分销者会激励人们向朋友、熟人和观众推荐你的产品。在走这条路线之前，你应该考虑以下几点： 要有一个不错的产品。一些分销公司可能会分销一些他们自己都不相信的东西，但从长远来看，这可能会适得其反。 查看竞争对手的分销计划。有些对手可能相当激进，不值得与他们竞争 详细计算收支。你希望在盈利能力和合理的分销佣金之间达成平衡，以最大的激励分销公司推广你的产品。在 Ahrefs，我们几年前就停止了我们的分销项目。因为我们现在是一个行业领先的 SEO 工具，人们会因为口碑而推荐我们的产品。创建一个分销计划是一个很好的方式，以获得早期曝光。但你得好好思考，毕竟调整佣金或中止该计划很容易事与愿违。16. 使用品牌特征提高独特性品牌特征是你在与用户交互中一贯使用的任何东西。每个商家都有自己的 Logo，甚至在视觉效果上有独特风格。大多数品牌是这样。但是在目标受众心目中只是与众不同是不够的。你的决策是应该是选择3–5个品牌特征（品牌独有的）。然后在交互中部署这些，作为策略执行。在Ahrefs，除了我们的 Logo 和蓝色底色之外，我们还有两个品牌特征。第一种是我们自己的自定义字体：第二个是我们的吉祥物胡须男，他经常伴随着一只柯基犬：人的创造力是无限的。重要的是，你要选择与你的品牌相关联的东西，并始终如一地使用它。更多的品牌特征的例子包括你自己的表情、礼物、独特话术、标语、甚至你的广告风格等。你可以想想万事达卡的 “priceless” 这样的标语。(译者释：比如，腾讯公司一直使用的企鹅图标，是否给你留下了深刻的映像。）最后营销策略通常会围绕你的产品（product）、价格（price）、地点（place）和推广（promotion）。通常也被称作为 “4P营销策略”。正如你可能已经注意到的，上面的大多数策略都集中在推广部分。这是因为创造满足受众需求的产品、优化定价以获得最大利润，这些应该都是常识。虽然这么说，4P 种所有的要素都是必不可少的。然而营销人员往往只关注推广部分而忽略了其他部分。别那么做。进行市场调查，在坚实的营销战略的基础上，然后把重点放在 “4P” 上。有问题吗？在 Twitter 上找我吧。译者，Park Cheng，魔贝课凡联合创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Michal Pecánek Ahrefs的营销专家和内容创作者。 沉迷于SEO，航空，香氛，寿司和墨西哥玉米卷。",
  "headers": [
    {
      "level": "H1",
      "text": "2021年最有效的16种营销策略"
    },
    {
      "level": "H2",
      "text": "1. 尽可能多地宣传你的内容"
    },
    {
      "level": "H2",
      "text": "2. 重新调整内容用途"
    },
    {
      "level": "H2",
      "text": "3. 定期更新内容"
    },
    {
      "level": "H2",
      "text": "4. 针对 Google Discover 优化你的内容"
    },
    {
      "level": "H2",
      "text": "5. 参与有价值的关键词排名"
    },
    {
      "level": "H4",
      "text": "a) 流量潜力"
    },
    {
      "level": "H4",
      "text": "b) 商业潜力"
    },
    {
      "level": "H2",
      "text": "6. 针对精选摘要进行优化"
    },
    {
      "level": "H2",
      "text": "7. 经常优化的你的内链来提升排名"
    },
    {
      "level": "H2",
      "text": "8. 使用“中间人”策略向转化页传递权重"
    },
    {
      "level": "H2",
      "text": "9.  监控并反馈 HARO 请求"
    },
    {
      "level": "H2",
      "text": "10. 通过新闻劫持获取权重和链接"
    },
    {
      "level": "H2",
      "text": "11. 为相关方提供作客博客"
    },
    {
      "level": "H2",
      "text": "12. 建立流水式电子邮件营销"
    },
    {
      "level": "H2",
      "text": "13. 利用廉价且未充分利用的营销渠道"
    },
    {
      "level": "H2",
      "text": "14. 参与赞助活动"
    },
    {
      "level": "H2",
      "text": "15. 创建分销计划"
    },
    {
      "level": "H2",
      "text": "16. 使用品牌特征提高独特性"
    },
    {
      "level": "H2",
      "text": "最后"
    }
  ],
  "author": "Michal Pecánek"
}