{
  "url": "https://ahrefs.com/blog/zh/marketing-strategy-examples/",
  "slug": "marketing-strategy-examples",
  "title": "3个你可以用来创建你自己营销策略的案例",
  "description": "营销策略是企业接触消费者并将他们转化为消费者的整体策略。",
  "content": "Marc Thomas 在B2B SaaS营销机构Powered by Search担任增长负责人。在 我的博客上写关于营销和增长的文章。 内容 营销策略是企业接触消费者并将他们转化为消费者的整体策略。每个人对如何制定营销策略都有自己的看法，但你需要知道的关键部分是: 你的价值主张: 你的产品如何与客户的痛点、需求或欲望相关联。 目标客户: 了解公司提供的产品或服务的目标客户。企业有时会有一个单一的客户档案，但他们往往会有好几个。 你的关键信息: 你要告诉那些目标受众，让他们转化为客户。 你的营销渠道：如何通过关键信息吸引目标受众。 营销渠道的一些示例是SEO，社交媒体和电子邮件营销。在本文中，我们将使用上述这些关键部分来分解不同行业中三家真实公司的营销策略，以便你了解这一切在实践中是如何工作的。MethodPerfect KetoAhrefs1. Method如果你曾经走进超市的清洁用品货架，你几乎肯定熟悉Method。这家总部位于芝加哥的公司自2001年以来一直在生产家用清洁产品。当你期待一个销售清洁喷雾剂的品牌是相当实用和干燥的时候，Method脱颖而出，它远离传统的营销方式。Method的价值主张是什么？Method的主要价值主张是，它们是纯天然的品牌。与许多使用大量合成化学品的清洁产品不同，Method的大多数成分都是可生物降解的，并且是基于植物的。 他们非常确定自己的成分无毒，因此创始人埃里克·瑞安（Eric Ryan）在早期的媒体采访中就喝了他们的马桶清洁剂。 请不要在家中尝试此操作。为了适应这种非常规的方法，Method投入了大量的精力使瓶子变得漂亮。其他品牌则使用绿色，黄色或蓝色的临床用瓶（清洁的颜色），而Method的瓶则是艺术品：彩色，透明的，通常是与艺术家合作设计的。它们在货架上一眼就能辨认出来，并且表现了 Method 产品充满了天然成分，不需要不透明的瓶子来掩盖混合物本身。Method的目标客户是谁？几乎所有拥有马桶、水槽或浴室的人都可以成为 Method 的客户，但不是所有需要清洁的人都会购买他们的产品。Method最重要的客户群是具有环保意识的人。这个群体主要关注瓶子的生产过程以及产品的成分如何影响地球。Method的瓶子是完全可回收的，由再生塑料制成。这个群体中的人也可能是寻找无毒产品的发起者。Method的主要讯息是什么？Method的核心信息是，有效的清洁产品不必对环境或人类有害。 但是他们也试图传达清洁不一定无聊的信息。作为一个信息，这有点抽象，但他们对瓶子设计的痴迷，以及我们稍后将看到的，他们对社交媒体的态度，无疑让信息更加清晰。Method使用哪些营销渠道？Method的网站稀疏，几乎没有任何内容，但它们在搜索方面的表现仍然非常出色。 根据Ahrefs的网站分析，他们在美国的网站每月平均从搜索引擎获得的访问量超过8万次。在许多品牌、高流量的术语中，它们也排名第一:一家在搜索方面做得很好并且主要搜索品牌关键词的公司通常会通过其他渠道获得较高的品牌知名度。人们已经从公司的营销中了解Method。他们为实现这一目标而付出的努力在哪里？让我们先从 Instagram 看看。Method在所有主要国家都有一个 Instagram 账号，用来分享高度视觉化的内容。Method的包装对他们Instagram的订阅受众来说是完美的，他们会为美丽的物体和组合点赞。他们还相当广泛地使用网红营销——付费和获得——使用 # methodaddict 的标签。目前在 Instagram 上使用这个标签的有接近3 k 帖子。除了他们在 Instagram 上的出现，Method 还在 YouTube 上产生了大量的用户评论。虽然并非所有的评论都是正面的，但用户评论的力量在于，它们为营销组合增加了一定程度的社会认证，而这并不容易直接管理。另一方面，Method 似乎没有投入任何时间为 YouTube 自己创建内容。然而，如果你在搜索，你可以找到他们制作的一些非常高产量的电视广告，包括The Proclaimers这首引人入胜的曲子，’ I’m Gonna’ Be (500 Miles):https://www.youtube.com/watch?v=ezAuS4AeO8s2. Perfect KetoPerfect Keto是直接面向消费者（DTC）的电子商务品牌，为遵循生酮饮食的人们销售小吃和补品。 它由位于德克萨斯州奥斯汀的脊骨医学博士Anthony Gustin于2016年创立。生酮饮食(简称 keto)声称能帮助你减肥，改善你的整体健康，甚至预防疾病。就像同类饮食一样，在过去的几年里，凯托的人气一路飙升，HalleBerry和Kardashians等明星纷纷为其代言。目前，Ahrefs 的关键词分析估计，仅在美国每个月就有大约114K 人搜索“酮类零食”。什么是Perfect Keto的价值主张？Perfect Keto有三个主要价值主张: 使Keto容易: 无需烹饪或准备的要求。 清洁成份：所有零食都是从面筋/谷物、大豆、添加糖、人造原料、填料或化学品中提取出来的。 由医生开发：我们都信任医生，对吧？谁是Perfect Keto的目标客户？Perfect Keto 的客户绝大多数是那些已经知道生酮饮食的人，他们并正在搜索像“ Keto 零食”这样的东西，这个词每个月会发送大约7000人到他们的网站。但是，如果我们查看他们的网站，他们主要发布的教育指南看起来像是针对饮食本身的营销包。这表明他们的客户更可能是keto新手而不是keto专家。Perfect Keto的主要讯息是什么？正如我们在上面的方法中所展示的，浏览一家公司的主页通常会显示他们在文字或图片中强调的内容。Perfect Keto的主页也不例外。这是主要信息如下：做Keto有正确的方法和错误的方法。 有一种健康的方法，也有一种不健康的方法。 我们是使用健康的方式。且也是唯一一家使用正确Keto的公司，我们不生产垃圾。医生的专业知识和他健康肤色的照片让我们深深体会到了这一点。Perfect Keto使用哪些营销渠道？该公司最关键的渠道是 seo 驱动的内容营销ーー他们的网站拥有丰富的资源，包括文章、播客、食谱、Keto类指南和产品指南。快速浏览他们排名的关键词，可以发现他们的内容营销策略非常依赖关键词。在目标客户可能搜索的许多关键词中，它们的排名都很高，比如“ keto 零食”和“ keto 披萨酱”Ahrefs的网站分析数据因此，他们的网站每月的搜索访问量接近20万次，其中大部分用于指南和博客帖子。Ahrefs的网站分析数据Perfect Keto还在Google，Facebook和Instagram上做广告，据网站分析估计估计，该公司每月在Google的付费流量上花费约1.8万美元。他们的广告主要针对诸如“ Perfect Keto”之类的品牌字词。在 Facebook 和 Instagram 上，他们目前正在进行类似下面这样的重定位活动，目标人群是那些在他们网站上浏览过特定产品的人。小提示. 我们知道这些是重定向广告，因为广告文案包括‘忘了什么？这是一个经典的策略，当人们把产品放进购物车却没有购买时。3. Ahrefs最后，让我们看一下Ahrefs自己的营销策略。如果你不熟悉，Ahrefs 是一个行业领先的 SEO 工具集。它有助于关键字研究，链接建设，和许多其他方面的搜索引擎优化。什么是 Ahrefs 的价值主张？首先，Ahrefs 用来驱动工具集的数据是无与伦比的。Ahrefs 爬虫是世界上第二活跃的爬虫(只有 Google 的爬虫更活跃)。每分钟，它搜索500万个网页，且拥有116亿个关键词的数据。第二个价值主张是Ahrefs的独特报告。例如，Ahrefs是唯一显示搜索量和点击数据的工具。在下面的屏幕截图中，您可以看到“便宜游戏机”的关键词分析数据。每个月的搜索量为4.5万次，但点击结果为5.6万次我们可以从中看出，人们正在围绕这个术语做大量的研究，并且可能在结束搜索之前查看不止一个页面。另一方面，我们可以看到只有27%的搜索”jake gyllenhaal height”的结果是点击。这是因为谷歌对这个查询显示的是即时的答案，几乎没有必要深入到搜索结果中去。这里有更多关于 Ahrefs 与其他搜索工具相比的信息。谁是 Ahrefs 的目标客户？搜索引擎优化专业人士，联盟营销人员，企业家，企业，博客任何人与一个网站谁想要提高他们的搜索引擎优化性能。什么是Ahrefs的主要讯息？借助Ahrefs，您不必成为SEO专业人士即可排名更高并获得更多流量。这是核心信息，甚至在首页顶部。这也体现在我们发布的内容中。例如，这篇关于搜索引擎优化预测数据的文章就是针对专业人士的。但是即使你只是刚刚开始搜索引擎优化，你也能够理解这个视频:https://www.youtube.com/watch?v=FUYAe5ROeP0致力于让 SEO 不那么令人生畏，让任何有网站的人都更容易理解。Ahrefs 使用什么营销渠道？考虑到 Ahrefs 是一个帮助你排名更高，从搜索中获得更多流量的工具集，他们的营销策略围绕搜索引擎优化展开是很有意义的。毕竟，是什么驱动了搜索引擎的流量? 独特、有趣和有用的内容。他们有三种包装内容的主要方式。首先是博客，他们写关键词为中心的内容，关于目标客户正在搜索的主题。目前，通过有机搜索，它每月的访问量约为40万次。其次是他们的 YouTube 频道，在那里他们发布有关 SEO 和市场营销相关话题的深度视频。他们目前有超过20万的订阅者和超过900万的浏览量。第三，他们的课程，比如商业博客和Ahrefs营销，帮助客户从Ahrefs的工作中获得更好的结果。他们所有内容的目标都是帮助人们解决搜索引擎优化和营销方面的常见问题—- 通常是借助于 Ahrefs。最后市场营销策略并不复杂。只要专注于你的产品或服务提供的价值，确定你的目标客户，将你的信息与他们联系起来，然后利用营销渠道有效地传播信息。最具挑战性的部分: 将你的策略付诸行动。今天你将如何推进你的营销策略？在Twitter上告诉我。译者，赵子荣，SEOZZR博客创始人 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human:",
  "headers": [
    {
      "level": "H1",
      "text": "3个你可以用来创建你自己营销策略的例子"
    },
    {
      "level": "H2",
      "text": "1. Method"
    },
    {
      "level": "H3",
      "text": "Method的价值主张是什么？"
    },
    {
      "level": "H3",
      "text": "Method的目标客户是谁？"
    },
    {
      "level": "H3",
      "text": "Method的主要讯息是什么？"
    },
    {
      "level": "H3",
      "text": "Method使用哪些营销渠道？"
    },
    {
      "level": "H2",
      "text": "2. Perfect Keto"
    },
    {
      "level": "H3",
      "text": "什么是Perfect Keto的价值主张？"
    },
    {
      "level": "H3",
      "text": "谁是Perfect Keto的目标客户？"
    },
    {
      "level": "H3",
      "text": "Perfect Keto的主要讯息是什么？"
    },
    {
      "level": "H3",
      "text": "Perfect Keto使用哪些营销渠道？"
    },
    {
      "level": "H2",
      "text": "3. Ahrefs"
    },
    {
      "level": "H3",
      "text": "什么是 Ahrefs 的价值主张？"
    },
    {
      "level": "H3",
      "text": "谁是 Ahrefs 的目标客户？"
    },
    {
      "level": "H3",
      "text": "什么是Ahrefs的主要讯息？"
    },
    {
      "level": "H3",
      "text": "Ahrefs 使用什么营销渠道？"
    },
    {
      "level": "H2",
      "text": "最后"
    }
  ],
  "author": "Marc Thomas"
}