{
  "url": "https://ahrefs.com/blog/zh/negative-seo/",
  "slug": "negative-seo",
  "title": "如何侦测（和反制）负面的 SEO 攻击",
  "description": "负面 SEO 是指竞争对手使用黑帽策略，试图破坏对手网站或网页排名的行为。",
  "content": "Michal Pecánek Ahrefs的营销专家和内容创作者。 沉迷于SEO，航空，香氛，寿司和墨西哥玉米卷。 内容 最近几个月你的自然搜索流量是否下降了，而你又不知道为什么？虽然现在不太可能，但负面的 SEO 可能是罪魁祸首。但在我们谈论侦测、对抗、和解除抗负面 SEO 之前，让我们确保我们了解它是什么…什么是负面 SEO负面 SEO 攻击有那些类型负面 SEO 攻击有用么？如何检测、避免、以及修复常见的负面 SEO 攻击什么是负面 SEO？负面 SEO 是指竞争对手使用黑帽策略，试图破坏竞争对手网站、或其网页的排名。 这种做法不仅不道德，而且有时也是非法的。负面 SEO 攻击有那些类型大规模构建低质量的外链可能是最常见和最简单的负面 SEO 类型，因为它既简单又便宜。 有很多网站出售数以千计的垃圾的外链。 下面就是一个以 1,475 美元的价格提供 6000 万个反向链接的网站：大约是 1 美元 40,000 个链接！其他常见的负面 SEO 类型包括：提交虚假链接删除请求留下虚假的负面评论黑入网站、或其他形式的网络攻击负面 SEO 攻击有用么？谷歌在 2021 年对此事的官方立场是否定的，而且多年来一直如此。谷歌搜索倡导者 John Muelle 现在基本上将负面 SEO 称为一种 “梗”：I don’t think the meme of negative SEO will ever go away. It’s tempting to assume someone else is causing issues, and, yes, sometimes people have a lot of money, time, bad ideas. Time will tell, and I’m pretty confident it’ll be fine. — 🍌 John 🍌 (@JohnMu) March 1, 2021推文译：我不认为负面 SEO 会消失。 人们通常会会认为是其他人做了什么事情。确实，有时人们有钱、有时间、还有很多坏主意。 时间会证明一切，但我非常有信心它会没事的。Google 的另一位代表 Gary Illyes 也发表了类似的声明：我查看了数百个可能受到负面 SEO 的案例，但实际上没有一个真正是因为受到负面 SEO 而产生影响的。 […] 虽然很多人会将原因归于负面 SEO ，但通常流量下降的罪魁祸首是你不知道的其他事情——可能是算法更新或网站本身的问题。Gary Illyes, 站长趋势分析师 Google但是许多 SEO 专家会告诉你，从表面上看 Google 的话并不总可信的。 所以我们认为：负面 SEO 仍然可以造成影响，但它比以前的问题要少得多。我意识到这是一个大胆的声明，所以让我来看看我们为什么会这么认为。1. 谷歌现在是打击垃圾外链而不是降权网站企鹅算法是 Google 的核心算法的一部分，目的是为了发现垃圾链接。在 2016 年之前，它是这样工作的：企鹅算法发现大量垃圾链接指向网站该网站可能会在自然搜索结果中降权（即排名和流量损失）但随后，谷歌发布了企鹅 4.0。现在，谷歌不是降权整个网站，而是打击垃圾外链（或至少尝试这样做）。以下是 Gary Illyes 解释降权和打击之间的区别： Demoting as in adjust the rank of a site. Devalue as in “oh look, some crap coming towards this site. Let’s make sure it won’t affect its ranking.译：降权就是降低网站等级。打击垃圾外链类似发现了一些没有用的链接，然后谷歌会确保它不会影响网站的排名。简而言之，Google 会尝试识别并忽略低质量的链接，以免它们影响你的排名。这就是为什么我们的免费的 backlink checker（外链检查）工具每月可以获得大约 133,000 次自然访问的原因……尽管有人 “友好地” 给这个页面建立了超过一百万个垃圾链接：谷歌显然在无视这种公然的负面 SEO 攻击方面做得非常出色。2. 企鹅 4.0 “更细化”企鹅算法过去常常会因为发现大量垃圾外链而降权整个站点。因此，之前如果你在一个页面上遇到负面 SEO 攻击，企鹅算法会惩罚你的整个网站，并且排名会全面下降。但从企鹅 4.0 开始，事情并不总是这样。这是谷歌在他们的官方公告中所说的： 企鹅算法现在更加细化了。 企鹅算法现在根据垃圾链接信号调整排名来降低垃圾外链的价值，而不是影响整个网站的排名。不理解？这里是谷歌的解释：这意味着它会衡量更细微的要素，不仅仅是页面。你好 站长，我们客户的网站 X 在你的页面 Y 上有链接。由于最近 Google 的算法发生了变化，我们不再需要这些链接并要求你将其删除。谢谢，某个 SEO 公司 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Michal Pecánek Ahrefs的营销专家和内容创作者。 沉迷于SEO，航空，香氛，寿司和墨西哥玉米卷。",
  "headers": [
    {
      "level": "H1",
      "text": "如何侦测 (和反制) 负面的 SEO 攻击"
    },
    {
      "level": "H2",
      "text": "什么是负面 SEO？"
    },
    {
      "level": "H2",
      "text": "负面 SEO 攻击有那些类型"
    },
    {
      "level": "H2",
      "text": "负面 SEO 攻击有用么？"
    },
    {
      "level": "H3",
      "text": "1. 谷歌现在是打击垃圾外链而不是降权网站"
    },
    {
      "level": "H3",
      "text": "2. 企鹅 4.0 “更细化”"
    }
  ],
  "author": "Michal Pecánek"
}