{
  "url": "https://ahrefs.com/blog/zh/off-page-seo/",
  "slug": "off-page-seo",
  "title": "什么是站外 SEO？它为什么重要？",
  "description": "站外 SEO 指任何在站外开展的旨在提高网站在搜索引擎中排名的各项工作。但是除了外链建设外，站外 SEO 还包括哪些内容呢？",
  "content": "Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。 内容 为内容倾注了心血，Google 排名却一直举步维艰？你的站外搜索引擎优化（以下简称 站外 SEO）工作（或者缺乏这项工作）可能是罪魁祸首。SEO 工作可以分成两个板块：站内 SEO 和站外 SEO。许多人将站外 SEO 与外链建设等量齐观，但事实真的是这样吗？在这篇文章中，我们将讨论：什么是站外 SEO站外 SEO 与站内 SEO 的区别是什么站外 SEO 为什么重要？与链接相关的站外因素与链接无关的站外因素什么是站外 SEO？任何在网站外开展的旨在提高其搜索引擎排名的工作都属于站外 SEO。外链建设是站外 SEO 的大头，但后者远远不止如此。站内SEO vs.站外 SEO站内 SEO 是你可以完全控制的，但站外 SEO 并不总是这样。例如，如果我接触某人，要求对方提供指向我的链接，这就是站外 SEO。为什么呢？因为在这个过程中我没有对网站做任何改动。相反，如果我通过优化图片来改善网站的加载速度，这便是站内 SEO 了，因为这些改动直接发生在了网站上。如果你搞不清楚 SEO 策略应该归入哪个板块，可以先问问自己（这项策略）是否完全在自己的掌控之中。如果答案是否定的，那么很可能这是一项站外 SEO 策略。小提示. 有一些站外的因素你是可以完全控制的（比如：Google 我的商家）。 站外 SEO 为什么重要？在决定是否给网页排名以及他们的排名位置时，Google 会将许多站外因素考虑在内。外链是其中一个因素，但是还有许多其他因素。因此，仅靠内容的品质来获取排名是很有挑战性的。这里有一个很好的例子来证明这一点：撰写此文时，《泰晤士报》（The Times）的这一页面之于“最适合居住的地方”（“best places to live”）这个关键词在英国 Google 排名第一。乍看之下，这似乎是一个完全有价值的内容。基于这个原因，（Google）认为它的排名应该靠前并不疯狂。然而，只要你点击其中任何一个地方，就会触碰到内容壁垒（content gate）。因此，这个页面对于它的访客来说没有任何真正的价值，它当然也就不值得排在榜首。更值得排在榜首的这个页面，它展示了 1,000 个人关于“最适合居住的地方”这一话题的调研结果。回到站外 SEO 的讨论，前者排名超越后者的原因可能并不是它的内容更好，而很可能是由站外因素所致。与外链相关的站外因素外链可能是站外 SEO 最关键的部分。为什么？因为 Google 搜索的基石是一项名为“佩奇排名”的算法，它关注指向某一网页外链的数量和质量。一些 SEO 专业人士认为“佩奇排名”是一个过时的概念，但是直到去年，Google 还确认了它依然是一项排名因素。DYK that after 18 years we’re still using PageRank (and 100s of other signals) in ranking?Wanna know how it works?https://t.co/CfOlxGauGF pic.twitter.com/3YJeNbXLml— Gary “鯨理／경리” Illyes (@methode) February 9, 2017这可能也是为什么我们可以看到某个网站的指入域名（独立网站）与其排名的清晰关联。……这将我们引向与链接相关的站外因素的讨论：1. 指入域名的数量拥有更多来自独立网站的链接（指入域名）不仅意味着更高的排名，还意味着更多的自然搜索流量。小提示. 这是一项关联性研究。它并不能证明因果关系。查看网站的外链数量，只需要将网址粘贴进 Ahrefs 的网站分析板块或者我们免费的外链检查工具中。ahrefs.com 的外链和指入域名一览，来自 Ahrefs 的网站分析报告。你可以看到 ahrefs.com 拥有来自 3.12 万个指入域名的 411 万个外链。然而，目的并不是为网站整体建设更多的外链，而是将外链直接引向那些你希望在搜索引擎提高排名的页面。我们有大量关于外链建设的文章和视频。如下。https://www.youtube.com/watch?v=Ovu2ZYWgOJQ&list=PLvJ_dXFSpd2tjUTuAHpHidz5e2hAedP_m延伸阅读9 种（任何人都能使用的）简易外链建设策略如何执行摩天楼（Skyscraper）策略并取得结果（中文）如何获取外链：无需创作新内容的 7 种策略资源页面外链建设：您需要的唯一指南失效外链建设简易（完整）指南7 种实操方法撸得竞争对手外链2. 链接权威度链接生而不平等。质量很重要。这是“佩奇排名”算法的工作方式。指入页面的“权威度”（“authority”）越高，它向被指页面传递的权威度就越多。换句话说，来自高权威度页面的链接比低权威度页面的链接更有价值。问题来了，如何判断一个网页的“权威度”呢？过去 Google 会公开“佩奇排名”得分，但是 2016 年开始就停止了。虽然没有“佩奇排名”的官方替代品，但是有一些类似的指标，其中之一是 Ahrefs 的网址评分（URL Rating, UR）。网址评分展示了目标链接的外链强度，评分范围为 0 到 100。查看任一网页的网址评分，可以将这一网站粘贴进 Ahrefs 的网站分析工具。你还能在“外链”报告中查看所有指入网页的网址评分。这有助于在调研外链机会的时候评定某一页面的质量和权威度。所有指向我们精选摘要研究报告的外链的评分，来自 Ahrefs 网站分析板块的“外链”报告。另外，我们对 1,400 万个网页的研究展示了网址评分与自然搜索流量的密切关联。3. “Dofollow” vs. nofollowGoogle 不会通过 nofollow 链接（即：带有 rel=”nofollow” 标签的链接）传递“佩奇排名”得分，因此，优先建设 dofollow 链接是值得的。因特网上的大部分链接是 dofollow 的，但一些网站（如 Forbes）几乎给所有出站链接加上了“nofollow”标签。因此，如果你正在某个特定网站积极为目标网站建设外链，应该确认一下出站链接是 dofollow 的。在 Chrome 安装这个 NoFollow 扩展，可能高亮显示页面中的 nofollow 链接。在 Ahrefs 网站分析板块的许多报告中，你可以将“dofollow”链接过滤出来。同样，这在调研和确认外链机会优先级的时候会非常有用。在 Ahrefs 网站分析板块的“外链”报告中过滤出“Dofollow”链接。当然，nofollow 链接还是有一定价值的。他们可以为网站带来引介流量，这对 SEO 有间接积极的作用。但是如果你正在为外链建设付出大量的时间和精力，就有必要分出工作的优先级了。4. 锚文本锚文本指的是由某一网页指向另一网页的链接上的可点击文字。在“佩奇排名”的原始专利中，Google 提到：Google 采用了包括网页排名、锚文本和邻近信息在内的一系列技术来改善排名质量。换句话说，带有与网页整体话题相关锚文本文字的外链对排名有一定影响。我们对此进行了研究，发现了精确匹配、词组匹配和部分匹配的锚文本与排名之间的关联，尽管这种关联性很小。不幸的是，如果你通过白帽方式建设外链，你不会对外链的锚文本内容有太多控制（客座博客除外）。但即使你能控制指入链接的锚文本，可能也不尽然是件好事。如今作为 Google 核心算法一部分的企鹅（Penguin）算法，会对外链建设时密集使用关键词以操纵排名的尝试进行惩罚。幸运的是，大多数人提供外链的方式都是自然且相关的。如果你的文章是关于话题 x 的，那么人们使用与 x 相关的文字作为链接锚文本内容的机率是很高的。5. 相关性外链实际上是一种投票。如果某个网站链向你，他们是在为你的内容或者业务背书。但是链接并不生而平等。链接网站和网页内容的相关性也很重要。让我用一个类比解释来说明。假设你正在为你的婚礼物色餐饮公司。你的两个朋友推荐了两个不同的公司。这两个朋友你都喜欢，但是他们一个是会计，一个是厨师。你会相信哪一个呢？想都不用想——是厨师。线上的情况也差不多。如果你是一个餐饮公司，获得了一个来自美食博客的外链，那么它所携带的权重势必高于来自财务博客的链接。但是，相关性比“权威度”重要吗？为了回答这个问题，我们询问了若干 SEO 专业人士一个简单的问题：在其他条件相同的情况下，你是愿意获得一个与话题相关性低的高权威链接，还是一个与话题相关性高的低权威链接？以下是他们的回答：比起权威度，我更偏爱相关性，但是我的答案取决于具体的目标。如果目标是快速提高排名，我可能会选择高权威度/低相关性；如果目标是持续的排名/流量/转化，我会选择低权威度/高相关性。Julie Joyce, 创始人 Link Fish Media我反复思考这个问题，我认为语境（即：该领域的竞争程度、网站的权威度等）很重要。也就是说，大多数时候我会选择权威链接。特别是当你身处竞争激烈的市场的时候，在没有高权威度的情况下（不管其他链接的相关性有多强），要提高排名是很困难的。我会通过优化关键词、站内链接等方式来弥补相关性方面的问题。Paul May, 联合创始人 Buzzstream如果客户想要提高某个可变现页面的排名，我发现域名评级较高的链接（即使主题相关性不是特别强）的作用更明显。也就是说，在流量均等、目标都是取得引介流量和转化的情况下，我会倾向于选择权威度较低且话题相关度较高的外链。Robbie Richards, 创始人 RobbieRichards.com我倾向于选择竞争对手较难获得的外链。如若高权威度、低话题相关性的链接来自于报纸或杂志（网站）的某篇文章，那么我会接受它。这些地方的链接包含编辑的决定，而我相信记者和编辑们的判断。他们之所以会加上链接，是因为他们认为这将为读者提供价值，我对此很有信心。话虽如此，我不会在网站发布无关的内容，希望获得来自新闻媒体的高权威度链接。这可能会奏效一两次，但最终记者们会开始问：“为什么这个这个品牌要发布无关内容？”简而言之，获得低权威度高话题相关性的链接相对容易，因此我会选择高权威度的链接。Gisele Navarro, 运营总监 NeoMam Studios6. 流量我们研究了 44,589 个非品牌关键词排名前 10 的结果，发现了这些高排名网页与其引介页面自然搜索流量总和之间的清晰关联。这表明，自然搜索流量较大的网页提供的外链的权重高于自然搜索流量较小的页面提供的外链。你可以在 Ahrefs 的网站分析报告中查看任何一个网页的自然搜索流量估值。我们的精选摘要研究一文的月度自然搜索流量估值，数据来自 Ahrefs 网站分析报告。你还可以在“外链”报告中查看引介页面的自然搜索流量。精选摘要研究一文所有引介页面的自然搜索流量估值，数据来自 Ahrefs 网站分析的“外链”报告。如果你想复制竞争对手的外链，或者使用像摩天楼技术这样的外链建设策略，你可以快速地将报告按自然搜索流量排序，优先获取高价值页面的链接。然而，尽管对流量页面的优先级排序是有意义的，没有证据表明流量较少或者没有流量的引介链接就毫无价值。如果引介页面是相关的，并且有一定的“权威度”，那么你绝对应该去追寻这些页面的外链。为什么链接依然是排名因素考虑到“佩奇排名”已经有 20 年历史了，你可能想知道为什么到了 2019 年外链依然是一个关键的排名因素。原因很简单：外链依然是最难操纵的因素之一。虽然存在一些获得外链的不正当该当（如：购买外链），要获得高质量的外链依然是相当困难的。人们通常不愿意链向内容，除非这么做能为访客提供价值。与链接无关的站外因素站外 SEO 指在网站之外开展的且对搜索引擎排名有潜在影响的活动。外链建设是最明显的例子之一，除此之外还有其他的站外影响因素。如果你是一个本地商户，希望可以提高本地排名，那么你应该特别注意这个章节，因此下列许多因素与本地 SEO 有关。这些因素用星号（*）作了标记。1. NAP 引用*NAP 引用是你业务的在线提及，同时还会展示你的公司名称、地址和电话号码，统称为 NAP [名称（Name），地址（Address），电话（Phone）]。英国一间酒吧的 NAP 引用根据 Moz 的研究，引用信号是本地站外排名因素中最重要的之一。这意味着如果你是一个本地商户，想要在本地获得排名——无论是在 Google 的“零食包”（“snack pack”）还是常规搜索引擎结果，本地引用都至关重要。通过在 Google 中搜索以下内容，你可以找出已经拥有的本地引用：如果你对竞争对手进行同样的操作，接着交叉索引出现在结果中的网站，就可以很轻易地找到更多可以建设引用的网站。但是，这里会有一点麻烦，而且就排名而言，要判断出哪些引用的作用更大是比较棘手的。一种解决办法是使用专用的工具（如：Whitespark）来找到引用。你还可以使用像 Ahrefs 交集外链分析这样的工具，使用它可以找到引用了多个竞争对手、却（尚）未引用你的网站。因为许多 NAP 引用同时包含链接，尽管这些链接是 nofollow 的。通过这种方法可能找到你的竞争对手有，而你没有的本地索引。将若干竞争对手（的域名）粘贴进工具的第一部分，然后将你的域名为粘贴到工具底部。点击箭头可以查看每个外链的更多细节。找出那些可能来自引用的链接。提示还有很重要的一点是不同引用的 NAP 信息应该尽可能一致，这样 Google 就可以把这些引用联系在一起作为你业务在线档案的一部分。查看我们的本地 SEO 指南，了解更多关于 NAP 引用的信息。2. 品牌提及品牌提及可以是带链接的，也可以是不带链接的。带链接的提及很显然具备 SEO 价值，但是不带链接的提及呢？示例：一个不带链接的 Ahrefs 提及。Google 在其一项专利中间接讨论了不带链接的品牌提及，引用了一个可以有效统计显性链接（带链接的提及）和隐性链接（不带链接的提及）的系统。以下是该专利的一段摘录： 显性链接，如超链接，是处于源头资源中的可被用户点击后去到目标资源的链接。隐性链接是对目标资源的一种引用，它处于源头资源中，却不像显性链接那样直接指向目标资源。这里，Google 实际上是在说，“嘿，我们知道人们在引用品牌和内容的时候不带链接，我们认为这样的提及值得和带有链接的提及一样纳入我们的算法（作为考察的因素）。”这在逻辑上说得通。带链接和不带链接的提及的唯一区别是带链接的提及是可点击的，可以带来引介流量。于是，如果品牌提及是一种站外排名因素，你要如何获取他们呢？这里有几种方式：创作客座博文以嘉宾身份参加播客主动与博主联系你还可以使用 Google 快讯（Google Alerts）或者 Ahrefs 提醒这样的工具来追踪竞争对手新增的品牌提及，并适时参与会话讨论。假设你是 MailChimp 的一员，那么可以设置品牌提及来追踪像ConvertKit 和 ActiveCampaign 这样的竞争对手。在 Ahrefs 提醒中为同时提及 ConvertKit 和 ActiveCampaign，但是没有提及 MailChimp 的新网页设置提醒。带链接的提及 > 不带链接的提及Google 可能确实能为不带链接的提及赋予一些价值，但是带链接的提及更可取——哪怕只是为了（获得）引介流量。出于这个原因，经常有必要联系那些提及了你的品牌却未加入链接的人们，要求他们“给提及加上链接”。查看我们将不带链接的提及转化为链接的指南以了解如何实现（这一目的）。3. Google 我的商家*（Google My Business）Google 我的商家（Googe My Business, GMB）是来自的 Google 的免费业务档案。这些档案会出现在 Google 的“零食包”中，你可以在带有本地搜索意图的结果页面顶部找到该版位。示例：Google 搜索结果页面中的本地“零食包”结果（Google 我的商家列表）。然而，仅仅是声明 GMB 档案是不够的。Moz 发现优化后的 Google 我的商家档案是“零食包”中排名的最重要因素，同时也是常规自然搜索排名中第四重要的因素。长话短说，如果你想在带有本地意图的关键词（如：我附近的水管工）查询中获得排名，那么宣布和优化 GMB 档案是站外 SEO 获得成功的最关键因素。查看这份完整攻略，了解如何优化你的 Google 我的商户档案。4. 评论*Moz 发现评论信号是在 Google “零食包”结果中提高排名的第三重要的因素，同时也是本地自然搜索排名第五重要的因素。一般来说，你在 Google 我的商户和可信的第三方平台上获得的正面及真实的评论越多，你（的网站）在“零食包”中的排名就升得越快。注意负面的评论可能带来相反的结果。该研究还发现“评论所在的第三方平台的权威度”也会影响常规的本地自然排名。了解如何获得更多的 Google 评论.5. 社交分享Google 的官方立场是社媒信号不是直接排名因素。https://www.youtube.com/watch?v=udqtSM-6QbQ但是有人不相信这一点，可能是因为像这样过时的研究展示了排名和社交分享之间的某种关联。那么，谁是对的呢？我们的结论：可能是 Google。主要原因是操纵社交信号比较简单。你可以从 Fiverr 这样的网站上花几美金购买到数千个社交分享。一般来说，如此简单就能操纵的东西不会成为可靠的排名因素。话虽如此，真实的社交分享对排名是有积极影响——虽然是以间接方式。为什么呢？因为真实的社交分享会吸引更多的眼球到你内容上，而更多的眼球会带来更多的链接、提及以及所有我们已知的会对排名产生直接作用的站外 SEO 因素。结语因为许多站外因素不完全在你的控制之下，所以站外 SEO 似乎比站内 SEO 困难，但这就是问题的关键。越难取得的东西，就越能可靠地作为排名因素。值得注意的是，传统的线上和线下营销活动也能间接影响上述许多因素。例如，2018 年特斯拉将一台跑车发射进了太空，网上发表的关于特斯拉的文章数量就出现了激增。2018 年 2 月网上发布的提及 “Tesla”（“特斯拉”）和 “starman”（“星侠”）的文章数量，数据来自 Ahrefs 的内容分析报告。这里面许多站点在他们的文章中包含了指向 tesla.com 的链接。虽然对大多数公司来说，将汽车发射进太空并不像是可行的营销噱头，但并不是一定要这样做。你可能不需要数以千计的链接或者品牌提及来提高排名，因此小型的线下营销活动对小型企业很有效。如果这篇文章对你有所帮助，请在评论区或者 Twitter 上告诉我。译者，Alex Wang，Not Soup Yet 创始人 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。",
  "headers": [
    {
      "level": "H1",
      "text": "什么是站外 SEO？它为什么重要？"
    },
    {
      "level": "H2",
      "text": "什么是站外 SEO？"
    },
    {
      "level": "H2",
      "text": "站内SEO vs.站外 SEO"
    },
    {
      "level": "H2",
      "text": "站外 SEO 为什么重要？"
    },
    {
      "level": "H2",
      "text": "与外链相关的站外因素"
    },
    {
      "level": "H3",
      "text": "1. 指入域名的数量"
    },
    {
      "level": "H3",
      "text": "2. 链接权威度"
    },
    {
      "level": "H3",
      "text": "3. “Dofollow” vs. nofollow"
    },
    {
      "level": "H3",
      "text": "4. 锚文本"
    },
    {
      "level": "H3",
      "text": "5. 相关性"
    },
    {
      "level": "H3",
      "text": "6. 流量"
    },
    {
      "level": "H2",
      "text": "与链接无关的站外因素"
    },
    {
      "level": "H3",
      "text": "1. NAP 引用*"
    },
    {
      "level": "H3",
      "text": "2. 品牌提及"
    },
    {
      "level": "H3",
      "text": "3. Google 我的商家*（Google My Business）"
    },
    {
      "level": "H3",
      "text": "4. 评论*"
    },
    {
      "level": "H3",
      "text": "5. 社交分享"
    },
    {
      "level": "H2",
      "text": "结语"
    }
  ],
  "author": "Joshua Hardwick"
}