{
  "url": "https://ahrefs.com/blog/zh/on-page-vs-off-page-seo/",
  "slug": "on-page-vs-off-page-seo",
  "title": "页面上与页面外 SEO：不同但同样重要",
  "description": "前者专注于影响页面上的 SEO 因素，后者专注于页面外的 SEO 因素。剧透一下：两者你都需要。",
  "content": "Mateusz Makosiewicz Ahrefs 的营销研究员和教育家。 Mateusz 在推广代理、SaaS 和硬件业务领域拥有超过 10 年的营销经验。平时喜欢创作音乐或享受长距离的散步。 内容 站内 SEO 和站外 SEO 之间的区别在于它们针对两组不同的 SEO 因素，第一个侧重于页面上的 SEO 因素，而后者侧重于页面之外的 SEO 因素。继续阅读以了解网站更需要哪一个。什么是页面 SEO？什么是站外 SEO？为什么页内 SEO 和页外 SEO 很重要？哪些因素会影响页面 SEO？哪些因素会影响站外 SEO？什么是页面 SEO？页面 SEO（也称为 on-site SEO）是优化网页以获得更高排名的做法，它包括对可见内容和 HTML 源代码的优化。示例策略——寻找相关的子主题如果页面难以进入前 10 名，原因可能是它缺少搜索者正在寻找的信息。要确定是否为这种情况，需要将排名好的页面涵盖主题与你涵盖的主题进行比较。可以使用 Ahrefs 的内容差距机会工具（Content Gap）执行此过程，该工具可以显示目标页面有排名但你没有的关键字。第 1 步：插入要比较的页面 URL，然后点击 “Show keywords“。”第 2 步：找到你的内容缺少的主题。在我们的示例中，可以定义成访客博客和访客帖子。什么是站外 SEO？站外 SEO 体现了在网站之外用以提高其搜索排名所做的任何努力。示例策略 — 寻找链接建设机会反向链接是最重要的排名因素之一（稍后会详细介绍），可以很自然地获得它们，也可以“构建”它们。链接建设策略有许多种，其中一种是在竞争对手中寻找链接模式，以便从同一网站获取链接，为此你将需要一个反向链接检查工具。由于来自新网站的链接可能对排名的影响最大（即尚未有链接到你的网站），因此查看链接模式的最佳方法是找到链接到竞争对手但不链接到你的网站，可以使用 Ahrefs 的交集外链分析(Link Intersect）工具轻松做到这一点。步骤 1. 插入要比较的 URL。步骤 2. 浏览结果中的域，点击包含指向竞争对手链接页面的反向链接数量。为什么页内 SEO 和页外 SEO 很重要？页面内 SEO 和页面外 SEO 基本上是一枚硬币的两面，使用这两种方法实践时 SEO 最有效，因为 Google 同时使用页面上和页面之外的排名因素。根据需求，你有时可以更多地关注其中一种 SEO 类型，但你不应该一直只关注其中一个。哪些因素会影响页面 SEO？在本节中，我将介绍一些应该注意的最重要的事情，以便在 SERP（搜索引擎结果页面）上排名更高并吸引更多点击。注意：我将讨论已知的排名因素、提高 SERP 能见度并因此吸引更多访问的因素。有关页面 SEO 的更多信息，请参阅页面 SEO：初学者指南。搜索意图搜索意图是指搜索背后的原因，这是最明显的排名因素之一。在 SEO 中使用搜索意图是为了发现搜索者在搜索查询时想要得到什么，并提供该信息。搜索意图可以说是 SEO 最重要的因素，毕竟为搜索者提供相关且有用的信息是搜索引擎每一秒都需要做的事情。在匹配搜索意图的前后，访问我们的自然流量观测页面。针对搜索意图优化内容，将其归结为查看特定查询的搜索结果页面，并确定搜索意图的三个 C： 内容类型 – 是什么内容类型占据主导地位？是博客文章、产品页面、视频，还是其他内容？ 内容格式 – 一些常见的格式包括如何使用指南、列表帖子、评论、比较等。 内容切入角度 – 内容作品的独特卖点，例如，“最好的”、“最便宜的”、“适合初学者”。 一旦你确定了搜索意图的三个C，你应该对谷歌为特定的搜索查询向其用户 “推荐 “的内容类型有一个相当好的想法。推荐阅读：搜索意图： 一个十分重要又经常被忽略的“排名要素” 内容质量搜索意图是至关重要的，但利用它并不足以创造 “有用和引人注目的内容”，你还需要照顾到内容的质量，以下是谷歌关于它在内容中寻找什么的说法。似乎谷歌的目标是在其算法中嵌入读者重视内容的相同属性，根据谷歌的说法，内容要是：易于阅读。清晰的组织。新鲜。独特。与 E‑A-T 准则相一致。专注于提供基本信息以解决搜索者的问题。但在实践中，你还需要创造比竞争对手更好的内，我们有一个完整的视频，解释如何增加实现这一目标的机会。https://www.youtube.com/watch?v=n5KKbPS6N‑gURLsURLs 是一个小的排名因素，它们在网站排名中的权重很小，以至于谷歌的 John Mueller 说它们在 SEO 中被高估了，人们不应该担心它们。然而，谷歌的 SEO 指南提到 URLs 是你应该优化的东西，但你应该为用户优化而不是为谷歌做这件事。这是因为用户在地址栏和 SERP 上都能看到 URL，而根据这些信息，用户 a 可以选择点击特定结果，而用户 b 知道他们在网站上的位置。所以基本上，这就是一个不友好的 URL 的样子。http://example.com/folder1/dir1/dir2/dir3/dir422447478/x2/14032015.html正如你所看到的，这个例子的网站没有使用 HTTPS；同时，URL 有一个过度的嵌套结构，并没有真正表明页面的内容。而这是对其用户友好的替代方案。https://example.com/seo/ranking-factors.html要了解更多关于 URLs 在 SEO 中的使用，请查看我们的指南：如何创建对搜索引擎友好的 URL（分步骤）。网页标题 网页标题是另一个小的排名因素，谷歌使用它们来了解你的页面是关于什么，以更好地匹配特定搜索查询背后的意图。这个标题很有吸引力，同时也具备描述性的。你同不同意呢？自然地，搜索使用页面标题也是出于类似的原因：了解他们可以从一个页面中期待什么。因此，为了 “满足 “双方，你可以考虑这些良好的做法。 让标题醒目而准确 – 写一句话引起用户的兴趣，并准确描述你的价值及独特之处。 在标题中插入目标关键词 — 但记得让它看起来自然。 调整在60个字符之内 — 否则你的描述可能会被截断，而且会增加谷歌重写标题的机会。推荐阅读：如何制作完美的 SEO 标题标签（我们的 4 步流程）元描述元描述不是一个排名因素，但它们确实出现在 SERP 上（就在页面标题的下面），所以它们可以影响点击率（CTR）。对于这样一个可识别的产品，这可能是最合理的元描述。苹果只是强调其最新一代产品的变化，而不是MacBook Air是什么。因此，优化元描述的方法是只关注搜索者，这里有一些好的 SEO 做法很重要：使描述足够有说服力来吸引点击，只要不是点击诱饵（你的声誉很重要）。不要让描述的长度超过 920px（试试 SERPSim）。保持描述与页面的标题相关（反之亦然）为每个页面使用一个独特的描述 推荐阅读: 如何高效编写完美的元描述？ 向外链接向外链接是指指向不在你网站上页面的链接。你可以用 Ahrefs SEO 工具栏查看任何页面的外部（向外）链接。向外链接很可能不是一个排名信号，这意味着你不应该试图在你的内容中塞进向外链接，并希望获得更高的排名。你可能想做的是使用向外链接来引用你的来源，这将有助于建立你的内容的合法性、透明度和准确性。换句话说，通过引用你的来源，你将与 E‑A-T 搜索质量指南保持一致。Schema标记Schema 标记是一种代码，可以帮助搜索引擎理解你的内容，并在搜索结果中更好地表现它。HubSpot 使用 schema 标记来显示 SERP上 的常见问题。Schema 标记不是一个排名因素，但应用它可以帮助你的内容在 SERP 中脱颖而出。Schema 标记看起来像编程，但它的学习曲线远没有那么困难。在一个页面上添加 Schema 标记与填写元标签相类似，可以使用像 Schema Builder 扩展插件这样的工具来帮助你完成。推荐阅读：什么是Schema Markup (结构标记)? 它对SEO有什么用内部链接 内部链接是指来自同一网站上另一个页面的链接。内部链接是一个排名因素，谷歌以多种方式利用内部链接。 发现新页面 — 内部链接提供了一条通往目标网页的爬行路径。 在你的页面之间传递链接權重 — 内部链接可以促进你拥有的其他页面。 了解一个页面的内容 — 了解你的页面的内容有助于谷歌对其进行排名。这就是为什么内部链接的锚文本也很重要。而且，我们不要忘记内部链接帮助用户发现内容和浏览你的网站。基于上述所有原因，你不应该忽视内部链接。如果你在创建新内容时添加内部链接，甚至通过内容中心对其进行战略性规划，那是最好。请记住，为你现有的内容添加内部链接永远不会太晚。你可以使用 Ahrefs 站长工具免费检查你网站的内部链接机会。推荐阅读： 你为什么要优先考虑优化你的内部链接（实操） 页面用户体验一个网站的用户体验（UX）对不同的人来说可能意味着不同的事情。对用户体验设计师来说，它意味着一个网站的整体印象。但在 SEO 中，一个页面或网站的用户体验尤其是可用性上，它基本上意味着保持一个无杂乱、无干扰、易于使用的用户界面。通常情况下，用户体验的改善应适用于整个网站，而不仅仅是网页。然而，如果你想保留具有独特布局的网页，请记住不同的设计意​​味着不同的体验。因此，这里需要注意的是。 避免干扰性的弹出式窗口 — 这些包括注册表格、退出表格等，对任何改变布局的横幅广告也要这样避免（参考谷歌关于插播广告的指南）。 确保你的重要页面不迟缓 — 你应该为核心页面指标（CWVs）进行优化。 确保你的网站布局清晰、一致、可用 — 尽量不要让用户的认知能力超出负荷。 为移动设备优化你的网站 — 来自移动设备的网站流量占比略高于 50%。在此基础上，谷歌根据网站的移动版本对内容进行索引和排名（移动优先索引）。用户体验是一个排名因素吗？在这里，似乎有两个因素可以影响你的排名，核心网页要素和移动友好性。当页面有类似的内容时，谷歌可以使用页面体验信号来进行排名，但这些不会是剧烈的排名变化，没有针对移动端进行优化的页面或缓慢的页面仍然可以排名。推荐阅读： 页面体验的排名因素实际上是如何工作的？ 哪些因素会影响站外 SEO？与网页搜索引擎优化一样，我将谈论那些已知且直接影响排名的因素，以及那些不影响排名但能为你带来更多知名度和自然点击的因素。关于页外SEO的详细指南，请参见什么是页外 SEO？以及为什么它很重要。反向链接反向链接是谷歌 PageRank 的基础，这是一个数学公式，通过查看链接到该页面的其他页面的数量和质量来判断 “一个页面的价值”。与搜索意图一样，反向链接是最关键的排名因素之一。一般来说，一个页面的反向链接（来自独特的网站）越多，它在 SERP 上超过其竞争对手的机会就越大。而且，一个页面的反向链接越多，登陆该页面的自然搜索流量就越多。但不是所有的反向链接都会对你的排名产生同样的影响，你可以通过这六个特征来判断一个反向链接。 权威性：如果我们把链接看作是选票，那么拥有更多选票的网页将会向其他网页传递更强的投票。 相关性：谷歌是这样说的：“如果该主题的其他知名网站链接到该页面，这是一个很好的迹象，表明该信息是高质量的。” 锚文本：与内部链接一样，反向链接的锚文本有助于谷歌了解目标页面的背景。 位置：有更高机会被点击的链接（例如内容中的链接，放在页面较高位置的链接）可能会传递更多的权重。 目的地：链接可以提高它们所链接特定页面的排名，但你可以通过内部链接将部分链接权重传递给其他页面。延伸阅读谷歌 PageRank 并未消亡：为何它仍然很重要 链接仍然对排名有影响吗？Ahrefs的一项研究 9个简单的链接建设策略（任何人都可以使用）NAP 引用NAP（名称、地址、电话）引用是在网上提到你的企业，并显示你的企业名称、地址和电话号码。在本地化的自然搜索结果中，NAP 引用可能是计入排名的因素之一（在这里和这里了解更多），然而，它们可能并不具有很大的权重。除了有可能帮助你在 SERP 上排名外，NAP 引用肯定会帮助用户找到你的本地业务。因此，这里有一个你可以遵循的优良快速清单。 在大数据聚合器中列出：例如 Foursquare，那是许多本地数据供应商获取数据的地方。 提交给大型参与者：像是 apple 的地图，Yelp，Bing Places，Facebook，等等。提交给当地和行业等其他流行目录。 保持引文一致：你应该使它们与指南保持一致（比如谷歌的这个指南）。延伸阅读 如何建立本地引用（完整指南） 谷歌是否将 BBB 评级作为一个排名因素？ — Marie HaynesGoogle 商家档案(以前的 Google 我的商家)谷歌商家档案（GBP）是否是一个排名因素，这并不是正确的问题，GBP 只是在谷歌地图包中获得特色的要求。顺便说一下，地图包显示的是与你的搜索查询相关的区域（或基于你位置）附近的 GBP，位于地图包下面的搜索结果被称为本地化的自然结果。地图包显示山景城的兽医的 GBP。GBP 是否会影响在地图包下面发现的结果排名？大多数SEO专家表示：“不”。但总的来说，如果你的业务在当地经营，你肯定会想得到一个GBP。它允许 Google 在地图包中显示你的业务，使客户更容易找到你并取得联系。除此之外，GBP 还有助于从客户那里获得评论，以下是我们清单上的下一个问题。推荐阅读： 如何在 30 分钟内优化你的 Google 我的商家列表 评论（和评级）让我们来看看影响地图包的另一个因素：客户评论。这可能是解释这个问题的最准确方式，客户评论是影响地图包中结果顺序的排名因素之一，但它们对本地化的自然排名结果可能没有什么重要性。Google 是否考虑到了客户对企业的每一条反馈？这很难说，在这里，你最好的选择是特别注意你的 GBP 和可信的第三方网站（G2、Capterra、Yelp 等）上的评论。正如在生活中一样，正面的评论将产生正面的影响，而负面的评论将对排名产生负面影响。我们不要忘记，排名和评价在 SERP 上是清晰可见的，肯定会给搜索者留下印象。小提示.你可以在你的模式中添加评级标记，以便谷歌可能（也可能没有，由搜索引擎决定）在自然搜索结果中显示它。最后的想法页面上 SEO 和页面外 SEO 似乎已经有很多东西需要接受了，但这并不是 SEO 的全部内容。你可能会遇到 SEO 的其他类型或子学科，如技术 SEO、本地 SEO、多语言 SEO 等。如何不迷失在这一切中？试试我们的 SEO 初学者指南或我们心爱的 YouTube 频道。有任何问题吗？请在 Twitter 上给我发消息。译者，李元魁，SEO 分解茶博客创始人 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Mateusz Makosiewicz Ahrefs 的营销研究员和教育家。 Mateusz 在推广代理、SaaS 和硬件业务领域拥有超过 10 年的营销经验。平时喜欢创作音乐或享受长距离的散步。",
  "headers": [
    {
      "level": "H1",
      "text": "页面上与页面外SEO：不同但同样重要"
    },
    {
      "level": "H2",
      "text": "什么是页面 SEO？"
    },
    {
      "level": "H3",
      "text": "示例策略——寻找相关的子主题"
    },
    {
      "level": "H2",
      "text": "什么是站外 SEO？"
    },
    {
      "level": "H3",
      "text": "示例策略 — 寻找链接建设机会"
    },
    {
      "level": "H2",
      "text": "为什么页内 SEO 和页外 SEO 很重要？"
    },
    {
      "level": "H2",
      "text": "哪些因素会影响页面 SEO？"
    },
    {
      "level": "H3",
      "text": "搜索意图"
    },
    {
      "level": "H3",
      "text": "内容质量"
    },
    {
      "level": "H3",
      "text": "URLs"
    },
    {
      "level": "H3",
      "text": "网页标题"
    },
    {
      "level": "H3",
      "text": "元描述"
    },
    {
      "level": "H3",
      "text": "向外链接"
    },
    {
      "level": "H3",
      "text": "Schema标记"
    },
    {
      "level": "H3",
      "text": "内部链接"
    },
    {
      "level": "H3",
      "text": "页面用户体验"
    },
    {
      "level": "H2",
      "text": "哪些因素会影响站外 SEO？"
    },
    {
      "level": "H3",
      "text": "反向链接"
    },
    {
      "level": "H3",
      "text": "NAP 引用"
    },
    {
      "level": "H3",
      "text": "Google 商家档案(以前的 Google 我的商家)"
    },
    {
      "level": "H3",
      "text": "评论（和评级）"
    },
    {
      "level": "H2",
      "text": "最后的想法"
    }
  ],
  "author": "Mateusz Makosiewicz"
}