{
  "url": "https://ahrefs.com/blog/zh/orchard-seo-strategy/",
  "slug": "orchard-seo-strategy",
  "title": "2022年的疯狂简单的SEO策略（果园战略）",
  "description": "学习一个简单的过程，排名更高的谷歌与果园搜索引擎优化战略。",
  "content": "Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。 内容 每个人的SEO策略在高水平上都是相同的：找到人们正在搜索的关键词，并尝试为他们排名。但是有很容易和艰难的方法可以解决这个问题。在本指南中，我们将通过简单的SEO策略来帮助你获得最少量的努力。什么是SEO策略？搜索引擎优化策略是一个行动计划，旨在帮助你在谷歌排名更高，并获得更自然的搜索流量。这是你实现SEO 目标的过程。如何创建一个成功的 SEO 策略最成功的搜索引擎优化策略都是围绕着内容的高效创建和优化。关于如何做到这一点，有许多思路，但我们将用我们喜欢称之为果园战略的东西来简化事情。以下是整个过程:植树(页)选择低挂水果(首页关键词排名)挤出更多的果汁(优化)1. 植树正如不种树就不可能种植苹果一样，不创建和优化内容就不可能在谷歌上排名。出于这个原因，第一步是做关键词研究和发布优化的内容。让我们来看看如何做到这一点的基础知识。a) 使用关键词研究工具关键词研究就是找到人们搜索的内容的过程。有很多方法可以做到这一点。但是使用像 Ahrefs 的关键词分析这样的关键词研究工具是一个很好的起点，因为它可以让你找到成千上万的关键词想法。要使用它，输入一个单词或短语，点击搜索，然后转到一个关键词概念报告。例如，如果我们搜索“搜索引擎优化搜索”，我们会看到将近7000个关键词想法和数千个每月搜索，包括以下内容:什么是搜索引擎优化本地搜索引擎优化搜索引擎优化工具如果你想知道通过这些关键词排名第一你可以吸引多少流量，看看流量潜力(TP)专栏。这显示了当前排名最高的页面估计每月自然流量的多少。延伸阅读关键词研究: 初学者指南6个关键词研究技巧长尾关键词指南提示如果你的网站是新的或者目前没有得到很多自然的流量，从关注简单的关键词开始。了解更多关于如何找到这些在我们的指南找到低竞争关键词。.b) B)工艺内容搜索意图当人们在 Google 中输入一个查询时，他们通常是在寻找一些特定的东西，所以重要的是将你的内容与之对齐以获得最好的排名机会。这在搜索引擎优化领域被称为匹配搜索意图。你通常可以通过查看一个查询的最高结果来获得一个很好的搜索意图。例如，如果我们看看“自然搜索”的前三个结果，我们会发现它们都是带有定义的页面:如果我们想站在最好的机会排名，我们可能应该效仿，并创造类似的东西。推荐阅读： 什么是搜索意图？初学者的完整指南c)页面搜索引擎优化对于内容优化来说，匹配搜索意图是最重要的，但是基本的页面搜索引擎优化也很重要。这意味着优化你的标题标签、URL和元描述。以下是我们优化这三件事情的最佳建议:确保标题和元描述与搜索意图一致确保你的标题标签不会被截断在标题中包含你的目标关键词使用简短的描述性网址写一个引人注目的元描述推荐阅读: 网页搜索引擎优化: 初学者完整指南2. 选择低挂的水果假以时日，你的种子将开始生长并结出果实。换句话说，你将(希望)开始在谷歌的第一页上为你的一些目标关键词排名。然而，这往往不足以给你带来大量自然流量ーー这要感谢第一页点击率的指数级下降。例如，大多数点击率曲线显示，如果你的排名在第6位，点击率约为1.9% ，排名在第3位，点击率约为7% 。这意味着你站得到 ~ 268% 以上的流量从一个关键词排名三个位置更高。正因为如此，排在第2–10位的关键词可以说是 seo 中最容易获得的成果，也是最值得你关注的关键词。然而，在寻找低挂水果时，获得更多流量的潜力并不是唯一要考虑的因素。你还应该考虑这些关键词和页面给你的业务带来多少价值。让我们看看如何做到这一点。a) 在第2–10个位置寻找关键词如果你已经在使用类似 排名监控 这样的工具来跟踪你的页面的主要关键词，那么可以过滤你排在第2–10位的关键词，然后根据估计的流量或每月搜索量从高到低进行排序。这表明你的网页已经执行相当不错的主要目标关键词，但也有改进的空间。如果你不使用排名跟踪工具，注册一个免费的 Ahrefs 站长工具，然后这样做:在 网站分析中输入你的网站转到自然关键词报告过滤位置 # 2–10的关键词寻找你的目标关键词例如，如果我们为 Ahrefs 博客这样做，我们看到我们的排名在第七位的“联盟营销。”这个关键词在美国估计每月有106k 的搜索量，所以它可能是一个低悬的搜索引擎优化机会，因为我们可以通过排名上升几个点来显著提高我们的自然流量。b) 优先选择最赚钱的关键词如果额外的流量不太可能对你的底线产生太大影响，那么追求更高的关键词排名就没有意义了，所以把关键词和页面的“商业价值”也考虑进去也很重要。如果你在谷歌分析中跟踪转化率，这应该会让你知道额外的流量可能带来多大的利润。如果没有，那么你必须根据关键词和页面本身做出最好的猜测。以下是 Ahrefs 网站关键词/内容的“商业价值”量表:3. 挤出更多的果汁低挂水果在手，下一步是学习如何挤出更多的果汁他们。这意味着找出他们排名不高的可能原因，并在这些领域做出改进。要做到这一点，从你能控制的简单事情开始。如果这些方法不起作用，或者之后还有改进的空间，那么就去做更有挑战性的事情。以下是我们推荐的方法:让我们一步一步地来看看这个过程。a) 确保它完全涵盖了主题考虑到你的内容在目标关键词上已经表现得相当不错，这显然是一个很好的搜索目的的匹配。换句话说，它完全符合搜索者的要求。然而，你仍然可能遗漏了一些东西，而且通过更新排名并将其整合到你的内容中来提高排名通常是可能的。这里有一个简单的方法找到这些副主题:在网站分析中粘贴你的网页 URL转到内容差距报告输入比你级别高的类似页面的 url点击“显示关键词”例如，如果我们这样做为我们的客座博客指南，我们看到竞争的网页排名一系列关键词相关的客户博客指南:我们完全忽略了在我们的文章中谈论这一点，所以它可能会有意义增加一个简短的部分。这不仅会让这个指南对搜索者更有用(这显然是他们想知道的) ，而且也可能向谷歌表明，我们更全面地涵盖了这个主题，值得排名更高。b) 确保你的页面搜索引擎优化已完成当你发布你的内容时，你应该已经完成了基本的页面搜索引擎优化，但是仍然有改进的机会ー特别是在你的标题标签和元描述方面。基于这个原因，有必要再次快速查看一下在搜索结果页面的上下文中页面的外观，并问问自己:它是否仍然与意图保持良好一致？他们中的任何一个能更引人注目吗？它们中的任何一个都被截短了吗？解决你发现的任何问题。c) 确保它在相关的地方有内部链接内部链接是从你网站的一个页面到另一个页面的链接。它们可以帮助访问者浏览你的网站，并将 页面排名传递到页面，这可以帮助他们在谷歌中获得更高的排名。基于这个原因，作为一般的经验法则，你应该在内部链接你的站点上所有相关的、上下文相关的机会。因此，当你想要在 serp 上增加一个页面时，一个快速的胜利就是寻找错过的内部链接机会并添加内部链接。找到这些的最简单的方法之一是网站诊断中的链接机会工具，你可以免费使用 AWT。以下是如何使用它:单击高级过滤器点击 + 规则从第一个下拉列表中选择“目标页面”在 value 字段中输入页面 URL例如，如果我们输入我们关键词研究指南的 URL，我们会看到71个潜在的内部链接机会:你可以看到，Site Audit 显示源页面、关键词(可用作 锚文本)以及页面上关键词的上下文等内容。这使得定位和添加内部链接到页面变得容易。如果你在链接机会报告中没有看到很多结果(如果目标页面没有对很多关键词进行排名，这种情况可能会发生) ，你可以选择使用页面分析工具进行手动操作。以下是如何做到的:单击高级过滤器点击 + 规则从第一个下拉菜单中选择“ Page text”在搜索框中输入相关的单词或短语点击 + 规则从下拉菜单中选择“内部链接”将第二个下拉菜单改为“ Not contains”在空白字段中输入目标页的 URL点击”申请”这将搜索不在内部链接到目标页面的页面上的提及。例如，我们看到有40个网页提到了“客户博客”，但是没有内部链接到我们的客户博客指南:这些网页中的大多无疑是相关的，和值得添加到我们的指南内部链接的地方。d) 确保它的链接配置文件足够强大外链是从一个网站到另一个网站的链接，它们是 谷歌排名的三个主要因素之一。这意味着，如果你的页面的高质量外链明显少于上面的页面，那么你可能很难在中短期内获得更高的排名。例如，我们的链接建设指南排名第4位的“链接建设”，并有从900多个引用域名(网站)的外链。不幸的是，级别比我们高的网页的引用域名数量是我们的两倍多，所以我们的排名可能不会很快提高。然而，如果你离竞争不是太远，得到一些更高质量的外链可以使所有的差异。例如，我们在“关键词同类相食”的自然排名中排名第二，并且我们的引用域的数量和我们在页面上的排名大致相同:我们可以通过构建一些更好的外链来超越这个页面。我们已经在博客上广泛讨论了链接建设策略，所以如果你需要更多的链接，可以查看下面的资源。延伸阅读搜索引擎优化链接建设: 初学者指南9个简单的链接建设策略你需要的8个链接建设工具9简单的本地链接建设策略难以获得外链？链接建设是困难的，特别是如果你的内容有商业价值。因此，如果你正在努力建立高质量的外链直接到你想排名的网页，给中间人方法一个机会。以下是它的工作原理简单介绍:查找或创建一段关于相似主题的信息性内容。建立该内容的链接。内部链接从那里到你的“金钱”页面，以提高其网页排名。在此视频或此博客文章中了解更多信息。4. 冲洗和重复这种搜索引擎优化策略成功的关键是保持成长和摘取低挂的果实。你可以通过持续发布关注 seo 的新内容，并重新优化那些开始对目标关键词表现良好的页面来实现这一点。然而，尽管这是一个有效的策略，但你不应该害怕将资源分配给追求最有价值的 SEO 机会——即使这些机会很难得到。在搜索引擎优化的背景下，最有意思的机会是:具有很高的流量潜力。具有很高的“商业价值”例如，如果你在网上销售蓝色小部件，关键词“蓝色小部件”可能是一个非常多汁的搜索引擎优化机会。出于这个原因，从一开始就为这个关键词排名分配资源可能是明智的。最后的想法在谷歌(Google)上进行排名有点像是一个盘子旋转的练习。当你试图为一个关键词排名时，其他关键词的排名将不可避免地开始下降。这就是为什么上述策略是周期性的(而且永无止境)。它依赖于你始终如一地创造和处理更多低悬的 SEO 机会。有问题吗? 在推特上给我发消息。译者，John Zhao，西品东来创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。",
  "headers": [
    {
      "level": "H1",
      "text": "2022年的疯狂简单的SEO策略（果园战略）"
    },
    {
      "level": "H2",
      "text": "什么是SEO策略？"
    },
    {
      "level": "H2",
      "text": "如何创建一个成功的 SEO 策略"
    },
    {
      "level": "H3",
      "text": "1. 植树"
    },
    {
      "level": "H4",
      "text": "a) 使用关键词研究工具"
    },
    {
      "level": "H4",
      "text": "b) B)工艺内容搜索意图"
    },
    {
      "level": "H4",
      "text": "c)页面搜索引擎优化"
    },
    {
      "level": "H3",
      "text": "2. 选择低挂的水果"
    },
    {
      "level": "H4",
      "text": "a) 在第2–10个位置寻找关键词"
    },
    {
      "level": "H4",
      "text": "b) 优先选择最赚钱的关键词"
    },
    {
      "level": "H3",
      "text": "3. 挤出更多的果汁"
    },
    {
      "level": "H4",
      "text": "a) 确保它完全涵盖了主题"
    },
    {
      "level": "H4",
      "text": "b) 确保你的页面搜索引擎优化已完成"
    },
    {
      "level": "H4",
      "text": "c) 确保它在相关的地方有内部链接"
    },
    {
      "level": "H4",
      "text": "d) 确保它的链接配置文件足够强大"
    },
    {
      "level": "H3",
      "text": "4. 冲洗和重复"
    },
    {
      "level": "H2",
      "text": "最后的想法"
    }
  ],
  "author": "Joshua Hardwick"
}