{
  "url": "https://ahrefs.com/blog/zh/organic-search/",
  "slug": "organic-search",
  "title": "什么是自然搜索? 你需要知道的一切",
  "description": "营销策略是你的企业的作战计划，指导你未来的营销工作。",
  "content": "Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。 内容 自然搜索是指来自搜索引擎的非付费搜索结果。这些搜索结果不能被广告商购买或影响; 它们是搜索引擎认为与用户的搜索查询最相关的结果。在这个指南中，我们将包含：自然搜索结果类型为什么自然搜索很重要如何检查和监视你的自然搜索排名如何在自然搜索结果排名更高如何在自然搜索中得到更多的点击有什么类型的自然搜索结果？在谷歌绝大部分的搜索结果像这个样子：也被称为“蓝色链接”结果许多年前，搜索的谷歌搜索结果都是这个样子的。但是现在有越来越多的变体，并且你会经常看到不同类型的结果出现。我来带大家看下这几种类型：精选摘要精选摘要是回答搜索者问题的简单摘要。他们出现在页首或者接近页首的自然搜索结果，且这个摘要是从排名最高的结果之一提取出来的。你可以使用免费的Ahrefs站长工具（(AWT)），看到你自己网站搜索的精选摘要，下面是使用步骤：注册免费的Ahrefs站长工具账户把你的网址粘贴到网站分析然后使用自然搜索关键词2.0报告点击“SERP特征”过滤器过滤精选摘要“我们排名的”视频轮播视频轮播精选摘要取决于搜索查询相关性。一个完整的轮播板块会占据一个自然搜索结果的位置。头条新闻头条新闻精选摘要最近发布的关于某个主题的内容。这些经常出现在有 新闻价值的自然搜索话题中。人们也会问 （People Also Ask) 人们也会问 (PAA) 板块展示人们常搜索的问题趋势。每一个问题都被简单的的概述回答，而这些答案都来自网页相关性的页面。推荐阅读: 什么是SERP？搜索引擎结果页面说明为什么自然搜索非常重要？在相关关键词的自然搜索中排名会为你的网站带来免费流量。例如，Ahrefs博客每个月有大概35.5万次的访问，是从自然搜索来的：如果我们必须向谷歌支付这些流量的费用，估计每月将花费我们94.6万美金：考虑到你必须创作内容，在自然搜索结果中排名，自然搜索的流量成本从来都不是真正免费的。但是，对我们来说，这通常是为网站带来高质量目标流量的最划算的方式。自然搜索对于任何在YouTube上发布视频的人来说也很重要，因为谷歌经常在其视频传送带和精选摘要中对YouTube视频进行排名。在精选摘要中的视频排名，也被称为建议剪辑。换句话说， 在谷歌上对你的视频进行排名 通常会给你带来大量的浏览量。例如，根据 Ahrefs 内容分析，这个“如何设定苹果营业额“的视频估计每月有6600次访问来自谷歌”:如何检查和监视你的自然搜索排名如果你想知道你的网站在自然搜索中某个关键词的排名，可以试试Ahrefs的 免费排名检查。.或者，如果你想看到排名前100的自然搜索结果中的所有关键词，试试这个:进入自然关键词报告注册一个免费的Ahrefs 站长工具(AWT)帐户粘贴你的网站到网站分析进入自然搜索关键词报告在这里你可以看到我们数据库 中的所有关键词，包括4.5亿个关键词，以及排名位置和其他关键词指标。小提示.您还可以在谷歌搜索控制台中查看关键字排名。然而，与Ahrefs站长工具不同的是，它限制你使用1000个关键字，并显示平均排名位置。如果你想在一段时间内监控某个关键词的排名，只需将其添加到排名跟踪工具中，比如Ahrefs的排名检查。如何在自然搜索结果排名更高在自然搜索种排名越高通常会给你的网站带来更多的自然流量。没有人确切知道谷歌是如何对网页进行排名的，但我们确实知道一些更重要的因素在发挥作用。以下是其中的五个:外链相关性超文本传输协议移动友好性新鲜度Backlinks外链是一个重要的已知排名因素。谷歌搜索质量高级策略师Andrey Lipattsev在2016年的一次网络研讨会上证实了这一点，我们在对超过10亿个网页的独立研究:中发现了外链和自然流量之间的明显相关性：你可以使用很多的外链建设策略来获得更多的外链，但可以说最好的出发点是分析谁链接到了排名靠前的页面以及原因。例如，假设你想要排名简历技巧。如果你把这个关键词排名最高的页面插入Ahrefs网站分析并检查外链报告，你会看到很多提供职业建议的页面的外链。考虑到这个事实，把你的链接投放到职业建议帖子的作者那里可能是有意义的。推荐阅读: 搜索引擎优化链接建设: 初学者指南Relevance谷歌有很多方法来确定页面相关性，最基本的信号是你的页面是否包含“与你的搜索查询相同的关键词”但是包含关键词并不能帮助你在自然搜索中获得更高的排名，除非你的页面与搜索意图一致，这就是搜索查询背后的原因。例如，从简历技巧的搜索结果中可以明显看出，人们正在寻找一篇清单格式的博客文章。如果你发布了一个页面，出售一本简历技巧的书籍，它几乎肯定不会在这个关键词的自然搜索排名，因为它没有与搜索意图相一致。搜索者希望学习，而不是购买。相反的是关键词“简历制作工具”，搜索者寻找的是一个工具，而不是博客文章。推荐阅读: 什么是搜索意图? 初学者完整指南HTTPsHTTPs对用户和服务器之间发送的所有数据进行加密，以提高安全性。自2014年以来，它一直是谷歌排名中的一个小因素。你如何知道你的网站是否使用HTTPs?只要看看浏览器栏。如果有一个锁定图标，则链接是安全的。如果情况不是这样，就值得修正。推荐阅读: 什么是 HTTPS? 你需要知道的一切移动友好性2015年，移动友好度成为手机搜索结果的一个排名因素。现在，随着谷歌向移动第一索引的转变几乎完成，它也是桌面上大多数网站的排名因素。如果你想知道你的网站对手机的友好程度，请查看谷歌搜索控制台中的“移动可用性”报告：推荐阅读: 移动优先索引：你需要知道什么新鲜度新鲜度是一个值得注意的排名因素，因为它是一个查询依赖的信号。这意味着有些关键词比其他关键词更重要，这又回到了搜索意图上。以“最佳智能手机”这样的关键词为例，所有的结果都是最近发布的。这是因为新鲜度对这个术语很重要。新的智能手机不断出现，因此搜索用户不太可能希望在2021年看到 iPhone 10的评论。现在看看“如何定制牛仔裤”这样的问题的结果:尽管最近发布了一些搜索结果，但一些排名靠前的自然搜索结果是在2014年发布的。这是因为结果的新鲜度并不重要。今天裁剪牛仔裤的过程与十年前大体相同。推荐阅读: 10个你不应该忽视的排名因素如何在自然搜索中得到更多的点击？在谷歌排名靠前是搜索流量等式的主要组成部分，但是你可以通过精心设计引人注目的标题标签、元描述和 URLs 来吸引更多的点击。以下是出现在谷歌搜索结果中的三件事:小提示. 并不总是显示页面的元描述。它们通常使用页面中的其他内容作为 SERP 中的描述性摘要。让我们来看看每种方法的一些最佳实践。标题标签最佳实践 保持在50–60个字符以内。在 SERP 中，长标题标签会被截断。 写句子大小写或标题大小写。不要大写。 包括你的关键词。但是只有当它有意义的时候。 匹配搜索意图。选择一个角度与搜索者正在寻找什么。 包括你的内容的 USP。告诉搜索者为什么你的内容是独一无二的(例如，“如何做苹果派”→“如何在20分钟内做出苹果派”) 不要自吹自擂。要诚实，不要夸大其词。推荐阅读: 如何打造完美的SEO标题标签元描述最佳实践 扩展标题。包括你在标题中没有空间的细节。 匹配搜索意图。保持它与搜索者想要的结果一致。 使用主动语态。直接向搜索者发送地址。 不要超过120个字符。元描述也要截断。 包括你的关键字。但是，只有当它有意义的时候。.推荐阅读: 如何写出完美的元描述URL最佳实践 要有描述性。深入了解页面内容。 使它常青。删除不必要的日期和数字。 避免关键字重复。这看起来像垃圾邮件。推荐阅读: 如何创建搜索引擎优化友好的网址常见问题解答如果你对自然搜索还有疑问，希望你能在这里找到答案。什么是Google Analytics中的自然搜索？自然搜索是Google Analytics中的流量之一。 它代表了通过从Google的有机搜索结果之一点击到你网站上的访问者。 你可以通过导航到采集>所有流量>通道来查看所有流量源的细分。什么是好的自然搜索的点击率？这个问题没有明确的答案，因为很多东西影响点击率。例如，你通常会看到一个更高的点击率为品牌查询(即，当有人正在搜索您的品牌)比非品牌查询。在搜索结果中，带有 SERP 特性的关键字通常会使用较低的 ctrl。我们的建议是，除非你的网站获得了大量的流量，否则不要太担心这个问题。如何在自然搜索结果中获得额外的链接？这些叫做网站链接，我们有一个完整的指南来解释你如何影响这些链接。最后的想法如果你想让你的网站每月都有更多的流量，你需要了解如何在谷歌的自然搜索结果中影响和排名更高。这里有一些资源可以帮助你：如何在谷歌上排名更高搜索引擎优化入门指南如何登上谷歌的首页如果有问题，可以在推特上联系我。译者，赵子荣，SEOZZR博客创始人 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。",
  "headers": [
    {
      "level": "H1",
      "text": "什么是自然搜索? 你需要知道的一切"
    },
    {
      "level": "H2",
      "text": "有什么类型的自然搜索结果？"
    },
    {
      "level": "H3",
      "text": "精选摘要"
    },
    {
      "level": "H3",
      "text": "视频轮播"
    },
    {
      "level": "H3",
      "text": "头条新闻"
    },
    {
      "level": "H3",
      "text": "人们也会问 （People Also Ask)"
    },
    {
      "level": "H3",
      "text": "为什么自然搜索非常重要？"
    },
    {
      "level": "H2",
      "text": "如何检查和监视你的自然搜索排名"
    },
    {
      "level": "H2",
      "text": "如何在自然搜索结果排名更高"
    },
    {
      "level": "H3",
      "text": "Backlinks"
    },
    {
      "level": "H3",
      "text": "Relevance"
    },
    {
      "level": "H3",
      "text": "HTTPs"
    },
    {
      "level": "H3",
      "text": "移动友好性"
    },
    {
      "level": "H3",
      "text": "新鲜度"
    },
    {
      "level": "H2",
      "text": "如何在自然搜索中得到更多的点击？"
    },
    {
      "level": "H3",
      "text": "标题标签最佳实践"
    },
    {
      "level": "H3",
      "text": "元描述最佳实践"
    },
    {
      "level": "H3",
      "text": "URL最佳实践"
    },
    {
      "level": "H2",
      "text": "常见问题解答"
    },
    {
      "level": "H3",
      "text": "什么是Google Analytics中的自然搜索？"
    },
    {
      "level": "H3",
      "text": "什么是好的自然搜索的点击率？"
    },
    {
      "level": "H3",
      "text": "如何在自然搜索结果中获得额外的链接？"
    },
    {
      "level": "H2",
      "text": "最后的想法"
    }
  ],
  "author": "Joshua Hardwick"
}