{
  "url": "https://ahrefs.com/blog/zh/ppc-marketing/",
  "slug": "ppc-marketing",
  "title": "PPC 营销: 按点击付费广告初学者指南",
  "description": "PPC（按点击付费）营销是一种在线广告形式，每当有人点击广告时，广告商都会支付一定的费用。",
  "content": "Michal Pecánek Ahrefs的营销专家和内容创作者。 沉迷于SEO，航空，香氛，寿司和墨西哥玉米卷。 内容 PPC (按点击付费)营销是一种在线广告形式，广告客户每次有人点击他们的广告就要支付一定费用。我们每天都会遇到这样的广告。搜索广告是 PPC 营销中最常见的广告形式:展示广告也属于 PPC 营销的范畴(尽管除了 PPC 还有其他不同的购买方式) :同样的道理也适用于社交媒体广告，比如 Facebook 上的这些广告:对于我们市场营销人员来说，PPC 广告是提高流量和转化率的好方法。好消息是，一旦你知道如何在谷歌广告这样的平台上运行点击付费广告，那么在其他平台上运行点击付费广告也就变得非常容易了，比如 Facebook、 Twitter 或者 Bing。在这篇文章中，你将学到:PPC 营销的好处是什么PPC 在市场营销中的角色是什么如何在谷歌广告(和其他平台)上取得成功PPC 营销的好处是什么？PPC 之所以是一个如此有用的营销渠道，有四个主要原因:1. 你可以立即为你的网站带来流量从你开始学习 PPC 营销到你的第一个 PPC 营销活动开始为你的网站带来流量只需要几个小时。相比之下，任何“免费”的选择，如 SEO，社交媒体，或电子邮件营销。这些通常需要几个月或几年的时间来开始驾驶任何实质性的交通。你可以通过支付每次访问节省无数的时间。2. 你可以很好地锁定潜在客户你通常只想为那些，可能从你那里购买的人的点击付费，所有的 PPC 平台都允许你这么做。看看我们在付费搜索中推广最多的五个网页:Ahrefs的网站分析 的顶级着陆页中，付费搜索的“热门着陆页”报告显示了任何网站上的页面，哪一个从 Google 的搜索广告中获得了最多的流量。当人们点击这些网页时，他们可能会注册一个免费的 Ahrefs 站长工具或者试用我们的Ahrefs工具，因为他们已经意识到他们需要解决的问题，并且正在寻找解决方案。我们提供这些解决方案。正如你稍后将看到的，你可以选择你的广告出现的时间和地点，以及谁会看到它们。PPC 是唯一一个拥有如此精确定位选项的营销渠道。3. 你可以轻松衡量它谷歌广告和所有其他 PPC 平台都提供了一个跟踪像素ーー一段代码，将广告点击与用户在网站上的所作所为联系起来，并让用户了解广告参与度和成本等信息。以下是它在广告层面的样子:Ahrefs 的 Google Ad 帐户的屏幕截图，其中包含修改后的转化数据。总之，你不会找到一个比 PPC 更精确的转化归因的营销渠道。这差不多就是你所能知道的，每次转换成本的总和了。4. 你可以轻松扩展它如果你想从你的 PPC 广告系列中获得更多的点击量，你可以直接投入更多的钱。内容营销、搜索引擎优化，或其他需要更多时间和工作的营销渠道就不是这样了。然而，在你决定对 PPC 营销进行重大投资之前，你应该清楚地了解它在你的营销策略中的作用。这包括制定一个计划，说明你想要达到什么目标，以及如何达到目标。PPC 在市场营销中扮演什么角色？PPC 营销可以让你在客户旅程中最关键的部分更加引人注目。换句话说，当人们准备好(或几乎准备好)购买。这是一个至关重要的观点，因为它意味着当符合以下标准时，付费点击广告是最有效的:潜在客户已经知道你的品牌。你们的产品很好，价格也很有竞争力。你的网站有很好的用户体验。你离这些标准越远，你的点击付费广告就越没有效果。让我来解释一下。想象一下你正在市场上寻找一个新的咖啡机。你首先读了一大堆相关的文章ーー什么是好的咖啡机，应该注意什么，人们推荐什么品牌等等。你可以继续阅读产品评论并挑选一些最爱。然后是时候买一个了，所以你开始寻找具体的产品。你越接近购买决定，更多的搜索广告将出现在你的搜索结果页。当你开始寻找一个好的咖啡机时，你可能还没准备好去买一个。但是一旦你开始搜索关键词，比如“1000美元以下最好的浓缩咖啡机”，“ Jura WE6钢琴评论”，或者“购买 Gaggia Classic Pro”，情况就不一样了当你点击广告进行购买时，你会倾向于那些符合以上标准的品牌和网站。熟悉度和品牌知名度在这里尤其重要。重要的是要记住，PPC 营销不是一个万能的救世主，将使你的业务突然蓬勃发展，而是在执行你的整体营销战略的车轮。谷歌广告基础够了，让我们直接进入谷歌广告(以前的谷歌广告词) ，最大的广告平台和一个与许多人的 PPC 营销的同义词。谷歌广告中的广告类型以下是你在谷歌广告账户中，最常遇到的六种广告类型:每种广告类型都因广告形式、广告位置和目标选项的不同而不同。让我们快速回顾一下他们需要做什么。1. 搜索广告这是最常见的形式，也许是谷歌用户联想到他们的广告的东西。如果用户输入(关键字)与广告商设置的相匹配(稍后再详细说明) ，搜索广告就会被触发。这些广告甚至可以占据搜索结果的前四位:2. 展示广告Google的Display广告在整个Google显示网络（GDN）中，以横幅格式出现。许多网站通过为此类广告提供空间来将其流量变现：3. 购物广告如果你是一个零售商，你会利用购物活动，让你直接在搜索结果页上用图片推广产品。它们也被称为产品清单广告(PLAs)。4. 视频广告们都知道那种期待看 YouTube 视频和看视频广告的感觉。它们可以说是最烦人的广告形式之一，也是人们安装广告屏蔽插件，或为 YouTube 高级版付费的主要原因。然而，如果正确地使用它们，它们会变得难以置信的强大。我敢肯定你已经看过很多视频广告，其中不仅你没有立即点击“跳过广告”，但你喜欢看它的整体。5. 智能广告这种广告类型，并不提供一种新的广告形式，而是一种不同的广告管理模式，你可以把很多工作留给谷歌的算法。你基本上提供了一些数据输入，谷歌可以从这些数据中找出目标对象，竞标对象等等。以下是谷歌对智能广告的评价:智能广告系列是 Google 为小型企业提供的高效、简单的解决方案，可帮助您的企业在相关时刻在 Google 上被发现。 智能广告系列由 Google 最好的广告技术提供支持，可根据您的广告系列目标（无论是客户来电、对你所在位置的访问还是在您网站上的操作）为你带来结果。–HTML—</blockquote>—HTML—6. 发现广告这是谷歌广告中最新的广告类型。发现活动的重点是谷歌发现的广告，基于你的在线活动，自动生成和高度个性化的移动端数据供稿。它显示关于你感兴趣的话题的信息和新闻，比如 SEO 或者高尔夫。在谷歌广告中 PPC 广告是如何运作的PPC 基础知识是快速和容易理解的。我将主要关注搜索广告，并且加入一些关于显示广告的信息，以及这两种类型的广告与所有对 PPC 感兴趣的人有关。我们将在这里讨论以下概念:拍卖制度广告运动ーー广告组ーー广告等级搜索广告的关键字匹配类型谷歌显示网络的目标定位排除特定的关键字和网站的目标闲话少说…拍卖系统无论何时，只要你的广告符合出现在目标受众面前的标准，你就进入了一场拍卖。你的竞争对手和其他企业也想要占有这个广告位置。那么谷歌是如何决定哪些广告客户可以得到它的呢？以下是:谷歌用来确定拍卖获胜者的标准: 投标 — 每个符合条件的广告客户，愿意为点击(或其他行动)支付的最高出价。 广告质量 — 由称为质量分数（QS）的指标确定。谷歌考虑了预期的点击率（CTR），广告相关性和着陆页面体验。 来自您的广告扩展和其他广告格式的预期影响 — 您可以在基本广告格式的顶部添加的东西。由此，我们可以得出这样的结论: 你的广告越相关，写得越好，赢得拍卖所需的资金就越少。这个系统是为了推广高质量的广告和网站而设计的，当然，它并不总是有效。你要知道钱不是这里的一切。说到钱，还记得我提到过除了每次点击付费之外，还有其他方式来购买广告吗？实际上，除了 CPC (每次点击成本)之外，还有 相当多的竞价选项 。另一个经常使用的投标选项是 CPM，它代表每千次印象成本。你可能会用它来进行展示活动拍卖。Campaign — 广告组 — 广告层次结构每个广告平台都有一个管理系统，可以使创建、更改或更新广告变得简单快捷。事实并非总是如此，但可以理解的是，谷歌广告把门槛设得很高。无论何时你想要创建一个广告，你不能马上就做。每个广告都需要在它的广告组中，而广告组就是活动的一部分。这种等级制度使得广告商能够有效地管理整个广告账户。设置和选项的范围因平台而异。以下是你可以在 Google 广告中设置的内容和位置: 竞选水平 — 活动目标，广告系列，广告网络，受众，预算和招标，语言，广告扩展 广告组级别 - 关键字（或其他目标选项） 广告级别 - 广告标题，描述，URL，扩展最好的做法是有一个活动结构计划，并坚持下去。例如，一些 PPC 专家坚持每个广告组使用一个关键字，并在他们的命名约定中明确规定。因此，如果你在全球范围内销售咖啡机，你可以在美国推出一个名为 Search (意式咖啡机)的广告活动，由一个名为“意式咖啡机”(espresso maker)的广告组织推出，目标是在美国精确匹配这个关键词。我提前完成了精确匹配，所以这就是我们接下来要关注的。搜索广告的关键字匹配类型当用户的搜索查询与广告商竞标的关键词匹配时，搜索广告就会显示出来。广告的顺序取决于谁赢得拍卖，谁排在第二等等。您可以通过选择一个关键字及其匹配类型来实现关键字定位。下面是匹配类型列表及其工作原理: 广泛的匹配 — 匹配它认为无论单词订单还是拼写错误 广泛的匹配修饰符（BMM） — 像广泛的匹配一样，但+关键字需要包含在搜索查询中 短语匹配 — 完全匹配，但在关键字之前或之后可以有任何内容 完全匹配 - 自我解释，可以匹配奇异/复数形式和非常关闭的变体和同义词例如，如果我们使用关键词“ espresso machine”，这里是关键词匹配类型如何运作(你永远不能100% 确定)：不用说，匹配类型和关键词本身一样重要。只有一个好的目标关键字和合适的匹配类型的组合将带给你相关的流量。广泛的匹配几乎从来都是不合适的，除非你是像亚马逊这样的公司，它可以对数以百万计的搜索查询进行竞价。精确匹配可以让你最大限度地控制你的竞价对象，但它们也会限制你的曝光率，并要求你考虑针对各种相关的精确匹配关键词变化，比如(意式浓缩咖啡机)和(意式浓缩咖啡机)。谷歌显示网络(GDN)的基本定位谷歌收集了大量用户数据，并将其转化为广告客户的目标选择。这对任何人来说都不是秘密或惊讶。浏览和搜索历史可以转化为所谓的亲和力观众，你可以针对你的显示广告。以下是一些亲和类别:来源: 谷歌 到目前为止听起来还不错，对吧？好吧，除非你的目标市场非常广泛，否则这很可能是在浪费你的广告预算ー有点像广泛匹配的关键词定位。为什么? 以下是谷歌与我联系在一起的几个兴趣爱好:你可以通过登录你的谷歌账户来找到你的账户-> 数据和隐私 ->广告设置.我还没去过这些地方的一半，对上面列出的大多数兴趣爱好也没有兴趣。我可能只是在某个地方搜索或点击了某个东西，导致谷歌把我放入相关的亲和力观众。现在，它向我展示我根本不感兴趣的广告。一个更好的定位选项是创建一个服务于 Google AdSense 广告的特定网站列表。你只能通过这种方式来管理高度相关的网站。这就是所谓的定位瞄准。不包括特定的关键词和展示竞价广告优化的一个坚实块在于缩小关键字和网站你出价。一旦你的活动开始运行，你应该定期检查拍卖系统实际上在竞价什么，并对其进行优化。你经常会遇到这样的情况: 你投标的关键词不太相关或者不相关，除非你严格遵循精确匹配(这不是一个好主意)。你从广告活动中排除的关键词叫做负面关键词。正如你在下面的广告账户中看到的，你也包含了一个负面关键字的匹配类型:同样的道理也适用于你的展示活动。如果你不只是针对特定的位置，你的广告就会出现在与你的业务无关的位置。尽快消除那些有很多印象的人可以节省很多钱。如何在谷歌广告中取得成功我仍然记得第一次登录 PPC 平台管理广告活动是什么感觉。虽然我不会把自己归类为 PPC 专家，但我已经学会了如何快速有效地管理跨多个平台的 PPC 活动。以下是我在 PPC 旅程中的一些建议。按照你学到的去做我给你的最好的建议就是，马上把学到的东西付诸实践。当你不需要的时候，不要没完没了地消耗各种 PPC 主题的信息。总会有些事情是你一无所知的，这没关系。参加一些谷歌广告课程要熟悉一个 PPC 平台，最好的方法莫过于让别人给你一个演示之旅ーー首先要设置什么，在哪里，如何工作，需要注意什么，等等。幸运的是，谷歌广告上有数不清的学习资源和课程。我建议从短的谷歌广告教程 和 谷歌广告学习中心开始。请注意，谷歌的销售代表或支持提供商可能会联系你来帮助你。虽然这很好，我鼓励你利用这一点，但请记住，他们的主要目标是让你花更多的钱。PPC 的伟大之处在于其丰富的官方文档和指导。广告是谷歌和其他科技巨头的主要收入来源，所以他们需要提供巨大的支持。你不仅可以通过谷歌广告界面得到提示和工具提示，而且你还会发现谷歌广告知识库和指南包含了你将要寻找的绝大多数东西。指向有关 eCPC 的单独支持文章的工具提示示例。从小事做起，自力更生如果你还没有谷歌广告账户，谷歌可能会试图推动你创建 Smart 广告活动——你可以立即将大部分控制和设置交给谷歌的算法。抵制这种冲动，因为当你开始使用 PPC 的时候，最好把所有的东西都放在你的手中，然后当你真正知道你在做什么的时候，你可以慢慢地整合“更聪明”的特性。只要忽略精明的活动推动和使用“专家模式”，你自己建立一切。我建议你首先围绕关键词创建广告，这些关键词相对便宜，并且与你的产品相关。制定一个不会对你的整体营销预算造成很大影响的每日预算，然后从这个开始。定期监控和优化你的活动。一旦你开始得到可靠的结果，你可以增加你的预算和包括更多的关键字，包括那些高点击率。正确设置转换和跟踪你的主要 PPC 指标都围绕着金钱。我们的目标是最大限度地利用广告支出，因此关键绩效指标(kpi)之一应该是每次转换的成本。我强烈建议你在开始做广告之前适当地设置转化率跟踪。每当你的客户购买产品时，计算转化率是这里的基础，但是如果你在此基础上计算转化率，你会做得更好。它仍然相当简单，但您可能需要一些开发人员的帮助。只要按照说明设置转换:设置转化率还可以让你利用谷歌的机器学习算法，这些算法可以帮助你优化性能，从而获得更多的数量和价值转化。增强型 CPC (eCPC)是您应该使用的第一个很好的示例。对你的目标进行适当的研究无论是关键词、网站还是受众，你都应该有一些数据来支持你的目标选择。或者更好的方法是，首先根据数据创建你的广告活动。对于搜索广告，你必须做 关键词研究。大多数人会把它和搜索引擎优化联系在一起，但对于 PPC 搜索广告来说，这也是无价之宝。你首先需要知道人们在搜索什么，然后你平均要为点击付多少钱。你可以在 Ahrefs 的关键词分析 中获得这些数据。只需键入一些(种子)关键字，捕捉您的业务和产品提供的性质，并从那里去。另一个经常使用的 PPC 关键词研究工具是 谷歌关键词规划师。它不会像支付搜索引擎优化或者 PPC 工具那样给你提供大量的数据，但是它自然会提供最精确的 CPC 数据:至于谷歌广告，当你创建一个广告组时，它可以给你一些关键字建议。只要粘贴你的着陆页面，谷歌就会为你提供一些登陆页面需要的关键词:正如你所看到的，关键词建议并不是最好的，但是你可以找到一些相关的建议。这基本上是更先进的动态搜索广告(DSA)格式背后的机制，它自己选择关键字出价。开始探索更高级的格式、特性和选项如果我设法在这里全部包括的话，PPC 营销将是相当容易的。事实远非如此。因此，这里有一些广告格式、功能和目标选项，在你熟悉了这些基本内容之后，你应该考虑看一看并使用它们。1. 手动和自动广告扩展广告扩展是在标准的标题、描述和 URL 之上添加额外的文本到广告中。它们可以在广告和账户层面设置，这是我鼓励你在掌握了基本知识之后使用的首批功能之一。如果您使用自动扩展(通常是本地企业) ，您可能需要将您的谷歌广告帐户与您的Google My Business 帐户连接。2. 再营销广告形式除了转换跟踪，您还可以设置一个跟踪代码来收集网站访问者的数据。然后，您可以使用这些数据再次通过多种谷歌广告格式访问这些访问者。例如，你可以调整出价和显示定制的搜索广告给我们的过去的访客，如果他们继续寻找相关的关键字通过 搜索广告再营销列表(RLSA)。这些广告提供了一个很好的机会，把那些犹豫不决的访问者变成顾客。但是除了 RLSAs 之外，还有更多的东西可以再营销，你可以通过显示网络、 YouTube 甚至 Gmail 进行再营销。3. 动态搜索广告谷歌广告根据提供的登陆页面 URL 为你提供关键词建议的机制是 DSA 的核心部分。你可以设置搜索广告，不是针对关键词，而是提供一个 url 列表，让谷歌决定什么时候搜索查询与你的登陆页面相关，并为你出价。您的目标市场越广泛，您将获得更多有用的消息安全许可证。如果您只针对利基产品提供和受众的一系列关键字，那么 DSAs 很可能不会帮助您，而是针对不太相关的关键字。4.自定义意图观众(CIA)另一个伟大的显示定位选项是目标受众的基础上，他们的搜索历史和行为在整个展示网络。自定义意图受众是基于一组搜索关键字、访问过的网站或使用过的应用程序创建的受众。你基本上可以告诉谷歌把你的广告展示给那些搜索某些东西或访问与你业务相关的网站的人。我已经听到许多 PPC 专家称赞这个目标选项是最好的事情，你可以做的显示广告，所以给它一个机会。谷歌的移动广告编辑器许多 PPC 专家甚至不怎么使用网页界面。谷歌提供了一个叫做谷歌广告编辑器的桌面应用程序，这个程序有助于竞选管理，并允许你节省大量的点击量和时间。用户界面是不同的，但它的存在使您的 PPC 工作更容易。一旦你适应了网络平台，或者觉得开展广告活动已经花费了很多时间，那么就学着使用谷歌广告编辑器吧。从长远来看，这是你能为你的竞选管理做出的最佳选择。最后的想法PPC 营销是(或者至少应该是)你整个营销努力的一小部分，但是有很多东西需要学习并从中获益。本指南应该提供了基础知识，引导您的新 PPC 的旅程在正确的方向。虽然这主要集中在谷歌广告上，但是你可以很容易地使用这些知识来学习和浏览任何其他的 PPC 平台。下一个复杂的当然是 Facebook 广告，但是你可以从 Twitter，Quora 或者 LinkedIn 这样的平台上获得很多。你有什么想法或问题吗? 在Twitter上联系我。译者：John Zhao, 西品东来创始人 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Michal Pecánek Ahrefs的营销专家和内容创作者。 沉迷于SEO，航空，香氛，寿司和墨西哥玉米卷。",
  "headers": [
    {
      "level": "H1",
      "text": "PPC 营销: 按点击付费广告初学者指南"
    },
    {
      "level": "H2",
      "text": "PPC 营销的好处是什么？"
    },
    {
      "level": "H3",
      "text": "1. 你可以立即为你的网站带来流量"
    },
    {
      "level": "H3",
      "text": "2. 你可以很好地锁定潜在客户"
    },
    {
      "level": "H3",
      "text": "3. 你可以轻松衡量它"
    },
    {
      "level": "H3",
      "text": "4. 你可以轻松扩展它"
    },
    {
      "level": "H2",
      "text": "PPC 在市场营销中扮演什么角色？"
    },
    {
      "level": "H2",
      "text": "谷歌广告基础"
    },
    {
      "level": "H3",
      "text": "谷歌广告中的广告类型"
    },
    {
      "level": "H4",
      "text": "1. 搜索广告"
    },
    {
      "level": "H4",
      "text": "2. 展示广告"
    },
    {
      "level": "H4",
      "text": "3. 购物广告"
    },
    {
      "level": "H4",
      "text": "4. 视频广告"
    },
    {
      "level": "H4",
      "text": "5. 智能广告"
    },
    {
      "level": "H4",
      "text": "6. 发现广告"
    },
    {
      "level": "H3",
      "text": "在谷歌广告中 PPC 广告是如何运作的"
    },
    {
      "level": "H4",
      "text": "拍卖系统"
    },
    {
      "level": "H4",
      "text": "Campaign — 广告组 — 广告层次结构"
    },
    {
      "level": "H4",
      "text": "搜索广告的关键字匹配类型"
    },
    {
      "level": "H4",
      "text": "谷歌显示网络(GDN)的基本定位"
    },
    {
      "level": "H4",
      "text": "不包括特定的关键词和展示"
    },
    {
      "level": "H3",
      "text": "如何在谷歌广告中取得成功"
    },
    {
      "level": "H4",
      "text": "按照你学到的去做"
    },
    {
      "level": "H4",
      "text": "参加一些谷歌广告课程"
    },
    {
      "level": "H4",
      "text": "从小事做起，自力更生"
    },
    {
      "level": "H4",
      "text": "正确设置转换和跟踪"
    },
    {
      "level": "H4",
      "text": "对你的目标进行适当的研究"
    },
    {
      "level": "H4",
      "text": "开始探索更高级的格式、特性和选项"
    },
    {
      "level": "H5",
      "text": "1. 手动和自动广告扩展"
    },
    {
      "level": "H5",
      "text": "2. 再营销广告形式"
    },
    {
      "level": "H5",
      "text": "3. 动态搜索广告"
    },
    {
      "level": "H5",
      "text": "4.自定义意图观众(CIA)"
    },
    {
      "level": "H4",
      "text": "谷歌的移动广告编辑器"
    },
    {
      "level": "H2",
      "text": "最后的想法"
    }
  ],
  "author": "Michal Pecánek"
}