{
  "url": "https://ahrefs.com/blog/zh/product-market-fit/",
  "slug": "product-market-fit",
  "title": "如何实现产品与市场的契合(五个步骤)",
  "description": "产品市场契合(PMF)是指，企业已经确认，其产品能够满足潜力巨大的市场现有需求的信号。",
  "content": "Mateusz Makosiewicz Ahrefs 的营销研究员和教育家。 Mateusz 在推广代理、SaaS 和硬件业务领域拥有超过 10 年的营销经验。平时喜欢创作音乐或享受长距离的散步。 内容 创业公司经历了一连串无休止的问题和挑战。在这种情况下，生存就是一门艺术，要么专注于某件事，要么暂时搁置，要么干脆忽略。但这从来都不是一件容易的事: 意见分歧，时间和金钱的流失，以及一个真正伟大的商业理念应该立即飞速发展的错误观念，是创业公司将面临的共同问题。产品市场匹配是一个概念，旨在解决各种创业问题，通过有志成为“唯一重要的事情”关注这个概念，应该让任何创业公司走上正确的轨道，不管是在什么情况下。在本文中，我们将进一步研究这个被广泛讨论的概念:什么是产品与市场的契合为什么产品市场匹配很重要产品与市场匹配的例子实现产品与市场匹配的五个步骤什么是产品与市场的契合？产品市场契合(PMF)是指，企业已经确认，其产品能够满足潜力巨大的市场现有需求的信号。实现 PMF 的通常标志是当人们愿意购买产品(即使它还不完美) ，积极使用它，并向其他人推荐它。为什么产品市场匹配很重要？建立一个成功的产品是按照正确的顺序做正确的事情，关注真正重要的事情。正如房屋需要从头开始建造一样，企业在进一步发展之前也应该建立良好的基础。在雇佣更多的人或扩大客户获取规模之前，创业公司应该确认两件事: 第一，有足够多的人愿意为产品付费; 第二，市场本身显示出增长潜力。简单地说，没有 PMF，就没有可持续的增长。产品与市场匹配的例子实现 PMF 有几种可能的情况。一f些公司找到了一个好的初始想法，并以此为基础。其他公司需要彻底改变他们的业务(重心)以实现盈利。所以让我们看看一些企业找到他们的 PMF 的例子。AhrefsAhrefs 是一个多合一的 SEO 工具包，包括多种工具，旨在增加有机的搜索流量，分析竞争，并解决技术 SEO 问题。Ahrefs的五个核心工具。但在早期，Ahrefs 只是一个单一的工具，建立外链分析(这只是一个方面的搜索引擎优化)。推荐阅读: 搜索引擎优化: 入门指南Ahrefs在2011年的价值主张。Ahrefs的创始团队专注于第一个产品的客户满意度。一开始没有市场或销售团队。这种策略使公司能够获得 PMF 的清晰信号。因此，由于其客户基础的有机增长，Ahrefs 能够建立更成功的搜索引擎优化工具和规模其团队。值得注意的是 Ahrefs 并没有停留在最初的 PMF。为了保持竞争力和市场需求的顶部，它扩大了功能从一个单一用途的 SEO 工具到一个全面的 SEO 工具包。Slack这就是 Glitch，Slack 的前身，它甚至不是一款即时通讯应用。Glitch 是一个基于浏览器的在线多人游戏，于2012年推出，它看起来像这样:右边的聊天窗口后来成为我们今天所知道的 Slack。剩下的部分由公司放弃，并在开源许可证下发布，任何人都可以接管。Slack 通过转变成一个完全不同的产品，找到了自己的 PMF。用创业公司的行话来说，这叫做“枢轴”故障游戏并没有取得预期的成功。但考虑到其分拆的成功，这根本不重要。重要的是快速理解你的课程，并专注于实际工作的事情。培乐多（Play-Doh）培乐多是一个经典的玩具，已经成为任何玩具商店50年来的必备品。这个品牌获得了巨大的成功，但是它寻找 PMF 的旅程却没有那么顺利。首先，培乐多最初有一个完全不同的应用程序，用于与今天完全不同的目标受众。这种产品的名字叫 Kutol，是一种墙壁清洁剂，专门用于清洗燃煤加热器上的黑色残留物——这是上世纪30年代常见的问题。生意一直很好，直到煤加热器被“清洁”的燃气和燃油加热器所取代。这就是为什么公司失去了原来的 PMF。但它没有放弃。传说，其中一位创始人的亲戚曾经在艺术和手工艺课程中与孩子一起使用库托尔。这位亲戚对一个新的官方产品应用程序提出了类似的建议。因此，库托的生产商采取了信任的飞跃，重新品牌的产品为培乐多，一个模型化合物的儿童。就这样，公司发现了新的 PMF，并且一直保留到现在。在20世纪50年代前后，墙壁清洁剂库托试图恢复其 PMF。这样一来，它就成了一个成功的玩具。实现产品与市场匹配的五个步骤在寻找 PMF 的过程背后的基本思想是类似的科学方法。要做出发现(比如，要生产什么样的产品) ，你需要对问题进行足够深入的研究，提出一个假设，然后设计一个实验来证明或反驳这个假设。如果你想了解一个已经存在的产品测量 PMF，跳到第四步。第一步: 提出价值假设价值假设是一种假设，用来解释为什么顾客可能会购买你的产品。换句话说，你需要指定你的产品将给用户的生活带来什么价值。价值假设可能是这样的:在网上购买书籍比在实体书店购买书籍提供了更好的体验。SEO 专业人士需要一个自动化技术 SEO 诊断工具。电子邮件沟通的效率低于实时在线聊天。你的价值假设稍后将在与与你的最小可行产品(MVP)互动的真实用户的对抗中得到检验。伟大的产品解决了真实的，有意义的问题。为了识别这些问题和需要解决方案的潜在客户，您需要进行市场调查。市场调查可能是一个非常耗时的过程。但好消息是，很大一部分市场调查可以在网上完成，而不用花光所有的钱。例如，通过使用像 Ahrefs 这样的 SEO 工具，你可以通过搜索引擎中搜索需求的迹象来衡量市场需求，因为它们经常是相关的。比如说，你的创业公司想要为航班延误和取消的赔偿提供一个在线解决方案。因为这将是一个在线产品，你会想知道人们搜索与该问题相关的查询的频率。使用 Ahrefs 的 关键词分析，这些信息只需点击几下鼠标即可获得。“航班延误赔偿”在全球每月获得大约1.6K的搜索，似乎是一个常见的问题。此外，我们可以看到搜索需求受到大流行影响的严重影响。第二步: 详细说明你的最小可行产品的特征一旦你清楚地定义了你想要解决的问题，下一步就是确定一组能够解决客户问题的特性。构建太少的特性将导致不完整的解决方案。但是拥有太多的功能也是不好的，因为这会削弱产品的核心价值，增加在原型上超支的风险。这就是 MVP 的用武之地。构建 MVP 是关于平衡正确的种类和验证假设所需要的正确特征数量。使用多种来源和类型的研究来发现需要构建的内容可能是一个好主意。你可以结合你的竞争分析，调查，观察和行业报告的结论。此外，搜索引擎优化工具可以派上用场。例如，你可以通过识别那些为你的竞争对手带来付费流量的网页，以及通过有机搜索流量排在首位的网页，来很好地了解哪些功能为你的竞争对手创造了最大的价值。假设您想要构建一个项目管理工具。让我们使用 Ahrefs 的网站分析，看看 asana 网站的付费页面报告: 让我们看看热门页面报告中获得最多自然流量的产品功能的登录页面：你可以推断，在项目管理应用程序中构建表单和时间线特性是需要认真考虑的事情。如果这对你的竞争对手有好处，那么对你的产品也是有好处的(在你独特的价值主张之上)。第三步: 建立最小可行产品如果你看看一些最成功的 mvp，你会发现有很多方法来构建他们。它们甚至不必是功能齐全的产品。举例来说，Buffer 最初是一个登陆页面，它收集了一个尚不存在的产品的注册信息。Dropbox 通过制作两个关于该产品的视频来验证其商业想法。第一个视频甚至没有展示该产品。https://www.youtube.com/watch?v=w4eTR7tci6A现在，让我们来看看如何构建 MVP (除了开发功能齐全的产品之外)的一些想法: 广告活动——你可以为特定的受众制作各种类型的创意内容，看看你的产品的哪些方面对他们最有吸引力。 原型——您可以使用 UXPin、 Figma 或 Marvel 等设计工具创建一个交互式的、高保真的解决方案原型，并向人们展示。 登陆页面——类似如何缓冲开始，你可以创建一个登陆页面，推销你的想法和收集电子邮件地址通过等待名单注册表单。之后，你可以用这些电子邮件来收集反馈。此外，你还可以在网站上运行 a/b 测试来测试不同的假设。 客户面试——这种方法可以让你以最少的努力更深入地了解潜在客户对你产品的反应。 “绿野仙踪”MVP——客户认为他们正在体验一个真正的产品，但是你通过“幕后”的手工工作来提供服务 礼宾部 MVP——一个手动优先的 MVP 类似于“绿野仙踪”，但你不假冒的产品。 Kickstarter/预订页面——你可以通过让你产品的早期用户注册来测试市场需求。无论你选择如何构建 MVP，请记住它需要帮助验证你的价值假设。第四步: 用真正的用户测试你的最小可行性产品在寻找 PMF 的这个阶段，您需要收集尽可能多的反馈为您的产品。不要停留在积极或消极的反馈上。试着深入挖掘，了解你的用户喜欢什么，不喜欢什么，以及他们想要改变什么。像 SurveyMonkey、 UserTesting 或者 Remesh 这样的平台可以帮助您获得正确的人口统计数据来进行用户测试和/或面试。你也可以将你的 MVP 发布到与你的产品目标受众相关的在线社区，或者在诸如 Product Hunt 这样的平台上分享。对于市场上现有的产品，取决于你的产品存在的时间长短，PMF (或缺乏 PMF)的迹象可以从客户满意度和参与度中看出来。考虑一下这些指标: NPS 得分——在你的用户之间运行净推广者评分调查。如果你的用户对这个产品不满意，他们不太可能把它推荐给他们的朋友。因此，你通过口口相传有机增长的机会很低。 40% 规则——就像 NPS 的调查一样，这只是一个问题: “如果你不再使用[产品] ，你会有什么感觉?”可能的答案是: a)非常失望，b)有点失望，c)不失望(它真的没那么有用) ，d) n/a ー我不再使用[ product ]。如果至少有40% 的用户选择了第一个选项，那么你很有可能已经达到了 PMF。 队列保留率——这是保留的产品设计，以便在更长的时间内使用。这个想法是这样的: 如果你的付费客户留在你的产品，这是一个标志的 PMF。理想的保留率可以有所不同，这取决于产品和行业的类型。点击这里了解更多关于保留率基准的信息。第五步：向用户学习并迭代在这个过程的最后阶段，你应该能够回答两个问题: 你的 MVP 证明了还是反驳了价值假设？你能做些什么来使你未来的产品更好呢？你的价值假设实验的负面结果并不是世界末日。根据反馈，你可能会做一些调整并重申你的假设。然后，重新开始这个过程。一个著名的例子就是汽泡纸。它并没有作为一种新型的壁纸或房屋隔热材料流行起来。此外，一些商业创意可能会超前于时代(例如，由于技术原因或当前的立法)。你可能需要另找时间再试一次。然而，有些商业想法就是不好，你真的无能为力。好的一面是，如果你能及早发现这个问题，你将节省自己大量的时间和金钱。但是如果你一直都是正确的，你的 MVP 在与用户的对抗中幸存下来，那么你将有一个成功的机会。换句话说，你可能发现了 PMF。在你把 MVP 变成功能齐全的产品并投放市场之前，最好多做几个迭代来处理你收到的所有反馈。您希望从用户那里听到的是您的 MVP 易于使用并且提供了有价值的解决方案。最后，正如我们已经看到的 PMF 的例子，PMF 可以是一个暂时的事情。你可能会在某些时候失败，比如库托尔(Play-Doh) ，或者可能需要扩展你最初的想法，比如 Ahrefs。最后的想法市场永远是赢家。伟大的产品在不景气的市场中会失败，而不好的产品迟早会在繁荣的市场中被边缘化。这就是为什么选择一个用户遇到真正有意义的问题的市场，快速推出产品，并根据反馈进行迭代如此重要的原因。在这个阶段取得成功是一个信号，表明你可以开始着手下一步: 雇佣更多的人并获得更多的客户。最后一点，最好记住并不是所有的用户反馈都是一样的。您不需要实现用户的所有愿望。专注于可行的改进和与你的产品愿景相关的事情。有什么问题或评论吗? 在推特上给我发消息。译者，John Zhao，西品东来创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Mateusz Makosiewicz Ahrefs 的营销研究员和教育家。 Mateusz 在推广代理、SaaS 和硬件业务领域拥有超过 10 年的营销经验。平时喜欢创作音乐或享受长距离的散步。",
  "headers": [
    {
      "level": "H1",
      "text": "如何实现产品与市场的契合(五个步骤)"
    },
    {
      "level": "H2",
      "text": "什么是产品与市场的契合？"
    },
    {
      "level": "H2",
      "text": "为什么产品市场匹配很重要？"
    },
    {
      "level": "H2",
      "text": "产品与市场匹配的例子"
    },
    {
      "level": "H3",
      "text": "Ahrefs"
    },
    {
      "level": "H3",
      "text": "Slack"
    },
    {
      "level": "H3",
      "text": "培乐多（Play-Doh）"
    },
    {
      "level": "H2",
      "text": "实现产品与市场匹配的五个步骤"
    },
    {
      "level": "H3",
      "text": "第一步: 提出价值假设"
    },
    {
      "level": "H3",
      "text": "第二步: 详细说明你的最小可行产品的特征"
    },
    {
      "level": "H3",
      "text": "第三步: 建立最小可行产品"
    },
    {
      "level": "H3",
      "text": "第四步: 用真正的用户测试你的最小可行性产品"
    },
    {
      "level": "H3",
      "text": "第五步：向用户学习并迭代"
    },
    {
      "level": "H2",
      "text": "最后的想法"
    }
  ],
  "author": "Mateusz Makosiewicz"
}