{
  "url": "https://ahrefs.com/blog/zh/ranking-number-one-is-overrated/",
  "slug": "ranking-number-one-is-overrated",
  "title": "谷歌排名第一不是最重要的（基于10万关键词的研究）",
  "description": "还纠结目标关键词排名第一吗？我们研究了10个关键词发现排名第一并不是最重要的。",
  "content": "Tim Soulo Tim是Ahrefs的CMO以及产品顾问，同时他也是该公司最狂热的粉丝和最忠诚的传播者。 内容 每个人都希望自己的网站关键词排名第一，但是排名第一真的是我们追求的最终目标吗？我们研究了10万个关键词发现并不完全是这样。虽然我不做SEO优化服务很多年，但是我相信用户们的需求依然和5–10年前是一样的。 你可以帮我把网站的这些关键词优化到谷歌首页第一位吗？需要多长时间？费用是多少？后面的两个问题是非常合理的，但是第一个问题却不是。很多人对SEO的运作方式有所误解。为什么？因为在2019年，排名第一并不等同与成功的SEO。带来的流量（可以带来购买和转化的流量）才是最为重要的。如果你需要给你的客户解释这个道理的话，那么你将非常喜欢本文的研究结果。偶然的发现：排名靠前的页面并不总能获得最多的搜索量我几乎每天都会使用Ahrefs Keywords Explorer（关键词分析）——我们的关键词研究工具。大多数情况，我是为了确认想写的博客话题的热度，部分情况只是习惯性的查看。比如说，上一周，我在研究准备写一个以“how do I learn”开头的热门话题。你也感兴趣？请看下面：和以往一样，我很少关注单个关键词的搜索量（我在这里和这里解释过原因），更多情况我会观察排名靠前页面的自然搜索流量总和。你可以在Ahrefs Keywords Explorer（关键词分析）中看到这个词“submit website to search engines（提交网址至搜索引擎）”。这个词大约在美国1400的月搜索量。假设点击率是30%左右，那么这个词在美国可以带来大约400左右的搜索流量。（1400*0.3）现在我们再看下排名靠前的页面能够从美国带来多少流量：一些数据竟然是我们预估的20倍以上。为什么会这样？因为这些页面同时也会参与上百个长尾词的排名，并获取对应的流量。我们再来看下上方的截图。你发现了什么吗？反正我是发现了：排名第一的页面并不是自然搜索流量最多的！这种情况我经常看到，有时排名第一的页面没有SERP中其它的页面的流量多。下面是另外一个有意思的发现：排名靠前页面的排序并没有按照自然搜索流量的大小进行排列。这正是截图里的现象。排名第一页面的自然搜索流量没有第二名高，甚至还不如第十名！ 问题来了：这种现象经常发生吗？这个对我们做SEO有什么影响？为了解答这个问题，我让我们的数据团队对此做了深入的研究。研究：排名第一的页面搜索流量不是最多的概率下面是研究中我们所做的：我们在美国地区提取了10万个搜索词（不包含品牌词）这些词都拥有1000以上的月搜索量；从这些词中提取排名前十的页面；从这些页面中提取美国地区的搜索流量总和；计算排名第一页面获取最多流量的比例，排名第二的页面获取最多流量的比例，以此类推…小提示. 我们调研的关键词月搜索量分布1k-2k, 5k-6k, 以及 10k-11k。下方是调研的结果：饼图已经清晰的显示出，排名第一的网站并非一直都能够获取最多的流量。排名第一的页面获得最多自然搜索流量的概率只有49%！小提示. 事实上我们在分析10万个关键词的时候是按照搜索量分成三组进行调研的（1k-2k, 5k-6k, 10k-11k）。一开始我们认为不同的搜索量的情况下也许概率也会不一样。但结果显示非常的接近，所以我们决定不分享这些分组的数据，而是调取这些数据的平均值。总结：别老是纠结排名第一，把重点放在流量上别误会我的意思。我并没有说核心词排名第一不重要。你依然可以将那些华丽的核心词排名上升的数据发给你的客户看。核心词的排名依然可以被视作SEO优化成功的指标。事实，根据我们的研究，在众多变量中排名和自然搜索流量有着最强的相关性：但是注意，相关性上并没有到达到“1” 。这就意味着，即使你的竞争对手排名比你高，你也有可能获得更多的流量。下方就是做法：1. 深入话题下图是参与关键词“keyword research tools（关键词研究工具）”首页排名的页面：我们的页面虽然排在第六位，但是我们的流量却是排名第一的Backlinko.com网站的三倍以上其中的一个原因是，在这篇文章中，我们针对了两个非常接近的话题：“keyword research tools（关键词研究工具）” 以及“free keyword research tools（免费的关键词研究工具）”我们不仅参与了和“keyword research tools（关键词研究工具）”最相关的5个关键词的排名…… 同时也参与了“free keyword research tools（免费的关键词研究工具）”的排名。事实上，这个文章参与了美国地区191个带有“free（免费）”的关键词前五的排名。The top-ranking article from Backlinko only ranks for four.编者注：那么，如何“深入话题”呢？下方是一些小技巧：技巧 #1: 在Ahrefs’ Keywords Explorer（关键词分析）工具中查看Phrase match（短语匹配）报告。主要查看那些包含你核心词的长尾词。技巧 #2: Paste 把排名前三竞争对手URL放入Content gap tool（内容差距机会）工具，并筛选出包含指定话题的关键词。Joshua HardwickHead of Content我下面要提及的这一点，在你看来可能是一个极端的情况，并不是个例，但是依然…2. 针对你的话题打造一个“高权重”页面一起来看下关键词“chocolate lab（巧克力拉布拉多犬）”的SERP数据：有个两个非常有意思的现象：第一，排名第四的页面比排名第一的页面获得了更多的搜索流量。如果你把两个页面打开并排展示，你就知道为什么会这样：“Why chocolate labs have shorter lifespans（为什么巧克力拉布拉多犬寿命短） […]” 这个页面之所以排名这么高多半是因为它的标题会吸引更多的点击。当你搜索巧克力拉布拉多犬时，肯定不会忽略这个页面标题。“Chocolate Lab — Your Guide To The Chocolate Labrador Retriever（巧拉-你的巧克力拉布拉多犬指南）” 这个页面很显然提供各种巧克力拉布拉多犬的综合指南。相比于其它页面，它可以获得更多的相关搜索词的排名。谷歌甚至给了它三个额外的链接（site link）入口。第二，有三个页面的自然搜索流量远超其它页面。一起来看下这些页面的共同特征：网站都拥有高DR（域名评分）值；它们拥有数量不等的反向链接；话题广泛，并没有针对某个特定的话题。换句话来说，这些都是有“权重”的综合性文章。这就使得它们十分相关，并且能够参与大量的长尾关键词的排名。小提示.有兴趣了解您的网站“权重“有多少？试试我们的免费工具。SEO行业内也有类似这样的例子，比如Moz的“Beginners Guide to SEO（SEO初学者指南）”这个指南页面数年积累了非常多的“权重”，现在它参与了非常多的SEO相的关键词排名，并获得了大量的相关流量。你可以看下“what is SEO（什么是SEO）”的搜索结果：这个页面是排名前十中仅有的一个综合页面。这就引出了我们放大搜索流量的最为重要的一个要素：3. 明确搜索意图不知道你注意到没有，维基百科的“labrador retrievers（拉布拉多犬）”的词条页面参与了“chocolate lab（巧克力拉布拉多）”关键词前十的排名。那是因为，人们愿意通过一个犬类的综合性文章去了解巧克力拉布拉多犬。为什么是这样？因为谷歌会跟踪用户的“搜索喜好”。如果用户没有点击这些结果，或者这些结果没有满足用户的需求，谷歌立马就能够判断出来并将结果从SERP中移除。下面就是一个很好的例子，利用搜索意图上排名，而不是传统的页面优化手段：去年，我们想参与“backlink checker（外链查询）”的排名。所以我们在Ahrefs’ Site Explorer（网站分析）工具中制作了一个落地页，并且对外链查询功能做了详细的描述。不管我们做什么，这个页面都没办法排名靠前。我们针对“backlink checker”这个词进行了优化；我们优化了加载速度，移动端友好度以及其它的SEO技术要素；我们添加了很多的内链；我们做了外展，用于获得高质量的外链。但是并没有一丝效果，所以我们做了这样一件事情：我们查看了当时排名前五的网站，尝试去理解用户的搜索意图，我们很快的就发现问题所在。排名前五的网站都提供了用户可以直接查询外链的入口。而我们的落地页只写了产品优势。#facepalm所以我们建立了自己的免费查询外链的工具，然后把它加入到了落地页中。 我们并没有修改其它的东西。内容和之前是差不多的。没有做更多的页面优化。没有跟更多的技术层面的优化。我们只是简单的在落地页添加了一个免费查询工具的表单输入框。没有其它复杂的操作。结果？结果就是，几周后我们就到了首页第一位。之后，这个页面开始参与越来越多的关键词排名，同时带来了更多的流量。更有甚者，这个页面经历了负面SEO的攻击（我们排名上去之后，有人非常“好心”的在近600个域名上给我们做了近3万个的低质量外链）依然存活了下来。我们根本没有去主动拒绝这些外链，页面数据依然坚挺。额外的内容：争取精选摘要 (Featured Snippet)精选摘要 (Featured Snippet) 可以直接提供用户想要搜索的信息的摘要，通常它会显示在搜索结果的最上方。通常谷歌会从排名靠前的页面中提取一段内容用于展示。如果你幸运的获得了精选摘要 (Featured Snippet) ，则可以带来很多额外的曝光和点击。同时你还可以从其他排名靠前的网页上”窃取”点击。为了更好的参数，我们来看下“SEO tips（SEO技巧）”的排名结果：我们的页面在第五名，如果Neil Patel没有精选摘要 (Featured Snippet) 的话，我们的搜索流量就应该是所有结果中最多的。为什么？因为如果我们查看Site Explorer（网站分析）工具中的Organic keywords（自然关键词）报告，我们就能发现：精选摘要 (Featured Snippet)给他提供了每月937个搜索流量，这几乎占了这个页面搜索流量的一半。注意. 获取精选摘要 (Featured Snippet)为并不容易，就像案例中的那样，我们至今都没有得到“SEO tips（SEO技巧）”的精选摘要 (Featured Snippet) 。想了解更多关于精选摘要 (Featured Snippet) 的信息？你可以查看我们针对2百万个精选摘要 (Featured Snippet) 的研究，以及如何找到并“偷取”它们。顺便提一句，在研究排名第一的页面时我们将精选摘要 (Featured Snippet) 的结果给排除了。回到你我很确定，我在本文中提到的大部分内容对于你来说都不陌生。但是有严谨的数据的支持这些观点会更好，不是吗？老实说，当我看到排名第一的页面获得最高搜索流量的比例只有49%时我的确吃了一惊，因为我的预期值比这个高很多。同样，我希望这个文章可以帮助你说服你的客户，或者是你的营销总监。作为一个专业的SEO人员并不仅仅是为了第一的排名，更多的是帮助公司获得更多的相关流量。大家可以在下方的评论中告诉我，你们是什么时候意识到SEO中排名第一并不是最终的目标的。我也很想听听你是否与客户或上司进行过这样的对话。 😉译者，Park Cheng，魔贝课凡联合创始人 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Tim Soulo Tim是Ahrefs的CMO以及产品顾问，同时他也是该公司最狂热的粉丝和最忠诚的传播者。",
  "headers": [
    {
      "level": "H1",
      "text": "谷歌排名第一不是最重要的（基于10万关键词的研究）"
    },
    {
      "level": "H2",
      "text": "偶然的发现：排名靠前的页面并不总能获得最多的搜索量"
    },
    {
      "level": "H2",
      "text": "研究：排名第一的页面搜索流量不是最多的概率"
    },
    {
      "level": "H2",
      "text": "总结：别老是纠结排名第一，把重点放在流量上"
    },
    {
      "level": "H3",
      "text": "1. 深入话题"
    },
    {
      "level": "H3",
      "text": "2. 针对你的话题打造一个“高权重”页面"
    },
    {
      "level": "H3",
      "text": "3. 明确搜索意图"
    },
    {
      "level": "H3",
      "text": "额外的内容：争取精选摘要 (Featured Snippet)"
    },
    {
      "level": "H2",
      "text": "回到你"
    }
  ],
  "author": "Tim Soulo"
}