{
  "url": "https://ahrefs.com/blog/zh/seed-keywords/",
  "slug": "seed-keywords",
  "title": "种子关键词：它们是什么以及寻找它们的7种可行方法",
  "description": "种子关键词是指你可以作为关键词研究过程中的起点，以用来解锁更多的关键词的词或短语。",
  "content": "Jake Sheridan Jake 是一位作家、营销人员和电子表格管理员，来自 Sheets for Marketers。 爱好狗、搜索引擎优化、以及比萨饼。 内容 事先说明，种子关键词并非是SEO成功的关键。但是，它们是良好的关键词研究的基础。花一点时间来开发一个好的种子关键词列表，往往能从关键词工具中获得更好的数据产出。在本指南中，你将学习到以下内容。什么是种子关键词它们为什么很重要7中寻找它们的可行方法如何创建种子关键词列表什么是种子关键词种子关键词是你可以用来作为关键词研究过程中的起点，以解锁更多的关键词的词或短语。可以把它们看作是关键词研究的基石。例如，如果你在网上销售咖啡，那么你可以使用种子关键词，如 coffee, espresso, cappuccino, French press, percolator 等。当你把这些种子关键词放入Ahrefs Keywords Explorer（关键词分析），并浏览关键词创意报告时，你会产生数以百万计的潜在关键词：在为你的网站确定了几个相关的种子关键词后，你可以在它们的基础上用修饰词来产生更多的关键词建议。但为什么要花时间制定一个好的种子清单呢？继续看。为什么种子关键词在关键词研究过程中很重要（附案例）简单说就是：输入越好，输出就越好。在建立关键词列表时也是如此。为了从 Ahrefs Keywords Explorer（关键词分析）（以及大多数SEO工具）中获得最大的收益，你需要有最好的输入值。识别种子关键词，也可以帮助你找到你可能不知道的新的子话题，从而建立起你的话题集合。种子关键词示例以下是我在种子关键词 “mountain bike” 中生成的关键词：在上面的例子中，Ahrefs从我的单一种子关键词生成了264,608个关键词。相当不错。但如果有更多的种子关键词，这可能会更好吗？这次让我们使用一个稍微丰富一点的种子关键词清单。[mountain bike][mountain biker][mountain biking][MTB][mountain bicycle][hardtail]然后再次运行同样的程序：这一次，Ahrefs产生了519,830个关键词。额外的255,222个关键词，我只是通过多输入几个种子关键词就做到了。如何寻找种子关键词（七种方法）很多关于关键词研究的文章都跳过了种子关键词，而选择了过程中更有趣和更有意义的部分。这些文章可能提供一些模糊的方法。例如：● 思考与你的产品/服务相关的术语● 探索相关术语（如长尾关键词）。● 看一下你的竞争对手的关键词这些方法并没有错。事实上，其中一些我将在本指南中介绍。但我认为我的观点仍然有效。在从零到形成完整的表格过程中，以上都是比较模糊的。因此，请尝试这些（希望不那么模糊的）种子关键词研究方法来代替：1. 思考你的目标关键词变体有时，最好的工具是你的大脑。为了寻找种子关键词，首先要创建一个你所研究的术语的明显变体和同义词的清单。这很重要，因为这是大多数关键词研究工具的工作方式。这里有一个例子。如果你把 “mountain bike” 放入 Ahrefs Keywords Explorer（关键词分析），那么你就不会看到复数 “mountain bikes” 的关键词建议。在寻找种子关键词的过程中，你还应该寻找其他行业术语。当你已经在 Keywords Explorer（关键词分析）中时，你应该切换 “Also talk about” 标签（在 Related terms 报告下）。这对寻找其他行业术语相当有用。它显示了当前排名靠前的网页所提到的关键词。挖掘行业术语的另一个简单方法是进入与你的主题最密切相关的维基百科页面。然后简单地将该网址放入Ahrefs Site Explorer（网站分析）。开始审查该网页的关键词排名，然后寻找潜在的种子关键词。我在关于话题集合的文章中详细介绍了这种方法，如果你想的话，可以去看看。根据这些方法，如果你在网上销售山地自行车，那么你很可能会集思广益，使用诸如以下的词汇和短语：[mountain bike][mountain biking][MTB][mountain bicycle]如果你对该利基市场一无所知，这些方法可能会有点困难。在这种情况下，你可能想查看一下竞争对手，以获得一些想法。2. 用 Site Explorer（网站分析）对竞争对手进行逆向工程如果你对这个行业不太熟悉，需要一些想法，可以看一下相关网站的关键词排名。当使用 Ahrefs Site Explorer（网站分析）来发掘种子词时，我主要使用 Organic keywords（自然关键字）报告和 Top pages（热门页面）报告。原因是：查看 Ahrefs 的自然关键词数据是识别潜在种子关键词的最快速方法之一。例如，假设我想研究 “beards” 这一主题。因此，首先，你要挑选一个与该主题相关的网站。在这个例子中，我们将选择 BeardBrand。如果我查一下它的自然关键词排名，我回看到 “mutton chops”，当我想到与 “beards” 有关的关键词时，并不会立即想到这个词：如果我只是在 Ahrefs Keywords Explorer（关键词分析）使用种子 “beards”，我可能会错过这个相关术语。继续以 “beards“为主题，并停留在 Organic keywords（自然关键词）报告中，我还将添加一个过滤器，删除任何包含 “beards” 一词的关键词：为什么要这样做？因为我想看到我可能错过的潜在关键词，而这是一个加速的好方法。使用这种方法有两个好处。你的竞争对手已经为你做了研究，加快了你的工作。当你没有想法的时候，你可以用Ahrefs来寻找更多的竞争对手。3. 看一下SERP（如 PAA 框和相关搜索）如果你的目标是在谷歌上获得排名，那么获得更多信息的最好地方是在SERP上。只需搜索你的种子关键词之一，并在页面上探寻灵感。你需要查看的有如下这些：People Also Ask （PAA 框）People Also Ask （PAA框）是谷歌SERP的一个功能。它们直接回答与搜索查询有关的问题。答案来自网页，由谷歌提供一个可点击的链接到来源。在寻找种子方面，你可以通过 PAA 框寻找重复出现的术语：Related searches（相关搜索）在SERP的底部，你会发现谷歌的 “相关搜索”，显示与你最初的关键词搜索相关的其他潜在搜索词：对于一些搜索，你甚至会得到一个相关品牌的列表，可能作为种子使用：网页标题和元描述每个SEO都知道（并且应该付诸实践），在页面标题中加入目标关键词。因此，标题标签可以成为种子关键词的一个重要来源：不要忽视查看元描述。这些也可以包含潜在的种子关键词：当然，如果你想更进一步，可以到这些页面上查看副标题，寻找更多潜在的种子词：专家提示在这里，博客文章通常比电子商务产品页面效果更好，因为它们更可能有多个富含关键词的副标题。4. 查看社区网站和论坛寻找种子关键词的最佳来源之一与你的受众有关。具体来说，你应该看一下他们在哪里上网。有些地方可以在网上寻找。● 博客评论 - 阅读行业相关帖子上留下的任何问题和评论● 社交媒体 - 阅读利基社交媒体群组中的帖子、评论和民意调查● 利基论坛 — 阅读人们在论坛中谈论/要求的内容● 在线社区 — 阅读在线社区的问题和评论，例如 Quora、Reddit● 帮助和支持 — 阅读帮助请求和客服工单（如果你有权限的话），甚至是文档和其他支持文件我喜欢关注 Reddit 和利基论坛（显然与我研究的主题有关）。下面，我会详细介绍利用这些来制定种子关键词清单的技巧。Reddit在做关键词研究时，Reddit 可以是一个金矿。它有一个庞大的（和多样化的）受众，你可以用它来确定话题的人群。例如，在 Reddit 搜索 “bbq”，你会得到一堆子帖子来探索：挑选一个子reddit，然后将URL放入Ahrefs Site Explorer（网站分析）。进入 Organic keywords （自然关键词）报告，看看是否有任何有价值的种子关键词：论坛随着 Facebook 群组、Slack 频道和其他在线社区的兴起，利基论坛已不再被广泛使用。然而，他们仍然可以是一个很好的关键词数据来源。流行的论坛，即使现在已经过时了，也会有一堆的排名页面，你可以去看看。要找到与利基相关的论坛，您可以使用这些（非常）简单的谷歌搜索运算符。[intitle:forum keyword] 或 [inurl:forum keyword] 。利用这些，我找到了这个徒步旅行论坛，这是另一个潜在的 “种子关键词 “来源。提取网址并通过 Site Explorer（网站分析）运行它。然后去看 Organic keywords（自然关键词）报告：5. 列出与你的关键词相关的产品/服务/品牌列出与你的关键词相关的产品或服务可以是一个非常简单的寻找种子关键词的方法。例子。对于苹果来说，这可以是 “iphone”、“ipad”、“mac “等。要找到与你的关键词相关的产品和服务，只需开始在谷歌上搜索并寻找具有相关产品的利基特定网站。然而，这种方法可能很容易，也可能很难，这取决于你对你所从事的利基市场的了解程度。但不要担心。这里有一些简单的方法来收集产品/服务/品牌：列表文章 — 谷歌搜索 [种子关键词] + “品牌”，记下列表文章中的品牌术语电子商务网站 — 进入像亚马逊这样的网站（或一个与细分市场相关的商店），并查看各方面的情况分销文章 — 谷歌搜索 “best” + [种子关键词]，看看分销的公司在推广什么产品比方说，我的搜索词是 [coffee “brands”]。一旦我有了一些品牌词，我就可以复制这些词，把它们粘贴到 Ahrefs Keywords Explorer（关键词分析）中，然后去查看 Matching terms（匹配词）报告：总的来说，从 18 个种子关键词中产生了 65177 个关键词。对于一个的30秒的工作来说，这个结果并不坏。6. 查看网站导航菜单看导航菜单效果很好（特别是对于电子商务网站）。例如，假设你正在为一家专注于乳清蛋白的在线健美商店做关键词研究。如果你查看一下该领域的大型电子商务商店的菜单，你会发现潜在的种子关键词：有时，“网站导航 “菜单可能对寻找种子术语没有帮助。在这些情况下，值得检查一下顶级的分类网页。这些往往列出了你要找的种子关键词。例如，如果我正在寻找山地自行车的种子，下面这个分类页面将是非常有用的：7. 查看 Google Search Console 中的术语如果你试图从你可以访问的网站（也就是你的网站或你的客户的网站）开发一个种子关键词列表，你可以也应该看看 Google Search Console（GSC）中的关键词。以下是方法。打开GSC，转到性能选择查询查看你正在排名的术语你也可以在这里使用 Ahrefs Webmaster Tools（Ahrefs 站长工具）。GSC显示你的网站排名前1000 位的关键词，而 AWT 则会显示所有已知的关键词。无论你选择使用哪种方法，你都应该寻找你正在排名但没有主动作为目标的关键词。然后你可以将这些因素纳入你的关键词研究计划，或者看看是否有机会找到更多的术语（将它们作为种子）。如何创建一个种子关键词列表把本文中列出的方法看作是自助餐菜单。你不需要每次做关键词研究时都使用所有这些方法。你只需使用几种方法，就可以得到足够的种子关键词。因此，只要挑选你喜欢的方法，并使其适应你的工作流程。一旦你确定了你喜欢的方法，是时候开始把它们拉到一起，创建一个列表。把种子关键词列表放在一起，然后用它来做关键词研究，可能是这样的。使用对你/你的利基市场有效的方法寻找种子关键词。将种子插入 Ahrefs Keywords Explorer（关键词分析），以生成一个想法清单。将你的关键词建议过滤成一个可用的列表。评估你的选择（根据相关性、意图、数量、难度等）。专家建议Ahrefs Keywords Explorer（关键词分析）可以一次处理10个种子关键词。因此，如果你有很多种子，你可能需要分批处理。最后建议大家建立一个种子关键词列表，为你在进行关键词研究时打下坚实的基础。种子关键词并不能替代关键词研究。但它们确实增加了你找到更多可用术语的机会。有关于制定种子列表或一般关键词研究的问题吗？推特我吧。译者，Park Cheng，歪猫出海创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human:",
  "headers": [
    {
      "level": "H1",
      "text": "种子关键词：它们是什么以及寻找它们的7种可行方法"
    },
    {
      "level": "H2",
      "text": "什么是种子关键词"
    },
    {
      "level": "H2",
      "text": "为什么种子关键词在关键词研究过程中很重要（附案例）"
    },
    {
      "level": "H3",
      "text": "种子关键词示例"
    },
    {
      "level": "H2",
      "text": "如何寻找种子关键词（七种方法）"
    },
    {
      "level": "H3",
      "text": "1. 思考你的目标关键词变体"
    },
    {
      "level": "H3",
      "text": "2. 用 Site Explorer（网站分析）对竞争对手进行逆向工程"
    },
    {
      "level": "H3",
      "text": "3. 看一下SERP（如 PAA 框和相关搜索）"
    },
    {
      "level": "H4",
      "text": "People Also Ask （PAA 框）"
    },
    {
      "level": "H4",
      "text": "Related searches（相关搜索）"
    },
    {
      "level": "H4",
      "text": "网页标题和元描述"
    },
    {
      "level": "H3",
      "text": "4. 查看社区网站和论坛"
    },
    {
      "level": "H4",
      "text": "Reddit"
    },
    {
      "level": "H4",
      "text": "论坛"
    },
    {
      "level": "H3",
      "text": "5. 列出与你的关键词相关的产品/服务/品牌"
    },
    {
      "level": "H3",
      "text": "6. 查看网站导航菜单"
    },
    {
      "level": "H3",
      "text": ""
    },
    {
      "level": "H3",
      "text": "7. 查看 Google Search Console 中的术语"
    },
    {
      "level": "H2",
      "text": "如何创建一个种子关键词列表"
    },
    {
      "level": "H2",
      "text": "最后"
    }
  ],
  "author": "Jake Sheridan"
}