{
  "url": "https://ahrefs.com/blog/zh/seo-consultant/",
  "slug": "seo-consultant",
  "title": "雇佣 SEO 顾问? 问这9个重要问题",
  "description": "搜索引擎优化顾问的工作是创建和管理搜索引擎优化任务，以改善网站在搜索引擎的表现。学会找到正确的顾问。",
  "content": "Michal Pecánek Ahrefs的营销专家和内容创作者。 沉迷于SEO，航空，香氛，寿司和墨西哥玉米卷。 内容 搜索引擎优化顾问的工作是创建和管理搜索引擎优化任务，以改善网站在搜索引擎的表现。所有这些最终都会增加公司的收入。聘请一个非常棒的搜索引擎优化顾问可以让你的业务飞速增长，因为自然搜索是许多网站的主要流量来源。或者，一个错误的雇佣可能会造成很多伤害，而这些伤害可能需要很长时间才能修复。那么，怎样才能把小麦和谷壳分开呢？问候选人以下9个问题，以做出正确的招聘决定:你的成功记录是什么？你最擅长做什么？你的工作对我的生意有多大影响？你能保证你的 SEO 工作的结果吗？你对 Google 的搜索引擎优化指南有什么看法？你使用什么 SEO 工具，以及如何使用它们？你的 SEO 报告是什么样的？你的定价？当我们分道扬镳时，你怎样交接工作？让我们深入研究每一个问题，这样你就会知道应聘者的答案中应该寻找什么。你过去的成功记录是什么？有三种方法可以让你遇到一个搜索引擎优化顾问:你会得到一份推荐信。你会因为他们的在线和离线而熟悉他们。他们向你伸出手，提供他们的服务。如果这是第一种情况，并且你真的信任推荐这个顾问的人，那么你可以跳过本文中的大部分限定性问题。然而，对于第二种和第三种情况，你应该首先关注应聘者的成功记录。这有时候是很棘手的，因为人们通常会以最好的方式展现自己。那么，什么是棘手的呢？让我们看一个例子。去年，我被邀请为四大会计师事务所之一领导一个 SEO 研讨会。如果我接受了，我会把它的标志放在我的网站上，并声称公司是我的客户。这在技术上是正确的，但也有点欺骗(关于我的搜索引擎优化咨询经验)。任何搜索引擎优化顾问应该能够披露一些网站，他们正在工作。大多数咨询顾问在他们的网站上列出了一些客户。但是这些信息之后并不经常出现反映咨询师业绩的证明书或案例研究。如果你丢失了这些信息，你仍然可以在联系他们之前得到它。你可以打开 Ahrefs 的网站分析，插入其中一个网站，查看概览中的自然流量图:如果你看到一个上升趋势，那么这是一个好的第一个迹象。但是当你联系到顾问的时候，一定要和他们讨论一些案例。他们可以告诉你他们为某个客户工作的时期，甚至提供图表和数字，任何人都可以查阅数据。有时候，你不会看到太多的成长，或者可能在其他方面质疑性能。让顾问证明他们的结果。搜索引擎优化是一个长期的游戏，你很少看到任何重大变化的自然流量在最初个月的合作。你最擅长做什么？没有放之四海而皆准的搜索引擎优化顾问。相反，试着找到最适合你的企业。例如，我拒绝所有的电子商务提供。电子商务搜索引擎优化本身就是一个分类。我从来没有这样做过，而且还有许多其他顾问可以以更低的价格做得更好。我一直为 SaaS 公司工作，这也是我能提供最大价值的地方。除了市场营销的一般知识，一个 SEO 顾问应该在所有的 SEO 纪律(on-page，off-page，和 technical)良好。然而，很少有人能够成为所有这些方面的专家，这是没有必要的。有些顾问专注于一个领域，如链接建设或技术搜索引擎优化。他们加倍发挥自己的优势，提供利基服务。这是件好事。这个问题只是帮助双方理解你的需求和他们的关注点、知识和专业技能之间是否有很好的匹配。你的工作对我的生意有多大影响？有几个因素可以用来评估 SEO 对你的业务的潜在影响: 自然流量潜力 - 在你的商业类别中有很高的搜索需求吗？ 营销策略 — 在其他营销渠道中，自然搜索应该占多大优先级？ 开发人员资源 — 您的开发人员是否有空间及时实现所需的更改？ 内容创造者资源 — 你有一个团队生产搜索引擎优化内容？如果没有，你有足够的预算雇佣自由职业者吗？ 链接建设者/公关资源 — 你有一个链接建设者和/或公关专家？如果没有，你能雇得起他们吗？一个好的顾问在被问及他们工作的潜在影响时，应该评估所有这些因素。需要明确的是，不要指望顾问在这个阶段给你任何数字。现在，你的目标是达成一个协议，投资 SEO 是正确的选择。你能保证你的 SEO 工作的结果吗？如果有搜索引擎优化顾问保证他们的工作会让你的自然流量飙升的话，是的，这是一个破坏者。不管一个 SEO 顾问有多好，他们都不能保证在 SEO 上有任何结果。这其中涉及到太多的变量(排名因素)。是的，你雇佣某个人是为了产生积极的影响，而且一个好的顾问很有可能很快就会得到回报。但是这并不是100% ，而且你经常要等上好几个月才能看到任何积极的结果。这是另一个例子。我参与了一个网站的咨询工作。尽管谷歌一直拥有优秀的搜索引擎优化顾问，但由于受到谷歌算法更新的严重打击，谷歌并没有回到正轨。我发现了一些新的机会，并帮助解决了一些问题。但我不能把这些努力归功于任何成功，因为自然流量趋势再次看起来好转还需要6个月的时间:一个极端的例子，一个网站，是由伟大的 SEO 顾问管理，但看到它的自然流量改善后，很长一段时间。Ahrefs 网站分析 2.0报告的屏幕截图顺便说一下，在另一个算法更新后，流量激增。我们搜索引擎优化顾问做了很好的工作。只是花了很长时间，结果才显现出来(这次差不多花了两年时间)。你对 Google 的搜索引擎优化指南有什么看法？没有正确的答案。但是倾向于极端(按照谷歌的方式做所有事情/什么都不做)应该谨慎对待。在过去的几年里，Google 在 SEO 推荐和文档方面做得更好。然而，每一个优秀的搜索引擎优化都不同意谷歌的指导方针。有些人比其他人更喜欢。例如，谷歌的声明和搜索引擎优化之间的主要分歧是 链接建设。在实践中建立链接和谷歌的建议有时是完全相反的两种方法。一个好的迹象是听到一些例子，其中顾问不同意谷歌和为什么。你使用什么 SEO 工具，以及如何使用它们？每一个优秀的 SEO 顾问都需要使用三种领先的一体化 SEO 工具: Ahrefs, Semrush, 或 Moz 。听听这些品牌中的一个就是一个很好的开始。使用谷歌搜索控制台和谷歌分析是理所当然的。然而，获得最好的搜索引擎优化工具仅仅是开始。让顾问告诉你一些他们的流程。他们如何审计一个网站？他们如何找到链接建设的机会？那么关键词研究呢？在使用这些工具时，可能会有无数正确或错误的答案。如果你不是搜索引擎优化专家，你就无法评判他们。但无论答案是什么，他们都应该建立更多的自信和融洽。你的 SEO 报告是什么样的？根据他们的 SEO 报告，你可以很容易地分辨出一个好的 SEO 顾问和一个坏的 SEO 顾问。如果他们提供了一个例子报告，这里是你应该注意的。一份好的报告应该简明扼要，并且容易阅读，你也应该在几分钟内就能理解其中的要点。下面是从我的 SEO 报告模板 中选取的一张好的幻灯片的例子::但由于保密协议和敏感数据，大多数咨询顾问不会向你发送其他客户的报告。在这里，询问他们的 SEO 报告流程是第二好的选择。在这里特别要找什么？那么，看看他们是否谈论 SEO 关键绩效指标，以及他们如何接近这些指标。这完全暴露了你的身份。你想了解与你的业务增长相关的指标。这些是，最普遍的，自然转换和语音(搜索可见性)的份额。注意，自然流量增长本身不应该是一个关键绩效指标，除非你使用展示广告网络将你所有的网站流量货币化。小提示.我在这里谈论的只适用于雇佣某人为全面搜索引擎优化咨询。如果你雇佣一个链接建设者或技术搜索引擎优化，那么他们可能不能把他们的任何指标直接与你的业务增长联系起来。另一个关键的事情是数据源的组合。每个优秀的 SEO 顾问都应该通过结合谷歌搜索控制台、谷歌分析(或其他选择)以及像 Ahrefs 这样的独立 SEO 工具集的指标来创建报告。这是因为每个工具都有其独特的数据。另外，一些度量标准在一种工具中比另一种工具更加准确。延伸阅读窃取我们的 SEO 报告模板(灵感来自 SEO 专家)跟踪这3个 SEO 关键绩效指标，做出更好的营销决策搜索引擎优化的10个重要指标(其中4个不重要)你的定价？最好尽快估计一下价格，这样双方都不会浪费时间。一些咨询顾问公开披露他们的收费标准，但是你总是需要针对自己的具体需求提供报价。你大多会遇到三种定价方式: 时薪 - 这是最直接的定价模式。这是捷克共和国(我住的地方)最常见的一种。但是根据我的观察，它在西方并不流行。 项目为基础的定价 - 这是最有可能被使用，如果你需要在某一特定领域的 SEO 帮助为一个较短的时间。 每月聘用 - 这是流行的长期合作。你们同意顾问每个月为你的企业提供一段时间，以及这段时间的费用。一些咨询顾问使用全部三种定价模式，而另一些则坚持只使用一种。你还应该谈谈最低合同期限和付款条件。搜索引擎优化可以是一个有利可图的职业，所以期望最好的顾问是相当昂贵的。最重要的是，需求很可能高于他们所能满足的，所以一些顾问对新客户很挑剔。当然，根据国家的不同，价格也会有很大的不同。在美国(和其他搜索引擎优化购买力平价高的国家) ，你应该预计每小时至少支付100美元才能得到一个可靠的搜索引擎优化顾问。为了雇佣最好的英语顾问，你可以预期收取每小时200美元以上的费用。推荐阅读: SEO 定价: ~ 350个机构，顾问和自由职业者揭示 SEO 成本当我们分道扬镳时，你怎样交接工作？你不会永远和你的顾问一起工作。任何咨询顾问都应该尽最大努力交出自己的工作，并确保在你雇佣新员工时，能够很容易地进行过渡。你需要确定你的顾问会这么做。事实上，任何一个好的咨询师在开始与你合作的时候都应该问你的第一件事情就是你的 SEO 历史。已经有人做过关键词研究了吗？是否有内容计划？一个包含 SEO 技术问题和机会状态的列表怎么样？链接潜在客户和外联名单？你过去的报告是什么样的？已经做了什么，为什么？你看，你可以向你的新顾问提供大量的信息和数据，这样可以节省时间和金钱。它也可以揭示潜在的问题，可能会阻碍你的搜索引擎优化表现。专家提示确保您拥有自己的数据，不要授予组织外人员管理权限。我听说过一些恐怖的故事，有些顾问，甚至有些机构创建或者超越了谷歌分析和谷歌搜索控制台账户，然后拒绝交出访问权限。最后的想法如果你自己不熟悉 SEO，那么判断一个有潜力的 SEO 顾问的专业性并不容易。但是你可以根据上面的九个问题来评估他们的沟通技巧。如果他们不能很容易地解释 SEO 的事情，只是说“这要看情况”而不是更多的细节，或者给出一些感觉不对的模棱两可的答案，你可能最好还是雇佣其他人。那么，你从哪里找到最好的咨询师呢？使用谷歌可能很有诱惑力，因为排名在前肯定意味着它在搜索引擎优化方面很出色，对吧？是的，但是你会错过一些潜在的更好的选择。毕竟，优秀的咨询顾问要比排名靠前的搜索结果多得多。我建议你去问问以前雇佣过 SEO 顾问的人，你的社交圈，或者 SEO 专家。即使你不是为了搜索引擎优化咨询而雇佣他们，他们也可以给你一些建议。还有什么问题吗? 或者有更多关于搜索引擎优化顾问的建议吗。在 推特 上联系我。译者，John Zhao，西品东来创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Michal Pecánek Ahrefs的营销专家和内容创作者。 沉迷于SEO，航空，香氛，寿司和墨西哥玉米卷。",
  "headers": [
    {
      "level": "H1",
      "text": "雇佣 SEO 顾问? 问这9个重要问题"
    },
    {
      "level": "H2",
      "text": "你过去的成功记录是什么？"
    },
    {
      "level": "H2",
      "text": "你最擅长做什么？"
    },
    {
      "level": "H2",
      "text": "你的工作对我的生意有多大影响？"
    },
    {
      "level": "H2",
      "text": "你能保证你的 SEO 工作的结果吗？"
    },
    {
      "level": "H2",
      "text": "你对 Google 的搜索引擎优化指南有什么看法？"
    },
    {
      "level": "H2",
      "text": "你使用什么 SEO 工具，以及如何使用它们？"
    },
    {
      "level": "H2",
      "text": "你的 SEO 报告是什么样的？"
    },
    {
      "level": "H2",
      "text": "你的定价？"
    },
    {
      "level": "H2",
      "text": "当我们分道扬镳时，你怎样交接工作？"
    },
    {
      "level": "H2",
      "text": "最后的想法"
    }
  ],
  "author": "Michal Pecánek"
}