{
  "url": "https://ahrefs.com/blog/zh/seo-friendly-urls/",
  "slug": "seo-friendly-urls",
  "title": "如何创建对SEO友好的URL(分步指南)",
  "description": "学习如何在几分钟内创建对SEO友好的URL",
  "content": "Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。 内容 谷歌在其SEO新手指南中讨论了使用简单，友好的URL的重要性，但是您该怎么做?让我们从好消息开始:为SEO创建url并不是一门高深的科学。但是您肯定不希望在黑暗中摸索，如果你想用几个词来描述你的页面，并用连字符代替空格，这对SEO来说通常是“足够好了”。下面，我们将用一个实例讲解创建优化的URL的简单过程，以及URL其余部分的一些最佳做法。但首先，让我们确保了解url是如何构造的。URL的剖析URL由许多部分组成。对于SEO来说，最重要的部分可以说是“slug”。每次创建页面或发帖时，你都必须选择其中之一。因此让我们从这里开始，然后我们将介绍其余URL的一些SEO最佳实践。如何创建SEO友好的URL更改现有的URL Slug几乎没有什么意义，因为它需要花费太多时间，也可能弊大于利。因此，让我们专注于新文章和页面。如果您进行了关键字研究 并围绕该关键字创建了内容，请跳至步骤6。如果创建页面时没有进行关键字研究（如果你想排名的话，这绝不是一个好主意），请按顺序执行以下步骤。从页面标题开始删除特殊字符删除数字删除多余的信息把它缩短为关键字添加关键字修饰符（可选）增加可读性（可选）使用小写用连字符替换空格1. 从页面标题开始大多数页面标题都经过了一些修改，从而使URL达到了完美优化的状态。因此，让我们从这里开始并执行一系列步骤，以获取SEO最好的URL。就本文而言，我们将使用自己的一篇标题为：How to Craft the Perfect SEO Title Tag (Our 4-Step Process)2. 删除特殊字符您是否见过带有反斜杠（）或方括号（[ ]）的URL？可能没有见过，因为这些不安全字符不属于url。很明显，您应该删除这些字符，但最好还是删除其它特殊字符，如逗号、冒号、分号等。以下是Google的John Mueller 所说的话：我通常建议避免在URL中使用特殊字符，例如逗号，分号，冒号，空格，引号等，以使事情变得简单。这样的URL通常很难自动链接（当有人在论坛或其它地方发帖时），并且当我们解析文本内容以尝试查找新的URL时，我们很难正确识别这些URL。因此，让我们删除所有不在字母表中的字符-尽管我们暂时保留空格。How to Craft the Perfect SEO Title Tag Our 4 Step Process3. 删除数字您会注意到，我们的文章是一个四步过程，标题中显示了该数字。这是完全可以的，因为标题很容易更改。如果我们有一天更新帖子并添加第五步，则可以轻松更改页面标题。对于url，情况就不一样了。每当您更改页面或发布中的项目数以使其保持最新状态时，都必须重定向到新的URL。重定向文章URL通常没什么大不了的。当你改变slug时WordPress会自动执行。但是，当你更新的时候，很容易忘记更新URL的数字，这就导致了搜索结果中的这种问题:更好的解决方案是完全否定URL中的数字。这样，当您对页面进行细微更改时，您将不必更新URL。因此，让我们从潜在的网址中删除数字：How to Craft the Perfect SEO Title Tag Our Process4. 删除多余的信息谷歌表示，使URL尽可能简单是一种很好的做法，这可能有两个原因。首先，访问者可能会被超长URL吓倒。其次，长URL通常在搜索结果中被截断因此，让我们从潜在的URL中删除不需要的所有内容。请注意，这部分您必须使用您的专业知识。目的不是使您的URL太短以至于不能再准确地描述其内容。这是删除不必要的单词和短语。在我们的案例中，这可能就是方括号中的所有内容（“我们的[4步]过程”）How to Craft the Perfect SEO Title Tag5. 缩短为关键词多数标题自然包含关键字，所以在这个阶段，您可能只剩下一个简化的、丰富关键字的标题版本。虽然这样使用起来很有合理(如果是这样的话，可以随意使用)，但它通常不是很简洁。正如我们已经讨论过的，这可能导致长url在搜索结果中被截断。如果您希望更新页面，那么附加新的内容也会成为一个问题。例如，我们有一个关于slug /basic-guide-anchor-text/的帖子。当我们更新这篇文章时，我们增加了很多信息。这使得指南变得不那么基本了，我们不得不将它重定向到一个更合适的slug。因此，下一步是找到代表人们搜索页面主题的最流行的关键词。为此，请安装并激活AhrefsSEO工具栏，然后搜索您的潜在URL。在结果中查找与您的页面相似的页面，该页面还会获得可观的自然流量。重要提示如果搜索结果中的页面没有获得流量，那么您的页面很可能是关于一个没有潜在搜索流量的主题。因为没有人会搜索你的页面内容，所以无论你如何优化URL，都很难获得自然流量。为了避免这种错误，你可以提前做关键词研究。点击“KW”链接，看看在Ahrefs网站分析中，这个页面的关键词排名是什么。在列表中查找与您的内容最相关的关键字。如果我们在关于标题标签的帖子中这样做，则可能是：title tag6. 添加关键字修饰词（可选）使用一个精确匹配的关键字在您的URL Slug通常是有意义的，但有时你会发现它缺乏描述性。解决这个问题的一个简单方法是添加关键字修饰词。关键字修饰词是为你的URL添加上下文的相关词。您可以在我们在上一步中使用的自然排名关键词报告中找到它们。例如，如果我们查看关于标题标签的竞争页面的报告，我们会看到“seo”和“html”多次弹出。在我们的URL中包含其中一个或两个都是有意义的。您的操作方式没有严格的规定。通常情况下例如，以下任何URL均可用于我们的文章：SEO title tag HTML title tag title tag SEO HTML title tag SEO只是不要像这样堆砌关键字：HTML meta title tag SEO这是我为我们的文章选择的一个：title tag SEO7. 使其可读（可选）也许只有我这么认为，但有些url似乎比其他的更容易理解。以上面的想法为例。我认为/seo-title-tag/比/html-title-tag-seo/更有意义。为什么?我认为这是因为前者在一个句子中是有意义的，而后者只是一串随机的单词。因此，我经常尝试通过添加连词或复数使url可读。对于我们关于标题标签的文章，我没有这样做是因为“title tag seo”读起来更好。然而，对于我们关于最好的WordPress SEO插件的文章，最合适的关键词是“最好的WordPress SEO插件”。这听起来很奇怪，所以我把“plugin”变成复数，并加上了连词“for”。如您所见，URL仍然简短而甜美，但阅读起来自然得多。8. 使用小写字母大多数Web服务器将小写和大写URL都相同，但这并非总是如此。从技术上讲URL中主机名（域）之后的所有内容均区分大小写，并且某些服务器将对它们进行区别对待。为了安全起见并避免潜在的重复内容问题，请始终使用小写网址。如果您使用的是WordPress，则可以跳过此部分，因为它会自动改为小写。如果没有，只需将标题粘贴到convertcase.net并选择小写即可。title tag seo9. 用连字符替换空格URL中不能包含空格。浏览器会将它们重写为“％20”。因此，最后一步是用连字符（-）替换所有空格。您可以改用下划线（_）吗？Google在2016年表示，他们不在乎您的网址是否包含破折号或连字符。从排名的角度来看，这仍然是正确的，但是由于人们通常对连字符更加熟悉，因此在可能的情况下使用它们是有意义的。这也是Google的官方建议：我们建议您在URL中使用连字符（-）而不是下划线（_）。这是我们有关标题标签的文章的最终Slug：title-tag-seo网址中其它部分的最佳做法在本指南的前面，我们讨论了URL的结构。上面的过程仅涉及一个部分：Slug。因此，以下是URL其余部分的一些SEO最佳做法。采用HTTPS仅在需要时才使用子域名选择一个容易记住的域名选择合适的顶级域名使用子目录提供层次结构根据需要使用多个子目录避免重复关键词避免使用日期尽可能避免使用网址参数使用HTTPSHTTPS加密站点访问者和Web服务器之间发送的数据。自2014年以来，它一直是轻量级排名因素。因此，如果您尚未使用HTTPS，那么绝对值得进行切换。推荐阅读: 什么是HTTPS，你需要知道一切仅在需要时才使用子域名子域名出现在域名之前。它们通常用于根据其功能来分隔网站的不同区域。例如，Hubspot的博客位于子域名中。Google表示，他们将子域名上的内容与其他任何内容一样对待，对子域名进行排名不比子目录难。https://www.youtube.com/watch?v=uJGDyAN9g‑g但是，许多SEO优化人员持有不同意见，并且有许多报道将内容从子域名移动到子目录后流量增加的情况。15) Moving from subdomain to subfolder still works a treat in 2020 pic.twitter.com/e2M7W8OJon— 🦠 Jon Hogg (@ItsHogg) April 21, 2020I think @randfish will like a graph like this ⬇️. Results of moving a blog from subdomain to subfolder… pic.twitter.com/ACQOVpY0H0— Gianluca Fiorelli at 🏠 (@gfiorelli1) March 10, 2017没有人知道为什么会这样，但是SEO的共同理论是Google有时会将子域名视为单独的网站。因此，我们的建议是除非绝对必要，否则不要使用子域名。选择一个让人容易记住的域名如果你的网站还在早期阶段，还没有选择域名，不要担心得不到一个丰富的关键字或精确匹配的域名。选择那些令人难忘的、有品牌价值的东西作为域名。以下是谷歌的John Mueller对关键词域名的评论:…仅仅因为关键字在域名中并不意味着它会自动为这些关键字排名。很长一段时间以来，情况就是如此。选择适合的顶级域名如果要吸引全球流量，请选择通用顶级域名，例如.com。从SEO的角度来看，Google对所有顶级域名都一视同仁，但.com通常是最好的。.biz，.info和.name等顶级域名通常与垃圾网站相关联，因此选择其中之一可能会影响您建立高质量链接。如果要在特定位置定位客户，请使用顶级域名中国家/地区代码顶级域名（ccTLD），例如.co.uk或.fr。小提示. .com之类的顶级域名同样也可以在定位特定位置的客户使用使用子目录提供层次结构子目录有助于提供层次感，并提供有用的额外信息。例如，使用以下URL：domain.com/airpods.html从URL尚不清楚页面是否在出售AirPods，提供AirPods评论或其它产品。现在来看这个：domain.com/store/earbuds/apple/airpods.html显然，这是销售AirPods的产品页面的URL。这个子目录结构还可以清楚地表明：耳塞只是在线商店提供的产品类型之一。苹果公司生产这款产品，并且该品牌还可能有其它耳塞出售。商店中可能还会有其它品牌的耳塞待售。使用子目录可以更轻松地将关键字合并到URL中，而不会让URL像垃圾链接。垃圾链接: domain.com/buy-apple-airpods-earbuds.html 友好的链接: domain.com/store/earbuds/apple/airpods.html根据需要使用多个子文件夹许多SEO认为URL中的子文件夹过多会损害排名。但是，谷歌在很多场合都说这不是事实。No, as long as the URLs work and are linked consistently, that should be fine.— Google Webmasters (@googlewmc) January 5, 2018也就是说，由于大多数现代CMS的工作方式，在一个URL中有很多子文件夹通常意味着一个页面“隐藏”在站点架构中。如果您希望用户(和搜索引擎)能够找到该页面，那么这并不理想。如果您怀疑这可能是您网站上的问题，请不要依赖子目录的数量来进行证明。取而代之的是，使用Ahrefs网站诊断之类的工具对您的网站进行爬网， 并查找深层页面。您可以在“页面分析”中使用这组过滤器来执行此操作：避免重复关键词URL中重复的​​关键字使它们看起来很垃圾。在创建URL链接时通常很容易避免这种情况，但是在使用子目录时很容易犯这个错误。例如查看此页面的URL：myer.com.au/c/men/mens-shoes/mens-sneakers它重复了“men”一词三遍。虽然这不是什么大问题，但重复是不必要的。这可能会更好：myer.com.au/c/men/shoes/sneakers避免出现日期主流的的CMS（例如WordPress）默认情况下，至少文章会使用带日期的URL。如果您曾经更新了内容，可能会导致一些问题，例如Google可能会在搜索结果中显示一些矛盾的信息。现在，如果您的网站是这样设置的，并且您已经发布了内容，请不要进行任何更改。改动您的网站的风险太大。但是，如果您要使用WordPress设置新站点，则此问题的简单解决方案是在发布任何内容之前更改永久链接设置。尽可能避免使用特殊网址参数URL参数的问号（？）通常会出现的URL的后面。这些在带有多项导航和排序选项的电子商务网站上很常见，但是除非绝对必要，否则最好避免在可索引页面上使用它们。为什么？因为它们可能导致重复的内容问题。这个可以通过多个URL访问相同或相似内容的地方。在电子商务网站上，这可能是同一产品，但颜色或款式不同。例如，在页面内容保持不变的情况下，查看URL在这里如何发生变化：如果您的网站上发生这种情况， 有重复和相似的网址请确保使用权威内容标签来告诉搜索引擎。您可以在Ahrefs的网站诊断中的报告下的重复内容找到您网站上的重复内容问题。总结虽然花太多时间创建对SEO友好的URL并不值得，但采用合乎逻辑的方法并遵循最佳实践指南当然是有意义的。另外一旦你做了几次，上面的过程只需花费几秒钟或几分钟。如果您有任何疑问或意见，请随时在Twitter上@我。译者, 老张，ilaozhang博主 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。",
  "headers": [
    {
      "level": "H1",
      "text": "如何创建对SEO友好的URL(分步指南)"
    },
    {
      "level": "H2",
      "text": "URL的剖析"
    },
    {
      "level": "H2",
      "text": "如何创建SEO友好的URL"
    },
    {
      "level": "H3",
      "text": "1. 从页面标题开始"
    },
    {
      "level": "H3",
      "text": "2. 删除特殊字符"
    },
    {
      "level": "H3",
      "text": "3. 删除数字"
    },
    {
      "level": "H3",
      "text": "4. 删除多余的信息"
    },
    {
      "level": "H3",
      "text": "5. 缩短为关键词"
    },
    {
      "level": "H3",
      "text": "6. 添加关键字修饰词（可选）"
    },
    {
      "level": "H3",
      "text": "7. 使其可读（可选）"
    },
    {
      "level": "H3",
      "text": "8. 使用小写字母"
    },
    {
      "level": "H3",
      "text": "9. 用连字符替换空格"
    },
    {
      "level": "H2",
      "text": "网址中其它部分的最佳做法"
    },
    {
      "level": "H3",
      "text": "使用HTTPS"
    },
    {
      "level": "H3",
      "text": "仅在需要时才使用子域名"
    },
    {
      "level": "H3",
      "text": "选择一个让人容易记住的域名"
    },
    {
      "level": "H3",
      "text": "选择适合的顶级域名"
    },
    {
      "level": "H3",
      "text": "使用子目录提供层次结构"
    },
    {
      "level": "H3",
      "text": "根据需要使用多个子文件夹"
    },
    {
      "level": "H3",
      "text": "避免重复关键词"
    },
    {
      "level": "H3",
      "text": "避免出现日期"
    },
    {
      "level": "H3",
      "text": "尽可能避免使用特殊网址参数"
    },
    {
      "level": "H2",
      "text": "总结"
    }
  ],
  "author": "Joshua Hardwick"
}