{
  "url": "https://ahrefs.com/blog/zh/seo-report-template/",
  "slug": "seo-report-template",
  "title": "窃取我们的 SEO 报告模板(灵感来自 SEO 专家)",
  "description": "不确定怎样创建一个完美的SEO报告吗？窃取我们的SEO报告模板，并且一步步把它做得比我们更好。",
  "content": "Michal Pecánek Ahrefs的营销专家和内容创作者。 沉迷于SEO，航空，香氛，寿司和墨西哥玉米卷。 内容 你如何立即区分一个好的 SEO 和一个坏的 SEO？看看他们的 SEO 报告。 糟糕的搜索引擎优化报告-客户迷失在无意义的数据，不知道做了什么工作，没有得到深刻的评论。 好的搜索引擎优化报告-客户看到关键的数据总结和易于理解的见解和概述的工作完成。我已经看到许多来自顾问、内部团队和机构的 SEO 报告。我和来自 Ahrefs Insider 社区的专家讨论了这些问题。结论是什么？在不了解客户、他们的业务和你在项目中的职责的情况下，你不能创建一个包含所有必要信息的 SEO 报告模板。但是我在这里为你准备的将会让你尽可能接近一个完美的 SEO 报告。这就是为什么我开始和专家讨论 SEO 报告的主要原因。在窃取我们的搜索引擎优化报告模板之前，让我们先学习以下内容:搜索引擎优化报告是什么搜索引擎优化报告应该包含什么创建一个需要多长时间让我们开始吧。搜索引擎优化报告是什么一份 SEO 报告是反映业务增长、搜索引擎性能、外链组合强度和网站健康的重要 SEO 指标的概述。它是你的客户、经理或老板追踪你工作进展及其影响的主要资源。毕竟，这些利益相关者希望看到他们的钱花在你身上是值得的。虽然你不可能每个月都在 SEO 上获得成功，但是一份有效的 SEO 报告仍然应该表明你的工作可能会带来长期的积极投资回报。这很好地引导我们..。搜索引擎优化报告应该包含什么？什么和如何报告你的 SEO 努力，取决于你如何设置你客户的期望。虽然 SEO 报告依赖于客户的业务类型，但这是每个人通常都希望看到的: SEO KPI-评估与收入增长密切相关的 SEO 指标。 排名进展-看看排名的最重要的关键字已经改变。 自然流量进度-检查前两个方面如何转化为绝对流量数字。 外链增长-查看新的，有价值的参考网页，驱动流量和/或通过链接权益。 SEO 健康-知道，从技术 SEO 的角度来看，网站做得很好。但是，你的工作并不仅仅是把一堆度量数据转储到一个文档中。你需要解释你的搜索引擎优化报告，应该尽可能以最简洁和连贯的方式传达你的工作结果。这也是我们制作模板的方式。现在让我们回到你和你的客户之间的期望。报告应该主要包含你以前讨论过的内容。如果你在没有事先教育客户的情况下发送了一份 SEO 报告，你会收到很多问题和要求来显示更多的数据。即使搜索引擎优化报告是完美的。那是因为你是 SEO 专家，而不是客户。在我们稍后浏览幻灯片时，我将解释所有使用过的指标和数据。但是我也强烈建议你看看我们关于 SEO KPIs 和 SEO真正重要的衡量标准的文章，这些都很重要。这些会帮助你和你的客户达成共识创建报告需要多长时间？根据我所听到的，SEO 人员可以每个月花30分钟到几个小时在每个 SEO 报告上。这取决于几个因素:你在项目中的责任项目的复杂性你的 SEO 经验和知识你的数据分析经验和知识你和你的客户喜欢的报告格式让我详细说明最后一点。看起来大多数 seo 们更喜欢使用老旧的 pdf 文件和甲板来进行报告:SEO Reporting Polls for upcoming article/presentation (Please RT) 👇 1) What format do you use for your recurrent SEO reports to non-technical clients/boss/decision makers?…— Aleyda Solis 🕊️ (@aleyda) November 12, 2021我们的 SEO 报告模板也是一个甲板格式，因为它是最容易使用和阅读的每个人。缺点是你必须每个月检查新的数据，并手动将它们组合在一起。一些经验丰富的市场营销人员更喜欢使用自动化数据仪表板，比如 Google Data Studio、 Tableau 或者 Power BI。这些可能会花费你大量的时间来建立初始化。但是他们可以自动更新所有的数据，从长远来看可以节省你的时间。如果你想知道这个选项，我们将很快发布 Ahrefs 的 GDS 连接器来帮助你。但是回到实际的模板..。窃取我们的 SEO 报告模板(并使其更好)正如前面解释的，我们的 SEO 报告模板(或任何其他)不是一个万能的解决方案。这只是一个很好的起点，创建一个 SEO 报告，你的客户将欣赏。从开始到结束，你需要下面的工具:谷歌幻灯片Ahrefs谷歌搜索控制台 谷歌分析 ((或替代品)) Skitch (或者一个类似的截图编辑应用程序)准备好了吗？点击这里制作一个 SEO 报告模板的副本。你可以改变你客户的品牌颜色的配色方案，给它一点你自己的品牌，使它看起来更时髦，无论你喜欢什么。在我们开始解释每张幻灯片背后的原理之前，让我强调一些事情。首先，你可以根据客户的需要以及你提供的服务自由定制幻灯片。我们已经做了这个报告，以涵盖所有 SEO 领域的每月报告。其次，你做 SEO 的业务类型也应该反映在报告的调整中。如果你在做 本地搜索引擎优化，你可能会包括本地排名和本地搜索引擎优化功能的概述。电子商务客户？你可能希望包括来自自然流量的平均订单价值，并更深入地了解技术方面的东西。最后，请记住，模板包含的大多是虚构的数据、洞察力和场景。不要试图分析它的内容。相反，用它的结构作为指导。我们开始吧。1. 头衔卡片第一张幻灯片是最容易创建的部分。添加报告的日期/月份、你自己的徽标以及客户的网站 URL。一旦这些完成，你就可以开始了。现在是时候进行实际的 SEO 报告了。2. 亮点总结当月最重要信息的亮点页面是一个很好的介绍。这基本上可以是首席营销官或首席执行官看的第一张也是最后一张幻灯片。三十秒后，他们会说，“酷，干得好”，然后就不会再为其他的事烦恼了。这里可以包括哪些类型的内容？搜索引擎优化关键绩效指标简介值得夸耀的东西在本报告所述期间完成的最重要任务需要进一步关注的任务3. SEO KPI 概述接下来，你应该更深入地研究 SEO KPI 。虽然上一张幻灯片不能满足大多数客户的需求，但有些客户已经相当满意了。在前两张幻灯片中，我们已经讨论了最重要的部分:如前所述，你可能希望根据客户及其业务类型包含不同或更多 kpi。经验法则是尽可能选择与业务收入密切相关的指标。你可以看到上面最通用的 SEO kpi: 搜索可见性和自然流量转换。搜索可见性是最重要的营销关键绩效指标之一的 SEO 版本: 语音份额(SOV)。基本上就是类固醇关键词排名。要获得搜索可见度度量，在Ahrefs 的排名监控中创建一个项目。在这里，粘贴主要的关键词，其中包括你的听众正在搜索的内容(你需要先完成关键词研究) ，标记它，以便稍后启用过滤，你就可以开始了:然后你会在竞争对手概览标签中找到搜索可见度指标:关于自然转换，报告中的屏幕截图来自一个自定义的 Google 分析(GA)报告，该报告只显示源/中维度和选定的转换，以避免默认报告中的所有混乱。然后逐月比较转化率(MoM)。如果客户的客户经历了一个复杂的购买过程，你还需要报告辅助的自然流量转换。你可以在转换 > 多通道漏斗 > 辅助转换中找到这个。这些将完成的图片的整体影响搜索引擎优化对企业。4. 排名过程整体的搜索可见性 KPI， 并不是客户感兴趣的唯一可见性度量。他们在博客上有特定的产品类别或主题，这些通常在相关性和商业价值上有所不同。这就是测量关键字段的搜索可见性的时候了。你可以通过在 Ahrefs 的排名监控项目中创建更多的标签来获得这些数据。在概览中向下滚动到你的关键词，检查那些你想要标记的关键词，并为它们分配标记，或者创建一个新的关键词:5. 营利性关键词排名概述虽然搜索可见性指标是最好的代理你的自然增长，大多数客户也希望看到位置的变化，他们最重要的关键字。它会得到相当混乱，目前的位置变化的可能数百个关键字在甲板上。因此，我们应该让客户满意，只报告业务中最重要的关键词，也就是“金钱关键词”然后，如果客户端希望看到导出的电子表格，则可以通过链接来包含其余部分。同样，在排名监控 中标记这些关键字。你可以根据商业相关性和 CPC 来决定是否应该像这样标记关键词。或者你可以和客户一起浏览关键字列表。6. 非品牌自然流量进展我们花了几张幻灯片才得到了许多 SEO 和客户首先关注的指标: 自然流量。稍后展示这一点的原因很简单: 不断增长的自然流量并不一定转化为业务增长。该网站可以开始排名的关键字，推动流量，但不是收入。总体的流量数字并不能真正代表任何 SEO。为了使其更具相关性，让我们将其细分为非品牌的自然流量:这里显示非品牌流量的原因，是为了避免将流量的自然变化，归因于与 SEO 无关的营销活动。例如，如果营销团队发起了一个很棒的公关活动，或者开始发起大规模营销活动，你的自然流量自然会从人们更多地查看你的品牌上升。为了显示更准确的自然流量进展概况，只需在 Google 搜索控制台(GSC)中应用查询过滤器:同样，你需要将当前月份的性能与前一个月的性能进行比较，理想情况下，甚至与年度(YoY)性能进行比较。大多数企业倾向于季节性波动，所以一些妈妈比较可能看起来很糟糕，因为旺季已经结束了。小心点。GSC 默认只提供28天的视图和比较。因此，你需要选择自定义日期来比较整个月份。记住比较相同的天数。让我们来看一个场景，其中一个月有31天(例如，在这种情况下，从8月的最后一天开始进行比较，以便在9月只有30天)。你的客户也可能从谷歌发现或谷歌新闻获得大量的流量。如果是这样的话，也许值得单独用一张幻灯片来展示它。7. 新引用域名的亮点接下来是外链档案ーー向客户展示过去一个月他们获得了哪些新的、有趣的报道。但是，如果你在项目中的活动影响了新链接的获取，那么你应该只报告外链配置文件的更改。这包括从创建链接诱饵内容到计划和执行推广活动。我提到这一点是因为链接建设往往是一个独立的活动，从许多搜索引擎优化项目。如果你负责外链配置文件的增长，去 Ahrefs 的网站分析，检查推荐域名报告，并过滤新的推荐域名在过去30天(正如你可以看到的幻灯片)。我们显示了新获得的引用域名的亮点按域名评级(DR)分数排序，因为它是一个坚实的和易于理解的代理，以改善外链配置文件的增长。如果你参与推广活动，并且看到一个新的引用域名从中获得，你可以在屏幕快照中突出显示它，以便客户可以区分赚取和获得的链接。8. 链接建设的进展这张幻灯片的目的是让你进入进一步的细节，关于你的链接建设工作在这个月完成。它可以包括:建立链接的页面。任何突出的，新的参考页面。这些页面获得的链接数量。你的链接建设统计，例如，联系的潜在客户和成功率。任何你认为相关的见解，例如，特别好或特别坏的链接诱饵内容。Ahrefs的网站分析中的最佳链接增长报告很好地包含在这里，因为它显示了过去30天内收到最多外链的页面。说实话，评估链接建设的意义远远超过链接的数量和引用域名的 DRs。但这只是在开展推广活动之前的链接探测，而不是 SEO 报告。你的客户不需要深究所有的细微差别。9. 技术SEO健康概述在这里你会给出一个网站的健康快照，考虑到所有的技术搜索引擎优化的错误和问题。为了得到这些数据:进入 Ahrefs 的网站诊断，如果你还没有为客户的网站建立一个项目，那么让工具爬网站。根据你的爬网设置，网站诊断可以重新搜索网站定期，为你提供所有当前和历史技术 SEO 数据。在每次爬行结束后，你会在总览页面上看到健康得分:如果这是你第一次爬行的网站，使用这个健康评分作为一个起点。你可以在第二份报告中开始引用月度比较。现在，你可能认为一个度量标准不足以反映 技术 SEO 的整体状态。你是对的。但是你通常不会将 SEO 报告发送给开发者或者其他能够轻松理解更深入信息的 SEO。基于这个原因，Health Score 是客户友好的、技术性的 SEO 指标的最佳代理。再次重申，这并不意味着你不应该报告更多的技术 SEO 指标，等等。有些项目涉及大型网站和复杂的技术性 SEO 任务。在这种情况下，客户机可能会欢迎爬行和索引统计信息，以及关于最重要问题的详细信息等等。10. 下个月在向你的客户展示了所有的数据和报告之后，你应该给他们一个下个月你将要做的最重要的 SEO 任务的计划。一个快速的待办事项列表，总结下个月的主要重点就足够了。它也将作为你的下一个 SEO 报告。最后的想法这就是你要做的。一个完全可定制的 SEO 报告模板，给你的客户。如果你先浏览了这篇文章，这里有一个链接:点击这里制作一个 SEO 报告模板的副本。报道可能永远不会成为任何人最喜欢的活动。但至关重要的是，你必须确保拥有令人满意的高薪客户。最后，我想感谢这些年来与我分享他们报道见解的每一个人。我还要感谢 Ahrefs Insider 的会员，他们在我开始创建模板之前就主动提供了他们的知识和报告。特别要感谢Westpac的搜索性能主管 Gyorgy Bolla，他把我介绍给了企业搜索引擎优化报告——这是我唯一不熟悉的领域。你认为这个 SEO 报告模板应该有更多的指标或者幻灯片吗? 有什么问题吗? 在 推特上给我发个评论。译者，John Zhao，西品东来创始人 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Michal Pecánek Ahrefs的营销专家和内容创作者。 沉迷于SEO，航空，香氛，寿司和墨西哥玉米卷。",
  "headers": [
    {
      "level": "H1",
      "text": "窃取我们的 SEO 报告模板(灵感来自 SEO 专家)"
    },
    {
      "level": "H2",
      "text": "搜索引擎优化报告是什么"
    },
    {
      "level": "H2",
      "text": "搜索引擎优化报告应该包含什么？"
    },
    {
      "level": "H2",
      "text": "创建报告需要多长时间？"
    },
    {
      "level": "H2",
      "text": "窃取我们的 SEO 报告模板(并使其更好)"
    },
    {
      "level": "H3",
      "text": "1. 头衔卡片"
    },
    {
      "level": "H3",
      "text": "2. 亮点"
    },
    {
      "level": "H3",
      "text": "3. SEO KPI 概述"
    },
    {
      "level": "H3",
      "text": "4. 排名过程"
    },
    {
      "level": "H3",
      "text": "5. 营利性关键词排名概述"
    },
    {
      "level": "H3",
      "text": "6. 非品牌自然流量进展"
    },
    {
      "level": "H3",
      "text": "7. 新引用域名的亮点"
    },
    {
      "level": "H3",
      "text": "8. 链接建设的进展"
    },
    {
      "level": "H3",
      "text": "9. 技术SEO健康概述"
    },
    {
      "level": "H3",
      "text": "10. 下个月"
    },
    {
      "level": "H2",
      "text": "最后的想法"
    }
  ],
  "author": "Michal Pecánek"
}