{
  "url": "https://ahrefs.com/blog/zh/seo-roadmap/",
  "slug": "seo-roadmap",
  "title": "如何通过7个步骤构建SEO路线图（包括模板）",
  "description": "SEO 路线图可以使你的 SEO 策略正式化，并用作执行 SEO 任务的跟踪器。 逐步学习构建它。",
  "content": "Jamie Grant Jamie 是位于伦敦的数字增长机构 Kaizen 的 SEO 策略师。优化完规范标签和 hreflang 之后，他最喜欢看最新的足球比赛或 F1 大奖赛。 内容 SEO 路线图是 SEO 活动中最重要的文件之一。它不仅让你的 SEO 策略形式化了，而且它还被用作执行 SEO 任务的跟踪器。建立路线图没有固定的方法。四年多来，我一直在搜索引擎优化机构工作，制定了大量的路线图。作为Kaizen的高级SEO策略师，我监督所有客户的SEO策略。所以可以公平地说，我花了很多时间研究SEO路线图。我依靠这段经历分享了一些创建路线图的最佳技巧。我将把这个过程分解为七个简单易行的步骤，你可以开始在我的谷歌表格模板中应用这些步骤，来创建你的第一个SEO路线图。内容什么是SEO路线图？SEO 路线图是一个战略行动计划，用于正式确定和跟踪 SEO 活动中的关键任务。这个文档通常是在 SEO 活动的前三个月内创建的，并且通常会制定6到12个月的计划。SEO 路线图通常被称为“活的”文档，意思是随着 SEO 战略的调整和发展，必要时应该进行更新和修改。为什么要建立一个 SEO 路线图？制定路线图将确保所有各方都清楚今后的任务。从开发团队到内容编写，路线图将提供一个早期的指示，说明他们将需要什么样的工作流，什么时候需要，以及需要分配多少资源。它应该更多地被看作是一个“松散的指南”，特别是在早期阶段。在早期就制定好路线图，可以帮助你开始行动，并开始与参与实现策略的人进行对话。这将帮助你调整优先级，并提前计划资源的使用。可能需要做出一些妥协，然而，尽早做到这一点，意味着你可以尽可能有效地利用资源设置路线图。例如，你正在为一个礼品电子商务网站创建一个 SEO 路线图。开发团队可能会反对在众所周知的黑色星期五和圣诞节期间使用开发资源的任何计划。因此，你可以采取的一个行动，将一些非常重要的模式建议移动到路线图的早期阶段，以确保它们在黑色星期五的好时机得到实现。构建 SEO 路线图的另一个好处是，它可以帮助为你的长期 SEO 战略产生买入。罗马不是一天建成的，自然需要一些时间来实施你的搜索引擎优化策略。搜索引擎优化路线图可以把未来几个月的工作，很容易地提供一个可视化的视图。你可以复制的SEO路线图模板的屏幕截图。开始时你需要什么？当你准备构建你的路线图时，你应该了解:可用的预算和资源。团队内部的技能水平，以及所需的任何培训或招聘任务。关键词空白和内容机会。技术限制(例如，在技术审核之后)。你的外链资料和竞争对手。在步骤#1中，我将分享一些示例，说明如何在竞选的前几个月内快速积累这些知识。我喜欢在SEO活动的第二个月底到第三个月初制作路线图。在第一个月结束时，你可以开始对你的竞选活动的重点领域有一个清晰的想法。尽管如此，我经常发现，在这个阶段制定完整的12个月SEO路线图还为时过早。到第二个月结束时，我倾向于对未来的战略有足够广泛和深入的了解，以制定路线图。然而，这在很大程度上取决于你在最初几个月里如何度过时间。创建你的SEO路线图（逐步）现在你几乎已经准备好开始构建你的路线图了。在完成这些步骤之前，你可能会想，“我应该为实际构建路线图预留多少时间?”如果你提供的咨询服务规模相对较小(例如，每月少于三天) ，那么制定路线图可能需要大约两到三个小时。另一方面，如果你的顾问工作量较大或工作范围较大(例如每月10天以上) ，这可能需要半天到一整天甚至更长时间。第一步: 准备好关键的 SEO 见解为了创建你的路线图，你需要依靠最初的关键词研究，以便对内容差距和唾手可得的机会有一个很好的理解。从彻底的关键词研究开始你的项目是必不可少的，对于搜索引擎优化规划，和了解你应该花多少时间在你的内容上来说 。这可以从新的内容机会到现有的内容重新优化。关键词差距机会分析是一个快速衡量你应该在内容上花多少时间的有效方法。要形成你的关键词差距分析，使用 Ahref 的内容差距工具，可以很容易地看到，哪些关键词你的竞争对手排名了而你没有排名。以类似的方式，你将希望通过依赖技术 SEO 诊断中的关键操作，来对技术任务执行相同的操作。理想情况下，你应该已经从这次诊断中获得了一个技术待办事项。这样可以很容易地将任务插入到这个列表中。如果你经常通过 Ahrefs 的网站诊断进行站点抓取，现在是一个很好的时间来刷新自己在路线图中需要解决的关键问题。根据你链接建设和团队结构的方法，你可能希望列出与此相关的任务。也就是说，如果它更适合你的工作流程，那么采用一个专用的数字公关/链接建设路线图是完全可以的。在 Ahrefs 的网站分析的概览报告是一个伟大的起点，了解你的外链配置文件。只需输入你的域名并记下关键指标，如域名评级(DR)、 URL 评级(UR)、总外链和引用域名。这将被证明是未来一个有用的基准。你还可以通过“性能”图，比较与你的竞争对手的外链历史(在其他指标，如流量)。通过引用域进行比较是快速了解以前获得外链速度的一种很好的方法。第二步: 列出你的主要任务或工作流程开始行动的最好方法就是，简单地列出一个任务和关键工作流程的粗略列表，你觉得这些可以成为你未来12个月战略的一部分。注意如果你没有听说过本文中的“工作流”，那么这听起来可能有点令人困惑。这只不过是我们在 Kaizen 用来描述总体任务类别的措辞选择。你可以称之为“工作流”或者另一个项目管理术语，这完全取决于你的个人喜好。由于你处于竞选的早期阶段，你不会涵盖所有的细节，这没关系。保持关键的工作流和总体任务，是路线图的一个很好的起点。例如，你正在为一家涵盖多个垂直领域的保险公司工作。在这个阶段写“旅游保险文章写作”比具体列出每篇文章的想法更合适。这是一个在细节上找到正确平衡的案例，因为过于宽泛(例如，“文章写作”)并不能提供很多方向。如果你有幸在一个团队中工作，那么现在是让每个人都参与进来，并在创建路线图中发挥作用的最佳时机。让每个人面对面(或虚拟)参加一个“思考会议”，集思广益关键任务和工作流的想法，作为你战略的一部分。这里有一些有效的路线图构思会议的提示:预订充足的时间(30–45分钟效果良好)把所有的事情都写下来; 即使是“坏主意”也能帮助开始工作让团队看到所有的想法，因为这样可以激发更多的想法使用发表它笔记或者像 Metro Retro 这样的回顾工具让所有参与者匿名投票给他们最喜欢的选手通过在竞选活动的两到三个月左右编制路线图，你不会漫无目的地为你的战略随机挑选想法。在有效的头两个月，你应该开始有一个好主意，确定什么是需要作为你的战略的一部分。这不是你第一次表演吧？如果你想为现有的战略制定一个路线图，或者更新一个完整的路线图，你可以回顾一下哪些做得好，哪些做得不好。这是一个进行“停止，开始，继续”练习的好时机。一定要把团队中所有相关的成员召集起来，向关键的利益相关者和客户发出邀请，以确保所有可能的反馈都得到考虑。“停止，开始，继续”框架很简单:停止：什么不起作用，也不应该包含在未来的路线图中？开始：我们没有找到但应该包括哪些内容？继续：我们可以做更多或几乎可以改进的工作是什么？同样，便利贴对这一点非常有用。如果你是远程工作，请务必使用Metro Retro等回顾性工具。第三步: 回顾和完善你的任务列表你可能想知道，“我如何决定一个任务是否应该包含在我的路线图中?”这方面肯定需要一点时间来适应。也就是说，随着时间的推移，你制定的策略和路线图越多，你就越能发展出适合自己的诀窍和本能。作为一般规则，我喜欢将我的路线图限制在 SEO 团队执行的任务范围内。其他团队(如开发人员和内容编写人员)的任务应该保存在单独的文档中。例如，开发人员操作可以很好地适应技术待办事项列表，而文案人员的操作可以保存在专用的内容跟踪文档中。这样可以防止路线图变得过于详细和冗长。然而，如果有一个技术任务，搜索引擎优化团队需要执行之前，分配到一个技术积压的行动，那么它是完美的意义，包括在你的搜索引擎优化路线图的任务项目。将过于颗粒度的任务分解成单个、更大的任务，是防止你的路线图变得过于庞大的另一个很好的方法。另一方面，你也应该避免拥有过于宽泛的任务，因为这可能导致路线图没有提供足够有用的信息。类似地，你会想要避免拥有太大的任务，因为这会导致一个“扁平”的路线图。你可以做的是检查你的路线图，并将过于庞大或通用的任务分解为较小的块。现在，你可以开始将项目加载到路线图中。我们创建了一个SEO路线图模板，让你从空白画布开始。请随意制作你自己的副本，并编辑表格以满足你的需要。第四步: 合乎逻辑地安排任务的优先顺序一旦路线图中的任务项就绪，就可以对它们进行优先排序了。在这个步骤上花费一些时间后，你很可能不会100% 满意。没关系。当你继续完成剩下的步骤及其后的步骤时，继续重新确定优先级并做出调整是例行公事。记住要把它当作一个“活的”文档。也就是说，在这个阶段有效地确定优先级，将减少你在未来做出调整所花费的时间。遵循优先排序框架，如行动优先矩阵(也称为“影响力矩阵”) ，有助于有效地排序。这可以确保你将优先处理那些相对于所需工作水平具有强大影响力的任务。使用行动优先矩阵，你将把任务分为四类:速赢: 高影响力，低努力(最高优先级)长期项目: 高影响、高努力(高优先级)待办事项: 影响小，工作量小(优先级低)不会发生: 低影响，高努力(最低优先级)最好的快速胜利应该位于路线图的顶端。这些是你具有影响力且易于实施的任务。尽早采取这些行动意味着不需要太长时间就能看到一些自然增长。在长期项目之前，要小心“提前加载”你的每一个快速胜利。虽然你不会马上看到长期项目的结果，但如果你拖延太久不开始这些项目，你可能会从长远来看阻碍自己。Backlog 类别中的任务项通常会在路线图的末尾很好地插入。虽然他们不提供最高的回报，他们仍然在你的搜索引擎优化战略的一部分，并且很容易实施。在几乎所有的情况下，你都会避免包括那些影响力低、需要花费大量精力的任务(“不会发生”类别)。这些花费的时间远远超过它们的价值，在大多数情况下，通常有大量的行动要从高影响力类别继续。要重新排列路线图项目的优先级，只需在 Google 工作表中拖放行即可。这里的总体目标是将优先级最高的项目保持在最高位置。如果你还没有百分之百的满意，那还是没有问题的。当你自然而然地开始下一步时，你可能会继续重新安排优先级。第五步：为项目分配时间和资源到了这个阶段，你就可以开始向路线图任务项添加时间估计值了。这应该是一个相对简单的步骤，因为当你开始安排任务的轻重缓急时，你会对此进行一些思考。如果你决定包含与非 SEO 团队成员一起执行的任务，那么这个阶段的过程可能会变得更加困难。这是因为你必须对一项任务应该花费多长时间做很多假设。只包括搜索引擎优化部门所拥有的任务，你就能更好地依靠自己的经验和专业知识，来估计所有项目的时间。要在路线图模板中包含时间估计，只需在相应的月份列中输入天数。我个人认为，天数是对一个高级职员可能花费在这项任务上的总时间的估计。如果团队中的一个初级成员承担了这项任务，那么值得考虑的是，执行这项任务可能需要比指定的天数更长的时间。这个步骤可能有点“繁琐”，特别是如果你正在作为一个顾问工作，以获得一个固定的保留。但是这不应该太耗费时间，特别是当你习惯了这个过程之后。这通常是一个简单的情况作出轻微的改进和调整，以确保天数平衡，以符合你的指定的搜索引擎优化任务的能力。我喜欢保持半天或全天的间隔。任何更具体的事情(比如每小时)都可能使路线图过于复杂，所以不要害怕，适当地调整你的预估时间。如果你觉得半天左右完成一项任务太过极端，那么你的任务列表可能过于细化了。现在是重新考虑将较小的任务，放入更大的路线图任务项中的好时机。不要忘记考虑常规的 BAU (一切照常)任务。这可以从定期监控到报告，例如月度报告和季度业务评审(QBRs)。这些常规任务都需要时间，所以不要低估自己。很多时候，当涉及到创建 SEO 路线图时，这些任务被遗忘了。你现在也可以为路线图项目分配资源或任务所有者。路线图的这一部分远远不是必需的，如果有必要，可以很容易地删除。在较大的 SEO 部门或企业 SEO 团队工作时，它通常更有用。只需填写“所有者”一栏，当你认为适当的时候。第六步：用以甘特方式评估及设定格式，以方便使用在这个阶段，搜索引擎优化的路线图已经接近完成。在将文档发送给客户或在公司内部分享之前，花一点时间检查路线图，以做出最后的调整或格式更改是非常值得的。花一些时间阅读路线图项目，以确保一切与你的搜索引擎优化战略和愿景。我通常与一位高级搜索引擎优化同事分享我的路线图，以检查一切。如果你有任何内部问答过程或 SOPs 来评审关键项目，现在是将这些应用到你的 SEO 路线图的最佳时机。我还花了一些时间做最后的调整，以格式化我的路线图，使时间和优先级流在真正的甘特图风格。确保路线图以整齐的对角线(从左上角到右下角)流动，不仅美观，而且使路线图更容易遵循。它不会总是完全直的，可能会有一点偏离，但这是意料之中的。你可能有一个关键的工作流程，你计划在不同的阶段工作。为了避免中断路线图的流程，不要害怕将工作流程分成两个独立的路线图。现在，在收到团队的反馈之后，你已经对路线图进行了最后的调整，你已经准备好开始与客户(机构 SEO)或整个公司(内部 SEO)分享你的路线图。第七步：定期修改和更新你的路线图虽然你现在已经“完成”并分享了你的路线图，但这并不是路的尽头。正如本文开头所提到的，SEO 路线图是一个“活的”文档。这意味着编辑或修改可以而且应该随着时间的推移而进行。请确保在必要时更新状态列，以便每个人都在任务进行和完成的循环中。也可以随意添加注释，以提供额外的上下文。本专栏也是链接到任何文档的最佳位置。在未来也不要害怕做出重大改变或编辑。搜索引擎优化是一个不断发展的行业，这往往反映在计划的战略，随后你的搜索引擎优化路线图。你可能还需要根据学到的知识重新安排优先级。也许某项任务需要付出比预期更多的努力。在这种情况下，你可能希望重新安排优先级，并更倾向于“快速获胜”的任务当需要重新排列路线图的优先级时，只需调整天数以适应。比如说，我们需要把“汽车保险关键词研究”从一月份提前到二月份，把“旅游保险关键词研究”提前到一月份。只需删除从1月开始输入的天数，然后重新输入2月列中的天数。我个人喜欢使用剪切和粘贴快捷方式来有效地做到这一点。如果你希望在路线图中添加一个全新的项目，那么同样的原则也适用。只需将新任务作为新行添加，然后相应地调整整个路线图的日计数。也许你已经受到最新的Google 算法更新的冲击，因此需要添加一个新任务并延迟现有任务。(祈祷你不需要这么做。)最后的想法作为搜索引擎优化顾问，创建搜索引擎优化路线图是我最喜欢的任务之一。我喜欢制定战略，觉得这是我真正成功的地方。希望这种一步一步的方法，连同模板，使设置搜索引擎优化路线图对你来说也是一个愉快的过程。最棒的是，你不一定需要有几年的经验来构建你的第一个搜索引擎优化路线图。对于初级员工来说，制定一个路线图是一个很好的方法，可以测试他们的知识，并对关键文档进行大量的输入。关键要点:计划在搜索引擎优化活动的第二到第三个月左右建立你的路线图首先，确保你对游戏状态有一个全面的、高水平的理解利用这个机会将整个团队聚集在一起，就战略进行协作利用影响力矩阵有效地确定优先级将路线图视为一个“活的”文档，保持它的最新状态，并在必要时进行调整有什么问题吗? 请在推特上给我留言，让我知道。译者，John Zhao，西品东来创始人 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human:",
  "headers": [
    {
      "level": "H1",
      "text": "如何通过7个步骤构建SEO路线图（包括模板）"
    },
    {
      "level": "H2",
      "text": "什么是SEO路线图？"
    },
    {
      "level": "H2",
      "text": "为什么要建立一个 SEO 路线图？"
    },
    {
      "level": "H2",
      "text": "开始时你需要什么？"
    },
    {
      "level": "H2",
      "text": "创建你的SEO路线图（逐步）"
    },
    {
      "level": "H3",
      "text": "第一步: 准备好关键的 SEO 见解"
    },
    {
      "level": "H3",
      "text": "第二步: 列出你的主要任务或工作流程"
    },
    {
      "level": "H3",
      "text": "第三步: 回顾和完善你的任务列表"
    },
    {
      "level": "H3",
      "text": "第四步: 合乎逻辑地安排任务的优先顺序"
    },
    {
      "level": "H3",
      "text": "第五步：为项目分配时间和资源"
    },
    {
      "level": "H3",
      "text": "第六步：用以甘特方式评估及设定格式，以方便使用"
    },
    {
      "level": "H3",
      "text": "第七步：定期修改和更新你的路线图"
    },
    {
      "level": "H2",
      "text": "最后的想法"
    }
  ],
  "author": "Jamie Grant"
}