{
  "url": "https://ahrefs.com/blog/zh/seo-competitor-analysis/",
  "slug": "seo-competitor-analysis",
  "title": "如何进行 SEO 竞争对手分析",
  "description": "通过分析竞争对手 SEO 优化战略的优缺点，了解如何超越竞争对手。",
  "content": "Si Quan Ong 营销@Ahrefs。 我爱阅读，爱跳霹雳舞，爱尝试随机的生活实验。 内容 你的 SEO 策略信息很多都可以从你的竞争对手数据里来获得。在本篇文章中，你将了解如何通过 SEO 竞争对手分析来找到这些信息。内容什么是 SEO 竞争对手分析？SEO 竞争对手分析就是对竞争对手的 SEO 优化策略进行深入研究。这样做的目的是找到他们的优势和劣势，从而使你的排名超过他们。为什么要进行 SEO 竞争对手分析？通过 SEO 竞争对手分析，你可以：了解在你的行业中哪些有效，哪些无效，避免犯错。利用竞争对手的弱点。复制竞争对手的优势。了解今后应优先考虑哪些 SEO 优化任务。了解超越竞争对手的难度。何时应进行 SEO 竞争对手分析？在以下情况下，应该进行 SEO 竞争对手分析：你有一个新网站。你正在规划 SEO 策略。竞争对手的排名超过了你，或者你的关键词排名下降了。如何进行 SEO 竞争对手分析在这个过程中，为了更好的演示，让我先假设自己是一个新的信息图表设计工具网站。以下这就是对应的 SEO 竞争对手分析的过程：1. 识别 SEO 竞争对手SEO 竞争对手是指在自然搜索中竞争你的目标关键词的网站。这些网站可能与你的直接商业竞争对手不同。例如，HubSpot 在 “how to make infographics” 方面排名靠前，尽管它不是任何信息图表设计工具网站的直接竞争对手：以下是快速识别 SEO 优化竞争对手的方法：进入 Ahrefs Site Explorer（网站分析）输入你的域名进入 Organic competitors（自然排名竞争对手）报告该报告会显示与你网站相同关键词排名前 10 位的竞争网站。通常这些就是你的 SEO 竞争对手。如果你的网站是新站，这样做可能不会取得很好的效果。因此，你可以：进入 Ahrefs Keywords Explorer（关键词分析）输入一些潜在客户可能用来搜索你的产品或服务的关键词进入 Traffic share by domain（按域名划分的流量份额）报告在这个例子中，我们可以看到排名前五的潜在竞争对手是 Canva、Visme、Venngage、Piktochart 和 Adobe 等网站。专家建议 Adobe 和 Canva 等公司是知名品牌，通常拥有较高的 Domain Rating（域名评分、DR）。这是一个 Ahrefs 指标，你可以用它来估算网站的权重。通常你需要排除掉这些知名品牌的网站。你可以将每个竞争域名分别插入 Site Explorer（网站分析）， 或将所有域名粘贴到 Batch Analysis（网址批量分析）工具中，从而检查网站的 DR：因此，如果你的网站是 DR 50，你或许可以与 Visme、Venngage 和 Piktochart 等网站竞争，而不是与 Adobe 和 Canva 竞争。2. 调查他们是如何获取流量的你可以查看竞争对手的网站架构，了解他们的大部分自然搜索流量的构成。以下是查看竞争对手网站结构的方法：进入 Ahrefs Site Explorer（网站分析）输入你竞争对手的域名进入 Site structure（网站结构）报告例如，我们可以看到 Venngage 的模板目录每月估计有 26 万次搜索访问，占其总自然流量的 9.9%。如果我们点击更深一层，就能看到为其带来最多流量的模板类型。由此看来，创建宣传册和信息图表模板对于竞争工具来说是一个绝佳的 SEO 机会。延伸阅读如何为 SEO 构建网站结构3. 查找并填补内容空白Content gaps（内容差距），也称为关键词差距，是指竞争对手有排名、而你没有排名的关键词。怎么找呢：进入 Ahrefs Competitive Analysis（竞争对手分析）工具在 Target（目标）部分输入你的域名在 Competitors（竞争对手）部分输入你的竞争对手的域名点击 “Compare”点击 Content Gap（内容差距机会）报告点击 “Main positions only（仅限主要位置）” 按钮，排除竞争对手在 “Top stories“和 “Image packs” 等 SERP 特性中的排名。查看报告，找出与网站相关的关键词。例如，“infographic examples” 看起来就是一个很好的目标关键词：专家建议 如果关键词过多或看起来大多无关紧要，请单击 Competitors’ positions（竞争对手排名）的下拉菜单，查看所有竞争对手。这将显示所有竞争对手排在前 10 位的关键词。延伸阅读关键词竞争分析：如何找到竞争对手的关键词 4. 查看竞争对手的精选摘要Featured snippets（精选摘要）是 Google 从排名前 10 的页面中提取的搜索结果中的快速结果展示片段。如果你能发现竞争对手拥有的精选摘要，而你的排名在前 10 位，那么你就有可能 “窃取” 这些精选摘要。下面是找到这样机会的方法：进入 Ahrefs Competitive Analysis（竞争对手分析）工具在 Target（目标）部分输入竞争对手域名在 Competitors（竞争对手）部分输入你的域名点击 “Compare（比较）”点击 Content Gap（内容差距机会）报告设置 SERP features（SERP 特性）筛选框为 “Where target ranks（目标参与排名）” 并勾选 “Featured snippet（精选摘要）”设置 Target’s position（目标排名）的 “No（不参与）” 为 “Any（任意）”。查看报告，看看是否有任何现有页面可以优化的，用来获得 Featured snippet（精选摘要）。例如，Venngage 拥有 “how to make posters” 的 Featured snippet（精选摘要），这是一个步骤列表：如果你的目标中也有这一关键词，你需要重新优化页面，并在 H3 中添加明确的步骤。延伸阅读谷歌精选摘要： 获取它们所需的全部知识5. 查看竞争对手的流量来源了解竞争对手的自然流量主要来自哪些国家，有助于了解是否可以通过翻译或创建其他语言的内容来获得更多流量。以下是查看方法：进入 Ahrefs Site Explorer（网站分析）输入竞争对手域名Traffic by country（地区流量占比）部分我们可以看到，Venngage 的大部分流量都来自美国。因此，作为竞争对手，你自然希望将重点放在英语内容上。不过，墨西哥、菲律宾、巴西和印度等国家也有机会。你可以将主页和登陆页面翻译成西班牙语、葡萄牙语、他加禄语和印地语。你甚至可以开通多语言博客，最大限度地提高来自这些国家的流量。事实上，Venngage 已经为许多语言（如西班牙语）完成了这项工作：延伸阅读如何实施国际 SEO 优化策略（分步指南）6. 查找反向链接差距链接是谷歌的一个重要的排名要素。一般来说，链接越多，在谷歌（可能还有其他搜索引擎）上的排名就越高。如果能找出竞争对手获取链接的方式，就有可能复制相同的策略。下面是如何做：进入 Ahrefs Site Explorer（网站分析）输入你的域名进入 Link Intersect（交集外链分析）报告在顶部输入竞争对手的域名在底部输入你的域名点击 “Show link opportunities（展示链接机会）”该报告将向你展示链接到竞争对手，而没有链接到你网站的那些链接。你需要寻找对你有价值的、易于复制的链接。例如，点击 cnet.com 的数字，就会发现你的竞争对手网站被该内容列入了可测试工具列表中：如果你要与这些网站竞争，你也要加入 CNET 的这个列表。延伸阅读如何用 3 个步骤进行竞争对手链接分析如何查找竞争对手的反向链接（并为自己获取反向链接） 7. 发现链接诱饵机会如果你想在谷歌上排名靠前，链接是很重要的。但要让人们链接到你的 “赚钱页面（转化页面）” 却很难，因为这些页面通常不会提供太多价值。要解决这个问题，可以制作链接诱饵，然后将链接诱饵吸引来的 “权重” 重新分配给最重要的网页。这有助于提高它们的搜索引擎排名。要找到好的链接诱饵点子，就必须分析竞争对手的反向链接配置文件，并借鉴：下面是方法：进入 Ahrefs Site Explorer（网站分析）输入竞争对手域名进入 Best by links（按反链数量排序）报告该报告会显示哪些竞争对手的内容拥有最多反向链接。查看列表，看看哪些格式和主题能与你的利基市场产生共鸣。例如，我们可以看到，统计职位对 Venngage 来说效果很好：延伸阅读什么是链接诱饵？7 个成功案例 8. 查找竞争对手的失效的网页如果我们的竞争对手网站里有失效的页面，并且这些页面拥有反向链接，那么我们可以：发布可正常运行的替代页面。请求这些外链网站链接到你的页面。下面是找到这些失效页面的方法：进入 Ahrefs Site Explorer（网站分析）输入竞争对手的域名进入 Best by links（按反链数量排序）报告设置 HTTP code 筛选为 404 not found这将显示竞争对手网站上所有带链接的失效页面。浏览报告，看看是否有你可以参考的相关页面。例如，这篇关于格式塔设计原理的文章看起来还不错，有 33 个网站链接了它：点击圆点，然后点击 “在 Archive.org 上查看”。这将在 Wayback Machine 中打开页面，以便查看页面过去的样子。你可以创建类似、但更好的页面，并请求外链链接到你的页面。你可以参考下面的指南，学习如何做到这一点。延伸阅读失效链接构建： 完整指南9. 查看竞争对手的 Core Web VitalsCore Web Vitals 是 Google 页面体验信号的一部分，用于衡量用户体验。它们是 Google 的排名要素之一。因此，你希望看到他们的 Core Web Vitals，以及他们的整体技术健康状况，并与你的网站进行比较。你可以将竞争对手的网页逐一输入到 PageSpeed Insights 中进行分析。这样做可能会很累。因此，更好的方法是使用 Ahrefs 的 Site Audit（网站诊断） 对竞争对手的域名进行抓取，连接 PageSpeed Insights 的 API，查看竞争对手的 Core Web Vitals 指标、以及其他 SEO 技术问题。延伸阅读Core Web Vitals 入门指南10. 查看竞争对手在付费搜索中的关键词如果你的竞争对手正在竞标某些关键词，那么这些关键词很可能是有利可图的。以下是查看他们竞价的关键词的方法：进入 Ahrefs Site Explorer（网站分析）输入竞争对手域名进入 Paid keywords（付费关键词）报告在关键词过滤器中，添加 “不包括 [品牌]”，以过滤掉品牌关键词查看该报告有助于发现你在关键词研究过程中可能忽略的低成交量、高转化率关键词。例如，下面似乎是一个不错的目标关键词：11. 学习竞争对手的 PPC 广告谷歌会以较低的每次点击成本（CPC）奖励相关性较高的广告。因此，竞争对手通常会确保广告的相关性来满足它们的利益。通常，这意味着更好的标题和描述。我们可以利用它们作为撰写标题标签和元描述的灵感，从而提高点击率。以下是查看竞争对手广告文案的方法：进入 Ahrefs Site Explorer（网站分析）输入竞争对手域名进入 Paid keywords（付费关键词）报告将鼠标悬停在你希望定位的关键词旁边的放大镜图标上这是 Venngage 目前针对关键词 “infographic design” 投放的广告。看起来它正在使用 “customizable”、“few clicks” 和 “design wiz” 等词来吸引点击。我们在撰写自己的标题标签或元描述时可以参考这些创意。延伸阅读如何制作完美的 SEO 标题标签（四步流程） 如何提高点击率（CTR）：9 个屡试不爽的技巧如何撰写完美的元描述最后说到 SEO 的竞争对手分析，上述内容只是冰山一角。你还可以做更多，但以上的内容足以让你开始行动。我们的建议是通过上述过程，开始将从竞争对手那里得到的信息应用到 SEO 优化策略中。毕竟，执行才是最重要的。有问题吗？再 Twitter 或 Threads 上找我吧。译者，Park Cheng，歪猫出海创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Si Quan Ong 贡献者 营销@Ahrefs。 我爱阅读，爱跳霹雳舞，爱尝试随机的生活实验。 贡献者",
  "headers": [
    {
      "level": "H1",
      "text": "如何进行 SEO 竞争对手分析"
    },
    {
      "level": "H2",
      "text": "什么是 SEO 竞争对手分析？"
    },
    {
      "level": "H2",
      "text": "为什么要进行 SEO 竞争对手分析？"
    },
    {
      "level": "H2",
      "text": "何时应进行 SEO 竞争对手分析？"
    },
    {
      "level": "H2",
      "text": "如何进行 SEO 竞争对手分析"
    },
    {
      "level": "H3",
      "text": "1. 识别 SEO 竞争对手"
    },
    {
      "level": "H3",
      "text": "2. 调查他们是如何获取流量的"
    },
    {
      "level": "H3",
      "text": "3. 查找并填补内容空白"
    },
    {
      "level": "H3",
      "text": "4. 查看竞争对手的精选摘要"
    },
    {
      "level": "H3",
      "text": "5. 查看竞争对手的流量来源"
    },
    {
      "level": "H3",
      "text": "6. 查找反向链接差距"
    },
    {
      "level": "H3",
      "text": "7. 发现链接诱饵机会"
    },
    {
      "level": "H3",
      "text": "8. 查找竞争对手的失效的网页"
    },
    {
      "level": "H3",
      "text": "9. 查看竞争对手的 Core Web Vitals"
    },
    {
      "level": "H3",
      "text": "10. 查看竞争对手在付费搜索中的关键词"
    },
    {
      "level": "H3",
      "text": "11. 学习竞争对手的 PPC 广告"
    },
    {
      "level": "H2",
      "text": "最后"
    }
  ],
  "author": "Si Quan Ong, Joshua Hardwick"
}