{
  "url": "https://ahrefs.com/blog/zh/seo-copywriting/",
  "slug": "seo-copywriting",
  "title": "SEO文案写作：提升内容质量和谷歌排名的12条实用技巧",
  "description": "优质的SEO文案内容能让网站排名靠前，吸引优质流量，吸引读者并说服他们采取行动。手把手教你优化网站内容，帮你获取更多点击，更高排名。",
  "content": "Si Quan Ong 营销@Ahrefs。 我爱阅读，爱跳霹雳舞，爱尝试随机的生活实验。 内容 过去四年，Ahrefs博客 每月搜索访问量从原来12,000增长至现在的468,000。我们是怎么做到的？我们找到了一种方法——通过结合优质的SEO基础知识 和好的文案写作方法，创作出能在谷歌中获得排名的内容。我们不能将网站的 所有 流量增长都归功于文案写作。但文案的确是其中的一部分原因。今天，我将分享一些在我们创作内容时已经实践过的SEO文案创作技巧。匹配搜索意图的三大“内容”要素通过分析排名靠前的页面，创建最佳内容在内容中构建“链接触发器”用ASMR公式搞定阅读理解难题用PAS公式使读者感同身受用目录提升阅读体验用三个页面标题技巧提高点击率像海明威一样写作用“倒金字塔”模型提高参与度添加“开环”操作用行话进行写作用召唤性用语（CTA）将读者推向你的营销漏斗在学习这些之前，先来了解一些基本知识。什么是SEO文案写作？SEO文案写作旨在于创建在线内容，这样的内容能在谷歌排名靠前，吸引优质流量，吸引读者并最终说服他们采取行动（例如，订阅您的电子邮件列表，购买产品等）。毕竟，从谷歌获得大量流量，却从未获得收益的内容是没有用的。这样的内容你可能自我感觉良好，但对你的银行账户来说就不是这么回事了。反之亦然，转化效果惊人但从未获得任何流量的内容也是白搭。那，如何让你创作的内容获得流量的同时也得到转化呢？这里有一些提示：1. 匹配搜索意图的三大“内容”要素关键词“篮球鞋”在美国地区的月搜索量达到50,000，如果你博客的方向和篮球相关，用“篮球鞋”作为话题撰写一篇博客文章听上去似乎是个不错的选择？来自Ahrefs关键词分析但事实并非如此。为什么？我们来看下和“篮球鞋”有关的搜索结果：可以看到排名靠前的都是电商类页面。这些零售网站列出了他们要出售的相关产品。源自某个电商类网站页面的例子。谷歌并不打算针对当前搜索请求对博客文章进行排名，因为它清楚搜索者当前是处于购物状态，而不是学习模式。这是SEO文案写作的第一课：针对你的目标关键词写出合适的内容。否则，排名将是一场持久战。这个概念称为搜索意图。理解搜索意图非常简单。通过查看搜索结果就可理解搜索意图的三大“内容”要素。内容类型内容类型通常不外乎以下这五种：博客文章，产品页，分类页，着陆页或视频。像“无线耳机”的搜索结果全是电商类页面，而“最佳无线耳机”的搜索结果则大多是博客文章。内容格式格式主要适用于资讯类内容，包括操作方法、清单、新闻文章、观点感想和评论。比如当你谷歌搜索“约会指南”，结果页列出的都是清单：译者注：搜索结果的标题前面都带有数字，以清单的形式告诉你约会的指南内容角度内容角度是内容的主要卖点，通常搜索出来的结果都会带有明确的主题。比如，搜索“如何下棋”，排名靠前的页面主要面向的对象是初学者：译者注：搜索结果排名靠前的页面标题大多带有“初学者”字眼推荐阅读：搜索意图：一个你容易忽略却该优化的“排名因素”2. 分析排名靠前的网页内容以创建最好的内容谷歌希望排在结果首页的网站呈现给用户的是相关度高且有用的信息。所以，要想你的帖子排在谷歌首页，就需要提供对应的价值。具体可以怎么做呢？你的帖子可以涵盖用户搜索时想要了解的所有信息以及用户预期看到的信息。假设您要通过关键词“最好的无线耳塞”获得排名。可以清楚地从搜索结果页(SERPs)看到 ，这个帖子应该是一篇列表文章。但是应该提及哪些产品，功能和子话题？最简单的方法就是查找排名靠前的搜索结果之间的共性。例如，如果你看一下排名靠前的结果为“最好的无线耳塞，”毫无意外你会看到，他们都提到苹果的AirPods Pro这款产品。那么这绝对是你需要在你的帖子上提及的产品。此外你还会提及其他产品，例如：捷波朗Elite Active 75tJ；三星Galaxy Buds Plus；魔声 Powerbeats Pro。这类信息会提升你的内容实用性，在谷歌眼里与所搜索的关键词的相关性也更高。如果您想拓展延伸这类内容，可以用内容差距分析器查看排名靠前的页面同时还在竞争哪些关键词的排名，只需将那几个排名靠前的网址链接粘贴至Ahrefs内容差距分析机会工具​​即可：然后点击“显示关键字”。通过该工具可以深入了解人们在搜索此查询时想知道的内容。在这个案例，我们看到了类似的内容：适用于iPhone的最佳无线耳塞；适用于android的最佳无线耳塞;最好的airpod替代品;音质最好的无线耳塞您甚至可以用这些话题作为大纲写一篇新帖子。3. 在内容中构建“链接触发器”谷歌表示链接在影响谷歌排名因素中是前三的位置。这可能就是为什么链接与自然流量之间存在正向关系。译者注：指向域名和自然搜索量呈正向关系在创作内容时，先试想下人们为什么会将链接给到你竞争对手的页面，然后将这些洞察应用到你的帖子里。比如在这篇博客，我们的目标关键词是“ SEO 文案写作”。参考Ahrefs关键词分析得出的搜索结果页情况，可以发现竞争非常激烈。平均来说，排名前十的页面获得来自198个网站的外链。由Ahrefs的关键词分析得到的关键词“SEO文案写作”的搜索结果页情况。译者注：“指向域名”(referring domain)统计的是除去同一个域名发出的外链的网站数量。但为什么很多人会给链接到这些页面呢？要找出原因，我们可以将其中的一条页面链接，复制到网站分析，点击查看“锚”报告。里面展示了链接到该页面时最常用的词是什么。很快我们得知很多人都链接到该帖子是因为里面内容提到了什么是“接力式对话”(“bucket brigades” )和APP概括公式(Agree, Promise, Preview,简称“ APP intro formula ”)。我们的目的不是照搬这些话题到自己的帖子里，而是要深入看问题和分析原因。 在SEO领域Brian是介绍这些方法技巧的第一人。所以学以致用，我们也需要在自己的帖子里分享我们的独家秘籍（也就是你正在阅读的这篇博客！）如果人们因为某个特定指标把链接给到某个页面，你可以考虑做下研究或调研。4. 用ASMR公式搞定阅读理解难题我们的首席营销官(CMO)Tim Soulo曾告诉我：没有人喜欢阅读。他们只需要信息。如果他们可以将其下载到他们的大脑，他们会这么做的。Tim Soulo, CMO Ahrefs阅读是一项交易。你的读者花费时间阅读你写的内容，某种程度上是希望通过它来丰富生活，获得新的知识或者取悦自己。但凡他们认为你写的东西读起来太费劲，他们就会点击“后退”按钮。正如著名撰稿人邦德·霍尔伯特（Bond Halbert）所说：“好的文章读起来毫不费力。”而这其实取决于内容的设计方式。遵循 ASMR公式可以让别人读你的帖子时毫不费力：A(Annotion)：备注。添加注释、旁注引用 和其他元素，例如引用块和标注框，打破帖子单调刻板的格式；S(Short)：采用短句子和短段落。长句子太难理解。通过找到你在文章中使用的过渡词（例如“和”，“ 因为”和“ that”）的实例。将它们分解成较短的语句。M(Multimedia): 利用视频，图片和动效图等多媒体效果。在文章中插入这些内容可以帮助你简洁明了地阐明观点。R(Read)：大声读出自己写的文案并标注出表达不顺畅的内容。5. 用PAS公式让读者感同身受大多数人会根据帖子引言部分的内容判断这篇帖子是否是他们想找的。好的介绍会吸引他们继续阅读，糟糕的介绍直接导致他们返回搜索结果。要想写出抓住用户需求的简介，你可以使用抛问题-挖原因-提方案这个公式(Problem-Agitate-Solve ，简称PAS)。第一步，抛出问题：接下来，通过挖掘问题根源剖析问题：最后，提出解决方案：轻松搞定。想要解锁更多文案写作公式？查看这篇帖子。6. 用目录提升阅读体验读者的时间很宝贵。有意无意间，他们会时不时地审视这篇帖子的内容是否有在履行最开始应允的承诺。如果一开始有表明会解答问题，那读者会密切关注是否真是如此。否则，他们会直接跳出页面。这就是您需要添加目录的原因。目录可以让读者立即了解你的帖子内容能否解答他们的问题。如果可以，他们可以直接跳至该部分内容进行阅读。一旦开始阅读，他们可能会被您的文案所吸引，并自然地阅读其余内容。那我们自己文章的目录举例子，保持客观表述，不过度夸大内容：译者注：17篇博客，每一篇的标题简单直接，回答文章直接解决什么问题。目录的另一个好处是，它会在页面上创建锚点，谷歌有时会在搜索结果页中显示这部分内容：译者注：Google Trends、Keyword Sheeter、Keyword Surfer 、Google Search Console皆为免费关键词调研工具。这有可能带来更多点击。7. 用三个页面标题技巧提高点击率排在谷歌第一位却没有人点击的页面毫无意义。这就是你需要吸睛的页面标题的原因，为了吸引人们点击。如何改善您的页面标题？使用以下三个“技巧”：A. 添加“力度词”杰出的、迷人的、值得一提的这些都是有力的表达，因为他们会触发积极或消极情绪。添加一两个力度词到您的标题标签中可以使其更具吸引力。例如，通过添加一个单词您可以将一个简单的标题标签：换成：比前者更有吸引力对吧？如果你在搜集力度词词汇，可戳强大的力度词列表。B. 添加括号使用括号，让你的标题标签“锦上添花”。比如文章标题“关于跑步的七大好处”，如果加上类似于科学验证的字眼，看上去会更加醒目：C. 在标题中添加年份一些搜索是要看最新结果。像“最佳无线耳塞”这类目标关键词，搜索者希望查看是今年更新的内容。要强调时效性，可以在标题中添加年份，比如：推荐阅读：只需四步操作，教你写出完美的SEO页面标题专业提示如何在不增加新内容的情况下获得更多点击量？找出你网站在谷歌里排名第一的页面，优化标题标签。用谷歌站长工具（Google Search Console，简称GSC） 或Ahrefs的网站分析来查找这些页面。若用谷歌站长工具查找，请移步本指南。若用我们的网站分析器查找，直接输入域名，点击即可获得自然关键词报告，查看你网站上获得排名的关键词列表，筛选出排在该工具前二至前五页的关键词。使用前面提到的任意“技巧”来改善页面标题。8. 像海明威一样写作50％的美国人阅读水平低于八年级学生。译者注：阅读水平级别越高，美国成年人人口占比越少，两者呈负相关。从上图可以看出，在文章中使用难句，阅读量可能会减少一半。这意味着它可能无法得到分享，外链或转化。相反地，你应该像美国小说家欧内斯特·海明威（Ernest Hemingway）一样，使用易懂的单词和句子，简单的语法以及写实的句子。可用海明威(Hemingway)这类工具简化你的文案：译者注：该文案检查工具会根据你文案的难易程度评级，可读性越高，评级越低。请注意，你写文章的目的是和读者交流，不是用海量词汇博取眼球。9. 用“倒金字塔”结构提高参与度大多数页面都充斥着重要信息？ 其实不然。我们来看下下面这份最佳不粘锅列表：在我们期待的答案出来前，前期作为铺垫这部分“ 次要信息”就有289个单词。再来对比下Wirecutter这篇帖子 ：译者注：文章开头举了产品测评的具体实例，得出Tramontina 10英寸专业餐厅煎锅是最佳选择的结论。在第一段只用了32个单词就揭晓答案了。这样的帖子，对于那些没什么耐心看完整篇文章的读者来说简直完美，因为他们可以立马获得自己想要了解的信息。对于讲究文章连贯性或在意细节的读者也很友好，他们可以继续阅读剩下的内容。这种文章结构人们称之为倒金字塔——先传递重点信息，再讲述非必要信息，是一种新闻技巧。站在SEO的角度，无需用户付诸行动就能获得自己查找的内容，有助于减少闪回点击（在搜索结果页面之间来回跳转）并延长页面停留时间。具体怎么操作呢？首先在简介中回答您要解决的主要问题是什么。例如，在“什么是搜索结果页？”这篇博客中，我们直接给出定义：文章的剩余部分，可以补充具体细节，也可以解答相关疑问。10. 添加“开环”操作每次看完某部电视剧的第一集，你会不会不知不觉就疯狂追完整部剧？电视制片人和编剧这么多年来还是沿用同样的套路吸引您观看节目，我们称之为“开环”操作（也称为未完待续。）在剧中早期情节先埋下伏笔引发你的好奇心，之后故意间隔一段时间后再来解答。可能是本季的后几集，也可能是下季的第一集。举个例子。 [友情提醒，前方剧透预警！]在电视剧《神探夏洛克》中，莫里亚蒂（Moriarty）诬陷夏洛克福尔摩斯（Sherlock Holmes）的计划得逞，致使福尔摩斯自杀。我们作为观众会感到意外。天哪夏洛克不是主角吗？他怎么能死呢？剧透一下，到这一幕这一集就结束了，本季完结。这样的结局会让你想继续追下去。因为您希望最终的结局是美好的-闭合循环。您会急盼新的剧集赶紧出来，等它更新时第一时间观看它（当然这是两年后的事情了）。这种操作是不是很机智呢？您也可以将这种方法用于自己的内容。就好像为SEO构建内容中心这篇帖子里，乔什（Josh）认为扎比尔（Zapier）那篇关于远程工作的帖子是为了吸引更多的流量，链接和权重专门撰写的。但这段话并没有告诉你Ziaper为什么这么做或者具体可以如何。只有继续跟帖才能找到答案。是的没错，乔什（Josh）最终解释了这么做的好处以及如何创建内容中心：前期留下的悬念后面记得补充完整，否则会破坏读者对您的信任。小提示. 让我来完成前面留下的“开环”。真相是：夏洛克假死。11. 用行话进行写作了解你的受众才有机会说服他们阅读你的文章。按照他们的方式说话，让他们知道你和他们是同类人。假设你要写一篇针对街舞爱好者的博客文章，那你需要了解“breakdance”这样的表达是用词不当的。因为在这个圈子里，业内人都知道这个词是带有侮辱性的。正确的术语是“breaking”或“ b‑boying / b‑girling”。而如果您不使用这类术语，很明显对于读者来说你并不熟悉这个圈子，自然对你也不会有什么好感。其实使用行话对SEO也有好处。鉴于谷歌基于词组的索引和“相互关联”机制，您甚至可以提高主关键词的排名。这是因为谷歌可以通过单词和短语的相关性更好地识别内容的话题相关性（比如提及Apple，Face ID和电话的页面显然与iPhone有关）。既然如此，那，你熟悉你受众的“语言”吗？熟悉细分领域的读者应该没问题。如果不熟悉，则必须浏览你受众经常逛的社区。可能是下面这些渠道：Facebook群组；Reddit;社群；Quora;博客；论坛；其它花时间去逛下这些社区，找出用户常用的正确术语。期间可以留意下他们正在讨论的话题，没准可以为你提供好的博客写作素材。譬如我打算写个关于桌球主题的博客，我会去Reddit里的桌球论坛看看。鼠标滑动几下，我已经知道我需要学习的专业术语，例如 potting， break， Century， maximum break等等。也学到了一些球员的名字，例如罗尼·奥沙利文（ Ronnie O’Sullivan），约翰·希金斯（ John Higgins），斯蒂芬·亨德利（Stephen Hendry），吉米·怀特（Jimmy White）等。我甚至发现了一个可以写一写的潜在话题：这几分钟的时间确实值得花。12. 用召唤性用语（CTA）将读者推向你的营销漏斗明确地告诉读者看完内容后他们下一步需要做什么。“如果你不提，你就永远都不会得到。”站在营销的角度，这相当于在内容中添加了号召性用语（CTA）。但这并不意味着每次号召性都有效果，能让别人直接购买我的产品。并不是所有人都有购买意图。这取决于他们是处于买方市场位置的哪一环。举个例子：假设您出售VPN订阅服务，创建了“什么是VPN”这类话题的文章。它在谷歌上排名很高，并获得了大量搜索流量。但这只是个入门话题，你的读者可能不会通过这篇文章得到转化。毕竟他们只知道了什么是VPN，还没到要为刚学到的知识下重本这个程度。与其在第一步就尝试转化客户，不如将他们推向你营销漏斗的下一环。你可能会在“什么是VPN”这篇博客中解释VPN的工作方式。此时你的读者，可能在想自己是否需要VPN。那如果您写了篇关于“每个人都需要VPN的十大理由”的文章，可以将其透过内部链接插入到前一篇文章里 。这样一来，离你成功转化你的读者就更进一步了。将用户推向你营销漏斗的下一环是个明智之举。站在文案的角度，它大大提升你内容的转化率和投资回报率。站在SEO的角度，它有效提高网页浏览量，减少跳出率并可能向谷歌发送积极的参与度信号。关键要点：你采用的号召性用语始终要与用户的决策周期步调一致。总结SEO做得好，不单单有利于在谷歌上的排名。更重要的是增加流量、参与度并增加效益。为什么文案写作很重要？没人会读垃圾内容，不论你谷歌排名有多高。遇到任何疑问，可通过Twitter联系我。译者，Emma Wu，慢慢来文案策划 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Si Quan Ong 营销@Ahrefs。 我爱阅读，爱跳霹雳舞，爱尝试随机的生活实验。",
  "headers": [
    {
      "level": "H1",
      "text": "SEO文案写作：提升内容质量和谷歌排名的12条实用技巧"
    },
    {
      "level": "H2",
      "text": "什么是SEO文案写作？"
    },
    {
      "level": "H2",
      "text": "1. 匹配搜索意图的三大“内容”要素"
    },
    {
      "level": "H3",
      "text": "内容类型"
    },
    {
      "level": "H3",
      "text": "内容格式"
    },
    {
      "level": "H3",
      "text": "内容角度"
    },
    {
      "level": "H2",
      "text": "2. 分析排名靠前的网页内容以创建最好的内容"
    },
    {
      "level": "H2",
      "text": "3. 在内容中构建“链接触发器”"
    },
    {
      "level": "H2",
      "text": "4. 用ASMR公式搞定阅读理解难题"
    },
    {
      "level": "H2",
      "text": "5. 用PAS公式让读者感同身受"
    },
    {
      "level": "H2",
      "text": "6. 用目录提升阅读体验"
    },
    {
      "level": "H2",
      "text": "7. 用三个页面标题技巧提高点击率"
    },
    {
      "level": "H3",
      "text": "A. 添加“力度词”"
    },
    {
      "level": "H3",
      "text": "B. 添加括号"
    },
    {
      "level": "H3",
      "text": "C. 在标题中添加年份"
    },
    {
      "level": "H2",
      "text": "8. 像海明威一样写作"
    },
    {
      "level": "H2",
      "text": "9. 用“倒金字塔”结构提高参与度"
    },
    {
      "level": "H2",
      "text": "10. 添加“开环”操作"
    },
    {
      "level": "H2",
      "text": "11. 用行话进行写作"
    },
    {
      "level": "H2",
      "text": "12. 用召唤性用语（CTA）将读者推向你的营销漏斗"
    },
    {
      "level": "H2",
      "text": "总结"
    }
  ],
  "author": "Si Quan Ong"
}