{
  "url": "https://ahrefs.com/blog/zh/seo-basics-guide/",
  "slug": "seo-basics-guide",
  "title": "SEO基础：新手SEO成功指南",
  "description": "SEO的基础非常简单。但是由于大多数网站所有者对此了解有限，因此，了解SEO基础知识可以帮助您成功。",
  "content": "Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。 许多人认为 SEO太 难了，不值得付出努力。并不是这样，SEO的基础实际上很简单。 所有网络访问量中有 57.8％ 都来自于谷歌。因此如果你拥有一个网站，SEO 无疑是值得学习的东西。如果你认为基础知识不足以使你排名，请在思考下。大多数运行网站的人对 SEO 的了解非常有限，因此了解基础知识肯定可以帮助你成功。在本指南中你会学到：Contents译者注完全新手？可以从我们的 SEO 初学者指南开始。已经有一定知识了？那就从第一章开始看。Joshua Hardwick内容总监 SEO 指南 1搜索引擎如何工作 2SEO基础 3关键词研究 4SEO内容 (EN) 5页面SEO 6链接建设 7技术 SEO Part 1SEO 基础首先，你需要了解 SEO 最基本的信息，包括其重要性以及与其他营销渠道的比较。为什么 SEO 很重要？大多数网络流量都来自谷歌的自然搜索结果。来源 Sparktoro换句话说：自然搜寻所占的流量比所有其他流量来源的总和还多。如果你阅读过我们有关搜索引擎工作方式的指南，就会知道谷歌和其他搜索引擎会更具数百个要素对网站进行排名。 SEO 很重要，因为它是优化这些要素，并让网站在自然搜索结果中排名更高的过程。SEO 的好处是什么？获得较高的排名是 SEO 最大的好处，但排名实际上只是达到目的的一种手段。 SEO 的许多真正好处都与流量相关。 1. SEO 可以带来更多流量由于大多数人倾向于点击前几个搜索结果，因此排名较高通常会为你的网站带来更多流量。例如，使用 Ahrefs Keywords Explorer（关键词分析） 查看 “submit website to search engines” 的前三个结果。我们可以看到排名最高的页面获得了最多的自然流量，其次是第二个，然后是第三个，依此类推。我们的研究发现，结果通常都是这样的。因为排名位置与页面的整体访问量密切相关。2. SEO 可以带来稳定流量在搜索引擎中排名通常会带来被动的、持续的流量。对于诸如社交媒体和电子邮件营销之类的媒体而言，却不是这样。这些渠道通常会在到达流量峰值后迅速消失为零。发生这种情况是因为，社交媒体网络旨在展示最新鲜的内容。电子邮件通常会被标记为已读，或落入垃圾邮件里。但是，由于每个月在搜索引擎上执行的搜索次数通常是一致的，因此在你获得排名后，流量往往不会发生太多变化。3. SEO 流量是 “免费” 的 与付费广告不同，搜索流量是 “免费” 的。 这很重要，因为搜索引擎上的广告有时可能会很贵。例如，根据 Ahrefs Site Explorer（网站分析），Ahrefs 博客每月有 390k 的自然搜索流量。如果是通过广告获取该流量，则估计每月要花费我们 100 万美元。 当然，创建在谷歌排名中的内容不是免费的——但与付费广告相比，这通常是更便宜的。如何加入谷歌排名？SEO可以帮助你提高排名，但是如果谷歌都没有发现你的网站，那么你就无法获得排名。谷歌最终都会自行找到你的网站，但是手动提交你的网站有两个主要好处： 发现速度更快。大多数新网站都没有其他网站的外链，因此谷歌可能需要一些时间才能找到你的站点。 改善你的网站。 Google Search Console 提供了很多有关如何改善和优化网站的建议。第一步就是，将你的站点地图提交给谷歌。站点地图是列出你网站上所有重要页面的文件。通常，你可以通过在浏览器中键入以下 URL 之一来找到自己的网站地图：website.com/sitemap.xmlwebsite.com/sitemap_index.xml如果不存在，请访问 website.com/robots.txt，通常网站地图也会显示在那里。如果也不存在，那么你可能没有网站地图。那你最好阅读我们的站点地图指南。第二步，就是创建一个免费的 Google Search Console 帐户并提交你的站点地图。什么是 SEO？搜索引擎优化说明SEO 为什么如此重要：8个不可否认的事实和案例研究如何创建XML站点地图（并将其提交给谷歌）如何将你的网站提交给搜索引擎你的网站未出现在谷歌上的 9 个原因让谷歌将你的网站编入索引的10种方法SEO 培训课程：了解如何从搜索中获取自然流量Part 2SEO 初期设置通过搜索引擎将你的网站编入索引意味着你有资格参与竞争，但不代表你就可以获得高排名。这就是需要 SEO 的地方。SEO 是一个持续不断的过程，如果做得好，随着时间的流逝，你获胜的机会就越大。 如果你的初期设置都没有问题，那么 SEO 就会容易得多。下面来看下步骤：选择不错的域名选择网站平台选择优质的主机创造积极的用户体验创建站点逻辑结构使用有逻辑的 URL 结构安装一个不错的 SEO 插件选择一个不错的域名如果你已经注册了一个域名，请不要惊慌。这不会妨碍你的 SEO 工作。但是，如果你还没有选择，则应该牢记好域名的以下两个属性：1. 域名名称首先，它不一要需要包含你的关键词。例如，londonitalianrestaurant.com，大可不必这样，因为搜索引擎会通过其他方式理解网站是关于什么的。以下是好域名的一些属性：是你的公司名称没有连字符简短而令人难忘2) TLDTLD意思是顶级域名。它是 .com、.org、.co.uk之类域名后缀。谷歌的 John Mueller 说过，TLD 对搜索引擎优化没有影响。但是，对于大多数企业来说，.com通常是最好的，因为它是最知名、也是最受信任的。如果你是慈善机构，.org 或你所在国家/地区的 .org 域名（例如.org.uk）也可以。 如果你仅在美国以外的一个国家/地区开展业务，使用ccTLD（例如co.uk）就可以了。 最好不要使用那些倾向于与低质量网站相关联的 TLD 例如 .info 和.biz。但是如果你拥有一个这样的网站，别担心，你仍然可以利用它建立一个可以排名的合法网站。选择网站平台大多数人不会从头开始使用 HTML 和 CSS 编写网站代码。他们会使用网站平台。这些软件可让几乎没有编码技能的人们轻松创建网站、管理内容、并处理无聊的技术。网站平台有两种类型。托管平台托管平台可以一站式完成所有工作。他们托管你的网站，提供可以轻松安装和编辑的现成设计，并允许你创建和管理内容，而无需触摸代码。独立平台独立平台你也可以无需代码基础即可管理和创建内容。不同之处在于你必须自己安装和管理它们。小提示. WordPress 在 wordpress.com上也有一个托管方案。你应该选择哪种平台？大多数SEO专业人员建议使用独立的开源平台（例如 WordPress），因为： 可自定义，因为你可以根据自己的喜好编辑开源代码，并且有大量的开发人员活跃在平台中。 可扩展的，因为有数百万个可以扩展其功能的插件，其中就包括数千个 SEO 插件。如果你需要我们的推荐，那么像 WordPress 这样的独立平台方案肯定是最好的。但是，如果你很重视易用性、以及技术支持，那么像 Wix 或 Squarespace 这样的托管解决方案可能会更合适你。事实是，大多数知名的托管平台都为绝大多数人提供了足够多的 SEO 功能。 因此，如果你已经在使用其他平台，请不要着替换成 WordPress。选择好的主机Web 主机将你的站点存储在任何有网络连接的人都可以访问的硬盘上。如果你的网站使用的是托管平台，那么你对托管的控制非常有限。但是，如果你使用的是WordPress 之类的独立平台，那么你想放在哪里就可以放在哪里。那么，你如何选择 SEO 友好的 Web主机呢？大多数 SEO 指南都说专用主机比共享主机更好。没错，但是在你的网站获得大量流量之前，它并没有多大区别。任何知名公司提供的廉价主机都可以；当你每月只支付几美元时，主机之间的性能其实并没有太大差异。但是，有几件事很重要： 安全。确保主机商为你提供了免费的 SSL / TLS 证书、或支持 LetsEncrypt（提供免费TLS证书的非营利组织）。 服务器位置。数据在服务器和访问者之间传输需要花费时间，因此最好选择距离目标客户近的主机位置。 技术支持。 24/7 技术支持是最理想的。在注册之前，请先询问上述问题，以测试他们的技术支持可靠性。小提示. 不要过分担心服务器的位置。如果发现有速度问题，可以随时启用 CDN（内容分发网络）。这会在世界各地的服务器上创建你的网站的副本，以便始终向访问者提供最近的服务器中的页面。设置和使用 CDN 不在本指南的范围内，但是你可以看 WordPress 使用 CDN 的方法。建立良好的用户体验谷歌会对用户带来积极体验的页面进行排名。他们在他们的SEO入门指南中这样说： 你应该建立一个对用户有价值的网站，并且任何优化都应着眼于使用户体验更好。以下是一些简单的方法：使用 HTTPS对于用户而言，没有什么比让他们的个人数据受到黑客攻击更糟糕的了。始终使用 SSL / TLS加密你的网站。选择一个吸引人的设计没有人喜欢看起来像 90 年代设计的网站。虽然你不需要每半年就重新设计一次网站，但它至少应具有视觉吸引力并能反映你的品牌价值。保持移动端友好谷歌表示，现在在移动设备上进行的搜索比在桌面设备上进行的搜索更多。因此，你的网站在移动设备上的体验需要与桌面设备的体验一样愉快。使用可读的字体大小人们会使用各种设备浏览页面。你需要确保你的内容全面可读。避免弹出式窗口和广告每个人都讨厌广告，但有时你可能真的需要它们。如果真是这样，关键是要避免过度。 谷歌对这个给了一些建议。确保加载速度快页面速度是桌面和移动设备上公认的排名要素。但这并不意味着你的站点需要快如闪电。当然，速度越快越好.但是谷歌也表示，这个因素只会影响 “为用户带来最慢体验的网站”。创建站点逻辑结构用户和搜索引擎都需要能够轻松直观地浏览你的网站，这就是为什么为内容的逻辑层次结构很重要。最简单的方法是勾画出思维导图：你的思维导图中的每个分支都将成为内部链接，即从网站上一页到另一页的链接。内部链接对于UX和SEO至关重要，原因如下： 它们帮助搜索引擎找到新页面。没有内部链接的页面很少会被找到并建立索引。 它们有助于在你的网站周围传递 PageRank。 PageRank 是谷歌排名算法的基础，该算法试图确定页面的“值”。 它们可帮助搜索引擎了解你的页面内容。 谷歌会查看链接锚文本和其周围的文字。使用有逻辑的 URL 结构网址之所以重要，是因为网址可以帮助搜索者了解页面的主题。许多网站平台允许你选择如何构造URL。这些是 WordPress 中 URL 结构的五个主要选项： 普通: yourwebsite.com/?p=123 日期: yourwebsite.com/2021/03/04/seo-basics/ 月份和名称: yourwebsite.com/03/04/seo-basics/ 数字: yourwebsite.com/865/ 文章名称: yourwebsite.com/seo-basics/如果你是从头开始建立新网站，则最好采用最清晰，最具描述性的结构。那就是文章名称。 在 URL 中使用日期也是一种不好的做法，毕竟你将来可能希望更新这个文章。如果要优化现有网站，则最好不要更改 UR L结构——即使它不是理想的。这样做可能会破坏其他更重要的事情，从而对你的SEO产生更大的负面影响。安装一个好的 SEO 插件大多数托管平台都处理基本 SEO 功能，但 WordPress 并非如此。没有 SEO 插件，即使是最常见的SEO操作，也几乎是不可能的。这些插件有很多可用。我们使用 Yoast,，但是 Rath Math 也很好。安装很简单。顺序如下：Plugins > Add new > Run a search > Install > Activate now插件 > 添加 > 运行搜索 > 安装 > 激活这两个插件都为你的文章和页面添加了有用的额外输入字段。 （我们稍后会再讨论）。如果你使用的是 Wix 或 Squarespace 之类的托管平台，则无需安装插件，因为这些平台使你可以立即进行基本的 SEO 调整。什么是HTTPS？你需要知道的一切网站结构：如何建立你的 SEO 基础如何创建SEO友好的 URL（分步教程）如何在20分钟内加快 WordPress 网站的速度15个适用于 WordPress 的最佳SEO插件（亲测使用）如何进行基本的网站审核以改善 SEO 和 UXPart 3SEO怎么做到此阶段，你应该为 SEO 成功奠定了良好的基础。但这只是开始。 SEO 是一个持续进行的过程，大致分为四个方面：关键词研究页面 SEO链接建设技术性 SEO我们已经发布了有关这些方面的初学者指南，因此在这里我们不会涉及每个细节。取而代之的是，我们将重点放在基础知识上，并从较高的角度来帮助你理解每个方面为何如此重要，以及它们是如何协调的。关键词研究关键词研究就是寻找客户正在搜索的内容、这些词可以为你带来多少流量、以及为他们进行排名的难度。让我们探索每个步骤的基础。寻找关键词了解潜在客户正在搜索的内容是关键词研究过程的第一步。除非你已经知道，否则你是无法创建出能够获取自然搜索流量的页面。思考你的行业的单词和短语是启动此过程的最佳方法。例如，如果是在线的电脑商城站，可能是这样的：computerPCmaclaptopmacbook然后，你可以将它们用作 “种子” 关键词来找到更多的想法。只需将它们放入 Ahrefs Keywords Explorer（关键词分析）工具中，然后查看其中的关键词的建议报告即可。寻找对你的业务有价值的关键词建议。查看流量潜力几乎每个关键词研究工具都会显示月预估搜索量，Ahrefs Keywords Explorer（关键词分析）也是一样的。搜索量通常是估算关键词流量潜力的方法。一般而言，与针对低搜索量的关键词的网页相比，针对高搜索量的关键词的网页通常会为你的网站带来更多流量。但是搜索量并非万无一失。在某些情况下，月搜索量为 1,000 的关键词排名第一的页面将比月搜索量为 2,000 的关键词排名第一的页面能吸引更多的流量。例如这两个词， “submit website to search engines” 和 “seo tips”即使前者的搜索量较高，后者的排名第一的页面也会获得更多的自然流量。因此，始终有必要查看排名最高的页面的自然流量，以更好地了解关键词的流量潜力。你可以在Keywords Explorer（关键词分析）查看这个数据。检查排名难度即使某个关键词似乎与你的业务相关并且具有很高的点击量潜力，但也许难度也比较高。 很多因素都会影响关键词的排名难度。但是，链接到排名靠前的页面的相关并知名网站的数量无疑是最重要的。谷歌在其搜索指南中谈到了这一点：如果在该主题上的其他知名的网站都链接到该页面，则表明该页面的信息是高质量的。部分由于这个原因，我们根据链接到排名靠前的页面的网站数量来确定 Ahrefs 的关键词难度 （Keyword Difficulty）得分。它在 0–100 的范围内为每个关键词评分，在尝试评估排名难度时，它是一个很好的参考。但是，由于无法将排名难度的复杂性提炼为 1–3 位数字，因此我们建议你不要完全依赖它。我们会在关键词研究指南中详细介绍如何评估排名难度。页面 SEO页面 SEO 涉及创建用户正在寻找的内容类型、并对其进行 “优化 ”以帮助搜索引擎更好地了解其含义。大多数人认为这与关键词布局有关，这确实是其中的一部分，但是不是最为重要的。让我们详细讨论如何优化页面、并在搜索引擎中排名的基础知识。符合搜索意图如果你无法创建用户正在寻找的内容类型，你获得排名的机会微乎其微。在行业中，这被称为——内容需要与搜索意图保持一致。由于谷歌比其他人更了解用户在寻找什么，因此判断搜索意图的最佳方法是在当前排名最高的页面中寻找共性。例如，“SEO tips” 的结果都是列表类的博客文章。但是，“speakers” 的结果都是来自电子商务网站的分类页面。 这告诉我们，搜索 “speakers” 的人们处于购买模式，而搜索 “SEO tips” 的人们处于学习模式。如果要进行排名，则需要牢记这一点，并创建与搜索意图一致的内容。选择一个描述性的 URL 别名在建立 SEO 成功网站的章节中，我们讨论了使用有逻辑的 URL 结构。对于你发布的每个页面或帖子，你还需要设置一个描述性的别名（URL末尾的部分）。如何最好地执行此操作取决于 URL 段之前的子目录。假设你的目标关键词是 “black mens jeans”。如果你的 URL 没有子目录（例如/ blog /），则只需将别名设置为目标关键词即可。yourwebsite.com/black-mens-jeans/如果存在 “有逻辑关系的” 子目录，例如 /mens/ 或 /jeans/，通常最好排除重复的字。yourwebsite.com/mens/jeans/black/编写引人注目的标题标题是显示在搜索结果中那段蓝色可点击的文字。它是吸引搜索者进入你页面的理由之一，因此，使其尽可能吸引人就很重要。最简单的方法是使它与搜索意图保持一致。例如，如果我们查看 “best bluetooth speaker” 的最佳搜索结果的标题，则有两个共同点： 它们都包含年份。这表明新鲜度对搜索者很重要。 关于可便携的讨论很多。这暗示了一个重要的属性。利用这些知识，下面似乎是一个不错的标题：Best Bluetooth Speakers (2021): Top Picks for Portability优化图片图片可以在谷歌图片搜索中排名，并将流量转到你的网站上。仅在过去的三个月中，我们就获得了来自谷歌图片的数千次的访问。如何优化图片？按照下面三个步骤： 给他们起个好名字。文件名可帮助谷歌理解图像，因此 cat.png 比 IMG_948493.png 更好。 使用描述性替代文字。替代文字是用文字描述图片的代码。除非用户使用屏幕阅读器或图像无法加载，否则文字是不可见的。上传图像时，大多数网站平台都有一个用于输入替代文本的地方。 压缩它们。安装类似 Shortpixel 的插件可以动态压缩图像并提高页面速度。链接建设来自其他网站的链接就像“投票”一样，向谷歌展示其他人在为你的内容提供担保。它们可以说是最重要的排名因素，但是获得好排名并不总是那么容易。大多数链接建设策略都围绕着创建有价值的链接内容，然后以极具吸引力的理由与网站所有者和编辑联系，以将你的链接添加到他们的页面之中。但是还有其他获取链接的方法。让我们看一些链接建设策略：做客博客做客博客是你在另一个网站上撰写博客文章的地方。这是 Ryan Stewart 在 2018 年为 Ahrefs 博客写的文章。如果你查看作者简介，则会发现指向 Ryan 的社交媒体和网站的链接。 大多数网站允许博客作者在此处添加其链接。寻找潜在做客博客机会的最简单方法之一是使用 Content Explorer（内容分析），因为它有超过 70 亿个页面的数据库。搜索相关关键词。下拉选项选择 “in title”查看网站选项在这里，你会看到访问量最多的网站：由于这些网站以前都写过有关此主题的文章，因此有可能会开放做客博客。只需向他们发送电子邮件并询问即可。摩天楼技术通过摩天楼技术，你可以通过创建比已有内容更好的内容页面来获取链接。下面是步骤：查找包含大量外链的相关内容建立更出色的内容请求别人链接到你的内容可以说，Content Explorer（内容分析）是找到 “摩天楼” 机会的最快方法。只需搜索一个主题，然后过滤出具有大量 referring domains（引用域）的页面。寻找可以改进的地方，然后发布更好的东西。然后，你可以将 URL 放入 Ahrefs Site Explorer（网站分析）中，从外链报告中找到其所有外链，然后尝试与这些人联系。跟踪竞争对手的链接了解竞争对手如何吸引外链的是链接建设策略的最佳方法。如果你可以在其外链文件中找到固定模式，你就知道哪种链接建设策略可能对你的网站最有效。为此，请在 Keywords Explorer（关键词分析）中搜索你要定位的关键词，然后向下滚动至 SERP overview（SERP概述）部分。查找与你的页面相似并且具有大量 referring domains（引用域）的页面。如果我们针对 “SEO basics” 进行此操作，则会看到大量带有大量外链的页面。然后单击其中一个页面进入外链报告，则可以在其外链中查找规律。这个例子中，外链里用很多来自博客指南文章的链接。因此，我们可以轻松地在 Content Explorer（内容分析）中搜索以找到更多博客指南类的文章，然后与他们的作者联系，并建议它们将你的页面作为他们指南的补充信息。技术性 SEO技术性 SEO 优化是帮助谷歌等搜索引擎查找、理解、索引你的页面的过程。它通常会比较复杂。但是由于我们已经在建立成功的 SEO 的网站时介绍了基础知识，因此在此不再赘述了。目前，我们建议你注册一个免费的 Ahrefs Webmaster Tools（Ahrefs站长工具）帐户，并安排定期抓取你的网站。这些它会帮你检测 100 多个 SEO 问题，其中就包括许多常见的技术问题。如果你在网站上发现任何技术问题，请阅读我们的技术类 SEO 指南，以了解有关修复问题的更多信息。如何进行 SEO 的关键词研究页面 SEO：完整的入门指南链接建设入门指南技术类SEO：入门指南Part 4如何跟踪 SEO 效果到此阶段，你应该已经对SEO有了很好的了解。但是，你如何衡量和跟踪你的效果？最明显的答案就是跟踪来自自然搜索的流量。如果你使用的是 Google Analytics，则可以通过以下方法快速查看自然流量：Acquisition > All Traffic > Channels > Organic Search数据 ​​> 所有点击量 > 渠道 > 自然搜索如果你不使用 Google Analytics，则可以在 Ahrefs Site Explorer（网站分析）中查看当前和过去的自然流量。如果这个数字上升，那么你可能正在做正确的事情。你还可以在 Rank Tracker（排名监控）中跟踪关键词排名。如果某个的关键词排名一个月前为＃5，接下来的一个月排名为＃1，则表明你的工作进展很顺利。但是，尽管关注自然流量和排名并没有什么害处，但是这两件事被称为表象指标，因为它们通常与你的整体营销或业务目标没有直接关系。最好跟踪具有实际业务影响力的指标。让我们探讨其中的几个指标。监控声音份额指标（SoV）自然的声音份额是指你的品牌在搜索结果中的可见度。这很重要，因为 SoV 与市场份额之间存在一定联系。你可以在 Ahrefs Rank Tracker（排名监控）跟踪自然搜索 SoV。只需添加对你的业务很重要的关键词并给它们一个适当的标签即可。然后进入：Competitors > Overview竞争对手 > 概述如果你还没做，请添加一些竞争对手。然后，查看 Visibility（可见性）标签，以查看与竞争对手相比，你的跟踪关键词在你的网站上获得的所有点击所占的百分比。跟踪自然流量带来的转化当你的网站的访问者执行特定操作时，就会发生转化。例如单击链接或是进行购买。如果你使用的是 Google Analytics，则可以跟踪购买交易以及几乎所有交易的转化。然后，你可以过滤出自然流量带来的转化，并比较时间段，以了解 SEO 对实际业绩产生了什么影响。跟踪这3个SEO KPI 制定更好的营销策略什么是声音份额？如何跨渠道测量声音份额？Part 5免费的 SEO 工具许多专业的 SEO 工具每月花费高达 100 美元。鉴于这只是SEO基础知识的指南，你可能还没有准备好将这类资金投入到像 Ahrefs 这样的强大 SEO工具 中。但是不用担心。你可以使用免费的 SEO 工具获得很多成就。以下是一些热门的工具，它们对第4章介绍的 SEO 的各个方面都有帮助。 关键词研究工具谷歌关键词规划师查找独特的关键词建议。 Keyword Generator (关键词生成器）生成数百个关键词建议。 SERP Checker（SERP 检查）根据前三个搜索结果检查该主题的搜索流量潜力。 Keyword Difficulty Checker（关键词难度检查）检查关键词的关键词难度（Keyword Difficulty）得分。页面 SEO 工具Yoast SEO将标题标签和元描述添加到 WordPress 的文章和页面。 Ahrefs Webmaster Tools（Ahrefs站长工具）在网站上查找缺少的标题、元描述、替代文本的页面。链接建设工具 Ahrefs’ Backlink Checker（外链检查）查看指向任何网站或网页的前100个外链。HARO获取每天的链接机会（从技术上讲，它更多的是服务而不是工具）Gmail发送外联电子邮件以联系潜在客户。其实并不需要花哨的外推软件。技术类 SEO 工具Google Search Console查找索引错误、页面速度问题等。 Ahrefs Webmaster Tools（Ahrefs站长工具）帮助你找出100多个SEO问题，包括许多技术类问题。总结一下上面的所有内容都是 SEO 基础知识的介绍。如果你想了解有关第四章中讨论的四个方面的更多信息，我们也每个方面提供更进一步的初学者指南。以下是链接（我们建议从关键词研究开始阅读）：关键词研究入门指南页面 SEO 入门指南链接建设入门指南技术类 SEO 入门指南译者，Park Cheng，魔贝课凡联合创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Joshua Hardwick 贡献者 Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。 贡献者",
  "headers": [
    {
      "level": "H1",
      "text": "SEO基础：新手SEO成功指南"
    },
    {
      "level": "H2",
      "text": "SEO 基础"
    },
    {
      "level": "H3",
      "text": "为什么 SEO 很重要？"
    },
    {
      "level": "H3",
      "text": "SEO 的好处是什么？"
    },
    {
      "level": "H4",
      "text": "1. SEO 可以带来更多流量"
    },
    {
      "level": "H4",
      "text": "2. SEO 可以带来稳定流量"
    },
    {
      "level": "H4",
      "text": "3. SEO 流量是 “免费” 的"
    },
    {
      "level": "H3",
      "text": "如何加入谷歌排名？"
    },
    {
      "level": "H2",
      "text": "SEO 初期设置"
    },
    {
      "level": "H3",
      "text": "选择一个不错的域名"
    },
    {
      "level": "H4",
      "text": "1. 域名名称"
    },
    {
      "level": "H4",
      "text": "2) TLD"
    },
    {
      "level": "H3",
      "text": "选择网站平台"
    },
    {
      "level": "H4",
      "text": "托管平台"
    },
    {
      "level": "H4",
      "text": "独立平台"
    },
    {
      "level": "H3",
      "text": "选择好的主机"
    },
    {
      "level": "H3",
      "text": "建立良好的用户体验"
    },
    {
      "level": "H4",
      "text": "使用 HTTPS"
    },
    {
      "level": "H4",
      "text": "选择一个吸引人的设计"
    },
    {
      "level": "H4",
      "text": "保持移动端友好"
    },
    {
      "level": "H4",
      "text": "使用可读的字体大小"
    },
    {
      "level": "H4",
      "text": "避免弹出式窗口和广告"
    },
    {
      "level": "H4",
      "text": "确保加载速度快"
    },
    {
      "level": "H3",
      "text": "创建站点逻辑结构"
    },
    {
      "level": "H3",
      "text": "使用有逻辑的 URL 结构"
    },
    {
      "level": "H3",
      "text": "安装一个好的 SEO 插件"
    },
    {
      "level": "H2",
      "text": "SEO怎么做"
    },
    {
      "level": "H3",
      "text": "关键词研究"
    },
    {
      "level": "H4",
      "text": "寻找关键词"
    },
    {
      "level": "H4",
      "text": "查看流量潜力"
    },
    {
      "level": "H4",
      "text": "检查排名难度"
    },
    {
      "level": "H3",
      "text": "页面 SEO"
    },
    {
      "level": "H4",
      "text": "符合搜索意图"
    },
    {
      "level": "H4",
      "text": "选择一个描述性的 URL 别名"
    },
    {
      "level": "H4",
      "text": "编写引人注目的标题"
    },
    {
      "level": "H4",
      "text": "优化图片"
    },
    {
      "level": "H3",
      "text": "链接建设"
    },
    {
      "level": "H4",
      "text": "做客博客"
    },
    {
      "level": "H4",
      "text": "摩天楼技术"
    },
    {
      "level": "H4",
      "text": "跟踪竞争对手的链接"
    },
    {
      "level": "H3",
      "text": "技术性 SEO"
    },
    {
      "level": "H2",
      "text": "如何跟踪 SEO 效果"
    },
    {
      "level": "H3",
      "text": "监控声音份额指标（SoV）"
    },
    {
      "level": "H3",
      "text": "跟踪自然流量带来的转化"
    },
    {
      "level": "H2",
      "text": "免费的 SEO 工具"
    },
    {
      "level": "H3",
      "text": "关键词研究工具"
    },
    {
      "level": "H4",
      "text": "谷歌关键词规划师"
    },
    {
      "level": "H4",
      "text": "Keyword Generator (关键词生成器）"
    },
    {
      "level": "H4",
      "text": "SERP Checker（SERP 检查）"
    },
    {
      "level": "H4",
      "text": "Keyword Difficulty Checker（关键词难度检查）"
    },
    {
      "level": "H3",
      "text": "页面 SEO 工具"
    },
    {
      "level": "H4",
      "text": "Yoast SEO"
    },
    {
      "level": "H4",
      "text": "Ahrefs Webmaster Tools（Ahrefs站长工具）"
    },
    {
      "level": "H3",
      "text": "链接建设工具"
    },
    {
      "level": "H4",
      "text": "Ahrefs’ Backlink Checker（外链检查）"
    },
    {
      "level": "H4",
      "text": "HARO"
    },
    {
      "level": "H4",
      "text": "Gmail"
    },
    {
      "level": "H3",
      "text": "技术类 SEO 工具"
    },
    {
      "level": "H4",
      "text": "Google Search Console"
    },
    {
      "level": "H4",
      "text": "Ahrefs Webmaster Tools（Ahrefs站长工具）"
    },
    {
      "level": "H2",
      "text": "总结一下"
    }
  ],
  "author": "Joshua Hardwick  Sam Oh Joshua Hardwick Joshua Hardwick"
}