{
  "url": "https://ahrefs.com/blog/zh/seo-kpis/",
  "slug": "seo-kpis",
  "title": "12个你应该（和不应该）跟踪的SEO KPI 指标",
  "description": "SEO KPIs（关键绩效指标）是指那些最重要的、与业务增长紧密相连的 SEO 指标。",
  "content": "Michal Pecánek Ahrefs的营销专家和内容创作者。 沉迷于SEO，航空，香氛，寿司和墨西哥玉米卷。 内容 制定 SEO KPI（关键绩效指标）是十分重要的，它与业务增长紧密相连。它们决定了你所采取的行动，所以你应该明智地选择关键绩效指标。在这篇文章中，我们将学习 12 个常见的 SEO 关键绩效指标，并探讨你是否应该跟踪、以及如何跟踪它们。内容1. 搜索可见度搜索可见度衡量你的品牌在市场上的可见度。有时也被称为 SERP 可见度，它是最重要的营销关键绩效指标之一的 SEO 版本：声音份额（SOV）。你应该把它作为一个 SEO 的 KPI 来跟踪吗？是的，搜索可见度是最有用的、普遍适用的 SEO 关键绩效指标之一。事实上，它可以说是唯一一个可以与你的业务增长紧密相连的非转化率指标。这是因为 SOV 和市场份额之间存在着密切的关系。一般来说，你的 SOV 越高，你的份额就越大。如何跟踪将与你有关的关键词粘贴到 Ahrefs Rank Tracker（排名监控）中。请注意，这些应该是包含你的目标受众正在搜索的主要关键词（不要纠结于长尾词）。并为其添加一个标签，以方便以后过滤它们。在那里，前往 Competitors Overview（竞争对手概览）选项卡，并检查可见度栏：2. 自然流量的转化率转化是你的访问者在网站上采取的重要行动，如结账、注册或订阅服务。跟踪你所有的流量来源，包括自然流量，是大多数企业已经做的事情。你应该把它作为一个 SEO 的 KPI 来跟踪吗？是的，这可以说是唯一不容置疑的SEO KPI。转化跟踪是将你的营销努力与你的收入联系起来的最直接的方式。如何跟踪在 Google Analytics 4 中设置转化跟踪并不困难，尽管一开始可能看起来很艰巨。你不需要任何编码知识就可以做到这一点。重点是你要设置正确。如果你正在经营一家电子商务商店，转化次数、其价值、和你的平均订单价值对你来说最有意义。你必须设置特定的电子商务跟踪来做到这一点。如果你像我们一样提供基于订阅的软件，你最好的选择是跟踪线索、试用注册、付费订阅，甚至最终跟踪每一层的新订阅。掌握了数据收集的方法？在 Google Analytics 4 中，进入 Reports（报告） > Engagement（参与） > Conversions（转换） ，使用 “Edit comparison（编辑比较）” 按钮过滤自然流量会话：关于转换报告的准确性、以及关于其背后的归因的细微差别，其实有很多东西可以讲。一般来说，你会得到最准确的数据。但是需要保证：你正在使用 GA4（你现在应该使用）你使用数据驱动的归因模型作为默认值，检查 Admin > Attribution settings > Reporting attribution model （管理>归因设置>报告归因模型）。你每月至少有几百次转化（以确保有足够的数据，让谷歌的黑匣子模型来施展它的魔法）。如果你的网站上还没有那么多的转化，不妨也用不同的归因模型来检查。进入 Advertising > Attribution > Conversion paths（广告>归因>转化路径），选择你想分析的转化事件，检查自然搜索在整个用户购买过程中的影响。如果你想更好地了解这个复杂的话题，我建议你查看这个关于归因模型的资源。3. SEO ROISEO ROI（投资回报率）可以估算所有 SEO 活动的商业价值与它们的成本对比。其公式为：SEO投资回报率=（自然转化的价值 — SEO投资的成本）/ SEO投资的成本*100换句话说，你需要用 SEO 的利润除以相关的 SEO 成本，然后乘以 100 来得到 ROI 的百分比。你应该把它作为一个 SEO KPI 来跟踪吗？只有当你的客户、经理、或利益相关者要求你提出投资回报率时才会这样做。这在本质上是一个不错的SEO KPI，但要正确衡量却非常困难。可以说，最大的挑战来自于 “投资” 和 “回报” 期之间的差异。搜索引擎优化可能需要很多时间才能达到预期的效果，而且你无法 100% 肯定，活动 X 带来了结果 Y。然而，我们可以放弃从整个网站的角度来看待 SEO 投资回报率的概念。为了尽可能准确地掌握这个指标，我们需要更加的细化。如何跟踪如果可能的话，在类别、页面，甚至是关键词层面上衡量投资回报率。这是因为你可以很好地用特定页面排名衡量，也就是 “回报”，并算出其中的 “投资”。比方说，你花了 1000 美元支付给一个内容作家，他创造了一个很好的内容，意味着可以获得排名和推动转换。你又花了 1000 美元给一个链接建设机构，该机构建立了几个不错的链接。你把 500 美元默认为你的时间和你的团队（例如，设计师、编辑）的时间，以完成其余的工作。这样我们的投资成本就有 2500 美元了。一年后，你检查谷歌分析，发现这个自然着陆页已经带动了 5000 美元的转化率。你已经可以宣称有 200%的投资回报率，而且可能会继续增加。当然，这只是一个简化的例子。如果你有兴趣，可以去看看我的 SEO ROI 指南。4. 新增反向链接反向链接是最重要的 SEO 排名因素之一。指向你的网站的新反向链接的数量和质量通常反映了你的搜索引擎优化、内容营销和公关努力，所以这是大多数企业密切关注的问题。你应该把它作为一个 SEO KPI 来跟踪吗？是的，但只有当你积极建立链接并跟踪你的外展成功率时，它才适合作为一个 SEO KPI。毕竟只有有用的链接才值得你去追求。如何跟踪一旦你完成了链接的外展（即找出你想得到的反向链接的过程），跟踪你的链接就再容易不过了。只需在你的链接外展的表中添加一列、注释或评论，表明你是否得到了链接。下面就是我自己在推广时新建立的链接跟踪的示例：你可以通过收到一个积极的答复，或在 Ahrefs Site Explorer（网站分析）的 Backlinks（反向链接）报告中发现一个所需的反向链接来了解你的外链外展工作是否成功：你可以看到在过去七天内发现的指向 Ahrefs 博客的新反向链接，以及页面发布后添加的任何链接。5. 关键词排名关键词排名是指一个网站在特定关键词的搜索结果中的自然排名位置。你应该把它作为一个 SEO KPI 来跟踪吗？不，最好还是使用搜索可见度作为 KPI。即使你需要跟踪，你需要适当的关键词研究来正确地跟踪它，在你达到目的之前，临时的关键词排名可以作为一个临时的替代品。如何跟踪只需将对你重要的一堆关键词粘贴到 Ahrefs Rank Tracker（排名监控）中。你可以定期收到关于你追踪的关键词进展的电子邮件提醒，你只需偶尔查看一下 Ahrefs Rank Tracker（排名监控）报告即可。6. 自然流量自然流量代表所有来自搜索引擎的非付费点击。你应该把它作为一个 SEO KPI 来跟踪吗？除非你的网站靠展示广告赢利。否则这对你没有多大意义，因为更多的流量不一定意味着更多的收入。 例如，HubSpot 有个关于搜索 “shrug” 表情符号的页面，估计每月有 65.4 万次自然访问。但我怀疑这些访问并不能带来更高的品牌知名度，更不用说更高的销售转化了。如何跟踪Google Search Console (GSC) 中的性能报告会让你最准确地了解你的自然流量随时间变化：7. 索引页面数量这告诉你，你有多少个页面被搜索引擎索引。你应该把它作为一个 SEO KPI 来跟踪吗？这需要看情况。当你发布新内容时，看到被索引的页面数量稳步增加，这是一个可靠的指标，说明谷歌在抓取和索引你的网站方面没有问题。但大多数网站一开始就没有这个问题。因此，只有在你的内容可能难以及时被索引的情况下，才考虑将这个数字作为一个技术性的 SEO KPI 进行跟踪。通常只有大型和复杂的网站才会出现这种情况。如何跟踪追踪你的索引页面数量的最好方法是检查你的 GSC 账户中的页面报告。在那里，选择 “All submitted pages（所有已提交的页面）” 过滤器，就会显示你网站地图上的页面：我们这样做是因为你的网站地图应该只包括你希望有索引的URL。因此，分析这部分被索引的网页数量并将其与 “未被索引” 的数据联系起来。是这个技术性 SEO KPI 的最佳选择。8. 网站健康评分健康评分显示你网站上没有技术性 SEO 错误的内部 URL 的比例。你应该把它作为一个 SEO KPI 来跟踪吗？不，这是对你的技术 SEO 整体状态的一个不错的参考指标，仅此而已。你总是需要获得更多的详细信息。这里有一个例子：出现 404 HTTP 状态代码是那些技术性的 SEO 问题之一，会在任何爬虫抓取过程中引发错误。如果显示资源未找到，通常对用户和搜索引擎都是不利的。但是，在一个自然流量很高的转化率很高的页面上有一个404 和一个不是很重要的页面有很大的区别。从本质上讲，某些技术性的 SEO 错误要比其他的严重得多，但健康评分在这里并没有什么区别。如何跟踪大多数 SEO 爬虫工具都提供健康评分、或一些名称不同的替代指标。就 Ahrefs Site Audit（网站诊断）而言，您需要设置一个项目，开始第一次抓取，然后在抓取概览中检查健康评分：9. Domain Rating（域名评分）Domain Rating（域名评分、DR）是Ahrefs的一项指标，显示一个网站的反向链接情况的相对强度。你应该把它作为一个 SEO KPI 来跟踪吗？你可以用它来衡量一个网站的反向链接情况的强度，但总是需要更深入的分析来正确评估它。DR 只是 SEO喜欢使用的另一个有用的参考指标而已。如果你在寻找一个反向链接的 KPI，请滚动到 “新反向链接”。这是一个更好的选择，毕竟你需要参考的是重要的反向链接变量。如何跟踪在 Ahrefs Site Explorer（网站分析）中查找任何域名，你会看到 DR 是概览框中的第一个指标：10. 点击率（CTR）点击率（CTR）显示了 SERP 中点击和曝光的比例。点击率代表了你的搜索引擎列表在吸引人们访问你的网页方面的有效性。你应该把它作为一个 SEO KPI 来跟踪吗？点击率高并不一定会转化为更多的销售。就像那些标题党一样。是的，谷歌远非完美，它任然会为一些标题党页面进行排名。你不应该纠结于点击率的另一个原因是，许多你无法控制的事情会影响到点击率。毕竟 SERP 会不断发生变化。最后但并非最不重要的是，CTR 在整个网站的总体水平上是无用的。将 CTR 作为一个页面级别的指标进行跟踪和优化才有意义。如何跟踪在 GSC 中打开你的性能报告，切换到页面标签，并检查你的特定页面的点击率：11. Core Web Vitals（核心页面指标）核心页面指标（CWV）是一组与你的网站速度和用户体验有关的三个技术性 SEO 指标。你应该把它作为一个 SEO KPI 来跟踪吗？不，谷歌自2021年6月以来一直将 CWV 作为一个次要的排名因素。正如 “次要” 一词所暗示的那样，即使你在整个网站上有完美的 CWV 分数，你也不能指望有任何明显的排名提升。虽然作为 SEO 你需要关注 CWV，但它被夸大了一些。如果这三个 CWV 指标中的任何一个、或全部都非常糟糕，那么尝试并解决它们很可能是一个好主意。但它们甚至根本不具备作为 SEO 关键绩效指标的资格。如何跟踪追踪 CWV 的方法有很多，但最直接的是在你的 GSC 账户中查看 Core Web Vitals（核心页面指标）报告：Core web vitals report:12. 参与度指标参与度指标让你了解访客对你网站的参与程度。大多数人从谷歌分析中了解到这些指标，它们包括诸如跳出率、参与率、页面停留时间、平均时间、会话持续时间等。你应该把它作为一个 SEO KPI 来跟踪吗？不，这些指标通常不能反映你的 SEO 增长，更不用说业务增长。但许多营销人员由于某些原因而对它们着迷。简而言之，这里有三个原因，为什么这些最多只能作为次要的 SEO 指标来使用：用户很容易被分析软件中固有的、有缺陷的跟踪，以及跟踪设置中的错误所误导。其中一些指标的计算方法是相当糟糕的。只有在你为特定的流量来源进行细分后，它们才变得有点用处。如果你有兴趣了解更多，我在我们的改善跳出率指南中深入的探讨了所有这些原因。毕竟跳出率是最常用和最知名的参与指标之一。如何跟踪你在谷歌分析中的大多数报告都会默认显示这些参与度指标。正如我前面提到的，如果你打算分析它们，最好是过滤你的报告，以显示一个特定流量来源数据：最后你可能会感到惊讶，我只完全赞同了在这个列表中的前两个 SEO 关键绩效指标。因为，选择正确的目标和各自的 KPI 是创建一个成功的营销策略的最主要部分。而对于所有的战略，更多的是选择不做什么。在这种情况下，就是摘除那些不需要过多关注的 SEO指标。不过，所有列出的指标都有用途。一般来说，对它们都进行跟踪是一个好主意。其中一些指标与你选择的关键绩效指标有很好的关联，甚至可以成为评估你日常 SEO 工作的更好选择。当然，在过度关注某个指标之前，请三思而行。跟踪正确的 KPI 并不是 SEO 的万能药。你需要学习如何分析和解释它们，以做出最明智的决定。批判性思维、专业的数据处理、以及跟踪平台的使用、基本的统计能力，你可能都需要具备。有问题吗？在 Twitter 上找我吧。译者，Park Cheng，歪猫出海创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Michal Pecánek Ahrefs的营销专家和内容创作者。 沉迷于SEO，航空，香氛，寿司和墨西哥玉米卷。",
  "headers": [
    {
      "level": "H1",
      "text": "12个你应该（和不应该）跟踪的SEO KPI 指标"
    },
    {
      "level": "H2",
      "text": "1. 搜索可见度"
    },
    {
      "level": "H3",
      "text": "你应该把它作为一个 SEO 的 KPI 来跟踪吗？"
    },
    {
      "level": "H3",
      "text": "如何跟踪"
    },
    {
      "level": "H2",
      "text": "2. 自然流量的转化率"
    },
    {
      "level": "H3",
      "text": "你应该把它作为一个 SEO 的 KPI 来跟踪吗？"
    },
    {
      "level": "H3",
      "text": "如何跟踪"
    },
    {
      "level": "H2",
      "text": "3. SEO ROI"
    },
    {
      "level": "H3",
      "text": "你应该把它作为一个 SEO KPI 来跟踪吗？"
    },
    {
      "level": "H3",
      "text": "如何跟踪"
    },
    {
      "level": "H2",
      "text": "4. 新增反向链接"
    },
    {
      "level": "H3",
      "text": "你应该把它作为一个 SEO KPI 来跟踪吗？"
    },
    {
      "level": "H3",
      "text": "如何跟踪"
    },
    {
      "level": "H2",
      "text": "5. 关键词排名"
    },
    {
      "level": "H3",
      "text": "你应该把它作为一个 SEO KPI 来跟踪吗？"
    },
    {
      "level": "H3",
      "text": "如何跟踪"
    },
    {
      "level": "H2",
      "text": "6. 自然流量"
    },
    {
      "level": "H3",
      "text": "你应该把它作为一个 SEO KPI 来跟踪吗？"
    },
    {
      "level": "H3",
      "text": "如何跟踪"
    },
    {
      "level": "H2",
      "text": "7. 索引页面数量"
    },
    {
      "level": "H3",
      "text": "你应该把它作为一个 SEO KPI 来跟踪吗？"
    },
    {
      "level": "H3",
      "text": "如何跟踪"
    },
    {
      "level": "H2",
      "text": "8. 网站健康评分"
    },
    {
      "level": "H3",
      "text": "你应该把它作为一个 SEO KPI 来跟踪吗？"
    },
    {
      "level": "H3",
      "text": "如何跟踪"
    },
    {
      "level": "H2",
      "text": "9. Domain Rating（域名评分）"
    },
    {
      "level": "H3",
      "text": "你应该把它作为一个 SEO KPI 来跟踪吗？"
    },
    {
      "level": "H3",
      "text": "如何跟踪"
    },
    {
      "level": "H2",
      "text": "10. 点击率（CTR）"
    },
    {
      "level": "H3",
      "text": "你应该把它作为一个 SEO KPI 来跟踪吗？"
    },
    {
      "level": "H3",
      "text": "如何跟踪"
    },
    {
      "level": "H2",
      "text": "11. Core Web Vitals（核心页面指标）"
    },
    {
      "level": "H3",
      "text": "你应该把它作为一个 SEO KPI 来跟踪吗？"
    },
    {
      "level": "H3",
      "text": "如何跟踪"
    },
    {
      "level": "H2",
      "text": "12. 参与度指标"
    },
    {
      "level": "H3",
      "text": "你应该把它作为一个 SEO KPI 来跟踪吗？"
    },
    {
      "level": "H3",
      "text": "如何跟踪"
    },
    {
      "level": "H2",
      "text": "最后"
    }
  ],
  "author": "Michal Pecánek"
}