{
  "url": "https://ahrefs.com/blog/zh/seo-manager/",
  "slug": "seo-manager",
  "title": "高级搜索引擎经理的角色和技能(由高级搜索引擎经理解释)",
  "description": "SEO 经理在这里使 SEO 工作像一个良好的润滑机器，符合营销战略和业务目标。",
  "content": "Michal Pecánek Ahrefs的营销专家和内容创作者。 沉迷于SEO，航空，香氛，寿司和墨西哥玉米卷。 内容 SEO 是一个最多学科的营销领域。它与许多其他方面交织在一起: 营销渠道、产品和开发。搜索引擎优化经理在这里使所有的工作像一个良好的润滑机器，符合营销战略和业务目标。但是 SEO 经理每天都做些什么呢？你需要具备的最重要的技能是什么？你能期望赚多少钱？我们已经得到了答案。我联系了一些我在 Twitter 和 LinkedIn 上的搜索引擎优化经理的联系人，他们都在各自的个人简介里。非常感谢以下帮助我整理这篇文章的 SEOs: Abby Reimer – Uproer SEO 经理 Suganthan Mohanadasan – Snippet Digital 和 Keyword Insights 的SEO顾问和联合创始人 John Lawless – BestHeating 的内容和 SEO 经理 Axel Jack Metayer – Breuninger 的搜索引擎优化顾问和高级搜索引擎优化经理让我们开始吧。搜索引擎优化经理每天都做些什么？如果你正在寻找一份多样化的工作，你就中了头彩。当我整理文章撰稿人的回答时，我得到了一个任务和活动的大清单。我发现当你是一个 SEO 经理的时候，没有一天是完全一样的。日程安排取决于你是一个只为一家公司工作的内部员工，还是一个管理多个客户的机构。例如，您通常可以期待更多的内部战术性工作，而代理方有更多的会议和战略规划。我把每天的任务分成四类来理解它们。管理好吧，废话。搜索引擎优化经理管理事情和人。在规模较小的公司，SEO 经理通常负责整个 SEO 部门，并直接向 CMO 汇报。在较大的营销团队中，可能会有一个 SEO 主管介于两者之间。管理可以被看作是一个模糊的术语。因此，这里有一个管理任务的例子清单，你可以期待在这个角色:参加与客户和团队成员的会议协调团队的任务，回答问题，解决问题负责团队的教育、培训和激励与利益相关者合作为新的、潜在的客户(如果你在一家代理公司)创建球场平台策略搜索引擎优化策略是一个战斗计划，指导所有与搜索引擎优化相关的努力，以提高搜索引擎的可见性。作为策略的一部分，经理们计划各种 SEO 活动，并确保他们正确地执行。SEO 经理还要确保所有这些努力都是更广泛的营销计划的一个组成部分。战术战术就是你如何执行你的战略来获得成功。这些是所有的 SEO 技巧，努力，活动，和所有其他的词，你可以找到在采取行动的背景下。归根结底，作为一个搜索引擎优化，你可以执行成千上万种不同的事情。但是一般来说，如果一个 SEO 经理参与到战术性任务中，那些通常是他们可以比团队中的其他人做得更好的更高级的事情。或者他们正在回顾其他人的工作，例如，内容计划，大纲，草案，或者提出的技术变化。搜索引擎优化经理的战术工作范围取决于可用的资源为计划的搜索引擎优化工作。如果经理有一个小的团队，他们可能会更多地从事实际的 SEO 工作，而不是照顾10个 SEO 专家。报告当我说报告的时候，我们大多数人可能会首先联想到搜索引擎优化报告甲板(或者 Google Data Studio 仪表板，如果你喜欢的话) :您通常每月创建一次这些文件，以报告已经改变、改进或变得更糟的内容。这根本不是日常工作。但是，如果你在一个有很多客户的机构工作，那么创建第一份报告的过程也可能是一项频繁的活动。然后是临时报道。这不一定是向客户或利益相关者报告。相反，它是关于在你的团队中报告或者自己检查进度。其中两位 SEO 经理提到了每天都要检查报告工具。在具体报告方面，提到最多的是排名监控:Ahrefs的排名监控截屏.然后检查网络上有关品牌的提及:取自 Ahrefs 提醒.SEO 经理最重要的技能是什么？这是我向投稿人提出的第二个问题。当然，扎实的搜索引擎优化经验和技能是一个给予，所以软技能被提到最多。我把一些答案整合在一起，得到了以下五个个人成为一个伟大的 SEO 经理所需要的技能:沟通技巧一致的胜利不应该让任何人感到惊讶。上面提到的许多日常任务都是围绕着沟通。以下是 SEO 中沟通技巧的含义:有能力使用简单的语言传达复杂的 SEO 概念，即使是非 SEO 人员也能理解分配任务的方式要让每个人都知道他们应该做什么，以及做任务的目的是什么能够建设性地分享反馈对团队成员感同身受具备谈判技巧，知道如何向利益相关者“推销”SEO 的价值数据驱动的思维模式和批判性思维我完全同意艾比的想法:对于任何营销角色来说，拥有亲和力或者至少对数据感兴趣都是至关重要的。这在搜索引擎优化中尤其如此。如果不知道应该查看哪些数据、这些数据意味着什么以及如何利用这些数据，你就无法做很多事情。这在很大程度上也与批判性思维有关。根据我自己采访许多营销人员的经验，这些技巧是最应该学习的。要成为一个伟大的 SEO 经理，你应该了解你的方式围绕谷歌分析，站长工具，一个多合一的 SEO 工具集像Ahrefs，然后能够创建伟大的 SEO 报告使用这些工具的数据。好奇心和不断的学习搜索引擎优化的基本原则多年来一直保持不变。但是谷歌让每个人都忙于它的算法更新和SERPs 的变化。同时，搜索引擎优化工具不断发布新功能; 而且，聪明的搜索引擎优化操作系统总能为我们面临的许多问题提供更好的解决方案。如果这还不足以说明持续学习和好奇心的重要性，我们还有另外一个观点: 你的想法有时会失败。在搜索引擎优化中没有任何保证，你将有充足的机会从你的错误中吸取教训。是的，你的团队中的失败也是你责任的一部分。时间管理、优先排序和授权技巧即使你不是经理，你也可能知道被信息、截止日期和无休止的会议淹没是什么感觉。这是你创造有效系统和理解混乱的机会。事情不仅会因为你的努力而变得更加混乱，而且你也要为其他人的混乱负部分责任。然而，你需要通过好好管理时间，优先处理重要任务，把工作委派给别人来让事情为你工作，而不是与你作对。技术技能作为一个 SEO 从业者，如果这些不是你的责任，那么你可能仅仅知道技术 SEO 的基础知识。但是任何 SEO 经理都应该超越基本要求，因为他们通常是批准技术 SEO 改变并与开发人员沟通的人。一个基本的 HTML 方向不应该被认为是理所当然的所有搜索引擎优化水平。另外，这里有一个更多技能的例子，可以派上用场:至少是JavaScript SEO的被动知识了解 schema markup的使用方法熟悉 核心页面指标 和 页面速度的提高日志文件分析搜索引擎优化经理挣多少钱？最后ーー关于金钱的谈话。很明显，你不可能在完成第一个 SEO 课程之后就成为一个 SEO 经理。它需要相当多的技能和经验，这是一个有利可图的工作的指标。在美国，基于多个工作和人力资源数据库的搜索引擎优化经理的平均工资约为7.5万美元。然而，优秀的候选人至少可以得到10万美元。(我是在与美国的 SEOs 讨论并审查了许多招聘信息后得出这个结论的。)在最流行的技术中心，你甚至可以达到更高的水平。在英国，平均薪酬似乎在40000美元(约合55000美元)左右。英国的搜索引擎优化工资还没有那么有吸引力，所以我只能鼓励你要求更多来改变这一点。当然，你应该预料到伦敦和英国其它地区之间存在巨大差异。由于这是一个适合100% 远程工作的工作，我也一直在关注远程工作岗位。这些工作起薪4万美元，但也可能超过10万美元。最好的候选人可以得到美国的薪水，不管他们在世界上的哪个地方。最后的想法搜索引擎优化经理是一个多样而有趣的工作。然而，我们还没有提到接下来会发生什么。在许多公司里，SEO 角色不会超过这个级别，但是最终的结果可能是一个经理成为 SEO 的头或者主管。如果每个 SEO 员工都想在职业生涯中不断攀升，那么他们就应该开阔视野，把市场营销作为自己的最终目标。所以这是你应该关注的额外技能(除了文章中提到的前五项)。再次感谢 Abby、 Sugan、 John 和 Axel 分享他们的见解和经验。有什么问题吗? 在推特上联系我。译者，John Zhao，西品东来创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Michal Pecánek Ahrefs的营销专家和内容创作者。 沉迷于SEO，航空，香氛，寿司和墨西哥玉米卷。",
  "headers": [
    {
      "level": "H1",
      "text": "高级搜索引擎经理的角色和技能(由高级搜索引擎经理解释)"
    },
    {
      "level": "H2",
      "text": "搜索引擎优化经理每天都做些什么？"
    },
    {
      "level": "H3",
      "text": "管理"
    },
    {
      "level": "H3",
      "text": "策略"
    },
    {
      "level": "H3",
      "text": "战术"
    },
    {
      "level": "H3",
      "text": "报告"
    },
    {
      "level": "H2",
      "text": "SEO 经理最重要的技能是什么？"
    },
    {
      "level": "H3",
      "text": "沟通技巧"
    },
    {
      "level": "H3",
      "text": "数据驱动的思维模式和批判性思维"
    },
    {
      "level": "H3",
      "text": "好奇心和不断的学习"
    },
    {
      "level": "H3",
      "text": "时间管理、优先排序和授权技巧"
    },
    {
      "level": "H3",
      "text": "技术技能"
    },
    {
      "level": "H2",
      "text": "搜索引擎优化经理挣多少钱？"
    },
    {
      "level": "H2",
      "text": "最后的想法"
    }
  ],
  "author": "Michal Pecánek"
}