{
  "url": "https://ahrefs.com/blog/zh/seo-trends/",
  "slug": "seo-trends",
  "title": "2021年将持续的8种SEO趋势",
  "description": "了解搜索领域的前景是非常重要的。以下是我们认为2021年你需要牢记的 SEO 趋势。",
  "content": "Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。 内容 众所周知，搜索引擎优化是一个快速发展的行业。谷歌不断引进新技术和更新旧技术，以提高搜索结果的质量。在过去，这些更新大大改变了搜索引擎优化的游戏。但我们认为，2021年的情况不太可能朝这个方向发展。更有可能的是，现有的趋势将继续下去，谷歌将继续改进而不是重新定义搜索领域。考虑到这个预测，以下是一些在2021年需要牢记的 SEO 趋势:零点击搜索将继续上升语音搜索将继续普及提供良好的用户体验将变得更加重要移动友好性对每个人都是至关重要的谷歌将更好地识别 E‑A-T谷歌发现将带来更多的流量图片搜索将获得更多的潜力搜索意图仍将是王道1. 零点击搜索将继续上升在2016年至2019年之间，零点击搜索的数量从43.9％上升至49％。资料来源：Sparktoro这不足为奇。 Google正在使用SERP功能回答越来越多的查询，并且在答案正确时无需单击结果。在未来，随着知识图谱的增长和谷歌的算法越来越擅长从网页上为精选摘要提取答案，零点击搜索只会继续增长。应该怎么办无论你做什么都不会改变零点击搜索的百分比，但是你应该在关键词研究时牢记这一点。如果你正在考虑一个关键词，而大多数搜索没有点击，它可能不是最好的目标。例如，如果我们在 Ahrefs 的关键词分析中检查“ seo 代表什么”的点击分布，估计有71% 的搜索结果没有点击。截自Ahrefs关键词分析这可能是因为 Google 完全回答了 SERP 中的问题。现在看看“搜索引擎优化技巧”，只有26% 的搜索没有点击。截自Ahrefs关键词分析在这种情况下，尽管谷歌试图用一个精选的片段来回答这个问题，但大多数搜索者可能会点击，因为他们需要更多的细节和视觉效果来帮助他们将这些提示付诸实践。这是否意味着针对第一个关键词是完全没有意义的？不。零点击并不意味着没有机会。在搜索结果中显示还有其他好处，比如: 提高品牌知名度。因为你的域名和图标显示在 SERP 中。 提高品牌辨识度。如果谷歌一直从你的页面中提取有用的答案，搜索者可能会开始将你的品牌与有用联系起来。 触及更多人。 并非所有内容都与流量有关。 如果您为非营利组织工作或有一个业余爱好网站，那么吸引更多人可能是一个有价值的SEO KPI。2. 语音搜索将继续普及2019年，Adobe 发现48% 的消费者使用语音进行一般网络搜索。来源：Search Engine Land现在这个数字可能更高，而且据预测，到2022年美国家庭的智能语音搜索将达到55%，因此语音搜索的普及程度只会上升。因为人们使用自然语言进行语音搜索，它越来越受欢迎，这无疑是谷歌投资 RankBrain，BERT和 the Knowledge Graph 等技术的部分原因。这些技术都很复杂，但简单来说就是: RankBrain 和 BERT 帮助更好地理解搜索查询的含义。 The Knowledge Graph 有助于理解人、地点和事物之间的关系。应该怎么办像 RankBrain，BERT和the Knowledge Graph 这样的技术可以帮助语音搜索，但是没有办法为他们直接优化。但是有一些简单的方法可以优化语音搜索: 获取Google我的商家资料。 通常直接从此处获取与您的业务直接相关的问题的答案，例如方向和营业时间。 确保页面快速加载。 语音搜索结果的加载速度比一般网页快52％。 虽然这只是相关数据，但我们知道页面速度是自然搜索中的排名因素。 获取更多反向链接。 外链有助于排名，根据这项研究，Google更有可能从排名较高的网页中提取语音搜索结果。 添加结构标记。 如果您要优化某些类型的内容（例如带有食谱的页面），则至关重要。 要简洁。 平均语音搜索结果为29个单词。 同样，这是相关数据，但是谁希望他们的语音助手用新颖的答案回答呢？ 回答人们提出的问题。 如果你无法回答问题，则无法为你的页面排名。要找到人们提出的问题，请查看 Ahrefs 关键词分析中的问题报告。例如，这是人们问有关iPhone的最受欢迎的问题。截自Ahrefs关键词分析如果你还不是 Ahrefs 的客户，试试我们的免费关键词生成器，它提供了50条建议。截自Ahrefs关键词分析3. 提供良好的用户体验将变得更加重要谷歌希望对提供正面用户体验的内容进行排名。他们在自己的页面上这样描述搜索的工作原理:谷歌已经为此使用了HTTPS，侵入性广告和移动设备友好性等信号，但2021年5月，Core Web Vitals将被添加到其中。应该怎么办谷歌将使用三个指标来决定你的网页是否通过了核心网络重要指标评估: 最大内容渲染（LCP）折叠上方最大元素的加载速度。应小于等于2.5秒。 首次输入延迟(FID)当用户与页面进行交互后，页面需要多长时间响应。应该是100毫秒或更少。 累计布局偏移（CLS）加载期间物体移动的量。应小于等于0.1。要检查任何页面的这些指标，请使用Pagespeed Insights。要查看网站上所有需要改进的页面，请使用 Google搜索控制台中的 Core Web Vitals 报告。如果你的任何一个网页未能通过 Core Web Vitals 评估，请阅读我们的提高网页速度指南或者与你的开发者交谈。4. 移动友好性对每个人都是至关重要的移动友好性一直以来都很重要。谷歌在2015年正式将其列为排名因素，并在2019年7月转向为新网站提供移动优先索引。谷歌将移动优先索引定义为“使用移动版本的内容进行索引和排名”。目前，70% 的网站已经在使用移动优先索引技术，谷歌计划在2021年3月之前更换剩余的网站。应该怎么办首先检查一下 Google 是否已经将你的网站转移到移动索引。你可以在 Google 搜索控制台上做到这一点。只需进入设置 > 用于将网站编入索引的抓取工具如果你看到“谷歌智能手机”，谷歌已经转换了你的网站。如果这种转变还没有发生，确保你已经做好了准备。如果您的网站具有响应能力，通常没有什么可做的。 但是，如果您有一个点或复杂的网站，则需要确保您的桌面网站和移动网站之间没有重大区别。 为此，请使用Ahrefs站长工具的网站诊断使用桌面用户代理对您的网站进行爬网，然后使用移动用户代理重复该过程。 您会看到两个抓取之间的任何差异都称为“更改”。截自Ahrefs的网站诊断您还应该检查robots.txt中的替代规则，页面速度问题以及一致的导航和内部链接。推荐阅读: 移动优先索引: 你需要知道什么5. 谷歌将更好地识别 E‑A-TE‑A-T 代表专业、权威和可信赖性。谷歌在其搜索质量评估员指南(SQRGs)中对此谈论了很多。 SQRGs 是一份人工搜索质量评估员用来评估谷歌搜索结果质量的文档。尽管有许多人相信，但E‑A‑T并不是直接的排名因素。他的工作原理如下：人类搜索质量评估者定期评估搜索结果的 E‑A-T。谷歌利用他们的反馈来识别与 E‑A-T 一致的有形信号。谷歌相应地调整了他们的搜索算法。谷歌负责搜索的副总裁Ben Gomes，给出最好的解释是：您可以查看评估者指南（其中大量讨论了E‑A‑T），这是我们希望搜索算法去向的地方。 他们没有告诉您该算法如何对结果进行排名，但从根本上说明了该算法应该做什么。Ben Gomes, 谷歌搜索副总裁应该怎么办E‑A-T 并不是什么新鲜事。一段时间以来，SEO 专家们一直对它的重要性赞不绝口。改进和演示 E‑A-T 可能听起来很复杂，但是你可以做一些具体的事情: 定期更新你的内容。谷歌的SQRGs 在医疗建议的背景下讨论了这个问题，但它可能适用于其他话题。 核实你的内容。谷歌谈到了在科学话题中保持事实准确性的重要性。但是，这可能对其他话题也很重要。至少，链接到有信誉的来源对访问者是有用的。 坚持你所知道的。 没有人可以在所有事情上都是专家。 获得更多评论。 Google认为低评级是负面声誉的证据。 获得更多的链接和提及。谷歌的 Gary Ilyes曾经说过E‑A-T 很大程度上是基于权威网站的链接和提及。推荐阅读：什么是E-A‑T？为什么对于SEO这么重要6. 谷歌发现将带来更多的流量Google Discover是个性化的移动供稿，其中包含有关您感兴趣的内容的内容。 它使用来自Google产品（搜索，YouTube等）的活动数据，位置数据和您关注的主题来执行此操作。没有人知道2021年究竟有多少人在使用 Discover，但是谷歌在2018年正式宣布有8亿用户，所以现在可能要高得多。实际上，在2020年下半年，谷歌发现向我们的博客发送的流量是上半年的两倍多。从谷歌发现到Ahrefs博客点击量的增加。应该怎么办除非你在搜索引擎优化方面已经做得很好了，否则花太多时间去追逐 Google Discover 的点击可能是不值得的。但是你可以做一些简单的事情来提高你出现的机会。 满足 Discover 的内容隐私条款。除非你的内容被编入索引并满足这些要求，否则它不会显示在 Google Discover 中。 有一个快速的，适合移动设备的网站。 Discover是仅限移动设备的供稿，因此移动用户体验很重要。 使用引人注目的标题。确保准确地描述你的内容。不要点击诱饵。 发布关于热门话题的内容。不管是经典的还是流行的。 包括大而引人注目的图像。 Google在Discover feed中显示了其中之一。 证明E-A‑T。Google在谷歌发现的上下文这里专门讨论了这一点。7. 图片搜索将获得更多的潜力每个人都知道，在Google图片中排名可以按您的方式发送点击量。 实际上，在过去三个月中，我们通过图片搜索获得了超过1.6万次访问。在过去的3个月里，从谷歌图片到Ahrefs博客的流量。 但是图像搜索是不断发展的，随着它的发展，它的潜力也在不断发展。例如，以Google Lens (谷歌镜头)为例。2017年推出的谷歌镜头使得搜索你所看到的成为可能。只要用你的智能手机拍照，谷歌就会寻找类似的图片和产品。应该怎么办图片搜索引擎优化的最佳实践并没有真正改变，但随着图片搜索的发展和使用量的增加，它们确实变得越来越重要。例如，Google Lens 搜索的结果是图片。如果有人把他们的智能手机指向你销售的产品，产品页面上的图片可能会显示在搜索结果中。如果他们决定购买，他们只需要点击就可以了。谷歌还经常在常规图片搜索中从产品页面提取图片，甚至在信息搜索中也是如此。例如，搜索“可拆卸裙子的婚纱”考虑到在搜索结果页面顶部有一个图片包，顶部的页面都是列表，很明显这主要是一个信息搜索，搜索者需要灵感。然而，如果你点击图片搜索结果，你会看到很多来自产品页面的图片。通过图像SEO的要点（例如描述性文件名，替代文本和产品结构标记)，这些页面才能够在图像搜索中对此类查询进行排名。8. 搜索意图仍然是王搜索意图指的是搜索背后的原因。人们是想买东西，学习东西，还是想找到一个特定的网站？例如，一个人在谷歌中输入“购买 iPhone 12”处于购买模式，而一个人输入“如何重置 iPhone”处于学习模式。谷歌将理解查询背后的意图描述为“搜索的一个关键方面”，并继续在技术上大力投资以帮助解决这个问题，如 RankBrain，BERT 和 the Knowledge Graph。我们已经在语音搜索部分讨论了这些问题，但是它们也有助于常规搜索。应该怎么办确保你的内容符合搜索意图。如果做不到这一点，你的排名几乎为零。如果你是这个博客的忠实读者，你就会知道我们已经敲响这个锣有一段时间了，因为它真的很重要。谷歌的搜索结果是搜索意图的最佳体现。例如，“beats solo 3”的所有结果都是产品页面。通过Ahrefs关键词分析搜索 “beats solo 3”的结果。对于“ best beats 耳机”，结果是博客帖子。通过Ahrefs的关键词分析搜索 “最好的beats耳机”的结果。从这些搜索结果中可以清楚地看出搜索者在寻找什么类型的内容，但是匹配搜索意图比匹配内容类型更重要。你也应该按照搜索者所期望的格式和角度排列你的内容。在我们的完整指南中了解更多关于搜索意图。最后的想法了解搜索领域的前景是非常重要的。它可以帮助你理解大局，并在短期内进行长期优化。我们有没有错过任何重要的SEO趋势？请在Twitter上给我留言。译者，赵子荣，SEOZZR博客创始人 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。",
  "headers": [
    {
      "level": "H1",
      "text": "2021年将持续的8种SEO趋势"
    },
    {
      "level": "H2",
      "text": "1. 零点击搜索将继续上升"
    },
    {
      "level": "H3",
      "text": "应该怎么办"
    },
    {
      "level": "H2",
      "text": "2. 语音搜索将继续普及"
    },
    {
      "level": "H3",
      "text": "应该怎么办"
    },
    {
      "level": "H2",
      "text": "3. 提供良好的用户体验将变得更加重要"
    },
    {
      "level": "H3",
      "text": "应该怎么办"
    },
    {
      "level": "H2",
      "text": "4. 移动友好性对每个人都是至关重要的"
    },
    {
      "level": "H3",
      "text": "应该怎么办"
    },
    {
      "level": "H2",
      "text": "5. 谷歌将更好地识别 E‑A-T"
    },
    {
      "level": "H3",
      "text": "应该怎么办"
    },
    {
      "level": "H2",
      "text": "6. 谷歌发现将带来更多的流量"
    },
    {
      "level": "H3",
      "text": "应该怎么办"
    },
    {
      "level": "H2",
      "text": "7. 图片搜索将获得更多的潜力"
    },
    {
      "level": "H3",
      "text": "应该怎么办"
    },
    {
      "level": "H2",
      "text": "8. 搜索意图仍然是王"
    },
    {
      "level": "H3",
      "text": "应该怎么办"
    },
    {
      "level": "H2",
      "text": "最后的想法"
    }
  ],
  "author": "Joshua Hardwick"
}