{
  "url": "https://ahrefs.com/blog/zh/seo-automation/",
  "slug": "seo-automation",
  "title": "自动化SEO：9个可以为你节省时间和金钱的任务",
  "description": "通过这九项自动化 SEO 任务，可以节省你重复性工作的时间。让你更好的制定SEO策略并执行。",
  "content": "Fraser McCulloch 传统的营销人员现在专门从事关键词研究、SEO内容计划和内容大纲。曾是苏格兰高尔夫球手。 内容 SEO中最让人难熬的部分就是你需要长时间重复做同样的事情，这时你就需要自动化的处理一些事情。SEO 自动化是指使用软件来执行你过去手动完成的重复性 SEO 任务，从而节省你的时间。在这篇文章中，我将向你展示 9 个你可以快速实施自动化 SEO 的任务。内容1. 创建SEO报告Looker Studio（前身为 Google Data Studio）经常被 SEO 和代理机构用来自动化 SEO 报告。主要的好处在于它会立即获得任何时间范围内的数据，并能在一个完整的仪表板上显示。大多数 SEO 从多个来源（例如，Google Search Console，Google Analysis，和 Ahrefs）获取数据用于报告。因此，将其全部连接到 Looker Studio 是非常方便的。虽然在使用上你可能需要一点时间学习。但从长远来看，你会发现今后你都不需要在手动拼凑报告上浪费时间了。点击以下链接，了解更多关于 Looker Studio 是如何连接 Ahrefs、Google Analytics 和 Search Console 的。2. 获得流量骤降和峰值的警报你可以自动发出警报，在你或你的客户的网站流量下降或激增时通知他们。突然下降可能是受到谷歌算法更新导致的。同样在你开始获得大量不相关流量的情况下，即使流量激增也可能并不一定是好事。下面是如何设置自动的流量警报：进入 Google Analytics选择 Admin（管理） > View column（查看栏目） > Custom Alerts（自定义警报） > Create a new alert（创建新警报）将其应用于您管理的一个或所有网站选择一个时期和发送警报的对象选择 “Medium（中等）” 并在 “Matches exactly（完整匹配）” 中选择 “organic（自然流量）”选择当 “sessions（会话）” 与前一周相比减少超过20%时发出警报然后为迅速增加的自然流量设置另一个警报。对于 GA4 用户来说，选择报告，查看所有的洞察力，并创建和定制以下所示的建议之一，以获得有关您网站的任何异常情况的通知。3. 监测 SEO 问题大多数技术性的 SEO 问题都是意料之外的，所以你需要在问题出现时发现并解决它们。要做到这一点，请设置 Ahrefs Site Audit（网站诊断），定期检查您的网站，寻找这些问题。你甚至可以在Ahrefs Webmasters Tools（Ahrefs 站长工具）中免费这样做。在它抓取了你的网站后，你会看到一个问题清单：然后你可以展开每个问题，检查其细节，看看如何修复它，最后点击查看受影响的 URL：当你查看受影响的 URL 列表时，你可以勾选 “Lost from filter results（从过滤结果中丢失）” 标签，并打开“Show changes（显示变化）”。你将得到的是一个自上次以来问题被修复的 URL 列表，其中有关于变化的细节。4. 定期获得关键词排名更新还没有准备好开始使用 Looker Studio 来自动化你的整个 SEO 报告？你仍然可以定期得到重要的 SEO 数据，例如追踪关键词排名。你只需要打开 Ahrefs Rank Tracker（排名监控），列出你想跟踪的关键词。你可以在多个地方进行跟踪，并添加标签进行细分。你会在 Rank Tracker（排名监控）的仪表板上看到这些关键词的数据，但你也可以选择定期收到每周关键词报告的电子邮件：每当你发布一个新的内容，只需将其主要关键词添加到 Rank Tracker（排名监控）就可以。5. 监控你获得或丢失的反向链接对于那些从事外链外展或公关活动的人来说，你可以在 Ahrefs 仪表板上为你的每个项目开启反向链接警报。你会定期收到一份关于你获得和失去的反向链接的电子邮件报告（因为回收失效的链接是一个非常不错的建设策略）。这两个选项都能节省你的时间，所以你不必经常手动检查反向链接报告。6. 获得内容更新的建议很多人都有建议告诉你要定期更新、刷新或重写你的旧内容。但你应该更新或重写哪些页面呢？你可以安装 Ahrefs SEO WordPress plugin（Ahrefs WordPress插件）并运行内容诊断后，你可以查看表现不佳的页面和建议的操作。以下是安装该插件和运行内容诊断的分步指南：搜索 Ahrefs 的插件，安装、并激活将该插件连接到你的 Ahrefs、Google Analytics 和 Search Console 账户。允许 Ahrefs 访问数据并继续确保你连接了正确的网站，然后继续阅读内容诊断选项，并按 “Run content audit（运行内容诊断）”完成后查看报告在下面的例子中，我们看到内容诊断分析了 77 页。下面是我是如何处理它们的：步骤 1: 进入 “Under-performing（表现不佳）” 选项卡，看到应该更新的页面（不在前三名），以提高目标关键词在谷歌的位置。步骤 2: 进入 “Non-performing（不合格）” 选项卡，查看应该改写的页面（不在前20位），从而使页面进入第一页。由于建议是基于从 Yoast 提取的、或是自动建议的目标关键词，你应该确保它是正确的。记得确认或改变内容诊断中每个页面的关键词。步骤 3: 点击 “Export to CSV（导出到CSV）”，把诊断结果交给你的团队或客户，并说明如何改写或更新这些页面。延伸阅读重新发布内容：如何更新旧的博客文章以利于SEO内容更新：分步策略（基于50多篇文章的更新）7. 自动化内部链接以获得更好的 PageRank 权重传递添加相关的内部链接有助于用户和谷歌机器人更好地浏览你的网站，并使你的网页在谷歌上排名更高。但是，手动查找添加新链接的机会和实际添加链接的过程是很繁琐的。Ahrefs Site Audit（网站诊断）中的内部链接机会报告通过查看每个页面排名前 10 位的关键词，会给出建立内部链接机会的建议。当然你也可以使用 WordPress 的付费插件，如 Link Whisper。它还可以给你内部链接建议，但最重要的是，可以帮助你轻松地添加它们。与单独编辑每个页面相比，点击一个按钮就可以完成内部连接的制作。Link Whisper 还为完全自动化的链接提供了一个自动链接选项。但它远非完美，所以你可能最好还是投入一些时间在这上面。下面就是关于该插件的很好的视频示例：https://youtu.be/ZD3e4pMmcyo?t=4318. 优化图像加载的速度大型网页图片是导致你的网页速度变慢的罪魁祸首之一。下面是如何自动化优化它们的方法。你可以通过 TinyPNG 或 Imagify 的工具和插件批量上传图片，自动减少图片文件大小，同时保留质量。一旦图像被上传，使用缓存和懒加载来优化在网页上显示图像。这样做可以提高页面加载速度。利于用户体验。WP Rocket 可以让用户选择进行 “懒加载” 来激活这个功能。9. 通过聚合优化你的关键词调研数据关键词聚合就是将一组相互关联的关键词归类在一起。这么做的好处是：帮助你整理你在关键词研究中发现的成千上万个关键词。给你提供关于如何构造你的网站、页面和内容的想法或灵感。你首先需要一个类似 Ahrefs Keywords Explorer（关键词分析）的工具来获取一个全面的关键词研究文件。然后用像 Keyword Insights 这样的关键词聚合工具来处理它们。在这个关于 business ideas 的例子中，报告提出：一个关于 “small business ideas” 的内容中心页面。该中心页面内的 40 个子页面之一，其中有一个就是 “creative ideas for business”。你可以在关键词栏中看到该页面所针对的所有相关关键词。这些报告对于与你的团队或客户来说是非常有用的。但要对它们持谨慎态度。你始终都需要人工来判断是否制作该类型的页面。最后自动化SEO可以帮助你节省重复性工作的时间和金钱。这包括，例如，报告、网站诊断、排名统计等。当你把这些任务自动化时，你可以把更多的注意力放在重要的事情上，例如：如何把流量带到你的网站。有问题吗？在 Twitter 找我吧。译者，Park Cheng，歪猫出海创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human:",
  "headers": [
    {
      "level": "H1",
      "text": "自动化SEO：9个可以为你节省时间和金钱的任务"
    },
    {
      "level": "H2",
      "text": "1. 创建SEO报告"
    },
    {
      "level": "H2",
      "text": "2. 获得流量骤降和峰值的警报"
    },
    {
      "level": "H2",
      "text": "3. 监测 SEO 问题"
    },
    {
      "level": "H2",
      "text": "4. 定期获得关键词排名更新"
    },
    {
      "level": "H2",
      "text": "5. 监控你获得或丢失的反向链接"
    },
    {
      "level": "H2",
      "text": "6. 获得内容更新的建议"
    },
    {
      "level": "H2",
      "text": "7. 自动化内部链接以获得更好的 PageRank 权重传递"
    },
    {
      "level": "H2",
      "text": "8. 优化图像加载的速度"
    },
    {
      "level": "H2",
      "text": "9. 通过聚合优化你的关键词调研数据"
    },
    {
      "level": "H2",
      "text": "最后"
    }
  ],
  "author": "Fraser McCulloch"
}