{
  "url": "https://ahrefs.com/blog/zh/seo-for-startups/",
  "slug": "seo-for-startups",
  "title": "初创公司的 SEO：8 个步骤增长预算",
  "description": "不需要大量预算即可开始通过 SEO 增加自然流量，如果想开始为你的初创公司做 SEO，那么你来对地方了。",
  "content": "Mateusz Makosiewicz Ahrefs 的营销研究员和教育家。 Mateusz 在推广代理、SaaS 和硬件业务领域拥有超过 10 年的营销经验。平时喜欢创作音乐或享受长距离的散步。 内容 初创公司一直在寻找可规模化的增长策略，这些策略可以用很少的钱或不用钱来完成。搜索引擎优化(简称 SEO)就是其中一种。SEO 不需要大量预算，如果做得好，可以带来几乎自动增长的免费流量。更重要的是，它可以促进其他营销策略并影响营销漏斗的每个阶段。因此，如果想开始为你的初创公司做 SEO，那么你来对地方了。在本文中，我们将介绍以下内容：为什么初创公司应该投资 SEO？如何为初创公司做SEO为什么初创公司应该投资 SEO？如果仍然对 SEO 是否适合你或需要一些数据来支持你的 SEO 计划，这里有三个在初创公司进行 SEO 的原因。 原因 1. 宏观趋势2014 年，Google 和 Millward Brown Digital 对 B2B 决策者的研究和购买习惯进行了研究。该研究表明 71% 的 B2B 研究人员从通用搜索(而不是品牌搜索)开始他们的研究。正如谷歌自己所说，“他们是先找『一項』产品，而不是先找你。”原因 2. 因为人们正在搜索你所做的事情即使你的产品是小众的，人们可能仍会以不同方式搜索它。例如，以无动物乳制品(真正的产品类别)为例，虽然对“无动物乳制品”的搜索需求可能很少(因为这是新概念)，但对“纯素”、“无乳糖”或“低乳糖”等相关搜索的需求就确实很大。原因 3. 因为可以获得免费的自然流量并进行扩展我们目前仅从搜索引擎就获得了大约 110 万的月访问量，如果我们必须使用 PPC 广告购买该流量，估计每月需要花费 200 万美元：因此，虽然 SEO 从来都不是真正免费的(因为必须投资于内容创建和优化)，但你不需要为每个用户和每次访问付费，这就是与广告不同的地方。如何为初创公司做SEO按照以下 8 个步骤，以正确的方式开始在初创公司中进行 SEO。步骤 1：获得支持在创业初期你需要说服谁开始做 SEO？首席营销官、首席财务官、首席执行官、投资者、营销团队，或者你自己？不管是谁，归根结底都是提高底线对吧？首先，SEO 是一项不会在一夜之间赔本的投资，进行关键字研究、创建内容和推广它需要时间。Google 或任何搜索引擎甚至需要时间来抓取你的内容并将其编入索引。但是 SEO 可以与其他任何东西不同，它可以带来回报，Ahrefs 就是这方面的活生生的证明。我们是一家收入八位数的 ARR 公司，其营销策略建立在 SEO 内容之上。如果需要说服的人对营销感兴趣，要获得支持有一个很好的方法是从 SEO 的好处开始说起。通过说明 SEO 推动的营销策略(主要是内容营销)来解释 SEO 的好处，内容营销有许多不同的目的：提高知名度并吸引潜在客户帮助吸引受众并建立信任度帮助客户转化帮助建立忠诚度和复购率正如我刚提到的，内容营销也有综合效果。换句话说如果使用 SEO 的方式来创建内容，则 SEO 的归因将触及营销漏斗的每个阶段。但是，如果需要说服只关心对公司收入的影响的人也没关系。你只需要说那个人的语言，例如使用一个图表来可视化你的投资盈亏平衡点：了解更多：如何说服你的老板投资 SEO步骤 2：设定目标并获取资源如果你已经准备好做 SEO，那么是时候进行下一步了：设定目标并为后续准备资源。如何设定 SEO 目标SEO 的最终目标是通过自然搜索接触潜在用户并将其转化为客户，但这是最高目标很难实现，因为它没有告诉你如何达成。一种更有效的方法是将宏伟的目标分成更小的“小目标”，以便更接近结果。可以将你的 SEO 目标想象成一个金字塔，结果在顶部，较小的目标在较低的层次上领先。这个想法是从底部开始，然后按照自己的方式工作。例如，假设目标是在六个月内在某个关键字中排名前三，此结果的目标金字塔可能如下所示：如你所见，我们将无法将某些单一动作(让关键字排名更高)的任务分解为更小的、可行的任务，因为这些任务很有可能影响结果。与切分任务、可行的步骤同样重要的是，定义如何衡量它们。在上面的例子中，我们使用 Ahrefs 的网站分析来衡量我们获得了多少反向链接。了解更多：如何通过 3 个示例设置正确的 SEO 目标你需要的资源资源意味着成本，创业公司需要谨慎对待，虽然 SEO 不需要任何广告预算或超级昂贵的工具，但这并不是一个没有成本的过程。SEO 需要这些东西才能工作：研究优化内容反向链接测量工具如果你是一个团队，没有建立团队或外包的预算，那么除了学习所有这些东西，并应用在目前正在做的事情与工作上之外别无他法。不过不用担心，有了正确的建议、优先级和工具，一切都是可行的。如果你的初创公司有一些预算用于 SEO 相关角色，可以选择以下选项： 聘请具备上述所有技能的人 — 他们要么是超级明星，要么是拥有各种营销业务的人，更可能在另一家创业公司。超级明星可能超出你的预算，但后者应该很可能找到。毕竟内容营销和搜索引擎优化密切相关。 聘请有写作经验并对 SEO 感兴趣的人 — 然后给他们一些时间在工作中学习 SEO，网上有很多优秀的学习材料，比如我们完全免费的 Ahrefs 学院或这个博客。 雇用在 SEO 方面取得一些成功的人，并赋予他们外包的能力 — 经验丰富的 SEO 专业人士应该能够制定内容策略，尽管如此，他们仍需要能够将部分流程(如内容创建或链接构建)外包以快速变动。下一站：工具。对初创公司来说幸运的是，SEO 领域中有很多免费和免费增值的工具，我们已经在本文中收集了 45 个最好工具的列表。在初创公司中使用 SEO 工具，基本上有两种选择： 使用免费工具(尽可能使用) – 可以使用免费 SEO 工具做很多事情，我将在本指南中向你展示。这里需要注意的是，你将在不同工作流程上使用各种工具，并且数据是有限制的。 尝试不同的高级 SEO 工具 – 完成后升级最适合你的工具，如果在实施 SEO 的过程早期就包含这些项目，你将拥有优质的数据和功能，从一开始就可以帮助你(和你的团队)更有效地工作。步骤 3：让你的技术 SEO 井然有序技术 SEO 是优化网站以帮助 Google 等搜索引擎查找、抓取、理解网页并将其编入索引的过程，除非谷歌能做到以上所有的事情，否则排名的机会微乎其微。简单来说，技术 SEO 对初学者友好的方式是：透过解决像 Ahrefs 站长工具(AWT) 这样的工具的问题来引起你注意。AWT 的众多功能之一是针对 100 多个 SEO 问题(包括技术问题)来检视网站的健康状况，如果 Google 或任何其他搜索引擎在抓取和索引你的网站时存在潜在问题，AWT 通常会通知你。例如，它可能会发现有 noindex 标签的页面会阻止搜索引擎对它们进行索引。当在报告中点击该问题时，将获得有关其解释以及解决方法说明：为了补充 AWT，我们在知识库中有一个完整的部分，专门用于了解 SEO 问题以及如何修复它们。AWT 的另一个很酷的事情是，即使忘记定期检查网站的健康状况，你也会定期收到显示错误状态的电子邮件(如下所示)：了解更多：技术 SEO 初学者指南步骤 4：进行关键字研究 关键字研究是 Google 中找到目标客户正在搜索的内容，然后分析比较这些术语來排序最佳机会的优先级。可以在我们的关键字研究初学者指南中了解如何做到这一点，但由于大多数初创公司几乎没有“权威”和品牌资产，我们建议最初先鎖定低竞争的关键字，可以在没有很多反向链接或高网站权威的情况下为其排名。因此，舉例來說像是宠物保险初创公司可能很难对“宠物保险”这样的关键字进行排名，因为 SERP (搜索引擎结果页面)上排名第一的主要是具有大量反向链接的页面。我们的关键字难度 (KD) 分数表明需要来自大约 932 个网站的反向链接才能进入前 10 名：但是在这个广泛的主题中，可以找到低竞争的关键字，例如“法国斗牛犬宠物保险”。你可以使用关键字研究工具(如 Ahrefs 的关键词分析)大范围查找低竞争的关键字，只需在输入一个主题，转到匹配项报告，然后将你的 KD 设置为最大 20。因此对于像“宠物保险(pet insurance)”这样的“种子”关键字，将获得 426 个可以为其创建内容的低竞争潜在关键字创意。请注意这些是潜在关键字的提示，因为在最后选择关键字之前需要考虑更多因素，例如搜索意图、竞争对手的品牌资产和流量潜力，我们在寻找低竞争关键字的指南和本视频中解释了如何评估这些因素。除此之外，还可以从竞争对手的低竞争关键字中获取灵感。以下是在 Ahrefs 的网站分析中找到这些内容的方法：输入竞争对手的域点击搜索转至自然搜索关键字 2.0 报告添加 KD 过滤器设置为最大 20举例来说，如果经营一家设计软件初创公司并与 Invision 竞争，可以看到它排名的所有低竞争关键字：这只是一个筛选有价值目标的案例，在这种情况下，这可能呈现“红色调色板”，因为它具有较低的 KD 分数和相当高的搜索量。此外，你可以轻松创建搜索者似乎正在寻找的内容类型(红色调色板灵感列表)：步骤 5：创建内容现在你已经知道要锁定哪些关键字，需要创建高质量、优化的内容来吸引自然流量，这片拼图有几个部分。A. 确保你了解你的受众能知道人们在网上搜索什么是很强大的，但是仅依赖 SEO 指标会使你无法关注阅读你内容的人。这就是为什么有时需要扩大研究范围，并将搜索引擎优化结果与市场研究联系起来的原因。进入市场策略的一个要素是目标受众，这对为内容选择主题至关重要。因此在创建第一条 SEO 内容之前，请确保你已经准备好买家的用户画像(persona)了。用户画像是一个半虚构的人，代表客户的共同(典型)特征，以下是我们产品的示例：B. 以搜索意图来设计内容搜索意图是指搜索者正在寻找的内容，这很重要，因为 Google 希望对有用的内容进行排名，因此除非你的内容符合用户意图，否则可能不会获得排名。要了解关键字背后的意图，应该针对我们所说的搜索意图的三个 C 来分析搜索结果： 内容类型 – SERP 中是否有主要的内容类型，例如博客文章、产品页面、视频或着陆页面？ 内容格式 – SERP 中是否有主要的内容格式，例如指南、列表、新闻文章、观点或评论？ 内容角度 – SERP 中是否有一个主导角度，例如时事更新的内容或针对初学者的内容？让我们快速分析一个例子，以下是将美国的“SEO tools”放入 Ahrefs 的关键词分析后可以看到的内容：你能认出这里的三个 C 吗？ 内容类型：几乎都是博客文章。 内容格式：几乎都是列表型文章。 内容角度：几乎都是免费工具列表。如果不使用关键词分析，可以使用我们免费的 SEO 工具栏查看几乎所有国家/地区的 SERP：C. 计划、发布、重新使用在这个阶段可能有几十个内容创意，那么你将如何管理和创建所有这些内容？专业内容创建者常见的做法是保留内容日历，它是一个用于组织、管理和安排内容制作的系统。没有一种方法可以创建内容日历，首先内容日历应该只对你和你的组织有用，可以使用 Google 日历，在 Notion 或 Trello 等应用程序中创建看板，在 Asana 之类的应用程序中创建项目，或者将所有内容保存在一个好的电子表格中。某些类型的信息值得保留在内容日历中：主题作者负责人状态截止日期相关元数据(商业潜力、漏斗阶段、目标用户画像等）格式渠道链接到正在进行的工作在 Ahrefs，我们使用 Notion 将所有内容保存在一个地方(日历、附件、评论等)，这是我们所做其中一篇文章的内容日历卡：当谈到写作、录制和创建内容的行为时，这是一件有点私人的事情。毕竟，人们有不同的工作方式和保持创造力。尤其是在小型初创企业中，任务往往具有相当程度的自主权，因此大多数事情都将“由你决定”。但是在为业务创建内容时，最好开发某种方法并在发布内容之前获得反馈。这样做的好处是，从一开始就开发有效的实践，将帮助你在以后扩展内容的创建过程，这里有一些提示： 从大纲开始计划你要说的话 — 这将避免写不相关的事情或写得太少/太多。 寻找一些关于写作/录音/编辑的技巧 — 这可以以不同的方式帮助你：提高工作效率、以更吸引人的方式写作、或者任何你觉得可能需要的东西。尝试一些试验和测试的方法，比如倒金字塔方法(把“需要知道”放在“很高兴知道”之前)。 在此过程中创建标准操作程序(SOP) — SOP 是解释如何执行特定任务的文档，例如命名图像。显然 SOP 对于一个人来说并不如一个团队来的重要，但是在内容创建过程中，每个额外的人员都会让创建 SOP 的需求更加重要。 获得反馈 — 因为获得第二意见总是好的。如果想知道 Ahrefs 的内容创建过程，这里有一张图表解释：为了使事情更加高效，可以将某些内容重新用于多个渠道，以从每个部分中获得更多的收益。这种策略对初创公司和大公司都很有效，而我们一直在这样做。举例来说，我们有一个关于长尾关键词的视频和推文，这两个都是我们从原始博客文章中重新利用的。步骤 6：优化现有内容有时获得更多自然流量的最好方式是优化现有内容，原因有二：现有的内容可能已经有排名。现有的内容可能是匹配搜索意图的最佳方式。举例来说，对于关键字“3d 打印机”的排名，Google 有一个非常清晰的型态：购买指南。它甚至对指南的排名高于来自成熟的 3D 打印机制造商的页面(尽管他们有更多的反向链接)：似乎大多数搜索这个词的人都处于购买模式，因此，谷歌试图将其与提供购买 3D 打印机帮助的页面相匹配。有趣的是，一家 3D 打印机制造商在指南中名列前茅：Formlabs。它找到了一种优化现有内容的方法尽可能提高 SERP 上的排名。它混合了 3D 打印机指南和产品分类页面。你能看出它做了什么吗？它的标题是“3D 打印指南：3D 打印机、材料和应用的类型(3D Printing Guide: Types of 3D Printers, Materials, and Applications.)”。它提供了一些基本定义，解释了 3D 打印的过程，展示了一些类型的 3D 打印机，並给出了一些关于如何选择的提示等等，这几乎是你想要从指南中获得的一切。 但与此同时，看到的唯一 3D 打印机是 Formlabs 产品，最重要的是，它们是你在向下滚动到指南的部分之前首先看到的内容。从导航的角度来看，这是 Formlabs 的主要产品类别页面，出于这个原因，任何链接到各种 Formlabs 3D 打印机的人都必须链接到此页面，很可能带有“3D printer”锚文本的不同变体。此外，该页面还充当内容中心，将“链接权重”传播到 Formlabs 网站的其他部分。从 SEO 的角度来看，是什么影响了这一切？该页面针对高“商业潜力”的关键字进行了优化：“3d printers”。由于该关键字的父主题具有更高的搜索量和相同的搜索意图，因此“3d printer”关键字也获得该排名。该页面从关键字“3d printers”获得大量自然流量，从父主题“3d printer”获得更多流量，如下面的屏幕截图所示：另一个例子：Canva 在这个登陆页面的关键字“meme generator”在美国排名第 4，如您所见，Canva 没有理由创建博客文章来为该关键字排名。可以在我们的页面 SEO 初学者指南的第三部分中了解有关优化现有内容的更多信息。步骤 7：建立链接完成 SEO 内容后，是时候将指针放在可以说是最重要的排名因素上：链接。内部链接让我们从简单的事情开始：在同一网站上的不同页面之间进行链接。当你进行内部链接时，会发生以下情况： 帮助新页面被搜索引擎发现 — 因为它提供了一个新页面的爬行路径。 在页面之间传递链接权限 — 这样可以提升表现不佳的页面。 帮助搜索引擎了解页面的内容 — 这很重要，因为如果想对相关关键字进行排名，需要谷歌了解你的内容的含义。要查找相关的内部链接机会，请查看 Ahrefs站长工具中的 Link opportunities 报告。它会显示未链接的关键字，可以作为到另一个页面的链接。例如，从一篇关于排名跟踪器的博客文章中，AWT 建议我们可以将关键字“keyword research”链接到“keyword research tools”列表。还有一些内部链接的好做法，我们在 SEO 内部链接优化：实战指南中收集了最重要的内容。监视竞争对手的链接除非身处某种“前所未闻”的蓝海市场，否则总有人在你面前先开辟道路了。换句话说，别家公司已经完成了关键字研究、创建了内容并建立了指向其网站的链接。到目前为止，竞争对手可能比你领先几步，但好消息是可以从他们停下的地方开始，抢走他们的风头，听起来不错吧？这种链接构建策略是关于分析竞争对手的链接，有两件事可以学习： 可以复制的链接 — 竞争对手的部分链接来源可能也应该链接到你的资源，例如最佳应用列表、评论等，可以向这些资源进行推荐并获得精选和链接。 反向链接类型的模式 — 可以研究哪些类型的链接帮助你的竞争对手排名，并查看哪些策略和策略可能对你有用。例如，可能会发现竞争对手通过创建其他网站引用和链接的独特研究，建立了多个反向链接。获取评论 让产品在线評論有明显的好处：品牌和产品知名度、传入流量，以及通常會獲得有价值的产品反馈。但在那个故事中还有另一个“沉默的英雄”：反向链接。假设你是一家制造电动滑板车的科技初创公司，以下是有关如何查找评论网站的两个想法：将竞争对手的 URL 插入 Ahrefs 的网站分析中，转到外链报告，并过滤包含“评论”、“指南”或“最佳”等词的引用 URL 的结果，这将显示已评论竞争对手的网站。从那里可以浏览结果并将你的产品推广到对你来说很突出的网站。这里有一条建议：不要仅仅为了获得反向链接而要求评论，最重要的是，考虑评论如何影响产品的销售，并且只有在你的产品准备就绪时才这样做，反向链接只是这个游戏的奖励。数字公关让媒体提及你的业务本身就很棒，但除此之外，还可以通过故事中包含的链接提高排名。初创公司通常具有这种新颖性，这使它们成为新闻报道的理想选择。这是 The Next Web 上的一个示例故事，它讲述了一家名为 Sprig 的初创公司，该公司创建了一个前所未有的人工智能工具(当然，它具有指向该公司的链接)。一些你从这种方式获得的链接将是“nofollow”，并且可能不会传递“链接权重”，但这不应该因为这样就不做。即使链接没有直接提升排名，这也是一个能在别的网站上被提及的机会。最重要的是给你额外的认可，这些可以提高你的排名。以下是媒体呈现故事的更多秘诀(并获得链接)：在像 HARO、ResponSeource、Profet 或 SourceBottle 等网站上回答记者提出的问题，还可以扫一眼 Twitter 上 #journorequest 的 hashtags，这样你可以获得引用并要求链接到你的介绍上。 撰写并投稿新闻稿到信誉良好且相关的媒体网点，不要过度，否则下次你的东西会被忽略。此外重点关注新闻价值，你可能会更常在行业杂志中获得曝光，因此可以在更多场合尝试对这些类型的网站投稿。 尝试在投稿中包含“链接价值”，像是独特的数据，不要忘记附上高质量的图像。延伸阅读 链接建设初学者入门指南 9个简单的链结建立策略 资源页面连结构建：你需要的唯一指南 3 个白帽链接建筑技术获得更多链接 透过客座博客做SEO：如何大规模构建高质量的连结 步骤 8: 跟踪和测量最后，如何衡量 SEO 的成功？应该专注于哪些指标？所有关系都可以设置为你的目标，我在本指南的第二步中有解释到。根据你的目标，将最常跟踪SEO指标是： 自然搜索流量 - 从 SERPs 获得的访问流量。可以使用像 Google Analytics、Matomo、Google Search Console 和 Ahrefs 等网站分析软件来衡量这一点。 自然搜索关键词 — 网页排名的关键字。一些网站分析工具(例如 Google Analytics)会隐藏“未提供(not provided)”类别下的一些关键字；而其他网站(如 Google Search Console)显示有限数量的关键字；而像 AWT 这样的工具将解决此问题。 关键字排名 — 随着时间过去追踪不同关键字的各种排名。对于基本、无成本的解决方案，转到我们免费的关键词排名检工具。 反向链接 - 从其他网站链接到你的网站。正如我已经提到的那样，反向链接是最重要的排名因素之一。Ahrefs 的免费外链检查工具将帮你追踪到任何网站上，最多 100 个反向链接。你可以轻松找到跟踪所有最重要指标的免费工具，他们付费版本通常允许透露更多数据，使用高级过滤器，并获得更多的洞察(如数据趋势和历史数据)。最后的想法 不需要大型预算，开始透过 SEO 让你的自然搜索流量成长。你可以抛弃免费工具，付费工具并不会让你面临破产。如果你对 Premium SEO 工具进行投资，请考虑一下一体化的工具集，如 Ahrefs，其中包含你所需要的一切。与生活中的许多事情一样，一开始总是最难的，可能需要一些时间来获得 SEO 并且持续运行。但是一旦你这样做，你可以一遍又一遍地使用相同的策略，以获得具有综合效果的相同结果。我们在本指南中所涵盖的内容都可以很好的被消化，因此每当你需要所有的重要事项提醒时，都可以拿出我们的 SEO 清单。还有疑问吗？ 请在 Twitter 上告诉我。译者，李元魁，SEO 分解茶博客创始人 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Mateusz Makosiewicz Ahrefs 的营销研究员和教育家。 Mateusz 在推广代理、SaaS 和硬件业务领域拥有超过 10 年的营销经验。平时喜欢创作音乐或享受长距离的散步。",
  "headers": [
    {
      "level": "H1",
      "text": "初创公司的 SEO：8 个步骤增长预算"
    },
    {
      "level": "H2",
      "text": "为什么初创公司应该投资 SEO？"
    },
    {
      "level": "H3",
      "text": "原因 1. 宏观趋势"
    },
    {
      "level": "H3",
      "text": "原因 2. 因为人们正在搜索你所做的事情"
    },
    {
      "level": "H3",
      "text": "原因 3. 因为可以获得免费的自然流量并进行扩展"
    },
    {
      "level": "H2",
      "text": "如何为初创公司做SEO"
    },
    {
      "level": "H3",
      "text": "步骤 1：获得支持"
    },
    {
      "level": "H3",
      "text": "步骤 2：设定目标并获取资源"
    },
    {
      "level": "H4",
      "text": "如何设定 SEO 目标"
    },
    {
      "level": "H4",
      "text": "你需要的资源"
    },
    {
      "level": "H3",
      "text": "步骤 3：让你的技术 SEO 井然有序"
    },
    {
      "level": "H3",
      "text": "步骤 4：进行关键字研究"
    },
    {
      "level": "H3",
      "text": "步骤 5：创建内容"
    },
    {
      "level": "H4",
      "text": "A. 确保你了解你的受众"
    },
    {
      "level": "H4",
      "text": "B. 以搜索意图来设计内容"
    },
    {
      "level": "H4",
      "text": "C. 计划、发布、重新使用"
    },
    {
      "level": "H3",
      "text": "步骤 6：优化现有内容"
    },
    {
      "level": "H3",
      "text": "步骤 7：建立链接"
    },
    {
      "level": "H4",
      "text": "内部链接"
    },
    {
      "level": "H4",
      "text": "监视竞争对手的链接"
    },
    {
      "level": "H4",
      "text": "获取评论"
    },
    {
      "level": "H4",
      "text": "数字公关"
    },
    {
      "level": "H3",
      "text": "步骤 8: 跟踪和测量"
    },
    {
      "level": "H2",
      "text": "最后的想法"
    }
  ],
  "author": "Mateusz Makosiewicz"
}