{
  "url": "https://ahrefs.com/blog/zh/seo-content-strategy/",
  "slug": "seo-content-strategy",
  "title": "如何创建一个SEO内容策略（遵循Ahrefs的框架）",
  "description": "这是一份关于Ahrefs的SEO内容策略如何运作的指南。用它作为你的灵感。",
  "content": "Si Quan Ong 营销@Ahrefs。 我爱阅读，爱跳霹雳舞，爱尝试随机的生活实验。 内容 SEO内容是为在搜索引擎上排名而设计的内容。因此，SEO内容策略就是指，你将如何使用这些内容来支持你的业务目标。我们的 SEO 内容策略可以归纳为一句话：我们创建和维护高质量的、以搜索为重点的内容。这些内容的主题都具有商业潜力、搜索流量潜力、和排名潜力。我们精心设计了这个句子。每一个词都有独特的意义。如果你去掉其中任何一个，一切都会不完整。让我们来看看我们的内容策略是如何运作的：内容1. 寻找具有搜索流量潜力的主题创建 SEO 内容的目的是为了在谷歌上获得高排名。这意味着你需要瞄准你的潜在客户正在搜索的主题。 这里是寻找具有搜索流量潜力的关键词的最快速方法：转到 Ahrefs Keywords Explorer（关键词分析）输入一些与您的网站或利基相关的广泛的关键词（例如，我们可以寻找 marketing、seo、keyword、以及和我们博客相关的关键词）转到 Matching terms（有相同的词）报告筛选出具有 Traffic Potential（流量潜力、TP）的关键词从这里开始，你要用肉眼观察报告，找到你的潜在客户正在搜索的关键词。小提示. 流量潜力是指对一个关键词排名靠前的页面的每月自然搜索流量的估算值。由于网页往往会有许多关键词的排名，所以流量潜力是一个比搜索量更可靠的数值。PRO TIP 如果你的竞争对手获得了大量的搜索流量，而并不是来自品牌关键词。那么你有可以针对这些关键词。 如何做：进入 Ahrefs Site Explorer（网站分析）输入竞争对手的域名进入 Top pages（热门页面）报告这份报告会按照估算的自然流量向你显示一个网站中的热门页面，以及向每个页面发送最多流量的关键词。因此，以我们的博客为例，我们可以用 moz.com 来分析：阅读更多： 关键字研究：Ahrefs的初学者指南 2. 检查其商业价值一个关键词的商业价值，或商业潜力，是指在内容中覆盖一个给定的关键词时，同时推销你的产品的难易程度。例如，如果你拥有一家销售咖啡设备的网店，就会更容易为最佳咖啡机这样的主题推销自己的产品，而不是为什么咖啡让我犯困。 具有较高商业潜力的关键词是你在 SEO 内容策略中应该优先考虑的。 这里有一张为关键词的 “商业潜力” 打分的小抄：给一个关键词打分取决于它对你的业务有多大价值。因此，没有所谓正确的打分方法——对你来说是 “3”，对别人来说可能是 “1”。 3. 分析排名的潜力由于各种原因，有些关键词比其他关键词更难排名。因此，虽然这并不意味着你完全规避困难的关键词（特别是它们有商业价值的话），但你在定位它们时应该考虑到排名难度。在 Ahrefs，排名潜力意味着以我们现有的资源将其排在前三名是可能的。但我们怎么知道我们能排在前三名呢？我们通过评估四件事来做到这一点。反向链接反向链接是谷歌的顶级排名因素之一。它甚至自己也这么说。 这意味着，目前排名靠前的网页拥有的高质量反向链接越多，就越难与之竞争。要想知道你大概需要多少个反向链接才能在搜索结果中排名前10位，可以在 Ahrefs Keywords Explorer（关键词分析）中查看 Keyword Difficulty（关键词难度、KD）的得分。例如，如果我们想获得 “how to make kimchi” 这一关键词的排名，估计我们需要来自~77个网站的反向链接。为了进行更彻底的评估，请滚动到 SERP overview （SERP 概述），并检查域名栏，以查看每个页面的链接网站的数量。然而，这些数字只告诉你反向链接的数量。但是，质量也很重要。因此，为了了解链接质量，你需要审查每个页面的反向链接情况。你可以通过点击反向链接栏中的数字来做到这一点。阅读更多：如何做一个基本的反向链接诊断（在30分钟内）权重谷歌代表曾表示，谷歌不会评估一个网站的权重。但是，许多 SEO 认为，权重网站更容易在谷歌上获得排名，因此，在评估排名难度时，通常会考虑到网站的权重指标——例如，Domain Rating（域名评分、DR）。 之所以产生怀疑，是因为 SEO 认为，即使谷歌没有内部网站权重指标，网站权重仍然可以影响排名。高 DR 网站往往有更多的高权重页面（来自反向链接），因此，来自这些页面的内部链接可能有助于其他页面的排名。搜索者更喜欢在某些搜索结果中看到可信赖的品牌。如果你认为这样做有意义，并想评估网站的权重，那么你可以在 Keywords Explorer（关键词分析）中 的SERP概览部分检查排名靠前的网站的 DR 分数。 如果它们都比你的 DR 高得多，你可能要优先考虑其他关键词。搜索意图谷歌知道为什么用户在搜索一个特定的关键词，并会给他们提供他们想看到的东西。 例如，谷歌知道搜索 how to make kimchi 的人想了解如何制作这种韩国发酵菜。因此，正如预期的那样，搜索结果主要是如何做的指南：为了分析每个关键词的搜索意图，在谷歌上搜索你的目标关键词，并分析 SERP 的三个C：内容类型 - 它们是博客文章、登陆页面、产品页面，还是其他的？内容形式 - 它们是列表、操作方法、食谱、工具，还是其他什么？内容角度 - 是否有一个主要的卖点，比如它的难易程度？你要确保你能够满足你想要的目标关键词的搜索意图。例如，如果 SERP 要求你建立一个免费的反向链接工具，如外链接检查器，而你没有能力这样做（如一个巨大的链接数据库），那么你很可能无法竞争这个关键词。阅读更多： 什么是搜索意图？初学者的完整指南 质量如果有人只是为了创作一篇博文而测试 47 台空气净化器，那么你在内容质量上很难打败他们。这也难怪他们在竞争激烈的关键词中排名第一：因此，要想打败 Wirecutter，你很可能必须审查类似数量的空气净化器，或者做一些独特的、不同的事情。这将需要大量的时间和资源。 因此，对于你的目标关键词，你要确保在内容质量上击败排名靠前的网页是在你能力范围内的。 在审查了你所需要的四个属性的关键词后，你可以给它们一个 “排名潜力” 的分数：阅读更多：关键字的难度：如何预估你的排名机会 4. 创建高质量、以搜索为重点的内容寻找具有商业潜力、搜索流量潜力、和排名潜力的关键词是我们整个内容策略的核心。 它会让我们创建的内容不仅在谷歌上排名靠前，而且还直接与我们的商业目标挂钩。毕竟，如果人们不购买，产生大量的有机流量是没有意义的。 当我们有一个符合我们标准的关键词列表时，就是创造内容的时候了。具体来说，就是高质量、以搜索为核心的内容。 让我们把它分解一下。 以搜索为核心是指内容符合其主要目标关键词的搜索意图。在评估排名潜力的过程中，你已经分析了搜索意图。剩下的就是要与之匹配。例如，如果你的目标是 ”how to drive traffic to your website“ 这一关键词，那么你很可能要创建一个关于驱动流量的最佳方法的列表文章：而这正是我们所做的：高质量是主观的。每个人的定义都会不同。在 Ahrefs，我们重视内容的R-E-A-C‑H：Real（真实）—— 真实和原创。带来新的东西。Experienced（有经验）—— 由具有专题知识和专长的人撰写。Accurate（准确）—— 事实有值得信赖的来源支持，观点表达清晰。Clear（清晰）—— 解释清楚，没有花哨或专业术语。必要时提供插图。Helpful（有帮助）—— 真正解决了当前的问题。不只是为了文字而文字。我们尽可能地确保我们制作的所有内容符合这些标准。(你认为这个帖子符合R-E-A-C-H吗？😄)如果你正在寻找关于我们如何创建 SEO 内容的确切步骤，我建议你阅读这篇文章或观看这段视频：https://www.youtube.com/watch?v=8BdZ0dUu7VQ阅读更多：内容创作：初学者的完整指南 5. 保持高质量、以搜索为重点的内容我们不只是发布我们的内容并把它丢一旁。我们会积极维护它。这意味着经常更新或改写旧的内容。我们为什么要这样做？有几个原因：你的内容不一定能在第一次尝试中获得排名。你的页面的排名可能会下降。对于一些关键词，搜索意图可能会改变。你的内容中的信息可能会过时，从而影响质量。SERP不是静态的，其他人可能会超越你。你必须找出他们超过你的原因，并再次击败他们。 例如，我们最近更新了我们关于免费SEO工具的帖子。看看我们更新后激增了多少流量：我们如何确定哪些内容需要更新？每个季度，Ahrefs 内容团队的每个作家都会检查自己的内容，并确定两种类型的内容：需要更新的页面。需要重写的页面。然后，每个作家都会与我们的内容主管 Joshua Hardwick 进行通话，讨论如何改进这些内容。当大方向达成一致时，每个作家就回去重写他们的内容。 虽然这是我们目前的流程，但你不必像我们这样做。事实上，如果你是一个 WordPress 用户，查看哪些内容需要更新的最简单方法是安装我们免费的 WordPress SEO 插件。为每个页面设置一个目标关键词，它将告诉你如果你排名开始下降。然后你可以调查一下，看看是不是因为内容需要更新。阅读更多: 重新发布内容：如何更新旧的博客文章以利于SEO 最后我们的 SEO 内容策略并不复杂。事实上，我们是故意让其简单化的。因为这会使得它易于持续遵循，这可能也解释了为什么我们在这方面取得了成功。 有问题吗？在 Twitter 上找我吧。译者，Park Cheng，歪猫出海创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Si Quan Ong 营销@Ahrefs。 我爱阅读，爱跳霹雳舞，爱尝试随机的生活实验。",
  "headers": [
    {
      "level": "H1",
      "text": "如何创建一个SEO内容策略（遵循Ahrefs的框架）"
    },
    {
      "level": "H2",
      "text": "1. 寻找具有搜索流量潜力的主题"
    },
    {
      "level": "H2",
      "text": "2. 检查其商业价值"
    },
    {
      "level": "H2",
      "text": "3. 分析排名的潜力"
    },
    {
      "level": "H4",
      "text": "反向链接"
    },
    {
      "level": "H4",
      "text": "权重"
    },
    {
      "level": "H4",
      "text": "搜索意图"
    },
    {
      "level": "H4",
      "text": "质量"
    },
    {
      "level": "H2",
      "text": "4. 创建高质量、以搜索为重点的内容"
    },
    {
      "level": "H2",
      "text": "5. 保持高质量、以搜索为重点的内容"
    },
    {
      "level": "H2",
      "text": "最后"
    }
  ],
  "author": "Si Quan Ong"
}