{
  "url": "https://ahrefs.com/blog/zh/seo-for-new-website/",
  "slug": "seo-for-new-website",
  "title": "新网站的 SEO: 8个重要步骤",
  "description": "确保您的网站对 SEO 友好的最佳时机是在您构建网站时。 我们将该过程提炼为八个关键步骤。",
  "content": "Si Quan Ong 营销@Ahrefs。 我爱阅读，爱跳霹雳舞，爱尝试随机的生活实验。 内容 确保你的网站SEO友好的最佳时机莫过于你在构建网站时。以下是你应该采取的所有步骤：内容1. 选择一个域名选择域的过程很容易过于复杂。但在大多数情况下，选择一个简短而令人难忘的品牌域名比试图将某些关键词硬塞进域名要好。所以，如果你已经有了，那就去做吧。或者，如果你正在为你的企业设立一个，你的企业名称也很好用。当谈到顶级域（TLD）时，例如.com，谷歌表示TLD对SEO没有影响。因此，我们像对待其他通用顶级域一样对待所有新的顶级域名。John Mueller, Search Advocate在大多数情况下，没有必要绞尽脑汁思考这个网站，因为它是国际公认的。一旦你决定了一个域名，就去域名注册商那里看看是否有可用的域名，比如谷歌域名(Google Domains)或 Namecheap。如果它不可用，你将需要重复这个过程，直到找到一个既可用又适合你业务的名称。2. 选择一个网站平台网站平台可以让你轻松地创建和管理一个网站。有两种类型:托管平台-他们托管网站，给你现成的设计，并让你添加和编辑内容，而无需触及代码。例如 Wix、 Squarespace 和 Shopify。自托管平台——这些平台允许你添加和编辑内容，无论是否使用代码。但是，你必须自己主持和安装它们。例如 WordPress 和 Ghost。大多数 SEO 都推荐 WordPress ーー一个自我托管的开源平台。 SEO 更喜欢 WordPress，因为它是可定制的ーー你可以随心所欲地编辑代码。但这并不意味着使用 WordPress 必须是技术性的。有数以百万计的插件，你可以安装，为你做各种各样的任务。这些也包括 SEO 插件。要使用 WordPress，你不必知道如何编写代码。延伸阅读WordPress SEO：20个技巧和最佳实践3. 选择主机如果你正在使用一个自托管的解决方案，比如 WordPress.org，你需要一个网络主机。我们没有特别推荐的。但是当你在考虑你的选择的时候，注意三个 S:安全性-主机应该为你提供一个免费的 SSL/TLS 证书。服务器位置-数据在服务器和访问者之间传输需要时间。因此，最好选择一个服务器在同一个国家的主机作为你的大部分流量。支持-你会需要24/7的支持。可以考虑在 Reddit 这样的论坛上查看他们的评论，或者在注册之前测试一下他们的支持。4. 为 SEO 成功做准备你现在有了一个基本的网站，你可以配置成SEO友好的。以下是你接下来应该做的事情：设置谷歌站长工具和 Ahrefs 站长工具你需要 GSC 来完成一系列重要的 SEO 任务，比如在你的网站上发现技术错误，提交网站地图等等。设置它非常简单。用你的谷歌账户注册 GSC。你应该看到这个“欢迎”屏幕:选择“域”并输入你的域。然后将提示你验证域。谷歌有明确的步骤指示如何做到这一点:在 GSC 中通过 TXT 验证域名所有权。在 GSC 中通过 CNAME 验证域所有权。如果你陷入困境或不确定，你可以查看谷歌的帮助文章。一旦这样做了，你将能够使用 GSC 并查看你的搜索分析。(因为它是新的，所以现在没有任何数据。)尽管 GSC 对于任何认真对待搜索引擎优化的人来说都是不可替代的，但它在某些方面仍然缺乏。例如，它只提供了一些关于你的网站排名的关键词和链接到你的网站的数据。为了弥补这些不足，你应该设置 Ahrefs 站长工具(AWT)。它是免费的，允许你:审核你的网站是否存在100多个SEO问题（并解释如何解决这些问题）。查看链接到你的网站。查看你的网站排名的自然关键词。查看你的网站收到的自然流量。还有更多。要使用AWT，请创建一个免费帐户。然后添加并验证你的网站。你也可以使用GSC账户进行验证。延伸阅读如何使用谷歌搜索控制台来提高搜索引擎优化(初学者指南)创建逻辑站点结构访问者和搜索引擎应该很容易在你的网站上找到内容。你需要为你的内容建立一个逻辑层次结构，你可以用思维导图勾勒出这个层次结构:思维导图上的每个品牌都代表一个内部链接，即从一个网站的一个页面到另一个页面的链接。内部链接对你的网站至关重要，因为:这就是谷歌和其他搜索引擎寻找新页面的方式。这也是谷歌和其他搜索引擎了解你的页面内容的方式。他们通过查看链接中可点击的单词来做到这一点，这些单词被称为锚文本。内部链接有助于通过PageRank，这是谷歌排名的一个重要因素。延伸阅读为优秀的 SEO 和用户体验构建你的网站结构(5步)使用逻辑 URL 结构我们的建议是做一些清晰的描述，比如 website.com/seo-for-new-website/.其他技术考虑积极的用户体验对你的企业和谷歌都很重要。你需要确保你已经做好了这些准备:使用 HTTPS没人希望自己的个人信息泄露给黑客。你需要使用 SSL/TLS 对站点进行加密。大多数像样的网络主机应该能够提供这种服务，或者你应该能够自己启用它一次点击。之后，你应该会看到 URL 上的挂锁。下面是谷歌 Chrome 浏览器的外观:确保你的网站是手机友好型的现在大多数人使用移动设备搜索，你的网站应该对所有设备都有响应。你可以在 Google Chrome 上使用开发工具轻松地检查这一点:点击浏览器右上角的“ …”下拉列表选择其他工具选择开发工具点击左上角的移动按钮从这里，你可以选择你想要测试的确切设备:避免侵入性广告界面广告是在加载网页内容之前出现的全屏广告。没有人喜欢它们。谷歌也是如此。如果你的网站上没有必要出现这样的弹出窗口，那就避开它们。确保网站加载速度快页面速度是谷歌排名的一个因素。所以花些时间确保你的网站快速加载是非常重要的。你可以使用诸如 PageSpeed Insights 之类的工具来检查页面的性能。5. 开始关键词研究如果没有人搜索某个特定的主题，你就不可能获得自然流量。这就是为什么任何 SEO 策略的第一步都是找出你的目标受众在寻找什么。这就是所谓的关键词研究。最简单的开始方式是使用关键词研究工具。关键词工具是具有 SEO 指标的单词和短语数据库。他们会根据你输入的关键词种子列出一系列想法。例如，你可以开始使用一个免费的关键词研究工具，如 Ahrefs 的关键词生成器。输入一个相关的主题，你会得到多达100个关键词:如果你正在寻找更多的关键词，你可以使用专业的关键词工具，如 Ahrefs 的关键词分析。你将能够看到所有潜在的主题，另外:帮助你做出更好决策的重要关键词指标。过滤器，以缩小你的搜索到最好的，最相关的关键词。例如，使用与上面相同的种子关键词“咖啡”，关键词分析向我们显示了超过300万个关键词。但这太多了。所以，让我们把重点放在我们可以与之竞争的关键词上。我们可以通过添加关键词难度（KD）过滤器来做到这一点。我们还想确保这些关键词可以向我们发送搜索流量，所以我们想添加一个潜在流量（TP）过滤器。看起来像这样：从这里开始，你需要查看列表，挑选出相关的关键词，并将它们添加到可以引用的关键词列表中。（这可以是一个简单的谷歌表单。）延伸阅读如何做搜索引擎优化的关键词研究6. 创建为搜索而优化的页面就像产品经理如何为他们的目标用户设计产品一样，我们也想为我们的内容做同样的事情。在这种情况下，我们希望创建吸引搜索我们主题的人的内容。下面是如何做到这一点:分析搜索意图搜索意图是搜索查询背后的原因。换句话说，为什么搜索者要寻找那个特定的主题？了解搜索意图很重要，因为:知道搜索者为什么要搜索意味着你可以为他们创建正确的内容。谷歌也想知道，这样它就可以提供最相关的结果。因此，通过将你的内容与搜索意图结合起来，你可以在 Google 上排名更高。我们可以通过查看你的主题的排名最靠前的页面并找出三个 C 来识别搜索意图:内容类型——它们是博客文章、产品页面、登录页面还是其他什么？内容格式——它们是教程、列表、操作指南、食谱、免费工具还是其他什么？内容角度——是否有一个主要的卖点，比如低价或它有多容易？例如，假设我们的目标是关键词“如何清洁咖啡机”。如果我们看看Ahrefs中的SERP概述…我们可以看到这些:内容类型——它们大多是博客文章。内容格式——它们主要是操作指南。内容角度——这里有几个角度：“加醋”、“味道更好的咖啡”、“任何种类”和“只需30分钟”如果我们想对这个关键词进行排名，我们必须创建一个清洁咖啡机的操作指南，从特定的角度针对我们所拥有的独特技术。延伸阅读什么是搜索意图? 初学者完整指南 覆盖重要的副主题产品经理可能知道他们的目标用户想要看到什么，但是他们不想假设他们知道一切。你的内容也是一样ーー你不会希望错过潜在的副主题，而这些潜在的副主题是搜索者期望在一篇涉及该主题的内容中看到的。在这种情况下，我们实际上可以发现，通过寻找共同的关键词排名的顶级网页。方法如下:在Ahrefs的关键词分析中输入你的关键词（例如，“获得的媒体”）向下滚动至SERP概述选择三到五篇排名靠前的文章（确保它们相似）单击“打开”，然后选择“内容差距机会”这将打开“内容差距机会”报告，其中显示这些页面正在排名的所有关键词。我们要选择“交叉点”下拉菜单，并选择最高的两个目标（在本例中为4和5）。你可以看到，这些关键词中的许多也映射到了子主题。例如，搜索者想知道：赢得媒体的是什么赢得媒体的例子。赢得了媒体策略。其他类型，如付费和自有媒体。要独一无二虽然你想从当前排名最靠前的页面中获得灵感，但你的目标不是“复制”已经在那里的所有内容。毕竟，如果你的内容和其他人的完全一样，就没有理由特别消费你的内容。所以你要给你的读者一个理由去阅读、分享或者链接到你的内容。最好的方法是确保你的内容是独一无二的。下面是你如何创造独一无二的东西:从你的个人经历中写一些东西——我在这篇文章中写了我自己成为内容创造者的经历。采访你所在领域的专家。众包的意见，专业知识，或来自多个专家的想法-我们采访了四个链接建设专家在我们的国际链接建设的职位。从运行研究或调查创建原创研究-我们调查了439人为我们的职位搜索引擎优化定价。提供一个相反的意见-我们这样做时，约书亚争论为什么谷歌不关心人工智能的内容。使你的内容容易阅读对于你的读者来说，你的内容应该是一种轻松的阅读体验:对层次结构使用描述性子标题(H2-H6)使用项目符号帮助略读使用图像和 GIF (在需要的地方)来分解文本使用简短的句子和段落来避免“文本墙”用大家都能理解的简单词汇像对话一样写，让事情变得有趣大声读出你的文章(编辑时) ，使文章流畅添加页面搜索引擎优化页面搜索引擎优化的重点是帮助谷歌和搜索引擎更好地理解和消化你的内容。遵循以下基本原则:使用标题中的关键词(如果可能的话)写一个引人注目的元描述，在 SERP 上销售你的文章添加简洁和准确的替代文本到你的图像延伸阅读SEO 内容: 初学者指南页面搜索引擎优化: 初学者指南7. 与他人分享你的网站仅仅因为你创建了你的网站并不意味着人们会神奇地发现它。你必须告诉别人你的新网站。以下是一些推广你的网站的入门技巧：不要害羞，告诉你的朋友和家人——他们会支持你的。😄开始建立一个电子邮件列表——这将在未来发布新内容时派上用场。联系你在内容中提到的人——如果你在文章中链接并提到了任何资源，请告诉作者！查找他们的联系方式并发送电子邮件或DM。加入并参与相关的利基社区——无论是在Reddit、Slack、Circle还是Discord上，都要成为这些社区的活跃成员，并在相关时分享你的内容（不要垃圾邮件！）。上面的提示看似简单，但它们将有助于让人们了解你的网站当然，还有更多的想法可以尝试，但确保你真正在推广你的网站比你能找到的闪亮的新策略更重要。延伸阅读如何获得前100个外链13种内容推广策略，让你的内容获得更多眼球15种简单（免费）的方式来推广你的网站8. 跟踪你的表现你会想要监控你的结果，这样你就可以弄清楚哪些是对的或错的要做到这一点，最简单的方法是，将你的目标关键词添加到Ahrefs的排名监控中。该工具将跟踪你网站上添加的所有关键词的排名位置。通过这种方式，你可以很容易地看到你在多个关键词中的表现，以及你是否需要对你的内容进行任何调整。最后的想法SEO并不是一项一蹴而就的任务。但如果你遵循上述流程，你就会开始获得源源不断的自然流量。有什么问题或意见吗？请在推特上告诉我。译者，John Zhao，西品东来创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Si Quan Ong 营销@Ahrefs。 我爱阅读，爱跳霹雳舞，爱尝试随机的生活实验。",
  "headers": [
    {
      "level": "H1",
      "text": "新网站的 SEO: 8个重要步骤"
    },
    {
      "level": "H2",
      "text": "1. 选择一个域名"
    },
    {
      "level": "H2",
      "text": "2. 选择一个网站平台"
    },
    {
      "level": "H2",
      "text": "3. 选择主机"
    },
    {
      "level": "H2",
      "text": "4. 为 SEO 成功做准备"
    },
    {
      "level": "H2",
      "text": "设置谷歌站长工具和 Ahrefs 站长工具"
    },
    {
      "level": "H3",
      "text": "创建逻辑站点结构"
    },
    {
      "level": "H3",
      "text": "使用逻辑 URL 结构"
    },
    {
      "level": "H3",
      "text": "其他技术考虑"
    },
    {
      "level": "H4",
      "text": "使用 HTTPS"
    },
    {
      "level": "H4",
      "text": "确保你的网站是手机友好型的"
    },
    {
      "level": "H4",
      "text": "避免侵入性广告"
    },
    {
      "level": "H4",
      "text": "确保网站加载速度快"
    },
    {
      "level": "H2",
      "text": "5. 开始关键词研究"
    },
    {
      "level": "H2",
      "text": "6. 创建为搜索而优化的页面"
    },
    {
      "level": "H3",
      "text": "分析搜索意图"
    },
    {
      "level": "H3",
      "text": "覆盖重要的副主题"
    },
    {
      "level": "H3",
      "text": "要独一无二"
    },
    {
      "level": "H3",
      "text": "使你的内容容易阅读"
    },
    {
      "level": "H3",
      "text": "添加页面搜索引擎优化"
    },
    {
      "level": "H2",
      "text": "7. 与他人分享你的网站"
    },
    {
      "level": "H2",
      "text": "8. 跟踪你的表现"
    },
    {
      "level": "H2",
      "text": "最后的想法"
    }
  ],
  "author": "Si Quan Ong"
}