{
  "url": "https://ahrefs.com/blog/zh/shopify-seo/",
  "slug": "shopify-seo",
  "title": "Shopify SEO: 初学者简单指南",
  "description": "了解如何从谷歌和其他搜索引擎为你的Shopify商店带来更多流量和销售。",
  "content": "Tushar Pol SEO和内容营销专家。帮助企业增加其自然搜索可见度，流量和转换。 内容 尽管 Shopify 处理了一些基础的，开箱即用的基础SEO，但它不太可能足以让你的商店登上谷歌的首页。你需要优化搜索引擎优化的所有方面，如果这是你的目标。在本指南中，你将学习如何做到这一点，以推动更多的流量和销售到你的商店。内容在开始之前…在阅读本指南之前，你应该注意以下几点:使用响应式设计 — 2015年谷歌确认手机友好型是一个排名因素。好消息是所有的 Shopify 主题都声称可以在移动设备上响应。但是一定要通过 Google 的手机友好测试工具来运行主题演示。设置谷歌分析 — 通过安装谷歌分析来监视你的 Shopify 商店的性能。通读本文档了解如何开始使用 GA。设置谷歌站长工具 — 使用这个识别和修复技术搜索引擎优化问题有关你的 Shopify 商店。你可在此了解如何启动 GSC。我们开始正文吧。章节1. 技术SEO技术 SEO 是电子商务成功的关键。Shopify 处理技术搜索引擎优化相当出色的盒子。它创建了一个 sitemap 和 robots.txt 文件。页面速度也不错。但有几点值得你注意。我们开始吧。1. 设置你的首选域一旦新推出的 Shopify 商店上线，下一步就是为搜索引擎索引和排名选择域名的首选版本，这种做法称为域名规范化。例如，你的Shopify商店可以通过以下方式访问：example.comwww.example.comexample.myshopify.com让你的在线商店在不同的网址下可以访问，会产生重复的内容问题，并稀释“链接权重”。不过Shopify 非常善于开箱即用地处理这个问题，因为它将替代品重定向到它认为是你首选的域。但并不总是正确的。为了检查和改变这个，我们可以去你Domains settings:如果你喜欢使用 Shopify 没有选择的那个主域版本，点击那个版本并点击“设置为主域”:2. 使用逻辑的商城结构网站结构对电子商务网站是非常有必要的，因为它可以帮助用户和爬虫更简单地认知你的网站。它也可以帮助传递权重（即，排名强度）到你的网站。这是我建议的电子商务网站结构的起点：首页链接到分类页，然后分类页再链接到子分类页，子分类页再链接到每一个独立的产品。Shopify虽然没有分类页面，但是它有和其一样的Collection页面。从这里的Shopify官方文件，我们可以找到如何创建它们。3. 为不同的产品创建不同的产品(并不总是如此)产品变体（也许毫不奇怪）是有轻微差异的产品。例如，如果你销售不同颜色的“GUCCI钱包”，这就是你创建产品变体的时候。Shopify展现产品变体是在网址结尾处附加?variant=$id下面是网址的样子：example.com/products/gucci-wallet?variant=41126125207712小提示. 这被称为网址参数。 默认情况下，产品变体会被规范化到主要产品网址下，以防止他们不被收录。举个例子:在这种情况下，我认为最好是单独创建产品变体而不是用参数网址表现，并且这样也可以创建更多独特的内容以获得更好的排名。译者注另一种选择是对具有搜索需求的产品变体的参数化 URL 进行索引。不幸的是，这在 Shopify 并不容易。因此，除非你的商店是巨大的，否则上述解决方案可以说是最好的选择。Joshua Hardwick内容主管章节2. 关键词研究就像其他的电子商务网站，Shopify网站主要是产品和产品分类页，这些是你想要在搜索引擎上排名的页面。以下是你如果为它们做关键词调研的方法。1. 找关键词你可以通过各种方式找到关键词，但是关键词调研工具像Ahrefs关键词分析是最好的出发点。所以输入一些和你产品相关的广泛关键词，并通过关键词精准匹配报告扩展。例如，以下是吉他商店的一些潜在类别：除此之外，人们似乎主要通过品牌进行搜索，因此这些可能是子类别的最佳选择。至于产品，除非你销售没有品牌的产品或者名字不知道的产品，否则关键词研究并不是一件真正意义上的事情。这是因为，对于品牌产品，人们会自己搜索产品，而你的产品页面会不费吹灰之力地针对这些关键词。例如，如果你出售PRS McCarty 594吉他，没有办法针对你的产品页面的关键字。但是如果你卖的是一把普通的浅蓝色电吉他，你最好找一个相关的关键词，比如“浅蓝色电吉他”:但是，这取决于搜索意图。如果排名最高的搜索结果都是分类页面，这可能意味着搜索者正在寻找一个选择。所以你可能很难通过一个产品页面来排名。2. 将关键字融合到现有网址除非你只是在设置商店，否则你可以针对在现有页面中找到的一些关键字。例如，如果你已经有一个电吉他类别，没有必要作出一个新的页面，目标关键字“电吉他”。如果你想要网站上所有可索引页面的列表以提供帮助，请使用Ahref站长工具中的网站诊断（免费），来完整爬取网站。然后，你可以从页面分析中导出可索引网址的列表。然后只需要将关键字融合到现有页面，并为其他页面创建新页面即可。章节3. 页面SEO既然你已经确定了在商店中的页面应该以哪些术语和短语为目标，现在是时候为页面上的 SEO 元素优化你的站点了。1. 优化元标题和元描述Shopify 提供了一种优化标题和描述的简单方法。选择你的产品或产品分类页面，滚动到“搜索引擎列表预览”，点击“编辑网站SEO”，并点击编辑元信息:以下是一些在制作完美的标题和描述时需要记住的想法:包括目标关键字加上长尾变化标题保持在50到60个字符之间将描述保持在120个字符左右说明你的 USP (例如，免运费，优惠，折扣，便宜等)上面的建议不仅可以帮助你编写关键字优化的标题和描述，而且还可以让你的片段引人注目。但是让我们诚实地说: 为每个产品写一个独特的元标题和描述是一个挑战。这是因为大多数电子商务商店有数百或数千页。因此，模板化的方法通常是首选的。这种方法包括为你的标题和元描述创建一个模板，并在特定类别的产品中遵循类似的格式。不幸的是，Shopify 不支持开箱即用，所以你需要依靠像SEO Manager 和Smart SEO 的应用程序来做到这一点。2. 写出独特的产品类别和产品描述产品和类别描述帮助用户和搜索引擎了解更多关于页面的信息，因此使用独特的描述优化每个页面是很有用的。一些商店在某一特定类别的产品上偷工减料，使用相同的产品描述。别犯这种错误。请记住，重复的内容是排名的障碍。Shopify 在仪表板上有一个分类和产品描述的位置:下面是一些关于如何写出完美描述的建议:在产品描述中解决访客的潜在问题谈论访客关心的事情使用简单的单词避免硬塞你的目标关键字当然，为每个产品和类别页面编写独特的描述需要时间，因此对最重要的页面进行优先排序是有意义的。译者注可以说，产品和类别描述已经不像过去那么重要了。我是说，谁会在分类页面上看到这些描述呢？尽管如此，对于重要页面来说，这仍然是值得考虑的事情，因为它可能有助于提高它们的排名。Joshua Hardwick内容主管3. 为富代码片段资格添加模式标记模式标记使你的代码片段从 Google 上的其他搜索结果中脱颖而出。好处是显而易见的: 吸引眼球的片段获得更多的点击，这意味着更多的流量。案例研究显示，使用模式标记的页面的 CTR 增加了30% 。Shopify 商店可以使用产品模式标记来支持丰富的产品结果。它们显示关于你的产品的其他信息，如价格、可用性和评分。下面是一个结果丰富的产品页面示例:还有没有富代码片段的页面:你认为哪个页面可能吸引更多的点击？除了帮助你提高 CTR (从而提高销售) ，模式标记还可以帮助 Google 更好地理解你的页面。在 Shopify，几乎所有的主题都支持开箱即用的模式。只需填写所有必要的信息，就可以显示丰富的结果:如果你的主题不支持模式，可以考虑使用SmartSEO这样的应用程序来为你的产品提供丰富的结果。4. 优化你的图片Alt 文本(替代文本)是图像优化的最佳起点。它帮助搜索引擎理解图像的主题，并帮助用户阅读屏幕。要在 Shopify 添加 alt 文本，点击图片并点击“添加 alt 文本”:对图像使用描述性文件名也是值得的。例如，如果在产品页面上有一张吉他的照片，prs-mccarty-574.jpg 比 IMG785476.jpg 好。最后，要小心图像文件的大小。沉重的图片会减慢页面的加载速度，这会影响排名和用户体验。可以使用 Crush.pics 之类的应用程序压缩图像，然后将它们上传到 Shopify。章节4. 内容营销内容创建是一个成功的 Shopify 搜索引擎优化策略的一个组成部分，电子商务商店有一些最好的内容营销机会。让我们仔细看看其中的一些。1. 创建博客关于潜在客户正在搜索的问题和主题的博客，是吸引更多有针对性的搜索流量到你的商店的一个聪明的方法。这是在Ahrefs的关键词分析中找到这些主题的方法：输入一些与你的产品相关的宽泛术语去有相同的词的报告切换到“问题”选项卡例如，如果你销售乐器，你可以输入“ Drukit”, “ Drull”和“Guitar”:这返回了367,000多个关键字想法。并非所有这些对于博客文章都有意义。例如，尽管“如何调整吉他”在美国进行了估计的每月13,000个搜索，但关于该主题的文章没有太多要点，因为搜索者几乎肯定已经拥有吉他。另一方面，尽管搜索量较低，“吉他多少钱”还是有意义的，因为搜索者显然正在考虑购买一把吉他。要将你写的博客文章添加到 Shopify 商店，请在侧边栏中单击“ Blog post”，然后单击“ Create Blog post”2. 产品视频评论人们经常观看评论和比较视频，以帮助他们决定购买哪种产品。如果你销售的产品可能是这种情况，考虑创建这些视频并上传到 YouTube。如果你对你的产品充满知识和热情，这应该很容易。要找出人们正在搜索哪些产品评论和比较，请使用关键词分析：输入你销售的几个品牌去有相同的词的报告在“包含”过滤器中添加单词“review”和“vs”，并选择“Any wrod”例如，在美国，每个月大约有500人搜索“prs custom 24 se review”:如果我们在 Google 中搜索这个，我们会在搜索结果的顶部看到一个“ Video”SERP 特性:这些结果告诉我们，搜索者主要想要的是视频，而不是博客文章。这与“ prs s2 vs se”的情况类似，据估计，美国每月有250次搜索，搜索结果页面上还有一个“视频”功能:章节5. 链接建设给 Shopify 商店的建设链接是具有挑战性的，特别是如果你想直接建立到你的产品或类别页面的链接。由于这个原因，建立到其他页面的链接通常更容易。然后，你可以使用内部链接将“链接权益”分发到相关的产品和类别页面。让我们来看看一些你可以使用的链接建设策略。1. 找到链接到你的竞争对手的网站复制竞争对手的共同主页链接，可以说是你建立Shopify商店链接的最佳出发点。你可以使用Ahrefs网站分析中的交集外链分析找到这些。流程是这样的:将域名插入Ahrefs网站分析访问 Ahrefs 的交集外链分析工具，进入几个竞争网站将所有 URL 的搜索模式更改为“ URL”并点击“显示链接机会”然后，你应该看到一个或多个竞争对手的网站链接，而不是你自己:并非所有这些链接都是好机会。这是一个从列表中筛选出可以复制的例子。例如，OldTimeMusic 链接到两家相互竞争的吉他商店:如果我们点击插入符号并进一步研究链接页面，我们会发现这两个网站的链接都来自购买吉他的最佳地点列表:如果我们有一家吉他商店，这绝对是一个我们可以外联的地方。下面是另一个链接到几个竞争对手的网站:如果我们进一步调查，我们会发现其中一个链接来自Reverb.com的Dan Orkin的在线吉他销售技巧列表：鉴于Dan在此网站上发表了一个来宾帖子，也许我们也可以？2. 写客座博客说到来宾发布，这几乎是每个商店所有者都可以做的事情。这是找到客座博客机会简便的方法：输入一个可以定义你Niche的广泛关键词，然后将其放入Ahrefs的内容分析将搜索模式切换为“in title”最近90天发布的页面过滤器（这样你知道它们仍然活跃）打开过滤器：英文页面打开过滤器：DR 30–70网站（剔除掉了一些低质量网站）打开过滤器：至少有1,000个单词的页面（这将从搜索结果中消除电子商务页面）选择“one page per domain”选项转到“网站”选项卡你现在应该可以看到那些发布了与你的主题相关内容的网站:关注那些流量大、作者众多的相关网站。他们可能会接受客座博客。3. 创造“可链接资产”一个可链接的资产是一段有目的地创建的内容，以吸引链接到你的网站。例子包括研究、免费工具、计算器、交互式小部件等。假设你想找到一个 Shopify 商店销售乐器研究类型的帖子想法。下面是如何做到这一点:转到内容分析搜索关键字 AND (数据 OR 研究 OR 调查)将搜索范围设置为“ In title”筛选具有50个以上引用域的页面过滤两年前出版的页面寻找可能有意义发表最新研究结果的地方。例如，这里有一份2018年的研究，涉及112个领域，内容涉及一半的新吉他演奏者是女性:如果你有一个客户的邮件列表，那么复制这一点相对容易。你可以做一个调查，询问过去几年里有多少人开始弹吉他，以及他们的性别。一旦你有了一个最新的研究，联系每一个链接到旧的研究，看看他们是否想覆盖它或取代旧的链接。最后的想法Shopify商店内置了一些SEO。该平台会处理页面速度，并定期自动更新你的站点地图。它还使你可以调整商店元素以进行SEO最佳实践。但是使用Shopify不能保证在搜索结果中排名很高。Shopify只是一种工具。你仍然需要进行关键字研究，生产优质的内容并建立高质量的反向链接，以使你的商店在自然搜索中繁荣发展。译者，John Zhao，西品东来创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human:",
  "headers": [
    {
      "level": "H1",
      "text": "Shopify SEO: 初学者简单指南"
    },
    {
      "level": "H2",
      "text": "在开始之前…"
    },
    {
      "level": "H2",
      "text": "章节1. 技术SEO"
    },
    {
      "level": "H3",
      "text": "1. 设置你的首选域"
    },
    {
      "level": "H3",
      "text": "2. 使用逻辑的商城结构"
    },
    {
      "level": "H3",
      "text": "3. 为不同的产品创建不同的产品(并不总是如此)"
    },
    {
      "level": "H2",
      "text": "章节2. 关键词研究"
    },
    {
      "level": "H3",
      "text": "1. 找关键词"
    },
    {
      "level": "H3",
      "text": "2. 将关键字融合到现有网址"
    },
    {
      "level": "H2",
      "text": "章节3. 页面SEO"
    },
    {
      "level": "H3",
      "text": "1. 优化元标题和元描述"
    },
    {
      "level": "H3",
      "text": "2. 写出独特的产品类别和产品描述"
    },
    {
      "level": "H3",
      "text": "3. 为富代码片段资格添加模式标记"
    },
    {
      "level": "H3",
      "text": "4. 优化你的图片"
    },
    {
      "level": "H2",
      "text": "章节4. 内容营销"
    },
    {
      "level": "H3",
      "text": "1. 创建博客"
    },
    {
      "level": "H3",
      "text": "2. 产品视频评论"
    },
    {
      "level": "H2",
      "text": "章节5. 链接建设"
    },
    {
      "level": "H3",
      "text": "1. 找到链接到你的竞争对手的网站"
    },
    {
      "level": "H3",
      "text": "2. 写客座博客"
    },
    {
      "level": "H3",
      "text": "3. 创造“可链接资产”"
    },
    {
      "level": "H2",
      "text": "最后的想法"
    }
  ],
  "author": "Tushar Pol"
}