{
  "url": "https://ahrefs.com/blog/zh/submit-website-to-google/",
  "slug": "submit-website-to-google",
  "title": "2021年如何向谷歌提交自己的网站",
  "description": "如果你希望搜索引擎用户能够找到你的网站，那么它就需要被索引。学习如何提交你的网站到谷歌。",
  "content": "Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。 内容 如果你希望用户通过搜索引擎找到你的网站，那么网站就需要被索引。但你如何在2021年将你的网站提交给谷歌？有必要这么做吗？这篇指南中你会学到：如何向谷歌提交网站如何向谷歌提交URL什么时候需要提交谷歌索引网站花多长时间为什么谷歌不索引你的网站如何向谷歌提交网站有两种方式提交你的网站到谷歌。你可以在 Google Search Console 中提交更新的网站地图，也可以使用 Google 的 Ping 服务来提交站点地图URL。两种选择都是完全免费的，并且过程只需一秒钟。Finding your sitemap两种提交方法都需要你的站点地图URL。你找到或创建它的方式取决于你的网站平台。如果你是你用的是 WordPress, 安装 免费的 SEO 插件 例如 Yoast, Rank Math, 或者是 The SEO Framework。这三个都可以为你创建站点地图。像下面这样：yourwebsite.com/sitemap_index.xml如果你使用的是 Wix，Squarespace，或者是 Shopify，你的网站地图就是这样的： yourwebsite.com/sitemap.xml .如果你使用的是其他的平台或者是 CMS 系统，大概率都有个网站地图，可能会像以下这样：yourwebsite.com/sitemap.xmlyourwebsite.com/sitemap_index.xmlyourwebsite.com/sitemap1.xml如果你没有找到，那么可以在 yourwebsite.com/robots.txt 文件中查找地图位置。如果没有使用平台或者 CMS，那么你就需要 自己手动创建一个网站地图。建议你还是先查看下，大多数情况网站都有自带的网站地图功能。提交网站地图这里你可以有两种选择。选项 1：你可以在 Google Search Console 中提交网站地图登录 Google Search Console选择正确的域左侧菜单选择 “Sitemaps”粘贴你的网站地图 URL点击 “提交”这可以说是最好的方法了。因为 Google Search Console 会在后续提醒你站点地图是否有错误。它还提供了对站点运行状况的深入了解，例如为什么某些页面可能没有索引的原因。选项 2. 利用 Ping 方式 提交你的网站地图谷歌提供 Ping 服务，你可以请求谷歌对你的网站地图进行抓取。只需在浏览器中键入以下内容，并用站点地图URL替换结尾部分：http://www.google.com/ping?sitemap=<你的网站地图URL>例如，如果你的网站地图网址是 yourwebsite.com/sitemap.xml，那么就像下方这样：http://www.google.com/ping?sitemap=https://yourwebsite.com/sitemap.xml之后你就会看到 “网站地图通知成功” 的页面。谷歌说过你应该只在新的或更新的网站地图上使用这项服务。不要多次重复提交或 Ping 提交 未更改的站点地图。如何向谷歌提交URL一般来说，没有必要向谷歌提交每个新页面。只要你已经将新的网址在网站地图上提交给谷歌过，它们最终会被发现。但是，有两种方法可以潜在地加快这个过程。方法 1. Ping 谷歌确保新页面在你的站点地图中，然后按照上一节中的说明对进行 Ping 操作，并提示他们重新检查你的站点地图。如果你用的是 WordPress，并且有 Yoast，Rank Math，或 The SEO Framewor 插件，那么就没有必要进行这一步，因为这些插件会自动对谷歌进行 Ping 操作。方法 2. 使用谷歌的网站检查工具可以使用 Google Search Console 中的 URL 检查工具 向谷歌提交你的URL，即使它们不在你的站点地图中（尽管应该存在）。登录 Google Search Console选择正确的域左侧菜单选择 “URL 检查”粘贴新页面的 URL回车确认点击 “请求编入索引”如果只有一个或两个新页面，则这样做没有任何危害，有人认为它可以加快索引编制速度。如果你有很多新页面需要提交给谷歌，那么就不建议这么做。因为效率太低。如果你新页面很多，那么请使用第一个方法。你需要向谷歌提交你的网站么？一般是需要的。 谷歌通常会最终找到所有有价值的页面并将它们编入索引，即使你不提交这些页面也是如此。但是将你的网站提交给谷歌仍然有好处。在讨论这些好处之前，我们应该先说下谷歌是如何查找和索引内容的。谷歌是如何找到并索引你的内容的？谷歌会通过4个主要的方法来查找并索引你的内容小提示. 由于谷歌内部算法复杂，因此下面的流程在一定程度上做了简化。步骤 1. 发现发现是指是谷歌得知你网站存在的过程。 谷歌从站点地图中找到大多数网站和页面，或者从已知页面中找到反向链接。步骤 2. 抓取抓取是指 Googlebot 程序（蜘蛛）访问并下载你的页面的过程。步骤 3. 处理处理是指从抓取的页面中提取关键信息并准备索引的过程。步骤 4. 索引索引是指将已抓取的页面中的已处理过的信息添加到搜索索引的大型数据库中。这是一个由数万亿个网页组成的数字图书馆，谷歌就是从中提取搜索结果的。推荐阅读: 搜索引擎是如何工作的以及你需要注意什么？为何提交很重要？上面四个步骤中的每个步骤都是按顺序进行的。你能够做的就是将你的网站提交给谷歌，这样你就可以加快流程的第一部分：发现。就像旅行一样，越早出发，就能越早到达目的地。在这种情况下就是：建立索引。但是还有其他一些原因使得提交站点地图很重要。1. 它告诉谷歌哪些页面很重要站点地图并不总是包含你网站上的每个页面。它们仅会列出重要得页面，而排除不重要或重复的页面。这有助于解决由于重复的内容而导致错误的页面版本被索引等问题。2. 它告诉谷歌有关新页面的信息许多 CMS 会在你的站点地图中自动添加新页面，有些会自动 Ping 通知谷歌。这样可以节省必须手动提交每个新页面的时间。3. 它会告诉谷歌有关孤岛页面的信息孤岛页面是指没有网站上其他页面的内部链接的页面。除非它们具有来自其他网站上已知页面的反向链接，否则谷歌不会通过抓取发现这些页面得。提交站点地图可以一定程度上解决此问题，因为孤岛页面通常会包含在站点地图中——大多CMS的页面都会包含在内。谷歌索引花多长时间？谷歌表示，抓取可能需要几天到几周的时间。 （请记住，抓取始终是建立索引的先决条件）以我的经验，除非是大型网站，否则它花费的时间很少会超过一到两个星期。但是不用担心索引时间长，因为这个很正常。为什么谷歌不索引你的内容？谷歌不会总是索引你提交的 URL。尽管发生这种情况的原因有很多，但以下是一些最常见的原因： 1. 你阻止了抓取Robots.txt 是一个文本文件，它告诉谷歌可以抓取和不能抓取哪些 URL。 例如，下面的 robots.txt 文件阻止了谷歌抓取网站上的所有页面:User-agent: GooglebotDisallow: /即使它们无法抓取，谷歌有时也会为将 URL 编制索引，但这非常少见。防止抓取还会阻止谷歌获得有关该页面的信息，因此即使已编制索引，它也可能不会排名。这就是你需要通过 Google Search Console 注册和提交网站的另一个原因。它在覆盖率报告中会告诉你是否由于阻止抓取，而将页面从索引中排除。下面是如何查看：登录 Google Search Console选择正确的域左侧点击 “覆盖率” 报告切换到 “已排除” 标签，然后检查以下三个问题：已被 robots.txt 屏蔽已提交，但被 robots.txt 屏蔽已索引，但被 robots.txt 屏蔽2. 你将重要页面设置了不索引如果你的页面上有 meta robots 标记或是 x‑robots-header，并在 content 属性中带有“ noindex”，那么谷歌就不会对该页面进行索引。如果谷歌已经抓取了你的网站，则可以在覆盖率报告检查没有索引的已排除页面。只需切换 “错误” 和 “已排除” 选项卡，然后检查以下两个问题：已提交页面被标记为 “noindex”被 “noindex” 标记排除了如果谷歌还没有对你的网站进行抓取，或者你只是想在将来留意 “noindex 标签”，那么注册Ahrefs 站长工具（AWT）并使用 Site Audit（网站诊断） 运行一个免费的网站检测。这里会检查 100+ 个常见的搜索引擎优化问题，包括被标记为 noindexed 的网页。3. 页面内容没有价值谷歌不太可能将搜索用户没有太大价值的页面编入索引。在 2018 年发布的一条推文中，谷歌的 John Mueller 建议，网站的内容应该是 “有价值并且能引起共鸣的”，谷歌才会对其进行索引。We never index all known URLs, that’s pretty normal. I’d focus on making the site awesome and inspiring, then things usually work out better.— 🍌 John 🍌 (@JohnMu) January 3, 2018 推文译：我们不会索引所有已知的URL，这很正常。我将重点放将网站变得有价值并鼓舞人心上，这样会更好。如果你排除了可能导致无法编入索引的技术问题，则值得问自己该页面是否真正有价值。如果答案是否定的，那这可能就是为什么它没有被编入索引的原因。如果你认为该页面价值不高，并且担心可能还有其他类似的页面，请使用 Ahrefs 站长工具（AWT）中的 Site Audit（网站诊断） 来运行免费的网站检测。这里会检测与内容价值偏低的两个问题：页面字数过少完全相同或接近重复的页面你可以在 “所有问题” 报告中查看字数较少的URL的数量。尽管内容不是长的才有价值，但字数超低的页面通常对搜索引擎用户而言并不那么有价值。因此，值得手动查看这些页面，并在必要时使它们对用户更有帮助。你可以在 “重复内容” 报告中看到与完全相同或接近重复的页面：下面就是两个几乎重复的低价值网页的例子：这是电子商务网站上的空白类别页面。由于它们都不提供任何产品，因此对搜索者没有帮助。它们应该被删除或改进。推荐阅读: 10个让谷歌索引你网站的方法最后即使你的网站已在谷歌中建立索引，也不一定意味着你的目标关键词会在谷歌首页上排名。编入索引意味着你正在参加比赛，而不是你会获胜。这就是 SEO 的用处。SEO 是优化网站的一种做法，可以增加来自搜索引擎的自然搜索结果的访问量。在这种情况下就是谷歌。如果你想了解更多关于SEO的信息，请阅读 SEO 初学者指南.如果你想向其他搜索引擎提交你的网站，请阅读 向搜索引擎提交网站完整指南。有问题？就在 Twitter 上找我吧。译者，Park Cheng，魔贝课凡联合创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。",
  "headers": [
    {
      "level": "H1",
      "text": "2021年如何向谷歌提交自己的网站"
    },
    {
      "level": "H2",
      "text": "如何向谷歌提交网站"
    },
    {
      "level": "H3",
      "text": "Finding your sitemap"
    },
    {
      "level": "H3",
      "text": "提交网站地图"
    },
    {
      "level": "H4",
      "text": "选项 1：你可以在 Google Search Console 中提交网站地图"
    },
    {
      "level": "H4",
      "text": "选项 2. 利用 Ping 方式 提交你的网站地图"
    },
    {
      "level": "H2",
      "text": "如何向谷歌提交URL"
    },
    {
      "level": "H4",
      "text": "方法 1. Ping 谷歌"
    },
    {
      "level": "H4",
      "text": "方法 2. 使用谷歌的网站检查工具"
    },
    {
      "level": "H2",
      "text": "你需要向谷歌提交你的网站么？"
    },
    {
      "level": "H3",
      "text": "谷歌是如何找到并索引你的内容的？"
    },
    {
      "level": "H4",
      "text": "步骤 1. 发现"
    },
    {
      "level": "H4",
      "text": "步骤 2. 抓取"
    },
    {
      "level": "H4",
      "text": "步骤 3. 处理"
    },
    {
      "level": "H4",
      "text": "步骤 4. 索引"
    },
    {
      "level": "H3",
      "text": "为何提交很重要？"
    },
    {
      "level": "H4",
      "text": "1. 它告诉谷歌哪些页面很重要"
    },
    {
      "level": "H4",
      "text": "2. 它告诉谷歌有关新页面的信息"
    },
    {
      "level": "H4",
      "text": "3. 它会告诉谷歌有关孤岛页面的信息"
    },
    {
      "level": "H2",
      "text": "谷歌索引花多长时间？"
    },
    {
      "level": "H2",
      "text": "为什么谷歌不索引你的内容？"
    },
    {
      "level": "H3",
      "text": "1. 你阻止了抓取"
    },
    {
      "level": "H3",
      "text": "2. 你将重要页面设置了不索引"
    },
    {
      "level": "H3",
      "text": "3. 页面内容没有价值"
    },
    {
      "level": "H2",
      "text": "最后"
    }
  ],
  "author": "Joshua Hardwick"
}