{
  "url": "https://ahrefs.com/blog/zh/types-of-keywords/",
  "slug": "types-of-keywords",
  "title": "8 种最重要的 SEO 关键词类型",
  "description": "如果你想让你的内容获得排名，你必须有正确的关键词。本文有最重要的 8 种类型。",
  "content": "Mateusz Makosiewicz Ahrefs 的营销研究员和教育家。 Mateusz 在推广代理、SaaS 和硬件业务领域拥有超过 10 年的营销经验。平时喜欢创作音乐或享受长距离的散步。 内容 每个对 SEO 感兴趣的人都应该知道的自然关键词的类型。如果你只是想快速了解一下这些类型，请看下面的图片。阅读全文，了解更多关于它们的重要性以及如何找到它们。内容1. 种子关键词种子关键词是你可以作为关键词研究过程中的起点的词，以解锁更多的相关的关键词或短语。如果说有利可图的关键词是关键词研究的输出结果，那么种子关键词就是最开始输入的那个词。在这个例子中，“shoes” 就是种子关键词，在 Ahrefs Keywords Explorer（关键词分析）中产生了数百万个关键词建议。如何找到有很多方法可以让你想出好的种子关键词：头脑风暴、集思广益调查竞争对手的关键词观察网站导航菜单观察人们在社交媒体上使用的语言等等。让我们做一个简单的例子。假设你想开一个食品博客。你来到一个竞争对手的博客寻找灵感，发现了一个 “vegan meatballs” 的菜谱。你可以写一个类似的食谱，或者把它作为一个种子关键词，找出人们是否用其他的方式搜索过这道菜。你可能会在 Ahrefs Keywords Explorer（关键词分析）中发现下面的结果。在我们的其他资源中，你会发现更多伟大的种子关键词来源，并有详细说明：种子关键词： 它们是什么以及寻找它们的7种可行方法高级关键词研究： 寻找未开发关键词的5个技巧 （见第4章：识别不常见的种子关键词）2. 按搜索意图分类的关键词搜索意图是搜索（即关键词）背后的原因。它是人们期望通过在搜索引擎中使用某个关键词来找到的东西。粗略地说，我们可以区分四种基本的意向性关键词类型：信息类——搜索者正在寻找信息，例如，“who invented the mouse”。导航类——其目的是寻找一个特定的网站，例如，“facebook login”。商业调查——搜索者想购买一个特定的产品，但需要做更多的研究，例如，“ahrefs review”。交易类——纯购买模式，例如，“buy iphone 14”。除此之外，还有所谓的高意向关键词，表明用户接近购买，相当于商业调查和交易性关键词相结合。Note 搜索意图不是关键词的一个特征，而是 SERP 的一个特征。按搜索意图对关键词进行分类是很常见的，但在技术上并不完全正确。这意味着搜索意图可以随着时间的推移而改变，搜索引擎可以显示一个混合意图的 SERP（又称碎片意图）。关键词越笼统，越有可能显示出混合意图的 SERP。例如，如果你在谷歌上搜索 “coffee”，你会看到附近的咖啡店，几个大的咖啡品牌，以及关于咖啡的文章。请查看我们的混合搜索意图指南，以了解更多。如何找到你可以使用修饰语。这里有几个概念：下面是这个过程在 Keywords Explorer（关键词分析）中的样子：输入种子关键词进入 Matching terms（有相同的词的）报告 将修饰词放入 Include（包含） 筛选框；确保筛选设置为 “Any（任意词）”专家提示 请确保查看 SERP，看看你是否能符合该关键词的搜索意图。你可以通过点击 Keywords Explorer（关键词分析）中的 SERP 图标，并结合我们的搜索意图指南进行查询。在关键词资源管理器中直接检查 SERP。3. 长尾关键词（话题性+辅助性）长尾关键词是指每个月获得搜索较少的的关键词。它们的名字来自于所谓的搜索需求曲线。对于任何主题，最受欢迎的搜索是短尾词（也称为大词或主题词），其次是中间词，最后是长尾词。定位长尾关键词是 SEO 的一个常见策略：它们比大词或中间词的竞争更小（然而，并非所有长尾关键词都容易获得排名）。它们的数量很多。它们通常是具体的；你可以吸引有具体意图的访问者。如何找到有两种类型的长尾关键词。有一些话题性的长尾关键词，它们本身就是单一的话题。还有一些辅助性的长尾关键词，它们只是一个词的不太流行的搜索变体。这是一个重要的区别，因为只有针对话题类的长尾关键词才有意义。这里有一个简单的记忆方法：把它们看成是父集和子集。下面是如何在 Keywords Explorer（关键词分析）中寻找话题类长尾关键词的步骤：输入一个宽泛的话题进入 Matching terms（有相同的词的）报告设置 Volume（搜索量）以及 Traffic Potential（流量潜力）最大值为 300 通过 Parent Topics（父主题）浏览结果 技巧 如果你没有找到有趣的关键词，可以尝试增加搜索量和流量潜力的数值。对于长尾关键词的量并没有 “官方” 的数量门槛。这主要取决于行业。标题词的搜索需求越多，长尾词就会越多。4. 低竞争关键词低竞争的关键词，是通常比较容易获得排名的关键词。它们可以在短期内提供更快的结果，所以它们经常被推荐给没有强大外链资源的新网站。如何找到寻找低竞争关键字的最简单方法是使用具有难度评分的 SEO工具。在 Ahrefs，我们简单地称之为 Keyword Difficulty（关键词难度、KD）。输入种子关键词进入 Matching terms（有相同的词的）报告设置 KD 为最大 20这种方法将过滤掉那些有大量反向链接的网页所占据的关键词。然而，仍有一些 KD 低的关键词会比较难获得排名，例如：SERP 上的热门品牌。竞争对手的内容质量高。你可以通过使用 “Lowest DR（最低DR）” 过滤器，输入你的网站的 DR，进一步细化该列表。这将显示与您的 DR 值相同或更低的网站是否已经排在前 10 名或前 5 名。延伸阅读如何为 SEO 寻找低竞争的关键词关键词难度： 如何预估你的排名机会 5. 利基关键词利基关键词是明确而具体的主题，吸引着特定市场、通常是某个行的垂直领域。它们往往更容易获得排名。而且由于它们的特殊性，它们可以是高意向的。换句话说，每个利基关键词都能在短时间内给你带来少量但质量高的流量。放在一起，它们可以成为长尾业务的支柱（销售低数量的稀有物品）。例如关键词：“vegan baby soap”。它的搜索量很低，但它非常具体。而且这种产品可能相当罕见。因此，搜索者很有可能会在市场上购买这种产品。此外，它应该是很容易排名的。如何找到利基关键词与长尾关键词类似。然而，利基关键词不仅仅是关于搜索需求。它有一个市场方面的问题，所以你需要花更多的时间去研究关键词所代表的实际物品。例如，这个关键词有流量潜力，但并不能代表产品。这只是一个拼写错误而已。为了解决这个问题，你可以用几个想法来完善你的关键词列表。这里有一个示例：输入种子关键词设置 Volume（搜索量）和 Traffic Potential（流量潜力）为较低的数值，例如 “soap” 就设置为 500使用指代应用、类型或特征的修饰性关键词。例如：“alternative”、“for”、“substitute”、“vegan”、“free” 等这就是我们为那些不希望自己的肥皂有香味的消费者发现的一个利基。延伸阅读3个步骤中为SEO寻找利基关键词 6. 品牌和非品牌关键词非品牌关键词的排名使你能够吸引那些正在搜索与你的业务相关的产品或服务，但不一定知道你的品牌的人。品牌关键词的排名使你能够吸引那些专门搜索有关你公司信息的人。为了说明其中的差别：如何找到只要这个关键词不包含你的品牌或产品的名称，它就是一个无品牌的关键词。你可以选择本文中的任何一种方法来寻找这些词。要找到品牌关键词，你有三个选择。方法1：如果你将你的品牌和产品放入 Keywords Explorer（关键词分析）中，你会看到品牌关键词以及它们的 SEO 指标和谁在参与排名。方法2：你可以使用 Ahrefs Site Explorer（网站分析）只查看你排名的品牌关键词。只需将品牌词作为修饰词即可。你也可以使用 Position（排名）过滤器来查看表现不佳的关键词。方法3，你可以检查所有你没有排名的品牌关键词。要做到这一点，你需要将所有品牌关键词的列表与你有排名的关键词进行比较。这里有一个关于如何做到这一点的分步教程，以及关于品牌搜索的更多信息。7. 竞争对手关键词谁不想看到他们的竞争对手的关键词？更好的是，这些你可以从这些关键词中寻找适合你的词。当你知道竞争对手的关键词时，你可以：定位相同的关键词。将你的竞争对手的关键词作为种子关键词进行研究。如何找到有两种方法。首先，你可以去 Site Explorer（网站分析），粘贴你的竞争对手的 URL，然后去看 Organic keywords（自然关键词）报告。从那里，你可以使用过滤器来细化关键词列表。例如，低竞争性的关键词、或包含特定词汇的关键词。你也可以查看你没有排名的竞争对手的关键词。在 Site Explorer（网站分析）中，有一个专门的工具，叫做 Content Gap（内容差距机会）。你所需要做的就是粘贴竞争对手的域名。小技巧 你的市场竞争对手不一定与你的自然流量竞争对手相同。因此，如果你想看看还有谁在你的关键词上排名，请使用 Organic competitors（自然流量竞争对手）报告。除了域名列表，你还会看到你共享的关键词、和你没有排名的关键词。8. 主要和次要关键词主要关键词是一个页面的核心话题词。它也是优化页面的唯一关键词，或者换句话说，是首先要做关键词研究的原因。次要关键词是与你的页面所针对的主要关键词密切相关的关键词。举例来说，如果主要关键词是标题，那么关键词就是副标题。如何找到为了找到好的主要关键词，你需要做适当的关键词研究。你的主要关键词应该是有搜索流量潜力。能匹配搜索意图。有商业潜力或对你的网站有其他价值。在你的排名能力之内（大部分时间）。请参阅我们关于关键词研究的完整指南，了解所有细节。寻找次要关键词取决于你的主要关键词（因为这些关键词是相关的）。你可以使用 Keywords Explorer（关键词分析）中的 Related terms（有相关词的）报告，或 Site Explorer（网站分析）中的 Content Gap（内容差距机会）工具来比较某一特定关键词的排名靠前的页面。请确保启用 “Top 10” 设置。如果你使用 Content Gap（内容差距机会）工具来寻找次级关键词，请将最后一项输入留空。延伸阅读一个页面到底应该针对多少个 SEO 关键词？ 最后这些是八个重要的关键词类型。下面还有几个类型就是值得你了解的：零流量关键词 – 如果你看到一个有趣的关键词的搜索量为 0，如果你认为它的流行度会飙升，或者它对你的网站有很高的商业价值，那么它可能仍然值得定位（更多内容请见我们对零流量关键词的看法）。NORA（正确答案的关键词） – 随着人工智能搜索引擎的崛起，没有正确答案的关键词可能会变得更加重要。有些人认为，这种关键词是人工智能生成的答复，将从自然搜索中获得大部分点击。LSI 关键词 – SEO 行业的中的一个 “有误区的” 传说。Meta 关键词 – 谷歌不再使用它们来对网页进行排名。付费关键词 – 不用于 SEO，但如果你正在进行付费搜索广告，则值得了解。你可以在这个 PPC 指南中了解更多信息。有问题么？在 Twitter 或 Mastodon 上找我吧。译者，Park Cheng，歪猫出海创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Mateusz Makosiewicz Ahrefs 的营销研究员和教育家。 Mateusz 在推广代理、SaaS 和硬件业务领域拥有超过 10 年的营销经验。平时喜欢创作音乐或享受长距离的散步。",
  "headers": [
    {
      "level": "H1",
      "text": "8 种最重要的 SEO 关键词类型"
    },
    {
      "level": "H2",
      "text": "1. 种子关键词"
    },
    {
      "level": "H3",
      "text": "如何找到"
    },
    {
      "level": "H2",
      "text": "2. 按搜索意图分类的关键词"
    },
    {
      "level": "H3",
      "text": "如何找到"
    },
    {
      "level": "H2",
      "text": "3. 长尾关键词（话题性+辅助性）"
    },
    {
      "level": "H3",
      "text": "如何找到"
    },
    {
      "level": "H2",
      "text": "4. 低竞争关键词"
    },
    {
      "level": "H3",
      "text": "如何找到"
    },
    {
      "level": "H2",
      "text": "5. 利基关键词"
    },
    {
      "level": "H3",
      "text": "如何找到"
    },
    {
      "level": "H2",
      "text": "6. 品牌和非品牌关键词"
    },
    {
      "level": "H3",
      "text": "如何找到"
    },
    {
      "level": "H2",
      "text": "7. 竞争对手关键词"
    },
    {
      "level": "H3",
      "text": "如何找到"
    },
    {
      "level": "H2",
      "text": "8. 主要和次要关键词"
    },
    {
      "level": "H3",
      "text": "如何找到"
    },
    {
      "level": "H2",
      "text": "最后"
    }
  ],
  "author": "Mateusz Makosiewicz"
}