{
  "url": "https://ahrefs.com/blog/zh/website-audit/",
  "slug": "website-audit",
  "title": "网站诊断的10个步骤：改善网站SEO和用户体验",
  "description": "诊断你的网站是否存在SEO性能问题，这些问题可能会让你付出高昂转换成本的，并会影响你的用户体验。",
  "content": "Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。 内容 你的网站是否存在不利于SEO优化、或是有损用户体验的地方？按照本教程的网站诊断流程，查找网站的问题。 如果你从未做过网站诊断，那么你应该这么做。网站结构比较复杂，问题无时无刻的不在出现，除非你定期的诊断网站，否则你可能不会注意到这些问题。 几周前，Twitter上的某人提醒了我一个Ahrefs博客的问题：Also, just wanted to give you a quick heads-up. The “Image Raider” tool you mentioned in your post returns a 403 forbidden error! 🙂— Abhishek Kurve (@Abhishek_kurve) January 23, 2019我博客上运行得很顺利，并且这只是个小问题。但是由此事，我看到许多大大小小的的企业网站可能都面临着更为严重的问题。在本指南中，我将教你如何执行简单的网站诊断，以提高SEO效果、以及用户体验，甚至也可能提高你的收入。以下是我们在本指南中提出的10个问题：你的设计符合需求吗？你的导航有意义吗？你的网站适合移动设备吗？你的robots.txt文件和站点地图是否存在技术问题？你的网站安全吗？（HTTPS）你的网站加载快吗？你的内容高质量吗？你是否有失效的页面或链接？你的标题和描述是否吸引人？你是否定位了正确的关键词？但是首先，请确保我们了解网站诊断是什么。什么是网站诊断？网站诊断包括分析网站的技术问题、用户体验、以及SEO问题。它可以帮助我们发现这样的一些问题：是什么阻碍网站在搜索引擎获得应有的自然搜索流量；是什么阻碍你的售卖或转化；是什么让你的访客感到困惑；技术性问题。当然，发现此类问题只是成功的一半。你必须修复它们才行。幸运的是，本指南中讨论的问题的大多数修复都是不言自明的。我将尽可能的涉及更复杂的问题。让我们开始如果你是Ahrefs的用户，你可以先在 Site Audit（网站诊断）中建立一个项目。下面是介绍怎么做的视频：https://www.youtube.com/watch?v=LjinWqfGyVE小提示. 你可能会注意到在该视频中看到的内容与工具当前界面之间存在一些细微的差别。这是因为自创建该视频以来，我们对网站诊断工具进行了一些升级。但是基本操作流程依然和原来一样。Site Audit（网站诊断）工具是干什么的？它会帮助你检查网站上的每个页面并判断是否存在预定的上百个SEO问题。重要. 为了充分利用本指南，我建议启用下方的选项以检查外部链接的HTTP状态。如果你不是Ahrefs的用户，别担心，这并不是必须的。你也可以使用其它的一些工具，例如下方的：谷歌分析谷歌移动设备友好度检测谷歌 PageSpeed Insights Yoast SEO (或者 一个类似的插件 如果你使用的是WordPress的话) Readable / GrammarlyGoogle Search Console你的大脑! (这个是最重要的)现在，在我们开始网站诊断过程之前，我要说两件事： 本次网站诊断指南是面向新手的。 网站诊断几乎是没有止境的，其中​​有些问题比较复杂、有一定技术难度。我更有意关注一些更简单直接的问题。单这并不是说这些不重要，它们依然是困扰许多大小网站的常见问题。 这不仅仅关乎SEO。 如果你想更深入，并且不介意处理更复杂的问题，请查看我们的SEO诊断指南。本指南中的许多诊断会对SEO产生影响。如果你想在谷歌中排名更高，并且几乎没有SEO经验或知识，那么本指南将是一个很好的起点。1. 检查你的网站设计设计很重要，没有人会相信一个1995年设计的网站。一般而言，每4–5年就要重新设计一次网站、或者至少进行一些重要的设计更新，以保持网站的新鲜感。但这不仅仅在于使网站变得漂亮，或跟上当前流行的趋势。有很多因素会导致网站“设计”不友好。下面就是一些例子：嵌入式弹窗和广告并非所有的弹窗都是不友好的。诸如退出弹窗或cookie警告之类的是有合理的目的的。但是，最令人讨厌的是，当你点击一个谷歌搜索结果，来到页面之后立马就给你发送了无数的弹窗。为了更好的说明，可以看下方这个例子：在你还没有开始阅读任何文字之前，就给了你一个全屏的“欢迎”广告，阻碍你观看内容。对我个人来说，我会看到这样的页面会迅速点击后退按钮。我相信其它人也是一样的。这对下面两点都非常的不友好： 转化. 人们无法购买任何东西，除非他们停留在你的网站上. SEO. 访客一进入页面，便立即按下“后退”按钮。有证据表明，这会告诉谷歌你的网页存在某些不良的情况，因此不值得对其进行排名。说到SEO，谷歌还会对移动设备上的 “显示嵌入式广告的页面” 进行惩罚。因此，请帮自己一个忙：在访客模式中加载你的网站，看看会发生什么。如果弹窗很多，请将其删除。文字不清晰如果用户看不清你网站上的内容，那么就会点击后退按钮。所以，你需要确保： 使用适当的大小. 它不需要很大，但是使用8pt大小肯定不行。并非每个人都有的20/20视力……或显微镜。 使用清晰的字体. 一般来说，无衬线字体比衬线字体更具可读性。这可能是我对阅读文字的要求比较高（无双关语）。你只需避免使用 Comic Sans（或其他类似的字体）即可。 留出足够的空白. 没有足够的空白会导致阅读体验很不友好。 使用对比色. 在白色背景上的黄色文本？这样肯定不行。在你说这都是显而易见的问题之前，这是我在5分钟内发现的一个真实的反面例子：这个电话号码可以再小些吗？到底谁会去看到这个呢？不明确的calls to action（CTA）Call-to-action 指的是触发用户做一些指定的事情。例如，我们主页上的橙色大按钮显示了 “以7美元的价格开始7天试用”，这就是一个CTA。我们建议访问者通过单击该按钮来做一些非常具体的事情。相反的，在ConversionXL上被大家发现的 Verve 的 CTA “Join the adventure（加入冒险）”——就没有那么明确：就像作者所说的：[…] CTA 的内容是 “Join the Adventure（加入冒险）”，但是我在一个咖啡的网站上，我以为我是在买咖啡呢。这非常让人困惑。小提示. 之后，Verve 将它们的CTA换成了 “Shop now（现在购买）”，这样就更加符合逻辑了。查看你网站上的CTA，确保它们明确并符合逻辑。如果不是，就立马修复它们。专家建议如果你认为你的网站需要重新设计，可以在UpWork，People Per Hour 等上找到许多价格合理的网页设计师。 2. 检查你的导航试想一个没有导航的网站。在网站上找到你想要的东西可能会很困难。因此，必须确保导航菜单不仅存在，而且对用户有意义。也许你（最熟悉你的网站的人）认为网站的导航菜单合乎逻辑，但是用户不一定会这么认为。所以现在进入的你的首页并查看你的导航菜单。然后问自己：这个清晰吗？其中包含了所有的重要的页面吗？其中是否包含了不必要的东西？如果用户有疑问是否可以轻松的联系到我？如果对这些问题中的任何一个的回答是否定的，那么可能是时候考虑重新设置导航菜单了。为此，我认为勾勒出网站的框架非常有用，这样我就可以知道重要的和不重要的页面。你可以使用一个简单的工具来实现，例如Slickplan。专家建议如果你很难用独立的眼光观察网站，请尝试让你的客户、家人、朋友或同事访问你的网站并指出任何有问题的地方。你可以让几个不同的人一起做，看看它们是否会提出共同的问题。但是，请记住，这样的人由于害怕冒犯你而常常不愿指出网站的真正问题。如果你觉得是这样的话，请考虑聘请自由职业者以视频的方式进行手动评测。在一个接单平台上自由职业者发布的视频方式的评测业务这些通常并不算太贵，所获得的建议会更加的有价值。3. 查看移动端友好度你知道么？ 有 49%以上的人会通过移动设备浏览你的网站。这意味着大多数用户可能正在通过移动设备查看你的网站。小提示. 3–4%的人会使用平板电脑，就是为什么49%以上使用移动设备的人是大多数。 更多的是，接近 60%的谷歌搜索用户使用的是移动设备，而且这还是2016年的数据，现在可能会更高。简而言之，你需要一个移动端友好的网站。否则你就忽视了一半以上的用户。专家建议如果你很好奇有多少用户是通过移动设备访问你的网站，你可以使用谷歌分析工具，然后进入：Audience > Mobile > Overview受众 > 移动设备 > 概览这里你可以看到有多少用户是从移动设备、桌面设备、以及平板设备来的。同时你可以使用谷歌移动端友好度检测工具来查看网站的移动端友好度。 我建议先测试你的首页。如果你的首页适合移动设备浏览，那么网站的其他部分也可能适合。但是，如果网站的分为多个部分，则可能需要多测试几个页面。例如，分别测试在Shopify上运行的电子商务页面、以及在WordPress上运行的博客页面。如果它当前不适合移动设备浏览，并且你知道很多用户都在使用移动设备的话，那么你应该雇用开发人员来解决此类问题。4. 检查你的 robots.txt 文件以及 sitemapRobots.txt是一个简单的文本文件，它告诉搜索引擎它们可以和不能爬行哪些页面。站点地图是一个XML文件，可帮助搜索引擎了解你拥有哪些页面以及网站的结构。如果你有robots.txt文件，则可以通过 yourdomain.com/robots.txt 访问该文件。robots.txt文件示例找不到你的网站地图？通常网站地图的网址在你的robots.txt文件中。如果不是，请检查服务器的根目录中的XML文件。网站地图的示例.长话短说，你最好同时拥有这两个文件，但不是必须的。如果你的网站很小（不到10页），那么我对这两个文件都不会太担心。但是，如果你使用的是WordPress，则可以使用 Yoast SEO 之类的插件轻松创建robots.txt文件和站点地图。延伸阅读WordPress SEO：实用简明指南如何创建 XML 网站地图 (并向 Google 提交)5. 确保网站使用 HTTPsHTTPs 表示网站是安全的，数据往返于该网站是被加密过的。你可以通过URL栏目前是否有一个锁的图标来判断是否是HTTPs网站。同时HTTPs的网站URL前缀应该是 https://:如果你的网站不是这种情况，就代表你的网站没有SSL证书（即HTTPs）。为什么HTTPs很重要？主要因为安全性。未加密（非安全）的数据可能会被拦截和窃取。并且，在2014，谷歌就说过，HTTPs是排名要素之一。因此，在以下情况下HTTPs至关重要：你的网站有支付行为（绝对必要）你的网站需要收集用户数据（推荐）试图在Google中排名更高（谁不是呢）如果你尚未使用HTTPs，只需要申请一个SSL证书即可。就这么简单。好消息是，这可能不会花费一分钱。 Lets Encrypt 是一家非营利组织，提供免费的SSL证书，并得到了包括谷歌在内的业界最大参与者的支持。在2020年，没有理由不使用HTTPs。但是，即使你已切换为HTTPs，也可能会遇到一些相关的技术问题，例如：内链依然是HTTP的；混合内容（即加载的资源不统一，例如图片，同时有HTTP和HTTPs的，即使它们位于安全页面上）；规范标签依然是HTTP的状态。这些听起来有些技术难度，事实确实如此。 如果你使用 Ahrefs Site Audit（网站诊断） (就像我们推荐的)，你就可以用最简单的方式看到网站上是否有我上面提到的任何问题。你只需要进入:Site Audit > project > Overview. 网站诊断 > 项目 > 概览查找和HTTPs相关的问题：Ahrefs Site Audit（网站诊断）中的HTTPs问题示例点击问题后的 “?”按钮，就可以查看详细的问题说明，以及如何解决这个问题：将页面和此建议转发给开发人员进行修复。6. 检查网站的加载速度谷歌说过，约有53%的移动用户会离开加载时间超过3秒的网站。同时，Amazon 发现 只要慢 100毫秒，就会损失1%的销售额——这还只是10年前。现在的数值肯定会更夸张。还是不相信速度的重要性？谷歌在2010年就 申明 网站的加载速度是排名要素之一。简单说就是你必须让你的网站加载速度变快。幸运的是，谷歌有一个免费的工具来检查页面速度。称为 PageSpeed Insights。放入网址，它会显示台式设备和移动设备的“速度得分”。向下滚动，谷歌会提供有关如何提高页面速度的建议：再说一次，这些问题有一定技术性难度，但是任何优秀的开发人员都会知道如何解决这些问题。我建议你先在 PageSpeed Insights 中检查首页，因为这样可以使你大致了解网站的整体速度。然后，你可以检查其他页面，以查看各个级别的页面上是否存在速度问题（例如，大量大图片文件等）。PageSpeed Insights 的问题在于一次只能检查一页。如果你的网站有数十，数百甚至数千个页面，那就太烦人了。解决办法? 查看 Ahrefs Site Audit（网站诊断）中的 “速度慢”的问题：Site Audit > project > Internal pages > Performance网站诊断 > 项目 > 内页 > 表现 点击数字查看所有受影响的页面。如果你有很多慢速页面（如上面截图中的网站所示），那么就值得先查看最重要的页面。其中一种方法是按自然流量从高到低进行排序。这些页面很可能会从你的优化中获得最大收益。你还可以使用谷歌分析来检查哪些页面对你而言最有价值，并优先对其进行优化。7. 检查内容质量无论是博客文章还是简单的“关于我们”页面，其中的内容都应该是高质量的，并且对用户有价值。这意味着：写得好；内容丰富；没有拼写和语法错误（提示：使用Grammarly检测语法）；易于理解（提示：使用 Hemmingway 或 Readable）；可快速阅读（不是一整块文字）；不能与其他页面重复。如果你的站点相对较小（少于20页），则可以轻松地手动检查以上所有内容。一页一页地加载并阅读它们。修复遇到的任何错误。例如，下面的这个页面会就出现各种低级错误：首先，它很难快速阅读。没有图像，没有子标题；这就是一大块文字墙。你应该使用子标题来拆分内容，并使内容更具吸引力。在HTML中，可以使用H1-H6子标题为页面提供一些结构和层次。下面是一些基础知识：每个页面使用一次 H1标签作为题目使用 H2 标签作为子标题使用 H3 标签作为H2内容的子标题使用 H4 标签作为H3内容的子标题… 以此类推下面是在上方的示例应该展示的方式：题目 (H1): The Investment Mistake Otha Anders Made 子标题 (H2): Who is Otha Anders?子标题 (H2): The mistakes Otha Anders made 子标题 (H3): Mistake #1子标题 (H3): Mistake #2该页面的另一个问题是它将文字复杂化了。实际上，Hemingway 工具告诉我们这篇文章需要十一年级（高中）的阅读水平。为什么这很重要：研究表明，如果内容超过7年级阅读水平（这是美国卫生与公共服务部（USDHHS）确定的美国平均阅读水平）则消费者的理解力可能会受到影响。简而言之，就是将你的内容保持在7年级（初中）下水平。对于大型网站，无法手动检查所有页面是否存在此类问题。在这种情况下，最好优先考虑最重要的页面。为了找到这样的页面，你可以用谷歌分析或者是Search Console工具找到流量最多（或者转化最好）的页面。 如果这两个工具你都没有用，你可以使用 Ahrefs Site Explorer （网站分析）中的 Top Pages（热门页面）报告。它会按照自然流量大小展示你的页面数据（从大到小）。Site Explorer > enter domain > Top Pages网站分析 > 输入域名 > 热门页面Ahrefs Site Explorer（网站分析）中的Top Pages（热门页面）报告 你可能还想优化内容质量劣的页面。例如，字数少的页面。你可以在Ahrefs Site Audit（网站诊断）中做到这一点；只需转到 Content Quality（内容质量）报告即可。Site Audit > project > Internal pages > Content quality网站诊断 > 项目 > 内页 > 内容质量重要: 字数偏低的页面并不总是质量低下的。但是一般来说，一个50个字的网页无法提供500个字的网页的价值。你可能会注意到 Content Quality（内容质量） 报告中的其它一些问题：Duplicate pages without canonical（没有权威标记的重复内容）。 我相信 关于“duplicate pages（重复页面）”的部分很容易理解。指的是这些页面与其他页面相同或非常相似。“没有权威标记”部分稍微有点技术难度——但是肯定需要我们去解决的。推荐阅读: 重复内容 — Search Console 帮助8. 检查失效页面以及链接失效页面和链接会影响网站的用户体验。当访问者访问网站上的失效页面或单击进入失效的第三方资源时，会看到下面这样的内容：结果？你的网站看起来不可靠、内容可能过时并且可能不可信。幸运的是，这些问题很容易解决。让我们从失效页面开始。失效页面：当你网站上的页面不再存在时，页面就会失效。有时，这些页面仍然有指向它们的内部链接，或者有来自其他站点的外链。你可以在 Site Audit（网站诊断）中找到这样的页面。Site Audit > project > Internal Pages > look for 4XX errors网站诊断 > 项目 > 内部页面 > 寻找4xx错误失效链接：当你网站链接到的第三方资源不存在时，链接就会失效。 你可以在 Site Audit（网站诊断）中找到这样的链接：Site Audit > project > External Pages > look for External 4XX errors网站诊断 > 项目 > 外部页面 > 寻找4xx错误 在我们的查找&修复失效链接完美指南（包括外链）中查看更多内容。9. 检查各个页面上的独特、吸引人的标题和描述你网站上的每个页面都应该有独一无二的标题与描述。不知道是什么？它们是显示在谷歌搜索结果中的HTML标签：小提示. 谷歌有时会动态地重写这些标签，并在搜索结果中显示其他内容。通常谷歌不会这样，这只是例外。通常SEO往往会告诉你按照以下方式优化这些标签：在你的标题中包含目标关键词在你的描述中包含目标关键词…结束这些建议本身没有错。如果你可以添加关键词而不会让用户感到唐突，那就去做吧。但是，这不是标题和描述的最主要目的。至少从SEO角度来看，其主要目的是吸引搜索引擎用户选择你的页面，而不是其他结果。这样，你可以从当前排名中获得更多点击量，这也是被广泛认可的间接排名因素。但是在开始更改之前，首先需要检查各个页面以发现：没有标题或描述的页面没有唯一标题或描述的页面标题和说明过长的页面具有多个标题或描述的页面为此，你需要查看 Ahrefs Site Audit（网站诊断）中的 HTML tags（HTML标签）报告。Site Audit > project > Internal pages > HTML tags网站诊断 > 项目 > 内页 > HTML 标签不是Ahrefs的用户?你可以用这个工具，虽然处理速度不快。将你的网站粘贴到工具中，它会提取标题和描述。它还会告诉你这些是否过长，是否可能在搜索结果中被截断。Ahrefs或任何其他工具都无法告诉你标题和描述是否吸引人。这个必须自己判断。但是，如果你在使用 Search Console，那么我有一个最后的技巧：在Search Console的效果报告中，查看展示多但点击率较低的网页。因为这些页面有很多展示，代表它们显示在了用户的搜索结果中，问题是没有人点击它们。这可能表明标题或描述不够吸引人。推荐阅读: 如何制作完美的SEO标题（四个步骤）10. 确保页面定位了正确的关键词并非网站上的每个页面都需要针对SEO进行优化。例如，“关于我们”或“联系我们” 页面针对哪些关键词进行了优化并不重要。其实你不应该这些页面进行任何关键词优化。因为对这些页面进行排名并不重要。对于其他页面，定位正确的关键词至关重要。是什么使“正确”的关键词？有以下三点：流量潜力竞争力低相关性（即搜索意图与页面的内容相匹配）让我们来做个简单的说明。假设我们经营一家在线电子产品的商店。在该站点上，我们有一篇博客文章列出了十大最佳耳机。我们应该围绕哪个关键词进行优化？可能是 “headphones（耳机）” 或者是 “best headphones（最好的耳机）”I如果我们将这两个词放入 Ahrefs Keywords Explorer（关键词分析）中，, 我们可以看到，尽管它们它们的 Keyword Difficulty（关键词难度、KD）得分大致相同：… “headphones（耳机）“的月搜索量是 “best headphones（最好的耳机）” 的3倍。小提示. 实际上 Keyword Difficulty（关键词难度）得分为58–63已经很高了。如果你没有一个高“权重”的网站，则很难对其进行排名。所以我们应该把 “headphones（耳机）” 作为我们的主关键词，对吗？别着急，因为这两个搜索词背后的“搜索意图”非常不同。为了更好的说明，请进入 SERP overview（SERP概览）数据，并查看谷歌排名靠前的结果：“headphones” 排名靠前的结果“best headphones” 排名靠前的结果参与 “headphones” 排名的是产品或分类页，这说明用户处于购买状态，并非学习(研究)状态。所以它们并不会选择阅读一篇文章。相反，参与 “best headphones” 排名的大多是博客和指南。这说明用户处于学习状态，并非购买状态。这里的核心很简单：不要尝试对不属于它们的页面进行排名.所以，请检查并确保页面没有定位 “不正确”的关键词。先从你最重要的页面开始检测。推荐阅读: 如何针对SEO进行关键词研究 — Ahrefs指南最后上面的所有内容都是非常基础的。除此之外，你还应注意许多其他技术和页面方面的内容。我已近在本指南中多次提及了 Ahrefs Site Audit（网站诊断）工具。我最后再提一次，它是深入挖掘、诊断网站、并发现问题的最佳方法之一 。你甚至可以通过设置抓取频率，来定期诊断你的网站：如果你最关心的是SEO的问题，可以阅读 我们的16个SEO诊断步骤，或者观看这个视频：https://www.youtube.com/watch?v=oJPGa0J6p5Q译者，Park Cheng，魔贝课凡联合创始人 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。",
  "headers": [
    {
      "level": "H1",
      "text": "网站诊断的10个步骤：改善网站SEO和用户体验"
    },
    {
      "level": "H2",
      "text": "什么是网站诊断？"
    },
    {
      "level": "H2",
      "text": "让我们开始"
    },
    {
      "level": "H2",
      "text": "1. 检查你的网站设计"
    },
    {
      "level": "H3",
      "text": "嵌入式弹窗和广告"
    },
    {
      "level": "H3",
      "text": "文字不清晰"
    },
    {
      "level": "H3",
      "text": "不明确的calls to action（CTA）"
    },
    {
      "level": "H2",
      "text": "2. 检查你的导航"
    },
    {
      "level": "H2",
      "text": "3. 查看移动端友好度"
    },
    {
      "level": "H2",
      "text": "4. 检查你的 robots.txt 文件以及 sitemap"
    },
    {
      "level": "H2",
      "text": "5. 确保网站使用 HTTPs"
    },
    {
      "level": "H2",
      "text": "6. 检查网站的加载速度"
    },
    {
      "level": "H2",
      "text": "7. 检查内容质量"
    },
    {
      "level": "H2",
      "text": "8. 检查失效页面以及链接"
    },
    {
      "level": "H2",
      "text": "9. 检查各个页面上的独特、吸引人的标题和描述"
    },
    {
      "level": "H2",
      "text": "10. 确保页面定位了正确的关键词"
    },
    {
      "level": "H2",
      "text": "最后"
    }
  ],
  "author": "Joshua Hardwick"
}