{
  "url": "https://ahrefs.com/blog/zh/what-are-keywords/",
  "slug": "what-are-keywords",
  "title": "什么是关键词？如何用关键词做好SEO？",
  "description": "关键词是人们在搜索引擎中输入的可以帮他们找到所需内容的单词和短语。",
  "content": "Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。 内容 关键词是人们在搜索引擎中输入的可以帮助他们找到所需内容的单词和短语。例如，如果你想买一件新夹克，你可以在Google中输入“mens leather jacket（男士皮夹克）”。即使这个短语由多个单词组成，它仍然是一个关键词。当然，除了SEO行业的人，没有人会使用这个术语。大多数人会称之为“Google搜索”或者“查询”。你只要知道关键词与“Google搜索”或者“查询”说的是一回事。在这篇指南中，你会学习到：为什么说关键词很重要如何让你的网站因关键词而展示在Google上如何查找关键词如何选择关键词如何优化关键词什么是长尾关键词为什么说关键词很重要？关键词至关重要，只要别人在搜索引擎中输入对应关键词，你的网站就会显示在搜索结果页面。例如，如果你在Google上搜索“how to do SEO（如何做SEO）”，我们就会出现在SERP的顶部：译者注：在Google浏览器中搜索“how to do SEO（如何做SEO）”，Ahrefs会出现在SERP的第一页的第一位。因为这个关键词在美国的月搜索量约为1,700次，所以出现在Google搜索结果的顶部会给我们带来很多访问者。事实上，在过去的一个月里，这个关键词给我们带来了900多次访问量。如何让你的网站因关键词而展示在Google上你的网站因一个相关的关键词而出现在Google搜索结果顶部，这可能会给你带来很多流量，但怎么做才能实现这一目标？有两种方法。点击付费（PPC）广告搜索引擎优化（SEO）点击付费（PPC）PPC指的是，通过付费给Google，你自己的网站可以显示在特定关键词的搜索结果页面。例如，如果你销售邮件营销软件，你就可以投标这个关键词，这样当人们搜索邮件营销软件的时候，你的网站可以出现在Google的搜索结果顶部位置。这也是Campaign Monitor在做的事情。译者注：Campaign Monitor是一家提供邮件营销服务的公司，搜索“email marketing software”的时候可以看到Campaign Monitor的付费广告。这就是点击付费（PPC）广告。你可以在Google的平台上选择关键词并投标出价。然后你的广告就会显示在Google的搜索结果页。每次有人点击广告并登陆你的网站，Google都会向你收费。你可以区分付费结果和自然搜索（非付费）结果，因为付费结果会被标记为广告。搜索引擎优化（SEO）SEO是优化你的网页以提高网页在Google自然搜索排名结果中的过程。而Google的工作就是为每个搜索查询排列出最好、最相关的结果。如果Google认为你的页面是关于这个搜索查询“最好”的结果，你的网站会得到源源不断的“免费”访问流量。例如，Ahrefs博客每月从Google那里获得大约383,000的自然搜索流量。我们排名第一的关键词比如“SEO audit”：译者注：关键词“SEO audit“的搜索结果概览中显示，排名第一的链接是Ahrefs的网站。关键词“Keyword research tools”：译者注：关键词“Keyword research tools“的搜索结果概览中显示，排名第一的链接是Ahrefs的网站。以及“local SEO”：译者注：关键词“local SEO“的搜索结果概览中显示，排名第一的链接是Ahrefs的网站。因为我们是销售SEO工具的，所有这些关键词都能吸引潜在客户，并为我们的最终盈利做出贡献。如何查找关键词大多数人对于他们想要在Google中获取排名的关键词有一些想法。但我们是不可能知道人们搜索的所有内容。这就是为什么值得去做一些研究来找到更多的关键词。有很多方法可以做到这一点，但最简单的方法是使用关键词研究工具。这些工具大多是一样的使用方法。你输入一些与你的行业相关的宽泛的关键词，我们称这些为种子关键词，然后这些工具就会反馈一些相关的关键词给你。例如，假设你在网上卖耳机。你的种子关键词可能是 “headphones”、“earbuds”、“earphones“和 “beats”。我们在Ahrefs的关键词分析中输入这些种子关键词，然后看看其中一个关键词报告。现在，我们看到超过200万个相关关键词，包括月搜索量、付费广告的平均每次点击费用（CPC），以及大量的其他SEO指标。如何选择关键词没有人能够就所有关键词进行排名，也没有人能够对所有关键词去做投标竞价。因此，明智地选择你的竞争范围是很重要的。我们来看看几个关键词指标和属性，以帮助你选择最好的关键词。搜索量搜索意图“价值”关键词难度（Keyword Difficulty）搜索量关键词受欢迎程度不同。例如，“how to post on instagram（如何在Instagram上发帖子）”的月搜索量大约有35,000次。但是“how to get backlinks（如何获得外链）”只有1,200的搜索量。这是否意味着对“how to post on instagram（如何在Instagram上发帖子）”进行排名能比“how to get backlinks（如何获得外链）”更好呢？不一定。如果你像我们一样销售SEO软件，对第一个关键词去进行排名是没有意义的。它可能会带来很多访问者，但没有人会买我们的产品。你需要找到与你的业务有一定相关性的关键词，然后对它们进行相应的判断。例如，“SEO tips（SEO技巧）”的月搜索量为2,200次，而“image seo（图像SEO）”的月搜索量为350次。由于这两个关键词对于我们出现在Google搜索结果中是有意义的，所以我们可能应该优先考虑第一个关键词。为什么呢？因为它有更多的搜索量。我们可能会从因为这个关键词而排名第一，从而获得比另一个关键词更多的流量。你可以在Ahrefs的关键词分析中查看几乎所有关键词的搜索量。只需输入你的关键词，选择一个国家，然后你就会看到特定国家和全球的搜索量。重要虽然搜索量在一般情况下是一个很好的流量潜力预测指标，但它并不是完美的。看看这两个关键词就知道了：从它们的搜索量来看，你会认为排在“SEO技巧（SEO tips）”搜索结果最靠前的几个网页会获得最多自然搜索流量。但是，如果我们在Ahrefs的网站分析中查看每个关键词的当前排名最前的页面，我们会发现情况恰恰相反。点击这两篇文章，你可以进一步了解为什么搜索量不一定是预测流量的好方法。搜索意图假设你在网上卖扫地机器人。单看搜索量，用“robot vacuum（扫地机器人）”作为关键词进行产品页面排名似乎是一个不错的选择。毕竟搜索“robot vacuum（扫地机器人）”的人可能是想买一个，而你是卖“robot vacuum（扫地机器人）”的。那么，这样做会有什么问题呢？问题在于，大多数搜索这个关键词的人并没有准备进行购买。他们只是在寻找产品评论和对现有最佳型号的分析。我们是怎么知道的？看看Google的搜索结果。译者注：在Google中搜索“robot vacuum（扫地机器人）”，我们可以看到高亮部分是排名靠前的链接共同包含的文案：“Best robot vacuum”。你可以看到，几乎所有的搜索结果都是由消费者评论网站精心排列出来的最好的扫地机器人排名。这一点很重要，因为Google的工作就是向用户展示关联性最高的搜索结果。如果这些搜索结果都是最好的扫地机器人的排名，那么我们可以假设这就是搜索者想要看到的。用SEO术语来说，这就叫搜索意图。如果想要给你的关键词争取到最佳的Google排名，你需要创建与搜索意图一致的内容。换句话说，不要选择搜索者用来找博客文章的关键词来进行网页排名，反之亦然。“价值”很多人经常执着于搜索量和搜索意图，而没有停下来思考关键词的价值。这是错误的。比方说，你在网上卖披萨烤箱。你可能会看到像“pizza dough（披萨面团）”这样的关键词，每月有43,000的搜索量，认为为这个关键词做排名很容易。但是，你要问自己，有多少搜索“pizza dough（披萨面团）”的人可能会想买一台披萨烤箱呢？现实的答案可能是没有。大多数人几乎只是在寻找一个快速的食谱。他们不太可能想在短期内花几百美元买一个披萨烤箱。那么你如何判断一个关键词的价值呢?如果你用关键词搜索工具，比如Ahrefs的关键词分析，来批量分析关键词，你可以参照每次点击费用（CPC）获得一个非常粗略的“价值”判断。这表示广告商平均愿意为关键词的一次点击支付多少费用。译者注：在Ahrefs的关键词分析中批量搜索关键词，可直观地对比各个关键词的每次点击费用（CPC）。这里的意思是说，如果广告商愿意为点击支付高额的费用，那么该关键词带来的流量必然是有一定价值的。然而，事情并没有这么简单。因为一个关键词对别人有价值，并不一定意味着它对你也有价值。以“link building service（链接建设服务）”为例：这个关键词的CPC很高，原因一目了然。因为提供链接建设服务可以赚很多钱，而提供链接建设服务的公司也愿意为这些流量支付高额的费用。然而，因为我们不提供链接建设服务，所以这个关键词对我们来说没什么价值。关键词难度（Keyword Difficulty）打个比方，你找到了一个完美的关键词。这个关键词有很高的搜索量，搜索意图与你的页面内容也匹配，看起来非常有价值。应该选这个关键词来进行页面排名，对吗？不一定。这取决于这个关键词的排名难度有多大。例如，看看“mortgage payment calculator（抵押贷款计算器）”：“mortgage payment calculator（抵押贷款计算器）”的关键词难度（Keyword Difficulty）得分为84。鉴于我们的评分是从0到100，这已经相当高了。这意味着许多排名靠前的页面有许多来自其他网站的链接。因为外链是一个重要的排名因素，如果没有大量的高质量外链，你的页面将很难超越其他页面获得排名靠前的位置。话虽如此，在Google上排名不仅仅是获得外链这么简单。所以说尽管关键词难度（Keyword Difficulty）评分有助于大致了解排名的难度，但还有其他你应该考虑的因素。了解一下，看看在我们评估关键词难度的完整指南中还有什么因素。如何优化关键词大多数指南说，你需要做以下工作来优化关键词：标题标签中要包含关键词URL要包含关键词页面中要多次提及关键词文案中要包含长尾关键词虽然做这些工作确实很有意义，但并不是你优化关键词的主要方式。优化关键词的主要方式是匹配搜索意图。我们在前面谈过匹配搜索意图这个问题，但必须再次强调这一点有多重要。如果你想用一篇博客文章来为“cast iron skillet（铸铁平底锅）”做排名，那可能不太现实。Google知道搜索者是来买锅的而不是来学习关于平底锅的知识。这就是为什么排名前五的结果都是电子商务网站的产品和产品分类页面。译者注：关于“cast iron skillet（铸铁平底锅）”的搜索结果页面概览显示，（高亮的）排名前6的网站，比如亚马逊等都是电商网站的页面，供消费者购买。但是匹配搜索意图不仅仅是创建出正确的内容类型。你还要输出搜索者想看的内容。例如，假设你想用“backlinks（外链）”进行排名。从目前排名靠前的页面可以看出，搜索者想要的是一篇博客文章，所以你的网页就是需要做成像“博客文章”这种内容类型的。但是你的博客文章到底应该写些什么？你文章应该以什么角度切入呢？你可以通过浏览排名靠前的页面来获得灵感。在这种情况下，几乎所有的帖子都有相同的切入角度：“what are backlinks（什么是外链）？”译者注：“backlinks（外链）”关键词的搜索结果概览中，高亮部分是排名靠前的链接共同包含的内容：“what is a Backlink（什么是外链）”。为了获得这个搜索查询的最佳排名机会，你需要跟着这样做。但也不要止步于此。你还应该检查排名靠前的页面还涵盖了哪些内容。例如，几乎每一个以“backlinks（外链）”排名的页面都涵盖了三个子主题：什么是外链？为什么外链很重要？外链有哪些类型？这说明大多数搜索者都想知道这些问题的答案，所以你应该在你的文章中包含这些问题。推荐阅读：站内SEO行动指南什么是长尾关键词？如果你以前读过任何关于关键词研究的文章，你可能会遇到过长尾关键词这个词语。大多数指南将其定义为由很多词组成的关键词，但这并不完全准确。长尾关键词是指单个搜索量较低的搜索查询。虽然较长、较具体的关键词的搜索量往往较低，这是准确的，但由只有一个或者两个单词组成的词组也可以是长尾关键词。事实上，在我们的数据库中，有超过3.5亿个每月搜索量少于10次的由一个或者两个单词组成的词组。译者注：在Ahrefs的数据库中，筛选月搜索量不超过9的，同时单词数不超过2的关键词，超过3亿个。还有人说，长尾关键词更容易排名。这有时候会奏效，但并不一直奏效。我们所说的“话题长尾关键词”比“隶属长尾关键词”更能应验这个说法。你是否感到困惑？让我们来简单了解一下这两组概念。什么是“隶属”长尾关键词？“隶属”长尾关键词是指搜索热门话题的不太常见的表达方式i。例如，看看这些关键词：每个关键词的月搜索量都小于50，但它们都只是搜索“how to lose weight（如何减肥）”这个话题的不太常用的表达方式。“how to lose weight（如何减肥）”这个关键词在美国的月搜索量有89,000之多。Google知道这一点，这就解释了，为什么同一个页面在所有这些关键词排名中能排名第一。译者注：在Ahrefs的网站分析中，搜索某一个链接，可以看到此链接在多个不同的关键词排名中获得排名第一的位置。这并不少见，我们的研究表明，排名靠前的页面平均会在约1000个其他相关关键词获得前10的排名。译者注：在Ahrefs的研究中，排名越靠前的页面参与更多其他相关关键词，并且这些页面获得排名的关键词数量越多，排名越低的页面，能获得排名的关键词数量会越少。而这个表格统计的是排名能获得前10的关键词数量平均值。我们可以从中学到两点：第一，相比就搜索话题最常用的关键词进行排名，对“隶属”长尾关键词进行排名通常并不容易，例如“how to lose weight（如何减肥）”。如果你将“how to lose weight（如何减肥）”的关键词难度得分与上面其他的长尾关键词进行比较，你就会发现这一点，它们关键词难度得分都很高。第二，你不应该用“隶属”关键词来优化你的页面。你应该以搜索某一主题的最常用的表达方式去优化你的页面。什么是“话题”长尾关键词“话题”长尾关键词是指搜索某个话题的最常用的表达方式，但单个搜索量低的关键词。关于“话题”长尾关键词有一个很好的例子，就是“keyword cannibalization（关键词冲突）”：“keyword cannibalization（关键词冲突）”的月搜索量仅为250次，但这并不是因为这个话题有其他更常用的搜索表达。而是因为这个话题很少有人关心，所以该关键词的月搜索量较低。我们可以从中学到两点：第一，“话题”长尾关键词通常更容易获得高排名，因为这些词的竞争较低。人们不愿意在流量小的话题排名上投入太多时间和精力。第二，“话题”长尾关键词可以给你的网站带来大量流量。你只需要大量使用它们进行排名。你可以通过在Ahrefs的关键词分析中搜索某一主题来发现一些“话题”长尾关键词，然后筛选出流量小、难度低的关键词。如果“父主题”与关键词本身是匹配的，这个关键词通常就是一个“话题”长尾关键词。例如，“keto and migraines（酮类和偏头痛）”的父主题就是与关键词本身一样的。如果我们观察这个关键词的搜索结果，我们会发现很多页面每个月都有几百的访问量，而外链却很少。这个可能是相当容易排名的关键词，即使在一个相对新的网站，只要你的内容是很好地优化过的。最后总结关键词是SEO的基础。你要知道人们在搜索什么、他们想看到什么，才能为搜索引擎去创建或者优化你的内容。想了解更多关于关键词的研究？阅读我们完整的关键词研究指南。正在寻找一些快速关键词研究技巧？这里有6个。有问题？上推特找我吧。译者，Jane Tam，慢慢来文案策划 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。",
  "headers": [
    {
      "level": "H1",
      "text": "什么是关键词？如何用关键词做好SEO？"
    },
    {
      "level": "H2",
      "text": "为什么说关键词很重要？"
    },
    {
      "level": "H2",
      "text": "如何让你的网站因关键词而展示在Google上"
    },
    {
      "level": "H3",
      "text": "点击付费（PPC）"
    },
    {
      "level": "H3",
      "text": "搜索引擎优化（SEO）"
    },
    {
      "level": "H2",
      "text": "如何查找关键词"
    },
    {
      "level": "H2",
      "text": "如何选择关键词"
    },
    {
      "level": "H3",
      "text": "搜索量"
    },
    {
      "level": "H3",
      "text": "搜索意图"
    },
    {
      "level": "H3",
      "text": "“价值”"
    },
    {
      "level": "H3",
      "text": "关键词难度（Keyword Difficulty）"
    },
    {
      "level": "H2",
      "text": "如何优化关键词"
    },
    {
      "level": "H2",
      "text": "什么是长尾关键词？"
    },
    {
      "level": "H3",
      "text": "什么是“隶属”长尾关键词？"
    },
    {
      "level": "H3",
      "text": "什么是“话题”长尾关键词"
    },
    {
      "level": "H2",
      "text": "最后总结"
    }
  ],
  "author": "Joshua Hardwick"
}