{
  "url": "https://ahrefs.com/blog/zh/yoast-seo/",
  "slug": "yoast-seo",
  "title": "如何使用 Yoast SEO 来提升 SEO 效果",
  "description": "Yoast SEO 是一款广受欢迎的 WordPress 插件，可帮助您优化内容以实现 SEO 效果最大化。进一步了解它的工作原理和主要功能。",
  "content": "Jenny Abouobaia 珍妮（Jenny）是一位屡获殊荣的SEO顾问，她专门使用品牌公关来建立E-A-T，从而帮助客户在最大程度上提高SEO结果，并在利基市场和技术SEO方面具有深厚的造诣。 内容 在当今的数字营销时代，搜索引擎优化对于任何拥有在线业务的企业或个人来说都至关重要。但要考虑的因素太多，可能会让人不知所措。幸运的是，有一些工具可以帮助简化这一过程并提高效果。WordPress SEO 插件 Yoast SEO 就是这样一款工具。在本文中，我们将探讨如何使用 Yoast SEO 来提升你的 SEO 效果。我们将介绍使用该插件的基础知识、需要利用的关键功能、以及如何分析内容以获得最佳的 SEO 效果。内容Yoast SEO 是什么？Yoast SEO 是目前最流行的 WordPress 插件之一。它的主要功能是帮助您优化内容、以实现 SEO 效果最大化。使用 Yoast SEO 插件，您可以轻松添加元描述、进行基本的页面 SEO 分析，以及创建 XML 网站地图，帮助搜索引擎更好地索引您的网站。Yoast SEO 是免费的，但也有高级版本。高级版本提供了更多功能，如高级内容分析、内部链接建议、和重定向管理器。如何设置 Yoast SEO现在我们知道 Yoast SEO 是什么了，让我们看看如何开始使用该插件。安装插件安装插件非常简单。在 WordPress 仪表板中，前往插件 > 添加新插件。然后搜索 “Yoast”。只需点击 “安装”，然后点击 “激活 “即可。插件激活后，您就可以开始进行初步设置了。首次安装向导会询问您一些基本信息。您可以填写这些信息，填写完毕后，安装就完成了。完成初始设置后，即使您不做任何其他操作，Yoast 也会自动对您的网站进行一些更改，例如：添加网站地图添加 robots.txt 文件添加基础的结构化数据Yoast SEO 的基本设置完成设置后，最好前往设置菜单。让我们来看看其中一些值得注意的选项。常规设置常规设置下的第一个项目是 “Site features（网站功能）” 菜单。在这里，您可以找到 Yoast 提供的几种不同的预设功能。除 “Inclusive language analysis（包容性语言分析）” 外，其他功能都是自动启用的，因此您可能需要查看并根据需要启用或禁用这些功能。“Site basics（网站基本信息）” 和 “Site representation（网站表现形式）” 菜单很可能已经在您的初始设置中就已经完成了。在这里，您只需决定如何在搜索结果中显示网站品牌——例如，网站名称、标语和LOGO等。常规设置菜单的最后一项是 “Site connections（网站连接）”（正式名称为网站管理员工具）。在这里，您可以使用不同的工具（包括 Bing 和 Google）验证您的网站。这样，Yoast 就能在您的主页上自动添加验证元标签。内容类型、类别和标签设置菜单的下两个部分——“Content types（内容类型）“和 “Categories and tags（类别和标签）”——都做着差不多的事情。它们允许你控制网站的整个部分如何（以及是否）出现在搜索结果中。您可以设置不同的内容类型（页面、帖子、类别等）自动索引或不索引，并决定每种内容类型的标题标签的结构。您还可以为不同的内容类型设置结构化数据类型（例如：article、FAQ、about 等等）。您必须非常谨慎地使用这些设置，因为您可能会因为误操作导致网站被取消索引。此外，错误的结构标记还会对您在搜索引擎结果页面（SERP）上的排名产生负面影响。我建议您保持这些设置不变。如果您确实想阻止搜索引擎索引某些页面、或使用特定类型的模式，请在单个页面设置中进行更改。高级设置在大多数情况下，除非你是经验丰富的 SEO 人员，否则最好不要使用高级选项。如果你不知道自己在做什么，肯定不想调整 “Crawl optimizations（抓取优化）” 等元素。我建议您确保您的主题启用面包屑功能。面包屑是一种导航元素，有助于让用户和搜索引擎更容易地访问您的网站。请注意，如果您在网站上使用像 Elementor 这样的页面编辑器，可能需要使用简码才能在页面上显示面包屑导航。如何在 WordPress 编辑器中使用 Yoast SEO好了，既然我们已经介绍了入门的基本知识，下面我将带您了解在 WordPress 编辑器中使用 Yoast SEO 时常用的关键功能。您可以点击 WordPress 编辑器右上角的符号来展开侧边栏菜单，或者使用页面底部的 “Yoast SEO” 方框来进行 Yoast 的设置。这是您与 Yoast 互动最频繁的地方，可以优化和调整每个页面的设置。让我们来看看关键功能以及如何使用它们。Focus keyphrase（重点关键词）您需要完成的第一个部分是 “keyphrase（关键词）”（即您的核心关键词）。在此输入您希望在搜索结果中排名的关键词或短语。您可以使用 Ahrefs Keywords Explorer（关键词分析） 等工具进行关键词研究，从而确定您想要对哪些关键词进行排名。完成此操作后，Yoast 可以分析您的内容，了解其优化程度。SEO analysis（SEO 分析）Yoast 的 SEO analysis（SEO 分析）部分旨在为您提供建议，告诉您需要在内容中包含哪些元素，才最有可能获得所选关键词的排名。搜索引擎优化和可读性分析工具都采用类似交通灯的提示系统。内容中包含的建议元素越多，就越有可能获得绿灯。该插件的工作原理是根据总字数计算关键词的使用频率，并检查以下元素是否包含您选择的关键词：页面的 SEO 标题介绍性段落题目URL页面内容元描述图片 alt 标签Yoast 的另一个优点是它的辅助性特别好。对于需要将内容上传到 WordPress 的人来说，该插件可以帮助确保他们记住包含元描述等某些元素。举例来说，如果某人是新手，那么有一份内容的清单可以成为很好的培训工具。延伸阅读页面 SEO 优化：新手指南 Readability scores（可读性评分）Yoast SEO 中的 Readability scores（可读性评分） 旨在帮助您确保您的内容易于理解，能用最简洁的方式向网站用户传达您的信息。它使用 Flesch Reading Ease 来衡量文本难度，并结合 Yoast 自己的算法，考虑句子和段落的长度和结构、过渡词的使用以及被动语态等要素。与 SEO 分析一样，可读性分析也能显示哪些元素是好的，哪些需要改进。这部分的好处在于它有一个高亮功能，可以清楚地显示内容中的问题所在。例如，它将显示受特定问题影响的文本百分比。如果您点击该问题右侧的 “眼睛” 图标，它就会高亮显示受影响的所有区域。这样，您就可以直接在 WordPress 编辑器中轻松添加更改。延伸阅读Flesch Reading Ease: 它对搜索引擎优化重要吗？(数据研究）Google preview（谷歌预览）在 “Google preview（谷歌预览）“部分，您可以看到您的页面在手机和桌面搜索结果中的显示效果。您可以在此编辑 URL 别名、标题标签和元描述，Yoast 会建议您这些元素的长度是否合适，是否包含您的关键词。Social previews（社交媒体预览）通过该部分，您可以查看您的内容在 Facebook 和 Twitter 等社交平台上分享时的显示效果。在这里，您可以为每个平台设置特定的功能图片、标题和描述。如果留空，工具将自动使用 WordPress 中的特色图片和标题。请注意，要实际预览这些元素在每个社交平台上的显示效果，您需要使用 Yoast SEO Premium 插件。结构标记结构标记能让搜索引擎更好地了解页面内容，并帮助您获得丰富的搜索结果（富媒体结果）。您可以使用 Yoast 插件的模式部分来帮助定义单个页面，例如FAQ 页面About 页面checkout 页面默认模式选项设置为您在初始设置中指定的任何选项。如果您没有按照 Yoast 的建议进行任何更改，那么这将是 “网页” 和 “文章”。但您可以根据需要进行更改。高级设置您可以使用高级选项做很多不同的事情，包括：阻止网页被搜索引擎索引。阻止搜索引擎跟踪页面上的链接。为页面添加 canonical URL。使用高级 meta robots 参数（noarchive、nosnippet 等）。添加面包屑的标题如前所述，你需要非常小心地使用高级选项。在大多数情况下，默认设置就足够了。如果你不知道这些设置的作用，最好不要乱动。让 Yoast 发挥最大作用现在，很明显 Yoast SEO 插件可以改善网站的 SEO 效果。但要想最大限度地发挥它的作用，最好将它与其他一些插件结合使用，这些插件能覆盖 Yoast 所不能覆盖的领域。与 Yoast 配套使用的最佳插件之一是 Ahrefs SEO WordPress 插件。这个插件非常省时，因为它会根据自动内容审核结果，为您提供如何提高每个页面搜索引擎优化性能的建议。此外，它还能将您在 Yoast 中设置的关键词与 Ahrefs 和 Google Search Console 的数据结合起来，在您的页面旁边显示关键的搜索引擎优化指标。Yoast 还提供多个付费插件（每个网站每年 79 美元）。这些插件可与免费版 Yoast SEO 配合使用，并可满足特定需求，如Yoast Local SEO 插件Yoast WooCommerce SEO 插件Yoast Video SEO 插件Yoast News SEO 插件Yoast SEO Premium：值得购买吗？如前所述，Yoast 还提供一个高级版本，具有更多附加功能，可以更高级地控制网站的 SEO。以下是 Yoast SEO 高级版的一些额外优势：添加同义词和相关关键词的功能内部链接建议重定向管理器404 监控孤岛内容检测免费访问 Yoast SEO 学院Yoast SEO 高级版每年每个网站的费用为 99 美元。对我来说，高级功能是必须的。但如果您有多个客户网站，或者有自己的投资组合，这可能是一笔不必要的费用。Yoast SEO 的缺点在讨论 Yoast SEO 时，如果不提及它的不足之处（根据我的经验），是不公平的。对于只想帮助优化博客的人来说，Yoast 是一款很棒的插件。但如果你想要更高级的控制，对我来说，Yoast 与其他 SEO 插件相比就开始显得平庸了。您可以在 Rank Math 或 All In One SEO 等竞争插件的免费版中找到许多更高级的功能，但这些功能只有 Yoast 的高级功能才能提供，或者根本不存在。例如，Rank Math 的免费插件可以让你：添加重定向（Yoast 付费版本提供）。监控 404 页面（Yoast 付费版本提供）。自动图片 SEO 优化（自动添加 alt 文本和图片标题）。与 Google Analytics 集成。即时索引。使用高级网站管理员工具。进行本地搜索引擎优化（仅作为 Yoast SEO 的附加付费插件提供）。进行 WooCommerce SEO（仅作为 Yoast SEO 的附加付费插件提供）。Rank Math 免费插件包含的一些高级功能示例。如果您只需要在个人博客或企业网站上使用一些基本的搜索引擎优化帮助，那么 Yoast 的效果会很好。但如果您需要为多个网站提供搜索引擎优化插件，并希望获得高级功能，那么它的成本就会开始变得高昂。如果是这样，也许是时候考虑另一种选择了。最后Yoast SEO 是改进网站 SEO 优化的绝佳工具。它可以帮助您分析内容，确保您的内容针对搜索引擎进行了优化。它的付费升级版拥有一些出色的功能，可让您的搜索引擎优化工作更上一层楼。但需要注意的是，Yoast 并不能一站式满足您所有的搜索引擎优化需求。要想最大限度地提高网站的搜索引擎优化性能，还需要使用其他插件和技术。有问题吗？在 Twitter 上找我吧。译者，Park Cheng，歪猫出海创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human:",
  "headers": [
    {
      "level": "H1",
      "text": "如何使用 Yoast SEO 来提升 SEO 效果"
    },
    {
      "level": "H2",
      "text": "Yoast SEO 是什么？"
    },
    {
      "level": "H2",
      "text": "如何设置 Yoast SEO"
    },
    {
      "level": "H3",
      "text": "安装插件"
    },
    {
      "level": "H3",
      "text": "Yoast SEO 的基本设置"
    },
    {
      "level": "H4",
      "text": "常规设置"
    },
    {
      "level": "H4",
      "text": "内容类型、类别和标签"
    },
    {
      "level": "H4",
      "text": "高级设置"
    },
    {
      "level": "H2",
      "text": "如何在 WordPress 编辑器中使用 Yoast SEO"
    },
    {
      "level": "H3",
      "text": "Focus keyphrase（重点关键词）"
    },
    {
      "level": "H3",
      "text": "SEO analysis（SEO 分析）"
    },
    {
      "level": "H3",
      "text": "Readability scores（可读性评分）"
    },
    {
      "level": "H3",
      "text": "Google preview（谷歌预览）"
    },
    {
      "level": "H3",
      "text": "Social previews（社交媒体预览）"
    },
    {
      "level": "H3",
      "text": "结构标记"
    },
    {
      "level": "H3",
      "text": "高级设置"
    },
    {
      "level": "H2",
      "text": "让 Yoast 发挥最大作用"
    },
    {
      "level": "H2",
      "text": "Yoast SEO Premium：值得购买吗？"
    },
    {
      "level": "H2",
      "text": "Yoast SEO 的缺点"
    },
    {
      "level": "H2",
      "text": "最后"
    }
  ],
  "author": "Jenny Abouobaia"
}