{
  "url": "https://ahrefs.com/blog/zh/youtube-keyword-research/",
  "slug": "youtube-keyword-research",
  "title": "如何做Youtube关键词研究？只需要3个简单步骤",
  "description": "学习如何进行关键词研究，这个方法让我们的频道在一年的时间内，每月从10,000播放量涨到了200,000播放量。",
  "content": "Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。 内容 希望增长你的YouTube频道并吸引更高的观看量吗？关键就是瞄准具有搜索需求的那些话题。这个方法帮助我们Ahrefs YouTube频道在短短的一年时间内，将月播放量从每月一万次增长到超过二十万次。而且在这一年里，我们还获得了五万多个新的订阅用户。下面这篇文章，我会跟你介绍如何通过YouTube找到那些优质关键词的“三步曲”。https://youtu.be/kAuM2nQb_P8第一步：绘制出话题的层次结构假设你是在网上卖手机壳的，你要创建一个全新的YouTube频道，通过新手机拆箱视频来吸引潜在客户。你的第一个想法可能是追求有巨大搜索量的泛主题。但问题来了，如果你的视频话题过于宽泛，有可能吸引的用户也不会那么精准。同理，如果你的话题过于狭窄，那么有可能无法吸引足够多的人。所以，你需要通过绘制话题层次结构来解决这个问题。如果是“拆箱”视频频道的话，那么“拆箱”这个词可能就是结构的最顶层，从最顶层开始，你可以先罗列出一些流行的手机品牌。然后，在这些品牌下一层，你可以添加一些具体的手机型号。关于这个层次结构，你可以自由发挥来进行更深的延伸。专家建议如果这种手工的过程对你来说很难的话，有一个小诀窍，就是使用通用符命令（*）来获取YouTube自动推荐的（关键词延伸）。举个例子，我们可以搜索 Samsung Galaxy S* 来找到更多的相关型号。第二步：生成关键词并查找其搜索量接下来，使用关键词研究工具找出人们正在搜索与你话题有关的那些东西。市面上有很多关键词研究工具，但大多数只显示谷歌的搜索量而不是YouTube的搜索量。这些工具基本没用，因为人们在YouTube上搜索的方式与他们在Google上搜索的方式截然不同。举个例子， Google Trends（谷歌趋势）显示，在谷歌上搜索 “pizza dough recipe（披萨面团菜谱）”的趋势是缓慢下降的。但在YouTube上的趋势却是上升的。现在，你可能认为解决方案是查看YouTube上的视频观看次数。但是，这也可能误导你。例如，我们YouTube上“SEO audit”一词的排名还不错，这个视频在过去三年中已经获得了惊人的64万次观看。换算下来，平均每月约一万八千次次观看。但是，查看我们的YouTube分析报告后发现，我们的观看次数大多都来自付费的YouTube广告，而非自然搜索。考虑到这一点，以下是三个可用于查找YouTube关键词及其搜索量的好工具。1. Ahrefs Keywords Explorer（关键词分析）进入 Ahrefs Keywords Explorer（关键词分析）工具，选择 Youtube作为搜索引擎的选项，并且在输入框中填写你的主题词汇，这里我们就使用 “unboxing”（拆箱）这个词。你可以看到这个关键词在美国，每月搜索量达到四万次。问题是这个主题词太宽泛了，这很有可能是为什么只有32％的搜索会产生点击。想想看，如果有人在 YouTube 中搜索“拆箱”这个词，他们到底想看到什么样的拆箱视频呢？你可能毫无头绪，搜索这个词的用户们也一样。怎么办呢？这时，你可以点击左侧的 Phrase Match（短语匹配）报告，就可以查看到包含种子关键词的所有关键词信息。在这个例子中，我们找到了约 12万个关键词建议。但是存在一个问题：有些关键词与智能手机无关 — 智能手机才是我们YouTube频道的主题。比如：任天堂游戏机（Nintendo Switch）的拆箱搜索需求很高，但我们肯定不会因此去创建一个视频。要解决此问题，请回到第一步的层次结构图上。将一些主题词粘贴到“包含”过滤器中，并以逗号分隔，同时切换选择到 “Any word”，去查看包含主题词以及需要筛选词汇的所有关键词建议。这时候，你应该看到了一个相关度极高、并且方便管理的关键词建议表格。为了更好的精选关键词，你甚至还可以通过筛选功能，提炼出月搜索量高于500的那些词。专家建议 大多数关键词研究工具（比如 Ahrefs 的 Keywords Explorer）用的都是年度搜索数据来预估平均每月搜索量。因此，在决定追逐某个关键词前，最好检查一下它的季节性搜索变动趋势。使用 Keywords Explorer（Ahrefs 关键词分析）工具分析 “iPhone 8 unboxing”（iPhone 8拆箱）这个词，可以看其搜索趋势里有一个峰值然后递减。这很正常，因为搜索峰值出现在iPhone 8刚发布时。随着 Apple 及其他制造商发布新机型，iPhone 8会逐渐变得不那么受欢迎。简而言之，像这样受季节性因素搜索量下降的主题词往往不是最好的选择。2. Youtube Ads你可以通过投放 YouTube 付费广告，定位任何一个搜索词让你的视频展示在用户面前。比如，你有一个 iPhone X 的拆箱视频，那么你可以在 TouTube 上投放 “iPhone X unboxing” 这个词。让你的广告跑满30天，然后查看 Google Ads 下的 Search Terms 报告，你会看到每个词的广告展示次数。一个关键词获得的广告展示次数会比其搜索量稍小一些，因为你的广告不会针对每次搜索进行展示，但它足以提供大致的数据。3. Youtube Autosuggest（YouTube自动填充） + Google Trends（谷歌趋势）在 YouTube 搜索框中输入一个种子关键词 ，你会发现有一系列的相关关键词弹出来，这就是 YouTube 的‘自动补充’结果，这是一个非常棒的获取关键词的源头。例如，如果你输入“iPhone * unboxing”，你会得到像”iPhone XS Max unboxing”以及 “iPhone 7 unboxing.” 这样的提示。如果你看到感兴趣的关键词，可以把它们丢到 Google Trends（谷歌趋势）里，同时在下拉菜单中选择 “YouTube search” 来查看这些词的热度。从上图，你就会发现搜索 “iPhone XS unboxing”的人比 “iPhone 5S unboxing”要多。专家建议 很遗憾，同时使用 YouTube 自动填充结果和 Google Trends 并不能给你完全准确的月搜索量数据。如果你恰好知道其中一个关键词的大概搜索量的话，可以通过结合 Google Trends（谷歌趋势）的相对热度来“猜算”其它关键词的搜索量。结合方法 #3 和方法 #2 即可。第三步: 检查搜索意图如果不了解用户的搜索意图的话，你还没开始就注定失败了。因为 YouTube 和 Google 一样，他们的目的是尝试给用户想看的结果。这就是为什么在 YouTube 中搜索 Apple 的时候，结果会展示苹果相关的视频以及介绍，是苹果电脑公司。。。。。。而非水果有关的内容。理解用户的搜索意图是关键词研究中很重要的一步，最简单的办法就是问自己这样一个问题：“搜索这个词的人想看到什么内容？”对于部分关键词，搜索意图是非常明显的。如果一个人搜索 “Galaxy S9 unboxing” ，那么用户想要看的就是 Galaxy S9 手机的拆箱视频，从取出机子的那一刻，到展示箱子里的所有东西。相反的也有一些关键词，比如 “iPhone apps” 这样的，那你可猜想的余地有很多。他们是想知道今年必备的 apps？、还是想知道新发布的 app有哪些？或者他们想知道去苹果及安卓商店哪里可以购买这些 apps？。找出答案最快的办法便是，去 YouTube 中搜索这个关键词，并查看排名靠前的几个结果即可。这里，你就可以看到，用户搜索 “iPhone apps” 是为了找到 app 评测视频P，尤其是今年才发布的那些流行应用。如果你希望这个词能够获得 YouTube排名的话，那么你最好做此类型的视频。专家建议 如果你想看到最精准的结果，记得在（浏览器）隐身模式去查看 YouTube 搜索结果，因为 YouTube 经常会根据用户的浏览历史给他们返回更个性化的搜索结果。额外的建议：“双渠道”获取播放量有过这样的经历吗？就是在 Google 搜索关键词的时候，结果中出现了 YouTube 视频。不管这个视频出现在哪个位置，是特殊的首位展现，还是特殊的 YouTube 视频列表展现位，或者是混合着出现，这些都在告诉你一件很重要的事情：用户搜索这个词是想看视频。这个时候，你可以创建相关主题的视频，会在谷歌搜索中获得排名这时你可以通过两个渠道获取视频播放量，而不仅仅只是 YouTube。下面是找到这种视频主题的三个方法。1、寻找带有视频搜索结果的关键词从你的词库当中挑选一个关键词放入谷歌中搜索。查看搜索结果页面，看看是否有特殊的视频展示位，或者是视频列表？如果出现的话，那就意味着，这个视频可以同时通过 YouTube 及 Google 获取播放量。如果你想知道当前有排名的视频正在从谷歌获取多少流量，可以挨个把视频的 YouTube 链接复制并粘贴到 Ahrefs Site Explorer（关键词分析）中。或者，你可以使用这个 Scraper 谷歌浏览器插件，将搜索结果中所有的 YouTube 视频链接都采集下来，并放入 Ahrefs Batch Analysis tool（网址批量分析）工具中。做法是，在搜索结果的任意空白处，右击选择 ”Scrape similar…”（采集相似），然后在其中添加下方的 XPath 代码作为 “Selector”（选择器）：//a[starts-with(@href,\"https://www.youtube.com/watch\")]同时在 “Columns”（栏目）中添加下方的 XPath 代码：@href结果应该像下方这样：点击 “Scrape”（采集）按钮，然后点击 “Copy to clipboard”（复制到剪贴板），然后将复制的内容粘贴到 Batch Analysis tool（网址批量分析）工具中。 点击 “Traffic”（流量）栏目，从大到小排列。通过 Site Explorer（网站分析）功能，深入研究每个链接有排名的关键词，重点关注那些正在带来最多流量的词。同时也建议关注下 “Overview” （概览）报告中的自然流量报告，至少要确认，这个视频一直都在从谷歌获取流量。有些主题/关键词波动会比较大，可能不会是个非常好的选择。2、在Content Explorer（内容分析）中搜索视频主题Content Explorer（内容分析）是一个拥有10多亿页面收录的可搜索数据库，配有完整的SEO数据、以及社交媒体数据。最厉害的是，它支持很多类型的高级搜索命令。你可以像下面这样搜索自己需要的信息：site:youtube.com inurl:watch title:topic上方这段代码搜索的是标题中带有特定关键词的 YouTube视频内容。根据自然流量从大到小进行排列，找到可以“双渠道”获取流量的潜在视频主题。从上图你可以看到，第一个视频每月预计可以从谷歌自然搜索中获取约15,100次访问。如果你想查看这个视频主题是否一直都可以从谷歌获取流量的话，可以点击后方的 “Details”（详情）按钮。你最好希望看到下面这样的数据（很稳定的趋势）：而非这样（不稳定趋势）：查看选单标签中的 “Organic keywords”（自然搜索关键词）查看具体参与排名的关键词是什么，同时可以看到通过这些词汇预估可以获得多少流量。3、使用 YouTube 和 Site Explorer（网站分析）功能查看高流量的那些视频找到一个竞争对手的频道，点击 Videos（视频列表）选项，查看所有该频道中上传的视频。将其中的 YouTube 视频链接，一个一个的输入到 Ahrefs Site Explorer（网站分析）中，找出那个有自然搜索流量的视频。。为了加快查找速度，你也可以使用之前说的那个 Scraper 浏览器采集插件，进行批量处理。在 YouTube 视频列表页面上任意空白位置右击，选择“Scrape similar…”（采集相似内容），并且在 “Selector”（选择器）中加入下方这段代码：//h3/a在“Columns”（栏目）中填写下方这段 XPath 代码。concat ('https://www.youtube.com', @href)就可以得到下方这样的结果：点击 “Scrape”（采集） ，然后再点击 “Copy to clipboard”（复制到剪贴板）将复制的内容粘贴到 Ahrefs Batch Analysis tool（网址批量分析）工具中，选择URL模式并开始查询结果，然后结果按照 Traffic（流量）从大到小进行排序。如果你想查看视频有排名的那些关键词，直接点击下拉框中的 “Organic keywords”（自然搜索关键词）。提示：别忘了检查 “Overview”（概览）中“Organic traffic”（自然搜索流量）数据，用来检测主题是否能够持续获取流量。最后总结如果你没有定位好那些有搜索量的关键词，那你基本不可能从 YouTube 搜索获得视频播放量，道理就这么简单。为什么我们知道这个呢？因为去年我们做了一系列与产品相关的视频，叫做 Marketing with Ahrefs （和Ahrefs一起做营销）。这些视频主题都没有什么搜索量，所以并没有从 YouTube 搜索中获得很多流量。然后我们开始针对关键词进行了优化。下图就是我们优化后的流量变化。如果你的目标是建立自己的 YouTube 频道、并且获取更多浏览量的话，那么建议你从关键词研究开始。点击这里查看更多关于 YouTube SEO 相关的内容。有问题的话，可以评论留言或者在Twitter里向我提问。译者，Park Cheng，魔贝课凡联合创始人 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。",
  "headers": [
    {
      "level": "H1",
      "text": "如何三步做好YouTube关键词研究"
    },
    {
      "level": "H2",
      "text": "第一步：绘制出话题的层次结构"
    },
    {
      "level": "H2",
      "text": "第二步：生成关键词并查找其搜索量"
    },
    {
      "level": "H3",
      "text": "1. Ahrefs Keywords Explorer（关键词分析）"
    },
    {
      "level": "H3",
      "text": "2. Youtube Ads"
    },
    {
      "level": "H3",
      "text": "3. Youtube Autosuggest（YouTube自动填充） + Google Trends（谷歌趋势）"
    },
    {
      "level": "H2",
      "text": "第三步: 检查搜索意图"
    },
    {
      "level": "H2",
      "text": "额外的建议：“双渠道”获取播放量"
    },
    {
      "level": "H3",
      "text": "1、寻找带有视频搜索结果的关键词"
    },
    {
      "level": "H3",
      "text": "2、在Content Explorer（内容分析）中搜索视频主题"
    },
    {
      "level": "H3",
      "text": "3、使用 YouTube 和 Site Explorer（网站分析）功能查看高流量的那些视频"
    },
    {
      "level": "H2",
      "text": "最后总结"
    }
  ],
  "author": "Joshua Hardwick"
}