{
  "url": "https://ahrefs.com/blog/zh/zero-volume-keywords/",
  "slug": "zero-volume-keywords",
  "title": "你是否应该定位零流量的关键词？视情况来定",
  "description": "许多人说，搜索和定位零流量的关键词是获得更多流量的可靠方法，但这是真的吗？",
  "content": "Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。 内容 如果你的关键词工具显示没有人在搜索某个关键词，你是否应该定位这个关键词？很明显，答案是 “不”，但在 SEO 中已经有很多关于定位零流量关键词的好处的讨论了。那么是什么原因呢？是否有任何合理的理由这样做，或者这只是另一个被夸大的 SEO 趋势？在这篇文章中，我们将讨论针对低流量关键词的四个好处，以及为什么它们并不总是那么黑白分明。 内容“它们可能会得到一些搜索流量”关键字研究工具中的搜索量并不完美，这不是什么秘密。例如，根据 Ahrefs Keywords Explorer（关键词分析）关键词 “hreflang tag seo” 在美国每月获得约会获得 10 次搜索。小提示. Semrush也给出了同样的搜索量预估。 但是，由于我们的这个关键词排名在前五位，我们可以通过查看 Google Search Console（GSC）中的曝光次数来获得更准确的数值。如果我们筛选出：美国地区、过去 28 天的数据吗，我们会看到有 20 次曝光。 根据这个数据，我们可以看到这个关键词在此期间的搜索量比 Ahrefs 或 Semrush 预估多 2 倍。这似乎支持了这样一个观点：零流量的关键词可能会得到一些搜索，而且值得进行定位。真的这么简单么？并非如此。大多数零流量的关键词都有一些搜索。但是，期望从一个关键词中获得大量的流量，有点像期望下雨，而天气预报却说是晴天。可能会有，可能也没有。也就是说，我认为大多数倡导零流量关键词的人都意识到了这个事实。他们根本不在乎，因为他们不需要100% 的点击率。他们只需要在他们的目标中占有一定的比例，以超出估计的成绩。在理论上，这是有道理的。但是命中率可能有多高呢？ 为了帮助找到答案，我做了一个（非常）小的实验。我找到了 Ahrefs 博客的所有 “前五名” 的关键词排名，这些关键词在美国的月度搜索量估计为10或更低。我使用 Ahrefs Site Explorer（网站分析）中的 Organic keywords（自然关键词）报告来完成这项工作。我将这些搜索量预估值与 Google Search Console 中过去 28 天在美国的曝光数据进行比较。结果是什么？大部分的关键词带来的曝光与它们在 Ahrefs 中的预估搜索量相同或更少。更糟糕的是，只有不到 1% 的关键词带来了超过 100 次的曝光。这意味着一个低量或零量的关键词得到远超预估的搜索流量的可能性是比较低的。事实上，平均而言，每个关键词只带来了了 11.3 次曝光。 这是一个超级有趣的数字，因为它几乎与这些关键词的平均月搜索量完全一致。换句话说，数据似乎表明，平均而言，低量和零量的关键词得到的月度搜索量与 Ahrefs 预测的数量非常接近。 disclaimer 这些发现是基于相当小的样本量，所以要慎重对待。它们可能不代表每个行业。鉴于这一启示，你可能会问自己，“为什么我一直看到有人声称零流量的关键词能带来大量的流量？” 从我所看到的情况来看，这几乎总是人们将来自单一关键词的流量与页面的整体流量混为一谈的结果。这只是我在 Tory Gray 的这篇优秀文章中看到的一个例子。我不想说得太明确，但我的猜测是，这个人所指的零流量关键词只是一种不受欢迎的搜索流行事物的方式。例如，Ahrefs 估计关键词 “submit domain to search engines” 在美国每月有 10 次搜索，而我们的搜索引擎提交指南每月估计有 3.8 万次搜索访问。发生这种情况是因为 “submit domain to search engines” 是一个不受欢迎的热门话题的搜索方式。只是每个人在谷歌上输入的内容略有不同，所以这个词的搜索量很低。我们的页面获得了大量的搜索流量，因为它在数百个长尾关键词中排名靠前，而这些关键词的含义几乎都是一样的。 key takeaway 大多数低流量和零流量的关键词每月获得的搜索次数与估计的大致相同。只是有一些异常值。许多声称针对零流量关键词的网页获得了大量的流量，这可能是因为该关键词是一个热门话题的长尾变体。“它们更容易获得排名”鉴于大多数 SEO 的目标是高搜索量的关键词，很明显，低量或零量的关键词在整体上的竞争会比较小。例如，根据 Ahrefs Keywords Explorer（关键词分析），关键词 “link building” 在美国每月估计有 1.4 万次搜索。所以它的竞争也非常激烈，关键词难度（KD）得分为 87，这并不奇怪。与一个关于类似主题的零流量关键词 “link building for roofers” 相比，这是一个完全不同的故事。它的 KD得分是0。 鉴于这一观察，似乎很明显，低量和零量的关键词更容易获得排名。真的这么简单么？并非如此。虽然许多低量或零量的关键词确实更容易获得排名，但还有一些其实是搜索热门词的变体。我们之前讨论的关键词 “submit domain to search engines” 就是一个完美的例子。据估计，它每月只有 10次的搜索量，与热门的搜索词相比，它的排名也不容易。之所以发生这种情况，是因为谷歌了解这两个查询的意思是相同的，所以它对这两个查询的搜索结果进行了几乎相同的排名。在 Ahrefs 中，有几个指标可以用来帮助弄清一个零流量的关键词是它自己的主题还是一个流行关键词的长尾变体。Keyword Difficulty（关键词难度）—— KD 分数高的关键词排名靠前的网页有很多反向链接。一个 KD 分数低的零流量关键词很可能代表了它自己的主题。Traffic Potential（流量潜力）得分——流量潜力是对一个关键词当前排名靠前的页面的估算每月搜索流量。如果这比一个关键词的预估搜索量要高得多，就表明有其他更热门搜索词来搜索同一事物。这里有一个 Traffic Potential（流量潜力）的例子。key takeaway 并非所有零流量的关键词都容易获得排名。如果它们只是一个不热门的变体搜索词，那么它们可能并不比其 “头部” 术语更容易获得排名。“它们更容易为之创造内容”大多数高搜索量的关键词都相当广泛，这使得围绕它们创建的内容很难取悦所有的搜索者。 例如，以关键词 “ecommerce SEO” 为例。从 SERP 来看，这个关键词背后的广泛意图似乎很明显：搜索者想要一个指南，教他们如何为自己的商店获得更多的流量。但不幸的是，我们很难给出适用于所有搜索者的 SEO 建议，因为用户并没有告诉我们关于他们情况的足够信息。有太多的变数，比如说：他们正在建立自己的商店，还是已经上线？他们是销售品牌产品还是非品牌产品？他们是使用 Shopify、WooCommerce，还是其他什么？将其与一个类似主题的零流量关键词进行比较，如 “how to structure an ecommerce site for SEO”。在这里，用户正试图实现一个更具体的目标，这使得这个（和其他低容量的关键词）更容易用内容来回答。真的这么简单么？算是吧。假设零流量的关键词代表了它自己的主题，而不是某个热门搜索的变体，我想说它几乎总是相当具体的，而且更容易围绕它创建内容。 也就是说，具体性并不完全是低量或零量关键词的独有的。也有很多热门关键词具有非常具体和明显的目的；它们只是不太常见。 例如，以关键词 “submit website to search engines” 为例。尽管每月的搜索量为 450 次，但从 SERP 和搜索词本身来看，搜索者想了解如何向搜索引擎提交他们的网站，这是相当明显的。 鉴于向搜索引擎提交的过程对每个网站都是一样的，因此很容易创造出能取悦用户的内容。重点 大多数能代表自己主题的零量关键词都相当具体，而且很容易围绕它们创建内容。但是，一些热门搜索的关键词也是如此。“它们转化更好”为更具体的搜索词创建内容不仅更容易，而且它们的转化率也往往更高。例如，以 “broken link building” 这样一个关键词为例。尽管这不是一个流量特别大的关键词，但从 SERP 中可以清楚地看到，其意图是信息性的。大多数搜索者想了解如何使用这种技术，而不是购买失效链接建设服务。将其与 “buy broken link building services” 这样一个关于同一主题的零量关键词相比较，情况就不一样了。搜索者显然是在寻找购买，而不是学习。真的这么简单么？并非如此。虽然低量和零量的关键词也许更有可能成为漏斗底部的词，但这并不是一个必然。大量的零量关键词并非高转化词。 例如，以零成交量的关键词 “how to copy a picture on facebook without tagging” 为例。即使实际搜索量比估计的要高得多，你也很难从这个关键词中推动转换。key takeaway 并非所有低量和零量的关键词都能很好地转化。这取决于它们背后的意图。最后当有你有很多搜索量不错的关键词可以定位时，选择定位 “零流量关键词” 并没有什么意义。 然而，某些时候，针对一个零流量的关键词可能是有意义的。你遇到了一个你认为有潜力的趋势性话题 — 即使还没有搜索量数据，通常也值得创建一个页面来先入为主。你遇到了一个有利可图的话题，并有可能转换用户 — 即使是来自这些关键词的几个访问量也可值$$$$，所以为什么不围绕它创建一个页面，看看会发生什么？ 有问题吗？在 Twitter 上找我吧。译者，Park Cheng，歪猫出海创始人。 Get the week's best marketing content Email Subscription Subscribe Leave this field empty if you're human: 文章作者 Joshua Hardwick Ahrefs内容营销总监。他负责确保我们发布的每篇文章都是神作。",
  "headers": [
    {
      "level": "H1",
      "text": "你是否应该定位零流量的关键词？视情况来定"
    },
    {
      "level": "H2",
      "text": "“它们可能会得到一些搜索流量”"
    },
    {
      "level": "H3",
      "text": "真的这么简单么？"
    },
    {
      "level": "H2",
      "text": "“它们更容易获得排名”"
    },
    {
      "level": "H3",
      "text": "真的这么简单么？"
    },
    {
      "level": "H2",
      "text": "“它们更容易为之创造内容”"
    },
    {
      "level": "H3",
      "text": "真的这么简单么？"
    },
    {
      "level": "H2",
      "text": "“它们转化更好”"
    },
    {
      "level": "H3",
      "text": "真的这么简单么？"
    },
    {
      "level": "H2",
      "text": "最后"
    }
  ],
  "author": "Joshua Hardwick"
}