{
  "url": "https://moz.com/blog/category/marketing-psychology/p2",
  "slug": "p2",
  "title": "Marketing Psychology - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Tazmin Suleman August 3, 2022 Optimization Tips for Your SEO Career (and Your Life) Marketing Psychology Co-host of The SEO Mindset Podcast, Tazmin Suleman, shares the process she went through that took her from self-doubt to empowerment, along with some actionable tips to help change your mind about what you can achieve. Read this post By: Christopher Hofman Laursen April 20, 2022 How to Win Potential Consumers with Customer Journey Mapping on Google SEO Analytics | Search Engines | Marketing Psychology If your website is like most others, there is likely a mismatch between the content you provide, and what your prospective customers search for on Google. This article is about understanding those potential customers and their conversation with Google by using the customer journey mapping method to provide them with the best content. Read this post By: Nadya Khoja March 29, 2021 6 Ways to Bring Empathy Into Your Marketing Strategy (in 2021 and Beyond) Marketing Industry | Marketing Psychology The world has changed and businesses need to adapt to the new needs of their customers if they're going to grow. The best way to do that is through empathy, but how do you take an empathetic approach to marketing? Read this post By: Mordy Oberstein March 10, 2021 What I Found After Experimenting with Google Discover for Two Months Search Engines | Marketing Psychology Mordy spent the better part of two months running all sorts of queries in all sorts of different ways to see how it impacted his Google Discover Feed. Here are the results. Read this post By: Stewart Fussell February 25, 2021 The Potential Impact of Gen Z on SEO Marketing Industry | Marketing Psychology Gen Z (or Zoomers, if you prefer) already makes up the largest generational cohort of America's population. How do they interact with search, and what does that mean for the future of SEO? Read this post By: Megan Morreale November 17, 2020 The New Best Practices for Native Advertising on Editorial Sites Online Advertising | Marketing Psychology | Marketing Industry How and when we interact with ads online drastically changed in March when COVID-19 ushered in a new era of rolling global lockdowns, not to mention lifestyle changes that none of us could predict. People started interacting with content from different devices, at different times, and reacting to different types of campaign creatives. All of this resulted in a new set of best practices for marketers to follow when it comes to running effective native ads. Read this post By: Lily Ray April 22, 2019 We Surveyed 1,400 Searchers About Google - Here's What We Learned Search Engines | Marketing Psychology | Marketing Industry We surveyed 1,400 respondents to better understand how they search. Here's what we learned. Read this post By: John Doherty September 20, 2016 Should You Implement That New Google Feature? Marketing Psychology | Search Engines | SEO Consulting Not sure if you should implement the newest feature that shows up in the SERPs? Confused about how to sell things internally to your boss? From my years of experience in digital marketing, this is the grid I use to think through the opportunity cost or advantage of implementing something new. Read this post By: Stephanie Kable August 11, 2016 Here’s How a Pricing Tweak Enabled Us to Increase Sales Marketing Psychology When attempting to optimize your site for conversions, price tweaks are but one element that must be considered. Read this post By: Rand Fishkin May 27, 2016 How to Research the Path to Customer Purchase Whiteboard Friday | Marketing Psychology Moving your customers down the funnel from awareness to conversion can make for a winding and treacherous road. Until you fully research and understand the buying process inside and out, it's far too easy to make a misstep. In today's Whiteboard Friday, Rand takes a high-level look at the path to customer purchase, recommending workflows and tools to help you forge your own way. Read this post By: Rand Fishkin April 12, 2016 Great Content ≠ Long-Form Content Content Marketing | Marketing Psychology | SEO Copywriting \"Great\" content and long-form content are not the same thing. In this post, Rand explains the difference, the reasons for the correlations, and an alternative path to making content that accomplishes your goals and those of your audience. Read this post By: Bridget Randolph February 15, 2016 Identity, Affinity, and Personalization: What Marketers Can Learn From Tinder Marketing Psychology Take some marketing lessons from the world of modern dating, and learn about what Tinder can teach us about sales in this Valentine's Day post. What does the modern singleton’s approach to online dating tell us about their shopping behavior? And what should we be doing about it? The answer can be found in a look at social and technological history and the concept of an individual with a sense of personal identity. Read this post By: Matt Round February 1, 2016 What's it Take to \"Go Viral?\" 11 Traits to Give Your Idea Wings Marketing Psychology | Content Marketing | Social Media Online word-of-mouth can drive exponential traffic growth, attract broad media coverage, and result in tons of backlinks and social shares. Matt Round describes the 11 key traits you should include when devising interactive content that taps into the impulse to share things on Facebook and Twitter. Read this post By: Eric Enge December 3, 2015 Why You Must Become a 10x Brand Advanced SEO | Marketing Psychology | Branding Just being a \"better\" brand than your competitors is no longer good enough. This post outlines what it takes to be a 10x brand and why it's critical for the future of your business. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Marketing Psychology"
    },
    {
      "level": "H2",
      "text": "Optimization Tips for Your SEO Career (and Your Life)"
    },
    {
      "level": "H2",
      "text": "How to Win Potential Consumers with Customer Journey Mapping on Google"
    },
    {
      "level": "H2",
      "text": "6 Ways to Bring Empathy Into Your Marketing Strategy (in 2021 and Beyond)"
    },
    {
      "level": "H2",
      "text": "What I Found After Experimenting with Google Discover for Two Months"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "The Potential Impact of Gen Z on SEO"
    },
    {
      "level": "H2",
      "text": "The New Best Practices for Native Advertising on Editorial Sites"
    },
    {
      "level": "H2",
      "text": "We Surveyed 1,400 Searchers About Google - Here's What We Learned"
    },
    {
      "level": "H2",
      "text": "Should You Implement That New Google Feature?"
    },
    {
      "level": "H2",
      "text": "Here’s How a Pricing Tweak Enabled Us to Increase Sales"
    },
    {
      "level": "H2",
      "text": "How to Research the Path to Customer Purchase"
    },
    {
      "level": "H2",
      "text": "Great Content ≠ Long-Form Content"
    },
    {
      "level": "H2",
      "text": "Identity, Affinity, and Personalization: What Marketers Can Learn From Tinder"
    },
    {
      "level": "H2",
      "text": "What's it Take to \"Go Viral?\" 11 Traits to Give Your Idea Wings"
    },
    {
      "level": "H2",
      "text": "Why You Must Become a 10x Brand"
    }
  ],
  "author": "Tazmin Suleman\n          \n            Christopher Hofman Laursen\n          \n            Nadya Khoja\n          \n            Mordy Oberstein\n          \n            Stewart Fussell\n          \n            Megan Morreale\n          \n            Lily Ray\n          \n            John Doherty\n          \n            Stephanie Kable\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Bridget Randolph\n          \n            Matt Round\n          \n            Eric Enge"
}