{
  "url": "https://moz.com/blog/category/seo-events/p16",
  "slug": "p16",
  "title": "SEO Events - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Jennifer Sable Lopez August 13, 2009 Best Thing About Search Conferences SEO Events Every search conference is usually filled with sessions, keynotes, site reviews, clinics, etc. If you're not at the conference you can usually follow the blogs and Twitter to get your daily dose of conference fare. These help keep you up-to-date on the sessions and general goings on. Read this post By: Jennifer Sable Lopez August 12, 2009 SES San Jose Day 2 - Overheard on Twitter SEO Events The second day of SES San Jose is wrapping up, so it must be time for the Twitter roundup! There were a number of debates, someone was found sleeping in the first row drooling and another person claimed that most people at the session were probably already following him on Twitter. Read this post By: Jennifer Sable Lopez August 11, 2009 SES San Jose Day 1 - Overheard on Twitter SEO Events This week I'm at SES San Jose covering the conference for SEOmoz. I'm a one woman show so I'm putting my multi-tasking skills to the test! Obviously I can't make it to every session, or cover every track. Plus there are many others live blogging the event. So, how can I make sure the SEOmoz community gains as much information as possible from this conference? Reuse other people's content, that's h... Read this post By: Sam Niccolls August 6, 2009 This Week in Search for 8/6/09 SEO Events 'This week in search' is a compilation of some of the most interesting, newsworthy, and useful stories in and around the world of search over the last 1-2 weeks. Read this post By: Jennifer Sable Lopez June 24, 2009 Summer 2009 Online Marketing and Search Conferences SEO Events Is it just me, or is it getting on hot in here? Well it IS summer time again, and this year there are some interesting (both national and global) summer online marketing conferences happening. Some of the mozzers will be attending and/or speaking and I thought this was a great time to let everyone know where we'll be, and in some cases, where we'd like to be! Online Marketing Su... Read this post By: David Carralon June 22, 2009 SMX Madrid 2009 Recap SEO Events If SES and SMX London have been two key players of my SEO education this year, then SMX Madrid has definitely topped up my SEO Spanish terminology. This may sound strange coming from a Spaniard, but after I have lived abroad... Read this post By: Jennifer Sable Lopez June 16, 2009 Jane and Robot Search Developer Summit SEO Events Last Friday I attended and spoke at the Jane and Robot Search Developer Summit in San Francisco. The idea of the conference was to cover technical SEO topics and help train developers and others. The 100 attendees (or so) were a mixed bunch; developers, SEOs, managers and the like. The sessions covered site archit... Read this post By: Rebecca Kelley June 10, 2009 IMC Stockholm, Swedish Meatballs and New Friends SEO Events A couple weeks ago I went to Sweden to speak at IMC Stockholm. I had a really lovely time exploring the beautiful city as well as speaking at IMC and networking with marketers from all over the world. I thought I'd provide a recap of my trip and share some conference coverage with all of you who didn't attend the conference but are curious as to what it entailed. Enjoy! Pre-... Read this post By: Rebecca Kelley June 9, 2009 SEOmoz Best of May 2009 SEO Events Happy June, evvabody! Here's what happened last month in case you were bedridden with swine flu: Best Blog Posts in May 2009 If I Could Go Back In Time & Give Myself Some Advice, This Would Be It. If Rand could turn back tiiiiiime...... Read this post S By: StatMatt June 1, 2009 Getting Value from Search Conferences SEO Events I've just got back from SMX London (when I say \"just\" I'm obviously referring to the Hangover, as I've been back multiple days), and It's probably the best event I've been to for all around value and enjoyment. Having to been to several conferences (Including 3 SES events) over the years though, I've come to the conclusion that, unless you are networking for clients, these events are not easy to justify the expenditure they incur. The problem most people in the intermediate-advanced tier face is hearing only what we know already; I spend a lot of these sessions sucking eggs now. Read this post By: Rebecca Kelley May 15, 2009 Weekend Roundup for the Week of 5/10/09 SEO Events Stories, news, and other notable items from the past week: Google crashed between 8:40 and 9:55 ET yesterday, preventing people from Googling to find out why Google wasn't working. Oh noes! Speaking of Google, they recently overhauled Google News as well as updated their blog search algorithm, and they're allowing trademarks to be used in US Adwords copy. Geez, no wonder there was downtime. Methinks Google needs a little R&R. Read this post By: Rebecca Kelley May 13, 2009 Upcoming Spring 2009 Search Conferences SEO Events The weather's getting nicer, the days are getting longer and Rand's barely in the office. You know what that means: it's conference season! Since there are so many conferences right around the corner, I thought I'd list some upcoming events in case you're thinking of attending a show but aren't sure which one to book. SMX London in London, UK: May 18-19, 2009... Read this post By: Rebecca Kelley May 7, 2009 Roundup Thursday for the Week of 5/3/09 SEO Events Stories, news, and other notable items from the past week: Compete has rolled out a bunch of changes, adding user generated tags, a new interface, dynamic graphs, and more. Pete Meyers has hired a new intern, Yoozer, and he's here to answer your toughest questions about usability. Read this post By: Rebecca Kelley May 6, 2009 SEOmoz Best of April 2009 SEO Events At the beginning of every month I'll be highlighting the best content from the previous month. I'll still be doing the weekly roundups (I owe you guys a big one tomorrow), but here's a monthly recap of the best blogs, YOUmoz entries, tools and more. Best Blog Posts in April 2009 Fear and Forg... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO Events"
    },
    {
      "level": "H2",
      "text": "Best Thing About Search Conferences"
    },
    {
      "level": "H2",
      "text": "SES San Jose Day 2 - Overheard on Twitter"
    },
    {
      "level": "H2",
      "text": "SES San Jose Day 1 - Overheard on Twitter"
    },
    {
      "level": "H2",
      "text": "This Week in Search for 8/6/09"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Summer 2009 Online Marketing and Search Conferences"
    },
    {
      "level": "H2",
      "text": "SMX Madrid 2009 Recap"
    },
    {
      "level": "H2",
      "text": "Jane and Robot Search Developer Summit"
    },
    {
      "level": "H2",
      "text": "IMC Stockholm, Swedish Meatballs and New Friends"
    },
    {
      "level": "H2",
      "text": "SEOmoz Best of May 2009"
    },
    {
      "level": "H2",
      "text": "Getting Value from Search Conferences"
    },
    {
      "level": "H2",
      "text": "Weekend Roundup for the Week of 5/10/09"
    },
    {
      "level": "H2",
      "text": "Upcoming Spring 2009 Search Conferences"
    },
    {
      "level": "H2",
      "text": "Roundup Thursday for the Week of 5/3/09"
    },
    {
      "level": "H2",
      "text": "SEOmoz Best of April 2009"
    }
  ],
  "author": "Jennifer Sable Lopez\n          \n            Jennifer Sable Lopez\n          \n            Jennifer Sable Lopez\n          \n            Sam Niccolls\n          \n            Jennifer Sable Lopez\n          \n            David Carralon\n          \n            Jennifer Sable Lopez\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            StatMatt\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley"
}