{
  "url": "https://moz.com/blog/category/seo-events/p25",
  "slug": "p25",
  "title": "SEO Events - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Rand Fishkin August 21, 2007 The Paid Links Debate Rages On - SES San Jose 2007 SEO Events In our continuing series of coverage, I'm pleased to present one of the most talked-about, anticipated and dramatic sessions of the SES San Jose conference so far (though I heard that the session on click fraud was also extremely contentious). For the past 2-3 years, Google (along with Yahoo! and MSN/Live) have hounded the micro-economy of paid link advertising and paid link networks at... Read this post By: Rand Fishkin August 20, 2007 Getting Traffic from Contextual Ads - SES San Jose SEO Events I'm taking a new approach with events and attempting to do more in-depth coverage of a couple of what I feel are the best, most interesting, most innovative or least discussed sessions at the conference. Since contextual advertising is an area where I have little to no experience, I found the panel fascinating - and certainly Microsoft's announcement of a contextual ad product on the Microsoft ... Read this post By: Rand Fishkin August 17, 2007 50 Things I Love About Search Conferences SEO Events To help keep the balance, I'll shine some light on some of my favorite things about search conferences: Presenting - It's exciting to be on stage, sharing ideas and being a thought leader. There's an undeniable allure to it, and while I take it as a serious responsibility, I admit that I have a real passion for it, too. Meeting New Peopl... Read this post By: Gillian Muessig August 15, 2007 Where to Park Your Bumbershoot In Seattle in October SEO - Training Seminar Travel Info SEO Events Hotel and transportation info for SEO Training Seminar Oct. 1... Read this post By: Rand Fishkin August 15, 2007 12 Tips to Optimize Your Networking at Search Conferences SEO Events With the industry's largest annual event starting next Monday, I figured it's high time to give out some advice about networking in person at search conferences like SES San Jose. I've been trying to limit my list format posts, but there's really no better way to present the topics, so here goes: Dress Appropriately Make Eye Contact Employ Appropri... Read this post By: Rand Fishkin July 31, 2007 Danger, Excitement, Romance - Coming Soon to an Auditorium near SEOmoz SEO Events Cue suspenseful music... Her heart nearly jumped a beat as he leapt onto the stage, his eyes dancing across the room, crying out for silence and attention. As she watched, a small device moved from his right hand to his left and then, without warning, it began... With the deftness of an acrobat and the cadence of a poet, he swept her awa... Read this post By: Rebecca Kelley July 30, 2007 SES Travel: a Nice Little Getaway SEO Events Last week I had the opportunity to speak on two panels at SES Travel, which was held in downtown Seattle. The conference was small (about 150-200 people) and focused entirely on SEO tips for working in the travel industry. There were representatives from Orbitz, Farecast, Kayak, FareCompare, Expedia, and lots of other travel-centric sites. The first session I spoke on was Travel Wri... Read this post B By: BlueAcorn July 29, 2007 One Reason You Shouldn't Go to the SEOmoz Premium Training Seminar SEO Events I'm tired of reading all these posts explaining the top 10 ways to do this, 21 tips for success at that. That writing style is getting overused and quickly becoming the blogging format staple. It's like that song you hear on the radio every 30 minutes that you just can't get away from. So for my first ever YOUmoz entry, instead of telling you the top 10 reasons ... Read this post By: Rand Fishkin July 26, 2007 Visiting Google, Yahoo!, Yelp & More SEO Events Warning - this post is somewhat personal with a little bit of search thrown in. If you're not into travelogues, my apologies. We'll return to our regularly scheduled business-of-search blogging tomorrow. On Sunday, July 22nd, Mystery Guest accompanied on me a 3-day, jam-packed trip to the Bay Area. The trip included visits wi... Read this post By: Rebecca Kelley July 25, 2007 I Got Naked With Michael Arrington... SEO Events ...and John Cook from the Seattle Post-Intelligencer, Tricia Duryee from the Seattle Times, Fred Vogelstein from Wired Magazine, and Becky Buckman from the Wall Street Journal. Quite the title and intro, huh? Let me... Read this post By: Rebecca Kelley July 16, 2007 Monday Odds and Ends SEO Events And now, a little roundup of stories from the past few days that have either been brought to my attention or that I came across and thought were interesting: Agustín Vazquez-Levi (whose Canalytics team recently became the 12th company in North America [and the first company in Canada] to be accepted as one of Google's Goog... Read this post By: Rand Fishkin June 26, 2007 Summer Lull? What Summer Lull? The Search World is Hotter than Ever. SEO Events There's so much happening in the world of search, it's hard to stay abreast of even half of it. However, it's my responsibility to keep those of you who aren't taking the time to read SEL in the know. Threadwatc... Read this post By: Rebecca Kelley June 24, 2007 The SMX Advanced Recap is Chock Full of Nostalgia SEO Events Hey, remember SMX Advanced in Seattle? Think back to a couple weeks ago. Danny Sullivan threw a conference in the Emerald City, some SEOs attended, it was a huge success...any of this ringing a bell to you? Well, if two certain slacker SEOs didn't have 8,000 simultaneous tasks to work on and actually published this article right after the conference ended, you'd be more excited about reading it. O... Read this post Y By: Yoshirolla-Kilomantr June 15, 2007 What I learned at Toronto SES 2007 SEO Events The landscape of search is changing again. As Google universal and similar algorithms are being utilized text based information will hold less and less sway. Podcasts and videos will come into play, as will personalization.The techniques that worked in the past do not work today, and may get you penalized tomorrow. Recipro... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO Events"
    },
    {
      "level": "H2",
      "text": "The Paid Links Debate Rages On - SES San Jose 2007"
    },
    {
      "level": "H2",
      "text": "Getting Traffic from Contextual Ads - SES San Jose"
    },
    {
      "level": "H2",
      "text": "50 Things I Love About Search Conferences"
    },
    {
      "level": "H2",
      "text": "Where to Park Your Bumbershoot In Seattle in October SEO - Training Seminar Travel Info"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "12 Tips to Optimize Your Networking at Search Conferences"
    },
    {
      "level": "H2",
      "text": "Danger, Excitement, Romance - Coming Soon to an Auditorium near SEOmoz"
    },
    {
      "level": "H2",
      "text": "SES Travel: a Nice Little Getaway"
    },
    {
      "level": "H2",
      "text": "One Reason You Shouldn't Go to the SEOmoz Premium Training Seminar"
    },
    {
      "level": "H2",
      "text": "Visiting Google, Yahoo!, Yelp & More"
    },
    {
      "level": "H2",
      "text": "I Got Naked With Michael Arrington..."
    },
    {
      "level": "H2",
      "text": "Monday Odds and Ends"
    },
    {
      "level": "H2",
      "text": "Summer Lull? What Summer Lull? The Search World is Hotter than Ever."
    },
    {
      "level": "H2",
      "text": "The SMX Advanced Recap is Chock Full of Nostalgia"
    },
    {
      "level": "H2",
      "text": "What I learned at Toronto SES 2007"
    }
  ],
  "author": "Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Gillian Muessig\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rebecca Kelley\n          \n            BlueAcorn\n          \n            Rand Fishkin\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rand Fishkin\n          \n            Rebecca Kelley\n          \n            Yoshirolla-Kilomantr"
}