{
  "url": "https://moz.com/blog/category/seo-events/p26",
  "slug": "p26",
  "title": "SEO Events - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Rebecca Kelley June 15, 2007 SES Toronto and the Canadian Search Landscape SEO Events After SMX, training Frenchies, SES Toronto, and getting sick, I'm back in the office attempting to tackle a mountain of tasks (I've never empathized with Rand more than I do right now). Jane and I will soon publish the so-late-it's-just-ridiculous coverage of SM, but for now I want to talk about SES Toronto and the Canadian Search Landscape session. This session was pretty rife with... Read this post K By: Katie Leas June 12, 2007 Danny Sullivan Popped My Cherry (and I Helped Him Pop His) SEO Events It all began with a judgmental cabbie and a striptease. To be fair, I'm not really from Kansas like I told that cabbie. [I was born there, I live and work about 3 minutes from the state line, but really, it was just easier to tell people I was from Kansas because most people don't know that most of Kansas City is in Missouri. Plus, I was trying to emphasize the flatness--Kansas is way... Read this post C By: Ciaran Norris June 7, 2007 Has SMX Advanced Damaged Brand Danny? SEO Events This post will be short, and depending on the feedback it generates, so too could be my career in SEO. I mean seriously, questioning Danny Sullivan? The guy who has been around longer than Google? And is better liked too? It must be the jet-lag stopping me from thinking straight. Anyway..With his first show since splitting from SES and the company he sold it too, Incisive Media, Danny pr... Read this post By: Jane Copland June 4, 2007 Live from SMX Seattle SEO Events I've been sitting next to Lisa from Bruce Clay for too long, as I've now finally given in to the temptation to blog live from a session at a conference. I've never wanted to do this before, as I like to spend a long time composing my articles and blog entries (whether it shows or not...) and there's not much time for reflection when you're in the front row of the Personalized Search session.... Read this post By: Rebecca Kelley June 1, 2007 SMX Seattle and then SES Toronto SEO Events Danny Sullivan's long-awaited and much anticipated Search Marketing Expo conference kicks off next week with SMX Advanced in Seattle. Matt, Scott, Jeff, and Gillian all have Expo Passes, while Jane and I will be covering the conference for our blog and Rand will be speaking on the \"SEO, Meet SMM\" panel w... Read this post S By: semscholar May 29, 2007 Search Engine Strategies - Xiamen China SEO Events Search Engine Strategies China was held in the beautiful resort town of Xiamen on May 24 - 25. KEYNOTEYvonne Chang, China Yahoo and Alibaba Vice President, was interviewed by Chris Sherman and Inway Ni for the Keynote address. Mr. Ni asked Ms. Chang to search for her name on Yahoo and she noted his blog was ranked... Read this post By: Rand Fishkin May 26, 2007 Presentations from SES Xiamen SEO Events As promised, I'm putting up my presentations from SES Xiamen 2007. There's so much to share about China that it's nearly impossible to put it into a blog post and thus, when I return home, I'll be writing a full article on SEOmoz about my experiences, the Chinese search market and what I ate (abalone, shark fin soup, camel, turtle, duck tongue, scorpions, starfish, jellyfish and many more).... Read this post By: Rand Fishkin May 21, 2007 A Tiny Little Peek Into China SEO Events After 5 days in China, I'm completely unqualified to give any advice on the country, tourism, travel or search marketing, but I think that despite that, it's still worthwhile to give my early impressions. Bullet points are a must, given the average of 5-6 hours a night of sleep, numerous blisters and a dead-tired roommate :) China is accessible - before coming to China, I had... Read this post By: Rebecca Kelley May 17, 2007 Roundup Thursday is Good for What Ails Ya SEO Events And now, to finish off your Thursday, here's a roundup of various news tidbits that I found interesting: Scoreboard Media Group has an encouraging post called \"If At First You Don't Succeed, Quit!\" Though it's rife with baseball metaphors, Brian Provost makes a fantastic point--that some... Read this post By: Rebecca Kelley May 4, 2007 Rebecca's Rad Friday Roundup SEO Events Time to wham bam you all with a little roundup post of odds, ends, and miscellaneous news. First off, Jane and I are \"guestwhoring\" next Wednesday (5/9/07) on Sugarrae's blog while she's getting drunk and lifting up men's kilts in Scotland. At this point, I don't think either one of ... Read this post By: Rand Fishkin April 25, 2007 SMX Seattle - Addressing Clicks, Cliques & Clicktastrophes SEO Events This morning I spent a half hour interviewing Danny Sullivan about the upcoming Search Marketing Expo in Seattle on June 4 and 5. We hashed through quite a bit of material and I learned a great deal about what the goals of the conference will be, who the target audience is and why there are so many changes from his successful SES conf... Read this post By: Rand Fishkin April 20, 2007 Stay In and Read this Weekend; There's a Ton of Great Stuff SEO Events There's so much to cover in the search world this week it's practically unbearable. Hopefully the weather is terrible and you're bored so this won't interfere too much with those pesky weekend plans. I'm personally going hiking Sunday - my first time this year (hooray!). On to the topics: ... Read this post By: Simon Heseltine April 19, 2007 Spread the Education SEO Events So you just spent the week at the latest conference. You consumed large quantities of free alcohol, <a href=\"http://www.seomoz.org/blog/my-dont-fire-me-rand-recap-of-ses-new-york\">networked with lots of friendly SEO's</a>, got a suitcase full of freebies, and heck, you even picked up some nice tips and tricks. The conference has put a fire inside you, you can&... Read this post By: Jane Copland April 16, 2007 My First SES - Recap Number Two SEO Events It's just so much fun to get up at 4:30am in order to get to the airport, and it's even better when an oversized limousine backs into your brand new Jeep outside Departures. What a wonderful start to my first SES conference! Luckily, no one was in our car when the dip-stick driver threw his massive car into reverse and busted up our bumper, so our insurance won't suffer. ... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "SEO Events"
    },
    {
      "level": "H2",
      "text": "SES Toronto and the Canadian Search Landscape"
    },
    {
      "level": "H2",
      "text": "Danny Sullivan Popped My Cherry (and I Helped Him Pop His)"
    },
    {
      "level": "H2",
      "text": "Has SMX Advanced Damaged Brand Danny?"
    },
    {
      "level": "H2",
      "text": "Live from SMX Seattle"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "SMX Seattle and then SES Toronto"
    },
    {
      "level": "H2",
      "text": "Search Engine Strategies - Xiamen China"
    },
    {
      "level": "H2",
      "text": "Presentations from SES Xiamen"
    },
    {
      "level": "H2",
      "text": "A Tiny Little Peek Into China"
    },
    {
      "level": "H2",
      "text": "Roundup Thursday is Good for What Ails Ya"
    },
    {
      "level": "H2",
      "text": "Rebecca's Rad Friday Roundup"
    },
    {
      "level": "H2",
      "text": "SMX Seattle - Addressing Clicks, Cliques & Clicktastrophes"
    },
    {
      "level": "H2",
      "text": "Stay In and Read this Weekend; There's a Ton of Great Stuff"
    },
    {
      "level": "H2",
      "text": "Spread the Education"
    },
    {
      "level": "H2",
      "text": "My First SES - Recap Number Two"
    }
  ],
  "author": "Rebecca Kelley\n          \n            Katie Leas\n          \n            Ciaran Norris\n          \n            Jane Copland\n          \n            Rebecca Kelley\n          \n            semscholar\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rebecca Kelley\n          \n            Rebecca Kelley\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Simon Heseltine\n          \n            Jane Copland"
}