{
  "url": "https://www.similarweb.com/blog/marketing/advertising/display-holiday-tips/",
  "slug": "display-holiday-tips",
  "title": "5 Display Holiday Optimization Tips | Similarweb",
  "description": "Relying on your display ads to make this holiday season jolly? Get steps for measuring impact and tips for converting ads to presents under the tree in no time.",
  "content": "HomeBlogMarketingAd Intelligence5 Steps to Drive Massive Holiday Traffic for Retail With Display Ads [Case Study Inside] Marketing Intelligence 5 Steps to Drive Massive Holiday Traffic for Retail With Display Ads [Case Study Inside] Download the report by Chelsea Feil , Marketing Intelligence Specialist 4 Min. November 2, 2021 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Last year, Urban Outfitters absolutely sleighed the 2020 holiday session with its display ads. The lifestyle label has been cozying up homes and selling trendy clothes since the 70’s. The holiday sales in particular never disappoint, which is especially helpful when your main customers are living on a student budget and looking for a holiday steal. To get you in the holiday spirit, we’ll show you exactly how urbanoutfitters.com drove demand and give you step-by-step advice on how to optimize your own display campaigns in real-time this season. Let it show – display ad goals to go after With Similarweb Competitive Analysis, we can see that urbanoutfitters.com increased its display ad traffic by over 100,000, accounting for a 26.7% increase between November and December 2020. Clearly, there’s merit to maximizing your strongest channel while maintaining the rest during the holiday season. Some questions you might want to keep in mind as we continue to look at the success of urbanoutfitters.com in the display space: How did the brand’s display strategy change the end of year push? Where did it focus its publishing efforts? What specific ads did it run that resulted in such merry movement? Increase present purchases with more publisher partnerships Numbers never lie. In November 2020, urbanoutfitters.com partnered with 142 publishers to promote its display ads. In December 2020, it added 100 more into the mix, resulting in 100,064 more display ad visits, more traffic, and ultimately, more presents to be unwrapped. When we look more granularly at where the traffic comes from, it can be attributed to publications like thespruce.com, which increased 119.2% in incoming traffic to urbanoutfitters.com from November to December 2020. The brand also diversified its display ads, focusing on news, media, and home improvement in November before switching gears to add more fashion and apparel and home and garden in December. Urbanoutfitters.com sells clothes, home decor, lifestyle, and beauty accessories, so it’s very likely its strategy here was to expand into these categories to target current and potential customers with some spicy holiday content. Knock their stockings off with warm display messaging When it came to visuals, the brand opted for a message as warm and cozy as a cup of hot cocoa, “You are Gifted,” to pull at the holiday heartstrings of consumers from Dec. 13 to Dec. 23, 2020. Here we can see Urbanoutfitters.com carefully crafted a “You are Gifted” message as promotional content during Hanukkah and leading up to Christmas. These ads must have hit home with consumers, as there was over 100,000 MoM traffic increase in December. Set high goals with key takeaways to ice out the competition Now for the real gift: insights you can use to run your successful optimization efforts during the 2021 holiday season. Identify your target audience and pick publishers with the same/similar following Increase the number of publishers you work with during your promotional period to get the biggest gain in traffic Spread your message wide and far with publishers in different industries that match your product offering Create display ads that spread holiday cheer so people can relate to your messaging Find inspiration, see what your competitors are up to, and track and measure your efforts with Similarweb data to optimize like the best in business Follow these steps and get bonus affiliate and PPC holiday insights, sync your optimization efforts, and of course, have yourself happy holidays. Top Display Networks and Publishers by Industry Report Get the benchmarks you need to get your strategy on track Download now by Chelsea Feil Marketing Intelligence Specialist Chelsea, a storyteller and data enthusiast, graduated with a B.A. in Media and Communications. She enjoys sunsets, beach frisbee, yoga, and exploring new places. Related Topics: Ad Intelligence This post is subject to Similarweb legal notices and disclaimers. Related Posts Marketing Intelligence Digital Marketing Strategy: A Beginner’s Guide Ad Intelligence Content Marketing by Leah Messenger 7 Min. Mar 26, 2024 Marketing Intelligence How to Write Ad Copy (That Actually Converts): 10 Top Tips Ad Intelligence SEM & PPC by Leah Messenger 9 Min. Feb 28, 2024 Marketing Intelligence How to Check Website Traffic: Analyzing the Digital Data Ad Intelligence Affiliate Marketing by Limor Barenholtz 14 Min. Jan 17, 2024 Marketing Intelligence Mind The Gap: A Complete Guide to Traffic Gap Analysis (+ Checklist) Ad Intelligence Affiliate Marketing by Monique Ellis 15 Min. Oct 27, 2023 Marketing Intelligence What is Programmatic Advertising? Definitions and Explanations Ad Intelligence by Ruth Trucks 9 Min. Aug 23, 2022 Marketing Intelligence The Similarweb Marketing Digest: July 2022 Ad Intelligence Affiliate Marketing by Chloe Dougherty 2 Min. Jul 31, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "5 Steps to Drive Massive Holiday Traffic for Retail With Display Ads [Case Study Inside]"
    },
    {
      "level": "H2",
      "text": "Let it show – display ad goals to go after"
    },
    {
      "level": "H2",
      "text": "Increase present purchases with more publisher partnerships"
    },
    {
      "level": "H2",
      "text": "Knock their stockings off with warm display messaging"
    },
    {
      "level": "H2",
      "text": "Set high goals with key takeaways to ice out the competition"
    },
    {
      "level": "H3",
      "text": "Digital Marketing Strategy: A Beginner’s Guide"
    },
    {
      "level": "H3",
      "text": "How to Write Ad Copy (That Actually Converts): 10 Top Tips"
    },
    {
      "level": "H3",
      "text": "How to Check Website Traffic: Analyzing the Digital Data"
    },
    {
      "level": "H3",
      "text": "Mind The Gap: A Complete Guide to Traffic Gap Analysis (+ Checklist)"
    },
    {
      "level": "H3",
      "text": "What is Programmatic Advertising? Definitions and Explanations"
    },
    {
      "level": "H3",
      "text": "The Similarweb Marketing Digest: July 2022"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Chelsea Feil"
}