{
  "url": "https://www.similarweb.com/blog/marketing/advertising/media-planning/",
  "slug": "media-planning",
  "title": "Media Planning - Building a Data-Driven Media Plan | Similarweb",
  "description": "Find out what media planning is and how it’s different from media buying. Learn how to build an actionable media plan and what's important for a strategy.",
  "content": "HomeBlogMarketingAd IntelligenceWhat is Media Planning and How Do You Build an Actionable Media Plan? Marketing Intelligence What is Media Planning and How Do You Build an Actionable Media Plan? Go to Similarweb by Ruth Trucks , Senior Marketing Writer 11 Min. June 10, 2022 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Advertising is expensive, and media planning isn’t easy. Whether in an agency or in-house, the media planner is the person who makes sure advertising dollars get spent effectively. Media planning is essential to reach the right audience and get the message in front of them at the right time. But there’s also a huge financial responsibility attached to it. Every bad decision can quickly run up painful costs. This article starts with the basics: what is media planning, and then we go on to clarify how the digital media planning process works, and how you can build an actionable plan. What is media planning? Media planning is the process of determining where, when, and how often an advertisement should run to maximize both engagement and ROI (return on investment). It involves every step from campaign planning, budgeting, and scheduling to launch and even beyond. The media planner needs to acquire a solid understanding of the business, the audience, and the messaging. Digital advertising is continuously becoming more complex, and the planner must be familiar with the advantages and disadvantages of the different platforms and methods. The same is true for TV which is moving to CTV (connected television) and for radio which is now being replaced by streaming and budgets have shifted to podcasts etc. What is a media plan and what does it include? The media plan is part of the campaign plan. It covers everything related to the distribution of assets through various media channels. Objectives A media plan defines the objective or what the campaign is supposed to achieve. It lays out what you expect your audience to get from the campaign or what action you want them to take. A campaign could aim at raising brand awareness, or it could promote a holiday deal to increase sales. Goals The goals of a media plan are derived from the company’s business plan. The media plan specifies the specific campaign goal and describes how you intend to reach the goals. Managers want to see numbers, so the plan should show calculations of estimates and measurable KPIs. Target audience The plan should include any and all parameters about the target audience relevant to the campaign. It can also present info that isn’t directly connected if it could impact decisions throughout the execution. It’s important to know your target audience, their preferences, and the media on which they are reachable. Types of media and media channels This is a critical piece for the media planner who needs to work out the specific media mix that will be most effective for the audience, the campaign, and the time. Timeline To run your ads, you need to determine when and for how long. The media plan sets a clear timeline for when the different assets will be published on which media and for how long the campaign will last. Advertising may begin on one platform only, and other media may follow. Campaign assets may run longer on one platform than on another. Frequency This is related to the timeline; however, it refers to the individual assets. The idea is that not all ads need to show all the time and you need to determine at which frequency an ad is active. What are the different types of media planning? Advertising campaigns can involve any variety and number of media types and channels. Let’s break down the different types into categories. We look at advertising in two main areas: online media channels and offline media channels. Campaigns can include both, and the media plan determines which channels to employ and how. 1. Examples of online media channels: Display ads Video marketing Social media Interestingly, 80% of B2B marketers who run paid campaigns use social media. This represents a huge shift from the more ‘traditional’ online forms of advertising. 2. Examples of offline media channels TV Radio / podcasts Print Out of home, or OOH (billboards etc.) Types of digital media to include in the planning: In digital media planning, there are three types of media: Paid media – you pay to publish Owned media – you publish on your own domains Earned media – others publish your content for free (reviews, media coverage) Media planning in an agency deals exclusively with paid media. The responsibility for owned media is with the client and the earned media falls under PR (public relations). Inside a company the responsibility could be distributed slightly differently. Planning the frequency of ads on digital media: A campaign can run for a week or an entire year. This doesn’t mean the actual ad will show the whole time during that period. In advertising, there are three approaches to the publishing frequency: Continuous – the ad runs continuously over a specified time period. Running an ad on a fixed schedule for a specified duration of time ensures constant messaging exposure. Flighting – the ad runs intermittently, in other words, an ad is shown in alternating periods. For example, a company can choose to run the ad for a week, then pause a week and then run it again. Or they could decide to activate the ad only during specific hours of the day or days of the week, based on seasonality. Pulsing – a combination of the two methods above. Pulsing involves continuous advertising but also planned spikes or pauses. There’s a continual stream of ads, but the frequency and volume of ads ebb and flow based on their effectiveness. What’s the difference between media planning and media buying? Media buying is one piece of the puzzle of media planning. It refers to the actual act of buying the advertising space. In an agency setting, the media buyer is usually a smart negotiator because that’s the essence of the job. Here’s how the tasks are divided: The media planner receives the brief from the client, including the type of campaign, target audience, campaign goals, campaign duration, etc. The planner prepares the media plan and, when approved by the client, writes up an RFP (Request for Proposal) that gets sent to the potential media partners. Vendors come back with a proposal. The planner filters out the relevant proposals and then hands them to the media buyer. The media buyer negotiates the best deal with the relevant partners. That may sound like a small chunk of the process, but it’s actually huge. A media buyer needs to be familiar with the different media platforms, pricing schemes, and advertising methods. You can read more on what media buying is here. In companies that do not work with an agency but run their advertising campaigns by themselves, the lines are more blurry. The functions of media planners and media buyers often overlap. The marketing team or manager could be doing the actual planning, and the buyer could be drafting up the RFP and finding the vendors. In other settings, media buying may be integrated into the media planner’s job, in which case one person does both. What are the steps of a typical media planning process? After the agency receives a client’s brief, the media planner determines which partners are relevant for the campaign. The media team prepares an RFP that specifies all campaign requirements and asks for the best proposals, including rates and positions, from relevant publishers. The planner receives publishers’ responses and selects the best-suited proposals. The media buyer negotiates the best possible deal with the selected publishers. The media planner gets client approval. The media planner issues an IO (insertion order) to the relevant media companies. Campaign launch. If media planning and buying are done in-house, the marketing team sets the goals, creates the plan, and executes it. Campaign goals derive from business and marketing goals. The planning and execution usually involve several people who share or divide responsibilities: Sets goals and KPIs based on analyzing competition and audience. Lay out the media plan as part of the campaign plan. The planner needs to evaluate ROI or ROAS (return on ad spent) and budget. From this point on, the process is the same as the agency. If there is a media buyer, they will negotiate rates. If there’s no differentiation between the two functions, the person who built the plan also negotiates the deals. At the same time, the creative team prepares the actual assets. The campaign is ready for launch when the deals are closed and the assets are prepared and approved by marketing management. Now that the campaign is running, the planner’s job isn’t over. After launch, the most critical task is to make sure the media got delivered as planned. While the campaign is running, the media planner needs to monitor customer reaction, engagement metrics, impressions, and clicks because they are responsible for optimization as needed. Planners use web media analytics to get the necessary data. Similarweb makes it possible to benchmark ad performance against the competition and keep clients’ and stakeholders updated with accurate and timely marketing reports. What you need to consider for a media planning strategy Let’s now get a little more practical and see how to create a media plan and what to consider in the process. Put yourself in the shoes of a media planner. We’ll show you what and how you need to research to get the data that enables you to reach the necessary decisions for your media strategy. The following points are relevant for both an agency and a company doing their own media planning. Determine what type of business you (or the client) are in, B2B, B2C, or else and evaluate performance in the market. You want to know if the market is a highly competitive or niche market and who the competitors are. You’ll look at the reach, the current marketing activities, the performance, and so on. Any company wanting to advertise should start with competitive research to build the campaign plan based on actual data. However, if you work at an agency, don’t rely on the client’s findings blindly but do your own research. One of the areas to examine is the competitive landscape. You want to find out which media platforms the competition uses, how successful, and how much they spend. Get to know the audience. Understand who the audience is and examine their browsing and buying habits. Many companies have buyer personas – fictional characters that represent the target audience. Set clear KPIs based on web metrics that can be measured and tracked. It’s critical to be precise and align expectations in all areas, financially and in terms of audience growth, reach, engagement, etc. Discover how this campaign fits in with other marketing activities. For one, everything needs to be aligned with brand messaging and character. Secondly, it’s important not to run too many campaigns at one time and confuse the audience. How to conduct research for media planning in advertising In digital marketing, web analytics tools are the cornerstone of strategizing. Any digital media plan should be based on data, and that data needs to be accurate and reliable. So, if you were (or are) a media planner, here are a few hands-on guidelines on what and how to research. Conduct market research To develop your media plan, start by conducting market research to understand the ideal types of content and media strategies for your target audience and customers. How can you tell? You check what works (and doesn’t work) for the competition. Identify similar campaigns that your competitors have run – or are running. Do a competitive analysis for your media planning strategy to identify the channels and publishers. Similarweb’s Marketing Channels feature allows you to compare your website’s core user acquisition methods against your competitors. Research the target audience Every target audience has unique preferences and behaviors that could impact your media plan. Understand your audience’s demographics, like age, gender, and location, and examine what types of content this audience prefers and where to reach them. If you don’t have buyer personas, consider creating them. Buyer personas help envision real people and how they interact with an ad rather than just an abstract audience description. To get started on building yours, download our buyer persona template below. The template will help you collect and organize the necessary information that represents the audience you want to target with your advertising campaigns. So, it’s a great way to start planning your media strategy. What you see here is a sample slide. The template includes three slides for each persona. Check it out. Download the Template Now! Competitive Benchmarking Report Use the buyer persona template so you can focus your media buying strategy on the right target audience. Download now Analyze competitors campaigns Dive into the marketing channels of your competitors that share your target audience and see which campaigns generate traffic and engagement. Investigate their ad spend to determine if and how much you should invest in the various methods. First, you’ll measure how much your competitors’ paid traffic share is compared to other traffic sources. Then you’ll dive into how they generate the traffic. Do they use programmatic or display ads? Where are they running? Analyzing search visits by traffic types: total visits, organic vs paid, and branded traffic percentages With Similarweb, you can not only see how they do it but also how successful the campaigns are. It will even show you where companies get the most valuable website traffic from. See each paid search ad or display ad and get links to the related landing pages. This lets you deep-dive into your competitors’ campaigns to understand what media they use and where they invest their budgets. Learn from what works for them and avoid making the same mistakes. Identify trends and new possibilities We started this article by talking about the cost of advertising and how the advertising possibilities are changing. The media planner needs to keep a finger on the pulse in a competitive and changing market. Otherwise, ineffective campaigns can turn into a growing cost leak. Identifying trends as they emerge enables agencies to help their clients be more successful. Marketing teams stay within the budget and improve ROI. Current, accurate data enables agencies to find the most efficient channels, reliable partners and optimize advertising efforts. If this is you, the Similarweb Digital Marketing Intelligence platform and Agencies Analytics can provide you with the tools and data that present a clear picture of your competitive environment and the forces that impact that landscape. You can identify the leaders and find out exactly how they succeed. Monitoring the activities lets you be the first to identify new players and successful new advertising trends. Want to see how it’s done? Competitors’ Data Can Work For You Start getting the data that lets you beat the competition Try Similarweb for free FAQs What is media planning? Media planning is the process of deciding where, when, and how often an advertisement should run to maximize engagement and ROI. What is a media plan and what does it include? A media plan is part of the campaign plan, covering the details of distributing assets through media channels. A media plan includes objectives, goals, the target audience, the types of media and media channels used, the timeline, and which frequency an ad is active. What are the different types of media planning? There are two main areas of media planning advertising. Online media channels include display ads and video marketing. Offline media channels include radio/podcasts and print. There are also three types of digital media planning, paid media, owned media, and earned media. This post was co-authored by Amelia Leib, who was Condé Nast’s Media Strategy Director for nine years and started her career as a media buyer at LVMH. Now she is the Media Industry Lead at Similarweb. by Ruth Trucks Senior Marketing Writer Ruth, with 15 years in marketing, transforms complex data into engaging content. She enjoys gardening, motorcycle tours, and family time. Related Topics: Ad Intelligence This post is subject to Similarweb legal notices and disclaimers. Related Posts Marketing Intelligence Digital Marketing Strategy: A Beginner’s Guide Ad Intelligence Content Marketing by Leah Messenger 7 Min. Mar 26, 2024 Marketing Intelligence How to Write Ad Copy (That Actually Converts): 10 Top Tips Ad Intelligence SEM & PPC by Leah Messenger 9 Min. Feb 28, 2024 Marketing Intelligence How to Check Website Traffic: Analyzing the Digital Data Ad Intelligence Affiliate Marketing by Limor Barenholtz 14 Min. Jan 17, 2024 Marketing Intelligence Mind The Gap: A Complete Guide to Traffic Gap Analysis (+ Checklist) Ad Intelligence Affiliate Marketing by Monique Ellis 15 Min. Oct 27, 2023 Marketing Intelligence What is Programmatic Advertising? Definitions and Explanations Ad Intelligence by Ruth Trucks 9 Min. Aug 23, 2022 Marketing Intelligence The Similarweb Marketing Digest: July 2022 Ad Intelligence Affiliate Marketing by Chloe Dougherty 2 Min. Jul 31, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "What is Media Planning and How Do You Build an Actionable Media Plan?"
    },
    {
      "level": "H2",
      "text": "What is media planning?"
    },
    {
      "level": "H2",
      "text": "What is a media plan and what does it include?"
    },
    {
      "level": "H2",
      "text": "What are the different types of media planning?"
    },
    {
      "level": "H3",
      "text": "Types of digital media to include in the planning:"
    },
    {
      "level": "H3",
      "text": "Planning the frequency of ads on digital media:"
    },
    {
      "level": "H2",
      "text": "What’s the difference between media planning and media buying?"
    },
    {
      "level": "H2",
      "text": "What are the steps of a typical media planning process?"
    },
    {
      "level": "H2",
      "text": "What you need to consider for a media planning strategy"
    },
    {
      "level": "H2",
      "text": "How to conduct research for media planning in advertising"
    },
    {
      "level": "H3",
      "text": "Conduct market research"
    },
    {
      "level": "H3",
      "text": "Research the target audience"
    },
    {
      "level": "H3",
      "text": "Analyze competitors campaigns"
    },
    {
      "level": "H3",
      "text": "Identify trends and new possibilities"
    },
    {
      "level": "H2",
      "text": "FAQs"
    },
    {
      "level": "H3",
      "text": "Digital Marketing Strategy: A Beginner’s Guide"
    },
    {
      "level": "H3",
      "text": "How to Write Ad Copy (That Actually Converts): 10 Top Tips"
    },
    {
      "level": "H3",
      "text": "How to Check Website Traffic: Analyzing the Digital Data"
    },
    {
      "level": "H3",
      "text": "Mind The Gap: A Complete Guide to Traffic Gap Analysis (+ Checklist)"
    },
    {
      "level": "H3",
      "text": "What is Programmatic Advertising? Definitions and Explanations"
    },
    {
      "level": "H3",
      "text": "The Similarweb Marketing Digest: July 2022"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Ruth Trucks"
}