{
  "url": "https://www.similarweb.com/blog/marketing/advertising/media-buying/",
  "slug": "media-buying",
  "title": "Media Buying - A Guide to What it Really Means | Similarweb",
  "description": "A clear, truthful account of what media buying means and doesn’t mean. Read here what it is, what a media buyer does and why it’s not always as it seems.",
  "content": "HomeBlogMarketingAd IntelligenceMedia Buying - A Guide to What It Really Means Marketing Intelligence Media Buying – A Guide to What It Really Means Go to Similarweb by Ruth Trucks , Senior Marketing Writer 8 Min. June 15, 2022 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic What does media buying mean to you? The answer to that sounds completely different from someone in a marketing agency to a digital marketer in a SaaS company. An affiliate marketer will give you yet another dissonant explanation. There’s a lot of confusion and unbounded misleading content on the web. People like to write about media buying. It’s popular, and it’s good for generating traffic. So you must be careful who you trust and place every bit of info in the right context. At Similarweb, we are experts in digital marketing because we have the tool that analyzes it. And we’ve done our homework, speaking directly with media buyers in different industries. So if you’re confused about what media buying means, you’ve come to the right place. You’ll understand the difference between media planning and media buying, learn how programmatic media buying works, what role it plays in affiliate marketing, and how performance marketing is related. Let’s get started. What is media buying? A straightforward definition The Cambridge dictionary puts it plain and simple: Media buying is the job of arranging to pay to put advertisements on television, radio, or the internet, or in a newspaper, magazine, etc. Forbes simplifies it even more: Media buying is the process of purchasing ad space to promote your message. Then why is it so difficult to understand? Here’s the thing: with digital advertising, the landscape is constantly changing, and so are the processes. Moreover, in recent years the concept of affiliate media buying has evolved into an independent sub-type of affiliate marketing. And that is yet another ball game. Four reasons you are confused about the meaning of media buying: The media buying process constantly evolves. The definitions vary with the industry. The job isn’t the same in every type of company. There’s lots of inaccurate information on the web. So let’s break that down and see what it means. What does a media buyer do? In an agency, media buyers are negotiators. They work closely with the media planner, who builds the media buying strategy and sets the parameters and priorities. The media buyer negotiates the price of television and radio air time, advertising space within newspapers or magazines, and other print publications. In a digital setting, they work out rates and payment methods with networks and publishers. In a company, the media planner and buyer positions are less clear-cut. Depending on the size of the company and the digital marketing team, the media buyer often fulfills some traditional media planner’s tasks. In the affiliate landscape, a media buyer can be an independent marketer or the most important person in the affiliate company. They are responsible for promoting affiliate programs through media buying campaigns, typically on social media. This adds confusion because in agencies and companies, the word media refers exclusively to ads, whereas in affiliate marketing it’s used more widely. What’s the difference between media buying and media planning? Traditionally, media buying is part of the media planning process and refers to the actual negotiation. Advertising agencies work according to this concept. The media planner creates a media plan based on the client’s brief and budget. Together with the client, they finalize all campaign details, including which media to advertise on, for how long, and how much to spend on what. The media buyer enters the picture only after the planner receives relevant proposals from publishers. They must be excellent negotiators and experts in advertising media cost schemes and calculations. Technically, media buying refers to the negotiation of the actual deal and doesn’t involve any decision-making or strategizing. The media buyer’s job is to negotiate the best deals for the best slots and gain the maximum returns. The media planner’s job is to plan the best media placement strategy to reach the right audience with the right message. How does digital media buying work? In digital media buying, you purchase digital advertising space or impressions. There are two ways of doing this: direct and programmatic. What is direct media buying? The ad seller and the advertising space provider are in direct contact. In other words, the company that wants to run an advertising campaign (or their agent) purchases directly from a website that offers ad space. This could be any site that seeks to generate income from its traffic, such as news sites, blogs, and informational sites. The advertiser pays the publisher based on the number of impressions an ad receives. Almost all digital media is calculated in CPM, which stands for Cost Per 1000 Impressions. The advertiser pays an agreed amount for every 1000 impressions. If the ad does not get impressions, they don’t pay. The more exposure the ad receives, the higher the cost. Here’s another term often connected to direct media buying: performance marketing. However, media buying isn’t performance marketing per se, which is usually based on clicks, CPC (cost per click), and sometimes PPC (pay per click). In direct media buying the parties can sometimes agree on a flat fee. This could be in the form of sponsorship or a homepage takeover, ensuring the ad is shown continuously to all visitors. Agencies may negotiate special agency fees if they can commit to an agreed volume of work. They can negotiate rates for all their clients with individual media companies based on the quantum. This saves time and resources for all involved parties. What is programmatic media buying? The programmatic model automizes the media buying and ad placement process. Besides the advertiser and the publisher, there are three additional parties involved. The advertiser: The company running the paid ad. The publisher: The website displaying the ad. DSP – the demand-side platform: The platform where advertisers enter their criteria, including a budget, target audience, and CPM (price) cap.. When this software is used, publishers and advertisers don’t negotiate prices; rather, there is automated real-time bidding for ad placements. The ad network: The marketplace used to buy and sell ads and placements. SSP – the supply-side platform: The platform publishers use to list inventory they’re willing to make available to programmatic advertisers Know Your Market & Negotiate Better Deals Similarweb monitors how expensive your competitors advertise. Try Similarweb free How does programmatic advertising work? Let’s imagine, you want to run an advertising campaign. You create a campaign plan, calculate a budget, and set KPIs. When your campaign is ready, you upload the assets to the DSP and book a campaign. You specify where and when you’d like your ad to be published and who you’d like to reach. And, of course, you indicate how much you’re willing to pay. On the other side of the equation is the SSP, where sites and networks offering advertising space place their inventory. The advertising space is also called inventory, and it gets listed on the ad exchange through the SSP. Connecting the two is the ad network or ad exchange. Here’s where the matchmaking happens. The DSP searches the ad exchange for suitable inventory for your ad. When that’s located, your ad competes against other ads, and the highest bid with the highest relevance wins the ad space. Sometimes the term RTB, which stands for Real-Time-Bidding is used instead of programmatic advertising. However, they are not the same. RTB refers to automated bidding within the media buying process and is part of programmatic advertising. What are the four types of programmatic media buying? Now you know the players and the overall flow. Time to dig deeper so you’ll get a glimpse at what a media buyer deals with. In programmatic media buying there are four main bidding types: Open Exchange or Open Auction – Impressions are open to everyone at an open auction. The highest bidder wins the impression in real-time. Private Marketplace (PMP) – Advertisers must be invited to join an auction. Publishers have complete control over potential bidders, so this is more popular with larger publications. Preferred Deals – Publishers sometimes sell slots to advertisers in closed deals without an auction. Advertisers get to see the ad inventory and make a deal before slots are opened up to RTB or PMP auctions. Programmatic Guaranteed – This type is the same as direct media buying. Advertisers and publishers negotiate inventory and rates, but instead of the transaction being formalized through an IO (insertion order), the media is purchased through programmatic channels. What does a media buyer do in a programmatic model? Automation doesn’t make the human media buyer obsolete. To succeed in negotiating the best deals that bring the highest ROI or ROAS (return on ad spend), media buyers have much to learn. A programmatic media buyer needs to know how to use the various types of digital media, from social media to display ads, from PPC to video ads. In most companies, a media buyer’s responsibility will focus on one of the media types. However, each network has its unique rules and methodologies. Often the programmatic media buyer’s objective is to reach the lowest cost through optimization. At the end of the day, performance is deemed effective if they achieve the lowest cost per click (CPC). How media buyers and planners monitor performance Whether a media buyer works in an agency or client direct, the only way to keep getting the best deals is through monitoring and analyzing website performance data. Media planners and buyers alike need to evaluate networks and publishers’ activities for their preferences. Media analytics tools monitor ad performance, incoming traffic, and conversions for your campaigns. With Similarweb Digital Marketing Intelligence, media buyers can also dig into the data of publishers and their competitors. Here are a few ways media buyers use the Similarweb platform. 1. Similarweb’s Find Publishers tool helps analyze the top-performing publishers used by competitors. The list shows the current top publishers in the financial industry, subcategory investing, region USA You can search by industry or by competition. With our Analyze Publisher tool, media buyers (or planners) see which advertisers and ad networks work with each publisher, how much outgoing traffic they generate, and where they’re driving that traffic to. They can also see how many ads are placed on that publisher’s site and other valuable insights. 2. With Similarweb Outgoing Traffic insights, media buyers can compare multiple publishers’ traffic metrics and understand which ones send traffic to their competitors (and which ones perform best). This can be a huge benefit when bargaining. The media buyer can use the insights to plan and lead the negotiations. If a potential advertising partner is underperforming and the media buyer knows they need the business, this can help press the right pressure points. 3. Similarweb Digital Marketing Intelligence platform enables professionals to analyze audiences and the competitive landscape. 4. Marketers also use Similarweb’s Search Ads Spy tool for inspiration. View competitors’ ad creatives and discover when, for how long, and where they ran. 5. Digital marketers discover and analyze the competition’s landing pages with Similarweb’s Landing Page Analyzer tool displaying a ton of examples of what your competitors use. 6. Media planners and buyers use the Search Ads tool to show competitors’ display ads and the Find Ad Networks tool to identify the network’s competitors use to advertise, such as GDN, Taboola, Amazon, and many more. Explore our insights blog for more guidance and information on digital marketing and get actionable tips for your own work. When you’re ready to face competitor’s data access Similarweb for free. Know Your Market & Negotiate Better Deals Similarweb monitors how expensive your competitors advertise. Try Similarweb free Media buying FAQs What is media buying? Media buying is the process of purchasing advertising space. What are the types of media buying? There are two types of digital media buying: direct media buying and programmatic media buying. What is direct media buying? Direct media buying refers to when the ad seller and the advertising space provider are in direct contact with each other. What is programmatic media buying? The programmatic media buying model automizes the process. Along with the advertiser and the publisher, there are three additional parties involved. These three parties are the demand-side platform (DSP), the ad network, and the supply-side platform (SSP). This post was co-authored by Amelia Leib, who was Condé Nast’s Media Strategy Director for nine years and started her career as a media buyer at LVMH. Now she is the Media Industry Lead at Similarweb. by Ruth Trucks Senior Marketing Writer Ruth, with 15 years in marketing, transforms complex data into engaging content. She enjoys gardening, motorcycle tours, and family time. Related Topics: Ad Intelligence SEM & PPC This post is subject to Similarweb legal notices and disclaimers. Related Posts Marketing Intelligence Digital Marketing Strategy: A Beginner’s Guide Ad Intelligence Content Marketing by Leah Messenger 7 Min. Mar 26, 2024 Marketing Intelligence How to Write Ad Copy (That Actually Converts): 10 Top Tips Ad Intelligence SEM & PPC by Leah Messenger 9 Min. Feb 28, 2024 Marketing Intelligence How to Check Website Traffic: Analyzing the Digital Data Ad Intelligence Affiliate Marketing by Limor Barenholtz 14 Min. Jan 17, 2024 Marketing Intelligence Mind The Gap: A Complete Guide to Traffic Gap Analysis (+ Checklist) Ad Intelligence Affiliate Marketing by Monique Ellis 15 Min. Oct 27, 2023 Marketing Intelligence What is Programmatic Advertising? Definitions and Explanations Ad Intelligence by Ruth Trucks 9 Min. Aug 23, 2022 Marketing Intelligence The Similarweb Marketing Digest: July 2022 Ad Intelligence Affiliate Marketing by Chloe Dougherty 2 Min. Jul 31, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Media Buying – A Guide to What It Really Means"
    },
    {
      "level": "H2",
      "text": "What is media buying? A straightforward definition"
    },
    {
      "level": "H3",
      "text": "Four reasons you are confused about the meaning of media buying:"
    },
    {
      "level": "H2",
      "text": "What does a media buyer do?"
    },
    {
      "level": "H2",
      "text": "What’s the difference between media buying and media planning?"
    },
    {
      "level": "H2",
      "text": "How does digital media buying work?"
    },
    {
      "level": "H3",
      "text": "What is direct media buying?"
    },
    {
      "level": "H3",
      "text": "What is programmatic media buying?"
    },
    {
      "level": "H2",
      "text": "How does programmatic advertising work?"
    },
    {
      "level": "H3",
      "text": "What are the four types of programmatic media buying?"
    },
    {
      "level": "H2",
      "text": "What does a media buyer do in a programmatic model?"
    },
    {
      "level": "H2",
      "text": "How media buyers and planners monitor performance"
    },
    {
      "level": "H2",
      "text": "Media buying FAQs"
    },
    {
      "level": "H3",
      "text": "Digital Marketing Strategy: A Beginner’s Guide"
    },
    {
      "level": "H3",
      "text": "How to Write Ad Copy (That Actually Converts): 10 Top Tips"
    },
    {
      "level": "H3",
      "text": "How to Check Website Traffic: Analyzing the Digital Data"
    },
    {
      "level": "H3",
      "text": "Mind The Gap: A Complete Guide to Traffic Gap Analysis (+ Checklist)"
    },
    {
      "level": "H3",
      "text": "What is Programmatic Advertising? Definitions and Explanations"
    },
    {
      "level": "H3",
      "text": "The Similarweb Marketing Digest: July 2022"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Ruth Trucks"
}