{
  "url": "https://www.similarweb.com/blog/marketing/advertising/programmatic-advertising/",
  "slug": "programmatic-advertising",
  "title": "Programmatic Advertising Definitions and Explanations | Similarweb",
  "description": "Programmatic advertising seems complicated. Find here simple definitions and explanations. Understand how the process works and what matters.",
  "content": "HomeBlogMarketingAd IntelligenceWhat is Programmatic Advertising? Definitions and Explanations Marketing Intelligence What is Programmatic Advertising? Definitions and Explanations Try Similarweb free by Ruth Trucks , Senior Marketing Writer 9 Min. August 23, 2022 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic My grandpa thinks they are spying on him. He shows me an ad on Facebook for a new lawnmower – he’s been wanting to buy one for a while. I don’t know who he thinks they are, but I know it’s not big brother trying to rid my grandad of his money. These ads are generated by programmatic advertising. With this digital advertising technology, you automatically get ads that fit your demographics and your search history. I won’t even try to explain to my grandad how programmatic advertising works. But for digital marketers, it’s not as complicated as it seems. And you don’t need to understand all the technical details to benefit from programmatic advertising. What is programmatic advertising? Programmatic advertising is an automated process simplifying the selling and purchasing of digital ad space and placing ads in front of a specified target audience. The method automates the manual process of buying digital media or ad space. The concept is simpler, faster, and less expensive than the traditional method and speeds up media planning. In 2021 the overall spending on programmatic advertising grew by 28% compared to 2020. We are talking about $418 billion in 2021. The above projection was published by Statista in early 2022 and estimates global spending to reach $725 billion by 2026. That is if spendings keep growing proportionately. However, there’s good reason to believe that isn’t going to happen. Another statistic measuring the change in programmatic advertising spend published more recently predicts that it will increase but at a declining rate over the coming years. So, where is programmatic advertising going, and why are we questioning its future? It’ll become apparent when you understand how this discipline works and what it involves. Programmatic Advertising definitions: To make sense of the process, it’s best first to define the relevant terminology. The world of media buying and digital advertising is full of acronyms and initialisms, and we’ve broken down the key terms here: Advertiser The party that wants to advertise their product or service, in other words, commercial brands, SaaS and other digital service providers, SMBs, ecommerce sellers, you name it. Sometimes the advertiser will hire an ad agency to do the programmatic advertising for them or take over responsibility for their digital advertising altogether. Publisher This party owns the space where advertisers can place their ads. They offer ad space for sale. In the media buying jargon, this is also called inventory. Ad Exchange The ad exchange is where the magic happens, or, to be accurate, the transaction. This is the platform where ad space gets auctioned. You can compare it to the stock market, where one side offers assets for sale and the other bids in order to purchase. On the ad exchange, the publisher’s inventory is put out for auction, and the advertisers make the bids. Sometimes you will see the term ad network used in place of ad exchange, however, they are not the same thing. Ad networks function as resellers of inventory, so the publishers cede control of their inventory on these platforms. Ad exchanges were born out of a desire for greater control and fraud limitation. DSP – Demand Side Platform On this platform, the advertiser or ad agency uploads their assets and books the campaign. It includes setting criteria for audience demographics and ad space requirements. SSP – Supply Side Platform Publishers list their inventory on this platform. The DSP stores the relevant information for the ad exchange to pull the data and offer the space when demand comes in RTB – Real-Time Bidding RTB describes the process that happens at the ad exchange in collaboration with the DSP and the SSP. How does programmatic advertising work? The above are players in the programmatic advertising process. Additional platforms or services are often involved, but they don’t significantly change the overall process. Focus on the above to understand the critical steps and each player’s role in the programmatic advertising process. In traditional media buying, advertiser and publisher negotiate their deals for ad campaigns. Publishers offer space on their websites where ads can be displayed, and advertisers can book this space to have their ads shown. The price is calculated per impression, When someone clicks on the page, and the ad becomes visible, it counts as an impression. This is important because it impacts the cost calculation for traditional vs. programmatic advertising. The advertiser only pays when the ad is displayed to a visitor. You may have heard about CPM, which means ‘cost per mille’ and sets the amount the advertiser pays per 1,000 impressions. To guarantee success, publishers commit to a minimum of impressions. If the minimum isn’t reached, they don’t receive payment for the under-delivered impressions. Programmatic advertising automates the process and uses an ad exchange to auction impressions. The ad exchange is similar to a stock exchange, trading impressions instead of shares. The highest bidder closes the deal. This happens in real time, and that’s where the term RTB (real-time bidding) comes in. To get to the ad exchange, advertisers upload their ads together with specifications about audience demographics, etc., to a Demand Side Platform (DSP). This platform connects them to the ad exchange, and the bidding can begin. The publisher, on the other side of the rope, lists their ad space inventory on a Supply Side Platform (SSP). Now they can offer and sell impressions on the ad exchange. In the ad exchange, impressions are offered at a starting price to advertisers for whom the publisher’s audience is relevant. The highest bidder gets the impression. All this happens in the time from when you click on a page till it opens – a few seconds at the most. Programmatic advertising example Here’s what happens step by step when you see an ad that looks like someone’s spying on you: You click to open a news site, i.e. The Washington Post. Through the SSP, washingtonpost.com puts impressions up for auction. Through the DSP, Monday.com, Booking.com, and others whose demographic description you fit (or whose site you frequented), bid for the impression. The auction takes place in the ad exchange, and the highest bidding advertiser, let’s imagine it’s Booking.com, wins. You see an ad for a holiday deal to Seychelles by Booking.com. When your grandfather clicks on the same site, he’ll see a different ad. He hasn’t been contemplating a trip to a faraway island lately, and as a pensioner, he doesn’t need a project management tool. The sites that bid for impressions when he opens the news site aren’t the same that bid when you click on it. Based on his age and recent browsing history, he may get offered a natural remedy for back pain or a deal for lawnmowers (if he likes gardening, like my grandpa). The advertisers set audience demographics and behavioral criteria in the DSP to ensure the ad gets seen by their target audience. Similar sites compete for the same audience and the same ad space. As an advertiser, it’s a good idea to do some competitor research to discover who you’re up against. (I researched for an article about affiliate programs before taking the screenshot.) What are the benefits of programmatic advertising? Benefits for both advertisers and publishers: Simplicity. The automated process reduces the amount of manual work. Speed. The time involved in buying and placing ads is reduced. No negotiations. RTB is a straightforward bidding process, and it’s not impacted by human ego or negotiation tactics. Advertisers also benefit from: Audience targeting. The system ensures your ad is placed in front of your target audience, not a random audience that opens the publisher’s site. Cost-efficiency. Programmatic ads are often less expensive, and the reduced time and effort result in additional savings. Publishers have the advantage of Full ad space utilization. There’s more ad space than inventory looking to be bought by advertisers, causing publishers to get stuck with unutilized ad space. With programmatic advertising, they can offer impressions for lower prices attracting a broader audience of potential advertisers. No commitment to the number of impressions. This lowers the risk for the publisher because every impression counts. In the traditional method, they don’t get payment for any guaranteed but under-delivered impressions. Which are the three types of programmatic advertising? There are three main types of programmatic advertising, and we’ll briefly explain each. Open Exchange What we’ve described so far is the open exchange. In this form of programmatic advertising, the advertiser and publisher have no direct contact. The inventory of the publisher is open to any bidder. The advertiser defines the requirements regarding the target audience. So, they can be sure the ad gets displayed to the right audience but have limited control over where it will appear. The price for ad impressions rises with the number of conditions. PMP – Private Market Place A publisher may have particularly valuable ad space where demand for impressions is high. One way to capitalize on this is by asking for a higher starting price. Additionally, the publisher can decide to limit the offer to selected companies. For example, when The New York Times covers the opening of the New York Fashion Week, they might offer impressions only to Gucci, Prada, and other designer fashion brands. They would inform the chosen brands so that they can adjust their bidding. This type of programmatic is called Private Market Place, in short PMP, because impressions aren’t offered to the entire market but only to a private collection of advertisers. This concept involves some communication and direct contact between the two parties. Programmatic Direct or Programmatic Guaranteed In this form of programmatic advertising, the publisher reserves the ad space for a specific advertiser. Usually, no bidding takes place, and the rates and conditions are agreed upon directly between the advertiser and publisher. Are there risks and challenges to programmatic advertising? The benefits of an automated digital ad selling and placing method outweigh the downsides, but you should still be aware of them. Both advertisers and publishers have less control over the outcome of the deal. The question is, how much control do they truly need, and is that necessarily a disadvantage? The risk of fraud is perceived to be higher, and there have been cases where publishers used bots to forge impressions or pretend to be someone they’re not. Some involved in the advertising industry mourn the loss of personal relationships. Indeed, nothing serves business better than excellent, lasting personal relationships. There is one point that should worry advertisers and publishers alike because it puts a question mark on the future of advertising: The whole system relies on cookies. Today’s programmatic advertising technology can’t function without tracking cookies. However, Google has announced that in 2024 cookies will disappear. Does this mean programmatic advertising will vanish with them? Is there a future for programmatic advertising? If and how programmatic will evolve without cookies is not clear at the moment. Developers still have time to find solutions to keep it going or upgrade to a different, cookieless system. One thing is for sure, though, digital display advertising will not go away. For now, marketers should ensure they have programmatic advertising but don’t rely exclusively on it. Both sides are well advised to keep investing in direct relationships with the other side and track performance through ad analytics. Personal commitment and interaction can’t easily be replaced. It’s always valuable to seek out your business partners rather than have an algorithm connect you based on the outcome of an auction. As you can see, even programmatic advertising includes the option for direct negotiations. How to find good partners for programmatic advertising? You can find and evaluate potential partners by analyzing web traffic data. To identify high-potential publishers, you can go to Similarweb Digital Marketing Intelligence and get a list of all publishers and ad networks sending traffic to selected websites. Evaluate audience engagement to determine the potential of these publishers for your site and find out where their outgoing traffic leads. For example, select your competitors and see where their display ad traffic comes from – which publishers send them visitors. Pinpoint the ones with the highest traffic and engagement and dig deeper into their performance. Publishers that are strong in your industry and valuable to sites that offer similar products to a similar audience are a good choice for your collaboration efforts. The platform can also help you be the first to identify upcoming trends in digital marketing because Similarweb data is the freshest, most accurate data available on the internet. So, when a new, cookieless advertising technology emerges, you’ll see it first in our digital marketing metrics. Most Accurate Data Source for Marketers Get the traffic insights that help you hit your targets.. Try Similarweb free FAQs What is programmatic advertising? Programmatic advertising uses automation technologies to simplify the digital media buying and ad placement process. What are the components of programmatic advertising? In programmatic advertising, the advertiser and publisher use different platforms to connect with an ad exchange where impressions are auctioned. On the advertiser’s side, there’s the DSP (Demand Side Platform ), and on the publisher’s side, we have the SSP (Supply Side Platform). What does RTB mean? RTB stands for real-time bidding and refers to the real-time automated auction of impressions for advertising on web pages. Programmatic vs. non-programmatic advertising – what’s the difference? Programmatic advertising is basically an automated version of traditional media buying and is therefore faster and more efficient in many ways. However, for long-term partnerships, traditional methods involving direct contact are necessary and with cookies going away programmatic advertising is at serious risk. by Ruth Trucks Senior Marketing Writer Ruth, with 15 years in marketing, transforms complex data into engaging content. She enjoys gardening, motorcycle tours, and family time. Related Topics: Ad Intelligence This post is subject to Similarweb legal notices and disclaimers. Related Posts Marketing Intelligence Digital Marketing Strategy: A Beginner’s Guide Ad Intelligence Content Marketing by Leah Messenger 7 Min. Mar 26, 2024 Marketing Intelligence How to Write Ad Copy (That Actually Converts): 10 Top Tips Ad Intelligence SEM & PPC by Leah Messenger 9 Min. Feb 28, 2024 Marketing Intelligence How to Check Website Traffic: Analyzing the Digital Data Ad Intelligence Affiliate Marketing by Limor Barenholtz 14 Min. Jan 17, 2024 Marketing Intelligence Mind The Gap: A Complete Guide to Traffic Gap Analysis (+ Checklist) Ad Intelligence Affiliate Marketing by Monique Ellis 15 Min. Oct 27, 2023 Marketing Intelligence The Similarweb Marketing Digest: July 2022 Ad Intelligence Affiliate Marketing by Chloe Dougherty 2 Min. Jul 31, 2022 Marketing Intelligence Media Buying – A Guide to What It Really Means Ad Intelligence SEM & PPC by Ruth Trucks 8 Min. Jun 15, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "What is Programmatic Advertising? Definitions and Explanations"
    },
    {
      "level": "H2",
      "text": "What is programmatic advertising?"
    },
    {
      "level": "H3",
      "text": "Programmatic Advertising definitions:"
    },
    {
      "level": "H2",
      "text": "How does programmatic advertising work?"
    },
    {
      "level": "H3",
      "text": "Programmatic advertising example"
    },
    {
      "level": "H2",
      "text": "What are the benefits of programmatic advertising?"
    },
    {
      "level": "H2",
      "text": "Which are the three types of programmatic advertising?"
    },
    {
      "level": "H3",
      "text": "Open Exchange"
    },
    {
      "level": "H3",
      "text": "PMP – Private Market Place"
    },
    {
      "level": "H3",
      "text": "Programmatic Direct or Programmatic Guaranteed"
    },
    {
      "level": "H2",
      "text": "Are there risks and challenges to programmatic advertising?"
    },
    {
      "level": "H2",
      "text": "Is there a future for programmatic advertising?"
    },
    {
      "level": "H2",
      "text": "How to find good partners for programmatic advertising?"
    },
    {
      "level": "H2",
      "text": "FAQs"
    },
    {
      "level": "H3",
      "text": "Digital Marketing Strategy: A Beginner’s Guide"
    },
    {
      "level": "H3",
      "text": "How to Write Ad Copy (That Actually Converts): 10 Top Tips"
    },
    {
      "level": "H3",
      "text": "How to Check Website Traffic: Analyzing the Digital Data"
    },
    {
      "level": "H3",
      "text": "Mind The Gap: A Complete Guide to Traffic Gap Analysis (+ Checklist)"
    },
    {
      "level": "H3",
      "text": "The Similarweb Marketing Digest: July 2022"
    },
    {
      "level": "H3",
      "text": "Media Buying – A Guide to What It Really Means"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Ruth Trucks"
}