{
  "url": "https://www.similarweb.com/blog/insights/social-media-news/instagram-twitter/",
  "slug": "instagram-twitter",
  "title": "Instagram Ready to Steal Twitter Users | Similarweb",
  "description": "Already 4X larger on mobile apps, Instagram is growing web traffic while Twitter shrinks. New service to embrace Mastodon “fediverse” of distributed apps",
  "content": "HomeBlogInsightsSocial Media NewsInstagram Ready to Steal Twitter Users Insights Instagram Ready to Steal Twitter Users Start your free trial by David F. Carr 4 Min. May 23, 2023 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Already 4X larger on mobile apps, Instagram is growing web traffic while Twitter is shrinking. New service to embrace Mastodon “fediverse” of distributed apps Meta Platforms is about to release a Twitter competitor that will spin off from Instagram but be oriented to text posts with image or video attachments rather than revolving around images. Facebook parent company Meta has not disputed the reports,, but what we know so far comes from a leaked internal presentation that says the app will interoperate with “certain other apps such as Mastodon,” presumably meaning that it will implement the same ActivityPub protocol as other fediverse distributed apps. In other words, users of the app will gain access to anyone from the Mastodon universe who wants to follow their feed of posts, magnifying the total potential audience. Better yet, existing Instagram users will be able to use their same account to post to the new social network, rather than having to create a new online identity. While none of these factors guarantee success, they could allow the as-yet-unnamed Instagram spinoff to leapfrog Mastodon, BlueSky, Post.News, Tribal, and other platforms aiming to take advantage of the erosion in Twitter’s audience and credibility. Key takeaways Both on the web and with apps, Twitter’s audience keeps dropping, while Instagram’s is relatively stable. In April, Twitter’s audience on Android was down 7.9% on a year-over-year basis, according to Similarweb estimates. Instagram’s audience also declined slightly, but by less than 1%. Over the last 28 days, Twitter’s web traffic dropped 7.6% on a year-over-year basis, while Instagram’s was up 0.6%. Instagram attracted 889.4 million monthly active users on Android alone, compared with 213.1 million for Twitter. Twitter and Instagram are neck-and-neck on the web, with each attracting more than 6 billion monthly visits in April. Mastodon, which saw a tremendous influx of new users soon after Elon Musk took control of Twitter, continues to grow rapidly – but probably not rapidly enough to become a mass-market phenomenon on the order of the major social media apps. Traffic to mastodon.social, the flagship server of the distributed social network, was up more than 1,700% year-over-year in November. In April, it was still up, but by a less exponential 166%. But total traffic to the server is numbered in the millions – over 3 million – rather than the billions Twitter gets. Traffic to the entire Mastodon network remains a fraction of Twitter’s audience. Instagram beating Twitter on apps, while taking share away on the web Meta’s ability to attract users who have been leaving Twitter will depend on how well it will be able to convert Instagram users into users of its forthcoming text posting app – but Instagram’s strong position in the digital world is a great starting point. Instagram app has four times more monthly active users than Twitter on Android, and the proportions are similar on iOS. Meanwhile, Instagram runs neck-and-neck with Twitter on the web and is growing traffic while Twitter has been losing web traffic every month so far in 2023. In the first four months of 2023, Twitter’s total web traffic dropped by 5.4%, while its mobile app audience (using monthly active users on Android) dropped by 6.5%. Over the same period, Instagram web traffic dropped 2.15% and app users dropped 1.9%. The Mastodon / ActivityPub factor Instagram could make a big impact on the network of distributed social networking services of which Mastodon is the best known. The BlueSky service backed by Twitter founder Jack Dorsey has also gained a lot of attention recently, even in an invite-only stage, and also boasts a distributed design but not on the same technical foundation as Mastodon. The Mastodon servers interoperate with each other and with other services in the “fediverse” of distributed social media services using the ActivityPub protocol. The idea is to let users share social posts across many different services and servers, reducing “lock-in” to any one social network operator. Most of the servers that make up the Mastodon network, including the original mastodon.social site, are operated by non-profits, volunteers, and tech companies on a pro bono basis, or funded by donations. One of the things limiting Mastodon’s growth is its technical sophistication – which comes paired with a user experience that appeals more to technical users than the general public. However, nothing stops a company like Meta from embracing the same open-source technical foundation as Mastodon and adding a more polished user experience. Instagram could benefit from being able to advertise the new social network as “open” and “distributed,” while gaining access to a larger audience and sharing that audience with its users. Medium and Flipboard have established Mastodon instances as a way of giving their users access to the Mastodon network. Automattic, which is best known as the corporate backer of WordPress and also owns Tumblr, has announced plans for Tumblr to support ActivityPub but does not yet appear to have delivered on those plans. Meanwhile, Automattic recently acquired a Mastodon plugin for WordPress. Instagram’s embrace could be the biggest commercial endorsement of the fediverse yet. The Similarweb Insights & Communications team is available to pull additional or updated data on request for the news media (journalists are invited to write to press@similarweb.com). When citing our data, please reference Similarweb as the source and link back to the most relevant blog post or similarweb.com/blog/insights/. Contact: For more information, please write to press@similarweb.com. Report By: David F. Carr, Senior Insights Manager Methodology Disclaimer: All names, brands, trademarks, and registered trademarks are the property of their respective owners. The data, reports, and other materials provided or made available by Similarweb consist of or include estimated metrics and digital insights generated by Similarweb using its proprietary algorithms, based on information collected by Similarweb from multiple sources using its advanced data methodologies. Similarweb shall not be responsible for the accuracy of such data, reports, and materials and shall have no liability for any decision by any third party based in whole or in part on such data, reports, and materials. Image: “Photographer riding a mastodon,” Bing Image Creator by David F. Carr David covers social media, digital advertising, and generative AI. With a background in web trends since the 1990s, he’s also the author of \"Social Collaboration for Dummies\". Related Topics: Social Media News This post is subject to Similarweb legal notices and disclaimers. Related Posts Insights X Rival Bluesky May Be Growing But Threads is Growing Faster Social Media News by David F. Carr 3 Min. Aug 15, 2024 Insights Reddit Blocks Bing as Google Clicks Grow Like Crazy AI News Media & Entertainment News by David F. Carr 4 Min. Jul 31, 2024 Insights Threads is One Year Old and Growing Social Media News by David F. Carr 4 Min. Jul 2, 2024 Insights Trump Trial Not Driving Truth Social Engagement Social Media News by David F. Carr 3 Min. Apr 26, 2024 Insights X Ad Portal Traffic Rebounds in Q1, up 29% YoY Social Media News by David F. Carr 2 Min. Apr 5, 2024 Insights Truth Social Stock Soars at IPO, but Digital Engagement Doesn’t Social Media News by David F. Carr 4 Min. Apr 1, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Instagram Ready to Steal Twitter Users"
    },
    {
      "level": "H2",
      "text": "New service to embrace Mastodon “fediverse” of distributed apps"
    },
    {
      "level": "H2",
      "text": "Key takeaways"
    },
    {
      "level": "H2",
      "text": "Instagram beating Twitter on apps, while taking share away on the web"
    },
    {
      "level": "H2",
      "text": "The Mastodon / ActivityPub factor"
    },
    {
      "level": "H3",
      "text": "X Rival Bluesky May Be Growing But Threads is Growing Faster"
    },
    {
      "level": "H3",
      "text": "Reddit Blocks Bing as Google Clicks Grow Like Crazy"
    },
    {
      "level": "H3",
      "text": "Threads is One Year Old and Growing"
    },
    {
      "level": "H3",
      "text": "Trump Trial Not Driving Truth Social Engagement"
    },
    {
      "level": "H3",
      "text": "X Ad Portal Traffic Rebounds in Q1, up 29% YoY"
    },
    {
      "level": "H3",
      "text": "Truth Social Stock Soars at IPO, but Digital Engagement Doesn’t"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by David F. Carr"
}