{
  "url": "https://www.similarweb.com/blog/insights/social-media-news/reddit-ipo-traffic/",
  "slug": "reddit-ipo-traffic",
  "title": "Reddit Sees Traffic Increase Ahead of Expected IPO | Similarweb",
  "description": "As Reddit approaches its impending IPO, it sees platform user growth and an increase in traffic to its ad portal ads.reddit.com",
  "content": "HomeBlogInsightsSocial Media NewsReddit Sees Traffic Increase Ahead of Expected IPO Insights Reddit Sees Traffic Increase Ahead of Expected IPO Get the full report by David F. Carr 2 Min. February 21, 2024 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic After being sidelined due to recent market volatility, Reddit’s IPO appears to be scheduled for March. So far, Q1 is looking positive for the 2024 social media star. This report is based on the latest Quickfire Report on companies of interest to investors from the Similarweb Stock Intelligence team. Reddit sees growth in users After the protest and boycott in June 2023, the response to Reddit beginning to charge for its API use, Reddit user growth is back in the black and significantly higher than the previous year. The protest by unpaid moderators pushed as many as 8,000 subreddits offline and simultaneously eliminated third-party apps, positively affecting the core platform. And, traffic in 2Q23 was higher than 1Q with 237K more visits. While there were fewer visits in June 2023, the decrease from the previous month was negligible. So far in 1Q24, user growth is outpacing 1Q23 by 19% and showing no signs of slowing. Reddit ad portal traffic surpasses TikTok’s Activity on Reddit’s ad portal, a proxy for ad deployment and revenue, also grew in 1Q24. Visits to ads.reddit.com nearly doubled from Jan. 2023 to Jan. 2024. This significant growth puts Reddit ahead of its competitors, notably TikTok. Through mid-February 2024, visits to the portal are just shy of the 459K visits achieved in 2023. The Similarweb Insights & Communications team is available to pull additional or updated data on request for the news media (journalists are invited to write to press@similarweb.com). When citing our data, please reference Similarweb as the source and link back to the most relevant blog post or similarweb.com. Contact: For more information, please write to press@similarweb.com. Report By: Andrea Pash, Investor Intelligence Specialist Methodology Disclaimer: All names, brands, trademarks, and registered trademarks are the property of their respective owners. The data, reports, and other materials provided or made available by Similarweb consist of or include estimated metrics and digital insights generated by Similarweb using its proprietary algorithms, based on information collected by Similarweb from multiple sources using its advanced data methodologies. Similarweb shall not be responsible for the accuracy of such data, reports, and materials and shall have no liability for any decision by any third party based in whole or in part on such data, reports, and materials. by David F. Carr David covers social media, digital advertising, and generative AI. With a background in web trends since the 1990s, he’s also the author of \"Social Collaboration for Dummies\". Related Topics: Social Media News This post is subject to Similarweb legal notices and disclaimers. Related Posts Insights X Rival Bluesky May Be Growing But Threads is Growing Faster Social Media News by David F. Carr 3 Min. Aug 15, 2024 Insights Reddit Blocks Bing as Google Clicks Grow Like Crazy AI News Media & Entertainment News by David F. Carr 4 Min. Jul 31, 2024 Insights Threads is One Year Old and Growing Social Media News by David F. Carr 4 Min. Jul 2, 2024 Insights Trump Trial Not Driving Truth Social Engagement Social Media News by David F. Carr 3 Min. Apr 26, 2024 Insights X Ad Portal Traffic Rebounds in Q1, up 29% YoY Social Media News by David F. Carr 2 Min. Apr 5, 2024 Insights Truth Social Stock Soars at IPO, but Digital Engagement Doesn’t Social Media News by David F. Carr 4 Min. Apr 1, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Reddit Sees Traffic Increase Ahead of Expected IPO"
    },
    {
      "level": "H2",
      "text": "Reddit sees growth in users"
    },
    {
      "level": "H2",
      "text": "Reddit ad portal traffic surpasses TikTok’s"
    },
    {
      "level": "H3",
      "text": "X Rival Bluesky May Be Growing But Threads is Growing Faster"
    },
    {
      "level": "H3",
      "text": "Reddit Blocks Bing as Google Clicks Grow Like Crazy"
    },
    {
      "level": "H3",
      "text": "Threads is One Year Old and Growing"
    },
    {
      "level": "H3",
      "text": "Trump Trial Not Driving Truth Social Engagement"
    },
    {
      "level": "H3",
      "text": "X Ad Portal Traffic Rebounds in Q1, up 29% YoY"
    },
    {
      "level": "H3",
      "text": "Truth Social Stock Soars at IPO, but Digital Engagement Doesn’t"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by David F. Carr"
}