{
  "url": "https://www.similarweb.com/blog/insights/social-media-news/reddit-post-ipo/",
  "slug": "reddit-post-ipo",
  "title": "After IPO, Reddit Continues to See Market and Online Traffic Growth | Similarweb",
  "description": "Website and ad portal traffic outpaces TikTok in year-over-year growth. Daily traffic also rose on the IPO news.",
  "content": "HomeBlogInsightsSocial Media NewsAfter IPO, Reddit Continues to See Market and Online Traffic Growth Insights After IPO, Reddit Continues to See Market and Online Traffic Growth Start your free trial by Andrea Pash , Senior Content Marketing Manager 3 Min. March 26, 2024 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Website and ad portal traffic outpaces TikTok in year-over-year growth Since Reddit IPO’d on March 21, 2024, the newly public social media company’s stock rose 30% only days after. Website and ad portal traffic continues to grow and outpace TikTok. So far in Q1 2024, reddit.com saw a 35% YoY increase in visits to the site. TikTok has only seen a 19% YoY increase in traffic. Instagram experienced growth of 7% YoY, where Facebook was down 4% YoY. Traffic to the ad portal also continues to outpace the broader social media sector. In Q1 2024 to date, ads.reddit.com has seen 44% YoY growth to the portal, a proxy for ad deployment. In comparison, ads.tiktok.com has only seen 29% YoY growth, Twitter is down 29%, and Snapchat is down 28% YoY. Reddit’s app sees monthly active user growth While Reddit has the lowest estimated monthly active users (MAUs) at 72M vs. group average of 128M, they were the only company the averaged positive growth. Reddit saw a 3% increase vs. group average of -5%. Notably, X experienced the most decline at -8%, while Facebook experienced the least amount of decline at -3%. Similar to the story with MAUs, Reddit has the lowest number of daily active users (DAUs) as well with only 29M vs. the group average of 75M. This could be due to the fact that Reddit historically has focused on the web vs. mobile. Reddit takes the youth vote Reddit has the largest percentage of users aged 18 to 34 at 66% over the last month. X users between the ages of 18-34 stands at 59% and TikTok at 53%. Reddit has the lowest percentage of users in the other two age groups: 25% of ages 35 to 54 and 8% of 55+. Facebook has the highest percentage of users in these other two age groups at 37% of ages 35-54 and 21% of 55+. Given the importance of the 18 to 34 age group, here’s a glance at the age distribution in the sector over the last 10 months. Reddit’s percentage declined slightly, going from 68% to 67%. Notably, X’s and Instagram’s percentages increased slightly, about 1%. The Similarweb Insights & Communications team is available to pull additional or updated data on request for the news media (journalists are invited to write to press@similarweb.com). When citing our data, please reference Similarweb as the source and link back to the most relevant blog post or similarweb.com. Methodology Disclaimer: All names, brands, trademarks, and registered trademarks are the property of their respective owners. The data, reports, and other materials provided or made available by Similarweb consist of or include estimated metrics and digital insights generated by Similarweb using its proprietary algorithms, based on information collected by Similarweb from multiple sources using its advanced data methodologies. Similarweb shall not be responsible for the accuracy of such data, reports, and materials and shall have no liability for any decision by any third party based in whole or in part on such data, reports, and materials. by Andrea Pash Senior Content Marketing Manager Andrea, with her extensive marketing background and 15+ years in finance, pulls insight and crafts content for Stock Intelligence & DaaS at Similarweb. A UC Irvine grad, she's a concert lover and avid traveler. Related Topics: Social Media News This post is subject to Similarweb legal notices and disclaimers. Related Posts Insights X Rival Bluesky May Be Growing But Threads is Growing Faster Social Media News by David F. Carr 3 Min. Aug 15, 2024 Insights Reddit Blocks Bing as Google Clicks Grow Like Crazy AI News Media & Entertainment News by David F. Carr 4 Min. Jul 31, 2024 Insights Threads is One Year Old and Growing Social Media News by David F. Carr 4 Min. Jul 2, 2024 Insights Trump Trial Not Driving Truth Social Engagement Social Media News by David F. Carr 3 Min. Apr 26, 2024 Insights X Ad Portal Traffic Rebounds in Q1, up 29% YoY Social Media News by David F. Carr 2 Min. Apr 5, 2024 Insights Truth Social Stock Soars at IPO, but Digital Engagement Doesn’t Social Media News by David F. Carr 4 Min. Apr 1, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "After IPO, Reddit Continues to See Market and Online Traffic Growth"
    },
    {
      "level": "H2",
      "text": "Website and ad portal traffic outpaces TikTok in year-over-year growth"
    },
    {
      "level": "H2",
      "text": "Reddit’s app sees monthly active user growth"
    },
    {
      "level": "H2",
      "text": "Reddit takes the youth vote"
    },
    {
      "level": "H3",
      "text": "X Rival Bluesky May Be Growing But Threads is Growing Faster"
    },
    {
      "level": "H3",
      "text": "Reddit Blocks Bing as Google Clicks Grow Like Crazy"
    },
    {
      "level": "H3",
      "text": "Threads is One Year Old and Growing"
    },
    {
      "level": "H3",
      "text": "Trump Trial Not Driving Truth Social Engagement"
    },
    {
      "level": "H3",
      "text": "X Ad Portal Traffic Rebounds in Q1, up 29% YoY"
    },
    {
      "level": "H3",
      "text": "Truth Social Stock Soars at IPO, but Digital Engagement Doesn’t"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Andrea Pash"
}