{
  "url": "https://www.similarweb.com/blog/insights/social-media-news/threads/",
  "slug": "threads",
  "title": "First Look: Threads App Engagement | Similarweb",
  "description": "Mark Zuckerberg claimed 70 million downloads by Thursday, following a launch Wednesday night. We detected nearly 42 million active users on Android alone.",
  "content": "HomeBlogInsightsSocial Media NewsFirst Look: Threads App Engagement Insights First Look: Threads App Engagement Start your free trial by David F. Carr 3 Min. July 9, 2023 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Meta claimed 70 million downloads a day after launch. By Friday, we detected 49 million active users on Android alone When Meta Platforms CEO Mark Zuckerberg announced the explosive growth of Twitter competitor Threads – 30 million downloads in the first hours after a Wednesday night launch and 70 million after the first full day of operation – at first, we had to take his word for it. However, we now have the first estimates based on Similarweb’s independent data model, and they look consistent with Zuckerberg’s claims. Key takeaways On Thursday, July 6, Threads app had 41.79 million daily active users on Android alone, according to Similarweb estimates. By Friday, it was up to 49.3 million. We’re still working on an official estimate for iOS, calibrated to Similarweb’s new apps data model that will be released in the coming weeks. Based on the worldwide ratio of Android to iOS users for Instagram, a close sibling to Threads, we would expect the total number of active users to be at least 65 million people who not only downloaded the app but were actively using it by Friday. The threads.net website, which mostly serves to redirect new users to the Google and Apple mobile app stores, attracted 15.7 million visitors on June 6. Meta promoted that site in a corporate announcement, but many new users bypassed it and signed up via an app store, using their existing Instagram login. In the first two full days that Threads was generally available, Thursday and Friday, web traffic to twitter.com was down 5% compared with the same days of the previous week. As a year-over-year comparison, it was down 11% compared with July 6 and 7, 2022. Twitter traffic has experienced an overall decline even in the absence of Threads and was down 4% year-over-year in June. In a bad sign for app user loyalty, Twitter user retention has also declined. On Android, the percentage of new users who are continuing to regularly use the Twitter app after 30 days has dropped from 19% in May 2022 to 16% in May 2023. In contrast, the loyalty of new Instagram users has held steady at about 40%. Threads is far outpacing other Twitter-like social networks that have also grown recently, tapping into discontent with Twitter (see Twitter Rate Limits Boost Competing Apps and Websites). Android usage explodes The only mobile app data we’re ready to share so far is for Android, which probably represents less than half of the total mobile app activity, and shows 41.79 million users were already active on Threads by Thursday. Landing page traffic growth Though it only represents a fraction of the signup activity, the threads.net landing page also showed rapid traffic growth. More to come We will update these numbers in the days to come to show how well user engagement holds up. While Threads is tapping into the demand for an easy-to-use Twitter alternative, it lacks some basic features like hashtags and topical search. The question is: will users care? Or will they happily embrace a text-based social network already populated by all their Instagram contacts? The Similarweb Insights & Communications team is available to pull additional or updated data on request for the news media (journalists are invited to write to press@similarweb.com). When citing our data, please reference Similarweb as the source and link back to the most relevant blog post or similarweb.com/blog/insights/. Contact: For more information, please write to press@similarweb.com. Report By: David F. Carr, Senior Insights Manager Methodology Disclaimer: All names, brands, trademarks, and registered trademarks are the property of their respective owners. The data, reports, and other materials provided or made available by Similarweb consist of or include estimated metrics and digital insights generated by Similarweb using its proprietary algorithms, based on information collected by Similarweb from multiple sources using its advanced data methodologies. Similarweb shall not be responsible for the accuracy of such data, reports, and materials and shall have no liability for any decision by any third party based in whole or in part on such data, reports, and materials. by David F. Carr David covers social media, digital advertising, and generative AI. With a background in web trends since the 1990s, he’s also the author of \"Social Collaboration for Dummies\". Related Topics: Social Media News This post is subject to Similarweb legal notices and disclaimers. Related Posts Insights X Rival Bluesky May Be Growing But Threads is Growing Faster Social Media News by David F. Carr 3 Min. Aug 15, 2024 Insights Reddit Blocks Bing as Google Clicks Grow Like Crazy AI News Media & Entertainment News by David F. Carr 4 Min. Jul 31, 2024 Insights Threads is One Year Old and Growing Social Media News by David F. Carr 4 Min. Jul 2, 2024 Insights Trump Trial Not Driving Truth Social Engagement Social Media News by David F. Carr 3 Min. Apr 26, 2024 Insights X Ad Portal Traffic Rebounds in Q1, up 29% YoY Social Media News by David F. Carr 2 Min. Apr 5, 2024 Insights Truth Social Stock Soars at IPO, but Digital Engagement Doesn’t Social Media News by David F. Carr 4 Min. Apr 1, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "First Look: Threads App Engagement"
    },
    {
      "level": "H2",
      "text": "Meta claimed 70 million downloads a day after launch. By Friday, we detected 49 million active users on Android alone"
    },
    {
      "level": "H2",
      "text": "Key takeaways"
    },
    {
      "level": "H2",
      "text": "Android usage explodes"
    },
    {
      "level": "H2",
      "text": "Landing page traffic growth"
    },
    {
      "level": "H2",
      "text": "More to come"
    },
    {
      "level": "H3",
      "text": "X Rival Bluesky May Be Growing But Threads is Growing Faster"
    },
    {
      "level": "H3",
      "text": "Reddit Blocks Bing as Google Clicks Grow Like Crazy"
    },
    {
      "level": "H3",
      "text": "Threads is One Year Old and Growing"
    },
    {
      "level": "H3",
      "text": "Trump Trial Not Driving Truth Social Engagement"
    },
    {
      "level": "H3",
      "text": "X Ad Portal Traffic Rebounds in Q1, up 29% YoY"
    },
    {
      "level": "H3",
      "text": "Truth Social Stock Soars at IPO, but Digital Engagement Doesn’t"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by David F. Carr"
}