{
  "url": "https://www.similarweb.com/blog/insights/social-media-news/threads-first-month/",
  "slug": "threads-first-month",
  "title": "Threads App Usage Down 79% After a Month | Similarweb",
  "description": "Even in the US, where engagement was initially higher, time spent with the app is down 85% from the initial buzz of the launch. Enter and learn more!",
  "content": "HomeBlogInsightsSocial Media NewsThreads App Usage Down 79% After a Month Insights Threads App Usage Down 79% After a Month Start your free trial by David F. Carr 3 Min. August 10, 2023 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Even in the US, where engagement was initially higher, time spent with the app is down 85% from the initial buzz of the launch The initial rush of excitement did not last long for Threads, the Meta Platform’s answer to the app formerly known as Twitter. Threads had a huge launch at the beginning of July, fueled by the near-instant onboarding of Instagram users to the new text-based social app. However, the boom in active users of Threads didn’t last. The app’s active user count boomed in the first couple of days when new users were busy checking out the app and seeing who else was on it, but that faded fast. We’ve been tracking Threads usage based on estimates for Android, the mobile app platform for which we have the most detailed data. Web usage is not yet a significant part of the Threads story, since so far the Threads website is read-only. Key takeaways The Threads Android app peaked at 49.3 million daily active users worldwide on July 7, according to Similarweb estimates. But on August 7, the app was down to 10.3 million daily active users. In the US, peak usage for Threads was 2.3 million daily active users on July 7, compared with about 576,000 as of August 7. The average amount of time daily active users spent with the app started out at about 14 minutes, worldwide, but was significantly higher in the US: nearly 21 minutes on July 7. By August 7, that was down to 3 minutes. For comparison, X (formerly Twitter) has more than 100 million daily active users on Android alone, and they consistently spend about 25 minutes per day on it. None of these statistics mean Threads will not eventually succeed, only that its “overnight success” was too good to be true. The user count boomed, then dropped fast Here is what the rise and fall of Threads looks like to date, compared with X (formerly Twitter). After briefly rivaling X in time spent, Threads has lost user attention In the US, Threads captured nearly as much active user time as X (formerly Twitter) at launch but has since fallen far behind. Although Twitter refugees might appreciate Threads for its comparative lack of unnecessary drama, Threads is also missing much of the intriguing content that keeps X users coming back – if only to read and comment on each other’s posts critical of X owner Elon Musk. The not-Twitter social network still needs to find its footing Threads arrived on the scene during the latest flurry of controversies at Twitter, which had not yet rebranded itself as X but had annoyed active users with rate limits on posts, giving them extra incentive to look at an alternative. Threads may still have a better chance of becoming “the new Twitter” than some other alternatives, but it needs to provide its users with more reasons to keep coming back. The Similarweb Insights & Communications team is available to pull additional or updated data on request for the news media (journalists are invited to write to press@similarweb.com). When citing our data, please reference Similarweb as the source and link back to the most relevant blog post or similarweb.com/blog/insights/. Contact: For more information, please write to press@similarweb.com. Report By: David F. Carr, Senior Insights Manager Methodology Disclaimer: All names, brands, trademarks, and registered trademarks are the property of their respective owners. The data, reports, and other materials provided or made available by Similarweb consist of or include estimated metrics and digital insights generated by Similarweb using its proprietary algorithms, based on information collected by Similarweb from multiple sources using its advanced data methodologies. Similarweb shall not be responsible for the accuracy of such data, reports, and materials and shall have no liability for any decision by any third party based in whole or in part on such data, reports, and materials. Photo by frank mckenna on Unsplash (cropped) by David F. Carr David covers social media, digital advertising, and generative AI. With a background in web trends since the 1990s, he’s also the author of \"Social Collaboration for Dummies\". Related Topics: Social Media News This post is subject to Similarweb legal notices and disclaimers. Related Posts Insights X Rival Bluesky May Be Growing But Threads is Growing Faster Social Media News by David F. Carr 3 Min. Aug 15, 2024 Insights Reddit Blocks Bing as Google Clicks Grow Like Crazy AI News Media & Entertainment News by David F. Carr 4 Min. Jul 31, 2024 Insights Threads is One Year Old and Growing Social Media News by David F. Carr 4 Min. Jul 2, 2024 Insights Trump Trial Not Driving Truth Social Engagement Social Media News by David F. Carr 3 Min. Apr 26, 2024 Insights X Ad Portal Traffic Rebounds in Q1, up 29% YoY Social Media News by David F. Carr 2 Min. Apr 5, 2024 Insights Truth Social Stock Soars at IPO, but Digital Engagement Doesn’t Social Media News by David F. Carr 4 Min. Apr 1, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Threads App Usage Down 79% After a Month"
    },
    {
      "level": "H2",
      "text": "Even in the US, where engagement was initially higher, time spent with the app is down 85% from the initial buzz of the launch"
    },
    {
      "level": "H2",
      "text": "Key takeaways"
    },
    {
      "level": "H2",
      "text": "The user count boomed, then dropped fast"
    },
    {
      "level": "H2",
      "text": "After briefly rivaling X in time spent, Threads has lost user attention"
    },
    {
      "level": "H2",
      "text": "The not-Twitter social network still needs to find its footing"
    },
    {
      "level": "H3",
      "text": "X Rival Bluesky May Be Growing But Threads is Growing Faster"
    },
    {
      "level": "H3",
      "text": "Reddit Blocks Bing as Google Clicks Grow Like Crazy"
    },
    {
      "level": "H3",
      "text": "Threads is One Year Old and Growing"
    },
    {
      "level": "H3",
      "text": "Trump Trial Not Driving Truth Social Engagement"
    },
    {
      "level": "H3",
      "text": "X Ad Portal Traffic Rebounds in Q1, up 29% YoY"
    },
    {
      "level": "H3",
      "text": "Truth Social Stock Soars at IPO, but Digital Engagement Doesn’t"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by David F. Carr"
}