{
  "url": "https://www.similarweb.com/blog/insights/social-media-news/twitter-rate-limit/",
  "slug": "twitter-rate-limit",
  "title": "Twitter Rate Limits Boost Competing Apps and Websites | Similarweb",
  "description": "Twitter access limits and performance problems drove engagement with Spill, Bluesky, Mastodon, and others - Read the latest analysis here",
  "content": "HomeBlogInsightsSocial Media NewsTwitter Rate Limits Boost Competing Apps and Websites Insights Twitter Rate Limits Boost Competing Apps and Websites Start your free trial by David F. Carr 5 Min. July 5, 2023 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Twitter access limits and performance problems drove engagement with Spill, Bluesky, Mastodon, and others — while Threads is waiting in the wings Twitter began turning away some of the most active visitors to its website this weekend, telling them they were viewing too many tweets too quickly. Framed as a way to limit access by data-sucking AI bots, the move gave users a reason to try or revisit alternatives. Bluesky, the still invite-only social app from Twitter founder Jack Dorsey, got a big boost, but so did Spill and Post.News. People rediscovered Mastodon, the distributed, open-source social network, although the surge in traffic it attracted didn’t quite equal what it enjoyed during the original “Twitter migration” after Elon Musk took over as Twitter’s owner. Threads, the Twitter-like app from Meta Platforms that will be a kissing cousin to Facebook and Instagram that launched on July 5, could have a much bigger impact because anyone with an Instagram account can enroll in threads instantly (we will provide data on the impact of Threads as soon as it becomes available). We took a 360-degree digital look at the impact of these developments, taking advantage of an improved iOS app data model that will be released to Similarweb users in the coming weeks, rounding out a platform that also includes Android app data and our renowned web traffic and engagement metrics. Key takeaways Bluesky’s iOS app had about 240,000 daily users on Saturday, a recent peak, up from less than 100,000 the day before, according to Similarweb estimates for the US. Meanwhile, its waiting list signup website, bsky.app, topped 750,000 daily visits on Saturday and Sunday, up from under 100,000 in the days prior. Spill, another pre-launch contender, got more daily unique visitors, nearly 52,000, to its website, spill.com, than any of the other Twitter competitors discussed here – even though it’s still just a waitlist website. Spill has been promising to foster a more diverse community than Twitter. On Sunday, traffic to mastodon.social, the flagship website of Mastodon’s distributed social network was up 18% compared to an average day over the last month. Mastodon is a little more complex to sign up for than a commercial rival and previously wasn’t able to sustain the surge in usage it saw in the Fall. By total traffic, Spill and Post.News, which particularly appeals to journalists and news junkies, were relatively close behind Mastodon. On Sunday, mastodon.social got about 75,000 daily visits while Spill and Post.News got about 62,500. But that compares to over 42 million visits for Twitter, despite its issues. Musk, who recently hired a new CEO for the company but continues to oversee its engineering, announced limits on Twitter access as necessary to address “extreme levels of data scraping & system manipulation,” which many took as a reference to visits by data-hungry bots like ChatGPT. The limits particularly apply to new accounts and users without a Twitter Blue subscription. Many commentators speculated that the real cause of the slowdown was an engineering failure possibly related to unpaid cloud hosting bills, not unlike Twitter’s early struggles with system capacity that gave rise to its iconic fail whale error message. Whatever the reason, the change left many active Twitter users frustrated and angry. Bluesky has people clamoring to get in An invitation to Bluesky has been a hot ticket for months, but Twitter woes sent potential users stampeding to the waiting list signup website as well as the Bluesky corporate site. Meanwhile, Bluesky’s iOS app had the highest engagement to date, as measured by daily active users. Downloads from the Apple App Store also reflected strong interest, giving Bluesky its highest App Store ranking to date. The trend on Android is similar, with Bluesky the winner – although, to be fair, we should note that the numbers for Mastodon app shown above refer to the official Mastodon app, which is one of several apps Mastodon users use to check in with the Mastodon network. Spill wins the web Turning to the web, we see the winner is Spill with +22K unique visitors on Saturday, July 1st. In other words, some other sites got more visits (including multiple visits by the same individual), but Spill had more unique individuals checking it out. New interest in Mastodon Mastodon site administrators reported an influx of new and returning users this weekend, and we can confirm evidence of it in the traffic to mastodon.social – one of many nodes in the distributed social network but also the flagship site started by the software’s author. The traffic surge isn’t quite as big as the one Mastodon experienced when Elon Musk initially took charge at Twitter, however. Rivals gain from Twitter’s pain Whether any of these apps are destined to become “the next Twitter,” we don’t know – they’re all still tiny measured against Twitter’s scale. This could be their last moment of glory before they are eclipsed by Threads, rumored to be the name of the forthcoming social messaging platform from Meta Platforms, the owner of Facebook and Instagram, which has a lot going for it. Or, for Bluesky or Spill, the surge that started this weekend could be the beginning of a meteoric rise that will turn them into true Twitter rivals. The Similarweb Insights & Communications team is available to pull additional or updated data on request for the news media (journalists are invited to write to press@similarweb.com). When citing our data, please reference Similarweb as the source and link back to the most relevant blog post or similarweb.com/blog/insights/. Contact: For more information, please write to press@similarweb.com. Methodology Disclaimer: All names, brands, trademarks, and registered trademarks are the property of their respective owners. The data, reports, and other materials provided or made available by Similarweb consist of or include estimated metrics and digital insights generated by Similarweb using its proprietary algorithms, based on information collected by Similarweb from multiple sources using its advanced data methodologies. Similarweb shall not be responsible for the accuracy of such data, reports, and materials and shall have no liability for any decision by any third party based in whole or in part on such data, reports, and materials. by David F. Carr David covers social media, digital advertising, and generative AI. With a background in web trends since the 1990s, he’s also the author of \"Social Collaboration for Dummies\". Related Topics: Social Media News This post is subject to Similarweb legal notices and disclaimers. Related Posts Insights X Rival Bluesky May Be Growing But Threads is Growing Faster Social Media News by David F. Carr 3 Min. Aug 15, 2024 Insights Reddit Blocks Bing as Google Clicks Grow Like Crazy AI News Media & Entertainment News by David F. Carr 4 Min. Jul 31, 2024 Insights Threads is One Year Old and Growing Social Media News by David F. Carr 4 Min. Jul 2, 2024 Insights Trump Trial Not Driving Truth Social Engagement Social Media News by David F. Carr 3 Min. Apr 26, 2024 Insights X Ad Portal Traffic Rebounds in Q1, up 29% YoY Social Media News by David F. Carr 2 Min. Apr 5, 2024 Insights Truth Social Stock Soars at IPO, but Digital Engagement Doesn’t Social Media News by David F. Carr 4 Min. Apr 1, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Twitter Rate Limits Boost Competing Apps and Websites"
    },
    {
      "level": "H2",
      "text": "Twitter access limits and performance problems drove engagement with Spill, Bluesky, Mastodon, and others — while Threads is waiting in the wings"
    },
    {
      "level": "H2",
      "text": "Key takeaways"
    },
    {
      "level": "H2",
      "text": "Bluesky has people clamoring to get in"
    },
    {
      "level": "H2",
      "text": "Spill wins the web"
    },
    {
      "level": "H2",
      "text": "New interest in Mastodon"
    },
    {
      "level": "H2",
      "text": "Rivals gain from Twitter’s pain"
    },
    {
      "level": "H3",
      "text": "X Rival Bluesky May Be Growing But Threads is Growing Faster"
    },
    {
      "level": "H3",
      "text": "Reddit Blocks Bing as Google Clicks Grow Like Crazy"
    },
    {
      "level": "H3",
      "text": "Threads is One Year Old and Growing"
    },
    {
      "level": "H3",
      "text": "Trump Trial Not Driving Truth Social Engagement"
    },
    {
      "level": "H3",
      "text": "X Ad Portal Traffic Rebounds in Q1, up 29% YoY"
    },
    {
      "level": "H3",
      "text": "Truth Social Stock Soars at IPO, but Digital Engagement Doesn’t"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by David F. Carr"
}