{
  "url": "https://www.similarweb.com/blog/updates/announcements/alexa-shutting-down-similarweb-ramping-up/",
  "slug": "alexa-shutting-down-similarweb-ramping-up",
  "title": "Alexa.com Has Shut Down, Similarweb Responds | Similarweb",
  "description": "Amazon’s Alexa.com shut down, so Similarweb has stepped up with a free ranking API tool and free trial. Read on for the details.",
  "content": "HomeBlogUpdatesAnnouncementsAmazon Shut Down Alexa, Similarweb Ramped Up Updates Amazon Shut Down Alexa, Similarweb Ramped Up Register for our free API by Adelle Kehoe , Director of Content Marketing 6 Min. December 20, 2022 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Similarweb has always prided itself on being the official measure of the digital world. Now that Alexa Rank has shut down its operations as of May 2022, we pride ourselves on being the only measure of the digital world. Born 25 years ago and owned by Amazon, alexa.com was a leading global website ranking system and a competitor analysis tool with a loyal customer base. Since the Alexa shutdown, its users have been seeking alternative ways to keep up to date with digital ranking and competitor analysis. Here at Similarweb, we acted on this need by launching a new, free website ranking API tool to complement our suite of existing free tools. We also have a free trial of our complete solution available for previous alexa.com users. This article will walk you through what Alexa Rank was and how to use Similarweb to get more accurate and detailed data for your research analysis and benchmarking needs. Alexa Rank Alexa Rank was a global ranking system that used website traffic data to grade millions of websites in order of popularity; the higher the estimated website traffic was, the more popular the website and the lower the Alexa rank (low = good). It also showed you the country with the highest percentage of visitors and the website’s rank in that country. Alexa ranking compared how a website performed relative to other sites, making it a useful benchmarking tool used for competitive analysis. How did Alexa Rank work? The rank was calculated by looking at the estimated average daily unique visitors and number of page views for a given website over the previous three months. Traffic and engagement were estimated from data provided by its toolbar and gathered from internet users who use one of the browser extensions available for Google Chrome, Firefox, Internet Explorer and others. The toolbar monitored user browsing behavior, which acted as a sample of all Internet users. The Alexa ranking system was a valuable engine for comparing the performance of different websites; however, there were some question marks over the accuracy and reliability of its data. What are the alternatives: Similarweb vs. Alexa Rank At Similarweb, we believe in the power of data. And our mission is to share that data with as many people and businesses as possible. Similarweb analyzes the data of over 100 million websites, with visibility into market trends across more than 200 industries and 190 countries. You can dig into data for up to 24 months rather than three months, allowing you to spot seasonal trends and adapt to market changes. Best of all, we publish the official ranking of the digital world for everyone to see – to reveal who’s hot, who’s not, and everything in between. Demographics for 5 competing ecommerce sites, US, Dec 2020 – Nov 2022 Thousands of businesses rely on this list and can use our industry segmentation to understand where they stand in the digital world within their specific marketplaces. Even before Alexa’s shut down, the list has grown in trustworthiness and even got featured in the “Most Popular Websites” Wikipedia page. As well as this index, we offer fresh insights daily for our users. We are excited for alexa.com users to see the depth and insight in Similarweb data. With Similarweb, you can access superior data to track website performance, benchmark KPIs, and find opportunities and threats at a glance. Our data spans not only browser extensions, but we also measure traffic data for mobile web and apps. Our traffic and engagement data offers Alexa’s number of unique visitors and number of pages per visit options; however, Similarweb also gives insights into visit duration and bounce rates – offering a much more granular and comprehensive understanding of your audience. Engagement metrics for 5 competing ecommerce sites, US, Dec 2020 – Nov 2022 You can benchmark and track your competitors’ marketing channels, measure the amount of traffic they drive to their sites, and identify the keywords they use to drive that traffic. By analyzing our data on referral traffic, you can uncover which publishers and networks are the best fit for your target audiences. These are just a few of the insights you can discover using Similarweb digital data. Free ranking tools and API launch Previous Alexa users can get rank data today for free from Similarweb in three different ways: Similarweb.com – No login necessary – Key high-level ranking metrics across various channels and countries Browser extension – In-depth statistics for any website visited Our new DigitalRankTM API – Free global ranking metrics – Register your interest here Amazon has set up an AWS Data Exchange service to aid APIs in the transition from Alexa to Similarweb so that users can easily access and benefit from our comprehensive data. Our new API has our proprietary website ranking data available, which means users can track their rank against their competitors easily and for free! Free trial for enhanced digital intelligence tools Previous alexa.com users can also sign up for a free trial of our enhanced digital intelligence tools, so they can see for themselves how Similarweb delivers vs. Alexa. Free trial users will have unlimited access to Similarweb DigitalRank(TM), a market-leading ranking of website performance, in addition to Similarweb Digital Marketing and Similarweb Research Intelligence premium solutions. This tool helps users go beyond simple ranking, enabling them to uncover actionable insights that impact website traffic performance. With these solutions, users can: Make strategic decisions based on the most comprehensive, near real-time view of competitive activity across all digital marketing channels. Spot new opportunities from traffic and engagement trends as they happen and understand which audiences engage with your competitors’ websites and their industries over time. Benchmark engagement metrics and website performance cross-industry to expose competitors’ digital strategies. Analyze any marketing channel’s performance over time to make data-backed decisions on where to allocate resources and ad spend for maximum ROI. Get critical audience demographic and behavioral information, a metric missing from alexa.com, to improve targeting and user retention. Discover and prioritize keyword opportunities based on search volume, optimize traffic share per keyword, and monitor the search traffic trends. Keyword data for 5 competing ecommerce sites, US, Dec 2020 – Nov 2022 For the first time, for those who like the trial, Similarweb is launching a self-service offering that will address alexa.com users’ needs and use cases. This new offering will be available in all markets globally through a simple credit card transaction. Unrivaled digital insight Our unrivaled data sets us apart from the crowd. We gather over 10 billion digital signals per day and have over 200 data scientists to ensure we provide the most accurate and comprehensive view of the digital world. Industry heavyweight Rand Fishkin (Co-Founder and CEO of SparkToro) has said of our data: “Similarweb’s data is, without a doubt, the most robust and accurate information available about what’s happening online. “I’ve used their numbers in multiple research projects and market analyses, both public and internal, and wouldn’t rely on anything else (because I’ve run the comparisons!). If you need superb, trustworthy data on where people go and what they do on the web, Similarweb has the scale and quality to deliver.” Above is a graph displaying some of the findings from Rand Fishkin’s independent study. Looking forward “Similarweb has always been a leader in terms of the data our users get and the quality and accuracy our insights provide,” said Or Offer, CEO and Founder of Similarweb, “Although it’s a bittersweet moment with the closing of Alexa.com, I’m excited for the opportunity it presents to expand our reach even further as we become the standard for digital rankings and global website intelligence.” Similarweb’s free trial is available now. We look forward to helping more people and businesses use digital intelligence to win their markets. If you’d like to read more about how Alexa and Similarweb stack up as platforms, read our Similarweb vs. Alexa in-depth guide. by Adelle Kehoe Director of Content Marketing Adelle is passionate about content and has a strong background in content creation, SEO, and marketing. She has helped companies of all sizes enhance their online presence. Related Topics: Announcements This post is subject to Similarweb legal notices and disclaimers. Related Posts Updates Similarweb Product Updates: The September 2024 Edition Product Updates by Adelle Kehoe 2 Min. Oct 14, 2024 Updates Introducing Similarweb Google Looker Studio Connectors: Easy Access to Data at Scale Announcements by Pavel Dimshiz 6 Min. Oct 1, 2024 Updates New Data Version: The Best Digital Data Just Got Better Announcements by Ron Asher 4 Min. Sep 24, 2024 Updates Similarweb Product Updates: The August 2024 Edition Product Updates by Adelle Kehoe 3 Min. Sep 11, 2024 Updates Similarweb Rank Tracker Now Tracks Google’s AI Overviews Product Updates by Shay Harel 2 Min. Aug 19, 2024 Updates Similarweb Product Updates: The July 2024 Edition Product Updates by Adelle Kehoe 3 Min. Aug 12, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Amazon Shut Down Alexa, Similarweb Ramped Up"
    },
    {
      "level": "H2",
      "text": "Alexa Rank"
    },
    {
      "level": "H3",
      "text": "How did Alexa Rank work?"
    },
    {
      "level": "H2",
      "text": "What are the alternatives: Similarweb vs. Alexa Rank"
    },
    {
      "level": "H2",
      "text": "Free ranking tools and API launch"
    },
    {
      "level": "H2",
      "text": "Free trial for enhanced digital intelligence tools"
    },
    {
      "level": "H2",
      "text": "Unrivaled digital insight"
    },
    {
      "level": "H2",
      "text": "Looking forward"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The September 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Introducing Similarweb Google Looker Studio Connectors: Easy Access to Data at Scale"
    },
    {
      "level": "H3",
      "text": "New Data Version: The Best Digital Data Just Got Better"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The August 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Similarweb Rank Tracker Now Tracks Google’s AI Overviews"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The July 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Adelle Kehoe"
}