{
  "url": "https://www.similarweb.com/blog/updates/announcements/similarweb-expand-apac/",
  "slug": "similarweb-expand-apac",
  "title": "Similarweb Celebrates New Offices in Australia | Similarweb",
  "description": "Similarweb is coming down under! We are proud to announce the opening of our new Sydney, Australia offices, thus expanding our operations throughout APAC",
  "content": "HomeBlogUpdatesAnnouncementsNews: Similarweb expands APAC presence with office in Australia Updates News: Similarweb expands APAC presence with office in Australia Start your free trial by Ilana Marks , Marketing Insights Manager, Similarweb 2 Min. September 15, 2020 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic The time has come to bring Similarweb down under. To increase the company’s market penetration in the region, and fuel the company’s international growth across key markets, we have opened an office in Sydney, Australia. This establishes a hub for our existing representation in Auckland and Melbourne, enabling us to support our customers throughout the region including Woolworths, Arnott’s, Australia Post, Tourism New Zealand, Countdown, Super Retail Group, and Big W and many more. With billions of people around the world in and out of lockdown over the last few months, consumer behavior is changing. The new office opening reflects an increasing demand for our solution globally in a time where online activity is booming. In Australia & New Zealand alone, the company grew its customer base by 110% this year. “Companies can no longer just count on their historical data to drive strategic decisions and planning,” says Carrie Lazorchak, Chief Revenue Officer at Similarweb. “Having access to real time data around consumer and market trends is more relevant now than ever — and as demand for our product increases around the world, we look forward to growing our team and to continued success in this key market.” Similarweb’s Australia-based team will join the company’s nearly 600 employees spread across other strategically positioned office locations, including Tel Aviv, New York, San Francisco, Japan, Paris, London, and most recently added, Burlington, Massachusetts. The new office operations will be led by Emmanuel Heymann, Area Vice President for Australia, New Zealand, and Southeast Asia. “In these difficult times, we are grateful to have opened this office with no delay,” said Heymann, “consequently playing an active role in the region’s recovery by helping companies make better data-driven decisions, and to optimize their digital strategies post-pandemic.” This has been the case for many companies, including Similarweb client Tourism New Zealand. “Similarweb enhanced our understanding of the New Zealand online travel and tourism landscape,” says Sarah Britton, Global Manager Digital Analytics at Tourism New Zealand. “Border closures following the global COVID-19 outbreak meant we had to adapt our digital strategy quickly to focus on a new audience. Similarweb insights helped us to rapidly shift our focus to domestic travellers and support local tourism operators. The platform made it very easy to tailor our messaging, identify content gaps, and uncover partnership opportunities.” Guided by a commitment to provide the most reliable data, our proprietary technology aggregates hundreds of sources which is then coupled with advanced machine learning algorithms to understand digital activity through estimations on over 80M websites and 3M apps in over 190 countries. We are thrilled to continue our growth efforts and offer impactful solutions to businesses worldwide. Where do you think we should go next? by Ilana Marks Marketing Insights Manager, Similarweb Ilana is a Marketing Insights Manager at Similarweb, and loves Breaking Bad, bagels, and interpreting data. Related Topics: Announcements This post is subject to Similarweb legal notices and disclaimers. Related Posts Updates Similarweb Product Updates: The September 2024 Edition Product Updates by Adelle Kehoe 2 Min. Oct 14, 2024 Updates Introducing Similarweb Google Looker Studio Connectors: Easy Access to Data at Scale Announcements by Pavel Dimshiz 6 Min. Oct 1, 2024 Updates New Data Version: The Best Digital Data Just Got Better Announcements by Ron Asher 4 Min. Sep 24, 2024 Updates Similarweb Product Updates: The August 2024 Edition Product Updates by Adelle Kehoe 3 Min. Sep 11, 2024 Updates Similarweb Rank Tracker Now Tracks Google’s AI Overviews Product Updates by Shay Harel 2 Min. Aug 19, 2024 Updates Similarweb Product Updates: The July 2024 Edition Product Updates by Adelle Kehoe 3 Min. Aug 12, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "News: Similarweb expands APAC presence with office in Australia"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The September 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Introducing Similarweb Google Looker Studio Connectors: Easy Access to Data at Scale"
    },
    {
      "level": "H3",
      "text": "New Data Version: The Best Digital Data Just Got Better"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The August 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Similarweb Rank Tracker Now Tracks Google’s AI Overviews"
    },
    {
      "level": "H3",
      "text": "Similarweb Product Updates: The July 2024 Edition"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Ilana Marks"
}