{
  "url": "https://www.similarweb.com/blog/ecommerce/retail-insights/amazons-affiliate-rates/",
  "slug": "amazons-affiliate-rates",
  "title": "Amazon Affiliate Rates Cut - What Does It Mean? | Similarweb",
  "description": "An analysis of the implications and opportunities that arise from the world's largest online retailer plan to cut affiliate spending.",
  "content": "HomeBlogEcommerceRetail InsightsWhat Does Amazon’s Plan to Cut Affiliate Rates Mean for Competitors? Ecommerce Intelligence What Does Amazon’s Plan to Cut Affiliate Rates Mean for Competitors? Start your free trial by Similarweb 2 Min. April 15, 2020 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic On April 14th, CNBC reported that the world’s biggest online retailer had informed members of its affiliate program, known as Amazon Associates, that it will cut commission rates, starting on April 21st. Amazon’s affiliate program, which allows members to link to products on the site in exchange for a share of the transaction, is an engine that has allowed the retailer to grow in highly competitive categories. Cuts are in the commission range by category, but some sites are likely to see a more than 50% drop in the payout. This move is likely related to the current surge in demand for Amazon products due to COVID-19, which means that there is little reason for the retailer to pay for traffic that is already coming to its website. The news follows a recent decision by Amazon to pull back on paid search advertising by as much as 90%. It could have a significant impact on the publishing industry, which has relied on commissions to supplement the loss of advertising revenue. Let’s take a closer look at the effects. Referrals – defined as incoming traffic from sites that provide links to online stores – are considered the best-performing source of traffic for eCommerce retailers. In Q1 2020, referrals were the third-largest traffic driver to amazon.com, behind Direct and Organic Search. Traffic from referral sources increased by 15% from February to March, outpacing total site traffic growth (12%). When removing redirects from Amazon-owned sites (e.g., IMDb, Audible, Prime Video), coupon/rebates and news/media sites refer the most traffic, combining to represent 11% of affiliate traffic. Sites selling computer electronics software hardware, video games, consoles, and accessories, are another important source of traffic, collectively responsible for 6% of traffic. Slickdeals, DealNews, Yahoo!, and The Wirecutter are some of the top referring sites to Amazon. Double-clicking into slickdeals.net more closely reveals that MoM traffic grew 10%, and Amazon represented 22% of their outgoing traffic. Homedepot.com was the second-highest retailer, capturing only 12% of Slickdeals’ traffic. Similarly, thewirecutter.com more than doubled its share since January and sent 46% of its outgoing traffic to Amazon in Q1 2020. The dependency on Amazon creates a potential challenge for The New York Times-owned review and advice publication, yet also presents other consumer electronics retailers and brands with a chance to grow their market share. Leveraging affiliate marketing is a powerful medium to help drive conversion, as consumers are showing high intent and are already educated about the product category. When evaluating the top five Amazon categories by product views (Electronics, Health & Household, Home & Kitchen, Clothing, and Sports & Outdoors), we see that affiliates are consistently the third most efficient channel for driving conversion, trailing only direct and email. On average, 14% of consumers who enter these categories through an affiliate convert within the same session. (Check out our blog post on the power and potential of affiliate marketing). As Amazon counts on its brand awareness to help drive traffic and transactions through the pandemic and relies less on paid search and affiliates, it creates an opportunity for others to fill the void. eBay and Target are two mega-retailers that are becoming more aggressive in categories where Amazon is relenting. Publishers, retailers, and consumer companies need to promote an agile and proactive acquisition strategy to navigate these turbulent times. Leveraging Similarweb’s competitive intelligence tools for advanced market research – and specifically Segment Analysis and Funnel Analysis – can be a key input in helping companies to drive greater visibility and enable faster better-informed decision-making. by Similarweb Related Topics: Retail Insights This post is subject to Similarweb legal notices and disclaimers. Related Posts Ecommerce Intelligence How to Increase Sales on Amazon: 19 Strategies Amazon Insights by James Quilter 16 Min. Sep 12, 2024 Ecommerce Intelligence Retail Media Demystified: Your Path to Ecommerce Success Retail Insights by James Quilter 13 Min. Aug 1, 2024 Insights Spring Sends US Shoppers Searching for All Things Outdoors on Amazon Amazon Insights Ecommerce News by Andrea Pash 3 Min. Apr 23, 2024 Research Intelligence How to Capitalize on Micro Consumer Demand Even in Challenging Times Audience & Brand Building Business Benchmarking by Shelly Skandrani 10 Min. Dec 17, 2023 Marketing Intelligence 9 Black Friday Marketing Strategies You Want To Try Content Marketing Marketing Strategy by Leah Messenger 10 Min. Nov 12, 2023 Ecommerce Intelligence Nike Digital DTC vs Wholesale – Finding the Omnichannel Balance Retail Insights by Sneha Pandey 5 Min. Jun 30, 2023 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "What Does Amazon’s Plan to Cut Affiliate Rates Mean for Competitors?"
    },
    {
      "level": "H3",
      "text": "How to Increase Sales on Amazon: 19 Strategies"
    },
    {
      "level": "H3",
      "text": "Retail Media Demystified: Your Path to Ecommerce Success"
    },
    {
      "level": "H3",
      "text": "Spring Sends US Shoppers Searching for All Things Outdoors on Amazon"
    },
    {
      "level": "H3",
      "text": "How to Capitalize on Micro Consumer Demand Even in Challenging Times"
    },
    {
      "level": "H3",
      "text": "9 Black Friday Marketing Strategies You Want To Try"
    },
    {
      "level": "H3",
      "text": "Nike Digital DTC vs Wholesale – Finding the Omnichannel Balance"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Similarweb"
}