{
  "url": "https://www.similarweb.com/blog/ecommerce/retail-insights/crocs-explained/",
  "slug": "crocs-explained",
  "title": "Are Crocs Cool? 4 Tips to Learn From the Brand | Similarweb",
  "description": "Are Crocs cool? Yes! We uncover the brand's winning, digital strategies to sell more using D2C and marketplace channels so you can boost your performance",
  "content": "HomeBlogEcommerceRetail InsightsCrocs' Cool Factor Explained [+4 Tips to Get Brands the Same Effect] Ecommerce Intelligence Crocs’ Cool Factor Explained [+4 Tips to Get Brands the Same Effect] Schedule a demo by Emily Hunt , Market Research & eCommerce Specialist 5 Min. July 19, 2021 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic When Victoria Beckham, AKA “Posh Spice,” posted lilac Crocs on her Instagram account, the clunky rubber clog had truly entered high fashion. Although Posh ultimately listened to fans and decided not to wear the shoes, she graciously thanked Justin Bieber for the gift. This social media spotlight on Crocs shows that Crocs are in style in 2021 and are here to stay (for a long while, crocodile), and there are some lessons brands can learn from this practical-turned-cool shoe. To help, we’ll use our eCommerce tools (Research and Shopper Intelligence) to explore Crocs’ success, understand why Crocs are so popular, and give tips for your brand to capitalize on Crocs’ lessons. 1. Hip hop into a collaboration to become a Crocs fashion trend Crocs’ collaboration with Justin Bieber is likely one reason Victoria Beckham received the gift from the pop star. Overall, affiliation with music sensations has been a starring strategy for the rubber clog. In 2018, rapper Post Malone designed his own shoe for Crocs. Then, crocs.com teamed up with Latin pop star Bad Bunny and singer Justin Bieber – both collections sold out in minutes. Though Bieber did his first collaboration in October 2020, he started a new one with his fashion line, House of Drew in March 2021, Crocs X. Today’s trending search terms show the lasting impact of these high-profile partnerships. Despite work with some singers starting nearly four years ago, this summer (June 2021), three out of the top ten organic, Crocs-related keywords in the U.S. link to celebrities. These include: “Diplo Crocs” (ranked second): a sold-out collaboration with Grammy winner DJ and songwriter Diplo. “Post Malone Crocs” (ranked sixth) “Bad Bunny Crocs” (ranked tenth) Successful collaborations reflect trends of other shoe brands teaming up with hip-hop stars in the U.S. in Late spring (May – June 2021), “Yeezy” ranked the top, trending, and newly discovered keyword for the fashion and apparel industry. The term refers to the line of sneakers Adidas produced with hip-hop titan Kanye West. Adidas.com gets the most traffic share for the term, yet, once users arrive on web pages it’s sold out. This is similar to Crocs. Takeaways Hip-hop stars have the 24-carat touch to turn kicks into cool. Ironically, Crocs originally started as a boat shoe, worn by nurses, chefs, and others seeking comfort while working. Although it had bursts of popularity in the ‘90s and ‘00s, it hopped to higher levels once it collaborated with Post Malone, Bieber, Bad Bunny, Diplo, and others. Adidas and Kanye — together, “Yeezy” parallel this shoe business trend If you don’t have the budget to partner with a star, there are other ways you can emulate popular Crocs’ hot moves: Monitor collaborations with top digital brands: Your competitors are most important! See if you can start integrating related keywords before others take notice. (Check out our business benchmarking offering for more on this). Emphasize exclusivity for the ultimate cool: In line with the velvet rope theory, shoppers want what they can’t have! Crocs’ celebrity collections all stress “limited” or “exclusive.” You can do the same in your product messaging. No pop star? No worries. Maybe your brand uses “limited edition” material or is just offered for a “short period of time.” (if the limited offering is a success, extend it). 2. Don’t doubt the digital retail master Crocs captures the most organic traffic share for all search terms containing “croc,” despite large third-party sites also carrying its trending products. Conversely, as a third-party (3P) seller on some of these sites, Crocs also scored big. According to Shopper Intelligence data, “crocs” is the most clicked on-site search term across all Amazon categories. Croc’s brand captured nearly 97% of all searches in June 2021 (U.S. desktop and mobile devices). In June search volume was up 93% and clicks were up 156% from May 2020, showing growth over the pandemic, then, as people return to “normal.” Crocs were the number one keyword with the most search volume during the recent Amazon Prime Day (June 2021). The brand also captures nearly 100% of the organic search traffic for “Crocs” and terms related to it, including “Crock.” Takeaways Rather than bid on branded terms in which the brand has a Croc-nopoly, competing brands should consider more generic keywords, like “clogs” or “waterproof shoe.” Or, bid on branded terms that are just behind “Crocs” for search volume (before). Right now, “Birkenstock” may be a strong choice. It is the only other brand to make the top 15 onsite search terms for Amazon’s clothes and jewelry category. Birkenstock is the fourth most-searched term for the subcategory women’s shoes – mules/clogs category, over the past six months. 3. Consumers crave comfort and waterproof material The style of trending Crocs in 2021 reflects consumers’ call for comfort, which was further magnified by the booming popularity of athleisure due to COVID-19 stay-home orders. However, given other trending searches and shopper overlap, it’s clear that shoe shoppers still want comfort (waterproofed, if possible) now. Birkenstock’s popularity on Amazon reflects this podiatric craving, as do the top brands consumers cross-shopped for on Amazon including Teva and Clarks. “Watershoes” is fourth on Amazon over the past six months. Crocs’ clog is also waterproof. Takeaway Brands can emphasize comfort, durability, and versatility in their product messaging. They can also bid on related keyword terms, such as waterproof. 4. Adjust per the pandemic Onset When the pandemic hit, organic traffic to crocs.com exploded – up 128% in March 2020, then 229% in April 2020 (U.S. desktop devices). Though more online shopping and consumers seeking comfort, helped make Crocs popular again, Crocs effectively adjusted its marketing strategy to reflect the pandemic era. See below how organic traffic to crocs.com grew dramatically at the onset of the pandemic Strategically, its paid strategy harkened back to its earlier use case – shoes for nurses. The brand invested in healthcare-related keywords to emphasize essential workers. In April 2020, traffic for “Crocs for Nurses,” the third top-paid keyword, rose nearly 1300%! The seventh, eighth, and ninth most popular keywords were “crocs for healthcare,” “crocs for healthcare workers” (+53%), and “Crocs healthcare shoes” (+47%). Recovery and return to stores Today, Crocs has downsized its healthcare-keyword-related investments instead of recognizing that many consumers are vaccinated and returning to in-store shopping. In June 2021, zero health-related works ranked among the top paid terms. Instead, “crocs outlet” and “crocs store” rank fifth and sixth following purely branded terms (Croc/Crock).” “Crocs store” was the second top trending paid keyword behind Crocs, up 23% in June. Reflecting its successful pivot, in June, Crocs.com captured the most website traffic for “where to buy crocs,” the top search query. It also captured the most traffic share for top trending terms that month related to in-store shopping, “crocs store” the third trending term for June on crocs.com, and “what stores sell Crocs?” (ranked ninth). Conclusion Though the rise of online shopping helped propel Crocs’ sales growth during the pandemic, increasing online sales by 75.3% in the first quarter, we are confident that its celeb associations, versatility, and marketing strategies mean it’s here for the long run, even as consumers return to stores and transition from athleisure. Get your own insights To get your own digital retail and CPG insights, sign up for a demo of our eCommerce Intelligence solutions. by Emily Hunt Market Research & eCommerce Specialist Emily writes about digital retail, CPG, travel, and consumer finance, with a background in business development and marketing. Related Topics: Retail Insights This post is subject to Similarweb legal notices and disclaimers. Related Posts Ecommerce Intelligence How to Increase Sales on Amazon: 19 Strategies Amazon Insights by James Quilter 16 Min. Sep 12, 2024 Ecommerce Intelligence Retail Media Demystified: Your Path to Ecommerce Success Retail Insights by James Quilter 13 Min. Aug 1, 2024 Insights Spring Sends US Shoppers Searching for All Things Outdoors on Amazon Amazon Insights Ecommerce News by Andrea Pash 3 Min. Apr 23, 2024 Research Intelligence How to Capitalize on Micro Consumer Demand Even in Challenging Times Audience & Brand Building Business Benchmarking by Shelly Skandrani 10 Min. Dec 17, 2023 Marketing Intelligence 9 Black Friday Marketing Strategies You Want To Try Content Marketing Marketing Strategy by Leah Messenger 10 Min. Nov 12, 2023 Ecommerce Intelligence Nike Digital DTC vs Wholesale – Finding the Omnichannel Balance Retail Insights by Sneha Pandey 5 Min. Jun 30, 2023 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Crocs’ Cool Factor Explained [+4 Tips to Get Brands the Same Effect]"
    },
    {
      "level": "H2",
      "text": "1. Hip hop into a collaboration to become a Crocs fashion trend"
    },
    {
      "level": "H3",
      "text": "Takeaways"
    },
    {
      "level": "H2",
      "text": "2. Don’t doubt the digital retail master"
    },
    {
      "level": "H3",
      "text": "Takeaways"
    },
    {
      "level": "H2",
      "text": "3. Consumers crave comfort and waterproof material"
    },
    {
      "level": "H3",
      "text": "Takeaway"
    },
    {
      "level": "H2",
      "text": "4. Adjust per the pandemic"
    },
    {
      "level": "H3",
      "text": "Onset"
    },
    {
      "level": "H3",
      "text": "Recovery and return to stores"
    },
    {
      "level": "H2",
      "text": "Conclusion"
    },
    {
      "level": "H3",
      "text": "Get your own insights"
    },
    {
      "level": "H3",
      "text": "How to Increase Sales on Amazon: 19 Strategies"
    },
    {
      "level": "H3",
      "text": "Retail Media Demystified: Your Path to Ecommerce Success"
    },
    {
      "level": "H3",
      "text": "Spring Sends US Shoppers Searching for All Things Outdoors on Amazon"
    },
    {
      "level": "H3",
      "text": "How to Capitalize on Micro Consumer Demand Even in Challenging Times"
    },
    {
      "level": "H3",
      "text": "9 Black Friday Marketing Strategies You Want To Try"
    },
    {
      "level": "H3",
      "text": "Nike Digital DTC vs Wholesale – Finding the Omnichannel Balance"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Emily Hunt"
}