{
  "url": "https://www.similarweb.com/blog/ecommerce/retail-insights/ecommerce-trends/",
  "slug": "ecommerce-trends",
  "title": "10 eCommerce Trends to Watch in 2022 | Similarweb",
  "description": "The ‘90s will always smell like cucumber melon. Why? Trends. Here are the top eCommerce trends to watch in 2022 to reach your audience and leave an impression.",
  "content": "HomeBlogEcommerceRetail InsightsTop 10 eCommerce Trends to Watch in 2022 Ecommerce Intelligence Top 10 eCommerce Trends to Watch in 2022 Take a demo by Sarah Mehlman , Sr. Marketing Intelligence Specialist 10 Min. March 10, 2022 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic 2020 was the year of the eCommerce boom. As back-to-back lockdowns and quarantines kept consumers at home, eyes drifted online, leading to a 31.8% increase in eCommerce since the previous year. Of course, eCommerce is still growing. Predictions estimate that global revenues from online shopping will reach $5 trillion in 2022 – the first time revenues will surpass the $1 trillion milestone. As with any industry, exponential growth comes with pivotal changes and new eCommerce industry trends. We’ve been following the sector and scoped out ten eCommerce trends to watch out for in 2022. Social and live stream shopping Many online retailers are offering consumers the ability to purchase directly within a social media platform, a convenient and click-minimizing process. This is a growing trend, especially in the U.S. and China, and global revenues from social commerce are expected to reach $604.5 billion by 2027. Purchases are made through marketplaces or ads with dedicated “buy now” buttons. Even Walmart partnered with TikTok to host live-stream shopping events of its own. So, what is it? Livestream shopping is basically an upgraded version of social commerce. Consumers can make purchases live during social media events to showcase products or services, often hosted by influencers or brands. During the live broadcast, viewers can ask questions, make comments, and of course, make purchases – plus possibly score special or limited-time deals. Currently, China is the top country for live stream commerce, which came into the spotlight on Nov. 11, 2020, when Alibaba hosted a live Global Shopping Festival on its Taobao platform. Reports show that more than 300 million people attended events on 33 live channels, spending about $16.5 billion overall. Livestream commerce will likely become more popular around the globe in 2022 and brands could benefit by tapping into the trend now. Image is taken from Springwise AR window shopping As fun as online shopping is, trying things on before buying is a pastime that’s hard to part with. With augmented reality try-on options, consumers are less likely to be surprised or worse, disappointed, after a purchase. Let’s say you want a new chair for your living room. With AR, you can simply point your smartphone in your living room to get an augmented reality view of what the chair would look like with all your other furniture. For clothing, you could upload a picture of yourself and see whether a shirt would match your eyes or clash with your skin tone. In fact, six in ten consumers said visualizing a product in their lives would make them more likely to purchase, and studies show that conversion rates increase by 90% with AR technology. Shopify topped this with an increase in conversion rates of 250% on pages with AR technology. Overall, it’s estimated that in 2020, 100 million consumers used AR shopping, either online or in stores. Personalization that respects privacy Consumers are looking for more personalized shopping experiences, but are also becoming more aware and concerned about privacy. Recently, many countries implemented new regulations to protect consumer privacy online. China’s Personal Information Protection Law took effect on Nov. 1, 2021. California’s Consumer Privacy Act took effect on Aug. 14, 2020. Brazil’s General Data Protection Law took effect on Sept. 18, 2020. European Union’s General Data Protection Regulation took effect May 25, 2018, and has already companies including Amazon, WhatsApp, and Google, enormous fines. Upcoming: To protect privacy, many internet browsers now block third-party cookies, and Chrome will also phase out third-party cookies in 2023. Read More: 4 Tips to Conquer a Cookieless Future It may seem counter-intuitive, but while consumers seek privacy, they also want personalization. 60% of consumers said personalization will likely turn them into a repeat customer. Tweet this This means that retailers need to create new methods to provide personalized shopping experiences, minus the privacy problems. This could include recommending products based on previous purchases, creating conversational pop-ups that engage with consumers, or adding a personalized assistant to ask shoppers about their preferences. AI to automate and upsell We know personalization matters and that personalized recommendations can increase conversion rates by a tremendous 915%. But how can you create personalized marketing to scale? Artificial intelligence. Amazon is the king of AI. 35% of Amazon’s revenue comes from upselling or cross-selling. That’s pretty impressive. AI in eCommerce isn’t just for providing recommendations to upsell or cross-sell. It can also be used to add chatbots to answer consumer questions, automate product descriptions, recommend sizes, improve search results, and even prevent chargebacks and fraud. The technology can score consumers based on numerous criteria and raise red flags or block transactions that could be fraudulent – a huge money-saver for online retailers. Overall, AI can lead to a 25% increase in all of the following: customer satisfaction, revenue, and cost reduction. Indeed, in 2020, 80% of customer interactions online were managed by AI technology. If you haven’t already tapped the trending technology, you should do so if you don’t want to get left behind in 2022. Direct to consumer Top brands including pepsi.com, kraftheinzcompany.com, and nike.com have recently been focusing on direct-to-consumer channels rather than selling through traditional retailers. Prime example: Nike began pulling away from wholesalers before the pandemic and announced that its digital sales soared by 82% in the first quarter of 2020. The leading label had hoped that eCommerce would represent 30% of its sales by 2023, but it actually surpassed that goal at the start of 2020. Direct-to-consumer, or DTC, eCommerce sales are expected to reach $151.2 billion in 2022, a 16.9% increase from 2021. The DTC eCommerce trend makes sense because it feels more personal to buy directly from a company rather than from a wholesaler. DTC retailers can create better relationships with their customers, which in turn leads to a better shopping experience and ultimately, customer loyalty. 55% of consumers say they prefer DTC shopping because of the experience. Another great benefit of DTC eCommerce? Retailers have a better idea of who their customers are. Rather than just receiving a royalty check with dry financial reports from a wholesaler, retailers can learn exactly who their customers are, where they’re from, what they’re purchasing, and more valuable information that could be used to optimize their digital marketing strategy. Read More: Top Fastest-Growing D2C Brands, Q3 2021 A focus on retention Success attracts more players – this is definitely true for eCommerce. Every day, there are more online retailers opening stores and it’s estimated that there are somewhere between 12 million and 24 million online shops now. With more sellers online, this means more competition and more players competing for your keywords and in PPC auctions. This means that you may need to increase your bid to win keyword auctions – but you’re not the only one. In fact, studies show that costs per click for online search ads increased by about 28% between the first and third quarters of 2021. As advertising costs increase, so do customer acquisition costs. This means that to realize the value of customers, eCommerce retailers must invest their focus on customer retention and increasing a customer’s lifetime value. One way to do this is to develop a remarketing strategy to engage former and current customers. You may also want to employ other new methods to retain customers, including building an online community, implementing loyalty or referral programs, and being proactive about customer engagement. Omnichannel shopping From this article, you might think that everyone is buying online, but in truth, 40% of consumers still make purchases in physical stores at least once a week (in addition to buying from your brand online). A personalized shopping experience isn’t limited to one form of communication. So, to personalize successfully, retailers must focus on creating a cohesive experience across different channels. In fact, a recent study shows that 69% of shoppers said they expect a consistent experience across all channels, though only 24% of businesses said they were successfully investing in this. We’re also seeing a huge trend in “showrooming” and “webrooming”. Showrooming is when a shopper visits a physical store to view products and then buys online. Webrooming is the opposite, with consumers viewing products online and then purchasing in the store. 54% of consumers say they participate in showrooming and 59% say they use webrooming, so retailers looking to try these out should pay attention to putting together a consistent experience across channels. Many retailers are making omnichannel a priority in 2022. In fact, with rising customer acquisition costs (CAC), this can be hugely beneficial. A recent study shows that 32% of brands are looking to expand their in-person experiences in 2022, including creating pop-up shops or getting merchandise into retail stores. More ways to pay Let’s face it, typing in a credit card number is not the most user-friendly experience. We know that 69.8% of shoppers drop off somewhere between filling their cart and making the payment. One of the reasons for this whopping drop-off rate is that customers may not like the payment methods available or may not want to spend time filling in tedious payment information. Already, many online retailers offer shoppers the option to save payment information for faster checkout in the future. Additionally, the use of PayPal, Amazon Pay, and Apple Pay all increased since the beginning of 2020, with PayPal’s growth reaching 24% during that year in the U.S. Consumers are quickly adopting new payment methods, with 93% saying they would consider emerging payment methods such as biometrics, digital currencies, and QR codes. Another growing alternative payment method is cryptocurrency. The number of people investing in the cryptocurrency market is growing – fast – the market was estimated at $1.63 billion in 2021 with a 12.9% growth rate. With more investments in this market, many are looking for ways to use cryptocurrency for shopping. Read More: Top Crypto Websites: Who’s Winning Online and Why? While this is still a very new trend, several big players including Microsoft, Starbucks, PayPal, and Tesla are already accepting cryptocurrency as a payment method. Additionally, a 2020 study showed that 36% of small and medium-sized businesses in the U.S. were already accepting cryptocurrency as a payment form and that 40% of consumers would like to use cryptocurrency in the next year. With the controversy over this currency, it’s hard to know exactly what will happen in terms of its future as a payment method, but 2022 eCommerce trends will definitely bring a change in cryptocurrency acceptance. Smartphone-friendly purchasing We might sound like dinosaurs saying that mobile usage is on the rise, but it is. Mcommerce, or mobile commerce, is expected to total 40% of all eCommerce sales in 2022, a 21.5% increase since 2021. While mcommerce is known to have lower conversion rates than computer eCommerce, it represents a huge portion of revenues. The takeaway? Optimize for mcommerce. Another can’t-miss mobile trend? Voice search. A 2018 study showed that 72% of consumers who were aware of voice-enabled devices were using them and 57% of these consumers were using voice commands on a smartphone. 90% of consumers said voice commands made online searching easier, and In 2020, there were 427 million mobile voice searches conducted daily, representing 20% of mobile searches. Your online store should be optimized for voice-command searches. This could mean using longer and more conversational keywords in your SEO strategy or ensuring that your content is straightforward and to the point to respond conversationally to voice searches. Read More: eCommerce SEO 101: Best Practices for Online Stores How to Calculate Share of Voice for SEO, PPC, and Social Sustainable and ethical purchasing One of the downsides of eCommerce is its negative effect on the environment. Online sales lead to an increase in packaging and waste in landfills, plus more transportation required to drive packages to their destinations. In 2021, 52% of consumers in the U.S. and U.K. said they wished companies would use less packaging, and 31% in the U.S. said they were willing to pay a premium for eco-friendly delivery options. In Germany, a recent survey found that 34.8% of consumers supported returning reusable packaging for online purchases. Two things brands can do to be more sustainable are to use recycled packaging materials and/or offer greener shipping options – and it’s not as hard to do as it may seem. DHL GoGreen is a carbon-neutral shipping option available in 40 countries today, for example. On the ethical side, consumers today are interested in transparency about how brands conduct business. This goes from ensuring an ethical supply chain that employs fair labor practices and ethical sourcing of raw materials, to using fair marketing tactics. One big ethical purchasing movement is the #OptOutside alternative to Black Friday. Some companies recently pledged to close on Thanksgiving, giving employees and shoppers more time to spend with their families rather than focus on consumerism. Many younger shoppers appreciate these efforts, leading to more customer loyalty. Be ready for 2022 The future of eCommerce is evolving, and so should your business. Do this, and we’re sure you’ll see the results in your ROI. Get More eCommerce Insights Track your competitors and grow your business with Similarweb. Book a demo FAQ Is eCommerce growing? Yes! More and more retailers are opening up online stores to compete for online sales. We’re also seeing consumers spending more online thanks to the convenience of shopping from their own homes. Will eCommerce be profitable in 2022? Average profit margins for eCommerce are about 40%, but of course, this varies from business to business. Do I need to adopt all of these trends? Decide what’s best for your business by looking at what your competitors are doing and at what’s happening in your industry. With this knowledge, decide what you want to do and where you think you could be successful. How do I know if I am successful? As with any business initiative, it’s important to create goals or KPIs when you start. This way, you’ll have concrete measures to decide whether you successfully adopted a trend. by Sarah Mehlman Sr. Marketing Intelligence Specialist Sarah creates engaging content with over 5 years of experience. She enjoys traveling, family time, baking, and Netflix. Sarah holds a psychology degree from Clark University and lives in Israel. Related Topics: Retail Insights This post is subject to Similarweb legal notices and disclaimers. Related Posts Ecommerce Intelligence How to Increase Sales on Amazon: 19 Strategies Amazon Insights by James Quilter 16 Min. Sep 12, 2024 Ecommerce Intelligence Retail Media Demystified: Your Path to Ecommerce Success Retail Insights by James Quilter 13 Min. Aug 1, 2024 Insights Spring Sends US Shoppers Searching for All Things Outdoors on Amazon Amazon Insights Ecommerce News by Andrea Pash 3 Min. Apr 23, 2024 Research Intelligence How to Capitalize on Micro Consumer Demand Even in Challenging Times Audience & Brand Building Business Benchmarking by Shelly Skandrani 10 Min. Dec 17, 2023 Marketing Intelligence 9 Black Friday Marketing Strategies You Want To Try Content Marketing Marketing Strategy by Leah Messenger 10 Min. Nov 12, 2023 Ecommerce Intelligence Nike Digital DTC vs Wholesale – Finding the Omnichannel Balance Retail Insights by Sneha Pandey 5 Min. Jun 30, 2023 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Top 10 eCommerce Trends to Watch in 2022"
    },
    {
      "level": "H2",
      "text": "Social and live stream shopping"
    },
    {
      "level": "H2",
      "text": "AR window shopping"
    },
    {
      "level": "H2",
      "text": "Personalization that respects privacy"
    },
    {
      "level": "H2",
      "text": "AI to automate and upsell"
    },
    {
      "level": "H2",
      "text": "Direct to consumer"
    },
    {
      "level": "H2",
      "text": "A focus on retention"
    },
    {
      "level": "H2",
      "text": "Omnichannel shopping"
    },
    {
      "level": "H2",
      "text": "More ways to pay"
    },
    {
      "level": "H2",
      "text": "Smartphone-friendly purchasing"
    },
    {
      "level": "H2",
      "text": "Sustainable and ethical purchasing"
    },
    {
      "level": "H2",
      "text": "Be ready for 2022"
    },
    {
      "level": "H2",
      "text": "FAQ"
    },
    {
      "level": "H3",
      "text": "How to Increase Sales on Amazon: 19 Strategies"
    },
    {
      "level": "H3",
      "text": "Retail Media Demystified: Your Path to Ecommerce Success"
    },
    {
      "level": "H3",
      "text": "Spring Sends US Shoppers Searching for All Things Outdoors on Amazon"
    },
    {
      "level": "H3",
      "text": "How to Capitalize on Micro Consumer Demand Even in Challenging Times"
    },
    {
      "level": "H3",
      "text": "9 Black Friday Marketing Strategies You Want To Try"
    },
    {
      "level": "H3",
      "text": "Nike Digital DTC vs Wholesale – Finding the Omnichannel Balance"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Sarah Mehlman"
}