{
  "url": "https://www.similarweb.com/blog/ecommerce/retail-insights/holiday-shopping-trends/",
  "slug": "holiday-shopping-trends",
  "title": "Holiday Shopping Trends 2021 + Tips | Similarweb",
  "description": "An analysis of holiday shopping trends in 2021 for retailers and brands, focused on Cyber 5 (Thanksgiving-Cyber Monday) with lessons to apply all year long.",
  "content": "HomeBlogEcommerceRetail InsightsHow to Use Holiday Shopping Trends to Boost Year-round Strategy Ecommerce Intelligence How to Use Holiday Shopping Trends to Boost Year-round Strategy Get insights year-round by Emily Hunt , Market Research & eCommerce Specialist 4 Min. December 13, 2021 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Five days out of 365 may not seem like much. However, for eCommerce, the five days from Thanksgiving to Cyber Monday, or Cyber 5, is the prime holiday shopping season and can make or break the year. Using Similarweb Shopper Intelligence, we analyzed holiday shopping trends in 2021 and how they can be used to optimize retail and CPG strategies for the rest of the year – a true gift that keeps on giving. 1. Adjust to shifts in consumer demand Holiday consumer trends indicate that shoppers prefer to buy cheaper items or gifts online and make more expensive purchases in-store. On target.com the average cost of Kitchen & Dining products during Cyber 5 fell 6% from last year, despite increased prices due to inflation and supply chain issues. In the furniture space, exclusively digital retailers (those that only sell their wares online) suffered large declines. Visits to wayfair.com and overstock.com dipped 27% and 43%, indicating that shoppers preferred onsite stores to test and buy comfy couches. In the consumer electronics category, revenue on amazon.com declined 20% year-over-year (YoY). Categories with small, low-cost items performed strongly. For instance, cart size for Amazon Beauty & Personal Care was the second-highest across the site during Cyber 5 vs. the 17-day lead-up, with three out of five top products in November under $20. Takeaways Allocate resources to smaller, lower-cost products during prime shopping seasons and ensure inventory levels are high. Consider bundling complimentary, small products within low-cost, high-cart-size categories to create attractive gifts. Big-ticket online retailers may need to develop more sophisticated strategies to leverage holiday shopping trends and catch consumers’ attention so they don’t buy in-store. Big-ticket brands should focus on hybrid (those that sell online and in-store) over digital retailers in their distribution strategy. 2. Tailor strategy to purchase and browsing behavior Despite Black Friday and Cyber Monday sales lowering from 2020, Americans spent nearly $110 billion from Nov. 1 through Cyber Monday, a 12% increase. Amazon’s daily average sales jumped 63% and revenue increased 85% over the 17-day lead-up, a 17 pts YoY rise. These gains indicate consumers are buying gifts earlier. In fact, Amazon conversion rates dipped on Nov. 26, Black Friday, while product views skyrocketed, indicating more browsing over buying on the shopping holiday. Consumers likely cross-shopped other retailers and weren’t as easy to convince to make a purchase on the historic shopping day. The YoY increase in product views across amazon.com in 2021 indicates that consumers are browsing products more actively earlier in the year. Takeaways Promote and discount products for shopping holidays, including Amazon Prime Day and even President’s Day, earlier. This year, Amazon and Target promoted Black Friday in October. Consumers identify what they want prior to discounts, so consider Amazon SEO and other tactics to rank higher in search results so that your product is top-of-mind when consumers are ready to buy. Distribute products across marketplaces as more browsing indicates consumers are checking out other websites for the best deals. 3. Incorporate on-site search into the marketplace strategy Threshold, Target’s private home label, was the top-grossing brand in its category. Room Essentials, another private label, scored third. On the first page of search results for Target Home Decor, Threshold products take the prime spot, putting other brands in less advantageous positions. On amazon.com, however, the top-selling Home & Furniture product during November is from Linenspa, a brand that sells across online retailers like Wayfair, and its D2C channels, unlike private labels. The performance of Target’s apparel category also indicates private label preferences. In fact, eight of the top-selling 10 brands were private labels, whereas name brands, like Fruit of the Loom, Adidas, and Hanes, topped Amazon’s list. Takeaways Brands should be wary of sending too much inventory to marketplaces that don’t prioritize 3P brands, instead of focusing on where they can be highlighted. Optimize product listings and consider SEO to get consumers’ eyes on your products as they come up in search results. Next steps: Using shopper data We used data from Shopper Intelligence, a Similarweb eCommerce solution for our insights on holiday shopping trends in 2021 To get your own consumer data to inform your year-round strategy, sign up for a demo today. Schedule a demo of Shopper Intelligence Get the latest eCommerce insights Sign me up by Emily Hunt Market Research & eCommerce Specialist Emily writes about digital retail, CPG, travel, and consumer finance, with a background in business development and marketing. Related Topics: Retail Insights This post is subject to Similarweb legal notices and disclaimers. Related Posts Ecommerce Intelligence How to Increase Sales on Amazon: 19 Strategies Amazon Insights by James Quilter 16 Min. Sep 12, 2024 Ecommerce Intelligence Retail Media Demystified: Your Path to Ecommerce Success Retail Insights by James Quilter 13 Min. Aug 1, 2024 Insights Spring Sends US Shoppers Searching for All Things Outdoors on Amazon Amazon Insights Ecommerce News by Andrea Pash 3 Min. Apr 23, 2024 Research Intelligence How to Capitalize on Micro Consumer Demand Even in Challenging Times Audience & Brand Building Business Benchmarking by Shelly Skandrani 10 Min. Dec 17, 2023 Marketing Intelligence 9 Black Friday Marketing Strategies You Want To Try Content Marketing Marketing Strategy by Leah Messenger 10 Min. Nov 12, 2023 Ecommerce Intelligence Nike Digital DTC vs Wholesale – Finding the Omnichannel Balance Retail Insights by Sneha Pandey 5 Min. Jun 30, 2023 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "How to Use Holiday Shopping Trends to Boost Year-round Strategy"
    },
    {
      "level": "H2",
      "text": "1. Adjust to shifts in consumer demand"
    },
    {
      "level": "H3",
      "text": "Takeaways"
    },
    {
      "level": "H2",
      "text": "2. Tailor strategy to purchase and browsing behavior"
    },
    {
      "level": "H3",
      "text": "Takeaways"
    },
    {
      "level": "H2",
      "text": "3. Incorporate on-site search into the marketplace strategy"
    },
    {
      "level": "H3",
      "text": "Takeaways"
    },
    {
      "level": "H2",
      "text": "Next steps: Using shopper data"
    },
    {
      "level": "H3",
      "text": "How to Increase Sales on Amazon: 19 Strategies"
    },
    {
      "level": "H3",
      "text": "Retail Media Demystified: Your Path to Ecommerce Success"
    },
    {
      "level": "H3",
      "text": "Spring Sends US Shoppers Searching for All Things Outdoors on Amazon"
    },
    {
      "level": "H3",
      "text": "How to Capitalize on Micro Consumer Demand Even in Challenging Times"
    },
    {
      "level": "H3",
      "text": "9 Black Friday Marketing Strategies You Want To Try"
    },
    {
      "level": "H3",
      "text": "Nike Digital DTC vs Wholesale – Finding the Omnichannel Balance"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Emily Hunt"
}