{
  "url": "https://www.similarweb.com/blog/ecommerce/retail-insights/trend-data/",
  "slug": "trend-data",
  "title": "Trend Data: The Missing Piece of the eComm Puzzle | Similarweb",
  "description": "Trend data can help you compete, adapt, and sell more online. Learn how to pinpoint shopper demand and stay ahead in the competitive eCommerce world.",
  "content": "HomeBlogEcommerceRetail Insights7 Steps to Gathering Trend Data: The Missing eComm Puzzle Piece Ecommerce Intelligence 7 Steps to Gathering Trend Data: The Missing eComm Puzzle Piece Talk to an eCommerce specialist by Molly Winik , Senior Content Marketing Manager 9 Min. June 22, 2022 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic We all know that in eCommerce, one day’s big fad could be totally out the next. So how as a seller online, are you supposed to build a strategy that accurately aligns with your customer’s interests? The obvious answer is trend data, but sometimes collecting relevant insights before they’re outdated is easier said than done. If you’ve ever struggled with uncovering that missing piece of the puzzle, this article’s for you. Keep reading to see how you can use Similarweb Retail and eCommerce solutions to pinpoint consumer demand and stay ahead of the fast-shifting shopper trends. 7 steps for collecting trend data If you suspect that there’s a new trend taking over your market, you’ll want to follow these steps to validate it. You can also use these guidelines to pinpoint new eCommerce trends that may be flying under your radar. Step 1: Conduct traditional market research Step 2: Zoom out for a macro look year-over-year (YoY) Step 3: Analyze trending keywords in your industry Step 4: Go deeper with search interest analysis Step 5: Verify any trends you have found Step 6: Size up the competition Step 7: Make sure it fits with your audience You’re ready to go! What is trend data? Trend data analysis is the process of collecting information and insights to spot a new pattern. Specifically, in eCommerce, this can relate to new consumer behavior or expectations. It’s similar to temporal data, as many of the insights can be fleeting depending on how long a trend lasts. In addition, trend data differs from seasonal insights, which often repeat yearly or bi-annually. Trend data analysis entails looking at website traffic performance, engagement metrics, keyword searches, and more over time. The broader the time period you are looking at, the easier it will be to spot spikes or dips in traffic, suggesting a new trend. The challenge of eCommerce trend data analysis With consumer behavior online constantly evolving, it’s increasingly difficult to keep tabs on your market and stay one step ahead of the competition. Some of the challenges you may have already encountered include: Markets are changing faster than ever and trends are fleeting Consumers are more demanding, fickle, and specific Digital signals can provide overwhelming and noisy data Categories have grown more competitive and nuanced Buyer journeys have lengthened considerably All this sums up the fact that market research alone isn’t enough to keep up with the pace of evolution. A step-by-step breakdown You can take on those challenges in just seven steps and start collecting trend data like an eCommerce pro, so let’s go… Step 1: Start with traditional market research Even if you think you have a good idea of who the key players are in your industry, it never hurts to do a pulse check and see if anything’s changed since the last time you conducted thorough market research. It’s the best starting point to see if there are any newcomers suggesting a change in consumer behavior. But remember, this alone is not enough. We can see this play out in the U.S. Activewear industry, specifically with the rise in comfort-focused shoes. Oofas, a brand that offers footwear to “recharge your body and reduce the stress on your feet and joints” has seen tremendous growth in the last year, with visits jumping 134% YoY in Q1 2022 – most of which can be attributed to ramped up advertising on social media, targeting their niche audience for recovery footwear. Oofas.com’s fast-growing traffic patterns and social success hints at a new trend toward comfortable shoes to capitalize on. Step 2: Zoom out for a macro look YoY Monitor YoY trends in your industry to not only determine if it’s growing or declining but also to check for new online behavior. Look for any major changes in traffic patterns, whether that be an increase in website visits, new splits between mobile and desktop traffic, changes in marketing channel performance, etc. Anything that looks amiss would suggest a shift in consumer expectations and demand. Let’s use the Food and Grocery sector as an example. Over the past two years, the industry adapted to new changes in shopper behavior, most notably a pivot to online delivery services amid the pandemic. Instacart, which offers grocery delivery in as fast as 30 minutes, increased its mobile app’s monthly active users by 116% (since January 2021), averaging 2.5 million a month and 439K daily active users. This data correlates to a study done by McKinsey, in which 33% of instant grocery customers in France, Germany, the Netherlands, and the U.K. indicated they value this service because it offers “ultra-convenience.” More than 75% of those respondents plan to continue using instant grocery services. These patterns suggest that even though in-store shopping has resumed, for many consumers nothing will replace the convenience of online grocery delivery and newly popularized subscription services. Step 3: Analyze trending keywords in your industry Your next stop on the trendspotting train is to research and analyze keywords in your industry. This step, more so than anything else on our list, examines what your potential customers are actually searching for when they open their browsers. It’s a key indicator of what’s top of mind for them and the products that are likely trending. Let’s go back to the Activewear industry. A quick analysis of keyword volume shows a preference for streetwear looks. Kicks Crew, Fight Club, and Kicks on Fire have business models that rely solely on the sale of popular shoes from brands like Nike, Adidas, New Balance, etc. While each site received a significant portion of its traffic from branded search terms, the real competition between these retailers comes from those related to trending products. Right now, in Footwear, those are New Balance 550, Yeezy 350 V2, and the Air Jordan 1 Retro High Fits. Step 4: Go deeper with search interest analysis Once you think you’ve identified the next big eCommerce trend, go deeper with search interest analysis to make sure you’re on the right track and verify that the particular category is growing. If we stick with our Footwear example, we can see that New Balance is indeed having quite the comeback, and it’s not just for the New Balance 550s. The search term “new balance sneakers” saw the most traffic it had in the last two years in March 2022, especially from third-party retailers such as dsw.com, zappos.com, and madewell.com. Search interest also shows the brand’s growing popularity in the U.K., Denmark, Sweden, and India. Step 5: Verify any trends you have found Now it’s time to make sense of the trend you found. Put together all the research you’ve collected and correlate it into actionable statements that you can share with your team. Because your findings are backed by data, you can adjust your eCommerce strategy accordingly. Given the two eCommerce sectors we’ve covered above, here are a few trends that we can say are taking shape: Grocery shoppers online are increasingly using mobile apps to make their purchases, highlighting the need for a seamless shopping experience. Online grocery shopping is here to stay as ultra-convenience has become a staple even after in-person shopping resumed. Many shoppers who prefer comfortable shoes are converting via social media ads Streetwear is the new big Footwear style, with brands like New Balance and Yeezys leading the way. Step 6: Size up any competition Now that you’ve identified some potential trends in your industry, it’s time to look at any major players you’ll be competing against. Competitive analysis includes tracking data on your competitors’ websites, conversion rates, and online engagement metrics. It can put industry stats, performance, and details about products and services into perspective. Competitive analysis reporting helps you define the competitive elements in your market and provides the necessary insights to help you and your management team make strategic decisions. The bottom line: if you don’t understand what your competitors are doing online you are missing out on the entire digital story. Competitive Analysis Reporting Learn how to build competitive analysis reports you can rely on Download now Don’t be afraid to use your competitors as inspiration. If you see one brand has successfully captured demand for a new product, dive deeper into their social media, marketing, or eCommerce strategy and see how you can replicate that same success. Step 7: Make sure it fits with your audience Your last step in identifying an eCommerce trend is to make sure that it resonates with your target audience. Maybe you notice that Yeezys are trending, but it’s not a popular product for your own customers. You won’t see much success if you try to sell these shoes on your site. Let’s compare the shopper demographics for Adidas (the makers of Yeezys) to New Balance on Amazon. We can see that although each brand has a similar gender distribution, Adidas skews slightly more toward a female audience with 67%, compared to New Balance’s 59%. In addition, Adidas is more popular with younger age groups, especially 18-24-year-olds, with nearly double the number of shoppers in that age range compared to New Balance. New Balance tends to receive shoppers ages 55 and up. Both brands are popular among millennials. Always remember that just because you may have found a new trend, it doesn’t mean it’s the right one for your business. Let your audience guide you. Case study: Skincare trends we found with Similarweb One eCommerce sector that is constantly evolving is skincare, especially as the COVID-19 pandemic brought health and wellness to the forefront of everyone’s mind. All-natural, cruelty-free, and sustainable are just some of the trends that have taken over the Beauty and Personal Care industry. Using Similarweb Shopper Intelligence, we dove into the Beauty industry in search of new eCommerce trends across men’s and women’s skincare. Here’s what we found out: Women’s Skincare Sunscreen may traditionally be a summer product, but compared to last year, sales skyrocketed in winter 2022. This is likely due to the introduction of facial sunscreen in consumers’ daily skincare routine, in addition to the return of winter travel. Revenue for Amazon.com’s sunscreen category increased 53% YoY, making it an attractive segment for skincare brands. The introduction of facial sunscreen led to an increase in the category’s revenue on Amazon.com by 46% YoY. The fastest-growing brand in revenue was Supergoop!, with an increase of over 273% YoY. This can be attributed to its growing popularity on social media channels, especially TikTok. We found that beauty buyers are swapping Korean for Japanese beauty products: clicks from “japanese sunscreen” grew by 26% YoY, while they declined by -55% for “korean sunscreen.” Consumers were also concerned about the ecological impact of their body sunscreen – “reef safe sunscreen” (68.6K clicks, 30% captured by Banana Boat) and “biodegradable sunscreen” (30K clicks, 23% captured by Sun Bum) were the third and fifth trending keywords in the body sunscreen category. Get the full analysis Men’s Skincare Skincare brands recently uncovered a market opportunity that was relatively untapped. Established female skincare brands are leveraging their industry knowledge to launch new male product lines, while some entrepreneurs are creating their own new brands to tackle male skincare issues. Twelve of the top skincare brands with male-focused products grew by 6% CAGR (compound annual growth rate) in revenue in April 2022. An important finding was that of the 12 trendy male skincare brands, women accounted for 66% of product views. Brands need to not only market their products to men but also make sure to appeal to female consumers. Get the full analysis Tools for spotting eCommerce trends There are a variety of eCommerce tools you can use to nail your digital presence, however not all of them will give you the full scope of what’s happening online. Google Trends is a good starting point, but the results tend to be vague and hard to act on. Media coverage can also point you in the right direction in terms of what’s trending, but keep in mind that these reports could be subjective and not always data-backed. And like Google trends, they can be high-level and not actionable. Similarweb serves Retail & CPG at every step of the customer journey and can answer any of your key business questions, including: Learn more about how Similarweb can support your eCommerce business. FAQ Why do I need to gather trends as part of my eCommerce strategy? If you’re not looking at the up-and-coming trends in your industry, then you’re losing out on the chance to sell more online, both to existing customers and potential new business. Trends in the eCommerce industry reflect changes in customer behavior. Ignoring them means you’re likely not giving your customers what they want or expect so they’ll just go looking for them elsewhere. How can I analyze new trends? There are seven easy steps to get you started in analyzing trend data: Conduct traditional market research Zoom out for a macro look year-over-year (YoY) Analyze trending keywords in your industry Go deeper with search interest analysis Verify any trends you have found Size up the competition Make sure it fits your audience What are some challenges I may face when looking at trends in the eCommerce industry? Markets are changing faster than ever before, and trends can be fleeting which is a challenge in and of itself. In addition, consumers are more demanding and specific. eCommerce categories have become more competitive and the buyer journey has become quite long. All of this means that traditional market research isn’t enough to keep up with changes in the industry. Get real-time eCommerce insights Adapt to market changes and industry trends in an instant. Try Similarweb for free by Molly Winik Senior Content Marketing Manager Molly has 8+ years of experience in marketing, content creation, and PR. Her work has been featured on Mention, The Times of Israel, and Culture Trip. Related Topics: Retail Insights This post is subject to Similarweb legal notices and disclaimers. Related Posts Ecommerce Intelligence How to Increase Sales on Amazon: 19 Strategies Amazon Insights by James Quilter 16 Min. Sep 12, 2024 Ecommerce Intelligence Retail Media Demystified: Your Path to Ecommerce Success Retail Insights by James Quilter 13 Min. Aug 1, 2024 Insights Spring Sends US Shoppers Searching for All Things Outdoors on Amazon Amazon Insights Ecommerce News by Andrea Pash 3 Min. Apr 23, 2024 Research Intelligence How to Capitalize on Micro Consumer Demand Even in Challenging Times Audience & Brand Building Business Benchmarking by Shelly Skandrani 10 Min. Dec 17, 2023 Marketing Intelligence 9 Black Friday Marketing Strategies You Want To Try Content Marketing Marketing Strategy by Leah Messenger 10 Min. Nov 12, 2023 Ecommerce Intelligence Nike Digital DTC vs Wholesale – Finding the Omnichannel Balance Retail Insights by Sneha Pandey 5 Min. Jun 30, 2023 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "7 Steps to Gathering Trend Data: The Missing eComm Puzzle Piece"
    },
    {
      "level": "H2",
      "text": "7 steps for collecting trend data"
    },
    {
      "level": "H2",
      "text": "What is trend data?"
    },
    {
      "level": "H2",
      "text": "The challenge of eCommerce trend data analysis"
    },
    {
      "level": "H2",
      "text": "A step-by-step breakdown"
    },
    {
      "level": "H3",
      "text": "Step 1: Start with traditional market research"
    },
    {
      "level": "H3",
      "text": "Step 2: Zoom out for a macro look YoY"
    },
    {
      "level": "H3",
      "text": "Step 3: Analyze trending keywords in your industry"
    },
    {
      "level": "H3",
      "text": "Step 4: Go deeper with search interest analysis"
    },
    {
      "level": "H3",
      "text": "Step 5: Verify any trends you have found"
    },
    {
      "level": "H3",
      "text": "Step 6: Size up any competition"
    },
    {
      "level": "H3",
      "text": "Step 7: Make sure it fits with your audience"
    },
    {
      "level": "H2",
      "text": "Case study: Skincare trends we found with Similarweb"
    },
    {
      "level": "H3",
      "text": "Women’s Skincare"
    },
    {
      "level": "H3",
      "text": "Men’s Skincare"
    },
    {
      "level": "H2",
      "text": "Tools for spotting eCommerce trends"
    },
    {
      "level": "H2",
      "text": "FAQ"
    },
    {
      "level": "H3",
      "text": "How to Increase Sales on Amazon: 19 Strategies"
    },
    {
      "level": "H3",
      "text": "Retail Media Demystified: Your Path to Ecommerce Success"
    },
    {
      "level": "H3",
      "text": "Spring Sends US Shoppers Searching for All Things Outdoors on Amazon"
    },
    {
      "level": "H3",
      "text": "How to Capitalize on Micro Consumer Demand Even in Challenging Times"
    },
    {
      "level": "H3",
      "text": "9 Black Friday Marketing Strategies You Want To Try"
    },
    {
      "level": "H3",
      "text": "Nike Digital DTC vs Wholesale – Finding the Omnichannel Balance"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Molly Winik"
}