{
  "url": "https://www.similarweb.com/blog/marketing/content-marketing/copywriting-tips/",
  "slug": "copywriting-tips",
  "title": "10 Non-Obvious Copywriting Tips | Similarweb",
  "description": "Copywriting is a mix of art & science and everyone has tips on how to do it. Here are 10 non-obvious copywriting tips that are proven to bring results.",
  "content": "HomeBlogMarketingContent Marketing10 Non-Obvious Copywriting Tips that Work Marketing Intelligence 10 Non-Obvious Copywriting Tips that Work Try Similarweb for free by Harry Dry , Founder of marketingexamples.com 4 Min. May 25, 2022 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Copywriting is an art and a science. And it’s the primary weapon in the modern marketer’s toolkit. But like content marketing trends come and go, copywriting continually evolves. Audience preferences change, the overall landscape changes, and there’s a reason why copywriters make up 17% of the freelance market in the UK and US: copy is big business. So while there are hundreds of copywriters and copywriting tips out there – in fact I spent most of last year putting together 330 of the best Copywriting Examples – I’ve distilled my top 10 (well, 11 really as I’ve thrown in a bonus), complete with examples below. They’re short, sweet and practical. Let’s get into it. 1. Clear positioning makes for easy copywriting Copywriting doesn’t exist in a vacuum. It’s not something you magic out of thin air. It comes from having something to say. A reason to exist. A point of view. It comes from your product and your brand identity. That’s your positioning. 2. Replace adjectives with data If Content is King, then Data is Queen. Not only should your articles be data-driven, but so should your key messaging. Have a look at the example below and tell me which you find more compelling. Think: show, don’t tell. 3. The first line of your ad is crucial If I don’t read it, I’m not going to read your second line either. In fact, Copyblogger reports eight out of 10 people only read headlines. How can you make it so compelling that it sucks me in? Keep it short. 4. Add rhythm to your copy Repetition. Alliteration. Tricolon. 5. Write memorable lines How do you write something memorable? Twist a familiar line. 6. Include social proof Follow this simple pattern to add social proof effectively. Timeframe Customers Outcome 7. Say no to boring copy Sounds easy, I know. But, here’s a helpful trick to make your copy more interesting. Playful exaggeration. 8. Avoid “dictionary words” Smart writing is simple writing. It’s about communication. The quicker the better. 9. Remember this formula when writing features and benefits Ok, here’s the formula. Write down your favorite feature Ask, “so what?” to find the benefit Contrast the old way with your new way 10. If you want your customer to do something try “If you” Knowing your audience is key. Speaking to them directly works. Start sentences with ‘if you’ so it: Involves the reader Gives up control Let’s them persuade themselves 11. The most important technique you’ve never heard of… Why not include one more tip for good luck? Especially, since it’s so often overlooked. Metonymy — Where a shorthand term stands in for the literal term. Punchy, surprising, colorful. Alright folks. That’s a wrap. Thank you for reading, I hope there are a couple of techniques you can try out today, tomorrow, or even next week. I told you this would be short and sweet – I practice what I preach. See Similarweb In Action Don't miss out! Have the latest data at your fingertips. Try Similarweb free by Harry Dry Founder of marketingexamples.com Harry, founder of Marketing Examples, writes a popular newsletter for over 100,000 subscribers and recently launched \"Copywriting Examples\". Related Topics: Content Marketing This post is subject to Similarweb legal notices and disclaimers. Related Posts Marketing Intelligence Top Trending Keywords on Google: What Are We Searching For? Content Marketing SEO by Darrell Mordecai 18 Min. Jun 17, 2024 Marketing Intelligence Copywriting Psychology: 7 Ways to Make Your Content Stick Content Marketing by Leah Messenger 9 Min. Apr 23, 2024 Marketing Intelligence Digital Marketing Strategy: A Beginner’s Guide Ad Intelligence Content Marketing by Leah Messenger 7 Min. Mar 26, 2024 Marketing Intelligence How to Conduct a Social Media Competitor Analysis: 5 Quick Steps Business Benchmarking Company Research by Leah Messenger 7 Min. Feb 23, 2024 Marketing Intelligence The Essential Guide to YouTube Competitor Analysis Content Marketing by Shai Belinsky 9 Min. Jan 31, 2024 Marketing Intelligence How to Check Website Traffic: Analyzing the Digital Data Ad Intelligence Affiliate Marketing by Limor Barenholtz 14 Min. Jan 17, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "10 Non-Obvious Copywriting Tips that Work"
    },
    {
      "level": "H2",
      "text": "1. Clear positioning makes for easy copywriting"
    },
    {
      "level": "H2",
      "text": "2. Replace adjectives with data"
    },
    {
      "level": "H2",
      "text": "3. The first line of your ad is crucial"
    },
    {
      "level": "H2",
      "text": "4. Add rhythm to your copy"
    },
    {
      "level": "H2",
      "text": "5. Write memorable lines"
    },
    {
      "level": "H2",
      "text": "6. Include social proof"
    },
    {
      "level": "H2",
      "text": "7. Say no to boring copy"
    },
    {
      "level": "H2",
      "text": "8. Avoid “dictionary words”"
    },
    {
      "level": "H2",
      "text": "9. Remember this formula when writing features and benefits"
    },
    {
      "level": "H2",
      "text": "10. If you want your customer to do something try “If you”"
    },
    {
      "level": "H2",
      "text": "11. The most important technique you’ve never heard of…"
    },
    {
      "level": "H3",
      "text": "Top Trending Keywords on Google: What Are We Searching For?"
    },
    {
      "level": "H3",
      "text": "Copywriting Psychology: 7 Ways to Make Your Content Stick"
    },
    {
      "level": "H3",
      "text": "Digital Marketing Strategy: A Beginner’s Guide"
    },
    {
      "level": "H3",
      "text": "How to Conduct a Social Media Competitor Analysis: 5 Quick Steps"
    },
    {
      "level": "H3",
      "text": "The Essential Guide to YouTube Competitor Analysis"
    },
    {
      "level": "H3",
      "text": "How to Check Website Traffic: Analyzing the Digital Data"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Harry Dry"
}