{
  "url": "https://www.similarweb.com/blog/marketing/content-marketing/crisis-strategy/",
  "slug": "crisis-strategy",
  "title": "Digital Strategy is Critical in Times of Crisis | Similarweb",
  "description": "This blog explores traffic trends and winning acquisition strategies to help businesses optimize efforts during the Coronavirus crisis. Enter now!",
  "content": "HomeBlogMarketingContent MarketingWhy a Digital Strategy is Critical in Times of Crisis Marketing Intelligence Why a Digital Strategy is Critical in Times of Crisis Start your free trial by Sarah Mehlman , Sr. Marketing Intelligence Specialist 5 Min. March 30, 2020 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic It’s no secret retailers are worried about how coronavirus will impact their sales. According to a survey by Digital Commerce, 47% of retailers expect the current situation to hurt their revenue. Major brand, Patagonia, announced it will pay employees but will shut all stores for the moment as many countries require people to work from home and practice social distancing. Given strict recommendations from the World Health Organization, 27.5% of US internet users were avoiding public places, a number that could grow as high as 58% if the outbreak worsens. This trend suggests that consumers are likely to opt for online shopping rather than in-store. Until retailers can re-open, the best way to combat this downward trend is a strong digital strategy. This blog explores the overarching traffic trends, shifts in online behavior, and winning acquisition strategies to help businesses optimize their digital efforts. All but three shopping categories (groceries, health and home goods) saw traffic decrease, year over year. Countries already deeper in the COVID crisis see shopping traffic change dramatically each month – sometimes increasing and sometimes losing over last year. An onslaught of new popular keywords meant a shift in paid and organic search strategies for some of the biggest retailers. Consumer browsing behavior has shifted and news consumption increased, leading to dramatic changes in the US media landscape. General Trends: Shopping Category We examined nearly 270 leading shopping sites and found that since January traffic has actually gradually decreased. In February, traffic declined by 0.8%, and in the first two weeks of March by 3.4%. We compared traffic from late 2019 to late 2018, to see if this decline was a part of a longer-term trend. Interestingly, the insights showed there had previously been an increase in traffic during those months. This indicates that the change is very likely related to the coronavirus and not a part of a more long-term shift in consumer behavior. However, while the overall category paints a fairly simple picture, the image is actually quite complex as specific subcategories and sites did experience growth. So, What Sites Experienced Traffic Growth? During March two categories saw traffic growth: the Health and Pharma sectors. These have grown dramatically since the beginning of the outbreak. Interestingly, home and garden sites have also had slight traffic growth in March, following a huge surge throughout February. Most websites in these categories did see a traffic increase in February. Had retailers used this increase as a stepping stone for future campaigns, perhaps March traffic would have looked differently. Unsurprisingly, during this tumultuous time, grocery sites are another category experiencing significant traffic growth. The top 10 grocery sites in the US had a traffic increase 18.9% YoY from December to February. February alone saw traffic increase by 23.4%, and between March 1-14 traffic grew by 35.4%. In fact, Friday the 13th of March had the highest rates of traffic in a single day for grocery sites over the last year: It alone experienced 5.68M visits to the top 10 grocery sites. Things Will Continue to be Rocky To understand what can be expected in the US retail space going forward we analyzed Amazon’s global performance throughout the past few months as a proxy for digital shopping behavior worldwide. While Amazon traffic has decreased in the US, one country heavily affected by coronavirus, Japan, gives us cause to believe things may turn around. Amazon had a significant traffic decline in Japan during January, the peak of the outbreak (-2.0%), but has since had traffic bounce back with a +7.3% increase during February and +3.9% in the first two weeks of March. On the other hand, Italy, which was dramatically affected by the outbreak, sees traffic continue to decline throughout the duration of the outbreak. While it seemed it was ready to bounce back in February, early March shows a continued drop. This is similar to what we saw in Spain, where traffic in February actually outperformed that of 2019, but it has since come down again and is now 5% below the same time last year. Reacting to Change: Tips for Channel Optimization As things continue to shift in the digital space, users’ behaviors and the way they reach relevant sites will change accordingly. Companies need to be aware of these shifts, and how they impact performance. One of the clearest examples of this is organic search. In the Marketplace category, there have been dramatic changes recently. COVID-19 staples that previously brought little to no traffic, like hand sanitizer, surgical masks, and toilet paper, are now the most commonly searched terms in the category. These newly popular searches have grown so high they displayed more commonly used keywords like “Nintendo switch”, “ring fit” and “star wars”. As the demand for these new keywords continues to grow, they are getting pricier to bid on for PPC campaigns as well. For example, as demand for hand sanitizer rose, so did its paid search share. During February, a group of almost 200 keywords related to “hand sanitizer” generated 1.6M searches, 35% of which ended in a click and of those clicks, just 5% were paid. However, as of the last 28 days, 45% of clicks related to hand sanitizers were paid. One of the major reasons the PPC space is becoming more competitive is due to heavy investment from Walmart.com. Walmart wins 18.6% of paid search clicks, followed by Staples.com with 12.8% and Target.com with 10%. Daily and weekly tracking of changes to this keyword group’s traffic distribution is critical to stay on top of the trend. Media Buying and Affiliates Unsurprisingly, news is another space that changed dramatically. While traffic to news sites was down enormously throughout the last year that trend has since ended – traffic to news sites increased from -5.1% in January to +3.3% in February. Of course, as users seek more information about the impending health crisis, we assume that this upwards trend will continue. Notably, recently where news traffic lands has changed as well. cnn.com had significant YoY traffic growth throughout the past 3 months, increasing by +16% in February. This increase is likely due to elections as well as COVID coverage. Similarly, nytimes.com, which was losing traffic earlier this year is now up 18% YoY. Throughout the past two weeks, cnn.com traffic increased 38% YoY, followed by nytimes.com with a 72% increase and washingtonpost.com with 22%. Breaking from this trend, the second-biggest news site, foxnews.com, had traffic decrease by 6.6% during February. It’s never been more important than now for people who work in media buying to note the dramatic changes in audience content consumption and keep up to date with the ever-changing media landscape to optimize campaigns and more effectively drive traffic. We will continue to follow these dramatic changes in online traffic as this situation progresses. If you’d like to learn more about the effects of COVID-19 on digital strategies, download our whitepaper below. Written in collaboration with Liron Hakim Bobrov, Marketing Insights Manager at Similarweb Enjoy 360 Visibility 24/7 Get the data you need to adapt to market changes and industry trends in an instant. Try Similarweb for free by Sarah Mehlman Sr. Marketing Intelligence Specialist Sarah creates engaging content with over 5 years of experience. She enjoys traveling, family time, baking, and Netflix. Sarah holds a psychology degree from Clark University and lives in Israel. Related Topics: Ad Intelligence Affiliate Marketing This post is subject to Similarweb legal notices and disclaimers. Related Posts Marketing Intelligence Digital Marketing Strategy: A Beginner’s Guide Ad Intelligence Content Marketing by Leah Messenger 7 Min. Mar 26, 2024 Marketing Intelligence How to Write Ad Copy (That Actually Converts): 10 Top Tips Ad Intelligence SEM & PPC by Leah Messenger 9 Min. Feb 28, 2024 Marketing Intelligence How to Check Website Traffic: Analyzing the Digital Data Ad Intelligence Affiliate Marketing by Limor Barenholtz 14 Min. Jan 17, 2024 Marketing Intelligence Mind The Gap: A Complete Guide to Traffic Gap Analysis (+ Checklist) Ad Intelligence Affiliate Marketing by Monique Ellis 15 Min. Oct 27, 2023 Marketing Intelligence What is Programmatic Advertising? Definitions and Explanations Ad Intelligence by Ruth Trucks 9 Min. Aug 23, 2022 Marketing Intelligence The Similarweb Marketing Digest: July 2022 Ad Intelligence Affiliate Marketing by Chloe Dougherty 2 Min. Jul 31, 2022 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Why a Digital Strategy is Critical in Times of Crisis"
    },
    {
      "level": "H2",
      "text": "General Trends: Shopping Category"
    },
    {
      "level": "H2",
      "text": "So, What Sites Experienced Traffic Growth?"
    },
    {
      "level": "H2",
      "text": "Things Will Continue to be Rocky"
    },
    {
      "level": "H2",
      "text": "Reacting to Change: Tips for Channel Optimization"
    },
    {
      "level": "H2",
      "text": "Media Buying and Affiliates"
    },
    {
      "level": "H3",
      "text": "Digital Marketing Strategy: A Beginner’s Guide"
    },
    {
      "level": "H3",
      "text": "How to Write Ad Copy (That Actually Converts): 10 Top Tips"
    },
    {
      "level": "H3",
      "text": "How to Check Website Traffic: Analyzing the Digital Data"
    },
    {
      "level": "H3",
      "text": "Mind The Gap: A Complete Guide to Traffic Gap Analysis (+ Checklist)"
    },
    {
      "level": "H3",
      "text": "What is Programmatic Advertising? Definitions and Explanations"
    },
    {
      "level": "H3",
      "text": "The Similarweb Marketing Digest: July 2022"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Sarah Mehlman"
}