{
  "url": "https://www.similarweb.com/blog/marketing/content-marketing/evergreen-content/",
  "slug": "evergreen-content",
  "title": "What Is Evergreen Content & Why Should You Care? | Similarweb",
  "description": "One well-written blog can bring in traffic over the long haul. The key is its long shelf life. Here's the complete guide to evergreen content. Read now.",
  "content": "HomeBlogMarketingContent MarketingHow to Create Evergreen Content? Marketing Intelligence How to Create Evergreen Content? Get your templates by Limor Barenholtz , Director of SEO at Similarweb 8 Min. December 28, 2021 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic I’ll let you in on a little secret when I started working in Content Marketing a few years ago. I had no idea what evergreen content was. Was it about digital transformation and saving trees by writing online? Was it about creating a greener world? Or writing something that is somehow related to a tree? This is 100% where my mind went. In actuality, the last guess wasn’t so far off. What is evergreen content? Evergreen content is a type of content that, like an evergreen tree, stays fresh (and/or relevant) for an extended time. In the SEO world, this refers to queries that have a sustainable search volume throughout the year, preferably for several years. Like most of the work you do with SEO in mind, it’s about the long game with the goal of growing organic traffic over time. This means that ranking for queries that are reliable in terms of their search volumes can be a goldmine for any SEO in that effort. You may be thinking: But wait, don’t blogs live on the internet forever? You’re right, blogs don’t just disappear, but evergreen content is different because it stands the test of time. Some blogs are timely and have information that is relevant for a short time frame – like breaking news stories. Other data-driven blogs and reports have insights that offer value for a month or even a season, but not long-term. Common evergreen formats When you think of evergreen content, the first thing that comes to mind is often blogs. While you aren’t wrong, evergreen content formats don’t fit snugly in that blog box. The reason why is: Not all blogs are classified as evergreen content and not all evergreen content is classified as a blog. Let’s break it down. Here are eight common evergreen formats: ‘What-is’ content (like this blog) How-to content, guides, and tutorials Listicles Glossaries and dictionaries Top tips “History of” articles Product reviews Videos (but not all videos) Now I say common types because it’s not guaranteed to be an evergreen piece of content just because it’s a how-to or listicle, but it is more likely to fall under that category. For example, a how-to ride a bike article will stay relevant as long as flying bikes aren’t created in the near future. On the other hand, an article on how to watch the new Sex and The City reboot, And Just Like That, will lose interest in a few months, and the ways it’s watched will probably change, so it won’t remain evergreen. Videos follow the same format: how to braid hair equals evergreen, while an intro video to the iPhone 8 doesn’t qualify as evergreen, since it was outdated as soon as iPhone 9 came on the market. Now that you’ve got the hang of the content formats and the dos and don’ts of what makes a specific piece of content evergreen, let’s see how it’s done. How to create evergreen content that grows your impact To be 100% honest, evergreen content creation doesn’t differ much from creating any other high-quality SEO content. The main difference is you need to double-check that it will stay relevant for years to come, and always keep optimizing. Here’s a quick guide for curating powerhouse evergreen content. Find the strongest ideas with keyword research All good Content Marketers and SEOs know you start with some quality time finding keywords. My go-to tool is of course Similarweb Keyword Research tool. They don’t just pay me to say that, I actually use the platform to find all the ripest keywords and use them to dig into specific topics to cultivate my content marketing strategy around each quarter. If you execute keyword research properly, scaling your ongoing SEO efforts and growing your content will be fairly easy to do. I start by searching for keywords by industry. We’ll use the travel and tourism industry as our example because I’m daydreaming about a vacation while writing this. Below, you can see non-branded, top-question query keywords for the last year in the U.S. You can see that writing about San Diego, Seattle, or any of these top destinations might be a great place to start building evergreen content for a blog in this industry. Check out the competition – Scan the content forest You can dig in a bit deeper and see what your competitors are doing in the same space with Keyword Phrases. Based on this, I would then include evergreen articles around restaurants, food, and hotels in the top locations. Then you can: Bring all your keyword data together Categorize your keywords by user intent and semantic search Differentiate between short-tail vs. long-tail keywords Select the right mix of keywords to focus on Choose your topics wisely Your keyword research should help you narrow down the topics you want to write new content clusters around. Building a full-funnel strategy by choosing the strongest keyword and planning an evergreen pillar piece for it, then you add a few top of the funnel (TOFU), middle of the funnel (MOFU), and bottom of the funnel (BOFU) pieces. Pro tip: Not all of your MOFU and BOFU pieces will be evergreen. That’s perfectly fine, a good combo is the way to go. If you’re struggling with blog topic ideas that fit into the strategy you want to write about, go back to step one and do some more research. Write and repurpose content Seems so obvious, but it’s an essential step in churning out that fresh, succulent, evergreen content. Once you have your keywords and evergreen topics, you can build out your wishlist of articles, videos, checklists, and whatever else you dream up. Then, create an outline and start typing. Something important to think about as you get your creative juices flowing is how you can duplicate your work. Can you turn your blog into a checklist? Can that video work as an interactive quiz? Give your content as much life as possible, so it lives on for countless years like the mighty evergreen trees it’s named for. Tweet this Optimize for search engines Put your SEO hat on and think Google, Bing, DuckDuckGo. Take out that on-page SEO best practices checklist. Here are some top tips: Weave keywords into the headers, URL, and body copy Add alt text to all images and videos Don’t just stuff keywords on a page Link related evergreen articles together Add internal links from the keywords you are promoting Implement meta tags with the main keywords These will all help you improve your place on the search engine results page (SERPs) and maybe even end up with a featured snippet. Pro tip: If you start seeing lower page views and if your ranking starts to slip, give your content a quick refresh to regain momentum. Track and measure your stats Keeping track of your content is one of the most important parts of the job. To ensure that your pages are actually “evergreen” and keep ranking high over time, you need to keep a close eye on key performance indicators (KPIs) for all assets. The only way to do that effectively is by using a rank tracker. Set up the metrics that let you gauge the performance and benchmark against your competition on the tracking dashboard. An advanced tool allows you to analyze ranking performance in detail and at a large scale. Some common questions you might be asking yourself: What if my content isn’t ranking? Climbing to an appreciable rank may take some time, so you need patience. But if your content staggers after a few months, reevaluate the data of the keywords that you target. Use the rank tracker tool to investigate SERP features, check the zero-click searches rate, and investigate industry trends. Why am I not getting as many page views as expected? See how you distribute your content and try new channels to drive traffic effectively. How come I have little to no leads or conversions? Check which stage of the funnel you targeted. If it’s TOFU, check that your internal links are helpful and you provide valuable calls to action given your audience’s search intent. For MOFU and BOFU content, check that your calls to action make sense and offer value. You can also adjust your product messaging. 10 evergreen content examples There are many examples of evergreen content, but these are the ones that have the potential to make the most impact and lend a hand to your brand in a Google search. “How to” content is suitable for beginners and experts alike. (This blog is a perfect example of this one). Case studies, take a look at these success stories that are one example of these. Checklists have evergreen value. Here’s our SEO Strategy Checklist, which might be useful for you. \" > Download the checklist Templates have serious staying power. Here’s a fresh one from our marketing tactics evergreen blog. \" > Download the template History of content can be a powerful play. Check out this fun example for the history of blogging. “Greatest of” and round-up pieces spark lasting interest. We just posted about the 10 Biggest Digital Trends of 2021 that gives you an idea of what these look like. Comprehensive glossary of ____ like our Digital Marketing Glossary. The complete guide to ____, like this SEO Strategy guide for example. Testimonials empower your business with words of wisdom from your loyal customers. Top ____ list – To circle back to our travel industry here is a top 10 list of restaurants to try in Atlanta. Keeping it fresh Evergreen content is exactly what it sounds like: it’s a type of content that’s ever-lasting and green AKA fresh. To do it successfully, you’ll need to follow the same steps as the rest of your high-quality content, but give it the room to make just as much impact a year from when it’s published. That’s the key. I want to leave you with a little tree humor from growingfamily.co.uk: How do trees access the internet? They log in. Digital Marketing Intelligence at Your Fingertips Get the data you need to adapt to trends in an instant. Try Similarweb free FAQs What is evergreen content? Evergreen content is SEO content that stays relevant for an extended period of time. What is an example of evergreen content? Some examples of evergreen content include ‘what-is’ content, ‘how to’ content, guides and tutorials, and listicles. How do you make evergreen content? There are several steps in creating evergreen content: Utilize keyword research to find effective ideas See what your competitors are doing Choose topics wisely Write and repurpose content Optimize for search engines Track and measure your stats by Limor Barenholtz Director of SEO at Similarweb Limor brings 20 years of SEO expertise, focusing on Technical SEO, JavaScript rendering, and mobile optimization. She thrives on solving complex problems and creating scalable strategies. Related Topics: Content Marketing SEO This post is subject to Similarweb legal notices and disclaimers. Related Posts Marketing Intelligence Top Trending Keywords on Google: What Are We Searching For? Content Marketing SEO by Darrell Mordecai 18 Min. Jun 17, 2024 Marketing Intelligence Copywriting Psychology: 7 Ways to Make Your Content Stick Content Marketing by Leah Messenger 9 Min. Apr 23, 2024 Marketing Intelligence Digital Marketing Strategy: A Beginner’s Guide Ad Intelligence Content Marketing by Leah Messenger 7 Min. Mar 26, 2024 Marketing Intelligence How to Conduct a Social Media Competitor Analysis: 5 Quick Steps Business Benchmarking Company Research by Leah Messenger 7 Min. Feb 23, 2024 Marketing Intelligence The Essential Guide to YouTube Competitor Analysis Content Marketing by Shai Belinsky 9 Min. Jan 31, 2024 Marketing Intelligence How to Check Website Traffic: Analyzing the Digital Data Ad Intelligence Affiliate Marketing by Limor Barenholtz 14 Min. Jan 17, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "How to Create Evergreen Content?"
    },
    {
      "level": "H2",
      "text": "What is evergreen content?"
    },
    {
      "level": "H2",
      "text": "Common evergreen formats"
    },
    {
      "level": "H2",
      "text": "How to create evergreen content that grows your impact"
    },
    {
      "level": "H3",
      "text": "Find the strongest ideas with keyword research"
    },
    {
      "level": "H4",
      "text": "Check out the competition – Scan the content forest"
    },
    {
      "level": "H3",
      "text": "Choose your topics wisely"
    },
    {
      "level": "H3",
      "text": "Write and repurpose content"
    },
    {
      "level": "H3",
      "text": "Optimize for search engines"
    },
    {
      "level": "H3",
      "text": "Track and measure your stats"
    },
    {
      "level": "H2",
      "text": "10 evergreen content examples"
    },
    {
      "level": "H2",
      "text": "Keeping it fresh"
    },
    {
      "level": "H2",
      "text": "FAQs"
    },
    {
      "level": "H3",
      "text": "Top Trending Keywords on Google: What Are We Searching For?"
    },
    {
      "level": "H3",
      "text": "Copywriting Psychology: 7 Ways to Make Your Content Stick"
    },
    {
      "level": "H3",
      "text": "Digital Marketing Strategy: A Beginner’s Guide"
    },
    {
      "level": "H3",
      "text": "How to Conduct a Social Media Competitor Analysis: 5 Quick Steps"
    },
    {
      "level": "H3",
      "text": "The Essential Guide to YouTube Competitor Analysis"
    },
    {
      "level": "H3",
      "text": "How to Check Website Traffic: Analyzing the Digital Data"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Limor Barenholtz"
}