{
  "url": "https://www.similarweb.com/blog/marketing/content-marketing/how-to-writing-guide/",
  "slug": "how-to-writing-guide",
  "title": "How To Write a How-to Article Step-by-Step | Similarweb",
  "description": "Learn how to write a compelling how-to article with writing tips, SEO must-haves, and a step by step guide. We’ve also thrown in a free template. Read now.",
  "content": "HomeBlogMarketingContent MarketingHow to Write a How-to Article Step-by-Step (+Free Template) Marketing Intelligence How to Write a How-to Article Step-by-Step (+Free Template) Get free template by Adelle Kehoe , Director of Content Marketing 11 Min. December 28, 2021 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Have you ever had to explain how Zoom video calls work to family-members or how to get from point A to point B to someone visiting your neighborhood? If so, you’re already halfway to being able to write a helpful how-to article. But to get that extra bit of structure, flair, and inspiration you’ll need to hold your reader’s attention, keep reading. Below, I’ve put together an eight-step guide to writing the perfect how-to article online, along with some additional tips on writing and optimizing ​eye-catching Informational articles for search engines and readers alike. I’ve even included a free-to-download how-to article template – the end result of years of testing and trials using Similarweb Digital Marketing Intelligence – to get you started. \" > Download now Remember, you can skip around this article to the parts that are most useful from your point of view. First, we’re starting with the what behind the how. What is a how-to article? Refreshingly, the name doesn’t leave much to the imagination. A how-to article lays out exactly how to do something. A how-to ​blogger might walk readers through how to buy, use, or troubleshoot a product, or focus on a wider, more general topic instead, like how to bake a chocolate cake. What sets a how-to ​article apart from the rest of the content on the internet is user intent. People clicking on how-to guides aren’t necessarily looking for info around what a topic is, or why they should be interested. They already know, and they already are – your job is to show them how. How to write a how-to article in 8 simple steps A good article should provide practical and clear takeaways that the reader can put into practice. They should avoid jargon, and be made up of a list with easy-to-follow steps and bullet points in chronological order. Choose a Topic Put yourself in the audience’s shoes Research keywords Plan your article’s structure Keep your steps snappy and straightforward Give your guide a unique selling point Set your page up for SEO success Monitor your page’s metrics – and keep optimizing Let’s start with step one. 1. Choose a topic The logic’s infallible – you can’t begin writing a how-to article if you don’t know what you’re going to be writing about. So first, you’ll need to select a topic. The topic you pick will depend on what you want to achieve, your industry, and target audience. You might, for instance, be a company that sells a fairly technical product, so you’d want to publish an article that offers honed, specific advice as to how to use it. In this case, the how-to guide services a specific business need – educating the customer. In this case, the topic will be dictated by your product catalog, for example: How to Assemble an IKEA Kallax How to Set Up a Samsung Neo TV How to Use an Amazon Echo At the opposite end of the spectrum, you could be publishing a how-to content offering additional tips around a more general subject, such as: How to Blow Up a Balloon How to Defrost a Chicken How to Change a Lightbulb In the case of these examples, you’re probably writing the content either to build your brand, or make money via display ads or affiliate marketing. But still – that doesn’t mean your choice of topic for your how-to article should be random. You should always pick topics that fit within your particular niche or industry. ‘How to Blow Up a Balloon,’ for instance, is a great choice of topic for a party supplies website – but not for one specializing in digital marketing. So, think carefully about what you want to write about. If it ties into your brand’s sector and niche, it’s good. If it addresses a direct business or customer need, it’s great. And if you have experience with the topic – and are passionate about writing it – it’s even better! Tweet this 2. Put yourself in the audience’s shoes Now you’ve chosen what you’re going to write about, you’ll need to figure out who you’re writing for. You’ll have to start thinking like your target audience – that is, the people who will read your how-to guide – and tailor the content accordingly. To craft quality content, ask yourself a few questions: What are their pain points? What do they already know? What new information can I offer? What knowledge gaps are they expecting this article to plug? Even better, you can use audience analysis tools, like Similarweb Research Intelligence to dig into the data. On this foundation, you can start building up a comprehensive ‘user profile’ of your article’s intended audience. This’ll then lead to more advanced considerations, like: What other sites do they frequent? What topics or products do they search for online? What is the best channel to promote this content for my audience? (i.e. social media, email, PPC, organic, etc.) What demographics are my readers (location, age, etc.) Knowing your audience is crucial for striking the right balance when it comes to your article’s tone, content, and technicality. An article entitled ‘How to Build a Model Airplane,’ for instance, shouldn’t alienate the beginners among its readership with overly complicated terminology. Similarly, ‘How to Deal With a Breakup’ should adopt a more compassionate, conciliatory tone. 3. Research keywords Now that you know your topic and your audience, you’ll need to find the right keywords – particularly if you have any aspirations to get said audience’s eyes on your how-to article organically. Keywords are words and phrases that people enter into search engines like Google and YouTube to find what they’re looking for online. Here’s an example, using Similarweb Keyword Research Tool found related keywords to ‘How to blow up a balloon’: Now you can see what are the related keywords and questions to get more ideas while brainstorming the sections to include in your piece. You can also select secondary keywords to rank using the “Trending” keywords filter. In this case, the root keyword “Balloons” shows that “birthday balloons” and “balloons online” are both very strong terms to include. Once you’ve identified the primary and secondary keywords you’re hoping to rank for, you are ready to create your outline. 4. Plan your article structure The order in which you write your article is completely up to you. You can start with the first paragraph, or fill out your steps and main points before tackling the introduction and FAQs. But whichever angle you come at your how-to article from, there’s one thing you’ll need in place before your first draft – a structure! Here’s what we recommend: Keep the how-to structure guide For a more detailed deep dive into what content, headings, tips, FAQs, and CTAs you need to include in your piece, I recommend downloading our how-to article template. It’s free to download, and will get you on the fast-track to how-to article success. \" > Download now Pro tip: To take your how-to article to the next level, create a short video covering the main steps you go over. Not only can this increase engagement with your article, but it can help more people find you on YouTube. 5. Keep your steps snappy and straightforward Remember, no one’s here for an essay. So make sure that each step of your article says what it needs to, without ever becoming overlong or bogged down in detail. Less is more, being clear and concise and engaging is key to keeping your target audience engaged (and coming back for more). Moving on… 6. Give your how-to guide a unique selling point Remember, people learn in different ways. Some will be readers, while others will prefer to absorb information via watching, listening, or engaging in hands-on interaction. With that in mind, be sure not to load your how-to article up with too much copy. Break up those text walls with videos, infographics, tables, music, or quizzes, instead. Trust us – it’s not just the visual learners in your audience that’ll thank us. Plus, there are plenty of other ways to bestow a unique selling point upon your content. You can, for instance, give your article a special angle, or hook. For instance: Is your guide ‘step-by-step’ or ‘no-nonsense’? Does it offer ‘everything you need to know,’ or is it simply the ‘ultimate guide’ to the subject matter? Would you brand it for beginners, or for those with a more advanced understanding? Case studies, ‘top tips,’ and expert comments – which you can source from PR databases such as Response Source or Help a Reporter Out – are also great ways of infusing your how-to article with unique, value-adding (and original!) quality content. 7. Set your page up for SEO success You wouldn’t spend a night out on the snowy tundras of Alaska without bundling up warm. So before you push your article out into the unforgiving wilderness of Google’s search engine results pages (SERPs), you’ll need to arm it with all the gear it needs to survive – and thrive – in an online environment. Now, you already started equipping your how-to article for SEO survival when you researched relevant SEO keywords using our keyword research tool and integrated them naturally into your copy. But before you hit ‘Publish,’ you’ll want to make sure you’ve got the rest of the basics downpat, too: Include the keywords you found in the page content Ensure your page has value-driven titles and meta descriptions (with the right character count – about 60 for the title and 160 for the description) Link to other, thematically relevant pages on your site, as well as external sources that will elevate user experience Compress any images on your page to reduce their file size, and drive down the amount of time your how-to article takes to load And that’s just the on-page stuff. There are so many more factors – from the layout and speed of your website to its linking structure and backlink profile – that’ll affect how your page performs. For more SEO tips, skip down to the dedicated section on it below, or check out our comprehensive guide to creating an SEO strategy. And please don’t forget to proofread before you press publish. 8. Monitor your page metrics – and keep optimizing Congratulations – your page is live. All that planning, research, penmanship, and SEO-ing has furnished you with a how-to article worthy of top-tier SERP real estate. But alas – the work doesn’t stop there. Now begins the perpetual process of study, evaluation, and iteration that comes with being the proud author of web content. Among the metrics you’ll want to keep tabs on are: Session duration (can you increase this with a video or infographic?) Bounce rate (can you reduce this with a more engaging introduction?) Page views (can you boost these organically, or with paid advertising?) Ultimately, there’s always something you can do to make a page better. So test, tinker, and never be afraid to experiment – that’s how breakthroughs are made. How to optimize your how-to page for SEO We touched on the basics in Step 7, but – for your how-to article to really get a tune out of Google’s rankings – you’ll want to dabble in the following: Marking up your page with how-to schema In the words of Google, “structured data is a standardized format for providing information about a page and classifying the page content.” In the words of the layman: it’s code that makes it explicitly clear to Google that your article is a how-to guide, specifically – and not some other piece of content with a contrasting intent. Adding this schema to your page will also help optimize it for voice searches – such as those made through Apple Siri or Amazon Alexa – and assist Google in extracting your article’s rich media and showcasing it in the SERPs (pictured). Structured data can be added with code or a programming language, such as JavaScript, or – if you use a content management system – via a plugin. Write conversationally This piece of advice is to help you avoid one of the most common mistakes: too much jargon. You won’t find the key to writing good web copy in the thesaurus – so drop the big words, the long sentences, and the unnecessary wordiness. Instead, write conversationally – that is, in a way that reflects how you actually speak, and how your readers will read and interpret your content. Address your readers as “you,” ask questions, use the active voice, and use analogies and storytelling to forge a connection with your audience. In addition to helping your reader empathize with you – and understand your content – conversational copy and specifically copy that is readable is thought to be preferred by users (and Google), and will also help your article rank for voice searches. After all, when people are saying their inquiries to Google – rather than typing them out – they tend to search as they’d speak. E-E-A-T: Why the author matters E-E-A-T stands for Experience, Expertise, Authority, and Trustworthiness. It’s one of the factors Google uses to rate the overall quality of a how-to article and is tied specifically to the content’s creator – in this case, you! Here, Google’s looking to understand three core elements about you as an author: Experience: Do you have relevant personal experience on the subject? Does your personal experience reflect in the content? Expertise: Are you an established expert in the topic? What kind of experience do you have in the field? Authority: Do you – and the site you’re publishing on – have recognized authority in the space? Is the content you’re writing original? Trustworthiness: Are you trustworthy? Have you checked your sources? Do you rely on expert knowledge? Why should Google rank your content? So if you have all the right credentials to be talking about your topic, don’t hold back. Include a bio of yourself with your how-to article, explaining your experience and motivations, and reaffirming why Joe Public and Google alike should trust you. Equally – if you don’t have that standing just yet – don’t fret. You can build up your E-A-T by: Accruing (and responding to) user reviews Collecting quotes from expert sources (see Step 6 above for more!), then getting those expert sources to mention you Regularly reviewing and updating your content Building up your website’s backlink profile How to write a how-to article: conclusion “Share your knowledge. It’s a way to achieve immortality” The Dalai Lama With these eight steps, you have everything you need to share your knowledge with the world; to turn an idea into a fully-fledged how-to article, and achieve SERP immortality. Now, all that’s left is to… get started. To commit to an idea, use your expertise to develop it, and – through your passion for the content and subject matter – share it with the world. So go show ‘em how it’s done! Enjoy 360 Visibility 24/7 Get the data you need to adapt to market changes and industry trends in an instant. Try Similarweb for Free FAQs What is a how-to article? A how-to article explains exactly how to do something and assumes they already know the what. How should I structure my how-to article? Always try to format your how-to article in a step-by-step format (Google loves it, as will your reader), with an introduction, conclusion, and FAQ section. If you have room, you can also include additional content – such as a ‘What Is,’ or ‘Top Tips for’ sections – to add value. How can I download a free how-to article template? Easily! Simply download Similarweb’s free, no-strings-attached template to walk you through structuring and formatting your how-to guide, with helpful hints around writing CTAs and FAQs, too. \" > Download now by Adelle Kehoe Director of Content Marketing Adelle is passionate about content and has a strong background in content creation, SEO, and marketing. She has helped companies of all sizes enhance their online presence. Related Topics: Content Marketing This post is subject to Similarweb legal notices and disclaimers. Related Posts Marketing Intelligence Top Trending Keywords on Google: What Are We Searching For? Content Marketing SEO by Darrell Mordecai 18 Min. Jun 17, 2024 Marketing Intelligence Copywriting Psychology: 7 Ways to Make Your Content Stick Content Marketing by Leah Messenger 9 Min. Apr 23, 2024 Marketing Intelligence Digital Marketing Strategy: A Beginner’s Guide Ad Intelligence Content Marketing by Leah Messenger 7 Min. Mar 26, 2024 Marketing Intelligence How to Conduct a Social Media Competitor Analysis: 5 Quick Steps Business Benchmarking Company Research by Leah Messenger 7 Min. Feb 23, 2024 Marketing Intelligence The Essential Guide to YouTube Competitor Analysis Content Marketing by Shai Belinsky 9 Min. Jan 31, 2024 Marketing Intelligence How to Check Website Traffic: Analyzing the Digital Data Ad Intelligence Affiliate Marketing by Limor Barenholtz 14 Min. Jan 17, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "How to Write a How-to Article Step-by-Step (+Free Template)"
    },
    {
      "level": "H2",
      "text": "What is a how-to article?"
    },
    {
      "level": "H2",
      "text": "How to write a how-to article in 8 simple steps"
    },
    {
      "level": "H3",
      "text": "1. Choose a topic"
    },
    {
      "level": "H3",
      "text": "2. Put yourself in the audience’s shoes"
    },
    {
      "level": "H3",
      "text": "3. Research keywords"
    },
    {
      "level": "H3",
      "text": "4. Plan your article structure"
    },
    {
      "level": "H3",
      "text": "5. Keep your steps snappy and straightforward"
    },
    {
      "level": "H3",
      "text": "6. Give your how-to guide a unique selling point"
    },
    {
      "level": "H3",
      "text": "7. Set your page up for SEO success"
    },
    {
      "level": "H3",
      "text": "8. Monitor your page metrics – and keep optimizing"
    },
    {
      "level": "H2",
      "text": "How to optimize your how-to page for SEO"
    },
    {
      "level": "H3",
      "text": "Marking up your page with how-to schema"
    },
    {
      "level": "H3",
      "text": "Write conversationally"
    },
    {
      "level": "H3",
      "text": "E-E-A-T: Why the author matters"
    },
    {
      "level": "H2",
      "text": "How to write a how-to article: conclusion"
    },
    {
      "level": "H2",
      "text": "FAQs"
    },
    {
      "level": "H3",
      "text": "Top Trending Keywords on Google: What Are We Searching For?"
    },
    {
      "level": "H3",
      "text": "Copywriting Psychology: 7 Ways to Make Your Content Stick"
    },
    {
      "level": "H3",
      "text": "Digital Marketing Strategy: A Beginner’s Guide"
    },
    {
      "level": "H3",
      "text": "How to Conduct a Social Media Competitor Analysis: 5 Quick Steps"
    },
    {
      "level": "H3",
      "text": "The Essential Guide to YouTube Competitor Analysis"
    },
    {
      "level": "H3",
      "text": "How to Check Website Traffic: Analyzing the Digital Data"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Adelle Kehoe"
}