{
  "url": "https://www.similarweb.com/blog/marketing/content-marketing/topic-clusters/",
  "slug": "topic-clusters",
  "title": "Topic Clusters: The Practice of Building Topic Hubs | Similarweb",
  "description": "What are topic clusters and why are they good for SEO? Learn how to analyze and create create efficient, data-driven content clusters with Similarweb",
  "content": "HomeBlogMarketingContent MarketingTopic Clusters: The Practice of Building Topic Hubs Marketing Intelligence Topic Clusters: The Practice of Building Topic Hubs See Similarweb in action by Sarah Mehlman , Sr. Marketing Intelligence Specialist 8 Min. July 25, 2022 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Who’s a better authority on a subject: someone who wrote one article about it or someone who wrote ten? It’s not a trick question. More content on a specific topic gives you more credibility and increases your authority with search engines. This doesn’t mean start writing a ton of articles on the same topic. In fact, please don’t do that. Rather, it means structuring your content in topic clusters. This model shows Google and other search engines that your website has a lot of knowledge on a subject and that the knowledge is organized to provide website visitors with all the information they need with a smooth and easy browsing experience. Using this structure can give you an almost instant boost in your SEO. If that sounds like something you could use, (who are we kidding, we all can…) then keep reading to find out how to create content clusters that will help you land that top spot in SERPs. What is a topic cluster? A topic cluster is a bunch of related content all grouped together. Generally, a topic cluster is thought of as a wheel with spokes – in fact, this is also known as a ‘hub and spoke’ content strategy. The wheel, or hub, is the main topic – the one your website is an authority on – and the spokes are the cluster pages, different articles that relate to this topic. The spokes are connected to the wheel with hyperlinks that allow website visitors to navigate to relevant articles, and search engines to crawl and understand your site’s structure. For example, let’s say you have a website that reviews electronics. Your main topic could be entertainment systems and then your supporting topics would all be related content such as TVs, stereo systems, video game platforms, etc. Having all of these different articles connected together shows Google that the website is a true authority on entertainment systems. You will likely want to create multiple clusters for your website. In this example, you might also create a cluster of electronic appliances, headphones, and more. Simply put, organizing your content into topic clusters requires three elements: Main Topics Supporting Content Hyperlinks To organize your content into clusters, you should create a lobby or a few pillar pages with your main topics. All the supporting content pages will be linked to the relevant main topic page. Why are topic clusters good for SEO? Let’s start with a story. Once upon a time in 2015, expert marketer Anum Hussain created an experiment to figure out how to improve organic SEO. One of the experiment’s findings was that more links to a page improved SERP ranking. Sounds obvious? Anum broke it down further, showing that internal links were almost as effective as external links at improving SEO. This was a pretty big revelation in 2015 and started the revolution of “Topics over keywords.” Answer searchers’ questions Google’s main goal is to provide searchers with the answers to what they are looking for. The search engine is constantly improving its algorithm to be more helpful and provide users with the best content. In 2020, Google announced that its AI algorithm now understands subtopics. This means that if someone searched for something broad, Google could understand their search intent and related subtopics to ensure that the searcher finds what they need. The following year, Google made another improvement to its algorithm, saying that it now understands how people generally explore a topic. This is referred to as search intent and these are some pretty huge advancements in how Google displays search results. If you can cluster your content to provide people with the information searchers are looking for, Google should thank you with a better SERP ranking. Improve your website’s E-A-T Topic clusters ensure your website provides a comprehensive overview of a subject, which contributes to a website’s E-A-T (Expertise, Authority, and Trust). If Google sees you have multiple interlinked articles about a certain topic, this is a good indication that your website is an expert on the subject, so Google will be more likely to show it to searchers looking for information on that topic. Boost your engagement metrics If you do topic clustering well, your website engagement metrics should improve too, which again is a good signal to Google. For example, if someone lands on your main topic page and sees the relevant links to related content, they are less likely to bounce. They’ll probably click on a link or two, improving your average session duration and pages per session. Topic cluster examples Today, most websites are already using topic clusters to organize content. Let’s take a look at the way we organized our content into clusters at Similarweb. A great topic cluster example is our B2B Sales topic cluster. If you click the link, you’ll see our main topic page for B2B Sales. There are 31 articles (supporting content) related to B2B Sales, covering different concepts including lead generation, sales techniques, marketing tactics, and more. All of the supporting content is linked to the main topic page, and many of the articles are interlinked with each other. Another great topic cluster example is our Business benchmarking cluster. Here we have 43 articles covering every aspect of business benchmarking, from how to benchmark, different types of benchmarking, and specific benchmarks our readers might find useful. We cluster our topics to help our website visitors find the information they need. It also helps us understand if we are missing any content relating to a specific topic so we can write new posts about it. Of course, we also do it to improve our own SEO strategy. How to create a topic cluster content strategy in 8 steps Step 1: Check your competitors When you start with any new strategy, it’s always a good idea to analyze your competitors and see what they’re doing. Take a look at your content competitors’ websites to see how they structure their content. Are they using clusters? What are their main topics? You can also dive in further to see which topics your competitors appear to be authorities on and which topics might include gaps. Topics with gaps could present good opportunities for your main topics that you can be the top authority on. Step 2: Choose your main topics Decide the topics your clusters will center around. How you do this will depend on how much content you’ve already created for your website. If you already have a ton of content and you’re just looking to organize it into clusters, start with the content you already have. List your content and sort it into different topics. You might find that you already have a ton of related content that just needs some restructuring. If you’re starting from scratch, this step takes brainstorming. Think about what topics are related to your business that you could be an expert in. For example, if your website offers healthy recipes, you might create clusters around healthy appetizers, healthy main dishes, healthy desserts, and healthy breakfasts. Look at each topic idea and make sure it is broad enough for multiple articles. Step 3: Create personas and understand their intents Who are the people who will be interested in your content? You should create several personas defined by the common attributes of your target audience. This takes some research, start by: Talk with your existing customers or followers (poll them, survey them, or reach out directly). Use a marketing intelligence tool to analyze the audience already browsing your website and your competitors’ websites Once you understand your personas, it’s important to think about search intent. Understanding search intent will give you a good idea of what content should surround your main topics. You should create content that covers the spectrum of search intent – from informational to commercial and transactional. Pro tip: Also consider where in the marketing funnel your audience is so you can match your content to their stage of the buyer journey. Step 4: Research keywords Now it’s time to drill down into keywords. Researching for keywords related to your topics will help you create your full topic cluster and keyword clusters. Similarweb’s keyword tool can help you find keywords related to your main topics and analyze which are trending upward and which have high search volume. Also look at long-tail keywords, which are often more targeted and easier to rank for. Also, check out what keywords your competitors are using and see if there are any keyword gaps. Step 5: Map your clusters Using your keywords, you need to map all the related articles that will surround your main topics. We recommend using a spreadsheet for this step. Decide on your ‘wheel/hub’ piece, and ensure your ‘spoke’ articles cover relevant search intents. In this mapping stage, you should decide which articles can and should link to each other – remember internal linking is key to making a topic cluster successful. Step 6: Create content Now it’s all about creating quality content for your personas. You already have a ton of knowledge in your field, you just need to write it down using the right keywords and tone to match your personas’ intents. We recommend that the bulk of your cluster is made up of evergreen content. While it’s fun to write about current events and passing trends, evergreen content stands the test of time and will be relevant to search queries long into the future, making it a sustainable content marketing strategy. As you write, there are a few things to remember: Write for your audience: match your tone to the audience and search intent, and use a readability checker to ensure you’re not over-complicating things. Focus on quality: Quality content goes beyond avoiding spelling and grammatical errors (make sure you avoid these!), your content needs to be useful, engaging and authoritative. Use your keywords: Make sure they are in your headlines and the text body so that Google knows your pages are relevant. Of course, make sure you avoid keyword stuffing. Optimize for SEO: Follow an on-page SEO checklist to make sure your content is optimized for Search, and make it easier for Google to understand and rank your content. Step 7: Link it all together Once you’ve created all your content, you need to interlink it all together, as planned in your mapping stage. This means ensuring that all your related content articles are linked to your main topic’s page. You should also link different related articles together to help Google better understand your website structure and hierarchy. Linking pages guide your website’s visitors through your website, keeping them on your site longer and increasing the number of pages they visit. You can put links throughout the content you write or listed at the end of your articles. Try different methods of linking and see what works for you. Step 8: Track, optimize, repeat This might be one of our favorite words here at Similarweb. Nothing is ever finished and everything can be optimized, including your content. Once you’ve created your topic clusters, it’s important to keep track of how your website engagement metrics are changing and see what you can improve. You might notice a content gap and need to create more supporting content for a cluster. Or you might see an opportunity to create more internal links between articles. There is always a way to optimize. Cluster for success We’ve told you how clustering works, so what now? Time to take your first step in this direction by organizing your content in clusters. Next? Wait. Just kidding, you can never just wait in content marketing. Next, you need to track and monitor your progress to see how your clusters impact your SEO performance. Then optimize, update, and keep at it. Tweet us at @similarweb to let us know how this trick impacts your ranking. You can ask us questions there too, so don’t be shy. Stop Guessing, Start Analyzing. Try Similarweb for free FAQ What are topic clusters? Topic clusters are groups of related content that center around a main topic. Clusters include a main topic, supporting content, and links connecting between them. Why should I use topic clusters? Topic clusters make your content easier for search engines and website visitors to browse and they are great for SEO. Extensive content supporting a specific topic increases your authority and helps your website’s E-A-T, one of the top things Google cares about when ranking websites. Topic clusters make your website more likely to show up in SERPs and they keep website visitors browsing your website longer. How do I create topic clusters? Topic clusters include main topics, supporting content, and hyperlinks connecting between them. You can organize your website’s content by dividing it up into topics and ensuring you have enough supporting content to ensure a thorough review of your main topics. by Sarah Mehlman Sr. Marketing Intelligence Specialist Sarah creates engaging content with over 5 years of experience. She enjoys traveling, family time, baking, and Netflix. Sarah holds a psychology degree from Clark University and lives in Israel. Related Topics: Content Marketing SEO This post is subject to Similarweb legal notices and disclaimers. Related Posts Marketing Intelligence Top Trending Keywords on Google: What Are We Searching For? Content Marketing SEO by Darrell Mordecai 18 Min. Jun 17, 2024 Marketing Intelligence Copywriting Psychology: 7 Ways to Make Your Content Stick Content Marketing by Leah Messenger 9 Min. Apr 23, 2024 Marketing Intelligence Digital Marketing Strategy: A Beginner’s Guide Ad Intelligence Content Marketing by Leah Messenger 7 Min. Mar 26, 2024 Marketing Intelligence How to Conduct a Social Media Competitor Analysis: 5 Quick Steps Business Benchmarking Company Research by Leah Messenger 7 Min. Feb 23, 2024 Marketing Intelligence The Essential Guide to YouTube Competitor Analysis Content Marketing by Shai Belinsky 9 Min. Jan 31, 2024 Marketing Intelligence How to Check Website Traffic: Analyzing the Digital Data Ad Intelligence Affiliate Marketing by Limor Barenholtz 14 Min. Jan 17, 2024 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Topic Clusters: The Practice of Building Topic Hubs"
    },
    {
      "level": "H2",
      "text": "What is a topic cluster?"
    },
    {
      "level": "H2",
      "text": "Why are topic clusters good for SEO?"
    },
    {
      "level": "H3",
      "text": "Answer searchers’ questions"
    },
    {
      "level": "H3",
      "text": "Improve your website’s E-A-T"
    },
    {
      "level": "H3",
      "text": "Boost your engagement metrics"
    },
    {
      "level": "H2",
      "text": "Topic cluster examples"
    },
    {
      "level": "H2",
      "text": "How to create a topic cluster content strategy in 8 steps"
    },
    {
      "level": "H3",
      "text": "Step 1: Check your competitors"
    },
    {
      "level": "H3",
      "text": "Step 2: Choose your main topics"
    },
    {
      "level": "H3",
      "text": "Step 3: Create personas and understand their intents"
    },
    {
      "level": "H3",
      "text": "Step 4: Research keywords"
    },
    {
      "level": "H3",
      "text": "Step 5: Map your clusters"
    },
    {
      "level": "H3",
      "text": "Step 6: Create content"
    },
    {
      "level": "H3",
      "text": "Step 7: Link it all together"
    },
    {
      "level": "H3",
      "text": "Step 8: Track, optimize, repeat"
    },
    {
      "level": "H2",
      "text": "Cluster for success"
    },
    {
      "level": "H2",
      "text": "FAQ"
    },
    {
      "level": "H3",
      "text": "Top Trending Keywords on Google: What Are We Searching For?"
    },
    {
      "level": "H3",
      "text": "Copywriting Psychology: 7 Ways to Make Your Content Stick"
    },
    {
      "level": "H3",
      "text": "Digital Marketing Strategy: A Beginner’s Guide"
    },
    {
      "level": "H3",
      "text": "How to Conduct a Social Media Competitor Analysis: 5 Quick Steps"
    },
    {
      "level": "H3",
      "text": "The Essential Guide to YouTube Competitor Analysis"
    },
    {
      "level": "H3",
      "text": "How to Check Website Traffic: Analyzing the Digital Data"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Sarah Mehlman"
}