{
  "url": "https://moz.com/blog/category/international-seo",
  "slug": "international-seo",
  "title": "International SEO - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Tanvir Ali September 20, 2024 International SEO — Whiteboard Friday Whiteboard Friday | International SEO In this episode of Whiteboard Friday, Tanvir covers how to implement international SEO strategies on your site and how to successfully report on their effectiveness. Read this post By: Adriana Stein December 6, 2023 Build a Business Case to Get an International SEO Investment Approved for 2024 International SEO | Marketing Industry Have you been wanting to get an international SEO investment approved? Dig into this article to uncover Adriana’s tips on how to build a business case to do so. Read this post By: Éléonore Frère August 8, 2022 Going International: 15 SEO Steps for a Successful Expansion International SEO Making the decision to expand to a foreign market is a challenging undertaking. Each market has its own specificities in terms of language and culture, different from your local market. This article will guide you through the different SEO processes needed in order to expand and conquer international markets. Read this post By: Christopher Hofman Laursen May 18, 2020 How to Get Quick Results With SEO Sprints: The DriveSafe Case Study SEO Consulting | Marketing Industry | International SEO Currently, many businesses face challenging times and are moving their SEO budget to disciplines which offer quicker wins. But you can also create instant results with SEO: SEO sprints consist of five steps, and they can be performed on a small budget inside a short period. The learnings from one SEO sprint are passed on to the next one, so you can reuse what worked efficiently. Read this post By: BARRY LOUGHRAN March 11, 2020 We Need to Talk About Google's “People Also Ask”: A Finance Case Study Search Engines | International SEO The team at iProspect started noticing that YMYL queries that should return local (UK) content in Google's \"People Also Ask\" results actually have a heavy influence from the US. They decided to analyze over 1,000 of the most-searched-for keywords in the finance industry to see how much of an issue this actually is. Read this post By: Kerry Jones November 30, 2016 5 Takeaways from Earning Links in 130 Countries Content Marketing | Link Building | International SEO What can you do if link building opportunities are scarce in your country? Kerry Jones shares five solutions learned from building links in over 130 different countries. Read this post By: Kaitlin McMichael July 19, 2016 The 15 Most Popular Myths About International SEO, Debunked International SEO | Advanced SEO | SEO Basics If you've been hesitant to start on a global site strategy, the obstacle standing in your way may be nothing more than a myth. Kaitlin McMichael explains the most common misconceptions in international SEO and what you really need to do to harness the power of the international market. Read this post K By: Kate Morris March 29, 2016 The Guide to International Website Expansion: Hreflang, ccTLDs, & More! Advanced SEO | International SEO International search expansion is one of the most confusing technical items in search marketing. This guide is here to help you navigate that expansion. Included are tips, data, link to an international tool, and a bonus international search troubleshooting guide! Read this post By: Rebecca Maynes September 17, 2015 Local Listings: How Canadian Retailers Stack Up and What You Can Learn Local SEO | International SEO When it comes to local listings accuracy, Canada's top retailers are underperforming. A solid local SEO strategy requires superior depth, visibility, reach, and precision. Read this post By: Andrea Francis September 1, 2015 How to Use Content Marketing to Growth Hack Your Way Into the European Markets Content Marketing | International SEO Is your brand struggling to find traction in Europe and beyond? These growth hacks might help flatten the learning curve. Read this post By: Tom Anthony July 13, 2015 An Open-Source Tool for Checking rel-alternate-hreflang Annotations Technical SEO | SEO Tools | International SEO With the increasing number of SEO directives and annotations available, and the ever-changing guidelines around how to deploy them, it is important to automate whatever areas possible. In this blog post I'm going to share an open source Python library which makes it easy to read the hreflang entries from a page and identify errors with them. Read this post By: Liam Curley June 23, 2015 Why ccTLDs Should Not Be an Automatic Choice for International Websites International SEO When it comes to the creating the best domain structure for international websites, the information is frequently cloudy and varied, and most authorities recommend using ccTLDs. Is that really beneficial, though? Liam Curley is here to clear things up. Read this post By: Eli Schwartz December 22, 2014 Study: How Searchers Perceive Country Code Top-Level Domains International SEO Should you use a ccTLD? Do people even know what they are? This study offers some surprising answers for SEOs and business owners who aim to connect with an international audience. Read this post By: Eli Schwartz June 11, 2014 How to Win Big in International SEO: Assume Nothing (and Definitely Don't Stereotype) Content Marketing | Keyword Research | International SEO The most important thing for anyone looking to do international SEO to know is: don’t make assumptions. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "International SEO"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on International SEO"
    },
    {
      "level": "H2",
      "text": "International SEO — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Build a Business Case to Get an International SEO Investment Approved for 2024"
    },
    {
      "level": "H2",
      "text": "Going International: 15 SEO Steps for a Successful Expansion"
    },
    {
      "level": "H2",
      "text": "How to Get Quick Results With SEO Sprints: The DriveSafe Case Study"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "We Need to Talk About Google's “People Also Ask”: A Finance Case Study"
    },
    {
      "level": "H2",
      "text": "5 Takeaways from Earning Links in 130 Countries"
    },
    {
      "level": "H2",
      "text": "The 15 Most Popular Myths About International SEO, Debunked"
    },
    {
      "level": "H2",
      "text": "The Guide to International Website Expansion: Hreflang, ccTLDs, & More!"
    },
    {
      "level": "H2",
      "text": "Local Listings: How Canadian Retailers Stack Up and What You Can Learn"
    },
    {
      "level": "H2",
      "text": "How to Use Content Marketing to Growth Hack Your Way Into the European Markets"
    },
    {
      "level": "H2",
      "text": "An Open-Source Tool for Checking rel-alternate-hreflang Annotations"
    },
    {
      "level": "H2",
      "text": "Why ccTLDs Should Not Be an Automatic Choice for International Websites"
    },
    {
      "level": "H2",
      "text": "Study: How Searchers Perceive Country Code Top-Level Domains"
    },
    {
      "level": "H2",
      "text": "How to Win Big in International SEO: Assume Nothing (and Definitely Don't Stereotype)"
    }
  ],
  "author": "Tanvir Ali\n          \n            Adriana Stein\n          \n            Éléonore Frère\n          \n            Christopher Hofman Laursen\n          \n            BARRY LOUGHRAN\n          \n            Kerry Jones\n          \n            Kaitlin McMichael\n          \n            Kate Morris\n          \n            Rebecca Maynes\n          \n            Andrea Francis\n          \n            Tom Anthony\n          \n            Liam Curley\n          \n            Eli Schwartz\n          \n            Eli Schwartz"
}