{
  "url": "https://moz.com/blog/category/keyword-research",
  "slug": "keyword-research",
  "title": "Keyword Research - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Jo Cameron October 9, 2024 What Is Keyword Intent and How Does It Impact Your Conversion Rate? Keyword Research | On-page SEO | Content Marketing Keyword intent is the key to understanding your audience's needs. Discover how to decode search queries and deliver exactly what they're looking for. Read this post By: Scott Taft August 29, 2024 Build a Search Intent Dashboard to Unlock Better Opportunities Advanced SEO | Content Marketing | Keyword Research If you’ve ever labored for hours classifying keywords by topic and search intent, only to end up with a ton of data you don’t really know what to do with, then this post is for you. Read this post By: Sofia Tyson August 23, 2024 6 Underrated Keyword Research Methods — Whiteboard Friday Whiteboard Friday | Keyword Research 15% of searches in Google every day are new, how can you get ahead of the curve? In this episode, Sofia takes you through six underrated methods to enrich your keyword lists. Read this post By: Meghan Pahinui February 27, 2024 Find Your Difficulty Benchmark – Next Level Moz Tools | Keyword Research With this workflow, you’ll successfully identify your site’s current Difficulty benchmark to help you focus your research, set goals, streamline resource allocation, and set expectations for stakeholders. Read this post By: Dorcas Adisa February 1, 2024 3 Types of Content Gap Analysis to Outrank Your Competitors Content Marketing | Keyword Research Explore 3 types of content gap analysis to help you find high-quality content ideas, monitor your competitors, and beat their SERP rankings. Read this post By: Joe Barron January 30, 2024 How Cognism Generated $441k in Revenue With Money Keywords Keyword Research | Advanced SEO B2B data provider Cognism revamped its SEO strategy to focus on money keywords. Read the case study to find out how SEO generated $441k in revenue. Read this post By: Naomi Francis-Parker January 10, 2024 Breaking the Boundaries of Branding: Harness Non-Branded Traffic for Sustainable Growth Branding | Keyword Research This article will teach you how to attract and nurture non-branded traffic to guide your users through the marketing funnel, converting them into loyal customers for sustained growth. Read this post By: Irina Maltseva January 4, 2024 What To Do After You've Exhausted Your High-Intent Keyword List Keyword Research | Marketing Industry Reached the end of your high-intent keyword list? Discover advanced SEO strategies to identify untapped opportunities and amplify organic traffic. Read this post By: Dani Leitner December 4, 2023 How a Small Travel Blog Gained Topical Authority: A Case Study Blogging | Content Marketing | Keyword Research Explore the journey of a small travel blog's rise to topical authority in this case study. Read this post By: Amin Foroutan November 22, 2023 Build Your Keyword Tool with Python and ChatGPT: A Subreddit Insights Guide Keyword Research | Advanced SEO | AI and SEO Unlock Reddit's SEO goldmine with ease. This guide is for SEO pros, content creators, and marketers seeking to automate Reddit research using Python and ChatGPT. Read this post By: Dr. Peter J. Meyers November 1, 2023 How Google Changes Your Searches (A Study of 10,000 Queries) Search Engines | Keyword Research Uncover the intricacies of Google's search result modifications, revealing how Google strives to understand and meet searcher intent beyond literal keyword matches. Read this post By: Rejoice Ojiaku August 25, 2023 Map Your Keywords to the Buyer's Journey and User Intent — Whiteboard Friday Whiteboard Friday | Keyword Research Rejoice takes you through how to map your keywords to both the buyer’s purchasing journey and the relative user intent. Read this post By: Jon Earnshaw August 18, 2023 Identifying, Fixing, and Preventing Cannibalization — Whiteboard Friday Whiteboard Friday | Keyword Research In this Whiteboard Friday, Jon discusses how to identify, fix, and prevent cannibalization. He identifies three specific types of cannibalization: internal, international, and subdomain. Read this post By: Jo Cameron May 24, 2023 I've Optimized My Site, But I'm Still Not Ranking — Help! — Next Level SEO Basics | Keyword Research | Link Building When all your hard work seems to be going nowhere, there might be a reason. Jo Cameron walks you through a list of things to check and accomplish to make sure your site can start ranking ASAP. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Keyword Research"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Keyword Research"
    },
    {
      "level": "H2",
      "text": "What Is Keyword Intent and How Does It Impact Your Conversion Rate?"
    },
    {
      "level": "H2",
      "text": "Build a Search Intent Dashboard to Unlock Better Opportunities"
    },
    {
      "level": "H2",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Find Your Difficulty Benchmark – Next Level"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "3 Types of Content Gap Analysis to Outrank Your Competitors"
    },
    {
      "level": "H2",
      "text": "How Cognism Generated $441k in Revenue With Money Keywords"
    },
    {
      "level": "H2",
      "text": "Breaking the Boundaries of Branding: Harness Non-Branded Traffic for Sustainable Growth"
    },
    {
      "level": "H2",
      "text": "What To Do After You've Exhausted Your High-Intent Keyword List"
    },
    {
      "level": "H2",
      "text": "How a Small Travel Blog Gained Topical Authority: A Case Study"
    },
    {
      "level": "H2",
      "text": "Build Your Keyword Tool with Python and ChatGPT: A Subreddit Insights Guide"
    },
    {
      "level": "H2",
      "text": "How Google Changes Your Searches (A Study of 10,000 Queries)"
    },
    {
      "level": "H2",
      "text": "Map Your Keywords to the Buyer's Journey and User Intent — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Identifying, Fixing, and Preventing Cannibalization — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "I've Optimized My Site, But I'm Still Not Ranking — Help! — Next Level"
    }
  ],
  "author": "Jo Cameron\n          \n            Scott Taft\n          \n            Sofia Tyson\n          \n            Meghan Pahinui\n          \n            Dorcas Adisa\n          \n            Joe Barron\n          \n            Naomi Francis-Parker\n          \n            Irina Maltseva\n          \n            Dani Leitner\n          \n            Amin Foroutan\n          \n            Dr. Peter J. Meyers\n          \n            Rejoice Ojiaku\n          \n            Jon Earnshaw\n          \n            Jo Cameron"
}