{
  "url": "https://moz.com/blog/category/whiteboard-friday",
  "slug": "whiteboard-friday",
  "title": "Whiteboard Friday - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Tom Capper October 18, 2024 Google HCU: What Can You Do? — Whiteboard Friday Whiteboard Friday | Search Engines | Algorithm Updates In this week’s episode of Whiteboard Friday, Tom follows up on his previous blog post about the Helpful Content Update and provides actionable insights into what you can do if you’ve been impacted by this rollout. Read this post By: Bernard Huang October 11, 2024 SEO Content Has a Packaging Problem — Whiteboard Friday Whiteboard Friday | Content Marketing | AI and SEO In this episode, Bernard explains why SEO content has a packaging problem, introducing concepts such as perspectives to help address the issue. Read this post By: Christopher Long October 4, 2024 5 Ways SEOs Can Use ChatGPT - Whiteboard Friday Whiteboard Friday | Marketing Industry | AI and SEO Dive into this republished episode of Whiteboard Friday from 2023 with Chris Long as he reveals five ingenious ways SEOs can leverage ChatGPT. Read this post By: Ross Simmonds September 27, 2024 Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday Whiteboard Friday | Content Marketing | AI and SEO In this episode of Whiteboard Friday, Ross talks about how search has changed and how we, as marketers, can navigate that change to produce quality content. With the increased use of AI and LLMs, content creation may seem more complex, but it’s still based on the fundamentals we use every day. Read this post By: Tanvir Ali September 20, 2024 International SEO — Whiteboard Friday Whiteboard Friday | International SEO In this episode of Whiteboard Friday, Tanvir covers how to implement international SEO strategies on your site and how to successfully report on their effectiveness. Read this post By: Joel Klettke September 13, 2024 Getting Buy-In for Customer Stories — Whiteboard Friday Whiteboard Friday | Branding | Digital Marketing Agencies In this episode of Whiteboard Friday, Joel discusses how to get client buy-in for being featured in customer stories. He explains why customers might say “no” to being featured and how to pitch the idea of a customer story successfully. Read this post By: Navah Hopkins September 6, 2024 Turn Marketing Into Meaningful Relationships — Whiteboard Friday Whiteboard Friday | Marketing Psychology | Content Marketing In this episode, Navah reminds us that long-term relationships with customers are fostered through communication and value alignment. With budget and consumer behavior in mind, learn how and where can you best serve your customers the content they are looking for. Read this post By: Amanda Jordan August 30, 2024 Your Marketing Ecosystem's Impact on SEO — Whiteboard Friday Whiteboard Friday | Marketing Industry You may have spent a lot of time learning about websites and SEO, but you probably haven't spent a lot of time learning about social or third parties in the real world. Discover how these can impact your SEO, how they are related to your marketing ecosystem, and how they relate to LLMs and AI. Read this post By: Sofia Tyson August 23, 2024 6 Underrated Keyword Research Methods — Whiteboard Friday Whiteboard Friday | Keyword Research 15% of searches in Google every day are new, how can you get ahead of the curve? In this episode, Sofia takes you through six underrated methods to enrich your keyword lists. Read this post By: Joy Hawkins August 16, 2024 How Links Impact Organic Results and Local Packs — Whiteboard Friday Whiteboard Friday | Local SEO | Link Building In this episode, Joy talks about the world of link building as it pertains to local SEO, specifically touching on how links impact local pack rankings. Read this post By: Tom Capper August 9, 2024 Search Intent and the Organic Funnel — Whiteboard Friday Whiteboard Friday | Marketing Industry | Content Marketing In this episode of Whiteboard Friday, Tom connects search intent to the organic funnel and how this can help guide our keyword research. Read this post By: Dana DiTomaso August 2, 2024 Directional Reporting in GA4 — Whiteboard Friday Whiteboard Friday | SEO Analytics | SEO Reporting In this episode of Whiteboard Friday, Dana discusses the importance of directional reporting in GA4 and provides practical tips for how to present traffic data. Read this post By: Britney Muller July 26, 2024 Actionable AI — Whiteboard Friday Whiteboard Friday | Marketing Industry | AI and SEO In this episode of Whiteboard Friday, Britney discusses actionable AI, how to get started, and the steps needed to make that happen. Read this post By: Will Critchlow July 19, 2024 Testing Ideas From the Google API Leaks — Whiteboard Friday Whiteboard Friday | Search Engines How do we know what is and what isn’t a Google ranking factor? In this episode, Will reveals four testing ideas relating to the Google API leaks to help answer that question. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Most Recent Articles on Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Google HCU: What Can You Do? — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "SEO Content Has a Packaging Problem — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "5 Ways SEOs Can Use ChatGPT - Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Navigating Content Marketing Amidst the Rise of AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "International SEO — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Getting Buy-In for Customer Stories — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Turn Marketing Into Meaningful Relationships — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Your Marketing Ecosystem's Impact on SEO — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "6 Underrated Keyword Research Methods — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "How Links Impact Organic Results and Local Packs — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Search Intent and the Organic Funnel — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Directional Reporting in GA4 — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Actionable AI — Whiteboard Friday"
    },
    {
      "level": "H2",
      "text": "Testing Ideas From the Google API Leaks — Whiteboard Friday"
    }
  ],
  "author": "Tom Capper\n          \n            Bernard Huang\n          \n            Christopher Long\n          \n            Ross Simmonds\n          \n            Tanvir Ali\n          \n            Joel Klettke\n          \n            Navah Hopkins\n          \n            Amanda Jordan\n          \n            Sofia Tyson\n          \n            Joy Hawkins\n          \n            Tom Capper\n          \n            Dana DiTomaso\n          \n            Britney Muller\n          \n            Will Critchlow"
}