{
  "url": "https://backlinko.com/hub/seo/broken-link-building",
  "slug": "broken-link-building",
  "title": "Broken Link Building: The Complete Guide",
  "description": "Learn exactly how to build powerful backlinks with Broken Link Building. Includes exact workflows and email templates.",
  "content": "Broken Link BuildingWritten by Brian DeanLast updated Nov. 08, 2023What Is Broken Link Building? Broken Link Building (also known as Dead Link Building) is the practice of building backlinks by replacing links to 404 pages with a working link to a target website. Why Does Broken Link Building Work So Well? It’s simple: Most outreach emails ask for something (a link, a share etc.) without offering ANYTHING in return. But with Broken Link Building, you flip the script. Instead of only asking for something, you offer help first. (Specifically, a list of broken links on someone’s site) I’ll get into the nitty gritty of sending outreach emails for Broken Link Building later. But to give you an idea of how this is different than straight up link begging, here’s an example of a Broken Link Building Email that I recently sent out: See how I offer some help FIRST… then ask for a link? That’s why that person was happy to add my link to their page. With that, here’s how to use Broken Link Building (BLB) to build lots of high-quality backlinks to your site. Best Practices Use Check My Links This is my go-to tool for finding broken links. (And it’s free) To use Check My Links, just install the Chrome Extension. And you’ll see a little icon in the top right hand corner of Chrome. And when you click that icon, Check My Links will automatically check all of the links on that page. And it’ll report which links are broken (404 pages) or have other errors: You can use Check My Links as you browse around sites in your niche. And you can uncover a handful of broken links that way. But if you want to scale this process, you’ll need to actively find and fix broken links in pages that are likely to have lots of them. Which leads us to… Find Pages With Lots of Links When it comes to BLB, you want to focus on pages that have lots of external links. Why? It’s simple math: the more links a page has, the more likely one of them is going to be broken. For example, this page on my site has 5 external links: It’s POSSIBLE that the page has a broken link or two. But it’s not super likely. On the other hand, this post has 187 external links. Which means that page is 38x more likely to have at least one dead link. The question is: How do you find pages with lots of links? It’s simple: use Google to uncover “Resource Pages”. As the name suggests, Resource Pages are pages that curate useful resources on a topic. Here’s an example: And these pages tend to have A LOT of links. You can find resource pages using these search strings in Google: “Keyword” + inurl:resources “Keyword” + intitle:links “Keyword” + “helpful resources” “Keyword” + “useful resources” Here’s an example of the type of page you can find with these search strings: And when you find a solid-looking resource page like this one, run Check My Links. It doesn’t work 100% of the time. But if you keep at it, you’ll find a neglected page that’s rocking some dead links: Find Everyone That Links to a Broken Link Now that you’ve found a broken link, what’s next? Well, you could reach out to that one person and offer your link as a replacement. (More on that later) But if you’re serious about scaling up this process, you don’t want to stop with that one site. Instead, find everyone else that’s linking to that broken link. To do that, pop the dead link to Semrush or any other link analysis tool that you use: And you’ll get a list of people that link to that dead link. Sweet! Now that you have this list, you don’t even need to run Check My Links on these pages. You already KNOW that they have at least one broken link on them. Use The Wikipedia “Dead Link” Technique Wikipedia is another place to find TONS of 404 pages. And not just any 404 pages… dead links that lots of people are linking to. (After all, if something makes it into Wikipedia, tons of people also link to it) Here’s how to do it: First, search in Google with this search string: site:wikipedia.org “keyword” intext:”dead link” Pro Tip: Use a broad keyword in this search string (For example, instead of “SEO”, search for “marketing”). That way, Google will bring up any Wikipedia entry that’s remotely related to your keyword. This will show you pages on Wikipedia that have at least one broken external link. Finally, visit the Wikipedia entry and scroll down to the References section. Any link that you see tagged with “Dead Link” is (obviously) broken. So: what’s next? I don’t recommend trying to replace the link on Wikipedia with a link to your site. Why? First off, Wikipedia links are nofollow. Second, Wikipedia editors don’t mess around. Unless your link really deserves to be there, it’s going to get removed within hours. Instead, pop that dead link into a backlink analysis tool to find other sites that are also linking to that page: Use Two Awesome Semrush Features Built for Broken Link Building There’s nothing wrong with using Google search strings and Check My Links to find broken links. In fact, I still kick off my Broken Link Building campaigns this way. But if you want to find even MORE broken links, I recommend using 2 helpful Semrush features: Site Audit’s “Broken external links” report and “Broken Pages” report in “Backlink Analytics”. Let me show you how these features work with a real-life example… First, you’ll need a competitor’s website. If you don’t have any on-hand, just search for a keyword that you want to rank for… …and add sites in your industry to a list. Next, pop one of those sites into the Semrush “Site Audit” feature. And go to “Warnings” → “# external links are broken”. This will show you all of the broken links on that entire site. (So there’s no need to use Check My Links on thousand different pages. This is a HUGE time saver.) Second, you can use Semrush to uncover broken pages on your competitor’s website… And see who’s linking to those 404 pages. To do that, put a competing site into Semrush. And go to the “Backlink Analytics” → “Indexed Pages” tab. This report shows you pages with the most backlinks pointing to them. By default, Semrush shows you live, working pages. But when you tick the “Broken Pages” option, you can see a list of pages that are broken… and have links pointing to them. Then, just hit “Backlinks” and you can see everyone that’s still linking to that broken page. This is an SEO double whammy. Not only are you getting links to your site… but you’re “stealing” links from your competitors. Offer a VERY Close Replacement There are two ways to use Broken Link Building: The first approach is to use the broken link as a way to get your foot in the door. So instead of saying: “Will you link to me?”, you say: “Here are a bunch of broken links that I found… will you link to me?”. There’s nothing wrong with this approach. In fact, here’s an outreach email I recently sent: As you can see, it’s basically the approach I just described. But if you want to double, triple or even 5x your conversion rate, you want to offer people a replacement for the dead link. That way, the decision of whether or not to add your link is a NO BRAINER. After all, they have a broken link on their page. There’s obviously a reason they have a link there. But now that link doesn’t work. And when you swoop in with a close replacement, it’s a simple job: replace the dead link with a similar piece of content. Here’s an example of this in action: And as you can see, it converts REALLY well. Recreate Dead Content If you want to take things to the next level, you can actually create a piece of content that’s a 1:1 replacement for the dead link. For example, when I ran Check My Links on this page, I found this dead link: Well, I have a blog post on my site that’s kinda sorta similar: But it’s not a slam dunk replacement. So I pop the dead URL into Archive.org. And see what that page used to be: Some people copy the exact same content on their site. But that’s shady. So I don’t recommend it. Instead, use the old content as a template. And create similar resource that’s better and more up-to-date based on that template. Be SUPER Helpful in Your Outreach Pointing out someone’s broken link in an outreach email is nice and all. (After all, you’re still offering up some value) But if you want to take your outreach to the next level, point out all of a page’s broken links… and details on the dead links. Here’s a real life example: I can tell you from experience that this will blow people away and make them much more likely to add your link. Does this take more work than just saying: “I found a broken link. Here’s a replacement on my site?”. Sure. But the huge bump in conversion rate can make this type of outreach worthwhile. Skip Over Dead Sites Every now and again you’ll come across a broken link on a site that’s completely abandoned. Here’s an example: I used to send outreach emails to these sites. But I almost NEVER heard back. (If they don’t care about maintaining their site, why would they care about a few broken links?) So if you do come across a site that looks like it hasn’t been touched in years, I recommend saving time and moving on to the next target on your list. Don’t Be a Pushy Jerkface Being pushy doesn’t help with any type of outreach. And that’s especially true for Broken Link Building. So I recommend gently nudging the person… without straight up asking for a link. Here’s an actual example from an outreach email I sent out a while back: As you can see, not remotely pushy. Find The Right Person One of the big lessons I’ve learned from sending over 10k outreach emails is this: Your email NEEDS to get to the right person. Otherwise, your email is going to end up in the trash folder (or worse yet, the spam folder). And when it comes to this strategy, the “right” person is whoever is in charge of maintaining that page. That way, you’re getting in touch with someone that has the power to swap out the dead link with a link to your site. For example, for a single-author blog like Backlinko, you’d want to use a contact form. That’s simple. But what about a blog with 100+ authors? Or a University site with 50+ departments? That’s where you’ll need do some digging to find the right person. I recommend going through a site’s staff page: You’ll usually find someone that’s listed as an “editor”, “blog manager”, “webmaster” or “web admin” that’s in charge of stuff like fixing broken links. Yup, this takes extra work compared to sending your email to a generic “contact@” email address or contact form. But in my experience, it’s well worth it. Learn More Advanced SEO Strategy That Gets Results: A video that walks you step-by-step through “The Moving Man Method”, which is similar to Broken Link Building. Broken Link Building in Action (Strategies, Outreach Emails and Stats Revealed): Helpful tutorial that shows you how to find tons of broken link building opportunities. A Step-bt-step Backlink Audit: Master how to take a deep dive of all links pointing to your pages, and eliminate spammy, broken and low-quality backlinks holding back your SEO efforts.",
  "headers": [
    {
      "level": "H3",
      "text": "Semrush helps you:"
    },
    {
      "level": "H3",
      "text": "Backlinko readers get:"
    },
    {
      "level": "H2",
      "text": "Grow your online visibility.\r\nOn all key channels.\r\nFrom just one platform."
    },
    {
      "level": "H1",
      "text": "Broken Link Building"
    },
    {
      "level": "H3",
      "text": "What Is Broken Link Building?"
    },
    {
      "level": "H3",
      "text": "Why Does Broken Link Building Work So Well?"
    },
    {
      "level": "H3",
      "text": "Best Practices"
    },
    {
      "level": "H4",
      "text": "Learn"
    },
    {
      "level": "H4",
      "text": "Company"
    },
    {
      "level": "H4",
      "text": "Connect"
    }
  ],
  "author": ""
}