{
  "url": "https://backlinko.com/hub/seo/meta-descriptions",
  "slug": "meta-descriptions",
  "title": "How to Write SEO-Friendly Meta Descriptions",
  "description": "Learn how to write meta descriptions that are SEO-friendly. And lead to more organic clicks.",
  "content": "Meta DescriptionsWritten by Brian DeanLast updated Mar. 14, 2024What Is a Meta Description? A meta description (also known as a “description tag”) is an HTML attribute designed to describe the content of a webpage. Here’s what a meta description looks like in HTML form: < meta name=”description” content=”This is meta description text” /> Most modern search engines, including Google and Bing, no longer use meta descriptions as a direct ranking signal. However, descriptions commonly appear in the SERPs (search engine results page). Which can impact user organic click through rates. Why Are Meta Descriptions Important? Google, Bing and other search engines stopped using meta descriptions in their ranking algorithms years ago. That said, the right meta description can lead to more clicks. Which is a direct ranking factor. In fact, our large-scale analysis of 5M Google search results found that pages with a meta description had an average of 5.8% more clicks vs. pages that were missing their meta description. Even Google themselves recommend writing a meta description for each page on your site. And social media sites (like Facebook and Twitter) sometimes show your description in posts. However, Google doesn’t always show your meta description in the search results. According to Google, they will often replace your meta description with a snippet of content from your page. Even so, writing a unique meta description for every page on your site is still very much worthwhile. And an important search engine optimization best practice. Here’s exactly how to write SEO-friendly meta descriptions. 1. Use Benefit-Driven Copy Your meta description needs to clearly describe the BENEFIT someone will get from your page. What this benefit is depends a lot on what your page is all about. And the keyword that people used to bring up your result. For example, take this post about on-page SEO. The benefit of reading this post is that someone will get a thorough guide to optimizing their content for Google. This is why I emphasize that benefit in my meta description: So yeah, the main benefit for most content will be learning how to do something. So you want to highlight that benefit in your description. But the type of benefit that you talk about will be completely different for an eCommerce product page. A services page. Your homepage. Or a tool. For example, check out the description for this product page from Beardbrand. See how the description mentions “no known DHT-inhibiting ingredients, and featuring Abyssinian and Babassu oils”. I have no idea what that stuff means 🙂 But to someone looking for beard oil, these product features will help them decide whether or not to click on that result. Which leads us to… 2. Stay Under 155 Characters Google limits how much of your meta description tag they show in the SERPs. Specifically, they tend to only show the first 155 characters of your description. So you want to keep your meta descriptions below the 155 character limit. Otherwise, your description could get cut off. Or Google may not use your description at all. (Note: Google’s meta description limit is actually measured by pixel size. Not characters. Technically Google cuts off meta descriptions at 920 pixels. But in most cases, staying below the 155 character limit works well. And it’s much easier to measure.) Most WordPress SEO plugins (like Yoast), automatically count the characters in your title tag and meta descriptions. You can also use the helpful SERP Snippet Preview Tool from Portent. It will make sure that you’re under character limits. And preview how your result will appear to Google searchers. 3. Get Inspiration From Google Ads If you write benefit-oriented descriptions. And stay under Google’s character limit. You’re already ahead of 99% of people writing meta descriptions. But if you want to take your description-writing to the next level, try copying text from Google Ads. Why? The placement of Google Ads are based on how much advertisers bid. But also Quality Score. Specifically, ads with a high Quality Score pay less per click than ads with a low Quality Score. And the #1 factor that impacts Quality Score? Click through rate. In other words: ads that get clicked on a lot, pay less for every click. So when you see an ad in the search results, you can be SUPER confident that it has a high CTR. This means you have a proven copy that you can use in your page’s title and description. With that, here’s how to do it. First, search for your target keyword in Google. (You can also search for variations of the term.) Then, keep an eye out for any copy that multiple ads use. If that copy makes sense for your page, incorporate it into your description. 4. Use The Current Year (or Month) This only makes sense if your content is SUPER time-sensitive. Otherwise, you don’t need to worry about adding a date to your descriptions. But if your content is something that needs to be super up-to-date, I recommend testing descriptions with dates. For example, take this page optimized around the term “SEO tools”. Someone searching for “SEO tools” wants to make sure that the content that they read is up-to-date. New tools enter the marketplace. Old tools get shut down. And existing tools sometimes completely change what they do. So this is a case where you’d want to emphasize the fact that your content is updated. This is why I mention the year in my meta description: In some cases you might even want to include the month. For example, if your page lists rankings that change all the time (like “Best NFL teams”). Or if you have data or stats that need to be updated on a regular basis (like “Current number of Instagram users worldwide”). The only downside of this approach is that you need to manually change your meta description every month or year. But the boost in CTR can make it absolutely worth it. 5. Include Your Target Keyword You want to mention your target keyword at least once in your meta description. And not because it gives you any direct SEO benefit. (Remember: search engines don’t use the content in your meta description as a ranking signal.) So why use your keyword in your description? Because it can help you get more clicks. Here’s why: First, Google makes your keyword bold in the SERPs. Which helps it stand out. Second, your keyword emphasizes that you’re a good fit for the person’s search query. For example, let’s say you just searched for “SEO checklist”. Seeing the term “SEO checklist” in the #3 result’s meta description makes it more likely you’ll click on it. And as long as your page lives up to the promise, it will result in an overall good user experience for that person. 6. Write Unique Meta Descriptions For Each Page You want to write unique meta description tags for every page on your site. In fact, Google recently recommended that people write unique meta descriptions (vs. autogenerating them). In other words: you don’t want a bunch of duplicate meta descriptions floating around. Is this a pain for an eCommerce site with 5k+ pages? Yup. Is it worth it? Absolutely. 7. Use This Proven Description Formula Over the last 10 years, I’ve tested DOZENS of different description formulas. Some were good meta descriptions. Some were bad. And some literally 3x’d my CTR. From all that testing, here’s the one that’s worked best for me: I recommend giving it a try. Or adapting it for your needs. Either way, it’s a lot easier than writing every meta description from scratch. Learn More Organic CTR: Learn how to optimize your title tag and URls to maximize organic CTR. How Often Does Google Rewrite Meta Descriptions?: Interesting data from Ahrefs that found Google only uses your page’s meta description 62% of the time.",
  "headers": [
    {
      "level": "H3",
      "text": "Semrush helps you:"
    },
    {
      "level": "H3",
      "text": "Backlinko readers get:"
    },
    {
      "level": "H2",
      "text": "Grow your online visibility.\r\nOn all key channels.\r\nFrom just one platform."
    },
    {
      "level": "H1",
      "text": "Meta Descriptions"
    },
    {
      "level": "H3",
      "text": "What Is a Meta Description?"
    },
    {
      "level": "H3",
      "text": "Why Are Meta Descriptions Important?"
    },
    {
      "level": "H4",
      "text": "1. Use Benefit-Driven Copy"
    },
    {
      "level": "H4",
      "text": "2. Stay Under 155 Characters"
    },
    {
      "level": "H4",
      "text": "3. Get Inspiration From Google Ads"
    },
    {
      "level": "H4",
      "text": "4. Use The Current Year (or Month)"
    },
    {
      "level": "H4",
      "text": "5. Include Your Target Keyword"
    },
    {
      "level": "H4",
      "text": "6. Write Unique Meta Descriptions For Each Page"
    },
    {
      "level": "H4",
      "text": "7. Use This Proven Description Formula"
    },
    {
      "level": "H3",
      "text": "Learn More"
    },
    {
      "level": "H4",
      "text": "Learn"
    },
    {
      "level": "H4",
      "text": "Company"
    },
    {
      "level": "H4",
      "text": "Connect"
    }
  ],
  "author": ""
}