{
  "url": "https://backlinko.com/hub/seo/original-research",
  "slug": "original-research",
  "title": "Original Research and Data",
  "description": "A complete guide to using original research to build links and get mentions in the press.",
  "content": "Original Research and DataWritten by Brian DeanLast updated Dec. 17, 2019Why Does Original Research Work So Well For Building Links? There are three reasons that original research work GREAT for link building: First, data helps bloggers and journalists back up their opinions with facts. For example, I published this ranking factors study a few years ago. And our data backed up what lots of content marketing and SEO experts were saying at the time: “Longer content beats short content”. So whenever someone needs to back up their theory with a piece of data, they cite our study: Second, a research study is legit “unique content”. In other words, data helps your blog stand out. Most blogs just rehash the same information. But with a study, your content INSTANTLY stands out and grabs attention. (Especially if you study something new) For example, earlier this year we conducted a large scale (10k results) voice search SEO study: And because no one had done a study like this before, it accumulated dozens of links within weeks: Finally, original research gives news sites an a “plug and play” story. So not only will people mention your research in blog posts… but they sometimes write entire posts about your study. For example, HubSpot wrote an entire post breaking down my voice search study: Pretty cool. This is probably why that, according to BuzzSumo, 47% of all marketers are using original research as part of their content marketing: And SEO PowerSuite found that, when it comes to link building, data and research crush every other content format out there: With that, here’s how to publish original research content. Best Practices Find a Trending Topic When it comes to data-driven content, your topic is everything. Specifically, you want to find a topic that’s growing in popularity. That way, journalists and bloggers will want to cover your study. How do you find a trending topic? Google Trends: Just pop a potential topic into Google Trends and see whether it’s growing or shrinking in popularity. If the line is moving up and to the right, you’re golden. BuzzSumo: This time, type a broad keyword into BuzzSumo. For example, if you’re in the content marketing niche, you’d put “content marketing” into the tool. Then, identify subtopics that are getting lots of shares. These are hot topics that can work really well as a research study. Twitter: This isn’t as precise as BuzzSumo or Google Trends. But you can sometimes find white hot topics with Twitter search. Just be sure to confirm that the topic has long-term interest using Google Trends and BuzzSumo. For example, I noticed that “voice search” was a growing topic in the SEO and content world. And Google Trends confirmed that interest was stable over the last year: That’s why I decided to go all-in on a study on that topic. And because interest in voice search optimization was blowing up, we gave all of those blog posts something concrete to talk about: Publish as a Blog Post If you want to get the lots of links from your study, don’t publish the results as a PDF whitepaper. Instead, reveal your results in a blog post. For example, let’s look again at my Google ranking factors study: Because the results are in the form of a blog post, people can easily share, find and link to it. In fact, 9.34K people have linked to that study: Contrast that with a similar well-done study by SEMRush. They do report some of their findings publicly: But you need to enter your name and email to get access to everything: And because of that, this study has picked up significantly fewer links than we did: (Note: Even though the SEMRush results are only available as a downloadable PDF, 700 sites have linked the sign up page. Which is A LOT. This goes to show how powerful original data can be) If your #1 goal with your study is to build your email list, this approach might make sense. But when it comes to building links, you definitely want to publish everything in a blog post. Pro Tip: Optimize post around keywords that bloggers and journalists search for (like “SEO statistics” or “YouTube Ranking factors”). That way, whenever someone needs a statistic for an article, they’ll find your study. Go Big Use the biggest sample size you possibly can. Why? First, large sample size=stronger statistical significance. In other words, it makes your data more reliable. Second, large numbers attract more attention. For example, one of the reasons my YouTube ranking factors study did so well is the fact that we analyzed a million results: The massive sample size ensured that our findings were reliable and not just a fluke: The fact that we analyzed 1.3 million results (which was WAY more than any other study out there at the time) also grabbed people’s attention: Report Bite Sized Stats Bite sized stats give bloggers something concrete to include in their blog posts. For example, in our voice search study we reported this stat: Which gave bloggers an easy tip they could reference in their content: In fact, I recommend including a list of bite sized statistics at the beginning or end of your results. Provide Embeddable Visuals Visualize your data with charts, graphs, infographics and videos. First off, visuals make your data easier to understand: Second, just like with a bite sized statistic, people will use your visuals in their blog posts: And link back to the original source (the study) or your homepage as an “image source”: Learn More Marketers Agree: Original Research Drives Website Traffic And Social Shares: A survey that found original research works really well for traffic, links and shares on social media. How Fractl Leveraged Content Marketing to Increase its Referral Traffic 6,718%: How one agency blew up their organic traffic with research-based content.",
  "headers": [
    {
      "level": "H3",
      "text": "Semrush helps you:"
    },
    {
      "level": "H3",
      "text": "Backlinko readers get:"
    },
    {
      "level": "H2",
      "text": "Grow your online visibility.\r\nOn all key channels.\r\nFrom just one platform."
    },
    {
      "level": "H1",
      "text": "Original Research and Data"
    },
    {
      "level": "H3",
      "text": "Why Does Original Research Work So Well For Building Links?"
    },
    {
      "level": "H3",
      "text": "Best Practices"
    },
    {
      "level": "H4",
      "text": "Learn"
    },
    {
      "level": "H4",
      "text": "Company"
    },
    {
      "level": "H4",
      "text": "Connect"
    }
  ],
  "author": ""
}