{
  "url": "https://backlinko.com/hub/seo/ranking-factors",
  "slug": "ranking-factors",
  "title": "Search Engine Ranking Factors",
  "description": "Learn about the major ranking factors that search engines use to rank websites.",
  "content": "Search Engine Ranking FactorsWritten by Brian DeanLast updated Aug. 15, 2024You may have read that Google uses 200 ranking factors in their algorithm. Fortunately, you don’t need to master all 200 to succeed with SEO. In fact, you’re better learning about the small set of ranking factors that have the biggest impact. 13 Search Engine Ranking Factors Here are the most important ranking signals in Google’s algorithm right now (in 2022). 1. Content Quality Quality content is the ultimate ranking factor. You can have a site that’s perfectly optimized for SEO. But if your content stinks, it simply won’t rank. The question is: When it comes to SEO, what does “quality content” look like? Thorough Google wants content that completely answers someones query. That’s probably why one industry study found that longer content ranks above short content: So make sure that your content is thorough and complete. Useful In other words: Does your content satisfy what a user wanted when they decided to do a Google search? For example, let’s say you search for “Crossfit exercises”. A post that lists 17 Crossfit exercises is MUCH more useful than an opinion piece about why Crossfit exercises are great for weight loss. So make sure your content is insanely useful. Structured Last up, SEO-friendly content is highly-structured. Why is this important? First, well-structured content is easy to read. Which means that users can get the answer to their question faster. Second, organizing your content into sections helps Google understand what your content is all about. So make sure your content is structured and well-organized. 2. Content Uniqueness It’s one thing to have a great piece of thorough, useful and structured content. But if it regurgitates information that’s already out there, it’s probably not going to rank well. (After all, Google has content with the same information in its index already. Why would they rank yours above it?) That’s why your stuff needs to be different or better than the content on page 1. When you do that, you’ll have a HUGE leg up on the competition. For example, when I published this guide to voice search, there was nothing else remotely like it on the web: And because my content provided value that no other content did, it started to rank for on the first page of Google for competitive keywords (like “voice search) within a few weeks: 3. Fully Crawlable Page If you want to rank, it’s VERY important that search engines can fully crawl and index the content on your page. In other words: If search engines are blocked from accessing the page (for example, from Robots.txt), they won’t index the page at all. And if they can’t access certain parts of your page, that’s going to hurt your search engine visibility too. You can easily check if your page is fully accessible to search engines using the “URL Inspection” feature in the Google Search Console: 4. Mobile Optimized Site Google has said that: “Mobile pages that provide a poor searcher experience can be demoted in rankings or displayed with a warning in mobile search results.” In other words: To rank in 2020, your site NEEDS to work well on any device. (Desktops, phones, tablets and TVs) Fortunately, Google has created a nifty free tool called the “Mobile-Friendly Test”. It tells you whether or not your page is optimized for mobile… …with specific recommendations on fixing it. 5. Number of Backlinks A backlink is like a vote from another website. Search engines like Bing and Google measure these votes. And they use them to figure out which pages deserve to rank in the top 10. For example, this page on my site has 6,700 total backlinks: Which has helped it climb the rankings for my target keyword: “on-page SEO”. The bottom line? The more backlinks a page gets, the better it will rank in search engines. 6. Domain Authority A link pointing directly to a page will help that page rank better. But these links also help boost your site’s overall Domain Authority, which is your site’s authority as a whole. And the higher your Domain Authority, the better all of the pages on your site will rank. The best way to boost your Domain Authority is to create an awesome site. 7. Anchor Text Google uses anchor text to figure out what a page is about. For example, someone recently linked to my site with the anchor text: “backlinks” This anchor text tells Google: “Other people are linking to this page with ‘backlinks’ anchor text. This page must be about backlinks.” 8. Site Loading Speed Your site’s loading speed is a VERY important ranking factor. (Especially how quickly your page loads on mobile devices) In fact, Google has even come out and said that “page speed is a ranking factor for mobile searches.” 9. Keyword Usage I’m going to sound like Captain Obvious here, but stay with me: If you want to rank for a keyword, you need to use that keyword on your page. Otherwise, Google won’t know that your page is about that keyword. For example, here’s a page on my site optimized around “link building” As you can see, I use the keyword “link building”, a few times in my content. (I should also point out that I don’t go overboard and use my keyword 100 times. That’s called “keyword stuffing”, which can work against your SEO efforts). Another thing to keep in mind: You don’t need to use your exact keyword every time. In fact, it’s smart to include variations of your main keyword in your content. For example, if your keyword is “Paleo Desserts”, you’d also want to use terms like “Paleo Diet Desserts” and “Paleo Cookies”: 10. Google RankBrain RankBrain is the AI part of Google’s algorithm. How important is RankBrain? Well, Google has confirmed that RankBrain is one of their “top 3” ranking factors: RankBrain’s main job is to figure out what a searcher wants… and serve them up the best results for that search. Because RankBrain is a machine learning algorithm, it’s constantly changing. Which makes it tricky to optimize for. So my advice is this: The best way to “optimize” for RankBrain is to create awesome content that makes searchers happy. 11. Search Intent Match Does your content match what a searcher wants at that particular moment? If so, you’re going to find yourself with a massive rankings boost. That’s because Google is trying to downgrade traditional ranking factors (like keywords and links) in favor of ranking factors that answer the question: “Does this content give the searcher what they were looking for?”. In fact, Google employs thousands of “Quality Raters” to measure how well the search results satisfy search intent. How about an example? Let’s say you just did a search for “link building”. Google closely monitors how you interact with the search results. For example, if you click from the first results — and quickly bounces back to the search results — that’s a strong sign that the result didn’t make you happy. (The act of bouncing around the results is called “Pogosticking”) But if you click on a result and get exactly what you were looking for, Google will push that result to the top. 12. Content Freshness Google does NOT want to rank out of date stuff. That’s why you might have noticed that brand new content gets a temporary rankings boost: (Usually for day or two) That said, “Freshness” is still important weeks or months after your content goes live. Specifically, Google wants to see that your content is still relevant and up to date. For example, let’s say you just published a massive iPhone buying guide. Well, unless you update that content on a regular basis, it’s going get out of date REALLY quickly. Google measures freshness directly (they check to see if the content has been updated since you published it… and how often.) But they also use User Experience Signals to see if people start interacting with your content differently (for example, they notice people start bouncing from the page right away). That’s why it’s important that you regularly update your content to keep it fresh. For example, I update almost every page on my site at least once per year. But even if you’re not in a fast-changing industry like SEO, I still recommend updating your content once per year to keep it fresh in the eyes of Google (and users). 13. E-A-T Google’s newest Search Quality Guidelines state: “…the amount of expertise, authoritativeness, and trustworthiness (E-A-T) is very important”. In other words: Google wants to promote content written by legit experts on that topic. Here are 3 quick tips to help you optimize for E-A-T. Identify Authors Make it easy for Google to know WHO wrote a particular piece of content. And whenever possible, hire or work with well-respected experts in your field. Be Transparent Make sure that users can easily contact you (using a contact form or email address). Reputation Matters Google’s quality raters are instructed to look at a site’s off-site reputation. In other words: They monitor what people online are saying about your site. And if your site has a reputation for publishing useful, trusted content, that’s going to help your rankings in a major way. Learn More Google’s 200 Ranking Factors: The Complete List: A list of 200 (potential) signals that Google uses to rank web pages. We Analyzed 1 Million Google Search Results. Here’s What We Learned About SEO: The largest Google ranking factors study to date. The results of this study will help you identify which ranking signals are most important right now. Google RankBrain: The Definitive Guide: A in-depth guide to Google’s RankBrain algorithm, including actionable tips and strategies.",
  "headers": [
    {
      "level": "H3",
      "text": "Semrush helps you:"
    },
    {
      "level": "H3",
      "text": "Backlinko readers get:"
    },
    {
      "level": "H2",
      "text": "Grow your online visibility.\r\nOn all key channels.\r\nFrom just one platform."
    },
    {
      "level": "H1",
      "text": "Search Engine Ranking Factors"
    },
    {
      "level": "H1",
      "text": "13 Search Engine Ranking Factors"
    },
    {
      "level": "H3",
      "text": "1. Content Quality"
    },
    {
      "level": "H3",
      "text": "2. Content Uniqueness"
    },
    {
      "level": "H3",
      "text": "3. Fully Crawlable Page"
    },
    {
      "level": "H3",
      "text": "4. Mobile Optimized Site"
    },
    {
      "level": "H3",
      "text": "5. Number of Backlinks"
    },
    {
      "level": "H3",
      "text": "6. Domain Authority"
    },
    {
      "level": "H3",
      "text": "7. Anchor Text"
    },
    {
      "level": "H3",
      "text": "8. Site Loading Speed"
    },
    {
      "level": "H3",
      "text": "9. Keyword Usage"
    },
    {
      "level": "H3",
      "text": "10. Google RankBrain"
    },
    {
      "level": "H3",
      "text": "11. Search Intent Match"
    },
    {
      "level": "H3",
      "text": "12. Content Freshness"
    },
    {
      "level": "H3",
      "text": "13. E-A-T"
    },
    {
      "level": "H4",
      "text": "Learn"
    },
    {
      "level": "H4",
      "text": "Company"
    },
    {
      "level": "H4",
      "text": "Connect"
    }
  ],
  "author": ""
}