{
  "url": "https://backlinko.com/hub/seo/semantic-seo",
  "slug": "semantic-seo",
  "title": "Semantic SEO: What It Is and Why It Matters",
  "description": "What is Semantic SEO? And how do you use it to get higher Google rankings? I’ll show you how to tap into Semantic SEO in this detailed guide.",
  "content": "Semantic SEOWritten by Brian DeanLast updated Sep. 20, 2024What Is Semantic SEO? Semantic SEO is the strategy of creating content for topics rather than just keywords. It focuses on understanding search intent and providing comprehensive, high-quality information that addresses the user’s needs. This approach considers context and the relationships between words to improve search engine rankings and deliver more valuable content to readers. Why Is Semantic SEO Important? Back in the day Google evaluated a page’s topic based 100% on relevant keywords. For example, if you wrote a page that used a keyword “Paleo Diet” over and over again, that told Google: “That keyword appears all over the page. This page must be about the Paleo Diet!” Then, in 2013, Google launched their Hummingbird Algorithm. This search engine algorithm changed how Google Search worked in a major way. Instead of only looking at keywords, they now read and understand a page’s overall topic. (Very similar to how a human would.) For example, if you typed “Paleo diet health benefits” in the search bar pre-Hummingbird, Google would show you pages that had that exact phrase on the page: But Hummingbird is smarter than that. Yes, Google still looks for keywords. But they don’t rely on them. So instead of only scanning pages for keywords, they look for pages that cover the core topic “Paleo diet and health” best. And present those results to users: Best Practices Publish “Topically Relevant” Content Some time ago, I ran the largest Google ranking factors correlation study ever conducted (over 11 million search results analyzed). And one of our most surprising findings was how powerful “Topically Relevant” content turned out to be. So: What is “Topically Relevant” content? And how can you optimize for it? Topically Relevant content is a fancy way of describing content that covers the intended topic in-depth. For example, few years ago I wanted to rank for the keyword “Mobile SEO”. I could have created your average 500-word post like: “7 Ways to Mobile Optimize Your Website”. Instead, I wrote a complete guide to mobile SEO. Instead of a handful of tips, I wrote a guide that covered everything there was to know about optimizing websites for mobile. And because my page was “Topically Relevant”, it quickly rose to the #1 spot in Google: And now it’s time to show you how you can do the same thing with your next blog post. Write Topic Outlines If you want to almost guarantee that your content is Topically Relevant, I HIGHLY recommend “Topic Outlines”. Topic Outlines are outlines that list out all of the subtopics that you’re going to cover in your post. And they make it easy to write the type of in-depth content that Google loves. How about an example? I published this post about backlinks. But before I wrote a single word, I created a Topic Outline. This Topic Outline listed all of the subtopics that fall under the greater topic of “backlinks”. I knew that if I covered these subtopics in my content, Google would see it as Topically Relevant. At one point, my guide ranked #1 (in the Featured Snippet) for the keyword: “backlinks”. Answer “People Also Ask” Questions This is a cool tip that I recently picked up. You might have noticed that Google now has these “People Also Ask” boxes in the search results. People Also Ask Boxes are basically Google telling you: “These are burning questions that people have about this topic”. And when you answer these questions in your content, you’ll not only rank better for your target keyword… but you can also show up inside of these “People Also Ask” boxes. You can either answer these questions directly, like I did here in my post about nofollow links: Or you can just cover the answer to that topic in your post. For example, if you search for “backlinks” one of the questions is: “What is a backlink example?”: So I included an example in my content. Simple. Target Keyword Variations With The Same Page When I first got into search engine optimization, people used to create a different page for every variation of a keyword. For example, you’d create one page optimized around “best cookie recipes”. And another optimized for “best cookies recipe”. The idea was to create a page that was SUPER optimized around that specific keyword. And repeat the process for every different variation of that term. This worked well… for a while. But thanks to updates like Panda and Hummingbird, this approach doesn’t make sense anymore. That’s because Google now shows nearly identical results for variations of the same keywords. For example, when you do a search for “oatmeal cookie recipe” and “oatmeal cookies recipe”, the results are pretty much exactly the same: That’s why you want to target multiple similar keywords with the same page. I’ll explain with an example. One of my top-performing pieces of content is: “YouTube SEO: How to Rank YouTube Videos” Back in the day I would have created one post optimized around “YouTube SEO”. And another around “YouTube SEO 2024”. But thanks to Semantic SEO, I know Google understands that these topics are similar. So I optimized this single post around BOTH keywords. And because Google doesn’t just look at keywords, but uses Semantic SEO to understand my page’s topic, it decided to push my page to one of the top spots for both keywords. Avoid Long Tail Keywords You already learned it doesn’t make sense to optimize different pages around keyword variations.. Well, it turns out that the same rule also applies to most long tail keywords. I’ll explain: Long tail keywords are popular because they’re not super competitive. The problem is this: Thanks to Semantic SEO, Google now lumps similar long tail keywords under the same topic. For example, take two long tail keywords like “link building tips” and “link building techniques”. Google now understands that both of these long tail terms fall under the topic of “link building”. Which is why the results for both are super similar. Instead of long tail keywords, I recommend creating comprehensive content around semi-competitive “Medium Tail” keywords. And if your content is amazing enough, Google will automatically rank it for lots of long tail keywords. For example, my target keyword for this page on my site is “keyword research”. This isn’t an insanely competitive keyword like “SEO”. But it’s also not a long tail keyword like: “best keyword research strategies”. It’s right in the middle. And because my content is so in-depth (and has lots of links pointing to it), it ranks for 330 different keywords: (According to Semrush.) Don’t Ignore Keywords Altogether There’s been a lot of talk lately about “optimizing for topics, not keywords”. And it’s 1000% WRONG. As you just saw, Google can now understand a page’s topic. Which means you don’t need to spoon feed them different keyword variations and long tail keywords. But that doesn’t mean that keywords are dead. Far from it. In fact, Google still recommends that you use keywords on your page: So continue to target keywords (and optimize your content around those terms). The only difference is that you can now target multiple keywords on a single page. And because Google is smart, they’ll rank that single page for the different keywords on your page… and lots of similar terms. Publish Long Content If you’re serious about optimizing for Semantic SEO, you need to get used to writing long content. And by “long”, I mean content that’s 1 thousand, 2 thousand or even 5 thousand words. To be clear: I’m not saying that you should publish content with a bunch of fluff and filler. Instead, I’m highlighting a simple fact: It’s almost impossible to cover an entire topic with a traditional 400-word blog post. Depending on the topic, you might need a few thousand words to cover it. And that’s perfectly OK. For example, this list of 17 SEO tips is 3,439 words. Is this content super long? Yes. But it makes users happy because they get everything they want on a single page. And Google likes this content for the same reason: it’s a single high-quality page that answers a user’s query. Bottom line? Don’t be afraid to publish content that’s super long and in-depth. In fact, it can be a huge SEO competitive advantage. Include Semantically Related Phrases Also known as LSI Keywords. These phrases help Google get a better understanding of your page’s overall topic. (As a bonus, when you use related words and phrases in your content, you’ll also rank for more long tail searches.) Optimize for Conversational Keywords You might have heard that voice search is exploding. (Which is true. According to Google, 41% of all US adults perform at least one voice search per day.) And because voice search queries are more conversational, they feed right into what Semantic Search is trying to do: understand topics, not just individual keywords. In other words: You don’t need to write like a robot to rank in Google. For example, let’s say that your target keyword is: “link building tools SEO”. Back in the day, you’d have to find a way to force that awkward keyword into your content. Not anymore. Today, you can use a natural language version of that term (like “link building tools for SEO”), and still rank for that keyword. The takeaway is this: Use natural language in your content. It helps your content’s semantic SEO. And it also optimizes your content for a growing segment of searches: voice search. Use Structured Data Structured data (Schema) adds a layer of context on top of your content. Schema isn’t an SEO magic bullet (in fact, our correlation study found no correlation between Schema usage and rankings). But structured data DOES help Google understand your content. So it’s worth using in many cases. And as a bonus, structured data can hook you up with Rich Snippets, which can boost your site’s organic CTR. Learn More Moz – Google Hummingbird: Overview of how Hummingbird changes Google’s search results with a focus on The Knowledge graph. Using Related Topics and Semantically Connected Keywords in Your SEO: Excellent video with actionable strategies to help you optimize for Semantic Search.",
  "headers": [
    {
      "level": "H3",
      "text": "Semrush helps you:"
    },
    {
      "level": "H3",
      "text": "Backlinko readers get:"
    },
    {
      "level": "H2",
      "text": "Grow your online visibility.\r\nOn all key channels.\r\nFrom just one platform."
    },
    {
      "level": "H1",
      "text": "Semantic SEO"
    },
    {
      "level": "H3",
      "text": "What Is Semantic SEO?"
    },
    {
      "level": "H3",
      "text": "Why Is Semantic SEO Important?"
    },
    {
      "level": "H3",
      "text": "Best Practices"
    },
    {
      "level": "H4",
      "text": "Learn"
    },
    {
      "level": "H4",
      "text": "Company"
    },
    {
      "level": "H4",
      "text": "Connect"
    }
  ],
  "author": ""
}