{
  "url": "https://backlinko.com/hub/seo/team",
  "slug": "team",
  "title": "How to Build an All-Star SEO Team",
  "description": "A guide to assembling an effective SEO team.",
  "content": "Building an SEO TeamWritten by Brian DeanLast updated Mar. 29, 2024What’s Does an SEO “Dream Team” Look Like? Honestly, there’s no single right answer to this question. The exact makeup of an SEO team depends on your company, your industry and the type of SEO approach you want to focus on. For example: The SEO team on an ecommerce site like Zappos is going to look A LOT different than a media brand like ESPN.com. That said, most SEO teams tend to have the same combination of people and skills. Sometimes one person will be “in charge” of multiple skills (like design and content). And some companies will have entire departments dedicated to one skill (like technical SEO). Either way, here are the skills you need to have in place if you want to build a strong SEO team. Key Skills Every SEO Team Needs to Have Web Development Is SEO moving away from code and more towards content? Yup. Is Google getting better at indexing and ranking pages… without the “help” of traditional SEO signals (like using your exact keyword in your title tag)? For sure. With all that said: code is still the foundation of SEO. So if your technical SEO is messed up, you’re not going to rank. That’s why your SEO team needs a coder. To be clear: you don’t necessarily need a full time developer. For example, if you run a blog, you may only have a few hours per week of development work. But you at least need someone on the team that understands code. Otherwise, you can find yourself with serious technical SEO issues that are holding your site back. For example, Todd McDonald increased his client’s organic traffic by 32.6% simply by cleaning up technical SEO issues. (Issues that had been ignored for MONTHS because no one bothered to look at the site’s technical SEO situation). Content Creation When I say “content creation”, I DON’T mean someone that can bang out 500 word blog posts. Instead, you need someone on your team that can publish AMAZING stuff. Why? According to WordPress 2.3 million blog posts are published every day. Which means it’s harder than ever to publish content that stands out. In other words, your head of content needs to have these skills: The ability to cover an entire topic in a single post. Have a grasp of the content on your niche… and be able to beat what’s out there. Add elements to your content that encourages people to share (stats, controversy, etc.). The ability to collaborate with multiple people on a single piece of content. Knows how to create content for different mediums (blog posts, videos and podcasts). Link Building There’s no doubt that link building remains a top 3 SEO skill. So you need someone on your team that can do things like: Link prospecting Blogger outreach Broken link building Infographic promotion campaigns Unlinked mention link building In other words: someone that knows how to get people to link to the awesome content that you publish. Design At first glance design may not sound like a core SEO skill. But it’s actually SUPER important. Why? Great design helps your content to stand out, grab attention and get links. (In fact, I recently talked to a guy that runs a huge SEO agency. And he told me that 70% of his staff is made up of designers). For example, one of the reasons that our definitive guides do so well is that we invest thousands in design and coding for each one. Marketing and Promotion This is somebody that can see the big picture of your SEO and content marketing efforts. For example, let’s say you’re publishing blog content. And it’s ranking in Google. All good right? Well… maybe. Your marketing and promotion person will figure out if that traffic is made up of your target customer. (And whether or not that traffic is converting into leads or sales) Learn More How to Build an SEO-Driven Content Marketing Team: Great advice on assembling a team of content marketers that know how to rank the content they produce. How Do You Set Smart SEO Goals for Your Team/Agency/Project: Insightful video on getting all of the members of your SEO team on the same page. 9 Powerful SEO Software Tools Used by 7-Figure Agencies: A look at the SEO tools top agencies use to drive results.",
  "headers": [
    {
      "level": "H3",
      "text": "Semrush helps you:"
    },
    {
      "level": "H3",
      "text": "Backlinko readers get:"
    },
    {
      "level": "H2",
      "text": "Grow your online visibility.\r\nOn all key channels.\r\nFrom just one platform."
    },
    {
      "level": "H1",
      "text": "Building an SEO Team"
    },
    {
      "level": "H3",
      "text": "What’s Does an SEO “Dream Team” Look Like?"
    },
    {
      "level": "H3",
      "text": "Key Skills Every SEO Team Needs to Have"
    },
    {
      "level": "H4",
      "text": "Learn"
    },
    {
      "level": "H4",
      "text": "Company"
    },
    {
      "level": "H4",
      "text": "Connect"
    }
  ],
  "author": ""
}