{
  "url": "https://backlinko.com/hub/seo/technical",
  "slug": "technical",
  "title": "Technical SEO",
  "description": "A library of resources to make sure that your technical SEO is in tip top shape.",
  "content": "OverviewTechnical SEO might be the most underrated part of SEO. If your technical SEO is out of whack, you won’t rank… no matter how amazing your content is. But to master the technical side of search, you need to understand key concepts like indexing, URLs, devices, parameters and more. Fortunately, that’s exactly the kind of stuff this section covers. This page contains a library of resources to help your content get found, crawled and indexed by search engines.Website ArchitectureA complete guide to creating an SEO-friendly website architecture. Includes a ton of real life examples. Explore this ResourceSitemapsWhat is a sitemap? And why is it important? Learn everything you need to know about sitemaps right here. Explore this ResourceCrawl BudgetWhat is a crawl budget? And how can crawl budget optimization help your SEO? Get all the key details right here. Explore this ResourcePage Speed and SEOEverything you need to know about page speed and SEO, including details from the latest Google PageSpeed updates. Explore this ResourceRobots.txtWhat is Robots.txt? And how can it help your SEO? I cover everything you need to know about Robots.txt in this super detailed blog post. Explore this ResourceDuplicate ContentWhat is duplicate content? And why is it bad for SEO? Get all the info right here. Explore this Resource",
  "headers": [
    {
      "level": "H3",
      "text": "Semrush helps you:"
    },
    {
      "level": "H3",
      "text": "Backlinko readers get:"
    },
    {
      "level": "H2",
      "text": "Grow your online visibility.\r\nOn all key channels.\r\nFrom just one platform."
    },
    {
      "level": "H1",
      "text": "Technical SEO"
    },
    {
      "level": "H4",
      "text": "Learn"
    },
    {
      "level": "H4",
      "text": "Company"
    },
    {
      "level": "H4",
      "text": "Connect"
    }
  ],
  "author": ""
}