{
  "url": "https://backlinko.com/hub/seo/visibility",
  "slug": "visibility",
  "title": "What Is Search Engine Visibility? And How to Increase It",
  "description": "Everything you need to know about search engine visibility (including a detailed explanation of what it is), all in one place.",
  "content": "Search Engine VisibilityWritten by Brian DeanLast updated Jun. 18, 2024What Is Search Engine Visibility? Search engine visibility (also known as “search visibility” or “SEO visibility”) is the share of traffic that a website receives from its rankings in the organic search results. For example, let’s say that you rank #3 for a specific keyword. Well, according to our Google click through rate industry study, the third result in Google gets 18.6% of all clicks. Which means that your site’s search engine visibility for that specific keyword is 18.6%. You can also calculate your website’s search visibility as a whole using a tool like Semrush. This site-wide number takes all of your rankings into account. And gives you a visibility score that’s based on every single keyword that you rank for. With that explanation out of the way, here’s how to improve your search engine visibility: 1. Target Long Tail Keywords Here’s the deal: If your search engine visibility isn’t where you want it to be, it’s probably because you’re targeting keywords that are way too competitive. In fact, this is a mistake that I made back in the day. When I first got started with keyword research, I’d choose keywords that got lots of searches. So when I found a keyword with 9k searches per month I’d say: “Great! That sounds like a keyword I should target”. Unfortunately, a lot of these keywords had super high keyword difficulty scores, like this: Which meant I had pretty much zero chance of ranking for that keyword. Even if my content was outstanding. Which is why I recommend focusing on long tail keywords. Long tail keywords usually have low levels of competition in SERPs. This means you have a good shot at cracking the top 3 results. For example, a while ago I targeted the long tail keyword: “Semrush vs Ahrefs”. Because that keyword wasn’t insanely competitive, I was able to rank in the top 3 for that term within a month or so. Today, my search engine visibility for that keyword is around 27%. Nice. 2. Check Your Website’s Mobile-Friendliness Google now downranks sites that aren’t optimized for mobile. Fortunately, it’s easy to see if Google considers your site “mobile friendly”. WebPageTest will tell you whether or not your site is properly optimized for mobile devices. 3. Improve Your Title and Description Tags Organic click-through-rate is a KEY Google ranking signal. And the higher your CTR, in general, the higher your site will rank in Google. Question is: How do you get more people to click on your result? Write title tags and meta descriptions that make your result more compelling. Specifically, you want to write title tags that grab attention… without clickbait. And you want your meta descriptions to sell your content. When you do these two things consistently, you can increase your CTR significantly. This CTR boost can lead to higher rankings in Google. And ultimately, improved search engine visibility. 4. Build Backlinks From Relevant Sites There’s no doubt about it: if you want to increase your search engine visibility, backlinks are a must. But not just any backlinks. You need to focus on getting links from websites in your niche. For example, my site is about SEO. And if I got a backlink from a site in the fitness niche, it might help my rankings. A little. But a link from a website about SEO or digital marketing is going to have a MUCH bigger impact. And if you want to build links from other website owners in your industry, I recommend checking out this video. You can also skim through this huge list of link building strategies. 5. Optimize Your Content for Dwell Time Google wants to rank web pages that people LOVE. How do they know if someone is loving a specific piece of content? Dwell Time. Dwell Time is one of the many UX Signals that Google uses to figure out whether a site is a good match for a specific keyword. In fact, our ranking factors study of 11M+ search results found that websites with high Dwell Times tended to have higher rankings vs. sites with low Dwell Times. For example, let’s say that someone clicks on your result. And clicks back to Google 3 seconds later. That’s a super low Dwell Time. And if enough people bounce that quickly, Google will figure out that your site isn’t giving people what they want. And they’ll probably drop you down a few spots. But if people spend 3 minutes on your page, that tells Google a completely different story. That tells Google that your content is a good match for that keyword. And they may rank you higher as a result. And one of the easiest ways to improve Dwell Time? Make your above the fold area super compelling. After all, that’s the first thing someone sees when they land on your site. So it’s important to grab their attention right away. For example, check out this blog post from my site: As soon as you land on that page, you see a handful of things that should stop you from hitting your “back” button: Clear and compelling blog post title Professional blog post banner Cited author (with headshot) “Last updated” date First line of the intro visible 6. Improve Pages That Are Ranking On Page 2 Only about 1% of Google users visit the second page of the search engine results. So one of the BEST ways to improve your search engine visibility is to push your site from page 2 to page 1. Note: While Google SERPs now feature continuous scroll instead of distinct pages, the concept remains the same. Users rarely scroll past the initial set of results, making it even more important to move up from lower positions. First, you need to use the Google Search Console to find keywords where you rank on the second page. Then, look at one of the pages that’s stuck on page 2. And do what you can to improve that page’s SEO. You can improve your content’s search intent so it’s a 1:1 match for that keyword. You can also add more content, examples and strategies so that your content is more comprehensive. You can even add screenshots, charts and videos to make your content more interactive. So yeah, the possibilities here are pretty much endless. But the overall goal is to focus your SEO efforts on that single page so it pushes over to the first page of Google. 7. Add LSI Keywords to Your Content Adding Latent Semantic Indexing (LSI) keywords to your content can help Google figure out what your page is all about. Fortunately, finding LSI keywords is pretty easy. All you need to do is search for your keyword in Google Images. And check out the little tags that show up. Those tags are words and phrases that Google considers closely tied to that keyword. And when you mention those terms in your content, you’ll confirm to Google that your page is really about that keyword. Note: Sometimes you’ll run across a tag or two that doesn’t make sense for your article. Or one that will make your writing sound robotic. If that’s the case, I recommend not using them. Forcing keywords into your content like that can do more harm than good. 8. Internally Link Between Pages Internal linking is a relatively easy SEO technique that can make a big impact on your search engine rankings. All you need to do is find pages on your site with lots of link authority (the “Indexed Pages” report in Semrush is great for this). Then, you want to use internal links to push the link authority that those pages have over to pages that don’t have as many links. For example, this page on my site has over 5,000 backlinks. And, as you can see, I internally link from that page to other key pages on my site. 9. Run a SEO Website Audit Your site’s technical SEO is a sneaky important part of your search engine visibility. If Google can’t crawl and index your site, it’s going to be tough to rank. Even if you have AMAZING content and thousands of backlinks. The thing is: it’s impossible to manually check your HTML for issues and errors. Instead, you want to use an SEO audit tool that will spot issues for you. I personally like the SEO audit feature in Semrush. But if you’re on a budget, the free SEOptimer tool isn’t half bad. Either way, you definitely want to scan your site for technical SEO problems. And get those fixed ASAP. 10. Expand Your “SERP Real Estate” Moving up in the search engine rankings isn’t the only way to improve your search engine visibility. You can also take up more “SERP Real Estate”. In other words: Expand your site’s snippet. Or rank your properties in multiple spots. For example, check out this snippet in Google SERP: See those links underneath meta description? Those are sitelinks. And they help my result take up a few more pixels of SERP real estate. Which leads to more clicks. The easiest way to get more sitelinks is to add a table of contents section to the top of your page, like this: And if you want to REALLY expand your SERP real estate, try to get ranked as a Featured Snippet. A Featured Snippet takes up significantly more space than a traditional snippet. Plus, it tends to show up at the top of the page. You can also expand your SERP real estate with multiple rankings for the same keyword. In other words, create content on these platforms designed to rank alongside a keyword that you already rank for: YouTube Medium Websites that accept guest posts Social media posts and profiles Press releases For example, check out the rankings for this keyword. As you can see, my site ranks in the featured snippet for that term. And one of my YouTube videos is just below it. 11. Increase Your Domain Authority In a perfect world you’d build backlinks directly to the page that you want to rank. But we don’t live in a perfect world 🙂 Plus, it’s tough to convince someone to link to an ecommerce product page. Or a services page. Or even a homepage. Fortunately, you can still improve their search engine visibility. Even without getting backlinks that point directly to those pages. The secret? Increase your domain authority. Our breakdown of 11M Google search results found that a site’s overall link authority strongly correlated with higher rankings. In other words: getting links to ANY page helps every other page on that site rank better. I’m sure you’ve seen this firsthand. You see a site that ranks above you. A site with HORRIBLE content. And you think: “Why do they rank above me?”. The answer is usually that they have a higher domain authority than you do. You can check your site’s domain authority using Semrush. Just enter your homepage into the tool. And it will tell you what your Authority Score (Semrush’s version of domain authority) is. To be clear: there’s no “good” Domain Rating to shoot for. It really depends on your niche. For example, in the marketing niche, most of the big players have a Domain Rating of 85-90. But in the gardening niche, the average Domain Authority is more like 30. So the goal here is just to get a benchmark number. And work to improve it over time. When you do, you’ll likely see your site’s overall search engine visibility quickly improve. Learn More The Definitive Guide to On-Page SEO: A super through guide to on-site optimization that I keep constantly updated. How to Write a Blog Post Guide: SEO techniques and tactics are great. But at the end of the day, the best content usually ranks #1. And this guide will show you how to write blog content that gets results. How to Create an Effective SEO Strategy: This post will help you take a lot of the tips that I outlined here… and turn them into a comprehensive strategy.",
  "headers": [
    {
      "level": "H3",
      "text": "Semrush helps you:"
    },
    {
      "level": "H3",
      "text": "Backlinko readers get:"
    },
    {
      "level": "H2",
      "text": "Grow your online visibility.\r\nOn all key channels.\r\nFrom just one platform."
    },
    {
      "level": "H1",
      "text": "Search Engine Visibility"
    },
    {
      "level": "H3",
      "text": "What Is Search Engine Visibility?"
    },
    {
      "level": "H4",
      "text": "1. Target Long Tail Keywords"
    },
    {
      "level": "H4",
      "text": "2. Check Your Website’s Mobile-Friendliness"
    },
    {
      "level": "H4",
      "text": "3. Improve Your Title and Description Tags"
    },
    {
      "level": "H4",
      "text": "4. Build Backlinks From Relevant Sites"
    },
    {
      "level": "H4",
      "text": "5. Optimize Your Content for Dwell Time"
    },
    {
      "level": "H4",
      "text": "6. Improve Pages That Are Ranking On Page 2"
    },
    {
      "level": "H4",
      "text": "7. Add LSI Keywords to Your Content"
    },
    {
      "level": "H4",
      "text": "8. Internally Link Between Pages"
    },
    {
      "level": "H4",
      "text": "9. Run a SEO Website Audit"
    },
    {
      "level": "H4",
      "text": "10. Expand Your “SERP Real Estate”"
    },
    {
      "level": "H4",
      "text": "11. Increase Your Domain Authority"
    },
    {
      "level": "H4",
      "text": "Learn"
    },
    {
      "level": "H4",
      "text": "Company"
    },
    {
      "level": "H4",
      "text": "Connect"
    }
  ],
  "author": ""
}