{
  "url": "https://backlinko.com/hub/seo/what-is-seo",
  "slug": "what-is-seo",
  "title": "What is SEO? Search Engine Optimization In Plain English",
  "description": "A simple answer to the question: “What Is SEO?”. Plus a complete guide and tutorial for people that are new to search engine optimization.",
  "content": "What Is SEO?Written by Brian DeanLast updated Sep. 03, 2024Search engine optimization (SEO) is the practice of getting targeted traffic to a website from a search engine’s organic (unpaid) rankings. The goal of SEO is to rank your website higher in search results for queries—known as keywords—related to your business. Because ranking higher can lead to more traffic to your site. Which can lead to more conversions for your business (like sales or signups). SEO covers technical aspects of your website and content-specific best practices. To make it easier for search engines like Google to find and understand your content. And to provide a better user experience. Common tasks associated with SEO include creating high-quality content, optimizing content around specific keywords, and building backlinks. The main benefit of ranking for a specific keyword is that you can get “free” traffic to your site, month after month. This guide covers: Why SEO matters How SEO works What types of SEO to use for greater visibility Why Is SEO Important? In short: search is a BIG source of traffic. This is true for business owners in all industries. But it’s also true for our own website. As you can see, over 78% of all of Backlinko’s traffic comes from organic search. Let’s illustrate the importance of SEO with another example: Let’s say that you run a party supply company. According to Semrush’s Keyword Overview tool, 33K people search for “party supplies” every single month in the US. Considering that the first result in Google gets around 27.6% of all clicks, that’s more than 9,000 potential visitors to your website each month if you show up at the top. For one search term. But let’s quantify that: how much are those visitors worth? The average advertiser for that search phrase spends about 1 dollar per click (the Keyword Overview tool provides this data). Which means those 9,000 visitors are worth roughly $9,000 a month. Which you could get for “free” with SEO (it still requires time—and sometimes money as well). And that’s just for that search phrase. If your site is SEO-friendly, then you can rank for hundreds (and sometimes thousands) of different keywords. With one piece of content. But the real value is in what that search traffic can translate to for your business. If you could turn 1% of those visitors into customers, and your average order value is $50, you could earn potential revenue of $4,500 per month from that one post. Organic vs. Paid Results Search engine result pages are separated into two distinct sections: organic and paid results. Organic search results are unpaid. Search engines rank the organic search results based on hundreds of different ranking factors. But in general, organic results are deemed by Google to be the most relevant, trustworthy, and authoritative websites or webpages on the subject. Paid search results are ads that appear on top of or underneath the organic results. Paid ads are completely independent of organic listings. They’re ranked in completely different ways, and we won’t be talking about paid ads in this guide. When we talk about SEO, we’re talking about ranking your website higher up in the organic search results. SEO vs. SEM SEO focuses on acquiring traffic from organic search results through website optimization. Search engine marketing (SEM) combines both SEO and paid search marketing to generate traffic from search engines. For more on this topic, check out our guide to the key differences between SEO and SEM. How Search Engines Work How did you land on this result? Chances are you typed in the search “what is SEO” or something along those lines. And the search engine did the rest. When you search for something in Google (or any other search engine), an algorithm works in real-time to bring you what that search engine considers the “best” results. Specifically, Google scans its index of “hundreds of billions” of pages in order to find a set of results that will best answer your search. How does Google determine the “best” result? Google remains coy about its exact ranking metrics (also called ranking factors). But we do have some information about how Google finds and assesses content. Crawlers (or bots) are used to gather information available on the internet. By using website navigation menus, and reading internal and external links, the bots begin to understand the context of a page. Of course, the words, images, and other data on pages also help search engines understand what they’re about. After Google crawls the pages, various processes (like rendering) and criteria determine whether the content should be added to Google’s index (or database). From there, ranking factors come into play to help Google determine if and where the content should rank in search results. This is a fairly simplified version of the process, but it’s a broadly accurate description of what’s going on behind the scenes. Even though Google doesn’t make the inner workings of its algorithm public, based on filed patents and statements from Google, we know that websites and webpages are ranked based on factors including: Relevancy If you search for “chocolate chip cookie recipes,” you don’t want to see webpages about truck tires. Search relevance refers to the relationship between the search query and the intended search result. Websites with accurate and relevant results typically rank highest for target terms. However, Google doesn’t simply rank “the most relevant pages at the top.” That’s because there are thousands (or even millions) of relevant pages for every search term. So Google needs to use other factors to help it decide if and where to rank content. Authority Authority is a way of describing a website’s potential to rank in search results. There are lots of third-party metrics out there that try to provide a way to directly measure website authority. The question is: how does Google know if a page is authoritative? The most accurate answer is that we don’t know exactly how Google determines this. Or whether they determine any specific “authority” metric at all. But we do know that Google uses links to find and understand content. Specifically, Google says they take into account links from “prominent websites.” What prominent means we can’t be certain. But it likely means relevant to the target site and popular in its own right. Links from other pages are known as “backlinks.” In general, the more high-quality links a page receives, the more authority it has, and the higher it will rank. We’ll discuss how you can get more backlinks later in this guide. Usefulness Content can be relevant and authoritative. But if it’s not useful, Google won’t want to position that content at the top of the search results. Usefulness refers to providing engaging, relevant, and valuable information to website visitors. Content can be well written and error-free. But if it doesn’t help the user achieve what they want, it doesn’t meet the search intent. For example, let’s say that you search for “Paleo Diet.” The first result you click on (Result A) is written by the world’s foremost expert on Paleo. And because the page has so much quality content on it, lots of people have linked to it. But the content is completely unorganized. And it’s full of jargon that most people don’t understand. Contrast that with another result (Result B). It’s written by someone relatively new to the Paleo Diet. And their website doesn’t have nearly as many links pointing to it. But their content is organized into distinct sections. And it’s written in a way that anyone can understand. Well, that page is likely to appear more useful to both users and search engines. Even though Result B doesn’t have as much authority as Result A (due to a lack of backlinks), it can still perform well in Google. (In fact, it may even rank HIGHER than Result A.) Google likely measures usefulness partly based on user experience signals. In other words: how users interact with the search results. If Google sees that people really like a particular search result (i.e., it gets lots of clicks), it may get a ranking boost. There are lots of other factors that affect how a page ranks in search results. But if your content is relevant to your target search terms, is authoritative, and meets the search intent, you’re ticking some important boxes. Let’s see how search engine optimization can help you do that by looking at the three main types of SEO. Types of SEO The three main types of SEO are: On-page SEO Technical SEO Off-page SEO There are other types, like local SEO and video SEO. But we’ll cover the three main types in detail below. 1. On-Page SEO On-page SEO involves optimizing your website’s content for search engines and users. It also involves creating relevant, detailed, and useful content for the search phrases you’re trying to show up for. And it covers tasks like adding valuable internal links and helpful images. But let’s start with keyword optimization. Use Keywords In Your Content Google scans your page and will find specific words and phrases in various places, which we call keywords. This helps it understand what the content is about. And when it sees the same term over and over again, Google says: “This page must be about this keyword!” That’s why it’s important to use your target keyword on your page. Without going overboard and using your keyword 100 times on every page. That’s called keyword stuffing, which can get your site penalized. Also make sure to use synonyms and variations of your target keyword throughout your content. This can help your single page rank for dozens of different keywords. For example, check out this post from my site: Because I include my keyword in my title tag and throughout my content, it’s no surprise that I rank top for that term: But I also include lots of variations of my keyword, along with what are known as LSI keywords. (LSI keywords are basically terms that are closely related to my main keyword.) For example, I include LSI keywords like “outreach tools” and “backlink analysis” in the post: Unsure what keywords and variations to target? Enter a broad term related to your business into Semrush’s Keyword Magic tool to find thousands of ideas. Note: A free Semrush account gives you up to 10 credits per day with this tool. Or you can use this link to access a 14-day trial on a Semrush Pro subscription. Another place to include your target keyword is in your title tag. This can affect how your page ranks in search results. Think about it this way: Your title tag summarizes what your page is all about. When you use your keyword in your title tag, it tells Google that your page is about that keyword. For example, I published this list of SEO tips. And my target keyword for that page is “SEO Tips.” This is why I made sure to include that exact keyword in my title tag: Finally, also include your keyword in your URL. While not a major ranking factor, optimized, logical URLs can help Google (and users) understand what your page is about. The question is: Should you go back and change your existing URLs? It’s obviously up to you. But I usually recommend that people leave their existing URLs as they are—even if they’re not ideal. Because changing your URLs can have a big effect on your rankings. Instead, just focus on creating SEO-friendly URLs for future pages that you publish. But if you do decide to optimize old URLs, make sure to 301 redirect the old pages to the new URLs. Optimize Your Meta Description for Clicks Your meta description isn’t particularly important from a ranking perspective. So why should you bother creating a description? Because people use your description to figure out whether or not to click on your result. For example, check out this description from an important page on my site: See how I really sell my content? That enticing description helps “steal” clicks from the sites ranking above me. Which (obviously) brings in more traffic to my site. Also use your main keyword in your description. While it won’t necessarily influence your rankings, when someone searches for that term, Google will often bold or highlight your keyword. Which helps your site stand out even more in the search results. Bonus tip: If your site runs on WordPress, I highly recommend using the Yoast SEO plugin. Yoast makes it easy to set up your page’s title and description tag. Optimize Your Images Unlike a text-based article, search engines have a hard time understanding what’s inside an image. (Although they’re constantly getting better at this.) So they rely on aspects like your image’s filename, alt text, and title to help them understand what an image actually contains. Here’s how to optimize your images: First, give your image a descriptive filename. For example, check out this screenshot of the number of comments one of our guides got: We used the filename: mobile-seo-guide-comments.png. Simple. Next, use image alt text that describes your image: Finally, give your image a title. I wouldn’t sweat this step as much. I often just copy and paste my alt text here. Create an Awesome User Experience You can have a webpage that’s seemingly well optimized for search engines. But if it looks like this? It’s not going to rank for very long. And users are going to be unlikely to stick around (never mind buy from you). Even though user experience (UX) is subjective, it does impact your SEO. A good user experience is what Google’s ranking systems aim to reward. After all, if your site is hard to use, people aren’t going to spend much time on it. Or share it with others. Or spend money on it. Here are a few ways to provide a great user experience: Use short sentences and paragraphs to make your content easy to read Include useful visuals to break up long sections of text and provide more context for users Implement logical navigation menus to make it easy for users (and search engines) to get around your website Make sure your site works well on desktop AND mobile devices (more on that in the next section) That’s it for the basics of on-page optimization. For more tips and tactics, check out our full guide to on-page SEO. 2. Technical SEO The main goal of technical SEO is to ensure that search engines can easily find, crawl, and index all the pages on your website. If Google can’t easily do these things, it’ll have a tough time ranking your content for relevant search terms. And poor rankings equals poor traffic. So let’s look at some of the key aspects of technical SEO that can help improve your site’s performance. Create a Useful Site Architecture and Leverage Internal Linking When your site is brand new and only has 5 pages, website architecture doesn’t matter all that much. But when your site grows to hundreds or even thousands of pages, how your site architecture is set up can make a big difference. First, you want to create an organized structure (also known as a “hierarchy”) that organizes your pages into categories. Then, you want to point internal links to high-priority pages on your website. (Although you should ideally have internal links pointing to ALL of your pages.) Pro tip: When internally linking, use keyword-rich anchor text. So if you’re linking to a page on your site about cold brew coffee, don’t use anchor text like “click here.” Instead, make sure that your anchor text contains a keyword, like “this cold brew coffee guide.” Further reading: How to Set Up an SEO-Friendly Website Architecture Optimize For Mobile Mobile optimization has gone from “nice to have” in the early days of SEO to “an absolute must.” For two reasons: Google uses a mobile-first indexing approach (meaning the mobile version of your website is the “main” version Google uses for ranking) More than 60% of all traffic comes from mobile devices If you have verified your site in Google Search Console, you can see whether or not your site has any mobile usability issues in the Core Web Vitals report. Google’s Core Web Vitals are a set of metrics used to assess how fast a page loads, how responsive it is to user interactions, and how much the layout shifts as it loads. Both on mobile and desktop. You can find out more in our guide to Core Web Vitals. But essentially: you want to pass them to provide a great user experience for desktop AND mobile users. And if you find that your site isn’t mobile-friendly, that’s an issue that should shoot to the top of your priority list. Here are a few quick ways to improve your mobile-friendliness: Use a responsive design to ensure everything appears and functions properly on different screen sizes Don’t use intrusive popups or ads, as these provide a poor experience—especially on mobile Use appropriate font sizes for mobile devices to boost readability Make all of your buttons and menus easy to tap, not just click Measure and Optimize for PageSpeed A slow-loading website isn’t just annoying for users. It can hurt your SEO too. Google has used page speed as a ranking factor on mobile and desktop since 2018. Fortunately, Google doesn’t make you guess whether or not your site is slow. You can check your website speed with Google’s PageSpeed Insights tool. Not only does it give your page a 0-100 performance rating… …but a laundry list of things you can do to speed things up. As you can see, we have some work to do. Note: Depending on the suggestions you get, you may be able to improve your site’s loading speed with a number of WordPress plugins. If not, you may need a developer to tweak your site’s HTML. Set Up HTTPS Google gives a slight edge in the search results for websites that are secure with HTTPS. In fact, according to Mozcast, 99.4% of first page results are secured with HTTPS encryption. And browsers typically display a warning when you visit a site that’s not secure. So if your site isn’t secure, I recommend setting that up ASAP. The only issue with moving to HTTPS is that your pages suddenly have different URLs. So it’s REALLY important that your pages all redirect to the right URL. (Ideally, you’ll set up HTTPS when you first launch your website.) These are some of the most important aspects of technical SEO. For more actionable guidance, check out our definitive guide to technical SEO. 3. Off-Page SEO Off-page SEO refers to strategies you employ outside of your website. These can include: Link building Local SEO strategies Social media marketing Digital PR And more. But the aspect of off-page SEO that’s often regarded as the most important is link building. So we’ll focus on that for now. Links are a massively important part of search engine optimization. And that’s not likely to change anytime soon. With that in mind, here’s a quick primer on all things link building for SEO. Focus on High-Quality Backlinks Not all links are created equal. Specifically, links from trusted, authoritative sites can pass more authority to your site than a link from a small, low-authority website. And we know from our earlier discussion of why SEO is important that authority can have a major impact on your site’s rankings. Obviously, you want links from high-authority websites. The only rub is that these links are EXTREMELY hard to get. You can use our free website authority checker tool to gauge the authority of any website. Websites with a higher Authority Score are typically great candidates for getting quality backlinks. But you also need to factor in how relevant the target domain is to your website. Aim to Build Links from Relevant Websites Links from sites related to yours are likely to pass more SEO value than links from sites in other, unrelated industries. After all, it looks pretty unnatural if most of the links pointing to your baking site come from video game blogs. Note: It’s perfectly OK to get a few links from unrelated websites. But if these links make up the bulk of your link profile, you could have a problem. For example, here’s a link to my website from Moz: Moz covers SEO. My site is also about SEO. To Google, this is a link from a super-relevant website. That said: “Relevant” doesn’t necessarily mean that the site has to be on your exact topic. For example, some time ago I got linked to from this website about web design. Even though “web design” isn’t exactly the same thing as “SEO,” it’s still related. So that link still counts as a relevant backlink. You can check your current backlink profile with a tool like Semrush’s Backlink Analytics. But HOW do you get other people to link to your website? Implement Winning Link Building Techniques There are countless link building techniques, but there are a few I recommend above all else for beginners. First, the Skyscraper Technique. Because it takes a lot of the guesswork out of creating content that bloggers and journalists will be likely to link to. That’s not to say this process is easy. Far from it. In fact, this approach takes a ton of hard work. But the reason I recommend starting here is the fact that Skyscraper content is relatively straightforward to create and promote. In fact, a while ago, I got 1.7K links to ONE Skyscraper post: For more tips on building links this way, check out our guide to the Skyscraper Method. Second, try guest posting. Guest posting as a link building strategy is pretty controversial. That’s because guest blogging can easily go from a legitimate way to get traffic and exposure to a spammy approach. But when done right, guest posting can be a useful way to get some early links and exposure for your website. While also contributing value to the linking site. With that, here are a few tips to keep in mind as you start guest posting: Only guest post on related websites. Publishing lots of guest posts on unrelated sites is a huge red flag for search engines. Avoid keyword-rich anchor text in your link. Instead, use a link with your brand name as the anchor text (like: Backlinko), and ideally mix it up across guest posts if possible/relevant. Don’t guest post at scale. Backlinks from guest posts should make up a small percentage of your link profile, otherwise it can appear unnatural. If you want to learn how to do it right, check out our comprehensive guest posting guide. Finally, create linkable assets. “Linkable Asset” is a catch-all term for anything that people will happily link to. (It’s sometimes called link bait.) And this goes WAY beyond creating “great content.” That’s because there’s so much “great content” out there already. And publishing yet another “10 Tips for Building a Brand” post isn’t going to push anyone to link to you. Instead, you can create content that’s specifically designed to get links. Here are a few examples of linkable assets you can create: Industry studies Myth-busting articles Visual guides or resources Free tools Curated lists of tips, examples or resources Here’s an example: my complete list of SEO tools. I knew this would be a helpful resource for my readers. But I also realized that this post would be a linkable asset that bloggers in the SEO world would want to share with their audience. And I was right. That page has been linked to more than 2K times to date. (Not to mention another 2K shares on social media.) For more winning backlinking strategies beyond these three, check out our guide to link building for SEO. How to Start Growing Your Website with SEO Following the guidance above will get you off to a great start as an SEO beginner. But there is so much more to it than simply understanding the types and how search engines work. Here are some resources to help you maximize your SEO impact: How to Do Keyword Research: Learn exactly how to find relevant keywords to target using a variety of different methods and tools. How to Create SEO Content: Find out what it takes to create content that ranks highly and drives quality traffic to your website. Master Google Analytics: Learn how to measure your SEO results with our ultimate guide to Google Analytics.",
  "headers": [
    {
      "level": "H3",
      "text": "Semrush helps you:"
    },
    {
      "level": "H3",
      "text": "Backlinko readers get:"
    },
    {
      "level": "H2",
      "text": "Grow your online visibility.\r\nOn all key channels.\r\nFrom just one platform."
    },
    {
      "level": "H1",
      "text": "What Is SEO?"
    },
    {
      "level": "H2",
      "text": "Why Is SEO Important?"
    },
    {
      "level": "H2",
      "text": "Organic vs. Paid Results"
    },
    {
      "level": "H3",
      "text": "SEO vs. SEM"
    },
    {
      "level": "H2",
      "text": "How Search Engines Work"
    },
    {
      "level": "H4",
      "text": "How does Google determine the “best” result?"
    },
    {
      "level": "H2",
      "text": "Types of SEO"
    },
    {
      "level": "H3",
      "text": "1. On-Page SEO"
    },
    {
      "level": "H4",
      "text": "Use Keywords In Your Content"
    },
    {
      "level": "H4",
      "text": "Optimize Your Meta Description for Clicks"
    },
    {
      "level": "H4",
      "text": "Optimize Your Images"
    },
    {
      "level": "H4",
      "text": "Create an Awesome User Experience"
    },
    {
      "level": "H3",
      "text": "2. Technical SEO"
    },
    {
      "level": "H4",
      "text": "Create a Useful Site Architecture and Leverage Internal Linking"
    },
    {
      "level": "H4",
      "text": "Optimize For Mobile"
    },
    {
      "level": "H4",
      "text": "Measure and Optimize for PageSpeed"
    },
    {
      "level": "H4",
      "text": "Set Up HTTPS"
    },
    {
      "level": "H3",
      "text": "3. Off-Page SEO"
    },
    {
      "level": "H4",
      "text": "Focus on High-Quality Backlinks"
    },
    {
      "level": "H4",
      "text": "Aim to Build Links from Relevant Websites"
    },
    {
      "level": "H4",
      "text": "Implement Winning Link Building Techniques"
    },
    {
      "level": "H2",
      "text": "How to Start Growing Your Website with SEO"
    },
    {
      "level": "H4",
      "text": "Learn"
    },
    {
      "level": "H4",
      "text": "Company"
    },
    {
      "level": "H4",
      "text": "Connect"
    }
  ],
  "author": ""
}