{
  "url": "https://moz.com/blog/category/online-advertising/p10",
  "slug": "p10",
  "title": "Online Advertising - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Anthony Kirlew March 18, 2008 I'm Leaving and I'm Never Coming Back... Online Advertising Is this what your website visitors are saying? One of the sites that I work with has a very high \"new visitor\" percentage and while the visitor count continues to grow, there is clearly a problem in that the numbers are not growing exponentially as they should with a near 80% return visitor rate.What's the problem? Well, it's never just one thing, but here are a few... Read this post B By: Brent Payne March 4, 2008 I Hereby Declare OPH the Official SEO Breakfast Restaurant Online Advertising What empowers me to make The Original Pancake House the official breakfast restaurant of the Search Engine Optimization industry? Not a damn thing. Well, other than I love Dutch Babies and I love SEO. That’s got to carry some type of auth... Read this post By: Rand Fishkin February 13, 2008 Do the \"Heavy Clickers\" Negatively Impact Display Ad Campaigns? Online Advertising A report on the \"Natural Born Clickers\" (NBCs from now on) was released today by Starcom, Tacoda & Hitwise. The data points to some head-scratchingly bizarre figures about the people who click on paid display advertisements (emphasis below mine): ... Read this post By: Danny Dover January 30, 2008 The Definitive Reason Why Facebook is Worth at Least $15 Billion Online Advertising Note: The following post is based on conversations I have had with top Microsoft employees and college graduates being recruited by Facebook. The conclusions I have come up with are based on the information they gave me along with many hours of independent research. Although the following is speculative in nature, it is based on fact. ... Read this post By: Jane Copland January 30, 2008 But Will It Google? Online Advertising I'm about to bring up something I've written about before (one month ago today, actually), but today I've taken part in an interesting task that further highlights the disconnect between advertising and search engine marketing. I saw a funny ad on the bus today while I was on my way to work. I really wanted to take out ... Read this post By: Richard Baxter January 23, 2008 Using Subdomains Ad-Nauseum Still Works?! Surely Not... Online Advertising \"Hey guys, look at these Subdomainiacs!\"I thought that websites who use endless subdomains to get search results were really old hat, Matt Cutts talked about it <a href=\"http://www.mattcutts.com/blog/subdomains-and-subdirectories/\">here</a>, and I'm pretty sure Vanessa Fox talked about it <a href=\"http://www.seomoz.org/blog/whi... Read this post L By: Lori Bourne January 23, 2008 Who Loves Ya, Baby? Online Advertising Recently, the Food Network posted its list of the most popular recipes of 2007. As I perused it (I’m a little bit of a Food Network junkie), I was struck by the fact that most of the top ten recipes were, for lack of a better phrase, \"comfort food\". Indeed, the top two were variations on macaroni & cheese, and... Read this post X By: XMCP January 21, 2008 Yes Dear, There is Porn SEO, and We Can Learn a Lot From It Online Advertising After reading last Sunday's post on seo in pornography, and decided I'd have a bit of fun with it. Whether or not you are willing to promote pornography, there are some absolutely stellar tips hidden away in it's vast, obscure world.Disclaimer: I do not promote pornograp... Read this post By: Rebecca Kelley January 16, 2008 Ron Paul is the Snakes on a Plane of 2008 Online Advertising http://www.seomoz.org/blog/the-internet-the-ultimate-focus-group... Read this post N By: Nuno Hipólito January 15, 2008 Google Sucks at Adwords Online Advertising When a big client wants to advertise in \"search\" they probably end up in Google's own portfolio. And it makes perfect sense: why pay more for an adwords campaign when you can just pay for the clicks and have the rest of work done for you, by the same guys that invented the system in the first place! After all, if they can't do it better, who can?Well... you for i... Read this post By: Jane Copland January 12, 2008 Everything is Judged By its Cover: Classified Ads and \"Title Tags\" Online Advertising Every time I research something using classified sites, I'm surprised at two things: Firstly, very few people understand the first rule about writing online advertisements, which has to be getting people to click on the ad. Secondly, it surprises me that even thought I know some of the ads might contain great content, I rarely click on ads that are badly worded. Surely I've been doing this long en... Read this post By: Jane Copland January 3, 2008 Politicians: Four Years Late to the SEO Party Online Advertising It's the second of January and those of us in the United States are already pretty tired of hearing about November's Presidential Election. I'm sure the rest of you are, too. The world of social media is already flooded with stories about the U.S.'s political dramas and I can only imagine that if you're in any other country, today's offerings at Reddit might not interest you all that much. Current... Read this post S By: SMBConsultingInc. December 27, 2007 How I Took a Brand New Site to Multiple Top 10 Organic Search Rankings in Less than a Week Online Advertising Getting a new site to quickly appear within online search results is an enormous challenge we all face when launching a new site. Leading organic SEO firms suggest (rightfully so) that it can take anywhere from three to six months to achieve a top 30 ranking in the major search engines such as Google, Yahoo, and MSN depending upon the competitive search landscape.&... Read this post By: Joe Rozsa December 11, 2007 The Ricky Bobby School of Search Marketing Online Advertising I return from Chicago's SES conference this week enlightened after speaking with many online ad decision makers in control of ad budgets. It seems there was a recurring theme that I heard many times, and I stopped to think about how much it impacts our industry in whole. It's always been a part of it, but I was amazed at how much so.To quote Ricky Bobby - \"If... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Online Advertising"
    },
    {
      "level": "H2",
      "text": "I'm Leaving and I'm Never Coming Back..."
    },
    {
      "level": "H2",
      "text": "I Hereby Declare OPH the Official SEO Breakfast Restaurant"
    },
    {
      "level": "H2",
      "text": "Do the \"Heavy Clickers\" Negatively Impact Display Ad Campaigns?"
    },
    {
      "level": "H2",
      "text": "The Definitive Reason Why Facebook is Worth at Least $15 Billion"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "But Will It Google?"
    },
    {
      "level": "H2",
      "text": "Using Subdomains Ad-Nauseum Still Works?! Surely Not..."
    },
    {
      "level": "H2",
      "text": "Who Loves Ya, Baby?"
    },
    {
      "level": "H2",
      "text": "Yes Dear, There is Porn SEO, and We Can Learn a Lot From It"
    },
    {
      "level": "H2",
      "text": "Ron Paul is the Snakes on a Plane of 2008"
    },
    {
      "level": "H2",
      "text": "Google Sucks at Adwords"
    },
    {
      "level": "H2",
      "text": "Everything is Judged By its Cover: Classified Ads and \"Title Tags\""
    },
    {
      "level": "H2",
      "text": "Politicians: Four Years Late to the SEO Party"
    },
    {
      "level": "H2",
      "text": "How I Took a Brand New Site to Multiple Top 10 Organic Search Rankings in Less than a Week"
    },
    {
      "level": "H2",
      "text": "The Ricky Bobby School of Search Marketing"
    }
  ],
  "author": "Anthony Kirlew\n          \n            Brent Payne\n          \n            Rand Fishkin\n          \n            Danny Dover\n          \n            Jane Copland\n          \n            Richard Baxter\n          \n            Lori Bourne\n          \n            XMCP\n          \n            Rebecca Kelley\n          \n            Nuno Hipólito\n          \n            Jane Copland\n          \n            Jane Copland\n          \n            SMBConsultingInc.\n          \n            Joe Rozsa"
}