{
  "url": "https://moz.com/blog/category/online-advertising/p12",
  "slug": "p12",
  "title": "Online Advertising - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Michael Visser May 9, 2007 Understanding Your Client's Business: Search Marketing Online Advertising Before you can dream of kicking off a successful Sponsored search campaign (eg. Google Adwords, Yahoo! Search Marketing, etc.) you need to understand who your client is, what he/she represents and the goals they wish to achieve. A set process needs to be formed to understand t... Read this post P By: Patrick Sexton April 24, 2007 Most Internet Users Are Not Savvy: Why Are You? Online Advertising Rand just wrote a post called \"The Search Engines' Semantic Analysis Capabilities\" which a wonderfuly informative article about, in essense, how search engines know about words and find out how they are used. He stated that perhaps this information can be used in SEO.I would have called this article \"Google knows Pooploads of Stuff About How People Use Words&qu... Read this post By: adgeek April 16, 2007 Increase Landing Page Conversion Rates Online Advertising Driving traffic from PPC (pay-per-click) or email campaigns to your home page is a mistake. You must deliver on the promise in your lead ad copy if you hope to convert traffic. Dumping people on a home page and forcing them to navigate their way to what they want is a strategy for failure.Ideally, you should be driving your traffic to a landing page that foc... Read this post By: Rand Fishkin April 10, 2007 Learn from a Rankings Dominator - NYMag.com Online Advertising Mystery Guest and I arrived in New York on Saturday and have been enjoying the city tremendously. During our stay, I've been conducting a remarkable number of searches to find museums, shows, restaurants and shopping. One site has consistently dominated the results at Google and, as an SEO, I couldn't be more impressed - NYMag.com has done a remarkable job bui... Read this post By: Pete Watson-Wailes March 27, 2007 Online Advertising 2.0 II Online Advertising Ok, welcome to part II... Public Speaking. (Part one was media marketing, if you missed it, and III, IV and V will be affiliate marketing, branding and lists respectively.) So, how to speak in public AND market yourself respectively. Again, I appologise but I'm going to be using a lot of the book material in this. It's just easier. ... Read this post By: Pete Watson-Wailes March 22, 2007 Online Advertising 2.0 Online Advertising Ok, well since my announcement that I'd post this got two thumbs down, I'm guessing this will be in for a bashing, but hey, tough. This is something I really believe a lot of people here need to know, so I'm going to say it anyway: There Is More To Marketing Online Than SEO And PPC Understand kiddies? Cool, 'cause I'm about to sh... Read this post L By: lauramaccallow@yahoo.co.uk March 19, 2007 Branding. Is it Important? Online Advertising Over at SEOBook Aaron, Lee, Shoemoney et al had a competition to win a free ticket to Elite Retreat. Needless to say I didn'tt win. (rats...) I DID however think that the question they posed was a good one, so I thought I would share my thoughts here. ... Read this post By: Rand Fishkin March 6, 2007 The Most Overlooked Tactic in Search Marketing Is... Online Advertising Rather than simply list my opinion, or a list, let's make it democratic. I've created a short list of the Top 10 overlooked tactics I see in the professional search marketing sphere. These aren't the mistakes that websites make when trying to appeal to search engines, but rather, the omissions that we, as professional marketers and consultants, let pass by. ... Read this post By: Joey Altherr February 26, 2007 Using SEO to Become a Big Fish in a Small Pond Online Advertising The reason for this, my first and probably last \"blog\" ever, is to let everybody out there know that they can be successful and work from home with the right business plan. It seems like every blogger or forum poster that I read is wanting to either own their own business or work from home, so if you follow this little guideline then you too can do what you want to do fo... Read this post By: Simon Heseltine February 26, 2007 Local Search - Is There a Winner Yet? Online Advertising Well, everyone knows that (cue my terrible Derek Zoolander impression) “local search, it’s so hot right now”. So who is going to be the big winner? Will it be the IYP sites, trying to find a new cash cow to replace the offline one, as the old yellow pages readership continues to decline? <img src=\"... Read this post By: EnviSEO February 23, 2007 Changes in SEO Have Me Thinking Madison Ave. Online Advertising I took a moment this morning to reflect on all the changes that have occurred over the past few years in the things I do everyday as an SEO. In an industry that never stands still, it shouldn't be much of a surprise that the work we do to promote good search engine rankings has evolved so much in a short time. More and more, I'm realizing that the work I do with ... Read this post By: rmccarley February 20, 2007 Go Beyond SEO for Great Results and Happy Clients Online Advertising Earlier this evening, I was explaining to my wife how PPC is different to SEO. So different it requires separate skill sets. And then I read Rand's post which got me thinking about the line between SEO and marketing. Read this post P By: Prodo February 14, 2007 7 Common Myths about Search Engine Optimisation Online Advertising SEO is not for me because our site doesn’t get many visitors or transactions The statement alone answers why you need search engine optimisation, and you would be amazed with the amount of people who see this as valid reason for NOT implementing a search engine marketing campaign. The reason that people are claiming this is a valid reason i... Read this post By: Rand Fishkin February 11, 2007 Neuromarketing & Branding in the Search Results Online Advertising Reading Kathy Sierra this week brought me back to the concept of neuromarketing, the fascinating theory that branding can actually create a more positive response than a product itself. ...If pe... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Online Advertising"
    },
    {
      "level": "H2",
      "text": "Understanding Your Client's Business: Search Marketing"
    },
    {
      "level": "H2",
      "text": "Most Internet Users Are Not Savvy:  Why Are You?"
    },
    {
      "level": "H2",
      "text": "Increase Landing Page Conversion Rates"
    },
    {
      "level": "H2",
      "text": "Learn from a Rankings Dominator - NYMag.com"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Online Advertising 2.0 II"
    },
    {
      "level": "H2",
      "text": "Online Advertising 2.0"
    },
    {
      "level": "H2",
      "text": "Branding. Is it Important?"
    },
    {
      "level": "H2",
      "text": "The Most Overlooked Tactic in Search Marketing Is..."
    },
    {
      "level": "H2",
      "text": "Using SEO to Become a Big Fish in a Small Pond"
    },
    {
      "level": "H2",
      "text": "Local Search - Is There a Winner Yet?"
    },
    {
      "level": "H2",
      "text": "Changes in SEO Have Me Thinking Madison Ave."
    },
    {
      "level": "H2",
      "text": "Go Beyond SEO for Great Results and Happy Clients"
    },
    {
      "level": "H2",
      "text": "7 Common Myths about Search Engine Optimisation"
    },
    {
      "level": "H2",
      "text": "Neuromarketing & Branding in the Search Results"
    }
  ],
  "author": "Michael Visser\n          \n            Patrick Sexton\n          \n            adgeek\n          \n            Rand Fishkin\n          \n            Pete Watson-Wailes\n          \n            Pete Watson-Wailes\n          \n            lauramaccallow@yahoo.co.uk\n          \n            Rand Fishkin\n          \n            Joey Altherr\n          \n            Simon Heseltine\n          \n            EnviSEO\n          \n            rmccarley\n          \n            Prodo\n          \n            Rand Fishkin"
}