{
  "url": "https://moz.com/blog/category/online-advertising/p16",
  "slug": "p16",
  "title": "Online Advertising - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Rand Fishkin March 8, 2006 Tipping Points on the Web Online Advertising During my travels, I managed to wrap up Malcolm Gladwell's Tipping Point. It was a great read, and deserves the level of attention it's received. The theories behind the work are well fleshed out, compelling and supported by very good examples. What is the Tipping Point (for those who haven't read it): ... Read this post O By: Oatmeal January 31, 2006 Apache - Redirect an Index File to Your Domain Without Looping Online Advertising The saga of redirecting all requests to http://www.seomoz.org/index.php to point to http://www.seomoz.org/ has finally come to an end. We now practice what we preach. For those who are not familiar, it's important to have all duplicate content point to a single, \"canonical\" edition of the content. Requests to index.php and requests to www.seomoz.org/ have the same content even though they have ... Read this post K By: katfive January 23, 2006 Google Pontiac Online Advertising I was watching \"That 70s Show\" last night (yes, Rand, I was only pretending to watch the Seahawks game) when something caught my eye in a Pontiac commercial. I usually ignore TV ads unless they're during the Superbowl, as they more often than not serve to annoy me, but suddenly, in the middle of a Pontiac ad, was the Google search page and the announcer was crooning, \"Don't take our word for it, Google \"Pontiac\" to find out!\" Read this post By: Rand Fishkin January 19, 2006 egoSurf - Scraping Like Mad Online Advertising Via SEW (via Phil Bradley) - it's egoSurf, where you can use their numerical algorithm... Read this post By: Rand Fishkin January 10, 2006 Vanity Rankings Online Advertising I spoke to a potential client today about some desired rankings. The client was interested in ranking well for some moderate and a few heavily competitive phrases in a generally tough industry. Their end goal, however, was not to rank in order to convert visitors into sales or even leads, but rather, simply to impress and show off. Their products and services (and website) were not such that th... Read this post By: Rand Fishkin December 29, 2005 Sitepoint - Where Sites are Sold Online Advertising Sitepoint's Website Marketplace is one of the more interesting forums to watch on the web. It's also a great way to predict the quick-sale value of a web property (by which I mean the price to... Read this post By: Rand Fishkin December 20, 2005 Passionate Users Blog Online Advertising After being dissapointed in the past with where 9Rules was pointing me, I came across a truly worthwhile blog today - Creating Passionate Users... Read this post E By: EGOL December 4, 2005 digg.com Online Advertising Today was pretty interesting. One of my websites was generating a lot more email than normal and all of it was coming in on the same new page. I chalked it up to coincidence. Tonight when I ran my logs it looked like I was getting slashdotted! - except the referrer was ... Read this post By: Rand Fishkin November 30, 2005 Cyber Monday Online Advertising The media's got a name for the \"biggest online shopping day of the year\", the Monday following \"Black Friday\" and Thanksgiving in the US. Our two (holiday benefitting) e-commerce sites actually saw higher sales yesterday and today, but I guess we're outside the mainstream. A good article on the subject comes from the IHT - ... Read this post By: Rand Fishkin November 21, 2005 Checking out BlogExplosion Online Advertising BlogExplosion is a site that offers services, advice and software designed to increase blog traffic. I signed up tonight and have been checking out various services. There's a ... Read this post E By: EGOL November 15, 2005 New Keyword Tool for Adwords Online Advertising I just spent an hour or so at the new keyword tool for adwords. It gives you a nice list of variants for any search term that you type in. Different from the Overture Keyword Suggestion Tool and similar to the Wordtracker related terms list. To find this tool, log into you... Read this post By: Rand Fishkin November 14, 2005 SEM Campaign Tips & Tricks Online Advertising Let's say I was training a new employee on AdSense and Overture SEM campaigns, and I'd like to have some good online resources to point them to. What would you recommend? Yes, I know it's not technically a post, but it's a chance to use your hand coding HTML skills in the comment boxes ;)... Read this post By: Rand Fishkin October 25, 2005 Ebay's It Campaign Online Advertising If you haven't seen the TV ads for Ebay's new \"it\" campaign, they're worth a look. Ebay's playing with a new market here and their attempt to juxtapose post-modern (or post-post-modern) styling and panache with a humorous twist on all things Steve ... Read this post By: Rand Fishkin October 17, 2005 Adsense Ads for SEO Online Advertising I got an e-mail this morning from Nana at Technobloggie. I have a sneaky suspicion that it was a mass-email to more than a few bloggers in the search space, but that's OK. She's got a nifty tool that scans a page and retu... Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Online Advertising"
    },
    {
      "level": "H2",
      "text": "Tipping Points on the Web"
    },
    {
      "level": "H2",
      "text": "Apache - Redirect an Index File to Your Domain Without Looping"
    },
    {
      "level": "H2",
      "text": "Google Pontiac"
    },
    {
      "level": "H2",
      "text": "egoSurf - Scraping Like Mad"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "Vanity Rankings"
    },
    {
      "level": "H2",
      "text": "Sitepoint - Where Sites are Sold"
    },
    {
      "level": "H2",
      "text": "Passionate Users Blog"
    },
    {
      "level": "H2",
      "text": "digg.com"
    },
    {
      "level": "H2",
      "text": "Cyber Monday"
    },
    {
      "level": "H2",
      "text": "Checking out BlogExplosion"
    },
    {
      "level": "H2",
      "text": "New Keyword Tool for Adwords"
    },
    {
      "level": "H2",
      "text": "SEM Campaign Tips & Tricks"
    },
    {
      "level": "H2",
      "text": "Ebay's It Campaign"
    },
    {
      "level": "H2",
      "text": "Adsense Ads for SEO"
    }
  ],
  "author": "Rand Fishkin\n          \n            Oatmeal\n          \n            katfive\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            EGOL\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            EGOL\n          \n            Rand Fishkin\n          \n            Rand Fishkin\n          \n            Rand Fishkin"
}