{
  "url": "https://moz.com/blog/category/online-advertising/p8",
  "slug": "p8",
  "title": "Online Advertising - MozMoz logoMenu openMenu closeSearchMoz logo",
  "description": "Your all-in-one suite of SEO essentials.",
  "content": "By: Jeremy Hambly October 29, 2008 New to SEO Looking to Make Cash? Online Advertising Ok, well since this is my first attempt at a blog post here on SEOmoz I figured I would try and make it about something I at least have modest success with: geotargeting. I work in the lead generation business, but also sell SEO (even though I am in comparison to many a complete noob) as a side business. I find that targeting local businesses, at least for those new to SEO, can give you great, pretty quick results. Read this post By: Rebecca Kelley October 21, 2008 Learning a Little About Email Marketing Online Advertising I don't know a whole lot about email marketing, but I enjoy studying the marketing emails I receive and identifying the ones that are more effective than others. I talked to Scott, who handles our email marketing campaigns, and he praises email marketing for being \"dirt cheap and very effective.\" I can agree on the cheap part: we use Exact Target, whose suite of email marketing solutions start at $1,000 per year for one user and go up to an Enterprise account ($15,000 a year for five users). While there are expensive email marketing packages available, you can definitely find an affordable option to start out with and get your feet wet. Read this post M By: Marty Martin October 10, 2008 Implications of Mozilla Geode on SEO/M and Privacy Online Advertising \"You’ve arrived in a new city, a new continent, a new coffee shop. You don’t really know where you are, and are looking for a good place to eat. You pull out your laptop, fire up Firefox, and go to your favorite review site. It automatically deduces your location, and serves up some delicious suggestions a couple blocks away and plots directions there.\"... Read this post By: Gunjan Pandya September 24, 2008 Is a Link Buyer an SEO Expert? Online Advertising You all SEOs are aware of Google and its webmaster guidelines, and you all also know that Google gives much importance to quality and theme-based links. But Google also mentioned in its Webmaster Guidelines that Buying and Selling Links for Link Juice is a violation of Google's webmaster guide... Read this post T By: Tom Critchlow September 24, 2008 The SEO Failings of Major UK Highstreet Retailers Online Advertising So I recently read a post by e-consultancy which looked at 10 things Asda (a huge UK supermarket, part of the Wal-Mart group) could do better online. The post is part of a series where they look at a number of large brands in the UK and how they can perform better online. The series focuses solely on usability though and doesn't actually mention any online marketing. So I thought I'd step up to th... Read this post P By: Paul Purczel September 19, 2008 Adwords Hackers - What a Nightmare Online Advertising Myself and my wife run two businesses. The web design business aswell as an online store. This is my first SEOmoz post, but thought it was important to share my recent experience with adwords hackers.Recently while looking into ways of optimising our online store web site and increasing organic listings. I think it may have even been after reading some seomoz articles, to my surprise I f... Read this post F By: Franz September 18, 2008 What Food Taught Me About Internet Marketing Online Advertising Warning: This post has almost no tips, tricks or guide to SEO/M. This post is entirely what food taught me about Internet Marketing. I'm sure YOUmoz has more SEO/M realist around that could help you with whatever you're looking for. Being a ghost reader in SEOmoz for almost 6 months now, I believe it's time for me to put my share of thoughts back into the Search Community tha... Read this post G By: G-Forces August 22, 2008 An Intro to VSEO (Video Search Optimization) Online Advertising A while ago, i was looking into video search engine optimisation (VSEO) and what benefits it could or would bring to my customers, and after contacting a number of so called VSEO specialists, found this to be a very expensive way of marketing online. On two occasions, I was quoted in excess of $6,000 for this service, not only was this a high cost, but this was a \"per month\" cost with... Read this post By: Rand Fishkin August 13, 2008 Headsmacking Tip #5 - Link Building Through Conservation Online Advertising This tip is probably one of the simplest ways to gain links through conservation. A lot of SEO advice talks about double-checking links that point to 404 pages, as these are lost potential. If a link points to a page that doesn't resolve, it's generally accepted wisdom that the engines won't give any benefit to the domain or any particular page. Certainly, with something around ... Read this post By: King August 12, 2008 How Worldwide SEO Benefits Your Business Online Advertising A while back we were undergoing a bit of change. We had decided that as an international business we ought to really be focusing on countries outside of the USA and our company center, Shanghai. However my company was a fairly frugal one and we couldn’t figure out what to do. Should we translate a thousand pages of content? That didn’t really seem justifiable since we were planning to ... Read this post By: Rebecca Kelley July 30, 2008 Content and Marketing Lessons Learned from The Dark Knight Online Advertising For the four of you who aren't aware, The Dark Knight is a pretty big deal for a multitude of reasons: It was the first movie to film large chunks of the film with IMAX cameras. It debuted on the largest number of screens in cinematic history (4,366). It also debuted on the... Read this post E By: elegantseo June 27, 2008 SEO Defense: 8 Habits To Protect Your Rankings Online Advertising Below is a list of things I've begun to do on a daily basis to help keep my SEO strategy clean, solid and less vulnerable to questionable competitor activities. I can't control what my keyword competitors are doing, but I can sure as hell make it harder for them to F' up all my hard work.Those bastards never sleep. So I won't sleep either.1. Check SERP ... Read this post P By: paisley amoeba June 25, 2008 Does the Google SandBox for Domains Still Exist? Or How Quick Can I Get Around It? Online Advertising I think it's safe to say we all agree: An old autoritative domain is much better than a new domain, provided that old domain has no baggage.i.e. past history of spam, stupid (obvious or accidental) black hat SEO, etc..So just how long does it take for a domain to show up in the SERPs?Obviously, if I went and bought a domain at say.. NetSol (Don't use the... Read this post By: Rebecca Kelley June 25, 2008 Movie Websites: A Missed Opportunity Or a Case of the \"I Don't Care\"s? Online Advertising I was chatting with SEO Hack and Syzlak (the Statler and Waldorf of SEO) when the topic of movie websites came up. When movie studios have a new film coming out, they typically launch a separate, unique website for that film. I played devil's advocate and asked Syzlak why don't studios launch movies on their own domain via a subdirectory (e.g., paramount.com/movietitle). He responded by saying, \"if the studio links out to a movie then that domain will rank well, but the studio itself might not pull as high a rank if it had each movie as a microsite or subdomain, etc.\" Makes sense. Think about it: a movie theater is trying to promote each individual film, not necessarily the studio behind that film. Thus, it's logical to brand the new movie by putting it on a separate website. Read this post",
  "headers": [
    {
      "level": "H4",
      "text": "Discover top competitors’ winning content"
    },
    {
      "level": "H4",
      "text": "What is your Brand Authority?"
    },
    {
      "level": "H4",
      "text": "Unlock flexible pricing & new endpoints"
    },
    {
      "level": "H4",
      "text": "Surface actionable competitive intel"
    },
    {
      "level": "H1",
      "text": "Online Advertising"
    },
    {
      "level": "H2",
      "text": "New to SEO Looking to Make Cash?"
    },
    {
      "level": "H2",
      "text": "Learning a Little About Email Marketing"
    },
    {
      "level": "H2",
      "text": "Implications of Mozilla Geode on SEO/M and Privacy"
    },
    {
      "level": "H2",
      "text": "Is a Link Buyer an SEO Expert?"
    },
    {
      "level": "H2",
      "text": "Level Up Your SEO Skills With Our Free Training"
    },
    {
      "level": "H3",
      "text": "Moz Academy Training"
    },
    {
      "level": "H3",
      "text": "Keyword Research Master Guide"
    },
    {
      "level": "H3",
      "text": "Guide to SEO Competitor Analysis"
    },
    {
      "level": "H2",
      "text": "The SEO Failings of Major UK Highstreet Retailers"
    },
    {
      "level": "H2",
      "text": "Adwords Hackers - What a Nightmare"
    },
    {
      "level": "H2",
      "text": "What Food Taught Me About Internet Marketing"
    },
    {
      "level": "H2",
      "text": "An Intro to VSEO (Video Search Optimization)"
    },
    {
      "level": "H2",
      "text": "Headsmacking Tip #5 - Link Building Through Conservation"
    },
    {
      "level": "H2",
      "text": "How Worldwide SEO Benefits Your Business"
    },
    {
      "level": "H2",
      "text": "Content and Marketing Lessons Learned from The Dark Knight"
    },
    {
      "level": "H2",
      "text": "SEO Defense: 8 Habits To Protect Your Rankings"
    },
    {
      "level": "H2",
      "text": "Does the Google SandBox for Domains Still Exist? Or How Quick Can I Get Around It?"
    },
    {
      "level": "H2",
      "text": "Movie Websites: A Missed Opportunity Or a Case of the \"I Don't Care\"s?"
    }
  ],
  "author": "Jeremy Hambly\n          \n            Rebecca Kelley\n          \n            Marty Martin\n          \n            Gunjan Pandya\n          \n            Tom Critchlow\n          \n            Paul Purczel\n          \n            Franz\n          \n            G-Forces\n          \n            Rand Fishkin\n          \n            King\n          \n            Rebecca Kelley\n          \n            elegantseo\n          \n            paisley amoeba\n          \n            Rebecca Kelley"
}