{
  "url": "https://www.similarweb.com/blog/insights/travel-news/cruise-may-2023/",
  "slug": "cruise-may-2023",
  "title": "Cruise Lines Heating Up Traffic For Summer | Similarweb",
  "description": "Small but fast-growing Virgin Voyages has more than doubled its traffic in a year, while Celebrity is up 36.8% and Norwegian is up 33%",
  "content": "HomeBlogInsightsTravel NewsCruise Line Traffic Up 15.6% in May, Heading Into Summer Season Insights Cruise Line Traffic Up 15.6% in May, Heading Into Summer Season Start your free trial by David F. Carr 4 Min. June 7, 2023 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Small but fast-growing Virgin has more than doubled its traffic in a year, while Celebrity is up 36.8% and Norwegian is up 33% Web traffic increased for all the leading cruise lines in May, with Virgin, Celebrity, and Norwegian showing particularly big gains. Key takeaways Virgin Voyages is a relatively new entrant to the industry, but its remarkable growth story continued in May, with 104.8% year-over-year traffic growth. Compared with April, Virgin’s traffic was up 20%. Virgin attracted 2.2 million visits in May, according to Similarweb estimates. Celebrity drew 5 million visits, up 36.8% year-over-year. Celebrity is a Royal Caribbean brand, and Royal Caribbean itself attracted 13.6 million visits, up 4.5% year-over-year. Carnival, the biggest brand in cruising, got 14.4 million visits, up 5.9% year-over-year. Norwegian Cruise Lines attracted 8.9 million visits, up 33%. Branded search, an indicator of brand recognition because it reflects consumers “asking for a company by name,” was up compared with early last summer by 56% for Virgin Voyages, 26.8% for Norwegian, and 23.6% for Celebrity – the same three that gained the most in traffic on a percentage basis. Aggregated traffic for all the brands covered in this report showed a 15.6% year-over-year increase, reflecting a strong interest in cruising in general. Cruise Lines Saw Across-the-Board Growth Traffic was up for everyone, even if it was up more for a few brands, on a year-over-year basis. These brands also saw month-over-month growth with the approach of summer, with the exception of the Princess website (part of the Carnival Cruise Lines company), with traffic down a fraction of a percent. Norwegian had the biggest gain in share of traffic In the market defined by this competitive set, Norwegian showed the biggest gain in share of traffic, up 2.1 percentage points. Virgin gained 1.7 points and Celebrity gained 1.4. The Royal Caribbean brand was down 2.5 points, although the economic impact should be offset somewhat by Celebrity’s performance. Carnival’s share of traffic was down 2.3 points. Carnival and Royal Caribbean draw nearly as much traffic as all the other competitors combined, which is why gains by any of the other brands tend to come at their expense. That makes Norwegian the biggest competitor to have also seen big gains in May. Strong branded search for those gaining traffic One explanation for which cruise lines made the greatest gains is increased brand awareness as reflected in branded search. SEO professionals work to win traffic for other phrases like “Bahamas cruise” and “best cruise deals,” but if you worked at Royal Caribbean you would treasure those who enter “royal caribbean” or any variation of your company name into a search engine, meaning consumers “ask for us by name.” Unfortunately for both Carnival and Royal Caribbean, those searches have been on the decline over the last year, while Virgin, Celebrity, and Norwegian enjoyed branded search increases. Over the period covered in the chart below, branded search was down 28.2% for Carnival and 23.3% for Celebrity. Increased branded search likely reflects the success of television advertising and other marketing campaigns. The majority of the search activity associated with these companies is organic search, not paid search advertising. Royal Caribbean had the highest percentage of paid search in May. % paid search, May 2023 Carnival Cruise 0.20% Royal Caribbean 4.58% Norwegian Cruise 2.72% Celebrity Cruise 2.76% Virgin Voyages 2.28% The Similarweb Insights & Communications team is available to pull additional or updated data on request for the news media (journalists are invited to write to press@similarweb.com). When citing our data, please reference Similarweb as the source and link back to the most relevant blog post or similarweb.com/blog/insights/. Contact: For more information, please write to press@similarweb.com. Report By: David F. Carr, Senior Insights Manager Methodology Disclaimer: All names, brands, trademarks, and registered trademarks are the property of their respective owners. The data, reports, and other materials provided or made available by Similarweb consist of or include estimated metrics and digital insights generated by Similarweb using its proprietary algorithms, based on information collected by Similarweb from multiple sources using its advanced data methodologies. Similarweb shall not be responsible for the accuracy of such data, reports, and materials and shall have no liability for any decision by any third party based in whole or in part on such data, reports, and materials. Image by Gaye Clifford from Pixabay by David F. Carr David covers social media, digital advertising, and generative AI. With a background in web trends since the 1990s, he’s also the author of \"Social Collaboration for Dummies\". Related Topics: Travel News This post is subject to Similarweb legal notices and disclaimers. Related Posts Insights Olympics 2024: Not a Travel Driver for Paris Travel News by Michelle Lang 3 Min. Jul 22, 2024 Insights All-Inclusive Resorts Are Fastest-Growing Hospitality Segment Travel News by David F. Carr 3 Min. May 28, 2024 Insights Japan Rail Pass Tops Digital 100 Ranking of Fastest Growing Travel and Tourism Sites Travel News by Inès Durand 3 Min. Jan 10, 2024 Insights Airbnb Digital Engagement Stalls Travel News by David F. Carr 4 Min. Nov 9, 2023 Insights Cruise Lines Show Strong Digital Growth and Momentum Travel News by David F. Carr 5 Min. Nov 2, 2023 Insights Traffic to Major Cruise Line Websites Up 26.5% Year-over-Year Travel News by David F. Carr 4 Min. Aug 11, 2023 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Cruise Line Traffic Up 15.6% in May, Heading Into Summer Season"
    },
    {
      "level": "H2",
      "text": "Small but fast-growing Virgin has more than doubled its traffic in a year, while Celebrity is up 36.8% and Norwegian is up 33%"
    },
    {
      "level": "H2",
      "text": "Key takeaways"
    },
    {
      "level": "H2",
      "text": "Cruise Lines Saw Across-the-Board Growth"
    },
    {
      "level": "H2",
      "text": "Norwegian had the biggest gain in share of traffic"
    },
    {
      "level": "H2",
      "text": "Strong branded search for those gaining traffic"
    },
    {
      "level": "H3",
      "text": "% paid search, May 2023"
    },
    {
      "level": "H3",
      "text": "Olympics 2024: Not a Travel Driver for Paris"
    },
    {
      "level": "H3",
      "text": "All-Inclusive Resorts Are Fastest-Growing Hospitality Segment"
    },
    {
      "level": "H3",
      "text": "Japan Rail Pass Tops Digital 100 Ranking of Fastest Growing Travel and Tourism Sites"
    },
    {
      "level": "H3",
      "text": "Airbnb Digital Engagement Stalls"
    },
    {
      "level": "H3",
      "text": "Cruise Lines Show Strong Digital Growth and Momentum"
    },
    {
      "level": "H3",
      "text": "Traffic to Major Cruise Line Websites Up 26.5% Year-over-Year"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by David F. Carr"
}