{
  "url": "https://www.similarweb.com/blog/sales/b2b-sales/abm-examples/",
  "slug": "abm-examples",
  "title": "Account-Based Marketing Campaign Examples | Similarweb",
  "description": "ABM marketing is all the rage, so there’s no need to reinvent the wheel. Here we’ll show you 4 examples of what works to give your campaign a jumpstart.",
  "content": "HomeBlogSalesB2B Sales4 Account-Based Marketing Examples to Jumpstart Your Campaign Sales Intelligence 4 Account-Based Marketing Examples to Jumpstart Your Campaign Get a demo by Sarah Mehlman , Sr. Marketing Intelligence Specialist 6 Min. February 23, 2022 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Account-based marketing has become the go-to marketing strategy for many organizations — and for good reason. ABM, which involves a highly targeted combination of inbound and outbound activities, is proven to help organizations close bigger deals faster and bring in more revenue. But for marketing and sales teams that are embarking on ABM for the first time, developing an effective ABM campaign is difficult. It requires high levels of coordination between both departments, a clear understanding of target accounts, and familiarity with a variety of ABM tactics. To help you get your bearings and make your first campaign a success, we’ve put together this detailed list of account-based marketing examples from real companies that have experienced success with ABM. Bookmark this article so you can quickly refer to these helpful ABM examples as you refine your approach down the line! What is ABM? If you need a little recap on what account-based marketing is exactly, or why it’s important, we’ve got you covered. In ABM, sales and marketing stakeholders work together to target, engage, nurture, and convert a predefined list of high-value accounts. While traditional lead generation tactics usually start with creating campaigns and then aiming them at a generalized list of customer personas, ABM starts with identifying prospects who have the biggest revenue potential or strategic value. From there, you create content that speaks directly to those prospects and launch campaigns. When done right, ABM allows marketing and sales teams to reduce the time and energy they spend bringing low value leads. It also shortens the sales cycle, increases deal value, and makes it easier to engage, nurture leads, and convert more strategic accounts. 4 account-based marketing examples Let’s dive in! 1. Similarweb In 2021, we launched our own ABM campaign targeting payment providers that serve eCommerce companies. This is a great ABM example of a one-to-many campaign. Our objective was to identify decision-makers at payment companies that fit our ideal customer profile (ICP), engage them over channels we know they prefer, educate them with personalized and insightful content, and make it easy for them to understand how Similarweb could provide them value. First, we created a list of relevant targets. Of course, we used Similarweb Sales Intelligence to do this. By leveraging the Lead Generation tool, it only took a couple of minutes for us to build a list of high-value accounts that fit all of our most important criteria. For us, strategic value, product fit, territory, and deal value were the most important factors. Then, we used the Contacts feature of Sales Intelligence to identify individual prospects’ contact information. Next, we planned our ABM campaign funnel. Here are its key components: Create targeted and engaging content. For this campaign, our key content was payment-specific video ads. These ads call out our buyer persona (salespeople at payment companies), and demo how Similarweb Sales Intelligence can help make their jobs easier. LinkedIn conversion ads and custom landing pages. In addition to our video ads, we utilized the option on LinkedIn to send individual prospects personalized and responsive messages. This way, we could quickly disseminate useful information while answering common questions. When a prospect selected the option to get a demo, they were directed to a custom landing page where they would input their contact information. Outbound sales with customer insights. Using our Insights Generator and Account Review features, we could easily identify key insights about each prospect, as well as helpful information that could provide them value. Every sales development representative (SDR) who was part of the ABM campaign had a wealth of information on hand that they could use to enhance their outreach emails and phone calls to make them more engaging. Custom pitch decks. Since personalization is fundamental to a successful ABM campaign, we built customized pitch decks for every prospect. In addition to the standard information on our capabilities and key offerings, we focused on how Similarweb could help the prospect achieve their unique goals, grow their customer base, and overcome challenges. 2. GumGum This is an account-based marketing example of a one-to one approach. GumGum, an AI-based content analysis company, used this clever campaign to get T-Mobile as a client. Eventually, GumGum determined it would need to get the attention of CEO John Legere. After realizing Legere was active on social media, it was easy for GumGum marketers to mine his accounts for insights into his interests and day-to-day thoughts. One of the biggest takeaways? Legere is a big fan of Batman. Though it may not seem like the most important fact, this detail helped GumGum build a hyper-personalized, funny, and engaging campaign. The brand commissioned and published a real comic book starring a Batman-styled Legere superhero, dubbed T-man, to catch the CEO’s eye. Together with his sidekick, Gums, T-man saves his city from the plague of bad cell service. Along their journey, Gums equips T-man with image-recognizing digital marketing technology that helps him spread the word about T-Mobile. Legere didn’t just love the campaign, he also shared it on Twitter to his 5.9 million followers. GumGum won the account and got tons of free exposure. https://x.com/JohnLegere/status/803687204190986240 3. Intridea Another bold, one-to-one ABM campaign example comes from Intridea, a UX/UI design company. When Intridea singled out the ad agency Ogilvy & Mather as a top account, it took a rather assertive and experimental approach. The marketing team purchased a billboard that was viewable from Ogilvy’s Manhattan office, and wrote this personalized message on it: “Ogle this, Ogilvy.” Photo Credit: www.adweek.com The billboard also featured a URL, which included the message, “Made you look. Now hire us. AngularJS, Rails, UX/UI, and more,” and an array of GIFs. Taking such a bold stance definitely comes with the risk of backfiring. Fortunately, that’s not what happened. Lou Aversano, CEO of Ogilvy New York, loved the campaign, and called Intridea right away, while OgilvyOne managing director Dimitri Maex set up a meeting. Target audience, reached. 4. Snowflake Snowflake, a data warehouse and services company, provides a great ABM example of a one-to-many campaign. Its marketing and sales teams have targeted 500 accounts simultaneously, with just six dedicated marketers working on ABM activities with sales. Snowflake’s primary ABM activities revolve around creating high-value and informational content that speaks directly to its prospect’s pain points, challenges, and opportunities. Instead of gating this content, Snowflake makes it accessible to anyone on the web in an effort to build credibility among its target accounts, and to demonstrate that it can understand and anticipate customer challenges and future needs. Additional ABM techniques to try The ABM campaign examples above are lauded in the digital media world for their creativity and assertiveness. Although they do a marvelous job of demonstrating all of the directions you can take when running ABM, it’s accurate to say that some of them are a little far out. After all, how many individual prospects are you going to create a comic book or billboard for? There are many more traditional, yet equally effective ABM techniques you could experiment with in your own campaigns. Here are some of the most common types of content and outreach B2B companies use to power their ABM campaigns: Organic social media posts Paid advertisements Email marketing Webinars In-person and online events Blogs, eBooks, and whitepapers One-on-one sales outreach Consultative selling The general “rule” in ABM is to engage your prospects across various channels. Ready to put these ABM examples to use? With a few solid account-based marketing examples at hand, coming up with creative ideas for your own campaigns becomes far easier. However, the key to choosing the right approach all depends on who you target, what you say, and how you say it. After identifying your most valuable target accounts, you’ll want to gain a deep understanding of their pain points, challenges, and goals; determine the most effective types of content for communicating with them; and choose the optimal channel. Of course, having the right ABM tools makes all of the difference. With Similarweb Sales Intelligence, you’ll be able to effortlessly build a list of relevant accounts, uncover insightful nuggets of information, identify prospects’ contact information, and enhance your content and outreach with personalized information. Get a demo now! When you take the time to develop strategic ABM campaigns, you’ll be poised to close bigger deals faster and grow your book of business with strategic logos. by Sarah Mehlman Sr. Marketing Intelligence Specialist Sarah creates engaging content with over 5 years of experience. She enjoys traveling, family time, baking, and Netflix. Sarah holds a psychology degree from Clark University and lives in Israel. Related Topics: B2B Sales This post is subject to Similarweb legal notices and disclaimers. Related Posts Sales Intelligence Mastering Time Management for SDRs: Boost Your Productivity and Email Open Rates B2B Sales by Keren Feldsher 9 Min. Sep 22, 2024 Sales Intelligence Top Ecommerce Companies in the USA: 100 Brands to Watch Right Now B2B Sales Selling to Ecommerce by Keren Feldsher 13 Min. Jul 25, 2024 Sales Intelligence AI For Sales: How AI Optimizes Sales Workflows B2B Sales by Andrea Pash 5 Min. May 20, 2024 Sales Intelligence Buyer Intent Data for Sales: Everything You Want to Know B2B Sales by Leah Messenger 6 Min. Nov 6, 2023 Sales Intelligence 5 Buying Signals Examples for B2B Sales B2B Sales Prospecting by Madeleine Chill 6 Min. Oct 9, 2023 Sales Intelligence The World’s Top 100 Tech Companies in 2023 B2B Sales by Leah Messenger 10 Min. Sep 4, 2023 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "4 Account-Based Marketing Examples to Jumpstart Your Campaign"
    },
    {
      "level": "H2",
      "text": "What is ABM?"
    },
    {
      "level": "H2",
      "text": "4 account-based marketing examples"
    },
    {
      "level": "H3",
      "text": "1. Similarweb"
    },
    {
      "level": "H3",
      "text": "2. GumGum"
    },
    {
      "level": "H3",
      "text": "3. Intridea"
    },
    {
      "level": "H3",
      "text": "4. Snowflake"
    },
    {
      "level": "H2",
      "text": "Additional ABM techniques to try"
    },
    {
      "level": "H2",
      "text": "Ready to put these ABM examples to use?"
    },
    {
      "level": "H3",
      "text": "Mastering Time Management for SDRs: Boost Your Productivity and Email Open Rates"
    },
    {
      "level": "H3",
      "text": "Top Ecommerce Companies in the USA: 100 Brands to Watch Right Now"
    },
    {
      "level": "H3",
      "text": "AI For Sales: How AI Optimizes Sales Workflows"
    },
    {
      "level": "H3",
      "text": "Buyer Intent Data for Sales: Everything You Want to Know"
    },
    {
      "level": "H3",
      "text": "5 Buying Signals Examples for B2B Sales"
    },
    {
      "level": "H3",
      "text": "The World’s Top 100 Tech Companies in 2023"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Sarah Mehlman"
}