{
  "url": "https://www.similarweb.com/blog/sales/b2b-sales/abm-metrics-and-kpis/",
  "slug": "abm-metrics-and-kpis",
  "title": "7 ABM Metrics You Need To Be Tracking | Similarweb",
  "description": "The success of account-based marketing is undeniable. But how do you measure your success? Here are the top 7 ABM metrics you need to be tracking.",
  "content": "HomeBlogSalesB2B Sales7 ABM Metrics You Need To Be Tracking Sales Intelligence 7 ABM Metrics You Need To Be Tracking Start your free trial by Leah Messenger , Senior Content Marketing Manager 7 Min. September 2, 2022 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic The success of ABM in marketing and sales to attract clients is undeniable (check out these ABM stats for size), but how do you track that success yourself? When it comes to account-based marketing, you’ve got two sides to tracking your efforts: activity-based metrics and outcome-based metrics. But the thing is, to attract the big dogs in a very competitive market, your ABM campaigns require time, money and effort. Without investing in these three elements, your campaigns won’t be up to scratch and won’t get the engagement you want. By creating targets based on activity levels, you could be rushing the process – and ultimately, those numbers of yours won’t be looking too good. ABM metrics are not about quantity – they’re about quality. And that’s exactly where ‘the three Rs’ come into it: Reputation, Relationships, and Revenue. What are the three Rs? The three Rs are important aspects for any profitable business and their B2B sales, and are essential to the account-based marketing approach in particular. You should consider each of the three Rs as umbrellas for your ABM metrics, so you can see the impact of your efforts (and successes). Let’s take a look: Reputation: Brand and reputation can be measured by surveys, social media engagement, campaign engagement, and new webpage visits, and are dependent on the influence and opinions of others, but the impression and experience you offer as a business. Relationships: Relationships count as the number of contacts inside each target account, the number of sales conversations you are generating, how many of the ‘right’ contacts you have – maybe whether you have any champions or blockers, and so on. Building rapport with multiple contacts in an account also helps to build a stickier sales cycle (it’s called multi-threading), which can work out well for retention too. Revenue: For revenue, this is where the quantitative numbers come into it, but it’s important to remember that these can be heavily impacted by the other two Rs – because without a good customer experience and relationship, they’re not going to subscribe or stick around for long. Top ABM metrics you need to track In an ideal world, you’d track all possible metrics that revolve around your activity and outcome. But – in a more realistic world – we doubt your data team is the size of Spain. The reason people adopt an ABM strategy is to widen their enterprise customer pool, which is exactly why investing in time, money and effort makes sense – but only if the outcome is a worthy ROI. Here are the top 7 account-based marketing metrics and KPIs (keeping the three Rs in mind) you need to be tracking: 1) Total addressable market (TAM) Total addressable market (TAM) refers to the maximum size of the opportunity for your solution. To work this out, you need to have a clear idea on who it is you’re targeting. To calculate your TAM, you need to multiply your average sales price by your number of current customers. 2) Influenced pipeline Unlike more traditional marketing or sales strategies, ABM focuses on engaging a small number of leads – making all campaigns unique to each target customer, their pain points, and the value you could offer them specifically. Of those companies that you’re targeting with your ABM efforts, how many have converted – and are therefore impacted by your account-based marketing? Ensure you have the infrastructure in place to take into account the engagement you are most interested in tracking. This might be tracking whether your personalized content is contributing to your pipeline – here, you should track things like forms filled, content downloads, and content shares. If you’re more of the mathematical type, you might want to figure out the percentage of engaged accounts out of your TAM. Here’s how: 3) Content engagement rate by specific accounts Engagement in ABM can refer to a whole range of things, but before we get into that, let’s acknowledge three important definitions: ToFu, MoFu and BoFu. That’s top of the funnel, middle of the funnel, and bottom of the funnel if you fancy a mouthful. It’s worth considering these when you track your content engagement, to see how far in the process your target is (and how much more work you might have to do). Your campaigns are likely to have – and should have – multiple channels and touchpoints, but how involved are they with your content along the way? Split up your engagement measurements by assessing: Content engagement: How long are target prospects spending taking in your content or specific landing pages, and what assets are they downloading most? Email marketing metrics: Open rates, click-through rates, and response rates are three easy wins here. Advertising engagement rates: Are your target accounts engaging with your paid ads? Have you looked into A/B testing to see what ads resonate most with them? Content conversion: Keep track of your user journey – are they heading through to your ABM landing page? Are they downloading your gated assets? Social media presence: Tracking those targeted on socials to see if they repost what you send, engage with any posts, etc (eg. sharing a photo of corporate gifting you’ve sent them) Customer advocates and customer referrals: If they’re spreading the news of how good you are, they’re doing some of the hard work for you. Hello, inbound sales. Cross-sells and upsells: They like what you’re doing, and want more, which shows you are smashing the three Rs. We love to see it. 4) Conversion/win rate The next step: your conversion rate – and it does what it says on the tin. 🥫 Conversion or win rates are calculated by taking the number of successful conversions you’ve had and dividing that by the number of interactions from engaged accounts. So, if you had 10 conversions out of 100 interactions, you have a conversion rate of 10%. 5) Account value or annual contract value (ACV) Calculating account value or annual contract value (ACV) – if you want to calculate your revenue on a yearly basis – is one important step into working out if the ROI is going to be worthwhile. If a customer signs a 5-year contract for $500,000, then their ACV is $100,000. Here’s the formula to calculate annual contract value (ACV): 6) Customer lifetime value (CLV) Customer lifetime value is the next step after working out the prospect’s ACV. The CLV takes into account the customer’s value, their buyer behavior, and your all-round average customer lifespan to work out how much revenue they could bring from the beginning to end of their contract. If you want to go further than that, you could consider the opportunity for upsells and cross-sells on a client-by-client basis, or just on average. Here’s the magic recipe – in other words, the formula to calculate your CLV: 7) Customer acquisition cost (CAC) Leading us nicely onto our next metric – customer acquisition cost (CAC). Your customer acquisition costs will tell you if your ABM efforts are working and worthwhile. With a focus on larger accounts, account-based marketing needs to see a return on investment (ROI) to make sure the time, money and effort spent on acquiring is – or was – well spent. If you’re acquiring new customers fast, it won’t make a difference to your business growth if it’s breaking the bank. There are a couple of ways to work out your CAC – one more simple than the other. Let’s start with simple: A more complex calculation would consider elements like additional costs, including things like extra support or resolutions for any problems that occur, which happen as a result of acquiring these new businesses: Using these metrics to fuel your ABM efforts By tracking these ABM metrics, you can help yourself develop and run successful ABM campaigns that don’t waste a dime. If you’re keen to adopt account-based marketing in your strategy, we’ve got quite the reading list for you: How to Run the Ideal ABM Campaign (+ Examples) Your Ultimate Guide to Account-Based Marketing 10 Account-Based Marketing Tactics That Work 8 Top ABM Platforms in 2022 4 Account-Based Marketing Examples to Jumpstart Your Campaign How Similarweb can help your next ABM campaign Once you’ve decided the type of account-based marketing you are going for (one to one, one to few, one to many), and established the ABM KPIs and metrics you’re going to measure, it’s time to get that list of accounts to target. That’s where Similarweb comes in. With over 100 filters to narrow down your list, Similarweb Sales Intelligence will make sure you’re left with the prospect websites and contact details that are right for your business. The Lead Generator filters include company details like employee headcount and annual revenue to help ensure you’re targeting the best accounts for your ABM efforts. But Similarweb doesn’t stop there. We will provide you with a list of prospects, where you can filter by specific roles, departments, and locations to get your content seen by the right people. Your unfair sales advantage Grab your prospects' attention with insights from Similarweb Sales Intelligence Book a live demo FAQs How do you keep on top of your ABM metrics? It’s important to keep on top of your ABM metrics and campaign reporting, because otherwise you won’t truly know what’s working and what’s not. This will require time put aside on a regular basis to make sure your reporting is up to date, and your efforts don’t go to waste. What are the key KPIs in account-based marketing? You’ll see we’ve floated a few KPIs into this piece, but to be more specific, ABM KPIs are used to track the progress of your strategy, pinpointing what’s working well and what needs changing. This includes looking into engagement rates (social media, email, click-through rates from ads, and any offline engagement), consumption rates, account coverage, marketing influence, pipeline velocity, ROI, and retention. by Leah Messenger Senior Content Marketing Manager Leah is a Senior Content Marketing Manager with a passion for turning complex topics into engaging, educational content. Related Topics: B2B Sales This post is subject to Similarweb legal notices and disclaimers. Related Posts Sales Intelligence Mastering Time Management for SDRs: Boost Your Productivity and Email Open Rates B2B Sales by Keren Feldsher 9 Min. Sep 22, 2024 Sales Intelligence Top Ecommerce Companies in the USA: 100 Brands to Watch Right Now B2B Sales Selling to Ecommerce by Keren Feldsher 13 Min. Jul 25, 2024 Sales Intelligence AI For Sales: How AI Optimizes Sales Workflows B2B Sales by Andrea Pash 5 Min. May 20, 2024 Sales Intelligence Buyer Intent Data for Sales: Everything You Want to Know B2B Sales by Leah Messenger 6 Min. Nov 6, 2023 Sales Intelligence 5 Buying Signals Examples for B2B Sales B2B Sales Prospecting by Madeleine Chill 6 Min. Oct 9, 2023 Sales Intelligence The World’s Top 100 Tech Companies in 2023 B2B Sales by Leah Messenger 10 Min. Sep 4, 2023 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "7 ABM Metrics You Need To Be Tracking"
    },
    {
      "level": "H2",
      "text": "What are the three Rs?"
    },
    {
      "level": "H2",
      "text": "Top ABM metrics you need to track"
    },
    {
      "level": "H3",
      "text": "1) Total addressable market (TAM)"
    },
    {
      "level": "H3",
      "text": "2) Influenced pipeline"
    },
    {
      "level": "H3",
      "text": "3) Content engagement rate by specific accounts"
    },
    {
      "level": "H3",
      "text": "4) Conversion/win rate"
    },
    {
      "level": "H3",
      "text": "5) Account value or annual contract value (ACV)"
    },
    {
      "level": "H3",
      "text": "6) Customer lifetime value (CLV)"
    },
    {
      "level": "H3",
      "text": "7) Customer acquisition cost (CAC)"
    },
    {
      "level": "H2",
      "text": "Using these metrics to fuel your ABM efforts"
    },
    {
      "level": "H2",
      "text": "How Similarweb can help your next ABM campaign"
    },
    {
      "level": "H2",
      "text": "FAQs"
    },
    {
      "level": "H3",
      "text": "Mastering Time Management for SDRs: Boost Your Productivity and Email Open Rates"
    },
    {
      "level": "H3",
      "text": "Top Ecommerce Companies in the USA: 100 Brands to Watch Right Now"
    },
    {
      "level": "H3",
      "text": "AI For Sales: How AI Optimizes Sales Workflows"
    },
    {
      "level": "H3",
      "text": "Buyer Intent Data for Sales: Everything You Want to Know"
    },
    {
      "level": "H3",
      "text": "5 Buying Signals Examples for B2B Sales"
    },
    {
      "level": "H3",
      "text": "The World’s Top 100 Tech Companies in 2023"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Leah Messenger"
}