{
  "url": "https://www.similarweb.com/blog/sales/b2b-sales/buying-signals/",
  "slug": "buying-signals",
  "title": "Buying Signals in Sales: 5 Types and How to Get Them | Similarweb",
  "description": "Unlock the power of buying signals in sales! Discover these 5 essential types of signals for B2B sales. Read now to optimize outreach and boost engagement.",
  "content": "HomeBlogSalesB2B SalesBuying Signals in Sales: 5 Types and How to Get Them Sales Intelligence Buying Signals in Sales: 5 Types and How to Get Them Try Similarweb Sales Intelligence by Madeleine Chill , Content Marketing Manager 10 Min. August 15, 2023 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic In sales, timing is everything. A recent study by Sales Insight Lab even shows that when deals fall apart, there’s an over 25% chance that poor timing is to blame. (More on that later.) So imagine if you could reach out right when a window of opportunity opens in your territory, when an ongoing deal is at risk, or when a client’s open to an upsell. Hmm, you might be thinking. A likely story. But we’re not only talking about intent signals, like being able to see when a prospect has clicked on your G2 profile or glanced at your pricing page. That might show some degree of interest, but any salesperson will tell you it’s not nearly enough to determine whether someone’s ready to buy. We’re talking about comprehensive news, technology, traffic, ad network, and intent signals that go waaaaay beyond just seeing that a prospect read some reviews — to give you a near-complete picture of prospect and client circumstances. That sounds… almost magical, doesn’t it? Great news: ⋆˖⁺‧ magic is real ‧⁺˖⋆ (sort of). Welcome to the wonderful world of buying signals in sales. Your Guide to Buying Signals in Sales How to raise your whole team's baseline with one tool Download the guide What are buying signals? Buying signals are signs that a prospect is more likely to purchase a product or service. These signals draw on both fit data (firmographics, technographics, demographics), opportunity data (news and intel about company events and circumstances that indicate favorable sales conditions), and intent data (intel about what a company’s employees are searching for online). For example, if an ecommerce company just removed payment provider Stripe from its checkout process, that would be an excellent buying signal for one of Stripe’s competitors. The competitor could then reach out to the ecommerce company and offer its services — with a greater likelihood of closing a deal. Why do you need buying signals? Well, that depends on who you are. To cover all the bases, let’s run through the usual sales team suspects and unpack how each person can maximize their impact with buying signals. Buying signals for Sales Development Representatives (SDRs) / Business Development Representatives (BDRs) Let’s say you’re an SDR. You’ve just been hung up by your 50th cold call and you’ve gotten approximately 0.0 replies after sending 200 cold emails, so you’re feeling a wee bit skeptical about this whole “buying signals” thing. We don’t need to tell you competition’s intense for prospect time and attention, or that there are limited hours in the work day (go figure ). But get this. With buying signals, SDRs can do two crucial things: prioritize leads based on who’s really most likely to be interested, and quickly customize outreach to make it more engaging. We can’t guarantee an instant +$500M in revenue, but we know for sure that buying signals can help SDRs boost their engagement rates and book more meetings. Buying signals for Account Executives (AEs) / Sales Managers (SMs) Why are AEs are so good at telling scary stories? Because they’ve all been ghosted more than a couple times. Someone who’s stuck in 2021: “But all AEs do is win, win, win deals no matter what, right?” Long deal cycles: “Um.” Tight budgets: “So…” Busy prospects: *Avoiding eye contact* But get this: with the right buying signals, AEs can say boo to ghosting and start engaging buyers with pertinent, timely insights. A well-timed buying signal can also help an AE spot a red flag in an ongoing deal — or snag an opportunity to expand the scope of the sale. Increased deal velocity. Better win rates. More buyer engagement. In short, buying signals have the potential to bring out the inner DJ Khaled within every AE. Buying signals for Account Managers (AMs) / Customer Success Managers (CSMs) The SDR’s outreach got the prospect to book a meeting. The AE’s persistence turned that prospect into a customer. Now what? Now you sit back, relax, and watch the ARR rollllll in. Just kidding. Ha! Can you imagine? It’s AM season, baby: time to drive upsells and prevent churn at all costs. To accomplish these goals in a way less-than-ideal market, AMs need their customer outreach to be timely, useful, and hyper-relevant. You guessed it: they need buying signals. Here’s the equation: Plus, did you know increasing customer retention by just 5% can increase profits by between 25% to 95%? Talk about watching the ARR roll in… The 5 types of buying signals you need for B2B sales If you’re a B2B sales team, especially a team targeting online-first businesses, there are five main types of buying signals you need. Let’s explore these five types along with examples of how they work “on the ground” to boost conversion rates and increase efficiency throughout the whole sales cycle. Heads up: we’ve got allll these signals (note: intent coming soon) on Similarweb Sales Intelligence. Just saying. 1. News signals News signals are — you guessed it — any kind of signal you might expect to find in the news. Here are the four subcategories that make up news signals, and some examples of each: Growth (office/people expansion, new locations, major new clients) Leadership (executive hires, promotions, leaves, retirements) Company challenges (layoffs, lawsuits, vulnerability problems) Strategy (acquisitions, mergers, new offerings, new partnerships) How to use news signals Imagine you’re an AE. (maybe you are an AE, in which case this will be a very easy exercise for you). You get a news signal that the company in one of your ongoing deals just hired a new CMO. She’s likely to be one of the key decision-makers in the deal process. You decide to send a personalized note to the new CMO congratulating her on the new position. You give her some background on the deal so far, and offer an overview of how your company’s solution will support her strategic goals. The CMO appreciates the personalized touch and timely outreach, et voila! The deal has a one-way ticket to closed-won-ville. Even more how to use news signals Aaaaand… poof! You’re an AM now. You get a news signal that one of your key accounts is laying off 5% of its workforce. Uh-oh — churn risk alert. Realizing this client might be in need of more support, you reach out. You offer a demo to show features that are specifically designed to help teams do more with less. Then, you make sure to highlight recent wins the client’s made using your product, emphasizing ROI. The client appreciates the timely advice and insights, and the deal gets renewed. Score. 2. Technology signals Technology signals are intel that a company has installed or removed a competitor’s website technology or a complementary website technology. Technographic data is the secret sauce behind technology signals, which are especially crucial for tech and software companies. How to use technology signals Now let’s say you’re an SDR and you work for a company that offers a review plug-in for Shopify. With technology signals, you spot a growing jewelry brand that just moved their ecommerce store from WooCommerce to Shopify. This is your chance! You reach out and explain how your solution can maximize the prospect’s Shopify experience and drive more conversions. Prospect’s interest? Piqued. Meeting? Booked. 3. Ad network signals Ad network signals reveal when a company starts or stops working with a given ad network. With these signals, you can see which ad networks prospects and customers are working with so you can understand how much of the “pie” you have to work with. Then you can leverage this info in your outreach. This type of signal is particularly valuable for advertising firms, adtech companies, and affiliate networks. 4. Traffic signals Traffic signals are indications of changes in a wide range of web traffic and engagement metrics, such as: Traffic Page views Unique visitors Paid search visits Organic search visits Direct visits Social visits Referral visits Display ad visits Email visits High-quality traffic signals will show you when these metrics spike or drop month-over-month, quarter-over-quarter, and year-over-year. You should also be able to segment these signals by country and get a worldwide view. How to use traffic signals Okay, you’re an SDR again! You get a traffic signal that indicates that a prospect’s website traffic had a major drop in the UK last month. You email the prospect with their UK website traffic numbers, and explain how your company’s solution has helped the prospect’s competitors win in the UK market. The prospect is intrigued and replies asking for more info. Bam — meeting booked. 5. Intent signals Intent signals show you when a company’s employees are searching for: Pain points that your solution solves (ex: “simple video editing”) Your product category or business vertical (ex: “CRM”) Your competitors or their branded keywords (ex: “Salesforce”) Your brand or product names (ex: “Similarweb Sales Intelligence”) These signals indicate what your target (and client) companies might do next — like purchase a new SaaS solution in your vertical, or leave your product in favor of a competitor. How to prioritize buying signals Pro tip: not all buying signals are created equal. Yes, they’re all useful in prioritizing your sales efforts, but let’s face it — some signals are just hotter than others. ❤️‍ To illustrate this point, let’s say you have two target accounts: Company A and Company B. Company A is hiring rapidly, indicating that they have available budget and are planning to scale their business. Company B isn’t hiring any more than usual, but they just uninstalled your direct competitor’s software and they’ve been searching online for alternate solutions in your exact category. You only have time to work one account. Which company would you prioritize? If you chose Company B, you win the prize*! Based on the available information, they’re way more likely to be open to a conversation. Go get ‘em, tiger. (*What’s the prize, you ask? A free 7-day trial of Similarweb Sales Intelligence with our ultra-powerful Sales Signals feature. You’re welcome.) Buying signals as a funnel A great way to prioritize buying signals is to conceive of them as a funnel, parallel in many ways to the sales funnel. This means that individual buying signals don’t exist in a vacuum, but rather are part of a journey from signal to signal that (hopefully) ends in a sale. Armed with this framework, you can prioritize accounts effectively and make sure your outreach is relevant to the level of intent a given account is displaying. Where you place different types of signals in the funnel will vary slightly depending on your business vertical and sales strategy, but here’s a foundational signals funnel to get started: The key here is twofold: You can prioritize accounts that are further down the buying signals funnel You can catch accounts higher up in the funnel — before the competition How to identify buying signals This buying signals stuff is all well and good… but how do you actually get all these juicy buying signals? Well, you have two options. The hard way Set individual Google Alerts for every relevant company Follow every relevant company on LinkedIn and manually sift through their pages Dig through company websites and social media accounts Read long annual reports and watch recordings of quarterly earning calls Buy a separate tool for website technologies, go in regularly to individually check relevant companies’ sites, and recheck frequently Dig through company sites’ code to find ad network tags, and recheck frequently Use a browser extension like AdBlock to check individual sites for ad networks, and recheck frequently Buy a separate tool for website traffic and engagement, and monitor for changes Buy an additional separate tool for intent data, and monitor for changes The easy way Get Sales Signals from Similarweb Sales Intelligence. Sales Signals by Similarweb You know those 5 main types of signals — news, traffic, technology, ad network, and intent — you need for B2B sales? We’ve got all those in one place (intent coming soon!), for every single one of your target and customer accounts, sliced and diced as you please. And instead of having to dig around online, you get all the real-time buying signals you need straight to your inbox, as often — or as infrequently — as you like. How do Sales Signals work? Imagine you’re an SDR working for a global payment provider called SuperPay. Your job is to cold-email ecommerce companies, convince them that your solution is at least worth hearing more about, and get them to book a meeting. Thanks to the Sales Signals feature in Similarweb Sales Intelligence, you get a custom daily email digest of all the ecommerce sites whose web traffic is spiking in countries your company provides payment solutions for. In one morning’s Sales Signals email digest, you spot that LuxSlip, a luxury slipper brand, is seeing a boom in traffic from India. Aha — you know just what to do. Pulling up LuxSlip on the Similarweb Sales Intelligence platform, you get the contact info for Director of Ecommerce and send the following email: Emails like this tick all the boxes: Timely ☑️ Relevant ☑️ Personalized ☑️ And what did you, the SDR, have to do to get this intriguing insight? You just had to open your inbox. See you in that meeting, LuxSlip. Takeaways Sales has always been a tough profession, and in today’s market, it’s only gotten tougher. Now more than ever, sales teams’ resources are finite, and you’ve got to be strategic about where and how you deploy them. Integrating buying signals — especially in a way that’s intuitive and easy to integrate into your existing workflows — can make your team more effective, and allow you to channel your whole sales org’s efforts where they have the greatest impact. So what are you waiting for? Hop to it — you wouldn’t want anyone to beat you to the buying signals scoop, now would you? Get Sales Signals Now — For Free Upgrade your whole sales cycle with a 7-day free trial of Similarweb Sales Intelligence Try it now FAQs What are buying signals in sales? Buying signals in sales are signs that a sales prospect is more likely to be open to purchasing your product or service. How can I identify online buying signals? The best and most efficient way to identify online buying signals is by using a tool like Sales Signals, which is part of the Similarweb Sales Intelligence platform. How do I respond to buying signals? You should respond to buying signals by prioritizing your outreach toward leads that are displaying relevant buying signals at a given time. by Madeleine Chill Content Marketing Manager Madeleine is a content marketing enthusiast with a passion for languages and a career focused on sales and marketing. Related Topics: B2B Sales This post is subject to Similarweb legal notices and disclaimers. Related Posts Sales Intelligence Mastering Time Management for SDRs: Boost Your Productivity and Email Open Rates B2B Sales by Keren Feldsher 9 Min. Sep 22, 2024 Sales Intelligence Top Ecommerce Companies in the USA: 100 Brands to Watch Right Now B2B Sales Selling to Ecommerce by Keren Feldsher 13 Min. Jul 25, 2024 Sales Intelligence AI For Sales: How AI Optimizes Sales Workflows B2B Sales by Andrea Pash 5 Min. May 20, 2024 Sales Intelligence Buyer Intent Data for Sales: Everything You Want to Know B2B Sales by Leah Messenger 6 Min. Nov 6, 2023 Sales Intelligence 5 Buying Signals Examples for B2B Sales B2B Sales Prospecting by Madeleine Chill 6 Min. Oct 9, 2023 Sales Intelligence The World’s Top 100 Tech Companies in 2023 B2B Sales by Leah Messenger 10 Min. Sep 4, 2023 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "Buying Signals in Sales: 5 Types and How to Get Them"
    },
    {
      "level": "H2",
      "text": "What are buying signals?"
    },
    {
      "level": "H2",
      "text": "Why do you need buying signals?"
    },
    {
      "level": "H3",
      "text": "Buying signals for Sales Development Representatives (SDRs) / Business Development Representatives (BDRs)"
    },
    {
      "level": "H3",
      "text": "Buying signals for Account Executives (AEs) / Sales Managers (SMs)"
    },
    {
      "level": "H3",
      "text": "Buying signals for Account Managers (AMs) / Customer Success Managers (CSMs)"
    },
    {
      "level": "H2",
      "text": "The 5 types of buying signals you need for B2B sales"
    },
    {
      "level": "H3",
      "text": "1. News signals"
    },
    {
      "level": "H4",
      "text": "How to use news signals"
    },
    {
      "level": "H4",
      "text": "Even more how to use news signals"
    },
    {
      "level": "H3",
      "text": "2. Technology signals"
    },
    {
      "level": "H4",
      "text": "How to use technology signals"
    },
    {
      "level": "H3",
      "text": "3. Ad network signals"
    },
    {
      "level": "H3",
      "text": "4. Traffic signals"
    },
    {
      "level": "H4",
      "text": "How to use traffic signals"
    },
    {
      "level": "H3",
      "text": "5. Intent signals"
    },
    {
      "level": "H2",
      "text": "How to prioritize buying signals"
    },
    {
      "level": "H3",
      "text": "Buying signals as a funnel"
    },
    {
      "level": "H2",
      "text": "How to identify buying signals"
    },
    {
      "level": "H3",
      "text": "The hard way"
    },
    {
      "level": "H3",
      "text": "The easy way"
    },
    {
      "level": "H4",
      "text": "Sales Signals by Similarweb"
    },
    {
      "level": "H4",
      "text": "How do Sales Signals work?"
    },
    {
      "level": "H2",
      "text": "Takeaways"
    },
    {
      "level": "H2",
      "text": "FAQs"
    },
    {
      "level": "H3",
      "text": "Mastering Time Management for SDRs: Boost Your Productivity and Email Open Rates"
    },
    {
      "level": "H3",
      "text": "Top Ecommerce Companies in the USA: 100 Brands to Watch Right Now"
    },
    {
      "level": "H3",
      "text": "AI For Sales: How AI Optimizes Sales Workflows"
    },
    {
      "level": "H3",
      "text": "Buyer Intent Data for Sales: Everything You Want to Know"
    },
    {
      "level": "H3",
      "text": "5 Buying Signals Examples for B2B Sales"
    },
    {
      "level": "H3",
      "text": "The World’s Top 100 Tech Companies in 2023"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Madeleine Chill"
}