{
  "url": "https://www.similarweb.com/blog/sales/b2b-sales/sales-emails/",
  "slug": "sales-emails",
  "title": "How to Write Sales Emails (And Get Replies) | Similarweb",
  "description": "With sales emails typically being the first form of contact, you want to get it right. Here’s how to write sales emails that will actually get replies.",
  "content": "HomeBlogSalesB2B SalesHow to Write Sales Emails (That Actually Get Replies) Sales Intelligence How to Write Sales Emails (That Actually Get Replies) Start your free trial by Leah Messenger , Senior Content Marketing Manager 11 Min. August 16, 2022 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic Knowing how to write effective sales emails is fundamental to sales success. These days, emails are usually the first form of contact you make with a prospect or lead. The question is: will the prospect answer and potentially become a customer, or will your email disappear into the dark realms of their inbox amongst other failed outreach? Of course, you want the first scenario to come true. But with the average employee receiving 120 emails every day, standing out in a crowded inbox is tough. You need a killer subject line to get your message opened, a worthwhile body of text to get read, and a strong CTA to get an answer. Doing all of this right is no easy feat – even some of the most experienced salespeople will tell you that. That’s why we’ve put together our best tips and templates for writing sales emails that your prospects will open, read, and reply to. ✅ How to write a sales email Different types of sales emails help you achieve different goals. You’ll send a whole range of messages: cold outreach emails, pitch emails, thank you emails, follow-up emails, and more. It’s important to tailor each and every email to its specific goal. However, there are four common traits every sales email should have. 1) Make it compelling If you want your recipient to actually open and read your email, it’s got to stand out and grab your prospect’s interest. This starts with the subject line and remains relevant throughout the internal text. Ask yourself the following questions when writing and reviewing your sales emails: Does my subject line evoke a sense of curiosity? Does it suggest important information is inside? Will my opening line capture the recipient’s attention? Is the message itself worthwhile and valuable? 2) Keep it short and sweet People don’t have time to read long emails, especially from someone outside of their organization who is trying to sell them something. If your message has more than two or three short paragraphs of text, it’s unlikely your prospect will read it, let alone answer it. In sales emails, brevity is key. Delete any unessential sentences and get straight to the point. 3) Ensure your CTA is clear A common mistake many salespeople make when emailing prospects and leads is failing to make it clear what they want. Do you want to schedule an intro call? Get some information? Ask for a referral? Share a piece of content? If you want your prospect to take an action, specify what that is, or you’re going to leave them lost. 4) Make it valuable It’s no secret that people are inherently skeptical of salespeople because everyone knows reps have their own personal interest in closing the deal. Prospects and leads enter into a dialogue with you, knowing this all too well. Their guard is maybe (/probably) up and they’ll want to know that becoming a customer will truly benefit them, not just earn you your commission. By taking a consultative selling approach and using sales emails to provide valuable information, you can help dissolve those suspicions away and make them much more receptive to you. Sending over useful information on their industry or market, sharing an interesting webinar or article, or providing updates on their competitor’s activity will get them to trust you and see value in working with you. A step-by-step guide to composing your sales email With those key traits in mind, here’s a guide on how to write a sales email, element by element. 1) Subject line A bad or boring subject line will get you nowhere. That’s it, done – the road to conversion stops here, and your email will disappear into an oblivion of unread messages, or worse: deleted messages. We work in sales ourselves, and these are our top three tips: Write like a human being Do you bother opening emails that look like they came from a slightly defective bot? If you’re using an email automation tool to reach out to prospects, take the time to test your messages and make sure there are no sloppy mistakes in your subject line. Extra spaces, brackets that show form field labels, random symbols, and similar mishaps show a lack of care and attention. From a prospect’s perspective, the body of the email won’t be any better. Be creative, not spammy There’s definitely room for creativity in your sales email subject lines. However, there’s a fine line between creativity and spam. If you get an email with a subject line that reads, Check out this cutting-edge sales platform! you would probably roll your eyes. Phrases like “cutting-edge” are cliche and meaningless. Ideally, your recipient should feel like you wrote that message directly to them – and no one else. It should be genuine and personalized, and not read like something you asked your copywriter to come up with. People like to be amused and entertained, not spammed or misled. Ask a question Asking a question in your subject line is a great technique for attracting your prospect’s interest and getting them to open your message. In some cases, this can be a hypothetical question, like, What would your day look like if you had 50% less meetings? In other cases, you might ask a more pointed question, such as, What do you think about [relevant event]? As long as your questions accurately lead into your email and don’t just exist to bait your prospect, they can be a great opener. Subject line examples you can plug in Here are a few subject lines that have been tested and proven to be effective for all you sales folk. But don’t forget, it’s always recommended to A/B test your subject lines to make sure the ones you choose work among your unique target market. Your input on [topic they care about] [Name] recommended we get in touch What do you think about this [blog post/webinar/podcast]? Introduction: [your name/company] + [their name/company] Trying to connect—do you have 15 minutes? 2) Opening line Your opening line is another very important part of the sales email. This is something recipients can normally preview from their inbox – most of it, at least. A lot of people will skim the opening line to work out whether the messaging is worth opening, so if it’s written poorly or sounds unimportant? Delete. Use it to set the tone for the rest of your – very well-written and important – email. Here are a few tips for writing an effective opening line: Address the recipient correctly Should you call your recipient by their first name? By Mr. or Ms.? Do they have other credentials, like Dr.? How formal should your tone be in the email? To answer these questions, you should refer to your ICP (ideal customer profile) and get familiar with how your target audience prefers to be addressed. Sometimes, “Hey Lori,” works a treat, and other times, “Dear Mr. Wilson,” is a safer option. Get to the point quickly This is especially important if it’s not completely clear what your email is about from your subject line alone. Your prospects are busy professionals – don’t waste time or space with long introductions or pleasantries. Instead, make it clear what your email is about in sentence numero uno. ☝️ 6 opening lines to try out: “I noticed you [visited our website/blog/landing page] so I wanted to follow up…” “[Mutual connection] recommended I get in touch with you about…” “Congratulations on…” “I heard you are [ABC] so I’d be interested to hear your take on [XYZ]… “I just [read/listened to] this [webinar/podcast/blog/article] and I thought it would interest you…” “I’m [your name] from [your company], and we work with companies like [similar companies to the prospect’s]. I was hoping to tell you a little bit about our solution because I think it could be extremely valuable to you…” 3) Email body The body of your email is the “meat” of your message. If you’re a vegetarian and you don’t like that metaphor, the body text is the substance or the “main event.” It’s the information and value you want to pass on, or a clear description of the information you’d like to receive back. Here are a few tips on how to write a strong email body. Know your goal before you start writing Sales emails should be short, clear, and concise. However, it’s hard to write an email that checks all three of those boxes if you don’t really know what it is you want to achieve. If you don’t have a clear goal in mind, you’re more likely to “ramble” in text. Is your objective to deliver a pitch? To get the prospect to sign up for a free trial? To buy something? To provide a referral? By first determining your goal, you will know what to focus on and, subsequently, what you can cut out. Provide real value One of the most effective ways to sustain your recipient’s attention is to provide information or content that offers real value. For example, if you are doing cold outreach, a great way to make sure your email gets read and trigger a response is by providing the prospect with actionable information on their market, industry, or competitors. Similarweb’s Sales Intelligence platform provides digital insights for more than 100M+ eCommerce websites, publishers, and advertisers, making it easy to identify valuable information that will help your prospects grow their business and solve their biggest challenges. Equipped with these insights, you can insert nuggets of information into your sales emails, such as market opportunities, what their competitors are up to, and even how much revenue they could capture with different strategies. 4) Call to action Your call to action (CTA) defines what you want your prospect to do, or how they should respond – which is why it’s usually found in the closing sentence of a sales email. Make your CTA clear, simple, and easy You’ll want to have a single, clear CTA at the end of your email. If your CTA isn’t clear, the chances of you getting a reply immediately decrease. And if there is more than one CTA, your prospect won’t know which one to respond to. Here are a few examples of closing sentences that include a CTA: “Do you have 15 minutes this week to discuss? Let me know what day and time works best for you.” “If you are not the correct person to speak to about this, could you direct me to the right person?” “Are you still interested in our solution? If so, I’d be happy to hop on a call and catch up. Let me know.” Simplify the act of responding You can make fulfilling your CTA even easier by providing your prospects with a set of numbers to reply with that correspond to a certain action or preference. One idea is, instead of asking your prospect’s to write back, let them know it’s perfectly acceptable to simply reply with a 1, 2, or 3 based on the response options you provide them. I know you are incredibly busy so there’s no need to write me back. Feel free to just reply with the number that makes the most sense to you. Let’s schedule a call — please send some meeting time options. Check in with me in a few weeks. Things are too busy right now. I’m no longer interested. Thanks anyways! 5) Email signature Your email signature is the very last thing that shows up in your sales email. It typically includes your name, phone number, company name, logo, and website. But the area where your email signature appears is valuable real estate that you can make work for you, if you know how to make it work. Here are a couple of tips to help make your signature enhance your email: Build credibility By including a link to a PR about your new feature or award your company won, or maybe a link to a successful webinar or ebook, you can build up credibility among those who click on it. This way, you can include some positive news about your company in your email without actually making that the point of your message. No attached images or cringey inspirational quotes Stay away from attached images and files as much as you can – and please, stay away from the motivational quotes. Unexpected attachments appear suspicious and could prevent your recipient from opening it. In most cases, they won’t load properly and create an eyesore in your email. Inspirational quotes are also a no-no. What sounds motivational to you could just as easily make your prospects cringe — don’t risk turning them off before you even have the chance to talk. Sales email templates you can use today If crafting your own emails makes you feel overwhelmed, we’ve created a variety of sales email templates you can customize to serve different objectives. 1) Cold outreach emails When you’re reaching out to a prospect for the first time and they aren’t expecting it, you want to make a good first impression and make them want to talk to you. The key is to be friendly, clear, and brief. Sales email template 1: Hi [Prospect name] My name is [your name] and I work at [your company]. We work with businesses like [two-three company names] to [help/enable/etc.] them to [short pitch]. Our [product/service/platform] offers companies like [prospect’s company] to [include one sentence on a unique benefit of your offering]. Do you have fifteen minutes this week for a call? I would love to learn about your company’s current goals and explore if [your company] could be of value. Best, [Your name]. 2) Prospecting emails Once you’ve identified a prospect that seems to fit your ideal customer profile, you’ll want to send a prospecting email that will help warm them up and generate interest in a dialogue. The best way to achieve this is with a consultative selling approach, in which you offer valuable insights and information the prospect can actually put to use. Similarweb’s Sales Intelligence solution empowers sales reps to quickly pinpoint such insights, which helps your prospects see you as a trusted advisor and industry expert. Sales email template 2: Hi [Prospect name] Did you know that [name of prospect’s competitor] recently [certain action or news update, such as ‘established a partnership with another company, expanded operations, added a new service line, etc.’] which gives them [benefit of action]? According to my research, you could actually achieve [benefit] by [specific action]. If you have a few minutes this week, I’d be happy to have a quick call about how [your company name] can help [prospect’s company] [achieve benefit]. Are you available [day and time]? Best, [Your name] 3) Pitch emails The pitch email is an art form. Your task is to convey the top benefits of your product or service that would be the most valuable to the recipient in a clear and concise manner. If you’ve reached the point where it makes sense to send a pitch email, you’ll want to show that you are confident that your product is right for this prospect. Sales email template 3: Hi [Prospect name] I hope your week is off to a great start. I’m reaching out because [explain who recommended you reach out or how you’re connected to their company, such as ‘I have been following your company’s growth for a few years now’] and I believe [our new feature/our ABC service/our XYZ suite]. [One or two sentences on who your product or service serves and some of the most valuable benefits it enables]. For example, this year we helped [another company] achieve [benefits] in less than [X] months. I believe, given [fact or statistic about the prospect’s company], we could help you achieve the same benefits in even less time. Are you available for a quick call on [day and time]? Best, [Your name] 4) Thank you emails Thank you emails are awesome. They don’t just help you seem polite (and of course you are!), but they are also a great excuse to make contact again and keep the momentum going. Sales email template 4: Hi [Prospect name], Thanks for [a fantastic demo/the referral/a great meeting]. I really enjoyed [what you enjoyed about it] and I appreciate [something positive the prospect said or did]. I’m looking forward to our next step. Would you like to schedule a call for next week to follow-up on [something that came up during the last meeting]? Does next [day and time] work for you? Best, [Your name] 5) Follow-up emails Sometimes, even interested prospects need a little nudge to keep them engaged. Follow-up emails are essential to maintaining an ongoing dialogue with a prospect and to moving them down the funnel. They not only help you trigger a response when a prospect has gone radio-silent, but they also represent opportunities to offer value and consultative support. Sales email template 5: Hi [Prospect name], It’s been a while since we caught up. We are currently working on a new feature and I think you’d find it super valuable. Do you have time for a quick call this week? By the way, I thought you’d find this report interesting. It’s all about [topic], which we talked about on our last call. Best, [Your name] Make your sales emails count There’s nothing worse than laboring over something and then having it be completely ignored. Unfortunately, that happens all the time in sales with emails. Poorly written subject lines lead to unopened emails. Generic opening lines, lengthy text bodies, and unclear CTAs make it unlikely you’ll get a response. The good news is, with a few tips, templates, and tools, it’s easy to avoid these mishaps. By keeping in mind the guidelines we’ve outlined in this post and taking advantage of insightful Sales Intelligence solutions, you can craft compelling and informative sales emails that will get your prospects to instantly hit reply. Your unfair sales advantage Grab your prospects' attention with insights from Similarweb Sales Intelligence Book a live demo by Leah Messenger Senior Content Marketing Manager Leah is a Senior Content Marketing Manager with a passion for turning complex topics into engaging, educational content. Related Topics: B2B Sales This post is subject to Similarweb legal notices and disclaimers. Related Posts Sales Intelligence Mastering Time Management for SDRs: Boost Your Productivity and Email Open Rates B2B Sales by Keren Feldsher 9 Min. Sep 22, 2024 Sales Intelligence Top Ecommerce Companies in the USA: 100 Brands to Watch Right Now B2B Sales Selling to Ecommerce by Keren Feldsher 13 Min. Jul 25, 2024 Sales Intelligence AI For Sales: How AI Optimizes Sales Workflows B2B Sales by Andrea Pash 5 Min. May 20, 2024 Sales Intelligence Buyer Intent Data for Sales: Everything You Want to Know B2B Sales by Leah Messenger 6 Min. Nov 6, 2023 Sales Intelligence 5 Buying Signals Examples for B2B Sales B2B Sales Prospecting by Madeleine Chill 6 Min. Oct 9, 2023 Sales Intelligence The World’s Top 100 Tech Companies in 2023 B2B Sales by Leah Messenger 10 Min. Sep 4, 2023 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "How to Write Sales Emails (That Actually Get Replies)"
    },
    {
      "level": "H2",
      "text": "How to write a sales email"
    },
    {
      "level": "H3",
      "text": "1) Make it compelling"
    },
    {
      "level": "H3",
      "text": "2) Keep it short and sweet"
    },
    {
      "level": "H3",
      "text": "3) Ensure your CTA is clear"
    },
    {
      "level": "H3",
      "text": "4) Make it valuable"
    },
    {
      "level": "H2",
      "text": "A step-by-step guide to composing your sales email"
    },
    {
      "level": "H3",
      "text": "1) Subject line"
    },
    {
      "level": "H4",
      "text": "Write like a human being"
    },
    {
      "level": "H4",
      "text": "Be creative, not spammy"
    },
    {
      "level": "H4",
      "text": "Ask a question"
    },
    {
      "level": "H4",
      "text": "Subject line examples you can plug in"
    },
    {
      "level": "H3",
      "text": "2) Opening line"
    },
    {
      "level": "H4",
      "text": "Address the recipient correctly"
    },
    {
      "level": "H4",
      "text": "Get to the point quickly"
    },
    {
      "level": "H4",
      "text": "6 opening lines to try out:"
    },
    {
      "level": "H3",
      "text": "3) Email body"
    },
    {
      "level": "H4",
      "text": "Know your goal before you start writing"
    },
    {
      "level": "H4",
      "text": "Provide real value"
    },
    {
      "level": "H3",
      "text": "4) Call to action"
    },
    {
      "level": "H4",
      "text": "Make your CTA clear, simple, and easy"
    },
    {
      "level": "H4",
      "text": "Simplify the act of responding"
    },
    {
      "level": "H3",
      "text": "5) Email signature"
    },
    {
      "level": "H4",
      "text": "Build credibility"
    },
    {
      "level": "H4",
      "text": "No attached images or cringey inspirational quotes"
    },
    {
      "level": "H2",
      "text": "Sales email templates you can use today"
    },
    {
      "level": "H3",
      "text": "1) Cold outreach emails"
    },
    {
      "level": "H3",
      "text": "2) Prospecting emails"
    },
    {
      "level": "H3",
      "text": "3) Pitch emails"
    },
    {
      "level": "H3",
      "text": "4) Thank you emails"
    },
    {
      "level": "H3",
      "text": "5) Follow-up emails"
    },
    {
      "level": "H2",
      "text": "Make your sales emails count"
    },
    {
      "level": "H3",
      "text": "Mastering Time Management for SDRs: Boost Your Productivity and Email Open Rates"
    },
    {
      "level": "H3",
      "text": "Top Ecommerce Companies in the USA: 100 Brands to Watch Right Now"
    },
    {
      "level": "H3",
      "text": "AI For Sales: How AI Optimizes Sales Workflows"
    },
    {
      "level": "H3",
      "text": "Buyer Intent Data for Sales: Everything You Want to Know"
    },
    {
      "level": "H3",
      "text": "5 Buying Signals Examples for B2B Sales"
    },
    {
      "level": "H3",
      "text": "The World’s Top 100 Tech Companies in 2023"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Leah Messenger"
}