{
  "url": "https://www.similarweb.com/blog/sales/b2b-sales/sales-terms-glossary/",
  "slug": "sales-terms-glossary",
  "title": "The A-Z of Sales Terms: Your Ultimate Sales Dictionary | Similarweb",
  "description": "Your complete guide to sales terms, to help onboard new hires, brush up on new terminology and trends, and stay alert in those early morning meetings.",
  "content": "HomeBlogSalesB2B SalesThe A-Z of Sales Terms: Your Ultimate Sales Dictionary Sales Intelligence The A-Z of Sales Terms: Your Ultimate Sales Dictionary Book a demo by Leah Messenger , Senior Content Marketing Manager 9 Min. October 12, 2022 X Facebook Linkedin Copy link Free Website Traffic Checker Discover your competitors' strengths and leverage them to achieve your own success Analyze Traffic We’ve all been there. The sales meeting commences, you take a first sip of coffee, and next thing you know, a lot of acronyms are being thrown around, and you are not 100% sure what’s going on. “In Q2, GTM is going to pursue an outbound motion focusing on increasing ARR of EMEA accounts”. Say, what? It’s okay, it happens. The random letters and sales buzzwords can get too much, certain terms can differ from company to company, maybe you want to expand your sales vocabulary, or you might want to help out the new rep being onboarded. Here’s a little something to help you with moments like that: an A-Z of sales terms. Let’s call it Google Translate for sales, because – sometimes – it ain’t as easy as ABC. Have we missed something? Let us know and we’ll add it. The A-Z of everything sales: Sales terms: A-E Sales terms starting with A ABC: Always be closing. A motivational phrase used to describe a sales strategy where the salesperson is always on the hunt for new prospects, pitching to them, and ultimately closing deals. ABM: Account-based marketing. A B2B sales strategy where sales and marketing combine forces to target specific accounts with personalized campaigns. Adoption process: The way a consumer adopts a new product or service, eg. the actions they take when learning how to use it or adopt it into their business. ARR: Annual Recurring Revenue. A key sales metric used by SaaS or subscription businesses with a defined contract length for their clients, to measure annual revenue accurately. Get all the deetz on ARR here. Sales terms starting with B B2B: Business to business. A term that refers to companies that primarily sell products and services to businesses, rather than direct to consumers. B2C: Business to consumers. A term that refers to companies that primarily sell products and services directly to consumers, rather than to businesses. B2B2C: Business to business to consumer. A term that refers to companies that sell to – or partner with – B2C or consumer-orientated businesses who then sell to consumers, in order to reach new markets and customers. BANT: Stands for budget, authority, need and timeline – a framework used to determine how qualified a lead is to work with your company, and to help with prioritization. Budget should center around your prospect’s expectations and ability to pay in regards to your product or service. Authority is all about finding the ultimate decision-maker when it comes to making a purchase. Need is based on their specific pain points and goals. Timeline is your aim to understand when your prospects need to achieve these goals. BOFU: Bottom of the funnel. This is the closing stage of the sales funnel, otherwise known as the decision and purchase stage. Buyer persona: A representation of your ideal customer based on market research and real data about your existing customers. Buyer signal: Signals that indicate your prospects are ready to buy, and there are two types of signals: internal signals and external signals. Internal signals: Actions that are taking place on your online estate, including visiting your website’s pricing page or reading your blog. External signals: Actions that occur outside of your domain, including checking to see if your prospects use technologies that complement your product. Business development: The process of generating new qualified leads. (Psssst… want to receive free lead lists to your inbox every month? Sign up here). Sales terms starting with C CAC: Customer acquisition cost. The total cost of acquiring new customers, including things like advertising costs and team salaries, which you then divide by the number of customers acquired. Cadence: The sequence of actions you go through in the hopes of closing a sale with a prospect, including every contact attempt you make via email, phone, voicemail, social media or other. Case study: Any story, data, or evidence of your product or service benefiting a customer – and yes, they’re incredibly valuable. Churn rate: The rate customers stop doing business with an entity, eg. your business (uh oh). To learn how to work out your churn rate, and for a bunch of other useful calculations, head to our post on sales metrics. Closed opportunities: There are two possible outcomes to a sales opportunity – closed-lost and closed-won (and they kinda speak for themselves, don’t they?). Closing ratio: One way to measure a salesperson’s efficiency – simply divide the number of closed deals by the number of prospects that salesperson has worked with. CLTV: Customer lifetime value. The total worth of a customer during a business lifecycle, or how long they are with a business. For this, you need the average purchase value and then multiply that by the average frequency rate. Cold calling: A sales technique where the salesperson reaches out to individuals who have not previously expressed interest in the offered products or services. Here’s some advice on how to find a phone number in the least creepy way possible. Consultative sales: A sales approach that prioritizes relationships and open dialogue to identify and provide specific solutions to a customer’s needs, meaning that it’s hyper-focused on providing value to the customer. Conversion rate: A metric to judge the effectiveness of your sales team when it comes to converting leads into new customers. To calculate conversion rate: (closed-won opportunities / qualified leads) x 100. CRM: Customer relationship management. A system to help manage customer data that will support sales management, deliver actionable insights, integrate with social media, and facilitate communication. Cross-selling: A way to get a customer to spend more, by purchasing a product that’s related to what they’re paying for already. Sales terms starting with D Data quality: The accuracy and completeness of the information collected. Decision-maker: The person who you (yes, you) should be talking to so you can close that sale. Demographics: The categorization of prospects according to variables – for business purposes, the most common demographics to consider include job title, company and location. Discovery call: A call with a lead where you’ll either qualify them or disqualify them as a prospect, by discovering if their pain points or goals are inline with your product. Sales terms starting with E Email cadence: The string of email contact with a prospect (from your first cold email to all your follow-ups), with rules on how often to email, what the emails say, best responses, etc. Enrichment metrics: Data points that can be used to complete information on prospects, including company size, headquarter location, annual revenue, and so on. Check out the enrichment metrics you can add to your CRM with Similarweb’s Sales Connector. Sales terms: F-M Sales terms starting with F Follow-up: The term for reaching back out to a prospect after the first contact. Forecasting: The process of estimating future sales (with past sales data, industry-wide comparisons and more), to enable companies to make informed business decisions and predict short-term and long-term performance. Sales terms starting with G Gatekeeper: A person who is trained and responsible for keeping a prospect from being bothered by irrelevant callers – that means, make yourself relevant. GTM: Go-to-market. The strategy that plans out how a company can attain customers and rise above competitors, by engaging their target audience, enhancing customer experience, and offering a superior product or USP to what’s already out there. Sales terms starting with I ICP: Ideal customer profile. The process of creating a list of common elements that your ideal (or best) clients share, so you can focus your prospecting efforts on the right company. Oh, and we’ve got an ICP template for you and everything. Inbound leads: A B2B prospect who has found value in your content (eg. an eBook or guide) and exchanges their information for access. Sales terms starting with L Lead: A person or company who may eventually become a client. Lead conversion: When a lead converts into an account, contact, and/or opportunity. Lead enrichment: When you verify, correct, or include additional information to a lead to make sure your data is tip top. Lead generation: There are two types of lead generation – inbound and outbound. Inbound lead generation is the process of attracting people through valuable content where prospects are willing to give their contact information in exchange for access. Outbound lead generation is when a salesperson initiates the first contact by reaching out to prospects in their target audience. Lead list: A list that provides you with contact information of potential customers within your target market. Lead qualification: The process of determining whether a prospect fits your ideal customer profile (ICP), has a high chance of converting, and most importantly, has a high chance of being a successful long-term customer. Lead routing: The (usually automatic) process of distributing incoming leads between sales reps for the best fit, by considering factors of the prospect, including: Industry Company size Geography location Spoken language Culture And other metrics Lead scoring: Lead scoring is attributing a value to each incoming lead to determine how it should be treated through the pipeline, eg. how likely they are to close or their predicted lifetime value. Logo retention: The percentage of customers retained over a given period of time. Sales terms: M-Q Sales terms starting with M Market intelligence: Information relevant to a company’s market – including trends, competitors, and customers – and the position of the company itself within the market, to improve decision-making and strategy creation. MOFU: Middle of the funnel. The second stage of the sales process which leads go through to become a paying customer. During this stage, prospects are gaining interest in your company’s product and are actively engaging with your content and sales team. MRR: Monthly recurring revenue. The income that a business can track on a monthly basis by multiplying your total number of paying users by the average revenue per user. MQLs: Marketing qualified leads. Leads that marketing deems as qualified and ready for a sales follow-up. Sales terms starting with N NRR: Net revenue retention. The calculation of total revenue minus any revenue churn (caused by cancellations or downgrades), plus any revenue expansion from upgrades, cross-sells, and upsells. Nurture: The process of developing relationships with buyers at every stage of the sales funnel, by listening to the needs of prospects and providing the information and answers they need. Sales terms starting with O Objection: The reason (expressed by the prospect) why they will not complete the purchase. Objection handling: How a salesperson responds to a prospect’s objection, in a way that alleviates any concerns to help move the deal forward. Opportunity: A qualified prospect who has a high probability of becoming a customer. Outbound leads: Outbound lead generation is when a salesperson initiates the first contact, by reaching out to their target audience. Sales terms starting with P Pain point: Specific problems that your prospective customers are experiencing, that (hopefully) your product or service can help solve. Persona: The representation of your real and potential customers, based on market research and data. Personalization: The strategy where companies leverage data analysis and digital technology to deliver individualized messages and product offerings to both current and prospective customers. Pipeline: A set of stages that a prospect moves through, as they progress from a new lead to a customer. Prospecting: The first step in the sales process, which consists of identifying potential customers (in other words, prospects). Sales terms starting with Q Quota: A sales target which sales reps are required to reach within a specific time period – so a month, a quarter, or a year. Sales terms: S-W Sales terms starting with S SaaS: Software as a service. A software licensing and delivery model where the software is delivered over the internet, instead of installing it, and run on a subscription basis. Salesforce Insights Connector: A tool that will keep you in full view of all the insights that Similarweb has to offer, right on your prospect’s Salesforce account page. Sales funnel: A visual depiction of the stages of the sales process, from initial outreach to the “end” when the sale has been completed. Here are the three stages in the typical B2B sales funnel: Top of the funnel (TOFU): Awareness and discovery Middle of the funnel (MOFU): Interest and engagement Bottom of the funnel (BOFU): Decision and purchase Sales Intelligence: A not-so-shameless plug for our super insightful Sales Intelligence solution, allowing you to delve into technologies, applications, integrations, and data into prospects’ (and existing clients’) daily business to help you sell smarter. SAM: Serviceable addressable market. The share of the total market that can be fulfilled or served by those businesses that offer a particular product or service. Social proof: The idea that consumers will adapt their behavior according to what other people are doing. Social selling: Using social media to find, connect with, understand, and nurture sales prospects. Sales terms starting with T TAM: Total addressable market. The revenue opportunity available for the product or service. Technographics: The profiling of target accounts based on their technology stack – here’s where you can find out more about technographics. TOFU: Top of the funnel. The stage of the sales journey that is referred to as the “awareness and discovery” phase, when prospects are coming into contact with your brand for the first time. Trusted advisor: A sales professional that buyers turn to for advice and counsel; they’re viewed as a credible source of information for industry trends, competition, and strategic solutions. Hint: this is who you want to be. Sales terms starting with U Upselling: A technique where a seller invites the customer to purchase more expensive items, upgrades, or other add-ons to generate more revenue. Use case: A description of how a person using a product or service will accomplish a goal, so many products can have multiple use cases. Sales terms starting with V Velocity: A measurement of how fast deals move through your pipeline and generate revenue for your business. Sales terms starting with W Weighted pipeline: The forecasting metric to measure expected revenue in your sales pipeline. Now you know your ABCs… These are just a few sales terms to help you stay up to speed in the world of sales, no matter where you are in your professional journey. Whether they’re new to you, or whether you’re inundated by acronyms in your Monday morning meetings, we hope this helps. We’ve got a bunch of other glossaries too, check them out: Digital marketing terms Ecommerce terms Stock market terms Digital research terms by Leah Messenger Senior Content Marketing Manager Leah is a Senior Content Marketing Manager with a passion for turning complex topics into engaging, educational content. Related Topics: B2B Sales This post is subject to Similarweb legal notices and disclaimers. Related Posts Sales Intelligence Mastering Time Management for SDRs: Boost Your Productivity and Email Open Rates B2B Sales by Keren Feldsher 9 Min. Sep 22, 2024 Sales Intelligence Top Ecommerce Companies in the USA: 100 Brands to Watch Right Now B2B Sales Selling to Ecommerce by Keren Feldsher 13 Min. Jul 25, 2024 Sales Intelligence AI For Sales: How AI Optimizes Sales Workflows B2B Sales by Andrea Pash 5 Min. May 20, 2024 Sales Intelligence Buyer Intent Data for Sales: Everything You Want to Know B2B Sales by Leah Messenger 6 Min. Nov 6, 2023 Sales Intelligence 5 Buying Signals Examples for B2B Sales B2B Sales Prospecting by Madeleine Chill 6 Min. Oct 9, 2023 Sales Intelligence The World’s Top 100 Tech Companies in 2023 B2B Sales by Leah Messenger 10 Min. Sep 4, 2023 Wondering what Similarweb can do for your business? Give it a try or talk to our insights team — don’t worry, it’s free! Sign up for free Talk to an expert",
  "headers": [
    {
      "level": "H1",
      "text": "The A-Z of Sales Terms: Your Ultimate Sales Dictionary"
    },
    {
      "level": "H2",
      "text": "The A-Z of everything sales:"
    },
    {
      "level": "H2",
      "text": "Sales terms: A-E"
    },
    {
      "level": "H3",
      "text": "Sales terms starting with A"
    },
    {
      "level": "H3",
      "text": "Sales terms starting with B"
    },
    {
      "level": "H3",
      "text": "Sales terms starting with C"
    },
    {
      "level": "H3",
      "text": "Sales terms starting with D"
    },
    {
      "level": "H3",
      "text": "Sales terms starting with E"
    },
    {
      "level": "H2",
      "text": "Sales terms: F-M"
    },
    {
      "level": "H3",
      "text": "Sales terms starting with F"
    },
    {
      "level": "H3",
      "text": "Sales terms starting with G"
    },
    {
      "level": "H3",
      "text": "Sales terms starting with I"
    },
    {
      "level": "H3",
      "text": "Sales terms starting with L"
    },
    {
      "level": "H2",
      "text": "Sales terms: M-Q"
    },
    {
      "level": "H3",
      "text": "Sales terms starting with M"
    },
    {
      "level": "H3",
      "text": "Sales terms starting with N"
    },
    {
      "level": "H3",
      "text": "Sales terms starting with O"
    },
    {
      "level": "H3",
      "text": "Sales terms starting with P"
    },
    {
      "level": "H3",
      "text": "Sales terms starting with Q"
    },
    {
      "level": "H2",
      "text": "Sales terms: S-W"
    },
    {
      "level": "H3",
      "text": "Sales terms starting with S"
    },
    {
      "level": "H3",
      "text": "Sales terms starting with T"
    },
    {
      "level": "H3",
      "text": "Sales terms starting with U"
    },
    {
      "level": "H3",
      "text": "Sales terms starting with V"
    },
    {
      "level": "H3",
      "text": "Sales terms starting with W"
    },
    {
      "level": "H2",
      "text": "Now you know your ABCs…"
    },
    {
      "level": "H3",
      "text": "Mastering Time Management for SDRs: Boost Your Productivity and Email Open Rates"
    },
    {
      "level": "H3",
      "text": "Top Ecommerce Companies in the USA: 100 Brands to Watch Right Now"
    },
    {
      "level": "H3",
      "text": "AI For Sales: How AI Optimizes Sales Workflows"
    },
    {
      "level": "H3",
      "text": "Buyer Intent Data for Sales: Everything You Want to Know"
    },
    {
      "level": "H3",
      "text": "5 Buying Signals Examples for B2B Sales"
    },
    {
      "level": "H3",
      "text": "The World’s Top 100 Tech Companies in 2023"
    },
    {
      "level": "H3",
      "text": "Wondering what Similarweb can do for your business?"
    }
  ],
  "author": "by Leah Messenger"
}