{
  "url": "https://seranking.com/blog/10-years-of-se-ranking/",
  "slug": "10-years-of-se-ranking",
  "title": "SE Ranking Celebrates Its 10th Anniversary",
  "description": "SE Ranking team shares their thoughts on 10 business lessons that have helped SE Ranking grow and develop.",
  "content": "Blog / SE Ranking News / 10 Years of SE Ranking: Our Core Values and 10 Lessons Learned10 Years of SE Ranking: Our Core Values and 10 Lessons Learned Written by Svetlana Shchehel May 30, 2023 4 min read Today, SE Ranking is celebrating its 10th anniversary. 🎉 From a budding startup, we’ve grown into a mature business with around 120 people on board and 800,000+ users worldwide. SE Ranking has transformed from a powerful position tracker into a powerful all-around SEO solution that helps businesses and SEO agencies automate every facet of their SEO efforts, propelling their online visibility to new heights. SE Ranking was born when the whole SEO community was raving about the Hummingbird smashing their top rankings and time-tested strategies. Ever since, we saw the rise of RankBrain, Bert, and now we’re on the verge of exploring a whole new search experience backed by generative AI. Wherever the changing search landscape brings us, we’re up for a challenge! Over the course of the last ten years, we’ve gone through many transformations. Once our product evolved, our business processes quickly followed suit. Still, something never changed. As a team, we’ve always been bold, brave, and curious when it comes to exploring everything that new emerging technologies have to offer. Our core values also stayed the same. We have always been and will continue to be a people-first business. Behind the curtain is a team of fantastic people who are all dedicated to creating a product that brings exceptional value to our fantastic customers. For this blog post, the SE Ranking team shared their thoughts on how our shared values, alongside the experience we’ve gained over the past 10 years, have helped SE Ranking grow and develop. Always putting people first The team behind the SE Ranking product and our customers, who rely on us for their SEO endeavors, will forever be our most valuable assets. This core value permeates everything we do, including our operational setup, internal and external communications, and product vision. Build a motivated team to weather any storm Vik Kuushynau CEO at SE Ranking since 2022 Building a successful company requires a vast combination of things including vision, funding, product and product market fit, and many others. But the foundational one is people. It all starts with the team. This is the core and the essential part of any business success and there is no way around this. Talented and dedicated people that share common values and move in the same direction can accomplish incredible things. Startups face setbacks and obstacles along the way. So, seek team members who can maintain a positive mindset, stay motivated during challenging times, and bounce back from failures. Their commitment is instrumental in overcoming challenges that you face every day. I can’t imagine driving long-term success without the right people. Let your customers get heard and feel appreciated Alena Demianenko Country Team Lead, joined the team in 2016 It all started with us collecting customer feedback from chats and emails and adding it to our product development roadmap. Five years ago, this led us to an idea: starting a campaign for collecting user wishes around New Year’s time. We asked our customers what they wanted us to improve in our tools and which features they desired but were missing on the SE Ranking platform. As a result, we’ve collected hundreds of wishes, evaluated all of them, and incorporated them into our yearly roadmap. This turned out to be a valuable experience both for us as a product, and for our customers who saw how they can directly influence product development. The “wishes” campaign became SE Ranking’s cherished tradition, which helped us build customer trust, and become a truly customer-driven company. Find tech enthusiasts eager to build products for people Alex Dymovich CPO, joined the team in 2013 We started building SE Ranking with a solid intention to develop our product around user needs. The way we work with user feedback, letting every user be heard and appreciated, helped us create an SEO solution that both meets the needs of SEO pros and remains friendly to newbies. We strongly believe in shared success, meaning that as long as we help our customers grow and prosper, their success will translate into our growth as an SEO product. I’m certain that the strongest suit of our product is the team behind it. We are a nimble team capable of quickly transforming bold ideas into powerful tools that help our customers meet their daily challenges. As someone who joined the team at the onset, I watched every stage of our product growth, and I’m extremely proud of all the transformations we’ve gone through. I’m also looking forward to the new challenges and opportunities ahead of us. Learning from your colleagues and challenging each other Creating a healthy working environment and fostering open communications are the keys to finding excellent business solutions. Many team members have been with SE Ranking for the long haul, and the reason is because of the mutual support and endless opportunities for growth that SE Ranking offers. We’re encouraged to ask “silly” questions, express opposing views and run bold experiments. It all helps us enhance our expertise and bring value to the company. Create a work environment that both challenges and supports all team members Bogdan Babyak CMO at SE Ranking, joined the team in 2016 The thing I value the most about the SE Ranking team is how everyone truly cares about our common success. We are always ready to take on new challenges, and we always try to think outside the box. Our work environment is so supportive and everyone on the team is so dedicated, that you don’t have a single chance not to put your heart and soul into every single initiative. Not being 100% committed would feel like letting down everyone on the team. Our whole company and the marketing team in particular has grown manyfold over the seven years I’ve been with SE Ranking. We’ve made some mistakes along the way, but eventually, they helped us grow and showed us where we could improve. That is why we are not afraid of making mistakes—we learn from them. We are flexible, adaptable, and open-minded. I believe these qualities are the key to our business success. Tap into the expertise and vision of your whole team to create impactful designs Vadym Dziuman Head of Design, joined the team in 2016 In the world of design, the goal to know everything can seem overwhelming and unattainable. However, the truth is that you don’t need encyclopedic knowledge to excel as a designer. All you need is to ask the right questions. Such a simple yet powerful shift in mindset can transform your design process and help you deliver cutting-edge results. By discussing possible solutions with your team, you’ll be able to challenge assumptions, uncover precious insights, and as a result gain a deeper understanding of the problem you’re dealing with. The most successful designs are often the result of a collective effort and a synthesis of different viewpoints. So, don’t be afraid to reach out, ask for feedback, and involve stakeholders early on. By focusing on asking the right questions, you’ll unlock your true potential as a designer and create meaningful experiences for your users. Build a culture of collaboration and efficient cross-team communications to stay connected as the company grows Gabe Hensley Camber Equity Partners – VP of Sales at SE Ranking since 2022 I have had the good fortune to work with a number of organizations in my career and without a doubt, SE Ranking has the strongest culture of collaboration I have ever seen. Everyone leads with the assumption of positive intent and this permeates through to every corner of the company Scaling exponentially, even during the harsh times Taking it slow and moving step-by-step toward your goal could be a viable business strategy, but it never worked like that for the SE Ranking team. For us, growing steadily has always felt more like not progressing at all, so we’re constantly on the lookout for ways to speed up our advancement. It takes a lot of flexibility, dedication, and willingness to take risks. Rapid growth comes at a high cost, but it’s totally worth it Alexander Leshuk CTO, joined the team in 2014 Our success is driven by our ability to grow exponentially while being customer-focused and agile, all while implementing new, cutting-edge solutions. In the last 10 years, SE Ranking has faced multiple massive changes: we optimized our work processes, expanded our team twentyfold, and attracted top talent capable of threading the needle. Our data processing capabilities are now 100 times more powerful than when we started. Such a growth doesn’t come easy: we had to constantly challenge ourselves, push the limits and completely overhaul both our processes and technical setup to give space for new and better solutions. At the same time, many of the changes were spurred by our customers’ feedback and whenever we embraced a major revamp, we would always ask for client opinions before making it final. Be bold to take risks, especially during the harsh times Anna Lebedeva Head of Customer Success & Support, joined the team in 2016 Starting from 2021, my team has been growing faster than ever before, and it supports SE Ranking’s overall growth as well. Harsh times call for effective and risky decisions. There’s no room for small, cautious steps, especially when you see that the market is changing, our customers are losing their clients, and the whole world is experiencing a recession. Staying true to your values even if it looks like a bad business decision Let ethical principles guide you in every business decision you make Solid reputation is one of the most valuable assets of any business. It takes years to build and only seconds to destroy. Even if making an unethical decision may seem like a shortcut to immediate success, it can have devastating consequences in the long run. Everyone on the SE Ranking team is aware of the principles of transparency and openness the company adheres to and sticks to the same principles in their personal daily lives. Maria Kazakova Influencers & PR Manager, joined the team in 2017 A good reputation is built on a series of right decisions, ethical behavior, and transparency. A company that operates with integrity, honesty, and a commitment to doing what is right will not only attract loyal customers but also attract talented employees and investors. Let me illustrate this with a simple yet convincing example. Last spring, SE Ranking lost 15% of its customers because of our decision to disable access to the website for Russian customers. This decision was not difficult at all, because it was not only a matter of reputation, it was more about honesty with ourselves. A company that values its reputation will always work with honesty and integrity, and will never cut corners or make unethical decisions. It’s the right thing to do, and it’s the only way to ensure long-term success. Learning from your own achievements and failures Keep a record of all your activities to learn from the experience Every hard-earned experience translates into priceless insights that help us grow and improve. Keeping track of all your initiatives to make data-driven decisions with your future campaigns was an important shift that powered up SE Ranking’s marketing. Anastasiia Saidakova Operation/Project Marketing Manager, joined the team in 2016 Whenever we put any initiative into action, everything seems crystal-clear—which decisions were good ones and which ones should have been made differently. In six months or a year’s time, the details tend to fade. Eventually, your precious experience may get lost along the way. While moving forward at an extremely fast pace, SE Ranking’s marketing team realized we needed to come up with a systematic approach to keeping a record of all of our initiatives: goals, ideas, insights, supporting materials, etc. Now, it is an inherent part of our work processes. We have a single place for storing all the acquired “knowledge”—our Confluence space. Such an approach allows us to better analyze and compare results from similar initiatives, make more precise forecasts for future promotional activities, and constantly refine our strategies by avoiding repeating the same mistakes. 1673 views Written by Svetlana Shchehel Svetlana is the Head of Content at SE Ranking. Her interests span across digital marketing, SEO, and translation. She regularly shares her expertise on the SE Ranking blog and across various marketing media. Svetlana believes that complex notions can be explained in plain words and loves creating immersive stories. Svetlana spends most of her evening hours learning new languages, planning memorable trips, and petting her cat.",
  "headers": [
    {
      "level": "H1",
      "text": "10 Years of SE Ranking: Our Core Values and 10 Lessons Learned"
    },
    {
      "level": "H2",
      "text": "Always putting people first"
    },
    {
      "level": "H3",
      "text": "Build a motivated team to weather any storm"
    },
    {
      "level": "H3",
      "text": "Let your customers get heard and feel appreciated"
    },
    {
      "level": "H3",
      "text": "Find tech enthusiasts eager to build products for people"
    },
    {
      "level": "H2",
      "text": "Learning from your colleagues and challenging each other"
    },
    {
      "level": "H3",
      "text": "Create a work environment that both challenges and supports all team members"
    },
    {
      "level": "H3",
      "text": "Tap into the expertise and vision of your whole team to create impactful designs"
    },
    {
      "level": "H3",
      "text": "Build a culture of collaboration and efficient cross-team communications to stay connected as the company grows"
    },
    {
      "level": "H2",
      "text": "Scaling exponentially, even during the harsh times"
    },
    {
      "level": "H3",
      "text": "Rapid growth comes at a high cost, but it’s totally worth it"
    },
    {
      "level": "H3",
      "text": "Be bold to take risks, especially during the harsh times"
    },
    {
      "level": "H2",
      "text": "Staying true to your values even if it looks like a bad business decision"
    },
    {
      "level": "H3",
      "text": "Let ethical principles guide you in every business decision you make"
    },
    {
      "level": "H2",
      "text": "Learning from your own achievements and failures"
    },
    {
      "level": "H3",
      "text": "Keep a record of all your activities to learn from the experience"
    }
  ],
  "author": "Svetlana Shchehel"
}