{
  "url": "https://seranking.com/blog/b2bmarketeers-case-study/",
  "slug": "b2bmarketeers-case-study",
  "title": "Case Study: How a Dutch Blog Ranks #1 for Competitive Keywords",
  "description": "Find out how a Dutch b2b marketing blog secured the number one position for high-volume competitive keywords and gets hundreds of visitors monthly. ",
  "content": "Blog / Case Studies / How a Dutch marketing start-up secured the #1 spot on Google for the most competitive keywordsHow a Dutch marketing start-up secured the #1 spot on Google for the most competitive keywords Written by Dmytro Davydov Dec 01, 2022 6 min read Agency b2bmarketeers.nl is a popular b2b marketing blog that was created by Marcel Nanning in 2011. It has since become a leading resource for marketing professionals in Dutch-speaking countries. Visitors are delighted by their high-quality articles on b2b marketing, tool reviews, useful templates, and tips on getting the job done. The blog features content marketing ideas for improving both content and SEO. Today, Marcel’s b2b marketing blog is so effective that it helps him promote his content marketing and SEO consultancy services. Marcel Nanning shared the story behind b2bmarketeers.nl and described how SE Ranking helped (and continues to help) him achieve this success. Challenge Marcel created b2bmarketeers as a side project over 10 years ago. It didn’t perform well at first because Marcel didn’t have enough time to focus on SEO. But everything changed when the pandemic hit. Marcel was laid off from his job, so he decided to use 2021 to dedicate himself to this blog and transform it into his main source of income. Even though Marcel had the reputation and expertise of an established content marketer, he had to start his site almost from scratch. He needed to rethink his entire content strategy and create high-quality content to keep up with the competition. Marcel decided not to spend a euro on paid advertising, so he focused only on content marketing and SEO. Goals These were Marcel’s project goals: Reach top positions for highly-competitive target keywords, for example, ‘b2b marketing’ and ‘content marketing’. Increase search visibility and boost organic search traffic. Appeal to potential clients and drive business growth. Steps taken to reach these goals Having set these goals, Marcel outlined an action plan to propel his website to the top of Google’s first page and generate more leads. The plan included the following steps: 1. Competitive research Marcel first needed to compare his pillar page to those of his competitors. He decided to check similar pages, rule out niche trends and see if his page could keep up with the competition. Using SE Ranking to do careful competitive research, he found out that his page was a bit thin and his page readability required attention. Marcel Nanning Founder and Publisher We frequently use SE Ranking to study the competition and monitor rivals. And what’s more important, this is our to-go tool when we need to get valuable insights into what our potential customers are interested in. This gives us a better understanding of what kind of content would be valuable to our readers. We use this knowledge to create better content and drive more traffic to the site. After running a competitor analysis, Marcel noticed that the structure of his pillar page needed to be updated. He divided the main content into chapters and added subheadings. To make pages more relevant to visitors, he added relevant content and provided images, supporting resources and FAQs. This way, he improved page readability and increased the value of his pages to his visitors. From here, he could move on to the next step. 2. Keyword research After analyzing competitors, Marcel expanded his keyword list and optimized his site’s pages. Marcel used SE Ranking’s Keyword Research to find the best-performing keywords. When selecting keywords, he considered their search volume and difficulty score (which is how hard it would be for a page to achieve the top position using a specific query). Following a thorough analysis, he chose keywords with the highest traffic potential and added them to his keyword list. In the beginning, Marcel focused on keywords with lower competition score (and somewhat less potential traffic). For example, he would look at queries like ‘content marketing strategie’. As the site gained more authority, he shifted his focus to heavier keywords with more competition, like ‘content marketing’. SE Ranking is Marcel’s preferred tool for keyword research. When he comes up with an idea for new content, the first thing he does is check search volumes. He does this to identify keywords with the highest potential, define his content calendar and create SEO-friendly content. DO KEYWORD RESEARCHEnter a search term and find untapped keyword opportunities to make your site more visible in search.Analyze Marcel was able to better understand the interests of his target audience and make his website more attractive to them, thanks to the data he got from semantic research. He could then optimize old content pieces and create new SEO-friendly blog posts. 3. Creating content Once the strategy had been outlined and keywords gathered, Marcel could start filling his site with relevant content. He began by polishing content on his pillar page. He added selected keywords to important page elements like the title tag, meta description, headline, etc. Then he updated the main copy and added keywords throughout the text. He then started publishing articles related to the topic. He created a content cluster — several pieces of content that cover a specific topic. Covering the whole cluster enables a thorough overview and offers superb value to the reader. Additionally, it improves the site’s quality by increasing the author’s (and the content’s) authoritativeness and trustworthiness. It was important to focus on the content’s performance at this point. After it was published, Marcel kept a close eye on the rankings to make sure he was on the right track and didn’t have to revise the entire content plan. 4. Smart linking Finally, Marcel organically linked all content pieces back to the pillar page. This made using his website more comfortable and convenient for his users. As mentioned before, Marcel focused mainly on site content, so he didn’t focus on active link building. He eventually noticed a lot of backlinks coming his way once his pages started ranking higher. To keep track of his backlink profile, he occasionally uses the Backlink Monitor. Results Marcel Nanning and b2bmarketeers.nl reached every goal on their list! First off, they secured the number one position for their primary keywords. Even with tough keywords and fierce competition, the site consistently ranks among the top 3. This gives them hundreds of visitors per month just to the pillar page. They then increased their visibility and drew in new clients. Marcel stayed active in SEO by targeting specific keywords and securing top positions. Now customers can easily find Marcel’s website and contact him if they are interested in content marketing and other related services. Marcel Nanning Founder and Publisher Clients find us because we have top rankings on the most relevant search terms. When we talk to potential clients, we simply ask them to find us on Google. Our website is a great example of what they can achieve with content marketing. We can easily sell our best practices to clients, because we have reached SEO-success ourselves. The b2bmarketeers.nl website is a great example of how content marketing and SEO can help websites achieve higher search engine rankings organically and generate more leads. It ensures long-term success and has a lower cost per lead than advertising. Takeaways Marcel Nanning uses SE Ranking for both his professional website and for client projects. With SE Ranking, Marcel can complete content marketing and SEO tasks faster and more conveniently than ever. Here is a list of features that Marcel enjoys most: Keyword Research: to find the most relevant keywords and check their performance. Competitive Research: to analyze the niche and scope out new opportunities. Backlink Analyzer: to check website backlinks and see if his backlink portfolio needs attention. Rank Tracker: for comprehensive ranking tracking to measure SEO results over time. Inspired by Marcel’s success with SE Ranking? Use our free trial to test this game-changing SEO suite for yourself! Content Marketing Website Promotion 1385 views Written by Dmytro Davydov Dmytro is a content marketer and copywriter at SE Ranking. He enjoys writing about digital marketing and SEO as simply as possible. He is also passionate about content, media, and design. An enthusiastic traveler, amateur cinephile, and desperate cat lover.",
  "headers": [
    {
      "level": "H1",
      "text": "How a Dutch marketing start-up secured the #1 spot on Google for the most competitive keywords"
    },
    {
      "level": "H2",
      "text": "Agency"
    },
    {
      "level": "H2",
      "text": "Challenge"
    },
    {
      "level": "H2",
      "text": "Goals"
    },
    {
      "level": "H2",
      "text": "Steps taken to reach these goals"
    },
    {
      "level": "H3",
      "text": "1. Competitive research"
    },
    {
      "level": "H3",
      "text": "2. Keyword research"
    },
    {
      "level": "H3",
      "text": "3. Creating content"
    },
    {
      "level": "H3",
      "text": "4. Smart linking"
    },
    {
      "level": "H2",
      "text": "Results"
    },
    {
      "level": "H2",
      "text": "Takeaways"
    },
    {
      "level": "H2",
      "text": "You might be interested"
    }
  ],
  "author": "Dmytro Davydov"
}