{
  "url": "https://seranking.com/blog/backlink-quality/",
  "slug": "backlink-quality",
  "title": "What are Backlinks: the Ultimate Guide",
  "description": "Find out why backlinks are crucial for successful SEO and how to check their quality. Moreover, we’ll describe white hat ways to get backlinks.",
  "content": "Blog / Link Management / What Are Backlinks in SEO and How to Get ThemWhat Are Backlinks in SEO and How to Get Them Written by Daria Chetvertak Reviewed by Anastasia Kotsiubynska May 25, 2023 29 min read Just started your SEO journey? Maybe you’re building your backlink strategy or just planning further steps to create a website. In any case, this guide to backlinks should come in handy. We’ll discuss what backlinks are and why they are considered to be one of the most important Google ranking factors. This guide will also teach you how to get good backlinks to your website and how to check their quality. So, let’s get right to it. What is a backlink? Backlinks play a crucial role in any SEO strategy. Without quality backlinks, you won’t get very far. To have a chance at building domain authority, you must understand what backlinks are and how they work. Backlinks (also referred to as incoming or inbound links) are links from a page on one website to another. If someone links to your website, you have a backlink from them. If you link to another website, they have a backlink from you. That is to say, a link from an outside domain that points directly to a page on your website is your backlink. The link appears as an image, a button, or a hyperlink with descriptive text known as the anchor text. The anchor text is clickable, usually appears in a different color than its surrounding text, and is often underlined. A backlink is good for UX because any user can get additional desirable information from it if needed. The user can simply follow the link attached to the anchor text by clicking on it. Backlink examples Let’s look at some examples of where you can find backlinks: In the screenshot below, you’ll see a link in the text content of Search Engine Land’s website. It points directly to SE Ranking’s landing page. This means SE Ranking has a backlink from Search Engine Land. In our guide to search engine indexing, we described ways to help crawlers find your website or discover new pages. We also provided useful information on ping tools and a link to the Ping My Links website. Because of this, the tool now has a backlink from SE Ranking. You can add backlinks not only to text but also to images. For example, Search Engine Land included a backlink to SE Ranking within an advertising banner. You may have noticed that some backlinks appear in website footers. In the screenshot below, Search Engine Watch included a link in the footer to the Contentive website, which most likely aided in the design of the website. What is a backlink profile? A backlink profile refers to the list of all incoming links that are directed towards a specific website. It encompasses all the domains that have been linked to it. This profile provides information about the quantity, quality, and diversity of these incoming links. Various factors, including the number of backlinks, the relevance of linking websites, the anchor text used, and the overall link quality, contribute to the backlink profile’s composition. By analyzing the backlink profile, you can assess the overall strength, authority, and credibility of a website. Backlinks, hyperlinks, referring domains, and external links: what’s the difference? Now that you know what backlinks are, let’s look at some similar—but not identical—terms and look closely at the differences between them. Backlinks vs. hyperlinks A hyperlink is a broad term. It can be defined as any link used to navigate a given website. A hyperlink can be a word, phrase, or even image that a user clicks on to jump to a new document, another page, or a new section within the current page. In fact, all links (external, internal, backlinks) are hyperlinks added to any given document. Backlinks vs. referring domains Referring domains are websites from which the target website or page has one or more backlinks. This means that if a page has a backlink from, let’s say, the New York Times, then it has one referring domain. If it has a link from the New York Times and Forbes, it has two referring domains SEO specialists pay a lot of attention to referral domains when analyzing backlink profiles. Typically, the more quality referral domains a website has, the greater likelihood it has of reaching the top of Google. CHECK ANY SITE'S BACKLINKSCheck which domains link out to any website and get ideas for enhancing your backlink profile.Analyze Whenever your website gets an endorsement (in the form of a backlink) from a new domain, Google appreciates it. When the same domain endorses you again, the value of that second show of support pales compared to that of a new domain. So, getting a fifth backlink from the same source won’t be as much benefit to your website. This is one reason why you must pay attention to the referring domain metric—it shows the actual value of a backlink profile. Backlinks vs. external links An external link is a link from your website to another site—the opposite of a backlink. Strategically placed external links can increase your content’s expertise, authoritativeness, and trustworthiness, especially if you refer only to quality sources that have a history of providing valuable content. You can also give users additional information about what interests them with external links. Why are backlinks important for SEO? While there are around 200 known ranking factors, backlinks are one of the most significant for Google. That’s because a backlink represents a vote of confidence from one site to another. The website is saying to the search engine that it trusts another source and vouches for its content, making this website worthy of users’ attention. If several quality websites link to yours, search engines are more likely to display your content on top of the SERP. Plus, backlinks are the foundation of Google’s PageRank algorithm. Let’s go over these points in finer detail. 1. Website authority Google takes several factors into account when ranking pages on the SERPs, and website authority is one of them. Google uses one critical method to measure it—backlinks. Backlinks are considered votes from other websites. Each website’s vote tells search engines that the content is valuable, credible, and useful. Website authority is determined by the number of and quality of backlinks, so the more quality backlinks your website has, the better it is perceived to be in the eyes of whatever search engine you’re using. Website authority also depends on where the link was placed on the page. While assessing the backlink quality, search engines consider the following: Anchor text (its meaning and main message) The nesting level of the donor website page Link attributes The number of links on a page Link color The likelihood of its being clicked (e.g., links placed on top of the page or links with adequately informative anchor texts are usually more visible and attractive to users) Your other backlinks from the website Each of these parameters affect the link’s quality which subsequently affects the website’s authority. Get your domain authority score in a single click by using SE Ranking’s Website Authority Checker. Link juice—which refers to the value passed from one website to another—is best passed on from authoritative sources. The more authoritative the domain, the more link juice your website gets. By default, links are followed by search crawlers and pass on link juice to the pages they refer to, but when the nofollow attribute value is specified, this default behavior doesn’t apply. You can pass on authority manually by using nofollow and so-called dofollow backlinks. A dofollow link is just a regular link—a way to pass on authority to a website. If you don’t want to imply any endorsement to the link, including passing along ranking credit to another page, use the nofollow attribute. Since 2019, Google has what are now called sponsored attributes and UGC attributes. The former identifies links created as part of advertisements, and the latter stands for User Generated Content, such as comments and forum posts. Both are treated as hints about which links to consider or exclude within the search. 2. Ranking If the website is authoritative (i.e., has a lot of votes from high-quality domains), it is more likely to rank higher. Backlinks remain a key ranking signal because the primary goal of Google is to provide users with the most relevant, high-quality results based on search queries that define their wants and needs. With the PageRank algorithm introduced in 1998, Google began treating links like votes that pass authority from page to page, making the most cited ones the most high-ranking. The algorithm has changed and so has the way SEO specialists approach link acquisition, but the main thing about links remains the same—getting high-quality referring domains will increase your rankings. Stewart Dunlop LinkBuilder.io Quite simply put, every single independent SEO study points to links being the most important ranking factor. Of course, having good content which has the ability to rank is a prerequisite nowadays, and honestly with some of the tools available on the market it’s not hard to do. The main factor separating the competition at the top of Google’s search results is high quality links, and this has always been the major thing that separates Google from other search engines. Also, without indexing—an essential stage in the ranking process—your page won’t be able to get to the top of SERPs. In this case, it doesn’t matter how good your page is. It can—but not always— take a lot of time for search engines to index new content. To speed up this process, you can simply build quality backlinks on authority websites (these are high on Google’s list) that get a lot of daily traffic. 3. Referral traffic Backlinks aren’t just a way to show Google that you are an authority in your niche. Backlinks are also an excellent way to point users to valuable sources, driving qualified traffic to your website. This especially holds true if they’re placed in content published on high-traffic sites that are relevant to your niche. This means that when someone clicks on a link to your website, you get referral traffic, which is when users come to your domain from other sites without searching for you on Google. Backlinks send potentially relevant visitors to your website from sources that are not only trustworthy but likely to have the same target audience as you. This makes it easier for you convert these users into leads and then convert them into new customers. Also, when someone visits your website from another trusted source, Google considers this social signal to be a positive ranking factor. If some users are interested in your content, why not show it to others? 4. Brand awareness Backlinks help you build an online reputation and brand awareness. We know already that backlinks are, essentially, a vote of confidence given by one website to another. But they can also significantly impact how your brand is perceived by website visitors—potential customers. Expert roundups, guest blogging, and interviews get your company name in front of large audiences that might never have heard of you otherwise. With the help of links and mentions on authority websites in your industry, you’ll become a well-known brand for users. And over time, your brand will flash in users’ minds when they search for goods and services in your niche. Plus, the more backlinked mentions on authority websites you have, the less work you will have to do to get high-quality links. You must work for your reputation first, and then your reputation will work for you 😉 Backlinks evolution: Google updates A few years ago, Backlinko analyzed 1 million Google search results to confirm that backlinks remain an extremely important ranking factor. In the 2000s, many SEO specialists bought backlinks openly—wherever and whenever they needed them. At one point, black-hat link-building techniques such as link farms, PBNs, and comment spam allowed SEO specialists to create vast backlink profiles and successfully get to the top of SERP. Sure, website rankings increased according to the quantity of the acquired backlinks, but these tactics no longer work for obvious reasons. Google updated its backlink strategy through the Penguin algorithm, moving the focus from quantity to quality. The search giant started to discredit certain types of backlinks because the content they linked out to wasn’t useful or relevant. Nowadays, too many “unnatural” links may even earn your site a penalty. In December 2022, Google released a new link spam update. The search engine is now leveraging the power of SpamBrain to neutralize the impact of unnatural links on search results. It can now detect whenever sites buy links or whenever sites are being used to pass outgoing links. Thanks to this update, websites like these are far more likely to rank lower in results or not appear on SERPs at all. That’s why it’s critical to understand what makes one backlink high-quality and another one a candidate for the disavow list. What are good backlinks vs. bad backlinks? If you want to get the most out of your backlinks, you must prove to Google that each of your backlinks is high-quality and credible. This is probably the most challenging part of SEO, but don’t worry. Below are some useful tips to help you get there. We’ll discuss the difference between good and bad backlinks and why being able to differentiate between the two is key to creating a strong backlink profile. First, let’s talk about good backlinks. They are links from such websites: Authoritative. The website should have an authoritative backlink profile (i.e., many votes of confidence), as such sources generate a lot of traffic, rank well on SERPs, and pass on the most link juice. If you want to check any website’s authority, do it at SE Ranking. Use our Competitive Research tool to see the Domain Trust metric. Just paste any website and look at the main dashboard. The Domain Trust metric is an aggregate domain quality score based on many factors, including the number and quality of a website’s referring domain and backlink profile. Relevant. The referring page with your backlink should have content that is relevant to your website page. It can be an article section, a separate paragraph from the main text, or a whole page that tackles a similar topic or niche. For example, if your SEO agency’s homepage gets a backlink from a blog post on “How to cook pasta”, this would not be seen as a relevant or quality backlink. Indexed. If the referring page isn’t indexed and cached, then Google will not be able to crawl it quickly or assess your backlink. Make sure the donor website’s page is on top when searching for its brand keyword. With top-quality page experience. This ranking factor includes Core Web Vitals (a set of metrics that measure real-world user experience for loading performance, interactivity, and visual stability of the page). Core Web Vitals also measures search signals such as HTTPS, mobile-friendliness, and the number of pop-ups and ads. Also, pay attention to the number of sponsored posts—their percentage should be low. With your target traffic. If your company works for the US market, why would you need backlinks from an Indian website with a South Asian target audience? You wouldn’t. The same goes for the niche. If you get backlinks from an online grocery store, your SEO agency definitely won’t get target traffic because these users will not be interested in your services. Remember—you want quality leads. To get quality leads, you must have quality backlinks. With a positive or neutral dynamic of growth. A drop in traffic is a problem for any website. A domain with a negative growth dynamic reduces your chances of getting quality referral traffic from backlinks. Without signs of mass selling links. Pay attention to an unnatural number of outgoing links. The donor website should avoid having too many (roughly defined as more than 100) hyperlinks on any given page. This is critical because Google will consider this to be a spammy website. Second, the search engine most likely won’t follow or index hundreds of links. Finally, when a spammy donor website divides the PageRank of that page between hundreds of links, each link is only going to pass along a minuscule amount of PageRank. With a balanced dofollow and nofollow ratio. This can vary greatly depending on your industry. 50/50 and 70/30 ratios can be a normal practice. You can check this data with our Backlink Tool by entering the domain name of any donor website and assess the dofollow/nofollow ratio on the main dashboard. Another critical factor to determine backlink quality is where your backlink exists on a page. For example, in-content links are more valuable than links from the footer or links from comments. If a link is located at the top of the page (the main content), this signifies that your link is prioritized. This is because Google’s spider crawls the HTML code from top to bottom. External links placed at the footer typically act as watermarks—paying respect to the company that developed the site—and are not relevant to users. Also, pay attention to your anchor text. It should not be spammy (For example, every other link to your website has the same words except the name of your brand). If your anchor text includes a keyword that mirrors the page it is being linked to, it is an exact match. The anchor text should be relevant both to your page and the donor website. Keep in mind! If the backlink doesn’t meet all these requirements, this doesn’t necessarily make it bad. But you should strive for perfection. Now that we’ve covered just about every aspect of good backlinks, let’s take a look at bad backlinks—links from an irrelevant page, from a low-quality or spammy website or from an irrelevant anchor text. How to check backlinks quality? No metric can singlehandedly and accurately determine whether a backlink is of high or poor quality. But having the skills to interpret link-related metrics will greatly assist you in better understanding their quality. With practice, figuring out the quality of a link will come naturally, but there are also SEO tools that can do the heavy lifting for you. They do this by finding backlinks and checking all the essential metrics associated with each one. Let’s take a closer look at how to use these tools. Use SE Ranking I will show you how to get all the necessary data on your website’s backlinks with SE Ranking’s tool. Go to the Backlink Checker tool ▶️ Enter any domain ▶️ Click the Search button You’ll see the main dashboard with a bird’s-eye view to assess the backlink. The tool provides data on crucial metrics: Domain & Page Trust: scores that reveal your website’s authority and the quality of your backlink profile. The ratio between dofollow and nofollow backlinks that link out to your website. A complete list of your website’s backlinks. By clicking the Backlinks area, you’ll get essential information on every link parameter: the target URL, Domain and Page Trust, an anchor, and the type of backlink (e.g., image, text). Next, go to the New section, where you’ll discover how many backlinks (and what new backlinks) you’ve gotten over a specific period. You can visit the Lost section to assess broken backlinks. The total number of referring domains. Click on the Referring domains area. It will take you directly to the section with all the necessary data on websites linking to your domain (a complete list of referring sources with a Domain Trust score and the number of your backlinks from each website). Now, go to the New section. Here, you’ll find the history of acquired referring domains. Again, don’t forget to visit the Lost section. It contains crucial data on referring domains that disappeared. The total number of anchors. This is a list of the most common anchor texts used in the referring domains and backlinks. Distribution map. You can see where your website traffic comes from and assess your target audience. Each of these sections will help you analyze your backlink profile. To better understand which backlinks are the most valuable for your SEO (and from which websites it is better to get citations), pay attention to the following metrics: Domain Trust of referring domain & Page Trust of the page with a backlink. As described above, these metrics are vital to the success of your backlink. Relevance of referring domain. Open the list of backlinks or the referring domains section and click on any URL. This will bring you to the landing or blog page, where you can assess its content and relevance. The traffic of the referring domain. Copy the URL of the referring page and go to the Competitive Research tool, where you’ll see the estimated number of clicks the analyzed page gets on Google per month. The number of referring domains. To assess the value of any backlink, compare the number of website backlinks and referral domains. The ratio should be as close to 1:1 as possible. This figure can vary. It all depends on your niche. Utilize Google Search Console Google also provides information on backlinks. Go to the Links tab in Google Search Console and look at the Top linked pages in the External links section. Here, you can find out how many incoming links each website page has and the number of unique referring domains they have. Next, go to the Top linking sites section. You’ll see a list of the most popular referring domains. Finally, observe your top anchors. Though this information will assist you in analyzing your backlink profile, this tool’s functionality is limited. Unlike SE Ranking, Google Search Console does not provide additional data on various backlink metrics. What to do next? Once you have selected all the backlinks according to the parameters described above, add them to the Backlink Monitoring tool. You can input them manually or import Excel, CSV, or Google Sheets file from Google Search Console. The fastest way to do this is to add good backlinks for monitoring right to SE Ranking’s Backlink Checker. Just select necessary backlinks and push the Add to backlink monitor button. Once you’ve added your valuable backlinks, the system will run parameter checks regularly. In addition to parameters that you can see in Backlink Checker, this tool: checks if your link is still where it should be shows if a page with your backlink drops out of the Google index displays when your backlink was first spotted and last checked provides data on the external links of a referring page If changes happen to any of the backlinks you’ve added, this monitor tool will notify you via email. All your bad links should be disavowed. This process allows websites to discount the value of an inbound link, helping to prevent link-based penalties. You can also disavow bad links with our tool by checkmarking the ones you want Google to disregard and exporting a ready-to-go disavow file. Next, go to the Disavow links tool in GSC to upload the list of pages or domains to disavow. Finally! After all these steps, you can monitor your best backlinks without wasting valuable time on bad links. How to get high-quality backlinks So, now that you know what good backlinks are and how to check their value, how do you get high-quality backlinks to your website? Getting quality backlinks can be challenging, but here are some proven methods used by veteran SEOs. To learn more about all ways to earn backlinks, read our link building guide. 1. Outreach Outreach involves establishing relationships with other websites to obtain high-quality backlinks, which in turn promotes your brand. This is how to get passive traffic and expand your audience. With the help of outreach, you can earn many common types of backlinks, including guest post links. Outreach efforts can also help you get backlinks from podcasts, videos, and webinars, where you and your team members can present yourselves as experts in your niche and provide valuable information to third-party websites. To get backlinks like these, you should: Identify the best websites to work with. These websites should be similar to yours, but they shouldn’t be your competitors. Research websites with great domain authority. As mentioned above, the domain authority of a website is an indication of what search engines think of it. Come up with an offer. You will want to come up with an offer for the website you are planning to work with. In most cases, website owners will request a guest blog post from you in return for a backlink. You will get a valuable link and they will get free content. Contact website owners. See if there is a contact form on their website or if the website owner has provided their contact information. Send them an email to see if they are interested in your offer and wait for a response. Consider reading tips on how to write an outreach email that strikes a chord with them. 2. Self-submission This category includes all methods of getting backlinks you can create your own. Here are a few of the most popular methods: Create a Google Business profile of your company with your home page URL so users can find you on Google Search and Maps. For the best results, try to get reviews on the most popular platforms like Yelp and TripAdvisor. In addition to these famous ones, you should also consider getting reviews on niche platforms appropriate to your site to get highly relevant backlinks. Writing testimonials for websites you use is an easy method to earn quality backlinks. You’ll spend only a few minutes and earn a link from the homepage of an authoritative website. You can also leave links to your website pages in forums. Find relevant forums to your niche and answer questions (don’t forget to provide links to your landing pages, blog posts, and home page). 3. Earning organic backlinks You can become a valuable source for other bloggers and journalists by using your expertise and unique data. Other sites will naturally (organically) link to your content if it is valuable. Here are a few tried-and-true ways to get organic backlinks: Publish ultimate guides that provide a comprehensive answer on a given topic. These ultimate guides attract inbound links because they help bloggers and journalists reference useful ideas or concepts. Create infographics. These are a popular visual asset for earning backlinks. Combining text with an infographic is a winning move in keeping the user engaged on the page. Authors often use ready-made infographics from other sites to save time, leaving a link to the original resource. Perform unique research. This is another type of sharable content. Blog authors back their claims by leaving links to data provided by reliable sources. As a rule of thumb, do your own unique research to get valuable backlinks. Create video or text interviews with qualified specialists or influencers. Interviews are considered to be a unique form of content that can easily attract organic backlinks to your website. If you write articles, you probably know how important it is to back up your points with an expert quote. Content creators are likely to utilize quotes from your high-quality interviews with niche experts, resulting in backlinks to your website. More link building strategies In addition to the link building methods mentioned above, some SEOs resort to using techniques that Google does not recommend. Still, you should at least be aware of these methods. 4. Purchasing links In addition to the mentioned methods, you can also pay a third-party domain for backlinks. These can be paid guest posts, press releases, or news articles. Plus, you can get a sponsored link in the footer, on the homepage, or the sidebar. But you need to be careful with paid links. Google says that buying or selling links to manipulate search results violates their Webmaster Guidelines and can lead to search engine penalties. As a result, it may negatively impact your website’s ranking. Google recommends that you specify that the links were purchased for advertising. You can do this by adding rel=”sponsored” attribute to the <a> tag. But consider that nofollow and sponsored backlinks won’t pass link juice to your website. They are more often used for increasing your referral traffic and brand awareness, but not for SEO. 5. Receiving backlinks in exchange for services You can also consider offering valuable services to companies in exchange for backlinks. Services such as website development, web design, server hosting, or discounts are perfectly acceptable to offer. By exchanging services for backlinks, both parties stand to benefit from the arrangement. While you gain exposure and potentially improve your own website’s SEO ranking, the website owner benefits from the desired service. These types of backlinks are usually placed in the footer of a website. Please note that Google’s guidelines discourage the use of unnatural or deceptive methods to acquire backlinks. This includes excessive link exchanges solely for the purpose of manipulating SEO. To sum it up Backlinks are the lifeblood of your SEO efforts. They have the power to push your content to the top of the SERPs, establish you as an industry thought leader, and drive traffic to your website. Getting high-quality backlinks might be challenging, but don’t let that deter you from building a strong backlink profile. Now you have an entire arsenal of best practices under your belt, including: knowing what backlinks are why they are so crucial for SEO how to get links and how to check their value Now it’s your turn! Use our advice to succeed in link building 😉 FAQ 1. Why are backlinks important for SEO? Backlinks are important for SEO because they contribute to higher search engine rankings. Search engines view backlinks as a sign of credibility and popularity. Websites with a higher number of high-quality backlinks tend to rank better in search results. Backlinks can also drive referral traffic to a website, helping to increase its visibility and reach. 2. How can I obtain backlinks for my website? There are several ways to obtain backlinks for your website. Some common strategies include creating high-quality content that others naturally want to link to, reaching out to other website owners or bloggers and asking for backlinks, guest blogging on relevant websites, participating in industry forums or communities, creating business profiles, among others. 3. Are all backlinks equally valuable? No, not all backlinks are equally valuable. The quality and relevance of backlinks play a significant role in their value. Backlinks from reputable, authoritative websites that are topically related to your website carry more weight and have a greater (and more favorable) impact on your SEO efforts. High-quality backlinks are more difficult to obtain but can have a stronger influence on search engine rankings. 4. Can backlinks have a negative impact on SEO? Yes, backlinks can harm SEO if they are from spammy, low-quality websites or if they are acquired through manipulative or black-hat techniques. Search engines penalize websites with link schemes or an unnatural backlink profile. It’s essential to focus on acquiring high-quality, organic backlinks rather than resorting to shady tactics. 5. Should I buy backlinks for my website? Buying backlinks is discouraged. Search engines like Google have strict guidelines against purchasing links as it goes against their quality standards. Buying backlinks can lead to penalties and harm your website’s SEO. It is always better to focus on organic, natural link-building strategies, which means prioritizing quality over quantity. But if you want to purchase links for advertising, you can avoid getting marked for a link scheme by adding rel=” sponsored” to the <a> tag. Backlink Profile Ranking Factors 10389 views Written by Daria Chetvertak Daria is a content marketer at SE Ranking. Her interests span across SEO and digital marketing. She likes to describe complicated things in plain words. In her free time, Daria enjoys traveling around the world, studying the art of photography, and visiting art galleries.",
  "headers": [
    {
      "level": "H1",
      "text": "What Are Backlinks in SEO and How to Get Them"
    },
    {
      "level": "H2",
      "text": "What is a backlink?"
    },
    {
      "level": "H3",
      "text": "Backlink examples"
    },
    {
      "level": "H3",
      "text": "What is a backlink profile?"
    },
    {
      "level": "H2",
      "text": "Backlinks, hyperlinks, referring domains, and external links: what’s the difference?"
    },
    {
      "level": "H3",
      "text": "Backlinks vs. hyperlinks"
    },
    {
      "level": "H3",
      "text": "Backlinks vs. referring domains"
    },
    {
      "level": "H3",
      "text": "Backlinks vs. external links"
    },
    {
      "level": "H2",
      "text": "Why are backlinks important for SEO?"
    },
    {
      "level": "H3",
      "text": "1. Website authority"
    },
    {
      "level": "H3",
      "text": "2. Ranking"
    },
    {
      "level": "H3",
      "text": "3. Referral traffic"
    },
    {
      "level": "H3",
      "text": "4. Brand awareness"
    },
    {
      "level": "H2",
      "text": "Backlinks evolution: Google updates"
    },
    {
      "level": "H2",
      "text": "What are good backlinks vs. bad backlinks?"
    },
    {
      "level": "H2",
      "text": "How to check backlinks quality?"
    },
    {
      "level": "H3",
      "text": "Use SE Ranking"
    },
    {
      "level": "H3",
      "text": "Utilize Google Search Console"
    },
    {
      "level": "H3",
      "text": "What to do next?"
    },
    {
      "level": "H2",
      "text": "How to get high-quality backlinks"
    },
    {
      "level": "H3",
      "text": "1. Outreach"
    },
    {
      "level": "H3",
      "text": "2. Self-submission"
    },
    {
      "level": "H3",
      "text": "3. Earning organic backlinks"
    },
    {
      "level": "H2",
      "text": "More link building strategies"
    },
    {
      "level": "H3",
      "text": "4. Purchasing links"
    },
    {
      "level": "H3",
      "text": "5. Receiving backlinks in exchange for services"
    },
    {
      "level": "H2",
      "text": "To sum it up"
    },
    {
      "level": "H2",
      "text": "FAQ"
    },
    {
      "level": "H2",
      "text": "You might be interested"
    }
  ],
  "author": "Daria Chetvertak"
}