{
  "url": "https://seranking.com/blog/big-plans-for-2020/",
  "slug": "big-plans-for-2020",
  "title": "SE Ranking Unveils Big Plans for 2020",
  "description": "2019 was a busy and successful year at SE Ranking and we managed to learn quite a lot. It’s time to set out our aspirations for 2020 and share them with you.",
  "content": "Blog / SE Ranking News / SE Ranking’s big plans for 2020SE Ranking’s big plans for 2020 Written by Andrew Zarudnyi Reviewed by Anastasia Kotsiubynska Jan 31, 2020 10 min read We at SE Ranking have had another productive year and are super excited to tell you everything we have planned for 2020! At the end of last year, we traditionally asked you to make a wish telling us how you want us to improve our platform. You responded with great enthusiasm (thanks a lot!), so we went through all of your wishes and compiled a list that includes every good idea you guys had. Now, we are finally ready to let you know what wishes made it onto our roadmap for this year, and how we plan on bringing SE Ranking into the new decade. Let’s get to it! Design overhaul to make room for a sidebar! The main Dashboard will get a brand new look. Specifically, the menu with all of the project data and access to such modules as Competitors and Website Audit will be moved over to the left side of the screen, and all other standalone tools such as SEO/PPC Competitor Research and Backlink Checker will stay at the top of the screen along with the breadcrumb trail. Soon you’re going to have the opportunity to test out the new design, but we will still give you the option to use the old, familiar layout. Rankings data on the move — export and transfer SERP standings to another account Did you notice the new, slick design of the Rankings module in the screenshot above? ? Well, on top of that, there are going to be a few function-related improvements. First off, we’ll make it possible to transfer projects from one account to another — with all of the data intact, including rankings history. You’ll soon be able to export and import data from previous years (right now you can import data into a project, but only for the current year). Track more competitors and get historical data for the last year The Competitors module will also get a facelift along with the entire platform: updated dashboard, competitor overview table, graphs. The update will spread to every tab within the module: My competitors, SERP competitors, Visibility rating. Moreover, you’ll finally be able to add more competitors to your project to track and compare their rankings (the current limit is 5). As for your competitors’ rankings data, they will be stored in the system for a whole year, so if you feel like taking a look back at your rivals’ progress — nothing’s stopping you. White Label for SEO/PPC Competitor Research We heard your feedback well and are already acting on it! The SEO/PPC Competitor Research tool will be white-labelable: brand the interface with your corporate style, stick your own logo on it and share every tool and feature under your own domain name. By the way, the release date is right around the corner 🙂 Expand North American, European and Asian databases And we most definitely won’t be able to resist getting more keywords into our global databases. We plan on expanding our databases for the UK, the US, Eastern Europe, and so on. Some of you made a wish for us to add Kazakhstan, Mexico and South Africa, and they can already be found in SEO/PPC Competitor Research! But that’s not all! We are working on keyword databases for Hong Kong, Turkey, and the United Arab Emirates. Keep an eye out for our monthly updates as you never know what database will be unveiled next. Keyword Research and Suggestions expansion Plenty of you have reached out to us with various recommendations on how to make our Keyword Suggestions tool better (can be found under SEO/PPC Competitor Research). At the moment, you can use the tool to get a list of Similar keywords (circumlocution, synonyms), Related keywords (those that have SERP matches) and Long-tail keywords. This year, we plan on adding semantic keyword grouping (questions, comparisons, etc.), as well as the option of creating a couple of search result filters. It will be possible to put all of the collected keywords together into different lists, export and add them to existing projects or new ones. If you ever get the urge of taking a deep dive into all of the stats for a specific search query, go to the Keyword Research tab of the SEO/PPC Competitor Research tool to quench your desire. Keyword Research will also get its fair share of updates. If you think that there’s a lot of data there already, then wait till you see what we do to it. Here’s what we plan on adding to the keyword data table: breakdowns of competitor page and domain traffic distribution; Google SERP features (answer box, knowledge graph, images, maps, etc.); keyword topics (similar to Google Ads classification); history of organic search results for all keywords. All in all, the SEO/PPC Competitor Research tool is getting a major structural and design makeover that will definitely catch your eye 🙂 Website Audit will become faster and accessible to Wix sites Wix has really taken off and because of this, we’ve been getting multiple requests to make it possible to audit websites built with Wix. This year, our crawlers will get Javascript rendering support, allowing us to conduct more precise audits of websites that are built on various platforms, including Wix. Another goal that we have set for the year is to boost the performance of the Website Audit. To do this, we will increase the number of crawler servers and set a limit on the audit of large sites — up to 250 thousand pages. Right now the audit scans every parameter at once (pages, links, tags, domain technical specifications, download speed, etc.). So what we plan on doing is giving you the opportunity to choose what types of website errors you want to check, which, in turn, will significantly speed up the tool. And the coolest part is that (are you ready?) you’ll be able to audit your competitors without creating a separate project. The new decade is bringing in new standards and we don’t want to make you jump through hoops to get something simple like that. Just enter a competitor domain and get a report. As for the audit itself, it will start running AMP checks, and the bots will scan content on the subject of uniqueness across the entire analyzed site. And, of course, we will redesign this tool along with everything else 🙂 Google My Business integration The headline could have just as easily read: “New section devoted to local SEO coming soon”, which is true as it’s already pretty close to being ready. But way more of you voted for us to integrate Google My Business with SE Ranking. And when we got to thinking about it, we realized that we need to develop an entirely new section to support GMB. I’m not going to disclose all of the details just yet, but I can say for sure that you will be able to monitor your GMB project data, including Google reviews, right from your SE Ranking account. Plus, we will automatically check to see which business listings already include your brand. Browser extension in the pipeline Using the plugin, you’ll be able to quickly check up on the basic SEO performance of any page or domain. For example, quickly identify a site’s competitors, evaluate its search traffic and backlink profile, run a basic SEO page audit, identify what keywords it ranks for, etc. As soon as the extension is ready, we’ll do a full review and tell you about all of the ins and outs. SEO/PPC Competitor Research going mobile One of SE Ranking’s proudest moments of 2019 was the release of the mobile app that’s equipped with Keyword Rank Tracker, Website Audit, Marketing Plan and Business Listings. But practically the next day after the mobile app was rolled out, you guys asked us to add the SEO/PPC Competitor Research tool to the app’s set of functions. And the wishes you made before the New Year further tipped the scales in favor of adding the tool. So, this is us making a promise to you to add SEO/PPC Competitor Research to the mobile app in 2020. In addition, the mobile app will also give you the opportunity to look for keyword suggestions on the go. But don’t get me wrong — you can do it now, but only during project creation. What we plan on doing is adding the independent full-fledged tool. Share reports via links In addition to the fact that you will be able to view and share reports via a link, the Report Builder tool will get new sections with data relating to: Google Search Console, Backlinks and competitor research Finally, our wonderful users asked us to make it possible for them to edit saved reports that have already been generated. Our answer: Coming right up! Instagram coming to Social Media Management In our SMM module, you can enable social media auto-posting for Facebook, Twitter, and VKontakte. We received many requests to add Instagram, and our CTO finally gave in. So, Instagram is coming to SE Ranking in 2020! Everything will work faster We will work on optimizing the entire platform as well as each separate tool. First of all, we’ll solve the problem of loading large websites that contain up to 1 million keywords. Additionally, we will speed up the Dashboard’s data loading processes, optimize the verification of giant domains in Website Audit and the sorting of a large number of keywords in Keyword Grouper. To sum up, we have a lot of big plans, ideas, and goals for 2020. Reach out to us to tell us what you’re looking forward to the most and we will include you in the test group. If you see your wish among our plans, let us know and you will be the first one to know when it’s ready. By the way, an entire month has already gone by since the start of 2020, which means that we have already crossed some items off of our to-do list. In the nearest future, we’ll let you know all about our January updates. And, of course, we invite those who are not familiar with our platform for a free trial. Just start a project, try out the tools — 14 days free of charge. And if you have any questions, our support team will gladly help you out. 2403 views Written by Andrew Zarudnyi Andrew is a content marketer, writer, editor, and webinar host at SE Ranking, plus a guest contributor across various marketing media. He is passionate about content, marketing, social media, and SEO best practices and leverages his experience to help companies reach their global audiences more effectively. When he’s not writing about SEO and marketing, he can be found spending time with his cat, enjoying a video game, watching too much soccer or playing the guitar (in that order).",
  "headers": [
    {
      "level": "H1",
      "text": "SE Ranking’s big plans for 2020"
    },
    {
      "level": "H2",
      "text": "Design overhaul to make room for a sidebar!"
    },
    {
      "level": "H2",
      "text": "Rankings data on the move — export and transfer SERP standings to another account"
    },
    {
      "level": "H2",
      "text": "Track more competitors and get historical data for the last year"
    },
    {
      "level": "H2",
      "text": "White Label for SEO/PPC Competitor Research"
    },
    {
      "level": "H2",
      "text": "Expand North American, European and Asian databases"
    },
    {
      "level": "H2",
      "text": "Keyword Research and Suggestions expansion"
    },
    {
      "level": "H2",
      "text": "Website Audit will become faster and accessible to Wix sites"
    },
    {
      "level": "H2",
      "text": "Google My Business integration"
    },
    {
      "level": "H2",
      "text": "Browser extension in the pipeline"
    },
    {
      "level": "H2",
      "text": "SEO/PPC Competitor Research going mobile"
    },
    {
      "level": "H2",
      "text": "Share reports via links"
    },
    {
      "level": "H2",
      "text": "Instagram coming to Social Media Management"
    },
    {
      "level": "H2",
      "text": "Everything will work faster"
    }
  ],
  "author": "Andrew Zarudnyi"
}