{
  "url": "https://seranking.com/blog/big-plans-for-2021/",
  "slug": "big-plans-for-2021",
  "title": "SE Ranking Unveils Big Plans for 2021",
  "description": "Traditionally, every January SE Ranking team sets out plans for the year ahead. Learn which new tools we'll be developing in 2021 and which modules will get an upgrade.",
  "content": "Blog / SE Ranking News / SE Ranking’s big plans for 2021SE Ranking’s big plans for 2021 Written by Svetlana Shchehel Jan 26, 2021 10 min read Every year in December, we ask you to share your wishes with us and then in January, we go through the list of your suggestions to decide, which of them will make it to our roadmap. This year it may seem like New Year resolutions are no longer relevant, since we’ll probably have to transform our plans to adapt to the ever-changing landscape. Still, we at SE Ranking decided to stick to our traditions, and so we are ready to tell you what we are up to in 2021. Thanks for the hundreds of wishes you’ve made—we’ve read every single one of them, selected the most popular suggestions, and now we have a clear plan for the year ahead. New local marketing module Back in 2020, we started to develop a tool that will help you to effectively promote your websites in local search. With its help, you’ll be able to add your website to popular directories and manage the accuracy of your NAP data in your Google My Business profile and across dozens of other catalogs. The tool will also let you keep track of your ratings and customer reviews. You’ll be able to integrate the module with your Google My Business account and add multiple locations for monitoring. Finally, with the help of this module, you’ll be able to track your Google Map rankings to understand whether your local SEO endeavors pay off. The long-awaited SEO content module We’ve heard from many of you that you’d love our platform to have a content module that would help you with SEO text analysis. We totally agree that we need such a tool, so by the end of 2021, SE Ranking will start helping you with creating quality content search engines will love. The tool will check whether the text is unique and easy-to-read and will give you recommendations on adding keywords to it. You’ll be able to use our SEO editing tool both within our platform environment and directly in Google Docs—we plan on creating a respective plugin. And maybe we’ll develop a WordPress plugin as well. Faster and more comprehensive website audit In addition to developing new tools, this year we’ll keep working on improving our existing modules. Website Audit is the first on the list—very soon you’ll be able to take the updated tool for a spin. The new audit will be way faster and much more user-friendly. It will scan your website against 50+ new parameters including SSL-certificate expiration date, possible CSS and JavaScript errors, parameters that impact website speed, and canonical and hreflang issues. We keep transforming our platform in a way that allows you to customize every tool to your needs. That’s why with the new Website Audit you’ll be able to choose on your own which issues you want to check and which should be dropped. Once the scanning is over, you’ll get a summary report on a new dashboard—graphs and tables will help you understand, which of the detected issues need to be prioritized. Personalized On-Page SEO Checks Another tool that we plan to transform beyond recognition is our On-Page SEO Checker. Currently, the tool analyzes website pages against a number of set parameters. For example, it checks whether keywords are used in headings or whether the title length does not exceed 70 characters. The new tool will give you recommendations based on the specifics of your niche SERP and not based on universal rules. TestSubtitleNext step You’re all set!Click the link we sent you in the email to confirm your emailand get We’ll analyze Google’s top 10 search results for every target keyword—you’ll be able to set several target keywords for every page. The tool will be looking for some patterns within the competing pages: say, all the websites ranking on Google’s first page used the same keyword in H1, four competitors added an emoji to their title tags, and five rivals used bold in the text. The tool will recommend you to implement similar adjustments to your page. Historical data for keyword and competitor analysis + new graphs and filters SE Ranking regularly updates all the metrics you find in Keyword Research and Competitive Research tools—you can always check when the data was last updated in the upper right corner of the module. Still, sometimes having up-to-date metrics on hand is not enough to make the right decision—you may also need historical data to analyze all the metrics dynamically. In 2021, you’ll get such a chance since our tools will show you how every metric changed over the last couple of months. On top of that, we plan to make it possible to compare your website to ten rival sites at a time—currently you can only add two websites for comparison. In the Keyword Research tool, you’ll be able to filter search queries by the number of words (1-word terms, 2-word terms, etc.) Finally, we want to remind you that if you need some keyword databases to effectively solve your daily tasks—let us know. It will help us prioritize the most requested databases. Bulk backlink analysis and API tracking Back in 2020, we added bulk keyword analysis to the platform to help you save your time and account limits. It looks like you really liked the feature, so this year we’ll be adding the same functionality to the Backlink Checker module. Those of you who use the API will also get a chance to have all the necessary backlink data quickly delivered to your desired interface. More customizable reports and plenty of new templates We know exactly which extra data you’d love to have in your reports, so in 2021 we’ll be adding a lot of new templates to the Report Builder: Competitive and Keyword Research report(s) Backlink Checker report Backlink Monitor report Google Search Console report Local marketing report Speaking of the latter one, we’ll obviously be adding the new module to the platform for such a report to become available 🙂 We’ll also grant admin accounts an opportunity to see which reports their subaccounts create—that way you won’t be creating the same report twice. Besides, we’ll make it possible to create separate reports for keyword groups instead of a single report for the whole project. This will help you with, say, creating separate reports for different locations you target. Finally, if you have your Google Analytics connected to the project, you’ll be able to add traffic data for every keyword to the rankings report. Your customers and managers will love this feature as this data will allow them to immediately see which tangible benefits your top rankings bring. We’ll keep working on the platform UX… In 2020, we started our journey towards creating an extremely user-friendly and intuitive environment for SE Ranking customers. Last July, we fully updated our platform design, introduced the left-side navigation, and updated all the major tools. During the second half of 2020, we’ve been adding new UX-essential features to the platform. In 2021, the plan is to keep up the good work—we’ll be telling you about all the usability updates in our monthly posts on the platform updates. One thing I’d love to share with you right now is the new customizable project report we’re planning to implement. We’ll develop a set of widgets that will let you visualize all the key project metrics in a way that fits your needs best—you’ll be able to choose on your own, which of the widgets to include to the dashboard. … and improving our mobile app’s usability I hope that you remember that, in addition to the desktop platform, we also have a pocket-friendly iOS and Android mobile app, where you can quickly check your website rankings, relaunch a website audit, and check out the marketing plan tasks you’ve done. In 2021, our focus will be on improving the app UX to provide you with an absolutely seamless user experience. On top of that, we plan on adding a new module to the app. Based on website audit results, the module will generate a list of tasks for you to complete, and it will help you stay on top of these tasks—for example, the app will keep reminding you that you have 30 broken internal links on your website ? Chrome plugin for quick page analysis In addition to fine-tuning our mobile app, we’re planning to create a Google Chrome plugin. With its help, you’ll be able to check key website metrics—both for your own projects and those of your competitors. The plugin will show website traffic and DT, the website’s major rivals, and the keywords it ranks for. Moreover, you’ll be able to add all the enticing keywords to your project in one click. Definitely, these are not all of our plans—we’ll be working on dozens of other small features that didn’t make it to this post. We’ll be writing about all the little updates in our monthly posts, so stay tuned. Tell us, which updates you’re looking forward to the most, so that we could add you to the beta testing group. Also, drop us a line in case you didn’t manage to share your wishes with us back in December, but you have plenty of cool ideas we need to learn about. We’re happy to receive your feedback year round, and if the feature you suggest is really valuable, we’ll always find a way to fit it into our plans. Finally, if you’re not using SE Ranking just yet, how about you test it out for free and see how the platform can help you streamline your daily routine? Once you sign up, you’ll get a two-week free trial to take every tool we offer for a test drive. Our customer success team will be happy to answer all your questions and if upon testing you decide to join our friendly community of SE Ranking customers—we’ll also help you with data migration. 2792 views Written by Svetlana Shchehel Svetlana is the Head of Content at SE Ranking. Her interests span across digital marketing, SEO, and translation. She regularly shares her expertise on the SE Ranking blog and across various marketing media. Svetlana believes that complex notions can be explained in plain words and loves creating immersive stories. Svetlana spends most of her evening hours learning new languages, planning memorable trips, and petting her cat.",
  "headers": [
    {
      "level": "H1",
      "text": "SE Ranking’s big plans for 2021"
    },
    {
      "level": "H2",
      "text": "New local marketing module"
    },
    {
      "level": "H2",
      "text": "The long-awaited SEO content module"
    },
    {
      "level": "H2",
      "text": "Faster and more comprehensive website audit"
    },
    {
      "level": "H2",
      "text": "Personalized On-Page SEO Checks"
    },
    {
      "level": "H2",
      "text": "Historical data for keyword and competitor analysis + new graphs and filters"
    },
    {
      "level": "H2",
      "text": "Bulk backlink analysis and API tracking"
    },
    {
      "level": "H2",
      "text": "More customizable reports and plenty of new templates"
    },
    {
      "level": "H2",
      "text": "We’ll keep working on the platform UX…"
    },
    {
      "level": "H2",
      "text": "… and improving our mobile app’s usability"
    },
    {
      "level": "H2",
      "text": "Chrome plugin for quick page analysis"
    }
  ],
  "author": "Svetlana Shchehel"
}