{
  "url": "https://seranking.com/blog/brand-voice-guide/",
  "slug": "brand-voice-guide",
  "title": "Ultimate Guide to Finding Your Brand Voice and Tone",
  "description": "Discover the secrets of creating a strong brand voice. Learn to identify your brand values, develop specific tones for different channels, and more.",
  "content": "Blog / Agency Operations / Getting your brand’s voice and tone rightGetting your brand’s voice and tone right Written by Megan Grant May 17, 2023 17 min read Your company’s online presence will stagnate if your customers don’t remember who you are. That’s why you need to zero in on your brand voice. In this article, we’ll help you get clear on how to communicate with your audience across various channels within your business. You’ll learn: Why your brand’s voice matters. How brand voice and brand tone are different Various brand voice types. Brand voice examples in marketing and advertising. Factors that influence brand voice. How to establish a brand voice. How to apply your brand voice across different communication channels. And, if need be, how to change your brand voice. AI Overviews Study by SE RankingDownload our free ebook with research findings and sign up to SE Ranking’s news and SEO tips digests!Next step You’re all set!Click the link we sent you in the email to confirm your emailand get AI Overviews Research by SE Ranking Brand voice vs. brand tone of voice Maybe you’re wondering why this post is centered around a brand voice when the word tone is also included in the title. Brand tone of voice and brand voice are often used interchangeably, but they’re not the same thing. That’s why it’s important to make one crucial distinction before moving on. What is a brand voice Brand voice is how your brand conveys its unique personality, values and perspectives to its audience, whether through written or spoken word. This can include elements such as style, special greetings and phrases, and the attitude behind your messaging. Your brand voice refers to your company’s overall personality, values, and perspectives. So it should remain consistent no matter what. To get an idea of how to do this, look at your content across all its communication platforms. Your SEO and blogging, for instance, is a chance to establish how you want to sound when publishing written content. The same principle applies to your SEO and social media approach. Your voice in advertising and marketing is no different. It’s especially important to buckle down on the voice of your content if you’re spending money promoting marketing collateral. What is a tone of voice The tone of voice is how your brand uses words to express itself to your audience. This includes the attitude, personality, and feeling conveyed through word choice, phrasing, and intonation. Your brand tone of voice can change slightly depending on the situation. For example, the way you communicate on Instagram may differ from your approach on TikTok, as the latter of which leaves more room for controversial or opinionated content. While there are times when adjusting your tone is necessary, it oftentimes confuses people. So when changing your tone, you must read the room. To summarize, your brand’s voice is your overall personality, and your brand’s tone is how you communicate. Both are important! Why brand voice is important for your business To set yourself apart from your competition, your brand voice should be consistent with your brand’s identity. People should be able to instantly associate your content with your brand just by looking at it. For example, if your company sells seashells by the seashore, you might have a surfer-dude brand voice. Your customers might recognize your brand as the surfer-dude company that sells seashells and stuff. Surely, you can use different tones depending on the situation. For example, if you’re responding to a serious Quora question, you might want to offer advice in a more lukewarm way. Your tone of voice might also differ across product categories on your site. Here’s a tip: read the room. But no matter how serious the situation gets, you’re still you, right? You don’t have to change your brand’s personality to change its tone—and you shouldn’t. Statistics show that you’re even incentivized not to. Having a consistent brand voice could increase your revenue by as much as 33%. Some research even says that 64% of customers would pay more for brands they trust. If you haven’t settled on the brand voice, or it isn’t clear about its value structure, why should anyone care about what you have to say or what you offer? In short, being consistent with who you are is crucial to building authority and credibility. Types of brand voice As you’re now aware, there are different types of brand voice. Yours might be: TypeDescriptionExampleFormalFollowing rules of etiquette and conventionCDCInformalMore relaxed and unofficialFlo from ProgressiveFunnyMaking people laughDuolingoSeriousMore careful and considerateAllstateFactualSharing the real case and not opinions or interpretations of itLegalZoomOptimisticPromoting positivity and perseverancePresident Obama’s campaignMotivatingInspiring confidence and hopeCrossFitRespectfulShowing deferenceSt. Jude Children’s Research HospitalAssertiveMore confident and insistentMe Too movementConversationalCasual and informalDell Technologies Regardless of the style of voice you choose, you want to maintain it across all of your marketing and advertising channels and campaigns, including YouTube, Facebook, email marketing or UX writing. This consistency plays a vital role in making your brand more recognizable to your audience. And that builds trust. Brand voice examples It’ll help to illustrate what a brand voice can look like. Let’s go through a few examples! TextTone of VoiceImpression“52% of our users start with the free version before upgrading to a paid subscription. The remaining 48% goes straight to a paid subscription.”Formal, factualStatistic-based and concise; trying to prove a point to the reader with cold, hard facts“You don’t have to struggle with your mental health alone. Our online therapists are here for you. Help is just a click away.”Motivating, respectfulEmpathizing with the user; encouraging them to seek help“Food waste is destroying our planet and leaving millions hungry. The time to act is now.”Assertive, seriousUrging the user to listen and take action You can see here how important word choice is. Just a few small adjustments can change the entire sentiment of the message. What influences your brand voice? Many factors go into your brand voice. Three of the most important are: Your company’s profile specifics Your target audience The communication channels you use Let’s explore each one. Company profile If you’ve ever clicked on an About us page, you’ve seen a company profile. Pages like these introduce to potential customers and partners what the company does, how it helps people, its mission, strengths, and goals. The company profile might also consist of an origin story and/or the motivation behind the company’s inception. Marketing and advertising teams should consider all these things carefully when settling on the company’s voice. For example, a company that offers online legal counseling might have a completely different brand voice than an app that shows you who’s “stalking” you on social media. Target audience Identifying your target audience is crucial for creating an effective marketing strategy and building a successful brand. When you know who your audience is, as well as their needs and their preferences, you can tailor your messaging, products, and services to meet their needs. Understanding your audience makes it possible for you to: Create content that’s more relevant and engaging. Establish stronger connections with your customers. Drive better business outcomes. Failing to identify your target audience can result in wasted resources and marketing campaigns that don’t resonate with your audience. An audience of individuals struggling with ADHD, for example, wouldn’t respond as well to a voice tailored to gamers. Look at CHADD. This organization supports and provides resources not just for people with ADHD, but also their loved ones, educators, and other professionals. Their brand voice—inclusive, sensitive, embracing—is completely different from Tony Robbins, who is a lot more aggressive (in a positive way). Communication channels Finally, consider your communication channels. For example, if your brand relies solely on LinkedIn—a network of professionals—that’s something to think about. This would call for a very different approach from a brand that primarily utilizes TikTok. Let’s go back to the Duolingo example—a brand that has become known for its slightly outrageous TikTok content. Note that their approach to Instagram is very different. What makes a good brand voice? Here are some key factors that go into shaping the brand voice that’s true to you and what you do: A good brand voice should be relatable to the audience. It should cater to them and offer them what they need. CHADD understands that people with ADHD aren’t the only ones affected, so CHADD provides education and advocacy for everyone involved. It should be consistent. Users should be able to visit any of your channels and instantly recognize what brand they’re looking at. You know Duolingo’s TikTok content when you see it. It should leave room for flexibility. All brands evolve over time, which means your brand voice will also. Target has done a great job of this by becoming more inclusive with their sizing and gender-neutral product offerings. How to create a brand voice Now that you know a little more about what makes a good brand voice, let’s talk about how to create one. Identify your brand’s values and features Identifying your brand’s purpose, strengths, and the problems you help solve is essential for creating an authentic brand voice. Your strengths are the unique characteristics that set you apart from your competitors. When you know the problems that your brand solves, you can better communicate the benefits of your brand to your audience. Consider these important questions about your brand: What is our purpose? What do we care about? What are our strengths? What problems do we help solve? The answers you get from asking these questions are your “need-to-know” details. They lay the foundation for a strong and effective brand voice that aligns with your brand’s values and target audience. Review your existing content and communication methods Don’t jump right into a new brand voice idea. Instead, ask yourself, how would you identify your current brand voice? What’s missing, and how would you change it to better align with your ideal brand voice? Get a firm grip on where you’re at now in the process. Taking stock of your current resources and using them to piece together a new and improved brand identity is more useful than randomly envisioning a new one. This point holds especially true if you already have a dedicated consumer base—no matter how big or small. Take what is working and figure out how to mold what you observe from it into your new brand identity. Conversely, try to shy away from identifying with the content you’ve created that your audience isn’t responding to. Conduct competitor and market analysis Maybe you aren’t striving to look like your competitors—that’s totally okay, even preferable! But you can still learn a lot from them. You need to know what they’re up to, especially the brands outperforming you. So try asking questions like why they’re more successful, how they present themselves, and how they communicate with their audience. Think of it this way. You’re learning from your competitors, not copying them. You’re diving deeper into the market and understanding it inside and out. Once you know the market like the back of your hand, you’ll learn how to build a brand voice that speaks to your target audience. You can use our competitor finder tool to streamline your competitive research. Enter any competitor’s URL and get a 360-degree view of their organic and paid promotion strategies. DO COMPETITIVE RESEARCHWho are your closest rivals and how do they position themselves in search? It's time to find out.Analyze You can also use the tool to determine your major competitors. Enter your site’s URL in the search bar and go to the Competitors section. By analyzing all these sites, you’ll get a more well-rounded idea of what types of brand voices resonate best with audience’s in your niche. Look at their website, identify their brand voice and see how well their audience responds to it. This will give you some much-needed insights while you work on developing your own brand voice. Also, look into what keywords drive the most organic traffic to your competitors’ sites. What do the pages on their site look like? What are your competitors talking about? This is how to figure out what your target market is paying attention to. You can also use SE Ranking’s Ad History section. See what ads your competitors ran in the past, what kind of traffic and volume they got, and what their cost-per-click was. What was delivered? What didn’t? This is another way to gauge what your audience will respond to. Collect feedback from your target audience You’ll need to collect feedback from your target audience to develop and refine your brand voice, and there’s only one way to know what your audience thinks: Ask them! Social media polls, email surveys, and website forms are all excellent ways to gauge their perception of your brand voice. Your audience should play an active role in the evolution of your brand identity; they aren’t just people you talk to. They are the ones spending money on your products and your services. By involving them in the process and listening to their feedback, you can create a brand voice that resonates with them and effectively conveys your brand’s values and personality. Taking their feedback into account helps you build stronger relationships with your audience. You’re essentially creating a brand that addresses their needs and preferences in a genuine way. Remember, your audience is more than just people you talk to. They are your customers, and their feedback is critical to the success of your brand voice strategy. How to implement your chosen brand voice Let’s say you’ve done the research, taken stock of your existing resources, and worked with your marketing team to craft the perfect brand voice. You’ve even figured out how to read the room in every situation and can change your tone when it’s appropriate without changing your identity. If you can do these things, you’re ready to take your brand voice to the next level! Here’s how. Create an internal glossary for your brand Creating an internal glossary for your brand can be an effective way to ensure that everyone on your team is using the same language and messaging when communicating with customers. It should define your brand voice, including its tone, style, and core messaging. This glossary should also provide guidelines on specific words or phrases to use (or avoid) when communicating with customers, as well as instructions on adapting your brand voice to different channels and mediums. By creating a detailed internal glossary, you can ensure that all team members are on the same page about your brand voice and messaging. This can lead to more effective communication with customers and strengthens your overall brand identity. Keep in mind that your brand voice can change depending on the channel or medium, which lends itself to our next point. Decide specific tones for each communication channel As we discussed earlier, your brand tone of voice can vary in different situations, unlike your brand voice. To address this, create sections in your brand voice style guide for each channel or medium you use. This includes guidelines for social media platforms like TikTok, Instagram, Facebook, LinkedIn, and Twitter, as well as email marketing, SEO, chatbots, instant messaging, and your website UX. For example, while TikTok may call for a more informal and playful tone, LinkedIn requires a more professional and business-focused tone. Similarly, your email marketing messages may need to be more concise and direct compared to your social media posts. By tailoring your tone to each channel, you can ensure that your messaging resonates with your audience and effectively conveys your brand’s values and personality. Just be sure to maintain overall consistency in your brand voice and ensure that all teams and departments are aware of and follow the guidelines outlined in your brand voice style guide. Maybe your consumers aren’t responding to your brand voice So what if you come to discover that your brand voice in advertising and marketing isn’t the right fit? Don’t panic—think of your brand as a living, breathing thing. It’s meant to evolve over time. Answer these questions to analyze your brand voice: Where do you currently stand? Audit your present brand voice. What’s missing? Identify your current brand voice’s strengths and weaknesses. What is your audience saying? The decision to change your brand voice should be driven by audience feedback. What complaints or concerns have they presented? How can you get from where you are now to where you want to go? Is the tone you’re using across different communication platforms uncharacteristic of your brand voice? How will you adjust your word choice, delivery, and brand voice? Brand tone of voice and brand voice are two pieces of the puzzle that make up your brand. Audit where you currently stand, analyze your competitors, and listen to what your target market is saying. Over time, you’ll zero in on the most effective strategy. We get it When it comes to settling on brand identity, nobody has all the answers. Homing in on your brand voice (and tone of voice) isn’t easy, and it surely doesn’t happen overnight. So whether you’re a veteran in the marketing sector or a brand-new solopreneur, we invite you to share your own experiences with us! In the comments below, tell us some brand identity tips and tricks you’ve learned along the way! Branding Competitive Research 2614 views Written by Megan Grant Megan has been writing and editing professionally since 2011. Writing is, hands down, her favorite thing to do. Her chihuahua, Peanut, often steps in to help with edits.",
  "headers": [
    {
      "level": "H1",
      "text": "Getting your brand’s voice and tone right"
    },
    {
      "level": "H2",
      "text": "Brand voice vs. brand tone of voice"
    },
    {
      "level": "H3",
      "text": "What is a brand voice"
    },
    {
      "level": "H3",
      "text": "What is a tone of voice"
    },
    {
      "level": "H2",
      "text": "Why brand voice is important for your business"
    },
    {
      "level": "H2",
      "text": "Types of brand voice"
    },
    {
      "level": "H2",
      "text": "Brand voice examples"
    },
    {
      "level": "H2",
      "text": "What influences your brand voice?"
    },
    {
      "level": "H3",
      "text": "Company profile"
    },
    {
      "level": "H3",
      "text": "Target audience"
    },
    {
      "level": "H3",
      "text": "Communication channels"
    },
    {
      "level": "H3",
      "text": "What makes a good brand voice?"
    },
    {
      "level": "H2",
      "text": "How to create a brand voice"
    },
    {
      "level": "H3",
      "text": "Identify your brand’s values and features"
    },
    {
      "level": "H3",
      "text": "Review your existing content and communication methods"
    },
    {
      "level": "H3",
      "text": "Conduct competitor and market analysis"
    },
    {
      "level": "H3",
      "text": "Collect feedback from your target audience"
    },
    {
      "level": "H2",
      "text": "How to implement your chosen brand voice"
    },
    {
      "level": "H3",
      "text": "Create an internal glossary for your brand"
    },
    {
      "level": "H3",
      "text": "Decide specific tones for each communication channel"
    },
    {
      "level": "H2",
      "text": "Maybe your consumers aren’t responding to your brand voice"
    },
    {
      "level": "H2",
      "text": "We get it"
    },
    {
      "level": "H2",
      "text": "You might be interested"
    }
  ],
  "author": "Megan Grant"
}