{
  "url": "https://seranking.com/blog/bsm-case-study/",
  "slug": "bsm-case-study",
  "title": "Case Study: How a Nigerian Lager Beer Made It to Position 1 in US SERP",
  "description": "The Boulder SEO Marketing agency took over the website of the Nigerian lager beer distributor, and within just four months of work, made it ranked #1 in Google in the US, despite the impossible-to-beat competition. How? It's all explained in the article.",
  "content": "Blog / Case Studies / How a Nigerian Lager Beer Secured the #1 Spot on Google in the USHow a Nigerian Lager Beer Secured the #1 Spot on Google in the US Written by Stasia Avetysian Nov 15, 2021 6 min read The Agency Boulder SEO Marketing (BSM), a Denver search engine optimization company, has been implementing digital marketing campaigns with local, national, and global objectives since 2009. Specializing in affordable SEO packages, they assist businesses of all sizes and tailor their approach for every client, so they can help each company achieve their unique objectives. The Client Based in California, Star Beer USA imports Nigerian lager and distributes it to bars, restaurants, and liquor stores throughout California and Texas. Competing with brands that generate billions of dollars in revenue annually, they needed to appear on the first page of search results to attract at least some of the traffic pursuing foreign beer. The Goals Star Beer USA wanted to: Rank higher than the competing distributors on the search engine results pages (SERPs) Appeal to an American audience Boost organic search traffic Let beer drinkers know about the availability of their Nigerian lager at select locations in the United States Steps to Reach the Goals After discussing these goals, BSM devised an action plan that would not only land them a spot on the first page but actually secure them the very first result—the most coveted position on the SERP. As with most of BSM’s campaigns, the SEO agency took a multi-faceted approach to boosting the client’s visibility. Once Star Beer USA started appearing higher on the SERP, achieving their more specific goals was essentially inevitable. The initial strategy included the following steps: 1. Edit the Wikipedia Page Star Beer USA had an existing page on Wikipedia, but it lacked backlinks. BSM plugged those in, so a single click would take readers to the company’s official website. 2. Create Content Next, BSM worked closely with May Odiakosa, the company’s founder, to produce high-quality content for their blog. Not only did their posts make the website look more credible to search engines, but they also provided value to potential and existing customers. 3. Deploy Digital PR Strategy The third step focused on highlighting Star Beer USA’s uniqueness, including the lager itself, the company’s proud Nigerian founder, and their charitable contributions. BSM deployed a comprehensive digital PR strategy and published several search engine-optimized press releases to get the message across. 4. Harness the Power of Social Media Businesses active on social media get more engagement, which translates to more web traffic and, consequently, more credibility. BSM created and optimized a LinkedIn Company Page and a Google My Business profile for Star Beer USA and updated both regularly. 5. Stay One Step Ahead of the Algorithms Just because you reach the number one spot on a Google SERP doesn’t mean you’re going to stay there. Consistently ranking high so potential customers can always find you is an ongoing process that demands diligence. As such, BSM helps all their clients implement enduring SEO tactics and web design strategies to maintain visibility in the years to come. What Were BSM’s Most Valuable Tools? To help Star Beer USA rank number one on Google, BSM relied heavily on SE Ranking’s tools. Website Audit, Competitive Research, and Keyword Rank Tracker were among the tools that helped them out the most.A comprehensive evaluation of the technical side of the project provided by the Website Audit tool allowed the team to identify sitewide issues that needed to be addressed so the client’s goals could be achieved. BSM founder Chris Raulf recently interviewed Bogdan Babyak, Chief Marketing Officer at SE Ranking, about the capabilities of their Website Audit tool. In the 20-minute interview entitled Meet the Ultimate Website Audit (and SEO) Tool [An Expert Interview], Bogdan shares how the Website Audit tool can support any SEO strategy. Griffin Beste, Director of Operations at BSM, who was kind enough to help us prepare this use case, also shared insights about how they use the Competitive and Keyword Research tools as well as the Rank Tracker. RUN A WEBSITE AUDITScore your website in 2 minutes. Enter any website URL to get a detailed report on tech issues and suggested solutions.Analyze Finding content optimization opportunities with the Competitive and Keyword Research tools With the help of the Competitive Research tool, BSM identified common keywords that the client’s competitors were ranking for, so they knew who they were up against in organic searches. The tool also provided a snapshot of keywords that Star Beer USA had gained, lost, and recently secured. This allowed BSM to find additional opportunities for optimization, including in meta titles and descriptions. DO COMPETITIVE RESEARCHWho are your closest rivals and how do they position themselves in search? It's time to find out.Analyze Client website real-time and historical search performance analysis The Rank Tracker tool allowed BSM to evaluate how the client’s site had performed over its lifetime. By continuously logging variables like search volume and average position, the tool also made it possible to track the campaign’s ongoing progress and confirm the overarching strategy was working. The Rank Tracker’s data provided transparent metrics that made it easy to monitor the trajectory of the client’s site in real time. This, in turn, made it easy for BSM to tweak their tactics as needed, so they could achieve better results, faster. BSM also ran an analysis to determine potential keywords that weren’t yet being targeted. They then incorporated them into the frequently asked questions page. The Results BSM’s efforts paid off, and less than four months into the project, Star Beer USA was ranking in the number one spot for the following terms: Star Beer Star Beer USA Star Lager Cold filter lager In other words, the client didn’t just surpass a few competitors; they overtook all of them. Thanks to a laser-focused SEO strategy and the ingenious tools from SE Ranking, the client’s organic search traffic on Google is steadily increasing. What’s more, the website continues to rank for additional keywords in the SERPs and Google organic search traffic keeps on increasing: Wrapping Up When BSM started reviewing data for the Star Beer USA website in November of 2020, the site was ranking 101st for the term “Star Beer.” Today, the website ranks in the top position for this and many of its most important search terms. Because of the SEO strategy that BSM deployed and the help of SE Ranking, the client’s impressions, clicks, and click-through rates dramatically increased during the process. Better yet, more beer lovers can now discover this tasty Nigerian lager on Google with ease. Try SE Ranking — 14 days for free 868 views Written by Stasia Avetysian Stasia is the brand communications manager at SE Ranking. Before assuming this role, she was actually a part of our content team for several years and still continues to write for our blog every now and then. Given the experience under her belt, you are welcome to ask her anything you want about our platform, content marketing, communications, and even philosophy. That’s right, Stasia has a PhD in Philosophy and can professionally explain complex things in simple words.",
  "headers": [
    {
      "level": "H1",
      "text": "How a Nigerian Lager Beer Secured the #1 Spot on Google in the US"
    },
    {
      "level": "H2",
      "text": "The Agency"
    },
    {
      "level": "H2",
      "text": "The Client"
    },
    {
      "level": "H2",
      "text": "The Goals"
    },
    {
      "level": "H2",
      "text": "Steps to Reach the Goals"
    },
    {
      "level": "H3",
      "text": "1. Edit the Wikipedia Page"
    },
    {
      "level": "H3",
      "text": "2. Create Content"
    },
    {
      "level": "H3",
      "text": "3. Deploy Digital PR Strategy"
    },
    {
      "level": "H3",
      "text": "4. Harness the Power of Social Media"
    },
    {
      "level": "H3",
      "text": "5. Stay One Step Ahead of the Algorithms"
    },
    {
      "level": "H2",
      "text": "What Were BSM’s Most Valuable Tools?"
    },
    {
      "level": "H3",
      "text": "Finding content optimization opportunities with the Competitive and Keyword Research tools"
    },
    {
      "level": "H3",
      "text": "Client website real-time and historical search performance analysis"
    },
    {
      "level": "H2",
      "text": "The Results"
    },
    {
      "level": "H2",
      "text": "Wrapping Up"
    }
  ],
  "author": "Stasia Avetysian"
}