{
  "url": "https://seranking.com/blog/content-audit/",
  "slug": "content-audit",
  "title": "How to Perform a Content Audit in 2024",
  "description": "A content audit is an analysis of the quality and effectiveness of the content you've created to assess how well you’re currently meeting your audience's needs.",
  "content": "Blog / Keywords & Content / How to Perform a Content AuditHow to Perform a Content Audit Written by Yulia Deda Reviewed by Anastasia Kotsiubynska Nov 14, 2023 23 min read Creating new content pieces is all great, but when was the last time you reviewed existing content across your website? The thing is, in its “ongoing effort to reduce low-quality content,” Google constantly releases content updates, with the September 2023 Helpful Content Update being the last one. It specifically targets search engine-first content, as well as third-party content on websites’ primary domains and subdomains. To adapt to these changes and ensure your content meets Google’s general expectations in terms of its quality and relevance, you’ll need to regularly perform comprehensive content audits. In this article, we’ll cover: What a content audit is. What benefits a typical content audit can bring to your website and business as a whole. Which tools are the most effective for content audits. What steps you should follow during the content audit process. Let’s get started! Key takeaways A content audit is the process of assessing the quality and performance of your content. Depending on your goals, you can analyze a specific type of content (e.g., blog posts, landing pages, case studies, etc) or content across the whole website. Here’s a list of steps you’ll need to take when performing a website content audit: Set clear goals along with the right metrics Take inventory of your content Back up your audit with a mix of different data Interpret your content audit data Assess your content assets Create an action plan Adjust your content marketing strategy When done properly, content audit can help you get data-driven information on the performance of your content, find content pieces that require repurposing or an update, and get to know your audience’s preferences. In the long-term perspective, website content audit can assist you in improving SEO results (positions, traffic), increasing audience engagement, and enhancing conversion rates. What is a content audit? A content audit can be defined as an analysis of the quality and effectiveness of the content you’ve created to assess how well you’re currently meeting your audience’s needs. By taking inventory of the whole blog, distinct categories within your blog, or of all your digital content, you can significantly improve your content marketing strategy and boost your entire business’s growth potential. After completing the evaluation, you’ll be able to decide which types of content on your site require optimization, updating, repurposing, or maybe even deleting. From the long-term perspective, doing this will help you close gaps to create high-quality end-to-end customer experiences. Content audit plays a crucial role in content SEO. Enroll in our comprehensive Content SEO course to not only master content auditing, but also to explore other essential components of an effective content SEO strategy. Benefits of content audits Content audit has the potential to boost your website’s success. By using it, you’ll learn what’s working well for your business and where you’re falling short. In particular, website content audit can help you: Get data-driven information on the performance of your content. For example, by conducting a comprehensive content audit, you can pinpoint top-performing articles by their social engagement, organic search, and lead generation. Find content pieces that require repurposing or an update. For instance, if some of your blog posts have worse performance than expected, they can be repurposed to accomplish other objectives. Alternatively, articles written three to four years ago could be filled with more relevant and up-to-date information. Get to know your audience’s preferences. By providing people with the content they want, you can drastically increase organic traffic and build trust with your target audience. How to perform a content audit Now that we fully understand what is content audit and how you can benefit from it, let’s move on to the most interesting part—steps for performing an effective content audit. Set clear goals along with the right metrics Before diving straight into the content audit process, get clear on the goals you want to achieve through this process and match them with specific metrics. Depending on the type of business you run, these goals might range from getting rid of ROT (redundant, outdated, or trivial content) to improving the site’s all-round SEO effectiveness. Still, the most common content audit-related goals most marketers set are as follows: Improving SEO results (positions, traffic) If you want to conduct a content audit for SEO purposes, there are several major things to consider. First, focus on pages with low organic traffic but high traffic potential. Optimizing the content on these pages enables you to reach a wider target audience with less effort. After finding out which pages need improvement, proceed to analyzing their elements. Keep track of your headings, title tags, alt text, and various other elements. Optimizing these components is a surefire way to improve user experience and rank higher on SERPs. Issues associated with these elements can be found in SE Ranking’s Website Audit software. To find them, go to the Issue Report section that provides information on the website about key SEO parameters which are broken down into 16 categories. RUN A WEBSITE AUDITScore your website in 2 minutes. Enter any website URL to get a detailed report on tech issues and suggested solutions.Analyze Don’t underestimate the effect internal linking will have on your content audit. Internal links play an essential role in building your page’s authority, encouraging people to stay longer on your site, and creating an organized site architecture. You can find all of your site’s internal linking issues by using the Issue Report. Increasing audience engagement If you want to boost your site’s audience engagement, you’ll need to: Identify the best-performing types of content on your website. Figure out topics your visitors are interested in. Determine what kind of content generates the most engagement. Using Google Analytics for SEO can help you track user engagement. To access it, go to the Reports tab and then click Engagement > Overview. Enhancing the conversion rate To boost conversion rates, focus on two main directions: Identify pages that already generate the most sales and leads. Find high-traffic pages that are not converting visitors into customers. When evaluating the content your buyer consumes, try to find and fill in the gaps that currently exist along different stages of their purchasing path. Improving these areas will contribute to an increase in conversion rates. Take inventory of your content Once you’ve identified your goals for content audit, it’s time to take inventory of your content. To perform an audit of the textual content published on your website, you need to gather in one place all of your URLs together with any other additional information. You can easily do this with the help of SE Ranking’s Website Audit Tool. It scans a website, creates a list of all website pages, and checks the entire site for issues using 120+ common parameters, including parameters related to content. Under the Crawled Pages section, you’ll see all of your URLs that were found during the audit. Each webpage, in turn, has a list of its associated metrics that vary from status code to word count. By clicking the Columns tab, you can find all metrics that can be outlined for a specific URL. If you mark the necessary metrics for your content audit, they will appear in the table below in real time. For example, the most common parameters evaluated in content audits include: URL Status code Meta robots tags Title Title length Description Description length Date Word count Links After marking your metrics of interest, hit the Export button and choose the format you want to download the data in. Next, open Google Sheets and insert the downloaded file by following these steps: Open your spreadsheet in Google Sheets. Go to the File menu. Go to Import and then upload the report from your device. Click the Import Data button. Note from the author: you can also use Excel to collect all web pages with their associated metrics, but I prefer Google Sheets. As a result, you will get a table similar to the one below: To make the table as convenient as possible, make sure to group key parameters. For example, you can divide all metrics into three main blocks: Basic Info Meta Data Links Back up your audit with a mix of different data As you’ve probably guessed, the metrics demonstrated in the table above can’t cover the entire audit process. So, what data should you also include in this audit? And most importantly, which tool can help you in this case? Let’s take a closer look. In addition to SE Ranking’s Website Audit tool, you can take advantage of other tools offered by our platform. For instance, the Competitor Analysis Tool helps you identify the keywords and pages that drive the most traffic to your website. You can also analyze your competitors to find their top traffic pages and keywords they’re ranking for that you’re missing. By improving the content quality of pages that have good SEO potential, you can dramatically increase your chances of getting to the top of SERPs. Meanwhile, you can utilize insights gained from observing your competitors’ content to polish your own content plan. DO COMPETITIVE RESEARCHWho are your closest rivals and how do they position themselves in search? It's time to find out.Analyze After collecting your keywords, add them to Rank Tracker to monitor their performance. You can find the consolidated dashboard for your key metrics under the Detailed tab in the Rankings module. To discern which pages have the highest SEO potential, scroll down to the keywords overview table, go to the Columns tab, and mark the Traffic Forecast block. To sort your keywords (starting from the ones with the highest traffic potential), click on the Traffic Forecast section in the table. Also, pay attention to web pages whose SERP positions have recently decreased. You can find these pages by following these steps: Click the Columns tab and mark the Dynamics block. Go to the Filters section and select the Dropped option. When analyzing Google rankings, make sure the date range covers at least several months. This will ensure that lifts or drops in traffic remain a constant trend–and aren’t just resulting from a holiday or some seasonality. 3. Hit the Apply Filters button. Next, to conduct a comprehensive SEO content audit, analyze data related to other performance metrics. To do this, consider another tried-and-true analytics tool used by most marketers—Google Search Console. If you’ve already set up Google Search Console, you can immediately access this data. If you haven’t used this tool yet, here’s our separate guide on how to create a Google Search Console account. In the Performance tab of Google Search Console, you can find three main metrics that can be checked: clicks, impressions, and CTR. Download this report in the most suitable format for you (e.g., CSV) and insert it into your Google Sheets table. As a result, you might get a table like this: To gain more comprehensive content insights on a specific URL, go to the On-Page SEO Tool. This tool checks key page components that you might not notice during manual checks, so use it in your SEO content audit. RUN AN ON-PAGE SEO CHECKGet SERP-backed tips to outrank competitorsTRY NOW After filling out all the fields with the required information, you’ll be able to access a complete on-page analysis of any URL you specify. It will evaluate the page based on 94 parameters: the tool will check keyword density, content uniqueness, the word count in comparison to top-performing rivals, as well as use of headings on the page, and so on. All you need to do to get this info is scroll down on the main page and go to the Text Content feature. To compare your content elements with your competitors’ content elements, head to the Competitive Comparison section. The Terms tab displays the entire list of words that were found on a given page during the audit process. Here, you can also choose the display mode of the words: common words used by you and your competitors that can be inserted into one list or more. The On-Page Metrics section lets you see the table featuring SEO-related parameters of added rivals, like text/HTML ratio, description/title tag length, domain/page trust, number of referring domains linking to the page, and so on. The Content tab provides information regarding content-related metrics like title, description, H1/H2/H3. In addition to SEO content metrics, you should consider engagement indicators (e.g., clicks, average time on page, unique visitors, and the number of pages per session). You can access this data from your Google Analytics account. To do this, go to Google Analytics 4 (GA4) and click Reports > Engagement > Pages and Screens in the left navigation menu. Here, you can find an overview of the most viewed content or pages (which is very important for your SEO content audit). As you can see on the screenshot above, GA4 uses a combination of metrics to track engagement on your website, such as users, views, new users, average engagement time, event count, unique user scrolls, conversion, and total revenue. Download this report in CSV format by clicking on the top right of the report. Then, insert this file into your Google Sheets dashboard. The final version of the dashboard might look like this, but it can differ slightly depending on your goals and selected metrics. Interpret your content audit data Once you’ve gathered all the necessary data from the table, it’s time to officially perform the content audit. When doing this, try to evaluate all metrics together instead of taking a look at each indicator separately. This gives you a bigger-picture perspective of the state of your website’s content. When analyzing your content data, here are some questions you can ask yourself: Are you satisfied with your content marketing performance? Which pieces of content perform worse than expected? Why does a specific webpage have poor performance? Are there any metrics providing answers to this question? (For example, do your keywords receive enough impressions?) Is there any spammy or unhelpful content on your website that could negatively impact SERP rankings and your users’ experience? Does your content rank among the top 3, top 10, or top 30? What is the average word count of your site’s high-ranking content pieces? Do pages with videos or images have a slow page load time? Depending on your content audit goals (e.g., improve SEO performance or audience engagement), the list of questions may differ from case to case. Try to focus on things that matter the most to you and your business. Assess your content assets After critically analyzing data from your content audit dashboards, decide on statuses you want to assign to each webpage. You’ll have to either keep, update or delete pieces of content from your website. Keep To keep the content as it is, it should perform well in search and meet the expectations of your target audience. If you want to make it clear which content can be left without any improvements, you can establish evaluation criteria relevant to your goals. In our case, a page can be assigned with the “keep” status if it ranks among the top 20 and had more than 2000 total views last year. You can color this group of pages in green in your Google Sheets dashboard to organize it in a more visually pleasing way. Update When conducting a content audit for your website, you’ll definitely find pages with content that don’t perform very well but can still be improved. For example: Pages with high positions but low click-through rates may have low-quality meta tags. Work on your titles and descriptions to promote the value of your site to both search engines and your visitors. If your pages have high traffic but not many conversions, they might be unappealing to Internet users. The content you offer doesn’t adequately provide the solution to their problem. Also, low conversion rates indicate problems related to your content’s relevance to titles, CTAs, or loading page time. Pages with low or high impression counts but low clicks may require more optimization (insert more relevant keywords or fix website loading issues). Pages with low average dwell time. Pages that were last updated more than a year ago. Perform the most important updates first and then prioritize the remaining ones based on their overall impact on your online performance. Once you update a webpage, mark it green in your dashboard. Mark the rest of your links requiring updates in yellow. Delete Improving content can take a lot of time and resources. In some cases, it doesn’t even make sense to try (e.g., if the content is related to old promo campaigns or services that a company doesn’t offer anymore). Consider deleting content from: Pages that had no sessions for the last 12 months. Pages that don’t target keywords or provide little value to your audience. Duplicate pages or pages created for the same keyword/user intent. Remove all the internal links to pages you plan to delete and set 301 redirects for deleted pages that have backlinks. Color this group of pages in red to prioritize these tasks later on. Create an action plan So, you’ve analyzed your content and assigned it to different groups, but what should you do next? First, you need to delete content marked red in your Google Sheets table. Then, evaluate content from the “update” group and set up an action plan for each link requiring updates. Some updates might be simple and easy to do, yet bring a lot of positive results (e.g., inserting a keyword driving targeted traffic to your site). On the other hand, recording an educational video could take lots of time and resources and still yield poor results. Make sure to prioritize the tasks that have the greatest potential for ROI. This maximizes your content audit impact on your website and shaves off loads of wasted time. Reuse your content. Reusing your existing content is a great way to reach new audiences and improve organic visibility. It can also save you lots of time and effort. For instance, use blog content for educational purposes, turn your articles into podcasts, or use testimonials for social media content. Rewrite your content. There’s no shame in rewriting already published content. Over time, you gain new skills, refine your knowledge in certain areas, and your business processes improve, so why not make use of everything you know on how to write a more compelling piece of content? Include updated data, tips, and media content from existing guides or articles to increase user engagement. Expand your content. Even though there are still many debates over the perfect word count for blog posts, most experts agree that it should be 1,000+ words. It’s rarely a bad idea to expand your content with new and relevant information. Refresh your content. If the article is SEO-optimized and provides valuable information to users, there’s no need to rewrite it from scratch. Instead, add some new pieces of content, such as quotes from experts or statistical data, to update the information and make it more credible. This is especially needed for pieces like “top [products] for [year]” Structure your content. By structuring your content properly, search engine bots and people will have an easier time reading and understanding it. Just follow simple practices like: writing short paragraphs that convey a single idea, using H2/H3 HTML heading tags consistently, inserting media content when needed, and supplementing text content with tables, infographics, etc. Update your CTAs. Sometimes, even the most persuasive longreads can’t convert existing leads into customers as effectively as a well-placed CTA. Updating your outdated content on CTA banners and testing new ones helps you increase conversion rates. Add media content elements, such as videos and images. Did you know that online videos reached a collective audience of almost 92% among internet users in 2021? And this number is expected to grow even more. You can make your content way more engaging and increase its organic traffic by including videos and images in it. Optimize metadata and internal linking. Optimizing basic SEO elements like the title tag and meta description is harder than you might expect. You need to balance between communicating the value and uniqueness of your product/service (in a highly competitive landscape, mind you) and appropriately using your focus keyword and observing character limits. Also, you can reduce your website’s bounce rate by interlinking content. Internal links make it easier for Google to crawl your site. To optimize internal linking: insert links at the beginning of texts, make sure your new pages get links, use anchor texts that don’t make your links look spammy, and insert no more than two to four internal links per blog post (of average length). Use 301 redirects. By applying this technique to removed pages, you can send visitors to the new-and-improved page on your website, thereby avoiding “not found” pages. You will also lose less (or no) link juice if your deleted pages have backlinks. Use this tip to your advantage if you want to considerably improve your website’s health, user experience, and SEO. Inform Google. After updating or deleting content from your website, it might take a while before Google notices these changes. For example, after you delete an old page on your website, there might still be a URL to this page in the SERP for some period of time. To minimize the amount of time needed to implement these changes, inform Google through Google Search Console that this page no longer exists. With the help of its URL Inspection tool, you can submit recently updated web pages to Google’s index. Adjust your content marketing strategy With a comprehensive content marketing strategy, you can improve your SEO results, generate new leads, and increase conversion rates. To achieve these goals, track your short-term successes and failures in the context of content performance. As you go through the different steps of the content audit, begin by paying attention to top-performing content. Investigate it further to see why it’s thriving. Then, include identified techniques in your overall content marketing strategy. For example, if you notice that how-to guides with a word count of 3,000 to 5,000 words perform best on your website, this is a good sign that you should continue doing this. Make articles of this length and this type an integral part of your future content marketing strategy. On the other hand, take a closer look at your underperforming content and compare it with similar successful content published by your competitors. You’ll stumble upon insights for developing content strategies that bring positive results. For instance, analyzing competitive content can help you answer these questions: What content formats do your rivals use? How often do they publish content? Which content channels do they use? Which CTAs do they use? After you implement changes, measure the results over time to discover what caused the increase (in traffic, conversion rate, etc.) and whether there’s a pattern you should lock in on that your website will continue to benefit from. As you analyze different types of content, combine what you find into a single document that can be used later to further improve your content strategy. Most companies review their content activities at least one to two times per year, but you can do it as often as you deem necessary for your business. Follow these practices to keep up with industry trends which will ultimately create value for your brand’s audience. A content audit checklist for in-depth website content analysis Finally, here’s a step-by-step content audit checklist that you can use to explore the ins and outs of your content: Define your content audit goals and align them with metrics that measure the success of actions you performed. For example, to increase audience engagement, work on metrics: such as average CTR, the average number of pages per session, and average session duration. To improve conversion rates, pay attention to total revenue and leads generated. Consolidate all URLs into a single spreadsheet and categorize the content by title, date, word count, content type, links, or any other make-or-break factors contributing to your business’s success. Use analytics tools to fill out the table with necessary values. By critically analyzing set metrics, divide all URLs into three groups: keep, update, or delete. Create an action plan for each piece of content based on the goals you set during the first step of the content audit process. Adjust your content marketing strategy based on your audit findings at least once or twice a year. To wrap up When done properly, content audit can boost your SEO performance and strengthen your business strategy as a whole. By identifying areas of improvement in terms of content, you’ll be able to: Improve your site’s SEO performance, including Google rankings. Boost your audience engagement and user experience rates. Increase conversions. Have you ever conducted a content audit for your website? Were you satisfied with the results? Did it help you to gain valuable insights and improve your overall content marketing strategy? Share with us your thoughts on the content audit process in the comments section below. Together, we’ll discuss its nuts and bolts in greater detail. Content Marketing On-Page SEO 2356 views Written by Yulia Deda Yulia Deda is a content marketer at SE Ranking. She is passionate about all things SEO, with a particular focus on analytics & reporting, technical SEO, and keyword research. In her spare moments, Yulia enjoys watching documentaries or immersing herself in a captivating book.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Perform a Content Audit"
    },
    {
      "level": "H2",
      "text": "Key takeaways"
    },
    {
      "level": "H2",
      "text": "What is a content audit?"
    },
    {
      "level": "H2",
      "text": "Benefits of content audits"
    },
    {
      "level": "H2",
      "text": "How to perform a content audit"
    },
    {
      "level": "H3",
      "text": "Set clear goals along with the right metrics"
    },
    {
      "level": "H4",
      "text": "Improving SEO results (positions, traffic)"
    },
    {
      "level": "H4",
      "text": "Increasing audience engagement"
    },
    {
      "level": "H4",
      "text": "Enhancing the conversion rate"
    },
    {
      "level": "H3",
      "text": "Take inventory of your content"
    },
    {
      "level": "H3",
      "text": "Back up your audit with a mix of different data"
    },
    {
      "level": "H3",
      "text": "Interpret your content audit data"
    },
    {
      "level": "H3",
      "text": "Assess your content assets"
    },
    {
      "level": "H4",
      "text": "Keep"
    },
    {
      "level": "H4",
      "text": "Update"
    },
    {
      "level": "H4",
      "text": "Delete"
    },
    {
      "level": "H3",
      "text": "Create an action plan"
    },
    {
      "level": "H3",
      "text": "Adjust your content marketing strategy"
    },
    {
      "level": "H2",
      "text": "A content audit checklist for in-depth website content analysis"
    },
    {
      "level": "H2",
      "text": "To wrap up"
    },
    {
      "level": "H2",
      "text": "You might be interested"
    }
  ],
  "author": "Yulia Deda"
}