{
  "url": "https://seranking.com/blog/content-tool-updates/",
  "slug": "content-tool-updates",
  "title": "SE Ranking’s Content Editor Revamped",
  "description": "Generate top-notch articles with the AI Writer, build comprehensive SEO briefs and optimize texts using our brand-new Content Score.",
  "content": "Blog / SE Ranking News / Content Editor 2.0: Generate Articles With AI Writer and Optimize Them With Greater EfficiencyContent Editor 2.0: Generate Articles With AI Writer and Optimize Them With Greater Efficiency Written by Daria Chetvertak Mar 13, 2023 6 min read Our updated Content Editor is finally here, and it is better than ever. We have listened to all of your feedback and have spent countless hours refining the tool to deliver an even more intuitive and efficient content creation experience. The revamped tool boasts several improvements, including the AI Writer feature, a new Content Score, enhanced brief settings, and many others. With these new updates, you can now save time and streamline your workflow while still producing high-quality content that effectively engages your audience. Let’s take a closer look at some of the new features and improvements that make this tool a game-changer. Powerful AI writing assistant SE Ranking’s brand-new AI Writer was designed to help copywriters and SEO specialists create quality content effortlessly. Our AI Writer is an artificial intelligence-powered algorithm that generates both short and long content pieces on any given topic while following SEO copywriting best practices. Our AI Writer is capable of: Generating topic ideas. Select a few keywords and let the AI writing assistant come up with great ideas for your next article. Formulating text structure. Generate headings and subheadings for your chosen topic using the required terms. Composing optimized text. Let AI Writer craft fresh and unique paragraphs for your future article. Writing with tone of voice in mind. Adapt your text to your target audience with 11 different writing styles. Depending on the style you choose, the AI Writer will use different wording to formulate the article’s names, headings and body text. Generating relevant and optimized topics, headings, and paragraphs for different sections of your future article takes only seconds with AI Writer. And if you’re not satisfied with the outcome, regenerating the text is just one click away. With AI Writer, you can significantly accelerate your content creation process by generating a rough draft of the text. You can then add your personal touch, expert tips, and opinions based on your own experience to polish the content. By using the right keywords and picking the proper tone of voice, you can also ensure that your content is tailored to your target audience. Upgraded brief settings and other useful features Let’s move on to another set of important features that can help you improve your content creation process. New Brief settings: metadata, links, questions, and keyword importance The latest version of the tools lets you set recommendations for the title, description and slug in the brief. It also provides a preview of your page’s SERP snippet, along with your competitors’ snippets. With the Content Editor feature, you can add internal and external links, as well as questions to the brief. This allows your copywriter to incorporate them into the content seamlessly. We have also introduced a new metric called Importance, which can help you choose the most relevant keywords for your article. This metric is determined by many factors, such as the locations of the keyword on the page and how well the page performs in search for that term. These new features enable you to create more comprehensive briefs, which in turn ensures that your content is written exactly as you envisioned it. Plagiarism Checker We understand the importance of having unique content in influencing how Google perceives your article. To help you achieve this, we have added the Plagiarism Checker feature to our Content Editor. You can now check your content for plagiarism without leaving the app. The Plagiarism Checker feature pits your content against a vast database of websites to ensure that the text is original and not simply a copy of someone else’s work. It provides a percentage of words matched, the uniqueness of the text, the number of pages where the match is found, and the number of unique matching phrases across all competitors. Other great features for streamlining your content creation process Sometimes you need to revert to one of your old text versions, which is why we’ve added the version history feature. Now, if you are the author of the content, you can view and restore the selected version. Our system will store up to ten versions of your text. Plus, to speed up the content creation process, you can now extract content from any website by entering its URL. New Content Score Another equally important update we’ve introduced is the brand-new Content Score feature. It has been developed to assist you in determining how well your content can perform and identifying areas for improvement. The Content Score is a measure of content quality and relevance, both of which can influence rankings in organic search results. The score is calculated based on many factors, such as character count, headings, paragraphs, and images. It also considers the use of keywords in the article overall and in the headings specifically. In the right-side panel, you can view your current Content Score, as well as the maximum and average Content Scores among top-ranking competitors. This will help you gauge your chances of competing with other websites for the top position in the SERP. We have not eliminated the previous score that indicates how well your content meets the requirements of the brief. We have simply renamed it as Brief Progress, which can now be found below the Content Score. Google Doc Add-on Last but not least, we are excited to announce a new add-on that seamlessly integrates our Content Editor with Google Docs. To start using SE Ranking’s add-on in Google Docs, export the article from Content Editor and install the extension. With the SE Ranking add-on, you can edit your article in Google Docs while accessing essential scores and metrics for analysis. The functionality of the Content Editor app is nearly identical to the platform. Here, you can: Check the H1-H6 structure of competitive pages and choose one for your article. Get a list of NLP-recommended terms to use in the article. View an overall quality and relevancy score based on word count, keywords, content structure, number of media elements, etc. Identify the number of punctuation mistakes, grammatical errors and stop words in the text. Check your article’s uniqueness to avoid publishing unoriginal material. And much more! We are constantly tweaking our tools to enhance user experience, so stay tuned for more updates! 😉You can even try our updated Content Editor right now, but please don’t forget to provide your feedback in the comment section below 👇 This helps us improve our platform for you. Content Marketing SE Ranking Tools 3995 views Written by Daria Chetvertak Daria is a content marketer at SE Ranking. Her interests span across SEO and digital marketing. She likes to describe complicated things in plain words. In her free time, Daria enjoys traveling around the world, studying the art of photography, and visiting art galleries.",
  "headers": [
    {
      "level": "H1",
      "text": "Content Editor 2.0: Generate Articles With AI Writer and Optimize Them With Greater Efficiency"
    },
    {
      "level": "H2",
      "text": "Powerful AI writing assistant"
    },
    {
      "level": "H2",
      "text": "Upgraded brief settings and other useful features"
    },
    {
      "level": "H3",
      "text": "New Brief settings: metadata, links, questions, and keyword importance"
    },
    {
      "level": "H3",
      "text": "Plagiarism Checker"
    },
    {
      "level": "H3",
      "text": "Other great features for streamlining your content creation process"
    },
    {
      "level": "H2",
      "text": "New Content Score"
    },
    {
      "level": "H2",
      "text": "Google Doc Add-on"
    },
    {
      "level": "H2",
      "text": "You might be interested"
    }
  ],
  "author": "Daria Chetvertak"
}