{
  "url": "https://seranking.com/blog/driva-case-study/",
  "slug": "driva-case-study",
  "title": "Case Study: A Car Loan Platform Gets 800% More SEO Traffic in 8 Months",
  "description": "An Australian FinTech startup Driva has proved that a successful SEO campaign can bring a massive increase in traffic within months.",
  "content": "Blog / Case Studies / How Fintech Company Driva Grew Their SEO Traffic by 800% Within 8 MonthsHow Fintech Company Driva Grew Their SEO Traffic by 800% Within 8 Months Written by Kseniia Kyslova Feb 07, 2022 9 min read The company Driva is an Australian FinTech start-up founded by William Brown and Scott Montarello. It’s an online platform, which allows customers to get pre-approval and personalized interest rates—based on their credit profile—from more than 30 different lenders. The goal In the short-term, increase website discoverability in organic search for the target non-branded and branded keywords In the long-term, make organic search the main customer acquisition channel, and reduce expenditures on paid advertising Steps to reach the goal Baseline study of the starting-point rankings for major cities and countrywide Competitive research to find optimization opportunities Optimizing Google Ads based on the insights from competitors’ ad campaigns Keyword research to support the topic clustering methodology Creating pillar pages and interlinking them with content clusters on the blog Building backlinks to increase the site’s domain authority and ranking potential Getting the job done From the very beginning, co-founders of Driva realized the huge potential of search engine optimization for customer acquisition. Still, knowing that it takes time for SEO to start bringing results, they first had to rely a lot on Facebook Ads and Google Ads. In October 2020, the team decided that it was time to level up their SEO. In search of a tool able to inform their future marketing strategy, they signed up for SE Ranking. In May 2021, the company launched an SEO campaign that has continued to bear fruit ever since. On their way to SEO success, the Driva team has relied heavily on SE Ranking’s tools. They’ve been using the Competitive Research, Keyword Research, Rank Tracker, and Backlink Checker tools almost daily. 1. Baseline rankings study The team started by adding their target keyword list to SE Ranking. They wanted to monitor rankings for every major city in Australia and for the country as a whole. The platform’s rank tracking module allowed the team to set up position tracking for several locations in one project. Being strategic about what pages should rank for every keyword, they found the Target URL feature of the Rankings module very useful. The feature allows mapping keywords to pages optimized for them. As a result, the team sees if the correct page is ranking for every particular keyword. One more feature of the Rankings module came in handy to Driva’s marketers. They wanted to measure the impact of Google algorithm updates on their website. To their delight, SE Ranking automatically adds notes on every Google’s update to their project. They can access the information about search engine updates from the Notes tab and from the charts showing the dynamics of key SEO metrics in the Detailed and Historical data sections of the Rankings module. A list of project-related and keyword-related notes on the Notes tab in SE Ranking Willing to track impact from other events, such as major sitewide changes, the team wanted to use the Notes feature to the max. Now, they strive to note every major project-related and keyword-related improvement to view its influence on rankings. “SE Ranking lets us see how our new pages are progressing and which ones to focus on with our SEO efforts to bump them up in search results.” 2. Competitive research Driva is penetrating quite a competitive market. They have to be watchful of rivals. The team relies a lot on SE Ranking’s Competitive Research tool in identifying solid SEO players in their niche. They benchmark their rivals against themselves by a range of metrics, which helps them grasp how much emphasis their competitors put toward SEO. When analyzing competitors, they look closely at the metrics on the Overview tab: domain trust, page trust, traffic from organic search, and the number of keywords a site is ranking for. The team pays attention to the metrics dynamics to see if it is trending upward. DO COMPETITIVE RESEARCHWho are your closest rivals and how do they position themselves in search? It's time to find out.Analyze Driva’s marketing team uses the tool almost daily to analyze their competitors’ keywords and find new optimization opportunities for themselves. To take a closer look at someone else’s keyword list, they move from the Overview section to Organic traffic research. Under Organic traffic research, they look through the list of keywords filtered by position and search by volume. This way, the team quickly sees the top-performing keywords of their competitors. The Keywords table gives them insight into how much traffic these keywords bring and to what pages. “We gauge a competitor’s website presence in organic search as a whole to see if they are a strong player. If so, we inspect what strategies they’re using to achieve this.” 3. Google Ads optimization While their SEO strategy gains momentum, Driva continues to run Google Ads campaigns. To improve ad efficiency, they use the Paid traffic research module of SE Ranking’s Competitive Research tool. This module lists the keywords used by competitors. For every keyword, there is information about paid traffic volume and share, number of ads, competition, cost per click, and even creatives used in the ads.To extract insights from data, the team filters the Keywords table by traffic share; that’s how they find missing high-performing paid keywords relevant to their business. They also sort paid keywords by search volume to see if there are any high search volume keywords that their competitors target. This way, they find promising keywords that aren’t suggested in Keyword Planner in Driva’s Google Ads account.Lastly, they check their top-performing keywords in Google Ads against similar ones of their competitors. They filter keywords by average position and then compare ad texts they and their competitors use, denoting topics and angles they could adopt for their own creatives. “This tool is excellent in giving us insights into our competitors’ ads strategies. We can analyze the keywords they are bidding on to drive the most traffic, then look at the text of these top search ads to run better campaigns ourselves.” 4. Keyword research To build credibility in the sphere of car financing in the eyes of Google and users, Driva opted for the topic cluster’s method of creating content. The company wanted to capture organic traffic for long-tail, low-search volume keywords through cluster pages and for competitive high-search volume keywords through pillar pages. To inform this strategy, they had to double down on keyword research. To collect keywords, Driva’s team used SE Ranking’s Keyword Research tool. The data on search volumes and ranking difficulty informed their choice. They looked for a balance between these two metrics to pick the keywords for which they have high potential to rank. “SE Ranking’s Keyword Research tool is vital for us. Before we build out any new content clusters on our blog or look at introducing a new pillar page, we address this tool.” DO KEYWORD RESEARCHEnter a search term and find untapped keyword opportunities to make your site more visible in search.Analyze 5. On-page optimization Rolling out a series of new in-depth and informative blog posts was the main part of Driva’s SEO strategy. Having defined the keyword clusters, they trickled out content over several months. It didn’t take long before they saw the first results. For example, in June 2021, we re-optimized our ‘Quick Guide on the Most Tax Effective Way to Buy a Car’ blog. We wanted this page to target the long-tail keyword ‘most tax effective way to buy a car.’ Its search volume makes 110 searches per month. SE Ranking gave this keyword 7 points for difficulty, and it, indeed, turned out to be easy to get to the first position. In the past six months, this blog post received 420 clicks on the Google SERP and had 7.5K impressions. During the six months before the optimization, it managed to get only 12 clicks and had 391 impressions. The on-page optimization truly made a difference. 6. Backlink research To support the new SEO campaign, the team wanted to get organic backlinks to their pillar pages and boost their page authority. They decided to research competitors’ backlink profiles to spot opportunities for link-building. SE Ranking’s Backlink Checker tool helped the team out with this task. CHECK ANY SITE'S BACKLINKSCheck which domains link out to any website and get ideas for enhancing your backlink profile.Analyze SE Ranking’s Backlink Monitor is another tool Driva uses to control its link-building activities. It helps them stay on top of the changes in their own backlink profile. They analyze their link anchor texts, watch for referring domains, and control the dofollow to nofollow link ratio. “Our website’s domain trust, an aggregate domain quality score calculated in SE Ranking, has grown from 25 to 59 after the SEO strategy was implemented.” Automated reporting keeps stakeholders in the loop! “An overview SEO report of our rankings across each city is automated weekly to fire off to management, which has saved us loads of time from ‘before SE Ranking.’ Previously, we had to manually compile data in a spreadsheet to share it.” The results Over 8 months, from May to December 2021, the number of keywords the Driva’s website ranks for in Top-100 on Google increased from 159 to 2,793. The company got a 2000% increase in impressions in non-branded organic search results. The improved visibility brought an 800% increase in clicks for these keywords. Overall organic traffic (branded included) grew from 3.72K to 10.4K, with an increase in the number of impressions from 83.6K to 1.11M. Takeaways The example of the Driva startup proves that a website can make it to the top of search results within months. All that is needed is a smart strategy and a reliable SEO tool to support it. Driva’s team opted for the topic cluster methodology and SE Ranking, which proved to be an ideal combo for them. Why don’t you follow in their steps? Сhances are, it will work for you, too. Try SE Ranking — 14 days for free 2172 views Written by Kseniia Kyslova Kseniia is a content marketer at SE Ranking. She's curious about all things SEO and content production. When she's not writing, you're likely to see her training, running, climbing, or cycling. Yet, the ever-evolving world of digital marketing occupies her mind and deters her from being a total fitness junkie.",
  "headers": [
    {
      "level": "H1",
      "text": "How Fintech Company Driva Grew Their SEO Traffic by 800% Within 8 Months"
    },
    {
      "level": "H2",
      "text": "The company"
    },
    {
      "level": "H2",
      "text": "The goal"
    },
    {
      "level": "H2",
      "text": "Steps to reach the goal"
    },
    {
      "level": "H2",
      "text": "Getting the job done"
    },
    {
      "level": "H3",
      "text": "1. Baseline rankings study"
    },
    {
      "level": "H3",
      "text": "2. Competitive research"
    },
    {
      "level": "H3",
      "text": "3. Google Ads optimization"
    },
    {
      "level": "H3",
      "text": "4. Keyword research"
    },
    {
      "level": "H3",
      "text": "5. On-page optimization"
    },
    {
      "level": "H3",
      "text": "6. Backlink research"
    },
    {
      "level": "H2",
      "text": "The results"
    },
    {
      "level": "H2",
      "text": "Takeaways"
    }
  ],
  "author": "Kseniia Kyslova"
}