{
  "url": "https://seranking.com/blog/ecommerce-seo-audit/",
  "slug": "ecommerce-seo-audit",
  "title": "Ecommerce SEO Audit: Step-by-Step Guide for Online Stores",
  "description": "Auditing your ecommerce SEO is a must as it impacts profitability. Learn what and how to check to improve your site performance and ranking.",
  "content": "Blog / Niche SEO / How to perform an SEO audit for an ecommerce websiteHow to perform an SEO audit for an ecommerce website Written by Yevheniia Khromova Reviewed by Olena Karpova Sep 29, 2023 30 min read Organic search is the dominant source of web traffic. It’s also responsible for a large share of revenue for ecommerce businesses. But to reap this harvest, your website first has to break through to the top in the SERPs. The higher your position, the greater the chance this traffic will go to your site instead of to your competitors. This will ultimately increase your conversions. In fact, ranking in the first position on Google SERP brings approximately 31.7% of the organic traffic. But if your website is second or third, you can expect to get only 24.71% to 18.59% of all clicks. The rest will go to your rivals. Optimize your site both for search bots and visitors to reach the top. Conducting an ecommerce SEO audit is the first step toward this goal. Use it to identify your site’s weaknesses and get insights on the improvements needed. By the way, you can check any website’s SEO and see how well-optimized it is for both search engines and people using our Website SEO Analysis tool. What is an ecommerce SEO audit? An ecommerce SEO audit is like a thorough checkup for your online store. It assesses your site’s visibility and performance in search, specifically for metrics, like crawlability and indexability, page loading speed, mobile-friendliness, backlink profile, UX, content, etc. The goal is to detect issues that may be hindering your website’s SERP performance and to identify areas for improvement. Doing regular ecommerce SEO audits benefits shopping websites in three major ways: Identify errors and fix your site based on the SEO audit results. This can increase its rankings, traffic, and conversions. Ensures that your site stays competitive. Ecommerce SEO audits can help you adapt to changing algorithms and user behaviors. Provides measurable data on your website’s performance. Audits help you track the ROI of your SEO efforts and ensure your strategies align with your business goals. What are the steps of an ecommerce SEO audit process? Conducting an ecommerce SEO audit requires a systematic approach. This means you must develop a plan that includes different checks to thoroughly assess various website elements impacting its technical health, on-page and off-page optimization, UX, local SEO (if applicable), etc. Treat it like a project that needs proper planning: Set your goals: Outline what you want to achieve with the SEO audit. Identify issues: Look for sections and elements of the website that must be evaluated. Assign responsibilities: Have team members handle different aspects of the audit. Conduct predefined checks: Carry out planned checks based on your goals. Document the findings: Keep a record of what you find and highlight areas for improvement. Prioritize and act: Develop a list of priorities and make necessary changes. And, of course, after making corrections, monitor your website’s performance to evaluate each change’s impact. Your specific plan will depend on your goals and objectives, but the steps provided above can be a good starting point. We’ve also compiled an ecommerce SEO audit checklist for you: Technical SEO checks: Ensure that search engines can effectively crawl and index your site and that your ecommerce website doesn’t have technical issues. On-page checks: Evaluate keyword optimization, and detect keyword cannibalization and duplicate content. Off-page checks: Ensure your backlink profile is strong and healthy, and check backlinks, referring domains, and anchor texts. Local SEO checks: Ensure your business is correctly listed and optimized on GBP, and on different directories. UX checks: Evaluate how intuitive, fast, and responsive your website is. Trustworthiness checks: Check search results for your brand name and monitor brand mentions to gauge customer perception. In the next section, we will take you through each step of the ecommerce SEO audit in more detail. Complete guide to ecommerce website SEO audit Technical SEO audit The technical SEO audit checks the site’s technical health parameters, including page response codes, canonical tags, redirects, the correctness of the robots.txt and sitemap.xml files, etc. It also helps align the site’s technical components with the search engines’ requirements. Without adjustments at this level, further optimization for search engines may be less effective. That’s why a technical SEO audit is usually the first step in a complex SEO audit. There are different approaches to performing technical analysis, but I recommend the following sequence–ranked by importance. Crawling check Translated from search bots’ language, crawling means scanning. The search bots navigate through a website’s pages to see if they are still accessible. They discover and collect new and updated pages for further indexing by crawling. If the search bots can’t scan your site correctly, your site will have indexing problems. The pages of your online store won’t rank, and your client won’t find your site, let alone buy from you. Indexing check The next step that every page goes through after scanning is search engine indexing. The bot puts each page in the so-called big registry. Every time the user enters their request, the bot selects relevant pages from the list and displays them in the search results. If your site’s pages have problems with indexing or haven’t been indexed at all, they won’t appear for the user’s relevant search query. Response codes check Every time a user or bot sends a request to the site, the server answers in the form of a three-digit response code. It signals whether the request was completed or an error occurred. In a perfect world, each request would end with a 200 response code, indicating that the page is present and visible. Responses with code 4xx mean that the page is broken, 5xx code shows server problems, and 3xx code marks redirects. Search engines will consider the site inconvenient if the user lands on broken pages or the page takes too long to load because of a long chain of redirects. This directly affects rankings because engines only want the fastest loading and highest quality sites to appear at the top of the search results. In addition, search bots can’t access the page if it is broken. This means they can’t index it either. Site’s structure check The logical structure of a website has several benefits: It helps your customers find the products they need faster. It makes it easier for bots to crawl the site. It gives your site a chance to appear in the SERP as sitelinks. When your site appears in the SERP as a sitelink, it showcases your product categories, attracting potential buyers and positively impacting conversions. Ideally, an ecommerce site should have a hierarchical structure. The home page should sit at the top, followed by categories, subcategories, and product pages. The click depth should not exceed four levels. If some of your products are deeper, it might make sense to analyze product types and, for example, put them in a separate subcategory or category. Pages should be interconnected through internal linking. Orphan pages (the ones that aren’t linked from any page on your website) can be difficult for bots to find. In addition, given the PageRank algorithm, internal linking shows the linked page’s importance. URL check URLs aren’t the strongest ranking signal, but they can still help you gain an edge over your competitors. This means you should ensure that your URLs are SEO-friendly and regularly check them for compliance with the main parameters. Your URLs SHOULD NOT: Be too long (the golden mean is to make URLs shorter than 75 characters). Contain symbols requiring encoding (spaces, “, <, >, #, %, |). Contain both upper and lower case characters (URLs are case-sensitive, so use lower case instead and make them consistent). Your URLs SHOULD: Contain keywords (1-2 keywords can convey the necessary information). Have hyphens to separate words (they are treated better than underscores because search engines perceive them as spaces). Be readable and easy to understand. Include a logical folder structure (if your site’s structure looks like this–homepage/category/subcategory/product, the URL structure should be the same). Have HTTPS (it’s more secure) instead of HTTP. Consider static and dynamic URLs. Static URLs don’t change, while dynamic URLs change per user request. Static URLs are often better for SEO, but ecommerce websites need dynamic URLs because they are used for filtered and sorted results. Navigation check Just like URLs, navigation reflects the structure. It includes menus (horizontal, vertical, side, or drop-down), various icons, filters, calls to action, links, breadcrumbs, and so on. Navigation should be convenient for the user and the search bot. Both should have no problem interacting with the site and “traveling” between the pages. A negative navigational experience can lower your position in the search results and cause your sales to sink with it. Breadcrumbs check Breadcrumbs help users navigate your resources more effectively by revealing to the user where they are within the website’s hierarchy. Ecommerce sites often use breadcrumbs to display product categories. Breadcrumbs should be easy-to-understand, consistent, and appropriately located. Meta tag robots and X-Robots check Robots meta tags tell crawlers how to crawl or index page content. Though there are many other options for managing indexing, analyzing the “noindex” directive during an SEO audit is key. “Noindex” meta robots tag tells search engines that the page shouldn’t be indexed. In the ecommerce industry, it’s often used to exclude pages with filtered results from indexing. Paginated pages, with products, on the other hand, should be indexed. You should also check the x-robots tag. It’s used to provide indexing instruction to bots, but it’s included in the HTTP header of a URL. Web server logs check Web server logs contain the results of users’ and crawlers’ requests to the server. You can find them in a separate logs folder or in the root of the site. Both can be accessed using FTP or through your hosting provider’s web interface. Analyzing this information helps you understand how often search crawlers visit your site, which pages are most visited, which crawlers visit your site, etc. Checking logs regularly gives you a clearer idea of which pages are problematic and sheds light on all areas of your website that can be improved. Broken links check Broken links are external or internal links that lead to a non-existent page. They are common, especially for ecommerce sites where some products may be out of stock, some categories and subcategories of goods may be combined or split, etc. Finding broken links on a large ecommerce site with several thousands of pages can be challenging, but checking and fixing broken links prevents them from ruining users’ experience and harming your SEO. Robots.txt file check Robots.txt is a file with crawling recommendations. Create one and put it on your site if you don’t have one. The bot will otherwise index all pages, even ones that shouldn’t be indexed. These include pages with personal user data, checkout pages, or shopping carts (unless other methods block them). Not having a robots.txt file can lead to irrational use of the crawl budget (the limited number of pages bots crawl on your site at a time). Don’t let this file block crawlers from accessing the parts of your site that you want to index. Only use it to block unnecessary parts. Hreflang attribute check If your website has several language versions, the “hreflang” attribute tells the search engine which language you use on each page. It also navigates users from different countries to content in their native language. Let’s say a person using your site lives in Spain, and you have a Spanish version of the site. The “hreflang” attribute lets the search engine know that this user should see this page in Spanish. Hreflang tags must point to correct and indexable URLs and use the right language and region code. Sitemap check Using a sitemap improves a site’s crawlability and boosts the navigability of pages that might not be discovered by search bots themselves (pages at deeper levels of a website, for example). This is especially true if the website is new. Always have a relevant XML sitemap and make it available to your search engine. Tools to use Conducting an ecommerce website audit and searching for all the technical issues entirely “by hand” is time-consuming and tedious. Today, there are many trusted tools for identifying and resolving the issues highlighted above. We’ll cover the most popular ones in this article, and you can also check this extended list of carefully selected best SEO audit software and learn more about each tool’s capabilities. Let’s start with a must-have tool for every site–Google Search Console (GSC). This free tool makes it easy to track your presence in Google’s search results. It also offers critical reports that reveal some of the most common technical SEO issues. GSC’s main report is the Pages Report. It lets you see which pages have been indexed by Google and reveals any problems found during the crawl. You can also check indexing directly in a search engine. To do this, enter site:siteaddress in Google search. The search engine will then reveal all the site’s indexed pages. From here, you can compare the results with the actual number of pages. The GSC Sitemaps Report shows the sitemap type, indicates when it was submitted and read, and what errors occurred. Another helpful program for technical auditing is Screaming Frog. Let’s see what it can do by scanning Walmart’s website with it. The main screen of the program is divided into four areas: List of all scanned pages Scan data Information about the page you have selected in area 1 Visualization of the report you have chosen in area 2 To find out which pages are available for indexing, you can go to the Indexability column. In the adjacent Status Code and Status, you will find information about the server response codes and descriptions. The screenshot above shows many pages with a 4XX status, meaning they are inaccessible to both users and search engines. Let’s check out the same report from the Asos online store audit. Here, most pages have 200 statuses. But they aren’t indexable, so they won’t be visible in the search results for the corresponding query. Screaming Frog has visualizations to help you analyze site structure and internal linking. If a robots.txt file is added to the site, you can check it via Screaming Frog by going to the Response Codes tab and filtering by “Blocked by Robots.txt.” You can check other technical SEO issues by clicking on the down arrow in the top menu. The first two tools can generate some reports but they might not always provide a complete picture or offer hints on how to fix the situation. Website Audit can do what the tools described above can’t. This technical audit tool lets you conduct a high-quality check and points out problem areas. It even offers suggestions you can use to alleviate the situation. Once the analysis has been completed, you can check the Overview. This contains all the main metrics, including: Number of pages scanned on the site Number of URLs found List of top problems on the site Indexing status Response codes Page click depth, etc. You can also compare new results with previous audits to see if your changes have been successful or not. To get more details, go to additional reports. For example, Issues Report (1) shows all the problems on the site grouped by areas of influence (security, crawling, duplicate content, etc.) (2). By selecting a category, you will see the problem descriptions (3). Another critical report is Crawled Pages (1). This report displays all crawled pages and issues found on each of them. You can view all pages or select the ones with errors, warnings, or notices (2). You can also find data on the response code and see if a page is blocked by robots.txt (3). This only scratches the surface of this tool’s capabilities. Read more about Website Audit to learn how it can streamline the way you spot and fix technical errors. RUN A WEBSITE AUDITScore your website in 2 minutes. Enter any website URL to get a detailed report on tech issues and suggested solutions.Analyze On-page audit While the previous section covered the technical aspect of your site, on-page SEO is about optimizing each page so it appears in organic search for keywords related to that page’s topic. A well-optimized page helps the search engine understand the content and adds relevance to the search query. Some elements on the page are direct ranking factors. Here’s what to focus on when conducting an on-page ecommerce audit: Keyword usage There are usually three keyword types on ecommerce websites: primary, long-tail, and branded. The primary search terms are often used in category titles and descriptions. Long tail keywords are more specific. They can (as a rule) lead a potential buyer to a product page. Branded keywords are essential if your customers search for a product from a specific company, so they should always be placed where the user expects to see brand names. Remember that words hide intentions. User intent is what the user wants to achieve. It is the main goal behind the search query. There are different intents (navigational, informational, transactional, commercial), and they require different keywords. The content on the page you are driving users to should meet the searcher’s intent. For example, if the user’s search query contains the word “best,” they should be directed to a review article comparing products of that type. Likewise, those searching for a specific product name should land on the product page to purchase it. Google pays attention to signals (such as keywords used in content) to rank pages. Keywords should also be used in URLs, headings, titles, meta descriptions, product descriptions, and alt-tags of images. Be careful NOT to over-optimize a page when doing SEO for an ecommerce website. Keyword cannibalization Keyword cannibalization happens when different pages on a website target the same keyword and have the same search intent. This can make it harder for Google to figure out which page to prioritize. Ecommerce sites suffer uniquely from keyword cannibalization because sometimes multiple products can be in the same category and rank for similar terms. Pay double attention to target keywords on online stores. Duplicated content Duplicated content is another problem on ecommerce websites, namely because of reused product descriptions. This can be fixed using canonicals, “noindex” tags, robots.txt, and by adding unique content to your pages (frequently asked questions, guides, reviews, etc). Tools to use If you’re looking for one tool that can analyze everything (or almost everything), pay attention to the On-Page Checker. This on-page analysis tool can audit a single page against more than 90 parameters that affect rankings. For example, you can find out what’s wrong with the meta title, description and H1, you can improve content based on the keyword density data, check the SEO score of the page and compare it to your competitors, and much more. This is what a report on one of the Asos website pages looks like: The page score is above average but there is still room for improvement. One major thing that needs to be fixed is the page’s content uniqueness, which is below the recommended level. The Walmart online store page has an even worse result. The page score is lower. By going to categories (Text Content (1) in our case), you can see the list of issues and sort them by Errors, Warnings, Notices, and Passed Checks (2). There is a short description next to each problem to help you better understand how to fix it (3). If you want to learn even more about the On-page Checker tool, read our detailed blog post on how to keep your pages healthy. Off-page audit An off-page SEO audit implies checking your website’s backlink profile (the number and quality of links to your site that are from third-party sources). Backlinks can be good or toxic. A good link is placed on a reliable and authoritative website with a similar topic to yours. It has relevant anchor text and looks natural. Toxic links (the opposite of the above) can harm your website’s reputation and ranking. Search engines analyze your backlink profile to determine how authoritative your site and its resources are. When conducting a backlink audit, pay attention to: Pages on your site that are linked to most often. Whether all linking pages work and are indexed, or if some of them have status code 404. Whether the links on those pages are still available. What sites link to yours, and whether you are thematically compatible with them. The authority of the resource linking to your site. Anchor texts your backlinks use. Tools to use Checking backlinks is easier if you have a tool like Backlink Checker. It gives you a complete list of backlinks from any domain along with additional data, including domain and page trust scores, anchor texts, etc. You can analyze backlinks leading not only to your site but also to those of your competitors. Using this tool, you can also check anchor texts. You can get detailed data on all your active, new, and lost backlinks by going to the Backlink tab. CHECK ANY SITE'S BACKLINKSCheck which domains link out to any website and get ideas for enhancing your backlink profile.Analyze To get even deeper insights, you may also use reports from Google Search Console (GSC). The Links report on GSC reveals the pages on your site with links from other sites, external sites linking to yours, anchor texts, etc. You can authenticate GSC with your project on the SE Ranking platform. Its convenient and easy-to-comprehend interface lets you see the data from GSC and work with it. You don’t have to switch between the two tools because of the smooth integration mentioned above. Once you import backlinks into the SE Ranking account, they will be available in the Backlink Monitoring tool. It saves you time and makes audits more effective. You can also deal with changes instantly by configuring the Backlink Monitoring tool to send notifications each time anything happens to your backlinks. Local SEO audit Local SEO increases the visibility of your business in online searches so your potential nearby customers can easily find you. You may think this only works for offline businesses, but local SEO can also help online ecommerce sites. Let’s say your online store covers multiple countries and has different language versions for those locations. You’ll want to use local optimization to provide your clients with relevant information for their area. An online store can also have offices, offline stores, showrooms, and delivery. If the client sees that you are in a closer location to them than your competitors or that you have attractive proposals, they are more likely to choose you. After the Pigeon and Possum algorithm updates, business location became an important ranking factor. Soon after that, proximity to the user became a decisive factor in local search results What to check during a local SEO audit: Make sure that the site’s local versions have translated content. Different versions of the site should not have duplicated content. Create or update your Google Business Profile (Google My Business). Make sure the NAP (Name, Address, Phone) indicated on your website’s main page matches similar data in the company profile. Make sure your location is listed in key sections of your site. Check whether you already use schema geographic markup or add one. It lets search engines know more about your business location. Tools to use SE Ranking’s Local Marketing Tool is great for tracking your local SEO efforts, monitoring your GBP performance, managing reviews and listings, and getting statistics and notifications about errors. If you go to the Business Listings tab, you’ll see NAP issues that have been detected. By clicking on the number of errors, you’ll see a list of directories in your business profile with errors that need to be fixed. The Google Business Profile tab will provide you with all the necessary data on your profile performance, including how many views, website visits, direction requests, phone calls, and messages you get. You can review this data for different time periods and analyze dynamics. You can also use the Local Marketing platform to read and respond to reviews your business receives. It helps you analyze your rating and identify the keywords most often used by your clients. User experience audit A website UX SEO audit is a comprehensive evaluation of the usability, functionality, and impression that a site has on its users. Poor UX means that even people ready to buy from you may not convert if, for example, your site has no preferred payment method or it is unclear from the interface where to click to make a purchase. A UX SEO checklist includes several key aspects to examine: The intuitiveness of navigation Put yourself in the client’s shoes and see if they understand how to interact with your site. Check your sales funnel’s logic and don’t skip any stage. Inspect the complexity of your site’s checkout process because your customer can just as easily buy a similar product from your competitor if it’s too difficult for them to buy it on your site. Explore the number, location, and relevance of conversion elements on your pages. Accessibility of pages If the client can’t get to the product page, how can they buy it? Here, we return to broken pages again. The fewer broken pages, the better. You can also customize the error report the user sees to increase the chances that your potential customer will stay on the site and continue shopping. Operation of buttons and links Your goal is to sell the product, and the customer’s goal is to buy it. Make it clear to the user how to do this and make sure they can perform the action without any delay or trouble. If a potential buyer finds a product that they want but doesn’t see the button or can’t click on it, both you and your potential buyer will fall short of your goal. This prospect will most likely leave your website and buy an identical product from one of your competitors. Website responsiveness Focus on website responsiveness is the new norm. Since most purchases are made via smartphones or tablets (mcommerce), your website should easily adapt to different screen sizes and provide clients with the same level of experience they get shopping via their computers. Site loading speed The loading speed of your site’s pages heavily impacts how your ecommerce site ranks. A fast website means staying ahead of the competition, providing a better customer experience, getting more conversions, and lowering your bounce rate. For ecommerce sites, the loading speed should not exceed two seconds. In fact, according to Neil Patel, a one-second delay in page response can result in a 7% reduction in conversions. Core web vitals Core Web Vitals became a Google ranking factor in 2021. At that time, they consisted of three measurements: LCP (​​Largest Contentful Paint) indicates how quickly the main content of a webpage is loaded. FID (First Input Delay) indicates the responsiveness of your webpages when users first interact with them. CLS (Cumulative Layout Shift) indicates how long it takes for your web page to become visually stable, i.e., whether there are elements that prevent visitors from seeing the content. Recently, Google introduced a new metric—Interaction to Next Paint (INP). This metric measures the latency of all user interactions and displays how many interactions occurred below the latency threshold. This new metric will replace FID in March 2024. When doing SEO for an ecommerce website, try to improve these metrics to ensure that your visitor gets the highest quality experience possible. Google is very picky and shows users the best results for their query based both on the content’s quality and the way that content interacts with users. Tools to use The first place to check your site’s UX is the GSC Page Experience report. It shows the percentage of URLs with good page experience and search impressions, allowing you to evaluate performance better. There are also Core Web Vitals and Mobile usability reports. Another tool that reveals your site’s speed and Core Web Vitals is Google PageSpeed Insights. It provides a page performance report on both desktop and mobile devices. What’s more, it provides suggestions on how to improve the analyzed page. You shouldn’t rely on only one or even two tools when conducting an ecommerce SEO audit. Instead, use as many instruments as possible to get insights. To audit user experience, consider checking the Behavior Flow report from Google Analytics. It visualizes the path that the user takes from one page to another. This report can also help you find out what content interests users and identify potential issues with content and site usability. Brand & trustworthiness audit Since the customer must trust you to buy from you, an audit of the brand and its reliability is an integral part of an ecommerce SEO audit. Consider the following points: Start tracking brand SERP, i.e., the search results for a query that includes your brand name. Seeing what kind of brand message is transmitted to your customers is critical. You can also examine how often people search for your brand. Monitor brand mentions with Google Alerts. Analyze in what context your brand is mentioned. This may give you insights to improve your website and communication strategy. Set up notifications and get messages whenever your business is mentioned anywhere on the web. Examine the relevance and accuracy of “About Us” information on your site, pricing policies, terms of delivery, and everything else your customers may be interested in. These help to build trust between you and your clients. How often do you need to perform an SEO audit for an ecommerce site? The frequency of an ecommerce SEO audit may depend on several factors: The current SEO health of your site. If your site is already “sick,” it needs more frequent checks. Website size. A larger website could require more frequent checks. The level of competition in your niche. If your competitors constantly improve their websites and work on their SEO, you should keep up with their pace too. If most of your traffic is organic, or you want to make it organic, conduct SEO audits more often. A large ecommerce site with thousands of product pages and dynamic content, for example, typically requires monthly checks to catch and fix bugs as they occur. A smaller local business with an established product line may only need to perform it quarterly. The SE Ranking team recommends that you do an ecommerce SEO audit every time: You make changes to your website (design, structure, etc.). Changes happen to ranking algorithms, or new ones are introduced. You see a significant drop in organic traffic. Final thoughts By regularly conducting an ecommerce SEO audit, you save yourself from several problems. It helps you to: Identify issues before they affect your organic traffic. For an ecommerce website, organic traffic equals profit. Bring your site to higher positions, ideally higher than your competitors. Potential customers will be able to find your site more easily. Fine-tune your website to streamline your buyer’s journey. Simplify the shopping process to increase the chances of a successful purchase. Given these results, the effort and time invested in conducting an audit are worth it, especially if you’re making a long-term investment. Ecommerce SEO SE Ranking Tools Website Audit 9498 views Written by Yevheniia Khromova Yevheniia is a content marketer and copywriter at SE Ranking. She is a fan of SEO, digital marketing, and content creation. Yevheniia believes simplicity is key as it helps reduce the clutter in our heads and focus on what matters. This is the principle she uses in her writing. She also enjoys cooking, learning new spices and flavors, traveling, and playing board games.",
  "headers": [
    {
      "level": "H1",
      "text": "How to perform an SEO audit for an ecommerce website"
    },
    {
      "level": "H2",
      "text": "What is an ecommerce SEO audit?"
    },
    {
      "level": "H2",
      "text": "What are the steps of an ecommerce SEO audit process?"
    },
    {
      "level": "H2",
      "text": "Complete guide to ecommerce website SEO audit"
    },
    {
      "level": "H3",
      "text": "Technical SEO audit"
    },
    {
      "level": "H4",
      "text": "Tools to use"
    },
    {
      "level": "H3",
      "text": "On-page audit"
    },
    {
      "level": "H4",
      "text": "Tools to use"
    },
    {
      "level": "H3",
      "text": "Off-page audit"
    },
    {
      "level": "H4",
      "text": "Tools to use"
    },
    {
      "level": "H3",
      "text": "Local SEO audit"
    },
    {
      "level": "H4",
      "text": "Tools to use"
    },
    {
      "level": "H3",
      "text": "User experience audit"
    },
    {
      "level": "H4",
      "text": "Tools to use"
    },
    {
      "level": "H3",
      "text": "Brand & trustworthiness audit"
    },
    {
      "level": "H2",
      "text": "How often do you need to perform an SEO audit for an ecommerce site?"
    },
    {
      "level": "H2",
      "text": "Final thoughts"
    },
    {
      "level": "H2",
      "text": "You might be interested"
    }
  ],
  "author": "Yevheniia Khromova"
}