{
  "url": "https://seranking.com/blog/ecommerce-metrics/",
  "slug": "ecommerce-metrics",
  "title": "Ecommerce performance metrics and KPIs for an online store",
  "description": "Set SMART KPIs for your online store by learning about 13 essential ecommerce metrics you can track at every stage of a buying cycle.",
  "content": "Blog / Analytics & Reporting / 13 essential ecommerce metrics: How to track them and set KPIs for an online store13 essential ecommerce metrics: How to track them and set KPIs for an online store Written by Kseniia Kyslova Nov 16, 2023 21 min read In the world of ecommerce, you may find yourself bombarded by data. Marketing, sales, product list management, and customer support software measure every aspect of your online business. They also produce more metrics than you can track, process, and analyze. Any page view, click, and reaction on your website impacts your business’s overall success. User interactions (reflected in numbers) can give you insights into what you should start, continue, or stop doing to catalyze growth. Now with all this data at hand, what should you focus on? We reached out to SEO and marketing professionals, asking them which 5 ecommerce metrics they track regularly. Their lists included bottom-of-the-funnel metrics such as revenue and ecommerce conversion rate. All three experts mentioned average order value (AOV), while customer acquisition cost (CAQ) and Shopping cart abandonment rate (SCAR) each received two votes. Himani Kankaria Founder at Missive Digital I would like to recommend the following metrics to be tracked channel, category, and product-wise on monthly, quarterly, 6-monthly, and yearly: Revenue, Goal conversion ratio, Average order value (AOV), Customer Acquisition Cost (CAC), New vs returning customers. Navneet Singh CEO at SEO Experts Company India The 5 main ecommerce metrics I advise tracking are sales conversion rate, customer lifetime value, average order value, customer acquisition cost, and shopping cart abandonment rate. Nicole Martins Ferreira Content Marketer and Co-founder of Declutter The Mind The five ecommerce metrics you should track are revenue, profit, conversion rate, average order value, and abandoned cart rate. All of these metrics when combined help show you the health of your business and indicate how you can improve your overall sales. High revenue and low profit indicates that you might run out of money to continue your business long term, so analyzing your average order value and trying to boost it can help you raise your profits. These quotes prove that there is no one-size-fits-all solution when it comes to the best ecommerce marketing metrics. You’ll need to choose your own set that will fit your project best. In this article, we’ll go through a list of the most important ecommerce metrics to track. Any of them work as key performance indicators (KPIs) and inform you about how to spur your business’s growth. In particular, this is the list of top ecommerce metrics we’re going to cover (jump to each section if you’re looking for specific ones): Number of visitors Customer acquisition cost Cost per acquisition Return on investment Visit-to-purchase conversion Add-to-cart rate Shopping cart abandonment rate Units per transaction Average order value Product return rate Repeat customer rate Customer lifetime value Net Promoter Score Let’s start by determining what ecommerce metrics are and their types. What is an ecommerce metric? Anything you can measure regarding the performance of your online store is a metric. It can be the number of clicks a particular page gets from Google’s search results, the conversion rates of a particular campaign, or your net revenue per month. Types of ecommerce performance metrics Every customer begins their journey through your ecommerce funnel from one of these four stages: acquisition, engagement, conversion, and retention. Each stage of the funnel has its own set of metrics. You can also divide metrics by a specific marketing channel and have SEO metrics to track, along with website conversions, email metrics, and so on. RUN A WEBSITE AUDITScore your website in 2 minutes. Enter any website URL to get a detailed report on tech issues and suggested solutions.Analyze When measuring your business’s success, your metrics can be categorized as either lagging or leading. Lagging metrics measure the results. They are indicative of the past and describe what has been done. For example, revenue is a high-level lagging metric that shows the outcome of your business’s activities as a whole. Lagging metrics are good for evaluating where you currently stand. At the same time, they don’t give you any hints about what has impacted your results and how you can perform better in the future. Leading metrics precipitate the results. They measure the activities, processes, or behaviors that happen one or two steps before the result is achieved. For example, the add-to-cart rate and cart abandonment rate are leading metrics influencing your site’s overall conversion rate. Leading metrics point to the things you should fix or change to improve your outcomes. It means they are actionable. You’ll need to track both lagging and leading metrics, but if you consider all aspects of your business, you’ll see that you have hundreds of parameters to track. Tracking everything is not a viable option, so you should prioritize some metrics over others. Define the metrics that better reflect your goals at the current stage of your business’s life cycle and set your ecommerce KPIs based on them. Metrics vs. KPIs To gauge your performance relative to your main business goals, set a bunch of KPIs for your key metrics. You’ll have 3 to 7 of them at a time. You’ll likely change them or substitute some of them as you achieve your goals or come across new business challenges and growth opportunities. What exactly are KPIs? In a nutshell, KPIs are the target values for your most important metrics. They reflect the metric’s required performance level for reaching a particular business goal. To see if you’re on track, compare your current measurements at any given time against your pre-defined KPIs. Setting important KPIs for ecommerce website There’s no one-size-fits-all approach to setting ecommerce KPIs because the main rule for KPIs is that they should be relevant to your current goals. KPIs differ because goals change all the time, but the process of setting them is the same for all. It includes the following steps: Decide on the goal you want to achieve. If you’re launching a new store, focus your efforts on establishing your online presence and growing traffic. If your online business is mature, consider improving your site’s conversion rate or customer retention rate. Choose 3 to 7 metrics supporting your goal. This is only a suggested range. You can decide how many parameters to measure and analyze. Since there are so many indicators, focus on the ones that have the greatest capacity to help you reach your goal. Set SMART KPIs. SMART stands for Specific, Measurable, Achievable, Relevant and Time-Bound. To define an achievable target value for each metric, check ecommerce benchmarks, consider the resources you have, and estimate your potential impact on the metrics. Configure and test ecommerce analytics tools. Make sure you have reliable tools that capture all the necessary data and measure the chosen KPI metrics for ecommerce accurately. Monitor your KPIs and put them into action. Track and compare ecommerce KPIs and metrics over time. If some metrics aren’t performing at 100% of your KPI, review and adjust your activities to catch up. When setting KPIs for ecommerce websites, you’ll most likely need to focus on one of the following metrics. Look through the list below to find out which metrics you should be tracking. Ecommerce metrics to use as KPIs Setting KPIs for some of the following metrics can positively impact your business’s growth, but you have to measure them accurately and have a well-thought-out performance improvement plan. We’ve divided the most important ecommerce analytics metrics into 4 categories: acquisition, conversion, transaction, and retention. 1. Customer acquisition metrics The acquisition metrics help you track and evaluate how many visitors your online shop gets, what channels they come from, and whether your marketing efforts pay off. The number of visitors This metric lets you know how many people come to your site. The number of visitors should be measured overall and by channel. Google Analytics 4 will help you measure the number of visitors coming from organic search, paid ads, email, socials, or referring sites. By comparing these channels, you’ll see which of them work well, which require improvements, and which may not be worth the effort. It also makes sense to track the number of new visitors to see how fast your audience grows: (#) New visitors = (#) Overall visitors – (#) Returning visitors Customer acquisition cost (CAC) This metric shows the marketing and sales expenses required to attract a visitor and convert them into a customer. You can include in the calculation the money spent on marketing campaigns, subscriptions for software tools, and team salary. ($) CAC = ($) Sales and Marketing Expenses / (#) New Customers Acquired Knowing your CAC will help you estimate your business’s sustainability. To figure out if your CAC is healthy, compare it to other metrics, such as average order value and customer lifetime value (we’ll cover them later). Having a CAC of $20 and an AOV of $15, for example, means that you’re losing money on the first sale. But this isn’t a bad thing if every customer stays with you for half a year and makes repeat $15 purchases weekly. Cost per Acquisition (CPA) Unlike CAC, CPA is a more granular metric measured for paid customer acquisition channels or specific marketing campaigns. It’s typically measured for Facebook and Google Ads because these campaign types have the clearest correlation between costs and outcomes. ($) Cost Per Acquisition = ($) Customer Acquisition Channel Spend / (#) Customers Acquired Through the Same Channel Consider the CPA relative to the overall CAC. If the CPA for a particular channel is high, try to optimize it even further to boost your business’s growth and profits. If the CPA is low, consider changing the strategy or raising the budget to reign in more customers and speed up growth. For example, higher bids in Google Ads can help your ads win more impressions and gain more leads. ROMI and ROI by channel Return on Marketing Investment (ROMI) measures the overall effectiveness of marketing activities and reflects how investments in marketing impact the revenue. The general formula for calculating ROMI typically looks like this: (%) ROMI = (($) Revenue Attributed to Marketing – ($) Cost of Goods Sold – ($) Marketing Spend)) / ($) Marketing Spend) * 100 When your ROMI equals 100%, the outcome of your marketing activities covers the costs but doesn’t increase your revenue. Yet, this formula might differ from case to case depending on whether the cost of goods and/or marketing costs are considered. For instance, if you don’t obtain data on the cost of goods and still need to calculate ROMI, you can use the following formula: ROMI (without consideration for the cost of goods) = ((income from marketing – marketing expenditures)/ marketing expenditures) * 100 In turn, to calculate ROMI without deducting marketing expenditures, stick to the formula provided below: ROMI (without deducting marketing expenditures) = (income from marketing / marketing expenditures) * 100 Finally, there is a separate formula for calculating the return on investment in advertising, widely known as ROAS (Return on Ad Spend). Its formula is relatively similar and looks like this: ROAS = revenue attributable to ads / total ads expenditures For example, let’s say you invest $300 into your ad campaign and generate $750 in revenue from those ads. In this case, your ROAS is 2.5, which is a great result. Track return on investments for every customer acquisition channel separately to figure out a better way of distributing resources between them. You can also separately track these ROIs to distinguish between profit-making and loss-making marketing activities. (%) ROI by Channel = (($) Revenue Attributed to the Channel – ($) Cost of Goods Sold – ($) Spend on the Channel)) / ($) Spend on the Channel) * 100 ROI by channel is often a tricky metric to calculate. This is because there are difficulties associated with attributing results to particular channels. Since most customers have multiple touchpoints on their path to purchase, you must choose between first-touch, last-touch, and weighted multi-touch attribution models. 2. Conversion metrics These metrics are control points at all steps of the customer journey. They help you see if there are any problems stopping site visitors from becoming customers. A common pain point for ecommerce sites is losing leads at the very bottom of the funnel. This is why the following three metrics are very important to track for any online store. Visit-to-purchase conversion This metric refers to the percentage of website visitors making purchases and shows the overall efficiency of the marketing and sales funnel. (%) CR = ( (#) Total Customers / (#) Total Unique Visitors) * 100 A low overall conversion rate indicates that something is wrong with your funnel. It can attract the wrong audiences, provide a bad experience at the checkout, or anything in between. It’s difficult to improve conversion rate without measuring more granular metrics. A single misfired campaign, a malfunctioning website page, or an unpopular product can dilute the aggregate conversion rate. To find ways to optimize your conversion rate, you should separately measure conversion: By channel, to know if SEO, email, PPC ads, or socials drive qualified traffic. Adjust your activities in these channels to improve their efficiency. By product category, to see what products sell well and to optimize your inventory to meet customer demands. By marketing campaign, to know what messages and offers resonate with your audience and to know which marketing activities to stop or scale. By customer journey step, to find and fix your site’s content and design problems, especially ones that spoil customer experience and make people exit halfway through their journey. Knowing your conversion rates by marketing channel, product, or customer journey touchpoints will help you choose the most effective ways of attracting customers, stock up on more products that sell well, and fix your website’s user experience issues. Add-to-cart rate This metric shows the share of user sessions in which users added at least one item to the shopping cart after viewing the product page. (%) Add-to-Cart Rate = ((#) Sessions with Clicks on Add to Cart / (#) Total Sessions) * 100 Add-to-cart rates provide insights into your product selection, presentation, and pricing. These rates can be low if you sell products lacking in demand or your product description pages disappoint visitors. Even if your products are presented well and are fairly priced, issues with site structure and navigation, search, and overall usability can still harm this metric. Shopping cart abandonment rate (SCAR) This metric shows how many online shoppers add items to their cart on your website but don’t complete the purchase. (%) SCAR = (1 – ((#) Completed Purchases / (#) Carts Created)) * 100 By tracking the percentage of engaged people who leave at the final step before buying your products, you can spot some potential problems at the checkout process. These include: Technical flaws damaging user experience. Limited or insecure payment options. High shipping costs or unexpected additional charges. Unclear return and refund policies. Apart from fine-tuning the checkout process, use retargeting and cart recovery emails to nudge cart abandoners to finish the purchase. Even if you optimized your website’s conversion metrics perfectly, people will still abandon carts if something distracts them during the checkout process. Examples of abandoned cart emails 3. Transaction metrics Conversion into a purchase is a substantial metric in its own right, but your sales are what really make you money. To optimize for transactions, figure out how many products you sell, how many returns come in, and how much revenue you generate. Units per transaction (UPT) This metric refers to the average number of items sold for each purchase that a customer makes. (#) Units per Transaction = (#) Items Purchased / (#) transactions UPT helps you understand buying patterns so you can tell if your promotional campaigns are working. For example, let’s say you want to empty your stocks during a sale. You expect your UPT to be higher than average. If customers buy lots of items from your store, it means you have a good grip on their tastes and preferences. The more your brand (or product selection and pricing) resonates with consumers, the more sustainable your business will be. To raise the number of products sold per order, include product recommendations in carts to cross-sell complementary items. For example, it would make sense to offer socks to people buying sports shoes. You can also try to sell products together as a bundle. Average order value (AOV) This metric shows the average amount of money your customers pay per order calculated over a period of time by the following formula: ($) Average Order Value = ($) Total Revenue / (#) Orders Placed Measuring AOV can help you understand purchasing patterns in your store. For example, a low AOV can indicate that people mostly make one-item orders or tend to buy cheap items. Beware of including irregular (extremely high-value or low-value) orders in the AOV calculation. These orders spoil the metric. Improving AOV is often a fast way to increase revenue. To nudge your customers to spend more, consider offering free shipping to orders with a 30% higher value than the current AOV, or create product bundles. Also, implement product suggestions on product description pages to upsell customers who are open to considering higher-priced alternatives. Product return rate This metric represents the percentage of returned products over the total number of products sold. Alternatively, it can be calculated in the money equivalent below. (%) Return Rate = ((#) Returned Items / (#) Sold items) * 100 High return rates mean lost sales, unhappy customers, additional return costs (shipping, refurbishment, repackaging, restocking, etc.) that drain your profit. When calculating the return rate, decide whether to count refunds only or include product exchanges, too. As for the exchange transactions, distinguish between positive, negative, and neutral ones. These all impact the bottom line differently. Don’t forget that returns are an additional customer touchpoint. You still have an opportunity to retain sales by offering customers to replace an item, or at least collect feedback and address the problem that caused the return. Example of a return page where feedback is required 4. Customer retention metrics Getting a new customer can cost five times as much as retaining an existing customer. This is why at some point of your business lifecycle, you’ll need to shift your attention to retention metrics and set KPIs for them. Why are your existing customers more valuable than new ones? Repeat customer rate (RCR) This is the proportion of customers that have purchased from your store more than once. This number shows you how much value your store brings to customers and how your customer retention activities operate. (%) RCR = ((#) Return Customers / (#) Total Customers) * 100 When considering your RCR, keep an eye on other metrics. For example, if you attract a lot of new customers, your repeat customer rate will decrease naturally, but that isn’t necessarily a bad thing. Setting a KPI for RCR is natural if you sell consumable and expendable products, like food or cosmetics. If you sell items that people don’t usually purchase multiple times, like home furniture, for example, this metric won’t be that valuable. We’ll discuss ecommerce reporting Google Analytics 4 offers in greater details in the next sections. Customer lifetime value (CLV) This metric is the dollar value of a customer-business relationship. It shows the total revenue a business can expect to get from a customer from the beginning to the end of the relationship. It can be calculated using different formulas. This one works for online retailers: ($) CLV = ($) Average Order Value * (#) Transactions per Customer * (# years) Average Retention Time By calculating CLV, you can find the upper limit of your customer acquisition and retention spend. In other words, your CLV is the money you should be willing to spend to get a customer and to avoid losing them. By comparing your CLV to CAC, you might find out that you’re missing opportunities from not spending enough on acquiring customers. If you calculate the CLV by customer segment, you’ll know what types of customers to spend on. Net Promoter Score This metric shows how likely customers are to recommend your store to someone else. It gauges your customers’ willingness to promote your business on a 0 to 10 scale and classifies them into three categories: promoters (9–10), passives (7–8), or detractors (0–6). NPS = ((#) Promoters — (#) Detractors) / ((#) Respondents) x 100 To measure NPS, send an online poll to your customers. It can be in the form of pop-up surveys on your Thank You pages, or included in follow-up emails or chat messages. Use the results to predict repeat purchases and word-of mouth-marketing-related business growth. Example of Net Promoter Score survey sent by an ecommerce brand To get even more insights from these surveys, consider asking follow-up questions (diagnostic questions) to collect feedback. For example, you can discover how to improve upon promotional strategies that aren’t working as well as find out what is working. Tracking key ecommerce metrics and KPIs in Google Analytics 4 Fortunately, you can connect Google Analytics 4 to your site and track all of the mentioned ecommerce success metrics using a single tool. Now, let’s review in detail how you can find and set up the ecommerce conversion tracking in GA4 through standard reports and explorations. Standard reports Considering that GA4 doesn’t show ecommerce conversion data by default, you’ll need to add this metric to your traffic acquisition reports manually. For this, follow these simple steps: 1. Under the Reports block, select Acquisition > Traffic Acquisition and then click on the pencil icon in the upper right corner of the screen. 2. Click on Metrics and select the Session Conversion Rate as one of the metrics you want to track. And there you have it—a table with your ecommerce conversion rates for different marketing channels! Explorations When it comes to explorations, you’ll need to put a little more effort into creating a report with all the necessary ecommerce metrics and KPIs. However, these reports’ customization options and deep insights significantly outweigh the complexities you might face when structuring them. Start tracking your ecommerce-specific data by following these steps: 1. Navigate to the Explore section > Blank report. 2. Here, you’ll need to add dimensions like Event name and Session source/medium. In terms of metrics, add the Session conversion rate and any other ecommerce KPI metrics you believe might be valuable for your report. 3. Add Session source/medium to Rows and Session conversion rate to Values. 4. To narrow down all conversions to purchases only, create a filter where Event name matches regex session_start|purchase. Using this report, you’ll be able to cover your major ecommerce KPI tracking needs. You can always play around with different metrics/dimensions and customize your reports to showcase only the most valuable data for your specific marketing needs. For instance, by adding dimensions like Device category, Session source/medium, City, and Session campaign, as well as the Average purchase revenue metric, you can build a report representing data on your average purchase revenue. In turn, to create a visual representation of your shopping cart abandonment rate, you can customize your report in the following way: 1. Create a new blank report and select the Funnel exploration option in the Technique box. 2. Click on the pencil icon next to the Steps block. 3. Create three steps with add_to_cart, begin_checkout, and purchase conditions for each, respectively. 4. Click the blue Apply button in the upper right corner of the screen and take time to explore the report with all the necessary data on your shopping cart abandonment rate. Closing thoughts Online stores have much better access to marketing and sales data than brick-and-mortar stores. But to turn your data into power, know what metrics to focus on and pinpoint which ecommerce KPIs have the greatest impact on your online success. Keep an eye on the chosen indicators and they will help you predict and improve future sales, revenue, and customer satisfaction. Ecommerce SEO Google Analytics 5889 views Written by Kseniia Kyslova Kseniia is a content marketer at SE Ranking. She's curious about all things SEO and content production. When she's not writing, you're likely to see her training, running, climbing, or cycling. Yet, the ever-evolving world of digital marketing occupies her mind and deters her from being a total fitness junkie.",
  "headers": [
    {
      "level": "H1",
      "text": "13 essential ecommerce metrics: How to track them and set KPIs for an online store"
    },
    {
      "level": "H2",
      "text": "What is an ecommerce metric?"
    },
    {
      "level": "H3",
      "text": "Types of ecommerce performance metrics"
    },
    {
      "level": "H3",
      "text": "Metrics vs. KPIs"
    },
    {
      "level": "H2",
      "text": "Setting important KPIs for ecommerce website"
    },
    {
      "level": "H2",
      "text": "Ecommerce metrics to use as KPIs"
    },
    {
      "level": "H3",
      "text": "1. Customer acquisition metrics"
    },
    {
      "level": "H4",
      "text": "The number of visitors"
    },
    {
      "level": "H4",
      "text": "Customer acquisition cost (CAC)"
    },
    {
      "level": "H4",
      "text": "Cost per Acquisition (CPA)"
    },
    {
      "level": "H4",
      "text": "ROMI and ROI by channel"
    },
    {
      "level": "H3",
      "text": "2. Conversion metrics"
    },
    {
      "level": "H4",
      "text": "Visit-to-purchase conversion"
    },
    {
      "level": "H4",
      "text": "Add-to-cart rate"
    },
    {
      "level": "H4",
      "text": "Shopping cart abandonment rate (SCAR)"
    },
    {
      "level": "H3",
      "text": "3. Transaction metrics"
    },
    {
      "level": "H4",
      "text": "Units per transaction (UPT)"
    },
    {
      "level": "H4",
      "text": "Average order value (AOV)"
    },
    {
      "level": "H4",
      "text": "Product return rate"
    },
    {
      "level": "H3",
      "text": "4. Customer retention metrics"
    },
    {
      "level": "H4",
      "text": "Repeat customer rate (RCR)"
    },
    {
      "level": "H4",
      "text": "Customer lifetime value (CLV)"
    },
    {
      "level": "H4",
      "text": "Net Promoter Score"
    },
    {
      "level": "H2",
      "text": "Tracking key ecommerce metrics and KPIs in Google Analytics 4"
    },
    {
      "level": "H3",
      "text": "Standard reports"
    },
    {
      "level": "H3",
      "text": "Explorations"
    },
    {
      "level": "H2",
      "text": "Closing thoughts"
    },
    {
      "level": "H2",
      "text": "You might be interested"
    }
  ],
  "author": "Kseniia Kyslova"
}