{
  "url": "https://seranking.com/blog/female-faces-war-ukraine/",
  "slug": "female-faces-war-ukraine",
  "title": "The Female Stories of the War in Ukraine",
  "description": "On the day, when the whole world celebrates its remarkable women, SE Ranking shares the stories of Ukrainian women who live through the war.",
  "content": "Blog / SE Ranking News / The Female Faces of the War in UkraineThe Female Faces of the War in Ukraine Written by Svetlana Shchehel Mar 08, 2022 15 min read It’s been almost two weeks since Russia started a brutal war against Ukraine and all it stands for: democracy, freedom of expression, and human rights. Ukrainian cities are being burnt to the ground, civilians are killed both in their homes and in the streets when trying to escape the massacre. The entire SE Ranking team is grieving as last Sunday we lost one of our team members—she and her two children were shot when Russian troops once again violated the ceasefire agreement and attacked people who were trying to flee the city destroyed by shelling. There are no words to express the pain we feel. Still, this is not the story I want to share with you today. I want to tell you some stories of hope and faith, stories of courage and endurance. On this day, when the whole world celebrates the remarkable women who make an impact and smash through stereotypes, I want to show you some of the female faces of the war in Ukraine. These are women who have chosen to stay strong no matter what—to protect their country and fellow citizens, to heal human bodies and souls under the screaming sounds of shelling and air raid sirens, to shield their children from the atrocities of war. Let me also remind you of my earlier post on how you can help Ukrainians today. I want to thank all of you who have already provided support—both your kind words and donations mean a lot to us. Evgenia, Military Officer ?? Evgenia spent the past 12 years building a successful jewelry business with her own production and several shops. She is the founder of two business communities—earlier their goal was to bring together Ukrainian entrepreneurs, but since the war started the communities serve volunteering purposes. For many years, Evgenia used to spend her free time on a shooting range, but she could hardly imagine that her hobby would once become a part of her daily life. On the first day of the war, she joined the territorial defense forces—special military units whose aim is to protect city residents. Staying strong Evgenia tries to stay positive and shares her military experience via her Instagram account. The support she gets from the people and their gratitude is what helps her carry on. After reading all the words of support, I feel like I can take on any challenge. I have no right to give up and let people down. When the war is over The first thing she’ll do when the war is over is let herself cry. For now, she just can’t afford it. But even when it’s all over, Evgenia will need to stay strong. Many people from Kyiv left their homes, so she realizes that even when the Russian army is defeated, she’ll have a lot of work to do in the city. In fact, Evgenia decided not to get back to doing business, but to keep serving her country and its people as an officer. This is her greatest honor. Alona, Pharmacist ???‍⚕️ Alona, who celebrates her birthday on the 8th of March, works as a pharmacist. Ever since the war started, she’s been doing her job as usual. The only thing that changed was the working hours (due to the curfew). Also, the lines got longer as people were trying to stock up. They buy all kinds of things that are still on sale—analgesics, antiseptics and disinfectants, medicines to treat a cold, baby food, diapers. There was only one supply in the first 10 days of the war, and it takes mere hours to sell out all the items that are in high demand. All the pharmacists hope that there will be more supplies soon. Staying strong Alona admits that at times she feels anxious and scared. She has two sons and a husband who serves in the army. Still, her faith in Ukraine’s victory is stronger. She draws inspiration from the firmness and unity of our nation, by the Ukrainian president and his team, by her own husband who fights for our freedom alongside other heroic Ukrainian soldiers. Every day, Alona sees how thousands of people are helping each other, and so she also does her best to help—by gathering pills, food, and warm clothes for our militaries, by finding cloth to make masking nets. When the war is over The 8th of March is my birthday, and this year I have one single birthday wish—for this war to come to an end, and to have my closest people by my side, safe and sound. When it’s all over, Alona will spend the whole day with her husband and two sons watching cartoons and eating popcorn (this was their weekly family tradition). Then she will visit her relatives and hug every single one of them. Finally, she hopes to go on a vacation the family was dreaming of before the war started. Every day, her boys wait for the war to finish, so they can be with their daddy and go to the sea. Alona wholeheartedly believes this will happen soon. Eugenia, Volunteer ?⛑ Before the war started, Eugenia was managing a marketing department of an agricultural company. Now that her business has chosen to use all its capacities to help regional volunteering organizations, she orchestrates the process of delivering necessary military armor to those in need. Eugenia’s friends from abroad also help her in her mission—they assist in finding the necessary equipment and Eugenia organizes its delivery to Ukraine, providing both the militaries in the Kyiv regions and those fighting at the front line. Staying strong Eugenia says that has no choice but to stay strong. She believes that the best way to fight stress is to do something, to actively help others. When you spend all your free time fighting behind the lines, you don’t get a chance to think about whether you feel scared or anxious. I highly recommend everyone to start doing something to feel better. When the war is over Eugenia was supposed to spend February 24, in a tattoo parlor making a tattoo of Mother the Savior, a woman who shields the land with her arms. This image, inspired by both folklore and Christian religion, is one of the Ukrainian national symbols. The same day Eugenia was planning to have her tattoo, the war started. Once it is over, she hopes to fulfill what was planned. But this will be the second thing she’ll do. The first thing when the war is over, Eugenia wants to hug her 16-year-old brother, whom the family decided to send further west to keep him safe. Eugenia added that their family rarely gets separated in times of crisis, so the decision to send her brother away from them was a hard one. Bringing him back home is what she’s looking forward to the most. Olga, Mom of a 4-year-old and a baby ??‍?? Olga is a mom of two—a 4-year-old girl and a baby boy who is just 7 months old. Olga had to flee her home to keep her children safe and never let them see the atrocities of war. When speaking to her 4-year-old daughter about the war, she says it’s an evil man who lights the earth on fire. When this evil man shoots fire like a dragon, there are explosions. Olga tells her daughter that mommy also feels scared, and so sometimes the girl can see her crying. Still, there’s a big army of superheros who will soon kick the evil man out of the land, so they shouldn’t be scared and just wait for a bit—then everything will be ok. Staying strong Social networks help Olga keep her spirits up. When she sees regular people working all together to beat the enemy—children gathering cloth for the masking nets and their mothers making those nets, civilians preparing Molotov cocktails to greet the enemy, an elderly man stopping the tank with his bare hands—it all gives her the strength to carry on. What also inspires her is how unified people in Ukraine are today, more unified than ever before in the 31 years of Ukraine’s independence. Never in my life have I felt so proud being Ukrainian, willing to sing our national anthem every single day. When the war is over When the war is over, Olga plans to finally let herself cry out loud. Being a mother of small children with parents by her side, now she just can’t let herself be weak and drag down everyone around. After having a good cry, she will go on doing what she does now—helping others as a volunteer. Anna, Doctor ?? Anna works as a doctor at a maternity hospital in Kyiv city. When the war started, she was on a shift. The brightest memory of that day is of doctors all together bringing pregnant women and mothers of the newborns to the bomb shelter to the sound of air raid sirens. The fear and anxiety in the women’s eyes are things Anna won’t be able to ever forget. The maternity hospital Anna works at operates 24/7. Many doctors, including Anna, currently live at the hospital. Some have even brought their families there. Doctors are ready to assist all the women who come to the hospital and ask for help. Since the war started, 82 babies were born there—39 girls and 43 boys. Staying strong Ukrainian people today are living through the most horrifying period of modern history, but together we can overcome all the hardships. People just need to do what is necessary, everything they can. I help bring new people to this world, and it gives me the strength, the inspiration and the faith into our common bright future. ❤️” Anna says that she will go on doing her job, in the current mode, for as long as necessary. When the war is over Anna finds it hard to plan something at the moment, but she hopes to go on with her normal life when all this is over. She wants to see all her relatives and friends, who are now scattered across Ukraine and Europe. She promises to value the small things. And who knows, maybe she’ll even go on vacation. Victoria, Expecting Mother ?? When the war started, Victoria was at her home in Kyiv preparing to become a mother. In the first 7 days of the war, she had to move 3 times. Her husband and she left the home with the bare minimum of stuff, leaving behind most of the things they’ve bought for the future baby and the delivery. Currently, Victoria and her husband are staying at a family friends’ place. She feels extremely grateful for being relatively safe, having food and all the necessities. When I think about all the people fighting for our country at the front line, I feel like my problems are nonexistent. There’s a maternity ward two kilometers away from the place where Victoria is currently staying. The baby is due any day now, but she hopes that the horrifying war will soon finish, and that she’ll be able to deliver her baby at home in Kyiv, just as planned. Staying strong Victoria gets incredible support from her family, friends, and colleagues. The family tries to keep their chins up and avoid focusing on the war. For example, watching travel shows helps them remain sound and psychologically stable. When the war is over Like many people who had to flee their homes, Victoria plans to go back to the city she loves and then take care of the baby and do all kinds of routine stuff. All the stuff that seemed so ordinary up until the war started. Svitlana, Lab Technician ???‍⚕️ Svitlana works at a medical laboratory, testing specimens from patients, such as blood, urine, or tissue. When the war started, Svitlana went on doing her job, testing even more samples. It’s just now she was not coming back home after the working hours. Since February 25, the entire staff members have been spending days and nights in the hospital, sleeping in the basement or in the lab (like Svitlana does). She has a mattress, a duvet, a pillow, but still this is nothing like the comforts of one’s own home. In the past weeks, people have been queuing up at the hospitals and blood centers to donate blood. Svitlana has a lot of work to do, testing the samples for HIV, hepatitis, and other infectious diseases. She’s actually happy being busy, as it means many lives could be saved in the future. For now, there are not that many injured people, so the hospital is mostly stocking up. Svitlana hopes that this will not change in the near future. Staying strong Working at a hospital during a time of war is psychologically exhausting. You just need to do your work to the sound of air raid sirens and explosions. Svitlana admits she feels emotionally drained, and so do her colleagues. Nevertheless, everyone is doing their best to support each other and to carry on no matter what. The entire team believes that good days are yet to come. When the war is over The only thing Svitlana can dream of right now is having a good rest and some decent sleep. Valentina, Therapist ?? Valentina is a psychologist who was treating dozens of patients. She believes in life-long learning, used to bring her son to kindergarten in the morning and to wrestling practice in the afternoon. She was planning to remodel the kid’s room and to go on vacation. Today, Valentina doesn’t have too many patients to consult. Now, as all the Ukrainians are living through the most dreadful period of their lives, in most cases she works with shock traumas. Not everyone today has an opportunity to get professional help, so Valentina spends a lot of time developing self-care checklists, and hopes that in the near future she’ll be able to help more people directly through live contact. Valentina advises refraining from building long-term plans. Instead, she suggests everyone to follow three major goals: SurvivingEnsuring the safety of your childrenConstantly evaluating the environment and adjusting your plans accordingly. Staying strong Psychologically stable people find it easier to keep up with all the pressure, so if you managed to achieve this level of stability before the war started—you’re a lucky one. The self-care techniques Valentina shares with her customers are also of great help. What also helps Valentina stay strong is the incredible support of her Ukrainian and international friends, as well as the sense of responsibility for the fate of her son and other family members. Communicating with people, living through my feelings, and letting myself cry. My work. My faith in our common victory. The pride I feel for all the Ukrainians. The vast international support. It all helps me carry on. When the war is over When the war is over, Valentina will immediately call her nearest and dearest to tell them how much she loves them. She hasn’t been able to get through to some of them for a couple of days now. Angelina, Officer’s wife ?‍?? Angelina is a wife of an officer who is now fighting for the future of Ukraine. He was in the military before the war started, so when Russia attacked, Angelina’s husband was among the thousands of brave souls immediately impeding the advance of the Russian troops. Staying strong Even though it’s hard to keep in touch with your family at the time of war, Angelina’s husband regularly calls and texts her—not as frequently as before, but regularly enough to let his family know he is ok. This is what allows her to stay strong. When the war is over When the war is over, Angelina and her little son will finally see their husband and dad. Hugging her family under the peaceful sky is all they desire. 7427 views Written by Svetlana Shchehel Svetlana is the Head of Content at SE Ranking. Her interests span across digital marketing, SEO, and translation. She regularly shares her expertise on the SE Ranking blog and across various marketing media. Svetlana believes that complex notions can be explained in plain words and loves creating immersive stories. Svetlana spends most of her evening hours learning new languages, planning memorable trips, and petting her cat.",
  "headers": [
    {
      "level": "H1",
      "text": "The Female Faces of the War in Ukraine"
    },
    {
      "level": "H2",
      "text": "Evgenia, Military Officer ??"
    },
    {
      "level": "H2",
      "text": "Alona, Pharmacist ???‍⚕️"
    },
    {
      "level": "H2",
      "text": "Eugenia, Volunteer ?⛑"
    },
    {
      "level": "H2",
      "text": "Olga, Mom of a 4-year-old and a baby ??‍??"
    },
    {
      "level": "H2",
      "text": "Anna, Doctor ??"
    },
    {
      "level": "H2",
      "text": "Victoria, Expecting Mother ??"
    },
    {
      "level": "H2",
      "text": "Svitlana, Lab Technician ???‍⚕️"
    },
    {
      "level": "H2",
      "text": "Valentina, Therapist ??"
    },
    {
      "level": "H2",
      "text": "Angelina, Officer’s wife ?‍??"
    }
  ],
  "author": "Svetlana Shchehel"
}