{
  "url": "https://seranking.com/blog/google-trends-for-seo/",
  "slug": "google-trends-for-seo",
  "title": "How to Use Google Trends for SEO Insights That Make a Difference",
  "description": "Take a guided tour of Google Trends to learn how it can help you with keyword research, content marketing planning, and location targeting.",
  "content": "Blog / SEO Strategy / How to use Google Trends to enhance your SEO strategyHow to use Google Trends to enhance your SEO strategy Written by Svetlana Shchehel Sep 15, 2022 17 min read Okay, let’s just start right away by ripping off the bandaid. I won’t say you can’t сreate content based on whatever topic comes to mind, but that’s a gamble-and-a-half. It just isn’t a solid business approach for managing your website and other business profiles. All of your content ideally should be backed by research (especially SEO-related research), and it’s more difficult to do this without using special online tools that give you access to different kinds of data. One of these tools is Google Trends, which can reveal what people around the world are interested in. So, without further ado, let’s dive into what Google Trends is and how to use it for SEO and content creation. What is Google Trends? Google Trends is a free tool that shows which topics are trending on people’s minds around the globe at a given time. This tool presents how popular a certain search query is, it’s relative search volume with its dynamics and from which locations it generates the highest interest. Google Trends spots all kinds of events, ranging from big to small, global to local, and everything in between. It knows that every four years the entire world rushes to discuss the Olympics for about two weeks. It also knows that the “climate strike” term Greta Thunberg used in her ardent speech at the UN was on everybody’s lips for an entire week after the summit. Google Trends has two primary tabs, Explore (mainly for keyword research) and Trending Searches (can also be useful for finding trending topics). There is an additional tab, Year in Search, which is a brief overview of the popular searches of the last year. How does Google Trends work? It analyzes samples of search data to measure user interest across various topics and then conveniently presents it as a graph. The Google Trends tool stores tons of data, even going back as far as 2004. Ever since the search giant’s major expansion in 2015, all of its stored data has been updated in real time. So the tool actually shows trending queries and topics on Google along with additional data. The best part is that Google Trends is readily available to everyone – you don’t even need to create an account like you would with Google Analytics or Google Search Console. Still with me? Then let’s go even deeper to find out how to get the most out of Google Trends. Don’t worry. I’ll guide you through it step-by-step. With Google Trends, you can get valuable insights into your customers’ interests on a global scale and understand how to use these insights for both keyword research and content creation. There are numerous ways to utilize Google Trends. One of the most straightforward ways to use Google Trends is to identify the top-performing keywords and incorporate them into your website for better SEO. By using a dedicated keyword tracking tool, you can easily monitor your SEO progress and make improvements accordingly. I’m positive that with the help of Google Trends, you’ll find plenty of opportunities to support your SEO and marketing endeavors, regardless of the business you’re in. How to use Google Trends’ Explore tool for keyword research Google Trends is one of basic tools for keyword research. While it’s not very sophisticated and probably not the best for SEO keyword research, it still provides valuable data on what people in a specific country search and how that interest changes over time. Let’s start with Google Trends Explore’s functionality, which reveals popular search queries as well as additional information. Google Trends’ Explore tool for new keyword opportunities The Explore section is arguably the most useful tool for keyword research with Google Trends. It’s accessible via the left sidebar, holding information on all search queries whose search volume is higher than zero. You’ll definitely find some keyword ideas here. Finding queries similar to the seed keyword To get started, enter the seed keyword into the search box at the top of the Google Trends interface and find the Related topics and Related queries tabs at the very bottom of the Explore section. Here, you can switch between Top and Rising modes. In the first case, you’ll see the most popular search queries and their interest score, 100 being the highest point of interest and 0 being the lowest. The second mode, Rise, shows search queries with the biggest increase in search frequency. Normally, you will see here the percentage of a keyword’s growth where its current state is compared to a previous time period. Oftentimes, you will notice that the percentage is replaced with the word “Breakout” in Google Trends. This means the keyword grew by over 5000% during that period of time. You can use different filters to get the most relevant results: When entering your search query into the search box, you can choose whether to discover it as a topic/category or as a search term. It’s better to go for the first option because you may otherwise get some non-relevant keyword suggestions. For example, if you choose to discover fashion as a search term, and not as a topic, keywords like A Christmas in Royal Fashion (which is a film name) will pop up among the related topics. Another option to consider is location—you can search worldwide or in a specific country. For instance, if you have a small local company in the UK, you can check what is trending in your region. You can also pick the time span that works best for your query. By default, Google Trends analyzes the last 12 months, but there are plenty of other available options that range from “past hour” to “since 2004”. For our fashion topic example, you’ll want to get insights into recent news, which means you should choose a time span between the last couple of hours and a week. You may also restrict your search to a certain category or subcategory from the suggested list. You have 25 categories with multiple subcategories to choose from. To make your keyword research a success, be creative with your seed keywords. You can start with a broad term like fashion, but you’ll have to be more specific and explore some narrower terms to get good topic ideas. For example, fashion media often write about high-end expensive designer clothing, so exploring the term haute couture is a good idea. Getting ideas with no seed keyword With Google Trends, you can even explore search terms that aren’t related to any topic like “how to” or “what is” to get keyword ideas. Use the category filter to specify the (sub)category you’re interested in and find a list of new trending queries and topics relevant to your niche. This is something no other tool offers because traditional keyword research solutions require you to be more specific from the get-go. Spotting time-sensitive keywords vs finding evergreen topics Another undeniable benefit of Google Trends is that it pins down the search terms whose search volume spikes and then rapidly goes back to zero in under a week—like names of new fragrances presented by fashion houses. Traditional keyword research tools usually don’t update their databases in real time, which means they may not have any data on time-sensitive keywords. Google Trends, therefore, is like an extra pair of eyes that helps you see keyword opportunities you might have otherwise easily missed, like fast-moving trends or popular how-to queries. Having razor sharp vision like this is key if you run an SMM campaign and need to stay on top of trends. Meanwhile, for SEO keyword research, Google Trends should be an additional way to find content ideas but should not replace traditional keyword research tools. Our SEO Keyword Generator is one of those tools. It helps you discover long-lasting topics and to build a solid keyword list that can later be clustered. This tool provides you with essential data to optimize your page for search intent, find promising focus keywords, and check SERPs for any needed keyword. DO KEYWORD RESEARCHEnter a search term and find untapped keyword opportunities to make your site more visible in search.Analyze You can start your traditional keyword research with our Keyword Tool by entering your seed keyword, choosing the location and then getting keyword ideas with essential data like search volume and difficulty. Once you’re done, use Google Trends to get vast insights to expand or clean your keyword list. Analyzing several keywords at a time Another unique feature offered by Google Trends is the opportunity to analyze several keywords simultaneously. If you have several promising keywords to choose from and you can’t decide which one to take on, you can compare them side by side and pick the one showing a more positive trend. In the example below, it looks like the trend is changing in favor of the “drone camera” keyword. Besides, you can also use the feature to learn the volume of traffic you can expect to get from a new keyword. Just take the keyword you rank for that already brings you traffic and compare it to a new search query. That way, you can filter out keywords that cannot potentially bring you any traffic. Subsequently, you can add them to a dedicated Google keyword rank checker and keep track of their performance. Analyzing the keyword popularity curve You only want to take on keywords that enjoy stable public interest. To check if this is the case, enter the keyword into the Google Trends search box and check the Interest over time graph. In addition to validating new keywords, the graph can also be used to check up on the keywords you’re currently targeting. If you noticed that some keywords began bringing in less traffic at one point and that this downward trend still persists, chances are their days of glory are coming to an end. Check the popularity graph to see if your keywords really are losing public interest. If so, you’ll have to look for new keyword opportunities. Sometimes you may want to use Google Trends to see the bigger picture. You may encounter a “keyword unicorn” every now and again, which is a keyword whose popularity once skyrocketed but soon went back to nearly zero. Normally, you’d want to drop these keywords, but sometimes what seems like a unicorn may turn out to be a seasonal keyword. So, if you suspect this to be the case, you’ll have to go to Google Trends to check this out. Staying on top of seasonal fluctuations. To analyze seasonality, change the default time span set in Google Trends from 12 months to 5 years. This is so you can spot if the surge in a keyword’s popularity occurs every year at a particular time. Seasonal keywords aren’t useless like keyword unicorns, so you can go ahead and keep them on your list. However, you’ll have to treat them differently than regular keywords and plan your marketing campaigns according to their seasonal nature. Use Google Trends data to understand when exactly a keyword’s popularity starts growing. For instance, everybody knows that costume rentals are searched for the most around Halloween and people need summer shoes for, well, summer. But with Google Trends, you can get sharper data. It will show you that people start looking for Halloween outfits at the beginning of October, and the “summer shoes” keyword starts to get more searches in late spring with the peak observed at the end of May/beginning of June. To get the most relevant results, be precise in your wording. Try to use the search terms your customers or readers use. So if you’re selling summer shoes and not writing a fashion column about shoe trends, just go for the “buy summer shoes” keyword. Identifying the points when the curve of interest starts growing can help marketers plan and start their campaigns at the right time. A shoe shop, for example, can start promoting summer shoes on Facebook at the beginning of May, meaning they need to adjust their content plan and have all the texts published earlier on in April. Publishing content before the seasonal interest in a topic starts growing will also give a business time to build some useful backlinks. Updating cornerstone content before seasonal peaks is also a good idea because both users and Google value fresh content. If let’s say you run a travel blog and you have a post on a trip to Brazil during the Carnival, it makes sense to update it in January when the interest toward the topic starts growing. Picking the best region to target When you assess a keyword’s popularity using traditional keyword research tools, the data you get is the average for the country you’re analyzing. Google Trends is unique in this regard because it gives you a chance to observe how the interest in your topic varies across the country or even across different cities of any given region. You’ll find the Interest by subregion section right below the Interest over time graph. Here you can check which regions of the country (states for the US) show more interest in the topic. You can click on every subregion mentioned in the table to narrow down the location and further see from which cities within the state/region the searches come from. If your service is not location-dependent—so let’s say you sell CRM software—you can use Google Trends to determine that your product is in greatest demand in Washington, NY, and Boston. You can then try location-based advertising to target these regions regardless of where you’re physically located. This feature is also useful for businesses whose physical location is irrelevant, but who want to promote location-dependent services. For example, maybe you want to start a review website that will get income from affiliate programs offered by yoga retreats, and you need to find out where these kinds of centers are in greatest demand. Google Trends will prompt you to partner up with rehabs in D.C., Vermont, Colorado, and Hawaii. Understanding in-demand type of content You can also use Google Trends for marketing or SEO tasks like identifying the best content type. By default, Google Trends uses web search data when analyzing search terms. But this tool also contains data from Google’s image search and YouTube, helping you determine which content type is more popular among users. Some keywords can produce better results when paired with the right form of content—like creating a video for your YouTube channel instead of writing another blog post. If you feel like the search term you are interested in can make for both a good blog post and a video, take a look at its trend curve under the web search tab and then check out YouTube’s search results. Go for the one that looks more promising or create both a blog post and a video if the query is equally popular in web search and on YouTube. You can also check if a keyword is trending on Google Images. If this is the case, consider creating an infographic or an explanatory image on the topic. It will help you stand out in Google’s image search and can get you a lot of clicks to your website. Trending Searches section for pressing topics to cover in your niche Another way to use Google Trends for research is to explore Trending Searches, staying on top of all newsworthy events relevant to your business niche. If a story has recently made the news, you’ll definitely be able to find it in the Trending Searches section of the tool, which, by the way, can be accessed from the left sidebar. This section contains two tabs, namely Daily Search Trends and Realtime Search Trends. The Daily Search Trends tab shows 20 of the most searched for keywords on the current day, the previous day, and so on. Just press Load more at the bottom of the page to view historical results. You can also expand the search term you are interested in to get detailed data, as shown below. Next to every popular search term, you’ll find its search volume and related news pieces. This means that Google Trends doesn’t just tell you which topics are currently making the news, but also provides you with plenty of context. You can to check out articles published by different media to see which events sparked people’s interest in a given keyword. For example, an actress received a prestigious award and people started Googling her name. Along with the article titles, you can also see exactly when they were published. If the story was presented a while ago, make sure it hasn’t yet lost its appeal before producing a similar piece of content. To spot trends that are just emerging, go to the Realtime Search Trends tab. Here you will find stories that were published just a few hours ago. When expanded, each search term comes with a graph that shows if the interest in the news is still growing or already fading out. Closing thoughts Most SEO specialists occasionally use Google Trends to check how collective interest in a keyword changes over time. Still, few of us use this tool to its fullest potential, which is a real shame because a properly executed Google Trends analysis can help you gain precious insights and even make some game-changing adjustments to your SEO strategy. I hope that some of the tips I shared in this post will now become a part of your regular SEO routine. Now that you’ve familiarized yourself with all of the sections and filters Google Trends has, you can come up with your own ways to use its data to perform a successful SEO analysis. Also, don’t hesitate to share your thoughts and ideas in the comments section below! I’d especially love to know which Google Trends features you use the most. Content Marketing Keyword Research Website Promotion 5942 views Written by Svetlana Shchehel Svetlana is the Head of Content at SE Ranking. Her interests span across digital marketing, SEO, and translation. She regularly shares her expertise on the SE Ranking blog and across various marketing media. Svetlana believes that complex notions can be explained in plain words and loves creating immersive stories. Svetlana spends most of her evening hours learning new languages, planning memorable trips, and petting her cat.",
  "headers": [
    {
      "level": "H1",
      "text": "How to use Google Trends to enhance your SEO strategy"
    },
    {
      "level": "H2",
      "text": "What is Google Trends?"
    },
    {
      "level": "H2",
      "text": "How does Google Trends work?"
    },
    {
      "level": "H2",
      "text": "How to use Google Trends’ Explore tool for keyword research"
    },
    {
      "level": "H3",
      "text": "Google Trends’ Explore tool for new keyword opportunities"
    },
    {
      "level": "H4",
      "text": "Finding queries similar to the seed keyword"
    },
    {
      "level": "H4",
      "text": "Getting ideas with no seed keyword"
    },
    {
      "level": "H4",
      "text": "Spotting time-sensitive keywords vs finding evergreen topics"
    },
    {
      "level": "H3",
      "text": "Analyzing several keywords at a time"
    },
    {
      "level": "H3",
      "text": "Analyzing the keyword popularity curve"
    },
    {
      "level": "H3",
      "text": "Picking the best region to target"
    },
    {
      "level": "H3",
      "text": "Understanding in-demand type of content"
    },
    {
      "level": "H3",
      "text": "Trending Searches section for pressing topics to cover in your niche"
    },
    {
      "level": "H2",
      "text": "Closing thoughts"
    },
    {
      "level": "H2",
      "text": "You might be interested"
    }
  ],
  "author": "Svetlana Shchehel"
}