{
  "url": "https://seranking.com/blog/google-local-pack/",
  "slug": "google-local-pack",
  "title": "Google Local Pack SEO Guide",
  "description": "Want to improve your business’s visibility in local search? Discover the benefits of the Google Local Pack and learn how to get your company to rank in it.",
  "content": "Blog / Niche SEO / Google Local Pack:A step-by-step guide to getting rankedGoogle Local Pack:A step-by-step guide to getting ranked Written by Yevheniia Khromova Reviewed by Olena Karpova May 10, 2023 21 min read Whenever you search for a local service online, Google shows a map on the organic SERP results without requiring you to click again. This block is called Google Map Pack, and it’s one of the most eye-catching features on the SERP for local searches. As more people search locally, ranking in Map Pack becomes more important. Surveys show that 21% of customers use the Internet to search for local businesses daily, and 35% do so multiple times every week. It also showed that 59% of customers prefer to visit shops to see products they’re interested in, even if they plan to buy online. This is why it’s important to make it easy for online clients to locate your physical store. Businesses with services in a specific territory, including plumbing, repair, and delivery services, are affected by the Google Local Pack. So are local businesses like restaurants, dentistries, and hair salons. Given the Local Finder’s placement on the first SERP, we tend to skip the organic results. The block gives us all the info we need. Read on to find out what the Local 3-Pack is and how to get ranked in it. What is the Google Local Pack? The Local 3-Pack is a feature on the SERP that’s shaped like a map and displays places related to your query. It also displays a 3-point list of businesses with their NAP data (name, address, phone, etc.). This feature typically appears on the SERP when a user includes the local intent or service in their search query. It also appears when the user specifies the location by inputting something like “barber shop near me” or “best sushi near in [city].” Results from queries like these typically display nearby businesses that match the search query and are located close to the user’s current location. This feature also goes by some other names you’ll come across in this article, including: Google Local Pack Local 3-Pack Google Map Pack Snack Pack This is what the Google Map Pack looks like on desktop and mobile: Apart from filters and the map itself, the Google Map Pack displays a list of businesses with their NAP data, their review ratings, office hours, and photos. Users can call the company, view its website and get directions. Google’s Local Listings are constantly evolving and gaining new features to enhance the user experience. As technology advances, we can expect to see tons more features added to Google Map Pack. Marketers must find effective ways to optimize these elements properly. For hotels and motels, you’ll see a block that differs slightly from the Google Local Map Pack. It includes prices, user ratings, and short descriptions, but no links to websites or directions. Instead, users can check the business’s availability for certain dates and select the number of guests. Browsing hotels on mobile is now easier thanks to Google’s recent updates. Each location can be viewed in a story format, allowing you to swipe through photos, save the location, learn more about the area, and read client feedback. If you’re searching for attractions during your trip, Google Local Pack also suggests other activities to discover in the same location. So, the Local 3-Pack, despite being the most popular, is not the only feature you’ll see when searching for a localized business. Google’s Local 3-Pack uses an internal ranking system. Just listing your business on the map is not enough to get it to the top results in the pack. And if your business lacks clicks and comments, it may disappear from the block altogether. The Google Map Pack is a highly visible and attention-grabbing element, making it important for you to know which of your keywords trigger its display. How is the Google Local Pack different from organic SERPs? The Google Local Pack and organic search results are both parts of the search engine results page. But the Local Pack usually appears above the organic results, always takes the lion’s share of the screen, and is the first thing that catches the user’s eye. Here are some differences to consider: The Local 3-Pack is location-based. This means it appears when the user searches for something with local intent, displaying results that are geographically close to the user’s current location or the location specified in search. Organic results are relevance-based, showing results based on how well they match the user’s search query. The search query here can also have navigational intent, but the search engine will also consider other factors such as expertise, authoritativeness, and trustworthiness, also known as EAT. Recently, Google added another E to this acronym, so now it’s EEAT. This new letter stands for experience, as in user experience and the author’s first-hand experience on the topic. The Local 3-Pack includes a map and shows business information, while organic SERPs can display various content types such as news articles, videos, and images. It doesn’t show a map but it does list links leading to different pages relevant to the user’s search query. The Local 3-Pack includes a limited number of results, while organic SERPs can display many results pages. The Google Local Pack and organic SERPs also have contrasting ranking factors. Users will need to consider these when optimizing their local profiles and websites. We’ll cover this in one of the following sections, so continue reading to find out more. How to track the Local Pack for your keywords To see if your website is featured in Google’s Local Pack search results for your main keywords, you can use special SERP feature tracking tools like our Local Rank Tracker. We’ll also show you how to use SE Ranking’s search engine ranking checker. This tool is straightforward to use and can track both organic and local results anywhere, even at the zip code level. First, go to your project’s settings and make sure to include Google Local Pack results for position tracking. It’s better to display them separately from organic results. Also, don’t forget to enter your business name and phone number. From here, go to the Rankings report in the lefthand menu to see the table with keyword rankings. Google Local Pack data will be presented there in two forms: You can see where your website ranks in both the local pack and organic search for each keyword you’re tracking. Arrows show whether your positions have decreased or increased over time, helping you monitor your progress in Google Local Pack. Each keyword you’re tracking will also have a column with SERP features, including a map marker icon that represents the Local Pack. If your website is present in the block, the icon will turn blue. Note: The 14-day free trial gives you access to all of SE Ranking’s available tools and features, including Rank Tracker. If you see that the Local Pack is being displayed for your targeted keywords, get ready to fight for a spot in it. Why the Google Map Pack matters for SEO If your business serves customers locally, using all the benefits of the Google Map Pack is crucial for your local SEO. It can help you appear at the top of search results even if your website hasn’t yet been featured among the top 10 organic results. Here are a few reasons why the Local 3-Pack is vital for SEO: Increased visibility and traffic. The Google Map Pack appears at the top of the search results page, so businesses that show up there get tons of visibility. When people are looking for local products or services, the Map Pack is often the first thing they see, which means businesses that appear there are more likely to get clicks and traffic. In fact, 42% of local searchers click on the results appearing in the Google Map Pack. Elevated trust and credibility. Listings in the Local 3-Pack include ratings and reviews from other customers, which helps businesses build trust and credibility with potential customers. This is really important for getting people to choose your business over others. In fact, recent research by SOCi shows that GBP conversion improves by 2.8% for every 10 new reviews. Greater local relevance. The Google Map Pack is designed to provide users with local and relevant results. If you serve a particular area, your business is more likely to show up in the Map Pack for people searching for products or services in that area. This can be a huge advantage for businesses that rely on local customers. Enhanced mobile-friendliness. The Google Map Pack is optimized for mobile devices, so businesses that appear there are more likely to get clicks and traffic from people using their phones to search. Local SEO ranking factors Google uses a combination of relevance, distance, and prominence to find the best match for a user’s local search query. Relevance refers to how well your business profile matches the user’s search, as in keywords used in GBP. Distance refers to how far the potential search results are from the location term used in the search, which can be determined by your business’s address or service area. Prominence refers to how well-known the business is, which can be assessed by analyzing client reviews and feedback. While Google doesn’t disclose the exact ranking factors for local SERPs, SEO experts and business owners can make observations over time and research the topic to identify potential factors that could impact local rankings. A notable study in this area is Whitespark’s latest release on the topic. According to feedback from experts in local search, the top factors impacting Google Map Pack rankings include: Primary Google Business Profile category. Google relies on your chosen category to understand your business’s relevance to a search query. It’s crucial to select a category that accurately reflects your products or services. Keywords used in your GBP title. Relevant keywords in your business name or title can increase your visibility in local search results and show your relevance. Make sure to avoid keyword stuffing. DO KEYWORD RESEARCHEnter a search term and find untapped keyword opportunities to make your site more visible in search.Analyze Proximity to the searcher. Google aims to provide geographically relevant results, so businesses that are physically closer to the searcher are more likely to appear in the local pack. Physical address in the city of search. Just like proximity, a physical address also contributes to geographical relevance. Removal of spam listings through spam fighting. If your competitors engage in spammy practices or create fake reviews, it can harm your local pack rankings. Remove these spam listings to improve your visibility. Another interesting finding in Local Pack SEO is the impact Google Business Profile services have on local rankings. A study conducted in 2022 found that adding more services to a GBP listing (both predefined and custom) can positively impact rankings for keywords related to the service, which was not the case in 2019. As the search engine updates and improves its algorithms, Google local search ranking factors will also evolve. Since Google doesn’t disclose its secrets, experimenting and observing can help us determine the local SEO best practices. Let’s explore what it takes to get your business featured in the Local Pack and stay there for good. How do I rank in the Google Map Pack? To optimize for the Local Pack, you need to focus on two things: preparing your Google Business Profile page and optimizing your website for local SEO, which includes local link-building. #1. Create a Google Business Profile page for your company Check to see if your business was already added to the GBP listing. Begin by typing your company’s name into the “Business name” field, and, if there is a matching business, claim it. Don’t worry if you discover that your company already has a page in GBP, as it may have been generated through data parsing from other listings. Just claim and verify your ownership. If there are no matches, you can register your company to create a new page. #2. Verify the address of your company The next step is to verify your GBP. Google offers several methods for this: Postcard Phone call or SMS Email Live video call Video recording Sometimes, you can get instant GBP verification. To do this, use the same Gmail account that you use for Google Analytics and Google Search Console when registering your business. This will automatically connect your Google accounts and verify your business location. If you have 10+ locations for your business, you can verify them all in bulk. Keep in mind that Google will choose the most suitable verification method for your business, and you can’t change it. If Google asks you to verify your GBP through a postcard, you will need to use that method. #3. Optimize your business listings After registering or verifying your business, you need to fill in information about your company on your GBP page. Each piece of info you provide can influence your business’s visibility in search results. So it’s important to carefully read Google’s instructions on how to present your business on GBP. Fill in the following fields into your account: Business name. Type in your business name exactly as it appears in the real world, without any location markers or keywords. Category. Choose a category that accurately represents your business. You can also edit it after verification. The category defines how Google will match your business to a search query, so choosing the category as correctly as possible is crucial for local rankings. If you have a Sushi place with delivery, use “Sushi restaurant” and “Sushi delivery” instead of “Restaurant” and “Restaurant Delivery”. Also, make sure not to use categories as keywords when describing the services you provide. Address. Provide the physical address of your business location without using P.O. boxes or mailboxes. Website/phone. Add this information to make it easier for users to learn more about your website and call you directly from GBP. Google research shows that 60% of smartphone users click on the Call button in GBP to contact the business directly. Business hours. Specify your regular hours of operation and any special holiday or event schedules. Based on this information, your profile will show whether your business is Open/Closed. Description. Add useful information about your business, including products and services, without misleading users or using low-quality or irrelevant content. Use keywords in your description to make it more relevant to search queries, but keep it concise. Pictures. Use images to showcase your business. They make your business look more authentic and recognizable. Unfortunately, you’re not the only one who can add photos to your GBP, so monitor this section closely to avoid duplicated photos or spam. If Google finds either, it will reject your GBP. Tags. These add relevance to your profile. Adding tags helps users identify the type of business you have. Another crucial aspect of GBP optimization is adding client reviews. These are displayed in the Local Pack, along with the contact information, and can be a decisive factor for potential customers. According to a Bright Local survey, 98% of consumers read online reviews for local businesses. Reviews contribute to your online reputation, so it’s crucial to monitor and respond to them. The SOCi survey we mentioned earlier also shows that GBP conversion increases by 4.1% for every 25% of reviews that businesses responded to. You can also enable the rating feature in your GBP, allowing users to give your business a star rating. You can also take advantage of business citations. These are descriptions of your company that may appear in business listings, such as Yelp, 2FindLocal or Yellow Pages, or in SERP Features such as Maps and Knowledge Graph. You can even find them in apps and other smart services. Business citations are a great way to add keywords and create a positive portrayal of your business. Citations are a source of backlinks and can impact local search rankings. Keep the following factors in mind: Don’t strive to publish citations in unreputable aggregators. Instead, aim for authoritative catalogs and business directories. Keep your information up-to-date and consistent throughout all your sources. Use the same NAP data on your website, GBP page, and external listings. #4. Optimize your website for local search Nearly two out of every three smartphone users are more likely to purchase from companies whose mobile sites or apps are customized to their location (Google, 2017) As we mentioned earlier, Google considers three factors in local rankings: relevance, distance, and prominence. This means that, firstly, for your website to rank high in Google local search results, it needs to be relevant (optimized) to a search query. Your business must also be located near the user who is conducting the search. And finally, your business should be well-known to customers and have high authority both online and offline. Website optimization is all about relevance, the first factor that Google considers. To make your site relevant to a search query, you must optimize not only its content but also its technical health and link authority. Here’s how to do it: Content optimization: Adding location modifiers to your semantic core is just the beginning. Your website should also include the name of the town, region, state, and district (if applicable) to associate it with a certain location. For examples and instructions, read our guide on SEO for bars and restaurants, where we explain how to do competitor research for collecting local keywords. Website SEO health: The technical condition of your site is important for crawlability, speed, mobile-friendliness, security, etc. Technical problems, especially the ones you put on the backburner, can significantly impact your website’s rankings, so it’s recommended to run website audits regularly. RUN A WEBSITE AUDITScore your website in 2 minutes. Enter any website URL to get a detailed report on tech issues and suggested solutions.Analyze Website link authority: Building up quality inbound links to your domain is essential for building link authority. When it comes to local off-site optimization, it’s important to earn links and citations from locally authoritative sources. Learn more about local outreach in this Moz article. Unfortunately, you can’t optimize your website using the set-it-and-forget-it approach. Instead, website optimization is a never-ending process of trying out new techniques and fixing bugs. The same goes for your Google Business Profile page, which also needs regular monitoring and revision. Monitor your information in Google’s Local Pack After getting into the Local 3-Pack, monitor all displayed info about your business. What’s tricky here is that anyone can edit your listing data. These edits are made as suggestions, but they can also go live without warning. Anyone can edit your business name, category, NAP data, photos, and location. This can dramatically impact your local rankings. If any unwanted changes occur, follow these instructions to fix them manually. You can also immediately make an appeal to GBP’s support team. Other than reaching out to them using standard methods, you can also tag @GoogleMyBiz in a Tweet, and you’ll get a response within 15 minutes. Another tool that you can use to manage your local campaigns effectively is SE Ranking’s Local Marketing Tool. It has many helpful features that can simplify your local listing optimization. This tool also allows local businesses to monitor their listings, manage reviews, create listings on other networks, and maintain NAP consistency. To check if there are any issues with your NAP, go to the Business Listings Tab under the Local Marketing Tool. The top dashboard shows the NAP widget, which displays the number of listings that have errors in your company’s name, address, or phone number. The tool can also analyze mistakes in URLs and duplicates. If you click on numbers in the NAP section, you’ll see the specific listings containing errors. You can also correct mistakes right from the tool. To find these mistakes, you can check the table without filters to track how well your listings are performing across various directories. This table shows all the platforms where your business is listed, the directory type, listing status, and most importantly, any errors in your profiles. You can easily spot mistakes in the URL, address, phone number, or business name. Another super useful feature within SE Ranking’s Local Marketing tool is managing reviews. Businesses can track their reviews across various directories and respond to them quickly—all in one place. Companies can take advantage of this feature to maintain a positive online reputation, showing clients how engaged and responsive they are. To use this feature, go to the Reviews tab and check each review and its status. It will show you if you read the review and answered it. The Analytics report under the Review tab shows you how your customers rate your business and where they come from, giving you a better understanding of their level of satisfaction. The Insights section shows the keywords that your clients use most often in their reviews. You can analyze how often clients use distinct words or phrases and see the average rating of reviews that contain those words or phrases. Summing up If you are a local business owner, you’ll want to do everything in your power to rank high on Google’s local SERP, and, on top of that, in the Google Map Pack. It is one of the most visible SERP features, and you can make your business appear in the block if you play your cards right. You can achieve this organically through optimizing your website and Google Business Profile listings. We hope that our local SEO tips will come in handy, and encourage you to follow them. Also, be sure to share feedback on your success to motivate other SEO enthusiasts. Bonus recap of everything about local SEO Getting into the Local Pack is impossible without taking advantage of the local SEO strategies we mentioned. But it’s also impossible to cover this complex topic in just a few paragraphs (we would need to write a whole new article!) Still, think of this article as your kick-off point from which to conquer Google’s Local Pack. To learn more about local SEO, check out Shane Barker’s super helpful infographic on it. You can check it out by pressing the button to view the full document. Now, the only thing you’ll need is patience! View infographics Google Business Profile Local SEO SERP Features 42649 views Written by Yevheniia Khromova Yevheniia is a content marketer and copywriter at SE Ranking. She is a fan of SEO, digital marketing, and content creation. Yevheniia believes simplicity is key as it helps reduce the clutter in our heads and focus on what matters. This is the principle she uses in her writing. She also enjoys cooking, learning new spices and flavors, traveling, and playing board games.",
  "headers": [
    {
      "level": "H1",
      "text": "Google Local Pack:A step-by-step guide to getting ranked"
    },
    {
      "level": "H2",
      "text": "What is the Google Local Pack?"
    },
    {
      "level": "H2",
      "text": "How is the Google Local Pack different from organic SERPs?"
    },
    {
      "level": "H3",
      "text": "How to track the Local Pack for your keywords"
    },
    {
      "level": "H2",
      "text": "Why the Google Map Pack matters for SEO"
    },
    {
      "level": "H2",
      "text": "Local SEO ranking factors"
    },
    {
      "level": "H2",
      "text": "How do I rank in the Google Map Pack?"
    },
    {
      "level": "H3",
      "text": "#1. Create a Google Business Profile page for your company"
    },
    {
      "level": "H3",
      "text": "#2. Verify the address of your company"
    },
    {
      "level": "H3",
      "text": "#3. Optimize your business listings"
    },
    {
      "level": "H3",
      "text": "#4. Optimize your website for local search"
    },
    {
      "level": "H3",
      "text": "Monitor your information in Google’s Local Pack"
    },
    {
      "level": "H2",
      "text": "Summing up"
    },
    {
      "level": "H3",
      "text": "Bonus recap of everything about local SEO"
    },
    {
      "level": "H2",
      "text": "You might be interested"
    }
  ],
  "author": "Yevheniia Khromova"
}