{
  "url": "https://seranking.com/blog/google-serp-features/",
  "slug": "google-serp-features",
  "title": "35+ SERP Features to Enhance Your SEO Strategy",
  "description": "Check out this 35+ SERP feature overview and learn how to track each one with SE Ranking. See the SERP features displayed by Google for your tracked queries.",
  "content": "Blog / Google SERP Features / Getting to Know the 35+ Google SERP Features: A Complete GuideGetting to Know the 35+ Google SERP Features: A Complete Guide Written by Maria Yefimenko Reviewed by Valerii Khomenko Dec 12, 2023 33 min read If you search on Google for specific facts and instructions, you’re most likely to come across an answer box. If you look up famous people, on the right side there will be a large block filled with information about them. Results like these are called SERP features, and they aren’t tethered to the conventional top 10 links. Let’s take a closer look at them, what they are, why they are important for Google, how to perform a SERP features analysis, and how to create SERP feature-optimized content. What are SERP features and why are they important? SERP features are the special boxes and elements that Google adds to organic results to simplify search and make the SERP more informative. Some of them contain links while others are purely informational boxes designed to provide users with quick answers. If you can rank for Google SERP features that contain links, you will get more visitors. And even if your blog post or product page appears in the 8th or 9th position in organic search results, ranking for SERP features can still land you a spot in the sun. But on the flip side, when these special elements appear above all organic listings, they have the potential to push your website to the bottom of the page. These features can influence the CTR and traffic, so it’s important to keep track of whether Google has marked your site with any of the special elements or included your page in one of the featured blocks. Check which Google SERP features your website has If you are wondering which SERP features show up for your target keywords, you can find out with the help of the SE Ranking’s Keyword Rank Checker. At the moment, the tool allows tracking 35+ SERP features. To find Google SERP features for your tracked keywords, go to Keyword Research, type in the keyword, and click on the Keyword Suggestions tab. Let’s say, you have a baking blog and want to check which keywords related to “cherry pie” can show up under recipes results. The SERP features are displayed as black icons. Here, you will see which keywords have particular features, and by clicking on Filter, you can choose only the Recipes search feature to narrow down the keyword list. DO KEYWORD RESEARCHEnter a search term and find untapped keyword opportunities to make your site more visible in search.Analyze Alternatively, go to your project >> Rankings >> Detailed. Here, the icons highlighted in blue mean that this page appears as a SERP feature. You can add this column by expanding Filters and choosing a particular Google SERP feature in the drop-down list. The icons in grey say that another page owns this SERP feature. If there is no icon at all, then there is no SERP feature for this keyword. SE Ranking also allows tracking SERP features for the keywords of your competitors. Go to Competitive Research, enter a competitor’s website, go to Organic traffic research >> Keywords. In this section, you can see which keywords help your competitors appear in the Recipes rich results. DO COMPETITIVE RESEARCHWho are your closest rivals and how do they position themselves in search? It's time to find out.Analyze There are dozens of SERP features that commonly appear in Google search results, and the number keeps growing. See the list below to familiarize yourself with the core SERP features, most of which can be monitored with SE Ranking. In fact, consider using the SERP Checker to check the search engine results page for any keyword in any geographical region. Rich results Rich results are typical Google search results that contain additional information aside from the plain URL, title, and description. Among those features are reviews, breadcrumbs, recipes, sitelinks, etc. Reviews Overview Reviews refer to the user rating of the website. They are displayed as stars added to an ordinary snippet under the page’s URL address. This feature can appear on any query if its results contain reviews. Such stars catch users’ attention and increase their trust. That’s why it’s important to encourage your customers to leave reviews about your products or services. Example How to get If you want your website to be displayed on the SERP with the rating stars, you need to add a rating form to your site. For example, you can use special plugins allowing users to rate articles in your blog. For WordPress sites, use the WP-PostRatings plugin. Google is very strict about fake reviews, so you’d better not play around with it. You can check whether the markup works appropriately by following this link. Sitelinks Overview In some cases, Google believes that additional links to the site will help users find the answers faster. Sitelinks are additional links that appear under the main URL and lead to other pages within a website. This block enriches the usual snippet with links to particular site sections or pages, allowing users to find the information they need right on the spot. This feature most often appears in return to brand- or domain-related queries, but only Google knows the details and, by tradition, prefers to keep them secret. Example How to get Google displays Sitelinks only when they believe them to be useful to people. Although you can’t directly influence Google’s decision, make sure that your site has good navigation and meaningful architecture. Breadcrumb Overview Breadcrumb is a trail at the top of the snippet that describes the website’s structure and helps users understand the site hierarchy directly from the SERP. Example How to get To include the breadcrumb trail, add structured data markup to the body of a page. You can add either a single or a multiple trail, depending on how your pages can be navigated. Recipes Overview This rich snippet contains information about a recipe, particularly cooking time, calories, ratings, and reviews. Example How to get To tell Google about your recipe, add the Recipe structured data to your page. By providing information on ratings, ingredients, preparation and cooking time, nutrition, etc., you can make your page appear in Google Search results and Google Images. SERP elements you should score for These enhanced features increase the user experience by providing an answer to a query directly on the SERP. They also contain the source URL, which ultimately results in more traffic. Let’s take a look at the most useful Google SERP features that are worth ranking for. Featured Snippet Overview The search results for popular questions may include boxes with answers—Google Featured snippets. This box displays a fragment of the page’s content that Google considers to be a concise answer to the posed question. Together with the answer, the Featured Snippet contains a link to the cited page with its headline and URL. Information in this box can be shown as a paragraph, a list, or a table. The pages present in the Featured Snippets have higher CTR than other pages on the same SERP, so making Google put your page in this box becomes an important SEO task. Example How to get Google insists that there is no way you can mark content prepared for the Featured Snippet. Nevertheless, you can indirectly affect the choice of the search engine: 1️⃣ Get your page ranked at the top of Google’s search—only pages from the first SERP have a chance to appear in the Featured Snippet box. 2️⃣ Develop and post a set of simple questions related to your product. The questions should have a concise and direct answer. For instance: how do I become an Airbnb host? does gel nail polish ruin your nails? can you just paint over wallpaper? what size running shoes to buy? how to choose a wedding photographer? how does Google Ads work? 3️⃣ Optimize your page for the query. Add a keyword (a question) to the H-tags and write a paragraph answering specifically the question (54-58 words). If it’s a what-is question, start the answer with a definition (“X is a …”). If it’s a how-to question, write step-by-step instructions (“to do X you need to follow the steps 1, 2, 3, n”). Add Sсhema.org markup. The Schema is a piece of code that marks different content elements on your page. It allows search engines to understand the structure and the meaning of your content: “itemscope” points out the object described on the page; “itemtype” identifies the category of the object (a film, a book, a software, etc); “itemprop” indicates the features of the object, and so on. People also ask Overview People Also Ask is a section with a list of questions related to an original query. An answer to a question appears when clicking a grey arrow and contains a short text extract from a page, the title of this page and the link to it. Example How to get As usual, Google doesn’t say how to make your site appear in this feature. However, if your page has appeared in the Featured Snippet it has a chance to also be displayed under “People Also Ask”. As with Featured Snippets, finding relevant question-based keywords and answering them can help. Moreover, test FAQ markup as it might help you get into this block. Discussions and forums Overview This Google SERP feature includes links to forums and different online discussions where users share their advice and experiences related to your search query. It includes links to Quora, Reddit, and similar websites. Example How to get To boost your brand’s visibility through the Discussions and Forums SERP feature, try to get more brand mentions on different forums. Avoid creating overly promotional content, as such posts can be deleted. Adding opportunities for your readers to discuss your content and share their experiences can also boost brand visibility. Consider creating forums on your website or integrating a comments section into your blog. Use the DiscussionForumPosting structured data to help Google identify these discussions better. Knowledge Graph Overview The Knowledge Graph is a special block that provides helpful information on the subject of the query. This SERP feature is hard to influence. Most often, Google takes data from Wikipedia and other authoritative sources, including some additional information that may be useful to the user. For example, if we search for “Trader Joe’s”, not only do we get information about the grocery store, but also its social media profiles. The same thing applies to commercial queries. Example How to get As always, Google doesn’t tell us how to rank for the Knowledge Graph. Presumably, there are a couple of options: Create your company Wikipedia page. If your brand has already gained some popularity, and the page meets all of the platform requirements, it can appear as the Knowledge Graph box. Join Google Business Profile Increase your brand awareness by adding as much consistent information as possible (social media, local listings) If your site has already ranked for the Knowledge Graph, add links to your social media pages, but be sure to verify them first. Datasets Overview The Datasets SERP feature assists users in finding publicly available datasets for their projects or analysis. This section contains results from Google’s Dataset Search, which taps into a wide range of repositories available on the web. Example How to get By using structured data, you can get your published data included in Google’s datasets search and featured in the SERP’s Datasets block. Just mark your pages with the Schema.org/Dataset and include detailed metadata for your dataset. Rich metadata improves the dataset’s discoverability and presentation in search results. Events Overview This Google SERP feature shows the list of events (festivals, concerts, performances, etc.) that take place in a particular location. It is shown at the top of the SERP on mobile and on the right side on a desktop, and includes the place, date, and time. Note that due to event cancellations caused by Covid-19, this feature was suspended. However, you can now see the Event box containing detailed information about upcoming events. Example How to get To make your events qualified to show up in search results, add the Event structured data. Usually, Google doesn’t require additional steps. Also, you can add new properties to help people find out the status of your event. Event schedule Overview The element at the top of the search results displays the schedule of particular events (concerts, TV shows, etc.). Example How to get With the help of structured data, search engines will see and display relevant information on your events. X (ex-Twitter) Overview A couple of years ago, Google and X (ex-Twitter) announced a partnership. Since then, the search engine began indexing every tweet and show them in the search results. You can see the featured block with the most recent messages displayed both for brand and personal queries. If a company or a well-known person actively posts tweets, this special element may appear among other organic results. Example How to get To have the same SERP feature displayed for your brand query, you need to level up your X (ex-Twitter) profile. For those who have not yet followed you, this block will show the relevance of your posts and invite users to follow you. Regular posting, follower growth, retweets are all good measures for those striving to get this SERP feature. Sports Overview The element appears when searching for sporting events and displays live scores and results, upcoming matches, and other important details. There are several formats of how this feature can be displayed. If users search for a particular team, they may see a box containing upcoming games and even links to purchase tickets. Other results may include information on the latest games. Example How to get Google doesn’t provide any information on how to get this SERP element. Jobs Overview The Jobs feature is displayed when the search query is related to a job search. It contains the position, website and company name, publication date, salary, and other related information. Example How to get To help your site appear in this section, add the JobPosting markup to your page. That way, your website will have a higher chance of being discovered. Popular products Overview Popular products or Top products is a SERP feature that comes up for queries related to product categories, such as “shampoo for hair loss” or “frying pan”. These elements are displayed in the middle of the search results. When searching for a product online, users can filter the price or a product category by clicking on the refinement bubbles. Example How to get To enable such an element, add Carousel structured data together with the needed content type (Product, Movie, Recipe, etc.) Shopping Side Bar Overview This SERP feature expands the Popular Products section by offering product filters in the left sidebar. When users input shopping-related search queries, they can select various product criteria (such as material, season, size, style, color, etc.) and find relevant products. You can also toggle this feature on and off if needed. Example How to get To have your products appear in search results with a sidebar featuring filters, add schema markup containing your product specifications to the product page. This enables search engines to display your product details on the SERP when users apply relevant filters. Find results on Overview The item is displayed as a listing carousel that offers several results picked by Google to answer the search query. When a user is looking for a particular place that is featured on a review site or an online directory, the element will appear right under the search bar. Each listing or directory contains a URL and an image. Example How to get Google displays Find results on when they consider the directories to be relevant to users. However, they don’t share how to make your site appear in this feature. FAQ Overview The FAQ SERP feature lists common questions (and their answers) related to a specific search query. It is part of a website page snippet. In fact, all answers are pulled exclusively from the same website. Example How to get For a question box to appear under the snippet, use the FAQPage structured data type. Add the question in each Question element, and add the full text of the accepted answer in each Answer element. Alternatively, you can automate this process with a CMS plugin. If more than three sites on Google’s page one use the FAQ markup, preference is given to the highest ranking ones. Questions & answers Overview The Question & Answers box displays a bar that allows users to ask questions about the location and receive an answer from users or from the owner of the business. Users can even view other people’s questions and responses. This Google SERP feature is displayed in the middle of mobile SERPs and on the right side of desktop SERPs. Example How to get There is no way to get your website to appear in this SERP feature. Paid SERP features These special elements are separated from organic listings and are displayed at the top or the bottom of the search results. You can recognize paid SERPs by their AD tag. Top Ads Overview Top Ads are paid Google Ads that typically appear above the top of organic search results. But the thing is, their placement is dynamic and highly dependent on the user’s search query. This is why they are sometimes displayed below the top of organic search results. These ads are most commonly displayed for commercial queries, such as “buy X”. The Top Ads feature can be combined with other SERP elements like Sitelinks or Reviews. Example How to get To test and appreciate all the benefits of paid search, you need to start working with Google Ads. The key thing is to define the queries you’ll use for your ad campaign. This determines the success of the campaign and the budget. If you do not know where to start, you can use our Competitive Research tool -> Organic traffic research. It will allow you to see what keywords your competitors are using for their ads and how much their ads cost. Such data will help you choose queries for your own Google Ads campaigns. Bottom Ads Overview The Bottom Ads is the same advertisement unit as the Top Ads, but located below the search results. The Top Ads are more effective—its clickability and visibility are higher than those in the Bottom Ads. However, both blocks are invariably shown on the first page of search results which is already a great benefit. Example How to get Typically, if there are both Top and Bottom Ads on the same SERP, the ads with a lower bid will be displayed at the bottom. But there are some queries for which the ads can be displayed only below the search results. Google explains this by the fact that there is the threshold bid for the Top Ads so if your bid is lower, the ad will appear only at the bottom. In addition, your ad’s position on the page is determined by the Ad Rank and its relevance to the search query. Find out how to get your ads above Google search results in this detailed guide from Google. Shopping Results Overview The Shopping Results is a special block that looks like a carousel of cards with different kinds of products. It allows users to see the searched items and compare prices directly on the first page of the search results. It applies to commercial queries, regardless of whether users specified only the goods category or a specific model. Each card contains basic information that is constantly updated: photo and name of the product, price, store where it is sold and the consumer rating. Example How to get The Shopping Results block displays products according to the contextual advertising principle—you can buy a place there. But for this, you need to have accounts both in Google Ads and Merchant Center. If most people are familiar with the first one, the Merchant Center appears to be something new for many of them. Three steps to start a campaign in the Merchant Center: Create an account and connect it with your Google Ads, confirming your administration rights to the website. Find detailed instructions on registration and requirements for launching the profile here. Prepare a feed—a list of products that you offer indicating all the necessary data. Add the feed and go through the moderation process. SERP elements from separate channels on Google Although Google has separate search channels, such as Images, Videos, Maps, and others, it still can display them on the first page of the search results. Here is the full list of such Google SERP features: Images Overview Images are also a separate Google search section and its results can be displayed at the top of SERPs for a variety of queries: product, personal, medical ones—any query that can be illustrated. Thus, images became a SERP feature: Example We get to the Image results page by clicking on the block title. Once we choose a particular picture, we’ll see its title and the source—the link to the site it is published on. How to get A picture can appear as the Image SERP feature only if it’s top-rated among all other pictures for the query. So, if you want your site’s images to appear in this block, focus on image optimization: alt tags, a proper title, optimal image size, and an SEO-friendly URL. Sometimes Google adds an image to the Featured Snippet, and what’s notable, the image can be pulled from one site and the snippet itself from another. For example: A picture appearing in a featured snippet usually is the leader of the Image search results and is carefully optimized for the query. Following the same principle, a video can also show up in the featured snippet. Video Overview The Video feature adds a thumbnail video to the snippets of the search results. Most often these results are pulled from YouTube or Vimeo, i.e. large video hosting sites. Such results are accompanied by the video’s title, its duration, description, download date and,—good to remember—the username of the person who uploaded it. Therefore, it is better to create a corporate video hosting profile and not to post branded videos from your personal account. Some videos in the SERP are displayed with timecodes. Example How to get In addition, in order to be displayed as a SERP feature, the videos must be properly optimized for the target query (title, meta description, hashtags, acceptable shot in the preview, etc.). And do not forget to add a link to your site in the video description. Top Stories Overview News is a separate search channel but its results can be displayed on the first SERP position. The Top Stories feature applies to the hot news-related queries such as “Elon Musk and Grimes” or “duplex AI”. The selection algorithm of this feature is very demanding, and only news publishers can be shown here. E-commerce blogs with a news section won’t make it into the block, but an online media that publishes unique news content has a good chance. Example How to get If you run a news media, you should definitely register it in Google News. Google has prepared guidelines both for content and technical preparations for the sites willing to be represented in the News. You can read more here. Local Pack Overview When we use location markers in queries (“near me”, Chicago, Brooklyn and so on), the organic results are usually accompanied by a Local Pack. It is a map containing address pointers and a list of up to four companies with their names, rating, and other information displayed. If you have a local business, you should most certainly add it to Google Maps. Firstly, Local Pack attracts targeted traffic. And secondly, even if your site doesn’t get into Google’s top 10 results but appears in a local pack, users will still be able to find it on the first SERP. Example How to get To let users see your company in this block, you should do the following: Register your company in Google Business Profile. Follow the link for step-by-step instructions. Choose categories for your business and be as precise as possible: the fewer categories—the better. Add the info: your company’s name, business hours, and phone number. Recheck to make sure everything is correct. In the Address field, enter the address of your business. Make sure you’ve provided correct data—the verification code will be mailed to you via regular post. You can add a menu if your business is a bar or a restaurant, or if it’s a barbershop, spa, etc. Add a concise but comprehensive description of your product or services. Gather positive reviews. Map Overview The Map appears at the top of the SERP for a specific geographic query. This element allows people to see Google Maps without leaving the SERP. You can switch between route options, modes of transport, add or remove stops, etc. If you click on the map, you will be taken to Google Maps. Example How to get If you provide passenger transportation services, you can show up in this section by sharing static transit data (e.g. routes, stops, and schedules) with Google Transit. Flights Overview The Flights element allows users to find the flights they are looking for, compare prices and options offered by different airlines. People can also use this feature to purchase airline tickets directly on the search results page. This information is collected from Google Flights. Example How to get Google doesn’t provide any information on how to get this SERP element. Hotel pack Overview This is a block that contains photos, ratings, and prices of hotels and hostels in a particular area specified in the search query. Example How to get To get this type of result, you should become a Google partner and register in Google My Business. Google uses this tool to gather hotel prices and other data related to your accommodation. Then, you need to use structured data so that the search engine could understand your content. This SERP element looks like a combination of Local Pack and Google Flights. Here, you can find the dates and indicate how many people are staying. You will find the price tags along with links to the hotels on the left and the map on the right. After clicking on the map, you will be redirected to the Google Hotel Search. Plan a trip Overview This element is located in the middle of the search results and shows a list of travel guides to various destinations. Example How to get Google doesn’t provide any information on how to get this SERP element. Google Business Profile Overview This is a local business snippet. Chances are that you have seen one of these before. It shows users the business’s name, photos, a map for clients to easily find the place, reviews, working hours, and phone number. All data is pulled from Google Business Profile. Example How to get You’ll need to create and optimize your Google Business Profile if you want to get your company featured in this SERP feature. This one appears when users search your brand name. We’ve included a brief summary of it in this section, but for more detailed information on it, refer to Google’s guide. Manage your Google Business Profile, receive comprehensive reports on existing GBP issues, and monitor rankings across multiple locations with SE Ranking’s Local Marketing tool. Location Overview This feature appears in search results for queries related to various business types. Most common are hotels, cafes, and other tourist locations. Users will see a map of the region where the place is located, along with a list of additional spots nearby that may be of interest or useful to them (you can also see these on the map). Example How to get Google doesn’t provide any instructions for getting this SERP feature. SERP features that refine search results Unlike Featured Snippets, these SERP elements start a new search instead of taking users to a website. It means that Carousel and See results about contain links to other SERPs. Carousel results Overview Carousel results, one of the most catchy Google SERP features, appear in return to general queries that involve several relevant answers, i.e. a group of results. For example: best horror movies children books best pop albums 2020 best android games When you click on a single card, you’ll see a new SERP containing results for this specific query. In other words, the Carousel may contain a link to the SERP that includes your site as well. Let’s say your article on the best Android games ranks 9th on the SERP and is featured in a Carousel. As the Carousel is the first element users see on a page, they can click on it and get on the next SERP where your website will rank higher. This would significantly increase the traffic your article could potentially get from the search. Example How to get What you need to do to get there: Rank among the top 10 results for the specific query. This query should be among the results displayed in the Carousel. For example, the keyword “retriever” belongs to the group of keywords united under the umbrella term “dog breeds”. Or “Annie Hall” belongs to a group of results for the query: “best films Woody Allen”. Or “Carrie”—to “best books Stephen King”… you get the idea. See results about Overview This element appears in the search results if Google is not sure what the user is looking for. It is usually placed under the Knowledge Graph and includes some phrases that specify the search query. Example How to get There are no known ways of getting this SERP feature. Refine by Overview A mobile search result that shows options for clarifying questions for certain searches. It commonly appears on broad searches for brands or query types. There are several refinement options such as size, type, shape, use, style, etc. Selecting an option adds the keyword to your initial query. For example, if you are looking for new skis, a search for “skis” will have a lot of refinements. After selecting the type “racing skis”, “freeride skis” etc., you can search for a particular brand. Example How to get Focus on long-tail, product-specific searches instead of focusing on the initial research stage. Quick results in a convenient format When working with particular search queries, Google can provide instant results in special boxes without showing the link to the original source. Knowledge Card Overview The Knowledge Card is a separate block above the search results that offers helpful information about the query. This SERP feature is somewhat similar to the Knowledge Graph but works a little bit differently. Firstly, the Knowledge Graph takes information mainly from Wikipedia (also from the CIA World Factbook and Freebase), while the Knowledge Card takes information from the specialized databases, such as World Bank or The Skyscraper Center. Secondly, the Knowledge Card contains dynamic elements. For example, the card from the screenshot below displays data at each point of the chart. In fact, such a block already contains comprehensive information about the query so the user rarely goes further to discover organic results. Example How to get As Knowledge Cards are powered by Knowledge Graphs, you can follow the same rules as were described in the previous paragraph. Calculator Overview The Calculator appears at the top of the SERP when users search for math queries on Google. The calculator box shows the solution and allows users to perform another calculation. If used on mobile, the calculator will show up as an Answer without search results and the organic listings will be hidden. Whereas on desktop you can also see the 10 blue links under the main answer. Example How to get There are no known ways of optimizing content for this type of SERP feature. Popular times Overview This graph shows how busy your business location gets at different times of the day. It’s based on your business’s average popularity over the previous few months and appears below your regular business info on Google Maps and Search. It’s most visible in mobile search results, although it also appears on the right side of desktop SERPs. Example How to get To determine popular times, Google uses data from users who have opted in to Google Location History. You can’t manually add this info to your location. It will only show if Google has enough visit data on your business. Destinations Overview This SERP feature appears at the top of search results. It gives users a list of places in the category they are looking for. This is especially relevant in the context of travel. For example, it will show a list of beaches or ski resorts located within the region you are searching for. Example How to get There are no known methods for optimizing content for this type of SERP feature. Google simply pulls information from various web sources, and you can’t influence it. Other features Overview The Other features elements appear before the search results for specific queries related to weather, time, exchange rates, translation of words into any language, and definitions. Example How to get Although these answer boxes are quite convenient for users, they become a big headache for companies when it comes to getting clicks. When a user sees all the information they need, there is no point in scrolling down the SERP. In this case, there is no available information on how to optimize content for this SERP feature. Copyright infringement Overview This search element informs about copyright infringement and removal of particular results from the SERP due to complaints. Example How to get Google may remove your website from SERPs because of misappropriated copyrighted content, such as movies, television, video games, music albums, music videos, and others. Final remarks First of all, Google SEPR features are not limited to the ones listed here. And it looks like Google is not stopping there and will continue transforming the SERP making it more visual and informative. Secondly, a website might not directly profit from being displayed in the featured blocks. Yes, the CTR of links appearing in Featured Snippet is higher but, for example, the AMP mark can only indirectly affect the results. The effect of each SERP feature depends on a particular business niche, and you need to check Google rankings and the features for the most important queries in order to measure it. Tracking SERP features is essential. We have already identified 35+ SERP features, and we’re continuing to monitor them as new ones arise. Stay tuned! Was this article helpful? Let us know in the comments below! SERP SERP Features 26216 views Written by Maria Yefimenko Maria is a writer and editor at SE Ranking. For the best part of her career, she has built experience and expertise in content marketing and blogging. With a particular fondness for doing research, she has written on lots of tech-related topics, including SEO, fintech, blockchain, and startups. Her passion for travel and music allows her to broaden her outlook and use her strengths – creative and descriptive writing.",
  "headers": [
    {
      "level": "H1",
      "text": "Getting to Know the 35+ Google SERP Features: A Complete Guide"
    },
    {
      "level": "H2",
      "text": "What are SERP features and why are they important?"
    },
    {
      "level": "H2",
      "text": "Check which Google SERP features your website has"
    },
    {
      "level": "H2",
      "text": "Rich results"
    },
    {
      "level": "H3",
      "text": "Reviews"
    },
    {
      "level": "H4",
      "text": "Overview"
    },
    {
      "level": "H4",
      "text": "Example"
    },
    {
      "level": "H4",
      "text": "How to get"
    },
    {
      "level": "H3",
      "text": "Sitelinks"
    },
    {
      "level": "H4",
      "text": "Overview"
    },
    {
      "level": "H4",
      "text": "Example"
    },
    {
      "level": "H4",
      "text": "How to get"
    },
    {
      "level": "H3",
      "text": "Breadcrumb"
    },
    {
      "level": "H4",
      "text": "Overview"
    },
    {
      "level": "H4",
      "text": "Example"
    },
    {
      "level": "H4",
      "text": "How to get"
    },
    {
      "level": "H3",
      "text": "Recipes"
    },
    {
      "level": "H4",
      "text": "Overview"
    },
    {
      "level": "H4",
      "text": "Example"
    },
    {
      "level": "H4",
      "text": "How to get"
    },
    {
      "level": "H2",
      "text": "SERP elements you should score for"
    },
    {
      "level": "H3",
      "text": "Featured Snippet"
    },
    {
      "level": "H4",
      "text": "Overview"
    },
    {
      "level": "H4",
      "text": "Example"
    },
    {
      "level": "H4",
      "text": "How to get"
    },
    {
      "level": "H3",
      "text": "People also ask"
    },
    {
      "level": "H4",
      "text": "Overview"
    },
    {
      "level": "H4",
      "text": "Example"
    },
    {
      "level": "H4",
      "text": "How to get"
    },
    {
      "level": "H3",
      "text": "Discussions and forums"
    },
    {
      "level": "H4",
      "text": "Overview"
    },
    {
      "level": "H4",
      "text": "Example"
    },
    {
      "level": "H4",
      "text": "How to get"
    },
    {
      "level": "H3",
      "text": "Knowledge Graph"
    },
    {
      "level": "H4",
      "text": "Overview"
    },
    {
      "level": "H4",
      "text": "Example"
    },
    {
      "level": "H4",
      "text": "How to get"
    },
    {
      "level": "H3",
      "text": "Datasets"
    },
    {
      "level": "H4",
      "text": "Overview"
    },
    {
      "level": "H4",
      "text": "Example"
    },
    {
      "level": "H4",
      "text": "How to get"
    },
    {
      "level": "H3",
      "text": "Events"
    },
    {
      "level": "H4",
      "text": "Overview"
    },
    {
      "level": "H4",
      "text": "Example"
    },
    {
      "level": "H4",
      "text": "How to get"
    },
    {
      "level": "H3",
      "text": "Event schedule"
    },
    {
      "level": "H4",
      "text": "Overview"
    },
    {
      "level": "H4",
      "text": "Example"
    },
    {
      "level": "H4",
      "text": "How to get"
    },
    {
      "level": "H3",
      "text": "X (ex-Twitter)"
    },
    {
      "level": "H4",
      "text": "Overview"
    },
    {
      "level": "H4",
      "text": "Example"
    },
    {
      "level": "H4",
      "text": "How to get"
    },
    {
      "level": "H3",
      "text": "Sports"
    },
    {
      "level": "H4",
      "text": "Overview"
    },
    {
      "level": "H4",
      "text": "Example"
    },
    {
      "level": "H4",
      "text": "How to get"
    },
    {
      "level": "H3",
      "text": "Jobs"
    },
    {
      "level": "H4",
      "text": "Overview"
    },
    {
      "level": "H4",
      "text": "Example"
    },
    {
      "level": "H4",
      "text": "How to get"
    },
    {
      "level": "H3",
      "text": "Popular products"
    },
    {
      "level": "H4",
      "text": "Overview"
    },
    {
      "level": "H4",
      "text": "Example"
    },
    {
      "level": "H4",
      "text": "How to get"
    },
    {
      "level": "H3",
      "text": "Shopping Side Bar"
    },
    {
      "level": "H4",
      "text": "Overview"
    },
    {
      "level": "H4",
      "text": "Example"
    },
    {
      "level": "H4",
      "text": "How to get"
    },
    {
      "level": "H3",
      "text": "Find results on"
    },
    {
      "level": "H4",
      "text": "Overview"
    },
    {
      "level": "H4",
      "text": "Example"
    },
    {
      "level": "H4",
      "text": "How to get"
    },
    {
      "level": "H3",
      "text": "FAQ"
    },
    {
      "level": "H4",
      "text": "Overview"
    },
    {
      "level": "H4",
      "text": "Example"
    },
    {
      "level": "H4",
      "text": "How to get"
    },
    {
      "level": "H3",
      "text": "Questions & answers"
    },
    {
      "level": "H4",
      "text": "Overview"
    },
    {
      "level": "H4",
      "text": "Example"
    },
    {
      "level": "H4",
      "text": "How to get"
    },
    {
      "level": "H2",
      "text": "Paid SERP features"
    },
    {
      "level": "H3",
      "text": "Top Ads"
    },
    {
      "level": "H4",
      "text": "Overview"
    },
    {
      "level": "H4",
      "text": "Example"
    },
    {
      "level": "H4",
      "text": "How to get"
    },
    {
      "level": "H3",
      "text": "Bottom Ads"
    },
    {
      "level": "H4",
      "text": "Overview"
    },
    {
      "level": "H4",
      "text": "Example"
    },
    {
      "level": "H4",
      "text": "How to get"
    },
    {
      "level": "H3",
      "text": "Shopping Results"
    },
    {
      "level": "H4",
      "text": "Overview"
    },
    {
      "level": "H4",
      "text": "Example"
    },
    {
      "level": "H4",
      "text": "How to get"
    },
    {
      "level": "H2",
      "text": "SERP elements from separate channels on Google"
    },
    {
      "level": "H3",
      "text": "Images"
    },
    {
      "level": "H4",
      "text": "Overview"
    },
    {
      "level": "H4",
      "text": "Example"
    },
    {
      "level": "H4",
      "text": "How to get"
    },
    {
      "level": "H3",
      "text": "Video"
    },
    {
      "level": "H4",
      "text": "Overview"
    },
    {
      "level": "H4",
      "text": "Example"
    },
    {
      "level": "H4",
      "text": "How to get"
    },
    {
      "level": "H3",
      "text": "Top Stories"
    },
    {
      "level": "H4",
      "text": "Overview"
    },
    {
      "level": "H4",
      "text": "Example"
    },
    {
      "level": "H4",
      "text": "How to get"
    },
    {
      "level": "H3",
      "text": "Local Pack"
    },
    {
      "level": "H4",
      "text": "Overview"
    },
    {
      "level": "H4",
      "text": "Example"
    },
    {
      "level": "H4",
      "text": "How to get"
    },
    {
      "level": "H3",
      "text": "Map"
    },
    {
      "level": "H4",
      "text": "Overview"
    },
    {
      "level": "H4",
      "text": "Example"
    },
    {
      "level": "H4",
      "text": "How to get"
    },
    {
      "level": "H3",
      "text": "Flights"
    },
    {
      "level": "H4",
      "text": "Overview"
    },
    {
      "level": "H4",
      "text": "Example"
    },
    {
      "level": "H4",
      "text": "How to get"
    },
    {
      "level": "H3",
      "text": "Hotel pack"
    },
    {
      "level": "H4",
      "text": "Overview"
    },
    {
      "level": "H4",
      "text": "Example"
    },
    {
      "level": "H4",
      "text": "How to get"
    },
    {
      "level": "H3",
      "text": "Plan a trip"
    },
    {
      "level": "H4",
      "text": "Overview"
    },
    {
      "level": "H4",
      "text": "Example"
    },
    {
      "level": "H4",
      "text": "How to get"
    },
    {
      "level": "H3",
      "text": "Google Business Profile"
    },
    {
      "level": "H4",
      "text": "Overview"
    },
    {
      "level": "H4",
      "text": "Example"
    },
    {
      "level": "H4",
      "text": "How to get"
    },
    {
      "level": "H3",
      "text": "Location"
    },
    {
      "level": "H4",
      "text": "Overview"
    },
    {
      "level": "H4",
      "text": "Example"
    },
    {
      "level": "H4",
      "text": "How to get"
    },
    {
      "level": "H2",
      "text": "SERP features that refine search results"
    },
    {
      "level": "H3",
      "text": "Carousel results"
    },
    {
      "level": "H4",
      "text": "Overview"
    },
    {
      "level": "H4",
      "text": "Example"
    },
    {
      "level": "H4",
      "text": "How to get"
    },
    {
      "level": "H3",
      "text": "See results about"
    },
    {
      "level": "H4",
      "text": "Overview"
    },
    {
      "level": "H4",
      "text": "Example"
    },
    {
      "level": "H4",
      "text": "How to get"
    },
    {
      "level": "H3",
      "text": "Refine by"
    },
    {
      "level": "H4",
      "text": "Overview"
    },
    {
      "level": "H4",
      "text": "Example"
    },
    {
      "level": "H4",
      "text": "How to get"
    },
    {
      "level": "H2",
      "text": "Quick results in a convenient format"
    },
    {
      "level": "H3",
      "text": "Knowledge Card"
    },
    {
      "level": "H4",
      "text": "Overview"
    },
    {
      "level": "H4",
      "text": "Example"
    },
    {
      "level": "H4",
      "text": "How to get"
    },
    {
      "level": "H3",
      "text": "Calculator"
    },
    {
      "level": "H4",
      "text": "Overview"
    },
    {
      "level": "H4",
      "text": "Example"
    },
    {
      "level": "H4",
      "text": "How to get"
    },
    {
      "level": "H3",
      "text": "Popular times"
    },
    {
      "level": "H4",
      "text": "Overview"
    },
    {
      "level": "H4",
      "text": "Example"
    },
    {
      "level": "H4",
      "text": "How to get"
    },
    {
      "level": "H3",
      "text": "Destinations"
    },
    {
      "level": "H4",
      "text": "Overview"
    },
    {
      "level": "H4",
      "text": "Example"
    },
    {
      "level": "H4",
      "text": "How to get"
    },
    {
      "level": "H3",
      "text": "Other features"
    },
    {
      "level": "H4",
      "text": "Overview"
    },
    {
      "level": "H4",
      "text": "Example"
    },
    {
      "level": "H4",
      "text": "How to get"
    },
    {
      "level": "H2",
      "text": "Copyright infringement"
    },
    {
      "level": "H3",
      "text": "Overview"
    },
    {
      "level": "H3",
      "text": "Example"
    },
    {
      "level": "H3",
      "text": "How to get"
    },
    {
      "level": "H2",
      "text": "Final remarks"
    },
    {
      "level": "H2",
      "text": "You might be interested"
    }
  ],
  "author": "Maria Yefimenko"
}