{
  "url": "https://seranking.com/blog/how-to-choose-seo-agency/",
  "slug": "how-to-choose-seo-agency",
  "title": "How to Choose an SEO Agency: Tips for Finding Real Experts",
  "description": "Not sure how to find the right team to help you with your search engine optimization efforts? Read on to get tips on picking the right SEO agency for you.",
  "content": "Blog / Digital Marketing / How to Pick an SEO Agency to Help You Dominate the SERPsHow to Pick an SEO Agency to Help You Dominate the SERPs Written by Megan Grant Reviewed by Anastasia Kotsiubynska Sep 14, 2023 12 min read So, you’ve decided you’re ready to enlist the help of an SEO agency. But before hiring someone to do the heavy lifting for you, there is still more work to be done. You have to find the right team to take over your search engine optimization strategy. In this blog, we’re going to cover: Eight important tips for researching SEO agencies and narrowing them down to your top picks. Key questions to ask them before you decide. Red flags to look out for. Let’s dive right in and talk about how to choose an SEO agency! 8 tips for choosing an SEO agency First, let’s look at a few things to consider while you’re doing research. Then, we’ll get into some need-to-know tips once you start narrowing down your final selection! 1. Define your goals and budget If all you can afford is a Kia, don’t buy a Jaguar. You might find SEO services for $200. You can also find them for $10,000. It’s safe to assume that the quality and depth of those services will be vastly different. You have to know where you stand. Begin by setting your goals. Make a list of your top three to five priorities, ranking them in order of importance. What is a must-have, and what can wait until later? Once you’ve sorted your non-negotiables, look at the budget you can comfortably spare for these goals. Alongside this, think about how you’re comfortable spending it. Would you prefer to use that budget in the form of monthly installments? What about a bigger upfront investment? 2. Do your own research Do you want to work with an agency local to your area, or are you open to casting a wider net? There are probably hundreds (and maybe more) of SEO agencies in the US, the UK, and beyond. Start with a simple Google search. Look up phrases like “top SEO agencies,” “SEO agencies in [city name],” or “best SEO agencies for small businesses.” Make a list of your top five selections. Now, it’s time to dig in a little deeper! Here are some things to consider: How do their websites look? Are they professional, easy to navigate, and optimized for mobile devices? A poor web experience is a red flag! What services do they offer? How are they performing online? Did you find them on page one of Google, or did you have to go digging? If they’re local to your area, are they showing up for multiple local search terms? What do their online reviews, ratings, and testimonials say? Do they have case studies? After you’ve narrowed it down to a few SEO agencies, here’s what to keep in mind as you start working together. 3. Understand their services and processes Many supposed SEO agencies offer illegitimate or half-baked services. Some even run a report/audit with someone else’s tool, slap their logo on it, and call it a day. This will not help you reach your goals. A good SEO agency should explain exactly what they can offer and outline their approach to helping you. They likely won’t have exact answers yet (it’s too early), but they should be able to at least give you a broad idea of how they’d approach your project. That being said, the SEO company should still provide its own insight, guidance, suggestions, and analysis. 4. Check out their case studies and reviews We mentioned this earlier but it’s worth repeating. An SEO company should have a proven track record with testimonials that they’re happy to share. Empty claims and promises aren’t enough. Ask them to demonstrate how they’ve delivered results in the past. 5. Confirm they’re an ethical company Unfortunately, not everyone you’re considering working with has your best interests at heart. It’s no secret that certain methods can hurt you, but some agencies still purchase low-quality backlinks or post low-quality content en mass. And what about negative SEO? Is the SEO company considering engaging in unethical practices against your competitors just to give your website a boost? While doing things the right way might take a little longer, it pays off. 6. Ask for a personalized approach tailored to your business goals You should be comfortable communicating with the agencies you’re considering, and that includes sharing any preferences you might have. So, if you have any specific recommendations on the best SEO tools for an agency to use, share them! As an addition to core SEO tools, dedicated SEO software for agencies, like SE Ranking, typically offer automated reporting and client seats. This allows SEO agencies to keep their customers in the loop and transparently communicate the results of their optimization efforts. This works best when the SEO agency is proactive about tailoring their approach to your business, as opposed to following some cookie-cutter protocol. 7. Watch out for unrealistic expectations and big guarantees If an agency promises you anything, run. If they promise you something huge, like getting you to rank first on the SERPs within a week, run even faster. If you’re in a vulnerable place, some agencies will take advantage of that. Don’t fall prey to unrealistic guarantees. Improving your rankings and organic traffic is a long-term commitment. A legitimate agency will not be afraid to tell you that because they will have a solid approach and an excellent history of getting their clients to rank. Questions to ask before choosing the right SEO agency You might come up with more questions based on your unique situation. However, these will help get you started: What SEO services do you offer? Will they help you with Technical SEO online? Content writing? Link-building? Get specific. How long have you been in the SEO industry? The more experience they have, the better, especially because SEO changes over time. Can you share your clientele and how you got results for them? If they have work they’re proud of, they should have no issues sharing it. How will you improve my SEO rankings? Good SEO companies can provide specific examples of how they would take action. Ask if they can give you a proposal, too. Can you make any guarantees? Spoiler alert: There are no guarantees. Do they have a refund policy? If so, what are the details? Do you stay up to date with algorithm changes? If so, how? There are major core updates a few times a year and several smaller changes in between. How do they keep their finger on the pulse? How will you keep me posted about the changes you make to my site? What’s their method of communication? Will they do things with or without your consent? How often will you send reports, and what will they contain? Weekly? Biweekly? Monthly? How do you measure SEO success? What KPIs will they track? Also, think about how this factors into your overall goals. For instance, impressions are good. Clicks and conversions are better. Do you use any black hat SEO techniques? Shortcuts and “hacks” don’t work. In fact, they’ll hurt you. More on this in a minute! Do you outsource any of your SEO projects? Make sure they’re not farming the work out to others and just taking a cut. Red flags when choosing an SEO agency Next, let’s talk about things to be on the lookout for. If you see any of these warning signs, run — do not walk — to the next SEO agency. 1. They guarantee results In the world of search engine optimization, there are no guarantees. So, if an SEO agency makes any promises about increasing your rankings or improving your organic traffic, this is a huge red flag. They cannot guarantee these things. What they can guarantee is the scope of work they’ll do, like removing broken links, adding new pages, or improving the keyword density across your site. The reason nobody can make any guarantees is that there are so many variables and moving parts at play. For instance, your SEO could be top-notch but the competition might be too strong to get into the top 10. It’s also true that nobody can know the algorithms behind search engines with 100% certainty. So, you could be doing everything “right” and still not rank! No legitimate SEO agency will make promises. Yes, this goes for pay-for-performance agencies, too. 2. Their services and pricing aren’t transparent If the agency hasn’t made it clear what you stand to gain from this relationship and how much it’s going to cost you, something’s wrong. An SEO company worth its salt should be able to say, “This is what we’re going to do, these are the intended results, and this is what we’re going to charge you for it.” Don’t be afraid to get into the nitty-gritty. If they tell you that weekly consulting calls are part of your plan, you need to know how long those calls are and how far into the future they’ll last. Transparency and clarity will be the best path, both for you and the SEO agency you’re working with. 3. They use spammy or black hat techniques Unfortunately, not everything these agencies are doing is on the up and up. Some “professionals” still use the same stale, black hat practices. And believe it or not, black hat tactics actually worked once upon a time. It was even possible to trick Google with keyword stuffing. This is when they’d use your target phrase as many times as possible on a page to get it to rank despite making the content unreadable. But some agencies would take it even further. They’d make the font super small and present it in the same color as the page’s background. Users wouldn’t see it, but search engines would. And this used to work! But it doesn’t anymore—not even close. The search engines are far too savvy. But that doesn’t stop some people from trying, just like it doesn’t stop them from purchasing low-quality backlinks and spinning content. 4. The price is oddly low You know what people say: If it sounds too good to be true, it probably is. Getting a site to rank is neither quick nor easy. That’s why some agencies charge an arm and a leg for the results they deliver. On the flip side, that means if you’re speaking with an SEO agency and their rates seem suspiciously low, something might be off. This could mean that they’re using spammy techniques, like purchasing low-quality, super cheap backlinks. 5. They can’t show proof of their previous results Do their online reviews look concerning? Fake? Do they not have any reviews at all? Is their website barren and lacking any real substance when it comes to case studies? Are you unable to find a single happy testimonial? Can’t find someone who will vouch for their work? This could be a red flag that the SEO agency you’re in contact with isn’t the real deal. 6. They have a cookie-cutter approach If you’re at the point where you’re considering hiring an SEO agency, then you’ve probably done a little SEO research yourself. And more than likely, you’ve seen these tips: Use the keyword in the title tags, URL, first paragraph, and at least one heading. Break up the text with images with optimized alt tags. Include internal and external links. You already know these things, which means that an SEO company should know…a heck of a lot more! An SEO company should be able to take you to heights you’d never reach yourself. They should devise a customized approach that fits your business, needs, and goals. If you could easily take their approach and apply it to a totally different brand, it’s time to move on. 7. They don’t have the manpower to manage your project It’s easy to provide clients with suggestions for improving rankings and traffic. But for an SEO agency, executing those recommendations, tracking their progress over time, and adjusting them as needed is an entirely different story. Remember, this process is made up of a few steps: Ideate, act, and iterate. 8. They won’t explain their thought process or how SEO works If every answer they give you seems vague or overcomplicated, then they either don’t know the answer, don’t want to explain it, or don’t want you to understand. All of these are red flags. Search engine optimization might be a very abstract concept. You’re investing in an agency’s services because they (should) know a lot more than you. It’s not about spilling all of their secrets. SEO agency’s should be able to thoroughly explain what they think you need and how they’re going to take action. Working with an agency is a partnership We know how overwhelming it can be to find the right people to work with. Do your due diligence, ask the right questions, and look out for the red flags. And importantly, take your time. When you’ve found the right folks, you’ll know it. Website Promotion 2450 views Written by Megan Grant Megan has been writing and editing professionally since 2011. Writing is, hands down, her favorite thing to do. Her chihuahua, Peanut, often steps in to help with edits.",
  "headers": [
    {
      "level": "H1",
      "text": "How to Pick an SEO Agency to Help You Dominate the SERPs"
    },
    {
      "level": "H2",
      "text": "8 tips for choosing an SEO agency"
    },
    {
      "level": "H3",
      "text": "1. Define your goals and budget"
    },
    {
      "level": "H3",
      "text": "2. Do your own research"
    },
    {
      "level": "H3",
      "text": "3. Understand their services and processes"
    },
    {
      "level": "H3",
      "text": "4. Check out their case studies and reviews"
    },
    {
      "level": "H3",
      "text": "5. Confirm they’re an ethical company"
    },
    {
      "level": "H3",
      "text": "6. Ask for a personalized approach tailored to your business goals"
    },
    {
      "level": "H3",
      "text": "7. Watch out for unrealistic expectations and big guarantees"
    },
    {
      "level": "H2",
      "text": "Questions to ask before choosing the right SEO agency"
    },
    {
      "level": "H2",
      "text": "Red flags when choosing an SEO agency"
    },
    {
      "level": "H3",
      "text": "1. They guarantee results"
    },
    {
      "level": "H3",
      "text": "2. Their services and pricing aren’t transparent"
    },
    {
      "level": "H3",
      "text": "3. They use spammy or black hat techniques"
    },
    {
      "level": "H3",
      "text": "4. The price is oddly low"
    },
    {
      "level": "H3",
      "text": "5. They can’t show proof of their previous results"
    },
    {
      "level": "H3",
      "text": "6. They have a cookie-cutter approach"
    },
    {
      "level": "H3",
      "text": "7. They don’t have the manpower to manage your project"
    },
    {
      "level": "H3",
      "text": "8. They won’t explain their thought process or how SEO works"
    },
    {
      "level": "H2",
      "text": "Working with an agency is a partnership"
    },
    {
      "level": "H2",
      "text": "You might be interested"
    }
  ],
  "author": "Megan Grant"
}