{
  "url": "https://seranking.com/blog/inside-google-sge/",
  "slug": "inside-google-sge",
  "title": "Google SGE: Everything SEOs Need to Know at This Point",
  "description": "Learn how Google's AI-powered search looks and operates as well as how the rollout can impact the SEO industry.",
  "content": "Blog / SEO Industry News / Inside Google’s SGE: Uncovering the Beta Version of AI-driven SearchInside Google’s SGE: Uncovering the Beta Version of AI-driven Search Written by Svetlana Shchehel Reviewed by Anastasia Kotsiubynska Mar 04, 2024 26 min read On May 10, 2023, during the annual I/O developer conference, Google announced that it was finally ready to reimagine the traditional search experience using generative AI. It was expected to launch in December 2023, but remains in beta mode, with no disclosed date for full-scale roll-out. Following Google’s SGE announcement, we began working on our new SGE snippet detection feature that would function with the new search. We used it to investigate the nuances of SGE, conducting two studies (November 2023 and January 2024). In this article, we’ll share our findings, compare them side by side, and address some SGE-related concerns held by SEOs and marketers. What is Google SGE? Google SGE (Search Generative Experience), is a new type of search experience where users can interact with generative AI. AI answers search queries directly in the SERP as SGE snippets or AI-powered overviews. Users can continue the conversation with AI in a special chat. SGE is powered by a variety of LLMs, including MUM and PaLM2. It can handle more complex search queries and pinpoint websites that validate its answers. It works closely with Google’s ranking system to ensure useful, trustworthy results. Insights from SE Ranking on the SGE snippet Understanding the new AI-powered search works requires regularly examining SGE snippets and studying Google’s changing patterns. This is precisely what we did. Let’s start by going over our most recent results and then compare it with results derived from our previous research. January 2024 SGE research results In January 2024, we used SE Ranking’s SGE detection feature to analyze 100,013 keywords from 20 different niches. We chose keywords with different search intents, search volumes, and word counts. We ran a one-time check on January 30, 2024, from the US (New York) region. We discovered that a significant portion of keywords (around 64%) either display an SGE answer directly in the SERP or present a clickable “Generate” button that produces an answer. We also noticed that long-tail keywords are more likely to trigger SGE snippets. SGE answers are fairly long and in-depth: The average length of the text within an SGE snippet is about 3,485 characters. Expanded SGE answers typically include 8 content links. The highest number of post-click links in an SGE snippet was 144 links. We also found out which sites SGE snippets link to: 85.5% of SGE snippets reference at least one domain from the top 10 organic search result. Most SGE snippet links go to Quora, Google Maps, and Wikipedia. SGE snippets link to websites with many referring domains and associated keywords. The Food and Beverage, Business, and Relationships niches get the most SGE snippets. This contrasts with News and Politics, Insurance, and Finance, which are categorized as YMYL. The former are more casual topics. Google is more cautious when generating AI-powered responses for queries from YMYL niches. We also examined Google ads in the new AI-powered search and noticed that they appeared with text-based SGE snippets 72.8% of the time. Google AI Overviews Study by SE RankingDownload our research findings for exclusive insights and sign up to SE Ranking’s news and SEO tips digests!Next step You’re all set!Click the link we sent you in the email to confirm your emailand get AI Overviews Research by SE Ranking The first research results: Contrasting past and present findings In November 2023, our team analyzed 100,000 keywords over 30 days, examining 2 million SERPs using SE Ranking’s SGE tracking feature. Our research showed: Only about 4% of keywords did not trigger SGE snippets in search results. And no dependency on search intent was observed. When comparing the results of the two studies, we see a decrease in the overall presence of SGE snippets from 90% to 64%. This suggests that Google has become more selective when offering AI-powered responses. However, the keywords we analyzed during the last study were different from the keywords analyzed in the study prior. This could explain the difference in values. The length of SGE answers in our first study varied a lot: The shortest answers contained 634 symbols The average length was 4,000 The longest answers extended up to 377,000 while including all expanded dropdowns. Both studies show that Google tends to provide users with detailed responses to search queries. As for the links featured in the SGE snippet, our first research study showed that the average number of links to webpages incorporated in SGE snippets per search was 28. However, only 45% of them appeared in the top 10 organic search results. We’ve also discovered that, on average, 86% of links change for the same search query during a month. The most common number of links per SGE snippet in the second round of our research is 8. However, Google links in SGE snippets now more commonly link to top 10 organic search results, increasing from 45% to 85.5% of cases. Based on the results of both studies, we can agree that SGE integration will dramatically change the SERP’s architecture and operation, causing shifts in organic traffic patterns. How to get access to SGE through Search Labs The new search, called SGE (Search Generative Experience), is available for testing in Google’s Search Labs, which is a dedicated testing environment introduced by Google on May 10, 2023. This was the day Google revealed its ambitious plan to transform search with the help of AI. Currently, Search Labs and SGE are available in 120+ countries and territories. The new search also supports 7 languages. It runs on both Chrome desktop and in the Google App for Android and iOS. Many of the insights we will provide in the following sections are based on the information shared by early adopters of SGE. A special thanks to Lily Ray, Barry Schwarz, Kevin Indig, Aleyda Solis, Brodie Clark, and Cyrus Shepard for all the observations they generously highlighted in their posts and articles. How SGE differs from the current Google SERP layout A major thing that makes SGE stand out is the interactive AI-powered snippet at the top of the SERP. It features an answer to the user’s query and a carousel of websites that SGE used to corroborate the response, with three websites visible by default. The snippet may take a few seconds to generate a response to your query as the AI algorithms are at work. The snippet comes with a vibrant background and can vary in color, potentially included in shades of red, green, blue, lilac, etc. You have an opportunity to ask follow-up questions. Sometimes—like in the example above—the snippet already includes ready-made follow-up ideas. In other cases, Google may not provide any pre-populated ideas, but you can always hit the “Ask a follow up” button. While the snippet includes links to the websites used to corroborate its response, some SEO specialists reported that SGE isn’t very good at source attribution. We’ll cover more on that later. And unlike Bing, SGE doesn’t clearly indicate the sources of all the cited information. For comparison, here’s what Bing does: At the same time, when you switch to the expanded mode, the source attribution improves: The length of SGE answers also varies a lot. The data we collected during our first SGE research study revealed that the shortest answers had 634 symbols, the average length was 4,000, and the longest answers were up to 377,000 characters. All answers included expanded dropdowns. Our most recent research revealed a slightly shorter average SGE snippet text length of 3,485 characters. But Google still generates detailed answers across topics, hiding some in dropdowns. AI-generated responses may occupy a relatively moderate amount of the SERP real estate leaving plenty of space for traditional blue links, especially when the full snippet is hidden under the Show more button. Without switching to full-screen mode, these moderate-sized snippets can occupy the whole first screen, and the temptation to hit the Show more button may outweigh the desire to scroll down. In many cases, the snippets can become quite large, featuring a text response and multiple products that SGE deems relevant to your request. Also, if you ask a follow-up question, the SERP will show both generated snippets during your conversation, taking up even more SERP space. Generative AI snippets vary depending on the type of search query, and one can draw parallels to traditional SERP features: Informational searches trigger snapshots similar to featured snippets. Local searches results in generative AI producing a response formatted similarly to a local pack. Ecommerce keywords prompt Google to showcase various products, resembling product carousels. Regardless of search type, AI snippets include a carousel of sites in the top-right corner. The three visible links will probably get the lion’s share of traffic. The difference between various snippet types lies in the presentation of the AI response and extra details featured in the snippet, such as ecommerce products, photos, reviews from GBP, maps, etc. Now, let’s briefly explore each major type of AI snapshot you may encounter: General informational queries General informational queries generate a SERP snippet with a textual response, a few links to the source websites, and suggested follow-up questions. How-to queries generate similar results, but the information is often presented in the form of a list. Informational AI snippets may include images, such as the ones in the screenshot below. Source: https://twitter.com/lilyraynyc/status/1666107028178124801?cxt=HHwWgoC2xfjgmZ8uAAAA The fascinating thing about this example is that Google pulled Marie Haynes’ photos from her company’s Google Business Profile page. This shows that Google uses all sources of information out there, and then combines information pulled from multiple sources to generate the most helpful responses. Another interesting element that SGE tends to include in the snippet is quotes from GBP user reviews. This happens when you search for places like Google’s London office, Taj Mahal, or Search Labs. In most cases, the snippet will also include pictures, although Search Lab’s GBP profile evidently lacks them. Interestingly, a map is not included in these instances. Listicle-type informational queries Search queries that are best answered with listicle articles trigger a slightly different type of snippet, featuring a list of suggested solutions along with their short descriptions. Sometimes, this list of solutions can be combined with a textual response presented as a bullet list. Additionally, the snippet may include a map if SGE decides your query has a local context. Source: https://twitter.com/rustybrick/status/1661836977484734504 Interestingly, SGE has made changes over time, as the same query no longer shows the map and list of local businesses: Local queries Google often links to Google Maps when generating SGE responses for local search queries. Our research showed that local.google.com holds second place within the top 5 linked domains. It was linked to 2,356 times. Search queries that clearly indicate a local intent also generate snippets that look much like the Local Pack. However, these snippets can feature up to five listings, whereas a traditional Local Pack displays only three. AI snippets with only three listings were spotted as well: Ecommerce queries Ecommerce searches often result in snippets containing textual advice on selecting the desired product and a list of products that SGE deems suitable based on your requirements. Each listed product comes with a short description. As Lily Ray, SEO & Head of Organic Research at Amsive Digital, noted, these snippets may contain plenty of links to “top products” articles. On mobile devices, they’re placed at the bottom of the snippet: An interesting observation by Kevin Indig is that SGE appears to use user reviews to make specific product recommendations, such as identifying standing desks that are “good for home” or “good for tall people”: Source: https://www.kevin-indig.com/x-realizations-from-testing-search-generative-experience/ If your query combines commercial and informational search intents, you may see a snippet that looks like this: The snippet resembles those generated for informational queries but includes product images and links to the store (Please note that the screenshot above displays a brand store and not a reseller. Unfortunately, this isn’t always the case). It also appears that SGE will be integrated with the Merchant Center, allowing for more detailed information about suggested products and the list of stores it can be purchased from. For now, the feature doesn’t always work smoothly: Source: https://twitter.com/lilyraynyc/status/1663560571806167047 Do all search queries trigger a generative AI snapshot? The short answer is no. Cyrus Shepard managed to single out seven categories of search queries that do not trigger AI snippets: 1. Navigational queries like Facebook or Amazon, although there may be exceptions. 2. Quick Answers, such as weather forecasts or song lyrics. 3. Sensitive queries related to topics like “gender identity,” or “holocaust”. However, not all controversial topics are considered sensitive: 4. News and current events. 5. Recipes, which is a bit surprising. 6. NSFW/explicit/porn queries. 7. Many of the YMYL queries, such as searching for the “best credit card for poor credit score” or the “best place to buy ketamine” won’t display an AI snippet. Oftentimes, though, SGE would generate answers for queries that could be considered YMYL. It is happy to list “diaper rash symptoms”, and “mortgage rates”, give advice on how long copyright protection lasts and even offer advice on “whether headaches can be a sign of cancer”. On all occasions, SGE would add some sort of disclaimer stating that the information provided cannot be considered medical, financial, or legal advice. Source: https://www.kevin-indig.com/x-realizations-from-testing-search-generative-experience/ Source: https://twitter.com/rustybrick/status/1661845524549365762 Our latest research shows that long-tail keywords tend to trigger SGE snippets. Detailed search queries allow Google to generate more relevant answers. We also noticed that niche and topic had an impact. For example, Google is cautious about generating SGE snippets for niches and queries that can impact the well-being, health, or financial situation of its users. Messages you can get if AI search is not available Note that depending on the type of query, SGE may suggest that you “Get an AI-powered overview of this search” or it would state that “An AI-powered overview is not available for this search.” Here’s an example of some navigational and news searches where SGE believes that an AI response may not be the most relevant for the user, but it could still generate it if requested. Google likely assumes that an AI overview of the search would do no harm in such cases. Our research in January 2024 showed that 45.1% of keywords (45,111 out of 100,013) had a Generate button to produce SGE responses. In some cases that are particularly sensitive, SGE provides no message at all and offers a regular SERP instead: If you enter conversational mode, it will display a “Here are some results” message still not giving you the opportunity to generate an AI snippet: And in some cases, SGE may offer to generate an AI snippet, but then change its mind and display a “no AI overview is available” message: Which SERP results are cited and linked to in the generative AI snapshot? Maybe your first guess is that SGE uses top-ranking search results to generate AI snapshots, similarly to how it generates featured snippets. But based on what we can conclude from testing and research, this is not always the case. Our first analysis showed SGE snippets had around 28 links to other websites, with only 45% linking to the top 10 organic search results. But by January 2024, 85.5% of SGE snippets linked to at least one domain from the top 10 results. Google could also pull the AI response from websites that are not currently ranking high. This includes “smaller players” and even “random, questionable sites,” as Lily Ray puts it: Some good news about SGE for SEO, I guess, is that random, questionable sites – that most definitely weren’t ranking in top results before – somehow seem to be frequently selected as references in SGE answers…— Lily Ray 😏 (@lilyraynyc) June 2, 2023 SEO specialists offer theories explaining the reason for this, ranging from “SGE not using all the ranking systems that search uses when deciding what to look at” to assumptions that Google prioritizes content credibility “at the creator/author of content level.” Kevin Indig even suggests that it’s possible to reverse-engineer AI results. After clicking the links in the carousel, a user will land on a specific passage that Google used to form the AI snippet, which is a process that works similarly to featured snippets. By analyzing several SERPs, Kevin concluded that the unique angle of your content needs to match what the AI snapshot puts emphasis on. Kevin uses the “corporate credit card” SERP as an example, where, SGE focuses on building its response around the subject’s benefits and risks for businesses: Source: https://www.kevin-indig.com/x-realizations-from-testing-search-generative-experience/ In the snapshot above, you can see that the AI pulled the risks section of its response from the ExpenseAnywhere website, which ranks 26 in non-AI search results. The reason for this is that this particular content piece covered the specific angle that SGE was interested in: Source: https://www.kevin-indig.com/x-realizations-from-testing-search-generative-experience/ While the exact reasons for SGE’s selection of certain angles for certain topics are not currently known, spotting patterns that work in your industry with different types of queries can help you incorporate relevant information to your content and increase your chances of making it to the carousel. Are SGE search results personalized? In one of her tweets, Lily Ray reached out to Google to ask if SGE search results were personalized. Google’s response was a definite no. According to Google’s reps, the context of the whole conversation is taken into account and search results can vary depending on your previous queries. That being said, your previous search history will not impact the SERP. Where would Google Ads go? Google Ads are definitely not going anywhere. Google needs ads to make money and will eventually incorporate them into AI-generated snippets. In analyzing how ads appeared with text-based SGE snippets: Top SERP ads appeared 23.19% of the time Bottom SERP ads appeared 35.21% of the time. Shopping ads appeared 14.41% of the time. SGE snippets had no ads accompanying them 27.17% of the time. As indicated in a preview published on Google’s blog, ads will naturally blend into the SGE landscape just like how they fit into the non-AI search. But that is a development for the future. For now, as we are at the early stages of testing, Google Ads are not yet included in the AI snippets, and you can spot all sorts of SERP layouts, including: Google Ads placed above the AI snippet. Oftentimes, this means that the snippet was not initially there, but you clicked on the “Get an AI-powered overview of this search” button. While this placement was common during the first days of SGE testing, it is no longer as widespread. Google Ads placed below the AI snippet. Some SERPs do not include Google Ads but feature plenty of sponsored snippets in non-AI search results: In local searches, AI-powered SERPs do not contain sponsored links, while non-AI SERPs may have plenty of sponsored links: What will happen to existing SERP features, such as featured snippets? As of now, various SERP features, including featured snippets, are still part of the SERP. Interestingly, featured snippets were spotted to be positioned directly below the AI snippets, which may seem counterintuitive as both serve as quick summaries of the topic. We examined featured snippets and how they coexist with SGE snippets. The first results showed that almost a quarter of the queries that triggered SGE snippets with text also triggered featured snippets. In the provided screenshot, other familiar SERP features like the People Also Ask box and videos are still visible. The same goes for rich snippets, knowledge graphs, top stories, events, recipes, and other popular SERP features. However, some SEOs believe Google will eventually remove certain SERP features like featured snippets or local packs. This is because these features duplicate the information presented within the AI snippet and occupy SERP space for no justifiable reason. What does the SEO community think about SGE? Based on the poll conducted by Lily Ray on Twitter, the overwhelming majority of SEO experts are not impressed with what SGE has to offer: For those who have had a bit of time playing around with SGE, how much of an improvement (or not) do you think it is to Google search? (Pretend to not be SEOs for a sec, if possible)(Also imagine it will continue improving in quality ¯\\_(ツ)_/¯)— Lily Ray 😏 (@lilyraynyc) June 1, 2023 When excluding people willing to learn the survey results, only 12% of the respondents consider SGE to be a significant improvement to Google search. Reported bugs and concerns The new search functionality is seen as a potential threat to websites that invested a lot into increasing their visibility. However, this is only one among many reasons why SEO professionals are not that excited about the new search. An even bigger problem is the current functioning of the system in general. Surely, in every AI snippet it generates, SGE clearly emphasizes: “Generative AI is experimental, data quality may vary.” And we should bear that in mind while hoping that many of the things that are obviously faulty now will be fixed in the near future. Still, it’s important to highlight the many areas where SGE is currently struggling. Poor source attribution We already mentioned that unlike Bing, SGE doesn’t consistently or clearly attribute each statement to its rightful source. It also frequently fails to include the quoted article in the link carousel. This case reported by Brodie Clark was eventually rectified: Source: https://brodieclark.com/generative-ai-google/ But rectified or not, SGE using expert quotes and presenting them as general truth with no reference to the author isn’t a good look for SGE. This is not a right way to present information. In response to user tweets, Google claimed that SGE was an experiment and that they appreciated the feedback. They also noted that in the expanded view, source attribution becomes clearer. Missing links that lead to poor UX and lost traffic Despite the importance of links on the Internet, SGE doesn’t always link back to the websites, products, and services that it mentions in its AI responses. In the examples below, links to the suggested rank tracking tools and websites that offer SEO training are not clickable, which contributes to a poor experience for users. What concerns SEO specialists even more is that even if their website makes it to the AI snippet, they may not receive a fair share of traffic. This is because users have no option to click on the link and explore the suggested solutions in more detail. In the following example, you’ll notice that SGE not only fails to link back to the brand website, but even recommends buying a product from resellers instead: Source: https://twitter.com/lilyraynyc/status/1663561663189245952?cxt=HHwWgIDTxZmhlJYuAAAA Including clickable links to the products in the snippets, as demonstrated in the example below, would be way more user-friendly. After all, providing easy access to specific products is one of the main reasons why we place anchor links to website pages. Source: https://twitter.com/lilyraynyc/status/1663729663783456769?cxt=HHwWgsC-wY_U4JYuAAAA Confusing or false information You cannot fully trust AI, and Google’s AI-powered responses are no exception. For example, at one point, it recommended boiling the eggs for up to 60 minutes total: Source: https://twitter.com/CyrusShepard/status/1663423752863109121 Oftentimes, SGE struggles to align the AI snippet with the user’s intent, such as offering basic info about Caribbean cruises instead of presenting specific cruise options. Source: https://www.aleydasolis.com/en/search-engine-optimization/a-few-thoughts-on-my-initial-google-sge-experience/ In the next example, instead of offering recognized management training programs, SGE came up with a list of random local businesses, including one that offers CPR training: Source: https://twitter.com/lilyraynyc/status/1663556738900193283?cxt=HHwWhsDT3ciCkpYuAAAA And even though SGE is not supposed to handle sensitive YMYL questions, it sometimes attempts to do so, as shown in the example below: ⚠️Generative Search Experience shouldn’t active for things like air quality (imo)CC: @searchliaison pic.twitter.com/K4nZIdoZiP— Britney Muller 🇺🇦 (@BritneyMuller) June 7, 2023 On the bright side, Google’s white paper on SGE clearly states its dedication to providing “reliable, helpful and high-quality information,” with extra attention given to YMYL queries. So, let’s hope that once the model is better trained, there will be fewer instances of AI snippets spreading misleading information. When will the search generative experience go live? Google has not disclosed the exact date for the full-scale rollout of SGE. At first, users could see the ‘Ends Dec 2023’ label in Search Labs, so they speculated that the SGE experiment would end by December 2023. Source: https://www.seroundtable.com/google-search-generative-experience-ends-december-2023-35463.html But, as noted by Barry Schwartz, that label was removed at the end of December. No updates have been issued since then. Which industries/types of websites may benefit from the SGE rollout? It’s still too early to draw definitive conclusions about how exactly the SGE rollout will impact different SEO players. Many features are still in progress, and things are changing at a fast pace. Two weeks ago, we started opening up access to SGE. Since then, we’ve made a number of quality updates, including a major improvement that reduces the time it takes to generate AI snapshots by half! We hope everyone testing it out enjoys the speedier experience. If you haven’t…— Google SearchLiaison (@searchliaison) June 8, 2023 According to Lily Ray, SGE is yet too unstable to make definite predictions, though some queries are evidently more affected than others. Lily Ray SEO & Head of Organic Research at Amsive Digital Almost every category may be affected, but it’s impossible to know because SGE changes in appearance every day. Some days, it shows for almost all queries, including YMYL queries. Other days, it hardly shows up at all. But as it stands, it appears that SGE shows for most informational queries, most local/travel/restaurant queries, products and product reviews, many health and medical topics, wellness and relationships, tech, news, and much more. So far, it doesn’t appear to show consistently for recipes, controversial topics, highly political topics, weather or lyrics. Our recent research shows that Google prioritizes well-established and reputable sites. This can make it more difficult for smaller websites to gain visibility in SGE snippets. The most frequently linked websites in SGE are: Quora.com (3,701 links) Local.google.com (2,356 links) En.wikipedia.org (2,124 links) Investopedia.com (1,636 links) Linkedin.com (1,244 links) Topics that frequently appear in SGE snippets include broad subjects like: Food and Beverage Business Relationships Ecommerce and Retail Fashion and Beauty Google is cautious about generating SGE snippets for sensitive topics like news and politics, insurance, and finance. They require extensive verification and can be classified as YMYL (Your Money or Your Life) topics. Local businesses may get more traction According to Kevin Indig’s article on 11 realizations from testing SGE, “local reviews might actually get more traffic from Google based on the SGE beta.” Barry Schwartz, also mentioned local businesses as potential winners, stating: Barry Schwartz CEO of RustyBrick and News Editor at SEL So it is early but it seems like the local pack results went from 3 listings in the traditional Google search results to 5 listings in the new Google Search Generative Experience. So local businesses may get more visibility with this new experience. Ecommerce retailers can get more traffic from free product listings Brodie Clark suggests that ecommerce businesses proficient in managing their product feeds and using structured data have a chance to be featured in the free product listings within AI snapshots. An important observation by Kevin Indig is that these businesses should prioritize product, local and brand reviews, as AI heavily relies on user feedback. On the other hand, Aleyda Solis projects that product listing pages of established brand retailers may experience a decline in traffic, Google AI snippets take over that role. Moreover, big brands like Nike or North Face may also lose traffic to retailers selling their products since SGE doesn’t seem to favor brand manufacturer websites. Blogs covering informational queries may lose the lion’s share of traffic Anastasia Kotsiubynska believes that informational queries are the most vulnerable, especially queries answering who, what, and where questions. With SGE, a lot of users will get the necessary information directly from the SERP’s AI snippet without having to click on any links. Whenever the snippet provides insufficient information to users, the three visible websites in the top-right corner of the snippet may still get some organic traffic. Anastasia Kotsiubynska Head of SEO at SE Ranking Additionally, the top three websites located within the snippet are usually not the same as the top three ones from a regular organic search–and some of them aren’t even ranking in the top 10 or top 30 regular results. This spells new challenges for SEOs in understanding the new ranking principles, making it harder for them to get into the clickable space of SERPs. What SEO specialists can start doing now to prepare for the upcoming changes During the experiment phase of the search experience, gaining first-hand experience with it is crucial. This is expressed clearly in the following quote by Barry Schwartz: Barry Schwartz CEO of RustyBrick and News Editor at SEL Figure out a way to gain access to SGE, even if you are not in a supported country, maybe by using a proxy or VPN. You must play with it and see how it changes over time, because we all think at one point in time, this will replace the main Google.com transitional search results. So I recommend you play with it, if not daily, at least weekly, to see how your client queries will be impacted and what opportunities you can find there to rank well in the AI generative response. Anastasia Kotsiubynska suggests taking it one step further and to begin preparing your sites for the update: Anastasia Kotsiubynska Head of SEO at SE Ranking We can already check how the new SERPs for our focus queries will look, and analyze patterns like the structure of the snippet, including content structure of the top websites from the snippet. We can even start implementing some of the changes on our websites. Moreover, we should probably reconsider our goals in terms of organic traffic, aiming even more for highly relevant traffic that cannot be easily replaced by the snippet. SEO News SERP 5106 views Written by Svetlana Shchehel Svetlana is the Head of Content at SE Ranking. Her interests span across digital marketing, SEO, and translation. She regularly shares her expertise on the SE Ranking blog and across various marketing media. Svetlana believes that complex notions can be explained in plain words and loves creating immersive stories. Svetlana spends most of her evening hours learning new languages, planning memorable trips, and petting her cat.",
  "headers": [
    {
      "level": "H1",
      "text": "Inside Google’s SGE: Uncovering the Beta Version of AI-driven Search"
    },
    {
      "level": "H2",
      "text": "What is Google SGE?"
    },
    {
      "level": "H2",
      "text": "Insights from SE Ranking on the SGE snippet"
    },
    {
      "level": "H3",
      "text": "January 2024 SGE research results"
    },
    {
      "level": "H3",
      "text": "The first research results: Contrasting past and present findings"
    },
    {
      "level": "H2",
      "text": "How to get access to SGE through Search Labs"
    },
    {
      "level": "H2",
      "text": "How SGE differs from the current Google SERP layout"
    },
    {
      "level": "H3",
      "text": "General informational queries"
    },
    {
      "level": "H3",
      "text": "Listicle-type informational queries"
    },
    {
      "level": "H3",
      "text": "Local queries"
    },
    {
      "level": "H3",
      "text": "Ecommerce queries"
    },
    {
      "level": "H2",
      "text": "Do all search queries trigger a generative AI snapshot?"
    },
    {
      "level": "H3",
      "text": "Messages you can get if AI search is not available"
    },
    {
      "level": "H2",
      "text": "Which SERP results are cited and linked to in the generative AI snapshot?"
    },
    {
      "level": "H2",
      "text": "Are SGE search results personalized?"
    },
    {
      "level": "H2",
      "text": "Where would Google Ads go?"
    },
    {
      "level": "H2",
      "text": "What will happen to existing SERP features, such as featured snippets?"
    },
    {
      "level": "H2",
      "text": "What does the SEO community think about SGE?"
    },
    {
      "level": "H2",
      "text": "Reported bugs and concerns"
    },
    {
      "level": "H3",
      "text": "Poor source attribution"
    },
    {
      "level": "H3",
      "text": "Missing links that lead to poor UX and lost traffic"
    },
    {
      "level": "H3",
      "text": "Confusing or false information"
    },
    {
      "level": "H2",
      "text": "When will the search generative experience go live?"
    },
    {
      "level": "H2",
      "text": "Which industries/types of websites may benefit from the SGE rollout?"
    },
    {
      "level": "H3",
      "text": "Local businesses may get more traction"
    },
    {
      "level": "H3",
      "text": "Ecommerce retailers can get more traffic from free product listings"
    },
    {
      "level": "H3",
      "text": "Blogs covering informational queries may lose the lion’s share of traffic"
    },
    {
      "level": "H2",
      "text": "What SEO specialists can start doing now to prepare for the upcoming changes"
    },
    {
      "level": "H2",
      "text": "You might be interested"
    }
  ],
  "author": "Svetlana Shchehel"
}