{
  "url": "https://seranking.com/blog/japan-ski-experience-case-study/",
  "slug": "japan-ski-experience-case-study",
  "title": "Japan Ski Experience: 6x Visibility & 20x Rankings Boost with SEO",
  "description": "Japan Ski Experience’s PPC to SEO move resulted in 6x higher search visibility and 20x more top 5 keyword rankings. Explore the tactics behind their success.",
  "content": "Blog / Case Studies / From PPC to SEO: How Japan Ski Experience Boosted Search Visibility by 6x and Top 5 Keyword Rankings by 20x From PPC to SEO: How Japan Ski Experience Boosted Search Visibility by 6x and Top 5 Keyword Rankings by 20x Written by Anna Postol May 22, 2024 11 min read Client Japan Ski Experience (JSE) is a UK-based company specializing in ski holidays to Japan. Launched in 2008, Japan Ski Experience initially targeted UK-based skiers and snowboarders. However, by offering ground arrangements in Japan, they attracted site visitors from all over the world. This included visitors from countries like Australia, the United States, Hong Kong, and Singapore, which later became the company’s primary markets. A few words about the company’s background and the factors driving its decisions: Japan Ski Experience was founded by Lindsay Colbert and Ben Thorpe. Originally from the UK, both Lindsay and Ben worked as English teachers in Niigata prefecture, where they developed a passion for skiing and snowboarding in Japan and later sought to share that passion with others. The timing was perfect, as major Japanese ski resorts had just begun to develop for international tourism. The pair then launched their company, Japan Ski Experience, as ATOL-licensed Japan ski holiday tour operators in the UK. Unfortunately, the 2008 financial crisis made focusing on the UK market alone (where the yen doubled in value against the pound in their first year of trading) untenable. The team utilized the online nature of the business to reach a broader international market. This worked well and enabled modest growth in the company’s intervening years. The company also faced some major challenges when the COVID-19 pandemic hit. Before the pandemic, Japan Ski Experience’s marketing efforts leaned heavily on Google Ads. While this Pay-Per-Click (PPC) strategy brought in high traffic volumes that converted well into leads, it also represented their biggest overhead aside from staff costs. When the pandemic forced Japan to close its borders from March 2020 to October 2022, Japan Ski Experience faced 2.5 years without bookings. This prompted the company to reassess its marketing strategy, as it needed to find a more cost-effective approach to reduce overheads and mitigate the risk of uncertain border openings and closings. Managing director Lindsay Colbert reflected on the situation: Lindsay Colbert Managing Director of Japan Ski Experience The marketing budget was of particular concern, both because finding a budget of the size required was going to be challenging after years of financial hardship, and because of the risk that borders would open and close again, creating uncertainty of a type that had not existed before the pandemic. The risk of spending money on leads that might never materialize was too high. So finding a way to market the business at a reduced cost became a necessity. During those 2.5 years, it became clear that the answer lay in SEO. By optimizing the company’s website, those leads that had proved such a big expense in the past could be gained for free. It was going to take a lot of work, but time, for once, was on our side. Goals Faced with rising PPC costs, JSE shifted gears and focused on organic traffic growth through SEO. The company’s overall goals included: Reduce dependence on costly PPC through SEO. Educate team members on both the SEO field and the SE Ranking platform. Build a new, fast, and user-friendly WordPress website to serve as a solid foundation for the company’s SEO efforts. Find target-worthy keywords. Optimize specific pages and on-page content for targeted keywords. Discover new backlinks and identify toxic links for removal. Steps taken to reach these goals SE Ranking subscription and SEO education With the primary goal of reducing the budget spent on costly PPC advertising, Japan Ski Experience made a strategic decision to invest in SEO education and tools. This was largely due to the team’s need to overcome the challenges posed by the pandemic. The company chose to sign up for SE Ranking’s Pro Plan, which gave it access to a comprehensive suite of SEO tools. During a reduced booking period, the JSE team leveraged an opportunity to upskill their staff in SEO fundamentals. JSE decided to allocate time otherwise spent on handling bookings to learning SEO essentials. The company achieved this through SE Ranking’s Academy courses. This enabled JSE to make productive use of downtime and equip the team with the knowledge and skills needed to develop and execute an effective SEO strategy. Website migration to WordPress The Japan Ski Experience team soon realized their existing website posed a significant obstacle to their SEO efforts. The clunky site, tightly integrated with the reservations system, offered limited opportunities for SEO improvements. As a result, JSE’s original site failed to meet Google’s standards for speed and simplicity, which are crucial search ranking factors. Realizing that their SEO success depended heavily on solving these website issues, the team boldly invested in a custom site. This move carried financial risks, but the potential SEO benefits outweighed them. To build this website, the team chose WordPress, a well-known content management system (CMS) valued for its flexibility, extensive customization options, and reputation for being an SEO-friendly CMS. These benefits aligned perfectly with the team’s focus on creating a website that prioritizes speed, user-friendliness, and SEO. The team created a custom API to link the new WordPress website with their reservation software. This would ensure a smooth transition and maintained functionality. This integration allowed customers to browse and book ski packages without disruption. Keyword research and analysis With JSE’s new and improved website, the company shifted its attention to keyword research and analysis, the cornerstone of any successful SEO strategy. The team then used SE Ranking’s Keyword Research tool to achieve their next goal. This tool helped the team identify high-volume, low-competition keywords aligned with their business offerings and target audience. For example, the team discovered that the keyword “Japan Ski Resorts” had a high search volume (3.2K) but relatively low competition (33 out of 100), making it an attractive target for their SEO efforts. DO KEYWORD RESEARCHEnter a search term and find untapped keyword opportunities to make your site more visible in search.Analyze Further analysis showed that JSE’s existing “Japan ski resorts” page already ranked for some long-tail keywords – “ski resorts near Tokyo.” Long-tail keywords are more specific, often longer phrases of 3+ words that tend to have clearer search intent and higher conversion rates (due to their specificity). The challenge, however, was managing the company’s sub-optimal ranking positions for these keywords. For instance, JSE held the 31st position for “Japan ski resorts” and the 19th for “Japan ski resorts near Tokyo.” These positions were also unlikely to drive significant traffic or conversions. Japan Ski Experience didn’t rely solely on keyword research tools. The team also used SE Ranking’s Competitor Analysis tools to peek behind their competitors’ curtain and gain insights into their strategies. By analyzing the Organic Traffic Research report, the JSE team could see which keywords their competitors were ranking well for. They also used this information to evaluate their chances of ranking for those terms. DO COMPETITIVE RESEARCHWho are your closest rivals and how do they position themselves in search? It's time to find out.Analyze Content and on-page optimization Armed with keyword research insights, the team decided to make their next strategic decision: 1. Optimize the Japan ski resorts page for the primary keyword “Japan ski resorts” 2. Create a new page targeting the long-tail keyword “ski resorts near Tokyo” As the JSE team optimized their existing content and created new pages for the new WordPress website, they relied heavily on SE Ranking’s On-page SEO Checker. JSE found this tool particularly useful for identifying areas of improvement in on-page SEO elements for pages that underperformed for important keywords. RUN AN ON-PAGE SEO CHECKGet SERP-backed tips to outrank competitorsTRY NOW The SEO Checker provided actionable insights and recommendations on optimizing various page aspects, including title tags, meta descriptions, header structure, image alt text, page content, keyword density, user experience, and more. One of the most helpful features was how the tool categorized SEO tasks into high, medium, and low priority. This enabled Japan Ski Experience to prioritize critical issues first. Backlink monitoring Building backlinks was another top priority for Japan Ski Experience. The team knew that obtaining high-quality backlinks would significantly impact their rankings and establish their new content as a trusted resource. The JSE team used SE Ranking’s Backlink Gap Analyzer to access various kinds of information about backlinks. Most notably, it allowed them to identify valuable backlink opportunities acquired already by their competitors. By comparing their backlink profile with that of their competitors, JSE could discover untapped link sources. The tool allowed JSE to sort the results by Domain Trust, making it easy to pinpoint the most valuable and authoritative backlinks. By visiting these URLs, the team could better understand each link’s nature and assess whether they could replicate a similar backlink for their website. Plus, SE Ranking’s Backlink Checker recently introduced toxic link reports. This helped Japan Ski Experience identify toxic (low-quality links) that could potentially harm their search rankings. According to the team’s latest report, they discovered 5 highly toxic backlinks in their profile. CHECK ANY SITE'S BACKLINKSCheck which domains link out to any website and get ideas for enhancing your backlink profile.Analyze SE Ranking made it simple for Japan Ski Experience to address this issue. JSE downloaded a list of toxic links directly from the SE Ranking software and then uploaded them to Google’s Disavow tool. By proactively removing these “bad apples,” Japan Ski Experience maintained a clean and trustworthy link profile, an essential step towards maintaining good standing with search engines and achieving better rankings. The team also used the tool to peek at their rivals’ backlink profiles. This helped them discover high-quality, relevant websites linking to competitors but not to them. It also helped them find clearer outreach targets. By implementing these strategies (monitoring, acquiring, and strategically targeting backlinks) with the help of SE Ranking’s powerful toolset, Japan Ski Experience built a robust and diverse backlink profile. Results Now, let’s move on to the most intriguing part. When Japan Ski Experience started the project in the latter part of 2022, 3% of its target keywords occupied top 5 positions and its overall search visibility was rated at 10.7. So, prior to using SE Ranking, the company had: 3% of target keywords in top 5 positions. An overall search visibility of 10.7. A year and a half after using SE Ranking for SEO, their search visibility has risen to 61.2, with 59% of their target keywords in top 5 positions. After: 59% of target keywords in top 5 positions Overall search visibility – 61.2 Both keywords “Japan ski resorts” and “Ski resorts near Tokyo” shot up in the rankings. This also led to a significant increase in traffic for these keywords. Prior to using SE Ranking, the company was in: The 31st position for “Japan ski resorts” The 19th position for “Ski resorts near Tokyo” After leveraging the platform’s tools, the company is in: 2nd position for “Japan ski resorts” Below is the traffic increase over time for this keyword: 1st position for “Ski resorts near Tokyo” The graph below shows the traffic increase for this keyword (the peak indicates the search’s seasonal nature): SEO is an ongoing task, and Japan Ski Experience still has plenty of potential to unlock. But today, the JSE team is confident that they have everything they need to continue making great SEO strides. Most importantly, they have managed to make the business fully independent of costly PPC ads without compromising the number of leads. Takeaways Japan Ski Experience’s story is a testament to the importance of being flexible and embracing change, especially during volatile times. The JSE team took the time to learn about SEO, used the right tools, and improved their website’s speed and ease of use. JSE is now able to rely less on expensive advertising and attracts more customers naturally through online searches. JSE’s journey serves as an inspiration for other businesses facing similar difficulties. It shows that by being strategic with SEO, companies can tackle obstacles and emerge stronger on the other side. Here are some SE Ranking tools that played a crucial role in helping Japan Ski Experience achieve its SEO goals: Keyword Research: Helped the company find relevant, high-volume and low-competition keywords, laying the foundation for their content optimization efforts. Competitor Research: Gave insights into competitors’ strategies and uncovered new keyword opportunities. On-page SEO Checker: Provided recommendations to optimize content, titles, descriptions, and more for higher search rankings. Backlink Checker and Backlink Gap Analyzer: Helped Japan Ski Experience compare its backlink profile with those of its competitors, identify new link-building opportunities, and discover and remove toxic links. If you’re facing similar challenges or want to improve your SEO efforts, give SE Ranking’s powerful suite of tools a shot. Overcome any obstacle and achieve your SEO goals with our latest updates and comprehensive features. Start your 14-day free trial today! Backlink Profile Keyword Research SE Ranking Tools 3514 views Written by Anna Postol Anna Postol is a content marketer at SE Ranking, where she finds joy in creating content for SEO, digital marketing, and social media. Her focus is on writing accurate, easy-to-digest, informative pieces that turn complex topics into engaging narratives that resonate with readers. Outside of work, she enjoys stretching exercises, workouts, planning her next travel adventure, and spending time with her beloved cat-daughter.",
  "headers": [
    {
      "level": "H1",
      "text": "From PPC to SEO: How Japan Ski Experience Boosted Search Visibility by 6x and Top 5 Keyword Rankings by 20x"
    },
    {
      "level": "H2",
      "text": "Client"
    },
    {
      "level": "H2",
      "text": "Goals"
    },
    {
      "level": "H2",
      "text": "Steps taken to reach these goals"
    },
    {
      "level": "H3",
      "text": "SE Ranking subscription and SEO education"
    },
    {
      "level": "H3",
      "text": "Website migration to WordPress"
    },
    {
      "level": "H3",
      "text": "Keyword research and analysis"
    },
    {
      "level": "H3",
      "text": "Content and on-page optimization"
    },
    {
      "level": "H3",
      "text": "Backlink monitoring"
    },
    {
      "level": "H2",
      "text": "Results"
    },
    {
      "level": "H2",
      "text": "Takeaways"
    },
    {
      "level": "H2",
      "text": "You might be interested"
    }
  ],
  "author": "Anna Postol"
}